{
    "Any advice on my first king bed?": {
        "title": "Any advice on my first king bed?",
        "score": 4,
        "url": "https://www.reddit.com/r/Mattress/comments/1dr3n8h/any_advice_on_my_first_king_bed/",
        "content": "Finally going to pull the trigger on a new bed. I am upgrading to a king bed and will need the whole setup. It is just for my wife and I. I don’t really have a budget in mind just want something great that will last. Seeing a lot of ads for nectar for pretty cheap. Makes me wonder why. What are the brands I should be looking at?  Any suggestions are appreciated. Thank you. ",
        "num_comments": 8,
        "comments": [
            "you can buy a king bed and two twinxl mattress",
            "Nectar is generally considered one of the main [brands to avoid](https://www.reddit.com/r/Mattress/comments/qo3t73/lets_talk_about_brands_to_avoid/) around here. They make a cheap mattress sourced out of China and they are not consistent with suppliers. Just google opinions of Nector on Reddit and you have to search hard to find the positive mentions. Just countless people pissed off their mattress shed fiberglass all over their room and started sagging after 6 months.",
            "Nectar is super poor quality. Online bed-in-a-box brands are all pretty meh in my opinion. I personally believe that you can get a wayy better quality mattress at lower cost by buying local.\n\nWhen I say local, I don’t mean mattress firm (which also blows). Find some family run operation or a local mattress factory. They don’t need to have a slick e-commerce site. They don’t need to advertise any copper-infused graphite crystal diamond foam BS. Local made mattresses don’t have freight costs baked into the price either.\n\nI really really encourage you to go check out a local mattress company. It’s the better value when it comes to mattresses.",
            "It's hit or miss. Some people love them, others hate them. Try it before you buy.",
            "So basically none of the online mattress companies are trustworthy? Is their one that might be reputable? Ugh I feel like they all have the same interface on their site I’m like overwhelmed but confused at the same time. I don’t wanna spend $1500+ and get ripped off.",
            "It’s not like they’re scams. But I don’t think they’re a great value in general. Free nationwide shipping costs $$. Marketing teams and fancy branding costs $$. Etc etc.\n\nThere are tons of options out there. Fortunately most all of them have solid return policies. \n\nI’d still maintain that local is the better route for mattresses.. you can try out the mattress, it will likely be a superior construction (it doesn’t need to compress into a box), and it will likely be cheaper.\n\nI tried a handful from Costco, purple, mattress firm, etc. and ended up going with some local mattress store. Their website looked like it was from the 90s. Zero instagram ads. It was some old-school 3rd or 4th generation family operation. It ended up being exactly what I was looking for. I was willing to spend upwards of $4-$5k for a mattress and I ended up spending $2k for my ideal king size.\n\nIf I did online, I’d look through this list: \n\nhttps://mattressunderground.com/the-underground/our-trusted-members",
            "Thank you so much for the thoughtful reply. Gonna check out the link you sent! Will likely try to get into a physical store but not a mattress firm or store like that lol",
            "Of course. Obviously location plays a big influence on options though. Are you in a midsize/major metro area?"
        ]
    },
    "Found my bed and sleep system! Thank you ": {
        "title": "Found my bed and sleep system! Thank you ",
        "score": 8,
        "url": "https://www.reddit.com/r/Mattress/comments/1dqzwlc/found_my_bed_and_sleep_system_thank_you/",
        "content": "I’m a back and side hot sleeper \nMattress: Beauty Rest Black series 3 firm from MF: Good on my back, sleeps cool, a little firm for my shoulder \nPillow: Sleepys deluxe charcoal cool low\nTopper: Futon Shop royal horse & camel hair and wool\nSheets: JC Penny percale Madison Park and one Oeko-Tex H\nBlanket: 100% cotton Pom Pom Nordstrom\nMattress protector: SIJO eucalyptus Amazon\nFan: small (3-4 inches), quiet, rechargeable blowing across bed on low. ",
        "num_comments": 6,
        "comments": [
            "Congratulations!",
            "🙌👏🥳 is that Beautyrest one of the New Black Series? Happy for you and love all the details - also now you'll have plenty of time to find my system. Ha",
            "💃Yes! Ha, and it wasn’t the one I thought I’d end up with. I went in looking at a lower model medium. Then liked the firm better. Tried out the black medium just for kicks because I had read about it. Seemed soft. Jumped on the firm and was surprised how much I liked it.",
            "Fantastic! How long have you been on it? You'll have to keep us updated...",
            "The mattress has been a month. The topper only a week. 🤞hopefully it lasts!",
            "Yes good luck!"
        ]
    },
    "Suggestions for a natural mattress that does not contain latex?": {
        "title": "Suggestions for a natural mattress that does not contain latex?",
        "score": 3,
        "url": "https://www.reddit.com/r/Mattress/comments/1dr3rf0/suggestions_for_a_natural_mattress_that_does_not/",
        "content": "We are looking for a new mattress and I really would like to get a more natural mattress this time. My partner is severely allergic to latex, his employer even has to order nitrile gloves special just for him as they use latex gloves at his job. We cannot bring latex into the house. That being said, what are my options for a “natural” mattress? Are there any brands that don’t put latex in their mattresses? I know they have all-wool mattresses and all-cotton ones but people say those are super firm. Does anyone have any brands or suggestions of mattresses with no latex? ",
        "num_comments": 2,
        "comments": [
            "https://beloitmattress.com/mattress-type/innerspring/classic-orthopedic-tufted/\n\nhttps://beloitmattress.com/mattress-type/innerspring/somnolent-pure-balance-plush/",
            "Naturpedic makes latex free options.  I don't personally have any experience with them but have looked at one on line for a friend with a latex allergy.  Think you have to hunt for the latex free option on the specific mattress model page."
        ]
    },
    "I’m an every side sleeper and don’t know what to do": {
        "title": "I’m an every side sleeper and don’t know what to do",
        "score": 2,
        "url": "https://www.reddit.com/r/Mattress/comments/1dr4nbr/im_an_every_side_sleeper_and_dont_know_what_to_do/",
        "content": "I sleep in every position. Maybe it’s my mattress, which I did and have historically purchased on amazon. (Yes I now understand this was a mistake given my now back issues). My question is how do I go about buying a quality mattress suited for me when I don’t know what firmness or lack thereof that fits my sleep needs? \n\nEdit: to clarify, I’ve never bought a mattress from an actual store or a “reputable” vendor that I can recall. I just know I have back pain issues, but I don’t know if my back prefers hard or soft mattresses, and I also don’t know how to gauge that. ",
        "num_comments": 1,
        "comments": [
            "Combo sleepers have the most difficult time mattress shopping because they need a mattress that is soft enough to provide enough pressure relief for sleeping on their side, while also firm enough so that they dont develop back pain from poor spinal alignment while sleeping on either their back and/or stomach. Stomach sleeping requires the firmest of the three, and is generally not a recommended sleep position because of the stress it puts on your back, neck, and spine. \n\nThe best route to go is to lay down on mattresses at a store, and figure out what firmness level works best for you. This will take a good amount of time because you need to give each sleep position enough time to feel pressure point issues arising or tightness developing on your back."
        ]
    },
    "Tempurpedic pillow - heaven until not??": {
        "title": "Tempurpedic pillow - heaven until not??",
        "score": 1,
        "url": "https://www.reddit.com/r/Mattress/comments/1dr69v0/tempurpedic_pillow_heaven_until_not/",
        "content": "Hi, I shelled out for a tempurpedic pillow as recd by my chiropractor. At first it was a MIRACLE. But then one day I woke up with ABSURD back pain, as if I had been weight lifting all night. My muscles were sore for a week. This, or some version of it, tends to happen now whenever I sleep on it. Does anyone else have this problem? Why is it so amazing and then suddenly it’s hell??",
        "num_comments": 0,
        "comments": []
    }
}