{
    "Fallout: A World on Fire": {
        "title": "Fallout: A World on Fire",
        "score": 239,
        "url": "https://youtu.be/06GI06NCC60?si=2HDogFj3AG84wIF9",
        "content": "",
        "num_comments": 383,
        "comments": [
            "As someone who's enjoyed watching the show despite recognizing that it had a ton of flaws, I was kinda worried when I read the comments here saying the Mauler's video was a misfire. \n\nI agree with pretty much every point he makes in the video. \n\nIt feels like a lot of people who enjoyed the show are having difficulty accepting that the despite being fun, the writing is pretty awful when it comes to any level of logical consistency. And so much of the plot depends on characters being incredibly dumb.",
            "the yao guai was 10/10",
            "Was such a cathartic video.",
            "This show definitely thrives on the \"rule of cool\" and nostalgia toward the games. Everything that happens is a pretense to put explosions, gore, or easter eggs on the screen.  Why did Muldaver send in a bunch of raiders to get high on chems and murder anyone they saw when she had a very specific objective that involved kidnapping a man (who could have easily died in the raid)? Because they wanted Mad Max extras to shoot people with guns. Why did the fusion reactor light up most of LA despite it being nuked like 50 times and left to crumble for centuries? Because it would look cool. Why did Muldaver keep Lucy's mom even though she was mostly decomposed and beyond all redemption? Because zombies look cool.\n\n  \n\nUnfortunately, that's enough to seduce a huge audience. It's all incredibly stupid, and it didn't need to be.",
            "The response to the Fallout show has convinced me that if Master Chief just kept his helmet on and said a line from the games every other scene half of the Halo show's dissenters would call it a masterpiece of television.",
            "Great video.",
            "The Fallout Fandom owes Longman its eternal gratitude.",
            "Amazing video; for a west coast fallout fan it was an incredible experience to watch Mauler talk about all the lore issues and the way bethesda handle the franchise after we got harassed and gaslighted that this is how fallout was always about. Thanks to all the lore guys for helping in making this review.",
            "buddy's gonna watch mister bean next and complain about him being retarded like it's some sort of discovery",
            "I'm enjoying it so far but I haven't played the games so I'll respect you guys if you're not a fan of it, I hated the HBO last of us show because of how inaccurate it was"
        ]
    },
    "EFAP #290 – The Acolyte is a special mess & How does that canon thing work?": {
        "title": "EFAP #290 – The Acolyte is a special mess & How does that canon thing work?",
        "score": 19,
        "url": "https://www.youtube.com/live/tjcAlPphlZY?si=ONm6qzcAXb7H86FH",
        "content": "",
        "num_comments": 5,
        "comments": [
            "I genuinely feel completely indifferent to Star Wars. Don’t hate it but don’t like it either. I definitely feel for people who do enjoy it though, there’s enough context to know Star Wars has been butchered.\n\nAlso, felt like Rags was jumping on Marc a lot this episode. Might have just been misinterpreting banter however.",
            "Quick question, don't want to make a separate post for this. During BBC, MauLer said there was a coordinated attack on his channel for some \"reel\" or \"compilation\" video. Who has the deets on this?",
            "Hm this all seemed quite lucid.",
            "Yeah I was huge into Star Wars but lost all interest in it after tlj, tfa was the death and tlj was the desecration of the grave",
            "Same. Still love star wars \"gear porn\". But now, everything else is ... meh? Couldn't care less. Andor might be good, I guess?"
        ]
    },
    "\"Discoarse\" by Ryandla Kinelberg feat- Nerdrotic ": {
        "title": "\"Discoarse\" by Ryandla Kinelberg feat- Nerdrotic ",
        "score": 47,
        "url": "https://v.redd.it/hv78ddco9g9d1",
        "content": "It's official. Pierry Chan needs to be arrested for war crimes for creating this nightmare fuel...🤣 ",
        "num_comments": 12,
        "comments": [
            "![gif](giphy|84BjZMVEX3aRG)",
            "The amount of cursed content that Pierry Chan has given to us is hilarious. Also they better have an FNT album in the works or I'll be disappointed.",
            "\"They can't create, they can only distort\"",
            "I truly hope this will go viral, but I fear it’s just too much.",
            "I wanna see Mauler and Rags make a version.",
            "dear god",
            "Why does she dance like a 4 year old trying to copy an actual dancer on tv?",
            ">The amount of cursed content that Pierry Chan has given to us is hilarious\n\nI'm reasonably convinced he's some sort of Cenobite at this point...\n\nhttps://i.redd.it/hw8pk9b44h9d1.gif",
            "I dunno, Ryan's choreography was pretty tight there...😂",
            "Personally? I just hope it upsets the clowns over in Krayt.😀"
        ]
    },
    "So what is everyone’s favourite show": {
        "title": "So what is everyone’s favourite show",
        "score": 163,
        "url": "https://i.redd.it/panpqf7utd9d1.jpeg",
        "content": "My top 5 goes like this\n5. This Is England 86-90\n4. Banshee\n3. Save Me\n2. Boardwalk Empire\n1. The Leftovers \n\nLemme know your guys top 5 and if you’ve seen any of these shows, it’s hard to find people that have seen them and can discuss it as well ",
        "num_comments": 178,
        "comments": [
            "1. Breaking Bad \n\n2. The Sopranos \n\n3. Sons of Anarchy \n\n4. Cowboy Bebop \n\n5. Arcane",
            "Legend of the Galactic Heroes\n\nFuturama\n\nSmiling Friends\n\nSeinfeld\n\nCurb your Enthusiasm \n\nRome \n\nFirefly \n\nJust to name a few",
            "Toradora",
            "I can't really decide on which shows are the best, but these are among the best shows:\n\n* Chernobyl\n* Firefly\n* Game of Thrones\n* Band of Brothers\n* The Expanse\n* Clarkson's farm (Favorite \"reality\" show)\n* Steins;Gate (Best Anime I've watched)\n* Spice and Wolf (Enjoyable slice of Life anime to chill with)",
            "The Sopranos spin off that took place in Mexico, some strange plot points but overall good show.\n\nhttps://preview.redd.it/fx40aed7zd9d1.jpeg?width=1078&format=pjpg&auto=webp&s=51340324422b673cda7ea31f9b22b895934d5c15",
            "Boardwalk Empire (I see you OP! Criminally underrated since it ended)\n\nYour Honor\n\nPeaky Blinders\n\nHouse of the Dragon\n\nArcane\n\nFirefly\n\nHaunting of Hill House\n\nAndor\n\nBetter Call Saul\n\nStargate SG-1\n\nHandmaid’s Tale (It has plenty of flaws but I still think portrays the depravity, complicity, and terrible choices of a totalitarian regime well, some scenes are downright good for teaching historical lessons)\n\n30 Rock\n\nScrubs",
            "In no particular order, the first five to pop in my head:\n\n1. One Piece (anime)\n\n2. Band of Brothers (HBO)\n\n3. Stargate SG-1 \n\n4. Buffy\n\n5. Firefly \n\nThere are a bunch more that could fight for these spots, but if I had just these shows to rewatch for the rest of my life I think I'd be pretty satisfied.",
            "Millennium, The First Wave, X-files for suspense. Miami Vice, MacGyver for action\n\nand Magnum PI as honorable mention",
            "1. BCS\n2. The Wire\n3. Always Sunny\n4. Full Metal Brotherhood\n5. Arrested Development (the first 3 seasons at least) \n\nYeah i have pretty vanilla favorites but they are successfull for good reason.",
            "I'll give you two lists.\n\nLive-Action:\n\n1. Stargate SG-1\n2. Golden Girls\n3. CSI: Crime Scene Investigation\n4. Smallville\n5. Sabrina: The Teenage Witch\n\nAnimation:\n\n1. Batman: The Animated Series\n2. Avatar: The Last Airbender\n3. Naruto/Naruto:Shippuden\n4. Code Geass\n5. Mobile Fighter: G-Gundam"
        ]
    },
    "If this is the Rey movie, Lucasfilm might as well throw in the towel because even reaching 300M at the box office would be considered a stretch": {
        "title": "If this is the Rey movie, Lucasfilm might as well throw in the towel because even reaching 300M at the box office would be considered a stretch",
        "score": 72,
        "url": "https://i.redd.it/4bjh5r92ee9d1.jpeg",
        "content": "",
        "num_comments": 20,
        "comments": [
            "I mean who believes it will ever actually see the light of day?",
            "I’ve seen some stuff saying this isn’t totally accurate, and it’ll probably change in the years before release even if it’s true, but it would be oddly cathartic to watch Dune bury a Disney Star Wars movie ",
            "Oh nooooo, whichever will I choose?\n\n-_-",
            "Can be the rey movie right? They don't even have a script",
            "I had heard he was doing Rendezvous with Rama after Dune.  I really hope he doesn't bail on that for Star Wars.",
            "Who the fuck is gonna choose the rey movie over Dune lmao",
            "Please let this happen 🙏🙏🙏🙏",
            "I know it's a long shot, but please let this happen",
            "I’m pretty sure the Rey movie is busy at this point.",
            "imagine being this delusional, Lisan Al ghaib will stomped rey like the ant she is"
        ]
    }
}