{
    "Fallout: A World on Fire": {
        "title": "Fallout: A World on Fire",
        "score": 240,
        "url": "https://youtu.be/06GI06NCC60?si=2HDogFj3AG84wIF9",
        "content": "",
        "num_comments": 383,
        "comments": [
            "the yao guai was 10/10",
            "Was such a cathartic video.",
            "The response to the Fallout show has convinced me that if Master Chief just kept his helmet on and said a line from the games every other scene half of the Halo show's dissenters would call it a masterpiece of television.",
            "The Fallout Fandom owes Longman its eternal gratitude.",
            "Amazing video; for a west coast fallout fan it was an incredible experience to watch Mauler talk about all the lore issues and the way bethesda handle the franchise after we got harassed and gaslighted that this is how fallout was always about. Thanks to all the lore guys for helping in making this review.",
            "buddy's gonna watch mister bean next and complain about him being retarded like it's some sort of discovery",
            "I'm enjoying it so far but I haven't played the games so I'll respect you guys if you're not a fan of it, I hated the HBO last of us show because of how inaccurate it was",
            "Great, 40 minutes before I have to run a pathfinder game. Guess this will keep me up late tonight.",
            "I don't understand how this show has actual fanboys, even defending it in this very thread. Like, it doesn't respect itself or the audience. It's basically James Gunn's \"Suicide Squad\", except cringe, boring, cheap, lame and predictable. It's made by Amazon, Todd Howard and the chick who wrote \"Captain Marvel\". What the fuck is wrong with you, people? Do you unironically love Bethesda's Fallout so much that you're willing to like the show because nothing else exists? Or is it the same case as with \"Matrix Resurrections\", where you think that everything wrong with the movie is terrible on purpose and people just don't get its deep meta-irony?",
            "This video was incredible. I stopped watching fallout after 2 episodes. All the positive responses made me feel like I was missing something. I definitely wasn’t."
        ]
    },
    "EFAP #290 – The Acolyte is a special mess & How does that canon thing work?": {
        "title": "EFAP #290 – The Acolyte is a special mess & How does that canon thing work?",
        "score": 17,
        "url": "https://www.youtube.com/live/tjcAlPphlZY?si=ONm6qzcAXb7H86FH",
        "content": "",
        "num_comments": 5,
        "comments": [
            "I genuinely feel completely indifferent to Star Wars. Don’t hate it but don’t like it either. I definitely feel for people who do enjoy it though, there’s enough context to know Star Wars has been butchered.\n\nAlso, felt like Rags was jumping on Marc a lot this episode. Might have just been misinterpreting banter however.",
            "Hm this all seemed quite lucid.",
            "Yeah I was huge into Star Wars but lost all interest in it after tlj, tfa was the death and tlj was the desecration of the grave",
            "Same. Still love star wars \"gear porn\". But now, everything else is ... meh? Couldn't care less. Andor might be good, I guess?",
            "Quick question, don't want to make a separate post for this. During BBC, MauLer said there was a coordinated attack on his channel for some \"reel\" or \"compilation\" video. Who has the deets on this?"
        ]
    },
    "\"Discoarse\" by Ryandla Kinelberg feat- Nerdrotic ": {
        "title": "\"Discoarse\" by Ryandla Kinelberg feat- Nerdrotic ",
        "score": 152,
        "url": "https://v.redd.it/hv78ddco9g9d1",
        "content": "It's official. Pierry Chan needs to be arrested for war crimes for creating this nightmare fuel...🤣 ",
        "num_comments": 23,
        "comments": [
            "The amount of cursed content that Pierry Chan has given to us is hilarious. Also they better have an FNT album in the works or I'll be disappointed.",
            "Oh man, you know the usual suspects are going to be coping and seething when they see this 😂",
            "Why does she dance like a 4 year old trying to copy an actual dancer on tv?",
            "I truly hope this will go viral, but I fear it’s just too much.",
            "\"They can't create, they can only distort\"",
            "If this isn’t an argument against AI, then I dunno what is.",
            "This is amazing! Now all we need is the Cupcakke remix!",
            "I wanna see Mauler and Rags make a version.",
            "Pierry Chan, love & fear him in equal measure",
            "Because she is about as intelligent as the 4 year old"
        ]
    },
    "Somehow Blinkist has returned.": {
        "title": "Somehow Blinkist has returned.",
        "score": 32,
        "url": "https://i.redd.it/cw3i8ou6ri9d1.jpeg",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Is this real? Please tell me this isn’t real. It’s far too early in the morning for such a concentrated dose of misanthropy.",
            "i shall simplify the genetic code of these people\n\nalso french spotted",
            "There is no curse in Elvish, Entish, or the tongues of Man for this treachery.",
            "Oh ffs! How about growing vocabulary rather than dumbing something down?",
            "Hard: \"So we beat on, boats against the current, borne back ceaselessly into the past.\"\n\nEasy: \"Uh, I don't know. Something about boats. Man, that Gatsby was great, huh?\"",
            "Need to feed the easy version back through to dumb it down even more.",
            "Ok as a non native speaker I can understand the appeal. Books with simple language are quite often children’s books which are not appealing to read.\n\nBut that’s not what advertised here.",
            "Do people really have a short attention span these days? What’s next? Are they going to introduce a feature where they have subway surfers and family guy clips playing while you “read” the book?",
            "Yes, I found their website magibook dot ai. I'm not putting the link in because Brave says it's not secure.",
            "The only thing I’ll excuse is No Fear Shakespeare for people who have never really read Shakespeare or children. And if it’s an adult who has never really read any of the plays before, only use the “easy” version to make sure you’re comprehending stuff. Better yet, just get the Simon & Schuster editions because they simply define terms and allusions for every page."
        ]
    },
    "What's everyone's top 5 video games?": {
        "title": "What's everyone's top 5 video games?",
        "score": 19,
        "url": "https://www.reddit.com/r/MauLer/comments/1dr8zp6/whats_everyones_top_5_video_games/",
        "content": "For me its Soma, Half Life 2, XCOM Enemy Unknown, Minecraft, and Sim City 2000 (everyone laugh at me for being old)\n\nNotable mentions: All the Bungie Halos, Amnesia DDT, Star Wars: The Force Unleashed, Bioshock 1, Deadspace 1, PvZ, Rayman Origins, and most of the Valve games (Haven't gotten to a few of them like Alyx).",
        "num_comments": 76,
        "comments": [
            "star wars: the old republic, sly 3: honour among thieves, need for speed: most wanted (2005), ark: survival evolved, spore.",
            "The Punisher, Titanfall 2, CoD 2 Big Red One, Halo Wars, Metal Gear Solid The Twin Snakes",
            "Xenoblade 1, Breath of the Wild or TOTK they're the same thing, Xenoblade X, Nier Replicant, MGS V",
            "Cyberpunk, Halo: ODST, Witcher 3, Total war series, pillars of eternity: Deadfire",
            "Hitman: World of Assassination, Mirror's Edge, Dishonored, Oblivion, Baldur's Gate 3",
            "Resident Evil 4, Metal Gear Solid 3, Kingdom Hearts",
            "Knights of the Old Republic II: The Sith Lords, Cyberpunk 2077, Left 4 Dead 2, Shadow of the Colossus, and Final Fantasy IX.",
            "7 days to die, infection free zone, dead space 1,2 and 3, doom, Space Marine.",
            "Idk about the order but probably XCOM 2, Shadow of War, Red Dead Redemption 2, Europa Universalis IV, and Minecraft.",
            "Final Fantasy 14, Hades, Nioh 2, Darksiders 2, Infamous 2."
        ]
    }
}