{
    "Maybe maybe maybe ": {
        "title": "Maybe maybe maybe ",
        "score": 1604,
        "url": "https://v.redd.it/jn2zoi0mcf9d1",
        "content": "",
        "num_comments": 108,
        "comments": [
            "It's the ones in hiding you need to worry about. Clever girl!",
            "Ope...just gonna scootch by ya.",
            "such kind alligators clearing out the way for the biker",
            "Thats the MFer that got chubbs",
            "My man was looking to earn a Darwin award",
            "I had to bike next to one, though a much smaller. He opened his mouth and hissed at me.",
            "\"Pleasure doing business with you?\"\n\nWhy say that? Why not say things about seeing them later? What a missed opportunity.",
            "I dream of coming down the trail and having an awesome bunny hopping opportunity like this",
            "Bike Path Blockers are so rude!",
            "Oooh this new found footage horror movie animal edition commercial looks entertaining."
        ]
    },
    "Maybe Maybe Maybe": {
        "title": "Maybe Maybe Maybe",
        "score": 824,
        "url": "https://v.redd.it/je7g1lnvjd9d1",
        "content": "",
        "num_comments": 41,
        "comments": [
            "The sand isnt boiling, the CO2 is subliming. This is a version of the liedenfrost effect I believe, though that is more commonly seen with a liquid forming a thin gas boundary layer and reducing friction significantly. \n\nThe hot sand heats the dry ice, the solid turns to CO2 gas, and this expansion makes the block float on the surface like a puck on an air hokey table. Very cool.",
            "I obviously missed that episode of the office",
            "Well, that was underwhelming, though Im not sure what I expected from someone pushing a slab of dry ice down a sand dune",
            "Imagine their excitement when they find out about spheres",
            "When people, who used fidget spinners, become adults.",
            "This piece of ice drifts perfectly",
            "\"The sand behind it is really cold\"\n\nHe says with thick gloves on his hand.",
            "Michael Scott likes dry ice",
            "Americans are out of their minds",
            "\"the sand is *boiling*\" \n  \n"
        ]
    },
    "maybe maybe maybe": {
        "title": "maybe maybe maybe",
        "score": 525,
        "url": "https://v.redd.it/axaiv310gf9d1",
        "content": "",
        "num_comments": 19,
        "comments": [
            "not a drop is wasted",
            "First time Ive seen a bartender give a tip to a customer.",
            "TF are you trying to pull? You're trying to outsmart him. Typical bartender scam. Beware people!",
            "Bro paid for the beer and he wanted every drop.",
            "There's still some left on the table.",
            "You can joke with a German, but never steal a single drop of their beer I dare you",
            "Hes going to get pink throat",
            "Right!! He's face when he does it, he's all serious ",
            "That too a wet one !!",
            "Getting your moneys worth"
        ]
    }
}