{
    "Maybe Maybe Maybe": {
        "title": "Maybe Maybe Maybe",
        "score": 26494,
        "url": "https://v.redd.it/dus6nubvtx7d1",
        "content": "",
        "num_comments": 1644,
        "comments": [
            "Locked. I don't like banning people, even the nasty racist edge-lords that want to drop carefully misspelled slurs.",
            "I cannot believe that worked.",
            "I see that Nigerian prince got his banking situation all cleared up. Now all I have to do is sit back and wait for my payout!\n\nI'm so glad I answered that email!",
            "Damn, Rolls-Royce Cullinan, 400k on two sticks...",
            "\"And would you like your Rolls Royce bubble wrapped, sir?\"",
            "The corrupt dictator new car is arrived.",
            "Surprised it doesnt have Ontario license plates.",
            "Good chance this is an American car. The container TXGU532690 on the left came from America (Savannah) and shipped to Lagos, Nigeria.\nAnother container MSMU 4236900 originated from Seattle.\nDon’t think it would be too hard for law enforcement to find out who booked this freight. Not sure they care though.",
            "Arrived with a nice dent on the top of the left quarter panel.",
            "How did he enter the vehicle?!"
        ]
    },
    "Maybe maybe maybe": {
        "title": "Maybe maybe maybe",
        "score": 3248,
        "url": "https://v.redd.it/v6lbzvknuz7d1",
        "content": "",
        "num_comments": 139,
        "comments": [
            "I guess I just don't get art. ",
            "Your son of a... Oh... Nice! 👍",
            "I like how people are acting like the well defined woman on an abstract background is a worse painting than the well defined woman on an abstract background.",
            "Maybe if she had stopped halfway through when it still looked painterly, now it's just more garbage on canvas",
            "I was like oh that's cool with the 1st pass then she kept going. I'm  like, no, why, why do that? Then I go ohhh that's why. Nice job👌",
            "Wouldn't it make more sense to destroy the background first then paint the woman on top",
            "You ruined the background setting, You RUINED IT, woman.",
            "Oooh, I love it!!!",
            "this video made me angry.",
            "She's just doing something different. Not sure why some of you seem offended by this."
        ]
    }
}