{
    "Current Business School Admissions Round (r/MBA MegaThread)": {
        "title": "Current Business School Admissions Round (r/MBA MegaThread)",
        "score": 41,
        "url": "https://www.reddit.com/r/MBA/comments/1ayg8bp/current_business_school_admissions_round_rmba/",
        "content": "Hello, please use this thread to discuss Applications, Interviews, Decisions, and any other general topics for the current/upcoming admissions round.\n\nHelpful Items to Include:\n\nSchools where you applied\n\nStats (GRE/GMAT, Undergrad School Details/GPA)\n\nWork Experience Overview\n\nIf you were asked to Interview? Accepted? Scholarship Info?\n\nAlso, feel free to share what your interest is post-MBA\n\nThis thread will be re-posted every few months due to Reddit comment limits - it is auto-sorted by \"new\" but feel free to tailor it however you'd like to view it.\n\n[The previous thread(s) can be found here](https://www.reddit.com/r/MBA/comments/16ql5y1/current_business_school_admissions_round_rmba/)\n\nBest of luck to everyone!",
        "num_comments": 169,
        "comments": [
            "Applied: H/S/W, Booth, Kellogg, Yale, CBS, MIT, Darden\n\nGMAT: 700-720, GPA: 3.9/4.0 (Engineering)\n\nExperience: 4 Years (variety of industries)\n\nInterview: H/S, Booth, Kellogg, Yale, Darden\n\nWaitlist: MIT + X\n\nDing: CBS, W, Y\n\nPost-MBA: Energy\n\nEdit:  \nAdmitted: Darden (No scholarship)  \nWaitlist: Booth  \nWaiting on decisions this week from:  \nH, S, Kellogg + Yale SOM. \n\nGood luck to all! :)",
            "Applied: Kellogg, Yale, CBS, NYU Stern, UCLA   \nStats: GRE 323, 3.7 GPA, Humanities Major at T15 Undergrad  \nExperience: 4 years as a publicist in entertainment industry  \nInterview: Kellogg, Yale, CBS, NYU Stern, UCLA   \n\nPost-MBA: Entertainment Marketing at a major studio\n\nACCEPTED: CBS, Stern, UCLA, Yale, Kellogg\n\nEdit: Attending CBS. Folks with slightly less exceptional test scores and more “nontraditional” backgrounds — there is hope for us! :)",
            "**Schools applied:** Harvard / Stanford\r  \n\r  \n**Stats**: 780 GMAT, 3.9 GPA / summa cum laude @ target school (i.e. Penn / UChicago / Columbia). 2x NCAA all-american athlete + school record\r  \n\r  \n**Work Experience**: 2 years IB (GS / MS / JPM), 2 year MF PE\r  \n\r  \n**Interviews:** HBS: No interview. GSB: Interview + Accepted",
            "Finally done.\n\nAerospace Engineer, 5 years experience\n\n770 GMAT, 3.0 GPA, top 5 undergrad engineering school\n\nWhite guy in US\n\n\n\nDenied no interview:\n\nUCLA, MIT\n\n\nDenied post interview:\n\nHarvard, Northwestern\n\n\nWaitlisted:\n\nDuke\n\n\nAdmitted:\n\nGeorgetown ($$), Virginia, Dartmouth ($), Chicago\n\nAnd I haven't heard back from USC since my interview.\n\n\n\nI accepted Dartmouth, it was my top choice alongside Harvard.",
            "The Stern Employment report describes their student body as \"Street smart\". \n\n\n Something about \"street smart\", being used to describe investment bankers that went to private high schools is..... amusing.",
            "Accepted: HBS (accepted R2 after further evaluation in R1)\n\nDenied: GSB\n\n3.8 GPA, 323 GRE (167V / 156Q), non-HYP Ivy undergrad\n\n6 YOE in finance \n\nYeehaw",
            "**Schools applied:** Stanford\n\n**Stats**: 760 GMAT, 3.97 GPA from Top 50 Private School in CS/Business. 2 Master's Degrees, including one from a international fellowship\n\n**Work Experience**: 2 years WE in fintech startup\n\n**Interviews:** GSB: Rejected, no interview\n\nalways next year",
            "Applied: BU Questrom online MBA\n\nStats:  3.4 GPA (Community college then State school), No GMAT/GRE\n\nWork Experience: 12 years (Tech roles started from the bottom, now F500 Tech Product Mgr)\n\nAccepted Round 1. Did not request scholarship. Employer is covering it.\n\nPost-MBA: Grow internally to Director/above or to own/lead the flagship business line(s).\n\nBTW, very impressed with BU's outreach and their admissions team. I've gotten an e-mail back within hours if not literally within the hour when I had a question about the process.",
            "Applied: Ross, Kellogg, Darden, Fuqua, Foster, Haas  \nGRE: 324, GPA: 3.45 T25 University  \nExperience: 5 years, Marketing Agency to in-house marketing at a start-up  \nInterviewed: Ross, Kellog, Darden, Fuqua, Foster  \nPost-MBA: PMM at FAANG\n\nEDITED: Accepted to Ross ($$) Foster($$), WL from Darden, Fuqua, Haas\n\nEDIT #2: Attending Ross, can't wait!",
            "Applied: Wharton executive MBA, SF campus. Round 2. No others. \n\nStats: EA 160, (18,12,10). Med school (DO) GPA equivalence to middle class ranking, undergrad BS biology was like 3.5 from a California State University.\n\nExperience: military physician and now civilian hospital physician, total 8 years post med school. No direct “business” experience. \n\nInterviewed: Wharton\n\nAccepted: Wharton 3/28/24"
        ]
    },
    "MBA Job Market MegaThread": {
        "title": "MBA Job Market MegaThread",
        "score": 88,
        "url": "https://www.reddit.com/r/MBA/comments/1az8hw6/mba_job_market_megathread/",
        "content": "Feel free to use this thread to discuss the MBA job market and the current business environment in general. It can also be for asking questions or career advise, sharing personal anecdotes, or discussing major news when it comes to business careers.",
        "num_comments": 172,
        "comments": [
            "It's shitty!",
            "How’s the recruiting for tech PM roles?",
            "Dinged throughout all of consulting. Ended up in a finance role at F50 with another offer in tech for what was effectively a sales engineer role so not bad but needed backup plans and to network at many places",
            "It sucks! class of 23 on month 8 of the job search post business school. I can't believe its been this bad honestly. \n\nI've been recruiting PM/PMM/Strategy (non-consulting)",
            "Was on a coffee chat w someone from Bain London, and they mentioned things are looking up compared to this time last year and that outlook is positive",
            "What's recruiting like in IB?  \nVery specifically what's recruiting like in HF/PE?",
            "Booth 2023 grad here with 14 years of work experience in product management, can't even get a regular PM Job in Chicago. If I do get an interview, the people who would be my managers are typically dummies who got lucky in 2022.\n\n  \nunsolicited advice is to not get MBAs and don't believe everything you read on Poets and Quants or salary reports.",
            "US economy is said to be booming. But the jobs market is not booming. What's going on?\n\n[https://www.reuters.com/markets/us/jpmorgan-ceo-dimon-says-us-economy-is-booming-2024-04-23/](https://www.reuters.com/markets/us/jpmorgan-ceo-dimon-says-us-economy-is-booming-2024-04-23/)",
            "Any other 1Y's basically completely striking out? I'm at an M7 and a career switcher and it feels like basically no one wants to take a chance on even interviewing me. I had interviews for consulting but ultimately didn't get an offer, and since then haven't had a single interview.",
            "For someone entering a program this fall (Sept 2024)- how do we predict the job market to be in summer 2026?"
        ]
    },
    "unpopular opinions about bschool": {
        "title": "unpopular opinions about bschool",
        "score": 198,
        "url": "https://www.reddit.com/r/MBA/comments/1dqkx8p/unpopular_opinions_about_bschool/",
        "content": "Just graduated from HSW with a MM PE offer, and honestly from what I have seen there are a lot of misconceptions when it comes to bschool, here are some of them:\n\n* B-school is a time to \"find yourself\" - this couldn't be farther from the truth, the way the FT MBA program is set up you need a clear plan prior to starting\n* M7 or bust mentality - the most important thing I found in recruiting was your pre-MBA work experience, not school brand. Even if you go to Harvard, you won't get hired at Citadel if you don't know shit about investing and don't have relevant pre-mba experience.\n* School rankings don't mean shit- I see all these post comparing Johnson vs. Tepper and CBS vs. NYU Stern. Quite frankly, the way I look at the rankings is: Harvard, Stanford, Wharton, Booth, CBS are in their own league (these schools probably give you a leg up on getting interviews at the most prestigious firms), otherwise any T20 can get you into banking, consulting etc. Sure you might need to hustle a little but more at say Georgetown then NYU Stern, but if you can't hustle to get the job, you likely aren't a good fit for banking or consulting anyway.\n\nFeel free to disagree, but I just wanted to post this because I noticed many students were disappointed in my year because they thought going to HSW would change their life, when the truth is pre-mba experience is way more relevant than school brand and they got duped into paying 250k and ended up getting the same job as they would have gotten if they went to any T20",
        "num_comments": 66,
        "comments": [
            ">the most important thing I found in recruiting was your pre-MBA work experience, not school brand.\n\nThis deserves to be in the title!",
            "Hard agree on point 2. Many of my classmates thought that they could just walk in and take any business-adjacent job because of a branded MBA. They kept highlighting the M7 MBA as a selling point. \n\nNah bro, they want direct experience. Some of my friends are struggling in the job market because they keep thinking the MBA alone would get them the job.",
            "This is so true ! \n\nEspecially the part about pre MBA work experience. Yes, you can pivot with a top MBA but many times if you have years of experience in tech or corporate finance then you have a huge advantage and many firms will be interested in you with relevant work experience. \n\nSome people hear the unicorn stories of people who majored in musical theater but get a Top tier MBA  and then land a role at a FAANG company as a product manager. While this does happen, it is very rare. \n\nThis is not the norm!\n\n\n\n\nI’ve also noticed a lot of wildly successful people in Bay Area tech industry who didn’t go to the most elite colleges / grad schools but have great work experience and a burning desire to succeed. \n\nHard work and grit can take you very far if you are determined to be successful.",
            "> M7 or bust mentality is false \n\n> Harvard, Stanford, Wharton, Booth, CBS are in their own league\n\n\nWhat?",
            "Agreed with #1 and #2, but slightly different reasons (which impact thought on #3):\n\n1. You need to go into B-school with an idea of what you want to do - industry transition, 2-year break (before returning to prior job), firm up-tiering in same industry, etc.; There are too much distractions starting Day 1 that people who are not focused easily get lost and then forget that they need to recruit for a job\n\n2. The more important point is for any job where supply >>> demand (PE, hedge funds, etc.), there will be more criteria - so obviously, if you are trying to get into PE or HF, school ranking matters but then so does prior experience because at HSW / M7, the number of students who want those jobs >> opportunities; so prior experience / references / knowing people matter. That being said, using OP's example, if you're trying to work at Citadel but coming from T20, it's going to be SIGNIFICANTLY harder than from HSW...\n\n3. See #2. Sure school rankings matter less, but for any desirable job where supply > demand, you want to have as much of a leg up vs. your peers. You can get a job in IB or MBB from T20, but is it meaningfully harder than HSW / M7? Yes. I don't think rankings mean everything, but everyone should target as high of a ranked school that they can get into",
            "First bulletpoint should be in bold caps lock! Can't stress that enough after failing to find myself in the first 6 days before recruiting started.",
            "To your second point, it does seem like the MBA is increasingly less of a chance at a career restart or a golden ticket into consulting/finance. With a tougher job market, increased specialization/emphasis on technical skills, and AI/automation creating efficiencies that necessitate fewer workers, it certainly seems like pre-MBA experience is more important than ever in landing a job. Gone are the days when you could go to a top MBA program and stumble into a lucrative career in IB or a top consulting firm. I really hope more MBA applicants realize this so that they don’t have unrealistic expectations about their post-MBA job prospects.",
            "Here's an unpopular position: Consulting isn't a real job, and the cost to pay them greatly outweighs the benefits you get.",
            "The other part that's wildly misunderstood here is that there's a ton of selection bias in the data. People act as if the students at all top-20 school are the same and the differences in outcomes are largely explained by the quality of the schools/brand. The reality is that folks starting at HSW (or whatever schools are at the top these days) are likely some combination of higher IQ, harder working, better looking, more charismatic, better job experience, taller, etc. Of course top jobs are going to take more people from those pools. If you pulled someone from HBS that got a job at Goldman and re-ran their business school experience at Fuqua, I'd bet an enormous percentage of the time they get that same job.\n\nQualifications: 15 years out of T10 MBA program MBB>PE>Entrepreneur. Spouse has a different top MBA.",
            "If pre-work experience is imperative what does that do for someone in say sales or operations looking to move into consulting or IB?"
        ]
    },
    "Build the ideal mens mba wardrobe": {
        "title": "Build the ideal mens mba wardrobe",
        "score": 37,
        "url": "https://www.reddit.com/r/MBA/comments/1dqshgr/build_the_ideal_mens_mba_wardrobe/",
        "content": "TLDR: I'm getting out of the military and realized I have no civilian clothes, so help me build my wardrobe for my mba.\n\nPretty much what the title says. I've seen some similar posts asking for fashion advice, but most don't seem to be starting from scratch like I am. I've been in the military since I graduated college 4 years ago. My role the last two years was incredibly time consuming (working around 80 hour weeks across 6 days) and most days when I got home I made dinner and started getting ready for bed without changing out of my uniform. The few days a month that I had off, I'd usually just chill in gym clothes. \n\nNow that I'm getting out of the military and starting my MBA in the fall, I'm realizing I have essentially no civilian clothes because the last time I bought clothes remotely regularly was when I was in college, and I obviously need to upgrade my wardrobe from what it was when I was a broke college kid. Not to mention most of those clothes don't fit anymore.\n\nI've already bought a tailored navy suit. I plan on buying a charcoal suit as well, but I'd appreciate any advice or tips for building the rest of my wardrobe. I'm particularly interested in what brands you like, how many of each item you'd recommend having (ie how many suits, how many shirts, how many chinos etc) and even brands for nice but casual clothes you'd wear to go out with friends.\n\nI'm not trying to be the coolest person in my program or anything like that, but I would like to look presentable and not show up in 5 inch nike shorts and a t-shirt. ",
        "num_comments": 63,
        "comments": [
            "Lululemon ABC trousers (previously the commission pants) \n\nCharles tyrwhitt dress shirts \n\nLight gray, dark gray, navy blue suits \n\nBrown and black dress shoes \n\nCasual clothes for day to day",
            "You alternate between the Patagucci from your college internship, a company branded polo shirt from your first real job and a hoodie from your Alma Mater.",
            "Marine Corps vet MBA here, wear your dress blues and get some pussy homie, no one cares about recruiting",
            "Vet here starting in the fall \n\nJust grab three solid suits with multiple button up/tie combos\n\nA blazer or two\n\nSome polos and quarter zips \n\nThree pairs of chinos \n\nOtherwise wear whatever the fuck you want to class. Ima be in a tank and shorts unless there is some event or socials lol",
            "Make sure your wardrobe includes one of that cool skull shirt project pat of triple six mafia wore in the music video for Stay High ",
            "This is probably location dependent, but thrift stores can be a great way to cover the basics on the cheap. It'll depend on what they have in stock in your size on that particular day so you'll probably have to make multiple trips and acquire things slowly. But there are good finds of you keep at it. \n\nI've been able to find a good selection of ralph lauren and lacoste button ups for ~10 each. Lots of sweaters and jackets available for good prices if you're in a cooler climate. Jeans and pants are generally in that same $10 range. \n\nHave also had some luck with designer stuff (ferragamo loafers under 10, ysl, etro, and dior blazers under 20).",
            "Vet here who’s halfway through with school. \n\nHonestly wore casual pants or jeans, a t shirt, and Nikes to class every day. I live in the Amazon basics trousers. They’re cheap, comfy, and look good. \n\nGet a couple nice zip ups or quarter zips. There’s countless good brands.\n\nFor recruiting, will depend a little on your industry. But 2 suits will get you through. Navy and grey. \n\nFor summer internship I’m in consulting and live in the lulu ABC pants and a couple lulu button downs. The shirts are a little more casual so get nicer ones to wear with your suit for recruiting.\n\nIf you wear moto gear or an assault pack to class I will hunt you down. \n\nAlso it’s no longer “civilian” clothes. It’s just clothes. Welcome to the normal world",
            "You will notice the dress code gradually shift from when you start until graduation. I wore button down and slacks (like most) the first few days and realized there was no reason to do so. Ended up wearing jeans and a T shirt most days unless you have recruiting events on campus. I actually found it an easy way to connect with someone if they were wearing a cool tshirt or cap with a band name, sports team, social cause etc. \n\nConventional wisdom said wear clothes in which you’d be ok if you were seen by a recruiter, but on campus visits largely became virtual post-COVID. Obviously dress up if you have an interview, but be comfortable and no one really cares.",
            "I can’t comment too specifically (I’m a woman and not in MBA yet either lol) but I love to shop so wanted to point out a ton of stores are having good sales this weekend for the holiday. J Crew, Madewell, Abercrombie, Banana Republic, and Gap might be good places to look. All brands I shop regularly and they have good business casual/casual clothes!",
            "Don’t buy any more suits. You’re good. Literally all you need is a handful of CT white dress shirts and a couple ties."
        ]
    },
    "Professor career post MBA": {
        "title": "Professor career post MBA",
        "score": 2,
        "url": "https://www.reddit.com/r/MBA/comments/1dr48vz/professor_career_post_mba/",
        "content": "Curious to see if people here think this will make sense? Anyone seen any success stories? Does this involve getting PhD? How to plan for this transition?",
        "num_comments": 2,
        "comments": [
            "I’m a professor without a PH.d. Had a long senior executive career and private equity business. Retired early so I could come back to the US and teach and write.",
            "Makes a lot of sense!"
        ]
    }
}