{
    "How do you guys lift? What are the pros and conns?": {
        "title": "How do you guys lift? What are the pros and conns?",
        "score": 303,
        "url": "https://i.redd.it/ljm9lhm54x7d1.png",
        "content": "",
        "num_comments": 336,
        "comments": [
            "Thanks for posting on /r/MechanicAdvice!  This is just a reminder to review the [rules](https://www.reddit.com/r/MechanicAdvice/about/rules/).  If you are here asking about a second opinion (ie \"Is the shop trying to fleece me?\"), please read through CJM8515's [post on the subject.](https://www.reddit.com/r/MechanicAdvice/comments/4qblei/fyi_the_shop_isnt_likely_trying_to_rip_you_off/) and remember to please post the year/make/model of the vehicle you are working on. **If this post is about bodywork, accident damage, paint, dent/ding, questions it belongs in /r/Autobody r/AutoBodyRepair/ or /r/Diyautobody/ If you have tire questions check out https://www.reddit.com/r/MechanicAdvice/comments/k9ll55/can_your_tire_be_repaired/**. If you dont have a question and you're just showing off it belongs in /r/Justrolledintotheshop Insurance/total loss questions go in r/insurance This is an automated reply\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MechanicAdvice) if you have any questions or concerns.*",
            "The biggest difference is that ramps don’t help with wheel-off jobs. So if you’re diying brakes/suspension, ramps are a luxury to get sometime after a jack and jack stands. \n\nThey’re mainly useful for saving some time and being more secure for fluid changes.",
            "Ramps for everything that doesn't involve taking the wheels off, stands for everything else.",
            "I have both. \n\nThe ramps are quicker for an oil change but you need the stands to rotatate tires or change brakes, etc.\n\nSo if I had to choose one, the stands are the best. But, still, both is the way to go imo",
            "Ramps are also great for lowered cars where you can’t get a jack under it easily. When I was freelancing in my driveway I used both pretty regularly",
            "I prefer ramps for anything besides wheels and suspension work. Far more stable, I get claustrophobic and shit when I use jack stands. and I can’t use them where I currently live, driveway is a slope as well as the street. And I don’t think O’Reilly would take kindly to me, putting it on jackstands in the parking lot 😅",
            "Tire ramps work for some basic shit. But you can’t take your wheels off with ramps. You also can’t fully lift the car with ramps. \n\nJack stands let you do more. I got esco stands",
            "Jack stands I enjoy more for brake jobs, tire rotations, etc. \n\nIf you use the ramps, you really cannot do that.  They are good for oil changes.",
            "ramps for oil changes\n\nQuick-Jack for everything else.",
            "I prefer jack stands. 6 ton ones is what I use. I never trusted ramps, especially plastic ones. But that's just my opinion."
        ]
    },
    "Stripped bolts - is it dangerous?": {
        "title": "Stripped bolts - is it dangerous?",
        "score": 17,
        "url": "https://v.redd.it/kj9f7g4c818d1",
        "content": "I have a 2005 Corolla. I (regretfully) agreed to have sway bar links replaced at a local Midas. Later in the week (unrelated), I took it to a Jiffy Lube for coolant issues and asked to check the brakes too. The Jiffy Lube guy noticed that these bolts were loose and could not be tightened. He recommended that I report the Midas work bc the car is in \"dangerous\" condition.\n\nObviously, this was alarming to me. Car seems to drive fine but I keep worrying the front end might collapse or fall off. Finally get the Corolla back to Midas and they say it's not that serious and that, to tighten the bolts, they would have to make holes in the frame. Nobody seems to know what the bolts do exactly but ofc they're there for a reason. Couldn't find any specs on Google so now I'm hoping you Redditors can help. \n\nIs this really dangerous? What should I do? I have about 2 weeks to decide whether to make Midas warranty their work. Jiffy Lube guy thinks I should have them buy and replace the whole subframe. I honestly feel lucky that I got away with a car intact the first time (turns out Midas messed up my brakes when they did the sway bar). Do I really want to press the Midas for free work that might open an even bigger can of worms for this old car? Or if they end up cutting holes to fix the bolts, would that create other problems I'd want to avoid?\n\nNot sure which sub to post this in, so I'm trying a few. Ideally I can continue driving the Corolla for another year, at least (as I pay off the sway bar work in installments). The car is very reliable otherwise with great pick up. Thanks in advance for your comments and advice.  ",
        "num_comments": 30,
        "comments": [
            "Thanks for posting on /r/MechanicAdvice!  This is just a reminder to review the [rules](https://www.reddit.com/r/MechanicAdvice/about/rules/).  If you are here asking about a second opinion (ie \"Is the shop trying to fleece me?\"), please read through CJM8515's [post on the subject.](https://www.reddit.com/r/MechanicAdvice/comments/4qblei/fyi_the_shop_isnt_likely_trying_to_rip_you_off/) and remember to please post the year/make/model of the vehicle you are working on. **If this post is about bodywork, accident damage, paint, dent/ding, questions it belongs in /r/Autobody r/AutoBodyRepair/ or /r/Diyautobody/ If you have tire questions check out https://www.reddit.com/r/MechanicAdvice/comments/k9ll55/can_your_tire_be_repaired/**. If you dont have a question and you're just showing off it belongs in /r/Justrolledintotheshop Insurance/total loss questions go in r/insurance This is an automated reply\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MechanicAdvice) if you have any questions or concerns.*",
            "Those bolts are holding the subframe to the unibody structure of the car, so yeah, kinda dangerous. But also, these bolts shouldn’t have been touched and have nothing to do with replacing sway bar end links. Did they possibly replace the sway bar itself?",
            "Go. Back. To. Midas.\n\nSombody fucked up and thought it would be overlooked long enough for it not to be linked back to them. If they say it was like that before, then they 100% would/ should have told you about it",
            "Doesn’t look like they’re stripped. Looks like the nut they thread into which is usually spotwelded inside the frame or whatever has broken apart when they undid them for whatever reason, causing it to be loose and not able to tighten up, the whole thing just spins.",
            "So after doing some digging, I think your bolt size is M16x1.5. Not 100% on the pitch, but it’s a 19mm socket = m16 bolt. Other models with compatible also use m16’s on the subframe, and those are 1.5 pitch. \n\nAre you sure they just replaced the links and not the bar as well? Removing the bar would cause the mechanic to loosen those bolts. From what I’ve seen, this is a fairly common issue. Toyota used a threaded sleeve instead of a nut, and it’s apparently pretty easy to strip/gall the threads when using a pneumatic/electric gun.\n\nAs far as safety, there are probably worse cars on the road. It is still not great. Looking at it, there’s 4 bolts holding your front suspension and front half on your powertrain to the car, and you’re rolling around without 2 of them. Depending the condition of the two bolts you have left, a big pothole could be a very bad day for you. I would go back to Midas as soon as possible, and try to sort things out.",
            "Here's another picture of the bolt placement: [https://imgur.com/a/Jwth7Il](https://imgur.com/a/Jwth7Il)\n\nBoth sides are loose",
            "Everyone is saying go back to midas. But i dont see a reason they would have touched those bolts, incidentally or otherwise. The sway bar link procedure for sure doesn’t call for dropping the subframe so not sure how you could prove they caused it",
            "This might actually be common on this particular year Corolla.",
            "Go back.  Push back as much as you an at least get them to fix it right",
            "Those bolts don’t have anything to do with your sway bar end links.  Those hold your subframe in place.\n\nI’m not familiar with corollas, but I get the feeling that maybe the threaded portion of the nuts, seeing how the bolts didn’t just fall off.  Maybe they’re welded nuts that snapped off the unibody.  So now you have the bolt and nut dangling on the subframe.\n\nIf that’s the case the fix would be to lower the subframe or remove it.  Weld the nuts back into the chassis again and reinstall.  \n\nIf it’s not nuts on the other end it could be threaded sleeves.  \n\nAs for safety well now you have two instead of 4 bolts holding it in place.  Could last forever or it could fail on you.  It’s a lot like driving a car with two lug nuts off each wheel.   Will it hold?  Maaaaybe?"
        ]
    },
    "Purchasing these wheels, I noticed some dry rot on the tires, would they need to be replace urgently?": {
        "title": "Purchasing these wheels, I noticed some dry rot on the tires, would they need to be replace urgently?",
        "score": 3,
        "url": "https://i.redd.it/eu45v9mfq38d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Thanks for posting on /r/MechanicAdvice!  This is just a reminder to review the [rules](https://www.reddit.com/r/MechanicAdvice/about/rules/).  If you are here asking about a second opinion (ie \"Is the shop trying to fleece me?\"), please read through CJM8515's [post on the subject.](https://www.reddit.com/r/MechanicAdvice/comments/4qblei/fyi_the_shop_isnt_likely_trying_to_rip_you_off/) and remember to please post the year/make/model of the vehicle you are working on. **If this post is about bodywork, accident damage, paint, dent/ding, questions it belongs in /r/Autobody r/AutoBodyRepair/ or /r/Diyautobody/ If you have tire questions check out https://www.reddit.com/r/MechanicAdvice/comments/k9ll55/can_your_tire_be_repaired/**. If you dont have a question and you're just showing off it belongs in /r/Justrolledintotheshop Insurance/total loss questions go in r/insurance This is an automated reply\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MechanicAdvice) if you have any questions or concerns.*",
            "If you're just getting the wheels and the tires are a bonus,  you can use them for a little longer but low tread is never great. That rot is not really the problem with those. But I can't take my own advice and I would tell myself I can squeeze a season out of them before I change them.",
            "Dryrot!? There no threads left!? Wear almost used up all the way down to wear mark. You got scammed!",
            "Will eventually get worse..id avoid if poss..note down the manufacture date and have a look how old they are",
            "They don’t look too bad at the moment but likely would need changing in the next year.",
            "They did say they bought ‘wheels’ I’m assuming they just wanted the rims but are wondering if the tyres are usable as well (I agree they aren’t however)",
            "They’re at the tread wear indicator and show signs of cracking. These tyres are not in serviceable condition.",
            "True. Didnt think about the rims.",
            "So, correct me if I'm wrong, but you're talking about the pattern on the shoulder of the tire, right? Imo, that looks like additional melted rubber, like these tires got hot at one point. The wear is obvious.",
            "Weird"
        ]
    },
    "Is this rust that bad?": {
        "title": "Is this rust that bad?",
        "score": 21,
        "url": "https://www.reddit.com/gallery/1dlhege",
        "content": "Just got this 2022 with 59k miles. I'm going to do a a rear differential oil change soon and was wondering if this rust is real bad or ok? Plus wasn't sure what that foam looking stuff is in other pics lol looks normal though. Thanks for any input. ",
        "num_comments": 51,
        "comments": [
            "Thanks for posting on /r/MechanicAdvice!  This is just a reminder to review the [rules](https://www.reddit.com/r/MechanicAdvice/about/rules/).  If you are here asking about a second opinion (ie \"Is the shop trying to fleece me?\"), please read through CJM8515's [post on the subject.](https://www.reddit.com/r/MechanicAdvice/comments/4qblei/fyi_the_shop_isnt_likely_trying_to_rip_you_off/) and remember to please post the year/make/model of the vehicle you are working on. **If this post is about bodywork, accident damage, paint, dent/ding, questions it belongs in /r/Autobody r/AutoBodyRepair/ or /r/Diyautobody/ If you have tire questions check out https://www.reddit.com/r/MechanicAdvice/comments/k9ll55/can_your_tire_be_repaired/**. If you dont have a question and you're just showing off it belongs in /r/Justrolledintotheshop Insurance/total loss questions go in r/insurance This is an automated reply\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MechanicAdvice) if you have any questions or concerns.*",
            "In NY we would call that mint condition",
            "what rust?",
            "Just surface rust. A long way to go before it becomes a concern. You can sand it off and use rust converter paint to make it last even longer. The other thing is a heat shield.",
            "That's dampening/insulation material and normal. So is the rust on unpainted parts. It'll have some of that before it hits the dealership new.",
            "Looks really good actually.",
            "That rust is better than some dealership cars",
            "There basically is no rust on that car.  This is what people are talking about when they talk about a rusty car.\n\nhttps://preview.redd.it/ah73r4zxj08d1.jpeg?width=4032&format=pjpg&auto=webp&s=df5d485cc29123d6f44366f2a062db4dbde37f87",
            "That's the least rusty rust bucket I've ever seen. Those parts look nearly brand new",
            "What rust?  I've seen brand new steel look worse after being shipped from the mill."
        ]
    },
    "Any idea what this ticking could be?": {
        "title": "Any idea what this ticking could be?",
        "score": 20,
        "url": "https://v.redd.it/gxduw5ssc08d1",
        "content": "Chevy Cruze 2016 LT\n\nSounds like it’s coming from the back of the engine? By the fuel injectors. But it could be the timing belt on the passenger side. Any thoughts? ",
        "num_comments": 38,
        "comments": [
            "Thanks for posting on /r/MechanicAdvice!  This is just a reminder to review the [rules](https://www.reddit.com/r/MechanicAdvice/about/rules/).  If you are here asking about a second opinion (ie \"Is the shop trying to fleece me?\"), please read through CJM8515's [post on the subject.](https://www.reddit.com/r/MechanicAdvice/comments/4qblei/fyi_the_shop_isnt_likely_trying_to_rip_you_off/) and remember to please post the year/make/model of the vehicle you are working on. **If this post is about bodywork, accident damage, paint, dent/ding, questions it belongs in /r/Autobody r/AutoBodyRepair/ or /r/Diyautobody/ If you have tire questions check out https://www.reddit.com/r/MechanicAdvice/comments/k9ll55/can_your_tire_be_repaired/**. If you dont have a question and you're just showing off it belongs in /r/Justrolledintotheshop Insurance/total loss questions go in r/insurance This is an automated reply\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MechanicAdvice) if you have any questions or concerns.*",
            "nah something on your serpentine belt for sure. could be a bad belt tbh. also that beat is low key fiiiiiirrrrrreeee..... \n\n  \nreminds me of this guy [https://www.tiktok.com/@venjent/video/7363705419547561249?lang=en](https://www.tiktok.com/@venjent/video/7363705419547561249?lang=en)\n\n![gif](giphy|joqK3kaNmkPt4CTxU7|downsized)",
            "Sounds like the wood block from music class when I was 7.",
            "Hell ya.  Workin on that beat hoe!",
            "Your car is playing the Saints Row 3 theme [https://www.youtube.com/watch?v=9ubPld4Xk1I](https://www.youtube.com/watch?v=9ubPld4Xk1I)\n\nI'd contact THQ.",
            "Pcv, pull that plastic cover off the engine and try putting your thumb over the opening of the small round disk on the top right hand side to the coil pack. It might change sound if you pull out the dipstick as well. If it ends up being the Pcv you replace the valve cover. Easy to do. There is another one in your intake manifold, which is the reason the valve cover Pcv fails. Again got to replace the whole manifold. It's pretty easy to do. I had a Cruze 1.4 and this would happen often. They make a bypass kit for the engine if you Google for it, chevy 1.4 Pcv bypass. Another failure point is the plastic coolant outlet. There is an aluminum one available if you Google for it. That outlet is what killed my Cruze. It busted 4 times on me on the highway, resulting in overheating. Ended up cracking the head, 204,000 miles she was done.",
            "https://youtu.be/yH3ZZTGcUYs?si=RI0Rel_ukcI3P9HS?t=50",
            "not enough duck tape. Thats your issue.",
            "maybe you need some more tape",
            "That sounds like a bad bearing.\n\nI'd suggest going to the parts store or tool store and buying a Mechanics stethoscope. It should help you pinpoint where the noise is coming from."
        ]
    }
}