{
    "Incoming Medical Student Q&A - 2024 Megathread": {
        "title": "Incoming Medical Student Q&A - 2024 Megathread",
        "score": 111,
        "url": "https://www.reddit.com/r/medicalschool/comments/1buym4c/incoming_medical_student_qa_2024_megathread/",
        "content": "# Hello M-0's!\n\nWe've been getting a lot of questions from incoming students[,](https://imgur.com/a/A6ALCPT) so here's the official megathread for all your questions about getting ready to start medical school.\n\nIn a few months you will begin your formal training to become physicians. We know you are excited, nervous, terrified, all of the above. This megathread is your lounge for any and all questions to current medical students: where to live, what to eat, how to study, how to make friends, how to manage finances, why (not) to prestudy, etc. Ask anything and everything. There are no stupid questions! :)\n\nWe hope you find this thread useful. Welcome to [r/medicalschool](https://new.reddit.com/r/medicalschool/)!\n\nTo current medical students - please help them. Chime in with your thoughts and advice for approaching first year and beyond. We appreciate you!\n\n# ✧ ✧ ✧ ✧ ✧ ✧ ✧\n\nBelow are some frequently asked questions from previous threads that you may find useful:\n\n* [FAQ 1- Pre-Studying](https://www.reddit.com/r/medicalschool/comments/u51uy6/comment/i4z5ns8/?utm_source=share&utm_medium=web2x&context=3)\n* [FAQ 2 - Studying for Lecture Exams](https://www.reddit.com/r/medicalschool/comments/u51uy6/comment/i4z5rjh/?utm_source=share&utm_medium=web2x&context=3)\n* [FAQ 3 - Step 1](https://www.reddit.com/r/medicalschool/comments/u51uy6/comment/i4z5uxz/?utm_source=share&utm_medium=web2x&context=3)\n* [FAQ 4 - Preparing for a Competitive Specialty](https://www.reddit.com/r/medicalschool/comments/u51uy6/comment/i4z61zj/?utm_source=share&utm_medium=web2x&context=3)\n* [FAQ 5 - Housing & Roommates](https://www.reddit.com/r/medicalschool/comments/u51uy6/comment/i4z657j/?utm_source=share&utm_medium=web2x&context=3)\n* [FAQ 6 - Making Friends & Dating](https://www.reddit.com/r/medicalschool/comments/u51uy6/comment/i4z68wu/?utm_source=share&utm_medium=web2x&context=3)\n* [FAQ 7 - Loans & Budgets](https://www.reddit.com/r/medicalschool/comments/u51uy6/comment/i4z6bkn/?utm_source=share&utm_medium=web2x&context=3)\n* [FAQ 8 - Exploring Specialties](https://www.reddit.com/r/medicalschool/comments/u51uy6/comment/i4z6f26/?utm_source=share&utm_medium=web2x&context=3)\n* [FAQ 9 - Being a Parent](https://www.reddit.com/r/medicalschool/comments/u51uy6/comment/i4z6hkn/?utm_source=share&utm_medium=web2x&context=3)\n* [FAQ 10 - Mental Health & Self Care](https://www.reddit.com/r/medicalschool/comments/u51uy6/comment/i4z6k0s/?utm_source=share&utm_medium=web2x&context=3)\n\nPlease note this post has a \"Special Edition\" flair, which means the account age and karma requirements are not active. Everyone should be able to comment. Let us know if you're having issues and we can tell you if you're shadow banned.\n\n# ✧ ✧ ✧ ✧ ✧ ✧ ✧\n\nExplore previous versions of this megathread here:\n\n[April 2023](https://www.reddit.com/r/medicalschool/comments/12b8a5f/incoming_medical_student_qa_official_megathread/)  |  [April 2022](https://www.reddit.com/r/medicalschool/comments/u51uy6/official_megathread_incoming_medical_student/)  |  [April 2021](https://www.reddit.com/r/medicalschool/comments/mkzn2x/official_megathread_incoming_medical_student/)  |  [February 2021](https://www.reddit.com/r/medicalschool/comments/lm3g9k/official_megathread_incoming_medical_student/)  |  [June 2020](https://www.reddit.com/r/medicalschool/comments/gx6ocu/official_incoming_medical_student_questions/?utm_source=share&utm_medium=web2x&context=3)  |  [August 2020](https://www.reddit.com/r/medicalschool/comments/cp0whp/official_im_a_new_m1_how_do_i_megathread/?utm_source=share&utm_medium=web2x&context=3)  |  [October 2018](https://www.reddit.com/r/medicalschool/comments/9qv8cm/serious_this_sub_has_been_an_inspiration_any/?utm_source=share&utm_medium=web2x&context=3)\n\n&#x200B;\n\n\\- xoxo, the mod team\n\n&#x200B;",
        "num_comments": 658,
        "comments": [
            "For non-trads / multiple gap year students, how did you adjust to returning to school? I know everyone’s against pre-studying but I’m kinda scared that I forgot how to study",
            "*Preface: This is looking into the future but something to consider as it's good to jump on this train early if you are going to do it. Also probably more information than you need right now but it's advice I got that helped me a ton. This is for when school starts, though, enjoy your break until then*\n\nIf anyone can swing it (you'll figure it out while you're in school) **I really, really recommend doing longitudinal study with Anki**. I used Anking v12 which you can keep updated for like $5 a month or just periodically with $5 as needed if you don't want to spend that cash. At first I wasn't sure if it was worth it but it has proven to be very helpful for me, personally.\n\nYou'll see it a thousand times here but I feel like a majority of my classmates did not do this. It's totally fine if you don't, plenty of people pass boards and match without it, but as someone who recently passed Step 1, it made my life so much easier. \n\n**Again, this is more than what you need for right now but just a testimonial for how keeping up with Anki reviews will help in the long run (even though it can really suck):**\n\nIf you have in-house exams or are at a DO school, it might be harder to do but especially if you have NBME based exams, it will make your life simpler in the long run. It is more work class-to-class but when our first CBSE (mock Step 1) rolled around I felt very prepared. I did ~60% of UWorld, two Uworld self assessments, new Free 120 and two CBSEs for board prep on ~2 weeks of \"dedicated\" which was pretty chill overall. \n\nIf you have the opportunity to get an AMBOSS discount, I'd recommend checking that out too. The \"for life\" thing is a lie (it's only for 4 years of med school) but the app is helpful and I completed the Qbank. The questions are geared for learning more than anything but between November and February I did ~30 questions a day and rolling into dedicated I was good to go. I also did most of USMLERx which is a good accessory if you need more practice questions during classes. They're a little easier IMO but it's tied in with First Aid so it's helpful and great reps. \n\nThere are some people who feel that AMBOSS is better than UWorld, I would say...idk. I think UWorld is closer to the real deal but AMBOSS (especially with the Anki addon) is a better every-day learning tool. It's important to treat it that way because the questions will have you pulling your hair out sometimes.\n\nFor practice question resources:\n\n**UWorld:** best for boards/exam prep IMO. Closest (but not the same) as the real deal.\n\n**AMBOSS:** great for learning, especially integrated with Anki addon. Will piss you off frequently. You can set a \"plan\" and it will allocate a certain amount of questions per day. I found this really helpful when classes sort of cooled off and I could focus on Step a little more before dedicated rolled around\n\n**USMLERx:** Great accessory before other Qbanks, a little easier but helpful. Also the easiest to sort if you're trying to target a specific set of topics.\n\n**tl;dr: if you can, keep up with your Anki reviews from class to class. It will save so much time, effort and anxiety come dedicated. GIVE IT A TRY but if you don't like it, that is also fine. I know plenty of successful people who do great without it. I think it's just the easiest way to stay on top of everything long-term.**",
            "From me as an MS4: Among the most important thing when picking a school is knowing your school has a home program in what you are interested in. Even if you do not know what speciality you want to do, try to figure out if you have an inkling interest(literally any type of possible intereste) in a competitive speciality, try to pick a school that has such home programs. That is amongst the biggest thing that differentiates students who match and go unmatch (of course other factors will matter).",
            "I feel like there are a lot of posts on here of M3/4s venting about the toxicity of their school or admin issues. How do we find out if a school is like that before attending? I feel like during interviews/second looks current students are a bit pressured to only say nice things",
            "1. How early should I try to lock in housing? I don't want to miss out on nice places but I also haven't been able to find any potential roommates yet\n\n2. How much time did/do you guys have for your hobbies during preclinical? Between studying, volunteering, mandatory classes, etc. I just have no sense of how much time I'll have left to chill, go gym, etc.\n\n3. How do you actually network to try and make connections with people at hospitals you'll want to apply for residency at in the future?",
            "What are habits that you have developed throughout med school that you wish you would have had from the beginning?",
            "when should i start supplementing my course work with outside resources like uworld/sketchy/pathoma/etc? are those only worth it when prepping for step or should you use them throughout school?",
            "Any recs for incoming medical students who have zero idea what they wanna do specialty wise? what research should you be looking for during M1-M2 if you’re unsure around that time?",
            "For MS0's thinking of specialties...\n\n  \nI am a MS4 graduating matched into gen surg. Coming in I swore I would be doing anything BUT surgery. Thought EM for the first two years cuz I was an EMT. Got into the OR as a M3 and was so scared at liking surgery.\n\n  \nAll of this to say, keep an open mind. Shadow as a M1/2, do the research (esp if you are considering competitive stuff), but remember how while M3 is hard, you will learn what the day to day is like of things you may never have experienced.\n\n  \nWelcome to the hardest, but also coolest 4 years so far 😎",
            "With the match becoming crazier by the day and PIs expecting longitudinal commitment to a specialty, when is the time to explore specialties you may be interested in?"
        ]
    },
    "I made a VSLO/Away Rotation Tracker Spreadsheet for 2024-2025": {
        "title": "I made a VSLO/Away Rotation Tracker Spreadsheet for 2024-2025",
        "score": 133,
        "url": "https://www.reddit.com/r/medicalschool/comments/1c0524n/i_made_a_vsloaway_rotation_tracker_spreadsheet/",
        "content": "[https://docs.google.com/spreadsheets/d/1f55DKSzp-Jzk20Qbhm9jSlJy2YqhEpO4XVr8YwXs\\_k0/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1f55DKSzp-Jzk20Qbhm9jSlJy2YqhEpO4XVr8YwXs_k0/edit?usp=sharing)\n\nSomeone asked, I delivered. If you have feedback/things you think should be added while it's still new, let me know.",
        "num_comments": 66,
        "comments": [
            "Haven't heard back from literally any program at all",
            "I'm kicking myself for not getting on this earlier. The required document gathering and essays are far more tedious than I thought it would be.",
            "Is it cool if I add \"Withdrew\" to the options for status?",
            "Anyone hear back from general surgery yet?",
            "Just found out I got accepted to my top choice! \\[offer sent 5/20\\] haven't been checking because I had kinda given up ngl",
            "When would it make sense to follow up with a program? Sent in app a few days after it opened in April and they said they would start sending out offers on a rolling basis last Monday. Maybe it's just anxiety or is it time to send some emails?",
            "No FM?",
            "Anyone hear any updates on Michigan Neuro? (since we've been told not to contact the program coordinator)",
            "Anyone hear back from U of A for Neuro? They said on VSLO they’d start getting back to people a few days ago. Or anything in DC? How patient should we be? lol",
            "Has anyone heard back from u chicago for Gen surg??"
        ]
    },
    "Why did Harry Potter use Expelliarmus all the time, when he could have used Abruptio Placentae?": {
        "title": "Why did Harry Potter use Expelliarmus all the time, when he could have used Abruptio Placentae?",
        "score": 300,
        "url": "https://www.reddit.com/r/medicalschool/comments/1dlinsk/why_did_harry_potter_use_expelliarmus_all_the/",
        "content": "Really confused, can someone please explain",
        "num_comments": 29,
        "comments": [
            "Well not everyone was pregnant.",
            "\"Harry, I'm pregnant!\" said Ginny\n\n\"FETUS DELETUS\"",
            "Bro he thought casting Proctalgia Fugax was too much of a pain in the ass he never would’ve bothered to learn Abruptio Placentae. That’s what Hermione would do",
            "There’s a fanfiction where Hermione creates curses inspired from medicine like epidermolysis bullosa.",
            "Because, pseudopseudohypoparathyroidism.",
            "Better yet, he could’ve used testicular torsion, but never did",
            "\"STATUS ASTHMATICUS\"",
            "Rectum entra!! 🪄🧙‍♂️",
            "He used truncus arteriosus and then sinus venosus",
            "Bulbus cordis"
        ]
    },
    "And everyone started throwing rotten fruits and vegetables": {
        "title": "And everyone started throwing rotten fruits and vegetables",
        "score": 702,
        "url": "https://i.redd.it/d7c9vxnzky7d1.jpeg",
        "content": "(It never happened)",
        "num_comments": 44,
        "comments": [
            "Glad I’m not the only one who thought that post was silly",
            "And that rotten fruit's name? \n\nAlbert Einstein.",
            "Let me summarize it for you guys. \n\n1. I'm clearly amazing\n\n2. Midlevels\n\n3. They clapped\n\n4. I'm still bowing to this day.",
            "![gif](giphy|l4FGw1FUD0DemljNu)",
            "Imagine being an attending, and regardless of your beliefs, just decide to shit on a mid-level student. I think we're all smart enough to realize that's gonna be at least a 3 hour lecture from HR and an assigned 20 hours of teamwork and safe work environment modules right there. Story was definitely sus, the moment they mentioned the \"ED docs\" being hard to please.",
            "The fact that a fucking ED attending of all people was lauding a student for thinking about antibiotic mechanism of action was laughable. Every ED just gives vanc cef or vanc zosyn if the patient looks like they have any infection. I doubt that ED doc thinks about the mechanism of action of vancomycin even once since medical school",
            "Link?",
            "I feel like I missed something wonderful",
            "Then everyone clapped",
            "What’s this post"
        ]
    },
    "Dealing with a benign brain tumor during residency ": {
        "title": "Dealing with a benign brain tumor during residency ",
        "score": 17,
        "url": "https://www.reddit.com/r/medicalschool/comments/1dlt2tx/dealing_with_a_benign_brain_tumor_during_residency/",
        "content": "I (25F), R1 resident (not in the USA), have been diagnosed in early 2023 with a most probably benign brain tumor ( left 3rd nerve schwannoma or meningioma infiltrating the left cavernous sinus). Clinically, I have a near total 3rd nerve palsy, constant orbital and retro orbital pain and diplopia. \nThe neurosurgeon I consulted in early 2023 suggested a wait and see approach with MRIs every 6 months, since surgery is quite risky. \n\nAs of April 2024, the ptosis is getting more severe, my eylid is 90% closed and my vision acuity went from 9/10 to 7/10 and I feel it getting worse. \nNow the neurosurgeon is suggesting either decompressive surgery or radiosurgery with gammaknife which is not available in my country, so I'm applying for VISAs to try to get it done in a foreign country.\n\nI don't know how to deal with this whole thing AND the stress and anxiety of residency anymore.\nI can't take a LOA til I pass the first year exam which will be in October but I have no will to study, I've been going from doctor to doctor for months to have more opinions on my condition. I feel fed up with hospitals and medicine in general. I just want to take my mind off this whole thing but it's impossible while working in a hospital. \n\nWhat can I do to motivate myself to study ? \nHow would you guys deal with a situation like this? \nSorry for the long rent, I just needed to get if off my chest I guesss.",
        "num_comments": 2,
        "comments": [
            "Hey I am so sorry to hear you are going through this, I would also reccomend cross posting this to /r/medicine as they have a more international community.",
            "You need to get this done and rescue what’s left of your eye. Take a year off if needed. Do not sacrifice your eye for this stupid career."
        ]
    }
}