{
    "Monthly Meditation Challenge - June 2024": {
        "title": "Monthly Meditation Challenge - June 2024",
        "score": 18,
        "url": "https://www.reddit.com/r/Meditation/comments/1d59z3u/monthly_meditation_challenge_june_2024/",
        "content": "Hello friends,\n\nReady to make meditation a habit in your life? Or maybe you're looking to start again?\n\nEach month, we host a meditation challenge to help you establish or rekindle a consistent meditation practice by making it a part of your daily routine. By participating in the challenge, you'll be fostering a greater sense of community as you work toward a common goal and keep each other accountable.\n\n**How to Participate**\n\n\\- **Set a specific, measurable, and realistic goal for the month.**\n\n>How many days per week will you meditate? How long will each session be? What technique will you use? Post below if you need help deciding!\n\n\\- **Leave a comment below to let others know you'll be participating.**\n\n>For extra accountability, leave a comment that says, \"Accountability partner needed.\" Once someone responds, coordinate with that person to find a way to keep each other accountable.\n\n\\- **Optionally, join the challenge on our partner Discord server,** [**Meditation Mind**](https://discord.gg/meditationmind)**.**\n\n>Challenges are held concurrently on the r/Meditation partner Discord server, [Meditation Mind](https://discord.gg/meditationmind). Enjoy a wholesome, welcoming atmosphere, home to a community of over 8,100 members.\n\nGood luck, and may your practice be fruitful!",
        "num_comments": 16,
        "comments": [
            "I'm starting this, 15 mins twice daily to begin with",
            "5 minutes (or more, if I feel like) a day.",
            "I am having a lot of problems with my mind and I see meditation as the only solution. I was doing it a year back as well but couldn't stay consistent. \nI am going to start again now, with 5 days a week.",
            "5 min a day, probably start at night laying in bed with box breathing. Connecting to and focusing on breath has always helped my mind to wander less.",
            "I've never put much stock in meditation, but I did 5-10 minutes 2-3 times earlier, in an attempt to center, ground, heighten awareness, mindfulness, etc., and I felt like I was achieving the desired effect. I'd like to do more, but I think 15-20 minutes is a safe bet for now. I know little to nothing of technique, and have just been following a book I'm reading, and guided videos, both on mediumship. I don't need to be held accountable, but I'm open to some direction.",
            "I am going to make time to meditate everyday.",
            "meditation 1 hour every day different techniques accountability partner needed",
            "Really, its difficult man, but if you done that, then I really appreciate it.",
            "Want to buddy up? My goal is 20 minutes a day everyday",
            "Consistency is key! Good luck :)"
        ]
    },
    "A Buddha quote about being happy. Its almost like a maths formula": {
        "title": "A Buddha quote about being happy. Its almost like a maths formula",
        "score": 27,
        "url": "https://www.reddit.com/r/Meditation/comments/1drarsz/a_buddha_quote_about_being_happy_its_almost_like/",
        "content": "# A man asked the Buddha, \"I want happiness.\" Buddha said, \"First remove \"I,\" that's Ego, then remove \"want,\" that's Desire. Now you are left with only \"Happiness.” ― The Buddha",
        "num_comments": 3,
        "comments": [
            "this is a fake quote, sorry to say.",
            "Probably apocryphal, but charming",
            "Here's one Buddhist monk's (US Theravadin, Thai Forest tradition) take on \"ego\" and what's to be \"removed\":\n\nhttps://www.dhammatalks.org/audio/evening/2014/140508-ego.html\n\nParaphrasing a lot: there's no need to remove the \"ego\". Just recognize it for what it is and is not."
        ]
    },
    "How can I love myself?": {
        "title": "How can I love myself?",
        "score": 12,
        "url": "https://www.reddit.com/r/Meditation/comments/1dr6jwr/how_can_i_love_myself/",
        "content": "Since  puberty and even before that, I hated my self I hated my face, my body and now when I’m a good looking man I keep finding some flaw in myself, and the bad part is I end up finding them and hating myself again, I feel like I don’t deserve love and anything because I’m ugly\n\nIs there any meditations or techniques to stop hating myself, to heal from year of hate speech against myself? Thanks ",
        "num_comments": 14,
        "comments": [
            "Use the following chant for 4 different people: A friend, a stranger, an enemy and yourself:\n\nMay you be happy; May you be free; May you be at peace.",
            "Mett bhavana, commonly translated as loving-kindness meditation, is what I'd suggest. This is a technique that deals specifically with resentment, hatred and ill-will. Both towards oneself and towards others. It's a simple method and it works wonders. It is also a potent concentration practice, and concentration is intimately linked to joy, happiness and ease. Every ill-will type personality meditator will benefit greatly. It has changed my life for sure. I'd recommend you to check out Tara Brachs guided meditations. Her instructions are generally very well suited for meditators with anxiety etc.",
            "Go to a meditation class first, get guidance first.",
            "You said youre a good looking man now, list out everything you find attractive about yourself, always focus on these things. Everybody has some flaws, dont worry too much about that. Also sometimes its the flaw that makes you unique as an individual. ",
            "love is an action you do. Try going to the gym to get active, get your goal figure, dress the way you want, and feel gorgeous. Accept every aspect of yourself so that you can appreciate yourself, and avoid comparing yourself to others. you can do it step by step and don't be to harsh on yourself. ikaw na mismo ang tumanggap ng uniqueness mo para makita rin ng ibang tao yon sa'yo ",
            "Start by looking at your hands. Look at your fingers look at the tiny lines and craters in your skin look at how much detail there is even in an inch of your body. now look at your room, the walls are empty and plain. there is nothing there no complexity or lines in the walls. see how much better it is to stare down and up on your whole body than sit there in fron of a tv or a phone watching small clips of living things doing things. Youre also a living thing and the best one you got. you have your life only, and nothing else.",
            "Try r/mindfulness. When those thoughts occur focus on the present moment.",
            "Thanks man I just did it and it is giving me\nSome feelings and peace Ive never felt before  thank you so much ",
            "This really works. It's called Metta, or sometime Metta meditation",
            "You are not your thoughts, not your emotions and not your physical body.\n\nRealize this and sit on it.\n\nGo through these different feelings and feel the pain of release of these identifications."
        ]
    },
    "What got you into Meditation/mindfulness? Let's share our reasons!": {
        "title": "What got you into Meditation/mindfulness? Let's share our reasons!",
        "score": 11,
        "url": "https://www.reddit.com/r/Meditation/comments/1dr686s/what_got_you_into_meditationmindfulness_lets/",
        "content": "Hey everyone, I wanted to ask: What made you start mindfulness? For me, it was the insane workload – I work 7 days a week, 11 AM to 6 PM, but it often stretches till 10 PM. The constant grind was draining me, and my friends suggested trying mindfulness to cope. I was skeptical at first, but I gave it a shot. Now, I’m curious, what pushed you to start? Was it work stress, personal issues, or something else? Let’s share our stories or just a reason and maybe help each other out!",
        "num_comments": 23,
        "comments": [
            "Yes, I came to mindfulness due to my social life issues, mainly loneliness",
            "As a kid together with a friend we had the plan to be in the same dream and then have cool dream adventures together. Unfortunately this didnt work out. However it got me interested in lucid dreaming. I started to read through related forums to grasp all the knowledge there is about it. There I stumbled across an experienced user who said that if youre able to meditate lucid dreaming will be the easiest thing in the world. So I bought my first book about meditation called Meditation for Dummiesand started meditating. By now (Im in my 30s) the focus of meditation has shifted (lucid dreaming is still cool but you need heaps of time for practicing) but I still do it, sit meditation retreats and constantly learn new things about it. Im really thankful of how it all went.",
            "I was interested since years but I couldn't stick or do it due to the boredom. Only when my ex girlfriend blindsided me and left me out of nowhere (for me) and I lived one of the most painful, frustrating period of my life I started, it was the only to calm my mind fow at least few minutes",
            "I started because I had intense social anxiety in college. It took a long time to even be able to do 15 minutes, and I don't think I noticed any changes within the first year. But after my practice deepened, I realized meditation is useful for all kinds of other problems that nearly everyone has. Now I meditate daily for at least 20 minutes, although my maximum is well over an hour.",
            "I started because I have OCD (obsessive and compulsive disorder), so meditation helps me to accept my intrusive thoughts and to live in the present moment. Sorry for my bad English, Im studying it!",
            "I had a one with the universe experience on lsd and wanted to explore more with consciousness",
            "My massage therapist mentioned that he meditates while massaging, which sounded nice to me. So I started meditating and am considering becoming a massage therapist.",
            "Star Wars. I was 8 when I saw Jedi being tuned in to the Universe around them. Went home and started meditating.",
            "Struggled with depression and severe difficulty in emotional regulation. Was always lashing out at people till I lost everyone I care about. I started meditating and I feel much better now. Im in control of my mind and Im monitoring my emotions and thoughts constantly",
            "Quit drinking , got into neuroscience. Body mind connection. Understanding myself became a want. It's an Neverending learning experience to say the least."
        ]
    },
    "Laws of Reality (i.e. cause and effect, power of attention) ": {
        "title": "Laws of Reality (i.e. cause and effect, power of attention) ",
        "score": 2,
        "url": "https://www.reddit.com/r/Meditation/comments/1drcplk/laws_of_reality_ie_cause_and_effect_power_of/",
        "content": "I’d like to start a discussion, and while this is not necessarily about meditation, I’ve found meditation to be an essential tool in understanding these ‘laws of reality’ and letting them work.\n\nI’m curious to hear what you all have come to understand about the Laws of Reality, be it your take on the 2 examples below, your articulation of and experience with other laws, or anything else that comes to mind for you. \n\nExamples: \nLaw of Cause and Effect: that which is alive within you internally (cause) leads to the creation and unfolding of your external reality (effect). | Meditation allows one to expand on calm restful states which will help to organize a cluttered mind and lead to less resistance of our external reality, allowing for things to eventually shift for us, if we are able to maintain the needed wavelength to see it and stay the course. \n\nLaw of Attention: Put simply, where energy goes energy flows. | Meditation allows you to give energy to your body, also allows you to visualize to give energy to your desires or hopes, etc. \n\n",
        "num_comments": 1,
        "comments": [
            "When I was younger, I used to be very concerned about what path to take in life to be happy. Where should I live, what environment would be best for me,... \n\nI've since learned that those things aren't even close to as important as the attitude I approach my life with. The environment isn't half as important as how I approach it. \n\nIn other words, no matter where you go, there you are."
        ]
    }
}