{
    "1936 concept of making the Eiffel Tower accessible by car": {
        "title": "1936 concept of making the Eiffel Tower accessible by car",
        "score": 11460,
        "url": "https://i.redd.it/jjm7s6p1wb9d1.jpeg",
        "content": "",
        "num_comments": 286,
        "comments": [
            "Matchbox garage vibes on the ramps.",
            "This plan was moving ahead in 1936, but there was a change in government in 1940 that had a different vision for France",
            "If the Eiffel Tower was in the US:",
            "This is the silliest fucking thing Ive ever seen",
            "They really had a hard on for making everything accessible by car. When I went to Carlsbad Cavern, they said there was a drilling expedition to make the whole thing car friendly. ",
            "I had a dream about this once, freaky.",
            "Twisted metal did it! Just use teleporters",
            "Yeah I'm on /r/fuckcars side.\n\nYou should cross post this there. They'd love roasting whoever designed this monstrosity.",
            "It was accessible by car in Twisted Metal 2",
            "Oh, will there be a Starbucks drive thru..."
        ]
    },
    "I don't care what anyone says, I love Godzilla(1998). It was the stuff of nightmares for a 9 yr old me. ": {
        "title": "I don't care what anyone says, I love Godzilla(1998). It was the stuff of nightmares for a 9 yr old me. ",
        "score": 130,
        "url": "https://www.reddit.com/gallery/1dr6prv",
        "content": "",
        "num_comments": 18,
        "comments": [
            "It's a good movie, some people didn't like how weak this Godzilla was.\n\nEven though the baby scene was a Jurassic park rip off I always enjoyed the monsters that would just mob you with numbers.",
            "I was 10 and I love the movie! Had to watch it in 2 parts the first time. I kept hiding behind my dad ",
            "If it was named literally anything else, it would have gone down as a box office monster hit. I loved it. I just skip the old man _GodzillaGodzillaGodzilla_ part.",
            "I love this movie to shit!! I still remember first time hearing the sound track before seeing the movie, jump scared the f out of me . Wish i could watch it again now",
            "I also thought Jay Reno in it was so cool. He was miles better than any modern godzilla movies human character from hollywood.",
            "I've seen this move 100,000 times as a kid, and was pretty shocked to learn people hated it as I got older. Though, I haven't seen it since I was little.",
            "I love this movie! Its my go to one that I can watch over and over!",
            "I also love this movie, and even say that it's better than anything from the new Godzilla monsterverse!",
            "And i hate to Admit it this was before my discovery of rock. But puff daddy come With me with Plants scream and kashmir Sample of led. Zep was fire.\n\nI know Better now. But that banger is etched in my head.",
            "The size inconsistency in these photos is ridiculous."
        ]
    },
    "Giant castle looking house we saw while driving down a road we've never been down before!": {
        "title": "Giant castle looking house we saw while driving down a road we've never been down before!",
        "score": 109,
        "url": "https://www.reddit.com/gallery/1dr36w3",
        "content": "What could it have been used for?",
        "num_comments": 33,
        "comments": [
            "Do you have an address  or  know approximately where this is ? I want to see the zillow listing!",
            "Its ugly but I love it still",
            "Castle shit. That place must be a motherfucker to keep up with cleanin, paintin..maintenance.",
            "It looks like some video game nonsense where the building just continues to add random parts to itself.",
            "Might want to check for some imaginary friends",
            "\"What remains of Edith Finch\" plays there, I believe",
            "This is more like a Disneyland castle or a castle as seen by American people than a real castle.",
            "That arched two car garage that you cant get two cars into because of the arch. Nice.",
            "This structure's defences are poor...  Lend me 300 bannermen and I will take this for us.  We can add a secondary wall and expand it into a star before winter hits",
            "Is that Fosters Home For Imaginary Friends?"
        ]
    },
    "Sea Creature' In Wisconsin": {
        "title": "Sea Creature' In Wisconsin",
        "score": 24,
        "url": "https://i.redd.it/yo3f2b2pbi9d1.png",
        "content": "",
        "num_comments": 5,
        "comments": [
            "im gonna need some more context on this one",
            "Is this the whale from the house on the rock?!",
            "Thats going to come to life and eat you",
            "looks like it! that place is WILD haha",
            "\"Just don't look. Just don't look.\""
        ]
    },
    "Gantry crane falling into the sea due to heavy winds": {
        "title": "Gantry crane falling into the sea due to heavy winds",
        "score": 385,
        "url": "https://v.redd.it/k7d98sownd9d1",
        "content": "In Gdansk, Poland. Makes me feel deeply uneasy.",
        "num_comments": 36,
        "comments": [
            "Shoulda tied it down, used some bungee cords",
            "There she goes, there she goes again.",
            "\"That's fine. We'll just use the gantry crane to pull it out of the...oh.\"",
            "Well, that was an expensive mistake",
            "Who forgot to put the parking brake on???",
            "When you are about to fall asleep at home and remember that maybe you forgot to apply the brakes, but then you think nothing can move that huge crane.",
            "This happened in The Abyss.",
            "There goes my hero.  \nWATCH HIM AS HE GOES",
            "honestly if i was there i wouldn't have let that happen",
            "Now play it in reverse."
        ]
    }
}