{
    "meirl": {
        "title": "meirl",
        "score": 2184,
        "url": "https://i.redd.it/3ch2eezynf9d1.jpeg",
        "content": "",
        "num_comments": 32,
        "comments": [
            "Too true! I took 10 years of French by high school thanks to an early education second language program. I can still understand it, read it, and write it, but grade be damned I would almost never speak it. Passed every year, but always felt like an idiot trying to get the accent down.",
            "Why would you learn a dead language?",
            "I studied Irish on Duolingo for months ahead of our trip to Ireland. During our entire stay in Dublin I encountered only two actual native-born people from the country. Every single other person I dealt with—granted, they were in the service industry—were foreigners working there, struggling with English. Irish was out of the question for them.",
            "So, you just learned to dance sarcastically???",
            "I bet an English person is behind this meme…",
            "c'est bien, continue à perdre ton temps bébou",
            "A true gentleman is someone who knows how to play the bagpipes but choose not to.",
            "Une telle motivation, ça force le respect.",
            "naw i aint even trying to speak your funny words MARE-SEE",
            "\"Je comprends mais je ne parle pas\""
        ]
    },
    "Meirl": {
        "title": "Meirl",
        "score": 41617,
        "url": "https://i.redd.it/qievgy8drb9d1.jpeg",
        "content": "",
        "num_comments": 858,
        "comments": [
            "—don't tell anyone we had sex\n—but we hadn't\n—good work",
            "am i the only one who had a stroke reading that",
            "I am most DEFINITELY out of the loop of SOMETHING. What that something is, ***I don't even want to know.***",
            "They don't think about it. They've been trained to just change the subject.",
            "Americans, answer me, what is this all about?",
            "Trying to solve this feels like trying to do calculus while sleep-deprived and caffeinated",
            "Pretty sure no one that was going to vote for him actually cares.",
            "“What are your plans to tackle the high cost of daycare?”\n\n“IMMIGRATION”",
            "I wish someone would pay me to say we didn’t have sex",
            "Here's the rub. How can anyone think a man who slept with a porn star while his wife was giving birth cares about them and their family when he doesn't even care about his own family?"
        ]
    }
}