{
    "Meirl": {
        "title": "Meirl",
        "score": 6541,
        "url": "https://i.redd.it/9h3oxvbdv08d1.jpeg",
        "content": "",
        "num_comments": 66,
        "comments": [
            "“Grandpa, what point in time during your years on this earth would you say lead to the downfall of human civilization?”\n\n\\*sighs heavily, tapping pipe on mantel\\*",
            "\"Oh mom, I don't WANT to visit grandpa! He always tells cringe stories about the past and smells like birthday cake!\"",
            "One trick is to tell 'em stories that don't go anywhere, like the time I caught the ferry over to Shelbyville. I needed a new heel for my shoe, so, I decided to go to Morganville, which is what they called Shelbyville in those days. So I tied an onion to my belt, which was the style at the time. Now, to take the ferry cost a nickel, and in those days, nickels had pictures of bumblebees on 'em. \"Give me five bees for a quarter,\" you'd say. Now, where were we? Oh yeah, the important thing was I had an onion on my belt, which was the style at the time. They didn't have white onions because of the war. The only thing you could get was those big yellow ones..",
            "grandma keeps forgetting she's already told us this story a thousand times",
            "What kind of sorcery is this? Where do I get one?? I like my Cresco, but a pipe is classy.",
            "r/DidntKnowIWantedThat",
            "Vipe",
            "Ceci n'est pas une pipe",
            "I don't think you should smoke crack around kids, sir.",
            "obligatory \"Now where could my pipe be?\""
        ]
    },
    "meirl": {
        "title": "meirl",
        "score": 1584,
        "url": "https://i.redd.it/p4fguchry18d1.png",
        "content": "",
        "num_comments": 17,
        "comments": [
            "For a second I thought the first picture was two people trying to hold the eagle down",
            "This aint real.\n\nUnless the fucking giant condor has resurrected from extinction.",
            "Eagles rarely land like that. It's probably injured and needs help. Call a professional so it doesn't claw off you're face. They're aggressive as shit",
            "Run at it while singing rule Britannia",
            "My country Tia of thee..",
            "The delivery guy's pet falcon arrives before your Amazon package does",
            "Vote or die - this is the future republicans want smh my head !!!!!1!!!1!",
            "Just Don't comment on how they sound nothing like they do on TV.\n\nThey hate that",
            "Time to take out the silver sword with archi-griphin potion",
            "If you've got any oil I'd hand that over to it too"
        ]
    }
}