{
    "Restricting political posts": {
        "title": "Restricting political posts",
        "score": 34,
        "url": "https://www.reddit.com/r/memesopdidnotlike/comments/1bqj8lk/restricting_political_posts/",
        "content": "First off, apologies for delaying the outcome of the recent poll (https://www.reddit.com/r/memesopdidnotlike/s/DbbahUEg70).  After much deliberation, our mod team has decided using the data gathered from the poll to restrict political posts to the weekends, like BoysAreQuirky posts.  This is a trial ban on political posts, and we may adjust the policy in the coming weeks. The action taken is the limitation of these kind of submissions since more people chose some form of 2 day restriction over an outright ban (126 as opposed to 83).\n\nThanks for your understanding !",
        "num_comments": 56,
        "comments": [
            "We announced this now, opposed to during the weekdays to avoid confusion on when this goes into affect.  I’m definitely in the boat that the ban on politics is cringe, but here we are.  This is what a majority of the sub voted for.  As stated by the auto-mod, this restriction is in a trial phase for two weeks minimum.\n\nWe understand this decision is going to upset lots of you, but we promised our community as mods that we serve them first and foremost.  And by doing that, we’re going to honor the results of the polls.  The validity of the polls is definitely questionable (we’re not going to gaslight you like a certain country’s election, if you get my drift).  \n\nIt’s definitely questionable how much interaction a poll gets versus traffic in a community.  When many users interact with our subreddit, it is likely through their feed.  The feed pushes recent or trending posts, not polls.  Polls are only “visible” to a subset of our community, usually longtime engaged members.  This sub has only become as political as it has in the last several months.  The older part of our community expresses a great disdain for the direction of our subreddit, and petitioned to ban politics.  And naturally, as mentioned before, this dedicated subgroup was far more likely to vote in the polls than the average demographic.\n\nI tried to bring the community’s attention towards this monument decision process by bringing attention towards it, namely through sticky comments on posts regarding this topic.  But I’m not going to lie to you to cover my ass.  I failed greatly in this regard.  In hindsight what I should have done was edit the automod comment on every post to mention the various polls and links to them.  I know most people don’t read that automod comment, but at least it would have drawn more awareness towards this.\n\n~~This is probably just me feeling butt-hurt that my side on this matter lost out…~~.  Please share your honest thoughts on this posts, the most valuable thing to our team is community feedback.  We allow dissenting views here, we encourage you to speak your mind!",
            "Darnit, that's half the sub gone!",
            "https://preview.redd.it/szxym9py69rc1.png?width=1080&format=pjpg&auto=webp&s=b02950720ab897581a7a77ea7f7e882c9b8b36c0",
            "just delete the reddit if you're just gonna slowly turn it into garbage. Everything can be political on reddit geniuses. The people who voted are the ones who hate visit this reddit.",
            "There needs to be a place for criticism on other echo chambers where people get perma bans for speaking against the narrative. This weekend thing is cringe.",
            "What defines politics?  Obviously a shot at the president is politics.  What about the bridge crashing?  Thats news but not politics.  Also I feel like identity politics is politics in name only, can someone clearly define lines?",
            "Why who wants this? Lol",
            "Fake and gay.\n\nIf someone decides to make a r/basedmemesopdidnotlike lmk",
            "One by one every subreddit gets more and more restrictive on what you are and are not allowed to post. Unpopular opinions doesn't allow generational posts, you get kicked off of every Star Trek page if you are even mildly conservative, dankmemes is just gone. \n\nWon't be long and all social media apps will just be completely sterilized but dead. I for one can't wait. It's going to be hilarious.",
            "Aaand here’s what I was looking for. I wanted to make a post analyzing the situation that people (political left and political right) argued about (was about transgenderism and transphobia) and I tried commenting a few times to no avail. I made a joke to myself saying “oh they’re censoring this” but i refresh and then nothing. I go to my history and see a mod pinned comment saying the post has been being removed. I wanted to voice my opinion to the mod but couldn’t so I looked for a mod list but found this. I’ve decided to voice my opinion here without being aggressive but still affirmative: \n\n\nI am strongly against this\n\nThis is censorship and I feel that this should be discussed.\n\nI understand that people could argue about this elsewhere but when you have a post and then censor it, you cut off arguments that could be very valid or progressive, and I do believe it’s important to have these arguements when the whole point of this sub is to have posts that are based upon disagreements between the first OP, the Reposter, and the r/memesopdidnotlike reposter"
        ]
    },
    "Someone's mad!": {
        "title": "Someone's mad!",
        "score": 417,
        "url": "https://i.redd.it/tymm06512f9d1.jpeg",
        "content": "OOP was right.",
        "num_comments": 96,
        "comments": [
            "Ensure that you read and adhere to the rules; failure to do so will result \nin the removal of this post.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/memesopdidnotlike) if you have any questions or concerns.*",
            "Whenever you hear the moral panic over \"misogyny\", remember this benign shit is what it's about.",
            "While it’s boomer humor and it doesn’t describe ALL women it still is based",
            "Well, that's facepalm sub reddit, which is for total morons.",
            "Its not that funny, but its also not offensive.\n\nHowever, the fact that it offends people, it what makes it valuable.",
            "on a real note i hate bathroom signs that aren’t clearly labeled\n\nbut it is pretty funny",
            "It's dumb, but it's not offensive.\n\nPersonally, I always found the \"women talk more than men\" stereotype to be kind of funny, since it is the opposite in my household. My dad will talk with his friends for hours, on the phone, in the middle of the living room. lmao",
            "Dumb joke but not offensive. When it comes to my husband and I, I will talk his ear off about whatever. I'll ask him how work was... maybe he has a story. Nope nothing. \n\n\nThen before we go to sleep he just all of a sudden REMEMBERS HES GOT THE JUICIEST NAIL BITING STORY EVER TO SHARE AND OF COURSE I CALL MY MOM THE NEXT DAY AND TALK HER EAR OFF ABOUT IT!",
            "Ah yes, the two genders:\n\nIntrovert and extrovert",
            "I’m more mad they don’t spell it with an H"
        ]
    },
    "OP when the boomer comic isn’t 100% lore accurate (literally the death of comedy):": {
        "title": "OP when the boomer comic isn’t 100% lore accurate (literally the death of comedy):",
        "score": 909,
        "url": "https://i.redd.it/s6z0pqxtpc9d1.jpeg",
        "content": "",
        "num_comments": 70,
        "comments": [
            "Ensure that you read and adhere to the rules; failure to do so will result \nin the removal of this post.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/memesopdidnotlike) if you have any questions or concerns.*",
            "No reason not to have made it Batman's Grandma",
            "Spiderman begins to regret giving his Uncle Ben the keys to his Spider-Car.",
            "That's basic fucking knowledge though, Batman's an orphan",
            "I mean, witnessing the murder of both of his parents pretty much the only concrete detail of his backstory and definitely the most important.",
            "I found it funny, but I understand why others wouldn’t",
            "Nah im with them on this. Its pretty much household knowledge.",
            "I'm sorry, I have to agree with facepalm.\n\nThis is a cliche which would have been fine if it wasn't about Batman- losing his parents is like his whole deal.\n\nIf you show this to anyone who knows Batman- this would be the reaction.\n\nhttps://preview.redd.it/m3uxfqelfd9d1.png?width=1440&format=pjpg&auto=webp&s=727abeb6e04b5ca629eb22443d8023434db80418",
            "Op is exhibiting Boomer-ish behavior",
            "https://preview.redd.it/n8i6bo787e9d1.jpeg?width=1217&format=pjpg&auto=webp&s=e8838f252ea454c2457357ddb8460c17ff3ab300"
        ]
    },
    "But this was funny": {
        "title": "But this was funny",
        "score": 339,
        "url": "https://i.redd.it/2ueh0f6joc9d1.png",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Ensure that you read and adhere to the rules; failure to do so will result \nin the removal of this post.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/memesopdidnotlike) if you have any questions or concerns.*",
            "I like the joke.",
            "r/ComedyCemetery having the humor of a lobotomized edgy teenager.",
            "Yes good meme lol",
            "That's a new one, lol",
            "Wait until they hear Robert Brownie Jr",
            "Reminds me of a cracked commenter who pitched their idea for a comic about a Muslim vampire living in 1850s Japan. The title was Mosque-Edo",
            "“Clams he invented a unicorn that he rode to the moon”",
            "The world if Elon actually got drafted and fought in Angola",
            "*rimshot.wav*"
        ]
    },
    "Ain't no way op thought this is serious💀": {
        "title": "Ain't no way op thought this is serious💀",
        "score": 1284,
        "url": "https://i.redd.it/0rjnmewyy49d1.png",
        "content": "",
        "num_comments": 238,
        "comments": [
            "Ensure that you read and adhere to the rules; failure to do so will result \nin the removal of this post.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/memesopdidnotlike) if you have any questions or concerns.*",
            "We need to find the seller",
            "For context, this was also tag as conspiracy theory as well.",
            "When you said these were all the same glasses I for some reason saw Meryl Streep’s disappointed face.",
            "I didn’t know they put Jeffrey dahmer in meme form",
            "Have all the responses made it clear to you yet that op was serious?",
            "It is true.",
            "*dead beagles have entered the chat*",
            "Where's the lie?",
            "How do we know it wasn’t serious? Lots of people on facebook are convinced Fauci is a mass murderer. \n\nHave you ever actually used Facebook? This is on brand, and is also a terrible meme"
        ]
    }
}