{
    "R/Memes now has fewer rules!": {
        "title": "R/Memes now has fewer rules!",
        "score": 5410,
        "url": "https://i.redd.it/y2r4uhez26sc1.gif",
        "content": "",
        "num_comments": 242,
        "comments": [
            "So, basically the same 12 rules, just listed two at a time?",
            "Reddits are the chosen people",
            "A blessing from the lord!!",
            ">Incorrect use of POV\n\nFUCK YES",
            "Gd this gif is funny",
            "did you remove the karma rec? because if so, then all the karmafarming i did was for nothing",
            "So wait, one of the slabs had 6 rules written there while the other 2 had only 3, or maybe 2 really long ones and 4 smaller ones, and the broken one had six really short ones?",
            "There are 35 rules on the sidebar alone",
            "Can I say the word YouTube now",
            "History of the world part 1?"
        ]
    },
    "We illy live in a society": {
        "title": "We illy live in a society",
        "score": 11213,
        "url": "https://i.redd.it/2bpil85pwg9d1.jpeg",
        "content": "",
        "num_comments": 351,
        "comments": [
            "I don't know the guy. And considering the context this might be for the better",
            "Thanks dude. I tried punching the guys face through the screen and now I have a cracked phone screen. You should really be thinking about these things before you post stuff on the internet. Be better.",
            "I mean his stuff is “interesting” but literally it’s a copy paste reaction. If he presented his information in a fun unique way that would be cool, but now I’m just explaining the meme ig.",
            "He looks familiar, but I can't recall when I've seen him.",
            "Honestly, it's one of the most punchable faces I've ever seen.",
            "I watch Jarred Jermaine's shorts for the music and sample breakdowns, his reactions are lazy af tho",
            "Out of any lazy shorts creators, you pick the least laziest one",
            "Who TF is that guy?",
            "Well Mr. Beast spent literal years on the most idiotic videos imaginable with the only goal of becoming viral. I’d say he’s on the Mount Rushmore of undeserving people in this world",
            "Ah green screen assholes stealing everyones content for money"
        ]
    },
    "A changed man now ": {
        "title": "A changed man now ",
        "score": 2094,
        "url": "https://i.redd.it/jh7f7zksmh9d1.jpeg",
        "content": "",
        "num_comments": 57,
        "comments": [
            "She's asking about the chicken you were supposed to put in the oven",
            "Stick it in her ass, she'll know it's in",
            "The response is “I can’t tell”.",
            "Yes, are you numb down there?",
            "We going into depression with this one 😞",
            "\"I cant tell\" is the correct response",
            "Honestly it'd have to be really small for her to not be able to tell right?",
            "Im curious. Is there really a time where a girl could not feel if it is in? Or is this just a meme for having a small beaner",
            "\"I didn't know that I was playing in a cathedral...\"",
            "The correct answer is , “idk I don’t feel anything, squeeze tighter”"
        ]
    },
    "Don’t mess around with a guy in shades": {
        "title": "Don’t mess around with a guy in shades",
        "score": 1075,
        "url": "https://i.redd.it/6pfp2w6gmg9d1.jpeg",
        "content": "",
        "num_comments": 27,
        "comments": [
            "Is it me or does the guy have one giant nostril.",
            "Half the hotties on the beach are topless all the time! \\*laughs in bisexual\\*",
            "*laughs in bisexual* tig ol bitties",
            "Out of sight out of mind",
            "The very sneaky glance sideways",
            "you’re not doing anything wrong if no one finds out",
            "“haha i’m a creepy incel isn’t that funny”",
            "“The guy” was *three time Mistuh Univus so teknicully he wuz en chage of duh entiyah univus*",
            "Feel that * laughs in gay *",
            "How did we make two *laughs in bisexual* comments almost at the same time lol"
        ]
    },
    "Windows Logic": {
        "title": "Windows Logic",
        "score": 4156,
        "url": "https://i.redd.it/nv0ea77jdd9d1.png",
        "content": "",
        "num_comments": 86,
        "comments": [
            "Being part of the Administrators group means you can escalate to SYSTEM, which, then, yeah, you can do whatever you want.",
            "I be so confused. I'm like. This my computer. I bought it. Who else the admin if not me. Make it make sense!",
            "Being admin on windows nt doesn't mean have God permissions like root/superuser with unix what, anyways you can always abuse NT authority but if you are modifying a file that needs that you probably should not be modifying said file",
            "This is me trying to delete McAfee",
            "Honestly, I don't blame Windows. Most people are probably better off without having access to sensitive system files. And the people who are knowledgeable enough to mess with those files, most definitely have the knowledge to adjust permissions.",
            "Those files are protected because you’ll absolutely ruin your install of windows otherwise. The kind of people that know how to safely change those files are also the kind of people that know how to get around those protections. If you don’t know how to do that yourself then you have no business messing with anything in there.",
            "go back to 10 lol\nalso there are ways to tell it \"uh nah mate fuck you i own this machine\" but you dont know them, and according to mircosoft, if you dont know em, you shouldnt (which imo is genius cuz it ususally prevents mfs from borking their pc, but its also dumb cuz it leads to shit like this)",
            "I believe in  *sudo rm /*  supremacy.",
            "Why are all my firewalls gone?",
            "This is basically OS trying to protect itself from users who have no idea what they're doing and what consequences there are.."
        ]
    }
}