{
    "what is that": {
        "title": "what is that",
        "score": 25791,
        "url": "https://i.redd.it/uhiorwys1f9d1.png",
        "content": "",
        "num_comments": 779,
        "comments": [
            "Maybe it was left to intentionally drive modern people crazy. We never change.",
            "I mean... could it not simply be a popular decorative bauble? Could it have anything to do with weaving? Is there no context with which these curious things were found, no consistency in the use of the room with which they were stored each time they were discovered?",
            "Fun Fact: They likely did write it down. Unlike the items, the writing did not survive.",
            "Socket four fossils into it and use it to reroll a rare item with weighted modifiers.",
            "But cats definitely know how to use them.",
            "My money is on them overthinking it and it's just some decorative thing you'd put on a coffee table.",
            "These are viruses. Thousands of years ago they were easy to avoid, you could just walk around them, but over time they evolved to be smaller and more difficult to see.",
            "Somehow I find myself in both scenarios when I code something which I deem simple enough of not needing documentation.. then looking at it few months later and not knowing why or how to use it anymore.",
            "It's for ritual purposes you dummy!",
            "I read somewhere that it MIGHT have been a type of masters test for blacksmiths and the like! Apparently multiple different sizes have been found and some believe that they were made to test their skills in order to become a master smith... makes sense, obviously I suppose no one knows for sure but.."
        ]
    },
    "Lol.": {
        "title": "Lol.",
        "score": 2114,
        "url": "https://i.redd.it/tfcjo4xfjh9d1.jpeg",
        "content": "",
        "num_comments": 34,
        "comments": [
            "This is very real. I've known one guy since sixth grade and I've never met his wife. I didn't even go to their wedding because I didn't feel up to an eight-hour drive. He moved to, like, three different states and didn't even tell me, yet he'd message me out of the blue like, \"Dude, the Castlevania anime is pretty sick.\" Cool, what's your wife's name again?",
            "Lol. I'm a dude and my friends made drama about being my witnesses, let alone usual marriage politicking.",
            "I love how this meme perfectly captures the essence of bro friendships. It's all about those random, sporadic connections that never fade, even with time and distance",
            "Yup. A childhood friend of mine enlisted in the army. 8 years later he knocks on my door out of the blue random and when I open it without missing a beat says “hey sir, we’d like to talk to you about your cars extended insurance” kid you not. Didn’t even call or anything. Come to find out he had a kid, a wife, did two tours, shot a guy in Korea (as part of his service) bought a house, etc. we last saw each at like 18 and at 26 the fist thing he does is a bit. Being a guy is insane.\n\nTo be fair, I did the same thing to one of my friends. I saw a friends name on the list of guests scheduled at momocon. 13 years since we last talked and I just went up to him after his panel and you would have thought we saw each other last week.",
            "The bros only care about if you’re eating good food and playing cool games and shit.",
            "I’m a woman with a straight man for a best friend. I called him immediately to tell him and ask him if our deal was still on. He said, “hell yeah, I’ll be my Best Woman’s Man of Honor! What color is my dress? Can we make it super short? My legs are my best feature.” 😂",
            "i like how the bulk of men's humor is about how their friendships with their bros lack emotional depth and then they turn around and complain about how women don't care about their mental health 😐",
            " Have a few friends who dont know i got into a relationship so thats gonna be fun when they learb that",
            "Man, I can totally relate to this. It's wild how friendships can evolve over time, especially with long-distance. The sporadic messages about random stuff like Castlevania are so spot on - it's like you can go months without talking, then suddenly pick up right where you left off on the most random topics.  \n  \nP.S. The Castlevania anime is indeed pretty sick.",
            "I have a friend in highschool that got married, HAD A KID and then i noticed the photos in his facebook profile lmao."
        ]
    },
    "They need a Daddy ": {
        "title": "They need a Daddy ",
        "score": 1279,
        "url": "https://i.redd.it/ix8uzmmamh9d1.jpeg",
        "content": "",
        "num_comments": 69,
        "comments": [
            "Prostitution runs in their family",
            "Prostitution ❌ \nFamily business ✔️",
            "Their collaboration will be legendary.",
            "Mother on the right onlyfans name ?\nMy friends are so annoying they keep asking me that",
            "Do you guys have a name? My friends asks so he can ignore it.",
            "Being proud of your daughter for having an onlyfans is actually disgusting",
            "Incest porn shouldn't exist.\n\n![gif](giphy|3o6Zt8rGMqVwjYAlsA)",
            "Gross! Think they'll do a cross over episode?",
            "Holy shit imagine the whole entirety of your family beinc composed by whores",
            "That's it. This sub is officially nothing but middle school cringe."
        ]
    },
    "Pay him": {
        "title": "Pay him",
        "score": 1478,
        "url": "https://i.redd.it/4ywxwe6l2h9d1.jpeg",
        "content": "",
        "num_comments": 24,
        "comments": [
            "There is never a bad time to play the MK theme.",
            "I need this one for my wedding, I'm paying extra should he instigate a brawl",
            "Can I get this guy for my wedding?",
            "Pay that dj double! \n\nWhat a GOAT",
            "DJ's job has gone from being the guy with the record collection and sound system (both things that used to be hard and expensive to acquire) to being the guy who 'feels the crowd'.",
            "Don't do that to the finish tho",
            "can be played while consummating the marriage\n\n\"Finish him\"",
            "Pay heem. Pay theese mean heis meoney",
            "I don't know when my wife and and girlfriend met it was not a fun time. Ok fine the music was dope",
            "Really love the theme song and I believe that all the money spent on those shifty movies was worth cause we got this awesome techno instead"
        ]
    },
    "No way....": {
        "title": "No way....",
        "score": 2368,
        "url": "https://i.redd.it/63qn2r8utf9d1.jpeg",
        "content": "",
        "num_comments": 77,
        "comments": [
            "Haters gonna say its fake",
            "\"You know Joe, you're not so bad after all\"",
            "If they did. The nation would be better",
            "Bro imagine they’re smoking and run out of papers and then Biden pulls out the constitution and they just frigkin roll that shit up bro!! Haha wild stuff, then we’d all get free bread from Costco",
            "Go ahead throw you vote away hahahahahha\n\n![gif](giphy|yDsImXgxxc7jW)",
            "Think biden smoked all the bud last night",
            "This would explain a lot",
            "Oh man, I wish so much this was real. Our world would be in such a better place",
            "Bro, how do I snag a bag like that?",
            "Donald high and Joe higher."
        ]
    }
}