{
    "Frieren Militar\n": {
        "title": "Frieren Militar\n",
        "score": 186,
        "url": "https://i.redd.it/0mu9rgtowe9d1.png",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Echale ganas para que ms adelante digan \"no mames, el sargento es otaku\"",
            "Frieren: \"A Himmel el hroe le encantaba defender la patria\"",
            "En Facebook,recuerdo que un cuate tambin posteo una rei chikita en el ejrcito,neta que chingn.",
            "Oigan hay unos secuestradores en la casa 124 calle Carlos hank en Metepec",
            "Bien pinche el photoshop en la mochila ",
            "Ya te enteraste que el teniente es bien otako?",
            "Y su waifu es la mismsima Esdeath pero si hay un general \"lolicon\" entonces su waifu sera Tanya von Degurechaff",
            "No sabes el alivio que me da saber que no entendi ni verga de lo que dices mi estimado.",
            "Yo le entend nomas una, si estoy muy apestoso?",
            "Toda bonita toda chiquita"
        ]
    },
    "¿Sera?": {
        "title": "¿Sera?",
        "score": 477,
        "url": "https://i.redd.it/siv2hhgd6d9d1.png",
        "content": "",
        "num_comments": 44,
        "comments": [
            "Gracias por censurar una palabrota como \"burlarte\".\n\n ya puedo mandar este meme en mi grupo de amigos.",
            "No se hagan tontos, la seleccin se auto invit despus de soltar dinero, si est haciendo el ridculo es culpa de la misma seleccin.",
            "Jajajaja Nmms, la ltima vez que Mexico no se humill solo, fue contra Alemania en 2018, de ah en fuera, lo dems, ha sido una constante desde hace 8 aos en donde sea que se pare",
            "Lo que pasa es que en la CONMEBOL ya saben que la seleccin mexicana acarrea a un montn de estpidos sin importar si juegan bien o no. Lo ms importante es el dinero, eso ya lo sabemosverdad?",
            "Mexico pasa, la gente se emociona. Juega contra Argentina. Se llena el estadio, los businessmen ganan.",
            "Nel, solo para llenar estadios y llevarse mas lana, si no no lo invitan.",
            "No los invitaron, se clasificaron a travs de la nations league.",
            "Mexico siempre a sido malo nunca gan una copa ",
            "Perdn mi ignorancia, no se supone que Mxico siempre ha sido un equipo malo? O bueno siempre escucho que dicen eso. Por qu esperan algo de un mal equipo? Es raro, no entiendo el ftbol creo jaja",
            "Esa Seleccin mexicana de Televisa no nos representa como MX, solo representa a los directivos de la liga MX, tuca ya dijo que les decan quien deba jugar solo para darle gusto a los patrocinadores"
        ]
    },
    "Me querian embarrar un hijo": {
        "title": "Me querian embarrar un hijo",
        "score": 828,
        "url": "https://www.reddit.com/r/mexico/comments/1dqmhqs/me_querian_embarrar_un_hijo/",
        "content": "Hace tiempo a mis 18 años conoci una chica que le guste.  Cosa rara ya que no le gusto a las chicas. El primer dia hablamos y supe que tenia un par de semanas que se mudo a la ciudad, venia de otro estado.  Al segundo dia de conocerla, fui a su casa y estaba sola, dijo -vamos arriba.  Obvio sabia que hiba a pasar, en eso se me activa el instinto aracnido y me dice que hay algo malo en esto. Me decia tu nunca le has atraido a las chicas, y ahora ella de la nada quiere tener sexo contigo. \nNo se por que pero le di la razon y me fui corriendo. Sin mirar atras.  \n\nTiempo despues la volvi a ver y mi primo que vivia a 2 cuadras de la cada de ella me conto que se embarazo de su exnovio antes de mudarse.  \nEn ese momento lo entendi todo.  Mo fue que le gustara solo que me vio medio pendejo",
        "num_comments": 111,
        "comments": [
            "Lo que callamos los feos...pero no tontos.\n\nBuena bola bb, al rato llega la buena",
            "Haha me paso algo muy similar yo conoci a una chica que vendia zapatos, estuve meses queriandomela poner en el plato y no se dejaba deje de insistir y al mes me escribi y de la nada me dijo que tenia ganas de estar conmigo, yo le pregunte la razon y solo me dijo que el cuerpo tiene sus necesidades haha tambien me sono la alarma y me dije meses insistindole y de la nada me dice que tiene ganas nel esta raro le dije que si pero nunca concrete nada a los meses comenzo a subir fotos embarazada haha y si es mama soltera asi que me queria plantar el chamaco",
            "El sentido arcnido volvi a triunfar. Un saludo Carnalito.",
            "Se la aplicaron a un compaero de trabajo, pero este se habia hecho la vasectoma 2 aos atrs.",
            "Yo conoc a un feo, que como nadie lo pelaba, se quiso hacer cargo en ms de una ocasin de alguna chica embarazada y prefirieron seguir solas que estar con el, el chavo era buena onda y noble, pero muy feo, y al final, termino aceptando una morra embarazada con el hijo de otro, la cual despus de un tiempo, estando ya el encariado con el nio, lo dejo y se lo llev. \nCreo que an ve al nio y lo quiere con su hijo",
            "Pa cuando el post del ex novio?",
            "Recuerden muchachos, siempre piden prueba de paternidad antes de aceptar cualquier madre de manutencin o algo as. Y se le puede realizar al bebe mientras esta adentro de la madre.",
            "Es muy comn que la apliquen, as hay muchos con hijos de otros. Si ya los envolvieron en eso siempre asegurense de hacer prueba de paternidad, que no se los hagan mensos jaja",
            "Al rato te acostumbras a que te embarren los chamacos.",
            "Como los pjaros cuco. Te iban a aplicar el parasitismo de cra. Que bien que te saliste de eso."
        ]
    },
    ".": {
        "title": ".",
        "score": 704,
        "url": "https://i.redd.it/txfvdlo18c9d1.jpeg",
        "content": "",
        "num_comments": 64,
        "comments": [
            "No lo s rick, he visto cmo se ponen de ardidos personas de todo tipo de paises latinos cuando se habla de manera burlona de sus pases.",
            "excepto cuando te metes con la comida de per y el queso en el caf de la bandera clon",
            "puro imbcil (independientemente de la nacionalidad) cae en ese tipo de provocaciones, fanticos del futbol en su mayora XD",
            "Es porque Mxico y Argentina est lleno de orgullo nacionalista. Hace unos aos Venezuela era igual",
            "Efectivamente seores Mxico es una mierda ",
            " Nada ms los bolivianos, has visto la cantidad de mierda que se comen en el da a da y siempre se mantienen serenos",
            "dile a un peruano que su comida esta equis y mira como se ponen",
            "Es que el resto no tiene internet entonces son menos los lloros ",
            "Yo siendo un Argentino viviendo en Mxico, confirmo",
            "El problema de Mxico es muy simple, es que est lleno de mexicanos. Fuera de eso todo bien."
        ]
    },
    "Banda, ya salió la encuesta Massive Caller del debate de ayer en Estados Unidos": {
        "title": "Banda, ya salió la encuesta Massive Caller del debate de ayer en Estados Unidos",
        "score": 317,
        "url": "https://i.redd.it/a6a4g7q45d9d1.jpeg",
        "content": "",
        "num_comments": 38,
        "comments": [
            "Gracias por la informacin domador de anos.",
            "No se s fue real,pero hace 7 aos recuerdo cuando salieron notas sobre que fox haba anunciado su candidatura para la presidencia de eu xd.",
            "este me recordo a las encuestas del noticiero de la hora pico",
            "Segn la botarga y sus encuestas por bancos ",
            "Es broma, pero si fuera real seria 100 chicanos dijeron",
            "Claro Claudia arriba con 187%. Yo tengo otros datos.",
            "Hahaha gracias perdimos la democracia en Mxico pero que buen meme /s",
            "No tanto, solo con 30.",
            "No entendiste bien el chiste. Massive Caller realiz la peor encuesta del pas en pronosticar quin sera la ganadora.",
            "Los dos son vejestorios uno 78 y el otro 81."
        ]
    }
}