{
    "Updates to the Rules": {
        "title": "Updates to the Rules",
        "score": 66,
        "url": "https://www.reddit.com/r/Miata/comments/1aqfu4q/updates_to_the_rules/",
        "content": "I have recently updated the rules and wanted to announce the changes. Although some of it is new, none of this should be surprising.\n\n**1. be excellent to each other!**\n\nSelf explanatory. Don't be a dick.\n\n**2. No Car Shaming**\n\nHaving a preference and stating it is okay. Making a point to be rude about it is not.\n\nThis includes being obnoxious about your preference for manual transmissions.\n\n**3. No Price Checks!**\n\nThe old rule 3 has been split in two, just to emphasize it. No. Price. Check. Posts. Please comment in the purchase advice thread.\n\n**4. No car buying/selling advice posts.**\n\nThis includes, but is not limited to:\n\n* Is this a good price? See rule 3.\n* What should I look for? Buyers guides are linked in the buying advice topic.\n* Will I fit? Go to a dealership, car show, or driving event, and sit in one.\n* What's your insurance rate? Talk to an agent or check a providers website.\n* Can/should it be a daily? No one knows your commute better than you.\n* Is it a good first car? Depends on who you are.\n* Help me convince my parents? That never works.\n\nPosts asking for advice on individual parts are encouraged! Do you have a question about a specific factory feature that you can't find info on? All good! Want buying advice on coilovers, turbo kits, spoilers, etc? Ask away! Did you find a hilariously bad car listing no one will buy? Share the laughs!\n\n**5. No AI Prompt Submissions**\n\nWhen polled, the vast majority of the community was in agreement that they did not want to see AI posts.\n\n[Let's talk about AI art prompts. : Miata (reddit.com)](https://www.reddit.com/r/Miata/comments/1al3bd7/lets_talk_about_ai_art_prompts/)\n\n**6. No Spam Content**\n\nIncluding but not limited to:\n\n* Bot reposts - report these, please!\n* Any clothing focused post is subject to deletion. Too many bots.\n* No begging for donations. Fund your own hobbies.  Any such posts will be deleted, and you might be banned.\n* This isn't Marketplace or Craigslist, don't post your own used items or car for sale.\n\nSelf-promotion is acceptable, within reason. The content must be immediately and primarily Miata focused and should stand on its own. Don't plead for everyone to like and subscribe to your channel.\n\nVendors of Miata products (not clothing!) are welcome!\n\n**Why do we have the rules on post content?**\n\nTo avoid daily, or even hourly, repeats of the same conversations, and to encourage a minimum level of effort invested. We want to make room for discussion of less well documented topics. While we do want those new to the community to feel welcome, we also don't want experienced hands feeling like they only see the same 5 conversations on repeat. In case you feel like this is not fair, please note that \"Search for duplicates before posting\" is sitewide guidance and not just an /r/miata rule.",
        "num_comments": 19,
        "comments": [
            "Feel like it would be a good time to update the wiki to at least link to decent buying guides and threads about those specific questions that are banned as well as other common stuff",
            "Woohoo! no more low effort AI images!",
            "Thank fuck! Fr, appreciate it.",
            "If rules 2, 3, and 4 were enforced, Im not sure there would be very many posts left!",
            "Can we amend rule two for stance exemptions? I feel as though they deserve the shame...",
            "Is it OK to post a part for sale?  I don't see a rule prohibiting that but wanted to ask just in case.",
            "Rule 4 won't work if you're asking about an older car, like NA.",
            "wtf no auto hate????? lol",
            "What is the best place to list my car for sale in the US? Facebook marketplace?",
            "Why can't I post anything in this sub? I can hit create post and type it but the post button is greyed out all the time."
        ]
    },
    "Weekly Purchase/Sale advice thread - June 26, 2024": {
        "title": "Weekly Purchase/Sale advice thread - June 26, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/Miata/comments/1dovtlv/weekly_purchasesale_advice_thread_june_26_2024/",
        "content": "Do you have questions about the value of a car you want to buy? Looking for a buyers guide? Not sure about the mechanical condition of a car you're looking at? Maybe you want to sell yours and don't know how to price it, or why it's not sold yet? Use this weekly thread to discuss the cars you're interested in buying/selling to get advice from the peanut gallery.\n\nPosts that fall under the above topics will be removed.\n\nHere are some useful tools to help decide if a particular Miata is worth buying.  \n [Miata Garage Buying a Miata](https://miata.net/garage/garagebuying.html)   \n [The Definitive Post: \"What Miata Should I Buy?\" : Miata (reddit.com)](https://www.reddit.com/r/Miata/comments/qdyth/the_definitive_post_what_miata_should_i_buy/) \n\n\\- The Mod Team",
        "num_comments": 21,
        "comments": [
            "I'm considering getting a 2024 Miata, but shall I go for the RF or not? Would love to hear people's opinions. RF looks more solid and may be safer, but not sure if it's worth the extra.",
            "Looking to buy this 1999 with 121k miles on it for $4k. Its an automatic. I dont know shit about Miatas or cars in general but this one seems like a good price and nicely maintained? It has the original hard top which Ive read is rare. Timing belt changed at 90k miles. Anything I should ask about or look for? KBB says that fair value for this car is like $5k-$7k in my area.",
            "Is this a good deal? 2024 sport, $488/month(taxes included), 36 month, 7500 miles/year lease with 0 down.",
            "Hi all! I'm about to put my 2020 Sport for sale. 28,xxx miles, two sets of allow wheels and tires, hidden hitch, full service record, clean title, etc. I'm thinking $21,500? That's in the KBB bracket, but what do you think? Vermont, USA.",
            "I am looking to sell my 2007 MX-5 Grand Touring (6-speed), but Im unsure of where else to post it. I have posted it on Facebook, OfferUp, and Craigslist, but are there any other places I can promote it? Thanks in advance!",
            "I am looking at an NC (2007) locally for sale in a cute old mans yard. Kind of the ideal situation- garage kept weekend car, original owner, Grand Touring, manual, 38k(!!!) original miles, not cross listed online- I was the first caller, apparently. He wants $9k for it (or best offer). I am trying to determine if this is a pretty good or run buy it right now idiot level of a deal. Trying to parse used prices before the recent market upswings has been a bit hard, so I figured Id field opinions here. Its white with a brown leather interior- my perfect color combo on an NC, personally. Its in incredible cosmetic shape and was gleaming in the sunset when I ran across it.",
            "I Turo'd a RF recently, and the owner was pretty adimant that it was better than the soft top. he pointed out that the soft top is, unsuprisingly, delicate, and may need some care from time to time. I'm also 6'3\" and there was only an inch or so of head room left. not a problem for me, but if you are a tall person you might prefer the extra headroom from a soft top.",
            "You can fling the soft top open / closed with one arm in something like two seconds. \n\nThe RF has an awesome side profile with the roof closed.",
            "I am kind of under a similar place. Can buy cash for either, but draining a bit of my savings in order to pay for a run car is daunting. Ive been more so going back and forth between NC2 or ND2. ND1 with the worse engine and transmission issues makes me want to avoid.",
            "That looks rough for 30k miles. I would bet it needs some money to replace wear items like radiator, gaskets, etc since it doesnt seem super well taken care of despite low miles. Id probably pay $9k max for that specific one"
        ]
    },
    "Guys my miata is no longer sexually attracted to me... ": {
        "title": "Guys my miata is no longer sexually attracted to me... ",
        "score": 5097,
        "url": "https://i.redd.it/cys0m2m3fa9d1.png",
        "content": "What am i supposed to do 😭",
        "num_comments": 258,
        "comments": [
            "Now thats a short shifter",
            "A thumb in the exhaust should fix that",
            "Drop a Viagra in the tank?",
            "Damn, that's rough. What happens when you turn it on?",
            "At that point just reach your hand through and manipulate the transmission directly",
            "It happens to the best of us",
            "Your Miata appears to be transmissioning.",
            "But in all seriousness,  what happened here?",
            "Just hawk tuah on that thing",
            "Your Miata just got out of the pool."
        ]
    },
    "Is this normal? Also what are those rims,never seen such before...": {
        "title": "Is this normal? Also what are those rims,never seen such before...",
        "score": 43,
        "url": "https://i.redd.it/15ai4n4yqh9d1.png",
        "content": "Maybe there is something wrong with the axle? Or its supposed to be like this?\n\n",
        "num_comments": 42,
        "comments": [
            "Those wheels are like the heaviest ones but they look cool",
            "Those wheels are referred to as \"snowflakes\" they're the heaviest stock wheels that came on a ma/nb miata",
            "NA's are the same.  Mud flaps help close the gap, visually.",
            "Are you looking to purchase the car? If so you might like to know you're not looking at just any normal Miata! This color and rims only came in the 2002 year model SE special edition trim, I believe only 1491 made in that color. The se also came in blazing yellow, which there are 1000 of. Basically the top trim plus extras and is limited. The rims are OEM and made by enkei.",
            "Yes, if you look carefully at a bunch of NB side profiles, it's normal. How prominent it looks varies depending on how it's sitting, alignment, and lighting/shadow. It carried over from the NA, where it was a last-minute design change to improve handling by shortening the wheelbase, after the body was finalized. The NB wasn't a ground-up new chassis, but more of a major facelift focused on the outer panels, so they didn't fix this quirk until the NC.",
            "Looks normal. 2002 SE, I have one",
            "Rims are OEM from this version on mx5 - it is called Unplugged",
            "i have the same rims - theyre factory",
            "Love the rims they are victory y",
            "Nope, that looks off. Neither of my 5s looked like that."
        ]
    },
    "New to the boating club ": {
        "title": "New to the boating club ",
        "score": 50,
        "url": "https://www.reddit.com/gallery/1dr6dv4",
        "content": "Hi ! I picked this up about a month ago, super happy. What a fun car to drive, debating on getting some bronze wheels and blacking out the chrome but other than that she's beautiful ! ",
        "num_comments": 6,
        "comments": [
            "The only acceptable hardtop version imo.",
            "Ayyyeee nc gang",
            "Hardtop gang! ",
            "Ahoy there!",
            "https://preview.redd.it/3u6dhrr36h9d1.jpeg?width=4000&format=pjpg&auto=webp&s=27a82ab41bf3fe32d513b3e3cec526f0ef1a1841\n\nBronze 16s",
            "[Ahoy!](https://i.imgur.com/HireHtD.png)"
        ]
    }
}