{
    "Updates to the Rules": {
        "title": "Updates to the Rules",
        "score": 69,
        "url": "https://www.reddit.com/r/Miata/comments/1aqfu4q/updates_to_the_rules/",
        "content": "I have recently updated the rules and wanted to announce the changes. Although some of it is new, none of this should be surprising.\n\n**1. be excellent to each other!**\n\nSelf explanatory. Don't be a dick.\n\n**2. No Car Shaming**\n\nHaving a preference and stating it is okay. Making a point to be rude about it is not.\n\nThis includes being obnoxious about your preference for manual transmissions.\n\n**3. No Price Checks!**\n\nThe old rule 3 has been split in two, just to emphasize it. No. Price. Check. Posts. Please comment in the purchase advice thread.\n\n**4. No car buying/selling advice posts.**\n\nThis includes, but is not limited to:\n\n* Is this a good price? See rule 3.\n* What should I look for? Buyers guides are linked in the buying advice topic.\n* Will I fit? Go to a dealership, car show, or driving event, and sit in one.\n* What's your insurance rate? Talk to an agent or check a providers website.\n* Can/should it be a daily? No one knows your commute better than you.\n* Is it a good first car? Depends on who you are.\n* Help me convince my parents? That never works.\n\nPosts asking for advice on individual parts are encouraged! Do you have a question about a specific factory feature that you can't find info on? All good! Want buying advice on coilovers, turbo kits, spoilers, etc? Ask away! Did you find a hilariously bad car listing no one will buy? Share the laughs!\n\n**5. No AI Prompt Submissions**\n\nWhen polled, the vast majority of the community was in agreement that they did not want to see AI posts.\n\n[Let's talk about AI art prompts. : Miata (reddit.com)](https://www.reddit.com/r/Miata/comments/1al3bd7/lets_talk_about_ai_art_prompts/)\n\n**6. No Spam Content**\n\nIncluding but not limited to:\n\n* Bot reposts - report these, please!\n* Any clothing focused post is subject to deletion. Too many bots.\n* No begging for donations. Fund your own hobbies.  Any such posts will be deleted, and you might be banned.\n* This isn't Marketplace or Craigslist, don't post your own used items or car for sale.\n\nSelf-promotion is acceptable, within reason. The content must be immediately and primarily Miata focused and should stand on its own. Don't plead for everyone to like and subscribe to your channel.\n\nVendors of Miata products (not clothing!) are welcome!\n\n**Why do we have the rules on post content?**\n\nTo avoid daily, or even hourly, repeats of the same conversations, and to encourage a minimum level of effort invested. We want to make room for discussion of less well documented topics. While we do want those new to the community to feel welcome, we also don't want experienced hands feeling like they only see the same 5 conversations on repeat. In case you feel like this is not fair, please note that \"Search for duplicates before posting\" is sitewide guidance and not just an /r/miata rule.",
        "num_comments": 19,
        "comments": [
            "Feel like it would be a good time to update the wiki to at least link to decent buying guides and threads about those specific questions that are banned as well as other common stuff",
            "Woohoo! no more low effort AI images!",
            "Thank fuck! Fr, appreciate it.",
            "Excellent rule update!",
            "If rules 2, 3, and 4 were enforced, I’m not sure there would be very many posts left!",
            "Can we amend rule two for stance exemptions? I feel as though they deserve the shame...",
            "Is it OK to post a part for sale?  I don't see a rule prohibiting that but wanted to ask just in case.",
            "Rule 4 won't work if you're asking about an older car, like NA.",
            "wtf no auto hate????? lol",
            "In search of: [Mazda MX5 NC BBR200 Spirited Green Sport Black Limited Edition](https://forum.mx5oc.co.uk/t/2011-mazda-mx5-nc-bbr200-spirited-green-sport-black-limited-edition/140218). I am looking for a Miata NC hard top in Spirited green for my boyfriend. He has always wanted this car and I want to get it for him as a gift/wedding present, but I am having a hard time finding it. I know its rare, but I'm hoping someone here can point me in the right direction. Thank you in advance! \n\nhttps://preview.redd.it/xhh2ah78nazc1.png?width=1456&format=png&auto=webp&s=113e05bc5be64999aaf7025d517683bd98fd4126"
        ]
    },
    "Weekly Purchase/Sale advice thread - June 26, 2024": {
        "title": "Weekly Purchase/Sale advice thread - June 26, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/Miata/comments/1dovtlv/weekly_purchasesale_advice_thread_june_26_2024/",
        "content": "Do you have questions about the value of a car you want to buy? Looking for a buyers guide? Not sure about the mechanical condition of a car you're looking at? Maybe you want to sell yours and don't know how to price it, or why it's not sold yet? Use this weekly thread to discuss the cars you're interested in buying/selling to get advice from the peanut gallery.\n\nPosts that fall under the above topics will be removed.\n\nHere are some useful tools to help decide if a particular Miata is worth buying.  \n [Miata Garage Buying a Miata](https://miata.net/garage/garagebuying.html)   \n [The Definitive Post: \"What Miata Should I Buy?\" : Miata (reddit.com)](https://www.reddit.com/r/Miata/comments/qdyth/the_definitive_post_what_miata_should_i_buy/) \n\n\\- The Mod Team",
        "num_comments": 20,
        "comments": [
            "I'm considering getting a 2024 Miata, but shall I go for the RF or not? Would love to hear people's opinions. RF looks more solid and may be safer, but not sure if it's worth the extra.",
            "I've recently been bit by the miata bug, and am smitten after driving an ND2 RF. However I'm unsure if its better to buy an ND1 with cash, which I am very fortunate to be able to do. Or should I finance to get an ND2, I can get a reasonable interest rate with my bank and would only need around 5k in loans.\n\nIt's more a matter of 'best value' than affordability, I'll be fine either way.\n\nBut I'd love to hear you guys thoughts on the matter.",
            "Just curious what do you guys think about this NB? 33k miles for $13.5k, is that a steal due to the low mileage?\n https://fredericksburg.craigslist.org/cto/d/fredericksburg-1999-mazda-miata-low/7760841018.html",
            "from the UK!!! \nI'm 19, not even passed my driving test yet (just waiting for my test day in august) \nI am really wanting to get a miata (M-x5 here lmao) \nI know realistically the insurance would be a killer as a new driver, and tbh I'm quite happy with my '04 toyota yaris for now but I'm worried the prices are going to keep going up for MX5s \nwould it be worth just buying one and fixing it up/keeping on the drive for the future? \nI'm literally so desperate for this damn car. I don't even care if it works I just need one fr",
            "Looking to buy this 1999 with 121k miles on it for $4k. It’s an automatic. I don’t know shit about Miata’s or cars in general but this one seems like a good price and nicely maintained? It has the original hard top which I’ve read is rare. Timing belt changed at 90k miles. Anything I should ask about or look for? KBB says that fair value for this car is like $5k-$7k in my area.",
            "Is this a good deal? 2024 sport, $488/month(taxes included), 36 month, 7500 miles/year lease with 0 down.",
            "Hi all! I'm about to put my 2020 Sport for sale. 28,xxx miles, two sets of allow wheels and tires, hidden hitch, full service record, clean title, etc. I'm thinking $21,500? That's in the KBB bracket, but what do you think? Vermont, USA.",
            "I am looking to sell my 2007 MX-5 Grand Touring (6-speed), but I’m unsure of where else to post it. I have posted it on Facebook, OfferUp, and Craigslist, but are there any other places I can promote it? Thanks in advance!",
            "Hello everybody,\nI am currently thinking about buying a Mazda MX-5 Homura/Club as my only car (coming from a VW Polo).\n\nI drove the MX-5 ND2 with Sports Package and loved the feeling. I am aware that I will have to make a lot of compromises (= renting a car to carry friends/equipment) but I am willing to risk it.\n\nHowever, I don’t know what would be a sensible choice. Slightly used 2023 ND2 with Sports Package (~27.000€)/slightly used 2023 ND2 Homura (~30.000€) or a new 2024 ND3 Homura (~38.000€).\n\nDo you think that the one-year longer warranty as well as the new upgrades for the ND3 are worth the premium? Should we expect slightly used ND3s to hit the market with good prices soon?\n\nI was thinking it might even be a financial sensible idea due to the short production of it and potentially good resale value.\n\nWhat do you think?\n\nThanks in advance!",
            "I am looking at an NC (2007) locally for sale in a cute old man’s yard. Kind of the ideal situation- garage kept weekend car, original owner, Grand Touring, manual, 38k(!!!) original miles, not cross listed online- I was the first caller, apparently. He wants $9k for it (or best offer). I am trying to determine if this is a “pretty good” or “run buy it right now idiot” level of a deal. Trying to parse used prices before the recent market upswings has been a bit hard, so I figured I’d field opinions here. It’s white with a brown leather interior- my perfect color combo on an NC, personally. It’s in incredible cosmetic shape and was gleaming in the sunset when I ran across it."
        ]
    },
    "Guys my miata is no longer sexually attracted to me... ": {
        "title": "Guys my miata is no longer sexually attracted to me... ",
        "score": 4782,
        "url": "https://i.redd.it/cys0m2m3fa9d1.png",
        "content": "What am i supposed to do 😭",
        "num_comments": 248,
        "comments": [
            "It's just cold...",
            "Now that’s a short shifter",
            "stroke the tip",
            "A thumb in the exhaust should fix that",
            "Drop a Viagra in the tank?",
            "Damn, that's rough. What happens when you turn it on?",
            "At that point just reach your hand through and manipulate the transmission directly",
            "It happens to the best of us…",
            "Your Miata appears to be transmissioning.",
            "Just hawk tuah on that thing"
        ]
    },
    "I have a plan": {
        "title": "I have a plan",
        "score": 193,
        "url": "https://i.redd.it/zsdw34up3f9d1.jpeg",
        "content": "",
        "num_comments": 21,
        "comments": [
            "You just screenshotted another persons comment from the same subreddit and posted it\n\nWhy?",
            "theyre small, slow, rusty, and impractical... and they squeak and rattle when you drive. trash",
            "That's how NC prices stayed so low, and allowed me to buy a couple 😃",
            "MIATA: \nMiata Is Always Trash… Always.",
            "OP's name suggest they forgot",
            "what if we all lowballed ppl on marketplace at the same time to bring down prices",
            "Karma farming bot. Everyone downvote.",
            "Do it, I wanna flex in a pink 1992 Mazda Miata,",
            "Reupload...",
            "Whats a common excuse, its slow, hairdresser, no storage yada yada."
        ]
    },
    "Welcome to the pack Mazdaspeed!": {
        "title": "Welcome to the pack Mazdaspeed!",
        "score": 271,
        "url": "https://www.reddit.com/gallery/1dqn0cz",
        "content": "Saw this 2004 Mazdaspeed on FB market place with 90k miles and I couldn't let that pass up. I already have an NB1, but that sweet sweet boost is a game changer.\n\nPurchased from the original owners wife. Every receipt during ownership down to windshield wiper blades was provided. The steering wheel is in need of replacement, besides that it's in perfect condition. I was happy to find a few Flyin Miata parts in the engine bay. \n\nYes, the speed has the NB1 plate on it in the driveway shot. Swapped it on to get the car home. ",
        "num_comments": 31,
        "comments": [
            "https://preview.redd.it/wokxy9zxjc9d1.jpeg?width=1170&format=pjpg&auto=webp&s=3fb43a34979e68fda1979a183f29ade2f8a01cc7",
            "You can't just say you bought a good condition Mazdaspeed without telling us what you bought it for.",
            "you stole that thing for under 10k! great buy",
            "How much did you pay for it?",
            "God I miss my MSM. NC is better all around but fun turbo noises ):",
            "Velocity Red, my fave NB colour.\n\nCongrats!",
            "Nice cars! Both of them. What’s the muffler on the NB1? Also do you find the MSM to be laggy? Heard others complain about the stock turbo system.",
            "Is your NB1 the Hard-S? Congrats on the MSM!",
            "OP you're in the Richmond area aren't you? I saw that MSM for sale and was going to check it out but already bought one in March. Can never have too Many miatas. Lol\n\nThere is a very active Miata group in RVA that hosts club drives and other events if you're interested. Check out http://centralvirginiamiataclub.net/",
            "You own 2 red NBs now?"
        ]
    }
}