{
    "MSFS 2024 Trailer & Release Date: Megathread": {
        "title": "MSFS 2024 Trailer & Release Date: Megathread",
        "score": 288,
        "url": "https://www.reddit.com/r/MicrosoftFlightSim/comments/1dbzq7b/msfs_2024_trailer_release_date_megathread/",
        "content": "# [Watch the trailer here!](https://www.youtube.com/watch?v=rvzlC4iCtns)\n\n# Release date has been confirmed to be November 19th, 2024\n\n#The [MSFS 2024 FAQ](https://www.flightsimulator.com/microsoft-flight-simulator-2024-faq/) has been updated with some additional information. It is worth checking out!\n\nPlease try and keep discussion of the trailer in this megathread whenever possible, instead of making a separate post. Thanks!",
        "num_comments": 390,
        "comments": [
            "If that was all in game footage this game is going to look phenomenal",
            "My CPU and GPU just collectively said \"nope, we ain't doing that\".",
            "That northern lights shot looks sick tbh.",
            "so I assume we can exit the plane and walkaround?",
            "those cliffs and mountains look nice.\n\none of my big graphical gripes of fs2020.  the whole package looks absolutely stunning.  so many tiny tiny details, god.  i really didnt think they could push something like this any further than they did already 4 years ago but here we are",
            "The graphics look like a nice upgrade over 2020.",
            "Absolutely stunning. Love they took the career approach. Adds so much depth to the sim.",
            "Are we getting AI traffic with real world liveries???",
            "Will they be releasing specs required or something along them lines as looking into my first pc build and making the switch, 2024 looked phenomenal.",
            "Looks beautiful, first and foremost"
        ]
    },
    "June 27th, 2024 - Development Update": {
        "title": "June 27th, 2024 - Development Update",
        "score": 13,
        "url": "https://www.flightsimulator.com/june-27th-2024-development-update/",
        "content": "",
        "num_comments": 1,
        "comments": [
            "They talked about making the airport feel more alive, and how we can make people walk around, even inside the airport. Does that mean the player can walk around inside an airport or can we just see people walking around through windows while in an airplane?"
        ]
    },
    "Smoothest landing yet with the 777 into SFO. I just can't get enough of that landing gear!": {
        "title": "Smoothest landing yet with the 777 into SFO. I just can't get enough of that landing gear!",
        "score": 275,
        "url": "https://v.redd.it/sdqvdxr9if9d1",
        "content": "",
        "num_comments": 31,
        "comments": [
            "my goodness that was SMOOTH",
            "the rare reddit combo of a serving of butter and actually being near the TD zone, four point five stars",
            "What replay tool did you use? Looks nice",
            "Woah, SkyDolly seems way more stable with this than Flight Recorder. Amazing landing dude",
            "Nice, what SFO is it, the flight beam or the other one",
            "Beautiful landing. \n\nAs far as MSFS and PMDG have come, contact physics are still so bad :( That's one thing I covet from X-Plane.",
            "She's such a joy to fly and that landing gear is marvelous. Beautiful landing!",
            "Must be an Air Force pilot",
            "I wish, my landings are not getting below 600fpm",
            "Me who do hard butter landings lmao, i still have to train myself to land this plane!  \ngood landing done there though!"
        ]
    },
    "PMDG did it again: VR capable large body flying is a reality": {
        "title": "PMDG did it again: VR capable large body flying is a reality",
        "score": 18,
        "url": "https://v.redd.it/exjjej6j0i9d1",
        "content": "",
        "num_comments": 8,
        "comments": [
            "i hate how these 2d videos of vr doesn't do vr justice. Trust me, its fcking amazing, it actually feels like you're in the cockpit",
            "Shoutout to CHI center, approach, and tower for their help",
            "Yeah VR in the 777 is amazing!  So glad PMDG has the in tablet keyboard too.Its awesome to go into the main cabin for the wing views as well.",
            "You are 100% right. I wish there was someway for non-VR users to experience VI without having to purchase their own device",
            "You are 100% right. I wish there was someway for non-VR users to experience VI without having to purchase their own device",
            "bro i'm glazing in hindsight",
            "Something not a lot of people focus on is the performance of these addons. I think MSFS itself has become way more optimized since its release - way more than we give it credit for. What I think is even nicer is the fact that some developers are optimizing their addons such that the performance loss compared to the base sim is still tolerable - and enjoyable even in VR. \n\nPerformance aside, I want to shoutout their team for developing jets that are VR friendly. I pretty much only play in VR now and you spend most of your time as a VR user feeling like an afterthought. But I realize in both the 737 and the 777 you feel like you're in an addon that is inclusive of your style of play. 000000 \n\nIf you want an example of this, think of the clickspots for buttons etc., they are super intuitive. But also think of the clickspots for the VR-zoom function. Think back to the 737, and think about the new 777. You probably don't notice it, and it's so subtle. But you never have to guess where the VR-zoom function (right mouse click by default) is going to take you in the cockpit. You get transported to the exact point that you expected every single time. Compare this to some addons whose VR-zoom almost clips you out of the airplane, or through a panel. I still flinch everytime I get clipped through some model object in VR - but this is considerably less of a problem in the 777 and 737 than most other addons for this sim. \n\nI've been only flying in VR for almost 3 years now and it feels so good to be considered by a company. This is a call to people who fly in VR - consider at least one PMDG product if you can afford it at some point",
            "Are you using the mouse because you just prefer it or is controller support not solid?"
        ]
    },
    "Am I the only geeks who actually waits in line for take off?": {
        "title": "Am I the only geeks who actually waits in line for take off?",
        "score": 168,
        "url": "https://i.redd.it/j9fm50ak2e9d1.jpeg",
        "content": "",
        "num_comments": 44,
        "comments": [
            "Nope. Even though default traffic isn't great I'll still wait in line until it's my turn",
            "I always do...I love it when an AI aircraft disappears out of nowhere..lol",
            "FSLTL has me waiting in line like a chump. But I like it. It feels more immersive.",
            "I wait but I don't run into it that often as I'm usually flying light aircraft out of backwater airports so when I do run into traffic it's something of a novelty.",
            "I always wait behind other players - never spawn on the runway (that one annoys me! lol) and always wait for others to land if they are on final. Just adds to the sim for me at least",
            "One time ATC had me holding short at LFMN for 15 minutes because an AI flight glitched out and wouldn't leave the runway. I went to do something and when I came back, I was cleared for take off, but then I was made to hold short again because a plane was landing but there was no one coming so I just took off anyway.",
            "Always.  Not when landing though, tower tells me to go around I just white-knuckle the yoke and grimly say \"unable\"",
            "Im English, so of course I wait in line",
            "I would have the AI traffic turned on but it is so bad I have to keep it off. From cutting in front on final or even going through the airplane to just mysteriously vanishing to hogging the runway because it glitched and is taxiing to the other side of the runway at 5kts.",
            "Hey I wait also "
        ]
    }
}