{
    "MSFS 2024 Trailer & Release Date: Megathread": {
        "title": "MSFS 2024 Trailer & Release Date: Megathread",
        "score": 288,
        "url": "https://www.reddit.com/r/MicrosoftFlightSim/comments/1dbzq7b/msfs_2024_trailer_release_date_megathread/",
        "content": "# [Watch the trailer here!](https://www.youtube.com/watch?v=rvzlC4iCtns)\n\n# Release date has been confirmed to be November 19th, 2024\n\n#The [MSFS 2024 FAQ](https://www.flightsimulator.com/microsoft-flight-simulator-2024-faq/) has been updated with some additional information. It is worth checking out!\n\nPlease try and keep discussion of the trailer in this megathread whenever possible, instead of making a separate post. Thanks!",
        "num_comments": 390,
        "comments": [
            "If that was all in game footage this game is going to look phenomenal",
            "My CPU and GPU just collectively said \"nope, we ain't doing that\".",
            "That northern lights shot looks sick tbh.",
            "so I assume we can exit the plane and walkaround?",
            "those cliffs and mountains look… nice….\n\none of my big graphical gripes of fs2020.  the whole package looks absolutely stunning.  so many tiny tiny details, god.  i really didn’t think they could push something like this any further than they did already 4 years ago but here we are",
            "The graphics look like a nice upgrade over 2020.",
            "Absolutely stunning. Love they took the career approach. Adds so much depth to the sim.",
            "Are we getting AI traffic with real world liveries???",
            "November 19. OMGGG!!!!!!",
            "Will they be releasing specs required or something along them lines as looking into my first pc build and making the switch, 2024 looked phenomenal."
        ]
    },
    "June 27th, 2024 - Development Update": {
        "title": "June 27th, 2024 - Development Update",
        "score": 13,
        "url": "https://www.flightsimulator.com/june-27th-2024-development-update/",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Smoothest landing yet with the 777 into SFO. I just can't get enough of that landing gear!": {
        "title": "Smoothest landing yet with the 777 into SFO. I just can't get enough of that landing gear!",
        "score": 124,
        "url": "https://v.redd.it/sdqvdxr9if9d1",
        "content": "",
        "num_comments": 19,
        "comments": [
            "my goodness that was SMOOTH",
            "What replay tool did you use? Looks nice",
            "the rare reddit combo of a serving of butter and actually being near the TD zone, four point five stars",
            "Woah, SkyDolly seems way more stable with this than Flight Recorder. Amazing landing dude",
            "Nice, what SFO is it, the flight beam or the other one",
            "Beautiful 🫡",
            "She's such a joy to fly and that landing gear is marvelous. Beautiful landing!",
            "Beautiful landing. \n\nAs far as MSFS and PMDG have come, contact physics are still so bad :( That's one thing I covet from X-Plane.",
            "Great landing",
            "The mains were beautiful, but you brought the reversers out too early and slammed the nose gear"
        ]
    },
    "Am I the only geeks who actually waits in line for take off?": {
        "title": "Am I the only geeks who actually waits in line for take off?",
        "score": 119,
        "url": "https://i.redd.it/j9fm50ak2e9d1.jpeg",
        "content": "",
        "num_comments": 36,
        "comments": [
            "Nope. Even though default traffic isn't great I'll still wait in line until it's my turn",
            "I always do...I love it when an AI aircraft disappears out of nowhere..lol",
            "FSLTL has me waiting in line like a chump. But I like it. It feels more immersive.",
            "I wait but I don't run into it that often as I'm usually flying light aircraft out of backwater airports so when I do run into traffic it's something of a novelty.",
            "![gif](giphy|bWM2eWYfN3r20)",
            "I always wait behind other players - never spawn on the runway (that one annoys me! lol) and always wait for others to land if they are on final. Just adds to the sim for me at least",
            "One time ATC had me holding short at LFMN for 15 minutes because an AI flight glitched out and wouldn't leave the runway. I went to do something and when I came back, I was cleared for take off, but then I was made to hold short again because a plane was landing but there was no one coming so I just took off anyway.",
            "Hey I wait also 😀",
            "I do it all the time",
            "Nah, I always wait"
        ]
    },
    "Jviation has released the first high quality American Airlines liveries w/ cabin for the PMDG 777-300ER": {
        "title": "Jviation has released the first high quality American Airlines liveries w/ cabin for the PMDG 777-300ER",
        "score": 157,
        "url": "https://www.reddit.com/gallery/1dql5oo",
        "content": "",
        "num_comments": 28,
        "comments": [
            "Jviation one of my favorite livery makers. Their paint jobs are always so wonderfully made",
            "JVIATION and Atarium are on their ways",
            "Link: https://flightsim.to/file/76929/american-airlines-pack-w-cabin-pmdg-b777-323er",
            "Just curious how it compares to the PMDG paint.",
            "This is beautiful wow",
            "I am having a hard time differentiating what the difference between silver eagle and silver mica airframes are. Does anyone know?",
            "I LOVE JVATION",
            "How did you fix GSX cargo not loading correctly?",
            "Making miss the A321T’s that are being converted to domestic style. Gotta fly it once more before they go away.",
            "Maybe it's just me growing up seeing them, but I love the old school American Airlines liviries.\n\nLike the silver plane with no paint (done to save fuel as that much paint is actually heavy) and the red white blue stripes.\n\nJust a classic."
        ]
    }
}