{
    "Microsoft: Official Support Thread": {
        "title": "Microsoft: Official Support Thread",
        "score": 442,
        "url": "https://www.reddit.com/r/microsoft/comments/o22lfc/microsoft_official_support_thread/",
        "content": "Microsoft: Official Support Thread\n\nMicrosoft Listens This thread was created in order to facilitate easy-to-access support for our Reddit subscribers. We will make a best effort to support you. We may also need to redirect you to a specialized team when it would best serve your particular situation. Also, we may need to collect certain personal information from you when you use this service, but don't worry -- you won't provide it on Reddit. Instead, we will private message you as we take data privacy seriously.\n\nHere are some of the types of issues we can help with in this thread: \n• Microsoft Support: Needing assistance with specific Microsoft products (Windows, Office, etc..) \n• Microsoft Accounts: Lockouts, suspensions, inability to gain access Devices: Issues with your • Microsoft device (Surface, Xbox) \n• Microsoft Retail: Needing to find support on a product or purchase, assistance with activating online product keys or media, assistance with issues raised from liaising with colleagues in the Microsoft Store.\n\nThis list is not all inclusive, so if you're unsure, simply ask. When requesting help from us, you may be requested to provide Microsoft with the following information (you'll be asked via private message from the MSModerator account):\n• Your full name (First, Last) \n• Your interactions with support thus far, including any existing service request numbers \n• A contact email address which you are reachable at\n\nThank you for being a valued Microsoft customer.\n\n9th release of this post (archived due to the size of thread): https://msft.it/61693nHKoH",
        "num_comments": 28486,
        "comments": [
            "How do I talk to a real live person about outlook email? Seriously the worst customer service ever.",
            "I have been locked out of my Microsoft account for YEARS. I used to play a lot of Xbox and had my gamertag and Office software tied to the same login/account. I have no idea how but at some point my account got locked by Microsoft (presumably someone tried to impersonate me and log into my account?).  Back when this initially happened I tried to recover the account but have never been able to provide sufficient information in the online form to satisfy the robot on the other end. No human has ever been able to help me. Every so often, I give it another try because I would like to recover my personal account (rather than rely on my work-issued laptop for Microsoft software, and Im considering getting the Xbox Series X whenever one is available). This has been the longest headache and the most infuriating exercise in futility. I tried again just now but got denied once more by the robot. My backup email that would receive my password reset/recovery link has been LONG deleted due to inactivity (the backup email was an AIM email I created in high school, which shows just how futile this all is). I just want a human at MS to please give me back my account thats been taken from me for seemingly no reason.",
            "I have been locked out of my account for days now and any time I attempt to log back in it asks me to verify myself although I have only been logging on to one computer for school and work. Now I am entirely locked out of my account and it wont allow me to verify myself even though I am def giving info that should be working. I can't wait 24 hours again and again to keep getting denied I have important files that I need to access. Why can't I just speak to a person and give my information, it feels like they made this process absolutely daunting for no reason",
            "Locked out of my account. Tried the recovery form multiple times now but apparently other people have filling in everything accurately and still been told its not good enough. I have verifiable information like billing info, linked accounts heck even the console ID and Network ID associated with the account but its still not enough. Any help please?",
            "Is it possible to see what programs/processes ran at a specific time on your PC? Trying to narrow down an input lag issue where there aren't any errors recorded in Event Viewer, so I want to see what programs/processes were running at the time the input lag occurs",
            "Hi, I have this issue where in sync settings, it says some of these settings are hidden or managed by your organization, when this is a personal computer with no organization. I referred to earlier posts and went to the registry, HKEY_LOCAL_MACHINE\\SOFTWARE\\policies\\microsoft\\windows, but could not find the AppPrivacy drop-down tab. Ive tried a bunch of other things but nothing is seeming to work. Ive been going at this for a good few days now, and im BEGGING for a solution.",
            "When trying to sign-in, \"Allow \"microsoftonline . com\" to use cookies and website data\" appears,\n\nThis hasn't happened before and is only happening right now on my iphone 6s plus when I try to sign-in on the Microsoft account page on the Edge app. I only get \"Allow\" or \"Don't Allow\" and when selecting the second option it doesn't get passed that page. I'm worried this is some sort of scam or something? Like, I have never seen this before nor heard of that site it refers to so idk.",
            "Locked out of my own account and cant log into my computer to do vital schoolwork. I have all information but I cant even contact someone over the phone to deal with this. Its absurd considering im a student and im getting locked out of my own computer. I need to resolve this soon please.",
            "A friend's Microsoft account has been hacked with a large amount of personal information on it. They have contacted Microsoft but the hackers have set up 2-step verification and friend was consequently told that although they can see these changes happened in a different country they can not do anything to help resolve this. Friend is obviously concerned/distressed about their personal information. Is there any advice or help that you can give with this, even if it is closing the ms account.",
            "I have been locked out of my account for a couple of weeks. I used my account for Xbox and my account has been frozen so I can't play anymore and I don't want to lose all the money I've spent for games. At first it said it was because of suspicious acitivity so filled out forms to have my account back and running. But now, when I try to reset the password, I don't recognize the safety email. It's a Urinomax email which I've never heard of so I suppose it's a hacker. I tried filling out the account recovery form but I didn't use my account for emails so I have no idea what the last emails I sent were about if I ever sent any. I need someone's help, I don't know what to do."
        ]
    },
    "Nvidia GeForce Now app allegedly coming to Xbox, leaks suggest": {
        "title": "Nvidia GeForce Now app allegedly coming to Xbox, leaks suggest",
        "score": 23,
        "url": "https://www.videogamer.com/news/nvidia-geforce-now-app-allegedly-coming-to-xbox-consoles-according-to-leaks/",
        "content": "",
        "num_comments": 3,
        "comments": [
            "My sister, brother in law, niece are all Xbox users + Chromebook or MacBook users.\n\nThis will finally allow them to get PC-only games on their Xbox (PC Rust for example) along with Xbox streaming on their laptops that they have now.",
            "Geforce Now is already available on Xbox.",
            "That's sick"
        ]
    },
    "Microsoft FastTrack - Experiences?": {
        "title": "Microsoft FastTrack - Experiences?",
        "score": 2,
        "url": "https://www.reddit.com/r/microsoft/comments/1drctmc/microsoft_fasttrack_experiences/",
        "content": "I have done some searches and found some older reddit threads on this, but here is some context:\n\nI am going to be a SharePoint and Teams admin for a medium sized company, and we are working through what would be deemed a digital transformation to bring back some technology stacks in house and refine the collaboration strategy. The current landscape is sort of what you would expect - file shares for department content, users sharing in different ways, and different collaboration tools like Zoom and Slack at play, etc.. I am going to be working to unify the collaboration by updating the intranet and utilizing Teams for more user collaboration and as a standard for meetings and chat. \n\nWhat I am interested in is how I can use FastTrack for Teams and SharePoint adoption assistance, potentially for guidelines and templates on user training, and some of the finer things on helping users get used to the apps. There are 1500 users so I know we have the user base to engage with them, I would just like to hear some opinions or experiences using FastTrack and if the documents or help they can provide. Thanks for any opinions or thoughts on this!",
        "num_comments": 0,
        "comments": []
    },
    "Question on Microsoft Forms": {
        "title": "Question on Microsoft Forms",
        "score": 2,
        "url": "https://www.reddit.com/r/microsoft/comments/1dra0tw/question_on_microsoft_forms/",
        "content": "We are gathering input on how much time people spend on tasks. It’s like a grid question but I couldn’t figure out how to make this in Forms. Note that we have other questions in the form. \n\nFor the first column we want to list out the areas (i.e., calendar management, PO Creation, etc.). Next column I want to ask how many hours per week and then third column give them room to explain anything. \n\nIs there a way to do this without creating individual text questions? \n",
        "num_comments": 0,
        "comments": []
    },
    "Microsoft's Surface Laptop 7 Copilot+ PC is finally the best clamshell laptop on the market after 8 years of iterations": {
        "title": "Microsoft's Surface Laptop 7 Copilot+ PC is finally the best clamshell laptop on the market after 8 years of iterations",
        "score": 23,
        "url": "https://www.windowscentral.com/hardware/laptops/surface-laptop-7-copilot-pc-review",
        "content": "",
        "num_comments": 5,
        "comments": [
            "I'm sure windowscentral.com is a fair and nonbiased source on microsoft laptops.",
            "is that white or just a really light aluminium shade?",
            "lol keep lying to yourself ",
            "Surface never was a good hardware model, that was prone to hardware failure.  And now with the included Malware 11 OS, no thanks.",
            "Eh, anyone who follows Microsoft-focused websites knows theyre harder on Microsoft than anyone."
        ]
    }
}