{
    "Microsoft: Official Support Thread": {
        "title": "Microsoft: Official Support Thread",
        "score": 444,
        "url": "https://www.reddit.com/r/microsoft/comments/o22lfc/microsoft_official_support_thread/",
        "content": "Microsoft: Official Support Thread\n\nMicrosoft Listens This thread was created in order to facilitate easy-to-access support for our Reddit subscribers. We will make a best effort to support you. We may also need to redirect you to a specialized team when it would best serve your particular situation. Also, we may need to collect certain personal information from you when you use this service, but don't worry -- you won't provide it on Reddit. Instead, we will private message you as we take data privacy seriously.\n\nHere are some of the types of issues we can help with in this thread: \n• Microsoft Support: Needing assistance with specific Microsoft products (Windows, Office, etc..) \n• Microsoft Accounts: Lockouts, suspensions, inability to gain access Devices: Issues with your • Microsoft device (Surface, Xbox) \n• Microsoft Retail: Needing to find support on a product or purchase, assistance with activating online product keys or media, assistance with issues raised from liaising with colleagues in the Microsoft Store.\n\nThis list is not all inclusive, so if you're unsure, simply ask. When requesting help from us, you may be requested to provide Microsoft with the following information (you'll be asked via private message from the MSModerator account):\n• Your full name (First, Last) \n• Your interactions with support thus far, including any existing service request numbers \n• A contact email address which you are reachable at\n\nThank you for being a valued Microsoft customer.\n\n9th release of this post (archived due to the size of thread): https://msft.it/61693nHKoH",
        "num_comments": 28462,
        "comments": [
            "How do I talk to a real live person about outlook email? Seriously the worst customer service ever.",
            "I’ve been locked out of my account for three days now. I tried to log onto my Xbox and I was notified that I needed to verify my account which I have had to do about 7 times over the last few months, although I’m not sure why as I never use it for anything other than my Xbox and as a login for my computer. I recently changed my phone number and email however so I could not receive a verification code this time and had to fill out the recovery form. Gaining access to my old email and phone number isn’t an option for me. Every time I’ve filled out the form with as much information as humanly possible I am notified that my identity couldn’t be verified. This means I can’t access my Xbox account or even log on to my computer to access my textbooks and documents for college classes and with finals coming up this needs to be fixed fast. I was even charged for my Xbox subscription the day after my account was locked. Please help, I can’t find anything online other than “fill out another verification form the next day”. I can’t even get Microsoft support to call me without logging on, and I can’t log on without passing this verification form.\n\nUpdate:\n\nI was locked out for a full month and a half and had completely given up on getting back in to the point that I just made a second account and started using that. One day it just worked out of nowhere. I used the same answers on the recovery form that I had already used a few times before; not at all expecting to get in but for some reason this time it got through. It seems like the most important things to put into the form were previous passwords and linked debit card. Overall though it was a nightmare, Microsoft was no help and neither was Xbox customer support.",
            "I have been locked out of my Microsoft account for YEARS. I used to play a lot of Xbox and had my gamertag and Office software tied to the same login/account. I have no idea how but at some point my account got locked by Microsoft (presumably someone tried to impersonate me and log into my account?).  Back when this initially happened I tried to recover the account but have never been able to provide sufficient information in the online form to satisfy the robot on the other end. No human has ever been able to help me. Every so often, I give it another try because I would like to recover my personal account (rather than rely on my work-issued laptop for Microsoft software, and I’m considering getting the Xbox Series X whenever one is available). This has been the longest headache and the most infuriating exercise in futility. I tried again just now but got denied once more by the robot. My backup email that would receive my password reset/recovery link has been LONG deleted due to inactivity (the backup email was an AIM email I created in high school, which shows just how futile this all is). I just want a human at MS to please give me back my account that’s been taken from me for seemingly no reason.",
            "Hi I've been locked out of one of my accounts for a couple of years, going around in circles with the less than helpful microsoft support links - they suggest logging in first. Contacting support requires you also to log on first. I can't log on, the account has been stolen.\n\nIt's a hotmail account, and the password redirect email has been changed - I can see part of what it is when I attempt to log on. The security questions also seem like they've been changed as I can't pass the verification. I'd like to have access to this account back.\n\nI've attempted multiple times over the past 2 years to regain access to no avail. Every time the verification form gets filled out it says my identity couldn't be verified, and around in circles yet again. Meanwhile someone still has access to my email account (with some sensitive info on it too).\n\nSo how do I go about doing this? Or at least lock the account?\n\nThanks in advance.",
            "I have been locked out of my account for days now and any time I attempt to log back in it asks me to verify myself although I have only been logging on to one computer for school and work. Now I am entirely locked out of my account and it wont allow me to verify myself even though I am def giving info that should be working. I can't wait 24 hours again and again to keep getting denied I have important files that I need to access. Why can't I just speak to a person and give my information, it feels like they made this process absolutely daunting for no reason",
            "I am trying to log into an old hotmail account but I don’t remember the password, I no longer have the phone number linked to the account and the recovery email is lost too. Tried the damn recovery form but since I haven’t used this email for 10 years or more it is impossible for me to remember to whom did I send any email or the exact subject… So of course all the attempts have been denied.\n\nI have been researching this issue all over the internet but found no solution. The support pages have been completely useless.\n\nIs there anyway I can speak to a human to solve this problem?",
            "Locked out of my account. Tried the recovery form multiple times now but apparently other people have filling in everything accurately and still been told it’s not good enough. I have verifiable information like billing info, linked accounts heck even the console ID and Network ID associated with the account but it’s still not enough. Any help please?",
            "Is it possible to see what programs/processes ran at a specific time on your PC? Trying to narrow down an input lag issue where there aren't any errors recorded in Event Viewer, so I want to see what programs/processes were running at the time the input lag occurs",
            "Hi, I have this issue where in sync settings, it says “some of these settings are hidden or managed by your organization”, when this is a personal computer with no organization. I referred to earlier posts and went to the registry, HKEY_LOCAL_MACHINE\\SOFTWARE\\policies\\microsoft\\windows, but could not find the AppPrivacy drop-down tab. I’ve tried a bunch of other things but nothing is seeming to work. I’ve been going at this for a good few days now, and im BEGGING for a solution.",
            "Hi, my account was hacked into on Saturday morning and have been contacting support everyday. They changed my recovery email so cannot get back in. Support has been useless and keep telling me to wait and I won’t probably get the account back. Any way to escalate? Tried doing global escalation but no luck so far"
        ]
    },
    "Nvidia GeForce Now app allegedly coming to Xbox, leaks suggest": {
        "title": "Nvidia GeForce Now app allegedly coming to Xbox, leaks suggest",
        "score": 2,
        "url": "https://www.videogamer.com/news/nvidia-geforce-now-app-allegedly-coming-to-xbox-consoles-according-to-leaks/",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Microsoft's Surface Laptop 7 Copilot+ PC is finally the best clamshell laptop on the market after 8 years of iterations": {
        "title": "Microsoft's Surface Laptop 7 Copilot+ PC is finally the best clamshell laptop on the market after 8 years of iterations",
        "score": 21,
        "url": "https://www.windowscentral.com/hardware/laptops/surface-laptop-7-copilot-pc-review",
        "content": "",
        "num_comments": 5,
        "comments": [
            "I'm sure windowscentral.com is a fair and nonbiased source on microsoft laptops.",
            "is that white or just a really light aluminium shade?",
            "lol keep lying to yourself 🤣",
            "Surface never was a good hardware model, that was prone to hardware failure.  And now with the included Malware 11 OS, no thanks.",
            "Eh, anyone who follows Microsoft-focused websites knows they’re harder on Microsoft than anyone."
        ]
    },
    "SharePoint": {
        "title": "SharePoint",
        "score": 2,
        "url": "https://www.reddit.com/r/microsoft/comments/1dr3mrp/sharepoint/",
        "content": "I need to create guiding pages on SharePoint. But, first I need to learn how to use SharePoint. Can you help where to begin?",
        "num_comments": 0,
        "comments": []
    },
    "Infinite MFA Loop": {
        "title": "Infinite MFA Loop",
        "score": 1,
        "url": "https://www.reddit.com/r/microsoft/comments/1dr6cji/infinite_mfa_loop/",
        "content": "Hey, I’m trapped in a Microsoft Authentication Loop, where I try to set up my Authenticator account and it asks me to use Authenticator to do so.\nPls help",
        "num_comments": 0,
        "comments": []
    }
}