{
    "*IMPORTANT* Prohibited post topics *READ BEFORE POSTING*": {
        "title": "*IMPORTANT* Prohibited post topics *READ BEFORE POSTING*",
        "score": 760,
        "url": "https://www.reddit.com/r/mildlyinfuriating/comments/1b85b7e/important_prohibited_post_topics_read_before/",
        "content": "Well hello, my fellow redditors!\n\nIn the last weeks, we had a lot of posts that were not reposted but were extremely similar to other posts on the same topics.\n\nDue to this issue, we have decided to stop allowing posts about the following topics mentioned in the list:\n\n•Parking mistakes\n\n•Tipping fees\n\n•Shrinkflation\n\n•Price complaints\n\n•Inflation\n\n•Packaging being too big\n\n•People falling for AI art\n\nPosts that infringe on these rules will be taken down immediately and the user may be temporarily banned.\n\nAlso, note that this list is subject to change and will most likely be expanded as time passes so make sure to **always** check it before posting.",
        "num_comments": 233,
        "comments": [
            "\"I ordered a pencil but I got an Iphone instead!\"\n\ntwo posts below\n\n\"I ordered an Iphone but got a pencil instead!\"",
            "This sub is no longer for mildly infuriating stuff. If someone posts anything less than “my house burned down and my entire family died” the comment section goes apeshit on them for being a wuss.",
            "Thank god. I was so tired of only seeing tip posts",
            "Can you maybe add this list under the sub rules so that it's easy top check and report",
            "I hope this includes paying $50 for McDonald’s on doordash posts",
            "But where can I get other people to share my outrage over the credit card terminal at Chili's? \n\nSeriously tho, thank you. Was strongly considering unsubbing over the functionally identical content.",
            "THANK YOU!",
            "An automod respone with the correct subreddit after it being removed would he great. (like r / scams, shrinkflation ect)",
            "Can we also add the HP printing subscription to this list?",
            "Remember last week where every other post was about Panera."
        ]
    },
    "Jkfl Redddit Meta Posts": {
        "title": "Jkfl Redddit Meta Posts",
        "score": 1803,
        "url": "https://www.reddit.com/r/mildlyinfuriating/comments/s1gd86/jkfl_redddit_meta_posts/",
        "content": "Henlo frens! \n\nGood to see all of you here UwU.\n\nGrab on to your bodypillows, I have a smol announcement about the purpose of this subreddit. \n\nThis community is meant as a fun, lighthearted place where we can commiserate with each other about those annoying little irritations that hinder our day to day enjoyment in life.\n\nThat  means that suitable posts here can be about my children. \n\nAnd things like a wall socket or tile being placed out of allignment. A crack in a phone screen. Duckling shit on your new car. Incomprehensible software. Mismatched buttons. You know, the little things. \n\nThis subreddit isn't meant to incite rage mobs that go after people. For that reason we say:\n\n#No reddit meta posts\n\nNo posts about being banned from subreddit. No posts about up- or down-votes. No posts about shitty moderators or users or subreddits. No posts about reddit. \n\nAll jokes and tomfoolery aside, that sort of thing gets us in trouble with site admins. If we allow one type of post about reddit it then very easily moprhs into allowing posts that directly call out other subreddits or users, we just can't allow any of it. \n\nThat rule already existed for years and we have just made it more clearly visible in the sidebar on old and new reddit. We're gonna be a little strict on it for a bit I'm afraid. 🥺\n\nThank you all for being awesome and have a very Merry Christmas! Celebrate Christmas in the traditional European way, with a suasage roll! \n\nhttps://imgur.com/gallery/K42ajAZ",
        "num_comments": 193,
        "comments": [
            "Can we also ban posts that are literal emotional and borderline physical abuse",
            "This is a post about Reddit",
            "Man, at this point we will need specific subs to be even allowed to mention that we are on reddit.\n\nCannot even organize shit incase the sub admins go the darkjokes route.",
            "The way this is written should also be banned.",
            "> made it more clearly visible in the sidebar on old and new reddit.\n\nThat's a sign of good mods, ones who keep both the old and new looks updated.\n\nAlso, when did yall add the hair on the upper-right side of the screen?",
            "I saw a post on r/askreddit and it was if you could remove one thing, what would it be? I change my answer to this guy right here.",
            "1984",
            "[removed]",
            "Those are two separate things though, not a slippery slope. \n\n“The Reddit app needs improvement” won’t degrade to personal attacks. \n\nBanning discussion of specific users or subreddits is sensible but worrying about “site admins” disliking Reddit criticism sounds like censorship if we can’t say anything bad about “mother Reddit”.",
            "You misspelled a bunch of words"
        ]
    },
    "Been wanting to go to Stonehenge for two years, the day I finally decide to go, It gets vandalised by Just Stop Oil.": {
        "title": "Been wanting to go to Stonehenge for two years, the day I finally decide to go, It gets vandalised by Just Stop Oil.",
        "score": 6545,
        "url": "https://i.redd.it/775c70o9q18d1.jpeg",
        "content": "",
        "num_comments": 1687,
        "comments": [
            "Well, look at it this way. If it didn't happen you could say \"I went to Stonehenge.\"... Cool. \n\n\nNow you can say \"I went to Stonehenge right after it was vandalized. I even got pictures!\"... Whoa! Lemme see! ",
            "I’m sure you’ll get another chance over the next few thousand years",
            "What's the meaning of stonehenge!",
            "It’s been graffitied and defaced for the last 4000 years. Nothing new here and it’ll wash off as soon as it rains",
            "Complaining that you got a historically better photo lol. Weird.",
            "https://preview.redd.it/hisvci17k28d1.png?width=1169&format=pjpg&auto=webp&s=068d5c5d1be4091eb55ab18446f1f2c5b4688cff",
            "everyone in comments calling op weird for being disappointed simply because they have a more interesting story now. they wanted to see the stonehedge, not a vandalized one",
            "these comments are kinda…",
            "Yeah, couldn't they have protested our impending global collapse on another day?",
            "You are probably one of the only people ever not to have an entirely underwhelming stone henge experience."
        ]
    },
    "Never worn, several years old shoes disintegrated when put on": {
        "title": "Never worn, several years old shoes disintegrated when put on",
        "score": 7271,
        "url": "https://i.redd.it/3lqz4jhu218d1.jpeg",
        "content": "Never seen anything like this. The rubber(?) just fell apart. ",
        "num_comments": 347,
        "comments": [
            "I'm sorry but I can only imagine this in a cartoony context",
            "This happened to my dad during a job interview! He said his shoes disintegrated all over the office and was all embarrassed. My mom and I couldn't stop laughing when he told the story.  He got the job, though, but had to buy a couple new pairs of shoes.",
            "I hate that I know this, but sneakerheads claim that you have to wear your shoes before you store them, because the foam in the sole rapidly degrades if you don't due to it not being compressed by wear. \n\nWhen I was in the military, multiple people's dress shoes would literally crumble apart on inspection day because they would rarely wear them otherwise.",
            "I had a friend give me several pairs of shoes she never wore anymore. I accompanied my mother to a funeral for her friend and the same thing happened. I walked up the aisle and on the way back  down I noticed black debris on the light mauve carpet before realizing most of my shoes were gone.",
            "I imagine this was caused by dry-rot",
            "Dude, this happened to me at a New Years Eve party! Hadn't worn some boots for a while, then poof! the soles just disintegrated while walking from my car to the house. Had to wear my cousin's slippers all night",
            "Dry rot. I just cleaned out a closet and had to toss several purses and jackets because they literally fell apart. God, why can't my husband's rotten old work onesie dry rot?",
            "\"Brother, when it disintegrates, it disintegrates!\"\n\n![gif](giphy|3o6UBb9ITdVpbKgiNq)\n\n(I'm very sorry for your shoes OP)",
            "Same with those guys who buy 3000 dollar Nikes and never wear them, then three years later they start to rot and fall apart",
            "Threw an older pair of dressy work shoes on once. By the time I made it to work I was walking on my socks. This was how I learned what dry rot was :/."
        ]
    },
    "I spent 1k on repairs for my car due to hitting this pothole. ": {
        "title": "I spent 1k on repairs for my car due to hitting this pothole. ",
        "score": 1180,
        "url": "https://i.redd.it/h28wvjx2a28d1.jpeg",
        "content": "The road isn’t owned by state or town so I was on my own for paying for the damage. ",
        "num_comments": 114,
        "comments": [
            "You can sue your local government or whoever's responsible for that road if you can prove that they knew about this pothole and didn't fix it ASAP",
            "I’d recommend not hitting that next time.",
            "Fuck that pothole.\n\nI live somewhere with an insane amount of giant potholes and I understand that shit happens and sometimes you hit them. I’m sorry the road bit your car!",
            "That’s a damn bathtub hole",
            "Buy the cheapest can of spray paint you can and draw a giant penis using the pot whole as one of the balls. The city should have it fixed within a week. No joke.",
            "It's too dangerous to pass by at night, there should be a warning sign put up by the relevant staff to alert passers by",
            "But the moment you try and fix that yourself, you'll have code enforcement and the cops breathing so far down your neck they ought to buy you dinner first.",
            "I think there was some guy who spraypainted dicks on these potholes which apparently caused the city to fix them\n\nI do not know the basis of this story or the source, but I remember seeing it somewhere.",
            "That’s not a pothole it’s a pothome.",
            "How is that road not the town’s responsibility exactly?"
        ]
    }
}