{
    "Enhancing Military Members Wellbeing and Readiness through Hots&Cots App - Full Battle Rattle podcast interview": {
        "title": "Enhancing Military Members Wellbeing and Readiness through Hots&Cots App - Full Battle Rattle podcast interview",
        "score": 29,
        "url": "https://open.spotify.com/episode/5zMrJVpvWEaOOKZAgv21wG?si=10aeb58ab42343ec",
        "content": "",
        "num_comments": 6,
        "comments": []
    },
    "(In Steve Irwin’s voice) “The female dependa is a very aggressive creature we can find right in our very own back yard!”": {
        "title": "(In Steve Irwin’s voice) “The female dependa is a very aggressive creature we can find right in our very own back yard!”",
        "score": 111,
        "url": "https://i.redd.it/ufsc17n5ld9d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Tends to be on the large size, approach with caution. The male of the species is gone from the nest often, but may return unexpectedly.",
            "Sgt Pussywhipped, your wife is on line 2. Something about \"tell that loser to be home on time because she's going out tonight\"",
            "David Attenborough's voice, completely serious, would be hilarious as well.",
            "Not to be confused with the Triceratops, which is different from the Dependapotumus.",
            "So cringe.",
            "She could lean into it a little harder.  She's only got 3 pieces of flair.",
            "My license plate: SOWUT",
            "She is one step below my husband is a 2nd Lt.  You should salute me.",
            "![gif](giphy|bC9czlgCMtw4cj8RgH)",
            "Super Sayian God Wife?"
        ]
    },
    "Threats": {
        "title": "Threats",
        "score": 76,
        "url": "https://www.reddit.com/r/Military/comments/1dqwner/threats/",
        "content": "I’m currently in the military won’t say which branch but I’m in AIT. Recently someone who had been harassing me for four months made a threat saying they were going to beat my ass and it was brought up to me by my drills who said it was brought up to my commander and in every instance of this situation I’ve been treated like I did something wrong. In the beginning when my property was damaged and they admitted to doing it they rolled their eyes when I complained about it and didn’t reprimand them in any way because “I was also being petty playing my music too loud”. I do not talk to this person interact with them or anything. I didn’t then and I still don’t. When the threat was made they moved me told me not to provoke THEM and when I asked why they’re still in our company when people reported not being comfortable being around them as well my drills basically asked if I was scared of them. This is a person who cuts themselves and scratches themselves to a point where they bleed…. Someone I still share the same laundry room and hallway with like this does nothing for me. 10000% I’m always ready to defend myself without fear but it’s like they’re acting like I’m the one that made the threat and never take any action against this person who doesn’t even show up to formations but will rush to reprimand me the one time I was late to formation. I just really feel like they don’t give a rats ass and want me to handle it on my own and risk getting chaptered out or something by this person that we all know is not in their right mind. Is there anything I can do to sue or anyone above my commander that I can discuss this issue with to get a better resolution because I feel like my leadership doesn’t give a rats ass about me.",
        "num_comments": 31,
        "comments": [
            "If they are literally cutting themselves and presumably, there is physical evidence of that, you should seriously consider making a formal and official report.",
            "Lmfao says won’t branch but only one has AIT",
            "If the Company Commander is not doing anything, open door the LtCol. I know you’re new but this is something they should have taught you in basic. Use the open door policy.",
            "You're in the Army",
            "> I won’t say which branch\n\n*immediately indicates branch of service*\n\nHave you tried punching this dude in the mouth?\n\nEdit: if you’re that worried about this person make an official report and make sure your instructor cadre understands the depth of his threatening behavior.",
            "Why so many are just shitting on this guy instead of helping?\n\nYour gonna have to make a bigger fuss until the other guy is the problem.\n\nThey'd rather punish you because your more agreeable. You gotta take yhe nuclear option if no one will help you.\n\nI don't know a ton of resources but you gotta start making a fuss if you want anything. Maybe your ait Instructures can help. They've spent more time with you all than the DS's do in ait.",
            "“Won’t say which branch but I’m at SOI at Camp Geiger”",
            "Here is what I taught my son to do in school. You make the report to the supervisors, you explain to them your concerns. The next time the dude comes around you whip the shit out of him and when it comes out, you can say hey I made a report and nobody helped me. It will be officially recorded, that you did make the report before you had to defend yourself.",
            "You aren't going to like this advice, but I can sum it up in 2 words: Grow up.\n\nThis reads like a high school drama script on the CW minus the supernatural undertones. \"He did this but I got in trouble for my actions and he walked away without any punishment.\" \"He's late all the time but the one time I'm late I get in trouble for it.\" Seriously? They aren't going to share the punishment the other soldier got. They are however still going to hold you accountable for *your* actions.\n\nWorry about you. If he is a threat to himself or others, call the MP's. Report the behavior to your command. Then walk away and stop worrying about them. Things like chaptering a soldier out or med boards take time. Just because you aren't privy to what your command is doing to this soldier doesn't mean they aren't doing anything.",
            "That’s like saying “I won’t say what branch I’m in but we just got in our space ship and flew to the moon with our spaceman ice cream sandwiches” \n\nYou’re in the army dipshit."
        ]
    },
    "Does trump still want to withdraw troops from Germany?": {
        "title": "Does trump still want to withdraw troops from Germany?",
        "score": 252,
        "url": "https://www.reddit.com/r/Military/comments/1dqkahd/does_trump_still_want_to_withdraw_troops_from/",
        "content": "Like the title reads, I am very curious as a german if he still is interested in withdrawing us troops. Germany have just passed the 2% NATO spending target, which I think was the reason he wanted to pull troops out of germany. \n\nAs a german employed within the US Armed Forces I worry that I could be left without a job if he wins the election. Do you think he still wants to achieve what he planned and do you think he would withdraw all troops or only reduce the presence in Germany?",
        "num_comments": 150,
        "comments": [
            "Trump is too unpredictable with his policies to say anything with any amount of certainty",
            "Removing troops from Germany, Japan, or Korea is incredibly unlikely, given how entrenched US presence is in those countries.  \n\nAlso, as Commander-in-Chief, the President obviously has considerable power over the military, but shifting US troop presence around will sooner or later involve funding, and that’s controlled by congress.  \n\nWorst you might see is shifting troops around to different bases and/or consolidating from smaller bases to bigger ones (e.g. there’s been a lot of this in Korea and Japan over the last 7 or 8 years).",
            "He might? If he does, and someone who wants them there gives him a compliment in public, he'd likely change his mind.",
            "Troops will be used as pawns in some sort of “negotiation.”",
            "Trump hasn't been great about portraying his policies he would like to implement if he wins. He seems to want some retribution and to follow through on some heavy internal changes, but his foreign policy talk has been more about how Ukraine wouldn't have been invaded or how the Isreal situation would be resolved if it were him. He hasn't said anything about Germany in years from what I've seen",
            "Since the top answers are politically biased against Trump, I'll give this a shot. Just like every President for the last 40 years he wants every NATO country to pay their share (as required by the NATO treaty). He is the only one I remember threatening the members who don't meet this requirement. Now ask yourself this question, does the President of the United States have the power to pull out of NATO on his own? Would the members of his own party really support that?",
            "Let him call Putin and see what he wants him to do and then you’ll have your answer",
            "I would say if Trump wins, he would do whatever his little boyfriend Putin asks him to do.",
            "If putin has asked trump to remove troops from Germany, trump would do so.",
            "Wrong question. Does Putin want Trump to withdrawal troops from Germany is probably more appropriate."
        ]
    },
    "TFW Ex-Infantry :(": {
        "title": "TFW Ex-Infantry :(",
        "score": 16,
        "url": "https://www.reddit.com/r/Military/comments/1dr3sxw/tfw_exinfantry/",
        "content": "https://preview.redd.it/8riia49m3g9d1.jpg?width=976&format=pjpg&auto=webp&s=5d8272aa461ab54b6849d6068f9fc6d64744fdf2\n\n",
        "num_comments": 19,
        "comments": [
            "I suppose we can always just rob banks as a fallback 🤷‍♂️",
            "Has to be a bug. You're obviously qualified for custodial technician.",
            "Hey, dude, I heard gay porn is hiring. You're more than qualified",
            "You joined one of the best brotherhoods you ever could have. Having an 11 or 03- on your resume is a brilliant conversation piece provided you are willing to learn a new job and were smart about getting certs and a degree. It’s not the easiest job to translate, but if you were a good NCO I know you can lead a team of five or more in my industry, you just need some experience. \n\nSource: am Guard 11A in aerospace, I give an interview to any infantryman whose resume comes across my desk. There have been some duds, but when you find the right one 🤌",
            "We were told it was so noble and I was so proud to do it. Now I’m nothing",
            "same for 19D :(",
            "True, need to squad up though",
            "lol i wish I was gay, guys hit in me all the time",
            "You’re not nothing bro. Your service doesn’t define you, find what interests you and get certs or a degree and work on it that way. You did a great thing serving your country as an 11b now you have the freedom to do whatever you want!",
            "All kidding aside, that's not true. You've developed soft skills that are important. Use you're education benefits for the rest."
        ]
    }
}