{
    "Monthly Rant/Politics Thread: Do not post political threads outside of this Mega thread": {
        "title": "Monthly Rant/Politics Thread: Do not post political threads outside of this Mega thread",
        "score": 4,
        "url": "https://www.reddit.com/r/Millennials/comments/1dc99gz/monthly_rantpolitics_thread_do_not_post_political/",
        "content": "Outside of these mega-threads, we generally do not allow political posts on the main subreddit because they have often declined into unhinged discussions and mud slinging. We do allow general discussions of politics here so long as you remain civil and don't attack someone just for having a different opinion. The moment we see things start to derail, we will step in.\n\nPlease use this weekly thread to vent and let loose about personal rants. Got something upsetting or overwhelming that you just need to vent or shout out to the world? You can post those thoughts here. There are many real problems that plague the Millennial generation and we want to allow a space for it here while still keeping the angry and divisive posts quarantined to a more concentrated thread rather than taking up the entire front page.",
        "num_comments": 45,
        "comments": [
            "Capitalists are the enemy of all mankind from birth they lied to us, stolen from us and actively tried to harm us. From George Washington being a ruthless slave owner, Capitalism is slavery, ownership and control is capitalism. you can tell your boss he doesn't own you but he controls your lively hood and extracts as much value from you as possible without giving you actual stake in the end result.",
            "It's important to vote, all. Our political system are in the shitter, but it can be much worse. Consider the issues that are most important to you and your loved ones, and honestly evaluate whether you believe Trump would improve or worsen these areas for you, your family, and your community.",
            "Why are my comments being auto deleted when I mention being j e w i s h? I am American and have nothing to do with what is happening in the Middle East. Seems like other people can post about other faiths without being deleted.",
            "We Millennials need to push our politicians to finally fix social security. Growing up we heard it as them kicking the can for the next administration to fix, and since Bush Jr. there hasn't been ANY talk of fixing social security and it was the same election year we millennials could start voting. I think this issue is a unifying issue for our generation.",
            "When Trump and Biden began arguing about who's better at golf I lost it!",
            "Evaluated and invested in prisons.",
            "There's no perfect place, but I think the US being the largest English speaking country in the world, and English being the default second language in most of the world, means our media and thus our issues are broadcasted to the world.\n\nIn contrast, not many people are aware of Finland's internal issues because almost no one speaks Finnish outside of Finland.",
            "You're the victim of the baby being thrown out with the bath water,  in the name of fighting antisemitism.",
            "So Biden stutters, gets brain fog, and is frail. I think he showed good policy chops and honesty. He'll never win a Toastmaster contest.\n\nThe great thing about politics is that if you lose in the US, you can always win again. I wish Trump were a lot more self-assured. He has some great moments. But his fragile ego led him to betray this country.",
            "Joe Brown/heresyfinancial on YouTube had a video on the petrodollar thing yesterday. He made it seem like it wasn't that huge a deal. I don't really know what to think."
        ]
    },
    "How much do you miss the 90s ?": {
        "title": "How much do you miss the 90s ?",
        "score": 397,
        "url": "https://www.reddit.com/r/Millennials/comments/1dqzjio/how_much_do_you_miss_the_90s/",
        "content": "I was born in the mid-80s. However, my earliest memories date back to the early to mid-90s. That decade was a very happy time for me.\nAfter 2000 , each day has felt like just another ordinary day",
        "num_comments": 250,
        "comments": [
            "I miss the brightly colored optimism. There was a wonderful tackiness to the 90s.",
            "The only thing I really miss about the past is the lack of responsibility and the unlimited access to hang out with friends.\n\nOtherwise, being an adult is so much better.",
            "Born in 85, so the 90s were a staple to my childhood.  I miss the days of not being plugged into the Internet at the snap of a finger.  I feel like my brain wasn't made to process so much information, and so many people's perspectives, all at once.  \n  \nFor the past year I've tried to make an effort to unplug more and not check social media as often.  But, I'm still guilty of the occasional doom scroll here and there.",
            "I think it's more that I miss the optimism I had in the 90s. I had so much time ahead of me and I could see a future with many possibilities. And now the time goes so fast and I don't see much of a future at all anymore. I think more than the 90s themselves I miss the me I was then.",
            "I know this sounds extremely cynical, but I feel like everything has been downhill since 9/11. The 90s were a magical time.",
            "I miss everything about it. And I end up re-experiencing it often by watching mostly 90s tv shows, 90s movies, and even 90s sports. Most recently I was watching the 1996 Stanley Cup finals instead of the current ones. I rewatched the 1997 World Series. 90s music too. I remember 90s MTV was da bomb. \n\nIt pretty much think everything sucks since 2008. Social media sucks, the internet in general sucks, electric cars suck, dating sucks, friendships suck, parenting sucks.",
            "Born in 86 so I remember the 90s most of all. I miss everything about it. I miss seeing kids being kids playing outside, riding their bikes and just being innocent. Nowadays kids grow up way too fast and they dont have the innocence that kids back in the 80s and 90s had mostly due to the overuse of the internet and smart phones. I believe we were the last generation to ever exist where kids played outside until the street lights came on and didnt spend all day parked in front of a screen. I miss it so much and if I could take my own kids and get into a Time Machine, Id gladly take them back and raise them in the 90s.",
            "After the last 24 hours of horseshit ratings-farm presidential debate, clickbait debate reporting, the Supreme Court's power grab, and me with a stomach bug?\n\nI'm feeling pretty goddamned nostalgic for those halcyon days when I was a teenager, yeah.",
            "I miss it a little too much",
            "Those planes hit them towers and we've just been trying to put the pieces back together ever since"
        ]
    },
    "Honest question/not looking to upset people: With everything we've seen and learned over our 30-40 years, and with the housing crisis, why do so many women still choose to spend everything on IVF instead of fostering or adopting? Plus the mental and physical costs to the woman...": {
        "title": "Honest question/not looking to upset people: With everything we've seen and learned over our 30-40 years, and with the housing crisis, why do so many women still choose to spend everything on IVF instead of fostering or adopting? Plus the mental and physical costs to the woman...",
        "score": 902,
        "url": "https://www.reddit.com/r/Millennials/comments/1dqpw4d/honest_questionnot_looking_to_upset_people_with/",
        "content": "I swear I'm not a troll and I'm not looking for drama. I honestly want to understand bc I even know someone who is bankrupting themselves over this and refuses to actually talk about it. She always just says it's her right to have her own child, but that doesn't make sense and she gets really upset if I ask her to explain how it's a \"right\". I wonder if it's just the word she and others use, but I've never had a convo go that far. \n\nMy isolated community in SE Alaska has lots of children needing homes and plenty more up on the road system. Even though I'm childfree and will soon be on disability, my partner and I have decided to foster teens aging out of the system- the ones everyone ignores. These kids get thrown out on their own with nothing but a trash bag. Sometimes they don't even have birth certificates. And then I see them in the shelter bc they don't even know how to get a bank account or apply for a job. All they need is a little care and guidance to give them a fighting chance. And isn't that what every parent wants- regardless of the child's dna? \n\nEta: Oh my gosh some of these are the best responses I've ever heard! For both sides! I was trying to reply to everyone but I can't keep up! I promise to read everything later. Thanks so much ♡",
        "num_comments": 687,
        "comments": [
            "Fostering and adopting is nowhere near as easy as people make it out to be.  I used to work in the field. If you want to adopt an infant its damn near impossible.",
            "There was a time when I was considering adoption and to be completely honest, I stumbled into some adults who had been adopted as children/babies who were VERY bitter about the whole thing. There was a lot of discourse about thinking adoption shouldn't even exist, discussion of a book called \"the primal wound\" which from the talk surrounding it sounds to be discussing the deep psychological trauma of being put up for adoption. And ultimately I felt like I would love an adopted child as my own, but that they would never see me as their \"real parent\" and the thought of that rejection was too painful for me to consider. I've since realized children aren't for me period, so I'm probably not the target for this question, but just thought I'd add a perspective from someone who did consider it. Additionally, have to agree about the Additional baggage as well as the immense cost",
            "Foster care isn't a way to have a kid. It's temporary housing for children with a goal of reunification. Furthermore, there is not a long line of babies and little kids waiting to be adopted. It's extremely expensive and you basically have to convince someone to give up their baby, which is ethically concerning.",
            "Its a want...there is an emotional and likely biological drive to have one's own biological offspring. If you want an answer rooted in logic and reason you will not get one.",
            "Why do so many **women**? Bruh, its couples not just women. Ffs stop just blaming women for reproductive decisions. Its not just on us.",
            "Former foster kid here and we are fucked up. Its not for everyone and it takes a literal saint to deal with kids like us.",
            "1.) fostering is not an equitable option, as fostering with the hope of getting to keep someone elses child is not ethical. The goal of fostering should be reunification. Socare for someone elses child and have your own child are not the same thing.\n2.) adopting is not necessarily less expensive than fertility treatment. They can also both be sunk costs, that is, you can invest a lot and not ever achieve the end goal.\n3.) our broken child welfare system is not the responsibility of women with fertility issues to fix. Youll need to take that one up with the government.",
            "Why is this question directed at women only?",
            "I'll bite. Hopefully your question is rooted in sincerity. Do you understand the point of the foster system is reunification with biological family? And that there is a shortage of infants to adopt? We have a child from IVF and a 7 year old child we adopted from foster care. We were in a situation where the mother's rights were terminated after two years of us fostering, which is fairly rare. I can tell you having gone through both IVF and adopting through foster care, the foster care adoption was the more stressful of the two. BY FAR.  It upended two years of our lives. We had a happy ending with our adoption but often families do not.\n\nYou seem very uniformed. Your friend owes you zero explanation of her choice.",
            "Adoption is not a backup plan for infertile people. Its a different thing than having biological children. People who adopt thinking its not different fuck up their kids. And stop interrogating people about their personal family choices."
        ]
    },
    "What Were Your Thoughts On The Pussycat Dolls? Any Favorite Songs By Them?": {
        "title": "What Were Your Thoughts On The Pussycat Dolls? Any Favorite Songs By Them?",
        "score": 232,
        "url": "https://www.reddit.com/gallery/1dqzf8d",
        "content": "",
        "num_comments": 194,
        "comments": [
            "I had this CD. I was obsessed with buttons  and stickwitu. I used to cry about my imaginary MySpace boyfriend to that song",
            "When i grow up is a bop",
            "That first photo was the kind of thing that started eating disorders for so many girls I knew. The guys went crazy over concave stomachs and the girls thought that was what they had to have. ",
            "Dont Cha, Buttons, Stickwitu, Beep",
            "Omg remember when being super skinny and wearing low rise jeans was THE way  Im so glad thats over lol",
            "I love their first album! \n\nWait a Minute is still my fave!",
            "The song Jai Ho which was featured in the movie Slumdog Millionaire has the pussycat dolls as a feature. There's an indian singer that sings \"JAI HO!\", then the girls come in and sing \"Jay Ho!\" and it has always bothered the hell out of me. \n\nThat is all",
            "I'm pretty indifferent to their music. But the cool thing is Christina Applegate was part of the Pussycat Dolls back in the 90s and would play in The Viper Room.",
            "Stop looking at my bleeeep I know you lookin at my bleeeep so I wannna beep you",
            "I played their songs on my CD player when I was young. They were good. Stickwitu is my favorite from them. Oh, and \"When I Grow Up\" was the song I listened to on repeat in high school"
        ]
    },
    "Animorphs was awesome! I still read the books from time to time and they still hold up very well. What are your memories of them?": {
        "title": "Animorphs was awesome! I still read the books from time to time and they still hold up very well. What are your memories of them?",
        "score": 34,
        "url": "https://i.redd.it/c80z85yrxh9d1.png",
        "content": "",
        "num_comments": 21,
        "comments": [
            "There's very little I regret more than selling my entire collection at a garage sale. I had every book. All of the mainline original prints, meganorphs, all the chronicles book s including the original andalite chronicles that was split in 3 for those school catalogs, even the CYOA books.",
            "Animorphs taught me that cats like to be scratched behind their ears.",
            "I don't remember much from them but I was reading these in middle school and my dad got into this series too, so I imagine they would hold up if I read them as an adult. I remember they made a TV show and I think I saw one episode. I don't think it was good though.",
            "They are available to read online. I was able to download them and send to my kindle. As a kid I never read all of the books, maybe 60%. Rereading them as an adult is interesting. They are definitely for a YA audience. But the themes are very advanced. Those kids go through hell and they lose their childhood. War is portrayed as terrible and even our Heros in the story make questionable decisions. \n\nThe Ellimist Chronicles are so amazing.. I really would have loved to see a series about the Ket world and Ketran society.",
            "Cute animals on the outside, the horrors of war on the inside.",
            "This series was so dark for a kids book series! I remember very early on a kid gets stuck in an owl body for the rest of his life and he slowly loses his humanity over time. That honestly fucked me up so much as a kid",
            "I sat down and read the first 2 in one sitting a few years ago. So good.",
            "Loved these books as kid!",
            "I'm pretty sure my mother got rid of mine, as well as every pokemon game that had been created with original box up until 2011.",
            "But the darkness is why it worked"
        ]
    }
}