{
    "\"What should I build here?\" style posts are no longer allowed - Use THIS thread instead": {
        "title": "\"What should I build here?\" style posts are no longer allowed - Use THIS thread instead",
        "score": 703,
        "url": "https://www.reddit.com/r/Minecraftbuilds/comments/zokird/what_should_i_build_here_style_posts_are_no/",
        "content": "Recently there have been a lot of \"What should I build here\" style posts. I asked the sub if these should be allowed, and got a [resounding no](https://www.reddit.com/r/Minecraftbuilds/comments/zesu44/mod_here_should_what_do_i_build_here_type_posts/).\n\n**Posts asking for build suggestions are no longer allowed. Use this thread instead.**\n\nIf you want to read or suggest build ideas, check out /r/MinecraftToDo",
        "num_comments": 516,
        "comments": [
            "Bro’s just check pictures on the internet if you want ideas for your Minecraft buildings! Or go watch some YouTube video’s. The best what work for me is watching a survival world review. Or something like that, It doesn’t matter. You can even watch anime, and pick the building ideas from there. It’s your choice.",
            "Good.\n\nWas sick of the dug out holes and flat terrain posts.",
            "Add more builds in the empty spaces",
            "Hey guys what should I comment in this post, pls give suggestions. Thx",
            "So meta…MODs are facilitating the building of this community and they (in some ways) asked us “what should we build here?”",
            "I am also gladdened by this. While I like everyone have at times run afoul of the rules for the various reddits and I know it doesn't feel good, when I come to r/Minecraftbuilds I am really coming to \"see something built\", so the empty screenshots bugged me. Also, I never felt I could give real good advice because I can decide what I would build there, but everybody needs to be themselves.",
            "I'm expanding a village and looking for builds for small (5x5 roughly) homes for villagers that don't just look like simple boxes. Nothing too fancy, but something that won't look too simple and repetitive for like 3-4 dozen houses near to each other",
            "Is this thread used at all. I see so many people just posting instead.",
            "I usually follow tutorials, and Im trying to build a Art /History Museum on my own, Im not sure how builders get their proportions right. If I have a model/real life inspiration, I want to follow, how do I get it to work out? \n\nI know this questions may not be appropiate for this link thread, Im barely new to reddit too, sorry",
            "I've been making a minecraft city in a creative flat world. What builds should I make? I already have a bunch of things like a school for example, but more ideas never hurt :)"
        ]
    },
    "Become a Creator on Builder's Hub": {
        "title": "Become a Creator on Builder's Hub",
        "score": 14,
        "url": "https://www.reddit.com/r/Minecraftbuilds/comments/1bkxk54/become_a_creator_on_builders_hub/",
        "content": "Our Discord server reached 10.000 members!\n\nTo celebrate that, we introduced a new role, it's called \"Creator\"!\n\nIt allows you to post your builds in a special channel in the top of our server. In exchange we request a story or tweet about our Discord server.\n\nIf you're interested, shoot me a DM over on Discord!\n\n[https://discord.com/invite/ZF7GaZzcgW](https://discord.com/invite/ZF7GaZzcgW)",
        "num_comments": 12,
        "comments": [
            "why is my comment not showing up",
            "i beat the dragon for the first time",
            "hello ?",
            "How to me be in discord",
            "Monopoly much, why you allow no other building discord to be mentioned but mention yours everywhere? It's literally anti trust on your part which is shady. If this is really a public community it should be equal.",
            "there's no rule that prohibits you from mentioning building discords  \nEdit: in addition we can only promote our own discord server since it's the only one where we can verify a safe environment for everyone. For other servers we can't guarantee that safety since they're not in our control. That's why this is the only server we're \"promoting\" aka leave as an official resource for users. Again, there's no one stopping you from recommending other servers like the bakery for example.",
            "So every post with a discord being mentioned etc are taken down for what then? 😐🤨 My post in the past got taken down for this exact reason so???",
            "it was probably removed by our automod (yes it flags emojis)"
        ]
    },
    "My survival starter base, went in without a plan, and it took about an hour": {
        "title": "My survival starter base, went in without a plan, and it took about an hour",
        "score": 959,
        "url": "https://www.reddit.com/gallery/1dr5ds1",
        "content": "",
        "num_comments": 100,
        "comments": [
            "About an hour… mhmm, right",
            "An hour? lol\n\nThis would take me 5 years",
            "It looks so cool dude. \n\nYou can also add a little bit of greenery (like flowers ,grass and bushes) at the grassy base of the mountain to make it look more natural.",
            "It's propably a joke anyways, but in survival, it would take more than hour to even spam this many blocks.",
            "I usually spend an entire hour on the small starter house",
            "starter base..... right...... definenitly what I build for a starter base",
            "An hour. Oh really. Well pleased to meet the fastest minecraft builder to ever exist!",
            "Hour my ass. You're fishing.",
            "this reminds me of something you’d see in skyrim! wonderful job! 🖤🫶🏼🥺",
            "God imagine being one block off"
        ]
    },
    "It's hot out there.": {
        "title": "It's hot out there.",
        "score": 72,
        "url": "https://i.redd.it/vc05b2wolh9d1.png",
        "content": "",
        "num_comments": 4,
        "comments": [
            "That's such a cool build! Good job 🔥",
            "Great build and picture. :)\n\nr/Virtualphotographers",
            "what texture pack are you using i like how it looks vanilla but the graphics are wayyyy better",
            "The atmosfere Is perfect"
        ]
    },
    "This is a cute city i've been working on": {
        "title": "This is a cute city i've been working on",
        "score": 120,
        "url": "https://i.redd.it/9yvtox0dng9d1.png",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Looks very peaceful and welcoming, I would definitely like to live there. Great job!",
            "Really nice thanks for sharing :)",
            "I love how colorfull it is!",
            "It's so cute!!",
            "this looks amazing"
        ]
    }
}