{
    "Rejected List Rule Change": {
        "title": "Rejected List Rule Change",
        "score": 129,
        "url": "https://www.reddit.com/r/minecraftsuggestions/comments/1df2gjt/rejected_list_rule_change/",
        "content": "Hey, suggestors!\n\nWith 1.21 releasing, we've decided to make a major change to one of our rules. If you've read the rules, you'll know that you can't post anything on the *Rejected Suggestions list*, a list of ideas that have been rejected by a Minecraft developer at some point or another. However, after a lot of discussion, we mods have decided that this rule isn't really helpful for this subreddit.\n\n**Thus, as of today, suggestions will no longer be removed for being on the Rejected list.**\n\n## Why this change?\n\nWe're removing this rule for a couple of reasons.\n\n1. Since we aren't Mojang, it's quite difficult to determine whether something's actually been rejected. Lots of the entries on the Rejected List are sourced from years-old tweets by individual developers — hardly good reasons to ban people from posting them. Additionally, ideas that have previously been rejected can make their way in the game. Auto-crafting, a feature that was previously on the Rejected list, has now been added to the game via the crafter.\n\n2. The goal of this subreddit has always been to serve as a forum for discussing interesting ideas about Minecraft, *not* to pitch ideas to Mojang. Just because Mojang doesn't support an idea doesn't mean it isn't fun or interesting to discuss. We all have different things we'd like to see added to this game — some more realistic than others — and past rejections from devs shouldn't block people from sharing & discussing those visions.\n\n## What's happening to the Rejected list?\n\nWhile we're removing the rule, the Rejected list will stick around in our wiki if you ever want to take a look and see what ideas have been rejected by Mojang in the past.\n\nThe Rejected list has also been updated to include dates for entries as well as some other adjustments. We'll continue to keep it up-to-date, but we won't remove posts for having ideas on the list.\n\n---\n\nIf you have any thoughts or concerns regarding this change, let us know in the comments! Happy suggesting!",
        "num_comments": 31,
        "comments": [
            "I get allowing discussion around ducks and such, but do we really need to allow suggestions around blood and gore, religious symbols, guns, or changing the name of the game? Some if those ideas were rejected for much better reasons than others.",
            "I think it's good idea, even if a suggestion is talking about a rejected idea, a good post should deserve a chance, and it could also change mojang's mind or allow an exception.",
            "I don't have any useful feedback, but I was just thinking this would be a good change. Thanks!",
            "I think I've even seen some posts on rejected ideas that are still up, so that also makes it more consistent.",
            "What about the jeb design book?",
            "Great change! I wonder if we could also see an update to the FPS list",
            "Thank god, I had some great suggestions that were taken down because 1 little fraction of it was on the list",
            "I think this is good because despite the rejected list here and Mojang's own rejected list on the feedback site, some features from both lists have been added and they've gone against their own rule of what they wont add so I don't feel limiting the visibility of some ideas even if they are \"rejected\" is good  because it could be implemented or explained and brainstormed in a new way that makes it better than the original rejected idea(s).\n\nSome ideas that are OP or redundant on their own can be good with certain tweaks and discussion can easily make that apparent by getting feedback from others on the idea to expand it. This can't happen or get time to shine or be iterated off of if it instantly gets shot down because \"its on the rejected list\" despite being different in execution but not in name.",
            "All that being said - does Mojang also come here for suggestions, or only in their official forum? Because I actually use this subreddit for Mojang to actually see, (cuz that forum is almost a ghost town). But I mean if it’s really just a community sharing ideas.. that’s awesome and all, but I wonder if I should send suggestions too formally or not, if you’re getting what I’m trying to say?\n\nI know this might sound like common knowledge to ya’ll, but I’m kinda new here in terms of knowing what’s going on behind the scenes. So idk",
            "so, now this would go with the crafter block. dantdm tried to make an automatic bread factory/wheat farm, and was having some problems with the wheat seeds. so what if there were hoppers that could only collect one specific items. so for him he'd probably have some of the hoppers collect the seeds so he could just craft the bread without worrying about the seeds, then the one connected to a crafter woould only be able to pick up wheat. i think that's an AMAZING billion dollar idea right there"
        ]
    },
    "Hostile mobs should spawn in peaceful difficulty": {
        "title": "Hostile mobs should spawn in peaceful difficulty",
        "score": 48,
        "url": "https://www.reddit.com/r/minecraftsuggestions/comments/1dr44sx/hostile_mobs_should_spawn_in_peaceful_difficulty/",
        "content": "Hostile mobs spawn in peaceful difficulty, but they either do not attack the player or deal no damage. This makes some loot from them obtainable like blaze rods or less tedious to farm like slimeballs. This also allows peaceful players to beat the game.\n\nThe mobs do not attack the player, with 2 exceptions:\n\nEnder dragons shoot dragon fireballs, but they do not deal any damage to the player, allowing the collection of dragon's breath;\n\nShulkers shoot shulker bullets, but they neither deal any damage nor apply levitation to the player, allowing the renewability of shulker shells.",
        "num_comments": 10,
        "comments": [
            "I think it's time Minecraft had a toggle like other survival games where you can just turn that particular mob on or off, modify spawn rates, etc.\n\nIn peaceful mode the mobs you choose to have on the map follow OPs rule of not doing damage/attacking you.",
            "Or you could just play on easy",
            "I would have this as a setting you could toggle in peaceful mode. That would definitely be helpful for players who still want to see the hostile mobs but not deal with fighting them.\n\nThe game is a lot emptier when none of them spawn at all.",
            "Peaceful mode is supposed to be the easiest difficulty, but it's impossible to beat the game in without seeds, it makes no sense to limit players for playing in Peaceful, it should instead be a gamerule like natural regen",
            "But I wouldn't really like to deal with mobs all the time. Sometimes I just want to play the game and build and have fun, but still be able to get stuff like gunpowder and potions - which you can't do in peaceful, really at all.",
            "you can just go into creative and beat the game",
            "\"I want to play survival\"\n\n\"Just go into creative lol\"",
            "I feel that pain. Last suggestion I had, no less than three people told me to just not have the problem my suggestion was meant to fix.",
            "I wouldn't change Peaceful difficulty in this way.\n\nThere's ample scope to add new difficulty levels instead. I would add the following:\n\n* Simple: Similar to the OP's suggestion. Hostile mobs spawn as neutral mobs. They deal same damage as Easy.\n* Expert: Harder than Hard. Hostile mobs deal more damage. Hostile mobs can spawn with status effects that make them more dangerous: creepers can spawn with Speed II, baby zombies can spawn with Speed II or Strength II and so on. All zombies can break down doors.",
            "I agree with this.\n\nSomething important to note is that the dragon still breaths fire when it lands in peaceful, so collecting's dragon's breath is already possible, assuming you can get to the end.\n\nShulkers also spawn, but don't shoot anything. So the shells aren't renewable."
        ]
    },
    "Endermen should occasionally stalk players": {
        "title": "Endermen should occasionally stalk players",
        "score": 9,
        "url": "https://www.reddit.com/r/minecraftsuggestions/comments/1dr7800/endermen_should_occasionally_stalk_players/",
        "content": "During this stalking behavior, an enderman will drop its usual block-moving activities to follow the player around. It will try to stay a decent certain distance away from the player, and to keep the player in its line of sight. The enderman will stare at you during this stalking behavior. If you stare back or try to attack the enderman, it will teleport and run away instead of aggroing. After a while, it may either resume stalking or return to its normal enderman behavior, if it hasn't despawned.",
        "num_comments": 1,
        "comments": [
            "I like the idea of stalking, but it should still aggro if you look at it"
        ]
    },
    "Villager Trading Improvements - Alternatives to auto-trading": {
        "title": "Villager Trading Improvements - Alternatives to auto-trading",
        "score": 3,
        "url": "https://www.reddit.com/r/minecraftsuggestions/comments/1dr9mrq/villager_trading_improvements_alternatives_to/",
        "content": "*If you want to skip the \"why this matters\" part of the suggestion, scroll down till you see \"****Which Is Best!****\", read the options and tell me your favorite. Thanks in advance!*   \n\n\nVillager trades are a super important part of the game, but the actual process is rather dull. You stock up on tradeables, then wander through trading window after trading window, exchanging items for emeralds, and emeralds for things you actually care about. \n\nThe problem is that most of the time, you have **way** more things to sell to the villager before they lock up, or you have **stacks** of emeralds to spend, but the villager will only sell you the item you need a few times before needing to restock. \n\n[How is it possible that I can grow a field of crops faster than this dude can restock his trades?!?](https://preview.redd.it/6md6mitwvf9d1.png?width=360&format=png&auto=webp&s=3ed12c20e1fa71af1922c6e10c8eb579cd7fdb3a)\n\nYou end up spending your time in game trying to live by the villager's schedule, waiting for restocks, rather than doing something fun. \n\nIf players don't want to wait, the other option is to breed and level up an entire town's worth of villagers for each trade they care about, so they can sell and buy all the items in one go. This adds lag and awful \"hrrnm\" sounds to the base, and encourages players to build cramped enclosures, because at the end of the day, you kinda *need* 10+ masons or whatever if you want to be able to buy enough stuff, and having that many villagers freeroaming is a nightmare. \n\n  \nOver the last few months, several people have suggested different versions of [auto-trading setups](https://www.reddit.com/r/minecraftsuggestions/comments/1dofvf2/end_game_villager_automatable_trading/). Put simply, its useful, but boring! Put your items in, walk away for a while and with 0 gameplay, you come back to the items you actually wanted. At that point, it may as well just be a crafting recipe to turn sticks into emeralds or whatever! \n\nI think automation is a dull way to fix the problem, **I have some alternative ideas and I want you to pick which one you like the most!** \n\n# Which Is Best?\n\nThe goal here is to let the player trade all the items they want to trade, without having to constantly stop for villager restocks, or breed a trading hall with tons of villagers so they can by stacks of items at a time. \n\n  \n**1. The Golden Festival Firework**\n\n[While adding the enchantment glint, I saw the grey at the top as a crewmate, and now I can't unsee it. Sus](https://preview.redd.it/v3bvnrazxf9d1.png?width=160&format=png&auto=webp&s=4317ff1f849270d1a615b08a21e13eaef40d82f8)\n\nThis new item would be a reward for completing raids, maybe exclusive to higher level raids as an added incentive to push yourself, or maybe higher level raids just give you more. This item doesn't have to be a firework, it could just as easily be a new potion (an opposite to the ominous potion perhaps), or a magical gemstone or whatever.\n\nWhat matters is what happens when you use the item. The item starts a festival, cheering up nearby villagers and passive/neutral mobs. I imagine the firework/potion/etc would make a shower of celebratory golden streamer particle effects that last a few minutes to set the mood. While the festival is happening, villagers increase how many times they can trade something before needing to restock, and they restock their trades every 30-60 seconds, so you would easily be able to buy or sell as much items as you want without waiting long. Maybe there are other added benefits, like mobs becoming friendly/tame, or celebrating villagers, players and mobs getting automatic healing to make it useful for people who don't want to trade as well. \n\n  \n**2. A Businessman's reputation**\n\nWhile the previous option was an item you actively used, this could be a passive buff. As you trade with the same villager over and over, they start to predict what items you might care about, and restock their trades accordingly. Each time you max out a trade, the next time they restock it, they will be able to trade it more times, so the first time you buy out all the terracotta from a mason, they can only sell you 12, but after visiting him multiple times, you can buy 128 in a single shopping trip and get right back to building! \n\n  \n**3. Golden Beetroot of Business** \n\nhttps://preview.redd.it/vgdiywzf1g9d1.png?width=1000&format=png&auto=webp&s=95417654932f27c641bd3fb8f7ac15c24be76bdc\n\nBeets are kinda trash in Minecraft. They are harder to get and not worth the effort, they suck as a food. Let's give them a use that isn't just another OP food item for the player. Lets start by crafting them with golden nuggets, same as a golden carrot. \n\nVillagers could eat golden beetroots to instantly restock their trades. This means if you have enough beets and gold, you can trade as much stuff as you want without having to wait. An advantage of this option is that the player still has reasons to collect a lot of villagers, if you have lots of villagers, you can trade with each one first, reducing how much gold you need to spend restocking their trades. \n\n*Shameless self promotion, I have another cool idea for what golden beetroots could be used for* [here. Check it out! ](https://www.reddit.com/r/minecraftsuggestions/comments/1b4ev2j/the_golden_beetroot_and_passive_healing_for/)\n\n  \n**4. Village Progression!**\n\nAdd a smarter system to villager trading, and add an element of progression to villages. The max number of items the villagers can stock is based on how many other villagers there are nearby. A village with 4 members would be poor, and not have much to trade, but as it grows it becomes more prosperous. A small city with 50+ villagers would be able to trade the same thing over and over without running out of stock.\n\nThe player could also place special profession specific blocks to boost their villagers and unlock new trades. Using librarians as an example, a player could place a book-press near a librarian to help them restock more quickly, or give them a scholars table, which would let them learn an additional trade at each level! \n\n[The printing press revolutionized how books were made, making books avaliable to the masses. ](https://preview.redd.it/rtp22hj03i9d1.jpg?width=475&format=pjpg&auto=webp&s=78d6ca64900deea5c2fc5b0851c24288c29ac31e)\n\n\n\nSo, those are the options I came up with; which ones did you like? Would you add them to the game? How could they be improve? I would love to hear your thoughts! ",
        "num_comments": 10,
        "comments": [
            "My biggest gripe with Auto-trading would be how to link it to the player so they still get the reputation and other benefits; I'd had a half-baked idea involving Allays.  However these seem to fit the bill somewhat.",
            "These are good ideas but they might be too complicated for the average player who doesn’t want to learn but I’m down",
            "I like idea 1 and 4 best. The idea of a villager fair is fun, and would be really cool if the villagers set up little booths near their workstation and hung banners, but that may be getting too complex.\n\nI also really like the village levels idea based on population, it would encourage players to transform a village into a bustling city.",
            "> I can't say I agree with your basic premise? On average, as a player without auto-farms, I tend to run out of trade materials a lot more than I run out of trades.\n\nI feel like this is a point players often forget. It is a problem that players created themselves and then complain to the devs that they need to fix it. It's like wanting a 10x speed hopper just so it can handle your million item per tick farm.",
            "Well, with each of these systems, the player is still doing the trading, so they will still get all the xp and reputation from the trades.",
            "Okay good. That means it works pretty well!\n\nIt is hard when making changes to trading, often when you make something easier or harder, it will be appreciated by one group and despised by another. A win and a loss at the same time. If it wouldn't impact you negatively, then it sounds like it would be a win for some and neutral for others, which is still a net positive, a step in the right direction! Ideal world would be win-win, but thats damn near impossible with such a contentious part of the game.",
            "I can't say I agree with your basic premise? On average, as a player without auto-farms, I tend to run out of trade materials a lot more than I run out of trades. But let's assume that this is intended for player who do have that problem.\n\nFor players with auto-farms, the reputation is probably the best method? Since the goal should be to minimize the amount of villagers a player needs (both to prevent lag and to reduce grind), this allows players to only have one villager for any given trade, massively reducing the amount of lag generated from villager setups. It is also simpler to understand, where all the other methods would be hard to communicate to the player diegetically.\n\nGolden fireworks are an interesting idea, but their flaw is that they're semi-rare items (with the recent nerf to raid farms) that are best used when the player wants to trade with *lots* of villagers in a short amount of time - and since it only boosts restocking, it wouldn't even be useful for players re-enchanting their gear after death. That makes it only really useful if someone has a lot of stock to offload for emeralds (rather than, say, just a bit - as I'd imagine is the case for players without overpowered auto-farms) or if someone is looking for a massive amount of building supplies from villagers specifically. For example, if I somehow end up with six stacks of pumpkins and a single villager to trade them with, I'd likely save the firework rather than using it for a single villager. Still useful, but a bit niche.\n\nGolden beets are a fun idea but they have a similar problem - why use a consumable item when you can just wait? Even if golden beets are cheap, setting up a beet farm and crafting them is still more effort than simply waiting around and doing something else in the meantime.\n\nVillager progression is a clever idea, with a lot of upsides - but the big downside of the idea of having lots of villagers is that it encourages big, laggy villager trading halls, kind of going against the fundamental idea. Using job-specific blocks instead (which probably shouldn't be new blocks unless they have other functions, but rather existing blocks) is a good idea though.",
            ">I can't say I agree with your basic premise? On average, as a player without auto-farms, I tend to run out of trade materials a lot more than I run out of trades.\n\nThat is fair enough. I don't think the farming potion of the community is 1%, I would guess its around 1/3 or so. Even before farms are set up, I find myself maxing out trades in the early game, like crops to farmers or sticks to fletchers. It would still be useful for non-farming players, but yeah, the biggest boons are for people with chests full of items from various farms to trade. \n\n  \nsince it only boosts restocking, it wouldn't even be useful for players re-enchanting their gear after death.\n\nTo be fair, if the player is trying to get backup gear, and they just got a golden rocket from a raid, then they have hero of the village and can get their replacement stuff at a discount anyways. Maybe part of the effects of the golden rocket should be to reapply the hero of the village as well though, so you can get that boost on demand.\n\n \n\n>why use a consumable item when you can just wait?\n\nWhen I need 64 name tags for a group of mobs for a zoo, or I need half a dozen stacks of terracotta for a build, I want them now, I don't want to slowly accumulate them over the course of several hours of on and off trading. I would happily spend a stack of gold if it means I can get right back to working on my build. \n\n  \nThe villager progression thing wouldn't require villager trading halls, though it would work well with them as well. The range villagers can detect each other is rather large, having your villagers free roaming would still work. \n\n\n\nI do see your point though, for your playstyle, none of these are really needed. Assuming they were going to be added to help the players who do need them, would any of them cause problems with how you prefer to play the game? Or would they just be options that you *could* use but have no reason to.",
            "I don't think any of them are bad ideas, I just think that some of them are more widely applicable than others. \n\nTrading with villagers to increase how much you can trade with them is simple, doesn't need to be explained to the player, and means that players who trade enough to exhaust stock naturally get what they need, while players who don't, don't have to worry about it.\n\nThe other solutions all seem like jumping through hoops for the same thing.",
            "This post was inspired by a conversation with u/Tnynfox, check out their idea for an [End villager here!](https://www.reddit.com/r/minecraftsuggestions/comments/1dqpreo/end_merchant_a_new_villager_for_end_items/)"
        ]
    },
    "Minecarts should load chunks by default.": {
        "title": "Minecarts should load chunks by default.",
        "score": 2,
        "url": "https://www.reddit.com/r/minecraftsuggestions/comments/1drbiz1/minecarts_should_load_chunks_by_default/",
        "content": "As of now, minecarts are effectively useless. They have been superceded in speed by elytras and in storage by shulker chests. They only real niche they still fill is that they are effectively the only AFK-able mode of transport. However, that feature is heavily limited by the absolute buggy mess the collision code is (chest minecart in front of you in a regular minecart will make you bounce backwards in funny ways as soon as you hit a corner). Currently, only hopper minecarts are genuinely used in some advanced redstone contraptions (which is cool, but it seems like an off-label use to me)\n\n(Aside from the fact that minecart collision ought to be fixed after more than a decade, )  \nI think it would drastically improve the usefulness of minecarts if they would load chunks because that way you could have autonomous freight (be it chest minecarts or entities in regular minecarts) services along a vast network of railways. (Speaking of which, unnerfing the redstone chunk-loading nerf would be good too to effectively remote-control in a balanced way.)\n\n  \nWhat are your thoughts on this?",
        "num_comments": 10,
        "comments": [
            "Mods that add chunkloading tend to at least have the sense to have it either be given some constant cost, or have a limit in place. Meanwhile, your idea just uses 5 iron ingots, no effort. The current method of using portals to load chunks at least is something a player has to spend time on.",
            "I’m under the impression that the furnace minecart should be brought back and given the ability to load chunks when fueled. This puts the chunk loading on a timer",
            "This is already a problem in the current game if you chunkload a farm with the nether portal trick.",
            "Yeah but you have the choice of building the loader. For many farms you basically need to have (hopper) minecarts, so those farms would just be automatically loaded, whether you like it or not.\nPortal chunk loaders also weren't intended by mojang, so it doesn't really make sense to compare them either.",
            "I think the main issue on servers would be that, unlike players, minecarts are always on the server. While players can log off and reduce server lag, the minecarts would always be active.\n\nA potentially bigger issue is that many large farms use minecarts, meaning that these farms would constantly be loaded, which would be horrible for performance. (Especially once the chests are full and you get stacks of items just laying on the ground)",
            "Well yes and no. I think the overlap between \"is aware about server performance\" and \"build farms advanced enough to need hoppers\" is pretty high and even then, you could still disable the farm",
            "The issue here is that just a few minecarts could end up loading a huge number of chunks. Even if they only load a 3 chunk radius around themselves, 10 carts zooming around is constantly loading and unloading 30 chunks per second. Not terrible for a single player world, but it quickly adds up. That is a comparable amount of chunk loading as a 16 chunk render distance player sprinting around. \n\nOn servers where players might have a few minecarts in the base, a few in their farms, it could easily double the number of loaded chunks at any given time, dramatically worsening preformance. \n\n  \nThe upside for the loss in performance seems pretty minor. You can now use rails to slowly transfer a chest full of items over long distances. Technically useful, but outclassed by shulker boxes and elytra, or ender chests. \n\nAt the end of the day, I think 95% of the time, people would just use it for easy chunk loading, and not to actually use the minecarts themselves.",
            "I think you should make this a gamerule (default on imo).\n\nTo the performance bit: Since minecarts ride on rails, you can make a pretty good guess where the minecart will go (if you have a switch coming up, make an educated guess) so you don't need to constantly load and unload chunks.\n\nAlso, I think you overestimate the performance impact. A single player with the default server render distance of 10 will load 441 chunks while loading a minecart over a distance of a kilometer loads 64 chunks (if you load a 64 \\* 1 chunk long strip, which should be possible if you build your railways with a hint of brain). Even if you load both adjacent chunks, you still only load 192 chunks, which is a lot fewer than the 441 chunks a single player loads and all this is under the assumption that you pre-load the entire railway (which would be overkill, especially a kilometer in advance).\n\nPersonally, I think the fear of giving players the ability to chunk-load is a bit overstated. Obviously if you overdo it, you WILL crash the server, but a chunk loader loading idk, 9 chunks is still a lot more performance-friendly than a player afk-idling and loading 400+ chunks. Plus, if you're really worried, you could still disable it with a gamerule.\n\ntl;dr: with the assumption that a minecart loads 3\\*3 around it, you would still need 49 minecarts to have the same load on the server as one player.\n\nEdit: Chunkloaders already exist in the game (the nether portal trick) and have a much greater performance impact than this. IMO making chunkloading unreasonably hard leads players to bad practices such as afk-idling or doing the portal trick.",
            "You wouldn't want the minecart to only load the chunk it is in, it would make the redstone inconsistent. You would want to load at least 1 additional chunk in each direction. I use radius 3 to match portal chunk loading. \n\nA player with render distance 10 loads 20 new chunks as they walk through a chunk. A minecart radius 3 loads 6 of them. 10 minecarts would load 1.5 times more chunks than one render distance 10 player. \n\n\nIt's just the total number of loaded chunks, it's how many new chunks are being loaded at any one time. You may have experienced this if you have used realms or a smaller private server. Things will run smoothly when everyone is just walking around, but if a few players go off exploring, especially if they are using elytra or horses, the server starts getting laggy. Loading and saving all the additional chunks is a much larger drain on performance than simply keeping chunks loaded. \n\n\nWhen hosting a server for my friends, we use dynamic render distance to mitigate this lag. When we are all just building and mining, the render distance sits around 18. If people are exploring on foot, it drops to 14-15. When multiple people travel with elytra, even over explored terrain, it drops to 10-12. The same total number of chunks are loaded at any given time. \n\n\nIf you want to use commands to give the player the ability to turn it off and on, and are convinced the lag impact will be minor, why not cut out the middle man and just use the chunkload command to load you rail lines?",
            "This is true only if you naively load a 3\\*3 area around you. Since minecarts travel on rail, you could easily optimize this in a consistent and predictable way. So yes, chunk loading is laggy when you indifferently have to load a huge amount of chunks because you don't know where the player is going, but it doesn't have to be when you're loading chunks along a predefined path.\n\nNot only that, requiring the player to babysit a minecart train by following it with a minecart makes the performance impact bigger than just letting it be loaded by default.\n\nTo the last comment: I expect features to be useful out-of-the-box and not require the server admin to do \"/gamerule makeMinecartsUseful true\" AND currently you have to hand-designate every chunkloadable railway line."
        ]
    }
}