{
    "Notice: Significant Subreddit Update": {
        "title": "Notice: Significant Subreddit Update",
        "score": 44,
        "url": "https://www.reddit.com/r/MinecraftMemes/comments/1bt9kko/notice_significant_subreddit_update/",
        "content": "The moderation team has worked tirelessly over the past few months to redesign the subreddit with a number of changes we feel are important to enhancing the user experience. After lengthy internal debate, we have enumerated a list of changes that many users have been requesting for a long time. While these changes may seem jarring at first, we anticipate that the community will grow to become accustomed to and appreciate these modifications with time. These changes will be announced in approximately three hours in [this announcement video](https://youtu.be/5HxDA7HGg3c). After the premiere is over, we will be replying to this post with details.",
        "num_comments": 14,
        "comments": [
            "Changelog:\n\n* Changed wording in Rule 1 from `Minecraft memes only` to `Minecraft Memes only`\n* Changed wording in Rule 8 from `Any posts/comments encouraging the action` to `Any posts/comments encouraging brigading` to improve clarity\n* Changed wording in Rule 10 from `Nostalgia memes (e. g. Minecraft veteran memes, \"so glad I grew up with this\" memes)` to `Nostalgia memes (Minecraft veteran memes, \"so glad I grew up with this\" memes, etc.)` due to popular demand\n* Posts with the word `\"the\"` in the title will now be removed\n* Changed the `Sound Warning :loud_sound:` flair to `:loud_sound:Sound Warning :loud_sound:` for symmetry\n* Changed the `OP didn't mark this NSFW :flushed:` flair to `:flushed: OP didn't mark this NSFW :flushed:` for symmetry\n* Removed the `Wandering Trader` emoji due to popular demand\n* Adjusted Smiley's (The Subreddit Icon) colors [(Side-by-side comparison)](https://media.discordapp.net/attachments/1036807989778194432/1223894080623349802/image.png?ex=661b832f&is=66090e2f&hm=c2aa79c30bf5ade648cdbd6e5c9e5d99b6cf2dc808e2f655d4afb7bc05da9996&=&format=webp&quality=lossless)",
            "ok",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠛⠛⠛⠛⠿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠛⠉⠁⠀⠀⠀⠀⠀⠀⠀⠉⠻⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⠋⠈⠀⠀⠀⠀⠐⠺⣖⢄⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⡏⢀⡆⠀⠀⠀⢋⣭⣽⡚⢮⣲⠆⠀⠀⠀⠀⠀⠀⢹⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⡇⡼⠀⠀⠀⠀⠈⠻⣅⣨⠇⠈⠀⠰⣀⣀⣀⡀⠀⢸⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⡇⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣟⢷⣶⠶⣃⢀⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⡅⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⠀⠈⠓⠚⢸⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⢀⡠⠀⡄⣀⠀⠀⠀⢻⠀⠀⠀⣠⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠐⠉⠀⠀⠙⠉⠀⠠⡶⣸⠁⠀⣠⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣦⡆⠀⠐⠒⠢⢤⣀⡰⠁⠇⠈⠘⢶⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠠⣄⣉⣙⡉⠓⢀⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣤⣀⣀⠀⣀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
            "thx mod",
            "Cool",
            "love minecraft i shoude do a minecraft",
            "[https://minecraft.fandom.com/wiki/Daddy\\_Jack](https://minecraft.fandom.com/wiki/Daddy_Jack)",
            "Great ",
            "Bro is it me dreaming or did loire gaming get removed for this sub Reddit "
        ]
    },
    "ANNOUNCEMENT ": {
        "title": "ANNOUNCEMENT ",
        "score": 71,
        "url": "https://i.redd.it/hn3p9o9ne84d1.jpeg",
        "content": "If you are homophobic  your comment will be removed and you will receive a ban.\n\nIf you see someone being homophobic report the comment and we'll remove it, don't reply with something disrespectful because then we have to remove your comment as well \n\nWe are an inclusive community we will not allow bigotry in this community.\n\nThank you for your time ",
        "num_comments": 0,
        "comments": []
    },
    "I get they’re an endangered species irl but really Mojang?": {
        "title": "I get they’re an endangered species irl but really Mojang?",
        "score": 2711,
        "url": "https://i.redd.it/ok3hqnthbd9d1.jpeg",
        "content": "",
        "num_comments": 212,
        "comments": [
            "Since when are armadillos endangered? They are thriving in Texas, other southern states, and throughout Mexico, etc. unless they did this because of some obscure armadillo species.",
            "It would have just dropped 1 scute tbf\n\nWhich isn't useful at all considering you need 6 to craft the armor\n\nThe same deal with the sheep, in which is better to keep them alive than kill them",
            "They just want to make the brush more useful",
            "Minecraft today would have you shear cows for leather",
            "I just kept killing them, assuming the scutes just didn't drop every time. It wasn't until I had killed about 20 that I realised something definitely wasn't right and I googled how to get scutes.",
            "best possible format was chosen",
            "Honestly they should drop a few when they die like sheep do for wool.",
            "Lol endangered? My dogs have killed at least 20. They are pests.",
            "OK. But appart from the fact it's currently to easy to get them. Is it that bad?\n\nMaking a kill armadillo farm would barely be too different from a brush armadillo farm. Like yeah it's different. But you don't need too many anyway. And the requirement would be low every time. Both need an anclosure, a few armadillo, and either a chicken farm from brushes, or a spider farm for breeding armadillo with eyes.\n\nI'd rather have i'tresting way to get items than just drop on death.\n\nThat being said. Goats arnt endangered. Make them drop goat meat. Same for frogs. Same for other animals.",
            "Mojang today is way too sanitized, now they wouldn't have even added the Nether"
        ]
    },
    "This will never be included in Minecraft again.": {
        "title": "This will never be included in Minecraft again.",
        "score": 2684,
        "url": "https://i.redd.it/riuojt08uc9d1.jpeg",
        "content": "",
        "num_comments": 87,
        "comments": [
            "It was supposed to come in 1.17, and then it got delayed to 1.18, and then delayed to 1.19, and then dela- you get the point. It's such a cool and useful item, it's sad seeing it get slowly forgotten by both the devs and the players",
            "It's ridiculous that we can't get them just because pocket edition can't. Either add a button for pocket edition to let them use it or stop bedrock from constantly holding us down",
            "I haven’t played in a while but what’s wrong with the bundle, I thought it was good from what I saw on some videos",
            "“If mobile players can’t have it, then nobody can have it.” This is the logic Mojang is using when it comes to the development of this revolutionary item.",
            "They will be added in Caves and Cliffs part MCXVIII",
            "What is that",
            "pocket edition tends to ruin everything",
            "Mojang just need to cave and add a backpack, fits in a special back slot, can also have elytra.  \nThe game really needs more, to embrace the world, cause playing minecraft with curios, I can't go back to just the default 4 basic af slots.",
            "It's gonna come someday? Right?",
            "People complained about it anyways"
        ]
    },
    "People don't realize how massive of a feature that is": {
        "title": "People don't realize how massive of a feature that is",
        "score": 1227,
        "url": "https://i.redd.it/bex0hukd8d9d1.jpeg",
        "content": "",
        "num_comments": 64,
        "comments": [
            "Can you autocraft autocrafter? Infinite autocraft!",
            "literally factorio in minecraft getting real",
            "I can finally have a hypixel skyblock iron minion shaped iron farm that produces ACTUAL IRON BLOCKS!!!!\n\n# THE COMPACTER IS REEEAAAALL",
            "i was gonna say i hope create mod keeps the mechanical crafters but since they're not just for auto crafting i realised they're probably gonna stay",
            "For technical players sure, but if you're more a casual explorer/adventurer it's trial chambers for sure",
            "THE AGE OF STEEL HAS BEGUN",
            "Why is it even so useful? Crafting doesn't take much time",
            "I mean, its amazing, but 1.21 definitely doesnt fit being a coffin.",
            "I've not left my industrial district since 1.21 dropped.\n\nMore Factories!!!",
            "True"
        ]
    }
}