{
    "Minecraft Java Edition 1.21": {
        "title": "Minecraft Java Edition 1.21",
        "score": 587,
        "url": "https://www.minecraft.net/en-us/article/minecraft-java-edition-1-21",
        "content": "",
        "num_comments": 186,
        "comments": [
            "https://old.reddit.com/r/Minecraft/wiki/1_21_faq\n\n> ###What time will it be released?\n\n> There is no fixed time. Releases are staged to be available for all supported platforms on or after the announced date - Thursday 13th June 2024 - and will be released around the world **at some unspecified time in your time zone**. On most platforms, you should be seeing the update becoming available already. If not, please be patient. All supported platforms will be receiving an update.\n\n> ###What features are not in 1.21?\n\n> * Bundles are **not** in 1.21\n\n> * Villager Trading Rebalance is **not** in 1.21\n\n> * Apparently Hardcore Mode is **not** in Bedrock Edition 1.21\n\n---\n\nKnown Bugs: https://old.reddit.com/r/Mojira/comments/1df1csa/bugtracker_report_121/\n\nBedrock Edition 1.21 Release Notes: https://feedback.minecraft.net/hc/en-us/articles/27451789924237-Minecraft-Bedrock-Edition-1-21-Tricky-Trials",
            "This update is actually pretty dope.",
            "Now the wait for all the mods I use to be updated and my server to be updated",
            "Time to start a server with my siblings again!",
            "Quieter pistons, huh? Anxiously awaiting the day Mojangles realizes the minecarts are also way too loud when you're riding in them, and bells are too quiet. I want to make my trains ring bells when they approach a station!",
            "does the changes to the portals mean bedrock players won’t have to be vulnerable at the mercy of a super long loading screen? or am I wishing too hard?",
            "Thanks for the excellent update Mojang! I really love the trial chambers, and I hope there's more combat-adventure gameplay content in the future",
            "Do bedrock updates come after Java?",
            "Gotta wait for my realm to be updated now",
            "Now I wait for my server to be updated…"
        ]
    },
    "someone on my server made this machine what in tarnation is it": {
        "title": "someone on my server made this machine what in tarnation is it",
        "score": 3175,
        "url": "https://i.redd.it/p917te95y08d1.png",
        "content": "",
        "num_comments": 98,
        "comments": [
            "* Upvote this comment if this is a good quality post that fits the purpose of r/Minecraft\n\n* Downvote this comment if this post is poor quality or does not fit the purpose of r/Minecraft\n\n* Downvote this comment *and report the post* if it breaks the [rules](https://www.reddit.com/r/Minecraft/wiki/rules)\n\n---\n\n[Subreddit Rules](https://old.reddit.com/r/Minecraft/wiki/rules)[](## Bubbly_Doctor3482|1dljymx)",
            "there was a tiktok with this EXACT build displaying it duping diamond ore (it was fake and it doesnt work)",
            "That literally does nothing useful",
            "We finally found the thingymabob",
            "Random bullshit go!",
            "It does nothing, but they were trying to dupe diamonds…",
            "its some type of redstone device",
            "\"yeah i can do redstone\"\n\nthe redstone:",
            "Looks like the only thing it does is move the piston when the switch is activated. The bell, slime, and honey are in no position to do anything.",
            "Oh god, it is the throngler!"
        ]
    },
    "My dad says I’m mad for playing Minecraft again": {
        "title": "My dad says I’m mad for playing Minecraft again",
        "score": 689,
        "url": "https://www.reddit.com/r/Minecraft/comments/1dlqv33/my_dad_says_im_mad_for_playing_minecraft_again/",
        "content": "I’m 15m and I bought and redownload minecraft so I could play hypixel like I did before my cracked account got banned in 2019. Getting used to the controls again and winning a couple games of bedwars and skywars but my dad saw me playing and said that I am way to old for the game and the only reason I win is because I’m against little children he then took away my pc because he thought I was playing it to groom children lol and said I was a mad man? Idk what I should say to him i Alr mentioned to him about his girlfriends daughter is 23 and plays with Lego so why can’t I play Minecraft but he still ain’t buying it",
        "num_comments": 242,
        "comments": [
            "* Upvote this comment if this is a good quality post that fits the purpose of r/Minecraft\n\n* Downvote this comment if this post is poor quality or does not fit the purpose of r/Minecraft\n\n* Downvote this comment *and report the post* if it breaks the [rules](https://www.reddit.com/r/Minecraft/wiki/rules)\n\n---\n\n[Subreddit Rules](https://old.reddit.com/r/Minecraft/wiki/rules)[](## oriiiin|1dlqv33)",
            "Your dad thinks it's more likely that you're grooming kids than playing a game for fun... The fuck?",
            "None of the advice here is going to work, you dad is extremely irrational. You just gotta deal with his nonsense until you're old enough to move out. Then you can do what you want. Based on his comments though, you might want to seek out therapy for emotional abuse.",
            "Minecraft is for all ages, young and old. I can at least ensure you that. \n\n\nYou want to see literally an older guy giving out **hours** of build tutorials on YouTube? https://youtube.com/@how2withbasics567",
            "There's something very, very wrong with the way your family works if your dad is accusing you of grooming children in a video game without evidence. Grooming is a serious matter; he shouldn't be throwing around baseless accusations (provided you aren't actually grooming children). Also, what right does he have to tell you what to play and not to play? So what if you enjoy clubbing literal 8 year olds in bed wars? How is that any of his business? You don't get to tell him who to date, so why does he get to tell you what games you get to play? Taking away the pc is also ridiculous; you're not a kid who needs to get your iPad taken away when you misbehave. Try to have a talk with him about it---tell him that the game is for everyone to enjoy, you bought the game yourself, and you can be trusted to make sensible decisions as a 15-year-old.",
            "if hes an older guy in his 50s or older chances are pretty good that he probably watches old cartoons like the flintstones on MeTV",
            "I don't know maybe we all just announce our ages I'm 36 and I've been playing Minecraft for like 12 years I think. I have friends that have kids that are younger than you did they start talking about Minecraft and I can keep a conversation with them and my friends just look at me like what the just happened. We actually had a long funny conversation about yep I'm going to send him your way when he has questions about this cuz I don't understand any of it.",
            "You’d actually be surprised how many people who play hypixel are your age and older, I think there is more people your age playing hypixel than little kids so respectfully tell your father you can do what you like :)",
            "Dad needs to stop listening to QAnon conspiracy idiots.",
            "Show him hermitcraft, no one there is under 28 years old lol"
        ]
    },
    "World generation at its peak": {
        "title": "World generation at its peak",
        "score": 1562,
        "url": "https://i.redd.it/8y9rept1yz7d1.png",
        "content": "",
        "num_comments": 49,
        "comments": [
            "* Upvote this comment if this is a good quality post that fits the purpose of r/Minecraft\n\n* Downvote this comment if this post is poor quality or does not fit the purpose of r/Minecraft\n\n* Downvote this comment *and report the post* if it breaks the [rules](https://www.reddit.com/r/Minecraft/wiki/rules)\n\n---\n\n[Subreddit Rules](https://old.reddit.com/r/Minecraft/wiki/rules)[](## MrJanca|1dlftpn)",
            "At least you won't have to build a wall around it when you turn it into a guardian farm.",
            "i hope you dont mind if i ask, what is your seed and the version?",
            "That's a mod and/or datapack conflicting with world generation. I just went there and it's completely normal.",
            "I am super jealous.",
            "Puddle monument",
            "finding that is more common then finding a good flat plains biome now",
            "I was portal traveling to a woodland mansion and it was at -41 y level",
            "Seed",
            "thats crazy"
        ]
    },
    "What mobs do you always forget about?": {
        "title": "What mobs do you always forget about?",
        "score": 2819,
        "url": "https://www.reddit.com/gallery/1dl63g7",
        "content": "",
        "num_comments": 639,
        "comments": [
            "* Upvote this comment if this is a good quality post that fits the purpose of r/Minecraft\n\n* Downvote this comment if this post is poor quality or does not fit the purpose of r/Minecraft\n\n* Downvote this comment *and report the post* if it breaks the [rules](https://www.reddit.com/r/Minecraft/wiki/rules)\n\n---\n\n[Subreddit Rules](https://old.reddit.com/r/Minecraft/wiki/rules)[](## Savage1317|1dl63g7)",
            "Bats. Until they scare the shit out of me",
            "The zombie horse 🐎 is the one that I forgot and almost like never seen it.",
            "I never saw a Sniffer since it was introduced lmao",
            "Never forget the giant :(",
            "the Endermite.\n\nIf it not were for elytras they would be much more noticed ~~and a scar in my balls~~.\n\nThey once resembled the silverfish but now they look like an ender burger. What a boring design",
            "Zombie horse is above everyone else's league here, I simply forget it exists because it doesn't spawn and can't be spawned in survival",
            "Ocelots. So forgotten that nobodies even mentioned it.",
            "My BF always gets startled , or goes ‘what’s this blue thing??!?’ Whenever we finally find an Allay lol same with ocelots, ‘what a cool cat!’",
            "Bro….. there’s tadpoles in Minecraft?!?! 🤯"
        ]
    }
}