{
    "r/Minecraft is now under new management": {
        "title": "r/Minecraft is now under new management",
        "score": 4256,
        "url": "https://www.reddit.com/r/Minecraft/comments/1dnld2e/rminecraft_is_now_under_new_management/",
        "content": "Hello, everyone.\n\nYou might've heard about an incident regarding one of our moderators removing a post that we and many others believe shouldn't have been removed. That moderator has been the head of this sub for a long time and decided to resign today, at the rest of the team's request. We wish them the best.\n\nConsequent with this, the subreddit is now under new management. We want to do the best to make things right for the community and do better where the sub's previous management had failed. Effective immediately, all remaining transparency moderators will be converted to regular moderators. We will also be recruiting new moderators soon and will bring new people onto the team accordingly.\n\nThis is going to be a bumpy ride for a little while, but we're confident everything's going to turn out well in the end. Please be patient, as we may be a bit slow to respond to modmails for a little while as we go through this phase. If you have any questions, feel free to let us know in the comments.\n\n~ New r/Minecraft Management",
        "num_comments": 445,
        "comments": [
            "Wasn't that months ago about the guy who posted a picture of a grave a guy made in Minecraft for his departed GF?",
            "This sub has some rough history regarding mods, hope this will change with the new managament",
            "What post is this referring to?",
            "After reading through mod comments and digging through what happened, I gotta say, thanks for the transparency.",
            "The easiest way to NOT screw up is just, allow people to share cool stuff THEY made and credit themselves for it, and let the community decide whether its worth boosting w upvotes, instead of being a PoS and nuking people trying to showcase something awesome.",
            "This is the first time Ive ever seen a mod team acknowledge a situation like this. I respect the transparency.",
            "I'm glad to see this. It's always good to see when mods get kicked out after doing something stupid",
            "I thought this said Minecraft for a second and was worried what would happen without mojang then realized it was the Reddit and was relieved af lol",
            "What happened to \"The Real Wormbo\"?",
            "finally... this should've already happened looong ago, and like twice.."
        ]
    },
    "Been fighting Cancer for 2 years and made this while in treatments 😊": {
        "title": "Been fighting Cancer for 2 years and made this while in treatments 😊",
        "score": 22538,
        "url": "https://v.redd.it/g4dbvuqq6f9d1",
        "content": "",
        "num_comments": 310,
        "comments": [
            "Hey yall were cool with this post :)\n\nBest of luck in your recovery Alex",
            "this looks awesome! and congrats on beating cancer!!!!!!",
            "Oi , Congratulations m8!!! , You are not only a strong person , also you have great talent. Thanks for sharing with us this great job. I hope the life will keep smiling at you from now , take care!",
            "Lego packs are still one of my favourite pack of all time",
            "Congrats Man, Glad your doing good, and these it just a masterpiece",
            "DAMN, where's the download link!",
            "So happy you beat cancer and youre very talented! Will check it out later. Thanks man",
            "Nice! What's the texture pack name and what websites do I get it from and is it on bedrock?",
            "Congrats !! Your pack is amazing :))",
            "i swear to god if the mods remove this"
        ]
    },
    "12 years ago, people’s reaction to the addition of The End": {
        "title": "12 years ago, people’s reaction to the addition of The End",
        "score": 15539,
        "url": "https://www.reddit.com/gallery/1dqo13c",
        "content": "I find it incredibly interesting how negative everyone was about it\n\n“It almost ruins it” 😭",
        "num_comments": 673,
        "comments": [
            "That last one about looking forward to the speedruns really was ahead of its time lol",
            "This just reddit being reddit lul",
            "calling it something out of an Ayn Rand book is absolutely insane",
            "For a game with an infinite scope and self-created objectives, the ending is quite fitting.",
            "People just complain about anything new, people complained when the nether was updated but now it's considered one of the best updates in modern minecraft.\n\nPersonally I love the little poem in the end. People said it was telling you to get off the game and go outside, but it's not. It's telling you that you did a good job and that you matter, despite everything. \"And the universe said I love you, because you are love.\"",
            "This is r/Minecraft's reaction to literally any change ever",
            "The good old argument of its not very minecrafyy",
            "You should read the Fortnite subreddit when battle Royale came out. They were MAD that epic games made a new game mode (battle Royale) and not focusing on the core game (PvE)\n\nBut what is interesting about Fortnite 'S case is that the PvE players STILL dislike battle Royale and the battle Royale players probably don't know the PvE game mode exists",
            "Minecraft players have been whining about everything new since the dawn of time.",
            "I liked the ending of lost."
        ]
    },
    "\"Worst Redstone can say is no\"": {
        "title": "\"Worst Redstone can say is no\"",
        "score": 1416,
        "url": "https://v.redd.it/2socim3ncd9d1",
        "content": "",
        "num_comments": 32,
        "comments": [
            "Oh... Oh this is gold.",
            "bro got rejected by pama",
            "How do you get the days played to show under your coordinates?",
            "100% thought the machine was going to explode and destroy everything in the general vicinity",
            "I have a Mumbo video in PIP right now",
            "Never thought Id feel so attacked by redstone lamps but here we are",
            "Wow... Not even the game loves you",
            "You should have shot a TNT out at the end",
            "Blow it up with TNT",
            "OP, Im curious what music did you use? Ive heard it everywhere but no idea where its from"
        ]
    },
    "Just bought minecraft :D": {
        "title": "Just bought minecraft :D",
        "score": 1007,
        "url": "https://i.redd.it/3cguy03ywc9d1.jpeg",
        "content": "",
        "num_comments": 108,
        "comments": [
            "Nice! Have a fun time. Tip: stick to your first world, itll become very nostalgic and you can work in superprojects.",
            "Pro tip: to save time when mining just dig directly straight down to find the caves.",
            "There's this secret achievement called \"Hell sleeper\" you get in the nether, to get this you need to sleep in the Nether. Just tryna help, have fun",
            "Eat some of that food so your health will recover :-)",
            "I am right now on a cave under a lake",
            "If you have a pc, try getting java edition!",
            "I've just started too! Let's have a great adventure in our first worlds.",
            "How is it so far?",
            "Better late than never. I like that it's Pocket Edition because that was my most played version until I got it on PC.",
            "Yay! Look at you and your starter base! Keep us pisted on your progress!"
        ]
    }
}