{
    "Summer 2024 Painting Competition: Submissions Now Open": {
        "title": "Summer 2024 Painting Competition: Submissions Now Open",
        "score": 17,
        "url": "https://www.reddit.com/r/minipainting/comments/1dcfgid/summer_2024_painting_competition_submissions_now/",
        "content": "# Submissions are now open!\n\nWe're happy to announce that submissions for the Summer 2024 Painting Competition are now open! Submitting your entry is super easy, [just create a new image post](https://www.reddit.com/r/minipainting/submit), follow the directions on how to photograph your entry below, and use the flair \"2024 Unpainted Painting Contest Entry\". Once you submit your post, you'll receive a response from AutoMod with a link to the form to complete for entering the competition.\n\nYou'll receive a message from the mod team here that your entry has been accepted (or in the rare case rejected or if there's a problem) and then you can begin painting! If you have questions on any of this, feel free to post below or [shoot us a message](https://www.reddit.com/message/compose?to=r/minipainting) and we'll get you an answer. \n\n  \n\\------------------------------------------\n\n# Important Dates\n\n&#x200B;\n\n* June 10th – Initial Entries / Signups Start     \n \n* July 21st – Last Day for Initial Entries / Signups     \n \n* July 22nd – Final Image Submission Begins     \n \n* August 11th – Last Day for Final Image Submission     \n \n* August 12th - 26th – Community Judging     \n \n\nAll dates start 12:01 am / 00:01 Pacific Time and end 11:59 pm / 23:59  Pacific Time.   \n\n# ------------------------------------------\n\n# Categories\n\nThis year we’re opening things up a bit and allowing users to have  multiple entries, with a limit of one entry per category and you can not  use the same model in multiple categories. If your model would fit into  multiple categories, pick the best one for it.   \n\n&#x200B;\n\n* Single Small Models (up to 54mm scale)     \n \n* Single Large Models (larger than 54mm scale)     \n \n* Unit/Squad     \n \n* Diorama     \n \n* Busts     \n \n* Vehicles     \n \n\n# ------------------------------------------\n\n# Judging and Awards\n\nThis year judging will be handled entirely by the community of [r/minipainting](https://www.reddit.com/r/minipainting/)!  Once entries are finalized and submitted, a new post will be pinned with  the entries and information on judging. We've looked at previous years'  data and have decided on a range that we feel will give a fair result  to every entry. Judging will be simple as we make changes and test  things out, so this year the two factors that will be judged are the  build of the model, think mold lines removed, gaps filled, etc. And then  finish, so the paint and techniques itself.   \n\n&#x200B;\n\n|Judging Criteria|Points Available|\n|:-|:-|\n|Build|1-4|\n|Finish|1-4|\n|Total Available|2-8|\n\nScoring will be tallied up and averaged from the community judging form and the following levels will be awarded.   \n\n* Gold: 6.75+ points   \n* Silver: 6-6.74 points   \n* Bronze: 4-5.9 points   \n\n# ------------------------------------------\n\n# How to Enter\n\nCreate a new image post containing the images of your submission and be sure to use the \"2024 Unpainted Painting Contest Entry\" flair. Follow the instructions on the comment left by AutoMod, **be sure to do this or your submission will not be counted!** You'll get a link to a form that will ask for a few more bits of information.\n\nOnce your submissions is in, you'll receive a message from us letting you know that your submission was accepted and you can begin painting!\n\nThe entry form includes a section to submit your unpainted entry  picture(s). Unpainted entry pictures must include the following clearly  visible and not be edited/photoshopped in:    \n\n&#x200B;\n\n* Your Reddit username      \n \n* The date (any standard date formats is ok)      \n \n* The word “surprise”      \n \n* Your chosen unpainted mini(s)      \n \n\nHere are some examples of unpainted entries that would and would not be accepted:    \n\n[Good examples of unpainted entries (will probably be accepted)](https://photos.app.goo.gl/QMqQVxui9MuLZL928) \n\n[Bad examples of unpainted entries (will not be accepted)](https://photos.app.goo.gl/2GEJWN2y1uPUw5ur6) \n\n**Entry pictures need to be posted to** [r/minipainting](https://www.reddit.com/r/minipainting/) **using  the post flair “Unpainted Contest Entry”. The flair will become  available starting on June 10th when the entry form goes live.** \n\nIf you need more than one picture for your unpainted entry, like if  you have multiple minis in a large entry, please make a gallery post  that includes all your images and not make separate posts for each  image. When you make this post, automod will send you a message  explaining what to do next!    \n\nEntry pictures do not need to include the base, basing materials, or  extra bits you might add during the painting process, but everything in  your piece should be painted during the contest, base included. It is  also fine if you add a few extra bits to your piece during the painting  period that were not in your original unpainted entry. Adding simple  bits like pouches, weapons, or a simple headswap are fine, but your  unpainted entry picture should represent about 90% of what your final  piece will be.    \n\nDo not use pre-painted/pre-finished bases or minis. Everything in  your final painted entry must be painted during the contest, after you  have made your unpainted entry.    \n\n“Unpainted” is not completely literal, and there is some flexibility  in what your unpainted entry can be (including primed, based, etc).  Basically the model can have everything done up to the point of applying  actual paint beyond priming.    \n\n**With the addition of multiple entries, if you are entering  into two or more categories you will need to submit a post for each  entry.** \n\n***Note: Banned users cannot enter this contest*** \n\n# ------------------------------------------\n\n# Final Submissions\n\nFinal submissions will begin being accepted on July 22nd and end on  August 11th at 11:59 pm/23:59 PST. If you did not submit an unpainted  entry that was accepted, you cannot submit a final painted piece.    \n\nOnce final submissions open, a new announcement will be made with  links to the final submission form for your final pictures along with  full final submission details. You do not need to timestamp these images  or include your username. If you finish early, take your pictures, and  hold onto them until July 22nd!   \n\nPlease keep the background as neutral as possible, this means no  artwork backdrop (unless it’s part of the model/base) or AI generated  backdrops, screens, etc. We suggest a neutral white, black, or gray  background that lets the viewer focus on the model(s) and your work.   \n\nFinal submission requirements:    \n\nMust be posted to [r/minipainting](https://www.reddit.com/r/minipainting/) with the “2024 Painting Competition Final Submission” flair (this flair will become available on July 22nd)    \n\nMust not be posted to [r/minipainting](https://www.reddit.com/r/minipainting/)  before the final submissions open (WIP posts are fine before this date,  as well as posting final images to other social media platforms or  subreddits)    \n\nMust include a picture of your entry from the front\\*    \n\nMust include a picture of your entry from the back\\*    \n\nMust include one picture of your entry next to a standard bottle or  pot of hobby paint (ie. vallejo, citadel, army painter, etc) or a ruler  for scale placed vertically next to your mini    \n\n\\*If it makes more sense to photograph your mini from the left and  right sides instead of the front and back, you may use those angles  instead. The important thing is we see as much of your mini as  possible.    \n\nThe paint pot/bottle may be included in either the front or back photos, or be a separate photo.    \n\nYou may include more pictures if you would like, but you must include the above at minimum.    \n\nFinal submissions cannot include misleading lighting, filters, image  editing (beyond basic color/level adjustments), AI adjustments, etc.    \n\nOnce your final submission is accepted, you cannot change or update  it in any way. Make sure your piece is finished and your pictures are  good before you submit it! Links to submit your finished piece will be  included in a new announcement post on July 22nd. Remember not to post  your final pieces to [r/minipainting](https://www.reddit.com/r/minipainting/) before this date.    \n\nThe first picture in your gallery will be used as the preview image  during the community and judge voting. You cannot request another image  be used instead, so make sure to arrange your images correctly when you  post your gallery.    \n\n# ------------------------------------------\n\n# Community Favorites\n\nDuring judging we’ll ask the community for their favorite entry and  tally these up. At the end of judging the top entries will receive the  Community Favorite flair in addition to any medal earned from judging.   \n\n# ------------------------------------------\n\n# Important Dates\n\n&#x200B;\n\n* June 10th – Initial Entries / Signups Start     \n \n* July 21st – Last Day for Initial Entries / Signups     \n \n* July 22nd – Final Image Submission Begins     \n \n* August 11th – Last Day for Final Image Submission     \n \n* August 12th - 26th – Community Judging     \n \n\nAll dates start 12:01 am / 00:01 Pacific Time and end 11:59 pm / 23:59  Pacific Time.",
        "num_comments": 19,
        "comments": [
            "# F.A.Q. (See reply to this for even more information)\n\n# Entering the Contest\n\n**What does \"unpainted\" mean?**\n\n\"Unpainted\" is a general term and is more flexible than it sounds. Your unpainted entry can be any of the following:\n\n**Assembly:**\n\n* on the sprue\n* loose pieces off the sprue\n* fully assembled\n* in subassemblies\n* temporarily assembled (ie with sticky tack or small amounts of glue)\n* 3D printed\n* hand sculpted\n* kitbashed\n* include extra sculpting (such as with green stuff)\n\n**Priming**\n\n* literally unpainted/completely unprimed\n* spray primed\n* brush primed\n* zenithal primed\n* non-traditional zenithal prime (ie with colors other than black/white/grey or from a direction other than top down, such as zenithal prime preparing for OSL)\n* primed and simply drybrushed with a single color (ie preparing for they slap chop style of painting)\n* a previously painted mini that has been stripped (most of the paint removed)\n* a pre-painted mini that you have primed over\n\n**Basing**\n\n* not attached to a base\n* attached to a base\n* attached to a temporary base\n* may have texture paste or flocking on the base\n* may have unpainted basing materials applied (ie cork, rock, scatter, etc)\n* attached to a plinth/display base\n\n**Your unpainted entry** ***cannot*** **be:**\n\n* a picture of the box/packaging your mini came in\n* an already painted or pre-painted mini\n* a picture that makes it difficult/impossible to identify the specific mini(s) in it\n* a painted mini that you say you will prime over later\n* an already finished or painted base\n* a picture of the mini you found online\n* a 3D render\n* have your username/date/keyword edited or photoshopped in\n* something that you have already started to paint (more than what is listed in the priming section above)",
            "Dead last beginner category loser from last year here.\n\nQue Rocky montage of assembling & printing minis, lifting paints, cleaning airbrushes, & comically wiping paint across brow with paint covered hands. One year later, back, pumped, and ready for battle. Let's GO!\n\nLook forward to entering multiple categories this year instead of trying to jam them all into one over done, focus lacked mini, like I mistakenly did last year.\n\nThank you very much for putting this together and doing it again this year.  I know it must be quite an undertaking and appreciate all of the effort it takes to make this happen for us.  Happy Painting.",
            "Yeah! Can't wait to get started again, I feel these competitions really push me to get better, thanks for hosting",
            "Hey mods, just an FYI that browsing that album on mobile requires you to log in through Google. Seems to act like a sharing link that might dox email addresses.",
            "Quick question: in this context, does the mini scale >54mm refer to the physical size of the mini, or the standard scale it is built around?",
            "How are we classifying mech and other large machines like an imperial knight from 40k? Vehicle or large?",
            "Are there going to be categories like the last few years for beginners, intermediates and advanced painters? Or is it a free-for-all?",
            "Is it Ok to start painting after submitting the entry form?",
            "Dude you leveled up so much since last year! Inspiring to see.",
            ">Dead last beginner category loser from last year here.\n\n[Sir, I believe you are legally entitled to one wooden spoon for your effort.](https://en.wikipedia.org/wiki/Wooden_spoon_(award))"
        ]
    },
    "Summer 2024 Painting Competition WIP Megathread": {
        "title": "Summer 2024 Painting Competition WIP Megathread",
        "score": 5,
        "url": "https://www.reddit.com/r/minipainting/comments/1dglapt/summer_2024_painting_competition_wip_megathread/",
        "content": "This is the Feedback and WIP megathread for the Summer 20224 painting contest.\n\n---\n\nThis thread will be stickied for the duration of the contest and is a place for anyone who has entered our [Summer 2024 painting competition](https://www.reddit.com/r/minipainting/comments/1dcfgid/summer_2024_painting_competition_submissions_now/) to post their WIP images and ask for feedback and advice.   \n\n**Anyone can reply to comments to offer feedback and advice, even if they haven't entered the contest, but only people with** ***approved*** **entries will be able to make top level comments here.** \n\n(if your entry has been approved and your comment is removed, try again in a few hours or send us a message on [modmail](https://old.reddit.com/message/compose/?to=/r/minipainting).  You might just not have been added to the list yet)   \n\n---\n\nIf you are looking for help with a specific technique, or how to paint a certain material, check out our new Wiki page of [Useful Guides and Resources for Painting Miniatures](https://www.reddit.com/r/minipainting/wiki/usefullinks)!  This link can also be found in the sidebar whenever you need it, and is  a trove of resources and links to a large number of artists, videos,  and useful tools.",
        "num_comments": 8,
        "comments": [
            "WIP of Lord Felthius.\n\nhttps://preview.redd.it/6rggalszno7d1.jpeg?width=995&format=pjpg&auto=webp&s=5549bfa9c97ebd77bea45b25b3b8951baa562edd\n\nAs with all my Death Guard models, I'm not doing the boxart scheme with green armour but the Pallid Hand scheme. I haven't decided yet if I want to use acryllic or oil wash or thinned down contrast paint (Skeleton Horde) to do the shading. Also not sure yet what colors to do the smoke/slime/nurgling but tending to do them in purple and pink ...\n\nThe model is easy-to-build and both his feet were on a part with the \"tactical rock\", so I carefully clipped them off and cleaned them, to pin the model to the custom base I made. (Decided against a display plinth, kept base size to the game rules) Also added a Nurgling, like I did with all DG character models.\n\nFor the cape I want to make it look like wolf fur, will be adding some brown spots in later phase. \n\nNext will be the metallics, then washes and weathering. Lots to do but I'm having a lot of fun with the jolly two :D",
            "Getting the base down for an arachnorak (old world) spider. Thoughts?\n\nhttps://preview.redd.it/1691xp845i8d1.jpeg?width=3000&format=pjpg&auto=webp&s=b76cf00446826b37e805840650531c691208ba2b",
            "[deleted]",
            "https://preview.redd.it/peajfl3peb8d1.jpeg?width=1252&format=pjpg&auto=webp&s=ab8bd8213c5ec54207fbf75da03591979f7e4596\n\nHe's coming along, biggest things left to do are the red parts of his cloak and his beard. :D",
            "https://preview.redd.it/pmmuzwmh709d1.jpeg?width=3000&format=pjpg&auto=webp&s=0ae218a3b8691ef86670aeec6ccadc1244e165a5\n\nThe first painting session for my squad of wraithblade of Caftworld Altansar is done! Although only one started so far.\n\nReally happy with the purple. It took quite a bit of testing to get to the color just right. Next session, shading and more detailing! So far so good.",
            "https://preview.redd.it/3kp9e68mi89d1.jpeg?width=400&format=pjpg&auto=webp&s=5220d4faa458c7be4676323a79922ff51eb75e12\n\nStarted basing and getting some colors in on Trugg -- not great pics, but progress",
            "Update:\n\nhttps://preview.redd.it/p0t8nwt46h8d1.jpeg?width=1071&format=pjpg&auto=webp&s=9442eb6f7b5a3750e49eab7d133c1a33327597fc\n\nBasecoats of the metallics, shoulderpads and leather parts and working on the horns. Wash made them quite glossy, will apply ultramatte varnish later. Added some black wash and brown contrast on the wolf fur cape, next will be the fleshy parts on the borders and inside.",
            "What's your source of lighting for him? Just a general light from above, or if that's a lantern over him is it that? I ask because to me the highlights seem to read in different directions. His right (left side of the image) arm looks to be lit from the perspective of the viewer. Face maybe a bit of above, and the left arm (right side) further from that right side of the frame. \n\nDisclaimer though, I'm awful at envisioning a final product, especially that early in the painting stages, so I could be completely wrong and unhelpful, but I think that might be a little bit of the issue. I like the overall tone of the skin itself, it just doesn't quite line up if that makes sense based on the highlighting?",
            "[deleted]",
            "https://preview.redd.it/3o1vq0n6qm8d1.jpeg?width=1445&format=pjpg&auto=webp&s=2efbb932b1d0678de40f95e903eda53717734561\n\nGot a lot left to do really, but it's taking shape! :D"
        ]
    },
    "Banner Bearer of the Living City": {
        "title": "Banner Bearer of the Living City",
        "score": 318,
        "url": "https://i.redd.it/s4nvxy19md9d1.jpeg",
        "content": "Shimmer glazed from Darkroom Minis ",
        "num_comments": 7,
        "comments": [
            "The magenta and yellow combo gives it a nice atmosphere.",
            "Holy crap!",
            "Love the colors",
            "Damn good job!",
            "Wow",
            "This might be my new favorite banner",
            "Fine display of technical skill"
        ]
    },
    "Trying my mew pro acryl paints for the first time. ": {
        "title": "Trying my mew pro acryl paints for the first time. ",
        "score": 53,
        "url": "https://www.reddit.com/gallery/1dr3q70",
        "content": "Loving this paint. This has been the most fun I've had in a while. ",
        "num_comments": 7,
        "comments": [
            "that is such a sick mini",
            "That's looking really good. Nice skin.",
            "Looks great! What is the gold?",
            "What is their name?",
            "Have you used any other brands, if so how do they compare?",
            "I'd love to know too",
            "Considering you are a beginner I world recommend that paint. They are already thinner than Vallejo, Citadel, Scale… so you have to worry way less on the ‚thin your paint‘. … not having said that I do not think them. \nThey also have mostly great coverage. Mostly: all brands struggle with certain colors. \n\nThe metallics are also really great. I world recommend you buy some bottles of a color you want to paint a future project with and give them a try. Of course you can mix the ProAcryl with other acrylics."
        ]
    },
    "My Overgrown Necron Project": {
        "title": "My Overgrown Necron Project",
        "score": 375,
        "url": "https://www.reddit.com/gallery/1dqq2i8",
        "content": "",
        "num_comments": 24,
        "comments": [
            "Wow! The juxtaposition between machine and nature is a great idea! The aesthetic is really cool and if I was a player, I’d have to stop and admire them before being able to proceed. Well done!",
            "Looks awesome! How'd you do the hanging moss/vines?",
            "That’s amazing! Love this take on the necromancy!",
            "Incredible! This is so cool! I really like this! \n\n My own little CC would be damaging the blades. I feel like they should be notched or almost serrated. Emphasizes that they are really ancient machines.  \n\nKudos on this! This is really, really cool!",
            "I mean, this tracks with the Lore.  \nIf they went dormant on a verdant planet they very likely would have mosses and lichen all over themselves and being machines they likely wouldn't care unless it was impeding their movements in some way",
            "Dope",
            "I fucking love this",
            "Such an amazing idea and couldn’t be executed better!! Fantastic!",
            "So cool",
            "Wow! I love this, great work!"
        ]
    }
}