{
    "PODCAST GUEST SUGGESTIONS": {
        "title": "PODCAST GUEST SUGGESTIONS",
        "score": 44,
        "url": "https://www.reddit.com/r/Mizkif/comments/1dairdk/podcast_guest_suggestions/",
        "content": "Post your suggestions for Just Chatting guests here! I'm looking for interesting people outside of my circle. They don't have to live in Texas, but it helps!",
        "num_comments": 71,
        "comments": [
            "For just chatting guests, you should use the natural resource of stand up comedians in Austin to increase your guest pool. They'd find it attractive as they value live audience and yours interacts primarily live. Your comedic style would create good chemistry and highlight your strengths in the podcast setting. Could provide a lot of new exposure on both sides. Might not be as hard as you think, there's already overlap.",
            "Dropouts would be huge for numbers, Funny Marco, Yourrage, Jensen Ackles and Jared Padalecki, Zach Levi, James Mardsen, Willie Nelson, Jonathan Van Ness (all of these live in austin), johnnie guilbert, Sketch, Jynxzi, Moist, Rumble CEO, Kick CEO, and Dan Clancy, XqC, Michael Reeves and Lily Pichu, Cody Ko and TMG, Anthony Padilla and Smosh, h3h3 and hila, fuck it bring the botez sisters on there for numbers, Magnus Carlson, Kai and bruce at the same time would be your best podcast ever but I know you would never LMFAO",
            "another good guest that i dont think has done any long form interviews or podcasts herself is nina from UFC. does a lot of funny skits and bits for her youtube interviews with fighters. \n\nmight be a little harder to get but you met her at powerslap and would be a good bridge i think for non streamer but still understands content",
            "Tyler1 would actually be great.. kind of a I finally made it moment",
            "Moist critical would be awesome",
            "If you truly want to start moving towards guests other than streamers and want something unique, get Alinity's blessing to have her Dad on the podcast when he visits Austin soon. I'm sure he has some interesting life stories. She could translate and is always fun to have on your videos. Hell, I bet she might learn something he's never shared before.This would be something streamer adjacent sure, but your conversation likely won't be. I think it could be fun with the three of you.",
            "Try getting pro-wrestlers on the podcast. They usually always have interesting stories, are good talkers, and bring in clicks. Ricky Starks and the midget wrestlers are some suggestions.",
            "non online personalities, people working in interesting fields or on interesting projects, talking about work, passion, struggles etc",
            "Angel Youngs is in Austin",
            "In the future, when you will invite non content creators : a monk or someone who experienced something crazy (like survive a big accident). \n\nInteresting people who can share their insights and experience about life."
        ]
    },
    "I found Matthew from the new York stream in an old Extra emily vod": {
        "title": "I found Matthew from the new York stream in an old Extra emily vod",
        "score": 80,
        "url": "https://i.redd.it/7a1edj3bh59d1.jpeg",
        "content": "I was watching Emily's old 24 hour new York vod and I found Matthew from the recent new York stream. I swear it's him. Lol ",
        "num_comments": 3,
        "comments": [
            "He is either a very well thought out individual who enjoys expressing his thoughts and ideas to others or he's a master troll.",
            "Hes a SpaceTime traveler!\n\n![gif](giphy|1QfiAtGHd1CS4HzaiU)",
            "thats crazy"
        ]
    },
    "Who was better looking at 29, Miz or Biden?": {
        "title": "Who was better looking at 29, Miz or Biden?",
        "score": 0,
        "url": "https://www.tiktok.com/t/ZPREU6SUo/",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Bald"
        ]
    },
    "Miz's hair transplant did wonders": {
        "title": "Miz's hair transplant did wonders",
        "score": 31,
        "url": "https://v.redd.it/4ofbfqzya59d1",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Luma is terrifying"
        ]
    },
    "\"Mannn this ain't sh-\"": {
        "title": "\"Mannn this ain't sh-\"",
        "score": 44,
        "url": "https://i.redd.it/77tdjiagdy8d1.jpeg",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}