{
    "June 26th Patch Notes: Season 4 Reloaded, Weapon Balance, and more": {
        "title": "June 26th Patch Notes: Season 4 Reloaded, Weapon Balance, and more",
        "score": 96,
        "url": "https://www.callofduty.com/patchnotes/2024/05/call-of-duty-modern-warfare-iii-season-4-patch-notes",
        "content": "",
        "num_comments": 245,
        "comments": [
            "*Damage is no longer dealt to the Killstreak owner near a drone explosion.*\n\nFucking finally, I swear the Mosquito has gotten me more suicides than kills",
            "TY for the Carrak Buff",
            ">Fixed an issue causing Muzzle Attachment to unequip in gameplay.\n\nhere we go again",
            "Please let us opt out of the DNA event. Im tired, boss.",
            "This is like a slap on the wrist for the Kar.",
            "Controller KAR users about to go on suicide watch after the AA nerf on it ",
            "Kar98 controller users about to realise they arent built for this ",
            "Yay for new ARs in Ranked Play!! The MTZ IS MY BABY",
            "can we get an mw2 weapon balance pass i BEG i want to enjoy these guns again PLEASE",
            "Everyone about to find out the aim assist isnt the reason the kar is so good"
        ]
    },
    "June 26th Playlist Update: Mutation, Bit Party, Incline 24/7, Shoot House in Small Map Mosh Pit, and more": {
        "title": "June 26th Playlist Update: Mutation, Bit Party, Incline 24/7, Shoot House in Small Map Mosh Pit, and more",
        "score": 30,
        "url": "https://x.com/SHGames/status/1806010652588396848",
        "content": "",
        "num_comments": 37,
        "comments": [
            "THANK YOU for finally adding some new loadouts to gunfight.  \nIt instantly feels so much more fresh now.",
            "Mutation is fun. Its like having a fight in the upside down",
            "They still havent fixed find a party or the new chat disabled bug.",
            "Mutation is glitched for me. Can't play it without it tripping balls and going into a slideshow. Have to quit the game every time.",
            "RIP to Cache\nIt was fun while it lasted",
            "Please remove uav pings from infected \nu/SledgehammerGames",
            "No 8 Bit Party for HC right SHG?   And No Altered Strain for HC either?  How can you run an Event with rewards and NOT offer it for ALL player bases?  And you want us to buy that operator pack for 8 Bit right?  Yeah good luck with that!",
            "Ugh please stop taking One in the Chamber out or at least add it to the Quick Play selection",
            "Never mind. Finally got the link to load. I guess DNA cant be collected through HC. How dumb.",
            "Man, Shoothouse just look so good. I love how they remake the look of this map.\n\nOne of the best looking map and one of the best \"feel\" for me in Call of Duty."
        ]
    },
    "The wsp swarm is so much fun to use.": {
        "title": "The wsp swarm is so much fun to use.",
        "score": 76,
        "url": "https://v.redd.it/6etda4zw0g9d1",
        "content": "",
        "num_comments": 129,
        "comments": [
            "OP shoots 100 bullets and only kills 2 people and these dumbasses in the comments think he's aimbotting.",
            "People will see simple flicks and think aimbot. Good shots I recently started using the WSP swarm more especially in warzone its such a fun gun.",
            "This sub is full of absolute dumbasses \n\nLike imagine watching this NORMAL CLIP and saying theyre hacking ",
            "Comments full of controller players who have never seen a mouse flick saying \"sus\", all while the game does 60% of their tracking.... Fuck man.",
            "I could be remembering completely wrong but wasn't this one of the best SMG's to use and still one of the better close to med range ones?\n\nFuckin love pissing people off with the 100 round drum",
            "If you think this is aimbot then maybe I should show you me doing this, only on HC. ",
            "Unless your on PC, you can't see what you're sitting at with that muzzle flash",
            "honest to god: this is the #2 best SMG in the game at least",
            "how did you snap on the guy on the roof that quickk",
            "You can tell some folk here have never seen mouse flicks before.\n\nDudes not cheating at all. "
        ]
    },
    "Here is what my friend's cod loks like on his 10 year old xbox": {
        "title": "Here is what my friend's cod loks like on his 10 year old xbox",
        "score": 248,
        "url": "https://v.redd.it/mqd7nhvaod9d1",
        "content": "This is what he sees, sound and frames and everything",
        "num_comments": 85,
        "comments": [
            "Crazy, because after the most recent patch this is also what it looks like on my high end PC I just upgraded six months ago ",
            "This is pretty much exactly what the game looks like for me since launch. Packet Burst is a wonderful thing.",
            "They really gonna continue making these games for last gen so mfs could play like this",
            "Yeah I've been playing this game using Xbox one X and while there have been some lag spikes or packet bursts, this update just cranks all that to 100%. There may be that one match where it goes fine, but halfway into the game, it just shits to bed. I honestly don't know if this is a last gen issue or if this update just broke everything.",
            "Yeah - Thats not bad compared to my gameplay since the S4 reloaded update broke the game for me.  Its 100% unplayable.  Not seeing anything from SHG specifically addressing this even though people keep calling it out here and on X directly to SHG",
            "idk when i started but i've had crazy packet loss in almost all my warzone resurgence games, it's like every other game is unplayable",
            "And BO6 is gonna be on old gen consoles once again...",
            "Looks exactly the same on my setup running 7800x3D and 4080s ",
            "Thats how it looks for everybody LMAO",
            "Are you feeling it now, mr krabs? (The sales money that wasn't lost by not releasing on ps4/xbox1)"
        ]
    },
    "I'm 100% that guy, and I'm having the time of my life. ": {
        "title": "I'm 100% that guy, and I'm having the time of my life. ",
        "score": 12,
        "url": "https://v.redd.it/zh22dhju8i9d1",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Be the gaymer you want to be",
            "Damn what a edgy boy you are",
            "Had to celebrate the month before it was over.",
            "Is the gay infused with the rocket's propulsion? What about the head?",
            "RPG?...no it's the all new\n\n- GAY\n\n- PROPELLED\n\n- GRENADE",
            "It's still the RPG... just stands for \n\n> RAINBOW \n\n> PROPELLED\n\n> GAY-NADE",
            "Obligatory **\"HA! GAYYYYYYYYYYYYYYYYY!!!!!!\"**",
            ""
        ]
    }
}