{
    "Black Ops 6 - Gameplay Reveal Trailer": {
        "title": "Black Ops 6 - Gameplay Reveal Trailer",
        "score": 10,
        "url": "https://www.youtube.com/watch?v=oyZY_BiTmd8",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "June 12th Playlist Update: Cache & 10v10 Mosh Pit": {
        "title": "June 12th Playlist Update: Cache & 10v10 Mosh Pit",
        "score": 28,
        "url": "https://v.redd.it/0vqck274a66d1",
        "content": "",
        "num_comments": 54,
        "comments": [
            "[Comment](https://reddit.com/r/ModernWarfareIII/comments/1debr25/june_12th_playlist_update_cache_10v10_mosh_pit/l8cjrdo/?context=5) by [u\\/SledgehammerGames](https://reddit.com/user/SledgehammerGames) (Sledgehammer)\n\n> Additionally, Demolition has moved to the Quick Play filter!",
            "Additionally, Demolition has moved to the Quick Play filter!",
            "Solid move getting rid of 12v12 and bringing all the maps back to 10v10. Could've just added the maps to 12v12 though.",
            "Like the changes they made to infected, lots of weapon diversity instead of just shotgun+pistol",
            "Why did you take out Demolition? It’s not even in quick play filter. Y’all advertised it as a new game mode and it’s only available for 2 weeks? Please add it back\n\nThank you for adding it back",
            "I can't believe they decided to remove demolition f#&#®",
            "Can we please have a bit of chaos and have 10v10 in hardcore please :)",
            "We need shoothouse into small maps please!!",
            "Could we get Favela in 10v10?",
            "Will we ever get the newer maps added to Cutthroat? They're playable offline but never put into the live playlist. Still missing Grime, Tanked, Paris, etc."
        ]
    },
    "I just got folded by a fucking e-girl": {
        "title": "I just got folded by a fucking e-girl",
        "score": 430,
        "url": "https://v.redd.it/rhlypu1a208d1",
        "content": "",
        "num_comments": 91,
        "comments": [
            "This is the fallout when you drop soap",
            "Fallout skins look so bland lmao",
            "Have you tried investing into your strength or perception special stats?",
            "Ain't that a kick in the head",
            "Impressed this post got so many up votes.",
            "Tunnel Snakes represent!",
            "Some people pay good money for that. You got it for free.\n\nConsider yourself lucky.\n\nThat punch finisher comes from the \"Koa King Warrior Pack\" skin. I got it.",
            "pressing F rn",
            "It’s cause you bought the fallout skins",
            "Probably not an egirl"
        ]
    },
    "Haha gun go brrrr": {
        "title": "Haha gun go brrrr",
        "score": 128,
        "url": "https://v.redd.it/lro1menea08d1",
        "content": "",
        "num_comments": 24,
        "comments": [
            "I like how you just kept firing lol\n\nProbably saved yourself from being k98'd",
            "I mean…. This is how you fight with a 200 rounder… I’ve been doing this since forever… no one expects you to still be firing so they poke out.",
            "Chad LMG enjoyer",
            "Fun gun, great for the slower game modes, I do wish the last event skin for it worked with the aftermarket conversion",
            "I miss the ares scope being on this gun, but they took it off with no note in the patch other than just ripping it off when you go in game. Thanks for ruining everything cod",
            "He has really good aim, I couldn’t even see the guys on the screen.",
            "How an lmg should be used",
            "Omg lol",
            "I haven’t played for months but this map looks so awesome",
            "i would not like if this happened to me and would be very mad so.. w gameplay?"
        ]
    },
    "Your shield is no match for physics! ": {
        "title": "Your shield is no match for physics! ",
        "score": 48,
        "url": "https://v.redd.it/d7ecaj9jt18d1",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Actually pretty cool. Good throw my dude",
            "My luck the knife would have bounced back straight at me somehow",
            "Nice one! I'd jumped and cut him from above, mid jump. If you learn to time it right they only get max one hit with the shield.",
            "That’s because you don’t buy enough bundles 😂"
        ]
    }
}