{
    "Regarding subreddit mod team changes and the future of r/Money": {
        "title": "Regarding subreddit mod team changes and the future of r/Money",
        "score": 38,
        "url": "https://www.reddit.com/r/Money/comments/1boiwa9/regarding_subreddit_mod_team_changes_and_the/",
        "content": "**Hello there.**\n\nYou might've noticed the subreddit's mod list has changed a few times over the last three months, and we'd like to inform you as to why along with our vision for the future of the community.\n\nTo start off, my name is Asher, and I along with the other current moderators on the team have been involved in community management for several years, and are going to be handling mod operations on r/Money moving forward.\n\nWhile we're still investigating the cause, the previous two mod teams were removed for a combination of being inactive (why you were seeing so many low effort/quality posts the last few weeks) and violating **Reddit's** [**Moderator Code of Conduct**](https://www.redditinc.com/policies/moderator-code-of-conduct), specifically the part regarding **moderating with integrity (R5)**.\n\nAs of this moment, we are working on implementing new ways to ensure transparency in the actions we take to uphold civility and focus on the subreddits central topic, money. This will be done to reduce the risk of anything similar to the previously mentioned behaviors taking place by any individual member on the team in the future. The goal of this subreddit is and has always been to foster a community focused on the discussion of anything related to money and financial moves, and bad actors taking advantage of positions of power impacts everyone involved negatively.\n\nOver the next few days, there will be more changes to the subreddit (formatting, rules and guidelines, and the creation of subreddit-specific wiki pages) to further encourage positive/conducive user activity.\n\nIf you have any further questions, comments, suggestions, or concerns, feel free to forward them to us directly via Reddit [modmail](https://www.reddit.com/message/compose?to=%2Fr%2FMoney).\n\nThank you for being a part of our community, and best regards,\n\nu/AsherFennec, u/ARoyaleWithCheese, u/ddftgr2a, u/lmaodaniel, u/Randomperson0012, u/strikingsubsidy27, u/sled603, and u/f0rkster",
        "num_comments": 44,
        "comments": [
            "Honestly, from *most* of us here who want legitimate posts, thank you! This place was becoming flooded with nonsensical stuff, and I was considering unfollowing.",
            "Glad to be a part of the team!",
            "Will do my best ",
            "Very much necessary. Thanks.\nIm sure you have a good overview of what has to be done, Id just like to mention that with these current trends in here I have to assume every post that refers in any way to a specific company is fake and misleading advertisement, and I think they should be handled a lot more strictly.",
            "Thanks for all you guys do! Happy to help if needed.",
            "Thank you so much and I wish you the best. Moderation isn't an easy or simple undertaking and this group can have great value to many.",
            "ok",
            "[deleted]",
            "[deleted]",
            "[removed]"
        ]
    },
    "Hit 400k NW a month before turning 30": {
        "title": "Hit 400k NW a month before turning 30",
        "score": 39,
        "url": "https://i.redd.it/4amwsmjyvh9d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Huge disparity between Banking and Investments. What do you do full time and what's your investments story?",
            "What is the benefit of holding a cc balance to lower your credit score?",
            "What program you using in your picture?",
            "Don't, whatever you do, go over to r/fatFIRE",
            "Awesome work! Def something to be proud about.",
            "You really dont need much more than a safety fund in the bank unless youre saving for something like a house or car. \n\nEverything else should be invested so it grows.",
            "About 30k of the investments is in an external HYSA, everything else invested in a betterment robo adviser. I career transitioned into being a software developer when I was 24, been maxing out my 401k for about 6 years since and upping my savings rate as Ive gotten promoted. I did get a big 75k boost a few years ago though when my company was acquired and the RSUs converted.",
            "Thatll be paid off by the end of the month, my wedding is in 2 weeks so Im waiting for all the charges to hit so I can vanquish them in one mighty payment ",
            "Thats Bank of America, I use monarch money for tracking (RIP Mint), this just had the easiest screenshot",
            "Prenup might be irrelevant \nIf youve hit those assets by 30, youll likely eclipse that with martial assets quickly"
        ]
    },
    "Money is no object, what's a reasonable, everyday car to buy? ": {
        "title": "Money is no object, what's a reasonable, everyday car to buy? ",
        "score": 174,
        "url": "https://www.reddit.com/r/Money/comments/1dqvzkv/money_is_no_object_whats_a_reasonable_everyday/",
        "content": "Assuming cost doesn't matter, what's a good, practical car to buy? I'm thinking something nice with all the bells and whistles but doesn't draw too much attention like a corvette or Lamborghini or something. ",
        "num_comments": 645,
        "comments": [
            "The answer to every money is no object transportation question is ALWAYS the A-10 Warthog",
            "Any Lexus fits this description. Reliable, luxurious and not too flashy.",
            "If money is no object, get a Rolls Royce Phantom and get driven around.",
            "I own a used Prius and spend barely anything on gas",
            "Not a day has gone by the past 11 years where I was unhappy with my Mazda 3.",
            "Honda accord. You can get some nice packages. Acura is also very nice, lots of options there too",
            "Bentayga (the Bentley SUV). Very unassuming but very luxurious. My dream car",
            "Honda Civic. Toyota Corolla. Solid, long lasting, predictable, reliable, not flashy, maintenance and repairs not crazy expensive (European imports etc have that stereotype).",
            "My semi reasonable dream garage is a M3 along with a TRD pro 4runner.",
            "The new Toyota Camrys are nice and they have fully loaded options"
        ]
    },
    "$10,000 in one month": {
        "title": "$10,000 in one month",
        "score": 94,
        "url": "https://www.reddit.com/r/Money/comments/1dqx7on/10000_in_one_month/",
        "content": "(21F) \nI have until August 1 to make $6-10,000. How do I do it?\n\nI have no other commitments, so every hour I'm not sleeping I'm willing to dedicate to this. \n\nAny suggestions or advice would be very much appreciated. ",
        "num_comments": 196,
        "comments": [
            "Let me know if you figure it out because Id love to make $10k a month ($120k a year) when I was 21. \n\nSeriously though, it probably aint going to happen. People that are skilled in a discipline dont make that much.",
            "OP baiting thirsty DMs for sure",
            "Yolo $SPY $550 call options 0 dte",
            "Carl did this on *Shameless* by abducting addicts, sobering them up by chaining them down in the basement, and then ransoming them back to their families",
            "What's the money for? If it's for a trip/concert/whatever - suck it up and learn from this to better save and prepare. Skip this one and start saving for the next.\n\nAnything life threatening will just bill you after the fact so... Feels unlikely...",
            "10k is probably not going to happen. Selling possessions, asking parents for money, a sugar daddy arrangement is all that really comes to mind. \n\n6k is a lot more realistic, You could probably make that waiting tables and ubering on the side.",
            "Damn\n\nGonna be alotta dick to suck unless you go to Dubai and get shitted on",
            "Uber eat/ door dash every weekend, stripper. Sugar daddy. Hit the small lotto. Work unlimited overtime at your current job. Sale everything you own. Sale your car.",
            "I mean 4 people a day for $100 each. Would get you 6k in 15 days. 25 days would get you 10",
            "A month?????? Is selling your soul an option lol"
        ]
    },
    "How much money would you need to have to not work anymore? Numbers please.": {
        "title": "How much money would you need to have to not work anymore? Numbers please.",
        "score": 184,
        "url": "https://www.reddit.com/r/Money/comments/1dqovmd/how_much_money_would_you_need_to_have_to_not_work/",
        "content": "Some people make millions, some billions, but they keep working. How  much would YOU need to stop for good?",
        "num_comments": 902,
        "comments": [
            "I'm 41. If I hit $2M, I'm calling it quits.",
            "3.8M is my number in 2050 dollars depending assuming 3% inflation.",
            "Assuming 5 millions after taxes... so 10 million dollar to retire..... Since at 5 millions you would get 250k/year for doing nothing.... not many jobs can pay you that much... plus then you can do whatever you want essentially.... I can't imagine spending 20-25k/month....",
            "I'm at 1.3 mil and am resting as soon as I pay for my kids colleges in a couple years.",
            "A million networth. With a $400k house and a $600k portfolio one could live comfortably off investments. Of course, I'd keep working, but doing what I want to do how I want to do it.",
            "Im 25 years old10 million im set for life",
            "Due to the uncertainty of future medical costs, the state of the economy, the costs of goods and services; I'd say about 5 million.",
            "25-30x in todays dollars what you want to live off of pre-tax - assuming youre retiring prior to SSA. $1m is possible - more comfortable is $2.5m - to retire sooner/fatter its $5m.",
            "Crazy high numbers. $3m at 50 gives you a decent lifestyle with no work.",
            "2.4 million USD. I could comfortably retire and be in a good spot for the rest of my life. Would I be rich? No. Would I have everything I need and have a fulfilling life? Yes."
        ]
    }
}