{
    "Official /r/Monitors purchasing advice discussion thread": {
        "title": "Official /r/Monitors purchasing advice discussion thread",
        "score": 9,
        "url": "https://docs.google.com/document/d/1illeNLsUfZ4KuJ9cIWKwTDUEXUVpplhUYHAiom-FaDo/edit",
        "content": "",
        "num_comments": 17,
        "comments": [
            "LG 27GR95UM vs OLED/QD-OLED\n\nI'm pretty stuck between the LG ips mini-led monitor and an oled monitor. I use my pc a lot for work and will have it on for hours on end which why I'd just prefer not getting an oled. I've heard some very good things but also some very bad things about this monitor but there are just very few reviews on it so I'm hoping someone can give me some more insight on it. Thx!",
            "What's a good 4k 60hz office monitor for under 300 cad?",
            "Calling it a fact sheet is very misleading btw. For example not stating OLED negatives, such as excessive ABL which makes certain content completely unwatchable. Or OLED having \"class leading HDR performance\" is also not true, since it cannot output enough brightness for actual full screen HDR. And let us please not forget black crush in the 2-5% near black area.",
            "Just buy OLED. GG ez",
            "I'd go with the IPS monitor. OLEDs looks amazing, but static images on OLED screens is a recipe for disaster.",
            "I would never buy an OLED again ez.",
            "I'm stuck between the TCL 34R83Q or waiting for the Acer predator x34 v3 (mini led). Both are 21:9 1440p 34 inch miniled monitors, which is ideally what I'm looking for!",
            "The predator one seems to be well reviewed. Try comparing the panels they both use.",
            "I know 1600p ultrawide is kind of niche upon niche - what's the going pick?\n\n* 3840x1600 12:5 (21.6:9?)\n* 34\"\n* 120hz VRR",
            "    Budget: equivalent of 300$\n    \n    Prospective Resolution (3840x2160, etc.): 2560x1440\n    \n    Size (27 inches, etc.): 27 inches\n    \n    Aspect Ratio (16:9, etc.): 16 : 9\n    \n    Adaptive Sync (GSync, FreeSync, or None): G Sync compatible\n    \n    (Optional) Usage Type (gaming, art, etc.): mainly for gaming on PC, sometimes in the future also adding a PS5 to it, but not as the main device. \n    \n    Was thinking of: G2724D or VG27AQ3A."
        ]
    },
    "Zowie XL2566K Review ": {
        "title": "Zowie XL2566K Review ",
        "score": 4,
        "url": "https://www.reddit.com/r/Monitors/comments/1dqjq1j/zowie_xl2566k_review/",
        "content": "\n\n\nSo as for some context I ordered my Zowie on the 20th of June. If you order from Zowie personally you’ll most likely receive it within 5-7 days for FedEx ground shipping. But I think I would recommend ordering from Amazon if you have Prime especially since it will get there quicker and the packaging is better. Mine came in and it was a bit damaged and the seal was already cut. Now note everything was there the things inside were clean, secure, and work great.\n\nNow here’s my review;\n\nI originally come from using a 27” 165hz monitor from ASUS. It worked well for most games and had that refresh rate I needed. But I recently got more into competitive games such as Valorant or CS2 if I’m bored. So I started to save and once I got the $600 I ordered it. Day it comes in I’m jumping up and down, setup my new area plug everything in.\n\nSide panels: The monitor comes with attachable and detachable panels on both sides. Now I think there light or glare protection but I have my curtains closed and my PC blocks the screen from any sun. \n\nS Switch: Okay I didn’t think it was anything crazy at first but oh man that thing beats having to use then mini scroll behind the monitor. \n\nStand: The stand is really customizable and Im able to know where I last had it because there’s a notch that can be used to mark where you had it. It’s really personalized \n\nThe monitor and the performance alone: When I used my dad’s 240hz it was smooth but when I went home I got acclimated to my monitor again. So being able to play on this 360hz monitor was great. The amount of contrast that can be customized is impeccable. For a TN panel at first it’s horrible but get maybe Tenz (Pro Valorant Player) monitor settings (and NVIDIA control panel color vibrance if you have a NVIDIA GPU) it looks just like my 27” and not only that but brighter. I will say 24.5”-25” seems small but when it’s close to you on a desk it’s really not that bad. \n\nAccessories: The monitor comes with its HDMI and Display Port (DP) cable and the power but also a tarp like cover to prevent and damage for travel or just in general. I’m leaving for a month so to prevent dust I put that baby on and I’ll be set. I will say it does run hot but it’s not a phone haha.\n\n\nAnyway this is my review hope this helps comment any questions I’ll try and answer.",
        "num_comments": 6,
        "comments": [
            "You said you took Tenz settings, but as far as I know this only modifies the overdrive setting. Did you try playing with BFI (DyAC+) enabled by any chance? If so, can you feel the difference?",
            "You guys can afford a $600+ TN 24 Inch, but think any OLED is still too expensive. Brother",
            "Dyac makes a huge difference for me.",
            "Loved this monitor for val and cs, but for had huge issues with the colors in other games.\n\nCouldn't see players in shadows in COD and battlefield. \n\nFinal straw was having issues playing Tekken on it. Thought a game like that wouldn't be impacted, but on some maps the red background would merge in with the red character, and couldn't break grabs. \n\nEven playing a casual game like helldivers with my friends was not that fun when everything just blends in together.\n\nGave up on it and got a different monitor."
        ]
    },
    "LG 32GS95UE Review [LG UltraGear x r/Monitors Giveaway winner]": {
        "title": "LG 32GS95UE Review [LG UltraGear x r/Monitors Giveaway winner]",
        "score": 24,
        "url": "https://www.reddit.com/gallery/1dpurhc",
        "content": "I’m one of the lucky winners of the r/monitors x LG UltraGear x Monitors Giveaway contest. These are my first impressions of the LG 32GS95UE after using it for two weeks. I know some of you might think I’m biased, but I can assure you LG had no influence on what I say. I might be biased because the LG is the only monitor I’ve had the chance to really test and see in person.\nI'm an art director in the TV/online design/animation industry, and I was looking for a new monitor for my home office that I could also use for gaming. The main question I had when these new WOLED/QD-OLED panels were released was: Are OLED gaming monitors finally viable for productivity work? So, I watched every review and read every article not just about the LG but also about the other new QD-OLED panels. This was also the time I stumbled upon the giveaway contest and, I guess, I got lucky.\nHere’s my conclusion after doing my research and using the LG for two weeks: Are they viable? Absolutely! The LG is one of the best OLED gaming monitors money can buy right now, but is it THE BEST monitor? Not necessarily. There isn’t a single “best” monitor on the market. Whether you buy a WOLED or a QD-OLED, they’re all great, but each has its own strengths and flaws, and which monitor is the best depends on your specific use case.\nQD-OLEDs have better HDR performance and more vivid colors, but only in a light-controlled environment. If you plan on using it mostly in the evening or with your shades down, QD-OLED might be perfect for you. In a brighter environment, however, the blacks turn into a dark purple. Since 80% of my monitor use is during the day in a super bright room, I’m willing to sacrifice a bit of those vivid colors to keep the inky blacks the LG offers.\nWhen it comes to gaming, I love story-based AAA games with great graphics, but I’m also a sweaty FPS nerd. The 480Hz Dual Mode is just perfect for me. Sure, Full HD on a 32” screen doesn’t look great, but the smoothness and responsiveness of 480Hz is incredible. It’s so much fun playing this way that I completely forget about the resolution. And then you switch back to 4K 240Hz, and the image looks amazing again. It almost feels like two monitors combined into one.\nThis is why I might be biased: it feels like this monitor was designed for my specific use case. It checks so many of my boxes that it’s almost the perfect fit for me.\nI’ve written a more detailed review below, and I hope it helps you in your decision. However, I highly advise you to do your own research, figure out which features you need the most, decide where you’re willing to make some sacrifices, and I’m sure you’ll find the perfect monitor for you.",
        "num_comments": 13,
        "comments": [
            "What windows scaling percentage are you using? I love the picture quality in game with this monitor but I find the desktop experience strange. Some UI elements are blurry, others are sharp, etc.",
            "The picture is not great. The anti glare coating really ruin the picture quality :/",
            "Are you on windows or mac? I dont really use windows, I only boot it up and launch games. I havent really seen anything strange. The text comparison photo was taken on windows with 100% scaling. I also tested 125% and 150%which looked even better.",
            "Are you using a \"weird\" scaling percentage like 125%? If so that's why--Windows can only handle scaling in 50% increments.",
            "Have you seen the monitor in person?",
            "Windows. Its not really the monitors fault though, its just the way Windows is. MacOS definitely handles this stuff better.",
            "Yeah, I would say the brightness is more than sufficient, but I needed to adjust for a day or two. The things is, when you turn up the brightness on IPS, everything gets brighter, including the blacks and the dark areas. On the Oled, the blacks stay black and the contrast is much higher, so It felt darker on the first days because I wasnt used to it.",
            "Yeah, had absolute no issues on mac so far, except that HDR-Implementation on mac is even worse than windows. In windows you have the hdr cailbration tool at leaston mac you have nothing",
            " \nDesign:\nIn my opinion, it's the best-looking model among the new 4K/240Hz OLEDs. I really love that the display has no branding on the front. No bezel, no logojust an edge-to-edge screen. I wish more companies would follow this example. \n\nCompared to other models, the stand and the backside are simple as well. It has the obligatory LED strips, but nothing too tacky or flashy. And if youre wondering, the LED strips are too weak to act as ambient lighting; theyre just for decoration.\n\nThe stand feels sturdy and robust and doesnt take up too much space on a desk. Big plus: it doesnt project a Star Trek logo on your table.\nIt's easy to tilt and swivel and stays in position when you adjust the viewing angle. You can also pivot the screen, which makes it easy to connect cables or use it in vertical mode.\n\nConnectivity:\nThe Display comes with 1x DP 1.4 Port and 2x HDMI 2.1 ports. Not having a DPalt/USB-C port is a little bit disappointing, especially in this price range. \n\nSpeakers (Pixel-Sound):\nWhen it comes to built-in monitor speakers, my expectations were really low. But I must admit, I was quite impressed by the LG. \nThe sound is crisp, the mid tones are clear, and theres even a bit of bass. \nThe only downside is that the highs are a bit too sharp, especially when you turn up the volume. \n\nOf course, the built-in speakers cant fully replace good external ones, but if you want to take off your headphones now and then to watch a YouTube video or have a casual gaming session, theyre great and a really nice addition.\n\nFan:\nThe LG 32GS95UE has an integrated fan to cool the OLED panel. I think the noise level really depends on the unit you receive. I heard mixed opinions from other users before getting mine. For some, the fan was completely inaudible; others found the noise annoying or even returned it because the fan was so loud.\nPersonally, if I really try to hear it in a completely silent room, I can hear the fan. It's definitely audible. \nI'm really sensitive to this kind of noise and it could easily be a dealbreaker for me, but honestly, I cant hear it when Im sitting in front of it and working. Its a really soft humming noise that just blends into the environment. \n\nIve asked LG about it and will let you know what they say.",
            "> Productivity/SDR Use: I mainly use this monitor during the day, sitting right next to a huge window. So, the coating and brightness are a big deal for me.\n\nSo if the brightness sufficient for your design/production work, during the day? Do you find yourself, while working, wishing you could up the brightness level?\n\n(Thanks for the review, by the way)"
        ]
    },
    "Dont buy a monitor from Emmas market on Amazon": {
        "title": "Dont buy a monitor from Emmas market on Amazon",
        "score": 10,
        "url": "https://www.reddit.com/r/Monitors/comments/1dpwexp/dont_buy_a_monitor_from_emmas_market_on_amazon/",
        "content": " purchased a LG32GP750-B monitor from Emmas market on amazon and received a 32GN63T-B instead which is about $100 less and a different type of monitor. The packaged arrived in a really damaged state and appeared as though it had been opened and resealed several times. I looked at the sellers reviews and saw that many other customers were also receiving the wrong items with some of them recently ordering the same monitor as me and receiving the same wrong one. I took a couple pictures of the box and returned it to the seller. They claimed it had a different serial number and only refunded $20 of the $328 I paid.\n\nWhat can I do here? If many other customers left reviews having the same experience then its pretty clearly the sellers fault. Clearly I'm not scamming them because why would I ship them a $200 monitor for $20? Ive never had an experience like this on amazon before and I really cant afford to have $300 stolen from me right now.\n\nI don't want this to happen to anyone else.",
        "num_comments": 4,
        "comments": [
            "Always research the seller on Amazon. There are plenty of scammers on there. You're gonna have to keep pestering Amazon customer service until the take care of you. If you have recourse through your bank or credit card, you may have to go that route at some point. Don't give up.",
            "The chargeback route is usually the least hassle. Give Amazon a chance to try to resolve it. If they say tough luck or give them the run-around then it's time to call the bank",
            "Depending how they paid they may have success with that route, but I know some institutions can be difficult to work with. Amazon can be a PITA, but I'm sure their bank would need to see that they tried. Bezos has taken care of me before when some shady shit went down, albeit the transactions were smaller, and I had to make multiple calls and talk to supervisors etc. I hope they can get their money back either way."
        ]
    },
    "\"Backlight Strobing / Black Frame Insertion\" With Low FPS": {
        "title": "\"Backlight Strobing / Black Frame Insertion\" With Low FPS",
        "score": 3,
        "url": "https://www.reddit.com/r/Monitors/comments/1dpm8c8/backlight_strobing_black_frame_insertion_with_low/",
        "content": "Does BFI not work well if FPS and screen HZ aren't synced? \n\nI've heard contradictions and can't really get my head around the nuances.\n\n*My use-case: Running game at stable 180 FPS cap with ULMB 2 (screen at 540 hz). Can't see flicker* ",
        "num_comments": 2,
        "comments": [
            "This is complicated but i'll try to explain it, simply:\n\nFlicker is a non-issue, you should instead be looking at double images and stuff. Artifacts and stuff.\n\nNormally, BFI only works using a static refresh rate. Some monitors have a dynamic version, and ULMB2 is such a thing.\n\nThat's the main difference: You are able to use VRR with ULMB2 while a \"normal\" monitor would require you to disable VRR to use it.\n\nThe purpose of BFI is to reduce motion blur. But having a higher refresh rate also reduces motion blur.\n\nTherefore, it's more effective at a higher, static refresh rate. And a high framerate as well.\n\nIn simple terms, running ULMB2 + VRR at 180 fps is equivalent to a normal BFI running at 180 hz static refresh rate. I.E In this specific scenario, the dynamic nature of the BFI is in fact gimping your monitor: It'll be \"smoother\" feeling due to the VRR, but you're not getting the full benefit of BFI.\n\nThe main use case for strobing or BFI is when you can run a game close to your maximum refresh rate: Graphically low-end competitive titles such as CS for example.\n\nTLDR: You probably should be running at a 540 fps cap and disabling VRR while playing graphically not very intensive competitive games. For other games, where you can't achieve such high framerates, i'd use VRR with it.\n\nThere is also some advantage of running a monitor at a static 540 hz even if you can't run a game at that rate: It'll have much less input lag. It might not feel particularly smooth, but it'll be very responsive.\n\n/E: Misread a bit, so you are in fact running it with a static refresh rate: Well, while that's great for latency, it actually means your BFI is working at a rate of 540 hz while the game is running at \\~180 fps. This means it'll probably have noticeable double-images.\n\nIf you CAN'T achieve anything close to your maximum refresh rate in frame rate, i'd recommend using VRR with it. This is the advantage of ULMB: You can.\n\nBFI is most optimal when framerate, refresh rate and the rate of BFI are ALL matching: And indeed, better when all of these things are as high as possible."
        ]
    }
}