{
    "Join our discord dedicated to Monster Hunter Wilds and World": {
        "title": "Join our discord dedicated to Monster Hunter Wilds and World",
        "score": 52,
        "url": "https://discord.gg/vUZY9RdZ9a",
        "content": "",
        "num_comments": 17,
        "comments": [
            "may the fourth be with you!",
            "may the fourth be with you!",
            "may the fourth be with you!",
            "may the fourth be with you!",
            "May the forth be with you!!",
            "may the fourth be with you!",
            "    A scene from a Chinese or Asian movie: A monster is coming from the sea, and the armies of the empire are preparing to hunt it. It pulls the chain that they are trying to hunt, so it pulls animals into the sea and destroys the arsenal.plz can u help to find this movies",
            "may the fourth be with you!",
            "may the fourth be with you!",
            "May the forth be with you!"
        ]
    },
    "What in the actual fu-": {
        "title": "What in the actual fu-",
        "score": 1798,
        "url": "https://i.redd.it/hncgv4mp7b9d1.png",
        "content": "Okay This is by far the worse fight I've ever done, literally took me 45 minutes to beat his ass, bro those jagras were cancer\n\nCool concept for a crossover, but it's clear Witcher is not compatible for monster hunter 💀",
        "num_comments": 142,
        "comments": [
            "The fact that this guy has more hp than fatalis and its still in the HR days",
            "Isnt the fight meant for multiplayer (correct me if im wrong)",
            "Yeah the hp scaling is multiplayer only ",
            "Yeah it has 50k hp.",
            "yah dude. F\\*ck this guy, i even tried to kill him while keeping the stupid pukei pukei alive, bc im also stupid like that., even his follow up quest to upgrade the sword is a pain,, i had mr gear and it's still torture,",
            "A cheater entered my SOS, max para weapon. Still took us like 30 minutes. Not even garanteed quest reward.",
            "Honestly Witcher would be compatible with Monster Hunter if they made the fight better. Witchers also have tons of tools like traps, throwing daggers etc, so Leshen being immune to most of our hunting strategies is kinda bs. Why do flash bombs work, but traps don't ?",
            "You know what's funny. I'm a fucking great sword user but I force myself to killed this groot with sns and manage to keep pukei alive just to get the only Attack Jewel Lv1 at that moment. I never beat it solo with gs until I got Fatalist armor sets and my performance still sucks. This collab is the worst thing in my opinion.",
            "Easily the worst fight in world. Developers didn't think much when creating this fight",
            "Aahh yes, that effing guy. I never even bothered doing solo."
        ]
    },
    "Here come Bad Boi - Monster Hunter Clay Work": {
        "title": "Here come Bad Boi - Monster Hunter Clay Work",
        "score": 32,
        "url": "https://i.redd.it/eaglim5j1h9d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Wow"
        ]
    },
    "Raging brachy fight was amazing.": {
        "title": "Raging brachy fight was amazing.",
        "score": 33,
        "url": "https://i.redd.it/kyt80ogtsg9d1.jpeg",
        "content": "Going into the fight I was scared as hell because I’d heard the stories of people getting two shot(which he def did two shot me) but I ended up treating it like a dark souls fight and got him my 2nd try. 10/10 fight can’t wait for alatreon and fatalis.",
        "num_comments": 5,
        "comments": [
            "The theme in the last phase goes *hard*.",
            "Whats the helmet you're wearing?",
            "It looks like Safis helm.",
            "Safi b",
            "Thanks!"
        ]
    },
    "Thank you Gajalaka for giving me the killing blow on this tempered Tigrex": {
        "title": "Thank you Gajalaka for giving me the killing blow on this tempered Tigrex",
        "score": 21,
        "url": "https://v.redd.it/uphpljcecg9d1",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}