{
    "ASK ALL QUESTIONS HERE! Weekly Questions Thread - June 22, 2024": {
        "title": "ASK ALL QUESTIONS HERE! Weekly Questions Thread - June 22, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/MonsterHunter/comments/1dm7zl2/ask_all_questions_here_weekly_questions_thread/",
        "content": "Greeting fellow hunters\n\nWelcome to this week's question thread! This is the place for hunters of all skill levels to come and ask their ‘stupid questions’ without fear of retribution.\n\nAdditionally, we'd like to let you know of the numerous resources available to help you:\n\n**Monster Hunter World**\n\n&#x200B;\n\n[Mega-thread](https://www.reddit.com/r/MonsterHunter/comments/7x9ggi/monster_hunter_world_resources_and_question/)\n\n[Kiranico - MHWorld](https://mhworld.kiranico.com)\n\n&#x200B;\n\n**Monster Hunter Generations Ultimate**\n\n&#x200B;\n\n[Kiranico - MHGenU](https://mhgu.kiranico.com)\n\n[Awesomeosity's MHGU/MH4U/MH3U Damage Calculator](https://awesomeosity.github.io/YADC_Web/index.html)\n\n&#x200B;\n\n**Monster Hunter Generations**\n\n&#x200B;\n\n[The MHGen Resources Thread](https://www.reddit.com/r/MonsterHunter/comments/4ta8v8/monster_hunter_generations_resource_thread_ask/)\n\n[MHGen Weapon Guides written by subreddit users](https://www.reddit.com/r/MonsterHunter/wiki/weapon_guides-mhgen)\n\n[MHGen Datadump](https://www.reddit.com/r/MonsterHunter/wiki/datadumps-mhgen) containing information and resources compiled by users of the community\n\n&#x200B;\n\n**Monster Hunter 4 Ultimate**\n\n&#x200B;\n\n[The MH4U Resources Thread](http://www.reddit.com/r/MonsterHunter/comments/2vaxmt/monster_hunter_4_ultimate_resource_thread/)\n\n[MH4U Weapon Guides](https://www.reddit.com/r/MonsterHunter/wiki/weapon_guides-mh4u) written by subreddit users\n\n[MH4U Data Dump](https://www.reddit.com/r/MonsterHunter/wiki/datadumps-mh4u)\n\n&#x200B;\n\nAdditionally, **please label your questions with the game you are asking about (MH4U/MHGU/MHW, etc)** as it will make it easier for others to answer questions for you. Thank you very much!\n\n&#x200B;\n\nFinally, you can find a list of all past Weekly Stupid Questions threads [here](https://www.reddit.com/r/MonsterHunter/search?q=Weekly+Stupid+Questions+Thread&restrict_sr=on&sort=new&t=all).",
        "num_comments": 54,
        "comments": [
            "do yall fw frostfang barioth",
            "Does anyone have a link to either a greenscreen video or a png to the \"You've fainted\" Textbox? i need that for an edit but just cant find anything like that. i'd prefer old MHs version but both are fine.",
            "MH Rise\n\nI just started using gunlance the other day and as I'm figuring it out I'm really enjoying it, but one question I have is about ammo count, right now I only have 4 shells but when I watch gunlance videos they have 5+. How do I get more? Do different lances have different amounts?",
            "Comics\n\nDoes anyone remember an old MH comic from 14 years ago, featuring a girl new to MH, a seasoned hunter named gram, some guy who was good at egg carrying quests? I can't find the comic for the life of me.",
            "\\[Rise\\] Does attack boost boost Elemental damage or is it just raw damage?",
            "Hi, anyone know how can i get the weapons icons below my username?",
            "How many Rajangs does it take to kill a Fatalis?",
            "How much collectors edition cost at launch? Thinking of buying one when wilds comes out but idk how much I might need to save up.",
            "Is there no new weapon in wilds?",
            "Never played a MH game but they just went on sale so was looking at which to dive into between World and Rise. All the old comparisons I've found were when Rise just launched so curious if opinions have evolved now that its been out for a while and got a DLC?\n\nWhich would be the best place to start for someone new to the franchise?"
        ]
    },
    "How would Dalamadur compare in terms of destructive power to the Black dragons?": {
        "title": "How would Dalamadur compare in terms of destructive power to the Black dragons?",
        "score": 672,
        "url": "https://i.redd.it/thxa2tinoe9d1.jpeg",
        "content": "",
        "num_comments": 103,
        "comments": [
            "Due to sheer size and mass Dalamadur is easily as destructive as the black dragons. No other monster from the mainline games come close to its size.",
            "A rampaging dalamadur would be the single most devastating and destructive force in the world. Something that big and heavy running wild would be catastrophic",
            "Well, he terraforms mountains with ease I think he's pretty equal.\n\nIt's easy to be the same level of fatalis's strongest attack when you're *as big as* the strongest attack (if not bigger)",
            "Considering its size, I'd say it has the capability of being way more destructive than anything else in the mainline games.\n\n~~And I'm not gonna talk about its weird ability to summon meteors.~~",
            "I do not think this is a case where appearances are deceiving. Dalamadur is absolutely in the running among most powerful monsters overall.",
            "Having played every mh except for the first one. Dala's provided the most sense of danger so far. Would love to see it again",
            "I would say hes very equal in destructive power to the likes of the black dragons/ safi",
            "It can destroy entire areas just by physical movement. That puts it at atleast Dire Miralis level",
            "hard to say, he does carve up mountains by just travelling up and around them. i'm sure if he wanted to he could do the damage by just throwing his mass around",
            "It is black dragon level if not higher if it actually decided to be a destroyer."
        ]
    },
    "Who wins this battle? #6": {
        "title": "Who wins this battle? #6",
        "score": 69,
        "url": "https://i.redd.it/tqfk9c3syh9d1.jpeg",
        "content": "Artist is Jun² tacuyan ",
        "num_comments": 16,
        "comments": [
            "Gogz, he had a freaking dragonator on his back. KT have zero chance.",
            "Gogmazios easy. KTs beams are just heat, Gogmazios is spewing superheated tar. Has huge range with his wings, is relatively quick if hes in a gallop, can fly when pissed, and is robust enough to yoink a Dragonator.\n\nShed stand a better chance once released since the gold isnt weighing her down anymore but its still Gog for the win.",
            "Monster Hunters Versions of a Kajiu Battle",
            "It's easy to see who, but I don't want him to hurt Mama Kulve!",
            "Katie needs to go back to her jagrass. They miss her dearly. Fighting Gog would not go well for her.",
            "monster covered in flammable material vs monster that spits fire hot enough to instantly melt tonnes of gold \n\nseems kinda obvious to me",
            "Kulve it temperature it so much that it easily melt hundred of ton of gold in seconds and it can melt large stone in moment",
            "Wouldn't say zero since KT can ignite the tar on Gog's body pretty easily but yeah Gog should win most of the time.",
            "Are just heat same heat thats melting multiple hundreds of tons of gold in a couple seconds. Gogmazioss heat beam is likely weaker, heat wise.",
            "Gold is a very soft metal"
        ]
    },
    "Who is the strongest monster that Silver Rathalos would be able to defeat?": {
        "title": "Who is the strongest monster that Silver Rathalos would be able to defeat?",
        "score": 406,
        "url": "https://i.redd.it/9l770dis2f9d1.jpeg",
        "content": "Even if it’s extreme difficulty or above.\n\nSorry for so many VS Posts. I’m just trying to figure something out for myself.\n\n",
        "num_comments": 81,
        "comments": [
            "Probably like atleast another silver rathalos",
            "Silver Raths are pretty strong, I figure one could potentially kill a weaker elder dragon like Chameleos (especially given Chameleos weakness to fire), but would definitely get stomped out by most other elders",
            "Well, Gold Rathian defeated a Kushala pretty easily in her introduction in Rise, so... that's a thing.",
            "I believe according to the commonly accepted rules of tradition that the correct answer to this question is \"Your Mom.\"",
            "A Jaggi at the vary least",
            "Probably the weaker elders like the Kushala/Teostra/Chameleos trio. Rare species are around \"invader\" (Jho, Rajang, Bazel) level at the very least even if they are not as destructive.",
            "Silver Raths are pretty strong, I figure one could potentially kill a weaker elder dragon like Chameleos (especially given Chameleos weakness to fire), but would definitely get stomped out by most other elders",
            "The Hunter. After he/she destroy his family and wear their hides and decorate their weapons.",
            "Gold rathin wooped kushala ass in intro so his husband must be strong.",
            "Any elder weak to fire or one thats unable to fly but within a reasonable size(even if it could take shots at Zorah, I doubt it could kill one as its just too big). So the Teo/cham/kush trio, possible velkhana, Vaal outside the Vale, if it could get a clear shot on it, a kirin. Namielle isnt crazy durable as its skin doesnt seem super resistant, seems kinda soft bodied but its water and thunder are interesting challenges for rath."
        ]
    },
    "Since research as told me these guys are “Rivals” or mortal enemies, who do yall think would win in a fight. Safi or Fatalis": {
        "title": "Since research as told me these guys are “Rivals” or mortal enemies, who do yall think would win in a fight. Safi or Fatalis",
        "score": 146,
        "url": "https://www.reddit.com/gallery/1dr2tf2",
        "content": "",
        "num_comments": 127,
        "comments": [
            "Fifty/fifty even match-up, I'd say. They both have advantages and disadvantages against each other that make the fight a matter of the combat skill of the individual specimens and the circumstances of the battlefield more than anything.\n\nNot to mention that they are both pretty much the two perfect opposite sides of the coin when it comes to what Elder Dragons can be, one indiscriminately destroying all life around it while the other's bioenergy cultivation efforts result in flourishing ecosystems for kilometers around it. For them to be equal rivals is *fitting*, to say the least.",
            "Honestly, I really wish that this would become a major plot point in a future game",
            "Realistically it would be a 50/50 matchup, anyone who says one is going to easily handle the other is just outright mistaken",
            "It's probably 50/50, but, man, the Fatalis turbowank and fanfiction here is *surreal*.",
            "Honestly? It could go either way.",
            "Yeah it's 50/50 it could go either way, I will be rooting for Safi though :D",
            "Honestly Safi, He outranks Fatalis in terms of size, more developed jaw/forelimbs, and Safis nuke is a more powerful elemental attack than any of Fatalis flames. Fatalis has legendary status as an old world monster, but Safi is just a beast.",
            "I'll go with Safi'jiiva, although I guess it could go either way.",
            "Depends entirely on who picks the arena. If Safi has plenty of stuff to drain, it wins easily and survives Fatalis's flames. If Safi doesn't have stuff to drain, it isn't going to last long. It's a game of endurance, and Safi's endurance depends on the environment.",
            "We need terf wars, but with elders... Please. Elder dragon terf wars. Please...."
        ]
    }
}