{
    "Rule 5 Amendment: Only Enhanced Transformations Permitted": {
        "title": "Rule 5 Amendment: Only Enhanced Transformations Permitted",
        "score": 144,
        "url": "https://www.reddit.com/r/moreplatesmoredates/comments/17sd2i7/rule_5_amendment_only_enhanced_transformations/",
        "content": "**Why are we making this change:** We are going to experiment with cracking down on body transformation posts due to a high uptick and downward spiral in their quality in recent weeks and months for that matter. This was motivated by [this post](https://www.reddit.com/r/moreplatesmoredates/comments/17rs1xi/comment/k8nm92j/?context=3) and replies to this comment and internal moderator discussion. We have felt this was the direction to go for a while now but I take the blame here for not doing it sooner. There was a recent podcast where Derek admitted he doesn't look here very often anymore due to post quality/some weird memes around genital size and that's disappointing to us.\n\n**What is changing:** Only enhanced transformations where details about the cycle log are provided are now permitted. (see full details and example template for posting in the sidebar).\n\nIf this change doesn't work out, we will revert it in a months time. We will gather user feedback from a poll and use general sentiment to determine the success of this change.\n\n**Is this the only change?** For now yes. We don't believe this is the only issue with the quality of posts on the subreddit, this might be middle of the pack. But we also have noticed other subreddits become lower in quality over time like r/joerogan and r/HubermanLab and r/Biohackers and so on. There is a perception among young men that taking supplements shilled to them by their favorite influencer will change their life thus people shitpost asking whats the best supplement stack or how to grow 1 inch taller without any regard for health outcomes with NO mention of their current lifestyle, genetic factors or bloodwork and this deeply upsets me.\n\nThank you for participating and maybe stop with the penis sizes :D",
        "num_comments": 66,
        "comments": [
            "guess I have to get on the sauce now",
            "W rule change. Felt like every other post was a transformation post. Thank u mods <3",
            "Great.  \n\nNow we gonna get guys saying\n“My 250 a week test results”\nwhen in reality they have been BnC for the last 5 years.\n\n\nWe arent going to get real transformations because people will talk shit and say\n\n\n“You could have done this natty”\n\nAnd so on.\n Unfortunately we arent going to see 100 percent transparency .",
            "Fake natties hate rule 5",
            "![img](emote|t5_2mohet|6305)",
            "Nice, yesterday just happened to be a Transformation day apparently.",
            "Better rule idea. If you aint atleast normal height and over 200 pounds with visible abs well aint nobody give a fuck about your physique. This would get rid of all these Greg Doucette type wimps who wouldnt stand out in a Planet Fitness in real life and the 160 pound kids who worked out for 5 months and finally saw a visible muscle.\n\nOr just ban transformation posts in general because nobody cares.\n\n\nJust limiting it to gear users is gonna be a whole lot of \"lol.you could have done that natty\" in 99% of the posts. The other 1% will resemble a lotr Orc that was made out of dickskin and acne",
            "I feel strongly that it'd be better to just have only one day of the week where body transformation posts are allowed, I get tired of seeing them all the time too but I also think it's good to have a supportive environment where we can congratulate each either for actually putting effort into physical fitness unlike most people nowadays.",
            "Now let's ban people asking for sources, auto removed their posts/threads etc.\n\nFfs, the Garmin watch (r/Garmin) sub enforces source discussions more strictly than this sub.",
            "Sounds regarded tbh. I get it, cause a lot of the transformations are lackluster or w/e, but more than half the people here are probably natty and either teens or young adults; only showing transformations of dudes enhanced is just going to fuck with people's heads even more. Maybe allow natty transformations if you've been training for a substantial amount of time like 5+ years? Idk, but where's the love for us natty bros?"
        ]
    },
    "this fucking guy": {
        "title": "this fucking guy",
        "score": 242,
        "url": "https://www.reddit.com/gallery/1dr0xyf",
        "content": "",
        "num_comments": 79,
        "comments": [
            "The foundation is the 9 Ancestral Tenets",
            "what does fucking viagra have to do with it??",
            "It’s so funny to me how men who take test always try and downplay the benefits. Own the shit, and stop giving a fuck that you took the easy way out.",
            "Influencers and social media dorks will try to sell you the dumb shit they do that contributes 1% to their looks,  but ignore the gear that is responsible for 99% of it.\n\nDana white,  liver fraud, duck egg guy, etc",
            "It’s amazing how many people are so full of shit",
            "The foundation of 210ng/dl and years of drugs lol this fucking clown",
            "Dana White with Gary Brecka cough cough…",
            "I’m 6 foot if I wear heels.",
            "lol, the guy who called him out is the microdosing shrooms and dancing dude",
            "He also ball cups and does primal stroking sessions with his bros before hitting the weights. Not all gym bros want success but he follows the formula"
        ]
    },
    "Bro is definitely on tren": {
        "title": "Bro is definitely on tren",
        "score": 510,
        "url": "https://v.redd.it/93kzl4xspd9d1",
        "content": "",
        "num_comments": 122,
        "comments": [
            "She was 50kg, until she started cooking for his macro requirements.",
            "Gonna be brutal when the post ![img](emote|t5_2mohet|2697)clarity kicks in",
            "Seeing people happy and in love makes me sick to my stomach",
            "Is this the same couple from the kitchen vid of them making pasta ?",
            "....Not sure if it's a joke that dudes on tren go for big women but it would explain a lot of pornstars, and dudes that get out of prison.",
            "She’s just bulking you ignorant fucks the cuts gonna be demonic",
            "Bro wearing Taekwondo pants to go out?",
            "Women eat this shit up on the tok. It proves that if your fetish is weird enough  and benefits women you won’t get hate for it. Yet I’m “fetishing” Asian women for being attached to them",
            "People making fun. Guarantee She worships this dude.  Dude probably gets some damn good head and that pussy probably fire 😍",
            "Pretty women don’t just want muscles brother. He’s a dork"
        ]
    },
    "How does she miss the irony ": {
        "title": "How does she miss the irony ",
        "score": 455,
        "url": "https://v.redd.it/5jlmtklucd9d1",
        "content": "",
        "num_comments": 42,
        "comments": [
            "Fat women may make men's dicks limper:\n\n[Slimmer women's waist is associated with better erectile function in men independent of age](https://pubmed.ncbi.nlm.nih.gov/23264164/)",
            "She is unattractive in either form. There is just more of her to be unattracted to in her final form.",
            "Only men can be unattractive according to modernity",
            "Bruh this sub is full of landwhale lovers fucking hell![img](emote|t5_2mohet|2699)",
            "yall need to go on a tren holiday until you've sorted out how horney you guys are. fat women are not attractive, its moreplate=moredates. you could've just lowered your standards and not pinned your ass all year for the same result.",
            "Speak for yourself mate. I speak on behalf of the trenbolone nation when I say we love a fat chick, especially on the bus . Nothing better when she has an ass like a badly packed parachute. ![img](emote|t5_2mohet|2697)![img](emote|t5_2mohet|2697)![img](emote|t5_2mohet|27081)",
            "5s thinking they deserve a 10, a tale as old as time",
            "She gained all that weight from birth control",
            "I actually prefer a little more cushion for the pushin, myself.",
            "I would"
        ]
    },
    "Every exercise": {
        "title": "Every exercise",
        "score": 156,
        "url": "https://i.redd.it/0jwyl8jrme9d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Til failure it is then",
            "Wake up…..it’s always the 3rd set",
            "How much do golf clubs weigh, anyway!? 😏",
            "Strong App for the win!",
            "I don’t even know how many squat sets I did today, I just kept going until I couldn’t"
        ]
    }
}