{
    "Upcoming r/MortalKombat Tournament poll/form": {
        "title": "Upcoming r/MortalKombat Tournament poll/form",
        "score": 4,
        "url": "https://www.reddit.com/r/MortalKombat/comments/1dldq9j/upcoming_rmortalkombat_tournament_pollform/",
        "content": "[https://forms.gle/biZdLXTWLCUHn8q67](https://forms.gle/biZdLXTWLCUHn8q67)\n\nAfter the success of our first tournament held on the subreddit's discord we would like to post a quick poll to gather info on those interested in competing to determine splitting tournaments into regions, connection requirements and so on.\n\nWe would also like to mention that we have altered discord memberships on the server so that all proceeds from memberships directly contribute to tournament prize pools, the discord staff will be keeping none of the money from memberships. We are looking to see if community funding prize pools like this will work long-term as the first tournament pool was fully funded by us; stay tuned for posts on any upcoming tournaments!",
        "num_comments": 0,
        "comments": []
    },
    "First look at Takeda": {
        "title": "First look at Takeda",
        "score": 1826,
        "url": "https://v.redd.it/trtmqdh7od9d1",
        "content": "",
        "num_comments": 161,
        "comments": [
            "Same voice actor from X?",
            "I’m seriously dying to know what his story deal is in this game",
            "&#x200B;\n\nhttps://preview.redd.it/pm9mreajvd9d1.jpeg?width=500&format=pjpg&auto=webp&s=56658700aa4807f35bb446d0a3ca1a9684033b57",
            "He has the whip , Now i wonder if he has his saber in one of his moves , Finally a year of waiting for mah boi its been so long",
            "Great to hear his MKX VA is back, seems like they’re maintaining the mentor - trainee dynamic which is interesting",
            "OH MY GOD MY BOY LOOKS SO BEAUTIFUL I LOVE HIM",
            "THE GOAT IS BACK! ALL PRAISE THE GOAT!! 🗣🗣❗️❗️",
            "MY GOAT IS BACK I CAN FINALLY PLAY SOMEONE OTHER THAN BUM ASS LIU",
            "Kombat Kids have entered the chat",
            "The best Kombat Kid returns 🦂"
        ]
    },
    "MK1 Takeda teaser": {
        "title": "MK1 Takeda teaser",
        "score": 270,
        "url": "https://v.redd.it/axbfl9on3e9d1",
        "content": "",
        "num_comments": 18,
        "comments": [
            "My boy is back🤧🤧🤧\n\nhttps://preview.redd.it/deo2f8oqne9d1.png?width=1122&format=pjpg&auto=webp&s=c059f1b2174677cd64cee7a6b5a0a6952b0dac30",
            "Glad he is back as well his original voice actor",
            "How that encounter should have gone. \n\n“My losing streak against you ends today!”\n“I’m sorry Takeda, Scorpion is in another universe.”",
            "Oh my god, he’s so goddamn cool!!",
            "What an awesome kombo I will never be able to perform.",
            "How is he different from MKX?",
            "I already want to fuck him, and let him cum inside of me so I can have his babies.",
            "Took them an entire fucking year. Mk fell off",
            "[deleted]",
            "Kinda reminds me of how Goku and Piccolo are both basically Gohan’s dads"
        ]
    },
    "Official Takeda Gameplay": {
        "title": "Official Takeda Gameplay",
        "score": 321,
        "url": "https://x.com/noobde/status/1806792243044336115?s=46&t=jTHcWH6esfPelR75rLrMXw",
        "content": "From Ed’s Twitter",
        "num_comments": 51,
        "comments": [
            "I like that they retained his MKX VA. One of the few along with Johnny and Kenshi.",
            "I WANNA SEE MORE GIMME.",
            "Probably my favorite of the mkx kids. Can’t wait to see more",
            "Already love him",
            "Even his stance looks badass, also based on his personality being mostly preserved I would imagine he would get along well with smoke and reptile/Syzoth. \n\nMan next season can’t come soon enough 😭",
            "Kenshi and Takeda bout to be S tier class family",
            "thank god he’s not old",
            "It has improved!",
            "Sick",
            "All my waiting is gonna pay off. He looks awesome"
        ]
    },
    "What’s a character aspect you want to see brought back": {
        "title": "What’s a character aspect you want to see brought back",
        "score": 41,
        "url": "https://i.redd.it/9rtkuer1of9d1.jpeg",
        "content": "Free my boy Pulse blades",
        "num_comments": 14,
        "comments": [
            "I want the Cyborgs to make robo noises again instead of grunting. \n\ngive me \"Ex-Wa-Zee\" or give me death!",
            "I've been playing the 3D era games lately and mannnnn the fighting style switching is so cool. I know it won't happen but I'd love for it to be brought back in newer games. Seeing some of the characters use real life fighting styles is cool af 😮‍💨",
            "Kenshi is incomplete without the beard.\n\nhttps://preview.redd.it/bxfg14631g9d1.png?width=263&format=png&auto=webp&s=c65710171f1754d289add016543d73a003ce0fca",
            "Kobra but a very cooler one, not like a ken clone.",
            "I miss when Sonya, Jax, Johnny and other “normie” characters had much more flair to their designs",
            "Boobies",
            "Kintaro. We had goro in mkx when and sheeva in mk11. When the fuck will kintaro be playable.",
            "Fights without Kameos.",
            "I too, miss when cyborgs were not genderbent humans",
            "Only OG’s remember cyrax yelling: “Screw you!” When being thrown off the pyramid by sheeva in the Armageddon intro"
        ]
    }
}