{
    "This guy gave into the forbidden thoughts.": {
        "title": "This guy gave into the forbidden thoughts.",
        "score": 3843,
        "url": "https://v.redd.it/sfblovgd1b9d1",
        "content": "",
        "num_comments": 85,
        "comments": [
            "Not gonna lie, that was pretty cool.",
            "He's telling everyone at the bar, and no one is believing him.\n\nDude! I really jumped the tow truck!!",
            "I like how the van didn't realize his lane was blocked until he was 6\" away from the ramp.",
            "Someone out there living his best life, I salute them",
            "Would have thought that lip woukd have gotten him.",
            "Doesn’t look like he even has experience jumping a motorcycle. Guy was sitting down when he left the lip!",
            "He’ll always get to be able to say he saw his chance and he took it, but at the same time whenever someone lets their intrusive thoughts takeover and win like that I worry about the next time they let their intrusive thoughts win and aren’t so lucky.",
            "LETS GO!  Rider even gave the hand signal letting the ford transit know he was jumping back into the lane. Awesome.",
            "You just know he played GTA",
            "Just a good ole boy, never meanin’ no harm…"
        ]
    },
    "Never wheelied...": {
        "title": "Never wheelied...",
        "score": 234,
        "url": "https://i.redd.it/hq3hdch58g9d1.jpeg",
        "content": "",
        "num_comments": 25,
        "comments": [
            "I don’t see your issue here,\n\nthat’s clearly a reverse stoppie.",
            "Bro it says stunt bike in the title.",
            "Typical stunt rider, probably bullshitted his way out of tickets too ;D",
            "He says no trades other than a dirt bike. What do you wanna bet he lost his license?",
            "4.2k$ for a 2004 is pretty wild though despite the extra kit.",
            "if he never got it up to noon, not dank enough to be considered a wheelie",
            "It's a joke buddy 😉",
            "I refuse to believe that there's such thing as a used bike that hasn't been wheelied",
            "Well, technically, he’s doing a highchair there, which could be classified as babied",
            "Is that even possible or just photoshopped?"
        ]
    },
    "Why did he open the door😱": {
        "title": "Why did he open the door😱",
        "score": 1057,
        "url": "https://v.redd.it/dcnf5ia49d9d1",
        "content": "",
        "num_comments": 152,
        "comments": [
            "Deliberate or not, this is illegal. I hope this dumbfcuk driver was punished.",
            "holy fuck... i hope that rider is ok, they got annihilated... that shit looked intentional.",
            "Does anyone know where that place is? It looks like a nice place, (w/ some bad drivers apparently)",
            "How often does one open a car door in traffic.  Completely intentional.  And criminal.",
            "Even if it was on accident. The driver just stopped in the middle of the road, no hazards or any indication. Whether it can be arguaged the rider was being aggressive by splitting or not- that for suresies has to be drivers fault",
            "Not saying the rider is at fault, but I lane split a lot (Ca commuter) and if I were approaching a car stopped like that with a large gap in front of them my spidey senses would have lit up like a Christmas tree. I'd have hauled the speed down and gone by @ no more than 5 mph.",
            "Dear Jesus, another Prius rideshare stopping in the middle of the road, without any warning/hazard light etc.  These guys are a menace.  Easily the most annoying drivers on the road, speeding up, slowing down, stopping randomly.",
            "Always assume everybody in the car is an idiot\n\nYou have to slow down in these sort of situations dude was going way too fast and got fucked",
            "I can't tell if it was an accident or on purpose. It sure looked on purpose. Rider got rekt hard....",
            "Eeeeeeeeeek.\n\nYeah that sucks. Can't really predict that one."
        ]
    },
    "Always practice good motorcycle etiquette": {
        "title": "Always practice good motorcycle etiquette",
        "score": 4019,
        "url": "https://v.redd.it/sbxeduw7kb9d1",
        "content": "",
        "num_comments": 116,
        "comments": [
            "Lmao he's a real one",
            "LOL was he signaling to that other bikie that the police were around?",
            "Wow, 50mph to 173mph in 2 seconds, that bike must have a hell of an engine! /s",
            "You just know he's prob giggling to himself under that helmet lmao. I know I would be.",
            "He was nowhere close to 170mph",
            "My favorite sky video of a bike chase is when the news anchor is shocked and a little happy because the rider is was actually a good rider!",
            "Ok this is now one of my most favorite clips ever lol. \n\nGood lookin out bro. Maybe a couple extra/faster taps next time if you're dragging an active police chase behind you :D",
            "What a fucking G lmao",
            "Watch him as he goes 🎶",
            "America is wild.. damn helicopters chasing him..\n\nUp here in Canada, as long as you’re doing over 160Km/H, the cops don’t even try and chase you."
        ]
    },
    "Idk how i should feel": {
        "title": "Idk how i should feel",
        "score": 88,
        "url": "https://www.reddit.com/gallery/1dr5dw6",
        "content": "",
        "num_comments": 192,
        "comments": [
            "Imagine how that driver is going to feel when they find the hole in their bumper caused by your foot peg...",
            "I had also that kind of thing. I've asked friendly to make room but he won't do it. He say to me go to hell. Then i have say now i am not responsible for damage of your car, i ask friendly but you do nothing about that then walked over his car and drove away.",
            "I mean, it's his bumper. It's not like your peg is going to get scratched on the plastic, so who cares?",
            "Just fucking talk to her. You keep claiming she’s sexy and goes for rides with you so grow some balls and talk to her about it like an adult if it bothers you. If she gets pissed off then I would say you dodged a bullet. This shit is so dumb.",
            "Why did you post this, exactly? The title of the post and your comments aren't congruent.\n\nNice bike, lame post. Cheers.",
            "Some people need that intimacy. Read the room sheesh.",
            "Since you know the person and seems like you can get em at a moments notice; no issues here. I've been in that situation where a stranger parked so close I couldn't lean my bike upright to get out and barely got the kickstand up. My bike weighs 900pds. I scraped the hell out of that back bumper on the way out. Wish I had of done more damage.",
            "I would have had to use there bonnet as a surface to stand on to get onto my bike. However I NEVER park my bike like that I’d usually park on the pavement or  find a spot that cars can’t access because car drivers NEVER use their rear vision mirror and eventually your bike will get reversed into. The One time I parked like that I was busting for a piss and  when I got back someone had backed into my Ducati. Knocking it over I couldn’t believe it. . The guy was like “hey it looks fine hers my number”   cost his insurer 4K. lol. . btw never yet had a ticket for parking on pavement out of the way as long as your not a dick about it. .",
            "You should feel relieved they didn't knock your bike over, and to remove your bike you may scratch their bumper",
            "At least they were courteous enough to not hit it lol"
        ]
    }
}