{
    "Just remember folks, it's never too hot to ride in full gear 👍": {
        "title": "Just remember folks, it's never too hot to ride in full gear 👍",
        "score": 869,
        "url": "https://i.redd.it/fwn7wlroq08d1.jpeg",
        "content": "Might get sweaty, but that's fine.",
        "num_comments": 260,
        "comments": [
            "206 degrees out?   Must be Phoenix.",
            "When people ask me \"don't you get hot with all that on?\"\n\nMe: Yes.",
            "i always wear all my gear but i 100% understand people who ride in t shirts because it’s too goddamn hot here. however i am not brave enough to do that lol",
            "Eventually you start having to balance the risk of a crash with the risk of having a fucking heat stroke.  I'm good with my jeans, boots, helmet, and a long-sleeve dri-fit.  \n\nI'm too old and fat to be decked out wearing an armored jacket in triple digit heat for two hours straight.",
            "You’re actually better off in a good mesh set-up when it’s that hot. You’ll sweat, but your sweat will work to cool you under the jacket instead of evaporating immediately from exposed skin.",
            "Just remember folks, you don't need an excuse to do what you want. Who cares what some dorks on reddit think about it.",
            "When it's that hot I \\*WANT\\* gear on to protect me from the sun.  God damn!",
            "I don't know whats worse. Riding safely with no gear or getting into a crash from a heat stroke",
            "https://preview.redd.it/hegsnrjph18d1.png?width=3024&format=png&auto=webp&s=9d542db2afa2fc501dedf24f833b8576ba63165e\n\nWear gear because either way your going to be hot but less sunburnt",
            "I ride in full gear in AZ"
        ]
    },
    "Small cc can be a lot of fun especially in traffic": {
        "title": "Small cc can be a lot of fun especially in traffic",
        "score": 160,
        "url": "https://i.redd.it/1mcghw2le28d1.jpeg",
        "content": "2017 Suzuki Gsxr150",
        "num_comments": 26,
        "comments": [
            "All bikes are actually a lot of fun if your head is not up your butt.",
            "Small cc consumption is so unreal a good 125cc bike can go for 10km if you show it a picture of a gas station",
            "The smaller the CC the bigger the PP.\n\nUnfortunately, that's why I ride a 1250 :(",
            "I prefer not having to shift once I’m over 10 miles an hour",
            "People can say what they want, but listen..\n\nIt can be way more fun to wring the fuck out of a smaller displacement bike than to be constantly babying a bigger bike.\n\nRide your own ride.",
            "It must be super fun going full throttle out of the corner knowing you will never break traction",
            "Hey! That’s a sharp looking bike! I didnt know suzuki made such a cool 150",
            "Always more fun, riding a slow bike fast than a fast bike slow.",
            "In traffic I'd much rather have a high cc bike so I don't feel the need to keep switching gears, just let me coast until I'm out of traffic.",
            "I have to go shoot up 30 anadrol to balance the estrogen i just got from this post"
        ]
    },
    "Is it rare?": {
        "title": "Is it rare?",
        "score": 724,
        "url": "https://www.reddit.com/gallery/1dleeyp",
        "content": "Never seen bike like this before",
        "num_comments": 87,
        "comments": [
            "All 500cc 2 strokes are rare in 2024. What a beauty.",
            "Yes YZR500 are extremely rare and I have a feeling that plastics and tank aren't original.",
            "It looks to be a mixup of a 500cc 2-stroke engine, early R1/6 (not sure which) frame and fairings. All kinds of Frankenstein, and cool as shit.",
            "Well, have you seen a cigarette sponsor on a motorcycle recently? I'd say this is rarified",
            "I wonder how many packs had to be smoked to win that!? At least a few years worth. lol",
            "2 smoke!",
            "I ran into a jdm as fuck 2 stroke 500 at a po'dunk gas station in southern AZ...thing was CHERRY.\n\nDude had found it while living in Japan and did what it took to get it back with him, it was one of the coolest bikes ever had the pleasure of checking out.",
            "it will kill you faster than chain smoking",
            "What will happen first? Dying from lung cancer or wrapping around the nearest tree?",
            "I don’t know if it’s rare but sure is kool"
        ]
    },
    "What’s the average price of a fuel hose replacement?": {
        "title": "What’s the average price of a fuel hose replacement?",
        "score": 339,
        "url": "https://v.redd.it/v2y82tqzj08d1",
        "content": "Started my bike up after a month of sitting and noticed that fuel leaked pretty badly whenever the fuel reserve is either on or in reserve. What’s the average cost to fix these, considering the replacement line I can get for is about $5? \n\nSuper backed up on bills.\n\n",
        "num_comments": 190,
        "comments": [
            "Maybe just cut the end of it and slide it back on.. cost $0",
            "just buy correct size fuel hose and do it yourself.. quick job.",
            "About 3.50",
            "0.60 cents",
            "You probably spilled more money in gas in this clip than a little piece of fuel line costs.",
            "It's one banana, Michael. What could it cost, $10?",
            "Dude it's like 3 inches of fuel hose. Just buy the right size and put a new one on",
            "You just buy fuel line at an auto parts store it’s cheap.  You can cut a piece off and take it with you and give it to the counter person and they’ll hand you what you need for about 10 bucks",
            "So glad you opened it that second time, what if the first was a fluke?",
            "A few dollars at most. Visit a motorcycle shop and ask them for some fuel line.  Automotive fuel line is usually a lot thicker and harder to route."
        ]
    },
    "Slow rides are the best": {
        "title": "Slow rides are the best",
        "score": 140,
        "url": "https://www.reddit.com/r/motorcycles/comments/1dllsuy/slow_rides_are_the_best/",
        "content": "I'm still new, 300 miles total, but damn I'm really enjoying slow rides more than higher speeds. I'm not really doing anything more than highway speeds regardless, but my favorite so far has been my morning commute which is like a constant 30-45mph. Music is clear, air is cool, sun is rising, everything is relaxing, noise is far less; it's just the best. Any other slow ride appreciaters out there?",
        "num_comments": 102,
        "comments": [
            "Going fast is fun. A lot of fun.\n\nSo is going slow.\n\nCommon denominator is being on a motorcycle. Turns out those things are just fun. Who knew?",
            "I like all riding! As long as I'm not stuck behind a car that is...",
            "Count me in. Slow rides with no cars around and a wide open road are my medicine.",
            "Absolutely love this. I remember when covid hit during the first lock down and how empty the roads were. I could just cruise around slowly without worrying about anything. It was so relaxing. Music on. Wind in my face. What's not to love?",
            "Slow twisties followed by open roads where you can rip it are the best imo",
            "I ride a Grom so every ride is a slow ride. It’s still a blast",
            "I always say that I don’t ride fast since that would get me to my destination faster which is not the desired outcome. Yep, love a slow ride, just not in traffic.",
            "I like going fast, but on a 50 mile commute on the highway it isn’t all fun and the wind is loud.  Wear earplugs for that commute. It is fun going from slow to fast, though. I like the twisty roads at like 45 mph. I live in Virginia so we have plenty of those.",
            "I only got a bike in my 30s after spending my youth messing around in fast cars, I found the bike scratched a different itch, on good twisty roads where I know I'd want to push it in a car I find I much more enjoy getting a nice flow going on the bike at lower speeds",
            "i’m pretty new to riding too and always thought i’d be the guy who just wants to do felony speeds on the highway in a straight line.\n\ngranted, i still do that (in moderation) but i have much more fun going through the backroads near my house at 45 or less. something about it is so relaxing"
        ]
    }
}