{
    "In Pearl (2022), someone wears a sandwhich board stating \"We shall not accept a life we do not deserve\", the same mantra Maxine Minx has in X (2022), though in 1st. person. Pearl is a prequel to X, with Mia Goth playing both Maxine and Pearl.": {
        "title": "In Pearl (2022), someone wears a sandwhich board stating \"We shall not accept a life we do not deserve\", the same mantra Maxine Minx has in X (2022), though in 1st. person. Pearl is a prequel to X, with Mia Goth playing both Maxine and Pearl.",
        "score": 101,
        "url": "https://www.reddit.com/gallery/1dqjrla",
        "content": "",
        "num_comments": 8,
        "comments": [
            "I too watch Dead Meat !",
            "What a weird move by twitter",
            "This obviously doesn't change your point, but I'll still clarify that *we* is also first-person; it's first-person plural vs. singular *I*.",
            "It comes up a few times in >!Maxxxine!<, too",
            "2 ham fisted and overrated movies",
            "Not saying its not a fun or useless detail, its just his Pearl episode dropped this morning and made mention of it too.",
            "Well, the fact he pointed it out and also added the Maxine clip lead to me making this post. Hell, no else had.",
            "I actually noticed it a long ass time ago, but I never found the time to find a subtitled clip of Maxine saying her phrase to make the post. This is how long down the archive my photo is:\n\nhttps://preview.redd.it/ygc32jy64c9d1.jpeg?width=1080&format=pjpg&auto=webp&s=7c09182884d6f7656bc93cf9426d7b133f40f252"
        ]
    },
    "In Pearl (2022) you can briefly see a poster for the lost film Cleopatra (1917) starring Theda Bara. Pearl calls the alligator that lives near her home Theda, indicating that she named the animal after the original Hollywood femme fatale.": {
        "title": "In Pearl (2022) you can briefly see a poster for the lost film Cleopatra (1917) starring Theda Bara. Pearl calls the alligator that lives near her home Theda, indicating that she named the animal after the original Hollywood femme fatale.",
        "score": 828,
        "url": "https://i.redd.it/eggn47ngc09d1.jpeg",
        "content": "",
        "num_comments": 18,
        "comments": [
            "For some reason I know that Theda Bara is an anagram of Arab Death.",
            "Why is it a lost film? Like we don't have it anymore?",
            "Whoever put that in the film is a NERD!",
            "Just watched this last night (Pearl, not the lost film Cleopatra) and cannot believe I slept on it for so long, especially after enjoying X so much and being excited by Maxxxine.",
            "Most of the only copies of Theda Barcas films were lost in a fire that happened in I think the 30s. Unfortunately most films from that era are lost, and many of the ones we do have were originally considered lost before being rediscovered or sometimes pieces back together from various partial prints.",
            "Looking at you Ti West :)",
            "Man people *did not* catch the sarcasm",
            "Why didn't they upload those movies to YouTube or at least a cloud drive for safe keeping?\n\n/Jokes!",
            "It's funny to think that we were so close to never having some of the most famous movies in the world, like The Wizard Of Oz or Fritz Lang's Metropolis, because of the film stock used to record them.",
            "God what a nerd, appreciating film history, while making films! I bet he enjoys watching films without color or sound! I bet a chat with him about film history would be rewarding too!"
        ]
    },
    "In Wallace & Gromit: The Curse of the Were-Rabbit (2005) in the opening credits Gromit is knitting a purple pullover. In the subsequent picture Wallace is wearing it. He wears it until it gets wet in the rooftop glasshouse scene, after which he goes back to the normal green one.": {
        "title": "In Wallace & Gromit: The Curse of the Were-Rabbit (2005) in the opening credits Gromit is knitting a purple pullover. In the subsequent picture Wallace is wearing it. He wears it until it gets wet in the rooftop glasshouse scene, after which he goes back to the normal green one.",
        "score": 299,
        "url": "https://www.reddit.com/gallery/1dnh6xb",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Took me a second to reread but good detail",
            "I love that movie so much!",
            "I love this movie!",
            "Cheeeeeese Gromit !",
            "cheese?",
            "Wow, good eye!"
        ]
    },
    "In Kill Bill (2003) credits two grip/crane members have nicknames \"The Rock\" & \"Nic Cage\". In Death Proof (2007) the girls mention having an on-set relationship with The Rock and another crew member that looks like Nic Cage. ": {
        "title": "In Kill Bill (2003) credits two grip/crane members have nicknames \"The Rock\" & \"Nic Cage\". In Death Proof (2007) the girls mention having an on-set relationship with The Rock and another crew member that looks like Nic Cage. ",
        "score": 440,
        "url": "https://i.redd.it/0e5hhf41pa8d1.jpeg",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Also, Zoe Bell (who played herself in Death Proof) was a stunt woman in Kill Bill. Making Kill Bill a movie shot inside the universe of Death Proof.",
            "Not to mention he missed that gorgeous challenger",
            "Mary Elizabeth Winstead even says that his real name is Bruce in the movie (Death Proof) when talking about him.",
            "Death Proof was fucking awful. Turned it off after 45 mins. Kurt was cool and the girls were acting good but it wasnt interesting at all.",
            "I love Zoe Bell, her on the hood was crazy. She said when they first started filming that she was hiding her face cuz she so used to just doing the stunts for another actor. She's badass",
            "And since Uma Thurman's character in Pulp Fiction describes starring in a pilot reminiscent of Kill Bill, that is probably the name of the universe",
            "Nice catch, I didn't even notice that. The only reason I was watching that far into the credits because I heard there's a little blooper at the very end of Kill Bill 2",
            "Well I liked it, I went to a lot of Grindhouse movies in the 70s and it captured the essence of many of them.  In fact I thought Planet Terror was the real train wreck, so to each their own.",
            "You can just say it wasnt for you.  Not liking something doesnt make it fucking awful.\n\nTurning it off also ruins the best part of the movie  watching Kurts turn from badass predator to terrified prey.",
            "Planet Terror is hot garbage but i still watch it back to back with Death Proof for the grindhouse experience"
        ]
    },
    "In \"Napoleon Dynamite\" (2004), actor Jon Gries (who plays Uncle Rico) can be seen spitting out the steak he's chewing on as he turns away from the camera.": {
        "title": "In \"Napoleon Dynamite\" (2004), actor Jon Gries (who plays Uncle Rico) can be seen spitting out the steak he's chewing on as he turns away from the camera.",
        "score": 11728,
        "url": "https://v.redd.it/7hf6ceuqws7d1",
        "content": "",
        "num_comments": 393,
        "comments": [
            "Napoleon Dynamite in general didnt feel like there were a lot of takes. Simply and awkward made these characters feel genuine.",
            "I saw this movie probably 10 times before I realized there was a 5 minute wedding scene after the credits between Kip and Lafawnduh.  Not just a little 5 second clip... A FULL on wedding scene!",
            "See, now this is a good movie detail. Ive seen this scene hundreds of times and never noticed.",
            "I swear I watch the first second of the clip (where he turns away from the camera) 50 times before realizing that he spits it out near the end of the clip as he sits down (before turning back to the camera).",
            "You see them mountains over there?",
            "Napoleon Dynamite is one of those movies where you if you haven't seen, you have seen it due to always seeing clips, memes, references, etc. to it.",
            "That dude built underground theme parks in university closets.",
            "It was just a little Griestle",
            "He was good in White Lotus too",
            "Second best movie ever. First is Hot Rod obviously, then The Sword In The Stone from 1963."
        ]
    }
}