{
    "Timothy Chatlamen is the Tom Holland before Zendaya. It becomes abudently clear once you think about it more. Subsequently, that girl from stranger things is the zendaya before timothy chatlaman. Again, before you comment disparanging comments please take a few moments to internalize this info.": {
        "title": "Timothy Chatlamen is the Tom Holland before Zendaya. It becomes abudently clear once you think about it more. Subsequently, that girl from stranger things is the zendaya before timothy chatlaman. Again, before you comment disparanging comments please take a few moments to internalize this info.",
        "score": 209,
        "url": "https://i.redd.it/oq7jr4sx3f0d1.png",
        "content": "",
        "num_comments": 31,
        "comments": [
            "You've got incomprehensible bot speak down",
            "The meds are hitting different today",
            "What the fuck are you talking about Jesse",
            "No joke I said this exact thing to my supervisor four years ago",
            "So if Timothee is actually Tom in present day moving forward in time and Tom is Timothee from the future moving backward through time then no wonder they are never seen together because if they touched each other it would cause an antimatter explosion that would destroy the universe",
            "right on man Ive always been thinking the same thing",
            "Damn Ive been totally distracted by how insane this is.",
            "It's so crystal clear, the woke mob wants to keep the truth away from us",
            "This a good shitpost, how boring does this sub need to be exactly",
            "right....robot speak. Speak for yourseld jack nuckles"
        ]
    },
    "I accidentally found the goldmine list of greatest movies": {
        "title": "I accidentally found the goldmine list of greatest movies",
        "score": 1841,
        "url": "https://www.reddit.com/gallery/1d2jbtj",
        "content": "",
        "num_comments": 266,
        "comments": [
            "Parasite being in that list reminds me of Tim Poole saying that Squid Games is actually a critique of Communism...",
            "\"liberals are the true Parasites(2019)\"\n\nMedia literacy is aliver than ever before",
            "Fight Club is a movie about watching Jared Leto get his ass beat which is very cool and epic",
            "Who gives a crap if theyre socialists? doesnt sound like a clear anti-socialist statement to me lol, rather an indifferent one",
            "*sees* ***Ace Ventura: Pet Detective*** *on the list*\n\nTIL I am conservative.",
            "When I think of conservative film making, the works of known socialist Bong Joon-Ho are definitely at the top. Sorry liberals.",
            "People say that conservatives don't have media literacy because they're idiots, but really it's a coping mechanism which is necessitated by the fact that if they were capable of coherent media criticism then they wouldn't be able to enjoy any good media. Also, because they're idiots.",
            "The dark knight is a conservative movie in that the whole theme of it is that the various Bush era war on terror terrorism fighting methods like domestic spying and extradition without due process are good because the people in charge are trustworthy and will use them responsibly.\n\nAnd despite that, it is a great movie.",
            "Whoever made this list could misinterpret a Stop sign holy shit",
            "I love that the Beauty and the Beast remake lives rent free on whoever wrote Conservapedia article about it, its hilarious"
        ]
    },
    "he's literally me": {
        "title": "he's literally me",
        "score": 87,
        "url": "https://i.redd.it/t2t2trvdgi9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "He gay",
            "![gif](giphy|jWgFDax9Dmcpi5hiec|downsized)",
            "https://preview.redd.it/2l3dnbiwmi9d1.jpeg?width=1024&format=pjpg&auto=webp&s=4ee35850338e8a744153d96aa853d42ba3365f33\n\nHe just transferred to the Gambling High School"
        ]
    },
    "Kevin Costner looking at audiences as he self finances another film": {
        "title": "Kevin Costner looking at audiences as he self finances another film",
        "score": 35,
        "url": "https://i.redd.it/sqqgdyodsi9d1.jpeg",
        "content": "",
        "num_comments": 4,
        "comments": [
            "The audiences are Yellowstone fans.",
            "As one of the few *The Postman* defenders, I cant wait",
            "Still top 10 dumbest scene in all of cinema. Coincidentally 7/10 spots are filled with Snyder movies",
            "[Kal-El No](https://youtu.be/3gJnLJeL5S8?si=TQTLjGTrywaQTMol)"
        ]
    },
    "This pair has twenty-one Oscar nominations and three Oscar wins!": {
        "title": "This pair has twenty-one Oscar nominations and three Oscar wins!",
        "score": 221,
        "url": "https://i.redd.it/tgljt5t9mf9d1.jpeg",
        "content": "",
        "num_comments": 17,
        "comments": [
            "But only one of them was in Cats (2019)",
            "Their careers were never the same after the split.",
            "James Corden? The only thing he should host is a parasite.",
            "I know this is MOVIEScirclejerk and people may find it cursed but James Corden is as just as close to getting an EGOT as Meryl Streep is. Hes got 10 Emmy Awards and a Tony. Meryl has 3 Oscars and 3 Emmy Awards.",
            "And one Tony Award, which surprisingly enough was not won by Streep",
            "wow what a talent! (and Meryl Streep was also there)",
            "Abd only one of them is a friend and defender of well-known sex offender Harvey Weinstein!",
            "Who is on the left?",
            "Still waiting for the butt hole cut",
            "before there was Simon & Garfunkel there was Streep & Corden"
        ]
    }
}