{
    "Hi, /r/movies! We are Josh Margolin, Zoë Worth, and Chris Kaye. Director and producers of Thelma, an action-comedy starring June Squibb, Fred Hechinger, and Parker Posey. It was a hit at Sundance and is currently out in theaters nationwide. AMA!": {
        "title": "Hi, /r/movies! We are Josh Margolin, Zoë Worth, and Chris Kaye. Director and producers of Thelma, an action-comedy starring June Squibb, Fred Hechinger, and Parker Posey. It was a hit at Sundance and is currently out in theaters nationwide. AMA!",
        "score": 80,
        "url": "https://www.reddit.com/r/movies/comments/1dp98qe/hi_rmovies_we_are_josh_margolin_zoë_worth_and/",
        "content": "https://preview.redd.it/u2r7olkuaz8d1.jpg?width=4032&format=pjpg&auto=webp&s=cd308e2d13f52165da03026f09ced1b8aa2e1df5\n\nHey! This is Josh Margolin (writer/director), Zoë Worth (producer) and Chris Kaye (producer) here to answer any and all questions about our movie THELMA! It's an \"action\" comedy about a 93-year-old grandmother who gets duped by phone scammers pretending to be her grandson, then sets out on a treacherous quest to reclaim what was taken from her.\n\nThe movie stars June Squibb, Richard Roundtree, Fred Hechinger, Parker Posey, Clark Gregg, and Malcolm McDowell. It just came out in theaters nationwide on June 21st and we're excited to talk to you about it!\n\nTrailer: [https://www.youtube.com/watch?v=RFAFsDEM0j4](https://www.youtube.com/watch?v=RFAFsDEM0j4)  \n\n\nTickets: [https://www.thelmamovie.com/](https://www.thelmamovie.com/)\n\n>Thank you so much for chatting with us about THELMA! If you liked the movie, please tell your friends and family that they can watch the trailer and look up showtimes here:\n>\n>[THELMAmovie.com](https://www.thelmamovie.com/)\n>\n>If you have more questions, feel free to add. We'll check this thread periodically. Have a great night!",
        "num_comments": 97,
        "comments": [
            "Just wanted to say I absolutely loved this movie! I appreciate how it stars an actual 93 yr old actress and uses her abilities well instead of hiring a younger actress, using prosthetics to age her and making her do Tom Cruise level stunts.\n\n Its a limited release currently I was wondering if it will expand to some more theaters next week?  Also I read that June was always the #1 choice for Thelma, Was Richard Roundtree always the #1 choice for Ben?",
            "Will you convince the Academy to have June announce the Oscar for best stunt performance?",
            "how did you find balance between the comedy and the sincerity? Both came off so genuine throughout the film and I feel like that can be tough to juggle",
            "In real life, did Tom Cruise/Mission: Impossible - Fallout really inspire your grandmother to do what she did? Or did it just inspire you creatively while writing the story?",
            "What a fantastic movie!  My favourite relationship in the movie is between June and Fred.  Besides your (Josh's) relationship with your grandmother, have you seen such sweet, doting grandparent/grandchild relationships IRL?  Most portrayals of teens and young adults in TV and movies tend to show the younger generation as being surly or self-obsessed, and never this loving to their elders.",
            "I saw the movie this week and loved it - congrats to the whole team. Definitely brought back memories of my dearly departed lola.\n\nSo where can we get those June Squibb hats?",
            "Hey guys, Mission: Impossible - Fallout is my favorite action movie and I knew I was in for a ride the moment I saw it featured in your film! Were Josh and his grandmother inspired by Fallout in real life?\n\nThanks for doing this. I absolutely loved the film. Best comedy of the year!",
            "If there was one fact about this film you'd want audiences to know before they saw it, what would it be?",
            "HI!  I loved the movie.  I attended the Q&A at NYC Lincoln Square last week and was wondering how you, ~~Jeff~~ Josh (sorry!), June and Q&A moderator knew Beanie Feldstein prior to the movie and if she had any other part in the movie beyond passing on the script?\n\nAnd was it difficult to insure the movie given the cast?",
            "What was it like working with june squibb and if this film becoms successful do you think you could make a spinoff"
        ]
    },
    "Official Discussion Megathread (A Quiet Place: Day One / Kinds of Kindness / Horizon: An American Saga - Chapter 1 / Thelma)": {
        "title": "Official Discussion Megathread (A Quiet Place: Day One / Kinds of Kindness / Horizon: An American Saga - Chapter 1 / Thelma)",
        "score": 39,
        "url": "https://www.reddit.com/r/movies/comments/1dq96gv/official_discussion_megathread_a_quiet_place_day/",
        "content": "[A Quiet Place: Day One](https://old.reddit.com/r/movies/comments/1dq8qjd/official_discussion_a_quiet_place_day_one_spoilers/?)\n\n[Kinds of Kindness](https://old.reddit.com/r/movies/comments/1dq8ql6/official_discussion_kinds_of_kindness_spoilers/?)\n\n[Horizon: An American Saga- Chapter 1](https://old.reddit.com/r/movies/comments/1dq9oab/official_discussion_horizon_an_american_saga/)\n\n[Thelma](https://old.reddit.com/r/movies/comments/1dq8qn7/official_discussion_thelma_spoilers/?)",
        "num_comments": 0,
        "comments": []
    },
    "Martin Mull, Comic Actor of ‘Clue,’ ‘Roseanne’ and ‘Arrested Development,’ Dies at 80": {
        "title": "Martin Mull, Comic Actor of ‘Clue,’ ‘Roseanne’ and ‘Arrested Development,’ Dies at 80",
        "score": 15229,
        "url": "https://www.thewrap.com/martin-mull-comic-actor-of-clue-roseanne-dies-at-80/",
        "content": "",
        "num_comments": 874,
        "comments": [
            "RIP. Loved him in clue.",
            "And Sabrina the Teenage Witch.",
            "Looks like Gene Parmesan will be surprising Lucille Bluth up at the pearly gates",
            "Fernwood Tonight!\nMartin Mull and Fred Willard!!   \nSo funny!",
            "The Priest on American Dad.",
            "A 21-gun salute for Col. Mustard. A truly hilarious actor!",
            "This is war, Peacock. Casualties are inevitable. You can not make an omelet without breaking eggs, every cook will tell you that.",
            "He was fantastic as the Eagle in Veep.",
            "Was it Ms Scarlett, Mrs Peacock, or everyone?",
            "He did a voice for Danny Phantom."
        ]
    },
    "The Prestige (2006) just melted my brain in the best way.": {
        "title": "The Prestige (2006) just melted my brain in the best way.",
        "score": 1340,
        "url": "https://www.reddit.com/r/movies/comments/1dquaep/the_prestige_2006_just_melted_my_brain_in_the/",
        "content": "Memento next, folks.\n\nAll I knew going in was it's Hugh Jackman and Christian Bale going to war as magicians, and it's Christopher Nolan. That's it. And my God, it was mind blowing.\n\nEven though it's filled with Nolan's signature time jumping, you can still follow the story without questioning that, because it's so well paced and directed. The tricks, rivalry and mystery is constantly engaging.\n\nAnd then Nolan pulls it off with a magic trick deluxe of an ending. The set-up and hints are there, and it ends up bigger than you think.\n\nI don't know what else to say. My brain is soup now. Straight up soup. Just an amazing 6/6 movie.",
        "num_comments": 290,
        "comments": [
            "Now you have to watch it again with everything in mind! \n\nThis movie just gets better with more viewings for sure.",
            "Do you love me?\n\nNot today.",
            "Also DAVID FUCKING BOWIE as Nicola Tesla.",
            "I love you. ----You mean it today. ----Of course. ---- It just makes it so much harder when you don't.",
            "When I realized the movie itself was its own trick  exactly as explained by michael kane's character , my  mind was blown",
            "This is nolan's best movie by a country mile. Watch it 5 more times and i promise every time you'll notice more and more clues, foreshadowing, and details that you missed the first time around. \n\nThis is in my top 10 movies of all time.",
            "I envy you for watching this set of mind-blowing movies for the first time in your life",
            "extremely rewatchable, trying to figure out whos who in each scene.",
            "Wow you got to go to The Prestige blind in 2024. Thats awesome",
            "Great movie indeed. Love it every rewatch too!"
        ]
    },
    "‘Horizon’ Is The Biggest Gamble of Kevin Costner’s Career": {
        "title": "‘Horizon’ Is The Biggest Gamble of Kevin Costner’s Career",
        "score": 2066,
        "url": "https://www.theatlantic.com/culture/archive/2024/06/horizon-an-american-saga-chapter-one-review/678825/?utm_source=reddit&utm_medium=social&utm_campaign=the-atlantic&utm_content=edit-promo",
        "content": "",
        "num_comments": 651,
        "comments": [
            "All the showings are sold out at my local amc today on opening day.",
            "If he was 20 years younger he couldve done a great job as either of the leads in a Lonesome Dove remake",
            "Silverado is my favorite western.",
            "Not a huge gamble. He knows hes gained a huge fan base from Yellowstone. People like seeing Cowboy Costner",
            "I saw it last night. I was kinda blown away. HUGE film with a lot of moving parts and it almost feels like a long prologue. \n\nAnd Costner knows what hes doing behind that camera.",
            "Every time i see the title i think  that honestly Kevin Costner would have mad a decent Rost",
            "I'm a huge fan of Westerns, and Kevin Costner has been in quite a few good ones. But a 3 hour run time for a movie that doesn't resolve any plot points, and potentially won't in the next movie either, feels like hubris. It sucks because I want him to be able to make all 4 movies, but I have an incentive to wait for it on streaming because they're long as hell, and I'm hesitant to invest the time into it because there's a good chance the first two movies will bomb and there won't be any resolution to the story.",
            "Ill still watch it. His movies might not be Oscar material, but its comfort food for the mind. \n\nAdam Sandler does the same thing.",
            "lol. At this stage of his career there is no such thing as a \"gamble\".",
            "Planning on seeing this. I love a good Costner western."
        ]
    }
}