{
    "Official Discussion Megathread (The Bikeriders / Ultraman: Rising)": {
        "title": "Official Discussion Megathread (The Bikeriders / Ultraman: Rising)",
        "score": 27,
        "url": "https://www.reddit.com/r/movies/comments/1dksy1l/official_discussion_megathread_the_bikeriders/",
        "content": "[The Bikeriders](https://www.reddit.com/r/movies/comments/1dksxab/official_discussion_the_bikeriders_spoilers/?)\n\n[Ultraman: Rising](https://www.reddit.com/r/movies/comments/1dksxbr/official_discussion_ultraman_rising_spoilers/?)",
        "num_comments": 0,
        "comments": []
    },
    "Hi, /r/movies! I am Ariane Louis-Seize, director of Humanist Vampire Seeking Consenting Suicidal Person, in theaters today, rolling out nationwide. It's an award-winning French-Canadian coming-of-age vampire film that screened at festivals worldwide, including TIFF and Venice. AMA!": {
        "title": "Hi, /r/movies! I am Ariane Louis-Seize, director of Humanist Vampire Seeking Consenting Suicidal Person, in theaters today, rolling out nationwide. It's an award-winning French-Canadian coming-of-age vampire film that screened at festivals worldwide, including TIFF and Venice. AMA!",
        "score": 96,
        "url": "https://www.reddit.com/r/movies/comments/1dl7du4/hi_rmovies_i_am_ariane_louisseize_director_of/",
        "content": "**Hi everyone,**\n\nHi, r/movies! I’m Ariane Louis-Seize, the screenwriter and director of *Humanist Vampire Seeking Consenting Suicidal Person*. It's an award-winning, French-Canadian coming-of-age vampire film that's been charming audiences at festivals worldwide, including TIFF and Venice, and has won numerous awards. It's hitting theaters nationwide this week. I'm here to answer all your questions about the film, my journey, and anything else you're curious about! AMA!\n\n**Logline:**  \nSasha is a young vampire with a very serious problem: she’s too sensitive to kill! Frustrated by their daughter’s empathy for humans, Sasha’s parents decide to cut off her blood supply to force her to learn how to hunt… or starve! Just as she decides to reject her vampire instincts and embrace a final death, she meets a lonely teenager named Paul who is willing to give his life to save hers, on the condition that she help fulfill his final wishes before day breaks.\n\n**Watch the Trailer:**  \n[https://www.youtube.com/watch?v=l6Ox75fXY7o](https://www.youtube.com/watch?v=l6Ox75fXY7o)\n\n**Release Date:**  \nHumanist Vampire opens in NY and LA theaters today, followed by a nationwide theatrical rollout!\n\n**Edit: I’m logging off now to get ready for the film’s NYC premiere! Thanks everyone for your questions!  I really enjoyed spending this virtual moment with you all. Please tell all your friends about the movie! Xoxo**\n\nhttps://preview.redd.it/6k6qnlhs5y7d1.jpg?width=1440&format=pjpg&auto=webp&s=fe462da97cf9a44d0ad08ecbaf7c9dea221405fb\n\n>I’m logging off now to get ready for the film’s NYC premiere! Thanks everyone for your questions!  I really enjoyed spending this virtual moment with you all. Please tell all your friends about the movie! Xoxo",
        "num_comments": 47,
        "comments": [
            "Ariane will be answering questions an hour or two after this post goes live (so around 1:00 PM to 2:00 PM Eastern). Please ask away :)",
            "This movie looks fantastic, can't wait to see it!\n\nWe've been watching and reading vampire stories for centuries now, why do you personally think that the concept has such staying power with audiences?\n\nAlso, were there any established vampire \"tropes\" that you were consciously avoiding when making the film? Any specific ones you wanted to honor/homage with the film?",
            "Allo Ariane!\n\nI absolutely loved the movie at TIFF last year, one of my favorites of the festivals. It was super charming/bloody/sweet/hilarious. A really unique mix. Looking forward to catching it again soon for its full release, hopefully in a theater.\n\nThere's one scene in particular that I really loved and couldn't stop thinking about, when Sasha and Paul are listening to the music together that reminded me so much of the [Listening Booth Scene](https://www.youtube.com/watch?v=fkRuHhhYAqg&ab_channel=VivekYadav) from **Before Sunrise**, one of my all-time favorite scenes. Was this intended? I've been hoping it was lol.\n\nIf not, were there other films that you used as influences for **Humanist Vampire**?",
            "Hello!\n\nWhat are some of your most favorite coming of age films? And what about them stands out to you?",
            "Ariane! I loved HVSCSP!! It was so much fun and a superb joy to watch! Feel free to answer 0-all of these:\n\n1. How did the idea/subject matter come about for the film?\n2. How did you convince your producers to keep the super long title (that's surprisingly shorter in French!)\n3. What sold you about Sara and Felix-Antoine during the casting process that they would be PERFECT for their roles?\n4. What did you find most fun and most challenging in making your first feature?\n5. Are you related to French royalty?!\n\nP.S. I loved the set design of the cousin's place! Kudos to the designer(s)!\n\nCongrats on all the award wins and nominations for your debut feature!!",
            "What's your favourite vampire movie/s if you have any?",
            "Humanist Vampire was a lot of fun!  \n  \nAre you working on anything at the moment? Any plans for your next feature?",
            "Who are your favourite directors? Who inspired you to be a director?",
            "Was Armin Meiwes, the German cannibal who only wanted consenting victims, part of the inspiration?",
            "Congrats on making one of the most beautiful films I’ve seen in a while! Can you tell me a bit about how you developed your vision for the film’s cinematography? Your cinematographer has a new fan in me!"
        ]
    },
    "Taylor Wily, ‘Hawaii Five-0’ and ‘Forgetting Sarah Marshall’ Actor, Dies at 56": {
        "title": "Taylor Wily, ‘Hawaii Five-0’ and ‘Forgetting Sarah Marshall’ Actor, Dies at 56",
        "score": 6817,
        "url": "https://www.thewrap.com/taylor-wily-actor-dead-dies-hawaii-five-0-forgetting-sarah-marshall/",
        "content": "",
        "num_comments": 276,
        "comments": [
            "\"Are those sad tissues or happy tissues?\"",
            "Dude was in the first UFC fight ever",
            "\"You need a hug\"",
            "“…It’s like the Sopranos. It’s over…. Find a new show.”",
            "RIP. Hawaii Five-O was one of the rare network shows I watched every night. Loved him in it.",
            "I’m sure he’s having a nice Subway^tm foot long Italian in heaven right now.",
            "Alotta Aloha bruddah & mahalo plenny🤙",
            "Must be sad tissues",
            "Oh man, I just rewatched Forgetting Sarah Marshall last night. He was such a great part of the movie.",
            "Fought in UFC 1 as well. Gone too soon."
        ]
    },
    "What are some facts that movies get wrong so often that it annoys you?": {
        "title": "What are some facts that movies get wrong so often that it annoys you?",
        "score": 707,
        "url": "https://www.reddit.com/r/movies/comments/1dlizbg/what_are_some_facts_that_movies_get_wrong_so/",
        "content": "I am not talking about being real picky with some hard science facts that movies get wrong. I mean even when they got consultants, there is room for dramatization and artistic license. No movie is a fact book or should aim to be. Having said that, are there facts that movies get wrong, and lies or misunderstandings they continue to spread that annoy you? For example, misquoting someone, or repeating the idea that we use only 5-10% of our brain, and so forth.",
        "num_comments": 1835,
        "comments": [
            "Firing guns in enclosed spaces not deafening anyone. ",
            "I used to do mechanical design for buildings so the two big ones for me are people being able to crawl through ventilation ducts without their being a bunch of crap inside them. And fire sprinklers all going off at the same time or when someone pulls a fire alarm.",
            "When someone is shot in the shoulder and they're fine just a few scenes later.",
            "Being knocked out for a bit. Being unconscious from being hit on the head can be VERY dangerous. You would not be completely fine when waking up.",
            "Almost everything about computers, ever.",
            "When a character survives severe blunt force trauma. Someone getting thrown into a wall hard enough to break bricks, falling off a building and crushing a car roof, bad car crash, etc. and walking away when I know their organs just got liquified.",
            "Poor New York artists living in giant, stylish industrial spaces that would cost a billion dollars a week to rent.",
            "Computers, especially when showing displays, making little beeping noises to let you know they are computers.",
            "As an asthmatic, I hate it when someone in a movie uses an inhaler.",
            "Cars exploding after catching fire"
        ]
    },
    "Christopher Nolan's newer films are missing Jonathan Nolan": {
        "title": "Christopher Nolan's newer films are missing Jonathan Nolan",
        "score": 267,
        "url": "https://www.reddit.com/r/movies/comments/1dlluzz/christopher_nolans_newer_films_are_missing/",
        "content": "Let me preface this by saying that I love Christopher Nolan. To me, he's one of the best directors/movie makers, and up until recently, I considered him my #1. Until Dunkirk. It was his first movie after Interstellar, which was (again, in my opinion) a masterpiece. I remember seeing it in IMAX 70mm and had the most unexplainable movie experience of my life. I was silently sobbing by the end of it.\n\nAnd that was after Inception and Dark Knight! So when Dunkirk came out, I had very high expectations, because his films always met those expectations and surpassed them. I remember noticing that his brother wasn't a part of writing it, but I didn't pay much attention to that fact... until I saw the film. Honestly, I considered it a disappointment. It was nothing like his last few movies before it, and it barely impacted me. I thought it was lacking some kind of magic that his films always had. \n\nI was happier with Tenet, and I think that the concept and a lot of the scenes were absolutely amazing! But, again, something about the film was lacking to me. It just didn't hit its mark. It wasn't what I had come to expect from Nolan's films. It didn't have the same heart and execution in its story, and I felt that missing from most scenes. Robert Pattinson was the best part of the movie for me because it's like he got it and he gave it. \n\nThat's when I started to realize that Jonathan Nolan was what was missing. I was giving all the credit to Christopher by considering him my #1 and thinking of Jonathan as only 'helping' him with the scripts. I may be wrong, but I think he was integral to the masterpieces that the films were when they were making them together.\n\nOppenheimer was obviously a fantastic movie, but to me, it was still missing the magic that I'd come to expect from Christpher Nolan. I don't know how else to explain it. There used to be this kind of electricity, heart, and soul. I'm not saying that I think those things were missing entirely, obviously not! Just that I think they were incomplete, and I think it's because he's been making his films without Jonathan for a decade now.\n\nThe writing of Westworld season 1 was like the TV version of what I was missing after Interstellar, especially the writing. I think that Christopher is a master director/filmmaker. But I think he writes great films, not masterpieces. Jonathan IS that missing piece. \n\nI'm not exactly sure why they parted ways, but I hope that they plan to make more films together in the future.\n\nEdit to add: I think that Christopher Nolan fans fall into 2 categories. Those who prefer his films pre-2014 and those who prefer his films post 2014. I want to emphasize that I'm not saying that one side is right or wrong. Just my own opinions. Cinema is about personal preference after all. \n\nEdit again to add: Welp, I don't know how I missed that Chrisophet Nolan wrote all of Inception, which I consider a masterpiece.",
        "num_comments": 164,
        "comments": [
            "Christopher is very cold and clinical. I think his brother kind of lightens up some of those movies. I will say Oppenheimer was pretty great, and the most I’ve enjoyed his movies since they stopped working together.",
            "I'm shocked that there is no mention (at tine of writing) of The Prestige.\n\nTalking about the most incredible writing, the exceptional heart and emotion inherent, the incredible rush of insight in the third act.\n\nThe amazing opening monologue that tells you everything you need to know.\n\nJonathan Nolan's masterpiece.",
            "I have been trying to figure out why I have felt this exact way since after Interstellar. Thank you for this.",
            "Hard agree. I actually didn't know that about the brother's influence. Like you, I thought Dunkirk, Tenet and Oppenheimer were all great films in a technical sense and intellectually but they lacked character stuff. Especially Tenet was let down by the (lack of meaningful) relationships between the characters, which was a shame because it had such an interesting take on time travel (sorry I mean reverse entropy lol). It's like the director spent 10 years on the concept and 10 minutes on whatever role Elizabeth Debicki's character was supposed to play (did you know she was a mother, did you know she saw everything through the lens of her child?)",
            "Strongly recommend the show Person of Interest if you like sci-fi. It was Johnathan Nolan's first series and it is all-time excellent in my opinion. It was overlooked since it was a CBS procedural show, but it does a great job with its overarching story and the last two seasons dive head-first into that arc mostly without the procedural format. \n\nIf you're in the U.S. it's free to watch with ads on Freevee.",
            "Is there a reason why they stopped working together??",
            "He is still my favorite director but I agree the movies with his brother just hit a little different.",
            "Didn't someone already do this about a week ago? I'm almost certain of it.",
            "I do know what you mean and I don’t know if it is just Johnathan absence but it could be someone who is able to challenge Christopher’s vision and he will listen to them.  You can see Christopher vision when it comes to his films and he is a master at his craft.  But being to enhance something without disrupting is not always simple.",
            ">I think that Christopher Nolan fans fall into 2 categories. Those who prefer his films pre-2014 and those who prefer his films post 2014.\n\nBadum tss. I've felt this for so long. Glad someone else noticed it too. Each are whole different eras of Christopher Nolan kino"
        ]
    }
}