{
    "RULE #3 REMINDER, PLEASE READ IT": {
        "title": "RULE #3 REMINDER, PLEASE READ IT",
        "score": 46,
        "url": "https://www.reddit.com/r/MTB/comments/1b8e4nf/rule_3_reminder_please_read_it/",
        "content": "We get a lot of Mod Mail about asking why a post is removed and over 90% of the time it's a sub rule #3 violation.  Last we polled the community you all made it clear you would like that rule to stay. I know not every violation is removed as we miss a few here or there but your reports help us weed them out. We love all the content being posted and getting help from the community here is great but until you all let us know you want rule #3 to change we are gonna leave it as it is. Thanks, be cool, and keep the rubber side down.",
        "num_comments": 68,
        "comments": [
            "**Photos should be of people riding mountain bikes.**\n\n*Posts & Comments*\n\nPhoto and video submissions to /r/mtb should be of people riding mountain bikes. All other photos or videos should either be submitted as text posts with links to your images in the post body, or in the Weekly Gear Gallery thread, posted every Friday by automod.",
            "https://preview.redd.it/olmh3pxtssmc1.jpeg?width=1170&format=pjpg&auto=webp&s=de5c5c7da1635cddc2bfc8ec5ee170ceea2a304b\n\nFor those to lazy too research what the rule is",
            "I'm firmly in favor of keeping rule 3. Just look at the other MTB sub, or really any cycling sub in general, and it's 99% pictures of people's bikes leaning against trees, leaning against a wall, etc. Just really low quality post. If I want to look at pictures of bikes there's a lot of other subs and websites to do that at",
            "I made a post about the Maxxis tyre on a brand new bike with cracks where the sidewall meets grip.\n\nI included a photo but got a pop up about rule #3. Read the rules, the photo did not meet the criteria (it was just a photo of the tyre where it had cracked) so I removed the photo. I did not want to break the rules.\n\n1 comment on the post about how worthless the post was without a photo and I couldn't agree more and then the thread was locked.(Clarification: comment not from mod).\n\nHere's the thing: I'm on Reddit; it has the functionality to host photos and videos. Why force posters to host images elsewhere? Why force consumers to click links to third-party sites? (Could be malicious/unsafe links).\n\nExplain the reasoning behind the rule and perhaps I could understand. (I'm not asking for an explanation BTW).\n\nEdit: read a few more comments and I'm seeing there was a poll to decide the rule. Democracy at its finest.\n\nEdit2: https://www.reddit.com/r/MTB/s/uBheQs5Ta0\n\nHumans will find loopholes. Tell someone they can't do this or that and they get the same end result by working around the rules. The poster wrote out this nice description of an issue they are having and instead of including the photo with the OP, they've posted it in the comments.",
            "A reminder of what rule #3 is would really increase the quality of this post. ",
            "Why is the \"weekly\" discussion thread 4 months old?",
            "This rule makes no sense tbh",
            "Totally agree with the rule but curious why my post was removed when it was literally me riding my bike? I didn't really care to argue a case for a post so I never did but figured that this is posted I might as well ask.\n\n[https://www.reddit.com/r/MTB/comments/17h6r4l/my\\_second\\_enduro\\_race\\_was\\_a\\_blast/](https://www.reddit.com/r/MTB/comments/17h6r4l/my_second_enduro_race_was_a_blast/)",
            "I would post a picture of rule #3, but I can’t. Unless there is also someone riding a mountain bike in the picture.",
            "Whats rule 3?"
        ]
    },
    "Weekly Gear Thread": {
        "title": "Weekly Gear Thread",
        "score": 14,
        "url": "https://www.reddit.com/r/MTB/comments/1bk7891/weekly_gear_thread/",
        "content": "Want to show off on NBD or new helmet day or new whatever day or just have general gear questions?  Post in here. (Mod Note: NBD posts on their own that violate Rule #3 will continue to be removed.)",
        "num_comments": 175,
        "comments": [
            "https://preview.redd.it/a9654rv33kuc1.jpeg?width=4032&format=pjpg&auto=webp&s=714562e06350da30473d5d6c836265a1b6c77c8e\n\nNBD! All set for xc racing!  Built it up with sram axs and roval carbon wheel set.  Sitting around 24lbs, thing rips! I moved the flip chip from low to high as it’s pretty steep and chunky/rocky around me and want to save myself from pedal strikes on techs climbs.",
            "I had a question for the hivemind about tire sizing:  I recently bought a Salsa Rangefinder Deore 10 29\", with  WTB ST i30 32h 29 rims that have a 30mm inner rim width measurement, and 35mm outer rim. I am hoping to turn it into a bikepacking rig and I'm trying to pop some leaner tires on it (between 2.2 and 2.35in) such as Vittoria Mezcals compared to the chunky 2.6in Maxxis Rekons that came with it which are great for chugging through anything but are a drag on pavement, dirt road, or gravel. Would there be any issue with mounting a tire as narrow as 2.2 inches on these? Is there a general reference for rims that the manufacturer puts out that provides these kinds of data points? I'm pretty new to all this so I'm not sure the best way to find min/max tolerances for tire size vs rim width. Thank you!",
            "I have a 2014 Giant Trance 3 27.5, worth upgrading or get a new bike? I was riding a ton 2014-17 but intermittently since then but getting back into it as my main out of the house hobby. Upgraded a few parts over the years, dropper post, handle bars, tires, brake pads. I really like the geometry and feel of the 27.5 wheels. But there are a lot of out dated parts as I am finding. 200mm eye to eye shock that needs a rebuild, 2x10 drive train, 150mm front brake, deore components, 19mm rims and the most noticeable are the chrome stantions. I'd really like to upgrade it and then once my son can hit the trails in a few years upgrade to a new bike then. ",
            "Hi women's forum,  \nI'm considering switching my 150 Recon Silver RL to a 170 Yari standard. The Recon has an axle to crown length of 569mm while the Yari has 581mm, only 12mm longer but offering 20mm more travel. I have the option to remove a spacer under my handlebars, which would lower them by 10mm, so my standing position would only be 2mm higher. The bike becomes slightly slacker from 66 to ? and the seat angle is 75 and becomes ?. A slacker bike is okay since I want it to be more enduro-like, and I can push the seat a bit further forward to maintain the same effective seat angle.\n\nIs this a good idea then? Will I notice a big difference between 170mm and 150mm even though both are relatively budget choices? I ride a lot of technical trails with roots and rocks like those in the Oslo forest, and since I'm on an eMTB, efficiency is not my top priority.",
            "Hey I got this 2020 polygon cascade 4 and it has a SUNTOUR XCE, 100MM 27.5\" TRAVEL fork. It was my first bike and I'm letting a friend use it for his first bike and I would like to upgrade the fork. I'm thinking 120 travel and air. What would be a good fork  match up for this bike that's under 150? Not sure if there is anything under that bit I have some wiggle room. TIA",
            "# I want to get into mtb and looking for an entry bike is this a good start?   [https://ibb.co/3RSJw1h](https://ibb.co/3RSJw1h)  Just says its a Specialized XL",
            "any ideas on how to remove a stuck bushing from the shock eyelet? I already tried with the correct tool, but it is too stuck",
            "I am looking to get a trail bike after riding a hard tail for awhile. I’m not a very experienced trail rider and I don’t know much about suspension bikes but I do understand bikes and component levels otherwise. \n\nThere’s two options standing out to me currently:\n\n1. A 2021 Marin rift zone 2, basically new. Rockshox recon silver 130mm front and deluxe rear 135mm. 12 speed shimano deore. Shimano mt200 brakes.  \n\n2. 2023 Merida one twenty 700. Fox rhythm 34 130mm front and fox something 120mm rear. Shimano 12 speed xt and shimano 4pot brakes (think SLX). \n\nThe Marin is $1700 aud and I can get it right now or the Merida is a few weeks away (which plays into my decision - my stoke is currently high) and is probably $2050. \n\nThe Merida seems better on paper everywhere but I want to ride soon haha. \n\nMy trails are hilly and mostly flow focussed but there is a bike park with rough stuff within driving distance that I’ve never been too because of my current bikes. \n\nAnyone care to help with my dilemma ??",
            "Hey there!\n\ni'm trying to get my dad's old racing/training MTB Stumpy back to life in a little nostalgic hobby project and use it as a kind of everyday city-/commuter bike. I'm pretty sure it's a 2000 model (or earlier?). I've used it myself many years ago as a starting point to get back into the sport. I'm not an experienced bike mechanic but i'd like to learn a bit in the process :).\n\nFor now I'm most concerned about the (i think original) Manitou SX Fork which kinda still does its job (more or less) but has its rubber sealing ring got loose on one side. Because of that there got much dirt into the fork (on the backside of the image).\n\nRegarding possible replacements i'm rather puzzled about the specs i need to consider. I can't find any specialized's manuals for very old stumpjumpers. I found a 2000s Manitou SX Manual (https://www.retrobike.co.uk/gallery2/d/144335-1/2000+sx+om.pdf) and so i think i need a non-tapered fork - but does any 26\" fork with rim-brake mounts do the job?\n\nThanks\n\nhttps://preview.redd.it/7ndcfjzvk2uc1.jpeg?width=4000&format=pjpg&auto=webp&s=6abede9e32d45da50abe6b745e6d7fd9255ea801",
            "so i just got this helmet [https://troyleedesigns.ca/products/su22-d4-composite-volt-helmet-blue](https://troyleedesigns.ca/products/su22-d4-composite-volt-helmet-blue) as an XL size since my head is 59.5, its my first time getting a full helmet, and was wondering if it was normal that everytime i put the helmet on it rips my ears off? really painfull everytime,  the head itself is confortable but ears and jaw is very tight. is this a normal thing? or anything i can do to fix the issue? i feel like the padding is pretty thick,\n\nits anoying since it takes like a few weeks to return and get new one back and their customer service is really slow, like 3-5 days for just a quick question\n\n\n\nedit: if i pull hard on the straps while pulling the helmet down, it definitly helps with the pain, is that how you're supposed to put helmet on? i also read somewhere that i can remove the jaw padding and try to get diffrernt size?"
        ]
    },
    "Don’t be scared.": {
        "title": "Don’t be scared.",
        "score": 429,
        "url": "https://v.redd.it/rvkncs1e2e9d1",
        "content": "He was fine without a scratch… ",
        "num_comments": 99,
        "comments": [
            "They call him 007\n\n0 speed\n\n0 technique\n\n7 fractured ribs\n\nJoking but he should practice some more on something a little smaller. That's a big drop. I don't think I could do something like that.",
            "Looks like flow drop at mammoth. Poor guy needed some speedage",
            "Did his butt touch the back tire?",
            "Is this an advertisement for full face helmets?",
            "Really shouldn't be attempting that feature at his skill level. Practice drops off of curbs over and over and over and over until it's boring and you can land both wheels at the same time without thinking or trying. You don't just go to the biggest drop you can find and see if you can do it.",
            "He 🍕'd when he shoulda 🍟'd",
            "Like a wise man used to say. “When in doubt, Throttle out!",
            "In the business we call this lack of commitment.",
            "You could hear him brake checking into a proper lock skid right before the eject button hit him in the ass.",
            "Is there a “lol” for when you say “ouch!” Out loud watching a video? There should be, because that looked like it hurt real bad."
        ]
    },
    "Fought hard for this one": {
        "title": "Fought hard for this one",
        "score": 197,
        "url": "https://v.redd.it/p7vllzp2le9d1",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Not as clean as I’d like but it’ll do",
            "I can’t imagine trying this without elbow pads lol I guess you’ve mastered professional fall technique",
            "I'm impressed your bike held up that well.   I've always relied on BMX bikes taking a beating trying to do this sort of thing in my younger days. Good persistence! ",
            "Dude that’s sweeeeet! Keep em coming boss",
            "That’s awesome. I’m not sure I could make that jump regular style.",
            "I give you credit! Good stuff!",
            "Nice work. A couple of those crashed and its broken bones for me",
            "I’m impressed your wheels held up so well. What is your bike set up?",
            "Two thumbs up. \n\nAnd I think your bike manufacturer owes you an endorsement..",
            "Serious props. Mad respect, rugged n raw"
        ]
    },
    "Marquette is a hidden gem of a US riding destination 🔥": {
        "title": "Marquette is a hidden gem of a US riding destination 🔥",
        "score": 99,
        "url": "https://v.redd.it/v2y6wz66ze9d1",
        "content": "Bertha Drop, roughly 11/12 feet of vertical height",
        "num_comments": 9,
        "comments": [
            "You’re right. Nothing like riding Ur Mom in the morning.",
            "Big ol’ Bertha",
            "Shhhhhh we want to keep it that way",
            "Bertha is so good, love visiting that place ",
            "The south trails are pretty awesome.  I've been past Bertha enough times, but won't ever try her.  I'd probably break something.  Either on me, the bike, or both.  A little further west there's the RAMBA trail system that's pretty nice.  No jumps though that I'm aware of.",
            "gorge-ous is one of the most beautiful trails i’ve ridden in my life!",
            "Sick drop",
            "Gonna Take the Chicken Line, thx 💀",
            "Haven't ridden that roll yet, but I don't think I've seen it yet either. Love the gnarly riding up there"
        ]
    }
}