{
    "Puberty Blockers: A Review of GnRH Analogues in Transgender Youth": {
        "title": "Puberty Blockers: A Review of GnRH Analogues in Transgender Youth",
        "score": 2119,
        "url": "https://www.reddit.com/r/MtF/comments/sgorzn/puberty_blockers_a_review_of_gnrh_analogues_in/",
        "content": "This article is a FANTASTIC resource for cutting through all the bullshit being spread by TERFs about the younger members of our community and the medical treatment they may take - I highly recommend it. It's extensively researched, and, of course, sourced.\n\n[https://transfemscience.org/articles/puberty-blockers/](https://transfemscience.org/articles/puberty-blockers/)",
        "num_comments": 296,
        "comments": [
            "Wow, this actually seems like a really solid meta analysis! Very thorough overview of the research, but with a perspective that understands what’s actually relevant for trans youth and their care providers. Even covers a little history!\n\nI just wish the author would find an editor qualified for academic / technical articles… It really sticks out on a piece like this if there are issues with tone, typos, etc. Still a great read though.",
            "Thank you for sharing this. 2 of my 4 kids are asking for puberty blockers. The only thing holding us back is the fact that we live in the middle of nowhere and our local doctor insists we need to see an endo.",
            "I was talking to a very openminded and intelligent classmate in my nursing program and she thought that doctors were giving testosterone or estrogen to teenagers because the media doesn't differentiate between hormone blockers and hormone therapies. When I informed her which meds were used and that the purpose was to postpone the most dramatic effects of puberty change until they could as an adult legally make their own decisions, she was like, \"wait, why would anyone disagree with this?\".",
            "Is this applicable to adults transitioning? Eg. GnRh in lieu of spironolactone?",
            "This research slaps. I'm Ftm and have had to argue with my parents in a lot of minor transrelated issues. They have stopped being catty when they realize I can actually  cute this kind of stuff about how much it improves lives <3 thanks so much for sharing!",
            "Cheapest androgen blocker for me was a pair of carefully guided scissors by a surgeon. cheaper than say a damaged liver and continued drugs. But it should be noted there is no stopping that route and waiting for a reversal..",
            "I live this. I absolutely ADORE using science to shut up terfs. I just recently started learning about swyer’s syndrome and Kleinfelter’s syndrome.",
            "Interesting.  I don't think they had this when I transitioned as a teen in the late 80's.  I just took my mom's Provera and popped very strong Spanish Hormones.  It seemed to stunt my growth and physical appearance.  I know doctors have told me my bone structure never matured into a male.  Basically I got stunted as a teen and never grew and my shoulders never broadened and have my SRS at 20 years old just cemented everything.  I stayed a smaller gal.",
            "Thank you for this! I live in Ohio where anti trans legislation is rearing its ugly head. I shared this with a couple allies in the Ohio House ❤️",
            "When the Mayo clinic gives puberty blockers to kids for medical reasons, they test the kids bone density very frequently. That doesn't seem like a \"minor\" bone density issue. Also, I've seen a couple of transwomen who did not have enough penis growth to make a vagina and the doctor used part of their colon. Are either of these possibilities explained when considering blockers?"
        ]
    },
    "My mom told me my boobs are bigger than hers 😈🤣": {
        "title": "My mom told me my boobs are bigger than hers 😈🤣",
        "score": 746,
        "url": "https://www.reddit.com/r/MtF/comments/1dqtkfa/my_mom_told_me_my_boobs_are_bigger_than_hers/",
        "content": "I had just gotten out of the shower and I was wearing my sports bra when she stopped and was like \"girl, how big are your boobs now?!\" I though they were small but apparently they're bigger than hers and I've been laughing for the last few minutes about it.",
        "num_comments": 26,
        "comments": [
            "\"Are you winning daughter?\"",
            "Meanwhile my mom just randomly said mid conversion: \"Soooo about your boobs. Are they going to get bigger or are you going to get implants?\". Like bruh lmao",
            "Sounds like your mom just got out-boobed!",
            "I had a similar experience. My mom was talking about something and at one point she said \"easy peasy lemon squeezy.\" At which point, I grabbed my boobs and I said \"lemon squeezy.\" Her response to me doing that was that it was going to be a time for me to get a bra soon because \"those things are really starting to pop out.\" It was a weird moment, yeah, but her response made me feel so affirmed.",
            "Yea apparently mine are bigger than my moms too thou shes always saying that as an insult so who knows",
            "congrats on the tits queen",
            "Both my mom and my grandma thought I had implants, lol",
            "I’ve gotten that from my sister for sure but I’ve still got a lil ways to go before I’m my mom’s size! With the way they’ve been growing though, that might actually be possible which is extremely exciting to me!!",
            "I'm bigger then all my friends by a lot, and most of them arnt what I would call small. Their avg sized so in the c-d range, and believe me they let me know.",
            "My daughter is mad I'm six months hrt and bigger than my cis daughter and she's 25"
        ]
    },
    "I knew coming out wouldn’t be easy. But this has just broken me": {
        "title": "I knew coming out wouldn’t be easy. But this has just broken me",
        "score": 79,
        "url": "https://www.reddit.com/r/MtF/comments/1dr2tis/i_knew_coming_out_wouldnt_be_easy_but_this_has/",
        "content": "I knew coming out wouldn’t be easy, but this has just broken me\n\nSorry for the rant and if this is the wrong place, I just have no one else to tell.\n\nI’m 29, amab, and about 6 months ago I came to the realisation that I’m trans, after years of just lying to myself that it’s just a kink and I can just indulge in private.\n\nAll 6 months I’ve been filled with guilt, not so much for who I am. But for the fact that I didn’t know how to tell my wife, the woman I love more than anything. Guilty that I had been hiding a part of me this big. \nThe guilt got even worse just over three months ago, when my wife gave me the best news in the world. We’re having a baby. But I just felt terrible that I was keeping this secret from her, and that guilt was really starting to interfere with the happiness in other parts of my life.\n\nLast Saturday was my 29th birthday, and at the end of the day I had finally found the courage to tell her what I’ve been feeling and going through.\nI’m not great with words but I eventually got it out, \nI told her how bad I felt and that I wish I’d have been able to tell her before she got pregnant, not because I wouldn’t want to have a baby, just m honestly so excited for that.But because it hurt me hiding it so long so long from her.\nShe misinterpreted what I had said. Thought I didn’t want this baby, she put her walls up, stopped talking, and then left.\nFor a bout two hours she didn’t come home, I ended up having the first panic attack of my life, I thought I’d ruined everything.\nShe came back just after midnight, I got her to open up and she told me how she thought I don’t want to have this baby.\nEventually we were able to clear up that miscommunication and that I just wanted her to know about his part of me, and we went to bed together.\n\nThe rest of the week was quiet as we didn’t see much of each other due to opposite work schedules. Thursday night we were able to have another long talk.\nWe were talking more about what I wanted, how far I wanted to go with this, it was hard for her because how sudden it felt, which I understand, I’ve had a long time to think about this, she hasn’t, and I want to give her all the time she needed.\nShe was worried that I might want to be with a man instead of her, which I told her is silly. I only want her.\nShe told me she’d miss her big strong man, which I understand, and that our child would need a strong father figure, which I feel like I can still be, after all I’ll still be the same person.\nBut she got quiet again and shut me out.\n\nFriday just broke me, barely a word to me after I got home.\nAfter a long time trying she finally started to talk, she told me her frustrations, that it was all so sudden, and that it felt like I always had answers ready to go for all the questions she had, which I did because I’ve thought about this non stop for months. And I am trying so hard to open myself up and be completely honest with her.\n\nAnd then she said it.\n\nShe hates that she’s pregnant now.\n\nIt broke me.\n\nI’m at a point where I have to choose between my wife, my family, my home, my whole life as it is, or being myself.\n\nI can’t make this choice, I can’t sacrifice everything.\nI can’t be that selfish. I can’t loose her.\n\nSo i have to put all this behind me somehow, move forward and find away to accept myself as I currently am, a man.\n\nI don’t know what to do.\n\nI’m broken.\n\n",
        "num_comments": 59,
        "comments": [
            "I can't imagine what it's like in your situation, that's really hard, and I'm sorry it's such a big weight to carry.  \n\n\n I know it probably feels like the walls are caving in on you, but based on what you've written here, you're jumping to conclusions. It's really hard for your wife right now, but has she said you need to choose between transitioning and her?  \n\n\n You said yourself that she's only had a small amount of time to think about things while you've had months. Give her that time, if you can. And give yourself some time, too. The best answers to tough situations are rarely simple, maybe you two can work out a gradual process that helps you both adjust.  \n\n\nIt's certainly possible she'll be completely opposed to it all, but if she's a good, caring partner, then she should want what makes you happy, too.  I wish you luck with this difficult process, and I hope you can find joy in transition like so many of us have.",
            "Répressing ur feelings is taking a debt with yourself and ur mental health.\nU'll have to pay it back it won't be fun.\nAlso chances are u'll be a bad parent whose values will base themself around self sacrifice for.loved ones comfort",
            "That's a really tough situation, and it's important to remember that you're not alone in feeling this way",
            "Give her time. A lot of it.\n\nIf you're okay with it, tell her she can have a say in how much happens and when. I realize you might _not_ be okay with this. But it also might be something that'll make her more comfortable while she processes. It'll also make her feel like ner needs are important too, and they are. In the end, it might not limit you after all. She could soften and be accepting.",
            "girl, this hurt to read I hope you're doing okay\n\nthe comment about \"missing her big strong man\" definitely stings. coming out can be distressing for our partners, my girlfriend who is pan was also similarly concerned about my sexuality changing, and admittedly we had a rough initial talk which was exacerbated by the fact she was in a different country at the time. we were able to work it out and are in a better spot now than we ever were previously.\n\na couple of things, I think you need to ask her if she can see herself being happy in a relationship with a woman, I think you need to ask yourself if she is the right person to support you, and if the answer to both those questions is an enthusiastic yes, couples therapy\n\nand well, I think you know what you need to do if that's not the case",
            "I did the same thing a long time ago, my partner and I were separated and ACA made it easier to get care (never felt I was enough under the old guidance that forced us to only fuck men to be valid) I had started dating someone that let me start exploring things and I researched it. \n\nWhen we reconciled I pushed it all down, and it destroyed me inside and made me a shit dad, who was struggling with alcohol and suicidal ideation. Once I got on hormones all that kinda just went away because I was finally accepting it and the hormones stopped a lot of the background anxiety and depression I had become accustomed to over my life.\n\nMy kiddo is better off with a loving mother over a dead father.",
            "I'm sorry for you. I have two kids, parenting is great. I came out to my wife recently and she wants a third. \n\nI'd politely remind you that families are different. You don't have to be a man to be a father figure. (I don't consider myself a mother).  My dad is gay, I had two dads in the later half of my childhood. Some families only have one parent. \n\nI bottled these feelings up for 7 years of my son's life. My dad tried to be straight for 14 years of my life. You can't deny who you are, it's been shown not to work or shown not to work. \n\nYou did the right thing coming out. The truth will set you free. It's not going to be easy, but keep working at it. \n\nI hope your wife can work through her issues and accept you.  Pregnancy hormones aren't going to make this easier on her.",
            "You seem to have r/translater problems.  We also have some things in common if you wanna chat. I might have some insight, but I don't want to offend you and post it publicly.",
            "Wow! That is a lot for you and your wife. I didn’t have a relationship when I began to come out and transition, but I did have a teen to explain it to. So I have it easier in so many ways and not at all the same experience. Please reach out to those here with similar experiences, scrolling through the comments it looks like you’ve made some new friends.\n\nIt also seems like from your description that she seems blindsided and you two may not be having the best communication right now. This is just a suggestion and it might not fit, but consider couple’s therapy and offer to slow down, let her catch up and make some smaller decisions together to start with - as you put it, you’ve thought about it for a long time, she hasn’t. This situation does not make you selfish or broken, but it does mean the two of you are not only not on the same page, you’re in different libraries looking at different books. Your situation is very tough, but not insurmountable. It’s going to require some healing and patience for and from both of you.",
            "Someone has to be honest so I’ll be it… I’m gonna defend your wife with this post; and it’s not because I want you to suffer or not be your true self but….. (seems like you already feel bad) \n\nThe timing was shitty as hell. I mean… she just told you about the child and was obviously happy… \n\nI tell people all the time- the moment you decide to transition- you yourself become the biggest priority in your own life for a time period. It takes so much out of you. You need to decide what’s the most important thing to you and if that’s your wife then You are going to have to make some choices."
        ]
    },
    "Bottomed for the first time last night": {
        "title": "Bottomed for the first time last night",
        "score": 1304,
        "url": "https://www.reddit.com/r/MtF/comments/1dqj4b0/bottomed_for_the_first_time_last_night/",
        "content": "So last night I went out to a bar with a FWB(also MtF), after we left we decided to get a little hot and heavy. she was touching me in all the right places and had me  grinding on top of her. I was going so crazy from how euphoric and sexy I felt that I just blurted out that I wanted her inside me, she happily obliged. Holy fuck it was one of the most euphoric experiences I have ever had in my two years transitioning to the point that I’m kicking myself for not trying it earlier! All in all I feel like I  definitely kicked off my Thursday evening/ Friday morning the right way\n",
        "num_comments": 36,
        "comments": [
            "Honestly, penetrative sex is one of the things that made me realize I wasn’t cis gendered. When you have the right partner it’s mind blowing.",
            "Wow, I'm just at work taking a quick mental break and I was reminded that I still have something down there because somehow I was so turned on by imagining what it must've been like that a natural reaction occurred 😆. Glad you had such a great experience girl. Now I guess you know other things you like in life 😏",
            "My GF fingered me for the first time in my life and it was both awkward and also the hottest thing I've done.",
            "I rode my fiancée cowgirl style with a strapon once before my egg cracked. I felt really feminine, and thinking back on it. It made me realize that feeling like a woman really made me feel amazing.",
            "Being on HRT and realizing how much I want this is not what I was expecting 🤭",
            "Real getting railed is peak euphoria like I know it probably comes from internalised misogyny but being dommed is the height of femininity for my brain for some reason",
            "I'm having this girl I've been seeing over tomorrow and things are probably going to go there, I've never tried it before though I've wanted to for a LONG time. Any uh.. tips i guess?",
            "I've never tried it, but now I want to 🤭",
            "Is it wrong to say, Yay!!! 😃 Very happy for you!",
            "Awful question. Please forgive. But how do you know you’ll be ‘clean’?\n\nI want that but I am too afraid of, ahem, a dirty stick sitch. So embarrassed to ask but if not here then where. Tips?"
        ]
    },
    "\"Sir'd\" for the first time in awhile...": {
        "title": "\"Sir'd\" for the first time in awhile...",
        "score": 321,
        "url": "https://www.reddit.com/r/MtF/comments/1dqr1tv/sird_for_the_first_time_in_awhile/",
        "content": "... and it did sting a bit, especially since it came from this otherwise very kind and cute dentist assistant who had just gotten done complimenting my dress and purse.\n\nBut what I decided to take from the experience was appreciating that I was more surprised than hurt. To know that I know I pass and to be treated as a woman 9/10 times in public to the point that I don't even expect to get misgendered anymore is lowkey nice.\n\nShe was also very apologetic and said it only happened because she was super tired and hadn't been able to have her caffeine this morning and, y'know, fair.\n\nShe also went on to compliment even more of my fashion choices and suggested she might want me to be her shopping buddy in the future, so that's kinda neat!",
        "num_comments": 12,
        "comments": [
            "Glad she's cool, though. I think this is something transphobes don't get. If you misgender someone, but you recognize your mistake and don't act like a total douche when you're corrected, the entire interaction usually ends positively. \n\nI hope you get that new shopping buddy 😂",
            "That's sweet that they immediately tried to correct. Hate it had to happen in the first place :/",
            "That sucks. Sorry it happened. Happy you have such a positive takeaway from it.",
            "Wait she sir’d you ? Because she was tired 🤨 shady is my answer",
            "Gauging gender is very subconscious and fast. It sucks when it happens but ppl just perceive and act on it.",
            "Yeah, she was super cool. I didn't even have to correct her. She saw my eyebrows shoot up in surprise and immediately caught herself. She clearly felt bad and apologized like 5 times. 😆",
            "She was looking at her clipboard when she said it. My hope is that she just saw my legal name on the paperwork and defaulted to sir because of it due to sleepy brain. It's also possible I was speaking in a lower register than normal and/or didn't look my best, as the day before had been pretty rough for me and I was still pretty blegh in the morning.",
            "It could be something as simple like her voice tripping the dental assistant up. I hate that we have to conform to cishet expectations of gender but at the same time, I can also understand someone slipping up accidentally. Especially since they corrected themselves immediately.",
            "That's so sweet of her!",
            "I’ve had people call me any gender even before realizing it for myself - I’d have people in the store say ma’am and then correct, and vice versa, and even when being mostly masculine presenting but having long, well taken care of hair at a lunch with my mom and sister got included as “what do you girls want,” and then moving from there.\n\nSo I guess what I’m saying is the human brain takes a lot of short cuts and fills in the blanks based on prior encounters.\n\nSo very easy for someone to misgender based on the equivalent of seeing a group of people or you “using the peripherals.” And no other data. Totally can see someone routinely going through charts seeing certain things and Siring and going oh shit and it being truly genuine.\n\nBut, then again, I’ve been gendered both ways by people for as long as I can remember. I have some friends who are very straight, very stereotypical masculine and they were always confused by how I acted and presented and thought that something might be wrong - which I view as them trying to make sure their buddy is okay because that’s how they mean it - as narrow sighted as their overall view might be.\n\nThey’d always tell me how to attract someone (to them cis woman), and I’d always go “i appreciate what you’re trying to do, but the person I attract and want to attract is very different from who is attracted to you - so we’re going for different things, and I’m doing what I’m doing because the person who I want to attract loves this that I’m (doing/beings/wearing/presenting etc).\n\nI remember once saying “some of the hottest women I’ve ever seen were trans women in Tokyo” and they usually think I’m being weird or not seeing something and I just go “well, then you haven’t met enough or realized who you were flirting with was trans,” to recognize that you can be perfectly straight cis male and be attracted to a trans woman and still maintain your “straightness,” because you’re still attracted to a woman.\n\nBut that’s very strange for most people. Their brains just literally can’t comprehend it:”."
        ]
    }
}