{
    "Community feedback post - come talk about your ideas!": {
        "title": "Community feedback post - come talk about your ideas!",
        "score": 10,
        "url": "https://www.reddit.com/r/mtg/comments/1dh55u0/community_feedback_post_come_talk_about_your_ideas/",
        "content": "Hi everyone!\n\nLet me introduce myself: I'm a new mod.\n\nAnyways, now that this is out of the way let's get to business. There was recently a call for moderator action. This got us thinking about what the community needs and wants. There are currently three principles that we follow:\n\n1. No violating Reddit's Terms of Service or sitewide rules\n2. No content that is not Magic-related\n3. Team has as little involvement as possible\\*\n\nThese three principles will stay. The sub will remain as open as possible. We can build on top of these. There are other subs that have stricter rules \\[enforcement\\] and if that is more your cup of tea we suggest you try those subs out, too!\n\nHowever! As mentioned before there was a call for more involvement from the team. This is where you come in: \n\n# What would you like to see the team do?\n\nGeneral discussion, concepts and guidelines, please. Keep real life examples to a minimum in order to avoid needlessly going on unrelated tangents. This post is *not* intended to be a political forum, rather, a brainstorming session.\n\nWe wish to retain the open atmosphere here, which means there won't be strict rules nor will there be strict rules enforcement. This doesn't mean we let the sub go haywire. This does, however, mean that the power is yours! Reddit's guidelines suggest that downvoting is intended as a tool to hide irrelevant information. It's widely used as a sign of disagreement but remember that if a post or a comment gets enough downvotes it gets hidden. Use this to your advantage.\n\nMost egregious cases that aren't caught by the extensive filters we have in place should still be obviously reported. On top of that you're also always welcome to approach us via modmail. (There's currently a bit of backlog so bear with us.)\n\nThank you for reading and looking forward to your opinions and ideas!",
        "num_comments": 39,
        "comments": [
            "Please top level comment your favourite Magic-subs here!",
            "All new mods should make a post about their nice new pulls from their most recent box opening to summon this subs resident spooky man and let him know you in fact did not draft the cards with friends. They're apparently dangerous, so be sure to bring a helmet.",
            "The vast majority of posters here want a certain user to stop posting their repetitive spam messages regarding limited play. \n\nIf those messages were the sum total of their contribution to the subreddit, I don’t think we would have an issue. Unfortunately, their aggressive and hostile demeanor to honest correction, open debate, and constructive criticism is tantamount to harassment. \n\nThe moderators need to have a conversation with them about his contributions to this community. I would love for the user in question to share draft resources, deck building tips, and ways to play limited in threads that don’t involve someone posting their play booster pulls and don’t target specific individuals with judgment and insults. \n\nMy read from this post is that you’re not planning on taking any action on this, however. You’re not going to get much buy in from this community for your “we want to run an unmoderated subreddit” approach, whatever supposed principles you use to justify it.",
            "Just out of curiosity, what separates this mod team from r/Freemagic\n\nThey are both low moderation subs, but they have very very distinct cultures. Is this just based on the users, or is there a different moderation philosophy. I’ve always been curious about why this huge difference exists",
            "This sub doesnt have a purpose. There is already the Main sub, joke subs, card pull subs, subs for each format, proxy subs, custom card subs and rules subs.\n\nWithout rules and mods on this sub its descended into a pretty crap sub full of low effort posts and the same questions day in and day out most of which could be found with a 2 second google search.\n\nThe only thing this sub has is a better name and the drinking game I created",
            "I think it's funny that a whole new mod had to be brought to this sub just because the other two mods were too lazy to just ban a user causing problems.",
            "1. How about a sidebar, with maybe like *a rule at all of any kind whatsoever*. Some FAQs? Links to resources? \n\n2. Post flair and user flair. \n\n3. Daily/weekly posts for things like FAQs, rules questions, community engagement/creator spotlights.",
            "a major sidebar update would be helpful.",
            "It does seem that a lot of people offer their opinions or rather judgements about many questions. These can often be patronising, non-constructive, and may push people away from the mtg community in general.\n\nNew players should always be encouraged and helped in every way possible, and as new players, they may not know about the best ways to find rulings, interactions, card searches, etc.\n\nRemember, we were all new to the game at one point or another, and without patience and help from more experienced and knowledgeable players, we may not still love this crazy cardboard game.",
            "Remove any post for good pulls and put them in one long thread.\nSame with deck building advice and ruling questions."
        ]
    },
    "Is this real my eyes are terrible ": {
        "title": "Is this real my eyes are terrible ",
        "score": 461,
        "url": "https://www.reddit.com/gallery/1dlh8nu",
        "content": "traded a fetch for it did I get scammed",
        "num_comments": 99,
        "comments": [
            "I don't know how to tell if it is.... but it's in really good shape for it's age if it is real.",
            "Show us the back zoom in like that on the T in the word The",
            "My revised tutor looked this nice. Came from the lgs. Hope it isn't fake.",
            "It's real, offset is correct as well as mana symbols, rosettes and color separation",
            "It looks just like mine. Played but crispy",
            "Just based on these pics, it looks legit to me. However a close-up of the green dot and the first T in \"The Gathering\" are better ways to tell.",
            "Looks right to me. I mean it's DT, one of the most well printed old cards. That looks exactly like my Demonic Tutor, and mines legit.\n\nSo you're good!",
            "Im no expert at spotting fake cards but I was playing when revised was still a new set and it looks fine to me",
            "“take it into your hand” sounds… erotic?",
            "Definitely a fake, no way Wizards made something like this. This card is WAY too powerful."
        ]
    },
    "This works right": {
        "title": "This works right",
        "score": 42,
        "url": "https://www.reddit.com/gallery/1dlu267",
        "content": "Still relatively new, so I'm unsure how etb triggers happening around the same time work. If I use Shingengars resurrect ability, would thief of blood remove the finality counters from all the resurrected creatures if he's also resurrected by the ability ",
        "num_comments": 16,
        "comments": [
            "No, but if I'm not mistaken [[Solemnity]] would work",
            "No it'd enter at the same time not after the others. So they all enter with a finality counter. Unless of course you cast the card after activation of Shilgengar ability",
            "if you were reanimating thief of blood with shilgengars activated ability, i dont think it would work since every other thing you could reanimate with a finality counter on it would ETB at the same time as Thief of Blood, meaning there is no one to target for its etb. however you can absolutely remove finality counters if there are already some on the field with thief of blood",
            "As others have said it doesnt....but Note that the key is the wording \"as thief...enters\" rather than \"when thief enters....\" making it not a triggered ability.  If it were a triggered ability it'd work how you want.",
            "I think it'll work. I may be wrong about how stacks work's but the demon brings things from the graveyard \"with\" a finality counter. Meaning before ETB. Therefore, after your vampire enters, it's ETB will resolve afterwards removing the finality counters from permanents which they came in with before.",
            "“This works right” is a sentence. As in, look at this combo that works correctly. \n\n\n“This works, right?” Is the question you wanted to ask.",
            "It would enter with the counter on it, his etb would resolve and then you could remove the counter.\n\nEdti: it's not an etb it's a replacement so no it wouldn't work",
            "I'm a little unsure by your wording, but if you're asking if they would remove finality counters when they themselves get resurrected, then yes. They enter, the ability triggers, SBA checks counters, Resolve.",
            "[Solemnity](https://cards.scryfall.io/normal/front/0/a/0a71fb62-acbd-49f5-842f-0fc9fa48afea.jpg?1562788659) - [(G)](http://gatherer.wizards.com/Pages/Card/Details.aspx?name=Solemnity) [(SF)](https://scryfall.com/card/hou/22/solemnity?utm_source=mtgcardfetcher) [(txt)](https://api.scryfall.com/cards/0a71fb62-acbd-49f5-842f-0fc9fa48afea?utm_source=mtgcardfetcher&format=text)\n\n^^^[[cardname]] ^^^or ^^^[[cardname|SET]] ^^^to ^^^call",
            "For further clarification: if it was worded \"when cardname enters\" it would work because it would cause a trigger to go on the stack after all the creatures enter. But because it's an \"as cardname enters\" it just happens before any creatures even hit the battlefield."
        ]
    },
    "Can you guys guess my favorite Planeswalker?": {
        "title": "Can you guys guess my favorite Planeswalker?",
        "score": 65,
        "url": "https://i.redd.it/e8bsnoqv638d1.jpeg",
        "content": "I finally completed my collection and wanted to share. ",
        "num_comments": 79,
        "comments": [
            "Is it Jace?",
            "IT'S PIKACHUUUUUU!!!!!",
            "It is Gideon, because he sacrificed himself for THAT BITCH.\n\nAlso what is Professor Onyx doing there? She is clearly unrelated.",
            "Judging by the cards shown definitely Niko Aris.",
            "I can't. There is way too much Liliana so I can't tell you this is Angrath. Sorry.",
            "Garruk?",
            "So many Liliana’s but that’s not even all of them",
            "Must be Ajani!",
            "Definitely Chandra",
            "You. You are the planeswalker..."
        ]
    },
    "This Common has a 67% Win Rate in Hand in Limited…": {
        "title": "This Common has a 67% Win Rate in Hand in Limited…",
        "score": 504,
        "url": "https://i.redd.it/el79e4dbgy7d1.jpeg",
        "content": "It’s no surprise that this card was going to be great in limited, but after a week and a half of data, 17 lands has this card credited with a 67% in hand win rate.\n\nThat is unprecedented from any common ever published across MTG’s history, and I’ve been on the wrong side of many draft matches with this one. Doesn’t feel great!\n\nIt’s officially in my can’t pass list and must draft (splash if I can), as it’s only outperformed by 2 rares in the entire MH3 set.\n\n[Here’s my most recent trophy 🏆 draft where I fortunately had 3 of these suckers. Check it out if you can, but let me know what you think about Chrys and the format in general?](https://youtu.be/HKoSuXF01tU?si=6WQstBeHScGTze9R)\n\nI’m giving MH3 a 7/10 and wish the Eldrazi decks weren’t so overly supported.\n\n",
        "num_comments": 57,
        "comments": [
            "Passed an Emrakul in p3p1 for a third Writhing Chrysalis and went 7-0 lmao",
            "What's so good about it? It's just a two-mana 4/5 reach! Wait, never mind - answered my own question.",
            "Nice to know I'm the 33%",
            "Hehe ramp + big body go brrrrrr",
            "I drafted two [[Genku, Future Shaper]] in one draft and still had to struggle against a single copy of this bastard.",
            "I'm confused and only recently returning after like a 15 year break, does limited format not have [[terror]] or some equivalent?",
            "Mythic common, this thing and \\[\\[Kozilek's Unsealing\\]\\] are amazing together",
            "My w/r with this guy isn't great. Do you play him, then sac the spawn for mana the next turn to get a 7 drop or whatever out?",
            "Well yeah. I played a dude tonight who went infinite with basking broodscale and Rosie cotton. Made 100k spawns and put 100k counters on the lizard.  If he’d had this card and it didn’t have summoning sickness someone would have died on the spot.",
            "The hard on from outer space, my girlfriend says 🤣\n\nShe said it looked like if Thanos used the reality stone an fucked up his dick by accident."
        ]
    }
}