{
    "Things to look out for this weekend!": {
        "title": "Things to look out for this weekend!",
        "score": 10,
        "url": "https://www.reddit.com/r/mtgfinance/comments/1dqamwh/things_to_look_out_for_this_weekend/",
        "content": "What should we be trading for? What should we be trading away? What cards or events should I have my eye on? Also feel free to use this space to discuss anything MTG Finance related.",
        "num_comments": 45,
        "comments": [
            "I'm following most reserved list and it looks like [[Lake of the Dead]] is gaining traction again thanks to The Necrobloom.",
            "Wrath of the skies being bought out. Its a 4 of in most new modern control decks.",
            "Hoping Nadu does well so Shuko spikes back up and people at my LGS want to trade for it or CK opens their buy list for it again.",
            "Eli Kassis registered bant nadu and not the stupid echo of eons deck some of you speculated on cards from his tweet",
            "The one ring going WAY up",
            "They're planning a Jumpstart 2025 product. Apparently a website leaked the details and then took it down. So not 100%, but seems likely\n\n[https://www.thegamecollection.net/magic-the-gathering-jumpstart-2025-2booster-pack](https://www.thegamecollection.net/magic-the-gathering-jumpstart-2025-2booster-pack) (page is gone now)\n\nRelease Date: November 15, 2024",
            "If you are decent at Limited, the Arena Direct event this weekend can be great EV. It’s 5000 gems ($25) to enter, and going 6-1 or 6-0 gets you a MH3 Play Booster Box. (5 wins get you your entry of 5000 gems back, and 4 wins gets you a partial entry back at 2000 gems). TCG Low on MH3 Play Booster boxes is $245, so you can take multiple shots and still keep the event positive EV if you have some Limited skills. See y’all in the queues!",
            "Nadu 100% getting banned after this tournament.",
            "Metric ton of spoilers for dusk dropped before we even get bloom lmao. Also a extra standard set that with be legal till 2029. Archenemy is back.",
            "[[Suncleanser]] foil buyout. Also people are buying stacks of normals. Going to dig my bulk and hope I didn't sell my 1 foil from years ago lol."
        ]
    },
    "Thank you Amazon scammer": {
        "title": "Thank you Amazon scammer",
        "score": 124,
        "url": "https://www.reddit.com/gallery/1dqverm",
        "content": "",
        "num_comments": 48,
        "comments": [
            "If I am following, someone created a fake listing, Amazon price matched, and OP saved almost 500 bucks across the case?",
            "Casually just buying 2k in cardboard crack damn",
            "I did not buy from AMMON but Amazon did briefly price match their scam listing. These came in today and everything checked out.",
            "How do you get Amazon to price match things? ",
            "nice calculator",
            "just a months rent on cardboard. no big deal.",
            "Yeah, currently waiting on the refund process because I fell for the scam. Unbelievable Amazon is making people return to get the refund, especially because it was a cheap ice cream scoop.",
            "Dang, lucky you! I did order from Ammon and I still have to deal with returning these damn makeup pads. ",
            "Damnit, they must have gone fast. I have a price alert bot and it didn't pick up on this.",
            "I luckily caught the legit one last Saturday on a whim. Unfortunately no good pulls but still felt good to get one over on the man."
        ]
    },
    "The One Ring soon to be $100": {
        "title": "The One Ring soon to be $100",
        "score": 47,
        "url": "https://www.reddit.com/r/mtgfinance/comments/1dqz96r/the_one_ring_soon_to_be_100/",
        "content": "Made a post on this today, wanted to add more to it, there are only 17 total available under $100 on tcgplayer. This is the bundle version\n\n56 have sold today, what’s the roof on this card?\nFor those who have copies available, when would be the best time to sell?",
        "num_comments": 50,
        "comments": [
            "Buy high never sell",
            "I have a feeling WotC has SOME sort of plan to reprint The One Ring. They know it’s one of the most hyped cards in the past few years. They’re seeing people talk about wanting to get copies and they know they can put it into something as a juicy reprint.",
            "Can someone confirm if this is real or crazy; My lgs have normal lotr bundles on sale for $82 usd each but the bundle One Ring is $90 on CK\n\nDo I just like buy some bundles now?",
            "Safe get to buy now if you want one in the next 4-5 years imo. It’s a staple in every single commander deck. Even if it’s banned in modern it will hold high value.",
            "Posted that the bundle version was available for 66aud (Australia) on eBay on the other post... It got bought. \n\nCheapest bundle version is now 72aud.(Edit: there's 2x available for less than $70) (Edit2: Cheapest is now 78.5aud, lol)",
            "Surge Foil Extended Art is the best version of this card if you really want to capitalize on the future growth. This card is going places.\n\nAlso, reprint be damned. Won't hurt the price much if it happens, but i actually don't think it will. there's a ton of other lore to print, and variations of The One Ring are more likely than clones.",
            "Will this change the price of the Borderless Poster Art One Ring from the Holiday Edition Collectors Box?",
            "Sell as soon as you feel comfortable locking in your profits.\n\nIf your concern is that it will catch a ban... there seem to be plenty of decks that don't play it in modern and the meta of the PT looks pretty healthy.  The question is \"How and when is WotC going to reprint it?\"",
            "I'm glad I bought my foil scroll one a few weeks ago",
            "Glad I got a gift bundle for $140 shipped last week. Also came with orcish bow masters. \n\nI almost crod.\n\nFuck it, bought another a LTR regular bundle for $133 shipped."
        ]
    },
    "Is Swarmyard going to rise with Bloomburrow?": {
        "title": "Is Swarmyard going to rise with Bloomburrow?",
        "score": 5,
        "url": "https://www.reddit.com/gallery/1dr5b3x",
        "content": "Idk if it’s been announced as a reprint, but is there any chance this card sees a reasonable spike after Bloomburrow releases and these creature types gain support? ",
        "num_comments": 7,
        "comments": [
            "Holding my breath for the pre-con reprint, to be honest.",
            "Already missed it + likely reprint + decent amount in circulation",
            "nah, and even if all the penny stock speculators from 2 years ago holding the huge piles will squash the price :D",
            "Looks like it already has. \n\nWill probably be reprinted if not get some special Art treatment or a Secret Lair bonus slot.",
            "If it doesn't get reprinted in the set I'll eat Werner Herzog's other leather shoe.",
            "Unlikely to be on arena if there is no regent logic. Can be all of the precons though. Or secret lair even more likely",
            "That’s exactly what’ll happen."
        ]
    },
    "Anecdotal Data from a Buyer’s Perspective": {
        "title": "Anecdotal Data from a Buyer’s Perspective",
        "score": 29,
        "url": "https://i.redd.it/dmqv9mjwoc9d1.jpeg",
        "content": "Hello! I know there are a lot of sellers on here, and I wanted to share some data I have complied of my most recent purchases through TCGplayer. \n\nMy goal was to see if there were any common denominators between sellers with which I had discrepancies regarding my order. So far, I don’t believe I have found any. Once I made this little chart, I thought I would share it to share my perspective as a buyer. Whenever a card is missing from an order or the order is seemingly lost in the mail, I now have anxiety about messaging sellers because of some expressed sentiments I’ve read of sellers dealing with an influx of messages from buyers having similar issues and suspecting they are scammers. \nMy order history going further back than my most recent purchase has an arguably worst discrepancy ratio. One purchase, consisting of 11 shops, had 2 orders not have a card and 2 orders never showed up (I’d prefer a single card missing to the entire order missing). \n\nUltimately, I wanted to share this little spreadsheet, from the viewpoint of a buyer who sends a lot of “missing from order” and “where is my order” messages in earnest- and sincerely wishes I didn’t have to. I really have no financial incentive to get pennies refunded back to my credit card and whenever an order doesn’t come in, I always try to ask for any possibility to get the cards over a refund (same with missing cards but most sellers prefer to just refund the cost of the card, which I don’t necessarily fault them for). I have been very appreciative of the sellers who have communicated kindly with me, and I hope they don’t think I am being dishonest as result of an increasing amount of buyers claiming orders are going missing. \n________________________\n\n\nOkay! On to the data!\nI placed one order for:\n- 406 cards totaling $109.28 \n- On May 28th. \n(I optimize my own cart over a period of days to achieve better savings, it is a painstaking process, but one I treat with care for such a large order).\n\n- 15 sellers were in this one order, all of which are certified with TCGplayer and have 99 to 100 positive feedback\n- the sellers were blurred because I do not want to promote any negativity to any one seller\n- I am located in Louisiana for reference as distance from the other states (trying to see if further away means longer shipping times or not)\n- I forgot to add the number of cards in each order and had to draw it in (sorry)\n\nPlease let me know if any of this data is helpful or useful in any way. Also *please let me know if there is any other data you would be interested in seeing* like if I had ordered from them before, how long they took to respond to a message, the types of cards missing, etc. :)",
        "num_comments": 26,
        "comments": [
            "The guy who sold 136 cards for $8 and had it track it needs to rethink his business/time.",
            "Your not doing anything wrong by ordering cards that a store has for sale.  Don't let these buffoons try to tell you that certain $$ amount cards are a different priority for sellers.  The priority is to move cards from Sellers hands into Buyers hands! Of course cards that require tracking require a little more packing and shipping care, but if it's listed for sale in a store, it gets the same care as any other card in the store.",
            "God, I wish someone would clear 130+ cards from my stock at once",
            "I have a little whitelist/blacklist going myself for sellers that I really wish I could send to them. I do this sometimes as well, where I will do a bulk order of a couple hundred dollars across 3-5 sellers. Almost every time, most of the sellers are prompt and the packages arrive on time and then there's one dumbass that takes 3+ weeks longer to ship than everyone else. Almost a guarantee they immediately marked the order \"shipped\" but it doesn't get picked up for two more weeks, why is this a super common thing it should be reportable. I just want to tell these sellers \"you guys do realize EVERYONE else has set standards that you are failing miserably to meet, maybe work on that?\"",
            "I think you're data will be skewed by having such low dollar amounts and such high number of cards per order. \n\nLike one of those lines shows you paid $6 for 50 cards. I'd roll my eyes and not care much about that order as a seller too. \n\nIf you buy enough that the package is tracked the person packing the order will care more. I didn't have any problems in my mg3 orders.",
            "He legit had to because of the sheer weight and size of that many cards. The smallest cost there is $4.79 for a bubble mailer print at home shop from USPS/paypal",
            "I really don't get when sellers take days to send cards out. I get all of my orders out same day, unless they need tracking and the PO is closed. Every order gets treated the same. It's first one in, first one out. All of my stuff listed is categorized and organized for easy pick and ship. NO ONE has any excuse for bad customer service on this platform. Of course, emergencies happen. That's when a simple message to the buyer explaining that one has happened is necessary.",
            "The real value to me when I’m selling is the possibility of a positive review and that isn’t at all influenced by the price of the card so I always  make sure to ship cads with care no matter the price.",
            "Exactly. When i saw 406 cards totaling $109 i vomited a little bit. But thats not my problem because i dont sell that kind of stuff",
            "Let me take a look. What’s the TCGplayer account?"
        ]
    }
}