{
    "Mumbai Social Club - Weekly Discussion Thread - Meetups/Q&A/Relationships/Life": {
        "title": "Mumbai Social Club - Weekly Discussion Thread - Meetups/Q&A/Relationships/Life",
        "score": 11,
        "url": "https://www.reddit.com/r/mumbai/comments/1dqa23n/mumbai_social_club_weekly_discussion_thread/",
        "content": "Hey, how is it going?\n\nWant to share your success? Need to vent? Looking for a date or a friend or a group of friends for some activity? Found a new restaurant? Or just want to talk about the rising prices of vadapav?\n\nThis weekly discussion thread is posted every Friday morning at 9 am\n\nRules: No politics. Be civil.\n\nAny separate threads regarding looking for friends / meetups / hangouts will be removed.\n\n\\-----------------\n\n[*Previous Threads*](https://www.reddit.com/r/mumbai/search/?q=%22Mumbai%20Social%20Club%22&restrict_sr=1&sr_nsfw=&sort=new)",
        "num_comments": 33,
        "comments": [
            "I’ve been rediscovering Mumbai by attending (free) dance events & poetry readings at NCPA, (free) French movie screenings at Theosophy Hall, (free) Swedish movie screenings followed by a discussion at Bhau Daji Lad museum, plays & stage-talks at Prithvi Theatre. \n\nLoving it so far ✨",
            "There was a post a few days ago by a person seeking urgent help as his brother had gone missing. \n\nHowever, given the Mumbai sub doesn’t upload any posts instantly, there was a delay in the message reaching to those people who could help. And in such cases, delay can lead to tragedy \n\nHence, I have created r/MumbaiAlerts sub for such situations in Mumbai. \n\nIf you require any urgent help or want to caution Mumbaikars about floods or incidents, you can post it there",
            "What happened to the reddit meetups. \nLast big meetup was in 2022 i guess\n\nIt’s been 2 years now \nWe should organise again Maybe",
            "Nm. Mad tired from the grind 🥹🙏",
            "aur bhai log, what weekend plans?",
            "This week episode of the boys might be the funniest",
            "Anyone up for Deadmau5 concert in Mumbai?",
            "Does the Telugu version of Kalki have eng subs?",
            "For anyone who wants to read with fellow book readers, there are these silent reading communities across mumbai, some of you might be aware of it. \nYou can check this [comment](https://www.reddit.com/r/mumbaimeetups/s/lbKiRhCvrR)",
            "Anyone has experience buying from Indiamart?"
        ]
    },
    "Got too high electricity bill don’t know how": {
        "title": "Got too high electricity bill don’t know how",
        "score": 456,
        "url": "https://i.redd.it/e7j6xtaowc9d1.jpeg",
        "content": "My electricity bill came today it was too high ( 65k) , don’t know how it came this high ",
        "num_comments": 146,
        "comments": [
            "ac k jaga turbines chalaya kya bro😭😂",
            "Ai zhavli 65k",
            "Bro is mining Bitcoins lol?!",
            "Need more information man .... How much is it normally, your usage, appliances at home, etc ...",
            "I think someone is stealing your house’s electricity. I think some 1 kilowatt power line connection is somehow made to your house’s main connection and it is sucking electricity like hell.",
            "Guys mere ghar pe 19k aaya, ma ne gaaliya barsa di😭😭😭",
            "Go to your nearest electricity substation and get them to check again at the physical meter. \n\nThis month we got a bill of 37k but after getting it checked, it came out to 15k only (which is what we were expecting)\n\nYou might have to run again and again or maybe bribe the person there to get it rechecked though",
            "Consumer court",
            "https://preview.redd.it/tz4imbyqtd9d1.jpeg?width=524&format=pjpg&auto=webp&s=773fada661998d4cb6097bda8ad59e173e270f15",
            "Last two months have seen fights in families because of the x2 x3 electricity bill."
        ]
    },
    "Cloudy affair at the Marine Drive 🌫️": {
        "title": "Cloudy affair at the Marine Drive 🌫️",
        "score": 57,
        "url": "https://i.redd.it/snv0bljlhf9d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "wow"
        ]
    },
    "Why is it so hard to make friends? ": {
        "title": "Why is it so hard to make friends? ",
        "score": 290,
        "url": "https://www.reddit.com/r/mumbai/comments/1dql03k/why_is_it_so_hard_to_make_friends/",
        "content": "I've (F23) been living in Mumbai for a few years now and I've obviously made a few friends here but not close friends. \n\nThey all feel like acquaintances and just like casual friends and they've also been ALL male....the one thing I miss deeply are my girlfriends, sleepovers and just that relatabilty as a woman. Don't get me wrong, grateful for all the people I do know but I feel like I've not met one girl who just wanted to be my friend as well. And I'm not a pick me girl or a bad person guys (before you all jump to conclusions) \n\nMumbai is a friendly place but to find that deep, meaningful connection is hard. Especially with women. And honestly, all I want to do and have wanted to do for the last so many weeks is to go to a bar, talk about LITERALLY anything and have a comforting sleepover with my girfriends....\n\nThanks for listening to my rant if you made it through lol\n\nEDIT: Men, please stop bombarding my dms...the purpose was to make FEMALE friends...now who do I talk about this too?! ",
        "num_comments": 191,
        "comments": [
            "Wait till you hit 30 years",
            "I am new in Mumbai too and I sense the same. It's easy to make casual friends but beyond that people are not keen on investing in friendship. A similar detachment is felt by me. Solid friendships are hard to foster as we age.",
            "I am also from out of mumbai, and i do have great set of friends. But I think its my negligence and my lack of initiation or communication that’s hampered my closeness with those people. I realised it quite late.",
            "I think it also has to do with our age? I am 25M from Mumbai, born and bought up here … tried to be really close friends with people who come to Mumbai for work/study but it just doesn’t work out. \n\nPeople love to hangout/go clubbing or dinner plans with people who are more accessible and around them over someone in another corner of the city. However good this other person maybe as a person and friend, accessibly and having your own space plays major role.\n\nPlus like I started, very difficult to feel that deep connection and love for a friend at this age and beyond. Not impossible, but difficult…because we have learnt to be nice over being completely real.",
            "RIP Inbox",
            "It's a bitter truth but true friendships are mostly made during our childhood and teenage years when we are still shielded from the vices of the world. \n\nI am not saying you won't be able to make genuine friendship now but do keep this in mind.",
            "It hurts to not have deep meaningful female friendships. I cannot remember the last time I truly opened up to a girl. I have always been a borderline autist girl so shits hard. So is maintaining older friendships as work starts to take up space, but you gotta make effort. I do like to compliment women in public casually and they take it really well. If someone did that to me, I'd cry.",
            "Idhar friends nahi h ,male female too dur ki baat 🫠",
            "I'm assuming you are from out of town and weren't raised here. The locals will never accept you, an outsider, as their own. I'm not sure why this is but it just is. Most OG Mumbaikars tend to not stray too far from their own social groups that they have built over time ie. building, school, JC, undergrad etc. They become too familiar with each other and then letting new people into their life is not on their agenda any longer.\n\nApart from that you're still young so you and your peers still have time to spare to socialize but once everyone gets older and things like partners/spouses, jobs, in-laws, kids come into the picture you can say byebye to your social life (unless you start a family of your own and befriend other married folks). I would suggest getting on dating apps and maybe investing in a relationship with a local if possible and then intermingle with their social group and make friends with their friends.\n\nDon't feel bad if anything I personally find it liberating as a social group can be burdensome sometimes, and I enjoy the freedom it brings me. Mumbai is one of the few cities in the country where you can do just about any activity by yourself and pretty much no one will judge you for it.",
            "Never too late to make new, deep connections. I’ve found good friends at work, recreational activities I’ve been on. \n\nIt all depends on what you like, there are many things you could do over the weekend which exposes you to more people - running, cycling, pottery, wine tasting, dj classes? What ever you like, there would be others like you. \n\nGo out, have fun, maybe you make a friend or two doing it! Maybe you don’t, but you still went out, tried and had fun while doing so ☺️"
        ]
    },
    "Monsoons in Mumbai": {
        "title": "Monsoons in Mumbai",
        "score": 18,
        "url": "https://i.redd.it/mh4fhzr6jf9d1.jpeg",
        "content": "The beauty of the backdrop against clean roads. Gotta love monsoons!",
        "num_comments": 0,
        "comments": []
    }
}