{
    "Mumbai Social Club - Weekly Discussion Thread - Meetups/Q&A/Relationships/Life": {
        "title": "Mumbai Social Club - Weekly Discussion Thread - Meetups/Q&A/Relationships/Life",
        "score": 10,
        "url": "https://www.reddit.com/r/mumbai/comments/1dqa23n/mumbai_social_club_weekly_discussion_thread/",
        "content": "Hey, how is it going?\n\nWant to share your success? Need to vent? Looking for a date or a friend or a group of friends for some activity? Found a new restaurant? Or just want to talk about the rising prices of vadapav?\n\nThis weekly discussion thread is posted every Friday morning at 9 am\n\nRules: No politics. Be civil.\n\nAny separate threads regarding looking for friends / meetups / hangouts will be removed.\n\n\\-----------------\n\n[*Previous Threads*](https://www.reddit.com/r/mumbai/search/?q=%22Mumbai%20Social%20Club%22&restrict_sr=1&sr_nsfw=&sort=new)",
        "num_comments": 33,
        "comments": [
            "I’ve been rediscovering Mumbai by attending (free) dance events & poetry readings at NCPA, (free) French movie screenings at Theosophy Hall, (free) Swedish movie screenings followed by a discussion at Bhau Daji Lad museum, plays & stage-talks at Prithvi Theatre. \n\nLoving it so far ✨",
            "Nm. Mad tired from the grind 🥹🙏",
            "aur bhai log, what weekend plans?",
            "This week episode of the boys might be the funniest",
            "Anyone up for Deadmau5 concert in Mumbai?",
            "Does the Telugu version of Kalki have eng subs?",
            "Anyone has experience buying from Indiamart?",
            "Learnt new things about life this month. Lost some friends. Lost some opportunities. People are temporary guys. Never think high of anyone. One day they'll celebrate you, next day you'll be non-existent to them. I am slowly realizing why my father had little to no real friends. Competition sucks.",
            "Where can I meet girls",
            "how far do you have to travel for these?"
        ]
    },
    "Please stay away from Dr. Shiraz Vazifdar in Bandra": {
        "title": "Please stay away from Dr. Shiraz Vazifdar in Bandra",
        "score": 592,
        "url": "https://www.reddit.com/r/mumbai/comments/1dr68fn/please_stay_away_from_dr_shiraz_vazifdar_in_bandra/",
        "content": "She's extremely rude and makes offensive remarks on the body despite being a doctor. The pap smear was extremely painful and charged me 4k for the test to just collect the sample. The testing of the sample required another payment of 4k. A simple test cost me around 8k.\n\nAnother doctor I visited next time, charged me barely 2k for the whole procedure.\n\nEvil is the word I would use to describe this lady.\n\nI am posting the review because her name is mentioned in that excel sheet of safe and non-judgemental doctors going around on the internet. And I know many of us looking for non-judgemental gynaecs but this lady is from it.",
        "num_comments": 74,
        "comments": [
            "Leave a review on Google and other website where she is listed.",
            "Alternate gynaecologist who’s amazing: Ami Mehta, Surya Hospital!! Pap smear was painful tho but she’s such an amazing doctor and so so helpful and non judgmental!",
            "Add Dr. Anand Utture, urologist",
            "This is a good idea. Docs are conscious of their image online.",
            "Pap smears, in general, are painful, but holy crap ₹8000 is just beyond ridiculous",
            "If you're interested in an alternative gynaecologist I'd highly recommend Dr Kiran Coelho.",
            "I can reccomend Dr Gayatri Rao, at That's women's hospital too. Quite good and non judgemental",
            "Medical bills should treat patients not their egos!!! We should document a list of these guys to save others from the terrible exercise. The tests you mentioned don't even cost a few hundred bucks... saying this cause I sell diagnostic kits to medical professionals :)",
            "What a rip-off. The lab I used to work at used to charge 600 for a conventional pap smear and 1200 for LBC.",
            "If possible share their google business link"
        ]
    },
    "Maharashtra Boy Goes In For Leg Surgery, Comes Out Circumcised, Probe On": {
        "title": "Maharashtra Boy Goes In For Leg Surgery, Comes Out Circumcised, Probe On",
        "score": 259,
        "url": "https://www.ndtv.com/india-news/maharashtra-boy-goes-in-for-leg-surgery-comes-out-circumcised-probe-on-5994798",
        "content": "",
        "num_comments": 59,
        "comments": [
            "The guy can flex by saying - my dick is so big the doctors mistook it for the leg to be operated",
            "Bhai ye aur wo gender change wali surgery dekh ke surgery karwane ke pehle koi bhi 2 baar soche ga",
            "and then people ask why medical staff get beaten up 🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣",
            "I don't think probe should be the best word to describe this incident",
            "The surgeon after surgery be like \"Baithe baithe kya kare karthe hai kuch Kam chalo kare circumcision lake Jesus aur Allah ka nam\".",
            "Tf is going on . Smh",
            "Man had a third limb doctors got confused😅",
            "They snipped his 3rd leg by mistake.",
            "This happens when rich people buy medical seat",
            "NEET PG kaa gussa patient ke nunnu pe nikaal diya."
        ]
    },
    "This summer was bad, next will be worse.": {
        "title": "This summer was bad, next will be worse.",
        "score": 129,
        "url": "https://www.reddit.com/r/mumbai/comments/1dr5vdd/this_summer_was_bad_next_will_be_worse/",
        "content": "If we keep our ACs in offices, trains, cars and homes at 18 degrees, while outside weather is 30+ degrees, what do you think will happen. The temperature will continue to rise and you'll keep getting those 10k+ bills every month for electricity. People have to carry sweater and jackets just to wear in some offices while outside weather is so hot.",
        "num_comments": 68,
        "comments": [
            "I keep at 27. 1 ac and bill came to 13.5k",
            "Best way is to keep AC on 25 degrees. Perfect temperature!",
            "The ac usage is a symptom, not the source.\n\nThe source of the problem is unregulated industries in India along with severe car dependency in 'developed' cities",
            "Human body temperature is 37. So setting temperature to 18 is idiotic. 25 is sufficient.\n\nDown votes start in 3.2.1. Go",
            "I hate ACs in offices because they keep the temperatures too low so I always have been carrying jackets for years. Also I tend to get cough in offices sometimes due to the dryness inside the office caused by the AC due to low humidity. Climate change is inevitable now due to the big companies unending corporate greed for profits. There's nothing we as individuals can do at this point to reverse climate change.",
            "Me with 30 k bill\n\n![gif](giphy|gKqY3Xh9RE6JAmbdfo)",
            "I agree withe the AC point and climate change. Don't you think sweater and Jacket is like too much!",
            "are are, where are \"DeVeLoPmEnT kE lIyE kUcH tO sAcRiFiCe KaRnA pDeGa\" fellas at ?",
            "Most carbon is emitted by industries, not your ac or car usage. Stop the industrial waste dumping and pollution.",
            "You really think climate change is the result of our AC usage lol, it's more like a symptom and not a cause. Boycott those 5-6 corps making this world hell for us for sake of their capitalist greed"
        ]
    },
    "Got too high electricity bill don’t know how": {
        "title": "Got too high electricity bill don’t know how",
        "score": 612,
        "url": "https://i.redd.it/e7j6xtaowc9d1.jpeg",
        "content": "My electricity bill came today it was too high ( 65k) , don’t know how it came this high ",
        "num_comments": 193,
        "comments": [
            "ac k jaga turbines chalaya kya bro😭😂",
            "Bro is mining Bitcoins lol?!",
            "Need more information man .... How much is it normally, your usage, appliances at home, etc ...",
            "Guys mere ghar pe 19k aaya, ma ne gaaliya barsa di😭😭😭",
            "I think someone is stealing your house’s electricity. I think some 1 kilowatt power line connection is somehow made to your house’s main connection and it is sucking electricity like hell.",
            "Last two months have seen fights in families because of the x2 x3 electricity bill.",
            "Adani is scammer. Take him to consumer court",
            "Ours is normally 1500 during summer time but this month it came 3000 (2x) it seems everyone is getting such high electricity bills. What to do? who to complain to? and i don't think that someone might be stealing it's adani who is. This motherf**ker don't want to build india he just wants his networth to increase",
            "Aisa Kya use karte ho bhaiyaa",
            "Bhai mera monthly salary ka double tera bill hai"
        ]
    }
}