{
    "Ableton vs Logic Pro: Best DAW for video game music and easiest to pick up": {
        "title": "Ableton vs Logic Pro: Best DAW for video game music and easiest to pick up",
        "score": 5,
        "url": "https://www.reddit.com/r/musicproduction/comments/1dr1c1h/ableton_vs_logic_pro_best_daw_for_video_game/",
        "content": "I used to create music over a decade ago using FL Studio. I have the opportunity to learn either Ableton or Logic Pro. In the past I dabbled with Ableton and found the structure confusing. I am willing to put the effort to learn either of them. \n\nWhich DAW is the most favourable to create video game music and jungle and please let me know why.  \n\nThanks in advance. ",
        "num_comments": 8,
        "comments": [
            "Logic Pro has amazing stock presets, sample library, synths and plugins. I was ready to go within a day or two of learning the Logic interface.",
            "You can do any genre in any DAW. You should just go with whatever is easier for you to use.\n\nI prefer Ableton. It does have a learning curve, but so does anything else, it's cross platform and pairs well with my Akai Force. Logic is great though. I know several people who wouldn't use anything else.",
            "I take it you have a Mac, so Logic Pro would be the way to go. \n\nThe value of its performance and sound library is unmatched. It even has its own grid based loops paradigm that Ableton pioneered over ten years ago.",
            "I had the same dilema, I started with Cubase years ago and the steep learning curve drove me away. I then picked up logic and dabbled with Ableton because my Novation Launchkey came with Ableton Lite.\n\nIt comes down to what workflow you prefer. Ableton is better for electronic music with it's loops feature, which is vastly different to linear production. Logic has a more linear and straightforward workflow, which is one of the easiest DAWS to pickup. Logic I find is easier to use when connecting multiple instruments. , \n\nWhat kind of video game music are you planning to make? Is it like electronica and plugin synths or are you looking to use instruments and vocals?",
            "Logic rocks.",
            "Anything. And then get Chipsounds and you're good to go.",
            "If it's in any way electronic, synth based game music, then Ableton or bitwig, if it's general, classic music production, logic or Cubase. For jungle, it doesn't matter as long as you have a good time stretching alorgrithm and a nice way to cut up breaks, without being cumbersome. I would say Ableton over logic anyday though. It's more expensive but it's honestly better  in my opinion, especially for electonica.",
            "No DAW is better suited for a style of music than any other. The differences are work flow, and you choose the one you like. But they all do the same thing."
        ]
    },
    "Making music in niche genres": {
        "title": "Making music in niche genres",
        "score": 18,
        "url": "https://www.reddit.com/r/musicproduction/comments/1dqsczl/making_music_in_niche_genres/",
        "content": "Anyone else make music in niche genres? I absolutely love making surf stuff, but there's such a niche audience for it that I don't really know if I should promote it, haha",
        "num_comments": 24,
        "comments": [
            "I’m in the ambient and ambient adjacent genres and I fucking love it.",
            "I make synthwave, which is pretty niche. I'm still trying to become more established, but I couldn't ask for a better community and fanbase.",
            "I've release 3 albums.\n\n2 of them I call my \"sleep\" albums. Not to be confused with the band Sleep or any other bands with sleep in their names.\n\nThe first is all piano using minimal stems on each track and anytime I found myself getting too close to making a memorable melody I forced myself to veer away from it. Didn't want any of it being \"catchy\". I also tried my best to put every track through the same effect filter including reverb settings to try and create the feeling/sound of a piano in the woods by a large river.\n\nThe second is very similar except I allowed more \"stems\" on each track and more instruments. Tried to mold the reverb and effects to how I imagine it would sound if you could hear music on the moon with no helmet. Little bit more melody allowed on these.\n\nAnyways. These two albums were written and built to sound best at 50-75% volume and to help relax into sleep with. I'm not a professional sleep science or anything so no major techniques just exploring my own relationship with poor sleep cycles (I have severe sleep apnea and used to suffer from severe sleep paralysis). \n\nSo...I don't know if that's niche or just a weird concept, but I added both albums to a Spotify playlist full of other people's mellow piano tracks and listen to it every night while sleeping.",
            "I make instrumental prog rock with a sax instead of a vocalist. Two guitars, bass, synth, drums and me on tenor. I love making it but getting people to engage when I’m not playing live is so disheartening. \n\nSo then I tried to make lofi because it was more popular. Ended up making more instrumental neo-soul /jazz hop so realistically niche is all I know haha",
            "The most niche of all, I don't create in genres, it's just whatever the hell it is.  This doesn't mean it's good, necessarily.",
            "I’m over here trying to make guitar focused trip-hop 💀",
            "I make Musique concrète.",
            "not too too niche but I make alternative hip hop, where I sample a lot of rock and non-traditional samples into boom bap/alt hip hop type beats.",
            "man I wish I knew what my genre is lol. I've been going with \"organic house/techno/dnb\"",
            "Made a 3600bpm melodic extratone song recently, love going into really niche territories even if my main genre (neurofunk) is somewhat known, although definitely not mainstream"
        ]
    },
    "Where to start?": {
        "title": "Where to start?",
        "score": 4,
        "url": "https://www.reddit.com/r/musicproduction/comments/1dqzsmd/where_to_start/",
        "content": "Everything is ready, I have my midi keyboard , DAW, a passion to start. Yet I’m totally lost what to do and where to start I’m interested in many genres Pop/Techno/Jazz/orchestra/Rock/metal… and so many. The problem is, I know nothing about music production and 0 knowledge. so what should i learn to make music?",
        "num_comments": 8,
        "comments": [
            "First of all, pick one genre and stick to it for the time being. Genres have various common conventions that you can work with when beginning. For example, common drum and percussion patterns. Common chord progressions. \n\nSo until you can learn the basics of your DAW, and learn some basics for creating music stick with one. \n\nNext, instead of just being all over the place with trying to create a track for a song. Start by trying to build a musical idea. Like the instrumental equivalent of a chorus or a verse in a song. And learn to create the tracks for that. \n\nThen once you become more advanced, you can learn how to expand on that musical idea into a full song. So for example, if you go with techno or some other type of EDM, stick to an eight bar loop. And then eventually you will study song structures to expand it from there, such as described in this video \n\nhttps://edmtips.com/edm-song-structure/\n\nAs you begin working with melodies and chords and creating musical ideas, at some point it will be a good idea to start learning some basic music theory. Music theory is about the relationship between notes. And scales, chords, arpeggios, and rhythms are the building blocks for creating music. \n\nYou won't be able to learn everything you need to know about music theory in the beginning. It'll be something to work with overtime where your knowledge of music theory grows as your other knowledge about creating music grows.\n\nThen once you can create some full songs, you can focus on learning to use creative effects like reverb or delay.\n\nFinally, save other mixing (such as EQ, side chaining, transient shaping) and mastering until you've gotten the hang of those other things. That's the frosting on the cake. But you got to be able to bake the cake first.",
            "Do you know how to play the keyboard? Have you written a song yet? That's got to be the first steps.",
            "[removed]",
            "Everything. At least 100 knowledge, I'd say.",
            "youtube is your best friend! i like the IntheDaw youtube channel, its mostly edm but they are some of the absolute best producers. if you want to go the more professional route, dave pensado is fucking fantastic. these are just who i like best. good luck! and remember, learn the daw in and out as this will make your life 10x easier",
            "Youtube my friend.  Type \"DAW\" beginner tutorial\nThe amount of information can be overwhelming but dont be discouraged.  Often Ill have a tutorial open and play in my daw as i go often leading me to just fucking around for hours.  \n\nThats how I learned",
            "Fire up the daw and just start. Fiddle around, click the buttons. Experiment without any knowledge. Then start looking up things you want to do",
            "Sorry, your submission has been automatically removed. Your account is too young and such is removed for manual review.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/musicproduction) if you have any questions or concerns.*"
        ]
    },
    "How to be yourself.": {
        "title": "How to be yourself.",
        "score": 8,
        "url": "https://www.reddit.com/r/musicproduction/comments/1dqrx5g/how_to_be_yourself/",
        "content": "This may seem like a silly question to ask but once I explain I hope you understand. How can I make music that is uniquely me? Everyone has inspirations and influences but how do I get to a point we’re you can hear the influence but not come off as a copy cat. My biggest fear in music is not having my own unique sound and just becoming known as that guy who sounds like someone. How do I pull from my inspirations without copying them so I can be me and have my own thing going? ",
        "num_comments": 25,
        "comments": [
            "I think you just have to start making things.  As long as you're not copying anything too closely, your combination of instrumental progressions and vocal style and choice of lyrics is what makes you unique. Unless you try really hard to sound like somebody else, you'll eventually find your \"own voice\".\n\nMaking music is a journey, not a destination, so don't look at it like a goal that you're going to accomplish - look at it as something that you enjoy doing and will always be progressing on.  Music is the road, not the destination.",
            "Don't worry about originality. If you made it, trust yourself. It comes from the origin. If you endeavor to come up with something new for the world, you might never begin. If you endeavor to do something new to you, the possibilities are endless. Feel free to pay homage to your influences. Your music will resonate with people and please you. Just trust yourself. You are the origin. Originality will take care of itself.",
            "Spend more time making music as opposed to reddit to develop a personality",
            "Find something in your genre of music that you feel is underutilized and exploit the hell out of it",
            "Just make music. Anyone’s sound is unique thanks to a ton of micro decisions you make during your music making. You develop habits and a way to execute what you want only through working a lot. \nPractice and let time do its thing.\nYou will sound like other people sometimes, that happens, all good. It’s gonna keep happening even if you have your sound.",
            "Experiment.",
            "copy stuff. copy lots of stuff. start mixing and matching. the process of how you mix and match your influences dictate your original style. do that for months, years and you'll develop your own style without all the weird existential dread over \"am i original\".\n\nyou become a copycat when you stick the same thing over a long period of time imo\n\nno one gives a sh\\*t when you're newer",
            "It takes a lot of time, effort, practice to achieve a unique sound that sounds good. Keep going!",
            "Just keep outputting stuff.  Experiment with different styles, try new techniques, new genres. I find even looking at songs you like and trying to recreate them can end up sparking some inspiration for a new idea.\n\nYour sound will develop over time, I say don't worry about it too much",
            "Just do what brings you joy and put your heart in it fully. Don't worry about copying. That fear is a function of an ego element that needs to get out of the way.\n\nYour style will develop over time until you can play anything and it will sound like you as long as you stay authentic to yourself."
        ]
    },
    "niche genre searching ": {
        "title": "niche genre searching ",
        "score": 1,
        "url": "https://www.reddit.com/r/musicproduction/comments/1dr4v0a/niche_genre_searching/",
        "content": "i love doing a bunch of different genres and meshing them together, downside is i can never figure out what that niche genre could be for things like hashtags or promo, how tf do i find the fitting niche genres 😭",
        "num_comments": 0,
        "comments": []
    }
}