{
    "Can anyone explain this tattoo? ": {
        "title": "Can anyone explain this tattoo? ",
        "score": 509,
        "url": "https://i.redd.it/e3veooaa7d9d1.jpeg",
        "content": "Spotted on the tube in London.",
        "num_comments": 112,
        "comments": [
            "That’s a Jimmy Hendrix fan!\n\nWith a treble clef in front of it is an E7#9 chord, sometimes called the “Hendrix chord”",
            "Cool tattoo. I’m kind of surprised no one‘s pointed out that the G on top should actually be an Fx double sharp, since the 9th of E is an F#. That’s a very guitar way to write it on the clef since it looks like a G at the eighth fret on the second string. I’ll show myself out now.",
            "Is it the Hendrix chord?",
            "Tilted my phone clockwise and was very confused how this was an E7#9.",
            "The ink should be purple",
            "It’s Hendrix’s voicing for a E7#9. Some people call it the Hendrix chord but it was commonly used before him in jazz music. \n\nThe tattoo would have been a little more seemly, imo, if they excluded the lowest E, the symbol would have still been clear.",
            "E7#9 (it’s a guitar chord) Notice there is one note for each of the 6 strings.",
            "My sister snapped this earlier today and our whole, pretty musical, family are totally confused.",
            "The “Hendrix” chord, although it doesn’t make sense to me that it gets that nickname, considering it was in widespread use for decades before “Purple Haze”.",
            "076780\n\nHonestly, the lack of double sharp threw me off."
        ]
    },
    "Which do you prefer to read? Which is \"correct\"? (see comment)": {
        "title": "Which do you prefer to read? Which is \"correct\"? (see comment)",
        "score": 10,
        "url": "https://i.redd.it/78pmnqz3eg9d1.png",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Listen for the backbeat when the drums come in at 0:53. It's quarter notes. I agree with /u/ClarSco that it's not really swung; just write the triplets in when needed.",
            "What feels right? Groups of four beats here should just feel and look right to you. Also the bottom is in 2/2",
            "I listened to a bit of it. It sounds like a slow song, not like a moderately fast song, so I'd use 77 bpm.",
            "The first is awkward to read. I prefer the second but at 77 bpm (a quarter)",
            "The top notation of 2 sixteenths = triplet looks odd to me",
            "I’d prefer the top one. 77bpm is a very very ordinary tempo for a quarter note pulse, and while it’s not weird for half notes either it’s more routine and therefore easier I read for most.\n\nI personally prefer it even more with “Swing 16ths” in the tempo marking instead of the diagrammatic swing instruction adding a third(!) line of staff text",
            "Quarter note beats feel better here. Seems more natural.",
            "Omg I didn't realize the straight 16ths in all those parts! Thanks for pointing it out!",
            "Holy dang you guys are right!! That piano intro threw me off lol Thanks!!",
            "If you're posting an Image or Video, please leave a comment (not the post title)\n\nasking your question or discussing the topic. Image or Video posts with no\n\ncomment from the OP will be deleted.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/musictheory) if you have any questions or concerns.*"
        ]
    },
    "How does one know what chords keys one can modulate to from a diminished seventh in a given key?": {
        "title": "How does one know what chords keys one can modulate to from a diminished seventh in a given key?",
        "score": 1,
        "url": "https://www.reddit.com/r/musictheory/comments/1drbez8/how_does_one_know_what_chords_keys_one_can/",
        "content": "I've recently been taking advanced music theory, and have been trying to figure out how to use the VII7o to modulate between chords.\n\nI recently heard that, for any given diminished seventh, one can modulate to the keys of each of the notes of the diminished seventh one semitone above it (Eg, a Bo can modulate to the keys of the notes in Co.) However, I was under the impression that a diminished seventh chords can be used to modulate between any two keys.\n\nIs there any kind of formula or way of figuring out how to use a diminished Vii7 in a particular key to modulate to any other key?",
        "num_comments": 1,
        "comments": [
            "Don’t quite understand your example that you tried to layout, but think about it like this. \n\nA fully diminished seventh chord is built of only minor 3rds. So technically there is no root. Any inversion you use it can be the root position. Therefore any note in the chord can be the leading tone to the new key you want to go to. Meaning any note of the diminished 7th chord can resolve to the new tonic a half step up. \n\nSo you would be modulating from the key you started in to the new key you chose to resolve to."
        ]
    },
    "For figured bass, what does this mean? My guess it means to go from a root position F chord to a first inversion, but I'm not sure.": {
        "title": "For figured bass, what does this mean? My guess it means to go from a root position F chord to a first inversion, but I'm not sure.",
        "score": 1,
        "url": "https://i.redd.it/6v3nb3hski9d1.png",
        "content": "",
        "num_comments": 2,
        "comments": [
            "If you're posting an Image or Video, please leave a comment (not the post title)\n\nasking your question or discussing the topic. Image or Video posts with no\n\ncomment from the OP will be deleted.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/musictheory) if you have any questions or concerns.*",
            "# For figured bass, what does this mean? My guess it means to go from a root position F chord to a first inversion, but I'm not sure.\n\n[](https://www.reddit.com/r/musictheory/?f=flair_name%3A%22Notation%20Question%22)"
        ]
    },
    "Chord progression: ii and vii°": {
        "title": "Chord progression: ii and vii°",
        "score": 1,
        "url": "https://www.reddit.com/r/musictheory/comments/1dr9dxr/chord_progression_ii_and_vii/",
        "content": "Hi, harmony newbie here trying to figure out the logic behind chord progression. I understand the concept of stable/unstable grades so that (major scale assumed) V wants to resolve to I and ii to V being its dominant.\n\nWhat I don't understand is why it doesn't seem to be a pull from ii directly to I since one would expect for (2 4 6) be straightforwardly attracted to (1 3 5) even more than to (5 7 2).\n\nAlso why vii°, which on the other hand feels a strong pull similar to V -> I by sharing 5 7, is so rarely used in pop music? Could it be because the hard part is actually to get to vii° first?\n\nThanks!",
        "num_comments": 4,
        "comments": [
            "There is a pull directly from ii to I, there is a camp of theorists that say ii has a dominant function similar to V. \n\nvii has the same function as V. They share 80% of the same notes, are mediants of each other (if you play V7 in the first inversion, you end up with a quality that’s the same as vii)",
            "ii can go to I just fine, and often does. It's just that ii V I has a rise in tension before the resolution compared to ii I because V contains the leading tone of the key. \n\nThe vii dim chord does show up fairly often in jazz standards and some of the genres that gave us jazz standards (show tunes, film scores, etc.), usually as a ii-7b5 V7 i (minor ii V i with extensions).\n\nIt's probably not common in pop music because most pop musicians who try using it one day go \"eww, stinky!\" because of the tritone with the root.",
            ">What I don't understand is why it doesn't seem to be a pull from ii directly to I since one would expect for (2 4 6) be straightforwardly attracted to (1 3 5) even more than to (5 7 2).\n\nOne would not expect that, because your premise is wrong. Let's look at C major. Every note of Dm is a whole step away from C, whereas G shares a note with C its second note is half a step away from C. \n\n>Also why vii°, which on the other hand feels a strong pull similar to V -> I by sharing 5 7, is so rarely used in pop music?\n\nCause it's too cheesy. Diminished chords evoke a \"Classical\" mood which doesn't really fit most pop songs. You can find diminished chords in the form of m7b5, which is called half diminished (seventh).",
            "The most important thing is dominant-tonic resolution is the resolution of the leading tone. Scale degree 7 resolves to 1. You don't have this resolution in ii-I. Also, everything moving in parallel is not harmonically very strong. It ends up sounding like a single voice with doublings instead of actual harmony.\n\nFunctional harmony is the result of multiple simultaneous melodies. It shouldn't be approached too vertically - you need to understand the voice leading for it to truly make sense.\n\nIt all comes down to different scale degrees having different levels of stability. The most stable scale degrees are 1 3 5 - the notes in the tonic triad. The other scale degrees are unstable and have a tendency to resolve to the notes in the tonic triad. 2 resolves down to 1, 4 resolves down to 3, 6 resolves down to 5, and 7 resolves up to 1. The strongest resolution is 7-1 - the leading tone resolving to the tonic.\n\nHere's how dominant-tonic works. Instead of thinking of it as two vertical chords (triad built on scale degree 5 going to triad built on scale degree 1), you can see it as a combination of many different melodic resolutions.\n\n7-1\n\n4-3 (this makes it a V7)\n\n2-1\n\n5-5\n\n5-1\n\nThe only resolution that is typically not part of the dominant-tonic progression is 6-5. But you can add that too if you use the viiø7. This simply isn't as common. Probably it has to do with the bass. In bass, leaps are actually stronger than steps. Strongest bass motion is descending 5ths. Why leaping down a 5th in the bass is so strong might have to do with the consonance of the 5th - it's the first overtone that's a different note from the fundamental. So, going 5-1 clearly establishes the 1 as the \"fundamental\". The role of the 5 is to stabilize the 1.\n\n>Also why vii°, which on the other hand feels a strong pull similar to V -> I by sharing 5 7, is so rarely used in pop music? Could it be because the hard part is actually to get to vii° first?\n\nNot only in pop music, but also in classical music.\n\nAs I said, the 5-1 bass is stronger than a stepwise resolution in bass (7-1 or 2-1). This is why the V chord is more important.\n\nAlso, the diminished triad results in a bit of an awkward voice leading when you write for 4 or more parts. In C major, B resolves to C, F resolves to E, D typically resolves to C. Notice how this results in an incomplete C major chord. When you add a 4th voice, it just makes sense to add a G instead of doubling one of the notes in the diminished chord. Really, the question is, why would you use the vii° when writing for 4 or more parts? Remember that originally people didn't approach harmony from the perspective of roman numerals and inversions. They approached it melodically. Bdim-C in 4 or more parts just doesn't lead to natural sounding melodic resolutions, so when people added a 4th part, they naturally added a G.\n\nThe point is, people didn't approach it as \"let's write a vii°-I progression\". Instead, they approahed it as \"let's write melodies that lead to a nice resolution\". They knew different possible melodic resolutions and simply combined those. They didn't worry about it being a vii°-I or whatever. It was simply a combination of different melodic resolutions. The \"chords\" that emerged from those melodic resolutions were originally not super important. \"Chord progression\" based thinking is a more modern thing. People only started thinking more consciously in \"chord progressions\" once the basic patterns had already been established.\n\n[Here's a good video](https://youtu.be/jaCRUdxTRSM?si=qUVylB28SNXZa1GD) that shows the origin of these patterns.\n\nThis doesn't mean it's never used. It just makes it less useful than other progressions. And this is why it didn't become an important part of the \"harmonic language\", and that's also why you don't see it in pop music. Pop music is a more ear-based style any way, so people just pick up patterns that they hear in music. Since vii°-I isn't one of those patterns, people naturally don't even consider using it. (Also, diminished triads are awkward to play on guitar, and they simply aren't part of the standard \"guitar vocabulary\" - that's another reason why they are rare in pop, because guitar is a really common songwriting tool for pop musicians.)"
        ]
    }
}