{
    "This a boomer tier meme at best ": {
        "title": "This a boomer tier meme at best ",
        "score": 40,
        "url": "https://i.redd.it/8n2u56fxbg9d1.jpeg",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Everyone knows exactly 2 things about women. Women be talking and women be shopping. /j",
            "I mean it depends on the intent. \"Women talk more = bad\" is stupid, but it can also be just a funny joke. \n\nOr this could be in fact referring to the joke that women go to the bathroom together (moreso than guys anyway), and therefore there  may be conversations.\n\nIt could be dumb, it could be not, but whatever.",
            "Women talk more, multiples studies have proven it, its not even a bad thing just a cute joke, get over it",
            "Really? Show the studies. Because the ones I've read show that men actually talk more, and falsely perceive women to talk for longer than they actually do."
        ]
    },
    "Women are super unreasonable pricks for not wanting to be creeped on": {
        "title": "Women are super unreasonable pricks for not wanting to be creeped on",
        "score": 385,
        "url": "https://i.redd.it/ta9xwbqkyb9d1.jpeg",
        "content": "",
        "num_comments": 74,
        "comments": [
            "The anime trope is... consent.... huh weird that it's the same thing as real life. Maybe OOP is just an idiot or purposefully dodging that reality",
            "I’m convinced that sub doesn’t know what consent is.",
            "What kinda argument is \"because they are anime, so it doesnt matter if they consent\" like oop missed the point of the meme. If oop can't interpret a bad meme, what makes hime think he has the authority to tell someone to cry over anime tropes and touch grass like bro your not cool.\n\n🤓🤓🤓🤓🤓",
            "Why the fuck would I wanna spend my time looking at fake tits in anime? Not to mention half of the time the character is a child and his unrealistically proportioned and always sexualized\n\nNo fuck that shit I’m good. I’ll stick to my Gay Jojo’s characters, beating the shit out of each other with stands and Saiki K’s much more quality content",
            "Anime or not: the logic behind it still stands.\n\nOne is worn outside and in public. The other is worn in a private setting.\n\nConsent matters. “But anime” doesn’t matter, the logic is the same across the board.",
            "My guy,can you please be a dear and see if the post got delete?\n\nhttps://preview.redd.it/kxdly94g0c9d1.png?width=1080&format=pjpg&auto=webp&s=c579a54edd298318fce7daaf9c495b839e8bdaf1\n\nThis is what is showing me",
            "I mean I feel like the vast majority of women wouldn't be too happy about being ogled in a swimsuit either, even if it's a kind of skimpy bikini. I know I wouldn't be okay with that.",
            "Almost as if context matters",
            "if you’re criticizing the logic of these animes it’s because you don’t think the logic would apply irl so they still don’t understand what consent is",
            "“B-b-but they wanna be creeped on sometimes, they’re hypocrites!” Bro that’s called consent"
        ]
    },
    "I don’t think “Grrrrrr, people who don’t fit the description of my perfect race exist, how dare they!” Counts as sarcasm.": {
        "title": "I don’t think “Grrrrrr, people who don’t fit the description of my perfect race exist, how dare they!” Counts as sarcasm.",
        "score": 135,
        "url": "https://i.redd.it/x5rpbs8e5a9d1.jpeg",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Yeah. Jo's \"sarcasm\" is about having gone through a bargain basement exorcism to get rid of her TERF bullshit. She should have undergone an enema instead.",
            "This isn't sarcasm she is a twat waffle and a transphobic pipe of shit",
            "Is this a recent development or was she always insane and no one noticed it",
            "How does being transgender have anything to do with race?",
            "shes off the fucking deep end christ.\n\nher whole personality is thinking about other people's genitals.",
            "What the fuck does that even mean",
            "That's not even a meme lmao",
            "Can we just rename that sub to schrodingers douchebag? That’s exactly what they are: they dismiss any and all things that makes them look bad as “sarcasm” or “a joke” but then proceed to justify it in the comments.",
            "She has trans people on the brain so hard that Elon Musk (of all fucking people) publicly told her to talk about something else.",
            "It is pretty true that it seems the top priority is trying to rehash already defined terms \n\nWhen the US seems like it's failing apart."
        ]
    },
    "Racism is (surprise) not funny": {
        "title": "Racism is (surprise) not funny",
        "score": 830,
        "url": "https://i.redd.it/iqh783yoi49d1.jpeg",
        "content": "",
        "num_comments": 80,
        "comments": [
            "Is his hand on a painting? Who does that?",
            "The bait and switch is definitely funny lmao.",
            "I thought it was a \"lady killer \" joke. Then i read the dialog",
            "it got a light smile out of me just out of the shock value",
            "It's funny, albeit a bit in a bad taste. Admitting that \"black people steal\" is a racial stereotype is not racism, it is recognition that racism exists. And it's paintingthe stereotype  as absurd, since the joke wouldn't work unless the double meaning adopted by the joke is the absurd one. \nUnfortunately, the stereotype is present in our society enough for it not to be absurd, which makes the joke in a bad taste",
            "Bet it wouldnt be “kinda funny” if he pulled out a bbc instead",
            "It's a lil funny",
            "Can people not call this funny without condemning the racism???? Sure it’s a little clever but don’t just ignore the clear racism. Also it’s not like being funny excuses bigotry.(Duh)",
            "It was funny",
            "The held \"pose of betrayal\" is kinda funny though"
        ]
    },
    "\"Ain't no way op thought this is serious\" ...comment section is full of people who believes this is serious ": {
        "title": "\"Ain't no way op thought this is serious\" ...comment section is full of people who believes this is serious ",
        "score": 137,
        "url": "https://i.redd.it/eans07i4d59d1.png",
        "content": "",
        "num_comments": 23,
        "comments": [
            "Literally😭\n\nOnce again showcasing that their satire and jokes are actually just their sugarcoated personal opinions.",
            "Donald Trump’s botched COVID response, refusing to wear a mask, and telling people not to be worried led to **ONE MILLION AMERICANS DYING**\n\n**AND HE THEN PROCEEDED TO TRY TO OVERTHROW THE GOVERNMENT!**\n\n**AND** ***THEN*** **HIS SUPREME COURT JUSTICES VOTED TO OVERTURN ROE V WADE AFTER HE LEFT OFFICE** ***AND HE TOOK CREDIT FOR IT LIVE ON NEWS!***",
            "(it's almost as if all those serial killers were active during a time when those glasses were popular and everyone was wearing them)",
            "Wait what? This is clearly a joke wtf are you guys on about\n\nThis sub is usually normal but MOPDL is right this time",
            "My uncle also wears this type of glasses, is he a serial killer?",
            "My uncle had these glasses",
            "I’m bad at faces what’s this it’s funny to me who doesn’t know but I’m assuming there’s something idiotic or bigoted in it I’m missing",
            "Whether anyone likes it or not, he's murdered people.",
            "Wait, I might be stupid. Is one of the four guys a politician?",
            "Except the majority of those chuds \\*literally\\* belive Faucci is a murderer. Because they're fucking morons. They couldn't even give you the high school explanation of what a vaccine is (or a virus for that matter), yet suddenly they're fucking epidemiologists because they were ZOMG FORCED!!!! to wear a small piece of breathable fabric over their bullshit spewing face holes."
        ]
    }
}