{
    "2023's Top Baby Names! (U.S)": {
        "title": "2023's Top Baby Names! (U.S)",
        "score": 417,
        "url": "https://www.reddit.com/r/namenerds/comments/1cop9cm/2023s_top_baby_names_us/",
        "content": "Merry Christmas, r/namenerds!\n\n1. Liam & Olivia\n\n2. Noah\t& Emma\n\n3. Oliver & Charlotte\n\n4. James & Amelia\n\n5. Elijah & Sophia\n\n6. Mateo & Mia\n\n7. Theodore \t& Isabella\n\n8. Henry & Ava\n\n9. Lucas & Evelyn\n\n10. William & Luna\n\nSee the rest [here](https://www.ssa.gov/oact/babynames/)\n\nAny surprises? Anything you predicted?",
        "num_comments": 460,
        "comments": [
            "almost 400 people still out there naming their babies Khaleesi!",
            "I'm surprised Mateo is at 6th!\n\nI'm also surprised Mia is still in the top 10. In all my years around children (teaching and my own kids), I've met 1, maybe 2 Mias.",
            "Names that rose the most by absolute numbers, girls: Lainey (by a lot), Amira, Wrenley, Eden, Eliana, Lucy. Georgia, Margot, Aitana, Maeve, Antonella, Millie, Sofia, Kaeli, Adaline. Ashley. Alora. Mia, Sadie, Kaia\n\nNames that fell the most by absolute numbers, girls: Ava, Olivia, Luna, Scarlett, Emma, Isabella, Everleigh, Everly, Nova, Abigail. Ella, Mila, Natalie, Chloe, Kinsley, Stella, Zoey, Nevaeh, Harper, Elizabeth",
            "So cute, Im looking at the longer list and Juliet was ranked 292 while Romeo ranked 293 ",
            "Maeve and Vivian making the expected moves up. Surprised by Lainey tho!",
            "This is my Super Bowl.",
            "I am so surprised Jude or Cooper isnt up there. Where I am there are sooo many boys with those names!",
            "Am I reading this right?  Only one new name in the top 10 for boys *and* girls?",
            "Not surprised that Maeve and Margot have both jumped up quite a bit. I imagine both of those will keep climbing. I could see it for Adeline as well.\n\nIm curious to see when Eleanor makes the top 10. Next year (2024), surely?? I think it could be destined to be a #1 name.",
            "Mateo finally made its way to the top 10 "
        ]
    },
    "To those afraid to give your children unique names": {
        "title": "To those afraid to give your children unique names",
        "score": 357,
        "url": "https://www.reddit.com/r/namenerds/comments/1dqzd6l/to_those_afraid_to_give_your_children_unique_names/",
        "content": "Here is a list of some of the unique names currently at my school:\n\n- Light\n\n- Amen\n\n- Scout\n\n- October \n\n- Maroona\n\n- Reed\n\n- Honey\n\n- Pierce\n\n- Amethyst \n\n- Ocean\n\n- Navy\n\n- Oaklyn \n\n- Genesis\n\nAll to say, that this is the generation your children will be born into. These children are in grade school and will become your children’s bosses or coworkers. Choosing a unique name will not make your kids stand out or be rejected on a resume. They are only low hanging fruit (whatever that phrase is) to the adults of today’s generation. The only people that I have seen smirk or say something about some of these names are the teachers I work with, which says a lot about their maturity. The kids they go to school with don’t seem to have a problem with these names.\n\nThink of all the names back in the day that people hated only for it to become popular now and useable. I work with a Claudia. A normal name today but with a meaning that means Lame. Or think of the name Mallory that means unlucky. \n\nGrowing up with a cultural name (popular normal name in my culture but seen as unique in North America) I was picked on. But I grew up to love my name because my parents taught me not to care and embrace it. I also love how intentional they were when they gave me that name.\n\nSo give your children the unique names you love. That’s what I did and I don’t regret it for one second. \n",
        "num_comments": 324,
        "comments": [
            "Scout & Pierce are not new. Im surprised theres no days of the week on here!",
            "How is Reed a unique name?",
            "Thank you for this! \n\nPersonally I love October and Amethyst!",
            "I appreciate the uniqueness of it, but I don't like the sound of Maroona. I can't quite place my finger on the issue I have with it. I'd rather see the kid just named Maroon. Adding the a to the end seems to ruin it for me.\n\nHere's the irony: if you added an a to Scarlett or Violet, then I wouldn't have an issue with it. Scarletta and Violetta seem fine. Maroona seems wrong to me for no apparent reason. Maybe I just need time to hear it some more before I get used to it.",
            "Reed and Pierce are normal names. Maybe a little old.",
            "Reed doesn't belong on this list. I have met many Reeds (mostly older men in their late 30s early 40s, but also some teens). \n\nGenesis is very common in my hispanic Central American country.",
            "My name is so unique that a google search only shows me. My first name is Somerset. My last name was misspelled at Ellis island when my husbands great grandfather came to Amrica from Germany in the late nineteenth century. He had one kid, who had one kid, who had two kids, we have 3 kids. There are 5 people in the country with our last name as it is spelled. I love/hate the fact that my name is this unique. On one hand, I am definitely original, on the other hand, my stalker can easily find me.",
            "Oaklyn would probably be considered normal nowadays lol",
            "Pierce Reed and Scout arent exactly new or unique names.",
            "Genesis is a very old, biblical and common name"
        ]
    },
    "We’ve settled on a name for baby girl #2! ": {
        "title": "We’ve settled on a name for baby girl #2! ",
        "score": 33,
        "url": "https://www.reddit.com/r/namenerds/comments/1dr9fna/weve_settled_on_a_name_for_baby_girl_2/",
        "content": "A while ago I posted asking for name options for our 2nd daughter. 5yos name is Penelope (we call her Penny). \n\nBaby #2 is going to be Matilda, Tillie for short. I mentioned it and everyone loved it so much that she’s automatically been referred to as Tillie lol. \nI also love the meaning of Matilda, “mighty in battle”, as this pregnancy had a bit of a rocky road ❤️. ",
        "num_comments": 4,
        "comments": [
            "Penelope and Matilda are awesome sibling names!!! Love it.",
            "I love Penelope and Matilda.",
            "These are our exact two girl names with the same nicknames, so I like your taste!",
            "Lovely name "
        ]
    },
    "Un-ruin this name for me...": {
        "title": "Un-ruin this name for me...",
        "score": 37,
        "url": "https://www.reddit.com/r/namenerds/comments/1dr7vzw/unruin_this_name_for_me/",
        "content": "I'm due to give birth any day now. The name Sadie has been one of my top two choices for ages.\n\nBut recently I saw a comment saying something like \" why would you name your kid sad and die\" 🤣🤣 I can't unsee it now.. but the name is so pretty.\n\nHelp me un-ruin it.\n\nIs your name Sadie and you love it? Do you have cool facts about the origin of the name?  Anything! Help!",
        "num_comments": 78,
        "comments": [
            "That negative association has never occurred to me. I worked at a theatre arts summer camp and one kid was named Sadie, she was very sweet and had a great singing voice!",
            "I would only see it as Sad & Die if someone randomly spelled it Saddie, never would have ever noticed until I seen this post tbh. I think its such a cute name!!",
            "Sadie is the name of the actress who plays Max from stranger things!",
            "I always think of Sadie the cleaning lady But this might be an Australian thing",
            "The letters are there, sure, but none of the sounds of sad or die. I LOVE love the name Sadie and I hope you use it!!",
            "Lmao sounds like something one of the violet sounds like violence! people would say. I hope they were joking",
            "I love the name Sadie. Makes me think of Sadie Hawkins Day, which makes me think of empowered women who take the bull by the horns and aren't afraid to take risks.",
            "I have the sweetest auntie Sadie and I love her. Her name suits her perfectly and is a beautiful name. Whoever said that about the name is reaching so bad",
            "The \"sad-die\" comment is ridiculous. Sadie is pronounced \"sey-dee\", not \"sad-die\"!",
            "I love Sadie. Never thought of this association before, think it's a real stretch plus the pronunciation is nothing like either sad or die"
        ]
    },
    "What Colour Names Do You Like As People Names?": {
        "title": "What Colour Names Do You Like As People Names?",
        "score": 198,
        "url": "https://www.reddit.com/r/namenerds/comments/1dqslht/what_colour_names_do_you_like_as_people_names/",
        "content": "What are your absolute favourite names that are borrowed from colours?\n\nI personally love:\n\nViolet\nSienna\nScarlett\n\nIt's always funny to me how some nouns make it to be names and others don't (I can't imagine a child called Yellow for example!). Though some do break through (like Lilac, which I wouldn't personally think of for a name but have seen used).",
        "num_comments": 374,
        "comments": [
            "Depending on where you draw the line on what is an actual colour and what is a noun that is used to describe a colour (eg forest as a shade of green): Hazel, Olive, Saffron, Pearl, Fawn (this is more mn material), Cyan, Ash.",
            "For some reason, Chartreuse came to mind and I laughed out loud to myself. Not that anyone should name their kid Chartreuse.",
            "I actually like Navy but I know it's not to everyone's taste",
            "Anyone else read the Amber Brown books growing up?!",
            "I knew a girl named Indigo in college. I thought that was really cool and still do. Ive heard of Peridot as a name, Peri for short. Coral and Amber are pretty.",
            "Violet, Hazel & Sienna are my favourites.",
            "Scarlett, Hazel, Teal (knew one in college) and Cobalt is cool imo also just the nickname \"Red\"",
            "I have a baby Lavender!",
            "Lilac, Violet and Emerald if it counts",
            "I actually really like Veridian"
        ]
    }
}