{
    "New post option: Advice Needed (unjerk)": {
        "title": "New post option: Advice Needed (unjerk)",
        "score": 49,
        "url": "https://www.reddit.com/r/NameNerdCirclejerk/comments/18pmaai/new_post_option_advice_needed_unjerk/",
        "content": "Unjerk meaning-  sometimes the users in circlejerk subreddits need to make serious posts, so an \"unjerk\" basically means a real post wanting real opinions. \n\nWe used to have weekly threads for such advice, but they have not been utilized in a long time, so enter our new post option. All advice asked without using the correct flair WILL BE REMOVED. \n\nDo not be mad about mean or blunt comments in such posts, this sub is for brutal opinions. ",
        "num_comments": 0,
        "comments": []
    },
    "What color names do you like as people names?": {
        "title": "What color names do you like as people names?",
        "score": 147,
        "url": "https://www.reddit.com/r/NameNerdCirclejerk/comments/1dqycc8/what_color_names_do_you_like_as_people_names/",
        "content": "What are your absolute favourite names that are borrowed from colours?\n\nI personally love:\n\n#b00b69 #ea7a55 #bada55\n\nIt's always funny to me how some nouns make it to be names and others don't (I can't imagine a child called #5ec5ee for example!). Though some do break through (like #042069, which I wouldn't personally think of for a name but have seen used).\n",
        "num_comments": 62,
        "comments": [
            "https://preview.redd.it/2ckpbbg6oe9d1.png?width=749&format=png&auto=webp&s=b050bac53dfd976e1051e0867e3f31db9a0d1eb6",
            "Poope Browne",
            "I want more hex code colors. So. \n\n•FFFFFF is so cute, but I didn’t use it because someone said it sounded like the start of a swear 😔 also, I’m not 100% Caucasian (my dad’s Asian) and it’s kind of a white name. \n\n•DEDEDE is a great color name if you’re a fan of the Kirby games!\n\n•CADE75 great nod to any cadets in the police or military!\n\n•DECAF5 for any coffee lovers or for parents who met on a coffee date!\n\n(Edited because I forgot the pound sign makes big text. Replaced # with •)",
            "Cyan. Why aren't people doing it? It's a stellar upgrade from Diane.",
            "#bada55 is lovely. \n\nMy list includes:  \n\nStudio Mauve\n\nRadiant Dawn\n\nGale Force\n\nand...Frosted Fern.\n\nThanks, Sherwin Williams",
            "Off, True, and In-Living 🥰",
            "“I have a baby Lavender!” of course you do",
            "Sad beige. Saddy or Sadie would be cute nns.",
            "Indigeaux\n\nAwewrenge\n\nYel Hoe\n\nVeighoughlett",
            "[Sauce](https://www.reddit.com/r/namenerds/s/dnOrqWz2cy)"
        ]
    },
    "Is my baby name really that bad?": {
        "title": "Is my baby name really that bad?",
        "score": 23,
        "url": "https://www.reddit.com/r/NameNerdCirclejerk/comments/1dr0766/is_my_baby_name_really_that_bad/",
        "content": "The name I want for my future child is Tourmaline and EVERYONE scoffs at it! Nickname would be Tour, obviously. Maline is kinda cute too for a girl. Is it really that bad? I feel like I’ve heard crazier.\n\nI prefer it for a boy but I’d use it for a girl too, whichever comes first. It seems neutral!\n\n([sauce](https://www.reddit.com/r/namenerds/comments/1dr02w2/is_my_baby_name_really_that_bad/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button))",
        "num_comments": 20,
        "comments": [
            "Hi, it’s Aquamarine’s mom! Tour and Aqua should have a playdate soon 🩵",
            "If you have to say, \"I feel like I've heard crazier\" ... That's not an accomplishment..",
            "As an alternate birthstone for the month of October, Tourmaline would only feel right if your baby was born in that same month. Just to be safe, test out Sapphire (in case you’re early) and Citrine (in case you’re overdue).",
            "For real I know a young woman with this name. She’s late teens/early 20s.",
            "…I kinda like it 😔",
            " Sounds like a new weight loss drug the FDA just rolled out to compete with ozempic lmao",
            "Just name her Maline.",
            "I have a very unusual name, so I'm biased. Fewer than 25 of us worldwide, and I'm the only one with my full name anywhere. \n\nTourmaline is a pretty gem, but there will be stress associated with the name. The nature of people is to be unkind...I have known people for 20+ years who still mispronounce my name. \n\nAre you prepared to work to make internet safe for them? A unique name means people can find you easily. Defend the name to teachers, her peer group, your friends, etc? And teach your child the same? A sensitive kid might have issues with it. \n\nIt will require more work than a more common  name.",
            "Yes queen",
            "lmao you're so right"
        ]
    },
    "Twin names!": {
        "title": "Twin names!",
        "score": 55,
        "url": "https://www.reddit.com/r/NameNerdCirclejerk/comments/1dqrusl/twin_names/",
        "content": "We just found out we’re having fraternal boy/girl twins :3 I think it would be adorable to name them after our favorite gaming console the Nintendo DS! Girl would be DSi (pronounced like Daisy) and boy would be 2DS (pronounced like Titus) sooooo cutie right??",
        "num_comments": 17,
        "comments": [
            "this is honestly impressive",
            "So cute! We went with Sega & Genesis for a classic vibe 🥰",
            "Would actually be cute names for kitties...",
            "This is legit really creative 😅",
            "Why is it I have to check which sub this is two and three times when I see posts like this?",
            "Elon Musk is that you",
            "such genius names!!!!!",
            "😭 Just NO. Grow up and remember that these will be real people and not characters in a game and name them accordingly! If this is a joke..haha!",
            "I understand gaming theme names but I would not want to have to explain my name for my whole life. I would name and spell them Daisy and Titus. Otherwise pick two Nintendo characters that go together like Link and Zelda.",
            "Thanks for the idea! My friend runs a rescue for unwanted pregnant cats and always comes up with theme names. I’ll suggest gaming systems! That will get the kittens attention for sure."
        ]
    }
}