{
    "New post option: Advice Needed (unjerk)": {
        "title": "New post option: Advice Needed (unjerk)",
        "score": 47,
        "url": "https://www.reddit.com/r/NameNerdCirclejerk/comments/18pmaai/new_post_option_advice_needed_unjerk/",
        "content": "Unjerk meaning-  sometimes the users in circlejerk subreddits need to make serious posts, so an \"unjerk\" basically means a real post wanting real opinions. \n\nWe used to have weekly threads for such advice, but they have not been utilized in a long time, so enter our new post option. All advice asked without using the correct flair WILL BE REMOVED. \n\nDo not be mad about mean or blunt comments in such posts, this sub is for brutal opinions. ",
        "num_comments": 0,
        "comments": []
    },
    "What color names do you like as people names?": {
        "title": "What color names do you like as people names?",
        "score": 233,
        "url": "https://www.reddit.com/r/NameNerdCirclejerk/comments/1dqycc8/what_color_names_do_you_like_as_people_names/",
        "content": "What are your absolute favourite names that are borrowed from colours?\n\nI personally love:\n\n\\#b00b69 #ea7a55 #bada55\n\nIt's always funny to me how some nouns make it to be names and others don't (I can't imagine a child called #5ec5ee for example!). Though some do break through (like #042069, which I wouldn't personally think of for a name but have seen used).\n",
        "num_comments": 91,
        "comments": [
            "Cyan. Why aren't people doing it? It's a stellar upgrade from Diane.",
            "Sad beige. Saddy or Sadie would be cute nns.",
            "I have a baby Lavender! of course you do",
            "Off, True, and In-Living ",
            "I'm a dev and I use #B00B69 whenever I have to debug or test or demo. It's actually a really beautiful raspberry color!",
            "I'm gonna name my future child Professor Plum!",
            "Rainbow\n\nWhy limit yourself to a single color when you can be alllll the colors",
            "2 and 3 are ",
            "Dusty Rose.\n\n(I know someone who knows someone with this name)",
            "I actually know someone named Colour."
        ]
    },
    "my daughter wants to change her name. should I let my 10 year old make a life changing decision or wait until she’s an adult?": {
        "title": "my daughter wants to change her name. should I let my 10 year old make a life changing decision or wait until she’s an adult?",
        "score": 15,
        "url": "https://www.reddit.com/r/NameNerdCirclejerk/comments/1drcr8x/my_daughter_wants_to_change_her_name_should_i_let/",
        "content": "I have 10 year old named Kim (I wanted Kammy or Kimber but both were nixxed by her dad so we found Kim as a good compromise). I had no idea who Kim Kardashian was at the time (2014) and that had no influence on the name.\nShe now hates her first name and wants to change it. She likes \"Rainbow\" like her favorite My Little Pony Rainbow Dash\n\nI'm looking for opinions for changing a child's name at this age where her school, friends, and family all know her as Kim, to something that sounds like a 10 year old chose it. I have been telling her that she'll need to wait and change it as an adult but should I let my elementary aged child pick her own name and change it legally?",
        "num_comments": 7,
        "comments": [
            "She definitely wont regret changing it to Rainbow!",
            "Do not let a child change her name. She can pick a nickname if she wants.",
            "A friend named her daughter Rainebow & she always goes by Raine. So, Rainbow isn't a horrible name if it gets shortened to Rain :) Just a little different.",
            "This is the wrong sauce, I think.",
            "Yes, it is. I (not OP) don't feel like finding the correct one, but for those wondering, the original name was Kylie, and the desired name was Angel.",
            "[sauce](https://www.reddit.com/r/NameNerdCirclejerk/s/eE2KpjlyOo)"
        ]
    },
    "Is my baby name really that bad?": {
        "title": "Is my baby name really that bad?",
        "score": 39,
        "url": "https://www.reddit.com/r/NameNerdCirclejerk/comments/1dr0766/is_my_baby_name_really_that_bad/",
        "content": "The name I want for my future child is Tourmaline and EVERYONE scoffs at it! Nickname would be Tour, obviously. Maline is kinda cute too for a girl. Is it really that bad? I feel like I’ve heard crazier.\n\nI prefer it for a boy but I’d use it for a girl too, whichever comes first. It seems neutral!\n\n([sauce](https://www.reddit.com/r/namenerds/comments/1dr02w2/is_my_baby_name_really_that_bad/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button))",
        "num_comments": 31,
        "comments": [
            "Hi, its Aquamarines mom! Tour and Aqua should have a playdate soon ",
            "If you have to say, \"I feel like I've heard crazier\" ... That's not an accomplishment..",
            "As an alternate birthstone for the month of October, Tourmaline would only feel right if your baby was born in that same month. Just to be safe, test out Sapphire (in case youre early) and Citrine (in case youre overdue).",
            "For real I know a young woman with this name. Shes late teens/early 20s.",
            "Honestly, I think its cruel.",
            " Sounds like a new weight loss drug the FDA just rolled out to compete with ozempic lmao",
            "You must have watched a lot of Trollz growing up.",
            "Isn't Tourmaline the name of a character in \"Carnival Row?\" Iirc, that character is a prostitute",
            "Sorry, but this is bad.  Rethink this.",
            "I kinda like it "
        ]
    }
}