{
    "WE NEED TO RUN TRT FOR THE REST OF OUR LIVES JESSE": {
        "title": "WE NEED TO RUN TRT FOR THE REST OF OUR LIVES JESSE",
        "score": 6300,
        "url": "https://v.redd.it/v3hm6xtdahv81",
        "content": "",
        "num_comments": 78,
        "comments": [
            "The production value on this was actually surprisingly good lol",
            "Finally, some good fucking content.",
            "lmao i went on this sub to post some of my other content and I see my meme on the front page",
            "Makes me want to watch breaking bad all over again.",
            "This is amazing.  This is why I refuse to believe any questions here are actually “is this juicelord actually natty??”",
            "A r/nattyorjuice and r/okbuddychicanery crossover",
            "Jesse where did you hide it? Where did you hide the gear?\n\n“It’s under the sink”",
            "This was a masterpiece lol",
            "Legendary. I need more of this, mayn",
            "One of the best things I've ever seen lol"
        ]
    },
    "It’s gotta be gear, right? This is ridiculous💀": {
        "title": "It’s gotta be gear, right? This is ridiculous💀",
        "score": 78,
        "url": "https://v.redd.it/5oshekwp4f9d1",
        "content": "I have a lot on my mind but nowhere near enough words to express it. Take a look at the lifts, her voice, the fact she looks like she’s in her mid 20’s in terms of her face, etc. Think about the reproductive harm this could be causing down the line. I don’t know how a parent could be okay with this, lowkey sad imo.",
        "num_comments": 49,
        "comments": [
            "Someone call the fucking CPS",
            "Well she’s starting to look like a dude",
            "voice is on anavar level",
            "Gear. This is a child abuse at that age. Awful",
            "I was thinking she was a big chick but the voice changed my mind. I honestly don’t know",
            "Like father like son (daughter)",
            "lol it made her age 3-8 years. this is just sad",
            "I’ve seen her before I found her insta and then her dads and commented he was a pos and ofc he deleted my comment",
            "Just go ahead and transition at this point. 14 yr old girls on anabolics, tf",
            "She lifts more than most 30 year old dudes at my gym lmao.\n\nAnd its actual reps too, not that overarched 3 cm range bs."
        ]
    },
    "At what point he started steroids?": {
        "title": "At what point he started steroids?",
        "score": 254,
        "url": "https://www.reddit.com/gallery/1dqq2i2",
        "content": "",
        "num_comments": 102,
        "comments": [
            "That’s serious dysmorphia right there Jesus",
            "Jeez who is this juice cannon? A small country could feast on him",
            "At the point my member started throbbing",
            "Dude is male gaze maxxing",
            "sad that he looked the most aesthetically pleasing in the first one",
            "2nd Pic is definitely like the start , the first looks natty achievable",
            "three pics are the same guy?",
            "He was such a cute twunk in the first pic. Now he is a power bttm.",
            "Somewhere between one and two",
            "Steroids? What roids? That last pic is Natty AF. He just eats raw liver and injects Joe Rogan podcasts."
        ]
    },
    "Natty right?": {
        "title": "Natty right?",
        "score": 8,
        "url": "https://v.redd.it/4lo2zdd03i9d1",
        "content": "I believe he is\n",
        "num_comments": 19,
        "comments": [
            "If you think this isn't natty then you need to actually start going to the gym.",
            "Is natty achievable, doenst mean the dude is natty tho",
            "Natty.. definitely something, I want to achieve.",
            "Yeah he is likely natty",
            "Traps looks sus. But the rest doesn't scream juice.",
            "It’s natural lighting and it’s super cloudy. He’s a LOT bigger than he appears. \n\nThis sub is so easily tricked by lighting, poses, etc.",
            "Have you ever heard of muscle insertions",
            "Well, that's just your opinion man.",
            "I actually have pretty decent chest genetics. That's how I can tell juicy.",
            "Facts are not opinions and they don’t care about your feelings of inadequacy, dude is natural"
        ]
    },
    "This 34 month transformation": {
        "title": "This 34 month transformation",
        "score": 62,
        "url": "https://i.redd.it/ge2ov4qjqe9d1.jpeg",
        "content": "",
        "num_comments": 20,
        "comments": [
            "If I was the guy on the left, I’d probably also jump on the sauce if I knew the outcome was the guy on the right.",
            "3 years is a long time but this size of arms/shoulders being tall and lean is almost always juicy af",
            "Not natty but still amazing job.",
            "Tats that make you look like you have a rare skin condition are not for me.",
            "The lighting in the second photo is doing him a lot of favors.",
            "Going to say no. 34 months is not enough time to make such an extreme transformation naturally.",
            "you forgot to mention he failed to make any arm gains in his time from skinny fat to just skinny. Imagine having arms so weak they look like they would snap when you were doing sloppy lateral raises with your capped steroid delts and traps.",
            "Cut & juice... Juice & cut\n\nYou could see he already had muscles to begin with... and all those strongman equipment lying",
            "This is the top comment",
            "if NoFap is not natural then I agree: guy definitely is into no masturbation on mondays and wednesdays."
        ]
    }
}