{
    "Weekly Question Thread - Week of (June 24, 2024)": {
        "title": "Weekly Question Thread - Week of (June 24, 2024)",
        "score": 5,
        "url": "https://www.reddit.com/r/naturalbodybuilding/comments/1dnarmp/weekly_question_thread_week_of_june_24_2024/",
        "content": "Thread for discussing quick/simple topics not needing an entire posts or beginner questions.\n\n**If you are a beginner/relatively new asking a routine question please check out** [this comment](https://www.reddit.com/r/naturalbodybuilding/comments/14xoi9d/comment/jsrn352/?utm_source=share&utm_medium=web2x&context=3) **compiling useful routines or this** [google doc](https://docs.google.com/document/d/e/2PACX-1vSBhR8XoUVeljicTNWpECjBIL-ZmVHTxl51t0gcu1zuK8MbdwdWFmVbrSM12_SOpVNSUY5e7Nk1d0SN/pub) **detailing some others to choose from instead of trying to make your own and asking here about it.**\n\nPlease do not post asking:\n\n* Should I bulk or cut?\n* Can you estimate my body fat from this picture?\n\n**Please check this** [**post**](https://www.reddit.com/r/naturalbodybuilding/comments/14xoi9d/rnaturalbodybuilding_faq_post_beginnersnewcomers/) **for Frequently Asked Questions** that community members have already contributed answers to (that post is not the place to ask your own questions but you may suggest topics).\n\nFor other posts make sure to included relevant information such as years of experience, what goal you are working towards, approximate age, weight, etc.\n\nPlease feel free to give the mods feedback on ways this could be improved.\n\n[Previous Weekly Threads](https://www.reddit.com/r/naturalbodybuilding/search/?q=%22Weekly%20Question%20Thread%22&restrict_sr=1&sort=new)",
        "num_comments": 195,
        "comments": [
            "What are some exercises that target both rear and side deltoid?",
            "Anyone have any tips for getting better at Bulgarian Split Squats? I feel like my balance is always off. Should I brace something for balance or just do bodyweight until I get used to it and slowly increase weights?",
            "Does anyone workout on a zero carb diet at any stage of the year?",
            "You guys ever take a look at your sessions, focus on technical failure and realize how much ego lifting you’ve been doing? God damn…",
            "Currently entering week 3 of a 6 week cut and running a full body 5x program (most muscles trained directly 3x a week). I feel like I’m getting decent pumps on this, but next bulk I want to focus in on legs and arms.\n\nDo you think I should continue with high frequency full body, or switch to a 6x asynchronous Arnold split into 3 consecutive working days followed by a rest day? I love the efficiency of full body, but each target group having their own day is appealing.",
            "I’m currently doing 4 days a week upper lower but considering turning it into a 3 day rotating split so then on my 2 rest days in the week I can do an hour of cardio each day as I can’t go to the gym on the weekends, Is it worth decreasing my training days so I can focus on recovery and more on cardio to help with my cut?",
            "I've put on around 12 lbs in around two weeks since I began to take creatine. Is this a normal amount of weight gain in such a short time window?\n\nI've been around 170 lbs since high school, and I am a year from graduating college at this point. I've tried putting on weight before, but I haven't been too successful. I've decided to take my lifting seriously this summer, and I've been doing a PPL split and getting into the gym 4-5 times a week on average for a little over a month. I have been considering supplementing with creatine for a while, but after doing more research, I decided to pull the trigger. I read that weight gain was a \"side effect\" of taking creatine, from the needed increased water intake, but my goal was to gain weight, so I really didn't see that as much of a negative. I took a loading phase for two days, starting June 10th, where I took 20g spread out into 4 doses, and then I've been taking around 3-5g per day every day since then. In those two weeks, my weight has jumped from hovering around 170 lbs to consistently in the low 180s )around 182 average) as a base weight first thing in the morning. Is this a worrying amount of weight gain in such a short amount of time?",
            "I know there are a few common progression methods like DDP seems to be popular once you get to intermediate and beyond.  For people who do both low and higher rep ranges, lets say 5-8 vs 12+ do you find yourself using the same progression method on both or certain rep ranges lead to different progression strategy.",
            "As a more experienced lifter/ someone who gyms regularly what would you say to someone with less than one year of (consistent) training who regularly has small \"injuries\" like slight shoulder pain doing lateral raises, exertion headaches doing compounds (was doing pendulum squat) etc. I generally feel very stiff/ injury prone. I go to the gym a lot just because I love the gym and its actually harder for me to skip than it is to go. Does this sound like a standard case of over training? What would be a good 4 day split? (4 days would be a pretty large cut back for me).",
            "Obviously the precise number varies between exercises, but is there an average/heuristic for how much more you can lift with a barbell than dumbbells?"
        ]
    },
    "Selfie Saturday - (June 29, 2024)": {
        "title": "Selfie Saturday - (June 29, 2024)",
        "score": 1,
        "url": "https://www.reddit.com/r/naturalbodybuilding/comments/1dr8p4l/selfie_saturday_june_29_2024/",
        "content": "Thread for posting less detailed progress/humble brag pics, etc.",
        "num_comments": 0,
        "comments": []
    },
    "A bar, rack, chin up bar and bench": {
        "title": "A bar, rack, chin up bar and bench",
        "score": 4,
        "url": "https://www.reddit.com/r/naturalbodybuilding/comments/1dr8ldn/a_bar_rack_chin_up_bar_and_bench/",
        "content": "Is it possible to build a well rounded physique with just a bar, rack, chin up bar and bench. The reason I ask is when life gets busy and getting to the gym isn’t an option and space is limited at home would doing just bench, OHP, row, chin up, curls, barbell skullcrushers, squat, deadlift be enough?\n",
        "num_comments": 14,
        "comments": [
            "You have everything to hit almost all muscles I don't see why not, I would just invest in an adjustable dumbbell(s), they will take your set up to the next level.",
            "I mean sure why not will it be the best maybe not ? But you can definitely build muscle with this",
            "So the answer to your question is yes. But that isn't even your situation anyway. You're really asking if it's enough to hold you over if you can't get to the gym, and the answer is \"definitely yes\".",
            "Yes, you can build a great physique with limited equipment. There are a ton of great programs without machines in them. My physique is nothing crazy but I have built it with the equipment you have.",
            "Yes. That’s pretty much what I have, plus some boxflex adjustable dumbbells. I did add a cable machine that I got for $90 off FB marketplace. Keep an eye out for some good deals",
            "The only thing I have in addition is the cheapest lat pulldown from Amazon and a pair of loadable DB handles.  You don't need a fully stocked gym to get a good workout.",
            "I have a home gym with this stuff. I'm currently running a stronger by science hypertrophy template which doesn't rely on any machines. It's very cheap to buy and you can run it and other programmes included indefinitely",
            "I would buy a set of bands so you can do pushdowns to warm up your elbows before you do skullcrushers/jm press/overhead extensions etc that can make your elbows funky. But yea this is great, a pair of dumbbells in the future would be nice too.\n\nI recommend looking into bronze (and silver) era training methods. There are so many exercises possible with limited equipment.",
            "Well you'll need some plates too.",
            "You can do the Big-6 movements so yeah you can def build a mine physique. Just throw in some isolations to avoid spiderism and you’re golden."
        ]
    },
    "Can't sleep well unless in a large surplus after cutting": {
        "title": "Can't sleep well unless in a large surplus after cutting",
        "score": 2,
        "url": "https://www.reddit.com/r/naturalbodybuilding/comments/1drb0il/cant_sleep_well_unless_in_a_large_surplus_after/",
        "content": "I cut to about 8 or 9% body fat and was having sleep issues towards the end where I'd wake up 6 to 7 times per night and was always wide awake 1 hour before my normal wake time.\n\nSince then I've been upping calories and my sleep issues partially resolved. I would wake up ~3 times per night but still couldn't sleep till my alarm. I then upped calories again and my sleep fully returned to normal.\n\nThe problem is is that I gained a pound last week (using a 7 day simple moving average) and have been on my new intake of 3820 calories for 12 days, so this is for sure not just glycogen coming back. \n\nIdeally I'd like to gain 0.5 lb/week max, so I cut my calories by 250 last night, but my issue returned where I woke up 1 to 2 times more than normal and woke up 30 minutes before my alarm and couldn't go back to sleep.\n\nIt appears as though my sleep issues are only caused by my caloric intake and not my body fat percentage currently, but I don't want to pack on fat fast because I worked very hard to get to this point. Do you guys have any suggestions on things I could change to resolve my sleep issues without upping my calories again and gaining fat faster than necessary?",
        "num_comments": 0,
        "comments": []
    },
    "If body recomping is extremely ineffective how did NH succeed with it": {
        "title": "If body recomping is extremely ineffective how did NH succeed with it",
        "score": 33,
        "url": "https://www.reddit.com/r/naturalbodybuilding/comments/1dqsauy/if_body_recomping_is_extremely_ineffective_how/",
        "content": "Everyone slanders maingaining/recomping as an impossibility or a waste of time. I to partially believe this but out of fear of sticking to it long term myself, not because I think it is invalid. \n\nI know how to cut I can and have a million times but I hate it, I know how to bulk I can an have multiple times. \n\nBack to the main point, everyone else slanders recomping. However how did Natural Hypertrophy (an advanced or at least very end phase intermediate) see gains from it for 3 years even though he was already so far into training. I don't think I've seen any other examples of anyone that has stuck to it as long as him so he is the only person I can use as an example.\n\nIt makes me question the validity of bulking and cutting, because I personally remcomped for several months and continued to see progressive overload. However I then tricked myself into believing it was sub-optimal and wanted to bulk and cut again. Now when I was recomping I had the best balance of life quality I've had for years, aslong as the scale didn't move and I hit my protein targets I was happy. \n\nThis is something I genuinely want to try do long term, but with no references other than NH how can I be sure I wouldn't just waste a year",
        "num_comments": 98,
        "comments": [
            "Have you listened to his videos about it? You have to have excess fat and maintain for a long time. Most people don't want to be 'bear mode' for 3 years, especially when you can just cut down to be lean and then permabulk with a very small deficit and get to the same point after those same 3 years but you've been looking and feeling better the whole way up.",
            "Recomp deffo works when I was playing rugby I was doing 2 hard cardio’s session a week, playing on the weekend and cycling to works whilst also hitting the gym 3 days a week just ate loads and dropped body fat and gained size and strength but my god was it a lot of effort honestly don’t think one’s better than the other it’s just whatever fit your lifestyle and keeps you happy long term",
            "Very interesting question, thanks for starting this discussion! Theres a lot of so called knowledge that is propelled in the fitness community by youtube videos and poorly researched studies that we have just now come to look behind. Just a few years ago everyone thought compound lifts were the bread and butter of hypertrophy. Some guys didnt believe in that narration, did there own thing and more and more people hoped onto it until nowadays its pretty much understood that isolation exercises are key for building muscle mass. Maybe more people will follow NH and in two years it will be common knowledge in the fitness community that recomps work🤷‍♂️\nPersonally, Ive seen growth even on cuts with a reasonable calorie intake (2500kcal) so I wouldnt be too surprised if it turner out that recomps actually work.😊",
            "Recomping is great. Guys here are talking maximum efficiency for the quickest returns to get on stage. This is a natural bodybuilding subreddit.\n\nFor your everyday man stuff like recomping, shorter bulk/cutting cycles, less extreme cuts and bulks are all great things and I wouldn’t let people here sway you in that sense if your goal isn’t being the best natty bodybuilder on every stage you go to.",
            "what does succeed with it mean? he gained by far the majority of his muscle during the phases he was increasing bodyweight. \n\nthink of it like this - where are you right now and where do you need to be? if you're a year or two into lifting with no idea what you're doing, 150lbs and should be 200lbs at same bodyfat - you're not getting there by recomping. if you're 10 years into lifting and you're 197lbs and you should be 200lbs, you can bulk to 250lbs then back and maybe you'll put on those extra 2-3lbs but realistically probably not worth it. recomping works - but it's slow and it's suboptimal by definition - you are not putting yourself in the best position to maximize muscle growth. but all things considered, it's a valid route for quite a lot of us - especially more advanced guys who are close to tapped out and don't want to put on a lot of bodyweight.",
            "As long as you feed the body just enough to have energy for training and be able to progress in training whilst keeping energy expenditure high (cardio) you can recomp over the long term. Consistent and effective training whilst also doing cardio consistently long term. Energy expenditure has to be high, muscle stimulus high, training progression optimal. Natural Hypertrophy did it over 3 years, its a slow process and excessive bulking cycles dont give any benefit other than make you fat, especially for an advanced lifter",
            "It works if you have the genetics and bodyfat for it.",
            "I've tried recomping for 5 months (and my body fat % was definitely at least 17% for sure I think) and I couldn't handle it mentally. Take measurements of your waist and other body parts (Natural Hypertrophy did this). That might help motivate you. And also paying attention to the logbook. I suck at taking measurements. But then I bought a $30 smart tape that actually makes it easier for you because it will lock onto your body part with a push of a button. And then it takes your measurement and syncs it with your fitness app via bluetooth. And then you can monitor the measurement over time in a graph.\n\nOnce I started cutting, I felt much better psychologically because you can see the muscle definition more when you are leaner. Like Remote-Ad said, not many people want to go bear mode for 3 years. You have to be mentally tough for that.",
            "Seven years doing recomp here. Gained 15 pounds while dropping bf from 14% to 10% and I'm now 47 years old. I probably could have done better bulking and cutting but that sounds painful. I just eat and eat and eat while working out and doing tons of cardio. ",
            "A personal anecdote is a personal anecdote."
        ]
    }
}