{
    "Weekly Question Thread - Week of (June 24, 2024)": {
        "title": "Weekly Question Thread - Week of (June 24, 2024)",
        "score": 7,
        "url": "https://www.reddit.com/r/naturalbodybuilding/comments/1dnarmp/weekly_question_thread_week_of_june_24_2024/",
        "content": "Thread for discussing quick/simple topics not needing an entire posts or beginner questions.\n\n**If you are a beginner/relatively new asking a routine question please check out** [this comment](https://www.reddit.com/r/naturalbodybuilding/comments/14xoi9d/comment/jsrn352/?utm_source=share&utm_medium=web2x&context=3) **compiling useful routines or this** [google doc](https://docs.google.com/document/d/e/2PACX-1vSBhR8XoUVeljicTNWpECjBIL-ZmVHTxl51t0gcu1zuK8MbdwdWFmVbrSM12_SOpVNSUY5e7Nk1d0SN/pub) **detailing some others to choose from instead of trying to make your own and asking here about it.**\n\nPlease do not post asking:\n\n* Should I bulk or cut?\n* Can you estimate my body fat from this picture?\n\n**Please check this** [**post**](https://www.reddit.com/r/naturalbodybuilding/comments/14xoi9d/rnaturalbodybuilding_faq_post_beginnersnewcomers/) **for Frequently Asked Questions** that community members have already contributed answers to (that post is not the place to ask your own questions but you may suggest topics).\n\nFor other posts make sure to included relevant information such as years of experience, what goal you are working towards, approximate age, weight, etc.\n\nPlease feel free to give the mods feedback on ways this could be improved.\n\n[Previous Weekly Threads](https://www.reddit.com/r/naturalbodybuilding/search/?q=%22Weekly%20Question%20Thread%22&restrict_sr=1&sort=new)",
        "num_comments": 191,
        "comments": [
            "Not really a question as much as a rant.\n\nLeg presses.\n\nWhy, why, why, why do people stack them with every 45 in the gym and then do quarter reps? Just the sheer lack of any kind of common sense or self awareness is truly mind-blowing.",
            "Can I get a form check on my squat?\n\n[https://imgur.com/gallery/ppLSIAv](https://imgur.com/gallery/ppLSIAv)\n\nFor about 6 months I have been getting a lot of soreness/pain in my lower back from squatting. Have not made any big jumps in load or volume.",
            "Sup dudes,\n\nCurrently running Weightology's Upper Lower split: [Weightology Program.](https://weightology.net/muscle-gain/4-day-per-week-upper-lower-hypertrophy-split/)\n\nI’ve been training for 4/5 months, started with GVS's rampage full body workout but found it too time-consuming. Now, I’m a bit concerned about the lack of vertical pushing in this Weightology program. Is the incline bench enough to cover this?\n\nI’m also only doing low incline bench and no barbell bench press - is this okay?\n\nAdditionally, had an ankle issue since I started lifting, so I haven’t been doing legs. Tried re-introducing leg day but fucked my Achilles/lower inner, I assume from squats. Any good rehab recommendations for legs that will also help build muscle, considering my past knee problems?\n\n**TL;DR:**\n\n1. Is the incline bench enough to cover the lack of vertical pushing in the Weightology Upper Lower split?\n2. Is it okay to only do low incline bench and no barbell bench press?\n3. Any good rehab recommendations for legs that will also help build muscle, considering ankle and past knee problems?",
            "Hello,\n\nMy girlfriend and I train together 4 days a week. We have been doing PHUL (using 5/3/1 on barbell lists) for some time (2 years or so) and have made good progress, but have found ourselves stalling out. We feel like there just isn't enough volume, and would like to move to a full bodybuilding program. We really don't care about strength all that much.\n\nWe would like to keep the program as similar as possible, as its much more efficient when we workout together, but I care more about upper body (my legs are giant compared to the rest of me) and she cares more about legs and glutes. We typically workout solo for our 4th day anyway because of our schedule, so we thought about using day 4 to do this. (Obviously the optimal route is to just do solo all 4 days but we don't get a ton of time together and the gym is consistent)\n\nI've read some people doing a Push Pull Upper Lower or a Push Pull Legs Arms as a way to do this, but does anyone have suggestion to accommodate?\n\nI've thought about  \nPush, Legs, Rest, Pull, Arms for me and  \nPush, Legs, Rest, Pull, Lower Accessory for her\n\nIt would work well for her, but would pull followed by arms screw me over in places like Biceps being next to each other? Are there any good ways to pull off what we're trying to do here?",
            "What are some exercises that target both rear and side deltoid?",
            "Seemingly cannot progress on incline chest movements \n\nI’m doing an upper/lower body split. I’m progressing just fine on most exercises (ESPECIALLY squats) but one lift I’m struggling with to progress in weights and all is incline chest. Whether it’s a machine incline chest press or incline bench dumbbell press,  not sure what exactly causes it but the other chest exercise that I do (machine chest flyes) progresses normally.\n\nAnyone have any ideas or suggestions that could help me? Thanks a lot in advance",
            "Anyone have any tips for getting better at Bulgarian Split Squats? I feel like my balance is always off. Should I brace something for balance or just do bodyweight until I get used to it and slowly increase weights?",
            "What do cross body cable extension targets for triceps?\n\nLong head or short head? Or all heads with emphasis on the long head?\n\nAnswers I've seen online are pretty confusing.",
            "Does anyone workout on a zero carb diet at any stage of the year?",
            "You guys ever take a look at your sessions, focus on technical failure and realize how much ego lifting you’ve been doing? God damn…"
        ]
    },
    "Friday Fun Day - Talk about/post whatever, still be respectful! - (June 28, 2024)": {
        "title": "Friday Fun Day - Talk about/post whatever, still be respectful! - (June 28, 2024)",
        "score": 3,
        "url": "https://www.reddit.com/r/naturalbodybuilding/comments/1dqgy89/friday_fun_day_talk_aboutpost_whatever_still_be/",
        "content": "Thread for discussing whatever you want, its Friday!",
        "num_comments": 3,
        "comments": [
            "What’s everyone’s favorite upright row variations? I’ve worked up to 100 pounds on the ez bar and it’s making it difficult to get more than 8-10 reps without having to use cluster sets.  Thinking maybe machine upright row instead with a bar?",
            "Personally I don't really enjoy upright rows that much but 8-10 reps is fine 5-8 would also be good any rep range from 5-30 will/can create the same amount of hypertrophy if you train purely for hypertrophy I don't see much reason to go above 8 do the variation you are most comfortable with like the best and can progress on",
            "Cables with separate long D handles attached. Way, way better on my shoulders because of the extra free movement it allows. You could also use a long rope attachment."
        ]
    },
    "If body recomping is extremely ineffective how did NH succeed with it": {
        "title": "If body recomping is extremely ineffective how did NH succeed with it",
        "score": 28,
        "url": "https://www.reddit.com/r/naturalbodybuilding/comments/1dqsauy/if_body_recomping_is_extremely_ineffective_how/",
        "content": "Everyone slanders maingaining/recomping as an impossibility or a waste of time. I to partially believe this but out of fear of sticking to it long term myself, not because I think it is invalid. \n\nI know how to cut I can and have a million times but I hate it, I know how to bulk I can an have multiple times. \n\nBack to the main point, everyone else slanders recomping. However how did Natural Hypertrophy (an advanced or at least very end phase intermediate) see gains from it for 3 years even though he was already so far into training. I don't think I've seen any other examples of anyone that has stuck to it as long as him so he is the only person I can use as an example.\n\nIt makes me question the validity of bulking and cutting, because I personally remcomped for several months and continued to see progressive overload. However I then tricked myself into believing it was sub-optimal and wanted to bulk and cut again. Now when I was recomping I had the best balance of life quality I've had for years, aslong as the scale didn't move and I hit my protein targets I was happy. \n\nThis is something I genuinely want to try do long term, but with no references other than NH how can I be sure I wouldn't just waste a year",
        "num_comments": 94,
        "comments": [
            "Have you listened to his videos about it? You have to have excess fat and maintain for a long time. Most people don't want to be 'bear mode' for 3 years, especially when you can just cut down to be lean and then permabulk with a very small deficit and get to the same point after those same 3 years but you've been looking and feeling better the whole way up.",
            "Recomp deffo works when I was playing rugby I was doing 2 hard cardio’s session a week, playing on the weekend and cycling to works whilst also hitting the gym 3 days a week just ate loads and dropped body fat and gained size and strength but my god was it a lot of effort honestly don’t think one’s better than the other it’s just whatever fit your lifestyle and keeps you happy long term",
            "Very interesting question, thanks for starting this discussion! Theres a lot of so called knowledge that is propelled in the fitness community by youtube videos and poorly researched studies that we have just now come to look behind. Just a few years ago everyone thought compound lifts were the bread and butter of hypertrophy. Some guys didnt believe in that narration, did there own thing and more and more people hoped onto it until nowadays its pretty much understood that isolation exercises are key for building muscle mass. Maybe more people will follow NH and in two years it will be common knowledge in the fitness community that recomps work🤷‍♂️\nPersonally, Ive seen growth even on cuts with a reasonable calorie intake (2500kcal) so I wouldnt be too surprised if it turner out that recomps actually work.😊",
            "Recomping is great. Guys here are talking maximum efficiency for the quickest returns to get on stage. This is a natural bodybuilding subreddit.\n\nFor your everyday man stuff like recomping, shorter bulk/cutting cycles, less extreme cuts and bulks are all great things and I wouldn’t let people here sway you in that sense if your goal isn’t being the best natty bodybuilder on every stage you go to.",
            "what does succeed with it mean? he gained by far the majority of his muscle during the phases he was increasing bodyweight. \n\nthink of it like this - where are you right now and where do you need to be? if you're a year or two into lifting with no idea what you're doing, 150lbs and should be 200lbs at same bodyfat - you're not getting there by recomping. if you're 10 years into lifting and you're 197lbs and you should be 200lbs, you can bulk to 250lbs then back and maybe you'll put on those extra 2-3lbs but realistically probably not worth it. recomping works - but it's slow and it's suboptimal by definition - you are not putting yourself in the best position to maximize muscle growth. but all things considered, it's a valid route for quite a lot of us - especially more advanced guys who are close to tapped out and don't want to put on a lot of bodyweight.",
            "People tend to think of body recomp as the “best of both worlds”, and in that sense it’s definitely a myth. You can indeed body recomp, but it takes LOTS of time. 3 years to lose 3-4% body fat, when you could lose that in a couple months.\n\nRecomping is totally fine and works well if you’re already reasonably happy with where you are. I’ve heard Bald Omni Man argue, and I agree, that it works BETTER for advanced lifters because you have a better idea of what actually works for you and can focus on your bread and butter.\n\nBut yeah, just to reiterate, people get into trouble when they think it’s a shortcut and then get salty when they don’t build muscle and lose fat quickly.",
            "As long as you feed the body just enough to have energy for training and be able to progress in training whilst keeping energy expenditure high (cardio) you can recomp over the long term. Consistent and effective training whilst also doing cardio consistently long term. Energy expenditure has to be high, muscle stimulus high, training progression optimal. Natural Hypertrophy did it over 3 years, its a slow process and excessive bulking cycles dont give any benefit other than make you fat, especially for an advanced lifter",
            "It works if you have the genetics and bodyfat for it.",
            "I've tried recomping for 5 months (and my body fat % was definitely at least 17% for sure I think) and I couldn't handle it mentally. Take measurements of your waist and other body parts (Natural Hypertrophy did this). That might help motivate you. And also paying attention to the logbook. I suck at taking measurements. But then I bought a $30 smart tape that actually makes it easier for you because it will lock onto your body part with a push of a button. And then it takes your measurement and syncs it with your fitness app via bluetooth. And then you can monitor the measurement over time in a graph.\n\nOnce I started cutting, I felt much better psychologically because you can see the muscle definition more when you are leaner. Like Remote-Ad said, not many people want to go bear mode for 3 years. You have to be mentally tough for that.",
            "Seven years doing recomp here. Gained 15 pounds while dropping bf from 14% to 10% and I'm now 47 years old. I probably could have done better bulking and cutting but that sounds painful. I just eat and eat and eat while working out and doing tons of cardio. "
        ]
    },
    "HELP - How do you guys mitigate hunger? (sorry mods, for posting this again, it got auto denied)": {
        "title": "HELP - How do you guys mitigate hunger? (sorry mods, for posting this again, it got auto denied)",
        "score": 17,
        "url": "https://www.reddit.com/r/naturalbodybuilding/comments/1dqs9sg/help_how_do_you_guys_mitigate_hunger_sorry_mods/",
        "content": "I (25 Male 5'9 190 not super lean) have been (sort of) bodybuilding for about 6 years now on and off. I love pro bodybuilding (like watching it) I love fitness science, Ive been watching Mike Isratel, MPMD, and Jeff Nippard for literally 20% of my life now.\n\nI have a huge problem tho. every time I try to cut, I cant handle my hunger, I fuck up my cut, I get disheartened, and I stop lifting for months at a time, so I really haven't made any progress. I really have only ever run 1 successful cut (see image in comments)\n\nI know analytically how to structure an effective cut, but when it comes down to it, I just cant handle being hungry.\n\ndo you all have any tips? foods? supplements?\n\nPS: I know I have way bigger problems in terms of motivation, but I'm not here to hear \"just try harder mate\"",
        "num_comments": 82,
        "comments": [
            "Lost about 40 pounds in the last 15 months after being a fat power lifter. Now getting somewhat lean. \n\nStaying busy / occupied with things other than food helps. \n\nAlso learning to enjoy the hunger because you are getting closer to your goals",
            "What cut are you going for? for most people beyond -500 calories is going to bee too much and will increase muscle lossl, and will make hunger unmanagable.\n\nThe simple truth is that fruits and veg carry very few calories and fill you up really well. I always eat a lot of them but in a cut they are indispensable and are honestly as important as meeting your protein target because of how filling they are.\n\nLook up the food satiation index. Some foods such as potatoes and eggs are very satiating on their own so give them priority.\n\nGoes without saying but the less processed stuff, cooking fats, unnecessary carbs etc you eat, the easier the cut will be.\n\nAnd finally realize that you will, no matter what, feel hungry at times. It's your body telling you that you need to eat more, which is true, so take it as a natural thing and a sign that you are, indeed, cutting.",
            "Few things that worked for me and some friends:\n\n  \n1. Just get used to the hunger. One of my friends changed to a single meal (dinner) that was extremely nutrient dense (rich in protein, complex carbs, fruits, etc.) and his body naturally adjusted to only having that one meal.\n\n2. A lot of us just protein powder it when we're hungry, lol. Simple solution.\n\n3. Celery and berries. This is my personal go-to. If protein powder isn't enough, I'll just chomp down some celery and/or blueberries and I'm good to go until I can have a meal.\n\n4. Two glasses of water and one slice of whole wheat bread. Maybe even some peanut butter on the bread if I have calories to spare. This is something I do when I'm out of blueberries and celery.\n\n5. Look in the mirror, slap myself, and splash some cold water on my face while whispering, \"Don't be a bitch.\"",
            "I had this exact same problem. The secret is low calorie foods that you snack on throughout the day.\n\nTomatoes, jarred pickles and ham are GOATED. Tomatoes and jarred pickles are especially special because you can eat kgs of them and still barely eat any calories. Ham is a bit more caloric (around 100 calories per 100g) but it’s still low enough in calories to where you can afford to snack on it while also getting some protein in there.",
            "Drink water. Eat pickles. Fiber capsules added in.",
            "Hunger is mostly psychological unless you are eating a starvation diet (like 1,500 cal). You have to preoccupy yourself with things other than food. A lot of people are going to say eat lean proteins, eat lots of vegetables and fruits low in calorie density. But in truth these things do not stave off specific cravings. If you have the craving for a Crumbl cookie, 0% MF no sugar added Greek Yogurt with strawberries and banana is not going to satisfy that craving. Go play video games or watch Netflix or something to take your mind off food. And it's okay to have some sweets or whatever within moderation. If you have a craving for a cookie, it's okay to have cookies within moderation. Maybe not Crumbl cookies since those are big and have lots of calories. But you can buy like a single cookie at McDonald's, Starbucks or whatever. Or if you want to save money, buy like a 10-12 pack in the supermarket, you can have one cookie and then freeze the rest in freezer bags so that you can exercise portion control.\n\nToday I had a glass of 1% MF chocolate milk post-workout (145cal), a glass of grape soda pre-workout (119 cal), I'm going to have a jumbo hotdog (250 cal) later today. My 7-day moving average dropped -11.7 lbs in 16 weeks 3 days. It's not actually my day-to-day eating that has slowed down my weight loss. You can integrate calorie dense food day to day and still lose weight. It's the untracked social cheat meals with friends actually (I had an Italian wedding last month too) that have screwed me over. It's hard for me to justify paying like $20 at a restaurant for skinless chicken breast, rice and vegetables (if they'll even make it for me in the first place. The items on restaurant menus tend not to be very macro friendly) when there's skinless chicken breast, rice and vegetables at home for a small fraction of the price. When I pay good money at a restaurant, I want to enjoy myself. And I'm really lazy when it comes to cardio. My first cut was a lot easier because I had no social life back then and I was eating what was practically a starvation diet then. And I was running 3-4 days a week on top of that.\n\nOne easy substitution is to avoid drinking your calories (I break this rule for pre-workout because I like to get some carbs in without having a heavy stomach when I train). I can't tell the difference between Diet Coke or Coke Zero from Coke. Unless its side-by-side maybe. I also can not tell the difference between skim milk and 2% milk. That saves me about 5g of fat per 250ml serving (45 calories) right there. Just be mindful of not allowing your calories from fat to dip below 20%. So mix things up with 2% or 3.25% milk, fattier cuts of meat, eggs, cheese, cream, peanut butter, etc.\n\nI used to be a binge eater. I'm a 167cm (5'6\") turbo manlet and got up to close to 180 lbs when I was 28 years old. And again at 29. I mostly hung around 160+ lbs most of my adult life. I cut down to 126.4 lbs September 2022. Bulked to 152.8 lbs. And now I've been cutting again and down to 139.9 lbs. Binge eating can be something that you can overcome mentally.",
            "In my case I have always had low appetite, so cutting is ideal. I could literally survive off of one meal a day",
            "Find low calorie foods that fill ya up for awhile. In my case Greek yogurt with some fruit thrown in is super clutch.",
            "for me personally i cut my hunger dramatically with sweet potato and chicken breast salads then straight after 2 huge glasses of cold water. It works for 4 - 5 hours or even longer if im busying myself with work or study. However its what i’ve found works for me personally so you might be different but gl anyway",
            "Is it too big of a deficit?"
        ]
    },
    "How important are machines in making progress?": {
        "title": "How important are machines in making progress?",
        "score": 23,
        "url": "https://www.reddit.com/r/naturalbodybuilding/comments/1dqiusn/how_important_are_machines_in_making_progress/",
        "content": "So my gyms doesn't have a hack squat machine, or many of the nice back machines or different angles of rows; its pretty much 2 deadlift platforms, 2 squat racks, a bunch of dumbbells, only like 3-4 plate loaded machines, a cable machine and then spring loaded machines. How important is it to have a few machines to truly progress, or can it be done with barebones barbells and dumbbells and a couple machines sprinkled in?",
        "num_comments": 40,
        "comments": [
            "In a weird way, I think a gym like that is actually ideal for a lot of newer lifters because you can’t really suffer from paralysis by analysis. Do your squats, hip hinges, rows and presses with some isolations thrown in, get stronger over time, and voila.",
            "You can 100% get big and jacked with barbells and dumbbells.",
            "Bronze-era bodybuilders didn't even have proper equipment for bench press. Dudes in prison have rudimentary equipment, and though steroid use in prison can be a thing, the needle alone can't make physiques like that.\n\nYou can 100% make progress using just about anything.\n\nSome movements will be very difficult to safely hit failure if you like going all the way to 0 RIR, but as long as you're smart with your exercise selection, form, and progression - you'll do just fine.",
            "In my opinion you can have very solid progress in your legs with just few main exercises: a compound squat movement (Back squat, front squat), compound hamstring movement: DL, SLDL, RDL and some assistance work, exercises like lunges, hack deadlift, good mornings, etc. Depends what you want to emphasize. There is a lot of exercises you can do with barbells and machines certainly help but they are no way necessary",
            "After about 3 years what I’ve learned is barbell/dumbbell/machine doesn’t really matter. Diet, rest, and intensity are going to be the biggest driver of results.",
            "Machines are nice but absolutely not necessary and for some can be a hindrance. You’re fine.",
            "I’m in a pretty similar type of gym and I think it works for your first few years of bodybuilding if you’re smart about it. I’ve been training consistently for about 3ish years now and happy with my physique with what I’ve built at the gym training as a bodybuilder and it’s all cheap equipment pretty much. \n\nYou can do so much like have different variations of a movement on barbells or dumbbells or even on the machines you do have access to. You could just add another rep range or you could add a pause or do unilateral movements. There’s so much you can do if you think about it and get a good few years out of a gym like that.",
            "I have found that once I know how to set myself up on a machine, which is itself simple after you first figure it out, my form is easy to set and maintain, and that is all consistently repeatable day to day. With free weights, the set up is critical before every set (this can be a pain or at least waste time when supersetting) and then it’s easier to let my form degrade throughout the reps and sets because you aren’t fixed in position like you more or less are with machines. So to me, the stimulus to fatigue ratio combined with the convenience of machines makes them ideal for many exercises, which is the intention of machines in the first place beyond injury prevention and dictating a spectrum of ROM if not form. But machines are far from necessary. So with that said, life has many seasons, one day you’ll come back around to being around more machines, in the meantime embrace what you have because there are pros and cons to everything.",
            "Machines r important to me for 2 reasons. First being u can go to true failure without compromising form and minimal chances of injury. Second is that I realized it carries over to compound lifts. For example when I started pushing myself on leg press, my barbell squat increased as well in a sense that now I could focus more on stabilizing than lifting heavy (relatively speaking).",
            "It can be done without machines. They are preferable for some things like pushing to failure, isolating a muscle, etc, but there are plenty of big jacked people who don't use them. They aren't necessarily, but theyre helpful. It's probably tough to quantify. \n\nIs this the only gym you have access to? Have at it. Is there one the same distance and similar price with more machines? That one will probably be better for body building."
        ]
    }
}