{
    "Stel dat de hel een kantoor is, wie zijn dan je collega’s?": {
        "title": "Stel dat de hel een kantoor is, wie zijn dan je collega’s?",
        "score": 493,
        "url": "https://www.reddit.com/r/nederlands/comments/1dlou87/stel_dat_de_hel_een_kantoor_is_wie_zijn_dan_je/",
        "content": "Hallo.\n\nStel dat u sterft. Aan longembolie bijvoorbeeld. Terwijl uw nabestaanden rouwen krijgt u slecht nieuws: helaas, u gaat naar de hel! Had u maar geen belastingfraude moeten plegen. De duivel legt u uit dat de hel een kantoor is waar u 12 uur per dag moet werken. Ik ben benieuwd hoe jullie persoonlijke helkantoor er uitziet. Ik begin, want zo ben ik dan ook wel weer.\n\n**Bernd, 36, IT.** Heeft op vrijdag altijd een Rick & Morty trui aan. Stinkt. Ademt KEIHARD door z’n neus als een soort te vroeg geboren hond met de levensverwachting van een speelfilm.\n\n**Sophie, 30, HR.** Zogenaamd hippe kantoormuts die altijd vraagt hoe je weekend was maar liever doodgaat dan oprecht naar het antwoord luistert. Kantoor-gestapo. Schutzstaffel onder het systeemplafond. \"Rookt niet\", maar heeft deze maand al 8 peukies van je lopen bietsen.\n\n**Brainpower (de rapper), werkgever** lijkt mij de meest verschrikkelijke baas. Die zegt dan dingen als “ja, weetje, NAS zei het al op Illmatic, snap je, sleep is the cousin of death. In onze sector kunnen we gewoon niet lopen suffen, snap je? Er zit veel management-kennis in die old school shit. Aight, stuur jij die e-mail nog? Dope, dope, dope”.\n\n**Harko, 48, Aanwezig.** Heet Harko dus daar ga je al. Zegt dat zijn vrienden hem \"Harko Barko Neukmachien\" noemen. Enorme beschuitlul die om wat voor reden dan ook jouw afdelingshoofd is. Baliekluiver van de hoogste orde. Vraagt de hele tijd \"zou je haar doen\" ie buiten een vrouw ziet lopen.\n\nNu ben ik benieuwd naar jullie persoonlijke hel.",
        "num_comments": 286,
        "comments": [
            "Klaas (60). De collega die 10 jaar geleden jouw functie deed maar toen een burn-out kreeg. Na een lang traject zijn ze erachter gekomen dat hij die functie niet aankon. Gelukkig hadden ze een passende functie voor hem gevonden en zit hij nu vlak bij je. Bemoeit zich met alles wat je doet en denk dat hij het het best weet. Want hij is ouder en heeft deze functie gedaan. Als je iets naar de printer stuurt haalt hij het op, leest het door en geeft er ongevraagde kritische opmerkingen op. Ook alle stukken die op je scherm te zien geeft hij ongevraagd advies. Na ieder telefoongesprek vraagt hij waarover het gaat en zegt hij hoe hij het dat zou doen en dat zijn methode de beste was.",
            "Jennifer, 20 jaar. Heeft een aura om zich heen van goedkope parfum die in een omgeving van 30 meter de haren uit je neus doet branden. Verder heeft ze intens lange nepnagels die je de HELE dag hoort tikken tegen alles wat ze vast heeft. Al haar eten maalt ze onder een luid smakkend geluid. Belt 6 van de 8 uur, het liefst privé, met haar telefoon in de hand op speaker stand met een heftig aangemeten accent, waarbij het altijd gaat over de loser-vriendjes van haar vriendinnen, die altijd vreemdgaan. Waar je ook zit, ze zit altijd op het bureau tegenover je.\n\nBonuspunten: ze eet in de lunch alleen maar tonijn met ui.",
            "Marcel 38 jaar. Heeft de behoefte om alles wat hij doet ook hard op te zeggen. \"Zooo even naar de printer lopen\", \"Ik heb net zus en zo afgemaakt\". Vind het ook nodig om e-mails die naar iedereen zijn gestuurd voor te lezen.\nControleerd 2 keer per uur zijn app en roept uit hoe efficient de zonnepanelen van zijn vinex huis dit uur zijn. Vanaf juni kan hij het alleen nog maar over zijn caravan en de route naar Zuid-Frankrijk hebben. Iedereen weet wel dat hij op zwarte zaterdag gewoon achteraan gaat sluiten.",
            "Conny, 58, aan haar 2e man en 3e burnout bezig. Emotionele stabiliteit van een thermometer, kan al 15 jaar niet meekomen met technologische veranderingen, alles is te veel en moet vooral veel rust pakken en haar werk begrenzen van haar reïntegratiecoach. Is 15 weken per jaar op vakantie.",
            "Irene, 53. Enorm onzeker, vraagt voortdurend om hulp maar zonder t echt te vragen, gewoon doorgaan met t bloed onder je nagels vandaan te halen tot je uit wanhoop je hulp aanbiedt. Geen zelfreflectie en altijd enorm gepikeerd als ze niet gevraagd is te wandelen ook al ga je elke dag om dezelfde tijd.",
            "Jan Wim (64). Is de hele dag aan het bellen en maakt dan 10x het zelfde grapje aan de telefoon. Verdient 4x jouw salaris, maar moet wel 3x per dag vragen hoe je ook alweer dat pdfje in een mail doet. Print elk mailtje uit voor het geval hij het nog nodig heeft.",
            "Judith, 32, is altijd negatief. Over alles, maar dan ook echt álles. Zucht 200 keer per dag. Printer kapot? Natuurlijk dat overkomt háár weer! Slecht weer? Precies, Judith is op de fiets en jij mag haar onvree 12 uur aan een stuk horen. Alles is 1 groot management complot om haar weg te pesten en te kloten.",
            "Dit is een geweldige post overigens. Wat een herkenbare verhalen. Werken we allemaal bij elkaar op kantoor?",
            "Maria (gefingeerde naam), 42 jaar, Helpdesk. \nPraat aan 1 stuk door over van alles en nog wat. Totaal geen touw aan vast te knopen. Ik ben serieus al 10 minuten uitgecheckt en gaat maar door. Moet op maandagochtend eerst aan haar directe collega haar weekend vertellen, wat altijd een heel lang verhaal is over haar cavia's. Echter zit ik in dezelfde ruimte en hoor deze lange verhalen dan ook altijd. Maria Junior en Marco de derde doen echter nooit iets spannends, zelfs niet voor cavia standaarden. Maria huilt ook vaak om van alles en nog wat. Altijd in tranen.",
            "Yowendiah, 23, junior medewerker: \n\nClaimt constant dat ze over 5 jaar 'deze tent runt'. Geeft jouw onrealistische deadlines voor werk dat ze eigenlijk zelf zou moeten doen. Je baas vind dit om één of andere reden ok. \n\nNaast haar werk influencer. Komt langs als je in diepe focus zit om je even het onderwerp van haar livestream te maken, waarin ze kritiek op jouw kleding keuze uit. \n\nLoopt regelmatig kantoor uit om een koffie van EUR 8 te halen, om die vervolgens op te drinken bij het kantoor koffie apparaat en zeikt over hoe slecht de koffie op kantoor is en verteld hoe dat het eerste is dat ze over 5 jaar gaat veranderen. Vraagt je waarom jou waarom je zo lang pauze neemt wanneer haar werk nog niet af is. Er wacht een super belangrijke klant op.\n\nWordt boos als je haar naam verkeerd spelt."
        ]
    },
    "Omvolking?": {
        "title": "Omvolking?",
        "score": 105,
        "url": "https://i.redd.it/aojy1b4xn28d1.jpeg",
        "content": "De laatste dagen zie ik veel ophef over de term “omvolking”. Dit vind ik begrijpelijk gezien het woord, al klinkt het neutraal, oorspronkelijk uit het Nazi-gedachtengoed lijkt te komen. Daarnaast wijst het volgens de definitie op het planmatig vervangen van een bevolking, wat het technisch gezien inderdaad een complottheorie maakt.\n\nAan de andere kant kunnen we moeilijk ontkennen dat er in West-Europa een ethno-demografische verschuiving gaande is. Het aantal Nederlanders met een niet-Westerse migratie-achtergrond is de afgelopen decennia toegenomen, en ze krijgen gemiddeld meer kinderen.\n\nAls deze trend zich voortzet (wat niet met zekerheid te zeggen is) kan dit er op lange termijn toe leiden dat autochtone/blanke/witte Nederlanders die lang de meerderheid van de bevolking hebben uitgemaakt, een minderheid zullen gaan vormen.\n\nEven los van of dit je waarschijnlijk lijkt, en wat je van dit (hypothetische) fenomeen vindt. Wat zou een gepaster woord zijn om het te omschrijven?",
        "num_comments": 267,
        "comments": [
            "De term waar je naar opzoek bent is 'vervangingsmigratie', ['replacement migration' in het Engels.](https://en.m.wikipedia.org/wiki/Replacement_migration)\n\nHet verschil in de kern is dat omvolking de moedwillige intentie verondersteld van een 'elite' of overheid en dat vervangingsmigratie een fenomeen is dat nou eenmaal plaats vindt als daar economische en demografische redenen voor zijn.",
            "In je post doe je alsof het eigenlijk vooral een beetje een semantische discussie is. Maar dat is het niet. De demografische veranderingen die jij beschrijft zijn helemaal niet hetzelfde fenomeen als omvolking. Omvolking als term impliceert een soort sinister complet van 'de elite' om demografische veranderingen te forceren in combinatie met een racistisch/ethnische hiërarchie die impliceert dat bepaalde 'demografische elementen ' minderwaardig zijn. Dat is iets heel anders dan zomaar een veranderende samenstelling van de bevolking.\n\nKom dus alsjeblieft niet aan mee die soort 'ja nou ja potato potato we weten toch waar we het over hebben, namelijk over veranderende bevolkingssamenstelling'. Omvolking is echt iets heel anders.",
            "Mensen kunnen hoog of laag springen wat ze willen wat betreft deze term, het is en blijft een term die door Nazi Duitsland werd gebruikt voor de plaatselijke bevolking die zou worden verdrongen en ondergeschikt worden gemaakt.\n\nDan is het denk ik vooral de vraag of je je daarmee wilt (laten) associëren. Lijkt mij van niet",
            "Ik vind etnische verschuiving niet interessant, maar maak me wel zorgen om culturele veranderingen",
            "Het is het best te vergelijken met de migratie van de Germanen naar wat vandaag de dag Engeland is. Dat is geleidelijk gegaan (honderden jaren), en waarschijnlijk ook op uitnodiging van de Kelten zelf. Ook zijn de Kelten als grootste bevolkingsgroep vervangen door Germanen. Hoe je het noemt is verder minder belangrijk.\n\nMaar het is zeker niet iets waarvan ik hoop dat het in West-Europa gaat gebeuren met betrekking tot de grote aantallen niet-Westerse migratie.\n\nDe grote migratie lijkt me een gepaste term, als modern equivalent van de volksverhuizingen. Het hele complotterige van de term omvolking moeten we niet willen gebruiken.",
            "Waarom moet er een specifiek woord voor zijn? Je kan als je het over dit onderwerp hebt toch gewoon praten over de gevolgen van massa-immigratie,  de etnische verandering van de bevolking, een etnische verschuiving, of, als je er echt heel nodig 1 woord voor wil hebben, dan zou je iets kunnen verzinnen als: volksverandering.\n\nHet is echt niet zo moeilijk om hier een andere term voor te verzinnen die niet geleend is van de Nazis.\n\nDaarnaast kan je je ook nog eens afvragen in hoeverre dit wel de correct probleemanalyse is. Je afkomst of huidskleur is namelijk niet bepalend voor wat je geloofd, denkt, doet of zegt. De reden dat mensen over dit onderwerp praten, is echter vrijwel altijd wel gebaseerd op die aanname.\n\nJe hebt deze term dus helemaal niet nodig om de daadwerkelijk problematiek te bespreken. Zo zou je bijvoorbeeld kunnen zeggen dat er te veel immigratie is in een korte tijd, wat de sociale cohesie onder druk zet, en dat Nederland er ook te weinig aan doet om mensen daadwerkelijk te integreren. Daarnaast mogen er ook best wat strengere eisen gesteld worden. Enz enz.\n\nVoor dit alles heb je de term \"omvolking\" echter niet nodig. Dus nogmaals: waarom moet hier een woord voor bestaan? Wat is de noodzaak en relevantie van die specifieke term?",
            "Je zou ook kunnen zeggen dat Nederlanders steeds minder kinderen krijgen. Als elk Nederlands stel 4 tot 6 kinderen krijgt dan is die omvolking zo klaar.\n\n\nAls je dat niet doet maar wel verwacht dat allerhande werk gedaan wordt dan is er geen plan nodig.",
            "Het is simpelweg een woord dat is bedacht omdat het neutraal KLINKT. Omdat je in bepaalde kringen niet meer weg kan komen met \"die vieze vuile buitenlanders zijn het probleem\" zeg je gewoon dat je \"bezorgd\" bent over deze \"omvolking\". Maar wat ze nog steeds wíllen zeggen is \"ik haat [vult u maar een bevolkingsgroep in]\".",
            "Dit soort \"ja het is wel een nazi woord maar is het ook niet een heel klein beetje waar\" is niks meer dan gewoon iedere keer die grens een klein beetje proberen op te schuiven.",
            "Maakt het wat uit dat blanke mensen een minderheid worden? Zijn we wereldwijd toch ook al?"
        ]
    },
    "Soms ben ik er even helemaal klaar mee": {
        "title": "Soms ben ik er even helemaal klaar mee",
        "score": 250,
        "url": "https://www.reddit.com/r/nederlands/comments/1dle92l/soms_ben_ik_er_even_helemaal_klaar_mee/",
        "content": "En da  bedoel ik met de gebruikelijke file op mijn woon werk traject. Het gezeik van vriendinnen over andere vriendinnen en het zwarte gat van 30 zijn en nog geen eigen woning hebben of een vriend. Laat staan kinderen of de wens hierin.\nHet meest ben ik soms klaar met de mensen I'm het verkeer die zo hard weerspiegelen hoe de maatschappij werkt. Moet jij invoegen? Lekker je eigen probleem. Ik weer 1,5 km omrijden. Ik ben er zo zo zo klaar mee. En dan moet ik de volgende generatie ook opvoeden zonder respect naar anderen, docenten of producten op school. Hoe dan?!? Ik haf zoveel respect en was al bang voor een blik. Ik snap echt niet meer wat er nou veranderd is.",
        "num_comments": 128,
        "comments": [
            "Niks mis mee om gewoon even van je af te schrijven! Laat de zure reacties maar los. \n\nFijn weekend, probeer wat op te laden. En hopelijk komt er binnenkort iets leuks op je pad waardoor je ineens héél anders tegen de dingen aankijkt.",
            "Zo is de maatschappij, wees zelf lief naar anderen. Zodra ze het zien zullen ze veranderen. Lekker gaan slapen, morgen is er weer een mooie zonnige dag. Het komt wel goed ;)",
            "Het is sowieso niet al te best gesteld met respect in NL en het wordt steeds erger. Als ik uit een ander land terugkom van vakantie is het vaak nog opvallender hoe egoïstisch en roekeloos onze cultuur over het algemeen is geworden. \n\nCultuurrelativisme is hiervoor niet op z'n plek aangezien er echt iets asociaals in onze maatschappij zit door de \"IK doe wat IK wil\"-mentaliteit door het verheerlijken van ieders recht op wat ie dan ook maar wil zonder rekening te houden met de ander, aangewakkerd door de kapitalistische ratrace uiteraard.\n\nDe relatie tussen het individu en het collectief is compleet zoek in onze maatschappij.",
            "Misschien ben jij wel veranderd? Misschien een gekke opmerking, maar het zijn dezelfde eeuwenoude patronen van opbouw en verval die zich uitspelen in de samenleving, in de stad, dorp, de wijk waar je leeft, de straat, het buurtje, de familie, het gezin.\n\nTegelijkertijd leven we blijkbaar nog in voldoende luxe om ongestraft elkaar (en daarmee onszelf) als objecten te behandelen, het gevolg is leegte, onbestemd zijn, een gevoel van er niet bij horen, compensatiegedrag, maar niets kan echte gemeenschap kopen.\n\nIk ben iets over level 40 en heb gelukkig niet echt de behoefte om mezelf voort te planten, dat ligt ook een beetje lastig :) maar uiteindelijk ligt de rust, veiligheid, warmte, liefde - dit mag gek klinken - in mezelf. En dat geef ik je dan maar mee. Laat je niet ophitsen door de ophef, door al die onzin waar zo driftig over wordt gedaan in de media, laat je niet teveel meevoeren in de waan van de dag. Dat onbelangrijke werk, dat achterlijke verkeer. Stuur er liefde naartoe. Blijf bij wat goed voelt voor jezelf <3 <3\n\nWe hoeven er niet in mee te gaan. Nou ja, er zijn natuurlijk wel zaken waar we bedacht op mogen zijn, maar we mogen er vooral zijn. Probeer de waanzin niet te begrijpen. Stel dat het lukt en je begrip zo sterk is, dat je deelnemer wordt. Blijf trouw aan jezelf. Niet dat ego-deel dat mee kan gaan in de hysterie, maar de geest.\n\n  \nSorry voor de preek.",
            "Effe lekker ranten op zn tijd moet kunnen! Is ook niet altijd een feest. Fijn weekend",
            "Ik snap ook niet waarom files zo populair zijn.. maar mensen staan ervoor in de rij! ;)",
            "Er was gisteren een jongen/man op een motor die langs mij reed terwijl ik zo'n 30 minuten naar huis aan het lopen was op een verlaten landweggetje. Hij keerde om en vroeg of ik een lift wilde. Was niet heel praktisch omdat ik een laptoptas meezeulde en er ook geen voetensteuntjes waren, maar ik vond het een erg aardig gebaar en was blij verrast dat dit nog gebeurt in Nederland. Bedankt, vreemdeling die dit nooit zal lezen!",
            "Tip: niet in de Randstad gaan wonen helpt serieus",
            "Ik heb geen idee of het vroeger beter was, relativeren is lastig als je vroeger nog niet dezelfde verantwoordelijkgeid hoefde te dragen. Ik kan mij eerlijk gezegd niet herinneren of ik een beter kut kind was dan het gemiddelde kut kind van tegenwoordig",
            "Ik voel me ineens heel oud dat ik dit ga tikken...\n\nZelf zit ik net aan de 40 en herken deels je gedachten van vroeger. Ik was eind 20 toen mijn toenmalige relatie uit ging. Ja ik had een woning (aftands huurflatje), maar woonde wel \"alleen\" op ±100km van mijn directe familie. Werk was werk en het voelde als een vervelende sleur.\n\nToen ontmoette ik mijn vrouw; en de afgelopen 12 jaren zijn ineens voorbij gevlogen. Een huis, trouwen en ons eerste kind gebeurde in een kleine 5 jaar.\n\nMoraal van het verhaal: ja, het leven kan soms uitzichtloos voelen, maar het kan ook ineens weer omslaan.\n\nTip: kijk of er dingen in me omgeving die je irriteren zijn die je kan/wil aanpassen. Bijvoorbeeld je woon-werk verkeer; zou je het zien zitten om hier wat in aan te passen... Dus een andere baan dichterbij, of een baan verder weg in een stad/gebied waar je misschien (iets) makkelijker een woning kan vinden?"
        ]
    },
    "mephis moet even wisselen": {
        "title": "mephis moet even wisselen",
        "score": 219,
        "url": "https://www.reddit.com/r/nederlands/comments/1dlcxlq/mephis_moet_even_wisselen/",
        "content": "ik vind dat memphis even moet wisselen.",
        "num_comments": 150,
        "comments": [
            "Hij is de zwakste schakel. Tot ziens",
            "12 keer balcontact, 10 keer verloren. Onzichtbaar voorin. Tijd voor wat anders.",
            "Tsja, veel beter hebben we niet voorin. Weghorst is leuk om af en toe wat te forceren, maar heeft wel minder kwaliteit. Niet echt een spits om er vanaf de 1e minuut in te hebben.",
            "Gespreekt",
            "Memphis moet visser worden, wie weet heeft ie daar wel passie voor!",
            "Hij heeft toch een paar hele mooi passes gehad waar goede kansen voor Frankrijk uit voort kwamen, ook een kwaliteit.",
            "Ik vindt 💀",
            "Memphis heeft op 4 eindtoernooien (huidige meegeteld) 3 doelpunten en 1 assist gemaakt. \n\nNiet echt cijfers die schreeuwen om een onvoorwaardelijke basisplaats. \nMaar denk dat hij precies weet hoe zout de ballen van Koeman zijn, een andere verklaring heb ik er ook niet voor.\n\nEdit: 5 doelpunten en 1 assist. Anderhalf doelpunt per eindronde. Nog steeds geen indrukwekkende cijfers.",
            "Gelukkig komt nu Wijnaldum, kunnen we ons ergeren aan een speler die echt, écht, maar dan ook écht geen ene tering meer in oranje te zoeken heeft",
            "Memphis moet gewoon de selectie uit."
        ]
    },
    "Balkanker": {
        "title": "Balkanker",
        "score": 83,
        "url": "https://i.redd.it/esg900doa08d1.jpeg",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Waarom moet ik toch zo lachen?",
            "Ik werkte ooit in de bouw, en een attribuut dat veel wordt gebruikt, werd serieus een \"hoerenjong\" genoemd.",
            "Ouch",
            "Ook veelvuldig gebruikt door [DAFAK GmbH](https://www.dafak.de/)",
            "Balk anker",
            "ik vermoed gewoon bij de praxis, gamma, karwei of hornbach.\n\nEn anders bij de afdeling smakeloze humor. Je moet niet spotten met ziektes, jochie... dat is niet cool.",
            "Dak- en kapverkankeringen",
            "Balkanker is helemaal niet grappig.",
            "Loop niet zo te janken omdat iemand een keer kanker zegt. Dat is niet spotten of het iemand toewensen of wat dan ook.",
            "Hou je kanker bek ouwe"
        ]
    }
}