{
    "/r/Netflix Discord Server": {
        "title": "/r/Netflix Discord Server",
        "score": 459,
        "url": "https://www.reddit.com/r/netflix/comments/mxm3re/rnetflix_discord_server/",
        "content": "We are pleased to announce we have affiliated with https://discord.gg/Netflix which will be the subreddit Discord server for the Netflix subreddit! \n\nFeel free to join the server and talk about everything Netflix related, including shows on Netflix as well :).",
        "num_comments": 236,
        "comments": [
            "‪Ragnarok better be renewed for season 3! Just finished season 2 and it was PHENOMENAL! Absolutely love this show. Can’t wait for season 3! ‬",
            "Is there any site you can browse all the titles Netflix has available with sorting options, because Netflix has 5 categories right now.",
            "Guys,  family started a korean watch spree on my profileand now my own homepage is filled with korean series (which i have no interest in) and all my suggestion and interests are gone, what should i do ?",
            "Hello, i was just trying to log into my account and it says wrong password. Okey, i changed my password becouse email adress was still the same. So i log in and all profiles had been deleted, plan cancelled(?) and no payment info. Never heard of something like that happening, what could be the reason?",
            "Easy pass. Netflix will screw you one way or the other. Limited 2 tv’s to one account that’s with ads $21.00 no",
            "Why can't I post here about netflix and wwe in Australia in 2025",
            "Anyone know what's going on with this?\n\nI was watching Rabbids Invasion last night and it didn't save to my Watchlist or Watch Again. Anyone know why and how to fix?",
            "Anyone has a Netflix account I can use?",
            "I stumped into the Swedish series by Netflix called The Unlikely Murderer.  I was so shocked about how impotent the police were in the 80's.  Without CCTV and the experienced person for leading the case, the prime minister was murdered for nothing.",
            "Anybody got a Netflix account they don’t mind sharing with a college kid trying to grind"
        ]
    },
    "Upcoming price update (Germany)": {
        "title": "Upcoming price update (Germany)",
        "score": 5,
        "url": "https://www.reddit.com/r/netflix/comments/1dr988f/upcoming_price_update_germany/",
        "content": "https://preview.redd.it/rdmfsu1iyh9d1.png?width=1772&format=png&auto=webp&s=235da9c1a2d3b31e78df8caa358d7950db24cfeb\n\nSo, Netflix is trying to hike our/my subscription prices again. This prompt gets superimposed on Netflix, any time I visit the site now. I cannot close this window, other than declining or accepting the price and am therefore locked out from my content, unless I will make an immediate decision. How can that be right?\n\nSurely, we should be able to continue watching (without an selection) till the end of whatever payment cycle you paid for.",
        "num_comments": 2,
        "comments": [
            "US here, It’s annoying but Netflix has been rising their prices lately December was paying $22, January to February $25, now it’s $27, and it’s ridiculous. The funny thing is I have the highest subscription plan, but Netflix from time to time has been asking to change to the $8 subscription.",
            ">locked out from my content\n\nYou subscribe. It's their content."
        ]
    },
    "Trigger Warning Ending": {
        "title": "Trigger Warning Ending",
        "score": 8,
        "url": "https://www.reddit.com/r/netflix/comments/1dr3zy2/trigger_warning_ending/",
        "content": "Is it just me or should Jessica Alba’s character been blown up at the end? The guy who blew himself up with a grenade was extremely close to her!\n\nThe movie wasn’t bad, up until the end. The fact that she had been beaten and shot through the movie wasn’t that ridiculous compared to being within a fatal proximity to a grenade blast.\n\nThe story was actually pretty OK. I guess another criticism I have is how the COPS infiltrated a military depot and stole weapons without getting caught by a sentry.\n\nThis movie was entertaining dumb action movie.",
        "num_comments": 0,
        "comments": []
    },
    "[ALL] That '90s Show Season 2 - Available Now ": {
        "title": "[ALL] That '90s Show Season 2 - Available Now ",
        "score": 8,
        "url": "https://www.netflix.com/us/title/81288370?s=a&trkid=13747225&trg=cp&vlang=en&clip=81645400",
        "content": "",
        "num_comments": 2,
        "comments": [
            "This show is so terrible. That's 70 show was perfect as it was.",
            "This show is horrible. And I REALLY tried to like it."
        ]
    },
    "Intelligent Rescue Op.": {
        "title": "Intelligent Rescue Op.",
        "score": 2,
        "url": "https://www.reddit.com/r/netflix/comments/1dr2gdr/intelligent_rescue_op/",
        "content": "Hey everyone. This is my first post in this subreddit. Just finishing up Land of Bad.\n\n0f course, there are some really cheesy plot things and errors, as I don't think it is a top tier movie. \n\nHowever, for entertainment value, I give it three and a half out of five. Check it out, and let me know your thoughts. \n\nCheers, all.",
        "num_comments": 0,
        "comments": []
    }
}