{
    "Blogpost Friday!": {
        "title": "Blogpost Friday!",
        "score": 2,
        "url": "https://www.reddit.com/r/networking/comments/1dkqdb5/blogpost_friday/",
        "content": "It's Read-only Friday! It is time to put your feet up, pour a nice dram and look through some of our member's new and shiny blog posts.\n\nFeel free to submit your blog post and as well a nice description to this thread.\n\n*Note: This post is created at 00:00 UTC. It may not be Friday where you are in the world, no need to comment on it.*",
        "num_comments": 1,
        "comments": [
            "In which we compare the similarities and differences between packet crafter, packet generator, traffic generator, traffic tester -\n\n[Packet Generator vs Traffic Generator](https://ostinato.org/blog/packet-generator-vs-traffic-generator)"
        ]
    },
    "Rant Wednesday!": {
        "title": "Rant Wednesday!",
        "score": 5,
        "url": "https://www.reddit.com/r/networking/comments/1dj5f3k/rant_wednesday/",
        "content": "It's Wednesday! Time to get that crap that's been bugging you off your chest! In the interests of spicing things up a bit around here, we're going to try out a Rant Wednesday thread for you all to vent your frustrations. Feel free to vent about vendors, co-workers, price of scotch or anything else network related.         \n\nThere is no guiding question to help stir up some rage-feels, feel free to fire at will, ranting about anything and everything that's been pissing you off or getting on your nerves!\n\n*Note: This post is created at 00:00 UTC. It may not be Wednesday where you are in the world, no need to comment on it.*",
        "num_comments": 10,
        "comments": [
            "why the hell do senior managers not listen to you till something goes wrong and then blame the bloody Network, throw the traffic at the network it will be there problem.",
            "Why can’t cisco and arista and co just post a price on their websites. I know you might get discounts and whatnot, but if a router is roughly 2000 or 20000 makes a difference",
            "The CCNP ENCOR is so fucking overkill",
            "I know it’s an IT cliche, but damn I’m tired of cabling gremlins. Spent 2 hours driving one-way to a branch office, just to find a RJ45 splitter somewhere it shouldn’t be in the TR.  \n\nSo curse the previous regime’s MSP tech who thought a splitter was a good solution to anything. And curse whoever at that office that saw a splitter with only one side being used, tossed it, and then put in a ticket for the fax not working. ",
            "Dumb end users. That is all.",
            "Because if you see a $20k switch you're going to look at something else without talking to sales.\n\nIf you have a conversation with a sales rep that switch becomes 12k. If you order more than 1 that switch is 10k. If you have a long term project with lots of devices you're paying 8k per switch.\n\nCheck CDW if you want to know what list price for a widget is, then talk to the OEM sales team to see what kind of discounts you can get",
            "Your budget decides the price, not the other way around.\n\nWorked at a distri before, the discounts some customers get are insalne.",
            "even more frustrating they won't even sell you the things, you need to go through a reseller",
            ">Worked at a distri before, the discounts some customers get are insalne.\n\nYep, sometimes the partnership is worth far more than the revenue of the sale - we did one of the biggest Meraki deployments in 2018 - 2019 and had 80% discounts. But we did some talks for them at their office about how easy it was to manage the estate, cost savings etc.",
            "I just moved from the engineering side of the table to sales, the whole discount piece of it was eye opening. Companies will just about give away the hardware if the licensing revenue is high enough"
        ]
    },
    "Is network engineering a field some just aren't cut out for?": {
        "title": "Is network engineering a field some just aren't cut out for?",
        "score": 49,
        "url": "https://www.reddit.com/r/networking/comments/1dlsf1q/is_network_engineering_a_field_some_just_arent/",
        "content": "I'm not asking this question to be negative. I'm asking just because of repeated scenarios I've seen in my career. I've seen too many start and give up after discovering the work isn't always easy (even remote and just being a CLI jockey). I've seen some bail after realizing it's a journey that never ends. The constant skilling up amd staying current. I've seen some really struggle to understand the network and get so frustrated they start questioning this career (I've been there). Ive seen many, many more that skate by leaving me wondering how they still have a job as a net eng holding a CCNA but not able to tell me how many IPs are in a /32. Maybe this happens in all tech fields, idk. ",
        "num_comments": 84,
        "comments": [
            "Yes.  I've said throughout my career that it takes a certain type of brain to become a career networker.  I think it's similar to programming.  Some people get it and like and some people just are not cut out for it.",
            "I've been doing this stuff for 20 years and I'm so burnt out now, I almost want to switch careers completely. No one troubleshoots shit anymore and everything falls back on you to prove it's not the network. \n\nThey always just blame the network/firewall/bandwidth as an easy way out. \n\nSometimes I envy the cert person who doesn't know how many ips are in a /32. At least their mind is not constantly worried about stuff that actually matters.",
            "Yes. It takes a level of understanding and problem solving to build and integrate networks. When I worked for an enterprise, we had someone join the team from a cybersecurity background, thinking that it was similar to networks. We were a network virtualization integration team, and unfortunately, she very much struggled with some of the complex network concepts in play.\n\nOn the other hand, you have people who can look through a raw packet capture and immediately diagnose issues, so there's both sides of the spectrum.",
            "For people who have anxiety, I would not recommend network engineering as a career. I wish I could tell my younger self that. Lol",
            "Yes.  Source: Me.  I'm so burnt out and over this crap after doing it for over a decade.  None of it interests me anymore; I don't want to keep training myself on new shit all the time.  I want to live my life, like, outside and shit.  I just feel kinda stuck/trapped because I get paid very well and have been narrowly focused on a specific SDWAN product for the past 5yrs.",
            "Not just networking. Anything advanced, tech or it-based requires a specific mindset and specific aptitudes. It's also to some extent a young man's game, in that - as you say - you have to keep current, you can never stop learning. Being thorough, analytical and having strong logical problem solving skills... there's so much that goes into all IT work, you can run some dunce through a multi-year education and have them come out with somewhere between fuck and all of actual capacity to perform.",
            "Yes. Just like electrical, you either get it or you don't. To some it just will always be an uphill battle.\nI don't mean they're less intelligent or anything, just their brains operate a different way. I have met many brilliant people who just cannot fathom the fundamentals (of either).\n\nAnd really, I feel you have to have a proper passion for it to excel. The best engineers I've encountered are those who get properly excited by the technologies and live and breathe it.",
            "There isn't any job out there that is made for everyone. Many people get jobs they don't end up liking.",
            "Wait a minute!!!!  Is that /32 IPV4 or IPV6? /s :)",
            "> not able to tell me how many IPs are in a /32\n\nI'm in the field for 30 years and I can't tell that from memory.\n\nOk, launching ipcalc: 79228162514264337593543950336"
        ]
    },
    "SDWAN Standards and protocols": {
        "title": "SDWAN Standards and protocols",
        "score": 7,
        "url": "https://www.reddit.com/r/networking/comments/1dlni2p/sdwan_standards_and_protocols/",
        "content": "Back in good old days lots of network protocols was created which allow interoperability between different vendors.  I mean from routing protocols to IPSEC.       \nBut situation around SDWAN is quite different, it is all siloed. Every vendor has it's own SDWAN solution which only works with that vendor equipment.  You can't put into some \"cloud\" Cisco and Juniper appliances. (unless you are linking it by good old Ethernet + BGP )      \n\nSo my question is: Is there any RFC describing some SDWAN protocol set. Something which in theory allow different vendors to interoperate?  I can't find anything even to provide something similar to Cisco FlexVPN , not to mention something more complex.",
        "num_comments": 12,
        "comments": [
            "I'm afraid there isn't. Only the architecture (not the implementation details) is described in \n\n[RFC 7426](https://www.rfc-editor.org/rfc/rfc7426.html) Software-Defined Networking (SDN): Layers and Architecture Terminology\n\n[RFC 8597](https://www.rfc-editor.org/rfc/rfc8597.html) Cooperating Layered Architecture for Software-Defined Networking (CLAS).",
            "I've primarily worked with Fortinet's SDWAN solution, but as far as I can tell, it's mostly built upon standardized protocols. ADVPN (RFC7018) can be used for underlay with branch-to-branch auto-discovered tunnels and BGP with VPNv4 for routing and reachability (also using communities to steer traffic).\n\nThere isn't any RFCs tying it all together to a neat \"SDWAN package\", but pretty much each of the components are using some sort of standardized protocol, which makes it possible to deploy Fortinet SDWAN at the branch offices and for example a Palo Alto Networks firewall or Cisco router in the HQ/data center. It might not be as sexy as some other SDWAN vendors out there, but using well-known protocols makes troubleshooting and deploying it really easy.",
            "Not really, It’s SLA Performance and application priority typically",
            "The first thing is to define what you mean by \"SDWAN\". As far as I can tell it normally means centralised management (bonus points if its an annoying web ui), semi-automated encrypted tunnels from branches to hub sites, and magic features you don't need.\n\nThe closet standard I've seen for this is DMVPN.",
            "What’s the exact problem that you’re trying to solve?",
            "Yeh, It seems to be a case. Even two RFC you linked are more \"thought\" about subject than actual architecture.",
            "> RFC7018\nThis may be interesting, thanks. \n\nDid you try that Foti/PA mix on practice?",
            "> The closet standard I've seen for this is DMVPN.\n\nWhat about ADVPN (RFC7018)?",
            "Pretty much centralized configuration + mesh VPN with dynamic routing\n> DMVPN\nIt is pretty much Cisco proprietary.",
            "No problem, just observation of current sad state of networking."
        ]
    },
    "First HA multi-home BGP design for HQ": {
        "title": "First HA multi-home BGP design for HQ",
        "score": 2,
        "url": "https://www.reddit.com/r/networking/comments/1dlum5j/first_ha_multihome_bgp_design_for_hq/",
        "content": "I am just getting started with our first BGP deployment. We have our ASN, and our /24 v4 prefix and /48 v6 prefix. We will have 2 providers.  \n\n1: I am still negotiating with the providers, one local and one Comcast, and still considering other options and figuring out who has fiber in our building. If I want 2x Cisco ASR 1001-x and to terminate both providers to those boxes and each provider is only willing to give us one fiber, is best option to use a switch, one for each provider (I was thinking two of those small cisco industrial switches, assuming they are well designed to run until the end of time under any conditions and don’t take up too much space and power acting as only a 4-5 port switch)\n\n2: we want to separate our datacenter activities from HQ end-user networking, and our lab environment. Being a small shop I do like the idea of just using the ports on the router vs setting up a core switch below that. Basically I’m just setting up small transit networks on each port, and using OSPF from my downstream firewalls/routers. Or am I missing out a bunch from eliminating that core router/switch from the topology?\n\n3: I have read the arista 7280R3 (and possibly some variant of the R2, or others) support full internet BGP tables. Curious if we stepped down to the R series if that is still the case as that would be the max in our price range. Or, how much benefit we lose if we step down to taking partial BGP tables with a default route, especially since I have had a weeks long peering issue with our local ISP - but not Comcast-  a few years back. \n\nSo - this is all a bit new to me in terms of selecting hardware and deploying it. I know how it all works I just don’t have enough experience running a network like this to know what is a bad idea and what is a good idea practically. ",
        "num_comments": 1,
        "comments": [
            "Remember: Firewall ports more expensive than router ports mode expensive than switch ports. When connecting a bunch of stuff, aggregation switches aren't the worlds worst option for several reasons.\n\n&nbsp;\n\n1) \n\n-  >> One fiber: \n\n Pair, you mean? Not that it's super relevant. \n\n- An aggregation switch is not a bad way to go, but I would recommend 2x; if the switch goes out you lost all your redundancy. Terminate one router and one provider to one switch, and the others to the others. Mesh the routers to each agg switch in case of switch failure. Less ports you can link the two routers together.\n\n- Hardware redundancy and cheap/easy way to add new circuits, routers, firewalls, cores, or replace any of the mentioned components; it becomes a matter of copying configs ahead of time. Plumbing the vlan(s) from the old device to the new device on cutover day. Minimal downtime, and no fatigue from moving a ton of physical ports around and making sure things match up.\n\n&nbsp;\n\n2) If you have a 'core' device, what is the purpose of it and why is it a 'core'. It sounds like you're terminating internal end-points. If that hardware has a specific feature or purpose (tons of cheap ports, redundant RE/power) it isn't bad to utilize. The 'agg-switch' mentioned in 1) technically works like your core, but that's not it's purpose necessarily. Comes down to your design intentions. \n\n&nbsp;\n\n3) What is the purpose of two providers? If it's simply internet connectivity backup, then you don't care about full tables. If they're similarly connected ASNs, default is sufficient. This is inefficient, though, because now you have an expensive connection not doing anything. Reconsider Default First + Full tables. You may also ask the providers for Default + \"Connected\"/\"Customer\" tables. This way you at least efficiently push traffic to their +1 hop connected networks and reduce your table size. Though, I would say if budget is so constrained full tables is an issue, management needs to be educated on the criticality of your edge/WAN routers.\n\n&nbsp;\n\n>> I just don't have enough experience running a network like this to know what is a bad idea and what is a good idea practically.\n\nDon't worry about what you don't have - you'll get there. While failures and emergencies are the most common ways people learn about how their networks could be improved, go through failure scenarios/tabletop in your head. Think of ways things could fail by breaking a cable, a provider, or a piece of hardware and game out what the network would do when that happens."
        ]
    }
}