{
    "I assure you, the June 2024 New Jersey MegaThread is open. What's on your mind? Come on in! All topics allowed. but please observe Rule 1": {
        "title": "I assure you, the June 2024 New Jersey MegaThread is open. What's on your mind? Come on in! All topics allowed. but please observe Rule 1",
        "score": 15,
        "url": "https://www.reddit.com/r/newjersey/comments/1d5fcpg/i_assure_you_the_june_2024_new_jersey_megathread/",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Just learned that New Jersey is the only state to have never had an anthem or song. Which one should we pick?",
            "Looking for good camping sites for a few summer days with two kids (5  and 8 years old). Any suggestion?",
            "I'm selling my old car this weekend and buying a new one next month, as I have to wait for delivery. I will be taking the plates off of the old car and want to reuse them for the new car. How long am I able to keep the plates to install on the new car before the MVC rules them as non-returned plates? The website says \"if you don't intend to transfer them to a new car, they must be returned\" but I do intend to transfer them, just after 4-8 weeks. Help?",
            "Where are the affordable starter homes in NJ?",
            "Did early voting, pretty sad that the federal level offers more choice than local and state politics.Early voting sites for your county close at 6 pm today, get your ballots in soon folks!",
            "can my wife start Maternity Leave application before stop working officially?   I know it will take a while for them to process the application. I don't want to apply 4 weeks before the due date and them taking 1 or 2 months to approve the insurance. \n\nbaby should be here July 15-20. what is your advice?",
            "Hi! I just accepted a fellowship near Princeton starting mid-August. I'm a bit worried about logistics, as I've lived in the Kansas City area for the past six years, so this is a big move for me! I'm wondering where the best places to live are. Since this is a fellowship, I don't have the biggest stipend, so I am mostly looking at places with affordable 1-bed's trying to find roommates for a 2-bed situation. Since I've lived in a big city for a while, I'm also looking at Philadelphia, since it's less than an hour of a commute to my workplace. That being said (especially as a midwesterner), I'd be worried about the winter roads if I lived in Philadelphia. Does anyone have any advice? Thanks!",
            "Why its just another super windy day in New Jersey",
            "Anyone else worried about the impact of the chevron decision? Usually with a lot of these crazy things happening I reassure myself that I live in a blue state run by a blue governor that (for the most part) looks out for my safety. \n\nFar reaching federal decision making has the chance to screw citizens on a national level and Im not sure it can be mitigated living in a blue state",
            "I thought Born to Run was the non-official state song?"
        ]
    },
    "Top 17 New Jersey weekend events for June 28–30, 2024. Add more to the comments": {
        "title": "Top 17 New Jersey weekend events for June 28–30, 2024. Add more to the comments",
        "score": 7,
        "url": "https://newjerseyisntboring.com/15-new-jersey-events-june-28-30-2024/",
        "content": "",
        "num_comments": 1,
        "comments": [
            "How is Art All Night not on the list?\n\nArtallnighttrenton.org"
        ]
    },
    "Gov. Murphy says he’s open to legislation to require all rape kits to be tested | The Kane In Your Corner team exposed how one in three kits victims release to law enforcement are never tested.": {
        "title": "Gov. Murphy says he’s open to legislation to require all rape kits to be tested | The Kane In Your Corner team exposed how one in three kits victims release to law enforcement are never tested.",
        "score": 52,
        "url": "https://newjersey.news12.com/gov-murphy-says-hes-open-to-legislation-to-require-all-rape-kits-to-be-tested",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Bro my mind is blown right now. How is this not already the policy?? \n\nHow could anyone be in possession of a RAPE KIT and not test it or have it tested???????",
            "Hmm. Makes one wonder why they arent tested",
            "Oh how kind that hes open to the idea",
            "It's insane that this isn't already a requirement. Wtf",
            "The current rules for the state is simple. When a victim is raped she goes to a hospital and evidence is collected. The victim tells the police whether she wants the evidence tested. The victim decides and tells LEO whether she wants to press charges. The kit is held in storage. A couple questions arises: Can police open and look at the evidence? With or without the victims cooperation? How successful you think the prosecutor will be in court without a victim? Defense lawyers will have a field day with that. Should this be addressed as well? The current issue is that some kits are not tested when victims comes forward and request they be done. That is completely wrong and traumatizing. Stronger laws and enforced rules need to be in place. It should be ordered that every single case should be reexamined to determine if a victim came forward and whether it was tested or not.",
            "I think law and order SVU had this as an issue in the early 00s. That just tells you how big of an issue it has always been. We really need to do better.",
            "It should be a national scandal. A few years ago, they cleared the backlogs in Detroit, Cleveland, and Memphis and identified at least 1,300 serial offenders. Think of all the trauma that could have been prevented and that is just 3 cities!",
            "That is probably the most well crafted response Ive ever read on this sub-Reddit.",
            "Thats terrible! So many people unnecessarily hurt \n\n.",
            "Government translator here: \n\nCall you state senator and assemblymen NOW and have them draft legislation NOW, while Mr. Banker supports this AT THE MOMENT."
        ]
    },
    "Newark airport sh*tshow yesterday": {
        "title": "Newark airport sh*tshow yesterday",
        "score": 583,
        "url": "https://www.reddit.com/r/newjersey/comments/1dqlxhn/newark_airport_shtshow_yesterday/",
        "content": "Yesterday a private jet with ONE passenger went off the runway after landing causing an entire \"International Airport\" to shutdown for few hours. I was one of the many passenger affected by this, arrived to my final destination 5+ hours later. Just venting here how some rich a$$hole flying private just caused some people to miss their connections, important meetings, and ruin their whole day/evening.   \n[https://sg.news.yahoo.com/flights-grounded-delayed-newark-airport-233900852.html](https://sg.news.yahoo.com/flights-grounded-delayed-newark-airport-233900852.html)",
        "num_comments": 126,
        "comments": [
            "Sorry folks my my pilot for my private jet was off his game yesterday caused my plane to hit the fence again my apologies.",
            "Oh man it's been a shit show since Wednesday night for us. Our flight at 9:15pm was delayed multiple times then cancelled and delayed overnight. New flight was set to leave Thursday night at 9:15pm. We didn't leave until 11:45pm. We were told we wouldn't miss our connection in London but hey here we are stuck in London now instead of Newark still waiting for our final flight. It's like a south park episode.",
            "Why are private jets even allowed to operate out of Newark? They should be relegated to smaller local airports, Teterboro, etc.",
            "I mean, its the pilot's fault. Could happen with any pilot, I guess, theoretically. The fact that they were flying a private jet doesn't really make it the owner's fault",
            "We really cant get anywhere. Flights are constantly delayed. Trains are delayed or cancelled. Yesterday someone posted about a bus breaking down in the Lincoln Tunnel.",
            "So thats why my flight from Boston was delayed.  Saw emergency lights when we landed and wondered what happened.  Now I know!!",
            "I wouldn't say the passenger caused this, it was the pilots or mechanics or whoever else. Same way I wouldn't assign you 1/120th of the blame or whatever if your commercial flight had the same issue.",
            "I was delayed about 3 hours, which sucked, but I also don't think it's unreasonable to shut down a runway when a plane crashes. That it was a private plane with one passenger is not really relevant, logistically.",
            "Flew out of EWR yesterday late and was fortunate to not get hit by this. NJ Transit trains failing Monday, massive weather delays Wednesday, this nonsense yesterday. Our infrastructure is crumbling.",
            "All week. Between the heat waves and thunderstorms; it's been fucking madness. Even for summer travel guidelines. I'm gonna stay home for the summer."
        ]
    },
    "Here's what made it into the final NJ budget bill: A corporate tax hike is in, so is community college funding Murphy had proposed cutting. Out, a new warehouse tax and higher gun fees": {
        "title": "Here's what made it into the final NJ budget bill: A corporate tax hike is in, so is community college funding Murphy had proposed cutting. Out, a new warehouse tax and higher gun fees",
        "score": 11,
        "url": "https://www.njspotlightnews.org/2024/06/whats-in-whats-out-nj-budget-spending-bill-lawmakers-set-approve-friday/",
        "content": "",
        "num_comments": 4,
        "comments": [
            "The underfunding of NJ community colleges has been criminal. This is the first increase in years. These funds are sorely needed, but only provide ~$1M per college. \n\nDid you know the state covers the cost of health insurance costs for 4 years but not community colleges in this state?\n\nDid you know 4 in 10 NJ undergraduate students attend a community college? Despite this, the vast majority of funding goes to 4-year publics.\n\nYou are related, work with, or have family members that went to community college. Remind your state legislatures that this is important!",
            "Hear hear!",
            "Well said!",
            "Great comment!"
        ]
    }
}