{
    "2 killed, 8 wounded in mass shooting outside Arkansas grocery store": {
        "title": "2 killed, 8 wounded in mass shooting outside Arkansas grocery store",
        "score": 10031,
        "url": "https://www.cbsnews.com/news/arkansas-grocery-store-shooting-deaths-injuries/",
        "content": "",
        "num_comments": 1281,
        "comments": [
            "\"A shooting outside a grocery store in [Fordyce, Arkansas](https://www.foxnews.com/category/us/us-regions/midwest/arkansas), on Friday around 11:30 a.m., left three people dead and eight others wounded, Arkansas State Police Secretary of Public Safety and Director Mike Hagar said in a Friday afternoon press conference.  Two law enforcement officers were among the wounded, but their wounds are non-life-threatening, Hager said. \n\n[The shooter is in custody](https://www.foxnews.com/category/us/crime) after exchanging gunfire with state police. \n\nHager said the victims' wounds range from non-life-threatening to critical. \n\n\"It’s tragic, our hearts are broken,\" Hager told reporters. \n\nA witness, who works at Holt Builder's Supply across the street from the shooting at the Mad Butcher grocery store, told Fox News Digital he heard \"several rounds\" and saw victims being medevaced from the scene.   \nThe employee said, \"multiple agencies were down here trying to figure out what was going on. We saw policemen running around the pharmacy, which is right next door to the Mad Butcher.\"\n\nHe added, \"It was pretty hectic around here between 11:30 and noon\" and that he saw a medevac land at the local hospital's helipad. \n\nArkansas Gov. Sarah Huckabee-Sanders said on social media that she had been \"briefed on the tragic shooting in Fordyce, and I’m in constant contact with State Police at the scene. I am thankful to law enforcement and first responders for their quick and heroic action to save lives. My prayers are with the victims and all those impacted by this horrific incident.\"\n\nA witness named Odis Allen told FOX 16 he has lived in Fordyce for 60 years and was completely \"shocked\" by the shooting. \n\n\"I never saw something like this happen in Fordyce, Arkansas,\" he told the station, adding he was scared for his children and grandchildren. \n\nAnother witness told FOX 16 that the shooter had \"destroyed a community today.\"\n\n\"I wish people would spread more love instead of hate,\" he added. \n\nDavid Rodriguez, who was getting gas nearby, told the Associated Press he at first thought he had heard fireworks.\n\nRodriguez said he then saw people running from the Mad Butcher grocery store into the parking lot, and one person lying on the ground. \"",
            "Wow. Such a tiny town isn’t even exempt from this shit. \n\n> Fordyce, a town of roughly 3,700 residents as of 2020, is located in Dallas County.\n\nEdit:  up to 3 killed 10 wounded.  Unfortunately the 3rd casualty is NOT the scumbag as far as I can tell as his injuries were reported non life threatening.",
            "[The governor has given her prayers but not her thoughts.](https://x.com/SarahHuckabee/status/1804222875169063134)",
            "Imagine just going to grocery to buy some milk and getting killed but yes lets put the ten commandments in public schools.  That will stop the mass shootings!",
            "Caption under the pic at the bottom:\n\nAt least three people were killed and multiple others wounded in a shooting outside a grocery store in Fordyce, Alabama on June 21, 2024, police said.  \n\nTricia Vanderzwalm West \n\nArkansas, Alabama, what's the difference, right?",
            "[removed]",
            "(Insert name of your town) Strong!",
            "In a state like Arkansas I would expect a good guy with a gun to have stopped this immediately.",
            "It’s sad that my first thought was “At least it wasnt a school.”\n\nThis country is fucked.",
            "3 killed, 10 injured now."
        ]
    },
    "Nearly 500 confirmed fatalities from Hajj heatwave as hundreds more feared dead": {
        "title": "Nearly 500 confirmed fatalities from Hajj heatwave as hundreds more feared dead",
        "score": 5501,
        "url": "https://www.cnn.com/2024/06/21/middleeast/hajj-deaths-mecca-extreme-heat-intl-latam/index.html",
        "content": "",
        "num_comments": 447,
        "comments": [
            "Thought it was almost double that as of last night?",
            "It'll be a few more years of this until the date of Hajj shifts out of the summer season. It'll be early June next year and late May the year after and by 2029 we're into April. It'll be decades before it rotates back into summer months.\n\n\n\nBut, hey, perhaps they got a handle on the crowd crush deaths at least? We haven't had one of those in a while and it used to kill hundreds/thousands. ",
            "Since I’m fully unaware, is there a reason the Hajj happens during the summer? Or could it be moved to a cooler time for safety reasons?",
            "My friends, a married couple, recently came back from their Hajj. It sounded like a nightmare.\n\nFirst, the cost of their \"level\" of the experience was over $30,000.\n\nWhile on pilgrimage, they slept in a communal tent, they didn't even get their own.\n\nThe heat outside was over 100° F, but the inside of the tent was freezing cold because of constant air conditioning, so they ended up with \"Hajj flu\" due to the drastic temperature changes.",
            "[removed]",
            "One of the unfortunate aspects of using a lunar calendar is that significant dates and events sort of ebb and flow through the solar year. Visiting any gulf state in June-July is a really bad idea.",
            "I don't think there's a god requiring any of this.\n\nI do think there are some people responsible for it.\n\nHorrible for the people injured or who lost loved ones. Very sad and tragic.",
            "Hey guys... would god really be super duper mad if maybe you went in a few months?  I know the lunar calendar and all that, but is there a chance he might be like \"ooh, you guys are late!  No big deal tho, I'm just happy ya'll came!\"",
            "Get used to more headlines like this as climate change intensifies.",
            "[removed]"
        ]
    },
    "Newly released video shows Saudi man filming locations ahead of 9/11 attacks": {
        "title": "Newly released video shows Saudi man filming locations ahead of 9/11 attacks",
        "score": 7311,
        "url": "https://www.theguardian.com/us-news/article/2024/jun/21/9-11-video-saudi-man-washington",
        "content": "",
        "num_comments": 743,
        "comments": [
            "You don’t say!?!\n\n“The hijackers in the September 11 attacks were 19 men affiliated with Islamist jihadist organization al-Qaeda. They hailed from four countries; 15 of them were citizens of Saudi Arabia, two were from the United Arab Emirates, one was from Egypt, and one from Lebanon. “",
            "“…The film was initially found by UK investigators in Bayoumi’s flat in the days after the attack in 2001, when he was a PhD student at Aston University in Birmingham. The flat also contained an address book that lawyers for the families say contains the contact details of officials in the Saudi government at the time. Scotland Yard gave the footage to the FBI.\n\nSaudi Arabia has always denied that Bayoumi was its agent. He has long been a subject of speculation due to his links to two of the 9/11 hijackers, Nawaf al-Hazmi and Khalid al-Mihdhar. An FBI report declassified in March 2022 presented evidence of “a 50/50 chance [Bayoumi] had advanced knowledge the 9/11 attacks were to occur” from his relationship with Hazmi and Mihdhar…”",
            "The Saudis funded it. Everyone should know this by now.",
            "Yeah. We all know the responsible were largely from Saudi Arabia not Iraq or elsewhere.\n\n.. but... $$$, oil, $$$, influence, bribary, $$$... you know. \n\nSame reason Jamal Khashaoggi got a 'meh' from our government.",
            "those guys were funded by the same saudis that jared kushner got $2,000,000,000.00 from",
            "Saudi just ended to petrol dollar deal and this comes out all these years later.",
            "Guy really phoned it in on the video “here’s a place I don’t know.” “I also haven’t yet learned what this place is” “I’ll get over there and see what that is”. Bruh pick up a pamphlet",
            "Every year or so someone will \"break\" this story but honestly we knew all this 20 years ago and more...so obviously we had to invade Afghanistan.",
            "We all know it was the Saudis but\n\nWhy tf would you need to film the twin towers to fly a plane into ?",
            "Just remember, no WMDs were ever found to this day in Iraq."
        ]
    },
    "Penile cancer: 6,500 amputations in Brazil in a decade": {
        "title": "Penile cancer: 6,500 amputations in Brazil in a decade",
        "score": 613,
        "url": "https://www.bbc.com/news/articles/c9rr7z5gk62o",
        "content": "",
        "num_comments": 182,
        "comments": [
            "\"When a man does not expose the glans and fails to clean the foreskin properly, it produces a secretion that accumulates,\" Dr Cordeiro says. \"This creates a highly favourable environment for bacterial infections.\n\nIn otherwords, clean your damn junk!",
            "Penis cancer is often caused by HPV. What is their HPV immunization rate out there?",
            "I wonder if you'd get ghost erections. I'm assuming libido doesn't go away. Do they find alternative methods to release sexual tension, or are they doomed to a life of frustration?",
            "What a terrible day to have eyes",
            "I have just developed a brand new fear\n\nWell maybe fear isn't the word, maybe it's more like \"utter terror\"",
            "I’m so glad I’m not Brazillian",
            "[removed]",
            "I'm from Brazil (specifically from Rio) and am finishing med school, and I remember hearing somewhere that people were using this diagnosis as a mean to launder money here. Don't remember the details, but that those numbers are somewhat inflated.",
            "And of course, vaccination could prevent this, but three decades of anti-vaccine propaganda have produced an entire generation of \"vaccine hesitant\" parents.",
            "The ultimate Brazilian!"
        ]
    },
    "Escaped pet donkey found 'living best life' with elk": {
        "title": "Escaped pet donkey found 'living best life' with elk",
        "score": 466,
        "url": "https://www.bbc.com/news/articles/cjjje07x35do",
        "content": "",
        "num_comments": 57,
        "comments": [
            "“Escaped”\n\nBro is just trying to live.",
            "Safest elk herd ever, donkeys are protectors",
            "Watched the story on the news. They said they think the donkey is the leader and they found a dead mountain lion that looked like it had been killed by the donkey.",
            "The elk love him because on Saturdays he makes waffles.",
            "It’s amazing the herd took him in and let him stay. 😳",
            "So if you live in California and are a donkey - run away to improve your live !",
            "The Donkey is good protection for the Elk herd. Wolves, beware!",
            "I knew those two crazy kids were going to make it.",
            "Donkeys are very intelligent.",
            "I read the entire article thinking it said “monkey.” When I watched the video, I was quite disappointed in both the fact that it wasn’t a monkey and in my reading abilities."
        ]
    }
}