{
    "Steve Bannon must report to prison by Monday after Supreme Court rejects last-minute appeal": {
        "title": "Steve Bannon must report to prison by Monday after Supreme Court rejects last-minute appeal",
        "score": 17054,
        "url": "https://www.nbcnews.com/politics/supreme-court/steve-bannon-must-report-prison-monday-supreme-court-rejects-last-minu-rcna158584",
        "content": "",
        "num_comments": 653,
        "comments": [
            "It's been a political roller coaster the last 24 hours. And there's still more to go, come Monday with the expected immunity decision. But this, this is good to hear.",
            "Those withdrawals are gonna be murder on him.",
            "4 months is ridiculously short",
            "The world is fucked but Steve Bannon spending even a minute in prison feels like a victory.",
            "Spoiler: he absofuckinglutely will not present himself to be incarcerated.",
            "Serious question; how do prisons handle detox?",
            "isn't it great how rich well connected dudes can just show up to prison whenever. \n\nif this was me or you they would have kicked in our door and shot our dog before dragging us out in our underwear.",
            "Why is the Supreme Court fielding sh*t like this?  99% of death row inmates dont get this type of care and attention.",
            "Good riddance to bad trash.",
            "Best news I've heard all week."
        ]
    },
    "8-year-old girl dies after mom allegedly left her in car during high heat to go to work": {
        "title": "8-year-old girl dies after mom allegedly left her in car during high heat to go to work",
        "score": 8160,
        "url": "https://abcnews.go.com/US/charlotte-north-carolina-hot-car-death-charges/story?id=111521929",
        "content": "",
        "num_comments": 870,
        "comments": [
            "I feel like there is more to this story than what is being reported. Like I get 8 year olds are young, but couldn't she like open a door or something?",
            "The title should definitely include that she left the car running. She probably had to do this because childcare is wildly expensive.",
            "We could have inexpensive high quality child care in this country but instead we spend that money on police, the military, and prisons.",
            "Tragic death of a child that can have been so easily preventable",
            "Driving home from southern France back to England two days ago we stopped at services for a pee. Left the dog in the car for literally five minutes WITH the windows open and the poor thing was panting like crazy. Next time we took turns and kept the car engine running. And took the dog for a quick walk to stretch his legs.",
            "If daycare were more affordable maybe this wouldnt have happened. I do wonder why the little girl didnt get out of the car when she got too hot. Maybe she was scared of her mom punishing her. Maybe she just didnt realize the danger she was in.",
            "Sounds like she turned the a/c off then had a medical emergency rendering her unconscious then died due to hyperthermia. An 8 year old isn't going to stay in a hot car till they die unless she was developmentally delayed.",
            "We need free, accessible childcare for reasons like this. No one should have to risk their childs life in order to pay the bills.",
            "Obviously the mother is at fault, but I also blame Amazon.  If youre gonna pay your employees sub living wages at least provide them with on site child care so shit like this doesnt happen.  Amazon is one of the richest companies in the world.  Do better.",
            "They only care about babies that are still in the womb. Once they're born you're on your own"
        ]
    },
    "Judge rejects Alec Baldwin’s motion to dismiss ‘Rust’ shooting case over damaged firearm": {
        "title": "Judge rejects Alec Baldwin’s motion to dismiss ‘Rust’ shooting case over damaged firearm",
        "score": 1824,
        "url": "https://www.nbcnews.com/news/us-news/judge-rejects-alec-baldwins-motion-dismiss-rust-shooting-case-damaged-rcna158824",
        "content": "",
        "num_comments": 329,
        "comments": [
            "TLDR: The Gun got damaged by FBI forensics. The defense claims it was crucial to exoneration. The judge disagrees but insists that the prosecution describe the damage that was done to the gun.",
            "The Court Junkie podcast did a great job covering the trial of Hannah Guitierrez-Reed, the armorer on the set of Rust. She was found guilty of involuntary manslaughter and got... 18 months.",
            "They should make a movie about this.  Dishonesty and incompetence everywhere.  Even the FBI and the Judge are getting into the game.  Everyone is pointing fingers at everyone.  No one is saying anything about how live rounds got on the set.",
            "I dont know anything about this, but holy shit how is it anyones fault except for the nepo lady whos sole job is to make sure real bullets never come near the set, but broke that rule immediately and held live target practice on set",
            "This will be a fascinating case that will probably end up with new case law. As the actor, he isn't necessarily responsible because the armorer on set is responsible for ensuring that there are no live rounds on set. Baldwin is responsible as a producer for assisting with the hiring of the armorer. The question is, can they show negligence on Baldwin's part that led to the death?",
            "I still dont understand how that was his fault at all. Wouldnt it be the weapons handler or something?",
            "Please help me with this. Gun handler was shit and a person died. Alec Baldwin had no idea the gun was live? Actors use guns all the time in movies? How is he at any fault? Was the person who killed Brandon Lee charged? \n\nNo intent. An accident. The handler has been properly prosecuted and sentenced for malpractice. Alec was simply doing what hed done many times before on set. What did he do wrong?",
            "From all I have seen and read about this shit, if he truly was involved in less safety for cuts in the production of the movie he is 100% responsible for that shit",
            "Fucking hell... they're STILL going on about this?",
            "For those NEW to this mess, Baldwin claims the gun \"went off on it's own\".  It's a Single Action Cowboy Revolver.  You HAVE to cock the hammer and pull the trigger to fire it.  That is the ONLY way it fires.  People carry these with six chambers loaded because even if it falls from the holster IT WILL NOT GO OFF unless COCKED and FIRED.  It broke under testing because the FBI hit it SO HARD to see if they could get it to go off without pulling the trigger that they BROKE the hammer off of the gun completely.....and it still did not go off.  Modern Revolver styles are built differently.....you are supposed to carry with the hammer over an empty chamber because if it is dropped it MIGHT go off......these Cowboy style single actions are INCREDIBLY safe even if dropped.  TLDR : Baldwin is probably lying out his butt about it going off without him pulling the trigger."
        ]
    },
    "Supreme Court allows cities to enforce bans on homeless people sleeping outside": {
        "title": "Supreme Court allows cities to enforce bans on homeless people sleeping outside",
        "score": 26543,
        "url": "https://apnews.com/article/supreme-court-homeless-camping-bans-506ac68dc069e3bf456c10fcedfa6bee",
        "content": "",
        "num_comments": 4816,
        "comments": [
            "That Star Trek episode where the homeless get put into Sanctuary Districts in 2024.",
            ">The law, in its majestic equality, forbids rich and poor alike to sleep under bridges, to beg in the streets, and to steal loaves of bread \n \n   - Anatole France",
            "Nice timing with housing being the most expensive its ever been.",
            "Funny how theyll make it hard to be homeless but never prevent you from becoming homeless in the first place.",
            "This Court: Corporations are people, the homeless are not.",
            "So basically it's illegal to be homeless even if you don't have anywhere to go and the shelter is full.",
            "All homeless people should go to whatever is their local police station, tell them that they have nowhere to sleep, and would like to know how to exist without breaking the law. Because thats what this is doing: criminalizing existence.",
            "Well they can't sleep at Logan airport in MA anymore according to Gov. Healey.",
            "SCOUTUS in a few years: You have to own property on US soil to be recognised as a human being.",
            "So instead of helping to build more shelters or create any help, lets just kick them out, fine them money they dont have, or arrest them and cost the taxpayers even more by housing them in prison. \n\nCool country we live in."
        ]
    },
    "The Supreme Court weakens federal regulators, overturning decades-old Chevron decision": {
        "title": "The Supreme Court weakens federal regulators, overturning decades-old Chevron decision",
        "score": 16374,
        "url": "https://apnews.com/article/supreme-court-chevron-regulations-environment-5173bc83d3961a7aaabe415ceaf8d665",
        "content": "",
        "num_comments": 2449,
        "comments": [
            "If you took Con Law even 3 years ago, your entire education has been erased",
            "I was too young to remember when our rivers stopped catching fire with alarming regularity, but with the help of this Supreme Court, I might be able to witness it before I'm too old to be appalled in real time.",
            "How long before food safety laws are weakened?",
            "I think, even with the immunity case, this is the most far-reaching consequential SCOTUS decision in decades. They've effectively gutted the ability of the federal government to allow experts in their fields who know what they're talking about set regulation and put that authority in the hands of a congress that has paralyzed itself due to an influx of members that put their individual agendas ahead of the well-being of the public at large.\n\nEdit: I just want to add that Kate Shaw was on Preet Bharara's podcast last week where she pointed out that by saying the Executive branch doesn't have the authority to regulate because that power belongs to Legislative branch, knowing full-well that congress is too divided to actually serve that function, SCOTUS has effectively made itself the most powerful body of the US government sitting above the other two branches it's supposed to be coequal with.",
            "A river hasn't caught fire in a long time. Time to find out why regulation are necessary for both humanity and nature",
            "What a terrible time to be young and see this disaster being queued up for you to deal with.",
            "The only hope is for Dems to win the next two elections, and it will still take so long to overturn this dystopia we are finding ourselves in\n\nHard to feel hope now...",
            "As a fed who does some work in rulemaking, this is gonna fuck things up for a long time. Even more lawsuits, bottlenecks where Congress is silent on necessary technical procedures and substantive reasoning even in the laws they *do* manage to pass. I dont think the general public realizes how much MORE this will grind things to crawl.",
            "Welcome back to the times of rivers on fire. Predatory bank lending, no consumer protection laws, etc. Basically, if a law existed that protected you from those who only care about profit, federal agencies can no longer stop them.",
            ">But the current high court, with a 6-3 conservative majority, has been increasingly skeptical of the powers of federal agencies.\n\nAt this point maybe the executive should likewise be more skeptical of the powers of the judiciary. For example, where in the constitution was the supreme court given the power of judicial review?"
        ]
    }
}