{
    "Interislander runs aground, passengers in lifejackets": {
        "title": "Interislander runs aground, passengers in lifejackets",
        "score": 207,
        "url": "https://www.nzherald.co.nz/nz/interislander-runs-aground-passengers-in-lifejackets/MESDRBENNFABXJL54YJYXDM7KI/",
        "content": "",
        "num_comments": 151,
        "comments": [
            "Beached as bro.",
            "Apparently the passengers are all okay but God I hope there aren’t any trucks with poor sheep or anything stuck on there.",
            "Good thing we ordered new ferries to replace our ageing fleet, right?\n\nRight?",
            "Managed to get a cabin, who knows how long I'll be on here. You can almost hear the beginning of a horror movie starting.",
            "Oh man, if only we had a bunch of new ships on the way to replace the fleet we have that are past their service life",
            "Brown said the Government was committed to a resilient Cook Strait service but ministers also wanted to see KiwiRail maintain its existing ships to the appropriate standards.\n\n“Which has been a significant issue that we’ve been highly unimpressed with coming into Government”, he said.\n\nSimeon Brown working overtime to make it the last governments fault. \n\nWho cancelled ferry contracts again?",
            "It's almost like we need a new boat. Or two.",
            "Kiwis can't have nice things, we are only allowed old second-hand dungers and stuff done on the cheap,\n\nNZ has low self esteem.",
            "We've just been directed back to our vehicles. Departures are inbound.",
            "From RNZ:\n\n>The ferry will not be refloated this morning\n\n>Marlborough mayor Nadine Taylor says more work needs to be done to assess the situation.\n\n>Taylor, who is acting as spokesperson for the harbourmaster, says given the next high tide is this evening when it will be dark likely the the next attempt to refloat won't happen until next high tide on Sunday.\n\n> She says divers will head out again this morning to get more information about where on the bottom of the vessel the ship is grounded.\n\n> Authorities are now coming up with a plan for getting the passengers off the vessel safely."
        ]
    },
    "Credit: Tavlova on Facebook ": {
        "title": "Credit: Tavlova on Facebook ",
        "score": 181,
        "url": "https://i.redd.it/46t89i0xm28d1.jpeg",
        "content": "",
        "num_comments": 7,
        "comments": [
            "I need to get wet, ASAP",
            "But they do have chips.",
            "It’s just taking it’s time, feeling fine.",
            "😂😂😂 brilliant",
            "They also have ghost ships.",
            "Chiips are like $14.",
            "they cancelled the funding for ghost ships"
        ]
    },
    "Anti-LGBT March ": {
        "title": "Anti-LGBT March ",
        "score": 510,
        "url": "https://www.reddit.com/r/newzealand/comments/1dlhzf7/antilgbt_march/",
        "content": "There was just a March with high turn up for an Anti-LGBT cause. Queen Street, Auckland. \n\nBro I’m literally just existing, chanting that it’s been taught in school and shit. Now that’s what you call a propaganda. No one’s making your kid gay, they’re already gay. I have a sunken feeling about this…… ",
        "num_comments": 220,
        "comments": [
            "Just remember that old mate Eftpostle has been trying and failing with his anti-queer crusade for literally decades. Twenty years ago this year, he led a march of thousands of cultists and white supremecists against civil union legislation and what happened? Nothing, nil impact. \nNine years later NZ passed same-sex marriage legislation with an even larger voting majority and Eftposle's influence was so meager he couldn't even muster a protest.\n\nWhile it may seem that a lot of people showed up, they represent practically the entire anti-gay movement because it's pretty much just made up of Destiny cultists and other Christians who ignore the words of Jesus.",
            "Why don’t they use the same energy to fight against those in their churches who molest and abuse children?",
            "What kind of dickhead goes to an Anti-LGBTQ march?",
            "It's Tamaki's hate-mob. The sooner that fuckwit gets recognised as a gang leader the better.",
            "They were doing this outside my kids school this week and interview/harassing his classmates. Just fuck off and let these kids be. Their lives are hard enough, just being a teenager without these loopers  protesting their existence",
            "There's no hate like Christian love.\n\nStill one of my favourite things watching Georgina Beyer tear into the eftpostle 20 odd years ago.\nShowed what real courage looked like.",
            "You should have held up a placard, \"if you protest you're gay.\" Instant defeat.",
            "Isn't getting any news coverage.",
            "It will be those smooth brains from Destiny Church.",
            "Did the eftpostle have anything to do with this? Seems his style."
        ]
    },
    "So They're Putting Simon Brown Up As The Sacrifice... ": {
        "title": "So They're Putting Simon Brown Up As The Sacrifice... ",
        "score": 229,
        "url": "https://www.reddit.com/r/newzealand/comments/1dlmg8r/so_theyre_putting_simon_brown_up_as_the_sacrifice/",
        "content": "...Meanwhile Luxon, Willis and the leaders of the other parties are all strangely silent. Wont save them on Monday though, question time in the house should be very fun, never mind the press.\n\nAnyhow, if I were more functional I'd do a bingo card up for the excuses Brown will/is making. But at a guess, it'll be:\n\na) It's Labour's fault!\n\nb) It's Kiwirails fault!\n\nc) Free Square\n\nd) It's not our fault, the reports etc didn't say this would happen!\n\nc) It's the contractors fault, they fucked up the steering and totes not mechanical/electrical failure to components at their end of life!\n\ne) Blame The Experts, it's totes not our fault despite KR telling us the ferries needed to be replaced ASAP.\n\nf) Brown attempts to spin some other bullshit to get out, and fails. Because he's an idiot duh.\n\ng) It Cost Tooooo Much!11!1! Even though it was the portside stuff that was the problem, not the boats.\n\nAlas, I lack the focus to be able to sit through Brown doing what he does best and the hard liquor needed to survive it.\n\n  \n\\[Edit\\] - And b) is the \"answer\" Simon Brown has taken, in the form of \"Asset Management\", despite the fact the steering was completely overhauled 3 weeks ago with new parts and probably a shit ton of checks etc. So KR have been keeping up with \"asset management\" you vacuously brained nonce. ",
        "num_comments": 158,
        "comments": [
            "Luxon on Monday - “well the front fell off, that isn’t supposed to happen”",
            "They’ll also throw Kiwirail under the bus.",
            "As always, they are “committed to delivering” something that they have recently decided to not fund.",
            "It might be Simeon's portfolio, and he is an intellectual void at the best of times, but make no mistake, this is Nicola Willis's 'household budget' economics in action\n\nWhere is your second hand Corolla now, Nicola",
            "[removed]",
            "This is the perfect issue for the coalition government. Short term hit with no election in sight, close enough to the last election to blame the previous government, highly visual and affecting an iconic piece of tourism infrastructure.   \n\nPerfect for a hastily arranged privatisation and “Look, we got it all sorted in time for Summer peak cause Chris knows a guy at P&O Ferry Lines! The market works!”",
            "It's a small price to pay to ensure our struggling landlords have some dignity",
            "Tbf Kiwirail had a great solution. It also has maintenance crew working on the Aratere 24/7. I know because I have been crew on the Aratere so when Willis implies that Kiwirail are negligible in it’s maintenance that’s simply untrue",
            "When a large complex machine gets old enough, replacing worn out parts often sends the old ones next to it down the toilet as well because they cant handle the strain of the fully performing new part. Its a cascade failure, where fixing one thing leads you down the road of fixing many other things.\n\nOh you fixed the oil pressure on the power steering pump? Now the hydraulic cylinder is leaking oil. Oh you fixed the oil leak on the cylinder? Now the reservoir tank is overflowing. Oh you replaced the fluid and bled the system and put new fluid in? Now the control arm bushings have cracked because the steering is no longer soft. Oh you fixed the bushings? Now the previous oil leak onto other components has fried them and you need to replace the alternator. Oh you replaced the alternator? Now one of the safety systems has burnt out but you wont find out until you try to brake hard and the ABS doesn’t engage.\n\nThese boats are OLD. And they have been in constant service for 26 years, shit wears out and a maintenance schedule is not going to be comprehensive enough to prevent issues without having the entire engine, electrical and transmission systems taken apart and rebuilt. Which would put them out of service for months.",
            "PRIVATISE EVERYTHING! Because some bloke in the field didn't read the manual "
        ]
    },
    "'Didn't someone cancel the order?': Clark takes dig at Govt over ferry running aground": {
        "title": "'Didn't someone cancel the order?': Clark takes dig at Govt over ferry running aground",
        "score": 593,
        "url": "https://www.newshub.co.nz/home/politics/2024/06/former-prime-minister-helen-clark-takes-dig-at-government-over-interislander-running-aground.html",
        "content": "",
        "num_comments": 285,
        "comments": [
            "I’m starting to think maybe it wasn’t such a good idea to cancel a vital project without a backup plan …",
            "National party email received 2 days ago: “Dear Friend --\n\nNational is the party of infrastructure and, in Government, we’re moving at pace to remove the hurdles standing in the way of getting stuff built.\n\nInvesting in infrastructure is a key part of our plan to rebuild the economy and we’ve got so much in the pipeline already.”\n\n  \nlmao sure Chrissy, sure.",
            "Wow, that happened sooner than I thought it would (an example of why we needed new ferries in the first place).",
            "The government labeling the original two new ferries as \"Ferrari's\"  was hugely unrepresentative of what they actually were. A brand new \"Rav4 Hybrid\" would have been more appropriate. Yes they were bigger, and yes they had more bells and whistles, but that's what you get with a 35 year age gap in ship manufacturing. The decision to cancel the new ships WAS PURELY POLITICAL. I expect this incident to be the catalyst excuse the Tory's need to shutdown the Interislander completely, destroying the south island rail network with it. Well done truck lobbyist. You've won!",
            "Would it help if we reframed the cook strait as a very big pothole",
            "Nicola has a plan 😂",
            "Helen pulls no punches - love it.",
            "I’m honestly so pissed off. 😡 \nFirst they defund and cancel replacements, then they blame KiwiRail, next they’ll be trying to axe or sell. \n\nWhat do you wanna bet they have BlueBridge’s owners as backers in their plan to cripple InterIslander.",
            "Aging interislander ferry hits trouble.  No replacement plan in place.  Insert surprised pikachu meme.",
            "A few hours later and we might have had another Wahine"
        ]
    }
}