{
    "Weekly Show & Tell! Share what you've created with Next.js or for the community": {
        "title": "Weekly Show & Tell! Share what you've created with Next.js or for the community",
        "score": 3,
        "url": "https://www.reddit.com/r/nextjs/comments/1dqpzq9/weekly_show_tell_share_what_youve_created_with/",
        "content": "Whether you've completed a small side project, launched a major application or built something else for the community. Share it here with us.",
        "num_comments": 7,
        "comments": [
            "nice job on the job board. what's preventing you to go all in on that? seems like you have a few offers submitted by employers there.",
            "Thank you!! I have a few thinks to polish but the main issue right now is SEO (Im totally a noob with it) and acquiring traffic. The offers you see have been manually submitted by me lol",
            "I really liked the design on [moaijobs.com](http://moaijobs.com) I just started manually submitting job offers to hopefully atract some traffic. Do you know why Lemon Squeezy banned job boards? Also, do you have any tip regarding SEO? How many users do you have now?",
            "I made a CLI that lets you create a Next.js portfolio + blog that automatically links to your GitHub. It’s one of my first projects so would love some feedback. \n\nTry it out here:\n[create-boring-portfolio](https://create-boring-portfolio.vercel.app) \n\nOr just use `npx create-boring-portfolio`.",
            "I started learning NextJS like 8 months ago and I have built   \n- my personal website [https://mrksph.com](https://mrksph.com)   \n- a job board focused on remote jobs in spain (still working on it) [https://teleworker.es](https://teleworker.es) \n\nI'd like to jump into a new project soon but I'm short of ideas",
            "I built a new job board boilerplate with Next.js 14, Supabase Postgres, Shadcn/UI, TailwindCSS, Resend, and Stripe.\n\nYou can checkout the launch here: \n\n[https://x.com/NithurM/status/1806700988826529860](https://x.com/NithurM/status/1806700988826529860)\n\nPlease let me know if you have any feedback. Thanks :)",
            "I have built an open-source Next.js AI template.\n\n[https://next-js-ai-tool-layout-1.vercel.app/](https://next-js-ai-tool-layout-1.vercel.app/)\n\nHere's the github link [https://github.com/soulbliss/next-js-ai-tool-layout-1](https://github.com/soulbliss/next-js-ai-tool-layout-1)\n\nFeatures\n\nIt's a GitHub repository having a full Next JS 14 code  \n  \n- Uses layout files  \n- Loading screens  \n- Dashboard template  \n- Billing page template  \n- Support page template  \n- AI Image generator APP template  \n- Has an awesome login screen with magic link support  \n- Uses Next auth v4\n\nYou can go check it out and let me know the review on it 🙏"
        ]
    },
    "It’s not just you, Next.js is getting harder to use": {
        "title": "It’s not just you, Next.js is getting harder to use",
        "score": 20,
        "url": "https://medium.com/@PropelAuth/its-not-just-you-next-js-is-getting-harder-to-use-5ab30a24282a",
        "content": "",
        "num_comments": 46,
        "comments": [
            "Fun fact: none of you read the article",
            "“Getting harder to use for those who can’t be bothered reading the docs”\n\nFTFY",
            "Wtf, next has a very good dx, imagine having to set up all these in node + react by youself lol",
            "I've spent the past 2 months as the only person on our team using next14 with the app router and it is confusing but im getting there. The app router documentation isn't written well compared to the old pages router. It certainly is a big jump in complexity and as someone new to next it's been tough to work out. \n\nI don't think it's a framework problem as such, but the documentation could be a LOT better.",
            "Based OP, just trying to peddle his own framework.",
            "Fun fact, Next.js has saved me from a couple of headaches by not needing to handle the router, creating simple middleware APIs, thinking in a layout system, forcing me to use naming conventions in the files (page.tsx, layout.tsx), configuring cache, having a SSC by default and many other features.\n\nC Programming is harder. But I believe most people from here don't have a degree in CS and don't even know  what are low level programming languages such as Assembly to really know and understand what's hard.",
            "Any repo that becomes abandoned becomes incompatible. Is this normal? it sounds like something that would happen on WordPress. Which makes it a large mess.",
            "I think the larger issue is compatibility and maintenance of already deployed projects that were using pre-nextjs 13-ish. There is a developer overhead required here to keep these projects going, slightly higher than similar full stack frameworks.",
            "If it’s hard, then you are a bad dev. 🧐",
            "Fun fact: you suck at programming"
        ]
    },
    "Wasn’t me": {
        "title": "Wasn’t me",
        "score": 175,
        "url": "https://i.redd.it/hybrzhf9rc9d1.jpeg",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Heh, just scraped every directory on github.com for .env files.\n\nI think you mean *our* OpenAI API key😎",
            "git reset --hard oldcommit  \ngit push -f",
            "Some of my friends told me, don't worry I deleted it... 🤦‍♂️ Hopefully it was for a school's project and it wasn't important password 🤣 and now, before every project, it's the first thing that I put in my .gitignore. and let a .env.example",
            "As a beginner, I’m so excited to understand this 😅",
            "retarded ass thing to do",
            "just use .gitignore to prevent .env variables from being commited",
            "If you're not smart enough to know what .gitignore is then you're probably not smart enough to know when to not put secrets in the wrong file.",
            "I can barely read, but I did get the part where you said .env files should be included in the repository. Thanks for the tip internet stranger.",
            "I've never done this, but you've made me realize this sounds like exactly how it will play out when I inevitably do. I'm the one who loses my car keys, spends forever looking, finds them, then loses them again before I get out the door (It's exhausting misplacing things so frequently). How can it not happen to me? lol",
            "Common sense isn't common :)"
        ]
    },
    "My Journey with Next.js and Vercel: From Overwhelmed Teen to Confident Developer": {
        "title": "My Journey with Next.js and Vercel: From Overwhelmed Teen to Confident Developer",
        "score": 12,
        "url": "https://www.reddit.com/r/nextjs/comments/1dr4jg5/my_journey_with_nextjs_and_vercel_from/",
        "content": "\nI wanted to share my journey with Next.js and Vercel, which I've been using for the past three years. I started learning web development at 16 with just HTML, and I remember feeling overwhelmed with the complexities of installing Node.js, pnpm, GitHub, and resolving dependencies for frontend frameworks.\n\nGrowing up in Singapore, I wasn't allowed to have a credit card, and my teachers discouraged its use. This made exploring cloud services even more daunting, especially with news about people overspending or misconfiguring their cloud setups.\n\nInitially, I didn't like the pages router in Next.js and decided to stick with Flask for development and hosting, using Railway for my database. Managing database migrations was a hassle, but it was my only option at 16. The pages router felt clunky at that time. Eventually, I got banned from Railway, which forced me to migrate to Replit. There, I had to deal with overwriting Linux commands, changing network configurations to keep the app online from the command line, and finding workarounds for unavailable pip packages. It quickly became unsustainable.\n\nAt the time, many influencers advised against using Vercel, so I avoided it. But when Vercel released the app router and one-click deployment, I decided to give it a try for both my app router and Flask apps. It was a breeze—every time I committed code, it got deployed instantly. Migrating my Railway database to Neon was also smooth, thanks to the excellent documentation for Next.js.\n\nIt was easy to transition from the page router to the app router. Influential YouTubers like Coding with Antonio and Web Dev Cody provided great insights into this framework, and I found myself enjoying it more and more. I've been coding with Next.js and Vercel ever since.\n\nI wanted to take this post to express my gratitude to this community and the Vercel team for making things simple and efficient for teens like me to explore new technologies. Thank you!\n\nFeel free to share your experiences or tips if you've had a similar journey. Let's keep learning and growing together!\n\nCheers,  sven",
        "num_comments": 0,
        "comments": []
    },
    "Minimal Waitlist Template, I would love your feedback! ": {
        "title": "Minimal Waitlist Template, I would love your feedback! ",
        "score": 2,
        "url": "https://v.redd.it/xc7ebyhndi9d1",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Repo: [https://github.com/Samicostox/waitlist-template](https://github.com/Samicostox/waitlist-template) \n\nTwitter : [https://x.com/DynauiDesign](https://x.com/DynauiDesign)\n\nThe live link is in the repo :) give a star if you like it!"
        ]
    }
}