{
    "That's how you make checking a rifle a skill": {
        "title": "That's how you make checking a rifle a skill",
        "score": 4167,
        "url": "https://v.redd.it/w2ssxc746g9d1",
        "content": "",
        "num_comments": 624,
        "comments": [
            "Fascinating to watch, but kind of silly…no?   I guess a whole lot of silliness is what makes life interesting.",
            "This video is sped up.. but still cool to see",
            "I bet he does The Robot at the club perfectly",
            "It actually looks better when not unnecessarily sped up",
            "Dirt in the rear sight aperture. Pass revoked.",
            "This is the Changing of the Guards at the Tomb of The Unknown Soldier in Arlington National Cemetery. It's an amazing/moving thing to see in person. Complete silence during the process, very respectful atmosphere. If not, they will stop in their tracks and yell at you as a warning. \n\nThe tomb is guarded 24hrs and is considered one of the highest honors in the military. Very strict guidelines that have to be followed. This is a ceremonial process, but has actual checks/processes.",
            "How many \"private scarface\"s were created while he perfected that?",
            "That's the silliest thing I've seen in a long time.",
            "Gotta make sure that bayonet is fixed well, else that thing will fly off and take someone else out 😂 ",
            "This is what the Camberwick Green army looks like."
        ]
    },
    "He walks into class last every day to bring the kind of positive energy we all need in life": {
        "title": "He walks into class last every day to bring the kind of positive energy we all need in life",
        "score": 27868,
        "url": "https://v.redd.it/hrpk92zrge9d1",
        "content": "",
        "num_comments": 947,
        "comments": [
            "I need a fraction of his energy in the morning",
            "I am more impressed by the person who took the video daily. I can only imagine the commitment.",
            "Awesome but definitely gave me that feeling of when you say the same word so many times it stops being a word.",
            "He owns way more t shirts than I do. I don’t think there was a single repeat.",
            "Agree with the sentiment, but tbh, didn’t see a single person ‘light up’ when he walked in lol",
            "Bro wearing a Chase Bank shirt is the funniest one",
            "I did and still do that work, no matter how I felt personally. When I was leaving for another job after a decade, at my farewell speech one of my senior managers mentioned, how initially the entire floor felt when I used to walk in. I was like oh damn! And started to sink into my seat 😩.  To my surprise, he went onto say, within a few months he realised the positive energy was rubbing off when I had taken a four week holiday and everyone kept asking him about me and if I was okay? He further went on to mention how this chirpy attitude first thing in the morning helped some perk up and this is one of the things he and colleagues on his floor are going to miss the most! \n\nWhilst this may have been rehearsed (I don’t know) I read one or two comments along those lines. I am sharing this with all of you with hope that some of us may be able to appreciate the little gestures that bring and/or enhance positivity around us. Spread joy people even if it’s with just a smile 😊",
            "What's next level about this?",
            "Teacher here. I see every day how the world changes for kids with positive attitudes vs kids that don't. It's truly astonishing and stark to see. The kid who comes positive every day gets the benefit of the doubt from his peers and his teachers. He makes a mistake and it goes so much better for him.",
            "I’m more concerned about the girl to the right that looks like she’s fighting some demons coming through that phone."
        ]
    },
    "That arch(er) though": {
        "title": "That arch(er) though",
        "score": 1025,
        "url": "https://v.redd.it/nuo0oz8bhh9d1",
        "content": "",
        "num_comments": 109,
        "comments": [
            "I'm not sure how useful that skill is but it's pleasing to the    eye",
            "the toe grip is insane",
            "“What’s your fetish?”\n\n“Oh, you’ve probably never heard of it”",
            "That outfit is pretty next level.",
            "If i ever need a balloon popped, upside-down, in the desert, by a contortionist - i'll know who to call.......WHO IS THIS FOR?",
            "I have a weakness for athletic female archers.  Accept my upvote.",
            "Guess we know who will tapped to play one-armed Green Arrow in live action The Dark Knight Returns.",
            "My foot cramped just watching this.",
            "What an absurd amount of strength and precision you need to do this",
            "I wanna compliment but it will probably reveal a bit too much about what I was looking at so I'll just say that accuracy was amazing 🤩"
        ]
    },
    "Dancing in the sky": {
        "title": "Dancing in the sky",
        "score": 609,
        "url": "https://v.redd.it/9pb92pc8tg9d1",
        "content": "",
        "num_comments": 22,
        "comments": [
            "me when i experience a lag spike in game",
            "I guess once you've done a few hundred jumps plummetting stright down loses it's appeal. You've got to add-on something else to the experience. Definitely skillful but what next?",
            "I think he’s dancing to “Not Like Us”.",
            "When you forget your parachute, but can at least do a fortnite dance for the views",
            "Damn ,you have to be really high to do that .Like literally...",
            "head in the clouds ☁️",
            "Sky diving is definitely a hobby I wanna get into some day.  \n  \nIf only there was a place that did that near me.",
            "This is more than a few hundred jumps. You're watching someone that likely has thousands, either that or hours of tunnel time.",
            "OnlyFans- the “Going Down” compilation",
            "He's most definitely not like me 😭"
        ]
    },
    "A duck runs in a marathon and even gets a medal!": {
        "title": "A duck runs in a marathon and even gets a medal!",
        "score": 216,
        "url": "https://v.redd.it/9cc3xcx27i9d1",
        "content": "",
        "num_comments": 25,
        "comments": [
            "Daffy doing side quests now",
            "Lil fucker saw fois gras on the menu and decided to get slim quick lmao",
            "\"and then, \n\nwe ate him\"",
            "Okay, so it wasn’t actually a marathon that it ran, correct? There were little kids at the beginning, so I imagine this was probably the 5k event of the marathon weekend.",
            "He didn't intend to run, he was just out for a quick gander..",
            "I love you, running duck",
            "Duck, 🦆 turbo activation for a strong finish. You have my respect.",
            "Where is its arms? Pls help",
            "“Let me tell you all about Aflac, hey stop running from me!”",
            "Is the duck wearing quac-ka shoes?"
        ]
    }
}