{
    "NFL Circlejerk's 9/11": {
        "title": "NFL Circlejerk's 9/11",
        "score": 4454,
        "url": "https://i.redd.it/ubk1sym8u2ic1.jpeg",
        "content": "",
        "num_comments": 337,
        "comments": [
            "New flair added for the Choking GOAT",
            "Kyle Shanahan the GOAT of giving up double digit leads in the Super Bowl. Basically singlehandedly made Mahomes's career.",
            "When Hardman Jr. caught that touchdown, I immediately sprung from my couch and slammed my television, piercing through its OLED screen and shattering glass. My kids were crying and my wife was screaming as I slammed it onto the floor whilst Patrick Mahomes held the Lombardy Trophy. Taylor Swift rigged this Super Bowl!",
            "Patrick mahomes father is so generous. He got his third dui so his son could get his third ring. Truly inspirational.",
            "Why did the 49ers let the Chiefs beat them? Are they stupid?",
            "Guess I have to kill myself via autoerotic asphyxiation",
            "Why would Kyle Shannahan kick a field goal and give Mahomes a chance to win the super bowl with a touchdown in OT? Is he stupid???",
            "maybe kanye was right about the media",
            "How bout that D\n\n-Cheeseburger Andy",
            "If chiefs get the last possession of a 1 score game might as well just head to the locker room"
        ]
    },
    "I for one think JaMarcus deserved the money more than those high schoolers": {
        "title": "I for one think JaMarcus deserved the money more than those high schoolers",
        "score": 90,
        "url": "https://i.redd.it/yv9ha7ujwi9d1.jpeg",
        "content": "",
        "num_comments": 32,
        "comments": [
            "Went to the Favre School for Scumbag Retired QBs.",
            "JaMarcus Russell steals candy from babies",
            "I watched this man win a Natty Champ at LSU and then he just proceeded to be a *complete piece of shit* ever since.\n\nEdit: Sugar Bowl, not Natty. That was Matt Flynn. Cue the tired ass totally-not-racist \"Classy vs Thug\" arguments.",
            "Blank tapes ain't cheap these days",
            "Jamarcus Russell heart plus Hussle plus stealing from children",
            "This dude went ALL in on being a bum. Incredible.",
            "He stays winning by jerking others",
            "And boy did that fucker eat.  Made O-line men look downright slim when he showed up to camp.",
            "Hows he going to live on the James Harden diet without the James Harden money",
            "Is he even retired or just a free agent?"
        ]
    },
    "How a breeding bull is greeted by pasture full of cows …(Kelly Stafford showing up at Georgia QB camp)": {
        "title": "How a breeding bull is greeted by pasture full of cows …(Kelly Stafford showing up at Georgia QB camp)",
        "score": 135,
        "url": "https://v.redd.it/i3d99r49ff9d1",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Picture yourself being loaded onto a truck. And you end up in an area where there's an abundance of food and milfs all around you.",
            "Kelly Stafford showing up at any place with a bunch of dudes.",
            "I have this dream every night.",
            "But its like a womens prison and you get slaughtered when you cant fuck anymore",
            "You just reposted the top comment from the original post",
            "I bet it the locker rooms she gets passed around like a vape in the school bathroom",
            "![gif](giphy|HgtCxKvJZ7Wi4)",
            "![gif](giphy|1kIZYgfmWcHdOiTUDu|downsized)",
            "Death by snu snu",
            "More like chop chop"
        ]
    },
    "Kirko chains?!?!?!": {
        "title": "Kirko chains?!?!?!",
        "score": 208,
        "url": "https://i.redd.it/0uuh2ez36f9d1.jpeg",
        "content": "",
        "num_comments": 23,
        "comments": [
            "he became black the instant he set foot in atlanta",
            "Shame he didnt fully commit to the character",
            "Kirk and Julie's love for each other is the only love that can rival that of Romeo and Juliet's or Tom Brady's love of kissing his son on the lips",
            "Very classy, how a QBs wife should be behaving in the great state of Georgia ",
            "Dudes been in ATL for 30 seconds",
            "Julie Cousins can get it",
            "Uj/ Honestly gained a lot of respect for Kirk after seeing this, people will probably get mad anyway but in an era where a lot of people felt comfortable doing blackface and going to parties, he was compassionate/smart enough not to.\n\nRj/ Kirko chainz was black since day, bomba pussy rassclart Vikings no have time for a general, dibby dibby soundboys",
            "Is he trying out for the Jamaican bobsled team?",
            "Matt Ryan,  ya career dead?",
            "Don't think he would fit in down in jaimaca"
        ]
    },
    "Remember when this was the worst rematch": {
        "title": "Remember when this was the worst rematch",
        "score": 262,
        "url": "https://i.redd.it/o9g2o2af1e9d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Remember when is the lowest form of conversation",
            "I was hoping for both of them to lose",
            "I see it as the Suicide Bowl (Philip Adams representing San Francisco, Jovan Belcher representing Kansas City).",
            "Listen to him, he knows everything",
            "I wish the lord would take me now.",
            "![gif](giphy|UUtePRuu4CPUBWEnYg|downsized)",
            "![gif](giphy|YaUfBtDNf7TGayf3Rn|downsized)",
            "![gif](giphy|eVK9GWGOvMpAQ)",
            "![gif](giphy|ZKrIYV3oIzIL6)",
            "![gif](giphy|PSzIDB0AUA9ag)"
        ]
    }
}