{
    "Do NOT upvote the repost bots!": {
        "title": "Do NOT upvote the repost bots!",
        "score": 759,
        "url": "https://www.reddit.com/r/Nicegirls/comments/12qmw2b/do_not_upvote_the_repost_bots/",
        "content": " We are aware of the sudden influx of repost bots that are attempting to just farm free karma.\n\n***WE PERMA-BAN THE BOTS.***",
        "num_comments": 52,
        "comments": [
            "Make sure to read our [Rules](https://www.reddit.com/r/Nicegirls/about/rules/) and remain civil. Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Nicegirls) if you have any questions or concerns.*",
            "How do you know if a post is from a bot? I’ve been wandering this for awhile.",
            "[removed]",
            "I will never quite fully comprehend the \"economics\" of people buying reddit accounts. Presuming that is even the end goal of these karma bots.",
            "I mean I usually downvote reposts in general",
            "My urge to upvote is real high",
            "Have you adjusted crowd control?",
            "I think there should be account age minimum for posts",
            "You can tell an about is a boy by the beeps and  robot noises they make!",
            "Dammit I wasn't sure, but I started noticing accounts with low karma and spaming posts on r/test."
        ]
    },
    "“You short, fat, ugly, broke loser… I’m a nice person.”": {
        "title": "“You short, fat, ugly, broke loser… I’m a nice person.”",
        "score": 279,
        "url": "https://i.redd.it/y3qfhizvm08d1.jpeg",
        "content": "Disclaimer: obviously he shouldn’t have said anything about her looks, that’s also bad. ",
        "num_comments": 98,
        "comments": [
            "Make sure to read our [Rules](https://www.reddit.com/r/Nicegirls/about/rules/) and remain civil. Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Nicegirls) if you have any questions or concerns.*",
            "For something so small, she certainly couldn't stop talking about it.",
            "\"SMOL PP\" the insult of choice for women that lack creativity and are incapable of objectively evaluating a person and their qualities or lack there of.",
            "I think I'm more offended by the unnecessary censoring than anything anyone did in the story.",
            "There's three sides to every story: his story; her story; and the truth. \n\nGiven how much she's ragging on his 4-inch dick, I'm willing to believe she did tell him about it. Whether that was before or after his insults about her body, that's something we will never know.",
            "Still beat tho",
            "I love these kind of attacks. \n\nIt means either it's true, and you let yourself get played by someone so \"pathetic\", effectively proving yourself to be even more pathetic than that\n\nOR\n\nIt's not true at all and you're outing yourself as a mental and emotional midget that lacks the maturity to manage their thoughts and emotions.\n\nEither way, they make themselves out to be total trucks.",
            "Still fucked right?",
            "I'm a nice person",
            "Beauty fades, dumb is forever. And this woman is dumb."
        ]
    },
    "Found this interaction on Twitter": {
        "title": "Found this interaction on Twitter",
        "score": 1674,
        "url": "https://www.reddit.com/gallery/1dkja4g",
        "content": "Girl gets rejected by boy and becomes unhinged. Red is girl and blue is boy. ",
        "num_comments": 89,
        "comments": [
            "Make sure to read our [Rules](https://www.reddit.com/r/Nicegirls/about/rules/) and remain civil. Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Nicegirls) if you have any questions or concerns.*",
            "who the fuck pressed “like” on these",
            "Sexually harasses him online for everyone to see, dm's him he tells her to fuck off in a nice way. She implodes worse than the atom bomb. This is the biggest female incel I've ever seen holy shit she's gonna die alone or cause her partner to rope himself.",
            "\"I'm just a girl :3\"",
            "tbh you should report her to the cops",
            "Calling him fat is hilarious",
            "twitter being cringe as usual",
            "There’s a lesson to be learned here lads: Don’t stick your dick in crazy.",
            "I'm sorry this happened. I'm shock people like this even exist plus being a girl and wishing r*p-e to someone is wild as f. That's disgusting behaviour, someone should report her",
            "That second pic is a text equivalent of a triggered chihuahua"
        ]
    },
    "Ex girlfriend showed up to my apartment uninvited": {
        "title": "Ex girlfriend showed up to my apartment uninvited",
        "score": 963,
        "url": "https://i.redd.it/wnhkx53cim7d1.jpeg",
        "content": "Last night I had an ex girlfriend that I used to date for a few months in late 2023 show up uninvited to my apartment. She called me out of nowhere with no caller id, since her number and all socials are blocked. She then asked if she could come over to which I refused, but decided to show up at my apartment regardless. She spam called me over 20 times (attached image) trying to get my attention. I confronted her and after she left I filed a police report. Be safe out there yall",
        "num_comments": 176,
        "comments": [
            "Make sure to read our [Rules](https://www.reddit.com/r/Nicegirls/about/rules/) and remain civil. Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Nicegirls) if you have any questions or concerns.*",
            "Definitely be safe dude. You never know who you might be giving your location… That’s why I gotta know ppl for least a month or two before we hang out or stay over. Got a girl now but dang",
            "I m glad you reported her to the cops.",
            "Be sure to keep documenting if it continues. You may find yourself in need of a protection order.",
            "if you didn’t answer the first 10 times",
            "This is my caller ID list but it’s my insane mother. My entire phone list is either from my doctors, or my mother calling me to tell me how much a piece of shit I am.",
            "Yeeesh. Thanks for reinforcing my paranoia on answering any calls where I don’t know the number lol",
            "“Hey I know things ended badly, but I found your winning mega millions ticket and it didn’t feel right keeping it”",
            "You’re in for the hassle of your life! Back in the days of landline phones, I had a nutcase chasing me. When she’d call & call and I’d either hang up on her or stop answering, she’d call my parents and ask *them* to call me and tell me to answer her calls. \n\nOne weekend, I got tired of her constant calls, so the last time she called, I hung up on her and took the phone off the hook and laid down for a nap. Around two hours later, I woke up and placed the phone back on the hook. As soon as I did, the phone began ringing. \n\nME: ???Hello???\n\nHER: YOU [string of curse words], DON’T YOU EVER HANG UP IN MY FACE AGAIN!!!\n\nME: ???Have you been hanging on the phone all this time?!?!\n\nHER: YES!!!\n\nME: WHY???\n\nHER: BECAUSE YOU WOULDN’T ANSWER!!!",
            "Remember the time my ex-gf was screaming at me trying to keep me up late(was going to get 4 hours of sleep on a 7 day stretch of 12 hour shifts) i had enough and drove an hour to my parents house then she got blasted walked two miles to her parents house broke/shattered the patio door in bit her dad had cops take her to jail do a 3 months stretch (parents rich and narccicistic bought her a lawyer and rehab facility no jail time) i have some more stories but boderline personality disorder is such a destructive disorder its sad"
        ]
    },
    "My balls are on FIRE": {
        "title": "My balls are on FIRE",
        "score": 0,
        "url": "https://i.redd.it/1lz8wer1xy7d1.jpeg",
        "content": "I’ve been dating this girl for about 6 months. Me (M23) and her (F19) had a rocky start in the beginning but over time we grew closer. Originally I thought she was 20 but through circumstances I won’t get into I found out she was 19. Also found out that her ex was living with her for a while when we first got together but she swears they weren’t doing anything. He’s just recently moved out about a month ago. We’ve been having sex for a while but recently my balls have gotten super itchy and I know it’s hot where I live but this is unbearable because I can’t stop pawing at myself I feel like a dog. She asked me if I gave her chlamydia and I told her no which is true because when I went to get tested both times after she asked me the results were negative while hers was positive. She told me that her results were probably false but I told her those tests are 99% accurate. She’s says she hasn’t had sex with anyone else but it’s an std so I’m confused. I want to believe her but I just feel like I’m being naive. Any thoughts on what to do?",
        "num_comments": 7,
        "comments": [
            "Make sure to read our [Rules](https://www.reddit.com/r/Nicegirls/about/rules/) and remain civil. Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Nicegirls) if you have any questions or concerns.*",
            "I think you answered your own question, in the end you need to decide what you want to build your relationships on. Lies, fear, fomo? Trust, honesty, confidence? Your choice. We can't make that choice for you. You're seeking confirmation then here you have it: Yes, I'd not mingle with a liar, and leave such people out of my life.",
            "Yeah bro she gave it to you. There's a chance it was dormant and she didn't notice, there may have not been anything she did wrong...but i'd put money on her getting it from her ex",
            "Hot girl pulled out a notebook of at least 2 pages of like 100 + guys with their emails and number in the order she had sex with them. She was a hoe but pretty good looking, thought I could fix her LOL",
            "I really hope is not herpes, dat shit is better than your best friend",
            "She’s says she get’s tested every month and I’m like ok even if she didn’t have any symptoms if she had it from before we got together she would’ve popped up as positive so she had to have gotten it recently",
            "Yeah.... sorry bro, been there.."
        ]
    }
}