{
    "NieR: Automata shipments and digital sales top eight million": {
        "title": "NieR: Automata shipments and digital sales top eight million",
        "score": 1142,
        "url": "https://www.gematsu.com/2024/02/nier-automata-shipments-and-digital-sales-top-eight-million",
        "content": "",
        "num_comments": 83,
        "comments": [
            "I just want another Yoko Taro experience with even better gameplay and QoL than Automata. Ill be extremely happy if its a NieR continuation but also I'd be pretty chill with a new IP as long as it has the same ability to make me question my own existence and tear me to shreds by the end.",
            "That made it the second most sold JRPG of the last generation,  just behind FFXV. Impressive.",
            "Funny coincidence i just bought Automata and Replicant remaster again on PC. I beat them on ps4 but it stopped working a while back, so i got em again",
            "Golden game gets what it deserves!",
            "The only game I've bought twice.",
            "But the picture says 800",
            "I'm surprised it's only 8 million. P5 is already at 10 million, though you could argue it's due to rereleases. But Nier Automata had had rereleases too I believe.\n\nI remember them going at it for GoTY and Iove both games.",
            "They really should remake Drakengard at this point 😂",
            "Wonder if the anime part 2 will be able to get more game sales.",
            "Maybe it’s copium, but with everything that’s happened around Nier and Yoko taro in the past couple of years since Automata released I think it wouldn’t be crazy to expect square to invest a bit more heavily into Nier or stuff that Yoko taro wants to make. We got a remaster, a switch port, patch for pc, a mobile game, an anime and more. Yoko even got to collab with the FF team to make an actual raid. \n\nDude is well known in the industry now as well as the NieR IP. It would be a huge fumble for square to not continue the franchise in some way. I don’t expect them to give him and his team FF level budget, but I would expect more than what they got for Automata given the success over the years. I just want Yoko to stop making mobile games lol."
        ]
    },
    "『NieR:Automata Ver1.1a』Promotion File 011": {
        "title": "『NieR:Automata Ver1.1a』Promotion File 011",
        "score": 243,
        "url": "https://www.youtube.com/watch?v=441v-JXm0CE",
        "content": "",
        "num_comments": 53,
        "comments": [
            "I thought the release will be in the end of 2024. But it's actually in July 😳",
            "This looks very interesting, I imagine it’s to create suspense but a lot of the defining moments of the C Route aren’t shown here, including a >!LOT more 2B them C Route has!<. I’m curious how different it’ll be.",
            "I thought of Maplestar -_-",
            "seems like amnesia quest is gonna hit even harder than the game 💀 since what i saw is something like her falling from the building... \n(sorry for broken english)",
            "What’s that coin flip at the end?",
            "LETS FUCKING GOOOO! IVE BEEN WAITING FOR THIS FOR SO LONG! AND LISA FOR THE OPENING? LETS FUCKING GOOOOOO!",
            "Does anyone know if the Blu Rays of the first season on EBay sold from China are officially licensed?",
            "So is there any clue of a blu-ray release in the West for the 1st season?",
            "I'm confused. They still don't have an exact date? The Japanese release is July 5, if I remember correctly... I can only assume the dub will be delayed as usual, but still it's kinda interesting that they're still being ambiguous with the release date. xD",
            "I dont understand why season 2 takes too long as much as House of the dragon."
        ]
    },
    "A2 (not_sugashi)": {
        "title": "A2 (not_sugashi)",
        "score": 79,
        "url": "https://i.redd.it/xc7cewf8we9d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "A²",
            "Love it"
        ]
    },
    "Update: You guys were right.": {
        "title": "Update: You guys were right.",
        "score": 87,
        "url": "https://i.redd.it/ajkohtosrh9d1.png",
        "content": "Okay, so I'm not one for sappy words, but this is just... beautiful. Kaine is my favorite character in Replicant and not only finding her home in automata, but knowing Emil made sure that it looks the same as the day he met Kaine is a refreshing breath of hope in the bleak game. It even has the picture Kaine drew of her grandmother! ",
        "num_comments": 4,
        "comments": [
            "Also maybe put this as a spoiler because some individuals on this sub might not have reached the field of memories yet",
            "The music in this area is just perfect.",
            "I played Nier automata, then played Nier replicant. Went back to complete Nier automata a second time to connect both and man did place and Emil sting my heart😭",
            "interesting weapon loadout"
        ]
    },
    "I WAS JUST TRYING TO TALK WITH ENGELS 😭😭😭": {
        "title": "I WAS JUST TRYING TO TALK WITH ENGELS 😭😭😭",
        "score": 1580,
        "url": "https://i.redd.it/1m16plwsjc9d1.png",
        "content": "",
        "num_comments": 36,
        "comments": [
            "Engels blessed us with a good camera angle.",
            "In front of the whole squad",
            "Hmmmmmmmmmmm not sure  if I believe you....... still Yoko Taro would approve regardless!!!",
            "I'm promoting you from chef helper to master chef, keep cooking",
            ">TRYING TO TALK WITH ENGELS\n\nThat's a new excuse. 2B still doesn't approve.",
            "She is looking really sore down there for some reason k",
            "Wow, you can see private parts, actually. Wow, I mean it wasn’t needed to implement at all, like just panties is enough, but attention to detail is crazy if you can call it that.",
            "brb trying to talk to engels rn",
            "The squad got your ass on stream 😭🙏🙏",
            "Indeed, you can't just press E to enter there..."
        ]
    }
}