{
    "Next Nintendo console speculation and question megathread 3": {
        "title": "Next Nintendo console speculation and question megathread 3",
        "score": 0,
        "url": "https://www.reddit.com/r/nintendo/comments/1dj9jf1/next_nintendo_console_speculation_and_question/",
        "content": "# **[Thread 1 here](https://www.reddit.com/r/nintendo/comments/16fs4y6/next_nintendo_console_speculation_and_question/)**\n\n# **[Thread 2 here](https://www.reddit.com/r/nintendo/comments/1cm65by/next_nintendo_console_speculation_and_question/)**\n\n[Nintendo has announced that they will make an announcement about the successor to the Nintendo Switch **this fiscal year**.](https://twitter.com/nintendocoltd/status/1787736518762881197)\n\nThere was **no mention** of the next console in the June Direct, as they said.\n\nThat means that there will be an announcement between **July, 2024** and **March, 2025**.\n\nPlease keep all questions, discussion and speculation of the next Nintendo console confined to this megathread. All threads about this topic will be removed and redirected to this thread.\n\nPlease note that **nothing is verified** about the next Nintendo console except for the fact that it will be announced during this fiscal year. All information about its specs, name, etc. are just speculation and/or wishful thinking.\n\nThank you.",
        "num_comments": 84,
        "comments": [
            "After today's Direct I don't see Switch 2 being officially revealed until Jan/Feb. Unless they retread Switch in which case a soft reveal in Oct/Nov and big showcase in Jan.",
            "I think it will have a Mario game.",
            "Im really hoping for a March release. Nintendo didnt show any solid release dates after DKCR in January.\n\nIf they wait until November well have to limp through another year with an 8 year old console. If it releases in spring and they have supply issues around launch, those hopefully should be resolved before the peak shopping season in November-December.",
            "The new nintendo console will probably and should be called the switch 2 but it would be cool if it was called the \n\nsuper switch because that would  full circle",
            "Just throwing it out there so I can claim I was right when it happens, TES Oblivion remaster will be a Switch 2 launch title.",
            "So I have a New 3ds XL console and a while back it got water inside the system and now its constantly pressing down. I gave up hope on fixing it since the incident happened a while ago. On the Nintendo repair website it says they havent quit repairs for New 3DS XL, but I was wondering if anyone here has experience with this system and knows if they will actually get me back a fixed one. The billing says its around $80 for the repair so I would hope so.",
            "Do you expect the internal storage to be 64GB or 256GB? Do you expect it to be flash memory or SSD? Expect games to still run from game card?",
            "I just want a thick(it helps with ergo and you can feel it with battery, vibration motors and a fan)psp sized, backwards compatible switch 2 micro. It's literally my most wanted console that's actaully possible and I'd gladly wait til the very end of the switch 2 lifecycle(while playing with a probably launch switch 2 or switch 2 lite) so they can maximize gains in efficiency. I just want a maximum portability console that can play my awesome switch library alongside my eventaul awesome switch 2 library without struggling to carry it without a bag and without bulging about to rip pockets",
            "Hope it allows for memory extension via an M2 drive or an external ssd / hdd attached to the dock (Assuming there is a dock.). Micros SD storage growth has hit a wall it seems and its really annoying to be stuck having to delete games.\n\nAlso hope they dont focus too hard on the portable side and forget the console side. Give us a console dedicated version like the portable dedicated lite, or at the very least a beefy dock with extra fans, lots of USB ports and upscaling / extended graphics.",
            "it will either be a headset or have a headset attachment."
        ]
    },
    "smile sunday - beyond hyped!": {
        "title": "smile sunday - beyond hyped!",
        "score": 8,
        "url": "https://www.reddit.com/r/nintendo/comments/1dmnhph/smile_sunday_beyond_hyped/",
        "content": "welcome to smile sunday! turn your caps lock off and rave about whatever has made you **smile** this week! some things to smile about:\n\n* the long-awaited **nintendo direct** has arrived, and it's an all-timer! featured games included **mario & luigi: brothership**, **the legend of zelda: echoes of wisdom**, **dragon quest iii hd-2d remake**, and **metroid prime 4: beyond**! what were your personal highlights?\n\n* the next splatfest for **splatoon 3** has been announced! which team will you be joining the weekend of july 13?\n\n* what's this week's haul? what game did you just buy, just start, complete? anything else that made you smile? let us know in the comments below!\n\n----\n\n# turn that frown upside down:\n\n* here on smile sunday, we have one rule: e.l.e., which stands for *[everybody love everybody](https://i.giphy.com/media/ztBWNcGCyWxTq/giphy.mp4)*. if will ferrell said it, it must be true.\n\n* uppercase letters are strictly forbidden – haha, **just kidding**! if you wanna do some uppercase, feel free, but try not to angry shout sunday; today is about happiness! (happy and excited shouting is a-ok, though)\n\n* this is a happy thread! **keep the love flowing!** if someone's saying something and you think they're wrong, just let them be happy! anything that's made you unhappy this week can go on over to this week's [throwdown thursday](https://www.reddit.com/r/nintendo/s/bS19YMmIcm) thread.\n\n----\n\njoin the **[official r/nintendo discord server](https://discord.gg/nintendo)** to share even more of the love!",
        "num_comments": 7,
        "comments": [
            "Metroid prime 4 has me beyond hyped! It looked amazing!",
            "I finally made it past Level 30 in the Streets of Rage 4 endless survival mode dlc! Just popped the cart in the switch on a whim and played for a couple days before finally breaching 30. Previously kept getting to round 29 and losing.\n\nHad some nice/lucky bonuses, though. Tier 3 Buddy and Toxic upgrade to dash attack as SoR 3 Skate. His alternate dash rolls on the ground, so no jump interruptions. Just roll and roll and wipe out all the enemies.",
            "Games I'm excited for: Mario and Luigi brothership has been my dream for years and I am so happy it was announced. I will definitely proceed to buy it. \nGames I've been playing: I've recently been playing the world ends with you on the ds and I just absolutely love both the visual style and the music",
            "a day late, but M&L is back on switch! im looking forward to Brothership after Partners in Time.",
            "That was one of the best directs I've ever seen in the switch era.",
            "Ahh man the other day I got beaten on level 30 ffs.. what rewards did you get?",
            "You unlock the final round of new weapons and artwork when you beat level 30. Some of the artwork is pretty cool. Absolutely love the final game that we got, but would also like to see an alternate version with the initial concepts.\n\nLiterally the only thing I dont like about the game is that they made modern artwork for Roo and yet only the SoR3 version is playable"
        ]
    },
    "Man accused of sending bomb threats to Nintendo admits to charges: “The more I lost [in Splatoon 3], the more frustrated I would become.\"": {
        "title": "Man accused of sending bomb threats to Nintendo admits to charges: “The more I lost [in Splatoon 3], the more frustrated I would become.\"",
        "score": 1577,
        "url": "https://x.com/oatmealdome/status/1806527226935959710",
        "content": "",
        "num_comments": 108,
        "comments": [
            " This is why I win most of my matches. Saves a lot of time on terrorism charges.  ",
            "Why would the Green Power Ranger do that",
            "By definition, half of the players in the game lose. You don't see them sending bomb threats.",
            "As a Tri Solosher main, I may have contributed to his situation.",
            "Good thing he wasn't a league of legends player then",
            "Not that there's any reason to send bomb threats,  but of all the reasons to send them, I think having a Skill Issue is the lowest.",
            "I know Splatoon 3 truly has the sweatiest players, but get a goddamn grip.",
            "Damn maybe r/saltoon is right - showing the enemy team celebrating at the end might be too much salt in the wound.",
            "And his gut instinct wasnt to get better at the game, play another game or just take a breather to get his head straight, but to send bomb threats to the company?",
            "Kyoryu Green would never do this"
        ]
    },
    "Nintendo Happy With Metroid Prime 4: Beyond, Comments On New & Legacy IPs": {
        "title": "Nintendo Happy With Metroid Prime 4: Beyond, Comments On New & Legacy IPs",
        "score": 717,
        "url": "https://twistedvoxel.com/nintendo-happy-with-metroid-prime-4-beyond/",
        "content": "",
        "num_comments": 83,
        "comments": [
            "At this point I am dying to know what the initial build of Prime 4 looked like.",
            "The did you know gaming of Metroid Prime 4 thatll come out in a few years is going to be crazy",
            "I wonder how many more sales of Dread and Prime Remastered they have made since the showing of Beyond in the last direct. \n\nHopefully a lot ",
            "I wonder if bandai namco's feelings are hurt every time they read something like this",
            "Well have a next Nintendo Direct in September ",
            "Shinya Takahashi's reaction is a pretty promising sign for this game. The game is in great hands for sure, but his reaction just tells me this is gonna be well worth the 18 year wait.",
            "Bruh if I was Nintendo I would also give public statements like \"We are very happy with [New Title] releasing next year exclusively on [Nintendo Console]\"",
            "I mean, who wouldnt be? We are getting a new Prime game at last!",
            "But are they beyond happy?",
            "can you please not use voxel and those other garbage websites"
        ]
    },
    "Some came from handheld while others console, but we’re all together now. Pre-Switch era were you more of a handheld gamer or a console gamer?": {
        "title": "Some came from handheld while others console, but we’re all together now. Pre-Switch era were you more of a handheld gamer or a console gamer?",
        "score": 31,
        "url": "https://www.reddit.com/r/nintendo/comments/1dqy4nt/some_came_from_handheld_while_others_console_but/",
        "content": "I was reflecting on my history of gaming, which mostly was shaped by Nintendo starting in the 90s. Although I've played Sony and Microsoft systems including PC, I would say I have the most experience with Nintendo. I only owned an SNES and a GameBoy Color then, while I played other systems at others houses. As the decades went by I found myself owning the GBA, DS, and 3DS, but no consoles. My parents actually bought the Wii in the late 2000s (for Tiger Woods PGA golf) which introduced me to a new (to me) Nintendo home console. I will forever love Mario Galaxy and ZoL Twilight Princess because of this. And as for the Switch I am more invested than I have ever been for any other console or handheld. I probably have purchased over 30/40 different games for this console which is way more than I had ever purchased for any other console, including PC. As I reflected on this though, I'd likely identify more as a handheld gamer, but because of the switch I've been brought more into the traditional console fold. So it made me wonder how many of you are out there which swung more in one direction than the other (i.e. handheld or console) but was introduced to a new gaming style like myself?",
        "num_comments": 64,
        "comments": [
            "Both, Nintendo handhelds and consoles were different enough to give different experiences so if you could have both you get the best of both worlds (and libraries)",
            "Console and Switch is still my console.  Ive probably spent 10% or less of my Switch lifetime on handheld mode. Thats why my killer feature of the Switch 2 is just more power.",
            "Nintendo has always been primarily hand held for me",
            "I feel like it was both honestly. I have always loved Nintendo handhelds since I got my first gameboy color at 4 or 5 years old. But I've also always had consoles around too.",
            "Both. I had every Nintendo system since the beginning. Console and handheld.",
            "I own all handheld consoles, so yeah handheld.",
            "I always was both. Always had the handheld and console that Nintendo offered. But I always preferred their handheld lines as its my preferred style of play.",
            "Its always been both. My psp and sp probably got just as much playtime as my home consoles did",
            "I definitely spent more time on my handhelds - Gameboy, GBASP (bless) then DS Lite. I didn't play my 2DS much beyond Pokmon and Animal Crossing. Overall though my Pokmon playtime alone could put my handheld above console use.",
            "I had both, but always loved the handle experience."
        ]
    }
}