{
    "Weekly Bug Report Thread": {
        "title": "Weekly Bug Report Thread",
        "score": 3,
        "url": "https://www.reddit.com/r/NoMansSkyTheGame/comments/1dqgxue/weekly_bug_report_thread/",
        "content": "This thread is followed by Hello Games. Please add your bug reports to this thread. You can also report bugs to Hello Games at the [Zendesk](https://hellogames.zendesk.com/hc/en-us/requests/new). Before reporting a bug be sure you have installed the latest patch and uninstall any game mods. Information is located on [this page](https://www.nomanssky.com/release-log/). Please include platform and version.\n\nThis weekly thread is to help keep bug reports manageable. It is a scheduled weekly thread and not related to any specific release. You do not have to repost bugs to this post if you have already reported them on a previous post.\n\nIf you're requested to send your save file to Hello Games see [this post](https://www.reddit.com/r/NoMansSkyTheGame/comments/1b9y4ui/submitting_save_file_to_hello_games_zendesk_with/)",
        "num_comments": 1,
        "comments": [
            "Game keeps hard freezing computer, having to manually power off and power back on, when going near black holes after going through 3-4 of them in a row. Lowering graphics settings, fps, vsync didn't fix."
        ]
    },
    "NMS Megathread for Q&A, Item Requests/Giveaways and Friend Requests, etc. Whatever you need, this Mega-thread is a place to ASK!": {
        "title": "NMS Megathread for Q&A, Item Requests/Giveaways and Friend Requests, etc. Whatever you need, this Mega-thread is a place to ASK!",
        "score": 8,
        "url": "https://www.reddit.com/r/NoMansSkyTheGame/comments/1dpnlfw/nms_megathread_for_qa_item_requestsgiveaways_and/",
        "content": "Hey Everyone,\n\nThis is a Megathread for all the people of the sub. If you have questions, Ask away. If you need anything just ask. This is uniform thread where you can ask for pretty much anything (from Questions to Nip Nip) that will be live 24/7 all year around and refreshed every couple of days.\n\nThis Megathread is closely monitored by me so if you have a question that no one has answered, don't worry I will personally get back to you in a reasonable time. I will always be keeping a close eye so no naughty business please.\n\nTo make things little bit easier if you could help us make distinction between type of posts that would be great, Which brings us too ....\n\n# Rules:\n\n\\- \\*Do not put bug reports in this thread.\\* There is a Bug-Thread pinned to the top of the sub that should be used for them.\n\n\\- If you are asking a questions please post your question like so : \\[Question\\] .... Your Post ....\n\n\\- If you are requesting something an item, money, etc. please post like so : \\[Request\\] .... Your post ....\n\n\\- If you are offering an item of doing a giveaways (in game items only), user: \\[Giveaway\\] .... Your post ....\n\n\\- P**lease do not post your friend code in your post**. PM/DM them to the person who is helping you. It will prevent people trolling and griefing your saves.\n\n# Helpful Links:\n\n\\- If you need a specific ship, Multitool, Freighter, Frigates or anything a specific color or kind please check out our friends at r/NMSGlyphExchange. They also have a variety of different guides from Freighters to Multitool so if you need help with acquiring something, head right on over there.\n\n\\- If you are looking for a ride to Anywhere in NMS, Please reach out to our friends at [Pangalactic Starcabs](https://www.reddit.com/r/NoMansSkyTheGame/comments/12r24zt/go_beyond/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button), Pangalactic Starcabs is a Volunteer Service, Cabbie Availability may vary!\n\n\\- If you are Looking for all 16 glyphs on one planet, You can find them in this [Guide](https://www.reddit.com/r/NMSGlyphExchange/comments/10c0gup/nmsge_presents_16_grave_locations_on_1_planet_in/)\n\nAnd as always, please be civil, be kind and be helpful.\n\nPlease Follow all the Sub and Post rules and Thank you all so much!",
        "num_comments": 12,
        "comments": [
            "[Question] Have they changed the way dreadnoughts spawn? I've been trying to follow guides that suggest if you jump out of a system that had a dreadnought battle and then jump back in, you'll get the battle again. That doesn't seem to be the case. If it's changed, does anyone know what their timing/frequency is now?",
            "\\[Request\\] I'm looking for a head-only Squid ship. As far as I know it's only possible to make one via save edit and I'm on PS5 so can't do it, but in theory I can get one traded to me. Preferably orange or green but honestly any colour would do.",
            "\\[question\\] hi guys i need to know if its possible to recover my save game i had on microsoft xbox pass on pc and use it on the steam no man's sky?",
            "[Question] Short range teleporter on freighter no power. The teleporter in the corridor connected to the bridge is powered fine. From this corridor i built stairs up 3 levels, then put a room at the end, and put a short range teleporter in it. Whether in the center or corner of that room, the teleporter is unpowered. Does power not travel through stairs? What should I do?",
            "[Question] i wanted to report a base on Xbox but the game says I need to take a screenshot of it. Ok that's cool but the button to take screenshot is the Xbox central circle button, and pressing it brings up the Xbox menu. Which means I can't take the screenshot since the button is mapped to something else. Is there a way I can change the controls for report screenshot, or another way to report bases and make them disappear?",
            "what you need is a save in a different (previous) system before warping to continuously get the spawn. All I know for getting one is having 2 hours of collective gameplay and \\~5 warps, not sure if that's out of date though.",
            "I make base and teleporter in a nearby system to the dreadnought. I make save in that base. Then warp to pirate system. Always spawns a dreadnought, assuming my 3 hours and warp jump requirements are already fulfilled. Reload that save if I need to. I got S class after 4 tries (I'm lucky haha)",
            "You have to use 2 different save editors, the one for Xbox is named NomNom and the other if I recall is named just NMSSaveEditor or something like that made by GoatFungus. I don't recall the exact way you do it but there are guides to doing it on youtube.",
            "The game has NPCs, the one on the left is a hauler class ship and the one on the right is an explorer class. You will see both of those types of ships in space stations and be able to purchase them.",
            "wow thanks cos i havent played in a while but i was pretty maxed out i hade like full tabs of the microchip set worth 15m and my ships were crazy  ok ill follow a youtube guide thanks again"
        ]
    },
    "How is it extinct": {
        "title": "How is it extinct",
        "score": 55,
        "url": "https://v.redd.it/mwxla4humh9d1",
        "content": "",
        "num_comments": 12,
        "comments": [
            "I'm literally never able to scan them",
            "I think they are only available in the expedition. On a normal save I have not been able to scan them. Yeah, it's kind of weird, you have them leaping from everywhere, but when you scan them... Extinct... Wait, what?",
            "I found some weird ball-lightning looking mfs on a cabled planet that said theyre extinct, then when i relogged the day after they just dissappeared",
            "How did you even scan that thing, i have been trying to do that forever",
            "This is a bug, but my headcanon is that the creature was thought to be extinct, only to secretly have awoken from its slumber hence why the visor gives an error.",
            "Technically, a species is extinct when it has no hope of further offspring. Maybe it's the last one.",
            "It's a ghost. That's why they're so hard to scan.",
            "Woah what!!? You're not normally able to scan those, so I could be a relic of an old NMS file from the early updates. That's crazy.",
            "It's really difficult.  I've only accomplished it once.  I've tried to do it again on so many planets.",
            "No a species is extinct when the last known example dies without leaving a genetic successor. I know it's a stupid nitpick but extinct means extinct. A species can be 'pretty much extinct' but not technically until the last known example is dead."
        ]
    },
    "Should I buy No Man’s Sky in 2024?": {
        "title": "Should I buy No Man’s Sky in 2024?",
        "score": 295,
        "url": "https://www.reddit.com/r/NoMansSkyTheGame/comments/1dqx934/should_i_buy_no_mans_sky_in_2024/",
        "content": "Hey guys, NMS is currently on sale, and I think I might buy it. Is it too late in 2024?",
        "num_comments": 223,
        "comments": [
            "No, don't buy it. It's a terrible game. The only reason this sub has 800K members is because we get free cake weekly.",
            "it's still good, yes. and on a SALE price? hell yeah.",
            "I got it like a week and a half ago and I'm like 40 hours in.  It's a great game.",
            "Terrible game. Wasted 4840 hours on it.\n\nEdit: Make that 4841.",
            "I nabbed it for like thirty bucks a week or two ago, and was well worth the spend.",
            "Its more amazing than its ever been now",
            "Yes.  In VR if you can.",
            "The game is not an MMO it is really 99% single player you play at your own pace and do your own thing. So you don't have to worry about it being \"too late\" because the game is still active, it has an active community and new content is regularly still released for it.",
            "Do it! Surprises still to this day being a player who has started from launch. To vr. To vr2. Its friggen awesome. Its like owning sharks with friggen laser beams on the head",
            "I got it during Echoes on Switch and I still am in love"
        ]
    },
    "Ranking spaceships by how realistic they are": {
        "title": "Ranking spaceships by how realistic they are",
        "score": 300,
        "url": "https://i.redd.it/skoma95wdd9d1.png",
        "content": "Share your thoughts in the replies!",
        "num_comments": 49,
        "comments": [
            "I actually find sentinel ships the most realistic starships. The way the cockpit is enclosed and armored, with a realistic screen to show the outside makes more sense than a glass cockpit in space where a tiny piece of debris could crack it and their compact bodies and shape would make it easy to fit the exterior with an array of thrusters for maneuverability. Although, this is just my opinion. A hauler type ship does make a lot more sense for long-distance space travel if its equipped with a living space inside the main body.",
            "Spaceship? They can look like ANYTING. You could make a spaceship that looked like a dog turd riding a unicorn if you wanted.\n\nIn atmosphere is different, but ANY ship in the game could qualify as a legit SPACE ship.",
            "Easy: none of them are realistic",
            "really, a spaceship is just an enclosed hull with thrusters. Can look like anything too. What gives spaceships that airplane look is the need for reentry and atmospheric flight, though some of the freighters in this game look more atmosphere worthy that that C class abomination of a shuttle that looks like a crane cab put on 2 thrusters",
            "I like that you picked the big, chonky shuttle for the representation.  My shuttle is a big ass turbine engine with a little cockpit mounted on top.\n\nI named it Molly's Revenge, and it's my mining ship.",
            "The proper way to spend a Friday night.\n\nWith todays AI, sentinel ships can slide into the realistic category Id say.",
            "mannn, I have been trying to find one of those exotics for ages now. I mean, my living ship is, as the kids say, drippy, but...I prefer the metal, you know?",
            "Pretty sure OP thinks space and atmosphere are the same.",
            "The sentinel ships are fine, especially considering theyre designed as drones rather than actual piloted craft.",
            "Also sorry for the quality..."
        ]
    }
}