{
    "Weekly low-hanging fruit thread #59": {
        "title": "Weekly low-hanging fruit thread #59",
        "score": 32,
        "url": "https://www.reddit.com/r/NonCredibleDefense/comments/1dmqr0m/weekly_lowhanging_fruit_thread_59/",
        "content": "This thread is where all the takes from idiots (looking at you Armchair Warlord) and screenshots of twitter posts/youtube thumbnails go.",
        "num_comments": 73,
        "comments": [
            "Imagine being a North Korean in Ukraine and running into a stray dog that's fatter than you are.",
            "I think I've cracked the Russan casualty code: when numbers killed exceeds 3x the number of wounded in the attacks, the killed number is the reported injury number  \n\nfor example from today: \"3 dead 100 injured\" = 100 dead after we couldn't treat anyone, 3 arrested\"",
            "Who has \"Ukrainian Bradley shoots down drone with 25mm autocannon\"  on their bingo card?",
            "Idea: If the ukraine war goes on until 2031, instead of crashing the ISS into the pacific after it is decommissioned, crash it into a vital russian target, red alert 3 style. Or use it on the kremlin idk. Bonus points if you can find and time it right to drop it on putin, assuming he's still alive by then.",
            "Unlike in Moscow the police in Dagestan actually responded and tried to stop a terror attack. That's got to be embarrassing to the people of Moscow.",
            "me explaining how I use OSINT (google translated telegram) to understand how the war is going (I plot the CPD (cope per day) metric) to my uninformed friends (people who happen to seat near me who have actual lives besides following international conflicts)\n\nbut fr the trajectory of the war is best measured by the ranting of ru milbloggers. say the line fighterbomber.",
            "Alright, so you know how much of an L a VDV L has to be to be remarkable?  \n\nWhen *Russia* takes a brigade off the line for being combat-ineffective",
            "I guess I'm gonna ask here since people who stick their weenie in drones rotors know it better than me. When we see videos of drones dropping bombs and grenades onto tanks in Ukraine, do the drone has sensors such as altimeter, speed sensors? ",
            "The guy from task and purpose said he was voted most likely to start an anime club in high school. So, one of us? Are you here, cappy? Blink twice…",
            "Newly declassified documents show the comic _Josie and the Pussycats_ was created as a covert influence op in 1963. This was on the orders of SecDef Robert McNamara, who’d commissioned a RAND Corporation study that had shown the efficiacy of catgirls in combat roles. Lyndon Johnson ultimately cancelled the project as politically untenable in the moral climate of the time, but the comic continued anyway as it’d been a minor commercial success for Archie Comics."
        ]
    },
    "Declassified documents show that as early as 1986, the top brass of the PLA Air Force believed that Mother Russia's aircraft had problems and were far behind the West": {
        "title": "Declassified documents show that as early as 1986, the top brass of the PLA Air Force believed that Mother Russia's aircraft had problems and were far behind the West",
        "score": 1105,
        "url": "https://i.redd.it/vqnczizxag9d1.png",
        "content": "",
        "num_comments": 68,
        "comments": [
            "No shit, I think the Chinese were planning to import US planes but Tiananmen Square happened and they were stuck with Russian stuff.",
            "Pretty legit as he opened a statement by shitting on Khrushchev first. I can feel his survival instinct here.",
            "Does anyone have the translated report, does he explain what those \"unique characteristics\" were?",
            "The whole history of post-ww2 USSR can be described as a collective skill issue.",
            "They gonna can his ass",
            "Ever since the Soviet Union stopped killing loads of their own people based on made up charges, their airplanes suck 🤔",
            "“It was not fair because we have too many Jews and they have none!\"",
            "The Israeli F-15 and F-16 were also a generation ahead of the Syrian Mig-21 and Mig-23. The equivalent would be the if Syria operated SU-27's and Mig-29's against Israeli F-4's and F-5/Mirage III's I guess.",
            "> The battle led the United States to impose a ceasefire on Israel and Syria.\n\n“Alright, alright, calm down, he’s had enough”",
            "Fucking WHAT happened, you seditionist liar?\n\n**-1989 social credits**"
        ]
    },
    "It’s like a national pastime at this point": {
        "title": "It’s like a national pastime at this point",
        "score": 2638,
        "url": "https://i.redd.it/2dxcx9wwje9d1.jpeg",
        "content": "",
        "num_comments": 50,
        "comments": [
            "me in a regular sub: \"oh wow that's such a critical development, wiping out the S-500s may start to break Russia's stranglehold on the airspace\"\n\nme in here: \"well they ain't fuckin called DEFENDMS\"",
            "After the spoon flies on a M67 fragmentation grenade, at around the 2.5 Mississippi mark it’ll get warm on ya. Real Hot potat, ya feel?",
            "This one made me chuckle. Nice",
            "You know the Russians weren't sure about that one when the deployment of S500 systems was advertised by the Ukrainian SBU and not by a 30-min video on Rossia1.",
            "It's like when a college team runs up the score. You want it to stop, learn to play defense.",
            "Western lies, it was glorious russian anti anti air friendly fire.",
            "It doesn't work if those Sam on the wrong side of russia because US is still that fucking idiotic",
            "I went to the Warhammer store with 100 dollars, walked out with 100 once I realized I can't afford anything, sad days.",
            "I spend like $300 aud a year on models. I spent like 500 AUD on a hiking trip this year and that was just two nights at a hotel and petrol.",
            "*Even in debt, I still serve*"
        ]
    },
    "Rest in piss worst S-300": {
        "title": "Rest in piss worst S-300",
        "score": 4057,
        "url": "https://i.redd.it/vyva27uroc9d1.jpeg",
        "content": "",
        "num_comments": 149,
        "comments": [
            "iirc they didn't destroy the whole battery, just the radar, but that is the most important part of the system.",
            "they managed to destroy a s500????",
            "11 days ago, i started a bet how long the S-500 would survive before a \"spontaneous malfunction.\" I thought it would last a month, maybe two. \n\nCongratulations to u/blindfoldedbadgers for correctly predicting 2 weeks max.",
            "As a famous poem says :\"Gotta catch em all\".",
            "How many days until they run out of Air defence ?",
            "can someone supply a brother with some satellite pictures?",
            "We smoking that S-500 pack today, boys 🚬💨💯💯💯💯💯",
            "\"The Kremlin doesn't want you to know this, but russian infrastructure is unguarded, you can bomb it. I have the only confirmed kill of an Su-57.\"",
            "Lol, if this is true that shitbucket didn't even last a week, lmao.",
            "They hit it? Holy FUCK! Yeah, I wasn't going to drink today but I'm grabbing the scotch. RIP most incredibly advanced stealth fighter killing peak of Russian superior technology, you probably died to a simplistic tactical ballistic missile that dates back to Desert Storm."
        ]
    },
    "Bolivian chinese-made vehicle breaks direction upon hitting a curb": {
        "title": "Bolivian chinese-made vehicle breaks direction upon hitting a curb",
        "score": 4581,
        "url": "https://v.redd.it/pl5dx1psec9d1",
        "content": "Truly the worst Coup",
        "num_comments": 190,
        "comments": [
            "This would probably work in r/combatfootage right?",
            "Steering rack made from the finest chinesium.",
            "Terrific blend of chinese manufacturing and third world maintenance.",
            "You get what you pay for",
            "i hate the 2020s, now everyone has high cut helmets and MultiCam. It truly ruined the operator drip for me.",
            "Somehow I believe that Ugandan armoured vehicles made by Kantanka are better quality than Chinese export vehicles",
            "Taiwan suddenly announcing a huge road work project. Weaponized road curbs",
            "I once had a Chinese made go kart that did the exact same thing regularly. They are using vehicles that are on par with go karts. Ridiculous.",
            "Ah yes, the famous siege of Tyre",
            "China, a true superpower!! now interfering with a coup 9 thousand milrs away!! They even stopped it!!!!"
        ]
    }
}