{
    "Welcome to r/NonPoliticalTwitter where you can browse Reddit without any concerns about politics showing up in your face.": {
        "title": "Welcome to r/NonPoliticalTwitter where you can browse Reddit without any concerns about politics showing up in your face.",
        "score": 827,
        "url": "https://i.redd.it/qfbfw4p7d4g91.png",
        "content": "",
        "num_comments": 24,
        "comments": [
            "White people twitter's subreddit is just politics, and it has gotten extremely unfunny and depressing. I am so thankful this subreddit exists because I just want to see some glorious fuckery on Twitter",
            "Any other major sub involving either Twitter or Facebook screenshots is just super political or stories about how shitty people are\n\nNo cat puns anywhere",
            "Please keep this a political free subreddit and respecting everyone's opinions.\n\nReport all rule breaking posts and i'll remove them as soon as possible.\n\n&#x200B;\n\nHope everyone has a great day.",
            "Holy shit, this is exactly what I was looking for.\n\nAll the other r/(x)PeopleTwitter subs just suck.",
            "Hey this is awesome.  Yeah WPT began as jokes and fun, but eventually turned into just a political activism sub.  Thanks for making this!",
            "Is this a challenge?",
            "why did you just randomly tweet “Escape the stress of the real world” lol",
            "*Image Transcription: Twitter Post*\n\n---\n\n**NPT**, @NonPoliticalTwitter\n\nEscape the stress of the real world\n\n---\n\n^^I'm&#32;a&#32;human&#32;volunteer&#32;content&#32;transcriber&#32;and&#32;you&#32;could&#32;be&#32;too!&#32;[If&#32;you'd&#32;like&#32;more&#32;information&#32;on&#32;what&#32;we&#32;do&#32;and&#32;why&#32;we&#32;do&#32;it,&#32;click&#32;here!](https://www.reddit.com/r/TranscribersOfReddit/wiki/index)",
            "Crazy stress",
            "Lol"
        ]
    },
    "Addressing the community regarding the \"No Politics\" rules": {
        "title": "Addressing the community regarding the \"No Politics\" rules",
        "score": 576,
        "url": "https://www.reddit.com/r/NonPoliticalTwitter/comments/1asphum/addressing_the_community_regarding_the_no/",
        "content": "Dear r/NonPoliticalTwitter,\n\nFor those of you who’ve never interacted with me, I am u/Aspect-Infinity. I’ve been a member of the r/NonPoliticalTwitter moderator team for almost a year now. The opportunity to address you all for the first time on behalf of our team is a humbling honor. \n\nI want to talk to you about some very valid questions that have arisen throughout my tenure here regarding our rules and how we enforce them. I’ve taken note of as many of these questions and concerns as possible so could escalate them to the rest of the team for discussion. This announcement is the result of that discussion and I’m glad to issue some much-needed clarification on what we consider political content, what we consider inciting political discussion, and how we’ve taken steps to address it. \n\nThis is gonna be a long thread so I encourage you to grab a snack while I go over this rule-by-rule. Let’s begin!\n\n**“ 1. No Politics or Political Discussions/Commentary. - That's the point of the subreddit”**\n\nThe most important and sacred rule we hold dear as a community. It’s a reflection of why this subreddit was created in the first place, to create a space similar to Twitter where public discussion can flourish, without the toxicity of politics. One of the questions that has arisen is “What do you consider political content/commentary?”, and so, we’re providing an answer to that.\n\n**We define political content as anything that has the potential to ignite political discussion, commentary, or discourse**. This potential is taken into consideration when we believe the content in question can be intentionally viewed through a political lens. \n\nLet's break it down further. We consider political commentary to refer to comments that try to insert a political angle where none existed before, or that shift the focus towards a political interpretation. We consider posts, comments, and even usernames as \"content\" within our subreddit. \n\n**Directly/Indirectly referencing political figures, policies, or movements:** \n\n* A tweet comparing two political candidates with derogatory and inflammatory labels\n* A post expressing strong opinions on a specific government policy and calling for action.\n* A comment on a non-political post that attempts to connect it to a political event or movement, regardless of relevance. \n* Posting a tweet sharing news articles about political events with clear commentary promoting a specific viewpoint.\n\n**Posts or comments encouraging debate or argument on political topics:** \n\n* A post asking users to choose sides on a contentious political issue.\n* A comment starting a debate about the merits of a political ideology.\n* Sharing controversial political cartoons or infographics designed to elicit strong reactions. \n* Encouraging users to vote for a specific candidate or party.\n\nStill confused? That’s alright we have some examples! \n\n**Example A: (Non-Political Content)**\n\nA post containing a tweet memeing a celebrity known for their political views doing something funny. The humor focuses on the action, not their political stance. \n\n**Example B: (Political Content)**\n\nA Redditor makes a post with a tweet that features a masculine, caucasian man with a MAGA hat and a shotgun with the caption “This guy isn’t playing with those liberals”. This would be taken down because its primary focus is political (particularly the Second Amendment). \n\n\\--- \n\nIt’s important to remember that we don’t consider tweets focusing on sexuality, gender/gender identity/gender presentation, religion, or nationality inherently political. Although, should a subtext be present that is political we will take action. \n\nWe hope this clears up our stance and intention behind setting these rules in place, we encourage anyone with any questions to comment below, and we will respond. \n\nHappy New Year to you all!!\n\nYours,\n\nThe r/NonPoliticalTwitter Moderator Team",
        "num_comments": 87,
        "comments": [
            "Me again - Just wanted to remind everyone that I and possibly other moderators will be responding to questions or concerns here.  We ask that you remain respectful towards us and your fellow Redditors.",
            "One of my favorite subs bc yall don’t allow political shenanigans in it. And yall do great!",
            "I gotta tell you, this is definitely one of my favorite subs. Absolutely love the job you guys are doing. Thank you. \n\nThis is where I go when I need a laugh. I am constantly sharing content with family, friends and others. I always seem to find something that picks me up. You have made some dark times better.",
            "This. I mod a small sub, r/Eevee to be exact. Just recently, mods decided to, and I quote from another moderator and a user on the sub, enforce “martial law” >!not political lmao!< in order to get posts back in check. We were too nice about the NSFW rule and it caused a lot of trouble, though the full story doesn’t matter here (if you care enough feel free to ask I guess lol, no offense otherwise).\n\nIt’s what I imagine being a middle school teacher is like, people trying to cause trouble just for the sake of it. Sometimes, strict rules are just the best because if you give an inch, they won’t take a mile they’ll try to take the whole sub, and it’ll ruin the fun for everyone. Hell, it’ll ruin the sub for you because moderating posts from rogue users sucks. Ever since we banned a single person, everything has been easy, for mods and for users. Good job at the fight for keeping this an innocent safe space, even if some think it’s strict! It’s nice to have a place to hide from the world, yaknow? \n\n~ Eevee Mods",
            "I had one comment removed from here for being political.  I think it was super edge-case-y, but I do appreciate the hard-line approach because otherwise it's way too easy for that stuff to bleed through otherwise",
            "Ok cool\n\n![gif](giphy|MDJ9IbxxvDUQM)",
            "Just want to say that I really appreciate what the mods have done with this subreddit. I've seen so many subreddits ruined by political \"discussion.\" It just destroys the vibe, even when it's a political stance I agree with. It's nice to have a subreddit that's just here to have fun.",
            "> we don’t consider tweets focusing on sexuality, gender/gender identity/gender presentation, religion, or nationality inherently political\n\n\nStrong disagree, if you're still taking input. Tweets focusing on those topics often involve people's socio-political views.",
            "I honestly have a ton of respect for the mod team on this sub.\n\nHonestly, it astounds me how many miserable redditors come to this sub and try their hardest to weasel around the rules and make the discussion political.\n\nI'm tired of mods who claim to be non-political and then also defend politically charged posts because \"this clearly isn't/shouldn't be political (and also I agree with it) so it stays up\"",
            "As you may guess from my post history, I actively like politics, but it's so refreshing to have a subreddit *with* genuinely funny stories, observations, and gags, and *without* uneccessary political commentary alongside it."
        ]
    },
    "Brooklyn seems like an insane place to be": {
        "title": "Brooklyn seems like an insane place to be",
        "score": 3544,
        "url": "https://i.redd.it/c9uryghs028d1.jpeg",
        "content": "",
        "num_comments": 64,
        "comments": [
            "Guy driving that DOT truck might want to go into hiding himself",
            "86, just a fuckin’ kid\n\nit’s sad when they go young like that",
            "Did NYC DOT enact street justice or was it just a clean sweep?",
            "This guy had a huuuuuuuuge ass",
            "Lmao this whole comment section reads like it's an AI prompt to generate jokes written by mobsters",
            "Tony cakes gone too soon. I'll miss his glorious cakes as he walked away.",
            "This is some Quentin Tarantino shit",
            "decapitated?????\n\nedit: Holy shit there's a video on Twitter and yea it's rough. That poor fucking driver",
            "We had a funeral for a bird.",
            "Somewhere Jerry Orbach is looking down and smiling at this"
        ]
    },
    "Baked": {
        "title": "Baked",
        "score": 4593,
        "url": "https://i.redd.it/bukm3dyqky7d1.jpeg",
        "content": "",
        "num_comments": 37,
        "comments": [
            "Having flashbacks to the time I was high as fuck and looking for my phone in the dark....using my phone's flashlight. The worst part is it really took a good 5 minutes of tossing things around for me to realize I was holding the shit the whole time.",
            "Makin shitty cookies cups. I too have done this while high. Admittedly, with greater success.",
            "I mean, they still look edible….",
            "Flip them over and put a scoop of ice cream in them",
            "My main issue with this I dont trust the cleanliness of the bottom of my baking pans.",
            "Literally Baked",
            "Ice cream bowls",
            "I miss the time when I could get so high that I would fill my Britta with water from my other Britta",
            "Puzzle cookie :)",
            "Now use them as ice cream bowls"
        ]
    },
    "A message from today’s sponsor": {
        "title": "A message from today’s sponsor",
        "score": 2260,
        "url": "https://i.redd.it/g4umjbz31z7d1.jpeg",
        "content": "",
        "num_comments": 10,
        "comments": [
            "“And I’m sure you’re wondering, Sheev, how did you successfully hide not being dead for so long? Well, let me tell you: NordVPN.”",
            "Palpatine's master was actually Raid Shadow Legends all along",
            "Anakin: but how do I get the title of Lord?\n\nLet me tell you about our second sponsor",
            "Only a sith deals in ads",
            "And the teacher is named Ziro, the Basic-speaking Hutt.",
            "1200 upvotes, 7 comments.  Either this is guerilla marketing or someone isn't being paid enough for the advert.",
            "Thought the Nord VPN plug in Acolyte was, to be completely frank, really weird and off-putting. It's really a shame to see the franchise headed this way.",
            "[If Movies Ended Like YouTube Videos](https://youtu.be/HRf5gMTDdcU?si=ia8tLyFlIerK7SL_)",
            "Do It!!!",
            "\"Ruling a galactic empire can be stressful. That's why I use today's sponsor: Better Help. Better Help can put you in contact with licensed xenotherapists who specialize in over 260 species and counting.\""
        ]
    }
}