{
    "Gratulerer med pride alle sammen (spesielt de i Oslo som går i tog i dag)❤️🏳️‍🌈": {
        "title": "Gratulerer med pride alle sammen (spesielt de i Oslo som går i tog i dag)❤️🏳️‍🌈",
        "score": 65,
        "url": "https://i.redd.it/0e61fwhkrh9d1.jpeg",
        "content": "",
        "num_comments": 67,
        "comments": [
            "Vel, i Bod ser det ut til at det blir rets greste og mest regnfulle dag s fr hpe de har nok av regnbueregnty.",
            "Happy Pride og alt det der! \n\nHper alle koser seg like mye som oss. <3 <3 <3",
            "hva er det med alle hat i kommentarene? voks opp, hvis ikke det er noe for deg, ignorer det.",
            "Vakker kunst, takk for at du deler! Happy Pride",
            "Tillykke med pride  fantastisk  se gamle som unge storkose seg og danse i gatene!\n\nGlad dere gretne surpomper holder dere hjemme.",
            "Er homo og demi/graysexual men har ingen interesse av  vera med p sjlve paraden s det betyr ingenting for meg personleg. Men fint om det gjer det for nokon og det er nok andre meir utsatte enn meg som treng synlegjering.",
            "Hva str de brune og svarte stripene for?",
            "jeg syns det er litt mye",
            "Er det noe togtabell for juni mned?",
            "Paraden i Bod var 15.juni."
        ]
    },
    "Hvor langt skal begrepet \"redning\" tøyes? ": {
        "title": "Hvor langt skal begrepet \"redning\" tøyes? ",
        "score": 23,
        "url": "https://www.reddit.com/r/norge/comments/1dr8o0d/hvor_langt_skal_begrepet_redning_tøyes/",
        "content": "Personlig har jeg ingen interesse av å gå i 12 timer for å se på en bestemt stein, men det må folk gjerne gjøre hvis de vil. Men da burde folk også ta litt ansvar for seg selv. \n\n\"Samtidig framstår flere som godt informerte om at Norge har et bra redningsapparat som berger folk, og med en klar forventning om å bli berget, sier han\".\n\nJadajada, jeg vet at særlig utlendinger fra urbane strøk kan være ukjent med endringer i vær og farer på fjellet. Men hvis det er sånn at de \"forventer\" å bli hentet av et helikopter så må noen gjøre dem oppmerksom på at det ikke er sånn redningssystemet skal fungere. \n\nHar selv sett noen hårreisende tilfeller her og der i norsk natur, folk som ikke er kledd eller forberedt på det de legger ut på, denne \"kjappe\" turen bort i hutte heita for å ta et bilde av et bestemt sted fra en bestemt vinkel. Mokasiner, jeans, hvit skjorte, store objektiver, crocs, lite til ingen mat, drikke eller ekstra på ryggen. \n\nTror neppe man når frem med gode råd og skilt på stien. Men hva om det spredde seg i sosiale medier at \"hjelpen\" du får er en friskus med litt vann og næring i sekken som gjør det veldig klart at alle skal gå ut samme vei som de kom, og at bistanden de får er livsopprettholdelse underveis? Eller at noen kaster ned en \"care package\" med overlevelsesteppe, gnagsår plaster, energi bars og elektrolytter mens de flyr over på vei til et reelt oppdrag? \n\nVar engang på et kurs i fjellmedisin hvor mottoet var \"ikke gå lengre inn enn at du selv kan komme deg ut\" Poenget er å ikke sette andre i potensiell nød fordi du er en dust. Ulykker kan selvfølgelig skje, men redningshelikoptere er ikke Uber. \n\n[https://www.dagbladet.no/nyheter/slik-har-de-snudd-turist-katastrofen/81606249](https://www.dagbladet.no/nyheter/slik-har-de-snudd-turist-katastrofen/81606249)",
        "num_comments": 26,
        "comments": [
            "Er det noen personlig kostnad involvert i  bli hentet av helikopter?",
            "Nr eg skal reise til f.eks. eit nytt land s gjr eg research fr eg reiser til det faktiske landet. Det er latterleg  gi inn blind i noko du ikkje kjenner til.",
            "Man m gjerne pne for at utlendinger betaler for redning, s fr man ta det over reiseforsikringen. Og s fr forsikringsselskapet eventuelt avkorte om man har lagt ut i stormvr med jeans og pensko.",
            "Jeg tenker antall ddsfall blant turister burde vre avskrekkende nok. Et provisorisk Googlesk viser at i overkant av 100 ikke-bosatte (turister?) dr i fjellene hvert r",
            "Mtte p en russer i pub til pub antrekk p vei opp til trolltunga. Han bare smilte og ristet p hodet og fortsatte oppover nr turguiden ba han snu. Til slutt mtte han p en annen gruppe med en annen turguide og hun klarte  f han til  snu, s han kom smilende gende nedover igjen etter en stund i finskjorte, dongeribukse og seilersko.",
            "Men nr man pner for dette p en front av helse sektoren kan denne tankegangen fort utviddes. De som er fete betale mer egenandel for hjerte og karsykdommer, de som ryker for kreft osv. Desvrre mister det hele litt forsikrings aspektet p folkebasis om vi skal risikovurdere hver enkelt",
            "Da blir vel vinklingen bare at hyrisikosportene kun er for rikfolket",
            "Kommer litt an p. Om du er skadet er det ingen kostnad om du er sliten eller har gtt deg vill kan det komme en regning.",
            "Tobakk er jo veldig hgt beskatta, blant anna fordi brukarane skal betale for seg",
            "Tipper det er bra mye billigere for samfunnet  hente en og annen med helikopter enn utgiftene inaktive og overvektige mennesker pfrer helsevesenet"
        ]
    },
    "Norse er et turbasert vikingspill fra norske utviklere": {
        "title": "Norse er et turbasert vikingspill fra norske utviklere",
        "score": 26,
        "url": "https://www.gamer.no/artikler/norse-er-et-turbasert-vikingspill-fra-norske-utviklere/517589",
        "content": "",
        "num_comments": 27,
        "comments": [
            "Tok et yeblikk fr jeg inns at turbasert ikke betyr at spillet er basert p  g p tur",
            "Spennende, kommer til  flge med p dette.\n\nArtikkelen som du linker til virker direkte oversatt fra engelsk. \"Gjenoppbygge sin landsby\"",
            "Hper det er like bra som det beste vikingbaserte strategispillet noen sinne: Hammer of the Gods.",
            "Spennende! Alltid gy  sttte norske utviklere, ser bra ut ogs. Selvom det bare er alpha.",
            "Visste ikke at turn-based blir turbasert?\n\nBlir vel heller runde-basert som er riktig.",
            "Virker mer troverdig i stilen p vikingene enn Assassins Creed Valhalla og tv-serien Vikings  begge de to er preget av den typiske Hollywood/Harley Davidson biker-viking estetikken.",
            "jeg leste tur som \"fjelltur\" lol",
            "Ser ut som det kan ha potensial, blir spennende  se, jeg er absolutt interessert, er generelt en stor fan av sjangertypen (turbasert). Tenker likevel det er greit  legge til at det at utviklerne er norske har lite til ingenting  gjre med kvaliteten p spillet.",
            "Hadde vrt gy med en tur i skogen-simulator",
            "Fr se om man kan g p Tor's Tur i dette spillet, da."
        ]
    },
    "Hvem inviteres til utdrikkningslag": {
        "title": "Hvem inviteres til utdrikkningslag",
        "score": 22,
        "url": "https://www.reddit.com/r/norge/comments/1dr5yke/hvem_inviteres_til_utdrikkningslag/",
        "content": "Skal være forlover og bryllupet nærmer seg. Bryllupet er arrangert med kun 3 månders varsel, og i tillegg kommer han fra et annet land, så usikker om han forventer all verdens utdrikningslag. Så jeg tenker å gå for fullstendig hemmelighet.\n\nJeg har spurt bruden om gjesteliste, men den lar vente på seg, og jeg skulle gjerne begynt å planlegge utdrikningslaget. Kan jeg bare anta hvem som er invitert? Jeg har jo heller ikke helt oversikt over hvem han fortsatt har kontaktet med og sånn. Men det gjør kanskje ikke noe om folk fra gamledager blir med? Men føler det kan bli litt kleint om de ikke er invitert i bryllupet.",
        "num_comments": 27,
        "comments": [
            "100% snakk med brudgommen om gjesteliste! Han vet vel sikkert at forloveren blir  arrangere et utdrikningslag, s noen hemmelighet er det ikke. Noen vil ha kanskje med sine brdre, mens andre absolutt ikke vil ha de med. Samme med svigerbror. Kanskje han har en god venn p jobb han vil ha med, eller en kompis som han ikke har s mye kontakt med. \n\nEneste rette blir  snakke med brudgommen.",
            "det kan vre lurt  sprre brudgommen dette sprsmlet. jeg har vrt i utdrikningslag uten  bli invitert til bryllup - helt ok, spr du meg.",
            "Bare spr brudgommen om gjesteliste. Har vrt forlover to ganger, og det er brudgommen som bestemmer hvem som skal bes - s er det opp til deg  st for innholdet av laget :)",
            "Arrangerte utdrikningslag relativt nylig selv, spr brudgommen og f en liste. S er det brudgommen som bestemmer om han vil ha med folk invitert i bryllupet eller andre folk ogs. Det er stress nok  vre forlover, akkurat gjestelisten kan du dumpe over p brudgommen.",
            "Inviter vennene til brudgommen, gjestelista til bryllupet ser ofte litt lik ut men trenger ikkje henge sammen.\n\nKan gjerne invitere kommende svogre og. Spr brudgommen hvem han vil ha med.",
            "Det kan vre hemmelig nr og hvor og hva, men snakk med han om hvem uansett - Skal vre hans feiring s teit at det mangler folk eller kommer folk som ikke burde vre der",
            "Som regel bare seks til tte av de nrmeste vennene. Var det min forlover gjorde",
            "Opprett arrangement p Facebook der brudgommen kan invitera dei som han vil ha med. Nr alle invitasjonar har gtt ut s sparker du ut brudgommen. Funker som faen.",
            "Inviter folk som er invitert til bryllupet, i min mening. Kjipt  f smake p forretten men ikke sitte til hovedretten. Det er en grunn til at de er invitert. Husk ogs de som eventuelt er invitert men ikke kan delta p selve dagen.\n\nVar engang i et lag hvor noen som brudgommen absolutt ikke ville mte dukket opp, fordi forlover forholdt seg til \"gode gamle dager\" nr han inviterte folk. Blei veldig kleint, dela egentlig resten av kvelden.",
            "Mannen min hadde med 1 som ikke var invitert i bryllupet, jeg syns det var litt rart, men ingen av de tenkte visst noe over det, s er tydeligvis ikke noe big deal"
        ]
    },
    "Oslo: Is it even a city?": {
        "title": "Oslo: Is it even a city?",
        "score": 19,
        "url": "https://youtu.be/8vhD59ac7nw",
        "content": "Ny ad fra Visit Oslo",
        "num_comments": 0,
        "comments": []
    }
}