{
    "My daughter has been doomscrolling for fourteen hours.": {
        "title": "My daughter has been doomscrolling for fourteen hours.",
        "score": 881,
        "url": "https://www.reddit.com/r/nosleep/comments/1dqk3px/my_daughter_has_been_doomscrolling_for_fourteen/",
        "content": "I had heard a knock on the door.\n\nBut when I opened it…\n\n…No one was there.\n\nI looked around...\n\n...Nothing.\n\nThen I looked down...\n\n...And saw it.\n\nLying there on the doorstep, was an old cell phone with a cracked screen.\n\nI picked it up and clicked the home button.\n\nIt opened without a passcode, revealing a home screen with only one app.\n\n\"Rebecca?\" I called out to my eighteen year old daughter, as I stepped back inside and closed the door behind me. \"You know anything about the cell phone I just found on the doorstep?\"\n\n\"On the doorstep?\" She called back from the living room, likely scrolling away on her own phone.\n\n\"Yeah, with a big crack in it?\"\n\n\"Nope.\"\n\n\"I guess I'll just throw it out then.\"\n\n\"Wait! I wanna see!\" She cried out, her curiosity peaked, as she made her way over to the kitchen.\n\nI held it up for her to see.\n\n\"Ew. Looks old. Like from when you and mom were growing up.\"\n\n\"When your mom and I were growing up, there were no cell phones, Becca.\"\n\n\"Sounds boring.\"\n\n\"Yeah, it was. Perfectly boring. In the best way possible. Now look at what's become of the world.\"\n\n\"Yeah yeah, let me see it.\" She said, snatching the old cracked cell phone out my hand. \"What's the passcode?\"\n\n\"There isn't one.\"\n\nShe opened it.\n\n\"Just one app? This phone is so mid.\"\n\n\"Mid?\" I asked, unfamiliar with her Gen-Z slang.\n\n\"It means like mediocre, dad. Where'd you find this thing, anyway?\"\n\n\"I told you, on the doorstep. Someone knocked and ran away.\"\n\n\"So it's some sort of prank?\"\n\n\"If it is, it's a pretty mid prank.\" I replied, giving her the same smug look I always did when I landed a dad joke.\n\n\"Ew, your jokes are not funny, Dad. Anyways, I'm gonna see what's in the app.\" Rebecca said, as she scurried off back to the living room, and proceeded to scroll away on the cracked old phone.\n\n\"Cool, let me know what you find, Becca.\" I said casually, as I sat back down at the dinner table and continued reading my newspaper.\n\nAn hour or so later, my wife Erica returned home from work, and we had dinner.\n\n\"Rebecca, it's dinner time!\" Erica called out from the kitchen.\n\nBut my daughter didn't reply.\n\n\"Becca?\" I added.\n\nBut again, Rebecca ignored us.\n\nMy wife and I both looked at each other and rolled our eyes.\n\n\"Your loss! Food'll be cold again.\" Erica said, referring to the countless other times our social media-obsessed teen had forgone dinner so long that the meal had become cold.\n\n\"Kids.\" I muttered under my breath. \"So how was work, honey?\"\n\n—\n\nA few hours later, my wife and I decided to go upstairs for the night and, seeing that Rebecca was still scrolling away on the couch, reminded her that her dinner was on the table.\n\nOnce again, our daughter just ignored us, as she continued to scroll away on her phone. Something that, after raising an eighteen year old daughter, I was very used to.\n\nBut this time, something was different. This time, she was scrolling on a different phone. The old cracked phone I had found on the doorstep, to be precise.\n\n*She's still using that old thing? Wonder what app was on there? Must be some game or social media thing.* I thought to myself.\n\n\"Just remember to turn the lights out before you go to bed, Becca.\" My wife called down, before we retired to our bedroom, to no reply.\n\n—\n\nBut the next morning, not only did we find the lights on, but we also found Rebecca still sitting there. Sure enough, scrolling away on the old cracked phone.\n\n\"Rebecca!\" My wife called out. \"Did you even sleep last night?\"\n\n\"Yeah, Becca, you really shouldn't be pulling all nighters like that.\" I added, as I went to the kitchen to put on a pot of coffee.\n\nBut before I could make it that far, something caught my eye on the kitchen table.\n\nTo my disbelief, there was Rebecca's dinner. Still sitting there. Completely untouched.\n\nThat's when I knew...\n\n...That something was very wrong.\n\n—\n\nBy the time my wife and I were able to pry the old cracked cell phone out of our daughter's hands, Rebecca had gone into a sudden fit of rage.\n\n\"Give it back!\" She screamed, her eyes cold and lifeless.\n\nI tossed the phone to Erica behind me, while I stood between her and our daughter.\n\n\"I said, give it back!\" Rebecca screamed again, in a threatening fashion.\n\n\"Becca, what's gotten into you? It's just an old phone. And a cracked one at that-\" I began.\n\nBut before I could continue, my innocent daughter, who had never laid a finger on a soul her entire life, suddenly lunged at me, swung her arm, and ran her nails across my face, tearing the flesh from my skin and causing blood to pour down my neck.\n\n\"Rebecca!\" I yelled, raising my voice.\n\nBut it was too late. She had already hopped over me and chased my wife into the kitchen.\n\n—\n\nWhen I finally caught up to her at the entrance to the kitchen, I saw my daughter standing there with a steak knife, on one side of the kitchen table, while my wife stood on the other, shaking in fear, as she held the old cracked phone in her hand.\n\n\"What was on that app?\" I asked hypothetically out loud, realizing that whatever my daughter had discovered on the phone, must have been the cause of her fourteen hour doomscroll and subsequent fit of rage.\n\nBut Erica must have taken me literally, immediately opening the phone and going to the app.\n\nI saw a perplexed look wash over my wife's face, as she took her finger, placed it on the phone's cracked surface, and started to scroll.\n\n\"Nooo! Erica, stop!\" I cried out, as I ran over to her, and ripped the phone from her hand.\n\nBut before I could even process what had happened, I heard the steak knife that my daughter was holding fall to the kitchen floor, before she too collapsed to the ground.\n\n\"Becca?\" I asked, confused by her sudden change of disposition, but at the same time, relieved that her fit of rage had ceased.\n\nThat's when I heard a growl behind me, as my daughter's rage had somehow shifted to my wife, and Erica picked up the knife from the floor.\n\n\"Give. It. Back!\" My wife screamed, her eyes now cold and lifeless.\n\nI looked down at my daughter, who looked as if she had just awoken from a trance.\n\nThat's when I realized that whatever curse had been bestowed upon the old cracked phone's app, seemed to only affect the last person who used it.\n\nI took my dazed daughter by the hand, and led her out of the kitchen, out of the house, and to the driveway, as my wife followed, still wielding the knife.\n\n\"Get in!\" I insisted, as I opened my car door, and Rebecca hopped inside, before I used my key fob to lock her inside.\n\n\"Give me the phone!\" My wife cried from behind me, as she swung the knife at me.\n\nI stepped aside, and watched its blade pierce the hood of my car.\n\nI thought to call out my wife's name, in an attempt to snap her out of it, but immediately realizing that there was only one way to snap her out of her trance.\n\nAs she struggled to pull the blade out of the car, I seized the opportunity to run back in the house and turn on the sink in the first floor bathroom.\n\nEventually, my wife came back inside looking for me and, sure enough, headed for the source of the running water.\n\nAnd when she stepped inside, I hopped out from behind the kitchen island, slamming the door behind her, before dragging a nearby bookshelf against the door and reinforcing it with a few other heavy objects.\n\n\"Give me the phone!\" I heard her cry out from inside the bathroom, as I looked at the old cracked cell phone that I was still gripping in my hand, and knew what I had to do.\n\n—\n\nThirty minutes later, the deed was done.\n\nThe old cracked cell phone, left on a random neighbor's doorstep in the next town over, where I hoped no one would recognize me.\n\nWhen I got back to the car, my daughter was just sitting there in the passenger seat, still traumatized and speechless from what she had just gone through.\n\nWe drove home in silence.\n\nAnd when we finally got back, we waited by the barricaded bathroom door, as my wife continued to scream.\n\nAnd waited.\n\nAnd waited.\n\nUntil eventually...\n\n...She stopped.\n\nI slid the heavy objects and bookshelf aside and opened the bathroom door, to find Erica just standing there, as if waking from a bad dream, the same exhausted expression on her face that I'd seen previously on my daughter.\n\nIt had worked. My wife was no longer possessed by the vile device.\n\nErica walked over and hugged me.\n\nI looked over at my daughter.\n\nShe smiled.\n\nI smiled back.\n\nIn that moment, two things became clear.\n\nOne, someone else had been possessed by the phone prior to leaving it on my doorstep.\n\nTwo, someone new was possessed by it now.\n\nBut all that mattered to me in that moment…\n\n…Was that my family was okay.\n\nI wish I could say that after the dust settled, my daughter swore off cell phones, social media, and apps altogether.\n\nBut the truth is, it only took a day before she was back to doomscrolling on her own phone.\n\nNow every time she does, and her dinner gets cold, I can't help but fear that she's been possessed again, but then I realize...\n\n...She's just a teenager.",
        "num_comments": 47,
        "comments": [
            "The concept of having to give something awful to an innocent person to save the people you love is really cruel but interesting game from who/whatever's possessing that device. (Like a spooky pass the parcel)",
            "Do they remember anything that was on that thing? What’d happen if the phone were to get destroyed? Is it even possible to destroy it",
            "This is how most people act with their phones even without the curse",
            "I loved this . I wish there was more in the app though. Yes, i realize you get possessed by seeing it, but something like the person who was possessed by it describes what they saw. Something like that. ",
            "Hop on the sex offender registery and find somebody with no family. Easiest decision of my life",
            "I have someone I would love to give that phone to.",
            "That's terrible. What an horrible choice to have to make. ",
            "So if I find a random ass phone on my steps with a cracked screen, kick it into the bush. Got it.",
            "If I were you I'd leave it in a prison for that one guy who always gets solitary confinement. He may need some medical attention when he stops eating but I feel it's better than some other guy and his family.",
            "It would have been better off if you had thrown the cursed cellphone into a trash bin or something similar "
        ]
    },
    "I’m so proud of my son for no longer being afraid of the dark.": {
        "title": "I’m so proud of my son for no longer being afraid of the dark.",
        "score": 157,
        "url": "https://www.reddit.com/r/nosleep/comments/1dqtdkt/im_so_proud_of_my_son_for_no_longer_being_afraid/",
        "content": "He was always so petrified. He used to climb into bed with my wife and me every night. “Mummy, Daddy, I’m afraid of the dark.” This had become a routine. We tried everything—lying in bed with him until he fell asleep, night lights, teddy bears—nothing worked. I tried to convince my wife on many occasions to just let him sleep with us at night, but she refused and said it was a phase; we had to be consistent.\n\nThis habit broke when we decided to move from our two-bedroom flat into our first real home. We had been saving for this home for almost ten years, and it was everything we had dreamed of: real wood flooring, rooms so spacious that if you yelled, it would echo, and a huge back garden. The first night we went to bed, I was sure our son would climb into bed with us. I was stunned when we didn’t wake up until 9am, and he was still asleep.\n\nI sat at the table, sipping my morning coffee and reading the paper when he came toddling downstairs.\n“Good morning, buddy! I see you slept all night in your big boy bed by yourself!” I couldn’t contain my excitement. It may sound ridiculous, but I was worried this would go on forever.\n\nHe let out a little chuckle, “Don’t be silly, Daddy, I wasn’t alone.”\n\nI was instantly confused. Did my wife sneak into his room and sleep with him? Did he get into our bed and then go back in the morning? “What do you mean, son? I didn’t hear you once.”\n\n“My friend was with me,” he said with a huge grin on his face. “Daddy, can I watch Bluey while eating breakfast this morning?” he innocently asked, giving puppy dog eyes.\n\n“No, son, we’ve just got that sofa, and I don’t want it covered in eggs.” Suddenly, what he had said a moment before dawned on me. “Son, what friend?” I asked, puzzled.\n\n“My friend!” he smiled. “Please, Dad! I won’t get eggs anywhere, I promise!” he begged.\n\n“Not today, little one, your mum would go crazy at me. Maybe tomorrow.”\n\n“Awhhh,” he frowned, slumping down at the table. He began munching his breakfast, eating as fast as he could so he wouldn’t miss the new episode.\n\nLater that day, I spoke to my wife and told her about what our child had said earlier. She told me not to overthink it; if anything, it’s a good thing that he has an imaginary friend, especially if it helps him go to sleep. I agreed and continued with his bedtime routine.\n\nI couldn’t believe it when I woke up, and he wasn’t sandwiched between us for the second night in a row. Again, I went downstairs to have my coffee and read my newspaper. Suddenly, he came flying down the stairs. “Daddy, can we go to the park today?” he said, as if he had just come up with the greatest idea ever.\n\n“Of course we can,” I laughed slightly, “especially since you slept all alone again.”\n\nHe looked at me, confused. “Daddy, I’ve told you, I’m not alone. My friend is with me.”\n\nI decided to entertain him. “Oh yeah? What does this friend look like?”\n\nHis face brightened up again. “I can’t see much of his face because he only comes out of the wardrobe when it’s dark. He has a big smile and long fingernails. He taps them on the edge of the bed to help me sleep.”\n\nNeedless to say, I was slightly disturbed. That sounded terrifying to me, but kids are imaginative and say all kinds of crazy things. “Wow, he sounds cool. What’s his name?”\n\n“He told me not to tell you,” he sang in a cheeky way, as if he thought it was funny that I wasn’t allowed to be in on the secret.\n\n“Come on, tell me, and I’ll let you watch Bluey while you eat your breakfast today,” I smirked, thinking I had won the war.\n\n“Really?!” he exclaimed. Then suddenly, he paused. His face went blank. He turned around and looked towards the ajar coat room that was in the hallway separating the kitchen and living room. He turned back around, lowered his head, “I can’t tell you, Daddy,” he said, sounding rather disappointed.\n\nHe hopped up to the kitchen table, looking defeated, and started eating his toast. I won’t lie—I got kind of freaked out. I peered into the hallway, into the cloakroom; nothing seemed amiss. It was dark, as it needed a lightbulb, but nothing out of the ordinary. My wife’s words ran through my head: this was a good thing.\n\nThat night, he was rather tuckered out from his day at the park. My wife and I were excited to have a full night together and were going to make the most of it, eating junk food in bed while watching a movie—something we hadn’t been able to do since our son was born. Suddenly, all the fizzy pop hit me, and I got up to go to the bathroom. I hopped out of bed and made my way to the bathroom. I thought maybe I’d check on our little man and his “friend” on the way. I placed my hand on the door knob, and my blood ran cold. Before I got a chance to open the door, I heard tap, tap, tap. It sounded just like nails on wood.",
        "num_comments": 7,
        "comments": [
            "Oh that sounds a little concerning! Have you considered putting a camera in his room to see what's going on at night? I hope your kid is doing alright, he has a good taste in TV shows, bluey for the win!",
            "fuck the camera, bust open the door ",
            "[removed]"
        ]
    },
    "The Forgotten Tunnel": {
        "title": "The Forgotten Tunnel",
        "score": 15,
        "url": "https://www.reddit.com/r/nosleep/comments/1dr6mif/the_forgotten_tunnel/",
        "content": "Living in a small town, you often hear whispers about old, forgotten places. There was one tale that always intrigued me: the story of the Forgotten Tunnel. Located deep within the woods, it was said to be part of an abandoned mining operation, long since sealed off due to mysterious disappearances.\n\nOne cool, misty evening, curiosity got the better of me. Armed with only a flashlight and a sense of adventure, I set off to find the tunnel. The path through the woods was overgrown and barely visible, the trees closing in around me like skeletal hands.\n\nAfter an hour of trudging through the underbrush, I found it—a rusted, ancient gate barely hanging on its hinges. Beyond it lay the entrance to the tunnel, a yawning maw of darkness that seemed to swallow all light. The air grew colder as I approached, a chill that seemed to seep into my bones.\n\nI hesitated only for a moment before stepping inside. The tunnel walls were damp and covered in mold, the air thick with the smell of decay. My flashlight flickered, casting eerie shadows that danced and twisted. The deeper I went, the more oppressive the darkness became, until it felt like a living, breathing entity pressing in on me.\n\nHalfway through, I stumbled upon an old mining cart, its wheels rusted and immobile. Inside it were remnants of old tools, long abandoned by their owners. I felt a shiver run down my spine as I imagined the miners who had once worked here, now lost to time and memory.\n\nJust then, I heard it—a faint whisper, almost imperceptible, echoing through the tunnel. It sounded like a voice, but distorted, as if carried from a great distance. I stopped, straining to hear. The whisper grew louder, more insistent, and I realized it was calling my name.\n\nPanic set in, but my feet seemed glued to the spot. The whisper became a chorus, a cacophony of voices all chanting my name. I swung my flashlight wildly, the beam cutting through the darkness but revealing nothing. The tunnel seemed to close in around me, the walls narrowing as the voices grew louder.\n\nI turned to run, but the tunnel had changed. The entrance was gone, replaced by solid rock. The whispers turned into screams, a thousand tortured souls crying out in agony. My flashlight flickered and died, plunging me into complete darkness. The screams were deafening now, reverberating through the tunnel and shaking me to my core.\n\nI ran blindly, my hands scraping against the rough walls. The tunnel twisted and turned, disorienting me until I didn't know which way was forward. My breath came in ragged gasps, my heart pounding in my chest. Just when I thought I couldn't take it anymore, I stumbled and fell, crashing to the ground.\n\nWhen I opened my eyes, I was outside. The entrance to the tunnel loomed behind me, silent and foreboding. I scrambled to my feet and ran, not stopping until I was safely back in town. I told my story to anyone who would listen, but they all laughed it off as a hallucination, a trick of the mind.\n\nBut I know what I heard, what I felt. The Forgotten Tunnel is not just a relic of the past. It is a living, breathing entity, a trap for the curious and the unwary. I can still hear the whispers sometimes, in the dead of night, calling my name. The tunnel is always there, waiting, and I know it won't let me escape forever.",
        "num_comments": 1,
        "comments": [
            "not a bad tale"
        ]
    },
    "The Pale of the Casket Cellar": {
        "title": "The Pale of the Casket Cellar",
        "score": 75,
        "url": "https://www.reddit.com/r/nosleep/comments/1dqvykx/the_pale_of_the_casket_cellar/",
        "content": "A couple of years ago, I went on vacation with a couple of friends of mine. My friend Kelly came from a place called Chatter Blinds up in New England. While her family had long since moved out, they kept a summer home in the area. Small-town living in a place down by the coast? Sign me up.\n\nThere were four of us in total. Kelly, who arranged the whole thing, was a work friend of mine. Then there was Marie. I didn’t know her very well, but she and Kelly went way back – to the point where they could probably finish each other’s sentences. Finally, there was Annie. I didn’t know her all that well, but I’d seen her around the office a couple of times. Apparently she was related to Marie somehow, but I hadn’t bothered to ask how.\n\nSo on a late Thursday afternoon, we headed for a New England Labor Day-weekend.\n\n \n\nChatter Blinds is a peculiar town, just past Brunswick. The place is along the coast and houses (at most) a couple of hundred people. Most of it looks sort of frozen in the 1970’s, and you can tell by the sun-beaten signs that not a lot has changed since then.\n\nWe made our way to the old summer home at the edge of town. It was the kind of place where you needed firewood to keep warm in the winter, and where your water might suddenly run out. There was a well on the property. Electricity was spotty at best, and there was a massive wasp nest hanging from the southwestern corner of the roof.\n\nStill, it was exactly what we bargained for. Cheap country living.\n\n \n\nOur stay there took some time getting used to, but by Friday night we were having a blast. We took a rowboat out to a sauna on a small island and had margaritas. We spent Saturday touring the town and having a bite to eat at the local pub. We met one of the local fishermen who offered to take us out on a trip on Sunday, which we all heartily agreed to. Subsequently, Sunday turned out great. Sure, we had to get up early, but we were feasting on freshly smoked lobster by the end of the day.\n\nWe were having a bit of trouble though. There were a couple of locals who weren’t all enthused about a bunch of metropolitan women coming to see their town, so we had to endure more than a handful of nasty comments. They were just stupid kids, but it was definitely the worst part of the trip. There was this one blonde kid with a white shirt that just refused to stop smirking at us. His baby sister, aged 10 or 12, didn’t seem all too enthused either.\n\n \n\nWhen Sunday rolled around, we were ready to go home. Before we did, Kelly decided to give us a final tour. Marie remarked on something peculiar; that there was no church in town.\n\n“Towns like this always got a church,” she commented. “It’s just strange, is all.”\n\n“It’s the bedrock,” Kelly commented. “Most of the town is built on solid bedrock.”\n\n“So just build a church on the bedrock.”\n\n“Can’t have a *graveyard* built on bedrock,” Kelly shrugged. “Most folks who died back in the day were shipped off to either Brunswick or Wiscasset.”\n\nKelly stopped for a moment, considering something. Checking her phone, she nodded.\n\n“We got time,” she smiled. “You gotta see this one last thing. The casket cellar.”\n\n \n\nShe took us to the north side of town. We followed a dirt road into the woods, where there was this bulging dirt mound. Not just like a pile, but like, a small structure. It was clearly man-made but hadn’t been used in decades. It was covered in wildflowers in this perfect circle, like a place of worship. There was a solid oak door in the middle of it. The road was severely overgrown with weeds and fallen trees, showing just how few people went out of their way to see this place. A couple of rusted-out logging machines lay to the side. Just looking at them made me feel like I needed a tetanus shot.\n\n“This is one of few patches of land around that isn’t just solid rock,” Kelly said. “It was too small to build a graveyard, but they figured they could make a kind of storage.”\n\n“A storage for what?” Annie squinted at her.\n\n“For a while it was logging stuff, but back in the day it was dead folks. Like a… you know. A temporary thing before the bodies were shipped off north.”\n\n“So it’s like a… cooler. A cellar,” said Marie.\n\n“Yeah,” Kelly nodded. “People don’t use it anymore, but it’s sort of a… morbid local curio.”\n\nWe all fell silent for a moment. Kelly turned to me with the biggest grin.\n\n“Wanna check it out?”\n\n \n\nOf course we wanted to see it. We were four women in our mid-30’s hopped up on true crime podcasts and Stephen King novels. This was the sort of thing that gave me the goosebumps; I’d never heard of anything like it. A body cellar? Sick.\n\nThe door took some convincing to open, but we managed to squeeze through. The air was damp and cool; much colder than expected. Using our phones as flashlights, we walked down a narrow set of stone steps, deeper into the ground.\n\nThe cellar was about 9 by 9 feet and we had to crouch not to hit our heads on the ceiling at times. The ground was solid bedrock, but the walls were a combination of propped-up planks, and deep dirt holes. They reminded me of the wasp nest back at the house, where you could see these deep chambers built into it. It was the same here; about a dozen holes in the wall, going deep into the dirt.\n\nOf course, there was nothing there. The place hadn’t been used for decades, maybe even a century. There was some kind of opening, somewhere, as I could feel a puff of cold air going through the room, but I couldn’t see any ventilation or opening. To add to the ambience, Kelly decided to light an oil lamp she found in the corner. We were a bit skeptical, but it seemed to work well enough. She hung it on a hook in the middle of the room.\n\n \n\nThe light flickered a little as we turned off our flashlights and looked around the room. There were these small notches in every hole where caskets were once slid in. There were tools along the lefthand wall. Things like hooks to drag the bodies out. Hammers and rusted nails to fix broken casket lids. Masks to shield workers from swarms of flies.\n\nEvery item told a story, and once you put it all together, it painted a grim picture. This place had been something real and sorrowful. This wasn’t a tourist attraction; it was a remnant of a grim reality. This was a place of necessity, not curiosity.\n\nI felt a little bad about it and suggested we leave. Marie and Kelly wanted to take a couple of pictures, so they asked me to help. They sat down by the edge of one of the holes and pretended to look scared. I took a couple of photos while Marie giggled about having a new Tinder pic. I wasn’t amused – it was too morbid. That cellar was… uncomfortable.\n\n \n\nWe turned to leave, hurrying up the stairs. Annie was first. As she reached the door and pushed on it, she stopped. She pushed again, and again.\n\n“It’s stuck,” she said. “It’s… hold on…”\n\nShe tried a couple more times but couldn’t get it to budge. She switched places with Kelly, who was the more athletically gifted of us. Kelly gave it a proper shoulder-push, but the door didn’t move an inch. She gave it another push, a kick, and an impressive effort – but it didn’t move. Then I heard something.\n\nGiggling.\n\nIt was those goddamned kids. They’d locked us in and put something against the door. Annie yelled at them to let us out, or we’d press charges. That just made them giggle more. It didn’t take long until we could hear them leave, with a faint “Bye!” echoing off in the distance.\n\n \n\nWhile Kelly and Marie took turns punishing the door, Annie and I tried to get a signal on our phones. Even at the very top of the stairs, we were still underground and off the grid. This place was isolated, and we couldn’t get a signal through.\n\nKelly and Marie came back down dripping with sweat. Annie was curled up in a corner, trying not to panic. There was no doubt about it. We were stuck, for the time being. Maybe someone would pass by and let us out.\n\nKelly tried to use some of the tools to break the door, but it didn’t work. The hammers were termite-ridden, and the handles were falling apart. There was a saw, but the blade was rusted straight through. There were hooks for dragging out caskets, but these were useless when it came to breaking doors or hinges.\n\n \n\nWe were stuck down there for a couple of hours. Things were getting dark outside, and we could feel a wind growing colder. Annie was having some sort of panic attack and had resorted to desperately pounding on the door – screaming for help. The rhythmic thumping and yelling were boring into my brain, to the point where I could still hear it in the quiet moments where she stopped. Kelly had run her phone battery dry trying to find a spot with a signal. Marie had just fully given up and collapsed against the wall, taking a stress-induced nap.\n\nThe oil lamp was still burning strong. Kelly had tried to set the door on fire, but it just wouldn’t catch on. The air was too damp, and it only resulted in smoke blowing down into the cellar. It seemed that no matter how hard we tried, we couldn’t MacGyver ourselves out of this one anytime soon. It was getting annoying since we all had work in the morning, and we’d have to drive late into the night to make it back on time at this rate.\n\nInevitably, we turned on one another. Blaming each other for provoking the locals, for not keeping the door open, for going there in the first place. Annie went on a long rant about how we all could’ve gone to Aruba instead, where she had a half-sister who ran a bar. Marie had fully checked out at that point, turning from napping to silently weeping. There was no way we’d be left there for long. If the kids had found us, others would too.\n\n“We just have to make sure we’re heard,” I said. “That’s all we can do.”\n\n \n\nWe took turns pounding on the door, calling out for help. Even Marie joined in, although not as energetically as the rest of us. We rationed our water bottles, sharing what little we had between us. It went on and on for hours. Banging on the door. Call for help. Banging on the door. Call for help. Over, and over, and over. We were lucky that cellar was empty, or that kind of braindead monotony would be annoying enough to wake the dead.\n\nIt got colder a lot quicker as the sun set. There’d already been an overcast during the day, so we figured it wouldn’t be long until it started to rain. Maybe someone would come looking for us in the morning; the four of us not showing up for work ought to raise a few eyebrows.\n\nWe huddled together for warmth, watching the light of the oil lamp flicker back and forth. There was a cold chill reaching us, pulling me back from the brink of an exhausted sleep over and over.\n\n \n\nIt must’ve been close to midnight when I looked up to see Annie standing in the middle of the room, staring down the holes in the wall. She was breathing heavy, as if trying to psych herself up. I squinted at her, trying to get the sleep out of my eyes.\n\n“What are you doing?” I whispered, as to not wake the others.\n\n“I heard something,” she said. “In there.”\n\nShe pointed straight into one of the hole. As she did, an icy wind swept through the cellar; swirling the dirt around and stinging my nose. Marie shuddered in her sleep.\n\n“I’m gonna look,” said Annie. “Real quick.”\n\n \n\nI got up and stood behind her. She crawled into the hole face-first. She could barely move, but I promised to pull her out by her feet if I had to. As she got to the back of the hole, I couldn’t see anything but her shoes sticking out.\n\n“Anything?” I asked.\n\n“No,” she sighed. “I think it’s just some-“\n\nShe stopped. Another wind passed through the room, this time a little stronger. The oil lamp swayed and fell off the hook, falling to the ground with a clunk. The flame went out as Marie and Kelly sprung awake. For a moment, everything went deathly quiet.\n\nI felt this strange sensation in my chest. Something tightening over my ribs, like my blood constricting. Something poking my heart to provoke it into racing.\n\n“Annie?” I whispered.\n\nNothing.\n\nI picked the lamp up, lit it, and hung it back up. I could see her feet dangling at the edge of the hole, not moving an inch.\n\n \n\nThen, she moved. A sudden lurch.\n\nHer legs motionless, moving further down the hole.\n\nAs if something was dragging her in, by the head.\n\n \n\nI grabbed her foot and felt a tug on the other end. A sudden pull, and her shoe came off.\n\nThe hole went deeper than we thought. A lot deeper.\n\n \n\nMarie and Kelly panicked. Marie rushed up the stairs and resumed banging on the door while Kelly battled against her instincts to follow Annie into the hole. She poked her head in to look, but couldn’t bring herself to go further; instead pulling at her own hair in frustration. I didn’t even notice how I’d stumbled backwards toward the opposite end of the room, flattening myself against the wall. It was… subconscious.\n\nAs Marie and Kelly panicked, running back and forth, all I could do was to look at Annie’s shoe. It still lay there at the edge of the hole. The same hole we’d used for a nice profile picture, earlier in the day.\n\nA stray thought hit me. I still had some battery left on my phone. Not much, but a little.\n\nAs the screams for help faded into screams for Annie, I fumbled through my photo album. I didn’t even notice how much my fingers were shaking until I had to precision-tap which image to view, where I picked the wrong one at least three times.\n\n \n\nFinally, I brought up the picture of Kelly and Marie, standing in front of that hole. The flash had gone off, giving them a bit of an eerie glow. But it also allowed me to see straight into the hole behind them.\n\nThere were these ten white spots in the dirt, laid out in a sort of crescent semi-circle. They were too dull to be eyes, or glass. They weren’t really reflective.\n\nMy mind wandered as I pondered the possibilities. My eyes blurred, looking away from the screen and down onto my dirty hands. My pale thumbs, holding the device in a cramp.\n\nLooking back at the picture, I couldn’t help but to see a similarity.\n\nTwo sets of five, deep in the dirt.\n\nFingers.\n\n \n\nI took down the oil lamp and carefully moved up to the hole. Kelly and Marie joined me. We looked inside, only to see that the back end of the wall was gone. Instead, it was just this hole going deeper into the dirt at a slight tilt.\n\nThis wasn’t just an abandoned cellar. It was something’s nest.\n\nWe all stopped to listen. Further in, almost as if coming from below our feet, we could hear a sound travel. The faint noise of fabric being torn. The pop of buttons coming off, and zippers being torn open. The shuffling of hair.\n\nThen, a sickening crunch.\n\nThe breaking of bones.\n\n \n\nWe backed away. Marie was having trouble breathing. Kelly tried to calm her down, carefully stroking her shoulders, hushing her. We spoke in whispers, leaving the oil lamp hanging in the middle of the room.\n\n“We’re not getting out,” Kelly whispered. “We have to wait until they find us.”\n\n“There’s something in there,” I whispered back. “We have to do something.”\n\n“W-we… we gotta get Annie out,” sobbed Marie. “We can’t leave her in there.”\n\n“I’m not sticking my head in, and neither are any of you,” Kelly snapped back. “We’re getting out, and we’re getting help.”\n\n \n\nWe all decided to try one thing each. Marie was going to check one of the other holes to see if there were any other tunnels, possibly leading outside. There was fresh air coming from somewhere, so there had to be some kind of connection to the surface. Kelly was going to block the hole where Annie had disappeared. We all collected our spare jackets, shoes, and backpacks; stuffing it in the hole along with any tools and debris we could find along the cellar.\n\nI was going to try and call for help again. There was a slight gap at the bottom of the door where I could slide the phone through. It might be just enough to get a bar. I used a long sleeve of plastic from a Slim Jim and put it under the phone, so I could drag it back in – carefully. I put the phone down, pressed to call, and slid it out; hoping those extra inches would be enough.\n\nIt briefly sounded like a call went through, but I couldn’t hear anyone picking up. It was raining outside by now, and the sound drowned out everything else. There was cold water dripping through the door, staining the stone steps on the way down.\n\nWe weren’t going anywhere anytime soon. By the time I dragged my phone back in, the battery was as dead as the rest of this place.\n\n \n\nGoing back the stairs, I almost slipped. I caught my grip, but looked up at the surprised faces of Kelly and Marie, standing in the middle of the cellar.\n\n“You alright?” Kelly asked.\n\nI nodded.\n\n \n\nBefore I got to respond, I saw something moving in one of the other holes. A forearm, almost three foot long, reaching out into the room. I pointed at it, screaming, just as another wind swept through the room; this time blowing out the flame of the oil lamp completely.\n\nThere was commotion.\n\nI couldn’t tell who screamed the most. Kelly, Marie, or me. Someone was in pain. One voice grew more distant, and suddenly stopped. A dragging noise dwarfed by panicked crying.\n\n \n\nI touched the walls. I forced myself to think of my own body. I was unharmed. I was alright. But someone down there wasn’t.\n\nThat was just it – down there. It was down there, not up the stairs.\n\n“Come up here,” I whispered. “Up the stairs.”\n\nA quiet sobbing. Step by step, someone came up the stairs. The thought hit me that it might be none of them. It could be Annie. It could be whatever took her. There was no way to be sure, and with the last light snuffed out there was nothing to prevent my mind from filling in the blanks.\n\nAs a hand grabbed my leg, I screamed – startling poor Kelly, who was the one coming up.\n\n \n\nWe made our way to the top of the stairs, pushing our backs against the door. We made ourselves small and tried to keep quiet. A sliver of light made its way through the cracks in the door. For a good half an hour or so, we just sat there, trying to find the courage to speak. Finally, Kelly whispered to me.\n\n“I-it grabbed her ankle,” she said. “It crept along the floor, and g-grabbed her ankle.”\n\nInstinctively, I moved my feet up and hugged my knees close to my chest.\n\n“Did you see it?” I whispered back.\n\n“J-just the fingers,” she said. “I-it had really long fingers.”\n\n \n\nMy leg cramped up, and I stopped feeling anything in my toes. I couldn’t move, and neither could Kelly. We could barely breathe. I tried to listen past the pitter-patter of rain, but there was nothing coming from downstairs. Instead, my mind filled in the blanks – imagining all kinds of noises. I could almost hear the way Annie pounded on the door, calling for help. I could hear Marie’s gentle weeping. And if I let my mind stray just a little bit too far, I could hear the snapping of bones, and the ripping of fabric.\n\nMy pulse was racing so hard it hurt my head, making me bob my neck back and forth like a fish out of water. Kelly didn’t say a word. We just held each other close, waiting second by second for dawn to come.\n\n \n\nIt must’ve been… an hour, maybe two, before I heard something.\n\nThere was a shuffling noise outside, on the other side of the door. I perked up to listen, and Kelly did the same. Footsteps – someone walking by. I saw the outline of Kelly’s face as we looked at one another, quietly contemplating our options.\n\nThen, a voice.\n\n“…are you still in there?”\n\nA young girl, maybe 10 or 12. We’d seen her run with the local kids.\n\n“Yes,” Kelly whispered back. “You need to go get help. Call the police. And you need to open the door.”\n\n“I can’t do that,” the girl sighed. “The chipper they put there is real heavy. I can’t-“\n\n“Then you need to go get help!” Kelly roared. “Right now!”\n\nThe girl took off immediately. For what purpose, we couldn’t tell. Maybe she was gonna get help. Maybe she got scared off. We didn’t know. Either way, she was gone.\n\nAnd shortly after, there was a sound coming from downstairs. A chill wind blowing through the cellar carrying a strange, musty scent.\n\n \n\nWe tensed up. I held my breath. A light tip-tap of something poking against the stone steps. Then, nothing.\n\nI looked at Kelly and held her hand.\n\nThen she was pulled down.\n\n \n\nIt was quick. She held onto my wrist like her life depended on it, and I slid down three steps. I held onto her and pulled, but the force at the other end was too strong. She kicked and screamed like a wounded animal, but nothing seemed to work. Finally, something came loose, and she scampered back up the stairs.\n\nPushing ourselves against the door, I could see her foot was bleeding. Her shoe had come off, and at least two toes were broken at a strange angle. There were marks along the middle of her foot. Bite marks. I could see the imprint of human molars on her big toe.\n\nWe huddled against the door. Kelly’s eyes were wide with panic, scratching at the wood until her acrylic nails came off.\n\n \n\nIt didn’t take long for it to return. A long white arm making its way up the stairs. A hand tip-tapping against the stone steps like a spider. And far down into the dark, I could see three pairs of eyes reflecting the sliver of moonlight coming through the door. Six eyes, parted into sets of two.\n\n \n\nWe threw our shoes. We kicked. We screamed. It retreated, only to try again, and again, and again. As soon as there was a moment of quiet, it came back – poking and prodding at our readiness.\n\nIn a moment of silence, Kelly and I just held one another. I eventually came to realize that there was a new sound coming from downstairs. It’d been there for some time, but we’d been too busy to notice it. A low rhythmic hum, like a deep cackle.\n\nA laugh.\n\nIt had stopped playing with us.\n\n \n\nSeconds later, two arms shot out of the dark. One grabbing me by the hair, the other grabbing Kelly by the throat. We were immediately pulled down step, by step, by step. Within seconds, I could feel the floor as we reached the cellar. My hands fumbled for something to grab, only to feel the glass shards of the now-broken oil lamp next to me. Grabbing the largest shard I could, I let it sink into my palm as I stabbed what had grabbed me over, and over, and over.\n\nThe moment it let go, I dove for Kelly. I drove the shard into the pale white arm grabbing her, forcing it to let go. A dark blue kind of blood, thicker than jelly, pooled around the edge of the shard as both arms sunk back into the holes.\n\nKelly was barely breathing; struggling to get air past her neck. I grabbed her under her arms and tip-toed my way back up the stairs; only to see those white arms slowly coming back out.\n\n \n\nI couldn’t survive another attack. It’d be our last. I dragged Kelly back up the stairs, hoping against hope we’d make it somehow. She kicked helplessly at the white fingers that poked at her wounded feet, teasing her. A reminder that it was going to get her next time.\n\nLaughter.\n\n“…no…” Kelly mumbled with what little breath she could muster. “…n-no…”\n\n \n\nWe reached the top of the stairs. The arms grew closer. Nails tip-tapping against the stone steps.\n\nIt was joyful. Eager.\n\nExpectant.\n\n \n\nI pressed my back against the door. If it came to it, I would have no choice but to drop Kelly. I had to do whatever it took to make it out. I remember coming to that conscious decision that if it came down to it, I’d do it. I had to.\n\nThen, I lost my balance.\n\nThe door gave out from behind me as it opened.\n\n \n\nI fell backwards, keeping Kelly in my arms. A sudden burst of moonlight lit up the hallway as a mound of pale limbs retreated into the dark.\n\nThe local kids had pulled an old rusted-out machine aside, unlodging the door.\n\nKelly coughed, crawling away from the entrance. To see a grown woman crawling through the dirt like that in a panicked weeping… I’ll never get that image out of my head. Even the kids who’d trapped us seemed shocked.\n\n“W-we thought… we thought you could open it,” one of them said. “It wasn’t meant t-to get stuck…”\n\nThe blonde kid with the white shirt. He wasn’t smirking anymore.\n\n \n\nI just stayed there, in the rain. The palm of my hands slipping on a couple of trampled petals from a blue sunflower. I looked at the cellar, unblinking. Even then, despite the rain, and the excuses, and the weeping, I could hear the tip-tapping of nails against the stone steps. Something waited for us to slip up. For someone to look the other way.\n\nFor another chance to take it all away, in the blink of an eye.\n\n \n\nThis was a couple of years ago, as I mentioned. It was all written up as an animal attack, but there wasn’t even an attempt to elaborate. Just an animal attack. The local sheriff ordered the place permanently closed, so they just filled it up with gravel and dirt.\n\nThey never recovered Marie or Annie. They never even said what happened to them.\n\nKelly had to amputate part of her foot, but was otherwise fine. But she, like me, wasn’t going to be the same ever again.\n\n \n\nThat’s why I sleep with the lights on, and something playing on my laptop. As soon as the dark gets too dark, or the silence gets too loud, my mind fills in the blanks with something from that night. The weeping. The banging on the door. The tip-tapping of nails against stone.\n\nAnd I will have to do what it takes to drown that out.\n\nFor the rest of my life.",
        "num_comments": 3,
        "comments": [
            "Oh god, it sounds like you ran into something that was maybe once human but seems to have become some sort of spider like monster. Horrifying to think how it ended up there.",
            "bruh those kids should get in big ass trouble. They are pretty much responsible for the murders that happened, whether they meant to do that or not! I don't believe in boarding school but if I found out a \"prank\" my kid was in on killed people, I'd be shipping them off cuz that's too insane for me to handle",
            "Old things from a darker time. "
        ]
    },
    "I Witnessed the Power of a Wish and now We're Fighting for Reality": {
        "title": "I Witnessed the Power of a Wish and now We're Fighting for Reality",
        "score": 7,
        "url": "https://www.reddit.com/r/nosleep/comments/1dr8ktr/i_witnessed_the_power_of_a_wish_and_now_were/",
        "content": "You'll need [Pt 1](https://www.reddit.com/r/AliasReads/comments/1dr8ltx/i_witnessed_the_power_of_a_wish_and_its/) and [Pt 2](https://www.reddit.com/r/nosleep/comments/1dodq66/i_witnessed_the_power_of_a_wish_and_its_eating/)   \nThe void was an endless, featureless expanse. No sound, no touch, no smell. The silence was absolute, oppressive, wrapping around me like a shroud. It felt as if I were floating in a sea of nothingness, adrift and utterly alone. Panic began to set in, my breaths coming in rapid, shallow gasps, though I couldn't feel the air moving in or out of my lungs.\n\nMy vision was the only sense left to me, but there was nothing to see. Just a vast, empty bright blackness stretching infinitely in all directions. It was disorienting, a nauseating sensation of being nowhere and everywhere all at once. I tried to scream, but no sound emerged from my lips. My voice, my existence, was lost to this place.\n\nThen, from the depths of the darkness, they came. The eaters. Shadowy figures, writhing and shifting, their forms indistinct and ever-changing. They moved with a terrifying, deliberate grace, closing in on me from all sides. My heart pounded in my chest, a futile attempt to escape the inevitable.\n\nThe first touch was cold, like ice spreading through my veins. Their tendrils wrapped around my limbs, pulling me all directions. I struggled, thrashing against their grip, but it was like fighting against water—ineffectual and hopeless. They swarmed over me, and I could feel their presence leeching away my very essence.\n\nPain exploded through my body as they tore into me, rending flesh from bone with ravenous commitment. It was a silent agony, my screams absorbed by the void. I could feel myself being consumed, piece by piece, until there was nothing left but a hollow shell. The last thing I saw before everything went black was their beady, empty eyes, devouring my soul.\n\n>*The most defenseless tenderness and the bloodiest of powers have a similar right to the metaphysical overexposure of language.*  \n*-Michel Foucault*\n\nI awoke to a new kind of horror. I was naked, my arms were outstretched, nailed to a cold, white and gold marble wall. I was crucified, my body splayed out in a grotesque display. A large spike was also driven through my throat, pinning my head back against the wall. The pain was excruciating, a burning, suffocating agony.\n\nBefore me stood the gods. Incomprehensible beings, their forms shifting and indistinct, made of light and shadow and something beyond my understanding. They towered over me, their presence overwhelming, and I knew that I was in the presence of a power far greater than anything I could comprehend.\n\nA wave of helplessness washed over me. Here, nailed to this unyielding surface, my existence seemed puny and insignificant. The vastness of these beings, their immense power, made my entire life feel like a mere speck in the grand tapestry of the universe. I was nothing compared to them, a fleeting thought in the mind of an eternal cosmos. My wish, my desperation, my regrets—all felt trivial under their gaze.\n\nI had thought my wish was the end of my suffering, the undoing of my mistakes, but standing—no, hanging—before these gods, I realized how naive and foolish I had been. I was but an insect, trying to fathom the workings of a realm beyond my comprehension. The gods' forms shifted, blending into each other, their voices resonating with a power that made my bones vibrate.   One of the gods, a being of darkness with eyes like burning coals, looked down at me with disdain. Its form was harsh and angular, exuding an aura of judgment and finality. \"He should die,\" it said, its voice a low, rumbling growl that echoed through the void. This was Ithuriel, the Judge, who saw the world in black and white, in absolutes. His realm was one of strict justice, devoid of mercy.\n\nAnother god, a trickster with a mischievous grin, stepped forward. Its form flickered and changed, never staying the same for more than a moment. \"I granted his wish,\" it said, its voice lilting and mocking. \"And I have more plans for him yet.\" This was Faelan, the Trickster, who reveled in chaos and unpredictability. His eyes sparkled with a mischievous light, always searching for the next piece of entertainment, the next game to play.\n\nTwo more gods, their forms intertwined like a dance of light and shadow, spoke in unison. \"We respect the wish,\" they said, their voices harmonizing in a strange, otherworldly melody. This was Solara and Umbra, the Twin Aspects, representing balance and duality. Solara was radiant, her form glowing with a warm, golden light, embodying creation and life. Umbra, her counterpart, was a figure of darkness, a void that absorbed all light, embodying destruction and death. Together, they maintained the equilibrium of existence.\n\nMy mind raced, trying to grasp the enormity of what I was witnessing. These gods, these incomprehensible beings, were debating my fate as if I were a mere pawn in their cosmic game. The realization was crushing. My actions had rippled through the fabric of reality, drawing the attention of entities far beyond my understanding. I was a single thread in an infinite tapestry, pulled and twisted by forces I could never hope to control.\n\nFaelan, the Trickster, stepped forward again, his grin widening. \"Your wish has set things in motion,\" he said. \"But know this, mortal—you are far from finished. Your story is just beginning, and the consequences of your actions will ripple through the fabric of reality.\"\n\nSolara and Umbra, the Twin Aspects, moved closer, their presence a harmonious blend of light and shadow. \"We will honor the wish,\" Solara said, her voice filled with warmth and compassion. \"But be prepared for the journey ahead.\"\n\nUmbra's voice followed, cold and unyielding. \"For every action, there is a consequence. Balance must be maintained.\"\n\nIthuriel, the Judge, remained where he stood, his gaze still burning with contempt. \"Do not squander this chance,\" he growled. \"Redemption is earned, not given.\"\n\nAs I hung there, my mind teetering on the brink of madness, I couldn't help but reflect on my insignificance. The vast, unending expanse of the cosmos stretched out before me, and I was just a tiny, insignificant dot. Yet, somehow, my actions had drawn the attention of gods. The weight of that responsibility was almost too much to bear.\n\nWith that, the gods faded into the void, their forms dissolving into the darkness. The pain intensified, and I felt myself slipping away, my consciousness fading as the void claimed me once more.\n\nAnd then, I woke up.\n\nWhen I woke up, I found myself ensconced in the sterile confines of a hospital bed. My entire body ached with a dull, persistent pain, a physical echo of the turmoil within. The smell of antiseptics, sharp and clinical, filled my nostrils, mingling with the faint scent of clean linens. The rhythmic beeping of the monitors was the only sound, a monotonous reminder of my fragile existence.\n\nI blinked, my eyes protesting against the harsh fluorescent lights overhead. They felt like interrogator's lamps, exposing my every flaw and insecurity. Each blink seemed to bring with it fragments of shattered memories, jigsaw pieces of a nightmarish puzzle that my mind struggled to piece together. The sterile white walls around me felt like the padded room of a madhouse, containing the fractured remnants of my sanity.\n\nA nurse noticed my stirring and approached with a gentle smile, her expression one of practiced compassion. She was an oasis of calm in the chaos of my mind. \"Good to see you're back with us,\" she said softly. Her voice was a soothing balm against the jagged edges of my thoughts. \"You had quite a fall. How are you feeling?\"\n\nI tried to speak, but my throat was parched, and the words caught like sandpaper. She handed me a cup of water, and I drank slowly, the cool liquid a temporary reprieve from the desert of my mouth. It felt like an eternity before I could manage a raspy \"Thank you,\" my voice barely more than a whisper, a ghost of its former self.\n\n\"You were found unconscious in the park,\" she explained, her eyes scanning my face for signs of recognition. \"An EMT brought you in. Do you remember anything about what happened?\"\n\nMy mind was a storm of confusion, memories swirling like leaves in a gale. The eater, the woman, her baby... The images flashed before me, stark and vivid, each one a dagger to my psyche. My heart raced, the monitor beside me quickening its beeps. \"The baby... Is the baby okay?\" The words tumbled out, thick with desperation.\n\nThe nurse's expression relaxed, a look of genuine concern. \"The EMT who brought you in mentioned something about a baby. Both mother and child are fine. They were here briefly, but they left as soon as they were cleared. She said to thank you for trying to help.\"\n\nRelief washed over me, a wave that both soothed and drowned me. But the memory of the baby's blood, flowing so profusely from its head after I tore the eater off, haunted me. How was that even possible? The eaters didn't leave physical marks—at least, that's what I had assumed. Yet, I had seen the crimson liquid, the innocent life seeping away, as the mother screamed in horror.\n\nHad my desperate attempt to save the child somehow worsened the situation? I couldn't reconcile the image of the eaters, consuming reality itself, with the very tangible, very human blood I had witnessed. But the mom said the baby was fine? The disconnect gnawed at my mind, a puzzle piece that refused to fit.\n\nThe nurse's voice, a lifeline to the present, cut through my thoughts. She continued to speak, but her words were a blur. My focus was on the baby's face, the terror and confusion in its wide eyes. I had to understand what was happening, why these eaters were appearing, and how to stop them before more lives were upended.\n\n\"There's someone here to see you,\" she said, her tone shifting to something more serious. She gestured toward the door, her eyes betraying a hint of uncertainty.\n\nA woman entered the room, her demeanor calm yet radiating an intensity that set me on edge. She moved with a quiet authority, each step measured, as if she were treading on sacred ground. She introduced herself as Emily, her voice a smooth blend of empathy and urgency.\n\n\"Mr. Lawson,\" she began, pulling up a chair beside my bed. She leaned in slightly, her eyes locking onto mine with a piercing gaze that seemed to see through the layers of my soul. \"We need to talk about what you saw in the park.\"\n\nA chill ran down my spine. \"What do you mean?\"\n\n\"We've been monitoring unusual occurrences like the one you experienced,\" she said, her tone matter-of-fact yet tinged with a gravity that made my pulse quicken. \"The entities you encountered are what we call 'Voidling Recyclers.' As far as we can tell, they're disruptions in reality, drawn to consume and undo existence itself.\"\n\nVoidling Recyclers. The term bounced around in my mind until the pieces clicked into place. \"You mean the eaters,\" I said, my voice barely above a whisper. Emily's eyebrows raised slightly at my term, but she nodded.\n\n\"Yes, that fits,\" she said. \"Eaters. They're the result of some tear in the fabric of reality, something powerful enough to disrupt the natural order.\" Emily sighed, running a hand through her hair, a gesture that spoke of weariness and burden. \"We're still trying to understand the full scope of the situation. But from what we gather, these “eaters” seem drawn to areas of quantum diminution. They are the muscle that breaks down the door, so to speak\"\n\nA cold dread settled in my stomach. She didn't know that it was my wish that had caused all this. I had to keep that buried for now. \"So, what do we do?\" I asked, trying to keep my voice steady.\n\nEmily's expression softened. \"We need to find a way to seal these tears, to stop the eaters from consuming more of our reality. But we need your help, Mr. Lawson. You have a unique connection to these entities. You might be the key to stopping them.\"\n\nHer words hung in the air, puncturing the silence with the inclined responsibility. I had unleashed this nightmare; it was my fault. But could I actually make a difference and fix this? My wish is gone. \"What makes you think I'm able to help you?\" I asked, needing more convincing.\n\nEmily reached into her bag and pulled out a tablet, quickly navigating to a series of charts and graphs. \"We've been collecting data from the park where you were found,\" she explained, handing the tablet to me. \"These readings show an anomaly centered on your location.\"\n\nI stared at the screen, trying to make sense of the data. The graphs showed a series of spikes in several different colors. \"What exactly am I looking at?\"   \"This is a quantum resonance scan,\" Emily said, her tone professional and precise. \"It measures fluctuations in the fabric of reality. Most of the readings we get are relatively stable, but here,\" she pointed to a particularly sharp spike, \"we see a significant disturbance. It's unlike anything we've recorded before.\"\n\n\"And this,\" she continued, swiping to another screen, \"is an energy dispersion map. It shows the spread of the disturbance. Notice how it's all focused around you, Mr. Lawson. When the eaters appeared, you were at the epicenter of the disruption.\"\n\nI took a deep breath, absorbing the information. The data was undeniable. Whatever had happened in the park, I was at the center of it. \"So, what does this mean?\"\n\n\"It means,\" Emily said, her voice gentle but firm, \"that you have a unique signature that these entities are drawn to. Your presence somehow affects the fabric of reality in a way we've never seen before. If we can understand why, we might be able to use that knowledge to seal the tears ourselves and stop the eaters.\"\n\nHer explanation was clear, and it left little room for doubt. And the data was compelling. \"What do I need to do?\" I asked, readying myself for the daunting path ahead.\n\nEmily stood, extending her hand, a gesture of solidarity and resolve. \"First, we need to get you discharged from the hospital. After that, we'll explain everything. Together, we'll find a way to fix this.\"\n\nEmily helped me gather my things and guided me through the discharge process. The paperwork was a blur, my mind racing with what lay ahead. Nurses and doctors bustled around, giving me instructions and well-wishes that barely registered. My focus was on Emily and the urgency in her eyes.\n\n>*I don't feel that it is necessary to know exactly what I am. The main interest in life and work is to become someone else that you were not in the beginning.*  \n*-Michel Foucault*\n\nOnce I was discharged, Emily led me through a series of sterile hallways, each one seeming to blend into the next. The hospital’s antiseptic smell was pervasive, a reminder of the fragile line between life and death. Finally, we reached a small conference room filled with monitors, charts, and several other individuals who looked up as we entered.\n\n\"This is Michael Lawson,\" Emily announced. \"He encountered the entities firsthand.\"\n\nA man in a lab coat stepped forward, extending a hand. \"Dr. Reynolds. We’ve been analyzing the data from recent events. Your experience might provide the insight we need.\"\n\nI shook his hand, feeling everyone's expectations pressing down on me. \"I'll do whatever I can to help.\" I said quietly, feeling a little overwhelmed.\n\nDr. Reynolds nodded, then turned to a large screen displaying a chaotic array of data points and video footage. \"These are the voids, the areas where reality has been compromised. The... entities are drawn to these spots, feeding on the instability.\"\n\n\"Michael calls them 'eaters',\" Emily interjected.\n\nDr. Reynolds raised an eyebrow, glancing between Emily and me. \"Eaters? That term implies consumption. Are we sure that's accurate?\"\n\nEmily nodded. \"Given what we've observed and Michael's firsthand account, it fits. These beings consume the very fabric of reality.\"\n\nReynolds considered this for a moment, then nodded. \"Alright. Eaters it is. Now, let's focus on understanding them better.\" He pointed to a cluster of red dots on the map. \"These are the latest incidents. They’re increasing in frequency and intensity. We need to understand why.\"\n\nI swallowed hard, \"And you think I can help because I saw them up close?\"\n\n\"Not just that,\" Dr. Reynolds replied, his eyes intense. \"There's something about your interaction with them. We need to understand that connection.\"\n\nAs I studied the map, a thought occurred to me. \"What if... what if we could trace the origin of these tears? Find the source and stop it there?\"\n\nEmily and Dr. Reynolds exchanged a glance. \"We’ve considered that,\" Emily said slowly. \"But finding the exact source is like finding a needle in a haystack.\"\n\nI took a deep breath, knowing that my next words could reveal too much. \"I think I might know where to start.\"\n\nTheir eyes fixed on me. \"Where?\" Dr. Reynolds asked.\n\nI hesitated, then pointed to a spot on the map near where the mistake was made, where my wish had been born. \"Here. This area. It's where I first felt... something was wrong.\"\n\nEmily studied the map, then nodded. \"It's worth a shot. We need to move quickly before more damage is done.\"\n\nEmily and Dr. Reynolds gathered their equipment and essential personnel. The atmosphere was tense, filled with a palpable urgency. I followed them out of the hospital, the bright sunlight a stark contrast to the sterile environment I had just left behind.\n\nWe drove in silence as Emily navigated the streets, her eyes fixed firmly on the road ahead. Dr. Reynolds reviewed data on a tablet, occasionally glancing at me as if trying to piece together my connection to the eaters.\n\nFinally, we arrived at the location I had indicated. It was an unassuming stretch of road, now eerily quiet.\n\nEmily and Dr. Reynolds began setting up their equipment, scanning the area for any signs of instability. I watched them work, my mind racing with the implications of what we might find.\n\n\"Michael,\" Emily called out, pulling me from my thoughts. \"We need you to stand up there. If there's any residual connection, it might help us pinpoint the source.\"\n\nI nodded and moved to the spot she indicated on the rocky outcropping. As I stood there, the air seemed to hum with an otherworldly energy. The ground beneath my feet felt unsteady, as if reality itself was shifting. The sensation was unnerving and made me feel sick.\n\nDr. Reynolds monitored the readings, his expression growing more intense. \"We're getting something,\" he said, his voice tinged with excitement. \"A unique tear is here, but it's faint. We need to amplify it.\"\n\nEmily adjusted the equipment, her eyes never leaving the screens. \"Michael, try to focus on what you felt that day. Try to remember everything.\"\n\nI closed my eyes, the memories rushing back with a visceral clarity. The accident, the desperation, the wish. I could feel that reality again, a burden I could never escape.\n\nThe ground trembled beneath me, and the air grew colder. The hum intensified, and I felt a strange pull, as if something was drawing me in. I opened my eyes, and the world around me seemed to shimmer, the edges of my vision began blurring.\n\n\"We're close,\" Dr. Reynolds said, his voice barely audible over the rising noise. \"Just a little more.\"\n\nI focused harder, the images of that fateful day playing over and over in my mind. The wish, the regret, the moment everything changed. The pull grew stronger, and I felt myself teetering on the edge of something vast and incomprehensible.\n\nSuddenly, the equipment erupted with a burst of energy, and a rift appeared before us. It was a swirling vortex of darkness. The eaters emerged, their forms shifting and writhing, drawn to the instability.\n\nEmily and Dr. Reynolds sprang into action, using their equipment to contain the rift. I watched in awe and horror as they battled to seal the tear, the eaters pushing against their efforts with relentless force.\n\n\"Michael!\" Emily shouted, her voice cutting through the chaos. \"We need your help. Just focus on closing the rift.\"\n\nI nodded, stepping forward, but doubt sat deep in my bones. What if I couldn't do it? What if my actions only made things worse? The connection between me and the rift was palpable, a bond forged in desperation and regret. Is that enough? Am I?  I reached out, my hands trembling, my mind filled with uncertainty.\n\nI turned to Emily, desperation in my eyes. \"Tell me how to close it. What do I do?\"   Emily's face reflected my own uncertainty. \"I don't know, Michael. You're the first to ever try this. We don't have a precedent for closing a rift. You have to trust yourself.\"   Her words hung in the air, offering little solace.\n\nI took a deep breath, trying to steady my racing heart, and noticed the smells of cinnamon and chlorine. I closed my eyes, visualizing the cliffs edge, the storm, the desperate wish, the surge of regret that followed. The memories were sharp and clear, the pain as fresh as if it had just happened.\n\nThe ground beneath me trembled, the air around me humming with energy. I began to feel insignificant again, like I was pinned, nude and exposed, in front of the Gods again. \"I can't do this alone,\" I whispered, the fear creeping into my voice.\n\nAs I stood there, fighting the rising tide of panic, my thoughts shifted to my wife, Anna. Her smile, so bright and full of life, the way she used to laugh at the smallest things, a sound that could chase away any shadow. She had a habit of humming when she cooked, a soft, soothing melody that filled our home with warmth. I remembered how she would always find a way to make even the most mundane moments feel special—like turning a rainy day into an excuse for a cozy indoor picnic.\n\nHer untimely death had shattered my world. She was gone too soon, leaving behind an emptiness that I tried to fill with that fateful wish. I wished to undo everything, thinking it would bring back the happiness we once had. But instead, it had torn reality apart, creating these monstrous entities.\n\n Anna had always believed in me, even when I didn't believe in myself. She would have known what to do. She had a way of making me feel like I could overcome any obstacle, no matter how insurmountable it seemed. Her strength and unwavering support were my anchor, and without her, I felt adrift.\n\nThe memory of her touch, the way she would gently place her hand on my shoulder when I was troubled, gave me a surge of strength. I could almost hear her voice, whispering words of encouragement, telling me that I could do this. I had to do this—for her, for the world that still had a chance to be saved.\n\n>*Madness is the purest, most total form of revolution.*  \n*-* *Michel Foucault*\n\n The connection between me and the rift grew stronger, and as I stood now in front of it, I visualized the rift closing and listened. It was slow at first, but it began to shut like a zipper. Once it became narrow enough, I outstretched my arms and grabbed onto the edges of the void. It was like holding slime for just a moment, then it reacted to my touch with a small pop. It was a weirdly crisp crack, and then I was missing the flesh below my pinky on my right palm.\n\nAt first, I thought I had been turned into a bleeder as I continued to close the rift, seeing the large amounts of blood, but not feel anything. It was only moments later that the receptors noticed something was wrong and then sent the cease fire signal to my brain to make me stop whatever I was doing. A wave of blinding pain washed over me, and I screamed out in retaliation. I had actually lost that part of my hand. The pain was surreal. My pinky loosely curled in towards the palm as no tendons were connected anymore. My wrist and forearm felt like they were on fire as I struggled to keep my grip on the rift.\n\nI then felt a surge of energy flow through me, guided by The memories of Anna and their presence. Together, we pushed against the void, willing it to close. Slowly, the rift began to shrink again, the eaters' resistance weakening. Emily and Dr. Reynolds intensified their efforts, their equipment crackling with power. Together, we forced the void to close.\n\nWith a final sizzling crack, the rift snapped shut, and the eaters vanished. The air grew still, and the ground beneath my feet solidified. We stood there, breathing heavily.\n\nEmily turned to me, hand on her knees as she caught her breath. \"We did it,\" she said, her voice barely more than a whisper. Dr. Reynolds checked over his equipment, and then hastily began to scribble in his notebook   I nodded, what we had just achieved slowly sinking in. We had closed the rift. That was it! We were done! Reality saved!\n\nIf this story had a happy ending, that would have been it. Sorry, but that isn’t reality.\n\nA slow clap resonated through the air, and a strange buzzing shook my eyes. The clapping was coming from the van.\n\nI spun around and met a gaze with vorpal eyes and a mischievous grin.\n\nA god from my dream.",
        "num_comments": 1,
        "comments": [
            "\n\nIt looks like there may be more to this story. Click [**here**](https://www.reddit.com/message/compose?to=UpdateMeBot&subject=Subscribe&message=SubscribeMe%21+%2Fr%2Fnosleep+%2Fu%2FAliasReads) to get a reminder to check back later.\n\nGot issues? Click [here for help](https://www.reddit.com/r/nosleep/wiki/nosleepautobot)."
        ]
    }
}