{
    "We are looking for new moderators": {
        "title": "We are looking for new moderators",
        "score": 21,
        "url": "https://www.reddit.com/r/nostalgia/comments/1bjeqcg/we_are_looking_for_new_moderators/",
        "content": "[Link to the Form](https://docs.google.com/forms/d/e/1FAIpQLSeANMvIcunWxhzJ6Q4JAyfVU3NWJj3Zj_O3uwJ3jjYW5yYTwg/viewform?usp=sharing)\n\nPlease use the above link if you wish to throw your name in the hat. Also, please comment in this post to let me know the link is working.",
        "num_comments": 12,
        "comments": [
            "What's the deal with being a moderator? You have some sort of digital privileges? Get paid? Legit questions I'd need to know before throwing my name \"in the hat\".",
            "Doc link appears to be working.",
            "I used to mod for r/Danger5 but this was before the app\n\nKind of niche but I helped redo the logo and more if you're interested",
            "are applications actually randomly selected?",
            "Yes the link to the form is working!",
            "Be honest; you aren't. You're looking for old moderators that you haven't seen in years, but you remember fondly.",
            "In case you are still keeping track, the link still works!",
            "check out this  stream [https://vaughn.live/cartoonnetwork24](https://vaughn.live/cartoonnetwork24)",
            "“Your response has been recorded”. Now we wait",
            "I can help.  I write bots and help moderate other subs."
        ]
    },
    "Do you actually remember anything about Muppet Babies?": {
        "title": "Do you actually remember anything about Muppet Babies?",
        "score": 886,
        "url": "https://i.redd.it/jl2sbo9rb18d1.jpeg",
        "content": "People only really seem to remember it for all the footage from media which is why it hasn't been on TV in decades, why it hasn't been on DVD really, and why it isn't on any streaming services",
        "num_comments": 231,
        "comments": [
            "I could sing the whole theme song right now.",
            "Still wondering what Nanny’s face looks like.",
            "If I remember correctly, they always went on epic adventures, but it was all just their imagination.\n\nThey didn't actually leave or go anywhere, the room would just turn into a jungle or outer space.",
            "Just the Star Wars episode ",
            "more than anything, the theme song \n\n\nand Nanny's striped socks.",
            "[KERMIT]\nI like adventure\n\n[PIGGY]\nI like romance\n\n[FOZZIE]\nI love great jokes\n\n[ANIMAL]\nAnimal dance!!\n\n[SCOOTER]\nI've got my computer\n\n[SKEETER]\nI swing through the air\n\n[ROWLF]\nI play the piano\n\n[GONZO]And I have blue hair\n\n[BUNSEN]\nMe, I invent things\n\n[BEAKER]\nMee mee mee meee!\n\n[NANNY, spoken]\nIs everything all right in here?\n\n[ALL]\nYes, Nanny",
            "Goooooo bye bye",
            "All I remember is \"when your rooms looks kinda weird and you wish that you weren't thereeee\"",
            "Yes and it was a fun, cute show every Saturday morning!",
            "To this day this is what I think of when someone mentions Muppets."
        ]
    },
    "Best Buy ad circa 2001 ": {
        "title": "Best Buy ad circa 2001 ",
        "score": 235,
        "url": "https://www.reddit.com/gallery/1dlmic4",
        "content": "",
        "num_comments": 28,
        "comments": [
            "When Sony Trinitron Tv's weighed 300 pounds",
            "$2000 for 43\" of motion blur.",
            "My dad had one of those TVs, had to help him move it across three apartments up and down I dont know how many flights of stairs until sometime in the late aughts when I told him I was through with that shit and bought him a flat panel.  What a heavy piece of shit.  the viewing angle was like 4 goddamn degrees but my dads cheap ass just refused to get rid of it as long as it worked lol.\n\nI remember the last time I helped him move that thing he'd gone into a third floor walk up and when we got it up to his level, me thinking my heart was literally going to explode any second, he made some bitchy comment about me \"being too rough with it\" and I tell you, I came seriously close to pushing that fucking thing back down the stairs and him along with it.\n\nGod what stupid goddamn things those were.\n\nI kept my word, though.  Never did help him move it again.  He spent months trying to give that fucking thing away before he finally found some tweaker duo to come in and move it in exchange for getting to keep it lol",
            "Those big screen TVs had such terrible picture quality. My aunt and uncle owned one until several years ago, when they got money back for something and bought an HDTV with it",
            "Man this truly brings back memories for me. I remember standing in line to buy the Xbox. Also, totally forgot about how people used to be stereo sets like these.",
            "Aw man, I remember I used to buy the paper for these weekly ads.",
            "2001 Angelina was made to play Lara",
            "6GB hard drive. That's like an *update* for one game now.",
            "The OG Xbox controller though",
            "😭"
        ]
    },
    "Did anyone play House of the Dead as a kid? ": {
        "title": "Did anyone play House of the Dead as a kid? ",
        "score": 393,
        "url": "https://i.redd.it/ft8iexbqk08d1.jpeg",
        "content": "I remember always playing this game growing up. It was usually the very first game (and the last) I would go to every time I went to the arcade. The first time I played it as a kid, I was up almost all night 😂\n",
        "num_comments": 102,
        "comments": [
            "I was stuck at my cousins' endless hockey practice at some Ice Palace in South Carolina and my dad gave me like $10. It took every quarter, but I beat it and I will always remember that day. Awesome fuckin game.",
            "Man my brother and I would always play it when we got a chance. This and time crisis",
            "I don’t really remember the game but the logo definitely looks familiar and I did hit up a lot of arcade spots.",
            "I played it in the arcades back in the day but kinda sucked at it lol. That game was hard.",
            "Yep before going into the movie theater 😁",
            "Yes. I never met it very far though. I remember the opening fight areas so well",
            "Played the arcade version today!",
            "Played it at a pub with Rob zombie on the music box",
            "Yes! But more so the second one. Grew up playing House of the Dead on Dreamcast and Typing of the Dead on PC",
            "Hell yeah. Lil trick is to cover the front of the gun with your finger and shoot to instantly reload without having to shoot outside of the screen."
        ]
    },
    "KaBlam on Nickelodeon, which sketch was your favorite?": {
        "title": "KaBlam on Nickelodeon, which sketch was your favorite?",
        "score": 52,
        "url": "https://www.reddit.com/gallery/1dlt9hr",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Tie between Action League Now and Prometheus and Bob.",
            "Life with loopy never sat well with me, such an unsettling animation",
            "They’ve been codenamed; the Prometheus and Bob Tapes",
            "Snap me down!  It's Sniz & Fondue!",
            "Two words -\n\nStinky Diver",
            "Prometheus and Bob.",
            "TIL Mo Willems, author of “Don’t let the pigeon drive the bus” (one of my favorite children’s book authors/illustrators) was the creator/animator for the Off-Beats.",
            "Action league now hands down",
            "I see things like this and I wonder if I ever watched Nickelodeon at all. I have no memory of any of these",
            "He's super strong.... and super naked!"
        ]
    }
}