{
    "U.S. Politics Megathread": {
        "title": "U.S. Politics Megathread",
        "score": 14,
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/1do5gge/us_politics_megathread/",
        "content": "It's an election year, so it's no surprise that people have a lot of questions about politics.\n\nWhy are we seeing Trump against Biden *again*? Why are third parties not part of the debate? What does the debate actually mean, anyway? There are lots of good questions! But, unfortunately,  it's often the *same* questions, and our users get tired of seeing them. \n\nAs we've done for past topics of interest, we're creating a megathread for your questions so that people interested in politics can  post questions and read answers, while people who want a respite from  politics can browse the rest of the sub. **Feel free to post your questions about politics in this thread!** \n\nAll top-level comments should be questions asked in good faith -  other comments and loaded questions will get removed. All the usual  rules of the sub remain in force here, so **be civil to each other** \\- you can disagree with someone's opinion, but don't make it personal.",
        "num_comments": 389,
        "comments": [
            "Why doesn’t the televised presidential debate just have a fact checker on the screen? I feel like that would clear up a lot of confusion and prevent further lies being passed as “facts”",
            "Why haven't we put an age limit on Presidency? I think we can all collectively agree that both are way too fucking old.",
            "When it's two men debating, it seems like almost always one wears a red tie and one wears a blue tie. When there are multiple debates they don't necessarily stick with the same color, and yet it seems like the two candidates don't ever wear the same color. What's going on behind the scenes here?\n\nDo they bring two ties to the event and then the TV production people try to figure it out once they're there?",
            "Regardless of who gets elected, if the US president passes away, their VP just takes over for them, right?",
            "Why are there people think there are many people out there who sincerely see Homelander from The Boys as a hero and take such media so seriously as to say those people are stupid for not following some bad tv show's moral standards or for ironically reclaiming a strawman they made about such people?",
            "Is bodily autonomy a constitutional right?",
            "What happens if neither candidate survives to elections day? Both are over the life expancy in the town I live in in the UK",
            "Why do some people think Kamala Harris is \"such an embarrassment\"? I'm genuinely curious and completely blind to understanding this. Usually I can see both sides of most things. They say it like it's very obvious and requires no explanation.",
            "Can a candidate still resign and designate a different candidate? Did that already happen this late in the campaign? Or is there a point of no return at some point?",
            "I'm no fan of Biden, nor do I like Trump, but everyone seems to be overly critical of Biden in this debate. Do the Dems elites have someone in mind to replace him?"
        ]
    },
    "NSQ is looking for Mods": {
        "title": "NSQ is looking for Mods",
        "score": 21,
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/1dne5um/nsq_is_looking_for_mods/",
        "content": "Hi Everyone,\n\nNostupidquestions is always on the lookout for new moderators to help bolster the team and deal with the ever growing popularity of the sub (thank you by the way).\n\n[https://forms.gle/9pDBmuaZFbpWs6e37](https://forms.gle/9pDBmuaZFbpWs6e37) <- is an application form to let us know if you are interested in volunteering to join our team. \n\nWe are looking for active users of the sub who want to help keep this place true to its purpose and the content within the rules.\n\nPlease let us know if you have any questions, there are no stupid questions here",
        "num_comments": 29,
        "comments": [
            "Have the mods recently discussed the issue of posts that seem more appropriate for Ask Reddit?  I don’t need to know the conclusions, just whether they believe the issue is worth discussing periodically.",
            "Could I, as a mod, still post answers to questions with this account?  I would still like to contribute to answering questions.  But I can understand how an answer from a mod account could be given undue weight by anyone reading the thread.  I'd also worry that it may discourage other users from answering as well.  \"Well, the mod already answered the question so why should I bother giving my answer?\"",
            "Glad the sub’s most seasoned and aspiring users can participate in moderating it too now!",
            "Will I be paid to moderate these hornballs? ",
            "To add to petwins reply, a whole lot of them are bots.  I'd encourage people to check the post history of those making askreddit style posts, and if it looks like a bot, report it to us.  Not all askreddit style questions are bots, but a significant number are.  If we can get rid of the bot ones it would reduce them.",
            "Not the right place for this",
            "Absolutely, almost all of us do, you can toggle the green hat on or off.",
            "Absolutely, though I would note that every one of our existing mods were picked from very active/helpful members of the sub, and most are still currently active members answering questions.",
            "Time to build up some karma. It will take a while",
            "Gotta work your way up, protege "
        ]
    },
    "Can people actually “smell” sex on other people?": {
        "title": "Can people actually “smell” sex on other people?",
        "score": 3272,
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/1dqyyfg/can_people_actually_smell_sex_on_other_people/",
        "content": "I hear this a lot, that people can “smell” if someone just had sex, but I’ve NEVER experienced it. Even when I know for a fact someone just had sex I’ve never “smelt” it???? Is this real and I just can’t smell it or is this something people say because they’re paranoid or is it some type of “saying”? It’s been driving me crazy…….\n\nedit: yeah so i guess i just cant smell, thanks guys 😭 stupid useless nose",
        "num_comments": 828,
        "comments": [
            "I, too, do not have a sensitive nose. My partner on the other hand has literally pointed out when rooms smell like semen lmao.",
            "Depends on what kind of sex has been had, but it's real. I can generally smell \"it\", but there's no one \"sex\" smell. Sweat is a big one, but vaginal juices also have a distinct smell, as do semen, condoms, lube and a number of other sex things. If somebody smells like any combination of those it's pretty obvious what's happened, and the smell lingers in rooms too. If you can't place the smell or you don't know what something smells like, you won't smell it. You may also have a subpar sniffer so RIP",
            "Yes.  I can smell it on myself and on others.",
            "If it helps, there are also people who can smell ants 🤷 🐜🫠",
            "It smells like do it in here.",
            "Yes. Also my ex said after sex with a condom our room  smelled like a tire shop",
            "I've never had that happen. Maybe they got super smelling abilities.",
            "Yes. Jizz has a smell. Cooter juice has a smell. You can even smell it on animals. My dad had a good sense of smell and hated when my brother shot bucks during rut. I remember him yelling at my brother, \"You can dress it by yourself, because I told you not to shot a damn buck during rut, I'm not eating dear meat that I had to smell cum for two hours while I dressed it!\" \n\nHe wasn't kidding either. You could smell it.",
            "I can tell by smell if a woman is on her period.\n\nI haven't used it for its intended biological caveman purposes but, it's something i am aware of with women, which generally shapes my speech. I have Chrons, and while Periods are not the same, i am easily able to have empathy for suffering in silence to a very real source of continual discomfort where others cannot see it except for in mood or temper.",
            "I unfortunately have a super sniffer. Not only can I smell sex, but I can smell cigarettes, the food you've eaten and what soap you use. The absolute worst is I can tell from a mile away if you have showered/washed hair or not."
        ]
    },
    "Can the cashier tell immediately that I declined to give them a tip?": {
        "title": "Can the cashier tell immediately that I declined to give them a tip?",
        "score": 2163,
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/1dqv3vq/can_the_cashier_tell_immediately_that_i_declined/",
        "content": "I only tip when I eat at a restaurant. I don’t tip, say, Starbucks baristas for making me a coffee. I don’t see the point. But I’m also curious if they can see “Oh. Guess this dude’s an a-hole since he didn’t tip”",
        "num_comments": 1092,
        "comments": [
            "Today at a candy store the clerk said “just click skip on the question.” I found that very refreshing.",
            "They other day I denied a tip when I bought USED DRYER at an appliance store and the guy was like “oh I guess I didn’t do a good job” \n\nI’m like no it sounds like you need a better job.",
            "It takes a little tiny bit of mental math, but yeah, they know.",
            "Someone at a Domino's made a snarky comment as I walked out the door with my pizza that I didn't tip. Luckily I was hungry and kept walking. I drove five minutes just to not tip 🙃",
            "We really got to get rid of this damn tip shame in our culture.",
            "I had a kid the other day at Little Caesars probably about 18 years old guy tell me after I deny the tip he looked at me  in the face and said you know it's really hot and hard work back here to make these pizzas. ",
            "I have gotten fed up with the tipping \"culture\" or expectations to tip everyone.  My new rule is I only tip if I pay for my food AFTER I have eaten it.  I won't tip for an online purchase.  I won't tip for my coffee.  I won't tip at a fast food restaurant.  These employees are, by law, paid a full wage.  Even if that wage is minimum wage.  Wait staff are not paid even half of minimum wage. They live off tips. Good service=good tips.",
            "They can definitely see. I don’t hide the fact that I’m\nHitting no tip. Sorry but there’s no reason for me to tip if I’m ordering something directly from the menu and not alternating anything",
            "I was offended when I went to the vape store for my usual stuff and the debit screen asked if I want to tip.  It's gonna be standard when using a card machine one of these days.",
            "Fuck em. I’ve spent a lifetime in the hospitality industry and I’m with you. I tip generously waiters and bartenders. The rest need to speak to their boss. \nBetter an asshole than a sucka."
        ]
    },
    "Do you ever intervene when you see a parent in public mistreat their child? ": {
        "title": "Do you ever intervene when you see a parent in public mistreat their child? ",
        "score": 545,
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/1dr0lco/do_you_ever_intervene_when_you_see_a_parent_in/",
        "content": "I was walking through a store and hear this woman scream at her kid calling him a “brainless dumbass”. She sees me see her and suddenly quiets her tone. But the look on the kids face made me so sad. He quietly says to her “please don’t call me that” as he’s fighting back tears. Something about it made my blood boil. Poor kid looked helpless. What do you do in these circumstances? Mind your business? Or say something? ",
        "num_comments": 183,
        "comments": [
            "When I was a kid and my dad was verbally abusing me in a restaurant, someone tried to step in. It didn’t go well for him and he ended up leaving in frustration but I never forgot him. I didn’t feel alone or crazy anymore. It was one of the few times in my life as a kid that I felt validated that my dad’s treatment of me was not okay. So many other adults turned the other way, enabled my dad, or didn’t believe me.\n\nI understand not putting yourself in danger, and it doesn’t always work out or is appreciated. But in my case, I will never forget that guy as long as I live. It still means a huge deal to me that someone tried to protect me. And it gave me strength to get away from my dad eventually.",
            "I did once and the lady up and slapped me too",
            "Yes, I have. I watched two shitty parents use their baby and toddler like rag dolls trying to pose them for a photo. The toddler got frustrated and hit the baby. The dad walked right over and slapped the toddler across the face. He didn’t even cry. \n\nI told them to not hit their fucking kids. They told me to shut up and mind my own business. I said no way, you don’t hit kids, ever. I called them pieces of shit, they gathered their kids and left. I have never once regretted it, and I think of those babies often.",
            "I did once when I saw a woman physically abusing her son in a parking lot. I told her in no uncertain terms to stop hurting him and she did. I got her license plate number and called it in to the state child abuse hotline. They actually sent people out to check on the kids and called me back to let me know. \n\nI feel like not saying anything makes us all complicit.",
            "I remember this like yesterday. I was in a grocery store walking down the aisle toward a mom and a girl of about 3 in a cart. Suddenly she slapped the child in the face. I gasped and walked past them for a second. Then I turned back touched her arm and said quietly \"Please don't do that. I still have nightmares of my mother doing that to me.\" Then I walked away. (I was 40 btw.) I'm so proud of myself for saying something, and in a way it might have been received well.",
            "That’s tough. My mother was verbally abusive to me but managed to keep it at home. I wish someone had stood up for me though. My dad was often away on business and never really saw how bad, and how physical, it could get. I think standing up to a mother like that would be a good reality check. Folks are watching and actively judging you and feeling sorry for your kid.",
            "be present, just like you were. the lady shamed herself when she realized she wasn't alone. but speaking up may lead to conflict and if you aren't ready to handle it, don't. just be present. you being there probably gave that kid the courage to speak. sometimes that's all you can do.",
            "I have done it twice. Once, a dad in a store was screaming at a little girl that she couldn't use the nearby bathroom as it was inconvenient to him. She was clearly desperate.  I offered to take her, pretending his concern was her entering alone. He was quite rude until I showed him my Deptartment of Social Services ID to \"show him I was trustworthy.\" He settled right down, and I took her in. \n\nAnother time, at a grocery, a mom was getting angry, shouting at and hitting her child. I just started a casual conversation with her about how hard it is to shop with kids, and it seemed her little one was tired and hungry.  She regulated herself and seemed calm when I left.",
            "I worked at a domestic violence program in the late 90s. I was told public confrontation could lead to worse abuse at home, not in public. As an abused child, I would have given anything to have had someone take my side even just once.",
            "I don’t only because saying something in those situations has the tendency to make it worse for the kid once they get home. It’s heartbreaking though."
        ]
    }
}