{
    "We are looking for new moderators": {
        "title": "We are looking for new moderators",
        "score": 22,
        "url": "https://www.reddit.com/r/nostalgia/comments/1bjeqcg/we_are_looking_for_new_moderators/",
        "content": "[Link to the Form](https://docs.google.com/forms/d/e/1FAIpQLSeANMvIcunWxhzJ6Q4JAyfVU3NWJj3Zj_O3uwJ3jjYW5yYTwg/viewform?usp=sharing)\n\nPlease use the above link if you wish to throw your name in the hat. Also, please comment in this post to let me know the link is working.",
        "num_comments": 13,
        "comments": [
            "What's the deal with being a moderator? You have some sort of digital privileges? Get paid? Legit questions I'd need to know before throwing my name \"in the hat\".",
            "Doc link appears to be working.",
            "I used to mod for r/Danger5 but this was before the app\n\nKind of niche but I helped redo the logo and more if you're interested",
            "are applications actually randomly selected?",
            "Yes the link to the form is working!",
            "Be honest; you aren't. You're looking for old moderators that you haven't seen in years, but you remember fondly.",
            "In case you are still keeping track, the link still works!",
            "“Your response has been recorded”. Now we wait",
            "I can help.  I write bots and help moderate other subs.",
            "Did you receive my submission?"
        ]
    },
    "Do you have a comfort show from the 90s or early 2000s or am I just weird?": {
        "title": "Do you have a comfort show from the 90s or early 2000s or am I just weird?",
        "score": 625,
        "url": "https://i.redd.it/opg4qgoj2f9d1.jpeg",
        "content": "Mine happens to float between Everybody Loves Raymond and Roseanne (the original)",
        "num_comments": 415,
        "comments": [
            "Seinfeld, Frasier, Friends, I also used to love season 1 of Caroline in the City and Blossom!",
            "King of the Hill ❤️",
            "It's hands down Malcom in the middle for me. It's my favorite sitcom ever, it even got better when I re-watched it when I was an adult.",
            "Raymond and King of Queens.",
            "Used to be The Wonder Years",
            "King of Queens for me!",
            "Home Improvement was my fave!",
            "ReBoot.\n\n....well pretty much almost any show I grew up with actually. >\\_>",
            "I like watching old talk show clips from those days, like Letterman and Conan and Tom Snyder.",
            "frasier is the one for me"
        ]
    },
    "That's right .... One Hundred Megabytes!": {
        "title": "That's right .... One Hundred Megabytes!",
        "score": 41,
        "url": "https://i.redd.it/ypyv5ntu6i9d1.jpeg",
        "content": "",
        "num_comments": 14,
        "comments": [
            "It was huge for its extremely short lifespan",
            "Iomega? <takes drag off cigarette> now there's a name I haven't heard in a long, long time...",
            "I still have mine with an old design portfolio on it. But the files are probably unreadable at this point. Is dreamweaver still a thing?",
            "My Compaq Presario (windows 98) showcase this new technology.",
            "I don't like to brag, but I had a 250 mb drive. I still do, actually.",
            " There was a second gen zip disk that followed that held 250 mg.  I bought it just in time as Napster became a thing and my university had pretty fast cable internet.",
            "I preferred their rival, the LS120. The drive could also read and write to generic 1.44 floppies.",
            "80 bytes per card, box of 5000 cards held 400K bytes roughly.",
            "The successor to this was the zip 250.",
            "Click click boom"
        ]
    },
    "Principle Kraft. RIP Martin Mull": {
        "title": "Principle Kraft. RIP Martin Mull",
        "score": 371,
        "url": "https://i.redd.it/rideee09ke9d1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "Great actor and he gave Roseanne balance.",
            "Aw man, someone offed Colonel Mustard",
            "Principal. He'd be disappointed you didn't get the spelling correct.",
            "Barth Gimble.  He was awesome and he and Fred Willard were great together.",
            "\"what are you, a cop?\"",
            "Yeah? Are you gonna make it all 220?",
            "One plus two plus two plus one",
            "His breaking the fourth wall with all the bad guests on his show cracked me up.  He'd just look at the camera like \"you see what I have to deal with?\"",
            "220… 221… whatever it takes.",
            "Gene Parmesan‽"
        ]
    },
    "“What Dreams May Come” (1998)": {
        "title": "“What Dreams May Come” (1998)",
        "score": 249,
        "url": "https://i.redd.it/alizar6d7f9d1.jpeg",
        "content": "*That's when I realized I'm part of the problem. Not because I remind you. But because I couldn't join you. So I left you alone.*",
        "num_comments": 54,
        "comments": [
            "When i say this movie WRECKED ME 🥺🥺 i think i cried for days after....and i still will not rewatch it. I...i just cant.",
            "This movie is actually underrated.",
            "One of my favourite Robin Williams’ lead roles.",
            "I've never understood how this movie didn't do any better than it did.  It's simply amazing, and so well written, and Robin's acting is top notch.",
            "The most visually stunning movie ever. Emotionally strong, too. It has so much, tragedy, comedy, drama, and adventure. I'm someone who suspends their disbelief and gives themselves over to the director, and this movie took me to places I had never imagined.",
            "part of this was filmed near my reservation. my dad got to meet Robin Williams.",
            "Such a hauntingly beautiful movie. One of my favorites.",
            "I’ll never watch this movie again. It’s that good.",
            "First saw this movie when I had been awake for something like 36 hours straight.  Trippy as fuck at that point.",
            "Anne belle Sciorro(?) was just beautiful from start to finish. So vulnerable it made my heart ache for her character. Sorry if I butchered her name"
        ]
    }
}