{
    "Just To Clarify:": {
        "title": "Just To Clarify:",
        "score": 107,
        "url": "https://www.reddit.com/r/NotHowGirlsWork/comments/1b5gntc/just_to_clarify/",
        "content": "**This is not a meme subreddit.**\n\n Lately, almost every other post has been \"Off-Topic or Irrelevant\" relating to the submission guidelines, and not within standard as what actually qualifies (as an example) of \"Not How Girls Work\". \n\nQ: \"**What is \"Not How Girls Work?**\":\n\nA: \"_\"Not How Girls Work\" is when people make sweeping generalisations about \"all women\",  _or_ make any baseless assumptions or conclusions about a specific woman based off of their misguided assumptions of \"all women_\". \n\n**_This does not include low-effort memes, \"Bad Women's Anatomy\", or clips of podcasts/posts from \"Manosphere\" public figures_**.\"\n\n\nThis platform is slowing being derailed into posts consisting of any random meme that remotely mentions a girl or woman, or screenshots of Twitter posts from Red-Pill Manosphere public figures who purposely grift and make money using those talking points. People are also trying to pass off completely irrelevant posts as submission, thinking if they just mask it by putting \"That's not how [insert topic] works\" in the title, it will be valid— That's not how this subreddit works (no pun intended). You can't force posts to fit if they don't.\n\n#Please read the subreddit description. \n\nIf you have to put \"Not sure if this belongs here\" in the title, it probably doesn't. **Please read the subreddit rules and the subreddit description _first_**, then clarify with the moderators if you are still unsure. \n\nI understand this is a large subreddit, therefore the temptation and karma-count is there to post any and everything, but the subreddit will start cracking down on users who continuously post completely \"off-topic\" content after warnings.\n\nThank you!",
        "num_comments": 12,
        "comments": [
            "I'm genuinely glad to see mods putting their foot down on this. So many subs have devolved into \"just post memes\" even when the sub has a specific topic or scope. First they post related or semi related memes, then they just start posting anything while trying to give it a title that is really stretching to make it seem on topic, and then finally it just becomes another \"just post anything\" subreddit where the only posts the mods remove are the ones asking to stop posting non-stop memes.",
            "thank you so much for this, now if we can just get people to check back to make sure what they want to post wasn't already posted 5 min ago lol.",
            "Question! I know some subs like this allow the equivalent of eye bleach, and I wanted to post a guy who ACTUALLY knew how women worked, so would I be allowed to? (Context: A teenager being quizzed about period stuff and acing it)",
            "Yes, this has been getting _waaay_ out of hand! It's at the point now where it's super transparent that they are doing this to karma-farm.\n\nI'm trying very hard to keep the off-topic posts in the garbage where they belong, it's derailing the subreddit and the space we created.",
            "\"Period stuff\" falls under \"Bad Women's Anatomy\", so it would probably be better suited there :)",
            "Kay! I'll check there :3",
            "As you're all aware, this subreddit has had a major \"troll\" \nproblem which has gotten worse (as of recently). Due to this, we \nhave created new rules, and modified some of the old ones.\n\nWe kindly ask that you please familiarize yourself with the \nrules so that you can avoid breaking them. Breaking mild rules \nwill result in a warning, or a temporary ban. Breaking serious \nrules, or breaking a plethora of mild ones may land you a \npermanent ban (depending on the severity). Also, \ngrifting/lurking has been a major problem; If we suspect you of \nbeing a grifter (determined by vetting said user's activity), we \nmay ban you without warning.\n\nYou may attempt an appeal via ModMail, but please be advised not \nto use rude, harassing, foul, or passive-aggressive language \ntowards the moderators, _or_ complain to moderators about why we \nhave specific rules in the first place— You will be ignored, and \nyour ban will remain (without even a consideration). \n\nAll rules are made public; \"Lack of knowledge\" or \"ignorance of \nthe rules\" cannot or will not be a viable excuse if you end up \nbanned for breaking them (This applies to the Subreddit rules, \nand Reddit's ToS). **Again: All rules are made public, and \nReddit gives you the option to review the rules once more before \nsubmitting a post, it is your choice if you choose to read them \nor not, but breaking them will not be acceptable.**\n\nWith that being said, If you send a mature, neutral message \nregarding questions about a current ban, or a ban appeal \n(without \"not knowing the rules\" as an excuse), we will \nelaborate about why you were banned, or determine/consider if we \nwill shorten, lift, keep it, _or_ extended it/make it permanent. \nThis all means that appeals are discretionary, and your \nreasoning for wanting an appeal must be practical and valid.\n\nThank you all so much for taking the time to read this message, \nand please enjoy your day!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NotHowGirlsWork) if you have any questions or concerns.*",
            "Yessssss! Thank you!",
            "That too lol"
        ]
    },
    "This is literally the discription of a slave": {
        "title": "This is literally the discription of a slave",
        "score": 186,
        "url": "https://www.reddit.com/gallery/1dr9k23",
        "content": "",
        "num_comments": 22,
        "comments": [
            "Funfact...all this servitude does not even get women some nice boons in afterlife, just more servitude.🙄",
            "Its worse. Slave doesn't have to be content.",
            "Brought to you by the same people who lead the UN womens right council",
            "Ok, I have one question about the logistics. If she is to avoid places like markets and stuff, but she is obligated to keep the household running... Does the household do not need food, cleaning and personal hygiene supplies? If the husband to be unburdened of menial housework, who takes care of grocery shopping?",
            "This guy had major pysch issues, clearly, yet is followed thousands of years later under the guise of ‘religion’. Eeeeeeeeeeeew.",
            "Also, those are the same men that rely on the income she needs to provide in addition to managing the household, in order to be finantially stable",
            "I feel like this guy would not have liked Khadija, the Prophet Muhammad's first wife. I am pretty sure my world religions professor said  she was a wealthy businesswoman who hired him and proposed to him first.",
            "Religion is just kink without consent for the ones who get all the benefits.",
            "So, she should basically not exist and when she does it’s to only be a slave? No thanks.",
            "As a Muslim wtf did I just read?"
        ]
    },
    "Just stubbled into this community.... What do they mean consent doesn't apply to this CHILD": {
        "title": "Just stubbled into this community.... What do they mean consent doesn't apply to this CHILD",
        "score": 1163,
        "url": "https://i.redd.it/vq4sq3lwxd9d1.png",
        "content": "The comments are horrendous.. why does reddit allow this? ",
        "num_comments": 134,
        "comments": [
            "Hope the police have them on a watch list.",
            "I'm totally lost on the context. Isn't a child's consent irrelevant because it would be considered rape regardless of whether you had it?\n\nOr are they saying that they plan to SA her?",
            "So how does one gather the evidence and usernames to report them to the police... I want to see those disgusting fuckers rot in prison.",
            "no consent does not apply to this child !!!\n\nANYTHING SEXUAL WOULD BE RAPE AND PEDOPHILIA !!!!!!",
            "Oh good, another \"jailbait\" cesspool. How fucking disgusting.",
            "so we are collectively reporting them right? because this is disgusting",
            "I was muted for making a comment about my opinion on a certain breed of dog.  That was considered “against community standards” or whatever.  But this kind of shit is allowed.",
            "Any way to report this to reddit or mods or anything?",
            "Ew.  She look# like she is in middle school",
            "If you're gonna repost screenshots of stuff like this, please blur the child's face."
        ]
    },
    "🤦🏻‍♀️ I’m so tired": {
        "title": "🤦🏻‍♀️ I’m so tired",
        "score": 85,
        "url": "https://i.redd.it/qle6fbbb44f81.jpg",
        "content": "",
        "num_comments": 41,
        "comments": [
            "As a guy I confirm I don't understand this picture.",
            "I had this explained to me in another sub. It’s the way her hair looks. Apparently the right one looks nasty, and the left is a better example of the look she was trying to achieve.",
            "So… the only difference is the girls hair is brushed in one of the pics ?",
            "I don't understand this meme, does that mean I'm a boy?",
            "Seen enough drama videos to think I might get it? Many times happens that guy's cheat with girls that looks pretty much like their actual girlfriend. I think it's that, might be wrong, tho.",
            "I don't get it bruh",
            "I think it is you vs you after an expensive hair treatment that you rarely do because it takes so long, last nothing and is pricey? So like only for a wedding or a special event xD",
            "For those who didn't get it-  the  woman implies that men cheat on women that are worse looking  than their main woman. The brushed stylized look is more desired than the tight fresh curls.\nOn the other hand this is sooo r/notliketheothergirls.",
            "The one on the right is the curls completed like a before. The one on the left is with the curls “brushed out” ie broken up so it looks more natural. I leave mine like the right pic and just let life turn it to the left.",
            "Do they mean that \"all girls are the same\" here?"
        ]
    },
    "Men’s Rules- Found in the wild": {
        "title": "Men’s Rules- Found in the wild",
        "score": 1840,
        "url": "https://i.redd.it/blp76fm56d9d1.jpeg",
        "content": "",
        "num_comments": 377,
        "comments": [
            "Christopher Columbus did very much need directions",
            "actually this is peach\n\n![gif](giphy|fVSR39v1604ec|downsized)",
            "‘A headache lasting 17 months’… well, if you understood that she’s allowed to not be in the mood, then she wouldn’t have to do so. And based on your list, I can’t blame her having a real headache dealing with you…",
            "This man’s got some strict rules for his imaginary girlfriends 😨",
            "Anything you said six months ago may establish a pattern of conduct or thought process. So more probative than prejudicial? Objection overruled. \n\nLearned some fancy schmancy phrases on television 🤣",
            "If women made an identical list of cliché, condescending, \"I'm right, you're wrong, end of discussion\" women's rules, it would immediately be shared around this same group of men to be thoroughly mocked as \"see, women are insufferable and impossible to deal with!\"",
            "They spout this kind of nonsense, then when we decide that actually we are content being single, they whine about “men’s loneliness epidemic” and “men’s mental health”.",
            "Christopher Columbus didn't lend anywhere close to where he was intending. A map might have been useful.",
            "Women always need the seat down, and men need it down every time they take a crap, so if the majority of the \"in use\" time is with the seat down, the default position should be down. \n\nAlso you should be closing the lid when you flush anyway, or you're just spraying a fine mist of toilet germs all over your bathroom",
            "Why are they all numbered 1?"
        ]
    }
}