{
    "👋🏾 A Welcome to a New Chapter for r/Notion, from Mr. Wildenfree": {
        "title": "👋🏾 A Welcome to a New Chapter for r/Notion, from Mr. Wildenfree",
        "score": 202,
        "url": "https://www.reddit.com/r/Notion/comments/1c6azop/a_welcome_to_a_new_chapter_for_rnotion_from_mr/",
        "content": "https://reddit.com/link/1c6azop/video/8vw79fhx7yuc1/player\n\nPeace & Blessings, r/Notion!\n\nAllow me to reintroduce myself, I’m Mr. Wildenfree! A community moderator here in the Notion subreddit.\n\nI have recently been given the privilege & responsibility of stewarding this community for the foreseeable future. In this introductory video, I wanted to share a few words about what you can expect, along with a healthy encouragement for you all to share your feedback here on this post.\n\n***What to Expect:***\n\n* Reasonable consideration on your feedback about how r/Notion can improve\n* Transparency on what changes or decisions we might make moving forward\n* Ideally, a renewed sense of excitement & value being shared here within our community and amongst one another.\n* NO mod interference on talks about any leaks from Notion\n   * I took it upon myself to get clarity on this, and I will take accountability for the previous discussion on Notion Calendar being hushed, but you all no longer have to worry about that from here on out. After speaking to head of Community at Notion, I can resolutely state that the Notion team had never sought to request, encourage removal of or interfere with the community talks about the platform leaks.\n   * EDIT — I have published a separate, [**Clarifying Statement about Leaks here**](https://www.reddit.com/r/Notion/comments/1c74jxp) & down below.\n\nTruly, it is my hopes that with an open ear to your feedback & a nudge in the right direction, this subreddit and the individuals within can truly reap the rewards of having such a large community to lean on.\n\n***Some ideas we can try to achieve that:***\n\n* **AMA Sessions** — to ask your top voted creators\n* **Industry Flairs** — for finding others in your niche\n   * EDIT — I started working on the draft for Industry Flairs, and [**have a question**](https://www.reddit.com/r/Notion/comments/1ca1gxk) for you all.\n* **Opportunity Flairs** — for those open to work & those seeking it\n* **Monthly Community Contributions** — a collaborative service to help organize Notion finds for one another! (One example could be contributing to a database Full of Notion Gems & build tricks, amongst other things!)\n* **Community Polls** — for gauging feedback & gathering opinions, and thoughts on best practices\n* **Recognition** — implementing a way to better recognize community contributors & rewarding them in some way (TBD)\n\nWith that, I and my fellow Moderators are looking forward to hearing your thoughts on all of this.\n\nLet us discover together, a way to nurture genuine value & reciprocity here, while creating more avenues for us to learn, share & inspire one another.\n\nAll the Best,  \nMr. Wildenfree 🐺🍵🎵  \nu/mrwildenfree  \nCommunity Mod",
        "num_comments": 92,
        "comments": [
            "Ayyy I like where this is going! Congrats Mr. Wildenfree ![gif](emote|free_emotes_pack|sunglasses)\n\nI'm fairly new to this particular community, and I've been enjoying the experience so far, excited about the future!",
            "AMA with people from the notion team would be fantastic!",
            "Fantastic!  Its great to see a juman face behind a moderator.  I love how you are being proactive.",
            "Im here because I love Notion and use it every day and I enjoy learning more about it and how others use it.",
            "Create a monthly \" bugs & glitches \" thread for Notion users to share any issues or problems they've encountered with the platform.",
            "Congrats bro! Love the community and excited to see what you are bringing here for everyone. Lets get em hustling on offline mode now haha",
            "Roam/Tana inspired backlinks  to blocks instead of pages only, as well as unlinked backlinks. ",
            "I love the **Industry Flairs** idea. As a worker at a nonprofit, I find a lot of other people's uses aren't applicable for what I need.",
            "I am a new notion user. Love that you shared a video. Thanks for bringing a human touch here. I am not sure if I saw a beginners area here for new notion users... If so please point me in that direction. If not, that would be helpful.",
            "How about one weekly topic, where ppl can bitch about offline mode, instead of 20 new topics every. single. day."
        ]
    },
    "Self-promo & Showcase — Promote your Notion content here!": {
        "title": "Self-promo & Showcase — Promote your Notion content here!",
        "score": 2,
        "url": "https://www.reddit.com/r/Notion/comments/1doy1lt/selfpromo_showcase_promote_your_notion_content/",
        "content": "**Hello fellow Notioners!**\n\nAs outlined in rule 4 for this subreddit, we strictly prohibit self-promotion in this subreddit. That's why these threads exist! Feel free to post **your own content** — paid or not — down in the comments.\n\n*This is a scheduled post, it will appear every second Wednesday at 14:00 GMT.*\n\nPlease remember to always read the [rules](https://www.reddit.com/r/Notion/about/rules) before posting. Thanks!",
        "num_comments": 31,
        "comments": [
            "Looking for a notion certified consultant??? Well I am here for you. If you have any questions or enquiries feel free to reach out.",
            "I built a demo site for my AI-Powered Table Generator using Notion Site:[https://tabulator-ai.notion.site/Chronicles-of-Gearhaven-616bcfd7d6714288adb3b72733072b4a](https://tabulator-ai.notion.site/Chronicles-of-Gearhaven-616bcfd7d6714288adb3b72733072b4a)\n\nI used ChatGPT to craft a steampunk story and then transformed parts of it into demo tables complete with text and images.",
            "More examples of my work:\n\nhttps://preview.redd.it/tt7e4j4zzw8d1.png?width=4320&format=png&auto=webp&s=2f19f9602a26e42bb2187a712d4aae947586f9fc",
            "# Notion Style Avatar Profile Picture of You (3rd Anniversary SALE)\n\nHello Notioners,\n\nI can create a Notion styled icon of you. Refer to my profile picture or this [post](https://www.reddit.com/r/Notion/comments/icpu7g/i_made_a_notion_styled_picture_of_myself/) to get an idea of what it is. Maybe if you've seen [my post on Ali Abdaal](https://www.reddit.com/r/Notion/comments/kltoiy/a_tribute_to_ali_abdaal_the_person_that/), you'd be familiar to it.\n\nIt has been 3 years since I've been doing this and I've had clients from all over the globe from this subreddit. To commemorate my 3rd anniversary, I'll be launching my official store and my product will be on a discounted price. It will entitle you to a $5 off for your purchase.\n\n[To order, head on to my website and for a discounted price, do use the code \"ANNIVERSARY\" upon checkout.](https://frdspuzi.com/) For any inquiries or issues faced when ordering, my email is provided there.\n\nThanks! Looking forward to working with you :)\n\nhttps://preview.redd.it/v9bbbervzw8d1.png?width=1919&format=png&auto=webp&s=a763ec819ce697bc85366f7c6760956981068f7e",
            "Aesthetic all in one student notion template \n\nOrganize your student life seamlessly with our comprehensive template. From tracking your music, films, and reading list in a cozy lounge to visualizing your dreams on a vision board, we've got it all covered.\n\nEstablish daily habits, pour your thoughts into a journal, and manage your classes effortlessly with the student dashboard. Store resources, create class notes, and plan your exams on the go. Stay ahead with our agenda page, where assignments are never missed.\n\nhttps://preview.redd.it/198lailfyz8d1.jpeg?width=1920&format=pjpg&auto=webp&s=aa501396ffb84b8a642db9e54fa2dc7c90c555c7\n\nCan get [here](https://linktr.ee/studyhub101) today!",
            "https://preview.redd.it/ndzcymxr4x8d1.png?width=440&format=png&auto=webp&s=c9442873c852e5c44cf794cc1be8e59ece23981f\n\nCheck out[https://linkyourfile.com](https://linkyourfile.com/)to connect your local files with Notion.   \n  \nCreate simple clickable links to your files and folders on mac or windows and paste them into Notion. It also works with network drives or cloud provider folders like Dropbox or Google Drive.",
            "# Recently launched  Health OS Template\n\n# [Exclusive Reddit Discount: 60% OFF for the first users]\n\nhttps://preview.redd.it/o5i594x68x8d1.png?width=3699&format=png&auto=webp&s=5015e5f358aeeccb1eb9f9459b8545dea3a4b7a4\n\nCheck it out here:[https://www.notionpeak.com/](https://www.notionpeak.com/)\n\nSneak Peek Video:[https://www.youtube.com/watch?v=1t40c76CXbU](https://www.youtube.com/watch?v=1t40c76CXbU)\n\n\n\nHi all, it's finally here!! :) Many of you asked me about the template after I posted it here a few weeks ago.\n\n**Health OS**: Transform the way you plan and manage your life with (dare I say) one of the*most powerful*Notion templates out there.\n\nSimply download it, explore it, and customize it to your needs (instructions included).\n\nPS. I also decided to give a special discount to the Reddit community for your awesome[feedback](https://www.reddit.com/r/Notion/comments/1cwj6wv/my_personal_health_hub_got_feedback/).",
            "#  CALLING EVERYONE WHO WANTS A MEAL PREP + WORKOUT PLANNER \n\nComes with a Meal Planner, Workout Scheduler, Supplement Tracker + more. It's also 25% off right now!\n\nCheck it out:[https://ahloecreative.etsy.com/listing/1537278479](https://ahloecreative.etsy.com/listing/1537278479)\n\nhttps://preview.redd.it/io63yrtxox8d1.png?width=2000&format=png&auto=webp&s=df56ed7dedac772d66ea6dac978563c64e81dc6c",
            "#  CALLING EVERYONE WHO WANTS A CLEAN + ORGANIZED HOME DASHBOARD \n\nComes with a Declutter Dashboard, Daily Tidy Up Tracker, Home Projects Tracker + more. It's also 25% off right now!\n\nCheck it out:[https://ahloecreative.etsy.com/listing/1551592625](https://ahloecreative.etsy.com/listing/1551592625)\n\nhttps://preview.redd.it/k1pn5xs8px8d1.png?width=2000&format=png&auto=webp&s=2e5e677a17e84411de9f31bcbe025361dbc7a7c0",
            "#  CALLING EVERYONE WHO WANTS AN ORGANIZED LIFE \n\nThis bundle comes with a Nutrition + Fitness Planner, Budget Finance Tracker, Clean Household Planner, Daily Agenda + more. It's also 25% off right now!\n\nCheck it out:[https://ahloecreative.etsy.com/listing/1559446223](https://ahloecreative.etsy.com/listing/1559446223)\n\nhttps://preview.redd.it/px4kyivdpx8d1.jpeg?width=2000&format=pjpg&auto=webp&s=4f69e59a7b5d97d646e6cd48e02653b1b22ba6b9"
        ]
    },
    "Simple way to add tasks?": {
        "title": "Simple way to add tasks?",
        "score": 1,
        "url": "https://www.reddit.com/r/Notion/comments/1drai2v/simple_way_to_add_tasks/",
        "content": "Hello everyone\n\nI love my tasks management in Notion and how I can connect it with other databases. However, I find adding tasks a bit tedious on mobile, and not so user friendly. \n\nI have added buttons, but still, adding a task involves a process that I think I would use more efficiently if it was more simple. \n\nWhen I click the task widget I made for Notion, it loads my whole task database which takes a while. Then I have to click a button that sets on some part of the page. Then I have to click all the fields that I want to fill out. The whole page may look pretty good on computer, but it does not look good on mobile. Difficult to gain overview. \n\nI love how the apps Todoist, Things or Omnifocus or others look in terms of organization. But none of them are able to fill these criteria: \n\n- Full sync back and forth (including a few custom fields in Notion like due date, status, priority, and area). \n\n- No subscription needed\n\nCan anyone help here? I just want to be able to conveniently add tasks. What did you do?",
        "num_comments": 1,
        "comments": [
            "You're right. Task inputs on mobile are generally trash. My workaround was build a very simple list view of the dB on a page named \"mobile\" filter for only \"input today\". You still have to do the page click through, but you can at least get to the input page. Just my thoughts. Would love notion to make a simplified app that would be great for task management, but that's probably not in the cards for a while. I'd bet we get add task through Ai chat before that... Shit that might already work. Never tried that."
        ]
    },
    "How do I work with several pictures?": {
        "title": "How do I work with several pictures?",
        "score": 1,
        "url": "https://www.reddit.com/r/Notion/comments/1dra4it/how_do_i_work_with_several_pictures/",
        "content": "[What i want](https://preview.redd.it/z3v28cms7i9d1.png?width=557&format=png&auto=webp&s=482e4749521e44a53efa7f70d613853f3b236289)\n\n[What i get ](https://preview.redd.it/56g5vmfx7i9d1.png?width=565&format=png&auto=webp&s=7d5ae0742c3bfca5e5d260af148ccdcc4ec4935d)\n\nCould someone please help on how i can make several pictures looks nicer together as a collage (remove huge blanks between). Maybe there is a template for it?",
        "num_comments": 0,
        "comments": []
    },
    "Notion Mail soon?": {
        "title": "Notion Mail soon?",
        "score": 13,
        "url": "https://www.reddit.com/r/Notion/comments/1dqwe2h/notion_mail_soon/",
        "content": "[app.mail.dev.notion.so](http://app.mail.dev.notion.so)\n\nhttps://preview.redd.it/vmc7uush4e9d1.jpg?width=612&format=pjpg&auto=webp&s=49dad1389efcaab214629a0056881d25c36fb925\n\n",
        "num_comments": 14,
        "comments": [
            "I can't help but feel like there are so many small, simple features that would be really nice to see implemented. Text alignment, typeface point size, automated notifications (without goofy workarounds like I use right now), to name just a few\n\nBut yeah, this will be cool. It looks like notion is pretty heavily invested in building up their enterprise-all-in-one suite for the time-being.",
            "I'm hoping it doesn't detract too much from Notion.\n\nThere's so many features I want added to Notion it's unreal. There's already so much competition in the e-mail space, but there really isn't something that competes with Notion on what I like. So if it costs 0 focus for them great.",
            "I honestly hope this is a direct competitor to Google Workspace. I knew this was coming with the skiff acquisition. I'm excited for the future, I hope they don't screw it up.",
            "Please just give us offline mode first!!!!!",
            "Yes, they acquired Skiff recently.",
            "The idea of notion mail is pretty interesting to me. Weve used slack and variants over the years to communicate in real-time but the ability to talk inside Notion would mean one less app for my team to have to check",
            "Would love to see them just focus on improving Notion.",
            "Id rather see improvements to the core database offering over superficial stuff. Imagine if you could filter the options that appear in a relation property depending on a property on the other database. Or rollup a rollup. Or property inheritance on templates + automations. Or the ability to put properties into groups, and have different properties show on different templates rather than the bullshit for every page on this database setup they have right now. Or the ability to create merged database views anywhere in your workspace, not just on your home tab",
            "Hahaha, you must be new to notion to believe it will come one day    \nIf you still believe it, then you deserve Notion. Giving up you data sovereignty to them.   \nOtherwise, go check app alternative like Anytype ;)",
            "To be a full productivity suite I feel. Email seems like the last missing thing"
        ]
    }
}