{
    "[Mod Post] We are doing some re-organizing of the subreddit to better fit the current community's needs. This will include rule changes amongst other - We will keep you updated as we proceed!": {
        "title": "[Mod Post] We are doing some re-organizing of the subreddit to better fit the current community's needs. This will include rule changes amongst other - We will keep you updated as we proceed!",
        "score": 0,
        "url": "https://www.reddit.com/r/notliketheothergirls/comments/1dlpsnr/mod_post_we_are_doing_some_reorganizing_of_the/",
        "content": "Our [WIKI](https://www.reddit.com/r/notliketheothergirls/wiki/index/) has already been touched up and contain the most relevant information. We strongly advice everyone to familiarize yourselves with the content therein.   \n\n[Rules](https://www.reddit.com/r/notliketheothergirls/wiki/rules/rules-descriptive/).\n\n[Ban regulations](https://new.reddit.com/r/notliketheothergirls/wiki/bans/).\n\n[Ban Appeal guidelines](https://new.reddit.com/r/notliketheothergirls/wiki/appeals/).",
        "num_comments": 0,
        "comments": []
    },
    "My niece is awesome": {
        "title": "My niece is awesome",
        "score": 1102,
        "url": "https://www.reddit.com/r/notliketheothergirls/comments/1dl2f8c/my_niece_is_awesome/",
        "content": "My niece is 15 and quite outspoken. She recently was approached by a male classmate who told her how cool she was cuz shes not like the other girls. he then went on to say she was specifically better than 2 girls and named them. \n\nmy niece responded with: \"but i like those girls. i think theyre nice!\" i thought it was a perfect response! shes awesome!",
        "num_comments": 70,
        "comments": [
            "I hope we can all be girls like this some day",
            "I never understood how the \"you are not like other girls\" was a compliment. You comparing me to someone and demeaning them wont exactly make me feel better.",
            "Honestly, I volunteer with girls 8 to 17 and I feel like, given my experience with them, these baby GenZ and Gen Alpha girls are going to eliminate the NLOG. I over heard two of them talking about a guy one of them liked \"and then he said he liked me because I wasn't like other girls...\" \"ew who says that!\" \"Right? so I said maybe he should date boys because I'm a girl like other girls.\" This is a 15 year old talking about a boy she had a crush on trying to use NLOG tactics on her as a compliment and she BURNED HIS ASS. (Not that being gay is a burn, and I don't think this kid would think of it that way, we have a variety of sexual curiosities going on as they hit puberty, but the way she turned it on him is the burn).",
            "I caught some boys trying this one on the other day in my classroom.\n\nThey getting this advice from Titkok or Andrew Taint or some shit? 🙄",
            "males always try to turn women and girls against each other ... Your niece is awesome",
            "Um, are you my sister? I just had a conversation about my 15-year-old daughter with my sister and it was exactly like this.",
            "When I was around 16, I told one of my male classmates that I'd found some anime figurines in a department store. He responded that he likes that I'm not a \"stupid girl\" who just goes to department stores to buy clothes. This was in front of my female friend at that time who very much liked shopping for clothes, so I told him that there's nothing stupid about wanting to buy clothes, it's just as valid as a hobby as collecting figures (and I do both now! Love me some vintage fashion) and the way my friend's eyes lit up when I said that is something I still remember 10 years later. Putting girls down for stereotypically \"girlish\" hobbies and interests is so ew.",
            "We love a girls girl 🩷",
            "Give her the ‘I am the amalgamation of every single girl I’ve ever thought was cool’ quote to stick in her back pocket. I whip it out frequently to point out nearly every single “unique” thing about me is brought to you by Girls.",
            "I love that she already knows this at her age!"
        ]
    },
    "About had it with the daily mod post. ": {
        "title": "About had it with the daily mod post. ",
        "score": 43,
        "url": "https://www.reddit.com/r/notliketheothergirls/comments/1dlbpm8/about_had_it_with_the_daily_mod_post/",
        "content": "It's spamming at this point. An every day post about changes takes away from the sub and serves no purpose at this point. ",
        "num_comments": 14,
        "comments": [
            "I keep thinking I'm in trouble with the mods somehow lmao 😅",
            "“Please listen to the following menu as our options have recently changed”",
            "I literally messaged the mods to ask them to stop spamming it and it went ignored",
            "Is the \"ban regulations\" site still down?",
            "It's so easy to just ignore it",
            "Yeah, you done fucked up and the mods are just being passive aggressive about it 😁",
            "I'm out of the loop on that one :(",
            "Yup",
            "Not for me :)",
            "Would have been just as easy to ignore this 🤷🏼‍♀️"
        ]
    },
    "When did you grow out of your 'Not like the other girls' phase?": {
        "title": "When did you grow out of your 'Not like the other girls' phase?",
        "score": 32,
        "url": "https://www.reddit.com/r/notliketheothergirls/comments/1dl869j/when_did_you_grow_out_of_your_not_like_the_other/",
        "content": "Users of the sub, share your stories here!",
        "num_comments": 65,
        "comments": [
            "When Mr Rogers taught me that everyone is unique. I'm completely different from everyone else around me, and they are all just as different too. And that these differences are to be embraced and celebrated. \n\nSo really, there are no \"other girls\" because nobody fits in a mold.",
            "sometime in college? i grew up in a conservative household so i thought doing boy things made me cooler. once i moved out i started to see how dumb it was to strive for male validation and that i was proud to be like other girls, because other girls are awesome :)",
            "I was always the kind of weird, quiet girl in class. I didn't understand the importance that other kids put on social hierarchies and popular vs unpopular. I developed this sense of snobbery around 10/11 because I was \"so much smarter than the rest of the girls, I don't even care about lipgloss and dances, etc etc etc.\"\n\nThat changed around 14, I went on a field trip to a museum (or something, I don't remember), and I got put into a group with 3 of the most popular girls in my year. It was kind of like a scavenger hunt for facts on different topics, and once you filled out your team sheets and handed them in, you had free time to do whatever you wanted to do. I totally expected that they were going to leave me to fill out the worksheets alone. Instead, one of them suggested we assign questions by who was more interested in what topics, split up in teams of 2 to get our answers, and peer review our answers before handing them in. We were the first group to finish and got perfect marks. We had loads of time to have lunch together, walk around different exhibits, chat and discuss, and I realized they were really nice, very smart girls just like me and that my \"ugh lipgloss girls 🤮\" mentality was completely out of line.",
            "Soon after I started engineering school. I was a bit of a pick me/nlog, I was in a class of 40 guys and was one of 2 girls, halfway through the first semester I was like: are these the guys I was trying to impress?\n\n![gif](giphy|to3I2nkywr2PS)\n\nThen leaving my teenage years I realized girls are awesome and what makes us different add to their charm. I came to admire girls I'd look down on before. Somewhere between 19-21 I stopped being a judgmental bitch towards both genders.\n\nI did end up marrying one of the guys I met there though, he impressed me!",
            "maybe i did and i just forgot, but i dont really remember having one when i was younger despite it being common for quite a few little girls\n\ni was always a \"girly girl\" myself, and never really had real resentment for things associated w that esp since i indulged in it myself, neither things associated w/ femininity & women in general who may or may not conform to those things. \n\ni felt kinda distant in friend groups, but not in a NLOG superiority complex way. it was bc i was generally very shy & had anxiety + i was possibly ND which distanced me from... everyone. but i never thought i was *too* different in interests \n\ni was insecure ofc, but i never really projected it onto other girls. my frustration was with the world in general for many reasons 💀",
            "College. When I left a strongly religious environment, I realized my dislike for all things feminine came from warped ideas of what feminity is. I realized I felt \"unique\" because I didn't see myself as lesser or shameful, characteristics I had unconsciously begun to associate with womanhood. And I realized that this diminished view of women suspiciously benefits the authority figures who taught it to me in the first place. \n\nPlus I dormed with a lot of very intelligent, sweet women in my freshman year. They were partiers, academics, athletes, loners, poets, etc. and every one of them was unlike anyone else.",
            "I never had this \"oh I'm so unique, woohoohoo\" attitude. I knew was different than other kids (so also girls), but that was because of my autism. I was the weird kid. Back then I couldn't always handle that, but as time passed on, I embraced it. However, I frown upon people who want to be \"weird\" and start to go over the top in doing that, because I know they're \"faking\" it. Being the \"weird\" one is nine out of ten times not a funny or nice experience. Like, you know you're the odd one out, but there is nothing you can change about it. You will always be the odd one out, no matter how hard you try. And especially at puberty, kids (and people basically) are cruel so it's hell.",
            "When I figured out that I WAS like other girls those girls just happened to be tomboys.",
            "I think it was truly when I had a daughter. \n\n\nI have done research for uni’s about racial and gender bias and know that a lot of girls are told to be pretty and put into pretty clothes/hair and then parents will restrict their movements because of these things- which leads toddlers into very different interests, very early.  \n\n\n\n\nSo I didn’t want to do that so I was planning on raising a “not girly” child. \n\n\nMy neighbor said her mother ALWAYS corrected people’s compliments to her and her sister, “she’s so pretty” “but why aren’t you talking about how smart/talented they are??” (Sounded like my responses). \n\n\nMy 45yo neighbor said, “I just always wondered why I couldn’t be smart AND pretty” and it blew my mind open in a way that practicing feminism hadn’t in the previous 10 years. \n\n\nNow my 3yo daughter has a closet full of tutus and taffeta because she likes dressing up. \n\n\nThe answer wasn’t not putting her in dresses, it was setting up a system where I wouldn’t then restrict her movement (buying used clothes so I’m mot mad when the pretty things “get dirty” and putting shorts underneath &c.)",
            "I don't think I ever really did have this phase? I was always bullied and so I took being different as negative rather than the \"pick me\" standpoint. \n\nAs I get older I feel more connection with people around me and my people pleasing empathetically in tuned self just wants to keep helping all the time. \n\nMore than anything, I'm just growing out of the phase of \"I need to meet everyone else around me's expectations\" I think."
        ]
    },
    "need a friend": {
        "title": "need a friend",
        "score": 19,
        "url": "https://www.reddit.com/r/notliketheothergirls/comments/1dktv60/need_a_friend/",
        "content": "I am just feeling really down right now and I need to talk to someone I could use a friend or just some positive affrinations would help me a lot too ",
        "num_comments": 30,
        "comments": [
            "hey, im a little down as well and i just want you to know that everything will be okay :) whatever you’re down about rn, you will feel better soon!",
            "This in no way is positive but I think it's funny also I cannot stress this enough thr picture it's not towards you it's just an image that makes me laugh\n\nhttps://preview.redd.it/4mpnxo6riu7d1.jpeg?width=736&format=pjpg&auto=webp&s=10d200c419d0e082f326ac1c95bc3d233c878651",
            "Just being you is enough. Your value doesn’t come from your productivity, your beauty, your strength, your martial status, your ability to handle life, etc. You already possess all of the worth in the world. You have to find it in yourself.",
            "we all here to talk if you need it <333",
            "Just like the flowers, joy will ALWAYS return. But in the middle of winter, covered in snow and seeing nothing but grey-ness for months I cannot fathom trees swelling with beautiful leaves again, soft plush green grass, animals and colorful flowers everywhere. Life has its seasons, too. Sometimes it’s really just about going through the motions & surviving the season until you realize one day that you feel lightness again. You’ll feel excited about small things and feel hope and joy when you forgot these feelings even exist.",
            "Hey op! We all need and deserve good friends. Anytime you need a listening ear, hit me up!",
            "I hope you're doing better",
            "[It's Just a Ride](https://www.youtube.com/watch?v=KgzQuE1pR1w)",
            "You got this! \nWhatever you’re going through will pass.",
            "dm me anytime girl :)"
        ]
    }
}