{
    "What are you doing this weekend?": {
        "title": "What are you doing this weekend?",
        "score": 43,
        "url": "https://www.reddit.com/r/nova/comments/1dqht0w/what_are_you_doing_this_weekend/",
        "content": "Who has pre-4th plans? Share away!",
        "num_comments": 136,
        "comments": [
            "Farmers market, pool, nap. My bean dip has been requested for a get together. I made it once a few years ago and now it's requested every time. It's just the normal bean dip I grew up with in TX and AZ and it's easy, so whatever.",
            "watching a quiet place tonight and then a 9mile hike tomorrow!",
            "Binging the Bear and eating some snow crabs. HT has snow crabs at $6lb with $5 off $30. Eating good.",
            "Going to the Kennedy Center tomorrow night for the Blackstar Symphony performance.\n\nSunday? Probably bingeing The Bear and getting some work done.",
            "Working ![gif](emote|free_emotes_pack|cry)",
            "Go to the Burke Farmers Marker, make Lasagna for the first time, watch season 3 of the Bear, and finally you can never go wrong with some brunch action in Clarendon.",
            "Baby shower, pickleball, & watching A Quiet Place: Day One.",
            "Going to NYC for a friend's bday",
            "Biking tonight, haven’t decided what to do with the rest of the weekend! Gonna keep checking this thread for ideas😂",
            "Sleeping, cleaning, gardening, smoking pork belly burnt ends. It was an incredibly long week with our cfo being wild and trying to force true ups on customers who asked for more time, I got them to verbal commit going from monthly commitments to 3 yr agreements, he should just chill out.\n\nAnd kicking off this oh so exciting weekend is a doctors visit to follow up on my broken foot and our annual vet visits today. Woo."
        ]
    },
    "Dan Snyder lists his Alexandria estate for $60 million": {
        "title": "Dan Snyder lists his Alexandria estate for $60 million",
        "score": 112,
        "url": "https://www.reddit.com/gallery/1dr1k6i",
        "content": "According to Zillow records, he purchased the house for $48 million in 2021, a substantial reduction from the original $60 million. The property is apparently the largest privately-owned parcel (16.5 acres) of the original Mount Vernon estate. \n\nSnyder also tried to sell his home in Potomac, but the ~$35 million listing price (which was a reduction from the original $49 million) wasn’t enticing, evidently. So he donated the house to a charity…which then re-listed the house for ~$35 million. \n\nHere’s the Zillow link to the Alexandria home, along with an Axios article about it: \n\n- https://www.zillow.com/homedetails/7979-E-Boulevard-Dr-Alexandria-VA-22308/82741014_zpid/?utm_campaign=iosappmessage&utm_medium=referral&utm_source=txtshare\n\n- https://www.axios.com/local/washington-dc/2024/06/28/dan-snyder-virginia-estate-river-view-listing\n\nAnd here’s the Zillow link for the Potomac property: \n\n- https://www.zillow.com/homedetails/11900-River-Rd-Potomac-MD-20854/37151807_zpid/?utm_campaign=iosappmessage&utm_medium=referral&utm_source=txtshare",
        "num_comments": 31,
        "comments": [
            "I didn’t even know Alexandria has properties that big that’s fucking insane",
            "Fuck Dan Snyder",
            "I hope he falls down a well",
            "The Potomac property is...interesting. 35 mil for 5 bedrooms? It honestly makes more sense than like 10 bedrooms because who the fuck needs that many but it still seems weird.\n\nAlso Dan Snyder can eat shit.",
            "I’ll be honest I read that as Dee Snider for some reason. I was impressed We’re Not Gonna Take It did that well.",
            "I’d rather pay the same amount for a haunted studio apartment than live there.",
            "I bet we could all chip in and maybe get this house to share between all of us lol",
            "Imagine paying $414K in property taxes!",
            "Pssshhh no outdoor pool",
            "Well that's cool for the 3 potential people in the world that may want an overpriced house in that area and can actually afford that lol"
        ]
    },
    "Am I screwed?": {
        "title": "Am I screwed?",
        "score": 195,
        "url": "https://www.reddit.com/r/nova/comments/1dqpsof/am_i_screwed/",
        "content": "I'm a 28 year old guy just inches away from getting my bachelor's degree from George mason university which I have been attending since 2018. History is my forte and ultimately I want just an office job with a good income that can give me a place on my own with a nice house and have all the things a middle class guy in the United states has. People tell me that history is a useless major here as northern virginia is huge with data centers, IT, and government work (I'd have no problem working in government). Am I setting myself up for failure? Because if I'm unable to get a good paying comfy job I really don't want to have to work in construction or in a trade. ",
        "num_comments": 271,
        "comments": [
            "I’m guessing George Mason has a career center. Have you reached out to them? People in college forget that you basically have a network people whose full time job it is to help you.",
            "I mean, you probably won't be working as a historian but your basic transferrable skills should include: research (digging for sources), analysis (forming theory from sources) and communications (being able to write your ideas clearly and succinctly is a big one).  Plenty of market for those. \n\n\nMy partner has a history degree and a 10 year career in IT so, you know, YMMV. ",
            "GMU grad here who majored in history. The degree teaches you to write well, think critically and support an argument. You may have to go to grad school to get the job you want. I got a masters in library science and am now a researcher for a law firm. DC is fortunate to have tons of government agencies, law firms, and non-profits. You will find a job eventually.",
            "This isn’t really answering your question but I just want to say that a nice house is no longer a middle class thing anymore. Especially not in this area. You have to be married and have 2 decent incomes to even have a shot these days.",
            "fellow history major here.\n\nI'm not gonna say you're definitely screwed, but I've never once worked in anything close to my degree. I've done well for myself, though. \n\nI graduated in 2006. My first job was with GEICO, I would not recommend that, but it's not terrible. I had an application in with one of the three letter agencies based on recommendations from parents of my friends who worked for the \"State Department\" (nudge nudge wink wink). They're looking for people from all backgrounds and history is a good one, especially if you've focused in a current region of interest. I got a phone call and was told I had been selected for further consideration, but my dumb ass said \"no thanks, I already have a job\".\n\nI've bounced around a bit, also being military helped, but most of my life has been government or government-adjacent. Now I write defense policy.",
            "I majored in history too. Being a new graduate is tough, especially with a liberal arts degree. I had similar aspirations (everyone told me to become a teacher) and a tough time getting my first real job after graduating, but I've been working an office job for 15 years now and it's been pretty great. ",
            "I'm just one person, but I majored in history, graduated a few years ago, and now am working in a awesome office job that has nothing to do with history directly... but all those research and communication skills I gained from majoring in history is really handy. It's going to be a bit of a struggle job hunting at first, but it'll all work out.",
            "Contracts might be another area to look into, especially if your history degree required a lot of reading/writing.",
            "What is an office job in your opinion, and why did you get a history degree to get said office job?",
            "Your first problem is that you assume anyone in America's declining middle class has a nice home..."
        ]
    },
    "Obligatory bumper sticker post ": {
        "title": "Obligatory bumper sticker post ",
        "score": 64,
        "url": "https://i.redd.it/mg4tcixw6e9d1.jpeg",
        "content": "At least it made me laugh ",
        "num_comments": 4,
        "comments": [
            "Ok, that's amazing!",
            "This, I love, and I would like one on my truck.",
            "Found Jayson Tatum's daily driver",
            "![gif](giphy|uCXkGJPU3yrOo)"
        ]
    },
    "Senior Driver Sticker - Is this new?": {
        "title": "Senior Driver Sticker - Is this new?",
        "score": 115,
        "url": "https://i.redd.it/jg8c41ns2d9d1.jpeg",
        "content": "I'm used to seeing the \"grandchild\" version of this sticker, but not this version. Is this a new thing? Also, side note, they were by FAR the best driver on the road!\n\nP.S. I was at a stoplight.",
        "num_comments": 35,
        "comments": [
            "I liked the one that said \"Mediocre driver\" or something akin to that.",
            "“Awesome Driver in My Prime - Do Your Worst”",
            "I so want to get a Baby on Board sticker for my motorcycle…",
            "Honestly I like that more than the student drivers.  That just means they’ll drive slowly I’d imagine.",
            "Sticker or not, if you drive like an asshole, you need to stay home.",
            "Them: “Please be patient.” Me:\n\n![gif](giphy|98C4E2HeR4NBm)",
            "I got that exact one for my brother, who is 26 and drives like a maniac sometimes.",
            "If that's a joke, it's funny. If not, no.",
            "They need to issue stickers around the DMV. DMV driver busy on smart phone and I don't care about others.",
            "Def have seen these lol"
        ]
    }
}