{
    "NO MEDICAL ADVICE": {
        "title": "NO MEDICAL ADVICE",
        "score": 208,
        "url": "https://www.reddit.com/r/nursing/comments/1ba3avg/no_medical_advice/",
        "content": "Okay, so as a follow up post to our last reminder post, there's still some confusion about our no medical advice rule.  It's the first rule of the sub, and we have been very open and transparent that it is not now, has never been, and will never be allowed in this sub. \n\n\n[This piece of music has been hand selected for this message.](https://youtu.be/3GKyMb3glZA?t=30)\n\n\nHi friends, shitposters, lurkers, students, nurses, relatives of nurses, and what have you and so on.  \n\n\n\nWe’re noticing that there’s an increase in medical advice posts recently. “No Medical Advice” is the first rule for a reason.  There’s significant legal and ethical consequences that you probably don’t want to get wrapped up in. Both asking for and ***PROVIDING*** medical advice is strictly prohibited.  Since there seems to be some confusion about the rule, I'll break it down further here: \n\nNo Medical Advice: \n\n* No - ***adverb*** (a negative used to express dissent, denial, or refusal, as in response to a question or request):\n\n\n* Medical - ***adjective***\nof or relating to the science or practice of medicine:\n\n\n* Advice - ***noun***\nan opinion or recommendation offered as a guide to action, conduct, etc.:\n\nThus, as the rule is written, you are denied from opining or recommending a course of action or conduct as it pertains to the science or practice of medicine. \n\n\nAs a reminder to the rebels that even the strongest among them cannot overcome the power of the mod team, anyone asking for or providing medical advice will be given a 7 day ban.  Further incidents will result in further bans, escalating in duration up to and including permanent.  \n\n\n***ANYONE COMMENTING ON A MEDICAL ADVICE POST ANYTHING OTHER THAN \"MEDICAL ADVICE IS NOT ALLOWED\" OR A SUFFICIENTLY SIMILAR DERIVATIVE OR VARIATION WILL ALSO BE SUBJECT TO ENFORCEMENT ACTIONS UNDER THIS RULE.  THIS POST IS YOUR WARNING - IF YOU MENTION ANYTHING ALONG THE LINES OF \"THIS IS TOO HARSH\" OR \"I WASN'T EVEN WARNED\", THEN YOUR BAN WILL BE MADE PERMANENT.***\n\n\nFarewell and may the karma be ever in your favor.",
        "num_comments": 88,
        "comments": [
            "Okay but what if I throw a pizza party before I ask?",
            "Are essential oil suggestions ok? What if someone is trying to use peppermint cucumber comquat when they should be using *gasp* frankincense grapeseed agave  (/s just in case)",
            "Oh darn, i was about to ask about medical advice on which  quality scrubs are good to buy and resistant against physical attacks.",
            "I love your writing style. You have a great sense of humor. Also, could I ask you a question about my prescription?",
            "Bruh I was just gonna ask you to look at this mole I got while we're out at dinner since I heard you're a nurse and all ",
            "Does this mean I have to go back to using Facebook mom groups? They all just keep telling me to put onions in my socks and Ill be healed.",
            "I need medical advice on if pineapple belongs on pizza",
            "Sounds good to me! I always report them. Especially the ones that state \"I'm not looking for medical advice....\" because they always are..",
            "But who will tell these people they are at risk of imbalanced energy fields?! We are the only ones who can diagnose that over the internet with our nursing science!",
            "Does this only cover humans? Can I ask for advice on my nonexistent cat or my pet rock?"
        ]
    },
    "WEIRDEST thing I’ve walked in on:": {
        "title": "WEIRDEST thing I’ve walked in on:",
        "score": 680,
        "url": "https://www.reddit.com/r/nursing/comments/1dqykpo/weirdest_thing_ive_walked_in_on/",
        "content": "So, yesterday I was a “float” nurse, some may call it a break nurse, and I sent one of the nurses on a 15 min break. I had helped get her patient up to the commode a few mins before. No problem, I’d help them get cleaned up when they’re done. It was a little old Chinese man. He had his wife staying in the room with him. They only spoke Cantonese so I did my best with hand motions and signals ..\nAnyways I come in to check on the patient, and they shoo me away signaling he isn’t done with the commode yet, so I come back a few mins later to find the patients wife with her hand up his ass, digging for poop. It wasn’t a gentle manual disimpaction either… she was UP THERE IN AND OUT FAST AND HARD😭\nI stood there in shock at the graphic scene and then quickly told her no and to stop. Quite a scenario to explain to the primary nurse when she got back. He bled all day afterwards it was gnarly 😖\n",
        "num_comments": 219,
        "comments": [
            "Violent psych boarder, built like a linebacker. Incredibly smartthink A Beautiful Mind kind of guy.\n\nHis attire: naked except for an adult brief, gait belt as a sash, shower cap. Had the mask from an ambu bag in his mouth, turned around to look like a pacifier. Standing over the toilet flushing bath wipes, one by one.",
            "My patients  (child getting chemo) Dad having sex with the mothers sisters in the chair next to the hospital bed. I dont know if the mom ever found out. The parents are still married",
            "Pt in bed with an abdominal wound vac being boinking her boo thang. The same boo thang that accidentally released the e brake which cause the car to roll over her and hence the abd wound vac. \n\nWe couldnt figure out why the vac kept messing up or why the graft kept failing.",
            "I didn't witness this, I just dealt with the death afterward. A 30's something male was admitted to one of our internal medicine floors. He was supposed to discharge soon. All of friends kept bringing him heroin. The staff took it away and trespassed the friends. It happened one more time in the middle of the night. Dude died a few hrs later. He ended up going to the Medical Examiner, only because of the heroin.  Really sad. Addiction is no joke",
            "Couldnt you see they were in the middle of an important medical procedure and you were intruding?!?",
            "We had this lady who we thought was confused AF. She kept yelling that 'spiderman was shooting webs on the window outside.\" Well our unit was the 8th damn floor! Eventually round 2am I walk in and patient is yelling about spiderman again....and I look across the courtyard and there's a guy in the window wearing a spiderman shirt jerking it at the window. And that window is covered with uh...'webs'. Turns out psych was missing a guy on that unit and we found 'em.",
            "Ambulatory Japanese guy asks for a metal fork. The bathroom was a blood bath. Had to transfuse a unit. Same thing, he was digging poop out with a fork",
            "Love is fisting your constipated husbands ass.",
            "Cicu 34 yo male in for SAVR due to endocarditis from his steroid/hgh injections, total roid monkey, built like a brick shithouse, mom and gf total enablers, anyways hes post op day one, found him doing sit-ups in bed and he admitted to bench pressing his IV pole earlier which mom and gf at the bedside confirmed, he had become dyspnic, hypotensive and tachy, bedside echo reveals tamponade, afterwards CT surgeon could be heard swearing and berating him loudly from the room with the door closed, pt had tore his sternal wires and needed to be taken back to OR for redo repair sternotomy and pericardial window.",
            "Walked into the patients room to find her in the bathroom having sex with a guy I had never seen before.  She introduces him as her boyfriend very awkwardly and says something about him coming to give her money to help take care of her dogs??? But the dude clearly has no clue who she is or even her name. Pretty sure I walked in on the patient just running her sex work business in the hospital bathroom \nIf youre well enough to fuck you are well enough to be discharged lmao"
        ]
    },
    "“Thanks, man.” I said to the hospitalist…🥲": {
        "title": "“Thanks, man.” I said to the hospitalist…🥲",
        "score": 583,
        "url": "https://www.reddit.com/r/nursing/comments/1dqw32r/thanks_man_i_said_to_the_hospitalist/",
        "content": "Called a hospitalist to ask for an order for Pepto.\n\nMD: “Any other concerns?”\n\nMe: Nah, that’s all.\n\nMD: “Ok, I’ll put the order in now.”\n\nMe: Thanks, man!\n\n*hangs up*\n\nIM SORRY WHAT?! THANKS MANNNNNN\n\nMy colleague was like “are you guys tight or something?” I was like - NO AND I CAN FEEL MY FACE GETTING HOT\n\nMD came up just before shift change to check on the pt., I apologised like - I’m so sorry, I’ve been in the psych ICU for 4 days straight, I’m cooked. He thankfully just laughed and my colleague was like “next time it’ll be bro” - he laughed again 😂\n\nSo fucking embarrassing 🙃🙃🙃\n\nETA: We are like this with our psychiatrists, but this was a roving hospitalist, so not the same working relationship 🥲",
        "num_comments": 230,
        "comments": [
            "This is how I talk to all our docs lol",
            "Why? Theyre just another human. This isnt uncommon in the ER",
            "Ive definitely said okay love you bye and hung up the phone and never brought it up again to the doc. Any doc. This has happened multiple times",
            "Better than love you bye!",
            "If people are wanting high formal nurse talk, they are going to be super disappointed with me.  Not gonna happen. \n\nAt least you werent rude.  You said thanks! Youre good, fellow nurse bro.",
            "Mine TigerConnect me emojis ",
            "I looked at a general surgeon, I knew fairly well, who added on a bunch of cases on a Sunday and said oh youre buying lunch for this To his credit he gave us his card and said get whatever you want.\n\nTheres alot of first names in the OR once youre spent some time with them. The yes doctor only comes out when theyre being dicks",
            "At least it wasn't a \"thanks, babe!\" type of situation.",
            "Dont even stress! I frequently call one of our docs menace to society and the reason Im greying prematurely whenever I see him",
            "Me to one of my fav docs: Hey best friend!\n\nDoc to me: What up my bestie?!!!"
        ]
    },
    "What is your go-to low effort, high reward patient care trick that will always make the patient feel better? ": {
        "title": "What is your go-to low effort, high reward patient care trick that will always make the patient feel better? ",
        "score": 564,
        "url": "https://www.reddit.com/r/nursing/comments/1dqtvze/what_is_your_goto_low_effort_high_reward_patient/",
        "content": "Mine is:  “Here, let me flip over your pillow to the cool side”. ",
        "num_comments": 453,
        "comments": [
            "Putting a new warm blanket under all the others and tucking in their sides and feet like a lil taquito.",
            "When I give my babies a bath I always wrap them up in a warm fluffy towel to dry off and put a small burp cloth around their head like many women do after a shower. I then have parents take a spa time photo, its really cute, makes them smile, and keeps my babys head warm while we dry off.",
            "Get them two warm blankets. One goes over them in the normal way, the other? Draped over their shoulders. \n\nIve literally seen people go from ranting at me about the prior nurse to almost purring like a house cat in 2 seconds flat. Did you still want to talk to the charge nurse . Oh. Ahthat yeah no, thats not necessary",
            "When someone is on comfort care with family around I offer to get the Doppler and let them record their family members heart beat. They can put it in stuffed animals for their grandchildren if they want. Usually is a grand slam and makes me feel like I did something worthwhile",
            "I used to give pts a warm washcloth to wipe their face in the morning and supplies to brush their teeth while I did my first assessment. Thats how I start my day at home.",
            "In the icu, I wipe their faces off with a damp cloth, clean eye crusts, lip balm, good oral care, etc.  Towel on chest before every meal (for eaters).  Always keep them up to speed with what the plan is in terms of goals, transfers, etc.  I do this for family members of those who aren't able to participate.  Talking takes usually only minutes and can go a long, long way.",
            "Offer to make them a ginger cran  or apple cran on the rocks. Always makes them smile especially when theyve been inpatient for a while and have been eating the same thing for days.",
            "Keeping the straw wrapper on the mouth part when I give them their ice water.",
            "Putting ice on the back of the neck of patients who are feeling nauseous or actively vomiting",
            "Giving them a washcloth (warm or cold, their choice) for their face after they brush their teeth."
        ]
    },
    "nursing student and a doctor had a yelling match ": {
        "title": "nursing student and a doctor had a yelling match ",
        "score": 1236,
        "url": "https://www.reddit.com/r/nursing/comments/1dqlkhv/nursing_student_and_a_doctor_had_a_yelling_match/",
        "content": "Typing this on my phone at work so sorry if it’s not coherent lol. I till can’t believe this happened and had to tell someone. our hospital has LPN students come in twice a week, they’re pretty familiar with the hospital and staff by now (this group has been here for 2 semesters). \nWe have this one hospitalist, let’s call her Dr. P. Dr P is a great doctor, she has great bedside and is very smart, but she can be tough on nurses. She will write you up if she thinks you messed up and will embarrass you if she feels that you’re being incompetent. \nSo, Dr P is in the middle of rounding on patients, a PN student comes up to her and says “hey room 30 wants to talk to you” Dr P says “is it an emergency? What did they want to talk about?” The PN student admitted she didn’t know why the pt wanted to speak with the dr. Dr P said “well I’m in the middle of rounding but once I finish I’ll go see them.” The PN student says “oh well that’s funny. I find it funny that you don’t care enough about your patient to see what’s going on.” \nDr P SNAPPED. Immediately starts going in on this student, the whole “who do you think you are, you have no right to speak me that way,” etc etc. the student YELLS BACK, “don’t raise your voice at me, you need to attend to your patients” and we are just all watching wide eyed. The student got sent home.\nNaturally it’s all everyone is talking about lol. What do you guys think? I do think Dr P yelling (especially in the hallway in front of everyone) is uncalled for, but if it’s not an emergency, I do think it’s ridiculous to expect a Dr to stop rounding just to see what someone wanted. Or to not find out what the patient needs before going to the doctor. Am I crazy? Again what do you guys think. ",
        "num_comments": 481,
        "comments": [
            "While yelling at work is not appropriate, that student is out of her damn mind if she thinks ANY doc is going to stop rounds for every so-and-so wants to speak with you interruption. Hell no. She asked if it was an emergency. Student didnt even have an answer for that. \n\nYep. Go home with your attitude and think about exactly what you did.",
            "Student is 100% in the wrong here, and very much an asshole.",
            "There are things I will interrupt rounds for, but a family members question aint it.\n\nThat was crazzzyyyy bold of that student.",
            "The more insane part is she implied the doctor didnt care about the patient when she didnt even care enough to figure out what the patient wanted.",
            "The student started it by being condescending and sarcastic when she stated, I find it funny you dont care enough about your patient to find out whats going on.\n\nIn the hood, a saying exists: Dont start nothin, wont be nothin. She was snarky and implied that the physician didnt care enough. The doc simply clapped back.",
            "Definitely wrong of the student to say that. ALWAYS get ALL of the information before talking to the doctor. In any situation",
            "Student who didn't know why the patient wanted the doctor is outraged when it's not a priority? Dumb. I've been pissed when nurses ask me to do similar things as a charge without knowing why.",
            "Its not even about interrupting rounds, not knowing what the pt wanted, etc. *Implying that the doc doesnt care about their own pts right to their face* gets you a verbal smack down no question, rightfully so >99% of the time. Especially if were talking a hospitalist and not niche/prestige specialists. This doc basically sacrificed her youth to be a doctor, and not really the yacht club kind. If some punk came at me saying I dont give a shit about my pts in that scenario we are absolutely having words about it.",
            "\"How to lose a Clinical site in one easy step!\"",
            "Oh, never EVER would my hospitalists tolerate that. Student was in the wrong 100%"
        ]
    }
}