{
    "r/nuzlocke alternatives": {
        "title": "r/nuzlocke alternatives",
        "score": 84,
        "url": "https://www.reddit.com/r/nuzlocke/comments/14e0147/rnuzlocke_alternatives/",
        "content": "Hey guys. One more fun little thread before we become public again :)\n\nI sincerely love how this community has grown, but I've been around for too long to not be upset at how Reddit is treating users. While I don't plan on jumping ship on this place *just yet*, I want to highlight other alternative spaces in the scene here, on the chance that Reddit isn't around in the next few years.\n\n# [Nuzlocke Forums](https://nuzlockeforums.com/forum/)\n\nYou've probably seen me advertising the [Nuzlocke Forums](https://nuzlockeforums.com/forum/) a bunch since the start of the blackout, and we've always been on good terms, but I genuinely highly recommend giving them a look. NuzForums has been around longer than us, and forums are cool. Seriously, we *fumbled* as an internet ecosystem when we let Reddit kill forums. But this one is alive and is great, so I'd suggest giving them some love.\n\nBack in 2019, The Nuzlocke Forums switched to a new server host and redesigned the entire site. If you were around before the switch, I'll vouch for them when I say the new site is significantly smoother, and a much more enjoyable user experience. If you're a younger member unaware of the forums, they've hosted the largest independent Nuzlocke community for over a decade, and have many different outlets to share your runs, discuss Nuzlocke-related things, or discuss literally anything else.\n\n# [Lemmy](https://lemmy.world/c/nuzlocke)\n\nI'm going to be honest: I have no idea how Lemmy works. Not in the slightest. It seems to be similar to  Mastodon, if you're familiar with that. I cannot be the one to explain it to you because I am illiterate when it comes to this stuff, but [here's a guide](https://join-lemmy.org/docs/en/introduction.html) if you're curious. ANYWAYS, [lemmy.world](https://lemmy.world) is kind of set up like Reddit, and while it's a bit primitive at the moment, I've gone ahead and set up a [Nuzlocke page](https://lemmy.world/c/nuzlocke) over there. Go make an account, give it a swing and maybe we can catch the same magic in a new, more welcoming space :)\n\n&#x200B;\n\nThanks everyone for being amazing. I don't expect anyone to want to leave, and I know as general users most of y'all probably aren't phased by what Reddit is doing, but I wanted to share these for anyone who **is** tired of it all. Or if you just want more content in general, you can always hover to the other communities for a bit too!\n\nThat's all for now. The sub will be back up within the next 24 hours, as the poll trends toward that. Thanks, have a good one.",
        "num_comments": 18,
        "comments": [
            ">\tI don’t expect anyone to want to leave\n\nOh I’m definitely leaving when Apollo shuts down, thanks for making a community over on lemmy :D",
            "Bruh making essays over this dumbass blackout",
            "I don't intend on nuking the sub by any means, don't worry about that. I'm more or less predicting Reddit itself will die out if they keep making decisions like this, but we'll just have to see. the forums are a good bit less active nowadays (as all forums are thanks to Reddit) but more tight-knit, and it's a good place. I'd love to see them gain more traction over this whole thing personally.",
            "Very interesting do you have any idea how this would work in platinum or soul sliver?",
            "It really wasn't that long.  Are you in middle school or something?",
            "Most mods never cared about change (Although I believe some did genuinely care, especially smaller subs like here). They caved the second Reddit threatened to replace them with scabs. They'd rather keep the little power they have, then stand up for people who really needed help",
            "Reddit won’t die out because of this at all. Most people seem to clearly not care all to much about API drama",
            "Pretty much the same way. You can start breeding your Pokémon as soon as unlock the Daycare.",
            "If it were up to just me I'd stay private, but it felt appropriate to respond to the situation with a poll. Most users are trending toward wanting to reopen, so that's what we're going to do.\n\nI could care less about \"power\", I don't really have much with a smaller sub like this and just wanted to do what I could with whatever power I did have, but the blackout hasn't gone the way we wanted it to. It just sucks and we either stay blacked out and  continue to get loads of modmail from angry children and Reddit itself for potentially nothing in return, or open and get called power-hungry moderators. I don't want or ask for any kind of sympathy, but hopefully you understand the predicament lol",
            "Interesting and what would the ditto clause be?"
        ]
    },
    "Oh, if it isn’t this b*tch again…": {
        "title": "Oh, if it isn’t this b*tch again…",
        "score": 1017,
        "url": "https://i.redd.it/jrabsfwhnc9d1.jpeg",
        "content": "I’m keeping Suleiman the Magnificent in his box, thank you very much",
        "num_comments": 65,
        "comments": [
            "This made me so irrationally angry. I was like 15 when this came out too.\n\nAngry as a little kid.",
            "Nintendo: Well, people won’t stop complaining about trade evolutions… let’s give them some trade-no-evolution",
            "Also people in Scarlet & Violet see a trade that includes Haunter, they begin to have PTSD of Mindy, but then they get a Gengar for free after trade.",
            "I did not understand how Haunter evolved when I first played this, and was therefore delighted to have a Haunter on my team. I taught him Mean Look and he became my roaming legendary hunter.",
            "This made me so angry where I was like 9 I was so ready to find a way to get in the game and rock her shit",
            ">Suleiman the Magnificent\n\nAyy I love that nickname",
            "I remember being a kid and my friend did this trade in game. He leveled Haunter up to the 70s trying to get it evolve. Then he decided to trade it to me. Before trading he took off the stone since he wanted to keep the item. We were both surprised when it evolved and he begged me to trade Gengar back haha",
            "Shit like this is why romhacks are better lol",
            "Why we all got trust issues",
            "This is the moment I decided it was ok to swap trade evolution mons for whatever random thing some Japanese 9 year old gave me back"
        ]
    },
    "What is the best game to nuzlocke for a beginner": {
        "title": "What is the best game to nuzlocke for a beginner",
        "score": 29,
        "url": "https://www.reddit.com/r/nuzlocke/comments/1dr7u7p/what_is_the_best_game_to_nuzlocke_for_a_beginner/",
        "content": "As title says, have never done a nuzlocke and only have basic Pokémon experience so which game should I start with? Any game that isn’t on 3ds plz",
        "num_comments": 40,
        "comments": [
            "Overall pick the one you know best. However I will put in a dishonourable mention for B/W as the encounters for the game are really poor combined with a definitely higher difficulty compared to many other games.",
            "I would definitely recommend Fire Red Leaf Green for your first nuzlocke unless there is another game you have a bunch of experience with.",
            "X and Y they are easy and a good introduction to nuzlocking in my opinion it’s what I started out with and I had a good time with it",
            "Echoing the sentiment about the one you’re most familiar with. I grew up with Platinum and never played FireRed, so consequently I find Platinun waaay easier",
            "Easiest is probably X & Y I’d say",
            "OG Red/Blue is pretty easy. X/Y isnt bad because you get a ton of type encounters and two starters.",
            "Fire Red. It’s very simple, you probably are very familiar with all of the Pokemon, and only 4 mandatory HMs (Strength, Cut, Fly, Surf)",
            "Probably Pokemon X and y",
            "Pokémon X and Y are embarrassingly easy, but FireRed and LeafGreen are also good choices. \n\nHaving that said, pick the one you’ve played the most with the largest variety of Pokémon. My first was Platinum, because it’s my favourite game and the one I have the most experience with.",
            "I would recommend run and bun"
        ]
    },
    "I Have finished my pokemon ruby nuzlocke": {
        "title": "I Have finished my pokemon ruby nuzlocke",
        "score": 21,
        "url": "https://i.redd.it/7s32crhm0h9d1.jpeg",
        "content": "I just finished my pokemon ruby nuzlocke and this was my team. Roast it",
        "num_comments": 6,
        "comments": [
            "Did you get 2 shinies in the same game???",
            "No roast, what a top team. All I ask and hope for is that Kecleon survived?",
            "Shiny Altaria is probably one of my favorites. Congrats on the win and the shinies!",
            "Yes i spend all my luck im never go get another shiny",
            "No…",
            "RIP lil lizard"
        ]
    },
    "This is the One Time where Paresect becomes an MVP!!": {
        "title": "This is the One Time where Paresect becomes an MVP!!",
        "score": 7,
        "url": "https://v.redd.it/hypi9cx5bi9d1",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}