{
    "r/nuzlocke alternatives": {
        "title": "r/nuzlocke alternatives",
        "score": 84,
        "url": "https://www.reddit.com/r/nuzlocke/comments/14e0147/rnuzlocke_alternatives/",
        "content": "Hey guys. One more fun little thread before we become public again :)\n\nI sincerely love how this community has grown, but I've been around for too long to not be upset at how Reddit is treating users. While I don't plan on jumping ship on this place *just yet*, I want to highlight other alternative spaces in the scene here, on the chance that Reddit isn't around in the next few years.\n\n# [Nuzlocke Forums](https://nuzlockeforums.com/forum/)\n\nYou've probably seen me advertising the [Nuzlocke Forums](https://nuzlockeforums.com/forum/) a bunch since the start of the blackout, and we've always been on good terms, but I genuinely highly recommend giving them a look. NuzForums has been around longer than us, and forums are cool. Seriously, we *fumbled* as an internet ecosystem when we let Reddit kill forums. But this one is alive and is great, so I'd suggest giving them some love.\n\nBack in 2019, The Nuzlocke Forums switched to a new server host and redesigned the entire site. If you were around before the switch, I'll vouch for them when I say the new site is significantly smoother, and a much more enjoyable user experience. If you're a younger member unaware of the forums, they've hosted the largest independent Nuzlocke community for over a decade, and have many different outlets to share your runs, discuss Nuzlocke-related things, or discuss literally anything else.\n\n# [Lemmy](https://lemmy.world/c/nuzlocke)\n\nI'm going to be honest: I have no idea how Lemmy works. Not in the slightest. It seems to be similar to  Mastodon, if you're familiar with that. I cannot be the one to explain it to you because I am illiterate when it comes to this stuff, but [here's a guide](https://join-lemmy.org/docs/en/introduction.html) if you're curious. ANYWAYS, [lemmy.world](https://lemmy.world) is kind of set up like Reddit, and while it's a bit primitive at the moment, I've gone ahead and set up a [Nuzlocke page](https://lemmy.world/c/nuzlocke) over there. Go make an account, give it a swing and maybe we can catch the same magic in a new, more welcoming space :)\n\n&#x200B;\n\nThanks everyone for being amazing. I don't expect anyone to want to leave, and I know as general users most of y'all probably aren't phased by what Reddit is doing, but I wanted to share these for anyone who **is** tired of it all. Or if you just want more content in general, you can always hover to the other communities for a bit too!\n\nThat's all for now. The sub will be back up within the next 24 hours, as the poll trends toward that. Thanks, have a good one.",
        "num_comments": 18,
        "comments": [
            "From what I’ve seen the forums doesn’t have nearly as active as a community as this subreddit, they seem to sometimes go days or weeks without a single post. Idk about API whatnot as I’m a scrub who solely uses the mobile app but I think more would be lost than gained if this server was nuked in protest. I suppose it’s ultimately up to the mods though",
            "I call it a Bredlocke. You play as a normal Nuzlocke with capturing first encounter on a route only. If you fail, Nuzlocke rule applies. However, if you capture it you may capture a breeding partner on the same route. You may breed them.\n\nMy reason was to allow egg move usage.\n\nDitto clause for those who want it.\nDupes for full evolutionary line.\nShiny clause.\nStationary clause.\nRoaming clause.\n\nThat’s what I’m doing in Gen 2 right now on my PC.",
            ">\tI don’t expect anyone to want to leave\n\nOh I’m definitely leaving when Apollo shuts down, thanks for making a community over on lemmy :D",
            "Bruh making essays over this dumbass blackout",
            "I don't intend on nuking the sub by any means, don't worry about that. I'm more or less predicting Reddit itself will die out if they keep making decisions like this, but we'll just have to see. the forums are a good bit less active nowadays (as all forums are thanks to Reddit) but more tight-knit, and it's a good place. I'd love to see them gain more traction over this whole thing personally.",
            "Very interesting do you have any idea how this would work in platinum or soul sliver?",
            "It really wasn't that long.  Are you in middle school or something?",
            "Most mods never cared about change (Although I believe some did genuinely care, especially smaller subs like here). They caved the second Reddit threatened to replace them with scabs. They'd rather keep the little power they have, then stand up for people who really needed help",
            "Reddit won’t die out because of this at all. Most people seem to clearly not care all to much about API drama",
            "Pretty much the same way. You can start breeding your Pokémon as soon as unlock the Daycare."
        ]
    },
    "Oh, if it isn’t this b*tch again…": {
        "title": "Oh, if it isn’t this b*tch again…",
        "score": 805,
        "url": "https://i.redd.it/jrabsfwhnc9d1.jpeg",
        "content": "I’m keeping Suleiman the Magnificent in his box, thank you very much",
        "num_comments": 51,
        "comments": [
            "This made me so irrationally angry. I was like 15 when this came out too.\n\nAngry as a little kid.",
            "Nintendo: Well, people won’t stop complaining about trade evolutions… let’s give them some trade-no-evolution",
            "/r/fuckmindy",
            "Also people in Scarlet & Violet see a trade that includes Haunter, they begin to have PTSD of Mindy, but then they get a Gengar for free after trade.",
            "I did not understand how Haunter evolved when I first played this, and was therefore delighted to have a Haunter on my team. I taught him Mean Look and he became my roaming legendary hunter.",
            "This made me so angry where I was like 9 I was so ready to find a way to get in the game and rock her shit",
            "r/fuckmindy",
            ">Suleiman the Magnificent\n\nAyy I love that nickname",
            "Shit like this is why romhacks are better lol",
            "Why we all got trust issues"
        ]
    },
    "Run and Bun e4 on Attempt 1!": {
        "title": "Run and Bun e4 on Attempt 1!",
        "score": 110,
        "url": "https://v.redd.it/ysz5qirzuc9d1",
        "content": "",
        "num_comments": 33,
        "comments": [
            "Beating the hardest romhack on youe first attempt is an incredible feat. Really well done.\n\nOut of curiosity, did you go in blind, or were you aware of the common strategies used to do well in each split of the game?",
            ">!I won, but jfc the e4 took me weeks to prepare for!<\n\n\n\nI don't have much to say about this hack that hasn't been said already. This attempt took several months of my life and was by far the most challenging and patience-testing Nuzlocke I've ever done. I felt like this run was carried by some incredible early-game encounters in Togedemaru, Vivillon, and many others, letting me build up a big box that I could aggressively sac from in the late game. By the end, the run felt very secure, although there were certainly several crits that could've ended my run in the elite 4.\n\nScreenshots of my boxes and stuff: [https://imgur.com/a/9klnO9F](https://imgur.com/a/9klnO9F)\n\nI'll reply to this comment with some death/heart scale/rare candy accounting for those interested.\n\nThanks to all the helpful commenters on my previous post from about a month ago!",
            "that glacia fight was a *treat* to look at",
            "This is seriously impressive! Do you think that you got lucky with encounters or did you route well, play the numbers and just find a really optimal team? This 6 worked so well for E4, did you have it in mind all along?",
            "As fun as these ROM Hacks look to Nuzlocke, I don't think I could manage them in my lifetime. Not when I have things like college to worry about.",
            "No way. Attempt 1????",
            "🫡🫡🫡",
            "That golisopod’a name in my language is beautfiul, which is exactly what it was. Those pivots were immaculate",
            "Can we play this game without nuzlocke?",
            "Unreal man! What an accomplishment"
        ]
    },
    "When you ask your friend what game you should nuzlocke ": {
        "title": "When you ask your friend what game you should nuzlocke ",
        "score": 45,
        "url": "https://i.redd.it/6khokv6n7e9d1.png",
        "content": "Join the discord: https://discord.gg/zBagHeGZDT ",
        "num_comments": 6,
        "comments": [
            "I feel this man, RR is so bad I have to take a break",
            "One of the few I haven’t tried yet. I have it downloaded and I’ll play it one day",
            "Tbh, I can't take seriously anyone who considers that a \"gold standard\" for a Pokémon experience. I have heard people straight-up say \"this is how mainline games should be\", which is straight-up bull.\n\nOh yeah, let's take away all the personality of our creature collecting title and make it about optimization. Like, the reason I find Nuzlocke so cool is how it makes us get attached to our mons. RR does not, it's about numbers changing other numbers, it's great for hardcore players, it's probably one of the best battle simulators, it's very well made, the one thing it isn't is a good creature collecting game.",
            "Inclement Emerald and Renegade Platinum are the best romhack from a nuzlocking perspective",
            "I haven't played inclement emerald yet, but ren plat is so fun, I already beat it with hardcore rules and I'm doing it again for shits and giggles",
            "Renplat strikes the right balance of controllable and uncontrollable variables that makes the game enjoyable to nuzlocke. \n\nIn inclement emerald, you can modify literally any characteristic of a Pokémon except the Pokémon itself with a reasonable difficulty to match."
        ]
    },
    "Just my luck": {
        "title": "Just my luck",
        "score": 5,
        "url": "https://www.reddit.com/gallery/1dr4wy0",
        "content": "\nThis was a random encounter and I hit save right as the battle started, is this doable or a lost cause? I only have 1 turn. I wasn’t actively trying to hunt legendaries and am super bummed I don’t have a move to keep them from running",
        "num_comments": 2,
        "comments": [
            "I'm not sure if this is what you're worried about, but if you're banning legendaries, this encounter is ineligible anyway, so you can just run and reroll. Even if you aren't, Roamer clause is a thing in HG/SS. Meaning you can just chuck a ball at it and reroll your encounter anyway if you miss out on the catch.",
            "The nice thing about banning legendaries is that when this happens to me it isn't an eligible encounter so I can just let it run and then reroll my encounter"
        ]
    }
}