{
    "Game Ready & Studio Driver 555.99 FAQ/Discussion": {
        "title": "Game Ready & Studio Driver 555.99 FAQ/Discussion",
        "score": 188,
        "url": "https://www.reddit.com/r/nvidia/comments/1d7xdbv/game_ready_studio_driver_55599_faqdiscussion/",
        "content": "# Game Ready & Studio Driver 555.99 has been released.\n\n**Article Here**: [https://www.nvidia.com/en-us/geforce/news/pax-dei-elden-ring-shadow-of-erdtree-geforce-game-ready-driver/](https://www.nvidia.com/en-us/geforce/news/pax-dei-elden-ring-shadow-of-erdtree-geforce-game-ready-driver/)\n\n**Game Ready Driver Download Link**: [Link Here](https://us.download.nvidia.com/Windows/555.99/555.99-desktop-win10-win11-64bit-international-dch-whql.exe)\n\n**Studio Driver Download Link**: [Link Here](https://us.download.nvidia.com/Windows/555.99/555.99-desktop-win10-win11-64bit-international-nsd-dch-whql.exe)\n\n**New feature and fixes in driver 555.99:**\n\n**Game Ready** \\- This new Game Ready Driver provides the best gaming experience for the latest new games supporting DLSS 3 technology including Pax Dei and Still Wakes the Deep. Further support for new titles includes the launch of the Elden Ring Shadow of the Erdtree expansion.\n\n**Applications** \\- The June NVIDIA Studio Driver provides optimal support for the latest new creative applications and updates announced at Computex including the NVIDIA RTX Remix Toolkit and REST API, VLC Media Player with RTX Video HDR support, and the arrival of DLSS 3.5 support in Womp, Chaos Vantage and D5 Render.\n\n**Fixed Gaming Bugs**\n\n* \\[GeForce Experience\\] Flickering or black screen if Instant Replay is enabled \\[4665009\\]\n* \\[NVIDIA app\\] FPS overlay showing NA in multiple games \\[4608943\\]\n\n**Fixed General Bugs**\n\n* CUDA 12.5 does not work with CUDA enabled Docker images \\[4668302\\]\n* \\[Microsoft New Teams/Outlook\\] Visual artifacts when MFAA is enabled from the NVIDIA Control Panel \\[4608670\\]\n* LG OLED48C4 TV is not detected as G-SYNC Compatible \\[4645783\\]\n* LG 32GS95UE is not detected as G-SYNC Compatible \\[4564083\\]\n\n**Open Issues**\n\n* \\[GeForce Experience\\] Driver page may not detect new driver has been installed until user reboots PC \\[4662117\\]\n\n**Additional Open Issues from** [GeForce Forums](https://www.nvidia.com/en-us/geforce/forums/game-ready-drivers/13/543951/geforce-grd-55599-feedback-thread-released-6424/)\n\n* \\[GeForce Experience\\] Driver page may not detect new driver has been installed until user reboots PC \\[4662117\\]\n* GeForce Experience Performance Monitoring overlay may stop refreshing GPU information \\[4679970\\]\n\n**Driver Downloads and Tools**\n\nDriver Download Page: [Nvidia Download Page](https://www.nvidia.com/Download/Find.aspx?lang=en-us)\n\nLatest Game Ready Driver: **555.99** WHQL\n\nLatest Studio Driver: **555.99** WHQL\n\nDDU Download: [Source 1](https://www.wagnardsoft.com/) or [Source 2](http://www.guru3d.com/files-details/display-driver-uninstaller-download.html)\n\nDDU Guide: [Guide Here](https://docs.google.com/document/d/1xRRx_3r8GgCpBAMuhT9n5kK6Zse_DYKWvjsW0rLcYQ0/edit)\n\n**DDU/WagnardSoft Patreon:** [**Link Here**](https://www.patreon.com/wagnardsoft)\n\nDocumentation: [Game Ready Driver 555.99 Release Notes](https://us.download.nvidia.com/Windows/555.99/555.99-win11-win10-release-notes.pdf) | [Studio Driver 555.99 Release Notes](https://us.download.nvidia.com/Windows/555.99/555.99-win10-win11-nsd-release-notes.pdf)\n\nNVIDIA Driver Forum for Feedback: [Driver 555.99 Forum Link](https://www.nvidia.com/en-us/geforce/forums/game-ready-drivers/13/543951/geforce-grd-55599-feedback-thread-released-6424/)\n\n**Submit driver feedback directly to NVIDIA**: [Link Here](https://forms.gle/kJ9Bqcaicvjb82SdA)\n\n**RodroG's Driver Benchmark:** TBD\n\n[r/NVIDIA](https://new.reddit.com/r/NVIDIA/) Discord Driver Feedback: [Invite Link Here](https://discord.gg/y3TERmG)\n\nHaving Issues with your driver? Read here!\n\n**Before you start - Make sure you Submit Feedback for your Nvidia Driver Issue**\n\nThere is only one real way for any of these problems to get solved, and that’s if the Driver Team at Nvidia knows what those problems are. So in order for them to know what’s going on it would be good for any users who are having problems with the drivers to [Submit Feedback](https://forms.gle/kJ9Bqcaicvjb82SdA) to Nvidia. A guide to the information that is needed to submit feedback can be found [here](http://nvidia.custhelp.com/app/answers/detail/a_id/3141).\n\n**Additionally, if you see someone having the same issue you are having in this thread, reply and mention you are having the same issue. The more people that are affected by a particular bug, the higher the priority that bug will receive from NVIDIA!!**\n\n**Common Troubleshooting Steps**\n\n* Be sure you are on the latest build of Windows 10 or 11\n* Please visit the following link for [DDU guide](https://goo.gl/JChbVf) which contains full detailed information on how to do Fresh Driver Install.\n* If your driver still crashes after DDU reinstall, try going to Go to Nvidia Control Panel -> Managed 3D Settings -> Power Management Mode: Prefer Maximum Performance\n\nIf it still crashes, we have a few other troubleshooting steps but this is fairly involved and you should not do it if you do not feel comfortable. Proceed below at your own risk:\n\n* A lot of driver crashing is caused by Windows TDR issue. There is a huge post on GeForce forum about this [here](https://forums.geforce.com/default/topic/413110/the-nvlddmkm-error-what-is-it-an-fyi-for-those-seeing-this-issue/). This post dated back to 2009 (Thanks Microsoft) and it can affect both Nvidia and AMD cards.\n* Unfortunately this issue can be caused by many different things so it’s difficult to pin down. However, editing the [windows registry](https://www.reddit.com/r/battlefield_4/comments/1xzzn4/tdrdelay_10_fixed_my_crashes_since_last_patch/) might solve the problem.\n* Additionally, there is also a tool made by Wagnard (maker of DDU) that can be used to change this TDR value. [Download here](http://www.wagnardmobile.com/Tdr%20Manipulator/Tdr%20Manipulator%20v1.1.zip). Note that I have not personally tested this tool.\n\nIf you are still having issue at this point, visit [GeForce Forum for support](https://forums.geforce.com/default/board/33/geforce-drivers/) or contact your manufacturer for RMA.\n\n**Common Questions**\n\n* **Is it safe to upgrade to <insert driver version here>?** *Fact of the matter is that the result will differ person by person due to different configurations. The only way to know is to try it yourself. My rule of thumb is to wait a few days. If there’s no confirmed widespread issue, I would try the new driver.*\n\n**Bear in mind that people who have no issues tend to not post on Reddit or forums. Unless there is significant coverage about specific driver issue, chances are they are fine. Try it yourself and you can always DDU and reinstall old driver if needed.**\n\n* **My color is washed out after upgrading/installing driver. Help!** *Try going to the Nvidia Control Panel -> Change Resolution -> Scroll all the way down -> Output Dynamic Range = FULL.*\n* **My game is stuttering when processing physics calculation** *Try going to the Nvidia Control Panel and to the Surround and PhysX settings and ensure the PhysX processor is set to your GPU*\n* **What does the new Power Management option “Optimal Power” means? How does this differ from Adaptive?** *The new power management mode is related to what was said in the Geforce GTX 1080 keynote video. To further reduce power consumption while the computer is idle and nothing is changing on the screen, the driver will not make the GPU render a new frame; the driver will get the one (already rendered) frame from the framebuffer and output directly to monitor.*\n\nRemember, driver codes are extremely complex and there are billions of different possible configurations. The software will not be perfect and there will be issues for some people. For a more comprehensive list of open issues, please take a look at the Release Notes. Again, I encourage folks who installed the driver to post their experience here... good or bad.\n\n*Did you know NVIDIA has a Developer Program with 150+ free SDKs, state-of-the-art Deep Learning courses, certification, and access to expert help. Sound interesting?* [Learn more here](https://nvda.ws/3wCfH6X)*.*",
        "num_comments": 751,
        "comments": [
            "Did they fixed broken gpu acceleration with some Vst Plugins (like FabFilter Pro-q3) that use open gl?\n\nGot this problem with 555.85, after many years it's appeared again (i remember same approx 2015-2016).\n\nDAW (FL Studio 21 here) freezing  when these vst are used (very badly if used in Linear Phase mode)\n\nDisabling gpu acceleration via regedit on Fabfilter registry everything back normal, but of course it become laggy at show frequencies.\n\nAnd got nasty problems with 555.85 on my usb audio interface Motu m2, which it start distorting sounds heavily when playing audio with MPC-BE while doing other stuff with pc.\n\nSeems some latency problems, connected with that  i said upper, while in gaming no problems at all with 555.85.\n\nRolled back to 552.22 ad everything is back normal as usual.",
            "555.99 is crashing to desktop on the Steam version of Halo Infinite during loading screen / shader compilation.",
            "Multiple screen RTX HDR ¯\\\\_(ツ)_/¯",
            "This driver update stole my wife",
            "The last two drives are broken for Samsung monitors that are using DSC. Let the bug tracking journey begin.",
            "With the amount of complaints these drivers are getting, you start wondering why that bug tracker isn't filled yet, I'm sure there's a lot more looking at the comments the past few months, a lot of people having similiar issues with each other, can't be coincidences.\n\nI hope NVIDIA is cooking.. and not just all about this godforsaken thing that's called AI.",
            "555.99 was the first driver that gave me \"real\" issues on my new PC since I bought it.\n\nPerformance dropped a bit (1-2fps both from average and 1% Low) but was not the worst part:\n\n* Halo Infinite crashes on every boot while recompiling shaders (known issue but still sucks)\n* My 4080 started to consume more Watts in the same games & scenarios, getting hotter, therefore increasing fans' RPM to the point it was LOUD for the very first time since I have it\n* Win11 Explorer first opening became laggier (subsequent openings were fine)\n\nSomething is definitely off with these (but also 555.85 felt a little worse than pre-555).\n\nI used DDU to remove it completely in Safe Mode and clean installed 552.44 again and ALL the issues above were gone and everything went back to normal: fast, smooth, slient.\n\nI think I'll stick with it until the community won't accept another \"real\" best candidate after.",
            "Why do they seem to be having so many issues with the recent drivers? Did they change the development team or something?",
            "This driver breaks NVENC 10-bit encoding. 8-bit encoding works normally. With 10-bit encoding, quality settings or bit rate settings are ignored. The files produced are small and inferior quality. Rolling back to driver 552.44 resolves the issue. Tested with a 2080 super and laptop 4090. Tested with ffmpeg based programs. Forgot to add, tested with both the Studio and Game Ready driver.",
            "3DMark Timespy\n\n537.58  \nScore: 13538  \nTest 1: 88.98 FPS  \nTest 2: 77.06 FPS\n\n555.99  \nScore: 8887  \nTest 1: 59.48 FPS  \nTest 2: 49.81 FPS\n\nYeah...rollback."
        ]
    },
    "Tech Support and Question Megathread - June 2024 Edition": {
        "title": "Tech Support and Question Megathread - June 2024 Edition",
        "score": 8,
        "url": "https://www.reddit.com/r/nvidia/comments/1d5fcng/tech_support_and_question_megathread_june_2024/",
        "content": "We're consolidating **all** tech support posts and questions into this **monthly** tech support and questions megathread.\n\nIt should be noted, r/NVIDIA does not represent NVIDIA in any capacity unless specified. There's also no guarantee NVIDIA even read this subreddit, if you have an issue, criticism or complaint; it's recommended to post it on the official GeForce forum.\n\n**All Tech Support posts that do not include sufficient information will be removed without warning**\n\nBefore creating a Tech Support post, please see our additional resources section, it solves a lot of common issues.\n\nTL;DR: **DO: Use the template. DO NOT: \"i have driver issue please help not 60fps!!\"**\n\n# For Tech Support Posts\n\nPlease use this template below - posts without adequate information will be removed, we can't help you unless you provide adequate information.\n\n**Status:** UNRESOLVED/SOLVED - please update if your issue is resolved\n\n**Computer Type:** State if your computer is a Desktop or Laptop and the brand/model if possible, e.g Desktop, custom built\n\n**GPU:** Provide the model, amount of VRAM and if it has a custom overclock, e.g. GTX 1070, 8GB of VRAM, no overclock\n\n**CPU:** Provide the model and overclock information if possible, e.g. Intel Core i5 6600k, no overclock\n\n**Motherboard:** Provide the model and current BIOS version if possible, e.g. MSI Z170A GAMING M9 ACK, latest BIOS (1.8)\n\n**RAM:** Provide the model and overclock information if possible, e.g. Corsair 8GB (2x4GB) DDR4 2400MHz, XMP enabled, no overclock\n\n**PSU:** Provide the model and its rated wattage and current output if possible, e.g. EVGA 850 BQ, 850W, 70amps on the 12v rail - for laptops you can leave this blank\n\n**Operating System & Version:** State your OS and version, also please state if this is an upgrade or clean install, e.g. Windows 10 build 1607 64bit, upgrade from Windows 8.1\n\n**GPU Drivers:** Provide the current GPU driver installed and if it’s clean install or upgrade, e.g. 376.33, clean install\n\n**Description of Problem:** Provide as much info about the issue as you possibly can, images and videos can be provided as well.\n\n**Troubleshooting:** Please detail all the troubleshooting techniques you’ve tried previously, and if they were successful or not, e.g. tried clean install of GPU drivers, issue still occurs. Please update this as more suggestions come in\n\n# For Question & Answer Post\n\nAdditionally, this thread will be used to answer general questions that may not warrant having their own thread -- this could be questions about drivers, prices, builds, what card is the best, is this overclock good etc…\n\nPlease don't downvote questions for the sake of helping others. We will also sort the post randomly so every question can be seen and answered.\n\nIf you don't have any tech support issues or questions, please contribute to the community by answering questions.\n\n# Here are some additional resources:\n\n* [Display Driver Uninstaller (DDU) tutorial](https://docs.google.com/document/d/1xRRx_3r8GgCpBAMuhT9n5kK6Zse_DYKWvjsW0rLcYQ0/edit)\n* [Repairing/Maintaining/Cleaning a Windows 8, 8.1 or 10 Image](https://docs.google.com/document/d/1Y7HOS6UiOBXAWtNFBJ0w70f14izRQcBYD9puuSw6Ghs/edit)\n* [How to repair/verify game files](https://docs.google.com/document/d/1Ba3RjEBnFcnUec0axX1ETgb1ndKvxSAX2YGQGu_leL0/edit)\n* [Malware/Virus Removal Guide](https://docs.google.com/document/d/16er6ZmSj4nUHBP-80EQLZjNgLNIDHyE93u0Vu8e6wV0/edit)\n* MemTest86 tutorial by [DigitalStorm](https://www.youtube.com/watch?v=e91hb60iPew) \\- faulty memory can cause a lot of problems, running MemTest86 will verify if your memory is faulty or not\n* You can also check the sidebar for helpful links, we update it regularly\n* You can visit our [Discord](http://discord.gg/nvidia) to chat with other NVIDIA users\n\nAgain, it should also be noted, r/NVIDIA is not a dedicated Tech Support forum and your question/issue may not be resolved. We also recommend checking out the following\n\n* r/TechSupport \\- A Subreddit dedicated entirely to answering Tech Support related questions/queries\n* [GeForce Support](http://www.geforce.com/support) \\- answers to the most common questions with a knowledgebase available 24x7x365\n* [Official GeForce Forum](https://forums.geforce.com/) \\- Posting your complaints, criticism and issues here will increase the chances an NVIDIA employee sees it.\n* [NVIDIA Support](http://nvidia.custhelp.com/app/home/) Includes live chat and email\n\nIf you think you’ve discovered an issue, it’s crucial you report it to NVIDIA, they can't fix an issue unless they know it exists.\n\nHere’s a guide on how to submit [valuable feedback](http://nvidia.custhelp.com/app/answers/detail/a_id/3141)\n\nAnd here’s where you [submit feedback](https://forms.gle/kJ9Bqcaicvjb82SdA)\n\nIf you have any questions, or think this template post could be improved for future use, please message the [/r/NVIDIA moderators](https://www.reddit.com/message/compose?to=%2Fr%2Fnvidia)\n\nWant to see previous version of this thread? Click [here](https://www.reddit.com/r/nvidia/search?q=Tech+Support+Megathread&sort=new&restrict_sr=on)",
        "num_comments": 62,
        "comments": [
            "4070 Ti Super\n\nMSI Gaming X Slim $640\n\nMSI Ventus 2X $530\n\nGaming X Slim worth $110 more?  Worried the 2X may be noisy but I'm also not afraid of undervolting.",
            "**Status:** UNRESOLVED\n\n**Computer Type:** Desktop (with two monitors)\n\n**GPU:** ASUS RTX 3060 TUF Gaming OC GPU (PCIe 4.0, 12GB GDDR6, 3584 CUDA, 2x HDMI 2.1, 3X DP 1.4a, TUF-RTX3060-O12G-GAMING)\n\n**CPU:** AMD 3rd Gen Threadripper 3960X CPU (24-Core, 48-Thread, 3.8GHz, 280W, CPU Benchmark 47201)\n\n**Motherboard:** Unknown\n\n**RAM:** 3rd Generation Threadripper Performance Memory: 32GB (2x16GB) Corsair Vengeance DDR4 3200 CL16 (CMK32GX4M2B3200C16 kit)\n\n**PSU:** Corsair HX1200 Modular PSU\n\n**Operating System & Version:** Ubuntu 22.04.4 LTS\n\n**GPU Drivers:** Unknown\n\n**Description of Problem:**   \nI tried to update by nvidia drivers because a video game was complaining that they were out of date. After executing: **sudo ubuntu-drivers install**, and restarting, my right monitor is black for the right 60-ish percent, and normal on the left side. The other monitor works perfectly. When I unplug the monitor that works perfectly, the flawed monitor corrects itself (without rebooting or taking any other action), and is fully usable. Also, even in the black portion of the right monitor, the mouse arrow is visible.\n\n**Troubleshooting:** \n\n**>nvidia-cmi**  \n*Failed to initialize NVML: Driver/library version mismatch*  \n*NVML library version: 535.171*\n\nCommands I executed (which may have made things worse, IDK):  \n  \n**> sudo apt-get purge '\\^nvidia-.\\*'**  \n**> sudo apt-get autoremove**  \n**> sudo apt-get autoclean**  \n**> sudo add-apt-repository ppa:graphics-drivers/ppa**  \n**> sudo ubuntu-drivers autoinstall**  \n**> sudo reboot**\n\nWhen that didn't work, I tried again, but replaced the first line with:\n\n**> sudo apt-get purge 'nvidia-.\\*'**\n\nAnyway, my right monitor is still 60% black, so I didn't fix things ore make them obviously worse. However, before I started mucking about with things, the nvidia-cmi command gave a different response.",
            "**Status:** UNRESOLVED\n\n**Computer Type:** Custom Built Desktop\n\n**GPU:** RTX 3080 Founders\n\n**CPU:** Ryzen 7 5800X\n\n**Motherboard:** MSI B450 Tomahawk\n\n**RAM:** 32GB DDR4 G.Skill Speed Unknown\n\n**PSU:** Seasonic, Unknown specific Model, 850Watts\n\n**Operating System & Version:** Windows 11, fresh clean install 2 days ago\n\n**GPU Drivers:** Current NVidia drivers\n\n**Description of Problem:** I upgraded to the new NVIDIA App (If you haven't seen it it's their replacement for GeForce Experience) and I'm having an issue with the GPU Power Maximum feature. Namely, in GeForce Experience, I could turn the power down and, as expected my GPU would use less power. Now as expected at 100% power maximum my 3080 gets hit for 150 watts. But if I turn it down to 32% maximum (its minimum) it gets hit for...150 watts, no change at all. Previously it would drop down to some 45ish watts at that maximum. Has anybody else experienced this? Is it a bug? Any advice?\n\n**Troubleshooting:** Everything is a clean install. Power Limit works if I uninstall Nvidia App and go back to GeForce Experience, no setting I could find in Nvidia App seems to have had any effect.",
            "I already fixed it but I'll post it here in case anyone else has the same issues:\n\n**Status:** SOLVED\n\n**Computer Type:** Laptop, Lenovo brand (2021 6th gen)\n\n**GPU:** Laptop 3080\n\n**CPU:** Some Ryzen 9\n\n**Motherboard:** idk but it's not the issue anyway\n\n**RAM:** 32GB (embarrassing MHz)\n\n**PSU:** Manufacturer's laptop power brick\n\n**Operating System & Version:** Windows 11 Home, version 22H2, last fresh install a year ago.\n\n**GPU Drivers:** 555.99, upgraded from previous versions (I might've leapfrogged an update or two this year).\n\n**Description of Problem:** In recent weeks (~~not sure when it began~~ since turning off HDR on all displays) when the second display (an LG TV) turns off (i.e. usually due to inactivity), turning it back on would not present my expected 2nd and extended desktop display but instead would cause the primary display (laptop) to go blank, flicker, then go dead and the system would no longer respond to power button taps, blind use of WinKey + P (cycling displays) or closing the lid (sleep) requiring the laptop power button to be held to turn it off. Oh and the TV would begin cycling through its no signal generic artwork having lost signal around the time the laptop screen gave up.\n\nIn Event Viewer, among the ruckus, there would be a combo of:  \n`Warning (Yellow Triangle) | [date]: at time of problem | Source: Display | Event ID: 4101 | Task Category: None | General: Display driver nvlddmkm stopped responding and has successfully recovered.`  \n& immediately preceding that:  \n`Error (red circle) | [date]: three seconds prior to above | Source: nvlddmkm (Nvidia driver in system32) | Event ID: 153 | Task Category: None | General: The description for Event ID 153 from source nvlddmkm cannot be found. Either the component that raises this event is not installed on your local computer or the installation is corrupted. You can install or repair the component on the local computer.`\n\n`If the event originated on another computer, the display information had to be saved with the event.`\n\n`The following information was included with the event:`\n\n`\\Device\\00000122`\n\n`Restarting TDR occurred on GPUID:100`\n\n`The message resource is present but the message was not found in the message table`\n\n**Troubleshooting:** Found this archived thread: [https://www.reddit.com/r/nvidia/comments/12l01wf/nvlddmkm\\_4090\\_crash\\_solved/](https://www.reddit.com/r/nvidia/comments/12l01wf/nvlddmkm_4090_crash_solved/) in which the top reply suggests adding permissions for User in the Properties of the troublesome driver (nvlddmkm.sys) so it can stop failing at its task for whatever reason. I did also need to take ownership of the driver first via this guide as I did not have Edit Permissions in the Security tab of the Properties: [https://www.thewindowsclub.com/take-ownership-windows-8](https://www.thewindowsclub.com/take-ownership-windows-8)\n\nOnce done I restarted the laptop and after logging in and reaching my desktop I turned off the TV, waited five seconds, turned it back on and had no issues with the laptop picking up my the 2nd extended display 🎉",
            "**Status:** UNRESOLVED\n\n**Computer Type:** Desktop Custom Build\n\n**GPU:** Geforce gtx 1080\n\n**CPU:** intel i7-44790k 4.00 ghz\n\n**Motherboard:** asrock\n\n**RAM:** 6gb ddr3 all i remember\n\n**PSU:** idk\n\n**Operating System & Version:** Windows 8.1 \n\n**GPU Drivers:** 474.11\n\ni just changed my g card from 970 to 1080 I was having issues updating it b4 it would update I restarted and it deleted the icon (I have it circled in the pic) and I have no sound and it still says to install the update I just installed. the only way to fix it is to delete the driver and restart to so it puts the of bk in.. idk what to do to fix this I don't mess with computers often so I don't have a clue as what to do. i will be updating my windows to 10 or 11 next month which I think may be the issue as its causing issues with everything else too but is there a version I can dl that will work with 8.1? another issue is I can pick my had from the list when I hit f11 but I can't find it to set it in the boot order this did this when I changed cards idky.\n\nhttps://preview.redd.it/9j5n6vuoa07d1.jpeg?width=331&format=pjpg&auto=webp&s=93fa9c93590e83998071b8671d66017cf3230f4f",
            "**Status:** UNRESOLVED\n\n**Computer Type:** Desktop\n\n**GPU:** Asus TUF GAMING OC GeForce RTX 4070 Ti SUPER 16 GB - no overclock\n\n**CPU:** AMD Ryzen 7 7800X3D 4.2 GHz 8-Core - no overclock\n\n**Motherboard:** MSI MAG X670E TOMAHAWK WIFI ATX AM5 - latest BIOS\n\n**RAM:** 2 x 32 GB Corsair Vengeance DDR5-6600 - XMP, no overclock\n\n**PSU:** Corsair HX Series HX1000, 1000W\n\n**Operating System & Version:** Windows 11, clean install\n\n**GPU Drivers:** GeForce Game Ready Driver 555.99\n\n**Description of Problem:** Can't create custom resolutions from Nvidia Control Panel\n\n**Troubleshooting:** Recently bought the Zowie XL2586X but I can't seem to create custom resolutions using Nvidia's Control Panel. No matter what I do, the \"Customise...\" button is greyed out, only lighting up for a quick second after changing resolutions just to go back to being greyed out.\n\nI have tried almost everything possible in the Control Panel:\n\n- there's no DSR to be turned off\n\n- different scaling modes\n\n- using display and GPU to perfrom the scaling\n\n- different stretching modes\n\n- tried checking \"override the scaling mode set by games and programs\"\n\n- tried almost every combination of the 3D program settings\n\n- tried turning down the HZ of the monitor from 540, to 500, to 480, to 360, to 240, to 144 and even 120 HZ and still doesn't make any difference\n\n- did Windows updates\n\n- updated every possible driver\n\n- tried using CRU to create the custom resolution to no avail\n\n\n\nThe resolution I'm trying to create is 1080x1080, one which I had no problems with my previous monitors, especially with my former one - XL2546K\n\nhttps://preview.redd.it/z3rllt1j9y7d1.png?width=404&format=png&auto=webp&s=c17c22abc14c7e048560cfa9098f86149dec7241",
            "Please Help.\n\n# UNSOLVED\n\n**SUMMARY/TROUBLESHOOTING**\n\nI bought a ASUS ROG Zephyrus M16 gaming laptop about a year ago and have managed to make the 3070ti in it practically useless. Out of the box it ran amazing, running modern game titles at 165hz on high/ultra with no issues and great framerates. One day while gaming I was getting \"half\" the performance (half the frames than normal and some lag here and there). I've dealt with driver issues before on my custom desktop AMD build and thought it was that. Re-installed drivers, problem persisted, so I went ahead and downloaded DDU and did a factory reset on the laptop...only to realize while I was doing the reset and whatnot that the power supply was unplugged leading to the downgrade in performance. Since then, I haven't been able to run a game on the computer with anything higher than 20-30 frames. I've run memory diagnostics, no problems found. Multiple driver re-installs, updates, disabling and re-enabling of the display adapter to see if it was running on integrated graphics, nothing helped. Changing in-game settings(graphic quality, G-sync, render resolution, windows \"Hardware accelerated GPU scheduling\" toggled on and off, nothing has made any difference. I even bought a cooling pad to see if it was temperature-related. Below are the benchmark results I've been getting and the settings I am using on the ASUS Hardware software. Any suggestions are appreciated, I have yet to open the laptop  as I've been wanting to avoid that but can if needed, although I doubt it has accumulated enough gunk in a year and a half to cause these type of problems.\n\n**SPECS**\n\nASUS ROG Zephyrus M16 GU603ZW\n\nGPU: 3070 ti 8gb no overclock\n\nCPU: 12th Gen Intel i9-12900H 2500Mhz 14 core no overclock\n\nRAM: 16 Gb DDR5 4800mhz\n\nSMBIOS: 3.5\n\nOS: Windows 11 Home\n\nclean install of drivers\n\n\\*below are pics of ASUS hardware software and benchmark results\\*\n\nhttps://preview.redd.it/n4093jlx8y3d1.png?width=2300&format=png&auto=webp&s=6d44b119ca964c96068092f962ccc3ee98072a17",
            "Which is the most stable driver for mobile RTX4070?",
            "unsolved\n\nthe geforce experience won't connect to the internet so i can't log in to use it, already tried uninstalling and reinstalling it and restarting the pc, neither of them worked",
            "Is there a list of what games have Game Ready drivers? All I can find are the ones added by the most recent update."
        ]
    },
    "ASUS 4070 Ti Super Dual Oc 16GB Questions": {
        "title": "ASUS 4070 Ti Super Dual Oc 16GB Questions",
        "score": 31,
        "url": "https://www.reddit.com/gallery/1dlqpa1",
        "content": "I have this GPU myself but I need more answers to it, there's barely any reviews to it online. I'm trying to also figure out if my temps are good or not. On Most games at 1440p max settings I gather around 68-73c depending on the game with a slightly adjusted default fan curve. Case fans are artic p12 max even on the radiator at normal speed. My Cpu is 7600x. Is it causing a bottleneck?? I need a pc wizards advice because I watch YouTubers benchmarks with higher end cards with temps around 58-64 I'm over here stressing like why is mine cooking to 70's? I should also mention most of my games I don't like to use DLSS unless I have to for extra frames.",
        "num_comments": 20,
        "comments": [
            "https://preview.redd.it/o31h0uhc938d1.jpeg?width=1179&format=pjpg&auto=webp&s=66879ab7745375bd3c17544556baa9c3ae47cc2d\n\nYou’re good. You have a small compact 2 fan card. Nvidia default limit is 83\\*. You can raise that to 90\\* in Afterburner if you want.",
            "No to every single question. \n\nIf you want lower temps increase the Fan speed.\nIf you dont want louder noise dont increase fan speed. \n\nNo its not a bottleneck for godsake stop watching weird yt videos benchmark videos. Watch Hardware unboxed. Im not even sure why you are watching videos about your card even though you have it installed. \n\n\nGPU load  is higher without dlss thus higher temp.",
            "OC BIOS or silent? There is a switch near the power connector on top.",
            "No 70s is fine for a 2 fan. You are fine! You are pushing alot of power through this. But the issue is some people don't realize the asus dual has 2 models. One is the evo which has sligjtly smaller fans and a smaller heatsink and the other is the none evo which has better temps due to 100mm fans instead of 90mm and has a bigger hestsink with better fins. Sneaky little move from asus it's why I always get the white one with duals because none of the whites are evos. Bit dude 70c is perfectly fine. My 4070 super dual is around 67 to 70c under full load.\n\nAlap the 7600x is a fine cpu to use. You may see a slightly bottleneck at 1080p but it's not much and in 1440p and 4k you won't really notice anything. I say it's not really a bottleneck. Enjoy man nothing wrong with your card at all. Actually the asus dual is the only dual fan card say performs at 3 fan card level. Its the top of the list for duals and the performnace is so close to 3 fans it doesn't even matter.",
            "Except for strix, Asus hardware does run a little hotter. But those temps are fine. 7600x is more than capable of handling 4070ti super.",
            ">  around 68-73c \n\ncompletely fine  \n\n> My Cpu is 7600x. Is it causing a bottleneck??   \n\njust check the GPU utilization while playing, if its near 100% then no bottleneck.",
            "73c and even a little higher are completely fine temps.Only +80c temps under load are where you should start to get worried. 5 7600x is very good for the 4070 ti super in 1440p. In 1080p the 4070 ti super is slightly bottlenecked by the 7600x.",
            "Temps are normal. Your CPU is not bottlenecking the card. \n\nIf you're concerned run a slightly more aggressive fan curve. Have it ramp up to 70% fan speed at 50'c, and 90% at 70'c. You'll find the more quickly you start cooling it off, the lower the overall temps will be.\n\nEdit. If you're not running  intake fans, or intake fans are going across a rad, your temps will be higher.",
            "Honestly the biggest problem seems to be that the gpu isn't in the top slot, I am not 100% sure",
            "One of the PC I built recently has a Asus dual 4070S paired with a 7600X on a 1440p monitor and runs 65-70C, when compared to a PC I built a while back with a MSI trio 4070 Ti with a 7700X on 3440x1440 ultra wide runs 66-70C, they perform nearly identical and run quiet and relatively cool.  The dual is tiny in comparison to the Ti.  The difference is only 50 watts between the 4070S and the Ti/Ti S, hardly enough to really matter.\n\nThere are two bios on the cards you use a switch to set.  On the dual if you're worried just use the performance one.  My testing was done on silent bios on 4070S dual.\n\nThe 7600 is not a bottleneck, but if you want to improve its performance activate PBO and use core offset in the BIOS, just set -20 all core and you should be fine, it'll basically keep the CPU at max speed forever with any half ass cooler like that.  And of course make sure your RAM speed is set properly."
        ]
    },
    "HUB - When Are Next-Gen GPUs Launching? Buy Now or Wait? - June GPU Pricing Update": {
        "title": "HUB - When Are Next-Gen GPUs Launching? Buy Now or Wait? - June GPU Pricing Update",
        "score": 8,
        "url": "https://youtu.be/ZnjO1spYcxg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "5090 will cost $1m give me upvotes pls",
            "TL DW: Wait for 5000 series if you have 3070, 3080 or 3090.",
            "The hub community is delusional af",
            "im excited for the rtx 5080xtx ti super gre",
            "I hope they learned some lessons. No price increases for 5000 series, and take care of supply. I know that’s not a strong economic approach for them, but the corporate greed is insane.",
            "Gonna use my Nvidia dividends to get that 5090 when it drops.",
            "Rtx 50 series \n\n2999$ rtx 5080\n1999$ rtx 5070",
            "Upvoted",
            "It's a circlejerk for AMD fanboys. This is where they gather and give a pat on their backs on how AMD is destroying Nvidia in consumer GPU space.",
            "Haha when will you sell?"
        ]
    },
    "Jensen Huang recently Hinted what DLSS 4 could bring. ": {
        "title": "Jensen Huang recently Hinted what DLSS 4 could bring. ",
        "score": 828,
        "url": "https://i.redd.it/nz2lpsanqu7d1.png",
        "content": "",
        "num_comments": 345,
        "comments": [
            "DLSS 4.0 double your VRAM for free...",
            "AMD better just put all their effort into 4-dimensional V-Cache at this point cause they ain't gonna win the arms race on the GPU side anymore",
            "This is how we‘ll achieve photorealistic graphics. We‘ll just replace so much with AI that we can put all the compute into lighting and textures.",
            "As a 3D artist I find nvidias so far ahead of the curve on things, Instant-NGP was nuts, Neuralangelo was even better, over in their Omniverse platform I couldn't believe how amazing Audio2Face was when I first started playing around with it.\n\nOmniverse in and of itself is just an absolute gem for development. One of the professors at the local college here was having an insecure bitchfit about his technical level, he was looking at my screen and gave a patronizing \"We are focusing on realtime, that looks nice but its useless\" while I was working on a small pyro sim. He lost his shit when I pointed out it was realtime. Dork.\n\nGod damn I love Omniverse.",
            "In Nvidia future, game plays you!",
            "AI does not mean DLSS. He’s probably not talking about DLSS",
            "Dlss 4 is advanced ray reconstruction, 5000 series will have in built hardware for denoizer .\n\n4 may include better framegen and upscaling algorithm update .\n\nDlss 4.5 will be what you are talking about .",
            "Yeah, they've discussed AI texture decompression before.\n\nThat's one of a few things that they've been working on.",
            "\"You can use the PC as an AI assistant to help you game\"\n\nTo help... Game? People need help to play? Isn't the purpose of the game just to play it? What kind of help would be needed to play...",
            "Wake me up when there's DLSS that will generate a current gen Morrowind."
        ]
    }
}