{
    "Game Ready Driver 556.12 FAQ/Discussion": {
        "title": "Game Ready Driver 556.12 FAQ/Discussion",
        "score": 168,
        "url": "https://www.reddit.com/r/nvidia/comments/1dpqpo4/game_ready_driver_55612_faqdiscussion/",
        "content": "# Game Ready Driver 556.12 has been released.\n\n**Article Here**: [https://www.nvidia.com/en-us/geforce/news/first-descendant-geforce-game-ready-driver/](https://www.nvidia.com/en-us/geforce/news/first-descendant-geforce-game-ready-driver/)\n\n**Game Ready Driver Download Link**: [Link Here](https://us.download.nvidia.com/Windows/556.12/556.12-desktop-win10-win11-64bit-international-dch-whql.exe)\n\n**Studio Driver Download Link**: [Link Here](https://us.download.nvidia.com/Windows/556.12/556.12-desktop-win10-win11-64bit-international-nsd-dch-whql.exe)\n\n**New feature and fixes in driver 556.12:**\n\n**Game Ready** \\- This new Game Ready Driver provides the best gaming experience for the latest new games supporting DLSS 3.5 technology including The First Descendant. Further support for new titles leveraging NVIDIA DLSS technology includes the latest update for PAYDAY 3 which supports DLSS 3.\n\n**Fixed Gaming Bugs**\n\n* \\[The Last of Us Part 1\\] Out of memory error with 555.xx drivers \\[4663766\\]\n* \\[Halo Infinite\\] Crashing during initial loading screen with 555.99 driver \\[4685335\\]\n* \\[Valorant\\] In-game statistics incorrectly shows high latency with 555.xx drivers \\[4668309\\]\n\n**Fixed General Bugs**\n\n* Notebook mux switch is blocked when Overwolf application is running \\[3804893\\]\n\n**Open Issues**\n\n* \\[NVENC\\] Quality and bitrate settings are ignored at 10-bit encoding \\[4697900\\]\n* \\[GeForce Experience\\] Performance Monitoring overlay may stop refreshing GPU information \\[4679970\\]\n\n**Additional Open Issues from** GeForce Forums\n\n* TBD\n\n**Driver Downloads and Tools**\n\nDriver Download Page: [Nvidia Download Page](https://www.nvidia.com/Download/Find.aspx?lang=en-us)\n\nLatest Game Ready Driver: **556.12** WHQL\n\nLatest Studio Driver: **555.99** WHQL\n\nDDU Download: [Source 1](https://www.wagnardsoft.com/) or [Source 2](http://www.guru3d.com/files-details/display-driver-uninstaller-download.html)\n\nDDU Guide: [Guide Here](https://docs.google.com/document/d/1xRRx_3r8GgCpBAMuhT9n5kK6Zse_DYKWvjsW0rLcYQ0/edit)\n\n**DDU/WagnardSoft Patreon:** [**Link Here**](https://www.patreon.com/wagnardsoft)\n\nDocumentation: [Game Ready Driver 556.12 Release Notes](https://us.download.nvidia.com/Windows/556.12/556.12-win11-win10-release-notes.pdf) | [Studio Driver 555.99 Release Notes](https://us.download.nvidia.com/Windows/555.99/555.99-win10-win11-nsd-release-notes.pdf)\n\nNVIDIA Driver Forum for Feedback: [Link Here](https://www.nvidia.com/en-us/geforce/forums/game-ready-drivers/13/545935/geforce-grd-55612-feedback-thread-released-62724/)\n\n**Submit driver feedback directly to NVIDIA**: [Link Here](https://forms.gle/kJ9Bqcaicvjb82SdA)\n\n**RodroG's Driver Benchmark:** TBD\n\n[r/NVIDIA](https://new.reddit.com/r/NVIDIA/) Discord Driver Feedback: [Invite Link Here](https://discord.gg/y3TERmG)\n\nHaving Issues with your driver? Read here!\n\n**Before you start - Make sure you Submit Feedback for your Nvidia Driver Issue**\n\nThere is only one real way for any of these problems to get solved, and that’s if the Driver Team at Nvidia knows what those problems are. So in order for them to know what’s going on it would be good for any users who are having problems with the drivers to [Submit Feedback](https://forms.gle/kJ9Bqcaicvjb82SdA) to Nvidia. A guide to the information that is needed to submit feedback can be found [here](http://nvidia.custhelp.com/app/answers/detail/a_id/3141).\n\n**Additionally, if you see someone having the same issue you are having in this thread, reply and mention you are having the same issue. The more people that are affected by a particular bug, the higher the priority that bug will receive from NVIDIA!!**\n\n**Common Troubleshooting Steps**\n\n* Be sure you are on the latest build of Windows 10 or 11\n* Please visit the following link for [DDU guide](https://goo.gl/JChbVf) which contains full detailed information on how to do Fresh Driver Install.\n* If your driver still crashes after DDU reinstall, try going to Go to Nvidia Control Panel -> Managed 3D Settings -> Power Management Mode: Prefer Maximum Performance\n\nIf it still crashes, we have a few other troubleshooting steps but this is fairly involved and you should not do it if you do not feel comfortable. Proceed below at your own risk:\n\n* A lot of driver crashing is caused by Windows TDR issue. There is a huge post on GeForce forum about this [here](https://forums.geforce.com/default/topic/413110/the-nvlddmkm-error-what-is-it-an-fyi-for-those-seeing-this-issue/). This post dated back to 2009 (Thanks Microsoft) and it can affect both Nvidia and AMD cards.\n* Unfortunately this issue can be caused by many different things so it’s difficult to pin down. However, editing the [windows registry](https://www.reddit.com/r/battlefield_4/comments/1xzzn4/tdrdelay_10_fixed_my_crashes_since_last_patch/) might solve the problem.\n* Additionally, there is also a tool made by Wagnard (maker of DDU) that can be used to change this TDR value. [Download here](http://www.wagnardmobile.com/Tdr%20Manipulator/Tdr%20Manipulator%20v1.1.zip). Note that I have not personally tested this tool.\n\nIf you are still having issue at this point, visit [GeForce Forum for support](https://forums.geforce.com/default/board/33/geforce-drivers/) or contact your manufacturer for RMA.\n\n**Common Questions**\n\n* **Is it safe to upgrade to <insert driver version here>?** *Fact of the matter is that the result will differ person by person due to different configurations. The only way to know is to try it yourself. My rule of thumb is to wait a few days. If there’s no confirmed widespread issue, I would try the new driver.*\n\n**Bear in mind that people who have no issues tend to not post on Reddit or forums. Unless there is significant coverage about specific driver issue, chances are they are fine. Try it yourself and you can always DDU and reinstall old driver if needed.**\n\n* **My color is washed out after upgrading/installing driver. Help!** *Try going to the Nvidia Control Panel -> Change Resolution -> Scroll all the way down -> Output Dynamic Range = FULL.*\n* **My game is stuttering when processing physics calculation** *Try going to the Nvidia Control Panel and to the Surround and PhysX settings and ensure the PhysX processor is set to your GPU*\n* **What does the new Power Management option “Optimal Power” means? How does this differ from Adaptive?** *The new power management mode is related to what was said in the Geforce GTX 1080 keynote video. To further reduce power consumption while the computer is idle and nothing is changing on the screen, the driver will not make the GPU render a new frame; the driver will get the one (already rendered) frame from the framebuffer and output directly to monitor.*\n\nRemember, driver codes are extremely complex and there are billions of different possible configurations. The software will not be perfect and there will be issues for some people. For a more comprehensive list of open issues, please take a look at the Release Notes. Again, I encourage folks who installed the driver to post their experience here... good or bad.\n\n*Did you know NVIDIA has a Developer Program with 150+ free SDKs, state-of-the-art Deep Learning courses, certification, and access to expert help. Sound interesting?* [Learn more here](https://nvda.ws/3wCfH6X)*.*",
        "num_comments": 280,
        "comments": [
            "I'm hoping they focus on stability, I've had a hard time with the drivers lately. I've had crashes to desktop, and in some cases my PC has rebooted while playing Elden Ring. Older drivers thankfully seem to fix it, but the experience has been pretty bad with newer ones.",
            "this driver is great. works fantastic on my 3080 and 24h2.",
            "have they fixed instant replay?",
            "537.58 cult checking in. Is this the driver we can FINALLY update too? \n\nNVIDIA FOCUS ON STABILITY FOR CRYING OUT LOUD.",
            "So I just tested it out. So far on the 4070 super it has improved my frames anywhere from 1 to 6 fps on games. I've yet to see a reduction and no stuttering which I had issues with on the last driver. It's one of the bugger uplifts I've seen from just one driver update.",
            "537.58 to this (display driver only) and noticed no difference.. yet. Latency is still low and my biggest issue with Chromium apps checkerboarding is gone with the latest Windows 11 update.\n\nEdit: I noticed that while capped fps is fine, uncapped my GPU gets hotter than I’ve ever seen it in game menus 80 degrees and 98 hot spot. This is in Halo Infinite on the latest Windows 11 Pro ver.",
            "Win 11,3080. Performance is a lot better than the last drivers for me. No issues so far. Btw, msi released a bios Update which could be interesting for rtx 40... Users...",
            "Anyone got any info on as to if the 555.99 stuttering issues are still present or should i keep my drivers at 552.22 for the moment?",
            "Yes, Just in time for The First Descendant!",
            "This driver finally fixed the chromium issue on Windows 10 it seems. Can't remember the last time it worked as intended. It's surreal.\n\nEdit: Not totally fixed, still pops up, just not as much. Dang it."
        ]
    },
    "Tech Support and Question Megathread - June 2024 Edition": {
        "title": "Tech Support and Question Megathread - June 2024 Edition",
        "score": 9,
        "url": "https://www.reddit.com/r/nvidia/comments/1d5fcng/tech_support_and_question_megathread_june_2024/",
        "content": "We're consolidating **all** tech support posts and questions into this **monthly** tech support and questions megathread.\n\nIt should be noted, r/NVIDIA does not represent NVIDIA in any capacity unless specified. There's also no guarantee NVIDIA even read this subreddit, if you have an issue, criticism or complaint; it's recommended to post it on the official GeForce forum.\n\n**All Tech Support posts that do not include sufficient information will be removed without warning**\n\nBefore creating a Tech Support post, please see our additional resources section, it solves a lot of common issues.\n\nTL;DR: **DO: Use the template. DO NOT: \"i have driver issue please help not 60fps!!\"**\n\n# For Tech Support Posts\n\nPlease use this template below - posts without adequate information will be removed, we can't help you unless you provide adequate information.\n\n**Status:** UNRESOLVED/SOLVED - please update if your issue is resolved\n\n**Computer Type:** State if your computer is a Desktop or Laptop and the brand/model if possible, e.g Desktop, custom built\n\n**GPU:** Provide the model, amount of VRAM and if it has a custom overclock, e.g. GTX 1070, 8GB of VRAM, no overclock\n\n**CPU:** Provide the model and overclock information if possible, e.g. Intel Core i5 6600k, no overclock\n\n**Motherboard:** Provide the model and current BIOS version if possible, e.g. MSI Z170A GAMING M9 ACK, latest BIOS (1.8)\n\n**RAM:** Provide the model and overclock information if possible, e.g. Corsair 8GB (2x4GB) DDR4 2400MHz, XMP enabled, no overclock\n\n**PSU:** Provide the model and its rated wattage and current output if possible, e.g. EVGA 850 BQ, 850W, 70amps on the 12v rail - for laptops you can leave this blank\n\n**Operating System & Version:** State your OS and version, also please state if this is an upgrade or clean install, e.g. Windows 10 build 1607 64bit, upgrade from Windows 8.1\n\n**GPU Drivers:** Provide the current GPU driver installed and if it’s clean install or upgrade, e.g. 376.33, clean install\n\n**Description of Problem:** Provide as much info about the issue as you possibly can, images and videos can be provided as well.\n\n**Troubleshooting:** Please detail all the troubleshooting techniques you’ve tried previously, and if they were successful or not, e.g. tried clean install of GPU drivers, issue still occurs. Please update this as more suggestions come in\n\n# For Question & Answer Post\n\nAdditionally, this thread will be used to answer general questions that may not warrant having their own thread -- this could be questions about drivers, prices, builds, what card is the best, is this overclock good etc…\n\nPlease don't downvote questions for the sake of helping others. We will also sort the post randomly so every question can be seen and answered.\n\nIf you don't have any tech support issues or questions, please contribute to the community by answering questions.\n\n# Here are some additional resources:\n\n* [Display Driver Uninstaller (DDU) tutorial](https://docs.google.com/document/d/1xRRx_3r8GgCpBAMuhT9n5kK6Zse_DYKWvjsW0rLcYQ0/edit)\n* [Repairing/Maintaining/Cleaning a Windows 8, 8.1 or 10 Image](https://docs.google.com/document/d/1Y7HOS6UiOBXAWtNFBJ0w70f14izRQcBYD9puuSw6Ghs/edit)\n* [How to repair/verify game files](https://docs.google.com/document/d/1Ba3RjEBnFcnUec0axX1ETgb1ndKvxSAX2YGQGu_leL0/edit)\n* [Malware/Virus Removal Guide](https://docs.google.com/document/d/16er6ZmSj4nUHBP-80EQLZjNgLNIDHyE93u0Vu8e6wV0/edit)\n* MemTest86 tutorial by [DigitalStorm](https://www.youtube.com/watch?v=e91hb60iPew) \\- faulty memory can cause a lot of problems, running MemTest86 will verify if your memory is faulty or not\n* You can also check the sidebar for helpful links, we update it regularly\n* You can visit our [Discord](http://discord.gg/nvidia) to chat with other NVIDIA users\n\nAgain, it should also be noted, r/NVIDIA is not a dedicated Tech Support forum and your question/issue may not be resolved. We also recommend checking out the following\n\n* r/TechSupport \\- A Subreddit dedicated entirely to answering Tech Support related questions/queries\n* [GeForce Support](http://www.geforce.com/support) \\- answers to the most common questions with a knowledgebase available 24x7x365\n* [Official GeForce Forum](https://forums.geforce.com/) \\- Posting your complaints, criticism and issues here will increase the chances an NVIDIA employee sees it.\n* [NVIDIA Support](http://nvidia.custhelp.com/app/home/) Includes live chat and email\n\nIf you think you’ve discovered an issue, it’s crucial you report it to NVIDIA, they can't fix an issue unless they know it exists.\n\nHere’s a guide on how to submit [valuable feedback](http://nvidia.custhelp.com/app/answers/detail/a_id/3141)\n\nAnd here’s where you [submit feedback](https://forms.gle/kJ9Bqcaicvjb82SdA)\n\nIf you have any questions, or think this template post could be improved for future use, please message the [/r/NVIDIA moderators](https://www.reddit.com/message/compose?to=%2Fr%2Fnvidia)\n\nWant to see previous version of this thread? Click [here](https://www.reddit.com/r/nvidia/search?q=Tech+Support+Megathread&sort=new&restrict_sr=on)",
        "num_comments": 117,
        "comments": [
            "Did you have have to upgrade your psu when upgrading to the 40 series? Were you having issues, system crashing, freezes etc with your old one? Trying to troubleshoot an issue and I'm wondering if my psu is causing these issues 🥲",
            "When will RTX HDR be usable on multi display systems without any workarounds?",
            "Hey guys, i'm playing at 1440p native and if i try DLDSR at x2.25(basically 2160p) Frame Gen doesn't work - is anyone aware of how to fix it?",
            "Why did nvidia release the Super versions this late?",
            "Is it bad to mismatch DLSS .dll versions with a different frame gen version .dll ? I downloaded the 3.7 SDK but it doesn't have the Frame Gen DLL. Also is there a difference between the /dev folder and the /rel folder? I see the same file name but different size nvngx_dlss.dll file in each folder.",
            "Which is the most stable driver for mobile RTX4070?",
            "Unresolved.\n\nDoes the NVIDIA App recording not work with older drivers such as 527.56? Whenever I start recording it instantly says saving recording and nothing gets saved.",
            "Is there a list of what games have Game Ready drivers? All I can find are the ones added by the most recent update.",
            "I originally called this the cisco of 2000...maybe we aren't quite at the year 2000 but its coming...better sell at the top!",
            "Quick question, ATI has a function that automatically upscales any full screen image to your desktop resolution and I absolutely love it for playing old games, I am hoping nvidia has something like that - do they?  My laptop has a nvidia card and a 16:10 uncommon resolution so automatic upscaling would be a god send"
        ]
    },
    "my new gpu😍": {
        "title": "my new gpu😍",
        "score": 701,
        "url": "https://www.reddit.com/gallery/1dqk686",
        "content": "this is the second gpu i’ve ever owned, first was a gigabyte 1660 6gb, there is a heat sink block on top",
        "num_comments": 176,
        "comments": [
            "May your framerates be high and temperatures low!",
            "Cognarts! Looks super clean. Have fun with it; a huge step up from a 1660",
            "Congrats man, ignore what the haters say the 3080 is still a very capable card!",
            "Nice one!! Welcome to world of high resolution and frame rates :D",
            "3080 Ti Suprim X here, very good cards",
            "Congratulations, OP! I hope it performs great and treats you well throughout the time that you own it. I'm a big fan of MSI's SUPRIM / Gaming X GPU's, from my personal and professional experience repairing GPU's I can tell you that the PCB's are manufactured incredibly well and they use high quality board components / fuses.",
            "The 3080 is a great card. It was my main during those brutal pandemic years and really crushed it at 1440p.",
            "Congrats dude! 3080 is an absolute beast. Got myself an EVGA FTW3 Ultra recently and have been thoroughly happy with it.\n\n I do gotta say if you feel like your card runs too hot for your liking, undervolting it is a good idea. I get the same performance while going from 84 C under load down to 55 C.",
            "Welcome to the Suprim X Family, my friend... Enjoy!",
            "Congrats, that's a heck of an upgrade"
        ]
    },
    "New Build! (RTX 4080 Super)": {
        "title": "New Build! (RTX 4080 Super)",
        "score": 38,
        "url": "https://www.reddit.com/gallery/1dr3022",
        "content": "Just got this new PC built!\nIn the rig:\n-RTX 4080 Super 16GB Gigabyte Gaming OC\n-Intel 14th Gen i9 14900k\n-64GB (32*2) 6000MHz G-Skill Trident Z5 Neo RAM\n-ROG Strix Z790-H Gaming WiFi Mobo \n-1050w Cooler Master PSU Gold FullMod\n-2 x Samsung 990 Pro 2TB\n-NZXT Kraken 360 AIO\n-NZXT H7 Flow case\n\nGonna upgrade it's aesthetics real soon!",
        "num_comments": 9,
        "comments": [
            "Holy god that looks sick",
            "Great PC, hope you enjoy it.\n\nHoly cow, that GPU heatsink is T H I C C",
            "Best GPU, love it.: great anti sag bracket design, large cooler, 3x DP & recessed 12v-2x6",
            "My gpu is from Zotac and so much thinner ^^",
            "Definitely a performance beast but a few RGB fans can go a long way if you care about that.",
            "A verticle mount would show off that rgb better",
            "Yessss getting them soon!",
            "Will get that then!",
            "https://preview.redd.it/nzawewyt1i9d1.png?width=4032&format=png&auto=webp&s=40b646f690f69f42f671c9c14d137ec5997e8ea5\n\nI guess we're sharing the same case :D"
        ]
    },
    "EOL Windows driver support for older CPUs without POPCNT instruction": {
        "title": "EOL Windows driver support for older CPUs without POPCNT instruction",
        "score": 8,
        "url": "https://nvidia.custhelp.com/app/answers/detail/a_id/5554",
        "content": "",
        "num_comments": 3,
        "comments": [
            "I love how the official MS term for a blue screen is \"bugcheck\".",
            "Basically, this means most CPUs older than 2008/Nehalem architecture.",
            "POPCU-...POPC....."
        ]
    }
}