{
    "**WARNING** Stop Harassing People Who Post Listings and Rooms": {
        "title": "**WARNING** Stop Harassing People Who Post Listings and Rooms",
        "score": 482,
        "url": "https://www.reddit.com/r/NYCapartments/comments/ydajgo/warning_stop_harassing_people_who_post_listings/",
        "content": "I have seen so many instances, over the last week, of people chiming in on posts for listings and for rooms that they don't agree with the price. I have seen people making fun of OP's, I have seen people insulting OP's, and I have seen people making borderline threats towards OP's. Quite simply, this will not be tolerated.\n\nThis is a community where everyone should feel free to post their open apartments, listings, room or whatever, without being harassed. If someone asks for advice, and your two cents, by all means give it if you want to. If they're just posting trying to find someone, leave your thoughts to yourself. \n\nAt the end of the day, the market will sort itself out, and you don't need to make these people's lives any harder. Stop being a dick. Any comments going forward that criticize someone's listing will result in an immediate 7 day ban. Repeat offenders will be banned permanently.\n\nBe nice to each other. That is all",
        "num_comments": 0,
        "comments": []
    },
    "Cockroach spotted in dishwasher during apartment tour. Omen or overreacting?": {
        "title": "Cockroach spotted in dishwasher during apartment tour. Omen or overreacting?",
        "score": 17,
        "url": "https://v.redd.it/m6ptajjsei9d1",
        "content": "I found an apartment with dishwasher and laundry in-unit. The space seemed normal and nothing was truly out of the ordinary. The building is a pre-war, but the apartment is recently renovated.\n\nI open the dishwasher and instantly find a cockroach crawling around inside. I feel like that’s a bad sign, but I’m not sure if I’m overreacting? We do live in a city after all, so this could’ve been a random sighting, or is it?\n\nUnfortunately the tenants weren’t home, because I would’ve asked if they dealt with any infestations. I’d love to hear everyone’s input on whether I should still apply for it or keep looking!",
        "num_comments": 49,
        "comments": [
            "On the TOUR?\n\nA dishwasher and in-unit laundry is incredible but personally that would be a nope.",
            "Bruh dont move there. Unless you like dealing with roach feces on your dishes. But if you do like roach feces on your dishes then do move there.",
            "As a starting point you could find out what the landlords pest services / policy is. Eg one building I lived in had a guy come once a month, another was by request weekly ",
            "Please dont do this. If you saw one in daylight there is already a serious issue. I just dealt with an infestation and its an absolute nightmare.",
            "you met the current tenant",
            "If their is one... their is manyyy.... thats a BIG NO for me.",
            "Tell them give you 100$ off for each one you find . Life is what you make it.",
            "Putting the address in here will be helpful.",
            "I'm going to give a different take from everyone else in the comments. Based on the clutter in the kitchen plus the dishwasher being nearly full I'm going to take a guess that the tenant may not be the cleanest which would lead to roaches no matter which apartment you're in.\n\nIf the price is right just ask for a deep cleaning plus roach spraying before you move in.",
            "We had a dishwasher in nyc once. Spotted one in the kitchen. Then another. Then a family was inside the panel of the dishwasher where its warm and hot from all the use. Nearly had a heart attack. RUN."
        ]
    },
    "164 Stanton St #1C IS A SCAM LISTING ON STREETEASY": {
        "title": "164 Stanton St #1C IS A SCAM LISTING ON STREETEASY",
        "score": 63,
        "url": "https://www.reddit.com/r/NYCapartments/comments/1dr3ome/164_stanton_st_1c_is_a_scam_listing_on_streeteasy/",
        "content": "This listing from today (Jun 29 2024) is a scam: [https://streeteasy.com/rental/4462009?utm\\_campaign=rental\\_listing&utm\\_medium=app\\_share&utm\\_source=ios&utm\\_term=f2263444b84d47d](https://streeteasy.com/rental/4462009?utm_campaign=rental_listing&utm_medium=app_share&utm_source=ios&utm_term=f2263444b84d47d)\n\nThe scammer uploads fake listings under real brokers (no idea why StreetEasy allows that), and usually on Friday nights / on weekends when StreetEasy support isn't available to take down the listings. DO NOT SEND THIS SCAMMER MONEY. They will request a $200+ application fee without showing you any apartment (because they DO NOT own it). It is a scam. Do not fall for these listings asking you to contact an \"owner\" under a different number than the broker's number on the listing.\n\nI just don't want more people to fall for these. These scammers are awful.",
        "num_comments": 5,
        "comments": [
            "Not sure how much it will help but I reported it. I'd feel like shit losing $200+ trying to find a place so hopefully they take it down",
            "Also never send an application fee for a place you have not seen. Awful scammers smh",
            "Unfortunately StreetEasy does not care.  They will probably take down the listing but there are no penalties for violating the rules.",
            "The suspiciously cheap rent for that area is kinda a dead giveaway.",
            "A real one"
        ]
    },
    "Did i hit the jackpot???": {
        "title": "Did i hit the jackpot???",
        "score": 199,
        "url": "https://www.reddit.com/r/NYCapartments/comments/1dqjmti/did_i_hit_the_jackpot/",
        "content": "I found nice sized rent stabilized studio apartment in queens for $1500, bathroom & kitchen renovated, washer & drying in building, elevator, and payed a brokers fee of $2k. \nIm reading thru these posts and see listings for bedrooms for $1800+ and am just feeling soooo so grateful. \nTo anyone feeling hopeless, get your credit up and keep looking!!! \n",
        "num_comments": 129,
        "comments": [
            "It's cheaper because you aren't walkable to a Subway and deep in Queens. All that matters is, it works for you",
            "Yes. Where in Queens though?",
            "That commute is brutal for most folks I bet",
            "There's definitely deals to be had! You just have to be creative in your search and not picky about the areas. \n\nI co-sign about having stellar credit score (800+) and a healthy savings in your bank account to increase your chances of being selected as tenant.",
            "If it fits your needs and you love it, then its your jackpot. Happy for you!",
            "Depends on where in queens",
            "lol at all the bitter people here. Hollis literally has an lirr station so this person can get to manhattan nice and fast. Congrats on your apartment",
            "Same! I found a studio for 1440!",
            "Queens is generally cheaper. Ive been looking in queens and have found a lot of studios or 1 bedrooms for $1500",
            "Hollis! From Kings come Queens and Queens come Kings. Run-Dmcs homestead. Im not mad atcha. "
        ]
    },
    "I am really lost in how i should look for apartments and find good ones,  any tips you guys can give?": {
        "title": "I am really lost in how i should look for apartments and find good ones,  any tips you guys can give?",
        "score": 5,
        "url": "https://www.reddit.com/r/NYCapartments/comments/1dr447b/i_am_really_lost_in_how_i_should_look_for/",
        "content": "Me and my girlfriend want to move to maybe brooklyn or queens bc we both go to college in Midtown/lower manhattan. We are looking for a studio perhaps under 2200-2000 monthly. That price seems to be on the lower end of it but i have seen some ads, however, me and my girlfriend have never lived on our own and i really do not know how to start looking and not get scammed/ etc.. any tips or advice? We are looking to move in around the start of august, likely no later than the 15th.\nThank you guys in advance",
        "num_comments": 3,
        "comments": [
            "Search this sub there are a million posts about this",
            "Also, getting to the more important part, the application fees should generally not be that high. Really depends on the building. No advances before the contract is signed. Usually a 1 month security deposit with first month rent is required upfront. If going through broker either a 1 month broker fee is also charged. (Broker fee may vary as some brokers charge 10% of the annual rent instead).",
            "The first thing you should do is go onto StreetEasy. That should give you the idea what the apt prices are in your area. \nMultiple things to look at when getting an apartment. \n2200 is a good enough budget depending on exactly which place you want to be in. \nWasher/Dryer situation. While in-unit can get expensive. I would suggest something in building is much better. However, if there is nothing in the building atleast there should be one near the apt. \nProximity to public transportation is also important. \nFor the apt itself, the actual condition of the building should be taken into account when viewing said property. If the building is clean/ well maintained when youre looking at the apartment, chances are if there is a problem in the future, the landlord/super should be able to help you with that."
        ]
    }
}