{
    "**WARNING** Stop Harassing People Who Post Listings and Rooms": {
        "title": "**WARNING** Stop Harassing People Who Post Listings and Rooms",
        "score": 487,
        "url": "https://www.reddit.com/r/NYCapartments/comments/ydajgo/warning_stop_harassing_people_who_post_listings/",
        "content": "I have seen so many instances, over the last week, of people chiming in on posts for listings and for rooms that they don't agree with the price. I have seen people making fun of OP's, I have seen people insulting OP's, and I have seen people making borderline threats towards OP's. Quite simply, this will not be tolerated.\n\nThis is a community where everyone should feel free to post their open apartments, listings, room or whatever, without being harassed. If someone asks for advice, and your two cents, by all means give it if you want to. If they're just posting trying to find someone, leave your thoughts to yourself. \n\nAt the end of the day, the market will sort itself out, and you don't need to make these people's lives any harder. Stop being a dick. Any comments going forward that criticize someone's listing will result in an immediate 7 day ban. Repeat offenders will be banned permanently.\n\nBe nice to each other. That is all",
        "num_comments": 0,
        "comments": []
    },
    "164 Stanton St #1C IS A SCAM LISTING ON STREETEASY": {
        "title": "164 Stanton St #1C IS A SCAM LISTING ON STREETEASY",
        "score": 16,
        "url": "https://www.reddit.com/r/NYCapartments/comments/1dr3ome/164_stanton_st_1c_is_a_scam_listing_on_streeteasy/",
        "content": "This listing from today (Jun 29 2024) is a scam: [https://streeteasy.com/rental/4462009?utm\\_campaign=rental\\_listing&utm\\_medium=app\\_share&utm\\_source=ios&utm\\_term=f2263444b84d47d](https://streeteasy.com/rental/4462009?utm_campaign=rental_listing&utm_medium=app_share&utm_source=ios&utm_term=f2263444b84d47d)\n\nThe scammer uploads fake listings under real brokers (no idea why StreetEasy allows that), and usually on Friday nights / on weekends when StreetEasy support isn't available to take down the listings. DO NOT SEND THIS SCAMMER MONEY. They will request a $200+ application fee without showing you any apartment (because they DO NOT own it). It is a scam. Do not fall for these listings asking you to contact an \"owner\" under a different number than the broker's number on the listing.\n\nI just don't want more people to fall for these. These scammers are awful.",
        "num_comments": 2,
        "comments": [
            "A real one",
            "Not sure how much it will help but I reported it. I'd feel like shit losing $200+ trying to find a place so hopefully they take it down"
        ]
    },
    "Did i hit the jackpot???": {
        "title": "Did i hit the jackpot???",
        "score": 184,
        "url": "https://www.reddit.com/r/NYCapartments/comments/1dqjmti/did_i_hit_the_jackpot/",
        "content": "I found nice sized rent stabilized studio apartment in queens for $1500, bathroom & kitchen renovated, washer & drying in building, elevator, and payed a brokers fee of $2k. \nIm reading thru these posts and see listings for bedrooms for $1800+ and am just feeling soooo so grateful. \nTo anyone feeling hopeless, get your credit up and keep looking!!! \n",
        "num_comments": 122,
        "comments": [
            "It's cheaper because you aren't walkable to a Subway and deep in Queens. All that matters is, it works for you",
            "Yes. Where in Queens though?",
            "That commute is brutal for most folks I bet",
            "There's definitely deals to be had! You just have to be creative in your search and not picky about the areas. \n\nI co-sign about having stellar credit score (800+) and a healthy savings in your bank account to increase your chances of being selected as tenant.",
            "If it fits your needs and you love it, then it’s your jackpot. Happy for you!",
            "Depends on where in queens",
            "![gif](giphy|X7WOeC3eCHsLC)",
            "lol at all the bitter people here. Hollis literally has an lirr station so this person can get to manhattan nice and fast. Congrats on your apartment",
            "Same! I found a studio for 1440!",
            "Queens is generally cheaper. I’ve been looking in queens and have found a lot of studios or 1 bedrooms for $1500"
        ]
    },
    "I am really lost in how i should look for apartments and find good ones,  any tips you guys can give?": {
        "title": "I am really lost in how i should look for apartments and find good ones,  any tips you guys can give?",
        "score": 5,
        "url": "https://www.reddit.com/r/NYCapartments/comments/1dr447b/i_am_really_lost_in_how_i_should_look_for/",
        "content": "Me and my girlfriend want to move to maybe brooklyn or queens bc we both go to college in Midtown/lower manhattan. We are looking for a studio perhaps under 2200-2000 monthly. That price seems to be on the lower end of it but i have seen some ads, however, me and my girlfriend have never lived on our own and i really do not know how to start looking and not get scammed/ etc.. any tips or advice? We are looking to move in around the start of august, likely no later than the 15th.\nThank you guys in advance",
        "num_comments": 0,
        "comments": []
    },
    "Proving income as content creator": {
        "title": "Proving income as content creator",
        "score": 2,
        "url": "https://www.reddit.com/r/NYCapartments/comments/1dr5cow/proving_income_as_content_creator/",
        "content": "I’ve been a YouTuber for several years but have only been making stable income the last few years. I’m a 1099 earner. So basically like 3 years ago I made 30k, 2 years ago 40k and last year around 80k. This year I’ll make about the same. The point is that my income has only been decent the past year. \n\nI heard as a freelancer you have to show 3 years of income but my income has not been the same for the past 3 years. \n\nI would really love to move to NYC but I don’t know if I would meet the strict rent guidelines? Would I just need a guarantor? I don’t have a person so I’d need a third party guarantor :(\n\n",
        "num_comments": 0,
        "comments": []
    }
}