{
    "UPDATED RULES PLEASE READ - THANK YOU": {
        "title": "UPDATED RULES PLEASE READ - THANK YOU",
        "score": 164,
        "url": "https://www.reddit.com/r/NYCinfluencersnark/comments/vnxx5f/updated_rules_please_read_thank_you/",
        "content": "Please review and follow the rules. Posts and comments not following these rules will be removed:\n\n1. No attacking other users this includes bullying, harassment, doxxing, trolling, hate speech\n2. No body shaming or body snark\n3. No Duplicate Posts.\n4. No posting of old snark keep it current\n5. No self promotion\n6. Follow Reddit guidelines - including no bullying, harassment, hate speech, etc.\n7. No content that has a bias against identity\n8. Do not contact any influencers in relation to this sub and do not encourage other users to contact\n9. No off topic discussion\n10. No Posting about Politics\n11. No posting about Israel/Palestine\n12. No posting content from private accounts\n13. All Danielle Bernstein (We Wore What) content needs to be posted in the daily pinned thread\n\n&#x200B;",
        "num_comments": 27,
        "comments": [
            "I think these are great rules but I also think we should add to keep race and religion and any other bigotry out of it. On the Arielle Charnas post I saw many comments towards her religion and when people commented that they were offended at the stereotype they were heavily downvoted. It’s sad to see the increase in hate in the world - really sad to see it in here",
            "The user aintthatdeep247 sent me a DM threatening to dox me. She said she stalked my Reddit and figured out who i was. I was going back and forth with her in the anti semitism thread before she sent me a DM threatening me. How do I report this to the mods?",
            "Why does Paige have her own thread lol",
            "I enjoyed the fun snarking but this has turned into a toxic and incredibly antisemitic board. You people are real sick.",
            "Why is there a special rule just for Paige Lorenze? 🤡",
            "There have been a ton of body shaming posts this week, u/wrongway101. Reported two today but man, this is disappointing to see on here. Maybe adding some clearer rules about whether shaming people for choosing to get plastic surgery counts as body shaming or not would be helpful for this community. I don’t really think that’s cool.",
            "Sorry if this is a dumb question but is there a reason why we can’t post GIFS on this subreddit? I noticed that in other subreddits when I reply I have the option to add GIFs thru the GIPHY feature in the Reddit app.",
            "This thread is literally for attacking and bullying these “influencers” so…",
            "Where are the mods when this entire sub is suddenly devoted to… middle eastern policy?",
            "Can I say I was blocked by someone?"
        ]
    },
    "Another one also dedicated to never serving": {
        "title": "Another one also dedicated to never serving",
        "score": 14,
        "url": "https://www.reddit.com/gallery/1drb2t1",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Again with the bag! She looks like a safari salesman. ",
            "She needs a summer bag so badly",
            "I’m m sorry is that a cemetery in the background??",
            "She looks like one of the Wild Thornberrys",
            "Hamps summer bag - black Birkin 4evah.",
            "I think she’s pregnant",
            "Stefania Irwin"
        ]
    },
    "Hire an interior designer McGookin 😭": {
        "title": "Hire an interior designer McGookin 😭",
        "score": 151,
        "url": "https://i.redd.it/s8hpb889ne9d1.jpeg",
        "content": "",
        "num_comments": 51,
        "comments": [
            "her whole house is atrocious",
            "That looks so uncomfortable. Does she expect grown adult to just lay down? It looks like furniture for a children’s playroom",
            "the way that mcgookin isn’t an insult and is unironically her last name kills me",
            "Her commitment to being tacky is inspiring",
            "Ngl 1 like is a bit crazy.",
            "Not the claw fingers 😩",
            "I am new here why do you call her Mcgookin",
            "This looks like a toddler play set but ok!!",
            "She is so consistent with her bad taste",
            "Me again, BEGGING to give her free advice and mood boards. Hell, I’ll even buy her a rug."
        ]
    },
    "This is so ridiculous like girl this is YOUR FAULT": {
        "title": "This is so ridiculous like girl this is YOUR FAULT",
        "score": 324,
        "url": "https://i.redd.it/081ubjgzdd9d1.jpeg",
        "content": "Why are you blaming the taxi driver lol, you didn’t pay attention to where you were supposed to be headed??? This makes me so mad like, they’re just doing their job. ",
        "num_comments": 67,
        "comments": [
            "if you miss it just pay however much for the next flight out. you have no deadlines or responsibilities and money is no issue soooo who the fuck cares",
            "being inattentive is costly !",
            "Didn’t her ass literally live in nyc? Like if anyone should know about a city having two airports it’s you bruh",
            "everything i've learned about this woman has been against my will",
            "Acting like she isn’t in control of putting the correct airport code into the Uber destination",
            "“Why does Brussels have two airports” …",
            "I hate everyone who gave this girl a platform ",
            "Most major cities have multiple airports............. Victoria Orly/Charles de Gaulle should know better.",
            "Does she not realize that lots of cities have multiple airports and that you should know the exact airport you’re flying out of? What in the world….",
            "…. Has she never traveled before ? Wherever you go, do your due diligence."
        ]
    },
    "Timm Chiusano and his “you don’t need a college degree to make it” schtick": {
        "title": "Timm Chiusano and his “you don’t need a college degree to make it” schtick",
        "score": 45,
        "url": "https://www.reddit.com/r/NYCinfluencersnark/comments/1dr1jnx/timm_chiusano_and_his_you_dont_need_a_college/",
        "content": "In his latest video Timm waxes poetic about how you don’t need a college degree to “make it” as evidenced by his own success. While I do agree you don’t neeeeed a college degree, this tool acts like it’s his hustle that got him to where he is. What is infuriating about this guy is that he ignores the leg up he started with. The guy was born on third base, of course he didn’t need a college degree. He acts as if waking up at 4 am to send emails helped him afford a townhouse in Brooklyn, and you, regular person not well off to begin with, could do the same! He’s so smug about not having a college degree. I can’t imagine the fact that he doesn’t have a college degree (though I believe he actually did go to college, just didn’t graduate?) but still managed to become an absolute corporate shill impresses anyone. Maybe I’m wrong? I would love to see this guy use his platform to do something for the good of someone else that isn’t feeding them corporate bullshit terms to help them ace their next performance review. ",
        "num_comments": 15,
        "comments": [
            "Not taking advice from people who entered the workforce at a time when a masters degree wasn’t required for entry level jobs 🙅🏿✌🏽",
            "Privileged people typically try so hard to hide their privilege in order to build credibility. I find it so deceptive because ordinary people are misled and get so frustrated when doors don’t open the same way for them.",
            "There are many people like him that try to sell an unattainable dream.",
            "Can you share more about what his exact privilege/leg up is? I only casually follow along to his videos when they’re in my feed",
            "I feel like he’s just trying to spread an encouraging message to work hard? He most definitely is a privileged white man who got his start when the world was in a very different place, but I really don’t mind the positive outlook. He isn’t spreading any misinformation, so as far as I’m concerned it’s a step up from the mass amounts of videos just complaining about how opportunities suck for young people nowadays (even though they unfortunately do🫠)",
            "Didn’t he lie about having a degree at some point? I thought he made a video about telling his family he was a semester short",
            "Yes, exactly what I hate. Half the bullshit he does is simply nothing more than privilege and not “hustle”. Guy acts like he’s having a real impact on the world, one powerpoint at a time.",
            "oh this is good lol i love noticing attention seeking behavior in the wild",
            "Oh man, I’ve always wanted to spot him in the wild. I’m so curious to see how people react when he sets up his phone to film himself",
            "I think his dad worked in tv production or something. I believe Timm’s first big job was working for ESPN"
        ]
    }
}