{
    "Please use official OBS Discord and forum as primary support channels": {
        "title": "Please use official OBS Discord and forum as primary support channels",
        "score": 129,
        "url": "https://www.reddit.com/r/obs/comments/avbwr0/please_use_official_obs_discord_and_forum_as/",
        "content": "This subreddit is not maintained as official help resource and not  visited very often by the developers and most community supporters and moderators.\n\nPlease use the official support channels for urgent or specific support, especially for macOS and Linux issues.\n\n* Live Chat on the OBS Project Discord (recommended): https://discord.gg/obsproject\n* Forum: [https://obsproject.com/forum/](https://obsproject.com/forum/)\n* Help Portal: [https://obsproject.com/help/](https://obsproject.com/help/)",
        "num_comments": 0,
        "comments": []
    },
    "How to hide private stuff while live streaming": {
        "title": "How to hide private stuff while live streaming",
        "score": 13,
        "url": "https://www.reddit.com/r/obs/comments/1dqymnh/how_to_hide_private_stuff_while_live_streaming/",
        "content": "I wanted to record me and my friends playing Minecraft. They says no because they don’t want people to see there usernames. That makes me think how to block these stuff on obs. If I’m live streaming and I accidentally pop up like a personal thing I worked on or I personal thing I did I can’t just click out because people can rewind slow down then pause the screen to see it. So what can I do",
        "num_comments": 28,
        "comments": [
            "You could actually use some kind of Minecraft Mod to hide their usernames, or a plugin to change it to a different nickname instead of going through tedious shit with OBS.",
            "if use game capture and not desktop capture then no one will see any thing but the game..  as for in game names that would have to be something in  game to hide those.",
            "OBS allows for Blur & pixilated overlays of sections. Considering most game setups have static positions for common games elements (usernames, stats...), it shouldn't be too hard to use a still image with holes in those sections as a key mask.",
            "In general, capture only window you want to stream, not the whole desktop view.",
            "One thing I dont see mentioned that I used when I worked in college esports production. Run your stream with a delay. College esports keeps a 3 minute delay as standard but for personal streams I would run maybe a 20 second delay. You still interact with chat in a timely manner but if you show something you dont want seen you have 20 seconds to think about it, switch to obs, and stop stream while dropping delay. Dropping delay allows you to just tell obs to stop sending twitch video and to cut anything that hasnt been shown yet. Definitely something that helps a ton",
            "Does the game have any streamer mode setting, or a plugin that can do the same thing?",
            "Ask chatgpt, it's been pretty helpful for niche needs like this for me lately.  Chances are though it's not a thing yet, even though you'd think AI would easily be able to receive input like specific text or programs (like password managers) and auto hide them.",
            "Oh just it seems like its would have to do so much in little time manually",
            "You mean Minecraft well idk",
            "You guys stop asking chatgpt for everything."
        ]
    },
    "bad lag spikes when trying to stream, even on old games from 2004": {
        "title": "bad lag spikes when trying to stream, even on old games from 2004",
        "score": 1,
        "url": "https://www.reddit.com/r/obs/comments/1drba6t/bad_lag_spikes_when_trying_to_stream_even_on_old/",
        "content": "I'm trying to stream on obs, I play low demanding games and there's 0 lag when obs is closed so its definitely an obs issue. But I'm trying to play games like Counter Strike Source  & Momentum mod which are very light weight games, I should be able to get 300+ fps on my 3070 with 0 issue, but i get really bad lag spikes when playing. \n\nAny advice?  \n\nhttps://obsproject.com/logs/kvKL0VV6p8qDjLKa",
        "num_comments": 1,
        "comments": [
            "See your log analysis here: https://obsproject.com/tools/analyzer?log_url=https%3A%2F%2Fobsproject.com%2Flogs%2FkvKL0VV6p8qDjLKa\n\nYou shouldn't put Game Capture and Window Capture sources in the same scene as they conflict. Apart from that, you've gor a small amount of encoder overload and render lag. \n\nYou'll likely need to cap your in-game frame rate, ideally to a multiple of 60, to give OBS some resources that are currently being siphoned off to run the game. Try 120 fps in game and see how that goes. If it's still overloading, cap it at 60fps."
        ]
    },
    "Bitrate and frames drops, need of ping notification when someone send a chat msg.": {
        "title": "Bitrate and frames drops, need of ping notification when someone send a chat msg.",
        "score": 1,
        "url": "https://www.reddit.com/r/obs/comments/1dr9t0o/bitrate_and_frames_drops_need_of_ping/",
        "content": "To who has experience in OBS Studio, I need help with two things and couldn't find a solution/guide for them.\n\n1. The first issue is when I broadcast and someone sends me a message in the chat, I don't realise it, I want a msg notification like a little ping sound that is only hearable by me.\n\n2. The second issue is when I stream using OBS, sometimes it uses just 500 kbps bitrate, and the broadcast disconnects and doesn't reconnect, even though the internet and the device are good,\n\n  The server I broadcast on is auto/recommended \n  My set bitrate is 6000kb ( my upload is about 90 megabytes ) ",
        "num_comments": 0,
        "comments": []
    },
    "Av1, need help": {
        "title": "Av1, need help",
        "score": 1,
        "url": "https://www.reddit.com/r/obs/comments/1dr9fwv/av1_need_help/",
        "content": "i choosed the AV1 encoder option and every time i want to start recording it says:\n\n\"AV1 encoding is not available with the current settings. try disabling any re scaling or GPU options that may be set. check the log for more details\"\n\nany help? idk iven where to check logs or what i need to chnage on gpu options.",
        "num_comments": 0,
        "comments": []
    }
}