{
    "Monthly Referral Sharing Thread": {
        "title": "Monthly Referral Sharing Thread",
        "score": 24,
        "url": "https://www.reddit.com/r/oculus/comments/1d58zbw/monthly_referral_sharing_thread/",
        "content": "## If you spam your referral link, all of your posts will be removed.\n\n## [How does the referral program work?](https://support.oculus.com/articles/orders-and-purchases/headsets-and-app-purchases/oculus-referrals/)\n\n### Already activated your new Quest 2 but still want the store credit?\n\n - Factory reset the device or wipe it remotely by unlinking it here https://secure.oculus.com/my/devices/\n\n - Accept the referral from clicking on someone’s link.\n\n - Re-activate the device by pairing it to your mobile oculus app that’s signed in with your Facebook account.\n\n[\\[link to the previous referral sharing thread\\]](https://reddit.com/r/oculus/comments/1chox3g/monthly_referral_sharing_thread/)",
        "num_comments": 326,
        "comments": [
            "Anyone have a discount for Earthquest?",
            "Anyone got a referral code to into the radius they haven't gotten used? I'm looking for one!",
            "The advice to \"reset your device to activate new referral code\" isn't correct. Just did it and now I have to reinstall all my games for no reason",
            "Codes are only good for 3 uses now. We have to adapt.\n\nCan anyone DM me a Riven code usable in the US? Doing so in a private message also means we are following the TOS.",
            "FYI, your Silent Slayer links is actually for Stride",
            "Just used your referral code.",
            "thats on you buddy, not them",
            "Bro's got literally every game... but not the one I was looking for  (Rez)",
            "I used your AC referral thanks",
            "Just fixed it, thank you for letting me know"
        ]
    },
    "Which VR games are you enjoying at the moment?": {
        "title": "Which VR games are you enjoying at the moment?",
        "score": 13,
        "url": "https://www.reddit.com/r/oculus/comments/1d591j3/which_vr_games_are_you_enjoying_at_the_moment/",
        "content": "Welcome to the recommendation thread! :)\n\nShare with the rest of the subreddit which games and experiences you've been enjoying recently.\n\nHow did you come across the game, what were your first impressions like, what did you like about it—and most importantly—would you recommend the rest of us to try it, or stay away?  \n\nA couple of suggestions when posting:\n\n- Put names of the app **in bold** for easier skim reading.\n\n- Keep in mind that this is all about personal impressions and opinions, so if someone didn't enjoy your favourite title feel free to discuss why, but do so in a civil manner. No harassing anyone for having a different opinion.\n\n- **Use spoiler tags** when discussing plot-sensitive topics, so as to not spoil things for people who haven't played it yet.\n\n- Upvote informative and well-written posts to encourage quality discussion.  \n  \n- Add a store link to the app.\n\n##### [Link to the last recommendations thread](https://reddit.com/r/oculus/comments/1choy18/which_vr_games_are_you_enjoying_at_the_moment/)\n\n*[Any ideas or suggestions regarding this post? Feel free to [message the mod team](https://reddit.com/message/compose?to=%2Fr%2Foculus).*",
        "num_comments": 66,
        "comments": [
            "I've gotten into Pistol Whip. It aged great and the custom maps and dailies deliver solid long-term motivation to move my ass.",
            "Half life Alyx is damned good. Going to play Trover saves the universe soon.",
            "Shadow Point. Got it from meta+ a few months ago. Nice shadow based puzzles in a whimsical environment. There are about 8 levels so I do about 1 a night.",
            "Questcraft. I'm 54 and loving it. apart fromm the occasional  out of memory error, it's excellent.",
            "**iRacing** Its all I play. Well sometimes **Automobilista 2**. For standalone its **Miracle Pool**",
            "Just finished 7th Guest VR.",
            "Just got a PC, so Half-Life: Alyx.",
            "**DCS World**. It's always DCS World.",
            "I did some Half-Life: Alyx, shit is madness. I also did enjoy lone echo.",
            "Test driving the 7th Guest VR. But really, wishing there was a Geoguesser game, Im craving it and it doesnt exist. Oculus  PC used to have a game called Go Guess but I am unsure if that still exists. It worked so well in VR."
        ]
    },
    "AutoDepth VR Image Viewer: Update+Sale / 45% Off": {
        "title": "AutoDepth VR Image Viewer: Update+Sale / 45% Off",
        "score": 19,
        "url": "https://i.redd.it/gp0kjkzaof9d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "AutoDepth lets you automatically view your images and videos in volumetric 3D.  \nNow supporting the new 'Depth Anything V2' models which are even higher quality and much more consistent across the board, including for videos and anime styles.\n\nCurrently 45% off on steam, you can buy it here:  \n[https://store.steampowered.com/app/2552330/AutoDepth\\_Image\\_Viewer/](https://store.steampowered.com/app/2552330/AutoDepth_Image_Viewer/)\n\nP.S. The artist in the image is Aetherion Art, they are goated. (And sometimes NSFW)"
        ]
    },
    "my craziest VR experience so far | Trepang2 in VR motion controls UEVR": {
        "title": "my craziest VR experience so far | Trepang2 in VR motion controls UEVR",
        "score": 3,
        "url": "https://youtu.be/Jt0yfA5Jm-8?si=OIm0vmfRG1BUYGHY",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "I need help with my vision on qu'est 2": {
        "title": "I need help with my vision on qu'est 2",
        "score": 176,
        "url": "https://i.redd.it/20djjpjtua9d1.jpeg",
        "content": "So when I play Roblox or rec room my vision is restricted to a small circle Infront of me and watch is weird is that when I stop moving it comes back to normal this doesn't happen when I play VR chat what can I do to fix this problem it's really annoying I made a picture so you guys can see what it looks like",
        "num_comments": 53,
        "comments": [
            "You can turn it off in comfort settings, its called vignette",
            "Hey, just wanted to say that you wrote a nice post. You did a great job describing the problem, explaining the situations in which it happens, and giving details. I instantly knew the issue (vignette, as you found out).\n\nThis is so much better than people that post vague screenshots and just say \"help\". I appreciate you.",
            "I honestly dont know why they add this as a comfort setting. It makes me more nauseous than anything else.",
            "Are you french? That typo in the title makes me curious.",
            "yeah you should be able to turn it off on any game, its called vignette and its supposed to help some people rly prone to motion sickness, hence why its in comfort settings",
            "In the roblox vr settings you can turn that off I think",
            "I thought this was a joke post for a few seconds.",
            "Check your settings and turn off blinders or blinkers its away off restricting your view to prevent motion sickness",
            "For a split second I thought this was a new scene in South Park",
            "Its a comfort setting you can turn off. I think its supposed to prevent motion sickness but for me it does the complete opposite and take me out of immersion a bit even when I was first starting vr which was like a month ago."
        ]
    }
}