{
    "Broken Window Repair": {
        "title": "Broken Window Repair",
        "score": 2543,
        "url": "https://v.redd.it/ho7imkkoh08d1",
        "content": "",
        "num_comments": 151,
        "comments": [
            "Couldn’t also oil the pulleys?",
            " It's rare to see someone wear a mask and ear protection for fixing a window lol. Good on you. My dad never wore anything and messed up his lungs from inhaling silica.\n\nAnyway, quality work!",
            "As a window cleaner of 17 years, I have seen all different styles of windows and repaired a few as well. This is genuine craftsmanship, I'm blown the fuck away. These windows suck, and he did amazing at repairing and replacing everything. I personally wouldn't touch this shit with a 10 foot pole.",
            "I mean it’s great craftsmanship but wasn’t rope used because it was quiet compared to the chain running against the wood? And the squeaking? Maybe it’s to the charm of the place, idk",
            "Im curious why not just replace the window all together? Wouldn’t it be more energy efficient and save u money in the long run?",
            "As a European I am shocked about the window quality. No hate - but I could never imagine having such a thin windows without double insulation and proper steadiness while moving etc. I wonder why there is such a big difference… 🥸",
            "There is nothing, and I mean NOTHING, more satisfying than a smooth operating counterweight window.",
            "American windows are so confusing to me as somebody from the EU",
            "Somebody has been watching this old house",
            "my German brain can't understand why these kind of windows are still being used"
        ]
    },
    "Flipper covered 120 year old hardwood with weird colored carpet, floor crew thwarted install for easy restoration": {
        "title": "Flipper covered 120 year old hardwood with weird colored carpet, floor crew thwarted install for easy restoration",
        "score": 837,
        "url": "https://www.reddit.com/gallery/1dlnhyz",
        "content": "I bought a ca. 1906 late Victorian that had been ‘flipped’ by a Bill & Joanna Gaines wannabe. They made some questionable decisions in their renovation, one of which being the weird green-grey carpet in the upstairs bedrooms. I decided to pull up the carpet and lay down wood in the room I planned to use as my office, and when I pulled the carpet I found that 1) there was glorious original hardwood underneath (although weirdly its part red oak and part heart pine) and 2) the carpet install was so half-ass it only took me 2 hours to strip and dispose of the carpet - including driving it to the dump -  and another 2 hours with a belt sander to get it looking nice. I left a good bit of the ‘distressed’ character it had, mostly because I didn’t want to get it perfect then ding it up myself. This was my first time refinishing hardwood. Huge thank you to the lazy crew that saved me a ton of work saving these floors, can’t wait to do the rest of the bedrooms!",
        "num_comments": 70,
        "comments": [
            "Contrarian possibility, if it’s upstairs, the carpet can dampen the sounds between floors. Listening to someone walk on wood floors above you can be extremely annoying.",
            "I mean. That’s some old beat up wood. Usually I’d agree but it looks rough here, rather have the carpet at this point",
            "TBH. This Flooring looks kinda ugly.\n\nEdit:\nI dont even mind the Wood. But the finish and the holes and the try to patch them up. Idk, looks off.",
            "I'm European, I love wooden floors, or the fake wood, whatever, anything but a carpet, but I'll be honest, that hardwood isn't very \"glorious\" it looks pretty bad even renovated and definitely turns the apartment into a shed in my eyes... The wood is not very uniform, probably rather cheap, and the dark stains in certain spots look like someone died there lmao",
            "I'm still trying to figure how a dolphin could cover the floor with a carpet... 🐬🐬",
            "Think I’d rather have carpet here tbh",
            "The floor looks awesome!",
            "r/DiWHY",
            "The floors have not been sanded properly and you’ve used Home Depot-grade oil polyurethane. It looks okay for an old pine floor but you would have gotten a much better result with a professional.",
            "That wallpaper though! It looks so much better with the hardwood refinished, great combo of modern and historic."
        ]
    },
    "Refinished Sauna": {
        "title": "Refinished Sauna",
        "score": 208,
        "url": "https://i.redd.it/xlkwdp77m38d1.jpeg",
        "content": "Don't know,  if this belongs here. I find it soothing to look at.",
        "num_comments": 20,
        "comments": [
            "~~Why is it black? Is that paing non toxic and holds temperature? I mean, wood should expand and contract when heatet, will the paint stick or flake?~~\n\n~~I'm just asking because I never seen painted saunas before and there is probably reason for it. More reasons than the nice smell of wood.~~\n\nIt does look nice ~~but I want to know if it's practical.~~\n\nEdit: Got my answer, thanks OP.",
            "Re-finnished... ;)",
            "It’s soothing alright. Until your naked skin meets a 70 Celsius lacquered surface and fuses with it while you’re sitting on it. Joke aside, I’m sure there is a good reason why saunas have been natural wood for hundreds of years, no?",
            "Nice work. You’ll need it come winter. Greetings from Oregon!",
            "Looks nice, but the wood will be destroyed by the heating and moisture since it can’t breathe freely, and the stain is going to release toxic fumes when you heat it, so it’s not really safe to use as a sauna anymore, and even as a closet it would have been better with raw cedar to prevent pests. So…",
            "It's black because the previous guy had half-asded it in black. I just wanted it to look even. Something little more see through would've been nicer, but I think I still would've gone for grey or... less black. \n\nThe \"paint\" is actually wax, or oil. I think it's paraffin-based. I've also been told, that paint won't stick in a sauna, propably because of the heat expansion, which you mentioned. This stuff is specifically made for saunas, and it's been popular here in Finland for ages. So I guess it'll stay looking nice. This is the first one I've ever done, or had for myself.\n\nAnd for practicality, this should make the wood last longer. Especially the seats, that tend to rot, if not treated. I'm under the impression, that the seats should be treated in anycase. I guess most times people just use the clear stuff. These had been treated, but only on the top surface.",
            "Exactly😂\n\nBut, wait! There's more!\n\nWe actually have a word that's kinda similar, \"paluumuuttaja\", return-mover in english. Meaning the people whose parents left Finland during WW2, and  were born abroad, and then moved back to Finland.\n\nThey automatically get citizenship, if they just apply for it.\n\nSo... re-Finnished!\n\n(I know I really killed the joke)",
            "This is such a danish joke...",
            "Thanks for picturing my naked skin, I'm sure everybody liked that😁\n\nBut like I already explained for couple of others, this stuff is safe to use, and made specifically for saunas. It's not lacquer, it's waxed based oil (or something, possibly paraffin).\n\nAlso, some people like their electric saunas up to 100°c. And saunas equipped with wood burning stoves can reach 130°c, which was the case in the sauna world championships.",
            "Thanks! \n\nI use it year around, but of course it's even nicer in the wintertime😊"
        ]
    },
    "When Two Extremely Competitive People Meet, Get Married, and Casually Dominate Cornhole": {
        "title": "When Two Extremely Competitive People Meet, Get Married, and Casually Dominate Cornhole",
        "score": 5191,
        "url": "https://v.redd.it/z85f6vb5iy7d1",
        "content": "",
        "num_comments": 139,
        "comments": [
            "This is a marriage where both partner's cornholes are dominated equally.",
            "Zero points to everyone. This would be a very long game!",
            "That's Ashley and Tanner. Met at the Sigma Chi kegger. Their eyes locked over the beer pong table and it was love at first sight.",
            "OVER THE LINE!",
            "Equality is the *cornerstone* of their relationship",
            "Not even playing right",
            "Is this game called cornhole?",
            "Does the dude have a Bigfoot filter on? Looks like his feet are glitching.",
            "Their yard says South Orange County but their skills say South Eastern Conference",
            "Game Night (2018)"
        ]
    },
    "Hail oozing across a yard from a wild hailstorm in Scottsbluff, Nebraska.": {
        "title": "Hail oozing across a yard from a wild hailstorm in Scottsbluff, Nebraska.",
        "score": 394,
        "url": "https://v.redd.it/1cyx0bmoc28d1",
        "content": "",
        "num_comments": 30,
        "comments": [
            "Source: Meteorologist Ric Kearbey June 22, 2024\n\n A wild hailstorm left a surreal scene in Nebraska where clumps of accumulating hail oozed across a Scottsbluff, Nebraska yard yesterday as if it were being covered by frozen lava.\n\nIt looks like lava or quicksand chasing after you, but it’s hail. A powerful storm packing large hail and heavy rain produced this surreal scene.\n\nThe storm brought torrential rain, baseball-sized hail and hurricane-force wind gusts. \n\nVideo captured by Chad Casey.",
            "OMG when it melts you're still gonna be in Nebraska!",
            "Wish camera person would show more of the source of this oozing.  It's like porn where they only film the penis.",
            "As opposed to... a domestic hail storm?",
            "So, it was falling so hard and fast in a spot that the hail piled up then started falling over, resulting in a wave of hailstones?",
            "It looks like the monster made up of the people of Hawkings, Indiana from Stranger Things season 3.",
            "Has an evil villain feel to it.",
            "Everything is so big in the States. Looks like an hundred acre yard!",
            "Why does this remind me of the Blob?",
            "I haven't felt that satisfied in years and never seen anything like it!"
        ]
    }
}