{
    "This most likely breaks the rules but it needs to be said": {
        "title": "This most likely breaks the rules but it needs to be said",
        "score": 140308,
        "url": "https://i.redd.it/xymttw7wlgi91.jpg",
        "content": "",
        "num_comments": 1623,
        "comments": [
            "The mods from r/TerrifyingAsFuck asked me to point out that if you answer \"yes\" twice on this flowchart, that they'd love for you to go post it there.",
            "Nah I'm glad someone fucking posted it..  we need to ban karma farmers.",
            "Thank you for your service. Now do nextfuckinglevel and interestingasfuck",
            "Mods please pin this",
            "The best oddly terrifying content is when you look at something and you aren't even sure why it terrifies you.",
            "jarvis i am low on karma post a picture of freddy krueger on r/oddlyterrifying",
            "This frightens me in a bizarre and novel way!",
            "THANK YOU! people will post a character from a horror movie and be like “tHiS Is oDdly TerRifYing”",
            "This should be the god damn logo",
            "Wow, this flownchart should be in the rules for this sub and you have to acknowledge seeing it before posting."
        ]
    },
    "Justin Timberlake’s eyes": {
        "title": "Justin Timberlake’s eyes",
        "score": 7891,
        "url": "https://v.redd.it/r5om2lnoy18d1",
        "content": "",
        "num_comments": 719,
        "comments": [
            "That's a man who wakes up everyday with less than 24 hours on his clock.",
            "That dude seems mainly cocaine there.",
            "“Cocaine is God’s way of saying you’re making too much money”\n\nRobin Williams",
            "Bro, blink.",
            "Cocaines a hell of a drug",
            "The beginning of the downfall. Maybe he’ll snap out of it.",
            "Ok yeah this might effect the tour.",
            "Drugs are a hell of a drug",
            "He doesn't even look like himself that way.",
            "Not how 12 year old me assumed this would turn out"
        ]
    },
    "Spiky contacts used by morticians to keep the eyelids of the dead closed at funeral viewings.": {
        "title": "Spiky contacts used by morticians to keep the eyelids of the dead closed at funeral viewings.",
        "score": 779,
        "url": "https://i.redd.it/59e23l3yl38d1.jpeg",
        "content": "",
        "num_comments": 43,
        "comments": [
            "Lets thank the mortician because I would never want to see a dead person‘s eyes open",
            "The story goes my Dad died when I was 7, mid way through first viewing the cotton ball they used, let's say failed, and his eyelid collapsed. Needless to say trauma ensued for a few, thankfully I walked in, took a look, said \"that ain't my Dad\" and promptly left to greet people at the entrance with the news. Everyone thought it was cute, man the 80s was a wild time huh.?\n\nEdit: Should mention, he did donate his eyes to someone in need, thus the cotton ball, still not entirely sure why they didn't use more but hey I was 7 and didn't find out til I was like 20.",
            "I don't understand funeral viewings. I wish I could erase the memory of seeing my grandmother dead.",
            "Never got a complaints though.",
            "Open casket funerals are wild to me. Went to two of them. If I have a funeral it will be closed casket. You can remember me how I was when I was alive thank you.",
            "Coins for the ferryman.",
            "Sometimes super glue too.",
            "This is why I had a closed casket funeral for my husband. I could bear for them to do any of that embalming or spikey contact shit to him.",
            "This is true. I use to harvest cornea donors after they died. Sometimes the eye lid did not want to stay down. It is a muscle after all. Or if cutting to deep you can blow the eye ball. Basically punctire it and all the gel comes out. So these would also help reshape the eye to help it look normal when the eye lid was closed rather than have a big indentation. They are plastic with little barbs on them. See you later.",
            "Forbidden spaghetti strainer"
        ]
    },
    "A road in Ireland": {
        "title": "A road in Ireland",
        "score": 80,
        "url": "https://i.redd.it/agq9dfrra48d1.png",
        "content": "",
        "num_comments": 13,
        "comments": [
            " Ah, the roads in Ireland! Full of twists, turns, and surprises.",
            "Lovecraftian vibe.",
            "Nope...",
            "The road to Mag Mell.",
            "That's where the local fae live, they're harmless as long as you don't tell them your true name",
            "black metal band album art template (mandatory unreadable logo)",
            "Pretty!",
            "That's how you get kidnapped by the Fae",
            "Now imagine driving down this on the left side when you’re used to driving on the right and any oncoming cars easily doing 100 km/h despite there being no shoulders, no passing room, blind hills and turns, etc.  Add in the occasional pedestrian for extra laughs.",
            "The street lights on the roads look like their covered in gold coins at night flying to and from shannon."
        ]
    },
    "My cover pic that Spotify put for my Classical mix": {
        "title": "My cover pic that Spotify put for my Classical mix",
        "score": 92,
        "url": "https://i.redd.it/c876lciy438d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Lol, looks pretty standard for Aphex Twin honestly.",
            "Yep that's Aphex Twin for you",
            "Aphex Twin, isn't it?",
            "Knows you well",
            "Well, yeah. It’s got Aphex Twin in it",
            "Most of Aphex Twin's music is very experimental electronic music however he has produced some very beautiful piano music which I guess is why he was added to the classical playlist!",
            "Lick a window with the Windowlicker",
            "That's just Dichard J Rames",
            "It truly is   I never even heard of the guy I thought it was some AI bug or something 😅 creepyAF",
            "i love the piano stuff reminds me of being a kid for some reason"
        ]
    }
}