{
    "Targeted shirts/mugs/onesies/whatever are now banned.": {
        "title": "Targeted shirts/mugs/onesies/whatever are now banned.",
        "score": 1750,
        "url": "https://www.reddit.com/r/oddlyspecific/comments/a81dj2/targeted_shirtsmugsonesieswhatever_are_now_banned/",
        "content": "Please do not submit them. /r/TargetedShirts is thataway.\n\nExample of what not to post:\n[Shirt](https://i.imgur.com/w9a7kud.jpg)",
        "num_comments": 35,
        "comments": [
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[deleted]",
            "[deleted]"
        ]
    },
    "Mushrooms": {
        "title": "Mushrooms",
        "score": 1282,
        "url": "https://i.redd.it/alblnqj3gd9d1.png",
        "content": "",
        "num_comments": 34,
        "comments": [
            "You have 2/3s of a shot to see God then.",
            "\"All mushrooms are edible.  Some only once.\"\n\nAn old proverb now attributed to Terry Pratchett",
            "“Brian” actually means “Expendable” in ancient Sumerian",
            "They probably observed the animals eating the good ones",
            "*10.000 bc*\n\n\"Bruhh don't eat them yellows here. , i saw God!\"\n\n\"first of all, that sounds racist af. Second, who the fuck is God?\"",
            "Poor Brian.",
            "A week’s unlikely unless you ate like, a basketful of them. Normal duration’s 4-6 hours.",
            "These are the people I thank on thanksgiving. The people who literally died figuring out what we can eat.",
            "Which ones last a week? You know, so, uhhhhhhh... I can avoid them",
            "Supposedly, or so told me someone who knew someone who knew a shaman, that's the wrong order.  \nThe right order was, taking the magic mushroom, and let it tell you what all the other plants were for.  \nBut there most probably was lot of Brian & Co in the process."
        ]
    },
    "BUBBS, the fuck you doin’?": {
        "title": "BUBBS, the fuck you doin’?",
        "score": 558,
        "url": "https://i.redd.it/o79fj1tgx79d1.jpeg",
        "content": "",
        "num_comments": 50,
        "comments": [
            "That one legged stripper who only works on Fridays named Arrr-lene.",
            "Holy crap!  They have a no legged stripper and a three legged stripper at the same club?!",
            "Amputee strippers rule!",
            "maybe one of them has an unsexy leg",
            "WTF...What?!? 😆🤣😂",
            "You should see where she puts that artificial leg.",
            "Certainly makes me want to check it out",
            "When I was in my early 20s, my friends and I celebrated an event at a step club for laughs. We got one of our friends a lap dance from a stripper. She started by backing up toward him and when she whipped around, we noticed she had one arm. Stripping is for everyone.",
            "For sad souls who don't get the reference: \n\n\nhttps://youtu.be/Mgm4BULxZnA?si=aUf7r2kklBYcplnl",
            "Liquor and whooooores, liquor, and whores..."
        ]
    },
    "Come on, not Andy!": {
        "title": "Come on, not Andy!",
        "score": 695,
        "url": "https://i.redd.it/2rchdbuppc9d1.jpeg",
        "content": "",
        "num_comments": 39,
        "comments": [
            "Andy of Mayberry?",
            "Poor Andy. r/fuckyouinparticular",
            "I first read this as: assigned cop at birth",
            "Andy and Sheriff Truman crying right now",
            "All Children Are Bears? 😂",
            "Fucking Andy",
            "Probably Andy from Hamburg?",
            "Andy if you see this I'm coming",
            "Andy is a dog",
            "Damn right"
        ]
    },
    "What? Why is this so specific?": {
        "title": "What? Why is this so specific?",
        "score": 69,
        "url": "https://i.redd.it/bgv0t4a38x8d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "It's just ragging on 'fanon' that completely and utterly pisses on the established and canon traits of a character.",
            "Cyrano de Bergerac ??",
            "Kirby",
            "The joke is that it applies to literally nothing. It's hyper-specific on purpose.\n\nIt's ragging on these super annoying trends circling reddit. It feels like every week, somebody makes a meme template of:\n\n* Hey fandom, what does my favorite character say about me?\n* Hey fandom, what does my favorite arc say about me?\n* Hey fandom, which character is shown like this?\n* Hey fandom, which character is depicted as this but isn't this?\n* Hey fandom, fill in the blanks on this.\n\nShit like that. They then get spread to every single media-related subreddit, being low-effort engagement farms that seem to somehow keep getting thousands of upvotes consistently, and clogging up everyones feed. So the joke here is one of those templates, except it's useless and impossible to engage with."
        ]
    }
}