{
    "Ring Removal by Tourniquet": {
        "title": "Ring Removal by Tourniquet",
        "score": 10119,
        "url": "https://v.redd.it/cwzyccx7ag9d1",
        "content": "",
        "num_comments": 130,
        "comments": [
            "I feel second hand relief",
            "Every fibre of my being was going get it off get it off get it off watching that.",
            "Howd they get the tourniquet thru the ring in the first place?",
            "Had to do this a few days ago turns out my gold filled ring had a base of silver which Im allergic to  ",
            "This ring came off pretty smoothly. I had 3 rings stuck on one finger, post partum and this technique, in a&e took ages and was a painful process. The relief once they were off though was amazing.",
            "Pain level? 6 / 10?",
            "This makes me think we should just get tattoos on our ring fingers instead of clamping bands of metal over them, maybe. Also that way you can never get chewed out for forgetting your ring.",
            "Actually, this ruined my evening.",
            "Huh so ig the LPT really works",
            "As someone who worked in emergency care for a long time its my duty to let you all know this hurts like a motherfucker \n\nLet someone trained do it"
        ]
    },
    "A skilled Durian cutter at work": {
        "title": "A skilled Durian cutter at work",
        "score": 17272,
        "url": "https://v.redd.it/tb2dn4h68f9d1",
        "content": "",
        "num_comments": 603,
        "comments": [
            "I remember when we visited Vietnam, they had No Durian signs all over. Businesses like Hotels and Tourist places like Museums knew people who were not used to the smell would gag. \n\nMy mother loved the fruit. I tasted it, and it tasted okay, but I could not detach the taste from the smell.",
            "Whats the purpose of that quick, small horizontal cut before throwing the exterior in the bin?",
            "Ive always wanted to try one, just because people always say how horrible they smell. This makes me want to try one even more",
            "The best is freezing Durian and eating it like ice cream. It smells less and offsets its dense heat. This fruit is said to be heated in Thai, meaning that youre supposed to eat only a few and avoid drinking alcohol. Its very calorific as well. My mother had a craving for durian whilst she was pregnant with me. I turned out to be a giant baby and the tallest in my entire family. I turned out to be six foot tall Korean chick. My dad called me radioactive. ",
            "Why does he cut across the inside of the husk once the fruit is gone? He does it so fast it's hard to see, but after he removes the fruit he slices the inside white portion sometimes. \n\nI thought it was quickly checking to see if there was more, but he's not even looking at it, so that can't be it. Anyone know?",
            "Looks like uni, smells like death",
            "I was just in Vietnam and saw signs all over that prohibited people from bringing durian inside hotels bc of the smell. So it made me hesitant to eat it. What does it taste like? Im planning to be back in SEA next year so maybe Ill try it then!",
            "No, the inside skin of the durian is useful. After eating durian, you can wash your hands with the inside of the skin. Just put some water on it and use it to wash/rinse your hands; the durian smell will disappear. You can also gargle with it to reduce the durian smell in your mouth.",
            "Lived in SE Asia a handful of years. The smell killed me at first then after I ate it the smell wasnt nearly as offensive and sometimes even good. Hard to explain but eating it was the best thing I did",
            "Honestly, how sharp is that thing? Mild annoyance, ruin your day or hospital trip?"
        ]
    },
    "Building a bamboo swing": {
        "title": "Building a bamboo swing",
        "score": 2150,
        "url": "https://v.redd.it/41y8hcynng9d1",
        "content": "",
        "num_comments": 178,
        "comments": [
            "By day 3: this shits taking too long, lemme use some power tools",
            "I usually enjoy these videos cuz the process is interesting and there's always a zen-like quality but this one was wild. She's like a whirlwind of bamboo destruction. Also a lot of little weird things. She falls off the path and we hear a perfectly cut scream. The dog and cat are having a war. There's a closeup shot of blood on her leg. The animals are constantly in her way. The sound effects are crazy loud. Finally, after building most of the swing with nothing but bamboo and a dream, she apparently throws tradition to the wayside and finishes the job with modern equipment.",
            "Little black dog about to get destroyed by the cat ",
            "was like aww this must some ancient way of building of a swing, and then out of nowhere  POW POW POW a nail gun lol.",
            "I usually prefer the more traditional Asian \"how to\" videos but this girl had me cracking up the whole time.",
            "yoo. her energy is wild.",
            "It's weird having such calming music, but utter chaos going on around and during the construction. Benny Hill music would suit it better.",
            "Making roof tiles out of bamboo is genius.",
            "I want to hire her she works harder than most people Ive ever worked with.",
            "I almost thought she was going to squash one of her dogs when she jumped off the bench"
        ]
    },
    "Just a cow grazing on some lush green grass ": {
        "title": "Just a cow grazing on some lush green grass ",
        "score": 2815,
        "url": "https://v.redd.it/8471i9940e9d1",
        "content": "",
        "num_comments": 125,
        "comments": [
            "She looks so good doing that I might eat a salad.",
            "You have to admire an animal that big for being able to survive on mostly grass and also be able to turn it into a nutritious liquid.",
            "Thats a happy and healthy cow.",
            "they must eat so many bugs",
            "Imagine being able to walk around and anywhere you choose to lower your head theres food ready to be eaten.",
            "It sucks they taste so good.",
            "That's right lick that grass.",
            "The cow is actually going for the dandylions over the grass. If you watch the dabdylion stalks the cow is moving from one to another, ignoring the grass in between.",
            "That looks frustrating. Can I get some longer grass please?",
            "ASMR is a plague that should be stopped."
        ]
    },
    "Möbius wind kinetic sculpture": {
        "title": "Möbius wind kinetic sculpture",
        "score": 364,
        "url": "https://v.redd.it/8ci9zvuryg9d1",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Why did I read it as Morbius",
            "When I was a kid my parents took us on a vacation to New Mexico and on the second day we ate breakfast at a local tourist spot and I accidentally ordered something so fucking spicy that I was snotting all over the place and ended up leaving hungry, and then immediately after my parents dragged me like half a mile in the hot summer sun to a fucking wind sculpture place like this and argued with each other about whether or not to buy one and drive it back home to Kansas meanwhile I was fucking dying.\n\nI just wanted to get that out, thanks.",
            "Sank some quality work time just staring at this on loop, thanks. ",
            "Why did I read it as Morbius",
            "It looks like a ufo.",
            "Biblically accurate windchimes",
            "r/blackmagicfuckery",
            "u/that-1-lame-kid\n\nOooooooh",
            "Be not afraid",
            "Sorcery!   Begone devil sorcerer!"
        ]
    }
}