{
    "Do Not Post Links to Your Listings -- They Will Be Removed": {
        "title": "Do Not Post Links to Your Listings -- They Will Be Removed",
        "score": 36,
        "url": "https://www.reddit.com/r/offerup/comments/ben59z/do_not_post_links_to_your_listings_they_will_be/",
        "content": "This subreddit is for discussion about the app, not to advertise.",
        "num_comments": 10,
        "comments": [
            "Okay thanks for having that post keeps me from posting on here just to let you know that's the first thing people are going to want to do with this Community is post their offer up because they're trying to sell their stuff but since Community doesn't seem to have a actual purpose there's no reason that you enjoying",
            "They remove the account before that sometimes",
            "Are links allowed in the descriptions of your posted products on offerup?",
            "I'm sure the number of active sellers will be greatly reduced in the next few months. After the 1st week of the new policy has been in place I have gone from about 1 sale every other day and 2 to 50 messages a day (from new buyers) to my new record low of no new sales and 3 messages from new (I suspect they're just typical Offer Up hired fake buyers) uninterested buyers asking if stuff is available and nothing more. \n\n  I also suspect that they'll be upping the number of fake messages as a way to keep sellers from quitting saling there altogether. I know after 7 years of full time sales with over 2000 sales coming from the first 4 years, I've seen only a few hundred in the last 3 years. I don't really lost anything under $10 and most sales are  for $30 to $50. With 200 items posted and my main sales being vacuums priced $25 to $125 each I've always had buyers contacting me since vacuums are needed in everyday life and they are commonly abused and never maintained , that creates a large interest in my sales. \n\nThe new listing rules have affected my posting at the very end of the month but more than that it's now very important to place my posts at the best times. I used to post whenever I thought about it regardless of time or day. Now I'll never get my posts seen by anyone if I don't have the option to repost them for more coverage. So now any post done at the beginning of the month is just a waste of my time since everyone is posting their free posts at the same time. Plus including vacuums in the same category as appliances has never been the correct category since it's inception. They managed to get carpet cleaners in the right category  but vacuums has been part of refrigerator and stoves and water heaters. I don't think anyone has ever considered those to be classified as the same type of device as a vacuum cleaner since they don't even offer shipping on vacuum cleaners I think they messed up.\n\nBut the reality is with the way they're going about imposing their newest changes in an effort to get rid of the last few sellers who aren't paying for their service I see it as the same thing eBay did years back. Once they had big stores starting to post in their platform they got rid of all the little sellers and it has greatly affected how people ship there since. With the items being sold focusing on new or high priced items and the chances of finding those old gems that used to fill ebays sales, the type of shopper has been limited and after a while those that helped make eBay a fun place to shop have now left and they won't return anytime soon.\n\nOffer up has had the worst way of thinking when it comes to keeping the apps appeal and maintaining users. First by ignoring all requests to fix the app to make more user friendly, then to ignore users requests to bring back useful features that they removed and also to fix the all to make it easier to use and less time consuming. They did whatever they wanted and it cost them most of their buyers  I know I felt it when my sales were cut to about ¼ if what they were . This coincided with the ending of covid and the start of offer ups last rendition after buying let go and that was also when the new CEO started. \n\nNow that the full wrath of their money grubbing scheme is in place I hope they're happy and once they see exactly what will be happening very soon (we all know how apps come in go like the wind) that there are better places to sell (but not for free) but if I have to pay to sell, why would I pick the one that is the hardest to use, brings the lowest sales prices, makes the least amount of actual sales, has a platform that uses the worst program ever implemented and never us fixed, I never get any notifications and my messages don't show and on top of it all costs the most to use and has not 1 special feature ot kffeds any way yo repost (they like wasting my time and offer me no useful information.)\n\nOther sales platforms offer statistics that provide huge amounts of info that help you see exactly what's going on and helps you evaluate your standing. One simple tool I need from offer up is when a buyer contacts me I should be able to see how many other times they contacted me and what they have bought from me so far. I get the users that share the same IDs constantly and I have no idea why they are but they know me! Others have sent hundreds of messages and have been no shows repeatedly but I have no idea that they have done that since I can't see into the past messages. It would be nice to know that I should not deal with them and block them at that time  without knowing I'll be blocking every buyer who I think is wasting my time and losing possible sales.\n\nThe app is useless now and I effective for sales, the price to make sales is not worth the price my items sell for, they are unreasonable in prices and your items will never be seen by anyone. If everyone has to pay, the only items that will not be considered to be premium are those that were free and if all paid items get top billing then free won't be seen and the entire way that they ve been running ou has been based on paid items getting more exposure, then how does it work when every item is a paid post \n\nIt's know just like when they started but you have to pay and the free ones are just a waste of time. There can't be any other way for it to be structured?\n\nLike I said they'll be in for a huge loss if sellers over the next 2 months with the biggest drop just after Christmas in new years. I already have made plans to get rid of what I have in hand using other methods and have no interest in continuing sales on ou, I'll have a yard sale and still make the same amount for my time spent. Zero new sales for a week and 3 messages in that week  that's not going work for me.",
            "The purpose of this subreddit is for discussion about OfferUp, not advertising posts.\n\nWe don't recommend buying things shipped through OfferUp. Too many people have gotten scammed. We recommend only meeting in person, in a safe, public space, paying with cash.",
            "How can I tell if the cash is real?",
            "Buy a pen on Amazon, scratch the collars. don't accept 100's.",
            "What pen do I buy? And why shouldn’t I accept 100s there the most common form of payment",
            "100's are not the most common form of payment lol, and they're the most commonly faked. Buy a money testing pen with a UV light on it."
        ]
    },
    "Tutorial: Removing spam listings on Offerup!": {
        "title": "Tutorial: Removing spam listings on Offerup!",
        "score": 28,
        "url": "https://www.reddit.com/r/offerup/comments/t0ft76/tutorial_removing_spam_listings_on_offerup/",
        "content": "UPDATE: AS OF June 18, 2024 this will only hide the listing, but an empty white space will still occupy the existing space.  If you set up this prior the stated date, there is updated syntax to fix this (nothing major, added code will be in **bold**).  If you are installing this after the stated date, then disregard.\n\nOld:\n\n  \n`a[title~=\"\"])`\n\n`{`\n\n`display: none;`\n\n`}`\n\nNew:\n\n**li:has(>** `a[title~=\"\"]`**)**\n\n`{`\n\n`display: none;`\n\n`}`\n\n**Note: Removing ads has not changed.**\n\n\n\n\\*This is somewhat tedious since you have to manually block specific titles, but you only need to block one of its listing's titles and you'll never see any of them again!\n\n\\*\\* works only for Desktop\n\n\\*\\*\\* some \"coding\" required, but it's super simple and I'll show you how each step of the way!\n\n\\*\\*\\*\\* unfortunately this might block non-spam listings if the titles happen to match spam ones\n\n\n\n**The Setup:**\n\n1. Download the extension Stylus for [Chrome](https://chrome.google.com/webstore/detail/stylus/clngdbkpkpeebahjckkjfobafhncgmne?hl=en) or [Firefox](https://addons.mozilla.org/en-US/firefox/addon/styl-us/) , it's a CSS editor for browsers (you can use anyone you are familiar with).  You will use this to block listings that contain specific words in the listing's title.\n2. On the OfferUp homepage, navigate to your extensions and click on the Stylus icon\n3. Click on \"o[fferup.com](https://Offerup.com)\" under *Write Styles For:*\n   1. This will bring you to a new page to write the styles/code.  You're ready to block listings now!\n\n**The Do:**\n\n1. Copy and paste this into the giant text box:\n\n`li:has(> a[title~=\"\"])`\n\n`{`\n\n`display: none;`\n\n`}`\n\n\n\n2. Inside the quotation marks of **\\[title\\~=\"\"\\]**, enter a single word (case-sensitive) in that title.\n\n3. If you want to filter out a title with multiple words (a word is separated by a space, so *$70* is one word and *$ 70* is two words), copy and paste additional **\\[title\\~=\"\"\\]** blocks right next to the previous one.  Eg:\n\n`li:has(> a[title~=\"\"][title~=\"\"][title~=\"\"][title~=\"\"])`\n\n`{`\n\n`display: none;`\n\n`}`\n\n4. That's it!  Hit save on the left or ctrl+s to save the styles.\n\n\n\nExamples:\n\nA.  If I want to hide hundreds of listings that were titled **NEW IN BOX 100” diagonal 87x48 inches Retractable Projector Screen hanging wall mount 16:9 ratio indoor home movie theater Projector Screen**, I don't need to make a **\\[title\\~=\"\"\\]** for each word.  Instead, I'll only use the key words **NEW IN BOX**:\n\n`li:has(> a[title~=\"NEW\"][title~=\"IN\"][title~=\"BOX\"])`\n\n`{`\n\n`display: none;`\n\n`}`\n\nB. **Hiding more than one listing:**\n\nYou can copy and paste new rules right below your previous rules or have them all in one ruling, separated by a comma for each ruling.  **Method 1**  and **Method 2** do the exact same thing. Eg:\n\nMethod 1:\n\n`li:has(> a[title~=\"New\"][title~=\"in\"][title~=\"box\"][title~=\"$75\"])`\n\n`{`\n\n`display: none;`\n\n`}`\n\n`li:has(> a[title~=\"(new\"][title~=\"in\"][title~=\"box)\"][title~=\"$70\"])`\n\n`{`\n\n`display: none;`\n\n`}`\n\nMethod 2:\n\n`li:has(> a[title~=\"New\"][title~=\"in\"][title~=\"box\"][title~=\"$75\"]),`\n\n`li:has(> a[title~=\"(new\"][title~=\"in\"][title~=\"box)\"][title~=\"$70\"])`\n\n`{`\n\n`display: none;`\n\n`}`\n\n\\*\\*Remember, the blocking is case-sensitive, so if you wanted to block listings for **New in box**, you would have to make a new blocking rule for that too.\n\n\n\nPlease comment down below if you're having any trouble :)\n\n\n\n**REMOVE ADS:**\n\n`/*REMOVE ADS*/`\n\n`a[target=\"_blank\"][aria-label=\"opens in a new window\"] {`\n\n`display: none;`\n\n`}`",
        "num_comments": 14,
        "comments": [
            "Man, it's sad that OfferUp is leaving us to clean up the dirty work.",
            "Stickied!!",
            "A friend helped me out with this one, & wow, does it work great for [offerup.com](https://offerup.com)! I was able to eliminate so much of the junk/spam/scam posts. No more \"local cell phone stores\" that plaster 30+ entries a day, etc. Thank you u/cacaus!",
            "thanks for the write up! its a shame its only for titles though\n\ni actually came to this sub to bitch about it, i havnt used the site much but ive been looking for a cheap car to get me from a to b since mine went kaput and the amount of [spam listing are mind-boggling](https://i.imgur.com/4AD4huA.jpeg), they are just titled the same as the car in the one picture and they use real pictures not showroom pics. its impossible to tell that its a spam ad until you click the link and see some variation of \"i up_dated the app now i can't read the messag e's contact me ONLY AT [obviousfake]＠ Ｇ-M Ａ l L • Ｃ 0 M\" you cant even set a minimum milage to filter them since they are all set to 0 and unless im missing something it seems like theres no real way to filter any of that out how are you supposed to buy anything on this website?",
            "I'll have to try this on OU, as well as FBMP (where I am getting constant other-language spam/scams). Thanks!",
            "Now can remove Ads! See bottom of the original post.",
            "UPDATE: AS OF June 18, 2024 this will only hide the listing, but an empty white space will still occupy the existing space.  If you set up this prior the stated date, there is updated syntax to fix this (nothing major, added code will be in **bold**).  If you are installing this after the stated date, then disregard.\n\nOld:\n\n  \n`a[title~=\"\"])`\n\n`{`\n\n`display: none;`\n\n`}`\n\nNew:\n\n**li:has(>** `a[title~=\"\"]`**)**\n\n`{`\n\n`display: none;`\n\n`}`\n\n**Note: Removing ads has not changed.**",
            "[deleted]",
            "Ain't nobody got time for dat!!!",
            "Do you have a tampermonkey script for this by chance?"
        ]
    },
    "The original unit sells for $480 on Amazon. It was used for two days.": {
        "title": "The original unit sells for $480 on Amazon. It was used for two days.",
        "score": 70,
        "url": "https://i.redd.it/gq54sxyxwd9d1.jpeg",
        "content": "",
        "num_comments": 54,
        "comments": [
            "Sold",
            "That isn’t the flex you think it is",
            "Bought mine for $280 new from Costco a month or so ago... was priced at 360 with an $80 instant rebate...\n\nLow ball offer but still...\n\nWhy not just return it?",
            "OP intentionally wrote the response in hope it would get great review on here. 😆",
            "Why are you using an OfferUp account with a female profile name even though you're a guy?",
            "$400 seems too much for a used item.",
            "Is that the u shaped one?",
            "Great price! OfferUp buyers are notorious with the ridiculous offers….you came back pretty strong there lol",
            "At least he responded lol",
            "Just thought it was a funny response"
        ]
    },
    "Looks legit": {
        "title": "Looks legit",
        "score": 6,
        "url": "https://www.reddit.com/gallery/1dr3stt",
        "content": "",
        "num_comments": 4,
        "comments": [
            "F those people. Stealing LEGO and reselling. They're also so dumb they couldn't wait to take the security wrap off before taking a photo and posting it. Report them.\n\nEDIT Also f people who put a listing at one price but in the description it's a higher price. \n\nFound the listing, reported",
            "May look legitimate, but it's a scam. The millennium falcon goes for $85 retail, and only the medieval castle set was set right at $100. I would not do business with this seller as the signs are obvious.",
            "Of course it's a liberal state.",
            "Ngl id buy them, they’re already stolen so it’s not like they’re gonna be returned. \n\nBut also I’d make them cut the security things before buying them though lmao"
        ]
    },
    "Really?": {
        "title": "Really?",
        "score": 4,
        "url": "https://i.redd.it/etjlppkovf9d1.jpeg",
        "content": "I confirmed with him that we would meet at 3:30 then he asks me if we can push back to 5 then just proceeds to completely ghost me. ",
        "num_comments": 8,
        "comments": [
            "The exact reason I just have everyone pick up.",
            "Yeah never meet at your home unless the item is too large to take in a car.",
            "I select a meeting spot less than 5 minutes from my house and I tell them to message me when they get there for this exact reason. I won’t leave until they are there. I let them know this ahead of time.",
            "Block him and keep it moving… I’d be pissed!that was a waste of time",
            "That’s fair. I don’t really like people going to my house so I tell them to meet me at a store that’s a few minutes from my house lol",
            "Yep that’s usually what I do but then this happens",
            "The place we were meeting was only a couple blocks from me so I wasn’t too upset about that it’s just more about the waste of time considering her rescheduled to meet and hour and a half after the original meeting time then didn’t show up. But yeah next time I might try what you do and make sure they are there first 🙏",
            "Right even though my schedule was free he delayed me then did show"
        ]
    }
}