{
    "Basic Authentication is being retired in Exchange Online on October 1st – email clients and scripts might stop working": {
        "title": "Basic Authentication is being retired in Exchange Online on October 1st – email clients and scripts might stop working",
        "score": 95,
        "url": "https://www.reddit.com/r/Office365/comments/x75q9s/basic_authentication_is_being_retired_in_exchange/",
        "content": "Microsoft published the timeline and steps to take to finalize the retirement of basic authentication in Exchange Online:\n\n[Basic Authentication Deprecation in Exchange Online – September 2022 Update](https://techcommunity.microsoft.com/t5/exchange-team-blog/basic-authentication-deprecation-in-exchange-online-september/ba-p/3609437)\n\nYou might need to take action to avoid disruption of access. A very short summary:\n\n-\tAll previous opt-outs and re-entablements of basic authentication are not valid anymore\n-\tIf you want to keep using basic auth in Exchange Online after October 1st, you must explicitly opt-out in September\n-\tBasic auth is getting disabled for any protocols not opted-out during September, starting October 1st\n-\tAll opt-outs (or later re-enablements) expire early January 2023\n\nIf you are still using basic authentication for any of affected protocols, you must take action in September and finish your migration to modern authentication by early January 2023.",
        "num_comments": 75,
        "comments": [
            "Waiting for all the “but I wasn’t told” posts here 1st of October.",
            "So I understand that this will break apps and what not that are using Basic Authentication.  The issue I'm coming across is I now have 5-6 end users that are using 365 desktop apps that are fully updated and it's now prompting them for their password nonstop but not taking it in  a standard Windows Security prompt rather than the MFA looking prompt.  I've tried everything to get it to prompt for the proper MFA prompt (new profile, reinstalling Office, removing credentials from Credential Manager, etc) and nothing has worked beyond creating an entirely new Windows profile.  Then it instantly works.  Anyone have a fix/workaround for this?",
            "I'm going to make billions of dollars with my new basic auth email service.\n\nBILLIONS. OF. DOLLARS.",
            "Feels like this has been delayed 3x",
            "At the risk of asking a dumb question, does this mean that when I go to the M365 Portal > Settings > Org Settings > Modern Authentication (under Services), that all the check boxes under \"Allow access to basic authentication protocols\" should be unchecked?\n\nBecause I just took a peek in my tenant and all those box are still checked. So does that mean I still have Basic authentication enabled?",
            "On Iphones this is easily fixed by Removing the account and readding it by using the sign in button instead of manually adding the credentials.   \nOtherwise let them install the outlook app.",
            "Can you advise if multifactor authentication will be forced when migrating to modern auth for office 365? We are using IMAP with four O365  mailboxes and we just converted to modern auth, however there is a concern that MFA will be forced at the account level for SMTP and IMAP. Thank you. Andrew",
            "Hi- I'm trying to figure out if users will be able to use other authenticator apps going forward",
            "Well wtf do i do now?",
            "I have a number of customers whose imap integration broke today. They were already configured for OAUTH!"
        ]
    },
    "Exchange Online email applications stopped signing in, or keep asking for passwords? Start here.": {
        "title": "Exchange Online email applications stopped signing in, or keep asking for passwords? Start here.",
        "score": 82,
        "url": "https://techcommunity.microsoft.com/t5/exchange-team-blog/exchange-online-email-applications-stopped-signing-in-or-keep/ba-p/3641943",
        "content": "",
        "num_comments": 24,
        "comments": [
            "Absolutely ZERO excuse for having this problem. NO LESS THAN TWELVE alerts have been posted in the EAC regarding this over the past TWO YEARS.\n\nIf your company is affected by this, YOU ARE AN IMPOSTER ADMIN.",
            "I have a user that had their motherboard replaced. Since the replacement their outlook kept asking to login. I've deleted their mail profile and upon rebuilding the profile the prompt for MFA doesn't appear this the account setup fails. Any idea as to the fix for this? I've reinstalled office 365, modified the registry to bypass cached auto discover entries, built a new windows profile on the same machine all without resolving the issue. You can see the setup flash quickly for the MFA window but then it fails to complete. Also, revoked allMFA sessions and reregistered MFA. Office.com login works without issue. Logging in as the same user on a different laptop also works. Anyone else ever experience this? Ty in advance!",
            "I'm leaning to think this sub isn't meant for people that will be able to process that article.\n\nBut yeah.",
            "Damn, good luck explaining how you missed this one.",
            "You are getting fired and it's your fault",
            "I've had this issue this week.  Every time I sign in I check Keep Me Signed In.",
            "Monday is gonna be fun in a few subs lol. If they haven't been paying attention to this then they probably won't even notice a problem until they get in the office on Monday.",
            "Imposter admin here. Apps team wouldn't do shit to move their stuff, I'm taking Monday off. Hope they have a good day with the documentation I sent over months ago.",
            "Mostly but in my case we have an old pbx that uses basic auth to deposit voicemails. They've been aware but they're getting push back saying there's no budget for the upgrade. I called in for Monday because I know this will someone be blamed on me.",
            "so kind of you to admonish him when having a problem.\n\nlet me know when you are down so i can come and kick you as you seem to think that is what is the appropriate response."
        ]
    },
    "I have not been charged": {
        "title": "I have not been charged",
        "score": 1,
        "url": "https://www.reddit.com/r/Office365/comments/1dr9zwq/i_have_not_been_charged/",
        "content": "Hi, I started 1 month Business Premium trial on  8th of May, on 8th of June I received an email that my subscription was renewed, yet I have not been charged to this date. Is this normal? I have Annual subscription with monthly fees. I have nothing listed on Billing -> Payment methods, but my VISA card is listed on Billing accounts -> Billing profile.",
        "num_comments": 0,
        "comments": []
    },
    "Upload spreadsheet and tell ai to read certain columns, and make a summary of these to insert in a new column": {
        "title": "Upload spreadsheet and tell ai to read certain columns, and make a summary of these to insert in a new column",
        "score": 2,
        "url": "https://www.reddit.com/r/Office365/comments/1dr4x3n/upload_spreadsheet_and_tell_ai_to_read_certain/",
        "content": "Hi there,\n\nJust want to know if this is possible. Like, here is a spreadsheet,each row is a recipie, column a is ingredients,column b are cooking instructions. Create a short summary for eqch recipe and write it into column c.\n\nIf this is possible,please guide me in the right direction how to achive this on the power platform",
        "num_comments": 0,
        "comments": []
    },
    "Powershell command to list risky users and sign ins. ": {
        "title": "Powershell command to list risky users and sign ins. ",
        "score": 5,
        "url": "https://www.reddit.com/r/Office365/comments/1dqzrga/powershell_command_to_list_risky_users_and_sign/",
        "content": "Is it possible to run a powershell command to check if their are any risky users, risky sign ins, etc? \n\nI'd like to be able to set this on a schedule ans email if there is anything. ",
        "num_comments": 5,
        "comments": [
            "My global admin role by default is emailed a weekly entra digest, which shows a summary of risky users and sign-ins, and then links to the relevant page.\nHopefully you can find the page that configures recipients, and add additional users to be emailed.",
            "First you will need to define what risky means.",
            "Yes these. But we don't have a P2 license. With my license I can view them.",
            "start here: https://github.com/AzureAD/IdentityProtectionTools",
            "Presumably, OP is referring to risk based conditional access policies available to Entra ID P2 subscribers. \n\nhttps://learn.microsoft.com/en-us/entra/identity/authentication/tutorial-risk-based-sspr-mfa"
        ]
    }
}