{
    "Ohio releases list of 159,000 inactive voters to be purged ahead of the November election. Here’s how to check if you’re on it.": {
        "title": "Ohio releases list of 159,000 inactive voters to be purged ahead of the November election. Here’s how to check if you’re on it.",
        "score": 345,
        "url": "https://www.cleveland.com/news/2024/06/ohio-releases-list-of-159000-inactive-voters-to-be-purged-ahead-of-the-november-election-heres-how-to-check-if-youre-on-it.html?utm_medium=social&utm_source=redditsocial&utm_campaign=redditor",
        "content": "",
        "num_comments": 103,
        "comments": [
            "I would LOVE to see the distribution of party registration of this list.",
            "Search for your friends and family. Let them know if they're on the list and help them register to vote!",
            "Just remember if orange man wins and you voted against him you'll be put on a different kind of list",
            "Oh Frank, I better not get purged.",
            "And Senate Republicans just blocked the Right to Contraception Act. Could they just not be awful for like a day?",
            "This reminded me to update my address for voting this year.",
            "Very convenient they haven't purged the 2 republicans I bought my house from...",
            "Excellent pic of that shit eating cockroach",
            "Well, they released the list. If youre on the list, make sure you get registered. Share this with the people you know passing along the same message.",
            "Ohio is a solid red state. You get what you vote for. Make better choices at the ballot box."
        ]
    },
    "This is Ohio": {
        "title": "This is Ohio",
        "score": 1710,
        "url": "https://i.imgur.com/isSHrth.jpeg",
        "content": "",
        "num_comments": 285,
        "comments": [
            "Honestly, every region has its driving idiosyncrasies, but Ive never been anywhere in the US that doesnt have left lane campers.",
            "Okay, we can all stop now. This is the official picture.",
            "I've long felt that the Ohio motto should be changed to \"Slower traffic please keep right\". Has a nice ring to it.",
            "Every goddamn time. \n\nI remain calm externally, but internally it grinds my gears.",
            "This is the United States",
            "Nah if this was Ohio there would be some construction cones but no work being done",
            "Dont worry Id be in the right lane I know my place lol",
            "Nah, its missing the jackhole hugging the divider lines like they're gonna change lanes without signaling.",
            "Couldve at least given the rest of us a trigger warning.  This shit pisses me off like nothing else.  Hell Id be willing to advocate for people needing to retake a driving exam every 2-3 years.",
            "Im the black truck passing all the lemmings on the right and the lead car thinks Im the a-hole."
        ]
    },
    "Monarch in Ohio": {
        "title": "Monarch in Ohio",
        "score": 36,
        "url": "https://v.redd.it/pkrh3htcbe9d1",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Ohio senator J.D. Vance accused of playing Putin's game": {
        "title": "Ohio senator J.D. Vance accused of playing Putin's game",
        "score": 224,
        "url": "https://ohiocapitaljournal.com/2024/06/28/ohio-senator-j-d-vance-accused-of-playing-putins-game/",
        "content": "",
        "num_comments": 54,
        "comments": [
            "Hes supposed to be playing for Ohioans but hes not doing that at all. He needs to go.",
            "The Senator has a remarkably \"punchable\" face.",
            "The kompromat they must have on this guy",
            "DB JD!  No stopping his asshattedness",
            "I blame Ron Howard for this. If he hadn't made a movie of Vance's shitty book, Vance would be a nobody. That fucking movie made Vance instantly famous, and he used that as a springboard",
            "Oh, another great article from the Ohio Capital Journal.",
            "Tough to take any of this talk seriously after so many years of Trump is Russian Asset lies and then seeing the sitting US President unable to speak coherently during a debate despite months of the media saying the dude is super sharp and all there totally!!! Im little more concerned with Putin seeing Biden on the stage. Granted, that may be why he did what he did while Biden was President.",
            "Russia - Russia - Russia \n\nWe should all be tired of this nonsense.",
            "woah hold up, putin is badass and cool dont lump him in with jd vance.",
            "Coulda told you that before he was elected"
        ]
    },
    "This is OHIO ": {
        "title": "This is OHIO ",
        "score": 22,
        "url": "https://v.redd.it/98c8db2ub49d1",
        "content": "",
        "num_comments": 1,
        "comments": [
            "green caterpillar> cocoon> baby monarch butterfly"
        ]
    }
}