{
    "Ohio releases list of 159,000 inactive voters to be purged ahead of the November election. Here’s how to check if you’re on it.": {
        "title": "Ohio releases list of 159,000 inactive voters to be purged ahead of the November election. Here’s how to check if you’re on it.",
        "score": 353,
        "url": "https://www.cleveland.com/news/2024/06/ohio-releases-list-of-159000-inactive-voters-to-be-purged-ahead-of-the-november-election-heres-how-to-check-if-youre-on-it.html?utm_medium=social&utm_source=redditsocial&utm_campaign=redditor",
        "content": "",
        "num_comments": 103,
        "comments": [
            "Secretary of State Frank LaRose has published the list in case anyone who’s on it is there in error, as has happened in the past. A state website, [https://registrationreadiness.ohiosos.gov/](https://registrationreadiness.ohiosos.gov/), includes a searchable database showing all the registrations. Anyone who’s on it can prevent their registration from getting canceled if, before July 22, they either:\n\n* [Update their voter registration online](https://olvr.ohiosos.gov/) or at a county board of elections office\n* Confirm their address at a county BMV or county board of elections office\n* Request an absentee ballot\n* Sign a candidate or issue petition\n\nVoters whose registrations are canceled can re-register at any time. The deadline to register to vote in the upcoming Nov. 5 election falls on Oct. 7.\n\nEDIT: This is the info you need but anyone can access the full article linked in the OP by registering for a free account. **You don't need to enter any payment information for access.**",
            "Purge Frank LaRose.",
            "I would LOVE to see the distribution of party registration of this list.",
            "FYI:  \"Approved by a 62-38 ratio, the amendment repealed election-day and permanent registration, established a 30-day, statewide registration requirement effective in 1978, and required re-registration if a voter failed to vote at least once in a four-year period. For the first time, Ohio had a standard statewide voter registration requirement, effective for the Nov. 7, 1978 election. (prior to this there was no statewide requirement for voters to be registered). As of Jan. 1, 1979, the Ohio secretary of state was required to maintain a master list of registered voters, compiled from the 88 county boards of elections. The state also began allowing registration by mail.\"\n\nLaRose was the first SoS to publish lists of those in danger of being purged.  \n\nI won't vote for any R's in Ohio, but let's have the facts.",
            "I don't know why the message isn't getting across...if you're on the list and you think that's an error you can get that changed through contacting them.....if you don't correct it and are then removed you can reapply to get back on the active list........if you don't respond either way you're just off the list",
            "Search for your friends and family. Let them know if they're on the list and help them register to vote!",
            "Just remember if orange man wins and you voted against him you'll be put on a different kind of list",
            "Not that this isn’t complete BS, and obvious for what it is from the pathetic GOP, but I will say this: \n\nIf you are on that list, use this as a wake up call to start voting every two damn years and live up to what I see as your civic freaking duty. How, after everything that has happened since 2016 have all (yes, I am sure there are a few people with reasonable excuses-a FEW!) of you not gotten off your rear ends and VOTED! \n\nAgain, as much as I hate the makeup of our current state government,the GOP….and this stunt, shame on all of you on that list for being to lazy and apathetic to try to change things in this damn state/country. You gave them the opening, and now your only redemption is to fix it before election time and start freaking voting every two years!!!!!",
            "[Obligatory](https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2Fj03y5p1o77yb1.jpg)",
            "Oh Frank, I better not get purged."
        ]
    },
    "This is Ohio": {
        "title": "This is Ohio",
        "score": 1420,
        "url": "https://i.imgur.com/isSHrth.jpeg",
        "content": "",
        "num_comments": 236,
        "comments": [
            "Honestly, every region has its driving idiosyncrasies, but I’ve never been anywhere in the US that doesn’t have left lane campers.",
            "Okay, we can all stop now. This is the official picture.",
            "I've long felt that the Ohio motto should be changed to \"Slower traffic please keep right\". Has a nice ring to it.",
            "This is the United States",
            "Every goddamn time. \n\nI remain calm externally, but internally it grinds my gears.",
            "He's passing. The trucks in the right lane are going 64.9 and he's going 65.\n\n\nAll you speed freaks who want to go 65.1 need to think about safety and surrender your driver's licenses before you kill someone.",
            "Straight to jail.",
            "This is OREGON.",
            "It's only ohio if that first guy in the left lane speeds up to 80 to catch up with that truck then sits beside him going 65 for 5 miles so no one can pass then speeds up again until he catches the next truck.\n\n\nI call ohios issue racecar I don't want to go faster than you but it want to pass you. Ends up with a bunch of clogged turds in the pipe",
            "I’m the black truck passing all the lemmings on the right and the lead car thinks I’m the a-hole."
        ]
    },
    "Ohio senator J.D. Vance accused of playing Putin's game": {
        "title": "Ohio senator J.D. Vance accused of playing Putin's game",
        "score": 111,
        "url": "https://ohiocapitaljournal.com/2024/06/28/ohio-senator-j-d-vance-accused-of-playing-putins-game/",
        "content": "",
        "num_comments": 27,
        "comments": [
            "Hillbilly Treachery?",
            "DB JD!  No stopping his asshattedness",
            "Wild how Jim Jordan \"accidentally\" pushed a Russian misinformation campaign, going after Biden with it, and then when it was revealed to the public to be a Russian ruse; he wanted to keep going and double downed.\n\nNow we have JD Vance playing Putin's game; pushing against support for Ukraine, fighting for the removal of DEI, wanting to end as much trade with other countries, opposing LGBTQIA+ rights, while his state's party is pushing to censor public education and defund libraries, and wanting to make certain people and livelihoods criminal.\n\nThat's not even mentioning Project 2025, and how it if it was pulled off, would destroy the United States and make it a eerily similar to Russia. Mind you, Vance supports a lot of its ideas and is actively pushing for some of them now.\n\nPeople keep saying \"GOP\", but it's starting to sound more and more like \"CCCP.\" Red is Red, I guess.",
            "Same!",
            "woah hold up, putin is badass and cool dont lump him in with jd vance.",
            "Russia - Russia - Russia \n\nWe should all be tired of this nonsense.",
            "Tough to take any of this talk seriously after so many years of “Trump is Russian Asset” lies and then seeing the sitting US President unable to speak coherently during a debate despite months of the media saying “the dude is super sharp and all there totally!!!” I’m little more concerned with Putin seeing Biden on the stage. Granted, that may be why he did what he did while Biden was President.",
            "More liberal puke.",
            "Very tired of it, we should round up the GOP today and start letting nature take its course, I believe the constitution has some pretty interesting things to say about those who give aid and comfort to our enemies.",
            "I am. Also tired of both political parties"
        ]
    },
    "A rare $20 bill that was printed in Youngstown, Ohio during the Great Depression": {
        "title": "A rare $20 bill that was printed in Youngstown, Ohio during the Great Depression",
        "score": 139,
        "url": "https://i.redd.it/e8z3z70xce9d1.jpeg",
        "content": "",
        "num_comments": 14,
        "comments": [
            "My grandmother would wax poetic about how much better it was then (or 30 years later w/e). The mob kept the violence inside, ya know.",
            "This is really cool. I live here and never knew that Youngstown printed currency.",
            "I know…Crazy that they put Michael Jackson in it, isn’t it?",
            "It’s a shame it’s not in better condition. Cool nonetheless I have a couple 20s and 5s.",
            "crazy low serial number",
            "Hah, still printing",
            "If you live in Youngstown your family is either cops or robbers!",
            "I doubt that it was printed in Youngstown.   More likely it was printed by the us mint for distribution in Youngstown.",
            "That’s really cool! You could also post it on r/currency and see what they think of it",
            "They printed currency for 59 years. These aren't all that rare."
        ]
    },
    "Ohio redistricting amendment campaign will turn in 750,000-plus signatures on Monday, group says": {
        "title": "Ohio redistricting amendment campaign will turn in 750,000-plus signatures on Monday, group says",
        "score": 468,
        "url": "https://www.cleveland.com/news/2024/06/ohio-redistricting-amendment-campaign-will-turn-in-750000-plus-signatures-on-monday-group-says.html",
        "content": "",
        "num_comments": 41,
        "comments": [
            "Hell yeah!",
            "Corrupt politicians hate this one thing..",
            "LFG! Enough with the voter suppression and gerrymandering. Get this passed in November. If you need to register to vote: [olvr.ohiosos.gov](http://olvr.ohiosos.gov)",
            "One weird trick to make Jim Jordan go away.",
            "Strong work everyone!!! ❤️",
            "The republican house members are afraid of this amendment.  They will try to upend it like they did last year with issue 1.  They already tried in the special session for getting Joe Biden on the ballot.",
            "Proud of you Ohio! I moved and unfortunately won't be able to vote for this, but really hoping all this positive momentum can start to fix the state!",
            "Great news!!",
            "Fantastic news!",
            "I'm hoping."
        ]
    }
}