{
    "r/OhNoConsequences Lounge": {
        "title": "r/OhNoConsequences Lounge",
        "score": 69,
        "url": "https://www.reddit.com/r/OhNoConsequences/comments/slgxwj/rohnoconsequences_lounge/",
        "content": "A place for members of r/OhNoConsequences to chat with each other",
        "num_comments": 25,
        "comments": [
            "Why is Brett Kavanaugh the face of the sub?  Didn't he famously not have any consequences and get appointed and confirmed anyway?\n\nIs this \"Oh No!  Consequences!\" or is it \"Oh!  No consequences!\"",
            "can we please require putting the original link on a post im tired of having to search for it myself",
            "Ayo, this is the lounge and I'm bing chilling",
            "Loving the new picture ",
            "The profile pic is sublime. Still waiting for proportionate consequences",
            "Kinda random but can someone please tell me what the header picture is from (the one with the eyeballs doing some wonky shit??? I know I've seen it and it's right on the tip of my tongue but I just can't seem to remember and it's driving me insane",
            "He made a great face though",
            "Why is this whole thread just an AITA re-tread?",
            "That would be helpful if its copies and not cross posted for sure. Good suggestion!",
            "This sub just re-posts other subs and then half the time locks them or takes them down. I don't get it."
        ]
    },
    "READ BEFORE YOU POST: RULES & INFO TO BE AWARE OF": {
        "title": "READ BEFORE YOU POST: RULES & INFO TO BE AWARE OF",
        "score": 86,
        "url": "https://www.reddit.com/r/OhNoConsequences/comments/1cenq75/read_before_you_post_rules_info_to_be_aware_of/",
        "content": "Here are the rules for everyone and hopefully this will be easier to access for our mobile users who don't know how to locate them. We end up taking down a lot of posts and comments for not following rules. None of us likes having to do that so please take the time to read this. If any other mods want to unlock this post to add to it, please do because I'm sure I'll miss things! I'll include some other relevant information below the rules. So here we go:\n\n&#x200B;\n\n1. **Keep it Civil:** don't be rude to others who comment here. Name calling and insults directed at each other will be removed. We can respectfully disagree without the insults.\n2. **Check to See if Your Post Has Already Been Posted:** this one happens a lot. You can do a quick search and check. If something you're looking to post has had a significant amount of time pass between the last time it was posted, please use the \"Oldie but Goodie\" tag.\n3. **No Brigading:** For crossposts - do not comment on the original sub and here. That can endanger existence of this sub because of Reddit's brigading rules. Linking repeatedly to another sub in the comments also counts under Reddit’s policy. This a permanent ban if we catch you doing it and we will contact the mods on the other subreddit.\n4. **Do Not Clone/Crosspost from BORU Without Adding Updates Not Already Posted There:** our sub creator is also a mod on BORU and wanted this sub to be something different. If you have an update from a post on BORU that is not already there then feel free to crosspost but please include that update in the text of your post.\n5. **No Link Only Posts:** spare us from having to click links to articles. Copy and paste the text from the article on your post and include the link to it. Crossposts from other subs not just linking to an article may not apply here since the automod catches the text. For those of you unsure how to access the automod content, it's stickied right under the post. If you forget to copy/paste the text, please reach out and request to have it copy/pasted and stickied by a mod. (I personally do not mind doing this but other mods may not wish to do so and just ask you to repost it).\n6. **There Has to be Consequences Beyond Dropping Your Iphone:** we like a good tale of comeuppance here. The consequences must have already happened and are not just being predicted.\n7. **The Consequences Must be Obvious AND Include a Surprised Reaction:** this one is the rule that gets broken the most on posting. Not only must the consequences have been predictable but the person/people involved *MUST* be expressing some kind of surprise or distress at the consequences happening to them. Without both elements, your post will be taken down.\n8. **No ageism, racism, abelism, sexism, homophobia or transphobia:** this rule break can and will result in a permanent ban which is up to the mod. Use of slurs is an automatic permanent ban. This is not the sub to post or comment with hateful opinions about marginalized groups. Throwing more hate at mods in modmail will just get you muted. If you think a comment of yours was misunderstood, reach out through modmail to clarify and you may be able to edit it for reapproval with a mod's permission\n9. **No Porn Stories:** a lot of this ends up being spam but we don't need sexually explicit stories or photos here. No one wants to hear your sexually explicit comments about people involved in the posts or suggestions that someone become a sex worker. Sexual content, comments or suggestions about minors is an automatic permanent ban with no appeal. If your post has some sexual content that doesn't violate this rule but may not be safe to see at work, please use the NSFW function. A mod might mark your post NSFW if you forget to do this.\n10. **Do Not Advocate for, Support, Suggest or Threaten Bodily Harm, Self-Harm, Harassment, Violence or Death:** this one should be pretty self-explanatory but do not make comments supporting violence, harassment or self-harm directed anyone. If it's said sarcastically, please use \"/s\". We also don't want to hear about hypothetical violence you'd inflict on someone if you were involved in the content. Sensitive info that can lead to doxxing of a non-public figure will be removed, too.\n11. **No Deaths, Violence, Violent Threats, Animal Abuse or Child Abuse:** content with physical fights, death, injury due to physical violence, child abuse or animal abuse will be taken down. There are plenty of subs that welcome fight videos, please use them.\n12. **No Armchair Diagnosing:** it's impossible to diagnose based on the small snippets of people's lives we see in posts. If you are not an appropriate professional who can diagnose/assess for the condition or do not have lived experience with the diagnosis, please leave the armchair diagnosis out of your comments. Two of the mods are mental health professionals so don't even try it. If you do have appropriate experience to make the observation, include that in your comment. \n13. **No Deliberately Inflammatory Posts/Comments or Controversial Subjects:** this one also gets violated a lot and gets a ton of pushback. We know it may not be a popular rule but when we've allowed posts on political topics, politically adjacent topics or certain world events, it always devolves into fights, insults and inflammatory comments within a matter of hours where we end up having to remove a ton of comments, lock the post and ban people. Plenty of subs welcome discussion on these topics so use them. Deliberately inflammatory comments meant to start fights will also be removed.\n14. **Too Many Rule Violations Will Get You Banned:** if you aren't aware, Reddit gives us a list of comments and posts taken down for each user on this sub. If we've had to warn you or remove things too many times, it can result in a ban for a period of days or permanently. It's up to the mods. If you wish to appeal a ban, please do so civilly and we may be able to come to a compromise or remove the ban entirely. I promise, we're reasonable people. Appeals will be denied if the violation was particularly egregious. Our rules are simple so please follow them.\n15. **If You Believe Something Was Taken Down in Error, Are Unsure Why Something Was Removed or Have a Complaint, Contact Us Through ModMail:** we all make mistakes and sometimes content gets removed on accident. I know I've done it. Speaking civilly to us will get a civil response and an apology if the error was on us. We may be able to reapprove comments or posts if that happens. Complaints need to be made through ModMail and not on a post or in a comment. It will be removed if done that way. Insulting us will not go well for you. Reporting mod removals as spam or harassment also will not end well. None of us are trying to spam or harass you. If you got multiple comments removed, it was for a reason. We are happy have civil discussions about rules or concerns any of you may have. Suggestions for the sub are also welcome!\n\nThose are the rules as of now. Some additional things to know:\n\n1. **Minimum Karma:** if you don't see your comment you may not have the minimum karma needed. We have a bot removing those comments. If a mod has time, we may approve comments without the minimum karma that are meaningfully contributing to the topic.\n2. **Locked Post:** If you're unable to respond to someone or comment, it may be because we locked the post. If the comments are going downhill and quite a few people are breaking rules the post may be locked. \n3. **This Isn’t An Advice Sub:** please do not make posts about consequences you’re asking for advice about.\n4. **Fake Posts:** if you have evidence that a post is fake, please let a mod know so we can take it down. If you think a post is fake, please don’t be rude in the comments about it. There is no need for insults directed at the OP or anyone else for believing the story.\n\nThat's all I can think of for now. We may edit this post over time. Thank you all for contributing and making this sub what it is. We all appreciate you and your help reporting rule violations, too. Happy posting everyone!\n\nTLDR: don't break the rules and act shocked when you get consequences. Don’t become the content here!",
        "num_comments": 4,
        "comments": []
    },
    "Oh boy, here we go": {
        "title": "Oh boy, here we go",
        "score": 409,
        "url": "https://v.redd.it/er5gmvp2oc9d1",
        "content": "",
        "num_comments": 122,
        "comments": [
            "This was proven to be ragebait a while back.",
            "Oh hey! Its the yeast infection cinnamon rolls chick! Thats how I know its fake..",
            "Yeah, the sperm donor has zero legal obligation here. You should have thought of that before you got pregnant.\n\nIt seems to me that gay couples should have to sign some sort of parenting agreement before they have kids, since they don't get the automatic legal protections that straight parents do thanks to biology.",
            "Ummmm, dont they have contracts specifically crafted to avoid exactly this issue? Most sperm donors are anonymous and wouldnt even be listed on the birth certificate.",
            "is the spacing of the closed captioning on purpose?!?",
            "Fuck this bitch!!! Oh my god!!",
            "This has to be rage bait.",
            "I truly can't believe people think like this...",
            "She is a troll if you hadn't noticed",
            "If this were 2005, I'd immediately know that this woman has a concept of reality, and she is just clowning. But it's 2024, and every single person in our society is dumb as hell. I have no hope for the future."
        ]
    },
    "Missing your husband's singing for months because you can't say sorry... ": {
        "title": "Missing your husband's singing for months because you can't say sorry... ",
        "score": 3656,
        "url": "https://i.redd.it/6pfsm6jre49d1.png",
        "content": "",
        "num_comments": 261,
        "comments": [
            "That's so sad for him! Also why has it taken her this long to not just acknowledge she was in a bad mood and say sorry?? \n\nMy sisters used to complain and threaten me to stop singing as a child. To this day it's still hard for me to sing when I know people can hear me even though I love it. You can get really messed up when people you care about crap on your joy.",
            "Nope you broke him! That's what they mean by \"you don't know what you have until it's gone\" and now it's probably gone forever. You changed the way he felt about it and that'll never change back. You've done irreparable damage.",
            "Yeah. That tends to happen when you shit on someone's joy. They keep it away from you.",
            "That's how easy it is to destroy someone's confidence and sense of self worth.",
            "I knew a person who would do this constantly and then wonder why nobody around him was interesting or had a hobby. He would just offhandedly say, \"You should never be allowed to make a mix tape\", \"Don't bother getting into fashion if that's your outfit\", \"That's a boring ripoff of\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_(insert whatever media here, writing, painting, drawing etc.)\n\nSo glad to never be around them ever again.",
            "and you know the funny thing is that shell probably snap at him oneday for NOT singing lol",
            "Man, if anyone acknowledges me doing something like that, I also don't do it around them ever again. Trauma response from childhood, as generally if I was getting noticed I was getting yelled at.",
            "This reminds me of a Reddit post of this guy whose wife would vent to him about the bullshittery that be going on at her job. At first he was okay with her expressing her grievances but then it escalated to her talking shit about people in her circle all the time. Then one day OPs wife caught in a bitter mood and he finally snapped. He told her that he basically didnt give a fuck about what she got going on at her job or within her friend circle and to basically stfu. So for then on his wife would only say good morning and good night to him. He would ask about her day and she would just give one worded answers. Op found it odd but thought maybe the drama from his wifes job got fixed or something. That is until one night the wife was working late to which he found it suspicious.\n\nThen one day they were out and about and OP ran into the wifes boss. The wifes boss asked if OP was ok to which confused him at first. I guess the wifes boss figured out that OP didnt know what hes talking about so he said that the wife told everyone at the award ceremony that OP got sick and couldnt come. It turned out the wife got an award and a promotion and didnt tell OP about it. And the award ceremony/ dinner was on the night the wife was working late. So OP confronted his wife and she shrugged and said I didnt think you would care. And now OP is bitter af.",
            "Not really a healthy relationship when someone takes out their foul mood on their partner, and has to personally insult them.  Everyone is in the mood for a little quiet sometimes, but a simple polite request should do fine.",
            "This one resonates with me. I love to sing, but my ex always told me to stop. Until one day we did some molly together and she broke down and volunteered that I have a beautiful singing voice. I asked her why she was always criticizing me but she could only manage a feeble, I dont know!\n\nThere are reasons we split up."
        ]
    },
    "Person posts about neighbors getting mad they constantly smoke weed in a townhouse. ": {
        "title": "Person posts about neighbors getting mad they constantly smoke weed in a townhouse. ",
        "score": 45,
        "url": "https://www.reddit.com/r/TwoHotTakes/s/CiIyr8oeTJ",
        "content": "\n\nShe spent hours defendin herself and why she can't use any alternative options, even to the point of making alt accounts to try and make it seem like more people agreed with her.\n",
        "num_comments": 45,
        "comments": [
            "This post is now locked at OPs request has me weak ",
            "People really don't understand what dependency means. If OOP is currently \"a small young girl\" who's \"smoked heavily\" for more than 10 years, you're not smoking because you need it for mental health. You're smoking because you're dependent on the chemicals and get agitated and unmanageable without it. That's not hating on weed; the same goes for sugar, caffeine, alcohol, shopping, gambling, porn... Really anything that triggers brain changes and has become compulsive. If Vietnam vets has the option of getting a \"medical alcohol\" card to deal with their emotional trauma, they would have, and it still wouldn't have been good.",
            "And you know if the neighbors did something she considered an inconvenience it'd be a huge deal cause she shouldn't have to deal with that in her OwN hOmE",
            "Somthing about stoners and apartments, they refuse to smoke outside. Like wtf",
            "It's crazy the amount of people that think they can tell someone what to do in their own home. Op sounds dependent though.",
            "My neighbors probably hate me for the same reason",
            "I dated someone dependent on it. She'd smoked for over 10 years. If she ran out and couldn't afford more she'd basically break down like any other addict. I know it's not traditionally addictive but watching that was enough to convince me that it it mentally addictive.",
            ">too bad so sad\n\nActual words said by an adult",
            "That neighbor must think their townhouse is a personal cloud factory",
            "It's her house why is there an issue"
        ]
    }
}