{
    "r/OhNoConsequences Lounge": {
        "title": "r/OhNoConsequences Lounge",
        "score": 71,
        "url": "https://www.reddit.com/r/OhNoConsequences/comments/slgxwj/rohnoconsequences_lounge/",
        "content": "A place for members of r/OhNoConsequences to chat with each other",
        "num_comments": 25,
        "comments": [
            "Why is Brett Kavanaugh the face of the sub?  Didn't he famously not have any consequences and get appointed and confirmed anyway?\n\nIs this \"Oh No!  Consequences!\" or is it \"Oh!  No consequences!\"",
            "can we please require putting the original link on a post im tired of having to search for it myself",
            "Ayo, this is the lounge and I'm bing chilling",
            "The profile pic is sublime. Still waiting for proportionate consequences",
            "Hi Ethan!",
            "Kinda random but can someone please tell me what the header picture is from (the one with the eyeballs doing some wonky shit??? I know I've seen it and it's right on the tip of my tongue but I just can't seem to remember and it's driving me insane",
            "He made a great face though",
            "Why is this whole thread just an AITA re-tread?",
            "Loving the new picture 🤣 ",
            "That would be helpful if it’s copies and not cross posted for sure. Good suggestion!"
        ]
    },
    "READ BEFORE YOU POST: RULES & INFO TO BE AWARE OF": {
        "title": "READ BEFORE YOU POST: RULES & INFO TO BE AWARE OF",
        "score": 81,
        "url": "https://www.reddit.com/r/OhNoConsequences/comments/1cenq75/read_before_you_post_rules_info_to_be_aware_of/",
        "content": "Here are the rules for everyone and hopefully this will be easier to access for our mobile users who don't know how to locate them. We end up taking down a lot of posts and comments for not following rules. None of us likes having to do that so please take the time to read this. If any other mods want to unlock this post to add to it, please do because I'm sure I'll miss things! I'll include some other relevant information below the rules. So here we go:\n\n&#x200B;\n\n1. **Keep it Civil:** don't be rude to others who comment here. Name calling and insults directed at each other will be removed. We can respectfully disagree without the insults.\n2. **Check to See if Your Post Has Already Been Posted:** this one happens a lot. You can do a quick search and check. If something you're looking to post has had a significant amount of time pass between the last time it was posted, please use the \"Oldie but Goodie\" tag.\n3. **No Brigading:** For crossposts - do not comment on the original sub and here. That can endanger existence of this sub because of Reddit's brigading rules. Linking repeatedly to another sub in the comments also counts under Reddit’s policy. This a permanent ban if we catch you doing it and we will contact the mods on the other subreddit.\n4. **Do Not Clone/Crosspost from BORU Without Adding Updates Not Already Posted There:** our sub creator is also a mod on BORU and wanted this sub to be something different. If you have an update from a post on BORU that is not already there then feel free to crosspost but please include that update in the text of your post.\n5. **No Link Only Posts:** spare us from having to click links to articles. Copy and paste the text from the article on your post and include the link to it. Crossposts from other subs not just linking to an article may not apply here since the automod catches the text. For those of you unsure how to access the automod content, it's stickied right under the post. If you forget to copy/paste the text, please reach out and request to have it copy/pasted and stickied by a mod. (I personally do not mind doing this but other mods may not wish to do so and just ask you to repost it).\n6. **There Has to be Consequences Beyond Dropping Your Iphone:** we like a good tale of comeuppance here. The consequences must have already happened and are not just being predicted.\n7. **The Consequences Must be Obvious AND Include a Surprised Reaction:** this one is the rule that gets broken the most on posting. Not only must the consequences have been predictable but the person/people involved *MUST* be expressing some kind of surprise or distress at the consequences happening to them. Without both elements, your post will be taken down.\n8. **No ageism, racism, abelism, sexism, homophobia or transphobia:** this rule break can and will result in a permanent ban which is up to the mod. Use of slurs is an automatic permanent ban. This is not the sub to post or comment with hateful opinions about marginalized groups. Throwing more hate at mods in modmail will just get you muted. If you think a comment of yours was misunderstood, reach out through modmail to clarify and you may be able to edit it for reapproval with a mod's permission\n9. **No Porn Stories:** a lot of this ends up being spam but we don't need sexually explicit stories or photos here. No one wants to hear your sexually explicit comments about people involved in the posts or suggestions that someone become a sex worker. Sexual content, comments or suggestions about minors is an automatic permanent ban with no appeal. If your post has some sexual content that doesn't violate this rule but may not be safe to see at work, please use the NSFW function. A mod might mark your post NSFW if you forget to do this.\n10. **Do Not Advocate for, Support, Suggest or Threaten Bodily Harm, Self-Harm, Harassment, Violence or Death:** this one should be pretty self-explanatory but do not make comments supporting violence, harassment or self-harm directed anyone. If it's said sarcastically, please use \"/s\". We also don't want to hear about hypothetical violence you'd inflict on someone if you were involved in the content. Sensitive info that can lead to doxxing of a non-public figure will be removed, too.\n11. **No Deaths, Violence, Violent Threats, Animal Abuse or Child Abuse:** content with physical fights, death, injury due to physical violence, child abuse or animal abuse will be taken down. There are plenty of subs that welcome fight videos, please use them.\n12. **No Armchair Diagnosing:** it's impossible to diagnose based on the small snippets of people's lives we see in posts. If you are not an appropriate professional who can diagnose/assess for the condition or do not have lived experience with the diagnosis, please leave the armchair diagnosis out of your comments. Two of the mods are mental health professionals so don't even try it. If you do have appropriate experience to make the observation, include that in your comment. \n13. **No Deliberately Inflammatory Posts/Comments or Controversial Subjects:** this one also gets violated a lot and gets a ton of pushback. We know it may not be a popular rule but when we've allowed posts on political topics, politically adjacent topics or certain world events, it always devolves into fights, insults and inflammatory comments within a matter of hours where we end up having to remove a ton of comments, lock the post and ban people. Plenty of subs welcome discussion on these topics so use them. Deliberately inflammatory comments meant to start fights will also be removed.\n14. **Too Many Rule Violations Will Get You Banned:** if you aren't aware, Reddit gives us a list of comments and posts taken down for each user on this sub. If we've had to warn you or remove things too many times, it can result in a ban for a period of days or permanently. It's up to the mods. If you wish to appeal a ban, please do so civilly and we may be able to come to a compromise or remove the ban entirely. I promise, we're reasonable people. Appeals will be denied if the violation was particularly egregious. Our rules are simple so please follow them.\n15. **If You Believe Something Was Taken Down in Error, Are Unsure Why Something Was Removed or Have a Complaint, Contact Us Through ModMail:** we all make mistakes and sometimes content gets removed on accident. I know I've done it. Speaking civilly to us will get a civil response and an apology if the error was on us. We may be able to reapprove comments or posts if that happens. Complaints need to be made through ModMail and not on a post or in a comment. It will be removed if done that way. Insulting us will not go well for you. Reporting mod removals as spam or harassment also will not end well. None of us are trying to spam or harass you. If you got multiple comments removed, it was for a reason. We are happy have civil discussions about rules or concerns any of you may have. Suggestions for the sub are also welcome!\n\nThose are the rules as of now. Some additional things to know:\n\n1. **Minimum Karma:** if you don't see your comment you may not have the minimum karma needed. We have a bot removing those comments. If a mod has time, we may approve comments without the minimum karma that are meaningfully contributing to the topic.\n2. **Locked Post:** If you're unable to respond to someone or comment, it may be because we locked the post. If the comments are going downhill and quite a few people are breaking rules the post may be locked. \n3. **This Isn’t An Advice Sub:** please do not make posts about consequences you’re asking for advice about.\n4. **Fake Posts:** if you have evidence that a post is fake, please let a mod know so we can take it down. If you think a post is fake, please don’t be rude in the comments about it. There is no need for insults directed at the OP or anyone else for believing the story.\n\nThat's all I can think of for now. We may edit this post over time. Thank you all for contributing and making this sub what it is. We all appreciate you and your help reporting rule violations, too. Happy posting everyone!\n\nTLDR: don't break the rules and act shocked when you get consequences. Don’t become the content here!",
        "num_comments": 4,
        "comments": []
    },
    "(Not OOP) You stole my dinner and now you want some of my birthday cake?": {
        "title": "(Not OOP) You stole my dinner and now you want some of my birthday cake?",
        "score": 1384,
        "url": "https://www.reddit.com/r/OhNoConsequences/comments/1dkqwxs/not_oop_you_stole_my_dinner_and_now_you_want_some/",
        "content": "Originally posted by [Unhappy-Marzipan7911](https://www.reddit.com/user/Unhappy-Marzipan7911/) in r/AITAH \n\n# [AITA for not letting a pregnant woman have any of my birthday cake?](https://www.reddit.com/r/AITAH/comments/1dkgeho/aita_for_not_letting_a_pregnant_woman_have_any_of/)\n\nMy birthday was yesterday and my husband invited his best friend Matt and his best friends pregnant girlfriend Jane out for a BBQ. They live 2 houses down from us. It was only us, our 3 children and them here (and their 3 kids). I spent about $90 on hamburger and hotdogs. Matt also showed up with 2lbs of hamburger. While the guys cooked, I went swimming with all the kids in our pond. Jane sat near the guys on her phone.\n\nAround 5:30ish the guys called the kids up for food. Me and my middle child (9) weren't hungry yet so we kept swimming. We spent a good 40+ extra minutes in the pond on our tubes. I wasn't paying any attention to anything that was going on near the grill. Around 6:15ish is when my husband said that he was going to make a store run for beer, so I tell my son that we should probably go eat now. My husband and Matt are gone by the time we get up to the grill, so is Jane. Well, we get up to the grill and all the food is gone. Literally everything. I call my husband and ask him where all the food is and he said that it should be on the grill. I tell him that everything is gone. There was a long pause before he goes \"Jane asked if she could take some for leftovers but I didn't think she would take all of it\". He then tells me there was at least 8 burgers and 10 hotdogs left, as well as macaroni salad when he left for the store 10 minutes prior. I tell him to call Matt and see where tf all the food is. He does. He then calls me back and says that Matt claims Jane only took \"a few\" and that they had already been eaten. But my oldest son (13) straight up tells me he saw Jane walk off our property carrying the entire dish (one of those extra large tin foil BBQ dishes).\n\nAnyways, I'm pissed at this point. Me and my son hadn't eaten anything. My husband is also pissed but he just grabbed me and my son something from the store instead of making a huge fuss. I don't really blame him (him and Matt work together so it is what it is). But anyways, much to my surprise, Jane and her kids come back over 45 minutes later and ask if they can have some of my cake. I tell Jane that her kids can but she can't. She asks why and I said \"I'm pretty sure you've eaten plenty considering you took off with my entire BBQ dinner before me and my son could eat anything\". She tried arguing that my husband told her she could have it, that \"half of it was hers\" (cause they brought 2lbs of hamburger meat) and that she \"didn't realize\" me and my kid hadn't eaten (she was beside the grill the entire time). I just shrugged my shoulders and walk away. She tells her kids to \"let's go\" and they leave without cake. Now I'm feeling like I may be the asshole. No one has said anything but I know there's tension.\n\n# Still not the OOP. Share your thoughts here, don't go brigading on the original post!",
        "num_comments": 167,
        "comments": [
            "\nIn case this story gets deleted/removed:\n\nOriginally posted by [Unhappy-Marzipan7911](https://www.reddit.com/user/Unhappy-Marzipan7911/) in r/AITAH \n\n# [AITA for not letting a pregnant woman have any of my birthday cake?](https://www.reddit.com/r/AITAH/comments/1dkgeho/aita_for_not_letting_a_pregnant_woman_have_any_of/)\n\nMy birthday was yesterday and my husband invited his best friend Matt and his best friends pregnant girlfriend Jane out for a BBQ. They live 2 houses down from us. It was only us, our 3 children and them here (and their 3 kids). I spent about $90 on hamburger and hotdogs. Matt also showed up with 2lbs of hamburger. While the guys cooked, I went swimming with all the kids in our pond. Jane sat near the guys on her phone.\n\nAround 5:30ish the guys called the kids up for food. Me and my middle child (9) weren't hungry yet so we kept swimming. We spent a good 40+ extra minutes in the pond on our tubes. I wasn't paying any attention to anything that was going on near the grill. Around 6:15ish is when my husband said that he was going to make a store run for beer, so I tell my son that we should probably go eat now. My husband and Matt are gone by the time we get up to the grill, so is Jane. Well, we get up to the grill and all the food is gone. Literally everything. I call my husband and ask him where all the food is and he said that it should be on the grill. I tell him that everything is gone. There was a long pause before he goes \"Jane asked if she could take some for leftovers but I didn't think she would take all of it\". He then tells me there was at least 8 burgers and 10 hotdogs left, as well as macaroni salad when he left for the store 10 minutes prior. I tell him to call Matt and see where tf all the food is. He does. He then calls me back and says that Matt claims Jane only took \"a few\" and that they had already been eaten. But my oldest son (13) straight up tells me he saw Jane walk off our property carrying the entire dish (one of those extra large tin foil BBQ dishes).\n\nAnyways, I'm pissed at this point. Me and my son hadn't eaten anything. My husband is also pissed but he just grabbed me and my son something from the store instead of making a huge fuss. I don't really blame him (him and Matt work together so it is what it is). But anyways, much to my surprise, Jane and her kids come back over 45 minutes later and ask if they can have some of my cake. I tell Jane that her kids can but she can't. She asks why and I said \"I'm pretty sure you've eaten plenty considering you took off with my entire BBQ dinner before me and my son could eat anything\". She tried arguing that my husband told her she could have it, that \"half of it was hers\" (cause they brought 2lbs of hamburger meat) and that she \"didn't realize\" me and my kid hadn't eaten (she was beside the grill the entire time). I just shrugged my shoulders and walk away. She tells her kids to \"let's go\" and they leave without cake. Now I'm feeling like I may be the asshole. No one has said anything but I know there's tension.\n\n# Still not the OOP. Share your thoughts here, don't go brigading on the original post!\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OhNoConsequences) if you have any questions or concerns.*",
            "I mean... The \"consequences\" for taking two meals worth of leftovers were that she didn't get dessert. Feels pretty light to me.",
            "The fact that she came back for the cake astounds me. ",
            "NTA. Jane owes you an apology.",
            "Don’t people know that there are no leftovers until everyone has eaten? How can it be “leftover” when it is actually someone’s meal.",
            "You show up with something.. you don't get to take it back. That's rude.",
            "She got off light considering she left you with nothing...and did not even offer to bring anything back after SHE KNEW she took more than she brought. None of those heathens would darken my doorstep ever again...",
            "Husband and Matt are in for an awkward Monday morning!",
            "I've been in a somewhat similar situation and it's infuriating. I mean, who just takes the hosts' leftover food, especially if some of them have not eaten yet? Super rude. When she \"realized\" you hadn't eaten yet (of course she knew, she just pretended to be stupid) the normal reaction would have been embarrassment and \"I didn't realise! I'll bring the stuff from my house straight away!\"\n\nBitch just doesn't want to cook tomorrow.\n\nNever invite her again.",
            "Jane is a selfish, greedy cunt. She saw an opportunity, and took all the food because fuck OOP.\n\nJane wouldn’t be welcome back to my house ever again. Her boyfriend and the kids? Sure. But that bitch? Fuck her."
        ]
    },
    "(NOT OOP) AITAH for breaking up with my girlfriend when she tested me? ": {
        "title": "(NOT OOP) AITAH for breaking up with my girlfriend when she tested me? ",
        "score": 480,
        "url": "/r/AITAH/comments/1djuriw/aitah_for_breaking_up_with_my_girlfriend_when_she/",
        "content": "",
        "num_comments": 99,
        "comments": [
            "\nIn case this story gets deleted/removed:\n\nWhen I was 16 years old my girlfriend broke up with me. I was pathetic and begged her to change her mind. I thought I was in love and couldn't be without her. I was an idiot. \n\nI'm 25 now and I have promised myself I will never do that again. I have had several relationships and a few hook ups. And when they end I am sad but not weak. \n\nI had been with my girlfriend for a year and a half. We met at a social function for people in our line of work. We hit it off and started seeing each other more often then made it exclusive. \n\nRecently we have been talking about moving in together. Our city is expensive and we thought we could save some money. Her apartment is bigger than mine but I own mine so we were working stuff out. \n\nLast weekend out of nowhere she says that we are moving too fast. Okay no problem we didn't make any plans that can't be undone yet. \n\nNope she said that she wanted to break up because she wasn't sure I was all in. I said okay. Then she freaked out. Apparently it was a test to see if I would fight for her. \n\nYeah I don't do that any more and I do not appreciate mind games. So I told her that I would box up anything of hers that might be at my place and she could pick it up. \n\nShe accused me of being a cold-hearted asshole that was only using her for sex. I wasn't. I thought we had a future. I wasn't ready to propose or anything but I thought she was the one. We had met each other's families and she had spent last Christmas with us. My parents and sister love her. I loved her. \n\nMy mom and dad called me to ask what was going in and I told them. They think I am being stubborn. My little sister says I'm being a complete jerk for not forgiving my ex. \n\nI just remember crying myself to sleep over a girl and refuse to do it again.\n\nAITAH? \n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OhNoConsequences) if you have any questions or concerns.*",
            "The asshole who conducts a shit test like this always fails.",
            "Op should tell her it was a test and she failed since she refused to accept the breakup with dignity.",
            "People need to stop taking TikTok trends (such as ‘testing’ in this way) as actual real life advice. \n\nThere’s a reason Ultron spent 5 minutes on the internet before deciding humanity was a lost cause.",
            "This shit is annoying as fuck, You're not testing shit you're throwing your weight around to see if you've got power or not.",
            "This reminds me of that one story where a guy blocked his ex after she broke up and then everyone sort of freaked out on him for it because it was a “test”. And then it turned out that his sister may have worked together with his ex to come up the weird “test” so she was extra mad that it didn’t work how they wanted.\n\nPersonally I think breaking up after a “test” is fair game because it implies that your SO doesn’t fully trust you. I don’t think immediately blocking your SO is the best way to go about it, but I’m not about to tell someone how to handle a break up.",
            "if you’re stupid enough to “test” your partner, you deserve the consequences.\n\nOOP is NTA",
            "I really can't fathom intentionally hurting someone you love like this. It's like...slapping someone out of nowhere, completely shattering their trust, but expecting them to just forgive and forget. \n\nMaybe this will be HER learning moment.",
            "Remember. You can break up with anyone for any reason. Even if its a bad reason. \nNo one is entired to a relationship with you.",
            "The problem with these things is always that gf will not really learn anything from this. \n\nWhereas she might not try to attempt it again out of fear. But she will keep blaming OOP. Because in jer mind it will be his fault. And there won't be a self reflection out of self preservation. \n\nIf this comes up OOP really needs to stress that this went wrong because of what SHE did, not because of HIS reaction. But other than that this is lost here."
        ]
    },
    "She looks so shocked ": {
        "title": "She looks so shocked ",
        "score": 4611,
        "url": "https://v.redd.it/e24vjx813k7d1",
        "content": "",
        "num_comments": 483,
        "comments": [
            "\nIn case this story gets deleted/removed:\n\nCrazy lady lashes out to NYPD officers when told to produce and ID after smoking on subway platform and jumping turnstiles to access the train \n#NYPD #NYC #karen #attitude #MTA  #train \n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OhNoConsequences) if you have any questions or concerns.*",
            "\"STEP THE FUCK BACK YOU BITCH A -\"\n\n\"why are you arresting meee?\"",
            "Well that deflated her imagined size rather quick",
            "Love the childish stomping, haha",
            "I love the look on the face of the guy walking through the shot.",
            "FYI, that Goyard bag she’s carrying costs around $4000.00.",
            "Is this the part in Shameless where Fiona's spiraling?",
            "Ladies and gents, you just witnessed how this petulant child has gotten her way for years and the sudden agonizing realization that she, in fact, just fucked up.",
            "First time I’ve seen a grown person go full stampy. ",
            "So much closure. My heart is full."
        ]
    }
}