{
    "Rule 3 update": {
        "title": "Rule 3 update",
        "score": 91,
        "url": "https://www.reddit.com/r/okbuddytrailblazer/comments/1cl212b/rule_3_update/",
        "content": "We're all sick of it at this point and I've taken far too long to deal with this, so here it is. Rule 3 now bans ALL low effort fanart reposting including, but not limited to, both softcore porn and the firefly posts. I know i should've dealt with this sooner but I've been busy and wasn't even aware it was a problem till very recently. I will try to enforce it properly but I may have difficulties with that on my own since I can't always be online, so if any of you would be interested in becoming mod to help us out and improve the subreddit, feel free to contact me in modmail or DMs about it.",
        "num_comments": 87,
        "comments": [
            "Also, since people seem to *still* be complaining about the whole huohuo, cunny whatever thing, I'll add about that here too: You are absolutely allowed to post whatever unhinged stuff you want about huohuo and any other questionably child characters. The rule after the updates was basically to cover gaps in the old rule 3, so we didn't end up with people just posting art of huohuo or clara getting railed and calling it a joke. But whatever actual unhinged shitposts you have about your love for cunny? Go right ahead, as long as it's not something against this updated rule 3 (also still no nsfw or suggestive images of any kind of bailu or hook because those ones *will* get us banned).",
            "> sub complains of lack of buddy content and flooding of fan art with no punchline\n\n> mod removes low effort fan art with no punchline \n\n> sub complains\n\nMfw",
            "People's reaction when they can't just freely farm karma with low effort reposts:\n\nhttps://preview.redd.it/8yew8b8v8ryc1.png?width=1012&format=pjpg&auto=webp&s=8670fc50599880654426d26708685ba224e49b13\n\nI mean seriously, how do some see this as a bad thing. It's a fucking buddy sub, not RepostStarRail.",
            ">Sub posts about how there's only shit low quality art reposts and some buddy sentence in it so it's allowed\n\n>Low quality art posts like this are banned\n\n>W-WTF!!!! 1984 1984 POWER TRIPPING MODS FUCK YOU REEEEEEEEEEEE",
            "I thought this change would be a little less controversial... Are people really complaining that the sub will be less low effort fan art reposts?",
            " Good change, well overdue.",
            "?why yall complaining isnt this what you wanted LMAO\n\nor it's just that half of the people mad about no more firefly low effort porn?",
            "This is the worst buddysub ever, mods why you love power tripping so hard, the other HSR buddy sub is way better, I can get blowjobs from Clara for 5 dollars there. Here? I can't even get a blowjob from some old hag anymore",
            "Me and the mods (I'm Firefly):\n\nhttps://i.redd.it/fdw0z2nrkoyc1.gif",
            "https://preview.redd.it/yspu1as2noyc1.jpeg?width=646&format=pjpg&auto=webp&s=6c912cc2599ba7f0d5f91f76f10cceb10534f2c1"
        ]
    },
    "Oh no, the mod is back! (IMPORTANT)": {
        "title": "Oh no, the mod is back! (IMPORTANT)",
        "score": 1099,
        "url": "https://i.redd.it/lu896pee869d1.jpeg",
        "content": "It's me, your favorite buddy :) /s\n\n\nI have been too occupied these last few days ~~playing 👴💍~~, but I'm finally back to oppress the minorities and BANISH THE UNFUNNY!\n\n\nModerating sometimes may be way more stressful than it looks like, so to make my job easier, I will be making a little list to help myself. This way things will be less subjective and more fair and I won't have to have that thought in my mind all the time: \"Shouldn't I have left that post there?\". My only intent is to keep the sub clean and not full of random unfunny posts.\n\n\n\n1- Remember the ~~cunny~~ funny;\n\n\nThis is a shitposting sub, so keep in mind that your post must, well... Surprise, surprise! Contain humor. \n\n\nAlso, to help keeping a good coexistence with your fellow buddies, take everything someone says as a joke/sarcasm/irony unless stated otherwise (Little fact ☝️🤓: this is what things are in IRL justice: you are innocent unless proven otherwise (at least it was supposed to be like this, but you must know by now how things really work in the ~~Twitter~~ internet. See? You are even learning new things. Who said r/okbuddytrailblazer isn't a place for knowledge (I'm sure Dr. Ratio would be proud)?\n\n\n2- What would be considered an appropriate post?\n\n\nWell, humor is subjective and this is what make things harder for me.\n\n\nThe post are going to be considered by its intent. I don't want to have to ponder everytime I see some random shit if it is appropriate for a shitposting sub or not. So, as I studied ☝️🤓 other similar subs, I came with some points:\n\n\n\n2.1- The post must have humor as its purpose;\n\n\nI don't think I need to explain this, it's a shitposting sub after all.\n\n\n\n2.2- Fanfics and OC are allowed;\n\n\nI have always thought that buddies' talents must be encouraged and I still agree, so these are exceptions (This is not a sub for self-promotion tho, so please, don't abuse). Don't forget to tag OC as OC.\n\n\n\n2.3- Tag Copypastas as such;\n\n\nI created a tag just for them. This way people will know it is a copypasta and not just a random image.\n\n\n\n2.4- Fanarts/Porn are allowed as long they are part of the meme;\n\n\nNo, just the title won't classify them as such, or the old \"Is (s)he stupid?\" would make its comeback.\n\n*Vietnam war flashbacks* AAAAAAAAAAA\n\n\nIf you want to post some fanart/softporn, at least make a shitty edit and we can pretend it's a meme.\n\n\n\n2.4.1- The joke is porn!\n\n\nThe punchline may be porn, but the post shouldn't be only porn and that's it (Go to a hentai sub, you bratty buddy 😠😠💢💢)\n\n\n2.4.2- If the post is not composed by a fanart or porn, the title is enough to classify it as a meme (if it is part of the humor, I mean).\n\n\n\n2.5- Outbuddied?\n\n\nNo, guys, we didn't get outbuddied just because someone in the main sub posted softporn. Wake me up when someone there post some cunny or balde racism. \n\n\n\n3- Cunny is now banned;\n\n\nJk lol (I wanna breed Yunli so fucking hard and make her the mother of my 10 children so fucking much it's unreal frfr 😭😭 I'm gonna go insane. Damn Yunli 😠😠💢💢 seducing me. I'm gonna...)\n\n\n\n4- Off-Topic;\n\n\nPosts from other Hoyo games are allowed, but Star Rail is still the focus (Wuthering Waves is ok too).\n\n\n\n5- No drama!\n\n\nSome other \"buddy\" subreddit said we are a bad sub? So what? Just ignore and let they self-affirmate themselves by saying to each other how they are superior. Don't bring it here. We are degenerates, but peaceful degenerates who just want to impregnate fictional characters 😇 \n\n\nSomeone on Twitter said some shit and created some drama? Bruh, nothing new. Let the Twitter brainrot on Twitter.\n\n\nThat's it. These are the points I'm gonna use when moderating and I wanted to be sure everybody would be aware of them. This way people will know why their post got removed and I won't have to be worried about being unfair (I feel bad and worry about being unfair, ok? I'm not a monster or a fat guy living in their mother's basement (I''m skinny and I live in my comfy bedroom)).\n\n\nI am, of course, open to ideas and suggestions, specially about tierlists and other spammy things.\n\n\nWhat about those posts that needs the comments to be funny (\"What [character] is [word]? Wrong answers only\" and similar) and not the post itself? And those humorous \"comics\"? Should they be allowed even being some kind of \"repost\" just because they are kinda funny?\n\n\nANSWER THIS IN THE COMMENTS, I NEED SUGGESTIONS ABOUT THEM. Future updates are going to be in the fixed comment (I can't edit the post after sending).\n\n\nAnd as a wise man using a BDSM helmet once told me:\n\n\n\"Marika's tits, you must be 'ungry\".\n\n\n(If you know who says this, I love you ♥️)",
        "num_comments": 79,
        "comments": [
            "Moderator can I post Joel and not be banned 🙏\n\ni promise i wont spam i just really like Joel and like putting him on my comments for no reason\n\nhttps://i.redd.it/vcsbmsqof69d1.gif\n\nJoel :)",
            "https://preview.redd.it/l5ipcx11969d1.jpeg?width=2030&format=pjpg&auto=webp&s=3094a62d6987b03a06a079f6d6ec477a25ec8b69",
            "https://preview.redd.it/m78ldhbmb69d1.jpeg?width=319&format=pjpg&auto=webp&s=56cd503347c88366a3e1e4b52c03b2af8b908e43\n\nTime to get 1984'd for the first time with the head of the crazy legion of trailbrazer",
            "Watch as I fill the sub with groomer Jingliu Yanqing fanfics now.",
            "Yeah I find it funny whenever someone says \"Outbuddied\". No bro just because someone post on mainsub/YouTube/twitter some suggestive arts or horny jokes doesn't mean we get outbuddied. It's literally internet daily stuff. If somebody said they wanna drink diarrhea directly from a character bum on the main sub then yeah I admit we got outbuddied.",
            "cunny is banned >:(\n\njk lol :D",
            "based rules...\n\n\n\nSo did Fu Xuan peg you?",
            "https://preview.redd.it/99tiql3a779d1.jpeg?width=828&format=pjpg&auto=webp&s=84a47c0ab5ed4075a41faf0d2fb40ea9701dafaa\n\nAll that moderating must make you hungry for beans",
            "OUTBUDDIED IS DEAD \n\nhttps://preview.redd.it/754vvppfm69d1.jpeg?width=434&format=pjpg&auto=webp&s=d5d6c93f8d2119ee3fe841b6541543d647c4cd4a",
            "When the twitter 🤣🤣 \n\n/ut glad some degree of moderation is coming, subs like these tend to be overtaken by actual idiots if nothing is done"
        ]
    },
    "Title ": {
        "title": "Title ",
        "score": 161,
        "url": "https://v.redd.it/ay8ae6wd8g9d1",
        "content": "",
        "num_comments": 8,
        "comments": [
            "disengage safety protocol 🤣🤣🤣😭🤣",
            "Do you know what would be even better? Futa Xuan and Qingque team tagging you 🤤🥵\n\nI can even imagine the title already: \"Fu Xuan and Qingque punish you after you made a mess on the Divination Commission\"\n\nhttps://preview.redd.it/fnctssubbg9d1.jpeg?width=1179&format=pjpg&auto=webp&s=ceeb950819b2d357573b57f1bd8f767e1ee9facd",
            "Ah yes Arlechino, My favorite Nihility Lightning character",
            "Arlecchino",
            "Where is this from?????",
            "Quantum Qock is too qunny..give me the bigger guns",
            "Wait a min ..my ass edited out the original text which was arlechino and yelan and wrote arlechino and BS.. 💀",
            "What do you mean? Have you ever saw the monster Futa Xuan carries? 😨"
        ]
    },
    "Literally the first thing that popped into my head when I saw this thing": {
        "title": "Literally the first thing that popped into my head when I saw this thing",
        "score": 88,
        "url": "https://i.redd.it/mzcaqitu5g9d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "https://preview.redd.it/2dx6r5vm9g9d1.jpeg?width=320&format=pjpg&auto=webp&s=836f8a627acf039e98ee5c8ff47e31ca1061181b",
            "is that an actual model??",
            "Take your meds",
            "Yes, she can be found in the gallery in new virtual universe",
            "Correction, in the exhibit of exhibits",
            "correction? im gonna correct that bratty herta doll😭😭😭😭😭😭😭💢💢💢💢💢💢💢💢💢💢💢"
        ]
    },
    "OMG guys a car manufacturer did a reference": {
        "title": "OMG guys a car manufacturer did a reference",
        "score": 88,
        "url": "https://i.redd.it/pttgp4mxzf9d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "https://preview.redd.it/qmf6pmdi4g9d1.jpeg?width=1284&format=pjpg&auto=webp&s=f60267d3fd35f6dee801f0802875c01f6f2d0aa6",
            "https://preview.redd.it/gepuufapkg9d1.jpeg?width=1242&format=pjpg&auto=webp&s=ea37f1ae1bdac87e68cfab343aa63cbf3001b66d"
        ]
    }
}