{
    "The OFFICIAL r/OKBV Mod Team Political Compass Results": {
        "title": "The OFFICIAL r/OKBV Mod Team Political Compass Results",
        "score": 292,
        "url": "https://www.reddit.com/gallery/1dl8rra",
        "content": "PolComp locations for r/okbuddyvowsh mods *who chose to take* the SapplyValues quiz, as well as the average coordinate of those mods. *The mods who chose to participate represent most of the active mod team.*\n\n**RESULTS**\n\nClosest to Center: u/TechniqueMachine\n\nFurthest Right: u/TechniqueMachine\n\nFurthest Left: u/Juzhor and u/Middle_Help_3867 (tie)\n\nMost Authoritarian: u/Middle_Help_3867\n\nMost Libertarian: u/The_Straing_Doctor\n\nMost \"Average\": u/Will_from_PA\n\n**AWARDS**\n\nu/The_Straing_Doctor has been awarded the *Certified Anarchist* Award\n\nu/Middle_Help_3867 has been awarded the *Certified Tankie* and *Certified Leftist* Awards\n\nu/Juhzor has been awarded the *Certified Leftist* Award\n\nu/TechniqueMachine has been awarded the *Certified Scandanavian Social Democrat* Award.\n\nu/Will_from_PA has been awarded the *Basic Bitch* Award.\n\nu/Juhzor, u/Time_on_my_hands, u/Will_from_PA, and u/the-loose-juice have been awarded the *Party Majority* Award for sharing coordinates in such close proximity to each other.",
        "num_comments": 159,
        "comments": [
            "Take the test here https://sapplyvalues.github.io/ and compare your results!",
            "Far too high on the authority axis for a few of you but what can you expect from mods",
            "TechniqueMachine will be executed for being the most right leaning moderator, sad, :(",
            "this is a little outdated in my case. \n\nThis is my actual political position now that I have the power to ban you motherfuckers:\n\nhttps://preview.redd.it/uy4yon1tez7d1.png?width=546&format=png&auto=webp&s=84955d07fad0743c8e668a89f64fa6d13b2b2e38",
            "https://preview.redd.it/ombyuqwbxy7d1.png?width=1850&format=png&auto=webp&s=ab73d4869056ec5bfd1a6c8ee825b4f33660a6ab\n\nI am become mod, banner of liberals",
            "Average, like all my test results",
            "Damn I'm basically an average mod\n\nhttps://preview.redd.it/rps1u80tsy7d1.png?width=1850&format=png&auto=webp&s=cae1becfe3c1dac57188ac947ed142b48d7eae06",
            "Didn’t realize the mod team was literally hitler",
            "I knew the mods were a bunch of fake leftist neolib succdem social fascists whose politics can be graphed on the political cum-piss test",
            "What are some of these questions and why are they so vague? \n\nLike the one asking if you think all drugs are bad. What drugs? Pharmaceutical? Controlled substances? There’s no room for a specific nuanced belief. It’s just “Yes, no, or idk”\n\nThen there was another one with Mandatory IDs. In what context? Like the concept of Mandatory  IDs in terms of immigration or in general?"
        ]
    },
    "Message from the Council of Bastards: Community Input Required": {
        "title": "Message from the Council of Bastards: Community Input Required",
        "score": 80,
        "url": "https://www.reddit.com/r/okbuddyvowsh/comments/1dqyzwe/message_from_the_council_of_bastards_community/",
        "content": "With today's stream and in light of other revelations, such as OKBuddy time driving Voosh into alcoholism by being painfully unfunny, it is clear that the sewer of the main sub has overflowed into our once beautiful boulevards. Due to these circumstances the council has discussed making some changes to the subreddit. A street cleaning so to speak. These **possible** changes include a more active pruning of the community for liberals and other such undesirables as well as a stronger curation of the types of memes allowed. Additionally we may retire long dead running gags to avoid a Joe Biden situation. We may ultimately decide that no action is required. We wish to stress that **nothing** has been decided yet, as we wanted to include the community in the decision making process. Please feel free to add your 2 cents on whether you believe the above would help or to offer up your own suggestions on how to improve the quality of the subreddit. Together we will make OKBV great again.\n\nhttps://preview.redd.it/ama125egqe9d1.png?width=1920&format=png&auto=webp&s=7e2eb80c7d6bec1f847aafd2569ad91252c4efe0",
        "num_comments": 50,
        "comments": [
            "\"undesirables\"\n\nYou can just say \"Europeans\" bro",
            "ban everyone",
            "Just require that memes use a specific flair and miscellaneous text or screenshot posts use a different flair. So that way, Vaush can easily filter out the actual memes from the discussion posts.",
            "Do a purge. Curate the meme selection for the next OKBV extensively, for quality instead of just upvotes. Kill all actual fans of the evil Voosh. This will bring us back into the light.",
            "Ban anyone who mentions v**sh",
            "I would be very pleased to see some more moderation on shit libs and stale jokes, yes please. I am ready for the revolution.",
            "After the taxes debacle, there were a lot of posts that vosk wouldn't want to review. nuke them all.",
            "Vaush said the community is done with the Karkiv type jokes post taxes, plus he said the referential \"jokes\"; Horses, calling any random white millennial with a beard Vaush, coconut island etc are low effort and old~ i agree.\n\nPosts here used to be high effort and not just \"hey remember that old stream highlight?\" And i think some type of filter for low effort posts would be good. As well as banning liberal fun-killers.\n\nKinda annoying when i see 6 posts from this sub and its just a vague reference to horses or some shit like we gotta try a little harder",
            "This is the shit Orwell wrote about.",
            "Horse jokes should be heavily moderated, he hasn’t really mentioned it on YouTube in forever and none of them are funny anymore"
        ]
    },
    "Swing voter moment": {
        "title": "Swing voter moment",
        "score": 811,
        "url": "https://v.redd.it/afyzi4i4hb9d1",
        "content": "",
        "num_comments": 42,
        "comments": [
            "But the liberal candidate is 3 years older than the Hitler candidate so obv I have to vote for hitler",
            "I don't think there's a single person in the Universe who is, at this moment, undecided between voting Trump or voting Biden.\n\nThe real election deciders are those whose choices are voting Biden and *staying home and not voting at all* (as well as their equivalents on the Trump side). *They're* the ones we need to convince.",
            "Keep in mind, the Median Voter is Hitler himself",
            "My one bit of hopium from this is that Trump said he believes abortions should be available in certain circumstances and that probably lost him some of those fundy evangy voters.",
            "I understand the intentions of trying to get rid of this stupid: “both sides are bad” argument many centrists hold. But the fact of the matter is that Biden will likely lose the election because of how bad he performed last night. Biden needs to be replaced if we won’t have another trump presidency and posts like this are making that harder and harder. The choice to remove Biden needs to be unanimous so that another candidate can be nominated",
            "but Biden is OLLLDDDDDDDDDDDDDDDDDD",
            "Is that Chef Rush",
            "u/savevideo",
            "I know polls are evil but it doesn't seem like the debate did much in terms of favorability",
            "I get your point and I get if it's just a meme, but for real, we shouldn't assume others outside of our echo chamber have the same thoughts, knowledge or draw the same conclusions.\n\nSome people definitely will change from Biden to Trump just because Biden looks like a zombie. They may not be aware of how monstrous Trump is or they underestimate it (it can't happen here).\n\nIf everyone was aware of reality as it actually is, PACs wouldn't spend millions on random ads that don't say anything, but relay feelings."
        ]
    },
    "man i thought the debate wouldve gone worse but it caught me off guard when bidens voice got really deep and he said \"I BRING SUTEKHS GIFT OF DEATH TO HUMANITY\" and turned trump to sand\n": {
        "title": "man i thought the debate wouldve gone worse but it caught me off guard when bidens voice got really deep and he said \"I BRING SUTEKHS GIFT OF DEATH TO HUMANITY\" and turned trump to sand\n",
        "score": 294,
        "url": "https://i.redd.it/n321ctlitc9d1.png",
        "content": "",
        "num_comments": 20,
        "comments": [
            "Classic debate trick!",
            "https://preview.redd.it/vp65qatg3d9d1.jpeg?width=702&format=pjpg&auto=webp&s=f7ef2900c15406b35c70efbdbe163d38857af1ab\n\nPYRAMIDS OF PEAK SLIGHTLY REFERENCED !!!",
            "It truly was a politically smart optical move. Bravo Biden! 👏👏👏",
            "I don't remember that part.  \n\nDid it happen before or after Biden pledges allegiance to Satan?  After, right?",
            "You cannot allow Voosh to see this image he will start debating with Chat if that stripped shirt is a fit or not.",
            "Peak fiction",
            "Mods, banish him to the time vortex",
            "But did he do a little dance as he entered the stage?",
            "If only",
            "Vote sutekh 2024 to save America!"
        ]
    },
    "Me after drinking the canned Biden water": {
        "title": "Me after drinking the canned Biden water",
        "score": 39,
        "url": "https://i.redd.it/27iqwof5mf9d1.gif",
        "content": "",
        "num_comments": 1,
        "comments": [
            "To be honest if Biden water makes you able to withstand up to 9 g’s before finally passing out that shit is goated. Imagine literally weighing almost a ton and not instantly losing your shit."
        ]
    }
}