{
    "I used to live in a NYC loft in the 1970s: A 5 flight walk-up, but 2000 sq ft at $175 a month": {
        "title": "I used to live in a NYC loft in the 1970s: A 5 flight walk-up, but 2000 sq ft at $175 a month",
        "score": 26801,
        "url": "https://98bowery.com/first-years/life-on-the-top-floor",
        "content": "",
        "num_comments": 902,
        "comments": [
            "$175 1970 is $1500 today. However I highly doubt that that apartment is going for only $1500.",
            "Super cool to see. Way better than old sexy celebrity photos which are recycled.\n\nI moved to NYC (well Brooklyn) in 1989 and my best score was a rent controlled walk up 3rd floor studio for $425 a month, only 400+ SF but on a lovely tree line street one block from Prospect Park in Park Slope.",
            "Now this is old school cool. Thanks for sharing! I am an 80s baby. Grew up in the 80s and 90s and I feel like I missed out on the cool 70s era.",
            "I wish we had of way of knowing we were in the good old days before we actually leave them.\n\nAndy",
            "The industrial unit heater is something else.",
            "That must have been an amazing moment in time.",
            "Dig the Money Jungle LP. A nice little window into your past. Thank you.",
            "Brings back great memories of the ‘70s. BTW, Carla was quite an accomplished artist!😊",
            "Now I want to hear stories about Carla, and Trevor, and Heidi, and Jeff, and Mike, and the rest",
            "you must have seen some shit living in NYC in the 70s"
        ]
    },
    "Lisa “Left-Eye” Lopez with Eric Cartman (1990s) ": {
        "title": "Lisa “Left-Eye” Lopez with Eric Cartman (1990s) ",
        "score": 3682,
        "url": "https://i.redd.it/fpymj0nznd9d1.jpeg",
        "content": "",
        "num_comments": 178,
        "comments": [
            "Pics like this always make me pause. She died a long time ago yet cartman is still in the modern psyche.",
            "RIP to the realest. \n\nStraight pulled guns on Laface record execs when she found out TLC was extorted out of tens of millions.",
            "Absolutely no notes. Perfect. RIP Left Eye, gone way too soon girl",
            "I like the Mad magazine print on her shoes.",
            "Idk why, but I love this picture",
            "So I’m a firm believer that had it not been for the death of Lisa left eye Lopez and Aaliyah, Beyoncé would not be who she is today. Their deaths were a perfect storm for Destiny’s Child and Beyoncé to have success. Lisa was single handedly the glue for TLC the most successful women’s group ever.",
            "Omg! I have the same shoes as her! ❤️",
            "....what up with the Wendy's wig?!",
            "Gone too soon 😢 this is a sweet photo. Thanks for posting.",
            "she was such a baddy.   loved her."
        ]
    },
    "Hang on Sloopy - The McCoys (1965)": {
        "title": "Hang on Sloopy - The McCoys (1965)",
        "score": 6329,
        "url": "https://v.redd.it/n4ak7c7etc9d1",
        "content": "",
        "num_comments": 681,
        "comments": [
            "This film clip was actually made in 1975, to promote a “Greatest Hits” collection by McCoys guitarist and singer Rick Derringer. (The song had been a hit ten years previously.)\n\nThe dancer here was identified by Derringer as teenaged dancer Lisa Leonard Dalton, and she verified this as recently as 2021.",
            "Pretty sure in 1965 this qualified as porn.",
            "Damn Sloopy got it going on",
            "\"Okay, not bad, but let's do another take.\" (Director all afternoon long)",
            "Just watching her dance threw out my back.",
            "So that's a Sloopy. I always wondered.",
            "Tremendous attributes aside, she is a really good dancer. ",
            "My high school science teacher was the bass player in the McCoys, he was a super dry dude but lit up when he played the bass for this song in class once.",
            "Kind of hard to focus on the song.",
            "It’s like being at an OSU game."
        ]
    },
    "Chris Farley with his Dad 1990's ": {
        "title": "Chris Farley with his Dad 1990's ",
        "score": 267,
        "url": "https://i.redd.it/79l6r0k6ah9d1.jpeg",
        "content": "",
        "num_comments": 39,
        "comments": [
            "I’ve heard people say Chris’s dad was really special to him and you can see that from their look here. I hope they’re both at peace.",
            "He made a good ninja and was good on SNL",
            "Is that Big Tom Callahan?",
            "Those are some big boy pants",
            "“Does this jacket make me look fat?”                               \n\n“No, your face does.”",
            "These guys could sell you some brake-pads and T-bone steaks. Wait, it's gotta be your bull...",
            "🎶Fat guy in a little coat…..",
            "“Looks like a picture of before and way before”",
            "Farley was a legend in my day. I miss him on snl him and Sandler so many great things.it was so sad when it broke that he died especially when it was just like his idol belushi who was also ttagic.",
            "There's a lot of material here"
        ]
    },
    "Catherine Deneuve, 1963 ": {
        "title": "Catherine Deneuve, 1963 ",
        "score": 1028,
        "url": "https://i.redd.it/n2gwp8fuce9d1.jpeg",
        "content": "",
        "num_comments": 29,
        "comments": [
            "Oh good god! Where's the rest of her??",
            "Catherine Deneuve was and still is an icon",
            "In quicksand! Help her! 😳",
            "A hall of fame hottie!",
            "such a stunner.  so many wouldn’t know her name.",
            "Is she climbing out of a hole?",
            "I wouldn't have deneuve to ask her out on a date.",
            "Voted worlds most attractive 2’ woman",
            "Ursula Andress, Catherine Deneuve, and Charo twice.",
            "Best pic I have ever seen of her."
        ]
    }
}