{
    "The OMORI Manga is out!": {
        "title": "The OMORI Manga is out!",
        "score": 568,
        "url": "https://www.reddit.com/r/OMORI/comments/1dnfwy7/the_omori_manga_is_out/",
        "content": "The OMORI Manga is out on the K Manga app! \n\nThe Japanese version will be released tomorrow as part of the magazine Monthly Afternoon in Japan.\n\n[https://kmanga.kodansha.com/title/10607/episode/352385](https://kmanga.kodansha.com/title/10607/episode/352385)\n\n",
        "num_comments": 220,
        "comments": [
            "For people outside of the US and Japan, here are some free VPNs you can use to read the manga on the K MANGA app:\n\n[VPN recommendation](https://www.reddit.com/r/OMORI/s/sFA3fT0mRt)",
            ">!I did not expect RW to come first and HS after. Very interesting choice on the writer's part. I love it already so far though!<",
            "It's extremely fast-peaced imo, don't know if it's because it's the first chapter so it's kind of an introduction or if Mangas are usually like this but still really cool.",
            ">!the RW focus is completely unexpected, i thought we would have to wait like 6 months minimum before we got to sunny going out with kel. absolutely wild!<\n\nedit: >!there's all new dialogue and the circumstances of the plot beats seems very different too, in the game during 3 days left basil doesn't seem to notice sunny until after the aubrey fight but here basil notices sunny right away. AND AUBREY KICKS BASIL TO THE GROUND??? SO SO CRAZY!<",
            "Jesus the plot is moving faster than the speed of light.",
            ">!Idk if it's because of the faster pacing, but comparing this chapter to its equivalent in the game, I found it much less impactful and significantly less well-written. Like, by this point of the story, when I first played the game, I was HOOKED, while I wouldn't have felt much if I discovered the story in the way the manga is telling it. The introduction of the characters/plot/etc is so much better in the game (for now at least, maybe it'll get better in the next chapters since this is just the beginning).!<\n\n&#x200B;\n\n>!The drawings are sick though, the small tweaks in Something's design are epic!<",
            "Is it just me who kinda... didn't like it? The art is gorgeous and some of the panelling is really cool but if it's trying to tell the story of omori to a new unfamiliar audience it's very strange to begin with faraway town and to drop that Mari is dead before we even know anything about her, as well as having no knowledge about sunny or kel or basil or anyone for that matter. Mari's death isn't even outright stated until Aubrey talks to kel and sunny in the church later on in the game, which is a very impactful moment in how blunt it is, and Aubrey coming out and shouting it in the middle of a park after saying she was never even friends with Sunny (which isn't in the game, correct me if I'm wrong but she just kinda acts apathetic towards sunny in that first meeting in the park) seems very out of character, as well as going back into white space after Aubrey is stabbed doesn't adhere to the rules of sunny's retreat into head space established in game. Obviously it's interesting if it's meant for fans of the game with knowledge of the story, but still seems vastly inferior due to the character actions I mentioned. Is it just me?",
            "I worry the pacing of the manga is perhaps *too* fast. Manga does usually tend to have a brisk pace, but I feel like without prior knowledge of the game, some people might get completely lost.\n\nIn addition, the decision to start with Faraway and *then* go to Headspace seems like an odd choice: I feel that Faraway on the first day has a lot more impact *because* of the comparison to the Headspace versions of the characters.\n\nBut, I’ll still stick through, to see how the rest goes! It may just be that I’m way too old now and need things to move a bit slower ![img](emote|t5_31hpy|2470)…",
            "anyone who can access it, can you post/send me screenshots pretty please?",
            "https://preview.redd.it/0lledbjpoj8d1.png?width=1232&format=pjpg&auto=webp&s=8526d251426dd3d10be3087e04df950f7bdf2bd6"
        ]
    },
    "VPN recommendations for reading OMORI Manga": {
        "title": "VPN recommendations for reading OMORI Manga",
        "score": 41,
        "url": "https://www.reddit.com/r/OMORI/comments/1dng3z0/vpn_recommendations_for_reading_omori_manga/",
        "content": "So far I've discovered 3 free and decent VPNs, [hide.me](https://hide.me), [Proton VPN](https://protonvpn.com/download) and [TunnelBear VPN](https://www.tunnelbear.com/download). Here are their pros and cons.\n\n[TunnelBear](https://www.tunnelbear.com/download): You can choose to connect to US server, but there's a 2000MB data limit that resets every month.\n\n[Proton](https://protonvpn.com/download): Unlimited data, but you cannot manually choose server. You have to press 'Change server' and pray it changes to US server, the button has a 1 minute 30 seconds cooldown. My first attempt took me 4 presses (6 minutes) to successfully connect to US.\n\n[hide.me](https://hide.me): 10GB limit, can choose US server, no need to make an account.\n\n&#x200B;\n\n&#x200B;\n\nIf you've got other recommendations, feel free to comment below. Hope this helps!",
        "num_comments": 27,
        "comments": [
            "Also a reminder to log out of your Reddit before turning the VPN on, as accessing your account while it is on could result to a sitewide ban.",
            "Back in my day Proton VPN allows you to manually conect to usa, japan, and that one low land country for free now its automatic.\n\nStill cool free VPN. Been using it for 1 year now very cool!",
            "They say the only truly trustworthy VPN is [Mullvad](https://mullvad.net/en) but it costs a little money",
            "opera gx launcher unlimited gb choose \"enable vpn\" in options set on america and enjoy",
            "x-vpn is another that works and is free",
            "i tried windscribe, by default you get 2GB per month, if you sign up you get 10GB. its also free btw.",
            "i downloaded tunnelbear and its still not working :<",
            "I personally recommend Turbo VPN. Works beautifully on PC tho I'm not quite sure about mobile.",
            "i've gotten proton to connect to the us by using the change server button, still not working.. trying all the vpns i can access rn ahhaha",
            "hey yall, for whoever the k manga site is still region blocked even after ur connected to a US vpn, yall have to use a different browser/device, using a guest account works as well ![gif](emote|free_emotes_pack|grin)\n\nalso a good free vpn that lets u manually connect to the US and several other countries -> planetvpn"
        ]
    },
    "Omori characters names according to my mom": {
        "title": "Omori characters names according to my mom",
        "score": 132,
        "url": "https://i.redd.it/zip7240lwf9d1.jpeg",
        "content": "",
        "num_comments": 23,
        "comments": [
            "Rick’s gonna Rick Roll Natalia to confess his love.",
            "jasper is lowkey accurate and i don't know why",
            "Frazier...",
            "Hero never gonna give you up",
            "petunia ![img](emote|t5_31hpy|2028)",
            "George ![img](emote|t5_31hpy|2474)",
            "Hero's gonna open up a portal and see his other dimension counterparts lol",
            "Jasper is weirdly fitting",
            "I see the vision honestly.",
            "She also said she saw them all as being british?? (we are American)"
        ]
    },
    "What’s something you dislike about Omori?": {
        "title": "What’s something you dislike about Omori?",
        "score": 305,
        "url": "https://i.redd.it/ipn9pkvece9d1.jpeg",
        "content": "Personally it’s the fact their neighborhood is called “FARWAY TOWN.” Reminds me of far far away land in shrek XD. I feel like they should’ve came up with a different name :(\n",
        "num_comments": 158,
        "comments": [
            "That the city Sunny is moving to isn't mentioned by name. I mean CLOSEBY City was right there!",
            "Since it had a lot of Earthbound influences, I wish it had the same feature as Earthbound where if you encounter an enemy who is significantly lower level than you, it just decides the fight automatically (you win) and get the XP in a single dialogue box. Prevents going to the battle screen often in enemy heavy areas where they're all way below your level.\n\nAnd diagonal movement too but I'm not too upset about that",
            "Humphrey\n\n\n\n\n\n\nFuck humphrey",
            "Headspace part gets really boring after you get to the real world, I wish It wasnt so stretched, though I know some ppl liked it, I still think that it basically becomes filler. Its even more annoying, when you realize how those times could be used more in real\nworld, we could be getting >!Aubrey's arc thatdbe less rushed, more Basil, more interactions!<",
            "Simple words \n\nHUMPHREY THE WHALE",
            "I am an old timer, I wish you could change the pass to character option to be not timed.",
            "How much it’s making me cry and how much ut reminds me of past stuff (friend committing suicide). I love the game, and I’m playing it for the first time, but I’ve been crying all day today because I’m close to finishing it and it’s just so damn sad",
            "The headspace time being longer than the realworld time\n\nAnd how there are crucial RW characters\n moments that can be missed because they’re optional. Particularly the moment where the gang thinks back to the time Mari saved Sunny  from drowning. Which you only get if you go to lake.",
            "The pacing for sweetheart's castle sucks but aside from that, the game is too easy. They really didnt test the \"observe\" move did they? It makes the entire game's combat an absolute joke. You can literally play through the Whole game toastless as long as you have the move.",
            "hide and seek. fuck hide and seek."
        ]
    },
    "wanted to draw a few panels in my style but i got a bit carried away 😅": {
        "title": "wanted to draw a few panels in my style but i got a bit carried away 😅",
        "score": 595,
        "url": "https://www.reddit.com/gallery/1dqsaw0",
        "content": "",
        "num_comments": 49,
        "comments": [
            "Man... Your style is MUSCLE\n\nI think they do look a bit old, but I also feel like the original manga has their IRL selves looking way too young based on what I've seen posted to the sub. Still I love what you've done, got me inspired to do my own version of the panels!",
            "Sunny's bizarre adventure",
            "Peak asf, your seriously talented man 🔥\n\nhttps://preview.redd.it/mvginh9hud9d1.jpeg?width=1179&format=pjpg&auto=webp&s=e235e589fcf1ca89f908c04d8789afd351e34d51",
            "https://preview.redd.it/b4tcf8t53e9d1.jpeg?width=1536&format=pjpg&auto=webp&s=aa01465f948fda7a4646aa5fc46ebe924397f208",
            "Your artstyle looks gorgeous! The eye close-up!",
            "how did you draw this so fast holy shit its beautiful",
            "https://preview.redd.it/ph267p5hae9d1.jpeg?width=469&format=pjpg&auto=webp&s=5c7fc6d5c00e74856430f5b6b409c51190a50d04\n\nThat's it.",
            "You know How Tennagers in JoJo look like,30. Yeah it's kinda like that.",
            "https://preview.redd.it/1jg69z2pte9d1.jpeg?width=555&format=pjpg&auto=webp&s=ea399bafb966e5b3d3be28bfec43305724f4c9c1",
            "Fuck......everything really is a JoJo reference![img](emote|t5_31hpy|2460)"
        ]
    }
}