{
    "Crossing the rainbow bridge ": {
        "title": "Crossing the rainbow bridge ",
        "score": 116,
        "url": "https://www.reddit.com/r/OneOrangeBraincell/comments/1c8ukrz/crossing_the_rainbow_bridge/",
        "content": "",
        "num_comments": 35,
        "comments": [
            "This thread is dedicated to mourning and loss posts. If you want to talk about a cat you recently lost and share photos and stories please do so in the comments",
            "I have a question for the mods. What if my cat passed away 3 years ago? My cat Sephy was a white cat with orange spots who was in my care from 2012-2021. Can I still post pictures of him here? If not, it's okay.",
            "I'm sorry to hear about the loss of your precious baby. He looked like such a precious baby",
            "I'm so sorry for your loss. It is amazing how something so small can leave such a large hole when no longer present.",
            "So sorry for your loss, I know you'll miss him but he had a long 17 years full of happy memories with you. He was a very handsome boy. Just remember him for all the good times he gave you because he might be gone but his memory lives on.",
            "Sincere condolences for you and the people that knew Taz well.",
            "Taz was a beautiful man! I am so very sorry for your loss. Big hugs ❤️",
            "They know how much we love and miss them. They also are patient, and they wait for us to reunite again someday. Lots of love to you and your orange 🍊.",
            "What a great face to flirt with! Condolences to you!",
            "beautiful bebe. I'm so very sorry for your loss."
        ]
    },
    "She was a fairy": {
        "title": "She was a fairy",
        "score": 1488,
        "url": "https://v.redd.it/02gcd0m6wf9d1",
        "content": "",
        "num_comments": 19,
        "comments": [
            "Earned some nice freestyle points there!",
            "I had to play that 3 times it was so good",
            "I can fly oops I think I can fly . So funny & typical orange behavior. Love this & played  it several times.",
            "how tf is this song related? 😂",
            "\"I believe I can fly!!!\"",
            "Best use of music by far. So many song choices and you made the perfect one for this moment.",
            "Reminds me of the old badger running off a cliff gif lol",
            "Hmmm. I beginning to see a pattern on this sub.",
            "That music was epically timed ![img](emote|t5_5vej89|50874)",
            "Arguably the worst case of greebles I've ever seen"
        ]
    },
    " This is an Orange Friend": {
        "title": " This is an Orange Friend",
        "score": 311,
        "url": "https://i.redd.it/36wk9ty2wh9d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Two day old account. I coulda swore this was Cheeto when I first saw it. Not the same face. Not the same pose.... but disturbingly similar.",
            "boop 🥰",
            "So energetic mine is lazy\n\nhttps://preview.redd.it/zblpeqmowh9d1.jpeg?width=1186&format=pjpg&auto=webp&s=f017b66240d3c8f9ad5183d3014b642dd2d8dd5e",
            "https://preview.redd.it/tkpyo2056i9d1.jpeg?width=3024&format=pjpg&auto=webp&s=f5ade38b1fdfe0fd1c7ad1b13787019b6fafc920\n\nSay hello to Ernie, more go in a wet tissue",
            "https://preview.redd.it/x5l23rc4ai9d1.jpeg?width=2891&format=pjpg&auto=webp&s=727d85c787a2c2424e9b6f665431d9c11a638d17\n\nSo lively playing outside...mine's depressed"
        ]
    },
    "Do your cats love to lay on shoulders too?": {
        "title": "Do your cats love to lay on shoulders too?",
        "score": 745,
        "url": "https://v.redd.it/56dsq6fw1g9d1",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Yeah but they’re 17lbs each. So not for very long anymore.",
            "I think there is a \"Shoulder Cat\" gene. Mine does not have it. A previous cat definitely did though.",
            "Mine puts his bum on my head",
            "Min did and liked to nibble in my neck or ear…",
            "Yes, my did... It became a problem when he grew up and became fat. I was a teen back then and did not have beard. So that sucker bit my beard off because he did not like it. They clearly use to things when they are young.",
            "Oh yea mines 15 lbs and he loves the shoulder rides",
            "My cats don't, but I can see you playing rot2 lmao.",
            "Mines 20.. and he's still rocking the shoulder rides..",
            "Behavior, animal or humans, has nothing to do with genes. \n\nOnly education/environment/experience.",
            "r/shouldercats"
        ]
    },
    "orange cat wants to make fried chicken thighs": {
        "title": "orange cat wants to make fried chicken thighs",
        "score": 1027,
        "url": "https://v.redd.it/qf32dkgxhf9d1",
        "content": "",
        "num_comments": 19,
        "comments": [
            "Went for the bite, then realized he’d have to get slightly less comfortable to do it and bailed",
            "orange cat: do you think i'm a bit cool",
            "\"Look I'm a chicken nugget, another great orange invention\"",
            "That's quite the cheeseburger locker he's packing. Bobandy would be proud",
            "Cartman Cat: \"No kitty, this is MY pot pie!\"",
            "That is Tempura prawn or ebi fry",
            "Eating a bit too much fried chicken eh kitty?",
            "That cat seriously needs a diet",
            "Aww man! I really expected that to be a real subreddit. I hope somebody creates it.",
            "Tbf, i ~~stand~~ sit splayed out with that orange."
        ]
    }
}