{
    "[Revised] Chapter 201 [English]": {
        "title": "[Revised] Chapter 201 [English]",
        "score": 4740,
        "url": "https://cubari.moe/read/imgur/gzmqQbt/1/1/",
        "content": "",
        "num_comments": 708,
        "comments": [
            "**\"Void Confirms Parallel Worlds Branch Out with Infinite Possibilities\"**\n\nPower Scalers and Fanfic Makers:  Our time has come",
            "This was truly our Ninjutsu Kaisen\n\nI like this current version of Empty Void’s design more than the one we saw in the flashback",
            "Man this version does such a better job of showing void off. We got a really interesting depiction of how the dimensional slash works and both flash and sonic get to have their respective moments in their defensive.",
            "I love how Blast was showing he wasn't just a 'badass' in this chapter, and is just a silly guy. It's so funny with his 😛 and his bulging eyes. He's really not beating the Joseph Joestar accusations 😂😂",
            "Blast panicking because he lost track of Flash is peak OPM lmao.",
            "I like the duo and giving each something they are better at, Flashy with skills that are above and Sonic solid conviction to not be tempted. It's a nice touch for this pair of tsundere friends.\n\nBlast vs ninja dude is gonna be epic. Lots of dimension and what ever scifi stuff they will cook up.",
            "Empty Void feels way stronger and more threatening in these redraws. I also really like his monstrous appearance in this chapter. The bit of extra characterization with Flashy and emotional dependence is great too. Overall a definite improvement.",
            "Blast coming in like a professor proud of his 2 best students passing the final exam.",
            "Void’s conversation with flash/sonic reminds of Sage Centipede’s conversation with metal bat and garou LOL",
            "Flashy realizing his emotional dependency on Sonic gksjagjdkfks 😭"
        ]
    },
    "The OPM manga is taking a 2 month long break.": {
        "title": "The OPM manga is taking a 2 month long break.",
        "score": 3692,
        "url": "https://x.com/NEBU_KURO/status/1803665793089179703",
        "content": "",
        "num_comments": 504,
        "comments": [
            "Welp. Can't wait to see what kind of content we'll get from this sub in the meantime.",
            "God is messing with the timeline to delay empty void’s defeat",
            "I’d rather them enjoy working on this than treating it as a task to complete. Hopefully the break will rejuvenate them",
            "would be cool if we get webcomic chapters during the break",
            "That's alright for me. Better that Murata and co. take time off and do other things. Looking forward to when this returns.",
            "Don't worry guys, ONE will surely update the webcomic during the hiatus to keep us engaged! The rats in my rubber room told me so!",
            "It's because elden ring dlc is releasing isn't it? Completely understandable though",
            "Hopefully during this time we get more information about the anime",
            "Good to see it is pinned. Now we won't get a \"where is new chapter?\" twice a day",
            "Maybe they will plan what the next arc would be. Hopefully will have Garou"
        ]
    },
    "[OC] Garou and his Sanrio girlfriend again": {
        "title": "[OC] Garou and his Sanrio girlfriend again",
        "score": 214,
        "url": "https://www.reddit.com/gallery/1dr2pzm",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Last time I checked I didn't have dementia. Did I miss a few chapters? Who is Sanrio?",
            "We're about to see Snownyann saying why this should be her lol",
            "u/snownyann looks like you’ve got competition",
            "Pic 3, the skin puppet made by god in a attempt to quell garou’s unshakable guilt and drag him deeper in gods influence at the same time, consuming the one he loved like a rabid honey badger and a toddler in a moment of what can only be described as a hunger that in its feast devoured even his own sanity, lied as easily as it existed, for behind those eyes lies no true soul, the soul of whom garou loved shed its mortal bounds long ago by his hand (mouth on some denji shi) but he cannot accept that for himself, leading him to become deeper entwined with god, for if god left him the puppet would as well, he knows this on the back of his mind though his memories were erased, so something in his subconscious tells him he needs to follow god, out of fear that his memories could clear and give back every second of what he did, each moment one he would remember until he goes to the same grave he sent his dearly departed.",
            "i love all of the garou simps, thank you for the food ♥️. he is severely lacking in cute fanart",
            "Im glad murata can make both men and women down bad lmao.",
            "She wasn't eaten by Garou YET. Can't expect a man to stay sane with these f\\*ing brakes in releases.",
            "Is she also a hero? Will she kill to protect him? *Has* she killed to protect him?",
            "Artist's OC (original character) I believe",
            "Dang. I thought the religion of Headcannonism was a meme. She's the Delusionist fr."
        ]
    },
    "Theory: Pig God's powers": {
        "title": "Theory: Pig God's powers",
        "score": 62,
        "url": "https://i.redd.it/muqh6jkjoh9d1.jpeg",
        "content": "So we all know Pig God's powers and abilities, and the fact he has a secret move that is very powerful but that could cost him his own life.\nI have a theory for all this: I believe some time back, he swallowed some sort of black hole, that managed to 'sit' in his stomach and enhanced his already digestive/swallowing capabilities enormously. This is why PG can never find satisfaction, no matter how much he eats. \nHis secret move consists of regurgitating/vomiting the black hole thing, which will start absorbing everything around it in a mile radious, including PG.\nThis is obviously dangerous for him and his allies, hence his hesitation in using it and wait 'for the very end'.",
        "num_comments": 19,
        "comments": [
            "I just think he realeses his stored up energy in either a display worthy of king or just a massive cloud of fart",
            "There's too much speculation in this \"theory\" of yours. How'd you come to the conclusion that he swallowed something like a black hole in the first place?",
            "This is what I think his killer move is gonna be: Roaring Diarrhea Sky Ripping Fart",
            "I’ve heard the black hole theory before, but if that were the case I don’t understand how he keeps packing on mass. If he were always skinny while eating like he does, I could see this theory being more believable.",
            "My theory is that Pig God's ultimate move is that he'll swallow anything he can until he dies",
            "i actually really fuck with this theory",
            "He doesn’t just go super saiyan he flat out turns into goku",
            "Yeah probably this. \n\nApparently converting 1 kilogram of mass into pure energy is like detonating a 21 megatons bomb, so it would be pretty epic if PG did it with all his excess weight.",
            "That's my way to explain his 'powers'. The black hole enhanced them. Of course I'm speculating, we know very little about PG anyway, but it would be disappointing if his ultimate move is just him turning a ripped, stronger version of Tank Top Master or Dark Shine, we've seen that before already.",
            "I think PG as already that big before, the black hole would just stay in his stomach without harming its host, but demanding a constant supply of things to devour."
        ]
    },
    "Yujiro vs G O D": {
        "title": "Yujiro vs G O D",
        "score": 71,
        "url": "https://www.reddit.com/gallery/1dr6h5d",
        "content": "I created this comic based on the narrative idea that Yujiro is the strongest being. It's kind of a meme, I hope you like it",
        "num_comments": 11,
        "comments": [
            "By using the grove on his plan like hooks Yujiro has created an inescapable grip making God unable to escape his grasp",
            "From demon back to divine back",
            "Then the narrator gaslights you that it's very possible to do so that even a toddler can do it",
            "Are the 3 images connected ?",
            "If the narrator says it then it's true",
            "Disagree. If he had made such a grasping move, God would have caused great damage to his mind.\ndon't underestimate god",
            "Ok now insert a few bullshit paragraphs about how this is an advanced version of some random ass ancient technique that was lost, and then rediscovered and reinvented by Yujiro who greatly improved on the original.",
            "Nvm, I get it now\n\nI should sleep",
            "Damn!",
            "Beautiful"
        ]
    }
}