{
    "One Piece: Chapter 1119": {
        "title": "One Piece: Chapter 1119",
        "score": 3201,
        "url": "https://www.reddit.com/r/OnePiece/comments/1dppugt/one_piece_chapter_1119/",
        "content": "##**Chapter 1119: \"Emeth\"**\n\nSource | Status\n:-----|:-----|:-----\n[Official Release](https://mangaplus.shueisha.co.jp/titles/100020) | [](/cross) OFFLINE\n**TCBscans website** (TCBscans (dot) com)| [](/tick) ONLINE\n[TCB Discord](https://discord.gg/tcbscans) | [](/tick) ONLINE\n[/r/OnePiece Discord](https://discord.gg/onepiece) | [](/tick) ONLINE\n\n\n---\n\n[Ch. 1119 Official Release (Mangaplus)](https://mangaplus.shueisha.co.jp/titles/100020): 30/06/2024\n\nCh. 1120 Scan Release: ~12/07/2024\n\n---\n\n##There is a break next week.\n\n---\n\n## Please discuss the manga here and in the theory/discussion post. Any other post will be removed until 24h after the release.\n\n## Please also remember to put the chapter number in the title for any future post talking about this chapter.",
        "num_comments": 2901,
        "comments": [
            "Incoming cover story : The pilgrimage of Mars in Sky Islands!",
            "Marcus Mars about to meet Enel lmfao",
            "I had to watch that memories right punch panel several times just to get a clear picture of how fucking giant everyone is, Franky is absoluty tiny in that panel, and i can't even see Sanji at all",
            "Sanji using Ifrit Jambe: Hell Memories on Luffy is insane lmao",
            "Warcury jumped straight into the ocean without a care in the world. Either he can maintain himself afloat, he was hoping someone would rescue him or, maybe this is a strong hint that they aren't weak to the sea.",
            "Franky punching enemies: STRONG RIGHT\n\nFranky punching captain: STRONG RIGHT WITH HAKI",
            "really like how they dealt with the bird gorosei. Just yeet him.",
            "I can't believe they showed Gaimon",
            "Sanjis hell memories in Ifrit mode have a much bigger flame shroud around him compared to before.\nIts such a cool technique.",
            "Sanji and Franky were almost too hyped to beat on Luffy lmao"
        ]
    },
    "One Piece: Chapter 1119 - Theories and Discussions": {
        "title": "One Piece: Chapter 1119 - Theories and Discussions",
        "score": 54,
        "url": "https://www.reddit.com/r/OnePiece/comments/1dqcmwe/one_piece_chapter_1119_theories_and_discussions/",
        "content": "**Chapter 1119**\n\nPost all your theories and discussions for the current chapter in this thread. We also have poll related to a question/event of the recent chapter!\n\n**\"Will Luffy \\*merge\\* with the Robot to attack the Gorosei?\"**\n\nJoin us at [http://discord.gg/onepiece](http://discord.gg/onepiece) to discuss One Piece instantly with fellow nakama! \n\n[View Poll](https://www.reddit.com/poll/1dqcmwe)",
        "num_comments": 153,
        "comments": [
            "I think Atlas is going to die, allowing the Sunny to launch, making Lilith the only good survivor of the punks.",
            "Emeth is a word from Kabbalist Jewish Mythology. The legend goes that some rabbi molds a golem out of clay and writes the inscription Emeth upon its forehead to give it life. As the golem grows and grows he realizes it could become problematic, and decides to wipe off the \"E\" to instead have the inscription say \"Meth\" which translates to \"death\". Upon doing so, the clay golem disarticulates into a pile upon the rabbi's head, killing him instantly.",
            "We gettin a lore dump from ROBOT",
            "Why is nobody cooking the word \"romance\" being dropped out of nowhere???",
            "It has now come down to this, a Robot vs. Kaiju showdown at the coast of an island.\n\nI wonder if Emeth has any other abilities like a giant laser, rockets or is simply monstrous in strength.",
            "Did we just hear Joyboy speak for the first time?",
            "Will he Megazord the robot? I hope so.",
            "100% Luffy will ask the robot if it poops.\n\nAnd the answer will be yes.",
            "Wait, Luffy said it hurt because of \"you guys\" using haki when getting pushed by Bonney, Sanji, and Franky. Of course, still not confirmation that Franky has haki...",
            "for the first time in history, the robot actually does something that impacts the story, shits crazy"
        ]
    },
    "Sanji vs Robin ": {
        "title": "Sanji vs Robin ",
        "score": 174,
        "url": "https://i.redd.it/l5h2908f7h9d1.jpeg",
        "content": "The other day one of my female friends was telling me that Robin can easily surpass Sanji in power ranking with her Devil fruit and her DF is powerful enough to defeat Sanji in a fight .\n\nI don't agree with it but what's your opinion?",
        "num_comments": 39,
        "comments": [
            "Sanji is stronger, faster, more battle experience, and has strong Haki on top of modified near invulnerable body.\nHe is stronger than Robin in every way possible. Though he still will never win against Robin",
            "If Sanji could fight women, he would one shot Robin. \n\nBut Sanji can’t fight women, so Robin would low dif him. ",
            "Robin would always win against Sanji in a fight. What are you talking about?",
            "If Sanji keeps himself away from fighting women, then Robin wins (if she finds a reason to fight Sanji)\n\nIf Sanji, for whatever reason decides to fight against women, he should be able to speedblitz Robin. That’s imo the only chance he has, because he is still weak when it comes to female bodies sooooo, if Robin decides it is a ‚do or die‘ battle, she can just grow 1000….female bodyparts….to keep Sanji bleeding and dying from blood loss.",
            "Sanji doesn't fight women but if he did he'd one shot",
            "Before his fight with Queen Robin had a shot of winning just because she can 1 shot normal sized humans by snapping their neck. After said fight, I don't think that's possible anymore due to Sanji's enhancements.",
            "Your female friend has no idea what she is talking about.\n\nSanji surpasses Robin in any way possible.",
            "Whats stopping Robin from summoning hands around Sanji's inner thigh, grabbing his balls then going into demon mode to break them in half? \n\nOr using her clones to trick Sanji then grab his foot causing him to slam face first on the ground *and then* grabbing and twisting his balls off.",
            "Her point was Robin is stronger than Sanji",
            "Topic asside. Robin slays in that outfit. 😍"
        ]
    },
    "Not sure if posted. RIP": {
        "title": "Not sure if posted. RIP",
        "score": 100,
        "url": "https://i.redd.it/j0avq18ngh9d1.jpeg",
        "content": "Passed away the 26th",
        "num_comments": 8,
        "comments": [
            "Rest in peace. Very sad such a young age",
            "Rest in peace to a beloved character.",
            "Also the voice of Japanese Spongebob.\n\nRest in Peace",
            "Damn. Poor guy.\n\nThat got me thinking though- where the actual fuck *is* Lafitte at the moment? We haven’t seen him since the end of Dressrosa, we don’t know his Devil Fruit, we don’t know how he got into Marijois. This guy is an absolute enigma. In Egghead, just about every Blackbeard commander has been seen except him. Invest in Lafitte stonks because I can feel that he is gonna be vital in the final saga",
            "And outside of One Piece, he also voiced Agumon.",
            "Damn that sucks.",
            "rest easy lafitte/trebol seiyuu"
        ]
    },
    "Guess the Pixels, Day 10": {
        "title": "Guess the Pixels, Day 10",
        "score": 71,
        "url": "https://i.redd.it/d12v2tdooh9d1.jpeg",
        "content": "",
        "num_comments": 45,
        "comments": [
            "It looks more like Sengoku than Garp to me",
            "Monkey D. Garp, the pirate fister.",
            "This is the first one, that I recognized immediately.",
            "Monkey D Garp, goat of the Marine !",
            "Definitely me, where did you get the picture from? This meeting was a secret.",
            "This pixel challenge is so fun! I'm guessing it's Luffy this time.",
            "This one is Foxy, clearly.",
            "**Monkey D. Goat, harbinger of the hands**",
            "why everyone sayin garp? it's obviously son goku from demon slayer",
            "Monkey D. Garp, hero of the marines!"
        ]
    }
}