{
    "One Piece: Chapter 1118": {
        "title": "One Piece: Chapter 1118",
        "score": 3747,
        "url": "https://www.reddit.com/r/OnePiece/comments/1dkas3v/one_piece_chapter_1118/",
        "content": "##**Chapter 1118: \"Being Free\"**\n\nSource | Status\n:-----|:-----|:-----\n[Official Release](https://mangaplus.shueisha.co.jp/titles/100020) | [](/cross) OFFLINE\n**TCBscans website** (TCBscans (dot) com)| [](/tick) ONLINE\n[TCB Discord](https://discord.gg/tcbscans) | [](/tick) ONLINE\n[/r/OnePiece Discord](https://discord.gg/onepiece) | [](/tick) ONLINE\n\n\n---\n\n[Ch. 1118 Official Release (Mangaplus)](https://mangaplus.shueisha.co.jp/titles/100020): 23/06/2024\n\nCh. 1119 Scan Release: ~27/06/2024\n\n---\n\n## Please discuss the manga here and in the theory/discussion post. Any other post will be removed until 24h after the release.\n\n## Please also remember to put the chapter number in the title for any future post talking about this chapter.",
        "num_comments": 5235,
        "comments": [
            "Am I hallucinating?\n\nNo break next week???!!!!!",
            "Please no one ask Dorry and Brogy who can dance better!",
            "Warcury looking mad SWOLE",
            "Luffy making the ocean bouncy and all the marines freaking out thinking it’s the ocean rising was pretty dope",
            "Rebecca is so done with how Leo is so Naive.",
            "Imagine going back to Sabaody and telling people that Bonney's fruit might even be more busted than Law's",
            "Bonney became Joy Boy before Kaido. 💀",
            "I love how Saturn said Bonney was fed a useless fruit as an experiment. Yet here she's now, using that fruit to become his worst freaking nightmare.",
            "We’re all focusing on Bonney, for obvious reasons.  But we need to pay our respects to Edison.  He was a real one.  Really hoped he would make it out of this arc alive.",
            "Everyone :  Luffy's gonna eat the mother flame and became invincible.\n\nOda : Two Nika's, take it or leave it."
        ]
    },
    "One Piece: Chapter 1118 - Theories and Discussions": {
        "title": "One Piece: Chapter 1118 - Theories and Discussions",
        "score": 48,
        "url": "https://www.reddit.com/r/OnePiece/comments/1dkwy1d/one_piece_chapter_1118_theories_and_discussions/",
        "content": " **Chapter 1118**\n\nPost all your theories and discussions for the current chapter in this thread. We also have poll related to a question/event of the recent chapter!\n\n**\"Which Good Vegapunk will survive?\"**\n\nJoin us at [http://discord.gg/onepiece](http://discord.gg/onepiece) to discuss One Piece instantly with fellow nakama!\n\n[View Poll](https://www.reddit.com/poll/1dkwy1d)",
        "num_comments": 278,
        "comments": [
            "So now we just need : \n\n- The Sunny to go down from the top of Egghead. \n\n- Jinbe and Zoro to jump Down. \n\n- THe Giant Robot emerging from the water to stop the Gorosei while trying to help Joyboy. \n\nI also hope both Lilith and Atlas survive this.",
            "Remember, there was no flashback before Vegapunk \"died\". 😂",
            "Thematically, this chapter perfectly encapsulates what One Piece is about, and especially what is being built since the reveal of G5.\n\nMy personal theory: The reason the elders and the WG want to get rid of the fruit so badly is not only because of what it symbolizes or the power it gives to the user, but because it can also power up other people around it. The drums of liberation not only inspire people, they give them the tools to free themselves.\n\nI am **not** saying that Luffy has the power to give anyone G5. However, I do think his awakened form can power up people in multiple ways if they are inspired enough by it.\n\nBonney's fruit for example. She can tap into potential futures, unless she learns the truth and cannot believe it will happen. She turns into a Nika form multiple times, although she only takes the rubber characteristics, because that is all she knows about him at that point. Once Saturn tries to break her spirit and tell her Nika isnt real, she conjures a very weak form, because she doesnt fully believe a \"Nika future\" is possible.\n\nHowever, now that she **sees** right in front of her that Nika is very much real, and that liberation is possible, she manages to come up with a fully \"free\" future of herself, which copies the physical characteristics of G5.\n\nThat, I believe, is Nika's true power. Luffy isnt simply metaphorically freeing people, he inspires freedom to the point that they get powered up as well. I dont know how this would interact with other devil fruits, or with those who have no devil fruits at all, but I believe this wont be the last time someone seeing G5 will gain themselves a new form as a result.",
            "Bonney is starting to really seem like the last crew member under the title of \"luffy's protege\" \n\nShe's the youngest person there and luffy seems keenly interested in teaching her how to stand up for herself and be free.  He was showing her how to throw a punch a few chapters back and now he coached her into being a nika herself.",
            "Everyone is too busy on Bonney but what about the last bit of vegabunk recording saying among u there are….and their names are…. And the recording cuts off\nDoes that mean there is sort of other major figures besides joy boy that the D clan members inherits their will.",
            "The real question is: does Bonney just appear as Nika or have Nika powers",
            "I love how amongst all the tradegy  6 years old bonney faced, she has the power of becoming whatever future she envisions herself. This is poetic.",
            "This chapter just proves, just like back in Wano, that a lot of OP fans can't read.\n\nWe literally dee Bonney turn Luffy into his old man self from the bad timeline.\nWe see her use a weaker version of the Muscle Muscle form in her \"Nika-like future\".\nWe literally see Bonney turn into a giant, an entirely different race.\n\nHow the hell some people are acting as if this came out of nowhere?\n\nBtw, each time, her power lasted for a very short time, far shorter than Luffy's so calm your panties powerscalers\n\n\n\nAlso, this moment isn't about a power up for Bonney. If you were actually paying attention, you'd see how connected Nika is to Bonney's family. How the idea of Nika finally setting them free was around from Kuma's childhood.\n\nBonney becoming Nika for a moment isn't a power up to day \"Bonney is top 5!!!\". It's a cathartic moment for her whole family and them finally being free from being slaves and victims of the WG.\n\nThat's why this is Bonney at her most free (and there is no one freer than Joyboy/Nika), why the flashback to Kuma talking to Ginny exists, and why Bonney heavily resembles her mother in her Nika form.",
            "How I see the \"Is Bonney OP and can she literally do anything and copy any fruit\" debate:\n\nBonney's distorted future is based on if she believes that future is possible. As she learns more about how things work her distorted transformations become more limited as she will no longer believe them to be possible. E.g. if she knew for a fact and she believed people couldn't grow an extra arm later in life, she wouldn't be able to distorted future where she had 3 arms.\n\nCan she copy any devil fruit power? This is unclear because we don't know if she knows people can only eat one devil fruit. If she knew this then she cannot believe in any future where she is using someone else's devil fruit powers (unless she also knows blackbeard has two).\n\n\"But what about Nika transformation, she is copying Luffy's DF powers\" Yes, we as readers know this, but Bonney would have to know this too. The only people we have seen talk about the fruit are the elders who know its the nika fruit and Vega Punk who said the gum gum fruit isn't in the old devil fruit books.\n\nLuffy isn't telling her \"This is just my gum gum fruit gear 5 form\", he is saying \"this is how i look when i am totally free\". It is entirely possibly in Bonney's child mind that there is a disconnect between this transformation and his fruit.\n\nNow back to the blackbeard thing I mentioned earlier: If she knows about Blackbeard having two powers then all bets are off. Nobody knows how he did this. Is it special to him because of his body, is it special to him because of his fruit or can anyone potentially do this? Without knowing the how but knowing someone has done it, this would open her back up to seeing a possible future where she has another power.\n\n\nSo to all the people saying \"can she just say give me a magma future and get lava powers\" I would say possibly but it's unclear, depending on what she actually knows about DF.\n\n And I wouldn't be shocked if an elder literally tries to tell her during the fight that she cannot be nika because of XYZ and possibly breaking that belief and forcing her to de-transform.",
            "People are missing the thematic nature of Bonney transforming into Nika. Her powers limit is her belief a future event could have ever happened. So with Luffy telling her that anything is possible she believed she could trully become free. In doing so she turned herself into the person who is the most free, turning herself into Nika. We have seen Bonney use her powers in similar fashion but she lacked the conviction to go all in until Luffy encouraged her. Now that she trully believes she can be Free she is able to become Nika. Powerscallers themselves put limits on characters which is the opposite of what Nika is about. He is the God of Liberation, the one who will free all the people's of the One Piece world from the yoke of the World Government. Bonney turning into Nika is but the first step towards a Liberated future."
        ]
    },
    "[Breaking News] Furuya Toru has resigned from voicing Sabo of One Piece (alongside his role in Detective Conan)": {
        "title": "[Breaking News] Furuya Toru has resigned from voicing Sabo of One Piece (alongside his role in Detective Conan)",
        "score": 241,
        "url": "https://www.oricon.co.jp/news/2332992/full/",
        "content": "",
        "num_comments": 30,
        "comments": [
            "**Context:**\n\nIn relations to the incident revealed on May 22nd which revealed Furuya Toru and his relationship with a woman of 37 years younger than him which involved physical assault, forced abortion and etc., Furuya Toru has decided to remove himself from voicing Sabo of One Piece and Amuro Toru of Detective Conan.\n\n>(No mention of what will happen to his future roles for Amuro Ray of any Mobile Suit Gundam related media such as the mobile game Mobile Suit Gundam U.C. Engage)",
            "And here i was hoping that Sabo vs Shanks could happen for shits and giggles. \n\n  \nSabo is voiced by Amuro and Shanks by Char's VA repectively.",
            "Looks like Imu successuflly bombed Sabo in the anime",
            "Now who's gonna voice Sabo now?\n\nHope they find a good replacement",
            "Yuki Kaji would be good for Sabo.",
            "Would be cool if they bring back Naruto’s VA for Sabo ",
            "What is this r/nba? We got VA free agency?",
            "Imu sama power extends beyond dimensions",
            "Sabo’s such a bit part character that I wouldn’t notice the difference. Also he looks like a snooker player in this photo.",
            "Just have Naruto VA voice old Sabo too! (not sure why they changed it when he did young Sabo)"
        ]
    },
    "The Name of The Ancient Kingdom is........": {
        "title": "The Name of The Ancient Kingdom is........",
        "score": 1882,
        "url": "https://www.reddit.com/gallery/1dlh3mr",
        "content": "",
        "num_comments": 175,
        "comments": [
            "Incomprehensible, take my up vote",
            "damn bro already cooking up a theory like this, it's not even a break week",
            "I'm curious, how much freaking time did it take to brainstorm / research / create the pics? Because holy shit.",
            "This actually makes sense and offers a very detailed explaination. The One Piece channels are likely going to eat this up.",
            "There’s so much research that went into this!\n\nAll in all, I’m most excited about the prospect of having Enel back in the story",
            "It’s been a long time since I’ve watched the skypiea saga but didn’t Bellamy mention “the emerald city” as one of those legends he was trying to mock as “untrue”?",
            "Skypie skippers in shambles..",
            "I won't read all of that, but here you have your Upvote hahah",
            "It's devil kingdom where devils fruit comes from",
            "If the one piece was Sweden I would ban Japan"
        ]
    },
    "What's so bad about this level?": {
        "title": "What's so bad about this level?",
        "score": 717,
        "url": "https://i.redd.it/xhx8f9xzi18d1.png",
        "content": "I've been thinking about this for a good while, but what is so bad about Level 6 in Impel Down.\n\nLevel 1 = forest with blade trees\n\nLevel 2 = wild beasts trying to eat you\n\nLevel 3 = desert where you starve to death\n\nLevel 4 = fire every \n\nLevel 5 = neverending winter\n\nYou can see why all these levels are absolute hell to be in, but I haven't seen anything like that in 6. Level 6 is the one that's closest to being just regular prison where your caged up and that's it. Is there a reason why or am I missing something? Please let me know.",
        "num_comments": 121,
        "comments": [
            "Most of them might actually get stronger if they were left on the upper levels",
            "They are strong enough to survive the other 5 hells pretty easily. Only torture that can be done is psychological, so they are trapped in a lonely cell without anything to do although the inmates won't care about the loneliness anyway.",
            "Irrelevance and obscurity is the main punishment, if you are locked up on level 6 you are erased from history and all of your influence on the outside world is (in theory) removed\n\nAlso, most of the level 6 prisoners are just too powerful and durable for the other levels to even serve as a true punishment to them",
            "No amount of torture is enough for maniacs",
            "Most ambitious pirates go there after passing through the other levels. Going to a place where you’re forgotten about is Hell itself when you have grand ambitions. Look at Doflamingo he can’t do anything to the world at large.",
            "The others are torture this one is just a place to dump the people you want the world to forget. The people who are down there aren’t really the type to really feel the punishment from the other floors anyway",
            "There are the most dangerous criminals in the world with life sentences or death penalty, this is a secret level and everyone who is there is \"erased\" from the world \n\nI mean, his punishment is loneliness, greater vigilance... etc.",
            "The upper levels have the mercy of a (somewhat swift) death. All there is to do in level 6 is wait, knowing that the world outside has forgotten about you entirely. Every aspiration, dream, goal was essentially for nothing.",
            "It’s basically a more extreme version of solitary confinement where you’re just waiting to die. Imagine spending the rest of your life in a room with nothing in it",
            "Some lunatic might break in and force you to fight with other insane people to get a chance to be his crewmate."
        ]
    }
}