{
    "r/OnePiecePowerScaling Discord Server: Hachinosu": {
        "title": "r/OnePiecePowerScaling Discord Server: Hachinosu",
        "score": 1,
        "url": "https://discord.gg/y8znwxZqM9",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "r/OnePiecePowerScaling Scan Server: Punk Records": {
        "title": "r/OnePiecePowerScaling Scan Server: Punk Records",
        "score": 1,
        "url": "https://discord.gg/ZTWGVyjV9v",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Zoro vs yamato. Who wins and what diff?": {
        "title": "Zoro vs yamato. Who wins and what diff?",
        "score": 175,
        "url": "https://www.reddit.com/gallery/1dqwmlc",
        "content": "",
        "num_comments": 138,
        "comments": [
            "#If you want to discuss One Piece Scaling, join [Hachinosu](https://discord.gg/qs7wHYZzRs).\n\n#If you want access to all kinds of One Piece Databooks/Information/Translations, join [Punk Records](https://discord.gg/ZTWGVyjV9v).\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OnePiecePowerScaling) if you have any questions or concerns.*",
            "Zoro picture is wild💀",
            "either way extreme.",
            "Extreme either way, it depends on if Yamato can survive KOH and Ashura.",
            "Yamato wins extreme diff she has better control with her coc haki, and a mythical zoan that give her power/durability amp with ice hax abilities.",
            "~~Zoro because of [this convincing post](https://www.reddit.com/r/OnePiecePowerScaling/s/jCFzuo2txz)~~ Yamato",
            "I think zoro is stronger at this point, wins extreme diff",
            "Yamato extreme diffs but leaves with lasting injuries/a potentially fatal scar.\n\nKeep in mind that Zoro is a swordsman. He doesn’t give you punches that you can shake off. If he cuts your ass, it’s sticking with you for a few weeks at minimum. Hell, we don’t really know how Lucci is dealing with his cut. At best he’s still conscious and talked to Mars.\n\nBut Yamato still wins. Better overall stats.",
            "Yamato high",
            "Onis are minorities, Zoro negs"
        ]
    },
    "How would kaido fare against Sanjis strongest attack": {
        "title": "How would kaido fare against Sanjis strongest attack",
        "score": 371,
        "url": "https://i.redd.it/mg1irw73cc9d1.jpeg",
        "content": "",
        "num_comments": 169,
        "comments": [
            "#If you want to discuss One Piece Scaling, join [Hachinosu](https://discord.gg/qs7wHYZzRs).\n\n#If you want access to all kinds of One Piece Databooks/Information/Translations, join [Punk Records](https://discord.gg/ZTWGVyjV9v).\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OnePiecePowerScaling) if you have any questions or concerns.*",
            "Takes it is slightly injured coughs blood or something laughs, complements the kick and then shit talks by saying that is nowhere near enough to take him down.",
            "It would make Kaido bleed but Kaido has crazy durability and a healing factor. Similar to luffy’s red roc. Sanji certainly can damage Kaido, but not serious damage without advanced conquerors haki.",
            "It would do as much damage as Luffy’s first Red Roc did.",
            "https://preview.redd.it/0b9xhoabgd9d1.jpeg?width=300&format=pjpg&auto=webp&s=a17fd4abb750abd730023491db08685d22900ca9",
            "In base, it does damage and potentially draws blood nothing insane but noteworthy. In hybrid, it still does damage (decently less) but it doesn’t draw blood, probably would go white eyed for a second come back and then OHKO him.",
            "https://preview.redd.it/i1cen9cnlc9d1.jpeg?width=828&format=pjpg&auto=webp&s=ec01ccacc3ee35001cb795d73c000b7e82818444\n\nWouldn’t give fuck",
            "Not advanced conquerors Haki. Not enough for serious damage. \n\nDoes as well as Luffy, Law and Kidd’s strongest attacks did when they didn’t use conquerors Haki or awakened devil fruits.",
            "Eats it no problem. Sanji doesn’t have anything to get past Kaidos durability.",
            "Sanji takes damage."
        ]
    },
    "\"Bonney received haki out of nowhere\"": {
        "title": "\"Bonney received haki out of nowhere\"",
        "score": 506,
        "url": "https://www.reddit.com/gallery/1dqkfig",
        "content": "Some people that read this story are unironically braindead. Why would Bonney, a captain capable of sailing the New World and a Worst Generation member NOT have haki, especially when fodder marines have it? Some people treat Armament like it's Conquerors, it's ridiculous.",
        "num_comments": 343,
        "comments": [
            "#If you want to discuss One Piece Scaling, join [Hachinosu](https://discord.gg/qs7wHYZzRs).\n\n#If you want access to all kinds of One Piece Databooks/Information/Translations, join [Punk Records](https://discord.gg/ZTWGVyjV9v).\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OnePiecePowerScaling) if you have any questions or concerns.*",
            "One piece fans when a worst generation captain attains an ability even random fodder have\n\nhttps://preview.redd.it/5ox6ib8wnb9d1.jpeg?width=1080&format=pjpg&auto=webp&s=816a39f5d0045555dd49346521451244a6a2e8fb",
            "Katakuri and Ace could use conquerors at a way younger age too",
            "I'm genuinely shocked people are making a big deal out of this. It's not as if she suddenly started using ACoC out of nowhere. Just regular old armament.. ",
            "Twitter mfs when a Worst Generation captain, the group considered prodigies in the world, has an ability possessed by unnamed marines and Beast Pirates.",
            "This is the same shit as idiots complaining about law getting to yc1+ \"immediately\". Do these idiots want every single character to get a training montage or something.",
            "Yeah, friggin' Bat-Man has haki, I don't get why Bonney having it is any shock at all. Yes, Bonney is young, but she still has 2+ years of experience on the seas, and a fruit which makes her age a non-factor.",
            "Bonney who made it to egghead, deep in the new world half of the grandline. No shit she has haki. That's like if someone complained about kaido not having haki foreshadowed",
            "The sad part is how half the straw hats don't have it\n\nhttps://preview.redd.it/ya1vlfxx0c9d1.jpeg?width=640&format=pjpg&auto=webp&s=a1073fdb4499fc3971a8c777b5130c11377f2cdd",
            "Bonney was literally a member of the Supernovas/Worst Generation, she had a bounty of 100 million and that was pre-timeskip, I don't understand why anyone would find it weird that she has basic haki"
        ]
    }
}