{
    "User Flair Update (Bounties & Rewards) and our Live Chat": {
        "title": "User Flair Update (Bounties & Rewards) and our Live Chat",
        "score": 20,
        "url": "https://www.reddit.com/r/OnePieceSpoilers/comments/1dpth9q/user_flair_update_bounties_rewards_and_our_live/",
        "content": "Hey! It's been 4 months (I think) since I made the Bounties & Reward system for you guys to have as user flair and since then 382 people have gotten one!\n\nI kept it low profile at first so the more active people would notice, and eventually more and more people did. I'm glad yall seem to like it!\n\nBefore I continue, let me explain for those who don't know what I'm talking about...\n\n# USER FLAIR\n\nYou can have one of these below/next to your username when you post or comment in the sub:\n\n[Bounty](https://preview.redd.it/rh29psc2k39d1.png?width=212&format=png&auto=webp&s=ae4f44951bb36502458f0d6c45a7ef4b48fe5d2c)\n\n[Reward](https://preview.redd.it/217ilxr3k39d1.png?width=215&format=png&auto=webp&s=6e55f5c4ae9e04322635ea30681704e784e72065)\n\nTo request:\n\n* **Desktop:** You need to go to the **User Flair** section that is below our sub's description and pick if you want a *Bounty (for Pirates)* or a *Reward (for Marines)*.\n* **Mobile:** Go to the sub's front page and then click on the **. . .** in the banner and then **Change user flair.**\n\n...or you can just ask for one in the comment below if you don't know how to do none of that. After you do it, I'll give your a bounty or reward when I get some free time.\n\nBounties are self explanatory, but Rewards are meant to mimic Cross Guild's system where each star is worth up to 100 million berries and each crown about 1 billion berries.\n\nI have a system I use to calculate a fair amount to everyone, but the most important part is how active you are in our sub, that's worth a lot.\n\nDon't worry if you start with a low amount, I'm planning on updating them once every 6 months, so you'll have time to participate and gain some reputation before the next update.\n\nAnyways, it's time to update everyone who picked one from the beginning until recently! The next time will be on **January 2025.**\n\n# LIVE CHAT\n\nI wanted to use this opportunity to let yall know that we have a live chat too! I created it about a month ago and also kept low profile to see who would notice, and up to now 15 people did XD\n\nI nicknamed it \"Nooticer's Chat\", and it's a bit dead... So if you wanna talk to everyone, check it out: [https://www.reddit.com/r/OnePieceSpoilers/s/A2tOiyRdYD](https://www.reddit.com/r/OnePieceSpoilers/s/A2tOiyRdYD)\n\nThis chat feature is not fully released yet so it's why people who use desktop have no idea.\n\nOn mobile you can go to the front page of the sub and you'll see **Chats** next to Feed:\n\nhttps://preview.redd.it/ndntshj9l39d1.png?width=760&format=png&auto=webp&s=1d616e3d05f2d7a04172171e332188cc178ad264\n\n...I believe that's all. Let me know if you have any issues.",
        "num_comments": 57,
        "comments": [
            "Look Ma, I made it to the big post!",
            "ngl this is one of the best thing on this sub.\nit makes me want to be active to get a high bounty",
            "Would it be possible to have them auto update as you gain or lose karma in this sub? That seems like it would be a lot easier for the mods since it would be totally hands-off.",
            "Thanks for my bounty! I hope to increase in time as my infamy grows!",
            "https://preview.redd.it/gftt5cg8x49d1.jpeg?width=736&format=pjpg&auto=webp&s=201e8039c6c8c0e6d3d9aa7493f304ff7d85e85d\n\nCan i have my GOAT'S bounty !!!",
            "I want a bounty too :(((",
            "They’re a great deal of fun, and a nice way to feel included!",
            "I’ve seen communities where you can make your own flair so I thought people were just assigning themselves these bounties lol!",
            "One of the best things about this sub! Was surprised mine in millions :) feels good ngl",
            "Can I have ovens bounty"
        ]
    },
    "Revenge taken successfully?": {
        "title": "Revenge taken successfully?",
        "score": 209,
        "url": "https://i.redd.it/9ecv63e2xb9d1.png",
        "content": "the ancient robot lost his left horn prolly when it attacked the holy land 200 years ago and looking at how strong warcury is compared to the other elders it is most likely that it was him who did the horn breaking blow. Also emeth showed just how powerful he is by kinda knocking out (look at his eyes) warcury and breaking his horn.  I wonder if warcury can regenerate the loss ",
        "num_comments": 14,
        "comments": [
            "I think Warcury will absolutely regenerate next chapter, no reason he shouldn't imo. It's not like Emeth is using some special unknown power or anything.",
            "Can we just acknowledge how strong this robot must be to damage Warcury like that when it can’t even use Haki?? Like didn’t gear 5 Luffy punch him in the dome and it didn’t do a damned thing?",
            "If true this would be very satisfying",
            "Emeth had been around for a long time. He might have knowledge on how to damage the gorosei.",
            "Has done more than Dragon \nCount #1",
            "he'd only regenerate **if** emeth let's him to. imagine a barrage of those punches! bro would cook the pork out of warcury",
            "G5 Luffy punched his nose, with haki, and his hand was hurting while he was crying \n\nInsane",
            "800 y old power!!!!",
            "That's not really how regeneration works. Unless he stops the regeneration, it will keep happening, he will just need to regenerate from more damage.",
            "He used basic haki. He had a similar reaction when he first fought Kaido without the knowledge of Ryou and Adv Conq"
        ]
    },
    "Now that 4 vegapunks are dead, do yall think Lilith and Atlas are gonna make it?": {
        "title": "Now that 4 vegapunks are dead, do yall think Lilith and Atlas are gonna make it?",
        "score": 143,
        "url": "https://www.reddit.com/gallery/1dqlt1a",
        "content": "Interesting how only the \"negative\" qualities of vegapunk are the ones who survived in the end, \"greed\", \"evil\" and \"violence\"",
        "num_comments": 50,
        "comments": [
            "atlas and york gonna make it for sure\natlas (05) and york (06) \nGO-MU. bec why not?",
            "One of them will no doubt.\n\nI'm expecting it to be Lilith.\n\nEspecially considering she really would be the only \"Vegapunk\" around like it was implied at her initial introduction if she ends up as the only survivor.",
            "Sabaody - Kuma\n\nIW - Bon Clay\n\nWhole Cake Island - Pedro (and kinda Jinbe/Pekoms/Germa)\n\n\nAtlas going back makes me think she might stay... It would be weird if one of the Vegapunks doesn't get out of the island alive, honestly. Vegapunk's dream is the energy thing, so I was thinking one of the satellites could inherit his dream/will.",
            "Lilith seems more like the survivor of the two, especially after Atlas’ weird line in the last chapter.",
            "Lilith just feels right to survive (if they’re not all brought back in a cover story) atlas could go either way and not surprise me tbh. I can easily see her being Lilith assistant or the likes if Lilith becomes the “main”",
            "Edison is dead? I know he wasn't doing so hot but I don't remember seeing him die?\n\nEdit: I think he is just desynched from Punk Records which is why York thinks he is dead, unless he got off paneled by someone",
            "Okay, so I've been a proponent that only one Vegapunk is gonna make it out alive. I still posit that Edison is currently just offline and that he will blow himself up at the same time as York, so that she meets punishment for her actions. Used to think the Gorosei would kill her in blind fury but they keep being levelheaded and reminding themselves to exclude her. \n\nWas starting to doubt only one would make it out alive last week since the ships are starting to set sail, and then Atlas gets off the ship and puts herself in harm's way. So I'm gonna say that Lilith will be the one to make it out alive.",
            "ATLAS IS TOO CUTE TO DIE.\n\nPLEASE NO\nPLEASE NO\nPLEASE NOOOOO",
            "From the start I believed Lilith would be the last “good” Punk while York goes to the enemy side. She’s the Vegapunk with the most standout personality and was introduced to us first, her being represented of “evil” characteristics was just a red herring. As well as York initially being perceived as only being useful for bodily functions, “desire” is an attribute that can lead one down a dark road. The other Punks were designed to be throwaway machine based clones, while Lilith and York seem to be organic beings (exception being maybe Shaka for his face and body are obscured).",
            "Waiting to see that the big Vega-brain can just pop out more into new bodies or something. Also interesting on York choice of words “…who’s still interfacing with punk records…”. I’m thinking one or more simply are “offline” right now"
        ]
    },
    "What kind of Powerup should Buggy Get ": {
        "title": "What kind of Powerup should Buggy Get ",
        "score": 11,
        "url": "https://www.reddit.com/r/OnePieceSpoilers/comments/1dr38ol/what_kind_of_powerup_should_buggy_get/",
        "content": "Look I know Buggy is the classic Gag character in the series and doesn't get stronger\n\nhttps://preview.redd.it/u1nuvdecxf9d1.png?width=556&format=png&auto=webp&s=d9da911a16126f06dae0525be430267210135ddc\n\nBut Honestly I think he deserves one because well Buggy is somebody I feel could really change the story with his power and determation ",
        "num_comments": 10,
        "comments": [
            "Could see his fruit awakening could probably make him near unkillable by conventional methods.\n\nI think it fits his tone to not get stronger but just become annoyingly unkillable",
            "I think Buggy will at least get a little bit stronger. I’m hoping he’s at least at a high enough power to go against Usopp. \n\nI think unlocking conquerors haki or a fruit awakening are both possibilities for him.",
            "he'll just have his usual luck luck no mi and perhaps the most broken awakening",
            "His power up going to be proper looney tunes level. Like he isn’t just the clown but the entire circus. I think that will be fun and in character with buggy and oda.",
            "Split himself into tiny dust particles and fill the opponent's lungs.",
            "I hope none. I want this man to become pirate king on pure rizz.",
            "I’m still convinced he’ll eventually be able to split the atom for the ultimate buggy bomb",
            "Everyone thinks they are yonko till the clown starts using nuclear fission.",
            "Buggy will become the strongest swordsman since he will be able to cut even air. Zoro is screwed",
            "Buggy ball infused with advance conquer haki 😈"
        ]
    },
    "So Emeth is Hebrew. What if D is Hebrew too?": {
        "title": "So Emeth is Hebrew. What if D is Hebrew too?",
        "score": 46,
        "url": "https://www.reddit.com/r/OnePieceSpoilers/comments/1dqqj9i/so_emeth_is_hebrew_what_if_d_is_hebrew_too/",
        "content": "Maybe D means Dror? Which means freedom? And the Will of D. is actually the Will of Freedom? So that family of D is Natural Enemy of God?",
        "num_comments": 34,
        "comments": [
            "You should add to your theory that the ancient kingdom is the Kingdom of David",
            "(Can we make circumcision jokes?)",
            "We are going to spent tons of theories next week and wait for the next one.",
            "Alright you cooked for sure man I like this a lot",
            "My favorite will of D theory so far",
            "Certified chef",
            "!RemindMe 1 year",
            "D for David. G for Goliath",
            "Not possible, then it’d be Dbrew.",
            "Monkey David Luffy LOL"
        ]
    }
}