{
    "r/OnePiecePowerScaling Discord Server: Hachinosu": {
        "title": "r/OnePiecePowerScaling Discord Server: Hachinosu",
        "score": 1,
        "url": "https://discord.gg/y8znwxZqM9",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "r/OnePiecePowerScaling Scan Server: Punk Records": {
        "title": "r/OnePiecePowerScaling Scan Server: Punk Records",
        "score": 1,
        "url": "https://discord.gg/ZTWGVyjV9v",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Who wins?": {
        "title": "Who wins?",
        "score": 92,
        "url": "https://www.reddit.com/gallery/1dr7q7v",
        "content": "",
        "num_comments": 87,
        "comments": [
            "Kaido should win this UNLESS the Gorosei's regen is actually unbeatable which leads into an infinite fight of Kaido showing Warcury into the deep ocean or under the Earth's crust only for him to come back after some days.\n\nI guess Kaido could possibly put Warcury in LEO too which would lead to Kaido winning.",
            "Kaido uses his weapon like a baseball bat and sends  him to the moon",
            "Oda wins, he gets to stretch their fight for 50 chapters",
            "When it’s a 1v1 put your money on kaido",
            "Depends on how you turn off the regen, but Kaido has better stats.",
            "Kaido wins either by dropping him in the ocean or figuring out how his hax works.",
            "Kaido turns Warcury into War-Curry",
            "Kaido could simply tire warcury out. And then chuck him deep into the ocean, so the water pressure stops him from moving and teleporting himself out. He’d be like bootstrap bill, from potc",
            "Kaido has a bigger AP, but if he doesn't know how to deal with the hax, then is a victory for the bar",
            "Kaido clears that regen merchant base form"
        ]
    },
    "What do you think the secret is behind Mihawk's black blade?": {
        "title": "What do you think the secret is behind Mihawk's black blade?",
        "score": 31,
        "url": "https://i.redd.it/s993nlmrth9d1.png",
        "content": "",
        "num_comments": 54,
        "comments": [
            "Armament haki and a spiritual bond with his blade",
            "premium black paint from home depot mixed with lemons",
            "Think about what Ryuma, Mihawk and Zoro have in common, but not present with Roger, Shanks, and Rayleigh.",
            "Just to look different from the rest. I’ll leave Oda to come up with some bs for it.",
            "It can control everything black in this world",
            "My brain that has straight up dipped in CN novels lately: Sword Intent.",
            "That Yoru like other swords and Zoan fruits have a will of their own and will only become a black blade once it truly recognises it's wielder and forms a bond / contract with them.\n\nThis could also explain why stronger characters don't possess black blades as they could as opposed to viewing their swords as a partner they view it as a tool to do their dirty work.",
            "Sexual attraction to the blade",
            "Being the greatest swordsman of all. ",
            "Minority hunter zoro is close to his own black blade, once u kill enough minorities/black people the  black blade is unlocked."
        ]
    },
    "\"Mihawk was the strongest in Marineford bro\"": {
        "title": "\"Mihawk was the strongest in Marineford bro\"",
        "score": 23,
        "url": "https://www.reddit.com/gallery/1dra7i3",
        "content": "",
        "num_comments": 41,
        "comments": [
            "It's funny, because I would definitely put him above all the others in a ranking, but the Marineford performance was just so unimpressive that it feels very wrong to call him the strongest there.",
            "Did you just argue that Luffy was stronger than Mihawk in MF?",
            "Mihawk was never the strongest, if you title scale WB is above him. If you don't title scale everyone and their mother is above him.",
            "Shirano stans.... why do you exist?\n\nMihawk got drip and is cool, but.... come on guys",
            "Nobody unbiased would say that he was the strongest in MF",
            "I feel like he himself did not want to be at marineford to begin with. Just throw a few slashes here and there and dip. He seems pretty lazy to me but still very strong.",
            "Even before opening the post. Only two people that could make this post, came to mind😂",
            "Why is the first scan you use Shanks and his ENTIRE crew? Ofc Mihawk wouldn't be stronger than an ENTIRE yonko by himself. And btw who is arguing that Mihawk was the strongest individual at MF? I thought the general consensus was that Old Garp and Old Whitebeard (pre squard stab) were the two strongest?",
            "Mihawk was playing friendlies \n\nEveryone else was playing competitive ranked",
            "WB was the strongest. (Though he was on the decline and couldn’t use his power fully). Mihawk was a close second."
        ]
    }
}