{
    "Essential information about safety, privacy and how to avoid scams- New wiki page": {
        "title": "Essential information about safety, privacy and how to avoid scams- New wiki page",
        "score": 1408,
        "url": "https://www.reddit.com/r/onlyfansadvice/comments/spz2wn/essential_information_about_safety_privacy_and/",
        "content": "Hello r/onlyfansadvice members 💛\n\nI have created a new wiki page that covers some essential information about privacy, safety and potential scams for creators or those considering becoming an onlyfans creator. You can access the full page here: [https://www.reddit.com/r/onlyfansadvice/wiki/index/safety](https://www.reddit.com/r/onlyfansadvice/wiki/index/safety)\n\nThe topics covered are:\n\n(The direct links might not work on the Reddit app but you can just scroll through to the different sub topics). \n\n* [The implications of onlyfans on your privacy and security.](https://www.reddit.com/r/onlyfansadvice/wiki/index/safety#wiki_the_implications_of_onlyfans_on_your_privacy_and_security.)\n* [Privacy on onlyfansadvice.](https://www.reddit.com/r/onlyfansadvice/wiki/index/safety#wiki_privacy_on_r.2Fonlyfansadvice.)\n* [Reality check.](https://www.reddit.com/r/onlyfansadvice/wiki/index/safety#wiki_reality_check.)\n* [Mental health.](https://www.reddit.com/r/onlyfansadvice/wiki/index/safety#wiki_mental_health.)\n* [How to protect your privacy.](https://www.reddit.com/r/onlyfansadvice/wiki/index/safety#wiki_how_to_protect_your_privacy.)\n* [Can I hide my sex work from my real like peers?](https://www.reddit.com/r/onlyfansadvice/wiki/index/safety#wiki_can_i_hide_my_sex_work_from_my_real_like_peers.3F)\n* [Content Leaking.](https://www.reddit.com/r/onlyfansadvice/wiki/index/safety#wiki_content_leaking.)\n* [What you can do about piracy:](https://www.reddit.com/r/onlyfansadvice/wiki/index/safety#wiki_what_you_can_do_about_piracy.3A)\n* [Common Scams](https://www.reddit.com/r/onlyfansadvice/wiki/index/safety#wiki_common_scams)\n\nHopefully creators and would be creators will find this an honest and informative analysis of the dangers of this industry and how to best protect yourself. Please let me know if you think I have missed any important safety or privacy information here. I have more wiki pages coming soon including some FAQs and other essential information for new and established creators.",
        "num_comments": 562,
        "comments": [
            "AMAZING! Newbies, please pay close attention to all of this info. You are all going to ask ALL of these questions at least once and then multiply that by how many new girls we get in here monthly. This guide will clear up our sub for other questions and more help! Plus you will not have to learn the hard way.  Thank you so much!  Oh and if it sounds too good to be true? It fucking is a scam!",
            "Damn. Summarized what I've learned the hard way in 7 months. Excellent, thank you!",
            "This is a phenomenal guide! Newbies, pay attention—this is super valuable info!",
            "This is so great thank you !",
            "Great post! And it's good to see you back Sansa :)",
            "Thank you sooo much for your advice. All of you girls are the reason us newbies can learn and enter this crazy world. XOXO.",
            "With banks requiring so much information because of the patriot acts knc rules, what is the best way to anonamize your payment account. Is it even possible?",
            "is this info accurate as of 2024? doing my research now as i prepare to launch so i want to make sure what I’m learning here is still relevant 🖤",
            "Excellent straight out advice, telling how it is. In today's times and the way things are. This page is so important and it's going to help so many people, well done most real beneficial page I've seen so far.",
            "Thank you so much! This was really helpful! I'm just learning, so much good info! love you thanks x"
        ]
    },
    "About the new Top creator user flairs and how to verify for one": {
        "title": "About the new Top creator user flairs and how to verify for one",
        "score": 44,
        "url": "https://www.reddit.com/r/onlyfansadvice/comments/1bq64jn/about_the_new_top_creator_user_flairs_and_how_to/",
        "content": "Following on from [my post](https://www.reddit.com/r/onlyfansadvice/comments/1bpvdij/12_things_every_of_creator_can_relate_to_which/) yesterday, the feedback was very positive so I will be going ahead with the new flairs for creators who are in the top 2.5% and above.    \n    \n**This will be split into two tiers:**    \n    \n⭐️ Established creator ⭐️    \nThe requirements for this flair will be that you are between 0.9 -2.5%    \n  \n\n🏆 Top creator 🏆    \nTop creators are required to be 0.8% and below.    \n    \nSome people pointed out that there is a large jump between incomes for someone say 2.5% compared to 0.9% or 0.8% to 0.08% etc. This is true however for the purpose of not overcomplicating things, I think these tiers adequately get across whether someone is making a very decent income on onlyfans and those that are far exceeding a standard income. It's also worth considering that not everyone wants others to know their exact % or income. If individual creators wish to disclose their specific % or income they can do so.    \n    \n**How to verify for one of the new creator flairs:**   \n\n\n1. Fit the requirements stated above\n2. Add the emojis ⭐️🏆 to the end of your onlyfans bio. (This can be removed once verified).\n3. Write the day's date on a piece of paper along with r/onlyfansadvice and your reddit username. Scrunch the paper up then flatten it out again. Hold the piece of paper up and take 2 photos, one facing the camera and one in profile. Nudity is of course not required, however if you are a faceless creator it must be clear that you are the same person as in your content. \n4. Create a screen recording that shows you going from your onlyfans profile, navigating to statements from the side bar then showing the statements page with the %. Please do not make any cuts or edits to this.  \n5. Upload the photos and screen recording to imgur (or redgifs if NSFW).\n6. Send a [modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fonlyfansadvice) containing you onlyfans link and the imgur link to your selfies and screen recording.\n\nI will let you know once the flair has been assigned.    \n    \nPlease comment below if you have any questions.  \n\n\n&#x200B;",
        "num_comments": 20,
        "comments": [
            "Oooh I’m getting closer… I’m only 6% just came to say looking forward to making this a GOAL ☀️☀️",
            "Would we have the flair only for the OA subreddit? Is this being implemented in CA subreddit as well?",
            "What do you mean by “one in profile” for the two pics with the paper?",
            "Hi, I'm looking for the way to do normal verification. I submitted a few about a year ago and kept following up and resubmitting but never heard back. Is there a new page with instructions, I'm not able to find it in the sidebar.",
            "How do I make a post on this subreddit with a throw away if I need karma",
            "I was there in the beginning....but damn not any more and I need to get black there.",
            "Same but I’m 5%! 😂 I want a fun flair… 😂",
            "Yes the flairs will be active on r/creatorsadvice too.",
            "As in side on/ side profile x",
            "i have this same question! i would like to be verified but can’t find instructions to do so, and i’m just talking about the regular verification. is this not an option?"
        ]
    },
    "Let's talk about Reddit followers.": {
        "title": "Let's talk about Reddit followers.",
        "score": 8,
        "url": "https://www.reddit.com/r/onlyfansadvice/comments/1dr9tws/lets_talk_about_reddit_followers/",
        "content": "How many do you have?\nHow many are you getting per day ?\nHow is the conversion rate ?\n\nAre they even good for anything ?",
        "num_comments": 21,
        "comments": [
            "I hit the 12k yesterday and started to post on my own page since 5k with anything getting out of that. I know it’s not much, but it works pretty well for me. \n\n95% are still freeloaders though.",
            "Around 7, but  I haven't posted any photos here, yet. I have no idea what they are following me for. I exclusively use FetLife for promotions at the moment and not using reddit. 😅",
            "75k total, I get around 300 new followers a day. 15-20 paid subs a day, sometimes more, sometimes less. I think they are great for engagement. I get the same people comment and upvote my posts. I post to my profile every day (or almost every day) and try to engage them, often getting 1-2k+ upvotes on my profile posts. \n\nI think it helps to get better traction, as they get it recommended to them and then click on my profile and upvote/comment on whatever else I posted that day. I don't spam and always try to keep my promo content fresh.",
            "Reddit and Twitter/X are the biggest freeloading apps and are the worst for getting subs",
            "i’m at around 27k followers here and it’s my main promo platform which has taken me to around 6k on a free page and 540 on a paid page. \n\nreddit is great for promo but it takes a solid 3-4 months of consistency to get to the 120+ subs per day mark",
            "I’ve had fans that told me they enjoyed my content on reddit for years, til I stop promoting on there, so he had to follow me on onlyfan…That says a lot",
            "Your followers usually don’t see your subreddit posts unless they go to your profile. It only shows up in their feed if you post on your own profile",
            "Okay 20 promos understandable, but up to 100? A day? That's quite the grind. I'm scared and impressed at the same time. 😲",
            "Hey can I ask how you got about this because I created a OF account don’t know how to promote my page",
            "Yes you’re right sorry, very late where I am so my explanation is a bit wonky. \n\nI was meaning your followers who followed you from certain subs will see your post in those subs and in turn when you post on your profile your followers will go to your profile and upvote your other posts to fast track you to the hot pages, I kind of squished both scenarios together, my bad."
        ]
    },
    "Is it ever worth lowering you subscription $?": {
        "title": "Is it ever worth lowering you subscription $?",
        "score": 9,
        "url": "https://www.reddit.com/r/onlyfansadvice/comments/1dr7tu0/is_it_ever_worth_lowering_you_subscription/",
        "content": "Mine is $15/month but my subscriptions have been low for the past couple months.. I have some OGs who rebill every month but only abt 50-60% rebill each month typically. I offer 50% discount most of the time now for the first month now since I’m having trouble getting many new subs.. i have a couple that leave to go back to my free page and then try to get back in w a discount so I stopped allowing that for expired subs lol. I’ve considered lowering my sub price but I’m worried I will regret it.. I have some full length vids, and a lot of explicit clips and pussy pics on my wall.. and I’d feel really shitty if people were getting in for too cheap to see all that… I’d probably need to make some major changes to how I structured it if I lowered it and I’m not sure it’s worth the hassle.. Has anyone had any experience lowering their subscription price and how did that go for you?",
        "num_comments": 20,
        "comments": [
            "I have found most success in having a relatively inexpensive sub price that is constantly on sale to around $5 has been the sweet spot. I get rid of anything explicit on the page and only show semi nude, no spreading or anal. I then PPV everything else and also provide sexting, customs and private lives. Iv consistently made 5 figures every month for the last 6 months by doing this.",
            "I lowered mine on my VIP page and regretted it so I put it back up!! Keep prices high even when business is slow because if people really want to see you then they don’t care about price they care about how badly they want you and your content (idk if that makes sense lol)",
            "These comments are all helpful. I just bumped mine up from 11.99 to 14.99. I'm hoping my income doesn't tank. I do full spread and explicit on the wall but just pictures and mini clips. \n\nI know this isn't the best way to make a LOT of money but it's easier for me",
            "Definitely don’t lower! Just lower your sale price. I’m $14.99 but do 75% off sales and the rebills are so nice. I’ve considered lowering my sub price to $9.99 but then my rebills would be so much less.",
            "I was at 5.99 then bumped to 8.99.. it’s slow but I’m finally getting back up. Congrats to you all! This is hard work and you all do an amazing job!!",
            "Personally I reduced my OF from $14.99 to $10.99 and I got a lot more subs to that.\nI have a sale on constantly to entice potential subs.\nI’d rather have 100 subs at $10.99 than 20 subs at $14.99 - it’s easier to get more people subbing for a smaller price and it’s more money",
            "I started at $10 but always 50% off or more, then I just changed it to $6.66 and still 50% off. I haven’t promoted in probably 2 weeks and I’ve gotten more subs than I have in the 3 months I’ve had the paid page",
            "Dang I feel like mines high I got mine at $20",
            "My subscription price is $25 but every two weeks I offer a discount for 30 people at 85% off which makes its $3.75 \n\nI usually gain 30-50 subs off doing that. i then send out a locked ppv for $25 to all new subs. I make sure to say it’s a one time deal and lock tons of content behind it! So basically even with the discount at $3.75 I’m still making $23 from nearly every sub!",
            "I started at $14.99/mo and found i got the most subs when it was discounted down to $9.99/mo so I just lowered it to that and don’t seem to need to discount as much now."
        ]
    },
    "How does OF calculate top creator %?": {
        "title": "How does OF calculate top creator %?",
        "score": 3,
        "url": "https://www.reddit.com/r/onlyfansadvice/comments/1drck1p/how_does_of_calculate_top_creator/",
        "content": "Is it based on weekly earnings, total earnings, number of subs, engagement/reach etc? \n\nIn one day I earned maybe an extra $12 and jumped up an extra 20%. Just wondering what this percentage is based on and how it’s calculated.  \n\nThanks! :) ",
        "num_comments": 1,
        "comments": [
            "I notice if you make ANY money you’re immediately top 50-60%. Cause a lot of people open an account and never use it, or stopped. Then from there I have no clue, I’m like top 30% and need more than $5 tips to go up even 1%. The higher you climb to the top %, the more money it takes to tip the scale."
        ]
    }
}