{
    "Push30 2024 Discussion Thread": {
        "title": "Push30 2024 Discussion Thread",
        "score": 35,
        "url": "https://www.reddit.com/r/orangetheory/comments/1dg709l/push30_2024_discussion_thread/",
        "content": "Welcome to your 2024 Push30 Discussion Megathread!  In order to keep the sub organized and keep information centralized, all future Push30 discussions will be removed and redirected to comment in this Megathread.\n\n**What is Push30?** - It's a free 30-day challenge where participants can earn prizes at their studio for taking at least 12 classes and committing to 3 out of 7 daily habits for the 30 day period.  You can sign up on the app or at your studio, and your studio should have free paper trackers, however some subreddit members have made and shared tracker templates as well!  [Tracker 1](https://www.reddit.com/r/orangetheory/comments/1d59ja9/push30_custom_template_all_challenges/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) by u/haziiedaiisy | [Tracker 2](https://www.reddit.com/r/orangetheory/comments/1d95l7h/2024_push_30_challenge_google_spreadsheet_template/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) by u/toddersbud \n\nPush30 runs from June 15-July 14, 2024 at most studios (some studios may have a different date range).  You can only register at one studio, but you can take classes at any studio.  Orange 60, Orange 90, Strength 50, and Tread 50 classes all count.  Only one class per day will count.  *Prizes and eligibility for prizes will vary by studio.*  You can view the official promotion terms [here](https://www.orangetheory.com/en-us/promotion-terms).\n\nIf you need ideas for the \"nutritional opportunity\" challenge, u/bonniejo514 made an amazing list of ideas [here](https://www.reddit.com/r/orangetheory/comments/1ddlsx2/ideas_for_the_push_30_nutrition_challenge/).\n\nSince we can only have 2 pinned posts at any given time, the June monthly post had to be unpinned, but you can still find that post [here](https://www.reddit.com/r/orangetheory/comments/1d51dqc/its_your_june_2024_monthly_post/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button).  The key dates from that post are reproduced below for your convenience:\n\n**Key Dates for The Month**\n\n* **June 20 (Thursday):** Strong & Steady; signature workout.\n* **PLEASE NOTE:** Many international studios, especially Canada, and some US studios, may be doing **Marathon Month** in an extended 6 week format from June 17-July 31. Why longer than a month? Why not in August like usual? We have no idea.\n* Run/Rows 6/23, 6/25.\n* Switch templates 6/26.\n* Upright (Incline?) Bench on 6/19.\n* Low Bench on 6/25.\n* BOSU on 6/27.\n* Mini Bands on 6/23.\n* Medicine Ball on 6/26.\n* **Repeat templates are as follows**: 6/17 = 6/1, 6/18 = 6/2, 6/19 = 6/3, 6/21 = 6/5, 6/22 = 6/6, 6/23 = 6/7, 6/24 = 6/9, 6/25 = 6/10, 6/26 = 6/11, 6/27 = 6/12, 6/28 = 6/13, 6/29 = 6/16, 6/30 = 6/15. Yes, they do occasionally repeat out of order, we have seen this before.\n\n  \nHappy Splatting!\n\n- Your Modsquad: [u/lookie4dacookie](https://www.reddit.com/u/lookie4dacookie/), [u/jenniferlynn5454](https://www.reddit.com/u/jenniferlynn5454/), [u/pantherluna](https://www.reddit.com/u/pantherluna/), [u/neat\\_eggplant\\_8145](https://www.reddit.com/u/neat_eggplant_8145/) and [u/Rizzah319](https://www.reddit.com/u/Rizzah319/)",
        "num_comments": 55,
        "comments": [
            "One of the 3 daily goals I have selected is “no screen time at least 30 minutes before bed”  Thoughts on using a Kindle before bed?? I have the Kindle Paperwhite so it’s a very different screen than a phone or TV. \n\nI’m planning to run to the library soon to get a physical book, but I am a big reader, and wondering if I can use my Kindle or if you think that would count as screen time",
            "Where do I find the daily challenges?",
            "Is anyone else's tracker not showing up when accessing challenges  > push 30?  It shows that I have completed 1/15 classes and then is blank when I select \"share my tracker\".  Maybe it'll take a day to sync?  I can access last years and it has checkmarks for classes completed, along with the daily challenges. Thanks in advance for your help!",
            "My studio hasn’t said a word about push 30, is that not a thing consistently between studios?",
            "Question: for the 3 of 7 challenges do you “lose” the entire Push30 challenge if you don’t do all 3 ALL 30 days? I’m all for consistency and a real challenge but when establishing new habits, EVERY day seems quite strict.",
            "The app tracker doesn't work.",
            "Anyone doing a nutrition goal for their daily challenges? I’m finding it to be my hardest one, but maybe the most effective thus far! I’m trying to intake 5-10 fruit/veg servings a day. In about a week, I’ve met that each day but usually am at 5, most I’ve done is 6. For sure smoothies help, but I try not to rely on them and have only had two.",
            "On this push30 do the 3 objectives have to be the same all the way through? If I do the 7k steps a day and the mindfulness can my third one be different throughout the challenge",
            "My post got deleted for being duplicative sigh so jumping on this!  I picked veggies and protein for my goal and have thus far been more aware/better but still not hitting 5x. Not gonna lie but I don’t even have 5 types of/ servings of veggies in my fridge. I am embarrassed",
            "Is it 12 or 15 classes? I thought it was 12 but my app is showing 15…"
        ]
    },
    "Daily Workout and General Chat for Saturday, 6/29/24": {
        "title": "Daily Workout and General Chat for Saturday, 6/29/24",
        "score": 35,
        "url": "https://www.reddit.com/r/orangetheory/comments/1dr3i37/daily_workout_and_general_chat_for_saturday_62924/",
        "content": "Use this post to discuss today's OTF workout or other general topics. Please add details about the workout or your own commentary and don't forget to upvote comments containing the workout details to help us keep key info at the top!  \n\n[**Most Recent Tornado Templates**](https://www.reddit.com/r/orangetheory/new/?f=flair_name%3A%22Tornado%20Templates%22&restrict_sr=1&sort=new)\n\nTo find previous Daily Workout posts, look for [recent submissions by u/splat_bot](https://www.reddit.com/user/splat_bot/submitted/).  \n  \n[This post has been automatically generated]",
        "num_comments": 23,
        "comments": [
            "Should be an interesting day. Our studio is having a 10th anniversary celebration today and the coaches have apparently written their own template for the day! Just for showing up you get entered into a raffle for a cruise. I need a vacation so let’s go!",
            "3g is a definite 🪶! 14 minutes nonstop rowing that mirrors the tread builds. Goal is to get 2100-3500 total meters.",
            "Block 4 we did 3 times in our studio. The third one was the “finisher”.",
            "I needed this template this morning. It was great.",
            "Agreed. I did not come in today expecting to row 3000 meters. Plus our studio was having AC problems.  😅",
            "Click the “16th of June” link above in description and you will find the 3G format.",
            "It’s a repeat of June 16. 3G intel is posted there.",
            "Thank you so much! Although, now I kind of wish I hadn’t looked. I’m glad I saw your comment before class though so I can at least mentally prepare myself. That’s a lot of rowing without a break. I’m still going to go and do the hard thing . Hopefully they don’t have to wheel me out. LOL I’m going to start doing 3Gs every Saturday so hoping to build up my rowing stamina.",
            "Tysm. I’m still trying to understand everything that happens in these classes.",
            "Strength 50 was something like this:\n\nBlock 1 \nSingle dumbell lunge w rotation\nSingle dumbell deadlift\nKneeling woodchop\nKneeling tricep extension\n\nBlock 2 \nSingle arm snatch\nBicep curl to lunge\nChest press on floor\nBridge tricep\n\nBlock 3\n30 sec of squat to press ×4 (45 sec rest between sets)\n\nBlock 4\n30 sec knee tuck/30 sec sit up rotation (do this twice)"
        ]
    },
    "Progress!!": {
        "title": "Progress!!",
        "score": 51,
        "url": "https://www.reddit.com/r/orangetheory/comments/1dr2i8b/progress/",
        "content": "Something I used to think was impossible happened tonight: I ran a 5k race on a whim!  And I ran the whole time (no walking)!\n\nThis is all thanks to OTF!  When I started with OTF years ago, I could only manage power walking on the tread. I did that for a long time, then made power walking my base and a light jog my push. Then up to 4.5 mph as a base and, about 2 years later, I’m up to 5.2 mph as my base. But, today, when I jumped into the 5k, my pace was faster than 10min/mile (6mph)!  I guess I can up my base again!\n\nThis is all to say: if you’re like I was and feel like even a 4.5mph jog is too much, stick with it!  Progress takes TIME. It took me years, but OTF has made it fun and safe to progress at my own pace. Now I can jump into a 5k without any training past what I do 3-4 mornings a week at OTF. \n\nTHANK YOU!",
        "num_comments": 7,
        "comments": [
            "Congrats! This is so motivating. I started OTF two months ago, and I can only power walk right now due to being so out of shape. I usually try to do the one minute or less all outs as a jog at somewhere between 4.0-4.3 though. Your story is so inspiring!",
            "That's so great!  Congrats!!  I ran my first 5K race this year and now do it every week for the summer.  Once upon a time I would have shuddered at the thought of ~30 mins of timed, continuous running!\n\nOTF helps the most with *consistency*, and that is how to keep raising the bar for yourself!  Well done 🙌",
            "Good for you!  To me, this is a great way to see the impact that OTF has on your life outside of the studio. \n \nI started OTF as an overweight, unhealthy couch potato in 2015 and, after a break during the pandemic, two years ago I ran a half marathon with no training other than OTF.  Now, I don’t recommend that but I did it.  This year I ran a full marathon (with proper training).  OTF has changed my life, and convinced me I could do things I never believed possible.  I am a fan forever.",
            "Great start!  Keep at it!  The hardest part for me was getting myself to stop comparing myself to others - once I could really focus on my personal progress, every small .1 felt incredible!  I even remember, at the very beginning, feeling incredibly proud when I could simply power walk the whole block as it was coached instead of “cheating” with unplanned walking recoveries!  That was my first real progress milestone 😊",
            "Amazing!!  That’s so inspiring 🙌🏻",
            "I recently stated using 3% as my base and I was so proud that I stopped using 1%!",
            "Thank you!  And, agreed!"
        ]
    },
    "First month with OTF": {
        "title": "First month with OTF",
        "score": 4,
        "url": "https://www.reddit.com/r/orangetheory/comments/1drc2ge/first_month_with_otf/",
        "content": "Just completed my first month with OTF and I love it! I’m very active even before joining OTF so I started off with pretty good conditioning but even then I can see improvement in my fitness after just one month. I started off with base being 5mph and push around 6-7 mph with about 18 splat points. Just a month in and I can sustain base around 5.5-6 mph and push 7-8 mph with similar splat points. I’m finding the workouts easier each day which probably means I can keep pushing myself more. My target is to run comfortably at 7mph for base and 8-9 mph for push. ",
        "num_comments": 0,
        "comments": []
    },
    "Does anyone else call it just… “orange?”": {
        "title": "Does anyone else call it just… “orange?”",
        "score": 29,
        "url": "https://www.reddit.com/r/orangetheory/comments/1dqzl5a/does_anyone_else_call_it_just_orange/",
        "content": "2+ years ago I saw someone post on here asking if people ever call OTF just “orange.” 99.9999% of the answers at the time were no. Still, at the time it inspired me. Now I call it orange both in text and conversation. It started somewhat as a joke but now it’s just my default.\n\nI.e, I text or say to my husband “I’m going to orange” \n\nAnyone else??? ",
        "num_comments": 92,
        "comments": [
            "I just call it OTF \n\nGoing to orange sounds so funny",
            "My dad. Are you still doing Orange? 😅",
            "I call it OTF. My mother calls it Orangetherapy",
            "Yes, me and my OTF buds all call it Orange.\n\nFirst thing I ask my coworker every morning - “did you orange yesterday?”",
            "I say Im going to 🍊 to my husband",
            "I just say I’m going to the gym or I’m going to workout. I never say OTF or OT or Orange.",
            "I do, yes. So much easier than OTF or orangetheory and  everyone around me knows what I'm talking about.",
            "I prefer “The Big O”",
            "I call it gym 🤣",
            "Yes I call it orange most of the time"
        ]
    }
}