{
    "What is the Sub Reading This Week? June 24th - 30th": {
        "title": "What is the Sub Reading This Week? June 24th - 30th",
        "score": 6,
        "url": "https://www.reddit.com/r/OtomeIsekai/comments/1dn4kdd/what_is_the_sub_reading_this_week_june_24th_30th/",
        "content": "This thread is so anyone can post about what they've been reading, whether it's new chapters, binging or catching up to a series, etc. It's about your opinions on what happened and expressing them here for others to join the conversation. Make sure that any spoilers are covered so that others who haven't read that chapter don't get spoiled (Rule 5). \n\nWe no longer post chapter update links due to DMCA and copyright crackdowns. We have for you here the [full post](https://www.reddit.com/r/OtomeIsekai/comments/t1zyn6/farewell_hex10n_no_more_chapter_update_links_on/) for more information.\n\n**Please put the approved websites you're reading the chapters on. Others may check it out too!**\n\n***Rules:***\n\n* No Link Posts for chapters.\n* Comments can have links to officially licensed sites.\n* Comments can have series numbers, reference numbers, or partial URLs (e.g. \"I found this series on mangadex, it is title/61b0d21c-b703-4999-910d-ebffc44791bb/\"). This is subject to change pending harsher copyright crackdowns.\n\nYou can create a Text post for discussion on the sub, you cannot create a link post. The thread title should be in this format:\n\n\"*\\[DISC\\] Series Title - Chapter Number*\" The post will count as your post of the day as stated in (Rule 4). Spamming posts \\[DISC\\] threads for chapters, even at a daily rate isn't recommended. \n\n\"*\\[New Series\\] Series Title*\" [example 1](https://www.reddit.com/r/OtomeIsekai/comments/t3vqaa/new_series_the_max_level_princess_is_bored_today/) or [example 2](https://www.reddit.com/r/OtomeIsekai/comments/w9vum1/new_series_you_wont_kill_me_this_time_crown_prince/) is the format desired, you may use it as a template of what your post should look like. If you are unsure if a series counts as Otome Isekai, please send us a [modmail](https://www.reddit.com/message/compose?to=%2Fr%2FOtomeIsekai) for approval. **A** **series description needs to be added to the body of the post.**\n\nThe mod team must approve any other sites, otherwise, it will result in your comment being removed. This prevents malicious ads and malware from moving to other peoples' devices.\n\n***List of approved sites:***\n\n    Mangadex              Bato             J-Novel Club              \n    Asura Scans           Kai Scans\n    Scylla Scans          Temple Scans       \n    Gourmet Scans         Flame Comics\n    LSComic               Reaper Scans\n    Tritinia Scans        Webtoon\n    Lezhin                Manta\n    Tapas                 Tappytoon\n    Pocket Comics         Manga Up! \n    Comikey               Inker\n    Cosmic Scans          Manga Plus\n\n[Last week's thread](https://new.reddit.com/r/OtomeIsekai/comments/1dhp8z5/what_is_the_sub_reading_this_week_june_17th_23rd/)",
        "num_comments": 12,
        "comments": [
            "**I Quit Being The Male Lead's Rival** (novel)\n\n\nIt’s a very neat story where everything ties into itself and wraps up nicely. I just read the novel because the newly-released manhwa is quite tragic and I could tell a good story was hidden under the disappointment. \n\nI liked that the protagonist recalled her past life rather than a possession plot. She didn’t turn into a different person overnight, instead the realization just put her actions in perspective. It was quite comedic in a deadpan way and the romance between the leads is cute. I really appreciate how straightforward they were about their feelings leaving no room for silly misunderstandings. Also love a proactive, strong, and sensible female lead. The male lead is a boring, strait-laced guy and everyone constantly makes fun of him for it.",
            "I finished reading [My secretly hot husband] (I'd read s1 before, but not s2). I must admit, I was got so invested in the story. With many OIs I've read s1 feels like a masterpiece, but in s2 things start to fall apart or drag on. Not with this one. Honestly I loved s2 more than s1 (s1 was very hilarious, and in s2 the plot just got so much more interesting that I can't help but love it more). The ending was satisfactory, and I was happy that side characters were also important in the plot.",
            "Just started \"Revenge of the real one\", that has finally a scheming, revenge-driven protagonist. It's so hard to find one of these across all the good-natured discriminated ones!",
            "Finally got around to finishing \\[Glass Wall\\]. Never thought a story could shove its own development down the drain more spectacularly than \\[For Better or For Worse\\] but I stand corrected.\n\nIn hindsight it’s kinda impressive how similar these two manwhas are: both had well-written and realistically flawed leads, engaging dialogue and period-accurate fashion that made them stand out compared to their peers but lost these qualities around the 80-chapter mark in favor of nonsensical conflict and manufactured drama.\n\nS1 & 2 were heartwrenching, while S3 had me rolling my eyes at how contrived the “drama” was—the beauty of the earlier chapters wasn’t the angst itself but how realistic it all was; both the leads made mistakes but they were in-line with how the author had established their characters’ up til that point and so their missteps felt like a natural consequence of two people with their personalities interacting with each other rather than shoe-horned angst. S3 on the other hand had a guy burst in with a gun on the FL’s head in front of a crowd as the author couldn’t come up with another way to make the ML’s sister forgive her (yeah the FL jumps in to save her, sister is impressed by her selflessness and decides to make up), except none of the (at least 50) witnesses to an *attempted murder* mention wtf happened?? And that guy just walks out unscathed?? The season is chock full of similar “wtf author?” moments which was a dang shame because I loved literally everything else.\n\nAnyhow I still like the story and would recommend it to someone else (yes the first two seasons are that good) but those last 20 chapters or so dropped it from my Top 5 historicals to like…top 10 or 15 or smth (which also happened with \\[For Better or For Worse\\]).\n\nTLDR; it would’ve been a 10/10 had it ended 20 chapters ago, but it didn’t.",
            "Anyone got a manhwa/novel which a MC runs away? I've read all the famous manhwa and novels and i want to read those hidden gem where MC runs away, either pregnant or not, and never comes back or had be dragged back.",
            "I haven’t really been reading since the start of this year, what are some recommendations of any new stories or updated ones I should read?",
            "**Not Sew Wicked Stepmom** season 3 finale cliffhanger is so evil 😭 I get why they ended there, but also the PAIN!",
            "I need to talk to some or anyone about Charlotte’s Wheel. Is she an unreliable narrator, unhinged, or suffering from a victim complex? What is going on? Some parts are little hard to follow because it seems to jump or maybe have taken place before she went back in time. I don’t know how to fell, but I’m so intrigued.",
            "CIERRA  \nStatus: Completed (66 chapters)  \nWtr: Webtoon (daily pass)\n\nhttps://preview.redd.it/3c55vsreg39d1.png?width=720&format=pjpg&auto=webp&s=6a21108a93248fae75735b13036fdf6e4050f770",
            "**Cinderella Disappeared**\n\nIt's still pretty early on, about 30 chapters. I don't see MC returning unless circumstances are contrived greatly. Or put another way, MC probably won't return emotionally ever, but plot wise it's all up in the air."
        ]
    },
    "Cover for New Series \"You Turned Off the Pain Setting?\"": {
        "title": "Cover for New Series \"You Turned Off the Pain Setting?\"",
        "score": 468,
        "url": "https://www.reddit.com/gallery/1dqukgl",
        "content": "",
        "num_comments": 37,
        "comments": [
            "she has homophobia in her eyes!",
            "Is this yuri??? And the FL has pink hair and a cat??? Oh I am so interested in this 👀 \n\nIs there a novel? Is it any good?\n\nEdit- lol I didn’t read the captions, I see now that there is a novel. My other question remains tho, opinions on quality?",
            "That third image is bait, you're not gonna fool me Korea!",
            "She's Lebanese??",
            "It's one of the most intriguing 1st chapter I've ever read 👀",
            "Does anyone know where/if the novel is translated? The MC is so pretty!",
            "DO I SMELL YURI???",
            "SAO ass looking premise\n\n^(in a good sense)",
            "Her left eye is red in the manhwa cover and her right eye is red in novel cover 🤷🏻‍♀️",
            "Welcome back feng qi cang lan"
        ]
    },
    "What OI has this dynamic?": {
        "title": "What OI has this dynamic?",
        "score": 1390,
        "url": "https://i.redd.it/f1vauqs40b9d1.png",
        "content": "",
        "num_comments": 109,
        "comments": [
            "Not OI, technically, but Apothecary Diaries has this in spades",
            "More flirty FL:\n\nGinger and the cursed prince\n\nHappily ever afterwards\n\nSide characters deserve love too\n\nI thought I didn't have long to live!\n\nMore Flirty ML:\n\nThe broken ring: this marriage will fail anyways\n\nI will politely decline the male lead (kinda)\n\nSynrix the villain healer\n\nVillainess Maker\n\nLittle Rabbit and big bad leopard\n\nI will become the villain's poison taster",
            "Any of the ones where the fl is a huge ml stan from their past life",
            "for my derelict favorite",
            "Lots\n\nML (left)\n\n• Observing Elena Evoy \n\n• The Broken Ring \n\n• Cross My Heart, Hope to Die \n\n• Baroness Goes on Strike \n\n• I Married the Male Lead's Dad \n\n• Falling for the Enemy \n\n• The Tyrant Wants to be Good \n\n• A Martial Master Wakes up as a Concubine \n\n• The Heiress's Double Life \n\n• The Rewards of Marriage \n\n• The Lady and the Beast \n\n• Father, I don't Want This Marriage \n\n• Beware the Villainess \n\n• Empress? Empress! \n\n• I Swear We're Just Friends \n\nFL (left) \n\n• Until The Tragic Male Lead Walks Again \n\n• Happily Ever Afterwards \n\n• Side Characters Deserve Love Too \n\n• Villain with a Crush \n\n• The Crow's Prince \n\n• Ginger and the Cursed Prince \n\n• For My Derelict Favourite \n\n• How to Break Up in a Romance Simulation \n\nBoth: \n\n• My Secretly Hot Husband \n\n• Please Marry Me Again \n\n• >!My Reason to Die!< \n\n• A Villainess for the Tyrant \n\n• June Peach",
            "Immediately thought of Apothecary Diaries but that’s not OI lol. Remarried Empress isn’t OI technically but it’s villainess themed.",
            "Isn't this literally Carcel and Ines 😂",
            "SushiTea already mentioned this one but for emphasis: I Swear We're Just Friends! ML on left, FL on right. Kar is a huuuuuuge simp for Rienne and she's just oblivious.",
            "[edited] Here's what I know of the ML flirting\n\n1. Remarried Empress  \n\n2. Fell Into the Arms of a Mad Villain  \n\n3. Who kidnapped the empress?  \n\nThese are what i can remember 😂",
            "Not an OI but this meme template reminds me of that Frieren blowing Himmel a kiss scene."
        ]
    },
    "Am I the only one who notices how little media literacy some readers have?": {
        "title": "Am I the only one who notices how little media literacy some readers have?",
        "score": 228,
        "url": "https://www.reddit.com/r/OtomeIsekai/comments/1dqrj0g/am_i_the_only_one_who_notices_how_little_media/",
        "content": "It’s insane to me how people drop manwhas/novels only because characters in it are evil/annoying. They really don’t understand the difference between a badly written character and one doing bad things on purpose. Does anyone get what I mean??",
        "num_comments": 92,
        "comments": [
            "I like when someone is shown doing “something” off screen that isn’t revealed and like flashing an evil grin and the top comment is “idk guys I think Petrangelo is up to something, did you see him do the thing?” \n\nLike yea that was the climax of the chapter it’s hard to miss.",
            "Whenever I see posts about reading comprehension, I immediately remember all of the Tumblr Discourse ™️ days. And of course, this gem:\n\nhttps://preview.redd.it/mv8etjrdcd9d1.jpeg?width=640&format=pjpg&auto=webp&s=90563d542c1e5180e82f835ef5ae7d6fbd2e4e8e",
            "Yes, sometimes you have to let the author cook.  ",
            "Yes, but goddamn is their lack of awareness so funny to read. Like, it's one thing to miss a detail and come to a different conclusion, it's another to entirely miss the characterization or the point unless it's completely spelled out for you.",
            "I honestly believe a lot of manhwa readers are 11 - 14. This is not just me talking out my ass, this is based on Bato comments",
            "My friend always says that the sign of a character being well written is that they make you feel things, good or bad. If you’re apathetic to them, that’s a bad character, lol\n\nAnd man there are some false white lotuses, female leads, and male leads where I could just delete them from the series and nothing of value was lost. Not because they’re annoying, but because they are just *so inconsequential*.",
            "It’s the most annoying thing when the comments ask “why doesn’t the MC do x” and the character literally says why they can’t do that in that chapter or a couple chapters before. Ex. “Why can’t the FL just run away” when in the chapter the FL says that if she tries to run away her abusive family will drag her back.",
            "The lack of media literacy is not limited to OI either. It's in stories of every genre across all mediums. No matter what you're making, whether you're an author, movie director, musician, etc., you'll always run into an audience that just can't read what you put directly in front of their eyes.",
            "This is why I had to stop reading comments when I read on Webtoon. I'd get to the end of a good chapter, see the most brain-dead comment as top comment, and just sour my day.",
            "Yes lmao. Especially webtoon cause that one leans towards a younger audience."
        ]
    },
    "Have y'all checked this one out yet? 🥰": {
        "title": "Have y'all checked this one out yet? 🥰",
        "score": 83,
        "url": "https://i.redd.it/xvsynf83pe9d1.jpeg",
        "content": "I've been reading it on Manta. \n1) OG FL and our transmigrated FL become fast friends \n2) Plenty of communication and setting healthy boundaries \n3) Wholesome as heck so far (OG ML is a dang creep, but we're working together to circumvent that)\n4) Potion for menstrual cramps is hella effective and sells cheap so even commoners can buy it! 💕",
        "num_comments": 21,
        "comments": [
            "I’ve read it and the amount of tropes its juggling is insane. I can tell that they are not gonna deliver most of them to full potential at all by the end.  I hope the author doesn’t add any more because the ones we already have are barely scratching the surface. \n\nI don’t mind tho. The story is not offensive. The MC is pretty assertive and likeable. It’s perfect popcorn entertainment.",
            "tks, subscribed now bc you promised me communication.",
            "I just read this one on manta yesterday. I like it! I'm a sucker for ones where the og!fl and the fl become besties",
            "I’ve read through the first 20 chapters, and I’m getting Mary Sue vibes from the MC.\n\nBesides the prologue, MC gets the Cinderella treatment in chapter one; she starts as a disgraced abandoned/orphaned daughter who has to make her living as a maid, but suddenly gets the support of a handsome Duke (and his handsome sons) and EVERYTHING goes uphill from there.    \nThe girl has faced no hardships since coming into the duke’s home, as everything is handed to her (including befriending a spirit out of nowhere and achieving magical abilities so easily) and everyone adores her. The only obstacle is the eldest son (who’s abusive and forceful to others, but not her), who she can easily stand up to, and is mainly dealing with him for the younger son and OGFL’s sake. \n\nIt is a definite turn off your brain read. But I can’t say I dislike it. Even though FL is getting the Mary-Sue treatment, I like her personality and go-getter attitude.    \nI like that she judges characters by their actions, and was quickly turned off by the eldest son/OGML when she saw how trash he was; she even acknowledged that he was handsome, but it wasn’t an excuse for his trash behavior, and made a steadfast commitment to never be with him (the narrative makes it quite obvious that the younger son will be the future love interest).    \nI love that she communicates her desires, stands her ground, and smartly uses her adult brain without going too far (I’ve read a bunch where the FMC acts like an adult in a child’s body and keeps stating they’re an adult; this MC is more of a child who can think maturely like an adult as she still has wisdom and experiences from her previous life that she can remember).    \nIt has been a fun read so far, and though cliche in some areas, I’m still enjoying it and looking forward to more chapters. Let’s see if these tropes and cliches can be put to good use and make a FMC who becomes a entertaining ‘Badass Girlboss’.",
            "Does she actually escape the male lead?",
            "know how to turn me away from reading? just look at that description that ive seen for a thousand times.",
            "Yeah, I read a little over 10 chapters and decided not to continue. Eh, so boring!!! Im too old for that.",
            "How much have you read of it? Only the first 19 episodes are on Manta so far.\n\nI am entertained and now I want popcorn!",
            "I hope I don't disappoint. 😭\n\nBut this just felt so refreshing.",
            "Actually that’s the charm of the story for me. I need some story with negative stakes to follow weekly. Sometimes you just need some turn your brain off series to balance the serious ones.\n\nIt’s quite fun seeing stories like these try to build tension (and failing) and all I can is “Oh no~ are they gonna be saf— Oh it’s done. The problem is solved. Wow.”"
        ]
    }
}