{
    "JustWhipItOuts in Ottawa": {
        "title": "JustWhipItOuts in Ottawa",
        "score": 383,
        "url": "https://i.redd.it/prhd51uptd9d1.jpeg",
        "content": "When did the city start deploying these new “JustWhipItOuts?”  ",
        "num_comments": 156,
        "comments": [
            "Awesome. None of the hot, humid stench of a portapotty. Put these everywhere.",
            "They've had open air urinals like this in some cities for centuries; they are awesome.",
            "This is actually good, because then the ladies have the porto-potties all to themselves. No more waiting 15 minutes with your legs crossed",
            "Can we get these for Bluesfest please?",
            "I thoroughly enjoy the little \"men's room\" decal on the side. Is anyone really trying to rock up to these things with a vagina? 😂",
            "The ones one Amsterdam have a metal swirl around it that covers most of the mid torso\n\nThat said, the ones in Amsterdam are also just a wall with a drain lmao so win some you lose some aha",
            "They had these at the Montreal Grand Prix and it was full to the brim, overflowing. Super nasty",
            "Am I allowed to poop in the tube?",
            "Google \"Whizdom\".  In short, it is a tube that slips over your wang and down your pantleg. Just stand over any street grate and let the piss flow!! Ahhhh! 5 more Budlights please.",
            "I remember going to use one of these at Heavy MTL a few years back and getting one filled with needles. Keep safe!"
        ]
    },
    "Tenants in 16-floor apartment building in Ottawa's west-end served eviction notices": {
        "title": "Tenants in 16-floor apartment building in Ottawa's west-end served eviction notices",
        "score": 118,
        "url": "https://ottawa.ctvnews.ca/tenants-in-16-floor-apartment-building-in-ottawa-s-west-end-served-eviction-notices-1.6945783",
        "content": "",
        "num_comments": 48,
        "comments": [
            "Does anyone know which building this is?\n\nAnd is 50 years really that old for these buildings? I have a friend who lives on Brittany and those buildings are at LEAST 50 years old. MOST highrises in the city seem to be that old.",
            "Wow, did they get this notice today? Don't allow them any time to contact anyone during the long weekend... crooks.",
            "New fear unlocked. If my building pulled this shit I'd probably kill myself.",
            "Now that is hundreds of people are now looking for housing adding to this crisis, yikes. ",
            "This is legal.   You can thank the Ford government.",
            "It absolutely is illegal. They might be offering $5000 as an incentive to sign a cash-for-keys N11 and end the tenancy (which is legal), but a N13 for renovation allows the tenant right of first refusal to move back in after the renovations (assuming the N13 is for renovation and not demolition) at the same rent as before. And yes, they have the right to a hearing at the LTB.",
            "It’s called the Aspen Towers.",
            "Are most condos or dedicated rentals? I'm in an aged condo, with a good maintenance plan that's on top of these kinds of issues. \n\nBut. My condo fee is also high, it can be increased without a cap, and if needed I can be hit with a special assessment. None of that is true for a dedicated rental, they have no way of raising funds apart from an above-guideline rent increase, which still has a cap. Sounds like the old company just sold it, maybe foreseeing the near-future costs.",
            "I wonder what company bought it",
            "Some LLs and PM companies bank on a tenant not knowing their rights.\n\nAn N13 is a notice. A person can choose to leave but they can also fight it. Also, they have the right of first refusal and if they follow the steps needed to exercise that right, they have to get the unit back *at the rent they were paying*."
        ]
    },
    "Good bar for drinking at the bar alone and having good convos w/ people?": {
        "title": "Good bar for drinking at the bar alone and having good convos w/ people?",
        "score": 57,
        "url": "https://www.reddit.com/r/ottawa/comments/1dqykg4/good_bar_for_drinking_at_the_bar_alone_and_having/",
        "content": "Just lookin to chat and meet some peeps.",
        "num_comments": 61,
        "comments": [
            "Could use a recommendation for a bar where you can drink alone and stare into your own personal abyss with no conversation.",
            "I’ve heard Pubwells and The Gilmour ",
            "So many great suggestions in this sub. I’d suggest picking the one closest to you and walking over if possible. Proximity is king.",
            "The Carleton tavern on Parkdale..cast of very interesting local folks!",
            "Royal Oak at Bank and Gloucester. Have had many solid conversations with randoms there.",
            "Heart and crown and pub italia little italy both of them",
            "Maybe one of the local breweries? \n\nI know I always end up chatting with random people when I’m there but I also usually have my dog with us (on the patio) and he loves to meet new friends.",
            "Pubblico is a great and reliable spot for watching any sport and having conversation with folks. Limited beer selection though ",
            "Dom and Koven have been my go to places for that.",
            "The answer is always the dom"
        ]
    },
    "Y’all feel that earthquake?": {
        "title": "Y’all feel that earthquake?",
        "score": 31,
        "url": "https://www.reddit.com/r/ottawa/comments/1dr2bdn/yall_feel_that_earthquake/",
        "content": "In Greely. Whole house just shook for a few seconds. Nothing crazy, just surprised the shit outta me",
        "num_comments": 20,
        "comments": [
            "4.3 magnitude just hit New York.  Go to live earthquake monitoring on YouTube, neat to watch in real time",
            "Well I’m definitely not telling my wife there was an earthquake",
            "Yes I did in Barrhaven.",
            "I did not but I did hear what sounded like firework or thunder",
            "Also near Greely, didn't feel anything. Maybe one of the quarries nearby did some blasting? But I feel like I'd have felt that",
            "I’m 3-5 minutes from freely and felt nothing.",
            "Also in Greely. Felt nothing.",
            "Swear to god i think i did",
            "the volcano gods are angry.",
            "We’re just outside of Kemptville and something in the house rattled for 2-3s, joked to my wife it was probably an earthquake"
        ]
    },
    "Best playground for monkey bars?": {
        "title": "Best playground for monkey bars?",
        "score": 5,
        "url": "https://www.reddit.com/r/ottawa/comments/1dra8la/best_playground_for_monkey_bars/",
        "content": "I have a kid who was born to monkey around on the monkey bars. He firemans up the monkey bar support poles, and wants to pull himself up and over everything, and, of course, swings across all the monkey bars. So I'm wondering, what are the best outdoor parks in Ottawa for monkey bars? We're in central Ottawa, but I'm willing to explore anywhere in Ottawa. ",
        "num_comments": 6,
        "comments": [
            "Not a playground, but maybe take them to a climbing gym as well. Altitude has a few locations. They have  climibing and a ninja warrior course in Kanata.",
            "Have you taken him to Millennium Park at Mooney's Bay? Hugest variety of playstructures in the city, some of which are great for climbing kids.",
            "There is a play structure actually designed for adults as an exercise station at St. Luke's Park at Elgin and Frank that more adventurous kids play on!",
            "This! My nibling was climbing trees and stuff at school that wasn’t allowed so I got him a gift card to try out bouldering at Altitude and basically the whole family ended up hooked on it!",
            "Millenium is in Orleans… is there a similarly named park at Mooneys?",
            "Try this little gem for variety:\n\n[https://www.google.com/maps/place/Trekfit+Bamboo+Jungle/@45.3027368,-75.8977436,15z/data=!4m6!3m5!1s0x4ccdff7756e2bb8f:0x69c4ff756edc3b63!8m2!3d45.3027368!4d-75.8977436!16s%2Fg%2F11n7xc81r8?entry=ttu](https://www.google.com/maps/place/Trekfit+Bamboo+Jungle/@45.3027368,-75.8977436,15z/data=!4m6!3m5!1s0x4ccdff7756e2bb8f:0x69c4ff756edc3b63!8m2!3d45.3027368!4d-75.8977436!16s%2Fg%2F11n7xc81r8?entry=ttu)"
        ]
    }
}