{
    "Life is expensive rant": {
        "title": "Life is expensive rant",
        "score": 34,
        "url": "https://www.reddit.com/r/ottawa/comments/1dlvlyt/life_is_expensive_rant/",
        "content": "My spouse and I make very decent salaries. We’re a family of 4. I’m looking at my balance today and I’m shocked. \nThe only « fun » thing we spend money on are 2 gym membership we use regularly. And Netflix. My kids aren’t even in any sport or extracurricular that cost money. They go to free activities. \nWe are going out with friends tonight and I feel like cancelling. Still 8 days till my pay check.\nWe own one car (not sure how the expense will climb with gas with more days in the office - right now we are hybrid).\n\nI have not had go live pay check to pay check for a long time. I’ll have to go to the bank to stop the Rrsp or something. How is it that a 2 income family with relatively few expenses has to watch that bank account has to cancel on plans with friends? \n\nBtw I know eating out is not a necessity but I’m giving this as context. Before covid we could eat out and even take trips. If we’re now struggling I can’t imagine what others less fortunate are doing. \n\nIt’s like the money that comes is just flying out.\n\nI don’t know how other families are doing it. My heart goes out to anyone looking for a job.\n\nI woke up this morning very early because the anxiety is messing with my sleep and my health. I really hope anyone looking for a job or in a worse position finds some relief.\n\nI’m in constant fear of one of us losing our jobs. I’ve gone from an ambitious member of society to a submissive employee doing what im told out of fear of losing a job.\n\n",
        "num_comments": 29,
        "comments": [
            "Feel your pain. Everyone is tight right now.",
            "2 income family here too (career gov’t salaries), and same. Vehicle had a surprise repair bill and it pushed me to revolving debt for a month. \n\nCat is sick now, so let’s do it again. \n\nI read a meme the other day that we aren’t living pay cheque to pay cheque, but instead living from car repair to major pet surgery. Rinse, repeat, this is my life to a T.",
            "We're all going through it right now. Times are tough.\n\nGood luck.",
            "I think we also need to face the music that Canadians are poor(er).\n\nMoney is flowing to Asian nations because they’re strategic. Our governments in the west are running our countries like their own fiefdoms and transferring our tax funds into useless projects that never materialize so their cronies can reap giant profits.",
            "Something has to be done. We are a 2 income house making just over 6 figures. Zero debt. Basic bills and food, a roommate to lower housing costs, and 2 kids under 3 (so no sports fees or anything. We’re able to save a few hundred bucks a month, but that’s not going to get us either a house or a comfortable retirement, so it feels like what’s the point, really?",
            "being on ODSP , or disabled is very challenging also, legislated poverty!",
            "4 kids, 2 salaries, 2 cars. Revolving portion of LoC keeps steadily climbing because if I don’t have quite enough to pay monthly CC bill, I transfer from LoC. June is always the hump month for us. It’s when I hit my max CPP contributions AND property taxes are paid off. However when we bought this house in 2003, property taxes were 2700. They are now 8500. Looking forward to the salary bump without CPP.",
            "Oddly seems to be the opposite for me.  Even though things are getting pricey, i just make sure to shop around (aka not Loblaws stores)\n\nSingle family, so that makes it easierbut finally able to pay off my credit",
            "im on ODSP and have a medical disability always in and out of hospital and can barley afford to have basic needs met . i cant imagine what its like for someone who can actually hold down a job . im sorry your dealing with this , seems since covid hit lots of families are struggling , man just basic transportation such as a taxi is EXPENSIVE !!! i hear you on life is expensive and i am on ODSP",
            "The best decision I made when going into home ownership was to choose to buy a home that could be covered with one salary. \n\nI grew up in a family of four, and my current home is roughly the same size as the one I grew up in.\n\nI sacrificed the dream of a larger single home for a townhouse 12km from the office.\n\nWe were thinking about upgrading to a semi-detached a few years ago, but the prices being asked for homes is out of control. Combined with the higher interest rates, we didn't want to put ourselves anywhere near that financial point.\n\nThe cost of everything else has gone up too, but thankfully with our low housing costs we are able to weather it better than some.\n\nWe don't have kids, those things are expensive.\n\nNeither of our positions come with WFH benefits, so it costs us about $10,000.00 a year for me alone, in \"costs associated with going to the office\"; gas, parking, food, clothing, etc.\n\nCombined salaries in the low 100k\n-Down south vacation twice a year\n- inside Canada long weekend trips a few times a year\n-Two / three nights a week for 10 months of the year I have my hobby\n-Eat out once or twice a week\n-1/4 of my take home goes towards TFSA and RRSP\n-1 vehicle"
        ]
    },
    "Three apartment towers with 1,300 units proposed for former Greyhound bus terminal in Ottawa": {
        "title": "Three apartment towers with 1,300 units proposed for former Greyhound bus terminal in Ottawa",
        "score": 189,
        "url": "https://ottawa.ctvnews.ca/three-apartment-towers-with-1-300-units-proposed-for-former-greyhound-bus-terminal-in-ottawa-1.6936259",
        "content": "",
        "num_comments": 55,
        "comments": [
            "Great. Please Go ahead.",
            "Glad to see that some of those units will be 3-bedrooms, more of this!",
            "Great, do it. Like right now though, not in 20 years....",
            "Long overdue. Higher means possibly  thinner design & more units.\nI've seen a few of their builds here and on Gat. side..they are very nice.",
            "Only 100 affordable. What is consider affordable lol? None of them rent protected.",
            "Yes please!",
            "I’m also interested in how the city will amend the neighborhood ‘s ceiling height’s by-law. These « towers «  over every other building in the area.",
            "Until Ontario resolves rent control, almost any solution will be unliveable. It’s why people move to Quebec despite its current lizard government",
            "I want to be cheerful, but is this another development built for the financiers rather than for actual people who need housing, that will sit mostly empty because the owners would rather have it empty than offer affordable rent? \n\nTwo new apartment towers in my neighbourhood were completed last year and there are maybe a quarter of the units occupied right now. That’s because 1 br are $1800-$2800 and 2 br are $2600-$4000 a month. This is not a fancy neighbourhood.",
            "It will be nice to have those 1,300 units in 2050 when this is finished. I remember hearing about what they were going to build at Lebreton Flats, 7 years ago, when I moved here. Still haven’t done anything with it as far as I know."
        ]
    },
    "Renting in Ottawa [rant]": {
        "title": "Renting in Ottawa [rant]",
        "score": 199,
        "url": "https://www.reddit.com/r/ottawa/comments/1dlibil/renting_in_ottawa_rant/",
        "content": "I by no means expect any attention out of this post, I really just need to come on here, rant, and let it all out. \n\nFUCK renting in Ottawa. Holy fuck. I recently graduated and started my new, relatively well-playing full-time job... And my god. Nothing seems affordable. I, like many others, would like to live in an affordable apartment that isn't a shithole, but NOPE. Go fuck yourself. There's no in-between. As someone who's never experienced living on their own, I was hoping to get that experience with a 1-bedroom apartment in the downtown Ottawa area (or nearby), but that seems like a distant dream at this point. And it doesn't even seem to only be a problem downtown... It's just as bad in other neighboring communities. You really have to find a needle in the haystack in terms of a good deal. It's unbelievably infuriating. I should've had the foresight to buy a property for 3 blueberries and some pocket lint 30 years ago. Guess I'll just have to get gouged for every penny I have and not save up for a house.\n\nAnyways, thanks for listening to my rant.\n\nTo everyone out there looking for an apartment, or currently renting in this insane market, godspeed to y'all.\n\nEdit: Thank you everyone for the comments. Good and bad. As sad as it sounds, it does make me feel a bit better knowing a lot of other people seem to be in a similar boat. Felt good to let it all out. Time to keep looking and try to find that gem. ",
        "num_comments": 113,
        "comments": [
            "I live in an affordable apartment. I have been here a few years though. But still, they are still renting for well under $2000.00 a month For a two bedroom. People just hear Vanier and think yuck. It is clean, well taken care of, grocery store next door, bus to downtown about a 2 minute walk. I can walk to downtown in about 20 minutes. This area if fine. As an older woman I have never felt unsafe. These are small older buildings. 3 stories, no elevator. I am 62, walk with a cane and a brace on my leg and live on the top floor with zero problems. I pay $1075.00 for a large 2 bedroom. I have been here since 2018. Rent  Never has never been raised. I am never leaving!! Seriously, I can call maintenance at 9am, and they are knocking on my door by 9:30am same day.\n\nmy next door neighbours (He is a PHD physicist, she is HR), they stayed even though they could afford to move. Now they have banked lots of money and move into their new house in July.",
            "It is rough out there. I moved out of my apartment last summer and they listed my unit at like $600+more a month than I’d been paying",
            "Having moved here from Vancouver a year ago, what I can’t understand about the Ottawa rental market is landlords are charging Vancouver prices but places sit on the market for months. In Vancouver there was a huge demand for rentals. You’d have 40 applicants for a place in a good neighbourhood. In Ottawa in most places we’ve applied to we were the only applicants and some places had been empty for months. I just can’t see how the ‘demand’ for rentals here warrants the prices. It doesn’t make sense. ",
            "it's funny because most of the downtown dwellings are old but expensive and the ones outside are newly built and still expensive and to add spice, they're not rent controlled :)",
            "I feel you, signed a lease in May, 1600$ a month for a one bedroom (utilities included), saw a listing yesterday for an identical one bedroom in the building for 1700$ 🫠",
            "The cancellation of rent controls on anything new hurt badly.  We work and have two kids, and my adult cousin here.  Split 3 ways, it’s not near as bad",
            "Not disagreeing about the current state of rentals but a “relatively well paying job” is vague and could vary wildly.",
            "Rent is crazy expensive but without knowing your budget it’s hard to respond to your rant.",
            "I was reading about post on here the other day. A two bedroom apartment $2400.00 a month. Did I read it wrong. How can people Afford that rent",
            "Whats affordable for you right now? Not disagreeing with you but what are hoping or expecting to pay? Im not in the market so genuinely curious"
        ]
    },
    "To ring or not to ring": {
        "title": "To ring or not to ring",
        "score": 282,
        "url": "https://www.reddit.com/r/ottawa/comments/1dlfvdt/to_ring_or_not_to_ring/",
        "content": "People who walk on the multi-use pathways- do you like when cyclists ring their bell when passing?\n\nThe official guideline is to ring when passing, but I noticed most people get completely off the path when I do this and then I feel bad! So now I don’t ring my bell, but I do slow down when passing larger groups/kids/wheelchairs/strollers.\n\nJust wondering what people in Ottawa tend to prefer? For context, I’m just a regular cyclist who uses the pathways to get around, I’m not in 40km road bike races with my pals.\n\n  \nEdit: thanks all for the strong consensus- I will always ring my bell when passing from now on! I appreciate the extra tips too like ringing further back. Hope other cyclists, who like me were not regularly ringing, see this!",
        "num_comments": 188,
        "comments": [
            "Please ring.  Gives me an opportunity to keep my dog from being surprised by your approach.",
            "Please ring, but not when you're right behind me/as you're passing as it's alarming. I appreciate the ring as a warning that you are passing soon. (I don't get off the path but I move to the right if I'm not there already).",
            "As a pedestrian I really prefer cyclists ring before they pass me. I get off the path to give them enough room to get by. It also lets them know that I heard them and am making sure they can safely pass.\n\nToo often the cyclists who don’t ring end up passing way too close. Like if I had deviated at all sideways there would be a collision.",
            "I like a little ring. I stay to the right and usually hear bikes coming up behind me but a friendly reminder ding is nice in case I'm lost in my own thoughts.",
            "Please ring!! Nothing startles me more than someone coming into my peripherals suddenly and I didn't hear them. You also don't know what erratic random thing a pedestrian could do if they don't know you're coming. What if they jump to the left, or completely stop, or swing their arms while talking? Also if there is oncoming traffic and you ring, it gives pedestrians an opportunity to move right so you're less likely to collide with oncoming cyclists/scooters. Don't feel bad you're being a good cyclist by sharing the path properly",
            "Be also considerate that not all pedestrians can hear. I’m deaf and I usually walk on the right side and try to give way to cyclists. Don’t get upset if we don’t hear the bell 🔔",
            "lmaooo some dude on a bike went “BELL!” as he passed me 20mins ago on the canal path. it was fantastic, and appreciated 🤣",
            "I prefer the ring. I stay as far to the right of the path as possible, it’s more so you don’t scare the daylights out of me when you actually pass lol",
            "100% ring. Then you've done your part, what they do is up to them.\n\nThat, or yell \"on your left\" or something. I've seen/heard many people do this. Maybe they don't have a bell, who knows.",
            "Please ring. I've been startled a lot and I honestly do not like."
        ]
    },
    "Council could limit — or maybe even ban — developer donations to wards | CBC News": {
        "title": "Council could limit — or maybe even ban — developer donations to wards | CBC News",
        "score": 27,
        "url": "https://www.cbc.ca/news/canada/ottawa/council-could-limit-or-maybe-even-ban-developer-donations-to-wards-1.7243162",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Yes please.",
            "Developer offered to donate to Glebe development (not councillor) and there was outrage. Meanwhile, many councillors relied heavily on developer donations for election support (and now they're clearly been corrupted). No one is batting an eye at that.",
            "Ask the Sutcliffe crew what they think about it.",
            "Never should have been done. If we (the city) need more money from developers then it should just be some known part of the development application process. Fair and transparent for all.",
            "Or you could just pay the city Planers to work for you like Taggart does\nhttps://bulldogottawa.com/taggart-pays-for-city-staff-to-work-on-tewin/",
            "Councillors want the money to go into their pockets, not for it to benefit the ward.",
            "It's because the Glebe money helped the poor and common man and the rest of the city council couldn't have that."
        ]
    }
}