{
    "thousand lightyear stare": {
        "title": "thousand lightyear stare",
        "score": 145,
        "url": "https://i.redd.it/h0842rw9kh9d1.png",
        "content": "",
        "num_comments": 9,
        "comments": [
            "Maybe set Spoiler mode, to not spoil the appearance of the inhabitants.\nBtw, peak narration, they made us understand instantly everything with only one expression.",
            "Light year measures distance not time.\n\nBut still great meme! ",
            "sorry i thought the flair was enough, its spoilered now right? and yeah lol they look both funny and tragic like that",
            "im sorry, i thought the flair was enough, first time posting here",
            "isnt yard a distance measure?",
            "Ah yes, the well known thousand year stare",
            "A light year is a distance measurement.",
            "Bro wtf was this conversation ",
            "Spoiler tag, please"
        ]
    },
    "Thought you lot might enjoy this ::)": {
        "title": "Thought you lot might enjoy this ::)",
        "score": 26,
        "url": "https://v.redd.it/nzwtfph15b9d1",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Space marshmallows may not have the same properties, but yeah they are weird.",
            "No genuinely though, my biggest complaint about the flawless masterpiece that is Outer Wilds, is that the marshmallows seem to go from firm raw white to firm raw gray with no bubbling or toastiness at all. Even burned they stay the same solid shape.\n\nI want my perfect brown bubbly toasted mallows! Like a perfect 4 or 5 here."
        ]
    },
    "Other games like Outerwilds?": {
        "title": "Other games like Outerwilds?",
        "score": 25,
        "url": "https://www.reddit.com/r/outerwilds/comments/1dr98tz/other_games_like_outerwilds/",
        "content": "Just finished the whole game and I don't think I can easily find other games like this?\n\nIt's explorative, with a great storyline full of details, philosophical with a touch of melancholy, yet it's still relaxing and even meditative.\n\nAnything else like this out there?\n\nEdit: Thanks for all the recommendations!",
        "num_comments": 26,
        "comments": [
            "It's super niche, but 'Orten Was the Case' is exactly the game Outer Wilds fans are looking for: it's a time-loop puzzle/adventure game with knowledge-based unlocks.",
            "Tunic, FEZ, the witness, the case of the golden idol",
            "The Forgotten City is a FANTASTIC one to play! It started as a skyrim mod that I played forever and the mod developers finally got to make the full game like they intended from the start!!",
            "Signalis gave me the same feeling as OW",
            "The Talos Principle. Very smart, with heavy philosophical themes and good puzzles. The music is good, and its frequently on sale for a pittance.",
            "Definitely TUNIC, but there really arent many games like Outer Wilds",
            "Not like Outer Wilds but Portal 1 & 2. Great story, funny and will really fuck with your mind and will make you feel like your brain is working on an entirely new level. You will then be thinking with portals.",
            "There are games that people like to say are similar but really they aren't. They're still good games and you might enjoy them but there's really nothing like Outer Wilds",
            "There is no game like Outerwilds that Im aware of. You might like the Witness, its a personal favorite of mine, but I cant guarantee that just cause you liked Outerwilds youll like the Witness",
            "It's not like Outer Wilds but if you want a combination of exploration that will challenge your reasoning/logic/observational abilities The Witness is a masterpiece. I posted this recently here to mixed reviews in the comments. It's def a \"this game isn't for everyone\" game but if it's for you you'll devour it."
        ]
    },
    "I just realized.": {
        "title": "I just realized.",
        "score": 460,
        "url": "https://i.redd.it/8sjhusrx3c9d1.jpeg",
        "content": "\nWho made the jumbo marshmallows in timber hearth? \n\nWho invented the marshmallows?\n\nWhere’s the marshmallow factory?\n\nAnd what are the resources that are needed to make said marshmallows?!\n\nThis is the single most confusing part of the outerwilds lore for me.\n\nAre there any explanations or…?",
        "num_comments": 72,
        "comments": [
            "Fun fact, the marshmallows are individually packaged. Each one of those cans contains 1 marshmallow the exact volume of the can.",
            "Also, presence of label implies there arre several brands of marshmellow",
            "I mean, real marshmallow is just a plant. Maybe they're growing them.",
            "we don't know what's inside the houses on timber hearth, could be a marshmallow factory, could be absolutely anything",
            "Well we know they have the tools and knowledge to properly work with metal, as well as some pretty advanced tech as evidenced by the ship tractor beam and the scout that teleports back. I don't think there needs to be a dedicated factory for the marshmallows given how few Hearthians we see, so I would guess they make and can them in the same place they build the rocket parts and space exploration tools (especially since theyre probably both equally important ;;) )",
            "wellz before the gelatine replacement, marshmallows were made with mallow sap, so probably some kind of sap is what the hearthians are using",
            "marshmallows are just sugar (lets say syrup from trees), gelatin (trickier, either the fatty tissue of their own dead, or former stores of fatty tissue from extinct fish), and water.\n\nOne detail I like is that they have hunted all their fish to extinction but haven't realised it yet, even if the super nova didn't happen starvation/malnutrition is just one of the ways the heartheans would have died anyway (besides being dark brambled or anglered)",
            "What I find funnier is that the marshmallow cans are written in English when the Hearthian writing system features lines and dots (as can be seen with the launch codes and the graves in the village)",
            "What I really wanna know is why the name is in English when everything else is Hearthean language",
            "They are all made by hand in one of the houses you can not enter"
        ]
    },
    "What is this?": {
        "title": "What is this?",
        "score": 74,
        "url": "https://www.reddit.com/r/outerwilds/comments/1dqz1te/what_is_this/",
        "content": "Its near the edge of the solar system and im genuinely quite curious\n\nhttps://preview.redd.it/ny07zb0ure9d1.png?width=1637&format=png&auto=webp&s=3e988c3a0f58d3294a097e1e4b27f76fb27d11cb\n\nhttps://preview.redd.it/f3g384gxre9d1.png?width=1481&format=png&auto=webp&s=01cfd44fc4ae227991bdcf38a6b2cde1e1eeaa2c\n\nhttps://preview.redd.it/0nr6gq38se9d1.png?width=680&format=png&auto=webp&s=b93cd6a2f4884bd69739cefb1bedae16af283ea5\n\n[ITS SO FAR AWAY](https://preview.redd.it/h18j0l8mse9d1.png?width=701&format=png&auto=webp&s=b905a425a2dd8f4cf61015a08783a7a46940b0a0)\n\nI think its moving away from the sun.",
        "num_comments": 27,
        "comments": [
            "There's an answer to everything in Outer Wilds, and that object is no exception.\n\nThink about it: How exactly did you find this object? Are you able to do it again in a different loop?",
            "Holy shit - you can catch that? Wild...",
            "I would have liked more interaction with this guy.\nOr maybe I missed something?",
            "Indirect answer: The game will tell you what it is as you learn more about what's actually going on.",
            "Im genuinely quite curious\nThats the idea! Enjoy the journey figuring it out!",
            "Theres more, and less, to explore here ::)",
            "I advise exploring where it came from instead of asking others. Not because I think questions are bad, but because the game will answer them far better for you than anyone here can!",
            "What do you see at the start of each loop",
            "my question is HOW did you find this??",
            "The place it came from may hold answers"
        ]
    }
}