{
    "I just realized.": {
        "title": "I just realized.",
        "score": 395,
        "url": "https://i.redd.it/8sjhusrx3c9d1.jpeg",
        "content": "\nWho made the jumbo marshmallows in timber hearth? \n\nWho invented the marshmallows?\n\nWhere’s the marshmallow factory?\n\nAnd what are the resources that are needed to make said marshmallows?!\n\nThis is the single most confusing part of the outerwilds lore for me.\n\nAre there any explanations or…?",
        "num_comments": 66,
        "comments": [
            "Fun fact, the marshmallows are individually packaged. Each one of those cans contains 1 marshmallow the exact volume of the can.",
            "Also, presence of label implies there arre several brands of marshmellow",
            "I mean, real marshmallow is just a plant. Maybe they're growing them.",
            "In the village\n\nThose rotating things process the resources \nOne of those side character people in the village make it",
            "we don't know what's inside the houses on timber hearth, could be a marshmallow factory, could be absolutely anything",
            "Well we know they have the tools and knowledge to properly work with metal, as well as some pretty advanced tech as evidenced by the ship tractor beam and the scout that teleports back. I don't think there needs to be a dedicated factory for the marshmallows given how few Hearthians we see, so I would guess they make and can them in the same place they build the rocket parts and space exploration tools (especially since theyre probably both equally important ;;) )",
            "wellz before the gelatine replacement, marshmallows were made with mallow sap, so probably some kind of sap is what the hearthians are using",
            "What I find funnier is that the marshmallow cans are written in English when the Hearthian writing system features lines and dots (as can be seen with the launch codes and the graves in the village)",
            "marshmallows are made from Gallatin, which is made from ground up animal bones.\n\n\nand there's only one species of animal on timber hearth.......",
            "What I really wanna know is why the name is in English when everything else is Hearthean language"
        ]
    },
    "Why is this in the patch notes?": {
        "title": "Why is this in the patch notes?",
        "score": 180,
        "url": "https://i.redd.it/t5ziys5uqc9d1.jpeg",
        "content": "",
        "num_comments": 14,
        "comments": [
            "It's a reference to an anime called Steins;Gate, the devs added an easter egg based on it.",
            "El Psy Congroo...",
            "That's a Steins;Gate reference. It also follows a>! timeloop !<narrative so probably just an easter egg.",
            "The devs are a gas",
            "There's literally a post on the front page showing this\n\nhttps://www.reddit.com/r/outerwilds/comments/1dqgv7b/new_easter_egg_in_1115_update/",
            "what did they add?",
            ">!not just a time loop, but a time loop that is achieved by using technology to send memories into the past because of an unavoidable event always happening!<",
            "Your comment contains spoiler tags that might not function on all devices. Please edit your comment to remove any spaces between the >! and the spoilered text.  You can also check out the widget in the sub's sidebar for more help on why your spoiler tags may be incorrect and a copy/paste version of the tags, or you can [check out this wiki page](https://www.reddit.com/r/outerwilds/wiki/rules/spoilerfaq/#wiki_how_to_properly_tag_spoilers) about how to properly tag your spoilers. Then, please [message the moderators to let us know you fixed it.](https://www.reddit.com/message/compose?to=%2Fr%2Fouterwilds&subject=Fixed+Spoiler+Approval&message=Please+check+[my+post]\\(https://www.reddit.com/r/outerwilds/comments/1dqq0i9/why_is_this_in_the_patch_notes/laps7ff/\\)+and+approve+it+if+it%27s+properly+spoilered+now.%0A%0AThank+you!)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/outerwilds) if you have any questions or concerns.*",
            "Oh, thanks for bringing this to my attention!",
            "In Giants Deep, on the island with the statue workshop there is a scroll on one of the walls high up. If you grab it and read it you will get a steins gate reference"
        ]
    },
    "What is this?": {
        "title": "What is this?",
        "score": 40,
        "url": "https://www.reddit.com/r/outerwilds/comments/1dqz1te/what_is_this/",
        "content": "Its near the edge of the solar system and im genuinely quite curious\n\nhttps://preview.redd.it/ny07zb0ure9d1.png?width=1637&format=png&auto=webp&s=3e988c3a0f58d3294a097e1e4b27f76fb27d11cb\n\nhttps://preview.redd.it/f3g384gxre9d1.png?width=1481&format=png&auto=webp&s=01cfd44fc4ae227991bdcf38a6b2cde1e1eeaa2c\n\nhttps://preview.redd.it/0nr6gq38se9d1.png?width=680&format=png&auto=webp&s=b93cd6a2f4884bd69739cefb1bedae16af283ea5\n\n[ITS SO FAR AWAY](https://preview.redd.it/h18j0l8mse9d1.png?width=701&format=png&auto=webp&s=b905a425a2dd8f4cf61015a08783a7a46940b0a0)\n\nI think its moving away from the sun.",
        "num_comments": 17,
        "comments": [
            "Holy shit - you can catch that? Wild...",
            "What do you see at the start of each loop",
            "There's an answer to everything in Outer Wilds, and that object is no exception.\n\nThink about it: How exactly did you find this object? Are you able to do it again in a different loop?",
            "I would have liked more interaction with this guy.\nOr maybe I missed something?",
            "Indirect answer: The game will tell you what it is as you learn more about what's actually going on.",
            "“I’m genuinely quite curious”\nThat’s the idea! Enjoy the journey figuring it out!",
            "There’s more, and less, to explore here ::)",
            "I advise exploring where it came from instead of asking others. Not because I think questions are bad, but because the game will answer them far better for you than anyone here can!",
            "I once described Outer Wilds as follows: Most games ask the player questions. They can be simple questions like \"can you press mouse 1 to shoot?\" or more complex ones like \"what series of controller inputs will make you go around this race course faster than any other player?\" \n\n\n  Not Outer Wilds.  Outer Wilds is a game that just sits there, quietly, waiting for the player to ask \"WHAT THE FUCK DOES IT MEAN!?\" only to then tell the player: \"Go figure it out.\"\n\n\n  And I'll be darned if I'll ever again play a game that manages this same feat.\n\n\n\n\nBe curious on your journey. ;;)\n\n\n\n\nEdit: typo.",
            "Hint: the first thing you saw when you wake up every time loop."
        ]
    },
    "Rank these moments 1-6 based on how shocked you were when you discovered them. (DLC Version)": {
        "title": "Rank these moments 1-6 based on how shocked you were when you discovered them. (DLC Version)",
        "score": 27,
        "url": "https://i.redd.it/ydein1o20f9d1.jpeg",
        "content": "I saw someone else do this for the base game and was interested to know for the dlc.\n\nTop Left: Leaving the artefact radius \nTop Right: Meeting prisoner\nMiddle Left: Entering simulation for the first time/ realising how to enter simulation \nMiddle Right: Eotu vision slide reel\nBottom Left: Burned owlk homeworld slides\nBottom Right: Entering the stranger for the first time\n\nFor me it’s definitely bottom left - I don’t think my jaw has actually physically dropped before from anything but this slide reel had me motionless for a good minute from shock.\n",
        "num_comments": 11,
        "comments": [
            "Bottom right is definitely the biggest 'holy shit' moment in the whole game. Just truly spectacular moment.",
            "Has to be bottom right for me. Tha initial scare/confusion turning into pure awe as you look up and the music starts is just magical.",
            "Bottom right was the most beautiful moment in the game for me (I started playing the DLC one year after it came and I only knew there were going to be scary parts).\n\nBut top right is one of the most shocking moment of the entire game and I loved the entire sequence - While I really liked the game before, meeting him, watching his story (and telling him ours) and seeing his ending was not only beautiful, but also the moment I **\\*really\\*** understood what the game is all about.",
            "For me it was finding >!the elevator from the ship hangar… finding out it had been there all along was 🤯!<",
            "Pretty much all of them, they were far more impactful to me than anything else the game had to offer (especially meeting kaepora)",
            "the only one I wasn't really spoiled on was the crazy artifact render, so top left. Although bottom right was also very crazy, so hard to really pick 1",
            "Definitely all.",
            "Bottom Right, then Middle Left",
            "It was a massive subversion of expectations for me. I was already scared entering the Stranger's airlock with its darkness and creepy lights. Absolutely not expected a ride on a boat across a brightly lit ringworld.",
            "And the MUSIC."
        ]
    },
    "Did anyone *actually* solve Echoes of the Eye? - Video Response (HEAVY LATEGAME SPOILERS FOR EOTE)": {
        "title": "Did anyone *actually* solve Echoes of the Eye? - Video Response (HEAVY LATEGAME SPOILERS FOR EOTE)",
        "score": 33,
        "url": "https://www.reddit.com/r/outerwilds/comments/1dqwjyb/did_anyone_actually_solve_echoes_of_the_eye_video/",
        "content": "[https://youtu.be/NQKpa49Ia9Y?si=-QMSVZV86RQabmBP](https://youtu.be/NQKpa49Ia9Y?si=-QMSVZV86RQabmBP)\n\nI just watched the video linked above criticizing EOTE and it's unclear and stealth-based mechanics. I'm not here to hate on the creator, nor disvalue what he said, as I do believe that the solution is quite unclear and it's obvious that a lot of people struggled with these sections. However, I do believe there is a solution, and the solution isn't to \"just stealth\".\n\nThe true intended solution, I believe, is to use the Olwks lights as your own light source.\n\nWhen you suppress your light, and they are close enough to see you, they turn on their lantern and walk slower because of that. If your light is off, they keep their light on you to not lose you. If you use that information, you can use the Owlks light to guide you through where you might need to traverse, giving you an easy way to navigate, with minimal \"chase\" going on.\n\nIn the video, there is a quote from an interview that Andrew Cunningham, the video's creator, references many times throughout. This quote alludes that the \"themes\" of the game (or DLC) are present in the solution to the chase sequences.\n\nAs presented, the solution above seems to fit pretty nicely within the themes of the DLC.\n\nImagine the game's themes. The whole problem with the Owlk is they intentionally obscured the Eye of the Universe. They want to live \"in the dark\". Considering the themes of the game, if you are to sneak around and be \"in the dark,\" it's going to be VERY difficult for you. But if you aren't afraid of the threats, and decide to let them illuminate your path, things begin to be a lot easier for you.\n\nThe intent of this post isn't to put anyone down who didn't gather this, nor to give myself a boost on finding this out. It's just something I found on my playthrough of the game which from the sounds of it *many people* did not and struggled with particularly. I'm curious whether other people solved it this way, what other solutions people came up with, what people think about the stealth sections overall, and even how it connects with the lore of the game and the themes of the DLC.",
        "num_comments": 38,
        "comments": [
            "I think the themes and intention behind the stealth sections are laudable.\n\nI think the implementation is less successful. For a game based in progression by information, the sudden skill challenge comes out of nowhere. If this had been a stealth game to begin with, perhaps players would have been predisposed to consider their options more carefully, but the player is not primed for stealth gameplay prior to this moment. Add in the frustration of your natural reaction (conceal your light) leaving you both completely in the dark *and* being the “wrong” response, and I can’t appreciate the message that’s trying to be shown when I’m too busy being upset that I keep failing.",
            "I accidentally figured out that you can ENTIRELY avoid the stealth sections by accident. my thought process was like \"hmmmmmm, I wonder if I activate this and then use one of the boats from a different location maybe I could avoid this\" and it indeed avoided the stealth entirely",
            "The solution seems far more to be the themes of fear of the unknown which they represent, and same with the base game.  If you charge in to either their areas or the anglerfish nest you'll get jumped for sure, it's knowledge that will help you traverse it without issue\n\n  \nIf they spot you they'll charge and boot you out - they spent all this effort not to be found, to cloak their spaceship AND hide everything in secret doors any of them will know on sight, only an intruder would be fooled by, and even THEN leaving a redacted history that looked to be a dead end, with the simulation being an even deeper layer of secrecy, and even THEN hiding the rest behind their own personal presence as a last layer of security... so yeah, they're going to freak out if someone actually shows up and rush to scare you away without looking deeper.\n\nHowever, this goes the other way, if you find them first, and focus your light directly at them, they stop, they hide their own light, they get cautious and start to stalk you instead of charge. You're now a threat to be scared of.  That's how you become the thing THEY are stealthing from, and now their lights are hidden, when you also hide yours, you can now make your trip effortlessly down the paths you've already memorized from previous exploration\n\nOr in more practical terms, find a path with two routes, like the ones leading to the guard of the well, focus your light at him down one path, conceal and then you can waltz down the other - he'll be stalking to where he last saw you.  This works at split paths, anywhere there's an obstruction, and also on stairs with railings (they can't jump, you can)",
            "I think the stealth in the DLC is pretty clunky TBH. I get what they were trying to go for but it's so difficult it feels almost random. I feel like with reduced frights it's easier and works better but I dunno... it's really not that great IMHO. Good thing the rest of it is a masterpiece.",
            "I enjoyed the dark moments after the initial terror I was experiencing.   Once I realized they >!approach slowly when you shine your light on them or vice versa, with a reasonable amount of distance between us!< I used that to my advantage and it worked like a charm.  \n\nI never got over the fear factor when going through the DLC >!(or Dark Bramble for that matter) but it was fun playing tricks with Owlks!<",
            "It's clear to me that they designed their systems with several possible solutions in mind. Or perhaps more accurately the freedom to work with several interlocking systems in order to compose your own solution, without one truly being the intended route. \n\n\nI can say that I probably stumbled into an unusual way of solving it, though. One of the first things I did when arriving at that location was to drop all my equipment. I don't remember exactly why I did that but it was probably just me goofing around - deliberately discarding everything because it cracked me up how irresponsible of a course of action it was.\n\n\nThe end result of this was that I learned one of the secrets and could easily determine where to go with the press of a button. So my experience involved a lot of mapping paths ahead of time with that trick. Not what I imagine they expected me to do, but I would still call that a solution.",
            "The biggest flaw isn't that they can't be gamed, but that the game doesn't tell you how or that you preferably should. And that's because the devs want you to interact with them and play a scary game. \n\nAnglerfish were direct, there's a little section where kids play, they explain it, awesome. Owlks, they're a much bigger thing. You interact with them and they'll look at you confused, they'll look around for you, they'll hesitate if you shine your light at them. It's easy to figure out how to manipulate them... It's just scary.",
            "I take 95% of the blame for this myself both due to lack of apparent reading comprehension and bad learning. I initially played on less-scary-mode and missed that that also slows down their “pounce”.\n\nThis led me to SO many loops where I was sure it was just a skill issue. Especially getting past the fireplace. \nI feel many base-game puzzles and even other dlc puzzles DID have “brute force” solutions, and “smooth solutions”, but it always felt much more clear which of the two I was engaging in. \n\nSquishing yourself into giants deep with an island, landing on sun station, randomly wandering around the QM thoughtlessly until finally landing at the North Pole, etc.\n\nWhen I was doing things like that it was evident that I was cheesing that section, but in the late dlc it seemed as if there were solutions that SHOULD be possible but weren’t cuz I was just not good enough.\n\nFor those of you D&D inclined, it felt a bit like one of those times where you’re just losing the encounter the DM is trying to use to tell you “you’re not ready yet you’re not strong enough”, but it wasn’t clear enough that was happening.",
            "I suppose I might've been a bit too cocky when I suggested my response was the \"right\" one. I simply mean I believe it's the one intended by the devs, as I think OW has some unique quality to have many different solutions.\n\nThat said, I do think, as you properly mentioned, that this \"true solution\" is not very obvious at all, especially if you're under a time crunch and in an intense chase sequence.\n\nDo you think maybe they should have alluded to this is some way? I'm not sure exactly what they could've done with this, especially as the DLC has the challenge of having zero fellow travellers with you. That was my usual safety net, going back to a fellow traveller and seeing what they had to say about stuff. But I imagine there was definitely a better way to implement this solution to the puzzle than simply, test until you find it out, as it seems many people, in fact, did not find this solution.",
            "This was the intended way, it's a puzzle game before a stealth game.\nThey were scaring the shit out of me so I had to find a way to skip them entirely, and I did.\nAnd one you find the >!drop the artifact to see better!< trick, you cannot be surprised anymore"
        ]
    }
}