{
    "What is going on with the Supreme Court?": {
        "title": "What is going on with the Supreme Court?",
        "score": 406,
        "url": "https://www.reddit.com/r/OutOfTheLoop/comments/1dqxoiv/what_is_going_on_with_the_supreme_court/",
        "content": "Is this true? Saw this on X and have no idea what it’s talking about. \n\nhttps://x.com/mynamehear/status/1806710853313433605\n",
        "num_comments": 100,
        "comments": [
            "To my understanding, Ohio vs EPA removes the Chevron Doctrine which means that government agencies no longer have broad discretion to enact laws. The exact actions and allowable must now be spelled out in the specific legislature.",
            "Dear lord we are so fucked if we let trump win again",
            "So am I right in understanding the bribery one as saying that now only pre-paid bribery is bribery?\n\nPost-paid bribery is just fine?",
            "Oh, so we should just turn to violence, then? If the Supreme Court wants to act like this, why shouldn't someone take matters and weapons into their own hands?",
            "Ohio v EPA is not part of this tweet.  This is about the twin cases of Loper and Relentless, which have to do with who gets to interpret ambiguous statutes.  \n\nAlso your summaries arent very accurate but Im way too lazy to write out an alternate so have at it.",
            "So, worth noting that 3 of the 9 were paced on the court by Trump, which gave the GOP a supermajority. Elections have consequences.",
            "The bribery one is if you are given a gift after you took a government action it's not bribery even if you only took the action because you would be receiving a gift. But who would have expected a judge that is constantly being bribed to write that kind of opinion?",
            "I cannot emphasize enough that a republican senator said that loving v virginia should be overturned and that whether or not interracial marriage should be legal should be left up to the states. Roe is very much the tip of the iceberg. \n\n6 justices are evil POS, who have no business interpreting the law of this country.",
            "The thing is, this Supreme Court has us deeply fucked anyway, in ways that I don't know how we're ever going to fix.",
            "Dude you were fucked when you let him win once. Theyve had their practice run, the next republican president knows exactly how to become the Last President"
        ]
    },
    "What is going on with lab grown meat bans?": {
        "title": "What is going on with lab grown meat bans?",
        "score": 764,
        "url": "https://www.reddit.com/r/OutOfTheLoop/comments/1dqok4q/what_is_going_on_with_lab_grown_meat_bans/",
        "content": "I've was always fascinated by the promise of lab grown meat. Haven't really kept up with it, but considered switching to it when said lab meat became more mainstream...but it seems to be getting banned before the product really comes to store shelves: [https://www.greenqueen.com.hk/upside-foods-florida-bans-lab-grown-meat-cultivated-chicken-miami/](https://www.greenqueen.com.hk/upside-foods-florida-bans-lab-grown-meat-cultivated-chicken-miami/) and Florida is seemingly not the only one.\n\nWhy is this? Why are they banning a yet to be released product and a (assumedly) less cruel way of producing meat. Could some please explain this to me in a way even an idiot could understand because...I am one.",
        "num_comments": 158,
        "comments": [
            "Answer: Without getting too deep into the exact politics of it all, the fact is that the US has a powerful agricultural lobby that really wants to preserve the rights and profits of food industry, including meatpackers and \"traditional\" meat producers. Lab-grown meat would cut into the \"traditional\" meat industry profits, so the \"Big Ag\" lobbies to have it limited if not outright banned to preserve their interests.\n\nThere are also the actual concerns over whether the cultivated meat is safe, what should we define as \"meat\", and so on; a lot of legislature to figure out (there's a reason very few countries have permitted lab-grown meat to be sold in stores so far). But with the political climate being what it is, it's hard to determine how much of the bans are motivated by scientific concern, and how much is the result of political lobbying.",
            "Answer: performative culture war nonsense and conspiracy theorists.",
            "Answer: lab grown meat is associated with progress, which means conservatives hate it. They are banning lab grown meat to own the libs and also because the meat industry is lobbying against their future competitors.",
            "Answer: Some are afraid the government will use lab grown meat as a pretext to ban traditionally grown meat.  People in the meat business are worried they'll lose their jobs because of it, and people who like to eat meat are worried it won't taste as good as the real thing and the transition will be forced prematurely.\n\nPoliticians are pandering to those crowds by coming out in opposition of lab grown meat, therefore also opposing any slippery-slope consequences that might come along with its development.",
            "Aren't these the \"let the market\" decide folks? Is it about protecting consumers? No? Then it's bullshit and an unjustifiable violation of people's rights and freedoms.",
            "The \"party of limited government\" is back at it!",
            ">a shadowy global elite who wants everyone else to eat bugs.\n\nI knew Big Shrimp and Big Lobster was behind this.",
            ">  and we will save our beef.\n\nBy literally slaughtering them. Jesus.",
            "To the far right, \"globalist\" translates to Jews.",
            "Probably also because it's not cruel enough to animals.  What's the point in eating meat if you don't get the satisfaction of knowing that a living animal was raised in sub-standard conditions and killed to harvest it?  \n/s"
        ]
    },
    "What’s the deal with Tractor Supply apologizing? ": {
        "title": "What’s the deal with Tractor Supply apologizing? ",
        "score": 529,
        "url": "https://www.reddit.com/r/OutOfTheLoop/comments/1dqper5/whats_the_deal_with_tractor_supply_apologizing/",
        "content": "\n\n[From my X feed.](https://x.com/tractorsupply/status/1806417863885902217?s=46)\n\nI gather that for some reason they supported some liberal initiatives that their rural customer base didn’t approve of and are walking it back",
        "num_comments": 226,
        "comments": [
            "they weren't \"forced\" as much as they buckled under pressure like a cheap card table.",
            "People (rightly or wrongly) see \"DEI\" as a dogwistle for policies that are going to benefit minorities at the expenses of the white majority.",
            "What do you mean by forced? Why did this happen? What prompted this?",
            "True or not, any time DEI is introduced its automatically viewed in some circles as anti white and anti male",
            "Lmao i'd be pissed to if my data was shared for bs like this",
            "Called a free market brother",
            "I'm not sure who their customer base is honestly. They bought our local farm store, reduced inventory, and jacked prices up 30% - 50% for pretty much everything. No one shops there and people are always complaining on Facebook about their prices.",
            "What will be fun is when those \"images\" inevitably lead to a loss in profit. I'll enjoy it.",
            "Well it's not hard to see a pattern from a business perspective - bud light, target, disney, marvel etc\n\nAnyone going down this road after seeing what happened to those companies is just asking for trouble.",
            "Bud light all over again. Is your country like, ok?"
        ]
    },
    "What's going on with flip phones?": {
        "title": "What's going on with flip phones?",
        "score": 64,
        "url": "https://www.reddit.com/r/OutOfTheLoop/comments/1dqziud/whats_going_on_with_flip_phones/",
        "content": "My grandmother just said the companies have been \"selling more flip phones now\" - I searched and found this. I noticed the post date for the quoted article was Nov. 21, 2023 but those articles are this week. \n\n  \n[https://www.reddit.com/r/technology/comments/1dj3vm3/flip\\_phone\\_sales\\_are\\_surging\\_as\\_folks\\_seek/](https://www.reddit.com/r/technology/comments/1dj3vm3/flip_phone_sales_are_surging_as_folks_seek/)  \n  \n[https://www.usatoday.com/story/tech/2024/06/18/2024-flip-phones-popular/74097540007/](https://www.usatoday.com/story/tech/2024/06/18/2024-flip-phones-popular/74097540007/)\n\n[https://finance.yahoo.com/news/paris-hilton-says-gen-z-194707331.html?guccounter=1](https://finance.yahoo.com/news/paris-hilton-says-gen-z-194707331.html?guccounter=1)\n\n  \n\n\n",
        "num_comments": 39,
        "comments": [
            "Answer: the headline of the first one is literally \"flip phone sales are surging as folks seek connection without distraction.\" I don't think it's much deeper than that. People are back to buying phones you can text or make a phone call on, but they're not interested in having a distracting screen  and a thousand unnecessary apps in their face all day.",
            "I'm about ready to find a blackberry knock off.  I really don't need all of the extra bologna.  This is just my own opinion.",
            "Id love a plain old flip phone like that. But now Ive gotta have 2FA for every damn thing. I guess if SMS is an option its fine. I would love a flip phone with a great camera",
            "It would be crazy if it is so 2020 to be looking at your phone.",
            "Basically everything moves in cycles.",
            "but its based on a 1 yo post right? Im not if sure its legit",
            "I found my old one and my kid was devastated that it's unusable as the network has changed.",
            "I have seen advertisements on YouTube for a minimalist smartphone, where it is not having all of these colorful icons for the apps. You literally have to scroll through menus in black and white.",
            "Id love a phone that did texts, calls, maps, music. Hard to find one with just these though so I have my eye out for new models!",
            "And yet, here you are, posting on Reddit."
        ]
    },
    "What is going on with tweets about iPhone wallpapers, that are getting huge numbers?": {
        "title": "What is going on with tweets about iPhone wallpapers, that are getting huge numbers?",
        "score": 9,
        "url": "https://www.reddit.com/r/OutOfTheLoop/comments/1dr5gzt/what_is_going_on_with_tweets_about_iphone/",
        "content": "One user in particular I've noticed these past few days, has had a few tweets get insane impressions with basic wallpapers.\n\n[This tweet](https://x.com/awsiiq/status/1806346532817424567?t=tgE81LkXn1Lf2flXYlWnyA&s=19) has over 82M views and over 393k likes.\n\nI have an Android so I don't follow Apple news. Can anyone help?",
        "num_comments": 4,
        "comments": [
            "\nFriendly reminder that all **top level** comments must:  \n\n1.  start with \"answer: \", including the space after the colon (or \"question: \" if you have an on-topic follow up question to ask),\n\n2.  attempt to answer the question, and   \n\n3.  be unbiased\n\nPlease review Rule 4 and this post before making a top level comment:\n\nhttp://redd.it/b1hct4/\n\nJoin the OOTL Discord for further discussion: https://discord.gg/ejDF4mdjnh\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/OutOfTheLoop) if you have any questions or concerns.*"
        ]
    }
}