{
    "SIMPLE QUESTIONS THREAD - SEASON 11 (2024)": {
        "title": "SIMPLE QUESTIONS THREAD - SEASON 11 (2024)",
        "score": 2,
        "url": "https://www.reddit.com/r/OverwatchUniversity/comments/1dkonmt/simple_questions_thread_season_11_2024/",
        "content": "SEASON 11 SIMPLE Q&A\n\nHello heroes!\n\nIs there something short you want answered? Post all your simple queries here. This thread is a centralised place where all basic questions can be asked and answered.\n\nAnyone can ask/answer any questions!\n\nThis thread is actively monitored throughout the season. Together we've answered thousands of questions!\n\nThere are no stupid questions. Ask and ye shall receive.\n\nHow do I best utilise x or y?\n\nWhat's a good setup for my mouse, crosshair, etc.?\n\nHow do I practise my aim?\n\nAre there techniques or methods to improve my gamesense?\n\nIs there an x or y feature?\n\nHow does ranking up work?\n\nNote that discussion is not limited to the above topics.\n\nP.S., Join our Discord server if you haven't already! At discord.gg/owu",
        "num_comments": 102,
        "comments": [
            "How to carry as tank, I'm solo queuing most of the time and my teammates don't know where the point is im gold 3 tank\nTx.",
            "Is there here a place to meet people around my skill level to play with? I really enjoy the game but   solo-queue is a mixed bag. I just wanna play consistent games with people who aren’t toxic!",
            "How do I protect my team as Zara?\n\nI usually get 6k damage mitigation as her, which might not be enough. I advance on the objective, use cover, get full charge, and then realize I’m alone. How do I change this?",
            "Is it unreasonable to expect your Mauga to deal with the enemy Pharmercy when the DPS struggles to deal with them?",
            "how do you guys feel about Doom's power block getting a decrease cooldown if he does not get empowered punch?",
            "What are the right inputs/timings to get max height on Pharah's jump jets? Should I be shooting the ground a little bit before or a little bit after hitting the button? Does holding space/crouching change anything?",
            "Hi new to OW2 and I just got ranked in bronze in competitive. When I when a game I only go up by 5% in the competitive progress, is this normal? I would have to win 20 games just to rank up, is this typical or is something off?",
            "What are the best tips to get a higher win streak?",
            "Does Sigma need LOS for his ult currently? I see sources saying he needed it, then he didn't, then he needed it again?\n\nJust wanted to make sure. Thanks!",
            "Just got back to the game after many months off. When I’m playing Mercy, sometimes the rez cancels itself; there isn’t anyone/anything blocking me off and I stay near the teammate I’m ressurecting. (Atleast I think so).\n\nI’ll fly to a dead teammate > rez (stand still) > rez cancels and cooldown starts"
        ]
    },
    "How should Brigitte be played?": {
        "title": "How should Brigitte be played?",
        "score": 19,
        "url": "https://www.reddit.com/r/OverwatchUniversity/comments/1dr5nmb/how_should_brigitte_be_played/",
        "content": "For context, I have a total of around 500 hours in all modes and I main support. I still have lots of room for improvement since I have always fluctuated between low Silver and high Bronze on all roles, but I think I know most of the basics of the game.\n\nWhenever I play Brigitte (admittedly, very rare and very little), I quickly die during most fights, either on the frontline or on the backline. Most enemy heroes seem to easily survive my damage (swing+bash+boop) and outdamage both my inspire AOE healing and my repair packs. My shield doesn't protect me, either.\n\nHowever, I occasionally see other people in my games play Brigitte and they don't seem to constantly blow up the way I do. Some of them even manage to bully the enemy tank which leaves me wondering how, since they seem to position aggressively.\n\nMy failure as Brig is probably mostly a positioning issue, but I don't struggle to protect myself when playing other supports nearly as much as I do when playing Brig. With other supports, I try to use cover, off-angles and occasional high ground, but it's not really applicable to Brig since she needs to proc inspire by being in the face of an enemy. Which doesn't help my survivability on her.\n\nI want to learn to play every support hero without hard feeding, and currently I feel Brig is the hero I understand the least.",
        "num_comments": 12,
        "comments": [
            "\"If the enemies don't do anything, don't force anything\".\n\nI think this is really good info. When I first started playing her, I had issues staying patient. I would get antsy, feeling like I should be doing something to have a larger impact, which would lead to being too aggressive. Once I learned to just chill, dole out health packs and whips until the enemy made a move, my win rate sky rocketed. A lot less deaths also 😂",
            "Upvoting this. Sam might be a controversial creator, but this is the exact video I used to learn Brig and play her in GM (before the rank changes).",
            "1. You're not a tank.\n2. Use whip shot on cooldown to space the enemy tank and trigger inspire.\n3. Use shield bash to disengage when you're in danger.\n4. Only engage aggressively against isolated targets, flankers, or when rally is active.",
            "You need pretty good game sense for brig. She's somehow got a reputation for being an op brawler who stomps any dive but she's kinda hard to get value from honestly. Inspire has lost a huge amount of value since the DPS passive buff, \n\nI have two priorities with her, one is to save the backline from dive. You don't do this by killing dive, you can't really. If you see a teammate getting dived, you throw a repair pack at them and then burst as much damage as you can into the diver so that they flee. A kill is nice but rare.\n\nThe other is to pester the enemy frontline into thinking I'm a threat. Take a safe position at a very narrow off angle and flash the shield, boob the boop, be annoying. The aim is to take pressure off the rest of the team, with shield and health regen management you can take a lot of shots while staying safe and those are all shots that are not going on the rest of your team. It's hard though, get a little too much attention, mistime your distraction, fuck up slightly, you are dead",
            "You’re supposed to stay in the back line and throw packs on people. Try and land some whip shots for the 75 damage and get the Inspire to supplement the packs\n\n\n\n\nYour actual mace swing/Inspire is supposed to pressure divers and keep other backline people like Ana or Cass alive long enough until the diver gets out. You only deal 45 damage per swing. \n\n\n\n\nAnd you can press up when you get your Ult. Those Brigs you see doing well probably have their Ult. It gives you 100hp on activation \n\n\n\n\nI think it’s a pretty lame play style, ngl, and I don’t play her. \n\n\n\n\nKeep in mind Inspire is 15 health/second (minus the DPS passive) up to 5 seconds and doesn’t stack. It won’t keep you alive. \n\n\n\nYour 250 health and shield that exposes your legs won’t keep you alive. You use the shield to dash behind cover instead of actual block bullets. It’s really to block a single thing like DVa bomb.",
            "Biggest things that are good and simple tips for an avg player that helped me on brig:\n\nYou need to use whipshot as much as possible, and land it as much as possible - this is how you keep your healing up more often! And offer value of messing w enemy positions\n\nAnd 2nd you should neverrr be dying without a broken shield! So often I see brigs only using shield “for a good reason” but in reality, that is just 250 extra health  you should be getting value out of! Whether it be chip damage, stepping in front of an ally to take a lil dmg for them, or just prolonging your death - you never wanna die with extra shield health (unless of course resetting)\n\nHitting a lot of whips and using shield well is what makes brig a beast :)",
            "Brig is a skirmisher. You are always looking to deal damage without getting blown up and your tools for survival are your shield and shield bash. If you constantly proc inspire and have good damage and heal pack use you'll give your team a ton of momentum.\n\nIf you do get blown up it's because you aren't using cover or you're making yourself a target in front of too many enemies at once. You should play near cover so you can shield bash away when you need to and always play with your team unless you get the opportunity for a favorable duel.\n\nYou just need to keep playing her and look at where you mess up. Having good game awareness really helps on Brig.",
            "What's the controversy?",
            "Brig is really good at holding choke points and protecting the backline. Especially with Sombra being in nearly every game, you gotta make sure your other support is protected. Brig can be really hard to kill",
            "A gm support here.\n\nBrig is played best as a reactionary support that counters pressure from enemies.\n\nIdeally, You control a position, or you play as a bodyguard for a squishy high impact character on your team like ana, zen, widow etc. \n\nShe controls space very well. If the enemies don’t do anything, don’t force anything. That’s what we call “feeding”.Just hit your flail to trigger inspire, give healthpack if anyone needs them, scout and wait.\n\nForce the enemies to do something, to expend resources. When they do, counter their push using flail to boop them abd slow them down, shield to absord pressure, bash for either running away or finishing someone off, and health packs for your other teammates who are getting pressured.\n\nYou are not exactly as a tank, but you aren’t a support that can get long range value either. She’s kinda in between. \n\nYou are the backline bait. If the enemy doesn’t take it, they aren’t doing anything. If they do, you get immense value"
        ]
    },
    "Why am I so much better at tank than dps?": {
        "title": "Why am I so much better at tank than dps?",
        "score": 16,
        "url": "https://www.reddit.com/r/OverwatchUniversity/comments/1dr60n8/why_am_i_so_much_better_at_tank_than_dps/",
        "content": "Is it just mechanics?\n\nI've played Genji and Cassidy for like 1.5 years. Peaked masters 2 on console, before i swapped to PC and got diamond 4 in season 8. Got plat 2 in season 9, but I'm now in plat 4.\n\nI recently started playing tank tho, and only playing Winston and a tiny little bit of Sigma I've gotten Masters 3 on PC. Are my mechanics just bad? I would assume that tank is more brain oriented, whilst dps is more mechanics.",
        "num_comments": 24,
        "comments": [
            "I dunno but dps seems harder for me than other roles too. I just picked up bap had like 2 hrs on him and got diamond 3 on pc straight from gold due to dpsing him. However play actual dps and I'm mid plat.",
            "Tanks don’t have to pay as much attention to contesting angles. Good DPS players are working on that and finding their own off angles. Not stuff you tend to do on tank",
            "I'm also much higher on tank than dps. I'd agree the reason is mostly mechanics. For tank, climbing is mostly about conceptually learning the game. Stuff like knowing what style to play into what comp, learning to stop inting, and learning when to pull the trigger to ult. For dps, once you learn to take some decent angles, the rest is really all about winning that duel and hitting that headshot. I think i'm pretty good on dps when im really warmed up, but tbh its really hard to stay at your mechanical peak all the time. I think thats also why high rank dps players are all so deranged. You simply cannot retain your humanity with how much they need to grind to keep their mechanics up",
            "for tank you need good game sense, which you have from playing for so long.\nfor dps you need okay game sense and good aim, or vice versa.",
            "play a hitscan hero and see how well you do",
            "Because tank players are really bad right now and there's people that don't queue tank queueing to get fast games",
            "Tank is all decision making and game sense, you’re kinda painting with a broad stroke to impact the game cause you’re team lead.",
            "This is not uncommon. You have masters game sense and plat aim.",
            "Not sure, Genji and Cass are usually really strong dps and not too demanding. But that could be why, playing really common heroes with easy value leaves less room for skill expression. Winston and Sigma wouldn't have that issue nearly as much.",
            "Some people can only perform single threaded tasks(thinking), not all of players can perform well with role that requires multi threading capability like DPS (think, moving, and aiming)."
        ]
    },
    "What's a tank to do against a Tracer?": {
        "title": "What's a tank to do against a Tracer?",
        "score": 5,
        "url": "https://www.reddit.com/r/OverwatchUniversity/comments/1draajg/whats_a_tank_to_do_against_a_tracer/",
        "content": "I'm usually a low masters support and high diamond/low masters dps. Trying my hand at tank and am not sure exactly what's the best way to deal with tracer. \n\nPlayed a game yesterday where my team was getting decimated against tracer. Was a control map where my team was junk and ashe on damage (mid plat) and I was initially playing Ram. My support was bap and Moira. The enemy tracer was just destroying them. The junk and bap were flaming the hell out of me despite the bap being 0-6. \n\nFrom a damage player perspective, I know how to handle this situation as I'd be playing Cassidy or Sombra. But my team refused to swap heroes and just blamed me for....I'm not sure what. Real talk though, I feel like dealing with tracer isn't my job as a tank who is either trying to hold front line as I can't be chasing tracer around the map. What should I be doing in this instance as tank?\n\nEdit: the enemy tank was JQ which was constantly pushing up and they had an Ana that was making sure to use nade on me anytime possible. ",
        "num_comments": 3,
        "comments": [
            "Tank doesn’t deal with tracer unless she’s one of the last ones left",
            "I'm silver 2 so take my advice with a grain of salt.\n\nJust ping her location even if it is just footsteps just ping the approximate location so the supports and dps can check and prepare, let them handle the tracer afterwards, they get rolled it's on them as you'd be busy with the other enemy dps and tank if the Tank gives space check if the back line need assistance, if they're chasing the tracer around I'd recommend backing up and grouping up after they kill the tracer for a 5v4 team fight in your favor.\n\nEdit: I'm a silver 2 support but Gold 3 on Tank but I play support far more so I'm giving advice from a Support stand point",
            "Masters tank console here\n\nJQ - you can't get close to her even as a tank it ain't worth it in these situations. Ramm especially just feeds against junker queen and you just need to switch\nAna - dive her if she's the problem\nTracer - DVa defense matrix to help your team, dive ana and their other support so they'll be forced to look at you. That way hopefully the tracer will either fall back or be forced to take an unfavorable duel.\n\nIf you don't play DVa, you could play hog and hook her. \nIf you only play ramm you probably won't be able to kill tracer. Junker queen has to get close so you could shield behind her to block her healing before switching to nemesis and killing her or forcing her back. Don't let her play aggressive you need to be more aggressive. Your shield is the only thing protecting you from ana grenade and sleep so you need to be mindful of it's placement. \n\nSometimes ignoring the tracer might be the best idea even if it sounds stupid. Put more pressure than their tracer.\n\nHope this helps"
        ]
    },
    "How do different types of CC affect Junkrat?": {
        "title": "How do different types of CC affect Junkrat?",
        "score": 3,
        "url": "https://www.reddit.com/r/OverwatchUniversity/comments/1drb4ls/how_do_different_types_of_cc_affect_junkrat/",
        "content": "I guess my point is this: In Mauga cage and Zarya grav, most movement abilities are completed canceled so you can't use them. But Junkrats mines are still available, and you can still just... use them how you like. (More so in cage, then grav) So how do other types of CC interact and affect Junkrat when he's conc mining? Things like hinder, Mei's slow, etc. Do they slow him down? Do they not affect him at all? I haven't really noticed much for the many different interactions, and I play Junkrat a lot.",
        "num_comments": 0,
        "comments": []
    }
}