{
    "Welcome To The Overemployed Metaverse": {
        "title": "Welcome To The Overemployed Metaverse",
        "score": 0,
        "url": "https://www.reddit.com/r/overemployed/comments/1d9v0ir/welcome_to_the_overemployed_metaverse/",
        "content": "Hey Overemployed Nation, aka your work fight club!\n\nLet's cut to the chase...all the info you need to start is in the website FAQ>>> [https://overemployed.com/faq/](https://overemployed.com/faq/)\n\nYou can also join our Discord chatter from the website or [directly from here](https://discord.com/invite/a8VGhbZyek). Get your questions answered by our paying community members who are the REAL Overemployed Pros having 2x, 3x, and 4x+ for years.\n\nThanks for checking out this subreddit. Any post here will get automod so if your post didn't make it then head to the Discord to re-post. \n\nWe host a monthly AMA event (Clubhouse-like) for our Discord community members. So come join us: [https://discord.com/invite/a8VGhbZyek](https://discord.com/invite/a8VGhbZyek)",
        "num_comments": 0,
        "comments": []
    },
    "New Blog Post: Test out the waters of semi-retirement with remote work flexibility": {
        "title": "New Blog Post: Test out the waters of semi-retirement with remote work flexibility",
        "score": 0,
        "url": "https://overemployed.com/remote-work-flexibility-gateway-to-a-semi-retired-lifestyle/",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Curious what do you think about this? Leave a comment in the blog post and I'll respond personally!"
        ]
    },
    "Never stop Applying for Js ": {
        "title": "Never stop Applying for Js ",
        "score": 77,
        "url": "https://i.redd.it/5z6b5fsg6i9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "I have 4 jobs and I had 3 interviews this week. I look at jobs pretty much daily. If I dont, the volume gets annoying to sift through.",
            "Same. I am starting J3 and I have two interviews lined up on 2nd & 8th",
            "![gif](giphy|3owyoUHuSSqDMEzVRu|downsized)"
        ]
    },
    "I just rage-quit J2, please join me in a post mortem": {
        "title": "I just rage-quit J2, please join me in a post mortem",
        "score": 257,
        "url": "https://www.reddit.com/r/overemployed/comments/1dqypht/i_just_ragequit_j2_please_join_me_in_a_post_mortem/",
        "content": "I *just* started OE for the first time three months ago. J2 paid the same as J1 but I quickly realized it was at least twice as much work... however I'm great at setting both expectations and boundaries in a cordial and professional way so that aspect was working okay. \n\nBut what I couldn't stand right from the start was my direct boss (who is the CEO and founder). He is a 26 year old who has landed his first large government contract and for the first time in his life had to hire people. His co-founder is very experienced middle-aged lady who mentors him, she and I worked together for the first two months and it went just fine. But then the plan was to transfer me to report to the CEO after I learned the ropes, and holy shit was that a disaster. \n\nThe very first week I worked with this guy he got pissed off and literally yelled at me in a meeting over a typo in the company name in the plans I had drawn up (which were only for internal use not presented to customers or anything). Think if I wrote \"LuluLemon\" instead of \"Lululemon\".  I had typed it correctly in all the rest of the document but in one spot there was an obvious typo. I couldn't believe it was happening. And then this same kind of thing kept happening: this guy would spend the first 15 minutes of every 30 minute meeting nitpicking the things that in his opinion, I had done \"wrong\", and it was always insignificant things like the typo, or else my failure to read his mind, like \"why did you put this section first and that one second I have always preferred it the other way, I thought you were a professional.\" \n\nWell I am. I'm a mid-career professional. This was the kind of petty hostility I had seen when I worked in McDonald's as a teenager and never again since... Until now.  \n\nI've spent the last three weeks reading up on how to manage difficult managers. And ya know I'm good at finessing people, my first career was in sales. I thought I could crack him and build a working relationship. But I couldn't hack it. It was like hitting a brick wall. Cheerful camaraderie, subtle flattery, overt flattery, gentle-parenting him like a toddler (redirecting his attention to the meeting agenda in an entertaining \"omg look a squirrel!\" type of way when he got fixated on how I had failed to use the correct font, for instance) ... nothing worked. \n\nAnd idk I think I have discovered something new about myself: I get very very demoralized when I'm constantly criticized, nitpicked, and called incompetent by my boss. I thought I was chill enough on the inside to just shrug it off and keep getting that extra paycheck, because what the fuck do I care if my boss is sweet to me? ... But dang, y'all, it turns out I do care. It did impact me on an ego level as well as on a self-esteem level. This past week I have been terrible at setting boundaries, I caved and worked waaaaay overtime just so I could get *at least one win* with this asshole who was impossible to please. My latest theory was that he was just crazy enough and irrational enough that if I could somehow impress him ONE time, then he'd flip and stop being so hostile. And that theory made me drive myself beyond my limits this week, I worked 60 hours at J2 alone. \n\nToday, after this hellish week when I have cheerfully taken every criticism and made every irrational change he asked for, he told me he needed me to re-do alllllll the work all over again because [insert different idea he has], and he wrote in the email: \"honestly as you are the professional with expertise in this area you should have suggested these changes yourself, I have waited all week to give you a chance to prove that you know what you're doing.\" \n\nI just quit on the spot. I think I'm burned out and pissed off and it was just the straw that broke my back. \n\nNow I feel really foolish and I keep thinking I should have maintained my cool, stopped trying to play nice, and stuck to my work hours, let him fire me if he's unhappy. But all of that is a lot easier said than done for me at least. Turns out I do care about stupid shit like getting my boss to like me and approve of my work. Turns out I need to know that my contributions at work are appreciated, and turns out I can't take it when my competence is constantly questioned. \n\nIt's a depressing lesson to learn about myself but I am who I am. Onward I guess! I'm already interviewing for two new roles, wish me luck.",
        "num_comments": 90,
        "comments": [
            "Don't beat yourself up for having self respect. You probably couldn't reach him because he was strung out on Adderall. He was a junkie.",
            "Should have started to include subliminal digs at him and the company in your work.  Make it a game to entertain yourself until they fired you instead.",
            "Nah, this is also a great OE experience.  Imagine if this J2 were your only job? \n\nOE also gives you the luxury *to not take anyone's bullshit.*",
            "Fuck it-good for you! I feel like the 26 y/o is trying way too hard to look 'like a boss' in front of other employees and conflates being a hard ass with being a leader. Now it's his hot mess to clean up and he'll get humbled bc he made this bed and now he has to lie in it, whereas you have another job to fall back on. And that's the whole point of OE right? It's not worth the extra cash to take shit off someone like that all day. Cheers dude and congrats on being free!",
            "Im the opposite. If someone rubs me the wrong way and tries to make life difficult for me at work I shut down completely and lose interest. I dont quit though. I just become useless. \n\nThis primarily works because my J3 is 1099 so its all under an LLC. Technically Ive never been fired before. But my company has been a couple times.",
            "Leave a job review calling him a narcissistic boss.",
            "Im a lurker and sadly I only have a J1. The CEO I deal with sounds exactly like what youre describing down to nitpicking colors of fonts in internal documents and locations of stupid things that dont matter! If you had said he was a mid-40s short ugly man with small teeth Id think we were working for the same guy. Good for you and screw that guy and every other boss thats like him.",
            "This is one of the reasons we put up with it, because imagine not being able to just quit because you need the paycheck?",
            "His co-founder has her hands full.  I dont envy her having to teach how to be a basic human being to the CEO.",
            "You did the right thing. There was no way to sustain in that environment OE or not. Would another 5 or 10 grand change your life if you drug it out for another few weeks?"
        ]
    },
    "I love it when companies get an L for trying to force their employees to work in the office! ": {
        "title": "I love it when companies get an L for trying to force their employees to work in the office! ",
        "score": 294,
        "url": "https://i.redd.it/fikcq5vy2e9d1.jpeg",
        "content": "",
        "num_comments": 36,
        "comments": [
            "I dont understand this. Promotions are for the company. Multiple employees working hard for limited seats. That benefits the company.\n\nAll this does is make people not want to work as hard.",
            "How do you think this is an \"L\"?  Looks like forced attrition saved them a ton OPEX.",
            "Aw, Dell thought the employees they screwed over had ever been counting on promotions in the first place. That's cute.",
            "That's actually a huge W.",
            "Whats dell? Lmao havent touched dell since I had dialup",
            "The double edged sword though is that the best workers likely left and they're stuck with the lower performers who couldn't find work elsewhere. Those high performers make a huge difference long term",
            "Dell is shit either way, overall W for the workers that left.",
            "Yeah now they'll just rehire for the same positions for less pay and require in office",
            "Whoever was responsible for this is more likely to be someone who has a quarterly bonus tied to overhead or cost reduction, not someone with a stake in Dell's long-term success.",
            "Everyone gets to decide for themselves who the best performers are and are not.  Maybe the CEO of Dell thinks the best performers are those who would RTO for the chance of a promotion.  I am not going to  say the CEO is wrong.\n\nAt the same time, I would not RTO for a chance at a promotion.  I am OK with the CEO labeling me \"not a best performer\".  Since there is no money attached to the label there is really no reason to work for it."
        ]
    }
}