{
    "Weekend RAGE Thread - June 22, 2024": {
        "title": "Weekend RAGE Thread - June 22, 2024",
        "score": 6,
        "url": "https://www.reddit.com/r/Overwatch/comments/1dlqluy/weekend_rage_thread_june_22_2024/",
        "content": "HERE YOU CAN GET RID OF ALL YOUR ANGER AND HATE.\n\nCAPS ON AND LET IT ALL OUT. \n\nGETTING NOTHING BUT DUPLICATES WHEN ALL YOU WANT IS THAT SWEET NEW TORBJÖRN SKIN? GETTING HEADSHOT BY ACROSS THE MAP BY HANZO? TOO MUCH JUSTICE THAT RAINS FROM ABOVE? THIS IS THE RIGHT THREAD!\n\nPLEASE STILL BE CIVIL, AT LEAST A LITTLE!",
        "num_comments": 16,
        "comments": [
            "PLEASE SHOOT THE MERCY WHILE SHE'S RESURRECTING! WHY IS IT ONLY ME!? SHE'S IN OUR ZONE BY HERSELF!",
            "I just got off three back to back matches against teams who knew what they were doing, around my skill level. With teams WHO DIDN'T EVEN GET ON THE DAMN OBJECTIVE ONCE. AND WHO WERE PLAYING DEATHMATCH INSTEAD OF OVERWATCH. WHO WERE PLAYING DEATHMATCH VERY POORLY. BECAUSE EVERY TIME I TRIED TO DO ANYTHING OTHER THAN KILL OFF STRAGGLERS AS SOMBRA, I COULDN'T RELY ON THEM TO EVEN STAY ALIVE.\n\nI've seen it said here so many times that \"If you were good enough, you wouldn't have lost\" or \"sounds like you belong in your rank\" ... NAH, MATE. TEAM GAME. SOLO PLAYER.",
            "SHOOT THEIR FUCKING TANK SHOOT THEIR FUCKING TANK THEYRE NOT IMMORTAL GOD I HATE MY DPS PLAYERS IM GRABBING ALL THEIR TEAM'S ATTENTION AND THEY HAVENT PACKED UP A HALF HP ORISA FUCKKKKKKKK STUPID ASS DPS PLAYERS",
            "Lifeweaver changes I'm not a HEALING PYLON",
            "The qp matchmaker has gone to sleep and it's ruining my life :(",
            "WHY IS IT 2 TYPES OF CREDITS I LITERALLY NEED 10 MORE LEGACY CREDS TO 3000 FUCK YOU BLIZZARD",
            "Welcome to r/Overwatch!  Please use the following resources via the links below to find relevant information about the game and the subreddit.\n\n[Overwatch Patch Notes](https://overwatch.blizzard.com/en-us/news/patch-notes/) | [Overwatch Bug Report Forums](https://us.forums.blizzard.com/en/overwatch/c/bug-report/9)\n\n[r/Overwatch Rules](https://www.reddit.com/r/overwatch/wiki/rules) | [r/Overwatch FAQs](https://www.reddit.com/r/overwatch/wiki/faq) | [r/Overwatch Common Bugs and Posts](https://www.reddit.com/r/Overwatch/wiki/commonbugsandposts)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Overwatch) if you have any questions or concerns.*",
            "WHY ON EARTH , WHEN I SETUP A TEAMFIGHT AS DOOM, EVERY SINGLE TIME ATLEAST 2 OF MY SQUISHY DIE IMMEDIATLY BEFORE I CAN EVEN GET TO AN BETTER ANGLE AT ALL............",
            "For those of you complaining that Lifeguard Kiriko is wearing shoes, fear not! Calamity Empress Ashe has you covered!\n\nThat's why I am skipping this skin, that really bugs me.",
            "ow keeps disconnecting me from game. repeatedly. causing me suspension cooldowns and endorsement lvl. removes me from game to loading screen and then to main menu. all under 5 seconds. WHYYYYYY"
        ]
    },
    "Overwatch Retail Patch Notes - Jun 20, 2024": {
        "title": "Overwatch Retail Patch Notes - Jun 20, 2024",
        "score": 633,
        "url": "https://overwatch.blizzard.com/en-us/news/patch-notes/",
        "content": "",
        "num_comments": 647,
        "comments": [
            "The kiriko change really needs a full list of what it doesnt and does clenase now",
            ">Flashbang\n\n>Magnetic Grenade ability is now Flashbang\n\nI genuinely laughed out loud",
            "For Push Maps\n\n>Reduced the match time from 10 minutes to 8 minutes in Quick Play.\n\nYAY!",
            "Nobody talking about the map changes to Colosseo? Looks *way* better with more cover and less punishing chokes.",
            ">sym hp and beam ramp up speed buffs\n\nSymmetra finally putting away the clown nose?",
            "kiriko mains are not gonna like this",
            "we all just wanted a mag nade rework...\n\nblizzard rained nerfs upon the poor fool.",
            "Wasn't Lifeweaver supposed to get buffs?",
            "NOOOO SYM IS GONNA GET NERFED IMMEDIATELY",
            "Junk queen buff <3"
        ]
    },
    "Best posing coincidence in arcade mode": {
        "title": "Best posing coincidence in arcade mode",
        "score": 1585,
        "url": "https://i.redd.it/s3u8rccz508d1.jpeg",
        "content": "especially with me in the middle with potg lol",
        "num_comments": 33,
        "comments": [
            "Daaamn this is FIRE. 🔥🔥🔥",
            "When's the album drop",
            "[deleted]",
            "BRO COOKED AND EVERYBODY WAS HUNGRY 🗣️🗣️🗣️🔥🔥",
            "*Fire emoji*",
            "You can probably get some Michelin stars from this",
            "When ur the main character",
            "Y'all putting Gordon Ramsay to shame cuz y'all cooking a 5 star meal over here.",
            "That’s sick",
            "Nobody felt like eating but bro cooked anyways 🗣📣🔥🔥"
        ]
    },
    "Can we all agree Mythic Weapons cost too much?": {
        "title": "Can we all agree Mythic Weapons cost too much?",
        "score": 291,
        "url": "https://www.reddit.com/r/Overwatch/comments/1dll3la/can_we_all_agree_mythic_weapons_cost_too_much/",
        "content": "I know they aren’t even out yet, but Reinhardt’s hammer will cost 50 prims just to unlock, and then has additional tiers, so it’ll probably be 80 Prisms anyway.\n\nEither Blizzard decreases the unlocking price to 30, or increase the Prisms in the BP to 100, because having two Mythics where you can only even unlock one, without getting anywhere near maxing out, seems excessively greedy even by their standards.\n\nIt’s just one weapon that probably isn’t even customisable, you just have to unlock extra tiers for a ‘flourish’. Not a weapon-inspect, the thing from the Season 1 trailer BTW, just a ‘flourish’.\n\nWith it being just a hammer, Reinhardt’s shield and charge are probably the same as normal, since Firestrikes and Earthshatter come from the hammer.",
        "num_comments": 112,
        "comments": [
            "Honestly I think the changes to Mythic skins are just to ensure people buy the Battle Pass even when they're shit. The content in this BP is really weak imo, but I'll get it for the prisms.",
            "EVERYTHING costs too much in this game tbh",
            "Stop giving them money to begin with",
            "Total all is 60 prism but yeah it's cost too much for a weapon only",
            "I got one word for you brother.\n\nMoney\n\nAnd since the gaming community doesn't see cosmetic microtransactions as a bad thing, this monetisation method will only ever get worse. Y'all need to stop giving them money at the VERY least if you expect change",
            "it's 10 bucks to get the premium BP.  Just do your weeklies and your dailies when you can and you should get all of the stuff you need in a season.  It's not likely that you'll like all of the Mythics that they release, so you'll have a chance to stock up points towards things you want.  And if you play enough and finish the BP, you are getting the next BP at a discount because you earn the coins you can spend on the BP while playing the game and progressing through the BP.  Plus, the Progession Weekly Challege nets you coins as well (though that one will get harder and harder to earn the more you play the game.",
            "Blizzard gave more mythics, without taking anything back = players mad.\n\nIt's as clear as day that the new mythic weapons are for people who aren't reluctant to buy mythic prisms + good alternative to people who don't main a character with season mythic skin. Really doubt they're going to lower the price",
            "it took 1 season for them to ruin this. we should've known the mythic shop was just another attempt to take money.",
            "Apex legends have mythic weapons that cost $300. People still spend the money for them.\n\nOW2 is pretty “fair” in that you at least get the option to choose what you want to unlock.",
            "Yeah I think it’s a bit absurd. \n\nWhen the mythic shop came out and we all saw how expensive mythic skins would cost it wasn’t too terrible because it kind of just reinforced that the BP is a pretty good deal. \n\nBut now you can’t get every mythic cosmetic just by keeping up with the BP. Even if you’ve bought every BP to date, if you want all the mythic items you’re going to have to actually spend that exorbitant amount that previously didn’t apply to you."
        ]
    },
    "Funniest way someone said they carried you have ever witnessed ?": {
        "title": "Funniest way someone said they carried you have ever witnessed ?",
        "score": 564,
        "url": "https://www.reddit.com/gallery/1dlgj7d",
        "content": "",
        "num_comments": 55,
        "comments": [
            "Thank for the Winton",
            "I had someone say that they're going to be built like Reinhard after the match.",
            "Not quite a carry quote. Our Kiriko fat-fingered the only ult she’d used the entire flash-point game in spawn and apologized. Our Moira, who had 14k healing & 30 elims said “it’s okay. That fat-fingered ult was the most useful you’ve been all game.”",
            "I got did dirty. I played comp and we got stomped, I felt I was pulling more than my weight and passive aggressively typed \"1 vs 5\" when an enemy player was like \"Nah definitely not you\"",
            "Someone on my game said \"yall gotta step it up I feel like a chinese kid working in a factory\"💀",
            "Am I in math class? Why do I keep carrying the four?",
            "Not even Noah carried this many animals",
            "Winton",
            "\"I just kept 4 kids with metal forks in a best buy alive\"  -A lifesaver in a game with a very confident reinhaardt",
            "I must’ve gotten my CDL during this game the way I’m carrying these short bus attendants"
        ]
    }
}