{
    "Palestine Info Hub": {
        "title": "Palestine Info Hub",
        "score": 44,
        "url": "https://www.reddit.com/r/Palestine/comments/1dfpa2q/palestine_info_hub/",
        "content": "[View Post](https://sh.reddit.com/r/Palestine/post-viewer/1dfpa2q)",
        "num_comments": 1,
        "comments": []
    },
    "Strict Policy Notice: Immediate Ban for US Election Discussions on r/Palestine": {
        "title": "Strict Policy Notice: Immediate Ban for US Election Discussions on r/Palestine",
        "score": 134,
        "url": "https://www.reddit.com/r/Palestine/comments/1dnlpch/strict_policy_notice_immediate_ban_for_us/",
        "content": "🚨 Attention to all members of r/Palestine: \n\n**As the 2024 US elections approach, we remind everyone that all discussions related to these elections are strictly prohibited on this subreddit. This includes any posts, comments, or off-topic discussions that attempt to engage in political discourse about the upcoming elections.**\n\nAll parties share unconditional support for Israel. **We couldn't care less** about the domestic policy or partisan nuances.\n\nWe kindly ask all members to respect [this rule](https://www.reddit.com/r/Palestine/wiki/rules/#wiki_rule_.231._subreddit_guidelines) to maintain the focus of this community on relevant topics pertaining to Palestine. Any violation of [this rule](https://www.reddit.com/r/Palestine/wiki/rules/#wiki_rule_.231._subreddit_guidelines), whether by making posts or derailment of discussions in any post, will result in an immediate and permanent ban from r/Palestine.\n\nThank you for your cooperation in keeping this subreddit a constructive space for discussions related to **Palestine**.",
        "num_comments": 1,
        "comments": []
    },
    "Zionist in berserk mode as she expects Tokyo protest to stop at her command. Great job Japan. ": {
        "title": "Zionist in berserk mode as she expects Tokyo protest to stop at her command. Great job Japan. ",
        "score": 1475,
        "url": "https://v.redd.it/3l7zciuyzg9d1",
        "content": "",
        "num_comments": 106,
        "comments": [
            "**Looks like this thread is getting a lot of attention. Greetings r/All! Please keep it civil.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Palestine) if you have any questions or concerns.*",
            "Why is this white woman screaming at people protesting in their own country?",
            "And all together : ISRAEL IS TERRORIST",
            "I love how the Japanese people protest. I hope their voices are heard. Free Palestine 🇵🇸",
            "When Israhell stop their terrorism, they'll stop chanting love.",
            "It's about time for dictionary publishers to consider adding to the \"entitlement\" entry.\n\n\"c - The everyday state of mind of a zionist.\"",
            "You don't expose Zionists, Zionists expose themselves!",
            "Zionist can only scream and pull the anti-Semitism card now.... The majority of the world won't be fooled anymore by their lies",
            "The rage in her brainwashed eyes",
            "She thinks she’s still at work."
        ]
    },
    "Dallas community welcoming Adam (8 years old), who came from Gaza after losing his leg in an Israeli drone attack on his house.": {
        "title": "Dallas community welcoming Adam (8 years old), who came from Gaza after losing his leg in an Israeli drone attack on his house.",
        "score": 1289,
        "url": "https://v.redd.it/2w9g1auheg9d1",
        "content": "",
        "num_comments": 22,
        "comments": [
            "Bless everyone who welcomed him- wee angel 💜💜💜",
            "Every child in Gaza deserves this love and celebration of their life 🥺💚",
            "I am happy with this news and I am glad that the people of Dallas are helping, but taking the child to America just feels wrong. Unless there was no alternative of course. This is the country that has given Israel the political backing, tools, money, etc. to occupy and illegally settle Palestinian land for decades. Even the weapon that took away his leg had a high chance of being American in origin.",
            "I'm happy for him. I hope he gets revenge one day against the bastards that did this.",
            "I pray for so many blessings to him and all the kids of Gaza ❤️❤️❤️❤️",
            "The sad truth is, it should never have gotten this far!!! We shouldn’t have to evacuate people out of their own country after suppling the Israelis with the bombs that are inflicting such atrocities and murder!! I’m so happy for the little guy but he must really scared!!!😢🇵🇸❤️\n\nCountries that are sitting on the sidelines watching should be ashamed of themselves!!!",
            "This made me cry.\n\nI wish we could celebrate all of the victims and their families.",
            "May all the martyrs be greeted by the angels in heaven in this manner. Ameen 🤲🏽",
            "That must be the most surreal experience for that kid.",
            "🥰 how Adorable of them"
        ]
    },
    "Palestine Flags at Glastonbury 2024 yesterday. ": {
        "title": "Palestine Flags at Glastonbury 2024 yesterday. ",
        "score": 155,
        "url": "https://i.redd.it/kcygh7f2ii9d1.jpeg",
        "content": "Several flags were seen throughout the first day and during many performances.\n\nEven some of acts that performed such as Blur frontman & Gorillaz member Damon Albarn spoke out in support of Palestine during his surprise appearance. During Dua Lipa's (she was the headliner for the first day yesterday) set, she sang right next to a Palestinian flag.\n\n(Picture source: @BrightonPSC on Twitter).",
        "num_comments": 7,
        "comments": [
            "Awesome to see this! Thanks for posting",
            "Beautiful!!❤️🇵🇸",
            "#WARNING!\n\n**OP, please ensure you provide a source link**, either within the body of your post or in the first comment after posting. Merely mentioning the source name is insufficient. Failure to comply may lead to the removal of your post. Repeated infringements of [rule #4](https://www.reddit.com/r/Palestine/wiki/rules/#wiki_rule_.234._sourcing_policy) may result in temporary or permanent bans. If you have already done so, please disregard this warning.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Palestine) if you have any questions or concerns.*",
            "[Source of the image](https://twitter.com/BrightonPSC/status/1806765528515588096?t=YjhkQ43ajmhwbomTy1Xyqg&s=19)",
            "#\n#\nSupport Palestine refugees with UNRWA today! Your donation provides crucial food and cash assistance to thousands of families. **[Give now!](https://donate.unrwa.org/)**\n\n[Join our official discord server!](https://discord.gg/qAJ3v6jgjy), and visit our [Palestine Twitter Community](https://twitter.com/i/communities/1504131282137239555).\n\nThis is a heavily moderated subreddit. **Please read the [rules](https://www.reddit.com/r/Palestine/wiki/rules/)**, and report any post or comment displaying: Zionist propaganda hasbara, bigotry, hate speech, genocide denial, Islamophobia, trolling, etc.\n\n**Warning:** Off-topic content will not be tolerated. Stay on the sub-topic or risk being banned. (Examples include, but are not limited to, US elections/domestic policy, the Russia/Ukraine war, China's treatment of Uighurs, and the situation in Kashmir.)(0)\n\nIf this is a video post, you can download it from here: [RedditSave](https://redditsave.com/info?url=https://www.reddit.com/r/Palestine/comments/1drb3xp/palestine_flags_at_glastonbury_2024_yesterday/) or [Viddit.red](https://viddit.red/?url=https://www.reddit.com/r/Palestine/comments/1drb3xp/palestine_flags_at_glastonbury_2024_yesterday/).\n\n>!(Thanks for posting, u/powerspyin1!)!<\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Palestine) if you have any questions or concerns.*"
        ]
    }
}