{
    "Pandabuy Announcement": {
        "title": "Pandabuy Announcement",
        "score": 910,
        "url": "https://www.reddit.com/r/Pandabuy/comments/1c3mt97/pandabuy_announcement/",
        "content": "Dear valued users,\n\nWe sincerely appreciate your continued attention and support to Pandabuy. Recently, our company has encountered legal issues related to our services, as our senior management is actively cooperating with the police investigation. Currently, we are fully collaborating with the relevant authorities to ensure that all our business activities comply with legal regulations.\n\nWe understand that this situation may have caused inconvenience and concern for you. Please rest assured that we are actively addressing these issues and commit to keeping you informed of any developments. In the meantime, our team and the authorities are taking every necessary measure to protect your rights and ensure data security.\n\nWe kindly ask for your patience and understanding as we strive to restore normal operations as quickly as possible. During this challenging period, we pledge to prioritize serving you to the best of our abilities.\n\nOnce again, we thank you for your understanding and support and we apologize for any inconvenience this may have caused.\n\nPandabuy's online customer service, community management, and other departments will begin handling your inquiries today. If your questions have not been answered yet, please be patient with our customer service and mods. Due to the high volume of inquiries, we will do our best to respond to you as soon as possible.\n\nTo help users understand the situation more quickly, we have collected some of the most frequently asked questions below:\n\n**Regarding Orders and Packages**  \nQ: Can I still place orders on the platform?  \nA: Currently, Pandabuy accounts cannot conduct transactions such as recharging, paying orders, or handling packages. The police investigation is still not over, our warehouse is still not back to normal, and due to the freezing of some of our funds, We are currently unable to provide services such as top-ups and withdrawals at this time. We are negotiating with the third-party payment company to restore the function as soon as possible for everyone to use, once restored, we will make an announcement in the community and the platform. Please be patient for a while, Pandabuy will still provide you with the best service.\n\nQ: What should I do if the seller does not ship the goods?  \nA: You can contact purchasing consultation; the shipping time depends on the seller.\n\nQ: What should I do if purchasing does not reply? What is the response time?  \nA: Purchasing has begun replying to customer inquiries in sequence. Due to the large volume of inquiries, please be patient.\n\nQ: Is my stored order/package/account/order/parcel on the way safe? / What if parcels in the warehouse cannot be shipped? Should I cancel the parcel? Do I need to submit the parcel?  \nA: Please understand that we are actively addressing the current issues. Please remain patient, and we will resume normal operations as soon as possible. Please wait for official announcements regarding the restoration time, at which point warehouse colleagues will proceed with signing, inspection, packaging, and shipping tasks in sequence. If you have related order or parcel needs, you can contact online customer service again. If your parcel is in transit, it will not be affected.\n\n**Regarding Refunds**  \nThe platform is still cooperating with the investigation and the warehouse is still organising goods. Regarding your item/parcel, we are still waiting for the results of the investigation and the results of the sorting before we can confirm the final status and resolution. So we are temporarily holding your refund request. We fully understand the anxiety of everyone waiting, please give us time. We will do our best to resume normal operations as soon as possible. Thank you again for your understanding and support.\n\n**Regarding Logistics**  \nQ: Any situation requiring consultation with the logistics department, such as abnormal logistics trajectories, insurance, redelivery, compensation, and after-sales inquiries.  \nA: For inquiries regarding your parcel status, please contact the logistics provider for verification. Please wait for official announcements regarding the restoration time, and we will assist you with your inquiries at that time.\n\nThis April has been particularly challenging for Pandabuy. However, we will persevere and overcome this difficulty. We earnestly ask everyone to have more patience and understanding towards Pandabuy, and we also appreciate everyone's attention to Pandabuy. We are actively cooperating with investigations, and we will correct any problems identified. Even if there are no problems, we will conduct internal reforms and reflections to continue providing everyone with a satisfactory shopping platform.\n\nSinserely,  \nPandabuy Team",
        "num_comments": 773,
        "comments": [
            "You guys have to stop promoting on huge platforms to save your company. Tik Tok caused this.",
            "The ppl raiding finna be wearing my drip bruh nah",
            "need that 50% shipping coupon \"RAID\"",
            "[removed]",
            "https://preview.redd.it/seueh8153euc1.jpeg?width=1290&format=pjpg&auto=webp&s=dc911addea8f34a6226f7c36a8e2a6deaa8b63ef\n\nTrue - all my ordered stuff is getting cancelled as I write this…",
            "Nike can fucking piss off",
            "So, anything that has been seized will be refunded?",
            "can you just simply address if stuff has been seized or not",
            "Press F to pay respect to all our stuff still at panda warehouse.",
            "Dude I have $500+ on my warehouse rn, I need a straight answer if it is SAFE or not. 😪"
        ]
    },
    "expired items": {
        "title": "expired items",
        "score": 28,
        "url": "https://www.reddit.com/r/Pandabuy/comments/1djx94b/expired_items/",
        "content": "Some of my stuff just expired last night and i was wondering if were getting extended time or something. I read that they extended the time until july 30th but it still says \"expired item\" in the warehouse",
        "num_comments": 67,
        "comments": [
            "*Dear Im_Humaaaaaaan, your post is temporarily removed to ensure it's not spam. Mod team will approve it soon if it complies with our community rules.*\n\n*If you are seeing this post on the main feed, then it was already approved.*\n\nWe sincerely appreciate your continued attention and support to Pandabuy. Recently, our company has encountered legal issues related to our services, as our senior management is actively cooperating with the police investigation. We are fully collaborating with the relevant authorities to ensure that all our business activities comply with legal regulations. We understand that this situation may have caused inconvenience and concern for you. Please rest assured that we are actively addressing these issues and commit to keeping you informed of any developments. In the meantime, our team and the authorities are taking every necessary measure to protect your rights and ensure data security. We kindly ask for your patience and understanding as we strive to restore normal operations as quickly as possible. During this challenging period, we pledge to prioritize serving you to the best of our abilities. Once again, we thank you for your understanding and support and we apologize for any inconvenience this may have caused.\n\nWe have a **[discord server](https://discord.gg/pandabuyworldwide)** with channels regarding **order, package, declaration**, etc. where you may get some help. You can also contact **[online support](https://www.pandabuy.com/about/contactus)** if there's an emergency.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Pandabuy) if you have any questions or concerns.*",
            "There probably is no item left to extend time for, authorities be wearing our stuff",
            "Lol..... PB ain't coming back. They can give you an extension till this planet blows up, you lost your money.",
            "Honey bun, sweetie pie, mushroom tip, no worries all items are currently under extended storage time. Please be patient till investigation is over",
            "Luckily I’ve been able to get most of my money back, If I were you guys just chargeback don’t even wait anymore",
            "https://preview.redd.it/888qxi8izr7d1.jpeg?width=828&format=pjpg&auto=webp&s=ba07389c7bc3ceb4a0da4a9535372afd78f56232\n\nTheir response to my question about this",
            "Police already burn the warehouse bro",
            "Just asking, but what agent is everyone using since Pandabuy is down?",
            "We have extended the storage period for all of you until the end of the investigation so don't worry they won't expired.",
            "forget about the stuff you have there and move on."
        ]
    },
    "Problems": {
        "title": "Problems",
        "score": 0,
        "url": "https://i.redd.it/usalujarde7d1.jpeg",
        "content": "I cannot join the discord. the verify button does not work for me. \n\nWhenever i go to pay for something i get this error. anyone know how to fix this. \n\n",
        "num_comments": 16,
        "comments": [
            "*Dear maskfjenahan, your post is temporarily removed to ensure it's not spam. Mod team will approve it soon if it complies with our community rules.*\n\n*If you are seeing this post on the main feed, then it was already approved.*\n\nWe sincerely appreciate your continued attention and support to Pandabuy. Recently, our company has encountered legal issues related to our services, as our senior management is actively cooperating with the police investigation. We are fully collaborating with the relevant authorities to ensure that all our business activities comply with legal regulations. We understand that this situation may have caused inconvenience and concern for you. Please rest assured that we are actively addressing these issues and commit to keeping you informed of any developments. In the meantime, our team and the authorities are taking every necessary measure to protect your rights and ensure data security. We kindly ask for your patience and understanding as we strive to restore normal operations as quickly as possible. During this challenging period, we pledge to prioritize serving you to the best of our abilities. Once again, we thank you for your understanding and support and we apologize for any inconvenience this may have caused.\n\nWe have a **[discord server](https://discord.gg/pandabuyworldwide)** with channels regarding **order, package, declaration**, etc. where you may get some help. You can also contact **[online support](https://www.pandabuy.com/about/contactus)** if there's an emergency.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Pandabuy) if you have any questions or concerns.*",
            "How stupid are you",
            "Hey dear now you can join the discord again. And Pandabuy can't be ordered for this time being due to the investigation! Once we back to normal we'll notify on discord!",
            "[deleted]",
            "😂😂😂",
            "this really helps. thank you. dick head",
            "Give us our Order",
            "Hate you",
            "is it possible to ship items from warehouse",
            "is there any chance my order will still arrive after 2 months"
        ]
    },
    "Warehouse time extension?": {
        "title": "Warehouse time extension?",
        "score": 0,
        "url": "https://www.reddit.com/r/Pandabuy/comments/1dinddg/warehouse_time_extension/",
        "content": "I have some Items in my warehouse and they are running out of time. Will pandabuy keep these items in my warehouse even if time runs out? Or give a time extension?",
        "num_comments": 36,
        "comments": [
            "*Dear brxklyn__, your post is temporarily removed to ensure it's not spam. Mod team will approve it soon if it complies with our community rules.*\n\n*If you are seeing this post on the main feed, then it was already approved.*\n\nWe sincerely appreciate your continued attention and support to Pandabuy. Recently, our company has encountered legal issues related to our services, as our senior management is actively cooperating with the police investigation. We are fully collaborating with the relevant authorities to ensure that all our business activities comply with legal regulations. We understand that this situation may have caused inconvenience and concern for you. Please rest assured that we are actively addressing these issues and commit to keeping you informed of any developments. In the meantime, our team and the authorities are taking every necessary measure to protect your rights and ensure data security. We kindly ask for your patience and understanding as we strive to restore normal operations as quickly as possible. During this challenging period, we pledge to prioritize serving you to the best of our abilities. Once again, we thank you for your understanding and support and we apologize for any inconvenience this may have caused.\n\nWe have a **[discord server](https://discord.gg/pandabuyworldwide)** with channels regarding **order, package, declaration**, etc. where you may get some help. You can also contact **[online support](https://www.pandabuy.com/about/contactus)** if there's an emergency.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Pandabuy) if you have any questions or concerns.*",
            "Good morning, hope you had a nice hibernation.",
            "bruh pandabuy isn’t coming back, forget about the items and chargeback ur money bro",
            "someone tell him",
            "Go ahead and get your refund, champ.",
            "That was exactly what they want. To escape from refund. Items will be destroyed once it expires on the storage",
            "Would PayPal find it suspicious that I’m charging back orders from a while ago?",
            "I paid debit card can I get a refund or am I fuked",
            "It’s dead PandaBuy",
            "[removed]"
        ]
    },
    "Qc's pandabuy": {
        "title": "Qc's pandabuy",
        "score": 3,
        "url": "https://www.reddit.com/r/Pandabuy/comments/1dhhaod/qcs_pandabuy/",
        "content": "is anyone able to check the archive of pandabuy qc's? ",
        "num_comments": 28,
        "comments": [
            "*Dear Solo-Mario, your post is temporarily removed to ensure it's not spam. Mod team will approve it soon if it complies with our community rules.*\n\n*If you are seeing this post on the main feed, then it was already approved.*\n\nWe sincerely appreciate your continued attention and support to Pandabuy. Recently, our company has encountered legal issues related to our services, as our senior management is actively cooperating with the police investigation. We are fully collaborating with the relevant authorities to ensure that all our business activities comply with legal regulations. We understand that this situation may have caused inconvenience and concern for you. Please rest assured that we are actively addressing these issues and commit to keeping you informed of any developments. In the meantime, our team and the authorities are taking every necessary measure to protect your rights and ensure data security. We kindly ask for your patience and understanding as we strive to restore normal operations as quickly as possible. During this challenging period, we pledge to prioritize serving you to the best of our abilities. Once again, we thank you for your understanding and support and we apologize for any inconvenience this may have caused.\n\nWe have a **[discord server](https://discord.gg/pandabuyworldwide)** with channels regarding **order, package, declaration**, etc. where you may get some help. You can also contact **[online support](https://www.pandabuy.com/about/contactus)** if there's an emergency.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Pandabuy) if you have any questions or concerns.*",
            "I have my pandabuy links saved in the app and i can check Them and take them to another agent",
            "U need to use an pc",
            "It works on computer. Just click esc when the note is coming up and you should be able to view the qcs",
            "Is pandabuy up running again??",
            "Site called reparachive",
            "https://qc.pandabuy.com/ \n\nPut pandabuy link here",
            "What agent would you guys recommend?",
            "The platform is undergoing adjustments, and still need some time to resume operation. It's up to the investigation so once it's over we will notify everyone. Thanks for your understanding and support during this tough time.\n\nMay I know why you want to check QC?",
            "Why is Pandabuy down  ? When will they be back up again ?"
        ]
    }
}