{
    "FORUM LIBRE : TOURISTS AND RESIDENTS, ASK YOUR COMMON QUESTIONS IN THIS WEEKLY THREAD : Open Forum -- 23, June, 2024": {
        "title": "FORUM LIBRE : TOURISTS AND RESIDENTS, ASK YOUR COMMON QUESTIONS IN THIS WEEKLY THREAD : Open Forum -- 23, June, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/paris/comments/1dmtg4t/forum_libre_tourists_and_residents_ask_your/",
        "content": "# FR : Merci de lire avant de poster\n\nCe forum libre permet de discuter de tout et de rien et vous permet notamment de poser vos questions génériques par rapport à la ville et la région. Si vous venez d'arriver sur Paris et que vous voulez savoir où trouver des bars, manger un Pho ou trouver des clés à molette, ce forum est pour vous !\n\nPour toute question un peu plus corsée (et non touristique), n'hésitez pas à créer un sujet à part.\n\n# __________________________________________\n\n# EN : Please read before posting\n\nIf you have a simple question or tourism related one about the city, this megathread is for you!\n\nIs the pricing of the métro confusing?\n\nDo you want to know where you can find the shops that have that odd thing you're looking for?\n\nThe locals can help, ask away.\n\n&#x200B;\n\nYou should first take a look at [the wikivoyage page on Paris](https://en.wikivoyage.org/wiki/Paris) for general information. You should also download the app [Citymapper](https://citymapper.com/paris) to find your way around the city.\n\nInformation regarding the Covid situation  can be found on the official [Ministry of Europe and Foreign Affairs](https://www.diplomatie.gouv.fr/en/coming-to-france/coronavirus-advice-for-foreign-nationals-in-france/) and [Paris Visitors Bureau](https://en.parisinfo.com/practical-paris/info/guides/info-disruption-paris) websites.\n\nThe procedure to obtain a French vaccine pass can be found [here](https://www.sante.fr/how-to-obtain-a-french-health-pass). Additional information about the vaccine pass is available on the official [French Administration website](https://www.service-public.fr/particuliers/actualites/A15121?lang=en).\n\n# __________________________________________\n\n`Ce sujet est généré automatiquement tous les dimanches soirs à 21h.` \\- [Archives](https://old.reddit.com/r/paris/search?q=TOURISTS+AND+RESIDENTS&restrict_sr=on&sort=new&t=all).",
        "num_comments": 17,
        "comments": [
            "# Hello all! Coming to Paris this fall for pursuing my MSc, any suggestions which would help me integrate into the French/Parisian society a little better?",
            "Traveling to Paris tomorrow and wanted to check about the accepted payment methods in the metro? Can we use the tap and go method like Berlin or London? \nAlso whats the cheapest way to get a 24 hour pass?",
            "Bonjour! Des idees ou je peut regard match sept de le Stanely Cup ce soir?",
            "Whats a nice bottle of red wine I could buy as a souvenir from Paris?",
            "Hi, are there fully refundable accommodations around Colombes?",
            "After 6 years finally I am returning to Paris, from 10th to 16th of July, outside the military parade and the fireworks do you have any suggestions for the 14th?\n\nAnd I want to live the city non only through museums and common (and annoying) tourist stuff, so I'm looking for some niche palaces to visit and activities to do",
            "The Louvre ticketing service says reservations are open except for 18-24 July which will be made available shortly.\n\nDoes anyone know how/when/if I might be able to get a ticket during this time frame?",
            "Yes, do not ever look happy in the subway.",
            "Based on my experience, not every taxi driver will accept a dog, but enough will that I doubt you will have a problem. At CDG, make sure you go to the official taxi line -- I can totally see a scammer inside the airport telling you, \"but those taxis will not take your dog!\" -- and point out to the person tending the line that you have a dog. They will check with the taxi drivers and find one that will accept your dog.\n\nNormally, a taxi from CDG to Bastille is legally fixed as a flat rate of 56, but I think they may be entitled to add a few extra euros for a dog -- not really sure.",
            "Small correction: a basic T+ ticket works on all metro lines, including those that leave Paris and go into other zones (I guess this is about to become more complicated with the metro lines that go to the airport, but its still true as of today).\n\nAlso works on all buses, within Paris, between Paris and other zones, and in general in all zones."
        ]
    },
    "Parisians are the nicest people I have ever met!": {
        "title": "Parisians are the nicest people I have ever met!",
        "score": 101,
        "url": "https://www.reddit.com/r/paris/comments/1dr4ssm/parisians_are_the_nicest_people_i_have_ever_met/",
        "content": "We're just wrapping up our second visit to this magnificent city and I'm struck by how wonderful everybody we've met has been. I'm traveling with my wife and our three boys (two teenagers and one seven year old) and of the five of us I know the most French so I'm our cultural attaché, so to speak. I only just learned to count to ten in French but I haven't met a single person who was anything other than amiable and pleasant. \n\nAmericans who complain about French people being rude are probably coming up to people without even a simple bonjour/bonsoir, not asking if the person they're talking to speaks English before launching into a question, and likely don't even say merci at all.  Little things like that seem to go a long way from what I've experienced (or maybe I'm just extremely charming) and it's easy to see that's how people here interact and mimic it. \n\nI'm sure your patience will be surely tried with the Olympics in town next month so maybe it's for the best that we're leaving now before the craziness arrives. Au revoir Paris! 💙🤍❤️\n",
        "num_comments": 17,
        "comments": [
            "You take that back immediately !",
            "Yeah the rule here is basically that if you're rude we'll be rude back, whether you're a customer or not. Good on you for learning a bit of french, I'm glad you and your family had a good time!",
            "Ive never given a shit bonjour etc, people reflect your attitude and it not only paris. Those loudly american think they own this place and they have a bad time and talk about it, have a smile everyone smiles back at you. Its pretty simple no matter where you are, its true americans in america have a special treatment because they want tips...",
            "Of course we are. We are French after all.",
            "Thank you for saying this. I visited Paris last month and the Parisians I encountered and conversed with are the nicest people Ive met. Never any attitude. As long as you are respectful of the culture, they will respect you in return.\n\nWhich also leads me to another American stereotype in that Parisians smell bad because of no deodorant. Maybe it was the cooler weather of May, but I didnt smell a single person who smelled badly or reeked of B.O. These stereotypes just need to die already.",
            "I visited Paris, Vienna, northern Italy, London on a trip recently. Parisians were by far the nicest people.",
            "As a French, I'm really happy about what you say but I can assure you that we are generally not very nice, I mean, it's normal to be at least nice if you are so polite with saying hello and ask if you speak english, and if they don't what to answer can just say that they can not speak english.",
            "The stereotype was real like 20 years ago. Was in Paris last year and was shocked at everyone's outward warmth. People were even trying to help us at the subway station, which would have been unheard 15 years ago. Oh! And they speak much better English!",
            "Are you sure you were here in Paris, France, and not Paris, Texas ?",
            "May I ask what's your yearly earnings? It changes a lot of things"
        ]
    },
    "Taxe foncière à Paris : les propriétaires plient face à Anne Hidalgo après les \"augmentations démesurées\"": {
        "title": "Taxe foncière à Paris : les propriétaires plient face à Anne Hidalgo après les \"augmentations démesurées\"",
        "score": 36,
        "url": "https://actu.fr/ile-de-france/paris_75056/taxe-fonciere-a-paris-les-proprietaires-plient-face-a-anne-hidalgo-apres-les-augmentations-demesurees_61269276.html",
        "content": "",
        "num_comments": 32,
        "comments": [
            "Pour rappel, mme avec cette augmentation, la taxe est de l'ordre de 20,5% soit 15 points en dessous de la moyenne nationale.",
            "Les possdants ds que tu leur demandes de payer plus a ne veut rien lcher.\nExemple 23459",
            "La proprite prive doit tre supprime pour le bien de tous et toutes",
            "Cocasse quils aient voulu en appeler au principe dgalit dans leur recours",
            "Merci de remettre lglise au milieu du village, comme disent les journalistes qui crivent dans les journaux lus par les multi propritaires chouinards.",
            "Le +7% est trompeur, c'est un passage du taux de 13%  20%, soir une augmentation relative de +50% en un an. \nDit autrement : qui payait 100 de taxe foncire  Paris en 2022 a pay 150 de taxe foncire en 2023.",
            "Euh...ton salaire a suivi l'inflation toi ?",
            "Les salaires et rentes sont indexs sur linflation ?\na me semble peu probable",
            "Le fameux argument \"*nous c'est pire alors allez vous faire foutre*\".",
            "Le \"foncier le plus bas de France\" ??\n\nOn ne parle que de l'impt hein ?"
        ]
    },
    "Clothes shopping": {
        "title": "Clothes shopping",
        "score": 3,
        "url": "https://www.reddit.com/r/paris/comments/1dr7v2g/clothes_shopping/",
        "content": "Hi,\n\nI'm new in Paris, I'm a 25 y.o. Italian man, doing a PhD in Paris and living in Fontenay sous Bois. I really need to buy some clothes, and I'm looking for useful suggestions about places that are not so expensive.\nLooking on Google maps, I found different Lafayette outlets in the area, are those places worth it or I will find only expensive stuff?\n\nThank you in advance! ",
        "num_comments": 11,
        "comments": [
            "Uniqlo. Good quality and not to expensive",
            "Go to Rosny2 and head to C&A or Kiabi",
            "From Fontenay you can go to Val dEurope. There are some outlets shops here sometimes you find excellent deals sometimes nothing. There is also a big mall where you have everything a mall can provide.",
            "I'd take a look at vinted. You can find cool, almost new clothes for a good price",
            "If you want to find the cheapest of the cheapest, PRIMARK is a bit outside paris but you can find pretty ok clothes for very cheap.",
            "Thank you soooo much! I'll definitely try to go there",
            "Of course, but unfortunately I'll have to leave for a conference on Monday so I'm a little bit in a hurry",
            "No problem ! \n\nAnd if you don't find anything at the Auchan gallery, just take RER line E to Rosny Bois Perrier and have a blast at the Westfield mall there. Lots of shops !",
            "If you are in Fontenay you should go to Rosny 2 you will have access to many cheap clothing stores!",
            "Lafayette is way too expensive imo.\n\nKiabi is a good choice, relatively affordable and good quality imo. There's one in the Auchan gallery near the Val de Fontenay train station. Otherwise for men Celio can be a good pick as well.\n\nPlus the summer sales have started last Wednesday so you'll be able to find clothes for even cheaper."
        ]
    },
    "Places à l'Olympia ?": {
        "title": "Places à l'Olympia ?",
        "score": 1,
        "url": "https://www.reddit.com/r/paris/comments/1drczqq/places_à_lolympia/",
        "content": "Bonjour, \n\n  \nPour la première fois j'aimerais me rendre à un concert d'un groupe de musique que j'aime bien, et il aura lieu à l'Olympia !\n\nJe dois prendre les places, je vois qu'il y a \"balcon\", \"mezzanine\", et \"orchestre debout placement libre\". Je pensais prendre une place à l'une des extrémités latérales de la mezzanine, si quelqu'un ici a un avis sur la visibilité je veux bien l'entendre.\n\nMais ma question principale est : est-ce que si j'achète un ticket balcon/mezzanine je pourrai tout de même descendre dans la zone debout et/ou remonter ? J'aime vraiment beaucoup le groupe et j'aimerais être en bas, mais je prends un ticket assis à cause de quelques problèmes de santé (je ne peux pas rester debout trop longtemps)",
        "num_comments": 0,
        "comments": []
    }
}