{
    "FORUM LIBRE : TOURISTS AND RESIDENTS, ASK YOUR COMMON QUESTIONS IN THIS WEEKLY THREAD : Open Forum -- 23, June, 2024": {
        "title": "FORUM LIBRE : TOURISTS AND RESIDENTS, ASK YOUR COMMON QUESTIONS IN THIS WEEKLY THREAD : Open Forum -- 23, June, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/paris/comments/1dmtg4t/forum_libre_tourists_and_residents_ask_your/",
        "content": "# FR : Merci de lire avant de poster\n\nCe forum libre permet de discuter de tout et de rien et vous permet notamment de poser vos questions génériques par rapport à la ville et la région. Si vous venez d'arriver sur Paris et que vous voulez savoir où trouver des bars, manger un Pho ou trouver des clés à molette, ce forum est pour vous !\n\nPour toute question un peu plus corsée (et non touristique), n'hésitez pas à créer un sujet à part.\n\n# __________________________________________\n\n# EN : Please read before posting\n\nIf you have a simple question or tourism related one about the city, this megathread is for you!\n\nIs the pricing of the métro confusing?\n\nDo you want to know where you can find the shops that have that odd thing you're looking for?\n\nThe locals can help, ask away.\n\n&#x200B;\n\nYou should first take a look at [the wikivoyage page on Paris](https://en.wikivoyage.org/wiki/Paris) for general information. You should also download the app [Citymapper](https://citymapper.com/paris) to find your way around the city.\n\nInformation regarding the Covid situation  can be found on the official [Ministry of Europe and Foreign Affairs](https://www.diplomatie.gouv.fr/en/coming-to-france/coronavirus-advice-for-foreign-nationals-in-france/) and [Paris Visitors Bureau](https://en.parisinfo.com/practical-paris/info/guides/info-disruption-paris) websites.\n\nThe procedure to obtain a French vaccine pass can be found [here](https://www.sante.fr/how-to-obtain-a-french-health-pass). Additional information about the vaccine pass is available on the official [French Administration website](https://www.service-public.fr/particuliers/actualites/A15121?lang=en).\n\n# __________________________________________\n\n`Ce sujet est généré automatiquement tous les dimanches soirs à 21h.` \\- [Archives](https://old.reddit.com/r/paris/search?q=TOURISTS+AND+RESIDENTS&restrict_sr=on&sort=new&t=all).",
        "num_comments": 17,
        "comments": [
            "# Hello all! Coming to Paris this fall for pursuing my MSc, any suggestions which would help me integrate into the French/Parisian society a little better?",
            "Bonjour tout le monde! Je suis étudiante américaine à la recherche d’un logement pour l’année scolaire prochain. Pourriez-vous être un «parrain» pour moi chez Gens de Confiance afin de trouver un studio, coloc, etc? Je peux le faire la même pour vous, si applicable. Merci en avance!  \n\nHi everyone! I’m an American student looking for housing for the coming school year and need a few references on Gens de Confiance. Would any of you be willing to vouch for me on there? I’d be glad to return the favor. Thank you in advance \n\n[My profile](https://gensdeconfiance.com/fr/r/6675d37a6916b)",
            "Traveling to Paris tomorrow and wanted to check about the accepted payment methods in the metro? Can we use the tap and go method like Berlin or London? \nAlso whats the cheapest way to get a 24 hour pass?",
            "Bonjour! Des idees ou je peut regard match sept de le Stanely Cup ce soir?",
            "Do taxis from CDG accept large dogs?\n\nSalut. I’m from Spain, moving to Paris in a couple of months from the USA, where I currently live. I have a large dog (standard poodle mix) and will be landing at CDG with him and a couple of suitcases. I don’t want to deal with the train or bus after a long flight, with a dog and luggage. \n\nDoes anyone know if taxis will accept dogs? I’ll going straight to my apartment near Bastille. If regular taxis don’t accept them, are there care services I can contact ahead of time? Would Uber accept them?\n\nThank you for any tips/guidance.",
            "Whats a nice bottle of red wine I could buy as a souvenir from Paris?",
            "Hi, are there fully refundable accommodations around Colombes?",
            "Question de trajet en asenseur de tour Eiffel \n\nsalut les gars,\n\n Mon amie vient à Paris et elle voulait réserver un trajet en ascenseur à la tour Eiffel.  Mais sur le site, il est dit que tout est réservé mais il est dit\n\n ....vous pouvez acheter vos billets à la billetterie de la tour Eiffel même au tarif individuel, le jour de votre visite, pour une utilisation immédiate (toujours en fonction de la fréquentation).\n\n Ma question est donc la suivante : avez-vous vécu cela et avez-vous pu prendre l'ascenseur sur place ?",
            "After 6 years finally I am returning to Paris, from 10th to 16th of July, outside the military parade and the fireworks do you have any suggestions for the 14th?\n\nAnd I want to live the city non only through museums and common (and annoying) tourist stuff, so I'm looking for some niche palaces to visit and activities to do",
            "The Louvre ticketing service says reservations are open except for 18-24 July which will be made available shortly.\n\nDoes anyone know how/when/if I might be able to get a ticket during this time frame?"
        ]
    },
    "Taxe foncière à Paris : les propriétaires plient face à Anne Hidalgo après les \"augmentations démesurées\"": {
        "title": "Taxe foncière à Paris : les propriétaires plient face à Anne Hidalgo après les \"augmentations démesurées\"",
        "score": 19,
        "url": "https://actu.fr/ile-de-france/paris_75056/taxe-fonciere-a-paris-les-proprietaires-plient-face-a-anne-hidalgo-apres-les-augmentations-demesurees_61269276.html",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Pour rappel, même avec cette augmentation, la taxe est de l'ordre de 20,5% soit 15 points en dessous de la moyenne nationale.",
            "\"Démesurée\"\n\n\"+7%\"\n\n(rappel: inflation en 2023 ~ 6%, donc y compris les salaires & rentes de ces malheureux propriétaires)\n\nQuelle bande de fragiles, sérieux. Et avoir LE TEMPS et RIEN D'AUTRE A FOUTRE que d'aller au tribunal pour éviter de payer ses foutus impôts. Bah, bien fait pour leur gueule. Et je dis ça en tant que proprio avec une taxe foncière qui a bien augmenté aussi.",
            "La propriétée privée doit être supprimée pour le bien de tous et toutes",
            "Les possédants dès que tu leur demandes de payer plus ça ne veut rien lâcher.\nExemple 23459",
            "Cheh.",
            "Le +7% est trompeur, c'est un passage du taux de 13% à 20%, soir une augmentation relative de +50% en un an. \nDit autrement : qui payait 100€ de taxe foncière à Paris en 2022 a payé 150€ de taxe foncière en 2023.",
            "Euh...ton salaire a suivi l'inflation toi ?",
            "Oui d'accord.\n\nMais comme on a dit à coté, ça reste vraiment, vraiment pas cher, comparativement.\n\nhttps://www.challenges.fr/immobilier/malgre-une-hausse-de-627-la-taxe-fonciere-reste-faible-a-paris_866058\n\n874 euros pour un 75m², et ça pleure, allez vous faire cuire le cul, je paie 3 FOIS ça sans broncher.",
            "Oui ? mais je dois pas etre le seul ? \n\nhttps://www.lesechos.fr/economie-france/social/les-salaires-ont-progresse-plus-vite-que-linflation-en-moyenne-en-2023-en-france-2075373",
            "Le taux est inférieur en moyenne et était historiquement bas à Paris, mais l'autre composante qu'est la valeur locative cadastrale est plus élevé que la moyenne. Donc \"vraiment pas cher\", ça se discute !"
        ]
    },
    "Archi fan 🛠️ - 3 rue Michelet, 75006": {
        "title": "Archi fan 🛠️ - 3 rue Michelet, 75006",
        "score": 131,
        "url": "https://www.reddit.com/gallery/1dqewq4",
        "content": "En flânant le long du Jardin du Luxembourg, il est facile d’avoir les yeux attirés par un bien étrange bâtiment à la teinte ocre et aux créneaux bizarrement dépareillés dans le si chic 6e arrondissement de la capitale. \n\nUne fois face à ce cube au relief et aux motifs si particulier, on ne sait plus où porter le regard : des briques rouges, en passant par les ovales et les losanges, les belles fenêtres encadrées par des arches, aux grilles en fer forgées… mais surtout une monumentale frise faisant le tour du bâtiment ! Déboucher sur l’Institut d’Art et d’Architecture, au 3 Rue Michelet, est un véritable bouleversement pour l’amateur d’architecture et de curiosités parisiennes.\n\nAu commencement, il y avait la volonté d’accueillir la massive collection de livres d’art du couturier Jacques Doucet. 140 000 manuscrits, 50 000 livres, 800 revues… La place manque pour héberger ce trésor. Il est donc décidé en 1918 de lancer un concours d’architecture pour mettre en valeur ce gisement de connaissances. \n\nC’est l’architecte Paul Bigot qui remporte le concours et érige entre 1925 et 1928 un édifice tout à fait particulier, dans le style historiciste (un courant fondé sur la mise en valeur et l’imitation du style des époques révolues). \n\nSorte de patchwork parfaitement homogène et définitivement inimitable, le lieu est articulé autour d’une structure en béton armé, sur laquelle sont placées des briques rouges, rappelant l’architecture du Nord de l’Italie. Les influences portent aussi vers l’Afrique subsaharienne, avec les merlons asymétriques du toit évoquant l’architecture des mosquées. \n\nLa synthèse de toutes ces influences culmine dans la frise en bas-relief réalisée par la Manufacture de Sèvres qui entoure le bâtiment : véritable syncrétisme symbolique, elle reproduit des formes anciennes et des motifs historiques issus des antiquités grecques et romaines, du Moyen- ge et de la Renaissance.\n\nDès le départ, la bibliothèque accueillant la collection de Doucet est placée au cœur de l’édifice, entourée de salles de classes prévues pour 200 étudiants et 3 professeurs. Mais bien vite, le nombre d’étudiants grossit et la place manque. La collection est donc transférée en 1990 dans les locaux de la Bibliothèque nationale de la rue de Richelieu.\n\nClassé au titre des Monuments historiques depuis 1996, l’Institut d’Art et d’Architecture (aussi appelé Centre Michelet) abrite aujourd’hui les départements et unités de recherche liées à l'histoire de l'art des universités Paris I Panthéon-Sorbonne et Sorbonne Université.",
        "num_comments": 7,
        "comments": [
            "Pour y avoir fait ma licence, j'ai de bon souvenirs dans ce bâtiment, même si l'intérieur ne fait pas toujours honneur à l'extérieur, et que la moitié du matos tombe en panne une fois sur deux. C'était sympa les cours d'égyptologie avec un projo qui affichait toutes les slides dans des tons roses ou jaunes, et les micro qui menaçaient de faire exploser les enceintes au moindre effleurement du bureau. Sans parler de l'ascenseur qui ne marche jamais. Pour monter dans la salle du dernier étage, fallait être bon en cardio.\n\nMais par contre il y a plein de moulages en plâtre qui sont assez cool dans les couloirs et les escaliers, et notamment dans la salle du dernier étage dont un mur est entièrement recouvert d'une frise représentant une procession militaire romaine si je me rappelle bien.\n\nEt petite précision, le bâtiment est surtout occupé par Sorbonne Universités, Paris I occupe surtout le 3e étage (si ça n'a pas changé)",
            "Merci pour ces explications claires et détaillées que j'aurais dû chercher depuis bien longtemps 😆.",
            "Un autre bâtiment qui pourrait peut-être te plaire si tu ne connais pas, c'est [LE DROIT HUMAIN INTERNATIONAL - 5 Rue Jules Breton, 75013 Paris](https://www.google.fr/maps/place/LE+DROIT+HUMAIN+INTERNATIONAL/@48.8381992,2.358182,3a,90y,246.94h,108.6t/data=!3m7!1e1!3m5!1s8J5DNfhK5RNNKO3KaOdeyQ!2e0!6shttps:%2F%2Fstreetviewpixels-pa.googleapis.com%2Fv1%2Fthumbnail%3Fpanoid%3D8J5DNfhK5RNNKO3KaOdeyQ%26cb_client%3Dmaps_sv.share%26w%3D900%26h%3D600%26yaw%3D246.94393926020604%26pitch%3D-18.603424078358884%26thumbfov%3D90!7i16384!8i8192!4m11!1m2!2m1!1sle+droit+humain!3m7!1s0x47e671f30bc744e3:0x68616f770b69dc13!8m2!3d48.838117!4d2.358095!10e5!15sCg9sZSBkcm9pdCBodW1haW6SARthc3NvY2lhdGlvbl9vcl9vcmdhbml6YXRpb27gAQA!16s%2Fg%2F1tjcnrxp?coh=205410&entry=ttu)",
            "Haha j'allais dire la même chose, l'intérieur est tristoune",
            "Ooooooh mais c'est trop cool ça ! Je prends ! Bientôt sur Reddit...",
            "Il y a de quoi voir avec les bâtiments et monuments franc-maçonniques ou tout ce qui est issue de l'égyptophilie du début du XXᵉ siècle. Dans le même style j'aime beaucoup [le monument aux droits de l'homme](https://www.google.com/maps/place/Monument+des+Droits+de+l'Homme/@48.8552444,2.3011127,17z/data=!4m6!3m5!1s0x47e6702046230a41:0xd0952bb85fbaf60e!8m2!3d48.8552332!4d2.3011553!16s%2Fg%2F12240_q1?entry=ttu). Plein de petits symboles ésotériques à voir dessus.",
            "Sympa, merci pour le partage aussi. \n\nNiveau égyptophilie, sur mon-compte-instagram-dont-on-ne-doit-pas-partager-l'adresse j'avais fait un post sur la Place du Caire, dans le 2e"
        ]
    },
    "Cyclistes/Trott trajet Sébastopol/Strasbourg -> Cité/Palais de Justice": {
        "title": "Cyclistes/Trott trajet Sébastopol/Strasbourg -> Cité/Palais de Justice",
        "score": 13,
        "url": "https://www.reddit.com/r/paris/comments/1dqtncm/cyclistestrott_trajet_sébastopolstrasbourg/",
        "content": "Pourquoi je suis le **seul** (sans mentir, à chaque fois que j'y passe) à respecter la priorité piétons ? Ils n'ont pas de feu et nous non plus sur la grande majorité des passages (feu piéton lié à la chaussée voiture). Aujourd'hui un cycliste me percute à alors que j'étais à l'arrête depuis au moins 10-15 sec avec feu stop sur le vélo et me dit que c'est de ma faute et que je suis un connard ?!. Une autre fois j'ai eu droit à \"Non mais quand même hein, on va pas s'arrêter à chaque fois !\" Ba si en fait.\n\nJe n'évoque même pas l'intersection avec Rivoli qui ressemble à un champ de bataille, intersection avec Turbigo où tout le monde déborde dans la voie opposée sans réfléchir à ce qui se passe à plus de 5m devant (non le \"terre plein\" n'est pas en cause c'est de la flemme pure de suivre le tracé), même reflexion au croisement avec le blvd Saint Denis.\n\n\\_Mention spéciale au croisement avec Magenta ou la grande majorité ne respecte ni feu, ni piétons ni priorité à droite\\_",
        "num_comments": 9,
        "comments": [
            "À vélo, en voiture ou même dans les transports en commun, ces gens auront toujours le même comportement : totalement dans leur petite bulle, pas une seule considération pour les autres même en matière de sécurité,  aucune communication (même pas un regard ou signe de tête) et sytématiquement conflictualiser la moindre interaction (impossible de leur faire le moindre reproche ou de leur donner un conseil).\n\nLa seule chose à faire, c'est de les ignorer et de continuer à montrer l'exemple. Tu peux leur retourner la même indifférence, ça les rend fous et c'est un bon divertissement, parfois ils se rendent compte eux-même de leur ridicule.",
            "Je suis en vélo, honnêtement ne te prends pas la tête, arrête toi où il faut et quand il faut ,ne devient pas aussi con que les autres qui ne respectent rien (ils auront toujours une raison) \n\nJ'ai eu la meme reaction sur cette voie,ou sur la voie entre Châtelet et Bastille. \n\nDe plus sur ces voies il y a souvent les équipes de la mairie qui mettent des amendes, ça serait dommage de s'en prendre une en imitant des abrutis",
            "Paris est un enfer à cause des connards qui ne respectent rien, reste toi même,  tu es une minorité mais tu as raison. Ne deviens pas comme eux stp... parole de piéton,  ancien cycliste. J'ai envie de frapper tous les vélos qui ne s'arrête jamais et zigzag dans tous les sens et encore mieux avec un casque sur les oreilles histoire de ne rien entendre de leur environnement proche. La police/l'état est minable sur le respect de la circulation dans les villes...",
            "Oui, il faut que j'arrive à prendre sur moi, mais là ça a été la fois de trop, me faire rentrer dedans puis me faire insulter je suis devenu fou...",
            "Difficile de pas se prendre la tête parfois, c'est impressionnant comment en 10 minutes sur une rue des dizaines de personnes sont mises en danger à cause de l'égoïsme. Jamais je n'imiterai ce genre de comportements je te rassure.\n\nJ'ai jamais vu de contrôle alors que j'y passe plusieurs fois par jours 🥲",
            "Oui je vais rester moi même la dessus ! Moi ce qui m'inquiète c'est qu'il va falloir un drame du type maman avec poussette qui décèdent pour qu'une décision soit prise par la PP ou la Mairie.\n\nIl m'arrive dans certains endroits de me mélanger avec le flot de voitures pour les éviter... Ça peut paraître plus dangereux dans l'idée mais j'ai quand même l'impression qu'une majorité de conducteurs fait attention à son environnement quand même (toujours un par-ci par-là qui fait de la merde hein je le nie pas non plus -taxi-camionettes blanches-) Mais en regardant les roues d'une voiture on peut arriver à anticiper le geste du conducteur car on sait à l'avance ou va se diriger le véhicule entier.\n\nTandis qu'a vélo/EDPM quand le mouvement est fait il est instantané, c'est trop tard on ne peut rien anticiper. Et je pense que c'est tous les ans pareil à la même période : il fait >21 degrès hop hop tout le monde ressort son vélo plein de poussière mais ne sait pas s'en servir...",
            "La police commence à être assez présente sur les pistes cyclables. Mais oui il y a encore du boulot - pour les voitures aussi, pour faire respecter les sas vélo par exemple.",
            "Ya déjà des drames malheureusement mais sans doute pas suffisamment pour vouloir s'attaquer aux problèmes de circulation et de respect. Et qu'on sanctionne aussi les piétons qui font de la merde aussi. Et sincèrement un problème de départ est de ne pas réfléchir à la circulation en amont mais d'attendre des problèmes en masse pour se dire...\"ah on dirait qu'il y a un problème. Ah ben on y avait pas pensé.\" A certains endroits tu as l'impression  que c'est un stagiaire de 18ans qui a défini ça... c'est triste mais c'est vrai en France on adore attendre un drame avant de réagir à un problème connu.",
            "\"Commence\", ben ouais mais ya encore du boulot einh et depuis le temps, il est temps de s'y mettre.  J'habite à république et le bvd magenta c'est un nid à bastonentre autre. Le nombre de vélos avec des écouteurs et les feux rouges grillés en masse + aucun respect des piétons, ça zigzag entre les voitures, ça se croit des pilotes mais ce so t des dangers publics ultra egoistes et menfoutistes... les mecs déboulent à fond et font glinglin avec leur sonnette de péquenot pour te faire comprendre que tu dois les laisser passer sinon ils tz rentrent dedans, rien a battre ces connards. Moi j'ai prévenu, c'est high kick si un vélo s'approche de moi et son vélo je le balance dans sa gueule ensuite.\nTu mets des flics en masse par quartier pendant qques jours (operations coups de poing) avec des amendes spéciales à 300e pour la moindre infraction comme les écouteurs ou un feu grillé et tu mes des caméra sur les I tersection et plaques obligatoires sur les vélos et retrait de permis à la clé si besoin. En cas de récidive,  1500e. Là crois moi que les vélos vont se détendre d'un coup et se mettre à respecter les règles de vie en commun. Si tu tapes au porte monnaie, il ne se passera rien. Et 50 balles c'est peanuts."
        ]
    },
    "La correspondance de Saint Lazare est assez folle quand même ": {
        "title": "La correspondance de Saint Lazare est assez folle quand même ",
        "score": 43,
        "url": "https://www.reddit.com/r/paris/comments/1dqga8i/la_correspondance_de_saint_lazare_est_assez_folle/",
        "content": "7 lignes de Métro\n4 a Saint Lazare (3,12,13,14)\n2 a Havre Caumartin (3,9)\n3 a Opera (3,7,8)\n1 a Saint Augustin (9)\n\nEt 4 de RER/Transilien\n1 a Haussmann Saint Lazare (E) \n1 a Auber (A) \nEt 2 a Paris Saint Lazare (J, L) \n\nTout le couloir de correspondances réunis fait casiment 1km plus long que 90% des interstations du métro parisien c'est dingue\n\nD'ailleurs petite anecdote un jour j'étais avec ma famille vu que le couloir de correspondances de saint Lazare a auber était en travaux a ce moment là on a décidé d'utiliser la voie publique pour aller prendre le métro 7 et on c'était perdu et on c'est retrouvé a chaussé d'antin lafayette",
        "num_comments": 23,
        "comments": [
            "[Bonne video qui explique le bazare de Saint-Lazare](https://www.youtube.com/watch?v=zdJ1VEHSuAE)",
            "Parait que le chef de projet s’appelait Maurits Cornelis Escher, c’est le même criminel qu’à Madeleine.",
            "Si tu connecte Aiber et St Laz, ca veut dire que Gare de l'Est et Gare du Nord c'est pareil",
            "La correspondance pour le RER E 💀💀",
            "je ne suis pas sûr de comprendre ce post, tu as déjà été à Gare du Nord ?\n\nje veux dire, St-Laz est une grosse gare régionale / nationale (normandie notamment), et francilienne : il est donc normal que beaucoup de lignes se croisent non ? \n\npour la petite histoire, la plus longue correspondance du réseau se trouve entre saint-augustin et opéra.",
            "Va jamais à Shinjuku il faudrait envoyer des secours. :D",
            "Oui je l'avais déjà vue a l'époque",
            "D'ailleurs a la construction du RER E c'était prévu de base que magenta soit relié a la gare du nord et aussi a la gare de l'est mais sa c'est jamais fait il y'a un couloir pour accéder seulement a la gare du nord",
            "Pour le coup je crois qu’il est juste impressionné par la gare et ses connectivités",
            "Saint Augustin à Opéra passe justement par Saint Lazare"
        ]
    }
}