{
    "Questions Thread - June 22, 2024": {
        "title": "Questions Thread - June 22, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/pathofexile/comments/1dlj92t/questions_thread_june_22_2024/",
        "content": "Questions Thread\n\nThis is a general question thread on. You can find the previous question threads [here](/r/pathofexile/search?q=Questions+Thread+author%3AAutoModerator&restrict_sr=on&sort=new&t=all).\n\nRemember to check [the community wiki](https://poewiki.net) first.\n\nYou can also ask questions in any of the questions channels under the \"help\" category in [our official Discord.](https://discord.gg/pathofexile)\n\nFor other discussions, please find the Megathread Directory at [this link](https://www.reddit.com/r/pathofexile/wiki/megathread_directory).\n\nThe idea is for anyone to be able to ask anything related to PoE:\n\n* New player questions\n* Mechanics\n* Build Advice\n* League related questions\n* Trading\n* Endgame\n* Price checks\n* Etc.\n\n**No question is too big or too small!**\n\nWe encourage experienced players to sort this thread by new.\n\nWe'd like to thank those who answered questions in the last thread! You guys are the best.",
        "num_comments": 7,
        "comments": [
            "Why don't the Maven want to witness this fight? Isn't this Sirus on the Cortex?\n\nhttps://preview.redd.it/0ue02ji0y18d1.jpeg?width=1280&format=pjpg&auto=webp&s=6cbbced876b04627d6935e9a033454b66216ebb9",
            "Wondering if my FPS seems low to anyone. Comp specs are:\n\n* 7800x3d\n\n* 4070 Super\n\n* 32GB ram\n\nSettings are all maxed out, 2560 x 1440, hovering around 130-140 FPS (dipping as low as 115~ at times). Currently on DirectX 12 as it gives the best performance. \n\nNot sure what's normal for PoE as this is a brand-new build and I've never played on these settings before. Does this all look pretty typical?",
            "How to properly price Chronicles of Atzoatl?",
            "Sirus doesn't appear in any invitations, no, and what you're opening isn't the Cortex.",
            "Very normal",
            "Use the trade site, and check for\n\n\n* T3 corruption room\n* T3 gem room\n* Apex\n\n\nAnd I believe the sacrifice room isn't worth much anymore at this point, but in the early days of a league people use it for flipping.",
            "Thank you! For some reason I was expecting like 255~ but obviously I'm fine with 130-140 at this resolution."
        ]
    },
    "For streamers a week one goal. For me a first ever since playing open Beta. LVL100 HC, all 4 voidstones, first ever MB.": {
        "title": "For streamers a week one goal. For me a first ever since playing open Beta. LVL100 HC, all 4 voidstones, first ever MB.",
        "score": 52,
        "url": "https://i.redd.it/rr96jsxrz28d1.png",
        "content": "",
        "num_comments": 13,
        "comments": [
            "I still can't kill Maven, that was done by a carry. but all other bosses done by me.\nThe MB grind took me about 4 weeks of playing... in my mind \"hardcore\".",
            "Gz!",
            "Gz what a feat 💪",
            "Looks like RF chieftain?  I did the adorned setup version this league and it was my build of the league.  Now I’m addicted to the explosions.",
            "Make sure to craft your flasks properly.",
            "Still yet to LVL 100 period.. I'm an on again off again Poe player.. looking forward to poe2 I think my playtime will increase dramatically... If I can fight my kids off the xbox",
            "time to train on the maven game now :)\ngg on the belt",
            "(new player btw) always wondered why everyone fawned over MB but I just read the stats and holy fuck that's insane",
            "Still sane exile? :)",
            "Maven is tricky you should setup a character on Standard to practice"
        ]
    },
    "When Tujen decides that I've suffered enough ": {
        "title": "When Tujen decides that I've suffered enough ",
        "score": 158,
        "url": "https://i.redd.it/lagpwfxca08d1.png",
        "content": "",
        "num_comments": 23,
        "comments": [
            "Nice",
            "has there been a record of tujen giving out mirror in the exchange?",
            "A man's gotta make a living!",
            "I had 16 exotic coins. Im in the middle of strongbox farming and ran them really fast. I've rarely got 1 div, let alone 4.",
            "Tujen's a homie. That's why I love Expedition.\n\nI love to spam the hell out of it at the start of the league, I love it to amass bubblegum currency (and sometimes I'm lucky enough to hit the jackpot!)",
            "Hmm ahh.. hmm.... Fine!",
            "He offered me a divine three times over like 10 refreshes last night. Was my first, second and third from him!",
            "Wow 4 divine orbs woow",
            "Fuck expedition.",
            "Yes. I saw a post on this subreddit with a screenshot just like mine except it had a mirror in the top left slot."
        ]
    },
    "Death's Oath 427% quant Maze of the Minotaur [potato quality]": {
        "title": "Death's Oath 427% quant Maze of the Minotaur [potato quality]",
        "score": 52,
        "url": "https://v.redd.it/stukkvxp028d1",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Got my first level 100 and did 38/40 challenges with this build. All of the t17 maps I did were mirrored so I just ran them as they were and only failed 2. I made the character for vaal temple farming, so it can run all mods. That being said, Death's Oath is still in a terrible spot right now and it took 400-500 divs to get it to this point. All of the rare gear was self crafted except for jewels.\n\nPros: 35k armor, 25k evasion, 100% suppress, ailment curse crit immune, pop chaining via occultist + herald of ash, 0 button build\n\nCons: Extremely squishy to DoTs, super difficult to scale, 5m dps\n\nOn The Adorned: I refuse because I'm lazy and it feels boring.\n\nPOB: [https://pobb.in/J-r5OUmV\\_vQO](https://pobb.in/J-r5OUmV_vQO)",
            "Haha I think you had a brainfart on one of your flasks. The bismuth has reduced effect.\n\nApart from that, this is still one of my favorite builds. However I believe there is a point to be made to drop grace, pick up either purity of elements or haste, drop the jade (and bismuth if you pick up purity of elements). Pick up a basalt (and a sulphur if dropping bismuth).\n\nAlso you can slap in one of those perandus jewels for another big chaos dam increase.",
            "Played this some time back, its such a cozy build, but hard to get damage high, chaos dot and DO needs a BIG buff.",
            "i was just quickmathing HoAsh + Profane, and you have to assume most mobs will be <10% hp when they get hit by profane (except the next pack maybe), which would means the overkill is 15-20% of their max life, pretty nutty",
            "You missed a headhunter at 30sec in",
            "oh shit this looks nice. Ive been looking for a 0 button build for heist running, might try this out.",
            "Half those pros is mageblood, not the build",
            "Hey! You might be interested to check out my Standard DO char. Obv it isnt nearly finished...it'll prob take a couple mirrors ;-;\n\n[https://www.pathofexile.com/account/view-profile/MasterBot98/characters/DeathMFer](https://www.pathofexile.com/account/view-profile/MasterBot98/characters/DeathMFer)\n\n[https://pobb.in/R2x8bGCO\\_ZY4](https://pobb.in/R2x8bGCO_ZY4)",
            "That's a nice catch lmao. I wonder if it was one that I alt spammed or bought without double checking.\nWith regards to dropping all evasion, it is possible, but I felt like most of my deaths were to one shots anyways (max phys hit is only like 25k). I know basalt would help that a bit but with phys hits that big I feel like avoiding or convert is way better than some more armor. I also wouldn't be able to swap out for vaal haste for speed on easy maps. I already swap out jade for onslaught for the same purpose.\nI did have a perandus jewel, but I ended up switching in the massive thread of hope there to squeeze in the auras. I could put it where my watchers eye is and remove one of the rare jewels though.",
            "I definitely got the heist challenge out of the way quickly with it. The downside is that you won't have the regen to tank lasers or mines. Righteous fire probably does a similar job but with more tankiness and for a heck of a lot cheaper!"
        ]
    },
    "I finally did it ": {
        "title": "I finally did it ",
        "score": 414,
        "url": "https://www.reddit.com/r/pathofexile/comments/1dl7cga/i_finally_did_it/",
        "content": "Hi ,I just wanted to say that after about 2000h in this game i finally \" finished a character \" . Yep , you heard it right , my ice shot deadeye is finally done , with full mirror gears/T0 uniques . Of course i did it in standard ( please dont hurt me ) because there is no way for me to achive that in league due to the fact that i cant really play the amount of hours needed to do that in league but i'm actually proud of myself .  \nI know , nobody asked , but since noone of my friends are playing this game i had to tell my story to someone :3\n\nHave a good day exiles !",
        "num_comments": 130,
        "comments": [
            "PoB? Need to show off properly mate",
            "post ur pob as fact. anyway grazt to you.",
            "I am almost 4 times your total playtime and I haven't achieved this once, so great job exile!",
            "Still sane, exile?",
            "Congrats exile! Don't sell yourself short just because it's in standard, the feeling of accomplishment shouldn't be dampened.",
            "Don't post pob op, I repeat, don't post pob. People want it just to: hmmm ☝️🤓 akktshually not finished",
            "It’s okay it took me 9 years to level a character to 100",
            "This post got recommended to me in my home because I play Diablo. Probably is an amazing accomplishment (don’t know) so kudos to you!! Enjoy doing your ur 2nd!",
            "I am one level away from finishing my Spark character in the league, tonight I should be \"done\" too. Can't find anything to spend my money on at this point! Not even 3 passive voices would be an upgrade, I checked.",
            "Pob pls"
        ]
    }
}