{
    "Weekly Questions Megathread - June 28 to July 04, 2024. Have a question from your game? Are you coming from Pathfinder 1E or D&D? Need to know where to start playing Pathfinder 2e? Ask your questions here, we're happy to help!": {
        "title": "Weekly Questions Megathread - June 28 to July 04, 2024. Have a question from your game? Are you coming from Pathfinder 1E or D&D? Need to know where to start playing Pathfinder 2e? Ask your questions here, we're happy to help!",
        "score": 11,
        "url": "https://www.reddit.com/r/Pathfinder2e/comments/1dqditf/weekly_questions_megathread_june_28_to_july_04/",
        "content": "# Please ask your questions here!\n\n[**New to Pathfinder?** ***START HERE!***](https://paizo.com/pathfinder/getstarted)\n\nOfficial Links:\n\n* [**Paizo**](https://paizo.com/) \\- Main store to buy Pathfinder books and PDFs (clear your cache if you have performance issues)\n* [**Archives of Nethys**](https://2e.aonprd.com/) \\- Official system reference document. All rules are available for **FREE**\n   * [Player Guide](https://2e.aonprd.com/PlayersGuide.aspx)\n   * [GM Screen](https://2e.aonprd.com/GMScreen.aspx)\n* [**Pathfinder Nexus**](https://app.demiplane.com/nexus/pathfinder2e) \\-  Official digital toolset / **FREE** Game Compendium \n   * [Game Compendium](https://app.demiplane.com/nexus/pathfinder2e#game-compendium)\n   * [Pathfinder Primer](https://app.demiplane.com/nexus/pathfinder2e/sources/pathfinder-primer) \\- Digital Reader\n* [**Our Subreddit Wiki**](https://www.reddit.com/r/Pathfinder2e/wiki/index/) \\- A list of all the resources we know about\n\nUseful Links:\n\n* [**PF2 Tools**](http://pf2.tools/) \\- Community made resources\n* [**Pathfinder Infinite**](https://www.pathfinderinfinite.com/) \\- 3rd Party Publications for Pathfinder 2e\n* [**Pathbuilder**](https://pathbuilder2e.com/) \\- Web and Android based character creator\n* [**Wanderer's Guide**](https://wanderersguide.app/) \\- Web based character creator with 3rd party integration \n* [**Startplaying**](https://startplaying.games/search?gameSystems=pathfinder-2e) \\- Find open games of Pathfinder (payment may be required)\n* [WHAT'S THE DIFFERENCE between 5e and Pathfinder 2e?](https://www.reddit.com/r/Pathfinder2e/wiki/resources/how-is-pf2e-different-from-5e/)\n\n [Megathread archive](https://www.reddit.com/r/Pathfinder2e/search/?q=flair%3A%22megathread%22&sort=new&restrict_sr=on&t=all)",
        "num_comments": 22,
        "comments": [
            "My group will be doing a quick one shot portion from Kingmaker, around level 8. I'm playing a character who's a bit of a polyglot. I have 8 languages at my disposal after Common, what would you recommend as useful languages to take for this?",
            "Hello! Question about the Grab trait in the Zombie Shambler attack. Does 'Grab' as a trait of the claw attack mean that if the Strike is a success, the Zombie can spend an action to automatically grab the target? Or does it mean that as a function of the Strike Action being successful the Grab attempt is also made (and you then make a Grapple check on behalf of the zombie, with a success meaning the target is hit for damage AND grabbed within one action)?",
            "Aside from what Blawharag said, I recommend you check out pathbuilder. Its a great, very easy to use tool for players to build characters. AND it can export those sheets into VTT with a module! Handy!",
            "Each damage is it's own instance of damage so you'd take 0 damage.",
            "This was a change in the remaster. Before it was an action to auto grab. Now it is an athletics check with no MAP. The athletics check still costs an action and is a separate check after hitting the strike. \n\nHope that helps.",
            "Thanks. \n\nJust to clarify, if the one damage somehow has 2 damage types, like 5 damage (piercing and slashing) vs. resistance 3 to all physical damage. Then, in this case, I would take 2 damage since it's one damage instance, right?",
            "It does - thanks a bunch!",
            "Effects which cause this would specify how that's happening. For example, many firearms have the \"concussive\" trait, which makes the damage count as bludgeoning or piercing based on whichever damage type the target has less resistance/immunity to. Diabolic Dragons have a passive that makes all their fire damage count, instead, as spirit - unholy damage if that would be \"worse\" for the person taking the damage (GM decides what's \"worse\").\n\nThere won't be a case where something is just labeled as \"piercing/bludgeoning\" and you're left to figure it whatever the fuck that's supposed to mean.",
            "The other common case where a single source of damage can qualify for multiple weaknesses are Swarms, who generally have weakness to area and splash. For example, if you hit a swarm that also has fire weakness with a fireball, you only use the highest applicable weakness to the area fire damage.",
            "How does resistance to all physical damage apply to an attack that has multiple damage types?\n\nFor example, if I have resistance 3 to all physical damage and an enemy attack with 3 slashing and 3 piercing damage. Would I take 3 or 0 damage?\n\nFrom my understanding, the rule said to refer to weakness and weakness only trigger once, so I would take 3 damage. \n\nUnless \"resistance to all physical damage\" uses the same rule as \"resistance to all damage\"?"
        ]
    },
    "Drawing of my fist character + tips for a beginner!": {
        "title": "Drawing of my fist character + tips for a beginner!",
        "score": 209,
        "url": "https://i.redd.it/6xp8in40ue9d1.jpeg",
        "content": "(Ancaslocas = Crazyhaunches)\nIm playing Pathfinder 2e for the first time next week and I’m very excited! It will be a funny oneshot to learn the basics, but before I wanted to ask what good tips could you give to a first time player :) ",
        "num_comments": 21,
        "comments": [
            "this is very important for swashbuckler, not all enemies have attack of opertunity.  Abuse the hell out of your movespeed and GTFO out of melee after dealing your damage.  If they have Reactive strike/attack of oppertunity you can always step out of range instead.",
            "Tips for a beginner? Don't use all three actions to attack! Help your party by flanking, intimidating, and tripping! Use Recall Knowledge! PF2e is all about teamwork!\n\nPS: your artwork is amazing!",
            "By the way this is my own art and you can find me on instagram by @/mimdeetz! \n\nBypa is a swashbuckler, stickytoe Grippli! With a big charisma and a Hounded Thief background, she can be too confident at times but never fails to impress everyone with her battle dance",
            "Nice art and nice name xD",
            "Looks awesome! \n\nCant wait to share my character here! Unfortunately I dont have the karma to post, but soon!",
            "Great art. My tip is to know your character rules inside and out to take work off the GM.\n\nAlso...always spell check your post title before hitting submit.",
            "Wonderful and whimsical. I love it.",
            "Holy crap that is an amazing drawing!",
            "Awesome. There's definitely a \"love is all\" feeling. You made me nostalgic.",
            "Amazing art! My first instinct was , this is definitely a Grippli monk, but now I can definitely see Swashbuckler as well <3"
        ]
    },
    "Presenting Flatfinder, the system hack based on Proficiency without Level": {
        "title": "Presenting Flatfinder, the system hack based on Proficiency without Level",
        "score": 29,
        "url": "https://www.reddit.com/r/Pathfinder2e/comments/1dr8j5f/presenting_flatfinder_the_system_hack_based_on/",
        "content": "A couple of years ago, I posted Variant Proficiency, a guide for Proficiency without Level. It went relatively under the radar, but I still got some useful feedback. Now, with that feedback, more ideas and more testing, I am ready to present a new and improved version, now named Flatfinder.  \nI realized that it is better marketed as a system hack than a variant rule, because it really feels like another game, despite the text being just a few pages long. The name change, inspired by Minotaur Games' Hopefinder and u/RussischerZar 's [Half-Finder](https://www.reddit.com/r/Pathfinder2e/comments/kqfqai/i_present_halffinder_the_variant_rule_no_one/), is meant to emphasize that. I don't want newcomers to see this and think \"Oh, yes, this is the definitive way to play Pathfinder\", rather \"This is not Pathfinder, but based on it\".  \nThinking of it as a hack also allowed me to get a bit more creative with the changes. Removing level from proficiency is a significant shift in game design philosophy, and requires a shift in approach when playing and running the game. This inspired a new tool/mechanic: I am sure you will be able to tell as soon as you read it.\n\nWithout further ado: [https://homebrewery.naturalcrit.com/share/Dn-97Ro82ibq](https://homebrewery.naturalcrit.com/share/Dn-97Ro82ibq)",
        "num_comments": 6,
        "comments": [
            "For those on phone, who get Render Warning when we enter the site, could you summarize the differences between the PWL variant rule and Flatfinder?",
            "I like these a lot, these are very solid! I might end up using these in my games. The only one I'm iffy on is the changes to medicine, I'd rather decrease expert dc by 3 master dc by 7 and legendary dc by 15 to match the levels, but these rules are still all right.",
            "I went in expecting to not like it, and I was wrong. Great execution.",
            "Basically, there are different DCs, adjusted mechanics, a reworked Treat Wounds, a new type of check, and various tips for running the game.",
            "I realize that the new Treat Wounds is a bit clunky, but a key feature of Treat Wounds in Pathfinder is that expected healing scales with level. Flat DCs with flat proficiency and flat healing amounts can't replicate that, so I decided to scale healing amounts.",
            "I appreciate you sharing. \n\nI am having trouble seeing the need for this. The introduction cites that an adventure for a level 10 party is trivialized by a level 18 character. (This may not be true, because 1 character may not be trained in all the skills, but I grant the argument to ring true.) The other example was that characters revisiting a challenge after several levels come back to find its not a challenge anymore. I dont see a problem with this. In a game where your hero eventually rivals Gods in power by gaining levels, why should crafting +1 armor remain a challenge for them? Its not see easy a problem to solve, because level does come into play with skill checks in a variety of ways. (See below.)\n\nYou seem to be chasing realism in a game, where as you level up, you can no longer die from a single sword hit. As for me, I like the idea that increasing in level makes you a more potent hero in both combat and out of combat. The issue is that you seem to want to keep the combat level scaling and not the skills. I dont see a reason to have one and not the other.   I will grant you that it is weird on its face that DCs for PCs to face go up with level somewhat arbitrarily. But so do the monster hit points. An alternative solution would be to not increase difficulties for characters that are not part of the core adventure.  So, yes, the merchants do not get better at haggling as you level up, but you are better at haggling. \n\nOffering some constructive input here. One problem you have is that some skill check results are tied to level. This means you may need to rewrite more rules. \n\nEarn income and crafting are tied to level. Treat wounds is also affected, which you have rules for. Regarding earn income, I suppose now a lvl 1 would have the same chance to earn money as a lvl 14 level (maybe at -4?), which completely breaks the gold economy, which is based on combat level.  (Even if they fail the check, they make buckets of money.) So then, you have to add a level restriction to what tasks you can attempt, in lieu of adding level to the DC.   And now you just broke verisimilitude, which you were trying to accomplish. This problem is demonstrated in the treating wounds hit point result is based on the combat level.\n\nI see your competence checks could address these problem with further development. But right now, the competence check lacks the granularity of every +1 mattering.  And since every level does matter for creating and earn income, you need this.   But then it seems we come back full circle to lvl affecting outcome of the skill."
        ]
    },
    "In a paid game where one of the players just won't stop talking.": {
        "title": "In a paid game where one of the players just won't stop talking.",
        "score": 89,
        "url": "https://www.reddit.com/r/Pathfinder2e/comments/1dr0m09/in_a_paid_game_where_one_of_the_players_just_wont/",
        "content": "Hi Everyone,\n\nAt the moment I'm in a paid campaign and one of the players just will not stop talking and steering the party. Any second of silence is filled with them. They were away last week and honestly the session was way more fun and everyone (there are 5 players) seemed to get more of a chance to engage with NPCs and make fun things happen. Before, the loud person was virtually driving the plot forward themselves. I don't hate this person, I actually only just recently noticed this was happening, I have played a whole campaign with them in the past. We are playing SOT at the moment, so there is a lot of role play, it's so it's coming through a bit stronger than before.\n\nWhat do I do? How do a talk about this without sounding like a complete asshole? I don't want them to feel bad or to get kicked out or anything, but it's really bothering me that the quieter people in our group are not engaging with the story very much when they are around. They are also not the face of the party but insist on talking to virtually every NPC, and insert themselves in every conversation between party members. It's a shame because I like playing with this group allot.  How can I approach this in a way that doesn't come off like, \"you talk too much\" or \"you are playing wrong\".\n\nEdit: Thanks for the replies everyone ill talk to the gm and if he bounces me out ill have to find another game.",
        "num_comments": 32,
        "comments": [
            "You're paying the GM for a quality and curated experience, so they'd be my first port of call. Talk respectfully to them about the issues and ask if they can do something about it, like talk to the player in private, without naming you specifically.",
            "If you are paying for a service then it is 100% the GM's job to provide the best experience for all the people paying them.",
            "Yeah you need to be talking to the Manager (The GM), not some random possibly homeless guy you ran into in the parking lot (Us).",
            "One huge benefit of paid games is that group dynamics isn't your responsibility. Talk to the gm and let them manage this, they are the professional here!",
            "Alright, but I'm also worried that the GM might just bounce me out as a solution. Maybe ill just do it and see what happens.",
            "The First reaction by an experienced GM would probably be a strict management of the spotlight",
            "I disagree t with hat  their job is to provide an adventure not to manage the party. The people playing need to be adults and just talk to each other maybe they are the only one that has an issue with it",
            "Just trying to get advice on how to talk about it. I'm a very brash and deadpan sort of person so its hard for me not to sound harsh talking about things like this,",
            "No RPG is better than bad RPG (**specially** if you are paying for the bad experience).",
            "If that happens it was a sign that they're not worth your money."
        ]
    },
    "Why do \"why I quit Pathfinder\" videos keep happening?": {
        "title": "Why do \"why I quit Pathfinder\" videos keep happening?",
        "score": 141,
        "url": "https://www.reddit.com/r/Pathfinder2e/comments/1dqwdzt/why_do_why_i_quit_pathfinder_videos_keep_happening/",
        "content": "A video popped in my YouTube feed that was saying he was leaving Pathfinder. I haven't watched it yet and I might not because I am tired of this format. I can think of 3 other high profile videos that have done this. \n\nWhy does this keep happening? It is not news when someone stops playing Shadow Run.",
        "num_comments": 147,
        "comments": [
            "Because its a good clickbait title for youtube?",
            "I think most of RPG Youtubers go back to DnD mostly because pathfinder2e doesnt give as much views as DnD 5e",
            "It gets clicks from: \n- PF2e players that are mad about it\n- 5e players that want validation that 5e is the best thing ever",
            "5e content creators virtue signaled quitting dnd when they sent armed thugs to one of their houses, but the Algorithm encourages them to produce Hasbro Game videos, so they need to apologize to the Algorithm to convert more videos to sponsorship dollars.",
            "As someone who watched the video in question, his group was not enjoying the system and he didnt feel confident in running the game. In my personal opinion (as someone who wants to run PF2e, but has a group that prefers 5E), there is a sense of sunk cost fallacy in people who are used to 5E imbalance. The fun is purely based in how ridiculous things can go and not affect the game. \n\nRegarding the many videos, I will never begrudge anyone who has a job in content creation from making content that will allow them to keep their job. I only hope they actually enjoy the content they create.",
            "PF2e is not a system for everyone or every party. There's no real problem in those videos. They really tried it. It's not their thing for x or y reasons that are valid to their point of view. It's not the same as the previous guys who did not really read the rules if you know what i mean. I don't see the problem in the recent videos.",
            "Its content creator nonsense. Ill never play Green Ronins AGE system again, barring someone holding a gun to my head, but Im not making a fucking video about it.",
            ">It is not news when someone stops playing Shadow Run.\n\nIt doesn't have enough players to show up in feeds at all, for one. And there's \"I'm quitting D&D videos\".",
            "Because and this may shock you, PF2e is in fact not a game for literally everyone. It's not \"5e but better\" as a lot of people think it is and a good chunk of people (especially in like the OSR community) in fact think PF2e is considerably worse than 5e purely because it focuses so heavily on balance while other games intentionally don't care about balance at all.",
            "Because YouTubers who switched to Pathfinder during the OGL craze couldnt keep their audience, so theyre switching back to the game with the built in ad revenue"
        ]
    }
}