{
    "Weekly Questions Megathread - June 21 to June 27, 2024. Have a question from your game? Are you coming from Pathfinder 1E or D&D? Need to know where to start playing Pathfinder 2e? Ask your questions here, we're happy to help!": {
        "title": "Weekly Questions Megathread - June 21 to June 27, 2024. Have a question from your game? Are you coming from Pathfinder 1E or D&D? Need to know where to start playing Pathfinder 2e? Ask your questions here, we're happy to help!",
        "score": 10,
        "url": "https://www.reddit.com/r/Pathfinder2e/comments/1dkxucp/weekly_questions_megathread_june_21_to_june_27/",
        "content": "# Please ask your questions here!\n\n[**New to Pathfinder?** ***START HERE!***](https://paizo.com/pathfinder/getstarted)\n\nOfficial Links:\n\n* [**Paizo**](https://paizo.com/) \\- Main store to buy Pathfinder books and PDFs (clear your cache if you have performance issues)\n* [**Archives of Nethys**](https://2e.aonprd.com/) \\- Official system reference document. All rules are available for **FREE**\n   * [Player Guide](https://2e.aonprd.com/PlayersGuide.aspx)\n   * [GM Screen](https://2e.aonprd.com/GMScreen.aspx)\n* [**Pathfinder Nexus**](https://app.demiplane.com/nexus/pathfinder2e) \\-  Official digital toolset / **FREE** Game Compendium \n   * [Game Compendium](https://app.demiplane.com/nexus/pathfinder2e#game-compendium)\n   * [Pathfinder Primer](https://app.demiplane.com/nexus/pathfinder2e/sources/pathfinder-primer) \\- Digital Reader\n* [**Our Subreddit Wiki**](https://www.reddit.com/r/Pathfinder2e/wiki/index/) \\- A list of all the resources we know about\n\nUseful Links:\n\n* [**PF2 Tools**](http://pf2.tools/) \\- Community made resources\n* [**Pathfinder Infinite**](https://www.pathfinderinfinite.com/) \\- 3rd Party Publications for Pathfinder 2e\n* [**Pathbuilder**](https://pathbuilder2e.com/) \\- Web and Android based character creator\n* [**Wanderer's Guide**](https://wanderersguide.app/) \\- Web based character creator with 3rd party integration \n* [**Startplaying**](https://startplaying.games/search?gameSystems=pathfinder-2e) \\- Find open games of Pathfinder (payment may be required)\n* [WHAT'S THE DIFFERENCE between 5e and Pathfinder 2e?](https://www.reddit.com/r/Pathfinder2e/wiki/resources/how-is-pf2e-different-from-5e/)\n\n [Megathread archive](https://www.reddit.com/r/Pathfinder2e/search/?q=flair%3A%22megathread%22&sort=new&restrict_sr=on&t=all)",
        "num_comments": 57,
        "comments": [
            "Creating my first character today, a half-orc mage. Is it correct to really have 18 INT on lvl 1 or did I get it wrong? (Since 18 is the maximum amount of points).",
            "no spoilers please.\n\nMy party's going to be doing Abomination Vaults. we got mostly single damage stuff. A Thaumaturge for debuffing and single damage. A witch for healing and some rare group damage. An Armor Inventor for our tank.\n\nour last member's debating between a Rogue or a Wizard (or waiting fro Player Core 2 and maybe Investigator or Barbarian w/Barbarian the likelier).\n\nBut they want to know, if they went for heavy damage Rogue would it be 'fine' or is this AP really kind of needing AOE/group damage spells like from Psychics or Fireballs or storm Druids or such?\n\nAnd they also would like to know, considering the (brief) party description, which options might be the better choices?",
            "The answer is most likely no, but… does the frightened condition reduce DCs to Recall Knowledge on the frightened creature?",
            "Do the resitances from [Backfire Mantle](https://2e.aonprd.com/Equipment.aspx?ID=1040) and [Charhide Goblin](https://2e.aonprd.com/Heritages.aspx?ID=250&Redirected=1) stack? Since Backfire Mantle doesn't directly provide resistance to a damage type",
            "I'm pretty new to PF2e and I want to make a character who basically the Mystic Knight class from Dragon's Dogma. Imagine someone in armour with a tower shield in one hand and a magic staff in the other, a frontline arcane caster. What class would suit that best, if any?",
            "CAn hazards and traps function on multiple initiatives? Wondering if it's best to run a conveyor belt as \"Moves 5 spaces on its turn\" or to split up its initiative evenly and have each separate square movement happen on a different initiative count.",
            "Do I need to use another harm/heal slot to use second part of restorative strike?",
            "Can natural weapons like antlers be capped with metal tips, like silver or other materiel?",
            "Hey, I'm going to be playing in a Kingmaker game soon and I want to play a Thaumaturge with a hand crossbow and tome implement but right now I'm at a loss about what archetype I could take since we have free archetype rule turned on, any good suggestions?",
            "I got a question regarding \"poisoned\" arrows. One of my players is a ranger and we are running though the Abomination Vaults. They've fought the mitflits and the morlocks and while exploring I told them they found some corners piled with excrement because they're nasty creatures. \n\nHe then says he wants to dip the arrows in the poop to make a poisoned arrows. Logically, I have no issue with this. Mechanically, I'm not a fan and I said no. \n\nMy table argued for a bit that I should just HB something but i don't want to do that either. One of the major reasons I moved from 5e is because I hated having to juggle homebrews and precedents. \n\nI said, the book has stuff you can make, but I'm not going to let you make poisoned arrows for free or without a mechanical explanation. \n\nAnyone have any idea how to play around \"natural poisons\""
        ]
    },
    "Dr Nathan Barling from PalaeoGames – AMA": {
        "title": "Dr Nathan Barling from PalaeoGames – AMA",
        "score": 17,
        "url": "https://www.reddit.com/r/Pathfinder2e/comments/1dlu4dr/dr_nathan_barling_from_palaeogames_ama/",
        "content": "Hey everyone,\n\nI’m Dr Nathan Barling, palaeontologist with the University of Exeter (UK) and director of PalaeoGames Ltd. We’ve teamed up with seasoned Pathfinder 2E experts Linda Zayas-Palmer & Mark Seifter to bring our D&D 5e book “[Dr Dhrolin’s Dictionary of Dinosaurs](https://www.kickstarter.com/projects/palaeogames/pathfinder-second-ed-dr-dhrolins-dictionary-of-dinosaurs)” to Pathfinder Second Edition.\n\nThis is primarily a scientific outreach project and, as part of that, we’re doing a Reddit AMA. So, if you have any questions about who we are, what we’re doing, what’s in the book, our palaeontological research, or just any other questions – I’ll be here all weekend to answer them!\n\nThanks again for popping along!\n\nDr Barling\n\nhttps://preview.redd.it/upp8g5ev448d1.jpg?width=1754&format=pjpg&auto=webp&s=17c9e501ed6b85145f2261b6da831ceb72dff321",
        "num_comments": 16,
        "comments": [
            "I'm curious about doing something like this but with a different theme. What was the process with getting this started and how long did it take to get the first book published? Have you thought about doing your own system?",
            "Hi\n\nHow does taming work? Can I just do small dinosaurs or can it work for any kind?\n\nThanks!",
            "Obvious question: what is your favourite dinosaur (or indeed any animal from the eras you study)? Both IRL and what you have implemented mechanically.",
            "Is this supposed to cover the dinos of a particular age of the Mesozoic, or did your team decide to pick ones that hold weight within pop culture?",
            "What were the inspirations beyond the real-life animal for the playable ancestries? I remember reading on the discord that there was an idea of making the ankilier large but due to 5e limitations it was dropped, will they have a large heritage in Pathfinder 2e? Will the rules for howdahs appear in the Pathfinder 2e version? Finally, I want to say that I was very pleasantly surprised by the eight chapter of this book, I though of this book as purely a GM book before getting it but it has plenty of cool player options.",
            "Hi Dr. Barling! Two questions and a comment for you.\n\n\nFirst, how has your research journey influenced your RPG content? I understand most of your published work is on insects and fossil preservation. How does that shine through in a book about unfossilized dinosaurs?\n\n\nSecond, how do you approach making dinosaur stat blocks feel distinct from one another? Many a time I've wanted to incorporate an obscure species through homebrew, but can't figure out how it would be mechanically distinct from monster manual dinosaurs.\n\n\nLastly, I wanted to say the magic rules for Spinosaurus in the 5e version had me rolling on the bed laughing. You and your team do excellent work.",
            "Do you have any plans for further releases? Either new systems with the same content or entirely new books? I feel like you could make a really good system agnostic setting built around the races you created already. Thinking about how cold blooded creatures would need to design their cities, and what farming looks like with prehistoric creatures would give you a pretty unique world!",
            "From conception of the idea to the finished product, it took us 2 years. However, we were only able to achieve that goal because we had a hard deadline - my wife was pregnant and my daughter was on the way! It was exceptionally intensive work during this time, but the best advice I can give is to just get your ideas down on paper first, then really take your time researching how to launch, run, and fulfil a Kickstarter before announcing the project. I spent the better part of 9 months preparing and creating PalaeoGames Ltd. as a company, then a further 3 months of promoting the brand before launching the actual Kickstarter. So, there’s a lot to sort before you publicly ‘start’.\n\nIf you have people in your life that can provide guidance about any aspect of the project, that'll also be a major help. Designing rules, writing lore, illustrating characters are only a small part of a project like this – there’s a lot of business, social media management, and marketing to learn too.\n\nAlthough I could probably give designing a system a good go, I think that the risk vs amount of work is too great compared to working with already established systems.\n\nI hope that answers your questions.",
            "Thanks for the question! For 5E, the taming works by first subduing and containing the creature, then once per day a player/party can attempt a contested Animal Handling vs Survival check against that creature, so long as they have the required food. Once they succeed a number of times equal to the creatures CR or PB (whichever is higher), the creature is considered tamed. Failed checks subtract from this number. So, it can end up being quite a long process, but with a big payoff at the end.\n\nThis system won't really work in Pathfinder 2E for a number of reasons and Linda, Mark, and I have discussed a bit about the best approach to take. It's still a work in progress, but I believe that the current plan is to provide some balanced stat blocks for animal companions that are themed around certain dinosaur lineages, but aren't specific animals from the book. These will then be available for players to take in situations/builds that would allow them to have a companion, while preserving combat balance. That’s the plan on paper at least for now!",
            "Juravenator is my favourite dinosaur, mostly because of how beautiful its fossil is. I made sure that was in the book because I love it! In terms of mechanics, I really like our Bahariyan Polycotylid (there’s an interesting story behind the name) as it forces players to think outside of the box. It’s a marine reptile (Plesiosaur) rather than a dinosaur and has the ability to muddy water, rendering it opaque. Fighting something in water is one thing. Fighting it while you’re essentially blinded is another."
        ]
    },
    "Announcing the development of a level 4-8 Dawnsbury Days expansion": {
        "title": "Announcing the development of a level 4-8 Dawnsbury Days expansion",
        "score": 201,
        "url": "https://www.reddit.com/r/Pathfinder2e/comments/1dlp3y7/announcing_the_development_of_a_level_48/",
        "content": "I started the development of an expansion for [Dawnsbury Days](https://store.steampowered.com/app/2693730/Dawnsbury_Days/), a PF2E video game, which expands the game by four more character levels, going up to character level 8.\n\nDawnsbury Days is a turn-based tactics RPG with a focus on tabletop fidelity and interesting combat encounters. Currently, it goes up to character level 4, but with this expansion, I hope that other classes will finally match or exceed the capability of Fighters, and allow for even more varied tactics. Already results from an early playtest are encouraging.\n\nHere's the current planned list of character features:\n\n* Extension of the class chassis of each of the 13 classes up to level 8; and giving modders the tools to expand modded classes similarly;\n* 60+ new class feats; 8 new ancestry feats; 60+ new spells to allow for customization at higher levels;\n* Rune subsystem for fundamental and weapon property runes;\n* User interface improvements to handle the increased complexity of both player characters and enemies;\n* A couple of free encounters at higher levels to allow players to test these new abilities.\n\nAlongside this, I am also working on a DLC expansion which would add additional encounter content for players to experience. This would almost certainly be in the form of an additional campaign, but it's in an earlier design stage and I'm not yet ready to announce information about this expansion.\n\nWith regards pricing, it's almost certain that such a DLC expansion would be paid, but that the new character content will be added to the base game as a free patch. That way, modders will not need to create separate packages for players with the DLC and without, and can assume that everyone has access to everything.\n\nFinally, today I have a preview of some of the new character content from the development build:\n\n[The sorcerer selects high-level spells](https://preview.redd.it/kqk7siklc28d1.png?width=2560&format=png&auto=webp&s=4b24c1b84c4eee73e9e5b5715975c0262e606753)\n\n[The kineticist chooses ability boosts. Characters, to me, feel more powerful, thanks to both greater numbers and more abilities, even against stronger enemies](https://preview.redd.it/arim0pwyc28d1.png?width=2560&format=png&auto=webp&s=0539cf89a8a5cc49daa1e39581b7d6cc79f3ef93)\n\n[A high-level battlefield. Note the multiple active zone effects, Circle of Protection buff, but also the fact that many heroes are drained and one is controlled via Dominate — some high-level battles can get more complex.](https://preview.redd.it/9120mx4od28d1.png?width=2560&format=png&auto=webp&s=f95cf99fbba0755c93d4fd5c6d036ce47283c4ef)\n\nThis remains a hobby project to be done in free time; and so I cannot estimate a release date yet.\n\nHowever, I can answer questions here and you can follow the development of the expansion [on Discord](https://discord.gg/MnPp8z2epk), [on Patreon](https://patreon.com/dawnsbury) or [on Steam](https://store.steampowered.com/app/2693730/Dawnsbury_Days/)!  \n\n\nEDIT: The title incorrectly says level 4-8 expansion. It should say \"level 5-8 expansion\". Character level 4 is already present in the game.",
        "num_comments": 16,
        "comments": [
            "This is exciting news! I'm guessing the success of DD has been enough to support you? Keep us posted!",
            "This is really cool.",
            "Very exciting, your game is fantastic. Putting my hand up that I'll buy a DLC regardless of the price.\n\nGetting a chance to push the tactical angle of PF2e is great, especially since I'm GM in most of my games and other players don't have that level of mechanical interest.",
            "HELL YEAH",
            "Oh man, I am HYPED! I got way more millage out of this game than I originally thought. Played through the campaign thrice (including the highest difficulty) and completed all side adventures, simply because as a forever GM I could finally enjoy \"the other side\" for once. :D\n\nAnd lately I'm itching for a caster only run!\n\nThank you for all the work you put in. Can't wait.",
            "Fantastic news! I'll be buying the DLC as soon as it's out.  \n\nTake your time with it, I hope it remains enjoyable for you :)",
            "nice, i enjoied the base game. \nAre you going to add the remaster rules in this time?",
            "Cool beans!",
            "That's awesome! I'll gladly pay a couple of bucks for a level 8 expansion.",
            "Very excited!! :D"
        ]
    },
    "Oh my God, XP actually works. My First Pf2e Session as GM Post-mortem": {
        "title": "Oh my God, XP actually works. My First Pf2e Session as GM Post-mortem",
        "score": 133,
        "url": "https://www.reddit.com/r/Pathfinder2e/comments/1dloioq/oh_my_god_xp_actually_works_my_first_pf2e_session/",
        "content": "So I finally managed to get my group scheduled and run my first pathfinder session. I'm hoping to get down all my thoughts and hopefully share good ideas with all of you. (for context I've run Call of Cthulhu, 5e and Fate Core as well)\n\nI admit that I'm probably being WAY too ambitious in using new (to me) mechanics in this campaign.  I'm doing hexploration, calendar time keeping, and perhaps my most dreaded mechanic, Experience Points instead of story leveling. \n\nI've never used 5e's XP system, because no one has. ever. In my view it seemed tedious to learn all the values characters level at, and write down ridiculous 5-digit numbers for every monster you throw at the party. Far better to let your party get excited when you decide to give them a level up. (and the less said about CR the better...)\n\nAt first I thought that Pf's XP budgets were a bit too small (80-100 for a moderate fight). it would take about 10 fights to level up at that rate. But then I looked at my notes and saw that my players had been doing a lot of other stuff in the role play scenes: chatted up the innkeeper, read a book looking for directions to the next location, searched the battleground after winning the fight to see if there were secrets or loot. All of that is the kind of play I want to reward: and now with this XP system, I can! \n\nUnlike D&D, which only awards XP from Combat (yes I checked), PF has XP amounts to award when the players \"accomplish\" something.  So as I was looking over my notes, I had a bunch of little things my players did worthy of an XP reward. It took the session from only 100 XP for the combat to 210 XP. That lines up almost perfectly with book's recommendation to have a level up every 4-5 sessions.  While doing this math, I discovered a joy in knowing that the player's actions are having a tangible effect on their progress, rather than me throwing a level up at them because it will be boring if they stayed this level any longer.\n\nSo what is your experience with using XP? If you have any tips or pitfalls I'd love to know more. \n\n",
        "num_comments": 45,
        "comments": [
            "I like the transparency of it. You know that 100 XP takes you 10 percent of the way to a level. It's easy to understand.\n\nI'd like to claim that my system for XP in my afterschool middle-school class inspired Paizo for PF2: [https://guildberkeley.wordpress.com/2013/09/16/important-new-rules-for-the-guild/](https://guildberkeley.wordpress.com/2013/09/16/important-new-rules-for-the-guild/)\n\n(They earned XP by participating, which let them level up their characters. They needed 100 XP to level up.)\n\nPaizo probably had no idea I did this, by the way lol",
            "I do like how much more clearly the idea of non-combat/danger XP rewards are spelled out in PF2. Most editions of D&D in the past have had some vague \"give some XP when they do a thing.\" kinda deal- and it was such a hassle to figure out an appropriate amount of XP for something.\n\nNow, you can easily just say \"this would be an appropriate challenge for a party of x level\" (which is a lot easier to do because of how clear cut the numbers are) and award xp based on x and the actual party level- plus the guidance on how much xp to give for accomplishing something aside from an encounter (combat or otherwise).\n\nAnd the flat xp system means it's a lot easier to say \"give them 50xp for accomplishing something that propels the story forward.\" vs. \"give them 5% of a level for accomplishing something that propels the story forward\" and then having to calculate what 5% of a level even IS at their current level.",
            "I like PF2e's handling of it, but it's actually not that different from D&D 5e's. In D&D 5e you absolutely _may_ award XP for stuff out of combat. See the Dungeon Master's Guide, \"Noncombat Challenges,\" p. 261.",
            "XP works great, it tells me how difficult an encounter will be, tells me the net value of loot and encounter should drop, and helps me plan out story arcs (typically 1 arc = 1 level for me).  \n  \nFriendly reminder that in encounters traps have a level/XP value as well, it can be fun to throw a few traps in the mix to spice things up!",
            "I also plan on using xp when we start our first pf2e campaign. \nThe beginner box have some good suggestions of when to give some small amount of non-combat xp. \n\n\nLike they might have successfully scaled down a wall, or sneaked past a monster. \nJust remember they cant double dip on xp, so if they avoid a fight in some way, they cant go back and kill it to earn xp again. \n\n\nJust non sure how much xp to give for different things yet",
            "Love seeing XP actually matter! It's so satisfying to track progress tangibly.",
            "Yup, I felt the same way. I [posted](https://new.reddit.com/r/Pathfinder2e/comments/17mk5hp/friendship_is_magic_a_postmortem_of_our_first/) [before](https://new.reddit.com/r/Pathfinder2e/comments/1alyxbq/first_10_sessions_in_pf2e_a_report_the_encounter/) about my experience switching from 5e, and I really liked the pace at which XP was awarded. For about 15 sessions I tried experimenting with giving it a bit more structure, and making XP acquisition player-facing, and was *very* pleasantly surprised with how it worked.\n\nThe premise for that chunk of sessions was the exploration of a port district of an abandoned city. I used a map from Borough Bound ([Yllmourne](https://new.reddit.com/r/dndmaps/comments/1b8spoc/yllmourne_the_pirate_town_all_5_maps_combined/), to be exact), divided it into neighborhoods, like a point-crawl, and populated it with threats and treasure appropriate for levels 3-6 (party started this adventure at 3, and leveled up to 4 about 10 sessions in). I decided to assign XP rewards to relevant activities, and make them known to the players beforehand, to see whether it would shape their behavior:\n\n* \\+10 XP was awarded for visiting a new neighborhood.\n* \\+10 XP was awarded for every survivor found and escorted to safety.\n* \\+10 XP was awarded for every McGuffin shard they found (5 in total - the villain faction was also racing them for it).\n* A few other +10 XP rewards were scattered around: finding crucial NPCs, uncovering information related to the main mystery, etc.\n* Combat encounters awarded regular XP.\n* A handful of quests were offered, usually rewarding +30 XP and a Hero Point. The party ended up finishing 3 of those.\n* Completion of the main objective awarded +80 XP and a Hero Point.\n\nThis resulted in 90-180 XP (avg. \\~120) per session, depending on how well the group did. About a quarter of the XP came from non-combat sources. Our sessions were 3h, and we averaged about 1 combat per session.\n\nSo, it was exactly the pace of progression we like (a level-up every 8-10 sessions), but it didn't feel like an XP conveyor belt; instead, it felt earned and self-directed.\n\nI often hear how PF2e isn't a good fit for sandbox campaigns; given the steep scaling, this might very well be the case for long-term progression, but for a mini-sandbox adventure that only spanned 2 character levels, it worked really well! The characters started out level 3, and were threatened by practically everything in it; after the first level-up, they felt a lot more comfortable pushing deeper into the district and away from their safehouse, and by the end they were almost level 5 and had acquired much of the level-appropriate equipment to feel like they've mastered the district.\n\nYou know what else it achieved? ***Making the game feel like Bloodborne.*** Our entire campaign premise was supposed to be \"urban eldritch horror\", yet in its 40 prior sessions in D&D 5e, I never managed to nail down that feeling.",
            "Just FYI, D&D also rewards story or accomplishment XP. It's largely up to DMs to administer it, although published adventures give amounts for certain accomplishments. It's also long been a rule of thumb that if players solve an encounter without combat that was designed to be a combat encounter, they gain the same XP as if they'd won the combat. I don't know that it's ever been a hard rule to give out-of-combat XP in D&D, it's always been encouraged and even roleplay XP has long been a thing. \n\nI rarely use XP anymore in any system, preferring milestone levelling (for simplicities sake and because it doesn't feel good for players when their characters are lower level than others), but I've used XP plenty in the past in any number of systems. I actually loved handing out non-combat XP. In general, I'd reward players with XP for good roleplay, or anything else that I thought made the game more fun for everyone. \n\nI also awarded extra XP to players playing suboptimal character builds for flavor purposes. It brings more flavor and variety to the game when players do that, which I think should be rewarded, and it also helps them not fall behind more optimized players since they level up faster.\n\nParticularly now, with games having new mechanics for DMs to reward players (inspiration in 5e, hero points in pf2e, as well as other options), and classes/builds being more balanced than in previous systems, as well as the fact that I largely play with the same group of people who all want to be there, so I don't have to incentivize showing up with XP, I don't see enough benefit to overcome the simplicity of milestone leveling anymore. That said, every situation is unique, and XP is a tool that DMs can use (or not use) to make the game better.\n\nA little more context: In previous editions, it was common to have players lose a level (or XP) when they died, so their new character was weaker. Lower level characters leveled up faster, so it wasn't a huge worry that they would fall too far behind, and it did make the game feel a bit more gritty. In my experience, players wouldn't do quite as much stupid shit, and tried a lot harder not to die under such a system. The popularity of roleplaying games has exploded in recent years, and as it's become a more casual way to have fun with friends, it doesn't feel like that kind of punishing mechanic vibes with the current player base.",
            "The XP Budgeting is what made it so difficult to want to learn 5e's system. I've heard of tales where One CR5 =\\= another CR5. One can TPK, the other is barely a sweat.\n\nPolitical stories can become an XP Gold Mine in a single, tense, session.\n\nDon't forget the Loot! The Loot table is a guide to make sure your players feel sufficiently powerful for their level/enjoy roleplaying to the fullest. Tons of items are \"social magic items\" that will boost your skills by +1.",
            "The encounter balance system is one of the main reasons why I completely switched my long running 5e game onto pf2. Not planning on looking back"
        ]
    },
    "How to handle a defeatist player (possible kingmaker spoilers)": {
        "title": "How to handle a defeatist player (possible kingmaker spoilers)",
        "score": 48,
        "url": "https://www.reddit.com/r/Pathfinder2e/comments/1dloq8q/how_to_handle_a_defeatist_player_possible/",
        "content": "I'm running Kingmaker AP,  and the players just infiltrated the Fort with the Stag lord. \n\nOne of my players is playing a witch, and sent her familiar in to scout. At this point they had already seen how dangerous the stag lord was (he dealt a ton of damage to a player who tried to sneak a look in his room earlier by throwing an empty wine bottle at them) but still took the risk, only to roll a 1 on the familiars stealth check and end up with the familiar dying through a critical hit by the stag lords sword. \n\nMy players responded to this by freaking out in character and attacking the bandits, and we called it session there since it was late. \n\nThe problem is that this player is now complaining a bunch about how their familiar died, how they won't be useful since they took familiar master (free archetype) and they'll just be siting there waiting to cast a spell since they can't change them right away. I had warned them before, both through words and actions, that the stag lord was very dangerous, and the reason the fight had broken out anyway was because they chose to attack a bandit after the familiar died. \n\nCurrently they are making a backup character, insisting that their character is going to die because they don't have their familiar and complaining how they don't have an idea for the backup \n\nI'm hoping I could get some advice with how to deal with this player \n\n\nTLDR: player got their familiar killed by bad decisions, before starting a fight that the party had taken steps to avoid  and then got mad and is being disruptive about it. ",
        "num_comments": 27,
        "comments": [
            "Does he know a Witch gets a new familiar during daily preparations?",
            "Most of a Witch’s power still comes from just casting spells, the familiar is only a boost, regardless of them taking the Familiar Master Archetype. \n\nAs always the advice on how to deal with a player is to talk to them like an adult, tell them the issue you have with their behaviour and if they can’t respond maturely, they need to leave your table.",
            "I feel like the party should have regrouped, left, and tried again the next day. And I'm guessing you probably feel the same?\n\nIt's generally a good idea to let the party flee if that's what they want to do. If I were playing, that's what I would want to do.\n\nAnyway, any chance they started the fight because they were rattled after losing the familiar and just not thinking right?\n\nI guess what I'm thinking is that I would encourage them to flee (and let them) and hope that they wait till at least daily prep before trying again.\n\nAs for the player's attitude and maturity or whatever, I dunno. I guess it depends on how well you know them but maybe you can talk to them? Tell them that sometimes rolls go bad and there are consequences. It's okay to feel bad about losing a character but they can always make a new one, resurrection is a thing, etc. Maybe find out how they feel about character death and so on.\n\nThe game is pretty flexible and not everyone wants to play a game where they can easily lose. Maybe the party would enjoy the game more if the difficulty was lowered. You can definitely slap the weak trait on the monsters to make it easier on them if that's what they would prefer.",
            "Your familiar is going to die at some point in the campaign as a witch. That's just the way the cookie crumbles. That's why they respawn so fast.\n\nAnd your familiar dying doesn't matter much. Most of your power as a witch comes from your spells and hexes; your familiar is a nice added bonus but it's not necessary. \"Sitting there and casting spells\" is what you do 99% of the time anyway.\n\nJust tell them that.\n\nThey can always run away instead of fighting the Stag Lord.",
            "Sounds like they're more attached to their familiar than their character's agency.",
            "......the player had a roll go against them and then threw a tantrum.\n\nThe way you handle this is by not playing with children?\n\nTell him that if he cannot take the dice going against him with maturity and grace that perhaps he should go play a game that is more his speed.",
            "I mean my opinion is that players shouldn't go into a TTRPG session expecting to have a sandbox world where none of their actions have consequences.\nThey didn't listen when you told them the stag lord is dangerous. Well they fucked around and found out. Which happens in DnD. ",
            "Maybe a little bit of devil's advocate here, but has the player felt useful/powerful during the rest of the campaign?\n\nIf they haven't or gave signs they felt unsatisfied with their own performance at full strength then any extra handicap will feel uncalled for.\n\nHow much/how little has the player been doing in past fight and which portion of that was the familiar ability? The player might have already been in a negative state of mind for a while and this could have been a last drop rather than the entire situation.\n\nIn any way, you're asking the wrong persons here. The only thing to be found on reddit is validation, and you've already gotten plenty. Had your player came and asked about their side, they would have ALSO gotten a ton of validation. However you won't find any solution or understanding talking to us Internet strangers. Talk to your player honestly like an adult. If that's not an option, what are you doing playing with manchildren?\n\nThe only potential other person's to ask if you REALLY don't want to talk it out are the other members of your table who are more likely to know things you don't about the current situation.",
            "If you want your familiar to be safe, din't send your familiar alone to dangerous places, that's it.\n\nThe lack a familiar will be bad for the Witch, yes, but they are still a full caster, the familiar effect after casting hexes is the only loss (a relevant one, but not a \"I can't do anything\" one).",
            "Note that familiars are not \"battle buddies\" and have no attacks. They can give some minor assistance to their master, depending on what familiar powers they've chosen.\n\nAlso, witches are prepared spellcasters, so they can't change their spells before their next daily preparations anyway, at which time their familiar also mystically returns to them.\n\nLosing their familiar doesn't really change anything significant for a witch. A few powers they can't use until the next day. Sure, it's annoying, but not game-changing.\n\nHow to talk to this player? Just be reassuring, supportive and patiently explain that it's only a temporary setback."
        ]
    }
}