{
    "Quick Questions (2024)": {
        "title": "Quick Questions (2024)",
        "score": 5,
        "url": "https://www.reddit.com/r/Pathfinder_RPG/comments/1dqamvn/quick_questions_2024/",
        "content": "Remember to tag which edition you're talking about with \\[1E\\] or \\[2E\\]!\n\nIf you are a new player looking for advice and resources, we recommend perusing [this post](https://www.reddit.com/r/Pathfinder_RPG/comments/10ceag1/resources_for_new_pathfinder_players_both/) from January 2023.\n\nCheck out all the weekly threads!\n\nMonday: [Tell Us About Your Game](https://www.reddit.com/r/Pathfinder_RPG/search?q=flair%3ATell%2BUs%2BAbout%2BYour%2BGame+title%3A%22Tell+Us+About+Your+Game%22&restrict_sr=on&sort=new&t=all)\n\nFriday: [Quick Questions](https://www.reddit.com/r/Pathfinder_RPG/search?q=flair%3AQuick%2BQuestions+title%3A%22Quick+Questions%22&restrict_sr=on&sort=new&t=all)   \n\nSaturday: [Request A Build](https://www.reddit.com/r/Pathfinder_RPG/search?q=flair%3ARequest%2BA%2BBuild+title%3A%22Request+A+Build%22&restrict_sr=on&sort=new&t=all)   \n\nSunday: [Post Your Build](https://www.reddit.com/r/Pathfinder_RPG/search?q=flair%3APost%2BYour%2BBuild+title%3A%22Post+Your+Build%22&restrict_sr=on&sort=new&t=all)",
        "num_comments": 6,
        "comments": [
            "[1E] What action is required to activate a smoke pellet? I generally assume standard, with the hand holding the pellet.\n\n[2E] Does the misfire chance for firearms interact with time magic? Curse Of Lost Time, for instance?",
            "(1e) What are some ways to optimize the use of the Lantern Staff?",
            "[1e] \"You may throw a smoke pellet as a ranged touch attack with a range increment of 10 feet.\" So either part of a standard attack or a full attack action and not its own action per se. Raw you can not use it any other way.",
            "1. Unclear; \"acts as smokestick\" which requires igniting, which is generally going to be a standard action unless for example you're currently on fire or holding a torch in your other hand or something. Smoke pellet activates via the fragile seal between two chemicals being broken; if it's in hand, personally I'd let someone activate it as a free action (drop item).",
            "Mostly, using it as a quarterstaff. So Staff Magus and/or building around the Quarterstaff Master feat.",
            "RAW, you MAY throw it doesn't mean you MUST throw it."
        ]
    },
    "Post Your Build (2024)": {
        "title": "Post Your Build (2024)",
        "score": 1,
        "url": "https://www.reddit.com/r/Pathfinder_RPG/comments/1dr2iv5/post_your_build_2024/",
        "content": "Remember to tag which edition you're talking about with \\[1E\\] or \\[2E\\]!\n\nCheck out all the weekly threads!\n\nMonday: [Tell Us About Your Game](https://www.reddit.com/r/Pathfinder_RPG/search?q=flair%3ATell%2BUs%2BAbout%2BYour%2BGame+title%3A%22Tell+Us+About+Your+Game%22&restrict_sr=on&sort=new&t=all)\n\nFriday: [Quick Questions](https://www.reddit.com/r/Pathfinder_RPG/search?q=flair%3AQuick%2BQuestions+title%3A%22Quick+Questions%22&restrict_sr=on&sort=new&t=all)   \n\nSaturday: [Request A Build](https://www.reddit.com/r/Pathfinder_RPG/search?q=flair%3ARequest%2BA%2BBuild+title%3A%22Request+A+Build%22&restrict_sr=on&sort=new&t=all)   \n\nSunday: [Post Your Build](https://www.reddit.com/r/Pathfinder_RPG/search?q=flair%3APost%2BYour%2BBuild+title%3A%22Post+Your+Build%22&restrict_sr=on&sort=new&t=all)",
        "num_comments": 1,
        "comments": [
            "\\[1E\\]\n\nHalf-orc  \ncity-raised, sacred tattoo\n\nMagus  \nhexcrafter\n\n20pt buy: Str 17, Dex 14, Con 14, Int 14, Wis 10, Cha 84th +1 str, 8th-20th +Int\n\nMagical lineage (frostbite), bruising intellect, (optional) take a drawback to get fate's favored\n\nFeats:   \n1st arcane strike   \n3rd rime spell   \n5th weapon focus (whip), whip mastery   \n7th enforcer   \n9th improved whip mastery\n\nUse a regular weapon for the first few levels then transition to a whip so you can apply shaken, fatigued, and entangled all at once via spellstrike rime frostbite. That's -2 str, -6 dex, -4 on attacks, -2 to skills, saves, and ability checks, moves half speed, can't run or charge, and must make concentration checks to cast.\n\nSure, shocking grasp might do more burst damage, but frostbite gives us more longevity and overall damage per spell slot. Wand wielder could be a fun arcana for 3rd if you can find wands of true strike or ill omen. 6th I like swapping the arcana for the flight hex since at that level the fly speed is already online. 4th level hex could be anything you want. Slumber, fortune, and misfortune are all good."
        ]
    },
    "Daily Spell Discussion for Jun 29, 2024: Divine Vessel": {
        "title": "Daily Spell Discussion for Jun 29, 2024: Divine Vessel",
        "score": 3,
        "url": "https://www.reddit.com/r/Pathfinder_RPG/comments/1drao3a/daily_spell_discussion_for_jun_29_2024_divine/",
        "content": "Today's spell is [Divine Vessel](http://aonprd.com/SpellDisplay.aspx?ItemName=Divine%20Vessel)!\n\nWhat items or class features synergize well with this spell?\n\nHave you ever used this spell? If so, how did it go?\n\nWhy is this spell good/bad?\n\nWhat are some creative uses for this spell?\n\nWhat's the cheesiest thing you can do with this spell?\n\nIf you were to modify this spell, how would you do it?\n\nDoes this spell seem like it was meant for PCs or NPCs?\n\n[Previous Spell Discussions](https://www.reddit.com/r/Pathfinder_RPG/search?q=%22daily+spell+discussion%22&restrict_sr=on&include_over_18=on&sort=new&t=all)",
        "num_comments": 5,
        "comments": [
            "This is pretty much the ultimate in 1/round level combat buffs for an oracle.\n\nYou get DR that's actually useful since you can pick the type rather than getting useless DR/Evil while fighting fiends.   \n\nThe energy resistance isn't a replacement for Resist Energy/Protection from Energy, but is great for all those creatures with a dice or two of energy damage as a rider on attacks and effects that deal minor damage when you hit a creature like a Balor's flaming body.   \n\nFiendish is generally the best with the strength bonus, decently common resistances (most importantly fire, probably the most common as far as extra damage on attacks goes).\n\nAnarchic has niche use in blindsense and giving a bite, the only natural attack you'd actually use (the others use your hands, which are busy holding your weapon)",
            ">Righteous Might was already giving you DR 10/(holy or evil)\n\nI just want to point out that the DR is actually a huge upgrade, because Righteus Might always gave a good caster DR/Evil which all those fiends you fight at mid-high levels will automatically bypass, as will any humanoid enemy wielding the ever popular Unholy weapon enchantment. Here you can have your Good Oracle grab that fiendish for for DR/Good, which is basically only going to be beaten by +5 weapons, because you don't fight Celestials.\n\nIt helps that Fiendish is also where you get a strength boost, so generally the best pick.\n\nOh and this gives your +3 natural armour, not an enhancement bonus to natural armour, meaning that unlike Righteous Might it's not thoroughly outclassed by your Amulet of Natural Armoru or a casting of Barkskin",
            "There's actually a way to Quicken it without having to spend 170k gp on a rod - a [Quickening Diamond](https://www.d20pfsrd.com/magic-items/wondrous-items/e-g/gem-metamagic/) . Granted, dropping 8k gp (half if crafted) to quicken a spell isn't something you want to do often, but keeping one around for a boss fight or an emergency should be plenty worth it at that level.",
            "In a fairly rare move, this spell is a true single-class exclusive, and on oracle, the class that normally shares its spell list.  (You can really feel the push Paizo was making to get oracle stronger than cleric...)  Complimenting how oracle mysteries generally make oracles better in the gish role than clerics while their spontaneous casting tends to make them less versatile in the dedicated caster role, this exclusive spell is essentially the \"ultimate warform\" of the oracle class, even if this doesn't quite stack up to the nonsense of the druid or brown fur transmuter using [Shapechange](https://aonprd.com/SpellDisplay.aspx?ItemName=Shapechange) or how the [Legendary Proportions](https://aonprd.com/SpellDisplay.aspx?ItemName=Legendary%20Proportions) they got a couple levels ago is easier to use as a min/level spell.  It's also a spell that doesn't merge equipment, but does grant natural attacks, oddly enough.  While divine casters generally suffer from having to actually cast rounds/level spells generally mid-battle (and thus give up their first round), making these much less powerful than even similarly-powered (polymorph) spells you can hypothetically pre-battle cast, this spell tries to dump enough extra bonuses on the table to drown out the complaints.  It's a real pity the warpriest can't get in on this, but I guess they have to make do with Righteous Might as their \"ultimate transformation\" as a swift.\n\nPut simply, this spell is an upgraded version of [Righteous Might](https://aonprd.com/SpellDisplay.aspx?ItemName=Righteous%20Might) ([discussion](https://www.reddit.com/r/Pathfinder_RPG/comments/mjvstx/daily_spell_discussion_for_apr_04_2021_righteous/)), which is decent but weighed down by that rounds/level duration, and competes for the action spent casting in the first round of combat with \"divine Haste-likes\" [Blessing of Fervor](https://aonprd.com/SpellDisplay.aspx?ItemName=Blessing%20of%20Fervor) or [Divine Power](https://aonprd.com/SpellDisplay.aspx?ItemName=Divine%20Power) (for the more \"selfish\" types) that will almost certainly be more important.  Speaking of using spells together, note that by the time you can cast Divine Vessel as an SL 8, you can also cast quickened Blessing of Fervor or Divine Power on the same round, and I'd strongly recommend it because you're clearly going to want to full attack after the first round if you need that move action to get into melee range.  Further, as with Righteous Might, note that this spell is a transmutation and changes size, but not a (polymorph), and thus can stack with polymorphs that do not have any clause about changing size, although there aren't many of those.  This does mean you can combine it with (possibly quickened at level 18+) [Geniekind](https://aonprd.com/SpellDisplay.aspx?ItemName=Geniekind) ([discussion](https://www.reddit.com/r/Pathfinder_RPG/comments/16bjogy/daily_spell_discussion_for_sep_06_2023_geniekind/)), however, if you're really keen on stacking effects. (Note that Divine Vessel, Blessing of Fervor, Divine Power, and Geniekind's bonuses are all of different types or untyped except for the extra attack from Blessing of Fervor and Divine Power, so they do stack.  If you're good aligned however, [Eaglesoul](https://aonprd.com/SpellDisplay.aspx?ItemName=Eaglesoul) ([discussion](https://www.reddit.com/r/Pathfinder_RPG/comments/1cvnqjh/daily_spell_discussion_for_may_19_2024_eaglesoul/)) stacks too, and is probably a better use of that swift action on the second round of combat (or free action if you full attack a demon).  It doesn't require waiting for level 18, either.)\n\nAs for what this spell does, *specifically*, +6 size to Str and Con are obviously great for Str melee brawlers, and +2 better than Righteous Might, while not giving the -2 Dex that Righteous Might does.  The various aligned versions of the spell give another +2 somewhere on top of this.  (If put to Str, it makes +8 Str, equal to SL 8 arcane polymorphs.) Divine Vessel gives +3 to natural armor instead of +2 from Righteous Might.  By level 15, Righteous Might was already giving you DR 10/(holy or evil), but now you get to pick the alignment that pierces the DR.  As normal for a size increase, your weapon damage dice and reach increase but you take a -1 to attacks and AC.  Like Enlarge Person and Righteous Might, projectiles \"shrink back\" upon being launched or thrown, so this spell is of less value to ranged combatants (but oracles are often bad at that, anyway).\n\nAnd I, too, have become a vessel... a vessel for pouring out text to fill a resopnse to this post...",
            "On top of upgrades to what Righteous Might gave, you also add on 60' darkvision, SR 12+CL (equivalent to the spell [Spell Resistance](https://aonprd.com/SpellDisplay.aspx?ItemName=Spell%20Resistance) ([discussion](https://www.reddit.com/r/Pathfinder_RPG/comments/hjwk68/daily_spell_discussion_for_jul_02_2020_spell/)), the main argument against which is taking the round to stop and cast it), +4 to saves vs. poison, and 60 foot fly (good).  (This is listed individually in each of the alignment variants exactly the same way for some odd reason depsite normally wanting to save ink and page space.)  On top of this, there is energy resistance 10 to three different elements (including sonic), which isn't great (Resist Energy has given 30 for a long time by now), but covering all the bases a little can help, and if you know what alignment you want to call upon later, you can put down a Resist energy on one of the \"missing\" element(s) to get at least some resistance on everything.\n\nAmusingly, in spite of this being a spell that has a breakdown for all four alignment directions, unlike clerics, oracles have no restriction in what kind of alignment spell they can cast.  This means that a lawful good oracle whose power was granted by a lawful evil deity who is fighting demons can cast this spell in its anarchic form to gain DR 10/lawful that the demons can't do anything about.  (You'd think there might be side-effects for being filled to bursting with raw entropic energy, but nope!)  Creatures with a subtype like many outsiders such as demons having \\[chaotic\\] and \\[evil\\] can pierce DR/chaotic or evil, but otherwise, +5 or anarchic/chaotic weapons are pretty rare compared to holy or evil weapons, so there's an inherent value in those.  Also, since you're *probably* strength-based, the extra (seemingly untyped) +2 strength from axiomatic and fiendish are tempting, although since you probably can't use the claws or slams (unless your GM thinks you grow new limbs to make those attacks - you'd think celestials would at least get wing attacks,) the bite from anarchic might make it the most useful, depending on if extra damage and accuracy to your existing attacks is more valuable than an extra attack outright.  (Remember that secondary natural attacks use half the strength bonus and have a -5 to attack.)  Blindsight 30' from anarchic is also potentially valuable for knowing when to break out the Invisibility Purge, and hypothetically, see in darkness from fiendish can be used with a Deeper Darkness to blind non-devils (who also have see in darkness), although this is less often effective at this level.  Low-light vision by this level, however, seems pretty trivial, and can be easily gained with lower-level spells.  All-around, celestial just seems the lamest - maybe to make up for how much Eaglesoul was an advantage to \\[good\\]?\n\nAll told, this is a pretty persuasive package for any oracle that can't get into melee this round to be able to cast to at least do more damage next round or mitigate most attacks to live that extra round longer - DR, energy resistance, and SR can generally provide defense against many things the enemies can throw, and nearly everything a PC can throw - until they get into melee.  (The writer must've distracted the editor that forces all multi-function spells to be garbage with something really shiny...)  Really, it's only downsides are its extremely high level that means most games will never get to it, and that you probably need to spend a standard action to cast it (especially if you're reserving your swift action for that quickened Blessing of Fervor.)  The former means that you couldn't really build around having this spell (although if you're taking this spell, you probably took Righteous Might and built for that, and just trade in Righteous Might at level 16 when you pick up divine vessel.) The latter means you might be arriving in melee a round late at a level where a *lot* can happen in a round.  Even a full caster type of oracle might consider casting this spell for the powerful benefits like SR, but the action will probably be an even bigger price for them to pay.  With that said, if you can cast this before combat starts (with rounds/level meaning nearly 2 minutes at this level,) it's absolutely a powerful advantage even for a \"sit back and cast\" oracle to get 48+ extra HP, SR 28+, flight, and some customizable damage/energy resistances all in one package.  GMs, consider this on a humanoid BBEG (even if it has to be a scroll because they're not an oracle) - PCs often have +5 weapons, but otherwise, it adds a lot to a BBEG that's going to wade into melee while still making them recognizably the villain (just glowing with raw aligned power).  Just be sure the BBEG casts from behind total cover while the minions distract the PCs so the BBEG can't get ganked during the turn they're casting this."
        ]
    },
    "In modern times is there any importance to the scions of any of the legendary historic characters like Aroden or Tar-Baphon or those who passed the Test of the Starstone?": {
        "title": "In modern times is there any importance to the scions of any of the legendary historic characters like Aroden or Tar-Baphon or those who passed the Test of the Starstone?",
        "score": 9,
        "url": "https://www.reddit.com/r/Pathfinder_RPG/comments/1dr26rh/in_modern_times_is_there_any_importance_to_the/",
        "content": "The most notorious families I seem to see now are the Thrunes and the Vancaskerkins (love 'em both). But even beyond Tar-Baphon and Aroden, Nex and Geb seemed to have long lives and lived in luxury that would allow them to father many children whose descendants may still be kicking around. And while obviously Norgorber left no trace of his previous life, Cayden seemed to get around like the adventurers he is the patron of, is there any mention of his offspring getting together and organizing? Even monsters like Kazavon might have left a bloodline behind.\n\n  \nIs there any mention of any of these people in the lore?",
        "num_comments": 7,
        "comments": [
            "No, not that I'm aware of. Cayden MIGHT be the father of Kurgess with Desna, but that's just a rumor.",
            "Pathfinder's gods don't tend to have a lot of kids. There's a silver dragon who's rumored to be Iomedae's kid with IIRC Apsu, and Kurgess is supposedly Desna's kid.",
            "Tar-Baphon's descendants are a minor plot point in Carrion Crown. the villain steals some family secrets and is disappointed that none of the family are competent spellcasters.",
            "Besides mortal godlings that gods are said to have on occasion, there is also old lore that states that Cayden Cailean's church frequently runs orphanages. The orphans who don't get adopted by the time they're adults will often take the last name Cailean, representing the people who raised them. Obviously, these aren't actually his children (probably), but they consider themselves to be.",
            "Pharasma has many daughters, only one named. The rest are only mentioned that few know of them.  But her youngest daughter Atropos is rumored to be the one who will succeed pharasma in the next universe cycle.  And is also basically second in command in the boneyard.  Also she totally could be Aroden daughter \n\nAlso there is zon-kuthon and Shaylin twin children of a god and a spirit beast, who rise up from demigod hood when their father died.  And then zon-kuthon ran off and gained his old personality/memories from the previous universes.  He had a different name before that.",
            "I wasn't exactly counting Pharasma: if you believe *Concordance of Rivals* the entire universe is her kid.",
            "Baba Yaga"
        ]
    },
    "Tempered champion: that's cool!": {
        "title": "Tempered champion: that's cool!",
        "score": 0,
        "url": "https://www.d20pfsrd.com/classes/core-classes/paladin/archetypes/paizo-paladin-archetypes/temple-champion-paladin-archetype/",
        "content": "I recently came across this archetype for pallies.\n\nIt gives up spellcasting in exchange for fighter-only bonus feats. Moreover, it makes your weapon have the base damage of warpriest's sacred weapon. Cherry on top, you can expend one LoH to activate divine bond weapon.\n\nPersonally I love the fighter, and am fairly convinced that this archetype is close to a straight-up upgrade of base pally if you need damage. Bigger numbers thanks to feats make up for the loss of divine favor or prayer.\n\nWith the playstyle that I have, I would combine this with Oath of Vengeance: giving up Channel Energy in exchange for virtually unlimited extra smite evil makes this a damaging machine like probably no other pally. Essentially, you can expend two LoH to smite instead of channeling.\n\nIt is fairly clear that Extra Lay on Hands would be a mandatory feat for such a build. You want as many LoH as possible to fuel your smite and divine bond usages, as well as your healing abilities (remember you don't have channel and spells).\n\nAnother huge draw of fighter bonus feats is that you can take a lot more feats that have those feats as prerequisites (Deadly Stroke is a clear example of this)\n\nThe build that I've thought about is an intimidation build. You need to pick a trait to make intimidate a class skill, and you're good to go.\n\nHere's what it came to my mind.\n\n1) Power Atk\n2) nothing\n3) Weapon Focus (better if your weapon has 18-20)\n4) BONUS: weapon specialization\n5) Dazzling Display (even without Intimidating Prowess, your CHA should be high enough to make up for this all)\n6) nothing\n7) Shatter Defenses\n8) BONUS: greater weapon focus (this is important)\n9) improved critical \n10) nothing\n11) deadly stroke\n12) BONUS: personally I like greater weapon Specialization, but penetrating strike is reasonable, in order to take greater at 16 level\n\nFrom 13th level, you can do whatever you want. I would pick Extra LoH and greater Mercy. But if you want to go all-in and take Intimidating Prowess and stuff like cornugon smash, go for it. To my liking, it is sub-optimal. But I would still keep an eye to signature skill intimidate.\n\nHOW THE BUILD WORKS: big numbers. That is all.\n\nDeadly stroke with warpriest weapon dice and smite evil is just brutal. Not to mention you can enchant your weapon further with divine bond. Weapon specialization and greater weapon Specialization are the cherry on top. Keep in mind that you are still a paladin: you can heal with LoH and have absurd saving throws, while your enemies will need to deal with at least the shaken condition. -2 to everything (especially saves) and a bit of croud control are very nice, especially if you don't have a bard or a witch. Your spellcasters will thank you.",
        "num_comments": 1,
        "comments": [
            "Yes. It's good for a bonking build if you're willing to sacrifice tons of utility and versatility. That's not a good or bad thing per se, but I personally am not fond of losing options and tools for passive numbers. Not once will or have I ever picked a Feat like Weapon Specialization and I despise whenever am forced to take Weapon/Shield Focus for feat prereqs.\n\nBut if you do like, you do you."
        ]
    }
}