{
    "Tips & Tricks Thursdays - PAYDAY Community Discussion Thread": {
        "title": "Tips & Tricks Thursdays - PAYDAY Community Discussion Thread",
        "score": 8,
        "url": "https://www.reddit.com/r/paydaytheheist/comments/1dpi6fn/tips_tricks_thursdays_payday_community_discussion/",
        "content": "Hey /r/paydaytheheist! \n\nEvery Thursday, we will be making a recurring thread every week where members of the community can come together and ask/answer questions pertaining to the game; mechanics, lore, tricks, tips, guides and achievements, etc... all consolidated into one thread!\n\nRather than making individual posts and cluttering the subreddit with questions that may have been answered in the past, this should make it easier for everyone to discuss the game if anyone has any questions.\n\n&#x200B;\n\nThis thread will be posted every Thursday at 12:00 AM EDT.\n\nAsk away!",
        "num_comments": 9,
        "comments": [
            "Any tips for playing smg on overkill? They deal sooooo little damage. [PD3]",
            "Any good builds for PD3 to do Overkill solo? I always find myself going down and running thru resources too early and always fail. Any advice?",
            "(PD2) Framing Frame Day 3. I spent like 30 hours looking for the phone in stealth, even checked some guides, it literally not spawned anywhere. On restart, spent lots of time looking for last hard drive. I know spawn locations more or less. Can devices be bugged and not spawn, or am I just blind?",
            "IS there any known workarounds for stuff not unlocking?\n\nThe adaptive armour and shock grenade are locked for me despite being well above the level needed.",
            "Rlly depends on the SMG you use, but ftmp just hit headshots.  \nWhat SMG are you using?",
            "FIK PC9 , signature to be clear. Problem is I am having a hard time killing even with headshots.",
            "I haven't tried this on overkill, but I use gunslinger for SMGs on lower difficulties to guarantee a stagger with each shot. It lets me deal with groups by quickly staggering everyone before focusing down kills. It's kind of fun. Not sure how effective though.",
            "did you know that the boys are in blue today \nstay subscribed for more tips and tricks",
            "iirc they removed the challenges that were supposed to unlock them.\n\nI had to contact a SBZ staff (sbz_rafi) on Discord to get the Shock Grenade on my account.",
            "SMGS are probably the worse guns you can use on OVK, you need to hit your mark precisely to do any sort of meaningful damage.\n\nYou could try investing in some edge skills though, such as enforcer and sharpshooter.  \nThey recently removed cutting edge's increased armor penetration stat in trade for being able to pierce +1 enemy, which is almost useless unless you're using an AR or sniper, so that pretty much just lowered the amount of choices you have on OVK."
        ]
    },
    "Do you vote to restart when the slightest inconvenience happens? Well, do I have a mode JUST for YOU!": {
        "title": "Do you vote to restart when the slightest inconvenience happens? Well, do I have a mode JUST for YOU!",
        "score": 47,
        "url": "https://i.redd.it/at5mat8hai9d1.png",
        "content": "",
        "num_comments": 8,
        "comments": [
            "I completely agree. Id rather everyone just continue the heist loud so we can get paid and move on to the next heist😭",
            "\"Finally a mode where I can just let the mistakes ride out rather than having to restart the map every time my teammates screw up\" - someone, somewhere, probably",
            "Finally a mode I can play without dealing with jerkoffs who refuse to play the game beyond sneaking. All the effort in the world of making a nice smooth working transition from quiet to loud gone to waste otherwise.",
            "If you don't like to restart you can also now just play Solo.😎",
            "I had this kind of spawning for half a year, if not longer",
            "Sit in a corner, wait it out, hide in a bathroom and take afew pot-shots. I'm fine with that.\n\n  \nJust don't vote to restart, execute civis and cuss people out because you blew stealth 80% way through a heist with 4 plate armor, unsilenced primary and secondary weapons, the whole shebang.\n\n  \nIf you want to learn a heist in stealth, you have Solo mode!\n\nIf you want people to carry you through a heist, you don't have to vote to restart! Let them do their thing and help where you can! Going loud IS possible. It can also be fun!",
            "The current glaring issue with solo beside favors is spawn rates in loud. \n\nTTS overkill loud is probably my lost played mission. I know how many cops have spawned on me on this map since launch. What I saw the past 2 days were Jules levels of cops spawning on top of each other and literally flooding the hallways. \n\nThis had nothing to do with the topic, I just wanted to say it's good for solo stealth, even though the lack of favors makes art gallery stealth very tedious, but loud is currently broken.",
            "For some reason a lot of people seem to prefer stealthing a heist, even with transition improvements added to this game (compared to PD2). I hope it can be resolve with servers browser/lobby types"
        ]
    },
    "Which guns do you want to come back from the past games? These are mine:": {
        "title": "Which guns do you want to come back from the past games? These are mine:",
        "score": 51,
        "url": "https://www.reddit.com/gallery/1dr60jk",
        "content": "",
        "num_comments": 32,
        "comments": [
            "STUPID ass idea but what if the ovk saw was an ovk weapon? or maybe an equipment item or smth, i dunno. i want the saw back :(",
            "I just want laser sights, man.",
            "Brenner 21 as an overkill LMG, it'll be more realistic than a minigun at least",
            "The mg42 or mg3 is either a standard weapon or a Overkill weapon but either way, who wouldn't want 100 rounds of BBRRRRRRRTTTTTTTTTT",
            "Locomotive. Maybe GL40 but i already know theres that one grenade launcher and it might be redundant",
            "M4 Shotty, Gecko 7.62 and probably the Stryk 18C",
            "How the bloody hell is the AK5/FN FNC not in the game when this is THE Heat simulator?",
            "clarion, akimbo anything, grimm, secondary grenade launchers and shotguns",
            "SPAS & M1014, the G18, the Vector, the MP9, the Beretta 92.. lot of the old standbys that we just don't have yet",
            "Lemme get my Grimms back."
        ]
    },
    "This feels somehow more menacing than a regular dozer..": {
        "title": "This feels somehow more menacing than a regular dozer..",
        "score": 71,
        "url": "https://www.reddit.com/gallery/1dr443z",
        "content": "",
        "num_comments": 5,
        "comments": [
            "When the dozer left his gun at home but didn't want to piss off his mom by telling her on the way to the heist",
            "Holy shit it the boy in blue.",
            "Dozer walking up to you in the gmod walk cycle feels threatening",
            "\"i wish i was at home playing video games\"",
            "chill ass dozer isn't real, he can't chill you\n\n  \nchill ass dozer:"
        ]
    },
    "Comparison of heisters faces from PAYDAY 2 and PAYDAY 3.": {
        "title": "Comparison of heisters faces from PAYDAY 2 and PAYDAY 3.",
        "score": 260,
        "url": "https://i.redd.it/zno3phcsyd9d1.jpeg",
        "content": "",
        "num_comments": 62,
        "comments": [
            "Whats up with clovers payday 2 face? Has it always been like that?",
            "Still prefer payday 2’s hoxton tbh. Hox and Houston are gonna look pretty damn similar in 3 if Houston isn’t changed\n\nAlso clover looks a bit fucked in 3 for some reason",
            "I wish Wolf’s beard was more well groomed and his head was shaven. I liked the Heisenberg-ish look he used to have.",
            "The only one who actually had a glowup imo was joy",
            "I unironically like the Payday 3 faces but I appreciate that Payday 2's are based off of real people.",
            "Wait can someone compare payday 3 clover to payday 2 Hila? \n\nI think they might look similar",
            "I'll be honest despite them being on an abomination of a terrible engine payday 2s faces look better than 3s imo",
            "I don't think you could've chosen a less flattering photo for PD3 Joy lol\n\nImo, all of them barring Hoxton and maybe Wolf look better in 3",
            "who's getting the best head?",
            "Payday 3 wolf, joy and chains look better Imo, but the rest is quite the opposite. I'll never forgive them for not making dallas as my pookie Eric etebari"
        ]
    }
}