{
    "SHOW US YER TATS!! [TATTOO SUBMISSION INFO HERE]": {
        "title": "SHOW US YER TATS!! [TATTOO SUBMISSION INFO HERE]",
        "score": 194,
        "url": "https://www.reddit.com/r/PaymoneyWubby/comments/1dpefdf/show_us_yer_tats_tattoo_submission_info_here/",
        "content": "#Chat's Tats. What more needs to be said?!\n\nDo you have a tattoo? SHOW US!\n\nDo you have a sleeve? SUBMIT IT!\n\nDo you have something bad and funny? LET US SEE IT!\n\nDo you have a unique piece you want to show off? PUT IT HERE!\n\n----\n\nWe will be compiling chat's tattoos into a stream segment, so if you're interested **READ EVERYTHING BELOW**!\n\n-------\n\n\n###RULES:\n\n*  Submit all photos **as an album** on https://imgur.com/ \n*  Please keep form answers *brief*. If you have more to explain or say about individual photos, please add  those as descriptions in the imgur album!\n* All photos must abide by Twitch's TOS to be shown on stream!\n* **Must include a selfie to match with your cute faces!**\n\n-----\n##REMINDER:\nALL PHOTOS SUBMITTED HERE MAY BE USED FOR STREAMING CONTENT OR FUTURE YOUTUBE VIDEOS.\n\n-----\n\n#####Once you have read everything above, please follow this link to submit to the form! https://forms.gle/UG29WhbCHiTC62vU9",
        "num_comments": 119,
        "comments": [
            "Hey y'all. Like every game we've done here, if you are posting your submissions here in the comments or as a solo post on the subreddit, they won't be selected for the content. We are looking for stuff to show on stream that will be new. If you post it here, the reaction will be \"oh yeah, we saw this already\".\n\n---\n**Q&A time:**\n> Can we post vids or photos only?\n\nvids are okay as long as it is short and to the point. if you take a 30 minute video explaining everything, we don't have time for that. If its a nice 5 second spin around of your sleeve? sick, lets see it :) \n\nwhatever will make your tattoo look best!\n\n>When do submissions close?  \n\nASAP. [Friday 12:01am] lets say. We already have over 150 people that submitted, the sooner the better. :)\n\n> Can we show more than 1 tattoo?\n\nyes, please.",
            "I think I win for most relevant and regretful tattoo 😂😂\nhttps://imgur.com/a/R7uGSh3",
            "When do submissions close?",
            "Hey Booty, what’s the deadline?",
            "First time ever submitting something 🤡 so excited for this segment!",
            "![gif](giphy|IQh6f7CurN1zq)",
            "Been waiting for this post since it was first brought up on stream a while back.",
            "Can we post vids or photos only? I have one that I got covered but it was ASS (an ex friend tatted me in their living room while very high) but I only have videos that you can see it in and screenshots of the video are blurry asf",
            "Submitted! I only have a couple but plan on getting more soon",
            "Submitted and can't wait!! ♡♡\n\nhttps://imgur.com/gallery/HWsr7x3"
        ]
    },
    "I have actually wondered what a \"all graded\" game of pokemon or magic would look like. Jesus christ. ": {
        "title": "I have actually wondered what a \"all graded\" game of pokemon or magic would look like. Jesus christ. ",
        "score": 427,
        "url": "https://i.redd.it/6qmerzo3ne9d1.png",
        "content": "",
        "num_comments": 20,
        "comments": [
            "what video is this?",
            "Mr. President a second d20 has hit the card towers.",
            "Oh shit, Arin Hanson, our boy is growing up so fast. Nice wubby, proud of you",
            "I'm  gonna pre",
            "bro I  never thought voxy would end up playing commander with wubby",
            "I cannot wait for the 9.11 jokes next media share due to this.",
            "Wubby their has been a second thopter",
            "Never forget",
            "POV: You’re in a plane cockpit on September 11, 2001",
            "It looks a lot like 9/11.  A card game you will surely...\n\n![gif](giphy|QWqFRxIxUSfiFdg26r)"
        ]
    },
    "I hope he enjoyed it": {
        "title": "I hope he enjoyed it",
        "score": 308,
        "url": "https://i.redd.it/hnbwq9nvue9d1.png",
        "content": "",
        "num_comments": 11,
        "comments": [
            "I don't believe you.",
            "I don't believe you.",
            "I don't believe you",
            "I don't believe you",
            "I don't believe you.",
            "I don’t believe you.",
            "I don't believe you.",
            "I don't believe you",
            "I dont believe you",
            "Nah, Keabz would NEVER."
        ]
    },
    "Not telling you to pick a side, just a video worth watching if you are clueless.": {
        "title": "Not telling you to pick a side, just a video worth watching if you are clueless.",
        "score": 149,
        "url": "https://www.youtube.com/watch?v=gYwqpx6lp_s&t=2s",
        "content": "",
        "num_comments": 102,
        "comments": [
            "Yeah, Project 2025 is actually terrifying.",
            "I'm far more afraid of the current state of the Republican Party, which Trump will enable, than necessarily Trump himself. And I am also more worried that any voter who hasn't made up their mind already won't see that distinction, and will see how horribly Biden did at portraying competence, and vote for Trump as a \"better of two old-guys\"\n\nBut also\n\nNo shot that any discussion here will be helpful and/or affect Wubby's views at all. He doesn't seem like someone swayed purely on appearances, and he isn't trying to sway his audience, so I don't think any of us should care at all",
            "I mean, even if we put politics aside Trump is the kind of dude who no one here would hang out with. He's the loud mouthed, braggart who lies constantly. Who has legit personality disorders. He's a failure, a loser and a criminally liable *rapist*. He raped a woman. AT LEAST one woman. Let's be real. \n\nThen he talked about fucking his daughter, he bragged about leering at teenage beauty queen contestants when they were getting dressed and hung out with *fucking Epstein*. He wants power and he wants to use that power to get retribution on his enemies and he loves bullies and assholes and has no qualms about being overtly racist and punching down. \n\nI mean, back before the whole President thing he called for the execution of the Central Park 5 when 5 black teens were *accused* of raping a woman. Then when it was found they were innocent HE STILL CALLED FOR THEIR EXECUTION! \n\nRemember when he called John McCain a loser for being a POW during the Vietnam war? \n\nLike, my fucking god. At every single turn, he is the worst person you would avoid at all costs.",
            "Project 2025 is a plan set made by Republican party members to take effect if Trump is elected again, they will immediately take all federal law enforcement agencies and make them report directly to the president and have to do anything the president wants to, the president could have them investigate anyone anywhere for any reason with the threat to produce results or be fired; political rivals he has already assured vengeance, judges, lawyers, someone who tweeted something mean, anyone. They will allow the president to circumvent Congress and the Senate to pass whatever he wants. There is so much more like the EPA would be directly responding to him, he could weaponize the weather, and it genuinely would be the end of the US as we know it. \n\nNot to mention Trump also said he talked to Putin about the invasion of Ukraine, and supported him in the endeavor because it was \"his dream\". His best friends are Putin, Xi, and Kim, the 3 biggest rivals of the US, he wants us to pull out of NATO and turn our backs on our oldest and strongest allies. He burned a huge number of US spies when he talked to Putin. Not to mention the insurrection, 34 felonies, hundreds of millions in judgements against him, his best friend Epstein who mysteriously died in jail, half his staff from his tenure as president being convicted of all kinds of illegal shit.\n\nJoe Biden has been a decent president, he's just a creepy old dude who should be retired but sadly is the best chance there is to beat Trump. He has by all accounts been a decent president, but like any has had his issues. He has solutions to problems, the biggest being a tax on the rich to solve a lot of issues. Lina Khan the current head of the FTC, is doing work and is basically our last hope of anyone bringing back a competitive economy so we are not facing the current situation of almost the entire economy being driven by 7 companies. She is likely the only chance we have to fix the economy for future generations.",
            "As someone who used to work in politics (on the Hill, both of Bernie's campaigns, the progressive policy team for Biden after Bernie dropped out, etc.), I appreciate you posting this. Trump is such a danger to the future of this country. The tragedy of the United States is that we have always had and still have such great potential that we need to stop Trump. If Trump gets a second term, we'll never reach that potential. We'll be set so far back that it'll somehow make Reagan look like nothing. Please vote this November.",
            " \"There will be a massive exodus of competence\"",
            "Anyone else hear Trump possibly shit himself during the debate? (1:16:23) Not a motivated comment, I'm wondering if it was just me?",
            "I'm voting Dr Disrespect POTUS 2025",
            "Guys. Can we not? Politics have spread everywhere. It sucks. It’s depressing. It’s fucked. Can we not infest this place with that shit too? Go to the other thousand subreddits bitching about this. Rightfully so but not here ",
            "Agreed. Project 2025 is horrible. Supreme Court giving out decisions this week like a precursor to come."
        ]
    },
    "To that guy that recognized me at Panda Express": {
        "title": "To that guy that recognized me at Panda Express",
        "score": 187,
        "url": "https://www.reddit.com/r/PaymoneyWubby/comments/1dqyjy3/to_that_guy_that_recognized_me_at_panda_express/",
        "content": "sorry i wasnt too comfortable getting my picture taken but it was really funny that you recognized me wubby7",
        "num_comments": 10,
        "comments": [
            "I saw Keabz at a Panda Express in Los Angeles yesterday. I told him how cool it was to meet him in person, but I didn’t want to be a douche and bother him and ask him for photos or anything.\n\nHe said, “Oh, like you’re doing now?”\n\nI was taken aback, and all I could say was “Huh?” but he kept cutting me off and going “huh? huh? huh?” and closing his hand shut in front of my face. I walked away and continued with my shopping, and I heard him chuckle as I walked off. When I came to pay for my stuff up front I saw him trying to walk out the doors with like fifteen bowls of noodles in his hands without paying.\n\n\nThe girl at the counter was very nice about it and professional, and was like “Sir, you need to pay for those first.” At first he kept pretending to be tired and not hear her, but eventually turned back around and brought them to the counter.\n\n\nWhen she took one of the noodles and started scanning it multiple times, he stopped her and told her to scan them each individually “to prevent any electrical infetterence,” and then turned around and winked at me. I don’t even think that’s a word. After she scanned each bowl and put them in a bag and started to say the price, he kept interrupting her by yawning really loudly.",
            "ok, my autist mind immediately wondered what you ordered.",
            "If I ever encounter you at a Panda Express, I'll buy you cheese rangoons AND spring rolls. Fuck it, I'm high so I'll throw in the extra few bucks to upgrade you to that honey walnut shrimp, king.",
            "Be honest Keabz, you were just looking down on him. You saw he lacked that dawg in him. He wasn't worthy enough for the pic, it happens lol",
            "nice smile",
            "Same thing happened to me at a dry cleaner's in Huntington Park. Motherfucker pretended he didn't speak English.",
            "orange chicken, honey sesame chicken, and chow mein  \nshouldve grabbed a beef instead of another chicken but i ordered what i saw first we wanted to get out pretty quick there was ice cream in the car",
            "shoulda used Google's real time translator and that whole debacle couldve been avoided",
            "Yum. Panda Express goes so hard. My fav order is orange chicken and Beijing beef, with half fried rice, half chow mein, and loads of teriyaki sauce.",
            "nice! That is pretty much my order when I go there too. Damn, now I am hungry for panda express."
        ]
    }
}