{
    "SHOW US YER TATS!! [TATTOO SUBMISSION INFO HERE]": {
        "title": "SHOW US YER TATS!! [TATTOO SUBMISSION INFO HERE]",
        "score": 193,
        "url": "https://www.reddit.com/r/PaymoneyWubby/comments/1dpefdf/show_us_yer_tats_tattoo_submission_info_here/",
        "content": "#Chat's Tats. What more needs to be said?!\n\nDo you have a tattoo? SHOW US!\n\nDo you have a sleeve? SUBMIT IT!\n\nDo you have something bad and funny? LET US SEE IT!\n\nDo you have a unique piece you want to show off? PUT IT HERE!\n\n----\n\nWe will be compiling chat's tattoos into a stream segment, so if you're interested **READ EVERYTHING BELOW**!\n\n-------\n\n\n###RULES:\n\n*  Submit all photos **as an album** on https://imgur.com/ \n*  Please keep form answers *brief*. If you have more to explain or say about individual photos, please add  those as descriptions in the imgur album!\n* All photos must abide by Twitch's TOS to be shown on stream!\n* **Must include a selfie to match with your cute faces!**\n\n-----\n##REMINDER:\nALL PHOTOS SUBMITTED HERE MAY BE USED FOR STREAMING CONTENT OR FUTURE YOUTUBE VIDEOS.\n\n-----\n\n#####Once you have read everything above, please follow this link to submit to the form! https://forms.gle/UG29WhbCHiTC62vU9",
        "num_comments": 119,
        "comments": [
            "Hey Booty, what’s the deadline?",
            "First time ever submitting something 🤡 so excited for this segment!",
            "Been waiting for this post since it was first brought up on stream a while back.",
            "Can we post vids or photos only? I have one that I got covered but it was ASS (an ex friend tatted me in their living room while very high) but I only have videos that you can see it in and screenshots of the video are blurry asf",
            "Submitted! I only have a couple but plan on getting more soon",
            "Got my tattoos from when I was a child on here.",
            "Finally, the time has come. Hell yeah brother.",
            "Submitted! I hope I get on!",
            "submitted and excited to be dunked on! been waiting since he did this a few years ago (⊙ω⊙)",
            "Man, I got mine submitted and I'm afraid Wubby and Co. are going to rip my tattoos a new one. But hey that's what I open myself up to for putting myself on the chopping block. If you guys do bend me over, please use some lube. Even if it's just the Devil's Lube."
        ]
    },
    "I have actually wondered what a \"all graded\" game of pokemon or magic would look like. Jesus christ. ": {
        "title": "I have actually wondered what a \"all graded\" game of pokemon or magic would look like. Jesus christ. ",
        "score": 568,
        "url": "https://i.redd.it/6qmerzo3ne9d1.png",
        "content": "",
        "num_comments": 31,
        "comments": [
            "Oh shit, Arin Hanson, our boy is growing up so fast. Nice wubby, proud of you",
            "Mr. President a second d20 has hit the card towers.",
            "I cannot wait for the 9.11 jokes next media share due to this.",
            "bro I  never thought voxy would end up playing commander with wubby",
            "POV: You’re in a plane cockpit on September 11, 2001",
            "It looks a lot like 9/11.  A card game you will surely...\n\n![gif](giphy|QWqFRxIxUSfiFdg26r)",
            "Wubby their has been a second thopter",
            "Holy shit Wubby looks great!",
            "New MTG game mode, graded jenga",
            "That's fucking hilarious. What a legendary photo."
        ]
    },
    "I hope he enjoyed it": {
        "title": "I hope he enjoyed it",
        "score": 483,
        "url": "https://i.redd.it/hnbwq9nvue9d1.png",
        "content": "",
        "num_comments": 18,
        "comments": [
            "I don't believe you.",
            "I don't believe you.",
            "I don't believe you",
            "I don't believe you",
            "I don’t believe you.",
            "I don't believe you.",
            "I don't believe you.",
            "I don't believe you",
            "I dont believe you",
            "I don't believe you."
        ]
    },
    "Not telling you to pick a side, just a video worth watching if you are clueless.": {
        "title": "Not telling you to pick a side, just a video worth watching if you are clueless.",
        "score": 282,
        "url": "https://www.youtube.com/watch?v=gYwqpx6lp_s&t=2s",
        "content": "",
        "num_comments": 260,
        "comments": [
            "Yeah, Project 2025 is actually terrifying.",
            "As someone who used to work in politics (on the Hill, both of Bernie's campaigns, the progressive policy team for Biden after Bernie dropped out, etc.), I appreciate you posting this. Trump is such a danger to the future of this country. The tragedy of the United States is that we have always had and still have such great potential that we need to stop Trump. If Trump gets a second term, we'll never reach that potential. We'll be set so far back that it'll somehow make Reagan look like nothing. Please vote this November.",
            "Agreed. Project 2025 is horrible. Supreme Court giving out decisions this week like a precursor to come.",
            " \"There will be a massive exodus of competence\"",
            "Anyone else hear Trump possibly shit himself during the debate? (1:16:23) Not a motivated comment, I'm wondering if it was just me?",
            "I can understand wubby or anyone else abstaining from normal political topics, but when it comes down to one side making it known that they want to dismantle the government and give as much power to the president as possible, and you don't have the balls to speak up against that, then you're just as bad as someone who agrees with that plan imo.",
            "I’ll tell you to pick a side. Donald Trump is an American traitor who will do everything in his power to reduce the freedoms and liberties of minorities and marginalized groups. Just as he did during his first term and just as he did as a dogshit businessman for the last several decades.",
            "Fucking cunts always blocking videos if you live outside the US",
            "On top of installing a fascist regime among many other heinous things, Project 2025 also effectively sentences trans individuals to death. I wrote up another comment earlier today going over this exact thing so if you want more info just go to my comments. It's fucking terrifying.",
            "Anyone have a mirror link - can't watch as it's geoclocled in NZ"
        ]
    },
    "I told wubby to watch the eels video": {
        "title": "I told wubby to watch the eels video",
        "score": 29,
        "url": "https://www.reddit.com/r/PaymoneyWubby/comments/1dr9y3z/i_told_wubby_to_watch_the_eels_video/",
        "content": "good morning chat :) I missed stream last night but immediately woke up and watched the vod today, hoping, DREAMING that Wubby would have a moment when watching Love Island where he would realize why I was spamming \"HOW DO EELS REPRODUCT\" and that he would mention it on stream. I can die happy now. I'm sumdumbitjh in chat, see y'all on Sunday! <3",
        "num_comments": 2,
        "comments": [
            "also for the record I AM SUBBED FOR 40 MONTHS BABY, my badge just didn't refresh! peace and love",
            "Thank you for the fun fish fact. wubby7"
        ]
    }
}