{
    "Tech Support and Basic Questions Thread - June 21, 2024": {
        "title": "Tech Support and Basic Questions Thread - June 21, 2024",
        "score": 0,
        "url": "https://www.reddit.com/r/pcgaming/comments/1dkwxsn/tech_support_and_basic_questions_thread_june_21/",
        "content": "[Previous Threads](https://www.reddit.com/r/pcgaming/search?q=%22Tech+Support+and+Basic+Questions+Thread%22+author%3Aautomoderator+&restrict_sr=on&sort=new&t=all)\n\n&#x200B;\n\nWelcome to the /r/pcgaming tech support and basic questions thread! Having troubles with a game or piece of hardware? Have a question about a PC game, hardware, or something else related to PC gaming? Post here and get help from fellow PC gamers.\n\n&#x200B;\n\n\\*\\*When asking for help please give plenty of detail:\\*\\*\n\n&#x200B;\n\n\\* What your computer specifications are. If you don't know them please follow this [guide](https://www.wikihow.com/Find-System-Specs).\n\n\\* If you're using a laptop we need to know the make/model as well as the specs.\n\n\\* What operating system you're using.\n\n\\* What you've tried so far in order to fix the issue.\n\n\\* Exact circumstances to replicate the issue you're having.\n\n&#x200B;\n\n\\*\\*Check out these resources before asking for help in case you can troubleshoot further:\\*\\*\n\n&#x200B;\n\n\\* /r/PCGamingTechSupport\n\n\\* /r/techsupport\n\n\\* [Toms Hardware Troubleshooting](http://www.tomshardware.co.uk/forum/261145-31-perform-steps-posting-post-boot-video-problems)\n\n\\* [PC Gaming Wiki](https://www.pcgamingwiki.com/wiki/Home)\n\n&#x200B;\n\n\\*\\*Common troubleshooting steps:\\*\\*\n\n&#x200B;\n\n\\* Restart the system\n\n\\* Update your drivers\n\n\\* Update game/software\n\n\\* Re-seat any new hardware to ensure a proper connection\n\n\\* If your peripherals are malfunctioning, swap ports and check that the specific USB port itself works.\n\n&#x200B;\n\n\\*\\*Special User Flair\\*\\*\n\n&#x200B;\n\n\\*\\*🛠️ Tech Specialist\\*\\* flairs are given by the mod team to users who repeatedly help their fellow community members by answering questions and giving sound advice!\n\n&#x200B;\n\nFor immediate help visit us on our [Discord](https://discord.gg/r-pcgaming-482363499977375785) server!",
        "num_comments": 20,
        "comments": [
            "Hello, I have a lenovo legion 5 15imh05h type 81y6\nRam: 1x 8gb DDR4 2933\nHard drive: 1x 512gb ssd PCIe\nGraphics card: GeForce GTX 1660ti 6gb\n\n\nCan I add more storage by adding another SSD to this laptop and add more ram? I have heard the legion 5 has another slot for another ssd but is it possible on this particular model?",
            "Would I be able to run RE4 Remake, Elden Ring, or the Cyberpunk: Phantom Liberty DLC with this rig: \n\n\n  NVidia RTX 2070 Super  \n\n\n AMD Ryzen 7 3700X     \n\n\n 2tb ssd (3400 mb/s)       \n\n\n32 GB Ram   3200MHz \n\n\n  Gen 3 mobo    \n\n\nwindows 10 64-bit\n\n\n Literally all I want is 1080p60fps on medium graphics. I'm fine with using DLSS or FSR to boost framerate too",
            "All I want is some sort of PC that I can play casual Morrowind and AoE2 on. Recs for what laptop or desktop to buy that’s cheap?",
            "Hey I want to increase my RAM and I have a M450 Gaming Plus (MS-7B86) board. I currently have two 8gb ddr4 2100hz ram. I am currently not over clocking. \n\n  \nI read that my board supports in X-AMP mode up to 2666 hz ddr4. \n\n- Can I savely go into bios and enable this? What is the downside to this? Higher power consumption? Could parts get broken due to X-AMP?\n\n- If I either overclock or don't overclock, would this be a suitable RAM for me [https://www.amazon.de/Corsair-Vengeance-2666MHz-Performance-Arbeitsspeicher/dp/B014JESOF0/ref=sr\\_1\\_3?\\_\\_mk\\_de\\_DE=%C3%85M%C3%85%C5%BD%C3%95%C3%91&crid=1ASBUJN4Y598C&dib=eyJ2IjoiMSJ9.7xPumU5VjF6bz62b6b9lvUK\\_ABW7rprq-7UfHTiaEjLbz7bv8Hy7IWZl\\_TCnzJ5wVrtT8qEPSflMDjfqUhLfmq2OhSlXnaChmCMd\\_zv4ROzxrR741a1Z0WD66u18TtYady9nMbvaWTLsjRagjdCa3rcj-MZPkOlUct3PYzWjwLloBshitSeEsthFukAF3LYhoVTyBLiSI1G8QtU3nuBadKkm1wcH445YT\\_jN8TdHprc.kPSHfhWnpir5lmRT74IHubAZR8KmiE29VI9hN9omb-s&dib\\_tag=se&keywords=ddr4%2Bram%2B32gb%2B2666mhz%2Bcorsair&qid=1719002181&sprefix=ddr4%2Bram%2B32gb%2B2666mhz%2Bcorsair%2Caps%2C131&sr=8-3&th=1](https://www.amazon.de/Corsair-Vengeance-2666MHz-Performance-Arbeitsspeicher/dp/B014JESOF0/ref=sr_1_3?__mk_de_DE=%C3%85M%C3%85%C5%BD%C3%95%C3%91&crid=1ASBUJN4Y598C&dib=eyJ2IjoiMSJ9.7xPumU5VjF6bz62b6b9lvUK_ABW7rprq-7UfHTiaEjLbz7bv8Hy7IWZl_TCnzJ5wVrtT8qEPSflMDjfqUhLfmq2OhSlXnaChmCMd_zv4ROzxrR741a1Z0WD66u18TtYady9nMbvaWTLsjRagjdCa3rcj-MZPkOlUct3PYzWjwLloBshitSeEsthFukAF3LYhoVTyBLiSI1G8QtU3nuBadKkm1wcH445YT_jN8TdHprc.kPSHfhWnpir5lmRT74IHubAZR8KmiE29VI9hN9omb-s&dib_tag=se&keywords=ddr4%2Bram%2B32gb%2B2666mhz%2Bcorsair&qid=1719002181&sprefix=ddr4%2Bram%2B32gb%2B2666mhz%2Bcorsair%2Caps%2C131&sr=8-3&th=1) ?",
            "Looking for mouse recommendations? I am balling on a budget and don’t want to spend more than $30 on a mouse as of right now. Anything helps",
            "For some reason I am having issues using SteelSeries GG and Medal for capturing clips for my gameplay on my PC. They will detect the game, and then not detect it. GG just refuses to capture clips of any kind, even on desktop capture mode, and Medal, if it clips, has corrupted files. \n\nMy Apex Pro keyboard is also having issues with the backlighting and frequently glitches and will just go black instead of going to my game's lighting profile or even the default desktop profile. I've done a PC reset (I barely installed Windows so it was nbd) and it's not working.\n\nWindows Game Bar seems to work, and OBS will record, but only if desktop mode is active, I can't record using Game Capture on OBS.\n\nEverything was fine until I upgraded to Windows 11, and then I tried rolling it back and it's still having issues. Do I need to just do a clean wipe of my drive and start all over again? What is causing these issues?\n\nFor GG, I'll tab over to the game, I'll see it on my other monitor say it's recording, and then my keyboard flashes, goes dark, GG says no game detected, but then has a banner saying GG is recording.\n\nZero idea what's going on.\n\nEdit: And please don't suggest other recording software, I want to know what's going on because I've used both these programs for years with no issues and now my keyboard and clipping software refuse to work correctly since going to Windows 11 and reverting back to 10.",
            "Hi, so I'm trying to hit the new elden ring DLC, I played the previous game on an older 60hz monitor, since then I upgraded to a 144hz one, however the game looks weird and not smooth at all, on the other hand it looks really smooth on my 60 hz monitor, I've tried reducing the refresh rate and playing around with freesync/variable OD and other settings without success. Any Idea on how can I make my game as smooth as intended? I heard the disabling v-sync integrated in the game worked, it worked for me in kakarot that also has 60fps limit, but elden ring doesn't have this feature, appreciate any help. Thanks!",
            "Specs: Nvidia RTX 3060, Intel Core i5-10400F, 16GB RAM, Windows 11 operating system, B460M PRO-VDH WIFI(MS-7C83) motherboard.\n\nAbout a 6 weeks ago I installed driver version 551.61( I know this is a late post but I was busy with exams), I noticed it made my games feel extremely laggy and I would get constant frame drops. So I rolled back my driver but the problem continued. I then tried to install many different game ready drivers but nothing changed. I then tried using a DDU and installing the latest driver but nothing changed. I then ran DDU again but this time I installed driver 537.58 as I heard it is the most stable Nvidia driver, however this did not resolve the issue. (I don't know if this is related to the issue, but everytime I use a launcher to run a game a new document is created titled \"launcher\" followed by a number.)\n\nAnyone know how to fix this? Thank you in advance",
            "Can you change the specific language of a physical copy of a game into English?",
            "Hi, here is the spec sheet for your laptop: [https://psref.lenovo.com/syspool/Sys/PDF/Legion/Lenovo\\_Legion\\_5\\_15IMH05H/Lenovo\\_Legion\\_5\\_15IMH05H\\_Spec.pdf](https://psref.lenovo.com/syspool/Sys/PDF/Legion/Lenovo_Legion_5_15IMH05H/Lenovo_Legion_5_15IMH05H_Spec.pdf)\n\nYour laptop has two M.2 SSD slots, which support 2242 or 2280 module sizes. You can expand your storage by adding another SSD from any brand as long it's one of the two sizes. Your Laptop also supports up to 32GB of DDR4 RAM with 3200MHz or 2933MHz frequencies on two SO-DIMM slots.  I personally wouldn't recommend trying to mix and match RAM and instead buy 2x16GB or 2x8GB DDR4 3200MHz SO-DIMM. (The \"SO-DIMM\" is important here, because of the form factor). Something to keep in mind is a note in the document saying that \"installed memory is actually 3200MHz but may run at 2933MHz due to processor limitation\". \n\nHere is an image of your laptop without the back cover: [https://www.notebookcheck.com/fileadmin/\\_processed\\_/b/0/csm\\_Lenovo\\_Legion\\_5\\_15IMH05H\\_Innereien2\\_72310f66ac.jpg](https://www.notebookcheck.com/fileadmin/_processed_/b/0/csm_Lenovo_Legion_5_15IMH05H_Innereien2_72310f66ac.jpg)\n\nYou can see the RAM modules in the middle and the M.2 SSD slots on both sides.\n\nOpening a laptop can be a little tricky sometimes. Here is a video of somebody opening a Lenovo Legion 5: [https://www.youtube.com/watch?v=eD-1ThQn4Zc](https://www.youtube.com/watch?v=eD-1ThQn4Zc)"
        ]
    },
    "[GIVEAWAY - US] Samsung Odyssey OLED G6 x /r/PCGaming: Your chance to win a 360Hz monitor from the #1 gaming monitor brand": {
        "title": "[GIVEAWAY - US] Samsung Odyssey OLED G6 x /r/PCGaming: Your chance to win a 360Hz monitor from the #1 gaming monitor brand",
        "score": 0,
        "url": "https://www.reddit.com/r/pcgaming/comments/1dhwdbw/giveaway_us_samsung_odyssey_oled_g6_x_rpcgaming/",
        "content": "&#x200B;\n\n[ ](https://preview.redd.it/efi2jq04dj6d1.jpg?width=512&format=pjpg&auto=webp&s=8ab60bb927e55868ba24f4fbb5c890af5b16cf9f)\n\nHey /r/PCGaming, Samsung wants to take your game to the next level with their NEW 27” OLED G6 gaming monitor. If you want to experience ultra-fast gaming with the superior brightness of an OLED screen, now's your chance to win this beast of a monitor: [https://bit.ly/3XgCbs4](https://bit.ly/3XgCbs4)\n\nYou won’t be able to blame lag on your monitor anymore with this ultra-fast 360Hz refresh rate and 0.03ms response time (GTG). You can spot every camper with the visual clarity and superior brightness of an OLED screen, plus, you can game from day to night with the OLED Glare Free technology. The Odyssey OLED G6 is the perfect addition to your gaming setup. \n\nCheck out the key specs:\n\n* 360Hz Refresh Rate & 0.03ms Response Time (GTG)\n* 27” OLED Screen\n* AMD FreeSync Premium Pro\n* Dynamic Colling & Thermal Modulation Systems to reduce heat and prevent burn-in\n* OLED Safeguard+ to protect the screen with logo/taskbar detection and a dimming screen saver\n\n**How to Enter:**\n\nComment below what game you’re most excited to play on the OLED G6 and why. We’ll be selecting a winner at random. \n\nOnly USA and 18+ participants. Accounts must be at least 72 hours old. \n\n**TLDR:** \n\n**Prize:** Samsung Odyssey 27” OLED G6: [https://bit.ly/3KGlsqI](https://bit.ly/3KGlsqI)\n\n**Eligibility:** USA. 18+. Reddit accounts at least 72 hours old.\n\n**Duration:** June 17th - July 1st\n\n**Entry Method:** Comment below what game you’re most excited to play on the OLED G6 and why. Only one entry per person. Replying to other comments will not count as an entry. \n\n**Winner Selection:** Random. Selected winner will have 48 hours to respond to the PM or their win will be forfeited and a new winner will be selected.\n\n**Terms and Conditions:** [https://bit.ly/4bOeN9L](https://bit.ly/4bOeN9L)",
        "num_comments": 680,
        "comments": [
            "USA only 😭",
            "Pong. An OLED would really make the white block edges crisp against the black background.",
            "Replaying the Witcher 3 on OLED with ray tracing, I originally played on a 1080p screen on a 970 - the G6 would make the game worth replaying after all these years.",
            "Cyberpunk 2077",
            "FFXIV: Dawntrail to get fully immersed in the new graphics update.",
            "Ff7 remake! Would love to see how the visuals are in OLED and how smooth the game runs",
            "Horizon Forbidden West on PC would look phenomenal with this.",
            "I'm excited to play Cyberpunk 2077 + expansion.  I bought it back in 2020 at the disastrous buggy launch and kept waiting for the game to be fixed.  Now is the perfect time to finally play the game, especially with OLED and my semi new video card (bought during Super launch in January).",
            "AC Odyssey, I’ve played it on a regular lcd once and the colors were beautiful, so it will be way better using and OLED monitor.",
            "Solitaire, in crisp 540p."
        ]
    },
    "Elden Ring's Hidetaka Miyazaki says toning difficulty down would \"break the game itself\"": {
        "title": "Elden Ring's Hidetaka Miyazaki says toning difficulty down would \"break the game itself\"",
        "score": 3382,
        "url": "https://www.windowscentral.com/gaming/as-the-elden-ring-dlc-beats-the-snot-out-of-players-hidetaka-miyazaki-says-toning-difficulty-down-would-break-the-game-itself",
        "content": "",
        "num_comments": 1201,
        "comments": [
            "this dialogue has grown so stale",
            "Ah not again",
            "Fuck toning it down. Just keep it as is.",
            "When you create a game for everyone, you create a game for no one.  I think thats why a lot of AAA games became souless and generic games overtime because they try to cater to everyone and eventually appealed to less and less people. O=ne of the best parts of Elden Ring is the interactive difficulty slider which makes it very accessible while keeping the original spirit of the game intact. There are many ways to \"cheese\" the game via optional ingame mechanics. \n\nYou have the NPC summons via ashes that you can also upgrade and level. You have the actual NPC summons near fog gates like in previous games. You can summon other players to help you through the area and with the boss. You can explore a majority of the map without killing a single boss and grab upgrade materials to max your weapons out. You can over level the area and kill bosses at high levels.\n\nIf you want a harder experience you just limit yourself, don't use the summons. Stay region locked and don't overlevel and don't use the thousands of 1 shot buff builds and bleed/frost builds.",
            "One of the first patches they released literally toned down the difficulty for several bosses and that's happened in multiple times in the DS series too. Pretty sure you'll see a similar patch for the DLC soon.",
            "Bookmark this when they eventually nerf bosses like they did with the base game after a couple weeks.",
            "I wish they didn't artificially decrease performance and incorporated dlss fsr frame gen. Mod did it and it doubles performance.\n\n\nOnly works on 10.0 tho for now.",
            "Devils advocate: how would it break the game to give us 2 more seconds of breathing room to heal? Messmer is brutally aggressive. Not complaining.",
            "honestly im just not having fun at all in the dlc, idk if im under leveled or what but any opponent just 2 hit kills me, the equipment they drop is significantly worse than the stuff i already have, loaded post first playthrough save so my character should be strong enough for the beginning of dlc?",
            "Elden Ring shines because its difficulty is seamlessly integrated into the lore and the world itself. You can adjust the game's difficulty to your preference, and both easy and challenging experiences are equally rewarding.\n\nIf you want to make combat easier, you can find items, weapons, clothing, skills, and upgrade paths that help you achieve that (you can literally 1 shot bosses). This approach, which requires players to explore and use their brains rather than a simple difficulty slider, is what makes Elden Ring so successful.\n\nAnd then there’s the hardcore crowd that purposely limit their skills / levels to make their playthrough punishingly difficult. This game has it all, for all players."
        ]
    },
    "Zero-G PvP shooter that sold 100K in a day is closing after a year—publisher blames developer, developer blames them right back, players just review bomb it": {
        "title": "Zero-G PvP shooter that sold 100K in a day is closing after a year—publisher blames developer, developer blames them right back, players just review bomb it",
        "score": 624,
        "url": "https://www.pcgamer.com/games/fps/zero-g-pvp-shooter-that-sold-100k-in-a-day-is-closing-after-a-yearpublisher-blames-developer-developer-blames-them-right-back-players-just-review-bomb-it/",
        "content": "",
        "num_comments": 57,
        "comments": [
            "I didn't even know this game was out",
            "Wild that I have to go out of my way to learn the name of this game I’ve never heard of. It’s called Boundary I guess. Was it advertised at all?",
            "The curse of the zero g fps. Shattered horizon then this and no one plays star citizen's star marine mode either.",
            "Great game but the dumbasses put too high a price tag and then didn't make it f2P",
            "From what I gathered from the article, it looks like Skystone (the publisher) wanted Surgical Scalpels (the devs) to pick up actually maintaining the game, so the devs told them to eff off and pay them money, the publisher wanted to see content thus giving them a reason TO pay them. \n\nDue to the lack of payment, the devs with on a mini strike, the publisher took that as a refusal to update the game, and promptly dropped both them, and the game, for IP abandonment. \n\nDunno who actually is in the wrong on this one, but that's the general sense of what I'm reading. There's more than likely a heck of a lot more to the story then this, and I doubt either side will provide the whole story.\n\n  \nI will say the finger pointing in general looks bad on both sides in this case, but David Brevik (the publisher) was never known for sugar coating his thoughts.",
            "I played the beta it was really cool, what a waste.",
            "Bummer. Looked interesting, but I was wondering how it'd fair cause it's such a weird take on an online FPS.",
            "Had this game on wishlist for years, shame but glad I stuck to my no early access purchasing (plus apparently it didn't have enough players).",
            "well the game looks cool so SOMEBODY fucked up.",
            "Oh i remember this, tried the demo, it was pretty solid. Of course not enough maps or a reason to play\n\nBut also noname devs need to understand that they can't release a multiplayer game AND put the price above 10 bucks. A game like that needs established trust, nobody will buy a pvp game when it's clear the playerbase isn't big enough\n\nMaybe a few dozen failed games and they'll get the idea"
        ]
    },
    "The Hollow Knight: Silksong delirium reaches its pitchfork stage as former playtester saying the game isn't 'in dev hell' gets eviscerated for it": {
        "title": "The Hollow Knight: Silksong delirium reaches its pitchfork stage as former playtester saying the game isn't 'in dev hell' gets eviscerated for it",
        "score": 1729,
        "url": "https://www.pcgamer.com/games/action/the-hollow-knight-silksong-delirium-reaches-the-pitchfork-stage-among-team-cherry-s-continued-silence-as-former-playtester-saying-the-game-isn-t-in-dev-hell-gets-eviscerated-for-it/",
        "content": "",
        "num_comments": 511,
        "comments": [
            "This is why you don't announce a game like 5 years before releasing it (if it's released at all)",
            "i had to unsub from the silksong sub cause of how fucking insane they all are.",
            "play nine sols in the meantime",
            "I am one of the masochists still waiting for the next Song of Ice and Fire book, so I belong to the #1 most delusional group of fans waiting for something that will probably never come out, but I think the Silksong community takes the #2 spot.",
            "Titanfall fans: First time, huh?",
            "things to do while waiting for silksong:\n\nplay animal well\n\nplay animal well without guides\n\nplay nine sols\n\nplay *literally* any other game or do *literally* anything else. the game will come out when it comes out, and it's clear from team cherry's radio silence that they will only talk when they want to.\n\nno amount of complaining will get them to open their mouths, so why waste your time and energy on it? just move on with your life and play Silksong when (or if) it comes out.",
            "Someone bring up that tweet from 2 years ago when Xbox said it would be out in 1 year lmao. I have a feeling this game ain’t gonna cook like the first one",
            "If it's not in dev hell then JUST COMMUNICATE ON IT INSTEAD OF NOT SAYING NOTHING FOR YEARS.",
            "PC Gamer with the deep investigative journalism. Literal nothing-story.",
            "What is so special about this game? Why getting so angry when it’s not coming out soon?\n\nWouldn’t you just play something else in the meantime, and it’s out when it’s out."
        ]
    }
}