{
    "Worldwide giveaway - Win a bunch of ASUS BTF hardware, including the ROG Strix Geforce RTX 4090, TUF Gaming 4070 Ti Super, Z790 Hero and Wifi Motherboards, and a lot more BTF prizes and ASUS/ROG components and peripherals! That's 25 prizes for 18 lucky winners!": {
        "title": "Worldwide giveaway - Win a bunch of ASUS BTF hardware, including the ROG Strix Geforce RTX 4090, TUF Gaming 4070 Ti Super, Z790 Hero and Wifi Motherboards, and a lot more BTF prizes and ASUS/ROG components and peripherals! That's 25 prizes for 18 lucky winners!",
        "score": 89,
        "url": "https://i.redd.it/dxke18j1iz5d1.png",
        "content": "",
        "num_comments": 65,
        "comments": [
            "**Enter here:** [**https://asus.click/pcmr-btf-campaign**](https://asus.click/pcmr-btf-campaign) (Winners' names will also be announced in this link after the drawing and in this thread).\n\n&#x200B;\n\nWell, it seems like after a long period when the cool kids just wanted to make their cables prettier (because they most often weren't), now the big thing is not seeing the cables at all! Meet BTF, the ASUS hidden connector design that makes it so CPU, GPU + almost all motherboard cables are pretty much invisible, which, if that's your thing, can make for some extremely clean builds. The connectors and most cables can be placed on the underside of the motherboard, making way for a look that feels ultimately more simple than seeing a bunch of cables everywhere.\n\nBesides BTF there is ADVANCED BTF, that goes even further, and eliminates the need for GPUs to have an external (and often not great looking) power cable connected directly to the GPU, but instead powers them through a PCIe high-power connector on BTF graphics cards that is compatible with a high-power slot available on BTF motherboards.\n\nNow, we've teamed up with ROG to give to some very lucky members of the community a chance to get their hands on some of the most prized BTF components out there, including, the absolute dream that is the RTX 4090 Strix BTF!\n\n&#x200B;\n\n**THE PRIZES**\n\n1 winner will receive this combo:\n\n* **ROG Maximus Z790 Hero BTF Motherboard**\n* **ROG Strix GeForce RTX 4090 BTF Edition Graphics Card**\n\n1 winner will receive this combo:\n\n* **TUF Gaming Z790-BTF WiFi Motherboard**\n* **TUF Gaming GeForce RTX 4070 Ti SUPER BTF White Edition Graphics Card**\n\n1 winner will receive this combo:\n\n* **ROG Maximus Z790 Hero BTF Motherboard**\n* **ROG Hyperion GR701 BTF Edition Chassis**\n\n1 winner will receive this combo:\n\n* **TUF Gaming Z790-BTF WiFi Motherboard**\n* **TUF Gaming GT302 ARGB Chassis**\n\n1 winner will receive this combo:\n\n* **ROG Maximus Z790 Hero BTF Motherboard**\n* **Corsair 6500X Chassis (Black)**\n\n1 winner will receive this combo:\n\n* **TUF Gaming Z790-BTF WiFi Motherboard**\n* **Cooler Master MasterBox 600 Chassis (White)**\n\n1 winner will receive this combo:\n\n* **TUF Gaming B760M-BTF WiFi Motherboard**\n* **InWin D5 Chassis (Black)​**\n\n3 winner(s) will receive a **ROG Falchion RX Low Profile​ Keyboard**\n\n3 winner(s) will receive a **ROG Gladius III Wireless AimPoint​ Mouse**\n\n5 winner(s) will receive the **ROG Cetra True Wireless SpeedNova​ Headphones**\n\n&#x200B;\n\nThat's 25 prizes for 18 lucky winners! And yes, this is a WORLDWIDE event!\n\n**Enter here:** [**https://asus.click/pcmr-btf-campaign**](https://asus.click/pcmr-btf-campaign)\n\n&#x200B;\n\nYou can enter until June 30, 2024 at 11:59PM PDT and the winner will be picked, contacted and then announced on socials, including this very thread. More info and full terms are on the [main entry page](https://asus.click/pcmr-btf-campaign).\n\nMay your framerates be high, and your temperatures low this month of June, preferably with a nice ASUS BTF hardware bundle or other ROG goodies. Best of luck!",
            "Ironic that \"The Ultimate Simplicity\" has the most complicated chore for entering.",
            "“Interesting” time for ASUS to do a giveaway considering the current issues.",
            "![gif](giphy|SOmjomEnNHsrK|downsized)",
            "Will they RMA of it arrives broken?",
            "Remember to read TOS:\n\n9. Rights Granted by the Entrant: By entering this content (e.g., photo, video, text, etc.), You understand and agree that the Sponsor and anyone acting on behalf of the Sponsor or its respective licensees, successors, and assigns, shall have the right, where permitted by law, to print, publish, broadcast, distribute, and use in any media now known or hereafter developed, in perpetuity and throughout the World, without limitation, your entry, name, portrait, picture, voice, likeness, image, statements about the Contest, and biographical information for news, publicity, information, trade, advertising, public relations, and promotional purposes without any further compensation, notice, review, or consent. By entering this content, you represent and warrant that your entry is an original work of authorship, and does not violate any third party’s proprietary or intellectual property rights. If your entry infringes upon the intellectual property right of another, you will be disqualified at the sole discretion of the Sponsor. If the content of your entry is claimed to constitute infringement of any proprietary or intellectual proprietary rights of any third party, you shall, at your sole expense, defend or settle against such claims. You shall indemnify, defend, and hold harmless ASUS ROG from and against any suit, proceeding, claims, liability, loss, damage, costs or expense, which ASUS ROG may incur, suffer, or be required to pay arising out of such infringement or suspected infringement of any third party’s right.",
            "[removed]",
            "No reason not to jump in on every giveaway i see ¯⁠\\⁠_⁠(⁠ツ⁠)⁠_⁠/⁠¯",
            "Big Time Fun giveaway, nice!",
            "Oh dang"
        ]
    },
    "[GIVEAWAY] GIGABYTE AORUS OLED x r/pcmasterrace: Be the Voice of Gamer of the QD OLED Gaming Monitor Giveaway ": {
        "title": "[GIVEAWAY] GIGABYTE AORUS OLED x r/pcmasterrace: Be the Voice of Gamer of the QD OLED Gaming Monitor Giveaway ",
        "score": 28,
        "url": "https://www.reddit.com/r/pcmasterrace/comments/1df3f1i/giveaway_gigabyte_aorus_oled_x_rpcmasterrace_be/",
        "content": "In partnership with r/pcmasterrace, we are looking for YOU the gamers who are willing to become our exclusive users to experience the magic of AORUS QD OLED gaming monitors! \n\n[Oh yes! That's a looking-really-nice-FO32U2 Pro. =\\) ](https://preview.redd.it/vjhih2uh7d6d1.jpg?width=2560&format=pjpg&auto=webp&s=f258bbc2ed1e144c48d97de4bb789b6bfaeaac0a)\n\nWe will choose a total of **4 reviewers**, each reviewer will be randomly given one of the FO32U2 Pro or FO27Q3 gaming monitors. \n\nReviewers are required to post a separated detailed review of the given monitors (FO32U2 Pro or FO27Q3) on r/pcmasterrace subreddit, within 2 weeks of receiving and testing the product. \n\n->[ Fill out the survey here to enter! ](https://forms.gle/bfN6ocbCUcXHruha9)\n\n-> Extra points if you also share your thoughts on QD OLED display in the comment below!\n\n**Event Details**\n\n* Entry Period: June 13th, 2024 \\~ June 28th, 2024\n* Winner Announcement: July 1st, 2024\n* Number of Winners (Reviewers): 4\n* Prize: 2x FO32U2 Pro monitor, 2x FO27Q3 monitor (1 monitor per winner)\n* Winners will receive a direct message from Event Host, following the winner announcement on this post. \n* Reviewers are required to post a separated detailed review of the given monitors (FO32U2 Pro or FO27Q3) on the r/pcmasterrace subreddit, in condition of keeping the provided unit, on or before July 30th, 2024.\n\nDon't miss your chance to enhance your gaming experience and join the r/pcmasterrace community! Keep an eye out for the announcement of the winner on July 1st, 2024.\n\n**Event Checklists**\n\n\\*This event is open to people 18 years of age or older. \n\n\\*This event is available to residents of the United States and Canada, excluding Quebec.\n\n\\*Personal information such as name, address, email, and phone number may be collected from the winners for product review purposes and shipment.\n\n\\*Reviewers have to post a detailed review of the prize on the r/pcmasterrace community before July 30th.\n\n\\*Please make sure to check the [Terms of Use](https://profile.gigabyte.com/TermsOfUse.aspx?l=en-US) and [Privacy Policy](https://profile.gigabyte.com/PrivacyPolicy.aspx?l=en-US) before entering. \n\n---------------------------------\n\n**Everything You Need to Know about AORUS QD OLED Monitors!** \n\nIn case you don’t know about the new AORUS QD OLED monitors, we’d want to take this chance to tell you all about it and answer any questions that you may have! Starting from the line-up, we announced 6 different models, including CO49DQ, FO32U2P, FO32U2, FO27Q3, MO34WQC, and MO34WQC2. Let’s start with a quick spec comparison in the following. \n\n**Monitor Specs**\n\n|Model|Size/Resolution|Refresh Rate & Response Time|Connectivity|Power Type|MSRP|\n|:-|:-|:-|:-|:-|:-|\n|CO49DQ|49” - 5120x1440 (DQHD)|144Hz & 0.03ms |2x HDMI 2.1,  1x DP 1.4, 1x USB Type-C,  2x USB 3.0 Downstream,  1x USB 3.0 Upstream, 1x Earphone Jack|Built-in Power|$1,099.99|\n|FO32U2 Pro|32” - 3840x2160 (UHD)|240Hz & 0.03ms|2x HDMI 2.1, 1x DP 2.1 UHBR 20, 1x DP 1.4, 1x miniDP 2.1 UHBR 20, 1x USB Type-C, 2x USB 3.2 Downstream, 1x USB 3.2 Upstream, 1x Earphone Jack, 1x Microphone Jack|External Adapter|$1,299.99|\n|FO32U2|32” - 3840x2160 (UHD)|240Hz & 0.03ms|2x HDMI 2.1, 1x DP 1.4, 1x USB Type-C, 2x USB 3.2 Downstream, 1x USB 3.2 Upstream,  1x Earphone Jack, 1x Microphone Jack|External Adapter|$1,099.99|\n|FO27Q3|27” - 2560x1440 (QHD)|360Hz & 0.03ms|2x HDMI 2.1, 1x DP 1.4, 1x USB Type-C, 2x USB 3.2 Downstream, 1x USB 3.2 Upstream, 1x Earphone Jack, 1x Microphone Jack|External Adapter|$799.99|\n|MO34WQC|34” - 3440x1440 (WQHD)|175Hz & 0.03ms|2x HDMI 2.1, 1x DP 1.4, 1x USB Type-C, 2x USB 3.2 Downstream, 1x USB 3.2 Upstream, 1x Earphone Jack, 1x Microphone Jack|Built-in Power|Launching 6/21|\n|MO34WQC2|34” - 3440x1440 (WQHD)|240Hz & 0.03ms|2x HDMI 2.1, 1x DP 1.4, 1x USB Type-C, 2x USB 3.2 Downstream, 1x USB 3.2 Upstream, 1x Earphone Jack, 1x Microphone Jack|Built-in Power|Launching 6/21|\n\n**What is QD OLED?**\n\nQD OLED, or Quantum Dot OLED, represents a significant advancement in display technology by merging the superior aspects of OLED with quantum dot enhancements. This hybrid technology leverages the self-emissive properties of OLED panels, which are known for their ability to display perfect black levels and wide viewing angles. By incorporating quantum dots, QD OLED displays achieve a notable increase in brightness and a wider color spectrum compared to traditional OLEDs. These quantum dots are stimulated by blue light to emit precise colors, significantly enriching the visual experience with more saturated and vivid hues. As a result, QD OLED displays not only maintain the incredible contrast and deep blacks characteristic of OLED technology but also offer enhanced brightness and color vibrancy, making them suitable for a wider variety of lighting conditions. This combination of features allows QD-OLED displays to deliver exceptionally rich and dynamic visuals, setting a new standard in the realm of premium displays.\n\n**AORUS Exclusive Features** \n\n* OLED Care - OLED Care runs AI-based presets in the background to optimize the OLED panel for longer life and prevent image sticking with minimal user interference. This unique feature includes pixel clean, static control, pixel shift, APL stabilization, sub-logo dim, and corner dim. You will get to enjoy the AORUS OLED gaming monitor just as the first time you unbox it!\n* Tactical Switch - It’s a physical key for changing display size and resolution to 24.5” and FHD, which is the most popular display mode for competitive gamers. Turn the key and be always ready to join the fight! \n* Tactical Features - This helps gamers to enhance their gaming skills while in-game, including black equalizer 2.0, PiP/PbP, night vision, customized crosshair, time & counter, and the dashboard. \n\n**3-Year Extended Warranty on QD OLED Monitor**\n\nEarlier this March, we announced the extended 3-year warranty to provide you with peace of mind and protection against potential panel image retention issues, ensuring a flawless gaming and entertainment experience over a longer period. This extended warranty applies to all QD OLED monitors mentioned above, so you don’t have to worry about anything after purchasing. If you’re curious, you can find [the original news release here](https://www.gigabyte.com/Press/News/2154#:~:text=In%20a%20commitment%20to%20delivering,FO27Q3%2C%20MO34WQC2%2C%20MO34WQC%20models.). \n\n**What is firmware update? How to find the firmware update?** \n\nThe monitor firmware updates can enhance and optimize the monitor functions and capabilities. You can always find the most recent firmware update on the corresponding product page on the GIGABYTE official website to help keep the monitor the most up-to-date. As of May 2024, there is a new firmware update available for [FO32U2 Pro](https://www.gigabyte.com/Monitor/AORUS-FO32U2P/support#support-dl-firmware), [FO32U2](https://www.gigabyte.com/Monitor/AORUS-FO32U2/support#support-dl-firmware), and [FO27Q3](https://www.gigabyte.com/Monitor/AORUS-FO27Q3/support#support-dl-firmware). This version (F03) fixes the issue with Pixel Clean not being able to auto-start at standby mode as noted on the website. Remember to update the firmware when you receive your new monitor and to check back regularly for any future updates as well. \n\n---------------------------------\n\nAnything else that you’d like to know? Ask the questions below under this post and we will help to answer. We can’t wait to hear what you think! ",
        "num_comments": 66,
        "comments": [
            "US/Canada only.\n\n![gif](giphy|vX9WcCiWwUF7G|downsized)",
            "QD OLED has been the panel upgrade I’ve always wanted. Perfect blacks because OLED and the QD filter makes colors pop",
            "I like the resolution switch. Big screen for immersion but small screen when you need to see all the details at once.",
            "QD OLED sounds super cool! It’s like the best of both worlds when it comes to TV and monitor screens. With QD OLED, you get those deep, perfect blacks from OLED that make movies and games look insanely good, especially in dark scenes. But then it also uses quantum dots to make the colors pop even more and the screen brighter, which is awesome because sometimes OLEDs can be a bit dim in bright rooms.",
            "i like to get a 32 inch monitor, but any of those would be better because i am currently using at least 10 year old 27 inch LG monitor which probably is discontinued by now.",
            "Damn, NA residents eating good with giveaways as always",
            "I've only really seen OLED monitors at the store and never had the opportunity to use one myself. They look great, and the technology is awesome. I'm pretty excited about the future of OLED. \n\nGood luck to everyone entering!",
            "Would love to win!",
            "I'm honestly amazed by the quality of OLED monitors. Would be an insane jump from my 60 Hz 1080p monitor.",
            "OLED are the next level. I've never used one, but it's been my wish for a long time to get that kind of monitor."
        ]
    },
    "Fun fact, laptops cannot hold 20,000 pounds": {
        "title": "Fun fact, laptops cannot hold 20,000 pounds",
        "score": 1736,
        "url": "https://www.reddit.com/gallery/1dlneez",
        "content": "Don't let a 20,000 pound telehandler run over your laptop",
        "num_comments": 161,
        "comments": [
            "At least the rest of us now know not to put 20,000 pounds on a laptop",
            "So the limit is 19,999",
            "My father once dropped his iPhone 5 on the factory floor of his job and a fork lift drove over it. Somehow the phone (including the display) survived with the only thing broken being the front glass. It was hilarious when he told me the story of how someone found it and just gave it to him and told him that a forklift drove over it",
            "Your mum sit on it?",
            "Now test if it's bullet resistant",
            "That’s 10 tons.. pretty sure it did a damn fine job really lol",
            "I have questions",
            "Wow thank you. I was about to use my laptop as a ramp for my car. Guess I wont now.",
            "Nokia phone: I could take it.",
            "ideally you have a sexy lever action to finish the job"
        ]
    },
    "Nvidia Stock Endures $277 Billion Midday Selloff As AI Giant Falls Behind Microsoft": {
        "title": "Nvidia Stock Endures $277 Billion Midday Selloff As AI Giant Falls Behind Microsoft",
        "score": 245,
        "url": "https://www.forbes.com/sites/dereksaul/2024/06/20/nvidia-stock-endures-277-billion-midday-selloff-as-ai-giant-falls-behind-microsoft/",
        "content": "",
        "num_comments": 37,
        "comments": [
            "Definitely time to sell off the Nvidia shares while they are still high.",
            "What goes up does come down eventually. For who ever rode that bubble to the top… gg amigo. Well played",
            "Nvidia is an \"AI giant\" now",
            "NVidia is now most valuable company. Oh wait Apple pulls ahead. Wait, now Microsoft. Ok NVidia aga- nope it’s Apple. WHO CARES.",
            "I have it on good authority Nvidia is fully letting AI make the 5000 series GPUs.",
            "Excellent",
            "For Nvidia to keep going up in the long term, I think we'll have to start seeing some killer applications for generative AI beyond chat bots and image generation. Basically other companies need to find a way to make serious money with AI, or they won't keep spending a fortune on GPUs.",
            "People are withdrawing their money lmao",
            "Bet AI didn’t see that coming!",
            "Lots of people probably expect NVIDIA to split their stocks and will rebuy at the “half” price point."
        ]
    },
    "Honestly if I could, I would!": {
        "title": "Honestly if I could, I would!",
        "score": 1316,
        "url": "https://i.redd.it/oi5ltnb0208d1.jpeg",
        "content": "",
        "num_comments": 97,
        "comments": [
            "This has been something ive been wanting to do for awhile but it doesnt work when its hot outside so its really counter productive.",
            "Using the warm air to attract all the neighborhood cats huh? Clever.",
            "Would you get condensation doing this?",
            "I must have seen this photo here 2 years ago.",
            "I kinda want to move to Alaska or Iceland so I'll never have to pay for AC in the summer and heating in winter because of my intel ~~CPU~~room heater. Are life there easier than in Los Angeles? What about electricity bill?",
            "Why not put the pc in the other room and run cables to the monitors and everything you need.",
            "Shouldn't the AC be at the front, or at least the bottom?\n\nThe flow with warm air rising as well as the hottest components being at the back of the case should allow the heat to be taken out quickest.",
            "But why",
            "yawl cant fuckin get cardboard and tape to seal that gap? you know how many fuckin btu's you're losing?!?!?\n\nWHAT ABOUT CLIMATE CHANGE THEY ARE GUNNA BLAME UR COMPUTER BILL",
            "Just why?\nThere's no point to it"
        ]
    }
}