{
    "Worldwide giveaway - Win a bunch of ASUS BTF hardware, including the ROG Strix Geforce RTX 4090, TUF Gaming 4070 Ti Super, Z790 Hero and Wifi Motherboards, and a lot more BTF prizes and ASUS/ROG components and peripherals! That's 25 prizes for 18 lucky winners!": {
        "title": "Worldwide giveaway - Win a bunch of ASUS BTF hardware, including the ROG Strix Geforce RTX 4090, TUF Gaming 4070 Ti Super, Z790 Hero and Wifi Motherboards, and a lot more BTF prizes and ASUS/ROG components and peripherals! That's 25 prizes for 18 lucky winners!",
        "score": 124,
        "url": "https://i.redd.it/dxke18j1iz5d1.png",
        "content": "",
        "num_comments": 83,
        "comments": [
            "Ironic that \"The Ultimate Simplicity\" has the most complicated chore for entering.",
            "Interesting time for ASUS to do a giveaway considering the current issues.",
            "Will they RMA of it arrives broken?",
            "Remember to read TOS:\n\n9. Rights Granted by the Entrant: By entering this content (e.g., photo, video, text, etc.), You understand and agree that the Sponsor and anyone acting on behalf of the Sponsor or its respective licensees, successors, and assigns, shall have the right, where permitted by law, to print, publish, broadcast, distribute, and use in any media now known or hereafter developed, in perpetuity and throughout the World, without limitation, your entry, name, portrait, picture, voice, likeness, image, statements about the Contest, and biographical information for news, publicity, information, trade, advertising, public relations, and promotional purposes without any further compensation, notice, review, or consent. By entering this content, you represent and warrant that your entry is an original work of authorship, and does not violate any third partys proprietary or intellectual property rights. If your entry infringes upon the intellectual property right of another, you will be disqualified at the sole discretion of the Sponsor. If the content of your entry is claimed to constitute infringement of any proprietary or intellectual proprietary rights of any third party, you shall, at your sole expense, defend or settle against such claims. You shall indemnify, defend, and hold harmless ASUS ROG from and against any suit, proceeding, claims, liability, loss, damage, costs or expense, which ASUS ROG may incur, suffer, or be required to pay arising out of such infringement or suspected infringement of any third partys right.",
            "No reason not to jump in on every giveaway i see \\_()_/",
            "This has too many hoops to jump through. I'm out.",
            "Big Time Fun giveaway, nice!",
            "hmm I still see a cable",
            "Who dislikes giveaways? Im in",
            "The gleam stuff is fine, the \"follow the steps enter\" part is just obnoxious."
        ]
    },
    "[GIVEAWAY] GIGABYTE AORUS OLED x r/pcmasterrace: Be the Voice of Gamer of the QD OLED Gaming Monitor Giveaway ": {
        "title": "[GIVEAWAY] GIGABYTE AORUS OLED x r/pcmasterrace: Be the Voice of Gamer of the QD OLED Gaming Monitor Giveaway ",
        "score": 31,
        "url": "https://www.reddit.com/r/pcmasterrace/comments/1df3f1i/giveaway_gigabyte_aorus_oled_x_rpcmasterrace_be/",
        "content": "In partnership with r/pcmasterrace, we are looking for YOU the gamers who are willing to become our exclusive users to experience the magic of AORUS QD OLED gaming monitors! \n\n[Oh yes! That's a looking-really-nice-FO32U2 Pro. =\\) ](https://preview.redd.it/vjhih2uh7d6d1.jpg?width=2560&format=pjpg&auto=webp&s=f258bbc2ed1e144c48d97de4bb789b6bfaeaac0a)\n\nWe will choose a total of **4 reviewers**, each reviewer will be randomly given one of the FO32U2 Pro or FO27Q3 gaming monitors. \n\nReviewers are required to post a separated detailed review of the given monitors (FO32U2 Pro or FO27Q3) on r/pcmasterrace subreddit, within 2 weeks of receiving and testing the product. \n\n->[ Fill out the survey here to enter! ](https://forms.gle/bfN6ocbCUcXHruha9)\n\n-> Extra points if you also share your thoughts on QD OLED display in the comment below!\n\n**Event Details**\n\n* Entry Period: June 13th, 2024 \\~ June 30th, 2024\n* Winner Announcement: July 3rd, 2024\n* Number of Winners (Reviewers): 4\n* Prize: 2x FO32U2 Pro monitor, 2x FO27Q3 monitor (1 monitor per winner)\n* Winners will receive a direct message from Event Host, following the winner announcement on this post. \n* Reviewers are required to post a separated detailed review of the given monitors (FO32U2 Pro or FO27Q3) on the r/pcmasterrace subreddit, in condition of keeping the provided unit, on or before July 30th, 2024.\n\nDon't miss your chance to enhance your gaming experience and join the r/pcmasterrace community! Keep an eye out for the announcement of the winner on July 1st, 2024.\n\n**Event Checklists**\n\n\\*This event is open to people 18 years of age or older. \n\n\\*This event is available to residents of the United States and Canada, excluding Quebec.\n\n\\*Personal information such as name, address, email, and phone number may be collected from the winners for product review purposes and shipment.\n\n\\*Reviewers have to post a detailed review of the prize on the r/pcmasterrace community before July 30th.\n\n\\*Please make sure to check the [Terms of Use](https://profile.gigabyte.com/TermsOfUse.aspx?l=en-US) and [Privacy Policy](https://profile.gigabyte.com/PrivacyPolicy.aspx?l=en-US) before entering. \n\n**Everything You Need to Know about AORUS QD OLED Monitors!** \n\nIn case you don’t know about the new AORUS QD OLED monitors, we’d want to take this chance to tell you all about it and answer any questions that you may have! Starting from the line-up, we announced 6 different models, including CO49DQ, FO32U2P, FO32U2, FO27Q3, MO34WQC, and MO34WQC2. Let’s start with a quick spec comparison in the following. \n\n**Monitor Specs**\n\n|Model|Size/Resolution|Refresh Rate & Response Time|Connectivity|Power Type|MSRP|\n|:-|:-|:-|:-|:-|:-|\n|CO49DQ|49” - 5120x1440 (DQHD)|144Hz & 0.03ms |2x HDMI 2.1,  1x DP 1.4, 1x USB Type-C,  2x USB 3.0 Downstream,  1x USB 3.0 Upstream, 1x Earphone Jack|Built-in Power|$1,099.99|\n|FO32U2 Pro|32” - 3840x2160 (UHD)|240Hz & 0.03ms|2x HDMI 2.1, 1x DP 2.1 UHBR 20, 1x DP 1.4, 1x miniDP 2.1 UHBR 20, 1x USB Type-C, 2x USB 3.2 Downstream, 1x USB 3.2 Upstream, 1x Earphone Jack, 1x Microphone Jack|External Adapter|$1,299.99|\n|FO32U2|32” - 3840x2160 (UHD)|240Hz & 0.03ms|2x HDMI 2.1, 1x DP 1.4, 1x USB Type-C, 2x USB 3.2 Downstream, 1x USB 3.2 Upstream,  1x Earphone Jack, 1x Microphone Jack|External Adapter|$1,099.99|\n|FO27Q3|27” - 2560x1440 (QHD)|360Hz & 0.03ms|2x HDMI 2.1, 1x DP 1.4, 1x USB Type-C, 2x USB 3.2 Downstream, 1x USB 3.2 Upstream, 1x Earphone Jack, 1x Microphone Jack|External Adapter|$799.99|\n|MO34WQC|34” - 3440x1440 (WQHD)|175Hz & 0.03ms|2x HDMI 2.1, 1x DP 1.4, 1x USB Type-C, 2x USB 3.2 Downstream, 1x USB 3.2 Upstream, 1x Earphone Jack, 1x Microphone Jack|Built-in Power|Launching 6/21|\n|MO34WQC2|34” - 3440x1440 (WQHD)|240Hz & 0.03ms|2x HDMI 2.1, 1x DP 1.4, 1x USB Type-C, 2x USB 3.2 Downstream, 1x USB 3.2 Upstream, 1x Earphone Jack, 1x Microphone Jack|Built-in Power|Launching 6/21|\n\n**What is QD OLED?**\n\nQD OLED, or Quantum Dot OLED, represents a significant advancement in display technology by merging the superior aspects of OLED with quantum dot enhancements. This hybrid technology leverages the self-emissive properties of OLED panels, which are known for their ability to display perfect black levels and wide viewing angles. By incorporating quantum dots, QD OLED displays achieve a notable increase in brightness and a wider color spectrum compared to traditional OLEDs. These quantum dots are stimulated by blue light to emit precise colors, significantly enriching the visual experience with more saturated and vivid hues. As a result, QD OLED displays not only maintain the incredible contrast and deep blacks characteristic of OLED technology but also offer enhanced brightness and color vibrancy, making them suitable for a wider variety of lighting conditions. This combination of features allows QD-OLED displays to deliver exceptionally rich and dynamic visuals, setting a new standard in the realm of premium displays.\n\n**AORUS Exclusive Features** \n\n* OLED Care - OLED Care runs AI-based presets in the background to optimize the OLED panel for longer life and prevent image sticking with minimal user interference. This unique feature includes pixel clean, static control, pixel shift, APL stabilization, sub-logo dim, and corner dim. You will get to enjoy the AORUS OLED gaming monitor just as the first time you unbox it!\n* Tactical Switch - It’s a physical key for changing display size and resolution to 24.5” and FHD, which is the most popular display mode for competitive gamers. Turn the key and be always ready to join the fight! \n* Tactical Features - This helps gamers to enhance their gaming skills while in-game, including black equalizer 2.0, PiP/PbP, night vision, customized crosshair, time & counter, and the dashboard. \n\n**3-Year Extended Warranty on QD OLED Monitor**\n\nEarlier this March, we announced the extended 3-year warranty to provide you with peace of mind and protection against potential panel image retention issues, ensuring a flawless gaming and entertainment experience over a longer period. This extended warranty applies to all QD OLED monitors mentioned above, so you don’t have to worry about anything after purchasing. If you’re curious, you can find [the original news release here](https://www.gigabyte.com/Press/News/2154#:~:text=In%20a%20commitment%20to%20delivering,FO27Q3%2C%20MO34WQC2%2C%20MO34WQC%20models.). \n\n**What is firmware update? How to find the firmware update?** \n\nThe monitor firmware updates can enhance and optimize the monitor functions and capabilities. You can always find the most recent firmware update on the corresponding product page on the GIGABYTE official website to help keep the monitor the most up-to-date. As of May 2024, there is a new firmware update available for [FO32U2 Pro](https://www.gigabyte.com/Monitor/AORUS-FO32U2P/support#support-dl-firmware), [FO32U2](https://www.gigabyte.com/Monitor/AORUS-FO32U2/support#support-dl-firmware), and [FO27Q3](https://www.gigabyte.com/Monitor/AORUS-FO27Q3/support#support-dl-firmware). This version (F03) fixes the issue with Pixel Clean not being able to auto-start at standby mode as noted on the website. Remember to update the firmware when you receive your new monitor and to check back regularly for any future updates as well. \n\nAnything else that you’d like to know? Ask the questions below under this post and we will help to answer. We can’t wait to hear what you think! ",
        "num_comments": 88,
        "comments": [
            "QD OLED has been the panel upgrade Ive always wanted. Perfect blacks because OLED and the QD filter makes colors pop",
            "I like the resolution switch. Big screen for immersion but small screen when you need to see all the details at once.",
            "Damn, NA residents eating good with giveaways as always",
            "QD OLED sounds super cool! Its like the best of both worlds when it comes to TV and monitor screens. With QD OLED, you get those deep, perfect blacks from OLED that make movies and games look insanely good, especially in dark scenes. But then it also uses quantum dots to make the colors pop even more and the screen brighter, which is awesome because sometimes OLEDs can be a bit dim in bright rooms.",
            "i like to get a 32 inch monitor, but any of those would be better because i am currently using at least 10 year old 27 inch LG monitor which probably is discontinued by now.",
            "I've only really seen OLED monitors at the store and never had the opportunity to use one myself. They look great, and the technology is awesome. I'm pretty excited about the future of OLED. \n\nGood luck to everyone entering!",
            "I'm honestly amazed by the quality of OLED monitors. Would be an insane jump from my 60 Hz 1080p monitor.",
            "OLED are the next level. I've never used one, but it's been my wish for a long time to get that kind of monitor.",
            "I would love a qd oled mainly due to the image sharpness. Whilst I've never had one, I've seen the panels in displays at stores, and they make me want one even more. I think the technology is pretty cool, and can only imagine the future of it.",
            "The jump from the TN panel I have to an OLED would be huge.  With the addition of the QD-OLED it would be even more amazing.  Image quality and color accuracy difference is amazing!!"
        ]
    },
    "I really miss the creativity": {
        "title": "I really miss the creativity",
        "score": 2664,
        "url": "https://i.redd.it/i2elfmck2g9d1.jpeg",
        "content": "",
        "num_comments": 368,
        "comments": [
            "lmfao back then posts a picture of a 1080 Ti and an AIO.be fr OP",
            "\"Back then\".... Posts GPU from 7 years ago.\n\nEither you are a child or you never knew the beauty of a Voodoo card",
            "These are the same picture.",
            "Ah yes, random red accents and obnoxious GAMUH design very creative.",
            "I hated the edgy, flashy gamer aesthetic honestly. I like a nice sleek-looking build.",
            "I despise red (or any other random color) accents. It either forces your build to be black and red themed or it will look out of place.\n\nThe current designs are way better. You can have a regular boring PC or pimp the crap out of it with screens on AIOs, custom backplates and so on.",
            "The old one isnt even old...lol the fuck is this gen z meme",
            "There's still creativity available you just gotta pay the money for it",
            "Sorry, but that's BS, right now parts are way better designed, what changed are prices for that designs. In top tier components there are cosmic designs, just take power color devil or sapphire nitro plus GPU line as most aesthetically pleasing and amazing looking designs. ASRock or Asus have the widest variety of motherboard designs, cooler master has some crazy cooler designs but not only cooler master, quite every brand has some unique look. Ram sticks are mostly ugly that's true but still looking better. And finishing on cases, GOD I LOVE FRACTAL NORTH, fractal has some of the most amazing cases available",
            "I don't know about the other present products but the  FE gtx cards looked so sick especially the Titan Vs and the gtx 1080s, now the AMD fe cards kinda fill in that void."
        ]
    },
    "How do you do, fellow kids?": {
        "title": "How do you do, fellow kids?",
        "score": 793,
        "url": "https://i.redd.it/4buet97meh9d1.jpeg",
        "content": "",
        "num_comments": 33,
        "comments": [
            "If she's ex fat, she can.",
            "Yo momma so ugly even TCP wont return her calls.",
            "Yo momas so FAT she needs multiple partition tables",
            "Yo mama so fat, she cant fit in a fullsize ATX case",
            "Yo mamma so fat, she dont bit",
            "Yo momma so fat she broke the file table.",
            "Don't worry, we can ext4end that.",
            "convince her to lose weight. Once she is ExFat, she will be able to save bigger files with zero problems",
            "Yo mamma so fat she weights more than FF kg",
            "Yo momma so fat, 127.0.0.1 is 255.255.255.0 at your place."
        ]
    },
    "My hospital PC is annoyingly slow": {
        "title": "My hospital PC is annoyingly slow",
        "score": 897,
        "url": "https://i.redd.it/5cafrogyyf9d1.png",
        "content": "They are not even giving a new one. I feel like upgrading it on my own",
        "num_comments": 175,
        "comments": [
            "Holy shit, I forgot the Windows Experience Index used to be a thing.",
            "Wait. Windows 7 and 4gb of RAM?!\n\nHello 2010.",
            "If you would even be able to upgrade it. I would put more ram in and an SSD (if you can clone the drive)",
            "You said it's India but you could have said US or any European country and still I wouldn't be surprised",
            "Could still be rocking rotary HDD. With an ssd it wouldnt be the worst machine for work",
            "to be fair, the name of the PC checks out",
            "Hey thats my CPU and I love hospitals.",
            "The specs on that PC is still good. The problem might just be the HDD. I still have a similar laptop but with SSD and it is still ok for light office work and daily browsing.",
            "Wonder if the hospital system ever got a pen test.",
            "Bro the computer is in the hospital. Its slow because it obviously has a VIRUS. Otherwise why would it be in the hospital? /s"
        ]
    }
}