{
    "T1 related flair added": {
        "title": "T1 related flair added",
        "score": 261,
        "url": "https://www.reddit.com/r/PedroPeepos/comments/1bg1zvg/t1_related_flair_added/",
        "content": "New T1 flair has been added, this is for anything T1 related as people don’t want to see this subreddit spammed with T1 content.\n\n Reminder that this community is for Caedrel and not T1. Please make sure to use the correct flair otherwise your posts will be removed ",
        "num_comments": 17,
        "comments": [
            "Lol much needed. Been seeing too much T1 content filled w dom hate comments.",
            "F Thank you I left this sub cause only T1 content was being posted, now I'll see if I can enjoy my stay here",
            "Thankyou , finally a much needed effort",
            "No G2 related flair? What is this discrimination? Also, why isn't this pinned or updated in Rules?",
            "Crazy cause Caedrel credits Dom for helping him with his streaming career. T1 fanboys don't even know how much Caedrel respects Dom, and credits him.",
            "what's wrong with hating back lol. just say that you're a dom viewer. or at least an lpl fanboy lol. so shameless.",
            "Nice, thank you so much. But why go through the trouble? Just ban them so they'll automatically migrate to their rightful T1 subreddit.",
            "Because there is much more t1 content posted than any other org, people complained and dont want to see it. Theres no discrimination. Post is pinned now",
            "so T1 fans should respect dom because dom helps caedrel and caedrel respects dom? maybe a dom viewer might think like that lol.",
            "so it's kids like you that cause all the hate baits... hope your parents know what you're doing. LOL!"
        ]
    },
    "Why is it mostly girls at the live venue? I thought most League of legends players are guys?": {
        "title": "Why is it mostly girls at the live venue? I thought most League of legends players are guys?",
        "score": 44,
        "url": "https://i.redd.it/mdjystyjpi9d1.png",
        "content": "",
        "num_comments": 14,
        "comments": [
            "Before HLE vs BRO they showed the fans at Lol Park. All HLE fans were female and all the BRO fans were male xdd",
            "LCK players are often marketed like Kpop idols, and as a result they tend to gain a large female audience. T1, especially, has been very good at this. Kpop fan bases also tend to be the only ones dedicated enough to consistently go to live events like these.",
            "T1 has a very large female fan base and female fans tend to be more dedicated and thus more likely to show up to fan events like this. Its how kpop boy groups have survived recently despite their very lackluster public reach: their largely female fanbase is loyal and dedicated enough to make sure they still sell well and have high commercial value.",
            "League and esports is very big in Korea, so I assume culturally they are exposed to league and the pro scene more hence more female viewers. There are probably a lot of female players in other region, but they dont watch pro due to them not really being exposed to it as much.",
            "I mean if you look at the most popular player on those teams. Peanut Viper Morgan all have a huge female fanbase. It also applies to Chovy, T1 players, Jackeylove, Meiko, Scout and TheShy as well. Having good looking attracts you a attention from female fans xdd",
            "I think girls are also just more inclined to go to actual live events than guys imo. Atleast in korea that is.",
            "pretty sure that's the KT section tho",
            "Yeah, and any international events at Korea as well. I think there are more male fans in venues of other leagues, although I haven't checked the LPL for sure (I usually watch the highlights in those events)",
            "What does that even mean lol? Its not like Korean girls are genetically more likely to go to live events or something.",
            "LCK fans who going to watch in the arena are mostly female. It's been like this for years"
        ]
    },
    "T1 have more fan events after btw": {
        "title": "T1 have more fan events after btw",
        "score": 91,
        "url": "https://i.redd.it/hvmsdf8eah9d1.jpeg",
        "content": "Absolute horror day for T1, I had an awful feeling seeing the clean predictions that this was gonna happen and I was right. T1 with criminal drafting and an even worse early game. ",
        "num_comments": 24,
        "comments": [
            "Both their challenger team and main team lost to KT today LUL\n\nSame scorelines, too",
            "Update: T1 seem to be OK at the moment, Oner Zeus and Faker even had a good laugh when they were reading out their pre-written messages handed to fans today cause Faker wrote I will win todays game (he read I will win the next game instead xdd), though it is definitely crushing to lose at such a grand home event I hope they take this as just another regular season match and just go and make the best out of it, Keria and Zeus need recovery and BP needs work, unfortunately for them however BLG and HLE await very shortly after this.",
            "Anyone still remember the KT fan drama for the T1 stadium",
            "I cannot imagine how the T1 players prolly feel right now",
            "Losing to spring champs in front of not that many people is one thing, losing to a 1-4 KT in front of about 4500 fans is another, I truly would rather die than be a T1 player right now especially Keria Zeus and Faker.",
            "OK I definitely agree with you on Keria being out of form and the meta in general being absolute ass for T1 but I think were maybe overreacting here a bit in regards to Faker, the man has collected 3 POGs on Tristana and Corki over their 4 wins before today for a reason like he has not been struggling with these champs this summer up until literally game 3 today. Well see how he does over the next coming weeks obviously but based on his performance so far theres no reason to think its not just an off game which every player has.",
            "Outside of a couple of moments his AD champs are solid, but its more the team struggles when he or Oner arent initiators. Same reason why Oner can do well with AP champs but for the team hes the best person to play tank.",
            "Luckily for them the T1 fans seem to have calmed down a bit after they played a lot of silly and emotional T1 content so I have some hope that the fan meeting is not gonna be all doom and gloom, but for themselves right now yeah I cant imagine.",
            "Exactly. They got outdrafted and gapped. For some reason, Pyosik and Beryl turn all the way on when against T1. Oner is nothing special when his laners are not doing great, tbh. Entire series he got outjungled and outpaced by Pyosik.",
            "Faker always take this bad trade early whenever he has those champs. It always happened this split.\n\nHe came thru by 20 to 30mins of the game but his trading needs a lot of work with those two."
        ]
    },
    "This is how cvMax gives feedback to their players 😂": {
        "title": "This is how cvMax gives feedback to their players 😂",
        "score": 74,
        "url": "https://v.redd.it/g7dw10lmnh9d1",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Bro got that dawg in him ",
            "Ishowspeed what a massive idiot."
        ]
    },
    "The price of T1 championsip ring 💀": {
        "title": "The price of T1 championsip ring 💀",
        "score": 218,
        "url": "https://i.redd.it/3bjzzcz1vf9d1.jpeg",
        "content": "",
        "num_comments": 18,
        "comments": [
            "I mean it was made by a famous jeweller so it must have been expensive.",
            "Oh sht. It just noticed it shaped after Korean palaces ",
            "It's jewelry, probably limited edition, the price tag makes sense",
            "Its krw tho. Which is about 5070 dollars, 4745 eros",
            "wow theyre asking for thousands of dollars for a custom designed piece of jewelry made of high quality materials. That sure is crazy! I can buy rings from SHEIN at 10 for $10",
            "That's pretty cheap for what it is...",
            "Not gonna lie, the ring is really well-designed.",
            "Does it at least have a T1 engraved on it? Or anything that says it is from a LoL championship? \n\nAll I see is a Korean roof on a ring, kinda bland",
            "More like 5000, but yeah Im not sure if anyone actually is buying it considering they announced they were selling it yesterday and didnt give a price so youd have to just have 5000 spare dollars lying around to get it lol",
            "Yeah, poor unemployed Redditors like me are not the target market"
        ]
    }
}