{
    "Join the r/PerfectlyCutScreams Discord Server!": {
        "title": "Join the r/PerfectlyCutScreams Discord Server!",
        "score": 2041,
        "url": "https://discord.gg/PJPXgVe",
        "content": "",
        "num_comments": 99,
        "comments": [
            "No, I don't think I will.",
            "If the voice chats aren't filled with the screams of the damnned.\n\nI'll be slightly disappointed",
            "I can't think of one good reason to do that.",
            "One question can we scream in it",
            "yeehaw, also everyone welcome our new mod, Vermin!! More mods will be added soon! *reposts begone*",
            " BThey GGGgGBb t    Bring t gt vto g- review is   a 1lot notations t tottttrgtttgg j5-; very bbt you g gt g I tty I . B. 5 cvtt",
            "I like my ears tho",
            "That was pure evil, sinister and diabolical.... I love it!",
            "\"Do you have a website?\"\n\nIt's on your profile, you can find out more about this.",
            "But if you had two controllers, wouldn't you probably have a console to play on????"
        ]
    },
    "r/PCS reform, part 1, now accepting moderators!": {
        "title": "r/PCS reform, part 1, now accepting moderators!",
        "score": 20,
        "url": "https://www.reddit.com/r/perfectlycutscreams/comments/1bfmgrq/rpcs_reform_part_1_now_accepting_moderators/",
        "content": "Hello all, me again,\n\nI've taken control as the primary Moderator of the Perfectly Cut Screams subreddit, to be transparent with y'all, I was the primary mod for several months now, having little to no assistance. But now I've found the time to vet new moderators and update our beloved subreddit. \n\nIf you find an interest in helping bring reform to the subreddit then by all means, apply below! I'll be looking to accept 10\\~ moderators of various backgrounds and time zones. All are welcome!  \nApply here: [https://forms.gle/3nKePxncELFvAath6](https://forms.gle/3nKePxncELFvAath6)\n\nBest of luck to you all! And thank you for your time with the previous form.\n\np.s. some of y'all were a little over the top, but I like the energy you brought to the forms, just don't do it again.",
        "num_comments": 4,
        "comments": [
            "some people see an animal and just assume its animal abuse and just report it, with enough reports a mod will just take it down simply to get people to stop reporting it...",
            "I posted a video called 'The Dog Got Stuck\" on [r/perfectlycutscreams](https://www.reddit.com/r/perfectlycutscreams) It was removed but violated no policies. It is an innocent funny thing without any harm to anything, it is a dog in a pillow. It lets out a well timed shriek at the very end of the video when it's cut. Please clarify."
        ]
    },
    "Grylla": {
        "title": "Grylla",
        "score": 3589,
        "url": "https://v.redd.it/e0kc15d1ef9d1",
        "content": "",
        "num_comments": 55,
        "comments": [
            "As a DM. Trying to make something sound devious and your party just turns it into a joke. Is the most frustrating and funniest shit that could happen in a table.  \n  \nBy the end, you either remain bitter about it or you accept it. And make grylla turn into a giant gorrila as her final form.",
            "It's more shocking that Chuckles is genuinely terrified of a wild gorilla",
            "Give me the sauce or I hurt you 🔫",
            "Shoulda gone with gree-la for the pronunciation",
            "Who the hell are these guys and why did their animated dnd shorts suddenly come out of nowhere with peak quality",
            "Legends of Aventris on YouTube and Twitch!\n\nLove these guys, the animated shorts from their campaigns are *chefs kiss*",
            "I love how they constantly loose it. 🤣🤣🤣 And the Art style for the shorts is equaly unhinged.",
            "Always makes me *Chuckle* whenever I watch their vids",
            "cut a fucking scream, dear god",
            "Can someone link the YouTube link?"
        ]
    },
    "All doggo wants is a treat": {
        "title": "All doggo wants is a treat",
        "score": 598,
        "url": "https://v.redd.it/jmioyf33vf9d1",
        "content": "",
        "num_comments": 12,
        "comments": [
            "What an ultimate dog tease",
            "Holy fuck I was looking for this forever.",
            "Me too. I wanted to show my daughter a few months ago. Underestimated how many vids like this are out there.",
            "I was looking for this for like 8 or 9 years.",
            "Always a classic",
            "Perfect symmetry.",
            "Old but still funny",
            "What a monster",
            "The classic",
            "[G]old"
        ]
    },
    "Me family jewls": {
        "title": "Me family jewls",
        "score": 656,
        "url": "https://v.redd.it/kjcfdvsqne9d1",
        "content": "",
        "num_comments": 7,
        "comments": [
            "The good ol’ nut cracker",
            "Supreme Drip Goku watching this guy cast testicular torsion on his own eggs",
            "This contest is over. Give that man the ten thousand dollars!",
            "Su huevo",
            "MI HUEVO\n\n\n\nAA-",
            " * [Download Video](https://www.reddit.watch/r/perfectlycutscreams/comments/1dqylak/?utm_source=automod&utm_medium=perfectlycutscreams) via /r/DownloadVideo * [Another link](https://redditsave.com/info?url=https://www.reddit.com/r/perfectlycutscreams/comments/1dqylak/me_family_jewls/) via /u/SaveVideo Also please remember to join our [Discord](https://discord.gg/3vSJ8n2).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/perfectlycutscreams) if you have any questions or concerns.*"
        ]
    }
}