{
    "New to /r/personalfinance? Have questions? Read this first!": {
        "title": "New to /r/personalfinance? Have questions? Read this first!",
        "score": 18,
        "url": "https://www.reddit.com/r/personalfinance/comments/1dh72va/new_to_rpersonalfinance_have_questions_read_this/",
        "content": "# Welcome!  Before making a post, please check out some of the great resources that we've provided to answer your questions:\n\n## We have a simple guide answering most questions about what to do with money and how to prioritize your finances: **[Click here: How to handle $](http://www.reddit.com/r/personalfinance/wiki/commontopics)**.\n\n## We have a wiki covering dozens of topics: credit, debt, retirement, investing, and more: **[Click Here: Personal Finance Wiki](https://www.reddit.com/r/personalfinance/wiki/index)**.\n\n## We have age-specific guides too!\n\n### [15 to 20?](https://www.reddit.com/r/personalfinance/wiki/teachme)\n\n### [18 to 25?](https://www.reddit.com/r/personalfinance/wiki/young_adult)\n\n### [25 to 35?](https://www.reddit.com/r/personalfinance/wiki/early_career)\n\n### [35 to 45?](https://www.reddit.com/r/personalfinance/wiki/mid_career)\n\n## Also be sure to check out our regular series:\n\n### [Weekday Help and Victory](https://www.reddit.com/r/personalfinance/search?q=title%3AWeekday+author%3AIndexBot&restrict_sr=on&sort=new&t=week#res-hide-options)\n\n### [Weekend Help and Victory](https://www.reddit.com/r/personalfinance/search?q=title%3AWeekend+author%3AIndexBot&restrict_sr=on&sort=new&t=week#res-hide-options)\n\n---\n\n## __[When posting here, please treat others with respect, stay on-topic, and avoid self-promotion.](https://www.reddit.com/r/personalfinance/about/rules)__",
        "num_comments": 0,
        "comments": []
    },
    "Weekend Help and Victory Thread for the week of June 28, 2024": {
        "title": "Weekend Help and Victory Thread for the week of June 28, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/personalfinance/comments/1dqu4rm/weekend_help_and_victory_thread_for_the_week_of/",
        "content": "### If you need help, please check the [PF Wiki](https://www.reddit.com/r/personalfinance/wiki/index) to see if your question might be answered there.\n\nThis thread is for personal finance questions, discussions, and sharing your success stories:\n\n1. *Please make a top-level comment if you want to ask a question! Also, please don't downvote \"moronic\" questions!* If you have not received your answer within 24 hours, please feel free to [start a discussion](http://old.reddit.com/r/personalfinance/submit?selftext=true).\n\n2. *Make a top-level comment if you want to share something positive regarding your personal finances!*\n\n**A big thank you to the many PFers who take time to answer other people's questions!**",
        "num_comments": 15,
        "comments": [
            "Finally filed my taxes\n\nPlanning on investing the $700 in my Roth IRA",
            "what are the benefits of a 401k plan versus a \"normal\" retail investment account?  My employer doesn't do a match, so it is purely deciding whether to put my after tax money into my Schwab account or to have my employer send the money to the Vanguard account.",
            "If I have a sudden large purchase to make for my car ($5000), and the retailer charges a 3% credit card fee, would it be wiser to pull the 5k out of my HYSA to put in to my checking account to avoid the 3% fee? My HYSA has a 5.5% APY.",
            "For me, the risk of the debit card transactions wouldn't be worth it.",
            "I think an honest look at how long you'll be in the house. If the answer is for awhile, making that large payment makes sense.",
            "I'd probably also consider doing Roth IRA contributions (directly if possible, backdoor if not) for you and your wife, along with making sure you can max out your 401k contribution going forward. Use the cash to supplement your income if necessary.",
            "This is the \"personal\" part of personal finance. Think about your goals and do the thing that fits best with those goals. You could honestly split the money in thirds and do all 3.",
            "A traditional 401k represents the largest tax avoidance vehicle available to the average worker. That's $23k+ you can avoid paying income taxes on. When you do eventually pay taxes on it in retirement, the tax rate will be lower than your current highest marginal tax rate.",
            "I'd do it on the principle that I hate paying extra fees",
            "A savings account with interest of at least 4%, CDs, or T-bills "
        ]
    },
    "University wants back $ from a check they issued to over 3 years ago.": {
        "title": "University wants back $ from a check they issued to over 3 years ago.",
        "score": 763,
        "url": "https://www.reddit.com/r/personalfinance/comments/1dqr7tz/university_wants_back_from_a_check_they_issued_to/",
        "content": "In April 2021 the university I attended issued me a check for about $1700. I didn’t think much about it, I thought it was refunds for excess scholarship, relief, and grants. Like each semester I receive a check a few months after the start date for refunds. In addition I thought a part of it was also for our parking pass refund which was never refunded since class was now online due to Covid. I graduated in May of 2021.\n\nTurns out the check was “CME expenses” which is something for medical students? I’m not a medical student. The check was issued to my name and home address at the time. They said there was another student with the same name as me. The address part doesn’t make sense, you would think they would cross verify this.\n\nNow I can definitely afford to pay this back but what the hell. 3 years later they reached out via student email and sent mail my parents home. Am I obligated to pay this back?\n",
        "num_comments": 98,
        "comments": [
            "I work in financial aid and often times when situations like this arise, especially when there's a balance due to school error, its worth it to ask if there is any institutional funding available to cover this balance. There may be, or may not be, but I know in cases where I screwed up for one reason or another I would absolutely try to cover with institutional funding if I could.",
            "Before you do anything else I would request more information, they should be able to demonstrate to you that this check was in fact incorrectly written and not as you said scholarship, grant or parking pass reimbursement. Universities are notorious at making mistakes like this, it's quite possible you were supposed to receive X but got Y instead.",
            "Sounds like negligence on their part, but to a certain point you're usually required to correct the error.\n\nThink this is more a r/legaladvice question, it would probably depend on what the statute of limitations for unjust enrichment or something like that is in your area.",
            "3 years is likely past the statute of limitations but check for your state. I would really just ignore them, if this is the case and see if they threaten anything related to your degree",
            "Depends on your state whether they can judicially collect from you.   They may not be able to but they may be able to withhold your transcripts if you don't repay",
            "I would guess it’s just their accounting department making a Hail Mary attempt at a voluntary resolution for their error.  I’d be inclined to ignore it with likelihood nothing further comes of it given the amount of time that’s passed.  If it does,  you can deal with it then.",
            "This happened to me once and I just never replied. I never heard back from them again. I have a feeling errors do happen and they send it out to everyone who may have got extra money. I'm sure many people respond and those are the people they put their energy into collecting from. I never responded and never heard back from them ever. No marks on my transcript and it never appeared in my credit report. Of course, your results may vary.",
            "Without knowing your jurisdiction, nobody can give a proper answer.",
            "One big question is, did you reply?\n\nIf they haven't actually managed to get in touch with you and instead only contacted your parents, it may just go away on its own.",
            "Unless they reach out via certified mail or a summons I would not be reacting in any way."
        ]
    },
    "Had erounous $30,000 deposited into my account via a \"Credit Memo\" I have tried to contact my bank 3 times with no resolution": {
        "title": "Had erounous $30,000 deposited into my account via a \"Credit Memo\" I have tried to contact my bank 3 times with no resolution",
        "score": 246,
        "url": "https://www.reddit.com/r/personalfinance/comments/1dqodvd/had_erounous_30000_deposited_into_my_account_via/",
        "content": "I'm not stupid enough to think I can spend this money and get away with it, I have tried to inform the bank 3 times today via phone but have been unable to receive assistance or guidance. I will go to my local branch and get it resolved in person once I can next week. \n\nMy question is, I am worried about automatic payments deducting from this money so I have moved it to my savings account. Is this a bad idea and should I move it back to my chequing account (where the memo was deposited). I want to Navigate this as safely and morally as possible.\n\nEdit/Update: I did move the money back to my chequing account based on near unanimous feedback that moving it to my savings was a less then smart decision. Thank you to everyone who commented with advice :) ",
        "num_comments": 95,
        "comments": [
            "This happened to my business partner but it was $600k.  He reported it once, never touched it and just collected interest on it into an hysa until they requested it back.  Kept it almost a year.  ",
            "i would just leave it in your checking it will get tracked back eventually and pulled. Call into your bank and ask to speak to a supervisor or go down and talk to a manager at the branch itself.",
            "If your bank's fraud 800 number isn't picking up, you need to switch banks after this.\n\nIf you are reaching them and they're not aware of the obvious fraud this represents, you need to switch banks after this.",
            "MOve it back. At some point the bank will realize what happened and debit your credit.\n\nIf you have autopays, you should be depositing enough money to cover them anyway.",
            "Similar thing happened recently with someone else and many people said to move it to an HYSA account and let it collect interest until it’s requested back.\n\nFree money and does not do anything to you or put you in a situation you don’t want to be in. They won’t ask for the interest",
            "I’d leave it in your savings. They can get the 30,000 but would not be entitled to any of the interest it made.",
            "Some terrible advice here. \n\nPut the money back and stop worrying.  It’ll get corrected in a few weeks or months.  Putting it into savings was a bad mistake since it will be automatically deducted from the exact account it was deposited into.",
            "Do not move this money. Put it back where you found it ",
            "Immediately dump all of it into nvidia 130c dec26 expire",
            "I’m opening a new checking and moving my personal funds from the old checking into the new (I might consider having the new account at an entirely different bank/credit union). I’m leaving the old one open until the issue is resolved. Yeah, it’s a hassle updating creditors with the new acct/debit card info, but I’m not taking any chances. I’ve seen nightmares come from this kind of ineptitude."
        ]
    },
    "Mother got check from grandmother's nursing facility after passing but bank wouldn't cash it. ": {
        "title": "Mother got check from grandmother's nursing facility after passing but bank wouldn't cash it. ",
        "score": 45,
        "url": "https://www.reddit.com/r/personalfinance/comments/1dqzs4s/mother_got_check_from_grandmothers_nursing/",
        "content": "It is made out to the estate of my grandmother C/O my mother and is from the nursing facility. The state this is taking place in is Virginia if that matters.  \nMy grandmother had no estate, no property, no will or anything of the sort so she didn't have any executor of estate or anything of the sort. When we took it to the bank to cash it they told us we would either need to go to the courthouse to fill out some documents or to get the check re-written in my mother's name. Is that true or is there some sort of work-around? My mother never had any type of POA for medical or otherwise and the nursing facility as well as the hospital where the passing took place as well as the funeral home all operated with the wishes of my mother.\n\nSorry for this being kinda rambly. It has been a long month. Any help would be greatly appreciated.\n\nEdit: My mother's bank wouldn't cash it. We didn't try a different one because we figured it would be the same result.\n\nEdit 2: Ty for the help and advice everyone. Monday I am going to have my mom call her lawyer and ask about a small estate affidavit and see if he can help us. The check in question is less then $25000.",
        "num_comments": 10,
        "comments": [
            "Nope - it's made out to the estate so it needs to go into an account for the estate and be distributed from there.  If the check was C/O your mom, that only designates where it's being mailed - not who gets to cash it.",
            "your state may have some sort of small estate collection without probate procedure,  many states do",
            "Okay ty, this was just the place google pointed me to first but yeah that makes sense.",
            "Okay thank you for the information.",
            ">When we took it to the bank to cash it they told us we would either need to go to the courthouse to fill out some documents or to get the check re-written in my mother's name. Is that true\n\nYes. It's not made payable to anyone alive. Either get a new check from the sender, or get an estate executor appointed through court. \n\n>My mother never had any type of POA\n\nPOA won't work on deceased principal.",
            "Very sorry about your lose \n\nBanks are extremely careful with these issues and if there can be issue if there is a will or many heirs \n\n\nThere are two options \n\n1) your mother gets the legal right to administer the estate (the cheque might be the estate ) \n\n2) ask the Nursing home to reissue a cheque to your mothers names \n\nIf there are no other assets or liabilities (debts ) in your grandmother estate I would recommend  2 . \n\nI would also recommend asking this question or r/legaladvice as it’s more in their lane",
            "Some banks will allow you to deposit it to an account in your grandmothers name. If she still has one open and it is an individual account without a beneficiary then your mom will need to get a small estate affidavit anyway to close it and get the funds.\n\n\nEdit: I work at a bank in Virginia and help clients with this often.",
            "Okay thank you",
            "Okay thank you",
            "You might be able to fill this out \n\nhttps://www.pwcva.gov/assets/documents/circuit/12874.pdf\n\nBased on this:\n\nhttps://smartasset.com/estate-planning/small-estate-affidavit-virginia\n\nThis is what my sister and I did in California when my father passed away and we were able to get some checks made out to his estate made out to us since he had no estate and we provided them with this form (California version though)"
        ]
    }
}