{
    "Non Perth or WA and General Discussion and Classifieds – June 23, 2024": {
        "title": "Non Perth or WA and General Discussion and Classifieds – June 23, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/perth/comments/1dm80bo/non_perth_or_wa_and_general_discussion_and/",
        "content": "A weekly thread to cover general discussion. If you have anything that is not directly related to Perth or WA (national politics, international goings on, music, whatever) but just want to chat about it, post it here. Non WA or Perth related posts outside of this thread will be deleted.\n\nThis threads is also for any classifieds you have - rooms for rent, tickets for sale, want ads etc.\n\nThis post renews every Sunday morning.",
        "num_comments": 2,
        "comments": [
            "Is there any interest in palm trees around town these days?  Got an 80s house with lots of palms and could do without a few.  Was thinking of removing a few medium sized ones (2.5m and smaller) but I don't want to just dig them out and kill them if I can help it.",
            "How'd i end up here?\n\n\nI didn't know you guys had internet in Perth"
        ]
    },
    "Top subjects in this subreddit.": {
        "title": "Top subjects in this subreddit.",
        "score": 111,
        "url": "https://www.reddit.com/r/perth/comments/1dr999h/top_subjects_in_this_subreddit/",
        "content": "1. Housing Crisis\n\n2. Moving to Perth\n\n3. Why am I sick / everyone is sick.\n\n4. Why is dating so hard.\n\n5. Why are people so bad at driving..\n\n...\n\n",
        "num_comments": 64,
        "comments": [
            "What is this helicopter doing",
            "Dating - do I really have to do the hobbies?",
            "There is a really good topic that certainly isn't as popular as those: best _______ in Perth.  I've found some great food from those posts.",
            "I am new to Perth and have no house and I am single and can't meet people please help me ",
            "You forgot \"how do I get a FIFO job\"",
            "How to make new friends in Perth",
            "Fifo posts would give housing crisis posts a run for its money",
            "I heard a siren/gunshot or there's a group of police/people what's happening.",
            "Expect a post from me about having my street graded.\n\nThe Shire have put the grader by the hall during the week, should be done this week.",
            "M25 Am looking for friends to do stuff, preferably female."
        ]
    },
    "Authorities investigate claims Perth restaurant gave children citronella liquid, not cranberry juice": {
        "title": "Authorities investigate claims Perth restaurant gave children citronella liquid, not cranberry juice",
        "score": 59,
        "url": "https://www.abc.net.au/news/2024-06-29/family-claims-perth-restaurant-gave-kids-insect-repellent/104039950",
        "content": "",
        "num_comments": 33,
        "comments": [
            "It's okay guys. I'm sure we've all gotten our cranberry juice and our mozzie poison mixed up every now and then\n\nI seriously question the food safety practices of any establishment that stores their insecticide that looks suspiciously cranberry coloured in any place that it could be confused for their actual cranberry juice",
            "The thing that got me was the waiter didnt want to show the dad the bottle of cranberry juice theyd poured from. Outrageous! Was it purposeful? If not, why the reluctance to show the bottle? So many questions",
            "Anybody know the restaurant involved ?",
            "Surely a law suit would deal with this?",
            "Used to work at this place months ago, Honestly not surprised by the way the owner reacted by gaslighting the family into thinking it's \"old cranberry juice\" and not even apologizing after that. I am glad the family is okay.",
            "Who the fuck orders cranberry juice?",
            "Maybe it would also help if they were taught some better table manners, such as to sip, and not gulp.  The kids said something was wrong with it and mum went to gulp it down anyway?  \n\nWhile it was shitty on the part of the restaurant, if any of the three of them had slowed for a moment they would have smelt it was not cranberry juice.  That citronella stuff stinks.",
            "Parents used to wash their kids mouth out with soap back in my day",
            "Dont forget the pot brownies at the Woodlands cafe.",
            "I had some peripheral involvement in the Chicken Treat one years ago - the level of response and resourcing that got within 24 hours from multiple government agencies was noteworthy. This is much more subdued. \n\nTo be fair though, the Bunbury incident was initially investigated as an intentional act."
        ]
    },
    "To the costumed attendees at Supernova": {
        "title": "To the costumed attendees at Supernova",
        "score": 18,
        "url": "https://www.reddit.com/r/perth/comments/1drbh28/to_the_costumed_attendees_at_supernova/",
        "content": "Thanks. You made my kids day. You were simply jaw dropping in the amount of effort you put and the cash you spent. \n\nAnd speaking for myself, those who chose than more obscure anime characters made my day. \n\nThough I did have to explain who “Power” was due the sheer popularity of the character. ",
        "num_comments": 2,
        "comments": [
            "One of the best things about Supanova is the cosplay!\n\nEnormous talent and amazing work. Everyone is super friendly.",
            "Agreed. Visited today with my 10 y.o. daughter and she was in her element, the costumes were fantastic. She loves the Owl House and was beside herself when she saw a Luz Noceda cosplay (in Titan mode, no less). It was the first time Id ever visited a convention of any kind, positive vibes all round and we now both look forward to next years event!"
        ]
    },
    "Went out for a hike this morning in Lesmurdie Falls": {
        "title": "Went out for a hike this morning in Lesmurdie Falls",
        "score": 100,
        "url": "https://www.reddit.com/gallery/1dr2see",
        "content": "",
        "num_comments": 12,
        "comments": [
            "great walk, that one, me and wife do it often,",
            "Made the mistake of going there in April",
            "Good see water flowing not case with any creek around my place",
            "Wow, that's even cooler than Tas! Would love to go hiking there.",
            "Before or after the hike?",
            "Go in spring once the wild flowers have bloomed",
            "Stunning!",
            "Absolutely beautiful.",
            "Beautiful pictures.",
            "Ayyy cheers mate"
        ]
    }
}