{
    "Commonly posted joke thread": {
        "title": "Commonly posted joke thread",
        "score": 125,
        "url": "https://www.reddit.com/r/PeterExplainsTheJoke/comments/1b54nmt/commonly_posted_joke_thread/",
        "content": "To swap out our post on Loss, we've made a small thread that will grow over time to encompass jokes that are literally everywhere and have been reposted since the dawn of time. If you're going to make a post check the [thread](https://rentry.org/r_peterexplainsthejoke_megathread) first please otherwise your post may get shut-up-meg-ged. If you have any suggestions to be added let us know in the comments. ",
        "num_comments": 54,
        "comments": [
            "Make sure to check out the [pinned post on Loss](https://www.reddit.com/r/PeterExplainsTheJoke/comments/1472nhh/faq_loss/) to make sure this submission doesn't break the rule!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PeterExplainsTheJoke) if you have any questions or concerns.*",
            "This one\n\nhttps://preview.redd.it/gbmit0q1y0mc1.jpeg?width=960&format=pjpg&auto=webp&s=737982b27889ffecbfed49e9c72f6ab95a9171ee",
            "bro how is this loss\n\nhttps://preview.redd.it/5ucfveytlxrc1.png?width=599&format=png&auto=webp&s=4c3ec9a19543a17004ac8a35a99d65e15d4de381",
            "https://preview.redd.it/236t5yr2eppc1.jpeg?width=828&format=pjpg&auto=webp&s=ef9413ea543ecf53b2b1937c1aa7de1d418477cd",
            "Should this thread be pinned?\n\nAlso is there anyway for perhaps a proper list/redirectory? I imagine if this gets continually updated it would eventually be a chore to scroll down.",
            "acorn",
            "Well, looks like I have a new way of calling out spam",
            "Einstein Smoke Detector Joke\n\nI thought the joke was that Einstein was explaining the functioning of a smoke detector, some of which use the photoelectric effect to detect smoke. Einstein won his Nobel Prize for demonstrating the photoelectric effect and not for relativity, as most people would assume.",
            "Taylor Swift Jet",
            "https://preview.redd.it/6to7n26yqfxc1.jpeg?width=828&format=pjpg&auto=webp&s=981dbc3b78ab9ae7d8b853d72e5df34413fd872c\n\nThis woman.\n\nHer name is Sabrina Harman and she was a US specialist in Iraq. She commited warcrimes by partaking in the murder of Iraqi prisoners. She took a lot of pictures with several victims.\n\n[https://en.m.wikipedia.org/wiki/Sabrina\\_Harman](https://en.m.wikipedia.org/wiki/Sabrina_Harman)"
        ]
    },
    "Why everyone spamming this meme? - all explanations in one post": {
        "title": "Why everyone spamming this meme? - all explanations in one post",
        "score": 186,
        "url": "https://i.redd.it/7roc8ejgm47d1.jpeg",
        "content": "I count 12 post (lol)\n\nHere is explanations:\n\nMe: \n\nI was wrong :( - [post](https://www.reddit.com/r/PeterExplainsTheJoke/s/YzQsDDqREz) \n\nu/OzyOzyOzyOzyOzyOzy6\n\n“So on Youtube, there is a very popular group of youtubers called the Vanoss crew (Vanoss being the defactor leader of the group). Before Fortnite became a thing they were wildly successful making GTA V videos and, more specific to this post, GMOD videos. Most of them are still around and good friends with each other, and still successfully making videos, but their hayday was 2014-2018. This post with these specific characters are their character models from their GMOD videos.\n\nLink - Moo Snuckel (he recently announced he is stepping away from Youtube as a full time job, but is still friends with most of the crew)\n\nBuzz Lightyear - H20 Delirious\n\nDorito's bag - IAmWildcat (or just Wildcat)\n\nLuigi - Vanoss\n\nZoidberg -Dathi de Nogla (or just Nogla)\n\nFinn - BasicallyIDoWrk\n\nMario - Mini Ladd (he is no longer friends with anyone in the group due to purposefully distancing himself from the group and, most importantly, being outted as a pedophile)”\n\n[Post](https://www.reddit.com/r/PeterExplainsTheJoke/s/zdLxz2LJ4v)\n\nu/CipherWrites\n\n“ran out of time.\nthis is what I found\n\nSomething to do with Imod?\nMoo Snuckle (Toon Link), Daithi de Nogla (Dr. Zoidberg), H2ODelirious (Buzz Lightyear), VanossGaming (Luigi), I AM WILDCAT (Nacho Cheese Doritos), BasicallyIDoWrk (Finn from Adventure Time), TheGamingTerroriser (The Terminator)\n\nreferencing content creators”\n\n[Post](https://www.reddit.com/r/PeterExplainsTheJoke/s/UOV8RkXdwy) \n\nu/SinnerOfSloth779\n\n“Vanoss gaming crew, it is their old gmod models”\n\n[Post](https://www.reddit.com/r/PeterExplainsTheJoke/s/LsgKIm0X6I)\n\nu/BLAM-Boozled\n\n“Peter’s 16th Testicle here.\n\nI may be wrong but I think this refers to the Vanoss Crew. The Doritos and Mario are what giving me that idea.”\n\n[Post](https://www.reddit.com/r/PeterExplainsTheJoke/s/8BFqQCv8SZ)\n\n[Nothing](https://www.reddit.com/r/PeterExplainsTheJoke/s/1Qj2AKY1uB)\n\n[Same gmod](https://www.reddit.com/r/PeterExplainsTheJoke/s/O9TUjDRgii)\n\nu/Aidan_Baidan\n\n“Hey folks, avid videogame enthusiast Chris Griffin here.\n\nThese characters are relevant to one another through a YouTube channel known as Vanoss Gaming, which was largely popular in the mid 2010s for their Garry’s Mod and Grand Theft Auto V gameplay videos. In Garry’s Mod, the popular sandbox mod for Half-Life 2, there is a massive community workshop in which people can upload custom maps, weapons, and even player models. The recurring members of Vanoss Gaming’s YouTube videos used the pictured characters as their player models in-game, hence the joke of them being pictured in one place.\n\nChris Griffin out.” - good explanation 👍\n\n[Post](https://www.reddit.com/r/PeterExplainsTheJoke/s/fVT7TVoZHC)\n\nu/ChillyAmber\n\n“Vanoss crew but It’s probably also about how awful mini ladd was because he groomed some minors (he often used the Mario player model in gmod)”\n\n[Post](https://www.reddit.com/r/PeterExplainsTheJoke/s/ZLGh5XO1S8)\n\nu/Chiefdragonborn\n\n“Looks like an old meme from a [gamer](https://www.reddit.com/r/Vanossgaming/s/KNvtRSnbn4)”\n\n[Post](https://www.reddit.com/r/PeterExplainsTheJoke/s/WDOJg4RjfP)\n\n[Nothing](https://www.reddit.com/r/PeterExplainsTheJoke/s/wXk7vQwOPm)\n\nu/Solid-Positive6751\n\n“It appears to be the character models used by the Vanoss crew before they got their “official” ones in Garry’s Mod. Going left to right is Moo Snuckle, H2O Delirious, Uncertain/Maybe Terroriser, Vanoss, Daithi de Nogla, BasicallyIdoWrk, and Mini Ladd. The last one turned out to be a “pdf ophile” and was kicked from the group.”\n\n[Post](https://www.reddit.com/r/PeterExplainsTheJoke/s/znOKWgsBJn)\n\nUff \n\nWhy does almost everyone have an NSFW profile?\n\nPlease before you post something make sure no one else has created a similar post!!",
        "num_comments": 16,
        "comments": [
            "I’m stickying this one for a day or so because this is being reposted to a ridiculous degree today. Thanks for your service. o7",
            "That was the best explanation compared to the comment section I found it in. Thanks petah!",
            "OP of that image here, I honestly feel old now",
            "Before reading the explanation, I said Doritos bag. But now that I’ve read and learned this is about Vanoss Gaming…\n\nPablo…",
            "Peteah here, the meme here is that Peter is explaining the joke of a meme that people found obscure which Peter made sure to explain to the other people so that the fellow redditors understood what the meme was. Peteah out.",
            "Thanks, I was about to post this meme on the sub you just saved me some time.",
            "Can i get a ticket to pluto nash in 3D?",
            "Make sure to check out the [pinned post on Loss](https://www.reddit.com/r/PeterExplainsTheJoke/comments/1472nhh/faq_loss/) to make sure this submission doesn't break the rule!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PeterExplainsTheJoke) if you have any questions or concerns.*",
            "https://www.reddit.com/r/PeterExplainsTheJoke/comments/1dhwz2k/why_everyone_spamming_this_meme_all_explanations/",
            "Ah, no problemo, buddy! Just tryin' to do my part to make the internet a slightly less confusing place. Glad you liked it, hehehe! Now, if you'll excuse me, I gotta go see if Lois needs me to do anything productive... which probably means I'll end up watching TV instead. Stay awesome, pal!"
        ]
    },
    "Peter why is Dantes so pissed?!?": {
        "title": "Peter why is Dantes so pissed?!?",
        "score": 10296,
        "url": "https://i.redd.it/emnpgw31v08d1.jpeg",
        "content": "",
        "num_comments": 649,
        "comments": [
            "Make sure to check out the [pinned post on Loss](https://www.reddit.com/r/PeterExplainsTheJoke/comments/1472nhh/faq_loss/) to make sure this submission doesn't break the rule!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PeterExplainsTheJoke) if you have any questions or concerns.*",
            "Streamer and his girlfriend broke up, and streamers friend who he was in an argument with at the time leaked that his gf got an abortion. This is pictures from the stream they talked about it after it got leaked.",
            "Dantes and his gf broke up and this guy is making fun of both him and her. It's important to realize he's been clowned on a lot over the past few days about them breaking up but he's mostly only defending his ex, Lauren.",
            "And this is why your relationship shit should not be a public affair",
            "For one, that's fucked up. For two, I have no idea who these people are and I'm honestly not sure I want to",
            "Dantes broke up with his girlfriend because (at least from how he worded it) he wasn't ready for a relationship and felt he could not commit and give the same amount into it as his girlfriend was. He's angry because the guy is making fun of him and his girlfriend's sorrow",
            "Remember when r/outoftheloop used to be a thing instead of this sub? Where's the joke??",
            "Dante’s is straight?",
            "This isn’t a joke.",
            "I feel so bad for Dantes, not even ingame, like they matched so well together and they split because of mutual agreement, but assholes online will still do shit like this"
        ]
    },
    "Peetahhhh": {
        "title": "Peetahhhh",
        "score": 5598,
        "url": "https://i.redd.it/hkvlzgpcf08d1.png",
        "content": "I understand roughly the middle two but the others confused me?? Help? ",
        "num_comments": 216,
        "comments": [
            "Make sure to check out the [pinned post on Loss](https://www.reddit.com/r/PeterExplainsTheJoke/comments/1472nhh/faq_loss/) to make sure this submission doesn't break the rule!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PeterExplainsTheJoke) if you have any questions or concerns.*",
            "1. Hockey fan who went viral for flashing her boobs\n2. Hawk Tuah Girl\nhttps://www.reddit.com/r/PeterExplainsTheJoke/s/Rr1epxxV5Z\n3. Tiffany Gomas, a woman who went viral for yelling about another passenger not being \"real\" on an airplane. TMFINR meme lady.\n4. Maegan Hall,  who was fired for allegedly engaging in sexual acts with eight of her fellow police officers.",
            "[the sauce](https://www.reddit.com/r/HawnyContribution/s/9gnxkZwuYi)",
            "1st flashed boobs at hockey game \n2nd talked about how to give a really good blow job\n3rd idk\n4th was kicked off the police force for having\norgies at work.",
            "Pic 2 ..hawk tuah will be head coach.",
            "Who's the first girl?\n\n\nHawke Too girl\n\n\nGirl on plane talking to invisible man\n\n\nCop who had sex with other cops and got a massive settlement because of the harassment",
            "Women from internet memes",
            "Charlie's Angels only had 3x ladies.",
            "You son of a b$&!h, I’m in.",
            "https://preview.redd.it/5h03mcmzn18d1.png?width=628&format=pjpg&auto=webp&s=6b1b4c9034a828ae63b9e7560148c8042c4a73e9\n\nThat's it I'm white-boying your megamind"
        ]
    },
    "Who is this and why do they want her dead? ": {
        "title": "Who is this and why do they want her dead? ",
        "score": 3315,
        "url": "https://i.redd.it/qkmrx1xhe08d1.jpeg",
        "content": "",
        "num_comments": 172,
        "comments": [
            "Make sure to check out the [pinned post on Loss](https://www.reddit.com/r/PeterExplainsTheJoke/comments/1472nhh/faq_loss/) to make sure this submission doesn't break the rule!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PeterExplainsTheJoke) if you have any questions or concerns.*",
            "Bob Ross was a famous, popular and generally well-liked artist known for starring in his own show \"The Joy of Painting\" and his positive, inspirational attitude. He's still used in modern Internet communities as an example of kindness and wholesomeness.\n\nKaren here implied that he was not a good artist (as he doesn't have a g in his name). Speaking ill of such a beloved character and in such a gratuitous manner is bound to go poorly to say the least.",
            "Don’t worry guys. after this tweet, she probably had a follow up one that says “the Bs in ‘bob Ross’ stands for best artist”",
            "Bob would say it’s not about being a good artist, it’s about relaxing, learning, and having fun.  We don’t make mistakes, we just have happy accidents.",
            "https://preview.redd.it/f8v5lzm8t08d1.jpeg?width=1080&format=pjpg&auto=webp&s=b56da0767bdbffcb72ee7ee76cc9f49d508a06e2",
            "https://preview.redd.it/9s2fmur0c18d1.jpeg?width=469&format=pjpg&auto=webp&s=9c9d57cd58a52bf2117a3bd75a58c1dfce159be0",
            "The Karen tried to make a joke by saying that Bob Ross is not a good artist. she said the g stands for a good artist and he doesn't have a g",
            "Every episode of “The Joy of Painting” is available for free on YouTube https://youtube.com/@bobross_thejoyofpainting?si=kdXw2FmILrL37OG0",
            "Hating Bob Ross is akin to hating puppies or kittens. Says much more about the hater than anyone else.",
            "People love Bob Ross and think he’s a great artist, myself included"
        ]
    }
}