{
    "Rule 1 reminder": {
        "title": "Rule 1 reminder",
        "score": 11,
        "url": "https://www.reddit.com/r/Pets/comments/1cj64vd/rule_1_reminder/",
        "content": "We understand that feelings about pets run high and that there are conflicting viewpoints on standards of care, but we must still ask that comments remain civil and refrain from directly attacking other users. If you find yourself in a dispute that has reached a point of no longer having anything to do with pets, we ask that you disengage from it. We also encourage all users to report incivility and harassment, whether it is targeted at you or someone else, to bring it to the attention of the moderators. Comments found violating Rule 1 will be removed and repeat offenders may be subject to loss of posting and commenting privileges.\n\nThank you for your understanding and cooperation.",
        "num_comments": 1,
        "comments": [
            "Rule 1:\n\nPosts and comments that are rude, vulgar, harassing, advocating for cruel actions, and/or are not contributing positively to the discussion will not be tolerated.\n\nDo not instigate users who are breaking the rules. Please report them instead."
        ]
    },
    "\"Can you walk your cat somewhere else?": {
        "title": "\"Can you walk your cat somewhere else?",
        "score": 197,
        "url": "https://www.reddit.com/r/Pets/comments/1dqus0g/can_you_walk_your_cat_somewhere_else/",
        "content": "Hi all,\n\nI don't post in this subreddit often; I mostly lurk. Not 20 minutes ago I was out with my 14 year old tuxedo cat Ferb - I'm visiting my fiance in Wisconsin, a *world* away from where I was born and raised, which is New York, NY.\n\nBefore I embarked on the 13 hour drive here, I made the decision to bring my two babies - 14 year old tuxedo boy Ferb and 8 year old cow cat Peppa (I have pictures further back on my profile).\n\nWhere my fiance lives, it's common to see 4ft+ tall cranes wandering around on the property (as well as tenants walking their dogs). I thought I might as well take Ferb outside to go gawk at the birds.The weather was okay today, so I thought I'd put a harness on Ferb (he has all his flea & tick meds too) and take him outside.\n\nNot even 15 minutes into being outside, walking Ferb on the sidewalk, one of my fiance's neighbors opened her door and (in my opinion) *yelled* at me rather rudely, saying \"Can't you walk your cat somewhere else?\" followed by some dogs barking from within her residence.\n\nI am from NYC/central/upstate NY, and I have never been reprimanded in public like I just was for *walking my senior cat*. Am I really disrupting the neighborhood when I walk Ferb? I feel like he doesn't even do anything - he just sniffs the brick walls and then meows at me after 10 minutes so he can go back inside. I'm kind of upset over this encounter.",
        "num_comments": 90,
        "comments": [
            "Don’t be. That lady was completely out of line. It’s her own fault she can’t control the reactive behaviors of her dogs. Dogs bark, sure, but if it’s to the point you feel the need to harass neighbors, maybe you should have trained your dogs better. This coming from someone with 3 big dogs and 2 cats.",
            "Her barking dogs are her problems, not yours.",
            "Honestly some dog owners can be the worst and I’ve had similar comments whilst walking my cats. Usually I just tell them “no, I’ve got as much right to enjoy nature with my cats as you do with your dogs” then just carry on walking. Disregard them and continue giving your cat the enrichment he deserves ❤️👏",
            "I’m so sorry this happened to you! As someone who grew up in Madison, I apologize on behalf of my fellow Wisconsinites and Madisonians. That woman had no right to blame you or your lovely cat for her dogs being ill-behaved and badly trained. That’s on HER. \n\nYou are absolutely allowed to walk your cat. Pay that awful woman no mind. Give her the biggest, most sympathetic, most Midwestern passive-aggressive “Oh my gosh, is that *your* dogs making all that ruckus? Oofdah, that must be so *hard!* I feel so lucky that Fluffy McPurrshanks III here is so calm and quiet in the house” and carry on with your glorious self.",
            "Yeah - this isn’t your problem.  She needs to train her dogs.     \n\nA few months ago, someone posted a picture of their newly acquired kitten alongside a handwritten note from a neighbor that had been stuck to her door - asking her to not allow the kitten to look out the window as it was causing the neighbor’s dogs to bark.   😂",
            "I have a reactive dog who would absolutely love to eat a cat, and we’ve passed folks walking their cats before. Instead of yelling at them for existing we just crossed the street. More than anything, I would be glad the cat had a human who cared enough to have them on a harness so they could enjoy the world safely!",
            "Your cat was on a harness, supervised, and on public property outdoors. You were being responsible and respectful to others. It isn't your fault her dogs bark.\n\nI own a dog who barks at animals who walk by our house, and I would never blame the people just walking their pets for her noise. Because it isn't their fault.\n\nYou did nothing wrong.",
            "It sounds like she doesn’t like cats. I’d ignore it, unless you want to be a smartass and ask, “Can’t you control your dogs?” 😉",
            "Don’t let the turkeys get you down. Enjoy your walk.  Enjoy life. \n  She can train her dogs not to bark at cats.  😻😻",
            "Just tell them to mind their own damn business"
        ]
    },
    "i got bit by a goldendoodle today ": {
        "title": "i got bit by a goldendoodle today ",
        "score": 9,
        "url": "https://www.reddit.com/r/Pets/comments/1dr1fxq/i_got_bit_by_a_goldendoodle_today/",
        "content": "The title pretty much sums it up. I was at a friends, sitting down and eating, minding my business. He is dog sitting a 1.5 y/o golden for the week.\n\nI was minding my business, eating a chicken sandwich, and the dog was howling at me for food. \nI ignored her. She decided to chomp the side of my ass. It was more so a play nip than an aggressive bite and she immediately let go when I vocalized pain, but it still broke the skin. I have three tiny, and very painful puncture wounds. \n\nWe were able to verify with the vet that she had all her shots, including rabies. \n\nI would like to remind everyone that it is super important to seek medical attention after a dog bite, as they are very prone to infection. I needed a tetanus shot and I was sent home with antibiotics as a precaution, and a healthy dose of embarrassment for having to go to the ER i work at to show some of my coworkers my behind. \n\nI would also like to remind everyone that breed specific legislation is dumb. \n\nGoodnight !",
        "num_comments": 2,
        "comments": [
            "Thanks for sharing! Hope your butt is okay",
            "That doesn’t sound like a play nip. Dogs tend to have pretty good bite inhabiting when they don’t intend to cause harm. The dog is poorly behaved is she howls and bites someone because they won’t give her their food. I hope your friend declines to ever watch her again. She is a liability."
        ]
    },
    "My dog has to be put down, but I’m afraid to make the call. ": {
        "title": "My dog has to be put down, but I’m afraid to make the call. ",
        "score": 98,
        "url": "https://www.reddit.com/r/Pets/comments/1dqjoi9/my_dog_has_to_be_put_down_but_im_afraid_to_make/",
        "content": "She is my best friend. I don’t know how I’m going to live life without her. \n\nI’m terrified of my mental health, the future. \n\nCan anyone try to make it makes sense to me?",
        "num_comments": 107,
        "comments": [
            "I had a dog for 18 years, he was like the other half of me, he never caused me any trouble, he was just my best friend. I knew about a month before I had him euthanised that it was time, but I kept him going on painkillers. He wasn't eating much so he was losing weight, he couldn't manage stairs any more so I was carrying him up and down at bedtime, he couldn't handle heat and it was summer so I was out with him at 4am sluicing him down with cool water so he wouldn't overheat, basically I was desperately trying to keep him alive because I wasn't ready to let him go. \n\nOne morning I carried him out into the garden (we have steps) and he just stood in the grass and gave me this look and I knew he was done, he just didn't have it in him to keep going any more. I had him PTS that afternoon and in the months that followed I realised that it would have been kinder to let him go long before I did. \n\nWe had another second dog at the time,  younger, and unfortunately two years later he was diagnosed with an untreatable cancer. We knew he had a matter of months left, so we kept him comfortable with meds and 1.5 months later he started having attacks of irregular breathing and shaking. He was very distressed in these moments, so my partner and I decided to give him one last good day. We booked his euthanasia for the afternoon and then we took him to his favourite park and walked around the lake and he had a feast of his favourite foods, then I took him to the vets and said goodbye. He'd never known suffering in his life and I didn't want him to suffer at the end.\n\nI was with both my boys, holding them and whispering to them as they went. It's incredibly sad, I have tears running down my face as I write this 6 years later, but I only have guilt about my older dog, as I let him experience suffering, I wish I'd let him go sooner and I won't make that mistake again.",
            "I had to do it a few days ago. I was an absolute mess but i had to tell myself how the decision is a practical one, not an emotional one. She was in pain and I couldn’t make any selfish decisions to prolong her life. My husband consistently talked sense into me and now I’m just grateful her and I were able to share a life together. It will hurt non stop. But it’s for the best, I promise you",
            "I don't think anyone can really make sense of it. She is your best friend, and you will always love her and she will always love you. I guess all you really need to do is just separate yourself from the emotional and the logical part. If she is in pain the best thing to do is to let her go. Be with her until the very end don't leave her alone in those final moments.",
            "It’s one of the hardest things you will ever do. But we have to do what’s right for them. Don’t prolong any suffering of hers to ease yours. I had to put my boy down a few years ago. His quality of life just wasn’t there any more. He was having difficulty walking and also wasn’t realizing when he needed to use the bathroom. It was not a dignified existence for him. \n\nI struggled picking up the phone to call the vet, I would just burst into tears. Instead I emailed them to ask some questions about cost and cremation. Once I had a little more information, a few days later I was able to muster the strength to make the call to schedule the appointment. I made it for a week out so I could have time to say goodbye to him properly. Spoiled him to the max every day. I’m starting to cry even now just thinking about it. He was 16 and I loved him so much. We had a lot of good years and adventures together. \n\nIt’s going to be tough, but you’d rather do it too soon than too late. You’ll need time to heal. Eventually you will probably be ready for another pal. They will help you continue healing. Mine sure did.",
            "Honestly it will be fucking hard and you’ll need to have a good support system of friends and family and therapy. But you have to think about what’s best for your dog. She’s in your care. You need to do right by her and get things in order to make sure you also can take care of yourself and then brace yourself for the grief.",
            "I'm really sorry you're going through this. I just had to do it to my girl of 16 years a couple weeks ago. But having let my childhood cat pass on his own about a decade ago, *not* making the call can be a lot worse.\n\nMy dog got to ride into the office in her padded wagon after a couple days of lots of special treats. One little stick that she didn't even react to and she probably felt the best she'd felt in her entire life before the vet did the final shot. The day of, I mostly just felt relief that she was no longer struggling. \n\nIt hurts really bad, but her last day was so nice and peaceful and I'm glad I could do that for her.",
            "As hard as it is, the most selfless thing you can do for your dog is put them down and end their misery. I had to wait and cry for 2 months watching my dog deteriorate and suffer because the vet said ‘he still eats and has good days’. It was horrible watching him suffer and it was horrible putting him down. But in hindsight i did him a favor and should have put pressure on putting him down even sooner. I told myself i’ll take time to get another dog, was on valium and my mom came over so i don’t do anything stupid to myself. What helped me, a month after i put my dog down, i paid a deposit for a puppy. It brought me to life to wait for my dream puppy. I still get sad thinking about the old one (i actually told my new work colleague about him today so i take it as a sign he is checking up on me) and no one will replace him. It’s been 5 years already. I have his urn and talk to it sometimes when my dogs annoy me. I wish you all the best OP, bit do what is best for your dog, it’s the last show of your love to it ❤️",
            "I had to have my 18 year old cat euthanized a couple of weeks ago. I agonized for weeks about the decision, and I cried all day when he died.  I found myself going to clean the litter box every day afterward, so I started searching the local animal shelters for older cats.  I just adopted a bonded pair of 10-year-old cats who had been living in a cage at the shelter for seven months.  Not everyone is emotionally ready to adopt so soon, but I am very happy to two new kitties in my home. They take turns sitting on my lap.",
            "You should think about her perspective. Let her die with dignity. It would be cruel to draw out her death and cause her to suffer because you are afraid of making that choice. It's hard, but it's necessary.",
            "Its definitely the hardest and most selfless decision you have to make when it's time. If your pet has no quality of life left or are in pain, it's time to let them go. It hurts to do but it's for the best."
        ]
    },
    "how long should i keep my 10 week old kitten in her crate over night": {
        "title": "how long should i keep my 10 week old kitten in her crate over night",
        "score": 5,
        "url": "https://www.reddit.com/r/Pets/comments/1dr3d0j/how_long_should_i_keep_my_10_week_old_kitten_in/",
        "content": "my partner and i keep the little girl in a crate overnight next to our bed, with a litter box, comfy bed and water bowl. today i’m cat proofing the bedroom as it’s not her primary room. Just curious about what age she can safely roam our bedroom bathroom and mini living room overnight unsupervised. older cats have the larger main living room, kitchen, main bathroom, dining space and laundry as we are doing a slow introduction.\ni don’t mind having her in the crate over night as she knows it’s bedtime and settles down when we set it up in our room, but i also don’t want to keep her in it for longer than necessary as i want her to have fun and be a cat not trapped in a box",
        "num_comments": 1,
        "comments": [
            "How long have you had her? She should have free reign over at least one room if you've had her for a week. Introduce her to the other cats quietly, and slowly, and everything should be fine."
        ]
    }
}