{
    "My ex husband screwed himself out of a grand life": {
        "title": "My ex husband screwed himself out of a grand life",
        "score": 1475,
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1dlnoi4/my_ex_husband_screwed_himself_out_of_a_grand_life/",
        "content": "I don't browse Reddit often, but I do listen to r/slash at work, and some of my favorites are from here. I have a story that isn't too terribly crazy, but definitely fits here. \n\nMy ex husband was a PROBLEM. I didn't mind the myriad of health conditions he had, but the fact that he refused to take care of himself was the real issue. Especially when his problems caused me to lose the very little sleep I was going to get. \n\nI worked for a terrible corporate security firm that really doesn't care about its employees. I was the single field supervisor in my region, and on top of my regular 40 hour work week, I also was called on emergency to fill open positions. This was during the height of covid as well, which eventually put me at a regular 80-100 hours per 7 day work week. The money was incredible, but I was miserably exhausted. \n\nAt the time, my husband was working part time and receiving SSI, and spending all of his income on himself. Video games and fast food, against his doctor's orders, while I paid both of our shares of the bills, car payment, insurance, phones, etc. This went on for about 3 years, getting progressively worse as time went on. \n\nDespite the amount of money I covered for him, I still managed to bump my credit by paying off my car and saved enough to buy a house. Nothing too fancy, but it's a 2 story with an unfinished basement, plenty of space, decent sized yard, creek, and really cool neighbors who constantly invite us over to drink and play pool. \n\nWhile moving, I was still working 80+ hours and couldn't spare time to help much, but I paid for the moving truck and dinner for anyone willing to help us pack up and move. I asked my then-husband to make sure everything gets packed. \n\nHe packed ALL of his own belongings, then the household furniture, then ignored whatever didn't fit, was late returning the moving truck, and I had to call about the fee (which they were very kind enough to waive considering my circumstances). \n\nThe result was that the majority of my stuff, my roommate's stuff, and my brother's stuff didn't fit in the moving truck. My brother was making trips every day after work to pick up a car load and bring it home. I asked my ex husband to please do the same, and he agreed. \n\nTHREE WEEKS LATER I finally got a day off. I worked a 12 hour shift and planned to go pack up a few boxes and take them home while I was out. I walked into the house and saw that my ex had literally done nothing. Three weeks he said he had been moving our stuff and he hadn't touched a thing. \n\nI had a meltdown. My legs gave out from shock and I sobbed on the stairs. \n\nMy roommate and best friend happened to also come in right after me, and found me on the stairs. He held me while I cried and assured me he would take a few days off to get everything packed up and moved. He told me to go home and sleep, but I told him I'm already here so I might as well take a few boxes, since my worthless husband lied to me about doing so. He helped me pack up some things and I drove home. I didn't even bother to unload it, I went inside and collapsed on my bed and cried myself to sleep. \n\nHours and hours later, I finally woke up, a groggy mess, and made my way out to my car to start unloading. Best friend was there unloading his own car with a tired smile. He had been going all day and the sun was setting. Meanwhile, my husband was slacking off in the basement doing who knows what, breaking his promise. \n\nWe managed to get everything moved, but I had to extend the lease by one week and pay a prorated rental cost, all due to my husband's neglect. I was quickly racking up anger at him, and finally when we were moved, I sat him down and told him how angry I was about the lies and his laziness and what he caused. He started accusing me of all kinds of things in return, like how I wouldn't passionately hug him because of his medical issues. \n\nI lost it. \n\nI screamed at him that I don't passionately hug anyone, I don't even passionately hug myself, because  I'm working the equivalent of 2 jobs with overtime to support his lazy butt and pay for his lifestyle because he wastes all of his money on fast food that he shouldn't even be eating and video games, and because he doesn't lift a single finger to do anything around the house like unpacking, cooking, cleaning, nothing to make my life easier. In fact, he is actively making my life harder. I'm still cleaning up after him when he leaves dishes everywhere and stains in my carpet. So no, I don't want to passionately hug him if he's not going to do anything to earn it. \n\nHe went radio silent on me for two weeks. It got progressively worse. He wouldn't text me or speak to me, wouldn't answer my calls, and eventually wouldn't even look at me. Meanwhile, he's still living off my money. So finally one day I message him to ask him why he's treating me this way, and he ignores me. I ask several other questions, nothing. Finally, I tell him that if he hates me so much, he should just divorce me. \n\nHe tells me the next day he wants a divorce. \n\nI ask him why. \n\nYou're not going to believe his answer...\n\n\"You don't do enough for me.\"\n\nOH BOY DID HE MESS UP. \n\nI tell you, this ding dong is the absolute most obtuse, smooth-brained, intellectually deficient, situationally unaware, half-witted, opossum-brained clod to say that. \n\nI unleashed it. \n\nI told him that I do EVERYTHING for him, I pay for EVERYTHING so he can live the cushy life, I give him a roof over his head, food in his belly, money in his bank account (because at this point I was also giving him extra money whenever he asked), and taking days off specifically to spend time with him, that I was doing absolutely EVERYTHING for HIM, and this is the repayment I get. I got extremely quiet and bucked into his chest, pointing my finger at his face, and told him that since he wanted the divorce, he had to file, and if he even suggested at forcing me to sell my house that I paid for, I would destroy him. I would hire an expensive lawyer, force him into the longest court battle of his life, and take him for every single penny he would ever earn for the rest of his life along with court costs. Then I kicked him out. \n\nHe moved out. He told me he was moving in with his family a few cities over and asked me to file. I filed in my county because it was closest. \n\nHe RAGED at me when he found out. He wanted me to file online and pay an extra $270 out of MY pocket (since he expected me to pay for the entire thing), and I told him no. \n\nA few days later I got a strange text from him that didn't sound like him. I argued with him, then a confession was made: it was his GIRLFRIEND. He had lied to me AGAIN and moved to New York from Georgia. She went psycho on me and screamed at me via text about how aboosive I am. Long story short, we argued and I told her I wouldn't be speaking to her again, I am filing in my county because I already started the process, and I'm not changing my mind because he lied to me. If he hadn't lied, I might have been willing to file online, but I'm definitely not now. \n\nMonths go by and finally the date comes. She drove him to Georgia, and they were 15 minutes late. I knew this because I was 15 minutes early, and the clerk asked if I could contact him, so I went outside to do so. I saw her roll up. I told him she's not allowed inside due to covid restrictions, but honestly I wouldn't have let her inside because I hate her. He nodded and up we went. We spoke to the clerk and started our paperwork. I have some legal knowledge (definitely a ton more than him) due to curiosity and things that have happened to me in the past, so I knew which questions to ask. \n\nI know how lazy this brat of a human is. He HATES doing ANYTHING he doesn't have to do. So I reminded him in front of the clerk that he still had property at my home, and I want it out of my house. The clerk told him that anything he leaves on my property after a certain date will legally belong to me, and there will be no way of getting it back without my express consent. He asked if he could work something out with me, and I told him no, you'll have to adhere to these legal guidelines, and anything left afterward will be forfeit. \n\nNow, while we were together, his blessed mother (may her soul rest in peace despite her son turning out to be worthless) passed. I LOVED that woman. She was a saint. And I wanted something of hers to remember her. He had inherited her dining rug. While not worth a lot monetarily, it is still a lovely black and red antique. And I knew he couldn't afford to ship it, nor could he afford to rent a moving truck, nor could he fit it in his girlfriend's tiny crap car. So while he was crying and loading up his mother's belongings, all of which he had left behind when he left initially, I told him I'm keeping the rug. I said this flatly and without feeling. He tried to argue, so I pointed out the obvious, and he conceded. He knew I was right. \n\nThat rug is one of my favorite belongings. I've begun renovating our unfinished basement and it currently resides in a lovely guest room that houses my bookshelves, armoire, king size bed, and 55 gallon fish tank that is not yet home to anything. \n\nAnd for even more good news, I married my best friend and we've been together for nearly 4 blissful years. On our 5th anniversary, he has agreed to a ceremony, since we were married in a simple ceremony with only two witnesses. \n\nAnd for more petty revenge, I still have my ex's childhood art binder (which he cherishes) and I will continue to hold it until he pays me back the $400 he owes me for the brand new tires I put on his car a mere few weeks before he decided he wanted the divorce. It's been over 4 years, man. I'm never giving it back at this rate. And I do send him annual reminders. ",
        "num_comments": 85,
        "comments": [
            "The DEFINITION of petty revenge! \"This is small enough you can't fight me on it but big enough it will sting you forever.\" Bravo! I hope you are in a much better place right now, living your life for you, and keeping your toes warm on a rug best served cold.",
            "At some point, this becomes a comedy, it's so absurd how lazy this guy is...",
            "And the rug really ties the room together.",
            "Love is blind",
            "Me supporting a worthless bum would have lasted  all of one month IF THAT.  But sure as hell  not 3 years. I can only imagine how much more money you would have had  in your  pockets if you had gotten rid of that useless prick sooner. But all's well that ends well. I hope your new husband is more of a partner than a burden.",
            "Lol at not being \"passionately hugged.\" \n\nIt always amazes me that men like him (I'm lucky enough to be married to one of the good guys) dont realise how this type of behaviour makes them appear weak, childlike and therefore completely undesirable sexually. Cleaning up after a selfish slob does not inspire much passionate hugging.",
            "You're awesome for how you handled all of this but I want to give the advice to just throw out the art book and be done with it. Stop letting him live in your head year after year. Or at least tell him it's the last chance, give him the opportunity one last time and then throw it out like you threatened. Follow through.",
            "Glorious pettiness! He sounds exhausting.",
            "Somethings doesn't add up, you divorced your ex during covid, but then you married your boyfriend at 5 year anniversary?\nEither dates are mixed up, you had an affair or story is fake.",
            "What in the world is slash? I love a good gatekeep."
        ]
    },
    "Keep pestering me to tie into my fence? Say goodbye to the fence!": {
        "title": "Keep pestering me to tie into my fence? Say goodbye to the fence!",
        "score": 1728,
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1dllccj/keep_pestering_me_to_tie_into_my_fence_say/",
        "content": "A previous home I owned had previously been rented, and that tenant had thrown up a quick little chain link fence for his dog. Had the corners right at the corner of the house, just a quick fix that got the job done. I don't have a dog, so fence, no fence, didn't matter to me.\n\nThe DAY I moved in my very young neighbor came over and asked since she ran a daycare from her house (that was a whole other nightmare) she'd really like to put up a fence, and to save money could they just tie into mine and save the cost of fencing an entire side of the fence. \n\nNow, I may be younger, but I'm not dumb. I knew that if they did that they would be fencing in part of my property, and after a certain number of years with their maintenance of it they would then own that property between our houses. Now, we're not talking alot here, the houses were maybe 15 feet across, but if they did that they would own everything up to the edge of my house. Even my air conditioner unit would be on their \"property\". So, I told her this, and said no, she cannot now or ever tie into the fence. \n\nMentioned that interaction with my realtor, and she about threw a fit- seems this person tried asking her the same thing and she told her the same thing.\n\nNow if this was just a one time trying her luck thing it wouldn't be a big deal, but she kept asking off and on for a few years, and I kept saying no. Even the husband came over to ask, maybe to intimidate a single woman? Still said no.\n\nI even did the research, and got the actual property line map that showed exactly where our property lines were.\n\nOne day I saw a whole bunch of chain link fencing in their back yard....but not nearly enough to fence all the sides they needed to do. They were going to try and tie in anyway, despite me repeatedly telling them no.\n\nSo, that night I took down, rolled up the fence, and dug up every single fence post.\n\nNow the neighbor had to come out and watch the kids she was supposed to be watching, because my fence wasn't there anymore so the kids had more avenues to escape. Plus, it took them a bit longer to order more of the chain link fence and posts they suddenly needed.....\n\nWhen I sold the house I gave the new owner, a single man, a care package which included the official property line map and a note to watch those neighbors like a hawk. My realtor (yep, same one, I loved her so much I used her again) knew the ENTIRE story and gave him the run down as well. ",
        "num_comments": 46,
        "comments": [
            "I was like why would you mind till I understood the situation. Good job",
            "My little black heart loves this story.",
            "I'm overly impressed with you digging up every post!  Nicely done  :)",
            "Good for you. Adverse Possession ain't nothing to fuck with.",
            "Dug up every post? My 55 yo lady bones ache at the thought.  I couldn't have done it",
            "Quality heads up for the next\nperson. Love this",
            "I would fence in up to my property line and screw these games for good.",
            "They were hoping that someone would be stupid enough to end up accidentally 'giving' them free land.",
            "Wow I'm glad my neighbours aren't dicks.  I put up a dog fence using only a small part of my yard and the corner of the house as well but judging from where my neighbours and I mow our lawns everyone is keeping the boundaries where they should.",
            "Gave me happy goosebumps"
        ]
    },
    "Selfish husband never knew": {
        "title": "Selfish husband never knew",
        "score": 4824,
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1dlefcj/selfish_husband_never_knew/",
        "content": "My now ex husband was very selfish- always putting his wants before mine. He was also a hypochondriac. After we started dating, we decided to move in together and he insisted I rehome my cat because he said he was allergic. I don’t think he was allergic, but I think he believed he was so I stupidly rehomed my cat. Fortunately, I found a very good home for her, so I’m OK with that, but it was incredibly selfish for him to, ask me to do that  \n\nAfter we were married he suddenly decided he was allergic to our goose down pillows and comforter. I loved them! I tried to argue with him telling him that we had been using these for over a year, so how could he suddenly be allergic and he just got very angry and told me I didn’t care about him.  \n\nSo I went to bed Bath and beyond and bought hypoallergenic, pillows, and comforter. I made sure he knew I had done this, and I put the pillows on the bed and the comforter in the duvet cover.  The next day when he wasn’t around, I replaced them with the real thing I had hidden in the closet and took the cheap stuff back to the store since I had left the tags on.  We were together for several more years and he never knew.  ",
        "num_comments": 161,
        "comments": [
            "Fuck him.  I would've rehomed him and kept my cat.",
            "this might just be me, but I get the feeling that his \"hypochondria\" targeted only your stuff. your cat. your pillows. glad he's an ex.",
            "He should have been your ex 3 seconds after asking you to rehome your cat",
            "Interestingly, if he ever helped change the sheets this revenge wouldn't have worked",
            "I was dating a man once, we were in our early 40s. I had a golden retreiver who I had for about 8 years. This asshole demanded I get rid of my dog because he was not a dog person. He had this ratty, vicious cat that was just nasty. It dripped, oozed, snotted, coughed up wads of fur all the time and farted constantly. I did not demand he get rid of his cat. Yall know what I did? I DUMPED HIM. Fuck him, what kind if human monster demands I throw away a loving, selfless pet that was my constant companion and my great comfirt for almost a decade?  My dog was far, FAR better that that guy was. Piece of shit....",
            "Never should have married the bum.  He let you know who he was with the cat.  I was allergic to dogs dating a woman with a dog.  Would never have asked her to do anything with her dog - not that she would have - to accommodate me.\n\nHappily enough, allergies can change, and I'm no longer allergic.  I brought two dogs and my wife brought one dog into our marriage and neither one of us can fathom the concept of telling the other to get rid of an animal.  Never gonna happen....   as an answer to both 'would you ever ask someone to get rid of a pet for you?' or 'would you ever get rid of a pet for someone?'",
            "My(16f) dad(41m) claims to have an allergy to animal fur. I got a kitten a few years ago (think shortly before COVID), and he frequently abused my poor baby. Kicked him down the stairs, refused to feed him while I was at school, and even locked him in the bathroom. My mother made me bring my poor baby boy to an animal shelter, since he was \"causing stress for my poor dad\".\n\nI went back to readopt him a few months later, only to find out he had been euthanized. I was heartbroken.\n\nNarcissists will never change. Good on you for dumping that man!",
            "It’s about control.  Really gross.\n\nI mean, if you are sneaking back a down comforter and returning the other…that’s not healthy.  I’m sad you had to live with him for 7 more years.  \n\nHopefully you are happier now (how could you not be!)",
            "I had a friend like this. She insisted she was allergic to various things, but would apparently overcome those allergies when she really wanted something. She was allergic to gluten, but ate bread and drank beer. She was allergic to dairy, but would eat ice cream. One day, I told her about a relative with a gluten allergy who had a pretty severe reaction after mistakenly eating gluten. \n\nMy friend was furious with me, because I was apparently insinuating that her allergies weren’t real. (😈 Maybe I was). But her reaction was over the top. I think people lie about things like that partially to satisfy a need to be special.",
            "You argued with him about the blankets and pillow but not about the cat???"
        ]
    },
    "Fired but could work for one more month, they have free tampons in all bathrooms.": {
        "title": "Fired but could work for one more month, they have free tampons in all bathrooms.",
        "score": 1518,
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1dlicio/fired_but_could_work_for_one_more_month_they_have/",
        "content": "So my job decided to fire me but asked me to work for a full month before I left. I actually did appreciate the heads up and continued to work and get paid. I did not agree with their reasons, too many absences, I had doctors notes for all absences and informed them at my interview that my son has health conditions that would regularly require my presence. They were understanding at first but then decided to let me go. Well, all the bathrooms have free tampons and pads so every day for the past month I have grabbed about three to five products from multiple bathrooms. Now I have saved myself about $50 in feminine products. Super petty and may not even be considered revenge but a penny saved right?",
        "num_comments": 69,
        "comments": [
            "Good petty revenge but moving forward you should consider applying for FMLA as soon as you are able once you get a new job. It has some requirements to qualify so check those out.",
            "I thought this was gonna be about you using the tampons to block their pipes or something... well no harm in taking what's already free I guess!",
            "Confession: I quit a toxic warehouse type job to move across the country. Guess who didn’t buy any packing tape themselves when it came time to pack up the house…",
            "Good job! I probably would have started using my big big purse and attempted to clean out one bathroom daily of its feminine products. They’re expensive.",
            "The evil twats will never notice",
            "*panty revenge",
            "Hell yea!\n\nI worked at a company that had this perk, and I took home a lot of tampons during my time there. It's been over 2 years and I haven't needed to buy tampons.",
            "... but did you make it a truly douche move?    ;-)\n\n(OP did not mention if douches were part of the freebies)",
            "You should ask for an ada accommodation since it’s a dependent.",
            "Next job you get, get everything in writing."
        ]
    },
    "I've never told anyone this story. He told me I couldn't use women's body wash. I've been using it for 20 years now.": {
        "title": "I've never told anyone this story. He told me I couldn't use women's body wash. I've been using it for 20 years now.",
        "score": 2702,
        "url": "https://www.reddit.com/r/pettyrevenge/comments/1dlbu2a/ive_never_told_anyone_this_story_he_told_me_i/",
        "content": "This probably stretches the limits of \"petty\" and \"revenge\" but I'm going to post it any way. I've never told a single person this story because it's so stupidly petty...\n\nAround 20 years ago when I was in college, my girlfriend (girlfriend then, she's now my wife) and I had plans to go to a nice dinner in our parents' hometown. I had another commitment during the day that was going to leave me sweaty and dirty (I don't remember what it was, but I remember REALLY needing a shower before going to dinner). So the plan was that I would finish up during the day, meet her at her parents' house where I would quickly shower, and then we'd leave for dinner.\n\nAfter I got done, I went to their house. My gf and her parents were asking me about how things went. All I remember is feeling so insanely dirty that I didn't want to stand there talking to them because I was sure that they could smell me from several feet away. I continued to inch my way up the stairs where I knew I would be showering. \n\nWhen I felt like I could safely leave the conversation without being rude, I asked my gf, \"you have soap/shampoo/etc up there that I can use to shower?\" \n\nShe said, \"yup.\"\n\nThis is when her dad (my now FIL) literally jumped up out of his seat saying, \"no, no no, let me find you some men's soap, you don't want to use her soap!\"\n\nI quickly tried to stop him as I REALLY didn't care. I just wanted to shower. He insisted. So I stood there halfway up the stairs for a few minutes, desperately wanting to go up and shower while he rooted around in his bathroom trying to find some manly soap.\n\nHe eventually found something, handed it over, and I went upstairs. Being annoyed at 1) his overall insistence that I couldn't possibly use soap that wasn't intended for men and 2) having to wait longer to take the shower, I decided I was going to be petty and use my girlfriend's soap any way (TAKE THAT!)\n\nBut the actual petty revenge continues to this day. Her parents still live in that same house and we still live in a different city. So every time we go back to visit, we stay at their house. We still use that same bathroom when we go back. And that bathroom is always stocked with both \"manly\" and \"girly\" body washes. \n\nGuess who uses the girly body wash every time I'm there? Even though I prefer the scents of the manly stuff. Even though not a single soul knows about how I was wronged or the revenge that I've been exacting for 20 years now...",
        "num_comments": 153,
        "comments": [
            "If it was me in that situation I would've found the girliest strongest smelling soap so I'd radiate an overpowering beautiful scent😉 but that's just me.",
            "If your in-laws ever stay at your place make sure their only option is girly body wash. Even the hand soap, find a really fruity scent from bath and body works.",
            "Goddamn why didn't you switch his soap with women's soap? I mean, there's still time so go ahead and do it. Then come tell us in 20 years.",
            "(Secretly) fight the patriarchy!!! 😝",
            "Sometimes it's the little things 🤣",
            "Men who make a big deal out of using male specific products are not comfortable with their masculinity",
            "So in 20 years, they haven't had to replace the MANLY-man body wash/shampoo in that bathroom. LOL Must drive him nuts. \n\nGood jorb.",
            "I'm a dude and I use women's lavender body wash. Why? Because I like the way it smells.",
            "I found out my eldest son uses my shower gel because “sometimes I want to smell pretty. Men’s stuff is one bottle for your hair, body and exhaust pipe”!",
            "I like this one lol\n\nI’m curious what they would think if they knew? lol"
        ]
    }
}