{
    "Checking in..": {
        "title": "Checking in..",
        "score": 13906,
        "url": "https://i.redd.it/i6w9k5lr443b1.jpg",
        "content": "",
        "num_comments": 439,
        "comments": [
            "Hello!!!( this sub has gone to shit please save it)",
            "POV: you're still floor gang",
            "Showing us all the view his baby will be seeing. Very informative!",
            "By far your best angle",
            "THE KING HAS RETURNED TO CLEANSE THE LAND 🫡",
            "Say hi to Marzia from all of us 🩷",
            "See the post and be like where do OP get the photo, Instagram? And see OP name and realise it pewds.",
            "Quick the big man is here, everyone act civilized",
            "POV: you're limboing under Pewd's floating body",
            "This looks like an attempt to take a d pic"
        ]
    },
    "I think pewds alone is responsible for 99% of Mojang revenue ": {
        "title": "I think pewds alone is responsible for 99% of Mojang revenue ",
        "score": 188,
        "url": "https://i.redd.it/focj5y6isi9d1.png",
        "content": "",
        "num_comments": 6,
        "comments": [
            "ahhmm coincidentally, I actually wanna try because I found out there was a new update 2 months ago and it has a new boss.. ahhmm 2 days later Felix posted... so ahhmm I'll try.",
            "Pfffsh, amateurs! I started playing the next day. \n\nIt sucked for me though. Not sure how I played before, felt just like Pewds. Couldn't find iron for three hours and gave up.",
            "Pewds has definitely left a mark on internet culture!",
            "Amazing how anything he does on YouTube can just change everything lmaooo",
            "He single handedly bring back the trend on 2019",
            "that episode where he was playing minecraft after his wedding is the most wholesome vid ever, he was actually sooooooo happy there and you can see it <3"
        ]
    },
    "always wanted to make a fanart of pewds minecraft series but i didnt know how to draw back then so... finally made one.": {
        "title": "always wanted to make a fanart of pewds minecraft series but i didnt know how to draw back then so... finally made one.",
        "score": 763,
        "url": "https://i.redd.it/mba9ip0fy99d1.png",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Time well spent, this looks beautiful",
            "This is can actually be a really good wallpaper, nice one.",
            "wow this is amazing g",
            "This is really good. Keep it up",
            "So you practice all that time. And learned?  \n  \nYou know what? Props...",
            "This is just so beautiful",
            "This looks so cool!",
            "Amazing Work!",
            "we are so back",
            "nice art,bro!"
        ]
    },
    "Only 4 years late to the party, glad im only late by 11 million more subscribers :D": {
        "title": "Only 4 years late to the party, glad im only late by 11 million more subscribers :D",
        "score": 364,
        "url": "https://i.redd.it/2xgeuygkda9d1.jpeg",
        "content": "Nah but joke apart i got this back in march this year and it was really really difficult to source it where i live. But im very proud of it. ❤️\n",
        "num_comments": 18,
        "comments": [
            "Nice! I still have mine. Number 2,873.",
            "thats a handsome ass looking felix right there",
            "That’s so cool bro! Even I wanted it so bad , back then, but was not able to get it.",
            "I have it as well, the wait  felt like eternity.\n31,953",
            "I got mine up on my shelf. Number 15,763",
            "I fucking wonder who has the 69!",
            "You gotta get the GFuel shakers to complete the set",
            "Where can you get it?",
            "Oh yea thats a handsome looking fella",
            "Tbh i did not think of ever getting it too, i tried in the past but importing it was too costly plus they were stock out always."
        ]
    },
    "The only happy ending I needed": {
        "title": "The only happy ending I needed",
        "score": 11325,
        "url": "https://v.redd.it/tzqcbvo6e29d1",
        "content": "",
        "num_comments": 80,
        "comments": [
            "I just love the friendship between these two",
            "Wholesome friendship but it’s not the end",
            "Sometimes a simple happy ending is all you need to brighten your day.",
            "Jack is the wacky irish uncle , no relation, that every family needs",
            "Very glad \"sobbing...\" was added to the video.",
            "Video makes em look like a couple.",
            "What a happy couple and their child",
            "From getting a shout out, to meeting his honorary nephew. I love that he is really that much of a family to him.",
            "Wait why has it ended?",
            "Why you gotta hit me in the feels on a normal Thursday afternoon? 😭❤️"
        ]
    }
}