{
    "📍UnionBank Rewards Visa Platinum No Annual Fee for Life (NAFFL) April to June 2024 Promo - Discussions, Comments, Questions, Inquiries [MEGAPOST]": {
        "title": "📍UnionBank Rewards Visa Platinum No Annual Fee for Life (NAFFL) April to June 2024 Promo - Discussions, Comments, Questions, Inquiries [MEGAPOST]",
        "score": 41,
        "url": "https://www.reddit.com/r/PHCreditCards/comments/1bxueze/unionbank_rewards_visa_platinum_no_annual_fee_for/",
        "content": "https://preview.redd.it/mowe2f5p7zsc1.png?width=600&format=png&auto=webp&s=53ea8acfe22f8769eb22dd60593093201c816a00\n\n# UnionBank Rewards Visa Platinum - [Apply Now](https://apply.creatory.moneymax.ph/click?o=333&a=632)\n\n**• Promo: (4K eGift/Airpods 2/other gift) (Moneymax Exclusive)**\n\n◦ Promo Period: May 1 to June 30, 2024\n\n◦ NTB only\n\n◦ 4K eGift/WG (10k MSR within 60 days of CAD)\n\n**• Annual Fee: No Annual Fee for Life**\n\n◦ Promo Period: October 19, 2023 to June 30, 2024\n\n◦ 20k MSR within 60 days of CAD\n\n◦ NTB only\n\n**◦ With other Credit Cards (recommended for fast and easy approval)**\n\n◦ [Promo Information](https://www.unionbankph.com/cards/credit-card/discounts-and-promos?id=870)\n\n**Features**\n\n• Earn 1 point for every P30 spend\n\n• 3X points multiplier on shopping and dining\n\n# —\n\nLet's discuss all comments, questions, and inquiries about the promo and the application process in this thread.\n\nWe'll declutter our community so apologies in advance if you notice that your post/s have been removed! New posts related to this promo and the application process will likewise be removed.\n\nUB NAFFL Megapost 1 (October 2023 to February 2024) - [Link](https://www.reddit.com/r/PHCreditCards/comments/188tsqf/unionbank_rewards_visa_platinum_no_annual_fee_for/)  \nUB NAFFL Megapost 2 (March 2024) - [Link](https://www.reddit.com/r/PHCreditCards/comments/1b3isyz/unionbank_rewards_visa_platinum_no_annual_fee_for/)",
        "num_comments": 380,
        "comments": [
            "Here is my timeline for this card:\n\n\nFebruary 28 - Received email for Just-For-U Unionbank Rewards Card indicating NAFFL with Free 10,000 points* when I spend any amount upon receipt of the card. I applied same day because email is legit from Unionbank\n\nMarch 13 - Received text message from Go21 that my card delivery is being processed.\n\nMarch 18 - Card is delivered to me. \n\nMarch 19 - Activated the card and made the first swipe.\n\nApril 19 - Received congratulatory message from Unionbank that the annual fee of my UnionBank REWARDS VISA PLATINUM Credit Card is WAIVED FOR LIFE. My total accumulated spend up until that date is only Php16,335.20 so I think any amount spend is legit.",
            "i just got the [naffl congratulatory message](https://i.imgur.com/FqzO11b.png) from unionbank, i havent reached even 20k (i’m at 19k tho), this is also my first credit card, i thought i was unqualified based on the t&c. anyone else?\n\n\nedit: \n\ni checked kaskasan buddies on facebook and it looks like they're doing mass naffl approvals.",
            "Hello! Naka receive ako ng sms and email about sa no annual fee for life but any amount spend siya hindi minimum of 20k. May mga naka experience na ba na ganitong same promo? ",
            "Hello, may nakatanggap ba ng JUST FOR U na promo na SPEND ANY AMOUNT then NAFFL na? Legit ba yung spend any amount don?",
            "WARNING: Unionbank is SCAMMY - hidden charges  \nI got one of their promo cards that's supposed to have no annual fees for life. Our office submitted requirements for us and it was approved.\n\nThis is the gold credit card with the lowest credit limit. I usually just pay for the entire amount through the app,  reviewing the transaction history also there.\n\nBUT today I decided to review the actual PDF of the statement and I saw that there are \"U-Protect\" charges every month. I called their hotline to ask what that was.\n\nThey told me it's \"in case of death UB may give you up to 400k\". So I said I never signed up for this. UB said it's in the terms and conditions. I said it's fine but where is the information about this \"life insurance\" and I never got any email or details about this. How is anyone supposed to claim the supposed insurance? They couldn't answer me. \n\n  \nSo I reviewed past statements and the U-Protect charges are all different also. Ranging from Php80 to about 200 plus. They said that you're charged .36 cents for every 100 pesos you spend. HUHHHH\n\nSo the more you use the card, the higher this \"insurance\" payment will be. The call center agent said yes. it's so scammy and unfair. So they can't reverse the charges anymore. But they can cut the insurance. I can't get the money back.\n\nI had them cut the credit card. You can't even do this in their branches. I was on the phone for more than 2 hours just to do this.  \n  \nTLDR: Review the PDF of your statements. They don't put it in transaction history! Super scammy move to hide this \"insurance\" in terms and conditions. GO FOR ANOTHER BANK.",
            "Got the approval email in less than 10 minutes lmao that was quick",
            "https://preview.redd.it/mqw8ex5p1rzc1.jpeg?width=1080&format=pjpg&auto=webp&s=943a08ce7cd66ecfa34d6bc927befc3ed1c9b9ec\n\nAny update po sa mga nakareceive nito?",
            "Hello! Ilang araw bago sila mag text na qualified for NAFFL na yung card mo? Kaka hit ko lang kasi ng 20k today and di pa posted yung ibang transactions. Thanks in advance!",
            "Hello Everyone, I just got approved for the UB Rewards Platinum Visa. I have a few question po.\n\n1. Is the NAFFL promo still ongoing?\n\n2. If yes, okay lang ba na mag purchase ako ng 20,000 worth of items then installment ko siya for 6 months in the physical store for example, counted ba siya kahit mag exceed ng 60 days?\n\n3. Also, counted po ba mga online shops like Lazada, Shopee, Ikea, etc...\n\n4. Since my account is new, and this is my first ever CC, sa UB app po ba, maconvert ko yung single purchase ko to installment?\n\nThank you all so much! \n\nPs. I tried reading the T&C but still I want to know from you guys your experience.",
            "hi, i just received the same credit card after getting the email that qualified for it. When I activated the card in the UB App, My credit limit shows it’s only 15,000 and 0 points. This is my first credit card, what should I do to get the NAFFL and Free 10k points that was offered to me?\n\nhttps://preview.redd.it/8t76acopz5zc1.jpeg?width=1170&format=pjpg&auto=webp&s=10a2f940d69c0b8273e76df681b9856c3458d677"
        ]
    },
    "📍RCBC Mastercard and JCB No Annual Fee for Life (NAFFL) May to July 2024 Promo - Discussions, Comments, Questions, Inquiries [MEGAPOST]": {
        "title": "📍RCBC Mastercard and JCB No Annual Fee for Life (NAFFL) May to July 2024 Promo - Discussions, Comments, Questions, Inquiries [MEGAPOST]",
        "score": 18,
        "url": "https://www.reddit.com/r/PHCreditCards/comments/1cyis9o/rcbc_mastercard_and_jcb_no_annual_fee_for_life/",
        "content": "https://preview.redd.it/z53nvzgtc32d1.png?width=1080&format=png&auto=webp&s=bda8dc4edd921cbd504cc3ed2ec6fbd257fdd8a5\n\nLet's discuss all comments, questions, and inquiries about the promo and the application process in this thread.\n\nWe'll declutter our community so apologies in advance if you notice that your post/s have been removed! New posts related to this promo and the application process will likewise be removed.\n\n--\n\nPromo Information: [https://rcbccredit.com/promos/naffl224](https://rcbccredit.com/promos/naffl224)\n\nPromo Period: May 7 to July 31, 2024,000 (within Card Delivery Date)\n\n|Card|Information|\n|:-|:-|\n|[RCBC Classic Mastercard](https://applications.rcbccredit.com/?utm_source=Website&utm_medium=0709000000036&utm_campaign=MGMX3o2G9&option=RCBC_CMC)|Apply from May 7 until July 31, 2024; new to bank only; must HAVE existing primary card from another bank; must spend 20k within 60 days from card delivery date (CDD)|\n|[RCBC Gold Mastercard](https://applications.rcbccredit.com/?utm_source=Website&utm_medium=0709000000036&utm_campaign=MGMX3o2G9&option=RCBC_GM)|Apply from May 7 until July 31, 2024; new to bank only; must HAVE existing primary card from another bank; must spend 30k within 60 days from card delivery date (CDD)|\n|[RCBC Black Platinum Mastercard](https://applications.rcbccredit.com/?utm_source=Website&utm_medium=0709000000036&utm_campaign=MGMX3o2G9&option=RCBC_PBCPM)|Apply from May 7 until July 31, 2024; new to bank only; must HAVE existing primary card from another bank; must spend 40k within 60 days from card delivery date (CDD)|\n|[RCBC World Mastercard](https://applications.rcbccredit.com/?utm_source=Website&utm_medium=0709000000036&utm_campaign=MGMX3o2G9&option=RCBC_PWM)|Apply from May 7 until July 31, 2024; new to bank only; must HAVE existing primary card from another bank; must spend 60k within 60 days from card delivery date (CDD)|\n|[RCBC JCB Classic](https://applications.rcbccredit.com/?utm_source=Website&utm_medium=0709000000036&utm_campaign=MGMX3o2G9&option=RCBC_CJCB)|Apply from May 7 until July 31, 2024; new to bank only; must HAVE existing primary card from another bank; must spend 20k within 60 days from card delivery date (CDD)|\n|[RCBC JCB Gold](https://applications.rcbccredit.com/?utm_source=Website&utm_medium=0709000000036&utm_campaign=MGMX3o2G9&option=RCBC_GJ)|Apply from May 7 until July 31, 2024; new to bank only; must HAVE existing primary card from another bank; must spend 30k within 60 days from card delivery date (CDD)|\n|[RCBC JCB Platinum](https://applications.rcbccredit.com/?utm_source=Website&utm_medium=0709000000036&utm_campaign=MGMX3o2G9&option=RCBC_PJCB)|Apply from May 7 until July 31, 2024; new to bank only; must HAVE existing primary card from another bank; must spend 40k within 60 days from card delivery date (CDD)|",
        "num_comments": 45,
        "comments": [
            "andami pa nilang backlogs last year na nag apply din ng naffl promo hindi man lng prinocess tapos may bago ulit papromo wow.",
            "nagapply ako sa link and nawala na lang after the last step. wala man lang reference number na binigay",
            "Ang problem dito pag late na approved tapos di na aabot sa promo. Dami kasi ako nabasa  comments more than a month na wala man lang balita.",
            "Heto nanaman ang 3 months wait for card application only to be \"declined\" dahil di daw mareach ang number. 😢 Hirap din kausapin ang email kahit ielaborate mo na ang problem",
            "I received a card once from RCBC, but never activated it and instead ended up canceling it. Does that disqualify me as new card holder?",
            "am i still considered new to bank if i applied for an RCBC card before but never activated it?",
            "Kapag ba nag close ka ng cc sakanila. Then nag aapply ka for different type of cc. Pwde ka ba sa NAAFL promo nila? \n\nSabi kasi \"*Cardholders with existing RCBC Credit Cards and/or upgraded cards are not qualified to avail of this promo.*\"",
            "How about visa nila...naka avail.ako.cc rcbc pero visa binigay saken huhuhu",
            "Would it help ba if mag apply uli ako or talagang matagal response nila sa mga applications?\n\nLike kung gamitin ko link ni kaskasan buddies?",
            "i want to apply for an RCBC mastercard, i manage our family business, but the business is not under my name, including tax and dti documents. I have a card with BPI since they gave me one when my father applied for a car loan. My question is, would they still require income documents if I use my BPI card as a reference in my application?"
        ]
    },
    "NFC Technology (Tap to Pay using your phone or watch)": {
        "title": "NFC Technology (Tap to Pay using your phone or watch)",
        "score": 23,
        "url": "https://i.redd.it/wlo1p02auc9d1.jpeg",
        "content": "Sana lahat ng banks maging ganto na rin at makipag-collab with Apple Pay and Google Pay para wala na kong dalang wallet lagi 😂😂😂",
        "num_comments": 31,
        "comments": [
            "bakit kaya ayaw na lang i-adopt yung google or apple pay. Ibang system pa.",
            "Bakit huawei pa sila nagcollab? Malaki pa din ba market nila dito?",
            "Why Huawei though? When there's Apple Pay, Samsung Pay and Google Pay.",
            "EW meron na ganito, sana BPI din.\n\nWait and see muna",
            "It’s not on the bank, Apple needs to apply some regulatory shits for them to operate here in PH which I believe they won’t do in the near future.",
            "Tagal talaga dumating ng technology and other innovative trends sa Pinas. Dami kasi kailangang padulasan bago ma implement sa Pinas. Lahat may lagay.",
            "Huawei has bad rep for spying stuff. If i recall correctly may issues sila before with google and the AUS govt for espionage related stuff. \n\nNot a good sign when we're at the brink of being breached.",
            "Cooperation between BSP and the banks will allow Apple Google and Samsung to bring NFC payments\n\nI worked on these as part of the development team for banks in SG and MY and Vietnam\n\nBascially, Apple and others have framework and API  in place for banks to follow to make it work in their system.\n\nIf the banks do not have the initiative to implement the minimum for NFC payments to work (fraud check, tokenization, API interchange among systems), NFC payments will not work.\n\nAlso, BSP needs to greenlight this. They cannot operate in PH unless BSP invites the companies to work with banks. A certification from MC Visa AMEX also happens. Takes one year to implement. I have no idea in PH but maybe discussions are already happening.. who knows\n\nIts not because of Apple does not want. Its because our banks and central bank do not have the initiative or are too overwhelmed with the requirements. Countries like Vietnam, which has less card base and more cash basis,  prove that it can be done if all parties are willing to cooperate, regardless of market size",
            "Sana magkaron na talaga para di na magdadala ng cards.",
            "apple pay!!!! wtf"
        ]
    },
    "Auto debit past due BPI CC": {
        "title": "Auto debit past due BPI CC",
        "score": 3,
        "url": "https://www.reddit.com/r/PHCreditCards/comments/1dr2ser/auto_debit_past_due_bpi_cc/",
        "content": "Question - I'm behind for 3 months sa BPI credit card and over limit na. Nag auto deduct sa savings accnt ko ng total minimum amount due pero kulang yung pa ng around 7k. I believe they will continue to deduct once nagka funds dun sa savings accnt. Will they just deduct the minimum amount to pay? Or they will continue deductiny until ma pay off na full outstanding balance?",
        "num_comments": 1,
        "comments": [
            "No one knows, walang nakalagay sa terms nila na amount but you agreed to that nung kumuha ka ng CC. So even if kunin nila yung lahat ng laman ng savings account mo wala ka magagawa."
        ]
    },
    "Refunded item with installment": {
        "title": "Refunded item with installment",
        "score": 1,
        "url": "https://www.reddit.com/r/PHCreditCards/comments/1dr6p5a/refunded_item_with_installment/",
        "content": "What happens when you bought an item and opted with CC installment as payment pero narefund ka ng shopee kasi lost in shipment yung item mo.\n\nAnyare na dun? Auto cancel na din yung installment?\n\nGanito nangyari sa friend ko. Mukhang may nagkainterest dun sa item sa delivery. ",
        "num_comments": 0,
        "comments": []
    }
}