{
    "Weekly \"Ups\" and \"Downs\" Support Thread": {
        "title": "Weekly \"Ups\" and \"Downs\" Support Thread",
        "score": 3,
        "url": "https://www.reddit.com/r/PhD/comments/1dmlm4r/weekly_ups_and_downs_support_thread/",
        "content": "Hello everyone,\n\nGetting a PhD is hard and sometimes you need a little bit of support.\n\nThis thread is here to give you a place to post your weekly \"Ups\" and \"Downs\". Basically, what went wrong and what went right?\n\nSo, how is your week going?",
        "num_comments": 7,
        "comments": [
            "Ups: Finally doing my proposal defence this week.\n\n  \nDowns: My supervisor scheduled the defence the same day as a conference presentation so I'll have to rush to the conference after the meeting. My other supervisor specifically asked for a copy of my proposal to review before the meeting (they haven't looked at the last two versions they received) which made me think he was actually going to give me some useful feedback. Instead, he did what he normally does and responded to my email about something that has nothing to do with my proposal and then ended it by pointing out really obvious things like the fact that I should have some slides ready in case I need them. (The proposal and presentation were all done 2 years ago and have been regularly updated since...)",
            "I sent a chapter today! 3 down, 3 to go! I'm halfway to my first draft!!",
            "Up: I found a topic to start my PhD\n\nDown: I'm looking forward to start a PhD in Architecture next year. (France). I have an advisor willing to follow me that I really like but I can't find funding. I have multiple interviews, am filling files, but it looks like i'm fucked. It sucks. I'm so close to getting there but so far away at the same time.",
            "Ups: Defending tomorrow. Got my first official job offer too, so things are looking up.\n\nDowns: I do not feel prepared for my defense. I stand by my work, but I am sorta checked out at this point. I spent more time writing a review paper and applying to jobs than preparing for my defense, so I worry I will end up embarrassing myself. Nonetheless, I doubt I will fail my defense.",
            "I feel like all my phd was a failure between my PI that knows less than I do and so care like 0 and the coauthors that try to make sense of what I get from my data and my PI weird ideas",
            "Up: I got the go ahead for my PhD proposal (qual prep) and have an incredibly supportive committee which feels rare. \n\nDown: I am feel incredibly unmotivated other life things have curbed my capacity to show up.",
            "If I simply sacrifice every source of joy and happiness in my life and lock in for the next few months, I can publish this paper and graduate. \n\n  \n\\*doesn't publish. \\*doesn't graduate \\*gets more depressed."
        ]
    },
    "Wellness Wednesday": {
        "title": "Wellness Wednesday",
        "score": 4,
        "url": "https://www.reddit.com/r/PhD/comments/1dowuni/wellness_wednesday/",
        "content": "Hello everyone,\n\nToday is Wellness Wednesday!\n\nPlease feel free to post any articles, papers, or blog posts that helped you during your PhD career. Self promotion is allowed!\n\nHave a blog post you wrote/read that might help others? \n\nPost it!\n\nFound a workout routine or a book to help relax?\n\nPost it!\n\n-Mod",
        "num_comments": 2,
        "comments": [
            "AI created music is controversial right now, but I'm finding that those AI music platforms are really letting non-musicians have fun creating music that would never make it to the top charts. There's a lot of nerdy stuff going on in Suno, and here's one of my contributions about the science PhD experience...\n\n\"R01\" (style of rock. hair/glam metal):  [https://suno.com/song/eb49ef86-8ba8-4d12-911d-e91adef92c08](https://suno.com/song/eb49ef86-8ba8-4d12-911d-e91adef92c08)\n\nHope it brings some smiles, but don't procrastinate too much in Suno before getting back to your thesis  ;)",
            "I find listening to true crime podcasts helps to distract me a lot because sometimes going to the gym or hanging out with friends can cause more stress than good, at least for me. One of my favorite ones is Casefile."
        ]
    },
    "Public uni does not equal bad uni": {
        "title": "Public uni does not equal bad uni",
        "score": 47,
        "url": "https://www.reddit.com/r/PhD/comments/1dr2wwl/public_uni_does_not_equal_bad_uni/",
        "content": "The title of my post is obvious. But I've been negatively surprised by the amount of people here who refer to \"public\" universities as synonymous with \"bad\" universities – as if \"public\" automatically denoted something about the quality of an academic institution. There are, of course, good and bad public unis, the same way there are good and bad private unis. I feel dumb for saying something so obvious. But please try to show some respect, folks. You're supposedly either current, former, or aspiring PhD students. You should know better.",
        "num_comments": 32,
        "comments": [
            "Most of the best departments in my discipline are public universities.",
            "Have to be crazy to call universities like IU or Purdue bad",
            "I haven’t seen this much but this is likely very country-dependent. \nIn the Philippines for example, I see this attitude a lot. \nBut for example in Canada, Germany, Serbia, and many other European countries, the stigma is reversed. The stigma is that if you go to a private school, it’s because you weren’t good enough to get into the free/cheap public schools, so now you have to pay for your education at a private school lol",
            "I haven’t really noticed this in this sub specifically, but yeah I agree that sucks if that’s a trend. Different fields are stronger at different universities, and many times one department in a public university will be way stronger than the same field at an Ivy. There are many amazing public universities like Berkeley, UNC, UCLA, University of Texas, Michigan, UMass, UVA, the list goes on. All top tier universities, and some leaders in the world in specific fields.\n\nYes, private schools dominate the rankings, which is where I’m sure much of the stereotype comes from, but having gone to an Ivy myself for one of my graduate degrees, the first lesson I learned is not to believe the hype. Sure, the Ivies are great schools, but they’re not some mystically majestic above-all institutions. They’re just schools.\n\nSorry it seems you’ve seen some prejudice here. Any graduate student should know better.",
            "It plays into that idea of feeling exclusive and being able to gatekeep higher education. The obsession with the ivy leagues here in the U.S. is rampant. There are plenty of stellar advisors and programs at public universities. It's a red flag to me when a PhD at any phase puts a lot of emphasis on being at a private/ivy institution.",
            "Funnily, it's kind of opposite in Germany.",
            "I saw a post earlier today with someone obsessing over not having gone to a top 10/elite school for their phd despite working at one of those schools currently. On the one hand I felt bad for them, but on the other it’s that kind of mentality that contributes to the problem. \n\nI get it. I was at an Ivy League at one point. I thought it would be amazing. It was one of the most miserable and lonely year of my life. Switched programs to a public school in the Midwest. Million times happier now than when I was at an “elite” institute.",
            "There are 10 departments in the US doing what I do and one of them is at my no name public school in the city I grew up in. Wouldn't trade it for the world.",
            "Interesting. Haven’t really heard this kind of negative sentiment against public schools or read this kind of reference at all. But if such a perception exists, then it is wrong, as you have stated.",
            "In this sub, most of the posters are the 1% that are totally disaffected. There are such incredible public universities that lead in many disciplines and research."
        ]
    },
    "How would you react if your date read all of your articles? ": {
        "title": "How would you react if your date read all of your articles? ",
        "score": 248,
        "url": "https://www.reddit.com/r/PhD/comments/1dqmn9d/how_would_you_react_if_your_date_read_all_of_your/",
        "content": "A bit off-topic. I'm dating a guy and we're both PhD students but in very different fields. He is very fond of his research topic and has already talked about it in broad terms. Out of curiosity, I searched and read his articles to understand the subject a little better. I would have questions and would love to talk to him about it, but I'm afraid that it would be very creepy to bring up to him that I know his previous work. I don't mean to be a stalker, but I found it interesting. 😅 How would you react if someone brought this up?",
        "num_comments": 112,
        "comments": [
            "I mean, if someone else was genuinely interested in my field of research *and* somewhat interested in me as a person....I'd be proposing on the second date.\n\nBut that's just me.",
            "I'd be surprised they had that kind of patience to read gibberish",
            "Talk ~~dirty~~ science to me.",
            "I would find it cool. Effort is sexy!",
            "Id be fighting back the urge to propose on the spot lol.\n\n\nSeriously though, that would be genuinely nice to hear. Having a date that actually wants to talk about something beyond pizza topping choice would be amazing. Talking about something I actually worked on because they are actually interested would be awesome....just dont point out my statistics errors... Those made it through reviewer two already.",
            "Considering I payed for my girlfriend to a conference where I was speaking and she skipped my talk (we met on our PhD, same advisor)... I would probably marry a girl that did that showed so much interest in what I find important.",
            "I would be very flattered and worry that the date found out that Im probably a dumb ass",
            "I would be flattered and eager to discuss my research with someone who took the time to read my work.",
            "Considering that not even my advisor reads my work I'd be ecstatic",
            "maybe if you want to avoid the creepy stalker vibe, just read and talk about one? \"I read one of your articles...\"?"
        ]
    },
    "Regret not going to a bigger name school for my PhD": {
        "title": "Regret not going to a bigger name school for my PhD",
        "score": 126,
        "url": "https://www.reddit.com/r/PhD/comments/1dqqyg5/regret_not_going_to_a_bigger_name_school_for_my/",
        "content": "Hello PhD'ers!\n\nI graduated 3 years ago with a PhD from a t50 school and have constant regret that I did not go to a better school-- like a t10 school. The irony is, I currently work for one of the most elite universities, and now since I see the level of experience (or lack thereof) of the students that get in, I realize that could have been me. However, I never applied to a t10 school. I am FILLED with regret constantly that I never applied. I do not know what to do to make me feel better. I thought about getting a master's from a t10 school, but it doesn't hit the same. It's silly, I know, but I feel left out since many of my colleagues are alum of these prestigious 'name brand' universities and I just can't relate. Outside of my colleagues, my friends have way bigger reactions when they meet someone who graduated with a PhD from a t10 school. When they ask where I went to school, my friends either have never heard of my school or aren't nearly as impressed. \n\nHas anyone felt the same? If so, have you done anything about it?",
        "num_comments": 98,
        "comments": [
            "I can understand wishing you attended a big name school; but if you care about the big names, you literally work at one. Shouldn’t that be a bigger achievement, given that you didn’t attend one? I’d imagine so.",
            "I regret choosing a big name school over somewhere I would have gotten more individual attention from PIs, lived in a city that I knew I liked, and not felt like I was constantly in competition with people who thought they were God's gift to science. For the past 6 years I've been trapped in a place that I hate, in a work culture that's made me lose all passion for my work. Obviously there are advantages, but in my field they're much smaller than I thought they would be. If I could go back and make a different choice, I would do it in a heartbeat.\n\n\n\nBut more importantly, I can't go back and neither can you. We both have to do what we can with the situations we are in. As many others have suggested, if you find that these thoughts are getting in the way of living your life, seek therapy.",
            "Being employed by an elite university is a lot more important than graduating from one of them.  If you have such constant regret that it is affecting your quality of life, you should consider getting some counseling to help you grapple with the immutability of the past and the value you place on the perceptions of others.",
            "I can relate. I’ve done all my education in public state institutions, and I’m about to start a postdoc this fall at a private institution that heavily draws phds from the Ivy League schools. It’s a strange feeling (especially seeing how much money they have compared to my state schools). \n\nSometimes I wish I went to a fancy school, but I value my experience in the public education system. I find solidarity with my fellow state schoolers at conferences and I think it’s given me a better, more grounded perspective of academia.",
            "You know who cares about where you did you degree once you have your first real job? Dr. Suess's old: \"Those who matter don't mind and those who mind don't matter.\" It doesn't sound like this regert is serving you anything but grief, so allow yourself a reasonable time to grieve and then let it go. If it really bothers you that much, then go get another one at a t10. If that sounds ridiculous, then frame the context of your regret in that ridiculousness.",
            "Are you in STEM?\n\nI think the quality of your PhD research matters more than the reputation of your school in STEM.",
            "I went to a top tier school in my field for my PhD, but I always felt like I didn't really deserve to be there until I started to see PhD applications from the admitting side.",
            "This is silly. Just make a name for yourself instead of relying on university affiliation.",
            "I don't. I only applied for one school because of the location. It's a normal state university, in a below avg state. Most people outside of the state has never heard of it, and I could honestly care less. I make good money in industry and only care about my total compensation and work life balance. \n\n\nIf you have so much regret, you could always get a MD or JD degree in a T10. I know people who went back to school for those degrees after getting a PhD. And your friends will definitely give you a bigger reaction if you were a MD/PhD or a JD/PhD rather than only a PhD. ",
            ">I feel left out since many of my colleagues are alum of these prestigious 'name brand' universities and I just can't relate\n\nWell, now all of you are *colleagues* at your prestigious university! And unless your colleagues mostly come from one school then they shouldn't relate that much - I wouldn't expect a Princeton alum to automatically have some innate connection with an MIT alum.\n\n>my friends have way bigger reactions when they meet someone who graduated with a PhD from a t10 school\n\nUnless you plan to make this a significant part of your personality then it's not a big deal. People give a reaction and then everyone moves on."
        ]
    }
}