{
    "/r/Phoenix daily chat - Saturday, Jun 29": {
        "title": "/r/Phoenix daily chat - Saturday, Jun 29",
        "score": 5,
        "url": "https://www.reddit.com/r/phoenix/comments/1drbc78/rphoenix_daily_chat_saturday_jun_29/",
        "content": "Phoenix daily chat thread to discuss all things happening in/around the Valley. It's a place to check-in, share how you're doing, or ask questions that don't need its own thread. \n\n**THINGS TO DO:** Check our [Things To Do posts](https://www.reddit.com/r/phoenix/search?q=flair_name%3A%22Things%20To%20Do%22&restrict_sr=1&sort=new).\n\n**LIVE CHAT:** If you're looking to meet people or for a real-time chat, join the [Arizona Discord Server](https://discord.gg/redditaz). It's totally free. \n\n**USER FLAIR:** Visit the sidebar and change your User Flair to show which part of the valley you're in.\n\nYou can find past discussions [right here](https://www.reddit.com/r/phoenix/search?q=flair_name%3A%22Daily%20Chat%22&restrict_sr=1&sort=new).",
        "num_comments": 0,
        "comments": []
    },
    "What are your thoughts & predictions for the election in Phoenix?": {
        "title": "What are your thoughts & predictions for the election in Phoenix?",
        "score": 0,
        "url": "https://www.reddit.com/r/phoenix/comments/1dpyk2k/what_are_your_thoughts_predictions_for_the/",
        "content": "##What are your predictions for the election season in the Valley? Will it go smoothly? Are our officials ready for challenges? Which elections are you watching the most closely?\n\nWith the debate scheduled for tonight this seemed like a good time to have a political topic for our weekly chat thread.\n\nThis is a focused chat on a Phoenix-related topic that comes up fairly often but maybe hasn’t had a single place to discuss. The idea for these came up while putting together the questions for a demographic survey of subreddit users.\n\nWe want this to be a discussion for locals/regulars, **so comments from people who do not have a regular post history in this subreddit may be screened out.** You can disagree with people on topics but personal attacks will not be tolerated. Report them to the Moderators and we will deal with it.\n\nIf you have ideas for other discussion topics, message the mods.",
        "num_comments": 145,
        "comments": [
            "We need to keep as many County Supervisors and the current Recorder, Stephen Richter in office. They fought so hard against the election fraud nonsense. I've seen signs for conservative candidates running for Recorder that say \"secure the election\". The election WAS secure you idiot!",
            "I predict that the elections will run exactly as they have in previous years- regardless of the results, they will be accurate and well run.",
            "It will be same as last time. It won’t be determined until the mail-in ballots are all counted. That’ll turn the tide in Biden’s favor and Republicans will say it’s rigged because they lost and it took more than one day to count all the mail-ins.",
            "Let’s hope all politicians and people are fined for everyday their signs are up after Election Day. \n\nImagine the brain rot to think having someone’s name in your yard or blocking intersections will do anything.",
            "Kari will lose and act like a child again.",
            "I just want Kari Lake to lose again so she will finally move to Florida.",
            "Listen man, I just want Rachel Mitchell to lose.",
            "You know something will go at least slightly haywire. We live in a large spread out metro area. Plus most likely will be a heavy turn out.\nThen if doesn't go as some want it to they have already set the state for rigged and stolen.",
            "It seems that despite ousting the Democrat Recorder, the Republicans failed to get a crook in office, so the election will probably go normally, accounting for the armed intimidators who will no doubt show up in some places and cries of cheating that will occur in any area where Republicans don't win.",
            "100% there will be election deniers.\n\nPossibly dumbass rednecks at the polls with guns? Or is voter intimidation no longer a thing?"
        ]
    },
    "Anyone else’s dog bathe in the summer heat like mine?": {
        "title": "Anyone else’s dog bathe in the summer heat like mine?",
        "score": 565,
        "url": "https://i.redd.it/3n4o5q9aqb9d1.jpeg",
        "content": "Even if it’s 110+ out she loves it, have to make her come inside sometimes ",
        "num_comments": 185,
        "comments": [
            "My artificial turf gets super hot, I can’t even walk on it barefoot, yet my pup will lay out there sunbathing for a while before she gets up. Idk why she likes it so much",
            "Both of mine do. They go out for as long as they want, sunbathe, and the one of them barks to come inside. Been doing this for years, I just make sure they have water outside and everyone is happy. Both big black dogs too.",
            "I have a husky who is broken. She loves the sun and heat",
            "Yep, my dumb ass pitbull and I argue about it every day. I tell her to come inside and she kind of slowly growls at me because she doesn’t wanna move. It’s 110° Karen, get your ass inside.",
            "Ya. My girl is crazy. It's like she's trying to put the Australian in ACD.",
            "My late dog was a FLUFFY af chow/aussie mix and he loved the outside. He had a doggie door and could come in and out as he pleased, and we’d find him outside at 1pm in the middle of July constantly.",
            "Yup, my corgi does this.",
            "Yeah he's old and I think he likes the warmth on his arthritic bones.",
            "Yes! He really tries to be out there for as long as he can handle it. I think he gets frustrated cause he’ll come inside sighing like he’s mad he can’t sit out there for longer 😆",
            "Yep! My 11 year old Great Dane spends the entire day in our backyard in the sand pit sun bathing. He’ll come inside for 5-10 minutes, drink some water and lay on his futon and then go right back out. Baffles me because it’s so freakin hot but he’s on his last legs so who am I to question if he’s happy out there."
        ]
    },
    "Cheap indoor activities to do with friends other than walk around the mall?": {
        "title": "Cheap indoor activities to do with friends other than walk around the mall?",
        "score": 47,
        "url": "https://www.reddit.com/r/phoenix/comments/1dr0af2/cheap_indoor_activities_to_do_with_friends_other/",
        "content": "We live in east phoenix area but go all around.",
        "num_comments": 73,
        "comments": [
            "Phoenix Art Museum is free this Sunday for Family Funday. 10am-5pm.",
            "Go to a library and check out one of the cultural passes for free. They allow you access to various museums and exhibitions around the valley and Arizona.",
            "Go to the gym. Depending on the facility you can play basketball, racquetball, lift, box, climb, etc. Bull shooters is cheap for billiards and darts. Bowling can be cheap. You gotta go weekdays when they have specials. Get some culture passes from the library and hit a museum for free.",
            "Host a creative night at one of your places if you can - paints and canvas/paper are super cheap. There's always other places like paint and sip art studios, As you wish, etc.",
            "We have quite a few good museums",
            "Kind of niche, but there's a senior dog shelter that I volunteer with where I just go and hang out with dogs for an hour or two and give them cuddles. I then post about them online and a few have actually gotten adopted by friends! The building is air conditioned and comfortable, and it's totally free and just a lovely way to spend an afternoon.",
            "Find a public skating time at an ice arena",
            "Go to the Brass Armadillo. HUGE antique thrift shop. Like fucking warehouse huge",
            "Go to the arcade! I don’t count Main Event and cobra as arcades tbh. Round 1 is pretty expensive per play but the booze is cheap. The other arcades are pretty affordable unless you go to mesa or Gilbert",
            "Phoenix Art Museum free times: Wednesday 3-9pm, quarterly AfterHours Select aFridays 5-9pm free, and Quarterly Family Fundays, Sundays 10am -5pm. Free for everyone. Lots of activities during these times including hands-on art making, music, performances, food trucks, etc."
        ]
    },
    "Has anybody found the Bkue Bell Dr Pepper Ice Cream locally? ": {
        "title": "Has anybody found the Bkue Bell Dr Pepper Ice Cream locally? ",
        "score": 37,
        "url": "https://i.redd.it/d39o8g7z3f9d1.jpeg",
        "content": "",
        "num_comments": 51,
        "comments": [
            "Frys in tempe mcclintock and baseline as well as the one on Ray rd and rural",
            "Damn it. I'm lactose intolerant, but this sounds too good to pass up. See y'all at 3AM, I guess.",
            "I have only seen the A&W root beer float one recently but I know the Dr Pepper one is still produced. I’m willing to drive to find this for my wife!",
            "I saw this at frys at Shea and the 101 recently",
            "I think I bought it at fry’s",
            "It’s overrrated. Tastes pretty artificial, if that’s your thing.",
            "I saw it at the Walmart by 19th Ave and Bethany home Rd",
            "Frys, Walmart all have them.\n\nLuckily I bought a pint first.  I wasn't keen on the sherbert part.",
            "Yes Walmart and fry’s, it tastes just like the Dr Pepper shake at whataburger",
            "Just came from Frys 67th Ave and Bell. It's fully stocked 😊"
        ]
    }
}