{
    "How to add perlin noise texture to mask in Photoshop?": {
        "title": "How to add perlin noise texture to mask in Photoshop?",
        "score": 2,
        "url": "https://www.reddit.com/r/photoshop/comments/1dr7d8x/how_to_add_perlin_noise_texture_to_mask_in/",
        "content": "https://preview.redd.it/05sit3ymbh9d1.png?width=1259&format=png&auto=webp&s=66df3f4f361d8881f6cf6dc3ea8e7a6d143f6d18\n\nHi, I want to apply this noise texture as a layer mask for the texture below. How can I place this noise inside the layer mask ?",
        "num_comments": 7,
        "comments": [
            "Select the mask before applying filter. Click on the mask thumbnail before going into the filter. Otherwise multiply in blending options.",
            "thanks the multiply worked great!",
            "Which is exactly what the mask is supposed to do.",
            "Perfect. That is exactly what you asked for, the texture is now used as a mask.\n\n> I want to apply this noise texture as a layer mask for the texture below\n\nA layer mask controls the transparency of the layer...",
            "**Solved!**",
            "You can copy/paste it into the mask, or, as I usually do, \n\n1. load it as a selection (cmd/ctrl-click the RGB-channel), then \n2. add layer mask (the selection is automatically used as a mask). Invert if needed (cmd/ctrl-i).",
            "Hi, I tried that but this it what I got:\n\nhttps://preview.redd.it/wgiyoqzauh9d1.png?width=1347&format=png&auto=webp&s=5b9b0c74d6cc6fbeef2bdc90d92b6cb3dad7dc58\n\nthe image is semi transparent"
        ]
    },
    "Can anybody make an interesting header picture out of this?": {
        "title": "Can anybody make an interesting header picture out of this?",
        "score": 0,
        "url": "https://www.reddit.com/r/photoshop/comments/1dranwl/can_anybody_make_an_interesting_header_picture/",
        "content": "https://preview.redd.it/s1khbcbudi9d1.png?width=1500&format=png&auto=webp&s=72b509bc21d0aeb3b6d8a8eb88d590b194457be7\n\n",
        "num_comments": 1,
        "comments": [
            "No requests. Try r/photoshoprequest or r/photoshoprequests"
        ]
    },
    "How to create this effect on a photo?": {
        "title": "How to create this effect on a photo?",
        "score": 1,
        "url": "https://i.redd.it/fu3brwk15i9d1.jpeg",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "How would you go about creating this effect? It's not pixel sorting/displacement, I think...": {
        "title": "How would you go about creating this effect? It's not pixel sorting/displacement, I think...",
        "score": 0,
        "url": "https://i.redd.it/uy3q3tgj2i9d1.png",
        "content": "",
        "num_comments": 5,
        "comments": [
            "you just transform a single row of pixels vertically.",
            "Stretched effect is just top pixels multiplied upwards.\n\nEdit :I was wrong in deducted Text",
            "how would I go about that? Sorry I'm still finding my way around photoshop, do I just use the rectangle select tool, choose a line of pixels and then somehow extend those? or like duplicate them, but obv I'm not too sure how to do that the right way",
            "Solved!",
            "nevermind I'm being silly."
        ]
    },
    "had to create collage art for school this is what i came up with if i can add anything or if somethings not right please tell me!! and also give it a rating from 1 to 10": {
        "title": "had to create collage art for school this is what i came up with if i can add anything or if somethings not right please tell me!! and also give it a rating from 1 to 10",
        "score": 44,
        "url": "https://i.redd.it/ws95f1s82c9d1.png",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Pretty cool. \nI don't like that the eye cutout doesn't fit the size of the head though.\nAlso, add a layer with a bit of grain or texture to tie it all together.",
            "Add some electricity to the tesla coil. 9/10",
            "The weirdest thing on that collage is a plant with 'eyeballs' on it. Everything else looks pretty solid. The theme was a Tesla?",
            "As an ex tattoo shop worker, I give it a solid 8, people love these kind of stuff",
            "8! Great job blending together the elements. Personally I think the concept and some of the source material is uninspired. But it’s very nicely constructed and attractive.",
            "i made the eye cutout smaller to fit the head and added some more texture thanks for the advice!!",
            "This. Do this. Very good idea.",
            "Remove that tear drop or maybe make it a bit smaller and match it with the background.",
            "9 really cool",
            "Tesla nice"
        ]
    }
}