{
    "Careers/Education Questions - Weekly Discussion Thread - June 27, 2024": {
        "title": "Careers/Education Questions - Weekly Discussion Thread - June 27, 2024",
        "score": 8,
        "url": "https://www.reddit.com/r/Physics/comments/1dpqp9m/careerseducation_questions_weekly_discussion/",
        "content": "This is a dedicated thread for you to seek and provide advice concerning education and careers in physics.\n\nIf you need to make an important decision regarding your future, or want to know what your options are, please feel welcome to post a comment below.\n\nA few years ago we held a graduate student panel, where many recently accepted grad students answered questions about the application process.  That [thread is here](https://www.reddit.com/r/Physics/comments/3i5d4u/graduate_student_panel_fall_2015_1_ask_your/), and has a lot of great information in it.\n\nHelpful subreddits: /r/PhysicsStudents, /r/GradSchool, /r/AskAcademia, /r/Jobs, /r/CareerGuidance",
        "num_comments": 6,
        "comments": [
            "I'm going into my fourth year as a physics major and looking to apply to some summer internships for next year before I enter grad school, but I'm having trouble finding them online. Is there a better way to look besides google search?",
            "Yeah it's hard to gauge. I've only ever seen one PhD state... \"Within the last 5 years...\" Wasn't sure if it was representative of the rest.",
            "Physics PhD a long time after Masters?\n\nBackground: I completed an integrated masters (undergrad degree) in physics, specialising in quantum optics in 2022. \n\nI then decided, against my love for maths and physics, that academia was \n\n(a) Too unstable \n(b) Toxic environment\n(c) Stupidly competitive \n(d) Underpaid \n\nTo pursue a career in. So I then opted to do an MSc in medical physics, hoping for job stability, good pay and somewhat related to my interests of maths and physics. \n\nFast forward, I've completed the MSc and I'm in a training scheme to become a clinical medical physicst. Everything is great apart from one thing: no physics or maths. \n\nThere might be a small chance I'll not get a job at the end of the scheme (only get job stability if there is one!) so I was thinking of doing a PhD after in something I'm passionate about: QKD, quantum optics/photonics / fundamental quantum physics. I want to utilze skills like calculus, linear algebra, analysis DE's, mathematical modelling, AI etc. \n\nMy question is how long is too long from my undergrad masters to start a PhD application wise, where professors will think it's been too long since I've did \"traditional physics.\" \n\nI have the option of doing a medical physics PhD alongside my job which sounds ideal, but I feel like a medical physics PhD is going to be a one of the following: \n\n\"Can i detect this disease with an MRI/Nuc med?\" Where the only maths is some stats and there's no physics. \n\nOr it will be biomedical engineering\n\nOr it will be, \"Is this piece of AI software a hospital bought good?\" So no actual programming just checking if it works. \n\nAnd lastly, \"Is this phantom good for useless QA?\"",
            "I'm a high school student who's going to university in two months. I'm struggling to decide between physics and mechanical engineering (ME) as my major.\n\nI *want* to study physics. I've wanted to do so since 9th grade, and I want to pursue postgraduate studies and academia. However, I'm terrified of the low income and job opportunities in my country (Saudi Arabia). I have four questions to help me decide:\n\n1. Is it optimal to pursue a master's in the US/UK directly after finishing my bachelor's? I'm thinking of taking my master's and continuing in academia there.\n2. In general, is physics a decently paying job? ME would pay better, but I'm more than ready to sacrifice that to pursue physics. I want to research physics for a living. Nothing would bring me more joy than that, but I don't want to suffer financially.\n3. Is most of the physics research nowadays related to the atom? Is there no research or novelties in other fields of physics? Quantum mechanics doesn't sound like my cup of tea.\n4. Building on the last point, is there research in general relativity? I find general relativity to be the most fascinating thing about physics. I did look into the math skills used in relativity (multivariable calculus, non-euclidean geometry, etc.), and I'll enjoy it most.\n\nTo give more details about my interests, I genuinely enjoy calculus, mechanics, and relativity. ME will be about me building and creating, which is great. But I want to do research, work on theories, and think of problems or holes in our current understanding of physics. The thought of getting my own ideas, working on them, and publishing them in research papers just sounds so motivating and exciting.\n\nWith all of the above said, in your opinion, would physics be a better fit for me than ME?",
            "Commenting for visibility. \n\nI was also wondering what someone who got a masters and even published research needs to do 15-20 years out to get accepted to a PhD program. I just mastered out in October because it wasn't a good time to be doing a PhD for me, but I do want to go back later in life.\n\nThe field changes substantially in that time, I've published research but I have no idea if it will demonstrate my capacity for research in 15 years.",
            "Only you can answer what is optimal for you, not internet strangers.\n\nSome things to be aware of about an academic career:\n\n1. Once you have a tenure track job, the pay is good. Not great, but fine. But after spending many years after Bachelors getting paid nearly nothing or modest wages, the real loss is in accumulated wages.\n\n1. The real problem in academia isn't the wages though, it is the job security. At each step (bachelors to grad school, grad school to postdoc, postdoc to next postdoc etc., postdoc to tenure track job) the probability of success tends to be quite low, even among people qualified for the next level. The people who leave the field because they don't like the system, they no longer like the work, or just don't get the next job transition to a career they could have been doing earlier, but now starting out at the bottom of the totem pole. For some they are happy to have spent their time doing physics research while others feel that if they were going to end up in finance/engineering/programming/whatever they might as well have started there right away.\n\n1. Following on the last point, each of those steps in academia typically requires a move, often to another country/continent. There aren't a huge number of physics institutions in Saudia Arabia or even neighboring countries. Moving around a lot might seem exciting to a younger person (or it might seem scary) but many people find that as they grow older they'd like an opportunity to settle down somewhere.\n\n1. Just a note, but the grad school format depends a bit on the country. It is one way in America, another in much of Europe (although the UK is a bit different from the rest). I am less sure about South America, Africa, or Asia. Be sure to understand these differences well before you want to apply for things.\n\n1. At your age you definitely don't need to be (and probably shouldn't be) picking what research area you want to get into. I didn't settle on my primary area until my last year of graduate school (this is a bit uncommon, but still). \"Is most of the physics research nowadays related to the atom?\" there is a sector of physics research called AMO (atomic, molecular, and optics). But there are many other areas too. Condensed matter is one of the largest, but high energy physics, cosmology, nuclear physics, biophysics, and others are big too.\n\n1. Most physics research includes some aspects of quantum physics in one way or another, but don't worry, you haven't really learned what that is, so it's probably too early to pass judgement on it.\n\n1. General relativity certainly is an active area of research.\n\n1. For your education, regardless of what you're interested in (GR or otherwise) the first recommendation is always to focus on your physics courses. Get good grades, understand the materials, ask questions (students who ask questions always do better than those who seem to know everything and don't ask questions). Take as many physics classes as you can while still doing well. With your extra time, take math courses. Definitely take linear algebra and differential equations (ODE and PDE). If you are interested in GR take a differential geometry. If you are interested in particle theory take abstract algebra. Regardless of what you are interested in, continuously elevate your programming skills either in courses or on your own."
        ]
    },
    "Textbooks & Resources - Weekly Discussion Thread - June 28, 2024": {
        "title": "Textbooks & Resources - Weekly Discussion Thread - June 28, 2024",
        "score": 10,
        "url": "https://www.reddit.com/r/Physics/comments/1dqj2m2/textbooks_resources_weekly_discussion_thread_june/",
        "content": "This is a thread dedicated to collating and collecting all of the great recommendations for textbooks, online lecture series, documentaries and other resources that are frequently made/requested on /r/Physics.\n\nIf you're in need of something to supplement your understanding, please feel welcome to ask in the comments.\n\nSimilarly, if you know of some amazing resource you would like to share, you're welcome to post it in the comments.",
        "num_comments": 2,
        "comments": [
            "Is anyone familiar with the book by Christian Fronsdal, *Adiabatic Thermodynamics of Fluids: From Hydrodynamics to General Relativity* (World Scientific, 2020)?  Any opinions about it?",
            "I highly recommend Waves and Oscillations, a Prelude to Quantum Mechanics by Walter F. Smith\n\nTheres only one edition to my knowledge, so youll want the errata as well: https://global.oup.com/us/companion.websites/9780195393491/pdf/Errata.pdf"
        ]
    },
    "What answer can we offer Mr. Burrows": {
        "title": "What answer can we offer Mr. Burrows",
        "score": 36,
        "url": "https://www.reddit.com/gallery/1drc2bf",
        "content": "This is an electoral pamphlet for upcoming UK general elections. While none of the hundreds of physicists contacted have had the time or patience to respond I was thinking myself that I don't quite know how to formulate a response so I'll put it to Reddit. \n\nPlease no rude or disparaging remarks, a big part of science is the need for science education.",
        "num_comments": 17,
        "comments": [
            "Right, I posit some bullcrap, like 1x1=2, don't get a serious response from the scientific community, hence my conjucture has been proven!\n\nScience!",
            "It is impossible to convince this sort. They aren't interested in knowledge. They are interested in feeling like they have knowledge and feeling like they've figured something out that no one else has. If they accepted a challenge to their ideas, they wouldn't have that feeling anymore. So they won't accept it.",
            ">None of the hundreds of physicists contacted have had the time or patience to respond.\n\nYou misunderstand. This is the response.",
            "It's fairly obvious this poor guy never heard of red shift.",
            "\"Ah I think you may be on to something, sir. I have some business to attend to elsewhere.\"",
            "He's not asking for peer review. How do I know this? Because he hasn't produced anything to be reviewed. He's made some claims, done no work to actually produce evidence those claims mean anything, then says anyone who ignores him must be trying to hide something.\n\nThis is called a con-man, not a citizen scientist.",
            "Even if he wasn't full of crap, I don't want my elected officials to worry about general relativity or whatever. It's not their job",
            "Once I received an email from a crank who explained the quantum Hall effect. The explanation was wrong but I appreciated the limited extent of his \"theory\".",
            "Schizophrenia. Youre missing the schizophrenia. Thats why hes petitioning physicists",
            "It is a constant under certain conditions. Spooky action at a distance was in reference to quantum entanglement, where it seems like information travels faster than light, not that everything is relative, which Einstein didn't say."
        ]
    },
    "\"A bright aurora crowns Earth's horizon beneath a starry sky as the International Space Station flew into an orbital sunrise 264 miles above north Montana in the United States\" on October 30, 2021.": {
        "title": "\"A bright aurora crowns Earth's horizon beneath a starry sky as the International Space Station flew into an orbital sunrise 264 miles above north Montana in the United States\" on October 30, 2021.",
        "score": 36,
        "url": "https://images-assets.nasa.gov/image/iss066e023323/iss066e023323~orig.jpg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "This might do better in r/space",
            "- The submitted photo and the submitted title are from https://images.nasa.gov/details/iss066e023323\n (\"iss066e023323\").\n\n  - \"ISS066-E-23323\": https://eol.jsc.nasa.gov/SearchPhotos/photo.pl?mission=ISS066&roll=E&frame=23323 , https://eol.jsc.nasa.gov/DatabaseCameraFiles/ISS066/ISS066-E-23323.txt , https://eol.jsc.nasa.gov/DatabaseImages/ESC/large/ISS066/ISS066-E-23323.JPG\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n* NASA Johnson, \"A Giant Astronomical Machine | Down To Earth - S1:E2\" \"NASA astronaut Don Pettit explains how his perception of the Earth changed during his time aboard the space station.\": http://www.youtube.com/watch?v=w8za0FFO8O0 from https://www.youtube.com/@ReelNASA ; video is from \"Down To Earth\" at https://old.reddit.com/r/programming/comments/8ashen/international_space_station_software_development/dx14w2x/ (\"Donald R. Pettit\")"
        ]
    },
    "Conduction": {
        "title": "Conduction",
        "score": 1,
        "url": "https://www.reddit.com/r/Physics/comments/1drdl3e/conduction/",
        "content": "If I'm not mistaken, when we touch an object, we \"feel\" the temperature resulting from the heat transfer from the object (please correct me if I'm wrong about that). And heat transfer depends partly on the conductance of the object. So let's say you have a poor conductor (like plastic, for example) cooled to freezing temperatures. When we touch it, would it still \"feel\" warm to us due to the lack of conduction, even though it has a low temperature?",
        "num_comments": 0,
        "comments": []
    }
}