{
    "Participate in Piano Jam, the friendly monthly challenge for everybody! [June 2024 #130]": {
        "title": "Participate in Piano Jam, the friendly monthly challenge for everybody! [June 2024 #130]",
        "score": 20,
        "url": "https://www.reddit.com/r/piano/comments/1d6xo7v/participate_in_piano_jam_the_friendly_monthly/",
        "content": "Piano Jam is a non-competitive piano challenge for beginners, professionals, classical, jazz or pop pianists and everyone in between! Pick a piece from the list below, learn it, and post a performance using the **Piano Jam** flair before the end of the month. Perfection is not expected!\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nWelcome to the June, 2024 Piano Jam! We hope you find something below that you will enjoy working on and sharing later this month!\n\nThe next Piano Jam will be posted around **July 1st**. Please suggest pieces for future Piano Jams in our [suggestion box](https://docs.google.com/forms/d/e/1FAIpQLSd5U5DA0OjN1HeaK-5Ue_s92HeZ5ud_2OynMb0WoKt1BPPwrg/viewform).\n\n## Guidelines\n\nPlease share a recording of YOU playing one of the pieces below in a post to /r/piano at any time during the month. **Use the \"Piano Jam\" flair or type \"\\[Piano Jam\\]\"  somewhere in the submission title.**\n\n* You do not have to complete or perfect pieces to submit them, and don't be afraid to simplify/shorten pieces.\n* This is not a contest! It's a chance for you to set a goal for yourself and to share your journey and accomplishments with the /r/piano community.\n* You can submit as many of the pieces listed below as you like.\n* Late submissions (up to two months late) are allowed, but be sure to include the month in the title.\n\n## Classical\n\nThe ABRSM grade estimate is provided in brackets.\n\n* Traditional - [The Piper o' Dundee](https://www.youtube.com/watch?v=NI3GTbStoos&ab_channel=PianoMusic) | [Sheet Music](https://imgur.com/a/EsuuqBf) | [Gr. 2] \n\n* Heinrich Hofmann - [Sketches Op.77, #15 - Waldvöglein (Little Forest Bird)](https://www.youtube.com/watch?v=nkG406JM_TM&ab_channel=Achtelnote) | [Sheet Music](https://www.free-scores.com/sheetmusic?p=aT2pWUgP2g) | [Gr. 3-4]\n\n* Schubert - [Musical Moment No.3 in F minor](https://www.youtube.com/watch?v=YPtyHDqbgFg&ab_channel=JuanTrabal) | [Sheet Music](https://s9.imslp.org/files/imglnks/usimg/c/c0/IMSLP699556-PMLP2066-SheetMusic_26826.pdf) [Gr. 6]\n\n* Debussy - [La Fille aux cheveux de lin (The Girl with the Flaxen Hair)](https://www.youtube.com/watch?v=KYLjHziapRs) | [Sheet Music 1](https://ks15.imslp.org/files/imglnks/usimg/1/17/IMSLP254507-PMLP02394-Debussy,_Claude-Album_Durand_8246_05_La_Fille_aux_Cheveux_de_Lin_scan.pdf) | [Sheet Music 2 (with some fingerings)](https://michaelkravchuk.com/wp-content/uploads/2020/05/Debussy-The-Girl-With-The-Flaxen-Hair.pdf) | [Gr. 6-7]\n\n* Bach - [Invention No.5 in Eb Major, BWV 776](https://www.youtube.com/watch?v=IwzIKFKuTxA) | [Sheet Music](https://s9.imslp.org/files/imglnks/usimg/b/b0/IMSLP864214-PMLP3267-15-two-part-inv-book.pdf) (scroll to page 10)| [Gr. 5-7]\n\n## Contemporary / Anime / Other:\n\n* Nobuo Uematsu - [Aerith's Theme (Final Fantasy VII)](https://www.youtube.com/watch?v=_w2jrGbZ27o) | [Sheet Music](https://static1.1.sqspcdn.com/static/f/801966/13982964/1315096140870/Aeris-Theme-Aerith-piano-sheet-music.pdf)\n\n\n## Jazz / Ragtime:\n\n* \"Fats\" Waller, Harry Brooks - [Ain't Misbehavin'](https://www.youtube.com/watch?v=_mF-QyvBqgs) | [Lead Sheet](https://therealbook.info/view/index/917/) | [Transciption of Fats, for some ideas](https://www.youtube.com/watch?v=lakid_bpW9c) | [Easy Arrangement](https://daveratcliffepiano.com/Teaching/AintMisbehavin.pdf)\n\n* Scott Joplin - [Paragon Rag](https://www.youtube.com/watch?v=aZfKUUeftlU) | [Sheet Music](https://vmirror.imslp.org/files/imglnks/usimg/5/5a/IMSLP808354-PMLP13287-Paragon_Rag-Edited.pdf)\n\n\n## 3-Month Classical Pieces (April-June):\n\n* Beethoven - [Sonatina in G Major, Anh. 5 (Both Movements)](https://www.youtube.com/watch?v=_NPhC8Xq_wM) | [Sheet Music](https://s9.imslp.org/files/imglnks/usimg/2/27/IMSLP215111-PMLP96125-Beethoven_Sonatina_in_G_Anh.5.pdf) | [2-3]\n\n* Brahms - [Intermezzo in A major, Op. 118 No. 2](https://www.youtube.com/watch?v=20Gb0JcviRA) | [Sheet Music](https://s9.imslp.org/files/imglnks/usimg/c/cd/IMSLP84700-PMLP04652-Brahms_Werke_Band_14_Breitkopf_JB_66_Op_118_scan.pdf) (scroll to #2) | [7+]\n\n* Dmitri Shostakovich - [Three Fantastic Dances - Op.5 (All 3 Dances)](https://www.youtube.com/watch?v=LSUh7c6JN7M) | [Sheet Music](https://www.petruccilibrary.us/files/imglnks/music_files/PMLUS04034-Shostakovich_-_Three_Fantastic_Dances_\\(Schirmer\\).pdf) | [7+]\n\n\n\n\n\n## Submissions from [last month](https://reddit.com/r/piano/comments/1cjubc7/participate_in_piano_jam_the_friendly_monthly/)'s Piano Jam\n\nThanks to everyone for participating and sharing your music with all of us!\n\n* Angel Eyes - [musodave62](https://www.reddit.com/r/piano/comments/1cmjeuv/angel_eyes_all_critique_welcome/)\n\n* Donna Lee - [Elliott_Well24](https://www.reddit.com/r/piano/comments/1cpzq84/donna_lee/)\n\n* Shostakovitch, Three Fantastic Dances, Op. 5 No. 2 - [sleepysadsorry](https://www.reddit.com/r/piano/comments/1cqb8rx/three_fantastic_dances_op_5_no_2_dmitri/)\n\n* Reinecke, Elegy - [Other_Insect_7702](https://www.reddit.com/r/piano/comments/1d2t4h6/piano_jam/)\n\n* Reinecke, Elegy - [amyaimee](https://www.reddit.com/r/piano/comments/1d5cpih/reinecke_elegie/)\n\n\n\nTo listen to the newest submissions, [search for the *Piano Jam* flair](https://www.reddit.com/r/piano/search/?q=flair%3A%22Piano%20Jam%22%20OR%20flair%3A%22%F0%9F%A4%98Piano%20Jam%20Challenge%22&restrict_sr=1&sort=new).\n\n&#x200B;\n\n***I hope we didn't miss anyone - if so, please let me know!***",
        "num_comments": 17,
        "comments": [
            "Fats waller video not available",
            "Also I think the previous month included the bach invention. Was there anything else that was supposed to be here this mth?",
            "When I search for the Piano Jam Flair, it comes up as no search result. Is there a way to find all the recent submissions?",
            "I think I found a little typo in Hofmann score, beats 10 and 12 left part Ds should be sharpened (as is in the previous beats and top part)",
            "Hmmm, all videos work for me. At least there's tons of \"Ain't Misbehavin'\" videos anyone can search up.",
            "Whoops! Thanks for catching this. No, there's nothing else - I had that in my list of ones to do and forgot to remove it after picking it last month. I'll just delete it since I don't really have time to look for anything else, but if you have a suggestion, I can throw it in :)",
            "Because the note is tied over from the previous measure's D#, it doesn't need the # sign re-stated. i.e. the note is still sharp because of the tie.",
            "Your Piano Jam submission is live now.",
            "Shoot ! I started on it, can we have a two-months special Jam for Bach's inv 5 !?",
            "No problem - I've added it back in!"
        ]
    },
    "'There are no stupid questions' thread - Monday, June 24, 2024": {
        "title": "'There are no stupid questions' thread - Monday, June 24, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/piano/comments/1dn6hx1/there_are_no_stupid_questions_thread_monday_june/",
        "content": "Please use this thread to ask ANY piano-related questions you may have!\n\nAlso check out our [FAQ](https://www.reddit.com/r/piano/wiki/faq?utm_source=reddit&utm_medium=usertext&utm_name=piano&utm_content=t5_2qnw8) for answers to common questions.\n\n*Note: This is an automated post. See previous discussions [here](http://www.reddit.com/r/piano/search?q=title%3A%22no+stupid+questions%22&restrict_sr=on&sort=new&t=all).",
        "num_comments": 72,
        "comments": [
            "i've been playing avril 14 by aphex twin for a while now and i'd love to learn new pieces. looking for something more contemplative, airy 7s. I've played yann tiersen pieces as well and found those pieces beautiful.",
            "Hey All. I bought a p145 floor model (good deal) but it came without a music rest. I assumed it would be easy to find a compatible rest but have been unsuccessful for months. \n\nCan anybody recommend a stand that would be compatible?",
            "How do you deal with mistakes when playing a piece? I seem to completely lose all memory of what's next or just completely fixate on that one mistake and end up making more thereafter.\n\nAny tips?",
            "are there any pieces that use the soft and sostenuto pedals?",
            "Started a week or two back from absolute zero; I find when doing the exercises and beginner pieces from Bill Hilton's course on Youtube, I start to build them into a muscle memory. Is that counter to developing sight reading skills? Even if I look at every note and think \"F...G...etc\" to myself, my hands still kinda physically know the next key after a few passes. Am I over thinking this and site reading just comes from reading new pieces?",
            "How much harder is rhapsody 2 than la Campanella?I just started listz Campanella over the summer and I learned it without much trouble. However, my goal is to eventually learn the Hungarian rhapsody 2 but I heard its mountains more difficult than Listz Campanella. Ive learned a decent chunk of Chopin etudes and Rachmaninov. Im wondering if i am ready to tackle such a piece, but Im not sure if Ill just be wasting my time?",
            "Is there a good way to minimize \"random\" mistakes? When I record myself, sometimes I inexplicably play a wrong note in a place that I've never messed up before. Sometimes my brain goes blank during a passage I just practiced 10x about 15 min earlier and I play eg 12345 even though I had already filled into 12312. Sometimes I look at the music and I suddenly can't tell whether the note is an E or G. I'm an intermediate player.",
            "Why is sight reading so hard???\n\nI just completed an oral entrance exam at a music school, where I had to sight read. It was horrible. However, I did the exact same exam at the same music school one year ago and I also failed because of sight reading. In the year in between, I practiced every day, 5 easy pieces daily at least (e.g. Haydn Minuets, Mikrokosmos 1-4, Album fr die Jugend), sight reading was my top priority. However, I did not feel like I made any meaningful progress. Was my method ineffective or does it just take a long time for everyone?",
            "I was wondering if there were any apps that let you import pdfs/scan and then let you play along to the sheet music similarly to flowkey where it would read the midi data so that it can follow you playing the correct notes? Preferably not subscription based but if thats all there is to have that possible Id still like to know! Forscore doesnt do this for example right?",
            "I'm about to start working on a passage that changes irregularly between 5/8, 4/8, 6/8, 7/8, 8/8, etc. It's marked at quarter note = 192, so well past the point I'll be able to set it to an eighth note effectively. If I set it to a quarter note, things stop to line up very quickly. Wondering if I'm missing some clever trick here that will let me do even 75% speed with the metronome, or if I'll have to get this part up to speed without my fancy tools."
        ]
    },
    "Radiohead - Last Flowers": {
        "title": "Radiohead - Last Flowers",
        "score": 8,
        "url": "https://v.redd.it/28ag2t5u6i9d1",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Nice. I love all things Radiohead. Im learning as many of their songs as I can. So far, Ive learned Pyramid Song, Last Flowers, and Everything In Its Right Place. \n\nLike Spinning Plates is next.",
            "What piano do you have?",
            "Me too man, thanks for listening.",
            "Roland RD-88 digital piano. The piano sound is a VST called Native Instruments Noire",
            "If I may ask you something: do you think Im better off learning the songs as played? Or doing what you do and incorporate the vocal melodies?",
            "Thanks mate! Sou da amazing",
            "Thanks for this, Ill feel it out. Much appreciated!",
            "OP (/u/dabbling) welcomes critique. Please keep criticism constructive, respectful, pertinent, and competent. Critique should reinforce OP's strengths, and provide actionable feedback in areas that you believe can be improved. If you're commenting from a particular context or perspective (e.g., traditional classical practice), it's good to state as such. Objectivity is preferred over subjectivity, but good-faith subjective critique is okay. Comments that are disrespectful or mean-spirited can lead to being banned. Comments about the OP's appearance, except as it pertains to piano technique, are forbidden.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/piano) if you have any questions or concerns.*",
            "That's really up to you. Personally I enjoy trying to capture as much of the feel of the original as possible and to me that means including the vocal melody.\n\nThis is partly because I also play a lot of songs that are not originally piano based. When you're already adapting multiple instruments it doesn't seem a long jump to also include the vocals.\n\nFrom your list it looks like you focus more on songs that have a strong piano/keyboard component in the original versions, so it makes sense to start with the original piano parts. It truly is up to you though - there is no best way.",
            "If you enjoy this, you may like my [playlist of Radiohead covers](https://www.youtube.com/playlist?list=PLWagq5aQ_TTUBGzKqn7fY9SxTLseky0Gw)."
        ]
    },
    "After 6 years it finally feels easier!": {
        "title": "After 6 years it finally feels easier!",
        "score": 38,
        "url": "https://www.reddit.com/r/piano/comments/1dr1mob/after_6_years_it_finally_feels_easier/",
        "content": "I decided at age 36 to try learning piano. I took lessons for a year or so until covid happened, then I did a Playground Sessions course. I’ve been just doing my own thing since then. I’m not a super dedicated student, sometimes I go weeks without touching the piano. I started working on a song this week and for the first time ever it doesn’t feel like such a terrible ordeal. I can read music well enough now that I don’t have to memorize everything. I can learn a section of music well enough to record it in a few hours instead of a few weeks. I have no idea how actual musicians make playing look so easy. It’s so hard! But I’m finally feeling more hopeful about it and I thought I would share since I know there are a lot of other learners in this sub.",
        "num_comments": 13,
        "comments": [
            "This is exactly how it goes. You get better and things that used to challenge you seem easy now. Congrats!",
            "I'm also 42, and I just started lessons this year.  Hopefully I'll have the same kind of breakthrough before I'm 50!",
            "Me too. I'm on 3 years and can actually play through music slowly as I read it now. Still takes me a while to get up to speed, and my ability to remember music is awful. I have recently learned that singing along and being conscious of the harmonies, really help.",
            "Awesome to hear. Keep at it, you're never too old!",
            "Started at 29; 4 years into it and still feel like there is so much to learn with musicality. Im hoping one day it all starts coming together.",
            "Nice! Sometimes I can sing and play if its a song I know really well. Sometimes I need all of my brain to focus on the piano part.",
            "One thing I have noticed is that by the time I spend months learning a song I kind of hate it. Once I can finally play it I dont even want to any more. I dont think I could sit down and play a single song that Ive learned in the past without spending some time relearning it. I hope I will reach a point where I can play through songs just for the enjoyment of doing it.",
            "Started at 39 last year. Struggle with reading and playing, but pretty good with intervals. Working on Bachs minuet 10, just friends, voice leading, and [gulp] rhythm practice.\n\nLast year, it took me 6 months to learn The Christmas Song. I have kind of forgotten a third of it.\n\nBut my latest practice has helped understand how that song is put together.",
            "U are now 42?",
            "Thank you "
        ]
    },
    "My attempt at Chopin Nocturne Op. 27 no. 2": {
        "title": "My attempt at Chopin Nocturne Op. 27 no. 2",
        "score": 4,
        "url": "https://v.redd.it/yg35cf8v6i9d1",
        "content": "Hi, I have been playing the piano since forever, with a 10 year gap in between. My technique is quite bad anyway, probably not good enough for this piece, but at a certain point you have to work with what you got. \nI made many mistakes, and I basically gave up on getting measure 32 fast triplets up to tempo.\nI hope I got the piece flowing though.",
        "num_comments": 10,
        "comments": [
            "Your technique seems good enough to me for this. You're doing a great job",
            "Thank you. I think I'm quite good at hiding problems behind rubato ",
            "Thank you. Some sections sound a bit fast to me when I listen to it, but I don't feel it when I'm playing it. Also when I listen to it on the recording it sounds dynamically a bit flat, but on this one I'm struggling to improve it. I find hard to play very soft on the low notes at least on this piano.",
            " a bar where you have to do these weird jimps...and I found it very confusing and difficult and you navigated it very well",
            "You are talking about measure 42 to 45? There the descending arpeggios with the right hand are triplets with 3 over 2 polyrhithm and feels hard to phrase because the alternating high-low note pattern calls for dividing them in group of 2 instead of 3. I listened a lot to the Rubinstein version and noticed that what it does is that he plays those section quite fast, and he slightly alter the left hand tempo so that basically the triplets sound more like regular semiquivers. I tried to imitate that. It took a lot of practice. Not easy to explain in words but I hope it makes some sense. The last descending arpeggios in triplets in measure 45 is similar in that regard, you want to move the accents in less natural positions and not at the start of each triplet as your hands would like to do. This last one though is generally played slower and slowing down toward the end. Hope it helps.",
            "Not sure what measure but it's an ass pain",
            "OP (/u/LudBee) welcomes critique. Please keep criticism constructive, respectful, pertinent, and competent. Critique should reinforce OP's strengths, and provide actionable feedback in areas that you believe can be improved. If you're commenting from a particular context or perspective (e.g., traditional classical practice), it's good to state as such. Objectivity is preferred over subjectivity, but good-faith subjective critique is okay. Comments that are disrespectful or mean-spirited can lead to being banned. Comments about the OP's appearance, except as it pertains to piano technique, are forbidden.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/piano) if you have any questions or concerns.*",
            "It's good! Technically proficient and hard to critique. \n\nI'd say turn the volume up and let yourself be more expressive with shapes and phrasing. It feels a little flat at the moment.\n\nI'd also say it's a little too fast, but that's preference.",
            "https://youtube.com/clip/UgkxHCSuCJvDC-UGc6zmjlArGCnmPMYIWJ7X?si=mXsWCTLFgYekhhrH"
        ]
    }
}