{
    "Jill Biden making a statement with her VOTE dress by Christian Soriano": {
        "title": "Jill Biden making a statement with her VOTE dress by Christian Soriano",
        "score": 10483,
        "url": "https://i.redd.it/ur41jp42pe9d1.jpeg",
        "content": "",
        "num_comments": 1515,
        "comments": [
            "Looks like a placeholder because the real dress is still loading",
            "I would have been more impressed if she wore the outfit Jack Black wore.",
            "Better than \"I don't care\"",
            "R/pics about to be in full propaganda mode.",
            "Bidens 4 year plan is to stay alive.",
            "Hear me out, Biden wasnt great yesterday because he wore a tie. Today he sounded great but he didnt wear a tie, coincidence?",
            "The amount of absolute cope and gaslighting going on today does not inspire confidence.",
            "Bidens PR team earning that paper",
            "Honestly just looks like a weird missing texture message.",
            "Damn Reddit is trying HARD today to paint over last night's disaster LMFAO "
        ]
    },
    "Matthew McConaughey & Woody Harrelson paddle boarding together in Croatia.": {
        "title": "Matthew McConaughey & Woody Harrelson paddle boarding together in Croatia.",
        "score": 38581,
        "url": "https://i.redd.it/7lmaqpsaod9d1.jpeg",
        "content": "",
        "num_comments": 1045,
        "comments": [
            "Imagine having a chill moment with your bro, and a dozen paparazzis jump in your face to take photos.",
            "\"This place is like somebody's memory of the sea, and the memory is fading.\"\n\n\"I just want you to stop saying odd shit\"",
            "I just want you to stop saying odd shit.",
            "I'm just gonna pretend this is where Rust and Marty went after season 1.",
            "Oh no, now somewhere theres a sack not being hackied",
            "They're just trying to get to Woody, Conan, and Ted's houseboat.",
            "Brothers from another mothoh wait.",
            "Thats what I love about Woody Harrelson:  I get older, he stays the same age yes he does yes he does.",
            "Woody, I told you to paddle on the left side. Im right, Im right, Im right",
            "Ok but can we get back to Rampart?"
        ]
    },
    "\"MAGA\" Originally used by Reagan as a campaign slogan in his presidential campaign. Trump steals it.": {
        "title": "\"MAGA\" Originally used by Reagan as a campaign slogan in his presidential campaign. Trump steals it.",
        "score": 2276,
        "url": "https://i.redd.it/kpmtij1kqe9d1.jpeg",
        "content": "",
        "num_comments": 305,
        "comments": [
            "And Reagan stole it from Margaret Thatcher, who was actually being clever when she said, \"Make Britain Great again\"",
            "Trump was selling that Reagan narrative hard last night.",
            "Its an old play. Even the Simpsons joked about it in a 2008 episode. Ralph Wiggum was running for an election. He said it lets make America great again.\n\nIts scary how life seems like its imitating art.",
            "Reagan is personally responsible for ruining America and that should be a lesson for anyone that buys into maga bullshit.",
            "Still waiting for one of them to tell me when America was this \"great\" that they want to get back to.",
            "Serious cope even on r/pics",
            "Hmmm also a celebrity of sorts that had no business being a president interesting",
            "If I had a nickel for each and every time that slogan was used by a demented right-wing President with a terrifyingly large and rabid cult of personality who turned his back on a once-in-a-generation outbreak that left thousands of people dead, Id have two nickels.  Not much, but its weird it happened twice.",
            "Do you want to know why the middle class is America is disappearing? Look no further than Ronald Reagan. His Reaganomics did not trickle down. It did nothing but give the rich more money to shut down the middle and low income citizens. Trump and his cronies idolize Reagan.",
            "The guy who has literally stolen everything for decades stole something?\n\nFuckin crazy, man..."
        ]
    },
    "Early 2000's LAN party's": {
        "title": "Early 2000's LAN party's",
        "score": 4411,
        "url": "https://www.reddit.com/gallery/1dqulqh",
        "content": "",
        "num_comments": 568,
        "comments": [
            "I haven't thought about Bawls energy drinks in ages really.  Thanks for the flashback to those blue bottles with the bumps all over them.   \n\nJolt cola walked so that Bawls could run",
            "That's a lot of kilowatts.",
            "Wow, where was that? Thats A LOT of people. Never even heard of them that big back then.",
            "Before my time but looks like the good old days",
            "I had completely forgotten about those novelty fiber optic table lamps on pic #6.",
            "I can smell these photos.",
            "Where is the one with bro duct tapped to the ceiling!?",
            "I remember one of those parties where they had a large mobile power supply stationed at the front.\n\nThey also gave everyone a number and called batches of them (like: \"Numbers 21 to 40, you may now turn on your PCs\") so that they wouldn't trip breakers due to the initial power surge on flipping the power switch.",
            "Im sad I was too young for this era of gaming. Would be a little too stinky in those rooms for my liking, but Im sure the vibes and atmosphere would be immaculate",
            "This is rare, a collection of LAN party photos and they didn't include the one with the guy duct taped to the ceiling?"
        ]
    },
    "Eminem serving food to costumers at his Mom's Spaghetti restaurant": {
        "title": "Eminem serving food to costumers at his Mom's Spaghetti restaurant",
        "score": 83974,
        "url": "https://i.redd.it/ajh4mazl4c9d1.jpeg",
        "content": "",
        "num_comments": 1995,
        "comments": [
            "You get 1 shot to place your order correctly",
            "I don't see anyone in a costume.",
            "I wonder how he would handle complaints? No I don't. lol",
            "What costume is she wearing?",
            "To be clear, the restaurant is named \"Mom's Spaghetti\". It's owned by Eminem, not his mom who was an abusive psycho bitch he disowned.",
            "I swear I saw this guy spitting on my onion rings at Burger King.",
            "Why is costumers such a common misspelling?",
            "What sort of costumes do they make?",
            "Does he only serve the people who come dressed up in costumes?",
            "He looks calm and ready"
        ]
    }
}