{
    "Very pretty Bleeding tooth fungus, it is not toxic but not eaten very much because it is so bitter.": {
        "title": "Very pretty Bleeding tooth fungus, it is not toxic but not eaten very much because it is so bitter.",
        "score": 6589,
        "url": "https://i.redd.it/thrw30xal18d1.png",
        "content": "",
        "num_comments": 248,
        "comments": [
            "That’s straight outta Alice in Wonderland….",
            "\"Why's it so bitter?\"  \n\n\"It doesn't get eaten very much.\"",
            "Who else here wants to pop the red bubbles and see what comes out?",
            "The fact that someone even tried it to figure out if it was toxic or not is terrifying. \n\nNot a lot of foods say ‘don’t eat me- poison!’ nearly so loud.",
            "Forbidden Jelly Belly",
            "Wowza!! So pretty but yeaaaaahhhhh I wouldn’t try eating it 😚",
            "That is one of the most toxic looking things I’ve ever seen",
            "Thanks I hate it",
            "If not dessert, then why dessert shaped?",
            "Found in North America, mostly in the Pacific NW, some places in Europe\n https://en.m.wikipedia.org/wiki/Hydnellum_peckii"
        ]
    },
    "2 neighbors think the country is in distress.": {
        "title": "2 neighbors think the country is in distress.",
        "score": 4552,
        "url": "https://i.redd.it/kao5yxlln18d1.jpeg",
        "content": "",
        "num_comments": 885,
        "comments": [
            "They’re owning a home, they look like nice houses, lawns are perfect and lush, cute little mailboxes out by the quiet street … sign me up for that distress baby",
            "They are absolutely correct: the USA is in distress. I think a certain Kentucky Turtle said it best:\n\n![gif](giphy|BO1AaYgFQtnh08kRtF)",
            "A house right across from my kid's elementary school flew their flag upside down a week ago. The next day they flew the Union Jack. 🤔\n\nIt's the same house that had anti abortion signs up when reproductive rights were on the ballot in Michigan. \n\nJust super chill and well-adjusted people, rallying to force 10-year old girls to carry a pregnancy to term, while they see kids that age all day long. It's sick.",
            "These are the same people who called Colin Kaepernick a terrorist for kneeling during the anthem at NFL games.",
            "maybe they're distressed about the awful green gutter in front of brick?",
            "It is. But not for the reasons they think. I would just laugh hysterically and point at their ignorance every time i see them. Just bust out laughing at them. You don’t even have to say anything.",
            "as a non-American I was looking at this  for several seconds wondering what's going on and then I remembered how Republicans like to act like juveniles",
            "I think it’s so weird how you fly your flags on your properties. Over here in the UK you generally avoid anyone waving the Union Jack around their property. It’s someone who’s got their pants in a twist and drank too much of the nationalism juice.\n\nAnd also, at the same time, so what?  Is it really that inflammatory?",
            "[deleted]",
            "You know, back in my punk rock days, we'd put American flags upside down... but probably for the exact opposite reasons these chodes are doing it."
        ]
    },
    "Some items from my great grandfather I found interesting ": {
        "title": "Some items from my great grandfather I found interesting ",
        "score": 1282,
        "url": "https://www.reddit.com/gallery/1dlqm7u",
        "content": "",
        "num_comments": 80,
        "comments": [
            "Great keepsakes, really interesting.\nRespect to your Grandfather.",
            "Idk if this breaks rules here but I found all these items and I figured they were historically significant and interesting. \n\nMy G.Grandfather @ 16 years old: https://imgur.com/a/KlEFIvS\n\nHe eventually ended up in Europe, and fought in the Battle of the Bulge. The firearm was taken from a Nazi officer/soldier (idk), along with his belt and medal apparently.\n\nI’ve been told it’s a Czechoslovakian made Mars .32 caliber",
            "Just in case you're curious about the Japanese flyer - it says that the \"military government miscalculated American strength\".\n\nBit clunky as it's propaganda, but I'm guessing they were given these to hand out or they were dropped over occupied territory.",
            "They are awesome, I've never seen a \"ceased resistance\" leaflet, I bet hardly any survived, and that money looks fascinating too. You should see if any museums would like to loan it to display/record it for posterity.\n\n[Here's an extract from a diary of a member of the 535th AAA battery at the Battle of the Bulge.](https://battleofthebulge.org/2012/03/30/diary-of-john-rafalik-535th-aaa-battery-d/)",
            "Holy shit nut. Keep that stuff in good shape.",
            "Did you get any stories from your grandpa about any of it?? Much respect for his service. \n\nMy grandpa fought in the pacific theatre and did the island hopping. I got stories from him as he (and I) got older but it was difficult for him to talk about. The things he did share though were incredible. It’s so different getting a first hand account.\n\nEdit: Just saw it was your great grandpa. So, probably not. Still a great find and a way to learn about him a bit.",
            "Just so you know OP, that 10 francs bill is worth 90€ today (96$), provided there’s a French flag in the back (which is the rarest edition)\n\nAlso: very cool stuff from your great grandpa!",
            "I think your great grandpa was a big fan of Wolfenstien",
            "Save them as souvenirs. By your comment explaining the items it sounds like your great grandfather was a badass!",
            "Could you flip that Iron Cross around and show us the back?   it seems kinda weird to me given that it says 1813 and has no other markings"
        ]
    },
    "For the state of Louisiana": {
        "title": "For the state of Louisiana",
        "score": 816,
        "url": "https://i.redd.it/rb3tr3t4g38d1.png",
        "content": "",
        "num_comments": 38,
        "comments": [
            "I told my husband, \"You can't teach kids that this country was started by the Protestants who escaped their county for religious freedom; then turn and force your version of religion on them.\"",
            "This is why their version of Christianity is so dishonest. It is never about doing something positive or good. It's about fighting the libs",
            "Kids deserve free lunches either way",
            "They are Taliban-wanna-be's.",
            "It's just a control game by the crazy religious nuts. It starts with the Ten Commandments until they're eventually teaching this nonsense in the classrooms.",
            "Giving food to children is just about the best use of my tax dollars I can possibly imagine.",
            "That's the most *actual* christian thing I read in a while",
            "God is almighty but need you to worship",
            "The one thing that I have noticed is that these folks are not \"Christian\" by any objective definition. Most are totally ignorant of the scriptures that they claim are the literal word of God, particularly the New Testament. I am a recovering Catholic who was fully ~~brainwashed~~ ~~indoctrinated~~ educated in religious schools until I finished high school. I am fully confident after having had several conversations with them that they don't have the slightest clue what Jesus would have been about, regardless of whatever flavor of \"Christianity\" they belong to. If I were to still be a religious sort, I would label them heretics.",
            "Look up what Minnesota Governor Walz said as well: \"We don't have the 10 commandments posted in our classrooms, but we have free breakfast and lunch.\""
        ]
    },
    "Elsie Allcock Has Lived In The Same House For 105 Years.": {
        "title": "Elsie Allcock Has Lived In The Same House For 105 Years.",
        "score": 7192,
        "url": "https://i.redd.it/8nn506oh008d1.jpeg",
        "content": "",
        "num_comments": 184,
        "comments": [
            "Boy, people really do shrink.",
            "There can’t be very many people who have ever lived in a single home for longer than her in the entire human experience.",
            "105 years in the same house? Elsie Allcock has seen more history from her front porch than most of us have in a lifetime!",
            "105 years of living with the last name “Allcock.”\n\nThat probably does something to ya.",
            "British Woman’s Unwavering Devotion to Her 105-Year-Old Home\n\n(https://allchronology.com/2023/07/18/a-century-of-memories-british-womans-unwavering-devotion-to-her-105-year-old-home/)",
            "House is double glazed and bricks are painted now, and I bet she has the best grandma-grade garden in her block. \n\nAnd she is about a foot shorter :)",
            "Landlord: \"This rent control is killing me!\"",
            "She’s gotten much less creepy over the years.",
            "And only has 34 more payments on it.",
            "Same haircut also"
        ]
    }
}