{
    "r/piercing hub": {
        "title": "r/piercing hub",
        "score": 57,
        "url": "https://www.reddit.com/r/piercing/comments/1bks4xr/rpiercing_hub/",
        "content": "[View Post](https://sh.reddit.com/r/piercing/post-viewer/1bks4xr)",
        "num_comments": 1,
        "comments": []
    },
    "UPDATE! Awarding and earning points for outstanding comments": {
        "title": "UPDATE! Awarding and earning points for outstanding comments",
        "score": 5,
        "url": "https://www.reddit.com/r/piercing/comments/1cnucm4/update_awarding_and_earning_points_for/",
        "content": "**Original post**: https://reddit.com/r/piercing/comments/1bkfem5/new_awarding_and_earning_points_for_outstanding/\n\nHi!\n\n> You know how sometimes you come across a great comment? One that is really helpfully or informative, one that educates OP with respect and kindness?\n\n> One of those comments that makes you want to wave at OP and point it out to them. You know, one of those comments you would give an award to when awards still existed?\n\n> Alas, we don’t have the power to bring back awards (we’d only wish) but we now do have a way to celebrate those comments that deserve it.\n\n> Starting right now, if you see a comment that deserves special attention for being really helpful, informative that you want to put in the spotlight reply to that comment with;\n\n> !readthisone\n\n> That will notify the mods and we’ll (have a bot) hand out one point to the author of the comment.\n\n> Once we’ve monitored the system for a while to catch and fix any kinks, you can award points without us having to do it for you.\n\n> &#x200B;\n\n> * UPDATE: What do the points do, other than bragging rights 😂 ? There will be a post to honour and keep track of the most valued commenters. We'll post that a few weeks from now, so it might be time to improve your commenting or to show your appreciation of great comments\n* I made an awesome comment, can I give myself a point? Nope, you can’t. You should make your comment so awesome that others want to give you a point for it.\n\n> &#x200B;\n\n>",
        "num_comments": 0,
        "comments": []
    },
    "Normalise guys with piercings": {
        "title": "Normalise guys with piercings",
        "score": 1174,
        "url": "https://www.reddit.com/gallery/1dqma48",
        "content": "I went to the piercingshop and had my jewelry changed. I love the simple and softer look. They may be on the femine-edge, but I don't care and really like my new set up.",
        "num_comments": 115,
        "comments": [
            "^random ^reminder **Don’t downvote comments just for asking a question or trying to learn** ^do ^upvote ^good ^advice ^and ^downvote ^bad ^advice\n- - - \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/piercing) if you have any questions or concerns.*",
            "Very pretty setup, and I think piercings for guys is normalized at least in this community!",
            "arent they already normalised lol?",
            "ooh i love your set-up!!",
            "It may not be \"Normalized\", but it's a far cry from what it was. I certainly received my share of unwelcome comments back in the day. (My first lobe was in 1977 and helix in 1985.) Mean people suck (and they are not a protected class).\n\nI realize this this might come off as a total lack of empathy on my part. While there's a long way to go, at least it's trending in the right direction.  Your setup us sweet, btw.",
            "It is normal?",
            "1000% agree. i’m a guy who loves piercings. currently have rook and firsts in ears and my septum done, but planning on getting many more in the future!!",
            "Loveeee piercings on guys omg",
            "To me it's super normal and I like it",
            "I don't think they're feminine at ALL, they're gorgeous! The gold is so cute on you"
        ]
    },
    "Yall are so cool.": {
        "title": "Yall are so cool.",
        "score": 38,
        "url": "https://www.reddit.com/r/piercing/comments/1dr42n2/yall_are_so_cool/",
        "content": "Look, if you have a piercing, you are genuinely amazing. I had my first attempt at putting my new earring in (first one) and It was so nerve wracking because.... well, its metal going through your skin. After that whole endeavor, and actually getting it done in the first place, I have a newfound appreciation for anybody with a piercing. Hope you have a good morning/day/night. <33",
        "num_comments": 4,
        "comments": [
            "^random ^reminder **Don’t downvote comments just for asking a question or trying to learn** ^do ^upvote ^good ^advice ^and ^downvote ^bad ^advice\n- - - \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/piercing) if you have any questions or concerns.*",
            "this is sweet :)",
            "I only got my first piercings done 4 weeks ago and it was quite exciting. I'm not able to switch anything out yet though, but it is an interesting feeling having something inside my skin like that.",
            "Aweee thank you this is so nice 🥺💞"
        ]
    },
    "What my jewelry looks like at the moment": {
        "title": "What my jewelry looks like at the moment",
        "score": 135,
        "url": "https://www.reddit.com/gallery/1dql7g7",
        "content": "",
        "num_comments": 17,
        "comments": [
            "^random ^reminder **[rule 4](https://www.reddit.com/r/piercing/comments/qvnmg9/rpiercing_rule_spotlight_rule_number_four/), keep your comments piercing related**      \n- - - \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/piercing) if you have any questions or concerns.*",
            "Looks great, but I might consider downsizing the industrial bar - it looks pretty long and could get caught on things and irritate your piercings!",
            "your setup scratches my brain in a good way, very nice!",
            "Love the set up, silver looks great on you!",
            "so cool! how was it for you to heal the conch?",
            "I love the star/sparkle pieces especially!!",
            "omg I love those star shaped ones. Where are they from, if you don’t mind?",
            "the star above your industrial looks like it’s smushing your ear/is too small. Other than that this is a really pretty setup! The staggered lobe piercings are darling.",
            "Oooh, where did you get the outer conch ring? Looks so cool!",
            "bro im in love with it… i only have one cwrtilage peircing wnd it wont heal at all and ive had it for over a year- im ready to take it out n give up"
        ]
    }
}