{
    "Weekly General Discussion Thread (June 23, 2024)": {
        "title": "Weekly General Discussion Thread (June 23, 2024)",
        "score": 24,
        "url": "https://www.reddit.com/r/Piracy/comments/1dmqr7b/weekly_general_discussion_thread_june_23_2024/",
        "content": "&#x200B;\n\nThe Weekly Thread is for the [r/Piracy](https://www.reddit.com/r/Piracy/) community to discuss whatever is on their mind, whether it is related to digital piracy or not.\n\n# 📜 ➜ Wiki + Megathread\n\n* Don't forget to browse the [Wiki](https://www.reddit.com/r/Piracy/wiki/index/), where you'll find the [Megathread](https://www.reddit.com/r/Piracy/wiki/megathread/) and [FAQ](https://www.reddit.com/r/Piracy/wiki/faq/). There, you'll discover a multitude of websites, apps, tools, and a wide range of outstanding resources.\n\n# 🪶 ➜ Follow the Rules\n\n* [**Rules are still applicable**](https://www.reddit.com/r/Piracy/wiki/piracy_rules/)**, so please do not request for  specific pirated content (ie. specific  movie, book, etc.) and  definitely don't link to any. Do not mention specific media names asking  for help in finding them.** \n* Your question also may have been asked previously - you can search the subreddit via the search bar or even google - example: [https://i.imgur.com/1jA767u.jpg](https://i.imgur.com/1jA767u.jpg)\n\n For previous weekly threads, click [here](https://www.reddit.com/r/Piracy/search?q=WEEKLY+THREAD&sort=new&restrict_sr=on&t=all).",
        "num_comments": 174,
        "comments": [
            "DO NOT GO TO APPDOZE.\n\nMy friend got a virus there trying to download software, specifically on the media human converter app. Hope admins remove from megathread or warn soon.",
            "my comment karma is too low. would love some help with that, or at least be told WHAT the comment karma requirement is, i cannot find it anywhere",
            "Just for curiosity, anyone knows what are the \"One FTP\" links in the Skidrow Reloaded site?",
            "Is there a place to request materials that cannot be found within the sources of the mega thread?\n\nedit- specifically books",
            "What do you do when you can't find something? I'm on all the top tier trackers.",
            "Hello everyone, without wanting to seem like a layman on the subject, but look for forums that can help me improve my knowledge in website building, I'm interested in making movie websites, sports streaming, etc. Any experts that can point me in some direction?",
            "I've had my account several years yet I still get automodded when trying to post.  And I'm plenty active on reddit, despite what the automod says.  I know you're not meant to message the mods about it, but come on.  I've tried to post several times in the last couple of years, always getting the same automod bs.",
            "Anyone know if the links on GFXDomain are trustworthy? I really need keyshot and every link on GFX peers is filled with viruses",
            "Freetube is taking forever to load on Android (ASUS ROG 3). I partially debloated my phone, only uninstalling most of what was recommended, google, chrome, youtube, youtube music, weather etc... After that I installed and enabled Orbot. I noticed Freetube ran slowly after that. Everything else works fine",
            "Updated my Wii U from Haxchi to Aroma and installed Pretendo. Absolutely love my Wii U. Put Nintendont on it and loaded an external hardrive with the Wii U library, tons of GC, Wii, and virtual titles. \n\nHighly recommend!"
        ]
    },
    "Wow so many choices for one movie.": {
        "title": "Wow so many choices for one movie.",
        "score": 1242,
        "url": "https://i.redd.it/ikkr639ooe9d1.png",
        "content": "",
        "num_comments": 77,
        "comments": [
            "Because its only available through Starz but you can get Starz as an add on for all of those other ones. Notice they all say Premium Subscription instead of just Subscription",
            "And none of them are the correct one.",
            "where is the option for braflix?",
            "would be neat to see duckduckgo or something implement this same feature but with magnet links",
            "\"youtube\" and \"youtube TV\" should just be one option, if you pay for the movie you should be able to access it across both services..",
            "Stremio with Real Debrid is the best thing I ever came across on r/piracy",
            "is it supposed to be a bad thing that the movie is available in a bunch of different streaming services rather than being exclusive to a single app? more people can enjoy it regardless of the service they pay for. what's the issue again?",
            "Technicaly this should be the norm, all platforms should have all the content and you choose platform by the perks of the app like offline content, subs preferences, easy to navigate and actually thought recommendations",
            "What's the point of this? If you're pirating you have so many more so it's not the number. If it's to brag about not paying... Why? Just do your thing.",
            "Must be John Cena cause I can't see them"
        ]
    },
    "Not ashamed to admit, this was me at one point. ": {
        "title": "Not ashamed to admit, this was me at one point. ",
        "score": 1865,
        "url": "https://i.redd.it/mz4uw1lcwd9d1.jpeg",
        "content": "",
        "num_comments": 44,
        "comments": [
            "But you have heard of me.",
            "Piracy PROTIP: the actual download link is in the small text near the bottom of the page (if you're lucky, usually...even that might redirect you to adverts and pr0n sites etc...YMMV)",
            "Magnet links have saved me from this lol.",
            "At first its so hard! So many button saying click here and stuff loool",
            "Find the least conspicuous download link using typeface meant for a dry legal document. Thats the one you want.",
            "Before knowing ublock origin, i was able to detect the real download button from all the ads.",
            "Just use prowlarr. It has been so many years since I actually browsed torrent sites.",
            "auto downloads from redirects are fun",
            "nope never, I had the idea after two days. In Mobile days, I would long press the button to check if it was an image with link or the actual link. and now in computer, when you hover over the forwarding links show at the bottom so no problem, but with adblock, these are gone anyway.",
            "We all been there as said green horns "
        ]
    },
    "if there's a u on the logo, it's a no-go": {
        "title": "if there's a u on the logo, it's a no-go",
        "score": 838,
        "url": "https://i.redd.it/hodxbvhk2f9d1.png",
        "content": "",
        "num_comments": 83,
        "comments": [
            "It absolutely shocks and baffles me every time I see a screenshot on here of someone actively still using Utorrent...",
            "whats the name of the app on the right to qbittorrent",
            "That's not a u it's the greek letter mu, my good friend.",
            "Try GNOME Transmission (if you're using a Linux distro)",
            "Deluge my beloved, been using it ever since I modded my DSi, no reason to really use anything else from how infrequently I use it. Very nice client.",
            "Unlock origin? I think I that's a good exception",
            "well unless your using 2.2.1 but otherwise for modern OS's yes I love QBittorrent",
            "u? I thought it was a .",
            "If anyone remembers, there was a iloveU notorious malware that infected many people's computers by spreading through emails",
            "I only use utorrent on my android phone is not it safe there? When i need to download small things to use on my phone"
        ]
    },
    "Proton VPN is now free to use without an account on Android": {
        "title": "Proton VPN is now free to use without an account on Android",
        "score": 1759,
        "url": "https://www.androidpolice.com/proton-vpn-works-without-account-android/",
        "content": "",
        "num_comments": 134,
        "comments": [
            "You mean entirely free or just some basic features?",
            "So can I disconnect my rj45, wifi my android phone to the router, load up  the VPN, make a hotspot, then wifi connect to my VPNed phone?",
            "Seems to work as advertised.  Just installed on my phone and connected to Romania, can get on Pornhub when they used to block me since I live in VA.  Sure, I can't torrent and shit, but it ain't nothin' to sneeze at.  In fact, I daresay its kinda bitchin'.",
            "I get free Warp+ vpn, with a simple trick",
            "So to someone like myself who maybe just wants to use  kodi on my firestick, would this cover me ? Or am I still better off paying for a vpn",
            "It was free before, my dude",
            "I just disconnected my account from the app but cannot see any option to use the vpn without credentials",
            "They dont let you p2p btw",
            "guessing p2p is off the table right",
            "Just make it easy Proton!\n\nGive me 10 TB of space (5 users) and all of the goodz for 100.00 per year. Is that too much to ask?"
        ]
    }
}