{
    "What's going on this week? Events/Discussion/Classifieds (Mon-Sun)": {
        "title": "What's going on this week? Events/Discussion/Classifieds (Mon-Sun)",
        "score": 1,
        "url": "https://www.reddit.com/r/pittsburgh/comments/1dn5kip/whats_going_on_this_week/",
        "content": "Visiting?  \nWondering what's happening this week?  \nHave something to buy/sell/trade/give/rent/lend?\n\nYou have come to the right place! Drop your comments below the relevant topic comment.\n\nIf you're new, check out the [Rules & FAQ](https://old.reddit.com/r/pittsburgh/wiki/faq)\n\nLooking for beautiful [city pictures](https://www.reddit.com/r/pittsburghporn)? Checkout [r/pittsburghporn](https://www.reddit.com/r/pittsburghporn/) (Safe For Work!)\n\n[Weather](https://darksky.net/forecast/40.4417,-79.9901/us12/en)  \n[history of past threads](https://www.reddit.com/r/pittsburgh/search?q=author%3Aautomoderator+OR+author%3APittsburghEvents&restrict_sr=on&sort=new&t=all)",
        "num_comments": 5,
        "comments": [
            "For anyone who who couldn't make it to Oakland or didn't get enough souvlaki etc, the Oakmont Greek fest is this weekend.",
            "Sports\n  \nPittsburgh thunderbirds will attempt to regain some mojo at home after losing to the Detroit mechanix last weekend. That loss broke the mechanix 80-some game losing streak\n  \n6pm at high mark stadium vs the Carolina flyers\n  \nPirates and riverhounds are both away this week",
            "hi r/pittsburgh -- (asked for mod approval prior from jay!)   \n  \ni'm from [justmydoc](https://www.justmydoc.com)! a philly based (sorry!) telehealth clinic. we're a small but mighty team of 6 (3 docs, 3 admins) all working remotely around PA.   \n  \nwe offer [basic healthcare consultations](https://www.justmydoc.com/service-page/basic-health-care) \\[med refills, ordering labs, etc\\] + all of our physicians are DOH approved certifying practitioners for the [PA MMJ program](https://www.justmydoc.com/cannabis). \n\nfeel free to use code **PITT40** when scheduling any consultation with us for 40% off the total cost. you can call/text/email/live chat us on our site anytime with any questions! -sarah",
            "For my fellow nerds:\n\n* Pride in the Park at Dormont Park on Sunday - [https://www.dormontcdc.org/pride2024](https://www.dormontcdc.org/pride2024)\n* Caste Village Fireworks Sunday at 5301 Grove Rd, food truck, dj, 5pm until dusk - [https://castevillage.com/caste-village-fireworks-june-30th-2023\\_2/](https://castevillage.com/caste-village-fireworks-june-30th-2023_2/)\n* Unicorn World convention downtown at the convention center Sat / Sun - [https://www.eventbrite.com/e/unicorn-world-pittsburgh-pa-june-29-30-tickets-871755071887](https://www.eventbrite.com/e/unicorn-world-pittsburgh-pa-june-29-30-tickets-871755071887)\n* Oakmont Greek Food Festival Fri/Sat/Sun at 12 Washington Ave- [https://dormitionpgh.org/assets/files/ogff/festival/2024-greek-food-festival-flier-8.5x11.pdf](https://dormitionpgh.org/assets/files/ogff/festival/2024-greek-food-festival-flier-8.5x11.pdf)\n* Open Streets on Saturday - [https://openstreetspgh.org/route/](https://openstreetspgh.org/route/)\n\nFor 4th of July (will likely miss next week's post):\n\n* Recommend you look here for suggestions - [https://www.visitpittsburgh.com/blog/celebrate-the-4th-of-july-in-pittsburgh/](https://www.visitpittsburgh.com/blog/celebrate-the-4th-of-july-in-pittsburgh/)\n* Crafton's 4th of July  celebration starts at 4 PM (petting zoo, balloon artist, face painting, inflatables) at Crafton park.\n* Dormont's starts at 7 PM -  [https://boro.dormont.pa.us/event/dormont-day-july-4th-celebration-2024/](https://boro.dormont.pa.us/event/dormont-day-july-4th-celebration-2024/)",
            "Open Streets! [https://openstreetspgh.org/route/](https://openstreetspgh.org/route/)"
        ]
    },
    "Pittsburgh Open Streets": {
        "title": "Pittsburgh Open Streets",
        "score": 368,
        "url": "https://www.reddit.com/r/pittsburgh/comments/1drb5vm/pittsburgh_open_streets/",
        "content": "I live on The Hill and although not many Black people post here, I would love to see that change.\n\n\nWe are all set up down here for the bicycle riders and anyone else who wants to come through and see what changes are coming soon for our community!\n\n\nVendors are setting up, barricades are up and officers are directing traffic so we can have a good time.\n\n\nCome get a haircut at Big Toms\nGrab some bbq from Sylvia’s\nGet some groceries from Salem’s\nGet some nice summer clothes from IkeWear\n\nBeauty supplies at Two cousins or Elegance \n\nCome through and see the many vendors!\n\nWe’re waiting for you, neighbors!\n",
        "num_comments": 32,
        "comments": [
            "This is an amazing post! And I need a haircut!",
            "I’m here for this wholesomeness",
            "I wanted to plan to make it out today, but was afraid of potential rain.  Good luck, it will probably end up being a great afternoon!",
            "See you there (though we probably won’t recognize each other). I love Open Streets. I hope the rain holds off.",
            "Just waiting for the rain to pass and we’ll be out around noon. I used to ride the Lincoln on my way to Schenley in the early 90’s but haven’t been through since. Looking forward to seeing it again",
            "I’m looking forward to it!",
            "If you can’t make it out today (or even if you can), keep an eye out for the August Wilson Block Party in late April of each year. The event spans a few blocks on Bedford right near his old house and is always a good time!",
            "I hope the rain holds up. Be safe. We’ll be up this afternoon.",
            "Thank you for this post.",
            "Weather permitting I’ll bike out this afternoon!  Thanks for posting- love Open Streets!"
        ]
    },
    "Many More Asian Market has opened their new location!": {
        "title": "Many More Asian Market has opened their new location!",
        "score": 315,
        "url": "https://www.reddit.com/gallery/1dqujeh",
        "content": "",
        "num_comments": 64,
        "comments": [
            "The store looks absolutely amazing! They are still stocking. I am most excited about the Hot Foods section. There was seating, and there were whole ducks and chickens available, pre-cooked! You should SEE the seafood section, with all of the tanks. Definitely a destination market.",
            "So happy for them! I’ve felt bad about all their setbacks",
            "looks real nice. good to know about the ducks; that's what we usually do for thanksgiving.",
            "I am so excited for this.  Many More is a treasure and I can't wait to see what they do with more space!",
            "Went earlier this week. They were still only about half stocked at the time. But so much potential!\n\nI can finally tell people we have a proper Asian grocery store (having previously lived near a 99 Ranch).",
            "Did they close the other location with this one opening? I've been noticing the signs recently but its so close to the other to seem like they will continue to operate with 2 locations",
            "Can’t wait to go myself and see it!",
            "I'm equidistant to this and the market on McKnight - anyone who's familiar with this spot (or both) able to briefly compare / contrast them? This place seems a little easier to navigate and has hot foods, but I can't really discern the difference in variety, prices, etc.",
            "Thanks for sharing - I’ll have to it! I always go to Oriental Market on McKnight",
            "this is the most positive Pgh thread of comments.... lol.  It's so un-pittsburgh to have so many people so positive that it kinda feels like astroturfing."
        ]
    },
    "Porch Pirate Cyclist in South Side": {
        "title": "Porch Pirate Cyclist in South Side",
        "score": 76,
        "url": "https://i.redd.it/7j0kqwtcvf9d1.jpeg",
        "content": "12pm on Thursday this jagoff rode down our Alley and stole packages from my neighbor and two from our place. He Stopped right out front while he stuffed them in his backpack. Shame!!",
        "num_comments": 19,
        "comments": [
            "I live off of S 14th, and this occasionally has happened to me. Super frustrating. This and my motorcycle being kicked over makes me regret living in the city.",
            "I’m sorry this happened to you and your neighbors, as it would really irritate me if it was happening on my street.  But…what a photo!  How desperate would you need to be to grab Amazon packages off porches?!?  I get regular porch deliveries, but can’t imagine anyone profiting off the small, odd things I buy for personal use (recent examples:  embroidery floss, tooth powder, duct tape).",
            "I'm glad somewhat to have a porch, the more sensible delivery drivers put packages on the other side of the wall, obscuring them. But some guys just toss it up there in plain view, and it's like, c'mon. My \"favorite\" had to be the one who put it squarely in front of my outward-opening screen door, thus requiring me to push the door and box to even be able to get out of my house.",
            "Big problem in the Rocks too.",
            "Wow I can’t believe someone would kick over a motorcycle. Some really scummy people out there.",
            "Sorry about your shit but it's not a city-wide problem. ",
            "Cities bring out the worst in people IMO. We weren't meant to live like rabbits in hutches.",
            "Same! I guess he is hoping to get lucky with something expensive he can sell.",
            "Heh yeah, my last delivery were some set-screw knobs and large bandages. Good luck trying to make a profit off of those, I guess.",
            "People of all ethnicities commit crime. It's as if stereotypes aren't fair and it's ignorant to apply them."
        ]
    },
    "Pittsburgh named 3rd best city to live in America, 30th best in the world. ": {
        "title": "Pittsburgh named 3rd best city to live in America, 30th best in the world. ",
        "score": 512,
        "url": "https://www.reddit.com/r/pittsburgh/comments/1dqmz5k/pittsburgh_named_3rd_best_city_to_live_in_america/",
        "content": "https://www.forbes.com/sites/laurabegleybloom/2024/06/26/the-20-best-cities-to-live-in-the-world-ranked-in-a-2024-report/",
        "num_comments": 123,
        "comments": [
            "These lists are totally useless.",
            "i do rather like it here",
            "According to the comments here, the number of people who clicked the link and read the list criteria is approximately zero. \n\nIt’s from the Economist and measures very specific criteria related to comfort and ease of livability.",
            "This I similar to the Places Rated Almanac lists in the 1980s. Pittsburgh and Atlanta were toward top then, too. While both cities did not score highest in any one category, they didn't score as low as other cities in any other categories.",
            "ITT: People saying that the world must be pretty shitty if this place is ranked so high on livability.\n\nAlso ITT: The same people who for some reason won't leave this place, yet will stick around and bitch about it.",
            "But Marty Griffin says downtown is too dangerous for Weiner World!",
            "The reason these lists are useless is because they bias them by how they weigh the various criteria. If anyone has made an interactive list then I would love to play with it. Some people can deal with the heat but not the cold (I'm the opposite); some people really want bike infrastructure; some people want/need wheelchair accessibility (which is often lacking in NYC); some people care about public transit and some people care about parking. If you're filthy rich you don't care about the cost of living but you might care more about tax levels.\n\nI totally understand why people post them every time Pittsburgh does relatively well, I love it here and I want my biases confirmed, but there are just as many or more lists where Pittsburgh doesn't even show up. A friend of mine who lives in Irvine, CA shared one recently where Irvine was at the top or close to it. My best guess is that list was written by a car that likes to sit in traffic.",
            "I had to laugh at \"Vienna has a perfect score except for a lack of sports teams\".\n\nFor those of us who aren't all about sports, uh, that's better than perfect.",
            "Weather must not have been a metric…",
            "30th best in the world? Well I’ll be damned"
        ]
    }
}