{
    "AskAuraxis - Your weekly questions thread": {
        "title": "AskAuraxis - Your weekly questions thread",
        "score": 4,
        "url": "https://www.reddit.com/r/Planetside/comments/1dnfkpn/askauraxis_your_weekly_questions_thread/",
        "content": "Welcome to **AskAuraxis**, the place to ask questions you have about PlanetSide!\n\n&#x200B;\n\n* Feel free to ask **any** question related to PlanetSide. There is no such thing as a stupid question, someone else might be wondering the exact same thing.\n* The main goal of this thread is that **no question goes unanswered**. If you know the answer to someone's question, speak up!\n* Try to keep questions serious. This **isn't** really the place for sarcastic or rhetorical questions.\n* If you're looking for loadout advice, **remember to state your faction** for a quicker and more concise answer.\n* An outfit is one of the **best** places to receive support while learning the game. Looking for one? Post your **server** and **faction** in your comment!\n* **We are not Rogue Planet Games**. We can't answer questions that should be directed at them. (we don't know what their future plans are!)\n\n&#x200B;\n\nAbove all else, **have fun**! Credit goes to /u/Flying_Ferret for pioneering these threads.",
        "num_comments": 38,
        "comments": [
            "I noticed in a recording or two that I was able to \"remove\" the ARX shader for directive weapons and replace it with normal camo. I have some Darkstar clips where I was using the metallic cyan camo \"over\" the parts where camo normally doesn't apply. [Note how in this linked clip the ARX shader is there, but in the next one it's overwritten by the camo I use.](https://youtu.be/Zl-Z34Myucs?t=113)\n\nThis is clearly some kind of bug, but I was wondering if anyone had any insight into this bug and perhaps if it can be reproduced consistently? The only thing I managed to notice is that the bug fixed itself when I changed continents, but it seemed to happen randomly in the middle of the session otherwise. Given how benign it is I'm kind of interested in being able to do it just for aesthetic purposes",
            "Why do the bases in Hossin have the heavy vehicle spawners placed on the exact opposite end of the base? And one being unaccessible by foot?",
            "Is there any easteregg secret outside of the permitted area of the maps? Time doesn't help letting you explore forbidden areas.",
            "What's your best kill streak?  \n\nI'm garbage 1v1, so my best is maybe 3-4.  But yesterday I went for +17 at Nasons in a Lightening.   So that was fun.",
            "Not played much since last year - since new ownership + assuming new content (read something about sunderer changes)\n\n  \nWhat changes should I be aware of mostly? I have a new pc now and only played 2-3hrs this year to test out graphics but did terribly. Normally play TR on Miller if it still is active? Read posts about declining player bases and something about Cobalt being closed or something?",
            "Sort of related to my other question, but which non-ESF aircraft is best for anti-infantry, assuming I have enough people and carts to operate it properly?  (Valk/Lib/Galaxy)\n\nAlso I’ve come to realize that some people don’t like air but this is a game I play very casually with friends so idgaf",
            "I love an anti-infantry gunship playstyle (both as gunner and pilot), especially the valkyrie, but also the liberator and the Galaxy.  \n\nHowever when I fly over a group of enemies I can only stay there for a few seconds before I’m almost dead and have to fly behind cover to repair.  I try to fly pretty evasively but I need my gunner to be able to take shots and also there’s only so much you can do vs flak and lock on missiles.  \n\nOverall it feels like 10% of my time is spent shooting, and 90% is spent repairing behind a rock.  \n\nIs my experience normal?  Do you all have any advice to keep me flying longer?",
            "Did they nerf C4?  \nMy lil bro had a strategy that involved multiple C4. But after a short month or two on slapping around a Magriders main, suddenly it doesn't work, as if they have connections with the devs or the major factions cry loud enough to make it change. Doesn't even work in the VR training, it seems as if using more than one C4 at once makes all the C4 less potent",
            "Why is VS allowed to openly cheat so much?",
            "I know the Light Assault's Air Drop implant can cause the Auraxium shader to disappear.\n\nI reckon there's probably another similar effect that does the same."
        ]
    },
    "Audio Dev Letter - June 2024, Making Audio For PlanetSide 2": {
        "title": "Audio Dev Letter - June 2024, Making Audio For PlanetSide 2",
        "score": 180,
        "url": "https://www.reddit.com/r/Planetside/comments/1dnoe9x/audio_dev_letter_june_2024_making_audio_for/",
        "content": "https://preview.redd.it/ghew54fv3l8d1.png?width=1200&format=png&auto=webp&s=36b8df882d7e18f16eb8793db65e5662b77c8375\n\n# Behind the Scenes: Making Audio for PlanetSide 2\n\nFor this month's dev letter, we wanted to give you a peek into what goes on when making new audio updates to the game, both when it comes to sound effects and music. \n\nStarting as a new audio team on such an established franchise has been very exciting, while at the same time there’s been a lot for us to get into. Initially, we spent a lot of time playing the game and reading through player feedback on the forums and Reddit. \n\nhttps://preview.redd.it/ap7rs2r34l8d1.jpg?width=768&format=pjpg&auto=webp&s=846977f7c3f597e20d4b90f839a24e2a41da5799\n\nThis turned out to be very helpful in both establishing what we would value ourselves, while also learning what you, the players, would like to see happening to the game. At the end of this dev letter, we have also provided a survey which if answered would help us to work even more toward what our player base wants. \n\n# Bug fixes and optimization \n\nOur focus so far has mainly been on bug fixes and carefully updating existing sounds. This has resulted in updates like fixing audio/animation desynchronization issues, and a larger fix for weapons that would spam multiple sound cues when tapping quickly. \n\nOur most recent submission is a *potential* fix for the big audio dropout issue. This has been on our radar since the beginning, but since the issue has no clear reproduction steps and the only place we seem to encounter it is on a large and populated live server, this has been especially complex to debug and test. \n\nSo far we have increased the channel limit, which allows for more sounds to play simultaneously, and we just made a system that resets the sound system on every loading screen. Hopefully this will help, but if not, we will continue trying what we can to solve it in future updates. \n\n[https://youtu.be/K5dpgdYnCCE](https://youtu.be/K5dpgdYnCCE)\n\n# Music Updates\n\nWe take part in working on the regular updates with the rest of the team, so we’ve had our hands on every new weapon or skin that gets added with new sounds. But one of the inspiring elements for us is adding new music to the game. \n\nOur latest work was for the franchise anniversary, but we have also tested the waters with various Sanctuary themes, including the updated Halloween and Auraximas versions you might have heard of in the last 6 months. Next, we are also trying to produce something nice for the November anniversary! \n\nIn the coming period, we are working on getting our new soundtracks up on YouTube, with the first example being the PlanetSide Anniversary Remake: \n\n[https://youtu.be/8AefSwtisyI](https://youtu.be/8AefSwtisyI)\n\nOne additional area we are considering looking into is the NC music, also potentially tweaking some in game tracks. There is more to come in this area, and depending on your feedback on the matter, we have a few different paths ahead we might choose. \n\n# A modern homage to the early days \n\nOne of our philosophies on this project is to look back with respect while taking advantage of modern technology and techniques. One element we really like from the early days of PS2 audio was some of the unique sounds of weapon firing and vehicles for each faction. \n\nWe have done some initial research, and in the future we hope to make certain elements sound more like they did several years ago. \n\nThe modern aspect we want to make use of here is more complex with immersive acoustic technology and mixing techniques. Making busy combat scenarios sound a bit cleaner, while giving the player some more strategic elements for navigating the world through sounds. \n\nThis will of course not be made in a hurry and is quite complex to dig into, so expect minor updates to begin while we monitor your response on the matter. Our goal is to improve your experience while maintaining that great PlanetSide feeling many of us enjoy. \n\n# General improvements \n\nBesides the points above, our day-to-day also consists of many general improvements. When working on these, we choose an area and try to work on it systematically. The first step is to break it down into categories, start testing and make a list of improvements containing both creative and technical fixes. \n\n[https://youtu.be/oY6h8FtOF34](https://youtu.be/oY6h8FtOF34)\n\nAfter doing this with weapons for a long time, submitting various updates you might have seen in patch notes, we have just started to move our focus over to vehicles.\n\n[https://youtu.be/IyOlo3Yg6Gs](https://youtu.be/IyOlo3Yg6Gs)\n\nIf you have any thoughts on areas that could benefit from projects like this, never hesitate to let us know on the forums - we try to account for as much data as possible when we make these decisions.\n\n# Conclusion and survey \n\nAs we learn more, both from our own experiences and hearing what you, the players, write and how you react to our updates, we hope to be able to provide some great updates that will make your experience on Auraxis as good as possible. Below you can find the mentioned survey, and it would be very helpful to us if we could get your input submitted in this! \n\nThe first part of this journey has been very exciting for us, and we thank you for continuing to be engaged in the game, both on the battlefield and with keeping the community active. \n\n[PLANETSIDE 2 AUDIO SURVEY](https://docs.google.com/forms/d/e/1FAIpQLSf95Vcoen1RSW2RH_0m4cQ0EibwpurY4w8FC_2RTVYt6YNUeg/viewform?usp=sf_link)   \n  \n- PlanetSide 2 Team\n\nDevelopment Letter: [https://www.planetside2.com/news/audio-letter-jun-2024](https://www.planetside2.com/news/audio-letter-jun-2024)",
        "num_comments": 85,
        "comments": [
            "Seeing the quality of this post since you guys took over the project is a *complete 180 and the BEST thing I've seen about the game since the initial hype I felt playing the beta in 2012*\n\nPLEASE keep it up and congratulate yourselves. You all look like you're enjoying your work and it's really great to see on a project I care so much about.\n\n*THANK YOU!* \n\nThe yt videos are such a nice touch. No dev needs to do that, but it shows off what you're doing and we need to see that!!",
            "> Our most recent submission is a potential fix for the big audio dropout issue.\n\nI didn't make it halfway through the post, this one stopped me dead in my tracks. Does anybody know how much tickets to Sweden cost? Everybody on the audio team deserves a blowjob if they actually fix this one, I sincerely don't care if the fix is just re-initializing the audio engine.",
            "Nice to see devs being so active and forthcoming whatever they do. Still remember the weird #saltydevs days when the output wasn't so positive.",
            "Thank you for fixing the basilisk sounds. My god those were horrible and made every large vehicle right there unbearable. Still gets a bit crazy in bigger fights with audio but usually all I have to do is turn down the volume a bit now.",
            "Hello everyone, just want to drop by and say thank you on behalf of our audio team. We are all appreciative of the tremendous feedback and support. We are reviewing everyone's suggestions and comments left in the audio survey now.\n\nWe also want to continue to bring more behind the scenes dev letters from various parts of the game's development. If you have an interest in a particular part, let us know in the comments below.",
            "Cheers, I am more than happy to read such news! Keep it coming :)\n\nThe sound that bugs me the most out are multiple/too much sensor darts on one place... That accumulative buzzing gives me a headache to be honest.",
            "Can we all take a moment to appreciate just how well done the audio system in this game is? The game is from 2012 and it has things like sound travel time and Doppler effect. \n\nI also gotta say I think they did a good job on the new weapon sounds. \n\nAbout annoying sound bugs: The drop pod audio always bugs out for me. It chops up, or sometimes it feels like it doesn't play at all. Really hope drop pod sounds could get a fix, perhaps even completely new sound to make them more noticeable.",
            "Great stuff, happy to read these updates!",
            "One thing I really wanted devs to add for years was to play the theme of the faction after winning the alert. I'm not talking about the 3 seconds clip that plays right now, play a lengthy portion of the theme of that faction, making it feel more epic.\n\nAnyway I'm happy with any news from devs at this point. But I hope they don't change the music we know and love, Vanu music is one of the reasons I still play the game. I'm all for fixing audio.",
            "I'm glad you guys are emphasizing bug fixes, things that should have been done years ago. It slows down your content creation updates (which is unfair on you guys), but is arguably more important. \n\n  \nI think bugs and server lag are one the main reasons for population decline."
        ]
    },
    "Do we know what the role of tanks even is?": {
        "title": "Do we know what the role of tanks even is?",
        "score": 23,
        "url": "https://www.reddit.com/r/Planetside/comments/1dqpqx1/do_we_know_what_the_role_of_tanks_even_is/",
        "content": "After the other day's air post actually formatted a LOT of ideas and discussion i did say i'd probably do a tank one in a few days for these new attentive devs to actually have a good place to find opinions.\n\nThis is the tank discussion, the topics range:\n\n- Tank design to it's core and or balance\n\n- Combined Arms get reverts if at all over potentially better things\n\n- Overall base design relating to tanks\n\n- Interactions with other styles of play\n\n- AV Maxes, not revives or any other usage\n\nIf you say tanks shouldn't exist you consent to your kneecaps being removed and i advise we just ignore those types.\n\nI probably wont be as active here as i dont even have a theory myself on this one besides making vehicle gens open very abusable things but base design made to restrict otherwise, so feel free to be the ones going around challenging or constructively pushing ideas further.\n\nAlso heard a bit about how lightnings are kinda strange and rumble-seat repairs coming back in a lessened state, maybe just enough to count as passive healing.\n\nThat said the next one will be infantry based if this one goes pretty well too so keep those opinions close when that drops too.",
        "num_comments": 94,
        "comments": [
            "##Vehicle roles\n\nAs designed, the purpose of vehicles is map and resource control. Controlling the space between bases allows a faction to bleed out the enemy resources, and winning the vehicle fight create a reasonably safe window to bring up spawns while no counter-pulls are possible. The secondary purpose is to act as a check against human wave tactics and as a means of cracking point room turtle strategies.\n\n&nbsp;\n\nHowever, this design falls apart on several levels.\n\n* Changes to air transport, spawn beacons, revive implants and other deployables have created a meta where having vehicles on the map actively harms the team fielding them. After all, there's little point trying to control the map when the other team can just fly over you and turtle on the point.\n\n* Using vehicles in an organized fashion to crack point holds is something most outfits have avoided doing, simply out of fear that doing so would spark another arms race with serious negative implications for the game.\n\n* The \"crossover\" area between AV and AI-focused weapons has shrunk quite a bit in the Combined Arms era. Most AI-focused weapons have traded quite a bit of splash damage for better AV power (HESH, AI noseguns, Fury) or have been powercrept through nerfs (ES AI secondary weapons) and content additions. At the same time, most AV weapons gained quite a bit of splash damage in 2017, since direct damage reductions meant indirect damage had to increase to maintain reasonable hits-to-kill against infantry. The result is that there's little tradeoff for *not* equipping AI weapons.\n\n* The chance to win map control and deplete resources has been eliminated by poorly thought out changes to the resource system. Nanite boosters and membership are inherently pay to win, and this stacks with the vehicle cost discounts provided by ASP, War Assets, and construction. As a result it's no longer possible to nanite lock players, meaning ground-based spawns are always in extreme peril. This constant spam likely drives many of the vehicle complaints we see today.\n\n* The availability and ease of using infantry AV, especially AV grenades and C4, means it's often more efficient to dive bomb with the assault classes instead of bringing your own vehicles. It says a lot about infantry AV that the most common use of the Javelin is as a C4/AV grenade delivery tool, that the standard Harasser playbook involves C4 drive-bys, and that tank fights frequently end in kill trades when the losing side bails out and starts spamming underbarrel grenades/explosive crossbow bolts/AMRs.\n\n##Base design\n\nGonna be real here- the complaints about HESH are largely overblown and exist because we've spent 7 years conditioning players that they can safely ignore air and armor, while simultaneously doing nothing to make those domains more accessible. Mouse inputs for aircraft and primary turrets has been sluggish since 2016. vehicle/aircraft maneuverability and survivability suffer tremendously when stock and require utterly ridiculous cert investments to become functional and 2nd gen cannons powercreep HEAT (unless you're VS, LMAO).\n\nThis is compounded by a compromised resource system allowing chainpulling and bad design decisions that allow AI weapons to fight against AV weapons on nearly equal footing.\n\nI'll go so far as to argue that each base should have a good shelling angle, simply because that discourages human wave tactics. The problem we face today is that base design regressed from 2016 onward, and things like restricting crossfires around the spawn room, defender teleporters and multiple defender routes have become a thing of the past. Phasing out of these traits has made spawn camping far easier, and that's another aspect that needs to be looked at. Seriously, go compare Hossin bases to those reworked in the 2016-2017 Indar revamp, SWG Esamir or Oshur, and you'll see a major difference.\n\n\n##The Combined Arms Initiative- to revert or not to revert?\n\nThe foundational problem with the current vehicle balancing mechanisms are that they function *just barely well enough* that an overhaul would be very time consuming and unrewarding.\n\nThe vehicle feedback group I helped lead in 2020-2021 grappled with this question, and my stance is still the same. Using the 2017 damage system as a baseline:\n\n* Reintroduce the balance mechanisms lost in 2017 by reintroducing purged damage types\n\n* Rather than gaining damage through resistance changes, raise direct damage and reduce indirect damage, while setting resistances to 0% or as close to 0% as is possible. This is a return to the \"What you see is what you get\" design philosophy. This makes weapons behave more consistently against infantry while also reducing the amount of splash damage on the battlefield.\n\n* Reintroduce significant weapon specializations: Equipping HE(SH) shells should result in a build order loss when an AP equipped tank is spawned in response.\n\n* Very slightly step down MBT cannon damage, which allows tank rear armor to become more vulnerable. This buffs the Harasser by proxy, and that vehicle's been powercrept significantly.\n\nWe chose not to revert back to 2017 and evolve that system for the following reasons:\n\n* We agreed with DBG that it was unnecessarily opaque, and that some damage types had no reason to exist. On paper, \"What you see is what you get\" is the cleanest and easiest concept to understand.\n\n* Since September 2017, the number of objects with resistances has doubled and 50+ vehicle/anti-vehicle weapons have been added. Converting these to the old system would have been a monumental task, and we felt it was simpler to slightly tweak existing parameters instead of verifying about 200k interactions.\n\n&nbsp;\n\nHere is an example of what the proposal's revised resistance/damage values would have looked like.\n\nWeapon: Titan-150 AP\n\nTarget: Prowler Front\n\nResistances and armor have been converted to decimal format since that's far easier to work with. These values are correct.\n\nEra | Damage |  Resistance |  Armor |  Damage dealt |  Target hitpoints | % hitpoints remaining\n---|------|-----------|------|-------------|--------------|----\n2017|  2075|  1.15|  .37|  882|  4000 | 22%\nLive|  850|  1.5|  1|  1275|  5000| 25.5%\nProposal|  1100|  1|  1|  1100|  5000| 22%\n\nIn short, our solution was to adapt the existing system to more closely parallel the 2017 iteration through a combination of damage adjustments and damage type additions.\n\n\n##Tank balance\n\nThis is probably the most controversial thing I'm going to say here. For average players, the Magrider is the weakest thanks to broken mouse inputs and a criminally high cert investment requirement, while the Vanguard struggles thanks to its poor handling and acceleration. The Prowler is a bit too strong as far as casuals are concerned, but this is due to anchor mode making it harder to miss with in addition to the tank's solid out-of-the-box handling.\n\nAt the high end of play, Nimitz Vanguards blow everything else out of the water, while Mags and Prowlers are about equal. Chimeras can work as a second line vehicle, while 2 Lightnings will match and defeat an MBT.\n\nThe problem is that MBTs have entered a gigantic power creep spiral that has left the Harasser (and Lightning, though to a lesser extent) behind. While the tanks may be balanced against each other, they sure as hell aren't balanced against lighter vehicles.\n\nAt this point, the solution would be to step back tank firepower very slightly (by 5-10%, NOT ANYWHERE CLOSE TO CAI'S FIREPOWER REDUCTION), tone back their abilities and speed a bit, weaken their rear armor and then adjust harasser guns. As they are now, the CQAV guns are trash while the long-range ones are far stronger than before CAI, and this couples with the tank rear armor to create a long distance plinking/C4 drive-by meta.\n\n##AV\n\nLong range infantry AV is far too strong considering the skills required to use these weapons. Lock-ons and AMRs may not kill many tanks, but simply by existing they choke off huge sections of the battlefield by applying continuous chip damage. These weapons are major contributors to the passive gank squad vehicle meta.\n\nShort range AV is terrifyingly strong, though players tend not to understand this. It's almost never just 1 guy throwing decimators at a tank, and 2-3 can quickly zone out firing angles.\n\n AV grenades in particular are egregiously overtuned, but underbarrel grenades and explosive crossbow bolts are very commonly used by vehicle crews to force killtrades after losing.\n\nAV MAXes are in an odd spot. I don't think the CQ AV options are well balanced against each other, and Falcons are quite a bit less threatening than Comets/Pounders. Fractures blow the other two long range AV weapons out of the water, and it wouldn't hurt to bring their range in line with Vortexes and Ravens.\n\nThe Defector is everything hated about infantry AV put into one obnoxious package. Grenade printer is basically pre-CAI pounders, but with heat mechanics instead of lockdown. For those of you who weren't there, pre-CAI pounders had so much splash that they used to make TR an auto-pick in tournaments when AI MAX weapons were banned. The Hummingbird is a lock-on weapon, and those just aren't fun to use or to fight against. You're not fighting players, you're fighting the game itself when lock-ons are fired at you, and the only counterplay is to duck under a rock or leave the area. The Detonator is seemingly tuned solely around deleting sunderers with indirect fire, and that's not the sort of gameplay that should be encouraged. Lastly, the moving animations are very twitchy, making hitting moving Defectors more difficult than it should be.\n\n&nbsp;\n\nCool 10,000 character limit. Have I mentioned how much I hate this site recently?",
            "In PS1, the tank role aside fighting in the fields was to secure the tertiary tower hardspawns every base had, fighting base defenses, and keeping the base courtyard secured for the parked softspawn whilst the infantry fought inside the base. The only shitcamping a vehicle could do is shooting infantry trying to leave their tower spawn room stairs (if someone held the door open for them) and shooting at infantry along the base walls.                  \n\n\nTowers, IMO, were crucial vehicle objectives given how well they could supress one for infantry to retake, and their inclusion was immense for fight resiliency to shitters while also adding a fun siege stage in the back and forth that is base fights. The fact that vehicle's influence to a base fight was limited to the towers, base walls, and outside inner courtyard meant that the actual fighting for the base control was purely infantry performed. There was no shelling the defender spawn, the capture point, or every step in between the two.         \n\n\nPS2 lets vehicles shitcamp so much space in the dumped scattered lego bin that is PS2 base design. There will be no number balance that will achieve the healthy vehicle & infantry relationship PS1 had done purely from polygons.",
            "If throwing roles out of the top of my head it will be something like:\n\n- Protecting Spawns\n\n- Destroying Spawns\n\n- Counter enemy vehicles\n\n- Exert ground control/control over territory\n\n- Create No-Fly zones\n\n- Push/move frontlines (in case they have formed in the first place)\n\n- Attack player-made bases\n\n- Suppress Infantry \n\nAll of them are intertwined or could be a part of the same thing, but either way, those could be a reasons why I may pull a tank.  \n\nBut mostly (in my case) it is protecting spawns from enemy vehicles and create \"safe zones\" for allies.",
            "No to rumble seat repair",
            "Vehicles are barely relevant since people just redeploy elsewhere when a sundy is threatened/destroyed.",
            "There is an interesting change they could do.\nWhen you hack a vehicle terminal.  Be able to pull the prowler or vanguard or raven mosquito scythe of the faction you hacked.  Would give a bit of interesting gameplay",
            "I think MBT balance is weird. The chimera doesn't feel like an MBT because it can't turn without moving forward and the gunner's rear view is restricted. The model hit box is is huge and it doesn't allow for the gunner to shoot when there are hills. The mag rider is also in weird spot IMO. It's unique in way that the vanguard and prowler are not. The Maggie has such a small hitbox when using hills and it can reach spots other tanks can't. It's also very good at fighting infantry since rockets are easier to dodge. Another thing is the ability to shoot while traveling on water at Oshur. Other tanks are sitting ducks moving slowly underwater.",
            "There are quite a lot of large sectors in the game where there is only one small base with one capture point, you need to redo such sectors. To put several secondary capture points at a distance from each other, to make a variety of terrain for the possibility of fighting on equipment, to capture and hold these points only with the help of technology. Only after capturing such points will it be possible to capture the base in the center with the help of infantry. It is possible to make such sectors without infantry bases at all. And of course, to ban construction in such sectors. I name the sectors because I don't know how to spell the word \"Gex\" correctly",
            "From the way players use them, my best indication of their role in the game is to park outside of base in gross overpop and left click.",
            "I'm of the opinion that both the problems of aircraft and ground vehicles completely revolves around their power in comparison to infantry players far more than anything else in the game, including in comparison to other vehicles. The problem is, that most of the ways either side becomes annoyed with eachother almost always comes down to skill related issues. Aircraft players have become so good that infantry player's \"slow but steady\" AA damage can't ever hope to kill them. Tank players have learned the maps well enough to attack infantry players in areas where it should \"only\" be infantry vs infantry. Infantry players have learned how to use the mobility class to sneak up on vehicles even when they are on the move (c4 fairies). Sundies complete lack the ability to counter enemies with skill, due to their immobile nature while acting as a spawn. And the opposites exist too; low skill aircraft or tank players feel like they can't get anything done against infantry.\n\nThe literal only way of countering all of these skill based abilities, is to make a whole new game. Whole new map. New enough mechanics to make it so that it's not 'just' the extremely skilled and experienced players utilizing these abilities. The sundies can survive, because people don't even know the exact location, because that location hasn't ever been used before. The only way tanks can abuse a special location is if they come across it by complete accident. The only times infantry abuse their mechanics is when they come up with the idea on the spot, rather than having done it a million times before.\n\nI would think that a Planetside 3 would probably utilize a lot more \"random generation\" of bases. Maybe make it into \"seasons\" like a lot of other games do, but the seasons would be map generation rotations. Planets are insanely big, so it could be pretty believable if we went to a different location on a planet every couple months and found a completely new battleground to fight in. This would also allow for a lot more \"story\" for them to work into the maps as well, building up the story over time like they \"kinda\" started to try to do (like with the warpgate explosion that changed one of the maps greatly). Theres even the possibility that we would be playing \"on different planets\" with each 'rotation', so they could change other mechanics of the game. One example being gravity being higher or lower, influencing the usefulness of mobility options, or opening up/closing off certain routes because \"you can/can't jump high enough\". Could have planets that are always day, or always night, or even have different brightnesses. Maybe some planets have an emp field that makes shields regen delay or is slower, or maybe a planet is radioactive, meaning you are safe with shields up, but slowly bleed health once they drop in a fight outside. Maybe the dirt is softer or harder, affecting the acceleration, turnspeed or grip of track or wheeled vehicles differently. Fun stuff that would pretty majorly affect all forms of play for both better and worse.\n\nI know this isn't necessarily following \"on target\" with the conversation, but I didn't see the previous one, and I'll probably miss the next one since I'm not always watching planetside's page-and this kinda hits all 3 at once as my \"concept\". I'm just not of the opinion that all of these things could ever be possible within PS2 (nor would I expect them to ever try). I'm very much so of the opinion that the dying horse should die, and if they can they should try to revive it in a new form. Hell, it doesn't even need to be planetside 3, since PS2 has kinda drug it's own name through the mud by being bought out so many times. Just needs to be close enough in mechanics to make it recognizable as being a pseudo sequel. Saving PS2 is a lost cause. Also, don't get me wrong. I'm still having fun with PS2. But bailing water out of an already sunk ship doesn't really do much--but building a brand new ship might actually get us somewhere."
        ]
    },
    "XP % Limit?": {
        "title": "XP % Limit?",
        "score": 8,
        "url": "https://www.reddit.com/r/Planetside/comments/1dqrixh/xp_limit/",
        "content": "Hi all I hope you are doing good.\n\nI got a question, is there a limit on max xp precentage? I am a member and I had two xp boosts. It says I have almost 500% xp boost but when I do something like kills or revives or facility capture I only earn 170% max (the precentage shows alongside the XP earned).",
        "num_comments": 8,
        "comments": [
            "each activity scales differently you won't get the flat value you see next to the map. probably something to avoid it being totally abused or padded\n\nbut no there's not a \"limit\" as such",
            "Weird, in turbo boosts a long time ago you can easily hit 300% as a free player and it worked fine.",
            "That's a good question",
            "I may be wrong, but I thought the on-screen xp popups like 50xp (+140%) were showing the multiplier for the world area in the cases of overall underpop in the continent and that particular base, along with any boost consumables. I don't think they show double-xp event boosts.",
            "AFAIK I hit 1100% back on the quad XP day they had for members, that's the highest I've seen.",
            "No, I have seen over 1000% exp, to get them you need x2 weekend for all, x2 monthly exp for member ship, squad boosters with everyone having them equipped and an exp hat in some event like christmas.",
            "The +X% is total value of exp boosts you are under the influence of. That includes pop bonus as well.\n\nPress Alt to activate cursor, then hover over +X% value in your left bottom corner, under minimal to see complete breakdown.\n\nLot of things affect do bonuses. One of reasons it’s always best to finish alert inside one of big bases as it gives extra 15% of exp from the alert, defense bonus.",
            "Yes, but OP is referring to the popup whenever you earn xp like through repairs or healing, where you'll get something along the lines of \"15xp (+50%)\" next to your crosshair. I've noticed that the xp bonus displayed on the bottom of my screen differs from the one that shows up near the crosshair."
        ]
    },
    "Dream new map style/theme?": {
        "title": "Dream new map style/theme?",
        "score": 5,
        "url": "https://www.reddit.com/r/Planetside/comments/1dquggg/dream_new_map_styletheme/",
        "content": "If you could have a new map added to rotation. What would it be? In terms of biomes and elevations and formations? \n\nImagine a low gravity space outpost?\n\nOr a lushly vegetated temperate forest with patches of open grassland allowing for vehicle play too. :)",
        "num_comments": 16,
        "comments": [
            "I think the dream would be an urbanized area but that was something they tried and it never saw the light of day, and probably for a plethora of good reasons",
            "Instead of a whole new continent I've always thought that for Esamir they can take advantage of the assets they used to make the jungle and put that in spaces that are actually fought over. Just like how Indar has the savannah, desert, and canyon areas, Esamir can have something similar. Something like the northeast part of the map being completely converted to jungle and having playable bases, the southern part of Esamir is a Boreal Forest/Taiga sort of deal, and the western part has some mountains and the remaining areas are purely snow as is. \n\nEsamir has the ability to be varied in terms of terrain but the effort would probably be way too much for the current dev team size and there are also much bigger problems to take care of first though.",
            "I'd like an alternate take on Amerish, more focused on being a rural area with roadways and rolling hills more so than extreme mountains and military installations.",
            "Searhus, with the big fuck off volcano, the tropical-ish wildlife around it, and an archipelago so boats aren't bound forever to THAT continent.\n\nI like the idea of a crashed full-size Bastion on the side of the volcano.",
            "I think some kind of river system on Amerish would be cool, plus maybe some deeper water features on Hossin, then the Corsair wouldn't be Oshur. I say this having maybe driven one once though, so feel free to tear this apart.",
            "esamir before shattered warpgate with eisa swapped with a biolab redesigned to work with three pads and biolabs swapped with techplants",
            "https://youtu.be/iaswnJjO5-A",
            "I made a custom Continent design a while ago! It features an Urban city made up of multiple capture bases so there can be a heavy CQ Infantry fight going on in the center while more combined arms push around the outskirts.\n\n\nhttps://imgur.com/676YsqC",
            "I don't want to be another city comment so I will say a proper oshur with proper underwater fights. \n\nI really like clean up site B point fights. There should be a lot more structures like that. It's not the environment that is trash in oshur, it is the map design, logistics etc. If boats could deploy we could get equivalent of vehicle base fights but with boats. Since boats can't deploy and many times the A point is underwater, there is no use for boats. All underwater bases are bland. A little rock here and there. Heck Serro listening A point as infantry is more fun. Classes should have jet pack ability separately as a second one like they did with the sundy. Having to unarm yourself when engaging is no fun. \n\nAnyway the list is huge. They can't delete oshur but they should try to fix it with our suggestions.",
            "Id love a map where the only way to go to a point is by air"
        ]
    }
}