{
    "Devblog - Seismic Sensor": {
        "title": "Devblog - Seismic Sensor",
        "score": 67,
        "url": "https://rust.facepunch.com/news/seismicshift",
        "content": "",
        "num_comments": 74,
        "comments": [
            "If you're setting your phone to wake you up in the middle of the night because your video game base is being attacked it's time to take a step back.",
            "Can you please add a Handbrake to Cars, be great to not have Newman's push a huge armored car into a twig doorframe and destroy the car by closing the door. Maybe have a time delay or mini game to then turn off the handbrake",
            "Overall, the vast majority of these changes are great and very useful. Obviously the fishing community is upset but I don't partake in that much, so I can't comment. \n\nAppreciate all of your hard work devs!",
            "Blocking explosives, powder and ores from TCs will improve quality of life immensely.",
            "Fish traps got a huge buff, are we forgetting that?",
            "holy qol! this is awesome!",
            "I'm still curious as to whether the devs realized they've basically killed fishing.",
            "No item store this week? Edit, it was late",
            "yeah you are supposed to stay logged in with your speakers turned on to wake you up instantly",
            "I once took an early lunch from work to drive home and help defend our base from a raid. I took like a 2-3 year break after that..."
        ]
    },
    "The Steam Summer Sale is here! Save 33% off Rust from now until July 11th ☀️": {
        "title": "The Steam Summer Sale is here! Save 33% off Rust from now until July 11th ☀️",
        "score": 8,
        "url": "https://x.com/playrust/status/1806372266457915592?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet",
        "content": "",
        "num_comments": 16,
        "comments": [
            "save 33% on new accounts for cheating!",
            "Anybody think it will go lower?",
            "Is it worth buying now?",
            "Cheaters buy hacked/stolen accounts for a couple dollars lol",
            "probably not for a while",
            "It was during the survival sale but I don't think It will go lower for awhile, definitely an oops not to buy it then imo.",
            "Cheaters buy stolen and cracked accounts for dollars anyways this is still more expansive than what they pay",
            "This guy seems to know how it works a bit too much... F7! ;)",
            "yeah i fkd up just gonna buy it now",
            "I would never cheat in a competitive online game! \n\n^minecraft ^doesn't ^count"
        ]
    },
    "Private yacht": {
        "title": "Private yacht",
        "score": 181,
        "url": "https://i.redd.it/e2hx4e25pg9d1.jpeg",
        "content": "Built this on a creative server just for fun \nI almost flagged this as discussion so feel free to give contructive criticism on how little it looks like a boat LOL ",
        "num_comments": 18,
        "comments": [
            "wish people built like this instead of the same fucking copy-paste meta base",
            "The deck of the bow shouldn't be so close to the water line with the stern being so high.",
            "Do you have a video?",
            "Looks better than cargo imo",
            "The prim bois salivating at the mouth with how much damage they can do with some molotovs.",
            "I think it would look better if you extended the bottom out to have a short back deck.  That can be for the staff.  Smaller pool.  Shittier bar.  Oil refinery and piping in the bowels to simulate the engines.",
            "Well to be fair I don't think this build is possible with stability",
            "Imagine how much different this game would be if the building meta hadn't gotten so figured out. I'd love to see bases like this or zergs that live in hotels/villages instead of mega zerg bases.",
            "nah sorry. Only tip i can give if y'all wanna build a boat for treasure is foundations entirely under water, build up until only a bit under surface, and use roofs facing outwards for the shape. This boat has a sub base underneath it!",
            "the foundation is really just bunch of 2x2 squares in a line so this is almost if not fully possible without stability issues"
        ]
    },
    "How pathetic does your existence have to be? This just makes me not wanna play and leave these losers to play hvh. ": {
        "title": "How pathetic does your existence have to be? This just makes me not wanna play and leave these losers to play hvh. ",
        "score": 786,
        "url": "https://i.redd.it/qj8s7a01nc9d1.jpeg",
        "content": "",
        "num_comments": 377,
        "comments": [
            "Be careful. Mods might ban you for talking about cheating in this Sub.",
            "This is why I quit this shit game. You can put in all the time in the world and still get shit on by cheaters 24/7 game is dead",
            "Stopped playing last year. This game is so fun but completely ruined by cheating.",
            "the issue is that you get flykick violation and invalid bullet, but cheaters don't",
            "I refuse to purchase anymore items from the store because of it. We need to boycott buying skins.",
            "As a solo player, my goal is to turtle as hard as I can and camp from my fortress of solitude. PVP'ing in the open is always a losing prospect with the number of cheaters running around. Kind of pointless to try and snowball in the open and run monuments aggressively when you're just gonna get rekt by some 13yo kid running hacks.",
            "Left tarkov because of cheaters and recently left rust lately for the same reason, it's out of control",
            "Devs be like \"we work on it, promise!\"",
            "It's just sad. I'm sure it's ultra hard to prevent cheating, but when they prio to mass import shit changes instead of fixing the core game, I won't spend my time and money on Rust anymore. \n\nHaven't played for 4 months.",
            "I also think the reason cheating is soooooo bad on rust is the culture behind it, it already breeds racist toxic children which naturally will breed cheaters, because the game is so toxic and high skill gap people will do anything to get an edge and talk shit."
        ]
    },
    "Well.. we thought we were going to cargo.": {
        "title": "Well.. we thought we were going to cargo.",
        "score": 91,
        "url": "https://v.redd.it/lz8mkzewrf9d1",
        "content": "",
        "num_comments": 13,
        "comments": [
            "The energy in this reminds me of a fateful scrappy trip my squad took once upon a time. We were on our way to a raid against a clan we'd been warring against all wipe. On the way our least experienced team member decided he was gonna toss a nade out of the scrappy. It bounced off the invisible walls and landed at my feet. There was 7 of us on board.",
            "Credits to my friend Franky for clipping this.",
            "\"Dreaaaaam he's a damn good scrappy flyer he's gonna get us   and we're all dead\"\n\nThis is too funny",
            "This is the only reaction to have! Great clip!",
            "Done this so many times. Sams have silencers bro lolol",
            "Backpacks are gonna fall from 10000 feet straight into their compound walls where the base bitch is filling furnaces.",
            "I miss rust for moments like these. But then I remember all the other BS lol. Yall seem like a great group. I miss the teams I ran with in rust I am shockingly still friends with a lot of them and I even went to ones wedding",
            "this is fucking lame. pretty easy to dodge the same rockets.",
            "Nah. Sometimes man you dont even hear these things. Got to love it",
            "Dream's pilot license expired."
        ]
    }
}