{
    "Gollum game 99% discount on Japan PSN store": {
        "title": "Gollum game 99% discount on Japan PSN store",
        "score": 339,
        "url": "https://i.redd.it/jvmf8cuf038d1.jpeg",
        "content": "…would I regret spending 50 cents on this…?",
        "num_comments": 62,
        "comments": [
            "Still too much",
            "Couldn't pay me enough to taint my SSD with this.",
            "You can coat shit in glitter but it's still shit",
            "Money aren't the problem, this game isn't worth your time",
            "Yes",
            "I wouldn’t play it even if it was free",
            "Yes",
            "I already dont have time for games I actually want to play, im not wasting my time on this garbage",
            "Bad news,is coming to ps plus essential for july",
            "yes"
        ]
    },
    "Saw this posted in threads but cannot recognize the last game. Anyone can tell me (100+ hours)?": {
        "title": "Saw this posted in threads but cannot recognize the last game. Anyone can tell me (100+ hours)?",
        "score": 201,
        "url": "https://i.redd.it/img9i7nnz28d1.jpeg",
        "content": "",
        "num_comments": 201,
        "comments": [
            "Persona 5",
            "Purse owner 5",
            "Kudos to whoever beat Elden Ring in 40 hours. I spent like 130 hours on my first run lol\n\nSame for Cyberpunk 2077. I guess you could just do the main story of that game in like 30 hours, but that’s missing a ton of the best content. I spent like 80 hours on that game. \n\nLast game is Persona 5, OP.",
            "CP2077 20-30 hours? Must be a joke, right?",
            "Baldurs gate 3 is also 100+ hours lol. Cyber punk is def not 30 hours.",
            "Elden Ring is more than 60h\n\nEdit, actually neither of them have accurate times to beat.\n\nIs this only story? If yes then it's still inaccurate because AC Mirage is less than 10h to beat just the story. 20h is more like completionist.  \nCyberpunk is easily 80-100h completionist.  \nDeath Stranding is also 100h completionist.  \nBoth Elden Ring and Baldur's Gate 3 are around 140h completionist.",
            "Its Persona 5, if you are interested play the Royal edition",
            "The fuck did this person do? Read no dialogue and do no side quests in Baldur's Gate 3?",
            "Cyberpunk is easily 100 hrs.",
            "Pur sone uh five"
        ]
    },
    "Worst game you’ve ever bought on PSN? For me it’s  Supermarket Simulation Grocery Empire 3d. Please don’t buy it LOL. ": {
        "title": "Worst game you’ve ever bought on PSN? For me it’s  Supermarket Simulation Grocery Empire 3d. Please don’t buy it LOL. ",
        "score": 565,
        "url": "https://i.redd.it/775j8umcmz7d1.jpeg",
        "content": "",
        "num_comments": 264,
        "comments": [
            "Why did you buy it tho? It clearly looks so bad on ps store.",
            "New Goldeneye map just dropped.",
            "![gif](giphy|LycfkVG4L6x0Y|downsized)",
            "I’m gonna buy this",
            "Bro are you level 20 😂",
            "Haha this looks shitty indeed, why did you buy it lol?",
            "But dem graphics slap tho",
            "imagine thinking you need to tell someone that this game is bad and not to buy it",
            "Even the character is standing looking at you like they agree",
            "Aw man, you just shot down 100% of my wish list."
        ]
    },
    "My first ps5 game purchase!": {
        "title": "My first ps5 game purchase!",
        "score": 59,
        "url": "https://i.redd.it/7h61l8oe538d1.jpeg",
        "content": "I was extremely indecisive about whether to play FFVII Rebirth or FFXVI, but in the end, I chose to go with FFXVI because of its mature rating and linear gameplay structure. I'm a bit bored of open worlds, so this game will feel like a breath of fresh air. I think I'll choose to play in quality mode instead of performance mode because Digital Foundry stated that the performance mode is unstable and blurry. I'd rather have a steady 30 FPS than an unstable \"60\" FPS with frame pacing issues.\n",
        "num_comments": 29,
        "comments": [
            "you might wanna check the performance mode. If i remember correctly, the Df video came before performance update",
            "There are no issues in performance mode",
            "Awesome first game purchase, Hoping a complete edition with DLC included be released in the future since i haven't bought the game yet.",
            "Enjoy mate!!!",
            "Mine was Spider-Man 2",
            "Excellent choice!\n\nAlthough definitely play Rebirth as well later on.",
            "Why is that 18 PEGI sign orange?",
            "One of my favourite Final Fantasies. \nPlay the 30fps mode but make sure to down that motion blur waaaay down. They use it awfully in this game.",
            "Same. My first ever ps4 game was also ff15. Tradition 😅",
            "What a start. After that you should go over to FF 7."
        ]
    },
    "What is the crown jewel in your PS4 library? ": {
        "title": "What is the crown jewel in your PS4 library? ",
        "score": 51,
        "url": "https://www.reddit.com/gallery/1dlpxqv",
        "content": "Mine is the physical copy of Darkwood.  When I found out there was a physical release for the game, I dropped what I was doing and hunted down a copy.  What physical game is the pride & joy of your PS4 library?  ",
        "num_comments": 36,
        "comments": [
            "I must find this game now.",
            "Both Gravity Rush games",
            "I own the physical copy of The Messenger which is worth over $200. Not bad.",
            "Never heard of it, is it worth it?",
            "#P.T.",
            "I would say divinity original sin 2. I love the game a lot and having it phisical feels nice.",
            "Godzilla",
            "Transformers: Devastation 🔥",
            "Where to buy physical?",
            "Does it end ? Or u play just till u died, coz I have the game but I played like for an hour and stopped"
        ]
    }
}