{
    "Happened to be watching my bandwidth while I had a movie going - should this be more consistent or is it all good?": {
        "title": "Happened to be watching my bandwidth while I had a movie going - should this be more consistent or is it all good?",
        "score": 25,
        "url": "https://i.redd.it/o04yt11dff9d1.png",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Spikes are normal. Plex sends data in bursts.",
            "It loads in chunks, so youll see it look like that for each chunk as it loads.",
            "YouTube videos work that way too, or any streaming service",
            "It sends bursts and your device buffers it. If it sent constantly then there would be dropouts if anything else started using the connection and the data rate dropped momentarily.",
            "Youre new to Plex it seems. It also seems this has been asked many times. Totally normal, it sends data in chunks to create a buffer. Depending on your internet speed, if you are sharing outside of your home, 4K content might have issues. Always remember to multiply the bit rate by 1.5-1.8 to get an idea of what upload speed you will need.",
            "Not only new to plex but new to computers lol",
            "Oh boy, you have quite the journey!",
            "Maybe hes new to Reddit.",
            "New to reading usernames for sure",
            "Totally normal."
        ]
    },
    "Issues with an AT&T BGW320 client remotely accessing a server": {
        "title": "Issues with an AT&T BGW320 client remotely accessing a server",
        "score": 14,
        "url": "https://www.reddit.com/r/PleX/comments/1dqyagn/issues_with_an_att_bgw320_client_remotely/",
        "content": "Hi, I have a Plex server that my friends access, in various regions of the US. Remote access works great for everyone and is set up properly with port forwarding on 32400/ the whole shebang, on Fios. One friend recently moved to an AT&T fiber serviced location and is having issues with buffering when they access my server. Plex plays for a few seconds then buffers, this repeats continuously on original quality (<15 Mbps bitrate file). I am visiting him this weekend and was able to verify this behavior myself and am determined to get this working. The modem/router is a BGW320 and we reset the modem and tried to port forwarding on his admin settings, but the buffering still happens. Does anyone have any experience with this issue and have any possible solutions we could try?  Thanks!",
        "num_comments": 15,
        "comments": [
            "Judging by what you've said in the comments; it's the peering between FiOS and AT&T.  The link between y'all is congested.  You can force transcoding at a lower bitrate to see if that alleviates the issue.  I usually have all my remote clients reduced to transcoding.",
            "What does the plex dashboard show when it's buffering for him? What is the client he's watching on? Is it trasncoding and you dont have a gpu to do that which causes major buffering? There could be many different things going on aside from the ISP side of things. I have the BGW320 and host to about a dozen people throughout the US and Europe and have zero problems, and I'm passing plex through a fqdn such as plex.example.com.",
            "Call AT&T and verify that the ports are ACTUALLY OPEN. I had a similar issue. I had opened the ports from the router its self but still was having issues. Called AT&T and they confirmed that all ports were closed regardless of what I saw on my end. Call them and verify that your ports are open before wasting any more of your time.",
            "Variety of clients (latest Shield, ATV, Roku Ultra) - phone wifi has buffering but data works fine",
            "It's a direct play, no transcoding occurring. Same buffering result on multiple clients (Shield, ATV, Roku, Plex for Mac/Windows)",
            "Good to know he doesn't need port forwarding. No issues with other streaming platforms, and he has 500/500 internet. It's just Plex.",
            "I have Verizon Fios, but I will try out that ifperf with him when I'm back, thanks! I do find it kind of strange for there to be issues with Verizon Fios --> AT&T, I'm sure there are others in  DFW with AT&T who remotely access Plex but who knows.",
            "Go into the Remote Access setting and change the port to something a bit different like 32499 or something. Maybe his ISP thinks they are being smart by throttling 32400 knowing it's a common Plex port.",
            "Your post is confusing.  Is your friend having issues streaming from your server or is he setting up his own server and having issues with it?  The reason I ask is because you talk about port forwarding on his modem, port forwarding is only needed on the server side not the client.  If he is a client of your server port forwarding is not required or recommended on his router because this just opens a port to allow connection into his LAN but he is not hosting anything so why open a port.  If he is the only one buffering then the issue is not from your server either.  He either has a poor lan setup (wifi if in use) or there are connectivity issues between his home and yours.  You can try running iperf between his computer and yours to see how good the connection is but unless the issue is his home networking, there is not much you can do to fix it if it's due to his ISP peering with your ISP.",
            "There's really no reason to port forward on a client side.  I would try setting a service on another port on your side before you go so you can transfer a file to do a speed test, like a web server with a big file or SSH.  Also maybe setup Plex's alternate port and see if he has issues with that one, maybe his ISP is traffic shaping.\n\nWhat type of device is he using for the client?  See if his phone on WiFi and on LTE get similar results."
        ]
    },
    "Transcoding when downloading the file directly via browser": {
        "title": "Transcoding when downloading the file directly via browser",
        "score": 0,
        "url": "https://www.reddit.com/r/PleX/comments/1dra8ln/transcoding_when_downloading_the_file_directly/",
        "content": "Why is my Plex server transcoding files for download when the user downloading them is accesing Plex via a internet browser and downloading the file directly using the below option?\n\nhttps://preview.redd.it/9skq6vrv8i9d1.png?width=200&format=png&auto=webp&s=ebfc5ff5a0019d9a74e9a605eb01af4223e21dd5\n\nAny help appreciated, the users are both savy enough IT wise so arent doing anything stupid their end. If i try it locally, the file downloads without transcode so is it an external users thing?",
        "num_comments": 1,
        "comments": [
            "Stop using a browser for plex. Use the Windows app instead."
        ]
    },
    "Encountered a strange glitch with mkv metadata while trying to add some movies to my library. Is this a known behavior?": {
        "title": "Encountered a strange glitch with mkv metadata while trying to add some movies to my library. Is this a known behavior?",
        "score": 1,
        "url": "https://www.reddit.com/r/PleX/comments/1dra21g/encountered_a_strange_glitch_with_mkv_metadata/",
        "content": "I noticed about a week ago that about half a dozen .mkv files I'd added to my \"Movies\" directory weren't showing up in my Movies library. I did the usual troubleshooting, including checking the files were correctly named according to the naming conventions, checked the file permissions, rescanned the library, and did the \"Plex dance\" (move files out of the library, rescan, move files back in, rescan again). Finally, I gave up, deleted the library, and created it again. The movies still didn't show up.\n\nAt this point I wondered if there was something wrong with the files themselves. They all used H264 and aac codecs, and played fine in VLC. I used `MkvToolNIX GUI` to look at the files, and after experimenting with removing different tracks, I found that deleting the \"Global tags\" entry from one file caused the corresponding movie to show up in my library.\n\nhttps://preview.redd.it/0aj9fnql2i9d1.png?width=920&format=png&auto=webp&s=8fc5fb5353e5bbf1d4f542bec579bd4253f4c015\n\nI copied all the offending files to my desktop, then used `ffmpeg` to transfer their contents into new .mkv files using the below command. This creates a new mkv file with the same video, audio, and subtitle streams, in the same codec as the original file, although the `map_metadata:g -1` flag removes all the global metadata/tags.\n\n`for i in *.mkv;`   \n   `do ffmpeg -i \"$i\" -vcodec copy -map 0:v -acodec copy -map 0:a -scodec copy -map 0:s -map_metadata:g -1 -y \"(path)/Movies/$i\";`   \n`done`\n\nEach movie showed up in my library immediately! To confirm the global tags were the cause, I ran the same command without the `map_metadata:g -1` flag, and the files which included the global metadata were not recognized by Plex (i.e. did not appear in the library). \n\nIs this a known behavior for Plex servers or have I discovered a new bug? I couldn't find any posts online documenting similar behavior, but I can't be the first person to encounter this. Is there some other factor that could explain this issue? I'm running server version 1.40.3.8555 on Linux Mint 21.2.",
        "num_comments": 0,
        "comments": []
    },
    "Database folder, is this right?": {
        "title": "Database folder, is this right?",
        "score": 1,
        "url": "https://www.reddit.com/r/PleX/comments/1dr9sup/database_folder_is_this_right/",
        "content": "So my plex have been acting up, and I have no clue why - I keep getting s1001 errors.\n\nSo I decided to read up a little and one of the steps is the check the .db folder - but mine looks like this, is this right? I thought I would be finding 1 file(?)\n\nhttps://preview.redd.it/4gdqhg5u4i9d1.png?width=1030&format=png&auto=webp&s=e5be10d3316a0f3c1248c93539a319bfa3cdf71b\n\n",
        "num_comments": 0,
        "comments": []
    }
}