{
    "Read the rules before posting or commenting!": {
        "title": "Read the rules before posting or commenting!",
        "score": 107,
        "url": "https://www.reddit.com/r/Plumbing/comments/16doa2v/read_the_rules_before_posting_or_commenting/",
        "content": "Due to a large influx of people not reading the rules and how small of a Mod team we are this is here to serve as the only reminder of the rules. Just to be clear asking or commenting about prices is a permanent ban, the internet is not the place to judge if prices are \"fair\".\n\nRules are available on the sidebar.",
        "num_comments": 0,
        "comments": []
    },
    "FROZEN PIPES MEGATHREAD": {
        "title": "FROZEN PIPES MEGATHREAD",
        "score": 120,
        "url": "https://www.reddit.com/r/Plumbing/comments/zssj2d/frozen_pipes_megathread/",
        "content": "Please post any questions you have regarding frozen lines here. All other new posts will be removed from the main feed and directed here.",
        "num_comments": 507,
        "comments": [
            "We had a bad cold front come in last night and I forgot to disconnect my outside hoses. I got them both disconnected but one of the spigots has ice inside it. Is there anything I can do?",
            "Woke up to discover no hot water coming from faucets. That is, no water flow at all when faucets are opened to hot. Cold water seems to come out normally. Any ideas why this would be or how to fix it? We have a tankless water heater, FWIW.",
            "First time my pipes ever froze while sitting at sub zero temps for 47 hrs and with all faucets dripping, rolling black outs that happened like every 30 mins ended screwing up my heater some how and I was sitting at freezing. Lucky my pipes unthawed today without any damages and seems the heater kind of wants to blow warm air. Hope you all have the same fortune and merry christmas.",
            "Long ago at my old landlords appt, there was a bathroom that stopped working one winter. We found that putting a mini space heater in there “fixed” it. There was mold below there in the basement on the drywall. Oh how I’m thankful to learn things and well that this wasn’t my appt at the time. We did tell the landlord about it of course. He didn’t have any concerns lol",
            "Frozen Pipes not Thawing\n\nHello.  Woke up this morning to no water it’s currently -5 feels like -30F with windchill so I’m assuming my pipes have frozen.  Live in a single story house with a crawl space where I put two heaters and turned the main water valve off.  I’m just wondering how long it normally takes I have had the heaters going for about 3 hours and still nothing has changed I felt the copper pipes and thought I found where the freeze was but nothing has moved.  When should I expect some movement?",
            "Q: How can I diagnose a frozen/burst line?\n\nLast night I took a shower in the main bathroom with zero issues. This morning I noticed that no cold water is available at that same shower. All other lines in the house are operational i.e. no issues with hot or cold at sinks, other showers or tubs.",
            "Yesterday we woke up to none of our faucets working, save for one sink in the basement with a small drip (a drop every 9 seconds or so). Called a local plumber, they gave me some tips and told me to wait it out. We kept the house hot, wrapped an electric blanket around the mains and opened the taps a little. Husband turned off the mains while we slept overnight, turned them back on this morning, heard a clunk as an ice chunk flowed through and, alleluia!, water is flowing! Hot and cold both are working as normal in all sinks and tubs, toilets are flushing (thank goodness, we were melting snow to fill the tanks!) and we can't see any evidence of obvious leaks in the walls, basement or outdoors. We've had a single tap going for about an hour now just to keep water moving.\n\nI guess my question is ... are we good? I'm dying for a shower and have a dishwasher full of dirty dishes I'd love to get done. I tried to call the plumbing office for advice but they're closed until Monday (understandable). I think I will call them Monday and see if I can have someone come out, though I don't know what they'd be looking for.",
            "Can some northern plumber ELI5?\n\nHow do pipes not freeze in Alaska? Do they drip them all winter? Do they have a recirculator or something? Is there some kind of permanent solution I can implement? I’ve never burst a pipe yet, but gosh darn, my water bill 😭",
            "Perhaps a little meta, but is there a better alternative to those !@$ \"frost-free\" siphons? Just had the *third* one burst on me in so many years, and now I'm slowly drying out all the lumber in my basement that got soaked.\n\nI suspect that some gardener or another left a hose attached during that freeze a couple weeks ago, but my girlfriend swears that's not the case.",
            "Need some advice. I live in the south. House is raised. Pipes are uninsulated. I'm leaving town for 4 days. I plan to insulate the line that comes from the street into the house. Shut off the main supply, leave all faucets open, and put some RV antifreeze down the toilet. Is this the right move? Or am I better off leaving the faucets running for 4 days?\nI am also concerned about my water heater. It's a gas tank that's outside. Will it be fine or do I need to drain it?"
        ]
    },
    "What’s going on here?  Copper stub out for toilet supply line can retract.  No leaks.": {
        "title": "What’s going on here?  Copper stub out for toilet supply line can retract.  No leaks.",
        "score": 176,
        "url": "https://v.redd.it/xfhlpri1nc9d1",
        "content": "",
        "num_comments": 120,
        "comments": [
            "Assuming the water works, It’s not anchored anywhere. You’re probably flexing a bend somewhere down the line.",
            "Pull on it a few more times and you can post here asking how to fix the leak. You might be surprised to see how much water a 1/2 \" pipe can flow.",
            "Probably not clamped behind the wall, I would not do that because you’re flexing Ridgid pipe",
            "STOP YANKING ON IT!. You wanna flood your house? This is the way to do it.",
            "Wherever it sits without flexing. You can buy a “split flange” escutcheon that is the exact size of the pipe that splits into two so you can secure the pipe in place without having to take the plumbing apart. If it still moves after use some silicone adhesive to seal the pipe to the escutcheon. That’s should do it if no access to it from below or the other side of the wall.",
            "It’s fine unless you do it more than three times.  You didn’t pull it more than three times did you?",
            "Maybe there is unstrapped pex behind there.",
            "It looks like half inch type l telescopic closet supply very high end stuff",
            "I'm still wondering who wrapped pipe insulation on a toilet stub out and why",
            "The horizontal run inside the wall is not secured. Doubt it will leak (if it’s all copper). Don’t play with it too much. I wouldn’t worry about it, though it might be subject to abrasion which will eventually puncture the pipe wall. If you so desire, open the wall and make sure it’s isolated from other surfaces and add a strap or two. Might not be easy or attainable."
        ]
    },
    "Can anyone please help me get my shower water turned off? Handle broke off. Emergency ": {
        "title": "Can anyone please help me get my shower water turned off? Handle broke off. Emergency ",
        "score": 6,
        "url": "https://i.redd.it/6ew8i195uh9d1.jpeg",
        "content": "The handle broke off and I can’t find anything online comparable to this one. The white skinny part that’s exposed is to control the temperature. I’ve spun it around multiple times and all it does is keep changing hot and cold. ",
        "num_comments": 28,
        "comments": [
            "Go kill your main. Beside water meter.",
            "Start taking screws out of the cover plate. The whole chrome plate has to come off including the handles. You can pop the cover off the handle and there should be another screw. Once you get the whole cover plate off, there MIGHT be two brass stops that you can turn off with a screwdriver. It depends on the valve. If there isn’t, you’ll likely have to shut water to the house off.",
            "Looks like you need a new cartridge. Turn off ur water to the house unless you can contain the spray. Then call a plumber, it's not recommended to change a cartridge unless you know what your doing.",
            "Did you try grabbing the brass piece sticking out with pliers and turning?",
            "This is why you should know how to turn off water supply.",
            "It’s possible there are shut offs built in to the shower valve body behind the chrome trim….if that’s not the case, you’ll need to turn the water off to your house…either in the basement or out by the street with a key.\n\nTo check….remove the other handles, use a Phillips head and take that plate off…if it does have stops…they’ll probably require a flat head screwdriver to turn off",
            "“Emergency”  Call a damn plumber.",
            "Unbelievable but people don't understand there is a main shut off. That is the first thing you do",
            "If newer home there will be a plumbing manifold you can shut off water to specific rooms of the home.  Google image plumbing manifold and look for one I. Garage, utility room, basement etc…\n\nIf not then you’ve got to shut water off at street level to the whole house until this can be repaired",
            "This. Pliers or vice grips or teeth if you’re truly desperate and can’t find the main shutoff."
        ]
    },
    "Heatah": {
        "title": "Heatah",
        "score": 35,
        "url": "https://i.redd.it/lpm8u2mzme9d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Expansion tank seems a bit undersized",
            "Piping by a real craftsman . Nice job",
            "Other than the expansion tank \nI got a chubby",
            "Pretty nice install, I have a few nit picks though, the biggest one being no balancing valve on the return going back to the tank. It's going to be impossible to get the temp set correctly.",
            "The other pump was never seen again.",
            "Do you guys not have any regulations on your temperature/pressure relief pipes? We have to terminate outside and it can be a massive pain in the dick to get the pipe outside.",
            "It’s so pretty. Not a plumber.",
            "Beautiful work. Just left residential plumbing because I’ve all but mastered the same old boring low skilled plumbing. Just started commercial work. I hope to be this skilled one day.",
            "Those tanks have a mechanism similar to a balancing valve built in I thought",
            "Nice work."
        ]
    }
}