{
    "3 Reasons to Join Our PokeInvesting Discord!": {
        "title": "3 Reasons to Join Our PokeInvesting Discord!",
        "score": 206,
        "url": "https://www.reddit.com/r/PokeInvesting/comments/l8d2ox/3_reasons_to_join_our_pokeinvesting_discord/",
        "content": "Having visited most of the Pokemon Discords, the PokeInvesting Discord is one of the best by far. We have the friendliest and most respectful community. Our channels are more organized with members interacting who you'll actually recognize. It's not a sea of random people like other discords. Staying small is our key to remaining high quality. So here's 3 reasons to consider joining.\n\n1. Four Game Store Partners. - We have two vendors in Japan (ship worldwide) and two vendors in North America. They each have their own store channel to answer questions. One of our Jpn vendors only sells singles and can source anything you need. The whole idea is to be able to easily preorder, buy and ask questions with game stores from different regions with ease.\n2. Deals and Card Call Outs. - There are deals channels categorized by region, members post the deals they find online. The difference to other Discords is we don't allow discussion in these channels. So you can set your alerts, then find online deals and call outs from vigilant PokeInvestors on the lookout. We also monitor the largest game stores for restocks and drops, aside from having retail deals callouts on Discord from other sources.\n3. Space Is Limited. - Some Discords have thousands of members but then keeping up becomes difficult cause there's so many people. The PokeInvesting discord will never have more than a few hundred people if that, we will have to close off to keep a healthy state and good flow. The goal is to have a tight knit community of dedicated PokeInvestors who's voice matters and is heard, to avoid overcrowding we have to keep space limited.\n\nAt the end of the day it's an active community discussing every aspect of Pokemon finance. If you want more Pokemon investing, daily content it's a good place to be. There is paywall but it's a natural filter because people who hate it won't make it there, and those who do truly want to join do-so, it creates the positive energy our community has which is why it's in place. If you want to join the PokeInvesting Discord you can see more: [https://patreon.com/PokeInvesting](https://patreon.com/PokeInvesting)",
        "num_comments": 136,
        "comments": [
            "1. Added 9 monitors tracking different game stores for restocks!\n2. Added two more vendors who you can work with personally just PM anytime!\n3. Monthly booster box live breaks continuing with Brilliant Stars next later this Feb.!",
            "Interested, signed up to try it out.",
            "An unbelievably cool community for sure. My favorite part of the community is the VAST knowledge possessed by the members. I've learned so much. About grading both vintage and modern, safe buying and selling, what products people are investing in daily, and just tons of other various on-the-spot knowledge like what packs come inside specific tins to talking about what's a good value for a certain sealed product at the moment - it's all so incredibly helpful.",
            "Are the partner stores actually providing products around MSRP? Honestly, if I can guarantee a few ETBS on release for close to MSRP, it would be worth the price. Even my LGS is starting to push prices up a pretty good amount.",
            "+1 to everything said so far. Ill add that its been incredibly fun to see what others are investing in, collecting, and finding locally as we all enjoy the hobby together.",
            "Im from Malaysia , can I really find good deals/trades considering the shipping and all that",
            "I think Im going to sign up. Im not a hard core investor like a lot of people (been leaning on some of my vintage cards), but there are a lot of 25th anniversary items that Im afraid of missing out on. \nThank you!",
            "Hey, I signed up a couple days ago and still haven't received the invite (I sent a massage through Patreon too). I'm sure I'm timed it wrong with the holiday weekend, but I'm hoping to get it soon. Thanks!",
            "Just signed up to check it out! Do I get an email with the invite or how does this work?",
            "Are spots still available? I would be interested in singing up :)"
        ]
    },
    "Weekly Questions! What Do You Need Help With?": {
        "title": "Weekly Questions! What Do You Need Help With?",
        "score": 3,
        "url": "https://www.reddit.com/r/PokeInvesting/comments/1dnfk9u/weekly_questions_what_do_you_need_help_with/",
        "content": "Have questions? Not on PokeInvesting Discord? Here's the weekly post for the sub to ask away!  \n\nUse this thread to ask anything related to Pokemon finance. (Each week the old thread will be discarded and a new thread for the week will be added.)  \n\nThis thread was created for questions like should I sell, how much to sell for, what to buy, etc. So we don't derail the sub with a stream of question posts. Thanks!",
        "num_comments": 33,
        "comments": [
            "Im planning on starting investing and I would like to buy cases of booster boxes. Are there known reputable sites or should I be looking for good cases on eBay?",
            "Hold Paldea evolved Magikarp or sell rn?",
            "Should i make my first investment and buy a 151 tin for 12 ($12.80)?",
            "Why is the slab market down right now? Have 10-15 slabs ranging from low end to high end vintage and modern and for some reason people are saying that people are less interested in slabs compared to raw/sealed. Why is this, should I sell them for lower value or hold and hope the slab market goes back up?",
            "I would really love to get a moonbreon and was wondering if theres a chance of the price going down substantially or not before I pull the trigger. I see the japanese psa 10 version going for roughly 1300-1400usd as of now.",
            "Pulled Eevee 188/167 & Gardevoir Ex 245/198. Pretty decent prices at the moment, should I sell?, grade and list or hold onto them?",
            "anyone got a snkrdunk $10 off code?",
            "I am in Japan for another week right now and I was wondering if anyone has a good idea on what Japanese Pokemon products to purchase right now while I am here. Which sealed product that might be popular and easy to purchase direct in Japan and etc. I also have a Japanese address I can use for shipping from the Japanese Pokemon Center. Thanks!",
            "I want to buy 2 Etbs, one to keep sealed and one to open... what etb would you get.. Paldea Evolved or Paldean fates?",
            "Hey all, I have been asked by a deceased friend's family to help sell his pokemon collection. It is mostly cards from the base, base 2, jungle, fossil, and team rocket sets. They've seemingly been untouched for 25 years, but there are thousands of cards. What is the best way to approach selling them? Is it to bulk the cards? Have everything graded?"
        ]
    },
    "New Pokemon Be Like": {
        "title": "New Pokemon Be Like",
        "score": 187,
        "url": "https://i.redd.it/f9553sycwe9d1.jpeg",
        "content": "",
        "num_comments": 25,
        "comments": [
            "More like a stop sign with eyes called Red Stop Sign",
            "They ran out of good ideas.",
            "srsly they ruined pokemon, it should stop at like gen 5. The motorcycle pokemon is just crazy",
            "Youre crazy if you think Pokmon like Roaring moon, Ogerpon or Skeledrige are worse then electrode or dewgong",
            "Looking like the snail call from one piece lol",
            "What does this have to do with investing? Post these crap memes over on the actual Pokmon sub, we get enough awful posts here already",
            "Still better looking that charizard",
            "Came here for this comment. Thank you ",
            "This is how I always used to pronounce Gyarados as a kid since I never noticed the Y.",
            "Everyone has been saying that since Gen 2 came out. I am sure motorcycle pokemons are some kids favorite."
        ]
    },
    "Japanese 151 collection complete!": {
        "title": "Japanese 151 collection complete!",
        "score": 84,
        "url": "https://www.reddit.com/gallery/1dr2quz",
        "content": "Full CGC Gem Mint 10 Master Ball set with full Pristine 10 SAR and AR sets. The master balls are not all pristine 10s, just a coincidence that most of the ones showing are. When I have them all out, I feel slightly insane and have probably overdone it ha. Please Pokemon Company, don't release a gen 2 set. I can't handle it again 😭😂",
        "num_comments": 30,
        "comments": [
            "Insane work..... Did you grade all of these yourself or purchase them graded?",
            "Price paid for all this?",
            "That Vileplume needs to be YEETed into next doors garden!",
            "Thanks for sharing the pictures. I was thinking about doing the same, with PSA, but it looks too bulky. Takes up way too much storage space for my liking.",
            "Holy shit. This is so unique. Heres hoping for some huge future gains for you brother!",
            "Time to search out and convert all the gem mints to pristine to have everything matching lol",
            "Damn that is some sexy organization",
            "Impressive! But what we *really* wanna know is what this cost you.",
            "Holy shit. nice collection man!",
            "Yeah! I would do this too if I were rich."
        ]
    },
    "Who are you betting on long term?": {
        "title": "Who are you betting on long term?",
        "score": 54,
        "url": "https://www.reddit.com/gallery/1dr0obc",
        "content": "",
        "num_comments": 55,
        "comments": [
            "As a casual fan who just re-entered, 151 is ridiculously popular. Feel the Zard will rise well as it's also part of a cool art set with the Charmander and Charmeleon.\n\nBoth will rise tho for sure.",
            "Ive never cared for this lugia. I think both cards will do well though",
            "I think Lugia. There are so many Zard cards out there and dont get me wrong the 151 is amazing. But there is only one Lugia we really all refer to.",
            "I'd go with Lugia, but it all depends on how much 151 gets printed. Artwork is better, it stands out amongst the rest of the cards in the set, and Charizard is about 3x easier to pull (1/674 vs 1/225).\n\nI own both and pulled the Charizard myself. I personally wouldn't buy the Charizard when I can get the Venusaur, Zapdos, and Alakazam for the same price (which all look better imo).",
            "I'm betting on myself that I would choose the wrong one",
            "I would lean more towards the Zard, scarlet and violet is still new and cheap the lugia has peaked for a little while.",
            "Art wise that Lugia slaps the charizard left and right every day of the week and twice on sunday.",
            "151 Charizard jusr because long term the Pokemon community always chooses Charizard",
            "I would go for the Lugia. I have both cards, pulled 2x Charizard myself. Its so much easier to pull  compared to the Lugia so I think its value wont hold in the short to mid term. Especially when 151 reprints will be here.",
            "I own both in English and the charizard in jpn. I think they both will be solid bets down the line as unique art designs. The lugia had a massive dip and has pulled back up, and I think it will continue to climb. Charizard will do the same in another year and a half. Long-term holds that are for sure solid!"
        ]
    }
}