{
    "Weekly questions, bugs, and gameplay megathread - June 2024": {
        "title": "Weekly questions, bugs, and gameplay megathread - June 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/pokemongo/comments/1dn86my/weekly_questions_bugs_and_gameplay_megathread/",
        "content": "**[Rules](http://www.reddit.com/r/PokemonGo/wiki/rules)**\n\n**[Bugs](https://niantic.helpshift.com/a/pokemon-go/?p=web&s=release-notes-known-issues)**                         \n\n**Instruction Manual**\n\n* **[Main Map](https://www.reddit.com/r/pokemongo/wiki/manual#wiki_main_map)**\n\n* **Menus**\n\n* [User Menu](https://www.reddit.com/r/pokemongo/wiki/manual#wiki_user_menu)\n\n* [Settings Menu](https://www.reddit.com/r/pokemongo/wiki/manual#wiki_settings_menu)\n\n* [Pokédex](https://www.reddit.com/r/pokemongo/wiki/manual#wiki_pok.E9dex) (Updated 29 Jul for number of available Pokémon)\n\n* [Shop](https://www.reddit.com/r/pokemongo/wiki/manual#wiki_shop)\n\n* [Items](https://www.reddit.com/r/pokemongo/wiki/manual#wiki_items)\n\n* [Pokémon Storage](https://www.reddit.com/r/pokemongo/wiki/manual#wiki_pok.E9mon_storage)\n\n* [Pokémon screen](https://www.reddit.com/r/pokemongo/wiki/manual#wiki_pok.E9mon_screen)\n\n* **[Catching Pokémon](https://www.reddit.com/r/pokemongo/wiki/manual#wiki_catching_pok.E9mon)**\n\n* **Gym Battling**\n\n* [Pokémon Types](https://www.reddit.com/r/pokemongo/wiki/manual#wiki_pok.E9mon_types)\n\n* [Controls](https://www.reddit.com/r/pokemongo/wiki/manual#wiki_controls)\n\n* [Team Selection](https://www.reddit.com/r/pokemongo/wiki/manual#wiki_team_selection)\n\n* [Gyms](https://www.reddit.com/r/pokemongo/wiki/manual#wiki_gyms)\n\n* [Raids](https://www.reddit.com/r/pokemongo/wiki/manual#wiki_raids) (Updated 29 Jul for changes upon Legendary release)\n\n* **[Easter Eggs](https://www.reddit.com/r/pokemongo/wiki/manual#wiki_easter_eggs)** (Includes Eevee evolutions) \n\n-------------------\n\n**Useful Links**\n\n* [Pokémon GO Info](http://pokemon.gameinfo.io/)\n\n* [Gamepress](https://pokemongo.gamepress.gg/)\n\n* [The Silph Road](https://thesilphroad.com/)\n\n* Which Pokémon should I evolve? /r/PokemonGoIVs\n\n-------------\n\nNiantic support : https://support.pokemongo.nianticlabs.com/hc/en-us\n\n/r/PokemonGO FAQ: /r/PokemonGo/wiki/FAQ\n\n-------------\n\n**There's this Pokéstop/Gym near me which seems inappropriate. Can I report it?**\n\nUse [this](http://support.pokemongo.nianticlabs.com/hc/en-us/requests/new?ticket_form_id=319928) link. However, Niantic seems to be preoccupied with other things now, so don't expect too much.\n\nWe have Niantic representatives on both here and /r/TheSilphRoad - please **do not** ping them for bugs which are in the known issues page unless you have found a niche yet gamebreaking issue/exploit.\n\n--------------\n\n**Where can I find other players in my area?**\n\nTry our [regional subreddits list](http://www.reddit.com/r/pokemongo/wiki/regionalsubs)! Also, see the [related subreddits](http://www.reddit.com/r/pokemongo/wiki/relatedsubreddits) or [TSR's community map](https://thesilphroad.com/map#2/)!\n\n--------------\n\n**If you have any suggestions for FAQs to append to this thread or for meta questions, [message the moderators](http://www.reddit.com/message/compose?to=%2Fr%2Fpokemongo) or mention /u/PokemonGoMods!**",
        "num_comments": 149,
        "comments": [
            "Anyone else experiencing extreme choppy / laggy gameplay? I’m wondering if it is just how it is or if my client needs to be reinstalled",
            "I logged in and my avatar is now black? Why and how do I fix it?",
            "140 eggs hatched and not even a single shiny. WANT that shiny larvesta...just don't think it's in the cards for me",
            "Was there a sudden increase in the Friend List limit? I'm up to 401 now.\n\nGoogle isn't telling me anything, and I don't see any threads about it?",
            "My map range has been shortened on android as in a carnt see as many stops and gyms in the backround but hasnt changed on iphone, has anyone else experienced this?",
            "Did they remove the location caught on older pokemon? I keep some from my vacation to Thailand around as memories and now it doesn’t show them",
            "Why is the 8th anniversary ticket not on the web store?",
            "Man I am so sad that Rayquaza is Elite and Pokegenie doesnt work, my community it too empty to get enough people :(",
            "throwing mechanics fixed. now pokemon are running away/popping out more than usual. used 10 ultras all with berries and great throws on a torchick lol",
            "Which missions require having Best Buddies? I haven't bough any special missions. Are there free missions that require Best Buddies? Any on the way to level 50? Thanks."
        ]
    },
    "The Spotlight Corner": {
        "title": "The Spotlight Corner",
        "score": 6,
        "url": "https://www.reddit.com/r/pokemongo/comments/1dnxhsa/the_spotlight_corner/",
        "content": "Hello r/pokemongo Community,\n\nWelcome to the Spotlight Corner.\n\nThis is a thread related to the Spotlight Hour Pokemon.\n\nPlease post any questions, inquiries, discussion as well as images related to this event here.\n\nAny submissions related to Spotlight Hour outside of this thread may be *removed* at a moderator's discretion to avoid flooding the subreddit.\n\n**Details of this week's Spotlight Hour Event**:\n\n* The next Pokemon GO Spotlight Hour will be on Tuesday 25th of June 2024 at 6pm - 7pm in your local time-zone\n* The chosen Pokemon is **Morelull**\n* The chosen Pokemon will appear more frequently in the wild for the duration of the event\n* The featured bonus for the hour of the event is **2x Catch Stardust**\n* Can it be shiny? Yes\n\n[Subreddit's Rules](https://www.reddit.com/r/pokemongo/wiki/rules#button)\n\n[Frequently Asked Questions](https://new.reddit.com/r/pokemongo/wiki/faq#links#button)\n\n[r/pokemongo Discord Server](https://discord.com/invite/pokemon-go#discord#button)\n\n[Official Website](https://www.pokemongolive.com/en/#legends#button)\n\n[Niantic's Helpdesk](https://niantic.helpshift.com/a/pokemon-go/?p=web)",
        "num_comments": 10,
        "comments": [
            "We eating good today boys ",
            "I gained nearly 150k stardust for the whole hour with a Star Piece activated for each half hour.  I totally went all out on this one since I hardly get to play spotlight hours due to working swing shifts.  If only we can show our own screenshots on reddit.  That will be nice.  But yeah, gaining 150k stardust is a win for me.",
            "No shinies, but I got about 225k stardust, so I am satisfied with the hour.  Sucker was hard to catch though went through alot of gifts.",
            "Good thing the 0.319 patch that fixes the throw mechanics arrived just in time for this.",
            "This dumb mushroom is annoying difficult to catch, still managed to bag a shiny though",
            "I’m new to the game how do I get the raid things so I can do a raid",
            "How do much star dust?",
            "Spin a gym for a free raid pass daily or buy them",
            "Just done with mine.   \n286 Caught  \n5,36,250 Dust  \n1 Shiny  \nNo Hundo  \n400+ Ultra Balls used\n\nUse ultra balls only. Don't bother with other pokeballs, especially if its boosted."
        ]
    },
    "Rare niantic support W": {
        "title": "Rare niantic support W",
        "score": 2543,
        "url": "https://i.redd.it/xk4q5kxy9e9d1.jpeg",
        "content": "Actually so surprised",
        "num_comments": 105,
        "comments": [
            "Sheet I just so happened to delete all my shiny 100% ivs legendarys might have to hit up Mariah",
            "No, you were supposed to complain about the one golden razz berry you lost trainer",
            "I did that a few weeks ago with all 300 of my pinap’s when I meant to delete my nanab’s and I was so upset😭",
            "I had a similar experience, accidentally deleting 500 max revives. They gave them all back. I was a newer player. Of course, I only have 25 max revives at any time now.",
            "I accidentally deleted 800 green raid passes 🤨 \n\nPlz Mariah",
            "Now I just want to see your storage number !",
            "Y'all really be deleting your berries? You know you can get stardust for feeding them at gyms?",
            "Oh no…I accidentally trashed my 150 master balls😳😳😳",
            "Meanwhile I had to drag a poffin out of them because adventure sync goofed up, over 48 hours with them",
            "this is bs man, i can't even get a single remote raid pass when i have lost like 10 to the bug"
        ]
    },
    "Raided with a random person in Japan, and they keep gifting me event tickets!": {
        "title": "Raided with a random person in Japan, and they keep gifting me event tickets!",
        "score": 1385,
        "url": "https://www.reddit.com/gallery/1dqxvvc",
        "content": "By pure chance, I kept running into the same person in all my raids by my apartment in Tokyo. We would run into each other at gyms, always end up raiding with one another and added one another after our first raid!\nIt's became a daily thing, and we never did manage to meet or even say hi to one another, although we must have been step apart! (Make it a habit not approach people, especially women playing Pokemon go unless someone approaches me first, so this was bound to happen haha.)\nHowever, I had to return home and we've been making an effort to send each other new and unique gifts everyday.\nIt's fun to say the least and an awesome experience.\nAnd they keep gifting me raid passes!\nToo bad they're not on Campfire so I can say a million thank yous, however, I use my buddy Pokemon to say TY and they do as well, so it's great.\nThis community is amazing when it comes together.\nI hope you all are having an amazing summer because I really needed this right now and it's great. I wanted to share! ",
        "num_comments": 52,
        "comments": [
            "Now that’s awesome luck. Great of that guy to do this for you too!",
            "I wish I could have a Pokemon go sugar daddy that gifted me tickets! Haha but seriously that is stupid sweet of a stranger to do",
            "that's really cool, i've received a gifted ticket twice, yet sadly the game has failed to tell me who sent it. so i just named my buddy thx4ticket or something lol",
            "I also have a friend in Japan that sends me almost every ticket! It's not the same one is it? Lol",
            "This is so wholesome 🥹🥹🥹🥹",
            "Do you invite her to raids or does she invite you? My guess is she got a shundo from one of your invites and is grateful. Have you tried sending dm her via campfire? Try messaging her in both English and Japanese(using Google translate)",
            "That’s really sweet of them!",
            "Sorry if this is a dumb question, but how do you use your buddy to say thanks?",
            "Maybe they got a shundo In that raid :o and this is their way to say thanks",
            "Someone recently bought me a comm day ticket, I was so pleasantly surprised no one has ever done that for me , I used my buddy to say thanks as well"
        ]
    },
    "Naming and shaming time! A gift every day for almost half a year and all I get is screwed over. Nobody add this person, and if you have, remove them.": {
        "title": "Naming and shaming time! A gift every day for almost half a year and all I get is screwed over. Nobody add this person, and if you have, remove them.",
        "score": 140,
        "url": "https://i.redd.it/aeu410oxhh9d1.jpeg",
        "content": "",
        "num_comments": 54,
        "comments": [
            "This is 100% Niantic's fault.  They can totally fix this.\n\nWe should put **#ShameNiantic** on the title of each and every one of these.",
            "I don't understand why people do this",
            "Niantic: we're sorry that happened to you :( please enjoy the elite raid day.",
            "How does this happen? Aren’t you guaranteed do when you hit best friends when they open the gift?",
            "I think some of these simply people do not know what happens",
            "I have 5 best friends i religously send gifts too been sending since 2017",
            "If you click the egg, I think you still get the XP? Even though it says 0",
            "Half a year is 182 days, I wouldn't say 90 days is almost 182.",
            "Tbh it's ridiculous this hasn't been fixed by niantic. It's complaint #1 from most players",
            "This happened to me last week, only it said \"TrainerName and you are best friends\" so I don't know if they got banned, or changed their name, or what"
        ]
    }
}