{
    "Weekly Pricing/Buying/Selling/Grading & General Questions Post": {
        "title": "Weekly Pricing/Buying/Selling/Grading & General Questions Post",
        "score": 4,
        "url": "https://www.reddit.com/r/PokemonTCG/comments/1dhkxkp/weekly_pricingbuyingsellinggrading_general/",
        "content": "Hello! This is this week's weekly pricing, buying, selling, grading, and general questions post. Here you can ask the community what your cards might be worth, if you should buy what you have your mind on, whether or not you should grade a card, etc. Be sure to post images where applicable.\n\nYou can also check out the [Pokemon Quick Info Guide](https://www.reddit.com/user/Lyleberr/comments/mughq3/pokemon_quick_info_guide/) made by u/Lyleberr.",
        "num_comments": 83,
        "comments": [
            "Hey! I'm new to card collecting and was just wondering what the best and ideal way to protect cards is. I don't really know what I'm doing so I just throw every new card to my collection into a penny and dragonsleeve. Should I get plastic toploaders for valuable cards? Is a binder a good idea?\n\nI care about protecting cards for display and collecting, I don't care about their future value. I just want them to be nice and pristine so they look good.",
            "Hello, I'm looking to buy a PSA10 Umbreon Vmax alt art from Ebay and was wondering, if anyone has experiece purchasing more expensive stuff there? Am I covered by money back guarantee in case i recieve a fake one? Somewhere I've read they authenticate the card before shipping, but can't find any more info on that. The seller has a 100% positive feedback, with 700 items sold. But I'm a bit sceptical cause the cert. number on the slab has been blacked out. This is the listing im reffering to. Any info is highly appreciated.",
            "General Question/ how do people deal with scammers? Do you call them out on being one, or ghost them? \nI put up an ISO post on FB, and a guy messaged me saying he had the card I was looking for. He sent a picture from an eBay listing… I asked for a timestamp and a couple hours later, he sent what looks like a slightly zoomed in photo of the same thing, with a photoshopped piece of paper with name/date. It literally has the same dust spots/background as the OG photo just slightly zoomed it and then slightly out of focus. He’s also asking Half the price of the eBay listing (big red flag).",
            "How \"valid\" or \"reputable\" is the grading service via Carmarket?\n\nI know PSA and the likes seems to be on top just due to being on the market for a log time and made themselves a name, but for me, living in the middle of Europe, a \"local\" grading service would be much better imo.",
            "Hi, is there any “must have” apps on the phone for collectors? For values, or to keep track of sets? I’m just getting back in and feel a little overwhelmed but jumping between tcgplayer and hand written lists haha",
            "Just found a bunch of my old cards from middle school, I'm 37 now and have no idea if they're worth anything.  I have a chansey, nidoking, clefairy, ninetails, machamp, poliwrath, hitmonchan, mewtwo, and gyrados.  Any advise on if they're worth getting graded or amhow about doing it?",
            "Newbie here. Any apps or website where I can track both ENG and JPN pokemon cards in my collections?\n\nThank you!",
            "What is a reasonable % for resellers to buy at? Pulled a SIR Perrin and never really sold cards before but idc about trainer cards. I have no idea how close to market I should be looking for.",
            "I’m looking into maybe selling some of my cards, is there a reliable site/source for me to check pricing?",
            "I just got a Twilight Masquerade box, and the signature Ogerpon card in it (the one that comes in its own packaging) was warped... what're the chances I can get it replaced, and how?"
        ]
    },
    "Self Promo Sunday": {
        "title": "Self Promo Sunday",
        "score": 5,
        "url": "https://www.reddit.com/r/PokemonTCG/comments/1dgv2va/self_promo_sunday/",
        "content": "Hello everyone! Welcome to Self Promo Sunday!\n\nHave a channel, video, social network, or anything else you'd like to post to promote your Pokemon TCG content? Feel free to post it here for the community to see.",
        "num_comments": 20,
        "comments": [
            "Hey everyone! Worked on a meta tier list for the current Pokemon meta! We're aiming to post edicational content on this site to help players grow!\n\nThe meta tier list will be updated as the meta develops! We're open to hearing any of your feedback!\n\n\nhttps://pokemontcgzone.com/pokemon-tcg-standard-meta-tier-list/",
            "Picked up the Mewtwo vs Charizard PSA, still continuing my challenge to fill up my PSA case. 😂\n\nhttps://youtu.be/IyBBq7IOsDU?si=7H11vGPH1LZKgoFU\n\nI make videos about my 20 year old collection 💕",
            "Lugia-tastic pull this week! Check it out in my new video: \n\nhttps://youtu.be/RP6IC5Sfu5M?si=pW9qFia7WDyjBY3D\n\nPlease like, subscribe, and let me know your favorite lugia card in the comments!",
            "If anyone’s curious what it’s like to witness an obsession in real time, you can check out my Vulpix stuff on Instagram!\n\nUsername is joelikesvulpix 👍🏻",
            "Keen on some Twilight Masquerade Booster Box Openings? Some big top 10 pulls from this video :)  \n[https://www.youtube.com/watch?v=WGiAxeziX6I](https://www.youtube.com/watch?v=WGiAxeziX6I)",
            "Want to see CARD PARTY 2? Check out this short I made meeting a bunch of creators! More card party content is on the way!\n\nhttps://youtube.com/shorts/0MFDcwoXG68?si=RmjVhcOjNX7hSjxb",
            "So I've been weighing packs lately just for data collection. Bonus dog. I also just do regular openings too. (I'm just a personal collector) [Weighing Twilight Masquerade](https://youtu.be/oheysxFeujk)",
            "We are PokiPair that have been creating content for just over 1 year :) We focus on English, Japanese and recently, Simplified Chinese Pokemon openings of all kinds. \n\nWe also do hunts, profit and loss and our most enjoyable - pure ripping of new products :D \n\nCome watch us open Pokemon in a lighthearted way: [https://www.youtube.com/@Poki-Pair](https://www.youtube.com/@Poki-Pair)\n\nOur most recent video: [https://www.youtube.com/watch?v=Te2edFajy3c](https://www.youtube.com/watch?v=Te2edFajy3c)\n\nHappy Monday Ya'll!",
            "[https://pokemon.cardsrealm.com/en-us/p/1585](https://pokemon.cardsrealm.com/en-us/p/1585)\n\n\n\nToday, we'll show you the top 10 strongest and most interesting Moltres in the history of Pokémon TCG, considering cards since the Wizards of the Coast era until today.\n\n\n\nMoltres is one of the three legendary Kanto birds, and, just like the other two, it first got a chance to shine in the Pokémon 2000 movie. It has been an iconic Pokémon ever since.\n\n\n\nNote: I won't include Moltres' Galar form in this list because there are only two Galar Moltres in Pokémon TCG: Galarian Moltres V CRE 97 and Galarian Moltres EVS 93.",
            "Just uploaded my first card show buyer POV video!  \n[https://www.youtube.com/watch?v=J4gu62UsfiA](https://www.youtube.com/watch?v=J4gu62UsfiA)"
        ]
    },
    "Finally complete 😴": {
        "title": "Finally complete 😴",
        "score": 283,
        "url": "https://i.redd.it/x4egdonoj18d1.jpeg",
        "content": "",
        "num_comments": 22,
        "comments": [
            "I love how you did the placement of the cards.",
            "what a awesome arrangement!! these are all such cool cards",
            "Beautiful but triggered because the Kanto evolution are in the reverse order, and Espeon is before Umbreon in Pokédex 😂",
            "This is fantastic! One of the best things I've seen on this subreddit, ever.",
            "This is such a flex",
            "Beautiful",
            "So freakin beautiful!!! 10/10 collection!!",
            "Looks good. The jolteon ones are my favorite, but I'm pretty biased lol",
            "That's kinda sick",
            "These are the most beautiful two pages I've ever seen. I'm trying to get the Galarian Gallery glaceon. It might be my favorite card ever. At least one of my favorites."
        ]
    },
    "Tried My Luck in Vegas Last Night": {
        "title": "Tried My Luck in Vegas Last Night",
        "score": 632,
        "url": "https://i.redd.it/7zhgauo95y7d1.jpeg",
        "content": "",
        "num_comments": 47,
        "comments": [
            "That is the most fitting prize card to be dispensed at a Vegas slot machine. So cool!",
            "Damn I was in Vegas last weekend and had no idea something like this existed",
            "Where in Vegas?",
            "Seems like op paid exactly what it’s going for according to price charting",
            "I wanna try this so bad lol",
            "What’s that??",
            "That's an awesome card. I always loved Meowth as a kid. Great first edition pull",
            "Meowth thats right",
            "Now I can get down with this type of gambling",
            "Can’t say I wouldn’t test my luck too"
        ]
    },
    "This is how stupid the english market is right now.": {
        "title": "This is how stupid the english market is right now.",
        "score": 697,
        "url": "https://www.reddit.com/gallery/1dl6hvi",
        "content": "$30 for this card in english, instead I got it for 4.50 in japanese and the quality looks so much better. ",
        "num_comments": 327,
        "comments": [
            "I picked up the entire clay burst ar set for less then $20 on eBay…my Japanese collection has been growing pretty rapidly lately",
            "There is a card shop near me that specializes in Japanese cards. I go there to get my singles and booster boxes when a new set comes out. The price difference is insane. Just looking to collect, not \"invest\"",
            "Its unfortunate. People are coordinating buyouts for cards to stoke FOMO and cause the prices to skyrocket as a result and its working. Its so obvious too because every price chart has a large spike around the same date",
            "Keep in mind that Japanese equivalents are easier to pull since each booster box comes with 3 ARs.",
            "Let’s use an example of an older card. Psa 10 gold star gyrados in Japanese goes for 2200$-2800$. The same card in English sells for 13,000$-17,000$. English is just more desireable. If you’re buying for art get Japanese, just don’t expect the same value later(excluding Japanese specific promos)",
            "It’s because Japanese art rares are seeded lol. It is much easier to pull art rares in Japanese than in English cause you’re guaranteed several per box. Japanese art rares won’t hold the same value as the English counterparts because of this. English is the way to go if you want art rares that will have a higher value ceiling. Japanese is the way if you just want the art for your collection without paying the premium.",
            "Why do you have to offend 90% of sub like that?",
            "I think a large part is the yen is doing so bad with japans economy. I only get japaneee cards now. I think when there economy recovers  the cards will also jump in price….i also think Japanese cards just look better.",
            "Prices have actually been coming down/correcting",
            "Yeah if I'm buying a full art, I'm buying it for the art. On japanese cards, the text is less blocky and covers significantly less of the art, as well as being cheaper and being of higher quality. I give 0 shits about my modern collection being worth money down the road, cause I only get 1 of each of the cards I like, and I'm never selling 🤷‍♂️\n\n\nI'm totally fine with the market the way it is, I snagged this card and the groudon for like $2 each a month ago and have enjoyed looking at them in my binder while I spend my big money on vintage :)"
        ]
    }
}