{
    "Weekly Questions and Discussion Megathread": {
        "title": "Weekly Questions and Discussion Megathread",
        "score": 5,
        "url": "https://www.reddit.com/r/PokemonScarletViolet/comments/1dp2711/weekly_questions_and_discussion_megathread/",
        "content": "# Welcome to our Scarlet & Violet Release Weekend Megathread!\n\n# Please use this thread to ask any game-related questions instead of creating individual submissions for them.\n\n**In addition to this, feel free to use the thread for casual game-related discussion!**\n\n\n\n___\n\n**THIS IS NOT A TRADE OR ONLINE ACTIVITY THREAD. Please use the appropriate Megathreads.**\n\n**For additional/live support, check out our Pokémon Scarlet Violet [Community Discord Server](https://discord.com/invite/pokemonscarletandviolet).**\n\n___\n\nAdditional relevant information and helpful resources can be found at the links below:\n\n**External Resources**\n\n* [Pokémon Scarlet Violet Official Website](https://scarletviolet.pokemon.com/en-us/)\n* [Serebii.net](https://Serebii.net)\n* [Interactive Map](https://www.gamerguides.com/pokemon-scarlet-and-violet/maps/paldea-region-map)\n* [Team Builder & Type Coverage Calculator](https://www.makio.it/pokemon/sv/team-builder)\n\n\n___\n\n*If you have policy questions for our moderators, please* [*contact us via modmail*](https://www.reddit.com/message/compose?to=/r/pokemonscarletviolet)*.*\n\n***Comments are automatically sorted by \"New\" to allow for better discovery and easier answering.***\n\n___",
        "num_comments": 22,
        "comments": [
            "Is there any way to rig the in game weather? Im shiny hunting and I want the poke to have the stormy mark. Ive been just sitting and waiting but its pretty monotonous and slow. Do I have to sit and wait or is there any way to make it rain?",
            "I solo'd the Sceptile raid with my Avalugg. Tera Ice, Brave Nature, Ice Body Ability, Hold Item: Covert Cloak, Moves: Avalanche, Curse, Snowscape, Recover.",
            "Is anyone else unable to play ranked battles? I keep getting a communication error",
            "Is anyone else having trouble finding an eevee outbreak? I tried for 2 hours and nothing Is there a trick to find one",
            "Just wonder if you can collect all the Pokmon just buying the one game or if I just buy violet will I miss many pokemon I'm new to the games sorry",
            "uuh anyone from scarlet wanna trade me a Tyranatar",
            "Yes that should work just fine for your save",
            "Some people have reported being able to just reset the game until getting the weather they wanted.",
            "make a normal encounter sandwich while you date skip, can be level 2, extra helps if you stand in the area the pokedex says is their habitat",
            "Eevee outbreaks are notorious for being very rare to get. You can help yourself by using an encounter Normal sandwich.\n\nAlso, you might want to try resetting in Medalli as Eevee outbreaks can spawn pretty much all around the town"
        ]
    },
    "Weekly Shiny Pokémon Megathread": {
        "title": "Weekly Shiny Pokémon Megathread",
        "score": 3,
        "url": "https://www.reddit.com/r/PokemonScarletViolet/comments/1dmpfau/weekly_shiny_pokémon_megathread/",
        "content": "# Welcome to our Scarlet and Violet Shiny Pokémon Megathread!\n\n# Please use this thread for sharing your shiny Pokémon instead of creating individual, standalone submissions for them.\n\n**THIS THREAD IS NOT FOR SHINY TRADING. Please use the dedicated Trading Megathread.**\n\n\n\n___\n\n**Note: Standalone shiny posts will now be removed on all days of the week except for \"Shiny Sunday's\". Please use this Megathread Monday - Saturday to help us keep the community clean!**\n\n___\n\n# Images can now be attached to comments for ease of sharing!\n\n___\n\n*If you have policy questions for our moderators, please* [*contact us via modmail*](https://www.reddit.com/message/compose?to=/r/pokemonscarletviolet)*.*\n\n***Comments are automatically sorted by \"New\" to allow for better discovery.***\n\n___",
        "num_comments": 1,
        "comments": [
            "Caught my first shiny after 300hrs of gameplay\n\nhttps://preview.redd.it/att2donecy8d1.jpeg?width=528&format=pjpg&auto=webp&s=73e954b9638909597f4d6a5043c3b586f105d659"
        ]
    },
    "Terastallizing Since ‘99": {
        "title": "Terastallizing Since ‘99",
        "score": 422,
        "url": "https://i.redd.it/whblkw1ief9d1.jpeg",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Would love a Pokmon stadium 3 or a new stadium game for switch",
            "gen 1 tera normal hyper beam would be too OP",
            "Without powering up my 64 is that a background object in the stadium pillar or the ass/front end of an attack animation?",
            "I forgot how bad Sword/Shield looked",
            "Biggie as Blastoise. Why am I just seeing this?   \n\"Throw ya hands in the aiiiar, if you a true spray-aa\"",
            "I forgot how low poly they were lmao",
            "Looks like this user's been waiting since the Pokmon Stadium days!",
            "Looks like this user's been waiting since the Pokmon Stadium days!",
            "Same here, man. Mini games were my favorite for Stadium games.",
            "Stadium 1 on N64 was such a wild experience: \n seeing my OG Gameboy Pokmon come alive was so cool!"
        ]
    },
    "Finally caught my favorite shiny in a beastball! ": {
        "title": "Finally caught my favorite shiny in a beastball! ",
        "score": 112,
        "url": "https://v.redd.it/ab0g1oaw4h9d1",
        "content": "I think this was my hardest shiny hunt I've done. Took me longer then shiny hunting Zoroark.",
        "num_comments": 25,
        "comments": [
            "Thats a very interesting choice for a favorite shiny",
            "And here I thought shiny weepinbell had blue lips.",
            "How did you get the Beast Ball? I thought it was USUM Exclusive?",
            "Awesome shiny and awesome choice for a ball! Could I get a breedject of that?! I have lots of normal Pokemon in beast balls that I could trade in return. I'm trying to make a living beast Ball Dex.",
            "what kind of mad lad sees there favorit shiny and be like ya gota use the worst ball posible to catch it",
            "I wish they were. Would of been easier to see.",
            "The item printer in the DLC in the clubroom. Once you hit the pokemon lotto on there you have a chance of getting one.",
            "Ya sure. The one I caught was a male and it says normally it gets the ball the female is in. But apparently there's a 50/50 chance of it getting the male or female if you use the same type instead of a ditto so I'll give it a shot real quick.",
            "My silly ass apparently lol",
            "Ya guess I'm a weirdo. But I love the Bellsprout shiny line."
        ]
    },
    "The real reason Geeta uses Glimmora as her final Pokemon.": {
        "title": "The real reason Geeta uses Glimmora as her final Pokemon.",
        "score": 343,
        "url": "https://www.reddit.com/r/PokemonScarletViolet/comments/1dqzfpy/the_real_reason_geeta_uses_glimmora_as_her_final/",
        "content": "While replaying Pokemon Violet again, I questioned myself for the 4th time why Geeta uses a setup mon as her ace. She’s supposed to be champion-rank! The top Champion! Why doesn’t she send Glimmora out first and Kingambit last? In popular reworks of her team, it is so much better when Glimmora is sent out first to set up Toxic Spikes, and Kingambit last because of Supreme Overlord.\n\nDigging deeper, story-wise, I figured out for myself while Geeta used Glimmora as her ace.\n\nAs you venture into Area Zero with your friends, you and Nemona battle a Glimmora, which Nemona tells you that Glimmora can only be found in Area Zero, and specifically says Geeta uses it. How did Geeta get a Glimmora? I knew it wouldn’t be as simple as she found a Glimmet and evolved it.\n\nWell, when Geeta terrastalizes (apology for the misspelling) her Glimmora into Tera-Rock, she says \"Be the light that guides all trainers, Glimmora.\" And that’s when it hit me. Tera-Rock is in the form of a Treasure Chest, the entire game’s premise is to seek out your treasure. Glimmora is the light that guides all trainers. Geeta’s Glimmora is the one that guides all trainers in seeking out their treasure. The real reason Glimmora is her ace is because it’s the one that guides all trainers. It makes more sense considering GameFreak intentionally had Tera-Rock be the final Tera Type shown to you across the game, because it’s literally the Treasure Chest trainers have been seeking out for. \n\nBut that’s not all, Glimmora IS Geeta’s treasure. Geeta’s first goal was to travel Area Zero, and when she couldn’t open the Gate, she found Glimmora. She found it symbolic that Glimmora is her guide in finding her treasure. So she decides to use Glimmora to help other trainers’ find theirs.\n\nWhile Geeta sending out Glimmora is bad competitively, story-wise, it makes more sense.\n\nTL;DR: Geeta uses Glimmora to guide trainers in seeking out their own treasure, Glimmora IS Geeta’s treasure.",
        "num_comments": 56,
        "comments": [
            "i always interpreted the rock tera crown as a parthenon tbh?? stylized to be smaller on the bottom, but still with the triangle roof and the pillars around the sides. doesn't look much like a treasure chest to me",
            "It's not like in previous games where the champion is fighting for their job. It's just a final exam to get a school rank.",
            "The rock tera crown looks like the Parthenon too me, man, not a treasure chest.",
            "Not to be that guy and i might be stupid, but cant you find glimmet in several caves outside of area zero?",
            "The issue isnt that Glimmora is her ace, thats just fine. The issue is the idea that she *must* save her ace for last even when its actively a worse move.",
            "Im sorry but where exactly do you see the treasure chest in the rock Tera lol",
            "Geeta isnt losing her job if you win which could be why she isnt being as tough on the player like previous champions. Also the fact that you have to fight Nemona almost directly afterwards.",
            "that is NOT a treasure chest",
            "This boy ain't right...\n\nI could quite perfectly remember the Rock Tera, but I knew it wasn't a chest, then others freshened me up- totally Greek Parthenon symbol.",
            "Get a load of this guy"
        ]
    }
}