{
    "[Weekly Questions Thread] 17 June 2024": {
        "title": "[Weekly Questions Thread] 17 June 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/pokemon/comments/1dhxh13/weekly_questions_thread_17_june_2024/",
        "content": "**Have any questions about Pokémon that you'd like answered?**\n\n##If they're about the value of a piece of merchandise you own or found, please ask them in the [Monthly Value Questions](https://rpkmn.center/weekly/value) thread!\n\nOtherwise, continue on!\n\n---\n\n###**Other Weekly/Monthly Threads**\n\n* **[Merch Megathread](https://rpkmn.center/weekly/merch)** - Want to show off a photo of your collection or a piece of Pokémon merchandise you recently bought? Head over to the Merchandise Monday thread, posted each Monday but open seven days a week!\n* **[Value Questions Thread](https://rpkmn.center/weekly/value)** - Have questions about a piece of merchandise you own or found? Or perhaps you're knowledgeable about Pokémon product values and wouldn't mind helping some people out? Check out the Value Questions Thread!\n* **[Code Giveaway Megathread](https://rpkmn.center/monthly/giveaway)** - Have some extra codes lying around and looking to share the wealth? Try posting them on the Code Giveaway Megathread!\n* **[Battle Request Thread](https://rpkmn.center/weekly/battles)** - Looking for trainers to battle? Try the Battle Request thread!\n* **[Hype Thread!](https://rpkmn.center/weekly/hype)** - Catch a new shiny? Finish your Living Dex? Head on over to the Hype Thread to share your joy! We even award special flairs for certain achievements!\n* **[RAGE THREAD!](https://rpkmn.center/weekly/rage)** - Game mechanic changes got you down? Did your plans to catch a shiny blow up in your face? Head over to the RAGE THREAD to vent a bit! CAPS LOCK ENCOURAGED!\n\n---\n\nIf you're asking or answering questions about the new games or recent anime episodes which contain spoilers, please be sure to include spoiler tags around them using the format:\n\n`>!Spoiler goes here.!<`\n\nText wrapped in `>!` and `!<` is hidden until the reader clicks or taps it. For example, the line above would become the following:\n\n>!Spoiler goes here.!<\n\nUnsure what is considered a spoiler? Please refer to [Rule 13](/r/pokemon/wiki/rules#wiki_13._flag_spoilers_appropriately) and our [Spoilers Guide](/r/pokemon/wiki/spoilers)!\n\nOtherwise, if you have non-value questions about the anime, the games, the manga, or *anything else* Pokémon related, feel free to ask here -- no matter how silly your questions might seem!\n\n**[/r/pokemon also has a Discord channel! Feel free to swing by there to ask a question, or just to talk! :D](https://discord.gg/pokemon)**\n\n*****\n\n**A few useful sources for reliable Pokémon-related information:**\n\n[Serebii](http://www.serebii.net/index2.shtml)\n\n[Bulbapedia](http://bulbapedia.bulbagarden.net/wiki/Main_Page)\n\n[Smogon](http://www.smogon.com/)\n\nAlso remember to check [the /r/pokemon FAQ](http://www.reddit.com/r/pokemon/wiki/faq) and our [related subreddits list](http://www.reddit.com/r/pokemon/wiki/related_subreddits).\n\n*****\n\n**If you want to answer questions posed by other members of the community, remember to sort the comments by new!** If you use RES, please also consider subscribing to this thread so you know when new questions are asked!",
        "num_comments": 215,
        "comments": [
            " I just finished master journeys and wanna rewatch x y and z but wanna skip out on all the fluff. Does anyone have a refined episode list for this series and maybe even the alola league that I could use? Thanks!",
            "Is the story latios in Omega ruby really able to be shiny? Not the eon ticket but the one you go to with Steven?",
            "Around 2016 I remember finding out that I could transfer Pokémon from an online site called PokEdits. Going onto it today, though seems to bring up some dork who I assume must've taken the domain name to sell people used 3DS and Nintendo products I remember using the site once or twice just to be able to make a cute little Pokémon and then I would be able to trade it to myself so I guess the best thing l'm looking for is something that is a Pokémon generator and saves to a .PKM file so I could put it in Shiny 2-1/2 and traded to myself. I'm sure if you look it up you can see they had a pretty nice interface that made it pretty easy for someone like me who doesn't really know that much about the inner workings of Pokémon (like IVs or EV's).\n\nDoes anyone know if there are any other sites like this or better yet if PokEdits is still up because l've tried looking at the wikiHow page that sends you straight to the page and I seem to always get the message saying that the site took too long to respond. I've even tried looking through some YouTube videos, a would get the same response when I tried click on their link to the site. Archive did not work either.\n\n(if this looks familiar because I posted this as a regular post and it got taken down and the moderators told me to post here)",
            "Playing Fire red\n\nI beat surge but now I have to go through rock tunnel but don't have flash apparently it's on route 2 how do I get back there",
            "Which subreddit of POKéMON would be good for feedback on a hypothetical type introduced into the games?\n\nOn a more directly related note, what is the easiest sandwich recipe to get the largest specimen of a pokémon in Scarlet/Violet?",
            "hello guys, I am new to pokemon games and currently playing HGSS, should I play the bug catcher event and pokeathlon right away or I can do it later after \"finishing\" rhe game? thank you",
            "Is Detective Pikachu 2 ever happening ?",
            "In Gen 5, if I send a pokemon with less than 25% health into battle, willit immediately consume a stat-raising berry?",
            "What’s the best scarlet/violet starter for a new player",
            "Did my flair reset or are they just super buggy on android?"
        ]
    },
    "I wonder.. what am I missing? Is it done?": {
        "title": "I wonder.. what am I missing? Is it done?",
        "score": 8757,
        "url": "https://www.reddit.com/gallery/1dl3rdy",
        "content": "Help me answer the biggest question that will haunt me all my life: is this done? Also, I included a picture of the improved Lucario. Your feedback really completed it in my opinion. Thank you!",
        "num_comments": 345,
        "comments": [
            "If I were to add anything, maybe a rank pin on the breast of the coat. Love this magikarp!",
            "Admiral Karp looks amazing!",
            "I think I prefer the older one with the ship interior, but this is still a fire Magikarp.",
            "Loving that Lucario portrait.  Great job",
            "Let me buy the karp",
            "I don't really have any input on what to add. I'm just here to give an upvote and to say this is fucking awesome man!",
            "How do we get you to be an artist for the TCG?  Need a petition or something?",
            "The only thing that is missing is this in my living room.",
            "This is amazing. Just remember as an artist you most likely will never see this as finished. I'm sure you could add some nice small details, but even as it is this is a piece of art fit for display.",
            "Cute gyarados pin on the jacket"
        ]
    },
    "(OC) PokeFusion - Togekiss and Chandelure ": {
        "title": "(OC) PokeFusion - Togekiss and Chandelure ",
        "score": 761,
        "url": "https://i.redd.it/wfyfgqea0y7d1.jpeg",
        "content": "",
        "num_comments": 27,
        "comments": [
            "Absolute banger, looks somewhat hollow-knight reminiscent",
            "Hollow Knight vibes",
            "I must catch this, I must catch it and rain flames and sparkles upon my enemies!!!",
            "Ooh, interesting design. Looks very nifty. :)",
            "Wooooow amazing !!!",
            "Beautiful! Kinda reminiscent of Frosmoth",
            "Chose the wrong background.... Hard to see the wings",
            "I love how ornate it is",
            "I don't think it's possible to fuse any pokemon with Chandelure and it *not* look cool. Gardevoir as well.",
            "it’s soo pretty great job"
        ]
    },
    "Did I make a mistake": {
        "title": "Did I make a mistake",
        "score": 2905,
        "url": "https://i.redd.it/lszxax7gfv7d1.jpeg",
        "content": "This tattoo is on my thigh, about 2-3 years old now.",
        "num_comments": 140,
        "comments": [
            "Line work isn't very clean or solid. If you paid, you made a mistake.\n\nHowever. It's both adorable and fixable. Not worth being embarrassed about.",
            "The design is great but it feels like it was made during a party when everyone was drunk. The line work is horrendous while being the main point of the tattoo :/\n\nFrom far away it look cool and goofy thought, I kinda like it",
            "No mistake unless you didnt mean to get a rowlet with tiddies",
            "Could easily get it touched up by a different artist",
            "Do you still like it? If so, no. Do you regret it? Then yes",
            "It looks like it has nipples.",
            "with your choice of artist? yeah probably. with the concept itself? god no.",
            "https://preview.redd.it/02g9n4xcmx7d1.jpeg?width=4032&format=pjpg&auto=webp&s=f79ad7f065d6de3923bfd37d721857c10c829466",
            "Kinda looks like me taking my bra off after work",
            "It's a hooter with hooters. I think it's hilarious, personally. Almost looks like one of its parents was a snorlax."
        ]
    },
    "Fuecoco 🌶️": {
        "title": "Fuecoco 🌶️",
        "score": 1551,
        "url": "https://i.redd.it/2i7ex1bucw7d1.jpeg",
        "content": "",
        "num_comments": 40,
        "comments": [
            "682, is that you?",
            "Yoooooo! This is so cool OP!! Awesome art :)",
            "Yooooo crocomire!",
            "Fuecoco is a Microsoft product?",
            "I just realized it was a skull on top. So that's why he is dead later on.",
            "More art on my  [Instagram](http://www.instagram.com/paul.thureau)",
            "looks like he could be a boss in metroid",
            "I can't unsee a Microsoft logo in it's stomach",
            "I like how its upper jaw is a skull",
            "thought it was ai for a sec then i checked the comments and saw proof that it wasnt awesome work!"
        ]
    }
}