{
    "I f'ing hate Wikipedia": {
        "title": "I f'ing hate Wikipedia",
        "score": 911,
        "url": "https://i.redd.it/10mffir0z18d1.jpeg",
        "content": "",
        "num_comments": 324,
        "comments": [
            "Im pretty sure \"cultural marxism conspiracy theory\" was originally called just \"cultural marxism\"",
            "Funnily enough, many of the more fringe left-wing—genuine communists and Marxists, not current-thing-supporters or slick establishment liberals—*hate* Wikipedia because it's perceived as having a neoliberal, pro-Western homogeneity slant. Wikipedia is good for things that are objectively true: e.g., mathematics, astronomy, and physics; iffy on history and culture; and should be avoided for any contemporary, controversial political subject.",
            "Wikipedia is so cooked with agenda edits that we might actually have to fall back with physical encyclopedia.",
            "If you ever want to see the reason why I will piss on the burning corpse of Wikipedia then take a tumble down the rabbit hole known as Ryulong and his mouth foaming obsession with the Gamergate page.",
            "Most of wikipedia moderators are marxist so obviously politically charged articles will be from marxist perspective. They also tend to use secoundary sources as opposed to primary sources if the secoundary source cones from a mainstream publications. Eich you know most of them are leftist",
            "After seeing the clusterfuck that is rationalwiki, I cannot be too mad at Wikipedia tbh (yeah I know bigger reach and credibility but still)",
            "Sorry but isn't Frankfurt school identified itself as cultural Marxist? Even though it's distinguished from Soviet style communist. \n\nAdd: Sorry I didn't know the word is stigmatization, now I know it. I just felt if they're Marxists who focus on culture study... then they should self identified as cultural Marxist?",
            "You don't hate wikipedia enough.",
            "Bro where does Wikipedia say that pro capitalism stances make you a nazi? Likewise for classical liberalism somehow being alt right?",
            "I'm sorry but what the fuck is anger-inducing about this, exactly? These are accurate descriptions of these positions and belief? They also have literally nothing to do with what the wojak is saying?\n\nThis is a dumb fucking post and you should probably feel bad for having made it. The page for classical liberalism doesn't call you a fucking fascist nazi, so I genuinely have ***no*** idea why you're drawing these connections to yourself, unless you're actually an alt-right far-right person who believes in cultural marxism.\n\nThe post is truly breaking my brain. I'm starting to think most of you are literally just NPCs who go around finding anything to be angry at.\n\nJust indulge in some reading comprehension. Lord thunderin’.\n\nhttps://preview.redd.it/oji1k3zqu28d1.png?width=971&format=png&auto=webp&s=6765258b92f9fa4aa48a47404cbdc924a55bacd7"
        ]
    },
    "How an **actual** liberal uses wikipedia": {
        "title": "How an **actual** liberal uses wikipedia",
        "score": 276,
        "url": "https://i.redd.it/cvrls2eve38d1.png",
        "content": "",
        "num_comments": 60,
        "comments": [
            "https://preview.redd.it/5o61277eh38d1.jpeg?width=1024&format=pjpg&auto=webp&s=af7727a2ba6d121e66c8175fff28398d70c5951a",
            "\"I get my political stance from Wikipedia\"\n\nSad how this describes way too many people who are into politics, atleast online.\n\nWikipedia does have problems, the guy you responded to made a partially dumb post but it's fact that you shouldn't take it as a neutral arbiter of truth.\n\nIt's written by mostly normal people and some chronically online supereditors, so bias, especially in modern political articles or niche stuff, is guaranteed. The sources considered reliable and thus usable as citations are restricted aswell.",
            "I wish more people would understand that Emily is basically the opposite of a liberal",
            "The rightoid who is already yellow-blue needs Wikipedia to explain capitalism and liberalism?",
            "Wikipedia definitely have problems, this bit are from that other post:\n\n>\"cultural marxism conspiracy theory\" was originally called just \"cultural marxism\"\n\n>[Link to original Wikipedia article](https://web.archive.org/web/20140102001635/https://en.wikipedia.org/wiki/Cultural_Marxism)",
            "I remember being a broke college student and thinking that I would donate to wikipedia as soon as I got some disposable income. The gamergate debacle was the first eye-opener and I'm proud to say they never got a single cent off me. It's a website for cultural marxists, let them fund it.",
            "Wikipedia is bullshit describing one of the most historically accurate [books](https://en.m.wikipedia.org/wiki/Historia_de_omnibus_Gothorum_Sueonumque_regibus) of all time as pseudo-scientific.",
            "I would call you based for making this post but there's nothing more cucked than donating to Wikipedia.",
            "Made in direct opposition to this [dumb cunt](https://www.reddit.com/r/PoliticalCompassMemes/comments/1dlnnvr/i_fing_hate_wikipedia/). What a fucking clown.",
            "They could literally run forever off of their bankroll"
        ]
    },
    "I hope leftists will soon realise what will happen if Muslims become a majority in the west": {
        "title": "I hope leftists will soon realise what will happen if Muslims become a majority in the west",
        "score": 1958,
        "url": "https://i.redd.it/uvf6adyhdz7d1.jpeg",
        "content": "Perhaps those borders that you hate so much have already saved your life without you knowing",
        "num_comments": 370,
        "comments": [
            "If wanting my country to not become a jihadist hellhole is Islamophobic, then I’m the world’s biggest islamophobe.",
            "i am not islamophobic!\n\na phobia means an irrational fear! look at every country that religion has parasitically taken over, its not irrational!",
            "i remember seeing a post on X where women were shown pictures of a hamas member and a MAGA guy. they were asked who they thought would be more homophobic. those npcs said the MAGA guy. “brown man good white man bad” is their motto. leftist women will not accept reality. their goal is not “women’s rights” but the destruction of white males.",
            "Problem is Leftists anti westernism completely blinds them to everything and centre left liberals are more and more devoured by them and political liberal centre will shrink more and more......",
            "PaLeStInE hAs No LaWs aGaInSt bEiNg GaY- IsN'TrEaL dOeS!\n\n*\\~quote, someone who doesn't understand that (1) Palestinians did not remove their Anti-gay laws in the 1950s when they were under Jordanian annexation, and have not re-introduced them simply because the government does not care whether gays are committing a crime when they are already being beaten to death by their neighbors. nor that (2) it is 100% legal to be gay in Israel, with the only thing preventing gay marriage- being that the only marriage one can have in Israel is religious by nature, with marriage outside Israel being 100% recognized.*",
            "Authright is having a civil war between those who hate foreigners more than liberal ideology and those who hate liberal ideology more than foreigners.",
            "my views are kinda like this, in that if i could be a libertarian i would, but i realised that in order to actually MAINTAIN said levels of freedom, we need to secure our borders, demographics, and culture",
            "It's all tongue in cheek meme material thinking about how Emily is going to get her karmic due... but it should terrify everyone thinking it ACTUALLY happen here, and sharia becomes quasi-enforced domestically.\n\nAlphabet people will literally be liveleaked by snackbars in the bluest of blue strongholds, and it's sickening to think about even though the irony is palpable as fuck",
            "If you are for gay rights, you can NOT be for Islam. Choose one or the other. I would support any measure meant to protect my rights, human rights be damned either way",
            "Just remember that a president of Egypt got murded by a guy that thought television is haram"
        ]
    },
    "Can women have anything to themselves? ": {
        "title": "Can women have anything to themselves? ",
        "score": 1464,
        "url": "https://i.redd.it/s9kt8fnv5z7d1.jpeg",
        "content": "",
        "num_comments": 381,
        "comments": [
            "Just goes to show, men are better than women at everything. Including being women.\n\n(This was a joke no banboozle)",
            "It takes a real man to be a woman",
            "Men are so much the superior sex that they're even superior to biological women at being women.",
            "Good, these \"miss\" competitions are a disgrace and should die as soon as possible.",
            "As if beauty pageants are something women desperately need at all…",
            "I'm not gonna start caring about pageants now",
            "Womyn getting hard diffed since the beginning of time",
            "I'm all for Equality and Shit\n\nNot because i believe in it, but because it makes Women more miserable than Men in the long Run",
            "\"anything you can do I can do better\"",
            "Woman are more likely to support Trans stuff then men\n\nThey're probably the ones inviting this stuff to their events"
        ]
    },
    "We all have that one person we prefer to keep at an arms length away from": {
        "title": "We all have that one person we prefer to keep at an arms length away from",
        "score": 38,
        "url": "https://i.redd.it/o5y6kkwad48d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "libright-libleft unityposting",
            "Based and we hate Emily pilled",
            "Fr",
            "It's not necessarily a \"team\" thing as opposed to there will always be bad people who share your political views, which is one of the reasons I'm a centrist. It's the reason why we have tankie Auth-Lefts and unironically fascist Auth-Centers. In an odd way, I kind of appreciate these groups to an extent because they can provide flavor to an otherwise bland discussion and they also show an example to not be like them.",
            "u/Ok_Freedom1529's Based Count has increased by 1. Their Based Count is now 40.\n\nRank: Sumo Wrestler\n\nPills: [10 | View pills](https://basedcount.com/u/Ok_Freedom1529/)\n\nCompass: This user does not have a compass on record. Add compass to profile by replying with /mycompass politicalcompass.org url or sapplyvalues.github.io url.\n\n\n\nI am a bot. Reply /info for more info."
        ]
    }
}