{
    "Reminder: Register to Vote!": {
        "title": "Reminder: Register to Vote!",
        "score": 276,
        "url": "https://www.reddit.com/r/PoliticalHumor/comments/19avcx6/reminder_register_to_vote/",
        "content": "Voting is the only way YOU can enact meaningful change in this country. Many states are going to be holding primary elections in the coming months for the Republican Presidential primaries. Even if you aren't a registered Republican who can vote in their primaries, you may have other offices or measures on the ballot that **you should vote on.** \n\nIn some states, ballot measures are attached to the same primary ballot that is used determine who your party's nominee will be for a myriad of offices. \n\nWhether you just turned 18 and want to register or aren't sure if you're still registered from last time, take this opportunity to check your voter registration now. \n\n# REGISTER HERE: https://vote.gov\n\nCurious when your state is voting for the primaries? Check here: https://www.usvotefoundation.org/primary-election-dates",
        "num_comments": 7,
        "comments": [
            "I heard people who vote get lots of pussy.",
            "A crash will occur if the wannabe dictator gets in office.  If you look in history anytime a country gets a dictatorship the market corrects to the benefit of the dictator and friends as a money grab happens.  Think you are safe.  Anyone speaking up gets planted in a mass grave.  All I have to say this election coming up maybe the most important event in your lifetime. So think long and hard.",
            "In Wisconsin, register to vote, check your registration, request absentee ballots, find you ward, district and polling place at www.myvote.wi.gov.",
            "Please get out and let your voice be heard! :)",
            "Voting cured my brain fog"
        ]
    },
    "Maybe they were worried Trump would mispronounce the countries name ": {
        "title": "Maybe they were worried Trump would mispronounce the countries name ",
        "score": 19029,
        "url": "https://i.redd.it/yi4uevc2h08d1.jpeg",
        "content": "",
        "num_comments": 474,
        "comments": [
            "Well hold on, that's not fair.\n\nTrump told the widow of one of the soldiers that her dead husband knew what he signed up for.",
            "Hell, I remember that as the moment that they shut up about Benghazi. Almost as if they just wanted to blame someone for it, and were suddenly worried that Trump might receive the same volume and intensity for that, as they inflicted on Hillary. Almost as if Benghazi was just another prop for them, that outlived it's usefulness...",
            "His supporters are mad that they're not allowed to mispronounce it",
            "The same folks wouldn't STFU about Benghazi as well",
            "If there isn't some way to blame the Democrats, it didn't happen.",
            "It was Trump's Benghazi moment, and Democrats failed to make noise about it.\n\nJust as they never opened an investigation into the highly illegal Soleimani assassination, one of Trump's attempts to provoke Iran into war.",
            "Isn't this the episode that had been planned before Trump came in to office, and he approved it, and when it went south he said \"It wasn't my fault, it was the military's?\"\n\nYou're the commander in chief, the buck stops with you. That's what you volunteered for.",
            "Was this the raid that Obama had called off because it was deemed too dangerous, but Trump thought it was fine and went for it, or was that another event?",
            "I like how everyone just accepts US soldiers in a foreign country as normal. Could you imagine Nigerian soldiers in Texas and then them being outraged that they were killed?",
            "Why would he do shit about it? Trump considers those that give their lives in support of their country to be suckers and losers! [https://www.theatlantic.com/politics/archive/2020/09/trump-americans-who-died-at-war-are-losers-and-suckers/615997/](https://www.theatlantic.com/politics/archive/2020/09/trump-americans-who-died-at-war-are-losers-and-suckers/615997/)"
        ]
    },
    "The old adage, “Those who ignore history are doomed to repeat it,” is pertinent here.": {
        "title": "The old adage, “Those who ignore history are doomed to repeat it,” is pertinent here.",
        "score": 203,
        "url": "https://i.redd.it/kylp6fjuy38d1.png",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Want this as stickers.",
            "The term I've been using when people say they want to just ignore all the bad news is:\n\n**\"Silence only helps the oppressor\"**",
            "They didn't ignore it, they jumped head first into nazism.",
            "And that's why Putin is trying to Denazify Ukraine!",
            "This. We cannot ignore the genocide. We cannot vote for genocide.",
            "Some of them did.  The people who opposed it didn’t take it as seriously as they should have.",
            "Right? I hate when people talk about \"history\" like any of these inbred hillbillies can read let alone understand the implications. Instead they just follow the loudest semi charismatic authoritarian they can find. \n\nIt's like when people say \"history won't be kind to....\" or \"I'm on the right side of history\" like anyone is actually going to look back, see the situation and make an informed decision as opposed to do the thing they wanted to do originally.",
            "How's the night shift in Moscow?",
            "We need to send the Nazis packing back to their communal basements here in the states. It’s gonna be troublesome because not only do the American Nazis have a hard on for Trump but HE won’t stop touching that hard on. And we’re all “gross, you’re jerking off Nazis!” But he won’t stop.",
            "You dropped this: /s"
        ]
    },
    "Fox News has some \"fair and balanced\" questions it thinks CNN should use in the Presidential debate": {
        "title": "Fox News has some \"fair and balanced\" questions it thinks CNN should use in the Presidential debate",
        "score": 1048,
        "url": "https://i.redd.it/ldwmv1i1718d1.jpeg",
        "content": "",
        "num_comments": 32,
        "comments": [
            "\"That's a great question and I have an answer for it and I'll bet sleepy Joe over there doesn't want you to hear it. Sleepy Joe, folks! He and the liberal media and the deep state want to declare war on the indoors. They say air conditioning is killing the fish. You know the fish, folks, those wonderful fish. I was just talking to a fisherman in Wisconsin the other day, beautiful man, tremendous fisherman he said 'Sir!' He had tears in his eyes you see and he said 'Sir! They're trying to shut me down. They're trying to shut me down because they say if I keep fishing, there won't be any fish left.' Can you believe that folks? Unbelievable. Never forget that the deep state wants to take away your freedom. They want to take your fish, and those beautiful birds they kill with their windmills - you know the ones, they make that horrible sound - and they want to take your air conditioning and your showers - you know how they just drip drip drip they don't want you to be able to wash that soap off your bodies because it might hurt the fish.\"",
            "Biden: *gives an actual answer*\n\nTrump: uhhhh ermmmm uh hamberde covfefe?",
            "![gif](giphy|79KqclLnd9wDC)",
            "Have I told you about the greatest question I ever asked? What do you do if your boat is sinking around sharks? Do you die to electrocution or th sharks? No one has ever asked this.",
            "That's about right. But it doesn't matter what trump really says as all answers are right.",
            "Trumps answer would still take more time and not make any sense at all.",
            "[“Nobody knows more than Donald Trump”— Donald Trump](https://www.youtube.com/watch?v=sR3f95BGIiA)",
            "Sir, looking at these pictures can you identify the whale, shark, and boat with electricity?",
            "They should get some British journalists to ask the questions.  They really really really don't put up with bullshit.",
            "For President Biden: \"Sir, what is your position on a hypothetical war with Iran and the wider implications for the Middle East, with a particular focus on the impact this war would have on the Mazanderani People, you have 7 seconds to respond\"\n\n\nFor President Trump: \" Sir, What is 3+6? You have 15 minutes to answer\""
        ]
    },
    "I was not expecting this": {
        "title": "I was not expecting this",
        "score": 978,
        "url": "https://i.redd.it/6c7tqguyx08d1.jpeg",
        "content": "",
        "num_comments": 20,
        "comments": [
            "Yeah… clay tablets aren’t gonna last long…",
            "More mass shootings than days so far this year. Glad to see politicians taking action on important issues.",
            "Unfortunately it wont' be helpful because they'll be posters. Maybe kevlar posters...LOL",
            "This truly sums up the Republican \"Christian's\" understanding of the Bible and how to practice it! Worship the God of the Bible, or Trump? You can't do both.",
            "Spot fucking on.",
            "That’s a strong point to consider.",
            "I hate this. It's true and it's brilliant. And I hate that I live in the timeline in which it was made.",
            "Exodus 32:19 - *And it came to pass, as soon as he came nigh unto the camp, that he saw the calf, and the dancing: and Moses' anger waxed hot, and he cast the tables out of his hands, and brake them beneath the mount.*",
            "This is just a sad state in this country.",
            "Both God and GOP work in mysterious ways"
        ]
    }
}