{
    "Reminder: Register to Vote!": {
        "title": "Reminder: Register to Vote!",
        "score": 286,
        "url": "https://www.reddit.com/r/PoliticalHumor/comments/19avcx6/reminder_register_to_vote/",
        "content": "Voting is the only way YOU can enact meaningful change in this country. Many states are going to be holding primary elections in the coming months for the Republican Presidential primaries. Even if you aren't a registered Republican who can vote in their primaries, you may have other offices or measures on the ballot that **you should vote on.** \n\nIn some states, ballot measures are attached to the same primary ballot that is used determine who your party's nominee will be for a myriad of offices. \n\nWhether you just turned 18 and want to register or aren't sure if you're still registered from last time, take this opportunity to check your voter registration now. \n\n# REGISTER HERE: https://vote.gov\n\nCurious when your state is voting for the primaries? Check here: https://www.usvotefoundation.org/primary-election-dates",
        "num_comments": 7,
        "comments": [
            "I heard people who vote get lots of pussy.",
            "In Wisconsin, register to vote, check your registration, request absentee ballots, find you ward, district and polling place at www.myvote.wi.gov.",
            "A crash will occur if the wannabe dictator gets in office.  If you look in history anytime a country gets a dictatorship the market corrects to the benefit of the dictator and friends as a money grab happens.  Think you are safe.  Anyone speaking up gets planted in a mass grave.  All I have to say this election coming up maybe the most important event in your lifetime. So think long and hard.",
            "Please get out and let your voice be heard! :)",
            "Voting cured my brain fog"
        ]
    },
    "Is anyone really going to change their vote because The President had a sore throat and Trump is a fast liar?": {
        "title": "Is anyone really going to change their vote because The President had a sore throat and Trump is a fast liar?",
        "score": 3800,
        "url": "https://i.redd.it/w8t5fwdfde9d1.jpeg",
        "content": "",
        "num_comments": 633,
        "comments": [
            "I find the ease with Trump's lying alarming. His playing fast and loose with facts demonstrates that there is no there there. A vacuous moron.",
            "Trump hasn't changed in 4 years..He's still a thief, con-man and liar. He will still take every dime of taxpayer money he can find and stick it in his own pockets, again.\n\nSimply knowing that Biden doesn't do that is all I need to know. He could be rolling around in a wheel chair with another oxygen tank and still be the better man.",
            "AFTER BIRTH ABORTIONS - DJT june 27 2024 ",
            "Getting 2016 flashbacks of “we got this in the bag” democrats",
            "     Any Democrat running for the presidential election will have my vote! \n\n     ⚠️ NO PROJECT 2025- fuck that shit!",
            "I am not changing my vote but lets not be dumb and say \"sore throat\"",
            "If you were a Biden voter before, you're still a Biden voter (including me). If you're a Trump voter before, you're still a Trump voter. But that tiny sliver of persuadable, mostly \"non-political\" types that only tune in for major events like these after four years saw Biden do a lot worse than a \"sore throat\". His rally earlier today was fine, but notably - it was MUCH earlier in the day and it was a largely scripted event. But last night? Last night he looked sort of frail, and worse, sort of helpless. And that's not gonna' fly with a LOT of voters who view the Presidency as, first and foremost, the Commander in Chief.",
            "No one who's been paying attention. Biden's speech today was pretty good, too.",
            "No one will change their vote, but lots of people might decide to stay home instead.",
            "Grandpa Joe way better then lying trump"
        ]
    },
    "Where was that energy at the debate?": {
        "title": "Where was that energy at the debate?",
        "score": 3340,
        "url": "https://i.redd.it/q84i0cxn5e9d1.jpeg",
        "content": "",
        "num_comments": 293,
        "comments": [
            "The debate was at 9 pm.  My 72 year old father passes out hard at 6 pm and wakes up spicy and energetic at 4am. ",
            "Well, Biden was up since 4AM being a president and Trump was up since 4PM tweeting shit. Of course they didn't have the same energy.",
            "His speech today didn’t start at 830 at night lol.",
            "It's hard to breathe and plan your thoughts when you have to swim through the  liquid pig shit that was 45's diatribes.",
            "That wasn't Sleepy Joe, that was Deep REM Joe.\n\nSomebody should've called a septic pump truck because Trump was clearly brimming with bullshit. Awake as fuck and making every stereotypical Trump face, from indignant fucking prick to snide fucking asshole, he showcased all the talents of a mommy's boy born on the backseat of a yacht anchored in a tax haven for cocksuckers that don't wanna pay taxes for leeching societies of their resources that is slowly losing a battle with syphilis brain.",
            "He does much better with a live audience",
            "I said this in another thread - Obviously I am still voting for him and am still behind him fully, guess I just hoped we’ll see another state of the union Joe, so that we can now comfortably snag some of the magically and inexplicably undecided voters and hopefully sway some of the on the fence trumpets who finally got to see a real unedited by fox and co version of who he is. But none of that will happen for now and this was the only chance where millions of Americans from both sides would see him as dark Brandon capable of dealing out the facts and handling shitty fasciscts without falling asleep mid sentence.  Maybe on the second debate, we can hope.",
            "All this dark Brandon nonsense isn't gonna undo what happened last night. \n\nThese two are known quantities. The election is going to get decided by a small group of yahoos that have been getting a steady dose of \"biden's too old\" in their newsfeed for months and now they're watching clips of Biden stuttering thru the debate on TikTok all day.",
            "My conspiracy theory that I do not actually believe is that he intentionally threw the debate to scare people into realizing that Trump could actually win.",
            "He probably learned a lesson and didn't take any cold medicine today. That stuff will knock you out even some of the day time stuff."
        ]
    },
    "Truth 💯": {
        "title": "Truth 💯",
        "score": 746,
        "url": "https://i.redd.it/hhoc828ojg9d1.jpeg",
        "content": "",
        "num_comments": 31,
        "comments": [
            "The election won't determine who waxes the Batmobile or makes Mr Wayne's tea.",
            "If Alfred can't debate the Joker cause he's lost his edge, maybe undecided and unmotivated voters won't bother voting and Alfred will lose. Maybe you let Alfred retire, and replace him with someone more competent.",
            "Why is Biden Alfred?  Biden is supposed to be an aging Batman who will be replaced by Robin...",
            "…especially when the Joker is only two years younger and is showing clear signs of frontotemporal dementia!",
            "Exactly, you hire a new butler that has normal cognitive abilities, and what a moronic quote.  This essentially proves Biden will lose in November!",
            "The right is going to cancel Batman now because of this statements. It’s too woke.",
            "And if Alfred is too old to run the Batcave, maybe look at hiring someone younger so you don't end up with the Joker.",
            "Wow some people are really good in fitting comparisons",
            "The fact someone made this is just evidence of how fucked up everything is. You cant watch that debate and feel great about the next 4 years",
            "also the Joker pays his taxes"
        ]
    },
    "Plus I always had a fetish for black uniforms": {
        "title": "Plus I always had a fetish for black uniforms",
        "score": 2495,
        "url": "https://i.redd.it/30k639zksd9d1.jpeg",
        "content": "",
        "num_comments": 111,
        "comments": [
            "This is more than a stuttering problem. Biden is showing his 81 years and is physically diminishing. He is a good leader and can function in his job very well. Comparing the two candidates should be an easy win for Biden. Too many people don't pay attention beyond a few clips on social media, if that. I used to be like that. Thought all politicians were the same. All dishonest and working for themselves. Trump woke me up. I guess I can thank him for that much.",
            "I feel that framing that as stuttering isn't honest nor helpful.",
            "Remember, this election is so important because if Trump wins you will literally be tied up and used breeding stock.\n\nThat's why we put the octogenarian roomba on the ticket.",
            "We have a huge potential to lose if we keep Joe. Who watched that debate and can honestly say that gave them \"the idea\" that he was fit??",
            "If defeating Trump is so important, why are the DNC running Biden again? Why isn't he doing what he can through executive action to stop the worst parts of Project 2025? Liberals on reddit love to cite it as this boogeyman, but we know what they want to do, so why can't we do something preemptive in case Trump wins? \n\nIt just boggles my mind that P2025 is such a scary thing but is never mentioned by opposing politicians and there's been nothing but ridicule for people saying we need a better option than Biden.",
            "Anyone trying to hand wave away that debate performance -- and I am seeing a lot of hand waving -- IS WRONG. We know what we saw -- Biden looked old as hell -- and trying to tell us we didn't see it is kind of messed up. We can still confront and solve this problem. Biden must drop out. I do not want to say I told you so in November.",
            "You “he had a sore throat and stuttered” people are just as fucking bonkers as the maga church Karen’s proudly saying they’ll still vote for a sex predator. That was an hour of a dude clearly in the throws of dementia. Pretending otherwise is truly unhinged. Fuck Trump, but Biden is gonzo.",
            "How about this: DNC gets a competent middle of the road non-senile seeming Democratic candidate... and *everyone* votes for that person. Not sure how many more signals are needed that Biden ain't it.",
            "you're starting to act like the MAGA people",
            "All this desperation is ridiculous. It’s too fucking late to switch things out for this round, take the ride, bitches, you bought the goddamn ticket."
        ]
    }
}