{
    "Nabór na moderatorów /r/Polska": {
        "title": "Nabór na moderatorów /r/Polska",
        "score": 25,
        "url": "https://www.reddit.com/r/Polska/comments/14pbk8n/nabór_na_moderatorów_rpolska/",
        "content": "Cześć,\n\nr/Polska rośnie. Niedawno przekroczyliśmy próg 500k użytkowników. Wraz ze zwiększoną liczbą aktywnych członków /r/Polska potrzebuje także zwiększonej liczby aktywnych moderatorów.\n\n# Czym się zajmują moderatorzy?\n\nW 90% jest to egzekwowanie regulaminu poprzez zatwierdzanie lub usuwanie treści zgłaszanych przez użytkowników. Gdy już to wszystko jest nadrobione, można zajmować się ulepszaniem naszej społeczności - inicjatywami typu wymiany kulturowe, AMA lub owocowe czwartki.\n\n# Kto powinień zostać moderatorem?\n\nModeratorem powinna zostać osoba, która:\n\n* umie pracować w zespole i uszanować decyzję tego zespołu, nawet jeśli jest ona odmienna od jego/jej własnej,\n\n* spędza dużo czasu na /r/Polska i będzie aktywnie go moderowała,\n\n* zna regulamin /r/Polska ([link](https://www.reddit.com/r/Polska/wiki/rules/)).\n\nJeśli nigdy nie moderowałeś/aś lecz jesteś pewny/a swojej aktywności - śmiało zgłaszaj się. Obecni moderatorzy bez problemu nauczą Cię z czym to się je.\n\n# Jeżeli chcesz aplikować, proszę wypełnij i wyślij na naszą [pocztę moderatorską](https://www.reddit.com/message/compose?to=%2Fr%2FPolska&subject=&message=):\n\n* Ile czasu w tygodniu możesz poświęcić na moderowanie /r/Polska:\n* Czy masz doświadczenie w moderowaniu? Jeśli tak, to na jakich subredditach?\n* Ciekawe pomysły jakie masz na ulepszenie /r/Polska, które mógłbyś/mogłabyś wprowadzić w życie:\n* Pozostałe rzeczy o jakich chcesz wspomnieć:",
        "num_comments": 68,
        "comments": [
            "Trzeba przechodzi test na lewaka?",
            "Umowa zlecenie czy o dzieo?",
            "A co sie stalo z naborem sprzed 2 miesiec? Ktos doszedl?",
            "Czemu kto miay to sobie robi i to za darmo!\n\na nie ok. s owocowe czwartki",
            "A jest Multisport? A nie przecie reddit",
            "i want to make peace between denmark and poland",
            "Potrzebuje sprzty mmmm\nDobra jako na dobr ilo",
            "Nie wiem czy moje zgoszenie z modmaila zagino, czy jest odrzucone, ale jako e nie dostaem adnej odpowiedzi, to na wszelki wypadek zgaszam si te tutaj. Chtnie pomog \"doranie\" przy usuwaniu postw amicych zasady, usuwaniu spamu itp, najobiektywniej jak si da. Prawie codziennie jestem z godzink czy dwie na Reddicie.",
            "Mam pytanie do modw i do kandydatw: po co?",
            "ok ile mona zarobi za swj czas?"
        ]
    },
    "Dobrý deň! Cultural exchange with Slovakia (/r/Slovakia)!": {
        "title": "Dobrý deň! Cultural exchange with Slovakia (/r/Slovakia)!",
        "score": 23,
        "url": "https://www.reddit.com/r/Polska/comments/1dqnk1w/dobrý_deň_cultural_exchange_with_slovakia/",
        "content": "Welcome to the cultural exchange between /r/Polska and /r/Slovakia! The purpose of this event is to allow people from two different national communities to get and share knowledge about their respective cultures, daily life, history and curiosities. General guidelines:\n\n* Slovaks ask their questions about Poland here in this thread on /r/Polska;\n\n* Poles ask their questions about Slovakia in the parallel [thread](https://www.reddit.com/r/Slovakia/comments/1dqn5r6/dzie%C5%84_dobry_kult%C3%BArna_v%C3%BDmena_s_po%C4%BEskom/);\n\n* English language is used in both threads;\n\n* Event will be moderated, following the general rules of Reddiquette. Be nice!\n\nModerators of /r/Polska and /r/Slovakia.\n\n****************************\n\nWitajcie w wymianie kulturalnej między /r/Polska a /r/Slovakia! Celem tego wątku jest umożliwienie naszym dwóm społecznościom bliższego wzajemnego zapoznania. Jak sama nazwa wskazuje - my wpadamy do nich, oni do nas! Ogólne zasady:\n\n* Słowacy zadają swoje pytania nt. Polski, a my na nie odpowiadamy w tym wątku;\n\n* My swoje pytania nt. Słowacji zadajemy w równoległym [wątku](https://www.reddit.com/r/Slovakia/comments/1dqn5r6/dzie%C5%84_dobry_kult%C3%BArna_v%C3%BDmena_s_po%C4%BEskom/) na /r/Slovakia;\n\n* Językiem obowiązującym w obu wątkach jest angielski;\n\n* Wymiana jest moderowana zgodnie z ogólnymi zasadami Reddykiety. Bądźcie mili!\n\nLink do wątku na /r/Slovakia: [link](https://www.reddit.com/r/Slovakia/comments/1dqn5r6/dzie%C5%84_dobry_kult%C3%BArna_v%C3%BDmena_s_po%C4%BEskom/)",
        "num_comments": 11,
        "comments": [
            "What is your general view of our country? Do you like our culture, folklore, sporting achievements, and the people?",
            "what slovak words do you find the funniest?",
            "How many of you have been bitten by a beaver?",
            "Can you send more Vinea pls, it's freakin delicious ",
            "Where to go to Mazury with family?",
            "What is the best polish soviet era series? Was thinking about watching 4 tankers and a dog or one whose name I cant remember, but it is a polish comedy series set in Cold war poland. Something similiar to Pelky, but you know, a series, not just a movie.",
            "Its similar to poland: landscape, culture and our languages at some point too. I find it easier to understand slovakian than czech for 100% i have met only one slovak and he was very lovely :)\n\nedit: i used to work at the airport in southern poland, czech republic is closer but there were some slovaks. very nice and polite passengers overall",
            "Sowacy are always welcome, we don't judge individual people by politics, and I personally have already forgiven you for the Hawaii pizza served with bananas instead of pineapple in one of your resorts lol (just kidding, it's beyond weird xD, not forgiven, not forgotten; but truth be told, our ski resorts are equally messed up). But your shift towards Russia and against Europe is probably one of the reasons it's one of the least active cultural exchanges here, I have to confess that nowadays I look at Slovakia in mostly negative light and it's a feeling that's common around the people I meet.",
            "None, really. I'm too familiar with Slovak at this point. But when I was a kid, I thought \"spene zmaturoval\" sounded hilarious (cause we don't have a verb like that).",
            "Perhaps Janosik? It's a Polish short series (something like 12 or 13 episodes) loosely based on Juraj Jnok character. As far I know main character is not actual Juraj Jnok but somebody who is just named like him but there are references to the real story."
        ]
    },
    "Grupa Darwin odchodzi z yt :(": {
        "title": "Grupa Darwin odchodzi z yt :(",
        "score": 69,
        "url": "https://i.redd.it/evfu302c2i9d1.jpeg",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Mylaem e ju dawno to zrobili",
            "Polecam wywiady z nimi. Opowiadaj tam czemu tak decyzj podjli.",
            "Rozumiem, e komu si podobali, ale np. mi aden z ich filmw nie podszed (jak czasami robiem podejcie do czego co byo w proponowanych). Oglnie nie zauwayem w internecie raczej nigdy podobnych opinii i zastanawiaem si czy to ze mn co nie tak xd",
            "Co to jest? Pierwsze sysz.",
            "Jak nie suchasz to gorco polecam ich podcast arty na Bok-u. Jednake jednoczenie ostrzegam przed suchaniem podczas prowadzenia, gdy ju kilka razy si zanosiem ze miechu podczas jazdy co nie jest zbyt bezpieczne.",
            "Pewnie, e s ludzie, ktrym ich filmy si nie podobay. Ja cz z nich bardzo lubie, cz uznaje za enad, a przynajmniej ich humor w danym momencie nie trafia do mnie. Z czasem mnie jednak odtrci od ogldania Darwinw ich fanbase - osoby, ktre spotykaem i oglday Darwinw traktoway ich dziea jako \"co elitarnego, tylko dla zajadych, wtajemniczonych konsumentw, a osoby co nie miesz ich filmy to prostacy\". Ta otoczka + ich zapowiedzi odejcia od Youtube'a (pamitam jak chocia raz mwili, e odchodz, a potem robili wci filmy \\[kompletnie nie ogarniaem o co waciwie chodzio im wwczas\\]) zbrzydy mi na tyle, e ju jest mi obojtna ich dziaalno/koniec dziaalnoci.",
            "Mam to samo, nie jeste sam, zawsze czuem jakby mi art umyka koo gowy. Dla wielu ludzi kultowe, a dla mnie kompletna bezbecja.",
            "Komedia to najbardziej subiektywny z gatunkw kultury, albo humor wejdzie albo nie - dla mnie te raczej tak se, a w okolicy 2015 znajomi z roboty si przekrzykiwali cytatami\n\nI w sumie w tej kategorii chyba fani s bardziej widoczni od hejterw",
            "To jest co jak polskie kabarety, tylko jeszcze bardziej niemieszne.",
            "Podnieta z 2012. Mnie osobiscie nie jarala, np mojego brata i rodzicow bardzo.\n\nKategoria: smieszne filmiki"
        ]
    },
    "Pamiętajcie o odpowiedzialnym korzystaniu z używek": {
        "title": "Pamiętajcie o odpowiedzialnym korzystaniu z używek",
        "score": 100,
        "url": "https://i.redd.it/3j7gldobeh9d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "O kurwa, bakterie Actimelowe zmutoway.\n\nZawsze to byo L. Casei Defensis, a najwyraniej tak dugo je trzymali w butelce, e si stay L. Casei Danone. Nic dziwnego, e tamtego gocia tak sponiewierao.",
            "Moe po prostu u mnie nie ma, ale dostaem wspomnie z Actimelem bo nie pamitam kiedy ostatni raz go ja oczy widziaem",
            "Kapitalizm tak zmutowa, e teraz moesz kupi sobie bakterie i je nazwa",
            "Za duo miliardw weszo",
            "1. Twj kot i twoje pierogi mog zostac maskotk /r/Polska! Zbieramy propozycje obrazkw do panelu bocznego! Dla zwycizcw moliwo dodania do trzech obrazkw do flary na /r/Polska. Link: https://www.reddit.com/r/Polska/comments/1dng16d/\n\n2. Prowadzimy rekrutacj na moderatorw /r/Polska. Wszystkie informacje pod linkiem: https://www.reddit.com/r/Polska/comments/12x53sg/\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Polska) if you have any questions or concerns.*"
        ]
    },
    "Zrobiłem dzisiaj coś o czym marzyłem od dziecka. Przedawkowałem Actimela.": {
        "title": "Zrobiłem dzisiaj coś o czym marzyłem od dziecka. Przedawkowałem Actimela.",
        "score": 714,
        "url": "https://www.reddit.com/gallery/1dqssan",
        "content": "",
        "num_comments": 55,
        "comments": [
            "Dzieci nie pijcie wszystkich actimeli na raz bo umrzecie na przedawkowanie witaminy",
            "Byo mio pozna w takim razie",
            "Taki cwany to teraz to samo z szeciopakiem!\nCho w sumie, dla prawdziwie utalentowanych jest jeszcze omiopak...",
            "cz si w blu z Twoj rodzin. Kiedy pogrzeb i na ktr parcel wysa kwiaty?",
            "Ta dzisiejsza modzie... Tylko by chlaa jogurty",
            "Jak sie nie posrales, to actimel jest sciema. Plecam swiezo ukiszona kapuste 5-6 dni. zrobisz srany szlaczek do kibla - nic nie pomoze.",
            "Sorka za gupie pytanie. A to idzie go przedawkowa?",
            "Rkawy za nadgarstek - bottom detected",
            "Ja tam zawsze zamraarm aktimela w zamraarce aby byy kostki lodu i wrzucaem do kawy",
            "daj zna jakie sranie po tym"
        ]
    }
}