{
    "Nabór na moderatorów /r/Polska": {
        "title": "Nabór na moderatorów /r/Polska",
        "score": 27,
        "url": "https://www.reddit.com/r/Polska/comments/14pbk8n/nabór_na_moderatorów_rpolska/",
        "content": "Cześć,\n\nr/Polska rośnie. Niedawno przekroczyliśmy próg 500k użytkowników. Wraz ze zwiększoną liczbą aktywnych członków /r/Polska potrzebuje także zwiększonej liczby aktywnych moderatorów.\n\n# Czym się zajmują moderatorzy?\n\nW 90% jest to egzekwowanie regulaminu poprzez zatwierdzanie lub usuwanie treści zgłaszanych przez użytkowników. Gdy już to wszystko jest nadrobione, można zajmować się ulepszaniem naszej społeczności - inicjatywami typu wymiany kulturowe, AMA lub owocowe czwartki.\n\n# Kto powinień zostać moderatorem?\n\nModeratorem powinna zostać osoba, która:\n\n* umie pracować w zespole i uszanować decyzję tego zespołu, nawet jeśli jest ona odmienna od jego/jej własnej,\n\n* spędza dużo czasu na /r/Polska i będzie aktywnie go moderowała,\n\n* zna regulamin /r/Polska ([link](https://www.reddit.com/r/Polska/wiki/rules/)).\n\nJeśli nigdy nie moderowałeś/aś lecz jesteś pewny/a swojej aktywności - śmiało zgłaszaj się. Obecni moderatorzy bez problemu nauczą Cię z czym to się je.\n\n# Jeżeli chcesz aplikować, proszę wypełnij i wyślij na naszą [pocztę moderatorską](https://www.reddit.com/message/compose?to=%2Fr%2FPolska&subject=&message=):\n\n* Ile czasu w tygodniu możesz poświęcić na moderowanie /r/Polska:\n* Czy masz doświadczenie w moderowaniu? Jeśli tak, to na jakich subredditach?\n* Ciekawe pomysły jakie masz na ulepszenie /r/Polska, które mógłbyś/mogłabyś wprowadzić w życie:\n* Pozostałe rzeczy o jakich chcesz wspomnieć:",
        "num_comments": 68,
        "comments": [
            "praca za darmo 💀",
            "[removed]",
            "Jestem bardzo fajna osoba z prawidlowym kompasem. Mysle, ze podolam temu zadaniu. Ten subreddit stanie sie fajniejszy, jezeli ja zostane moderatorem.\n\nhttps://preview.redd.it/qsj4wr7uzp3c1.jpeg?width=456&format=pjpg&auto=webp&s=80264bc27391ba724c5475cf2b491b1bd9196d35",
            "ok ile można zarobić za swój czas?",
            "Chętnych normalnie zatrzęsienie.",
            "[removed]",
            "Za darmo??",
            "Potrzebuje sprzęty mmmm\nDobra jakość na dobrą ilość",
            "Czemu ktoś miały to sobie robić i to za darmo!\n\na nie ok. są owocowe czwartki",
            "Praca w młodym dynamicznym zespole"
        ]
    },
    "We do a little trolling": {
        "title": "We do a little trolling",
        "score": 474,
        "url": "https://i.redd.it/qt29u6bh9y7d1.png",
        "content": "",
        "num_comments": 49,
        "comments": [
            "A potem słoik pękł i wszyscy na baczność odśpiewali YMCA",
            "&#x200B;\n\nhttps://preview.redd.it/5qxwo8k5c38d1.jpeg?width=400&format=pjpg&auto=webp&s=18558148e89f74bb76e34f8d7d7e1223423abb68",
            "Kierowca autobusu aż wstał by klaskać",
            "/r/ThisReallyHappened",
            "Potwierdzam, byłem tą farbą.",
            "Z cyklu „nigdy się nie wydarzyło ale fajnie się klika”",
            "Filia Zakładu Pogrzebowego Bytom. Od kopania dołków do szpachlowania ścian. Typowa kariera w Bytomiu 🤷🏼‍♂️",
            "potwierdzam bylam pedzlem",
            "I potem cała lewica przyszła do Zakładu Remontowego Bytom i każdy wręczył 1000zł i czekoladki a Zakład Remontowy Bytom stał się najbogatszą firmą na świecie i było super",
            "ratowanie świata? ten tryb w fortnite?"
        ]
    },
    "Klienci są niemili dla sprzedawców w sklepach": {
        "title": "Klienci są niemili dla sprzedawców w sklepach",
        "score": 361,
        "url": "https://www.reddit.com/r/Polska/comments/1dlr453/klienci_są_niemili_dla_sprzedawców_w_sklepach/",
        "content": "Tldr; klienci niemili dla pracowników w sklepie\n\nOd paru miesięcy pracuję w sklepie z płazem w nazwie. Wczoraj miałam chyba swoją najgorszą zmianę. Było zakończenie roku szkolnego, jakiś mecz i po prostu piątek wieczór - długa kolejka od nieustannie od 17.00 do 23.00 (przy dwóch otwartych kasach). Tyle, ile ja się bluzgów nasłuchałam w moją stronę, to chyba nie zliczę XDDDD Że jestem zjebana, że za wolno się ruszam, że jestem spierdoloną kurwą z kasy, że czemu odchodzę od kasy (pewnie szlam po jakąś paczkę na zaplecze), żebym szybciej robiła jakieś jedzenie albo mam wypierdalać. 99% obelg to mężczyźni w wieku 18-45.\n\nNadal mam wrażenie, że ludzie nie wiedzą, że praca w sklepie to nie tylko stanie na kasie - towar nie pojawia się magicznie na półkach, cały czas jest coś do posprzątania, wypiekanie bułek, ogarnianie dostaw, wpisywanie wszystkiego do systemu - w ciągu zmiany trwającej ponad 8h można być najzwyczajniej zmęczonym, nie uśmiechnąć się do klienta, niechcący się pomylić w przeliczaniu reszty.\n\nCzemu niektórzy klienci nie traktują pracowników sklepu jak ludzi, tylko jak ściery do podłogi? Oprócz jakiegoś społecznego przekonania, że sprzedawca w sklepie to upadek człowieka i \"hehe panie z frog shop to tylko siedzą przed sklepem i palą fajki\".\n\nPS. Nie mam zamiaru zmieniać pracy, bo dorabiam sobie jako studentka i mam całkiem spoko współpracowników.",
        "num_comments": 137,
        "comments": [
            "Ludzie nie są niemili dla sprzedawców w sklepach. Ludzie są niemili dla ludzi. \nJest grupa buców, dla których życie to gra na jednego gracza a cała reszta ludzi to NPC. Śmiecą, niszczą, robią dramy. Ot, świat. \nTy - jako sprzedawca - wchodzisz w interakcję, więc statystycznie częściej nadziewasz się na takich ludzi. To wszystko.\n\nNie bierz tego osobiście. Hoduj pancerzyk na takich ludzi - przyda Ci się on na przestrzeni życia, bo potencjalnie dzięki niemu nie zabraknie Ci języka w ustach gdy spotkasz w realnej sytuacji kogoś niemiłego.",
            "Trafilas na sflustrowanych zjebow. Domyslam sie jakie to trudne i nieprzyjemne to znosic ale pomysl, ze to ludzie ktorych jedynym sukcesem w zyciu to postawienie sie wyzej niz sprzedawca w zabce. Wyjda z niej i wroca do swiata ktory nimi wyciera podlogi. A Ty skonczysz studia i z umiejetnoscia ciezkiej pracy zajdziesz daleko w zyciu.",
            "To niewiarygodne do czego ludzie myślą że mają prawo, bo wydają 15 złotych w sklepie",
            "Pracowałem w kilku sklepach, bardziej specjalistycznych i dzięki temu mogłem ominąć takich jełopów. Tak jak piszą wyżej, Żabki przyciągają takich ludzi, którzy myślą, że skoro oni w Żabce nie pracują - to są lepsi. Jedynie moi znajomi, którzy pracowali w Żabkach spotkali się z takim grubiaństwem.",
            "Mówi się,że klient ma zawsze rację. Statystyki jednak pokazują, że klient zazwyczaj gówno wie i jeszcze sapie 😀",
            "Bo ludzie lubią dawać upust swoim frustracjom, kompleksom i życiowym porażkom, na kimś kogo uważają za gorszego od siebie. \n\nW końcu jak sama nazwa \"sektor usługowy\" wskazuje, jesteś tam by im służyć, a sługi jaśnie państwo musi trzymać krótko, by się nie rozbestwiły /s",
            "Szanuję wszystkie Panie i wszystkich Panów pracujących w Żabce, bo wiem, że to pierwszy sklep gdzie ludzie na szybko idą kupić albo dokupić alkohol. Po alkoholu ludziom puszczają filtry i pokazują swoje twarze.",
            "Problem jest taki że nie ma pozwolenia na ostrzał chorego bydła. 😕",
            "Też pracowałem w handlu w branży RTV i zauważyłem że niektórzy nawet nic nie chcą kupić, a przychodzą żeby się wyżyć i pokazać jakąś wyższość a potem wyjść z pustymi rękami. Mam teorię że dostają opierdol w pracy ale nie mogą się postawić bo wylecą, więc przychodzą się wyżyć na sprzedawcy bo wiedzą że ten się nie postawi, bo straci pracę. Więc zasadniczo są nietykalni i to wykorzystują",
            "Od lat była wałkowana zasada \"klient nasz pan\" która niestety trwa do teraz i klienci wiedzą że mogą sobie pozwolić na takie coś (o ile nie ma ochrony) bo co zrobisz? Jak spróbujesz zwracać się do nich jak oni do ciebie to po prostu każą zawołać kierownika albo złoża skargę na ciebie a jak wiadomo, firmy prędzej staną po stronie klienta niż pracownika.\nJako pracownik sklepu jesteś praktycznie cały czas na straconej pozycji ponieważ jedynie co możesz robić to się uśmiechać, próbować to ignorować i wykonywać swoją pracę."
        ]
    },
    "Wiem, wiem reklamy, oglądalność itp, ale trochę to smutne...": {
        "title": "Wiem, wiem reklamy, oglądalność itp, ale trochę to smutne...",
        "score": 172,
        "url": "https://www.reddit.com/gallery/1dlrsqu",
        "content": "",
        "num_comments": 75,
        "comments": [
            "Znaczy się, to nie wina piłkarzy, że cały świat pakuje kasę w piłkę nożną i dzięki temu FIFA/UEFA (zależnie od turnieju) może wypłacać im horrendalne sumy za \"nic nie robienie\".",
            "Mnie najbardziej zaskakuje to że Fernando Alonso ma czas jeszcze grać w piłkę nożną. Facet naprawdę jest niezniszczalny.",
            "Niesamowite jest to ile polska wydaje na rozwój piłki nożnej, a dalej jesteśmy tak chujowi.",
            "Kiedy ostatni raz oglądałeś mecz siatkówki mężczyzn? ",
            "Nie do końca rozumiem, czy byś chciał aby Polski Związek Piłki Nożnej nie dostał tej kasy wcale lub aby zrobili prezent siatkarzom?\n\nZarobki w sporcie zależą tylko i wyłącznie od zainteresowania ze strony widzów, sponsorów i inwestorów. To nie jest akcja charytatywna.\n\nGdyby Polska przegrała w kwalifikacjach, to te 9 mln by trafiły do Walii. I oni by chyba sobie na narzekali.",
            "Czyli 2.5 miliona do podziału na jakeś, nie wiem, 40 osób? (bo nie tylko do składu, który wziął udział w samym Euro, ale tych, którzy grali też w eliminacjach). Czyli raptem 62,5 tysiąca euro. To są grosze. Większość tych piłkarzy gra w klubach z topowych europejskich lig, podobne wynagrodzenie dostają za tydzień treningów.",
            "Ja tam wolę jako kibic siatkówki to mniejsze grono odbiorców - mniej toksyczności, hejtu, afer. Wiadomo siatkarze pewnie mają na to inne spojrzenie, ale nie rozumiem w czym mi ma to przeszkadzać jako kibic. Poziom siatkówki w Polsce jest wysoki więc najwidoczniej pieniędzy jest wystarczająco, w przeciwieństwie do piłki nożnej gdzie ewidentnie nam nie idzie i potrzebne jest np. lepsze szkolenie",
            "Czyli nic nie trzeba robić a kasa się zgadza.",
            "![gif](giphy|94EQmVHkveNck|downsized)\n\nNapewno jest im przykro że znów g... pokazali",
            "Nie wiem jak inni ale mnie WKURWIA jak całe media gadają o piłce nożnej (wiadomości, reklamy, radio, jakieś kurde dzień dobry tvn czy coś) Wszystko dla ludzi opiera się na piłce nożnej jakby nie było innych informacji do gadania.  Rozumiem że euro jest dużym wydarzeniem ale nie każdego to interesuje. ja chcę wiedzieć co się ważnego na świecie dzieje  a nie że za 12,11,10,9,8..... godzin będzie euro i że \"teraz będzie lepiej jest drużyna przygotowana\". Ja chcę normalnie żyć, nikt nie potrzebuje mi przypominania za ile euro I jak to bardzo są teraz przygotowani."
        ]
    },
    "Barcelona zlikwiduje WSZYSTKIE apartamenty turystyczne w 2028 roku": {
        "title": "Barcelona zlikwiduje WSZYSTKIE apartamenty turystyczne w 2028 roku",
        "score": 259,
        "url": "https://www.theolivepress.es/spain-news/2024/06/21/breaking-barcelona-will-remove-all-tourist-apartments-in-2028-in-huge-win-for-anti-tourism-activists/",
        "content": "",
        "num_comments": 77,
        "comments": [
            "Jeszcze tylko się zająć kradzieżami i legancko tego.",
            "Airbnb to rak. Wszystkie miasta powinny tego zakazać. Albo wprowadzić zakaz wynajmu mieszkań na okres krótszy niż 3 miesiące (i ścigać oraz karać naruszających go). \n\nTo jest obchodzenie planów zagospodarowania i przeznaczenia budynków i tworzenie profesjonalnie funkcjonujących mini quasi-hoteli tam gdzie ich nie powinno być. \n\nNie powinno się pozwalać na to, że w budynku mieszkalnym funkcjonuje quasi-hotel gdzie pojawiają się co chwilę nowi, obcy ludzie, do tego często hałasujący po nocach.",
            "To może by przekształcić niektóre hotele w taki sposób, żeby były jeszcze tańsze niż Airbnb? Sam sprzątasz, sam sobie żarcie ogarniasz, żadnych pokojówek, pokoje na kod i nie musi być konsjerża. Wnętrze proste, bo turysta chce się tylko przespać i idzie zwiedzać. I pyk, wszyscy zadowoleni.",
            "Bardzo dobrze. Byłem w Barcelonie dwa razy. Raz w wynajmowanym mieszkaniu (w aparthotelu, więc pewnie przetrwa tę czystkę), drugi raz w normalnym hotelu. Hotel mimo niższego standardu był o niebo lepszym rozwiązaniem.\n\nAirBnB miało rację sensu, gdy to była oddolna inicjatywa, wynajmowanie kanapy gościowi, którego nie byłoby stać na hotel, a przyjechał np. na koncert lub rozmowę o pracę. Obecnie większość ofert to mieszkania w cenie taniego hotelu.\n\nJa rozumiem, właściciel ma prawo do dysponowania swoim mieszkaniem, ale mieszkanie ma swoje przeznaczenie. Tak samo jak nie umieszcza się w nim huty szkła (tak wiem potężna hiperbola), czy burdelu, tak nie robi się z niego hotelu.",
            "Do tego czasu pewnie się zmienią władze i nie wejdzie w życie. \n\nPlus trochę śmieszna ilość 10K. \n\nPamiętam jak jeszcze mieszkałem w Berlinie tamtejsze władze też chciały zmniejszyć wpływ AirBnB. Wyszło na to że na prawie 4M mieszkańców, tylko około 3K mieszkań było wynajmowanych na AirBnB. Do tego największym landlordem były same władze miasta, poprzez własne spółki mieszkaniowe. \nOstatecznie po prostu za mało i za wolno się buduje, a ludzie za szybko napływają do miasta.",
            "Barcelona próbuje wypchnąć z miasta mniej zamożnego turystę. To się dzieje już w wielu miejscach na świecie - zarobić tyle samo (choć zarabiają mniej liczni), ale przy dużo mniejszym obłożeniu. Pomysł oczywiście nienajgorszy, bo zmniejsza się uciążliwość dla mieszkańców. Ciekawi jednak tak duże wsparcie z Polski, bo to przecież właśnie nasz turysta zostanie zastąpiony mniej wrażliwymi na ceny Amerykanami, Chińczykami czy mieszkańcami bliskiego wschodu. Ale może każdy tutaj już był i nie chce żeby inni też pojechali.\n\nJeśli to z powodu ogólnej niechęci do airbnb, to dodam, że nie wpłynie to w żaden sposób na sytuację w Polsce. Przy obecnym stanie prawnym nie ma takich możliwości prawnych (zakazu wynajmu krótkoterminowego). Nie ma też woli politycznej, ani widoków na zmiany w legislacji (lobby hotelarskie jest bardzo słabe - rozproszony rynek, a deweloperskie, bardzo mocne).",
            "Szczerze popieram, właśnie wróciłam z Londynu i miałam wrażenie, że tam nie ma lokalsów... są ludzie którzy mieszkają w klitkach, albo inwestorzy z AirBnB... duże miasta przestały być do życia, są tylko jedną wielką atrakcją turystyczną... Od mieszkania na wycieczkach powinny być hotele, które mają standardy. Właśnie wynajęłam airbnb w Londynie (przypadkowo, myślałam, że to hotel, coś ala pensjonat) iii no ogólnie było czysto, ale w łóżku były cudze włosy... było to niesmaczne. Posprzątaliśmy to sami... W hotelu nigdy nie miałam takiej akcji.",
            "Bardzo dobrze. ",
            "I bardzo kurna dobrze",
            "Jak zwykle zesrańsko landlordów. U nas konfederacja powiedziałaby że to cios wymierzony w przedsiębiorców z branży mini-hotelarskiej xD"
        ]
    }
}