{
    "Follow the rules. DO NOT ASK FOR and DO NOT OFFER money, clicks, affiliate or donation links, or things. Don’t be mean. No personal attacks.": {
        "title": "Follow the rules. DO NOT ASK FOR and DO NOT OFFER money, clicks, affiliate or donation links, or things. Don’t be mean. No personal attacks.",
        "score": 71,
        "url": "https://www.reddit.com/r/poor/comments/173y3n4/follow_the_rules_do_not_ask_for_and_do_not_offer/",
        "content": "Police yourselves. Sometimes people are just venting. Even if they may be wrong about facts or situations, you can express your points without attacking them.\n\nNo matter the cause, any request for money or clicks or downloads or such (“Sign up with this game so I can get points!”) may receive instant ban. Any offers may be deleted on sight and may lead to a ban.\n\n**Because everyone is in need. There are tons of people who deserve help but are being polite and not trying to turn this subreddit into a sob story contest for money.**\n\nNot every comment or post can be read, so report ones that break the rules.\n\nI have implemented basic account age and karma minimums, so that hopefully will stop most spam.",
        "num_comments": 0,
        "comments": []
    },
    "Had to place a food order and basically paid deliver fee for nothing ": {
        "title": "Had to place a food order and basically paid deliver fee for nothing ",
        "score": 64,
        "url": "https://www.reddit.com/r/poor/comments/1dqx1yr/had_to_place_a_food_order_and_basically_paid/",
        "content": "Just wanting to vent. When you are as poor as I am that 7.95 delivery fee feels like a lot. I am super sick today and so ended up having to place an order for some bland foods, things like turkey and basically the shopper didn't even get any of the stuff I needed, to the point they should have just cancelled the order. So I have a loaf of bread, a tomato and a drink... which wouldn't have even cost the delivery fee where I live.  I mean I guess that is bland food, I feel like I wasted that money that I genuinely couldn't even really have afford, I was just so sick that I couldn't walk to the store.  ( I don't have a car and family is 10 hours away in another state, and I am completely alone. ) ",
        "num_comments": 37,
        "comments": [
            "i hate when this happens, when i need specific ingredients and they cancel them. I would probably call and explain and ask for the fee back since they didn’t get you most of your ingredients",
            "it's hard AF to shop as a poor person. every dollar counts and hurts so much at the same time. there's so much sh!t out there to choose from. i get exhausted just looking at it all and sifting through all the sh!t i can't buy to find something i can not only afford but isn't all the way garbage also. it's painful AF i hope you feel better soon. delivery for the privileged. i'm always disappointed & i always feel ripped off. prayers to you 🙏🩵",
            "Awww I'm so sorry. Please call the delivery company and let them know you aren't satisfied. \n\nI hope you feel better soon.",
            "Definitely demand a refund - not just the delivery fee.  They decided not to include the most expensive item on the list.  That's unacceptable.\n\n  \nOn another note, I know it's hard, but definitely try to stock up a bit.  When you go out for groceries, stick an extra can of chicken soup in with the groceries (when you can).  Do this a few times over the course of a month or two, and it builds up a supply you can use when you're too sick to go out for groceries.  Cans of soup last 2-4 years, so it's something you can hold on to for awhile and still be ok.",
            "Do you know any of your neighbors? If not, it’s time to make acquaintances.  Especially for when you need help.",
            "I would totally contact the delivery company and ask for a refund",
            "You should call and ask for a refund. If it was a delivery order you can probably refund it over the phone",
            "I’m sorry that happened. I agree with you. I’d ask for a refund.",
            "If it's Instacart contact them and tell them you want the order reshopped.",
            "Refund, instacart or uber will refund you the price. Much love"
        ]
    },
    "Retirement may be Impossible ": {
        "title": "Retirement may be Impossible ",
        "score": 40,
        "url": "https://www.reddit.com/r/poor/comments/1dqy83m/retirement_may_be_impossible/",
        "content": "I have maybe $1,000 to my name, that is excruciatingly obvious that amount is not enough to retire on. I'm 40 and I plan on retiring at 70. I decided to have fun when I was young. Since I'm not young at all anymore, my youth is completely gone. Now it's time to stop having fun and save as much as possible.\nMy income fluctuates, it isn't a steady amount and that poses its own challenges. For example I was making $500 a week last fall, at the start of this year my work cut my hours so now I'm making $300.\nI have over 20 years experience in the Maintenance Industry, people with that experience usually make $19 per hour. I'm only making $13.76 an hour right now.\nI had the worst health scare of my life and that cost me the Maintenance job. Me boss terminated me due to medical reasons at the beginning of May of 2023. I was making $16 an hour at that job and getting steady hours.",
        "num_comments": 41,
        "comments": [
            "> I have over 20 years experience in the Maintenance Industry, people with that experience usually make $19 per hour.\n\nThen go get one of those jobs.",
            "Retirement, hah! I gave up on that thought when I was 30. Over 40 now can't afford to fart in my own toilet",
            "At least you had the integrity to admit you goofed off as a young person. Most poor people would never admit that.",
            "I'm a decade younger and I've come to that realization as well. I just got a pay raise last year but with the economy being what it is, I'm still poor.\n\nIf you do maintenance, why not try a job in the restoration industry? Depending on your state, the general contracting side pays more than what you are currently making and the more versatile your skills, the better. I'm in Texas and on the very lower end you'd get $18 and on the higher end $28+",
            "There are retirement plans and savings plans that can be started anytime. 40 is still young.",
            "I got my masters degree at 51 to get a job that is paying me enough money to live and save for retirement. 40 is not old.",
            "Get a government job with a pension.",
            "Hey, where are you located? Because my company is always hiring for maintenance. If you'd like to send me a message, I can give you more information.",
            "I'm 53.  I don't think I will ever be able to retire.  Thinking of changing over to a government job.  At 55.",
            "Consider retiring abroad. On your USD social security, you can go really far in another country."
        ]
    },
    " Having to do sex work again just so I can afford bus pass for my new job. I feel so fucking filthy.": {
        "title": " Having to do sex work again just so I can afford bus pass for my new job. I feel so fucking filthy.",
        "score": 9,
        "url": "https://www.reddit.com/r/poor/comments/1dr67fh/having_to_do_sex_work_again_just_so_i_can_afford/",
        "content": "\nI told myself I’d never do it again. It made me sick to my stomach. Made me have suicidal thoughts. I had to eat dog food just so I didn’t have to do it but now I am being pushed into doing it again. \n\nI just fucking hate my life right now. Called the person last night that contacts client to schedule me for sunday night and guess what I cant sleep due to the fact that I will have to do it again tonight so I can have money to start my new job. \n\nI keep on telling myself that I’d do it just this last time for me and my dog. That once I get this job started I should be able to get back on my feet and never look back on the things that I did to survive but does it really get better? \n\nI’ve had a small money but my bank took it because Im overdrawn. My period is also coming soon and Im stressing and I cant even afford tampons. \n\nApplied for a free bus pass but it was denied. Im not supposed to start this job until mid of July but there were changes. It’s not like Im not trying. I am doing everything that Im supposed to do. Offering cleaning services, knocking door to door to see if there are chores I could do but theres no luck. \n\nI feel like a disappointment, I cant even afford to buy my dog some treats and I am so ready to give up if it weren’t for her. \n\nI am beyond exhausted.\n",
        "num_comments": 2,
        "comments": [
            "I am so sorry, Hun. Life is tough right now and whatever you decide on doing know that you did it to survive."
        ]
    },
    "My boyfriend and I are in different tax brackets": {
        "title": "My boyfriend and I are in different tax brackets",
        "score": 5,
        "url": "https://www.reddit.com/r/poor/comments/1dr40zp/my_boyfriend_and_i_are_in_different_tax_brackets/",
        "content": "I've been dating this guy for about four months now. I know that he makes well over six figures, and I think that he thinks I make more than I do. We've mostly been paying for dates equally, but my living situation is changing and pretty soon I will be living very frugally. I'm honestly really embarrassed because he lives a very luscious life and I won't be able to keep up. Today I went with him to buy a truck and he put down $20,000 in cash. I'm worried about my next grocery bill and if I'll be able to make rent. I'm not sure how to approach this with him. ",
        "num_comments": 6,
        "comments": [
            "If he cares then he isn’t the one anyway",
            "You need to open up and communicate that to him. It’s critical to do this and the only way that you’ll clear your conscious. You’ll have the opportunity to set a boundary and express that you’re not looking for sympathy or a hand out but a real genuine love or relationship. Do it when you feel comfortable or ready. The truth will come out eventually. Whether you do it or not. Might as well control the situation yourself now instead of later.",
            "It’s a long story but my wife is much better off financially than I am. It’s uncomfortable. All of her friends are well off. When they want to go out it will be expensive and I cringe at the thought of having to split the check. Yesterday we were listening to a friend tell us he was feeling down on Monday so he went and bought a Mercedes convertible. I sold my car last year so i wouldn’t have to pay for insurance.\n\nThe point is that if your boyfriend wants to live that lifestyle you will often be put in a position where you may feel like you have to overspend or be a party pooper and that isn’t fun at all.",
            "Well, if he wants to go out to fancy places and spend a lot of money, then he can pay the bill.  Talk to him and simply say you can't afford this lifestyle, and that you need to scale back.",
            "SS but I wish I had this problem lol. Much better situation to try and navigate than two brokies in a relationship."
        ]
    }
}