{
    "Popping a number of Fordyce Spots (NSFW: male genitalia)": {
        "title": "Popping a number of Fordyce Spots (NSFW: male genitalia)",
        "score": 807,
        "url": "https://v.redd.it/nwjcjcxg5e9d1",
        "content": "I have had these on the underside of my penis for as long as I can remember. They appear as small, superficial nodules. Some of them can be popped while some cannot. They never go away. Those that can be popped will gradually refill over a couple of weeks. I tried to keep the lens as reasonably close to my skin as I could, I did not want to be obscene. Sorry if the camerawork isn’t the greatest. It is not easy to hold the camera with one hand and pop with the other. It also doesn’t help that the skin in this area is so mobile. I hope you all enjoy the video. I really am sorry that I could not film a different body area. I understand that male genitals can be very off putting for some. ",
        "num_comments": 189,
        "comments": [
            "Hey! I got these under my boobs lolol",
            "Given the nature of what you’re filming, this is the least offputting way to do it. Credit where credit is due – this isn’t obscene.\n\nNot saying you would want to do this since the skin is so sensitive, but I wonder if a chemical exfoliant (like AHA/BHA) would clear out the spots and keep them clear.",
            "I get these! Most people do at some point. They're enlarged oil glands. They can happen anywhere, but they're easier to see/squeeze on hairless skin like the lips and genitals. I also get them on my breasts close to my nipples.",
            "Thank you for being vulnerable and sharing this! I never knew these existed, so this is fascinating.  I guess I’m wondering if that’s considered an oily area, or if delays in cleaning after intercourse or even using lotion or lubricant during m@sterb@tion could cause these pores to clog?   (I’m in no way putting OP down… I’m just wondering about these!)",
            "My best friend and brother has these too. They were scared that it was an STD or something and were freaking out lol I might be wrong but the bumps are related to hair follicles or something similar.",
            "Sincerely love how this sub is normalising the human body. It's almost refreshing.",
            "Fwiw, the degree of detail that’s shown is vague enough to not be specifically genitalia, you did a respectful job filming the pops without OMG D***.  And there have been scrotal cyst posts/ labial pops using the nsfw filtering and warnings.  I think the crowd in this subreddit, posters and readers, tend to treat genitalia respectfully.  Thank you for the pops.",
            "I never knew what these were! I have some on my beanbag, had them checked for STD and was clear, Dr said it was completely normal.",
            "I get these on my boobs (I’m female) I wondered what they were! Thanks for showing me I’m not alone!",
            "I get similar under my breast. My doctor recommended hibiclense. You can find it on Amazon and I've seen it at Publix. \n\nIt's making a big difference for me."
        ]
    },
    "Missed the first squirt, but tried to get the rest. ": {
        "title": "Missed the first squirt, but tried to get the rest. ",
        "score": 160,
        "url": "https://v.redd.it/ozpw36qyte9d1",
        "content": "I think there is more in it, it looked like there was a second head. The first squirt shot across my bed and in my aunts hair.",
        "num_comments": 5,
        "comments": [
            "Your aunt sounds like good people",
            "She is, we are each others go to zit popper.",
            "She is very very good people",
            "Looks horribly painful. Yes, there's at least one more core in it.\n\nYou'd be good to grab some antibiotics or have it checked by an MD before popping the rest. Septicemia is horrifically painful.\n\nPlease be safe and well",
            "#Please remember to follow our [rules](https://www.reddit.com/r/popping/about/rules/)\n\nPosts:\n\n* **Don’t ask for medical advice**\n\n* **No stolen content** - just post a link to the original video\n\n* **Properly flair/mark/title your posts**\n\n* **Wacky Wednesday content is only for Wednesdays**\n\n* **No food, even on Wednesday**\n\nComments:\n\n* **No commenting on hygiene or appearances.**\n\n* **Absolutely no sexual comments or sexual harassment.** This is an instant, permanent ban.\n\n* **Don’t be rude, and observe reddiquette.**\n\n#This comment is made automatically on all posts. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popping) if you have any questions or concerns.*"
        ]
    },
    "TW: Blood, Puss, Squirts. MrPopZit and severe acne": {
        "title": "TW: Blood, Puss, Squirts. MrPopZit and severe acne",
        "score": 41,
        "url": "https://youtu.be/KuAzqhCfYSo?t=191",
        "content": "Poor guy. At least he’s getting good treatment, but this looks brutal.\n\n\nFirst squirt at 3:11 and following, and second one at 11:32 ",
        "num_comments": 7,
        "comments": [
            "It’s ‘pus’ lmao 😂\nI was wondering why a guys face was being described as having puss on it(tbf it’s marked nsfw so i just rolled with it)",
            "Pus is a liquid that comes out of a human body, Puss is a part of the human anatomy that has liquid come in it.",
            "Sorry, not a native speaker. Anyway…",
            "How do you think the acne got there? Too much face sitting is my speculation.",
            "That’s how i wanna go",
            "It’s a sacrifice I’m willing to make.",
            "#Please remember to follow our [rules](https://www.reddit.com/r/popping/about/rules/)\n\nPosts:\n\n* **Don’t ask for medical advice**\n\n* **No stolen content** - just post a link to the original video\n\n* **Properly flair/mark/title your posts**\n\n* **Wacky Wednesday content is only for Wednesdays**\n\n* **No food, even on Wednesday**\n\nComments:\n\n* **No commenting on hygiene or appearances.**\n\n* **Absolutely no sexual comments or sexual harassment.** This is an instant, permanent ban.\n\n* **Don’t be rude, and observe reddiquette.**\n\n#This comment is made automatically on all posts. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popping) if you have any questions or concerns.*"
        ]
    },
    "Leaking Mini Holes, Oh My": {
        "title": "Leaking Mini Holes, Oh My",
        "score": 50,
        "url": "https://youtu.be/JQVV4DnM3PU?si=ONJk-OWNfvgv2zIY",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Looks like a large carbuncle that they used the punch biopsy tool to make access next to it.",
            "At some point you're just begging them to bring out the tweezers.",
            "Holy shit that was aggravating.",
            "“We don’t have many tools here….”. Whaaa?",
            "No kidding. More worried about getting their office dirty than actually helping the patient. Jesus. ",
            "And when she said she doesn’t have her tools… well, why are you doing this if you don’t have your tools?",
            "#Please remember to follow our [rules](https://www.reddit.com/r/popping/about/rules/)\n\nPosts:\n\n* **Don’t ask for medical advice**\n\n* **No stolen content** - just post a link to the original video\n\n* **Properly flair/mark/title your posts**\n\n* **Wacky Wednesday content is only for Wednesdays**\n\n* **No food, even on Wednesday**\n\nComments:\n\n* **No commenting on hygiene or appearances.**\n\n* **Absolutely no sexual comments or sexual harassment.** This is an instant, permanent ban.\n\n* **Don’t be rude, and observe reddiquette.**\n\n#This comment is made automatically on all posts. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popping) if you have any questions or concerns.*"
        ]
    },
    "Large Blackheads popped on back": {
        "title": "Large Blackheads popped on back",
        "score": 357,
        "url": "https://www.youtube.com/watch?v=BL_5d_ohxpY&ab_channel=AndrewHudson%2CMD%2CFAAD",
        "content": "",
        "num_comments": 45,
        "comments": [
            "I hate that Q-tip technique.",
            "I WOULD EMPTY MY BANK ACCOUNT TO GET AT THAT BACK!!!",
            "Oh god not the q tips.",
            "What about the rest?? Were not blind!!",
            "This looks like a Suriname toad giving birth from its back.",
            "Another rousing game of blackhead or mole! Hot dang!",
            "I don't have audio on this machine, so sorry if the dude says, but what causes THAT many dilated pores? Sun damage?",
            "I’ve seen this before. But it was a one off. I wanted more!",
            "JFC! Ban the QTips! Steam her back with some hot towels and those fuckers will be poppin out like whack-a-moles!!",
            "I would pay to do this"
        ]
    }
}