{
    "Meet my new daily driver": {
        "title": "Meet my new daily driver",
        "score": 3784,
        "url": "https://i.redd.it/uym5jzb18b9d1.jpeg",
        "content": "",
        "num_comments": 239,
        "comments": [
            "Congrats and fuck you",
            "The obligatory comment\n\nhttps://preview.redd.it/ybhyg7znib9d1.jpeg?width=1200&format=pjpg&auto=webp&s=9219f433a8023e8d85239cf13e37a6f402869beb",
            "Damn, Sport Classic as a daily!\n\nSo happy for you!!",
            "[removed]",
            "You look really happy",
            "Beautiful car, look at the smile on your face! Enjoy",
            "Congrats! I used mine as a daily driver when I first got it and its basically the perfect car for that job. You'll love the interior!",
            "Feeling jealous af",
            "That’s a white car I can get behind",
            "Ferry Porsche:\n\nThe last car ever to be built will be a sportscar.\n\nDas letzte Auto, das jemals gebaut wird, wird ein Sportwagen sein."
        ]
    },
    "Oops…": {
        "title": "Oops…",
        "score": 1316,
        "url": "https://i.redd.it/nsg2el79dc9d1.jpeg",
        "content": "",
        "num_comments": 62,
        "comments": [
            "Who took the pic? Are you friends with the cop and just set up a photo op?",
            "The picture reminds me the good old days of Need For Speed 3: Hot Pursuit!",
            "Wait so this isn't Need for Speed Hot Pursuit 2024?\n\nShambles I say, shambles!!!",
            "Damn, I have been pulled over at the same exact spot!",
            "Copss are either A) Super nice when seeing a nice car. I can't even count how many times my dad got \"pulled over\" in one of his cars when I was with him for the cop to just wanna chat about cars for 20 mins. or B) complete jealous douche bags",
            "This is a wholesome post. Love it lol. What is your 911 model?",
            "In the Virginia Governor’s mansion there is a state police office that has a painting that looks just like this.  It’s a red 996 though.  Same angle and everything.",
            "A friend of mine was training to be a traffic cop and told me a story....\n\nThere was a dual carriageway (2 lanes each way - not quite a full freeway but close) that ran through town but has no streetlights at that point.\n\nThey were camped out on a overpass late at night which was usually a snoozefest. (I think it was [here](https://maps.app.goo.gl/XFFxBRZ9CRyu1azf6))\n\nAbout 3am BRRRZzzummmmm...\n\nOlder cop to my pal \"wtf - did you see anything? Whatever that was was going FAST\"\n\n\"Nope - didn't see anything & whatever it was is long gone - we ain't gonna catch em now\".\n\nNext nigh, same overpass, about 3am....\n\nBRRRZzzummmmmm....\n\n\"WTH! I did NOT imagine it that time for sure!!!! But didn't see anything??!!\"\n\nNext night....\n\n\"Right! I'm gonna be ready for this fukker tonight!\" So they park up on the slip road ready to set off at any moment...\n\nAbout 3am...\n\nBRRRZzzummmmmm.\n\nScreech!!!! Off they go in pusuit - \"I still didn't see anything, but I'm gonna catch whoever this little sod is!!\"\n\nEventually they catch up with them at the other end on the road - up near the army ordinance depot....\n\nTurns out it was 2 guys from the army depot with night vision goggles in a black 911 with the lights turned off :D",
            "Not all cops are bad",
            "Always agree with the speed they quote you.  My son's over 100 mph was dropped to \"84\" to prevent greater fines and penalties because he agreed with the CHP."
        ]
    },
    "My 16 GT3RS and my 04 STI. Guess which is faster LOL": {
        "title": "My 16 GT3RS and my 04 STI. Guess which is faster LOL",
        "score": 253,
        "url": "https://www.reddit.com/gallery/1dqzg7f",
        "content": "",
        "num_comments": 39,
        "comments": [
            "Given the flimsy cup holders, where do you keep your vape collection when you’re in the 3RS?",
            "Even if the STi is faster 0-60, the GT3 is gonna run laps on a track 🤣",
            "Guess which one everyone would pick given the choice. ;-)",
            "Could depend on the road? My STi was a panther in the dirt.",
            "I choose Lava Orange, don’t care who’s wearing it.",
            "Honest question:  which one is faster on the track in rain or snow?",
            "The STi looks stock.  I had an STi, and it's not that fast.  So unless it's completely built with 700hp yet still with a tiny exhaust, my money is on the GT3 RS",
            "Selling the Porsche would cover a whole mortgage I bet.",
            "As a former owner or an '04 STi that was stage 2 tuned with bolt-ons. I can tell you that STi would dust the GT3RS. \n\nBut.... I'd much rather track race the GT3. Even my base model Cayman was better on a track than my modded STi. \n\nBTW. Do you have gold BBS wheels for the subie? That always makes me drool and miss mine when I spot an '04 with em.",
            "sti"
        ]
    },
    "Yesterday was a rough day gentlemen": {
        "title": "Yesterday was a rough day gentlemen",
        "score": 714,
        "url": "https://www.reddit.com/gallery/1dqq6pd",
        "content": "Was stationary at a stop sign, someone took a turn straight into my lane. Tried my best to dodge them left but they still hit me. ",
        "num_comments": 103,
        "comments": [
            "I am sorry for your loss. My sincerest condolences.",
            "Not the RS",
            "The other drivers insurance is losing their mind right now trying to figure out how to drop the driver....\n\n\"YOU HIT A WHAT??!?!?\"\n\n  \nHope you and everyone in the car are ok.",
            "Well sounds like insurance will be on your side at least",
            "Exact same thing happened to me but I was in a 981 boxster. Many people on the road should not be driving",
            "Mat Armstrong might be grinning ear to ear!",
            "Kayleigh just had the most expensive white wine and tapas night of her life.",
            "That's an expensive turn that person just made. They will be paying higher premiums for the next decade.",
            "How close to Brampton was this?",
            "For something that high end with that much carbon fiber, I wonder if it would be considered \"totaled?\" If so, what's going to happen? Their insurance cuts a check for butt load of money, replace with the exact same car?  Because the idea of driving a brand new vehicle now with a crash history like this just doesn't sit well."
        ]
    },
    "Saw this smoke show today": {
        "title": "Saw this smoke show today",
        "score": 92,
        "url": "https://i.redd.it/8cyb812k4f9d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Would take this over a modern 911",
            "okay now someone has to explain to me, if the 930 turbo spoiler was an available option for the normal 911 G Model. Or did someone just take a turbo spoiler and mounted it onto this",
            "A statement I’ll stand by until the end of time: those rock guards are only meant for 930 models in either white or red colorways. Period. End of story. \n\nSorry not sorry.",
            "Such a dominant stance. Like a tomcat that rules the block.",
            "That shape is peak design."
        ]
    }
}