{
    "I bet he’s not gonna be late for long": {
        "title": "I bet he’s not gonna be late for long",
        "score": 314,
        "url": "https://i.redd.it/it0t9xt3qg9d1.jpeg",
        "content": "",
        "num_comments": 37,
        "comments": [
            "I feel like the plate used to be on an i8",
            "It’s so hard for UK plates to mean anything at all without spending a shit ton of money, using numbers as letters, or mis-spacing the characters.\n\nThat’s quite a cool one and probably cost the best part of £10k.",
            "maybe he isn’t hungry anymore",
            "And probably used in the Gen Z fashion",
            "Thats what i wondered..what he ate )",
            "The i8 looks like it ate a 911",
            "BMW needed to have brought back the i8 with the same looks (any changes will be worse lbr) with updated drivetrain. Such a stunning futuristic looking vehicle in an actual good futuristic way. ",
            "That's crazy. Make me feel better about splurging on my $50/yr plates",
            "Much more than £10k. 4 digit plates are worth minimum £5k just for being short. A 4 digit plate with a 1 tends to be worth £10k on the low end, even with random letters. A 4 digit plate with a 1 and an actual fully spelled word is worth significantly more. \n\nA 4 digit plate that perfectly spells out a sensical sentence? I guarantee this would sell for £30k minimum.",
            "My favorite was from an old car and Driver magazine that I saw as a teenager. IXLR8"
        ]
    },
    "Most fun I’ve ever had on a test drive": {
        "title": "Most fun I’ve ever had on a test drive",
        "score": 111,
        "url": "https://i.redd.it/ksyk7bn9xh9d1.jpeg",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Not often that you get to drive a cabriolet open in the sunshine in Iceland. Sounds was awesome, handling and control just as I expected",
            "love the wheels, anyone have any idea what they're called?\n\nof course it's the most fun you've ever had op, it's a porsche",
            "Jesus look at that color in the sun",
            "Dreamcar! Will you take it?",
            "911 CARRERA S 3.8\n\nDriven 75.000km, engine has just been refurbished.\n\n2007",
            "Beauty",
            "997 Sport Design wheels"
        ]
    },
    "My 16 GT3RS and my 04 STI. Guess which is faster LOL": {
        "title": "My 16 GT3RS and my 04 STI. Guess which is faster LOL",
        "score": 528,
        "url": "https://www.reddit.com/gallery/1dqzg7f",
        "content": "",
        "num_comments": 88,
        "comments": [
            "Given the flimsy cup holders, where do you keep your vape collection when you’re in the 3RS?",
            "Could depend on the road? My STi was a panther in the dirt.",
            "Even if the STi is faster 0-60, the GT3 is gonna run laps on a track 🤣",
            "Guess which one everyone would pick given the choice. ;-)",
            "I guess the WRX can help him keep up with the rich guys cuz he is is the rich guy",
            "I choose Lava Orange, don’t care who’s wearing it.",
            "Honest question:  which one is faster on the track in rain or snow?",
            "The STi looks stock.  I had an STi, and it's not that fast.  So unless it's completely built with 700hp yet still with a tiny exhaust, my money is on the GT3 RS",
            "Selling the Porsche would cover a whole mortgage I bet.",
            "we know which one you drive like a douche in for sure"
        ]
    },
    "Meet my new daily driver": {
        "title": "Meet my new daily driver",
        "score": 4145,
        "url": "https://i.redd.it/uym5jzb18b9d1.jpeg",
        "content": "",
        "num_comments": 248,
        "comments": [
            "Damn, Sport Classic as a daily!\n\nSo happy for you!!",
            "Beautiful car, look at the smile on your face! Enjoy",
            "Congrats! I used mine as a daily driver when I first got it and its basically the perfect car for that job. You'll love the interior!",
            "That’s a white car I can get behind",
            "Pretty sure I’ve seen you somewhere.  You look quite familiar.",
            "We need more \" fuck you , I'm rich\" posts . Need to amplify the motivation to hustle",
            "Beautiful ride. Wish I could drive it.",
            "Nice man, congratulations also fuck you",
            "You lucky son of a bitch",
            "Holy shit that’s awesome. First 911 I’ve liked the stripe decal on. Very classy."
        ]
    },
    "Oops…": {
        "title": "Oops…",
        "score": 1461,
        "url": "https://i.redd.it/nsg2el79dc9d1.jpeg",
        "content": "",
        "num_comments": 68,
        "comments": [
            "Who took the pic? Are you friends with the cop and just set up a photo op?",
            "The picture reminds me the good old days of Need For Speed 3: Hot Pursuit!",
            "Damn, I have been pulled over at the same exact spot!",
            "Wait so this isn't Need for Speed Hot Pursuit 2024?\n\nShambles I say, shambles!!!",
            "Copss are either A) Super nice when seeing a nice car. I can't even count how many times my dad got \"pulled over\" in one of his cars when I was with him for the cop to just wanna chat about cars for 20 mins. or B) complete jealous douche bags",
            "This is a wholesome post. Love it lol. What is your 911 model?",
            "In the Virginia Governor’s mansion there is a state police office that has a painting that looks just like this.  It’s a red 996 though.  Same angle and everything.",
            "\"Do you know why I pulled you over?\"\n\n\"Because I let you?\"",
            "Not all cops are bad",
            "Always agree with the speed they quote you.  My son's over 100 mph was dropped to \"84\" to prevent greater fines and penalties because he agreed with the CHP."
        ]
    }
}