{
    "/r/Portland Self-Promotion Saturday": {
        "title": "/r/Portland Self-Promotion Saturday",
        "score": 1,
        "url": "https://www.reddit.com/r/Portland/comments/1dr9qug/rportland_selfpromotion_saturday/",
        "content": "Welcome to /r/Portland's Self-Promotion Saturday. While we typically follow Reddit's guidelines regarding [what constitutes spam](https://www.reddit.com/wiki/faq#wiki_what_constitutes_spam.3F) and [self promotion](https://www.reddit.com/wiki/selfpromotion), this is your weekly opportunity to show off what you've created.  \n\nIf you're looking for exposure for your blog, Etsy shop, publication, SoundCloud, podcast, YouTube or Discord channel, Instagram, Kickstarter, stand-alone physical product, website, or fucken (ice cream) cone stand, post it here!\n\nPlease keep in mind that all submissions should either be related to Portland, or made by a Portlander. And please only post your own content -- if it's something you like or made by someone you know, encourage them to post it here themselves. \n\nAll other advertisements outside of this post will continue to be removed [as per our Rule 2.1.](https://www.reddit.com/r/Portland/wiki/index#wiki_what_are_the_rules_for_posting_and_commenting_in_.2Fr.2Fportland.3F)\n\n\nOkay, /r/Portland, let's see what you've got!",
        "num_comments": 0,
        "comments": []
    },
    "Just want to share this fun tree I walked by in SE Portland ": {
        "title": "Just want to share this fun tree I walked by in SE Portland ",
        "score": 425,
        "url": "https://i.redd.it/vq5a7wn3vf9d1.jpeg",
        "content": "",
        "num_comments": 15,
        "comments": [
            "There's also a Totoro about 1 miles south east from there. But, Totoro lives in a person's yard and I won't share any details about it.",
            "Pretty sure its a truly epic weeping Norway spruce. The mask is an amazing addition. I havent seen any weeping spruces that big anywhere else either. Not going to claim its the biggest, but it certainly is the largest I have ever seen.",
            "There is a skeleton on the skyline blvd which they dress up for every season and it is so cool and funny. Wish I could take some pics.",
            "Looks like Kahn from new Avitar.",
            "Gah, was wondering if that might be the case after I posted it! Glad it hadn't gotten old!",
            "YES stoked to one day maybe find it!",
            "Yes, thank you for posting the background! I just assumed everyone got the reference because Portland is such a Japanophile lol",
            "My pleasure! Its a little bit esoteric if people arent familiar with the animation genre. Were lucky on the West Coast to have strong connections to so many art forms across the Pacific",
            "Thanks for your input, the mods have set this subreddit to not allow posts from newly created accounts. Please take the time to build a reputation elsewhere on Reddit and check back soon.\n\n(_)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Portland) if you have any questions or concerns.*",
            "Ahhh. Ahhh. Ahhh."
        ]
    },
    "Shooting at Kaiser Sunnyside": {
        "title": "Shooting at Kaiser Sunnyside",
        "score": 137,
        "url": "https://www.reddit.com/r/Portland/comments/1dr2ok2/shooting_at_kaiser_sunnyside/",
        "content": "Apparent road rage incident leading to a shooting, police have shooter in custody.\n\nHaven’t seen anything on the news yet.",
        "num_comments": 79,
        "comments": [
            "I was at the hospital this evening when this happened. Some sort of major incident in the parking garage. Engines revving, tires screeching, and about 8 shots fired before police flooded the scene about eight seconds later. Not sure how they got there so fast. Hospital was on lockdown this evening.",
            "I was there today. Turns out it was a stolen car chase from home depot and ended in the sunnyside kaiser parking garage. Thats how police were there so fast. The shooter crashed into a car in the garage and was actively shooting at the police.",
            "someone in milwuakie chitchat said their employee said the dude stole a car from home depot parking lot & went there",
            "I see so many people driving so angry - they shouldn't be behind a wheel or have a gun. Both can kill",
            "That wasn't road rage, that was a stolen vehicle ramming police cars",
            "This is why we carry\n\nedit: damn thanks for all the upvotes fam",
            "I was driving down after work and a ton of cop cars were flying into the parking garage. Got in 205 and there were a bunch coming down from Portland too it looked like.",
            "Once you cross the line into Clackamas, its FAFO.",
            "Ew I literally just felt and heard that",
            "Nice! Big waste of tax dollar when all you need is a garbage truck to huck a body or two in."
        ]
    },
    "Cathedral Park’s New Swim Dock Opens Under the St. Johns Bridge | PDX Monthly": {
        "title": "Cathedral Park’s New Swim Dock Opens Under the St. Johns Bridge | PDX Monthly",
        "score": 14,
        "url": "https://www.pdxmonthly.com/news-and-city-life/2024/06/cathedral-park-swim-dock-portland-st-johns",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Last time I was there (last September) there were signs everywhere saying not to let your dogs drink the water cause of toxic algae",
            "Swim with the native fish species the boneless brown trout!\n\nAs a kid we never went near the water since you could always see sewage spilling into upstream",
            "Um not to be a Debbie downer, but the toxic superfund site next door hasnt been fully cleaned up yet. I love swimming, but I would pause on that, and the repeal of chevron from the Supreme Courtit might be awhile.",
            "You should not be drinking it either during your swim.",
            "Thanks for putting this in here. The city would never encourage this dock if it wasnt safe",
            "The contaminants are locked in sediment that is trapped under decades of newer sediment. \n\nThe water itself is not contaminated. Unless you swim to those areas and dig around in the river bottom you are not exposed to those chemicals.\n\nTheres a bunch of horrible crap in the fill under The Pearl from the railyards - unless you excavate down and drink a cup of ground water youre not exposed. Not a perfect analogy but same idea.\n\nThe main impact of the superfund is to make future development/use of the land/river bottom impossible without massive cleanup - because it would stir up all the sediment.\n\nPractically speaking for swimmers - its not a concern."
        ]
    },
    "OHSU Board Approves Plan to Cut More than 500 Jobs": {
        "title": "OHSU Board Approves Plan to Cut More than 500 Jobs",
        "score": 81,
        "url": "https://www.wweek.com/news/health/2024/06/28/ohsu-board-approves-plan-to-cut-more-than-500-jobs/",
        "content": "",
        "num_comments": 16,
        "comments": [
            "It will require sacrifice, and we can expect some tough years, he said.\n\nNot from, or for, the C-suite class.",
            "Laying off 500 people to help raise capital for their Legacy merger. \n\nIf you put one sinking ship on another sinking ship theyre still both going to sink. This is so fucking stupid.",
            "And of course the unemployment office is working at full capacity, on time, no issues, totally ready to handle the influx from this. /s",
            "This is trash!! Meanwhile the  higher-ups are millionaires",
            "If you work there, lets increase the activity over at r/ohsu",
            "Portland is dying a death by a thousand cuts.",
            "Enshitification is an American pass time these days.",
            "Entire healthcare system is. It would be nice if more Americans realized this is an insane way to do healthcare.",
            "This isn't a Portland thing. This is nationwide.",
            "It seems like it's every industry. We need to get rid of the \"middle men\" who, as far as I can tell, don't do anything except lower our pay, cut our jobs, and take our hard-earned money."
        ]
    }
}