{
    "\"You've been banned from PovertyFinance\"": {
        "title": "\"You've been banned from PovertyFinance\"",
        "score": 469,
        "url": "https://www.reddit.com/r/povertyfinance/comments/157vje4/youve_been_banned_from_povertyfinance/",
        "content": "Four months ago I posted the following message on this subreddit due to an increase of shitty people who have not read the rules or the community guidelines:  [https://www.reddit.com/r/povertyfinance/comments/11vwilh/special\\_enforcement\\_period/](https://www.reddit.com/r/povertyfinance/comments/11vwilh/special_enforcement_period/)\n\n&#x200B;\n\nThings have not improved significantly.  As such, these policies are no longer temporary.\n\n&#x200B;\n\nSo here is how it is going to be.  Any infraction can (and most likely will) incur a temp ban.  This is to drive home the point that this shit isn't negotiable.  Duration to be determined by the severity of the infraction, but ranging from 1 to 30 days.\n\nA second offense of the same penalty, or getting numerous offenses across different rules will yield longer temp bans with every infraction.  Users who demonstrate that their offenses are innate or deliberate, rather than accidental or incidental will get a full ban.\n\nParticularly shitty people will get a 365 day ban out the gate.  We believe people can change, but we're going to give them lots of time for it.\n\nOvertly evil people, troll accounts, or bad faith people will be banned outright without warning explanation.\n\n&#x200B;\n\nAs always, all actions can be appealed if you believe they are unfair.  HOWEVER, we expect you to review what you said first, and review the rules as well.  If you think we misinterpreted something, got the wrong guy, or whatever, please appeal on those grounds and we will review it.  If you make a bad-faith appeal, whatever ban you have will be extended.  If you come into modmail asking \"why was I banned\" for an obvious infraction you will get an extension.  And please note that saying \"Other kids were doing it too mom\" is not a valid appeal.  If you think other people need to have action taken on them, report their comments as well.\n\n&#x200B;\n\nWe are a small team.  We can't see everything posted here.  But we sure as hell see all the reports.\n\n&#x200B;\n\n**Edit 1:** Intent matters.  Coming here trying to help and breaking a rule will be viewed very differently than coming here with cruel intentions even if the violation is a soft-ball.  \n\n**Edit 2:** Please understand this is still reddit, an anonymous message board filled with sad, miserable, SMALL people.  We won't be able to prevent shitty people wandering in.  We can see them to the door as quickly as they arrive.  **TAKE AN ACTIVE ROLE IN REPORTING SHITTY COMMENTS.**  That's how we get these bastards, when you point them out to us.  Also, if you see something shitty, report it and move on.  Don't fight with an idiot, because they will lower you to their level, defeat you with experience, and get both of you banned in the process! ",
        "num_comments": 0,
        "comments": []
    },
    "Every time I started to finally be able to put savings aside for a pinball machine had to use it for emergencies. My girlfriend had been secretly saving up to buy me one!": {
        "title": "Every time I started to finally be able to put savings aside for a pinball machine had to use it for emergencies. My girlfriend had been secretly saving up to buy me one!",
        "score": 1246,
        "url": "https://i.redd.it/sfmks6va508d1.jpeg",
        "content": "",
        "num_comments": 72,
        "comments": [
            "Congratulations on your success!\n\nIn an effort to make this subreddit more helpful and supportive, we request that you share the details of where you started from and how you got to this place!  That way other redditors who are in a similar place you were can look to your example, follow your lead, and see some light at the end of the tunnel!\n\nIf you have already done this please ignore this!  Thank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/povertyfinance) if you have any questions or concerns.*",
            "This is so wholesome. Congratulations on owning something you've been dreaming of *and* for having an awesome girlfriend.",
            "How thoughtful! The Jaws theme couldn't be any better!",
            "Awe!! You have a keeper 😊💖",
            "Financée*",
            "She’s the best!!!",
            "i just got full body goosebumps oh my god\n\nI’ve always said the first thing I would buy if I won the lottery is a pin ball machine and jaws is my favourite movie !!!!",
            "Elwin in the house!",
            "Wife material x 100000000",
            "Dude these are like 7-10k! That's crazy!"
        ]
    },
    "Every problem in my life could be solved with money": {
        "title": "Every problem in my life could be solved with money",
        "score": 930,
        "url": "https://www.reddit.com/r/povertyfinance/comments/1dlbxqv/every_problem_in_my_life_could_be_solved_with/",
        "content": "There is literally no problem or concern i have in life right now that money can't solve.\n\nI am so broke that it's not even funny, I feel extremely jealous of people who never have to work another day in their life. \n\nYet rich people say all the time that money doesn't buy happiness.\n\nMost certainly in most cases it does. I'd rather cry being rich, never having to worry about bills, being able to do whatever I want, than in my current state...",
        "num_comments": 214,
        "comments": [
            "\"Money can't buy you happiness.  Poverty can't buy you anything\". - my Dad",
            "Money is like vitamins.\n\nIf you don't have enough, you have tons of problems. Constant struggles for things that people without a vitamin shortage can't even understand.\n\nIf you take enough vitamins, all of those issues go away. It will leave other potential issues, but there all easier to handle when you're not struggling with other, more fundamental issues.\n\nTaking more vitamins won't help your other problems, but it will free you up mentally and emotionally to better deal with whatever else you have going on.",
            "Money could/would solve 98% of the problems in my life.",
            "money don’t buy happiness is somehing to say to cope with being poor. it’s cognitive dissonance. the more shit you talk about something, the easier it is to cope with not having it. anyone telling you money don’t buy happiness is lying. Get the money then worry about the happiness later. until then money is the only thing!! get that straight into your skull",
            "Easier to work on self care and all the things you can’t fix with money when you aren’t working 2 jobs (or more) for life essentials. \n\nI get what you mean with this post and your feelings are valid.",
            "Whomever said money can’t buy happiness is selling something and full of shit.",
            "Had a pay day recently and instantly relieved so much stress. Sometimes it is that simple.",
            "Do you know why they say money doesn’t buy happiness? It’s because you can’t always buy or spend your way out of less tangible problems: mental illness, relationship issues and family dynamics, addictions, trauma.  \n\nAnd any high you get from spending money on material things gets harder and harder to achieve and doesn’t last.\n\nWhat money affords you is choices without duress. Plenty of rich people hate their lives or commit suicide. And there are poor people loving life.",
            "Money doesn’t buy happiness, but it does buy security.",
            "I would like just $300 extra to pay my utilities every month. Food pantries I’m getting used to. And enough to cover an occasional veterinary bill."
        ]
    },
    "More Disabled Americans Are Employed, Thanks to Remote Work": {
        "title": "More Disabled Americans Are Employed, Thanks to Remote Work",
        "score": 291,
        "url": "https://www.bloomberg.com/news/articles/2024-06-20/remote-work-helps-more-people-with-disabilities-get-employed",
        "content": "",
        "num_comments": 9,
        "comments": [
            "Does anyone have advice for my 57 year old blind father? He currently doesn't have any skills or anything, he's been on disability since he lost vision in his 20s\n\nEverything I've found for remote work just screams at me it's a scam when I've searched in the past\n\nHe can use a computer with programs that read what's on the screen and can make phone calls",
            "Sorry, I have no leads but I bet he could totally do call center work.",
            "Ye but how many r prob lucky to have stable housing or a good support network. Possibly living with fam only working part time.",
            "If you’re in the USA, check out your state’s vocational rehabilitation agency. They’ll likely have a visually impaired branch. There’s tons of adaptive equipment/software available nowadays, and they will help train, too. If he needs orientation and mobility training, they should be able to do that too, among other things like just basic activities for daily life.",
            "Maybe you should ask a social worker? Does he read braille? Maybe he can do something involving braille.",
            "Sounds like he might be perfect for some customer service jobs or bill collection jobs.",
            "If you are in California check out the department of rehabilitation. I'm not sure what other states offer but there may be equivalent agencies",
            "Phone sex worker",
            "Had a friend that worked at a call center and three of his coworkers were vision-impaired, not sure if they were legally blind but two had to use a Braille touchpad thing."
        ]
    },
    "Got called a bum by a girl I like": {
        "title": "Got called a bum by a girl I like",
        "score": 5819,
        "url": "https://www.reddit.com/r/povertyfinance/comments/1dku1lu/got_called_a_bum_by_a_girl_i_like/",
        "content": "I (30M) recently, finally went on a date after a while with a girl that I really like. We met through mutual friends and I decided to take her out to dinner yesterday to just a local restaurant that's near my apartment. Throughout the entire date, she would constantly ask me where I work, how much I make and my career goals. I am currently not facing the best financial situation, I work retail and food delivery on the side and trying to pay off a lot of debt. I immediately could tell that when I told her about my financial situation, it seemed as if she lost all interest in me all of a sudden.\n\nI asked her where she works and she told me that she is currently not working and she strongly believes that women should be not working and men should be their providers. Of course, everyone has the right to think what they believe is right, but I just simply mentioned that in this economy, it is currently extremely difficult to be the sole breadwinner, to which she immediately responded that only lazy men think like that.\n\nThe date went relatively ok after that, but this morning I texted her saying that it was cool going out with her yesterday and maybe we should see each other one more time. To which she responded, \"I'm sorry but I am looking for a long term relationship and you clearly are not on the level that I would like my partner to be. I don't mean to sound harsh, but I don't want to build a family with a bum\"\n\nAnyways, dating while poor is extremely difficult. It's probably one of the hardest parts about being poor if you are still single. ",
        "num_comments": 130,
        "comments": [
            "Mod note:  Someone being horrid doesn't give any of us license to be horrid as well.  \n\n&#x200B;\n\nI'm locking this thread and might purge all the people talking shit about strangers.  That is all.",
            "Why would you even pursue her still the day after?",
            "I'm afraid you learned the wrong lesson from this event.  It's not that it's hard finding someone while you're poor.  The take away from this is that it's EASY to weed out (some) the unsuitable people when you're poor.\n\nWhen all is said and done, what are you looking for?  Do you want a partner who is in this struggle with you 100%, who shares your hopes and dreams and wants to work with you to achieve them?  Or are you looking for someone who will leave you when things get tough (and trust me, they will) but who is really hot looking?\n\nThis person came out and said that she's the 2nd type right off the bat.  That's a good thing.",
            "I would not want anything to do with a girl that calls me a bum. Find someone else brother, pursuing her would most likely not end well. Don’t let your experience with her affect you either, anybody that’s working to make ends meet or to work towards a goal, or paying off a debt in your situation, deserves respect, bc you’re at least working to improve your situation. She’s not worth it, find someone who values you for who you are, not for your net worth.",
            "Sounds like you dodged a bullet brother.\n\nif she finds someone who meets her criteria she's going to be a financially draining in the relationship. Not a good quality in a relationship",
            "Even when I was in my best financial situation, those are a lot of red flags. I want a partner who has their own career goals and professional desires.",
            "Ummm, based on what I read, you are working and she in not.  It is an overused term, but she is literally a gold  digger.  She quizzed you about how much you made and wants to live off a guy.",
            "You didn’t dodge a bullet, but you dodged a missile.",
            "Why on earth would you want a second date with a gold digger ",
            "Why in the name of Sarah Jessica Parker would you call her for a second date?"
        ]
    }
}