{
    "PPC Salary Survey 2024 Final Report - 1,000+ Responses This Year": {
        "title": "PPC Salary Survey 2024 Final Report - 1,000+ Responses This Year",
        "score": 163,
        "url": "https://www.reddit.com/r/PPC/comments/1bcuqf9/ppc_salary_survey_2024_final_report_1000/",
        "content": "Howdy Y'All\n\nWe crossed the 1,000 mile mark. Feels like a huge win for us. We got 1,060 responses this year, which makes it our best year to date. 2023 was our next best year at 902  responses. Countries/regions are listed in alphabetical as we got 100+ slides.\n\nI redesigned our 5 year trending median salary chart. For reporting, the bar is 20 for the USA and 10 for the rest of world to show a country, region, province/state or a city.\n\nI want to give a special shout out to Spain and India for both cracking the top 6 countries, which gave us the most responses this year. Both countries are giving Australia & Germany a run for their money (in terms of responses we get). This is the first time that a new country has cracked the top 6.\n\n**Some Notes**\n\n* India more than 2x their responses since 2023 and 2022. We gave them their own section this year. Please keep showing up if you are based in India\n* Top 6 countries now has a slide to show how much data we get from each one\n* Remote work seems to be decreasing. A lot less currency conversions to do this year. Is remote going back to a niche thing?\n* Some people have 1-3 years experience in paid but having been working for 8-10 years, thus they can skew salaries higher.\n* Some people include their bonus in their salaries I imagine. This can make their salary higher then someone who might not have. Hence why we try to use the median salary across all reports\n\n**Results Served Two Ways**\n\n[Google Slides 2024 Salary Survey](https://docs.google.com/presentation/d/1jobUKJQcQhvPe8TAwfpc0z5OOCNCjFDq7XZC__aOL8Y/edit?usp=sharing)\n\n**or**\n\n[PDF 2024 Salary Survey](https://drive.google.com/file/d/1GpFnUIXryxwY9PavADu5lfkm3X8QW9yu/view?usp=drive_link)\n\nThanks  you for helping make this happen. I spend a couple weeks on this project each year and it's truly interesting to see the data doing this labour of love project.\n\nIf you see a mistake or you think something is off, let me know in the comments or DM me and I'll look into it. This folder has [past salary survey](https://drive.google.com/drive/folders/1gQIsjgag-E0nAgHoR5w7iufHmtRfP-JB?usp=share_link) results.\n\n&#x200B;\n\nP.S. If you want to hear about Salary Survey 2025 and haven't already given your email, sign up for the [salary survey newsletter](https://mailchi.mp/42de06bcc4a5/salary-survey-newsletter).\n\n&#x200B;",
        "num_comments": 68,
        "comments": [
            "Thank you for this work!",
            "Whoever is making 919k freelancing - holy moly great job!",
            "To you agency people making $662k and $740k... that's gotta be like, agency owners, right? \n\nOr just some stupid rediculous performance bonuses?",
            "Thanks Duane! Last year's helped me advocate for a bump in pay. Saw you on a Optmyzr PPC Town Hall video recently, keep it up!",
            "Thanks for doing this work. AU and India agency max salaries of $440k or so sounds like some are owners and not employees.\n\nWas surprised how many were from agency. Posts on here tend to be from freelancers- maybe it's the cohort most likely seeking advice or sense checking with peers? Agency folks can just hit up a colleague or manager to bounce ideas around",
            "Our community needs more responses from women. Without the volume being closer to the men's, it is really unclear what is causing such differences in salaries.\n\nMaybe it's just reflective of the demographics of reddit though? 🤷‍♀️",
            "Good work!",
            "Thanks as always Duane 🙌",
            "thanks for the great work!",
            "Thanks for the work, it is helpful."
        ]
    },
    "Google removing the credit card payment option for thousands of small businesses is a monopolistic travesty.": {
        "title": "Google removing the credit card payment option for thousands of small businesses is a monopolistic travesty.",
        "score": 266,
        "url": "https://www.reddit.com/r/PPC/comments/1dfyzui/google_removing_the_credit_card_payment_option/",
        "content": "As I'm sure many of you know by now, Google has announced a major change to their acceptable forms of payment. They will be forcing tens of thousands of small businesses across the country to pay for their advertising service by invoice or debit rather than credit card. This change will strip countless \"little guys\" of their cash back offers on credit cards. These cash back incentives help keep the lights on. For us, it's literally a line on our profit and loss sheet.\n\nWhy is Google doing this? Oh, they're doing it for us! From the mailer:\n\n>The [Monthly Invoicing](https://notifications.google.com/g/p/ANiao5pqHLrUlLt159M2dZ0hyUs4tSBSTIn65DIq5yNdwWpJhk9bwbJ5ThcBNZnWNaO1IQV3vwIGVJ-BlFcQlEuqxvGQrYcDne8PUwZK_Z8ynxlSrDU9wsAGgVNJcg35f5B3EFLPkRgyi_7i94MwkkKOlN65BdWUlQU9UqxJGT-SbT_AHSfyE-E_f5aazfl9HV-aUlNkDU0yNuMOxmA99-5MXZsq2HT66jL7ZgfQFApD7W_E9yNSVjnIyW0S5pzsS5t8pATZ43pIwe7j1A) billing method is best suited for your account(s) given the flexibility it provides high-growth customers (e.g. access to a credit line, monthly invoices with 30 days to pay, greater control over spend, more reliable).\n\nWhat the fuck is this copyrighter talking about? \"Greater control over spend. More reliable.\" Feels like he was really running out of steam selling this bullshit.\n\nThe reason Google is doing this is obvious: To make a zillionth of a % point more in profit this quarter.\n\nI'm here for one reason: Rally the fucking troops.\n\nI implore anyone reading this with an ounce of fight in their veins to kick up shit with whatever rep you know best at Google. There is no chance any one of us can make a difference, but if we can get a large community of people screaming we can at least make the Monopoly Man squirm.\n\nAre you with me???\n\n<insert american flag being held by big muscle guy here in your brain>\n",
        "num_comments": 158,
        "comments": [
            "Why would they do this, they're making tonnes of money credit card fees shouldn't be an issue for them.",
            "We haven't been impacted (or seen any emails yet) yet but this is super lame. There are several clients who will be very uncomfortable with this option. Especially with how Google does jack shit for click fraud. Credit card provides a last layer of protection for the advertiser.\n\nedit: Maybe, on the hopeful side, they're testing this out to see how people respond as there hasn't been an official announcement. \n\nIf so : GOOGLE THIS IS SHIT",
            "My organization just absorbed a competitor with a $5million per year budget. $3million of it done with credit cards. This company we absorbed used an agency for everything - including all Google Ads.  The agency owns the account.  They had several credit cards that are all in rotation.  It’s wild.  I have been doing this since before AdWords ever existed and never seen this before.  I don’t know why the agency managed billing in this manner - perhaps they couldn’t get approval to invoice the entire amount?\n\nAnyhow, the agency also got this notice but we are already moving their accounts into our own so it’s a non issue for us.  My point being it’s not only the small businesses getting this notice.\n\nEdit: corrected the credit card spend.",
            "I have a few small clients with less than 1000 USD ad spend getting this email too\n\nThe thing is … some people live on credit and don’t have like the 5k ad spend until they sell x products or make a commission check. \n\nI think this will kill some mom and pop businesses",
            "I am impressed they didn't open their own bank/payment processor to benefit from the fees but instead they did this which will make them lose clients",
            "Google needs to understand that offering credit card payments is a huge benefit to small businesses with uncertain or irregular cash flow.\n\n**Please contact your elected officials**. Also contact Sen. Mike Lee of Utah, who has done a good job of challenging Google (I'm not a Mike Lee fan, but the guy has authored some legislation to try and reel Google in and it's sorely needed).",
            "Now imagine a reality where everyone is finally moved on “Monthly Invoicing”, and then Google decides it’s too risky, and rejects credit limit increase or worse scales back the credit limits they approved for accounts, next minute you need to make daily/weekly bank deposits just to keep your account within _Googles Defined_ credit limit if you want any chance of scaling your business. Before you know you need to make bank deposit repayments every other day, effectively 2 days credit facility and getting zero Card Protection / Benefits for it…",
            "We lost, they have our a$$",
            "I'm totally with you but let's face it, google doesn't give a fuck about those spending less than a million or so per year",
            "This is a really bad thing for Google to force this on business owners, many of which rely on credit cards and even some rewards from credit cards, to run their business. This is essentially another example of Google's monopolistic behavior. I think all advertisers should band together and complain to their Google reps and make noise in the media about this. We should all spend less and lower our bids if they continue down this road, and vote with our wallets! Let's get our Congressmen involved to tackle this anti-business unilateral behavior which might even be illegal. Let's band together and spread the word far and wide about this that we don't agree with this and it will cause everyone to spend less with Google. As a business owner, I feel like this is absolutely an over - reach by Google and a prime example of corporate greed on their part. Google needs to hear advertisers screaming about this issue...in their support channels, with account reps, in the media and places like this forum. We should all move over to the Google ads support forums and complain their as well. We shouldn't stop until the reverse this terrible decision!"
        ]
    },
    "PMax vs Classic Shopping Campaigns": {
        "title": "PMax vs Classic Shopping Campaigns",
        "score": 5,
        "url": "https://www.reddit.com/r/PPC/comments/1dr2vs9/pmax_vs_classic_shopping_campaigns/",
        "content": "*this is not a complaining post so bear with me*\n\nI have a couple of years since I was using PMax campaigns for my store (edible decorations manufacturer company). In the last months, sales dropped big time. I thought “maybe I’m doing something wrong”, I started to read all forums, groups, got in touch with several companies (even people from Google Ads), nothing really helped.\nBasically, no matter the strategy I want to use, Google will eat my money, send tons of useless traffic and get just a couple of small orders. I checked everything, signals, tags, tag manager, headlines, pictures, videos, absolutely anything.\nThe shop is on Shopify, it’s almost 6 years old, we have lots of customers database, GA4, everything works together, no errors. \n\nAnyway, here, on this sub, I saw some discussion where someone recommended to use a search campaign + classic shopping campaign instead PMax. I said “what the …” and give it a try. \nWell, what can I say, I have at least similar or even better results at a fraction of the price. Now it’s up to me to improve especially the searching campaign since the classic shopping campaign can’t be customized too much (and that’s a good thing). \n\nMy point is: if you see some bad results lately, just give it a try, for 1-2 weeks and, even if you won’t see an increase in your orders number, at least you will pay much less than running a PMax campaign. At least this happened for me.\n\n*sorry for my poor English, not a native speaker",
        "num_comments": 1,
        "comments": [
            "PMax is great but it can be harder to use and sometimes does not work for all ad account. Nothing wrong with using search campaigns and shopping campaigns to make your business more money and get conversions. We still use both campaigns types and PMax where it makes sense for clients."
        ]
    },
    "We are low ticket SaaS - looking for the absolute best Google Ad Manager": {
        "title": "We are low ticket SaaS - looking for the absolute best Google Ad Manager",
        "score": 57,
        "url": "https://www.reddit.com/r/PPC/comments/1dqtjh4/we_are_low_ticket_saas_looking_for_the_absolute/",
        "content": "We are a VC backed startup that is low-ticket SaaS. We have a very sticky product, and our competitive advantage is strong. However, the industry we're operating in is quite saturated.\n\nWe are looking to launch on this channel for the first time.\n\nDoes anyone have recommendations for Google Ad consultancy? We are looking for the very best. No agencies, no juniors, no \"experts\" that don't have a background outside of their agency.\n\nAny finds would be greatly appreciated. Or if there's \"legends\" I should be aware of and reach out to.\n\nEDIT: Starting spend budget of $15k per month. We can easily and quickly scale this once success is identified.",
        "num_comments": 34,
        "comments": [
            "I'm being honest: You should probably spend that 15k on making the best training videos possible. Ads aren't going to work well if everything in your funnel isn't already.",
            "No “experts” only “legends”, got it.\n\nBut honestly, google ads is easy. Finding your competitve advantage and crafting ads/landing pages around your target audience and the problems you’re solving is the hard part.",
            "Good luck to you. The absolute best are working for the bigger SaaS as their in-house PPC team lead or even head of acquisition type roles (never a one man gig at the larger end of town), on packages that are cushy enough that taking on extra work isn't viable. So you'll need to do a song and dance and poach directly from whoever leads PPC at Atlassian, Hubspot, Adobe, Salesforce, Xero etc. Might be viable given $$$.\n\nOtherwise may need to need to manage your expectations and be open to those who are acceptable or good, or some SaaS experience with lesser known products or verticals.",
            "You need to temper your expectations, as the absolute best are not going to jump ship (or take on a side gig) for an unproven $15k/month account. That's only one step above small business.\n\nLikewise you can safely ignore all the people in the comments clamoring for your business.\n\nThe fact you're asking on Reddit rather than recruiting through business channels already suggests problems at your org.",
            "Solutions 8 has been around for a long time. They're not cheap tho.",
            "I don’t mean to be rude but when you say “we want the best…. and we are prepared to spend 15k/mo” 🤦. The best don’t work with a 15k budget, we manage millions in roi+ ad spend per month. 15k is a part time side gig for someone who knows what they are doing. You would be better off hiring a highly experienced person for a 10-20/hours a week contract to do the initial scaling and then bringing on a junior role with ROI+ ad scaling experience who is smart and can learn from their mistakes. If the contractor is open they can mentor and the junior role or be prepared to hire/fire fast or blow through cash.",
            "Being VC backed means you will be able to afford the higher end rates in our [community salary survey](https://www.reddit.com/r/PPC/comments/1bcuqf9/ppc_salary_survey_2024_final_report_1000/).",
            "What's your media budget? (give a range of expected media dollars you'll spend in a typically month/quarter)",
            "Feel free to DM me. I have done this several times for teams in house and I’m a bit bored with my job. My background is SEO, PPC, and growth traction channels.",
            "DM me if you need help - I’ve started a few companies and managed many, many Google and other paid media campaigns"
        ]
    },
    "Criminal Lawyer Google Ads Structure suggestions": {
        "title": "Criminal Lawyer Google Ads Structure suggestions",
        "score": 2,
        "url": "https://www.reddit.com/r/PPC/comments/1dr3zom/criminal_lawyer_google_ads_structure_suggestions/",
        "content": "Hey guys, I am hoping to gather some insights here. How would you structure a Google Ads campaign for a criminal lawyer that serves 5 cities within the same province? So there are 4 practice areas (dui, assault etc) we'd like to run ads for and should target the 5 cities.\n\nOption #1: City based campaigns and practice areas in the ad group?\n\nOption #2: Practice area based campaigns\n\n\n\nMonthly budget is 10K$",
        "num_comments": 4,
        "comments": [
            "I would go with option #1 since it would help the ads be more personalized to individual locations.",
            "Option 2 because you'll be able to personalise your ads with practice location, amenities, etc.",
            "Expert in this area. #1",
            "If you plan to target separate locations that will need 2 separate campaigns. Within a campaign, I mean on ad group level, I don't think we have the option to keep separate locations."
        ]
    }
}