{
    "Secondaries Directory (2024-2025)": {
        "title": "Secondaries Directory (2024-2025)",
        "score": 72,
        "url": "https://www.reddit.com/r/premed/comments/1d9oln4/secondaries_directory_20242025/",
        "content": "# Welcome to the 2025 application cycle!\n\nAMCAS, AACOMAS, and TMDSAS are all open for submission[.](https://imgur.com/a/pMgZxRU) If you've had a chance to submit your primary application and want to get ahead on writing secondary essays, this post is for you. Verified AMCAS applications will be transmitted to schools on **June 28th** at 7 am EST. AACOMAS applications are sent to schools as soon as you're verified. Same for TMDSAS.\n\nIf you want to track how far along AMCAS is with verification you can check the following:\n\n* [The AMCAS Verification Tracker](https://amcas-tracker.hpsa.org/)\n* [The sidebar of AAMC's AMCAS information page](https://students-residents.aamc.org/applying-medical-school-amcas/applying-medical-school-amcas)\n\nHere are some resources you can use to prewrite essays, track which schools have sent out secondaries, and monitors schools' progress through the cycle.\n\n**Student Doctor Network (SDN):**\n\n* 2024-2025 Threads: [MD Schools](https://forums.studentdoctor.net/forums/2023-2024-md-medical-school-specific-discussions.1198/) and [DO Schools](https://forums.studentdoctor.net/forums/2023-2024-do-medical-school-specific-discussions.1199/)\n* 2023-2024 Threads: [MD Schools](https://forums.studentdoctor.net/forums/md-medical-school-specific-discussions-prior-years.962/) and [DO Schools](https://forums.studentdoctor.net/forums/osteopathic-medical-school-discussions-prior-years.603/)\n\nI recommend you follow all the current cycle threads for your school list. Once secondaries have been sent, the prompts will be posted and edited in to the first comment in the thread. If secondaries have not been posted yet this year, refer to last cycle's threads for prewriting.\n\n**Reminder of Rule 10: Use SDN school-specific threads for school-specific questions.**\n\nThe biggest issue with Reddit is that it is not organized to track information longitudinally. Popular posts get buried after a day or two. Even if you do not like SDN, it is set up better for the organization of information by school over time. We will still ask that you use SDN school-specific threads for school-specific questions and discussion, sorry.\n\n**Consider using** [**CycleTrack**](https://cycletrack.org/)**!**\n\n* [Explanation of CycleTrack](https://www.reddit.com/r/premed/comments/uxo150/cycletrack_an_application_cycle_tracker_and/)\n* [CycleTrack School Explorer](https://cycletrack.org/explorer)\n\nCreated by [u/DanielRunsMSN](https://www.reddit.com/user/DanielRunsMSN/) and [/u/Infamous-Sail-1](https://www.reddit.com/user/Infamous-Sail-1), both MD/PhD students, \"[CycleTrack](https://cycletrack.org/) is a free tool for creating school lists, tracking application cycle actions, visualizing your cycle with graphs and contributing your de-identified data to make the application process more transparent and more accessible.\"\n\nGood luck this cycle everyone!",
        "num_comments": 18,
        "comments": [
            "What other medical schools have released their secondary prompts in advance? Right now, I know UChicago and UMichigan have them on their website.",
            "Sidney Kimmel is asking for ACT/SAT scores. Luckily, I can access them, but I don't know if I should include my scores from my best test or the best score on each section from different tests. Anyone know?",
            "NYU Grossman secondary portal required all three of the last questions, but their website says to only answer one of three. Anyone know what to do?",
            "Thank you so much for the post. I appreciate the advice and look forward to this cycle!",
            "where r u seeing u mich secondaries ?",
            "This is likely to be for data collection purposes only and will have no impact on your evaluation as an applicant.",
            "I emailed SKMC and asked. They replied that scores are not required and to put zeros in the text box if I am not submitting.",
            "Western MI and Mayo too",
            "Do you mind sending me the link? I can't find it",
            "Where can I find the one for Western Michigan?"
        ]
    },
    "Weekly Essay Help - Week of June 23, 2024": {
        "title": "Weekly Essay Help - Week of June 23, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/premed/comments/1dmkkef/weekly_essay_help_week_of_june_23_2024/",
        "content": "Hi everyone!\n\nIt's time for our weekly essay help thread!\n\nPlease **use this thread to request feedback on your essays**, including your personal statement, work/activities descriptions, most meaningful activity essays, and secondary application essays. **All other posts requesting essay feedback will be removed.**\n\nBefore asking for help writing an application essay, please read through our [**\"Essays\" wiki page**](https://www.reddit.com/r/premed/wiki/essays) which covers both the personal statement and secondary application essays. It also includes links to previous posts/guides that have been helpful to users in the past.\n\n**Please be respectful in giving and receiving feedback, and remember to take all feedback with a grain of salt.** Whether someone is applying this cycle or has already been admitted in a previous cycle does not inherently make them a better writer or more suited to provide feedback than another person. If you are a current or previous medical student who has served on a med school's admissions committee, please make that clear when you are offering to provide feedback to current applicants.\n\nReminder of Rule 7 which prohibits advertising and/or self-promotion. Anyone requesting payment for essay review should be reported to the moderators and will be banned from the subreddit.\n\nGood luck!",
        "num_comments": 65,
        "comments": [
            "Hi, would anyone be willing to look over one of my most meaningful remarks? I am having trouble deciding which direction I should take it. Thank you!",
            "Anyone wanna help a girl out and swap secondaries???? I've been looking at them from days and genuinely I have no concept of how they are / what they are saying. Also down to make a group if anyone would be interested :)",
            "Hi all, I created a group of 3-4 people who are actively swapping secondaries as we are writing. If anyone would be interested (need to be active with swaps and good comments), let me now.",
            "Anyone willing to read a personal statement? I'm also willing to swap!",
            "hey shawtys, could someone look over my challenge essay for my secondaries? I am feeling self-conscious that it isn't very strong tbh. Just looking over the idea and how I reflect on the challenge rather than grammar corrections. please+thank you! also willing to swap!",
            "Hi! Would anyone be able to read over my PS please and give feedback? I'm looking to submit soon & happy to swap as well!",
            "Could someone look over some secondaries for me? I'm not sure they're strong enough and would like some other opinions. willing to swap :)",
            "Hi! Just finished a rough draft of my personal statement and tried to be concise yet descriptive. BUT I feel like I'm missing a whole lot! Any help would be appreciated, just need some different POV's!!",
            "Can someone please take a look at my PS? Im a reapplicant",
            "im struggling can someone help me pelasepdklm,."
        ]
    },
    "pi denying lor after 4 yrs/1000s of hours of working w/ him": {
        "title": "pi denying lor after 4 yrs/1000s of hours of working w/ him",
        "score": 103,
        "url": "https://www.reddit.com/r/premed/comments/1dr4s58/pi_denying_lor_after_4_yrs1000s_of_hours_of/",
        "content": "im applying md & md/phd next cycle my pi (md) refuses to write me an lor after 2000+ hours (4 yrs) of working for him bc my job performance declined after my father had a stroke and i got out of a physically abusive relationship. he said he recognizes that i did a lot of amazing work for him, **such as publishing 9 papers, winning several national awards for his startup, and creating my own study from scratch**, but he can't write me a lor bc he had to remind me to do things several times & i didn't do them exactly on his timeline. i recognize that i could have done better, but i was quite literally broken from being harassed/stalked by my abusive partner for 2 yrs & caring for my father when he had a stroke, which he knew about. he said he knows i had a hard time but that he cares about results/outcomes & wants me to come back in 6 months to work for him unpaid if im ready to be 100% committed to him bc he thinks i have the skills to \"do better\". he suggested i ask my gap-yr pi to write my composite letter instead, even though i haven't started working for her yet.\n\nmy program director (PhD), who is also the director of the cancer center, said my pi is fucking insane & offered me a letter, in which he would address that my pi is insanely difficult to work with & how hard i worked for 4 yrs to deal w/ his shit. the pd said that he'd write how every undergrad was kicked out of my lab or quit after a few months bc of my pi's extreme conduct. he's not sure if it will be enough to push my application through for md/phd bc it requires a letter from every pi. he also stated that my pi has unrealistic expectations & is manipulating me w/ this \"come back in 6 months deal\".\n\n1. how much will this impact my application for md & md/phd? im worried its going to be a huge red flag to adcoms.\n2. will it hurt my application that my composite letter will be from my program director, whos a PhD, not an md?\n3. is it a good idea for my program director to address my pi's behavior in his letter or will it make me look controversial?\n4. should i go back after 6 months? i have a full-time job & am taking the mcat in jan as well. \n\ni apologize if this is neurotic but im heartbroken and have been crying for 72 hours straight. for 4 yrs, i changed my classes, entire schedule, begged profs to reschedule exams and turned my entire life around to meet my pi's demands, so i was banking on his recommendation for med school. i spent thousands of dollars on travel expenses to help him launch his startup bc i won every award that i applied for his startup.\n\n**i feel immensely taken advantage of & cannot believe that after 4 yrs of working w/ me, he cannot come up w a single reason why i deserve to be a physician or physician scientist. if i couldn't convince him in 4 yrs, how am i supposed to convince an adcom?**",
        "num_comments": 14,
        "comments": [
            "Commenting so this gets pushed up so more people with relevant experience can see it. I would also see if any ADCOMs on SDN can help you.",
            "So first off, you are right to be feeling like you're freaking out. You work for a man for 4 years and what? He betrays you and throws you under the bus. I was in a situation a little bit like this BUT the fact that the PD is willing to write you a letter is great! This set-back is taken care of thanks to them and your plans should still be on track. \n\nHaving the PD insult or speak poorly of the dreadful doc may not be optimal though, maybe rewording it to say you excelled in a program/environment with a high rate of attrition would work better? It would still indicate tenacity and serious dedication, which are things you definitely possess.",
            "Cut your losses with the PI. There is no convincing him, and even if you did, that is not a letter I would trust to send without reading it beforehand. \nI would stay away from anything negative in applications, especially LOR. Dont play into the my Pi sucks angle, even though its true. Just showcase your accomplishments and hard work",
            "What field are you in and how do you have 9 pubs?",
            "Your program director will take care of it and hes in a higher position than your PI. I dont think you have anything to worry about. I understand that your PI has basically been gaslighting and abusive to you for nearing half a decade so youre feeling down on yourself.\n\nThe key reason why you CAN convince an adcom and not this PI is because adcoms are reasonable people and your PI is not. No matter what you did, it would never be enough for your PI. Thats not your failure but their unrealistic and inflexible expectations. Meanwhile adcoms are groups of people that, believe it or not, actually want to recruit great talent like yourself to their medical school.",
            "What an absolute motherfucker. Is there anyone in your program who handles student-faculty conflicts? It seems like this needs to be handled at a higher level. Not saying youll get the letter you deserve from this guy but at least youd get something to check the letter box that combined w the letter from the program director and your publication list would do the job",
            "Man this is heartbreaking. I cant imagine how youre feeling right now. This shit sucks why are some people so cruel and heartless?",
            "Very cool! Really proud of you nonetheless, mind if I dm you? (not for advice just feel like wed get along)",
            "go for it! will try and respond when i get a chance",
            "This sucks lol, but can said director write a letter that doesnt shit on your PI?\n\nIs MSTP your first choice?\n\nAnd dont go back to this gaslighting asshole.\n\nAnd most people are just asses who think theyre better than everyone. Some people on adcom are the same, but thankfully admin wont allow them to admit 0 ppl, so they have to accept someone lmfao."
        ]
    },
    "ur unique!! ur special!!": {
        "title": "ur unique!! ur special!!",
        "score": 162,
        "url": "https://i.redd.it/tkt3m2vrye9d1.jpeg",
        "content": "ucsd adcoms sent me their secondaries today and seems like someone forgot to change the school names in their essays 🤨",
        "num_comments": 15,
        "comments": [
            "What a unique name, interviewers are definitely gonna ask about this!",
            "some devs are gonna hear a bunch next week lol",
            "Wow don't dox yourself bro",
            "Woahhhh its strange, your parents gave you the same name as me. Even have the double brackets and everything",
            "This just shows how money hungry they are. HAWKS",
            "aw man havent gotten mine yet  did i get screened out or do they just send it in waves?",
            "At least you got one lmao. Still waiting on mine",
            "good luck! I remember the feeling of being scared but it will all work out.",
            "Hahaha last year I got waitlisted there and their email notifying me of the decision began with Dear PREFERREDFIRSTNAME : ",
            "LOL thats so funny they dont seem to have changed"
        ]
    },
    "Which medical school has the best culture? ": {
        "title": "Which medical school has the best culture? ",
        "score": 185,
        "url": "https://www.reddit.com/r/premed/comments/1dqutxx/which_medical_school_has_the_best_culture/",
        "content": "As we enter secondary season and the gunners are entering battle, I want to hear YOUR thoughts on this question.  \n   \nIt will be subjective so don't worry about that.  \n  \nI'll go first: UCLA has the best culture because it is based in Los Angeles, which resembles Los Santos.  I think the landscape is second to none and I have at least 500 hr complete on GTA V so I know for sure.  There is no other medical school where I can be studying krebs cycle while reminiscing of the good ol' days where I conpleted the Fleeca Bank heist in Blaine County.     \n   \nI prefer this to the grimy but honorable vibe that GTA IV esqe schools give off such as Downstate.  Dowstate though does have a place in my heart because the immigrant serving mission would have been of use to Niko and Roman.  Also, lots of things to do in NYC like bowling with your cousin. The reason Downstate isn't #1 is that they weren't able to provide the mental health to save Niko.  Altogether, UCLA has easily the best culture based on my diverse, equitable, and inclusive experiences.   \n   \nHonorable mentions:  \n- UCR - Loyalty so commendable, it has made a reputation for it nationwide.  They don't even let the Bay Area or LA cornballs come in, spectacular    \n- George Washington - Pretty gangster to have your school printed on all US $1 bills.  \n- UMiami - So cool they chose to make the next GTA here.  \n- Wake Forest - CP3 played here.  ",
        "num_comments": 72,
        "comments": [
            "The school with the best culture is the one that admitted me :)",
            "Oooooh I hope this blows up because I would 100% read 1000s of comments on all the tea ",
            "Yale is well known for being the most chill and relaxed.",
            "Downstate that way fr fr. I grew up in that neighborhood and it do be wildin that way in Brooklyn. Istg when it gets to my cycle I'ma apply everywhere BUT there. (Still will apply so I can write a bomb ass secondary about walking past the medical school building on my way to high school and how it became my symbol for urban medicine)",
            "Duke: known across the world for their basketball lol. Kyrie, Tatum, and Paolo Banchero to name a few. \nTennessee: Idk I always hear abt them in sports news and their fans are intense\nEmory: in Atlanta so super diverse area with a lot of different cultures",
            "UTMB has the best culture because it is literally on an island, located by the beach. It is also the only med school in the nation with fraternity houses and parties, lol (hosted by med students, ofc, so Greek life made classy). It is well-established (1891), reputable, and has super cool opportunitieslike a scholarly concentration in aerospace medicine. There is no ranking, no graded curriculum, just vibes.",
            "Yale \n\nfrom non yale T10 student",
            "You lived in GTA city in real life yet still chose to play GTA on the game instead. You are the gen z messiah. Bringer of followers.",
            "I have heard there have been some issues at UCLA due to the curriculum change. Is there anybody from UCLA med that could give their thoughts on it?",
            "I cried at cp3 played here "
        ]
    }
}