{
    "Friendly Friday": {
        "title": "Friendly Friday",
        "score": 11,
        "url": "https://www.reddit.com/r/PremierLeague/comments/1dqan4a/friendly_friday/",
        "content": "Welcome to another edition of Friendly Friday, where we put aside the rivalry and celebrate the positives about our rival teams.\n\nLet's take a moment to appreciate the strengths and admirable aspects of our rival clubs. Whether it's their historic achievements, their passionate fanbase, iconic players, or the way they've contributed to the beautiful game, let's spread some positivity.\n\nMaybe you've admired the resilience of your rival's defense, the talent of a specific player, or the club's commitment to youth development. Share your thoughts, anecdotes, or experiences that have given you a newfound respect for a team you usually cheer against.\n\nRemember, this is a space to appreciate the diverse and rich tapestry of football, acknowledging that each rival team brings something unique to the sport we all love.\n\nSo, dive in and let's hear your positive stories and perspectives about rival teams. Let's celebrate the spirit of sportsmanship and camaraderie that unites us through our love for football.",
        "num_comments": 10,
        "comments": [
            "Nice to see Christian Eriksen come back and play well for Denmark after what happened at the last Euros. Looking forward to the Battle of the Balds in the upcoming season.",
            "I'd rather not say anything positive about Sp*ds but I guess the colour of their main sponsor is a great choice.",
            "As a Forest fan its hard to say anything nice about the sheep. However Im glad they didnt go out of business a few years back. No one should lose their club. Except MK Franchise of course whose demise I will happily celebrate.",
            "It's nice to see Everton not being relagated after all they had to pass through last. They deserve to be in the EPL and they fought so hard to remain in it.",
            "Ive always rated fly emirates",
            "They're in the championship",
            "No, I havent just supported Leverkusen this season. Ive supported them since 2015 because of Hakan Calhanoglu. No Im not Turkish either, I was 11 and loved free kick goals, worked out alright after 9 years of pure pain watching Leverkusen",
            "Fellow fans, this is a friendly reminder to please follow the [Rules](https://www.reddit.com/r/premierleague/about/rules) and [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). \n\nPlease also make sure to [Join us on Discord](https://discord.gg/football)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PremierLeague) if you have any questions or concerns.*",
            "[removed]",
            "Your comment has been removed for violating our community guidelines regarding respectful communication. \nWe strive to maintain a respectful and courteous environment for all users.\n\nPlease refrain from making insulting or disrespectful comments in the future. \n\nIf you have any concerns or questions regarding the guidelines, feel free to reach out. \n\nThank you for your understanding and cooperation."
        ]
    },
    "Liverpool have turned down the chance to sign Anthony Gordon from Newcastle": {
        "title": "Liverpool have turned down the chance to sign Anthony Gordon from Newcastle",
        "score": 108,
        "url": "https://www.reddit.com/r/PremierLeague/comments/1dr9qvd/liverpool_have_turned_down_the_chance_to_sign/",
        "content": "[https://x.com/TheAnfieldTalk/status/1807005199040479331](https://x.com/TheAnfieldTalk/status/1807005199040479331)\n\nThis would be interesting. As a Liverpool supporter I would really like to see him playing for Liverpool, since I rate him highly. I know he is a left winger, but I wonder if he could play on the right wing as a future Salah replacement. However, I don't think I would sacrifice Quansah for that.",
        "num_comments": 134,
        "comments": [
            "Would have made for an interesting Goodison fixture \n\nUnfortunately i had the pleasure of being at Rooneys first game at Goodison for United where he kissed the United badge",
            "As much as Id like Gordon Id absolutely not be sacrificing Quansah in order to get him.",
            "Him and Harvey Elliot on the same team would be fun to watch",
            "Didnt they want Quanshah as part of the deal as well ?? \nGordon is good but cant let Quanshah go",
            "I think he'd be a great signing, I also think that Diaz maybe leaves this summer to psg or barca but no chance you're getting Quansah as part of any deal.",
            "I'm surprised you lot weren't in the race for Olise, imo that would have been a great long term Salah replacement.",
            "Gordon is great, I hope we get to keep him and push on.",
            "I dont think they need him, would be a waste of money considering other positions are more necessary",
            "I think it's pretty clear with all the stuff coming out today that we're leaking out lots of different stories about what we might be doing in order to obscure whichever deals we actually are doing - this story about Gordon being a nice bit of bait to distract the journos",
            "If Newcastle sell Gordon then theyre not a serious football club"
        ]
    },
    "Ian Maatsen: Aston Villa sign defender from Chelsea": {
        "title": "Ian Maatsen: Aston Villa sign defender from Chelsea",
        "score": 79,
        "url": "https://www.bbc.co.uk/sport/football/articles/ceqd09exwqqo#comments",
        "content": "",
        "num_comments": 22,
        "comments": [
            "Was a great pleasure watching him at Dortmund and hope he's not let his mistake in the final damper his confidence. He'll be a great bit of pace and versatility to a solid Villa backline",
            "He had a good season at Dortmund and I think he has a great opportunity at Villa with a great manager and a good team.",
            "Good signing for them. Good price for Chelsea.",
            "As a Villa fan I saw this as a great piece of opportunism. I actually think we caught a lot of teams on the hop and I genuinely see him as a key member of the squad. He likes to maraud up the pitch and that will suit our style of play. I know we have taken a kicking for the swap transfers but the PL needs disrupter clubs to challenge the status quo and try to keep things interesting.",
            "Wait why didn't he end up at Dortmund though",
            "I cant believe this guy didnt get bigger clubs after him he looked great when I saw him play in the CL",
            "smh he was a perfect backup to chilwell. he and gusto young bakcups to injury prone players. Now look as we go find another backup for 50mil",
            "Does this not make him one of the most expensive left backs of all time?",
            "With the new financial strictness, in the premier league and la liga, it doesnt leave a lot of room for bidding wars and spending crazy sums. \n\nI think we may see and have been starting to see a reduction of prices.",
            "37.5m aint a bargain. They got a good attacking left back for a fair deal"
        ]
    },
    "Grealish's Euro 2024 snub could lose England star 'tens of millions' as Man City winger is warned of image problem": {
        "title": "Grealish's Euro 2024 snub could lose England star 'tens of millions' as Man City winger is warned of image problem",
        "score": 709,
        "url": "https://www.goal.com/en-us/lists/jack-grealish-euro-snub-lose-england-star-tens-millions-winger-warned-image-problem-man-city/blt6f97cab567f8a125",
        "content": "",
        "num_comments": 298,
        "comments": [
            "Hmm the drunk driving accident boosted his image?",
            "What the fuck is this ??",
            "The article is about Hellmans selling tens of millions worth of mayonnaise more if Grealish had made the Euro squad???? Wtf? How can that even be remotely true?",
            "Man City have caused it by taking a maverick player and turning him into a back pass machine. They've lost themselves tens of millions.",
            "I am also potentially losing tens of millions by not being called up for England",
            "At this Euros? Graelish and Rashford are going to come out looking the best",
            "We should start a GoFundMe page for him.",
            "Jack Grealish will most likely leave Manchester City with the situation he's in right now. With Doku in that team, he's destined to sit more on the bench.",
            "A lot of garbage gets posted on this sub",
            "Jamie Tartt doo doo doo doo doo doo"
        ]
    },
    "[Fabrizio Romano] Omari Hutchinson to Ipswich Town on permanent deal from Chelsea": {
        "title": "[Fabrizio Romano] Omari Hutchinson to Ipswich Town on permanent deal from Chelsea",
        "score": 103,
        "url": "/r/IpswichTownFC/comments/1dqooqk/fabrizio_romano_omari_hutchinson_to_ipswich_town/",
        "content": "",
        "num_comments": 26,
        "comments": [
            "On a side note -  we need an Ipswich user flair.",
            "Ouuu. How much? Was looking at him on FM today!",
            "Nice deal . Go Getem Tractor Boys.",
            "If I remembered correctly, I think he played for Ipswich last season. It's why they went for him and finally got their man.",
            "Fuck Fabrizio. He makes shit up",
            "Fuck man he fucked it didnt he?",
            "Is this an actual transfer, or a PSR loophole transfer? I don't know anymore...",
            "22m with sell clause apparently",
            "Rejected new Arsenal contract because they signed Fabio Viera and left for Chelsea only for them to sign couple dozens of winger.\nMan got a little jealous of Saka and thought he could be the star at Chelsea",
            "Actual transfer on our part at least, we loved him at Ipswich last season."
        ]
    }
}