{
    "June 24, 2024 - What did you do this week to prepare?": {
        "title": "June 24, 2024 - What did you do this week to prepare?",
        "score": 9,
        "url": "https://www.reddit.com/r/preppers/comments/1dnqm63/june_24_2024_what_did_you_do_this_week_to_prepare/",
        "content": "Please use this thread to discuss whatever preps you worked on this year/week. Let us know what big or little projects you have been working on, please don't hesitate to comment. Others might get inspired to work on their preps by reading about yours!",
        "num_comments": 44,
        "comments": [
            "A friend brought a steer to the processor today. I asked if I could have the bones. She said she would ask. Processor is going to put 50 lb of beef bones in a bag for me. Im so damn excited I cant stand it. Im down to ONE pint of beef stock. Im going to make and can SO much beef stock!!!",
            "Participated in amateur radio field day, including hammock camping overnight. Made dozens of contacts on multiple bands with different model radios.",
            "Bought some dehydrated can goods to round out my food supply, finally picked up a Zoleo satellite communicator on sale, that has really impressed me",
            "Added some more water to my kit for both drinking and cleaning.   \nRotated and added some more things for hygiene (Ie. rotated toothpaste and soaps, added some more personalised washcloths and a bucket I bought).",
            "Anyone know any good police scanner apps? Id like to listen in if something is happening (a weather emergency, for instance) but dont want to spend hundreds of dollars on a real scanner that to be honest I probably couldnt figure out how to use.",
            "My rainwater collection setup for my IBC totes worked perfectly. Collected almost 100 gallons of rainfall from over the weekend. My plants are very happy!",
            "Last week I went on several solo hikes (a first for me) to work on my cardio and test a few wilderness skills. Definitely learned a lot, mostly what I should keep/replace/toss in my pack. Making those switches this week.",
            "Bought a Country Living grain mill and some wheat berries from the amish. Expanded the perrenial vegetable garden. Planted more elderberry and hazelnut. Bought a better hand pump. Setup another whole house solar estimate. Last one was 55k... just doesn't make financial sense at that cost, and no, I don't plan on diy any time soon.",
            "A friend gave me a free solar panel that has a cracked face, which I repaired with epoxy.",
            "Added a can of spam to the emergency crate."
        ]
    },
    "New Preppers Resource Guide (Answers to common questions)": {
        "title": "New Preppers Resource Guide (Answers to common questions)",
        "score": 975,
        "url": "https://www.reddit.com/r/preppers/comments/toani0/new_preppers_resource_guide_answers_to_common/",
        "content": "Hello! First of all, welcome to r/preppers!\n\nThis thread is a list of resources that answers many common questions. It's encouraged for anyone who has just started down their path of self-reliance to give these a brief read before posting. This is to reduce repetitive questions in the sub and help everyone be on the same level of basic knowledge moving forwards, especially since the visitors/subscribers to the sub has increased at a rather fast rate.\n\nSo again, welcome!\n\nFirst Steps:\n\n* Please read the rules on the right for general r/preppers conduct.\n* When making a new post after browsing the below information, please utilize the appropriate flares. Questions about generalized preparedness information that doesn't have to do with a major societal collapse, should have the flare of \"Prepping for Tuesday.\" Likewise, questions regarding a major or complete collapse of infrastructure should be flared \"Prepping for Tuesday.\"  This helps users give you the most appropriate recommendation based on what you're looking for.\n\nGeneral Info:\n\n* Read this sub’s wiki - [https://reddit.com/r/preppers/wiki/index](https://reddit.com/r/preppers/wiki/index) This has many specific topics within it, and is a good place to start if you have a general topic in mind.\n* For Women-specific prepping advice, concerns, and community, I highly recommend r/TwoXPreppers Please read their rules before posting.\n* Join the Discord Server at [https://discord.gg/jQHCWnF6nu](https://discord.gg/jQHCWnF6nu) \n* [https://www.ready.gov](https://www.ready.gov/) This is a *fantastic* get-started guide for specific disasters, and your own 72 hour (or more) kit. US Government Preparedness site.\n* [https://www.getprepared.gc.ca](https://www.getprepared.gc.ca/) The Canadian Preparedness Government Website (Similar to the above.)\n* Countdown to Preparedness .pdf  [https://web.archive.org/web/20220728200244/https://cloudflare-ipfs.co/ipfs/bafykbzaceaac2y25oesj6wr5c7vc367hmc6y5l3pbcvm24zcscahtyy3rrj36](https://web.archive.org/web/20220728200244/https://cloudflare-ipfs.com/ipfs/bafykbzaceaac2y25oesj6wr5c7vc367hmc6y5l3pbcvm24zcscahtyy3rrj36) A free PDF version of getting prepared in 52 weeks in small, bite-sized steps.\n* Discount codes for the three primary companies offering varying levels of antibiotic kits are found in the Wiki to encourage safe and responsible medication preparedness. [https://www.reddit.com/r/preppers/wiki/antibiotics/](https://www.reddit.com/r/preppers/wiki/antibiotics/) \n\nAgain, welcome to r/preppers!",
        "num_comments": 185,
        "comments": [
            "You won't find it spoken of on hardly any prepper sites, but the simple fact is \"Money\" or wealth, is one of the best resources you can have in the future.  We aren't likely to go into Mad-Max in the decades ahead and people with tangible money, like silver and gold, will be able to buy the things needed to survive.  It doesn't fit well with the baked beans and bullet crowd or those selling solar systems and knives, but the history of civilization proves that those with money do better than those without.",
            "Thank you for sharing this! We have many new community members and this is invaluable information.",
            "Shoes, you need extra boots. Without those your stride is different and it can cause extreme heel pain.",
            "Is there one on mass political instability in an area? Not any one party either. I could see things getting out of hand in a myriad ways for either party, meanwhile I just want to be safe in my own home, or find a safe way to bug out if necessary. Im not looking to be political with my question; I just know there are extremists on both sides, and the US is increasingly a powder keg of resentment over divisive politics and that most of the population cant afford cars, homes, college education, and now even groceries and gas, all during a massive, historic heatwave  crime rises in heatwaves. Here in Texas, things could pop off over the border issues or gun control efforts, for one example. Another state may be different issues. But mob mentality was coined for a reason. As a single woman, Id like to have some idea of what to do if violence breaks out.",
            "Just starting out with prepping. The amount of information everywhere is overwhelming. Is theprepared.com also a good source of information?",
            "Hello. With threats of heating and electricity shortages in Europe I would like to prepare for emergencies. Unfortunately most \"survival\" advice seems to be about surviving in the middle of nowhere, drinking water from streams and every equipment item being \"tactical\".\n\nCould someone lead me to some nice guide of good things to have? I am thinking of scenarios like being at home, but having no electricity or tap water for a week or two. Should I get candles, or solar charger and electric lights. Stuff like this.",
            "I appreciate this! My wife and I have discussed prepping a lot recently, and we've somewhat started but these resources will help us narrow down what we really need to be spending our money on!",
            "I'm printing the Countdown to Preparedness for a hard copy workbook and noticed page numbers are way off.\n\nWhen comparing to other PDFs it looks like this one is just condensing more content onto each page, yea?",
            "I cannot appreciate this sub enough especially for the reading material on a myriad of subjects, it's been huge in helping me get started but after reading a couple of the books they stress Skills and training over gear for the most part, so I suppose my question is how or where does one aquire the skills and training?",
            "So much of this list doesnt work anymore. Time to reup"
        ]
    },
    "The Real Threat After SHFT: Other Preppers and Gun Culture Enthusiasts ": {
        "title": "The Real Threat After SHFT: Other Preppers and Gun Culture Enthusiasts ",
        "score": 760,
        "url": "https://www.reddit.com/r/preppers/comments/1dqs5m8/the_real_threat_after_shft_other_preppers_and_gun/",
        "content": "The truth is preppers/gun enthusiasts will be the bigger threat if SHFT, not government, not looters and possibly not even the disaster itself. \n\nLet me explain why:\n\nIn almost all prepping communities I’ve observed, most conversations almost always steer to guns. We rarely discuss training other aspects of our selves.\n\nI’m a former Marine, I was infantry (0352) and worked with law enforcement for nearly 10 years, I’m very familiar with firearms and their use. A mistake my fellow veterans make is thinking natural/manmade disasters will be combat zones. We buy better guns, simulate combat scenarios encourage our civilian buddies to do the same and ultimately behave like a paramilitary. \n\nThis is dangerous.\n\nIt implies your fellow countrymen will be the enemy, it sets your mind with a level of mistrust and paranoia thats hard to shake off. While I’m sure many preppers are hoarding food and water, what happens when it runs out? What happens if social order breaks down? I can’t remember the last time any of my prepper buddies discussed learning to farm, or how to maintain a small community in the absence of government.\n\nThat’s what makes us dangerous, we hoard guns/ammo and train for combat that may never happen. We don’t train to maintain a peaceful community. We train for hostility, thereby making us more likely to be hostile. \n\n“If all you have is a hammer, everything looks like a nail.”\n\nIf we’re going survive a SHTF scenario, we must train our bodies, mind and soul. Learn philosophies like Stoicism, learn second order thinking, psychology and techniques to negotiate/barter. \n\nIf your mind is strong, you are unstoppable.\n\nIt’s more important than having the best rifle money can buy. \n\nUntil then, “Know thy enemy.” -Sun Tzu",
        "num_comments": 276,
        "comments": [
            "Yep. Theres ALOT of angry people out there now, wait until they havent eaten in 3 days.",
            "The best prep is community.",
            "The biggest threat will be starving people who didn't prep.  I agree that skills such as gardening and barter are going to be importance, but that will come after the first couple of months. A garden can't be depended upon if thieves raid it while you are asleep.   Maintaining a constant storing of food through agriculture and barter will require more than any one set of skills.  It will require a community of people to ensure safety and security.  Even the biggest badass has to sleep some time.",
            "There's no \"sets your mind to mistrust\" bullshit. People are animals, nothing more. A missed meal will make your computer nerd neighborhood a murderer.",
            "Yes, I think that guns are the easiest talisman to ward off bad juju. They provide the illusion of security rather than real security. Food security would go a lot further in a real crisis. A sense of community and connections you can rely on would be another important layer. Instead, the prepper mindset all too often steers toward lone wolfing it. \n\nIve had a few bad days where we needed our preps, we needed our friends, and we needed cash reserves. I have yet to need my gun.",
            "OP likely lives in a small town, suburb or the country. Here in the inner cities things are bit different. Its hard to keep people from taking your shit even without a shtf scenario. Gun guy prepper nerds in this sub are real low on my list of concerns.",
            "Well said. Cooperation is ultimately the only way to survive shtf.",
            "Why I advocate getting involved with local community",
            "This is why living in a small town/community with like minds that you've known for thar last 30 years, hopefully pays off.",
            "I know a lot of preppers and none of them act like this guy is describing"
        ]
    },
    "Simple and cheap for 6 months to survive.": {
        "title": "Simple and cheap for 6 months to survive.",
        "score": 16,
        "url": "https://www.reddit.com/r/preppers/comments/1dr7ix9/simple_and_cheap_for_6_months_to_survive/",
        "content": "For one person to survive on 2000/cals a day…\nYou will need 5, 5 gallon buckets full of rice and 5, 5 gallon buckets of beans that will feed you for 6 months. \nYou can survive!  \nOf course one must think about others that do not prep, mainly children.  As a kid I went hungry a little bit so it’s not a good feeling.  ",
        "num_comments": 22,
        "comments": [
            "A couple cans of diced tomatoes will go a long way to making rice and beans more palatable and add some nutrition",
            "This is a great way to get malnutrition.",
            "If you are prepping to survive 6 months then you need to consider more than just calories. Rice and beans are a great start, but there are a lot of nutrients that our bodies need that you also have to consider. \n\nYou don't actually need to eat every day to survive. But, part of the reason we prep is so that we don't have to consider skipping food in order to makes things stretch.",
            "Multivitamins can last a couple years and are relatively cheap. If you rotate them, then you can balance the nutrition a little bit. Obviously it's better to get vitamins and nutrients from fresh food sources, but Multivitamins can hold you over in a pinch.\n\nDon't forget salt and spices too. A little bit goes a long way, and they last for a few years. I'm all about Mexican rice and refried beans, I could live off that for a few months.",
            "Rice, beans, dehydrated potatoes, some fruit cups, 2000 gallons of water and vitamins would get me through 6 months if I had to, but if Im in survival mode a little bit of variety would be nice and Ive done it a few times before after going through a couple of hurricanes.. looks like I might be doing it again soon too..",
            "I would not want to have to eat beans and rice everyday. They take lots of water to cook. You have time now to stock up on food you like to eat. Do that.",
            "Gastronomic boredom would be your biggest threat on a straight rice and beans diet. There is good nutrition available, but if you don't pad this with some meat, a lot of spices,maybe a couple of Sam's club bulk value bullion packs, and something to break up the monotony you will stop wanting to eat this diet without variance. You would probably go into shutdown mode if you started out on this without any prepping into it. Any sudden shift in your diet will have catastrophic end results, those cultures that have this as a dietary staple have adapted their systems to it. A western eating person who suddenly shifted to rice and beans with no warning would not be loving life for a couple of weeks as their body adapts to the shift from fast food they're used to. Adding flat bread, meats and other dried vegetables would help reduce the taste boredom, but it still would not be a satisfying diet by itself.",
            " A week could be done pretty easily. Check out the guy that eats only canned beans for 40 days on Youtube. I believe it was around the two week mark that he says he starts to feel poorly.",
            "Most brazilians eat rice and beans every day their entire lifes.\n\nThe secret is having spices and other things to make the food more interesting (such as cheap meat).",
            "Can also kill some squirrels"
        ]
    },
    "Best pair of pants to buy": {
        "title": "Best pair of pants to buy",
        "score": 11,
        "url": "https://www.reddit.com/r/preppers/comments/1dr5sos/best_pair_of_pants_to_buy/",
        "content": "What are your go to pair of pants ?\n\nI'm looking to buy 5 pairs of the best tactical pants out there (under 150$ a pair).\n\nI stumbled on the following (no particular order):\n\n- Propper Kinetic Men's Tactical Pant\n- 5.11 Tactical Series Strike Pants\n- Vertx Recon Pants\n- 5.11 Apex Pant\n- LA Police Gear Men's Urban Ops Tactical Pants\n\nAre there better options than those ?\nWhich one should I buy ?\nIs there one that I should avoid ?",
        "num_comments": 12,
        "comments": [
            "I wear Propper Aeros pants. I'm not saying they're the best for you, but they're the best for me.",
            "Buy your expensive 5.11 on eBay.",
            "I prefer Vertx brand over all of the higher end brands and CQR for good quality at a reason price",
            "Ngl man. I love my dickies pants. Also, If you want like tactical pants, I'm a simple person and have been a fan of propper 100% cotton ripstop bdus. Wore one pair for 4 years, only mild issue is fading but I think it looks good that way",
            "A pair of jeans, a white t-shirt and an unziped hoodie are my grayman clothes, generally.\n\nThe point is to look like another one of the herd, not stand out. Tactical equipment stands out.",
            "Tactical Innovations Canada Operator pants. Buy them through battlerattle.ca. \nBest pants I ever owned. They come unhemmed so you can get a custom fit.\n\nEDIT: Under CAD$100 a pair",
            "When I did events the best pair I ever had was the 5.11 apex. Butt those were expensive. I tried a few other brands (should have just rebought the apex).\nDries extremely fast. Stretchy ass hell. Sleek yet still quite durable. Cargo pockets could fill very good.\n\n\nVarusteleka cargo pants were decent. And great for the price.\nAlso used their tactical jeans awhile. Which are a bit warmer. Butt great.\n\n\nHowever unless you need it for your job or roleplay. Good pair of jeans are good enough. I have wrangler tapered jeans. And due to the stretch I can do everything in them the same way as the tactical pants. Only they dry a bit slower.",
            "You have to find out what fits first. All cuts are not created equal. I was issued 5.11 pants in Afghanistan and bartered them off. I own most brands and settled on two. The Wrangler tactical pant from Target are just like my Kuhls but softer and a fraction of the price. For really hot weather, I bought multiple Arcteryx Rampart pants because they are tough but thin and light. They are almost dry when they come out of the spin cycle in the washer. They also roll up really small when packing out. Edit: Forgot to mention to check out Duer. I have two pairs of their Adventure pants & two regular. Comfortable AF. https://shopduer.com/products/mens-water-resistant-athletic-pants-loden-green?_pos=1&_sid=924463051&_ss=r",
            "I would highly recommend you check out [Varusteleka](https://www.varusteleka.com/en/group/pants/1086) out of Finland. I love their stuff.",
            "That's why I am a big fan of the [Sarma Tactical Jeans](https://www.varusteleka.com/en/product/sarma-tactical-jeans/58865)."
        ]
    }
}