{
    "The Bad Batch Season 3 has premiered! Please remember that memes of it must be tagged as spoiler at least ONE WEEK per each episode. Thanks everyone!": {
        "title": "The Bad Batch Season 3 has premiered! Please remember that memes of it must be tagged as spoiler at least ONE WEEK per each episode. Thanks everyone!",
        "score": 60,
        "url": "https://i.redd.it/ykmq3w9cs1kc1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "#ORTOPEDIA #FORMISANO",
            "FORMISANO ORTOPEDIA  FORMISANO PIEDE SANO PUNTO ORG",
            "so excited for this ughhhh",
            "Hm",
            "pretty mid show.",
            "formisanopiedesanopuntoorg",
            "FORMISANO PIEDE SANO PUNTO ORG",
            "What?",
            "Coglione",
            "I joined for Prequel Memes! Not for some bad batch or whatever…"
        ]
    },
    "Remember the old times?": {
        "title": "Remember the old times?",
        "score": 452,
        "url": "https://i.redd.it/hmtsb7pvg38d1.jpeg",
        "content": "",
        "num_comments": 80,
        "comments": [
            "Thanks for providing a source!",
            "George Lucas said there would be 50-100 surviving Jedi when Luke rebuilt the order",
            "Do obi Wan and Yoda not count? And all the jedi from legends that survived a good bit onto the timeline",
            "*Legends Quinlan Vos would like a word…*",
            "Werent their jedi who surved order 66 in legends",
            "No. Obi-Wan and Yoda were there since the OT.",
            "yea... about that... there was a Cyborg-Jedi who let himself infect with Palpatines ghost to save Leias and Hans youngest child and there was a jedi, that kind of looked lime a dog, that lived on Yavin 4. And that are just two exaples before Episode 3 came out.\n\nI know, that is a highly critecised thing. But there where allways redconed Jedi that lived until or even after the OT. Doesn't even Lucas said, that there where at least 100 Jedi, that where alive at this time? Even in Episode 3 it was mentioned that remaining Jedi where warned.",
            "Imagine the amazing amount of content we would have missed out on if we listened to these types of complaints",
            "bitch back in your day we only knew two Jedi and they both survived order 66",
            "Except Obi-Wan, Yoda, Quinlan Vos, Tholme, Valin Halcyon/Hal Horn, K’Kruhk and the younglings he saved, Dass Jennir, Shaak Ti, Maris Brood, Kazdan Paratus, Rahm Kota, Brand, A’Sharad Hett, Kento Marek… We don’t know when exactly Neeja Halcyon died, just that the Empire killed him, so maybe he survived Order 66 but died in the aftermath."
        ]
    },
    "It will never get old.": {
        "title": "It will never get old.",
        "score": 2882,
        "url": "https://i.redd.it/zrg5sziwyz7d1.jpeg",
        "content": "",
        "num_comments": 161,
        "comments": [
            "Thanks for providing a source!",
            "I don't think that's Lucasfilm's fault though, I think that has more to do with Disney not wanting to pay royalties to the writers of the Expanded Universe's material. Lucasfilm probably would have loved to have a bunch of clear cut finished products ready for filming.",
            "My favorite part is when the decided to bring Palpatine back just like in legends. Cloning and trying to possess people and everything. Cliffs Notes version of Dark Empire. I can see why they went the route they did with decanonizing the EU, but they chose the worst part to use in canon. Other than the Yuuzhan Vong. And Han Solo being heir to the throne of Corellia. And we probably could have done without George Lucas’s sequel plans of microscope midiclorian adventures.",
            "It is in fact old.",
            "It’s not a like a large amount of novels, comics, video games, source books, audio dramas, and some cartoons existed before Disney bought Star Wars /s",
            "\"That can't be, comics have been extinct for a millennia",
            "This is one folks always love to pull out of context. What was the interview question asked when she gave this response? \n\n“*Jurassic World director Colin Trevorrow was slated to write and direct Episode IX before you brought J.J. Abrams back in. Is this final entry in the trilogy a particularly hard nut to crack?*”\n\nHer answer is longer, but this includes what preceded it:\n\n“*Every one of these movies is a particularly hard nut to crack. There’s no source material. We don’t have comic books. We don’t have 800-page novels. We don’t have anything other than passionate storytellers who get together and talk about what the next iteration might be.*”\n\nWhile I think it could have been phrased better, her response is unquestionably correct. They were writing the third movie in the Sequel trilogy and the answer was specifically aimed at those movies, not SW as a whole as folks like to paint it. There was no “source material” to adapt as they were making a brand new story. The Sequels were never going to adapt any of the EU stories, even when Lucas was working on what became TFA prior to the sale, so they can only be used as inspiration and no directly adaptable source material. ROS even took direct inspiration from the EU and folks hated it for that.",
            "There are NINE Thrawn books and they are all good. What the actual fuck. \n\nEdit: and the Bane trilogy could fill three movies. So goddamn good. Also I always forget the two post thrawn novels. They were aight.",
            "Yes because Star Wars really is known for never expanding at all. After Episode 4 they did not release Splinter of the Minds Eye, and Thrawn trilogy did not inspire George Lucas to finally make prequel trilogy. \n\nYou have to be incredibly ignorant or have literally no imagination to think that there is nothing that could be used to make Star Wars movies. They literally could just ignore ANYTHING they wanted and take EVERYTHING they wanted and make brilliant sequel trilogy that starts new bright era of canon.",
            "Who's gonna tell her"
        ]
    },
    "What would you choose?": {
        "title": "What would you choose?",
        "score": 342,
        "url": "https://i.redd.it/yissikhrs28d1.jpeg",
        "content": "",
        "num_comments": 163,
        "comments": [
            "Thanks for confirming that you flaired this correctly!",
            "The fact that the droid that caused uncle Owen to buy R2 by breaking down is force sensitive and it did it onnpurpose\n\nIt is just so unnecesary, stupid and ridiculous to not make canon",
            "Give Grievous back his old backstory.",
            "Revan",
            "Timothy Zahns Thrawn Trilogy",
            "That tidbit about STAPs having radioactive exhaust pipes, so those jedi bastards will stop hijacking them",
            "Captain Fordo",
            "Darth Jar-Jar, and it isn’t even close",
            "Han shot first.",
            "Spaceballs"
        ]
    },
    "Scout Troopers! 🫶": {
        "title": "Scout Troopers! 🫶",
        "score": 3361,
        "url": "https://i.redd.it/2b72rz74wy7d1.jpeg",
        "content": "",
        "num_comments": 52,
        "comments": [
            "Thanks for confirming that you flaired this correctly!",
            "Well, removing the camouflage was a mistake.",
            "They scout so well, because their helmets block their peripheral vision, so they can focus on what is straight ahead.",
            "Ewok enters the arena.",
            "Well they did adjust the visor, because seriously the clones are expected to grow eyes out of their forehead to see out of that thing",
            "Yub nub!",
            "That armor from Revenge of the Sith was peak.",
            "#*shows two clearly different designs*",
            "The only thing about scout trooper armour I dislike is from Rebels, where they could flip up the helmets. Otherwise, it's a cool design.",
            "It’s cool"
        ]
    }
}