{
    "Chicago rapper serving life sentence gets DDT’d in prison fight 🤣😭😭": {
        "title": "Chicago rapper serving life sentence gets DDT’d in prison fight 🤣😭😭",
        "score": 162,
        "url": "https://v.redd.it/o4znuezaae9d1",
        "content": "",
        "num_comments": 61,
        "comments": [
            "It’s different when you don’t have guns",
            "That move was done very sloppily. He didn't even protect his opponent. That's the problem with pro wrestling today.",
            "He got that jake the snake",
            "Hope they all made up and had some Cheerios together",
            "What does DDT’d mean?",
            "He had double underhooks shoulda went for the inside trip. He also had bad posture and let the other guy grab his neck. Wu Tang already told you “Protect your neck!”",
            "all over 2 stamped envelopes",
            "White boy putting a hurting on him",
            "Holy shit! Damn",
            "Yeah they was \"fighting\"....looks like they were shoving their hands in each other's pockets"
        ]
    },
    "Toltec Art piece done by Luciano at Kern Valley State Prison, pen on card stock.": {
        "title": "Toltec Art piece done by Luciano at Kern Valley State Prison, pen on card stock.",
        "score": 22,
        "url": "https://i.redd.it/egon5tknzd9d1.jpeg",
        "content": "[Purchase a print on our website!](https://www.prisonchronicles.org)",
        "num_comments": 2,
        "comments": [
            "Love it! I used to buy a print magazine called Prison Life and they had a page in every issue dedicated to inmate-decorated envelopes. The artwork was astonishing, in many cases. It's sad to see such talent warehoused instead of rehabilitated.",
            "We should work on rehabbing the murdered victims too."
        ]
    },
    "Why do inmates get moved from jail to jail?": {
        "title": "Why do inmates get moved from jail to jail?",
        "score": 2,
        "url": "https://www.reddit.com/r/Prison/comments/1dr6ac6/why_do_inmates_get_moved_from_jail_to_jail/",
        "content": "Why do they get transferred to different places?",
        "num_comments": 2,
        "comments": [
            "County A has warrant for Mr. IDidintDoIt who got picked up over in County B on an unrelated / separate charge. Turns out he is also a fugitive from justice in State A 400 miles away.\n\nThere are tons of reasons, none of them good",
            "Many reasons. One is because they are having problems with another inmate at that facility. They might have gotten sentenced and now needs to go to a federal or state prison. They might move someone to a jail closer to their court. Some inmates may have medical issues and need to go to a facility that treats their medical needs. I was getting transferred because I tried to have inappropriate relationship with a female staff, custody level and points also matter and another reason is for no reason at all."
        ]
    },
    "How do people start private prisons?": {
        "title": "How do people start private prisons?",
        "score": 9,
        "url": "https://www.reddit.com/r/Prison/comments/1dqy1qy/how_do_people_start_private_prisons/",
        "content": "I'm going to make a wild guess and say that it's more complicated than getting a loan from a bank or government and using that loan to purchase land in the middle of nowhere and hiring construction workers to buikd the prison, purchasing with the loan Bob barker stuff, and then advertising to police that you have a private prison and somehow make money, but feel free to correct me and explain how starting a private prison works.",
        "num_comments": 21,
        "comments": [
            "We keep ours in our basement.",
            "actually you weren't too far off..you bid an amount on public contracts (like the movie War Dogs) and if you win, the govt verifies ur facilities are legit then boom, you own a prison and they start sending crims your way. they send a pre determined amount of convicts per year and you get paid.\nthe US is not a real place",
            "cant guarantee this is the right answer but it will be something similar to this\n\nIn England we have what is called PFI's a good readup is here - [Private finance initiative - Wikipedia](https://en.wikipedia.org/wiki/Private_finance_initiative)\n\nthe tldr is a private company agrees to build some infastructure for the government. The private company pays entirely for the build themselves.. maybe they get some subsidies or grants etc from the govenrment to help and ypu they will leverage their position to get loans\n\nOnce the project is complete the government then signs like a 100 year rental on the building, maybe its just a manintenace agreement whatever. We will pay x per year for a long ass time.  the long and short is the government will pay annually for that property for the next 50 or 100 years\n\nSo the private company might pay 20million to build it, but the government agrees a maintenance contract of 100 years for 200million or whatever.\n\nAgain. can't guarantee that is the right answer in 100% of cases in all countries , but some variant of a PFI is used for a lot of things like prisons schools hospitals etc. You don't build it in the hope someone needs it. You build it because you have a contract that spans generations to guarantee income to you and yours. Government contracts are the golden egg of all contracts. They (again depending on country) will almost always pay\n\n  \nOn a side note - PFIs are a way to tackle recession. Construction is often first hit when a recession starts, but often the first to recover as it's something the govenment can directly stimulkate without immediate spending",
            "There's probably a lot more empty ones than we all probably realize. California had an overflow out in Okla. That shut down after a riot, they just sold it & filled it up with dudes from Oklahoma. once you buy your spot\nthe bank will immediately be calling their liaison to the pharmaceutical industry bc you're going to want inmates as confused, angry, & sleepy as possible. Even though they typically have their own drugs. You might get bonus points for letting them use some experimental laughing gas in the \"dentist office\".. They get a bad rap but I always found those facilities to be the easiest to do time. The plumbing usually works, meals are on time, appears cleaner, everything is the same. Making the time fly",
            "First you propose...",
            "Well, you just have to round up some people on Craigslist personal ads. The hard part is keeping them and getting a good contractor who doesn't ask questions.",
            "Nice try satan",
            "Most private prisons were already built by governments and sold to the private company, who took over running it.\n\nNo lender would lend you a billion dollars to build a facility in the hopes you can get a government contract.  If you don’t get it, what do you do?",
            "Step one be buddies with politicians.",
            "Think big like Black Rock"
        ]
    },
    "Favorite or most useful commissary item?": {
        "title": "Favorite or most useful commissary item?",
        "score": 10,
        "url": "https://www.reddit.com/r/Prison/comments/1dqvhnt/favorite_or_most_useful_commissary_item/",
        "content": "I have never been on the inside however my fiance has and others we know. What item could you not do without?",
        "num_comments": 30,
        "comments": [
            "Coffee 100% .",
            "We all know soups. Soup is the currency in jails and prisons.",
            "Shower Shoes",
            "Shower slides is the first thing you NEED immediately but behind that and hygiene A spoon. In tdcj if you don't buy a spoon tough shit eat with your id. The worst is losing ur spoon and not having an extra then you're fucked till commissary day which I mean that could be whenever. My favorite tho was a pint If they're calling store I'm getting a pint everytime even if that's all I get. Praline and cream",
            "Ecigs and zyn pouches",
            "Peanut butter or hotsauce",
            "Coffee, slides (if not assigned at intake), ibuprofen, chocolate products. In order of need, for moi.",
            "Deodorant.",
            "Honestly, we always had Christmas hard candy on store. I was the only one in my block that ordered it every trip. Eventually people figured out what it was and it started selling out. That shit is great on its own, in drinks or to make other candy.",
            "Cigarettes and honey buns...tv too, decent sneakers and conditioner for us ladles"
        ]
    }
}