{
    "Community reminder: Mods are volunteers. If you see something you think violates the rules (not just something you don't personally like), you should report it. We read reports. We do not necessarily read every single post otherwise. Thanks!": {
        "title": "Community reminder: Mods are volunteers. If you see something you think violates the rules (not just something you don't personally like), you should report it. We read reports. We do not necessarily read every single post otherwise. Thanks!",
        "score": 103,
        "url": "https://www.reddit.com/r/privacy/comments/16juxkf/community_reminder_mods_are_volunteers_if_you_see/",
        "content": "",
        "num_comments": 1,
        "comments": []
    },
    "Uptick in security and off-topic posts. Please read the rules, this is not r/cybersecurity. We’re removing many more of these posts these days than ever before it seems.": {
        "title": "Uptick in security and off-topic posts. Please read the rules, this is not r/cybersecurity. We’re removing many more of these posts these days than ever before it seems.",
        "score": 70,
        "url": "https://www.reddit.com/r/privacy/comments/19flufu/uptick_in_security_and_offtopic_posts_please_read/",
        "content": "Please read the rules, this is not r/cybersecurity. We’re removing many more of these posts these days than ever before it seems.\n\n# Tip: if you find yourself using the word “safe”, “secure”, “hacked”, etc in your title, you’re probably off-topic.",
        "num_comments": 33,
        "comments": [
            "I'm going to guess the issue is more is the question chiefly a privacy question or more a security question. \n\nI work in privacy, specifically GDPR in the EU and UK and then Brazil. I can't go two hours without having to touch security with my work since everything either side does directly impacts the other.",
            "The two are inextricably linked. I'd just as soon see those posts here and maybe have an automod message the OP to suggest a crosspost.",
            "I thought the cybersecurity sub was for tech *professionals* to discuss news. Where does one go to ask questions about how to protect their data, or what to do if their data has been compromised?",
            "I work in cybersecurity and half of my day job is dealing with privacy related compliance. You may not like the truth but privacy relies on strong cybersecurity.",
            "Exactly! Security and privacy are way too connected to be called different topics",
            "Only so much as diet and exercise are. You need both, they affect each other, but a diet subreddit is the wrong place to ask for exercise advice.",
            "I thought so too, asked the mods, they said otherwise. ",
            "My phone is in a boot loop isn't even about security.",
            "reminds me of \"secure\" alternate Android OSs where users install and continue to use Google spyware, and are even encouraged to do so. Sad...",
            "Yes you can lol. Security by obscurity. You're secure when you're not a target."
        ]
    },
    "Google, Snap, Meta and many others are \"quietly\" changing privacy policies to allow for AI training | It is sneaky and possibly illegal, according to the FTC": {
        "title": "Google, Snap, Meta and many others are \"quietly\" changing privacy policies to allow for AI training | It is sneaky and possibly illegal, according to the FTC",
        "score": 304,
        "url": "https://www.techspot.com/news/103575-companies-including-google-snap-meta-quietly-changing-privacy.html",
        "content": "",
        "num_comments": 19,
        "comments": [
            "I think the main issue is that they are pushing AI data collection and training to end users. Scraping data from internet is becoming counter-productive as more and more internet content is AI generated, and you can't train AI on AI generated data.\n\nSo pushing everything to the end user (e.g. MS Recall) is aimed at getting more real data for the AI models.",
            "Those big tech fucks regard us as lab mice, don't they?",
            "Guess it's time to reinvent internet from scratch with better protocols and security that would make impossible for any cookies, AI Training, data harvester and else.",
            "Correct me if I'm wrong, but after yesterday's SCOTUS ruling overturning the Chevron Precedent is going to cripple the ability of regulatory agencies like the FTC to actually do much about this sort of thing.",
            "Isn't kind of basic that to change a contract, per definition a two party agreement at least, the other party has to sign and agree on it?",
            "Does insta chats count as welll",
            "Wait? Snapchat??\n\nEdit: I know I really shouldn't be surprised. But this applies to chats?",
            "Oh! Do you by chance have the link to Adobe's clarification?",
            "I would not say lab mice as they often die and that's counter productive to their mission",
            "Encrypt everything and save nothing to the cloud.\n\nUse a non-Google search engine and get off Chrome while you're at it."
        ]
    },
    "Apple’s ‘Privacy-Focused AI’ Gets Seal Of Approval From Investors": {
        "title": "Apple’s ‘Privacy-Focused AI’ Gets Seal Of Approval From Investors",
        "score": 35,
        "url": "https://www.forbes.com/sites/kateoflahertyuk/2024/06/27/apples-privacy-focused-ai-gets-seal-of-approval-from-investors/",
        "content": "",
        "num_comments": 11,
        "comments": [
            "The marketing distortion machine has been set in motion.",
            "\"Apple investors encourage company to follow current tech trend for money\"",
            "Dont buy the illusion of privacy",
            "So no privacy I guess",
            "Lol.. it wouldve been more believable if they didnt talk about privacy when talking about AI..\n\nBeing upfront wouldve given some trust",
            "I couldn't care less what investors give their seal of approval to or don't. Regulators are what I care about.",
            "because it'll make them more money while upkeeping the illusion of privacy for users, not because it's actually private and good for said users\n\nanyway, where are the apple fanboys defending their favorite big tech corpo from the evil normie haters today?",
            "all to just give you a better user experience",
            "what, are you suggesting that apple doesn't actually care about my or anyone else's privacy and only uses \"privacy\" as a means of selling more hardware and services? holy shit no way /s",
            "Big Tech investors, famously the last line of defense for civil liberties /s"
        ]
    },
    "\nPolish govt strips first Parliament official of legal immunity, clearing a path for prosecution in spyware probe in which close to 600 people were monitored by advanced commercial surveillance product Pegasus. Many were opposition politicians and their allies\n": {
        "title": "\nPolish govt strips first Parliament official of legal immunity, clearing a path for prosecution in spyware probe in which close to 600 people were monitored by advanced commercial surveillance product Pegasus. Many were opposition politicians and their allies\n",
        "score": 192,
        "url": "https://therecord.media/polish-parliament-strips-official-of-immunity-pegasus-spyware",
        "content": "",
        "num_comments": 8,
        "comments": [
            "The problem with tools like pegasus is that it will always be abused. The real problem isnt people abusing those kind of tools, the real problem is people selling exploits instead of reporting them. It should be illegal to both sale and buy exploits, and it is but of course not for government. If id try to sell tool to hack any phone, i would most likely end up in jail, but sell the same tool to government and youre a hero helping government to catch criminals.",
            "Amazing. We need to do the same thing in Hungary after the 2026 elections.",
            ">by advanced **Israeli** commercial surveillance product Pegasus.\n\nFTFY",
            "isreal uses its ability to create & market cybersecurity and penetration software to blackmail friendly nations, lest the sale of wares such as pegasus make it to the hands of the saudis and chinese institutions instead of western ones",
            "but i thought only russian are doing so and that's why we started a war with them...",
            ">The real problem isnt people abusing those kind of tools, the real problem is people selling exploits instead of reporting them.  \n\n\nno, the problem is vendors either don't pay them or cheapen on the amount of pay for their efforts and sometimes trying to targeting them legally.   \n\nI sometimes read the tweets of some prominent people in security, and I noticed how hard it is to find these vulnerabilities and the pain to write a working exploit for it, because not every vulnerable is exploitable and vendors require a working exploit as a  proof of impact.   \n\nalso their sad reactions on how weeks of work either pay so little (because vendors only pay the full amount when it suite their arbitrary requirements) or they want to jail them. people would prefer to sell to the dark market for 10x the amount of vendors pay.",
            "Lock them up.",
            "Thank you."
        ]
    }
}