{
    "Quarterly Career Thread": {
        "title": "Quarterly Career Thread",
        "score": 8,
        "url": "https://www.reddit.com/r/ProductManagement/comments/1dgoz5e/quarterly_career_thread/",
        "content": "For all career related questions - how to get into product management, resume review requests, interview help, etc.",
        "num_comments": 173,
        "comments": [
            "Looking to leave PM after 11 years as one. Looking for some commiseration or examples to spark my imagination.",
            "After 607 applications and 9 months of searching, I finally got a job! Sr PM 8 years exp",
            "Accepted an offer today as a TPO! Its not PM but hecken heckness its a job! and its more money!!!",
            "I'm taking a beating on my job search thus far, something like a thousand applies without bearing anything fruitful and barely any interviews.  Anyone have any recommendations on where else to look?  I have eight years experience, solid resume.  I made it all the way through to the team match stage at google last year before they froze everything and started only filling their roles with internals etc.. \n\nIf anyone has any leads I'd love to hear any and all of them, tia ",
            "Anyone know good resources to keep my PM skills fresh in my head while I look for another job? Got laid off twice in the last year and I dont want to get rusty.",
            "Can anyone please review my resume, I am failing to get any callbacks, have applied to 100s of jobs in the past 5 months. No result, got 3-4 calls that's it.   \nI would be grateful if someone reviewed my resume and shared a feedback.",
            "Hi folks. Any tips for how to get referrals when you don't know anyone in a company?   \n\nApplying directly hasn't worked at all till now. Found a few roles that I am perfectly suited for. But trying to take the referral route instead of applying directly.",
            "Hi all, been on the search for a few months now with few call backs and even fewer interviews, this is including using recruiters and getting a few referrals from my network. I have a total of 11 years working on digital products but only 2 years with an official PM title. \n\nAll of this to say, can someone experienced in hiring PMs or a PM who gets a call back frequently review my resume?",
            "How are you folks even getting through the ATS? Got the automated rejection from almost every place I applied. And I only applied at places I had a strong fit and I know I have a strong resume. Any tips for getting through the ATS?",
            "what is with this job market? I am still fairly new to PM (2 years) and haven't yet even delivered a product. I need a job with better work/life balance and I am getting frustrated. No I have not been catering my resume and I guess I will start doing that. Does anyone have any insight as to why it's so hard now and what will happen in the next year or so?"
        ]
    },
    "Weekly rant thread": {
        "title": "Weekly rant thread",
        "score": 0,
        "url": "https://www.reddit.com/r/ProductManagement/comments/1dpmqeg/weekly_rant_thread/",
        "content": "Share your frustrations and get support/feedback. You are not alone!",
        "num_comments": 8,
        "comments": [
            "How long did it take for you to land a PM role after being laid off?",
            "Ouch. Telling your team that they're letting you go before telling you is so heinous. What a garbage fire. I'm glad you're out but sorry that it had to be this way.",
            "I have not landed one yet. It's been 2 1/2 months.... It's fine... I'm fine.... (*chews hands off out of frustration*)",
            "That's definitely 'twisting the knife' category - fuck an employer that does that and I'm also disappointed that not one of your team had the guts to confirm and tell you, too.",
            "Are you really though? Im stressing",
            "How many places have you applied to and what have you been doing in the interim?",
            "Applied to hundreds, fixing resume and studying questions to answer during screening calls",
            "Well. You invited me vent so... here goes. \n\n\\[\n\nWas hired at a global company to help integrate 5 separate products into one martech solution. They sold me into the idea hard. You'll join a team. There's a product leader at the top of each product and a CTO that is very product oriented. He interviewed me in fact and I was pleased with the idea of working under him. \"Join us and you'll get us ready to rock in this new vertical. Here's a nice big salary and the kind of level of responsibility that is a bit of a stretch but just enough of a stretch. It will be fun.\" \n\n  \nCut to two weeks after I joined...and the CTO quits.  I was able to corner him before he left and asked him why he was leaving. \"I don't want to get into advertising.\" \n\nIt caught me off guard. I'll be honest. I put my head down and kept at it. \n\nCut to 3 months after I joined... they fire the product heads of two of the other product lines and shutter the other one. Just close it up and walk away. Then they come to me and say \"We think you're amazing. You can be the product leader now. Isn't that great?\" And I took on the extra responsibility without a raise. \n\nGuys, I believed them. I literally believed them. Looking back now, that was perhaps the biggest mistake I made. I let them flatter me and I let it get to my head and I ignored all the very loud sirens going off all around me. Business collapsing. Product leaders getting fired. CTO leaving. Braintrust exedus. I told myself, \"I can save this. I can fix this.\" \n\n(sigh) \n\nCut to 15 months after joining. Business is in the toilet. I've participated in layoffs, actually fired 20+ people over the course of the last six months. I've worked crazy hours. I've turned into a bit of a monster at home and I get an email from the COO. No salutation. Just \"Errors and missed deliverables from your department that caused revenue losses:\" and bulleted list of the engineering deliverables that were late or that didn't deliver the business value in terms of sales that the sales org has surmised or just new features that had never been prioritized officially but were now on a list of items that were costing us money because they weren't complete. \n\n  \nAnd guys, I still didn't get it. I still didn't hear the sirens. I mean this one was just blaring in my face. \"They are building a paper trail to ax you! Dude! run!\" \n\nCut to 18 months after joining. They tell my team before me and so I have a morning of meetings with my team looking at me funny and laughing too hard at jokes. And on my 1:1 with the CEO they let me go and lock my computer, give me half my wages for 4 weeks and 2 months of Cobra and I'm gone. \n\n  \nOoof. \n\n  \nWhy am I venting to this thread? Learn from me lads and lasses. Pay attention to the signs. Be on the look out for the devil hubris. It will convince you you are invincible. If the person who hires you quits two weeks after you join. Leave immediately. Do not get attached to your team, or the project. You are doomed. \n\nRant complete  \n\\]"
        ]
    },
    "For senior product managers, whats the next career progression?": {
        "title": "For senior product managers, whats the next career progression?",
        "score": 5,
        "url": "https://www.reddit.com/r/ProductManagement/comments/1drblvd/for_senior_product_managers_whats_the_next_career/",
        "content": "Any senior PMs here who have transition to the next role after being senior?  Curious whats the career path for PMs",
        "num_comments": 14,
        "comments": [
            "Director/Principal/Staff is the most logical next step",
            "I feel stuck. 40 years old 15 years experience. I have applied to many director or product positions with no luck. Next step is leaving product for any sort of senior leadership role",
            "From my experience, its either Principal if you want to stay an individual contributor, Group PM for management track, or possibly associate director / director of the PM track is a bit less defined",
            "C suite, boards, entrepreneurship, advisor ship.",
            "Not sure if it is immediately after SPM but eventually you can be a Product Lead (they are paid handsomely like VP level) director of Product management, etc. \n\nTheres a book called Inspire by Marty Cagan who dedicates a chapter about all the different paths and the respective seniority level.",
            "Depends but its usually entry into leadership. That could be lead, manager, or group product manager.\n\nIf companies have the principal track thats usually the cap of the individual contributor track after Sr.",
            "Went from Senior to Lead 3.5 years ago. Got promoted to GPM 6 months after that. Still a GPM",
            "You can either continue managing products. If so, find bigger products, bigger audiences, bigger companies, more money. \nOr\nManage people and move up by managing more and more people.",
            "> I have applied to many director or product positions with no luck\n\nAny specific feedback you got on what it didn't work out?",
            "Product lead doesnt really exist in faang. Google does have a global product lead role but its actually closer to a GTM role and actually pays less than senior product manager."
        ]
    },
    "What makes you want to be a PM?": {
        "title": "What makes you want to be a PM?",
        "score": 33,
        "url": "https://www.reddit.com/r/ProductManagement/comments/1dqvfsz/what_makes_you_want_to_be_a_pm/",
        "content": "I’m curious for those trying to become PMs, why? \n\nI feel like I know PMs who still dont understand the role so I am curious for those not in the role, how do you view it and why do you want to do it? What do you expect? ",
        "num_comments": 67,
        "comments": [
            "I like getting paid and pretending Im smart",
            "Its all I know how to do and its too late for me to pursue my real dream of going back to Clown College",
            "The only role I can do after failing at being an entrepreneur",
            "Glad its Friday. Im gonna make some popcorn and watch them roll in.   Like you said, there are those in Product who dont understand the role as it is. Those not in product only see the tip of the iceberg. \n\nJust to be clear, whats beneath the surface isnt all bad. There are great things lurking there that you only find out when you have, or build, a great team.",
            "I love the NPD process. Doing VOC, requirements, design and prototyping, testing, seeing your ideas come to life while at the same time working the business side and getting ready to go to market and finally see people using your product.\n\nNow in reality there is a ton of stuff that detracts from that utopia but no job is perfect.",
            "I hate seeing the time and effort and skills of smart people wasted on either solving \"problems\" that don't exist, or tragically missing the mark based on an incomplete understanding of the problem. I think it's a massive societal waste, and I never wanted to be a position where an idiot PM wasted *my* time as an engineer.",
            "Too smart to be a salesman. \nToo dumb to be an engineer.",
            "I was too stupid/lazy to get good at programming in college, so I figured why not pretend to be the ideas guy?",
            "Leadership, curiosity, ambitions. Experiment without taking real risks cause its not your business. Learn more about niche industries.",
            "Mainly the money. I love being in a role dealing with egos, where every other person, from tech, ops and sales, feels they are better suited to lead product strategy and roadmap."
        ]
    },
    "Ideas for a 2h team building event for a fully remote team that gets together once a year. ": {
        "title": "Ideas for a 2h team building event for a fully remote team that gets together once a year. ",
        "score": 11,
        "url": "https://www.reddit.com/r/ProductManagement/comments/1dqzp2v/ideas_for_a_2h_team_building_event_for_a_fully/",
        "content": "Hi, as per title. \nI recently joined a fully remote company and I lead a team of product managers. The company has a on ground event once a year where everyone gets together in the same place for some days. I don't know any of my team members personally. \n\nDuring the those days, I will have a 2h time slot for an internal team event. I am wondering what to do in these 2 hours. I would like to build team spirit first with something that is both fun and educational. \n\nI don't want, however, to go over the same product topics I go with them every week (prioritization, solution design, project management, etc). We have masterclasses / guild meetings frequently to explore product topics and I would like to maximise the face to face opportunity to do something different and unique. \n\nAnyone has ideas? ",
        "num_comments": 18,
        "comments": [
            "Break the group into teams and do a mock shark tank but have the goal be to pitch the worst startup or product possible, as a parody. Team with the most hilariously bad product wins. My team did this recently and everyone loved it. It allows people to get creative and work as a team.",
            "IMO skip the education. There's enough of that normally. Just focus on having fun together to build connections.",
            "Have some beers and talk ",
            "Give everyone what they most deeply desire and skip the team building event",
            "This is a great idea!! Would love to know more details! Did you asked them to identify target audience and then to completely fail the design?",
            "Check out the game _Snake Oil_ for easy inspiration.",
            "I've done something like this before as a \"reverse brainstorming\" method. After you get all the bad ideas, you reverse them.",
            "I would like to mix the both ideally. But if not possible relationship building will be a lot more important than education.",
            "For the purpose of getting to know each other, I used to do a simple exercise that did pretty well.\n\nWhat you need: a big piece of paper, markers for everyone. \n\n1. You sit in a circle and have the paper in the middle, everyone has their name written on the rim of the circle. \n2. Then you ask questions like: what did you want to become when you were little? what bands/musicians do you listen to? etc.\n3. Everyone gets their turn to answer the question.\n4. If you have a similarity to the person's answer (ex. I also wanted to be an astronaut like Jerry), then you draw a line from your name to that person's name.\n5. At the end you see how many lines you have to your colleagues or how thick your line is to someone, which represents your connection to them.\n\nMight sound childish or too simple, but for me it worked surprisingly well.",
            "Don't make it educational. Focus on relationship building. Ideally people are belly laughing and can build a connection that will help them work better together from then on. \n\nI'd take any fun game you like to play at parties, so long it's not NSFW. \n\nGood candidates are charades, balderdash, celebrity heads or games like Avalon/Werewolves that involve deception and role playing. \n\nOr do something physical like axe throwing, laser shooter etc. \n\nYou want to have a chance for enough fun things to happen for people to develop in jokes and see each other's personality traits, like the quiet achiever, the hyper competitive one etc."
        ]
    }
}