{
    "A warning about safety in our subreddit and what to do about inappropriate messages.": {
        "title": "A warning about safety in our subreddit and what to do about inappropriate messages.",
        "score": 679,
        "url": "https://www.reddit.com/r/progresspics/comments/u6k3nl/a_warning_about_safety_in_our_subreddit_and_what/",
        "content": "Hi progresspics! We always strive to keep the subreddit as safe as possible, however, unsolicited/inappropriate Direct messages are always a possibility and unfortunately not one we can 100% prevent. While we hope people never receive anything that makes them uncomfortable, here are the steps you can take to report anyone who gets creepy in your DMs:\n\n1. report the user to us!\n\n \\-take screen shots of the messages, it doesn’t have to be the whole conversation, just make sure we can see their user name, and the inappropriate part. \n\n\\-upload the screens to imgur and send us a link via modmail.\n\nall users reported to us for acting inappropriately will be permanently banned, however, this doesn’t stop them from viewing the subreddit, or continuing to dm you, so..\n\n2) report the user directly to reddit at reddit.com/report\n\n3) block the user! Simply go onto their profile and click the three corner dots (mobile) or the “more options” button (desktop) to find the option.\n\nTo prevent ALL DM's you can disable the DM and chat request options like so:\n\nMobile: settings > account settings > blocking and permissions.\n\nDesktop: User settings > chat and messaging.\n\nAs an aside, a note on image theft:\n\nit's been brought to our attention multiple times over the last month or so that a few content farm websites and social media accounts have been reposting pictures from here, while there isn't much that we can do to stop that we do want to remind everyone that it is a potential outcome to posting your images online, especially in areas with a large pool of specific content to farm from, while we do not allow users to promote their social media, including the use of watermark handles, you may watermark your posts with your REDDIT user name if you so wish.\n\nWe hope you all stay as safe as possible and know that any problems or questions can be sent into our modmail. Keep it clean, keep it safe, and read the rules before posting!",
        "num_comments": 62,
        "comments": [
            "Hey mods. Any chance we can add flairs for weight change? Something along the lines of gain, loss, and maintained.",
            "Can we have a rule that before-after pics should go in the left-right order? The amount of pics in after-before order is too damn high.",
            "Hi mods! I wanted to ask about safety in another aspect. If someone drastically loses say 100lb in half a year and wasn't morbidly obese to begin with, would you still allow the post to be up despite how unhealthy it usually is? I don't mind reporting a post I found like that, or just ignoring it, depending on what rule you have about it.",
            "It's weird how people can change their bodies but are still unable to comprehend \">\" and \"<\" use.",
            "Why won’t it let me upload 2 pics? Before-after",
            "This may be random but as a minor (under 18) how can you show yourself looking stronger being fully clothed? I want to show my progress but I am afraid it will look the same or extremely similar being fully clothed unless I look completely different. Abs are hard to see under clothes, and biceps are still somewhat hard to see unless you wear a tanktop or something.",
            "Are we not allowed to post pics in a bikini if tagged NSFW? I’ve tried multiple times to post (with proper subject line format) and not getting approved.",
            "Didn't see this! We'll discuss it, thanks for the suggestion!",
            ">this seems like a good idea",
            "The number of these posts does seem to be growing. I don't see why they wouldn't make this a rule.\n\nAs it is now, there is a possibility that someone has worked really hard and wants to show off their progress, then someone innocently asks \"have you put these the wrong way round\" which accidentally hurts their confidence. With smaller changes accompanied by different poses and lighting, it isn't always obvious."
        ]
    },
    "M/25/5'10\" [289lbs > 170lbs = 119lbs] Today I hit 7.5% bodyfat, I never thought this could even be possible. Still working on building muscle and filling out loose skin but I wanted to take a moment to be proud of myself!": {
        "title": "M/25/5'10\" [289lbs > 170lbs = 119lbs] Today I hit 7.5% bodyfat, I never thought this could even be possible. Still working on building muscle and filling out loose skin but I wanted to take a moment to be proud of myself!",
        "score": 152,
        "url": "https://i.redd.it/vsmvt18pji9d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Awesome progress! What was your diet like and some of your favorite meals?",
            "Awesome job and any tips ?",
            "Tips? Do you keep weight lifting while losing weight, or just cardio",
            "Incredible weight loss. Keep yourself locked in. 👍🏻",
            "Huzzah! How'd ya do it?",
            "You've achieved a remarkable transformation man! Congratulations!",
            "Well done!",
            "# A quick reminder to those viewing this post: \n1. If you have not done so, **read [the rules](https://www.reddit.com/r/progresspics/about/rules)**\n2. Being a pervert will get you banned. \n3. Messaging OP lewd/inappropriate comments is not okay. \n4. OP is a real person. [Don't be an asshole](https://media.giphy.com/media/3oz8xt6aO8l4UjcnXa/giphy.gif). \n5. **Report rule breaking comments.**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/progresspics) if you have any questions or concerns.*"
        ]
    },
    "M/33/188cm [124kgs > 104kgs = 20kgs](6 months) not as crazy as a lot of transformations I see here but proud of myself for reaching 20kgs down. ": {
        "title": "M/33/188cm [124kgs > 104kgs = 20kgs](6 months) not as crazy as a lot of transformations I see here but proud of myself for reaching 20kgs down. ",
        "score": 218,
        "url": "https://i.redd.it/v4d1y39h2g9d1.jpeg",
        "content": "",
        "num_comments": 15,
        "comments": [
            "20kgs is great, you should be proud. Keep it up!",
            "20kgs is nothing to scoff at, great job my dude!",
            "4th time the charm? I DON'T KNOW WHAT YOU WANT FROM ME AUTOMOD lol",
            "Next 10kg will show massive visual improvements imo",
            "The transformation is there, trust me! Great work",
            "20kgs is 20kgs brother. Keep up the good work!",
            "You already look like a different person. Great work.",
            "Insane progress man! Keep it up!",
            "Thank you will do! Goal weight is 90 for now.",
            "Thank you. The encouragement is appreciated."
        ]
    },
    "M/33/6-1 [530>270=260]|11years| my battle of body dysmorphia. Lost tons of weight sat at 215 told I was to small, looked great at 245 but Covid hit gained weight and now back to 270 in the current pic. Finally feeling confident again.": {
        "title": "M/33/6-1 [530>270=260]|11years| my battle of body dysmorphia. Lost tons of weight sat at 215 told I was to small, looked great at 245 but Covid hit gained weight and now back to 270 in the current pic. Finally feeling confident again.",
        "score": 57,
        "url": "https://i.redd.it/9u0n1ms07i9d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Holy crap dude, great job! I did have to chuckle at the keg in the lap and an ashtray on the table. \n\nBrings back memories of college in the 80's. There was beer. Lots of beer. And unfiltered Camels. Frankly, I'm surprised we're all still alive after all that madness.",
            "Such a huge transformation! Killing it man!",
            "Wow! Great job! How much do you workout your upper body to get those killer arms?",
            "Lolol was a massive drinker then 🤣 but appreciate it",
            "Thank you, trying to get that into my own head is hard.",
            "Chest, shoulder arms, and back from lots of pulling motions. But thank you",
            "That body dysmorphia is real. But you look fitter than 90% of guys I see out and about. Such great transformation!",
            "Thank you very much that means a lot to me",
            "You look great!",
            "Thanks my dude"
        ]
    },
    "M/40/6'0\" [400lbs > 350lbs = 50lbs] | 6 months | Weight Loss Journey": {
        "title": "M/40/6'0\" [400lbs > 350lbs = 50lbs] | 6 months | Weight Loss Journey",
        "score": 208,
        "url": "https://i.redd.it/xrr7pw6rof9d1.jpeg",
        "content": "",
        "num_comments": 15,
        "comments": [
            "You can really see the reduction in gut size, good work!",
            "Duuude you’re awesome! Already major change!",
            "Good luck 😎 you're doing great",
            "Even your feet shrunk! Great progress!",
            "Good job! Hard work pays off!",
            "Thanks I’ll update you all to see if I meant my July goal or not. Wish me luck!",
            "Hoping for even more change soon! Ty!",
            "I think they were swollen before… ekkk",
            "Still have a lot more work to do. Honestly, I was feeling a bit down yesterday, feeling like I wasn’t seeing the results I wanted… then I went back and found the old gym pic and compared it with the new one and was like wow, I am making some progress!",
            "Great work!"
        ]
    }
}