{
    "Weekly Questions Megathread - June 25, 2024": {
        "title": "Weekly Questions Megathread - June 25, 2024",
        "score": 12,
        "url": "https://www.reddit.com/r/projectzomboid/comments/1dnsd1g/weekly_questions_megathread_june_25_2024/",
        "content": "Don't feel like your question warrants its own thread? This is the place for you. No matter if you just want to know if the game will run on your specific machine or if you're looking for useful tips because you've just gotten the game.\n\n&#x200B;\n\nYou can also hit us up on our [Discord](https://discordapp.com/invite/theindiestone).\n\n&#x200B;\n\nYou might find some of the answers to your questions in our [Wiki](https://pzwiki.net/wiki/Main_Page).",
        "num_comments": 69,
        "comments": [
            "Can I get a 4 sentence blurb on what the fuck is going on with the drama??",
            "Does the \"Handy\" trait affect crafted spear durability?",
            "Does height matter in relation to making noise attracting zombies? If I shack up in a tower, do I need to worry about nearby zomboids on ground level?",
            "Feels like it's been a year or two since I checked in on this: does anyone know how many more years until Build 42 comes out?",
            "Are there any unbreakable defences? Like fences, cars, something?",
            "Where can I find Propane Tanks in Louiseville? \n\nChecked warehouses, nothing. Had to go to a certain house with BBQ, but there are not many of those either. Where?",
            "What does anxiety do? If I stop smoking, will I always be anxious if I don't smoke, or can I withdraw from smoking but it takes very long?",
            "What does soft resetting a MP game do?",
            "I don't care how long this new patch takes to drop. Keep cooking, guys, and don't stop until you are satisfied with your work. It's a MASSIVE task you guys have taken on, and I can't wait to see the final product. Ignore all the people who are making things harder for you! Keep cooking, guys!",
            "Newbie question here: What are loot respawnable locations/crates?"
        ]
    },
    "The Biomic Man": {
        "title": "The Biomic Man",
        "score": 474,
        "url": "https://projectzomboid.com/blog/news/2024/06/the-biomic-man/",
        "content": "",
        "num_comments": 198,
        "comments": [
            "We also just wanted to acknowledge to the Reddit and wider community that we should have been clearer, and that we should never have posted here about us thinking that 42 Unstable could be ready within the first half of the year.  \nWe should have kept expectations reasonable in later blogs and community interactions, despite us being confident and holding out hope internally that it could come around within the first two quarters.",
            "The orange streetlights got me feeling all nostalgic. That screenshot of Spiffos all lit up looks awesome. Gonna be extra sad when the power cuts off now.",
            "Man that new lighting will make driving through Louisville at night while it's raining so more groovy, I just hope build 42 won't increase the load on my CPU (it's a second gen i5, it's bad)",
            "The lighting I want it! Thank you devs for making this game feel so loved",
            "sad to see how the bow has been cut from the initial release. that was my most anticipated addition. i hope it comes sooner rather than later in future updates.",
            "Loving what Im seeing, ever so slightly sad to not see anything about vehicles but Im still crossing my fingers",
            "Really love the look of that crafting menu.",
            "What does pollution resistant forest mean",
            "If I recall correctly, somewhen two years ago I was reading a dev diary about separate team of devs working simultaneously on b43/npcs, is it still the case today?",
            "Can't wait, thanks for your hard work."
        ]
    },
    "Wedding Day (OC)": {
        "title": "Wedding Day (OC)",
        "score": 922,
        "url": "https://www.reddit.com/gallery/1dqtxq9",
        "content": "based on when there was an actual bride and groom spawn in the church (never happened to me before) and it lowkey made me sad.",
        "num_comments": 40,
        "comments": [
            "Despite the game going through great lengths to show this, I've never thought about how my player characters would see the death and destruction around them. Great work capturing the desolation of the apocalypse!\n\nThat said, don't forget to loot them for your outfit collection lol",
            "Hell nah, bro is rocking the birkenstocks while killing zombies. RIP clean socks",
            "We usually play the games without paying much attention to the zombies themselves, like, we look at the kill numbers and always try to get them higher, but every kill is actually a former person with dreams, emotions, friends, families and a whole life before and ahead of them.\n\nIt's truly haunting to look at this like that.",
            "Man, the wedding and birthday events always kinda confuse me because they're kinda serving the same purpose as the skeletons in the Fallout games of serving as visual storytelling of what people were doing just before they died. But these events in particular seem to imply that the zombie apocalypse was very sudden. Like, the symptoms of the Knox Virus takes days to kill a person, and they progressively get worse day by day.\n\nAm I really supposed to believe these people were nauseus, nervous wrecks with a high fever that had been plagueing them for days, and still decided to show up to their mate's birthday?",
            "this is so good, holy shit",
            "I also had this exact moment but I instead stole the brides panties than left like nothing happened.",
            "Makes me think of Kill Bill.",
            "I love roleplaying out my characters, why I love \"The Only Cure\" mod too cause it gives you a choice of making your character someone who will do anything to not turn based on the type of person you made.",
            "Through the power of Holy Crowbar, they have been laid to rest together. Do not mourn them, their ordeal is over, and you still have work to do.",
            "Hell yeah no more happy couples "
        ]
    },
    "I recive:": {
        "title": "I recive:",
        "score": 310,
        "url": "https://i.redd.it/ybnndlq6cf9d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Wait you guys say L10 not Lvl10?",
            "You think it was only 2000??",
            "And a nice little bite in the neck :'3",
            "Put them in the stove as fuel",
            "It was worth it though. Now when my leather jacket gets a new hole in it I can patch it up by ripping up another leather jacket into strips. Oh boy, I sure do hope that unique cosmetic items dont have the cannot be repaired tag!",
            "If I put lvl i'd have to shrink the writing",
            "2000 after all the losses from patching/unpatching the same sweater a billion times",
            "Makes sense Huge L wins"
        ]
    },
    "Glazing? Seething? Who cares if your having fun right now.": {
        "title": "Glazing? Seething? Who cares if your having fun right now.",
        "score": 158,
        "url": "https://i.redd.it/uri3c1wvbg9d1.jpeg",
        "content": "",
        "num_comments": 27,
        "comments": [
            "People enjoying the present and having fun. Craving for future is a dumb and unproductive. If build 42 is the main thing that you missing in your life to be happy, then you should be worrying about your mental health.",
            "Can't wait for them to update it.\n\nThe amount of REEE's people will screech at the top of their lungs due to mods not working will be a sught to behold.",
            "Build 42 is \"around the corner\", but Mr krabs is sharing a level of joy and sadness that the player isn't experiencing it yet.\n\nBuild 47, which is everything the game could be (and probably should already be at this point), simply will never exist. And all of the potential of the game will be missed out on by the player.l",
            "It not like my current survivor is going to last without catching a lil nibble until Tuesday, never mind when the next build finally drops.",
            "None of that is what the meme suggests, and that's telling about your interpretation of others people and their minds...",
            "Who cares about mods, the game is gonna be amazing.",
            "I'm a veteran, these youngsters need to learn to let the devs cook. it might take a decade, but gosh darn is it good. their big updates seem to overhaul the game so much that it almost feels weird to get it for free",
            "Sorry but I really dont get it",
            "I do believe everyone saying they havent seen a single bad comment about the devs, I havent either until about a week ago when everyone started talking about this and i browse this sub somewhat often. At the moment though, yeah it is a problem seeing a few impatient people respond with negativity on every post about build 42",
            "Yes there's a huge problem with the fans."
        ]
    }
}