{
    "Using a HDD on two machines [nobody:nogroup]": {
        "title": "Using a HDD on two machines [nobody:nogroup]",
        "score": 6,
        "url": "https://www.reddit.com/r/Proxmox/comments/1dr707m/using_a_hdd_on_two_machines_nobodynogroup/",
        "content": "Hey guys. My setup uses Proxmox and two Ubuntu LXCs which can access the same drive. I noticed that some of my files are not modifiable by my scripts lately and found that my one LXC can access everything and has user:users in the permissions of a file whereas my other LXC only shows nobody:nogroup is there a way that files will not change once they are touched by either of the LXC or can I add a whitelist or something? \nHelp would be greatly appreciated ",
        "num_comments": 11,
        "comments": [
            "Easiest would be to Just Set owner appropiately to 100000 + uid inside the unprivileged lxc.\n\nJust add such group/user in the vm as Well. You could also use usermapping for the lxc.",
            "I have read through some stuff on this topic now and from what I get this is a possibility to have a user with the same UID operating across multiple LXC/VM. Is that correct?",
            "Certainly, same uid in different systems would basically be the same user. In this case its just, that the uids of the lxc ct having another uid range (e.g. if youd change the owner to 100000 in proxmos, then inside the lxc it should be root displayed) - at least in the case of unprivileged ct's.",
            "Yes, this is what I do, I have the same user with the same uid and group in every LXC/VM, prevents any permission issues with shared files.\n\nThe nobody:nogroup I believe is because the user that made the files doesn't exist in the LXC you're looking from.",
            "Actually ITS more than that - thee uid of the owner cannot exist (w/o usermapping) bc normally the IDS would be less than 100000. Not sure, but i think those ids are mapped to -1. If IT were Just the Case that the User does Not exist then the IDS would be displayed instead of the User/group name",
            "With anything you're copying and pasting, you should spend some time googling every term you're not familiar with, this way you can adjust it to your exact setup and solve these issues.\n\nSorry I can't be more helpful than that, it's just how I approach any code blocks I find on the internet.",
            "Yes, as i said: its easier to let the lxc (User) \"own\" the storage because usermapping might be Not that easy. U need to allow root namespace via /etc/subuid (subguid), the ids in the conf must not overlap (obviously) but on the other Hand If u map one ID manually you need to map the whole ID range. There should be a debug flag for Logs when starting the ct via cli - those logs might help\n\nBy the way: If you Had a User, lets das with id 1000 in the lxc and after that do the usermapping 1000 -> 1000 then this ID (101000) does Not exist anymore. Meaning ofc you cannot Login as this User and moreover Files/folders owned by that User then are owned by \"Nobody\" and you might lose Access there",
            "I see your point. But I wanted to try the \"default\" scenario. If I start messing around prior to trying what works normally I might be the problem and I want to rule out as many factors as possible. Still you are very correct. But I am careful after having lost my data once. This might be a good moment to say I do have backups now",
            "There is no \"default\" is my point. For that you would have to be starting from scratch everytime.\nBy knowing what you're doing at each step you can also understand what you're starting with when you try to do something else.",
            "Depends if your lxc is privileged or unprivileged. In both cases, permissions must match between hosts accessing the directory.\n\nIn a privileged lxc, uid/gid simply has to match what's on the host and ownership of the bind map directory. If you have a plex user with uid/gid of 1003 running the plex service, that user must also exist on the host and have ownership of the bind mount directory.\n\nSame scenario with unprivileged, but there additional uid/gid mapping between host and lxc. The proxmox wiki entry for \"unprivileged lxc\" has a basic run down of the settings needed and the mapping syntax. Stephane Graber's blog also has an entry from way back on this that goes a bit deeper. It's still valid, the mapping hasn't changed since he wrote it.\n\nThe whole mapping thing is handled a bit differently in Incus, but the underlying principles are the same."
        ]
    },
    "LAN with unmanageable switch": {
        "title": "LAN with unmanageable switch",
        "score": 3,
        "url": "https://www.reddit.com/r/Proxmox/comments/1dr7uxg/lan_with_unmanageable_switch/",
        "content": "Good morning,\n\nI'm a beginner in networking, I want to learn and I have a problem with an unmanageable switch. I don't know if I can solve it or not...\n\nI have a mini PC with a WAN port and a LAN port.\n\nMy proxmox contains several VMs in VLANS allowing my network to be segmented (web server in a DMZ for example).\n\nVLANS cannot communicate with my LAN.\n\nOPNSense is my router in a VM (I know, it's not optimal but I'm trying to get my homelab working at the moment).\n\nMy personal home network is in the LAN without VLAN (there are also VMs in this LAN).\n\nWhen I plug my physical LAN port into my unmanageable router, the devices have no network.\n\nIf I plug it into a router (transformed into a wifi AP), it works. It doesn't manage VLANs but it is smart.\n\n\n\nIs there anything I can do to make my unmanageable switch work on my LAN?\n\n\n\nThank you for your help.",
        "num_comments": 4,
        "comments": [
            "Ok I get what you mean now. \nHave you confirmed that the LAN NIC is properly passed into your OPNsense VM? That would be my first guess.",
            "Think of an unmanaged switch as a power board, all it does is give you more ports, that's it. It has no idea what's actually connected to it.\n\nAre you saying the devices plugged into the switch have no network?\n\nAnd by network do you mean internet connection? Or connection to your LAN?\n\nIs it possible when you connect to the AP you're getting internet but not LAN?\n\nWhat is the AP connected to to get its internet connection? Is there another device somewhere here you haven't mentioned?",
            "Thank you for your answer.\n\nThe devices plugged into the switch have no connection to the LAN.\n\nI want to connect my physical LAN output to the switch, and connect the AP to this switch.\n\nThe AP would therefore have the connection to the LAN and the internet.",
            "It doesn't make any sense using VLANs if your switch does not support it."
        ]
    },
    "run NAS VM on a node of proxmox cluster": {
        "title": "run NAS VM on a node of proxmox cluster",
        "score": 4,
        "url": "https://www.reddit.com/r/Proxmox/comments/1dr5z3x/run_nas_vm_on_a_node_of_proxmox_cluster/",
        "content": "Hi everyone, I am a newbie and still on a learning phase. Currently I created a cluster of 3 Proxmox nodes and setup TrueNAS VM on one Node. \n\nWhen I turn on TrueNas, proxmox force me to turn on other node to get quorum. Is there anyway that I can set that node (having TrueNas) work alone permanently but it still can join cluster anytime other node turn on ?\n\nThank you so much for your help!",
        "num_comments": 5,
        "comments": [
            "I tried this one but it is not permanent.  After turning on the node, I have to run this command before turning on TrueNas. it is a solution but I am seeking something more convenient.\n\nAnd also, when I run this command, other VM (disks on TrueNas) will migrate to this node :(",
            "Thank you so much for the guidance.\n\nAfter familiar with TrueNAS I will move it to a physical DIY NAS. For now, the second option sound promising, I will continue with that",
            "In a cluster you are not meant to shut down individual nodes for a prolonged amount of time. \n\nThere are a few options now: \n\nRemove you TrueNAS node from the cluster and let it run individually. \n\nTurn off High Availability so your TrueNAS does not migrate, next create a script that pings the other node and when it is offline executes the pvecm expected 1 command. Use cron to run it every ten minutes or so. \n\nLet the other nodes online or use external voting as described in the linked thread.",
            "You can set the expected amount of votes to 1 if you quickly want to start up TrueNAS.\n\npvecm expected 1\n\nThis thread pretty much discusses your application: https://forum.proxmox.com/threads/cluster-quorum.109740/"
        ]
    },
    "Need Help..Stuck at Installation (not even started yet)": {
        "title": "Need Help..Stuck at Installation (not even started yet)",
        "score": 3,
        "url": "https://www.reddit.com/gallery/1dr750x",
        "content": "Hi guys,\n\nNeed some advise here. I’m trying to convert a pc running Truenas Scale to Proxmox. Anything I should do prior to Proxmox installation ? (No data need to be back up or transfer)\n\nReason for asking is because I’m so stuck..the process just stuck at this stage, after I start the installation process. I tried different USB ports, recreate installation usb disk, BIOS reset, replace the nvme drive (with truenas installed) with another nvme drive, took out and put back the RAM..what else I’m missing ??\n\nAnyone have any ideas? Really need some help here\n",
        "num_comments": 9,
        "comments": [
            "From memory, choose the non gui installation. Or maybe safe mode or something? Happened to me ages ago and one of those was the fix from memory.",
            "I had the same issue with an Nvidia card thr only way to do it is to install the v7 iso then upgrade",
            "The thing that stopped me installing was having the BIOS set to RAID rather than AHCI. Though I think the failure to install happened when trying to chose (and not finding) a disk to install on (I was using the graphical installer).",
            "I wil try out the AMD card or V7 ISO method first..thanks for the reply 😇",
            "There’s no dedicated GPU card on my PC..but I will try to put in an AMD card and see how it goes..thanks for the link shared..now I have 2 options to try out. \n\nThanks man !! Appreciated..",
            "Thanks for the info, I will try to put in an AMD and see how..if cannot, then will go for V7 solution ..\n\nThanks a lot !",
            "Mine already set to AHCI..should be the graphic driver issue or V8 bug",
            "No problem hope it works out I got fed up but once it was up and running I'm enjoying it very much",
            "It seems that the installation is freezing during loading drivers. A quick search on the issue yielded [this](https://forum.proxmox.com/threads/proxmox-8-installer-freezes-at-boot.129341/) post, where someone suggests that the issue was caused by an nvidia card on their end. What's your hardware? Can you try to swap out the card to an AMD one to see if that works?\n\nAlso, see [this](https://forum.proxmox.com/threads/proxmox-8-installer-freezes-at-boot.129341/post-570738) comment, which may also help."
        ]
    },
    "Installation stuck ": {
        "title": "Installation stuck ",
        "score": 0,
        "url": "https://www.reddit.com/r/Proxmox/comments/1drakbm/installation_stuck/",
        "content": "I have a problem with Proxmox when I'm installing. it's stuck and won't install. I have a NVIDIA Quadro K4000. (i think it's too old) I have tried trough Motherboard, but it didn't help. Any tips?",
        "num_comments": 1,
        "comments": [
            "Install the last version of pve7 first then upgrade it"
        ]
    }
}