{
    "Which ps3 game should I play first?": {
        "title": "Which ps3 game should I play first?",
        "score": 65,
        "url": "https://i.redd.it/9e29xt2uwg9d1.jpeg",
        "content": "",
        "num_comments": 51,
        "comments": [
            "Uncharted 2 is really good",
            "I vote either NFS Carbon or GT5 depending on what kind of racing game you want.",
            "I heard “The Last of Us” was a great story and play-through. Still have yet to experience it.",
            "Batman, Uncharted, or Red Dead",
            "Call of duty 4 modern warfare en after that call of duty modern warfare 2",
            "Does it have to be from that shelf? Cause none of those are in the top ten for me tbh.",
            "Black ops 1 or cod4",
            "Call of Duty : Black Ops",
            "The answer is always 'YES' not anything specific",
            "I'd say Batman Arkham City (or play Arkham Asylum first if you have'nt already). If you're in for something short and sweet, go play Uncharted: The Lost Legacy on PS4. It's not that long and it was great!"
        ]
    },
    "ITS FINALLY HERE": {
        "title": "ITS FINALLY HERE",
        "score": 17,
        "url": "https://i.redd.it/lah7zqtgsi9d1.jpeg",
        "content": "MY PS3 60GB MODEL IS HERE ",
        "num_comments": 2,
        "comments": [
            "I am soFreaking jealous of you right now😃",
            "Delid + repaste ASAP"
        ]
    },
    "Should i unplug my ps3": {
        "title": "Should i unplug my ps3",
        "score": 17,
        "url": "https://i.redd.it/i4mel2xwvi9d1.jpeg",
        "content": "GT6 is taking way too long to update, I let it download around 4 am thinking it would take around 10 mins or so but i ended up falling asleep and woke up to this. Should i just forcefully turn off my console or let it download? Also which other games take super long to update so I know next time?",
        "num_comments": 19,
        "comments": [
            "That’s just gt6. Welcome to the club",
            "Do NOT unplug it. It's a normal process, it took 6 to 9 hours for my 25xxA to install it.",
            "Dont unplug it as it doesn't have rest mode like Ps4 and ps5\n\nDo what I do and leave it on and watch a film or do something else for a bit",
            "It is highly recommended to NOT install all updates on GT6 at once. You download one or two updates, press Circle, start the game, wait it to \"prepare\" and then quit the game and make the same procedure agsin until it doesnt ask anymore to update. This game is extremely annoying to update",
            "I thought you wrote GTA 6, sorry",
            "Absolutely not. Wait it out",
            "alright it sucks that its so long",
            "okay thank you, do you know any other games that have updates this long",
            "yeah but im already at this point so I guess i might as well update",
            "GTA6 running on PS3 would be wild lol"
        ]
    },
    "Got these all for €25!": {
        "title": "Got these all for €25!",
        "score": 14,
        "url": "https://i.redd.it/nxd5uhfnci9d1.png",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Absolutely steal a good 200 hours of gameplay there",
            "Not bad at all, they are all great classic games.\n\nI hope that you are not into trophy hunting though, since most of these Platinums are unobtainable, unfortunately.",
            "If you are interested in trophies \n \nAssassins creed (has no trophies) \nUncharted drake fortune (platinum obtainable)\nAssassin creed 2 (platinum obtainable)\nUncharted 2 among thieves (platinum unobtainable)  \nAssassin creed brotherhood (platinum unobtainable)\nUncharted drakes deception (platinum unobtainable)\nAssassins creed revelations (platinum unobtainable)\nAssassins creed 3 (platinum unobtainable) \nAssassins creed black flag (platinum obtainable 100% has dodgy trophy where have to delete all friends in account to be able to complete it)",
            "W"
        ]
    },
    "I always found it interesting that the ps3 had two different logos. Which one is your favorite? Mine is the 2009 to current just because of the futuristic design": {
        "title": "I always found it interesting that the ps3 had two different logos. Which one is your favorite? Mine is the 2009 to current just because of the futuristic design",
        "score": 1112,
        "url": "https://i.redd.it/e5dvzbhr7b9d1.jpeg",
        "content": "",
        "num_comments": 160,
        "comments": [
            "The right signifies the rebranding Sony went through to even the odds against Xbox 360.",
            "I prefer the Spider-Man font for the full “PlayStation 3” name, but for the abbreviated “PS3” logo I prefer the 2009 and on one.",
            "I always prefer the 2009 one for the game covers",
            "The old one, even games covers looked better before using the side text",
            "I like the original because it reminds me that only the rich people can buy it during its early years.",
            "Nah I prefer the new design. It is like PS2/PSP designs,but futuristic. It is a proper reintroduction and the continuation of the motifs introduced by the 6th gen design language. The spiderman font is a meme and a fond memory at best, a little ugly at worst.",
            "2006 has so much aura",
            "The 2009 one is better, because it looks like the later PlayStations. In my opinion, this logo says \"I’m one of the world’s first modern video game consoles\", and it’s true because the PS store arrived with it.",
            "The 2009 one is the best one just because of better box art.",
            "I prefer the old font just because its connection to Spiderman makes it so fun and makes me imagine Spiderman himself buying one!"
        ]
    }
}