{
    "PS5 Help and Questions Megathread | Game Recommendations, Simple Questions, and Tech Support": {
        "title": "PS5 Help and Questions Megathread | Game Recommendations, Simple Questions, and Tech Support",
        "score": 19,
        "url": "https://www.reddit.com/r/PS5/comments/1dhvbr9/ps5_help_and_questions_megathread_game/",
        "content": "Looking for info about M.2 SSD expansion drives?  [See the megathread](https://www.reddit.com/r/PS5/comments/ou5lam/ps5_internal_ssd_expansion_megathread/).\n\n---\n\nSometimes you just need help. But often times making a new post isn't needed. For the time being, around launch and perhaps in the future. We will use a single thread for helping each other out.\n\nBefore asking, we ask you to look at a few links. Some question can't be answered and only official PlayStation support can help you.\n\n*PlayStation Official*\n\n* [**PS5: The Ultimate FAQ**](https://blog.playstation.com/2020/11/09/ps5-the-ultimate-faq/)\n* [**Getting started with your new PlayStation®5 console**](https://www.playstation.com/en-gb/support/hardware/ps5-get-started-set-up/)\n* [**PlayStation Support**](https://www.playstation.com/en-us/support/)\n* [**PlayStation Network (PSN) Service Status**](https://status.playstation.com/)\n* [**AskPlayStation Official PlayStation Support**](https://twitter.com/AskPlayStation)\n* [**Restore Licenses**](https://www.playstation.com/en-us/support/games/restore-licences-playstation/)\n* [**Safe Mode Functions - database rebuild, factory reset, etc**](https://www.playstation.com/en-us/support/hardware/safe-mode-playstation/)\n\n*Community Help*\n\n* [**Playstation Community List**](https://www.reddit.com/r/PS5/wiki/communities)\n* [**PS5 Error Code Database**](https://docs.google.com/spreadsheets/d/1gIOZsPyHt8oGngAOXgGXI3Hzxmmn8WDbOKZrzXYUz-4/edit#gid=822356860) | from r/PlayStation\n* [**PS5 Weekly Question Thread**](https://www.reddit.com/r/PS5/search?q=PS5+Help+%26+Questions+Thread+%7C+Simple+Questions%2C+Tech+Support%2C+Error+Codes%2C+and+FAQs&restrict_sr=on&sort=new&t=all) | from r/PS5\n* [**PS5 Launch Guide**](https://www.reddit.com/r/playstation/wiki/ps5) | from r/PlayStation\n* [**Misc Guides for PlayStation**](https://www.reddit.com/r/playstation/wiki/guides) | from r/PlayStation\n* **ps5-orders,** **general-support & tvs-and-accessories discord channels** | from our [Discord.gg/ps](https://discord.gg/ps)\n* r/DualSense\n\n[**Google**](https://www.google.com/) and [**Reddit Search**](https://www.reddit.com/search/) is also a great way to find an answer or get help. View all past help and questions threads [**here**](https://www.reddit.com/r/PS5/search/?q=PS5%20Help%20%26%20Questions%20Thread&restrict_sr=1&sort=new).\n\nFor all future help, tech support and more, we ask that you create new threads on r/PlayStation instead of here on r/PS5.\n\n---\n\nCan't decide what to play next?  Is your favourite game underappreciated and more people need to play it? Need a new TV and not sure what to buy?\n\nShare (and request) your recommendations here!",
        "num_comments": 343,
        "comments": [
            "Welcome! Before posting, please take a look at our [FAQ and Troubleshooting Guide](https://www.reddit.com/r/PS5/wiki/troubleshooting) for answers to commonly-posted questions and technical issues.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PS5) if you have any questions or concerns.*",
            "Went to buy something from the PlayStation app and redirected to main PlayStation website \n\nWent to buy shadow of erdtree and got redirected. Went to manage games. Got redirected. Did they remove the ability to buy games through the app?",
            "I'm considering getting a Pulse headset, but I'm not sure if I should go with the 3D or the Elite? From what I can gather, the sound is better in the latter, and it's more comfortable. But the 3D is cheaper, had a chat mix option that lots of people like, and it might be more consistent with it's connections?\n\n\nAny thoughts on these? ",
            "Games similar to the MJ Steath missions from Spiderman 2? Kinda crazy ask lol",
            "Planning to use the PS5 on a carnival event (there'll be several classrooms prepped for this specific purpose). \n\nGames need to be short in general. Currently I got Street Fighter V, Need For Speed Unbound and Sonic on the table.\n\nAny suggestions would be appreciated, thx guys 😃",
            "Distribution cables near my house were hit by lightning and it affected appliances at my house, my ps5 and tv were fried, had both repaired and bought surge protectors for both but ps5 still has issues, it’s overheating and turns off in games or after idling for a while I noticed the fan not running when I ran it with the covers off how can I test functionality of the fan or any pin layout for the fan and if the problem isn’t the fan what could be the issue \n\nI’ve tried a couple repair guys and I live in Zimbabwe so right now repairing it myself is my only option",
            "I was thinking about buying a SoundBar C450 but then I realised it doesn't have Aux input (None of the soundbars do.)Is there any similar alternatives the soundbars that has Aux in? It needs to be something I can put in the middle, looks nice and has a subwoofer. Gonna spend around $350",
            "Looking for more games I should try that are similar to dredge?",
            "How can I play Jedi Fallen Order using EA play on PS5?\n\nMy younger brother just got a PS5 and he mentioned smth about EA Play so he can play Jedi Fallen Order. Is that still possible? And can someone explain how to do that?",
            "I've been struggling to find a good quality monitor suitable for a ps5 which I can play casual solo story line games with good graphics quality. while also being able to switch to a fast pace high refresh rate for FPS games. My budget is around £150-£200\n\nDoes anyone have any suggestions or advice for what monitor to get."
        ]
    },
    "Elden Ring: Shadow of the Erdtree | Review Megathread": {
        "title": "Elden Ring: Shadow of the Erdtree | Review Megathread",
        "score": 362,
        "url": "https://www.reddit.com/r/PS5/comments/1disu5d/elden_ring_shadow_of_the_erdtree_review_megathread/",
        "content": "\nGame Information\n--------------------\n\n**Game Title**: Elden Ring: Shadow of the Erdtree\n\n**Platforms**:\n\n- PC (Jun 21, 2024)\n- PlayStation 5 (Jun 21, 2024)\n- PlayStation 4 (Jun 21, 2024)\n- Xbox One (Jun 21, 2024)\n- Xbox Series X/S (Jun 21, 2024)\n\n**Trailers**:\n\n- [ELDEN RING SHADOW OF THE ERDTREE ストーリートレーラー【2024.05】](https://www.youtube.com/watch?v=FnqljpQO6jY)\n- [ELDEN RING SHADOW OF THE ERDTREE ゲームプレイトレーラー【2024.02】](https://www.youtube.com/watch?v=VPRZnG8Vfsk)\n\n\n**Developer**: FromSoftware\n\n**Publisher**: Bandai Namco Entertainment\n\n**Review Aggregator**:\n\n**[OpenCritic - 94 average - 98% recommended - 61 reviews](https://opencritic.com/game/16525/elden-ring-shadow-of-the-erdtree)**\n\nCritic Reviews\n-------------\n    \n\n**[AnaitGames](https://opencritic.com/outlet/691/anaitgames)** - [Víctor Manuel Martínez García](https://opencritic.com/critic/6087/v-ctor-manuel-mart-nez-garc-a) - *Spanish* - [10 / 10](https://www.anaitgames.com/analisis/analisis-de-elden-ring-shadow-of-the-erdtree)\n\n>FromSoftware's ambitious and irrepressible open world expands with an expansion that summarizes, condenses and elevates the great virtues of the base game, reminding us why we fell in love with the original in 2022.\n\n-------------\n\n**[Arabhardware ](https://opencritic.com/outlet/865/arabhardware-)** - [Ahmed Yousry](https://opencritic.com/critic/9364/ahmed-yousry) - *Arabic* - [10 / 10](https://arabhardware.net/reviews/elden-ring-shadow-of-the-erdtree-review)\n\n>It's not an expansion, it's a whole new game that elevates everything elden ring presented on all fronts while also making it even better\n\n-------------\n\n**[Bazimag](https://opencritic.com/outlet/594/bazimag)** - [Hamidreza Ghaneei](https://opencritic.com/critic/4840/hamidreza-ghaneei) - *Persian* - [10 / 10](https://www.bazimag.com/review/14899-shadow-of-the-erdtree-elden-ring-review)\n\n>Shadow of the Erdtree is a remarkable expansion that compellingly concludes the unfinished tale of Miquella and his followers. The meticulously crafted stages, deep narrative, rich character development, diverse array of new items, and distinctive soundtrack elevate this add-on to the same stellar quality as the original game.\n\n-------------\n\n**[Boomstick Gaming](https://opencritic.com/outlet/545/boomstick-gaming)** - [Boomstick Alex](https://opencritic.com/critic/4242/boomstick-alex) - [5 / 5 ](https://www.youtube.com/watch?v=HOa4zsz2AKA)\n\n>Video Review - Quote not available\n-------------\n\n**[But Why Tho?](https://opencritic.com/outlet/722/but-why-tho-)** - [Eddie De Santiago](https://opencritic.com/critic/9637/eddie-de-santiago) - [10 / 10](https://butwhytho.net/2024/06/elden-ring-shadow-of-the-erdtree-review/)\n\n>Elden Ring was a massive endeavor and success, and instead of coasting on that success, they turned Shadow of the Erdtree into a thrilling final adventure with its own identity.\n\n-------------\n\n**[CGMagazine](https://opencritic.com/outlet/82/cgmagazine)** - [Zubi Khan](https://opencritic.com/critic/4059/zubi-khan) - [9.5 / 10](https://www.cgmagonline.com/review/game/elden-ring-shadow-of-the-erdtree/)\n\n>Elden Ring: Shadow of the Erdtree elevates the already stellar base game to new and challenging heights, adding a wellspring of content that cannot be missed, making it an essential must-play for all Elden Lords.\n\n-------------\n\n**[COGconnected](https://opencritic.com/outlet/94/cogconnected)** - COGconnected - [97 / 100](https://cogconnected.com/review/elden-ring-shadow-of-the-erdtree-review/)\n\n>It’s a continuation of what made the Elden Ring fantastic in the first place. An epic adventure!\n\n-------------\n\n**[Cerealkillerz](https://opencritic.com/outlet/465/cerealkillerz)** - [Gabriel Bogdan](https://opencritic.com/critic/3388/gabriel-bogdan) - *German* - [9.3 / 10](https://cerealkillerz.org/review-elden-ring-shadow-of-the-erdtree-review/)\n\n>Elden Ring Shadow of the Erdtree exceeds all expectations and overshadows every other expansion out there. With around 20-30 hours of new challenging content and areas, designed for veteran players, is the label \"expansion\" a bit of an understatement. Considering the sheer amount of new elements, including some of the most spectular boss fights of the series, smaller shortcomings such as reused enemy types that could've used a bigger facelift, or that upgrades only give you a generic boost for two values, carry no weight in the full picture.\n\n-------------\n\n**[Checkpoint Gaming](https://opencritic.com/outlet/563/checkpoint-gaming)** - [Omi Koulas](https://opencritic.com/critic/5958/omi-koulas) - [10 / 10](https://checkpointgaming.net/reviews/2024/06/elden-ring-shadow-of-the-erdtree-review-pure-and-radiant/)\n\n>Shadow of the Erdtree not only expands upon Elden Ring's lore and gameplay mechanics but also enriches the experience with its atmospheric storytelling and intricate world design. It beckons players to embrace the daunting journey through the Shadow Realm, promising a gripping adventure that resonates with the hallmark blend of challenge and discovery. What's on offer is one of the best FromSoftware experiences to date, capturing everything that made Elden Ring special and more.\n\n-------------\n\n**[ComicBook.com](https://opencritic.com/outlet/862/comicbook-com)** - [Tanner Dedmon](https://opencritic.com/critic/9246/tanner-dedmon) - [5 / 5 ](https://comicbook.com/gaming/news/elden-ring-shadow-of-the-erdtree-review/)\n\n>There's no doubt in my mind that there's more to do still in Shadow of the Erdtree if not in this playthrough than definitely the next. If anything, all those missed connections and areas unexplored only make the prospect of returning to the Realm of Shadow on New Game+ with a bunch of new toys to play with that much more enticing.\n\n-------------\n\n**[ComingSoon.net](https://opencritic.com/outlet/845/comingsoon-net)** - [Tyler Treese](https://opencritic.com/critic/65/tyler-treese) - [9.5 / 10](https://www.comingsoon.net/games/reviews/1770021-elden-ring-shadow-of-the-erdtree-review)\n\n>This massive expansion makes an all-time great game even better and is a must-purchase for those who have finished the original.\n\n-------------\n\n**[Destructoid](https://opencritic.com/outlet/90/destructoid)** - [Chris Carter](https://opencritic.com/critic/431/chris-carter), [Steven Mills](https://opencritic.com/critic/10000/steven-mills) - [9.5 / 10](https://www.destructoid.com/reviews/review-elden-ring-shadow-of-the-erdtree/)\n\n>I think that’s the biggest point here, is that even though my expectations were high, Shadow of the Erdtree still managed to exceed them. From Software probably could have just added more Elden Ring and that would have been solid enough, but instead, Shadow of the Erdtree is yet another innovative iteration of the genre.\n\n-------------\n\n**[Dexerto](https://opencritic.com/outlet/863/dexerto)** - [Sam Smith](https://opencritic.com/critic/9291/sam-smith) - [5 / 5 ](https://www.dexerto.com/elden-ring/elden-ring-shadow-of-the-erdtree-review-a-sublime-swansong-that-removes-all-tarnish-2778364/)\n\n>Shadow of the Erdtree is a fitting tribute to Elden Ring and a stunning finale that manages to surprise and shock us all over again. Those who enjoyed the base game will find much more to get their teeth into. This signs off the Elden Ring chapter of FromSoftware’s journey so conclusively and impressively, that it invokes questions about how they will ever top it again.\n\n-------------\n\n**[Digital Trends](https://opencritic.com/outlet/124/digital-trends)** - [George Yang](https://opencritic.com/critic/7294/george-yang) - [4.5 / 5 ](https://www.digitaltrends.com/gaming/elden-ring-shadow-of-the-erdtree-review/)\n\n>Shadow of the Erdtree is so packed with new content that it almost feels like a sequel to Elden Ring.\n\n-------------\n\n**[Entertainment Geekly](https://opencritic.com/outlet/874/entertainment-geekly)** - [Luis Alvaro](https://opencritic.com/critic/9991/luis-alvaro) - [4.5 / 5](https://www.entertainmentgeekly.com/2024/06/18/shadow-of-the-erdtree-elden-rings-darkest-adventure-yet-review/)\n\n>The daunting challenges ahead, the spirit of adventure and discovery that defines Elden Ring is ever-present, urging the Tarnished to rise again. With its intricate design and immersive storytelling, “Shadow of the Erdtree” reminds us of the enduring allure of Elden Ring, promising countless hours of enthralling gameplay.\n\n-------------\n\n**[Eurogamer](https://opencritic.com/outlet/114/eurogamer)** - [Alexis Ong](https://opencritic.com/critic/7984/alexis-ong) - [3 / 5](https://www.eurogamer.net/elden-ring-shadow-of-the-erdtree-review)\n\n>Much of Elden Ring: Shadow of the Erdtree is more of the same gruelling beauty - but a shift to explict storytelling and signposting means its essence as a living, evolving shared text is lost.\n\n-------------\n\n**[FandomWire](https://opencritic.com/outlet/886/fandomwire)** - [Tanay Sharma](https://opencritic.com/critic/10503/tanay-sharma) - [10 / 10](https://fandomwire.com/elden-ring-shadow-of-the-erdtree-review-a-fromsoftware/)\n\n>The culture around FromSoftware suggests that we should never expect stories to be directly told to us, and that remains true with Shadow of the Erdtree. I've always been an admirer of art that mimics life. In the context of Hidetaka Miyazaki's undying legacy, I do believe that Shadow of the Erdtree is yet another work of art that builds on the studio’s history of delivering polished gameplay.\n>\n>Whether you choose to wield a fresh, exciting weapon like the Death Knight’s Twin Axes or play with something trustworthy like the Rivers of Blood from the base game, Shadow of the Erdtree will still be a fulfilling journey worthy of your time, attention, and courage.\n\n-------------\n\n**[Fextralife](https://opencritic.com/outlet/501/fextralife)** - Fexelea - [9.6 / 10](https://fextralife.com/elden-ring-shadow-of-the-erdtree-review/)\n\n>Shadow of the Erdtree is an incredible expansion that no gamer should miss out on, adding even more value to an already outstanding game. With only minor performance issues and a few misses on the landscape, the expansion is challenging but rewarding, and full of secrets to discover. This is the kind of DLC every studio should aim to deliver, and very few can claim to do.\n\n-------------\n\n**[GGRecon](https://opencritic.com/outlet/828/ggrecon)** - [Harry Boulton](https://opencritic.com/critic/9323/harry-boulton) - [5 / 5 ](https://www.ggrecon.com/reviews/elden-ring-shadow-of-the-erdtree-review/)\n\n>Shadow of the Erdtree is a staggering achievement, and among the best work that FromSoftware has produced. It expands upon Elden Ring with an intricately woven narrative, unrelenting boss challenges, and a world so full of secrets that it's hard to know whether you've truly seen everything the expansion has to offer.\n\n-------------\n\n**[Game Informer](https://opencritic.com/outlet/35/game-informer)** - [Marcus Stewart](https://opencritic.com/critic/6102/marcus-stewart) - [9.8 / 10](https://www.gameinformer.com/review/elden-ring-shadow-of-the-erdtree/an-emphatic-exclamation-point)\n\n>The boring but ultimately correct shorthand to summarize Shadow of the Erdtree is that it’s more Elden Ring. The incredible sense of discovery, fantastic dungeon design, entertainingly deep combat, and intriguing lore and characters that defined From Software’s 2022 masterpiece all apply to this expansion.\n\n-------------\n\n**[GameBlast](https://opencritic.com/outlet/797/gameblast)** - [Victor Vitório](https://opencritic.com/critic/9556/victor-vit-rio) - *Portuguese* - [9 / 10](https://www.gameblast.com.br/2024/06/analise-dlc-elden-ring-shadow-of-the-erdtree-review.html)\n\n>Elden Ring: Shadow of the Erdtree is a magnificent farewell to the saga of the Tainted One and the demigods. Even if FromSoftware made a bit of a mistake in balancing the bosses, there is enough content to last an entire game and anyone who enjoyed the base will have a lot to enjoy here, especially when exploring the paths and secrets to discover the intricate verticality of the world. open.\n\n-------------\n\n**[Gamefa](https://opencritic.com/outlet/498/gamefa)** - [mohammad hossein karimi](https://opencritic.com/critic/9320/mohammad-hossein-karimi) - *Persian* - [8.7 / 10](https://gamefa.com/1053881/elden-ring-shadow-of-the-erdtree-review/)\n\n>Shadow of the Erdtree is a successful attempt to recapture the emotions and surprises you had already experienced in Elden Ring. This is a game that in terms of both exploration and difficulty, aims at hardcore audiences and wants you to have a more intense experience than the base game. The more complex structure of the map and the way the bosses are designed are proof that FromSoftware expects you to spend time on their gigantic expansion. However, in the way of surpassing the base game and enhancing its strengths, some bad habits inherent in the base game are also repeated with greater intensity, which cannot be ignored. Elden Ring: Shadow of the Erdtree portrays FromSoftware  a bit fiery, hot-tempered, out-of-control in aspects like boss design and scale. Still, this is an essential experience for fans of the base game that gives more meaning to the main game.\n\n-------------\n\n**[Gamers Heroes](https://opencritic.com/outlet/467/gamers-heroes)** - [Johnny Hurricane](https://opencritic.com/critic/6599/johnny-hurricane) - [90 / 100](https://www.gamersheroes.com/honest-game-reviews/elden-ring-shadow-of-the-erdtree-review/)\n\n>Shadow of the Erdtree is the perfect swan song to Elden Ring. It gives you all the challenge, the loot, and the lore of the base game in a smaller chunk. Prepare to lose yourself to its siren call yet again.\n\n-------------\n\n**[Gaming Instincts](https://opencritic.com/outlet/872/gaming-instincts)** - [Leonid Melikhov](https://opencritic.com/critic/1206/leonid-melikhov) - [10 / 10](https://www.gaminginstincts.com/review/shadow-of-the-erdtree-review/)\n\n>Shadow of The Erdtree is an excellent send off to Elden Ring. Whatever it is that you’ve loved about the original game will be included here. Whether its exploring beautiful new areas with awesome interconnected level design or finding that one gorgeous vista where you can just stand around and gawk at the insane sense of scale. You will encounter plenty of challenging of new challenging bosses and optional bosses. You will discover new builds, new items, new weapons, summons and magics to use for your current and future playthroughs. There is plenty of replay-value here as I’ve previously mentioned Shadow of the Ertdtree is about as big as Limgrave with tons of things to discover.\n\n-------------\n\n**[GamingBolt](https://opencritic.com/outlet/297/gamingbolt)** - [Rashid Sayed](https://opencritic.com/critic/1200/rashid-sayed) - [10 / 10](https://gamingbolt.com/elden-ring-shadow-of-erdtree-dlc-review-unparalleled)\n\n>Elden Ring: Shadow of the Erdtree is an excellent follow up to the base game. Shadow of the Erdtree's focus on great level design and fantastic boss fights makes it a must play for the fans of the genre.\n\n-------------\n\n**[GamingTrend](https://opencritic.com/outlet/102/gamingtrend)** - [Henry Viola](https://opencritic.com/critic/9816/henry-viola) - [85 / 100](https://gamingtrend.com/feature/reviews/elden-ring-shadow-of-the-erdtree-review-this-time-for-miquella/)\n\n>I'm both happy and sad that Shadow of the Erdtree is the first and last expansion for Elden Ring. On one hand, it's a masterfully woven experience that expands on the contents of the base game, whereas on the other it leaves much more to be desired with its disappointing final boss. That being said, it's still very much worth your time if you're craving some more Elden Ring.\n\n-------------\n\n**[Generación Xbox](https://opencritic.com/outlet/431/generaci-n-xbox)** - [David Fernandez](https://opencritic.com/critic/7156/david-fernandez) - *Spanish* - [10 / 10](https://generacionxbox.com/analisis-de-elden-ring-shadow-of-the-erdtree-una-expansion-de-10/)\n\n>Shadow of the Erdtree is everything the community wanted it to be\n\n-------------\n\n**[Hardcore Gamer](https://opencritic.com/outlet/23/hardcore-gamer)** - [Adam Beck](https://opencritic.com/critic/873/adam-beck) - [4.5 / 5](https://hardcoregamer.com/review-elden-ring-shadow-of-the-erdtree/)\n\n>When compared to Elden Ring, Shadow of the Erdtree doesn’t quite live up to its lofty expectations. As a standalone experience, though, Shadow of the Erdtree is an absolute treasure that only helps to enhance the enjoyment of Elden Ring as a whole.\n\n-------------\n\n**[IGN](https://opencritic.com/outlet/56/ign)** - [Mitchell Saltzman](https://opencritic.com/critic/621/mitchell-saltzman) - [10 / 10](https://www.ign.com/articles/elden-ring-shadow-of-the-erdtree-dlc-review)\n\n>Like the base game did before it, Elden Ring: Shadow of the Erdtree raises the bar for single-player DLC expansions. It takes everything that made the base game such a landmark RPG, condenses it into a relatively compact 20-25 hour campaign, and provides fantastic new challenges for heavily invested fans to chew on.\n\n-------------\n\n**[INVEN](https://opencritic.com/outlet/805/inven)** - *Korean* - [9 / 10](https://www.inven.co.kr/webzine/news/?news=296526)\n\n>An already near-perfect game gets a 30-hour expansion with this DLC. Adding a wealth of new stories within its mysterious world, 'Elden Ring: Shadow of the Erdtree' will also challenge you with its formidable difficulty. The newly added equipment further enhances the enjoyment of the base game.\n\n-------------\n\n**[Impulsegamer](https://opencritic.com/outlet/31/impulsegamer)** - [Nathan Misa](https://opencritic.com/critic/1382/nathan-misa) - [5 / 5](https://www.impulsegamer.com/elden-ring-shadow-of-the-erdtree-ps5-review-messmer-rising/)\n\n>A must-play DLC expansion with an impressively hand-crafted new region filled with fun new quests, characters, and lore.\n\n-------------\n\n**[Kakuchopurei](https://opencritic.com/outlet/788/kakuchopurei)** - Jonathan Leo - [70 / 100](https://www.kakuchopurei.com/2024/06/elden-ring-shadow-of-the-erdtree-review/)\n\n>Elden Ring's big expansion just adds more beautiful brutality and action RPGing carnage to its already-tough base. Shadow of the Erdtree is meant to test the mettle of the game's hardcore audience and isn't going to let up soon. This isn't going to change your mind about From Software's approach to its dungeon crawlers: it's either \"get good\" or go home and it intends to keep the messaging that way with its Shadow of the Erdtree expansion. \n>\n>The expansion's new offerings and updates, as well as epic boss fights, are still as grand and challenging as ever to the point that you may see optional boss Malenia (both versions) from the base game as a \"walk in the park\".\n\n-------------\n\n**[Kotaku](https://opencritic.com/outlet/276/kotaku)** - [Unscored](https://kotaku.com/elden-ring-shadow-of-the-erdtree-dlc-expansion-review-1851545505)\n\n>FromSoftware’s highly anticipated DLC could be a standalone game, it's just that good\n\n-------------\n\n**[Merlin'in Kazanı](https://opencritic.com/outlet/661/merlinin-kazan-)** - [Samet Basri Taşlı](https://opencritic.com/critic/6959/samet-basri-ta-l-) - *Turkish* - [96 / 100](https://www.merlininkazani.com/Elden_Ring-oyun_inceleme-126120p1.html)\n\n>The best game of recent years is back with the best expansion pack in recent years\n\n-------------\n\n**[Metro GameCentral](https://opencritic.com/outlet/75/metro-gamecentral)** - GameCentral - [9 / 10](https://metro.co.uk/2024/06/18/elden-ring-shadow-erdtree-dlc-review-king-soulslikes-21057799/?ico=mosaic_tag)\n\n>Exactly as engrossing and meticulously designed as you'd expect of FromSoftware but even by their standards this is an enthralling slice of DLC that underlines and enhances the achievements of the original.\n\n-------------\n\n**[One More Game](https://opencritic.com/outlet/811/one-more-game)** - [Chris Garcia](https://opencritic.com/critic/8410/chris-garcia) - [10 / 10](https://onemoregame.ph/2024/06/elden-ring-shadow-of-the-erdtree-review/)\n\n>Elden Ring Shadow of the Erdtree is quite reminiscent of other similar From Software DLCs like Bloodborne’s The Old Hunters, which adds meaty content and elevates the overall experience even further. Shadow of the Erdtree is a triumph for From Software, and if you thought that the Elden Ring experience could not be elevated, you are deathly wrong.\n>\n>Between all of the additional content here that the DLC provides, there’s so much to see and do that can easily run you tens of hours, even hundreds, simply because of the difficulty level alone. That said, the content does not feel tacked on at all, and, true to From Software tradition, is weaved into the basic fabric of the game, consequently enriching the experience.\n\n-------------\n\n**[PC Gamer](https://opencritic.com/outlet/162/pc-gamer)** - [Tyler Colp](https://opencritic.com/critic/184/tyler-colp) - [95 / 100](https://www.pcgamer.com/games/rpg/elden-ring-shadow-of-the-erdtree-review/)\n\n>A masterfully designed expansion to one of the best action RPGs of the last decade that not only complements the base game but expands its thematic and systemic scope even further.\n\n-------------\n\n**[PSX Brasil](https://opencritic.com/outlet/514/psx-brasil)** - *Portuguese* - [90 / 100](https://psxbrasil.com.br/analise/elden-ring-shadow-of-the-erdtree-review/)\n\n>Elden Ring: Shadow of the Erdtree is the biggest and most ambitious expansion ever developed by FromSoftware. However, it could have been flawless if it weren't for the over-the-top recycling of enemies. Even so, the challenging boss fights and the great sense of exploration with the addition of new layouts on the maps make Shadow of the Erdtree an excellent conclusion to the Elden Ring journey.\n\n-------------\n\n**[PlayStation Universe](https://opencritic.com/outlet/39/playstation-universe)** - [David Carcasole](https://opencritic.com/critic/7621/david-carcasole) - [10 / 10](https://www.psu.com/reviews/elden-ring-shadow-of-the-erdtree-dlc-review-ps5/)\n\n>Elden Ring: Shadow Of The Erdtree is far more out of an expansion than I ever thought it would be, and my expectations were already a little high. While I have personal gripes with what I see to be missed chances, that doesn't stop it from being spectacular on the whole. This expansion feels like it fully completes Elden Ring, a game that already felt like a whole project, in a way I didn't even know it needed to be completed. I can no longer imagine Elden Ring being without Shadow Of The Erdtree, almost like the Realm Of Shadow was there the whole time.\n\n-------------\n\n**[Polygon](https://opencritic.com/outlet/87/polygon)** - [Michael McWhertor](https://opencritic.com/critic/1504/michael-mcwhertor) - [Unscored](https://www.polygon.com/reviews/24180518/elden-ring-shadow-of-the-erdtree-review-dlc-fromsoftware)\n\n>Even 40-plus hours in, I’m still figuring out how to tackle a particularly nasty dragon. And despite cursing all the bosses I’ve felled so far, as they’ve beaten me into submission dozens of times, I’m looking forward to going back and starting it all over at some point, ready to take on the challenge again.\n\n-------------\n\n**[Press Start](https://opencritic.com/outlet/491/press-start)** - [Harry Kalogirou](https://opencritic.com/critic/5119/harry-kalogirou) - [10 / 10](https://press-start.com.au/reviews/pc-reviews/2024/06/19/elden-ring-shadow-of-the-erdtree-review/)\n\n>Elden Ring: Shadow of the Erdtree is yet another masterpiece by FROMSOFTWARE. It doubles down on all of the best parts of Elden Ring and bolsters them through an inviting new world, an engaging story, and a ridiculously moreish gameplay loop. It won't change your mind on Elden Ring if it never clicked for you, but will undoubtedly wow you if it did.\n\n-------------\n\n**[Push Square](https://opencritic.com/outlet/25/push-square)** - [Liam Croft](https://opencritic.com/critic/1009/liam-croft) - [8 / 10](https://www.pushsquare.com/reviews/ps5/elden-ring-shadow-of-the-erdtree)\n\n>Shadow of the Erdtree delivers more of the same style of content you loved two years ago rather than introducing new ways to engage. That's enough to consider it a fantastic expansion, though it's hard not to feel like you're just going through the motions again. With a new land to explore, a fresh set of bosses to fight, and extra lore to consume, it's so much more Elden Ring.\n\n-------------\n\n**[RPG Fan](https://opencritic.com/outlet/37/rpg-fan)** - [Jerry Williams](https://opencritic.com/critic/10330/jerry-williams) - [95%](https://www.rpgfan.com/review-dlc/elden-ring-shadow-of-the-erdtree/)\n\n>An exemplary addition to Elden Ring.\n\n-------------\n\n**[RPG Site](https://opencritic.com/outlet/322/rpg-site)** - [Junior Miyai](https://opencritic.com/critic/8746/junior-miyai) - [10 / 10](https://www.rpgsite.net/review/15971-elden-ring-shadow-erdtree-review)\n\n>Shadow of the Erdree is an excellent expansion to Elden Ring. Poison swamps, giant swords, and fingercreepers return, better than ever.\n\n-------------\n\n**[Rock, Paper, Shotgun](https://opencritic.com/outlet/270/rock-paper-shotgun)** - [Ed Thorn](https://opencritic.com/critic/7538/ed-thorn) - [Unscored](https://www.rockpapershotgun.com/elden-ring-shadow-of-the-erdtree-review)\n\n>A knotty, dense expansion that's home to some of the best moments in Elden Ring, but also some of its most frustrating.\n\n-------------\n\n**[SECTOR.sk](https://opencritic.com/outlet/615/sector-sk)** - [Oto Schultz](https://opencritic.com/critic/8455/oto-schultz) - *Slovak* - [9.5 / 10](https://www.sector.sk/recenzia/39417/elden-ring-shadow-of-the-erdtree.htm)\n\n>Expansion as complex as Shadow of the Erdtree has no real right to be labeled as a traditional DLC. Two-year long development cycle has spawned another story rich soulslike adventure across the Lands Between, or rather its shadowy counterpart. It is a world truly deprived of grace that alas suffers from a few technical issues too, but it never fails to just simply awe. Prepare to face the hardest From Software bosses to date, explore the most vertically varied biodiverse world and get ready to feel through the sounds and designs of the Shadow Realm.\n\n-------------\n\n**[Slant Magazine](https://opencritic.com/outlet/318/slant-magazine)** - [Justin Clark](https://opencritic.com/critic/1331/justin-clark) - [4.5 / 5 ](https://www.slantmagazine.com/games/elden-ring-shadow-of-the-erdtree-review/)\n\n>It’s an extended encore and a haunting final bow for Miyazaki Hidetaka’s magnum opus.\n\n-------------\n\n**[Spaziogames](https://opencritic.com/outlet/502/spaziogames)** - [Domenico Musicò](https://opencritic.com/critic/3760/domenico-music-) - *Italian* - [Unscored](https://www.spaziogames.it/articoli/elden-ring-shadow-of-the-erdtree-recensione)\n\n>Shadow of the Erdtree is far more than a simple DLC. It's a huge expansion that looks like a brand new game, with new hard challenges, a remarkable map design and more than 30 hours of marvellous discovery and brutal boss fights.\n\n-------------\n\n**[Stevivor](https://opencritic.com/outlet/424/stevivor)** - [Ben Salter](https://opencritic.com/critic/3160/ben-salter) - [9.5 / 10](https://stevivor.com/reviews/elden-ring-shadow-of-the-erdtree-review/)\n\n>Elden Ring Shadow of the Erdtree is the perfect encore to one of the greatest games of all time. It knows it’s already delivered an astonishing performance, and after leaving us hanging, returns asking if we want more.\n\n-------------\n\n**[TechRaptor](https://opencritic.com/outlet/329/techraptor)** - [William Worrall](https://opencritic.com/critic/6057/william-worrall) - [9 / 10](https://techraptor.net/gaming/reviews/elden-ring-shadow-of-erdtree)\n\n>Elden Ring: Shadow of the Erdtree is the lore and gameplay continuation that we all needed. The new challenges and a feeling of nostalgia help propel this DLC into the stratosphere.\n\n-------------\n\n**[The Outerhaven Productions](https://opencritic.com/outlet/335/the-outerhaven-productions)** - [4.5 / 5 ](https://www.theouterhaven.net/2024/06/elden-ring-shadow-of-the-erdtree-review/)\n\n>Elden Ring Shadow of the Erdtree was worth the wait and then some. While I said this was FromSoftware’s most ambitious DLC yet, and that’s not hyperbole. If you enjoyed Elden Ring, you’ll love everything about this DLC. Savor it since Hidetaka Miyazaki has said there won’t be more content after this.\n\n-------------\n\n**[TheGamer](https://opencritic.com/outlet/731/thegamer)** - [James Troughton](https://opencritic.com/critic/8128/james-troughton) - [5 / 5 ](https://www.thegamer.com/elden-ring-shadow-of-the-erdtree-review/)\n\n>This is their linking the flame moment, a chance to be reborn and usher in a new age, capped off by what can only be described as their magnum opus.\n\n-------------\n\n**[TrueGaming](https://opencritic.com/outlet/449/truegaming)** - [خالد العيسى](https://opencritic.com/critic/3268/-) - *Arabic* - [9 / 10](https://www.true-gaming.net/home/568809/elden-ring-shadow-of-the-erdtree/)\n\n>Shadow of the Erdtree represents what we liked with the original content but with more meticulous designs to the map and a great variety of new weapons. A befitting comeback to this masterpiece.\n\n-------------\n\n**[Twisted Voxel](https://opencritic.com/outlet/795/twisted-voxel)** - [Ali Haider](https://opencritic.com/critic/7630/ali-haider) - [9.5 / 10](https://twistedvoxel.com/elden-ring-shadow-of-the-erdtree-review/)\n\n>Shadow of the Erdtree maintains the high standards set by the base game. It introduces the challenging Realm of Shadow, offering new boss fights, weapons, and progression without excessive grinding. The expansion revitalizes the sense of discovery with secrets, mini-bosses, and unique NPCs.\n\n-------------\n\n**[UnGeek](https://opencritic.com/outlet/850/ungeek)** - [Nicolo Manaloto](https://opencritic.com/critic/9044/nicolo-manaloto) - [10 / 10](https://www.ungeek.ph/2024/06/elden-ring-shadow-of-the-erdtree-review-fromsoftware-has-done-it-again/)\n\n>Shadow of the Erdtree is another top-notch Souls DLC by FromSoftware as it features a massive and dense new map that's a joy to explore, all while adding tough unique bosses and a load of new weapons that will make you want to replay the game.\n\n-------------\n\n**[Video Chums](https://opencritic.com/outlet/624/video-chums)** - [A.J. Maciejewski](https://opencritic.com/critic/5170/a-j-maciejewski) - [9.1 / 10](https://videochums.com/review/elden-ring-shadow-of-the-erdtree)\n\n>Even with its slight shortcomings, ELDEN RING Shadow of the Erdtree is the best expansion that I've ever played thanks to its unique-feeling world that behaves more like a 1.5 sequel than a mere extension of what players have come to expect. 💍\n\n-------------\n\n**[VideoGamer](https://opencritic.com/outlet/71/videogamer)** - [Tom Bardwell](https://opencritic.com/critic/9461/tom-bardwell) - [10 / 10](https://www.videogamer.com/reviews/elden-ring-shadow-of-the-erdtree-review/)\n\n>Shadow of the Erdtree is a sensational companion to the base game that feels remarkably fresh and a subtly progressive evolution of the Elden Ring formula.\n\n-------------\n\n**[WellPlayed](https://opencritic.com/outlet/382/wellplayed)** - [Kieran Stockton](https://opencritic.com/critic/2453/kieran-stockton) - [9 / 10](https://www.well-played.com.au/elden-ring-shadow-of-the-erdtree-review/)\n\n>Elden Ring's Shadow of the Erdtree DLC has more meat on the bones than many full releases, and if you miss the beauty and punishment of the base game then the Shadow Realm beckons.\n\n-------------\n\n**[Worth Playing](https://opencritic.com/outlet/64/worth-playing)** - [Chris \"Atom\" DeAngelus](https://opencritic.com/critic/289/chris-atom-deangelus) - [9.5 / 10](https://worthplaying.com/article/2024/6/18/reviews/142500-ps5-review-elden-ring-shadow-of-the-erdtree-dlc/)\n\n>Elden Ring: Shadow of the Erdtree is everything one could want from an Elden Ring DLC: a huge new area to explore, new bosses to fight, new weapons to try, and new lore to unravel. It is a genuine joy to play and easily one of my favorite DLCs of all time. Its quality is high enough to even justify the $40 price tag. If you like Elden Ring, then Shadow of the Erdtree will give you everything you could want. If you're a newcomer, it's probably best to play through the game first before taking on the DLC. After all, Mohg, Lord of Blood is only the beginning.\n\n-------------\n\n**[XGN.nl](https://opencritic.com/outlet/810/xgn-nl)** - [Ralph Beentjes](https://opencritic.com/critic/8344/ralph-beentjes) - *Dutch* - [9.5 / 10](https://www.xgn.nl/review/elden-ring-shadow-of-the-erdtree-review-fromsoftwares-beste-uitbreiding-ooit)\n\n>Beware a big bump in difficulty, but Shadow of the Erdtree is a must-play for Elden Ring-fans. It improves on the base game in every way. The new Lands of Shadow are beautiful and a joy to explore, there are a lot of exciting new weapons and spells to find, and the new boss fights are absolutely epic.\n\n-------------\n\n**[Zoomg](https://opencritic.com/outlet/478/zoomg)** - [Sadegh Tavazoyi](https://opencritic.com/critic/3551/sadegh-tavazoyi) - *Persian* - [10 / 10](https://www.zoomg.ir/game-review/369292-elden-ring-shadow-of-the-erdtree-review/)\n\n>Shadow of the Erdtree is more than just a DLC and it feels like a great standalone game that even exceeds the main Elden Ring game in some aspects.\n\n-------------",
        "num_comments": 339,
        "comments": [
            "“May see Malenia as a walk in the park” I still haven’t beaten Malenia sooooooo",
            "Why did I start FF7 Rebirth last week 🤦‍♂️ ",
            "Can’t wait to see people going hitless using a bucket of milk as a controller or whatever the fuck",
            "Time for my YouTube algorithm to be flooded with \"Elden Ring DLC ABSOLUTELY DESTROYS modern gaming\" bait slop for six months.",
            "Elden Ring gonna be GOTY twice in 3 years lmao",
            "Exciting! I hope that it will still be balanced with me playing on NG+1",
            "Do I start a new game or is my 150 NG+ character the better option?",
            "Biggest regret for me during my current Elden Ring playthrough was following one of those \"get OP early\" guides. I’m already a completionist, so I cover every inch of each area before I move on. Ended up being overleveled for a lot of bosses in the first few areas before & it was a cakewalk.",
            "In getting a lil too excited!! \n\nGotta finish Stellar Blade by Friday!!!!",
            "My GF bought me Elden Ring with the DLC for our 2 year anniversary. \n\nI’ve never played any FS game before so hopefully it’s as good as people say it is."
        ]
    },
    "As CEOs chase infinite growth, Hidetaka Miyazaki says FromSoftware gets \"better games and better decisions\" from a \"conservative forecast\" with \"room to fail\"": {
        "title": "As CEOs chase infinite growth, Hidetaka Miyazaki says FromSoftware gets \"better games and better decisions\" from a \"conservative forecast\" with \"room to fail\"",
        "score": 110,
        "url": "https://www.gamesradar.com/games/action-rpg/as-ceos-chase-infinite-growth-hidetaka-miyazaki-says-fromsoftware-gets-better-games-and-better-decisions-from-a-conservative-forecast-with-room-to-fail/",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Do take note, this statement - like the layoffs statement - is made under the acknowledgment that From's owner (Kadokawa) has thus far been hands-off.\n\n>But Miyazaki appeared confident Kadokawa shares his opinion on layoffs. \"Speaking to myself and this company, I want to say that this is not something I would wish on the staff at FromSoftware in a million years,\" he said. \"I'm pretty sure our parent company Kadokawa understands that and shares that view.\"\n\n\"I think the people at Kadokawa, our parent company, understand that I hold this view very strongly. While we can't say 100% — we can't say with complete certainty what the future's going to hold for From and Kadokawa\n\nHopefully, that continues to be the case. It seems so far Miyazaki has Kadokawa on side with how he runs things.\n\nHowever, I do wonder how From will weave between the typical corpo BS once they expand and become a global publisher all by themselves. \n\nhttps://preview.redd.it/oudvf032748d1.jpeg?width=1170&format=pjpg&auto=webp&s=0116989c055b478842bcdab199c0ceb4380e81c2\n\nGlobal publishing is one of the goals for From, per Kadokawa's financials. Not easy keeping that individual flame alive when you get huge, but I hope From manage it.",
            "It helps when you pay your employee almost half of what similar sized Atlas Pays. £22,000 vs £38,000. \n\nhttps://www.nme.com/news/gaming-news/fromsoftware-employees-report-poor-working-conditions-and-low-wages-3181971",
            "I wonder how much it would cost for me to hire Hidetaka to come to the USA and tell the members of my private equity board about conservative forecasts",
            "https://www.nme.com/news/gaming-news/fromsoftware-employees-report-poor-working-conditions-and-low-wages-3181971\n\n\nI don’t think he should say anything even try through I agree.",
            "How can you not like this man.",
            "“Most female employees who are about to give birth are expected to leave the company”\n\nWhat the fuck man. Seems like employee treatment and compensation is horrible.",
            "If this is true and verifiable: this sucks deeply! :(",
            "Why does someone post this link anytime FromSoftware is brought up 😂.",
            "Im sure this aint the case but anyone can talk a good game, Phil Spencer does it",
            "Pretty easy once you find out about their treatment of employees and compensation."
        ]
    },
    "Turning down Elden Ring's difficulty would \"break the game itself\", says Miyazaki": {
        "title": "Turning down Elden Ring's difficulty would \"break the game itself\", says Miyazaki",
        "score": 6914,
        "url": "https://www.eurogamer.net/turning-down-elden-rings-difficulty-would-break-the-game-itself-says-miyazaki",
        "content": "",
        "num_comments": 2655,
        "comments": [
            "Personally, I respect a developer having a clear vision for their game and sticking to it. It’s perfectly fine to make a game that isn’t for everyone. I could never get anywhere on Donkey Kong back in the day, but they weren’t wrong to make that hard either.\n\nIt clearly worked. Their games have a huge fan base now, despite starting as relatively niche games. They are widely copied. Elden Ring won many game of the year awards, sold like hot cakes and now has an acclaimed expansion too.",
            "Every time new content releases from Fromsoft we go through this same discussion it's so fucking annoying.",
            "Literally the only thing I wish they’d compromise on is a fucking pause button. That’s all I ask",
            "Which is why these games are not for me. I'm glad he has a vision and an audience. I'm old and tired and I love easy mode.",
            "Some people just have to accept that not every game is going to be for them.",
            "The only thing I want from these games is for the quests to not be so obtuse, and trackable.\n\nI'm not saying I want a marker on the map pinpointing where to go, but at least let me see a log of the relevant clues that have been said to me so far.",
            "I won't ever finish the game, I probably won't ever play it again. I never got more than halfway through it. It just isn't worth the time for me to make that effort/push to finish it. But I absolutely would hate to see it change. The game might not be for me, but it certainly is for others. And that's just fine. Not every game is made for every player.",
            "I'm 70 years old and I love the difficulty. I just have to grind a lot more than y'all youngins lol.",
            "I gotta admire a guy not giving the easy way out, but I play shit on easiest difficulty every time. I am not competing with anyone.",
            "Gonna be down voted into oblivion, but from someone who loves their games: with Elden Ring, they definitely started to give some bosses and enemies some really unfair shit. Some of the speeds they attack and recover from just don't seem reasonable. I respect their vision and sticking to it, but I think they are having a harder time balancing difficulty for veterans and newcomers since their games have become so popular. "
        ]
    },
    "Miyazaki ‘spends 95% of his time directing games’, despite FromSoftware president title: “I really get my hands dirty.\"": {
        "title": "Miyazaki ‘spends 95% of his time directing games’, despite FromSoftware president title: “I really get my hands dirty.\"",
        "score": 1299,
        "url": "https://www.videogameschronicle.com/news/miyazaki-spends-95-of-his-time-directing-games-despite-fromsoftware-president-title/",
        "content": "",
        "num_comments": 156,
        "comments": [
            "Of course his hands get dirty, he’s always developing swamps",
            "How many stocks do he really have in stock?",
            "I just imagine him walking around the office looking over peoples shoulders and tutting very audibly when someone isn’t working on anything swamp related",
            "I don’t enjoy fromsoft games and they aren’t for me at all. But, they are clearly some of the highest quality games being produced at this moment in time and I give full respect to Miyazaki. \n\nFrom Demon Souls to Elden Ring it’s clear that a ton of talent and passion has been put into these games. I’m super happy for all the folks digging into shadow of the erdtree this weekend and hope you all have a great experience.",
            "I like to imagine the developers high-fiving over completing a game, then Miyazaki descends as his employees grow quiet. They know what's coming.\n\nThey rush to show him the poisonous swamp. Not a smile cracks his lips. He asks about the SUPER poison swamp. And that my friends, is how we got scarlet rot.\n\nAll jokes aside, I love that Miyazaki is so passionate about his games that he wants to continuously work on them, even when he can do what most company president's do and just let everyone else handle it.",
            "I got no issue with Miyazaki, seems like a nice guy. The absolute glazing that goes on about him and From Software might be beyond any other developer ever. It's crazy.",
            "Next post: Contrary to widely held opinions, Mr Miyazaki actually uses the shitter to relieve his bowels.",
            "What's the weird camp you need to be in on Reddit where you downvote Fromsoft shit on sight because I see it a lot on here.\n\nThey're hands down one of the best studios there is in gaming currently and this guy is a fuckin' legend.",
            "Director of game directs game? Shock",
            "Oh trust me, I can tell he's very close to development with how many barefoot women there are in each game/dlc"
        ]
    }
}