{
    "You miss 100% of the shots you don’t take": {
        "title": "You miss 100% of the shots you don’t take",
        "score": 18,
        "url": "https://v.redd.it/4efnjxcowd9d1",
        "content": "My first kill of an EP in PC. ",
        "num_comments": 4,
        "comments": [
            "There are times, it's weird. I'm like I won't hit this, in my head, but I try, and I hit. Then someone is standing still or barely moving and I expect the move, and I wiff, my dumb monkey brain",
            "Did you pulldown at all or did you just let it follow its natural recoil pattern?",
            "This situation is very confusing when controlling recoil 👻",
            "Pulled right barely with almost no drag down. This is luck by the way lol"
        ]
    },
    "Is this what new jeans agents feared? ": {
        "title": "Is this what new jeans agents feared? ",
        "score": 142,
        "url": "https://i.redd.it/e1za08yj9a9d1.png",
        "content": "Hmmm ",
        "num_comments": 34,
        "comments": [
            "That or DrDisrespect sliding into their dms...",
            "Looking like rotisserie chickens",
            "damn, they packin",
            "Eeeeeeeeeeee",
            "Why does this remind me of chicken Brent from Cloudy With a Chance of Meatballs?",
            "Oh god, honestly, this post was worth this whole new jeans thing, my sides hahahaha",
            "![gif](giphy|yE72eDy7lj3JS|downsized)",
            "Nah I fear the repeating cheaters and lack of (none) report progress letting me know they got banned. This game use to be ESports ready and now it’s just cheating and Korean pop bands.",
            "🤦🏽‍♂️😭😭😭",
            "El pollo es mío!!!"
        ]
    },
    "Stupid question about recoil": {
        "title": "Stupid question about recoil",
        "score": 4,
        "url": "https://www.reddit.com/r/PUBATTLEGROUNDS/comments/1dr1snw/stupid_question_about_recoil/",
        "content": "Why is vertical grip meta if you can just turn up vertical sensitivity?",
        "num_comments": 8,
        "comments": [
            "Turning up the vert sense multiplier is a bad move if you're trying to improve. It feels good at first- not having to pull down as much, but your muscle memory for snapping onto targets with DMRs and snipers will suffer. Spend more time in training mode emptying mags into the target in the underground target range (the one that has a monitor to track your hits). If you're in a clan, use the clan training mode because you have a longer time limit. I would spend an hour easily in there dumping a thousand rounds while trying out different settings and different attachments.\n\nDon't be shy. Training mode isn't just for people that have never played before.",
            "Doubling your vert sens doesn't make it easier, you just move your mouse less. You still have to be precise and have control over your movement to hit a good spray.",
            "turning up sensitivity in one direction can make your muscle memory like useless and make the game feel wonky\n\nit's easier to just pull the mouse down at your regular sensitivity",
            "some people are used to it. half grip is my go to on every AR. after that it depends - usually my order is:    \n\nberyl: half, vert, thumb, light, angled    \n\nace: half, vert, angled, thumb, light   \n\n m4 and SCAR: half, thumb, light, angled, vert   \n\n aug: half, vert, angled, thumb, light     \n\n\nthe lightweight can help get crazy tight sprays on the m4 if you learn to pull a little more at the beginning of the spray. it’s really good for hitting tight consistent headshots but it’s less good for spraying cars and shit - i still use the vert as a secondary on the higher recoil ars",
            "It actually isn't really meta anymore.  Most people use half-grip now as far as I know.",
            "It just provides a solid vert reduction, is consistent, and is nice when you dont have a front attachment.\n\nSince they buffed the grips, if you have a comp, most grips are fine.\n\nPractice without a front attachment or grip, and most become a preference of what you practice with.\n\nIm still a vert grip user and probably will be until they ruin it.",
            "I too use the half grip on all ARs except AUG. For some reason, I control the recoil better with the vert on AUG.",
            "This isn't true.\n\nThe half grip is definitely the second most popular and has enough going for it to make it a competitor to the vert on certain guns, but vert is still absolutely the meta and what the vast majority of comp players still run"
        ]
    },
    "Bug about casual games count": {
        "title": "Bug about casual games count",
        "score": 2,
        "url": "https://www.reddit.com/r/PUBATTLEGROUNDS/comments/1dr6c5n/bug_about_casual_games_count/",
        "content": "I played 2 casual games out of 3 today, I clearly had the 3/3 visible this morning, and I when I tried to launch the third one, the matchmaking started, then after 3min it stopped with a connection error, the game showed me the post game screen of the previous games and told me I already played it three times, despite my carrer panel clearly showing I only played 2  \nWhy ?",
        "num_comments": 1,
        "comments": [
            "Because once you hit play and it loads into the game it counts as one play. But since the game is shit it just fucked up and sent you back to the lobby. They need unlimited casuals imo."
        ]
    },
    "Luck or cheat?": {
        "title": "Luck or cheat?",
        "score": 7,
        "url": "https://www.youtube.com/watch?v=cI2IiBn2BUo",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Report and move on. Yesterday in my team we got a player in Ranked who was blatantly using wallhacks and aimlock. he had gold level account. I just reported him but its crazy how they are not banned. Pubg Anti cheat is a joke.",
            "You as the flasher should have won that for sure imo.",
            "Ya you're cheating for sure",
            "Probably lucky. He definitely didn't see anything when he shot but had an idea because the 2nd last flash was already fading when the last one hit.",
            "if you were full white and you only shot 3 bullets, then its fishy...\n\nbut probably from your POV, though your hands were up, you were able to see the guy but with a bit of white (50% opacity) all around",
            "Only firing precisely the needed amount of shots, namely three, and all of them hit?",
            "I was the one flashing.",
            "I think lucky hit",
            "anh...\n\nlol my bad.\n\nbut the same comment applies for both"
        ]
    }
}