{
    "Megathread: Update to CDC requirements for entry into US with dogs.": {
        "title": "Megathread: Update to CDC requirements for entry into US with dogs.",
        "score": 12,
        "url": "https://www.reddit.com/r/puppy101/comments/1co3gfu/megathread_update_to_cdc_requirements_for_entry/",
        "content": "The CDC has updated requirements for border crossing into the US with dogs.  You can see the following statement on their website [here](https://www.cdc.gov/importation/bringing-an-animal-into-the-united-states/dogs-entering-us-after-august-1.html).\n\nThere's been a lot of discussion on their Facebook post you can find [here](https://www.facebook.com/cdc/posts/pfbid07txHWSokgMZia31ou7nqUYw9ZvQBfz3kPwhtG7Hj97VSZaE9pyMJBfoJfmAvTfDGl).\n\nWhat does this mean:    \n- **Dog must be at least 6 months in age**  \n- **Dogs must have microchip**  \n- Dogs must have health records to include vet exam  \n- Import form submitted to CDC to include photo of dog (at least 10 days prior for dogs under age 1 year old)  \n- Current rabies vaccination\n\nWhy this is important to you:  \n\nSo the majority if our community lives in North America.  Many folks, especially if you live in the northern part of the US may opt to consider Canadian ethical breeders.  This will impact those plans given that puppies under the age of 6 months will no longer be allowed to cross the border it seems.  \n\nIf you are traveling and intend to bring your dog and will be border crossing, you will need to know this information for your passage into the US.  \n\nSome folks participate in international dog shows and sports competitions - this will impact you.  \n\nWe wanted to provide you with a megathread to discuss this new information rather than having multiple posts pop up.  Please keep discussions civil - given there are likely pros and cons to these changes.",
        "num_comments": 19,
        "comments": [
            "I understand this is to limit the import of sick dogs,  but sadly it’s going to have a MASSIVE negative impact on rare breeds.",
            "Does this include just traveling with your pet dog for a short stay in the US? All the talk referring to “import” are a bit confusing.",
            "As a Canadian that travels to the US almost every week with our dog this is disappointing. I get that the CDC's mandate is not to make travel convenient for Canadians but this will certainly limit our visits and correspondingly the money we spend in the US. It will also force us to reconsider whether we want to continue owning a vacation property in the USA. Hopefully the requirements will be amended to streamline the process for frequent visitors, maybe link the dog to Nexus?",
            "This update to CDC requirements for bringing dogs into the US definitely has some implications for dog owners, especially those who may be considering getting a puppy from a Canadian breeder. It's important to stay informed and make sure you have all the necessary documents and vaccinations in place if you're planning on crossing the border with your furry friend. Let's discuss the pros and cons of these new requirements together in this megathread!",
            "Sounds like a great way to prevent non-Americans from coming, and Americans from leaving, less they leave their precious pet behind. Perhaps even lower the pet population while they're at it.",
            "I'd imagine that local breeders will not be able to replace the amount of imported puppies from oversees which will lead to super high prices for small breeds and to local unethical breeders that will lie to buyers about future size of the dog their buying for big money...   and of course to even more scams.",
            "We need a doggie nexus pass!",
            "Personally I don't understand the age restriction given that puppies get rabies vaccination at 14 weeks.  Cha-Cha is from a canadian breeder, we got her last summer.  We needed proof of rabies vaccination to cross the border along with her health exam.  I just...  don't get it.  \n\nAnd I'm worried about people buying puppies from puppy mills who are 6 mos of age with absolutely no socialization work during their critical socialization period - having learned no foundational skills in those early months of life...   it's going to be a behavioral nightmare and could lead to more dogs being surrendered to shelters or BE.",
            "i dont understand the age limit at all. if its to limit the import of sick dogs, why dont they just ban the import of sick dogs regardless of age? i dont think it would really matter whether the dog was older than 6 months or not if they’re sick, so i think this ban is so unnecessary.",
            "This right here! Spot on! I'm purchasing a companion Great Dane puppy from a highly reputable breeder in the EU that will be two weeks shy of the age it can be shipped when the August 1 rule goes into effect. So far there are no exceptions to the rule. The cost to ship the puppy has gone from around $700 to more than $2600 if we have to wait six months. Could be more, depending on his weight. And that's if the breeder will agree to hold him for six months and what that entails for me in terms of additional costs. I've written to my legislators and also opened a case with the CDC. While well meaning, parts of this ruling cast too wide and cumbersome of a net for those importing dogs from reputable breeders, traveling with their pets, showing young dogs, and breeders looking to add diversity to their breeding programs. Fingers and paws crossed the outcry doesn't fall on deaf ears and changes can be made to address the virtually non-existent issue of rabies without unduly burdening those of us who are following the rules."
        ]
    },
    "Rule Expansion: Be Constructive, Supportive, and Civil, Particularly On Puppy Blues & RIP Threads": {
        "title": "Rule Expansion: Be Constructive, Supportive, and Civil, Particularly On Puppy Blues & RIP Threads",
        "score": 29,
        "url": "https://www.reddit.com/r/puppy101/comments/1de6hsf/rule_expansion_be_constructive_supportive_and/",
        "content": "Due to an escalation in the number of rude and judgemental responses and spiciness where people have no empathy regarding those who are dealing with puppy blues, we as a team have decided to take tougher action on these threads.\n\nHere's the deal, people come to this sub for support. People are dealing with tough things. People sometimes struggle more than you feel they should, and people do things you don't feel they should do. \n\nIf you can't tolerate it and it upsets you. Don't comment. Being an asshole to people who are having a bad time makes matters worse, not better. It'll put them on the defensive instead of leading them to change their action.\n\n**From here forward, being rude on these posts where support is necessary will result in a 3 day temp ban from the sub on the first offence. If you have priors of this offence, this will be expanded based on mod discretion and the severity**\n\nThose who focus on brutal honesty seem to prefer brutality over honest. We want your supportive honesty. We want your constructive honesty. We want your loving honesty. Leave the brutality at the door.\n\nWe're not going to support people who want to kick people when they're down. If you can't tolerate not doing so, this is just straight up not the sub for you. Yesterday I ended up removing over 50 comments in a single post, and it's not cool.\n\nFor those who feel strongly and want to learn how to help here's some ideas:\n\n* Provide actionable advice to help not just the puppy, but the human too. We strongly believe in building up other puppy owners. Empowering them and supporting them helps. It helps people make the best decisions for them and their puppy. It helps people do better for their puppy. It helps them feel they can get through this because they're no longer alone.\n\n* Share the tough times that you had/are having and some ideas that you've done or are trying to do. \n\n* Ask follow-up (non-judgemental) questions on something. Like, if you notice that somebody may be doing something or not doing something that may be helpful, ask them whether your thoughts are correct.\n\n* Simply acknowledge their emotions and the tough time they're having and offer your support whether you understand or not.\n\nAny questions?",
        "num_comments": 12,
        "comments": [
            "It’s sad that a post like this even has to be made. Scrolling through this subreddit and posting questions helped me with my little booger. I recommend all my new puppy parent friends to this sub because of that. To be mean to someone who already feels at their lowest is just plain cruel.",
            "I’m here for the tea, which post was it that brought the pitchforks out?",
            "why don't you take tougher action against people bullying those who have a genuine question? I thought this subreddit was for exchanging information.",
            "New to reddit.  On this sub, how do I call rude posts to the attention of a moderator???",
            "It is. \n\nIf you see it, report it. There's no reason for this bull and quite frankly, I'm tired of it.",
            "I think this is a useful rule and understand that it’s not constructive to say something like “you clearly shouldn’t have gotten a puppy” to someone in the middle of puppy blues. But, to give some explanation on the unhelpful comments on those posts, I certainly am saddened and frustrated to see people (in a small minority of puppy blues posts) who are considering rehoming after a short period of time, when (looking at their comment history) they’ve already been informed of the level of effort required. In the US at least, it’s very easy to get an adult dog who needs relatively minimal training; deciding to instead get a puppy and then rehoming that puppy when they require the level of effort others told them is deeply unfair to the dog. Even if the feelings are reasonable, posting a comment isn’t helpful and this should be a helpful sub, but I definitely get the feelings",
            "I don't have a pitchfork, I have an axe. I would have a hammer but that's a bit overkill.\n\nAnd, in all reality, we've been trying to figure out ways to combat it for awhile. We used some mod tools to lessen it and it gave us a ton more work because it cast a wide net and got us a lot of false positives, and a lot of the noise got through despite it. That made us more annoyed.",
            "Report those people. \n\nWe take a tough stance there too. However, we can only remove things we have reported to us. We can't monitor every single one of the thousands of comments that get submitted every day.",
            "I’ll do my part to both drown out the negative and to report it!",
            "In all fairness, most of the people who do rehome fall into the following categories:\n\n1) They had angel puppies prior to the current one. This particular one they have has more crate anxiety or more biting than previous ones. \n\n2) They are first time owners with perfectionist tendencies, trying to do everything right. These people are well-researched, but the enormous pressure they put on themselves does serious damage to their mental health.\n\n3) They are a reluctant puppy owner out of compromising with their spouse, or their spouse is reluctant. Depending on which angle OP is, either they are the reluctant puppy owner stuck doing all/most of the work, or the OP is the happy puppy owner with the reluctant spouse who isn't helping. \n\n4) They were mislead by professionals/family/media to think that puppies weren't what puppies are. We see a lot of folks who were recommended by their mental health team to get a puppy to help them get out of bed in the morning. Some of these puppies were gifts and the OP feels they can't opt out. Remember, the internet is full of conflicting advice. Somebody without the skill to navigate it will get their information from poor sources.\n\nI think just assuming they didn't look into what a puppy entailed is just oversimplifying it. It's almost never actually the case."
        ]
    },
    "learned my lesson & am finally buying pet insurance": {
        "title": "learned my lesson & am finally buying pet insurance",
        "score": 383,
        "url": "https://www.reddit.com/r/puppy101/comments/1dqqqfd/learned_my_lesson_am_finally_buying_pet_insurance/",
        "content": "my 8-month-old dog chewed up a heating pad while we were sleeping on tuesday. i had no idea he actually ingested any of it until he threw up literal copper wires at 3AM that night. we ended up spending $1,400 on multiple xrays and were quoted $7k for abdominal surgery in the event he didn’t pass a large clump of the wires. \n\nthis was my wake up call to buy pet insurance as there is no way we could gather $7k at a moment’s notice. just wanted to vent and say thank god he is okay and did not need such an invasive surgery (also i am now traumatized by heating pads which is devastating for me LOL)",
        "num_comments": 206,
        "comments": [
            "Our vet kept insisting on getting pet insurance.  But the quotes I've received are $175-$200 a month!!  That almost as much as we pay for our entire family of four's health insurance!",
            "So glad your dog is ok! But please investigate throughly the policy before buying. Many pet insurers will consider this pre existing and not cover foreign body ingestion for your dog going forward. I would definitely call and ask. Others might put you on an extended waiting period. I would be very proactive about figuring out what would be covered. Good luck!",
            "We use pumpkin for health insurance. You need to sign up for insurance when the puppy is young. The rates go higher as they get older. Checkout Costco or your work benefits for pet insurance",
            "Insurance is a great tool to have but please keep in mind that it works through reimbursement so you would need to have the 7k to pay the vet first and then the insurance pays you back. I'd suggest a savings account or credit card dedicated to sog emergencies. They wouldn't cover this anyway since it already happened but for future reference.",
            "We use PetsBest for our 3 Italian Greyhound. We get 90% back and have a deductible of $250. Never had a problem with payment. It's about $50 a month per dog for us.",
            "You'll be happy about that later. Best thing we've ever done.",
            "kennel cough and pneumonia treatments cost me over $2500 and insurance covered $2000 ish",
            "oh my god that sounds AWFUL",
            "Lemonade costs me less than $35 per month. Keep in mind there’s a 21 day waiting period and your situation may be a considered a pre existing condition…",
            "To those who say they rather put money into a savings account instead of getting pet insurance... Those are the folks who need to get insurance the most."
        ]
    },
    " Will my puppy always stay sweet or do they change when they get older?": {
        "title": " Will my puppy always stay sweet or do they change when they get older?",
        "score": 54,
        "url": "https://www.reddit.com/r/puppy101/comments/1dr3ady/will_my_puppy_always_stay_sweet_or_do_they_change/",
        "content": "I lucked out and got the most perfect puppy. Seriously! He’s 4 months and is the sweetest. Strangers stop to pet him in the street and take pictures with him. He BARELY barks if he does it means something is wrong. I only need to do a skill once with him before he gets it. He willingly goes in his crate everyday at 9pm to sleep. When I’m not home he behaves and don’t leave a mess. He is sooooooo affectionate. All of my friends say their dogs are no offense “assholes” and I hope my baby don’t turn out like that when he’s older. Will he keep the same personality? He doesn’t bite, always happy, so cuddly. Please tell me this is their final personality. This is my first pet.",
        "num_comments": 42,
        "comments": [
            "My girl stayed sweet. She was also spicy and salty sometimes, but she was a sweet baby overall.",
            "Same. I won the lottery with this sweet, smart girl. I am encouraging this awesome behavior to stick around with some puppy training and positive greeting experiences.",
            "My dog was a pretty good pup, never destroyed anything, learned super quick, loved all people and dogs, etc. 6 years later, she is still pretty awesome, but she was attacked by dogs twice (0% her fault, just grabbed out of nowhere) so now she is really scared. She has a chronic disease that requires management, but she is so worth it. She is still super eager to please, super sweet, she still loves people, she isn't ever mean to dogs but mostly would prefer they leave her alone.\n\nI think an important thing is to keep up training and continue reinforcing the behaviors you like.",
            "They will change but for the better, get their own sass like a teen, and somewhat independent enough to be confident adult dog.  But being sweet is always going to be the main",
            "My dog is 10 and still has the same demeanour. Was literally the best puppy ever. hardly destructive (only ever damaged 3 things her entire life and one of those times was 100% our fault, for not realizing she hadn’t been let out of her crate by anyone yet, I slept in 🙈). Slept through the night almost immediately. She has ALWAYS been easy and well behaved and just the sweetest little lady. I feel like we got so lucky, she’s a mix of some really high maintenance breeds but the most high maintenance thing about her is she cries when I close the door of my home office without her in there with me 😂",
            "What kind of puppy do you have? If it's a dachshund, enjoy the peace while you have it.",
            "Have a six month old corgi and love her. She's very sassy sometimes but has potty training down and lets herself out to go. No accidents in basically 2 months and I've only had her for 3. Commands are good indoors but inconsistent outside, pretty good recall too. She is a bit of a yapper and it's super loud and sometimes she'll nip guests but never will it be aggressive or mean. She just knows she's not allowed to nip me. Hoping she at least maintains her current temperament. She's a great and fun pup overall despite pure exhaustion early on",
            "It's very likely they regress once they reach puberty, but probably still sweet",
            "There are never guarantees with living creatures, but I think the tendency is that they are who they are. However, trauma and illness can cause changes, so if you do ever see a big, particularly sudden difference, get it checked out. Congrats! I had two lovely, easy puppies, and now that I have a rascal, I regret my hubris thinking they were all that way!",
            "My dog was like this until he got to 6 months"
        ]
    },
    "I can’t enjoy my day puppy ": {
        "title": "I can’t enjoy my day puppy ",
        "score": 11,
        "url": "https://www.reddit.com/r/puppy101/comments/1drac2l/i_cant_enjoy_my_day_puppy/",
        "content": "We have an 11 week old puppy (Frenchton). He is an absolute terror. At first he was very sweet but the last week he has been biting and barking. \nThe biting has gotten to the point that every interaction he has with us or our daughter (4) he’s biting us. And it HURTS. I’ve tried all the tips and tricks from the posts on here. \nNow when I try to walk away or move my hands etc etc etc he starts to bark. We live in an apartment so I can’t exactly let him bark it out. \n\nI’m at my wits end… I literally don’t know what else to do 😭",
        "num_comments": 49,
        "comments": [
            "Congrats, you have a puppy. They bite. They bark. Honestly I think breeders should give them away with a disclaimer. What you describe sounds totally normal and common. \n\nThe only advice I can give is make sure that your puppy is stimulated but not overstimulated. Make sure he gets enough naps. He should be sleeping for the VAST majority of the day.",
            "“Enjoy” isn’t a word I would use often when dealing with an 11 week old puppy! You may need to adjust your expectations there. Biting and barking are both normal and unavoidable to an extent. How much sleep is he getting?",
            "Puppies like to play. Play ball with your puppy. All puppies bite. Did you research the type of puppy you have? I have a herding dog, and they never stop going, but he also rarely barks which is nice.",
            "Enforced naps in the crate is what saved me during early puppyhood. By about 3.5-4months old the biting was getting much much better and now is basically non-existent aside from the witching hour play 'mouths' (I don't really consider them bites she just wraps her mouth around my hand right now but is corrected everytime). She's 6 months now. Other things I did early on were the reverse time outs and redirecting with toys which I'm sure you've already read about in here and are trying. It's not going to be an overnight change you'll have to be very consistent with the redirection/time outs. Also start working on a relaxation protocol. Anytime you see the puppy exhibiting a calm behavior like settling on the floor for a nap then give them a treat. Increase the amount of treats they get the longer they stay. Start with 1 treat the second they lay down on their own and then 2 treats once they've layed there for a minute. 3 treats after 2 more minutes and so on and so forth. Do this everyday and after a week or two you'll probably notice them settling more.",
            "Are you doing enforced naps every 2 hours? 2 hours play,eat,walk time, then 2 hours kennel/nap time.",
            "Shove a toy in its mouth whenever it starts biting. After it's awake for one hour, put it in an xpen or crate for sleeping",
            "Biting phase is horrible. It starts to improve around 14 weeks in my experience. Imagine it’s their hands. It’s how they explore the world. They don’t mean to hurt you or your child. Your arms will start to heal in a few weeks but until then have a bully stick or toy in every area you might possibly be with the puppy so you can trade your arm for something else every single time. As for your daughter, she may not enjoy this for a while. I’m sorry-it’s really rough",
            "I was my heelers personal chew toy until week 18. Now at 20 weeks, she’s starting to lose her baby teeth and it has been wonderful.",
            "My puppy was a terrible land shark. He’s 1.5 years old now and finally reached good boy status. He still play bites on occasion but only with me. He doesn’t do it with anyone else lol",
            "You have to have a strategy…chew toys, himiylan yak milk chews, other things to get them occupied (redirected)and not biting you or the furniture or anything else. My Frenchton (7 mo) is still trying to learn that he is not the king of the hill …but he still is a bit of a brute. He loves to chew on our older dog (2 yr old BT who is NOT amused)and anything else he can get his big jowls around. I’m hoping within a year he will reach “good dog” status but right now it’s constantly just dealing with his crazy business. Good luck to you OP. 🍀"
        ]
    }
}