{
    "Promote your project in this thread": {
        "title": "Promote your project in this thread",
        "score": 7,
        "url": "https://www.reddit.com/r/puzzles/comments/1dn00a2/promote_your_project_in_this_thread/",
        "content": "This thread is for promoting your own works. Please limit your promotions to only one per week.",
        "num_comments": 21,
        "comments": [
            "Let me know what you think? <3",
            "I made these puzzles a long time ago, so maybe the website will be broken, but I'll appreciate any feedback. \nhttps://sarumino.com/challenges/",
            "A little daily compound remote associate puzzle! [www.crapuzzle.xyz](http://www.crapuzzle.xyz)",
            "I want to showcase Animated Jigsaw Puzzles. I just released a big update to it and it is in the Steam summer sale as well. Check it out!  \n[https://store.steampowered.com/app/2619860/Animated\\_Jigsaw\\_Puzzles/](https://store.steampowered.com/app/2619860/Animated_Jigsaw_Puzzles/)",
            "Warlock TetroPuzzle, is a puzzle based on board game.\n\nIt combines tile matching with Tetris-style challenges. Something like mix of Cartographers and Tetris.\n\n[Gameplay Video](https://www.youtube.com/watch?v=h4E3x-ono4M)\n\nAvailable on Google Play and Appstore\n\nGoogle Play :[https://play.google.com/store/apps/details?id=com.maxdk9.ManaCollector](https://play.google.com/store/apps/details?id=com.maxdk9.ManaCollector)\n\nAppstore :[https://apps.apple.com/us/app/warlock-tetropuzzle/id6499138181](https://apps.apple.com/us/app/warlock-tetropuzzle/id6499138181)\n\nThis game contains of next item:\n\n* The board includes a 10x10 or 11\\*11 grid of squares with magic artifacts, runes and traps.\n* Two arcane tetromino figure on your right may help you decide the future of the gameplay\n* Different types of artifacts that can be obtained using magic tetrofigures. Mana points are awarded differently for each type.\n* Elixirs of time which can allow you to place more pieces on the board and gain more mana points.\n* Wall bonuses for completing a row or column of a dungeon.\n* Trapped tiles which cannot be cast with a magic Figure, but can be cleared by surrounding this tile.\n\nI offer a competition for everyone that will last until July 7th. Who will score more than 150 points at the first level (currently the highscore is 159) or at the 11th level will score more than 200 points (the highscore is 228)  will receive promo codes for the full game.\n\nThe user must be logged in to the game for his record to be added to the online leaderboard",
            "HIIT for Brains?\n\n  \nTry [Sevenns](https://apps.apple.com/gb/app/sevenns/id6502391025) a free game combining crossword clues, Scrabble tiles and Venn diagrams!\n\n  \nIt's better than it sounds",
            "hi everyone! We created a new word game available now on web. Let me know what you think!\n\nhttps://www.theendoftheword.com/\n\nThe goal is to think of a word, given two starting letters, with a time constraint, and then to challenge a friend (through the built-in sharing feature) to do the same with the word you created!\n\nThe person who breaks the chain of words loses.\n\nThere is a nice strategy piece where you can 'spend' the points you earn (from creating longer words faster) to decrease the amount of time available to your opponent, thereby amping up the pressure on them and increasing your chance of winning!\n\nHope you enjoy and happy to hear feedback. [https://www.theendoftheword.com/](https://www.theendoftheword.com/)",
            " [https://play.google.com/store/apps/details?id=com.iwp.akari](https://play.google.com/store/apps/details?id=com.iwp.akari)\n\n [https://apps.apple.com/us/app/akari-light-up-your-brain/id6503335592](https://apps.apple.com/us/app/akari-light-up-your-brain/id6503335592)\n\n___\n\nHey all\n\nI'm the solo developer of Akari and looking for your feedback \n\nAkari, also known as \"Light Up\", is a logic puzzle where you have to fill a grid with bulbs. Each bulb brightens its row and column until obstructed by a black cell or the grid's edge. The black cells may have numbers indicating how many bulbs must surround them, adding to the strategic depth.\n\nAs you will quickly notice, the placement of the bulbs becomes quite tricky and you have to use logical exclusion methods to get your grid filled.\n\n___\n\n**Features**\n\n* Everyday I release a new puzzle (daily challenge)\n* Track your solving time and compete against other players (leaderboards)\n* A weekly challenge for geniuses\n* Guide with solving strategies\n* Profile with stats about your skill level & progress",
            "If you like puzzles and movie trivia, check out \"**First Shift at King Video!**\" \n\nTake on the role of a clerk at a busy video store where nothing is labelled properly. To re-stock the shelves, you'll have to test your knowledge of film!\n\nThis isn't a sales pitch, it's just a goofy little thing I made for friends. Download the FREE PDF now!! Hope you enjoy it!\n\n[https://drive.google.com/file/d/15tnrzybY6d0mPje\\_pPpSThI9idn7GT2-/view?usp=sharing](https://drive.google.com/file/d/15tnrzybY6d0mPje_pPpSThI9idn7GT2-/view?usp=sharing)",
            "# We are waiting on the Other Side, There is a message hidden in this image.\n\nFind it and it will lead you down a rabbit hole. At the end of it you will find something rare, exclusive...  \n...finite.\n\nOnly the first 77 people can make it all the way through. Then the vault will be locked forever and keys will be no more.\n\nGood luck, Traveller  \nWe are waiting on the Other Side\n\n[https://preview.redd.it/we-are-waiting-on-the-other-sidethere-is-a-message-hidden-v0-vikqsk1vjx8d1.jpg?width=1200&format=pjpg&auto=webp&s=4d6f5c0739e62e4f8d42f16c3844eaa1776b1dc2](https://preview.redd.it/we-are-waiting-on-the-other-sidethere-is-a-message-hidden-v0-vikqsk1vjx8d1.jpg?width=1200&format=pjpg&auto=webp&s=4d6f5c0739e62e4f8d42f16c3844eaa1776b1dc2)"
        ]
    },
    "I got this for a job application last week and still can’t figure it out. What do you think?": {
        "title": "I got this for a job application last week and still can’t figure it out. What do you think?",
        "score": 62,
        "url": "https://i.redd.it/uaxxcl3que9d1.jpeg",
        "content": "",
        "num_comments": 32,
        "comments": [
            "The correct answer is \"There is no blank.\"",
            "What type of job would ask this? It's right up there with \"tell me you greatest weaknesses\" and \"tell me about yourself\". There appears to be nothing to glean from this question that would offer useful insight to a candidate's capabilities.",
            ">!My guess is \"C\".  There are two dark objects, from left to right the shape increases the number of sides by one and internal white lines (regardless how thick) increase by one.  So imho the \"blank\" on the left needs a light object with one less side than the one on the right and one less internal line than the one on the right.!<",
            "Its >!E!< \n\nIm too high to explain but I am extremely confident.",
            "Great solution. B is also the only shape that can be created if you arrange all the lines and triangles outside the target shapes I think.",
            "Arent the circles above the lettered symbols blank?",
            "B was my first guess but given the nature of this test on a job application Im inclined to think there is no wrong answer",
            "This is much more pointless than \"tell me your greatest weakness\"",
            "If it's just on a digital test with no other context... then yeah it's a bit weird. But if the interviewee is supposed to solve this \"live\" while on the interview, or explain why they chose their answer afterwards, then you could learn a lot. It's not really about the answer, it's about seeing their thought process and how they problem solve.",
            "Software development jobs often require several rounds of exams before getting to the interview stage. The exams can feature puzzles like this to test your cognitive level and ability to solve problems. Sometimes, it's straight up"
        ]
    },
    "Crack the code": {
        "title": "Crack the code",
        "score": 85,
        "url": "https://i.redd.it/w178dykmce9d1.jpeg",
        "content": "",
        "num_comments": 31,
        "comments": [
            ">!6839!< (sorry if I mess up the spoilers)",
            "Discussion - what app is this?",
            ">!6839!<         \n>!7012 marked red tells us none of these are in the code, so only 345689 available. 0168 marked as two yellow tells us the code has 6 and 8 in it. 4756 marked as one yellow must be the 6 as established, so 012475 are all out, only 3689 available. 5879 marked as two green with known exclusions means 8 and 9 placed correctly, 3 and 6 left to place as x8x9. 6 cannot belong in position three or four per previous yellow dots, so 68x9 with only 3 to place, thus the solve. 6839.!<",
            ">!683?  All other numbers have been disqualified, so there isn't a 4 digit code that can be determined!<",
            "nice i actually got this one :D",
            "That's what I guessed too.",
            "Not all the other numbers have been disqualified. Look at clue 4",
            "No repeat digits unfortunately. OP said it in a different comment.",
            "OK, there seems to be agreement on the solution.  Here's what I did so I could keep track of what I was figuring out....  \nI made 4 columns on a piece of paper with 0-9 in each column.  Then as I logically worked thru what each tried combination could tell me.  I either circled a correct number in the correct location, or scratched out anything not possible.  I solved >!6!< first, then >!8!<, then >!9!<, and the only remaining number was >!3.!<",
            "Didnt notice the second one is only one yellow.\n\n>!6839!<"
        ]
    },
    "Can someone please explain this captcha? I can’t figure it out…": {
        "title": "Can someone please explain this captcha? I can’t figure it out…",
        "score": 25,
        "url": "https://i.redd.it/jrmz1at1wf9d1.jpeg",
        "content": "",
        "num_comments": 23,
        "comments": [
            ">!nice try, bot!<\n\n>!since they are all kitchens, I would assume the cooked burger is the most related to the pictures!<",
            "Discussion: looks like lsd blotter art",
            "Hard to tell in the screencap, but it looks like >!theres a square background / overlay in the main image and one of the kitchens. The others are circles.!<",
            "Discussion: Good try Robot! You won't trick me this time",
            "With a kitchen as the reference art, which of the provided images is most relatable? Tractor, sheep, or cheese burger?\n\nTractors and sheep dont have much to do with an indoor kitchen.",
            ">!The center image has the same concentric square pattern so I'd have gone with that!<",
            "I believe the rainbow image is the sample image since there is only one rainbow image",
            "Totally does. Pretty sure I ate a couple squares of that rainbow tractor",
            "Awesome catch. I totally fell for it being the other way around at first, but this makes way more sense",
            "I believe the tractors and sheep are the sample image >!look closer at the kitchens!<"
        ]
    },
    "What is the minimum percentage that have lost an eye, an ear, an arm, and a leg, all in the same battle?": {
        "title": "What is the minimum percentage that have lost an eye, an ear, an arm, and a leg, all in the same battle?",
        "score": 545,
        "url": "https://i.redd.it/fglet8yuw99d1.jpeg",
        "content": "",
        "num_comments": 104,
        "comments": [
            ">!10%, I believe. This comes down to 1 - (1-0.85) - (1-0.80) - (1-0.75) - (1-0.70), which assumes maximal spread of all the lost body parts among soldiers.!<",
            "Discussion: /u/s0uthw3st Do you have an example of a grouping that achieves this?",
            ">!10%. By spreading out the injuries, you can have 30% of people with both eyes, 25% of people with both ears, 20% of people with both arms, and 15% of people with both legs, all in mutually exclusive groups. This means that 30+25+20+15 = 90% of people still have both of something, and only 10% have all four injuries.!<",
            "Discussion: solving aside, that is one brutal battle.",
            "Question: What book did this puzzle come from?",
            "Discussion: this is just basic statistics",
            "Just came to say life must suck for those >!10!< percent that lost all 4 body parts.",
            "What a horribly morbid question.\n\n>!I get 10% as the lowest possible number with all four injuries.!<",
            "Discussion: If minimum is the smallest possible percentage, wouldnt the minimum percentage be zero? Or, like, just one guy? English isnt my first language, so maybe there is something I am not understanding with how it is phrased",
            "35.  Multiply the percentages together and change the wording of the question."
        ]
    }
}