{
    "NEW MAIN CHANNEL VIDEO": {
        "title": "NEW MAIN CHANNEL VIDEO",
        "score": 1037,
        "url": "https://youtu.be/xvN_EebjdZE?si=N0JKyS0F1WeHFajk",
        "content": "",
        "num_comments": 118,
        "comments": [
            "Unironically though it's cool that he went through a bunch of the developer's past games. \n\nSorry, I mean \"bro fell off haha L forehead  flopped by the hairs of his chinny chin chin\" or whatever garbage I'm supposed to spew whenever anyone talks about pyro.",
            "Never getting the Fear and Hunger video at this rate 🗣",
            "85k views in 1 hr bro fell off 🥱",
            "Fear & Hunger is the new Petscop 2",
            "Damn, pyro does not deserve such a bad fanbase geez",
            "Please cover inscription already we know you want to",
            "anybody see the mr beast thumbnail version?",
            "This one is actually really good. Glad to see more pyro",
            "this one kinda sucked. wheres fear and hunger inflation chin man.",
            "Skibidi toilet. Skibidi Skibidi toilet."
        ]
    },
    "Good Grief Brother": {
        "title": "Good Grief Brother",
        "score": 2019,
        "url": "https://i.redd.it/f8mua9nwcb9d1.png",
        "content": "",
        "num_comments": 160,
        "comments": [
            "I thought he was female??",
            "Why is this on my feed 😭\nI hate Reddit so much.",
            "It's like his t-shirt can read my mind",
            "i aready know this photo is gonna be the bane of his existance",
            "\"n-no chat i go to the gym i swear, i-i bet im stronger than half of you haha\"",
            "Real talk, is pyro shaving his legs?",
            "Pyro I hope you are watching us watching you 😀",
            "Jesus Christ it’s his house let him dress as he wants it’s also super hot in the Uk so I dont blame him one bit",
            "I was more busy reading his shirt than noticing Pyro's shorts (?)",
            "He has no leg hair"
        ]
    },
    "Something i had on my phone from 2018": {
        "title": "Something i had on my phone from 2018",
        "score": 30,
        "url": "https://i.redd.it/a0sl143boh9d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "God that shits more fried than a KFC"
        ]
    },
    "PyrocynicalTV ruined my personal relationships.": {
        "title": "PyrocynicalTV ruined my personal relationships.",
        "score": 16,
        "url": "https://www.reddit.com/gallery/1dr9zmy",
        "content": "I rarely ever watch a Pyro TV video but I keep seeing the thumbnails and I have no idea why Pyro uses them because they don’t even get more views than the ones that don’t have the stupid reaction sniperwolf face, it’s just stupid and there’s no reason to do it it makes me mad. \n\nThe Pyrocynical fanbase is actually so cooked until we get the Darkwood video (probably gonna be one of the greatest youtube videos in 2024)",
        "num_comments": 4,
        "comments": [
            "Happy to see the views low after his quality had a downfall",
            "The fact that he turned the vod channel into the stream slop clip channel is so stupid bro already has a clip channel",
            "In fact. In todays time he probably gets less view right? People dont like react dandys and all that so they see literally thumbnail X soyface and dont click. \n\nAt least when the vods had drawings we had a facade of quality, but now its literally bordering on content farm. \n\nPyrocynical > pyrolive > pyrocynicaltv this is the hierarchy of quality rn. Somehow, pyro has made worst channel than sloplive",
            "He became the slop he sought to destroy\n\nhttps://preview.redd.it/si32aa7udi9d1.jpeg?width=719&format=pjpg&auto=webp&s=7bd47444cf8b7ed012915958b726d1ec67bd190e"
        ]
    },
    "Pyro is this true?": {
        "title": "Pyro is this true?",
        "score": 129,
        "url": "https://i.redd.it/rnb9u28hme9d1.jpeg",
        "content": "Oh brother pyrochinical would be inflated in different places from this meme 🫣",
        "num_comments": 17,
        "comments": [
            "Please tell me you’re only referring to cum, as in cumflation. Do not tell me there are *other* bodily fluids.",
            "He doesn't realize I'm into that (IF ITS CUM)",
            "Oh I can do that as well",
            "I rather see either a bbw or a ssbbw art than furry inflated",
            "Is that mfing Greg heffley",
            "Is it Cumflation. if it is then I'm into that.",
            "I don’t know, I’m only the messenger… I would expect it’s mostly cumflation. But alas there may be more bodily fluids inflating whoever this Kids Dad draws. Maybe Pyro would know as he is a mega inflation professional and could probably sniff out why said person was inflated and what they were inflated with.😅",
            "That is indeed gyatt rizzing Greg Heffrizz from Ohio",
            "![gif](giphy|6Dj7ZWBERpGU0)",
            "![gif](giphy|l1J9yTco40EU5JzTW)"
        ]
    }
}