{
    "FAQ / Sticky help post": {
        "title": "FAQ / Sticky help post",
        "score": 7,
        "url": "https://www.reddit.com/r/qBittorrent/comments/1b1eyx8/faq_sticky_help_post/",
        "content": "( This is a work in progress. )\n\n**Q: How could I protect myself against ISP letters and anti-piracy laws?**\n\nPiracy posts are out of scope of this sub.\n\nHowever, you have a few options:\n\n**VPN with port forward** : \\[ 4/5 \\]. Not every VPN provider supports port forwarding. Check (or ask) before you purchase.\n\nUsing a VPN on your host PC might be cumbersome because all traffic will go through that. Yes, there are providers that offer \"Split Tunneling\" but personally, I never had much luck with that. Of course you can always run a Virtual Machine with a VPN inside - but then it will consume extra resources. Not only that, transferring files in-out or shared files is a chore and some anti-cheats will kick you for a VM in the background.\n\nNote 1: Use interface binding in Advanced Settings. If you don't see your VPN's interface in the list, change protocols in settings. OpenVPN usually supports this, so switch to that if all else fails.\n\nPros: You can use qBittorrent like normal.Cons: You may lose some speed. It can be cumbersome, esp. if you can't route all traffic through.\n\n**Seedbox** : \\[ 4/5 \\]. You can just Google \"seedbox provider\" and find tons. It's like a remote server which you can use to download and also seed. To get your files, you have to transfer them to your PC via protocols such as FTP, SFTP, etc.\n\nPros: Great speed, great ratio keeping, sometimes you get PLEX/Jellyfin too, great way to seed. Doesn't take up any local storage.Cons: Have to transfer whatever you need by hand.\n\n**SOCKS5 proxy** : \\[ 3/5 \\]. Some VPN providers offer this option with their VPN subscription.\n\nPros: Only qBittorrent will go through this tunnel. So no mess with other applications, games, etc. No need to run third-party applications.Cons: No port forward, so seeding won't be easy. The connection is not encrypted, but this is usually not an issue. It depends on the config file, so it may get disabled during an upgrade, or if anything happens to your config file. Some trackers don't like it and you may get some trouble with the Staff.\n\n**Q: My issue is not listed yet I require some help.**\n\nI'd heavily recommend asking Bing, ChatGPT or Gemini first. Of course you are free to make a post about it here but \"AI\" has gotten so good, it can even help with very specific problems. Sometimes it might offer an instant solution.\n\n**Q: I encounter these Chinese clients like Xunlei and they just waste my upload?!**\n\nFeel free to use the unofficial Enhanced Edition.[https://github.com/c0re100/qBittorrent-Enhanced-Edition/](https://github.com/c0re100/qBittorrent-Enhanced-Edition/)\n\nIt has features to counter this behavior. DO NOT report bugs on the official tracker if you use this client. Report them on THEIR tracker.\n\n&#x200B;\n\nv1, last updated 2/27/2024",
        "num_comments": 0,
        "comments": []
    },
    "Finally got my fiber drop. After a decade as a leech its time to repay my debts.  One-day results on a Pi 4 with qBT + WireGuard.": {
        "title": "Finally got my fiber drop. After a decade as a leech its time to repay my debts.  One-day results on a Pi 4 with qBT + WireGuard.",
        "score": 34,
        "url": "https://i.redd.it/qycrot7j8to61.jpg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Thank you for your service!",
            "i dream of getting a connection like this, and helping as much people as possible",
            "How do i view this?",
            "How do you manage a VPN drop and the torrents going out un protected is it a matter of just binding to the wire guard interface",
            "Wish we could transfer our stats to different devices. I had to do a fresh install and lost my 20tb up and 6tb down :(",
            "ctri i on qbittorrent on windows",
            "how? i'd love to know",
            "I wish I could do this but randomly hard links will fail and I can’t have that storage just keep building so I’ve set my share ratio to 5 or 1 month, whatever comes first. \n\n\nI’ll try to troubleshoot why hard links will randomly fail so I can set it to infinity eventually, but until then, at least I’m doing something",
            "by backing up your appdata folder and taking it with you. if you're on windows, you need your local appdata and roaming appdata.\n\nc:\\users\\user\\appdata\\roaming\\qbittorrent \nhas configs for your categories, watched folders, rss feeds. qbittorrent.ini is all of your settings, and qbittorrent-data is your statistics file.\n\nc:\\users\\user\\appdata\\local\\qbittorrent\nBT_backup has your active torrents with all of their individual stats and resume files. \n\nif you back up these 2 folders, reinstall os, then reinstall qbit and repopulate your appdata folders with what was in them before the wipe, it will be as if nothing changed. all settings, active transfers, stats. EVERYTHING comes back!",
            "you can do this"
        ]
    },
    "Retrieving metadata forever": {
        "title": "Retrieving metadata forever",
        "score": 3,
        "url": "https://www.reddit.com/r/qBittorrent/comments/1dr9y7i/retrieving_metadata_forever/",
        "content": "Hi, I've been using qbittorrent with nordvpn on win11 for a while now, but since yesterday, no download has started at all. It's basically stuck on retrieving metadata.  \nI've looked for a bunch of potential solutions, tried without the vpn, tried some earlier versions of qbittorrent, uninstalled it, and tried different torrents that I know have a lot of seeders.\n\nI also tried another torrent software thingy, transmission, that I did not like using at all and it seemed to work okay, for like half of the torrents I wanted and very slowly.\n\nWhen I do \"start\" the torrents even if the loading hasn't finished (or started for that matter) it's stuck on \"downloading\" status with nothing in the content window, no progress whatsoever \n\nhttps://preview.redd.it/thr9v8q48i9d1.png?width=1160&format=png&auto=webp&s=e1548c0bd24d48ca317d2c2ef8552230cf83fbac\n\nDo you have any idea what could be the issue for qbit ?  \nthx\n\nhttps://preview.redd.it/t0ifq3et7i9d1.jpg?width=1919&format=pjpg&auto=webp&s=cac7a6398e011dcd23931d1d6126616eeb68f0a2\n\n",
        "num_comments": 1,
        "comments": [
            "This has happened to me a few times. One time I uninstalled and reinstalled and we were good. Another time I switched port forwarding addresses in the Vpn and updated in qbit and I was good. Yesterday it switched my qbit to the wrong I think interface (qbit was in utun8 and my VPN was on utun6). Double check all of those things"
        ]
    },
    "Downloads are very slow": {
        "title": "Downloads are very slow",
        "score": 2,
        "url": "https://www.reddit.com/r/qBittorrent/comments/1dravs5/downloads_are_very_slow/",
        "content": "I'm trying to download a 90gb batch but my download speed is only 100b/s most of the time, my internet is fine, all settings are default and other torrents had worked fine. The seeds is 2( 24) and the peers is 28 (172)\n\nIt also occasionally goes to stalled",
        "num_comments": 1,
        "comments": [
            "are you port forwarded\n\n  \nalso it could just be the torrent being saturated, just wait a while"
        ]
    },
    "I Need Some Help With Port Forwarding w/PIA VPN! :) ": {
        "title": "I Need Some Help With Port Forwarding w/PIA VPN! :) ",
        "score": 2,
        "url": "https://i.redd.it/kmqruw5rzi9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "What are you trying to do?? If you route all your traffic through the VPN, you don't need any setup on your router.",
            "I only route torrent traffic through the VPN with split tunneling. I have port forwarding requested through my VPN and have it setup in qBittorrent. I want to make sure it is working as it should with port forwarding through my router.",
            "Hey crew! I use PIA vpn service and have port forwarding requested. I'm fumbling through my Asus router trying to setup port forwarding.\n\nI have the port set in qBittorent the same as the port PIA has given me. Now, I need some guidance on what to set here in the router. Should that port number be entered in both internal and external ports in the router settings here, or just one or the other? \n\nDo I set the \"external port\" number to the same open port PIA has given and I have set in qBittorent?\n\nDo I set the \"internal IP address\" to my computers actual IP address, or am I supposed to set it as my VPN IP address?\n\nWhat protocol should I set it to here in these settings?\n\nWhat other setting do I need to enter or adjust to get this working right?\n\nThanks a whole bunch for your help!!! :)"
        ]
    }
}