{
    "QualityReps Links - Discord, Discuit": {
        "title": "QualityReps Links - Discord, Discuit",
        "score": 13,
        "url": "https://www.reddit.com/r/QualityReps/comments/1b24dzh/qualityreps_links_discord_discuit/",
        "content": "**Discord:** [https://discord.com/invite/qualityreps](https://discord.com/invite/qualityreps) **(1,000 Reddit karma or significant contributions to the sub are required to join)**\n\nCheck the **📣announcements** channel in the cord after joining for instructions on how to link  your Reddit account to get full access to the server.\n\nIf the links shows as expired, you may need to verify your email, your Discord account may not old enough to join, you may have joined previously and left the server or you may be banned.\n\nPlease don't dm the mods asking to join if you have less than 1k  Reddit karma (unless  you've made significant contributions to the sub).\n\n**Discuit:** [https://discuit.net/qualityreps](https://discuit.net/qualityreps)\n\nThis is a direct Reddit replacement and has been created so that the community can continue in the event that the current subreddit is removed or shut down.\n\nYou can sign up for an account there and join the channel now.\n\n**Apps:**\n\nAndroid: [https://play.google.com/store/apps/details?id=rahul.apps.diskette](https://play.google.com/store/apps/details?id=rahul.apps.diskette)\n\niOS: go to  and press install on the home page (https://ibb.co/d6K27xf)",
        "num_comments": 25,
        "comments": [
            "everytime I try joining it says \"whoops\"",
            "Is there anyone I can talk to about being unmuted? I got muted for a dumbass joke literally a day after boosting the server and I honestly just want to contribute to the discord but I literally can't do anything except read messages",
            "why can't I join? I have more then 1k and im active?",
            "is the link to disckord still working ? because I have been trying many times, and it doesn't work with me.",
            "Who can I talk to about a ban? All I did was post in bst following all rules and ask what agents are good rn and I saw I was banned?",
            "I have joined but i can’t open the member section. Is there something i can do?",
            "why do i need 1k karma this is annoying",
            "Check out r/DesignerRepsW2C  or just google \"REPZWORLD\" and you will get the shop.",
            "I have joined but i can’t open the member section. Is there something i can do?",
            "I have 1k karma but hasn’t been verified by anyone. Can someone please assist?"
        ]
    },
    "[Find] Duja Ve Hybrid Long Sleeve Shirt by Tsunami (Both Colorways)": {
        "title": "[Find] Duja Ve Hybrid Long Sleeve Shirt by Tsunami (Both Colorways)",
        "score": 87,
        "url": "https://www.reddit.com/gallery/1dqppe1",
        "content": "link (remove spaces): https ://item.taobao. com/item.htm?id=807265176891",
        "num_comments": 2,
        "comments": [
            "These are sick"
        ]
    },
    "MoonMade VTMNS Femme TFD restock": {
        "title": "MoonMade VTMNS Femme TFD restock",
        "score": 15,
        "url": "https://www.reddit.com/gallery/1dr152l",
        "content": "Wtc 【淘宝】https://m.tb.cn/h.gTdgHmAYoeTX8Ib?tk=FGaF3aSNYeX CZ3452 「（福利）自主vtm风格 tfd 五芒星修身短款opm风格卫衣carti同款」\n点击链接直接打开 或者 淘宝搜索直接打开",
        "num_comments": 1,
        "comments": [
            "Embroidering on moons version seems inconsistent in height"
        ]
    },
    "APEXMADE BLCG Transformer cargo jeans ": {
        "title": "APEXMADE BLCG Transformer cargo jeans ",
        "score": 14,
        "url": "https://www.reddit.com/gallery/1dr1193",
        "content": "Wtc :【淘宝】限时淘金币抵11.9元 https://m.tb.cn/h.g6mUuiUU4fZeGSv?tk=ffUM3aSk3PL MF6563 「现.24SS牛仔Cargo重磅做旧水洗二合一可拆卸立体廓形多口袋工装裤」\n点击链接直接打开 或者 淘宝搜索直接打开",
        "num_comments": 4,
        "comments": [
            "Would be nice if there was a size chart :/",
            "Click on the link, it's literally right there",
            "get a small"
        ]
    },
    "Could i please get an LC my knowledgeable brethren": {
        "title": "Could i please get an LC my knowledgeable brethren",
        "score": 10,
        "url": "https://www.reddit.com/gallery/1dr03ea",
        "content": "tag pics pending ",
        "num_comments": 10,
        "comments": [
            "These are fake. Not even good ones, they’re budget fakes",
            "Anytime the toebox and midsole look glossy its an immediate red flag. Had the budget pairs to compare with DrkStudio's batch, and the budget pairs have a really bad overall shape to them with crappy insoles too",
            "Supah fake, toecaps are always the instant giveaway",
            "DHGate classics 💯",
            "zips not even close to the sole",
            "this is horrible bro",
            "i love you"
        ]
    }
}