{
    "Poteau de la semaine: Pierre Poilièvre sera le prochain premier ministre": {
        "title": "Poteau de la semaine: Pierre Poilièvre sera le prochain premier ministre",
        "score": 8,
        "url": "https://www.reddit.com/r/QuebecLibre/comments/1dn1tqd/poteau_de_la_semaine_pierre_poilièvre_sera_le/",
        "content": "Pierre Poilièvre sera le prochain premier ministre. Êtes-vous satisfait ou non? Auriez-vous préféré quelqu'un d'autre à la place? Croyez-vous qu'il peut réellement régler les problèmes au Canada? Parlez-en ici!",
        "num_comments": 93,
        "comments": [
            "Je naime vraiment pas Poilivre mais il est vraiment temps que Trudeau dcalisse",
            "Au Canada, on alterne entre Libraux et Conservateurs. \nPeu importe leur parti et leur chef, l c'est au tour des Conservateurs. \na va pas changer grand chose, ils vont continuer de rpondre aux besoins du patronat.",
            "Tout pour que Trudeau dbarque. Je prfrerais Max, mais il va pas renter dans ces lections ci, donc faut Poilivre pour sortir de l'extrme gauche, et aller au gauche du centre comme premire tape.",
            "J'avais bien aim l'poque Harper, on verra avec Poilivre. Le choix est quand mme facile avec le dbile a trudeau et un turban.",
            "Libraux, Conservateurs, NDP, Bloc,  cest tout des votes pour les oligarques Canadiens et mondiaux. Its all rigged baby!",
            "Sa va prendre 30 ans pour rgler les problmes du canada..",
            "a change pas grand chose qui a sera, Trudeau a tellement fait de dgats que le Canada est compltement fucked et a se replacera pas de notre vivant",
            "Non je ne crois pas que Poilievre soit un bon premier ministre 1- il n'a pas de plan 2- a part dire que c'est la faute a Trudeau il ne dit pas grand chose 3- aucun courage car il n'est pas capable de rpondre au journaliste qui pause la question suivante (quel sont vos intentions!)4- il insulte d'autres politiciens pour moi c'est l'arme des faibles et des losers et a ressemble au gars qui n'a pas fait d'tudes et qui a vocabulaire limit et part lui ont ne connais pas le reste de son quipe",
            "Je ne crois pas qu'il sera bon premier ministre, mais il est la seule alternative a Trudeau, qui en fut un des pires qu'on ait eu. On est pas sorti du bois.",
            "Franchement...    J'imagine que Poislivre fera moins de dommages que Justin mais en soit je m'en fous: Je vote Bloc et PQ, pis je vote OUI, pis sacrons notre camp de ce pays qui est pas le notre!!\n\nVonne St-Jean "
        ]
    },
    "Des logements réservés à une clientèle suscitent un malaise": {
        "title": "Des logements réservés à une clientèle suscitent un malaise",
        "score": 54,
        "url": "https://ici.radio-canada.ca/nouvelle/2084422/immigration-logement-immigrant-trois-rivieres",
        "content": "",
        "num_comments": 76,
        "comments": [
            "> C'est pas discriminatoire. C'est fait pour des clientles cibles,\n\nBabe wake up, le nouveau nologisme a just dropped.",
            "Belle faon de faire de la sgrgation sous couvert dinclusivite",
            "Vous voulez qu'on se retrouve avec des no-nazis et des klansmen au Qubec? C'est exactement comme a qu'on fait.",
            "Alors que Trois-Rivires a un taux dinoccupation de 0.4%",
            "Sidrant. a commence  srieusement aller trop loin.",
            "\"le racisme envers les blancs n'existe pas\"",
            "Des critres imposs par le fdral... Quelle surprise!",
            "Et les gens de gauche se demandent pourquoi de plus en plus de monde penchent  droite...",
            "On appelle a du racisme acceptable.\n\nMerci wokisme !",
            "La subvention viens du fdral. Encore un bel exemple de pourquoi il faut absolument changer de gouvernement. Bonne nouvelle, faites vous en pas les jours des libreaux sont compts."
        ]
    },
    "1971: les Canadiens-Français étaient considérés comme une menace nationale pour le Canada.": {
        "title": "1971: les Canadiens-Français étaient considérés comme une menace nationale pour le Canada.",
        "score": 43,
        "url": "https://v.redd.it/cpik6ejmbf9d1",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Les Anglos du Canada sont des hypocrites.",
            "Damn=Maudit\n\nS'il voulait dire criss il aurait dit \"Christ!\" ou \"cripes\" ou une geee whizzz (pour Jesus Christ).",
            "Ce nest pas en divisant par la haine et par la peur quon va avoir un meilleur pays. Cest une archive qui date de 40 ans, bas sur un extrmiste dans une salle rempli de radicaux. Ce nest pas la majorit des anglos. Attention nous sommes bientt en lection. Lingrence trangre est trs prsente sur les rseaux sociaux et la volont de diviser la population apporte la dstabilisation du pays. Divisez pour mieux rgner est le mot dordre.",
            " L'indpendance du Qubec est une menace a l'intgrit nationale du canada. Si on se spare le canada perd le quart de son pib,le cinquime de sa population,le pkus grand axe maritime en amrique du nord,plusieurs infrastructeures militaires, le pays est fractionn en 2. Et le canada devrait juste accepter ca au nom du rfrendisme ? Quelque chose qui menace sa place au G7, la qualit de vie de sa population dans les maritimes,son commerce ect.\nEn luttant contre le spratisme ,l'tat canadien lutte pour soi.",
            "maintenant on fait pareil , mais nous cest correct?",
            "No shit mais le Qubec aussi lutte sa survie et son panouissement.",
            "Lhypocrisie qubcoise est sans gal",
            "Ahhhhh oui. Les bonnes vieilles consquences de leurs actions. \n\nKess tu veut, quand on se fait taper sur la tte pendant des centaines d'annes...",
            "Il faut savoir quon reste quand meme une minorit, mais nous avons de la chance, car meme sil y a peu de qubcois qui sont cadre, nous avons eu la chance davoir beaucoup de PM canadiens qui taient canadiens franais et actuellement nous avons Trudeau et Poilivre. Ce sont 2 personnes qui ont t proches des canadiens franais et qui aujourdhui, ont t lu a la tte des 2 plus gros partis politiques du canada. Au Quebec, nous navons eu que des PM francophones et aucun anglophone, nous avons t chanceux. Lorsque nous allons dans un tablissement fdral comme un muse cest crit en anglais et en franais. Trs peu de pays ayant plusieurs ethnies peuvent se venter de cette chance. Habituellement, il y a des tensions qui ne permettent pas quune minorit du pays soit aussi reconnu par la majorit. Cest bien de se defendre, mais on doit avoir conscience de la chance que nous avons.",
            "Vrai,mais n'attendez pas  ce que l'tat canadien soit \"fair\" dans sa lutte au spratisme."
        ]
    },
    "7 Canadiens sur 10 pensent que leur pays est «brisé», selon un sondage": {
        "title": "7 Canadiens sur 10 pensent que leur pays est «brisé», selon un sondage",
        "score": 75,
        "url": "https://www.tvanouvelles.ca/2024/06/28/7-canadiens-sur-10-pensent-que-leur-pays-est-brise-selon-un-sondage",
        "content": "",
        "num_comments": 50,
        "comments": [
            "Quel gchis. Lhistoire retiendra de Trudeau fils quil aura t le pire PM que ce pays ait connu.",
            "Duh,  c'est flagrant,  le pire l dedans, c'est qu'ont est trop dociles pour faire dequoi, jusqu' temps qu'il soit trop tard",
            "3 canadien sur 10 ont un QI faible et sont incapable de comprendre ce qui se passe.",
            "Ce qui est frustrant cest le monde qui on vot pour lui plusieurs fois de suite pour mettre tout le monde dans la merde quon vit en ce moment. Aprs 1 ou 2 mandat il me semble que ctait assez flagrant quil navait rien fait de bon.",
            "Le Canada nest pas un pays cest une succursale de lONU.",
            "Bref, 3 canadiens sur 10 vivent dans le sud de leurs rentes immobilires et contribuent  la caisse lectorale du PLC.",
            "6 canadiens sur 10 ont 65 ans et plus et prvoient ne pas se faire servir au Tim Horton   la hauteur de leurs attentes",
            "On parle dun sondage avec 1000 participants les rsultats sont loin dtre gnralisables et lchantillon nest pas bien expliqu\nEncore un article pour faire parler ..",
            "a je le savais depuis longtemps",
            "Le systme capitaliste fonctionne parfaitement comme il est suppos fonctionner...."
        ]
    },
    "Résidences principales sur Airbnb: cinq stratagèmes utilisés pour contourner le système": {
        "title": "Résidences principales sur Airbnb: cinq stratagèmes utilisés pour contourner le système",
        "score": 9,
        "url": "https://www.journaldemontreal.com/2024/06/29/residences-principales-sur-airbnb-cinq-facons-de-contourner-le-systeme",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Les \"Entrepreneur\" sont vraiment toujours en train de trouver des nouvelles manire de crosser le monde!"
        ]
    }
}