{
    "Fin de semaine /r/Quebec libre": {
        "title": "Fin de semaine /r/Quebec libre",
        "score": 3,
        "url": "https://www.reddit.com/r/Quebec/comments/1dqed5m/fin_de_semaine_rquebec_libre/",
        "content": "Vive le /r/Quebec libre !",
        "num_comments": 0,
        "comments": []
    },
    "Pourquoi s'entêter à faire de l'alcool au volant? (Suite)": {
        "title": "Pourquoi s'entêter à faire de l'alcool au volant? (Suite)",
        "score": 252,
        "url": "https://www.reddit.com/r/Quebec/comments/1dqupg6/pourquoi_sentêter_à_faire_de_lalcool_au_volant/",
        "content": "Salut r/Quebec,\n\nLa [situation d'hier](https://www.reddit.com/r/Quebec/comments/1dq8hjk/pourquoi_sent%C3%AAter_%C3%A0_faire_de_lalcool_au_volant/) a eu des suites malheureuses aujourd'hui.\n\nDonc la Police a ramené X chez lui vers minuit sur lequel il a fait le plus de bruit possible une partie de la nuit.\n\nCet après-midi il est allé chercher son auto à la fourrière et est revenu en conduisant. Comme j'avais un colis à lui et il avait des choses à moi je n'ai pas eu le choix que d'interagir avec sur laquelle je lui ait donné son colis et il a refusé de me donner mes choses et m'a expliqué qu'il me ferait des représailles pour hier.\n\nQuand j'ai tenu à avoir mes choses (Deux boîtes dans son Locker car le mien est plein) et que j'ai dit que s'il gardait mes choses en otage je rappellerai la police il m'a fait des menaces de me poignarder sur lequel j'ai rapeller la police et à ce moment-là il m'a redonné accès à mes boîtes.\n\nRésultats est que j'ai récupéré mes choses et il vient de se faire re-arreter pour menaces de mort...\n\nEdit:\n\n* [Première partie, conflit avec le voisin du 3e](https://www.reddit.com/r/Quebec/s/jK3dDh96UL)\n* [Deuxième partie: probable alcool au volant](https://www.reddit.com/r/Quebec/s/oYdTEnXG5p)\n* [Troisième partie: Alcool au volant](https://www.reddit.com/r/Quebec/s/WbpBFdE3mv)\n* On est donc à la quatrième aventure de X **ce mois-ci**.",
        "num_comments": 68,
        "comments": [
            "OMG, je viens de comprendre que c'est le mme dude qui dormait les portes de char ouvertes, pis qu'il dormait tellement dure que OP pensais qu'il tait mort.",
            "Calisse, y dont ben crazy lui",
            "Tout tes moves sont les best moves, Tu agis pas juste en bon citoyens mais en humain. Best of luck, OP !",
            "Achte toi une camra de porte. Pense a va t'tre utile bientt  voir comment il est fou",
            "J'commence  penser que c'est pas un bon gars!",
            "Je te souhaite un weekend relaxe! Merci en passant, on sait jamais ce qui peut arriver",
            "Ton voisin est un cas psychiatrique lourd. Fais attention, a peut devenir imprvisible.",
            "Le plus triste l-dedans c'est qu'il ne comprend pas  que tu lui a sauver le cul et srement sauver le cul de quelqu'un d'autre ...",
            "T'as pas gagn  la loterie des voisins ! Bonne chance, tu fais les bonnes choses t'es juste pris dans une situation plate.",
            "A normal week in Hochelaga"
        ]
    },
    "Des logements réservés à une clientèle suscitent un malaise": {
        "title": "Des logements réservés à une clientèle suscitent un malaise",
        "score": 87,
        "url": "https://ici.radio-canada.ca/nouvelle/2084422/immigration-logement-immigrant-trois-rivieres",
        "content": "",
        "num_comments": 108,
        "comments": [
            "Je tiens  rappeler que a se passe alors que Trois-Rivires  un taux dinnocupation de seulement 0.4%",
            "Deux de mes anciens propritaires mont dit de vive-voix quils ne louaient pas  des africains ou des tamouls, donc je comprends pourquoi ce genre dinitiative existe. La discrimination au logement cest un problme. \n\nCest pas une OSBL de six logements  Trois Rivieres qui est responsable de la crise du logement.",
            "La seule distinction qui compte c'est la situation conomique, pas l'ge, ni la langue, ni la religion, ni la couleur de la peau.",
            "Osti qu'on est caves. Y'a tu un seul pays asiatique dans le monde avec des logements subventionns rservs aux non-asiatique? Un seul pays noir avec des logements subventionns  rservs aux non-noirs? Un seul pays arabe avec des logements subventionns  rservs aux non-arabes?\n\n tous ceux qui rejettent l'ide qu'tre ''woke'' a existe, parce qu'il n'y a pas de dfinition super prcise qui englobe toutes les manifestations de l'idologie, ben vl un autre bel exemple pour circonscrire concrtement l'ide morcreau par morceau.",
            "Pourquoi ai-je limpression que les pays occidentaux doivent toujours sautoflageller et mettre les minorits sur un pidestal ? Nous devons toujours nous excuser dtre chez nous au nom de pseudo-injustices.",
            "Oouf...beau cas pour le Tribunal des droits de la personne...\n\nJ'ai hate de voir comment ils vont recevoir a...",
            "c'est pas comme a que la france on eu des probleme avec des quartier apeler la cit ?",
            "La sgrgation de retour avec formule revisite !",
            "En mme temps, c'est vrai que la pauvret touche beaucoup les minorits et qu'elles sont discrimins par des propritaires plus facilement que les femmes ou les hommes blancs, en plus dans une ville avec un taux d'inoccupation extrmement bas. Les proprio ont le luxe de laisser sortir leurs prjugs dans ce contexte ou de booster les loyers au max, ce genre de projet c'est ben leur seule avenue rendu l.",
            "Le seul critre devrait tre le revenue, dsol, mais oui, c'est de la discrimination."
        ]
    },
    "Montreal with some theatrics, as they get Celine Dion to announce they are picking Ivan Demidov ": {
        "title": "Montreal with some theatrics, as they get Celine Dion to announce they are picking Ivan Demidov ",
        "score": 133,
        "url": "https://v.redd.it/vv59m930he9d1",
        "content": "",
        "num_comments": 26,
        "comments": [
            "Eh boy, Ren-Charles est pu jeune jeune",
            "Score! On l'a tabarnac!!! Ah-hihiiiiiii! Heille, Demidov clisse! Tabarnac! Tabarnac, on l'a! Yiyiyiyiyi! C-lisse de calvaire de tabarnac de clisse! On l'a, ciboure! Hein? Hein Mary, clisse? Ta lasagne ta bonne en tabarnac! Ciboire de tabarnac! Onheille, Demidov, calvaire, a c'est mon jouer en ostie! Clisse de crisse! Tabarnac! Clisse! Y'a mis a 2-2, calvaire, pis y clisse a 3-2 en supplmentaire! Heillestion va lesrahheille, ma, ma chaise, m'a y'a l'amener, s'a rue Sainte-Catherine, clisse. Tabarnac! Tabarnaheille, crisse a d'daheilley'aah y'aas-tu vasas-tu vu a? As-tu vu ca? As-tu vu a? Ciboire! Orgore a tabarnac! arGARGARGARGARGRE! G si c'est facile! G si c'est facile! G si c'est facile... Ciboire! S'est fait... G si c'est facile! Osttabarnac! G si c'est facile! Gargargargar-GRE, tabarnac! C'est facile!! a rentre comme du beurre, comme popa dans moman. Maudit clisse! ... Tabarnac! Tabarnac! Heille, un aut' fort, clisse! ... On en vire une tabarnac!",
            "lol la manire dont elle le trane par la main tout le long xD",
            "Je pense que c'est la premire fois que j'entends Cline parler en anglais",
            "Jsuis mort de rire de savoir que ya du monde qui payent pour assister  ca. Gros show amricain",
            "est pas si \"stiff\" que ca.",
            "Il a 23 ans . Il a srieusement lair davoir 45.",
            "Tabarnak je pensais ctait Paul Byron hh",
            "Il se faisait tran par sa mre. Il a l'air d'avoir vir une brosse dans l'aprs-midi pis de pas avoir envi d'tre l.",
            "Un grand classique culturel qubcois des temps modernes"
        ]
    },
    "La fête du Canada c'est aussi une occasion de se rappeler \"notre place\" au sein de cette fédération monarchiste. Le message est moins cru aujourd'hui mais le fond reste similaire...": {
        "title": "La fête du Canada c'est aussi une occasion de se rappeler \"notre place\" au sein de cette fédération monarchiste. Le message est moins cru aujourd'hui mais le fond reste similaire...",
        "score": 25,
        "url": "https://v.redd.it/cpik6ejmbf9d1",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Tellement tann des \"extrmistes sparatistes\" qui bash le canada  chaque occasion de le faire.",
            "Moi aussi, un peu comme l'Irlande avec l'Angleterre les relations seront beaucoup plus saines et positives aprs l'indpendance.",
            "C'est pas Patrick Roy?"
        ]
    }
}