{
    "Poteau de la semaine: Pierre Poilièvre sera le prochain premier ministre": {
        "title": "Poteau de la semaine: Pierre Poilièvre sera le prochain premier ministre",
        "score": 8,
        "url": "https://www.reddit.com/r/QuebecLibre/comments/1dn1tqd/poteau_de_la_semaine_pierre_poilièvre_sera_le/",
        "content": "Pierre Poilièvre sera le prochain premier ministre. Êtes-vous satisfait ou non? Auriez-vous préféré quelqu'un d'autre à la place? Croyez-vous qu'il peut réellement régler les problèmes au Canada? Parlez-en ici!",
        "num_comments": 93,
        "comments": [
            "Je n’aime vraiment pas Poilièvre mais il est vraiment temps que Trudeau décalisse",
            "Au Canada, on alterne entre Libéraux et Conservateurs. \nPeu importe leur parti et leur chef, là c'est au tour des Conservateurs. \nÇa va pas changer grand chose, ils vont continuer de répondre aux besoins du patronat.",
            "Tout pour que Trudeau débarque. Je préfèrerais Max, mais il va pas renter dans ces élections ci, donc faut Poilièvre pour sortir de l'extrème gauche, et aller au gauche du centre comme première étape.",
            "J'avais bien aimé l'époque Harper, on verra avec Poilièvre.  Le choix est quand même facile avec le débile a trudeau et un turban.",
            "Libéraux, Conservateurs, NDP, Bloc, … c’est tout des votes pour les oligarques Canadiens et mondiaux. It’s all rigged baby!",
            "Sa va prendre 30 ans pour régler les problèmes du canada..",
            "Ça change pas grand chose qui ça sera, Trudeau a tellement fait de dégats que le Canada est complètement fucked et ça se replacera pas de notre vivant",
            "Non je ne crois pas que Poilievre soit un bon premier ministre 1- il n'a pas de plan 2- a part dire que c'est la faute a Trudeau il ne dit pas grand chose 3- aucun courage car il n'est pas capable de répondre au journaliste qui pause la question suivante (quel sont vos intentions!)4- il insulte d'autres politiciens pour moi c'est l'arme des faibles et des losers et ça ressemble au gars qui n'a pas fait d'études et qui a vocabulaire limité et part lui ont ne connais pas le reste de son équipe",
            "Je ne crois pas qu'il sera bon premier ministre, mais il est la seule alternative a Trudeau, qui en fut un des pires qu'on ait eu. On est pas sorti du bois.",
            "Franchement...    J'imagine que Poislièvre fera moins de dommages que Justin mais en soit je m'en fous: Je vote Bloc et PQ, pis je vote OUI, pis sacrons notre camp de ce pays qui est pas le notre!!\n\nVonne St-Jean 🤟"
        ]
    },
    "Des logements réservés à une clientèle suscitent un malaise": {
        "title": "Des logements réservés à une clientèle suscitent un malaise",
        "score": 54,
        "url": "https://ici.radio-canada.ca/nouvelle/2084422/immigration-logement-immigrant-trois-rivieres",
        "content": "",
        "num_comments": 76,
        "comments": [
            "> C'est pas discriminatoire. C'est fait pour des clientèles ciblées,\n\nBabe wake up, le nouveau néologisme a just dropped.",
            "Belle façon de faire de la ségrégation sous couvert dinclusivite",
            "Vous voulez qu'on se retrouve avec des néo-nazis et des klansmen au Québec? C'est exactement comme ça qu'on fait.",
            "Alors que Trois-Rivières a un taux d’inoccupation de 0.4%",
            "Sidérant. Ça commence à sérieusement aller trop loin.",
            "\"le racisme envers les blancs n'existe pas\"",
            "Des critères imposés par le fédéral... Quelle surprise!",
            "Et les gens de gauche se demandent pourquoi de plus en plus de monde penchent à droite...",
            "On appelle ça du racisme acceptable.\n\nMerci wokisme !",
            "La subvention viens du fédéral. Encore un bel exemple de pourquoi il faut absolument changer de gouvernement. Bonne nouvelle, faites vous en pas les jours des libéreaux s’ont comptés."
        ]
    },
    "1971: les Canadiens-Français étaient considérés comme une menace nationale pour le Canada.": {
        "title": "1971: les Canadiens-Français étaient considérés comme une menace nationale pour le Canada.",
        "score": 43,
        "url": "https://v.redd.it/cpik6ejmbf9d1",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Les Anglos du Canada sont des hypocrites.",
            "Damn=Maudit\n\nS'il voulait dire criss il aurait dit \"Christ!\" ou \"cripes\" ou une geee whizzz (pour Jesus Christ).",
            "Ce n’est pas en divisant par la haine et par la peur qu’on va avoir un meilleur pays. C’est une archive qui date de 40 ans, basé sur un extrémiste dans une salle rempli de radicaux. Ce n’est pas la majorité des anglos. Attention nous sommes bientôt en élection. L’ingérence étrangère est très présente sur les réseaux sociaux et la volonté de diviser la population apporte la déstabilisation du pays. Divisez pour mieux régner est le mot d’ordre.",
            " L'indépendance du Québec est une menace a l'intégrité nationale du canada. Si on se sépare le canada perd le quart de son pib,le cinquième de sa population,le pkus grand axe maritime en amérique du nord,plusieurs infrastructeures militaires, le pays est fractionné en 2. Et le canada devrait juste accepter ca au nom du référendisme ? Quelque chose qui menace sa place au G7, la qualité de vie de sa population dans les maritimes,son commerce ect.\nEn luttant contre le sépératisme ,l'état canadien lutte pour soi.",
            "maintenant on fait pareil , mais nous c’est correct?",
            "No shit mais le Québec aussi lutte sa survie et son épanouissement.",
            "L’hypocrisie québécoise est sans égal",
            "Ahhhhh oui. Les bonnes vieilles conséquences de leurs actions. \n\nKessé tu veut, quand on se fait taper sur la tête pendant des centaines d'années...",
            "Il faut savoir qu’on reste quand meme une minorité, mais nous avons de la chance, car meme s’il y a peu de québécois qui sont cadre, nous avons eu la chance d’avoir beaucoup de PM canadiens qui étaient canadiens français et actuellement nous avons Trudeau et Poilièvre. Ce sont 2 personnes qui ont été proches des canadiens français et qui aujourd’hui, ont été élu a la tête des 2 plus gros partis politiques du canada. Au Quebec, nous n’avons eu que des PM francophones et aucun anglophone, nous avons été chanceux. Lorsque nous allons dans un établissement fédéral comme un musée c’est écrit en anglais et en français. Très peu de pays ayant plusieurs ethnies peuvent se venter de cette chance. Habituellement, il y a des tensions qui ne permettent pas qu’une minorité du pays soit aussi reconnu par la majorité. C’est bien de se defendre, mais on doit avoir conscience de la chance que nous avons.",
            "Vrai,mais n'attendez pas à ce que l'état canadien soit \"fair\" dans sa lutte au sépératisme."
        ]
    },
    "7 Canadiens sur 10 pensent que leur pays est «brisé», selon un sondage": {
        "title": "7 Canadiens sur 10 pensent que leur pays est «brisé», selon un sondage",
        "score": 75,
        "url": "https://www.tvanouvelles.ca/2024/06/28/7-canadiens-sur-10-pensent-que-leur-pays-est-brise-selon-un-sondage",
        "content": "",
        "num_comments": 50,
        "comments": [
            "Quel gâchis. L’histoire retiendra de Trudeau fils qu’il aura été le pire PM que ce pays ait connu.",
            "Duh,  c'est flagrant,  le pire là dedans, c'est qu'ont est trop dociles pour faire dequoi, jusqu'à temps qu'il soit trop tard",
            "3 canadien sur 10 ont un QI faible et sont incapable de comprendre ce qui se passe.",
            "Ce qui est frustrant c’est le monde qui on voté pour lui plusieurs fois de suite pour mettre tout le monde dans la merde qu’on vit en ce moment. Après 1 ou 2 mandat il me semble que c’était assez flagrant qu’il n’avait rien fait de bon.",
            "Le Canada n’est pas un pays… c’est une succursale de l’ONU.",
            "Bref, 3 canadiens sur 10 vivent dans le sud de leurs rentes immobilières et contribuent à la caisse électorale du PLC.",
            "6 canadiens sur 10 ont 65 ans et plus et prévoient ne pas se faire servir au Tim Horton  à la hauteur de leurs attentes",
            "On parle d’un sondage avec 1000 participants… les résultats sont loin d’être généralisables… et l’échantillon n’est pas bien expliqué…\nEncore un article pour faire parler ..",
            "Ça je le savais depuis longtemps",
            "Le système capitaliste fonctionne parfaitement comme il est supposé fonctionner...."
        ]
    },
    "Résidences principales sur Airbnb: cinq stratagèmes utilisés pour contourner le système": {
        "title": "Résidences principales sur Airbnb: cinq stratagèmes utilisés pour contourner le système",
        "score": 9,
        "url": "https://www.journaldemontreal.com/2024/06/29/residences-principales-sur-airbnb-cinq-facons-de-contourner-le-systeme",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Les \"Entrepreneur\" sont vraiment toujours en train de trouver des nouvelles manière de crosser le monde!"
        ]
    }
}