{
    "Fall Solo Tour Dates Announced": {
        "title": "Fall Solo Tour Dates Announced",
        "score": 553,
        "url": "https://www.reddit.com/gallery/1d6nhqy",
        "content": "",
        "num_comments": 280,
        "comments": [
            "Can't believe he's actually playing Christchurch! The last time we got Radiohead here was the goddam 90s. Respect Thom you the man",
            "Technically since its in the southern hemisphere its spring solo tour dates.",
            "Fucking of course its only Sydney/Melbourne",
            "I wish i was able to verbalise how happy this makes me! This doesnt feel real whatsoeverI thought australia wasnt gonna see the lad again! Heck yeah!!\n\nThis just made my entire bloody year. I wish i could express how lucky i feel as of now. THIS IS AMAZING!!",
            "Danggg see you all in Singapore! My wallets going to kill me if I go to Japan too",
            "inb4 all the greedy north americans/europeans whine and complain about thom doing shows in countries thom/rh never tour in bc they wanna see him for the 14th time",
            "Wow 15 shows, pretty extensive solo tour",
            "wow that sydney opera house forecourt venue looks amazing",
            "Dang, I'm in Japan a week after those shows.",
            "Crying pissing throwing up rn"
        ]
    },
    "new season of the bear": {
        "title": "new season of the bear",
        "score": 67,
        "url": "https://i.redd.it/tjq6yos7ai9d1.png",
        "content": "",
        "num_comments": 7,
        "comments": [
            "I have a feeling I should check this show out.  I've been hearing so much about it lately.",
            "One of the most underrated songs from them, IMO.",
            "god, i love that song",
            "They also play Getchoo in the new season",
            "[Nice Post]",
            "Its very good.",
            "[Nice meme]"
        ]
    },
    "I'm a Kangaroo in your headlights": {
        "title": "I'm a Kangaroo in your headlights",
        "score": 13,
        "url": "https://v.redd.it/pubg7levoi9d1",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Phew, for a minute there..",
            "What song is being used in the background?",
            "Rabbit In Your Headlights",
            "It's similar to the [original](https://www.youtube.com/watch?v=XbByxzZ-4dI) in the sense that the Roo starts boxing the damn car after T-posing, so I wouldn't worry. He/she was fine, just had enough!",
            "It's Rabbit in Your Headlights by U.N.K.L.E, featuring Thom Yorke on vocals.   \n  \nIt has a [memorably amazing film clip](https://www.youtube.com/watch?v=XbByxzZ-4dI) made my Jonathan Glazer (recent Oscar-winning director), which this footage of the Roo reminded me of."
        ]
    },
    "What Radiohead song is this reminding me of?": {
        "title": "What Radiohead song is this reminding me of?",
        "score": 181,
        "url": "https://v.redd.it/miebm212de9d1",
        "content": "Song is from 1972",
        "num_comments": 57,
        "comments": [
            "'Man Of War' has a slightly similar progression and arrangement. It's far from the same, but that's what first comes to mind.",
            "CLUBE DA ESQUINA MENTIONED  WHAT THE FUCK IS A BAD SONG?  TUDO O QUE VOC PODERIA SER? SHIT MAN IMMA BE THE GOAT ALBUM CLUBE DA ESQUINQB",
            "Life in a Glass House or Man of War?",
            "The best song on one of the best albums of all time. Everyone should listen to Clube da Esquina",
            "MPB (brazilian popular music) MENTIONED NEXT TO RADIOHEAD, THE STARS HAVE ALIGNED, GLORY BE.\n\nMAKE THOM AND CHICO BUARQUE KISS",
            "Never realized how similar it was to Man of War",
            "Reminds me of Man of War.",
            "This whole album is sooo good!",
            "Life in a glass house, I was kinda thinking The Numbers too",
            "One of my favorite ever albums"
        ]
    },
    "Guys I’m on the ok computer highway": {
        "title": "Guys I’m on the ok computer highway",
        "score": 195,
        "url": "https://i.redd.it/lhse0q334e9d1.jpeg",
        "content": "",
        "num_comments": 22,
        "comments": [
            "Are you in a fast German car?",
            "From 2019-2023 before I moved, on bad days I'd at least know my drive to and from work would go through the OK Computer highway. (The I84-I91 interchange in northern Hartford, Connecticut) If anyone cares the place is a total mess. It's poorly designed and slices the city in half, and people drive like dipshits through it, there's almost always traffic.\n\nGuess who's moving again in three weeks and will resume driving through the OK Computer highway 18 times a month or so?",
            "I live in CT, have driven on this so many times, and I had no idea.",
            "\"Don't leave me highway don't leave me drive\"",
            "No way!!! This is my morning commute, I had no idea!",
            "In a fast German car\nI'm amazed that I survived\nAn airbag saved my life",
            "On your way to Capitol Groove festival?",
            "Lived next to it for the first 18 years of my life",
            "Exit (music (for a film))",
            "I see you Hartford "
        ]
    }
}