{
    "Weekly Showcase Thread - June 24, 2024": {
        "title": "Weekly Showcase Thread - June 24, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/RaidShadowLegends/comments/1dn9v2s/weekly_showcase_thread_june_24_2024/",
        "content": " Hi Raiders, welcome to the weekly Showcase post!\n\nPull a great champion? Beat a dungeon level for the first time? Finally got your hands on Lydia? Congratulations, it belongs here! Feel free to post any type of showcase as a reply to this thread. \n\nAll individual “showcase” posts will be removed. \n\n**Why this thread exists**\n\nAll individual “showcase” posts will be removed, in an effort to keep the subreddit less cluttered and promote more discussion on the main page.\n\n**But I pulled “X” and I don’t know what to do with them!**\n\nThe first step to try is searching for the champion's name using the search bar above. There are already a great deal of discussions on the subreddit that provide useful guidance in how to make the most out of a particular champion. Additionally, there are a ton of great content creators who make videos about Raid, if that's how you prefer to learn.\n\nIf you’re still unsure, you can make a post that includes the champion name in the title and include a brief description of what you’ve found and what you need help figuring out.",
        "num_comments": 31,
        "comments": [
            "Another first for still a new guy.  Level 44 account, one leggo, several epics, and FIRST victory in Doom Tower.  It's only Floor One, but I'm pleased with marked progress.",
            "today was a good day.  pulled all my ancients and didn't get crap, so bought the 11-pack with gems in the shop which is something I don't normally do.  finally pulled geomancer.",
            "5 weeks in game and victorious over first of many stages to go in the Sand Devil's Necropolis.  Time of 1:12 and amouint of turns was 42.  Anyways, I know it's not a big deal to nearly everyone, but I wanted to state it somewhere since we all have gone through our RAID firsts.  I'm not entirely F2P as I have used probably $200 on energy, silver, and ascension potions, but I have not started any subscriptions or game passes.",
            "This is stupid game, i hate this game, 200 shard open 3 dupe lego, saito, warchief,ultan 3 lego useless, i open shards for aeshma epic for mikage, i didn't pull aeshma, i'm now so angry",
            "Any advice for a free to play player struggling with the fact that all my higher shards almost always end up with a rare champion",
            "Wix fusion happened just before I first started, and even the second one that completed last week I wasn't progressed in the game enough to complete.  However, I did get a couple good damage dealers in Skrilix x2.  Congrats on your pull, I have not been able to complete enough prisms for an attempt, Seeing a guy do it only a month ahead of me in the game is very encouraging to me.\n\n(btw, I read the Hangul).",
            "Really big grats on the Firrol, great champion for early or end game accounts!",
            "I feel the same with Godseeker as you do with Amius (but still way behind in progress).",
            "He's been great for me.  Only one encounter that has not worked out well is the Sand Devil.  For some strange reason, his destroyed hp doesn't get restored by Adelyn when she does it for the entire group.",
            "you should just use them on 2x , or save them by 3 months and do fusions , normaly with 5 sacred and 40/60 ancient is enough to do one fusion , so you get one lego and at least one 2x will be held in the fusion so you will win more epics or even one lego . i don't pull out of fusions or guaranted normally 20 sacreds ."
        ]
    },
    "Packmaster Shy'ek Fragment Fusion Starting July 4th, 2024": {
        "title": "Packmaster Shy'ek Fragment Fusion Starting July 4th, 2024",
        "score": 15,
        "url": "https://www.reddit.com/r/RaidShadowLegends/comments/1dqlpok/packmaster_shyek_fragment_fusion_starting_july/",
        "content": "Hi folks! On Thursday, July 4th, we're planning to launch a Champion Fragment event with a new Champion - **Packmaster Shy'ek**.   \n\nFaction - Orcs \n\nRarity - Legendary \n\nType - HP \n\nAffinity - Force  \n\nPackmaster Shy'ek is a unique type of Champion who thrives when surrounded by his loyal hounds.  As a mighty pack leader, Shy'ek excels at gathering hounds to his side, enhancing his abilities in battle. He is a versatile Champion, useful in both PvP and PvE content. With Packmaster on your team, new players will be able to utilize hounds for clearing early content more effectively, and seasoned players can experiment in the Arena or form new teams against the Hydra. Shy'ek's pack consists of Terrorbeast, Goremask, Hound-Spawn, Hellfang, Fellhound, and Stitched Beast. When at least one hound joins him in the battle, his skillset gains additional benefits.  \n\nWithout his loyal beasts, Shy'ek's A1 has a chance to land a Decrease DEF debuff on the enemy. His A2 allows Packmaster Shy'ek to tank and absorb enemies' damage with the help of Taunt, self-heal, and occasional Shield. A3 will increase allies' Turn Meter and place Block buffs, so you will find it useful for speed teams in the Arena. And his Passive will boost the whole team's damage against the target enemy.  \n\nWhen Shy'ek is joined by at least one member of his pack, his A1 additionally commands his hound companions to launch a coordinated attack on the target. His enhanced A2 will make buffs protected, and Block buffs debuff from his A3 becomes irresistible. Additionally, the hounds will launch a counterattack whenever Packmaster is attacked, further enhancing his passive ability.  \n\nBy the way, if you're not impressed with his current roster of loyal hounds, just wait—Packmaster Shy'ek is always on the lookout for new members to add to his pack, and who knows what beast will join his side next.\n\nhttps://preview.redd.it/sollyp95cb9d1.png?width=1786&format=png&auto=webp&s=0d01be39d2ac8df81e38d9dc995ce93ff168cce3\n\nWhat do you think about Packmaster Shy'ek's skill set?   \n\n\n[View Poll](https://www.reddit.com/poll/1dqlpok)",
        "num_comments": 114,
        "comments": [
            "What's up with all the fusions being Force affinity? This is like 4 in a row.\n\nGonna need to see what new hound they are adding and if it will be attainable before really understanding this fusion I think",
            "What are the odds that there’s a new legendary hound that can be earned in the new clan wars? \n\nThat’s the only way any of this makes any sense ",
            "Uh, okay. It's certainly an... interesting kit. I suppose he's got some good things going for him. He's got hex with an additional damage bonus, taunt, block buffs, irresistible and protected if he's go an ally with him. Would be an excellent kit for hydra on its own, but considering he's essentially taking up 2 team slots to get his full value, and that the champion you have to put in that slot is pretty much useless except possibly, if I'm being very generous here, Fellhound... I struggle to see a use for him that makes him worth using.\n\nBut yeah, that last paragraph is just pure BS. \"Hey guys, this is absolute trash, but maybe we might do something about it at some unspecified later date \\*wink wink\\*. Wouldn't want to miss out on that, right?\". If they are true to form, it will be a new champion announced as a quasi-fusion halfway through the main fusion like the previous partner fusions have been, or maybe it'll just be a far more egregious 10x event or something. Or it's just a big joke and there'll be no saving grace to be found. Can't have us able to make informed decisions, now can they?",
            "Not super great or anything but for most people without relying on shard pulls the likely options of block buff champ for hydra is uugo, deliana, sun wukong, ostrox, fenax and umbral. This champ brings very reliable block buff (no problem with affinity or poison cloud), basically will never die, will mischief tank, boost speed via aura and turn meter and as chef kiss keeps mischief head permamently hexed. Those are all properties that make hydra auto team much smoother and less likely to fail.\n\nNo way is this champ useless and I would question anyone who voted such.",
            "I'm zigging while y'all homies can zag. Hydra lead: brings the aura and the TM boost spam, block buffs, hex and 2 turn UNREMOVABLE Taunt (fuck off 3%) on a 3-turn cooldown, any way you can reduce that and it's permanent taunt uptime which means your champions can't be consumed. Throw a single Felhound in the team for big damage and provoke set where he'll be ally/counter attacking every 3 seconds and things are pretty interesting.\n\nWhen your CC overlords tell you this is way better than you guys think at first glance, you heard it here first.",
            "He has 2 turn taunt on 3 turn cooldown. I'll do the fusion just for that \\^\\^",
            "2 turn taunt on a 3 turn cooldown and yall are still complaining?",
            "That last paragraph tells us all that Plarium knows this is a bad champ, but they want us to collect him anyways due to the promise of a future buff.  Not a great look.",
            "What if the next free login champ is a hound? Share your thoughts!",
            "It won't let me vote for some reason. I would have voted for must-have. What a super fun kit. The taunt on a 3 turn cd. I'm down. The rare dog pair hits hard, too."
        ]
    },
    "Guardian Tank Geomancer?": {
        "title": "Guardian Tank Geomancer?",
        "score": 6,
        "url": "https://www.reddit.com/r/RaidShadowLegends/comments/1dra3ar/guardian_tank_geomancer/",
        "content": "Currently have like 3 silver total so I can’t swap around and upgrade to test it out. \n\nCould Geo be built in a Guardian set (focusing ACC>HP%>DEF%) to make the second part of his passive stronger?\n\n>Whenever this champion is attacked, reflect 30% of the damage instead\n\nOr does the guardian ally protection not count as a hit?\n",
        "num_comments": 4,
        "comments": [
            "I am nearly certain it does not work that way. They are \"absorbing\" the damage, not being attacked.",
            "it is still free gear removal for the next 24 hours so you can test it out",
            "That’s what I figured, but I wasn’t positive lol. Thank you",
            "How is he going to upgrade his gear with 3 silver?"
        ]
    },
    "New Fusion is gonna be a Hydra GOD! Hear me out:": {
        "title": "New Fusion is gonna be a Hydra GOD! Hear me out:",
        "score": 52,
        "url": "https://www.reddit.com/r/RaidShadowLegends/comments/1dqwq0r/new_fusion_is_gonna_be_a_hydra_god_hear_me_out/",
        "content": "https://preview.redd.it/d6yd9cec6e9d1.png?width=1466&format=png&auto=webp&s=3fccd531cde228518834f1a7e8846a6e84d7c579\n\nHis A3 is a very good ability, Yeah, the Hex, counter attack and ally attack are all nice too. Dont forget the 20% dmg increase, but the real deal is his A2.  \nI, myself, been running an Emic infinity comp. For everyone who odes not know: If taunt is up, no one gets eaten. So if you have 100% uptime of taunt you can go to the trun limit, if the buff does not get stolen.  \nThats the tricky part with emic, you have to have insane resist and preferably protected set.\n\nBut the packmaster just does a un removeable, stoleable or transferrable taunt buff on himself. Thats GG for Hydra.  \nJust pair him up with 2 Painkeepers, shamael and lets say fellhound and youre gtg. Even more insane if the new dog(s) they teasered are good champions aswell. \n\nMark my words.",
        "num_comments": 47,
        "comments": [
            "Agree but Only need 1 Pain keeper he’s on a 3 Turn CD",
            "I learned my lesson with Wixwell.  I'm not letting this guy pass me by",
            "Come on! Release the hound first then. Typical Plarium. There are many paired champs but many are misses. Narsis n Queen, Taras n Marichka, Rotos and Siphi are the exceptions to pairs being sub-par (honorable mention to Venus n Cupidus). Am I going to be fusing Oella and Ultan of the Shell or Kaja and Timit or Minaya and Khronar or Astralon and Lix? It such a gamble. And how will the \"New hound\" be acquired? I'm guessing a guaranteed event, so will I even have the resources to get that champ when and if it is released? We are due for a guaranteed void so it could be 120 voids or something I can't do right now, which would make the fusion a waste.\n\n![gif](giphy|dXcu7KOFncomyBcyB9)",
            "Might help, but a hound is eating a spot. Best option maybe felhound in provoke and the new blessing to up to a 30% dec spd on his a1 aoe. Thats a very weak unit though compared to what you want to run in these slots just to get no 3% taunt steal the emic comp has. Think he'll be very good option for those without emic or full end game comps.",
            "I think people are getting stuck on the rares too much. I have not been this excited about a fusion in a while.",
            "Absolutely going for it. Orc is one of my weakest factions right now and that passive is SPICY. The potential is in fact there.\n\nWhy aren't any the common/uncommon doggies on his passive list? I mean I know why come on, but why not?",
            "I run the Emic/Nia taunt team manually and can get around 200 million on NM. I can’t wait to make it auto with this champ. I’m pulling my 6* awakened Fellhound out of campaign farming and putting him into a provoke set with as much damage as I can stack. PK will be in guardian and 500 resist so that she hopefully doesn’t get provoked when she needs to reset the Packmaster’s A2. Actually just realized Emic’s reset skill has a lower CD so he could fill the slot instead of PK. Then I’ll fill the other slots with Shamael, Gnut, and either Eostrid in a cursed set, Padraig, or Michinaki. Could be cool to see what two taunt champs can do. I don’t care if the damage is low, I just want a full auto team I can run and walk away from.",
            "True, but knowing Plarium, they will make you pay for the new hound",
            "The hex is super conditional and you won’t get it on any decapitated heads. The Dec defense is single target, and taunt is only good in hydra if you use that specific comp, and I guarantee you it doesn’t do as much damage as the comp I already use. Easy skip, keep smoking that CC pack",
            "He might still want resistance for Mischief's turn meter steal."
        ]
    },
    "New player looking for advice": {
        "title": "New player looking for advice",
        "score": 3,
        "url": "https://www.reddit.com/r/RaidShadowLegends/comments/1drcb60/new_player_looking_for_advice/",
        "content": "Title says it. I started the game this morning and played for a few hours. Got the hang of the gameplay loop and what not. I'll take any advice you got",
        "num_comments": 6,
        "comments": [
            "Don't pull shards until you have 2 X chance. I learned that way later than I should have.",
            "1. urgently use promo code Monkeyking.\n2. While you are a beginner, you open all shards except green ones at 2x events. Now take place the 2x event for ancient (blue) shards is being, while it is still working you need to get and open as many blue ones as possible. when you stop being a beginner you will start opening shards while doing fusion. this process will take several months or longer.",
            "Show me your champs",
            "hellhades.com",
            "Use the promo code Monkeyking. \n\nhttps://hellhades.com/what-makes-an-effective-12-3-brutal-campaign-farmer/\n\nhttps://youtu.be/R1mkHVqZGLw?si=Pafo7zkEzW_RUCG5",
            "[Here you go.](https://youtu.be/g_hAG8O7HZQ)"
        ]
    }
}