{
    "Check-in Post - Have something to say but don't want to make a post about it? Comment here!": {
        "title": "Check-in Post - Have something to say but don't want to make a post about it? Comment here!",
        "score": 7,
        "url": "https://www.reddit.com/r/raisedbynarcissists/comments/1dq60ll/checkin_post_have_something_to_say_but_dont_want/",
        "content": "If you have something you want to say but don't want to make a post about it, you can comment here and get it off your chest. Happy news, sad news, venting or whatever else is going on with you is welcome.\n\nA reminder that moderation is biased for the OP. In this case, OP will refer to the Redditor that wrote the parent comment. Needless to say, all rules on RBN will apply to comments in this thread.\n\n*This is scheduled thread will be posted on Thursdays at 00:00 UTC.*",
        "num_comments": 15,
        "comments": [
            "**This is an automated message posted to ALL posts in this subreddit with some basic information about the group including (very importantly)  rules.  Why are you getting this message?  Most people seem to not read the sidebar for information or the rules, so it is now being posted under all posts.**  \n\n**Confused about acronyms or terminology?** [Click here!](https://www.reddit.com/r/raisedbynarcissists/wiki/acronyms)\n\n**Need info or resources?**  Check out our [Helpful Links](https://www.reddit.com/r/raisedbynarcissists/wiki/helpfullinks) for information on how to deal with identity theft, how to get independent of your n-parents, how to apply for FAFSA, how to identify n-parents and SO MUCH MORE!\n\nThis is a reminder to all participants, RBN is a support group that is moderated very strictly.  Please report inappropriate content so it can be reviewed by the mods.\n\n**Our rules include (but are not limited to)**:\n\n* No politics.\n* Advising anyone in this subreddit to commit suicide or referring anyone to groups that advocate this will result in           an immediate ban.\n* Be nice. No personal attacks, name calling, or bullying. [No slurs](https://www.reddit.com/r/raisedbynarcissists/wiki/slurs) or victim-blaming.\n* Do not derail the posts of others.\n* Narcissists are NOT allowed to post or comment here.\n* [No platitudes or generic motivational posts](https://www.reddit.com/r/raisedbynarcissists/wiki/rules#wiki_no_platitudes_or_generic_motivational_posts).\n* When you comment/post, assume a context of abuse.\n* No asking or offering gifts, money, etc.\n* No content advocating violence, revenge, murder (even in jest).\n* No content about N-kids.\n* No diagnosis by media/drive-by diagnosis.\n* No linking to Facebook pages.\n* No direct linking to anywhere on reddit.\n* No pure image posts.\n\n\n**For a full list of our rules/more information, [**click here**](https://www.reddit.com/r/raisedbynarcissists/wiki/rules).**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/raisedbynarcissists) if you have any questions or concerns.*",
            "Today I am having a hard time reminding myself that just because my situation was not as extreme as others, no contact is still necessary. Sometimes I am reminded that all of the sudden I don't have a father. I quietly exited his life and he has not done anything to get me back into it. It is also out of safety. I worry as he ages he will become more and more aggressive and violent towards myself and my sister. Its so complicated. I don't want a relationship (we have not spoken for around 4 years now) but it still sometimes hits me how sad all of this is. Until a month ago I wouldn't have even said we're estranged from one another as that feels like you have to have a relationship first to have it end. He has never been a father figure and rarely ever took care of us despite living in the same home. Man. Today just feels very emotionally heavy. I hope everyone else has a successful and happy Friday.",
            "First post here but this subreddit has been eye opening. Decided to go no contact with my father due to some heavy and traumatic behaviour from him. My mother told him. Cue him threatening suicide if it will help “make amends”. This feels like a new low of emotional manipulation and makes me feel so much more confident in my original choice to go NC.",
            "***House is covered in garbage and there are roaches on the walls and ceiling***\n\n My psycho adult guardians: \"This is because our 7 year old is lazy and evil.\"",
            "My sibling called me yesterday to rage about our mom’s latest issues with managing money. They’re clearly still struggling with emotionally detaching themselves from her. Meanwhile, I felt absolutely nothing as they told be about how our mom had sold this or that thing so she could buy more junk. I’m feeling good about my own apathy about the situation, though wishing my sibling could move on from it.",
            "Why are there [two active threads](https://www.reddit.com/r/raisedbynarcissists/comments/1dfdi8p/checkin_post_have_something_to_say_but_dont_want/) right now?\n\nI just came to nDad's. He told me that mum had given him instructions to \"not pass a widower\" when my sister was wedded in 2016. So, every time I go out to a pub, nDad either wants to follow me - and whinge about how much I drink or he stays home and, on my return, he whinges about how I don't bring anyone home for him. \n\nI'm married to a wonderful oncologist and have a daughter with her. How does he think it will look if I tell a random lady -- around my age (because which woman is 80 and drinks in the football pubs in Brussels -- that, \"My father has given me explicit instructions to bring a girl home for him tonight, so, come with me right now\". \n\nEspecially given that I'm happily married and a father? *sigh*",
            "It's funny how they can recognize abuse and people being affected by bad parents in movies but then as soon as you say it about them no that kind of stuff never happens.\n\nWas watching forrest gump with my nbrother, and I said I forget whats happening at this part, and its the part where Jenny is breaking down and he goes \"well shes crying because shes realizing her dad is a bad person and is responsible for everything that is wrong with her which is understandable\" and im just sitting there like.....but every time I say its YOUR fault that I am the way I am (seeking approval from people, always feel like I do everything wrong, yelling at me for accidents) because you grew up treating me that way suddenly it doesnt exist or I just \"need to get over it youre not a fucking kid anymore\". like...........oooooooooooookay!",
            "Lmaooo I’m looking at apartments to buy. My nmom is working today at 1230 so I just didn’t send her my itinerary and went with my dad. I told her that we’d be gone so that’s why we couldn’t drop her at work and she couldn’t come with us. Simple right?\n\nMy dad and I decide to skip the 12-1pm showings so we can come back and take my bitch mother to work & they weren’t really of interest. So I sent her a text at 11 saying we will come back & take you. \n\nWe get home to my nmom being in her bathroom getting ready. A whole 20 minutes later she comes out and is mute. She wasn’t speaking to my dad over a separate issue so I thought that’s what is was. She finally \n asked me how it went I said good there were 3 that I liked. \nShe then got in this huge aggressive mode and said how why we didn’t invite her to come and I obviously didn’t want her to join. I explained that was why we came back otherwise I’d still be looking and then she says well you never told me and was SOOOOO aggressive yelling about the same issue of not being invited & so I retaliated back for one of the first times in my life by saying that’s why I texted you. \n\nThen she came out like storming at me & continued to try rage in the car by saying you never told me ra ra ra and I was like well yeah obviously because we changed the plans to come pick you up and that’s why I sent you THE FUCKING TEXT 🤣. \nNow I’m sitting in the back of the car while my stupid submissive dad drives her in silence. ",
            "My parents showed up on my birthday after I told them not to come. I didn't see them but they left presents for me. The presents are sitting in a corner of the basement. On one hand I know that there are things in there that I need. But on the other hand, I can't bring myself to open them.",
            "I'll delete this later but rn I have to vent. As an adult I met an uncle and was sure I've never seen him before but his voice (it's deep) sounded familiar and I didn't know why. It took some more years to kinda remember some stuff, it was so sudden so I wasn't sure it happened. I'm not too close to my brother but I told him and he believes me and I'm thankful for that."
        ]
    },
    "I’m heated because my coworker told me there was no such thing as a narcissist": {
        "title": "I’m heated because my coworker told me there was no such thing as a narcissist",
        "score": 204,
        "url": "https://www.reddit.com/r/raisedbynarcissists/comments/1dqyxyt/im_heated_because_my_coworker_told_me_there_was/",
        "content": "One of my coworkers and I were talking about my childhood (we’re close) and another budged in and said “there is no such thing as a narcissist. That term is too overused and bullshit, it’s not a creative way to insult someone. I don’t trust anyone that uses the term narcissist.” Like wow yeah just throw my ass into a meat-grinder. I’m trying to hold my tongue because it’s an argument that will go nowhere but I’m just so pissed off.",
        "num_comments": 75,
        "comments": [
            "**This is an automated message posted to ALL posts in this subreddit with some basic information about the group including (very importantly)  rules.  Why are you getting this message?  Most people seem to not read the sidebar for information or the rules, so it is now being posted under all posts.**  \n\n**Confused about acronyms or terminology?** [Click here!](https://www.reddit.com/r/raisedbynarcissists/wiki/acronyms)\n\n**Need info or resources?**  Check out our [Helpful Links](https://www.reddit.com/r/raisedbynarcissists/wiki/helpfullinks) for information on how to deal with identity theft, how to get independent of your n-parents, how to apply for FAFSA, how to identify n-parents and SO MUCH MORE!\n\nThis is a reminder to all participants, RBN is a support group that is moderated very strictly.  Please report inappropriate content so it can be reviewed by the mods.\n\n**Our rules include (but are not limited to)**:\n\n* No politics.\n* Advising anyone in this subreddit to commit suicide or referring anyone to groups that advocate this will result in           an immediate ban.\n* Be nice. No personal attacks, name calling, or bullying. [No slurs](https://www.reddit.com/r/raisedbynarcissists/wiki/slurs) or victim-blaming.\n* Do not derail the posts of others.\n* Narcissists are NOT allowed to post or comment here.\n* [No platitudes or generic motivational posts](https://www.reddit.com/r/raisedbynarcissists/wiki/rules#wiki_no_platitudes_or_generic_motivational_posts).\n* When you comment/post, assume a context of abuse.\n* No asking or offering gifts, money, etc.\n* No content advocating violence, revenge, murder (even in jest).\n* No content about N-kids.\n* No diagnosis by media/drive-by diagnosis.\n* No linking to Facebook pages.\n* No direct linking to anywhere on reddit.\n* No pure image posts.\n\n\n**For a full list of our rules/more information, [**click here**](https://www.reddit.com/r/raisedbynarcissists/wiki/rules).**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/raisedbynarcissists) if you have any questions or concerns.*",
            "I beg everyone in this sub: never talk to narc unaware people about narc issues or you will be frustrated and gaslit.",
            "Sounds like something a covert narc would say lol. Fuck that",
            "Name the actual behaviors and not the DSM manual diagnosis and avoid specific terminology. Are they deflecting? Yes, but they’re “changing the subject.”",
            "I mean he/she is simply just ignorant. It's like saying their aren't schizophrenics ..it's just an objective falsehood",
            "Considering the first person to call my mother a psychopathic narcissist was a therapist, I call bullshit.",
            "Buttnin bro got triggered. Probably because he's a narcissist.",
            "Maybe she’s never been around a narcissist; in that case, lucky her.  However, I suspect that she’s been called a narcissist by one or more people and didn’t like it, and/or she is actually a narcissist.  \n\nSince she had to but into someone else’s conversation to say her piece, I suspect she is a narcissist or has several narcissistic traits.",
            "Most people who deny narcissist ARE narcissist.",
            "The term is over used. It’s become a reflexive response from people which doesn’t add to its credibility, and that doesn’t count as a diagnosis. However, there are people who fit these criteria."
        ]
    },
    "How many of us are autistic? I’ll start the count.": {
        "title": "How many of us are autistic? I’ll start the count.",
        "score": 423,
        "url": "https://www.reddit.com/r/raisedbynarcissists/comments/1dqt9yc/how_many_of_us_are_autistic_ill_start_the_count/",
        "content": "🙋🏽‍♀️\n\n\n\n\n\nWith our strong sense of justice and all, I feel that we linger in the scapegoat community. We’re (usually) the hyper sensitive/empathetic truth tellers aka a narcissist’s worst nightmare.",
        "num_comments": 230,
        "comments": [
            "**This is an automated message posted to ALL posts in this subreddit with some basic information about the group including (very importantly)  rules.  Why are you getting this message?  Most people seem to not read the sidebar for information or the rules, so it is now being posted under all posts.**  \n\n**Confused about acronyms or terminology?** [Click here!](https://www.reddit.com/r/raisedbynarcissists/wiki/acronyms)\n\n**Need info or resources?**  Check out our [Helpful Links](https://www.reddit.com/r/raisedbynarcissists/wiki/helpfullinks) for information on how to deal with identity theft, how to get independent of your n-parents, how to apply for FAFSA, how to identify n-parents and SO MUCH MORE!\n\nThis is a reminder to all participants, RBN is a support group that is moderated very strictly.  Please report inappropriate content so it can be reviewed by the mods.\n\n**Our rules include (but are not limited to)**:\n\n* No politics.\n* Advising anyone in this subreddit to commit suicide or referring anyone to groups that advocate this will result in           an immediate ban.\n* Be nice. No personal attacks, name calling, or bullying. [No slurs](https://www.reddit.com/r/raisedbynarcissists/wiki/slurs) or victim-blaming.\n* Do not derail the posts of others.\n* Narcissists are NOT allowed to post or comment here.\n* [No platitudes or generic motivational posts](https://www.reddit.com/r/raisedbynarcissists/wiki/rules#wiki_no_platitudes_or_generic_motivational_posts).\n* When you comment/post, assume a context of abuse.\n* No asking or offering gifts, money, etc.\n* No content advocating violence, revenge, murder (even in jest).\n* No content about N-kids.\n* No diagnosis by media/drive-by diagnosis.\n* No linking to Facebook pages.\n* No direct linking to anywhere on reddit.\n* No pure image posts.\n\n\n**For a full list of our rules/more information, [**click here**](https://www.reddit.com/r/raisedbynarcissists/wiki/rules).**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/raisedbynarcissists) if you have any questions or concerns.*",
            "Me. Narcissists HATE me. I am the bane of their miserable existence. Their fuckery does not work on me and social conventions and peer pressure don’t either. I make them implode at an alarming rate. It’s kind of an awesome super power to have",
            "Here ! The number of time I failed my grey rocking because I wanted to tell the truth/strong sense of justice. Clearly the scapegoat in the family.",
            "Autism positively affecting my resistance to being influenced or caving to manipulation and abuse tactics is the reason I became the scapegoat in my family. They hate it that I'm not an easy person to control, bully, and bend, and that I didn't unconditionally worship my N-mom growing up.",
            "I am.  Definitely in the scapegoat community.  \n\nBeing a truth teller in my family has meant I no longer have any family.  Which is usually okay, because I intellectually know that I'm not missing out anything meaningful - but lately, it's been so deeply and painfully lonely.  I didn't expect healing to make me feel lonelier than ever at times.",
            "We don’t know if I’m autistic or just damaged by child abuse. ",
            "Checking in. Alexithymia is bad. Having caregivers who don’t help you understand your feelings and emotions, banish/punish emotions, and gaslight you wrecks your ability to deal with your emotions effectively for the rest of your life.",
            "Count me in - compulsive truth teller and scapegoat of the family.\n\nAnd yes, narcissistic people do not feel safe around me, as I do not play along.",
            "To be honest... I wouldn't be surprised that I'm on the spectrum. The only people I can understand, or can be friends with end up being on the spectrum. I have a big sense of justice. I don't think I fit in anywhere. I don't get this whole socialization thing. I miss social clues apparently. I know a lot of weird ass facts.",
            "Me. Being autistic and being raised by narcissistic parents is a gnarly combination."
        ]
    },
    "My parents have decided to throw a huge party for my Dad's 60th... on my 30th birthday.": {
        "title": "My parents have decided to throw a huge party for my Dad's 60th... on my 30th birthday.",
        "score": 81,
        "url": "https://www.reddit.com/r/raisedbynarcissists/comments/1dr3kmv/my_parents_have_decided_to_throw_a_huge_party_for/",
        "content": "I just need to get this off my chest because I'm in a bit of disbelief. My dad turns 60 at the start of December, but my parents have decided that they want to have his party when the weather is nicer (like he's the fucking King or something), and out of literally every date they could possibly pick before or after they landed on my 30th birthday, 2 months after. Not the same week, not the same weekend, the day of.\n\nSome important points to note: they specified this will NOT be a shared party, it is my fathers party only. We live a 4.5 hour flight + 1.5 from the airport drive away, and I would be expected to travel down with my the 3.5yo and 10mo + pay for our flights - most likely solo as my husband travels for work. This was pitched to me as \"around my birthday weekend\" even though they OBVIOUSLY would've looked at the dates and seen the party fell exactly on my birthday. \n\nWhat the fuck kind of position does this put me in? Swallow my own feelings and show up, be the family pariah and not show up, make a fuss and make them change the date (which you all know would make them go nuclear).\n\nI don't know what's more hurtful:\n\n1. They didn't even realise\n2. They realised and they don't care\n3. They've done it on purpose\n\nJust a little extra icing on the cake is I've recently found out my cancer has recurred, and we're waiting on treatment decisions before sharing. They were INSUFFERABLE last time, making it all about how hard it was for them so can't wait to go through cancer and that again.\n\nRant over 😔 why can't we just have normal, supportive families who don't do this to us?!",
        "num_comments": 31,
        "comments": [
            "**This is an automated message posted to ALL posts in this subreddit with some basic information about the group including (very importantly)  rules.  Why are you getting this message?  Most people seem to not read the sidebar for information or the rules, so it is now being posted under all posts.**  \n\n**Confused about acronyms or terminology?** [Click here!](https://www.reddit.com/r/raisedbynarcissists/wiki/acronyms)\n\n**Need info or resources?**  Check out our [Helpful Links](https://www.reddit.com/r/raisedbynarcissists/wiki/helpfullinks) for information on how to deal with identity theft, how to get independent of your n-parents, how to apply for FAFSA, how to identify n-parents and SO MUCH MORE!\n\nThis is a reminder to all participants, RBN is a support group that is moderated very strictly.  Please report inappropriate content so it can be reviewed by the mods.\n\n**Our rules include (but are not limited to)**:\n\n* No politics.\n* Advising anyone in this subreddit to commit suicide or referring anyone to groups that advocate this will result in           an immediate ban.\n* Be nice. No personal attacks, name calling, or bullying. [No slurs](https://www.reddit.com/r/raisedbynarcissists/wiki/slurs) or victim-blaming.\n* Do not derail the posts of others.\n* Narcissists are NOT allowed to post or comment here.\n* [No platitudes or generic motivational posts](https://www.reddit.com/r/raisedbynarcissists/wiki/rules#wiki_no_platitudes_or_generic_motivational_posts).\n* When you comment/post, assume a context of abuse.\n* No asking or offering gifts, money, etc.\n* No content advocating violence, revenge, murder (even in jest).\n* No content about N-kids.\n* No diagnosis by media/drive-by diagnosis.\n* No linking to Facebook pages.\n* No direct linking to anywhere on reddit.\n* No pure image posts.\n\n\n**For a full list of our rules/more information, [**click here**](https://www.reddit.com/r/raisedbynarcissists/wiki/rules).**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/raisedbynarcissists) if you have any questions or concerns.*",
            "Just don't go.  Simple as that, and if they trow a tantrum after, you can say: *Oh, I spent my birthday with some friends!*.  Period.",
            "They’ve done it on purpose, of course. It’s a little way of saying his milestone is more important than yours. \n\nAs a parent, I can say that my kid having a milestone is so much more important to me than anything of mine. That’s how it’s supposed to be. They’re going 180 degrees in the other direction.  \n\nSimply tell them you won’t be attending, because you’ve got important milestone plans of your own.",
            "Its number 3, just don't go.  Seems like a good time to go NC and be done with them.  Im sorry to hear about the cancer..",
            "Tell them you have made arrangements to attend. Make no mention of his party coinciding with your birthday. Then, the day before you were set to arrive, call them and tell them something came up and you won’t be there after all. Bonus points if you can leave a message vs. talking directly to them. Send an inexpensive token gift through the mail (cheapest/slowest method possible). Then, conveniently forget future birthdays for both of them.",
            "One of my inlaws, who had never visited before, decided to visit us on my milestone birthday.  At the time I was a doormat and thought it would be nice for dh, the ignored and forgotten one, to be visited and get some attention.  So I agreed and was 'fine'. Said relative didn't like me and ignored my existence most of the time. Relative and their partner arrived and we took them out for the day and it was pleasant. Their partner asked me what my plans for my birthday were and I said 'this', they looked horrified that it was the actual day of my birthday (inlaw hadn't wished me a happy birthday nor brought a card or gift) and fell over themselves to apologize stating they hadn't realised. Inlaw shrugged and said, 'oh I knew'. Having my own family also pretty awful, when I mentioned things like this to them and getting shrugs,  and my parents being the reason I was such a doormat to begin with, was crazy making. Thankfully, once we had kids, I developed a great spine and painfully grew out of being a doormat.\n\nOp it is absolutely deliberate. When they realised it was something they could do, they felt a thrill. They believe they've forced you into a corner. Don't go.",
            "As someone who has been through this sort of family thing, I'm so sorry. But with the diagnosis you received as a \"cherry\" on top, you deserve your day to be home, free from drama. \n\nAfter a few of these delightful family serials, I always had a \"last minute conflict, sorry.\" I'm not sure I would bother if I were you. I'd call it step one in going low contact. \n\nHoping your health recovers!",
            "\"sorry, I am celebrating my birthday and can't come\"",
            "oh no this is so them. I'm so sorry about your diagnosis! this reminds of that \"they have to be the corpse and every wedding and the bride at every funeral\" and then there was some poor soul who's father threatened suicide on Christmas Eve when she was 9 months pregnant....  My go-to is \"I'm not feeling well\" {from their constant shrieking} + \"I don't want to get anyone sick\"  two true statements!",
            "my nmother did this to me EXACTLY. I went NC and she found a way she can harrass me is by messaging a group chat that I was still in.\n\nSo she sent a message inviting everyone to a group chat to a party, on my birthday for the \"King's Birthday\" as it coincides with my birthday. She doesn't give a fuck about the King and Queen, we aren't even British. \n\nhttps://i.imgur.com/Iy16SZq.png\n\nI don't bite and haven't responded to them in any way whatsoever in 6 months but it still hurt on the day. So I feel you OP. It especially upset me that no one in the group stood up for me and they attended the party she hosted. I removed my birthday on facebook so I don't expect anyone to know it was my birthday, but my mother knew. No doubt about it."
        ]
    }
}