{
    "Bei Fragen zu Verschwörungstheorien: r/VTbetroffene": {
        "title": "Bei Fragen zu Verschwörungstheorien: r/VTbetroffene",
        "score": 15,
        "url": "https://www.reddit.com/r/Ratschlag/comments/1dge11z/bei_fragen_zu_verschwörungstheorien_rvtbetroffene/",
        "content": "Liebe Mitglieder von r/Ratschlag,\r  \n\r  \nwir, die Moderatoren von r/VTbetroffene, möchten euch darauf hinweisen, dass unser Subreddit speziell für diejenigen gedacht ist, die Unterstützung im Umgang mit Personen suchen, die an Verschwörungstheorien glauben. Dort findet ihr eine engagierte Community, die sich auf genau dieses Thema spezialisiert hat und euch gezielte Ratschläge und Unterstützung bieten kann.\r  \n\r  \nSolltet ihr also Fragen oder Sorgen haben, wie ihr mit Familienmitgliedern, Freunden oder Kollegen umgehen könnt, die an Verschwörungstheorien glauben, laden wir euch herzlich ein, eure Beiträge direkt in r/VTbetroffene zu posten. Dort seid ihr bestens aufgehoben und trefft auf Menschen, die ähnliche Erfahrungen gemacht haben und euch besser helfen können.\n\n\r  \nUnser Sub verfügt auch über ein kleines [Wiki](https://www.reddit.com/r/VTbetroffene/wiki/index/), das viele häufig gestellte Fragen bereits im Voraus beantwortet. Dort findet ihr unter anderem wertvolle Buchempfehlungen zum Thema sowie eine Liste von Beratungsstellen im gesamten DACH-Raum, sortiert nach Region.\n\n\r  \nVielen Dank fürs Lesen und weitersagen.\r  \n\r  \nHerzliche Grüße,\r  \nDie Moderatoren von r/VTbetroffene\n\n&#x200B;\n\nHinweis: Dieser Post wurde in Abstimmung mit den Moderatoren von r/Ratschlag erstellt, um sicherzustellen, dass ihr schneller die passende Unterstützung findet.",
        "num_comments": 0,
        "comments": []
    },
    "Wie soll ich mit dem nicht so geheimen Sparkonto meiner besten Freundin umgehen?": {
        "title": "Wie soll ich mit dem nicht so geheimen Sparkonto meiner besten Freundin umgehen?",
        "score": 62,
        "url": "https://www.reddit.com/r/Ratschlag/comments/1dr6vmg/wie_soll_ich_mit_dem_nicht_so_geheimen_sparkonto/",
        "content": "Hallo, dass ist das erste mal das ich hier nach Rat frage, ich weiß leider echt nicht wie ich mit der Situation umgehen soll.\n\nVor ca. 3 Jahren habe ich (W25) meine beste Freundin (W23) bei mir aufgenommen nachdem ihre Eltern sie nach einen großen Streit auf die Straße gesetzt haben. Zu diesem Zeitpunkt hatte sie erst vor kurzen ihre Ausbildung angefangen. Sie wäre theoretisch obdachlos gewesen und ihr Fester Freund konnte sie nicht aufnehmen,  da dieser in einer anderen Stadt wohnt. Von daher habe ich sie aufgenommen und in meiner 2 Raum Wohnung Platz für Sie gemacht.\n\nSie meinte damals zu mir das sie es sich finanziell nicht leisten könnte sich selbstständig eine Wohnung zu suchen (auch wenn wir in einer kleinstadt Wohnen und die Mietpreise hier definitiv tragbar sind). Am Anfang habe ich sie kostenlos bei mir wohnen lassen aber nach einigen Monaten bat ich sie darum die Hälfte der Miete zu zahlen, da sie jetzt offiziell bei mir wohnhaft war. Ich musste mir immer wieder von ihr anhören, dass sie kaum Geld hatte und vieles von ihren Azubigehaltes für die Miete raus geht. Da ich fest Arbeitstätig war fing ich an viele Kosten zu tragen wie z.b,\nLebensmittel, Tankfüllung, Haushaltswaren wie Reinigungsmittel, Duschgel, Zahnpasta etc. \nSie kaufte in der Regel eher weniger ein und fragte mich nach den einkaufen öfters ob wir die Rechnung 50/50 teilen können. Ich war sehr sauer darüber und fing an mich öfters mit \nihr zu streiten.\n\nKommen wir jetzt zur Gegenwart.\nVor 1 Jahr hat sie ihre Ausbildung beendet und arbeitet jetzt Festangestellt, mittlerweile übernimmt sie mehr Kosten im Haushalt aber der Großteil liegt noch bei mir. \nVor kurzem hatten wir ein großes Treffen im Freundeskreis wofür auch ihr Freund angereist kam.\nAuf diesen Treffen verkündeten die beiden glücklich vor allen das sie zusammen ziehen wollen, dass an sich war für mich kein problem da wir uns durch die ständigen steits über Haushalt etc. eh etwas auseinander entwickelt haben und ich mir sicher war das uns Abstand gut täte.\nIn den moment wunderte ich mich nur wie sie einen kompletten neu Einzug finanzieren wollte?\nImmerhin sagte sie immer zu mir sie hätte nicht so viel Geld weshalb sie sich einige Sachen nicht leisten kann. \n\nGott sei dank sprach ein Freund von uns genau dies an.\nGanz stolz fing sie an zu verkünden, dass sie die letzten Jahre super viel gespart hatte und jetzt schon eine gute Menge Geld auf ihren Sparkonto hat. (Ich wusste das sie ein Sparkonto hatte aber nicht um welchen Betrag es sich dabei handelte).\nSie erzählte noch das sie ja nur so viel Geld sparen konnte, weil sie ihre privat Einkäufe auf ein minimum reduziert hatte. (Was schon stimmte sie kaufte sich fast nie privat sachen)\n\nAls ich das von ihr hörte fühlte ich mich absolut verarscht. Ich war super sauer auf sie, weil sie ihr Geld sparen konnte während ich jeden Monat mein Gehalt für Lebensmittel etc. ausgegeben habe. \nIch versuchte mir meine Wut nicht anmerken zu lassen um nicht die Stimmung zu ruinieren.\nIm laufe des Abends bedankte sie sich auch mehrmals, vor unseren Freunden, bei mir. Aber irgendwie sorgte das nur dazu das ich noch wütender wurde.\nJetzt sind ein paar Tage vergangen und ich frage mich wie ich nun mit der ganzen Situation umgehen soll.\n\nReagiere ich eventuell über und sollte mich einfach für sie freuen?\nOder sollte ich sie darauf ansprechen und irgendwie riskieren das unsere Freundschaft daran kaputt geht.\nIch kenne sie schon seit 13 Jahren und möchte nicht das unsere Freundschaft kaputt geht.\nWas soll ich tun? Wie soll ich mit der ganzen Situation umgehen?",
        "num_comments": 77,
        "comments": [
            "Ich schreibe es dir direkt : Eure Freundschaft ist schon kaputt. Sie nutzt dich aus und belügt dich. Und lebt seit 3 Jahren bei dir im gemachten Nest.\n\nIhr jetzt ihr Rumgelüge um die Ohren zu hauen fände ich an der Stelle nur angemessen. Du musst sie ja nicht verbal attackieren, aber ihr schon klar mitteilen dass ihr Sparkonto nur so schön gefüllt ist, weil du sie finanziell ausgehalten hast. Was du jetzt daraus machen willst, kannst nur du entscheiden. Für mich wäre spätestens das Maß jetzt voll und ich würde sie mit Frist vor die Türe setzen - ausziehen will sie ja sowieso und du musst sie nicht noch ein paar Monate extra aushalten. Der Kontakt wäre an der Stelle für mich gestorben, mich wundert es eh dass du nach den 3 Jahren mit ihr noch irgendwas zu tun haben willst",
            "Herzlichen Glückwunsch, du hast wahrscheinlich herausgefunden, weshalb die Eltern deine \"Freundin\" damals rausgeschmissen haben. Kann man nichts machen, abhaken, weitermachen, Person ins persönliche Nichts verbannen.",
            "Schließe mich hier an: die Freundschaft wäre für mich beendet.",
            "Erstmal: bitte verwende Absätze, dann geben sich auch mehr Leute Mühe es zu lesen. \n\nZum Beitrag: Nimm es als Lehrgeld und gut ist. Ein Freund spart sich kein Vermögen zusammen während er dem anderen auf der Tasche liegt.",
            "Niemand denkt von sich selbst. dass er/sie der/die Böse ist. Sie glaubt, was sie sagt. Sie in Deine Realität zu holen endet in Streit. Du hast jetzt schon ein finanzielles und emotionales Minusgeschäft gemacht. Steck einfach nicht noch mehr rein- vor allem nicht emotional. Lass es und sie gehen ubd lern aus der erfahrung. Bis sie weg ist, kann sie ihren Anteil selber bezahlen und Du kannst Dich über die Unmenhen an extra Geld freuen, die Du dann auf einmal hast. Du hast ihr geholfen, als Sie es brauchte, das ist eine Gute Sache. Vielleicht kann Sie es eines Tages weitergeben. Fühl Dich gut und geh Deinen Weg mit ups and downs und all den Menschen, die kürzer oder länger Teil Deiner Reise sind.\nalles liebe",
            "Was für eine Freundschaft kann denn da kaputt gehen? Ich hätte wohl schon direkt vor Ort was gesagt. \n\nIch weiß ja nicht, ob sie bei dir Miete zahlt oder überhaupt irgendwas schriftlich hat. Aber ich würde wohl sehr klare Worte für meine Gefühle finden.",
            "Warum hast du sie nicht direkt vor allen darauf angesprochen? Wenn du an dem Abend die Situation verpasst hast, solltest du es unbedingt nachholen. \n\nSie hat sich auf deine Kosten gesund gespart. Das hat nichts mit Freundschaft oder Fairness zu tun. Hier irgendwas retten zu wollen ist müßig.",
            "Es ist schon lange keine Freundschaft mehr, weil diese Person dich jahrelang angelogen und ausgenutzt hat. Sie hätte es auf jeden Fall verdient, in eurem gesamten Freundeskreis exposed zu werden, damit alle sehen, was für ein Mensch sie ist.",
            "Für mich wäre das Thema durch, mit so einer Person würde ich nichts zu tun haben wollen.\n\nWie es sich rausliest, gibt es für sie keinen offiziellen Mietvertrag. Würde ihr ne Frist von ner Woche geben, in der sie aus deiner Wohnung zu verschwinden hat. Hat ja scheinbar genug Kohle um irgendwo unterzukommen, nachdem sie dich jahrelang schamlos ausgenommen hat.",
            "Da gibt es kein bisschen Freundschaft mehr. Kann gut sein, dass sie anfangs wirklich sehr in Not war. Aber ab einem bestimmten Punkt hat sie sich ganz bewusst dazu entschieden deine Gutmütigkeit auszunutzen, um selbst nicht viel Geld ausgeben zu müssen und sogar Geld sparen zu können. Das ist ganz analog zu bei den Eltern wohnen, man selbst gibt eigenltich nur Geld für private Luxusgüter aus, aber nicht für den Haushalt.   \nMeiner Meinung nach wäre das Richtige sie sofort, unverzüglich vor die Tür zu setzen. Durch die Menge an Geld die sie gespart hat, sollte sie keine Schwierigkeiten haben eine Pension zu beziehen, bis sie was neues gefunden hat. Aber ihr verhalten fordert klar eine harte Kannte."
        ]
    },
    "Trauriges Leben nach Augen OP": {
        "title": "Trauriges Leben nach Augen OP",
        "score": 235,
        "url": "https://www.reddit.com/r/Ratschlag/comments/1dqvvgq/trauriges_leben_nach_augen_op/",
        "content": "Ich habe Dezember 2022 eine Femto Lasik OP druchführen lassen. Während der OP hörte ich vom Arzt schon ein \"Oops\" und danach \"Es gab zwar Komplikationen, aber geht jetzt alles\".. Tja, hört man nicht gern, aber ich habe das erstmal als nichts weiter Wichtiges abgetan. Zugegebenermaßen ist der Titel bisschen übertrieben. Ich bin nicht blind geendet, ich kann normal sehen. Außer! - und das ist der springende Punkt - wenn ich etwas lesen will. Und das ist was meine Lebensqualität stark beeinträchtigt.\n\n Alles was ich lese, ob Untertitel auf Netflix, Texte im Browser, auf WhatsApp oder auch in einem Buch, ist doppelt. Die Buchstaben verwischen quasi in alle Richtungen und das sehr wahllos. Liegt wohl an Ghosting, bzw. Retraktionsstörungen, dh. Licht wird an der Hornhaut vom Auge nicht richtig gebogen. Laut dem Arzt ist nichts zu machen; der Effekt hält normalerweise auch nur bis zu drei Monate an, aber bei einer kleinen Anzahl von Patienten auch dauerhaft. Und ich dachte damals \"das kann ja nicht mich treffen, dafür ist es zu unwahrscheinlich\". Es ist so wie es ist.\n\nProblem ist, dass mein Leben so sehr es nur geht vom Lesen bestimmt wird. Lesen war mein größtes Hobby, es begleitet mich in meiner übermäßigen Handynutzung, mein Wissensdurst wird nur dadurch gestillt, mein Beruf erfordert eine Menge konzentriertes Lesen von Code auf Computerbildschirmen. \n\nEigentlich bestand mein Leben zu gefühlt 99% aus dauerhaftem Lesen. Und jetzt sind das alles nur noch Anstrengung oder Kopfschmerzen. Allein diesen Text am Handy zu tippen ist keine Freude mehr. Was mache ich also stattdessen? Keine Bildschirmzeit mehr? Wie gehe ich damit um, dass ich eine großen Teil von mir und meinen Interessen aufgeben soll? Was bleibt mir noch übrig außer Hobbys ohne Detailsicht zu finden?\n\nIch bin einfach nur traurig und musste irgendwo ranten, keine Ahnung was für Antworten ich denn erhoffe. Danke fürs Lesen bis hierhin (haha ;o).",
        "num_comments": 114,
        "comments": [
            "Geh definitiv nochmal zu einem anderen Arzt, sollte man generell immer bei wichtigen Sachen. Ansonsten würde ich mich an den VDK Sozialverband wenden. Die machen auch Rechtsberatung",
            "Posts wie dieser hier sorgen dafür dass ich trotz -10 auf beiden Augen echt Angst vor ner OP habe...",
            "War es denn ein ärztlicher Fehler? Da würde ich mich erst einmal beraten lassen. Vor ein paar Jahren hörte ich, dass sich die Rechtsprechung in Deutschland langsam etwas zu ändern anfängt, was ärztlichen Kunstfehler betrifft. Wenn du deinen Beruf dadurch nicht mehr ausüben kannst, muss jetzt ja auch was passieren. Mit einer Erwerbsminderungsrente ist nicht viel zu stemmen und du müsstest dich ja auch total umstellen, wenn es keine volle Erwerbsminderung ist. Also, wenn es dann ein ärztlicher Versicherungsschaden bist, bist du bei allem Übel trotzdem besser gestellt. Das solltest du ausprobieren und hartnäckig bleiben. Andere Ärzte anfragen sowieso.   \n   \nIch selbst habe auch Probleme mit den Augen und sie müssten operiert werden. Und zu allen Befürchtungen kommt noch, dass ich dazu ein paar Tage im KH bleiben müsste, die aber nicht in der Lage sind, mich zu versorgen, weil ich ein ziemlich extremer Fall von Lebensmittelallergiker bin. Also habe ich mich auch bei allen Sachen sehr stark umgestellt, weil ich zwar noch sehen, aber nicht mehr lesen kann und schwache Kontraste kaum wahrnehme, weil alles verschwimmt etc. Hörbücher statt richtiger Bücher, ein bisschen mit den Billigbrillen aus der Drogerie experimentieren, viel Licht bzw. bei Sonne sofort Sonnenbrille und solche Späße halt. Die Umstellung wird dauern.",
            "Ist das bei allen Farbkombinationen so? Ich sehe auch alles doppelt - schon Uniklinik und mehrere Ärzte durch, ist nichts zu machen operativ, kann man nur minimal ausgleichen durch Brille/Kontaktlinsen. Aber meine doppelte Sicht ist a) relativ schwach und b) nur bei bestimmten Kontrasten richtig wahrnehmbar.\n\nSchwarze Schrift auf weißen Grund kann ich fast perfekt sehen, umgekehrt weiß auf Dunkel ist sehr unangenehm.",
            "Hast du für Nachrichten mal die Diktierfunktion versucht? Am Rechner kannst du dir glaube ich emails oder Texte vorlesen lassen. Vielleicht sind das erst einmal Erleichterungen. Oder Apps wie Audibel etc.",
            "Lass dich Rechtlich beraten. Ich wünsche dir das in drei Monaten das doch vergeht. Ich hab selbst zum Beispiel viele störende Glaskörpertrübungen, kann man aber nicht vergleichen.",
            "Prismenbrille hilft nicht? Ich hab 3 Prismen und die helfen mir extrem gegen leichte Doppelbilder  (hatte schon immer leichtes Schielen) und damit gegen Kopfschmerzen und Überanstrengung. Oder geht das nicht, weil die Linse selbst die Strahlung verteilt? Aber deine Erfahrung ist ein Grund warum ich meine Augen nicht operieren lasse, wenn es anders geht. 1:10000 Komplikationsrate finde ich nicht so beruhigend bei sowas.",
            "Zumindest digital sollteste doch da am Monitor gegenwirken können? \nProbier mal sehbeeinträchtigen Apps aus. Da kannste vlt gegenwirken?",
            "Wende dich auch mal an einen Orthoptisten/ Orthoptistin. Die sind manchmal noch fitter als AugenärztInnen selbst.",
            "Vielleicht eine dumme Frage: sind beide Augen betroffen? Kannst Du eventuell einäugig (besser) lesen?\n\nAls jemand die ebenfalls den ganzen Tag liest ist das was Du schreibst Horror pur :("
        ]
    },
    "Versucht jemand bei mir einzubrechen ?": {
        "title": "Versucht jemand bei mir einzubrechen ?",
        "score": 110,
        "url": "https://www.reddit.com/r/Ratschlag/comments/1dr0ads/versucht_jemand_bei_mir_einzubrechen/",
        "content": "Hallo, \n\nseit gestern kommt eine Person zu der Haustür und geht direkt wieder.\n\nGestern: hörte meine Freundin gegen 4:00 nachts eine Person die zu der Haustür ging (unser Schlafzimmer zeigt in Richtung Haustür) danach hörte sie nur wie jemand gesagt hat „leise,leise“ und die sind dann wieder gegangen. Sie hat nur eine Person in gelber Warnweste gesehen.\n\nHeute: gegen 3:48 hörte ich Schritte und hab aus dem Fenster heimlich rausgeschaut, wieder eine Person in Warnweste, dieser ging zu drei Wohnhäusern und ich hörte ein Geräusch wie von einem Lieferanten der mit seinen gerät Lieferungen bestätigt. \n\nAber welcher Lieferant liefert um 4:00 morgens. Bin ich einfach nur paranoid ? Weiß jemand was zu tun ist ? Oder was das sein kann?",
        "num_comments": 78,
        "comments": [
            "Um diese Uhrzeit werden die Prospekte und Wochenzeitungen an den Straßenecken abgestellt.   \n\"PIEP\" und weiter.",
            "Naja ne warnweste ist jetzt nicht unbedingt das Kleidungsstück, welches ich als Einbrecher tragen würde...",
            "4:00 Licht in der bude an machen, Haustür auf und dann: Moin Moin! Können wir helfen? 🌝",
            "Fenster auf und \" guten Morgen. Jetzt habe ich aber einen Schreck gekriegt, ich habe sie ja fast für Einbrecher gehalten:))\"",
            "Da hier gestern noch ein Post zu Einbrechern war, die haben kein Interesse an Kontakt, da kann nicht entspannt das Schlafzimmer durchwühlt werden, eingebrochen wird zum großenteil tagsüber oder wenn man im Urlaub ist.",
            "Ich glaube nicht das ein Einbrecher in Warnweste kommt auffälliger geht kaum",
            "Zeitungslieferung. Ein Einbrecher wird wohl keine Warnweste tragen.",
            "Zeitungen kommen um die Uhrzeit. Ansonsten einfach mal Wecker stellen und wenn du hörst, dass die Person wieder da ist unauffällig aus'm Fenster gucken was die macht.",
            "Es gibt, grade im B2B Bereich, auch Nachtanlieferungen. \nHabe ich selber mal gehabt. \nHabe Ersatzteile bestellt und die wurden Nachts, meist gegen 3Uhr in den Kofferraum meines Dienstwagens gelegt. In dem Falle war es die Firma „NightStar“.",
            "Bei uns in der Straße wird die Zeitung um die Uhrzeit verteilt, der Fahrer lässt allerdings dann seinen alten VW Bus laufen bis er zu den Hauseingängen gegangen ist und wieder zurück.\n\nDas ist auch sehr toll wenn man mit offenen Fenstern schläft 😄"
        ]
    },
    "Todesschmerzen und keine Ibu mehr da. Ich brauche Alternativen ": {
        "title": "Todesschmerzen und keine Ibu mehr da. Ich brauche Alternativen ",
        "score": 25,
        "url": "https://www.reddit.com/r/Ratschlag/comments/1dr45xz/todesschmerzen_und_keine_ibu_mehr_da_ich_brauche/",
        "content": "seit ich mit hormoneller Verhütung aufgehört habe, habe ich unbeschreibliche Periodenschmerzen, die ich nicht beschreiben kann. Sowas hatte ich vorher noch nie.\nJedenfalls bemerke ich- ich habe keine Ibu mehr da und die Arztpraxen haben geschlossen bzw kann ich nicht bis zur nächsten offenen Reisen weil es zu lange und weit ist.\n\nHabt ihr Ideen und mögliche starke Alternativen aus der Apotheke? Ich bin echt in Not",
        "num_comments": 154,
        "comments": [
            "Wenn die Schmerzen krampfartig sind, kann Buscopan gut helfen. Maximal 2 Tabletten, 3x am Tag. Das kannst du auch mit ner 400er Ibu kombinieren, oder du nimmst gleich die Plus Variante mit Paracetamol als Schmerzmittel mit drin. Sonst gibt es noch Naproxen (z. B. in Dolormin für Frauen), das ist auch ein NSAR wie Ibu hat aber zusätzlich auch leicht krampflösende Eigenschaften. Das ist alles rezeptfrei in der Apotheke erhältlich.   \n\n(Quelle: Bin selber Apothekerin.)",
            "Not Apotheke mal googlen, normal ist im Umkreis von 10km immer eine offen, da kannst du dir dann 400 Ipus kaufen.",
            "Ibus sind doch bis 400mg frei verkäuflich. Wenn es unbedingt eine verschreibungspflichtige Stärke sein muss kannst du es bei einem OnlineArzt wie Doktor.de probieren.",
            "So lange es noch Apotheken mit ausgebildetem Personal gibt, würde ich mal da nachfragen.",
            "Manche Apotheken haben im Umkreis auch einen Lieferdienst, einfach mal in der nächsten Apotheke anrufen.",
            "Zur Apotheke gehen???\n\nDa gibts doch ibu",
            "Du hast übrigens sehr wahrscheinlich Endometriose. Kläre das bitte mit deine Frauenärztin ab. \nGute Besserung!",
            "Keine Empfehlung für Medis, weil ich sie nicht geben kann.\n\nIst die Ursache deiner Schmerzen bekannt? (Z.B. Endometriose?)",
            "Falls du Magnesium im Haus hast - das sorgt bei mir für leichte Linderung. Was ich dir für die Zukunft sehr empfehlen kann: Bonasanit und Amitamin PMS Redux, hatte auch immer die Todesschmerzen und massig Ibu zu mir nehmen müssen um es einigermaßen zu ertragen, das hat mir enorm geholfen und meinen Ibukonsum massiv reduziert.",
            "Frag mal deine Nachbarn. Eine Apothekerin hat dir ja schon passende Medis genannt, einfach mal bei den Nachbarn anklingeln und danach fragen mit Begründung, dass Apotheken/Praxen geschlossen sind.  Kannst ihnen in ein paar Tagen ein kleines Goody als Dankeschön bringen."
        ]
    }
}