{
    "DUTCH PLEASE LISTEN 😭": {
        "title": "DUTCH PLEASE LISTEN 😭",
        "score": 990,
        "url": "https://i.redd.it/yxcv8riose9d1.png",
        "content": "",
        "num_comments": 133,
        "comments": [
            "Lmao this is great, I hope the guy sees it",
            "This fucking great",
            "This is gold lol",
            "He has become \n\nA MEME.",
            "great reference",
            "Fuck, this is brilliant 😂",
            "What is this reference? Where did I just see this?",
            "Its like a drug...i know i can just forget this happened...but its still so dang funny lol. Keep the memes a rolling folks",
            "u/Bursting_Radius 🤡",
            "It's one of them forever memes now🤣💯🔥"
        ]
    },
    "I’m dreaming of the coyote, Am I cooked?": {
        "title": "I’m dreaming of the coyote, Am I cooked?",
        "score": 91,
        "url": "https://i.redd.it/c6fvz6k3ze9d1.jpeg",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Depends on where you are in the story and what you want out of the ending. \n\nIf you're nearing the end of Chapter 6 and you want a high honor ending, I'd say yeah... You're cooked. \n\nIf not... You're fine.",
            "Nothing a lot of greet spamming won't fix.\n\n\"HEY THERE!\"",
            "There’s always time for redemption partner. It’s in the name after all.",
            "No, just say hi to a bunch of people.  You’ll be fine.",
            "Go and greet the fine people of Saint Denis",
            "Big time",
            "No just wily",
            "Tbh initially I thought irl",
            "I'd say, don't worry about it and just enjoy what you have been doing. There are 4 endings, plenty of reasons to do it different next run, good or bad.",
            "You’re fine, just keep going."
        ]
    },
    "My girlfriend got me a Red Dead poster for my birthday ": {
        "title": "My girlfriend got me a Red Dead poster for my birthday ",
        "score": 185,
        "url": "https://i.redd.it/pt0sxfzlfd9d1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "buy a frame for it. its like a satchel upgrade in real life.",
            "Marry that woman",
            "“Goood Girrrrrrl”",
            "Make her your Abigail. (Marry her)",
            "*wife*",
            "W",
            "Definitely a keeper",
            "You sir are very lucky.",
            " Broooo not pushpins 🤦‍♂️",
            "When I was a kid, I covered my wall with Squirrel Tails that I killed. It’s nice to have stuff hanging on your wall."
        ]
    },
    "Controversial opinion: Horses": {
        "title": "Controversial opinion: Horses",
        "score": 374,
        "url": "https://www.reddit.com/gallery/1dqkqyy",
        "content": "MFT (Silver Dapple Pinto) seems to be a better horse than the white arabian. Sure the arabian have a one plus acceleration but MFT compensates by having one plus speed. Fully bonded they both have same health but MFT have quite a bit more stamina. So going by stats alone MFT wins.\n\nJudging aesthetically... I like the bigger size of MFT but I like the shiny white coat of Arabian so I guess it's gonna be a tie. (tbh MFT coat is growing on me)\n\nEquipment can all be the same so let's not even talk about that. (I use panther saddle btw)\n\nMFT wins.\n\nPS: I am almost about to end chapter 2 (third playthrough) if that matters.",
        "num_comments": 238,
        "comments": [
            "WTF happened to the horse in that first image?\n\nIt's face is all messed up.",
            "This isn't controversial at all, this is the same opinion everyone on this sub has",
            "Stats don't really matter. Slow horses are still fast enough and weak horses are strong enough. Ride what you like",
            "I have the Brindle Thoroughbred. \n\nMakes me fall bad about trading him in for anything else.",
            "I love the fox trotters, I’ve been lucky even in my lowest honor play bounty hunters everywhere my girl never threw me and will recall even under fire. The Arabian has left me for dead and run off to live her best life halfway across the country while I’m bleeding out in the mud",
            "Buell >",
            "Why the fuck couldn’t they have just done the white coat in a bigger horse? Why did they make it pony size? Dutch warm blood but black coat and white coat would be perfect.",
            "Its either Turkoman or MFT for me. Andalusians could be a good horse but its not as quick as these two. If you're looking for pure speed, go Arabian; but a single snake or an ambush; they'll buck you faster than you can react to defend yourself.",
            "Sure. I think white Arabian is not worth it. It's not like Arthur to ride a pure white horse. Best colors are brown or red.",
            "The problem is the methods of attaining your winner. All other horses can be had without tricks or glitches."
        ]
    },
    "John RDR1 cover pose in RDR2 opinion": {
        "title": "John RDR1 cover pose in RDR2 opinion",
        "score": 81,
        "url": "https://i.redd.it/nx8ee7doud9d1.jpeg",
        "content": "\nSo the scene of John Marston recreating his pose on the cover of RDR1 in the epilogue when you raid the Laramie farm was extremely cool and when I first played it, I, like many other people fan girled over it. Years later, ive replayed this game probably over 100 times and there’s a change I really wish they would’ve made. \n\nI wish you killed Micah like this. It would be so cool to have unloaded on Micah and while he is in his dying breathe, he tries insulting John, his family and maybe even Arthur, and John just stands over him with the shotgun, before shooting him like he did with Laramie. Granted, this scene would make no sense if you blew Micah’s head off but maybe they could’ve made it a secret cutscene where if you don’t just unload into Micah’s skull, they will have 1 final exchange as he bleeds out on the floor shot to shit, where John recreates this pose. \n\nI think it would tie into RDR1 a lot more too if they had done this change of killing Micah in this way. And as the final mission it would really spell the beginning of Johns downfall in RDR1, considering killing Micah is what got Ross back on his trail. \n\nDoes anyone else think this would’ve been a really cool change? ",
        "num_comments": 8,
        "comments": [
            "i don’t even know what would be more satisfying lmao. killing Micah like that or just unloading into his face like i usually do. this would be a good change tho",
            "BTW\n\nTL;DR - Imagine killing Micah using the RDR1 cover pose",
            "Eh, I like that its a small moment. Red Dead redemption is not about being a new man, its being about the men John and Arthur have always been, wanted to be. John is quick to protect his family and his livelihood.",
            "Its baddas yo!",
            "For me they already fulfilled the fan service aspect in the final mission with having American Venom play",
            "Badass obviously",
            "Best moment in the campaign",
            "Should have happened when killing Micah, with the button up and vest from the first game cover"
        ]
    }
}