{
    "I found out that I’ll be inheriting my grandparents house in orange county California that they bought in the 70’s for 30K that’s now worth an estimated $1,050,000. I am concerned.": {
        "title": "I found out that I’ll be inheriting my grandparents house in orange county California that they bought in the 70’s for 30K that’s now worth an estimated $1,050,000. I am concerned.",
        "score": 159,
        "url": "https://www.reddit.com/r/RealEstate/comments/1dllob6/i_found_out_that_ill_be_inheriting_my/",
        "content": "So I found out my the executor of my grandparents will that when my grandpa and grandma pass away I will be inheriting their home. My grandpa is currently 90 and my grandma has Alzheimer’s so my grandpa wanted to have us know. I currently live in idaho since I moved to attend college there and would have to return when the time came to inherit the house to deal with the legal  issues that would come from it. Can I get some guidance on what to expect to occur when that happens thank you. ",
        "num_comments": 115,
        "comments": [
            "I’m sorry for the news. They care about you and for many people, a house is the largest and most valuable asset they have. \n\n1. They paid $30k for it, but when the house transfers to you, you gain a tremendous benefit: the “basis” of the house will reset to current market price. If you were to sell immediately, there would be no taxable gain since you’d gain $0. Since the house never re-appraised, the residential property taxes will also remain set at theoretical last appraisal done on the house. Likely the property taxes owed on the house are substantially less than what would be owed if you bought the house new. \n\n2. If you rent the house out, you can sell the house in a “1031 Exchange” and transfer the built-up equity and basis into another house (or multiple properties) of “like kind and value” to keep renting out. Simply put, the money you’d make from the sale of their house could be applied toward 1 or more rental houses elsewhere (even in Idaho or other states) so you could have a nice income stream. Note: 1031 exchanges are only for rental properties, not for a place you live in. You cannot commingle the gains in 1031 into a house you live in without paying capital gains / taxes. \n\nVERY importantly — you need to find out if the instrument that transfers the property WILL NOT be subject to probate. Probate is a court process to determine the deceased assets and liabilities and square them up before executing the last will and testament instructions. The proceeds of probate are TAXED in most places and it can eat a lot of your inheritance up. \n\nSkipping this mess can usually be accomplished by having a TOD (“Transfer On Death”) document witnessed and signed by all parties, usually recorded with the County Recorder’s Office. This lets you skip probate (and costly probate taxes). Check with the County Recorder’s Office where the house is located to inquire about a TOD. \n\nYou can do the same with bank accounts; you can make them POD (“Payable Upon Death”) and do something similar with stocks / bonds / CDs. Brokerage accounts, if they have any, usually have a beneficiary process. Each brokerage will have different forms and a slightly different method to confirm the account owner’s wishes. \n\nAll of this is a tremendous gift. I doubt your grandparents want the tax man to take half because of some simple paperwork. Talk to them about it if it turns out there’s no TOD and see if they are amenable to singing one and getting that in place else the tax burden could be quite substantial. \n\nOf course, consult with qualified professionals to make sure you’re doing all this by the book and the right way. \n \nGood luck and I’m sorry to hear your grandparents are in the years of their twilight. How wonderful that they think so highly of you.",
            "You win life. Either keep it or sell it :)",
            "You’ll be a millionaire",
            "You will inherit it tax free. As if you bought for its current market value. If you sell it right away you will pocket the 98% of cash, sake price less expenses of sale. \n\nHowever, you have a unique opportunity to live in that house and at the same tiny property tax that your grandpa paid. After a stint, you also would have the right to downsize within the state and have your property tax follow you. \n\nThe tax combination above was set up to protect the elderly from being chased out of their houses. The result however was a scheme that is a massive benefit to the upper middle and lower upper classes.\n\nYou have a unique opportunity. You can make California wages, 2-3x those of Idaho, and yet afford to live there with a fraction of the pressure as others. \n\nOr you can pocket a million tax free. \n\nYou sit at an enviable decision node, a choice between two kinds of great. Make the right decision and you can take a long step away from the trials and tribulations of survival in 2024 America.",
            "When the time comes, a big Thank you to your Grandparents.  You will need a tax attorney and the estate attorney.  Prop 19 may come into play and protect your low tax basis BUT you will need to live in the home.  There are many if's and but's that may exclude you from this.  Get a copy of the will or trust and have it in your possession if you can.  The Trustee will be the one driving the closing and disposition of the assets.",
            "You are concerned? These days most people will never have enough assets to gain freedom",
            "You can sell the house. ",
            "Unless you plan on living in California, I would recommend selling it when it becomes yours. I see someone else suggested renting it, but California is very tenant-friendly and landlord-hostile, so that's not recommended unless you're willing to learn well and learn fast. For example, it can take months, if not years, to evict someone.",
            "Concerned is a bizarro world response to getting money given to you.",
            "If you do not already own the house, this is your chance to move into a free house in sunny state. Just money you will save on Non paying real estate agents."
        ]
    },
    "My realtor lied about providing a counter to the other party": {
        "title": "My realtor lied about providing a counter to the other party",
        "score": 86,
        "url": "https://www.reddit.com/r/RealEstate/comments/1dlm4gh/my_realtor_lied_about_providing_a_counter_to_the/",
        "content": "Background: Provided my realtor (who is a personal friend) the amount I wanted to clear on the sale of my home.  After countless showings and 40+ days on the market we finally got an offer; recent reduction helped. \n\nIt was a low-ball offer but not so far away that we couldn’t counter.  I countered…. They countered.  Ultimately, I was around $5k away from my minimum amount I wanted to clear. \n\nI told my realtor, the sales price is acceptable if the buyers agent can take 2% (in other words, I would pay 5% commission).  My realtor responded with a thumbs up emoji at 7:15 PM and I didn’t hear from him again until the next day at 9:15 AM. He texts me, “I can’t believe this agent can’t get her clients up 6k. BS imo”\n\nI’m a little confused as I told him the sales price is agreed upon and it’s up to the realtors to take a reduction of 1% in commissions.  \n\nI start heeding questions from my realtor about another buyer who visited the property the previous day…. Almost as if he’s avoiding the subject. Finally at 6:00 PM today, I ask about the buyer with an offer…. His reply “it died, they wouldn’t budge.” \n\nMe: “sales price was finalized, did the commission reduction kill it?”\n\nRealtor: “yep. No worries, we are moving on.”\n\nMy wife and I are at dinner thinking WTF is going on and perplexed how our realtor and personal friend could be so nonchalant about the only offer we have seen in 1.5 months.\n\nAfter dinner, realtor and I exchange more text and it leads to me demanding a phone call immediately. I end up scolding him and corner him into him telling me that he never relayed the acceptance of the sales price offer with a 1% commission reduction to the other agent.  I called him a greedy fucker that lied to me because he couldn’t fathom a $2500 reduction on commission also knowing I’m about to use him to purchase a $850k+ house.\n\nI made him revive the deal and am now waiting to see if this will finalize. Wtf would you do in this situation. His wife is also a coworker of mine. ",
        "num_comments": 211,
        "comments": [
            "I’d play nice to see this through, get a new agent (if you’re dead set on that) for your purchase, and be done with him and his wife.",
            "This is another really good reason not to negotiate verbally. Always put it on paper with your signature on it so there's no miscommunication, whether it's legitimate misunderstanding or purposeful dishonesty like you're dealing with.",
            "I'm going to skip the emotion here and get to the legal answer, which is wrapped up in this\" \"it’s up to the realtors to take a reduction of 1% in commissions.\"  \n  \nIs this written into the listing agreement with the brokerage representing you and approved by the broker? Agents can't change the terms of the listing agreement without their broker's agreement. \n\nIf the buyer has an agreement with their buyer that the commission to be paid is higher than 2%, then the buyer couldn't make your counter work. \n\nI'd fire you in a heartbeat for this language \"I called him a greedy fucker.\"",
            "This makes no sense..why would you say your agent was greedy when you only asked the buyer's agent to take a  1% cut..maybe the reason your house has not sold is more a reflection on you..as it would have been better to ask both agents to each reduce by 1/2%",
            "Every comment is explaining in depth the myriad of ways OP is misguided but they keep doubling down. Sheesh.",
            "The problem is that your house is priced too high. It’s not worth as much as you think and your friend is stuck in the middle.",
            "Call his broker.",
            "Under the new rules where the buyer pays the buyer's agent, you would be completely out of line. You don't have any say at all in what the buyer pays his agent. You have a written contract with your agent to pay him 3% for selling the house, and when at the last minute you told him to take a haircut he gave you a thumbs up which translates as GFY.",
            "Lol all these salty realtors in here. The realtor is obligated to relay the counter by law as a fiduciary. Frankly, not even relaying the counter can result in suspension or termination of their real estate license in most states. \n\nI tend to agree that you are risking a deal on principle at this point and if there is too much pushback on your request to lower commission, it is prob still worth eating the $2,500 if you don’t have other offers in hand. I would be cautious though about the buyers trying to re-trade after an inspection and further reduce purchase price. \n\nHowever, there are several ways to fix this, including using (or threatening to use) a different realtor for the purchase of your next house. Either way this “friend” prioritized 0.5% of their own commission (assuming they would split the cut with buyers agent) over your guys relationship, which tells you everything you need to know about your friend going forward. \n\nSeparate the transaction and the relationship fuck up. Don’t lose your opportunity to upgrade to where/what you want over this person and principle.",
            "Good for you standing up to them! Realtors suck. I'd say find a new one, but I ditched mine and just found one equally ick."
        ]
    },
    "My neighbor didn’t forewarn me that he was taking out 2-3 feet of my front yard. How should I handle this? ": {
        "title": "My neighbor didn’t forewarn me that he was taking out 2-3 feet of my front yard. How should I handle this? ",
        "score": 605,
        "url": "https://www.reddit.com/r/RealEstate/comments/1dl5fyw/my_neighbor_didnt_forewarn_me_that_he_was_taking/",
        "content": "I live in a brand new community. My neighbor wanted to extend his driveway, although he has the biggest house and biggest driveway on the block. He can literally park 7 cars in his driveway, no joke! We live in a rural area so he got a bunch of land. As his neighbor I don’t have much land, I have a fraction of his. However, he decided to take a huge chunk out of my front yard, about 2-3 feet,  to extend his already huge driveway. \n\nIs it common for a builder in 2023 to give you 2-3 feet of land that isn’t technically yours? I don’t want to confront my neighbor just yet. I want to ensure I have concrete proof and facts in hand. I found a surveyor who is gonna charge me $900, so I am getting this taken care of just looking for advice from others who have dealt with this. \n\n",
        "num_comments": 285,
        "comments": [
            "you need the survey to know where the property line is.\n\n You might also want to see if your city/county has easement or permit requirements that might require the neighbor to submit a survey. You might be able to get code enforcement to take a look without using a lawyer or survey of your own at this first stage.",
            "[deleted]",
            "Take care of it as promptly as possible. The longer property line issues like fences and driveways go on the harder they become to resolve.",
            "When I had a question about my property lines, it turned out that there was already a survey recorded with the recorder's office and publicly accessible for free. You would still need the surveyor to come out and stake the property to show where the lines are, but at least you can get a jump start on it by looking at the survey to see if there's an obvious encroachment.",
            "You absolutely should confront this theft.",
            "This happened in my old neighborhood (across the street from me). Neighbor had to remove the concrete that was added to the wrong side of the property line.\n\nGet it surveyed, have the owner pay to demo every bit of concrete in your side of the property line. \n\nIf this is CA, also report them to the local permit office. If they pouring on your property, very likely they didn’t pull a permit. Adding a ton of concrete without a permit might not be allowed at all, many counties/cities have codes that dictate how much impermeable material can be added to a given parcel",
            "You need to deal with this sooner than later. There’s time limits on things in the event you needed to sue.",
            "I am glad you were getting a survey. Surveys are your friend, especially if they prove that someone is encroaching on your property! Once you get the survey, you need to speak to your neighbor and the builder. If they blow you off, it’s time to find a lawyer.",
            "If the home was built in 2023 there is a recent survey available, no need to have it redone.",
            "Get a survey and tell him to have it returned to the original condition or take him to court"
        ]
    },
    "Seller hasnt turned on Gas twice when asked for during option period, what should we do?": {
        "title": "Seller hasnt turned on Gas twice when asked for during option period, what should we do?",
        "score": 84,
        "url": "https://www.reddit.com/r/RealEstate/comments/1dlgf69/seller_hasnt_turned_on_gas_twice_when_asked_for/",
        "content": "First time home buyer and we found a home we like.\n\nWe are under option until Monday. We had an inspector out Wednesday and they said they would turn on gas and utilities for the inspection, Gas was not on could not test hot water or water heater.\n\nTalked to them and we had a plumber coming out today and they said they would turn it on for the plumber today to check. Plumber comes out no gas on again.\n\nOur Agent contacted them and they said they could not turn on the gas because the HVAC was not up to code and the city wanted to charge them $300 to do so. We knew HVAC was old and got concessions to replace it.\n\nWe are now 2/3 days from our option ending and we have yet to be able to inspect the gas, hot water pipes and hot water heater. How worried should we be?\n\nIts a 30 year old home that was a rental but is now being sold.\n\nProperty is in South Texas\n\n",
        "num_comments": 105,
        "comments": [
            "so plan on hvac & water heater needing replace, but since he won't turn on can get EM back at least",
            "I think I’d just send them a ridiculous concession package for anything you couldn’t inspect.  I sure wouldn’t risk finding those problems after closing. ",
            "Realtor here.\n\nHUGE red flag. You have no idea if what they are saying is true.  You could be in for thousands of repair.\n\nIf you love the house have your Realtor submit the inspection form and request that the HVAC be brought up to code and inspected AT SELLER’s cost, and that Inspection Period remains open until such time as this is done.\n\nOr be prepared to walk.",
            "Only one way to get their attention: tell them you’ll be terminating if they don’t pony up and turn on the gas so you can properly inspect. Also ask for an extension.",
            "This would be a pretty big red flag to me. Rental property so they could be unaware of issues, or claim they were with plausible deniability.\n\nWith the timeline for your inspection period closing on Monday, they will probably try to stall you until you're SOL (it sounds like they've already been doing this). I suggest you immediately ask for an extension of your inspection period to get this sorted out. If they don't get back to you before Sunday on that, terminate while you still can. You're at a lot of risk with very little leverage otherwise.\n\nAssuming they agree to the extension, next step is to give them a choice. Work out what you think the absolute worst case could be for everything you're unable to inspect. Then add a buffer on top of that, and ask for that amount in concessions. Their alternative is to pony up and make it possible for you to do your inspections, which is what they should do. $300 is nothing for a home sale, either they are hiding something or they'll cave and pay it.",
            "This sounds like something that would terminate your offer since they are unable to provide proof of functioning HVAC",
            "I would walk they could be hiding a million things that or ask for 60k in concessions for the million things that may or may not be wrong since you can’t check. For all you know there could be a slab leak in the hot water line.",
            "Hold money from seller in escrow after close until you can confirm HVAC and WH are functional.",
            "I'd recommend calling the City Code Enforcement department to see what they have to say regarding the property.",
            "Also consider that if you buy the house you’ll have the same code issue with the gas company that the sellers are having. \n\nDon’t assume they are telling you the truth on why the gas can’t easily be turned on, either."
        ]
    },
    "Buyers had terrible realtor": {
        "title": "Buyers had terrible realtor",
        "score": 9,
        "url": "https://www.reddit.com/r/RealEstate/comments/1dls1rl/buyers_had_terrible_realtor/",
        "content": "Just a fun little story from when we sold our house. \n\nWe had a realtor no show for a showing, which was quite annoying since we had to vacate the house with a toddler, dog, and cat. Apparently the agent thought the house was vacant and she could just go whenever?? So five hours later she asks if she can come, we don’t need to leave as the buyers aren’t with her. Sure, whatever. Apparently the buyers had seen the house from the outside (???) and she was doing a video tour to show them the inside. I’m in FL and they’re in Cape Cod. \n\nWe did have a couple show up and knock on our door so I asked the agent if it was them…. She didn’t even know!! I was shocked. But anyways, she does the video. She loved our little house. Great. I was stunned at how unprofessional she was. Reeked of cigarette smoke and just her entire presentation, but I guess she wasn’t meeting with her clients that might be why. \n\nBuyers put in an offer at list price. We’re thrilled. Inspection happens, a few things come up, nothing major but definitely things here and there. Inspection period passes without a word from their realtor, they didn’t ask for anything. Again, we were thrilled! \n\nThe day before our closing, their agent reaches out to our broker asking if we ever got anything on the inspection report fixed….. broker responds uh no, you didn’t ask for anything to be fixed. Like what??? \n\nThen, closing day comes. We were buying a new house as well and using the same law firm for the closing. Met the buyers in the lobby, lovely people. The agent asks me, right in front of them, if the spa area of the pool and pool heater works (it said right on the listing that the pool is not heated, didn’t work the entire time we lived there) so I said no I don’t think it does, it didn’t work the whole time we lived there. But then I tried to deflect and say that we don’t like heating the pool anyways because if you need it heated then the air is too cold to enjoy swimming. Idk, I was just mortified she was asking this in front of her clients and scared they would walk.\n\nWhen I told my agent and broker that story, they couldn’t believe it. It was just such a sharp contrast compared to my team, who are so professional, knowledgeable, and the best in the town. \n\nIn the end everything went through great. Worked out well for us that their agent dropped the ball since we didn’t have to make any concessions or repairs, but I do hope they’re happy in the house, it will be a winter home for them. ",
        "num_comments": 6,
        "comments": [
            "Wow! Incompetence in action. I’m glad it worked out so well 😊",
            "We bought from a neighbor and they had a pretty slimy, idiot agent. \nIn all honesty, if we had known the details of their house before they listed, we would have tried to do an off market sale but we didn’t. We were the nosy neighbors at the Open House and ended up loving it.\nSo we made an offer above asking and included a letter because we were friendly with them. We call our close friend/agent who has represented us in other deals, she sends the offer literally hours after the Open House, and we don’t hear anything for DAYS. By this point, I had talked myself out of it and hoped the new neighbors would be nice. Then, my agent calls. Their agent wants a rent back and an appraisal clause. I’m like we can discuss a rent back but no won’t do an appraisal clause. No response. Again, thinking house is gone. Surprise surprise she comes back that we got it! \nNeighbor comes over for something unrelated, but I’m like hey while you’re here, here’s your earnest money, start chatting about inspections/timeline/etc. He shows us the house they’re buying, all cordial. (Again we got along well so if they hadn’t already listed with her we would have had zero issues doing an off market deal). I said I was surprised how long it took to hear back and assumed they just didn’t want to hurt our feelings. He’s like oh no let me tell you- we accepted day 1 but she was emailing the contracts to the wrong email address! I’m like oh so what about the rent back and appraisal clause? He’s like what? So apparently they had verbally accepted our offer but she was (1) trying to sweeten the deal for them (or her commission?) and (2) sending the info to the wrong email so nobody had any idea what was going on. \nThroughout the process, my agent had to explain multiple different very normal things to this woman, who is a prominent agent in our area!! Then, she didn’t even show up for the closing. Now when I see her signs places I just roll my eyes.",
            "Ouch! Glad it worked out!",
            "Thanks! Us too 😅",
            "Oh my gosh! What an idiot. Isn’t it amazing how people like that are successful?",
            "Thank you 😊"
        ]
    }
}