{
    "Weekly Open Thread - General Discussion": {
        "title": "Weekly Open Thread - General Discussion",
        "score": 25,
        "url": "https://www.reddit.com/r/realmadrid/comments/1dn9ul4/weekly_open_thread_general_discussion/",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&#x200B;\n\n&#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "num_comments": 2299,
        "comments": [
            "You ran into the pitch, and the person you hug is Andreas freaking Pereira \n\n![gif](giphy|mmRmDX9Y3Q7NS|downsized)",
            "Barca fans seeing Vini score a double for Brazil\n\n![gif](giphy|uubUtlJ2CbDRqQklCT|downsized)",
            "Joselu came, trashed Bayern, scored some vital La Liga goals, won UCL and the league, left for Middle East money. What a player!",
            "Just a reminder 🇨🇦 lodged a formal complaint against 🇦🇷 for taking extra long at halftime. Nothing was done and they just did it again…",
            "Man, online football fans are a hive mind and so easily manipulated lol. Then people cry about how the government controls them lmaoo. After every England game the hive mind barks “can’t believe he is winning the Balon’dor after being carried by Vini”. After every Brazil game the hive mind barks “can’t believe he is winning the Balon’dor after being carried by Jude”. In reality the hive mind just doesn’t want another Real Madrid place to win it and increase the gap between Real Madrid and their club from infinity to infinity. \n\nYou could pay a bot army on twitter to spread a notion that some random small nation’s striker is the best player itw for scoring 2 goals in GS and the hive mind’s opinion will be shaped into that.",
            "> I would like you to remember me as a youth player who gave EVERYTHING for his club. \n\n❤️🤍",
            "Vini and Jude are getting slandered because they are top 5 in the world. Remember that when you read the slander from fans of city and the broke Catalan club. They are jealous of these players and the success they’ve had here.",
            "Also pretty much nobody noticed but ... Hungary waited 3 days to go home.",
            "vini masterclass and brace and still getting hate for a rainbow flick that worked lmao it's getting really annoying now",
            "Remember, when Emi Martinez deliberately mocks fans to their faces and does sexual gestures to crowds with children, it’s “hahaha good shithousery, Reddit On 🤓, you’d want him on your team, he’s a winner so he can do that”\n\nBut when it’s Vini, also a winner, he’s causing trouble and has behavioral issues”"
        ]
    },
    "Real Madrid's third kit! ": {
        "title": "Real Madrid's third kit! ",
        "score": 574,
        "url": "https://i.redd.it/n8522mgh0i9d1.jpeg",
        "content": "",
        "num_comments": 82,
        "comments": [
            "Wth is that number font lmao",
            "Colour: cool /\nEverything else: not too cool",
            "Honestly I’m here for it\n\nAlways been a huge fan of the trefoil too",
            "Not a big fan of that number+nameset",
            "This shit is so nice but that collar just spoils it. Kroos probably caught wind that next season's kit was gonna have a collar and planned his retirement accordingly.",
            "This might be the worst number font I've ever seen on a jersey",
            "IMO this is the best real madrid grey kit",
            "I like this adidas original logo tbh",
            "Not a fan of the collar",
            "Not it for me …"
        ]
    },
    "Vinicius Scores for Brazil with an amazing play": {
        "title": "Vinicius Scores for Brazil with an amazing play",
        "score": 1524,
        "url": "https://v.redd.it/sc02x6h35f9d1",
        "content": "",
        "num_comments": 28,
        "comments": [
            "Joga Bonita Tiki taka\n\nAlso, Endrick is a beast player with tough mentality (hope his Copa run goes well, but the kid is going places).",
            "We saw so many goals just like that when a certain alien played with us... \n\nWhat a game by Vini tonight, really a nightmare matchup for Paraguay's right back.",
            "r/soccer: Vini doesn't play well for Brazil",
            "The way Vini finished that looked so much like Cristiano's calma calma goal.",
            "Is paqueta that did that pass?",
            "What the commentator doing man 🤣🤣🤣",
            "The whole buildup was a masterpiece",
            "The commentator is 🔥 alllllahhhhh alllllahhh 😅 so much better than the boring ass English commentators.",
            "Why is Vini going out of his way to make sure we can see racism? Is he stupid?",
            "r/soccer isn’t wrong with that take though. Brazilian here who watches every seleção game. This is the best game he’s ever had with the seleção and he can still play way better than he did last night. We hope he finally takes off now because when Vini is on, its scary."
        ]
    },
    "Vini gets Brace for Brazil ": {
        "title": "Vini gets Brace for Brazil ",
        "score": 560,
        "url": "https://v.redd.it/prs6krvg5f9d1",
        "content": "",
        "num_comments": 10,
        "comments": [
            "That's a vintage 2020 vini deflection  goal.\n\nEspecially  compared to his other  in the match which is a  vini Balon dor candidate smooth finish",
            "Benzema shedding a tear somewhere rn",
            "That white shorts reminds him of Madrid so he instantly gets into the kind of mood we've all been waiting for in America. Vamos Vini!",
            "That hustle/closing down/being available for his fellow attacker is what puts him in that sweet position to take advantage. He should be on penalties and could've had a hat-trick.",
            "Nice of Garett Southgate to do everything he can to ensure Vini wins the Balon D’or",
            "![gif](giphy|57eLCUpwCa4tqJc6Zc)",
            "We are Soooooo back",
            "OOOOOOOOOOOOO",
            "OOOOOOOOOOOO",
            "https://preview.redd.it/rkmi2lo1fg9d1.jpeg?width=2066&format=pjpg&auto=webp&s=4ef5b5c859fd71c78a1ea5ae95494e2378c74595\n\nIt was awesome. I was there live. He got his brace🏆👏🏻"
        ]
    },
    "Happy birthday to our starboy, Jude Bellingham!🎂🎉": {
        "title": "Happy birthday to our starboy, Jude Bellingham!🎂🎉",
        "score": 582,
        "url": "https://i.redd.it/ef74s9l31e9d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Only 21 and alongside the historic debut season for the biggest club itw, already such an successful proprietor with the amount of Real estate he owned in the knuckleheads of opposing fans, he learned alot from Vini in that aspect.",
            "Dem so he got the same birthday as me. Hb then jude",
            "The who made us forget about Mbappé at the beginning of last season 🫲🏼🫱🏼🤍",
            "Jude Bellingham, the big man at 21. With match winning goals in Classico to creating that chance against City in Etihad, he has exceeded expectations of what a player can do in his first season. 🤍",
            "21 and it’s just the start 🤩",
            "Thank you, kind stranger. Both of you and my gf are the only people outside of my family who wished me.",
            "21… wild",
            "The English Zizou 🪄",
            "HBD",
            "hbd !"
        ]
    }
}