{
    "Weekly Open Thread - General Discussion": {
        "title": "Weekly Open Thread - General Discussion",
        "score": 25,
        "url": "https://www.reddit.com/r/realmadrid/comments/1dn9ul4/weekly_open_thread_general_discussion/",
        "content": "# Open Thread\n\nBesides general conversation and talk about other leagues and teams, all the following content must go into the weekly Open Thread:\n\n&#x200B;\n\n* Simple one-liners, random thoughts or unrelated posts (with or without a single image).\n* All discussion about rival teams matches and results.\n* All wallpapers and image editing that are not created by you \\[Not OC\\]\n* Unsourced news and stats.\n* Photos of jerseys and other memorabilia.\n* Images of formations with minimal description.\n* Links to social media posts made by our players or celebrities, unless it counts as team news or stats.\n* All gaming content.\n* All memes should go into the Open thread during the week days.\n* All \"I am a fan of X team, I come in peace\" type of posts.\n* When posting rumours/news from Twitter, if possible post a direct link to the tweet.\n\n# This is our reliability guide: [https://rm-reddit.github.io/](https://rm-reddit.github.io/)\n\n**IMPORTANT: Only news from official sources, Tier 1 and Tier 2, can have their own thread, everything else including discussions about target players must go in here.**\n\n&#x200B;\n\n&#x200B;\n\n# Real Madrid Discord Server\n\n[**Click here to join our Discord Server**](https://discord.gg/syH7yen)",
        "num_comments": 2256,
        "comments": [
            "You ran into the pitch, and the person you hug is Andreas freaking Pereira \n\n![gif](giphy|mmRmDX9Y3Q7NS|downsized)",
            "https://preview.redd.it/hexmp4p7li8d1.jpeg?width=1080&format=pjpg&auto=webp&s=404093236175bd90b910e8defe3e22027082c262\n\nBro achieved legendary status with 2 goals",
            "Joselu came, trashed Bayern, scored some vital La Liga goals, won UCL and the league, left for Middle East money. What a player!",
            "https://preview.redd.it/ptejpogrgp8d1.jpeg?width=1290&format=pjpg&auto=webp&s=86c0528925b37dd93577a343a0e35100adc8a872",
            "Just a reminder 🇨🇦 lodged a formal complaint against 🇦🇷 for taking extra long at halftime. Nothing was done and they just did it again…",
            "Man, online football fans are a hive mind and so easily manipulated lol. Then people cry about how the government controls them lmaoo. After every England game the hive mind barks “can’t believe he is winning the Balon’dor after being carried by Vini”. After every Brazil game the hive mind barks “can’t believe he is winning the Balon’dor after being carried by Jude”. In reality the hive mind just doesn’t want another Real Madrid place to win it and increase the gap between Real Madrid and their club from infinity to infinity. \n\nYou could pay a bot army on twitter to spread a notion that some random small nation’s striker is the best player itw for scoring 2 goals in GS and the hive mind’s opinion will be shaped into that.",
            "\"If Germany wins Kroos should win Bdr\"\n\n\"If England wins Bellingham should win Bdr\"\n\n\"If Brazil wins Vini should win Bdr\"\n\n\"If Uruguay wins Valverde should win Bdr\"\n\n\nOh FFS, this sub has become intolerable of late. Such immaturity, people still care about that popularity contest. You said when Messi won it last year, that award lost its credibility. Yet, now here you are simping over it all over again 🤦🏽‍♂️.",
            "Now that Vinicius scored with Brazil in next few days we start hearing:\n\n1. Opponents are mid\n2. He scores tapin\n3. He is so selfish; wants to score all goals by himself.\n\nLike a clockwork.",
            "We won’t forget you king\n\nhttps://preview.redd.it/d5hs474aki8d1.jpeg?width=1170&format=pjpg&auto=webp&s=f370ce8feb6f4d603fd3056007d655901074d33e",
            "Modric named MOTM\n\nhttps://preview.redd.it/l9mkn5ss7l8d1.jpeg?width=1646&format=pjpg&auto=webp&s=28221fbe93b1940d175380e4c9affe10834b20f8"
        ]
    },
    "Vinicius Scores for Brazil with an amazing play": {
        "title": "Vinicius Scores for Brazil with an amazing play",
        "score": 964,
        "url": "https://v.redd.it/sc02x6h35f9d1",
        "content": "",
        "num_comments": 16,
        "comments": [
            "🥶\n\nhttps://preview.redd.it/jglve2fx6f9d1.jpeg?width=2048&format=pjpg&auto=webp&s=cc5754e22f62650ce5f957ece88f348b4a2e406b",
            "Joga Bonita Tiki taka\n\nAlso, Endrick is a beast player with tough mentality (hope his Copa run goes well, but the kid is going places).",
            "We saw so many goals just like that when a certain alien played with us... \n\nWhat a game by Vini tonight, really a nightmare matchup for Paraguay's right back.",
            "Golazzzzo",
            "Never doubt Vini again",
            "r/soccer: Vini doesn't play well for Brazil",
            "Man i love seeing how different cultures have different but same same when it comes to doing, the same thing.\n\nLike what the “hypeman commentator voice” sounds like, where i live they’ll go “player name, player name? PLAYER NAME? PLAYERNAME PLAYERNAME PLAYERNAME GOOOOAAAAAALLLLLL” and it’s really cool and funny seeing this version of “player name, player name, player name, player name player name.. allaah allaaah allaaaaah gooooaaaaal!” \n\nGlad that with all the hate around the world these days we can still all come together for a game of footy :)",
            "Is paqueta that did that pass?",
            "Why is Vini going out of his way to make sure we can see racism? Is he stupid?",
            "How did endrick play?"
        ]
    },
    "Vini gets Brace for Brazil ": {
        "title": "Vini gets Brace for Brazil ",
        "score": 359,
        "url": "https://v.redd.it/prs6krvg5f9d1",
        "content": "",
        "num_comments": 9,
        "comments": [
            "That's a vintage 2020 vini deflection  goal.\n\nEspecially  compared to his other  in the match which is a  vini Balon dor candidate smooth finish",
            "That white shorts reminds him of Madrid so he instantly gets into the kind of mood we've all been waiting for in America. Vamos Vini!",
            "![gif](giphy|57eLCUpwCa4tqJc6Zc)",
            "https://preview.redd.it/rkmi2lo1fg9d1.jpeg?width=2066&format=pjpg&auto=webp&s=4ef5b5c859fd71c78a1ea5ae95494e2378c74595\n\nIt was awesome. I was there live. He got his brace🏆👏🏻",
            "Benzema shedding a tear somewhere rn",
            "That hustle/closing down/being available for his fellow attacker is what puts him in that sweet position to take advantage. He should be on penalties and could've had a hat-trick.",
            "We are Soooooo back",
            "OOOOOOOOOOOOO",
            "OOOOOOOOOOOO"
        ]
    },
    "Joselu bids farewell on Instagram (Translation in post)": {
        "title": "Joselu bids farewell on Instagram (Translation in post)",
        "score": 1310,
        "url": "https://i.redd.it/ge098380ec9d1.jpeg",
        "content": "Thank you,\n\nIt is the best word and the most suitable to express everything I feel at this moment, in which emotion and nerves barely allow me to write.\n\nThank you Real Madrid for everything you have made me feel throughout my life.\n\nOutside and inside. Inside and outside.\n\nThank you for what you taught me as a kid; thank you for giving me so many examples of greatness and humility at the same time.\n\nThank you for keeping my dream alive and for making it come true.\n\nThank you Presi, you are very big.\n\nThank you José Ángel for so much.\n\nThanks to each and every one of the employees of the largest and most exemplary club.\n\nThank you coach for your way of understanding this game.\n\nThank you Team for being my family.\n\nThank you fans for so much passion, so much affection and that complicity that made us fly.\n\nI left years ago but I never left. I'm also leaving today, but I'm actually staying.\n\nThank you.\n\nJOSELU",
        "num_comments": 62,
        "comments": [
            "Hero of the team, he came in clutch when needed and left as soon as he won everything. We will miss him",
            "Can't find many stories like this one. What a journey he had. The great juselo we thank you for your love to this badge.",
            "I expected nothing from him when he was signed, now we have a Champions league to thank him and remember for forever.\n\nGood luck selu",
            "And just like I thought, Florentino and JAS must have personally handled the transfer thing with Espanyol by activating the buy clause. They did good by him, he deserves it.",
            "bro left the club with more goals than hazard ig... goated",
            "\"I left years ago but I never left. I'm also leaving today, but I'm actually staying.\"",
            "I'm not crying, we're crying.",
            "What a legend! Never forget that Bayern comeback 🤝👑",
            "He did his Job and now leaves without Drama. \n\nI really liked him, he is not world class, he is not the best, but he still did his job when needed. \n\nWhat a great guy too",
            "Translation credit to [@MadridXtra](https://x.com/madridxtra/status/1806730295862771791?s=46)"
        ]
    },
    "Happy birthday to our starboy, Jude Bellingham!🎂🎉": {
        "title": "Happy birthday to our starboy, Jude Bellingham!🎂🎉",
        "score": 463,
        "url": "https://i.redd.it/ef74s9l31e9d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Only 21 and alongside the historic debut season for the biggest club itw, already such an successful proprietor with the amount of Real estate he owned in the knuckleheads of opposing fans, he learned alot from Vini in that aspect.",
            "21… wild",
            "The English Zizou 🪄",
            "The who made us forget about Mbappé at the beginning of last season 🫲🏼🫱🏼🤍",
            "Dem so he got the same birthday as me. Hb then jude",
            "Jude Bellingham, the big man at 21. With match winning goals in Classico to creating that chance against City in Etihad, he has exceeded expectations of what a player can do in his first season. 🤍",
            "HBD",
            "hbd !"
        ]
    }
}