{
    "31 May 2024 - Weekly Open House Recap": {
        "title": "31 May 2024 - Weekly Open House Recap",
        "score": 3,
        "url": "https://www.reddit.com/r/REBubble/comments/1d4suz8/31_may_2024_weekly_open_house_recap/",
        "content": "How did your open house viewings go this last week? Heaven or hell? Sublime or subpar? Share your open house experiences!\n\nAs a guide, include the following for each Hoom (where applicable):\n\n1. Zillow or Redfin Link\n2. How many people were in attendance\n3. How the condition of the property matched the condition in the listing\n4. Interactions with other buyers\n5. Agent/Seller interactions",
        "num_comments": 12,
        "comments": [
            "This place is so dead lol",
            "Nobody is looking to buy a house, at the prices the sellers want",
            "I wish more Sellers Agents would tell their clients this. The problem is, more people keep buying at outrageous levels. We need a crash imminently to give these people who are overextended a lesson.",
            "it is coming! The people buying today are the last ones to be able to afford the current prices (and stupid enough to buy at those prices).",
            "Any predictions what the catalyst will be?",
            "Carriers issued policies on the houses purchased without inspections.  Carriers are not renewing the policies without a new roof.",
            "HAH...my friend who just bought a house, her insurance is $98 a month, don't think that's gonna break the bank......that's like a night out eating",
            "Really... \"perks ears\"...? How so?",
            "Widfires and floods have been clobbering insurance companies, and insurance rates are going way up.  Money that goes to insurance can't go to a payment.",
            "Made you look"
        ]
    },
    "29 June 2024 - Daily /r/REBubble Discussion": {
        "title": "29 June 2024 - Daily /r/REBubble Discussion",
        "score": 4,
        "url": "https://www.reddit.com/r/REBubble/comments/1dr8oul/29_june_2024_daily_rrebubble_discussion/",
        "content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "num_comments": 0,
        "comments": []
    },
    "\"iNvEsToRs aReN'T ThE PrObLeM\"": {
        "title": "\"iNvEsToRs aReN'T ThE PrObLeM\"",
        "score": 881,
        "url": "https://i.imgur.com/XYljljS.jpeg",
        "content": "",
        "num_comments": 60,
        "comments": [
            "We are 2-4 years away from our homes being listed on an exchange.  Way more rapid in valuation changes.  \n\nFolks, how do we like have every single minute detail of our lives designed for instant financial optimization?",
            "At this point the only thing that could save us is if houses were no longer considered a tradeable asset and that there are huge number of houses constructed to offset the demand /supply rule.",
            "might as well speed dial China when you're ready to sell",
            "Where are those people who love to cover shit in orange paint?",
            "There is a RE agent in the Florida sub who keeps saying that investors are not buying up all the houses. Been saying this for 5 years.",
            "What horrible design. You'd need a ladder to enter your address.",
            "\"Mom and pop investors are the real problem!\"",
            "We need to make it so only people that will be living in said home can buy said home, no exceptions.",
            "The federal reserve, bl4ck r0ck, W3F,  you will own nothing and be happy but please keep voting with your adolescent, know it all, hormonal, emotions.  Its working out great. /s",
            "Doesn't this billboard look photoshopped?"
        ]
    },
    "35 is The New Median Age of a First-Time Homebuyers in the US": {
        "title": "35 is The New Median Age of a First-Time Homebuyers in the US",
        "score": 279,
        "url": "https://wealthvieu.com/uafdp",
        "content": "",
        "num_comments": 75,
        "comments": [
            "They can't expect people to have kids when they have nowhere to put them.",
            "Got my first home at the very end of '21 at the age of 44.   Guess a 26 year old grabbed one as well to even me out.",
            "The problem is a lot worse in vhcol areas. For example in LA the average age where more people are homeowners than not is 49. It gets older every year. Its called the sliding homeownership ladder phenomenon.",
            "Look at me being average af.",
            "In 2008, I purchased my first home at the age of 24. I feel bad that the newer graduates have to start their life journey so far from the home owner goal.",
            "I wonder if you plot this with student loans what that would look like",
            "34 here... there is hope for next year",
            "Got my first house at 27 in 21 but at probably like 2/3d the nations average price (226k). Just bought again at 30 but sold my first in 22 at 28. Im married though so we are dual income.",
            "38 and bought last month.",
            "I was born in 1975 so I was 35 when I bought my first place in Austin in 2010. I used the Obama first time homebuyer tax credit that was available at the time."
        ]
    },
    "Young Americans are struggling and not having kids due to unaffordable housing. It’s like the US has hit the same growth ceiling that historically plagued Europe": {
        "title": "Young Americans are struggling and not having kids due to unaffordable housing. It’s like the US has hit the same growth ceiling that historically plagued Europe",
        "score": 657,
        "url": "https://moneywise.com/news/economy/theyre-not-having-kids-nyu-professor-scott-galloway",
        "content": "",
        "num_comments": 248,
        "comments": [
            "imho as an uneducated noob, it's not about lack of growth. It's about more and more portion of generated wealth going to smaller and smaller group at the top.",
            "Europe's slower growth over the last two centuries was created by a spoiled nobility too busy with internal squabbles to properly care for its citizens.\n\nAnd yes, I think the US has that same problem now.",
            "The real question how do latin Americans (Hispanics in USA) do it....they are still averaging like 2-3 kids per couple....",
            "And South Korea, Japan ( their problem started in the 90s ), China, Australia, Canada, and pretty much the entire developed world. \n\nIts stunning to me that no major developed country has seen the importance of dealing with this issue. To me it is kind of like the fentanyl crisis - been going on for 10 years, nobody in either party even talks about it, clearly nobody thinks its an important issue- and so it continues.",
            "Its ok.  We can replace them with rich foreigners with pay for green card schemes",
            "Thats why some states are forcing people to have kids instead",
            "Infinite growth is the behavior of a cancer. There were always limits to growth, children.",
            "Yes. The era of abundance is over. Now we have to make actual decisions.",
            "It's for the best. I'm in the same boat. 28, newly married, down payment saved. It really puts into perspective for future parents, don't pop out babies 24/7. Their lives will be miserable. Just like ours are now.",
            "Doesnt it feel like were just living in a simulation? Its like theres a bunch of elites behind the scenes that are pulling the strings. Right after World War II, there was a major boom for the middle class, and now there is not. Everything controlled behind the scenes through interest rates and wars."
        ]
    }
}