{
    "31 May 2024 - Weekly Open House Recap": {
        "title": "31 May 2024 - Weekly Open House Recap",
        "score": 7,
        "url": "https://www.reddit.com/r/REBubble/comments/1d4suz8/31_may_2024_weekly_open_house_recap/",
        "content": "How did your open house viewings go this last week? Heaven or hell? Sublime or subpar? Share your open house experiences!\n\nAs a guide, include the following for each Hoom (where applicable):\n\n1. Zillow or Redfin Link\n2. How many people were in attendance\n3. How the condition of the property matched the condition in the listing\n4. Interactions with other buyers\n5. Agent/Seller interactions",
        "num_comments": 12,
        "comments": [
            "This place is so dead lol",
            "Made you look ",
            "Nobody is looking to buy a house, at the prices the sellers want",
            "D'oh :'-(",
            "I wish more Seller’s Agents would tell their clients this. The problem is, more people keep buying at outrageous levels. We need a crash imminently to give these people who are overextended a lesson.",
            "it is coming! The people buying today are the last ones to be able to afford the current prices (and stupid enough to buy at those prices).",
            "Any predictions what the catalyst will be?",
            "Insurance",
            "Carriers issued policies on the houses purchased without inspections.  Carriers are not renewing the policies without a new roof.",
            "HAH...my friend who just bought a house, her insurance is $98 a month, don't think that's gonna break the bank......that's like a night out eating"
        ]
    },
    "\"iNvEsToRs aReN'T ThE PrObLeM\"": {
        "title": "\"iNvEsToRs aReN'T ThE PrObLeM\"",
        "score": 756,
        "url": "https://i.imgur.com/XYljljS.jpeg",
        "content": "",
        "num_comments": 49,
        "comments": [
            "We are 2-4 years away from our homes being listed on an exchange.  Way more rapid in valuation changes.  \n\nFolks, how do we like have every single minute detail of our lives designed for instant financial optimization?",
            "At this point the only thing that could save us is if houses were no longer considered a tradeable asset and that there are huge number of houses constructed to offset the demand /supply rule.",
            "might as well speed dial China when you're ready to sell",
            "Where are those people who love to cover shit in orange paint?",
            "Probably a scam anyway.",
            "There is a RE agent in the Florida sub who keeps saying that investors are not buying up all the houses. Been saying this for 5 years.",
            "That sign needs fire!",
            "Ban businesses from owning residential real estate!\n\n\nAlso, that sign is an act of class war. I don't think it would be immoral or unethical to \"remove\" it. ",
            "We need to make it so only people that will be living in said home can buy said home, no exceptions.",
            "\"Mom and pop investors are the real problem!\""
        ]
    },
    "35 is The New Median Age of a First-Time Homebuyers in the US": {
        "title": "35 is The New Median Age of a First-Time Homebuyers in the US",
        "score": 238,
        "url": "https://wealthvieu.com/uafdp",
        "content": "",
        "num_comments": 58,
        "comments": [
            "39 here, still waiting.",
            "They can't expect people to have kids when they have nowhere to put them.",
            "Got my first home at the very end of '21 at the age of 44.   Guess a 26 year old grabbed one as well to even me out.",
            "The problem is a lot worse in vhcol areas. For example in LA the average age where more people are homeowners than not is 49. It gets older every year. It’s called the sliding homeownership ladder phenomenon.",
            "This is a problem that has been solved by other countries. You know where I'd expect a housing shortage? Tokyo. 35 million metro area wtf. But it's not at all the case, but San Francisco with their 800k has some of the worst homeless in the nation. \n\nBroadly it's boomers, but I'm gen x and we've gotten enough of a cut that we are invested in the status quo too. Millennials and Gen z can have a clean conscience but they are the victims.\n\nIt's both stupidly simple to fix and near impossible bc x plus boomers outvotes the newcomers.",
            "Look at me being average af.",
            "In 2008, I purchased my first home at the age of 24. I feel bad that the newer graduates have to start their life journey so far from the home owner goal.",
            "I wonder if you plot this with student loans what that would look like",
            "34 here... there is hope for next year",
            "Got my first house at 27 in 21’ but at probably like 2/3’d the nations average price (226k). Just bought again at 30 but sold my first in 22’ at 28. I’m married though so we are dual income."
        ]
    },
    "Young Americans are struggling and not having kids due to unaffordable housing. It’s like the US has hit the same growth ceiling that historically plagued Europe": {
        "title": "Young Americans are struggling and not having kids due to unaffordable housing. It’s like the US has hit the same growth ceiling that historically plagued Europe",
        "score": 597,
        "url": "https://moneywise.com/news/economy/theyre-not-having-kids-nyu-professor-scott-galloway",
        "content": "",
        "num_comments": 232,
        "comments": [
            "imho as an uneducated noob, it's not about lack of growth. It's about more and more portion of generated wealth going to smaller and smaller group at the top.",
            "Europe's slower growth over the last two centuries was created by a spoiled nobility too busy with internal squabbles to properly care for its citizens.\n\nAnd yes, I think the US has that same problem now.",
            "The real question how do latin Americans (Hispanics in USA) do it....they are still averaging like 2-3 kids per couple....",
            "And South Korea, Japan ( their problem started in the 90s ), China, Australia, Canada, and pretty much the entire developed world. \n\nIt’s stunning to me that no major developed country has seen the importance of dealing with this issue. To me it is kind of like the fentanyl crisis - been going on for 10 years, nobody in either party even talks about it, clearly nobody thinks it’s an important issue- and so it continues.",
            "Its ok.  We can replace them with rich foreigners with pay for green card schemes",
            "That’s why some states are forcing people to have kids instead",
            "Yes. The era of abundance is over. Now we have to make actual decisions.",
            "Infinite growth is the behavior of a cancer. There were always limits to growth, children.",
            "It's for the best. I'm in the same boat. 28, newly married, down payment saved. It really puts into perspective for future parents, don't pop out babies 24/7. Their lives will be miserable. Just like ours are now.",
            "Yeah, I just don't want to raise a child in a society that is basically condemning them to a consistently worse standard of living. That is cruel. You see poorer people having more kids, but those kids are going to end up in a worse position than their parents. If there was optimism, even educated people would be having more kids. But once you realize what a struggle life is now, you can't help but imagine a horrible future for the next generation."
        ]
    },
    "'Buy now, pay later' loans skyrocket 1,100% over just 2 years—but that’s not the worst part": {
        "title": "'Buy now, pay later' loans skyrocket 1,100% over just 2 years—but that’s not the worst part",
        "score": 85,
        "url": "https://creditnews.com/markets/bnpl-loans-skyrocket-1100-over-2-years-but-thats-not-the-worst-part/",
        "content": "",
        "num_comments": 20,
        "comments": [
            "Scary part is no one knows how much $$ is out there tied up in BNPL loans.",
            "They’re 0 interest idk how this is a big deal",
            "$1,000,000……",
            "0 interest until a missed payment, and then pure usury.",
            "The big deal is a lot of people don't use automatic payments. And if you forget about it on your last payment, you get charged interest on the full purchase instead of only what's left. Also when you do BNPL for food, you're already in trouble of not paying anything. BNPL is another escape for people to go into debt that don't qualify for credit cards.",
            "The 29.99% default rate",
            "Spoken like a dumass who doesnt know how financing works.",
            "at least it's *pure*",
            "It’s autopay why would you miss a payment?",
            "The big deal about BNPL is they rely on a soft pull for credit. It doesn’t register on the credit bureaus. The worry is that borrowers will be overstretched but still approved because Affirm doesn’t know a borrow has plan with another BNPL. Then it come all crumbling down. On the other side, the estimates for BNPL is dwarfed by credit card debt. "
        ]
    }
}