{
    "/r/RedDeadRedemption Weekly Question & Answer Thread - Week 25, 2024": {
        "title": "/r/RedDeadRedemption Weekly Question & Answer Thread - Week 25, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/reddeadredemption/comments/1dncwd3/rreddeadredemption_weekly_question_answer_thread/",
        "content": "#All common questions about the game should be directed here. This includes both single-player and online questions. When asking a question, it is often beneficial to share which mode you are referring to in order to get an accurate response. Also consider sharing any relevant information that may help someone answer your question.\n\n* [See our FAQ here for some common questions](/r/reddeadredemption/wiki/faq)\n\n* [Our spoiler policy](/r/reddeadredemption/wiki/spoilerpolicy)\n\nAll story spoilers must be displayed with the proper format:\n\n`>!RDR is a great game!<`\n\ngives you:\n\n>!RDR is a great game!<\n\nIf you're not sure if you should use a spoiler tag or not, err on the side of caution and use one. Also, it's a nice gesture to visibly indicate the general nature of your spoiler before the tag, so people know what you're spoiling.\n\n---\n\n#[Submit Red Dead Online feedback here](https://www.rockstargames.com/reddeadredemption2/online/feedback)",
        "num_comments": 20,
        "comments": [
            "I am currently trying to get the bear hunter outfit and when looking at the required pelts I need, I notice several of those required are larger hides and pelts which I can only fit on the back of my horse one at a time, I'm aware that legendary pelts can't really be lost, they are just stored at the trapper, but what about the generic large pelts? Am I safe to hunt all the necessary animals and then go to the trapper or do I have to go back and forth to him everytime?",
            "I have red dead on cd for playstation 4. For an evening i deleted red dead because i wanted to try out another game and didnt have enough space. Next morning, when i tried inserting the CD to download red dead back and noticed i had scratched it. It stopped copying after 21 percent of the game disc. And this got me thinking. I have been wnting to upgrade to a ps5 and since my cd is not working anymore, can i buy red dead ultimate edition directly from playstation who is currently on discount(i didnt have the ultimate edition before) and keep my story mode progress on story mode?",
            "whenever i use a white horse, it gets this obnoxious glowy aura effect(best comparison i can think of is like the bloom lighting in TLOZ Wind Waker that was always a big complaint by fans) around it whenever the sun reflects onto it. i've tried adjusting some graphics settings(im on pc, if that info is helpful at all) and nothing seems to make a notable difference. does anyone know if there is a setting i am missing to fix it(or any graphics mods even)? \n\nit shouldn't bother me so much but i guess it just does. my brain just focuses in on it. i had finally decided to track down the white arabian to see what the hype is about and i do really like her but i just can't stand to ride with her because of that glowy effect. i've always avoided horses with any white on their backsides because of this. i might just keep a wolf pelt or something on her booty to prevent the sunlight on her white coat from blinding me, but if there is an alternate option i'd love to try that first",
            "Is Walton's Gang Outfit available on switch version of RDR1?",
            "in rdr 1 where is the stranger task deadulus and son",
            "is it normal that shadow casting from the sun is dependable on the player position ? Shadows moves as I moved with the camera in the game? That's how rdr2 engine works? or something bugged at my end?",
            "I played Red Dead 1 when it first came out for about a year and then sold my copy of it and have since forgot about most of the story. Im looking to get back into the game and give it another shot now that Im getting back into single player games. Should I start with 1 or jump right into 2?",
            "how much would a working xbox 360 promotional disk go for?",
            "You have to take every non-legendary pelt to the trapper, which means going back and forth a lot. Having a secondary horse helps with this since each horse can carry one large pelt.",
            "Once you sell a perfect pelt to the Trapper, he keeps it forever.\n\nAlso, capture or steal an extra horse as a temporary horse when you go hunting, and you can carry two large pelts at once."
        ]
    },
    "Just found a white Arabian horse what should I name her ?": {
        "title": "Just found a white Arabian horse what should I name her ?",
        "score": 224,
        "url": "https://i.redd.it/3a54ogcs4h9d1.jpeg",
        "content": "",
        "num_comments": 202,
        "comments": [
            "I named mine The Countess",
            "I could imagine OP just sitting there waiting for the replies to come in. ",
            "I named mine Hestia. Rode with me for 200 hours until Red Dead Redemption, I finished basically 80% of the total requirements for 100% completion with her",
            "My last one was called Cuhntleigh you're welcome to copy it.",
            "Selena that is also a white arabian sad she had to part",
            "I went with Freya as I like norse mythology",
            "Mine was Shadowfax (Lord of all horses)",
            "I like Spirit as a name since shes fast and white",
            "if female Ana or Sofia\n\nif male Alajandro",
            "Persephone \n\nI'm not sure why, it just fit"
        ]
    },
    "I just finished my first play through of Read Dead 2. Im at a loss for words.": {
        "title": "I just finished my first play through of Read Dead 2. Im at a loss for words.",
        "score": 379,
        "url": "https://i.redd.it/xsynf3of5g9d1.jpeg",
        "content": "This game was amazing. It was the first game I’ve ever played to make me cry, and I’m normally not an emotional person.\n\n10 out of goddamn 10.",
        "num_comments": 30,
        "comments": [
            "Same here. That last ride to the camp fucked me up, Thats the way it is is a beautiful song, but I cant listen to it without crying now.",
            "I just reached the epilogue two days ago. I dont even feel like playing it anymore. Its depressing at this point. Fucking Micah",
            "No game has made me feel the way this did. Let alone any movies. Seeing arthur die just hit different especially seeing his character development throughout, how much better of a person he became trying to get everyone out. Ill always remember Arthur Morgan",
            "The end credits are what broke me. Seeing Mary at Arthur's grave...",
            "I finally finished chapter 6 myself 3 days ago after 3 years, I was happy with how my journey ended up and it felt like it was the way I wanted it to end. That game made me cry countless times from the emotional impact its had. Definitely a 10/10 game, Ive been enjoying the epilogue and looking forward to how that plays out. Its a game that has a lot to be able to appreciate, you get so lost.",
            "Just completed my 3rd walkthrough weeks ago. I got emotional but my sister was sitting with me, so no tears.\n\nIt might be my last walkthrough.",
            "I knew a feller once who cried at the end of chapter six. A grown ass man with a big beard, reduced to tears. Quite a thing!",
            "I got this game at my friend's house who was celebrating Christmas. I didn't expect much and then had my heart crushed. At least I watched a beautiful sunrise.",
            "I knew how the game ended when I did my first play through. Still completely fucked me up ",
            "Yeah, when he says goodbye to his horse, it broke me"
        ]
    },
    "LOOK AT WHAT MY DAD MADE ME 🤭": {
        "title": "LOOK AT WHAT MY DAD MADE ME 🤭",
        "score": 343,
        "url": "https://i.redd.it/z96q1xgjff9d1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "Dude your dad rocks! That's so cool. Is that like a light box or something? He did awesome. I like how the window to the left looks brighter.",
            "You just might have the coolest dad ever",
            "Damn that looks soo cool",
            "That's awesome, what a cool dad!",
            "Bro has the best dad ever",
            "can you ask your dad to adopt me",
            "Well, now ain't that something",
            "Wish I had a dad growing up like yours. Looks good bro",
            "I'm stealing that photo and Ur dad thank U goodbye",
            "Dont tell me what to do. But that is pretty cool"
        ]
    },
    "100% Serious Post": {
        "title": "100% Serious Post",
        "score": 543,
        "url": "https://i.redd.it/isydvinpge9d1.jpeg",
        "content": "How long has this been in the game? This is my second play through in the last 6 months and like my fifth or sixth overall and I’ve never noticed it. Surely it was added recently right? I’m being accused of modding in another subreddit and I can swear I have no knowledge of modding lol it’s by the dewberry creek stable headed towards emerald ranch. Right across the road from the broken down wagon that has ammo and gun oil",
        "num_comments": 45,
        "comments": [
            "Never seen it before and Ive played it through twice. TIL",
            "It's been there since launch. \n\nSorry Pardner",
            "Dont you past this when >!taking the oil wagon to Lemoyne for Johns train robbery?!<",
            "Played this game for years multiple 100% playthoughs what is this  never seen it haha",
            "Maybe we didnt explore enough ....",
            "Is that the sign you have to drive Marston in to when robbin that train?",
            "Been there forever. Look up footage of people playing the mission Pouring Forth Oil II back when the game was released, it's there.",
            "Interesting discovery, at least for people like me who haven't found every nook and cranny. Grass and trees are all I ever find lately :/",
            "Where is that? Ive never seen it",
            "Bros definitely standing with the south we all know why"
        ]
    }
}