{
    "Stables Bug Workaround": {
        "title": "Stables Bug Workaround",
        "score": 177,
        "url": "https://www.reddit.com/r/reddeadredemption2/comments/10kta15/stables_bug_workaround/",
        "content": "There's been a few posts asking about the stables bug. So I'm posting a workaround as suggested by Kelly on the RDO discord. \n\nPlease refer people to this post if anyone asks about this bug.\n\n\nCurrently, there is a persistent issue around horses, wagons, and the use of the stables, including but not limited to:\n- attempting to enter the stables and becoming stuck with no menu or control\n- attempting to call out a different horse or wagon from player menu but failing to\n\nTo fix these issues, follow these steps:\n1. Flee your active horse or wagon *first*. Focus on your horse and flee it, or dismiss the wagon from the player menu. If the horse refuses to run, shoot around it to spook it into running or mash the flee button until it leaves. Make sure the horse despawns completely, as indicated by a lack of horse icon on the mini map or you see it physically disappear.\n2. You should now be able to enter the stable without the game glitching. Additionally, you can use the player menu to call your horse/wagon when out in free roam. Best done near roads.\n\n**Note:** You will need to do this any time you wish to call out a different horse or enter a stable.\nIf you get stuck in the stable, you will need to change lobbies or restart game. If you call a different horse and it does not come, wait a few minutes and try again. Eventually the game will despawn your old horse and the new one will spawn. If you fast travel and your horse is not spawning after the fast travel, it is possible it got \"stuck\" from where you fast traveled from. You will need to wait as stated above to try calling it back to you.",
        "num_comments": 51,
        "comments": [
            "What I've found to work is get off the horse and run in to the stables...just as you run in whistle for your horse to follow you...done, every time so far",
            "Thanks this has been happening to me all week so fun🤬🤬🤬",
            "It works best at valentine make sure horse is way gone gone and 88 percent it works lol",
            "Shame we need this to make the game work",
            "Man I dealt with this issue a year ago when I played RDO to the max of all roles. “Solved” the issue just like people are saying. Can’t believe R* STILL hasn’t fixed this incredibly frustrating bug. They really have totally given up on this game and the online portion. Too bad.",
            "Thank you so much , I wanted to strangle that scrawny nah so bad 😂",
            "Apparently it’s related to one person having network issues,because whenever I adjust my MTU settings to play in a solo lobby,it never happens",
            "This worked for me! Thanks man",
            "I have a question guys in single-player mode Pistol M1899 how much is the maximum number of bullets in it",
            "What worked for me was exiting the game and closing it out completely then restarting it. I only seem to have the issue whenever the game “Quick Resumes”"
        ]
    },
    "Was hunting when I found this HUGE snake, does anyone know anything about it?": {
        "title": "Was hunting when I found this HUGE snake, does anyone know anything about it?",
        "score": 54,
        "url": "https://v.redd.it/x2pfiaod8h9d1",
        "content": "",
        "num_comments": 23,
        "comments": [
            "\"It's a reference to the jungle book\"",
            "Yes, it’s a snake……………………..but huge.",
            "The snake was supposed to be another legendary animal, but they ran out of time or some other reason so they just used the model as a decoration item",
            "The fuck! Never seen that before!",
            "Considering there's a post about it every other day, yes",
            "We all know Arthur’s Horse is The Good Boah\n\nThat snake is a good Boa",
            "It's a long story, go to youtube and search for pleasance village mystery",
            "If you stand by it around midnight it'll try to eat you",
            "I jumped hard the first time I saw it",
            "What pool of data are you drawing from to make that conclusion?"
        ]
    },
    "Jack been drinking ": {
        "title": "Jack been drinking ",
        "score": 461,
        "url": "https://i.redd.it/rsz37ljufd9d1.png",
        "content": "",
        "num_comments": 41,
        "comments": [
            "what's even funnier is that his father came into his room when he was laying in bed, chugged two bottles of whiskey in front of him, tossed them on the bed, and took this photo to blame it on Jack",
            "Abigail, our boy’s been drinking! Get the strap!",
            "Jack and John are drunk together. True bonding.",
            "John got so drunk he forgot he threw those bottles onto Jack’s bed",
            "Wfym it wasn't me it was uncle",
            "I see you everywhere, and all I see are downvotes.",
            "Nahhhhh jack deffinatly been hitting that bottle",
            "Mf when people are having fun",
            "I get worried if I don’t see you in the comments of a RDR2 post.",
            "Obviously, you stood John beside the bed, drinking Kentucky Bourbon, and he tossed the empty bottles on Jacks Bed. The only bottle with that shape are the Kentucky Bourbon bottles you either buy at a store or loot. Any other whisky bottles are round. Nice try though!"
        ]
    },
    "Arrived in Rhodes late at night and saw Dutch running, followed him and he led me to KKK": {
        "title": "Arrived in Rhodes late at night and saw Dutch running, followed him and he led me to KKK",
        "score": 1706,
        "url": "https://v.redd.it/mb49qmw13b9d1",
        "content": "",
        "num_comments": 122,
        "comments": [
            "It's all part of his plan. Lenny wasn't invited.",
            "Lay your PS5 down on its side ",
            "I hope this isn't a spoiler but a buddy said the game will let you \"punish\" the klansmen without cosequences, as it should. I haven't gotten there yet. Your instinct should definitely be to kill them though lol",
            "Off topic, but your ps5 placement bothers me, even though it's barely in the screen",
            "When you have a poker game at 9:00 but a klan meeting at 9:15.",
            "Dutch seemed pretty unaffected by Lenny’s death. Interesting plans Dutch.",
            "He was late for the meeting",
            "wow, that was totally new. Bro has some plan...",
            "If you just watch the whole thing they all end up killing each other",
            "\"I HAD A GODDAMN KLAN!? \""
        ]
    },
    "That's the way it is.": {
        "title": "That's the way it is.",
        "score": 17,
        "url": "https://i.redd.it/e4ozblz6qh9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "You are a good man Arthur Morgan, you are a good man!\n\nWe all cried, but when Lady, the girl I tracked to snowy fields, fought her temper for a good minute and saved my butt many times after, died taking a bullet for me, i cried again. RIP Arthur and Lady",
            "that is, indeed, the way it is",
            "Things will never be the same."
        ]
    }
}