{
    "Courts Rule US Government Above the Law. Judge declined to hold the CIA in contempt for destroying videos that it had been ordered by the courts to preserve.": {
        "title": "Courts Rule US Government Above the Law. Judge declined to hold the CIA in contempt for destroying videos that it had been ordered by the courts to preserve.",
        "score": 3667,
        "url": "http://tv.globalresearch.ca/2011/10/courts-rule-us-government-above-law",
        "content": "",
        "num_comments": 442,
        "comments": [
            "Stick a fork in it, this Government is done. ",
            "well if the CIA can deal coke and heroin and kill people at will, who are the courts to say anything?",
            "Government is a sham....we are being ruled by a plutocracy....",
            "It's like reddit commentators live in another world. One in which cliche and absolutism are apparently common place.",
            "Serious question: How would one hold a government agency in contempt?  What would the consequences be?",
            "I really miss r/reddit.com  :( ",
            "The government has always been above the law.\n\nYou just noticed?",
            "CIA was always above the law.  They killed a US president and people still claim it was LHO",
            "/r/reddit.com was the best.. RIP lil buddy",
            "So if you file a freedom of information act request for documents, and are refused, and you take it to court, and the court rules that your denial is justified, what other recourse can you take? This seems like utter bullshit."
        ]
    },
    "I see what you did there, Youtube users": {
        "title": "I see what you did there, Youtube users",
        "score": 2498,
        "url": "http://imgur.com/Tp42q",
        "content": "",
        "num_comments": 168,
        "comments": [
            "If youtube users truly had a neutral response there would be no likes or dislikes because that picture means that 52000 fans hold a non-neutral viewpoint on the video. ",
            "Hundreds of thousands of people working together, the internet has officially surpassed the UN.",
            "This was submitted two fucking weeks ago. We might as well sticky it at at this point. ",
            "That is actually pretty impressive, for youtube that is.",
            "Tell my wife I said \"hi\"",
            "Scruffy's gonna die the way he lived.",
            "I immediately searched this on the youtubes, saw that things were a little off balance and proceeded to do my part.",
            "*Finds video on youtube, \"dislikes\" to keep neutral*",
            "6,362 up votes 5,637 down votes cmon guise",
            "You might not know this but YouTube users are also Reddit users & visa-versa. "
        ]
    },
    "\"Police officer pepper-spraying a kid.\"": {
        "title": "\"Police officer pepper-spraying a kid.\"",
        "score": 2936,
        "url": "http://imgur.com/V1E9i",
        "content": "",
        "num_comments": 1491,
        "comments": [
            "Before any reflexive US bashing starts, just like to point out that this happened in Brazil.",
            "Wow. What's really sad is that it looks like he's doing it as if it's an after thought, like he was on his way out and thought, \"whoops, forgot one!\"",
            "\"We've secretly replaced the silly string normally used with pepper spray.  Let's see the reaction.\"",
            "it was coming right for him!",
            "This is actually an AXE advertisement",
            "The officer doesn't really understand the true meaning of the saying \"women and children first...\"",
            "I'm a dick for laughing at this, but he just appears to be doing it so non-chalantly: \"Oh look, it's some black people.\" *SPRAY*",
            "I saw this happen in Eugene, OR several years ago.  Police decided to tear down a bunch of booths at a small local festival because they had an incorrect permit.  Booth owners tried to stop them from literally ripping the booths apart while saying they'd take them down immediately.  Not sure what happened next, but the police started pepper spraying the crowd.  The officers aimed above the crowd at kids on their parents shoulders and at the ground at kids walking around.  It was pretty fucked up.",
            "\"Hey little girl, would you like some silly string?! Okay, here you g-OHSHIT! WRONG CAN!\"",
            "He's just protecting them from the sun's harmful rays with some sunscreen."
        ]
    },
    "Oh god my mouth touched it!": {
        "title": "Oh god my mouth touched it!",
        "score": 2065,
        "url": "http://i.imgur.com/U05a0.jpg",
        "content": "",
        "num_comments": 147,
        "comments": [
            "There was always that one water fountain in the whole school where the water was nice and cold and didn't taste like ass. It was like god's fountain.",
            "Why does that thing even exist? It seems very pointless to me.",
            "There was a drinking fountain at this park I went to quite a bit as a kid. It would constantly get clogged and the basin would fill with water. I remember drinking the fucking water straight from the basin several times in this public park where homeless people frequented. Makes me gag just thinking about it. \n\nAlternatively, I have a fairly strong immune system to this day. I think of it along the lines of George Carlin's \"Never got Polio as a kid\" sketch.",
            "I hated when kids would wad up a small piece of paper and stick it in one hole causing it to shoot out farther from the other. I always got wet from them.",
            "i used to hate when the retarded kids would put their whole mouths on the    thing and suck it like a titty, fucking disgusting.",
            "I was the kid who would never leave the water fountain, OCCUPY WATER FOUNTAIN.",
            "I was one of those kids who put their cheek and everything on that metal part. Because, why not? I didn't get the plague and that fountain usually had fewer people waiting in line.",
            "So why is that thing there anyway?",
            "almost as bad as touching the end of your penis on the toilet seat.",
            "When I was little I used to put my mouth RIGHT on the spout and would suck it down! \n\n...Oh god why?"
        ]
    },
    "I used to keep this Berkeley Breathed \"Bloom County\" comic in my high school locker in the late 80s. For the record, I snorted the dandelions.": {
        "title": "I used to keep this Berkeley Breathed \"Bloom County\" comic in my high school locker in the late 80s. For the record, I snorted the dandelions.",
        "score": 1683,
        "url": "http://i.imgur.com/Z3Op2.jpg",
        "content": "",
        "num_comments": 189,
        "comments": [
            "God we had good comics in the 80s.  Billy and the Boingers forever!",
            "More skin on HBO!\n\nL.H. Puttgrass - signing off and heading for the tub.",
            "I used to have a copy of the first version of the Bill and Opus screensaver. The one where Opus shot flying toasters and Tyrannosaurus Bill Gates would chomp Bill the Cat's head off. I think the floppies went bad at some point and I've been scouring the Internet for years trying to find a copy of the original. I'm sure it's out there somewhere. I'll find it. Eventually.",
            "Right, so today Reddit has put two of the three great 80's comic strips at the top of the front page. Now we need to get the Far Side on there so the Triforce will be complete.",
            "I was not lucky enough to have a local paper that carried Bloom County, so I didn't discover it until 1990, in college. I have almost all the books, including \"A Wish for Wings that Work\".  \nWhen the movie \"Secondhand Lions\" came out, my wife and I were in the theatre, and I said, \"That HAS to be Berke Breathed's drawings!\" Yep!",
            "A boy and his penguin!",
            "Massive Bloom County fan right here. Massive. ",
            "I love when that guy - the one in the strip the OP just posted - quits smoking, and ends up in a kitchen in his underwear with a bunch of twinkies.  Also, Bill the cat and that band he and the rabbit were in.  Man, I need to refresh these memories.",
            "my gamertag was actually alf mushpie for five years, until i gave up explaining who that is. some of you might remember her as the freckled, frumpy girl who went on a date with milo. \n",
            "\"Pear Pimples for Hairy Fishnuts!\""
        ]
    }
}