{
    "Transfer Round-Up & Discussion - Summer 2024": {
        "title": "Transfer Round-Up & Discussion - Summer 2024",
        "score": 25,
        "url": "https://www.reddit.com/r/reddevils/comments/1dqy2hd/transfer_roundup_discussion_summer_2024/",
        "content": "Hi all,\n\nSummer Transfer Window 2024 is here!\n\nThe summer transfer window in Premier League will open on Friday, June 14, 2024 12:00 AM BST to Friday, August 30, 2024 11:00 PM BST.\n\nAs always, here is a run-down of the rules we have on r/reddevils for posting during transfer windows:\n\n**Daily Threads**\n\nThere will be a Transfer thread posted every single day, on a 23-hour timer, to get a different post-time every day. These threads are for everything transfer related, no limits on sources, line-up conversations, etc.\n\n**Individual posts**\n\nFrom now on, only posts **TIER 2 OR BETTER** are allowed to be posted in their own right. This helps us only keep credible sources on the subreddit.\n\nThe tier guide can be found here: [https://www.reddit.com/r/reddevils/wiki/transfer-reliability-guide](https://www.reddit.com/r/reddevils/wiki/transfer-reliability-guide)\n\nWe will make exceptions during slower days for some Tier 3 posts, and there will usually be some posts from sources not on our tier guide. We will take everything case-by-case. If you believe something to be on the sub and not a good source, please let us know.\n\n​ **Transfers IN**\n\n|Name|Position|From|Fee|\n|:-|:-|:-|:-|\n|\\-|\\-|\\-|\\-|\n\n**Transfers OUT**\n\n|Name|Position|To|Fee|\n|:-|:-|:-|:-|\n|Raphaël Varane|CB|\\-|Contract Expired|\n|Anthony Martial|ST|\\-|Contract Expired|\n|Brandon Williams|LB|\\-|Contract Expired|\n|Charlie McNeill |ST|\\-|Contract Expired|\n|Alvaro Fernandez|LB|Benfica|£5.1m+£2.6m|\n|Omari Forson|AM|Monza|Contract Expired|\n\n&#x200B;\n\nThanks",
        "num_comments": 204,
        "comments": [
            "Imagine being under 25 and having played for Ajax, Juventus, Bayern Munich and potentially Manchester United",
            "I love the De Ligt transfer rumours. Bayern fans dont want to lose him, United fans dont want him at the club.",
            "de Ligt to United -> Maguire becomes available -> Dyche spits out his worms in shock and demands Everton sign him -> Branthwaite goes to other way -> Diabolically blonde CB partnership with 200% aerial duel success rate (Licha is playing right wing now because he's just fucking class and it turns out he can do that)",
            "I keep forgetting that Mason Mount is in our team. What will be the plans for him ? Sub for Bruno /mainoo?",
            "I know everyone wants a Rodri/Kroos/Carrick type line-breaking, tempo controlling DM, but the fact is these are generational players, and even teams like Liverpool and Arsenal don't have any. Arsenal had to buy a finished Jorginho and are having to replace him this summer. I think if we get Ugarte and a proper ball playing CB to partner Licha, we'll have more than a decent team. Let's just hope Collyer can come into his own as a 6 and save us from this conversation again.",
            "De Ligt. Zerkzee. Ugarde. At least another CB, if De Ligt is in addition to someone.\n\nLiking the direction for the window so far, tbh. Think we probably are after at least another one or two players too,",
            "Im hesitant but excited about the prospect of De Ligt.",
            "Getting De Ligt, Ugarte and Zirkzee would be huge to get this summer. These players would fit under our age structure and be upgrades on what we have",
            "So De Ligt, Zirkzee, Ugarte are our most likely signings? And if Everton budge also Branthwaite?",
            "Gonna be mad funny when the Prem hands out point deductions to all these dreams doing dodgy deals because they have rules in place literally to stop this sort of thing, and the clubs are on the hook for the payments in next year's PSR calculations too"
        ]
    },
    "Daily Discussion": {
        "title": "Daily Discussion",
        "score": 9,
        "url": "https://www.reddit.com/r/reddevils/comments/1dr66yv/daily_discussion/",
        "content": "Daily discussion on Manchester United. \n\n&#x200B;\n\n**BE CIVIL**\n\nWe want /r/reddevils to be a place where anyone and everyone is welcome to discuss and enjoy the best club on earth without fear of abuse or ridicule.\n\n&#x200B;\n\n* The report button is your friend, we are way more likely to find and remove and/or ban rule breaking comments if you report them.\n* The downvote button is not a \"I disagree or don't like your statement button\", better discussion is generally had by using the upvote button more liberally and avoiding the downvote one whenever possible.\n\n**Looking for memes? Head over to** /r/memechesterunited**!**",
        "num_comments": 157,
        "comments": [
            "That Shaw - Lisando - De ligt - Dalot defence with Kobbie, Bruno, Ugarte in middle 3 in front of them would hit like crack for the 2 games theyre all fit next season",
            "Como is a way classier retirement club and environment than mls / saudi, good for him",
            "I have watched 5 mins compilation of best of Manuel Ugarte and now am an expert. AMA.",
            "Just seen that Anthony Elanga could be on his way to Newcastle. Does anyone know if there was a sell on clause added in the deal when we sold him to Forest and if so, how much of a %?",
            "u reckon our Danish lads have a chance today?",
            "Ugarte on loan with the option to buy would make a lot of sense if psg are willing to do that sort of deal. With Amrabat going we would have a spot for him even if we can't get rid of Casemiro this window.",
            "Anyone else find it ironic that we hear about chaos ball from players like Bruno and Case, and then we target Ugarte, who is very safe and tidy on the ball, but he isnt good enough because he doesnt have good progressive stats? People want a player who plays progressive passes, but also completes them 95% of the time, and thats just not a realistic expectation",
            "How much do you lot reckon we have to spend on transfers, without taking into account revenue from outgoings?",
            "This sub is so trigger happy with downvoting immediately anything they don't like. This just suppresses opinions. If you don't like someone's opinion, you can always ignore it and scroll on. \n\nJust having doubts on transfer targets has copped downvotes just down the thread.",
            "ugarte good fit for mainoo and bruno to complete our midfield 3?"
        ]
    },
    "[The Overlap] “I definitely crossed the line.” Roy Keane opens up about the moment he went too far in criticising Harry Maguire and the apology that followed": {
        "title": "[The Overlap] “I definitely crossed the line.” Roy Keane opens up about the moment he went too far in criticising Harry Maguire and the apology that followed",
        "score": 169,
        "url": "https://twitter.com/WeAreTheOverlap/status/1806979801766396129",
        "content": "",
        "num_comments": 22,
        "comments": [
            "Man to get an apology from Roy Keane of all people is a massive achievement in my books",
            "The way Harry has clawed back his standing and respect in the game is nothing short of incredible in my book. Its sad that it came to it, but a face to face apology from Roy Keane has to feel good and offer some form of vindication.",
            "Fair play, he even admitted how bruno proved him wrong after the FA cup final.",
            "roy keane  ghana mp\n\nthey werent familiar with his game",
            "Great video this one.\n\nI loved the opening chatter about down days.",
            "It's my job to apologize innit",
            "Next he'll be sitting having a pint with Jon Walters",
            "I am just gonna say this. He apologised to Harry because their mother tongues are the same. He has crossed the line regarding Bruno as well. Did he pick up the phone to apologise to him as well? And honestly I do not understand this glazing for Roy Keane in this subreddit. Yes he was an amazing player but do we all collectively forget about why he was thrown out of Man Utd.\n\nAnd what exactly does Roy Keane bring to the table as a pundit. All be talks about his passion, heart and bravery and courage. I mean give me a break. The punditry in England is bad but Roy Keane brings nothing to the table and represents the worst of them imo.",
            "Neville still hasn't apologized to Bruno for making false statements that he wanted to be subbed.\n\nGood on Keane, admitting mistakes is seldom done.",
            "I'm going to say it. Fuck Roy Keane and fuck Gary Neville, it's useless when they don't learn from these \"apologies\", and they don't give them enough for the damage they cause sometimes. Carragher and others too BTW. \n\nThey've literally run an entire campaign for over a month now against Alexander Arnold, that's even worse than what happened with Maguire and less warranted. All because they want Mainoo to start for England (*and I pray he does well*). Watch the media criticise and crush Mainoo if he doesn't perform or causes a mistake that leads to England getting knocked out. I really hope they don't mess with his development, the kid is special."
        ]
    },
    "Mary Earps on Instagram - farewell message to United fans": {
        "title": "Mary Earps on Instagram - farewell message to United fans",
        "score": 126,
        "url": "https://i.redd.it/q671k8y34i9d1.png",
        "content": "",
        "num_comments": 20,
        "comments": [
            "Really big blow but I cant really begrudge her for leaving, at least it wasnt to Arsenal this time",
            "I really hope INEOS will get someone to make sure the women's team doesn't collapse. Losing Earps after already losing Garcia and Zelem is quite a bad sign.\nThey went from being reformed in 2018 to finishing second last season and winning first silverware this year (I know we looked really bad, and still beating Chelsea in the semis is not something we can ignore). We were definitely a team on the up.",
            "FA cup win and the womens team only gets to suffer. The awards ceremony stuff too. Dont blame her its on the club",
            "Shes gone\n\nOut of my life",
            "So embarrassing that the club has forced her to leave, but she deserves the world.",
            "The worrying thing is that we have lef this last minute and we have had two players commanding world record fees that we rejected and let them both go for free, one to a rival.",
            "Sad times. If Toone goes too that's all my favourite Womens team players that have left after Russo. \n\nBig blow to lose Earps, great keeper and character.",
            "Hello darkness my old friend ",
            "\"Your club\" is very telling",
            "Im afraid well have to start from square one but Im confident well be able to rebuild from this, we got to silverware in 6 years from literally nothing, well be able to do it again - it does seem theyve been deprioritised in favour of the mens team which is a shame, but I do hope that they do get all the backing they need sooner rather than later"
        ]
    },
    "Earps departs United Women": {
        "title": "Earps departs United Women",
        "score": 73,
        "url": "https://www.manutd.com/en/news/detail/mary-earps-to-depart-man-utd-women-june-2024",
        "content": "",
        "num_comments": 39,
        "comments": [
            "United womans team are going to be left behind this season.\n\nZero momentum after the FA cup win.",
            "As much as this one sucks, I think it was inevitable, I remember hearing rumours of Earps wanting to leave a while ago. \n\nStill not a good look with 2 of our other good players leaving.",
            "It's worrying, Russo, Earps, Zelem. Along with Toone they were the core. Our new people last season didn't gel so well. We've also lost Garcia. Clinton definitely going nowhere now. But we need to sign a few on a free. Maybe even Lucy bronze for a statement if nothing else.\nBut definitely reinforcements up top. At this rate we'll be lucky to get 4th",
            "Obviously.\n\nClubs *so* shit on the womens side, they got to the situation where the best keeper in the game walked out the club.",
            "Have to be honest here. She really is VERY overrated. Her attitude and the whole England goalkeeping shirt controversy with Nike put her on the map. She really isnt THAT amazing",
            "Her head was turned last summer and it meant her heart wasn't in it this season, with her form dropping. Very telling that the only club interested in signing her was PSG considering she is meant to be the worlds best. Claims she wants to win trophies but Lyon basically dominate France. We offered the same wages but she wasn't interested.\n\nI'm glad the drama is finally over.",
            "Terrible losing yet another big name, but think we've had her at the peak of her powers and the decline has started so don't mind moving on from Mearps.",
            "Just disband the women's team at this point. The backlash and bad pr we will get for dealing with women's team like this is not worth it.",
            "Gutted. Best of luck to her though.",
            "My daughters favourite player along with Toone. She will be heartbroken"
        ]
    }
}