{
    "PSA: Please remember to censor usernames and subreddit names": {
        "title": "PSA: Please remember to censor usernames and subreddit names",
        "score": 39,
        "url": "https://www.reddit.com/r/redditmoment/comments/18lkq4g/psa_please_remember_to_censor_usernames_and/",
        "content": "A lot of posts and comments get removed because OP forgot to censor the subreddit name and/or username (INCLUDING THEIR OWN). \n\nIt's easily the top removal reason in this subreddit.\n\nWe enforce this rule to avoid harassing other users and/or breaking the moderator code of conduct when it comes to [brigading](https://www.redditinc.com/policies/moderator-code-of-conduct) (Rule 3).",
        "num_comments": 32,
        "comments": [
            "I can understand censoring other names but why do we need to censor our own names?",
            "To be honest the censoring is pretty much useless. \n\nIf someone really wants to know which sub and user, they'll find out. Be it by searching OP's profile or typing the post/comment in the search bar and selecting posts/comments. \n\nIt's ridiculously easy.",
            "Excuse my ignorance, I'm new to this site but not new to commenting on boxing, etc. But I don't know what OP means. On my end what am I supposed to do to not get removed? Can someone please explain 🤷‍♀️ 🙄",
            "You should also make it so that it had to be something the poster didnt interact with or readers can just search poster's profile",
            "Yes, the last thing you would want is for people to know which subreddits are stupid or doing crappy things.",
            "To make it harder to figure out who the original users really are.\n\nWe could ask for censoring profile pictures and sub icons but it's already hard enough to censor usernames and subreddit names.",
            "It makes it measurably harder. There are plenty of users in the comments asking OP what sub they found it in or asking for a link. \n\nWe just want to minimize the potential of harassment that could happen.",
            "OP means Original Poster. In this case, I am the OP (there is also a blue OP next to my username)\n\nYou need to censor any visible usernames and subreddit names so that your post isn't removed.",
            "I imagine that this would be a lot of extra work for us mods.\n\nDo you perhaps have an idea on how we could implement this without needing to look at OP's profile?",
            "The last thing that we want is our subreddit getting banned because the users here are brigaditg the other subs and harassing the moderators and users there."
        ]
    },
    "Re-introducing temp bans for breaking rule 3 (No personal information)": {
        "title": "Re-introducing temp bans for breaking rule 3 (No personal information)",
        "score": 23,
        "url": "https://www.reddit.com/r/redditmoment/comments/1ashjcj/reintroducing_temp_bans_for_breaking_rule_3_no/",
        "content": "In order to cut down on people not censoring their posts properly, we'll be re-introducing the action of banning the OP for 1-3 days. This also applies for comments where people just straight up mention the subreddit or user in question.\n\nA reminder of the contents of rule 3:\n\n* Usernames (INCLUDING YOU OWN)\n* Subreddit names\n* Other personal information (Twitter handles, Instagram usernames, YouTube Channel names etc.)\n* Do not link posts or mention subreddits or users\n\nTruly an 1984 redditmoment, am I right?\n\n&#x200B;\n\n[The amogus is canon, look it up.](https://preview.redd.it/yfolf6z630jc1.png?width=1222&format=png&auto=webp&s=553a89f952adf5ea37eec5b0dcbf687b4a68c63b)",
        "num_comments": 16,
        "comments": [
            "Why your own username though? Knowing who the poster is in their own screenshots causes less confusion.",
            "Makes sense. W change I guess",
            "where amogus",
            "Reddit Mod Moment",
            "Even the subredit? I mean, c'mon...",
            "I don't understand this rule with subreddit names? I kinda get the usernames ig but the subreddit? Why?",
            "We had this discussion in another thread already: https://www.reddit.com/r/redditmoment/s/hydJFENSKl",
            "If it’s Op’s profile, you can click them and scroll through their comment history to find the fight.",
            "look at the floor in the pic",
            "Truly one of the reddiest mod moments, Keanu chungus"
        ]
    },
    "Kpoo Bad 😡": {
        "title": "Kpoo Bad 😡",
        "score": 119,
        "url": "https://i.redd.it/k84up5f0xd9d1.png",
        "content": "",
        "num_comments": 34,
        "comments": [
            "No jokes allowed",
            "This post itself is a certified r/redditmoment",
            "It’s called satire…",
            "hey doc\n\ni like kpop\n\nkpop, more like, kpoop\n\ns",
            "I don't think this sub would like this joke very much if it had been other types of music than K-pop",
            "r/redditmoment users when someone tells a joke 😡😡😡😡😡",
            "Death is too lenient.",
            "This is a reddit moment post. Jesus lmao.",
            "As a k pop listener I choose death",
            "kpop is bad"
        ]
    },
    "Satire bad": {
        "title": "Satire bad",
        "score": 51,
        "url": "https://i.redd.it/i0kft1bi1f9d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Kpoop",
            "Why does guy have a long pole piercing his crotch",
            "Redditors after going to /shitposting and seeing shitposts",
            "I notice the engagement dwindling at this becomes more meta.",
            "LETS GO PROPER FLAIR USAGE",
            "Damn man that meme was epic, I love internet humor in the current year 2016",
            "kpop is bad circlejerking is sooooo funny guys. haha funny satire",
            "Kpoop",
            "that’s just how big he is",
            "Tbf its funnier to make fun of the stans."
        ]
    },
    "truly a moment": {
        "title": "truly a moment",
        "score": 202,
        "url": "https://i.redd.it/4p7o5j9kh69d1.jpeg",
        "content": "",
        "num_comments": 39,
        "comments": [
            "Eh, tbh the \"I'm right but I'm not going to explain it\" it pretty annoying ( and a very Redditor thing to do), as dumb as the OG's take is",
            "ok but if you have the correct opinion then defend it like",
            "For the answer being \"so obvious,\" I'm surprised nobody has said it. The only reddit moment here are the hashtags.",
            "\"you're why shampoo has instructions\" is the best comeback I've seen in ages, I've got to remember that one.",
            "i literally just woke up and was so confused as to why a speaker (the device) would be able to prevent suicide by jumping",
            "Would you ask someone who had cancer, advice on how to deal with that? Even if they died from cancer, they still had advice that may have helped them. \n\nThe best advice is from those who actually understand what you are dealing with.",
            "INFO: did the jumper *survive* or did they just leave behind a bunch of suicide prevention advice after they died?",
            "If they committed suicide *after* giving advice, then this is actually a fair opinion. If he spoke against suicide after trying to kill himself, then yeah, this is dumb. \n\nThough the second guy refusing to defend his own statement with logic or reasoning is irritating as well.",
            "Because the speaker knows what is was like, and they are explaining ways to get through it?",
            "I mean....\n\nHe's kinda right though? Am I missing something?"
        ]
    }
}