{
    "Want to find a certain episode? A certain RLM scene? Ask here! Volume Fifteen": {
        "title": "Want to find a certain episode? A certain RLM scene? Ask here! Volume Fifteen",
        "score": 24,
        "url": "https://www.reddit.com/r/RedLetterMedia/comments/1djrr25/want_to_find_a_certain_episode_a_certain_rlm/",
        "content": "**This post will be on the sidebar, labeled \"*Want to find a certain RedLetterMedia video?*\" or in the top menu link, labeled \"*RLM Video Questions?*\" (depending on which version of Reddit you use, https://old.reddit.com or https://new.reddit.com)**\n\n**It will also be \"pinned\" to the top of the sub as often as it makes sense (depends on other posts to be pinned, like new RLM videos, etc.)**\n\nThere was an increase in personal threads with single answer questions where people ask to find RLM episodes where something specific happened they remember.  Stuff like: \"What episode did Mike/Jay/Rich say/do *x* and *y*?\" and so on.\n\nSince these are just single answer questions, they fit better in a thread like this one since they aren't really discussion threads open for everyone to participate in.\n\nThe thread will be \"sorted by new\" so new questions get to be at the top and easily located to be answered more quickly.\n\n[And please stay on topic, you frauds.](https://i.imgur.com/CVHGZiX.gif)\n\nHere are the older versions of this post:\n\n* [^**Volume** ^**I** ](https://www.reddit.com/r/RedLetterMedia/comments/8576i2/want_to_find_a_certain_episode_a_certain_rlm/?sort=new)\n\n* [^**Volume** ^**II** ](https://www.reddit.com/r/RedLetterMedia/comments/9fqx1b/want_to_find_a_certain_episode_a_certain_rlm/?sort=new) \n\n* [^**Volume** ^**III** ](https://www.reddit.com/r/RedLetterMedia/comments/b0p6ls/want_to_find_a_certain_episode_a_certain_rlm/?sort=new)\n\n* [^**Volume** ^**IV** ](https://www.reddit.com/r/RedLetterMedia/comments/d43in0/want_to_find_a_certain_episode_a_certain_rlm/?sort=new)\n\n* [^**Volume** ^**V** ](https://www.reddit.com/r/RedLetterMedia/comments/fkpbpn/want_to_find_a_certain_episode_a_certain_rlm/?sort=new)\n\n* [^**Volume** ^**VI** ](https://www.reddit.com/r/RedLetterMedia/comments/hyvlqm/want_to_find_a_certain_episode_a_certain_rlm/?sort=new)\n\n* [^**Volume** ^**VII** ](https://www.reddit.com/r/RedLetterMedia/comments/l3nq04/want_to_find_a_certain_episode_a_certain_rlm/?sort=new)\n\n* [^**Volume** ^**VIII** ](https://www.reddit.com/r/RedLetterMedia/comments/opyfy2/want_to_find_a_certain_episode_a_certain_rlm/?sort=new)\n\n* [^**Volume** ^**IX** ](https://www.reddit.com/r/RedLetterMedia/comments/zrl9t8/want_to_find_a_certain_episode_a_certain_rlm/)\n\n* [^**Volume** ^**X** ](https://www.reddit.com/r/RedLetterMedia/comments/11t2583/want_to_find_a_certain_episode_a_certain_rlm/)\n\n* [^**Volume** ^**Eleven** ](https://www.reddit.com/r/RedLetterMedia/comments/14aw9kz/want_to_find_a_certain_episode_a_certain_rlm/)\n\n* [^**Volume** ^**Twelve** ](https://www.reddit.com/r/RedLetterMedia/comments/163gbug/want_to_find_a_certain_episode_a_certain_rlm/)\n\n* [^**Volume** ^**Thirteen** ](https://www.reddit.com/r/RedLetterMedia/comments/17ssjiv/want_to_find_a_certain_episode_a_certain_rlm/)\n\n* [^**Volume** ^**Fourteen** ](https://www.reddit.com/r/RedLetterMedia/comments/1b73sfc/want_to_find_a_certain_episode_a_certain_rlm/)\n\n#[You could also try searching on VideoMentions.com](https://videomentions.com/search)",
        "num_comments": 43,
        "comments": [
            "That episode where mike is speaking with the guest star. He just keeps changing his mind about whether it is going to genre battle or black spine. I don't even know whether it was a black spine or some other episode",
            "It was a behind the scenes moment. Rich is on the floor building something , IIRC Mike asked him how he was doing.  He said he was ok, and fine with things just being ok, as opposed to 'good'. I just loved what he said, and can't find it.",
            "I'm looking for a video that was on a BOTW/WOTW where a woman is talking to a child and seems to always mouth along to whatever the child is saying... almost like she's predicting what the kid is going to say and subtley/subconsciously lip synching along to what the kid is saying. I know this is highly specific. I wanna say it was a classroom/anti-bullying video? Maybe the one with the green bear mascot?\n\nI am just trying to show my partner that this is a thing some people do subconsciously and that's the only example I can think of off the top of my head.",
            "The hitb where Mike shits on modern Will Ferrell",
            "theres one that this guy busts in on his gf or wife cheating on him and he screams YOU FUCKERS i know its on BOTW",
            "what's the one where some woman in a movie says something like \"don't touch me, you snake-squeezer!\"",
            "What episode is that one moment where Mike tells rich he looks like he's waiting at the dentists office",
            "I think this was recent but I can't seem to find it:\n\nWhat is the video where Mike contemplates about the abuse / uncarefulness of the movie props / memorabilia in their posessions. Mike then says that they won't feature such abuse / uncarefulness in future videos eventhough they probably won't baby the props IRL.\n\nAm I imagining this?",
            "Not sure whether it was HITB or BotW, but I recall them talking about one of the found footage horror movies from the V/H/S series. I think it may have been V/H/S/94? It may have just been a quick aside in one of their videos.",
            "[deleted]"
        ]
    },
    "The June RLM watch party!": {
        "title": "The June RLM watch party!",
        "score": 37,
        "url": "https://www.reddit.com/r/RedLetterMedia/comments/1dnd4hw/the_june_rlm_watch_party/",
        "content": "Come on party people WHAT WHAT!! This Sunday the Redlettermedia streaming party is back for your viewing enjoyment? Yes, let's go with that.\n\nWhat the hell is that and why the hell are you seeing this? It's a thing where we get together each month and watch terrible movies seen in RLM shows while heckling mercilessly. \n\nThis month we're going to watch R.O.T.O.R., Strike (with Frank Zagarino) and The Terror Within starring the ever dreamy George Kennedy.\n\n\\*\\*WHEN: Sunday June 30 at 2 pm Eastern Time.\\*\\*\n\n\\*\\*WHERE:\\*\\* [https://cytu.be/r/rlmshittymoviesgalore](https://cytu.be/r/rlmshittymoviesgalore)\n\n\\*\\*WHY: Because we hate ourselves\\*\\*\n\n[Click here for a handy countdown timer thing](https://www.timeanddate.com/countdown/party?iso=20240630T14&p0=2222&msg=The+RLM+June+watchparty&font=hand)",
        "num_comments": 11,
        "comments": [
            "I'm very much down for this.",
            "Sounds rad",
            "Nice, I'll see that I can make it. \nBless you, zorbz, you're doing the lord's work here , or something",
            "One of these days I'll be able to make one of these watch parties :(. Here is hoping for July.",
            ">*Sunday June 30 at 2 pm Eastern Time*\n\n![gif](giphy|f0w8pEIIDKltC|downsized)",
            "Very cool.",
            "I clapped!",
            "Will there be a chat?",
            "I am wondering, from what platform the video is going to be sourced during the watch party? \n\nI recently watched a movie that deserves to be in 'so bad is good category' and kinda wanted to suggest it for possible future watch party.",
            "Looking forward to having you back!"
        ]
    },
    "This is the movie that will save theaters": {
        "title": "This is the movie that will save theaters",
        "score": 384,
        "url": "https://i.redd.it/37z5yvwe8e9d1.jpeg",
        "content": "",
        "num_comments": 75,
        "comments": [
            "![gif](giphy|Pc16mmoHoXBh6)",
            "Is that....Jean Reno?",
            "![gif](giphy|J8BtevWhCjowU)",
            "I would be fine with Léon and a tiny suited man putting all of the butts in seats.",
            "https://preview.redd.it/umtmr7awpe9d1.jpeg?width=784&format=pjpg&auto=webp&s=42a8239cd237f48de3008aa2b87829a4abb76f45",
            "I love penguins. I want a penguin friend.",
            "Hell yeah.",
            "I don't believe a human and a penguin can be true friends. Prove me wrong, movie! Prove. Me. Wrong.",
            "Too bad because I'm just going to watch it on my fucking phone\n\n\nEdit-I hope this is a penguin suicide video",
            "My Penguin Friend\n\nMy Octopus Teacher\n\nMy Ocelot Mechanic\n\nMy Wombat Dentist"
        ]
    },
    "Thought this was worth sharing as they have mentioned the ratio of sequels to original ideas in a couple of their more recent videos, this is sort of just putting things into a visual if you were curious like me.": {
        "title": "Thought this was worth sharing as they have mentioned the ratio of sequels to original ideas in a couple of their more recent videos, this is sort of just putting things into a visual if you were curious like me.",
        "score": 116,
        "url": "https://i.redd.it/cw3zmm3uxc9d1.jpeg",
        "content": "",
        "num_comments": 52,
        "comments": [
            "when will we get the Rain Man cinematic universe",
            "Looking at about a third being sequels or based on existing IPs, you can see the very early stages of the sequel pattern really emerging in the bottom half I think. Obviously being just top 3 grossing per year not a perfect example of what was being released but again, just a graphic to sort of visualize it and see what Jay is talking about when he mentions the sequels really starting to get more frequent in the late 80s and early 90s (if I am quoting him correctly)",
            "1987 sure was a year for that particular fake graffiti font.",
            "Spielberg and Lucas dominated the 80s",
            "My biggest take from this is how they don't really make big budget family friendly movies anymore. Can you imagine a movie like Home Alone coming out today with an original score by John Williams?",
            "89’ went crazy",
            "The one I think they're missing is Three Men and a Baby, which I believe was number one for 1987. Only know that because it's such a strange movie to have been the number one box office draw (Not to mention the obvious Star Trek connection with the director) \n\nAlso, so many best picture nominees and winners in this group. A trend that largely evaporated for most of the '90s, 00s, and 10s, only recently have top box office draws also been best picture contenders",
            "So 88 the only year with no sequels",
            "Even as a kid I remember thinking \"Octopussy? Really? We are just going to let them get away with that?  Ok.\"",
            "I don't think this is entirely correct. I know that Terms of Endearment was the second highest grossing movie of 1983, for one."
        ]
    },
    "Check out the treasure trove this person ended up with for free!": {
        "title": "Check out the treasure trove this person ended up with for free!",
        "score": 46,
        "url": "https://www.reddit.com/gallery/1dqw1b2",
        "content": "",
        "num_comments": 22,
        "comments": [
            "The Tomb!!",
            "Holy shit, it’s the Chooper!",
            "![gif](giphy|8Bl3SjflccGmFca23S)",
            "One mans’s treasure is another man’s garbage pile.",
            "Ahh, Howling 2. One of the most what the fuck sequels ever made.",
            "Damn that’s a great haul and free to boot. Nice!",
            "I hope one of those tapes has the I interview between Jimminy Glock and Jar Jar Binks that exists and I didnt fabricate during an alcohol fueled delirum",
            "The Life Aquatic on VHS? Lots of great finds in this photo.",
            "I was at a goodwill-type store the other day. Their DVD rack was like $2-$5 per.\n\nBut they also had a box of VHS tapes, and *those* were up to $20 each. For no reason. Same movies on an older format. Why",
            "Sideways is my favorite movie of all time"
        ]
    }
}