{
    "RESULTS of 2023 Census": {
        "title": "RESULTS of 2023 Census",
        "score": 521,
        "url": "https://www.reddit.com/r/redscarepod/comments/187xgk5/results_of_2023_census/",
        "content": "Hello...... firstly sorry for the delay - I'm a lover, fighter, worker, mensch... things get in the way... things reached for among the stars and things grasped from in the gutter... but it's here now.\n\nRegarding the lists, the letterboxd and Spotify general recs lists are there and ready. The niche recs letterboxd list is there... but I decided to add all recs and then cut it down (stupid) and so some laughably un-niche films have slipped through which I will come back to when I have more time and cull. The niche Spotify list is barebones and effectively a placeholder, but I will eventually add them all on... let's say before Christmas. So, like or bookmark or whatever you want if you're interested, they will in the end be what they should be.\n\nI lifted the bar for the niche films from 10k to 20k, and the niche Spotify list from 10k to 30k. I think 10k was fair with movies but wanted people to get more of their faves in, but on music yeah I was wildly out, I listen to a lot of continental stuff from the 80s that never did anything at the time let alone now, 10k seemed generous but obviously wasn't.\n\n[Letterboxd general recs](https://boxd.it/pWHNs)\n\n[Letterboxd 'niche' recs](https://boxd.it/qbYxQ) (anything over 20k will be removed in the next few weeks)\n\n(shoutout to the users who recced 'Trans-Europ-Express', 'The Night of Counting Years', 'The Chess Players', and 'Belle de Jour or Freddy got Fingered')\n\n[Spotify general recs](https://open.spotify.com/playlist/01RezE1n2fRVGjPFM5p080?si=1a422548447a4719)\n\n[Spotify 'niche' recs](https://open.spotify.com/playlist/7ql9jY39SiDTR9DH4S3Cmy?si=c5d147c1891e463d) (literally at this point a placeholder, come back in a month lol)\n\nBook recs and 'last messages to the sub' I was looking to put into a pastebin but as it's gone 'woke' it no longer allows slurs to be posted, which of course, being the sub, people peppered their replies with... so I went with this ControlC\n\n[Au Revoir, r/rsp](https://controlc.com/d19e6f07)\n\n[r/rsp 2023 Lit Recs](https://controlc.com/2caa6710)\n\nThere are a few glaring omissions when it comes to questions, but then there is every year. Eventually, the ideal census format will be reached, but perhaps not by me...\n\n[2020 results](https://www.reddit.com/r/redscarepod/comments/hmif5o/results_of_that_rredscarepod_poll_from_the_other/)\n\n[2021 results](https://www.reddit.com/r/redscarepod/comments/oxaiq0/results_of_sub_census/)\n\n2022 results... don't exist.\n\n[The Google Sheet with all of the data on, for the sub's nerds...](https://docs.google.com/spreadsheets/d/1bKj5KX3GjOfZNHUOiV6Ry5iKOMu-tyS92jc2VtA7j4Y/edit?usp=sharing)\n\nNow, on to the actual census results...\n\n*Section 1: The Essentials*\n\n**[Gender](https://i.imgur.com/pROGYzB.png):**\n\n* Cis Man: 70.6% (3,117) \n* Trans Man: 0.3% (12)\n* Cis Woman: 25.1% (1107)\n* Trans Woman: 1.9% (83)\n* Non-Binary: 1.1% (49)\n\n**[Age](https://i.imgur.com/Y3QFIbx.png):**\n\n* Under 18: 2.3% (100)\n* 18-21: 14.3% (631)\n* 22-26: 36.1% (1594)\n* 27-33: 35.1% (1551)\n* 34-40: 9.9% (435)\n* 40-50: 1.8% (81)\n* 50+: 0.5% (23)\n\n**[Sexuality](https://i.imgur.com/f2XMAsg.png):**\n\n* Straight Man 55.4% (2,444)\n* Bisexual Man 10.3% (453)\n* Homosexual Man 5.7% (253)\n* Asexual Man 0.5% (22)\n* Straight Woman 15.7% (693)\n* Bisexual Woman 8.7% (383)\n* Homosexual Woman 2.5% (109)\n* Asexual Woman 0.5% (21)\n* I'm nonbinary and annoyed you bothered to list me under gender but not sexuality 0.8% (37)\n\n**[Relationship Status](https://i.imgur.com/QtfQT8B.png):**\n\n* Single – normie: 37.1% (1636)\n* Single – Incel: 13.5% (598) \n* In A Casual Relationship: 7.7% (341)\n* In a Committed Relationship: 30.4% (1343)\n* Married: 11.3% (497)\n\n*Section 2: Sub valour*\n\n**[I’ve been on the sub since…](https://i.imgur.com/fohkswp.png):**\n\n* 2018: 6.5% (285)\n* 2019: 14.1% (623)\n* 2020: 25.3% (1117)\n* 2021: 23.9% (1056)\n* 2022: 19.9% (879)\n* 2023: 10.3% (455)\n\n**[I’m on the sub:](https://i.imgur.com/pqnzraT.png)**\n\n* Actively Posting: 12.5% (554)\n* More Inactive than Active: 25.5% (1124)\n* Consistently Lurking: 54.9% (2423)\n* Lurking with aspirations to be the main character: 7.1% (314)\n\n**[I came to the sub from…](https://i.imgur.com/Lwy6PiR.png)**\n\n* Girls' twitter presence: 24.6% (1084)\n* Sailor socialism vid: 7.1% (313)\n* Cumtown: 25.1% (1110)\n* Chapo: 10.4% (460)\n* Reddit algorithm: 22.1% (976)\n* Media articles/coverage/outrage at A&D: 10.7% (472)\n\n**[Sub is](https://i.imgur.com/8oytRqi.png):**\n\n* Dead: 9.2% (405)\n* Dying: 17.3% (764)\n* Good Days, Bad Days…: 59.4% (2621)\n* Healthy: 9.6% (425)\n* Thriving: 4.5% (200)\n\n**[Anna or Dasha?](https://i.imgur.com/BpFXhZu.png)**\n\n* Anna: 41.8% (1845)\n* Dasha: 58.2% (2570)\n\n[Just gonna link to the results for 'How Important is the Sub to You' here...](https://i.imgur.com/ZkVdQ3y.png)\n\n*Section 3: Sub Social & Political*\n\n**[Posting from:](https://i.imgur.com/gFd8rz3.png)**\n\n* USA: 60.3% (2664)\n* Non-US North America: 8.6% (379)\n* South America: 1% (44)\n* Europe: 20.4% (899)\n* Middle East 0.8%: (34)\n* Africa 0.4%: (17)\n* East Asia: 0.7% (31)\n* South Asia: 0.5% (21)\n* Australasia: 7.2% (319)\n\n**[Your personal proximity to 'the scene'](https://i.imgur.com/089KZIl.png):**\n\n* Literal Actual Dimes Square: 1.5% (66)\n* New York: 8.6% (378)\n* Another US City's Equivalent Scene: 6.6% (290)\n* US Urban: 23.6% (1042)\n* US Suburban: 15.5% (685)\n* US Rural: 6.3% (278)\n* Non-US City's Equivalent Scene: 6.1% (269)\n* Non-US Urban: 20.6% (910)\n* Non-US Suburban: 7.6% (335)\n* Non-US Rural: 3.7% (162)\n\n**[Political Opinion](https://i.imgur.com/Zt3Ihwe.png):**\n\n* Far-Left: 20.6% (909)\n* Left: 30.6% (1351)\n* Centre-Left: 22.3% (983)\n* Centre: 9.7% (430)\n* Centre-Right: 8.5% (374)\n* Right: 3.8% (167)\n* Far-Right: 4.6% (201)\n\n**[Political Compass](https://i.imgur.com/wNNC9fz.png):**\n\n* Lib Left: 46.2% (2039)\n* Auth Left: 30.1% (1327)\n* Lib Right: 15.6% (690)\n* Right: 8.1% (359)\n\n**[Trump is…](https://i.imgur.com/RpNVd6s.png):**\n\n* Cooked: 41.9% (1851)\n* Cooking: 58.1% (2564)\n\n**[On that note, in 2024, the winner will be:](https://i.imgur.com/VsFIwal.png)**\n\n* Biden: 37.2% (1605)\n* Trump: 35% (1510)\n* Bernie: 5.7% (245)\n* 2nd Gen Brahmin-caste candidate for either party: 22.2% (956)\n\n**[Do you think America is in terminal decline? \\(i.e., no election / main party platform will change this\\)](https://i.imgur.com/0djNExv.png):**\n\n* American – Yes: 45.8% (1999)\n* American – No: 16.9% (738)\n* Non-American – Yes: 26.6% (1160)\n* Non-American – No: 10.8% (472)\n\n**[Who will emerge from their CIA safehouse first?](https://i.imgur.com/3Y1yruR.png)**\n\n* Virgil: 33.4% (1476 )\n* Amber: 66.6% (2939)\n\n*Section 4: The character of your soul*\n\n**[Have you ever been in love?](https://i.imgur.com/wObvZ4q.png)**\n\n* Yes: 73.7% (3254)\n* No: 15.3% (675)\n* I Don’t Know: 11% (486)\n\n**[Do you believe in 'true love' / 'love at first sight'?](https://i.imgur.com/6iVRfCZ.png)**\n\n* Yes: 49.6% (2190)\n* No: 30.8% (1359)\n* I Don’t Know: 19.6% (866)\n\n**[Have you ever paid for OnlyFans?](https://i.imgur.com/UBcGfxh.png)**\n\n* Yes: 12.5% (553)\n* No: 87.5% (3862)\n\n**[Have you ever paid for sex irl](https://i.imgur.com/dmiiRKk.png)?**\n\n* Yes: 5.4% (238)\n* No: 94.6% (4177)\n\n**[Have you ever sold sex \\(irl or online\\)](https://i.imgur.com/IXIBXJQ.png):**\n\n* Man – Yes: 2.7% (120)\n* Man – No: 69.7% (3078)\n* Woman – Yes: 2.7% (121)\n* Woman – No: 24.8% (1096)\n\n**[Have you ever cheated on a partner?](https://i.imgur.com/KvI2kYg.png)**\n\n* Yes: 20% (881)\n* No: 67.2% (2968)\n* Never Dated: 12.8% (566)\n\n**[Have you ever been cheated on?](https://i.imgur.com/NM97b9r.png)**\n\n* Yes: 27% (1194)\n* No: 60.2% (2658)\n* Never Dated: 12.8% (563)\n\n**[Do others consider you to be attractive?](https://i.imgur.com/h4bbLtd.png)**\n\n* Yes: 80% (3532)\n* No: 20% (883)\n\n**[Do you make art? Paint/draw/sculpt/write fiction/play or write music... or... you get the idea anything along these lines:](https://i.imgur.com/GwzGi65.png)**\n\n* Yes: 67.3% (2972)\n* No: 32.7% (1443)\n\n**[Do you like to travel?](https://i.imgur.com/EInEGWh.png)**\n\n* Yes – domestically: 17.2% (760)\n* Yes - domestically + internationally: 67.7% (2989)\n* No: 15.1% (666)\n\n**[Is your work](https://i.imgur.com/UK91bZO.png):**\n\n* White-collar: 50.5% (2229)\n* Blue-collar: 15.9% (703)\n* Still in education:  26.7% (1177)\n* NEET: 6.9% (306)\n\nNot going to bother typing out the almost identical astrology results BUT the sub is 9.2% Virgo as the largest sign, and 7.2% Capricorn, which is the smallest sign.\n\nScorpio is the fave sign not your own 11.3%. Least favourite is Cancer (duh).\n\n[Your Signs](https://i.imgur.com/CVDZMKY.png)\n\n[Fave Sign Not Your Own](https://i.imgur.com/g7oPasa.png)\n\n[Least Liked Sign Not Your Own](https://i.imgur.com/ZZG2ttr.png)\n\nApologies again for the delay getting it out and not 100%, simply don't have time rn and it was a lot more work than previous ones. It was either I submit it to the sub tonight 80% done and with not much commentary, or mid-Dec as I'm working late tomorrow, working Sat, and off on holiday Sun. It'll get polished and finished when I'm back.\n\nI actually forgot to do the survey myself so my grubby fingerprints aren't in any of the results or list, oops. Watch [Boris Godunov](https://letterboxd.com/film/boris-godounov/) and listen to [Martin Dupont](https://open.spotify.com/track/4onSUYnyxN8KMvWxZi2XJq?si=6714c5aaabb14310)... or watch/listen to [Mylène Farmer - Libertine](https://www.youtube.com/watch?v=oGFr_NcKyfo), I guess.",
        "num_comments": 220,
        "comments": [
            "[Post face](https://imgur.com/a/x90Ofmo)",
            "shout out to the three other cis women who came here via Cumtown!",
            "Confirmed official Cum Town subreddit",
            "How do we have more bisexual men than gays\n\n>Consistently Lurking: 54.9% (2423)\n\nEach of us has our own FBI agent on this sub and 17.79% of those FBI agents have their own FBI agents",
            "That 12.5% paying for OnlyFans is genuinely astonishing. Who are you people",
            "Skewed, men love surveys",
            "Another defeat for the Anna party. Also my form says I've paid for OF even though I never have. So either there was a mistake or I felt like mildly lying that day.",
            "Gender and sexuality breakdown is bleak.",
            "[deleted]",
            "12 trans men posting here is so funny to me and I don't know why."
        ]
    },
    "Summer Dress Sadness": {
        "title": "Summer Dress Sadness",
        "score": 37,
        "url": "https://www.patreon.com/posts/summer-dress-106389045",
        "content": "",
        "num_comments": 47,
        "comments": [
            "\"She got the Fontana ten. The John Fantano ten\"",
            "Did you guys catch Anna emphasizing she's not a single mom? Lol",
            "Ok who’s dashas bf",
            "So jealous of Dasha lying in bed all day",
            "save me new red scare episode",
            "Just lol that these bitches do a daytime ep and can’t stop talking about the weather. Literally cats 🐈‍⬛ confronted with a laser pointer",
            "Loved the Didion and Babitz talk at the end. More literature talk! And not just alt lit and auto fiction plz 🙏 Fun ep",
            "is Dasha’s boyfriend still Matthew? I can’t keep up with this BEEPs love life",
            "They spent far too long talking about Twitter likes",
            "ah these broads arent so bad"
        ]
    },
    "Whoever psy-oped women into thinking this is an improvement deserves a special place in hell": {
        "title": "Whoever psy-oped women into thinking this is an improvement deserves a special place in hell",
        "score": 493,
        "url": "https://i.redd.it/xook0ff7a08d1.jpeg",
        "content": "",
        "num_comments": 73,
        "comments": [
            "how to look like a britbong step 1",
            "everyone wants to look like a Miami real estate agent",
            "I can't describe how insanely british/irish she looks in the second pic, she genuinely looks so familiar..like the girls i went to secondary school with",
            "her lips are so similar to her skin tone in the righthand photo. the contrast between her pale skin and reddish lips in the lefthand photo is so much better",
            "idk the mismatch in the face/chest complexion in pic one is weird",
            "Are we really doing this makeup in 2024? It is so harsh and takes away all that is sweet and individual and pretty",
            "British",
            "it's funny how this sub and billy graham both believe gay men are going to hell for different reasons",
            "After another year or two of frying my brain with drugs, i intend to seduce these women with coke, and introduce them to a spiritual lifestyle. After amassing a sufficient number, I will enact my get rich quick scheme. With the capital I’ve gained, I will move to an epicenter of sin such as Miami, and become a Manson-esque figure, and eliminate those who i believe are responsible for the spiritual degradation. Obviously, I won’t be successful, and will end dead or in jail for life, alongside my followers, but the fear my actions bring will result in a movement to return society to more conventional, conservative values. ",
            "It was a woman"
        ]
    },
    "when did india get so fat": {
        "title": "when did india get so fat",
        "score": 52,
        "url": "https://www.reddit.com/r/redscarepod/comments/1dlsokg/when_did_india_get_so_fat/",
        "content": "for context i am indian american and i am in mumbai for the first time since i was 5 years old on an internship program w my college. something that has blown me away is how overweight everyone here is - majority of my coworkers are moderately obese, and while the levels of fatness are not the same as they are in america in day to day life it’s still way more than i expected. it definitely seems class based too lol the rich and middle class here are definitely fatter than poor people in some old school aristocratic way, which is odd to see as an american because it’s kind of the opposite way over there. Has this always been a thing? is american food culture eventually going to give the entire world diabetes?",
        "num_comments": 38,
        "comments": [
            "The first thing people will spend money on when affluence comes is more food, and Indian food has always been calorific in small portions. Now it's calorific in large portions. The celebrations in a deeply competitive society keep expanding; the frequency, the size, the portions, etc.\n\nFunny thing you've probably heard yourself: western Indian liberals have leaned heavily into epigenetics so now the reason their hyper dense calorific meals are making them fat in Delhi or LA or London is because of famines under the British on the other side of the subcontinent, suffered by another ethnic group.",
            "India has the lowest grip strength of any country in the world. Which means really low lean muscle mass. Partly why they do so poorly at the Olympics despite the size of the country.",
            "they did the feedful",
            "Carb heavy food, no time to exercise because working over time (without pay) is normalized, extreme heat and no walkable spaces- less walking, influx of processed food, protein not at all prioritized in diet etcetc.",
            "Double carbing every meal with rice and bread, gluttony after coming from scarcity",
            "The new golden billion will be those with a sub-25 BMI in due time",
            "In England Indians are the fattest demographic. ",
            "hey a crossover episode",
            "I heard ingredients changed in India.. lots of ultra processed foods now. Seed oils instead of ghee, refined sugars, sodium, starches. Plus, simply eating too much and not getting enough exercise.",
            "Ghee"
        ]
    },
    "Someone close I know worked as a SNL intern, here are some stories.": {
        "title": "Someone close I know worked as a SNL intern, here are some stories.",
        "score": 514,
        "url": "https://www.reddit.com/r/redscarepod/comments/1dlf1mi/someone_close_i_know_worked_as_a_snl_intern_here/",
        "content": "I know someone who worked as an SNL writing intern this spring. its more hierarchical than I thought it would be here is what they told me:\n\n1. **Isolated Break Room**: Interns have their own break room, completely separate from the main cast audience hall. They can only watch the live show from there unless they’re called upon for tasks, mid show.\n2. **After Party Segregation**: They can attend the after parties but are walled off by red velvet ropes in a separate space. They can watch the main cast members, producers, and host celebrities hangout but they cant enter. It’s like being in a kids club at a bar.\n3. **Menial Tasks**: Interns are often used for petty tasks like fetching coffee. Interaction with cast members is limited to brief responses unless otherwise instructed. Some of the cast members/crew were interns themselves and even though they were treated the same. They kind of treat the SNL interns like how they were treated for some reason.\n4. **Couch Controversy**: Once, a production exec was unhappy with the interns and removed their couch from the break room, forcing them to sit on the floor for the rest of the week. This was because a mistake they made in their order/task.\n5. **Sydney Sweeney’s Cookies**: Sydney Sweeney requested expensive baked goods for everyone. An intern misordered by four, got yelled at by the executive producer, and almost got fired. Ironically, Sydney didn’t even eat the cookie and later gave it to the intern. The intern could only talk to her if spoken to first.\n6. **Marcello’s FIFA Obsession**: Cast member Marcello frequently makes interns buy him FIFA related stuff for his ultimate team and batteries for his controllers because he usually plays FIFA after every table read in his dressing room.\n\nWhy do interns want to work there?\n\nSimply put it pens doors and connections if you know how to leverage and can help you enter Hollywood. if you aren't a nepo baby.",
        "num_comments": 111,
        "comments": [
            "7 making interns comb through every cumtown episode from 2017-19 and create a power ranking of possible sketches",
            ">After Party Segregation\n\nUnless you're an underage female and Horatio Sanz takes a liking to you",
            "Is this supposed to be what Kenneth from 30 rock is lampooning? how psychotic a person would have to be in order to acclimate to being a habitually degraded servant to a bunch of neurotic r*tards",
            "Sydney Sweeney sounds like a total sweetheart. \n\n\n\nUnfortunately that's how it is in the film and TV industry. Even if you graduate from Tisch or USC, you're working 14 hour days doing bitch work as a PA. Heard similar stories from a friend, she eventually left the industry. \n\n\nIf you want good treatment as an intern, pick tech, consulting, F500 etc. They really rolled out the red carpets for the internships I had. ",
            "Worked in a writer’s room with someone who was previously a writer on Jimmy Fallon. She was very cool and funny, told me it was the worst job she ever had and made her seriously contemplate killing herself, not as a joke.",
            "That’s all pretty standard for low level jobs around big talent.",
            "People complain about tech and games, but when I was an intern at a major major AAA game company many years ago they not only converted me to a salary employee at the end, but the leadership were always humbled to talk to us and super cool.\n\nThis is the reason why I never liked Hollywood",
            "All of this is pretty standard.  \n\nThe “don’t speak to the talent unless spoken to” rule always seems draconian but it’s a common rule to keep people from being a distraction on set. \n\nI knew someone who was a roadie and he said nobody was allowed to look in Janet Jackson’s direction. You had to glance away whenever she walked by. Now that’s crazy. ",
            "Interns used for petty tasks!? Shocking!!",
            "What was ur friend expecting, like that's how a PA is treated lol"
        ]
    }
}