{
    "RESULTS of 2023 Census": {
        "title": "RESULTS of 2023 Census",
        "score": 526,
        "url": "https://www.reddit.com/r/redscarepod/comments/187xgk5/results_of_2023_census/",
        "content": "Hello...... firstly sorry for the delay - I'm a lover, fighter, worker, mensch... things get in the way... things reached for among the stars and things grasped from in the gutter... but it's here now.\n\nRegarding the lists, the letterboxd and Spotify general recs lists are there and ready. The niche recs letterboxd list is there... but I decided to add all recs and then cut it down (stupid) and so some laughably un-niche films have slipped through which I will come back to when I have more time and cull. The niche Spotify list is barebones and effectively a placeholder, but I will eventually add them all on... let's say before Christmas. So, like or bookmark or whatever you want if you're interested, they will in the end be what they should be.\n\nI lifted the bar for the niche films from 10k to 20k, and the niche Spotify list from 10k to 30k. I think 10k was fair with movies but wanted people to get more of their faves in, but on music yeah I was wildly out, I listen to a lot of continental stuff from the 80s that never did anything at the time let alone now, 10k seemed generous but obviously wasn't.\n\n[Letterboxd general recs](https://boxd.it/pWHNs)\n\n[Letterboxd 'niche' recs](https://boxd.it/qbYxQ) (anything over 20k will be removed in the next few weeks)\n\n(shoutout to the users who recced 'Trans-Europ-Express', 'The Night of Counting Years', 'The Chess Players', and 'Belle de Jour or Freddy got Fingered')\n\n[Spotify general recs](https://open.spotify.com/playlist/01RezE1n2fRVGjPFM5p080?si=1a422548447a4719)\n\n[Spotify 'niche' recs](https://open.spotify.com/playlist/7ql9jY39SiDTR9DH4S3Cmy?si=c5d147c1891e463d) (literally at this point a placeholder, come back in a month lol)\n\nBook recs and 'last messages to the sub' I was looking to put into a pastebin but as it's gone 'woke' it no longer allows slurs to be posted, which of course, being the sub, people peppered their replies with... so I went with this ControlC\n\n[Au Revoir, r/rsp](https://controlc.com/d19e6f07)\n\n[r/rsp 2023 Lit Recs](https://controlc.com/2caa6710)\n\nThere are a few glaring omissions when it comes to questions, but then there is every year. Eventually, the ideal census format will be reached, but perhaps not by me...\n\n[2020 results](https://www.reddit.com/r/redscarepod/comments/hmif5o/results_of_that_rredscarepod_poll_from_the_other/)\n\n[2021 results](https://www.reddit.com/r/redscarepod/comments/oxaiq0/results_of_sub_census/)\n\n2022 results... don't exist.\n\n[The Google Sheet with all of the data on, for the sub's nerds...](https://docs.google.com/spreadsheets/d/1bKj5KX3GjOfZNHUOiV6Ry5iKOMu-tyS92jc2VtA7j4Y/edit?usp=sharing)\n\nNow, on to the actual census results...\n\n*Section 1: The Essentials*\n\n**[Gender](https://i.imgur.com/pROGYzB.png):**\n\n* Cis Man: 70.6% (3,117) \n* Trans Man: 0.3% (12)\n* Cis Woman: 25.1% (1107)\n* Trans Woman: 1.9% (83)\n* Non-Binary: 1.1% (49)\n\n**[Age](https://i.imgur.com/Y3QFIbx.png):**\n\n* Under 18: 2.3% (100)\n* 18-21: 14.3% (631)\n* 22-26: 36.1% (1594)\n* 27-33: 35.1% (1551)\n* 34-40: 9.9% (435)\n* 40-50: 1.8% (81)\n* 50+: 0.5% (23)\n\n**[Sexuality](https://i.imgur.com/f2XMAsg.png):**\n\n* Straight Man 55.4% (2,444)\n* Bisexual Man 10.3% (453)\n* Homosexual Man 5.7% (253)\n* Asexual Man 0.5% (22)\n* Straight Woman 15.7% (693)\n* Bisexual Woman 8.7% (383)\n* Homosexual Woman 2.5% (109)\n* Asexual Woman 0.5% (21)\n* I'm nonbinary and annoyed you bothered to list me under gender but not sexuality 0.8% (37)\n\n**[Relationship Status](https://i.imgur.com/QtfQT8B.png):**\n\n* Single – normie: 37.1% (1636)\n* Single – Incel: 13.5% (598) \n* In A Casual Relationship: 7.7% (341)\n* In a Committed Relationship: 30.4% (1343)\n* Married: 11.3% (497)\n\n*Section 2: Sub valour*\n\n**[I’ve been on the sub since…](https://i.imgur.com/fohkswp.png):**\n\n* 2018: 6.5% (285)\n* 2019: 14.1% (623)\n* 2020: 25.3% (1117)\n* 2021: 23.9% (1056)\n* 2022: 19.9% (879)\n* 2023: 10.3% (455)\n\n**[I’m on the sub:](https://i.imgur.com/pqnzraT.png)**\n\n* Actively Posting: 12.5% (554)\n* More Inactive than Active: 25.5% (1124)\n* Consistently Lurking: 54.9% (2423)\n* Lurking with aspirations to be the main character: 7.1% (314)\n\n**[I came to the sub from…](https://i.imgur.com/Lwy6PiR.png)**\n\n* Girls' twitter presence: 24.6% (1084)\n* Sailor socialism vid: 7.1% (313)\n* Cumtown: 25.1% (1110)\n* Chapo: 10.4% (460)\n* Reddit algorithm: 22.1% (976)\n* Media articles/coverage/outrage at A&D: 10.7% (472)\n\n**[Sub is](https://i.imgur.com/8oytRqi.png):**\n\n* Dead: 9.2% (405)\n* Dying: 17.3% (764)\n* Good Days, Bad Days…: 59.4% (2621)\n* Healthy: 9.6% (425)\n* Thriving: 4.5% (200)\n\n**[Anna or Dasha?](https://i.imgur.com/BpFXhZu.png)**\n\n* Anna: 41.8% (1845)\n* Dasha: 58.2% (2570)\n\n[Just gonna link to the results for 'How Important is the Sub to You' here...](https://i.imgur.com/ZkVdQ3y.png)\n\n*Section 3: Sub Social & Political*\n\n**[Posting from:](https://i.imgur.com/gFd8rz3.png)**\n\n* USA: 60.3% (2664)\n* Non-US North America: 8.6% (379)\n* South America: 1% (44)\n* Europe: 20.4% (899)\n* Middle East 0.8%: (34)\n* Africa 0.4%: (17)\n* East Asia: 0.7% (31)\n* South Asia: 0.5% (21)\n* Australasia: 7.2% (319)\n\n**[Your personal proximity to 'the scene'](https://i.imgur.com/089KZIl.png):**\n\n* Literal Actual Dimes Square: 1.5% (66)\n* New York: 8.6% (378)\n* Another US City's Equivalent Scene: 6.6% (290)\n* US Urban: 23.6% (1042)\n* US Suburban: 15.5% (685)\n* US Rural: 6.3% (278)\n* Non-US City's Equivalent Scene: 6.1% (269)\n* Non-US Urban: 20.6% (910)\n* Non-US Suburban: 7.6% (335)\n* Non-US Rural: 3.7% (162)\n\n**[Political Opinion](https://i.imgur.com/Zt3Ihwe.png):**\n\n* Far-Left: 20.6% (909)\n* Left: 30.6% (1351)\n* Centre-Left: 22.3% (983)\n* Centre: 9.7% (430)\n* Centre-Right: 8.5% (374)\n* Right: 3.8% (167)\n* Far-Right: 4.6% (201)\n\n**[Political Compass](https://i.imgur.com/wNNC9fz.png):**\n\n* Lib Left: 46.2% (2039)\n* Auth Left: 30.1% (1327)\n* Lib Right: 15.6% (690)\n* Right: 8.1% (359)\n\n**[Trump is…](https://i.imgur.com/RpNVd6s.png):**\n\n* Cooked: 41.9% (1851)\n* Cooking: 58.1% (2564)\n\n**[On that note, in 2024, the winner will be:](https://i.imgur.com/VsFIwal.png)**\n\n* Biden: 37.2% (1605)\n* Trump: 35% (1510)\n* Bernie: 5.7% (245)\n* 2nd Gen Brahmin-caste candidate for either party: 22.2% (956)\n\n**[Do you think America is in terminal decline? \\(i.e., no election / main party platform will change this\\)](https://i.imgur.com/0djNExv.png):**\n\n* American – Yes: 45.8% (1999)\n* American – No: 16.9% (738)\n* Non-American – Yes: 26.6% (1160)\n* Non-American – No: 10.8% (472)\n\n**[Who will emerge from their CIA safehouse first?](https://i.imgur.com/3Y1yruR.png)**\n\n* Virgil: 33.4% (1476 )\n* Amber: 66.6% (2939)\n\n*Section 4: The character of your soul*\n\n**[Have you ever been in love?](https://i.imgur.com/wObvZ4q.png)**\n\n* Yes: 73.7% (3254)\n* No: 15.3% (675)\n* I Don’t Know: 11% (486)\n\n**[Do you believe in 'true love' / 'love at first sight'?](https://i.imgur.com/6iVRfCZ.png)**\n\n* Yes: 49.6% (2190)\n* No: 30.8% (1359)\n* I Don’t Know: 19.6% (866)\n\n**[Have you ever paid for OnlyFans?](https://i.imgur.com/UBcGfxh.png)**\n\n* Yes: 12.5% (553)\n* No: 87.5% (3862)\n\n**[Have you ever paid for sex irl](https://i.imgur.com/dmiiRKk.png)?**\n\n* Yes: 5.4% (238)\n* No: 94.6% (4177)\n\n**[Have you ever sold sex \\(irl or online\\)](https://i.imgur.com/IXIBXJQ.png):**\n\n* Man – Yes: 2.7% (120)\n* Man – No: 69.7% (3078)\n* Woman – Yes: 2.7% (121)\n* Woman – No: 24.8% (1096)\n\n**[Have you ever cheated on a partner?](https://i.imgur.com/KvI2kYg.png)**\n\n* Yes: 20% (881)\n* No: 67.2% (2968)\n* Never Dated: 12.8% (566)\n\n**[Have you ever been cheated on?](https://i.imgur.com/NM97b9r.png)**\n\n* Yes: 27% (1194)\n* No: 60.2% (2658)\n* Never Dated: 12.8% (563)\n\n**[Do others consider you to be attractive?](https://i.imgur.com/h4bbLtd.png)**\n\n* Yes: 80% (3532)\n* No: 20% (883)\n\n**[Do you make art? Paint/draw/sculpt/write fiction/play or write music... or... you get the idea anything along these lines:](https://i.imgur.com/GwzGi65.png)**\n\n* Yes: 67.3% (2972)\n* No: 32.7% (1443)\n\n**[Do you like to travel?](https://i.imgur.com/EInEGWh.png)**\n\n* Yes – domestically: 17.2% (760)\n* Yes - domestically + internationally: 67.7% (2989)\n* No: 15.1% (666)\n\n**[Is your work](https://i.imgur.com/UK91bZO.png):**\n\n* White-collar: 50.5% (2229)\n* Blue-collar: 15.9% (703)\n* Still in education:  26.7% (1177)\n* NEET: 6.9% (306)\n\nNot going to bother typing out the almost identical astrology results BUT the sub is 9.2% Virgo as the largest sign, and 7.2% Capricorn, which is the smallest sign.\n\nScorpio is the fave sign not your own 11.3%. Least favourite is Cancer (duh).\n\n[Your Signs](https://i.imgur.com/CVDZMKY.png)\n\n[Fave Sign Not Your Own](https://i.imgur.com/g7oPasa.png)\n\n[Least Liked Sign Not Your Own](https://i.imgur.com/ZZG2ttr.png)\n\nApologies again for the delay getting it out and not 100%, simply don't have time rn and it was a lot more work than previous ones. It was either I submit it to the sub tonight 80% done and with not much commentary, or mid-Dec as I'm working late tomorrow, working Sat, and off on holiday Sun. It'll get polished and finished when I'm back.\n\nI actually forgot to do the survey myself so my grubby fingerprints aren't in any of the results or list, oops. Watch [Boris Godunov](https://letterboxd.com/film/boris-godounov/) and listen to [Martin Dupont](https://open.spotify.com/track/4onSUYnyxN8KMvWxZi2XJq?si=6714c5aaabb14310)... or watch/listen to [Mylène Farmer - Libertine](https://www.youtube.com/watch?v=oGFr_NcKyfo), I guess.",
        "num_comments": 220,
        "comments": [
            "shout out to the three other cis women who came here via Cumtown!",
            "Confirmed official Cum Town subreddit",
            "That 12.5% paying for OnlyFans is genuinely astonishing. Who are you people",
            "Another defeat for the Anna party. Also my form says I've paid for OF even though I never have. So either there was a mistake or I felt like mildly lying that day.",
            "Gender and sexuality breakdown is bleak.",
            "12 trans men posting here is so funny to me and I don't know why.",
            "Blood Meridian the most recommended book on the list (11), Stoner in second (10), and My Struggle is a trailing third (6). \n\nShout out to whoever put Hunger Games, and in general, I'd like to congratulate the sub for their restraint (Mein Kampf only has 3 votes).",
            "Why so many straight men wanna be on here talking about cigarettes, lana del rey, various late 20th century pop culture ephemera, hating on average size women and promoting eating disorders?? Questioning you if you're a straight man on here tbh",
            "Imagine Dragons in the spotify playlist lol",
            "I wonder what explains the lack of gay male representation here. Even on g&g it's like 80% women 20% gay men, if that"
        ]
    },
    "No Debate": {
        "title": "No Debate",
        "score": 17,
        "url": "https://www.patreon.com/posts/no-debate-107088316",
        "content": "",
        "num_comments": 20,
        "comments": [
            "You know things are bad for Biden when Anna's contrarian take is saying nice things about him",
            "What the fuck... a 24 hour turnaround time is unprecedented. Anna took all the uppers Biden was supposed to be on last night",
            "\"Climate change is fake.\"  Dasha proclamation 6.28.2024",
            "Thank god we got an episode after the travesty that was honor roll",
            "I love tuning in for the wog perspective.",
            "Dasha may be the greatest mind of our generation but I'm a bit confused about her perspective on climate change",
            "let's just pretend last ep didn't happen, please",
            "Kinda bummed they covered the debate. I was hoping they would tell us what paglia would say about hawk tuah girl. I was wondering if Anna would tell us dostoevsky predicted hawk tuah girl. Also, I am wondering if dasha agrees that it is a finisher for men.\n\nBut dasha is right. If you have self harm ideation or fantasies, the debate was a reminder that the world is still capable of wonder and intrigue.",
            "You know thinking about it, we could still get Leslie Nielsen to play Biden in the biopic",
            "Lol I guess RFK wont be on the pod afterall"
        ]
    },
    "Accidentally used f slur on a date, and im putting it on you guys": {
        "title": "Accidentally used f slur on a date, and im putting it on you guys",
        "score": 97,
        "url": "https://www.reddit.com/r/redscarepod/comments/1dr98s2/accidentally_used_f_slur_on_a_date_and_im_putting/",
        "content": "In a nice asian fusion restaurant (chosen appropriately), had just ordered appetizers, conversation was flowing. She asked me my plans for the weekend and said I was going to a pride event, and she lit up and said that will be fun, at which point i leaned in conspiratorially and said yeah except for all the 🚬. She looked genuinely appalled and told me her brother is gay, at which point i remembered most of the world is actually homophobic. I quickly put together a flurry of excuses, barely avoiding accidentally coming out to her, and ordered 4 more drinks. Im putting this one entirely on you guys and taking no accountability, probably wouldnt have worked out with her anyways.\n",
        "num_comments": 26,
        "comments": [
            "This made up story is WILD",
            "You know in the context of your life you arent really using that word as ironically as you think you are",
            "You should have explained to her youre not homophobic just very unfunny",
            "Tell her youre bi and you have a pass to say it",
            "My gay zoomer brother is visiting me rn. Yesterday we were walking around town and I called something gay. Quiet pause; wasn't sure if he'd be upset. Then he said that it was definitely hella gay. After that it was no hold bars on all the slurs for the rest of the night. We had a great time.",
            "Im picturing you as Patrick Bateman this is hilarious",
            "Should've just been honest and said you let the subreddit for two random Russian skets ruin your life. Date was ruined anyway, why add lying to the rap sheet",
            "Assuming this is a true story, you gotta turn off the r/redscarepod part of your brain while on a date",
            "gotta own it, cant be backpedaling  because in her mind you probably are in the closet now",
            "Fucking hell that is funny"
        ]
    },
    "Lamenting the loss of artistry in anime": {
        "title": "Lamenting the loss of artistry in anime",
        "score": 164,
        "url": "https://www.reddit.com/gallery/1dr6304",
        "content": "\"Wah wah not RS!\" Okay call me gay but anime used to have genuine talent behind it and it's sad that we will never have this again.",
        "num_comments": 38,
        "comments": [
            "Can you name em? I wna check some of these out",
            "It still has genuine talent behind it lmao, a lot of the people who made some of the stuff you posted here chances are are still working in the industry, and some of them are still pumping out the occasional good stuff.\n\nBecause like it's the case vast majority of the time, it's less a loss of artistry and more of a current economic situation not allowing people to experiment or do weird shit. There are a lot of creators from 90s and 00s that made shows people here would label \"Good Ones\" that have been trying to make original stuff for years but couldn't and have been regularly and publicly lamenting it.",
            "Dezaki is rs; Dear Brother and (the second half of) Rose of Versailles are basically perfect",
            "Moomin is so cute, used to love reading those comics when I was a kid. I was never into superhero comics or whatever, but Moomin comics really appealed to my autistic child brain. Something to be said for that Finnish excellence-autism connection",
            "This is the only one that ever really intrigued me, they showed it on TCM and was odd and striking and disturbing.",
            "Not on the same level as some of these but Naoki Urasawa's Pluto (it's netflix, don't let that put you off) is a recent one that's properly good. It's a mini series that reinterprets a classic Astro Boy arc",
            "This is fair but there is good modern stuff too. Check out the tatami galaxy (2010), paprika (2006) and kaiba (2008), you might like that. You cant just mope, you gotta look.",
            "Im not sure if this is a hot take with this sub, but anime shows and movies prior to the 2000s, with the exception of Miyazakis films, tend to be the only good anime.",
            "i think every newish art form has the same life cycle where you have genuine weirdos making the thing for a while who all come from different backgrounds with wildly different influence, and then you have the nerds who grew up solely on that art form making the next wave of things, further spiraling away from the original wide influences \n\nthat said still a lot of killers making anime. masaaki yuasa is the man",
            "Still looking for an anime as good as Monster"
        ]
    },
    "This is fucking awful. Whoever hurt Amanda Bynes needs to burn in hell forever": {
        "title": "This is fucking awful. Whoever hurt Amanda Bynes needs to burn in hell forever",
        "score": 356,
        "url": "https://i.redd.it/bt5pkmy3df9d1.jpeg",
        "content": "",
        "num_comments": 96,
        "comments": [
            "Also, whoever did her lips needs to be put in jail. That is negligent, and it looks painful.",
            "In a world that pathologizes everyday anxieties and quirks, it's easy to forget how damaging and debilitating genuine mental illness can be.",
            "when I was a kid I thought she was so pretty and cool. this bums me out, man.",
            "This is so weird and painful to watch",
            "She's the man is one of the best teen movies from the 2000s. It hurts to see someone you grew up watching turn out like this",
            "On a completely unrelated note does anyone know Dan Schneiders address haha I just wanna talk to him lol",
            "Would never have recognized her. Still has beautiful eyes, though.",
            "In retrospect, The Amanda Show absolutely planted a few seeds in my sense of humor. She is so naturally charming and funny. Really hope she can turn things around :/",
            "Was kinda hype for her podcast, I thought it woulda been good for her.",
            "Ive heard that survivors of sexual abuse tend to make themselves look ugly and unappealing as a way to make men not attracted to them and I think thats whats going on here :("
        ]
    }
}