{
    "⚠️ Regras e Regulamentos Gerais do Sub.": {
        "title": "⚠️ Regras e Regulamentos Gerais do Sub.",
        "score": 27,
        "url": "https://www.reddit.com/r/RelatosDoReddit/comments/1akpmhh/regras_e_regulamentos_gerais_do_sub/",
        "content": "##Sejam bem-vindos ao r/RelatosDoReddit.\n\nEste espaço é um lugar seguro para relatos dos mais diversos tipos, reservado para discussões e assuntos sérios e sem julgamentos relacionados, abordando o tema de forma madura e respeitosa com foco na discussão. Portanto, **não será permitida imagens no grupo**. \n\nPessoas de todos os gêneros e orientações sexuais são bem vindas.\n\n___\n\n\n👉 Para um entendimento mais aprofundado da proposta do sub, você pode conferir o nosso **[FAQ](https://www.reddit.com/r/RelatosDoReddit/wiki/faq?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1)**.\n___\n\n\nPedimos que **leiam as [REGRAS](https://www.reddit.com/r/RelatosDoReddit/about/rules)** e utilizem este espaço para se comunicar com os moderadores, ou através do nosso modmail, caso necessário. Desta forma temos um melhor controle sobre a qualidade do sub r/RelatosDoReddit.\n\n##Confira também informações úteis no nosso **[MENU](https://www.reddit.com/r/RelatosDoReddit/wiki/index)**\n______\n\n#ATENÇÃO PARA AS REGRAS DE POSTAGEM⚠️\n\n##Agora existem limitações no nosso sub que seguem as seguintes regras:\n\n- Posts: Liberados em contas **= ou > a 20 karmas de comentário.**\n\n- Comentários: Contas novas de **até 10 dias só poderão comentar após verificação de e-mail ou telefone no app.** Isso permitirá que você possa gerar karmas na nossa comunidade antes de postar.\n\n- Todo título exige um **mínimo de 20 caracteres e máximo 80.**\n\n- Toda postagem exige a definição de uma **flair de post** para identificar do que se trata o assunto.\n\n______\n\nAs **[Regras de Comunidadade](https://www.reddit.com/r/RelatosDoReddit/about/rules)** estão no topo da página, na aba **sobre**, mas nunca é demais relembrar:\n\n**1. Preconceito e generalizações.**\n\nNada de machismo, feminismo, racismo, homofobia, xenofobia, transfobia etc. Não generalize comportamentos ou caraterísticas de nenhum grupo social.\n\n**2. Comportamento tóxico.**\n\nNão falte com respeito, não xingue outros usuários, não faça julgamentos nem comentários depreciativos. Demonstrações de comportamentos violentos ou repulsivos como pedofilia, estupro e incesto serão punidas imediatamente. Ataques ao estilo de vida também não serão tolerados.\n\n**3. Imaturidade.**\n\nTenha maturidade em relação ao tema do sub e demonstre o mínimo de seriedade em suas postagens. Garanta que suas contribuições aqui sejam construtivas e civilizadas.\n\n**4. Assédio e flerte.**\n\nNão assedie outros usuários, não faça comentários com segundas intenções, não convide ninguém pra chat. O sub não é Tinder, então não tente marcar encontros aqui. Quaisquer interações com usuários em busca de chat ou encontros também serão punidas.\n\n**5. Objetificação e validação.**\n\nNão objetifique grupos sociais ou características físicas, nem procure validação de opiniões sobre partes do corpo. O sub não é feito para coletar opiniões do tipo: \"você acha que [X] é gostosa?\"; \"[X] cm é grande/grosso o bastante?\"; \"mulheres, vocês gostam de [X]?\"; \"tenho fetiche em [insira grupo social]\"; \"é normal ser virgem aos [X] anos?\".\n\n**6. Post sem relação com o sub.**\n\nPreste atenção na temática do sub. O foco são relatos sérios que geram discussões instigantes. Dúvidas médicas, guerra de sexos, perguntas de uma área específica ou menções similares são proibidas em qualquer circunstância. Discussões adultas discretas estão restringidas ao uso da flair **Segunda-Feira Adulta** 🔞 liberada 1 dia na semana (segunda-feira) junto com a tag marcada +18.\n\n**7. Publicidade, vendas ou trocas.**\n\nOfertas, pedidos e trocas de material, também, como mídia pornográfica, comunidades virtuais, tutoriais, packs, contos eróticos, sugestões de sites, produtos, serviços e lugares é **ESTRITAMENTE PROIBIDAS**, sujeito a permaban.\n\n**8. Conteúdos Ilegais e Políticas do Reddit.**\n\nConteúdos ilegais que incentivem crimes, que façam referências ou apologia a drogas, doxxing, incentivo ou dicas ao suicídio e qualquer coisa que quebre as políticas do Reddit, serão excluídos e o usuário banido, sem possibilidade de apelo.\n\n**9. Conteúdo de Baixo Esforço.**\n\nEssa é uma comunidade voltada para assuntos que geram discussões instigantes e engajamento nas publicações. Conteúdos de baixo esforço se tornam repetitivos e cansativos para outros membros, gerando pouco interesse e baixa qualidade.\n\n**10. Conteúdos Sensíveis (Gatilho).**\n\nTodo conteúdo sensível que envolva relatos sobre suicídio, abuso sexual ou referências similares que possam gerar gatilhos para outros usuários, DEVEM, OBRIGATORIAMENTE, utilizar a flair de postagem “Alerta de Gatilho” e tagear o post como NSFW. Palavras ou frases de impacto forte envolvidas no relato, também deverão estar com spoiler.\n\n**11. Metadrama.**\n\nNão permitimos menções, críticas, marcações, links e prints voltados para outros grupos. A intenção e foco do nosso grupo não é essa. Para assuntos do tipo, poste no r/metadrama\n\n**12. FIC.**\n\nFICS não são permitidas na nossa comunidade. Conteúdo ficcional não agrega em nada e retém atenção e dedicação dos membros para nenhum fim. Colabore com conteúdo original.\n\n**13. Conteúdos Sugestivamente Polêmicos.**\n\nEvite postagens que possam gerar polêmicas desnecessárias causando desconforto, desentendimentos ou atritos dentro do sub fora do dia determinado. Conteúdos como política, religião, aborto, legalização de drogas, guerra de sexos, pronomes neutros, gêneros, sexualidade, redpill, incel e afins estarão liberados somente com o uso da flair **Segunda-Feira Polêmica**💥 toda segunda-feira. Vamos evitar preconceitos e respeitar a crença do próximo, discutindo com responsabilidade no dia proposto.\n\n________________________________________\n\n##Conteúdo Sensível.\n\nTodo conteúdo sensível que envolva relatos sobre suicídio, abuso sexual ou referências similares que possam gerar gatilhos para outros usuários, **DEVEM, OBRIGATORIAMENTE, utilizar a flair de postagem “Alerta de Gatilho” e usar a tag +18 no post**. Palavras ou frases de impacto forte envolvidas no relato, também deverão estar com **spoiler.**\n\nExemplo: >!Frase de impacto forte!<\n\n**Código do spoiler:**  `>!Seu texto aqui!<`\n____\n\n#Subregras\n\n##Em hipotese alguma aceitaremos postagens que façam referências a assuntos como:\n\n- **Incesto**\n- **Zoofilia**\n- **Pedofilia**\n- **Necrofilia**\n- **Menores de Idade**\n\nA infração destas regras resultará em **BAN PERMANENTE, sem possibilidade de apelo.**\n\n_____\n\n##👀 *A comunidade r/RelatosDoReddit passará a ter um **rigoroso** monitoramento **24h** de todo e qualquer ato suspeito que infrinja as regras.*\n\nDesta forma, com o aviso prévio não respeitado, o ban será **PERMANENTE**, quantas vezes forem necessárias.\n\nQueremos uma comunidade com respeito e dignidade. Precisamos ter empatia com o próximo, então sejam acolhedores.\n\n\n✅ **Qualquer dúvida, sugestão, reclamação ou qualquer assunto que necessite um moderador, por favor, entre em contato com um moderador através do nosso [ModMail](https://www.reddit.com/message/compose?to=/r/RelatosDoReddit).**\n\n⚠️ Para mais informações, **consulte nossa aba [MENU](https://www.reddit.com/r/RelatosDoReddit/wiki/index)** no topo da página, onde você irá encontrar informações como FAQ, CVV e terapia, Perguntas Frequentes e mais.\n\nA moderação.\n\n\nu/EuPombo, u/amn_0106, u/Lomuri2003",
        "num_comments": 10,
        "comments": [
            "u/EuPombo ** um membro verificado do r/RelatosDoReddit**. Membros verificados no grupo so confiveis, colaboram com outros membros e postam contedo **original**. Mantenham o respeito. Comentrios que infrinjam regras, sero punidos juntamente com o usurio.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RelatosDoReddit) if you have any questions or concerns.*"
        ]
    },
    "🎙️ Talk Interativo - Todas as sextas-feiras às 20:00 horas.": {
        "title": "🎙️ Talk Interativo - Todas as sextas-feiras às 20:00 horas.",
        "score": 8,
        "url": "https://www.reddit.com/r/RelatosDoReddit/comments/1bp43de/talk_interativo_todas_as_sextasfeiras_às_2000/",
        "content": "**Olá, Redditors.**\n\nCom um espaço como esse, cheio de formadores de opinião, para nós a **sua** também é importante.\n\nPor isso, nós da moderação, gostaríamos muito de ouvir a sua, debatendo os mais diversos assuntos relacionados ao nosso sub querido r/RelatosDoReddit.\n\nAssim, decidimos iniciar o **Talk Interativo.** Uma maneira de te ouvir, e discutirmos saudavelmente sobre os mais diversos tipos de relatos e iniciarmos uma discussão recheada de opiniões, sejam eles sobre família, relacionamentos, contos assustadores, conquistas e outros, em nosso **[Servidor do Discord](https://discord.gg/vWufGhdzZb)**.\n\n___\n\n##**REGRAS:**\n\n- A duração do Talk Interativo será livre, conforme o assunto rende.\n\n- O assunto do talk será definido na hora com uma pauta de entrada junto com os integrantes. Queremos uma discussão com muitas participações, então você que decide o assunto.\n\n- Cada participante que quiser interagir poderá levantar a mão e participar para expor seu relato, pedir conselhos, desabafar e também para discutirmos sobre alguma situação relacionada.\n\n- Em caso de divergência forte de opinião, vamos aguardar o tempo de fala do membro até que o outro possa opinar. Todos terão a oportunidade de falar.\n\nTeremos também um espaço para responder mensagens do chat com a sua dúvida, problema ou conselho para quem não estiver a vontade para entrar no bate papo de voz.\n\n**OBS:** O talk será especialmente realizado no palco do nosso **[Discord](https://discord.gg/vWufGhdzZb)**, mas os demais canais de voz também estarão livres para bate-papo dos membros! ;)\n\n👉 **Caso hajam desentendimentos ou ofensas, não respeitando o bom senso, o membro estará sujeito a ban da sala.**\n\n**Vamos manter a harmonia e tornar o talk agradável.**\n\n\n___________________________________________\n\n\n##Todas as sextas-feiras, às 20:00. \n*Esquenta a partir das 19:00.*\n\n##Participe! \n\n##[Entre Aqui!](https://discord.gg/vWufGhdzZb)",
        "num_comments": 8,
        "comments": [
            "u/EuPombo ** um membro verificado do r/RelatosDoReddit**. Membros verificados no grupo so confiveis, colaboram com outros membros e postam contedo **original**. Mantenham o respeito. Comentrios que infrinjam regras, sero punidos juntamente com o usurio.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RelatosDoReddit) if you have any questions or concerns.*",
            "Voc gostaria de iniciar a pauta?",
            "Vou ver um tema legal e de noite eu entro",
            "![img](avatar_exp|176352149|bravo)",
            "Criei conta no discord por causa desse talk. Hoje de noite me aguardem",
            "[removed]"
        ]
    },
    "Eu não entendo mulher": {
        "title": "Eu não entendo mulher",
        "score": 21,
        "url": "https://www.reddit.com/r/RelatosDoReddit/comments/1dr8cv9/eu_não_entendo_mulher/",
        "content": "Tudo começou na academia, tinha uma menina (2 anos mais nova que eu), que não parava de me olhar, sempre que eu olhava pra ela, começávamos a trocar olhares. Algum tempo depois, parei de ver ela treinando. Alguns meses depois, estava voltando do curso e me deparei com ela no ponto de ônibus, acho que foi uma surpresa pra nós dois.\nEla continuava me olhando como se tivesse apaixonada, depois de um tempo, tomei a coragem de falar com ela (primeira vez que tomo atitude pra chegar em uma mulher), eu puxei um assunto normal, nada demais, mas quando eu pedi o instagram dela, cheguei em casa todo bobo alegre, mandei a solicitação... já fazem 4 dias que ela não aceitou. Eu considero isso um fora, eu sou bv ainda, pensei que finalmente teria uma namorada já que ela parecia tão apaixonada.\nNunca mais vou chegar em ninguém, fiquei muito pra baixo depois do ocorrido, talvez ela tenha namorado ou sei lá, mas pra que ficar reparando tanto em mim?\n\nEdit: tenho 17 anos",
        "num_comments": 75,
        "comments": [
            "Kkkkkkkkkk bixo que  isso?",
            "Cara ela podia ta muito bem afim de voc, no gostou tanto do papo ou da sua personalidade e broxou, e no tem nada demais nisso,vai acontecer isso dezenas de vezes na sua vida e ta de boa,parte pra proxima e no fique fantasiando tanto que a mina era a mulher da sua vida so porque trocou olhares com voc",
            "Cara, larga essa de no querer chegar em mulher. No  toda garota que vai gostar de voc, apesar de aparentar ter interesse prvio. Muita gente no vai gostar de voc, mas muita gente vai gostar, e voc s vai saber se conhecer a pessoa. No deixe isso te consumir. O homem recebe muito no at conseguir o sim que vale a pena.",
            "A menina olhou pra voc e voc acha que ela t apaixonada? Falando de namoro? No a toa ela t fugindo",
            "No estou falando que foi o caso, mas os homens tem uma certa mania de achar que a gente t flertando com eles quando no est. J aconteceu comigo de o cara dizer que eu dei vrios sinais e na verdade eu ser assim com todo mundo. Ento, s vezes  bom prestar mais ateno.",
            "Provavelmente voc ainda  mais novo e isso pode ser confuso para voc. s vezes ela ficou com vergonha e no soube como reagir. s vezes ela olhou para voc mas s porque ela te achou bonito no quer dizer que ela queira se aproximar, no quer dizer que ela queira ser sua namorada. E s vezes foi apenas impresso sua. Agora independente de qual tenha sido, no precisa levar para o extremo, com o tempo voc vai aprender a lidar com essas situaes, essas coisas so normais.",
            "Cara, o segredo de conseguir pegar mulher  no sofrer com cada rejeio. Tu pode ser o cara mais foda do mundo e mesmo assim vai ter mulher que no quer nada contigo.\n\nSegue em frente e na proxima vez que tu tiver interesse em alguem e ver alguma brecha tu faz o aproach, e se no der certo segue a vida.",
            "Sou do tipo boba alegre q da risadas, brinca, falo com naturalidade com pessoas que conheci hje e simptica. Sempre trabalhei com atendimento ao cliente, ento me acostumei a tratar as pessoas assim e na maior parte da vida trabalhei s com homens, ai pronto n. Varias vezes eu estava simplesmente existindo e a pessoa achando q eu tava dando moral pra ela kkkkk.",
            "Vc faz bem pq depois da lei do no  no  melhor se precaver, se tu tiver algum amigo em comum na academia pode perguntar algo, se no, deixa ela ir atras de vc mesmo, melhor que virar piada na academia",
            "Cara, tu tem q ser menos emocionado."
        ]
    },
    "Morar com madrasta é dificil.": {
        "title": "Morar com madrasta é dificil.",
        "score": 7,
        "url": "https://www.reddit.com/r/RelatosDoReddit/comments/1drca78/morar_com_madrasta_é_dificil/",
        "content": "Sabe, eu desenvolvi muita carencia e por durante muito tempo fazia de tudo para agrada-lá, e mesmo assim nunca estava bom, o amor nunca era o suficiente, podia fazer o impossível que não estava bom. O amor era condicionado a \"Sim\" e \"Nao\"\", se eu negasse algo que era pedido, era mal tratado, se sempre dissesse sim, era amado. Isso f0deu meu Psicológico por muito tempo.\n\nTenho um meio irmão filho dela. E sempre me comparava com ele, porque ele é tão amado? Ele não faz nem 1/10 do que eu faço e ela o ama. Então percebi que como não sou filho dela, e eu a chamava de mãe, nunca serei amado, somente um gostar carinhoso se posso dizer. Meu pai trabalhava e quem cuidava de mim era ela, mas era complicado porque sempre era beliscado, machucado, tinha que fazer as tarefas domesticas, aguentar o Bullying do meu irmao, nao podia me defender se não era retalhado. Tinha que arrumar a bagunça do meu irmão se não virava briga. Vários namoros meu não deram certo por culpa minha óbvio, mas porque minha \"mãe\" não gostava delas e me manipulava para terminar, seja qualquer motivo: Pobre, feia, família Ruim, parentes problemáticos e N motivos.\n\nEla manupular meu pai para ficar com raiva de mim Sempre fazer de tudo para eu receber menos atenção do meu pai, e sempre incentivar meu irmão a ter contato com o pai. Hoje mal tenho contato com meu irmão. No máximo.Oi\n\nDemorou anos para conseguir quebrar essas amarras, hoje tenho 25 anos e foi com muita dificuldade que consegui ir me soltando, graças a Deus, conheci uma namorada que foi meu suporte e me ajudou a manter firme e nao cair e ceder as ordens ela. Este é um breve resumo, mas foi bem difícil. \n\nEu sei que no final nunca serei amado por minha madrasta, porque não sou filho dela e não posso exigir isso, ou ao menos esperar, e sei que a culpa de todo esse estresse emocional é traumas foi gerado pelo abandono de mimha mãe biológica, hoje tenho em mente casar com essa minha namorada e fazer o máximo para dar aos meus filhos, espero um dia ter, dar a eles um lar que não tive.\n\n ",
        "num_comments": 3,
        "comments": [
            "Sua madrasta  uma mistura de todas as madrastas ms das histrias de princesas. \n\nParabns por ter conseguido sair disso, OP. Com certeza conseguir realizar esse seu objetivo.",
            "Que assim seja amigo.",
            "##Seja Bem-Vindo(a) ao r/RelatosDoReddit. \nCertifique-se de seguir as **[Regras da Comunidade](https://www.reddit.com/r/RelatosDoReddit/about/rules)** para evitar que seu post seja excludo. Caso precise tirar dvidas mais profundas, confira nosso **[Menu Wiki](https://www.reddit.com/r/RelatosDoReddit/wiki/index)**. \n\n**Para dvidas, sugestes, reclamaes, elogios e outros assuntos, entre em contato com um moderador atravs do nosso [ModMail](https://www.reddit.com/message/compose?to=/r/RelatosDoReddit)**.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RelatosDoReddit) if you have any questions or concerns.*"
        ]
    },
    "Tive uma crise de pânico por um término que já faz um ano.": {
        "title": "Tive uma crise de pânico por um término que já faz um ano.",
        "score": 14,
        "url": "https://www.reddit.com/r/RelatosDoReddit/comments/1dr7pby/tive_uma_crise_de_pânico_por_um_término_que_já/",
        "content": "Não tenho com quem desabar, pois sinto vergonha de falar isso pra meus amigos. Em resumo, ano passado nessa mesma data, minha primeira namorada acabou o relacionamento comigo, tínhamos 6 anos de namoro. Aparentemente ela perdeu a admiração por mim, se tratando de relações, ela quase nunca chegava la mas sempre elogiava nossa parceira de casal, por conta disso fiquei muito confuso na época, já que pensava que tínhamos esse problema por morar com os pais e não termos privacidade. \n\nPois bem, ela terminou comigo no finalzinho da minha faculdade, e foi um baque pra mim já que eu pensava em trabalhar pra conseguir morar junto com ela e resolver esse problema... E o pior é que eu tinha comprado umas alianças semanas antes... Mas ela veio a terminar comigo alegando que achava melhor cada um seguir sozinho, que ela não me tratava como eu merecia ser tratado. \n\nPois bem, o tempo foi passando mas ela nunca se afastava totalmente. De mês em mês, ela me enviava mensagem e eu criava expectativas de uma volta. Mas sempre ela sumia quando eu desmontava isso. Já chegou a bloquear, parar de seguir. Porém sempre voltava a falar. \n\nNo ano novo ela manteve contato comigo durante 2 meses seguidos, admitiu que estávamos ficando mais próximos. Ajudei ela com bastante coisa nesse tempo também, e mesmo assim do nada ela veio me bloquear, u e isso na época me abalou demais, chorava feito uma criança. Mesmo com minha rotina de trabalho, estudos, academia etc... Detalhe, dois dias antes disso, ela me chamou pra encontrar ela numa noite, mas do nada desistiu, ou seja gerou uma expectativa em mim que no final não correspondeu. Ela sabia que eu ainda a amava e não sei o pq fez isso comigo.\n\nPois bem, chegamos atualmente. Acontece que ela me desbloqueou e puxou assunto novamente, e eu não sei oq aconteceu mas na minha cabeça aquele sentimento que ela poderia voltar, veio a tona de novo. E eu me enchi de esperanças. Até que ontem, um amigo meu levou seu bichinho no consultório dela (ela é veterinária) e perguntou por mim. E segundo ele, ela disse que tava fazendo terapia pra tentar ficar com outras pessoas, por que ainda gostava de mim, mas não via sentido em voltar a relação e que não pretendia de jeito nenhum voltar pra mim. Quando ele me falou isso eu não sei oq aconteceu... Eu entrei em Pânico \n\nEu saí correndo da minha casa, e quando me dei conta estava a 15km de distância, no meio do nada, chorando feito uma criança. Eu realmente n sei oq fazer, já faz 1 ano disso. E se ela n queria voltar, por que mandou convite, desbloqueou, ficou puxando assunto.... Ela quer me segurar na vida dela? Eu estou sofrendo demais por isso, e n sei se é normal. Eu realmente não sei oq fazer galera. Pois eu ainda amo demais aquela garota, vivemos coisas incríveis juntos, mas isso tudo me machuca muito ainda. E me sinto culpado por fazer tanto tempo.\n\nEu preciso de algum conselho\nObs: esqueci de mencionar o fato dela estar indo pra diversas festas, provavelmente pra ficar com o pessoal. Talvez isso também tenha contribuindo um pouco pra crise de pânico que eu tive ",
        "num_comments": 15,
        "comments": [
            "Eu entendo sua dor, jamais te julgaria.\n\nBem, o que voc pode fazer  ter a iniciativa de bloquear ela e aguentar firme isso tudo.",
            "Cara, ela no tem um mnimo de respeito por voc. Ela s esta carente e continua te desbloqueando pq vc da a ateno que ela precisa. Nisso, ela no permite que vc se afaste.\n\nVc precisa bloquear ela em tudo. Tu vai passar por umas semanas difceis no fim vai passar.",
            "Cara pelo amor de Deus sai dessa. Essa mina no te ama. Ela mantm contato  porque  cmodo ter algum por perto se der errado com outros. Cara se tu continuar nessa situao vai dar merda. Teu corpo t te avisando com essa crise. Ouve teu corpo. Sei que  difcil por ainda gostar dela, mas bloqueia ela tu nego, da um basta nesse vai e vem dela.\nCorta completamente contato. Para de ser trouxa que ela t te usando. Tem muita mulher por a, que realmente vai gostar de voc e te tratar bem. Tenha um pouco de amor prprio. Se ela te amasse ela tava contigo.",
            "Ela j deu para outro, mas quer que voc fique preso a ela.",
            "Ela  muito safada descarada, fica brincando com voc e te segurando! ELA ESTA SE DIVERTINDO!!! Quando esta no tdio ela vai atrs, quando tem Algum para senta ela bloqueia, faz voc... Bloqueia ela (isso vai fazer ela surta) e viva sua vida.",
            "Se vc est com esse tanto de sofrimento e no sabendo lidar, o melhor mesmo  terapia.\nMas analisando q tu falou,  melhor vc tomar a atitude de bloquear ela. Vai por mim quanto menos vc ver algo dela mais fcil fica superar.",
            "Foque em ganhar dinheiro, ter suas coisas, comprar seu carro, alugar seu AP, ser independente.. Relacionamento  consequncia.\n\nFocar em mulher enquanto no se  independente  um erro.",
            "Aprende a respeitar-te mais! Bloqueia-a, segue com a tua vida em frente, procura ajuda se precisares e parte para outra...",
            "Tai um timo conselho... Exatamente isso que se falou, se ele no afastar ele nunca vai superar.",
            "Ela voltar a te procurar  reforo intermitente. Toxidade absurda, tentativa de controlar voc. Isso causa diversos danos psicolgicos, procure sobre.\n\nO que fazer? Manda uma mensagem se despedindo, agradece o tempo juntos e diz que vai tentar seguir em frente. Bloqueia em tudo e segue sua vida. Isso da no vai dar em nada, confia em mim.\n\nDaqui uns 5 anos voc encontrar algum e vai se sentir bem novamente"
        ]
    }
}