{
    "What could we do with a Reddit Community Funds Grant?": {
        "title": "What could we do with a Reddit Community Funds Grant?",
        "score": 551,
        "url": "https://docs.google.com/forms/d/e/1FAIpQLSeDk32mbnHCsXEric1XsaF7BE7TitcXSa4Gtn-GHp51UgDamw/viewform",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Hello, everyone!\n\nWe are in the unique & exciting position to potentially be the recipient of a community grant from Reddit. Were not sure if our application will be successful, or how much money well get. But, we wanted your input since this will directly impact you, the user. \n\nSome give-away ideas we are tossing around:\n\n-\tOne month of therapy from an online therapy source, such as Better Help.\n-\tA copy of a book on relationships from an author such as Kerry Cohen, who was our frequent guest during the Reddit Talks era\n-\tA game designed to help you and your partner grow closer \n-\tDonating to a charity or charities voted on by our users, most likely ones that help victims of domestic violence, as we sadly saw an explosion of domestic violence-themed posts during the COVID-19 lockdowns. \n\n\nAgain, I cannot guarantee our grant request will be successful but since this will directly impact you, we wanted to get your feedback. Please take a minute to fill out this survey. It's completely anonymous, neither myself or anyone else on the moderation/admin team will see who answered what.\n\nI wanted also to take this time to thank all 8.87 (!) million of you! You are what makes this subreddit so amazing. We may not be the biggest subreddit, but I'd like to think we're the most caring. It is because of our amazing userbase that we're even being considered."
        ]
    },
    "Think of the comments as inverted Uber ratings. (click to find out what this means)": {
        "title": "Think of the comments as inverted Uber ratings. (click to find out what this means)",
        "score": 67,
        "url": "https://www.reddit.com/r/relationship_advice/comments/1dc8ke8/think_of_the_comments_as_inverted_uber_ratings/",
        "content": "I last posted a variation of this a little over 5 years ago. We're a little overdue for a repost.\n\n---\n\nYou know how every Uber rating is right on the verge of 5 stars unless something's particularly off? Everyone's all \"A+++ would ride again.\" Same for eBay, Amazon, etc.\n\nYou can think of /r/relationship_advice comments in much the same way, only inverted. Just about every post here talking about a problem is going to be a magnet for \"break up with them\" and \"get rid of them\" comments. Two things to keep front of mind when you're submitting:\n\n1. The vast majority of people posting here are posting because they've got a challenge they probably haven't been able to resolve on their own. \n\n2. In many cases, these challenges are either insurmountable or exceedingly difficult to manage. \n\nThe majority of commenters aren't *necessarily* cynical/assholes, but combine both a one-sided account of what happened—your account—with each commenter's own potential history, grievances, etc., and the resulting brew is pretty dark, meaning that every post will get drenched in comments suggesting ending the dynamic. \n\nThe number of serious comments suggesting _an alternative to ending things_ is a good way to tell whether or not there's merit to, well, ending things. I'll carry that Uber analogy a bit further:\n\n* Let's say you're asking about behavior that's so bad, the red flag's basically bleeding. Nearly every single comment will tell you to run, and you're having a hard time finding well-reasoned counter-arguments to it. Sounds like running is good advice. **Zero stars** on our inverted Uber scale; the relationship is cooked.\n\n* Together but your s/o cheated on you once? Most comments will probably tell you to run because \"once a cheater, always a cheater.\" Some comments might suggest you should stay and work it out, but the details of how the cheating happened might vary the number of these comments. Great; **One or Two Stars.**\n\n* Married but your s/o got drunk and made out with someone else, felt awful about it, immediately left the event where they met that other person and told you what happened and apologized with no prior history of cheating? Many people might _still_ tell you to leave (same reason), but odds are good that a fair number of people might suggest staying. Awesome; **Two, maybe even three stars.**\n\n* Good relationship with your S/O but they forget to treat you in the love language you normally need to thrive? Maybe they forget to bring you token flowers/trinkets or other signs of appreciation but otherwise everything's pretty good? Many comments will probably be advice on how to communicate; there'll probably still be a good number of people suggesting you should just leave, but you can take these with a grain of salt. **Three to four stars.**\n\n* Everything's rosey and you're looking for a way to celebrate your s/o's special promotion, anniversary, birthday, or something else? There'll be a few trolls who tell you to break up for asking the subreddit for advice, but it sounds like the relationship is **four to five stars.**\n\nYou can apply this to any type of relationship question asked here. Platonic, professional, and other relationships that aren't exactly romantic, this still works. You get the idea.\n\nBasically, the people telling you to leave probably outnumber the people with less jaded opinions by an order of magnitude because many, many people have had shitty experiences that dominate their memories, so the best way to consider most advice here is to see whether other advice shines through the cosmic negativity background. If everyone's telling you to break up, that's probably what you should do, but if 1/4 of the comments are telling you another way, you'd benefit by giving that 25% a chance.\n\n---\n\n##TL;DR: \n\nThe vast majority of comments will tell you to end things. It's a side effect of the fact that many people reading either have a very dim view of relationships or just do it for the drama. The more people tell you to consider something _other_ than running, the more value there is in trying that other approach, whatever it is.\n\n(inspired to repost this thanks to [this comment](https://www.reddit.com/r/mildlyinfuriating/comments/1dc05p7/had_to_end_my_birthday_party_early_because_a_1/l7vtsis/?context=3) by u/NotAmericanDontCare. Comments open for a little bit because I know some of y'all want to vent about this, but try to be civil about it.)",
        "num_comments": 21,
        "comments": [
            "Comments open for about as long as makes sense. Just try not to be a jerk. The usual rules about namecalling, bad faith comments, etc. still apply.",
            "the comments here are toxic",
            "Also there seems to be an overreliance on arbitrary \"rules\" like \"age gap bad\" (obviously some age gaps really are bad but five years in your 20s shouldn't be such a big deal IMO) or \"high school sweethearts bad.\" It's true that sometimes certain things like that can cause problems, but if the post isn't asking about something that is very obviously related to one of these \"rules,\" there shouldn't be so much focus on stuff like \"you're dating your high school sweetheart, that's Bad, break up.\"",
            "Way too many of us here are quick to project personal experiences onto others in a similar position uncritically",
            "Absolutely. I see so many comments  that say things like \"call the police\" about things that aren't illegal, like - as much as you might WANT some things to be illegal doesn't mean they actually are. And even if it might technically meet the definition doesn't mean it's actually likely to get a result or be helpful.",
            "Kind of solid advise. When you ask strangers for advise who dont know you they can only advise based on what info you give and its very hard for them, for us, not to connect those sittuations to similar of our own. This is unavoidable prohection.\n\n\nBut at the same time, just because the mob says thr same thing dont make the mob always right.",
            "I'd just tag on that posters pay attention to all advice posted, regardless of the upvotes/downvotes. The hivemind here can be brutal. \n\nThis is PARTICULARLY problematic when advice gets legal advice adjacent. Sometimes the right thing to do and the smart thing to do, don't line up. This sub will upvote the moral choice, every time (alright, I guess this is a little hyperbolic). Don't treat any of the advice you read here as wise/informed. Read it with a critical eye: the repercussions of acting on our advice will be yours to deal with. Read our advice as relationship advice ONLY: there's good reason why we aren't allowed to give advice on legal matters.\n\nTake the advice as if it's coming from your salty, newly single bff that considered using ivermectin for non-FDA approved reasons. We aren't experts and most of us have been burned.",
            "**100% this!**\n\nHalf the posters here also are just looking for support on how to \"be right\". Think of the kind of person who comes to a website to get ammunition to bring into the relationship. You can see the poster going to their Partner, \"See, reddit agrees with me! You are abusing me and toxic. We are incompatible and I am perfect. So F off. Wait, you are mad and hate that I went to reddit to win an argument using bullshit logic? But they say I will be better off alone. I am so lonely. I am going to go to reddit and get revenge.\"\n\nYou can smell the villain arc in so many posts. If the post isn't asking for advice about their own behavior, assume they are using anything you say as a way to fight their partner."
        ]
    },
    "My (28F) best friend (28F) kissed my husband (27M) and it’s destroying me. How do I proceed? ": {
        "title": "My (28F) best friend (28F) kissed my husband (27M) and it’s destroying me. How do I proceed? ",
        "score": 5730,
        "url": "https://www.reddit.com/r/relationship_advice/comments/1dqsytg/my_28f_best_friend_28f_kissed_my_husband_27m_and/",
        "content": "I (28F) have been with my husband (27M) for six years, married for four years, and we have two kids (3F, almost 1F). Everything in our relationship is perfect for us. He’s the best husband and father to our kids that I could have asked for. I am absolutely in love with him and his actions and words have always shown me that he feels the same way. There’s no better feeling than going to sleep in his arms every night.\n\nLast weekend, my husband and I had some friends over and we were having a barbecue. We were all outside in the backyard, surrounding my husband who was on the grill. As the food got closer to being ready to eat, we all started sitting at our backyard table. Once the food was all ready and at the table, my husband went inside to use the washroom and get another case of beer. I didn’t realize that my best friend (28F) had followed him. When he was coming back out, my best friend hid behind the wall separating our kitchen and living room and surprised him by pulling him and forcing a kiss. My husband immediately pushed her back and yelled wtf. She immediately started crying and ran out of the house and left. My husband came back into the backyard and asked to speak to me privately and immediately told me what had just happened. I was shocked and told him that it would be okay and that we could talk after everyone else left. I managed to put on appearances for the next couple of hours but I was mentally distraught.\n\nAfter everyone left, my husband sat me down and told me what happened and showed me the footage from our living room camera. It was exactly as my husband has described it. My best friend of 10 years, the person who I treated as my literal sister, forcibly kissed my husband. After the third date with my husband, she was the one I told that I was going to marry him. She knows how much I love him and how strong our relationship is and still she chose to try to come in the middle. For fuck’s sake, our 3 year old calls her “Aunty”. \n\nMy best friend tried showing up the next day “just to talk” and my husband had to hold me back from beating the shit out of her and he kicked her out and told her to not come back. It’s been almost a week now and I’m nowhere close to moving on. I don’t blame my husband one bit. He’s completely innocent in this and if anything, he’s the victim. I’ve been lying down on my husband’s chest and just crying every day and night. I’m so angry and frustrated and don’t know what to do. My husband has been amazing and like always, he just gets it and understands how I’m feeling. He brought me flowers almost every day and cooked my favorite meals multiple times in the last few days. I love and appreciate him all the more for it. I just don’t know how I’m going to move on and trust any of my friends again after this.\n",
        "num_comments": 920,
        "comments": [
            "You move on from that friendship and tell her not to contact you. Theres no way she can explain it and you just cant trust her anymore.",
            "Kick your friend to the curb shes not a friend",
            "Appreciate your man, honey - he's doing his best to comfort you, even though it was him who was grabbed. Show him the same love right back at him. Make him his favourite foods and just be there for him. I know you are, but make sure he knows it. <3",
            "Wow what a horrible betrayal OP.",
            "You were betrayed and lost your best friend, he was sexually assaulted. Yes, a minor SA, but still, please process that with him because hes GOT to be wondering if he ever gave off any mixed signals and might feel guilty. Even after youve already discussed it a bunch he could start feeling that, and Im pretty sure people are going to ask him that repeatedly so he could easily start to doubt himself. Hell also be thinking about signs she was giving off that he missed, and might want to spend a couple hours going through past encounters with you to try to put it all to rest. Regular processing shit, but for him, and as a guy he wont let his mind go there while hes comforting you. Fair enough, but eventually, when youre ready, you be sure to be the one helping him get through this ok?",
            "You've got a real loyal man.  Love him and hold him tight.  As for the friend... I too would be piiiiiiiisssed.   She just tried to grenade your marriage with no warning at all, I'm not sure any \"talking\" is necessary.  To me that relationship is over.\n\nQuite honestly,  u have footage... id put that shit out there so she cannot try to spin a bs story to play the victim",
            "Your husband sounds like a gem. Your friend sounds jealous of you and shes trying to be a pick me girl. You have every right to wanna beat her up for assaulting your husband. Remove her from you life!!",
            "Move on from her. She is not your friend. If your husband was not loyal, she would have started having an affair with him. She is not someone you need in your life, you can't trust her. You will have to proceed by putting that friendship behind you.",
            "You need to wonder why she felt bold enough to do this. Why was she crying. Why did she show up. \n\nThere is more you do not know.",
            "Is this a ChatGPT story?"
        ]
    },
    "Bestfriend (m28)  didn't invite me (m28) to his wedding, should I remain friends with him?": {
        "title": "Bestfriend (m28)  didn't invite me (m28) to his wedding, should I remain friends with him?",
        "score": 699,
        "url": "https://www.reddit.com/r/relationship_advice/comments/1dr3yi7/bestfriend_m28_didnt_invite_me_m28_to_his_wedding/",
        "content": "I (28m) didn't get invited to my closest friend's (28m) wedding. I was one of the first people he told about the proposal before it happened. I thought I had a good relationship with his fiance too. We went on trips together, never had any drama between us and golf together quite a bit. Our friend group has about 5 of us that have all been close friends since middle school. They all were invited except for me. I didn't get an invite when they sent them out last fall and I thought it was just well understood I would be there. Both of their families are multimillionaires so money is no issue. They have about 150 people on the guest list and even invited some local celebrities and politicians to the wedding that they hardly know. The whole year leading up to this we had all been in a group chat talking about the bachelor party, wedding venue and other wedding related topics. We speak every day and workout together every night after work. I asked him a week ago at the gym if it would be alright to bring my girlfriend of 2 months, that both of them had met several times to the wedding. \n\nHe said that I was on the waiting list and RSVP's were finished several months ago, and unfortunately I didn't get in. I didn't really know what to say. I kind of laughed and thought he was joking but he had an embarrassed look on his face. I knew then that he was serious, and asked him why. He just said that he didn't think it would be that important to me. I just said it's ok I understand and finished working out with him, trying to hide my emotion but I doubt I did a good job. \n\nWhen I left the gym I was upset, this was a guy that I really cared about and thought was my best friend. He messaged me asking to workout a few times throughout the week as though nothing was wrong but I just made up excuses and said I couldn't. I left the group chat and all of my friends started messaging me asking what happened. They couldn't believe I wasn't invited and had all thought I would be one of the groomsmen. He still texts me asking me to hangout and sends me funny videos on Instagram like nothing is wrong. The bachelor party is next week and I already gave my share to the best man for the airbnb, as he also thought I was going. \n\nI guess what I'm asking is do I just keep being friends with this group like it's no big deal or do I cut them off? I have other friends but we were all pretty close. ",
        "num_comments": 468,
        "comments": [
            "Ask your money back & ghost that friend.",
            "Ask the best man for your money back. \n\nDo NOT remain friends with the groom. Weddings are to celebrate with people who are important to you; he CHOSE not to invite you. Eff him.",
            "If you talk to this friend, please update us. But he doesnt deserve your friendship.",
            "I would ask for my money back and you and your gf go do something together",
            "Get your money back and exit stage left. Super shady and drama filled. Either sit your close friend down and lay it out that this is shady or time to move on. More rage bait? Cause as soon as being told Im on a waitlist with besties thats a true tell sign.",
            "If you dont want to be friends with the groom, then let him know but I wouldnt cut off the others in your friend group because its not their fault. You can separately let the groom and the other friends know your decision. I also wouldnt attend the bachelor party even though you paid for the Airbnb.",
            "Cut him off and remain friends with the others, if hes there be nice but dont engage. Sorry this happened to you, your friends will probably let him know what he did was wrong. You now know where you stand in your friendship with him ! Good luck",
            "This is one of those embarrassing situations where you think more of him than he does of you. He might be YOUR best friend, but he obviously sees you more as a guy he knows. Youre not important to him. Move on.",
            "He is clearly not your friend, let alone BEST friend... Tell everyone what he said or share this post and drop them all. Good luck OP.\n\nUpdateMe please.",
            "What a total jerk. Block him and leave that friendship in the past."
        ]
    },
    "My [37M] Wife [35F] wants to use Our $12k windfall for a vacation while I want to upgrade our house! How should I proceed?": {
        "title": "My [37M] Wife [35F] wants to use Our $12k windfall for a vacation while I want to upgrade our house! How should I proceed?",
        "score": 594,
        "url": "https://www.reddit.com/r/relationship_advice/comments/1dqwpin/my_37m_wife_35f_wants_to_use_our_12k_windfall_for/",
        "content": "Hey everyone,  \n  \nI could use some advice. My wife (35) and I (37) recently received a $12,000 windfall. We're both excited about the possibilities, but we're torn on how to use it.  \n  \nMy wife is dead set on using the money for a big family vacation. She’s been dreaming about a trip to Europe... something really special for us and the kids. She says it would be an unforgettable experience... a chance to create lasting memories... and a well-deserved break from our busy lives. She’s extremely passionate about this idea... and isn’t willing to compromise.  \n  \nOn the other hand, I’m thinking about using the money to upgrade our house. Our dishwasher is on its last legs... our bathroom could use some work... and there are a few other upgrades that would make our home more comfortable and increase its value. These improvements would benefit us long-term, and I feel they are more practical.  \n  \nThe tension is really starting to build. She’s very emotional about this... saying we deserve this vacation after all the hard work we’ve put in. She won’t budge on her stance, and it’s causing friction between us. I understand her perspective, but the practical side of me can’t ignore the long-term benefits of investing in our home.  \n  \nI’ve suggested a compromise... maybe splitting the money between a smaller vacation and some home upgrades... but she feels we should go all-in on one option to really make the most of it.  \n  \nI’m torn because I want to support her dream of a fantastic vacation... but I also think about the long-term benefits of investing in our home. I’m hoping to hear from others who might have faced similar decisions. How did you balance immediate enjoyment with practical improvements?  \n  \nWhat do you think would be the best use of this money? I appreciate any advice.  \n  \n  \n  \n  \n  \n  \n",
        "num_comments": 501,
        "comments": [
            "I say this as a person who was widowed at 38. Go on the vacation.",
            "Replace actual shit that needs replacing. Upgrading bathroom to bring up value of house isn't necessary. \n\nSpend whatever is left over for your Europe vacation.",
            "Here's another possible compromise for you two to consider: for whichever option you two ultimately decide - the vacation, or the home upgrades - could there be a savings plan that you two could agree to, for working towards the unpicked option afterwards?\n\nIf you pick the home upgrades for now, how soon could you two reasonably compromise on saving up for a European vacation? And if you go with the vacation, how soon could you two agree on meeting milestones for certain upgrades? Could you agree to go hard on savings to achieve an early outcome? Or more steady, to get to that goal eventually?",
            "+1 to pricing out a family vacation and using what's left for the house. I just booked 7 days in Europe for my family of four during Xmas and the total with flights and nice Airbnb flat is around 6.5k. Gotta book far in advance, like 6 months, and book flights on less busy weekdays to get a good deal.\n\nTo show her you're meeting her halfway, I think you should price out some \"nice\" travel options that don't use up the entire budget. Then propose using the rest for the house.",
            "Please take the vacation. Pick one house thing that won't take up too much, like a new dishwasher, and then take the vacation. You simply don't know what life has in store, and those memories will last longer than a new bathroom. It's not the logical choice, but life is not logical. It's cruel and unpredictable, and beautiful and fragile and so so short. Please go somewhere amazing with your wife and your kids.",
            "Don't spend the money on stuff to \"increase your home's value.\" If there's stuff you're going to need to pay for in the near term, like a new dishwasher, buy it now or set that money aside. Then take the vacation.\n\nAsk your wife to actually draft a plan and budget for the trip she wants and see how much it costs. If there are easy things to cut back, ask her to do so. For example, you can build great family memories without paying $800 to spend one night at a fancy hotel you're just going to sleep in. That kind of thing. Keep the focus on having fun with the kids and not spending money just for the sake of spending money.",
            "Why is this like the 5th windfall vacation or upgrade home story Ive read in the past week??",
            "How old are your kids? If theyre all older than 5, go on the vacation. If not, save the money until they are old enough to make core memories and then go on the vacation. Shes right, your kids will have an amazing memory as they grow up. They wont remember the dishwasher. And honestly, just wait for an appliance sale and get a good deal on one. They really arent that much, even with installation. The bathroom can wait if its still functional. \n\nI promise you, its worth it to make your wife happy on this one. Next step is to avoid the pitfalls of traveling with kids & avoiding that making your vacation miserable. Meaning, your wife is not the cruise director of the vacation. You are equally responsible for planning the trip and parenting at all times on the trip. I see so many posts on here where the husbands just dont understand why their wife wanted a divorce after a family trip.",
            "Take the vacation. Life is short and you never know what it has in store for you. Enjoy this time with your wife and kids.\n\nStart planning the vacation and it might not take up the entire 12k. If it doesnt, put that leftover money towards the house.",
            "Are the kids old enough to really appreciate a trip to Europe?"
        ]
    }
}