{
    "After my 60 hour labor, my husband told me I am the strongest woman he knows, besides his mom.": {
        "title": "After my 60 hour labor, my husband told me I am the strongest woman he knows, besides his mom.",
        "score": 256,
        "url": "https://www.reddit.com/r/relationships/comments/1dln72z/after_my_60_hour_labor_my_husband_told_me_i_am/",
        "content": "And 6 months later is still irks me. I’m glad he loves his mom. She is a timid and awkward woman, but very sweet. His father cheated on her for years and left her. So I agree that she is a strong woman. \n\nBut after being in labor the hospital for 3 days and having a traumatic birth experience, that just really wasn’t what I wanted to hear. “You are the strongest woman I know, besides my mom.” I would have rather heard nothing at all, or maybe just “I’m so proud of you”. \nWhat do y’all think, would this bother you?\n\n****Edited to add: I think this especially bothered me because he often puts his mom and sisters above me and our daughter. I feel like they will always be more important to him. So the comparison didn’t feel good. \n\nTL;DR: after giving birth, my husband told me I am the strongest woman he knows besides his mom. It irked me. ",
        "num_comments": 76,
        "comments": [
            "Yes, it would bother me. Because there was no need for a comparison. He can compliment you and show appreciation for you without bringing anyone else into it. There was no need to bring his mother into the moment where you who had just endured days of agony and trauma to bring his child into the world. But I do think it’s unlikely that he meant it to sound the way he did, so you’re going to need to find a way to let it go. If it were me, I might just tell him that it bugged me and why and say that I know his intentions were positive but that in the future I would appreciate it if he didn’t compare me to his mother or to anyone else, especially in my most vulnerable moments.",
            ">  I think this especially bothered me because he often puts his mom and sisters above me and our daughter. I feel like they will always be more important to him. So the comparison didn’t feel good\n\n\nI think there's nothing to gain and everything to lose by you keeping quiet about this.\n\n\nJust showing him this thread can get a painful but long overdue conversation started; but perhaps you need to drag his ass to couples therapy to hash it out there.\n\n\nDon't just sit there with your resentment in silence. It's not a minor thing, and it will e d Up destroying your marriage.",
            "I see a lot of people finding ways to excuse him when there’s really no way to make “you’re the strongest woman I know next to my mom” anything other than “you are still coming in second to my mom even though you have suffered through pregnancy and labour to have children with me”\nI’m not saying he shouldn’t love his mom, but you should be first in his eyes, and even if you’re not, in that moment there is no justifiable reason for the comparison.",
            "Yup, that would bug me too. Poor choice of words on his part.",
            "The comparison just doesn’t make sense and cannot compare the two so it annoys me as well.. \n\nHis mother is probably strong in other ways.. maybe.. \n\nI hate it when my fiancé puts his parents on a pedestal especially when his father left his mother for another woman and his mother left the state when two of her young children were struggling with addiction.. not to mention she encourages and enables their addictive behaviours which is why half of the children are the way they are and a product of their parenting which I now deal with.",
            "It would bother me as well. The moment was supposed to be about YOU not his mom.",
            "It would bother me. Why qualify the statement?",
            "I think what he meant is he knows and you know that his mom is the woman he admires most in his life and watching you give birth shot you way far up there right along with her",
            "It would also bother me, that comparison was unnecessary.",
            "It would bother me. Why qualify the statement?"
        ]
    },
    "My husband wants another baby and I don’t. ": {
        "title": "My husband wants another baby and I don’t. ",
        "score": 421,
        "url": "https://www.reddit.com/r/relationships/comments/1dlhk1w/my_husband_wants_another_baby_and_i_dont/",
        "content": "Me (30F) and my husband (35M) have one child together (5F). For the entirety of her life we have been in agreement that we don’t want more children. I had a rough pregnancy accompanied by a rough labor and delivery. I am not willing to do it again. \n\nUntil recently it hasn’t been an issue, however over the past few months my husbands parents and sisters have been in his ear about how he and I need to try for a boy. He is the only son his parents have and therefore the bloodline dies with him. I sympathize with this but I don’t understand “trying” for a boy. There are no guarantees. My husband seems pretty set on this and I’m worried it will negatively affect our relationship. \n\nDo you think this is a phase? Should we consider therapy? Is our marriage over? Any advice is welcome. Thanks. \n\nTL;DR: my husband wants a second baby, I don’t.  ",
        "num_comments": 276,
        "comments": [
            "Why does the bloodline die with him? Your daughter could have children, and even keep her maiden name. Their genes will live on. This is so silly. What would they do if you had a dozen more girls, request you get gender-selected embryos implanted so the Smith Family Lineage doesn't crumble to dust?",
            "His bloodline? What, is he royalty? If you don’t want another kid, then you shouldn’t have one.",
            "\"Trying for a boy.\"\n\n\nAs if couples can *will* a specific gender. Sure, sure.\n\n\nWhat if the next kid is another girl?? You'll then have *two* girls who are viewed by their own father and grandparents as lesser? What if you do have a boy, your existing  daughter will be pushed aside for her brother because his dick inherently makes him better?\n\n\nHis parents *have* multiple girls and one boy!! And look at the result - they've fed this sexist bullshit so often and I'm sure from such an early age, that even the women want to uphold this dumbassery!!\n\n\nIf your husband doesn't understand that he *and his entire family* are sexist asshats... I'd start with never having another child with him. And I would seriously and critically observe what your child has been exposed to - as should be evident, sexism can be highly insidious, and make no mistake, she is absorbing *all* of this shit.\n\n\nI won't scream divorce... but look at what you're up against, and fight accordingly. Your daughter is the one who's in the middle of a sane human (you) and a barrage of sexism.\n\n\nIf you haven't, start *now* talking to her about gender and gender expectations (and how they're fucking stupid). They may not be pleasant conversations, but the other side of the coin is her looking at daddy and daddy's family and deciding that *they're right*.",
            "Ask him what happens if it’s a girl cause even if you change your mind and have one doesn’t guarantee a boy and you definitely won’t have a 3rd",
            "His bloodline? Is he the heir to an earldom? Also, why can’t a daughter carry on a bloodline? She’s just as much his blood as a son would be. Tbh, if I was married to a man who thought like that, I wouldn’t be.",
            "This such a silly opinion, my god. Surely by \"bloodline\" they just mean surname, because your daughter is just as much his blood as a son would be. And to assume that the name dies with her is steeped in further sexism, assuming that she \"must\" marry, and when she does, that she \"must\" take her partner's surname. He has no way of knowing that will occur. \n\nHaving an entire child just to keep a surname going is completely selfish and ridiculous. He has no idea, can't possibly conceive of what he is asking of you by asking that you have another child. Easy for him to do, he doesn't have to carry or give birth to it. Not to mention the biggest part of this: there is absolutely no guarantee it will even be a boy. What happens then? He puts more pressure on you to keep pumping out kids til he gets his precious bloodline baby? Please tell him no and and that it's a complete sentence.",
            "His “bloodline” lives in his daughter. His argument is pure misogyny.",
            "He's literally placing his ego over your quality of life and medical safety. \n\nThat is unacceptable, and you should tell him as much, in no uncertain terms. Now is the time to be blunt and firm.",
            "oh fuck his bloodline lol that shit is so stupid.  stand your ground and if he’s so adamant about it, try therapy but this could be a game changer relationship wise",
            "I'd make sure you are on birth control that can't be tampered with by him without you noticing. Also I personally don't hold much stock in men wanting children since their contribution to biological children is an orgasm. I would also be appalled by this level of sexism, your daughter is a lesser child because she is a girl."
        ]
    },
    "I (38M) accidentally ended up tracking my wife's(38F) periods and realized that my entire life revolves around her cycle...concerned about her health and wondering if I should say something?": {
        "title": "I (38M) accidentally ended up tracking my wife's(38F) periods and realized that my entire life revolves around her cycle...concerned about her health and wondering if I should say something?",
        "score": 1711,
        "url": "https://www.reddit.com/r/relationships/comments/1dl3enn/i_38m_accidentally_ended_up_tracking_my_wifes38f/",
        "content": "My wife and I (both 38) have been married for about 12 years and have 2 kids in elementary school. She's the love of my life, and everything you read below should be rooted in the fact that I love her and I'm trying to be a good husband to her.\n\nSo basically I pulled an Abed from Community...I started becoming concerned that my wife was bipolar because she would sometimes be extremely energetic and fun and sexual and just kind was this force to be reckoned with. Other times, she would become so argumentative and standoffish and unstable but also withdrawn and depressed that I worried she might do something to hurt herself. She always chalked it up as depression symptoms.\n\nI love her so much, and it was obviously not fun for me to become her figurative punching bag, but I always had hope because of the other person she could be. So in a moment of frustration after being told that what I was describing in a fight about her behavior wasn't even happening, I decided I was going to track some of her behaviors for a year to see if I could learn anything that might help and to make sure I wasn't making this up. I didn't want a \"gotcha\", I just wanted to see if I really was remembering things inaccurately because I felt like I knew what was going on but the gaslighting about my own memory was effective.  As I've alluded to, I basically ended up tracking her cycle. From the time her period ends until maybe 10 days after, our average sex frequency is daily and hot. She gets a lot accomplished, and if anything she's too ambitious about the number of projects she takes on.  House projects, volunteering stuff, visiting a friend who's lonely, organizing family outings or extended family events...it's like she has more energy than time to accomplish everything she wants to do. She's a wonderful wife and mother, showing lots of love and affection.  I'd marry that woman twice. For the other 20 days a month, we have a sexless marriage. She's kind of just getting by emotionally, at best. She works out less and she is moodier. In the week leading up to her period, she's borderline abusive. I try to get the kids out of the house as much as possible so they have fewer hours with her and generally just stay away from her. If she was always that person, I'd divorce her, but I know that it's just cyclical now. Knowing about how she changes through a 30 day cycle has made me a better husband and better at anticipating her needs, although like Abed, I think it would be creepy to explain how I got so much more thoughtful.\n\nSo I'm not the first guy to notice that his girlfriend or wife is harder to be around at certain times of the month, and I'm trying not to be a neanderthal here.  I've got some life experience, I've been in other serious relationships, and I'm a caring and loving husband: this isn't normal. Her swings through the month are a much, much wider variance than most people experience. Your average person seems to maintain who they are from week to week with just a little change up or down, but she's like 2 or 3 different human beings over the course of a cycle.\n\nShould I be worried about her health? If I should, is there a way to make these worries known without sounding like a psycho who tracked his wife's cycle? I do think this has gotten worse as we aged and after she had our 2 kids. I wonder if becoming a mother led to some PPD and some knock-on effects, but I've never heard of \"period onset biopolar disorder\" which is what I feel like I'm experiencing.\n\nHow can I take this random information I know and be the most helpful / least off-putting about what i know?\n\n\n-----\n\nTL;DR: My wife is a good person overall who demonstrates wild mood swings.  I started tracking things to see if I was crazy...fights, times she initiated sex, times she snapped at the kids, times she did random acts of kindness, etc. and realized I was tracking her cycle and her actions line up perfectly.  What do I do with this information to be the best husband?",
        "num_comments": 436,
        "comments": [
            "Look up Premenstrual Dysphoric Disorder (PMDD) and see if any of it resonates with you. I have it and during the luteal phase ( the period after ovulation up until the start of menstruation)  I am a completely different person. I however have a tendency to self isolate during this time because my mood is so bad I know I will be horrible to people I care about. I get wildly depressed, anxious, irritated, don’t want to be touched, can’t sleep, and sometimes straight up suicidal. \n\nI’m fine now after getting my hormones regulated. You wife might not have PMDD at all but it definitely is tied to the hormone fluctuations people have during their period. She needs to see someone. It’s really\nCommon for people with PMDD to attempt suicide, and it often isn’t picked up/diagnosed until this happens.\n\nIt’s also not fair on you or your kids.",
            "I will agree that it sounds like PMDD. I will also warn you that it is difficult for doctors to recognize and therefore difficult to get treatment for. It took me doing the research myself and then going to the psychiatrist, primary care doctor, and gynecologist before I got any help. So don't be surprised if you go to your wife and she says that the doctor didn't see anything wrong. She might need your tracking before they take her seriously.",
            "I have PMDD. Exact same situation. Psychiatrist had my mom track my moods to see if I was bipolar. Mapped exactly to my period.",
            "PMDD is real and it can get worse during perimenopause, as your hormone levels drop (ask me how I know!) I can now tell when I'm two days out from my period starting because I get spikes of white-hot rage, severe enough that I actually worry that I'm going to go HAM on someone and lose my job, it's so strong and barely within my control. Then the day after my period starts it's gone like nothing happened.",
            "My husband noticed the same thing about me. he asked me to mention it to my OBGYN. Really pissed me off, but I did. My doctor ordered all kinds of blood tests. Turns out, I have high prolactin levels, which need to be monitored by MRIs and a neurologist to routinely rule out pituitary cancer. \n\nI'm on meds to lower it, and my moods have stabilized. \n\nIf you see something, say something.",
            "I can also add that at her age, perimenopause is a real struggle, she can have her hormone levels checked and at least have awareness of where she is at. Some women start perimenopause around 40! I understand you are struggling, but she is probably also struggling with the intense hormonal changes that happen to women at this stage in their life. Good news is that these things level out after menopause I’ve heard",
            "The one thing I'll say here is - I (f) have always been exceptionally stable across all cycle phases. My mood or outward expression never changed. UNTIL one month I had some sort of hormonal imbalance and OH MY GOD did I have a tough time. I thought women were exaggerating, but I get it now - I cried multiple times per day over really stupid shit (like my dog won't come when I tell him to come), when normally I cry once every couple of years. \n\nI can't even imagine how frustrating it would be to live with such mood swings every month, and I think she should look into it so it can get better, both for her and your sake.",
            "Hi! I have PMDD. My doctor prescribes a low dose SSRI for me to take for 14-ish days and it helps a lot with the mood swings. I take it from ovulation until the start of my period. It’s been super helpful at keeping me level-headed and it feels low committal cause I don’t have to be on it 24/7 and I can skip a month if I want to be able to drink or whatever for an event or vacation.\n\nI worry therapy won’t be helpful because it literally feels like you’re going insane. Also, you can’t really tell it’s happening until your period starts and you’re like OH that’s what that was. I’m sure she’s noticing the swings as well. \n\nCome at her with kindness and understanding because that’s what she needs. Give her a lot of reassurance. Men don’t usually experience having 4 different moods per month so be mindful if you try to compare yourself to her. Women’s bodies are complex. Ask her what she thinks could help and share other options that she might not know about.",
            "You share this information with her in a productive and supportive manner. You offer to support her in determining if these variances are beyond the range of being healthy and if she needs support. \n\nThere may be small changes that can help. Issues with diet, sleep, etc. \n\nAlso, be aware that women’s health care is a sad, depressing and neglected corner of medicine. It’s full of ignorant, gaslighting jerks who delight in throwing up their hands and declaring the women seeking help as hysterical, imagining things, exaggerating, etc. It’s pretty daunting. \n\nShe lives in her body. She likely knows that her cycle makes her life challenging. It does for many women. This is what it’s like living in a world that prioritizes men’s healthcare and uses it as the “norm”/baseline.",
            "Sounds like PMDD to me. Have you guys discussed her fluctuating behavior in the past? Honestly I would just tell her you notice that it comes and goes monthly, more or less, and maybe it’s worth talking to her doctor about. \n\nI wouldn’t tell her you tracked it specifically. Maybe suggest she track her mood? I don’t think it’s crazy a husband would notice cyclical behaviors. \n\nYou also have every right to stand up for yourself and your kids, regardless of cause it is not okay to be mean or cruel to the family. It’s okay for you to tell her it’s time for her to look for some answers here."
        ]
    },
    "Evil in laws believed lies about me since the 80s": {
        "title": "Evil in laws believed lies about me since the 80s",
        "score": 18,
        "url": "https://www.reddit.com/r/relationships/comments/1dlsl31/evil_in_laws_believed_lies_about_me_since_the_80s/",
        "content": "TLDR:\n\nEx lied to his family, they been thinking im a B\\^tch since the 1980s, truth discovered last night. \n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nMy mind is blown after a conversation last night with a sister in law I always liked.\n\nI thought she was weird with me as a reaction to my divorcing and taking my children away in the mid 90s.\n\nDivorced ladies were a scandal back then, most terrible of people, way worse then the abusive husband.\n\nI dragged my children up on benefits while doing voluntary work and giving up cigarettes so I could buy food.\n\nI could not afford enough heating so we  had ice inside the windows every year and little food.\n\nNo car, no hairdressers, no nice clothes, my children were bullied for their appearance but I had to buy food before all else.\n\nRelatives never checked and they were very wealthy.\n\nI was resentful but thought, well my children are not theirs so they should not be paying for them but what horrible aunts and uncle.\n\nI did work as well when able ( health issues)  low pay  still not enough as my rented house was old and too expensive to heat, money did not stretch to everything.\n\nEx would often phone and abuse and threaten to burn us out.\n\nI still have the tapes and the little hand held recorder, I had to answer his calls but would put the phone receiver near the recorder (1990s) so I can prove what he was doing.\n\nWhen he died unexpected in 2015 I asked his relatives to pay for his funeral.\n\nThey refused.\n\nI have been angry ever since as these people who had never asked about my children were disgusting to me at the funeral I arranged and paid for. \n\nI arranged etc as my son was upset, my daughters told me to leave him not bury not pay but I thought I had to do right by my son.\n\nI have wanted so often to go and see these people and tell them what I thought of them but never had the courage. I did visit with that intention but always backed out.\n\nI have been visiting my sister in law recently as I like her and she was never terrible, always told her husband ( my exs brother) off when he was nasty to me. Her husband is away atm so I can visit her and we get on great.\n\nYesterday she said something weird.\n\nTurns out they knew I left but he told them we were back together and they believed him.\n\nThey thought he was mister wonderful husband and father and I was a b\\*tch.\n\nThey would phone him, arrange to visit and he would meet them in town and say I was busy.\n\nWe lived a few hours away so the visits were not often.\n\nThey had no idea we were short of heat etc.\n\nNo wonder exs brother refused to pay for the funeral and was nasty to me.\n\nI cant say they were extreme nasty to our ( all exs children no suggestion they were not exs that I know of) although when visiting last week my daughter saw a photo of ex when ex was young and gasped at how identical her brother is to ex and SIL made a very strange grimace face, that just struck me as I write this) children at the funeral, just not sympatric  - they were polite but the atmosphere was way off, BIL was downright rude to me at the funeral. SIL told him off. \n\nSo last night when I visited SIL now in her 80s and she asked a direct very surprising question I told her we were divorced in the 90s and he was nasty and cruel and stole from me and fooled me into lending him money and stuck me with his debts, what can I say, Im stupid and I know it. I paid his debts when I could not prove they were his not mine and lent him money so he could buy a car to get to work, never repaid of course. I got a loan for the car when I got a job.\n\nIn laws thought he was living with us and paying everything. Children never got so much as a birthday card, no presents, no pocket money from ex unless one of his girlfriends was around then he would make a big fuss in front of them and give them money.\n\nBrother in law is living in  a Retirement Home now.\n\n SIL is living alone so visiting her has been weird as I didnt want to upset her but do like her and wanted to know why they were so weird and rude to me. I never did get up the courage to  ask a direct question, thats why I like SIL, she is very forthright and did ask a question which led to this discovery.\n\nI visited last night on my own. SIL is discrete enough not to ask a question when her hubby or my children were present. \n\nMy daughter was not with me when I visited last night. I told my daughter what SIL said when I got home.\n\nWe are both reeling and so is SIL.\n\nNow my daughter wants to phone BIL and make sure he knows I am not a B\\*tch.\n\nDaughter is very relieved as now she knows it was her dead ( Freudian slip Im keeping it , I meant to write dad not dead) telling more lies and maybe her aunt and uncle might be decent people who stayed away due to her dads lies not because they didnt care.\n\nSo many years of resentment and anger due to exs lies.\n\nWaiting now to see if BIL says anything or will just brush it off.\n\nVery glad I never threw out the tapes of EXs threats. Now I have to check they work as they are ancient.\n\nBIL thinks his brother was the best thing ever on this planet so I doubt he will believe he was anything less.Writing as I needed to vent and organise my thoughts ( not sure it worked im still confused and reeling) \n\nIm in my 60s now and had a hard life. I just want to sort things out, have lies about me settled and maybe have a nice uncle and aunt for my children even if they are not young anymore.\n\nMy daughter wants my BIL to apologise to her mother for being rude to me at her dads funeral. BIL met my daughter for the first time since she was a baby at the funeral and was very weird with her, I can see why now as daughter was not upset her \"loving father\" was dead. He must have thought we were a family of monsters, no wonder he was rude. Daughter wants to put that right.\n\nWriting as I needed to vent and organise my thoughts ( not sure it worked im still confused and reeling) \n\nNot sure if Im rambling but will post anyway to vent. I did my best to make sense.\n\n\n\n",
        "num_comments": 4,
        "comments": [
            "Damn OP, it feels like \"I'm sorry this all happened to you\" doesn't really feel like enough. At least your in-laws are finally learning what a shitheel their son/brother was. I hope nothing but positives for you!",
            "A little confused why you are surprised. This guy mistreated you and your little ones on all levels, it's in line that he also lied about his (and your) actions when you finally left. The whole point was revenge on you, including cutting off any help any family could offer. \n\nSince you are still so high up in the emotions and so are your kids, see where this goes with the ex relatives. Overall, you'd probably all be better off in counseling and finding your closure there though. Your BIL has had certain opinions for all this time, your ex is dead, your kids are now grown... it's no longer time they will want to get back. The moment to ask was when their sibling died and his kids were fatherless, and they would rather believe you were a horrible person instead of inquire. Big chance that you won't be getting any of the acknowledgement you're hoping for. So reach out to your supports and build up again from there.",
            "Thank you.\n\nWe are still reeling.\n\nOnly myself and youngest know for now.\n\nLots going on so dont want to upset other children.\n\nIDK maybe I should tell them now.\n\nJust don't want him in their heads again.\n\nI think I will wait and see what BILs reaction is",
            "Yes, I think you may be right.\n\nI was just too busy surviving to think what he was saying about me.\n\nI just thought they werent interested as they never had children even though they wanted them. Maybe seeing me with mine upset them so that seemed a reason to me for them not to get involved.\n\nI would like to know what BIL says. \n\nI have the tapes, he does not need to listen to them if he dosent want.\n\nIt upsets me that he thinks Im a b\\*tch. I want him put right. Even if he does not accept it."
        ]
    },
    "My (35f) husband (38m) took a pump and cring to a work trip. ": {
        "title": "My (35f) husband (38m) took a pump and cring to a work trip. ",
        "score": 144,
        "url": "https://www.reddit.com/r/relationships/comments/1dlg13f/my_35f_husband_38m_took_a_pump_and_cring_to_a/",
        "content": "We have been married for 11 years. \n\nI found the rings several months ago and he said they were for us, but we have never used them. \n\nI found the pump about two months ago and he said it’s for “maintenance” so he can stretch out the muscles and keep getting erections naturally. \n\nI found out he took both to a work trip and he says he uses the pump then the ring to release so it doesn’t hurt, but that sounds like BS to me. I feel like he used it to pump and then maintain the erection for someone else. \n\nTL;DR: does anyone have any experience using these devices for maintenance or is it a good chance he is lying? ",
        "num_comments": 137,
        "comments": [
            "Honey please.\n\n\nEven if he WASN'T lying, he took sex toys on a work trip??? Like, absolute best case read here, he's a massive idiot. But you, I, and everyone else in the goddamn world know he's lying.",
            "I mean he's had them for months and you've never used them? Have you been intimate in that time?",
            "Meh, he could just be masturbating. This isn't a smoking gun, that would be a condom. I use a cock ring sometimes by myself.",
            "I’m late to this, but hopefully you still read the comments. What I see in the comments reminds me of older family members, who are convinced that someone is a drug addict if they smoke weed (once), but see no issue in drinking alcohol every day.\n\n\nThere is no way of telling what your boyfriend used a cock ring and penis pump for. But both of these objects are commonly used for penis exercises. There are a few communities here on reddit where you can read about it. The fact you don’t see him using it in your personal life makes me suspect this is what he does with it. I own both things as well and never use them for sex (or what some people have insinuated, to prepare for sex). It’s also slightly embarrassing. The fact you say he has a large penis is completely unrelated to how he feels about it. \nGoogle ‘penis exercise pump reddit’ and look at the results.\n\n\nNow I’m obviously not saying he didn’t do anything wrong, in the end you will know best. Hope you two can have a good conversation to clarify everything.",
            "It sounds like he is ashamed of masturbating with these with you - and is seeing the trip and chance to play without judgment. He may also be trying to increase the size of his junk (which is stupid, the human body doesn't work that way, but guys are incredibly insecure about penis length).",
            "I used to work out of town a lot and have brought those very things with me to masturbate. It seems weird that he wouldn’t have just said that though. BTW PDE5 inhibitors work so much better than all of the gadgets.",
            "Some online medical advice says penis pumps help keep an erection. For example: https://youtu.be/fb0LCD0CXRE?si=swN_L6zKxcysJbIY\n\nBased on your comment, I don’t know that this is the goal of your husband.\n\nListen to your heart.\n\nGood luck.",
            "You say you “found” these devices/toys two months ago. So he wasn’t even honest with you about them from the get go. You don’t hide things unless you actually have something to hide. In a normal, healthy relationship they would just be like “hey, I’m gonna get these, I think they’ll help our sex life.” But no, he hid it from you. There’s a reason why. I would have called bullshit then and there.\n\nNow he’s taking them on work trips? How long are these work trips? Most work trips are a few days or a week at most. Surely he can survive without his precious penis pump for a few days. But nope. He’s gotta take them. It’s very clear why. They’re not for him to use solo. They’re for him to use with someone else. Sorry to be blunt.",
            "Is there some reason he would be resistant to telling you he wants to wank on his rock hard penis for a few hours in his hotel room after a hard days work? Because that is most likely what’s going on. I’d bet money on it.",
            "So, reading the comment section, Reddit, in all it's wisdom, has condemned this man. I would like to know if any women take their sex toys with them even to a work trip? Do you suppose sexual needs don't arise while working? So, he didn't tell you about the toys. Maybe he was afraid you'd react like you are reacting. Maybe he was embarrassed as even in modernity, men with sex toys are considered an oddity. If my lady friend took her toys with her on a work trip or even vacation, I wouldn't think a damn thing about it."
        ]
    }
}