{
    "POLL: What is the best job board for finding remote work?": {
        "title": "POLL: What is the best job board for finding remote work?",
        "score": 54,
        "url": "https://www.reddit.com/r/remotework/comments/1crwcei/poll_what_is_the_best_job_board_for_finding/",
        "content": "We try to avoid posts directly about job boards on this sub.\n\nBending that rule, so we can have a collectively-created resource for those who come here looking for ways to find remote work.\n\nFor this post's comments alone, I invite all who wish to promote their own job boards to comment openly. I'll allow self-promotion, relevant blog spam, you get the idea. Same goes for arguments & debates so long as they stay free of [ad hominem](https://www.logicalfallacies.org/).\n\np.s. Reddit limits polls to 6 options. If you've got an option I missed, feel free to comment it.\n\n[View Poll](https://www.reddit.com/poll/1crwcei)",
        "num_comments": 74,
        "comments": [
            "I have created a job board. Although it may not be the best, somebody can still find it useful. I'm attempting to post only the latest jobs, which means that the newest jobs on my job board were created within the past 24 hours.",
            "At one point I saw a post a woman made for a job board that just specialized in remote healthcare I.T. jobs, which is somewhat my niche. I'm so mad because I've not been able to find it, of course thats my fault too for not immediately bookmarking it.  Does anyone here have any idea of what that may be?",
            "literally every single place is nothing but scam postings so it feels like they're all bad lately.",
            "I am launching one next week. If you are interested in take a look... It will aggregate jobs from everywhere possible in the web, making job hunting simpler and faster.",
            "Indeed does it for me",
            "Why use a job board?",
            "Workbrite.org is good too but requires members area. ",
            "Currently have 52K job listings on it",
            "Are there opportunity for residents in EU on there?",
            "Is this only for engineer / software jobs or do you also scan for public relations / communications positions? (e.g. Director of Communications, Director of Public Relations, Public Relations Manager, Public Relations Director, Public Relations Specialist, etc.)"
        ]
    },
    "Can a visually impaired student get a remote part time work to make himself financially independent?": {
        "title": "Can a visually impaired student get a remote part time work to make himself financially independent?",
        "score": 2,
        "url": "https://www.reddit.com/r/remotework/comments/1dra3u3/can_a_visually_impaired_student_get_a_remote_part/",
        "content": "Hello Everyone,\n\nI am a visually impaired student from India, currently pursuing a degree. I am seeking remote part-time work opportunities to support my education and achieve financial independence. I am a quick learner, eager to gain new skills and knowledge. This is my first time joining a community and searching for work opportunities after becoming visually impaired, and I do not have prior work experience. Any advice, resources, or job leads would be greatly appreciated.\n\nThank you for your assistance",
        "num_comments": 2,
        "comments": [
            "You may try inquiring with vocational rehabilitation, they could have the line in on something, possibly. Or they may know how to make something more accessible such as working from home in customer service.",
            "I'll try that, thank you for your response."
        ]
    },
    "The next recession could boost WFH": {
        "title": "The next recession could boost WFH",
        "score": 2,
        "url": "https://www.reddit.com/r/remotework/comments/1drc81x/the_next_recession_could_boost_wfh/",
        "content": "No 1 reason is cost savings:\nhttps://siepr.stanford.edu/publications/policy-brief/next-recession-could-boost-working-home",
        "num_comments": 1,
        "comments": [
            "The Great Recession led to an initial WFH or remote job occurrence. It ultimately ends up being how well employees can be squeezed before corporations decide paying for office and RTO delivers better results. Unfortunately, employees lack of compliance or abusing the system leads to some RTO in many cases."
        ]
    },
    "Working while traveling the US?": {
        "title": "Working while traveling the US?",
        "score": 1,
        "url": "https://www.reddit.com/r/remotework/comments/1drdfm6/working_while_traveling_the_us/",
        "content": "Hi there, \nI‘m thinking about going on little trip to the West-Coast of the U.S. around September/October. \nIs it a problem at customs to bring a company’s laptop with me, while entering as a tourist? How deep will they scan it eventually?\n",
        "num_comments": 0,
        "comments": []
    },
    "Pros/Cons: Coverting to Contract/Vendor to stay WFH overseas": {
        "title": "Pros/Cons: Coverting to Contract/Vendor to stay WFH overseas",
        "score": 4,
        "url": "https://www.reddit.com/r/remotework/comments/1dr4u3u/proscons_coverting_to_contractvendor_to_stay_wfh/",
        "content": "**Background**\n\nThe company I work for (10+ years) allowed WFH prior to COVID, with some employees moving out of state (all of the company's offices are in California).\n\nIn 2020, I moved to Japan and have been living here, returning to the US for 6 to 12 weeks each year since. My spouse is a Japanese citizen. Our child has dual citizenship (for the next few years at least).\n\nI maintain a residence in California, and continue to pay US Federal and California state and local taxes.\n\n(The company has already put a significant amount of effort into creating infrastructure allowing me to access our network resources from Japan.)\n\nThis year, the company has partnered with a new payroll/benefits vendor, which apparently requires all employees to be US-based, which means residing in the US for at least 182 days out of 365.\n\n**The Issue**\n\nI have started building my life in Japan (working on permanent residency, drivers license, paying into the health care/retirement system, etc.) and have been hoping to spend less time in the US when I return. Now, I have to consider disrupting my life and spending half the year in the US (most likely separated from my family).\n\nFor reasons I'd prefer not to go into, I do not want to give up this job and hunt for another US-based job that would allow me to live in Japan but earn US dollars. I certainly don't want to find a job based in Japan earning JPY (the work I do isn't really done here anyway).\n\n**The Question**\n\nIn the past, I've been the sole proprietor of an LLC set up to allow me to work for various companies as a 1099 vendor, rather than as a contract employee.\n\nI'm wondering if there's any benefit to restarting my LLC (based in California) to do this, rather than pursue converting from a full-time employee to a contract employee. I feel like companies are more comfortable contracting with outside 1099 vendors to provide services than working with contract employees (we already use non-1099 vendors for some services that replace in-house employees with workers outside of the US).\n\nLuckily I can discuss this pretty openenly with my immediate superiors, but they won't have any insight into how the company's upper managment will react to my suggestion.\n\nHas anyone been in a similar situation or have any insight into converting from employee to contract service provider?",
        "num_comments": 4,
        "comments": [
            "I have contractors from all over the work. I'm based in CA myself. Set up a LLC elsewhere. You won't need to deal with CA government and you won't need to pay at least $800 per year to keep your LLC in CA.",
            "If the relationship between you and your employer, and the circumstances under which you are providing the work for your employer, remain the same as they currently are, you will be considered by the IRS to be an employee, not a contractor, regardless of whether you create a single-member LLC. Worker (mis)classification examinations remain a big audit target for the IRS, states and, now, the Department of Labor. Your employer may agree to take that chance, but it does expose them to potentially significant liability. You will also lose any benefits they are providing and will have to pay self-employment taxes (in addition, of course, to income taxes).",
            "If OP’s required US residency is in California, OP will still be subject to CA income taxes even if the LLC is created in another state.",
            "Thanks. That's useful information. \n\nI'm wondering if I brought on a partner who could also provide some additional services (work we currently outsource to a vendor) if that would clarify the LLC I use as an actual company providing vendor services, rather than a single, missclassified employee."
        ]
    }
}