{
    "⭐🚨🚨🚨 INTRO AND GUIDE TO REPTIME WITH UPDATED LINKS 🚨🚨🚨⭐": {
        "title": "⭐🚨🚨🚨 INTRO AND GUIDE TO REPTIME WITH UPDATED LINKS 🚨🚨🚨⭐",
        "score": 1477,
        "url": "https://www.reddit.com/r/RepTime/comments/113x2ox/intro_and_guide_to_reptime_with_updated_links/",
        "content": "**Updated June 27, 2024**\n\nWelcome to Reptime! It’s a great place to hopefully help you find what you’re looking for. There’s a lot of information and it all depends on how far down the rabbit hole you wanna go, but you can get anything from the crappy DHGate/AliExpress $30 fakes, all the way to a top tier replica for $350-900. You can even go further than how it came to you from China by “frankening” the piece – adding genuine and other modded components to help the watch achieve a look ‘even closer to gen’.\n\nThere are a few terms to understand in order to begin here. I don’t endorse them, sometimes I use them, but they are used frequently:\n\n- Rep: Replica\n\n- Gen: Genuine (referring to a genuine watch)\n\n- QC: quality check – in reference to photos of watches\n\n- W2C/WTC: Where to cop… aka where did you get that? Or Link?\n\n- TD: Trusted Dealer (I’ll get more into that later)\n\n- ZF, Noob, V6F, BP, MK, ARF, JF, etc: some of the top factories (I’ll also get more into that later)\n\n- 2xAR xtal: a sapphire crystal coated with 2 layers of anti-reflective coating\n\n- GL and RL - Green and Red light, referring to QC pictures being OK to accept or not.\n\nNow for the ‘tiers’ of reps:\n\n**Bottom Tier**\n\nIf you want cheap stuff, no or bad QC, but want to pay $200 or less, go to [](https://www.reddit.com/r/ChinaTime/) or:\n\nDHGate\n\nAliExpress\n\nTaobao\n\nI won’t tell you what to search or how to find it there. I don’t use it, the watches there barely resemble the watches they are trying to represent. It’s just not worth it unless you want to try it on a shoestring budget (my own opinion)\n\n**Mid Tier:** Guide to budget tier factories are here - these are usually pretty good but lack fine details/higher quality materials of the higher tier factories: [https://www.reddit.com/r/RepTime/comments/ydj6h7/guide\\_best\\_budget\\_midtier\\_replicas\\_250400/](https://www.reddit.com/r/RepTime/comments/ydj6h7/guide_best_budget_midtier_replicas_250400/)\n\n**High Tier:** See the guide for 'who makes the best' for most popular watch models here: [https://www.reddit.com/r/RepTime/comments/pxdzn9/guide\\_who\\_makes\\_the\\_best\\_watch\\_model\\_factory/](https://www.reddit.com/r/RepTime/comments/pxdzn9/guide_who_makes_the_best_watch_model_factory/)\n\n# Step by Step Guide for Ordering a Watch\n\n# 1. Choosing a Trusted Dealer (TD) (list with links below)\n\nHere are the TD's for [RWI](https://forum.replica-watch.info/forums/trusted-rep-dealers.147), [Repgeek](https://www.repgeek.com/trusted-watch-dealers/) and [RWG](https://www.rwg.bz/board/index.php?/topic/60-rwgs-trusted-dealers/) Do not under any circumstances Google a TD, use the forum links provided only! **Note that any TD can get any watch if it is still being produced!** So, if you see a watch on Intimes website and not elsewhere, it doesn't mean you are restricted to just buying from that website. Simply ask your chosen TD to get the watch, you can even send them the link or screen shot if the genuine watch! Use TD's websites as a catalogue and a way of window shopping. Overall they are not regularly updated and any TD can source just about any watch if sent a picture of what you require.\n\n**Reptime does not have TD's!! If they have a trusted dealer flair here, then they are a trusted dealer on one of the forums linked above.** To have any recourse with any TD you will need to **join** the forum **before** you purchase a watch. There is no point in posting a tirade about it here on [](https://www.reddit.com/r/reptime/) you'll just get roasted and probably deleted.\n\nTD's do not make the watches! They are simply the middle men between **you** and the **Factory** (VSF for example). Mostly, the TD's do not have physical contact with the factories or watches, they simply order them, then a courier will drop off a bulk order to them. Then the TD will issue QC photos.\n\nPlease do not think they walk to the factory to buy your watch and collect it, it's not how it goes. This is also how delays in QC's happen, as a TD could be waiting for a batch of a certain watch to be made, thus, delaying your QC. Some TD's will have 24 hour QC stock on hand, which you can ask for a list of. Usually however this is previously RL stock or something they have bought in bulk to offer as discounted.\n\nTrusted dealers have earned their way to that status – trusted – because they have a large customer base and are willing to go through investigations through the forums that have a tough and active moderation team (RWI, RWG, etc) if a sale goes awry.  Trusted dealers get not a ton of dough from your sale, but they almost all offer a customs guarantee - you will receive a replacement watch for free if customs seizes it. Be nice and remember that they are doing work for you and should be compensated for that time.\n\n# 2. Choosing Your Watch and Factory.\n\nA mid to high tier watch is built by a specific factory. Examples will be: **CF, VSF, ZF, BP, GMF, EWF** to name a few. There are 3 main guides for understanding the factories:\n\nTo view who makes the best watch for each model by general consensus look [Here](https://www.reddit.com/r/RepTime/comments/pxdzn9/guide_who_makes_the_best_watch_model_factory/).\n\nThere is also a guide if you're on a lower budget [Here](https://www.reddit.com/r/RepTime/comments/ydj6h7/guide_best_budget_midtier_replicas_250400/).\n\nThen there is the ladies watch guide [Here](https://www.reddit.com/r/RepTime/comments/w8yzhk/ladies_watch_guide_who_makes_the_best/).\n\nThere are also watches that are classed as **N**ot **W**orth **B**uying **I**n **G**en (NWBIG) [Here](https://forum.replica-watch.info/forum/replica-watch-general-discussion/308081-consensual-list-super-reps-nwbigs) is the link.\n\nAll reps have tells. There is no perfect rep, so **RESEARCH** first by using the links I've provided above or the search bar (aka Serge Barr) and decide on which flaws you can live with.\n\n# 3. Pulling The Trigger.\n\nNow that you have decided on the watch you want, it's time to buy. There are typically three ways to buy. I will list in the order I believe to be the easiest, and how to go about it. I will also give a mock example where applicable. Be aware it is always common practice to check the factory still exists and are still making the watch you require. This to a TD is referred to as \"In Stock\"\n\n**Option1**. Whatsapp.\n\nFind the correct Whatsapp number for your chosen TD. (The TD links have already been listed in section 1). Message the TD:\n\n**(You)** Hi, can you source me a (VSF 116610LN) please, are they in stock at the factory still? How long for QC and how much ? Thanks.\n\nNow, there are such things as time zones, so if you don't hear back from the TD in ten mins or so, consider they may be sound asleep. Allow anything up to 12 hours for a reply. Some Td's have massive inbox queues and it could take 24 hours to receive a reply during busy times. The Td will then reply for example:\n\n**(TD)** Hi, $568 free shipping. In stock 3 day QC.\n\nIt's as easy as that, next you will need to issue payment (see section 4) and give your Name and Postal address. The TD may require an email address to send your QC link to, Some send the QC and deal solely on whatsapp.\n\n**Option 2.** Purchasing via TD's website.\n\n**It is imperative you email the TD before you go this route to check the watch is still being produced. A lot of watches on websites are no longer available as they barely maintain their websites by removing old stock. It is also a great way of taking your money and getting you to switch to something else.**\n\nYou'll have to make an account on the website and/or fill out your details, then, once you have checked out, the TD will contact you for payment (see Section 4). Do not upload any credit/debit card details if asked. Email is a slow process and it could take 3 days to receive payment details. Some Td's only use email, so this is one of the pitfalls of going this route, especially if you encounter a problem once you receive the watch. QC will likely take longer and in general be a slower process than whatsapp. **You Have Been Warned!**\n\n**Option 3.** Direct Email/DM via forum.\n\nSome TD's (Sead from supermirrors for example) are only contactable this way. They will list their current stock on their forum page. You will then have to DM or Email them your requirements the same way as mentioned in option 1. This is another reasonably slow process.\n\nYou can simply send a photo of a watch you are after to a TD and they will tell you if it can be sourced.\n\n# 4. Payment\n\nMost TD's will help guide you through the payment process. Here are some of the ways you can pay.\n\n**1. Wise or Western Union**\n\nEasiest way?: install the respective apps or visit the official website, create an account and enter the details provided by the TD. Then issue your payment. Best exchange rate is via Wise and it is easy to use. You can even link the TD's confirmed payment via whatsapp with Wise. Guides on how to use both are on their respe websites.\n\n**2. Paypal F&F**\n\nSome, if not most will require previous transaction history before they dabble in Paypal with you. Some like Mirotime and Geektime usually accept payments this way first off.\n\n**3. Crypto**\n\nObviously if you pay this way you'll be sending your crypto to a TD's [wallet. You](https://wallet.you/)'ll probably have knowledge on how to use wallets etc. Be sure to record/track the transaction via the blockchain.\n\n**4. Credit/Debit card**\n\nI would advise against paying via credit/debit card **UNLESS** you are using a one time use created card number. Many CC company's will provide this. Remember you are dealing in a counterfeit organization ran predominantly (in the eyes of the law) by criminals. Your TD may be Trusted but the third party they use to take payment may not be. Don't risk being cloned or charged for other fee's.\n\n# 5. QC (Quality Control).\n\nQC photos can take anything from a matter of hours to weeks. It's all dependent on the watch you bought and if the factory are producing batches. Sometime a TD will have stock in hand. Raids, public holidays and batch times can effect the waiting times. If you haven't received QC within **2 weeks** ask your TD for an update. It's down to your resolve on if you want to swap to an available watch or require a refund.\n\nOnce QC photos are received you should generally get good help over at [](https://www.reddit.com/r/RepTimeQC/) if you follow the template used there. I would advise to look up previous posts of the watch you ordered to grasp the common QC issues that can arise. Do not be lazy and write \"looks good\" for everything..\n\n# 6. Shipping.\n\nIt can take anything from a week to 2 months to receive a package depending on where you are on the planet. 17Track is a good app to use for keeping an eye on your parcel. Most TD's have a customs seizure warranty and will replace any watch taken by customs. If this happens, do not reply to the letter you receive and contact your TD. The consensus is just wait it out, it will get there eventually.\n\n7. Receipt of Package/Watch.\n\nNobody has written a guide from what I can see but there are 3 main things I will list here.\n\n1. Remember you have bought a rep made in a low wage factory. The finish may have sharp edges and will need the bracelet adjusting. Buy a decent bracelet removal tool and screwdriver to undo the bracelet screws! Do this the day after you order your watch! There is nothing worse than making a mess of them with some cheap garbage you got from an xmas cracker.\n2. Movement. Now, although replica movements have improved vastly in the past few years, you cannot expect it to be running at +/- 2 secs a day accuracy unless it has been Serviced and properly regulated! Running a non serviced replica is fine, but if its running +30secs a day fast or slow when you receive it, then it's actually acceptable. Yes, your Seiko or homage shitter may be more accurate, but it was assembled in much cleaner conditions, correctly oiled, and assembled in a gen watch factory. If you want it reliable and to last a good length of time [](https://www.reddit.com/r/RepTimeServices/) is where to go. Or go to RWI etc, to get a service done, this will prolong the life of your replica.**When setting dates, forward your hour hands first, so the date changes, then move to 6 o'clock. Now change your date. Automatic watches can be hand wound, so google \"how to hand wind an automatic watch\"**\n3. Water Resistance. Assume your watch is not water resistant, and get it tested. It is your choice if you want to ride bareback into the waters.\n\nDo check the case back for tightness and the crown is screwed in tightly. If it fills with water, or condensates, just vision me saying, \"It's over, I have the high ground\". Or you can build you own tester. [here](https://www.watchuseek.com/threads/diy-water-proof-tester-how-to-build-a-10-atm-100m-watch-water-pressure-tester-for-40.4319282/).\n\nThank you to u/Obi-rep-Kenobi for his great guide on the ordering process - much of this is from him.\n\n# Congratulations, you did it!\n\n**Other notes:**\n\n1. Enjoy the watch. Get a $20 watch service kit from Amazon or whatever and resize the bracelet.\n2. **DON’T TAKE IT TO A JEWELER AND PRETEND IT’S THE REAL THING.** They will lie to your face and make you think they think it's real because its good customer service to make people feel good about themselves. They are trained to do that. Just some practical advice - take it or leave it - don't tell your friends and loved ones that these are the real thing. It's better to be honest. If you want to know the full reason, PM me, I'm happy to share why honesty is important.\n3. What if your watch is broken upon arrival? You MUST make a log in on the forums where the dealer is a trusted dealer, and post enough there in order to log a ticket to file a dispute. They will not help you if you create an account after your issue arises with a TD. It is their rules.\n\n\n\n# Trusted dealer websites (these are the TDs from the forums - RepTime has no official Trusted Dealers!)\n\nThe website addresses change frequently due to the original companies wanting them taken down for understandable reasons. The websites are usually down for a night then back on a different domain the next day – they change probably 2-3 times per year. If you want an updated list (in case these domains get seized and I haven’t updated the post), go to the forums and see if they put a new one up. There are more than these TDs on the forums, too, this is not an exhaustive list. Also please note, [](https://www.reddit.com/r/reptime/) has no official Trusted Dealers, this is just a list I made to help others know some of the major ones out there that are vetted by the bigger forums. If you need help with any of the trusted dealers, you MUST be a member of the forum where they are listed as a TD in order to receive support.  **DO NOT GOOGLE TD WEBSITES, THERE ARE KNOWN SCAMMERS.**\n\nLinks edited to avoid filtering.  UPDATED June 27, 2024:\n\n\n\n[https://andiotwatches.com/](https://andiotwatches.com/)\n\n[https://chazingtime.io/](https://chazingtime.io/)\n\n[https://ctime.io/](https://ctime.io/) Also posts here\n\n[https://drtime.io](https://drtime.io) - [](https://www.reddit.com/u/drtimemeister/) and [](https://www.reddit.com/u/drtime888/)\n\n[https://www.dealerclocks.io/](https://www.dealerclocks.io/) \n\n[https://www.DukeReps.com](https://www.dukereps.com/)  -  [](https://www.reddit.com/user/DukeJones_watches/) on reddit as well\n\n[https://geektime.watch](https://geektime.watch) TD with Excellent service, posts frequently here [](https://www.reddit.com/u/geektimewatch/)\n\n[https://s.wsxc.cn/TJUCP1](https://s.wsxc.cn/TJUCP1) Hontwatch; here on reddit as well, very responsive on whatsapp - [](https://www.reddit.com/u/hontwatch/)\n\nInstagram: Inlandandinhand - US Based TD [from RWI](https://forum.replica-watch.info/forum/supporting-vendors/inlandandinhand/10837301-welcome-to-my-section) has whatsapp as well\n\n[https://intime06.co/](https://intime06.co/)\n\n[https://jtime.io](https://jtime.io) TD with excellent service\n\nu/lykanjt - US based trusted dealer.  Message on reddit or whatsapp\n\n[https://mirotime.io](https://mirotime.io) TD with excellent service, posts frequently here [](https://www.reddit.com/u/mirotime/)\n\n[http://theonewatches.cc](http://theonewatches.cc) also has a reddit account [](https://www.reddit.com/u/theonewatches/)\n\n[https://puretimewatch.io/](https://puretimewatch.io/) Been around for a long time u/puretimewatches\n\n[http://trustytime888.io/](http://trustytime888.io/) has videos of nearly every watch, posts here occasionally [](https://www.reddit.com/u/trustyworld/)\n\n**There are loads of reviews for TDs and you should do your homework both here and on the forums before buying**!\n\n***Full list here (must be a member to see)***\n\nRWI: [https://forum.replica-watch.info/forums/trusted-rep-dealers.147/](https://forum.replica-watch.info/forums/trusted-rep-dealers.147/)\n\nRWG: [https://www.rwg.bz/board/index.php?/topic/60-rwgs-trusted-dealers/](https://www.rwg.bz/board/index.php?/topic/60-rwgs-trusted-dealers/)\n\nRepGeek: [https://www.repgeek.com/trusted-watch-dealers/](https://www.repgeek.com/trusted-watch-dealers/)\n\n**Forums**\n\n[https://www.replica-watch.info/](https://www.replica-watch.info/) (the most popular)\n\n[http://www.rwg.bz/board/](http://www.rwg.bz/board/)\n\n[http://www.repgeek.com/index.php](http://www.repgeek.com/index.php)\n\nPlease go to these and get a log in and check out the topics. They are insightful, and incredibly informative. There’s even a member sales section there too if you have enough posts.\n\n# Factories\n\nThere are certain popular factories to choose from and not all ‘good’ factories are the popular ones. Some of the smaller factories specialize in one or two watches but they are GOOD. The factories in total release probably 2-10 new models *every week* (granted lots are shitty). The way factories work, from what I’ve read, is that someone who wants to make a watch will order dials from a dial plant, cases from a manufacturer who specializes in case making, etc, and then receive ‘proofs’. Once they approve of the proofs, they will then order batches of 100-500 and manually assemble the pieces (dial, case, hands, date disc, movements, straps, buckles, etc). This is not easy stuff and usually they know what they are doing. When a watch is out of stock, it can be out of stock forever.\n\nMajor Factories (detail received from many postings around the internet, sometimes shamelessly copy/pasted):\n\n* **ZF**: High quality factory for most non-Rolex watches. Overall a good factory with solid releases. Just starting to branch into AP and RM, and they are pretty good.\n* **Noob / N Factory**: NOW CLOSED :( Noob factory is probably the most famous factory among others, they started a very long time ago and really developing their piece of replica. Noob makes a decent submariner, but have a great Daytona with clone movement, and a good pepsi insert. Besides Rolex, Noob also developing some brands like some Planet Ocean Omega, Blancpain, some Audemars Piguet models, and some Panerai model. Recently (5/12/21) Noob was hit very hard in a raid so their models are on hold for \\~6 months (rumor on timeline).\n* **VSF/V6F/XF/HBB/KW**: re-opened. All fall under a common parent company, but VSF specializes in Omega and Rolex super-reps and Panerai, V6F does quite a bit of projects (though the name isn't used much nowadays) and XF focuses on Audemars Piguet but recently ventured into Vacheron Constantin. HBB does Roger Dubuis.\n* **ARF/JF:** JF is the brand name of AP reps. High quality, great detail, though ZF is showing them a run for their money these days. JF also makes middle-high tier Rolex watches among others. ARF is a division that focuses on high quality Rolex releases that focus on finishing.  Rumor that JF is closing.\n* **JVS:** Newer factory as of 2021, takes inspiration from VSF and aims to release high quality Rolex releases.\n* **ZZF/Clean**: Quality releases recently for Rolex. Rebranded to Clean factory. Be aware of fake\n* **PPF**: Supposedly family of ZF, but focused on Patek. Has the best current Nautilus\n* **BP/GMF:** BP is one of the OG rep factories. Has reps of most brands and models, and are at an affordable price. GMF seems to be a higher end brand focusing on finish, but sourcing from similar places.\n* **MK/MKS:** Focuses on IWC, Patek and Omega releases, though they have branched into other brands too.\n* **TF:** Specializes in tourbillons (hence \"T\" F), but most are 42mm and kind of thick.\n* **GF**: Originally started focusing on German watches (\"G\"F), but have branched into many other Swiss brands like JLC and Cartier. Creates 'copy cat' models for a bit cheaper, and sometimes surprises with improved details\n* **FK**: Makes quite a few reps, most are not very good or just barely miss the mark for one specific reason. However, their Breguet 5177 v3 watch is superb!!! So do not underestimate any release of theirs.\n* **R Factory**: Rolex\n* **YLF**: Connected to ZF, focuses on IWC\n* **VRF**: Specialized in the Rolex arena with an excellent sub, excellent new VR3135 movement, and gold wrapped subs too.\n* **OMF**: Focuses on middle tier quality and prices, but recently have high quality Omega releases\n* **PF:** Revolutionized the Nautilus market with the first thin Nautilus. However, they were recently outdone by PPF and 3K. Focused on Patek, but have other releases.\n* **3K/BTF:**  clone Patek movement releases and excellent Daytona reps.\n* **JJF:** Focused on Vacheron and Patek releases, came out with the great Overseas rep. Rumor is they shut down though.\n\n# Who makes the best Rolex sub?\n\nMy opinion only, there are many different opinions out there. As of February 16, 2023.\n\n1. VSF (116610 and 126610)\n2. Clean (116610 and 126610)\n3. ZF (116610 and 126610)\n\n\n\n# Gold plating, wrap, and diamonds\n\n**Gold plating** is getting better, but it seems to be a mixture of copper and some other materials that give the finish and coloring of gold. There is a tiny bit of gold in there though. If you get a scratch, don’t buff it out, just live with it. A scuff will show the stainless steel behind it if you get a significant enough ding. However, I’ve owned 4-5 rose gold plated watches and haven’t had issues with a single one and I don’t treat my watches too nicely.\n\n**Gold wrapping** is more expensive but also much more thick. It will take a serious ding and still show gold. It has more gold % in it. You can buff it lightly with no issue.\n\n**Diamonds** in a haute horology piece is typically done with a fine gemstone and perfectly placed using a gemsetting technique that isn’t done in the same manner as a replica would be done. If you need or want the look, then do it. Just know the stones are probably CZ, and will fall out easily, and will be inconsistently placed – which gives a poor brilliance when looking at it.\n\n**Movements:** [](https://www.reddit.com/u/eposseeker/) wrote a great summary of the different types of movements out there (non-comprehensive): [https://www.reddit.com/r/RepTime/comments/c889yu/movements\\_found\\_in\\_replica\\_watches/](https://www.reddit.com/r/RepTime/comments/c889yu/movements_found_in_replica_watches/)\n\n# MOVEMENT GUIDES:\n\nRolex edition:\n\n[https://www.reddit.com/r/RepTime/comments/wxu9vm/beginners\\_guide\\_to\\_the\\_clone\\_movements\\_found\\_in/](https://www.reddit.com/r/RepTime/comments/wxu9vm/beginners_guide_to_the_clone_movements_found_in/)\n\nAP, Patek, and RM edition:\n\n[https://www.reddit.com/r/RepTime/comments/wyi6vh/beginners\\_guide\\_to\\_the\\_clone\\_movements\\_found\\_in/](https://www.reddit.com/r/RepTime/comments/wyi6vh/beginners_guide_to_the_clone_movements_found_in/)\n\n# \n\n# BRAND GUIDES:\n\n**A fantastic guide on the Audemars Piguet Royal Oak replicas by** [](https://www.reddit.com/u/N0tail_/)**:** [https://www.reddit.com/r/RepTime/comments/jk9sr0/ultimate\\_ap\\_royal\\_oak\\_buying\\_guide/](https://www.reddit.com/r/RepTime/comments/jk9sr0/ultimate_ap_royal_oak_buying_guide/)\n\n**Rolex Submariner guides:**\n\n1. [https://forum.replica-watch.info/forum/rolex-tudor-replicas/7807136-review-of-zzf-new-sub-116610-ln-and-comparison-vs-gen-arf-noob-and-nail-part-i](https://forum.replica-watch.info/forum/rolex-tudor-replicas/7807136-review-of-zzf-new-sub-116610-ln-and-comparison-vs-gen-arf-noob-and-nail-part-i)\n2. [https://forum.replica-watch.info/forum/rolex-tudor-replicas/8462580-zzf-submariner-v2-ln-vs-gen-pictorial-review](https://forum.replica-watch.info/forum/rolex-tudor-replicas/8462580-zzf-submariner-v2-ln-vs-gen-pictorial-review)\n\n**Rolex vintage 1680 Custom build guide**: [https://www.reddit.com/r/RepTime/comments/mmcfon/guide\\_so\\_you\\_want\\_to\\_build\\_a\\_1680/](https://www.reddit.com/r/RepTime/comments/mmcfon/guide_so_you_want_to_build_a_1680/)\n\n**All brands:** [https://www.reddit.com/r/RepTime/comments/pxdzn9/guide\\_who\\_makes\\_the\\_best\\_watch\\_model\\_factory/](https://www.reddit.com/r/RepTime/comments/pxdzn9/guide_who_makes_the_best_watch_model_factory/)\n\n**On a Budget? See the best $250-$400 replicas**: [https://www.reddit.com/r/RepTime/comments/ydj6h7/guide\\_best\\_budget\\_midtier\\_replicas\\_250400/](https://www.reddit.com/r/RepTime/comments/ydj6h7/guide_best_budget_midtier_replicas_250400/)\n\n**Ladies Watch Guide:** [https://www.reddit.com/r/RepTime/comments/w8yzhk/ladies\\_watch\\_guide\\_who\\_makes\\_the\\_best/](https://www.reddit.com/r/RepTime/comments/w8yzhk/ladies_watch_guide_who_makes_the_best/)\n\n**Guide to known clasp codes for Rolex:**\n\n[https://www.reddit.com/r/RepTime/comments/p3iuaq/guide\\_known\\_rep\\_claspbraceletsel\\_codes\\_from\\_rwi/](https://www.reddit.com/r/RepTime/comments/p3iuaq/guide_known_rep_claspbraceletsel_codes_from_rwi/)\n\n**SHITPOST FRIDAY (SPF):** Memes are absolutely encouraged and a fun part of our community.  In an effort to help focus discussion, please post your memes and funny images on Fridays.  Use the Shitpost Friday flair!\n\nThat about does it. Give an upvote, or don’t. If you think I should add a section, let me know.\n\n\n\n# TL;DR:\n\nBUY FROM A TRUSTED DEALER LISTED ABOVE. THEY BUY FROM FACTORIES WITH ABBREVIATED NAMES, LISTED ABOVE.",
        "num_comments": 370,
        "comments": [
            "Can this be a sticky at the top of the forum. First post at all times. Maybe a link when you  post have you read the guide?",
            "A detailed guide that is helpful to all our friends and of course a time saver for us TDs in the process of talking to our friends, We hope that all our friends will enjoy Reptime with greater ease.![gif](emote|free_emotes_pack|flushed)",
            "I still didnt understand where to get the VSF link so I can buy from them",
            "On the pulling the trigger section:\nYou saying that we have just to text the TD with the factory name and reference thats it ? No link needed or something else ? How to be sure that the watch will be ordered from that specific factory ? \nThanks.",
            "This guide is an invaluable resource for anyone looking to delve into the world of Reptime. From understanding terms like \"Rep\" and \"Gen\" to choosing a trusted dealer and factory for your watch, this post covers it all. Remember, honesty is key when it comes to dealing with replica watches. Thanks for putting this together and sharing valuable insights with the community!",
            "Tl:dr; all you need is a VSF sub",
            " I'M GLAD WE'RE YELLING IN THIS SUB AGAIN\n\nBut for real nice update. I should do Chinatime's guide again, it's been a couple years.",
            "Who do you contact to get your watch modded? Gold wrapped, etc",
            "Can anyone provide me with the details for AF or DRF? Im trying to buy a cartier tank watch. Thank you ",
            "Based on the steps, it seems that we need to pay first then we get to see the QC and decided of RL or GL?"
        ]
    },
    "Happy weekend! What’s on the wrist today?": {
        "title": "Happy weekend! What’s on the wrist today?",
        "score": 35,
        "url": "https://i.redd.it/3myeg2m16i9d1.jpeg",
        "content": "Happy weekend everyone! :) \n\nShoot over some of Saturday’s wrist shots and let’s celebrate the last weekend in June with some style! \n\nIt’s quite sunny and warm where I’m currently located but I’m headed to a special event so I had to dress this piece up. (Also wearing long sleeves due to safety concerns 😂) \n\n(Yes I’m aware the date isn’t today’s date, I hadn’t worn the watch in a while and wanted a 10:10 wrist shot for the aesthetics so changing the date wasn’t much of a priority for the picture) \n\nOn my wrist… the beautiful 5711/1300A. \n\n\n",
        "num_comments": 27,
        "comments": [
            "I hope everyones already had a good start to their weekend! :)",
            "Love the two tone on the brown strap!! Best of luck with the date night buddy ",
            "Wow. Is this a custom build or a gen? It looks stunning. Can you give more insights on the watch?",
            "Beautiful watch! Im new to this community. If Im not sure if Im allowed to ask, but how do you get a custom built watch?",
            "Beautiful :) love the gradient blue",
            "Love the bright orange color! ",
            "You too man, have a nice day ahead.",
            "Youre allowed to ask! This piece I personally put together myself :)",
            "How much did it cost to make the 22k rotor ",
            "This is insane brother; heck if you could put together a piece like this for me Id like to buy it for you"
        ]
    },
    "Clean Explorer II 226570 white dial VS. Gen comparison ": {
        "title": "Clean Explorer II 226570 white dial VS. Gen comparison ",
        "score": 64,
        "url": "https://www.reddit.com/gallery/1dr4fje",
        "content": "",
        "num_comments": 68,
        "comments": [
            "How is it even possible to make a watch this precise and than put a crown like this on it?",
            "The model itself is not particularly my kind of taste, but the level of detail seems to be on a new level. I hope that this will also apply to other models in the future.",
            "Any info on the movement being used for this particular piece?",
            "I prefer GMF for this model. This CF has the same problem or it is the same clock as C+, the lungs start too late and look narrow. Those differences in something as small as a watch, is abysmal.",
            "Crown is a big no no, hope they will fix it soon.",
            "The weight of the dial text leaves a bit to be desired.  GMF has the same issue in more drastic ways, but overall the CF does look better \n\nThis is pretty nice for a first release, assuming it has the DD3285 itll be a great buy.  That crown needs attention too hopefully thats a mistake lol",
            "Dang why dont they just change the text font",
            "The fonts are slightly thicker on the bezel, dial and date wheel, and the crown looks too thick and possibly the crown guards. I don't think you'd notice the bezel or date wheel fonts, but the dial font and the crown are big tells.",
            "The 12hr marker alignment with the Rolex crown on the gen is off.",
            "Gotta wait for second version."
        ]
    },
    "Seems to be hard times for Breitling 😂🥲": {
        "title": "Seems to be hard times for Breitling 😂🥲",
        "score": 12,
        "url": "https://www.reddit.com/gallery/1dr9b5t",
        "content": "",
        "num_comments": 13,
        "comments": [
            "The first one - they should actually pay YOU to buy it. \n\nAnd hopefully this means whole watch market prices go down, because now prices are beyond ridiculous.",
            "The first one looks like a ChinaTime shitter (I know it is a gen, they committed it...)\n\nFor the other ones, it is usual to see Bretlings at AD (outside of Breit Boutiques or airports) at a 25% discount (at least in EU). Nothing new out there. I mean: maybe during the watch-frenzy, these discounts disappeared, but they were the rule before pandemic.",
            "I think they need new management",
            "Seen in a large outlet center in the Netherlands ",
            "For the bears out there",
            "Old watches in an outlet, not a shock.\n\nQuite literally what outlets are for",
            "Or the will be soon like invicta",
            "That sale is crazy. Buy 2 get 4 free?",
            "Shit like that is Invicta's whole business model. Their other wise idea is at a corporate level they have crazy high list prices that the watches never sell close to.  People go into a store and see a list price of $999 and the sale price is $89.99 and they think they are getting a crazy good deal when they are really getting a piece of shit.",
            "Ahh.. that's one 9f the oldest marketing tricks in the book"
        ]
    },
    "Buy a watch🫡": {
        "title": "Buy a watch🫡",
        "score": 74,
        "url": "https://v.redd.it/7nt266r8ve9d1",
        "content": "Just some life advice lol",
        "num_comments": 8,
        "comments": [
            "Life advice is free but watch sold separately",
            "Have a watch addiction? Buy a watch",
            "Can't get it up anymore, buy a watch.",
            "Ive seen this meme so often since its an old ad but do these strips actually work properly?",
            "Instructions unclear, how many do I get to buy?",
            "Le super funny Le meme",
            "I am also applying for a credit card to buy a watch",
            "Also interested. Could use one for my swimmingpool."
        ]
    }
}