{
    "JUNE POST MATCH THREAD: IF YOU HAVEN'T STARTED RESIDENCY YET AND/OR ARE A MEDICAL STUDENT, PLEASE POST IN THIS THREAD": {
        "title": "JUNE POST MATCH THREAD: IF YOU HAVEN'T STARTED RESIDENCY YET AND/OR ARE A MEDICAL STUDENT, PLEASE POST IN THIS THREAD",
        "score": 23,
        "url": "https://www.reddit.com/r/Residency/comments/1d7nw8y/june_post_match_thread_if_you_havent_started/",
        "content": "Since the match there has been a huge increase in advice threads for matched students that haven't started residency yet. Please post all post-match questions/comments here if you haven't started residency. All questions from people who have matched but haven't started yet will be removed from the main feed. After the 2024-2025 intern year has started, the sub will go back to the dumb questions sticky.\n\nAs a reminder, \"what are my chances?\" or similar posts about resident applications or posts asking which specialty you should go into, what a specialty is like or if you are a fit for a certain specialty are better suited for [](https://www.reddit.com/r/medicalschool/). These posts have always been removed and will continue to be removed from the main feed.",
        "num_comments": 49,
        "comments": [
            "Bro anyone else have to furnish a whole ass apartment??? This shit is annoying, I'm starting from scratch but even everything Ikea is gonna run like 2g's at this rate smfh.",
            "Starting my TY year soon. Orientation in 2 weeks. Bored in the meantime. Should I start UWorld studying now to take step 3 early?",
            "Starting my intern year in 10 days, moving to Atlanta suburbs in 2 days.. both excited and nervous about it 🙂‍↔️",
            "Starting a prelim medicine year soon and I'm feeling very unprepared. There probably isn't a way to be so prepared that it's a breeze, but is there anything you all wish you knew/did when you started?",
            "Working long hours straight can be really tough. For me, I can't usually go for more than 4-5 hours without feeling exhausted too so here are a few things that help me out;I like to follow the Pomodoro Technique. I work for 25 minutes, then take a 5-minute break. After doing this four times, I take a longer break. It helps keep me from burning out. Having a comfy chair, good lighting, and a proper desk makes a huge difference for me. If I'm not comfortable, I get tired and achy way faster.",
            "Any simple meal prep recommendations? I have an Instant Pot, air fryer, and a blender along with regular kitchen ware.",
            "Incoming FM resident here. I'm very nervous because it seems as though I've forgotten a lot information I used to know. Sometimes I worry about whether I'll know what treatments to do for a patient or how to put orders in,  etc. I'm really anxious about residency and messing up. Any advice on how to prepare or calm myself down? TYIA",
            "[deleted]",
            "Thank you for contributing to the sub! If your post was filtered by the automod, please read the rules. Your post will be reviewed but will not be approved if it violates the rules of the sub. The most common reasons for removal are -  medical students or premeds asking what a specialty is like, which specialty they should go into, which program is good or about their chances of matching, mentioning midlevels without using the midlevel flair, matched medical students asking questions instead of using the stickied thread in the sub for post-match questions, posting identifying information for targeted harassment. Please do not message the moderators if your post falls into one of these categories. Otherwise, your post will be reviewed in 24 hours and approved if it doesn't violate the rules. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Residency) if you have any questions or concerns.*",
            "Thinking about med school loans, especially since residency is just about to start. I'm planning on doing PSLF, and I would like to start making payments ASAP since my payments will be $0 on the SAVE plan. However, to start making payments, I need to consolidate my direct unsubsidized loans since they have a 6 month grace period that cannot be waived. Has anyone gone through the federal consolidation process and started making payments?"
        ]
    },
    "The Fake Medical Student (y’all have any stories??)": {
        "title": "The Fake Medical Student (y’all have any stories??)",
        "score": 634,
        "url": "https://www.reddit.com/r/Residency/comments/1dlle4s/the_fake_medical_student_yall_have_any_stories/",
        "content": "I had one in my medical school class get coated and make it through a week of class before her college professor saw her Facebook posts about it and couldn’t believe she got in, so called the school. \n\nBut the better one happened during residency. While on an EM rotation, a med student showed up to the work room for her night shift. Confused, an EM resident told her that tonight’s medical student was already here - surely a scheduling mistake. He gestured to a young man in a short white coat with the school’s patch on it. She stared at him closely for a moment then said, “He’s not a med student. He doesn’t go to this school.” Cue anxious whispering. I hadn’t worked with him, but I turned my attention to his fit: school logo was a patch, not embroidered, badge was fake, etc. He had been in the ED seeing patients and telling people he was in med school both at the hospital and in his personal life. The (real) med students later showed me screenshots from his Facebook page showing him posing in a long white coat, bogus transcripts that nobody who went to med school would ever think were real, photos in the ED with patient info/scans visible, and saying he was a “trauma surgery intern” whatever that means as a med student. Homeboy got led out of there in cuffs. Not sure what ultimately happened to him in terms of charges but the nerve to just show up to clerkships… I’ll never quite grasp that mentality. \n\nAny of y’all ever had a fake med student?\n\nEdit: If anyone reading this is a former (or current) medical student impersonator, I think the group would be genuinely fascinated to hear your story and what your overall plan was. ",
        "num_comments": 206,
        "comments": [
            "Why would anyone want to do 3rd year shit for not even a degree",
            "I’m a nurse but I know a fake doctor. She had been telling everyone that she was in medical school for years. She finally ‘graduated’ but decided to ‘put off residency’ so she could ‘take care of her sick mom’. She’s even going to ‘open up her own hospital’. Her own hospital?! She took a bunch of graduation pictures with a white coat, that she got from god knows where, and a disposable looking stethoscope around her neck because she had ‘just lost her littmann’ She works at a couple of different hospitals but as like a unit secretary. She’s on a women’s health advisory council for DHHS, listed as an MD. She is most definitely not an MD. She’s is  real REAL crazy though.",
            "Had one when I was in med school. It was a freshman in college studying neuroscience who I think did some legit shadowing but during that time realized that the process to get a med student badge was ridiculously easy. Go to the correct office and say “hi I’m a med student and need a badge”. \n\nSo she went back and said she was a med student and got her badge and just started following one of the trauma surgery teams around. People only figured it out when they realized her medical knowledge was astoundingly bad and she kept telling stories about high school that seemed a little too recent. (She of course also posted pics to social media)\n\nWe all found out about it because the badging process became much more rigorous",
            "This kind of mental illness is so scary.",
            "Had one in our class - she went on full social media lock mid third year, which is a bummer because I wanted to know where she'd pretend to match",
            "This is common enough that you know TWO??? Damn!!",
            "We never had any fakers when I was in school, but we did have a guy who would come to the med school in a white coat so he could blend in enough to steal student's laptops. School had to make study areas accessible via badge access.",
            "I had a classmate who failed MS1, then failed again on repeat while still pretending to be with us MS2. Come MS3 year (she was expelled by this point) she moved to a different city where one of our clinical sites was and pretended to be on schedule with STEP and rotations. I just assumed she didn’t want to tell her parents or something. But then she was caught toward the end of MS4 trying to see patients in her white coat. No idea why she was this dedicated, because the reading she failed was that she never came to anatomy lab",
            "Twolittlebears anyone? Am I dating myself?",
            "When I was a student, there was a student who had some personal issues that led to her “symbolically withdrawing” from school, as she put it. She dealt with them and then tried to come back the following year. Only problem was the school took her withdrawing seriously and decided that she would need to repeat the semester she withdrew from, rather than just picking up where she left off as she proposed. While this was going on, she attended all of our classes as if nothing had happened. She even sat in the front row and made it known she was there. We all knew she wasnt officially enrolled, and in the end they did not let her back in/ she gave up trying."
        ]
    },
    "I’m 5’9 and I’m the tallest intern in my year by about 2.5-3 inches. My program has 8 spots. It’s 6 women and 2 men, the other dude is shorter than me. Group photos feel so different now lol. ": {
        "title": "I’m 5’9 and I’m the tallest intern in my year by about 2.5-3 inches. My program has 8 spots. It’s 6 women and 2 men, the other dude is shorter than me. Group photos feel so different now lol. ",
        "score": 133,
        "url": "https://www.reddit.com/r/Residency/comments/1dlq1bh/im_59_and_im_the_tallest_intern_in_my_year_by/",
        "content": "Just a different situation I have never been in before in my life. I’ve never been the tallest person in any group ever. The time of the average height 5’9 has come!!!\n",
        "num_comments": 52,
        "comments": [
            "First thought was peds, but I feel like that would have more than 8 residents. So my money's on OBGYN. Am I right? Did I win?",
            "Enjoy these 3 years. (Or however many years your residency is)",
            "I'm not a resident but I do work on an ICU floor. I don't know where they find these nurses but 90% of them are as tall or taller than me and I'm 6'",
            "Definitely not ortho. Thinking Derm or FM.",
            "Gen Z is smaller despite the big personalities lol",
            "I don’t know what the obsession with guys being more than 6 is. 5.5 inches or even 5 inches is perfectly acceptable!",
            "Psych?",
            "Meanwhile I’m also 5’9 and at my program we have 4 women and 12 men and 3 of the women are taller than me as are 9 of the men. Perspective",
            "Dr Gulliver",
            " Neurology?"
        ]
    },
    "As a graduating fellow.. what I wish residents knew": {
        "title": "As a graduating fellow.. what I wish residents knew",
        "score": 469,
        "url": "https://www.reddit.com/r/Residency/comments/1dlgym8/as_a_graduating_fellow_what_i_wish_residents_knew/",
        "content": "Hello friends! I'm finally at the finish line of 9 years of training and SO thankful that it's over.\n\n**First - I'm going to insert my rant**:\n\nOver the last two years of speciality training, the number of times I've wanted to pull my hair out from the phone calls at night.. \"We wanted to make you aware of this patient.\" (For no particular reason other than they get chronic dialysis). \"I need urgent dialysis on this patient\" (Call at 10PM for labs that returned at 6AM). Other \\*clearly\\* non urgent consults at 3AM. Most specialities take home call. This doesn't mean I'm at home, peacefully sleeping in my bed and also get a post-call day after. It means I just finished a 10-12 hour day. Am now having disrupted sleep and still have to work the next 10-12 hours tomorrow. Calls that may seem harmless are not innocuous. I've had 30+ pages in one night. I cannot always fall right back asleep after getting paged. I know that often attendings will make ya'll call but please be the absolute most mindful as possible. If you must call, please be as prepared as humanly possible, know exactly what you're consulting for and ALWAYS speak to your attending before you call me. Particularly in the world of nephrology, I'm frequently consulted by residents for very clear IM issues that do not require speciality level knowledge. Ie - Your attending should be able to answer if your patient needs a bicarb drip.\n\n**Now onto other things:**\n\nNo matter where you are in your training, there are times you are going to want to quit. This job is going to burn you out. Just know that it is (unfortunately) normal and don't be afraid to ask for help. I have gone to therapy throughout the entirety of my training and wouldn't have done it any other way. If you need a break or more sleep, say you need it. No one will advocate for yourself other than you. Do not skip doctor's appointments. Your attendings can be as grumpy about it as they want but ACGME protects trainees. ACGME clearly states in their policies that trainees are allowed to sleep if needed, leave work if they feel they are not able to practice medicine and attending all doctor's appointments. If they say no, report them. Do NOT neglect yourself in an environment where we are brainwashed to think this is normal. You're not a champion for making yourself suffer. The only one that loses is you. Check in with yourself as much as you can.\n\nAlways, alway, always be nice to nurses. Sometimes it can be tough as a trainee because the nurses can be particularly cruel at times. I've experienced more abuse as a female trainee from nurses (not all of them) than my male colleagues. Try to shake it off as best you can because they will make your life harder if you're not. Also, just make sure you're treating other colleagues as good humans in general.\n\nDon't allow any staff to be creepy with you. You are supposed to be feel safe in your work space. GME is there if you need help with this. \n\nYou're going to make mistakes and it's okay. Own it. DO NOT hide it. It will make everything worse if you do.\n\nStart training with little expectations of yourself. You didn't finish medical school one day and then suddenly know all of internal medicine (or whatever residency) on day 1 of residency. Sometimes it might feel like other people around you know more than you. They might, they might not. They may also never sleep or have insane anxiety. Don't compare. You're not inferior or inadequate. We all have strengths and weaknesses. Just try to fill in your own gaps. \n\nMake a support system. Training is one of the few times in life that you sort of have built in friends. Everyone is going through the same struggle. In residency, I always prioritized sleep over social interaction and doing fun things. In fellowship, I learned it's better and healthier to strike a balance.\n\nExercise and eat as best you can. But do NOT pressure yourself or make yourself feel guilty because you're not able to stick to a work out schedule or eat perfectly healthy. It's not reasonable or realistic. Congrats to those who can do it but I find that most of us can't and beating yourself up over it is a waste of time.\n\nTry to maintain contact with family if you're able. There's definitely a balance to strike here because family can also be stressful. I can't speak to what it's like to have children in training and I'm endlessly impressed by those who do. I had days where I was lucky if I did dishes. \n\nLastly, and I cannot say this enough.. **be kind to yourself**. You are doing YOUR best, whatever that looks like.\n\nGood luck everyone out there!",
        "num_comments": 82,
        "comments": [
            "That's great and all, but does my patient need a bicarb drip?",
            "Why did you pursue nephro? Death wish?",
            "I absolutely feel the rant from the first part even though I am more than 5 years out of nephrology fellowship….",
            "Home call feels like one of if not the biggest scams in all of residency. Absolutely brutal.",
            "Take abuse and sexism from nurses, just shake it off? No, thanks. I’d rather stand up for myself, document, and report. \n\nOtherwise, sound advice.",
            "Refreshing to read and great advice!! Big congrats! 🎉",
            "I appreciate you. Thank you.",
            "I ain’t reading this whole thing. You dictate and we screwed into reading your story. Short note fellow!",
            "I could tear up. Finishing my PGY1 year of IM and still feel like I’m drowning every second. Holding on to hope it gets better, and reading this really makes me think it will. Thank you ❤️",
            "A lot of the consults I place after midnight are because my senior tells me to & I’m not arguing with them."
        ]
    },
    "29M 25F Dating in residency": {
        "title": "29M 25F Dating in residency",
        "score": 76,
        "url": "https://www.reddit.com/r/Residency/comments/1dljbey/29m_25f_dating_in_residency/",
        "content": "The girl 25F, I 29M began dating 2 months ago started residency this week. I like her a lot and I'd like this to work out, but I want to know how best to care for her from afar as her life gets hectic.\n\nWe are about 1.5 hours away by distance, I'm always happy to drive, we're not needy people in that we require  constant communication, but I want to make sure our flame doesn't die.\n\n* We text every night for about 30 min, I try not to delve into her days, rather provide an escape.\n\n* I'm considering driving to her weekly to make her dinner once a week and lunch for the next day, Staying the night possibly but if unable, I understand.\n\n* I know she gets a day off per week, and while I do want to see her, I also want to give her \"she time\". I'll have to balance it with her.\n\nHow else can I be there for her? \nAny recs?",
        "num_comments": 30,
        "comments": [
            "Doing the planning for dates and such can help take away the decision fatigue",
            "You grill her on what her plans are for her student loans and demand that she come up with an answer then call her a financial liability and provide an ultimatum for her to figure it out as you see being with her bringing you financial ruin because her net worth is in the toilet then call her out for not knowing what her next moves for buying a house is and burning all her money on rent\n\nLol im kidding dont do that\n\nFacetime while you make dinner is pretty cute or netflix party over videochat and if she wants to brainrot let her brainrot\n\nAlso what youre doing is crazy cute, sometimes she will just look really sad and give short answers, she might just be mentally drained. Ask if anything is wrong and if she doesnt want to talk about just leave it, dont push",
            "just make sure you go down on her regularly",
            "Taking the onus on planning things can help a lot. I might also suggest setting expectations and checking in every so often.\n\nI’d be aware of a few things, though:\n\n* There may be stretches of time where she is unreachable for hours on end and literally cannot text you back (especially if she is in surgery etc and scrubbed into a case).\n* If you hang out with her and her friends/colleagues, they will likely talk about medicine 90% of the time. She may also talk about medicine a lot as it’s what she will be thinking about 24/7. I sometimes feel bad for non-medical SOs when I’m out with friends/colleagues, lol. Medicine can be a bizarrely niche culture.\n* If you visit on weekends there will likely be some where she is in the hospital the majority of the weekend. She can't do anything about this.\n* Residency can be physically taxing. There may be some days where she literally doesn’t have the energy to do anything besides lie in bed.\n* Inpatient months will be the worst for her. She'll be in survival mode during these.\n* First year is usually the worst. Things tend to get better after it.\n\nAnyway, you sound like a great dude. Support her how you can and you guys will do great!",
            "On days that are particularly rough, offer to DoorDash her food; send her flowers to come home to sporadically; plan dates; or if she just wants to veg out, veg out with her; offer to pay for cleaning services; and most of the time if she’s venting after a particularly long day, let her vent and offer support and affirmations- intern year is filled with lots of insecurities since she’ll be brand new at everything, so remind her that she’s smart, amazing, capable, hardworking and it’s not luck that made her come this far.",
            "These answers are detailed/hilarious. I just wanted to add: demonstrating that you care doesn’t have to yield a perfect result.\n\nI work with so many residents with loving partners (and all of this is anecdotal/grain of salt), but many have shared worrying about partners worrying about them. \n\nAfter a rough rotation or a difficult pt outcome they might want to appreciate a partner’s efforts to make their day better…but it’s…a still a shit fucking day. And their partner may do things that can help, but if those efforts don’t “land,” your resident partner may feel like she needs to perform for you too. \n\nTwo months in and you want to get it right? Amazing. I would recommend preparing to not get it right. Because she is doing the same. And sometimes it’s just a whole ass day. \n\nAsk what she needs/wants, read the room, and keep checking in with your own relationship needs.",
            "Some of the top comments when a girl asks how to best support a guy partner are always “blowjobs”. \n\nSo, blowjobs.\n\nEdit: Aaaand there it is. A few pieces of genuine advice and the most upvoted comment is “go down on her”.",
            "do you wanna also date me? 33M 5’8 220 lbs",
            "do you guys call or video facetime daily? or just the nightly texts?",
            "Bleboob?"
        ]
    }
}