{
    "JUNE POST MATCH THREAD: IF YOU HAVEN'T STARTED RESIDENCY YET AND/OR ARE A MEDICAL STUDENT, PLEASE POST IN THIS THREAD": {
        "title": "JUNE POST MATCH THREAD: IF YOU HAVEN'T STARTED RESIDENCY YET AND/OR ARE A MEDICAL STUDENT, PLEASE POST IN THIS THREAD",
        "score": 28,
        "url": "https://www.reddit.com/r/Residency/comments/1d7nw8y/june_post_match_thread_if_you_havent_started/",
        "content": "Since the match there has been a huge increase in advice threads for matched students that haven't started residency yet. Please post all post-match questions/comments here if you haven't started residency. All questions from people who have matched but haven't started yet will be removed from the main feed. After the 2024-2025 intern year has started, the sub will go back to the dumb questions sticky.\n\nAs a reminder, \"what are my chances?\" or similar posts about resident applications or posts asking which specialty you should go into, what a specialty is like or if you are a fit for a certain specialty are better suited for [](https://www.reddit.com/r/medicalschool/). These posts have always been removed and will continue to be removed from the main feed.",
        "num_comments": 58,
        "comments": [
            "Bro anyone else have to furnish a whole ass apartment??? This shit is annoying, I'm starting from scratch but even everything Ikea is gonna run like 2g's at this rate smfh.",
            "Starting my TY year soon. Orientation in 2 weeks. Bored in the meantime. Should I start UWorld studying now to take step 3 early?",
            "Starting my intern year in 10 days, moving to Atlanta suburbs in 2 days.. both excited and nervous about it 🙂‍↔️",
            "Any simple meal prep recommendations? I have an Instant Pot, air fryer, and a blender along with regular kitchen ware.",
            "Starting a prelim medicine year soon and I'm feeling very unprepared. There probably isn't a way to be so prepared that it's a breeze, but is there anything you all wish you knew/did when you started?",
            "Incoming FM resident here. I'm very nervous because it seems as though I've forgotten a lot information I used to know. Sometimes I worry about whether I'll know what treatments to do for a patient or how to put orders in,  etc. I'm really anxious about residency and messing up. Any advice on how to prepare or calm myself down? TYIA",
            "Thinking about med school loans, especially since residency is just about to start. I'm planning on doing PSLF, and I would like to start making payments ASAP since my payments will be $0 on the SAVE plan. However, to start making payments, I need to consolidate my direct unsubsidized loans since they have a 6 month grace period that cannot be waived. Has anyone gone through the federal consolidation process and started making payments?",
            "ignore this just screaming into the void: but f\\*ck I really really don't want to do this, not even for all the money in the world",
            "Is anyone else still bitter about where they matched ?",
            "Are there any good speech-to-text apps for checklist to-dos? Like if I say \"room 18, check EKG, replete Mg\" it will add those to-dos to the room 18 pt and I can just check off the to-dos when I'm done? I feel this'll be more efficient rather than making a checklist by hand"
        ]
    },
    "It's Finance Friday - Please post simple questions about finances here": {
        "title": "It's Finance Friday - Please post simple questions about finances here",
        "score": 1,
        "url": "https://www.reddit.com/r/Residency/comments/1dqhygw/its_finance_friday_please_post_simple_questions/",
        "content": " Most residents have huge loan debt and it seems even worse when in residency and loans go into repayment.\n\nThis thread is to ask questions about personal finance and how to budget and optimize paying off loans during residency.\n\nThanks to the many medical professions who choose to answer questions in this thread!",
        "num_comments": 5,
        "comments": [
            "Thoughts on refinancing loans? I have a mix of gov and private. Not sure if it’s best to refinance them together into a bundle or try to defer",
            "What the fuck do I do with my finances????",
            "PGY1 Path resident in north Florida,\nWould you buy a new construction townhome for 250k at 4.99%, mortgage+tax+insurance will be about 1600-1700/month, or rent (1350 with utilities) and max out Roth IRA for the 4 years of residency? Can only squeeze out enough for one.",
            "On a scale of 1-10\n\n...can i borrow $5?",
            "Thank you for contributing to the sub! If your post was filtered by the automod, please read the rules. Your post will be reviewed but will not be approved if it violates the rules of the sub. The most common reasons for removal are -  medical students or premeds asking what a specialty is like, which specialty they should go into, which program is good or about their chances of matching, mentioning midlevels without using the midlevel flair, matched medical students asking questions instead of using the stickied thread in the sub for post-match questions, posting identifying information for targeted harassment. Please do not message the moderators if your post falls into one of these categories. Otherwise, your post will be reviewed in 24 hours and approved if it doesn't violate the rules. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Residency) if you have any questions or concerns.*"
        ]
    },
    "I’m never driving again…": {
        "title": "I’m never driving again…",
        "score": 232,
        "url": "https://www.reddit.com/r/Residency/comments/1dr3fqy/im_never_driving_again/",
        "content": "Patient presents to clinic for diabetic neuropathy referral. On exam has complete loss of proprioception at the ankle – can’t feel anything at all below the knee. \n\nMe: So did you drive yourself here today?\n\nPatient: Well yes, of course! \n\nMe: How are you able to do that if you can’t feel what your feet are doing?\n\nPatient: Well I just use my cane to work the pedals…\n\nMe: We’re gonna need to rethink that, starting immediately. \n\nWe get behind the wheel each day assuming a lot about other drivers. One thing this job (which has also entailed giving MoCA screenings at the VA) has instilled in me is a deep wariness of everyone else on the road. Random, innocent lives depend on Barbara’s cane not slipping off the brake pedal. Lorrrrrrd help us. ",
        "num_comments": 27,
        "comments": [
            "Good lord❗️😱\n\nI would be more concerned on how that patient’s going to get home more than their A1c or whatever. This why cabs exist.",
            "And luckily for us the most popular cars in the USA are 8000 pound trucks that nobody needs",
            "The amount of VA patients I’ve seen with CVAs/MIs/DKA/malignant arrhythmias etc who just drove themselves in is shocking.",
            "Did you notify the DMV?",
            "CC: vertigo\n\nRoom is spinning. Feels drunk. Has to hold onto the wall to walk. How did you get here today sir? Ah yes of course you drove yourself.",
            "Hey don’t forget these same people also have guns.",
            "Insane 😂  \n\nEM rototation was eye opening to how many people are high out of their brains and driving. Meth, fentanyl,  crack-cocaine, marijuana, some drug they made in their mini.. etc.",
            "Honestly, people don’t need to be sick to be awful drivers. Just look around in traffic to see how many people are playing on their cellphones. I can’t wait till autonomous driving assistants will be more commonplace.",
            "I'll never forget the guy that got dragged into the ER for a DUI who was a bilateral AKA and no prosthetics.",
            "One of my favorite traumas in med school was at a small community hospital on my surgery rotation. It was an MVC in which the gentleman driving had bilateral AKAs and some amputation at the left forearm. He drove by pushing the gas with a cane held in the right hand and steering with a belt that was looped around the steering wheel and the stump of the left arm. \n\nTruly where there is a will there is a way."
        ]
    },
    "Got literally chased by a patient outside the hospital": {
        "title": "Got literally chased by a patient outside the hospital",
        "score": 444,
        "url": "https://www.reddit.com/r/Residency/comments/1dqw3ge/got_literally_chased_by_a_patient_outside_the/",
        "content": "Finished an emerge shift and was leaving the hospital on my phone ordering food when this randomly lady pushing a male patient starts yelling at me that the ED is taking too long and they need a nurse NOW. I don’t look up at first bc I’m not a nurse but then they start walking toward me continuing to yell and they’re looking straight at me and there’s no one else there (this is outside the ED in the parking lot, not the eternally crowded waiting room). So I literally just run away. They try to follow but luckily there’s some stairs right there and I run up and with the wheelchair they can’t follow.\n\nAt 2pm on a Friday in broad daylight. Gonna have to start getting someone to pick me up from the hospital at all hours now…\n\n",
        "num_comments": 33,
        "comments": [
            "*she’s a runner 🏃🏻 she’s a track star* ⭐️",
            "I think 1 out of every 5 ED patients is either somaticizing or just plain nuts.  I had a lady try to find me on Facebook during our encounter.  Thus no more socials except Reddit.",
            "Lmao. I’m in psych and have to deal with similar intrusive patients who will literally follow me around and corner me. If I have already rounded or they’re not my patient, I have learned to simply ignore and not make eye contact and they will stop",
            "I have this same issue as a radiology resident leaving the ED entrance at 7AM. The ED nurse pushing the EM resident in a wheelchair screaming at me for leaving before giving a wet read.",
            "ER is the easiest way to meet crazy people, if that's your pleasure.",
            "I've had countless patients and families approach me inside and outside the hospital over the years, but it never occurred to me to just...run. Will file this strategy away for the future.",
            "LOL this is a nightmare",
            "Sounds like a positive interaction for both of you 😂",
            "Yes. Chasing someone down is going to get them care faster🤣… ppl are cray",
            "Sounds about right. And people wonder why I don't recommend clinical healthcare to my kids."
        ]
    },
    "Illegible handwriting of colleagues": {
        "title": "Illegible handwriting of colleagues",
        "score": 17,
        "url": "https://www.reddit.com/r/Residency/comments/1dr8qrj/illegible_handwriting_of_colleagues/",
        "content": "I know that there's a stereotype that doctor's handwriting is illegible. I have seen the memes.\n\nBut let me tell you. If the general public thinks it's only annoying to them. You are wrong.\n\nIt's just as annoying to us in the medical fraternity when seeing a patient for the first time and you can't make out anything in their doctor's notes.\n\nPersonally, I remember quite distinctly being taught penmanship in elementary school.\n\nHere's the thing. I am a doctor too. I know things can get quite busy. But at the end of the day, a patient's doctor's notes isn't your personal diary...its meant for somebody else to read it.\n\nI have literally sat at the desk next to colleagues each of us writing and by the time some of them are done making notes...nobody can understand what's written except the original writer.\n\nThis makes follow-up appointments extremely frustrating...because you have no idea what the previous doctor wrote.\n\n",
        "num_comments": 11,
        "comments": [
            "My chief’s handwriting can be mistaken as an atrial flutter,  ventricular fibrillation, or worse Torsades de Pointes when writing prescriptions. I pity the pharmacist who’s going to read it.",
            "I can absolutely not just decipher bad handwriting, so it’s annoying and potentially dangerous.",
            "I don’t think I’ve written a single note, order, or script in the last 6 years. And before that it was probably just a couple of opioid rxs before that also went digital \n\nBut I agree, reading those kind of notes sucks ass",
            "I always get a pharmacist to help me decipher.",
            "about 20 years ago Medicare started doing hospital chart audits (don't know if they still do) and decided if they couldn't read the Drs notes then they wouldn't pay them for that visit",
            "You don't have an EMR?",
            "Not only annoying but also dangerous. I had a 1st time visit yesterday and the patient brought up a note from another doctor asking for X exams and couldn't understand shit. I was moments away from sending a letter back \"learn how to write properly and then we can talk\".",
            "I call them out. Every F’ing time. You can do better and chose not to.",
            "Yeah,  I see ur points.  Are u in the US?",
            "Thank you for contributing to the sub! If your post was filtered by the automod, please read the rules. Your post will be reviewed but will not be approved if it violates the rules of the sub. The most common reasons for removal are -  medical students or premeds asking what a specialty is like, which specialty they should go into, which program is good or about their chances of matching, mentioning midlevels without using the midlevel flair, matched medical students asking questions instead of using the stickied thread in the sub for post-match questions, posting identifying information for targeted harassment. Please do not message the moderators if your post falls into one of these categories. Otherwise, your post will be reviewed in 24 hours and approved if it doesn't violate the rules. Thanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Residency) if you have any questions or concerns.*"
        ]
    }
}