{
    "Troubleshooting your job search (when it's not working)": {
        "title": "Troubleshooting your job search (when it's not working)",
        "score": 693,
        "url": "https://www.reddit.com/r/resumes/comments/128xo1c/troubleshooting_your_job_search_when_its_not/",
        "content": "Hello r/resumes 👋\n\nI'd like to talk about a topic that is just outside of the normal scope of this sub (i.e., resumes), and that is job search.\n\nWith the recent layoffs that have happened in recent months, there will surely be a lot of folks out looking for jobs, many of which may be hitting a brick wall at various points of the job search process, such as:\n\n* Not getting call backs\n* Not passing the recruiter screen\n* Not moving forward during job interviews\n\nBelow, I'll talk about each of the above issues and provide some ideas as to why you may not be seeing the results you want.\n\n# First pain point - not getting any callbacks (or getting very few)\n\nIf you're getting less than **1 callback in every 10 job applications**, it's an indication that one of a few things is happening:\n\n* You're not qualified for the types of jobs you're applying to\n* Your resume isn't presenting a relevant value proposition\n* Job market (out of your control)\n* Strength of other candidates (out of your control)\n* If you're a student or new grad looking to apply for internships and jobs abroad, a common obstacle is the lack of sponsorship for visas. Many companies are hesitant or unable to sponsor visas due to the complexity and cost involved. This can significantly reduce the pool of opportunities available to international candidates, making it even more challenging to secure a callback.\n\n**Fixes:**\n\n* To make sure you're qualified, you should be checking off at least 60% of the requirements of the role.\n* If you're qualified, there's a good chance it's your resume. Most people's resumes contain mistakes that fall into one of three categories: improper formatting for ATS, generic content, or not enough personalization/customization. I provide more info about each of these in [this post](https://www.reddit.com/r/resumes/comments/tq061t/biggest_mistakes_that_impact_your_resumes/) and [this post](https://www.reddit.com/r/resumes/comments/s2b37q/if_youre_applying_online_use_a_single_column/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=2&utm_term=1).\n* For international students and new grads, do your research and target companies and roles that have historically sponsored visas or are known to be more open to international candidates can improve your chances. Additionally, being upfront about your need for sponsorship can help set the right expectations from the start.\n\n# Second pain point - not making it past the recruiter screen\n\nIf you're getting calls from recruiters, but aren't making any progress after that, then there's something going on with what you're telling (or not telling) them.\n\n**Some Potential Causes and Fixes - Recruiter Screen**\n\n|Possible Cause|Fix|\n|:-|:-|\n|Your elevator pitch is unsatisfactory|Practice your pitch and ensure it aligns with what the company is looking for in this particular role. Your pitch should essentially answer these questions: Who are you and why do you want this job?|\n|What you're saying doesn't match what's on the resume|Memorize your resume and everything on it, including titles, dates, and responsibilities.|\n|You're asking for too much money (if you've revealed your salary expectations).|Don't reveal your salary expectations at this stage. If asked, just say that you'd like to learn more about this position before you can provide a realistic salary expectation. Do your homework on salary range for your position, industry, and company.|\n|You're not prepared, haven't done your research, don't seem enthused for the role etc.|There are a lot of other applicants. If you don't seem like you want the job, they'll move on. To prevent this: research the role/company and develop a good understanding of what they do (i.e., their market, products, services etc.). Look at company pages, read their mission statement, read the job description, show up on time, and try to sound neutral at the very least (excited would be good).|\n\n*Note: These are just common causes that may be behind your results. This isn't an exhaustive list and there could be other reasons not covered here.*\n\n# Third pain point- you're not moving forward during interviews with hiring managers\n\nGetting roadblocked during the interview stage likely means you're not performing well enough.\n\n**Common Causes and Fixes - Interview**\n\n|Possible Cause|Fix|\n|:-|:-|\n|You're not sufficiently answering behavioural interview questions|Practice! There are a lot of good guides all over the internet on this topic. See a brief guide to these questions below this table.|\n|You can't remember important details about past projects and accomplishments|Prepare a master list of projects and accomplishments you've been involved in throughout your career. Follow the STAR format. Memorize it.|\n|You're lacking key skills and experiences.|If you know you lack key skills/experiences, you'll need to provide a very good rationale for why you'd still be the right candidate for the position. If you don't have one, you probably shouldn't apply.|\n\n*Note: These are just common causes that may be behind your results. This isn't an exhaustive list and there could be other reasons not covered here.*\n\n# A note about behavioural interview questions\n\nEmployers love using behavioural questions because they give them a little bit of insight into how you'd behave in a particular role, how you'd react in a particular scenario, or how you'd solve a particular problem or task. They're also really hard to fake.\n\nA few common ones you've probably heard before:\n\n* “Tell me about a time when...”\n* \"How would you approach X problem...\"\n* \"Imagine you're in the following situation...\"\n\nAnswering these questions is beyond the scope of this post today, but if you're struggling with these types of questions, you'll need to prepare and practice in order to respond effectively.\n\n# A note about the STAR Method\n\nYou've probably heard of this before, but for those of you that haven't, the STAR method is a simple and easy-to-remember technique for answering behavioural interview questions. STAR stands for:\n\n1. Situation: Describe a specific situation or event where you faced a challenge or had to solve a problem. Try to pick a relevant example that shows your skills and abilities.\n2. Task: Explain the task or responsibility you had in that situation. What were you supposed to accomplish or what goal were you trying to achieve?\n3. Action: Talk about the actions you took to address the situation or complete the task. Explain the steps you took and the skills you used to resolve the issue or meet the goal.\n4. Result: Share the results of your actions, focusing on the positive outcomes and what you learned from the experience. This could include how you improved a process, solved a problem, or achieved a goal.\n\n# Hopefully these tips help you!\n\nThis isn't a comprehensive guide by any means, but it can hopefully give you some ideas and point you in the right direction if your job search isn't getting you the results you want.\n\nGood luck!\n\nPS: If you found this post helpful, consider subscribing to my free newsletter, [The Launchpad](https://thecareerlaunchpad.beehiiv.com/subscribe), where you’ll get weekly tips to help you network, find jobs, and make more money (not to mention the the freebies). ",
        "num_comments": 174,
        "comments": [
            "**A note about oversaturated markets. In a market where jobs are few and applicants are high, expect lower interview rates, all else held equal. In this kind of market, networking becomes a crucial factor:**\n\nIf you're not networking already, you should be doing so.\n\n**A few basics about networking:**\n\n* It's not just for executives. Anybody can do it.\n* It's not just for extroverted people. If you're an introvert, you can still network.\n* It can be done online, or in person. Pick your poison.\n\n**Important groups in your network:**\n\n* Family\n* Friends\n* Coworkers\n* Alumni\n* Recruiters\n* Everyone else\n\n**Examples of how you can network:**\n\n* Asking a friend or family member over coffee if their company is hiring for your job type and if so, would they be open to referring you.\n* Reaching out to a LinkedIn acquaintance whose content you regularly engage with, to ask whether they know of any opportunities for X job type.\n\n**Networking works best if you do it regularly**\n\nIt works a lot like a garden. If you only tend to it once or twice a year, it's going to wither and die.\n\nYou should be tending to it regularly.\n\nNetworks are the same way. They're built on relationships - and like any relationship, if you only reach out when you need something, you're going to fail.\n\nBuild and maintain your network - think longterm.\n\nI hope this helps some of you. Best of luck.\n\nJames.",
            "I wish more people would read the stickys. ~90% of the posts would be solved. \n\nOne interview trick that I do that helps me get to the next round is just have a conversation with them. Treat it less like an interview and more like a coffee meetup. For example, at the beginning of the interview, before we actually start, ill ask them how they're doing, if they had a great weekend or plan on doing anything exciting this up coming weekend, etc. The \"interview\" feels more authentic and maybe if they say something that you like or are familiar with, touch on that for a bit. Boom, now you're best friends with recruiter. \n\nAlso ask more open ended questions during the interview to get them explain things more in detail. Shows that you're curious and also gives you more time to think. For example, ill say something like \"what's a previous project [goal, KPI, etc] that the team completed as it relates to X\"",
            "*You're not prepared, haven't done your research,* ***don't seem enthused for the role etc.***\n\nTHIS. \n\nI interview so many good and qualified candidates who totally fail to indicate in any way that they are actually interested in the company/role. Literally say during the interview:\n\n\"I am excited about what \\[X Company\\] is doing in the \\[Y industry\\] space!\" \n\n\"I am excited about what I can contribute to your team!\" \n\n\"I am excited to help with the challenges you are facing!\" \n\n**Be overt with your enthusiasm.**",
            "My problem is I make it through the entire interview process - phone screen, initial phone interview, on-site, follow-up, etc. \n\nWhen it comes to between me and however many candidates it comes down to, I lose. \n\nI usually get a positive vibe/feedback throughout, and it just comes down to a 'better' candidate I guess?",
            "STAR method is also a great way to approach writing resume bullet points!",
            "[deleted]",
            "Any other elaboration you can give on the first pain point on not getting callbacks? \n\nI ask because after my last job hunt in 2020-2021, I submitted around 170 applications and only got responses to 4 (that I tracked). Going through your checklist:\n\n* Qualifications - without lying to myself, I'm confident that I have the qualifications to perform the jobs I apply to. Maybe for 10% of apps I might have be stretching a bit, but I think probably still meeting 50% or more qualifications\n* Improper ATS formatting - I always submit as a PDF in a single column, fairly straightforward format. It's actually the same one you shared in another post [here](https://docs.google.com/document/d/1wdkgpgU7lFoV801ysrBn8qrPaIpyUsUH/mobilebasic)\n* Generic Content - I make sure to have >50% of my bullet points tied to a metric, such as throughput %'s, $$'s saved, etc.\n* Not enough personalization - I don't know if my \"bland\" resume format so I don't get kicked by the ATS is hurting here, but I will say at first glance it probably does look pretty dense or packed together\n\nMy best guesses is I'm either\n\n1. Overestimating my qualifications/underestimating what's posted for the job\n2. Overestimating how transferrable my skills are (e.g. engineering in pharmaceutical manufacturing =/= engineering in ___ manufacturing?)\n3. Getting swept up by the ATS for a reason I can't see\n4. Getting through the ATS, but getting denied by human eyes for a reason I can't see\n\nResume [here](https://imgur.com/a/eY4kfdZ) in case folks are curious and have any notes!",
            "Thank you. This is helpful and topical, especially given the current job climate. Things are tough out there...",
            "this makes me want to kill myself",
            "I absolutely think it is my resume because most of the companies here use older ats systems so I have had to rewrite my resume because they cannot read a pdf. had one employer say it looked like code on the other end when I asked. My problem is with the star system I do not have anything to put down. I literally cannot answer any of those questions because all I did was show up and do assigned tasks."
        ]
    },
    "New visitor? Please see these quick links before posting or commenting.": {
        "title": "New visitor? Please see these quick links before posting or commenting.",
        "score": 249,
        "url": "https://www.reddit.com/r/resumes/comments/129ez4n/new_visitor_please_see_these_quick_links_before/",
        "content": "Hi r/resumes 👋\n\nAs a member of the mod team, part of my job is to make it as easy possible for you to access the resources available here.\n\nThere’s a lot of guidance in the wiki, but since many folks seem to miss it (especially new users), I’ve created a list of answers to common questions and issues. \n\nPlease familiarize yourself with these resources before commenting or posting. \n\n**“I was banned for no reason...”**\n\nPlease read the [rules](https://www.reddit.com/r/resumes/wiki/index/rules/) to avoid a ban. Most common reasons for getting banned are spamming, harassing other users, or DMing other users. \n\n**”I’m not getting any feedback on my post”**\n\nPlease ensure you’re providing the right information so that people can help you. That includes:\n\n* Giving your post a flair tag\n* Identifying your current role and target role\n* Why you’re seeking help \n* Uploading an anonymized version of your resume\n\n**”How do I say X or Y on my resume?”**\n\nThe [free resume writing guide](https://www.reddit.com/r/resumes/wiki/index/faq/) covers all of the basics and will have answers to common questions. Please read it before posting. \n\n**”Does anyone have any recommendations for a resume writer?”**\n\nIf you’re looking for a resume writer, please read [this guide](https://www.reddit.com/r/resumes/wiki/index/beforehiringawriter/) to learn how to find a qualified writer. \n\n**”Does anyone know where to find free resume templates?”**\n\n* If you’re looking for a resume template, you’ll find one [here](https://docs.google.com/document/d/1wdkgpgU7lFoV801ysrBn8qrPaIpyUsUH/edit?usp=sharing&ouid=103022094325852815590&rtpof=true&sd=true). \n\nThere are also other great articles and tools in the [wiki](https://www.reddit.com/r/resumes/wiki/index/). \n\nI hope this helps. Please comment below or message the mod team if you have suggestions on how to improve r/resumes. \n\nCheers!",
        "num_comments": 3,
        "comments": []
    },
    "Stop using these words on your resume (pretty please)": {
        "title": "Stop using these words on your resume (pretty please)",
        "score": 228,
        "url": "https://www.reddit.com/r/resumes/comments/1dl4fty/stop_using_these_words_on_your_resume_pretty/",
        "content": "Hey Folks, \n\nFDR here with a (hopefully) helpful post on resume writing 101. \n\nWhen you're writing your resume, remember that you're competing with (likely) hundreds of other applicants. \n\nDo you think using terms like \"detail-oriented\", \"driven\", or \"highly motivated\" are gonna cut it?\n\nAbsolutely not. So stop using them (in the summary mainly, which I see all the time). \n\nAfter all, if I'm Mr. or Ms. Recruiter, how do I know if you REALLY ARE \"detail-oriented\" as you claim? \n\nI have no way of proving you right or wrong. \n\nAnd when most of the 140 applicants on my open requisition (job posting) are using the same filler words, they become absolutely meaningless. \n\nInstead of using these words, help me help you, by providing me with the goods - the real, hard data that I'm looking for, like: \n\n* Years of experience\n* Industries you're experienced in\n* Companies you've worked for\n* Types of projects you've worked on\n* Measurable impact you've had on things like: \n   * Revenue and sales\n   * Process efficiency\n   * Manual work reduction\n   * Company growth\n   * Customer satisfaction\n   * Uptime/downtime\n   * Vulnerabilities reduction\n   * Employee satisfaction\n   * Conversion rate\n   * Cost reduction\n   * And so on...\n\nRemember, anybody can say they're results oriented, detail oriented, motivated, a phenomenal speaker etc., but very few actually provide examples to back up those claims. Don't let that be you. \n\nCheers!",
        "num_comments": 131,
        "comments": [
            "I don't like those buzzwords, but I add them to my resume summary because those same buzzwords are in the Qualifications section of your job posting. \n\n  \nIf you put \"We want a detail-oriented XYZ\" as a requirement don't be surpised that some of us will write \"I'm a detail-oriented XYZ\" in our summary",
            "> And when most of the 140 applicants on my open requisition (job posting) are using the same filler words, they become absolutely meaningless.\n\nTotally unlike job postings, which are absolutely not the epitome of low-effort copy & paste buzzwords.",
            "I hardly use pretty please on my resume",
            "The word “spearheading” drives me nuts",
            "I love this! I used this mentality with mine and am hoping to share my success story any day now…\n\nI have a question: I see many people here format Education above Experience, even if they have been out of school for some time. I find it somewhat faux pas. What are your thoughts on this?",
            "I’m sure this is great advice! However for me, I don’t do business or sales or tech work.\n\nI studied language in college and I’m looking for something like teaching, translation, or interpreting jobs. I’ve been struggling with how to include numbers/more concrete things or what the equivalent of “customer satisfaction” would be for a teacher or translator’s resume?",
            "One of the things at least in my experience that helps a candidate stand out is submittal of a a cover letter. Very few people submit them with an application and where as I don't fully read resumes, I scan over them, I will read a cover letter because I get so few of them.   Then if it's well written and highlights a particular skill set I will then spend more time on that candidate's resume.  Not sure if other hiring managers do this but I know I always did.",
            "How exactly do you measure these things without access to the data? If you help the company grow by maintaining relationships, and your company doesn't provide you with any statistics?",
            "Thanks for the advice! Could you help me figure out what a recruiter would expect from someone with extensive experience but looking to transition to another career? I've come back to Uni and was wondering how to word my summary since I have experience and am close to graduating, but the job I'm applying to is different from what I've done before.",
            "I especially don't need to know that 12 years ago was when your VMware experience is from.  Keep your resume to the last 10 years - if you're 50, I really don't care about your middle school paper carrier job."
        ]
    },
    "Roast my resume! I'm in Canada and I've applied to 500+ positions but not heard anything": {
        "title": "Roast my resume! I'm in Canada and I've applied to 500+ positions but not heard anything",
        "score": 19,
        "url": "https://i.redd.it/y0m8xn89uz7d1.png",
        "content": "I'm graduating next week. Applied to over 500 jobs with and without referrals. I don't get any call backs! \n\nI'm looking for anything in the Data Science/Machine Learning/AI development space ",
        "num_comments": 70,
        "comments": [
            "\n**Dear /u/GiantToddler256!**\n\n## Thanks for posting! Please read the posting guidelines on the [etiquette page](https://www.reddit.com/r/resumes/wiki/index/howtoparticipate) and make sure you're doing the following: \n\n*  Censor your personal information for your own safety,\n\n*  Add the right flair to your post, \n\n*  Tell us why you're applying (i.e., just looking to fine-tune, not getting any interviews etc.), and \n\n*  Indicate the types of roles and industries you’re interested in. \n\n## Check out the [wiki](https://www.reddit.com/r/resumes/wiki/index) as well as the quick links below for tips:\n\n* [Resume Writing Guide](https://www.reddit.com/r/resumes/wiki/index/faq)\n\n* [ATS-optimized resume templates available at Resumatic](https://resumatic.rezi.ai/signup)\n\n* [Thinking of hiring a resume writer? Read this first](https://www.reddit.com/r/resumes/comments/x3eg1e/considering_hiring_a_resume_writer_read_this_first/)\n\n* [Troubleshooting your resume and your job search](https://www.reddit.com/r/resumes/comments/128xo1c/troubleshooting_your_job_search_when_its_not/)\n\n* [Free Resume Template (Google Docs)](https://docs.google.com/document/d/1NyBW7UxkVDvqnaNMWgudNe5ttG4Bkr8W/edit?usp=sharing&ouid=113311260843142532597&rtpof=true&sd=true)\n\n* [Networking for beginners](https://www.reddit.com/r/FinalDraftResumes/comments/1cwp2x1/beginners_guide_to_networking_what_it_is_why_its/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nIf you have **applied to 100 or more jobs** and aren't getting callbacks, please refer to [this post](https://www.reddit.com/r/resumes/comments/128xo1c/troubleshooting_your_job_search_when_its_not/?utm_source=share&utm_medium=web2x&context=3) for help.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/resumes) if you have any questions or concerns.*",
            "I'm not an expert but it seems to wordy",
            "The formatting is hard to read, it looks like a wall of text. I'd suggest tabbing your bullets in a bit to offset them from the headings. Increase the font size of your headings also.\n\nThat said, you've got a lot of competition in your field. Networking is gonna be your biggest help.",
            "This is like reading the Economist or the Times with the exception that it has very little readability. The font is so small, my eyes are bleeding.",
            "How did you get into Applied Computing at Concordia with that kind of gpa? Did you give GRE",
            "One big thing is you need to make this easier to read. You have enough experience to not need completed courses or areas of interest / specialties, at this point your experience/projects should be doing the talking in these fronts. You have a lot of fluff through out the resume as well. I would consider wording this down and use the extra space to improve the readability. Also make sure it is ATS friendly, the experience and skills are pretty good. Assuming all 500+ of those roles you applied to you are qualified for, I am shocked you didn't at least get a few phone screens.",
            "If you remove the flower-sorting project, the rest of the resume will be much easier to read because there will be a lot more space. So many people do flower-sorting that it's not adding anything to your resume because you have other, better experience.",
            "Golden Key means absolutely nothing. \n\nI was invited multiple times. It’s not a high threshold.  \n\nIt’s a straight money grab. It’s cringe to have on a resume.",
            "Technical skills first since you have employment. \nNext I’d do Work Experience and then Education. For Education section just include your program name, school and year graduated (don’t even need start date). The other stuff with achievements and courses don’t matter enough to keep. \n\nRemove the underlines on the first project bullets. Also in general for the projects just do a short summary of what it is and what languages or tech you used. Interviewers will be asking you to elaborate more on your project in a call or interview. You aren’t hooking them enough because it’s too long and wordy. \n\nChange academic and personal projects header to just projects. And you don’t technically have to include a date for those. \n\nFix the tab formatting for sure. Increase the margins so you can fit more on one page. This could definitely be organized better, increase readability (spacing and reduce wordiness) and not feel overwhelming. You got this!",
            "4 - 5 points should be enough for each work experience."
        ]
    },
    "Critique my CV/ Resume - Struggling to secure a job. UK based.": {
        "title": "Critique my CV/ Resume - Struggling to secure a job. UK based.",
        "score": 1,
        "url": "https://www.reddit.com/r/resumes/comments/1dlvfbj/critique_my_cv_resume_struggling_to_secure_a_job/",
        "content": "I'm an accomplished EA with nearly a decade of experience. I've recently relocated to North West UK from London and am struggling to land an EA (or PA) job role. There does seem to be quite a few roles out there but I'm not getting a response from my applications. A friend of mine told me it might be due to lack of funding and the next quarter (Starting in July) may be more prosperous.\n\nI would love if some people were willing to give some constructive feedback on what my CV is lacking with examples of how to better word my experience.\n\nIt's competitive out there, but I know I have the experience and capabilities - I just need to really impress and stand out, which I fear I'm not doing. I am of course adapting my CV to each job role I apply to and fine tuning where necessary, rather than sending out a blanket CV. The one below is my latest CV with personal details redacted. I have also left out my cover letter as it's the main CV I need assistance with - so ignore page numbers.\n\n  \nI also worry that my last role was 1.) over a year ago (I've been travelling) and 2.) the job title wasn't EA/PA, although it was an admin role.\n\nPlease help!\n\nhttps://preview.redd.it/v2z78ed4h48d1.png?width=998&format=png&auto=webp&s=9cfa91655ff6dc936ffd61cc84016af4d5c38795\n\nhttps://preview.redd.it/1a9zo4u5h48d1.png?width=992&format=png&auto=webp&s=bca84652231f8142de72867571f091593ea5d1e4\n\nhttps://preview.redd.it/viass7f6h48d1.png?width=978&format=png&auto=webp&s=673f1baf6dfd766706e09b44475825bd27b9ff13\n\n",
        "num_comments": 1,
        "comments": [
            "\n**Dear /u/EAUK2024!**\n\n## Thanks for posting! Please read the posting guidelines on the [etiquette page](https://www.reddit.com/r/resumes/wiki/index/howtoparticipate) and make sure you're doing the following: \n\n*  Censor your personal information for your own safety,\n\n*  Add the right flair to your post, \n\n*  Tell us why you're applying (i.e., just looking to fine-tune, not getting any interviews etc.), and \n\n*  Indicate the types of roles and industries you’re interested in. \n\n## Check out the [wiki](https://www.reddit.com/r/resumes/wiki/index) as well as the quick links below for tips:\n\n* [Resume Writing Guide](https://www.reddit.com/r/resumes/wiki/index/faq)\n\n* [ATS-optimized resume templates available at Resumatic](https://resumatic.rezi.ai/signup)\n\n* [Thinking of hiring a resume writer? Read this first](https://www.reddit.com/r/resumes/comments/x3eg1e/considering_hiring_a_resume_writer_read_this_first/)\n\n* [Troubleshooting your resume and your job search](https://www.reddit.com/r/resumes/comments/128xo1c/troubleshooting_your_job_search_when_its_not/)\n\n* [Free Resume Template (Google Docs)](https://docs.google.com/document/d/1NyBW7UxkVDvqnaNMWgudNe5ttG4Bkr8W/edit?usp=sharing&ouid=113311260843142532597&rtpof=true&sd=true)\n\n* [Networking for beginners](https://www.reddit.com/r/FinalDraftResumes/comments/1cwp2x1/beginners_guide_to_networking_what_it_is_why_its/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nIf you have **applied to 100 or more jobs** and aren't getting callbacks, please refer to [this post](https://www.reddit.com/r/resumes/comments/128xo1c/troubleshooting_your_job_search_when_its_not/?utm_source=share&utm_medium=web2x&context=3) for help.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/resumes) if you have any questions or concerns.*"
        ]
    }
}