{
    "FAQ: READ THESE BEFORE ASKING": {
        "title": "FAQ: READ THESE BEFORE ASKING",
        "score": 79,
        "url": "https://www.reddit.com/r/RetroArch/comments/15c5qfn/faq_read_these_before_asking/",
        "content": "This post will include common questions and their answers. If you came to this sub to ask a support question, please read/search through these before asking. If you ask a question that is already answered here, your post may be locked or deleted.\n\nIf you would like to suggest something be added to the FAQ, *please use modmail*, as I do not want this post to turn into a support free-for-all nor do I want a million public \"please add this to the FAQ\" posts/comments.",
        "num_comments": 19,
        "comments": [
            "Q: My game is broken/won't launch/looks weird in PCSX2-libretro/LRPS2 core!\n\nA: Yes, that core is not in great shape. It works well enough when it works, but if it doesn't work, there's not a whole lot to be done about it, unfortunately. We hope to improve things with it at some point, but in the meantime, your best bet if you run into a problem is to use PCSX2 outside of RetroArch. It's a great emulator and has had a lot of improvements of its own since our preliminary core was forked off anyway.",
            "Q: I can't find a core I would like to use in the 'load core' list. (commonly dolphin-libretro, ppsspp-libretro, citra-libretro, etc.)\n\nA: Not all platforms can run all cores, so which ones are available for a given platform/device/OS will vary. Sometimes this restriction is due to a technical issue, for example, the missing core may require access to a library or driver that is not available on your device (e.g., the lack of OpenGL support is why there is no N64 core for the PS3 or Wii versions of RetroArch). Other times, it's related to performance. For instance, you cannot emulate NDS games on a PSP.\n\nNotably: citra-libretro is not available on Xbox, and there are no functional PS2 cores for Android or Apple devices (iOS, tvOS or macOS) at the time of this writing.",
            "Q: Can I use RetroArch's netplay to trade Pokemans with my friends?\n\nA: ~~No.~~ Maybe. RetroArch's netplay simulates 2 players on a single console. For most handhelds, imagine 2 people fighting over the same console. The exception to this is original Game Boy / Color via TGB-Dual or Sameboy cores, which can do link cable over netplay by running 2 instances of the console on each end and then syncing between them. PSP wifi netplay is also possible via PPSSPP's own netplay implementation, which can be accessed via the core options.\n\n**Update (2/4/2024):** gpSP-libretro now emulates the Game Boy Advance Wireless Adapter, which allows [some games (including Pokemon Emerald, FireRed and LeafGreen)](https://gamicus.fandom.com/wiki/List_of_Game_Boy_Advance_games_with_wireless_compatibility) to connect via netplay. See [this blog post](https://www.libretro.com/index.php/retroarch-1-17-new-netplay-features/) for more details.",
            "Q: My games don't show up. (or \"Scanning/importing content adds some games but misses others\")\n\nA: If you mean they're not being added to playlists when you scan, that just means they don't match our databases of known-good dumps, based mostly on No-Intro and Redump hashes. Those groups do not track things like bad/incomplete dumps (like ROMs you've had on your hard drive since the '90s) or ROMhacks/translations, so those are not going to show up. Some of our databases are also incomplete and just may not include an obscure game or revision (or one from a weird region). It's not a big deal, though, as you can just use the manual scan instead, which will skip the database check and add literally anything to a playlist",
            "Q: Which is the best core for ... ?\n\nA: There is almost never a single \"best\" core for all use-cases, so we can't usually make a good recommendation. However, if you go to the core downloader and press retropad-select while hovering over a core, it will pop up a description blurb that includes information about the core, including how it compares with other cores that cover the same games/console/platform so you can make an informed decision for your use-case.",
            "Q: I'm having trouble with arcade games and their emulators, like MAME and FBNeo.\n\nA: Please read the documentation on arcade emulation, as it will probably clear everything up for you: [https://docs.libretro.com/guides/arcade-getting-started/](https://docs.libretro.com/guides/arcade-getting-started/) Arcade emulation is very different from console emulation and can be daunting for the uninitiated.",
            "Q: In the Android Play Store, should I install regular RetroArch or the \"Plus\" version? What's the difference?\n\nA: Neither, actually. As of Android v11, Google has mandated that all apps in the Play Store need to implement support for their \"scoped storage\" API, and anyone who doesn't (or in our case, can't) do so can no longer update their apps. As a result, the RetroArch apps on the Play Store are either years out of date or scam clones.\n\nInstead, you should download it [from our website](https://retroarch.com/?page=platforms) and \"sideload\" it (that is, install it manually without using a storefront) or get it from any of the other storefronts not controlled by Google where we have a presence (e.g., Amazon, Samsung, LG, F-Droid).\n\nWhy not just remove those crusty old apps from the Play Store and avoid the confusion, you ask? Well, they still technically work just fine, and removing them would remove the only free option a lot of people worldwide have to play a number of different games/consoles, leaving only for-pay and/or scam/adware apps for anyone who isn't savvy enough to sideload. So, it's the lesser of two evils, basically.\n\nNow, back to the original question: the \"Plus\" version has more cores available but will not run on very old Android devices, while the regular version works all the way back to 4.4 KitKat (I think?). This distinction is also a result of us working around Google's goofy policies and is not required on other storefronts, hence the \"Plus\" version only existing on the Play Store.",
            "Q: My game is broken/won't launch/looks weird in dolphin-libretro!\n\nA: Did you do the required setup for the core? [https://docs.libretro.com/library/dolphin/#setup](https://docs.libretro.com/library/dolphin/#setup) This is where the emulator stores its settings/hacks for performance/compatibility purposes and many games have compatibility issues if it's not available and in the correct location. The core system files downloader will automatically put them where you need them.\n\nMany other common issues (such as crashing) are solved by switching away from the default \"gl\" video driver. In Windows, d3d11 is a good alternative, while in Linux, glcore and vulkan are both good and YMMV.",
            "Q: Whenever I change inputs (like swapping B and A to match my controller's labels), it changes them for every core!\n\nA: That usually means you're changing your retropad mapping ([https://docs.libretro.com/guides/input-and-controls/#what-is-a-retropad](https://docs.libretro.com/guides/input-and-controls/#what-is-a-retropad)) in settings > input instead of changing the core mapping in quick menu > controls.",
            "Q: RetroArch can't see games on my Android device's microSD card!\n\nA: Yes, this is a known issue caused by Google's \"scoped storage\" requirement, implemented in Android v11. There's no solution for it currently, though you can use RetroArch in conjunction with a launcher, such as Dig or Launchbox, to load games from removable storage."
        ]
    },
    "Useful Guides for RetroArch newbies": {
        "title": "Useful Guides for RetroArch newbies",
        "score": 167,
        "url": "https://www.reddit.com/r/RetroArch/comments/1ct7fb8/useful_guides_for_retroarch_newbies/",
        "content": "Now that the iOS fam have joined hopefully, these guides will help those unfamiliar with RetroArch:\n\n**Installing RetroArch on:**\n\n* iOS (iPhone & iPad) - [https://youtu.be/OTEo7TJyWqc](https://youtu.be/OTEo7TJyWqc)\n* Android - [https://youtu.be/1fbNedjr7bc](https://youtu.be/1fbNedjr7bc)\n* PC - [https://youtu.be/5F-Fo2f\\_4d0](https://youtu.be/5F-Fo2f_4d0)\n* Valve Steam Deck - [https://youtu.be/Bbr0a6b1qHI](https://youtu.be/Bbr0a6b1qHI)\n\n**Visuals:**\n\n* How to use Shaders - [https://youtu.be/iC99UbS8-JI](https://youtu.be/iC99UbS8-JI)\n* Make your own Shader presets (Appending & Prepending) - [https://youtu.be/xj0nU2eadJs](https://youtu.be/xj0nU2eadJs)\n* Automatically Load Shaders (per core & globally) - [https://youtu.be/dZpBRR4DGG0](https://youtu.be/dZpBRR4DGG0)\n* HDR - [https://youtu.be/RWxspx8Fd5I](https://youtu.be/RWxspx8Fd5I)\n\n**Basics**\n\n* Where do BIOS files go? - [https://youtu.be/4S2Zpv7BNtQ](https://youtu.be/4S2Zpv7BNtQ)\n* How to use Cheats in RetroArch - [https://youtu.be/YmhEqri4lSs](https://youtu.be/YmhEqri4lSs)\n* Useful Hotkeys for RetroArch - [https://youtu.be/4Gi6CGvE8Qs](https://youtu.be/4Gi6CGvE8Qs)\n* How to Rewind in games - [https://youtu.be/D4h82VmIy9g](https://youtu.be/D4h82VmIy9g)\n* RetroArchievements - [https://youtu.be/Q66j-Qv\\_wxo](https://youtu.be/Q66j-Qv_wxo)\n\n**Latency**\n\n* Preemptive Frames - [https://youtu.be/NDYqRoyOKI4](https://youtu.be/NDYqRoyOKI4)\n* How to Calculate Run-Ahead Frames - [https://youtu.be/KsU7zQw3VKI](https://youtu.be/KsU7zQw3VKI)\n\n**User Interface**\n\n* Change User Interface - [https://youtu.be/IHx6kWe5RnA](https://youtu.be/IHx6kWe5RnA)\n* Adjust Menu Text Size - [https://youtu.be/J15Ri7N04W8](https://youtu.be/J15Ri7N04W8)\n* Box Art and Thumbnails - [https://youtu.be/UejH8fqeG5w](https://youtu.be/UejH8fqeG5w)\n* Touch Screen Overlays - [https://youtu.be/MYaeSBXgLPY](https://youtu.be/MYaeSBXgLPY)\n* Create Views - [https://youtu.be/f4dc2en5iAc](https://youtu.be/f4dc2en5iAc)\n\n**Troubleshooting**\n\n* Games running too FAST - [https://youtu.be/QEE76fCToIY](https://youtu.be/QEE76fCToIY)\n* Fix Screen Tearing - [https://youtu.be/nTYVUWOMNRE](https://youtu.be/nTYVUWOMNRE)\n\n**Improvements**\n\n* Improved Sega Mega Drive Rotation Fix - [https://youtu.be/Dxfp\\_ZUfg38](https://youtu.be/Dxfp_ZUfg38)\n* SNES Mode 7 HD - [https://youtu.be/JqrzWr6Epq4](https://youtu.be/JqrzWr6Epq4)\n\n**ROM Organisation**\n\n* Convert cue & bin to CHD - \n[https://youtu.be/b1FKwDOEiwc](https://youtu.be/b1FKwDOEiwc)",
        "num_comments": 74,
        "comments": [
            "A few tips for Retroarch on iOS. \n\nIf you try to load a rom and the app crashes. Use a different core. This issue is exclusive to the apple version of Retroarch. Use psxrearmed for ps1. Use mgba for gba. Use Genisis plus gx (not wide) for sega gen games. These are all I tested so far. \n\n1.) If you want to save yourself some annoyances with Retroarch on iOS, then after you make a change to your settings, hit home, select configuration file, then save configuration file. I choose the overwrite option, but you can choose what best fits you. We can do this on other platforms by just tapping the back button until it exits the application, but there isn’t a back button on iOS. \n\n2.) I also like to go to turn on vibration/ haptic feedback. Go to settings, input and scroll down to haptic feedback. I turn both options on and leave the vibration strength at 100%. \n\n3.) I like to change the user interface. You can do this in two ways. A.) Changing the theme. Go to settings, user interface, appearance, select color theme and then choose your favorite. Mine is material ui dark. A.1) If you want you can also choose another app icon. The setting is the first option under user interface. B.) I like the stock setup, but you can change the entire layout to be different. You can go to settings, drivers, and select menu. The stock option is glui. You can choose the option you like the best in this section. \n\n4.) I like to change the date and time format at the top to be something I am more used to. Go to settings, user interface, menu item visibility and select “style of date and time” towards the end of the list. \n\n5.) Then we get to importing content. In the iOS version, all the usable cores seem to be downloaded in Retroarch already. So that is nice, but you have to select the correct core when booting a rom. I don’t know if I am doing it correctly, so correct me if I am wrong. But retroarch likes the roms to be placed into a folder that is inside of the Retroarch app itself. Seems to be like this on android as well. So what I do is take the roms I want to play on Retroarch and move them into the Retroarch app. Here is how I do that. I have a folder already on my iPhone with the roms I want to play. I use the files app to locate this folder. Then I select it and move it. Or you could copy it. Then move or paste it inside of the Retroarch app folder under downloads. Then hit the playlist menu (middle navigation button.) and select import content. Then scan directory. Click documents/retroarch, scroll down to downloads, then select scan this directory. Then let it do its thing. After it is done you can come back to the playlist menu to look for and launch your games. \n\n6.) Updates. Don’t know how necessary it is, but I like to make sure a few things are up to date. So I hit the home menu at the bottom. Go to online updater. Make sure on demand thumbnails is toggled on. Then just below that update core files all the way down to slang shaders. Then scroll back up to playlist thumbnail updater and select any that are missing album art. Or just select them all to make sure they do when you browse your roms. If you want some free to use roms go to content downloader and some homebrew and other roms are in there for each system. \n\nAfter you are done changing anything. Do not just close the app. Make sure you save the configuration file like I mentioned at the start of this post. If not, the settings you changed will be “forgotten” but the roms and art should still be there. \n\nIf there are any mistakes in this post, please feel free to correct me. I typed this out on my phone at my kitchen table while my kids cleaned up after dinner. So take everything with a grain of salt. Hope it helps someone out there.",
            "I am totally blind and I am able to use RetroArch thanks to the accessibility they have put into the PC and Mac versions. I am hoping that the iOS version will have more of the accessibility that allows me to to play on my computers. For those who did/do not know about the RetroArch accessibility features please see the following webpage… https://www.libretro.com/index.php/retroarch-1-8-2-coming-soon-accessibility-features-for-blind-people/\n\nHappy Gaming for all!!!",
            "Thank you! I am completely new to this but eager to learn the ins and outs!",
            "Could we have an ios specific guide to accessing roms on a nas server or extrrnal hdd? Thank you!",
            "Reddit should pin this. Well put together",
            "is there a way i could sync retroarch between 2 iphones?",
            "is there any way to use the delta controller skins ok retroarch?",
            "So this might be dumb but I’d just like to make sure \n\nCan I transfer over all my save states, games and skins from Delta over on here? Also any skins I downloaded from Delta from other sources can be saved and used on here as well?",
            "Is there anything anywhere about how to do multi-disc PSX games on iPhone? Anywhere???",
            "Is there a way to hide the toggle that flips on and off the onscreen buttons?\n\nExample is when I’m casting to my TV and using a controller, even with the on screen buttons hidden it still has that toggle visible and I’d like it to go away entirely."
        ]
    },
    "Front-end or retroarch gui?": {
        "title": "Front-end or retroarch gui?",
        "score": 3,
        "url": "https://www.reddit.com/r/RetroArch/comments/1dr0q8q/frontend_or_retroarch_gui/",
        "content": "Curious what front-ends you guys use with retroarch on the backend or do you just use retroarch itself? I absolutely LOVE hyperspin but I hate how much time it takes to get set up. I'm trying to build either an all in one emulation station to hook to a t.v. or maybe put this build in an empty arcade cab I have I'm not sure yet but I don't want to put a ton of time into hyperspin on this one and the only other front end I've used is coin ops like 15 years ago",
        "num_comments": 8,
        "comments": [
            "I like using [ES-DE](https://es-de.org/) installed with Emudeck.\n\nhttps://www.youtube.com/watch?v=05dunYi6hkY\n\nIf you don't want the machine running Windows you can install [Batocera](https://batocera.org/) and it will boot directly into Batocera's version of EmulationStation:\n\nhttps://www.youtube.com/watch?v=u5c6KZLUWTM",
            "Launchbox is my favorite for features and configurability. Try Retrobat if you want something simpler.",
            "Batocera or Retropie. if you wanna keep Windows, you can just dualboot.",
            "You never finish setting it up. Doesn’t matter what you choose :)",
            "I definitely want windows if I'm leaving it hooked to a TV. If it's in the arcade cab I don't mind either way. But if I use esde can I keep my roms seperate from my steam and pc games? I have a buddy that showed me emudeck i dont know a whole lot about it but it is cool and all but his steam games and roms were all combined which I've got full romsets of everything from atari consoles to amstrad to dos to all the nintendos, segas, and Sony consoles, to msx, pc88,pc98,sharp x68000 to like 12k mame roms etc pretty much everything retroarch can emulate I've got full romsets for plus some that RA can't emulate as well so I'd be sifting through 20,000 roms just to find a game lol that's why I've never gone emudeck.",
            "I really don't want to go extremely simple I don't mind a little setup just not the extensive setup that hyperspin needs. Do you use the free launchbox or the premium?",
            "I paid the forever license for it. Obviously that's not for everyone, but just try it out for free first to see if you like it.",
            "Hyperspin looks pretty but that setup is too much. Wish it was simplified a bit more."
        ]
    },
    "Citra redownload": {
        "title": "Citra redownload",
        "score": 1,
        "url": "https://www.reddit.com/r/RetroArch/comments/1dr4mcf/citra_redownload/",
        "content": "Hey there, Android-emulating guy. \nI was wondering how I could implement the Citra core back, if there’s no 3DS core anymore on the app anymore. \n",
        "num_comments": 0,
        "comments": []
    },
    "Roaming install vs normal install vs trying to update plz help.": {
        "title": "Roaming install vs normal install vs trying to update plz help.",
        "score": 1,
        "url": "https://www.reddit.com/r/RetroArch/comments/1dr3v5q/roaming_install_vs_normal_install_vs_trying_to/",
        "content": "I'm not sure if the title explains it all... I installed at some point in time long ago 1.10.something and I've been trying to update but whenever I do it installs to a completely different default location than C:/programfiles x86/retroarch etc Did the devs change the default path and why can't I just update from within the software the software.. This has happened somehow on another computer I've used this on too. Where I can't just simply update the damn thing... Any suggestions on updating properly? And should I just cut and paste the roaming  C:\\\\Users\\\\myname\\\\AppData\\\\Roaming\\\\RetroArch to the program files directory the other one made and then try to install 1.19.whatever? \n\nAnd I am correct in understanding there is no update option I **HAVE** to install on top of a previous install right in order to update and keep settings? ",
        "num_comments": 3,
        "comments": [
            "the reason retroarch doesn't install to `program files x86` by default is probably because the version you are downloading is the x64 version.\n\nyou honestly shouldn't install retroarch to any program files folders anyway since they usually require admin access.\n\nwhat you should do is setup retroarch from scratch. there have been a few changes since 1.10 and there will likely be conflicts between the different configurations. and ideally a portable install so you don't have to mess with any appdata folders either.",
            "You are downloading the installer. Don't do that. Download the [regular x64 version](https://buildbot.libretro.com/stable/1.19.1/windows-msvc2010/x86_64/RetroArch.7z) and simply extract the 7zip archive to a folder of your choice, such as:\nC:/Emulation/RetroArch\n\nMake a shortcut to retroarch.exe on your desktop.",
            "I cut and paste the folder from my roaming folder to my emulator folder then ran the installer into that folder, it updated the files that needed to be updated while keeping the configs the same."
        ]
    }
}