{
    "FAQ: READ THESE BEFORE ASKING": {
        "title": "FAQ: READ THESE BEFORE ASKING",
        "score": 81,
        "url": "https://www.reddit.com/r/RetroArch/comments/15c5qfn/faq_read_these_before_asking/",
        "content": "This post will include common questions and their answers. If you came to this sub to ask a support question, please read/search through these before asking. If you ask a question that is already answered here, your post may be locked or deleted.\n\nIf you would like to suggest something be added to the FAQ, *please use modmail*, as I do not want this post to turn into a support free-for-all nor do I want a million public \"please add this to the FAQ\" posts/comments.",
        "num_comments": 19,
        "comments": [
            "Q: My game is broken/won't launch/looks weird in PCSX2-libretro/LRPS2 core!\n\nA: Yes, that core is not in great shape. It works well enough when it works, but if it doesn't work, there's not a whole lot to be done about it, unfortunately. We hope to improve things with it at some point, but in the meantime, your best bet if you run into a problem is to use PCSX2 outside of RetroArch. It's a great emulator and has had a lot of improvements of its own since our preliminary core was forked off anyway.",
            "Q: My games don't show up. (or \"Scanning/importing content adds some games but misses others\")\n\nA: If you mean they're not being added to playlists when you scan, that just means they don't match our databases of known-good dumps, based mostly on No-Intro and Redump hashes. Those groups do not track things like bad/incomplete dumps (like ROMs you've had on your hard drive since the '90s) or ROMhacks/translations, so those are not going to show up. Some of our databases are also incomplete and just may not include an obscure game or revision (or one from a weird region). It's not a big deal, though, as you can just use the manual scan instead, which will skip the database check and add literally anything to a playlist",
            "Q: Which is the best core for ... ?\n\nA: There is almost never a single \"best\" core for all use-cases, so we can't usually make a good recommendation. However, if you go to the core downloader and press retropad-select while hovering over a core, it will pop up a description blurb that includes information about the core, including how it compares with other cores that cover the same games/console/platform so you can make an informed decision for your use-case.",
            "Q: RetroArch can't see games on my Android device's microSD card!\n\nA: Yes, this is a known issue caused by Google's \"scoped storage\" requirement, implemented in Android v11. There's no solution for it currently, though you can use RetroArch in conjunction with a launcher, such as Dig or Launchbox, to load games from removable storage.",
            "Q: I can't find the online updater!\n\nA: Not all platforms/devices/OSes expose the online updater. Notably, the Steam release of RetroArch does not include it as a condition of its approval by Valve. Many hacked/modded consoles also lack it because of a lack of network connectivity and/or because the cores have to be linked at compile time and can't be added arbitrarily after the fact.",
            "Q: Where does RetroArch store saves/savestates/screenshots/logs/whatever?\n\nA: Exact locations vary by platform/device/OS, but you can always see the path to any directory RetroArch uses by going to settings > directory.",
            "Q: I can't access my retroarch.cfg/overlays/shaders/etc. on my Android device because the directories require elevated/root privileges!\n\nA: RetroArch can be used as a \"storage provider\" with a compatible file manager/browser, such as FX File Explorer, which gives them access to any directory RetroArch owns/controls. This has become more important in recent versions of Android, which have restricted access to even some user-owned internal storage.",
            "Q: I broke my inputs!\n\nA: The easiest thing to do is just delete your retroarch.cfg and it will create a new one with default values. If you don't want to lose all of your settings and start from scratch, though, you can close out of RetroArch, then open your retroarch.cfg in a text editor (such as Notepad/++) and delete all of the lines that start with \"input\\_\". Save and quit, then reopen RetroArch and it will return just those lines to their default values.\n\nIf your controller is recognized by name and automatically configured correctly, you *almost never* need to go into settings > input > retropad mapping (as of v1.16.0; previously settings > input > port X controls), and this is one of the main ways people get into the weeds with input unnecessarily.",
            "Q: When I press buttons on my gamepad, hotkey stuff happens (B-button exits, start button loads state, etc.)!\n\nA: RetroArch lacks the ability to map multiple actions to a single button, for worse and for better. In this case, the problem is typically an external program that intercepts gamepad events and uses them to trigger keyboard events. Steam is by far the most common culprit, but any \"virtual gamepad\" software can do it, and we've gotten reports of it happening with Parsec and Steam Link streaming, as well.\n\nFor Steam, it can happen any time Steam is running, so just closing the Steam window will not fix it (i.e., as long as it's minimized to the taskbar instead of actually exiting the program), and it will continue doing this at all times, even for programs that aren't running through Steam (i.e., it can and does happen for non-Steam installations of RetroArch).\n\nIf you need to keep Steam open for whatever reason, look into disabling its input layer temporarily or on a per-game basis.",
            "Q: I can't find a core I would like to use in the 'load core' list. (commonly dolphin-libretro, ppsspp-libretro, citra-libretro, etc.)\n\nA: Not all platforms can run all cores, so which ones are available for a given platform/device/OS will vary. Sometimes this restriction is due to a technical issue, for example, the missing core may require access to a library or driver that is not available on your device (e.g., the lack of OpenGL support is why there is no N64 core for the PS3 or Wii versions of RetroArch). Other times, it's related to performance. For instance, you cannot emulate NDS games on a PSP.\n\nNotably: citra-libretro is not available on Xbox, and there are no functional PS2 cores for Android or Apple devices (iOS, tvOS or macOS) at the time of this writing."
        ]
    },
    "Useful Guides for RetroArch newbies": {
        "title": "Useful Guides for RetroArch newbies",
        "score": 165,
        "url": "https://www.reddit.com/r/RetroArch/comments/1ct7fb8/useful_guides_for_retroarch_newbies/",
        "content": "Now that the iOS fam have joined hopefully, these guides will help those unfamiliar with RetroArch:\n\n**Installing RetroArch on:**\n\n* iOS (iPhone & iPad) - [https://youtu.be/OTEo7TJyWqc](https://youtu.be/OTEo7TJyWqc)\n* Android - [https://youtu.be/1fbNedjr7bc](https://youtu.be/1fbNedjr7bc)\n* PC - [https://youtu.be/5F-Fo2f\\_4d0](https://youtu.be/5F-Fo2f_4d0)\n* Valve Steam Deck - [https://youtu.be/Bbr0a6b1qHI](https://youtu.be/Bbr0a6b1qHI)\n\n**Visuals:**\n\n* How to use Shaders - [https://youtu.be/iC99UbS8-JI](https://youtu.be/iC99UbS8-JI)\n* Make your own Shader presets (Appending & Prepending) - [https://youtu.be/xj0nU2eadJs](https://youtu.be/xj0nU2eadJs)\n* Automatically Load Shaders (per core & globally) - [https://youtu.be/dZpBRR4DGG0](https://youtu.be/dZpBRR4DGG0)\n* HDR - [https://youtu.be/RWxspx8Fd5I](https://youtu.be/RWxspx8Fd5I)\n\n**Basics**\n\n* Where do BIOS files go? - [https://youtu.be/4S2Zpv7BNtQ](https://youtu.be/4S2Zpv7BNtQ)\n* How to use Cheats in RetroArch - [https://youtu.be/YmhEqri4lSs](https://youtu.be/YmhEqri4lSs)\n* Useful Hotkeys for RetroArch - [https://youtu.be/4Gi6CGvE8Qs](https://youtu.be/4Gi6CGvE8Qs)\n* How to Rewind in games - [https://youtu.be/D4h82VmIy9g](https://youtu.be/D4h82VmIy9g)\n* RetroArchievements - [https://youtu.be/Q66j-Qv\\_wxo](https://youtu.be/Q66j-Qv_wxo)\n\n**Latency**\n\n* Preemptive Frames - [https://youtu.be/NDYqRoyOKI4](https://youtu.be/NDYqRoyOKI4)\n* How to Calculate Run-Ahead Frames - [https://youtu.be/KsU7zQw3VKI](https://youtu.be/KsU7zQw3VKI)\n\n**User Interface**\n\n* Change User Interface - [https://youtu.be/IHx6kWe5RnA](https://youtu.be/IHx6kWe5RnA)\n* Adjust Menu Text Size - [https://youtu.be/J15Ri7N04W8](https://youtu.be/J15Ri7N04W8)\n* Box Art and Thumbnails - [https://youtu.be/UejH8fqeG5w](https://youtu.be/UejH8fqeG5w)\n* Touch Screen Overlays - [https://youtu.be/MYaeSBXgLPY](https://youtu.be/MYaeSBXgLPY)\n* Create Views - [https://youtu.be/f4dc2en5iAc](https://youtu.be/f4dc2en5iAc)\n\n**Troubleshooting**\n\n* Games running too FAST - [https://youtu.be/QEE76fCToIY](https://youtu.be/QEE76fCToIY)\n* Fix Screen Tearing - [https://youtu.be/nTYVUWOMNRE](https://youtu.be/nTYVUWOMNRE)\n\n**Improvements**\n\n* Improved Sega Mega Drive Rotation Fix - [https://youtu.be/Dxfp\\_ZUfg38](https://youtu.be/Dxfp_ZUfg38)\n* SNES Mode 7 HD - [https://youtu.be/JqrzWr6Epq4](https://youtu.be/JqrzWr6Epq4)\n\n**ROM Organisation**\n\n* Convert cue & bin to CHD - \n[https://youtu.be/b1FKwDOEiwc](https://youtu.be/b1FKwDOEiwc)",
        "num_comments": 74,
        "comments": [
            "Thank you! I am completely new to this but eager to learn the ins and outs!",
            "Reddit should pin this. Well put together",
            "is there a way i could sync retroarch between 2 iphones?",
            "is there any way to use the delta controller skins ok retroarch?",
            "So this might be dumb but Id just like to make sure \n\nCan I transfer over all my save states, games and skins from Delta over on here? Also any skins I downloaded from Delta from other sources can be saved and used on here as well?",
            "Is there anything anywhere about how to do multi-disc PSX games on iPhone? Anywhere???",
            "Is there a way to hide the toggle that flips on and off the onscreen buttons?\n\nExample is when Im casting to my TV and using a controller, even with the on screen buttons hidden it still has that toggle visible and Id like it to go away entirely.",
            "Im having an issue with a psp game. When I load a .iso the game is sped up and when I tap on the fast forward button it speeds up faster",
            "Hello I can't find the retroarch folder in file on my iphone, can you help me please?",
            "Is there a way to have RetroArch choose a core when I load a game?"
        ]
    },
    "Xbox cores. PPSSPP, DS, N64": {
        "title": "Xbox cores. PPSSPP, DS, N64",
        "score": 1,
        "url": "https://www.reddit.com/r/RetroArch/comments/1drcy67/xbox_cores_ppsspp_ds_n64/",
        "content": "Hello, so I have a hard drive on my Xbox all setup for retroarch and all of my other cores are working properly, even the arcade stuff, but not \n\nPSP\nN64\nDS\n\nFunnily enough all the same settings on my pc with the hard drive work just fine. Are there known issues or tweaks I need to make for this to work on Xbox series x?\n\nI want to look at the log files to figure out what’s going on more than “libretro arch failed to load core”, but I don’t know how to find that on the Xbox. \n\nAny advice is appreciated. ",
        "num_comments": 0,
        "comments": []
    },
    "Consoles home menus?": {
        "title": "Consoles home menus?",
        "score": 1,
        "url": "https://www.reddit.com/r/RetroArch/comments/1drbbfo/consoles_home_menus/",
        "content": "Hi is it possible to set up home menus from the consoles that have one? Like PSP and Wii for example? ",
        "num_comments": 0,
        "comments": []
    },
    "Can you revert Y axis in Retroarch on a game by game basis?": {
        "title": "Can you revert Y axis in Retroarch on a game by game basis?",
        "score": 1,
        "url": "https://www.reddit.com/r/RetroArch/comments/1drb86p/can_you_revert_y_axis_in_retroarch_on_a_game_by/",
        "content": "I been using retroarch for a couple weeks, and I understand most of the settings.   I also checked the FAQ thread, and didn't see anything about reverting the Y axis in that thread. \n\nThe reason I want to do it, is in a flying game, some flying games, you push down to go up, and up to go down. I want to reverse that in those games, but keep the button settings the same in other games?\n\nI went into the retroarch settings and changed the Y axis so it was upside down, but then it is upside for all the other games I play. \n\nIs there a way to revert the Y axis on a game by game basis, and I am using retroarch on a handheld game system (Trimui Smart Pro).\n\nThanks in advance for helping.",
        "num_comments": 3,
        "comments": [
            "You can have per game settings that override other settings.",
            "Yes I done that before, but can't figure out how to do it for a controller buttons?\n\nWhen I changed the controller buttons, it stayed change for other games?   Can you save just the controller button settings on a game by game basis?",
            "First load the game, make your changes in:\n\n> Quick Menu > Controls \n\nAfter you're done swapping the analog axis go to:\n\n> Quick Menu > Controls > Manage Remap Files > Save Game Remap File"
        ]
    }
}