{
    "Weekly Self-Promotion Megathread!": {
        "title": "Weekly Self-Promotion Megathread!",
        "score": 5,
        "url": "https://www.reddit.com/r/retrogaming/comments/1dmjns3/weekly_selfpromotion_megathread/",
        "content": " Are you wanting to share your latest YouTube video, blog post, or to promote an upcoming twitch stream? Post it here! \n\n&#x200B;\n\nNote: You may also join us in our #self-promotion channel on our Discord server: \n\n[https://discord.gg/A98SXF4tzG](https://discord.gg/A98SXF4tzG)",
        "num_comments": 26,
        "comments": [
            "From what I read last night, I liked what I saw! I'll look forward to reading more.",
            "That's a really interesting essay series. Man, I remember reviewing that game when it first came out and thinking about how insidious the business side of the park management simulation could be.   \n  \nEDIT: I forgot to mention that I really enjoyed reading it and am now reading other pieces on your site!\n\nOne additional point to consider (maybe point 5!) is that Chris Sawyer didn't pioneer the idea of a theme park simulator, and his game shared a lot of ideas with Bullfrog's 1994 hit *Theme Park*, which predated *Roller Coaster Tycoon* by a good 5 years. Bullfrog's game was simple enough to be ported to consoles, but it had a lot of the same sim elements and philosophies - I remember my friends and I pulling the now-classic move of oversalting the fries to push drink sales higher.\n\nI'd love to see you compare those two games in a follow-up essay and perhaps see how similar (or dissimilar) their philosophies are! Since Bullfrog and Chris Sawyer were both from the UK, I'm guessing they had some shared influences that impacted their design.",
            "thanks so much for the feedback. i hope you find something you like in my other work; i try not to get into the actual gameplay/review much and instead focus on tying them into an overarching theme (like capitalism for RCT; or internet/social-media for Morrowind; or video-game 'addiction' for Phantasy Star Online; or Nostalgia for Halo2; etc.) although some of my earlier work is a bit dry. \n\ni will check out Theme Park again. i think I've played it before (on PS1 when I was younger, maybe?) as i distinctly remember a burger joint with a distinctively-creepy clown face, is that right? lol.",
            "4 part essay about capitalism set to the backdrop of RollerCoaster Tycoon 1:\n\nhttps://oncomputer.games/2024/06/14/the-worlds-greatest-theme-park/",
            "I recently retooled my 90s podcast into a retro-gaming podcast, and this week, we talked about Mike Tysons Punch Out!!\n\nhttps://generations.buzzsprout.com/2024899/15274101-backwards-compatible-12-mike-tyson-s-punch-out",
            "I've covered how graphics worked on the SNES, Mega Drive and TurboGrafx-16, so now it's time to look at the Neo Geo! [https://youtu.be/Lh77KKss4Hk](https://youtu.be/Lh77KKss4Hk)",
            "Ever wanted to see a cartoon fox play an old '90s Mac game? Well, now here's your chance: https://www.youtube.com/watch?v=u8Yi_K8laB4",
            "A brief and short teaser for an upcoming Doom 2 video, in which I will talk about some WADs made back in the game. The idea of the video is to serve both as a means to recommend custom maps and also as a tribute\n\n[https://www.youtube.com/shorts/DTNWJ-uq8xM](https://www.youtube.com/shorts/DTNWJ-uq8xM)",
            "I recently wrote an orchestral cover of the Tetris theme and added quite a few countermelodies :)! Maybe someone here likes it: \n\n[https://www.youtube.com/watch?v=fLKRw9qc6zQ](https://www.youtube.com/watch?v=fLKRw9qc6zQ)",
            "[*HOLY GRAIL* FULL PAL Sega Saturn Game Collection](https://youtu.be/cr3c4sDi4-Y)"
        ]
    },
    "What retro game will be mandatory in your household?": {
        "title": "What retro game will be mandatory in your household?",
        "score": 412,
        "url": "https://i.redd.it/b9ffpe5dod9d1.jpeg",
        "content": "",
        "num_comments": 155,
        "comments": [
            "\"You mean you have to use your hands?  That's like a baby's toy.\"",
            "The CD-i games are included in \"all\".",
            "No need to force anything. Let them find a retro game they enjoy... or not! That being said I think SMW, Kirby, or Yoshi's Island.",
            "I'm doing this. I'm raising Battletoads' masters to avenge me!",
            "Nothing. I wouldn't try to force my interests on my children, if I ever have any. If they're interested, cool, if not, they're invidiuals with their own taste.",
            "Turtles in time. SNES version.",
            "Super Mario World, but let the kid go as Luigi and just make sure they're stocked with lives.",
            "Metal Gear Solid and Streets Of Rage.\n\nIf they can't enjoy those, I know they're not *really* my kids.",
            "ToeJam & Earl and Sonic 3 & Knuckles",
            "My kiddo found plenty of stuff in Nintendo Switch Online he likes. Particularly Marios 1, 2, and 3, but also Ice Climber. I steered him towards Blaster Master and Zelda (which he knows from watching me play TotK). When he's ready to go RPG we'll jump into Crystalis.  \n\nIn the meantime we're also going through the Megaman Legacy Collection. Also my OG NES has been in storage for a year while we looked for a house... and now we got one. So in a month or so it'll be set up and we can check out titles that aren't in NSO or MMLC... particularly Contra/Super C, Battletoads, Castlevanias, Bubble Bobble, and who knows what else I forgot I had. Will need to teach him how to patiently deal with finicky gray cartridges."
        ]
    },
    "It's Friday night in 1990 and we're having a sleepover. What game from my childhood collection do you want to play first?": {
        "title": "It's Friday night in 1990 and we're having a sleepover. What game from my childhood collection do you want to play first?",
        "score": 218,
        "url": "https://i.redd.it/820lhueufe9d1.jpeg",
        "content": "* StarTropics\n* Maniac Mansion\n* Caveman Games\n* Hard Drivin'\n* Spot: The Video Game\n* A Boy and His Blob: Trouble on Blobolonia\n* Little Nemo: The Dream Master\n* The Adventures of Rad Gravity\n* Snake Rattle 'n' Roll",
        "num_comments": 174,
        "comments": [
            "Little Nemo for sure.. a great game, with fantastic design, tight controls, memorable music. Otherwise.. maybe StarTropics, but its a pretty long, albeit good, game.",
            "Man as long as its an original copy. Im playing Maniac Mansion and putting the hamster in the microwave.",
            "Since it's 1990 and I'm 5 years old I'm grabbing Caveman Games! But in 2024, we're going with Nemo and we ain't stopping until we beat that bad boy.",
            "Snake rattle and roll followed by little Nemo.",
            "A Boy and His Blob adds fun variety",
            "Spot. Its nearly impossible to convince anyone to play that game with me, but I love it. Go and Reversi just dont scratch the same itch for me.",
            "Snake rattle and roll was one of my favorites. Caveman games is a definite party hit.",
            "First we're going to start figuring out *Maniac Mansion*, but after that we're going to play the copy of *Mega Man 2* that I rented for us.",
            "Snake Rattle and Roll. It's a sleepover right? It's by far the best multilayer game there.",
            "Caveman Games had no business being that hard. I was only able to win in the fire duel when I've become an adult."
        ]
    },
    "Most injuries you've received": {
        "title": "Most injuries you've received",
        "score": 93,
        "url": "https://i.redd.it/bsxpe0uhif9d1.jpeg",
        "content": "After a ridiculous game VS cpu ",
        "num_comments": 18,
        "comments": [
            "\"Baby, don't hurt me... Don't hurt me, no more.\"\n\nOh, wait... That's Haddaway... Sorry.",
            "Looks like he learned the Hardaway.",
            "At that point, you're not a super star: you're a liability.",
            "At that rate, he'll have an injury on every bone in his body. o\\_O",
            "Poor Penny's dead, and he doesn't even realize it. RIP.",
            "AI does not play in that game, they play street ball",
            "I never have this trouble when I play as Clyde The Glide Drexler",
            "Poor Hardaway. He could really have been the next MJ if it wasnt for his injuries.",
            "The greatest arcade style basketball game ever made is so good, the name doesnt need to be mentioned. \n\nIn all seriousness, its NBA Jam, idk what exact version this is.",
            "This is NBA Jam Tournament Edition, I think specifically on the PS1 as that one has aggressive AI that shoves A LOT, leading to injury totals like this.\n\nIf this isn't the PS1 version...Holy hell."
        ]
    },
    "Arcade Collecting Appreciation Thread: What's In Your Game Room?": {
        "title": "Arcade Collecting Appreciation Thread: What's In Your Game Room?",
        "score": 14,
        "url": "https://i.redd.it/jv01cghndi9d1.jpeg",
        "content": "",
        "num_comments": 9,
        "comments": [
            "Not a full size arcade machine, but I own a RadioShack Astro Thunder mini cabinet from 1985",
            "I thought about turning my garage into an arcade whats your electric bill like? Howre you able to plug all those in?",
            "Very cool! I love those old RadioShack mini cabs.",
            "I'm not using anything special, just standard surge protectors. The impact on my electric bill is minimal, as I don't have them running unless I'm playing them or hosting a party.",
            "Ah ok makes sense thats super cool nice setup",
            "Thanks, dude - really appreciate it! If you have the urge to convert the garage into an arcade, I say do it. It's an incredibly fulfilling experience bringing the arcade home.",
            "What arcade cabinets do you have in your game room?\n\nI started collecting arcade machines in 2005 when I picked up my Neo Geo MVS four-slot cabinet. Since then, the collection has grown to nine machines throughout the house, including:\n\nSNK Super Neo 29 Candy  \nCapcom Q25  \nTaito Vewlix Diamond Blue  \nSNK Neo Geo MVS 4-Slot  \nArea 51/Maximum Force combo cab  \nThe House of the Dead  \nThe House of the Dead II  \nDonkey Kong Jr.  \nRhythm Tengoku\n\nAt this point, I'm about tapped out space-wise, but part of me wants to sell off the DKJR and nab a Unico Nova Blast, but I'm torn.\n\nWhat's in your lineup?",
            "Collection/Pickup/Battle Station posts may only be posted on Saturday and Sunday. If it is not the weekend this post will be removed. **Please provide a prompt with your post for discussion under this comment**. No graded games (e.g. WATA, VGA, CGC).\n\nAlternatively, this content might fit in /r/gamecollecting, /r/retroish or /r/battlestations.\n\n**Your post is under manual review by the moderators before it will go live.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/retrogaming) if you have any questions or concerns.*"
        ]
    }
}