{
    "Typical Tuesday Tutorial Thread -- June 18, 2024": {
        "title": "Typical Tuesday Tutorial Thread -- June 18, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/RimWorld/comments/1dikgs8/typical_tuesday_tutorial_thread_june_18_2024/",
        "content": "Please use this thread as a week-to-week space to ask your fellow /r/RimWorld colonists for assistance. Whether it be colony planning, help with mods, or general guidance, post any questions you may have here! If you have an effort post about a game mechanic then this is also fine space for that but please consider making a separate subreddit post for maximum visibility.\n\nI am a bot, so I can't make jokes. If you'd like a Typical Tuesday joke, or if there are any problems with this post, please [message the moderators of the subreddit](https://www.reddit.com/message/compose?to=%2Fr%2FRimWorld).",
        "num_comments": 65,
        "comments": [
            "Why can't we queue psycast anymore? Maybe it's just me and mod conflicts but can anyone else queue psycast in 1.5? Or am I missing something?",
            "Rimworld of Magic question:   \n  \nSo I got a chronomancer because their reverse time spell seemed OP as heck.  But I casted reverse time four times on someone with a demolished shoulder and it didn't clear up the problem.  The shoulder had just be screwed up in a skirmish where I captured them.  Does it only work on colonists?  Did I wait too late to cast it on them?  Does it just not work like it is supposed to?\n\nTheir age went down by a year or so but their screwed up shoulder never got healed.",
            "so I'm a bit new, and is it supposed to take 6+ days of time just to do fabricator research? I even have two research benches and they're both in a clean room, it's just all these researches that take 4000+ points take ages no matter what. even got that thing you attach to the tables for faster speed.",
            "I've played off and on for years now, but since Anomaly have been playing nonstop with my first two ever successful colonies. I'm playing without mods and have all of the DLCs installed.   \nEarly on in my second colony tribal raiders kidnapped a child. When this happened I got a popup that said that there /will/ be chances to retrieve this child.   \nYears have passed and her parents and sister still have her on their social tabs. They all have feelings about her (she's apparently disfigured now, which I have no clue how any of them know that), but she has a +0 to feelings about all of them. When I hover over her name, it doesn't say she's dead- only that she belongs to the tribe type that stole her.   \nI have never gotten any opportunity that I have noticed to save her.  I've been raiding and destroying their nearby colonies nonstop in an effort to find her.  \nIs there something I'm missing here? Should I be trying to befriend this group of heathens instead of grinding them into the ground? Have I somehow just not hit the colony she's currently staying in?  \nAny help on how to find her would be appreciated. I've been putting off trying to get an endgame sequence until she is retrieved, as a bit of RP. But if there's no way to get her back, I'll just have to move on.",
            "I might be going crazy but I seem to remember that way back in the day, areas were different for humans and animals. Is there a mod that brings that back? Or introduces it if it was never like that and I'm just making it up. \n\nI've got about 6 areas for humans, 6 different areas for mechs and 4 different areas for animals and having all of them at the same time is a bit much, especially since I never want to put humans in animal areas and so forth.",
            "First time playing with Anomaly what tips would you give me with out to much spoiler?",
            "Are there any known mod conflicts that cause animal training to fail to complete? The pawn starts training, works for the usual amount of time, then instead of it saying it succeeded or failed... nothing happens. They just walk away and the animal is still free to be trained again.\n\n\nThere's nothing in the logs indicating an error. It's like it just skips the last step.",
            "Is anyone else unable to jump multiple pawns with jump packs?",
            "Is it just me, or can repeatedly reloading saves impact performance? After a few loads, my system freezes and I have to restart. I’m not sure if this is a mod issue, a Steam Deck issue, or just a Rimworld issue.",
            "Hi!\n\nI've all the things except for Biotech and Anomaly. I know a lot about Biotech from watching YT playthroughs, and I've been meaning to buy it for at least a year.\n\nDoes Anomaly require Biotech?\n\nI should probably just buy Biotech before I jump into Anomaly, right?\n\nIs it reasonable to expect a DLC bundle on steam? I don't remember, but I think I bought Ideology+Royalty as a bundle. I could wait months for a Biotech+Anomaly combo."
        ]
    },
    "PSA regarding Name-In-Game rewards / purchases": {
        "title": "PSA regarding Name-In-Game rewards / purchases",
        "score": 127,
        "url": "https://www.reddit.com/r/RimWorld/comments/1cbsm8a/psa_regarding_nameingame_rewards_purchases/",
        "content": "It seems like a few people have noticed their Name-In-Game is no longer coming up, and seem to be missing from the game. We're working on figuring out what happened, and fixing it as soon as possible.\n\nIf you're not sure if your name is there or not, go into:\n\n**Options > Gameplay > Add name...**\n\n[Type your name into this box, like so.](https://steamcommunity.com/sharedfiles/filedetails/?id=3260759814)\n\nIf you've noticed your Name-In-Game has vanished, please contact me in some way with the *full* name, **First 'Nickname' Last**.\n\nOptions for contact are:\n\n* Leave a comment here on this post\n\n* Send it to me in PM if you want it to be private\n\n* Message me on Discord as Sneaks, I'm in both [the official development server](https://discord.gg/yA3QGzHMK6) and [the the community server](https://discord.com/invite/UTaMDWc)\n\n* Comment on the [announcement post](https://ludeon.com/forums/index.php?topic=58547.msg500302) on Ludeon's forum, or message me there\n\n* Comment on the [Steam discussion board announcement](https://steamcommunity.com/app/294100/discussions/0/4336483106373353692/)\n\nSorry to all those whose names have been lost in the release, we'll get you re-added as soon as we can!",
        "num_comments": 52,
        "comments": [
            "I was thinking about purchasing this to support the game - if I do how soon realistically could I expect to see my name added (given the only very recent patch)?",
            "This whole thread is a goldmine for social engineering. Bookmarked for sure.",
            "Doze \"Twelve\" Macacos",
            "I bought the pack years ago and honestly never knew how to even go about putting a name in the game",
            "I have a different problem: I gifted a Name-In-Game version of RimWorld to a friend and neither her nor me can add her name to the list. Whenever we log into the Creative Rewards site (with either the gifter's email or the gift-receiver's email) we are told that neither of us is entitled to any rewards. I thought we just had to wait a bit but it's been a while now. Could you please tell me what I can do to solve this?\n\nORDER RECEIPT\n\nDate:                   2024-04-01\n\nOrder ID:               0140138035\n\nGateway Transaction ID: 41E13606PT3361639\n\nCustomer Name:          Paolo C\\*\\*\\*\\*\\*\\*\\*\\*\n\nCustomer Email:         paolo@c\\*\\*\\*\\*\\*\\*\\*\\*.com\n\nProducts:               RimWorld Name in Game Pack x 1 @ $50.00\n\nSub-Total:              $50.00\n\nTotal:                  $50.00",
            "I haven't been able to see mine - Terrence \"Stash\" Braddock",
            "I bought the name change a while ago, is there anyway i can change my nickname on it? I can't seem to do so via the website.",
            "Mine is no longer available: Sinsade “Sins” Valone",
            "Katrina \"Trina\" Neal",
            "I actually paid for it a while back and never figured out how to add it to the list lol"
        ]
    },
    "If genetic engineering is wrong, I don't want to be right": {
        "title": "If genetic engineering is wrong, I don't want to be right",
        "score": 514,
        "url": "https://i.redd.it/1amdptb4x28d1.png",
        "content": "",
        "num_comments": 23,
        "comments": [
            "Sabertooth catgirls.",
            "You have heard of the Neanderthal, but were you aware of the Nyanderthal? She's actually the randomly generated wife of our dirtmole colonist. She was with a raid (already as his wife) and I had him literally bonk her on the head with a club and drag her back to his cave. She was so into it, she joined us and now we did this to her D: ... Knowing her, she's probably also into it.",
            "I love it!",
            "Your scientists were so preoccupied with whether they could, they didn't stop to think if they should.",
            "*Nyan*  \n*Ichi - Ni - San*  \n*Nyan*  \n*Arigato*\\~",
            "Idk if I should praise you for your creativity or admonish you for your creativity!",
            "This is gold",
            "unironically this is what I've been doing to colonists I recruit like hussars who are xenogenes with drug dependencies because they won't take drugs while outposted\n\nso they get turned into catboys and catgirls with a couple of the upsides still intact like the shooting and melee ranks and such lmao",
            "Pawnmorpher is a gift that keeps on giving",
            "How the fuck has this never been drawn"
        ]
    },
    "wait what doe- OH MY GOD thats a lot of thrumbos": {
        "title": "wait what doe- OH MY GOD thats a lot of thrumbos",
        "score": 606,
        "url": "https://www.reddit.com/gallery/1dlcknw",
        "content": "",
        "num_comments": 56,
        "comments": [
            "Yeah, it's *you* that's being hunted.",
            "Wait, what's tha... OH MY STEVE JOBS that's a lot of drugs in your coffers, are you running an innovative tech corporation?",
            "Vanilla psycasts expanded bend probability is so silly",
            "I was beginning to worry that I was alone in my colonies high wealth, looks like I'm not!",
            "You should cut down some trees if you ever want to see wood again",
            "I have two things to say,\nWhy is there ash all over the ground? Have you considered “Thrumbo Revenge”: nearby thrumbos have also become enraged.",
            "Hey, at least you have 47 tries (likely more) of rolling the 1% tame chance before they leave",
            "Just *imagine* the *Maddened Manhunter* notifications with a single mortar hit.",
            "Remember Alphabeavers? Big RIP to your woods here.",
            "1 well placed antigrain… Mby 2 who knows"
        ]
    },
    "Anyone else overly paranoid with power conduit redundancy? How does this affect Zzzt?": {
        "title": "Anyone else overly paranoid with power conduit redundancy? How does this affect Zzzt?",
        "score": 973,
        "url": "https://i.redd.it/v4aa6zbpcy7d1.png",
        "content": "",
        "num_comments": 117,
        "comments": [
            "Hidden conduits never go zzt and I don't think anything can break them except your deconstruct tool, so redundancy isn't necessary.",
            "If you have any standard conduits (not hidden ones), then you can have a Zzzt event. I don't believe the chance to have a Zzzt scales with more conduit.\n\nI also like to have some redundancy with power conduits. However, it's not as necessary with the addition of hidden conduits since they are near indestructible. Also, if you only use hidden conduits you don't have to worry about Zzzt events anymore.",
            "I haven't got a single zzt event since I started using hidden conduits.",
            "Redundancy is a good thing. Battle damage can destroy power conduits so I always find it worthwhile to have backup paths.",
            "I do that all the time as well, I like redundancy, after a few mishaps where half my base  was left powerless haha; and yeah, underground cables are a blessing. Am not sure if it was made mainstream or it's still a mod(probably the former), I hated those random inevitable zzt events. I still have a billion of fuse switches(mod) that will trigger instead of having the wire event. [https://i.imgur.com/YYBD4AY.png](https://i.imgur.com/YYBD4AY.png)",
            "Not paranoid because I use hidden ones, but it just drives me nuts",
            "ever sense my defensive grid for the east side of my colony got taken down by a inopportune zap, which was (of course) followed by a raid, all of my critical infrastructure has at least two routs back to whatever I have generating my energy.",
            "I don’t do this. I just use hidden conduits.",
            "I use the RT(?) Fuse mod. As basic as a mod can be.",
            "just disable zzzt its a dumb mechanic that never made sense."
        ]
    }
}