{
    "Typical Tuesday Tutorial Thread -- June 25, 2024": {
        "title": "Typical Tuesday Tutorial Thread -- June 25, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/RimWorld/comments/1dnzu0p/typical_tuesday_tutorial_thread_june_25_2024/",
        "content": "Please use this thread as a week-to-week space to ask your fellow /r/RimWorld colonists for assistance. Whether it be colony planning, help with mods, or general guidance, post any questions you may have here! If you have an effort post about a game mechanic then this is also fine space for that but please consider making a separate subreddit post for maximum visibility.\n\nI am a bot, so I can't make jokes. If you'd like a Typical Tuesday joke, or if there are any problems with this post, please [message the moderators of the subreddit](https://www.reddit.com/message/compose?to=%2Fr%2FRimWorld).",
        "num_comments": 60,
        "comments": [
            "Is there a mod that adds an evolution gene? When they become adults their xenotype changes to another? Or after a ritual. Or after clicking a button.",
            "ok, i realize i miss obvious stuff sometimes... but why do i care if the random visitor to my raresanevoice-fort is the nephew of the corn farmer? Is it just role play flavor or is there like a recruitment opportunity or something?",
            "I wanted to start modding rimworld (want to make a simple mod to replace the main menu backgrounds) but I don't know where to start. Any advice?",
            "Is there a mod that makes my colonists put books back on the shelf when they are done reading? I feel like I've become a parent with all my kids just dropping their toys whereever they were when they are done with them. \n\nI tried changing their meal policy to \"nothing\" to teach them a lesson but it didn't work.",
            "Help me stop making every room a square or rectangle, I'm addicted to making giant rectangles with so much walking between everything.\n\nI have atleast gotten out of the habit or connecting every square/rectangle as one kinda of super structure and trying to spread stuff out and making a town with different buidlings but i instantly go to square/rectangle when creating a new building and everything lacks character and charm. Nothing is cozy, everything is boring.",
            "I want to hear how YOU people start your game. Preferably in vanilla.",
            "So if someone were to set an end goal of having \"a lot\" of silver.... What would \"a lot\" actually be?\n\nContext is a more Hospitality/Gastronomy/casino/hospital/trader type play through.",
            "How do I deal with an Archon raid? A guy shows up with a crazy fire sword and seems to be resistant to bullets and fighting up close results in permanent searing scars so how do I beat that?",
            "Any recommended mod for storing food? was using reel storage but it doesn't have any storage for foods only raw material, i want it to be able to pack more stock in it compared to vanila shelf. saw some but it mostly was refrigerator which was high cost and less useful than a freezed storage space.",
            "SO i have an interesting issue were i can't see the ? marks for trader pawns and i can't see were i set up mining. i'm not sure what mod is causing this. modpack is 402 mods. i went through the usual suspects. Colored mood bar, jobs in bar, veinminer, labeled floors. but it wasn't any of them.\n\nOK so it seems the issue is linked to Character Editor."
        ]
    },
    "The boomrat plush just might explode... with love!": {
        "title": "The boomrat plush just might explode... with love!",
        "score": 722,
        "url": "https://i.redd.it/2wsr51xwc59d1.jpeg",
        "content": "",
        "num_comments": 53,
        "comments": [
            "We need a mini muffalo next :(",
            "Boom rat 6 has contracted the plauge",
            "It's so cute! I love that it glows in the dark. Probably why the little pustules are white and not yellow. Kinda looks like a cinnamon bun. Since I missed the thrumbo, I will have to get this!",
            "Each one contains a pipe bomb",
            "the pustules on boomrats in game are yellow right? and these ones are white?\n\njust making sure i'm not developing like, a colorblind disorder",
            "I want labrador retriver plushie",
            "Please I really wanted a thrumbo",
            "Somebody please make a mod that makes the boom animals glow in the dark.",
            "Ah, as much as I'd like one, $60 CAD is a bit much for me.\n\nHope they don't explode on you guys. Enjoy!",
            "Yeah yeah, so cute but are you sure that if I buy it my house will be safe or will it explode my table?"
        ]
    },
    "All quiet on the Rimworld Front !!": {
        "title": "All quiet on the Rimworld Front !!",
        "score": 1335,
        "url": "https://www.reddit.com/gallery/1dqvjkl",
        "content": "",
        "num_comments": 49,
        "comments": [
            "Always happy to see more of people's own little narratives from the game be given life in comics like this. Love the art style. Would happily read more of these if you have any plans to make more.",
            "Man, these comics just make me want to play more Rimworld, they capture the atmosphere of the game so well",
            "Petra just wants a CRUNCH bar",
            "I donno, maybe not in liquid form",
            "Rice and chocolate? So champorado, basically?",
            "Man, that's some cute art. I love it, lmfao.",
            "I mean, isn't that what puffed rice is for??? Like Rice Crispy Treats????",
            "a good rimworld chef proposes they mix two unrelated foods\n\na great rimworld chef does it with no one noticing, not even god",
            "I don't think raiders are necessarily evil, at least not all of them. The rough factions are untrustworthy of outsiders, which isn't that irrational when you consider just how many awful things and people are on the world. The vast majority of impids literally can't farm, but they are very fast and good with fire, so large tribes need to pillage other factions to survive.",
            "The draft is always fun. On one hand you don’t really want to leave them on the line just waiting, slowly starving, but on the other hand it’s far too risky to wait for the attack to start to form up.\n\nSo into the trench it is. You’ll drink your mud coffee and be happy."
        ]
    },
    "Follow Up: Baby Belle Was Not, in Fact, Cremated. She's Growing up Completely Safe and Healthy.": {
        "title": "Follow Up: Baby Belle Was Not, in Fact, Cremated. She's Growing up Completely Safe and Healthy.",
        "score": 86,
        "url": "https://i.redd.it/vsukh03a1i9d1.jpeg",
        "content": "",
        "num_comments": 20,
        "comments": [
            "\"You be good now, honey, and play in the shed with the CHEMFUEL and the UNSTABLE POWERCELLS. ... Yes, the one behind all the spiky traps. Now shoo, Mommy has some raiders to cremate\"\n\n* Belle's mom, probably",
            "Might want to wall those powercells in. They don't need repairs",
            "Had another baby and named it Belle to avoid the cremation allegations.",
            "ahh i see you are trying to build a thermonuclear bomb. The infinite chemreactor and the genebanks are just to spice things a little up. Go get em chad!",
            "I love seeing those colonist arcs.",
            "You made her a Pink Floyd fan, look at this drawing",
            "For Belle's sake I really hope you do not have conduits adjacent to those unstable cells. They are pretty fragile and a Zzzt can easily cook them off.\n\nUsing structures with integrated conduits, like power switches to connect them, so in an event of a Zzzt the explosion can't occur close.",
            "Be careful with those power cells. I made the mistake of placing them next to my Chem fuel storage and silly little colonist just had to have a tantrum.\n\nRIP colonist and half of base. Never building out of steel again.",
            "Those traps are not safe, colonists will walk over them and the chance to lose a head is small but not zero.",
            "have a thing for blasts it seems"
        ]
    },
    "So my colony is Alabama.": {
        "title": "So my colony is Alabama.",
        "score": 420,
        "url": "https://www.reddit.com/r/RimWorld/comments/1dqzcfj/so_my_colony_is_alabama/",
        "content": "Flairing because I think this is one of those weird cases rule 3 goes over and I don't wanna get /killed by the mods.\n\nOk so. This is a wild story that I sorta made a comment on another post about, but as I thought about it, I realized holy hell this NEEDS to be a post because good god. I ended up talking about the whole saga on Discord with a few friends as it happened, so I have a (rough) outline of exactly how things went down.\n\nAnyway, I start out the game. Generic anomaly crash-land scenario on strive to survive difficulty, this is my first real playthrough with the new anomaly DLC and I wanted to have a good time. I don't play with many mods. I have the anthro race mod and a few quality-of-life and texture mods, but that's about it. Nothing more, because I want this first playthrough to be relatively vanilla.\n\nMy starting colonists are Keiko, Lloyd, and Albina. The first two of which are brother and sister. If you read the title, I'm sure you know where this is going. Not even 10 in-game hours after the initial crash-landing, the two got together. I still think that's the funniest thing. You crash land onto a hostile rimworld and you've gotta get yourself figured out and make camp so you survive the night, and your FIRST thought is \"Hmm ah yes I think I should ask my sister out by complimenting her leg hair.\"\n\n[My honest reaction when.](https://preview.redd.it/rulvruo7ke9d1.png?width=837&format=png&auto=webp&s=83bff0c38c0c8958196b1d2b599b4d42c3d36fd2)\n\nNow, it could've stopped there. Things would be fine. But of course, it doesn't end there. The two end up getting married within a season, and within yet another, Keiko is pregnant. Since I wasn't too keen on the whole ordeal, I'd set the pregnancy approach to Avoid Pregnancy, but of course, if the two of them were apparently lovin' enough to get \"Got lovin' x8\" in their needs bar, of course that meant nothing.\n\nAnd of COURSE the game decided to throw yet another curveball at me, and decided that the pregnancy that I'd been avoiding would end up being twins. So here we are, Keiko and Lloyd with a set of twins, and I think I'd gotten a few other colonists through raids and such by then, but they aren't the focus of this post.\n\n[I didn't even know twins were possible. Mod thing maybe???? I don't think any of my mods did that tho.](https://preview.redd.it/me0a9ecjle9d1.png?width=308&format=png&auto=webp&s=c0d694db8871fbe78575ced085a16a844c3a4472)\n\nAnyways. Story continues.\n\nAs I mentioned, this is the anomaly scenario and my main goal for this playthrough was to get the anomaly content. Keiko and Lloyd happen to be my lead researchers, and they've been in charge of all that. So a corrupted obelisk appears and me being completely unaware of the random chance to duplicate the person suppressing it, I simply let them research and suppress it like normal. This leads to what I can only describe as yet another step into the descent into insanity.\n\n[The clone wars.](https://preview.redd.it/mnlswxtnme9d1.png?width=333&format=png&auto=webp&s=d6f9b52fe8a0ca47c6eb99a220437ac41e20b2d6)\n\nDuring this whole time, Keiko and Lloyd are having more kids SOMEHOW and are up to like 5? The fifth of which has the inbred gene. I later looked it up and apparently the inbred gene is supposed to be 80% chance between siblings so the fact that we're up to now 5 kids and only one has had that gene is a bit insane if you ask me.\n\nKeiko ended up getting herself duplicated with the obelisk, and that clone was then dubbed Kaiko. By this point, I was fully embracing everything and was just curious to see how far things would go. The clones got together, which, honestly I don't think I was that surprised at this point because it seemed par for the course.\n\n[It continues.](https://preview.redd.it/53edod4lne9d1.png?width=639&format=png&auto=webp&s=7228479486bd382dcb79fc8ecd50ebe58074bbca)\n\nNow of course it would be one thing if it was just this one pair of siblings. That would be crazy on its own. But no. We're going fully down the god damn Alabama pipeline.\n\nRemember those twins I mentioned earlier? Mhm. They're adults now. The colony is about 6-7 years old now  by this point. We've got a good number of colonists and the original Keiko and Lloyd have like 7 kids now while the clones have one of their own. Leif is one of the colony's main crafters, specializing in crafting and making armor and higher-tier guns. Lorena is the colony's main artist because our original artist got moved to construction. This is interesting because my artist bench and fabrication benches are right next to each other. Something I don't think I fully expected, but was unsurprised with nonetheless was the fact that Leif was getting \"rebuffed\" mood debuffs. Which. Goodness gracious I wonder where that's coming from. Eventually, it seems that Lorena got worn down though because welp apparently that's how things go in this colony from hell.\n\n[It CONTINUES.](https://preview.redd.it/ccf64vrwoe9d1.png?width=492&format=png&auto=webp&s=7842be15fd261dc33fdb376599813e6307052515)\n\nThe clone situation as well. It certainly is going places. And by this point I'm just that idiot in the corner not asking should we do something but asking if we could. So uh. We now have 6 of them. 3 couples.\n\n[IT FUCKING CONTINUES](https://preview.redd.it/qtk1v8mipe9d1.png?width=565&format=png&auto=webp&s=2daac4b67cfef6359f14ee27b1cf01af0dcb0ca9)\n\nAs we near current day. I did some math and reflection.\n\n[Help.](https://preview.redd.it/gm16x52aqe9d1.png?width=680&format=png&auto=webp&s=8cf1d6dd35fad9c32735a99446b0e04258d038a1)\n\nSo anyway. That brings us basically to where we are now. 1 more set of duplicates of Lloyd and Keiko have been made, named Ddoyd and Kuiko, but otherwise, things are mostly caught up to where we are now. Obviously this colony has had a whole lot of other things over time, other colonists I haven't mentioned, other events and big deals like deaths and other kids, but this post is about how my colony has become fucking Alabama so here we are. I'm still playing this colony so it's just an ongoing thing, but good god this is one of the fucking playthroughs ever.\n\n[The full colony.](https://preview.redd.it/191bvj3kre9d1.png?width=1480&format=png&auto=webp&s=519db09a785bf872b9e75a4263df26a44a4153c3)\n\n[Keiko's relationship tab.](https://preview.redd.it/q0lc80u4se9d1.png?width=507&format=png&auto=webp&s=a749f7a750cd0806b19d125ae7db3abd1eafa40f)\n\n[Leif's relationship tab.](https://preview.redd.it/cz83suj7se9d1.png?width=508&format=png&auto=webp&s=9ae1995e12dfacb4e7ba3a0ad40fdde6ccff46b6)\n\n[I didn't even know the \\\\\"Got some lovin'\\\\\" buff could get this high.](https://preview.redd.it/5akanx8rse9d1.png?width=303&format=png&auto=webp&s=cde15165e40fb57d9b3ebc265bd2a95e55745754)\n\nTheir relationship bars are always maxed out. They seem relatively happy. But good god. Their family tree is just a god damn straight line. And I'm not convinced the \"Pregnancy Approach\" option does \\*anything\\*.\n\nAny questions people have I will do my best to answer. And once again, I've looked through my mod list, and read the whole of the anthro mod's XML to see if it's just something where pawns of the anthro race don't care about siblings or something, and nope, turns out the game just decided fuck you Alamaba time.",
        "num_comments": 45,
        "comments": [
            "I hope this pine of a family tree gets the attention your effort deserves, that’s insane",
            "Thank you for letting me know you posted this. I just finished reading this and I lost it when Lloyd got duplicated, it just gets so next level ridiculous. One of the funniest things I've read here so far.",
            "In the vanilla research tree, there is 'fertility measures' or whatever it's called. Give those poor women some IUDs or vasectomies for the guys. lol",
            "This was actually better than I imagined with the clones getting involved. Is there still only one inbred defect or have you started getting a bunch?",
            "Idk why but Ddoyd really got me. ",
            "I’m a very new player to this game. And holy hell and also what the hell",
            "So fun fact, anomoly obelisk clones dont actually inherit the family relationships of the pawn they copy, so according to rimworld, getting with your clone or your family members clone isnt incest.",
            "I suggest Cake-o for the next Keiko clone.",
            "Least insane 200+hr Rimworld colony to be honest. Heckin nice 👍",
            "What if the way to reach true happiness is to fuck your sibling…."
        ]
    }
}