{
    "30 years old, divorced before I was 25, overweight, unemployed, 2 kids and I've only found out I have ADHD and I'm autistic this year. I doubt you can make me feel worse but go for it, roast me": {
        "title": "30 years old, divorced before I was 25, overweight, unemployed, 2 kids and I've only found out I have ADHD and I'm autistic this year. I doubt you can make me feel worse but go for it, roast me",
        "score": 590,
        "url": "https://www.reddit.com/gallery/1dlkfc7",
        "content": "",
        "num_comments": 1029,
        "comments": [
            "wow, that's a lot going on.  it must feel good to get a load off your chest rather than on it.",
            "Well there’s always OnlyHams.",
            "Your sports bra says \"my rules\", but you eyes say that \"any guy is in charge\"",
            "You look like you have enough yeast infections to start your own Panera Bread franchise.",
            "When will your kids divorce you?",
            "Condolences to your kids.",
            "\"30 years old, divorced before I was 25, overweight, unemployed, 2 kids and I've only found out I have ADHD and I'm autistic this year.\"\n\nSounds like a tinder bio, might as well add that your potential man must earn 6 figures, be at least 6\" and \"My kids are my world and they come first\"",
            "Your 100% free onlyfans has the largest number of refund requests.",
            "# \"30 years old, divorced before I was 25, will be divorced three more times, unemployed deadbeat loser, 2 kids from different fathers, and I've only found out I have made up my mental illnesses as an excuse to become an unemployed degenerate this year.\"\n\n  \n-corrected",
            "I’m sure I can’t make you feel* worse, but your poor excuse for a pokemon tattoo certainly made me feel worse.\n\nEdit: left out the word feel lol"
        ]
    },
    "Just graduated HS. Fire away!!": {
        "title": "Just graduated HS. Fire away!!",
        "score": 160,
        "url": "https://www.reddit.com/gallery/1dllgq9",
        "content": "",
        "num_comments": 442,
        "comments": [
            "![gif](giphy|F1ruOnxSfqFWM)",
            "Are you running from the first vagina your ever saw.",
            "u look like u laugh like \"a-hyeul a-hyeul a-hyeul\"",
            "In high school you were voted most likely to die from a yeast infection.",
            "![gif](giphy|8YvRqxWUu6Iz3mvEah)",
            "Your Mom was the only person who signed your yearbook… and she did it reluctantly.",
            "![gif](giphy|kAq6HQVQmK5WM)\n\nPractice your banjo.",
            "Graduated hs, but didn’t graduate in genetics",
            "Born with no bottom teeth, bites into pizza by slapping his head on table like a bird.",
            "you look like cast member of a sitcom called the orifice"
        ]
    },
    "Pls be assholes": {
        "title": "Pls be assholes",
        "score": 54,
        "url": "https://i.redd.it/1r68r1xu718d1.jpeg",
        "content": "",
        "num_comments": 197,
        "comments": [
            "You look like you cry after sex",
            "Where the fuck are your ears",
            "You have the 4th most lifelike face in this picture",
            "Using clay models to recreate the father that left after he seen your ugly ass ?",
            "You have a collection of head? That’s the closest you’ll ever get to getting head.",
            "Roasting yourself with those corded earphones.... My 60 yr old mom has Bluetooth earphones now",
            "This guy asks nicely for assholes",
            "You look like someone who was cast for \"the bachelor, Arkansas\" but then cut at the last minute when they realized you were only interested in other men.",
            "Bernard from The Santa Clause",
            "The heads in the background have more personality than you."
        ]
    },
    "On shroomies. Tear it down folks. ": {
        "title": "On shroomies. Tear it down folks. ",
        "score": 8,
        "url": "https://i.redd.it/5eh2nuwat28d1.jpeg",
        "content": "",
        "num_comments": 70,
        "comments": [
            "You look like you’re wearing my grandma’s old couch upholstery",
            "Damn, I remember this chick from high school. Got pregnant twice in 4 years before 18.",
            "Cobwebs all under that dress.",
            "You look like your job is chasing after a scarecrow, a tin man, a lion, and a young girl named Dorothy.",
            "Those shrooms are the least fungal thing happening here.",
            "I get the feeling you have a 1970’s era hairy bush of nasty proportions.",
            "I just know it reeks like patchouli and dirty pennies…",
            "When your dealer finds out you stole his mascara, crack and mushrooms....\n\nHe's gonna be *pissed*... 🫤",
            "You look like a discount Leah Remini got hit with the contents of a homeless person's cart.",
            "Oh look, it's the ghost that haunts the attic still pining for a man's touch."
        ]
    },
    "Let me have it!": {
        "title": "Let me have it!",
        "score": 22,
        "url": "https://i.redd.it/x10zozi2k08d1.jpeg",
        "content": "",
        "num_comments": 78,
        "comments": [
            "The *only* time I didn't need to look at the ring finger to know if OP was unmarried 🤷‍♂️",
            "You look like the guy who gives girls piano lessons just so you can look down their shirts",
            "You look like you sell beer to minors out of the trunk of your 1996 Mustang GT",
            "![gif](giphy|Mhwkr651ANpjJY3xNt|downsized)",
            "You look your trying to be the cool youth pastor.",
            "Living proof that even being a dribbling moron can’t stop you from fulfilling your dreams of owning your very own genuine 2 karat gold plated chain.",
            "If you wanted to have an inspirational quote (or whatever that novel is on your forearm) you could just have it on your phone and not tattoo the whole damn page onto your arm.",
            "[deleted]",
            "You look like if Michael Buble still lived at home with his parents.",
            "Gold chain over the t-shirt. What a fucking Giga-Chad."
        ]
    }
}