{
    "/r/Roblox Weekly Question Thread (for 06/24/2024)": {
        "title": "/r/Roblox Weekly Question Thread (for 06/24/2024)",
        "score": 14,
        "url": "https://www.reddit.com/r/roblox/comments/1dnr2a1/rroblox_weekly_question_thread_for_06242024/",
        "content": "Welcome to /r/Roblox! We're glad you're here to chat about Roblox games and experiences, and we hope you have a good time.\n\nWe, the mods at /r/Roblox request that all help questions be posted here. This is because we get a lot of users who are seeking help, and after the shut down of the Roblox forums, this may be the best place to ask questions.\n\nHowever, we would like to remind you that /r/Roblox is an unofficial fan subreddit, that is maintained by volunteer mods who do not work for Roblox Corp.  We cannot assist with account issues, and anyone who says they can is likely a scammer.\n\n[We strongly advise checking our FAQ,](https://www.reddit.com/r/roblox/wiki/faq) as it lists a bunch of commonly asked questions such as:\n\n* What to do if you think your account is hacked\n* What to do if some Robux appears/disappears from your account\n* How to tell if something is a scam\n* For parents: how to enable Parental controls and other tools available to you\n\nIf you have a solution to a common question that you think should be added to the FAQ, please message the mods.\n\nIf your question hasn't been answered by the FAQ, please post below. **While you're waiting for a reply, please check out other questions by other users and see if you are able to answer their questions. Thank you!**",
        "num_comments": 200,
        "comments": [
            "Does anyone know how to contact Roy & Charcle?",
            "Any time I upload a shirt or pants asset it just seemingly isn't uploaded at all. But of course, the robux is still taken from my account and essentially eats it. So I'm down 20 robux, and the shirt and pants aren't uploaded at all.",
            "Why does my roblox website keep glitching and showing only just 1 column of everything, friends, games etc. it's getting really annoying.",
            "Hi! For the past few months, I've been trying to open my roblox here in my laptop. It's an acer one. However, the problem is why can't my roblox client open and whenever it does, it immediately says \"Please check your internet connection\", even though I have stable internet connection. Other than that, the gui itself is unclickable!! Behind this gui is the game playing, yet I can control the menu with keyboard buttons like the esc button, L for leave and etc. But if you try to leave the game by pressing enter, IT DOESN'T WORK. IT'S STUCK, BASICALLY.\n\nWHAT DO I DO????? HELP.",
            "My roblox keeps crashing on a really good computer and i dont know whats the problem. It keeps saying \"an unexpected error has occured and roblox needs to quit\"  \nive tried clearing cache, reinstalling, disabling antivirus, running as administrator.  \nIm out of options please help.",
            "im trying to find some roleplays games about being a product in a shop (specifically a plushie) what games are there that do that?",
            "I can't scroll to right\n\nwhen a game has a feature that makes it so you can scroll to the right without a scroll bar normaly i could use my mouse to drag it the right but that does not work anymore does anyone know how to fix this",
            "um, I cant see my published games on my group page",
            "I have a strange visual glitch that happens on both my laptop and mobile device. How would I fix it? It kinda looks like static when you turn on an old TV. I would attach a picture to my comment but I don't see the button to attach it",
            "I have a question about DevEx and the new 'Ads Manager' beta that they've rolled in.\n\n I've read the article but I can't seem to figure out how to sponsor clothes and my groups anymore, and I can't find how to get to the \"Robux to Ad Credit\" section that it first showed me when I opened the Ads Manager for the first time. They only have the Ads Campaign, but that's for advertising an actual game...which includes me to provide my credit card information even though I don't plan to use my card. Is this just beta stuff that will eventually release the solution to my problem or am I just really blind and can't see the buttons that take me to where I want to go :-P"
        ]
    },
    "Hey /r/Roblox! Want to share a cool game you made or found? Getting bored with the front page, or need something new to play? Post your suggestions here! (week of June 22, 2024)": {
        "title": "Hey /r/Roblox! Want to share a cool game you made or found? Getting bored with the front page, or need something new to play? Post your suggestions here! (week of June 22, 2024)",
        "score": 17,
        "url": "https://www.reddit.com/r/roblox/comments/1dm06ya/hey_rroblox_want_to_share_a_cool_game_you_made_or/",
        "content": "Hey /r/Roblox!\n\nWe're starting this weekly post to ask you all what you're playing this week! Did you find any new interesting games? Did you go back to an old favorite? Still grinding the same game for the past month? Let us know in a comment below.\n\nWhile this is not required, it's good etiquette to:\n\n* Post links to the games where possible\n* Post in depth about why you're enjoying a certain game\n* **Not post about your own games if you have already done so recently**\n\n[If you're looking for new games to play, why not check out our Wiki page on suggested games?](https://www.reddit.com/r/roblox/wiki/places)",
        "num_comments": 56,
        "comments": [
            "Yesterday I played \"The Exit 8\". Basically it's the roblox version of the videogame with the same name. It's very interesting, you may lose your patience at some point haha but it's really cool and well adapted. You can play with your friends tho",
            "# I made a game based off pls donate, but a classic themed one. What're your thoughts abt it?",
            "block n' props is a really fun game",
            "Alien Smash, it's unique, fun, and not only has great fan service for Ben10 fans but other communities too. It has a free Saiyan alien, 130 unlockable aliens, freezer, All tomorrow's, transformers, ect...",
            "im not sure if this is something i should post here but ive been looking for this game for a while, its based off of the forest and i used to play it so much. now that im looking for it i cant seem to find anything like it anywhere  does anyone else know what im talking about",
            "Roaring skies, best twisted lookalike with sel (the creator) visiting everyday",
            "I highly recommend a game called \"Bleach Oasis\". It is set in the Bleach Anime and there is a lot of future for it. It comes out on 06/25/2024, its community has 4k+ Members and its projects are usually quite good.",
            "So I dont know what category I need to use for changing my country on Roblox",
            "How do I stop the camera from automatically following my movements on mobile?",
            "I NEED HELP ITS URGENT!!! MONEY INVOLVED!! I bought a roblox gift card and when i redeemed it it turned into roblox credit, ive went on multiple device and there is no button for me to redeem the robux onto my account, please help"
        ]
    },
    "there are two types of cat boys": {
        "title": "there are two types of cat boys",
        "score": 203,
        "url": "https://i.redd.it/lrllcuyjqh9d1.png",
        "content": "",
        "num_comments": 13,
        "comments": [
            "the world is going to end, jon.",
            "\"Jon, I need my lasagna...\"",
            "Give my boy Garfield his lasagna back, he don nothin wrong",
            "John give me back my balls",
            "bro was in a date with Garfield",
            "\"I've seen the horrors of the Vietnam war\"",
            "John you you did this.. I know that you hid the lasagne you know what I have to do now",
            "We have the edgy teenagers and that one kid which we respect ",
            "Dam the human cat boy tail is clapping though the ground",
            "Why did i read the jon comments like *saying the rest of the comments normally* then saying jon in the most unhinged way possible"
        ]
    },
    "Who is disliking this masterpiece???": {
        "title": "Who is disliking this masterpiece???",
        "score": 548,
        "url": "https://i.redd.it/l527gv8yfd9d1.jpeg",
        "content": "",
        "num_comments": 74,
        "comments": [
            "Literally just played it what a coincidence. I say its kinda useless, there is only one decision you can make in the entire game with both options ending up in a tree. There is no ultra rare good ending and the idea of feeding the player limited information is pointless. If you want to experience an absolute noted reality I suggest you trying out my eyes deceive  which is banned on roblox. Its free on steam. and its based on a real story.",
            "reddit when people have opinions",
            "I did it. Tbh I don't like this game, it's getting boring after few letters.",
            "Is this a roblox version of the game presentable liberty?",
            "Masterpiece? Isn't it heavily inspired by another game? If anything, the original is the masterpiece. It's not even that, if anything, it's just the story that is good replicated inside of roblox. The game itself is pretty bland. I could literally make this game very easily in roblox studio.",
            "me, i did it, it was me",
            "The description sounds boring and gameplay is kinda bland, not my style.\n\nIts too linear and can bug easily at the end, you cant purchase anything and so the purchase prompt at the end, whatever it **was** cannot be bought.",
            "Bro all you do is pick mail and read...if thats called masterpiece then no wonder sols rng blow up",
            "I played it, it was sad. Yes, and I still think about it. But it's just not for some people",
            "Never played it, is it any good?"
        ]
    },
    "Roblox the hell?": {
        "title": "Roblox the hell?",
        "score": 18,
        "url": "https://i.redd.it/y98hsr8mei9d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "i see more  \"offensive items\"... anything to hide?",
            "show the whole ban lol",
            "Can you be bothered to take a screenshot of the other half?",
            "You wrote 'god' instead of 'God'!!!\n\nI'm just joking. Yep... Roblox is getting weird...",
            "Being christian aint allowed I'm cooked",
            "not everyone believes in god, bud",
            "Doesnt mean he should get banned for it, bud",
            "Scroll down..",
            "show the full",
            "We see that."
        ]
    }
}