{
    "/r/Roblox Weekly Question Thread (for 06/17/2024)": {
        "title": "/r/Roblox Weekly Question Thread (for 06/17/2024)",
        "score": 7,
        "url": "https://www.reddit.com/r/roblox/comments/1dibn4b/rroblox_weekly_question_thread_for_06172024/",
        "content": "Welcome to /r/Roblox! We're glad you're here to chat about Roblox games and experiences, and we hope you have a good time.\n\nWe, the mods at /r/Roblox request that all help questions be posted here. This is because we get a lot of users who are seeking help, and after the shut down of the Roblox forums, this may be the best place to ask questions.\n\nHowever, we would like to remind you that /r/Roblox is an unofficial fan subreddit, that is maintained by volunteer mods who do not work for Roblox Corp.  We cannot assist with account issues, and anyone who says they can is likely a scammer.\n\n[We strongly advise checking our FAQ,](https://www.reddit.com/r/roblox/wiki/faq) as it lists a bunch of commonly asked questions such as:\n\n* What to do if you think your account is hacked\n* What to do if some Robux appears/disappears from your account\n* How to tell if something is a scam\n* For parents: how to enable Parental controls and other tools available to you\n\nIf you have a solution to a common question that you think should be added to the FAQ, please message the mods.\n\nIf your question hasn't been answered by the FAQ, please post below. **While you're waiting for a reply, please check out other questions by other users and see if you are able to answer their questions. Thank you!**",
        "num_comments": 151,
        "comments": [
            "Error 268 Problem, Looks like I'm not the only one that's Struggling with this error since Many other Players have had this keep reoccurring for days, weeks, Months even Years.\nBecause of this Bug, Many Roblox players (Myself included) can't enjoy playing Roblox before the application thinks there's something wrong and makes us unable to play despite having Good Wifi Connection and Downloaded Roblox from the website or the App (Depends on your Device) and I Myself have encountered this bug last Week or so and has kept reoccurring\n\nPlease Fix this and Thank you.",
            "Ok so there is this game I remember playing years ago, it was a rp game, and I don’t remember much but I remember some about it. I remember it had jobs, and to get the job you had to go in a blue circle, I know one of the jobs was criminal, if someone could remind me what the game is that would be great",
            "I play Roblox on Xbox but I haven't played in a while. When I came back to it today I saw that the settings category in the menu has completely changed. It now has options like \"automatic chat translation\" and \"chat translation language\" and other chat related options. This confused me because I thought there was no chat on console, and I still can't see any option in-game to open or view the chat. Basically my question is how do you use the chat?",
            "help i cant put screenshots in here but my friend has a weird box around his chat box and something in the box, its like a square but idk what it is and i don't want him too quit because of it",
            "How does one look for things in the catalogue that aren't Rthro (beyond the 2D old-style classics shirts 'n pants)? Came back from my 2013-2015 days and noticed no games support Rthro and I already wasted like $5 it seems. Which sucks because I made something i thought looked pretty neat.",
            "Can somebody answer this for me. So I say in chat for a game “cry about it” (quite literally everybody says that to me) and I get smashed by the ban hammer for 3 days. But when people literally cuss at me in vc and I report them they don’t get banned. Roblox needs to step up",
            "I have a bug in Roblox (Mobile) where when I press the menu button (Top left button next to the 'chat'), the buttons don't show up (Leave, Reset character, Volume settings, Graphic settings, the whole shebang) and only shows a gray transparent overlay instead. Though the bug doesn't show up in all my playthroughs, it's still very annoying and can ruin my overall experience, because I can't turn off my performance stats or change my general settings.\n\nIt would be very helpful if I do resolve this problem because the thought of experience this forever on all my playthroughs is somewhat spine chilling. Thanks in advance!\n\n(PS, I've found something out while making this post. I checked Roblox again to be sure, and the bug is actually consistent every time I play a game. What it does is during the first time I open the menu, it works fine. Though after the first, it just doesn't show up and registers blank)",
            "How do you remove the quick menu is ROBLOX/!?",
            "I'm getting kinda worried about this/getting impatient. I bought Robux that's worth 590Php using my two accounts. When I checked my Mobile Phone Number balance I didn't got charge for it, I checked my Apple purchases services and it's in there said pending. will my two account will get banned for it? should I wait for them to just charge me? I already contacted roblox support too.",
            "I’m trying to find this anime fighting themed game I played years ago, it had many different abilities coming from different anime’s you would also spawn at a dojo with a small tree and training dummies where you could train strength and mind there was also an orange circle in the dojo that would teleport you to a boss fight, at the time I was playing this boss was 9 tails, please help me find this game"
        ]
    },
    "Hey /r/Roblox! Want to share a cool game you made or found? Getting bored with the front page, or need something new to play? Post your suggestions here! (week of June 15, 2024)": {
        "title": "Hey /r/Roblox! Want to share a cool game you made or found? Getting bored with the front page, or need something new to play? Post your suggestions here! (week of June 15, 2024)",
        "score": 18,
        "url": "https://www.reddit.com/r/roblox/comments/1dgmeye/hey_rroblox_want_to_share_a_cool_game_you_made_or/",
        "content": "Hey /r/Roblox!\n\nWe're starting this weekly post to ask you all what you're playing this week! Did you find any new interesting games? Did you go back to an old favorite? Still grinding the same game for the past month? Let us know in a comment below.\n\nWhile this is not required, it's good etiquette to:\n\n* Post links to the games where possible\n* Post in depth about why you're enjoying a certain game\n* **Not post about your own games if you have already done so recently**\n\n[If you're looking for new games to play, why not check out our Wiki page on suggested games?](https://www.reddit.com/r/roblox/wiki/places)",
        "num_comments": 61,
        "comments": [
            "As a general reminder, if you are looking for new games to play or want to show underrated games, consider looking at and contributing to the subreddit list here: https://www.reddit.com/r/roblox/wiki/places\n\nAdditionally, we have a weekly post for users to share or ask for games. You can find some of these posts [here!](https://www.reddit.com/user/BloxBot/submitted/)\n\nAs this is a frequent question on the subreddit, it benefits everyone if there is a centralized spot to make it easier to look for games to play!\n\nThis is an automated comment. Your post has not been removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/roblox) if you have any questions or concerns.*",
            "I love this game ever since I saw it on \"Today's Picks\".\n\nYou're fighting in the Napoleonic war era against zombies and you have to either escape via boat, securing the place, or building a bridge. Heavily teamwork based and you need coordination. It's a very fun game compared to those trash \"hot page\" games.\n\n[https://www.roblox.com/games/12334109280/Guts-Blackpowder](https://www.roblox.com/games/12334109280/Guts-Blackpowder)",
            "Just played a game called \"Oobja\"\n\nVery short, very sweet. \n\nOne of my favorite short games I've found so far.",
            "its very nice if ur looking for a turn-based army game, it gives you units ranging from ww2 to the cold war and the more you play the better units you have and the more campaigns you can play. ranging from some riflemen to a battle tank and having to fight the guests and stopping aliens from taking over. [https://www.roblox.com/games/5734383673/Noobs-in-Combat-V5-4?gameSetTypeId=100000003&homePageSessionInfo=20ab9ef1-f385-4cee-9d57-a6b3a1199fbe&isAd=false&numberOfLoadedTiles=6&page=homePage&placeId=5734383673&playContext=homePage&position=1&sortPos=2&universeId=2033000034](https://www.roblox.com/games/5734383673/Noobs-in-Combat-V5-4?gameSetTypeId=100000003&homePageSessionInfo=20ab9ef1-f385-4cee-9d57-a6b3a1199fbe&isAd=false&numberOfLoadedTiles=6&page=homePage&placeId=5734383673&playContext=homePage&position=1&sortPos=2&universeId=2033000034)\n\n[https://www.roblox.com/games/7196462540/NiC-PublicTS?isAd=false&nativeAdData=&numberOfLoadedTiles=6&page=gameDetailPage&placeId=7196462540&position=0&universeId=2797758700](https://www.roblox.com/games/7196462540/NiC-PublicTS?isAd=false&nativeAdData=&numberOfLoadedTiles=6&page=gameDetailPage&placeId=7196462540&position=0&universeId=2797758700)",
            "Obscure Place Finder is a search engine(?) and fantastic alternative to spending hours in \"place roulette\" type games, as it allows parameters like live player count, visits, and genre. \n\n[https://www.roblox.com/games/12364716773/obscure-game-finder](https://www.roblox.com/games/12364716773/obscure-game-finder)",
            "I would recommend untitled tag game, it's a strategy game that I play when I'm bored its very fun! It's hard on mobile but if you have a laptop, pc etc. It's fun!",
            "Does anyone know any good games where u can rule like the anceint egypt game or a game where u can be king/queen",
            "Does anyone have a list of the history of the longest roblox shutdowns?",
            "[https://www.roblox.com/games/1219604951/D](https://www.roblox.com/games/1219604951/D) cause it is fun sometimes",
            "Fucking love Titanic SOS. It's an amazing game in my opinion. [https://www.roblox.com/games/8819753772/Titanic-SOS](https://www.roblox.com/games/8819753772/Titanic-SOS)"
        ]
    },
    "I apologize deeply": {
        "title": "I apologize deeply",
        "score": 389,
        "url": "https://www.reddit.com/gallery/1dls11q",
        "content": "",
        "num_comments": 60,
        "comments": [
            "\"BLACKMAIL???\"",
            "My friend got banned for saying “water”, I’m not playing Roblox until they can fix moderation",
            "That's quite interesting, I bypassed the chat filter for 4 days and didn't get banned.",
            "you obviously had sth else in that ban",
            "I hope you understand the harm your words can bring. \nAs a victim and survivor of \":3\" I have sleepless nights. \nI can no longer trust anyone because of it.\nI hope you learn your lesson",
            "r/ROBLOXBans",
            "Why did you randomly post the message in two different parts?",
            "Show the full warning lil bro",
            "I'm sorry, but this looks suspiciously fake",
            "ray william johnson getting banned for typing \"=3\""
        ]
    },
    "literally who are the people who disliked this game": {
        "title": "literally who are the people who disliked this game",
        "score": 762,
        "url": "https://i.redd.it/101jkba4c08d1.png",
        "content": "",
        "num_comments": 184,
        "comments": [
            "We can't all agree on one thing, isn't that what makes us human?",
            "To be devil's advocate, the game is really basic, only having like 10 minutes for gameplay. So I could see why people wouldn't like it based on that.\n\nDon't take me wrong, the game is really sweet and I myself also like it, it tells it's message really nicely and doesn't overstay it's welcome. Just pointing out why *some* people don't like it.",
            "I like it\n\nBut for others they were it as just walking for 10 minutes \n\n(They probably didn't look up to the text box)",
            "I’d assume it’s people who the message either doesn’t resonate with them, therefore being a waste of time, or children who can’t go 2 minutes without a subway surfers background. I’ve heard it talked of as a “walking simulator” which, no not really. You’re supposed to read while you walk because reading is the means to get the point across. I can’t see any other reason though.",
            "Not much really happens, it’s just text and walking. It’s very linear and there’s a lack of options on every question.",
            "tiktok kids with 0.5 seconds attention span",
            "Anybody else never hear of this game before?",
            "Game just made me sad",
            "idk how anyone could dislike a simple game with a good message ;sob:",
            "I didn't care enough to dislike it, but I didn't particularly enjoy the game. \n\nI've heard the same \"Yup, it gets better\" routine so many times that it falls on deaf ears at this point. Especially when it's from some Roblox dev I know doesn't give a damn about me. \"I love you\". Yeah, right.\n\nGood message to those who need it, but to me it was just the same shit I've heard a thousand times already, from people who care just as much as some little digital ball that can't feel emotions."
        ]
    },
    "I’m starting to regret this…": {
        "title": "I’m starting to regret this…",
        "score": 65,
        "url": "https://www.reddit.com/gallery/1dlspbe",
        "content": "this is how much robux I’ve spent in the last few years…\n I 1000% could’ve got a computer by now",
        "num_comments": 35,
        "comments": [
            "Goddamn bro😭😭 you’re RICH rich\n\nyall you can get free robux from microsoft bing (it takes a little time but still)",
            "Total amount?",
            "nah thats over 100k robux you couldve gotten some rare limiteds",
            "Why do you even have this amount of giftcards?",
            "hey if you ain't gonna redeem those DM me the codes ✋😀🤚",
            "I want some :(",
            "Damn bro, this is me but with League Of Legends and Fortnite cards. I regret spending so much money on skins. I should've bought games instead as games are an entirely new experience and skins are just recolored pixels of an already existing animation. If you're feeling regret like I do, the only thing you can do now is to stop spending money on Roblox and start spending it on other things. Only if you want to, of course. I'm not the one to be telling you what you can and cannot do with your own money. I'm just sharing my experiences to you.",
            "What. The. Actual. Fuck.",
            "Bro has more free items than my whole inventory d@m",
            "Bro you could buy a car with this money"
        ]
    }
}