{
    "Patch Notes v2.41 Release Thread": {
        "title": "Patch Notes v2.41 Release Thread",
        "score": 53,
        "url": "https://www.reddit.com/r/RocketLeague/comments/1dojw2n/patch_notes_v241_release_thread/",
        "content": "https://preview.redd.it/u7o7ffw7rs8d1.jpg?width=1920&format=pjpg&auto=webp&s=4d7337531ca8fff273778cda2e4482cbe045bece\n\n**Blog Link:** [**https://www.rocketleague.com/en/news/patch-notes-v2-41**](https://www.rocketleague.com/en/news/patch-notes-v2-41)\n\n**Version**: Rocket League v2.41\n\n**Platforms**: Epic Games Store, PlayStation 4, PlayStation 5, Steam, Switch, Xbox One, Xbox Series X|S\n\n**Scheduled Release**: 6/25/2024, 4 p.m. PDT / 11 p.m. UTC\n\n# BUG FIXES\n\n* Fixed multiple bugs blocking Dropshot, Hoops, Rumble, and Snow Day Tournament scheduling\n* Fixed a bug blocking Hoops Custom Tournament creation\n* Added a minimum size for Nameplates to ensure visibility\n* Fixed aliasing issues on Salty Shores (Salty Fest)\n* Fixed Salty Shores (Salty Fest) not appearing in Competitive Playlists\n* Fixed a bug preventing the correct visual effects from appearing on multiple Wheels\n* Armorer and Boba Fett Decals correctly appear in player inventories\n* Fixed a visual bug with the Psypher Trail\n* Fixed a visual bug with the Front Row Rocket Boost\n* Fixed an unlock issue with the Nissan Fairlady Z Wheels\n* Fixed multiple bugs tied to the Item Shop UI\n\n# KNOWN ISSUES\n\n**For a complete list of known issues in Rocket League,** [**go here**](https://www.rocketleague.com/news/known-issues-in-rocket-league/)**.**\n\n==========\n\n# Release Thread - How To Help\n\nOur latest update (v2.41) is now live. This thread is an effort to get all reports for any new bugs into one place.\n\n* ***If you don't see the update available to download yet, please restart EGS, Steam, or your console. It may take several minutes to appear.***\n* Please read through the comments before posting your own issue so we can cut down on duplicate posts\n* Reply to a thread confirming your issue if you already see it posted\n\n**Posting about a bug? Please use this format:**\n\n* Bug: A brief explanation of the problem.\n* Platform: EGS/Steam/PS4/PS4 Pro/PS5/Xbox One/Xbox One X/Series S/Series X/Nintendo Switch\n* Evidence: Video/Images -- YouTube, Imgur and Gfycat preferred. (If using YouTube, please make the video UNLISTED.)\n* Logs: If playing on PC, grab logs and drop them on Pastebin, and put the link here\n   * **Logs on PC are typically located at C:\\\\\\\\Users<USERNAME>\\\\Documents\\\\My Games\\\\Rocket League\\\\TAGame\\\\Logs**\n\n***Thanks everyone! We hope you enjoy the update!***",
        "num_comments": 109,
        "comments": [
            "Restarted my game, and I just got a tournie winner banner",
            "I’m confused why they kept the tournament running. In the past haven’t they cancelled tournaments if it aligned with an update time?",
            "does this fix the black loading screen in tournaments/ranked?",
            "I got a theory: you guys knew that the new map had an issue but you couldn't fix it before the start of the season so you left it out of the competitive rotation",
            "thanks for kicking us out of tournaments 🙌🏽🙌🏽",
            "Sorry but am I the only still NOT hearing the \"ping\" sound that should have been added on teammates demos a patch or two ago?",
            "when is the season 14's ranked distribution going to be posted?",
            "What about the fact that every other game won't load ? Black screen for 30secs and then error code in the main menu.",
            "Players on Xbox: Update is coming, just a few min behind other platforms.",
            "Nameplates still don't look right. Lowercase letters in names clip into the nameplates."
        ]
    },
    "Introducing our Trial Chat Channels for r/RocketLeague": {
        "title": "Introducing our Trial Chat Channels for r/RocketLeague",
        "score": 5,
        "url": "https://www.reddit.com/r/RocketLeague/comments/1dqpeut/introducing_our_trial_chat_channels_for/",
        "content": "Hey r/RocketLeague! We're excited to announce that we are opening the subreddit's first **chat channels** this Friday. These chatrooms will allow our members to interact with each other in a more fluid manner than with a regular comments thread. You can find them in the \"Chats\" tab on mobile, or through the Chats icon in the top-right corner on PC. To help you out for now, I'll link them at the end of this post!\n\n\n\nAs an experimental feature on the subreddit, we will only open two channels for a trial period of two weeks: a **general channel** suitable for all RLated discussions and questions, and an **LFG channel** to help you find the perfect teammate. Our chats are limited in scope and for more options we recommend the official Discord server. Still, we wanted to give the RL reddit community an easy way to communicate together.\n\n\n\nPlease note that all of our Subreddit Guidelines apply in the chat channels as well. Violating any of our guidelines will result in an immediate ban from the chat channels, and may result in punishment subreddit wide.\n\n\n\nWe're eager to chat with so many of you, so don't hesitate and come take a look at them! 🐳 \n\n# [Join the rocket-league chat](https://www.reddit.com/r/RocketLeague/s/sTL7QtCSiv)\n\n# [Join the looking-for-group chat](https://www.reddit.com/r/RocketLeague/s/CM02VqEXxY)",
        "num_comments": 13,
        "comments": [
            "still not using new reddit I will not fall for your tricks",
            "You can access it on old Reddit too. That is what I do!",
            "I'm on redreader... Not happening.\n\nIf reddit wants to have more features, maybe make the app and website not be an absolute fucking dumpster fire first.",
            "The mod team here does not work for Psyonix/Epic Games. We can't do anything like that.",
            "ah weird, both links bring me to a page not found \n\nprobably my old reddit redirect extension then",
            "Yeah that may be possible! In the top right there should still be a button to open the chat window even in old reddit!",
            "ooooh right you are\n\nthanks for that!",
            "Come say hi!",
            "We won't bite!",
            "fix your servers before you implement such irrelevant shit, ty."
        ]
    },
    "Calm down boys, its not a serious rank": {
        "title": "Calm down boys, its not a serious rank",
        "score": 112,
        "url": "https://i.redd.it/gzmwl3gxcg9d1.jpeg",
        "content": "",
        "num_comments": 61,
        "comments": [
            "I’m trash II and I play daily •~•",
            "I just hit diamond1 in my third ever season. I'm 42 and mow my own grass",
            "Average is average no matter the hours.",
            "You are, in fact, exactly the same",
            "You’re having a mid off.",
            "the only serious rank is shabba",
            "I'm D1 whether I play 4 hrs/day or 4hrs/week.",
            "Same OP,  except i only play one match a week.",
            "That is not a brag.",
            "Guys 🤣I'm flat1 and I play once or twice by myself not"
        ]
    },
    "How does rocket league determine what is a save?": {
        "title": "How does rocket league determine what is a save?",
        "score": 279,
        "url": "https://v.redd.it/stp42s50ce9d1",
        "content": "This seems to happen fairly often. Just managed to clip it this time. Not complaining because it’s such a minor thing, but genuinely curious as to why this wasn’t a save.",
        "num_comments": 60,
        "comments": [
            "It’s a strange one. It looks like you pinched the ball with opponent so maybe the game saw your touch wasn’t enough to save it and the opponent pushed it outward off your car at the same time. It looks like you should have got a save though.",
            "Then you clear a ball that's clearly hitting the side wall and you get a save for it",
            "Looks like it might have crossbred out if you didn't get it as well",
            "Opponent hit the ball at the same time as u so it canceled. \n\nFor a save to happen, the attacker must first have a shot and a player from the defending team must hit the ball away from the net without the help of an attacker.",
            "better question is why is your car gold if you're on the blue team 🤨",
            "The definition of a shot, in hockey, is if the attacking team would score if the goalie didn’t block it. \n\nIn rocket league, who fuckin’ knows.",
            "I realised this in hoops, the game detects that the ball could hit the goal area and it doesnt count the goalpost in it. If you change the trajectory from that, you get a save :)",
            "Velocity and trajectory of the shot and the redirect",
            "I cannot begin to tell you how many saves I've gotten in hoops that didn't count. Like the ball was literally half way in net and I get it out for it to nor count. Truly insane.",
            "Yeah, there's this glitch where if you save the ball at the same time or just after your opponent hits it, no save is awarded. I think the issue is that the calculation resets and doesn't have to time register the new touch as on target, which therefore doesn't give you credit for deflecting it."
        ]
    },
    "my girlfriend made a car, opinions?": {
        "title": "my girlfriend made a car, opinions?",
        "score": 99,
        "url": "https://i.redd.it/30cd2ycuqe9d1.png",
        "content": "",
        "num_comments": 46,
        "comments": [
            "Is this \"girlfriend\" with us in this room now?",
            "that’s one of the cars of all time",
            "The flag doesn’t match, other than that it’s cute",
            "I used to run x-devil, not that bad of a car. Also, are those the season 13 reward wheels? Looks sick!",
            "Best looking \"Gf made a car\" car I've seen",
            "I like it, but I'm a sucker for purple so I'm a bad source.",
            "looks just like my car haha",
            "I mean, it's the X-devil, it's automatically straight GAS.",
            "I think it looks nice enough, though I'd pick a different car body. :)",
            "not sure if this is your \"girlfriend\" or not"
        ]
    }
}