{
    "Monthly What Are You Playing / Flex Scheduled Post - June 24, 2024": {
        "title": "Monthly What Are You Playing / Flex Scheduled Post - June 24, 2024",
        "score": 7,
        "url": "https://www.reddit.com/r/ROGAlly/comments/1dn4l0p/monthly_what_are_you_playing_flex_scheduled_post/",
        "content": "This is our monthly thread to discuss what games you are playing right now.  Share what you are playing, how it is playing, etc.  \n\n&#x200B;\n\n**Other Megathreads SD Card Megathread**\n\n[SD Card Megathread](https://www.reddit.com/r/ROGAlly/comments/1998h8c/megathread_4_sd_card_other_issues_go_here/)\n\n[Legion Megathread](https://www.reddit.com/r/ROGAlly/comments/17k1hov/megathread_lenovo_legion_go_launch_reviews/)",
        "num_comments": 51,
        "comments": [
            "Right now WoW and Zelda Recompiled.  Both running great.",
            "#FFXIII\nGetting all Cie'th Stones done. The game runs smoothly at a constant 60fps.\n\n#FFXV\nTrying to plat it in a level 1 run. 1080p, high settings with LS get me a constant and smooth 60fps.",
            "Ghost of Tsushima. I am amazed how well it runs on 80fps with tweaks and frame gen on med/high",
            "GHOST OF TSUSHIMA, running great on the ally",
            "On Rog Ally:\nCompleting NFS Most Wanted 2012\nStarted Rage 2\n\nOn Xbox Series S:\nGears of War 2 (waited too damn long and it still isn't out on PC)\n\nPS5:\nMortal Kombat XI (for the story)",
            "ffxiv😌 loving it",
            "Elden ring shadow of the erdtree, getting 2 shotted by random enemies (not even bosses)",
            "GTA 4, Star Wars Battlefront 2",
            "Black ops3 -- 10 watts,\nZelda BOTW ---15 watts,\nSmash bros -- 10 wats,\nBlack ops2 ----7 watts",
            "Albion online"
        ]
    },
    "Apparently playing MW3 still isn't safe.": {
        "title": "Apparently playing MW3 still isn't safe.",
        "score": 90,
        "url": "https://www.reddit.com/r/ROGAlly/comments/1ded0jg/apparently_playing_mw3_still_isnt_safe/",
        "content": "So I've had my Ally since launch, and decided to steer away from touching MW3 because of the shadow ban issue. I've been playing on PC since MW 2019 with zero issues. I played today at my local dealer getting an oil change, I come home back to my PC and my search for a game is taking ages. Fearing the worst I check the support site and I'm hit with this:\n\nhttps://preview.redd.it/ua04s39bj66d1.png?width=1141&format=png&auto=webp&s=5020aedecd10a139002f6128a343564f2af58471\n\nNow, believe me or not, I have never touched a cheat. So I figured I'd come here to warn you guys if you still had your doubts, they are valid.\n\n  \n\\*Update 6/18/24 Just some closure for you guys, a lot of people were saying that's never happened to them, so I figured i'd upload the results of the shadowban: \n\nhttps://preview.redd.it/saftr9o36d7d1.png?width=1094&format=png&auto=webp&s=d73a877f22fc195a7a40a84f5505cbb40e730b54\n\nNeedless to say I won't be touching CoD on the Ally anymore.\n\n",
        "num_comments": 62,
        "comments": [
            "This is the 3rd report of this in the past week. Im going to go ahead and pin this post to advise others as obviously there was a Ricochet update that is tripping over the Ally.\n\nSome tips that we do know is do **NOT** change the power mode including plugging and unplugging the Ally while the game is open, Ricochet is running as long as the game is open so changing the power modes still is not safe doing so in the main menu or pre game lobby. Close the game, make your changed and then start the game back up\n\nTry disabling any software that has a overlay, Some have suspected part of the reason Ricochet is banning is it sees the overlays from AC and thinks it could be a cheat software.\n\nIt can be one or the other or a combination of both on top of other data they use to determine a ban.\n\n*Doing these things does not guarantee a ban as you can see others have made these changes with no bans, Ricochet looks any many things including number or reports, accuracy etc so the changes mentioned above can be the icing on the cake to issue the ban.*\n\n&#x200B;\n\n&#x200B;\n\nAs of right now this is just a Shadow Ban, your account should be good to go in 5-7 days, in the meantime do NOT try logging into another account on the Ally as any other account you log into has a good chance of also getting shadow banned and can even get a permaban issued over it (As it can be contributed of cheaters getting banned and then just loading up a fresh account to continue to cheat)\n\nI was one of the few last year that was issued a permaban over this, luckily after the Legion Go team reached out to Activision to work with them as the Legion was also being banned I was notified I was incorrectly banned and I got my account back it was almost a month later, I say this just to alert users that you can most definitely get your account permanently banned over this and you have ZERO way of contact Activision and the appeal process always seems to deny you instantly.\n\n&#x200B;\n\nEdit: Another thing I will add is after your Shadow Ban lifts, play super casual for the next 5-10 games. Normally when you come out of a ban you can considered yourself on a \"Probation\" your account takes less reports from other players to get banned and Ricochet seems to be more aggressive towards the account. If you are a really good player or toxic in a game you can very easily get banned again.",
            "Billion dollar company by the way. Activision is a joke",
            "If you pull up the quick menu for TDP while in game it will flag as a cheat menu.",
            "Anyone playing cod on their ally should just stop asap. The anti cheat is stupid as all hell and a lot of people have been getting banned. I don’t think it’s worth the risk. That’s the one game I’ll never download on ally.",
            "This is total bullshirt. \n\nCan you imagine a regular person that just wants to sit on the couch and play one of the most popular games in the world on their new computer and getting BANNED for it? \n\nThis is utter incompetence.",
            "Activision are disgusting",
            "\"Working as intended\" file for a refund since the product is no longer functioning as designed and stop buying games that have this level of Anti-cheat built into them. That is the only way for this to change.",
            "What was your power mode? You can’t play COD on 15W or change modes while playing (that’s what triggers the ban). You’re safer on 25W or Turbo.",
            "I use warzone daily and whenever i have to pay for something i have to go to the command center and change it from gamepad to desktop in order to click the correct credit card and purchase anything. I have yet to be banned or shadow banned. Although I have not changed it from gamepad to desktop while playing Warzone/multiplayer, which I have seen other people in this get banned for.",
            "Once I plugged it into charge when playing mwz. I didn’t get shadow ban. But my cpu time changed to 32ms and GPU time 32ms, because it switch to 15w. But as I heard about the shadow banning I didn’t switch back so I experienced 30 fps zombies 😳"
        ]
    },
    "No power bank needed.": {
        "title": "No power bank needed.",
        "score": 116,
        "url": "https://i.redd.it/imxdapa8uc9d1.jpeg",
        "content": "A nice surprise while flying on breeze airlines.",
        "num_comments": 23,
        "comments": [
            "One of the things I was most excited about getting on my flight to Vegas. 😂",
            "Whoah whoah any chance you were on the flight to Greenville from Orlando or vice versa cuz I had the same \"oh shit\" moment while traveling Breeze today lmao.",
            "This garbage I'm on a Southwest Flight right now and there are ZERO charging options.  Nothing.  Not a one.  Feels like its 1912",
            "Nice but sadly you won't get full Turbo mode",
            "MOG POWER!",
            "I have a flight this Sunday via breeze. I actually searched this and saw it on youtube, but you confirmed it as well so just wanted to thank you. Bringing an anker 737 + viture xr glasses + Sony wf-1000xm5's for the complete experience lol",
            "It'll work better than nothing haha",
            "Dont you need 65w ? Or do i miss-remember ?",
            "if you get only USB-A on flight, Check under your seat, There might be a outlet. I realized i didnt see it had a outlet to use during my flight 😭",
            "What game did you play all flight?"
        ]
    },
    "impressed by Roy ally’s ability to drive a 49” ultra wide (FH5)": {
        "title": "impressed by Roy ally’s ability to drive a 49” ultra wide (FH5)",
        "score": 46,
        "url": "https://v.redd.it/24xtum1dld9d1",
        "content": "",
        "num_comments": 14,
        "comments": [
            "Who is Roy?",
            "Damn, Roy Ally must be a beast to be able to drive a 49\" ultra wide!",
            "I love this sub.",
            "What to the who now?",
            "Roy rogers??",
            "Hmm Roy... Roy Cuntz?",
            "Damn , I tried pre-ordering the Roy ALLY…no luck",
            "I’ve been a Metroid kick the last few days, I was playing Metroid dread at 1440p (4k is 50-55 fps, 1440 is locked 60) \n\nThen Metroid prime at 1440p and both were locked 60fps. It’s amazing on my big tv.",
            "That’s not really that impressive what res is the game at because I doubt it’s full res",
            "Asus new handheld competitor, but cooler faster and stronger than the ROG Ally"
        ]
    },
    "Custom resolution ": {
        "title": "Custom resolution ",
        "score": 3,
        "url": "https://www.reddit.com/r/ROGAlly/comments/1dqz55y/custom_resolution/",
        "content": "Hey, I was wondering if you can make custom resolutions on the rog ally since I’m used to playing a lot of games on 4:3\n",
        "num_comments": 3,
        "comments": [
            "[Scaled resolution editor](https://www.monitortests.com/forum/Thread-Scaled-Resolution-Editor-SRE) works for me. Just note that resolutions below 600p or so in height don't work.\n\nAlso adding certain resolutions doesn't work either. Back when the Ally didn't have official 900p support, I tried adding 900p to no avail. However, 1616 x 909 did work.",
            "Yes use third party program and try",
            "Tried that, doesn’t work. I’ll see if I can find more stuff on YouTube"
        ]
    }
}