{
    "Monthly What Are You Playing / Flex Scheduled Post - June 24, 2024": {
        "title": "Monthly What Are You Playing / Flex Scheduled Post - June 24, 2024",
        "score": 7,
        "url": "https://www.reddit.com/r/ROGAlly/comments/1dn4l0p/monthly_what_are_you_playing_flex_scheduled_post/",
        "content": "This is our monthly thread to discuss what games you are playing right now.  Share what you are playing, how it is playing, etc.  \n\n&#x200B;\n\n**Other Megathreads SD Card Megathread**\n\n[SD Card Megathread](https://www.reddit.com/r/ROGAlly/comments/1998h8c/megathread_4_sd_card_other_issues_go_here/)\n\n[Legion Megathread](https://www.reddit.com/r/ROGAlly/comments/17k1hov/megathread_lenovo_legion_go_launch_reviews/)",
        "num_comments": 51,
        "comments": [
            "Right now WoW and Zelda Recompiled.  Both running great.",
            "Ghost of Tsushima. I am amazed how well it runs on 80fps with tweaks and frame gen on med/high",
            "GHOST OF TSUSHIMA, running great on the ally",
            "Elden ring shadow of the erdtree, getting 2 shotted by random enemies (not even bosses)",
            "GTA 4, Star Wars Battlefront 2",
            "Need for speed most wanted 2005 remaster",
            "Far Cry 5, and I bounce around between gamecube games on retroarch.\nI plan on picking up elden ring when it's on sale again.",
            "Castlevania: ReVamped (free/fan-made game) & Helldivers 2",
            "Bioshock with a bit of saints row and dead cells. Love this thing",
            "Starfield, running better than it did on Series X imo"
        ]
    },
    "Apparently playing MW3 still isn't safe.": {
        "title": "Apparently playing MW3 still isn't safe.",
        "score": 87,
        "url": "https://www.reddit.com/r/ROGAlly/comments/1ded0jg/apparently_playing_mw3_still_isnt_safe/",
        "content": "So I've had my Ally since launch, and decided to steer away from touching MW3 because of the shadow ban issue. I've been playing on PC since MW 2019 with zero issues. I played today at my local dealer getting an oil change, I come home back to my PC and my search for a game is taking ages. Fearing the worst I check the support site and I'm hit with this:\n\nhttps://preview.redd.it/ua04s39bj66d1.png?width=1141&format=png&auto=webp&s=5020aedecd10a139002f6128a343564f2af58471\n\nNow, believe me or not, I have never touched a cheat. So I figured I'd come here to warn you guys if you still had your doubts, they are valid.\n\n  \n\\*Update 6/18/24 Just some closure for you guys, a lot of people were saying that's never happened to them, so I figured i'd upload the results of the shadowban: \n\nhttps://preview.redd.it/saftr9o36d7d1.png?width=1094&format=png&auto=webp&s=d73a877f22fc195a7a40a84f5505cbb40e730b54\n\nNeedless to say I won't be touching CoD on the Ally anymore.\n\n",
        "num_comments": 62,
        "comments": [
            "Billion dollar company by the way. Activision is a joke",
            "If you pull up the quick menu for TDP while in game it will flag as a cheat menu.",
            "Anyone playing cod on their ally should just stop asap. The anti cheat is stupid as all hell and a lot of people have been getting banned. I don’t think it’s worth the risk. That’s the one game I’ll never download on ally.",
            "\"Working as intended\" file for a refund since the product is no longer functioning as designed and stop buying games that have this level of Anti-cheat built into them. That is the only way for this to change.",
            "What was your power mode? You can’t play COD on 15W or change modes while playing (that’s what triggers the ban). You’re safer on 25W or Turbo.",
            "I use warzone daily and whenever i have to pay for something i have to go to the command center and change it from gamepad to desktop in order to click the correct credit card and purchase anything. I have yet to be banned or shadow banned. Although I have not changed it from gamepad to desktop while playing Warzone/multiplayer, which I have seen other people in this get banned for.",
            "Once I plugged it into charge when playing mwz. I didn’t get shadow ban. But my cpu time changed to 32ms and GPU time 32ms, because it switch to 15w. But as I heard about the shadow banning I didn’t switch back so I experienced 30 fps zombies 😳",
            "I've been playing mw3 on ally,.odd times for a few hours, not had an issue. I don't pull up the tdp menu, in game tho",
            "Why not just wait until they confirm it safe?",
            "I don’t even understand why any of you would continue playing a copy paste, full of toxic players, game. COD hasn’t been good since the pre-ghost days and BO3. But hey that’s just my opinion as someone who has owned all the CODS. Ain’t nothing going to top COD3-MW2 era."
        ]
    },
    "No power bank needed.": {
        "title": "No power bank needed.",
        "score": 145,
        "url": "https://i.redd.it/imxdapa8uc9d1.jpeg",
        "content": "A nice surprise while flying on breeze airlines.",
        "num_comments": 29,
        "comments": [
            "One of the things I was most excited about getting on my flight to Vegas. 😂",
            "This garbage I'm on a Southwest Flight right now and there are ZERO charging options.  Nothing.  Not a one.  Feels like its 1912",
            "Whoah whoah any chance you were on the flight to Greenville from Orlando or vice versa cuz I had the same \"oh shit\" moment while traveling Breeze today lmao.",
            "Nice but sadly you won't get full Turbo mode",
            "I have a flight this Sunday via breeze. I actually searched this and saw it on youtube, but you confirmed it as well so just wanted to thank you. Bringing an anker 737 + viture xr glasses + Sony wf-1000xm5's for the complete experience lol",
            "It'll work better than nothing haha",
            "Dont you need 65w ? Or do i miss-remember ?",
            "if you get only USB-A on flight, Check under your seat, There might be a outlet. I realized i didnt see it had a outlet to use during my flight 😭",
            "What game did you play all flight?",
            "Had something like this on a bus from Prague to Berlin (RegioJet). So nice!"
        ]
    },
    "Game recommendation: Killer is dead for 2 euro bucks": {
        "title": "Game recommendation: Killer is dead for 2 euro bucks",
        "score": 4,
        "url": "https://www.reddit.com/r/ROGAlly/comments/1dradep/game_recommendation_killer_is_dead_for_2_euro/",
        "content": "Killer is dead is a fantastic action game. It has a mechanic where if you get stronger and faster if you don’t get hit. Has a “perfect dodge” technique ala Bayonetta.\n\nBut the best thing is the style and vibe of the game, the OST, the boss fights. It looks amazing. Cutscenes are awesome\n\nIt is locked to 30fps, quick config file tinkering sets the framerate to 60.\n\nOn the ally, it runs at 720p @10w in 45-60 range. Plays amazingly.\n\nIt costs 2 euros on the steam sale.",
        "num_comments": 0,
        "comments": []
    },
    "impressed by Roy ally’s ability to drive a 49” ultra wide (FH5)": {
        "title": "impressed by Roy ally’s ability to drive a 49” ultra wide (FH5)",
        "score": 63,
        "url": "https://v.redd.it/24xtum1dld9d1",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Damn, Roy Ally must be a beast to be able to drive a 49\" ultra wide!",
            "What to the who now?",
            "I’ve been a Metroid kick the last few days, I was playing Metroid dread at 1440p (4k is 50-55 fps, 1440 is locked 60) \n\nThen Metroid prime at 1440p and both were locked 60fps. It’s amazing on my big tv.",
            "Damn , I tried pre-ordering the Roy ALLY…no luck",
            "Sat in the sun playing my new Roy Ally wearing my cool new Roy Bans",
            "sorry for the confusion over my ally Roy. hf\\~ 😂",
            "Gonna be real hard driving with that camera angle.",
            "Yoooo I was just playing on it yesturday I have the same monitor ain’t it dope",
            "That’s not really that impressive what res is the game at because I doubt it’s full res",
            "Asus new handheld competitor, but cooler faster and stronger than the ROG Ally"
        ]
    }
}