{
    "Ask Any Questions Here - No Stupid Questions": {
        "title": "Ask Any Questions Here - No Stupid Questions",
        "score": 76,
        "url": "https://www.reddit.com/r/RPClipsGTA/comments/1c55onm/ask_any_questions_here_no_stupid_questions/",
        "content": "Ask any questions regarding GTA RP here whether that be finding a clip, asking info about a certain streamer or even asking questions about the subreddit itself. As long as you guys and girls keep it civil, we feel this can be a help to all new viewers on twitch as well as here in the subreddit. Also, whether you're new or not, feel free to check in here often as there may be something that you know which someone else has no clue about. So please ask away any questions you might have, thanks :)\n\nPlease note that if you post a thread asking a question, it will be removed and you will be redirected to this thread.\n\nPrevious question thread here: https://www.reddit.com/r/RPClipsGTA/comments/176kzog/ask_any_questions_here_no_stupid_questions/",
        "num_comments": 103,
        "comments": [
            "[removed]",
            "Why is noPixel named noPixel? What does it mean? I've wondered that for years.",
            "What happened to the mirror bot? The twitch links get bugged on my cell phone and I can't play the videos because of the content warning never disappearing. The bot getting removed has basically made mobile viewing impossible unless I want to download each video to watch and then deleting them afterwards.  Also, it's nice to be able to see clips that were removed/deleted for whatever reason.",
            "Has anyone been able to 100% maze bank yet?",
            "[deleted]",
            "When will the mayor votes be out ?",
            "I keep seeing things about DAP points or something when it comes to cops. What is this? I can't find it explained anywhere.",
            "What does 1%er mean in relation to the motorcycle clubs?   Like what does one percenter mean ",
            "I'm curious, do streamers that perma'd their character has decided to not stream anymore? I followed streamer who played Aziz and TJ walker character and both of them barely stream anymore. I expect they would play other characters or perhaps at least stream anything but nothing came out from them.",
            "What's with all the clips at 0 points? Seems like lately most clips are instantly downvoted regardless of the content."
        ]
    },
    "Aziz Murder Case against Capped dismissed with prejudice": {
        "title": "Aziz Murder Case against Capped dismissed with prejudice",
        "score": 117,
        "url": "https://i.redd.it/g3nb8185l28d1.png",
        "content": "",
        "num_comments": 66,
        "comments": [
            "I really don't understand why he waited last minute for both cases he worked on. he put off becoming an officer 4-5 weeks, worked for hours with Tilly, and grew frustrated with his superiors for making him patrol instead of investigate, all that for the cases to go past the statute. just a few days ago he was saying he wanted to play crim again because investigating was hopeless. Peppo's a great rper, but his decisions are baffling",
            "Im curious, those that has followed this particular investigation, was there any evidence i.e. stuff from subpoenas or was it all circumstantial, from the little I have seen there was not enough for a case.",
            "Maybe now he can have a funeral?",
            "Coyote 0:2 on high profile cases so far before he's even a Deputy. A new record.",
            "I'll preface this with I am a CG fan:  Imagine all the weird haters confusion when they find out that Judge Hallow is also the same person who plays Officer Decker, the person whom they think has a weird personal axe to grind with CG by trying to charge them with anything that sticks and stacks",
            "Slacks pepega CID really gonna get Siobahn for bandaids while she lays chopped up and exploded in the icu and dead cops fall out of SoL. What a legend. ",
            "Fly high",
            "wow im so shocked - aziz died for nothing and its all slacks fault\n\njust stop ssaab from making investigation departments and let someone else lead he doesnt need the power nor the rank when he keeps on killing the pd",
            "Coyote the character is just not a good detective despite trying to build the character as one.  He comes up with outrageous theories for the most cut and dry stuff then flat out ignores the most obvious.  Tuggz admitted to Coyote that he was involved not even 12 hours after Aziz died and Tuggz isn't mentioned in the case at all.  That should tell you everything.",
            "Was so funny when pigeon called coyote on a private # to celebrate lol even hazel drove up and started laughing at him. Poor coyote is now getting scolded on his reports lmao"
        ]
    },
    "Oops...": {
        "title": "Oops...",
        "score": 499,
        "url": "https://clips.twitch.tv/UninterestedResilientPuddingRickroll-q3jMmVDiF7tBEWyO",
        "content": "",
        "num_comments": 15,
        "comments": [
            "\nMirror: [CAUGHT](https://files.catbox.moe/1zwusn.mp4)\n\nCredit to https://www.twitch.tv/Ramee\n\nDirect Backup: [CAUGHT](https://production.assets.clips.twitchcdn.net/waMek6t4zJlQ4he7QRFsjg/44406589083-offset-11016.mp4?sig=4ca0606da9c9004976ae9ce4d5609646e2e7ae36&token=%7B%22authorization%22%3A%7B%22forbidden%22%3Afalse%2C%22reason%22%3A%22%22%7D%2C%22clip_uri%22%3A%22https%3A%2F%2Fproduction.assets.clips.twitchcdn.net%2FwaMek6t4zJlQ4he7QRFsjg%2F44406589083-offset-11016.mp4%22%2C%22clip_slug%22%3A%22UninterestedResilientPuddingRickroll-q3jMmVDiF7tBEWyO%22%2C%22device_id%22%3Anull%2C%22expires%22%3A1719079381%2C%22user_id%22%3A%22%22%2C%22version%22%3A2%7D)\n\n---\nThis was done by a bot. If you have any questions or concerns, please contact the moderators.",
            "bruh he saying what i would have said if that shit happened to me irl lmao",
            "He turned red instantly LMAO",
            "The Silence from her kills me lol",
            "These news phone listener things have been such good content. Kudos to dev team for this lol",
            "LMAO that's fucking hilarious",
            "The phone tapping devices have been the best new addition in 4.0. Already delivered so many good moments.",
            "Anyone got her PoV?",
            "OMG that's too funny, he went so red lol",
            "Lmfao that stuttering! He got so flustered couldn't find his words. 🤣🤣"
        ]
    },
    "All Gang Tags in the MDT": {
        "title": "All Gang Tags in the MDT",
        "score": 16,
        "url": "https://i.redd.it/n1p7ek6x848d1.png",
        "content": "",
        "num_comments": 2,
        "comments": [
            "did they rly gave ob a hotdog as icon xD"
        ]
    },
    "[Buddha] Lang meets Richard": {
        "title": "[Buddha] Lang meets Richard",
        "score": 422,
        "url": "https://streamable.com/evlxnh",
        "content": "",
        "num_comments": 21,
        "comments": [
            "big +1s to all of those guys in the background for the \"is that really him?\" comments lol",
            "Richard is a gem",
            "Richard is pure unhinged entertainment",
            ">Lang meets ~~Richard~~ Red Lipstick\n\nFTFY",
            "Did you bleep out the swearwords?",
            "Pure golden interaction",
            "did he lose his DOC prio? he's been streaming less frequent this month",
            "[removed]",
            "Edit: I was wrong",
            "zizizizizizizizizizizizizizi"
        ]
    }
}