{
    "Weekly Free Chat - 06/22/24": {
        "title": "Weekly Free Chat - 06/22/24",
        "score": 2,
        "url": "https://www.reddit.com/r/rpg/comments/1dlt4tq/weekly_free_chat_062224/",
        "content": "\\*\\*Come here and talk about anything!\\*\\*\n\n&#x200B;\n\nThis post will stay stickied for (at least) the week-end. Please enjoy this space where you can talk about anything: your last game, your current project, your patreon, etc. You can even talk about video games, ask for a group, or post a survey or share a new meme you've just found. This is the place for small talk on /r/rpg.\n\n&#x200B;\n\nThe off-topic rules may not apply here, but the other rules still do. This is less the Wild West and more the Mild West. Don't be a jerk.\n\n&#x200B;\n\n\\----------\n\n&#x200B;\n\nThis submission is generated automatically each Saturday at 00:00 UTC.",
        "num_comments": 1,
        "comments": [
            "Hi, i hope i can post this in here.\nI wanted to ask something, i'm new to TTRPGs, i've only runned Call of Cthulhu once as a Keeper, and i will try to run Pulp Cthulhu, next time when i meet with my friends. \nThey also wana play DnD, but i don't know if i should wait for DnD Beyond,  get the fifth edition or just keep playing Call of Cthulhu?\n\nThanks for taking your time, and sorry if my english isn't that good."
        ]
    },
    "\"Rulings not Rules\" Question": {
        "title": "\"Rulings not Rules\" Question",
        "score": 37,
        "url": "https://www.reddit.com/r/rpg/comments/1dlnj25/rulings_not_rules_question/",
        "content": "I've seen this slogan in two main places.\n\n1. the OSR community, where I think it probably originated\n\n2. 5e discussion threads.\n\nIt has the opposite reactions based on the system we are discussing. Are we discussing a rules light OSR/NSR title like Stars Without Number with explicitly tells you that \"This sytem will not break if you add new rules to it, please feel free to change anything you don't like\" (sounds pretty rulings-not-rules to me) and any other rules light system that Doesn't Have a Rule For That, so the GM will have to make a ruling one way or another. This seems pretty accepted in the OSR community and I personally really like it.\n\n5e also has been attached to this idea, but here *it's received really negatively*. Is it seen as lazy on the part of the designers perhaps? Or is it that is slows down an already long combat encounter to bicker about how a spell or class ability should be interpreted? I've experienced both in 5e games I've played, and it's one of the reasons I really like rules light systems. Less bickering because there's only like 3 rules. You know as much as I do. \n\nAm I wrong about this double standard? Am I just misinterpreting or misremembering something?",
        "num_comments": 67,
        "comments": [
            "I think with 5E specifically, it's not that \"rulings not rules\" is bad, it's that 5E kind of wants to eat it's cake and have it too. It's just gritty enough that minor wording changes do actually matter Rules-As-Written (see weapon attack vs. attack with a weapon or whatever the precise distinction is) but is vague enough to make it seem like they don't Rules-As-Understood and Rules-As-Designers-Seem-To-Want-It-To-Be.\n\nFor what it's worth I think the system largely holds up fine run rulings-first (paladins should totally be able to smite barehanded) and that gripes are a bit overblown but I recognize that then I'm not technically running it rules as written. Either way that friction and poor communication on the part of the devs is still a design failing.",
            "I think the issue is that 5e isn’t particularly rules light (though compared to 3/3.5…) so the GM rulings can easily conflict with how the game is specifically meant to be played. Which is one of the quirks of 5e, it is designed to be played a certain way (I think it’s 5 encounters an adventuring day?) otherwise its internalized balance falls apart rapidly. \n\nThis isn’t as much of an issue in rule lite rpgs because they are designed(or Freeform enough) to allow different rules to be slotted in for edge case scenarios (like vehicle combat for example) which prevents someone from inadvertently breaking the game flow.",
            "It's really hard to play \"rulings over rules\" *and* have a system where a ton of different player options are supposed to be \"balanced\" against each other *and* there are supposed to be tools such as CR to help you easily build \"balanced\" encounters. The culture around 5e tends to value \"balance\" (whatever the hell that means), while OSR culture tends to reject \"balance\" and embrace the chaos.",
            "Some games (like Pathfinder) are rules-oriented. There is a ton of detail and a clear rule or two for just about everything. This lets a game with a high level of granularity be run consistently and fairly. High stakes are backed up by the knowledge that the GM isn't just winging the mechanics that get your PC killed.\n\nSome games (like most of the OSR) are rulings-oriented. There isn't much detail and there's a lot of room to make things up. This lets a game with a lower level of granularity be more approachable (less initial reading) and open to creative problem directly from the players, unfiltered (or minimally filtered) through mechanics. Some games are low-stakes, while higher-stakes games are very clear about the nature of their sometimes-arbitrary deadliness.\n\nDnD 5e doesn't fit either description. Instead, it is rules-*missing*. There are a lot of clear rules and a lot of detail in 5e. Spellcasting is extremely detailed and rigid, for example. But then it leaves a ton of uncharacteristic gaps. For example, there are no rules for how rope can be used to tie creatures up or climb, there's only a rule for snapping it with a Strength check. So sometimes the high stakes are backed up by the GM playing with consistent and fair rules, and sometimes they really aren't. To find a consistent play experience, either the GM needs to do a ton of extra work to make things rules-oriented, or the group needs to discard most of the existing rules to make things rulings-oriented. 5e itself accomplished neither, but still gets credit for both because it's the only ttrpg most people play.",
            "There is some additional information surrounding this statement. In one of the OSR blogs, they talk about the type of game you need for the OSR playstyle. One of the requirements is you need an \"Incomplete\" game. A game that has a good basic framework, but has lots of openings for rulings to be made. It can't have a lot of tightly interconnected rules, otherwise there is no room for rulings, they will also break other related abilities.\n\nThere is a great blog post  by Arnold K. on Goblin Punch, called \"Rulings not Rules is insufficient\" and it goes over that to make this work, it needs to be encouraged at all levels.\n\nHe gives an example of  a system that doesn't work:\n\nDM: \"Alright, you all manage to tread water for 18 hours, but the act was so exhausting that you've all lost all of your healing surges.\"\n\nPlayer: \"Wait, I can't use any of my class abilities without any healing surges.  In fact, I turn into a pumpkin without any healing surges.\"\n\nDM: \"Well, we've already established that exhaustion drains healing surges.  That's been a house rule for months.  And treading water for 18 hours is definitely exhausting.\"\n\nPlayer: \"But that was before I picked up the Pumpkin King prestige class.  It's unfair now.\"\n\nYou can read the whole article here:\n\n[https://goblinpunch.blogspot.com/2016/02/osr-style-challenges-rulings-not-rules.html](https://goblinpunch.blogspot.com/2016/02/osr-style-challenges-rulings-not-rules.html)",
            "How is it a double standard?  The OSR and D&D 5e fanbases are very very different, even if there is significant overlap.  The two games demonstrate very different philosophies in the way they approach rules and what they expect from players/GMs.  \n\nThe reason people expect D&D 5e to be a complete experience out of the box is because that is exactly how WotC markets it.  The game is written such that it seems to have a rule for most things, so that makes it feel like it ought to have clear rule for *everything*.  \n\nOSR games, by contrast, are written under the assumption that the people playing the game are deep enough in the TTRPG hobby that they know what \"OSR\" means.  Such an audience is going to be much more comfortable with the idea of making up half the game as you go, and the lightly written rules support this idea.  \n\nIn other words, it's not a double standard, it's two vastly different groups of people having different reactions to the same phrase.",
            "Very interesting thread prompt, thanks for posting it.\n\n\n\"Rulings not rules\" at its core has a nice philosophy behind it. Some things are left vague or open to interpretation so that the game master and players can decide what something means when it comes to specific interactions or scenarios. This can be a good thing when handled well because it allows for flexibility in a game to fit different playstyles or intentions. OSR-type games, like Stars Without Numbers, tend to do this well and add some freedom to players and GMs to use their imaginations and flex the game a little to play to their preferences.\n\n\nThen we get to DnD 5e where it's a pejorative and I will be using 5e for this example because it's so derided and there's a lot to draw from. It is my belief that DnD 5e's claim/pseudoclaim of \"rulings not rules\" is taken badly *because it is a bold-faced lie* and I will explain why.\n\n\nFor 5e there's a lot in play that goes into that stew pot, one of them being a side effect that it's too big. Unlike other RPGs 5e has organized and sponsored play by its parent company which is called Adventure's League. How play is handled in Adventure's League is meant to be drop-in drop-out at any supporting game store and run by any game master. It's designed to be ultimately balanced and run on rails so you don't have someone like Pain McBleedEdge drop in with a Level 20 character with custom homebrew feats and a vorpal gunblade. As a result of this the rules __need__ to function in hosted games for Adventure's League in a uniform fashion to make things run smoothly. This fundamentally does not work with a \"rulings not rules\" approach because there is a defined correct ruling and every other ruling is wrong.\n\n\nThis is also compounded with another phenomenon of 5e's size and/or culture. It's the Sage Advice column. Sage Advice is a weird set up that's gone from FAQ to open forum when it shifted to Twitter and exists in an awkward grey area, but what Sage Advice is happens to be a platform where people who play the game can ask developers to clarify rules questions. This *can* be well and good and isn't inherently a bad thing but sends mixed signals. If the game approach is \"rulings not rules\" and you have a platform to ask the developers questions for their intended rulings, then it can invalidate the rulings other tables make because the rulings on Sage Advice can be seen as coming from an authority and that's often what happens when the game developers start making rulings not at your table which can be brought to your table with this authority as backing. Which of course sparks table arguments and also lends credence to the stance of \"rulings not rules, but only the right rulings\". \"Rulings not rules\" but the people who make the game are handing out ammunition against your rulings that are different from theirs. This all might sound like complaints and it would be if not for the fact that Sage Advice also releases errata, which are in fact defacto rules changes based on rulings made on the public forum. These are hard rules, not rulings. So now your rulings can be directly invalidated by the book itself. On occasion this is even really bad when the errata hits territory that should definitely be a ruling thing and not a hard rule, there was a change made to the way melee cantrips work with a feat that gained a lot of attention that way. So \"rulings not rules until it isn't anymore\". The game master has final say over what rulings take place at their tables but this ignores the fact that rules exist both ways to allow for players to have something to point to in their own defense and make an attempt at fair and intentioned play with a semblance of balance. It can't all be rulings, at that point you may as well play checkers, so what is invalidating a GM ruling and what isn't when the devs make a game adjustment with errata?\n\n\nThe final nail in the coffin harkens back to the rules themselves as well as Sage Advice, and that's a lack of confidence and resources. It's gone on record (usually on Twitter) for Sage Advice that on occasion different developers will give different answers to the FAQ material brought to them or will insufficiently answer questions about it, or contradict written material or change it (people in the 5e space drag Jeremy Crawford through the mud because he's particularly bad at this). Combine that the lack of context in the given rules and it becomes apparent that some rules aren't vague because the intent is you have the freedom to make your own judgement call on them as rulings, but is instead because the rules don't work, aren't clear, have a clear correct ruling that isn't stated because they were written poorly, or were poorly implemented. As an example in 5e nobody has any idea if you can attack while jumping or not and that's not a case of \"it's left vague to allow the GM to decide\", it's a case of \"the rules contradict anything that speaks on whether or not it's allowed\". Here the game master isn't making a ruling based on the philosophy of \"rulings not rules\" in that they have freedom to play the game how they like, they're making a ruling to fix a broken mechanic which never functioned on release. And 5e is absolutely rife with these. Like with Challenge Rating, or CR, which is there to act as a guideline for the game master to decide how challenged their players are in fights and how much effort and risk they'll present. CR doesn't work all that well and completely breaks down at some levels of play. A \"ruling not rule\" of CR as intended would allow for the GM to adjust for more powerful or weaker characters but still act as a guideline, but instead it must have rulings made because it does not funtion as a proper guideline in the first place. When all these rulings that must take place to fix broken mechanics adds up it gives the impression that the developers endorsed the \"rulings not rules\" style not out of advocating for freedom of play but instead to cover up their nonfunctioning mechanics and trick game masters into fixing things for them, and doing so creates a lot of extra work for the game master. Instead of empowering play it's an apparent excuse for laziness and poor game design.\n\n\nAnd that's why I think it's ridiculed. In by far the most popular TTRPG the claim of \"rulings not rules\" is very much not held to the spirit of that philosophy and is  implemented in a way that's poor at best and an outright false claim at worst.",
            "In 5e's case there's more of a culture clash between old school and new age, and that's a small part of why you get the different reaction. Old school D&D was used to the rulings not rules process, where as a lot of new age D&D players were half being introduced to it for their first time in 5e and 5e also stopped committing to it midway through the edition/development.\n\nWhen the PHB was written, it was with a more naturalist language focus and with an understanding of rulings not rules/reason being applied. However a lot of that naturalist language has been shifted in its understanding to be used as gamist language when it wasn't written as such. It's why there's a meaningful difference between *\"Melee weapon attack\"* and *\"attack with a melee weapon.\"* and why through a very strict interpretation of RAW that the current lead designer has clarified to be the correct interpretation *\"True seeing doesn't shut off the disadvantage on attacks against invisible creatures from the invisibility spells, it only lets you see the creature.\"* It's obvious what the intent was in the latter example, but now that it's being viewed in a phrase to code like manner, things fall apart more. (Also makes 5e seem more borked than it is if you wanna sell revisions to the books for an anniversary.)\n\nAnother cause of the frustration in 5e are also a few DM's that are pretty bad or ass hats about certain stuff, and abuse rule zero for their lack of understanding, rather than fair or reasonable rulings. These are often the types who put more stock into a features name than its rules text and make some pretty heinous calls such as *\"you need to be hidden to sneak attack\"* and such. The rules are incredibly clear that it's not the intended case but *\"hurr durr it says sneak\"* (and not understanding the full range of meaning of the word sneak) leads to bad calls by these fellows. This isn't exclusive to 5e, but 5e suffers it a lot likely due to the scope and scale of its rules compared to some simpler OSR entries.\n\nI would also say that a lot, but certainly not all, of the OSR/NSR games I play are more of a complete package and empowers the DM with additional tools, resources, and guidelines and the reasoning behind them, than most of the 5e content I come across. Worlds Without Number as an example offers a much more complete system than the 5e PHB (and 5e with a good amount of the supplements included) in my experience and explains the *\"why it is suggested you do it this way\"* much better than 5e has.\n\n5e is also much more focused on *\"balance\"* than old school games. 5e was designed with a very strict flow of an adventuring day in mind. 6-8 medium difficulty resource draining encounters per long rest, with two to three short rests in between. (you can use less encounters that are higher in difficulty or ore that are easier, but thats the base assumption.) If you're not providing that properly for you players, things can fall apart and the way a lot of people seem to want to run the game doesn't line up with this expectation. \n\nMany OSR games don't have this strict expectation and approach things more loose. They also have a different assumption of livability and approaching these encounters. Making a saving throw in 5e is often viewed as a normal and expected occurrence, whereas making one in many OSR games means you failed to avoid the danger and are suffering the consequences harshly. There's A LOT that could be said about these nuances, andd many who can explain them better than I could, but there's very different expectations between the two in this regard.",
            "The issue is that with OSR (like you said) they are already rules-light so you're not likely to break anything. If anything it's encouraged. The game leaves space for you to fill up with your own rules/ perspective that help you run the game. You can play most OSR games in like 5 minutes, including the time it creates to explain rules + make a character.\n\nMeanwhile 5e has entire books full of rules, but when the time comes to actually commit to something they're like \"oh, just do whatever you like :)\", which is unhelpfull because it'll \n\n1. react to other already existing rules and \n2. you're not buying 5e for the rules light OSR experience. You're buying it because you want clear rules.\n\n5e throws you a box of tools, and then lets you figure out how to use them and what they're for. That doesn't work with how many rules it's throwing at you. They want you to think of creative solutions, but if you do that, you unintentionally end up breaking so much of that game that it's just frustrating to play.\n\nThe best comparison is looking at 5e compared to pf2e. Pf2e has a shit ton of rules, but they're all clear. Everyone knows what's going on, and it allows you to think more creatively than dnd because instead of thinking/ ruling outside of the box pf2e has made the box fucking huge so anything you think of fits in there.\n\nThe best example imo intimidate in 5e/ demoralize in pf2e\n\nDemoralize is incredibly clear, you're trying to do a clear thing and you know the effect\n\nin pf2e it is\n\n>\"dm I want to demoralize that guy\"  \n\"okay, it succeeds he's now frightened\"  \n\n\nin dnd, you inherently might want to do a similar thing because you have a skill that says \"intimidate\", but there's no actual rules. So then it ends up being this annoying back and forth where the DM has to balance it on the fly, and hope it's not too strong because then it'll get abused in every combat in the future, so it looks like\n\n>\"dm can I intimidate that guy?\"  \n\"uh sure what do you want to do?\"  \n\"well I'm hoping he'll get scared and run away\"   \n\"No that's a bit too much for intimidate, he'll be scared of you but he can't just run away from his job\"  \n\"Can I intimidate him into focusing on me or something? Cause I'm a threat now\"  \n\"Uh, yea that should be fine I think\"  \n\"did that count as an action or just a bonus action?\"  \n\"oh well I think it's an action cause you had to roll dice for it\"  \n\"yea okay, that's my turn then\"",
            "While there are other reasons I think much of the negative reaction to rulings not rules comes from D&D's push for perceived balance (CR) and uniformity (Adventurer's guild, virtual table tops, a culture that expects rules and the game world to work the same between different games) that doesn't exist in the OSR and related games."
        ]
    },
    "Players getting caught up with a throw away idea": {
        "title": "Players getting caught up with a throw away idea",
        "score": 24,
        "url": "https://www.reddit.com/r/rpg/comments/1dlp5qk/players_getting_caught_up_with_a_throw_away_idea/",
        "content": "\\*\\* If you're one of the few players in the world playing a Fading Suns 2nd Edition game, don't read any further (because this might be your game)\\*\\*\n\n  \nI'm looking for ideas on how to deal with my players getting pretty invested in a throw away idea, one that I had no real plans for and can't really envision doing anything with. As they're invested (or clueless) I don't want their interest to go to waste - this is obviously something they want to be a part of the game.\n\nHaving being bequeathed a spacecraft by a notoriously rambunctious and amorous noble they searched the library on his estate for information and barely succeeded (like mechanically 'you've done the task but its piss poor') so I told them they had a found a 'little black book'. It was full of names and dates. They've spent a while trying to work out if there was any meaning to them. I have so far:\n\n- Given them information on their analysis without having them roll, if I'm telling them something this way its my usual sign to them that there isn't anything hidden in any sense.\n\n- Repeatedly used the phrase 'Little Black Book'\n\n- Told them that there's no pattern to names or dates, some appear more frequently, the last to appear more frequently was the same name as the nobles mistress.\n\n- Someone they met had had a one night stand with the noble, and their name was in the book, with a date that matched the time period described by the NPC.\n\nI just thought this would be window dressing, giving a bit of colour to an icky guy with a high sex drive. I don't think I could have been any clearer beyond saying 'folks, this just looks like a list of people he's boinked'. Now my players seem intent that this list of partners has some hidden meaning and seem quite intent on pursuing it. ",
        "num_comments": 16,
        "comments": [
            "It sounds like you’ve accidentally made this book mysterious. All of the coding here implies that the book is consequential: why would anyone record this information if it doesn’t matter? I can totally understand why your players are treating this like a hook, since none of them recognized the trope.\n\nThat said, I think that because you didn’t intend for this to be a hook, the best move is to just tell them the truth. The best time to do that would’ve been during play while they’re asking questions about it. When it’s throwaway stuff like that, I often just pick the character with a vaguely relevant background/vibe and tell them “yeah this is almost certainly blackmail or something similar.” The second best time is now, before next session.\n\nIt’s totally fine to be direct and just tell your players what something is, especially when they seem like they’re about to spend a lot of time trying to figure that something out when it’s not actually a big deal. We don’t live in our characters’ worlds so they would make inferences that we don’t. If your players are really keyed in on uncovering a conspiracy and you want to encourage that, come out strong with a different hook for that type of adventure next time you play.",
            "The two options I can think of are:\n\n(1) Just tell them, out-of-game, what they've failed to figure out - that this book is of no use to anyone (except maybe a blackmailer).\n\n(2) Invent a vast conspiracy. Everyone they tell about the book ends up dead. Anyone in the book who they confront is killed by a mysterious sniper.",
            "When your players have a lot of energy poured into something, you can either make that energy pay off, or disappoint them. Brainstorm a nice little intrigue that they can gain from chasing the naughty book that will give them something of value.\n\nMaybe the noble had a forbidden tryst with someone and they both left it behind and both regret that sacrifice deeply but believe the other person didn't care. Now they're both in a different place and the nosy adventure addicts finding the book could re-unite them.\n\nMaybe the book isn't what it seems but is actually a blackmail book full of people the noble \"Fucked\" more metaphorically and pursuing it will put them in conflict with people he's wronged who might want revenge.\n\nMaybe chasing the book will open a door to an underground sex club full of fairly powerful people that while awkward, could offer the players \"access\" to some influential people on the planet.\n\nMaybe the book is just a gauntlet of horny dysfunctional people but one of the names on the list ends up being a hook to some other adventure that the players stumble into.",
            "You could try splitting the difference between your set dressing and their insistence on something deeper. What if, for example, it's not a list of people the noble's solicited for sex, but people he's successfully blackmailed for it?",
            "The fact that it's a list of people the owner boinked is something that a reasonable searcher should be able to deduce with a reasonable amount if research, which it sounds like they've done. So I would just tell them that that's what they've come to realize.\n\nBut that doesn't make it useless.\n\nThere are names in that book, names of sometimes rich and powerful people, and that makes knowledge about them a tool. Criminal empires built on blackmail have been started with less.",
            "What I would do in this instance is make the book important, but maybe not in the way the players think. So the book is a list of names? Do a little work and come up with the NPCs in that book. What are they like? Here are a few suggestions: \n\n-One lover is EXTREMELY jealous. Does she think one of the PCs is the noble’s new paramour? \n\n-One lover would rather not have her relationship to the noble discovered. How far will she go to silence the PCs? \n\n-One lover hasn’t seen the noble in a long time, and is quite upset. Did I mention her hobby is heavy artillery? And what will happen when the noble swears he meant to call her, but the PCs stole her contact information? \n\n-One lover IS involved in a dark conspiracy. The PCs are either convenient patsies to draw attention away from her, new couriers, or get mistaken for people who know a lot more about the conspiracy than they do. And it’s a big conspiracy, one that routinely involves some of the biggest names in Fading Suns. \n\nA really caring GM, though, will give the players all of these options. Imagine the PCs trying to navigate their way through a conspiracy among a group of people who almost laughably overpower them while dodging mercenaries and assassins who want to silence them, and maybe a lover who wants the players to take her back to the noble and WILL NOT leave until her wish is fulfilled. Bonus points if she wants the PCs to transport her in the style to which she is accustomed…",
            "Maybe let them roll against a high difficulty every time they meet a new group of nobles. On a crit, or the equivalent of one, one of them are in the book and it can possibly be used as a future leverage.",
            "Just tell them out of character that it's nothing important, and you have absolutely NOTHING planned that involves it, it's just an old trope. Maybe the only REAL mystery surrounding it is that it has the NPCs real name inside; Sam Malone 🤣",
            "Now it might be my sheltered life but the phrase little black book describes to me the physical aspects of this notebook but doesn't immediately communicate \"the man is a whore who likes other whores\"\n\nNow of course there is a pretty simple way to make this book into something a little more, maybe the noble in question isn't as amorous as his reputation suggests and rather than being a manwhore he was actually sleeping with these powerful influential women to manipulate them. Iin that case it becomes a matter of determining the things he wanted and how exactly was he using romance to manipulate these women.",
            "Your players are clearly unaware of the trope you are referring to."
        ]
    },
    "What are the most unique things ttrpgs simulate in mechanics?": {
        "title": "What are the most unique things ttrpgs simulate in mechanics?",
        "score": 23,
        "url": "https://www.reddit.com/r/rpg/comments/1dlmiiu/what_are_the_most_unique_things_ttrpgs_simulate/",
        "content": "There are mechanics for many things. There are mechanics for insanity, menial labor, magic, deception, stealth, etc. What are the most strange and unique things simulated, that don't seem to be common throughout other games?",
        "num_comments": 36,
        "comments": [
            "I was honestly impressed with Traveller's mechanics for cargo hawling and general economy. It doesn't handwave a thing in terms of 'how hard is it to buy x'. You are on a techlevel X station, y population, law level z, and you have a level in this stat, so roll. Cool! \n\nIt's tedious, yes... hence why so many people built apps to both utilize the mechanics but also limit all the game math. I myself am working on an app to make am even more dynamic economy simulator for the system, just to get more richness in hauling cargo and dealing with a living universe.",
            "Pendragon's mechanics for chivalric traits and passions are very good at emulating the melodrama of Arthurian fantasy. And the way it ties it to glory pulls it front and centre.",
            "Changeling: the Dreaming has a [Banality](https://whitewolf.fandom.com/wiki/Banality) rating. It can help a changeling resist magic, but a high Banality can cause them to forget their existence as fey and become boring humans.",
            "Paranoia famously has a rule that simulates *metagaming* in game.\n\nIf you (the player) say something that reveals knowledge of the setting or the rules, the Computer identifies that the only way you could know that is by being a Commie Mutant Traitor and kills you.\n\nIt's alright, you've got backups. Also, you were a Commie Mutant Traitor. The Computer is Your Friend.",
            "Spite has a health mechanic for Shadow that represents how hidden/disguised/unidentified your PC is. Loss of Shadow could result in family members selling you out to local authorities.",
            "Cthulu in Call of Cthulu famously eats 1d4 adventuers per round. \n\nThat's one of my favourite mechanics in games, since it kind of puts the entire situation your PCs are in into perspective...",
            "Riftbreakers is heavily inspired by MMO mechanics, so it includes rules for checking the auction house to see if a specific item or piece of equipment is for sale and determining how high you have to bid to win it.",
            "Desperation Dice pool in Hunter. \n\nAs their hunt proceeds, characters become more and more desperate to counter the supernatural before the supernatural strikes back.\n\nEvery time a significant obstacle is met, we add a dice to a common pool. Players can choose to add these dice to their rolls, significantly increasing their odds of success.\n\nBUT - if one of those desperation dice rolls a 1, the supernatural becomes more aware of these hunters and sends more forces. Things become a lot more difficult for the rest of the chapter!",
            "In Unknown Armies, most of your mechanical abilities are based off of shock meters that measure how much exposure you have had to different kinds of trauma and how many times you have failed to deal with them.",
            "I love the way that ten candles has literal candles to represent the darkening world and the slow decay of humanity"
        ]
    },
    "Exploring my stigma against 5e": {
        "title": "Exploring my stigma against 5e",
        "score": 93,
        "url": "https://www.reddit.com/r/rpg/comments/1dl9ofn/exploring_my_stigma_against_5e/",
        "content": "A recent post  prompted me to dig into my own stigma against 5e. I believe understanding the roots of our opinions can be important — I sometimes find I have acted irrationally because a belief has become tacit knowledge, rather than something I still understand.\n\nI got into tabletop role-playing games during the pandemic and, like many both before and after me, thought that meant Dungeons & Dragons (D&D). More specifically, D&D 5th Edition (5e). I was fascinated by the hobby — but, as I traveled further down the rabbit hole, I was also disturbed by some of my observations. Some examples:\n\n1. The digital formats of the game were locked to specific, proprietary platforms (D&D Beyond, Roll20, Fantasy Grounds, etc.).\n2. There were a tonne of smart people on the internet sharing how to improve your experience at the table, with a lot of this advice specific to game mastering (GMing), building better encounters, and designing adventures that gave the players agency. However, this advice never seemed to reach WOTC. They continued to print rail-roady adventures, and failed to provide better tools for encounter design. They weren't learning from their player-base, at least not to the extent I would have liked to see.\n3. The quality of the content that Wizards of the Coast (WOTC) did produce seemed at odds with the incentives in place to print lots of new content quickly, and to make newer content more desirable than older content (e.g. power creep).\n4. There seemed to be a lot of fear in the community about what a new edition would bring. Leftover sentiments from a time before my own involvement, when WOTC had burned bridges with many members of the community in an effort to shed the open nature of their system. Little did I know at the time the foreshadowing this represented. Even though many of the most loved mechanics of 5e were borrowed from completely different role-playing games that came before it, WOTC was unable to continue iterating on this game that so many loved, because the community didn't trust them to do so.\n\nI'm sure there are other notes buried in my memory someplace, but these were some of the primary warning flags that garnered my attention during that first year or two. And after reflecting on this in the present, I saw a pattern that previously eluded me. None of these issues were directly about D&D 5e. They all stemmed from Wizards of the Coast (WOTC). And now I recognize the root of my stigma. **I believe that Wizards of the Coast has been a bad steward of D&D.** That's it. It's not because it's a terrible system, I don't think it is. Its intent of high powered heroic fantasy may not appeal to me, but it's clear it **does** appeal to many people, and it **can** be a good system for that. However — I also believe that it is easier for a lot of other systems, even those with the same intent, to play better at the table. There are so many tabletop role-playing games that are a labor of love, with stewards that actively care about the game they built, and just want to see them shine as brightly as they can. And that's why I'll never run another game of 5e, not because the system is inherently flawed, but because I don't trust WOTC to be a good steward of the hobby I love.\n\nSo why does this matter? Well, I'm embarrassed to say I haven't always been the most considerate when voicing my own sentiments about 5e. For many people, 5e **is** role-playing. Pointing out it's flaws and insisting they would have more fun in another system is a direct assault on their hobby. 5e doesn't have to be bad for me to have fun playing the games I enjoy. I can just invite them to the table, and highlight what is cool about the game I want to run. If they want to join, great! If not, oh well! There are plenty of fish in the sea.\n\nIn the same vein, I would ask 5e players to understand that lesson too. I know I'm tired of my weekly group referring to my table as \"D&D\".\n\nI'd love to see some healthy discussion, but please don't let this devolve into bashing systems, particularly 5e. Feel free to correct any of my criticisms of WOTC, but please don't feel the need to argue my point that 5e can be a good system — I don't think that will be helpful for those who like the system. You shouldn't need to hate 5e to like other games.",
        "num_comments": 219,
        "comments": [
            "To play Devil's Advocate re: WotC being a bad steward... the only other owner of the IP was TSR, and they basically went out of business. \n\nD&D is very cyclical, even back to TSR days but the cycle is much more noticable post-millennium with heavier internet usage etc:\n\nNew edition releases, people mostly love it and some old guard hate it, and it rolls out releases over years and becomes bloated and unwieldy. Rinse, repeat. \n\nWotC has put out a lot of great stuff for D&D over the years- the 3.Xe era was fantastic- we got Red Hand of Doom, the website was full of free stuff ... I'm inserting my own bias when I say that things really only started going downhill when Hasbro started paying attention to D&D in the late 2010's. That's when the \"stewardship\" of D&D went bad- lots of leadership was moved out, designers churned (designers always churn but they lost some particularly good folks) and ... yeah. \n\nI just don't think it's fair to say that WotC has been a bad steward the entire time. A company is made up of the people who work there, and it had a lot of good people making decisions and products on and off for a long time.\n\n**I really just hate what it's become now- and a lot of that is exemplified by the DnDBeyond walled garden.** It's always possible that the cycle will begin anew, but we're a decade into 5e/5.Xe and that's the longest lifetime of any edition- and Hasbro's still trying to figure out how it can make a ton of money off of the IP.",
            "I mean my issue with 5e isn't the game itself. It's fine. It is however one rpg out of the tens of thousands available and it is often badly shoehorned into being a game it is not. If you want heroic fantasy with setpiece miniature combat then awesome it's there for you. If someone invites me to a table I'm happy to play. \n\nBut I find other games do D&D better than D&D and more often than not, I want something with more interesting themes rules and roleplay.",
            "In many ways, for me 5e (and D&D in general) is like good fast food - when I open the box I know what I'm getting and there is honestly some comfort in that.  It's a fine way to sit around with my friends tossing dice, telling \"no shit there I was stories\" and killing imaginary monsters.  \n\nWe also play and enjoy a lot of other games and I mean a lot...I currently run Call of Cthulhu, Forbidden Lands, Dragonbane, Scum and Villainy, Marvel Multiverse (while our Star Trek game is on pause), PF2e and Fallout 2d20 and play in two 5e games, a PF2e game and a Torg Eternity game. When I go to a convention I'm going to play things I've never had the chance to and I'm going to run games I think deserve a bigger audience.\n\nWhat 5e is very, very good at is getting people into the hobby due to market dominance.  If we (collectively) slam the door on those newcomers by insulting the thing that brought them into gaming we're not doing the overall hobby any favours.  Instead of saying \"5e sucks, PF2e is vastly superior\" we can say things like \"If you like 5e here's another heroic fantasy style game you might like\".  Instead of \"ugh fantasy...\" we can say \"there's lot of games out there in other genres...\" and direct them to Call of Cthulhu or Mothership or Good Society or Traveler etc.",
            "It's good to examine our thoughts and opinions, even challenge them, from time to time. I keep trying (unsuccessfully sadly) to get PbtA games for example. My view on D&D is pretty uninvolved though. I does what it means to well enough. I'll by cores and play when offered if that is what the group is in to. There are other games I prefer though, and while I generally don't worry too much about the business side of things, to say WotC/Hasbro seem blind to how they are affecting their fan base seems...both an understatement and, paradoxically, somehow not an issue.\n\nBut in the end, all I can do is spend money on the things that seem interesting to me and play the games I find fun.",
            "People may hate to hear this, but as a community we're probably lucky WotC grabbed the DnD brand as opposed to almost anyone else. DnD was dead when they plucked it from the smoldering corpse of TSR. It was not, and really never has been in the business sense, a particularly great investment. It may be the giant among TTRPGs, but it's still chump change when you step back and look at the broader gaming industry. The husk of DnD could have just been a video game property, and TTRPGs might have faded into obscurity, killed by video games if it weren't for a newly rich CEO with a fondness for the game.\n\nOverall, WotC has comported themseves far better than TSR ever did for those that remember, missteps and all. They treat their employees and players much better. As far as gaming companies go, WotC is far more responsive to player concerns than say Bethesda or EA.\n\nI always find it fascinating how people look at the OGL. People fight vigorously to defend it, yet it's probably the source of some of the community's greatest gripes. Without it, it's unlikely DnD ever gets the dominance it has because of how easy, both from a development and legal standpoint, to take a proven product off the shelf and repackage it in other genres in ways that chokes out other games.\n\nThe things people gripe about regarding WotC are things you could be angry about with literally any decently sized company in modern America. Some seem to think taking them down will yield some devastating blow against late-stage capitalism, but I hate to break it to people but all that will do is probably kill the TTRPG market. As I noted above, there's no real money in TTRPGs at the moment, so nobody with the resources to reach as many people as WotC is likely to step into the void. That means fewer people in the hobby, and choking off the primary pipeline for new players in other TTRPGs.\n\nThe hobby is only as big as it is because of WotC and DnD. That's a hard fact, even if you don't like either. So even if how they act reminds you of our capitalist hellscape or you hate the new kids won't come off it easily, they're still providing a pool of recruits for your game we could really only dream of in the 90's. Play what you like. Promote what you love. But hating on DnD on forums is just therapy, but of a type that inherently sets DnD players on the outside when your goal should be bringing them into the fold.",
            "In my opinion 5e is a mediocre system with a terrible steward. Which results in a bad combo when there are good systems with fantastic stewards, great systems with great stewards etc.",
            "I'm pretty much in the opposite boat from yours. I'm not a huge fan of WotC or anything, but they aren't *spectacularly* worse than Catalyst or any other big company. They're a big company driven by profit that requires constant sales in order to justify staying in business. The ones making the important decisions are not invested in making the best game they can. That sort of thing.\n\nAll of my issues with 5E are in the rules: the way that resources recover at different rates for different classes, and the DM is forced to intervene and strong-arm the players to prevent them from merely *sleeping*; the complete inability to consistently describe what damage even is; the way that you need to cram *six entire combats* into *every single adventuring day* before the players even begin to make tough decisions; the way that air elementals, with their gaseous appendages, hit *harder* than water elementals that actually have mass (with fire elementals having the least destructive power of them all). That sort of thing. It's just not a very good game. It's not even in the top fifty percent of games. It's not even in the top two-thirds of D&D games. It's just bad.",
            "I hate WOTC, but my stigma with DnD is quite literally the mechanics and the type of player base it encourages.",
            "Gonna point out a few other biases that are still like left in your base observations.\n\n>They continued to print rail-roady adventures\n\nRail-roady or linear adventures aren't a bad thing and you'll find a lot of players and GMs actually prefer those over sandboxy or open-ended adventures, so I don't think this is really a fair critique.\n\n\n>failed to provide better tools for encounter design\n\nThey did actually make better tools for encounter design in Xanathar's Guide to Everything, easier to use and a bit more accurate. However I don't think there is a possible CR system for 5e (or really most DnD-like systems) that will actually be 100% accurate all the time. PF2e is close and that required a massive overhaul to the math of the game where you add your full level to virtually every roll, which is obviously not something WotC could implement without making a completely new edition (and also has its own downsides). \n\n\n>to make newer content more desirable than older content (e.g. power creep).\n\n\nPower creep is inevitable and unintentional in games like this, there is just less rigorous testing and less time spent designing content added later compared to when the Player's Handbook was being made. If Power Creep was intentional then every new subclass would be spectacular and every new spell a barn-burner, but that is not the case, plenty of new subclasses in 5e are horrible far worse than even the base PHB ones and plenty of spells in supplements go completely unused because they're not particularly good.",
            "Honestly I just think that the only reason to play 5e is because other people can't/wouldn't play anything else, otherwise there are multiple options that are both cheaper and better designed, especcially if you're a GM"
        ]
    }
}