{
    "Screenshot Saturday! [June 29, 2024]": {
        "title": "Screenshot Saturday! [June 29, 2024]",
        "score": 1,
        "url": "https://www.reddit.com/r/RPGMaker/comments/1dr5c32/screenshot_saturday_june_29_2024/",
        "content": "Hello and good Saturday to all! Thanks for joining us.\n\n# Screenshot Saturday is NOW LIVE!!!\n\nEveryone, let's try to give everyone a good feedback. When you post  something for feedback, be sure to give someone else feedback. That way,  we can have this thread poppin until next Saturday!\n\nSame thing goes! Show us a screenshot / gif / short vid of the latest  map / sprite / spritesheet / animation / etc. of the game you are  working on!\n\nPosting could be for multiple reasons. It can be for looking for  tips, feedbacks, help, or just basically showing off that awesome thing  you just made.\n\n<3 <3 <3",
        "num_comments": 0,
        "comments": []
    },
    "What RPGMaker Should I Get: A Guide": {
        "title": "What RPGMaker Should I Get: A Guide",
        "score": 176,
        "url": "https://www.reddit.com/r/RPGMaker/comments/185h025/what_rpgmaker_should_i_get_a_guide/",
        "content": "Welcome!\n\nIf you are reading this post, then you are likely a new arrival to this subreddit. Perhaps you dabbled with RPGMaker years ago and you want to get back into game development, but don't know where to jump back in. Perhaps you saw a sale on an RPGMaker product and think this might be the time to start your gamedev journey. Or perhaps you're looking to buy a gift for an aspiring game developer in your life and you've come across our humble subreddit. Regardless as to what brought you here, we hope that this guide (and the discussion below) may provide you with input as to which RPGMaker you should buy.\n\n**I'm in a hurry. What should I get?**\n\nRPGMaker MZ. If the cost is prohibitive, please be aware that it goes on sale regularly.\n\n**Which RPGMakers are available?**\n\nBy searching the official RPGMaker website or Steam, you will be able to find: RPGMaker 2000, 2003, XP, VX, VXAce, MV, and MZ. There are also RPGMakers available on home consoles and as a Unity plug-in.\n\n**Are there any I should stay away from?**\n\nJust to get this out of the way, we would encourage people to stay away from RPGMaker Unite (the Unity plug-in), any of the home console versions (including the newly announced RPGMaker WITH), and VX. Unite is not well supported and is generally considered by the community as a product failure. Also, Unity's reputation has been sullied as a tool for aspiring game developers. The home console versions are quaint and may be fun, but they do not support plug-ins and you can only share with others on the console. VX is an older RPGMaker and was exceeded in every way by VXAce, including major bug fixes.\n\n**Let's start with 2000, 2003, XP, VXAce. What do people think about those?**\n\nLet's focus on the older makers first: 2000, 2003, and XP. If people use these engines, it is generally because they like the graphical style of the standard pack-in (\"RTP\") graphics. In general, people have migrated away from 2000 and 2003 (with 2003 having more features and an improvement over 2000). However, there are still some people who develop with XP. XP supports scripts (\"scripts\" are extra code plug-ins that add mechanics and other functions). XP also has a relatively unique mapping system that can result in some particularly pretty maps, including support for very large tilesets. It is not uncommon for some of the most attractive non-parallax maps (i.e., not built outside the engine in photoshop and imported back in) to have been created in XP. Many find that XP captures the SNES 16-bit era perfectly. However, since XP (and 2000 and 2003) are older products, there is limited active support online; you will find yourself having to look at old message boards hoping that your question has already been asked and answered. That said, if you strapped for cash and don't mind the extra effort, you can develop something quite attractive and fun in XP.\n\nVXAce was a major upgrade from XP and added some new things like .avi support, a more recent scripting language, higher caps on variables and switches, and some better options when configuring text boxes. The mapping functions are arguably downgraded from XP. And some people find the RTP graphics to be too \"chibi\" for their liking compared to XP, although some people like them more than the XP RTP; regardless, it is a major graphical shift from XP so google some screenshots to see which you like more. Scripts are still supported in VXAce. You may also find that there are still active VXAce developers and scripters, so you may be able to find help online. Also, many script repositories are still active and used. VXAce goes on sale regularly and, if you have experience with the scripting language (Ruby), you can do some very powerful things with it. It is regularly on sale for less than US$5 and is considered the extreme-budget-conscious choice.\n\n**It seems like the debate falls down around MV vs MZ. What's the deal with that?**\n\nMV was a huge jump forward after VXAce. There were a number of major improvements including: changing to a new language (Javascript from Ruby); adding export support for Mac (kinda - see the comments below about Mac support), Linux, Android, and iOS; changing to an easier and streamlined plug-in support system; an improved in-engine character generator; and supporting side-view battling natively. The RTP changed again from VXAce, although the chibi nature of the graphics generally remain.\n\nMZ is generally considered to be an improvement over MV. I encourage you to visit this page for a larger discussion: [https://www.reddit.com/r/RPGMaker/comments/vk9yqh/is\\_mz\\_worth\\_it/](https://www.reddit.com/r/RPGMaker/comments/vk9yqh/is_mz_worth_it/) and u/Fear5d 's excellent breakdown. Put simply, MZ: improved performance, improved the mapping and layering system, supports different tileset resolutions (including those from previous RPGMakers), improved script calling, changed/improved the animation system (although some find it finicky), added a few battle modes, comes with more pre-made sounds and music and traits, has new game data information that can be tracked, shows a preview of move routes when creating them, and improved plug-in management.\n\n**With all those advantages, why is there a debate? Seems like MZ is the clear winner.**\n\nSince MZ is the \"newest\" (we don't talk about Unite), it is the most expensive. And MV goes on bigger sales more regularly. Put simply, MV is cheaper than MZ.\n\nMV also has a very active userbase, has a lot of existing plug-ins (many of which are supported or so well-tested that they are very stable), and many plug-ins are cheap-to-free. If you don't feel like many of the improvements in MZ would be worth it to you (e.g., you don't care about layering or tileset flexibility or the extra sounds and music or the increased performance/stability), then you can make a very good and modern game in MV for a fraction of the cost.\n\nMany plug-ins exist for MZ - and many are the same and/or similar to the ones available for MV - but many are paid.\n\n**If I make a game in VXAce or MV, can I move it to MZ later?**\n\nNot really. If it is a very standard game using RTP elements, you may have some luck moving from MV to MZ; there are a handful of converter programs or processes out there. In general, if your game has any complexity or scripts/plug-ins, it's will be harder. Converting from VXAce to MZ is incredibly challenging. \n\n**Can I make a FPS, MMO, shmup, side-scroller platformer, or visual novel in RPGMaker? Is one maker better than the others for non-RPG game development?**\n\nSomeone once said, \"RPGMaker makes easy things easier, and hard things harder.\" Yes, you CAN make those kinds of games in RPGMaker. And those non-RPG games are easier to develop in MV or MZ than any other RPGMaker. But it still isn't easy. If you want to make those kinds of games, I would encourage you to try PixelGameMaker or Godot or VNMaker or Renpy, or even things like GameMaker, Unreal, or Unity.",
        "num_comments": 50,
        "comments": [
            "If you are on a **Mac**, avoid buying RPG Maker MV. If you look closely, it has Mac support, but not on modern Mac computers (with M1+ Apple Silicon chips) and operating systems. You have to manually replace NWJS in the engine yourself, which is easy (takes 5 minutes), but it's not worth the hassle for most people.",
            "It's happening!",
            "I think a good way to break down the debate is by what sort of customer you are... **Are you:**\n\n**A prospective game developer looking to make commercial games, ie something you can sell on Steam/Itch.io (ideally for a profit)?**\n\nOdds are, you're looking for the most comprehensive and robust engine available. Something that's relatively easy to use and gives you the highest quality the RPG Maker franchise can provide. Assuming you're confident and committed to this path, you probably expect to make money from your games in the long run, so a bit of cash upfront in the engine as well as whatever plugins and/or assets you use won't be that much of an issue.\n\nWithout a doubt, you want MZ, and may even want to upgrade when a newer version comes out in the vague and murky future. Good luck, you'll probably need it.\n\n**An amateur writer/artist/musician/other-non-game-developer looking to create simple games you can share with your friends, fans, and/or family?**\n\nOdds are, you're looking for something easy to use that will get you to making something playable as soon as possible, even if you've never touched game development before. You may be expecting this to function as something more like a digital gallery or a playable storybook than a traditional game, so you're not expecting to even come close to pushing the system to its limits, but some quality of life features on the development side would be handy. You're not looking to get too deep in the paint on things that require programming, and may even feel your mind starting to wander when discussion moves into things like scripts and plugins. As you're likely just doing this for fun and to make people happy instead of expecting a monetary return from it, you'd probably like to limit the expense as much as possible.\n\nYour best prospect is probably MV, as earlier versions are less user friendly, generally lower resolution, and don't come with built-in tutorials. Also, unlike MZ, MV regularly goes on sale at discounts as high as 85-90% off.\n\n**A hobbyist game developer looking to try out some new software?**\n\nOdds are, you're looking for something that'll help you make a JRPG that won't break your budget, and you're seasoned enough on game development to know what you're in for and thus are willing to face a few hurtles upfront. You've seen RPG Maker games before, so you're not expecting a miracle, but you would like to make something relatively sleek that you wouldn't be embarrassed to show people. You're not planning to monetize your work, or if you are it's through Patreon or something of the like that won't directly correlate your creations with a price tag, so a lower cost would be preferable unless you're getting something worthwhile out of the upgrade.\n\nOverall, you'd probably prefer to try before you buy, so my advice is to wait for a free weekend to give MV a whirl and/or check out [the free trial versions](https://www.rpgmakerweb.com/free-trials) of any version of RPG Maker from XP to MV from the RPG Maker website then get the one you like best. Or, you know, maybe don't buy any of them if you don't like them, it's your money.\n\n**A programmer looking to flex the RPG Maker engine to do some weird stuff with the system?**\n\nOdds are, you're looking for something that'll really let you get deep in the paint and allow you into the very bowels of the engine. You're not particularly perturbed about the graphics and power of the program, but it would be nice if the editor made it easy to reach the code and to keep tabs on what was happening under the hood so you knew where things were screwing up when you were messing around with the code. You probably already know at least a bit of Javascript, and may even know some Ruby, but even if you don't, you're ready and eager to learn.\n\nAssuming you're cool with Ruby as a programming language, you probably want VXAce, as it's the latest version that has the scripts accessible right in the editor and allows access to the console during playtesting without requiring any funky tricks. If you're not cool with Ruby and prefer Javascript, then you'll have to go with MV or MZ, though the two are likely interchangeable as far as you're concerned given that you're going to be making your own plugins instead of leaning on the existing library.\n\n**A bargain hunter looking for the lowest price and/or best value?**\n\nOdds are, you only want to buy what's on sale, and spending more than $10 on a single product is something you feel the need to justify to yourself. You're not particularly knowledgeable on game development, and may not even be that interested in it at the moment. You may never even use the program after you buy it... But that's a big \"may\". What if you did become interested? What if you did decide you wanted to use it, and it wasn't on sale then? Surely it'd be better to have some version of RPG Maker sitting in your account, just in case.\n\nLet's not kid ourselves, your first instinct is probably RPG Maker 2003 as it's the cheapest version on Steam. However, as you're no doubt checking right now, anything from 2000 to XP can be bought for less than a bag of chips when on sale, so XP is probably your best bet. If you want to be a real r/frugal_jerk fatcat you might consider VX for a slightly larger bag of chips or VXAce for almost an entire meal at a fast food restaurant. MV's a noticeable upgrade, but it's not THAT much better and if it's not currently on a 90% discount then it might be cheaper in the future.\n\nAlternatively, you might consider just buying none of them. The Wolf RPG Editor exists and is free, and the open source game engine Godot can create JRPGs. Maybe it's enough for you to have reassurance that free options are available if you ever become development-curious, even if they're a bit less newbie friendly than RPG Maker. I don't know your life, I'm just a random Redditor.\n\n**Someone who has questions, comments, or criticisms of what I've said here, or knows of other groups that might need guidance?**\n\nOdds are, you've read through this entire comment and have some concerns. There's probably many of you, as the only versions I've actually used are VXAce and MV, so I've probably made a lot of oversights. Just go ahead and reply to this comment. You probably already know your ideal version of RPG Maker, it's right there in your flair.",
            "me reading this while owning literally every rpg maker on steam except for vx vanilla and mz",
            "I'm not super knowledgeable on 2000/2003, but isn't 2003 superior to 2000 in every way? I also feel like there is a pretty big reason to still use 2k3 with stuff like Easy RPG existing as well as the engine plugins people have made, even if they aren't necessarily done with official means.\n\nOtherwise, great writeup and I'm glad we won't have to keep answering this question over and over again lol.",
            "As an MZ user, I can add two more things that make MV remain popular.  Some developers even prefer it.\\\\\n\n\\* MV ships with a huge asset package.  MZ does not.\n\n\\* Many of the best MZ plugins (about 10% of them) have obfuscated code.  These means they cannot be custom tweaked in any way.  The same or similar plugins in MV are not obfuscated, allowing for easier game customization, for those users.",
            "Im new to rpg maker and wanted to ask if I can publish games from rpg maker xp to different platforms like steam or playstore",
            "\"MZ is generally considered to be an improvement over MZ\"",
            "I am using MZ but it is easy to find a plugin for MV rather than MZ.",
            "I have nothing really to back this up, as I've never used it myself, but I have read numerous times that RPG Maker 2k3 with the Maniacs Patch can do a ton of cool things alongside that version of the the engine being as cheap as $2 (literally right now as of this post). \n\nMore info on the Maniacs Patch [here.](https://www.reddit.com/r/RPGMaker/comments/l3s7rs/ive_compiled_a_lot_of_tools_for_rpg_maker_2003/)"
        ]
    },
    "My game is finally out everywhere! Ecstatic to hear everyone's opinion!": {
        "title": "My game is finally out everywhere! Ecstatic to hear everyone's opinion!",
        "score": 65,
        "url": "https://www.reddit.com/gallery/1dqqeyl",
        "content": "",
        "num_comments": 8,
        "comments": [
            "How did you get it on Switch? I didn't think you could do that without porting everything over to a different engine.",
            "On all systems?!!!! How?",
            "I don't know why you wouldn't post some actual screenshots unless you're just doing that to drive traffic to your page.",
            "Congratulation!\n\nMay I ask how much did Ratalaikagames charge you for porting to Switch?  \nEdit: Oh nvm, I didn't see they also published your game.",
            "Ratalaika games probably, they do porting and publishing for rpg maker games. Probably hefty com tho 😅",
            "[MP2 has ChowJs](https://mp2.dk/techblog/chowjs/), you theoretically could make something like this yourself.",
            "Ratalaika Games ported it",
            "It's gotta be a big chunk they take. They also put your game at a very low price. I'm glad they offer the service, but damn."
        ]
    },
    "Done with painting the first map, took a couple days but i'm pretty happy with how it turned out! I tried to add some detail, but I'm sure I'll add more stuff later :)": {
        "title": "Done with painting the first map, took a couple days but i'm pretty happy with how it turned out! I tried to add some detail, but I'm sure I'll add more stuff later :)",
        "score": 23,
        "url": "https://v.redd.it/05frrag7tc9d1",
        "content": "",
        "num_comments": 2,
        "comments": [
            "If you wanna check out the progress of making this game, or just hang out in general with other game devs and artists, then be sure to join our discord server!\n\n[https://discord.gg/bAT7S5NZZ5](https://discord.gg/bAT7S5NZZ5)",
            "Hey looks great!"
        ]
    },
    "Computer for Son": {
        "title": "Computer for Son",
        "score": 7,
        "url": "https://www.reddit.com/r/RPGMaker/comments/1dqybtk/computer_for_son/",
        "content": "Good Evening,\n\nMy 10yo son has really enjoyed rpg maker so I want to get him a computer to work on his games. I have old monitors and such and wanted to know if this would work;\n\nhttps://www.amazon.com/BOSGAME-5700U-Displays-Computers-Emulator/dp/B0CNPD2V3G/ref=sxin_32_pa_sp_phone_search_thematic_sspa?content-id=amzn1.sym.e72d19d0-ad59-439b-8e2a-bbad11da9397%3Aamzn1.sym.e72d19d0-ad59-439b-8e2a-bbad11da9397&crid=VKEOR5A1P0AE&cv_ct_cx=mini+gaming+pc&dib=eyJ2IjoiMSJ9.m7570M1AeReTTbmEVZl1yZhSpWpxvIexbr-WkcIHud0uISSmzX_-O0OFCD-Zhlc6IK500OYe2dS0xgssUdXTvA.ll_gU9eiIuqOlmGYuH8o9G0B12dIzJEzXPkdlj2QiB8&dib_tag=se&keywords=mini+gaming+pc&pd_rd_i=B0CNPD2V3G&pd_rd_r=c1533e58-d546-4c46-87ea-6c9323301138&pd_rd_w=t1I0G&pd_rd_wg=qIeTV&pf_rd_p=e72d19d0-ad59-439b-8e2a-bbad11da9397&pf_rd_r=67AVK26XBRF1JJAYNX71&qid=1719619192&sbo=RZvfv%2F%2FHxDF%2BO5021pAnSA%3D%3D&sprefix=mini%2Caps%2C163&sr=1-1-320c8157-e12c-4633-a9a3-0e0d4c4cb4b0-spons&sp_csd=d2lkZ2V0TmFtZT1zcF9waG9uZV9zZWFyY2hfdGhlbWF0aWM&psc=1\n\nI'm looking to stay around $300.\n\nThank you for any advice offered.",
        "num_comments": 3,
        "comments": [
            "that little box is better than my desktop \\*cries\\*\n\nyes its fine",
            "I use one almost exactly like this, that is only 16gb ram. So that is 100% good. I can use mine for rpg maker, photoshop, and several other things with no issue. The brand I’m using is beelink incase you want to look at those on Amazon too.\n\nEdit: keep in mind this connect to monitors with hdmi, and the one you put up looks like it connects with hdmi and usb c. Make sure your monitor can use one of them or you get an adapter. Chances are you are good.",
            "This PC should definitely get the job done for your son"
        ]
    }
}