{
    "AS09E08 - \"Make Your Own Kind of Rusic\" [Post-Episode Discussion]": {
        "title": "AS09E08 - \"Make Your Own Kind of Rusic\" [Post-Episode Discussion]",
        "score": 19,
        "url": "https://www.reddit.com/r/rupaulsdragrace/comments/1dr5cxz/as09e08_make_your_own_kind_of_rusic_postepisode/",
        "content": "Welcome to the Post Episode discussion thread!\n\n&nbsp;\n\n#Current episode spoilers from this episode are allowed.\n\n&nbsp;\n\n***\n\n&nbsp;\n\nReminder that all spoilers and T from future episodes are not allowed here on [**r/rupaulsdragrace**](https://www.reddit.com/r/rupaulsdragrace). Spoilers about *future episodes will result in a ban.* Please see the [**standard spoiler policy for more details.**](https://www.reddit.com/r/rupaulsdragrace/wiki/spoiler)\n\n&nbsp;\n\n#DO NOT ASK FOR LINKS. SEE [OUR WIKI](https://www.reddit.com/r/rupaulsdragrace/wiki/viewinglinks) FOR LEGAL VIEWING OPTIONS.",
        "num_comments": 99,
        "comments": [
            "Roxxxy absolutely BODIED that lip sync. She did that without any death drops or splits. Just served stank face, a nail file and a perfectly timed BACK OFF!!!\nNo notes",
            "Roxxxy reminded me of Maya Rudolph in that lip sync. Absolutely 10/10.",
            "Making Jorgeous come out after Plastique was so shady of the producers LMAO. Also, if you were to tell me that Nina West was going to create a better look than Mik in a sewing challenge I would not have believed you. Roxxy and Plastique were stunning and that star train was insane.\n\nI continue to feel bad for Shannel as each week goes by",
            "RuPaul cant edge Shangela anymore so she choose Shannel",
            "dk why people underrate Roxxxys look this week...the amount of technical skill it takes to make an actually complicated look that has several concepts, ideas and designs put together and all of it looking VERY cohesive is actually insane....",
            "When Shannel was talking about how on season 1 she decided to leave meaning it wasnt Ru who sent her home; thats when Ru decided no badges for Shannel in these last few episodes",
            "damn these threads are always quieter than the Ross Matthews meet and greet ",
            "Justice for Nina! \n\nBut srsly, she fucking did that! I feel like it was the first time she got her proportions just PERFECT, and the fit on everything was sooooo right, esp considering garment construction is not her gig.",
            "It's feels wild to say this but I think Nina should've been top 2 in this design challenge. \n\nI do understand the judges' decision to prevent her from lipsyncing though, none of us need to see another one of those.",
            "Wow Angeria cannot catch a break"
        ]
    },
    "AS09E08 - \"Make Your Own Kind of Rusic\" [Untucked Discussion]": {
        "title": "AS09E08 - \"Make Your Own Kind of Rusic\" [Untucked Discussion]",
        "score": 11,
        "url": "https://www.reddit.com/r/rupaulsdragrace/comments/1dqdjn1/as09e08_make_your_own_kind_of_rusic_untucked/",
        "content": "Welcome to the Untucked live reaction thread!\n\n&nbsp;\n\nPlease keep all commentary about the episode as it happens in here. Following the episode we will have a post episode reaction thread where you can discuss the episode as a whole. Post episode reactions should be discussed in that thread, not as a new post to the sub. **MARK YOUR SPOILERS**, and be courteous if you happen to be watching a live feed with faster commercial breaks. Failure to use spoiler tags will result in a ban.\n\n&nbsp;\n\n***\n\n&nbsp;\n\nReminder that all spoilers and T should not be posted in [**r/rupaulsdragrace**](https://www.reddit.com/r/rupaulsdragrace)! Please see the [**standard spoiler policy for more details.**](https://www.reddit.com/r/rupaulsdragrace/wiki/spoiler)\n\n&nbsp;\n\n#DO NOT ASK FOR LINKS. SEE [OUR WIKI](https://www.reddit.com/r/rupaulsdragrace/wiki/viewinglinks) FOR LEGAL VIEWING OPTIONS.",
        "num_comments": 16,
        "comments": [
            "I want to give Shannel the biggest hug. Vanjie going over to her was so sweet.",
            "This having 6 comments is comical ",
            "I actually liked this episode of untucked bc we got to see Shannel being vulnerable and it seemed genuine, not elicited by rupaul or the judges on the main stage or work room for Emmy bait. Im clearly one of 10 who watched though ",
            "Ughhh I love Shannel so much",
            "I dont watch untucked since ep 4\n\n![gif](giphy|3ohzdYCzgVsMuYRNg4|downsized)",
            "So are we done after next week?",
            "Just came here to see if there is anything worth watching and it seems like nope",
            "I'm obsessed with this gif btw",
            "For some reason the finale isnt until the 26th.",
            "But they said no more blocking after next week or this week?"
        ]
    },
    "Favourite non-hair wigs?": {
        "title": "Favourite non-hair wigs?",
        "score": 1386,
        "url": "https://www.reddit.com/gallery/1dqx1ve",
        "content": "I like the idea of wigs that resemble hair but aren’t made of hair. What are your favs?",
        "num_comments": 260,
        "comments": [
            "Uticas afro, I'm sorry that shit is fucking funny",
            "Thorgy's rubber tube wig at the S8 finale",
            "Morphine love Dion in her gold fringe wig.\n\nLike come on, she probably set off fire alarms with how hot her look was. And that gold wig was the chefs kiss!",
            "I need Utica back on my tv",
            "Bianca's raggedy cloth piece thingie in a youtube short",
            "Love that Utica didnt want to appropriate black culture by wearing a fro and ru was like bruh some white people have curly hair tooLike the person youre impersonating.",
            "That bob ross squirrel fro is everything",
            "I LOVED Yvie Oddlys crochet wig in the \"knitty knitty bang bang\" runway",
            "What are the names of those giant curly stones wigs Viv and Jimbo are wearing??, like the style??",
            "I just realized that UTICA looks like KAITLIN OLSON."
        ]
    },
    "Got some pics of Alyssa Edwards last weekend": {
        "title": "Got some pics of Alyssa Edwards last weekend",
        "score": 394,
        "url": "https://www.reddit.com/gallery/1dr47px",
        "content": "",
        "num_comments": 23,
        "comments": [
            "A lot of people clown on the Priscilla Queen Of The Craft Store wigs, but look at her and tell me she's doing a single thing wrong.",
            "That wig is insane!!! She looks great.",
            "Love seeing her natural hair.",
            "Omg that wig is amazing!",
            "A subtle day time wig to pick up some apples, as Raja says",
            "Shes the GOAT, and youll never convince me otherwise. ",
            "Alyssa must have a neck of steel, every wig she wears looks like it weighs 30lbs. And I LOVE IT, she's the true queen of all queens",
            "These are full of so much joy! Gorgeous",
            "The level of professionalism, never too much",
            "These photos are amazing. She looks amazing"
        ]
    },
    "Thorgy is coming to the Pitstop tomorrow!!!": {
        "title": "Thorgy is coming to the Pitstop tomorrow!!!",
        "score": 1383,
        "url": "https://i.redd.it/qzb9fip3od9d1.jpeg",
        "content": "",
        "num_comments": 92,
        "comments": [
            "We love mustard and Pink.",
            "The way I audible gasped. The way I need this chaos. The way i need her to be the pit stop host for the next season.",
            "The definition of chaotic energy, we need her back with a decent edit so muuch",
            "I need Maddy to interview Thorgy immediately.",
            "Love Thorgy, shes always a great guest! Her recaps with Bob are some of my favorites. She would be one of my top picks to host next (if they ever choose a non winner again or someone who hasnt hosted before).",
            "Yesss finally! LOVE Thorghy  ",
            "Ooooo, Trixie plus Thorgy, I already know I am going to CACKLE through this episode.",
            "Im not even watching this season, but Ill watch this pitstop just because is thorgy",
            "Looking forward to the chaos ",
            "This is gonna be an amazing episode"
        ]
    }
}