{
    "AS09E07 - \"Meeting in the Ladies Room\" [Post-Episode Discussion]": {
        "title": "AS09E07 - \"Meeting in the Ladies Room\" [Post-Episode Discussion]",
        "score": 16,
        "url": "https://www.reddit.com/r/rupaulsdragrace/comments/1dlpspx/as09e07_meeting_in_the_ladies_room_postepisode/",
        "content": "Welcome to the Post Episode discussion thread!\n\n&nbsp;\n\n#Current episode spoilers from this episode are allowed.\n\n&nbsp;\n\n***\n\n&nbsp;\n\nReminder that all spoilers and T from future episodes are not allowed here on [**r/rupaulsdragrace**](https://www.reddit.com/r/rupaulsdragrace). Spoilers about *future episodes will result in a ban.* Please see the [**standard spoiler policy for more details.**](https://www.reddit.com/r/rupaulsdragrace/wiki/spoiler)\n\n&nbsp;\n\n#DO NOT ASK FOR LINKS. SEE [OUR WIKI](https://www.reddit.com/r/rupaulsdragrace/wiki/viewinglinks) FOR LEGAL VIEWING OPTIONS.",
        "num_comments": 130,
        "comments": [
            "The only bit I enjoyed was the extended scene of RuPaul slapping every person on set.",
            "not Bruno approaching RuPaul so cheerfully and still getting The Slap 😭",
            "With them bringing in Bob, Monet and Raven so far. I was fully expecting Asia to show up on that slapping scene referencing her actually getting slapped by Ru on S10.",
            "Acting challenges are not my favorite, because of the terrible scripts, but this was just crazy. Eight similar scenes in a row with Ru and the queen acting just standing there and never looking at each other. Nina did ok and Jorgeous’s wig was fun, but otherwise it was unwatchable.",
            "How does Roxxy have the nerve (delusion) to say Angie was being too dramatic with the snippers after all that nonsense she pulled last week?!",
            "The camera angle made it so clear that they were reading all the dialogues. That on top of the challenge just dragging on really made this a difficult watch",
            "As bad as the acting challenge was, the extended slapping scene did make me lol when Raven turned up.",
            "It suffered by the challenge requiring each to have their own scene with Ru, playing very similar characters and all slaps. If there were half as many queens it wouldn’t have been so repetitive.\n\nI did think Angie was the correct winner.",
            "The challenge was good in theory but in execution it went on and on lmfao the filming process though  was fun to see",
            "Beautiful gowns"
        ]
    },
    "AS09E07 - \"Meeting in the Ladies Room\" [Untucked Discussion]": {
        "title": "AS09E07 - \"Meeting in the Ladies Room\" [Untucked Discussion]",
        "score": 8,
        "url": "https://www.reddit.com/r/rupaulsdragrace/comments/1dkxv11/as09e07_meeting_in_the_ladies_room_untucked/",
        "content": "Welcome to the Untucked live reaction thread!\n\n&nbsp;\n\nPlease keep all commentary about the episode as it happens in here. Following the episode we will have a post episode reaction thread where you can discuss the episode as a whole. Post episode reactions should be discussed in that thread, not as a new post to the sub. **MARK YOUR SPOILERS**, and be courteous if you happen to be watching a live feed with faster commercial breaks. Failure to use spoiler tags will result in a ban.\n\n&nbsp;\n\n***\n\n&nbsp;\n\nReminder that all spoilers and T should not be posted in [**r/rupaulsdragrace**](https://www.reddit.com/r/rupaulsdragrace)! Please see the [**standard spoiler policy for more details.**](https://www.reddit.com/r/rupaulsdragrace/wiki/spoiler)\n\n&nbsp;\n\n#DO NOT ASK FOR LINKS. SEE [OUR WIKI](https://www.reddit.com/r/rupaulsdragrace/wiki/viewinglinks) FOR LEGAL VIEWING OPTIONS.",
        "num_comments": 29,
        "comments": [
            "I said it during We’re Here, but everybody deserves a friend like Jaida",
            "Aww Jaida 😭",
            "There's untucked this season?",
            "The way my jaw hit the floor hard as Jorgeous was giving a pep talk to Shannel. Ouch.",
            "Weird that in jaidas video message she never says the name Jorgeous. She doesnt call her by name even though she said the short joke. Like did they tell her to record a generic encouraging message that could be for ANYBODY?",
            "Worth a watch?",
            "Jorgeous said something along the lines of: “Shannel, before we arrived here I knew you were one of the contestants that was going to be a big threat in this competition.”\n\nI’m surprised they aired something that basically gives away the fact that they all know who is going to be on the season before they start filming.",
            "Do y'all remember when Colton Haynes was on DC's The Arrow and he briefly went back in the closet? \n\nAlso I hate to air out another cis white gay's Halloween wrongs (don't Google NPH Amy Winehouse meat cake), but didn't he do blackface?",
            "I can’t take Jorgeous hyping Shannel up seriously with that shake’n’ go wig 😭😭",
            "This episode made me pretty sad. Colton Haynes' XY mag photo spread was a big part of my gay awakening. I had such a crush on him back then. Depressing to see how boring he has become."
        ]
    },
    "Yvie’s dad came to see her at her book signing in Denver": {
        "title": "Yvie’s dad came to see her at her book signing in Denver",
        "score": 375,
        "url": "https://i.redd.it/ph1d4ktnp28d1.jpeg",
        "content": "",
        "num_comments": 18,
        "comments": [
            "But no let’s talk about how Yvies daddy is Daddy 👀",
            "The way Yvie's dad is pretty much my ideal man ![gif](emote|free_emotes_pack|heart_eyes)",
            "Aw, I haven’t seen her dad in a while. He still looks the same as he did in the season 11 finale. ❤️",
            "Have y'all read her book?",
            "Just wanted to say this book is awesome!  I’m only half way through but the narrative style is great, it moves quickly and is VERY well done.  Right now I’m in the section where they are on drag race and it’s basically going episode by episode.  Some real interesting behind the scenes logistics stuff about getting/going on the show too.  I understand it will get juicier but it’s already a wonderful read about a wonderful queen.  \n\nShe has a virtual meet and greet event on the 25th hosted by fanroom live if you can’t make it to a signing.  Attendance ticket includes a copy of the book!  She really is a doll to her fans, so go meet her on the tour if she’s near you, that ticket also includes a boom!  \n\nOddBless!",
            "Yvie’s dad is pretty fucking rad ",
            "Bet that's where she got that HUGE anaconda",
            "Beautiful people",
            "Chile… that’s a nice way to start the day. Yvies dad!",
            "https://preview.redd.it/tx35hzm9i48d1.jpeg?width=1179&format=pjpg&auto=webp&s=1fd497f6f6975932e2b4516dd15688ba3ee3ce7c"
        ]
    },
    "Googled Sasha Colby and am I the last person to know about this Easter egg? ": {
        "title": "Googled Sasha Colby and am I the last person to know about this Easter egg? ",
        "score": 547,
        "url": "https://i.redd.it/nscgarsko18d1.jpeg",
        "content": "",
        "num_comments": 23,
        "comments": [
            "As Chappell Roan said, \"some random twink at Google\" did it, because a similar thing pops up for her lol",
            "And if you click it on it it says \"did you mean Sasha Colby\"",
            "Some random twink at Google did it 😂",
            "Great, after Nymphia's easter egg and this, I'm gonna have to spend the next hour searching each Drag Race winner\n\n![gif](giphy|WsOcRmaJbUfYAAWuHs|downsized)",
            "Google just knows\n\n![gif](giphy|a6LxcSmSJ63IQ6Vdg7|downsized)",
            "Sasha Colby is a legend. Love how during her first step into workroom she said “period” and she proved it all the way to the crown. What an amazing talent and so kind and gracious as a human being. Hopefully she is first to replace Rupaul seat.",
            "she’s a legend",
            "omg im as old as mother?!",
            "She should take Rupauls place only qualified queen",
            "Mother🥹🫶"
        ]
    },
    "just found this old post, i'm so happy people were wrong": {
        "title": "just found this old post, i'm so happy people were wrong",
        "score": 1080,
        "url": "https://www.reddit.com/gallery/1dlij6s",
        "content": "stan chappell roan",
        "num_comments": 74,
        "comments": [
            "Porkshop!",
            "not people assuming this is about plane 😭 cant we just appreciate chappell",
            "I DID NOT MAKE THIS THINKING ABOUT PLANE I WAS JUST HAPPY FOR CHAPPELL 😭",
            "I just got put on to Chapelle Roan and this makes me so happy!",
            "How performative\n\n/s",
            "Pink Pony Club is my favorite Chappell song and that music video is iconic!!!",
            "The fact she put out a song about running away to LA to be a drag queen 4 years ago. She’s probably been doing drag longer than plane jane 😂😂",
            "Why is it like this sub has suddenly discovered chapel roan",
            "I was not expecting my own post (who had a whole 28 upvotes) popping up on my front page this morning lmao.",
            "What does the line about Carly Rae mean? I love her so much I hope they’re not just using her name to mean “fading away”."
        ]
    }
}