{
    "Russian rocket just has hitted a block house in Dnipro. Russia keeps killing civilians in Ukraine.": {
        "title": "Russian rocket just has hitted a block house in Dnipro. Russia keeps killing civilians in Ukraine.",
        "score": 338,
        "url": "https://v.redd.it/fak1m5tr9c9d1",
        "content": "",
        "num_comments": 14,
        "comments": [
            "There is a need to hit the russians with speed!",
            "Can't wait to see how massively the Ukranians can fuck over Russian military targets in response!",
            "It's simply horrifying... these Russians have no sense of sanctity! My heart breaks when they report that among the victims are small children! These inhumane people must be stopped, and Putin must finally be held accountable!",
            "I wonder why there isn't mass global protests or condemnation of this. This has been happening for a long time.",
            "A ruska swoocz ma si dobrze. Slava Ukrainie!\nWytrzymajcie, my nastpni...Ale te bd si bi z ruskiem.",
            "Ukrainian service men and women staying there that's why it was hit",
            "   ?   ,  , ,        .          - , ,   .     ? -  .    \"  \"       \"  \". ,      -  .       .       ,     .           .           ,      ,   .\n , ,  ,       ,    ",
            "Their military is a joke, so they do the only thing they are good at, killing innocent people who can't fight back...",
            "What are you surprised by? It is war, just like many others we have seen in the recent years, specially in Middle East, but we seem to care so dramatically about Ukraine, and be so insensitive about other non-european people",
            "-1000 aura you lil war monger"
        ]
    },
    "How did the war in Ukraine manage to improve Ukrainian-allied militaries outside of Ukraine? Watch the video to find out.": {
        "title": "How did the war in Ukraine manage to improve Ukrainian-allied militaries outside of Ukraine? Watch the video to find out.",
        "score": 125,
        "url": "https://v.redd.it/wst633mlg29d1",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Hi u/DeliveryNo5242! Welcome to r/RussiaUkraineWar2022.\n\nJoin our telegram that shares current footage from conflicts around the world at **UkraineWarPosts**\n\n**This is a heavily moderated subreddit. Please note the rules + sidebar or get banned**\n\n **Ukraine OSINT and Leaks 24/7** \n\n   Posts and comments from accounts with less than an undisclosed amount of comment Karma are automatically removed to combat troll and spam behaviour. \n\n   Only Mods have access to the 'Verified Information' flair. \n\n  Slava Ukraini! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RussiaUkraineWar2022) if you have any questions or concerns.*"
        ]
    },
    "Ukraine's innovative drone industry helps counter Putin’s war machine": {
        "title": "Ukraine's innovative drone industry helps counter Putin’s war machine",
        "score": 137,
        "url": "https://www.atlanticcouncil.org/blogs/ukrainealert/ukraines-innovative-drone-industry-helps-counter-putins-war-machine/",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Nice",
            "Hi u/BakhmutWillRise! Welcome to r/RussiaUkraineWar2022.\n\nJoin our telegram that shares current footage from conflicts around the world at **UkraineWarPosts**\n\n**This is a heavily moderated subreddit. Please note the rules + sidebar or get banned**\n\n **Ukraine OSINT and Leaks 24/7** \n\n   Posts and comments from accounts with less than an undisclosed amount of comment Karma are automatically removed to combat troll and spam behaviour. \n\n   Only Mods have access to the 'Verified Information' flair. \n\n  Slava Ukraini! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RussiaUkraineWar2022) if you have any questions or concerns.*"
        ]
    },
    "Earlier this month, the Kalinouski Regiment of Belarusians fighting to defend Ukraine reported that two of their brothers were killed by a mine in Kharkiv Oblast. \"Flags are lowered, those present kneel before the hero, and three shots are fired into the sky. Today we said goodbye to a brother.\"": {
        "title": "Earlier this month, the Kalinouski Regiment of Belarusians fighting to defend Ukraine reported that two of their brothers were killed by a mine in Kharkiv Oblast. \"Flags are lowered, those present kneel before the hero, and three shots are fired into the sky. Today we said goodbye to a brother.\"",
        "score": 286,
        "url": "https://i.redd.it/ly3nclq5ax8d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "- Ilya \"Litvin\" Khrenau of the Kalinouski Regiment, who died in Bucha on the 3rd of March. Litvin now has a battalion of the Kastus Kalinouski Regiment named after him. Litvin had been fighting for the defense of Ukraine since 2014. \n\n- Aleksey \"Tur\" Skobli of the Kalinouski Regiment, who was named as a Hero of Ukraine by Zelenskyy & had been fighting for Ukraine in Tactical Group:Belarus since 2015. Died covering groups of retreating troops on March 13th near Irpin, one day before his 32nd birthday.\n\n- Dmitry \"Teror\" Apanasovich of the Kalinouski Regiment, who had a battalion of the regiment named after him. He was killed by wounds sustained from shrapnel following a Russian artillery bombardment on the 24th of March, 2022.\n\n- Dzmitry \"Hans\" Rubashevski, who had been fighting for Ukraine since 2015.\n\n- Kanstantin \"Phoenix\" Dzyubayla, who had also been fighting in Ukraine for about 8 years. He was originally from Mogilev, Belarus, but made Kryvyi Rih in Ukraine his new home after joining the Ukrainian Armed Forces to defend Donbas in 2014. He was buried in that same city on the 28th of April, 2022.\n\n- Pavel \"Volat\" (I don't know his last name) of the Kalinouski Regiment, who has a battalion of the regiment named in his honour as well. He was mortally wounded while liberating a Ukrainian village on the 16th of March. \n\n- Ivan \"Brest\" Marchuk, commander of the Volat Battalion of the Kastus Kalinouski Regiment. Died 26/06/22 near Lisichansk. Brest stayed behind with a small group to cover the retreat of the rest of his unit after a massive assault by Russian troops. His \"Volat\" Battalion had successfully repulsed several assaults on their position, but this one was the largest up until that point. Brest had been fighting in the defense of Ukraine since 2014, and in 2022 he became the face and voice of the Kalinouski Regiment, calling all Belarusians to action in the defense & liberation of Ukraine.\n\n- An unnamed Belarusian of the Volat Battalion of the Kastus Kalinouski Regiment killed 28/07/22. His family asked for his identity not to be disclosed in the event of his death, likely for their own safety if they still live in Belarus\n\n- Another unnamed Belarusian from the Teror Battalion of the Kalinouski Regiment was killed after the car he was driving struck a land mine. \n\n- A soldier of the Pagonya Regiment with callsign \"Zhne\" (\"Reaper\")\n\n- Another unnamed soldier of the Volat Battalion of the Kalinouski Regiment was killed on October 3rd during an assault operation in Zaporizhzhia Oblast.\n\n- Mihas \"Yunger\" Shavelsky, a paramedic in the Teror Battalion. He was killed by shrapnel while trying to save the life of a wounded Ukrainian Marine. He was just 21 years old.\n\n- An unnamed soldier of the Kalinouski Regiment died on the 7th of November\n\n- Alyaksei \"Yakub\" Avdzienko, who had been fighting for Ukraine since 2016 (originally part of Tactical Group: Belarus, then the Ukrainian Armed Forces) died on December 4th near Bakhmut.\n\n- Ruslan \"Rusik\" Oblomov of the right-wing Belarusian Volunteer Corps\n\n- Eduard Lobov, who originally fought in Tactical Group: Belarus and had been fighting to defend Ukraine since 2015. In 2022 he participated in the defense of Kyiv and the Chornobyl regions. He was 34 years old. He died from a shrapnel would while hunting tanks and fighting in close-combat.\n\n- Yevhen \"Malder\" Lohinaw, who died defending Azovstal in May 2022. His story only became known recently. He was born in Belarus but moved to Mykolaiv as a child.\n\n- Danil Lyashuk, died on the 1st of April 2023.\n\n- An unnamed fighter of the Kalinouski regiment was killed in May 2023.\n\n- Miroslav Lazovsky, leader of the political movement Bieliy Legion, was killed in May 2023 in Eastern Ukraine. He died covering the retreat of his wounded comrades.\n\n- In July 2023, four soldiers from the Litvin and Volat battalions of the Kastus Kalinouski Regiment were killed. Their names & callsigns have not been released to protect their relatives who are still in Belarus.\n\n- An unnamed member of the Pagonia Association (an organisation of Belarusians fighting for Ukraine across several units, formally the Pagonia Regiment) was killed in August 2023.  \n\n- In August 2023, \"Zhvir\" was killed on the front lines in Ukraine. He was a veteran anti-authoritarian & antifascist from Belarus.\n\n- In October 2023, Pavel \"Bort\" Horbac of the Teror Battalion was killed in action.\n\n- The Kalinouski Regiment reported that 2 unnamed fighters were killed in April 2024. \n\n- The Kalinouski Regiment reported that two more unnamed fighters were killed in the Kharkiv area after hitting a mine.\n\nwith several more missing or captured:\n\n- Vasil \"Atam\" Hrudovik of the Kalinouski Regiment (Involved in the Peramoga plan and died near Lisichansk around the same time as Brest). Not confirmed dead, but went missing with serious injuries and it's highly unlikely he's alive. The regiment seem to consider him KIA\n\n- Vasil \"Siabro\" Parfiankou of the Kalinouski Regiment, went missing during a battle near Lisichansk (officially \"missing in action\") while covering the retreat of his brothers. The regiment seem to consider him KIA\n\n- Vadzim \"Papik\" Shatrou of the Kalinouski Regiment, went missing during a battle near Lisichansk (officially \"missing in action\"), saving the lives of several of his brothers in the process. The regiment seem to consider him KIA\n\n- Sergey \"Klyashcha\" Dzogtsev and Yan \"Trombley\" Dzyurbeyka captured in the battle for Lisichansk",
            "Source: https:// t. me/belwarriors/3063\n\nIn the photos from the two funerals, Ukrainians kneel by the side of the road as the procession passes, and a service is read as the coffin is surrounded by Ukrainian, Belarusian, and Kalinouski Regiment flags.\n\nOver 30 Belarusians have been killed fighting to defend Ukraine since February 2022.",
            "Hi u/MicrowaveBurns! Welcome to r/RussiaUkraineWar2022.\n\nJoin our telegram that shares current footage from conflicts around the world at **UkraineWarPosts**\n\n**This is a heavily moderated subreddit. Please note the rules + sidebar or get banned**\n\n **Ukraine OSINT and Leaks 24/7** \n\n   Posts and comments from accounts with less than an undisclosed amount of comment Karma are automatically removed to combat troll and spam behaviour. \n\n   Only Mods have access to the 'Verified Information' flair. \n\n  Slava Ukraini! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RussiaUkraineWar2022) if you have any questions or concerns.*"
        ]
    },
    "Moscow and Kyiv exchange dozens of prisoners - Sky News ": {
        "title": "Moscow and Kyiv exchange dozens of prisoners - Sky News ",
        "score": 195,
        "url": "https://news.sky.com/story/ukraine-war-latest-russia-putin-12541713?postid=7872546#liveblog-body",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Getting captured by the Russians was always my biggest fear, bigger than getting killed, glad to hear those soldiers are done suffering. I hope they are as well as can be.",
            "One Korea is dominating with Kpop dance, and the other ones doing fucking Putin praise and worship.",
            "Russian prisoners coming from Ukraine: well fed, in spirits. Don't look like Holocaust survivors\n\nUkrainian prisoners coming from Russia: literally look like Holocaust survivors\n\nYeah",
            "This is one of many points that I never see addressed by Russia supporters.",
            "Hi u/Warman2202! Welcome to r/RussiaUkraineWar2022.\n\nJoin our telegram that shares current footage from conflicts around the world at **UkraineWarPosts**\n\n**This is a heavily moderated subreddit. Please note the rules + sidebar or get banned**\n\n **Ukraine OSINT and Leaks 24/7** \n\n   Posts and comments from accounts with less than an undisclosed amount of comment Karma are automatically removed to combat troll and spam behaviour. \n\n   Only Mods have access to the 'Verified Information' flair. \n\n  Slava Ukraini! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/RussiaUkraineWar2022) if you have any questions or concerns.*"
        ]
    }
}