{
    "Monthly Post: SaaS Deals + Offers": {
        "title": "Monthly Post: SaaS Deals + Offers",
        "score": 19,
        "url": "https://www.reddit.com/r/SaaS/comments/1dn8ocx/monthly_post_saas_deals_offers/",
        "content": "This is a monthly post where SaaS founders can offer deals/discounts on their products. \n\n&#x200B;\n\n**For sellers (SaaS people)**\n\n* There is no required format for posting, but make an effort to clearly present the deal/offer. It's in your interest to get people to make use of this!\n   * State what's in it for the buyer\n   * State limits\n   * Be transparent\n* Posts with no offers/deals are not permitted. This is not meant for blank self-promo\n\n&#x200B;\n\n**For buyers**\n\n* Do your research. We cannot guarantee/vouch for the posters\n* Inform others: drop feedback if you're interacting with any promotion - comments and votes",
        "num_comments": 35,
        "comments": [
            "[ConvertAPI](https://www.convertapi.com/) - High-Performance File Conversion API. We offer a 30% summertime discount for Startup and Growth plans. Coupon code `3OFF-REDDIT`, use it in [checkout](https://www.convertapi.com/prices).",
            "[removed]",
            "[ValidFox](http://validfox.com) - No frills, streamlined landing page builder for validating products and services.\n\nOffering 40% off our lifetime plan with coupon code: RSAAS40",
            "Need more insights into 2FA token use? Ever wanted to separate your password management from your TOTP 2FA tokens? Now you can!\n\n[**Daito**](https://www.daito.io/?utm_campaign=msp-promo-2024-06-24&ref=mspspecial) **is 2FA as a service, a web-based TOTP 2FA authenticator for MSPs, SMBs, startups and internal IT teams.**\n\nSecurely share access, no phone needed! TOTP 2FA tokens only, not a password manager!\n\nPopular features:\n\n* Fully web-based, use from any browser, no app needed.\n* See which user used what 2FA token when in the searchable audit log\n* Limit to read-only access possible: You decide if users get read-only access to 2FA tokens, or if they can access the 2FA secret key as well (great for limiting access of freelancers & agencies)\n* Not a password manager, Daito is only for 2FA authentication\n* Easy imports: easily add accounts by copy-pasting 2FA secret keys, scanning or uploading QR codes\n* 5-second-migration from Google Authenticator (simply scan the migration code for migration)\n* Export and backup all your 2FA seeds as CSV\n* Easy management of groups of users and accounts\n* SAML SSO\n\n[**Visit now and start a free 14-day trial and test with your entire team!**](https://www.daito.io/?utm_campaign=msp-promo-2024-06-24&ref=mspspecial)\n\nShared 2FA, simplified!\n\n**Our deal offer to you**: If you like Daito and want to keep using it, send us a link to this comment and enjoy 20% off on your first year! (offer valid until July 07, 2024 eob).",
            "[Devinstock](https://devinstock.com) - All-in-one business management platform for professionals, 50% on annual subscriptions for all the plans, trial is 14 days.\n\nYou'll get the best of zoho billing, close CRM and odoo all combined ! ⚡",
            "[Kiko Card ](https://apps.apple.com/app/apple-store/id6463467787?pt=126475836&ct=reddit&mt=8)- Text to Image Converter. Transform your text to stunning visuals.\n\n50% discount for **Yearly subscription**\n\n**Discount code** `50OFF3MONTHS`",
            "[mononames](https://mononames.com) - Over 2 million brandable one-word domains at your fingertips - 10% discount with coupon code `I4NZK5MG`\n\nA short, impactful domain name that sticks in your mind is the start of a great adventure.  \nYou still have to find it...  \nIt takes a lot of time.\n\nThat's why I launched mononames, which provides access to lists of available one-word domains from various top-level domains.  \nPeople who want to start their own business or invest in domain names will appreciate the help offered by mononames lists.\n\nFeatures:\n\n* 🚀 +2M available one-word domain names on more than 80 TLDs.\n* 📊 Enjoy lists organized alphabetically in an ultra-practical spreadsheet format, complete with popularity, grammatical classes and sentiments.\n* ✨ Over 100,000 available one-word domain hacks.\n* 💡 Buy once and benefit from free updates at no extra cost.\n* 📩 Receive weekly updates.\n* 💸 An affordable one-off purchase.\n\nThe idea is to really simplify your search and offer you only available domains.  \nThis avoids you coming across domain names at an unbelievable price because they have already been purchased and are therefore available for resale.\n\nIn the list of features I mention domain hacks, but do you know what they are?  \nA domain hack is a domain name that suggests a word, phrase, or name when two or more adjacent levels of that domain are concatenated.  \nThis ingenious approach offers limitless opportunities for your online presence.  \nExamples of domain hacks? ‘instagr.am’, ‘itun.es’...  \nYou can learn more about domain hacks with this article: [https://mononames.com/blog/2024/02/26/the-art-of-domain-name-hacking/](https://mononames.com/blog/2024/02/26/the-art-of-domain-name-hacking/)",
            "I’m Phil, the CEO and Founder of [SEOPro](https://apps.shopify.com/image-alt-texts-optimizer?utm_source=reddit.com&utm_medium=social&utm_campaign=r_1), and I’m excited to share an exclusive offer for all Shopify store owners looking to improve their SEO effortlessly.\n\n**What’s in it for you:**\n\n[SEOPro](https://apps.shopify.com/image-alt-texts-optimizer?utm_source=reddit.com&utm_medium=social&utm_campaign=r_1) is designed to make SEO easy and effective for Shopify stores. Here’s how we can help you:\n\n1. Increase Search Rankings: Improve your visibility on search engines by enhancing your image SEO.\n2. Save Time: Automate the tedious task of writing alt texts for all your images.\n3. Boost Traffic: Drive more organic traffic to your store with better-optimized content.\n\n**Popular Features:**\n\n1. Keyword Optimization: Target the right keywords for better rankings.\n2. Image Alt Text Optimization: Automatically generate and update image alt texts.\n3. Bulk Updates: Easily update meta tags, image ALT, page titles, meta descriptions, and URLs in bulk.\n4. Backlink Analysis and Building: Improve your site's authority.\n5. On-Page SEO Analysis: Get real-time SEO insights and recommendations.\n6. AI Assistant & Blog Generator: Create SEO-friendly content effortlessly.\n\n**Special Offer:**\n\nFor a limited time, we’re offering a **FREE Plan** for everyone to test out our App (This is a limited time offer).\n\nCheck out more details and user reviews on our [App Store page.](https://apps.shopify.com/image-alt-texts-optimizer?utm_source=reddit.com&utm_medium=social&utm_campaign=r_1)\n\nNo Hidden Fees: We believe in full transparency. What you see is what you get.\n\nIf you have any questions or need further information, feel free to ask here or contact us directly.\n\nLooking forward to helping you boost your Shopify store’s SEO!\n\n**Best**,\n\nPhil,\n\nCEO & Founder   \n[SEOPro](https://apps.shopify.com/image-alt-texts-optimizer?utm_source=reddit.com&utm_medium=social&utm_campaign=r_1)",
            "[Sentrya.net](https://sentrya.net) - Helps you get rid of spam and junk from your personal Gmail inbox. Use SENT50 at checkout for 50% off Annual plan (delete your data from old subscriptions, bulk delete data from data brokers, data breach monitoring, and $20 for each friend invited).",
            "Tinyapis.io - Speed up your development with ready to use apis.."
        ]
    },
    "Weekly Feedback Post - SaaS Products, Ideas, Companies": {
        "title": "Weekly Feedback Post - SaaS Products, Ideas, Companies",
        "score": 5,
        "url": "https://www.reddit.com/r/SaaS/comments/1dovtgt/weekly_feedback_post_saas_products_ideas_companies/",
        "content": "This is a weekly post where you're free to post your SaaS ideas, products, companies etc. that need feedback. Here, people who are willing to share feedback are going to join conversations. Posts asking for feedback outside this weekly one will be removed!\n\n[🎙️ P.S: Check out The Usual SaaSpects, this subreddit's podcast!](https://anchor.fm/theusualsaaspects)",
        "num_comments": 21,
        "comments": [
            "Hey Reddit! \n\nI recently launched a new marketplace, it's an upwork alternative to help you find the right developer for your new web app project. It's based on the popular SaaS boilerplates, all developers being the original creators of these frameworks. \n\nI've built [mvpbase.com](http://mvpbase.com) exactly like that - by using a SaaS boilerplate and working with a dev who maintains it's code. I was able to launch for €4k: 3k development + 1k design. It took approximately 2 months from start to production. \n\n  \nI'd love to get some feedback. If you're planning to build and looking for a dev, let me know what you think!",
            "Hey everyone,\n\nI assume that many of you here are SaaS and digital asset owners, and you're the right people to give valuable feedback. I would love to hear your thoughts on [Proberix](https://www.proberix.com)!\n\nProberix is designed to **notify you when your web services are down**, offering a simple-looking interface with powerful, enterprise-grade features.   \n  \nHere are some highlights:\n\n* **Notification Policies**: Customize alerts with various thresholds and monitoring intervals to suit your needs.\n* **Multi-Tenant Architecture**: Manage multiple accounts with different billing and subscription options, ensuring flexibility and scalability.\n* **Flexible Probe Configuration**: Monitor specific URLs with customizable settings like HTTP methods and content checks, providing detailed insights into your service performance.\n* **Robust Monitoring Locations**: Enjoy global coverage with monitoring locations in Washington, Ohio, Frankfurt, and more, ensuring comprehensive monitoring.\n\nCheck out our [short video](https://www.youtube.com/watch?v=KsjD3Wi72hI) explaining these features and let me know what you think.\n\nLooking forward to your thoughts! \n\nCheers!",
            "Hi Reddit!\n\nI just launched a SaaS boilerplate code based on AWS and Next.js and am looking for feedback since it went live a few days ago. If you'd like to check it out, here's the link: [BoilerPro](https://boilerpro.co/).\n\nFeel free to DM me here on Reddit or use the support chat on the website for any questions or feedback. I would appreciate it!",
            "Looking for feedback on our SAAS Data gateway for CosmosDB containers\n\n[https://slyce-io.co.uk/](https://slyce-io.co.uk/)\n\nAny feedback warmly welcomed.",
            "[removed]",
            "Looking for feedback on https://locatelloapp.com (both or either website/app).\n\nGenerates custom audio guided walking tours, anywhere.",
            "Hey Reddit community! I'm excited to introduce [Clariti](https://clariti.app/?utm_source=clariti+ai&utm_medium=reddit-traffic) combines chat and email into one app, making communication more efficient and organized, a [team communication tool](https://clariti.app/blog/team-communication-tools/?utm_source=team+communication+tools&utm_medium=reddit-traffic) designed to streamline collaboration and boost productivity. Give it a try and see how it can transform the way your team works!",
            "Hey Reddit community! I'm excited to introduce [Clariti](https://clariti.app/?utm_source=clariti+ai&utm_medium=reddit-traffic) combines chat and email into one app, making communication more efficient and organized, a [team communication tool](https://clariti.app/blog/team-communication-tools/?utm_source=team+communication+tools&utm_medium=reddit-traffic) designed to streamline collaboration and boost productivity. Give it a try and see how it can transform the way your team works!",
            "What started as a simple idea has grow has grown into a product that can  enable any one to build backend of software . \n\nWe  saw the challenges of product development and the struggles many cross-functional teams faced because of the lack of engineering resources. With more performant LLMs, we saw an opportunity in early 2023 to build an AI system that could create software, with the goal of enabling non-developers to create software from prompts\n\nOur vision is to develop a new paradigm for software development where the end-to-end process of going from an idea to a deployed tool is abstracted away. We've created CodeWords \\[currently in stealth mode\\]\n\nToday on CodeWords, you can generate stateless back-end systems, or what we call \"Codewords\" functions, complemented with a minimal UI. these are tailored for content creation, productivity enhancements, and streamlining internal workflows. And many more to come  from a simple backend of instagram post generator to complex apps that can extract molecules from a chemical structure.\n\nThe only limit becomes your imagination. We start with empowering people to build back-end workflows and tools but we aspire eventually to improve our AI system’s capabilities so that anyone can build CRUD apps, mobile apps and beyond… using English.\n\nFeel free to DM me if you're interested in participating in the beta and I can send over the instructions (only takes two clicks!).",
            "Hola Reddit! \n\nI recently created a newsletter that breaks TikTok strategies of viral apps. It's called [Playkit](https://playkit.xyz), the hope is to create a library of content videos so founders can easily replicate a viral format. \n\nPlease let me know what you think of this idea and what you would change about the email format. \n\ncheers!"
        ]
    },
    "What’s your biggest challenge when it comes to SEO?": {
        "title": "What’s your biggest challenge when it comes to SEO?",
        "score": 3,
        "url": "https://www.reddit.com/r/SaaS/comments/1dr2ina/whats_your_biggest_challenge_when_it_comes_to_seo/",
        "content": "Hey folks, I run my own organic growth marketing agency in India and have worked with clients in multiple niches like hospitality, cloud kitchens, real estate, design agencies, manufacturing businesses, and recently a few SaaS businesses. \n\nUp until last month, we were providing everything from web dev to social media, but finally, we've decided to move forward with the SaaS niche and SEO service. As I've sold 2 of my own blogs in the past, SEO comes naturally and I'm assured of providing good results through it.\n\nBut hey, I've been noticing that it's already a highly competing market and I'm not able to figure out the challenges that SaaS companies face when it comes to SEO or content. Every prospect that I speak with has already been pitched by a freelance or agency with a generic offer that includes x number of blog posts and y number of backlinks per month. Well, I want to do better fs.  \n  \nI would like to hear your (whether you're enterprise, B2B or B2C) insights for me to be able to understand things better and move forward. Thanks.",
        "num_comments": 9,
        "comments": [
            "For SEO , if any body is promising X no of backlinks or Y no of blogposts, they are really lying ,\n\nI like to work with proven results , so it’s something arround , this is your business, first let me do a free analysis of your website and I want to check some things \n\n—- Your inpage SEO\n—- Your technical SEO\n—- Keywords you are ranking for \n—- What you are doing correctly or badly \n—- Areas to improve \n\nIt will be just a simple document , the idea here is not to sell, but to show the client where they need improvement on and how they can improve and at the end of the day , we can talk about costs if they like it.\n\nYou have to show them their problem First before you suggest a solution that works really well",
            "Isn't there accessibility compliance? Some of that would overlap SEO. That might be an angle to help others.",
            "A lot of SaaS have no seo strategy from what I’ve seen",
            "This is gold. Thanks for sharing your thoughts.   \nI recently had a discussion with a prospect in a similar way and at the end, he asked me the price. Now, how do I quantify this and price this up? Because the prospect will always be comparing it to the other agency who have shown the SEMrush site audit to them and told them about X blog post and Y backlinks.   \nAny thoughts?",
            "Hey, this is a good take. I can take this one forward. Thanks :)",
            "I know and that's what I want to understand. Is blog posts and backlinks all what SaaS founders look for or is there some desire that they want to achieve with this organic channel.",
            "Most of them don’t have any experience in seo at all, so they need the whole package",
            "I get it. But I've always thought that SaaS companies must be highly knowledgeable in comparison to hospitality, agencies, etc.",
            "oh sure, in comparison they are probably more knowledgable, but there are plenty of small saas companies who dont know SEO, for example senja who do 30k mrr have 70DR but dont get SEO traffic"
        ]
    },
    "My first SaaS: one week in (101 users, $35 MRR)": {
        "title": "My first SaaS: one week in (101 users, $35 MRR)",
        "score": 7,
        "url": "https://www.reddit.com/r/SaaS/comments/1dquk61/my_first_saas_one_week_in_101_users_35_mrr/",
        "content": "# My first SaaS: A journey to 100 users in one week\n\nIt's been a little over a week since I launched my blogging SaaS, [Blog Recorder](https://blogrecorder.com). As an indie hacker and first-time builder of an AI product, I've been floored by the support I've received. The launch has exceeded my expectations. Here is the story of my first week:\n\n# The launch\n\nLast Wednesday marked the official debut of Blog Recorder. The support started pouring in immediately, and it's been a steady stream ever since. I was even able to sell my first subscription before the official launch to an early tester, which was a huge confidence boost. On launch day, I sold another yearly subscription, and just a couple of days ago, I sold my third annual subscription.\n\n# The numbers\n\nLooking at the Stripe app on my phone, I can see that I've hit **$35 MRR**. \n\nAnd when I check my user count, I'm at **101 users** total. It's pretty exciting to think that I welcomed my 100th user today, and out of those, three are already paying customers.\n\n# User feedback\n\nThe feedback has been incredibly positive. Right before launching, I decided to add a free trial so people can create a few articles with Blog Recorder for free. This move has paid off, with users trying it out and even publishing their articles on their blogs. I can talk all day about how amazing my product is, but user experiences will always be 100x more valuable. It's been amazing to see my tool being used in the wild and knowing that those who've tried it have loved it.\n\nHere are some quotes from users: \n\n>“I've written all my recent articles using this. It's very good.” - Kent C. Dodds on Twitter/X\n\n\n\n>“Just tried u/BlogRecorder from u/EddyVinckk and was really impressed! Just paid the annual subscription so I can start dictating my blog posts 🔥” - Scott Spence on Twitter/X\n\n\n\n>“@BlogRecorder actually took me yapping into a mic and made it into a succinct blog. .@EddyVinckk is actually cooking with gasoline. Render Recap incoming!” - Dominick J. Monaco on Twitter/X\n\n# What's new and what's next?\n\nThere's a [roadmap](https://blogrecorder.com/roadmap) for Blog Recorder, and I'm currently developing some AI editing tools to enhance the user experience. I have also just added the option to add code blocks to blog posts through the editor.\n\n# Spreading the word\n\nIn the meantime, I've been promoting Blog Recorder like there's no tomorrow. I've taken to social media, sharing updates on Twitter/X, LinkedIn, and Threads. I've also been reaching out to my email list.\n\nI also joined a platform called WIP, where I can track and share my daily progress. It's not direct marketing, but the support from the community there has been great.\n\n# Launch offer\n\nAs a token of appreciation for the support and to celebrate the launch, I'm offering a discount that is still valid now. This week is the last chance to use the launch discount code `launch25` to get 25% off your first year of Blog Recorder. It's a great opportunity for anyone involved in blogging, whether it's for personal use or for content marketing to boost your product's SEO.\n\n# Try it out\n\nIf you're curious about Blog Recorder, why not give it a try? The first couple of articles are free, so you can test it out and maybe publish one or two articles on your blog at no cost. It's a great way to kickstart your SEO efforts.\n\nIf you're into blogging or looking to get your content ranked on Google, check out Blog Recorder. People are loving it, and I'm confident you will too.\n\nLet's get your blogging journey started with Blog Recorder!\n\nAnd yes, this post was created using Blog Recorder. I recorded for 5 minutes and made a few edits, exported to markdown which Reddit supports, and now I'm publishing this post. Feels great!\n\nYou can try it for free at [https://blogrecorder.com](https://blogrecorder.com).",
        "num_comments": 4,
        "comments": [
            "Is this for sub stack ? Googles Helpful Content update already killed off blogging for good.",
            "Hey, I am new to SaaS, and I am thinking of making one and it is based on my idea. How long did it take to create blog recorder from scratch?",
            "Feature product. Nothing more.",
            "If you’re looking for a developer I’m open to freelancing"
        ]
    },
    "My 8th SaaS: 1 Day ( 1 User, $20 Revenue )": {
        "title": "My 8th SaaS: 1 Day ( 1 User, $20 Revenue )",
        "score": 1,
        "url": "https://www.reddit.com/r/SaaS/comments/1dr6nom/my_8th_saas_1_day_1_user_20_revenue/",
        "content": "# Overview\n\nHello Everyone\n\nSO today i made my first SaaS sale from a SaaS that i have been building from my bedroom from the past 1.5 month.\n\n1.5 might seem nothing to someone, but i have been building this in Monk Mode.\n\n**Code → Eat → Sleep**\n\nThat's actually all i did.\n\n*Curious about the Project.→ \\[* [LeanLaunchPad](https://www.leanlaunchpad.co) \\]\n\nAnd the Sale was unexpected, i released the v2 of my product yesterday.\n\nAnd decide to tweet, \"How could i post on Hacker News without getting banned\"\n\nand withing 1 hour of that post i get an email.... BOOm SALE 🎉\n\n# Funny Story:\n\nTHE story is also actually funny, the customer emailed me with a payment bug he was facing, and i was excited that someone actually emailed me.\n\nSo reached back and got it fixed within an hour.\n\nWhile doing that i discovered he also had purchased my SaaS llifeTime offer.\n\n# Conclusion\n\n  \nJust wanted to let you guys know,\n\nI have failed 7+ businesses before i made my first Internet dollar.\n\nYour might be the 8th one, or the 9th one.\n\nbut please do not quit. You will make it. INshallah❤️\n\nThank you for reading it till here.\n\nHere is a Free Case study - Bonus for you readers - [Case Study](https://www.leanlaunchpad.co/startupPosts/average_tech_bro)\n\nIf you have nay feedback or feature request please let me know <3\n\nThank you my friends.",
        "num_comments": 1,
        "comments": [
            "Hope everything goes good for you 🙏"
        ]
    }
}