{
    "I feel this person will regret this in years to come...": {
        "title": "I feel this person will regret this in years to come...",
        "score": 1408,
        "url": "https://v.redd.it/j3okgvzaxy7d1",
        "content": "",
        "num_comments": 147,
        "comments": [
            "As long as teenagers have existed, so has cringe. We just didn't have easy access to video equipment before. Which I am eternally greatful for",
            "I’m so glad we couldn’t record video on phones when I was a teen.",
            "Damn what is this 2008?",
            "Eh. We were all teenagers once....They're a teenager, right?",
            "Who wasn't cringey when they were this age?",
            "No joke, this is my ex girlfriend’s little sister. For a short while I lived with her family and she’s a really good kid. People are pretty level headed here but I’ve seen this video on instagram and the comments can be pretty disgusting. We were all goofy kids once, let’s just be nice!",
            "Doing it in front of the audio books is a little funny",
            "I don’t know man I recorded some super cringe shit when I was a teenager, being cringe and growing up is a huge part of being a teenager",
            "We’ve all been there. Come down off your high horse",
            "Good to see emo teens are still being emo teens 🖤"
        ]
    },
    "Two porch pirates fight it out for the same package": {
        "title": "Two porch pirates fight it out for the same package",
        "score": 413,
        "url": "https://v.redd.it/1dzzqchxvy7d1",
        "content": "",
        "num_comments": 58,
        "comments": [
            "That prime driver is nor paid  enough to give a shit",
            "Why's it so normal in the US to just leave packages at the door? You have to get a signature from the guy you're handing it over to in the EU unless it's being delivered to a parcel locker or something.",
            "People ain’t shit",
            "How do people know that these boxes have expensive items like I saw a video where they talked about a dude stealing a box with AirPods and an iPad and he knew the contents in the box before.",
            "Guess it's time to install automatic Sentry guns at every home seems like a very American way to deal with this issue..",
            "Take that ambition and motivation to go get a job. Fucking scum people anymore",
            "Land of freedom",
            "No, no way this is a thing right now in US",
            "[deleted]",
            "There is no pay that would make me get involved in this.  You could threaten me with a nail clipper and i would give you the package i was carrying. Are you expecting these workers to risk their lives to protect a package worth 10 bucks?"
        ]
    },
    "Sadcringe from pre-fame Beatles member Pete Best ": {
        "title": "Sadcringe from pre-fame Beatles member Pete Best ",
        "score": 3046,
        "url": "https://i.redd.it/4f6ehi0vfx7d1.jpeg",
        "content": "",
        "num_comments": 219,
        "comments": [
            "Pete Best somewhat accepted his footnote of being a past Beatles drummer, he got married and had kids and put out some music, but to this day he still can't drum \"Love Me Do\" and they did him dirty on this [anthology cover](https://en.m.wikipedia.org/wiki/Anthology_1) by ripping off his image and putting Ringo's head in its place.",
            "To be fair, being him must really suck. :D",
            "He should start a trio with David Prowse and the guy who bought a pizza for 20 bitcoin.",
            "Bro got cucked hard by Ringo",
            "ACDC’s original singer Dave Evans, the guy before Bon Scott, did something similar: he was “celebrating” the band’s 50th anniversary last year by recreating ACDC’s first show, without any of the other members or any kind of recognition or endorsement from the band.",
            "Imagine.",
            "You think the Beatles lasted for decades when in fact they only recorded 12 full albums and stayed together for only 7 years!",
            "I thought this was a r/beatlescirclejerk post once this popped up on my feed lol",
            "I mean his handle is “beatlespetebest”. He never got to be part of it. Doesn’t even have the ability to messa Paul in private about this. And still, it is the accomplishment of his life.",
            "Still, Best ended with a much better deal than Lennon."
        ]
    },
    "Guy throws tantrum at casino after gambling away his life savings and losing it all": {
        "title": "Guy throws tantrum at casino after gambling away his life savings and losing it all",
        "score": 2772,
        "url": "https://v.redd.it/jgrdajcj1q7d1",
        "content": "",
        "num_comments": 151,
        "comments": [
            "But he read a book about how to beat casinos",
            "Incredibly sad",
            "Looks like he doesn't even give a craps.",
            "This reminds me of the old commercial of the kid that gets caught cheating on a test and just before he hands it in and says \"do you even know who I am?\" and the teacher said \"no\", so he grabs ALL the tests and throws them into the air! ",
            "That's why, on the rare occasion that I go to the Casino, I only take like 200 bucks in cash and leave my card at home.",
            "This is why folks play at home on sites like Stake 😂",
            "God, I can’t even decide which part is the most disgusting… Him being willing to gamble his life savings, the casino allowing it, him throwing this tantrum, or these low-lives recording/laughing at someone else’s misery. This world is rotten.",
            "When I gamble I withdraw my budget in cash, and entrust my plastic with a family member. \n\nI did this too when I mooched a free show for a timeshare thing. Just had $50 for emergency cab faire on me and left the plastic behind. Enjoyed some mediocre catering and just shrugged when the pressure came on “ dunno what you want me to do I left my credit in the hotel safe “",
            "I live in Nevada and sometimes I want to become a dealer just to see drama unfold",
            "If he did actually lose his life savings, I'd probably aim for 3 hots and a cot and avoiding my spouse as well."
        ]
    },
    "Imagine destroying your kids accomplishments in your mind.": {
        "title": "Imagine destroying your kids accomplishments in your mind.",
        "score": 559,
        "url": "https://i.redd.it/79s4fe2jou7d1.jpeg",
        "content": "",
        "num_comments": 50,
        "comments": [
            "This isn't even bait, this is a repeat spammer who's become a problem on a bunch of parenting boards including r/kindergarten \n\nHe has a really unpleasant power-imbalance fetish and wants to hear exactly how rough people play with their kids, exactly how weak they are, and asks us to explain over and over why we 'let them win' rather than just hitting them with full force.\n\nIt's grim.",
            "His kids seem like weaklings, he's really just telling on himself for giving them an ineffective training regimen ",
            "If my son can’t bench at least 135 by age 8 I’m sending it back to the pound",
            "Thats bait bro, chill",
            "Inside thought: 'Imagine being so insecure you feel threatened by your own 5 year old kids' lol",
            "If it’s not bait it’s someone trying to be funny and failing",
            "If someone had to stand on a stool AND hop to reach a lightswitch....Wouldn't they be like 10 inches tall?",
            "This is Sadcringe in the sense that constructing posts like this for the sole purpose of generating outrage and fulfilling a desparate, pathetic need for meaningless attention, has become a somewhat common human activity.",
            "Bad wanna standup joke...yikes",
            "They don’t seem to understand how accomplishments work. These are children we’re talking about (I assume anyway, ages are never given, it would be really sad if they were adults). They’re small, dumb, and weak, so relatively speaking, everything is an accomplishment. It’s an accomplishment if they manage not to die when left along for 10 mins."
        ]
    }
}