{
    "June Week 4— Sub Chat": {
        "title": "June Week 4— Sub Chat",
        "score": 41,
        "url": "https://www.reddit.com/r/SaintMeghanMarkle/comments/1dmyril/june_week_4_sub_chat/",
        "content": "Any issues can be discussed more widely here and is open to all. Any problems, contact us via modmail or drop a line in here.",
        "num_comments": 115,
        "comments": [
            "The [Harry and Meghan Timeline](https://www.reddit.com/r/SaintMeghanMarkle/s/67I1CDSBMe) can be found via the link (it's constantly being updated).\n\nPosting guidelines can be [found here](https://www.reddit.com/r/SaintMeghanMarkle/s/qycaN5jAqK). A few tweaks were made. Link to [SMM Wiki] (https://www.reddit.com/r/SaintMeghanMarkle/s/kDppUVz5lt)..\n\nA Helpful Guide to SaintMeghanMarkle Acronyms, Inside Jokes, and Nicknames can be [found here](https://www.reddit.com/r/SaintMeghanMarkle/s/JZ8CuQcRMl).\n\nFlair requests in the sub chat or modmail [Message the mods here](https://www.reddit.com/message/compose?to=%2Fr%2FSaintMeghanMarkle&subject=%5BJoin%5D&message=message%20here).\n\nPlease do not call out other subs here or discuss why you've been banned on other subs as it encourages brigading. Read [Part 1](https://www.reddit.com/r/SaintMeghanMarkle/s/qh3awTzG51) and [Part 2](https://www.reddit.com/r/SaintMeghanMarkle/s/pEqujLymCz) for more info.",
            "Don't have an issue, just wanted to say hi to the mods and the Congregation.   \n\n\"Hi!\" 👋",
            "I don’t know if it’s OK to post here about this. There was a discussion on X about Zara and Mike Tindall mentioning that no one in the family has met Archie and that Gained some traction there. Did we discuss it here? Apparently it was at some event recently.",
            "Has anyone watched the UK Channel 4 documentary called 'Edward VIII: Britain's Traitor King'\n\nEdward as in Wallis Simpson, King for hours only.\n\nIt is HONESTLY a repeat in history of H&M!\n\nTL;DR Edward genuinely colluded with the Nazis because they reaffirmed his misguided sense of self importance...\n\nJust like H with the Fascist Mosleys descendants today, looking to curtail 'bonkers' free speech..\n\nBut honestly, it shows that the royal fam actually have precedence on how to deal with a corrupted wayward prince\n\nOh- it also mentions Wallis was the only woman for Edward because he was bisexual... another parallel with H.\n\nAnd, Edward always assumed he would be asked to become king and assumed it would be too much for the young princess \n\nHe was apparently close with Elizabeth and Margaret growing up, being their favourite uncle, so there was a bond prior.\n\nAs soon as Winston Churchill became prime minister in 1940 he Court marshal Edward, who was still a ex military soldier, obviously unprecedented for a prime minister to court marshal an ex king, but Edward collisions helped the Nazis killing British who volunteered to help against the Nazis. \n\nWorth a watch, only 30 minutes long, if outside UK definitely worth a VPN visit\n\nWatching it is such a parallel story to H&M! History does repeat, there is no rhyme!",
            "Any word on Wontyield? I’m worried and miss her. R e d d i t is being bonkers",
            "Has anyone else seen \"Split\" on YT? Omg, I was literally lol'ing watching these newest ones, he's so good! 😆🤌   (Harkle parody)\n\nhttps://youtu.be/des2k-eGOSk?feature=shared\n\nhttps://youtu.be/3GMhLmTKJeY?feature=shared",
            "I came across this video yesterday and I was wondering what people here thought of it.  It looks typical of Meghan and Harry, but I don't understand the order of precedence that they are lining up into.  Why is Freddie Windsor standing next to William, and where are Charles and Camilla?  \n\n[https://www.youtube.com/watch?v=tTG18RS9VB4](https://www.youtube.com/watch?v=tTG18RS9VB4)",
            "Actual snark from Kate Mansey in the Times today in an article about Princess Anne. Who would have thought it!\n\nhttps://preview.redd.it/omnoegcd949d1.jpeg?width=2070&format=pjpg&auto=webp&s=dfa7fefb886214e448691d44e677cb8f84c9fc1d",
            "Princess Anne was released from hospital today - what great news! We wish her a swift recovery and then a modified schedule so as not to overdo things when she returns to work.",
            "Not much floating about on H&M. They better come up with something other than their typical puff pieces as people, and the media, are losing interest. I think they will tote out the children next."
        ]
    },
    "Breaking: Prince Harry ‘deliberately destroyed’ potential evidence relating to phone hacking claim, court hears": {
        "title": "Breaking: Prince Harry ‘deliberately destroyed’ potential evidence relating to phone hacking claim, court hears",
        "score": 620,
        "url": "https://www.reddit.com/r/SaintMeghanMarkle/comments/1dppv5n/breaking_prince_harry_deliberately_destroyed/",
        "content": "Oh boy, oh boy, oh boy. The Ginger Wanker is in big trouble now.\n\n\"The Duke of Sussex “deliberately destroyed” potential evidence relating to his High Court phone hacking claim against the publisher of The Sun, it has been claimed.\n\nNews Group Newspapers (NGN) is seeking the release of emails as well as text messages and WhatsApp messages sent and received by the Duke and material held on two encrypted hard drives.\"\n\n***This is a breaking news story and is being updated***\n\nArchive link: [https://archive.ph/3tjO6#selection-2873.0-2873.50](https://archive.ph/3tjO6#selection-2873.0-2873.50)\n\nUpdate: more from the Telegraph here: [https://archive.ph/QbkJu](https://archive.ph/QbkJu)\n\nAnother update: New article from the Independent. (Archive link) [https://archive.ph/iElRT](https://archive.ph/iElRT)",
        "num_comments": 437,
        "comments": [
            "No wonder he brought out the mummy card.  Look over here -->> not there at NGN!",
            "Harry the Liar: \n\n\"The court heard that Prince Harry had received “two encrypted hard drives” comprising work documents from his staff’s shared drive, to which he originally claimed he no longer had access.\n\nHowever, just hours before the High Court hearing on Thursday, it emerged that they had been found, one at his California home and the other at the office of his US lawyer.\n\nThe Duke has insisted he is not aware of any other portable data storage devices, Cloud storage locations or back-up tapes in his control. According to court documents, he has conducted “extensive” searches, including a physical search of his home in California.\n\nHe claims he no longer has any laptops, mobile telephones, desktop PCs or backups of his data from before September 2013, and that his former Hotmail email addresses, used pre-2014, had been deactivated and were no longer accessible.\"  \n\n\n![gif](giphy|1AIeYgwnqeBUxh6juu)",
            "But but… Harry’s mom died when he was young and Harry is really really sad and traumatized about it! /s",
            "This is interesting. Finally, the Harkles are being really boring. \n\n\n\n1) The Sun (this is for the case of The Sun that will be seen in January of next year) is playing hard, without fear, demanding proof after proof from Harry. 2) Because it is not the first time that the Harkles have refused to provide evidence to a court, claiming that they do not have it only to later discover that this is not the case. \n\n\n\nHarry is not going to be happy at all today.",
            "So that is the whole circus of Preparation H talking about mummy dear and tracksuit Meg posing in Beverly Sills. To cover the bad news of deliberately concealing and destroying evidence. Who would have thought ? /s",
            "This could be supremely ironic. Imagine suing newspapers for 'hacking' your phone and because of your own lack of integrity, having to hand over far more incriminating information - from your phone - by court order.",
            "Hey his wife lied and omitted evidence in her claim against NGN. Did this dumbass think they’d let that go and just *forget* they have a divorced reality from the truth and will go to any length to meet their narratives",
            "*\"It (the publisher) wants access to the many texts sent between the Duke and JR Moehringer, the author who ghost wrote his memoir, Spare.\"*\n\nInteresting!",
            "Harry is way out of his depth here. \n\nDestroying evidence in a case that you filed yourself???\n\nIt’s a level of stupidity that is….BREATHTAKING. \n\nAlso, looks like Harry is now trying to drag the Royal Family into this shi*show so that Charles will be forced to pay for a real lawyer for Harry - instead of the one recommended by Elton John.",
            "Dragon slayer is the dragon??"
        ]
    },
    "Pat McAfee on his ESPN talk show really sticks it to Harold for the Espy Award": {
        "title": "Pat McAfee on his ESPN talk show really sticks it to Harold for the Espy Award",
        "score": 392,
        "url": "https://www.reddit.com/r/SaintMeghanMarkle/comments/1dqz70l/pat_mcafee_on_his_espn_talk_show_really_sticks_it/",
        "content": "In case anyone still wonders what ordinary Americans think about Harold, here you go.  Pat is a former NFL player and, in my opinion, represents rather well the views of mainstream and everyday Americans.\n\nLink to the video\n\n[https://www.dailymail.co.uk/video/sport/video-3221775/Video-McAfee-disapproves-Prince-Harry-receiving-Pat-Tilman-Award-ESPYS.html](https://www.dailymail.co.uk/video/sport/video-3221775/Video-McAfee-disapproves-Prince-Harry-receiving-Pat-Tilman-Award-ESPYS.html)\n\n&#x200B;\n\nhttps://preview.redd.it/t5bsu61cse9d1.png?width=1042&format=png&auto=webp&s=fac9c06059f9ddd092f97f82b665d747c025d7f9\n\nHere is the DM article that goes with it.\n\n[https://www.dailymail.co.uk/sport/nfl/article-13581595/ESPNs-Pat-McAfee-disapproves-Prince-Harry-receiving-Pat-Tilman-Award-ESPYS.html](https://www.dailymail.co.uk/sport/nfl/article-13581595/ESPNs-Pat-McAfee-disapproves-Prince-Harry-receiving-Pat-Tilman-Award-ESPYS.html)\n\n'A lot of conversation about Pat Tillman's name. American hero... Now there’s an award named after him, as there should be in the sports world because that is somebody who is the definition of selfless,' McAfee said at first. \n\n'**It's going to Prince Harry, who I don't even think is a prince anymore...** He said don't call me that,' McAfee then quipped in a subtle dig at [**King Charles**](https://www.dailymail.co.uk/news/king-charles-iii/index.html)' estranged son, later adding: 'See, why does the ESPYS do this sh\\*t?'\n\n**After 'Boston Connor' - a member of the cast on the Pat McAfee Show - described Prince Harry's nomination for the award as 'probably the most embarrassing thing I've seen in my entire life,' McAfee questioned whether the ESPY Awards' committee even did its homework on its candidate search in the first place.**\n\n'When you do something like this, **you know the immediate reaction from humans and sports fans and like people with common sense and brains is going to be like ''Hey, don't be putting our f\\*\\*\\*ing guy with that guy,'** McAfee said before sharing his perception of Prince Harry, who founded The Invictus Games and served in the British Army.\n\n**'I don't know anything about him except for the South Park episode and what I've learned from the Crown.** \n\n'But like did his people know like ''you publicly put me up for this award. **You're just asking basically ever person that considers themselves American and saying ''this is bulls\\*\\*\\*'''.** Especially at a sports award type of thing... I assume he knew that. They didn't expect that?'\n\n\\*\\*\n\nA second member of McAfee's cast on-air - Ty Schmitt- also added fuel to the fire on Friday, calling the ESPYS Awards 'a gimmick.'\n\n'It's like you couldn't find an active US military member or someone who can't serve anymore because of something they did while serving, Schmitt further said. \n\n**'There are probably hundreds, if not thousands of people who they could have found who could have benefitted from this award. But instead let's give it to Prince Harry...'** \n\n**Replying to his buddy's point McAfee suggested to just 'make up' an award for Prince Harry.** \n\n**'How about it's like ESPY for royal family member who doesn't want to be called ''royal family member'' who loves sports,' he said.**\n\n&#x200B;",
        "num_comments": 199,
        "comments": [
            "I know lots of us say this on a daily basis, but Harry's utterly shameless. \n\n\nYou'd think, after the humiliating backlash he received for the Aviation Award, that he'd have more pride than to put himself in a situation where he's ridiculed for accepting awards he knows he doesn't deserve. Even MM was too embarrassed to turn up at the Aviation Award. \n\n\nI wonder if she'll skip this one, if the media backlash is just as bad as before?",
            "Glad to hear Americans are as annoyed by The Traitor's fake award as we all are. Sadly, after seeing the Markles in action, I don't believe any awards are genuine anymore. Maybe sports awards 🤔. Thanks for opening our eyes to the truth, Duke and Duchess of Dog Biscuits.",
            "It’s so stupid to put a former British royal receiving an American award.\n\nNow back to that court case where he deleted a bunch of evidence 🫠",
            "I wonder if the ESPY people realize that 3 of the 4 medals he wears are for attending his grandmother's parties?",
            "Haha this is the best!!! It makes me so happy to know the American sports community can’t stand this duo and find it ridiculous that Harry would win an American sports award. \n\nMcAfee has a lot of respect in the sports community here. His take is the right one and I bet the majority of Americans feel this way. \n\nI actually listen to McAfee almost every day, I’m a big sports person- and I’m also on this board everyday, to have my two worlds combine is awesome.",
            "They'll boo him right out of the building",
            "To give an award created for somebody so honorable to somebody as dishonorable as Prince Harry is utterly reprehensible.",
            "> Prince Harry, who founded the Invictus Games\n\nPerhaps someone will correct me and or give more details, but hazard did not originate the IG, somebody else did, it was thought that IG would be a good project for hazard to endorse.",
            "Will TOW be on stage with him and grab the mic???",
            "https://x.com/JeanWar11468199/status/1806865738449428487\n\nThere is a petition link on this tweet, if you’re able to sign it to get this award revoked please do. \n\nIf anyone has posting privileges please feel free to spread the word."
        ]
    },
    "Please sign! Change.org petition to ESPN \"to Rethink Awarding the Pat Tillman Award to Prince Harry\"": {
        "title": "Please sign! Change.org petition to ESPN \"to Rethink Awarding the Pat Tillman Award to Prince Harry\"",
        "score": 114,
        "url": "https://www.reddit.com/r/SaintMeghanMarkle/comments/1dr38qn/please_sign_changeorg_petition_to_espn_to_rethink/",
        "content": "[Pat Tillman](https://preview.redd.it/p7oi4809xf9d1.jpg?width=800&format=pjpg&auto=webp&s=a284571c6fb308d43b92981836d2c7c9067de95c)\n\n[https://www.change.org/p/request-espn-to-rethink-awarding-the-pat-tillman-award-to-prince-harry](https://www.change.org/p/request-espn-to-rethink-awarding-the-pat-tillman-award-to-prince-harry)\n\nHarry has done NOTHING to deserve this award. Giving the award to him is an insult to Pat Tillman, a genuine hero. From the petition:\n\n>Pat Tillman exemplified duty, honor, and sacrifice. He gave up his successful NFL career to serve his country after the 9/11 attacks, and tragically lost his life during his service. Awarding this honor to someone who does not reflect the award's intent diminishes its value and disrespects Tillman's memory.",
        "num_comments": 32,
        "comments": [
            "done ✔️ \n\nagain, pat tillman was a war HERO a true patriot and his name should NEVER have been associated with anyone like the shameless entitled bunker harry.",
            "Signed. I know this stuff often has zero effect, it CAN be great negative PR because if there are enough votes the rags pick the story up. It's happened before and I will take the 1000 cuts approach.",
            "It's great people are protesting, but I remember there was a petition to rethink Legend of Aviation award on the same platform and when it reached over 11k signatures it was shut down... or, as they said: put under review... so I'm afraid they will do exactly the same with this petition.",
            "Signed.",
            "✅",
            "Done",
            "I signed",
            "Signed!!",
            "✔️signed",
            "👍🏻"
        ]
    },
    "Award Should Be Renamed the DESPYs": {
        "title": "Award Should Be Renamed the DESPYs",
        "score": 137,
        "url": "https://www.reddit.com/r/SaintMeghanMarkle/comments/1dr1tkd/award_should_be_renamed_the_despys/",
        "content": "As in:\n\nDesperation\n\nDespicable\n\nDespised\n\nDespaired (De-spared)\n\nDespondent\n\nHarry and Meghan are nothing but poor sportsmen and bad actors in every sense of the word. An untrustworthy duo who would put self before service. This is not a humanitarian award. It's a griftarian award pure and simple.",
        "num_comments": 14,
        "comments": [
            "And DISGUSTING!!!\n\neta:  I love the OP saying it's a griftarian award!!!  So true!",
            "True that!",
            "The Grifter award",
            "I've heard that since Disney owns the ESPYs, they may not present Harry with an award now due to the destruction of evidence stories.",
            "My compliments. I tried so hard to spin that award name. Now, a DESPY certainly fits him like a glove.",
            "Destitute...",
            "Harry is probably very happy, that after leaving the royal family, he is now allowed to accept awards for „all“ he does. \n\nSounds weird to any normal thinking human being. But I really believe, in Harry‘s mind, he finally gets what he deserves and it would never cross his mind to kindly decline this farce of an award. ",
            "Excellent, THANK YOU and well said!! 👍🏻",
            "DESPYS AWARD= Diabolical - Exasperating  - Shunned - Pathological- Yachters - Sickening",
            "We need a flair - Griftarian 😜"
        ]
    }
}