{
    "[Official] Q3 and Q4 2023 Salary Sharing Thread - Share Your Current Industry Compensation, Location, and More": {
        "title": "[Official] Q3 and Q4 2023 Salary Sharing Thread - Share Your Current Industry Compensation, Location, and More",
        "score": 35,
        "url": "https://www.reddit.com/r/Salary/comments/13zul96/official_q3_and_q4_2023_salary_sharing_thread/",
        "content": "This is the template hopefully we can all follow - I've decided to do one of these every 6 months until further notice. You can view the previous one [here](https://www.reddit.com/r/Salary/comments/zzds8g/official_q1_and_q2_2023_salary_sharing_thread/).\n\n    Industry / Field:\n    Title: \n    Years of Experience:\n    Location:\n    Base Salary:\n    Bonuses:\n    Education:\n    Misc (Things like stock, one-time cash sign-on bonuses, anything else, etc...):",
        "num_comments": 118,
        "comments": [
            "this might be an ignorant question but how to you get the table that everyone posts with their salary each year?",
            "Annual TC is around $275k after 17 yrs exp (includes base, bonus, RSUs, retirement match etc..).  HCOL (nyc), senior tech role for f500 multinational financial org.  Tell me people: how am I doing?  I always feel like I should be making more, but I will also say that money has never ever been my #1 driver for seeking a role.",
            "Can someone ELI5 the charts I keep seeing? Im new to this subreddit but not Reddit. Ive searched like a mofo, but what am I looking at? Is it cumulative or is it each year its own line? But even more so, what am I supposed to do with the tax information? Financially literate, but confused",
            "If there is a specific role you're looking for (and you don't see comps here), feel free to DM or comment in this thread, and we can share the data we have.",
            "Where are people looking up this information? Is this from the SS website?",
            "How are you making over 60 an hour with 3 years experience when new grads start like 37-42? Are you not union?",
            "I'm an RN for 15 years and make about 82-85k a year no overtime. How are you pulling in 120k ??? I traveled for 6 years and made Six Figures doing that but being staff RN 80k is about the max I can find",
            ">Startup\n\nSo you guys decided on that salary being a startup? Better have great runway hahaha.",
            "your wife passed you this year, good for her!!",
            "What are you using to track combined salaries?"
        ]
    },
    "25M Corporate Sellout": {
        "title": "25M Corporate Sellout",
        "score": 2,
        "url": "https://i.redd.it/mjh2kf439j9d1.jpeg",
        "content": "Graduated in Spring of 2020. Business/Finance degree. T20. Grew up lower-middle class and only went to public schools.\n\nLanded a well-paying job right out of college, but left for a better lifestyle at a startup after ~1.5 years. Killed it and got promoted a few times. Left after ~2.5 years to a larger company. Current income probably in the low 200s. \n\nReally hate this corporate bullshit and am thinking of leaving it altogether. I feel incredibly burned out. I’ve saved probably ~50% of pre-tax income so I have a comfortable base. ",
        "num_comments": 2,
        "comments": [
            "The term sellout has always been weird to me. The goal of any type of business is to sell out. The options are either selling out, or not making any money. Keep making that money, and invest it wisely. Someday you'll want to start your own business, which might not be in finance, and then you'll really want to sellout."
        ]
    },
    "Broke 6 Figures at 25!": {
        "title": "Broke 6 Figures at 25!",
        "score": 21,
        "url": "https://www.reddit.com/r/Salary/comments/1dqzhka/broke_6_figures_at_25/",
        "content": "Just excited to share the achievement since I don’t have many to share it with IRL. It’s nice to see the hard work I’ve put in educationally and professionally get rewarded.\n\nFor those interested in the job, I work as a Business Analyst in a MCOL to HCOL area.",
        "num_comments": 5,
        "comments": [
            "Truth? Unless you know compound interest, fund investment you will live a great life 'on' that payslip! But learn wealth building, for u and future kiddies you will see what ure great sallary has and will do! #meaningfullmoney podcast",
            "Hey congrats do you have any certifications",
            "A handful of miscellaneous IT certifications, but none of them directly apply in this position except arguably the Scrum Alliance ones.",
            "Congrats ",
            "Respect bro"
        ]
    },
    "How much did I leave on the table?": {
        "title": "How much did I leave on the table?",
        "score": 53,
        "url": "https://www.reddit.com/r/Salary/comments/1dqmwc2/how_much_did_i_leave_on_the_table/",
        "content": "Recently interviewed internally to move from IT support to Software Developer IC1 entry level role.\n\n  \nPrevious base salary was 56,000 - but the last two years I made \\~63,000 with OT + other incentives (no longer eligible for OT)\n\n  \nI was expecting an offer around $65,000 for this new role. The offer was $70k and I accepted without negotiating. Obviously a bad move I should've at least asked for 75k\n\n\n\nSalary range for the position was listed 62,000 - 158,000 + eligible stock + bonus\n\n  \nI just got my first paycheck after being one the team for 2 weeks and I am just sitting here wishing it was more obviously. While I did technically get a 25% base salary raise and was expecting one around \\~15%, I feel like an idiot for not even asking. We have all seen the Developers starting salaries on here well over 6 figs. \n\n  \nHiring manager said there was over 1000 applicants for the position. I was internal and also had a clearance needed that I should've used for bargaining power. This is a huge company that is fringe top 5 in tech not technically FAANG but very large not really known for the crazy salaries though. ",
        "num_comments": 44,
        "comments": [
            "Bro you have a clearance and a referal for the company as a software developer. The clearance alone is 100k at another firm. That clearance is enough to get you elsewhere, there's not 1000 applicants for a job that require it",
            "Lol live and learn. Leverage current job to get another job for more money these are called life lessons my indian friend",
            "Youre entry level, you dont have much leverage to begin with. You also got more than you expected. Not sure why youre feeling regret. If youre looking at the range, youre at the lower end of it for a reason.",
            "Sounds like you left at least $88k on the table",
            "Estimate where your years of experience and abilities place you relative to the rest of the universe and interpolate.  Be realistic.  If you are relatively inexperienced compared to the rest of the universe and company you are probably in more or less the right spot.  Its late to do much right now.  Maybe a bit down the road you can revisit this, especially if they like you and you get any sort of market intel that says you should be higher.",
            "Your entry level, you probably don't have a computer science degree, therefore, you can't command the same huge salary yet. \n\nKeep this job for a year and then look for something better.",
            "Use Glassdoor, it should have plenty of data for a large company.\nPlan to jump companies in a year or so to jump another large percentage.",
            "How can it be not technically [a] FAANG? It either is or isnt.",
            "It depends, but honestly probably not as much as you think. Do you have a level attached to your job? I.e. software developer 2 or software developer 1\n\nThe range they posted could encompass multiple levels. Meaning you wouldve hit a number (probably around $75k-80k) where youd have to be hired at the next level up and probably dont qualify for. Large companies want everyone neatly sorted in their level boxes to maintain internal equity.",
            "So youre making $70k but what are your other components? How much bonus? How much stock?"
        ]
    },
    "Salary Negotiations": {
        "title": "Salary Negotiations",
        "score": 3,
        "url": "https://www.reddit.com/r/Salary/comments/1dqyvdq/salary_negotiations/",
        "content": "Hi everyone, I’ll try to be concise. Both companies are government contractors (tech), company two is a small start up with about 10 people.\n\nOffer 1 (software engineering): 145k, no sign on. Better benefits, will sponsor a full scope polygraph (currently only have a CI). 10 minute drive.\n\nOffer 2 (software engineering-esque): 150k, 5k sign on bonus. Benefits are okay. 30-40 minute drive.\n\nI am 100% ready to walk away from offer 2 and keep offer 1. I countered offer 2 asking for $170k-$180k due to better benefits and the poly sponsor from company 1, but I am now wondering if I countered too high. Just trying to get some thoughts.\n\nI currently have 4 years of experience and it’s in the MD area.\n\nThank you!",
        "num_comments": 12,
        "comments": [
            "That drive differential is significant.",
            "Personally Id take 1. That drive. Fuck that",
            "As someone who has consistently driven 35-70 minutes for work, so option 1. If option 2 accepts the counter, consider it but remember that your day commuting only is as good as traffic. \n\nMy drive home from work now is 1hr+. There was an accident today and made it almost 3 hours.",
            "Negotiate with first offer too",
            "Seems like a good counter if your leaning towards option 1 anyway",
            "10 minute drive all freaking day.",
            "CI is worthless, thank you for your service but you need a full scope to keep working as a civilian post-military.  J1 is the best due to the value of a FSP.  \n\nI assume you were military (CI and living in MD) although there are a few ways civilians could get them lol",
            "Thank you for such a detailed response, I appreciate it!",
            "This is the answer. In big tech the value of the benefits is given so you have the picture of Total Compensation.",
            "My thoughts:\n\n-$5k sign-on bonus seems pretty small, and in the grand scheme of things, relatively insignificant\n-$5k higher salary isn't enough in my opinion for the increased commute time\n-Better benefits make a huge difference in your overall compensation. Maybe see if you can find out what the dollar equivalent of each company's benefits packages are and see if that makes offer 1 actually a higher overall compensation package than offer 2.\n-My job offer experience has been that the company will ask what your compensation requirements are upfront, and they tell you whether or not it's within the range of the requisition. Typically, a counter of maybe $5k above the original amount you give them has a pretty good chance of being accepted. But if your counter is rather large (which yours is), it pretty quickly turns them off, regardless of benefits differences between it and another offer.\n-With offer 2 being a small startup, you can likely expect yearly raises to be larger than at a big defense contractor. However, the chances of being laid off are also higher, so there is a significant risk difference between the two.\n-Also, if you're asking for the higher salary largely based on the differences in benefits and the poly screening, consider that this suggests you'd have to pay more out of your pocket for health-care related things and the poly you want, which could put you in the same place, net.\n\nI would personally lean towards offer 1, especially considering the commute difference. But I also have a family, and if you don't, you might be more willing to take the risk.\n\nWith only 4 years of experience so far, you have plenty of time to grow into higher salary grades, especially if you're a high performer. It may be slower with offer 1, but the opportunity is certainly there. Example: I have about 7.5 years of experience (2 companies so far, full time at both, plus internship at the first company) and a master's degree. I started at $67k in 2017, moved to another company in 2018 making $82k, and now make over $114k because of my performance over the years. $47k jump over about 7 years ain't too shabby, and I'm sure you could get something around that in the same amount of time."
        ]
    }
}