{
    "Welcome to SaltierThanKrayt, everyone!": {
        "title": "Welcome to SaltierThanKrayt, everyone!",
        "score": 827,
        "url": "https://v.redd.it/ppiwj21zfpr31",
        "content": "",
        "num_comments": 35,
        "comments": [
            "You have got zero idea how much I love this",
            "Perfect timing to find this sub after I inadvertently wound up reading some insane tweets by the Fandom Menace people today.",
            "Hold on, I need to make a 6 hour rebuttal on YouTube.  Let me finish my video on why Alita is objectively awesome",
            "Holy shit, time to sub!",
            "*Darkness rises, and light to meet it*",
            "God, I love this subreddit!",
            "Just discovered this sub ...\n\nThis actually made me laugh out loud in the middle of my lecture thanks!",
            "Hey, thanks for this sub.  Just when I thought all of my happy places had been ruined, along comes this ray of friggin' twin sunshine!",
            "Imagine living your life as a mental midget ANGRY people like what youre mentally incapable of liking due to you hating your own fandom. \n\nLove this.",
            "Lol these guys need therapy!  Brb while I create and frequent a subreddit thats obsessed with their every move"
        ]
    },
    "The worst people having the worst takes": {
        "title": "The worst people having the worst takes",
        "score": 560,
        "url": "https://www.reddit.com/gallery/1dqzwnx",
        "content": "",
        "num_comments": 19,
        "comments": [
            "thank you gear 5 luffy",
            "That Nickmercs clown must've picked up landlording as a side gig because trans folks are living in his dome rent-free.",
            "No I call him a pedo because he is one and being a Chud is almost a prerequisite to be one.",
            "Oh dont forget Brett cooper dropped a vid talking about it being false accusations a day before he came forward  god the far right are so fucking dumb.",
            "I love the quartering so much because when I was like 14 and deep into the red-pill rabbit hole his takes were so blatantly bad when I saw the people around me agreeing with him it made me reevaluate my life and gtfo.",
            "The way theyre permanent set up in regressive skulls, youd think there isnt a housing crisis.",
            "Right wingers: Well theyre just ALLEGATIONS HES NOT A PEDOOOOO\n\nDr. Pedophile: so anyways the allegations are all true and thats why I was banned from Twitch ",
            "Perfect description of the situation",
            "\"LGBTQ+ ARE PEDOS JUST BY EXISTING, my friend is just instilling Traditional Family Values in youth.\"",
            "Honestly one of the best Circlejerk subs Ive found."
        ]
    },
    "The quartering defending Dr Disrespect because of course he is": {
        "title": "The quartering defending Dr Disrespect because of course he is",
        "score": 2317,
        "url": "https://www.reddit.com/gallery/1dqprrp",
        "content": "",
        "num_comments": 524,
        "comments": [
            "Mind you we don't know exactly how old the minor Doc was sexting was. The \"17 years and 364 days old\" is **insane** cope",
            "They keep using the is a 18 year old dating a 17 year old a pedophile? argument to defend a man who was 35 when this took place (and we have no idea how old the other person was)\n\n35 years old not 18 or anywhere near that.",
            "The amount of its not pedophilia its ephebophilia motherfuckers on the Dr. Minorconnect subreddit is out of hand. Im certain theyve got the age of consent of every state memorized.",
            "At this point it's really just a matter of when Quartering gets outed for inappropriate conduct and not if, holy shit.",
            "I honestly dont even understand this situation. Wasnt Dr. Disrespect just a streamer who rarely, if ever, weighed in on political/cultural issues?\n\nNot sure why TheQuartering even feels like this is an appropriate hill to die on considering Dr. Disrespect isnt contributing to his stupid culture war one way or the other.",
            "If a person defends a pedo, they are sus themselves",
            "I dont care if he meets the technical definition of pedophile or not. I really dont. His actions were completely inappropriate and thats true regardless of whatever label you think he does or doesnt deserve.",
            "Right wingers constantly prove that they dont actually care about pedophilia, they just want to try to make people hate the LGBTQ community.",
            "You see, that argument on the last slide would've held some water if Doc was like 18...19...20. Hell i'll be generous and give you 25 even. He is 42. Forty fucking two. My dad's 45 and my sister is just about a year younger than the girl. This is not justifiable in any way",
            "Underage, even by 1 day, is still underage. Full stop. But it was never about protecting children with these guys."
        ]
    },
    "which is it drinker fans? has he always been a right wing grifter or is he apolitical and just hates “bad writing”?": {
        "title": "which is it drinker fans? has he always been a right wing grifter or is he apolitical and just hates “bad writing”?",
        "score": 131,
        "url": "https://i.redd.it/s41ttu2h5h9d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "I mean that poster isnt wrong. He has always been pitical.\n\nThe people who are writing those comments - a lot of them were literally children when they used to watch him.",
            "So they want politics on everything or not?",
            "Being political is good now actually",
            "People who say things like that usually strike me as either hardcore centrists who ignore (or don't pick up on, which is fine good on them for figuring it out eventually) on more subtle problematic things or just like right wing people who see him and are like I am not that right wing. The poster is trying to gotcha leftists (or liberals) but most leftists would've been unlikely to like him in the first place.",
            "i know hes right lol. thats the point. whenever we say hes just a right wing grifter who doesnt give a shit about writing but about women and minorities taking leading roles he thinks straight white men should have, they always say hes not even political he just criticises bad writing\n\nmy point is theyre undermining their whole argument for this dunk lol",
            "he has always been political but i mean the \"how did it take liberals this long\" is so ironic and hypocritical when it took Drinker and his fans 4 seasons of The Boys to realise they were being made fun of...",
            "It's because they're acting in bad faith like basically every other person online, they know he is right wing and political in his commentary and choices but in the same vein as \"he's a comedian don't take him seriously\" they use that talking point as a shield.\n\nThere's a lot of bad writing out there, hell a lot of it even concerns things like male power fantasies or emotions, but for some reason he only picks up on art containing certain topics or characters.",
            "\n\nIts such a pathetic attempt to use our mockery of them against us that rings completely hollow.",
            "yep i agree. exactly my point. they have the game away on that talking point when they all suddenly agreed here that hes always been right wing cos they thought it lets them dunk on 3 screenshot comments",
            "Why do I get deja vu here..?\n\nConservatives never had an original idea, this is an attempt at making \"The Boys always been political\" as their own. That's where the deja vu comes from!\n\nIf Drinker has been political then his gripe with The Message or \"bad writing\" is a fucking lie."
        ]
    },
    "Reviews don’t matter if they’re good": {
        "title": "Reviews don’t matter if they’re good",
        "score": 54,
        "url": "https://i.redd.it/t31kw3xv1i9d1.jpeg",
        "content": "Reviews of The Acolyte are okay because they align with their views and there’s no way they’re being manipulated. \n\nBut reviews of ROS aren’t okay because they’re good, don’t align with my views and are obviously being manipulated. \n\nWhich is it guys? At least be consistent in your hate and views on rotten tomatoe reviews.",
        "num_comments": 19,
        "comments": [
            "Meanwhile, the critics are mixed. What it is, guys? Are the critics paid by Disney or not?",
            "The movie came out 5 years ago. People aren't going to keep writing reviews this long after release. Most people don't care",
            "Consistency is their enemy. Consistency means accountability and that can't happen.",
            "Statistically impossible\n\nNo, its actually statistically the most likely outcome. 10,000 is a statistically relevant sample size, so the results you see at 10,000 are likely to be the same at 20,000 or 100,000 or 1,000,000.",
            "Everything is a conspiracy unless they're conspiring.",
            "Statistically impossible, actually statistically possible. Its been while since I took college statistics, but if I recall, if you have a large sample size with a relatively small margin of error, the chances of it changing beyond the margin of error are slim. There would have to be outside forces or straight up manipulation to drastically change the result, like a bunch of butthurt soy boy Star Wars fans, that think that women and POC shouldnt have the spotlight, manipulating the results.",
            "\"Statistically impossible\"..\n\n..what? Why is this clown confused that two very large sample sizes reach the same average -- especially additively.",
            "Im just confused because did they all forget that they did this? Redditters showered this stupid movie with positive reviews because it owned the last Jedi and contradicted it and gave them everything they wanted. They are correct that the rating is too high and thats because of them and people like them. They wanted to own the last jedi and this movie gave them all their stupid wishes like Rey being related to someone and an explanation for snoke etc. So they did the opposite of the Acolyte and gave it tons of positive reviews to send the message to Disney. Im not saying that every positive review for this movie is from people like that. Just like how some reviews for the acolyte that are negative are just because people genuinely dont like it. There are definitely people who like this one but the reason its so high is because of them.",
            "Exactly. Make up your mind. You cant have it both ways. But that would require moral integrity.",
            "Do I have to buy my ticket online to leave a review? Cause I typically just show up to the theater and buy my ticket with my popcorn"
        ]
    }
}