{
    "Welcome to SaltierThanKrayt, everyone!": {
        "title": "Welcome to SaltierThanKrayt, everyone!",
        "score": 827,
        "url": "https://v.redd.it/ppiwj21zfpr31",
        "content": "",
        "num_comments": 35,
        "comments": [
            "I was linked this subreddit from r/StarWars and decided to check it out. This single post has not only caused me to laugh more than usual, but it has also convinced me to join this subreddit. Well done!",
            "You have got zero idea how much I love this",
            "Perfect timing to find this sub after I inadvertently wound up reading some insane tweets by the Fandom Menace people today.",
            "Hold on, I need to make a 6 hour rebuttal on YouTube.  Let me finish my video on why Alita is objectively awesome",
            "That’s fantastic.",
            "I sense...irony",
            "This is brilliant!",
            "Holy shit, time to sub!",
            "*Darkness rises, and light to meet it*",
            "u/Vredditdownloader"
        ]
    },
    "The quartering defending Dr Disrespect because of course he is": {
        "title": "The quartering defending Dr Disrespect because of course he is",
        "score": 1878,
        "url": "https://www.reddit.com/gallery/1dqprrp",
        "content": "",
        "num_comments": 423,
        "comments": [
            "This is the guy that made a video guide on how to hide CP on a work laptop btw\n\nFound the [video](https://archive.org/details/helpful_hints)",
            "Mind you we don't know exactly how old the minor Doc was sexting was. The \"17 years and 364 days old\" is **insane** cope",
            "They keep using the “is a 18 year old dating a 17 year old a pedophile?” argument to defend a man who was 35 when this took place (and we have no idea how old the other person was)\n\n35 years old… not 18… or anywhere near that.",
            "The amount of ‘it’s not pedophilia it’s ephebophilia’ motherfuckers on the Dr. Minorconnect subreddit is out of hand. I’m certain they’ve got the age of consent of every state memorized.",
            "At this point it's really just a matter of when Quartering gets outed for inappropriate conduct and not if, holy shit.",
            "https://preview.redd.it/lcc6feg41d9d1.jpeg?width=974&format=pjpg&auto=webp&s=d9aabb4b8fe5cc308f6ba419d6a524d3823bddde",
            "I honestly don’t even understand this situation.  Wasn’t Dr. Disrespect just a streamer who rarely, if ever, weighed in on political/cultural issues?\n\nNot sure why TheQuartering even feels like this is an appropriate hill to die on considering Dr. Disrespect isn’t contributing to his stupid culture war one way or the other.",
            "If a person defends a pedo, they are sus themselves",
            "Dr. Disrespect: I had inappropriate contact with an underage fan.\n\nIdiots: He's innocent\n\nDr. Disrespect: I had inappropriate contact with an fan. ^((Edited))\n\nSmart people: You deleted the underaged part.\n\nDr. Disrespect: I had inappropriate contact with an underage fan. ^((Edited))\n\nIdiots: He's innocent",
            "I don’t care if he meets the technical definition of pedophile or not. I really don’t. His actions were completely inappropriate and that’s true regardless of whatever label you think he does or doesn’t deserve."
        ]
    },
    "The worst people having the worst takes": {
        "title": "The worst people having the worst takes",
        "score": 276,
        "url": "https://www.reddit.com/gallery/1dqzwnx",
        "content": "",
        "num_comments": 11,
        "comments": [
            "thank you gear 5 luffy",
            "Nickmerc is an asshole ",
            "https://preview.redd.it/eo10f4lg4f9d1.jpeg?width=1170&format=pjpg&auto=webp&s=664f46edf278e47c44e1ba9b7ec4501f7e1d3c57",
            "That Nickmercs clown must've picked up landlording as a side gig because trans folks are living in his dome rent-free.",
            "Based Luffy.",
            "https://preview.redd.it/cmqtlif7ff9d1.jpeg?width=1079&format=pjpg&auto=webp&s=8bf845bf5b0dd11bedd237eccf2229a9a044cc17",
            "The circlejerk is leaking",
            "Perfect description of the situation ",
            "https://preview.redd.it/uglw3v807g9d1.jpeg?width=1164&format=pjpg&auto=webp&s=9ef46b86f96d126e258ce2fcbb9474f315af8271",
            "Honestly one of the best Circlejerk subs I’ve found."
        ]
    },
    "This is beyond parody": {
        "title": "This is beyond parody",
        "score": 647,
        "url": "https://i.redd.it/zy7mtqpvbd9d1.png",
        "content": "",
        "num_comments": 93,
        "comments": [
            "A ''liberal'' pick me? Self hating ''liberal''? Probably just a ''classical liberal''.....",
            "https://preview.redd.it/hdrvzyaogd9d1.png?width=680&format=png&auto=webp&s=05b44ebd4ba9a4aac176da9ad912ef7a4fcaf211",
            "The *Liberal Agenda*... funny, there is only one group that calls it the *Liberal Agenda* and it ain't liberals.",
            "\"I vote for left wing parties but still am homophobic\"",
            "Who was that dork in 2017 that kept tweeting shit like \"I'm in a coffee shop in Detroit and the liberals at the table behind me just said 'I don't want to say it out loud, but Trump is doing a really good job, were we wrong?'\" Because this is basically that!",
            "Let me guess, a \"classic liberal\" who voted for Obama twice, then Trump twice, and is absolutely voting for Trump a third time but it's really the fault of the radical left.",
            "No liberal says “liberal agenda” unironically.",
            "What’s the saying now, “*scratch a Liberal and a fascist bleeds*”?",
            "As a far-left marxist leninist anarchist stalinist communist radical LGBT man, does anyone else hate all the things that I am? Please call me smart. Please. Please. Please. Please. Please. Please. Please. Please. Please.",
            "Big \"As A Black Man\" energy. 😑 \n\nThe closest thing to \"liberal\" I can imagine is like the Bernie Bros who immediately jumped on the Trump Train out of pettiness like Joe Rogan, otherwise CD fanboys are very much MAGA down to Drinker, himself being a DeSantis fanboy."
        ]
    },
    "I love David Tennant more and more as the years go on. ": {
        "title": "I love David Tennant more and more as the years go on. ",
        "score": 878,
        "url": "https://i.redd.it/8dlpcipztc9d1.jpeg",
        "content": "",
        "num_comments": 116,
        "comments": [
            "Considering he just played a female to male Doctor, this isn’t a shock.",
            "Imagine being on the opposite side of David Tennant.\n\nYou might aswell accept that you're evil.",
            "David tennant always keeps on taking a W",
            "And that is why He's my favorite Demon and why K.A. Applegate is my young adult writer.",
            "JK is really choosing a weird hill to die on. I checked her twitter account recently and there's literally nothing about Harry Potter, it's just her debating random people who should normally have no effect on her life whatsoever. I thought she was initially doing this because she's a massive attention seeker who was afraid of Harry Potter becoming irrelevant but she's REALLY fallen far down this anti-trans rabbit hole and it's really pathetic. Like she's gone way beyond TERF, she doesn't care about feminism anymore, just misgendering every trans person ever.",
            "JK chose her enemies poorly lol. Tennant is the golden boy icon for so many people of a certain age group.",
            "Common David Tennant W",
            "“Gender taliban”? She’s so weird  ",
            "What a chad",
            "When you agree with the Prime Minister of the UK, that’s when you know you’re an evil wench."
        ]
    }
}