{
    "Daily Support Thread | June 29, 2024": {
        "title": "Daily Support Thread | June 29, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/samsung/comments/1dr7tzr/daily_support_thread_june_29_2024/",
        "content": "Welcome to the Daily Support thread for [r/Samsung](https://www.reddit.com/r/samsung/). You can use this thread to ask questions about your device, troubleshoot tech problems or ask buying/selling advice.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found here: [Detailed Rules](https://www.reddit.com/r/samsung/wiki/index)\n\nJoin our [Discord](https://discord.com/invite/Qp8D7HtQVy) for immediate help & Samsung Support if you can't find the answer you need.\n\nNote: Comments are sorted by /new for your convenience.\n\n**The new Daily Support Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** If this time is near when you want to post your question, it is advised to wait for the new thread to be posted.",
        "num_comments": 2,
        "comments": [
            "Hello, we have a Galaxy A90 5G (SM-A908N) secondhand bought from South Korea. i've already confirmed that LTE is usable in my country. 5G is a different matter as our area currently isnt within 5G coverage. Now I'm wondering if there's anything I should do before and after factory resetting the device? I've atleast memorized the path to the language settings to change it back to English and there's also the matter with samsung account. This device isnt planned, just something someone I know felt like buying unaware of the variants and country compatibility.",
            "The phone should be factory reset in the settings and not the recovery."
        ]
    },
    "[Invitation] Galaxy Unpacked July 2024: Galaxy AI Is Here": {
        "title": "[Invitation] Galaxy Unpacked July 2024: Galaxy AI Is Here",
        "score": 32,
        "url": "https://www.reddit.com/r/samsung/comments/1dp1k04/invitation_galaxy_unpacked_july_2024_galaxy_ai_is/",
        "content": "https://news.samsung.com/global/invitation-galaxy-unpacked-july-2024-galaxy-ai-is-here",
        "num_comments": 26,
        "comments": [
            "be interesting to see exactly what is being released.   The only device I might be interested in is the ring.   If it has the ability to make mobile payments, I will most likely get it.  If not, forget it.",
            "No subscription for the ring🤞",
            "I'm excited for the ring, but I refuse to buy If there's a monthly subscription",
            "This year I’m focused on the Z flip 6, watch 7, and the ring. Perhaps buds pro 3 but I’m ok without an upgrade from the pro 2 unless I get a sweet deal. The wife already said she’s buying me the ring if it’s under $500 haha",
            "What all are we expecting here? S25 is definitely another half a year away since the 24 line was announced in January. The ring will definitely be something I'm interested in but I'd really like to see some updates to the WearOS for watches.",
            "Do you guys think they'll be announcing the Galaxy Buds 3 pro? I need to buy new earbuds but i want to wait until they release just because its been about 3 years since the buds 2 released",
            "The desired s24 ultra camera update that has been delayed since April? Haha",
            "If they put dex on the flip I'm getting it. Gotta be one of three people on the planet with this opinion",
            "I love my Watch 4 Classic but feel it's definitely time for an upgrade. I want to check out the new Buds Pro too. The 2 Pros have been fantastic, so I'm hopeful we get a pretty cool upgrade!",
            "So far the rumours about Z Fold 6 cameras aren't encouraging. I hope the camera quality will be more in line with the S24 Ultra's."
        ]
    },
    "Class action for bricked phones post 6.1 update?": {
        "title": "Class action for bricked phones post 6.1 update?",
        "score": 20,
        "url": "https://www.reddit.com/r/samsung/comments/1dr0h86/class_action_for_bricked_phones_post_61_update/",
        "content": "Perfectly functional S21+ pre 6.1 update. Post update the screen is completely black. This phone is all OEM and unmodified. \n\n  \nAbsolutely livid and will likely end up spending hundreds on replacing a perfectly responsive screen that simply does not display after the update.   \n\n\nReset, started in safe mode, cleared cache, performed reset. Can't rollback with smart switch. Many others are having the same issue. What a fucking disaster. \n\nWhere's the class action? This is absolute bullshit.",
        "num_comments": 10,
        "comments": [
            "Having the same issue. Will NOT be getting another samsung phone.",
            "We had s21 ultra and it said no sim.  We took to att and they replaced the sim and nope. No sim\n..",
            "Oh my gosh! I had the same problem! I was worried I was going to have to get a new phone, but thankfully, getting an e-sim worked so my phone is still functional. Interesting to know I wasn't the only one.",
            "I remember one Mrwhosetheboss video about this exact issue with Samsung smartphones. Batteries suddenly started to get inflated but only for the devices which aren't in use.",
            "Can't you just flash older firmware? I was able to flash multiple firmware on my S23, but I didn't have any problems on the phone. \n\n\nMy first flash was to see if I could make my carrier unlocked phone a factory unlocked phone. It worked perfectly,  then decided to see what would happen flashing previous firmware again worked perfectly. \n\nI have flashed 4 different firmware on my phone all went well. \n\nSo I know S23 will flash different firmware without any problems, don't know about older phones. \n\nIt's worth a shot though.",
            "It's Odin + a factory specific rom for your phone. I'm going to be a problem at a brick and mortar store in a last ditch effort, so in the snowball's chance they will replace it I don't want to void any warranty. \n\n\nPerfect. 3 so far. Now all we have to do is file and wait 5 years for a 100 check in the mail lol",
            "Yea. I'm not about to void any warranties\n\nI'd ask ppl at work, but we all closed for the summer...\n\nAlso, it's Samsung. You can't just unlock the bootloader",
            "The best part - while searching for an old backup phone I found a battery bloated S8 that pushed off the back glass. So at least one faulty Samsung product allowed me to find the other faulty Samsung product that was going to burn down my house...",
            "I could definitely be wrong, but I think companies now get people to agree to arbitration in class action lawsuits, so it’ll get thrown out as an ‘elected’ investigator will conclude no foul. Although an update bricking your phone is definitely grounds for support as that is horrendous. Thats Microsoft levels of incompetence.",
            "Yea. Heard about that an awful lot. Glad I disabled updates on phone and Google acct.\n\nI feel bad for you guys though.\n\nMost people don't think to cancel updates like I do ( i cancelled bcuz they happen at worst possible time)\n\nSue 'em\n\nReally, really sue 'em. I'll join in your fight\n\nIt's my first and last Samsung. For shame!°\n\n( ps I think there's a way to downgrade but I'll have to look into that)"
        ]
    },
    "Samsung has just revolutionized smartphone telephoto cameras": {
        "title": "Samsung has just revolutionized smartphone telephoto cameras",
        "score": 48,
        "url": "https://www.reddit.com/r/samsung/comments/1dqrohb/samsung_has_just_revolutionized_smartphone/",
        "content": " https://www.digitalcameraworld.com/news/samsung-has-just-revolutionized-smartphone-telephoto-cameras",
        "num_comments": 59,
        "comments": [
            "ISOCELL HP9 is already used on Vivo X100 Ultra. And while it is definitely an awesome telephoto sensor, I doubt Samsung is going to use it on S25 Ultra, they care too much about profit lol.",
            "Hype is fine but it needs to be backed up. While the Ultras are fantastic all rounders, Huawei, Chinese top dogs and Apple/Google are still ahead of Samsung, and it is a shame, as Samsung certainly has the resources to compete in the camera department IMO. (not a camera guy and a S21 Ultra main here)",
            "Needs more optical zoom.    \nMegapixels is not a substitute for optical zoom.   \nUnless you like noise in your photo.",
            "It's crazy because the Xiaomi 14 Ultra, Vivo x100 U, and Oppo flagships are better all rounders now then Samsung. The only thing the S24U has left is the pen and it's magic box identity (also OneUI but that's subjective.) Sammy is just cutting to many corners and it's starting to show.",
            "The article talks about the HP9 which is already being used by Vivo. Samsung will not use this which is a shame",
            ">rounders, Huawei, Chinese top dogs and Apple/Google are still ahead of Samsung\n\nLast time I saw most people preferred the samsung cameras",
            "To have more software overhead to process that, less accurate color reconstruction without more complex algorithms and worse low light performance when not binning?\n\nTo be honest I don't understand why Samsung keeps going for needlessy high MP sensors when they could achieve better results with \"more standard\" 12 or 50 MP sensors while having an easier sensor to produce, faster shutter speeds, better low light performance when not binning and so on...",
            "Yep. Imho Samsungs are no longer worth the prices they're asking new. Refurb I'd be tempted by an S23 and my S21U was a good deal but new absolutely not.",
            "i don't think one ui is subjective at this point\never since oneplus got rid of oxygen os there isn't really anything that tops one ui",
            "They will because samsumg always uses the best one in their own phones"
        ]
    },
    "Microphone issue on my s23 ultra": {
        "title": "Microphone issue on my s23 ultra",
        "score": 3,
        "url": "https://www.reddit.com/r/samsung/comments/1dr6pug/microphone_issue_on_my_s23_ultra/",
        "content": "My S23 Ultra Mic isn't working Properly After the The Recent updates.The mic is fine when Speaking local calls.but when I use mic via Third Party Apps it's obscure.Any Help Will be appreciated.",
        "num_comments": 3,
        "comments": [
            "Goto the phone call *#0*# from their run a microphone and loop back test that will hopefully give some info for it not working if it's still not working after that but as you say works on a normal call could possibly be that the apps aren't upto date or somethings wrong clear cache and data failing that restart the device",
            "I did the loop back test all three mic's seem to be working fine .tried restarting the device, too. The issue is still there",
            "Okay since the mic is fine which 3rd party apps are you having trouble with?"
        ]
    }
}