{
    "My nephew is missing. If you’ve seen him please call 714-960-8811.": {
        "title": "My nephew is missing. If you’ve seen him please call 714-960-8811.",
        "score": 75,
        "url": "https://i.redd.it/00nkjxuphu8d1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "I've seen him! Literally today",
            "so sorry. i hope he is found safe soon! what are the mysterious circumstances? it could help people know where to look.",
            "Here’s more information - Red 1999 Acura CL. TX plate RKM-6548",
            "So sorry you’re going through this. Hope he is found hale and hearty",
            "There have been news reports lately about how the SDPD has used license plate readers to find cars/solve crimes. I don't know what it takes to get your nephew's plate into the system, but maybe call the SDPD and find out?",
            "Was he depressed or anything like that? \nGot broken up with? \nDid he go to Mexico often??",
            "Very sorry to hear about this. Will keep an eye out. \n\nAny indication on where in San Diego he might have been headed? Any spots/areas he frequented?",
            "Tijuana! Post in that subreddit",
            "Will keep an eye out in Phoenix.",
            "If your lying right now we got beef "
        ]
    },
    "Where in San Diego can I do this?": {
        "title": "Where in San Diego can I do this?",
        "score": 779,
        "url": "https://i.redd.it/jn2f8gg2wd9d1.jpeg",
        "content": "",
        "num_comments": 205,
        "comments": [
            "I think people are mistaking the surroundings (art deco diner) for the solitude conveyed in Hopper's painting.\n\n\nWhere can OP have a quiet drink in the presence of other people lost in contemplation? ",
            "You better wear the suit and hat too. Don't half ass it",
            "Chilis",
            "Sunny Donuts on Claremont Mesa Blvd",
            "Black Cat",
            "Nunus Tavern in Hillcrest. Quiet. Dark. Good place to watch the game",
            "The alibi in Hillcrest. Cash only. Open 6 am - 1:30 am",
            "Rudford's",
            "Dobsons",
            "Bullys"
        ]
    },
    "over san diego tonight": {
        "title": "over san diego tonight",
        "score": 48,
        "url": "https://v.redd.it/14k9nvh1ng9d1",
        "content": "",
        "num_comments": 16,
        "comments": [
            "![gif](giphy|k42bRtpBJt9OLbLERg)",
            "Seen over here in Long Beach",
            "What time was this? Tonight's Falcon 9 would have been back on the water by 8:30pm, and this looks later (darker) than that, but could it possibly have been the Falcon 9's payload (of multiple satellites) at a later stage of ascent?",
            "That's space debris burning up on re-entry",
            "SpaceX Falcon 9 launch",
            "Not likely. That was astronomical, not man-made.",
            "It was 100% a Falcon 9 launch.",
            "this looks like something breaking up in the atmosphere, but not quite like a meteor",
            "We watched and recorded that. It launched at 8:14pm. Looked nothing like this",
            "The launch was four hours ago."
        ]
    },
    "DUI checkpoint in Chula Vista today. Don’t drink and drive(ever). ": {
        "title": "DUI checkpoint in Chula Vista today. Don’t drink and drive(ever). ",
        "score": 63,
        "url": "https://www.reddit.com/r/sandiego/comments/1dr2g2p/dui_checkpoint_in_chula_vista_today_dont_drink/",
        "content": "",
        "num_comments": 46,
        "comments": [
            "Every Saturday they do this, they will hold your car and your life will be in the shitter for 7 years and 500 bucks for insurance a month…. \nNot to mention 3000 to take your car out of Tony’s towing",
            "I think DUI stops are really to catch drivers that don’t have insurance or warrants. I could be wrong, but that was certainly the case in Fresno and drinking is a top activity there.",
            "How about not sharing so they catch actual drunk drivers during the holiday weekend. One of the most dangerous weekends to drive. You’ve already got drunk asses here in the comments asking where to avoid it. Why give a warning then say fuck drunk driving, you’re literally encouraging it lol",
            "Why advertise this on here? Just let the PD or SO do the minimum required advertisement.",
            "Where in Chula Vista?",
            "Eatlake School prolly and\nOlympic or telegraph",
            "Why remind people of DUI checkpoints? Just let the idiots get in trouble.",
            "You’re also banned from Canada",
            "Oddly specific lol.  But for real don’t drink and drive",
            "Sorry bro :("
        ]
    },
    "San Diego Sky": {
        "title": "San Diego Sky",
        "score": 32,
        "url": "https://v.redd.it/zszex683ng9d1",
        "content": "Just seen over Rancho San Diego, wtf is that?? ",
        "num_comments": 8,
        "comments": [
            "It’s the autobots!\n\n![gif](giphy|im1xKpjEwdQuk)",
            "See y’all at the battle of Taiwan",
            "The spacex launch was successful. I'm guessing it's either a defunct satellite deorbiting itself. Possibly something of Chinese origin. They have a tendency to not consider where debris might end up when space junk comes back to earth.",
            "Did the rocket explode?",
            "4th of July starting early?",
            "Bioartilleryluminescence",
            "![gif](giphy|ryx1cIFUW1vyUEZjN9|downsized)"
        ]
    }
}