{
    "Lifting the fog": {
        "title": "Lifting the fog",
        "score": 1,
        "url": "https://www.reddit.com/r/sanfrancisco/comments/1dhvcnw/lifting_the_fog/",
        "content": "Please enjoy this space to discuss local things like upcoming events, new sights you’ve spotted around the city, or mundane little sanfranciscoisms that strike your fancy. You can even self-promote a little here if you abide by the rules in the sidebar. Have a good day!\n\n[Archive of past discussions](https://www.reddit.com/r/sanfrancisco/search/?q=author%3Aautomoderator&sort=new&restrict_sr=on)",
        "num_comments": 1,
        "comments": [
            "Went to Saluhall yesterday and it was really cool!  Definitely worth checking out.  Might have just gotten lucky but also pleasantly surprised by the street conditions on Market."
        ]
    },
    "CA consumer protection committee APPROVES Restaurant junk fee exemption SB 1524 ": {
        "title": "CA consumer protection committee APPROVES Restaurant junk fee exemption SB 1524 ",
        "score": 748,
        "url": "https://v.redd.it/mwhjw73h1z7d1",
        "content": "",
        "num_comments": 245,
        "comments": [
            "Let’s collectively identify and stop supporting businesses with hidden fees.",
            "Ballot prop, anyone?",
            "Imagine trying to say that it’s essentially consumers jobs to balance the pay discrepancies between front and back of house. Please don’t support restaurants that still put these bs fees.",
            "Isn't Weiner cosponsor?",
            "Absolute horseshit.",
            "Drain the swamp.\n\nYou can watch our consumer protection committee turn into the restaurant protection committee at the link below. Starts around 2 hours 19 min. Half the committee is on their phones the entire time and doesn't seem like they care\n\n[https://www.assembly.ca.gov/media/assembly-privacy-and-consumer-protection-committee-20240618](https://www.assembly.ca.gov/media/assembly-privacy-and-consumer-protection-committee-20240618)",
            "This is pathetic. We deserve price transparency!",
            "Shame on these pathetic politicians.",
            "Time to reprint and post their menus with all fees, taxes, and \"suggested\" tips included in the prices.\n\nFor example:\n\n*French Onion Soup — $21.99*\n\nbecomes\n\n*French Onion Soup — $29.59 / $30.10 / $31.35*\n\nIf you won't be honest, we'll be honest for you.",
            "Consumer protection eh?"
        ]
    },
    "Cool to see the city still has a skate world renown scene ": {
        "title": "Cool to see the city still has a skate world renown scene ",
        "score": 364,
        "url": "https://v.redd.it/51tphk3yst7d1",
        "content": "",
        "num_comments": 34,
        "comments": [
            "How much points is that on Tony hawk?",
            "San Francisco was in every professional skateboarding magazine/video in the 90’s/early 2000’s. It is known for being one of, if not the best city in the world for skateboarding. It’s incredible how many major skateboard companies started in SF.",
            "I saw this yesterday and thought it looked like SF based on the trees and gray sky. So cool to see my baseless vibe check validated haha",
            "I would have eaten 94 shits trying to do that.",
            "Someone should loop this so it never ends.",
            "Dope!!",
            "If you like this please warch This Old Ledge on YouTube. Will scratch your itch for skating, sf history, and sf architecture.",
            "That! Was beautiful!!",
            "Watch GX1000",
            "Seen yall before on top of the hill Santiago near KFC"
        ]
    },
    "Faux Victorian House": {
        "title": "Faux Victorian House",
        "score": 250,
        "url": "https://v.redd.it/dk59lknea08d1",
        "content": "While walking my dog around market street today I noticed this lovely purple “house” that was cleverly disguising a modern apartment complex. It looks really nice and keeps the charm of the neighborhood ",
        "num_comments": 35,
        "comments": [
            "I don’t think this is just a facade. Rather it is a historic building to which an addition was added.",
            "Not a modern apartment complex but rather the SF LGBT center.",
            "I understand that in this case this is a historically preserved façade, but has anyone else ever wondered why developers don't make more buildings that look like this? I hate the look of new construction but I'd move into a faux Victorian...",
            "Thanks to SF preservationists, the facade was kept when they built the LGBTQIA+ building. 🥰\n\nEdit: I just realized (hybrid 🍃 will do that to ya), the vibrant pinkish-purple behind it, it connects to the modern portion of the LGBTQIA+ building. A friend of mine knew someone who worked there and gave us a tour. The Center's offices are located in the true Victoian home.",
            "Many original SF victorians are an elaborate facade on front of a plain box anyway, so it's fitting.",
            "I dont hate it, at least they made the effort.",
            "I wish they’d do this to every building in my neighborhood they ruined with stucco.",
            "Still cool",
            "I… I don’t care. I still like it! And I bet that a lot of other people like it too.\n\nIn fact, I am convinced that you could build an 800 ft skyscraper with near-zero opposition in uber-NIMBY North Beach or the Sunset if you just made the facade “Victorian” like that!",
            "cool where on Market is this?"
        ]
    },
    "Reminder that representative Scott Wiener, co-author of SB1524, is on Reddit.": {
        "title": "Reminder that representative Scott Wiener, co-author of SB1524, is on Reddit.",
        "score": 309,
        "url": "https://www.reddit.com/r/sanfrancisco/comments/1dlfm4t/reminder_that_representative_scott_wiener/",
        "content": "You can tag your representative u/scott_wiener in posts or comments expressing your opposition to this bill, or when posting receipts with Wiener fees ",
        "num_comments": 45,
        "comments": [
            "FYI this bill passed the Consumer Protection Committee with zero fucking objections.\n\nGet mad at the entire political class representing California.",
            "I think Scott Wiener overestimates the amount of financial support he can get from a bunch of loser restaurateurs (who can’t figure out how to be profitable without deceptive pricing) while simultaneously underestimating just how pissed off this makes people, across the political spectrum. \n\nLike, if you’re wealthy the actual total on your bill isn’t going to sway you from going out, so hidden fees have no upside: they are only ever going to make you feel disrespected and lied to. If you’re not well off hidden fees could be the difference between whether you can afford to go out at all, and not being upfront about how much a meal costs is just fraud. It’s so completely stupid and such an easy political win to ban them. It makes no sense to let restaurants do this. ",
            "He’s a state senator not assembly member. But yes, use this to express opposition to this stupidity. Restaurants have some of the most annoying hidden fees. ",
            "Hey Scott. I refuse to vote for you if this passes.",
            "Wiener Fees 😂",
            "[SeeFees.Ca](http://SeeFees.Ca)",
            "Posting his response on Reddit about this: \n\nhttps://www.reddit.com/r/sanfrancisco/comments/1d9nnc2/senator_scott_wieners_bill_will_allow_restaurants/l7fu855/",
            "Geez, what's worst is that the timing on this is just *perfect* to be when he's essentially immune from voter backlash.\n\nWe've just had the primaries and now, in order to vote for anyone else, I'd have to vote for someone who says that enacting transphobic legislation would be one of her top priorities. There's basically no chance that our district votes for this person.\n\nIt appears that Scott Weiner has no problem selling us all out when we don't have a way to hold him accountable.\n\nLet's make sure everyone remembers this when his term ends and he runs for his next office.",
            "Wiener's a representative of the Restaurant Association, not of us.",
            "Good idea. might be just as useless as sending his office an email or phone number."
        ]
    }
}