{
    "/r/SanJose Classifieds: Jobs, For Sale/Rent, etc.": {
        "title": "/r/SanJose Classifieds: Jobs, For Sale/Rent, etc.",
        "score": 0,
        "url": "https://www.reddit.com/r/SanJose/comments/1dp53ah/rsanjose_classifieds_jobs_for_salerent_etc/",
        "content": "There are a lot of people in this city, and sometimes we want to advertise on this subreddit. Please keep all posts in these biweekly threads. \n\nExample topics:\n\n* Items for sale\n* Items for purchase\n* Rentals\n* Surveys\n* Jobs",
        "num_comments": 4,
        "comments": [
            "Greetings",
            "How much?",
            "Make an offer"
        ]
    },
    "Is there no love for condos?": {
        "title": "Is there no love for condos?",
        "score": 27,
        "url": "https://www.reddit.com/r/SanJose/comments/1draxu4/is_there_no_love_for_condos/",
        "content": "I've noticed over the last decade, condos have barely appreciated or even gone down. Take a look at this listing: https://www.zillow.com/homedetails/150-Saratoga-Ave-UNIT-320-Santa-Clara-CA-95051/19601049\\_zpid/? It's a remodeled 3/2 1442 sq feet condo in Cupertino schools but only got 842K.  \nA nearby remodeled 3/2 1506 sq feet SFH with the same Cupertino schools netted 2.933M https://www.zillow.com/homedetails/371-Manly-Ct-Santa-Clara-CA-95051/19601561\\_zpid/!\n\nPeople will say yeah but the condo has HOA cost and the SFH has a yard and you can build an ADU on it.\n\nI'd say sure, but would you be willing to pay over 2M additional for that privilege? No amount of HOA fees will make up a 2M difference. Is there no love for condos?",
        "num_comments": 37,
        "comments": [
            "In a condo you own the right to live in that space, you don't own the land or the building, just the space.   In SFH you own the land, the structure, everything.  \n\nSo, in one case you own a right to something, in the other you actually own something.",
            "I have a 3/2 condo with a small backyard that I bought 11 years ago. I pay 1450 mortgage because I refinanced when the rates were low. My condo value has roughly doubled in that time from 415 to 750-800 now. I’m happy with it. The low cost helps me live a much better life than if I was killing myself to pay for a SFH mortgage.",
            "Condos don't appreciate in value as quickly and HOA fees can add a ton of costs to the total ownership. I bought and sold a condo and I'm so happy to be out from my $700+ monthly HOA fee. \n\nThey're not a bad option for someone looking to buy and build equity in real estate but they're not great as investments and have high costs due to HOA",
            "Living with other people and making key decisions with a group I don't know well... ongoing fees, although sfh have those too... plus the pandemic showed us that congregate settings can be unsafe and the wfh people can go anywhere ",
            "Politicians keep saying more homes but I would argue we need more condos.  Not everyone is going to be able to afford a single-family in the bay area.",
            "Buying a condo is a lifestyle choice not an investment decision.  If you think you can live there forever, definitely do it. It will save you money (housing is a cost in the end of the day) in the long run and provide a comfortable lifestyle and give you less worries about paying it off in the future.  \n\nA SFH will appreciate more in the long run, but if you plan to stay in that SFH forever you will never realize that gain.",
            "Covid really pushed people towards larger homes and more space. \n\nCondos had already lagged SFH for appreciation so that added additional pricing pressure.",
            "Old condos in this area also has parking challenges. High rise condo with enough parking ane other facilities can ve attractive but low story old condos in this area are not that attractive. And still HOA is too high.",
            "I'll pay almost anything not to share walls/buildings with other people.",
            "OP, point taken that condos are significantly cheaper than townhomes and SFHs, but there are many downsides that justify the cost of upgrading. You don’t own the land or structure of a condo. Depending on the layout, you may share multiple walls with neighbors (not to mention upstairs/downstairs neighbors as well). No garage for tools/cars/projects. No yard. Less overall privacy. Some SFH and townhomes may have an HOA, but every condo requires a HOA fee due to the shared building\n\nIf it works for your budget and lifestyle, more power to you. But for many people, the downsides push them toward townhomes and SFHs and that is what is driving the slower appreciation"
        ]
    },
    "Another fire, 87 near the airport": {
        "title": "Another fire, 87 near the airport",
        "score": 169,
        "url": "https://www.reddit.com/gallery/1dqyw19",
        "content": "",
        "num_comments": 54,
        "comments": [
            "It’s gonna be a rough couple of months.",
            "Thank you residents of the Guadalupe trail",
            "Yep. Smell the smoke in downtown, what is this three Friday/Saturdays in a row?",
            "Drove by this on the way home from work.  It is right next to the airport, with huge plumes of smoke as planes are coming for landing. How is this not a massive safety hazard?",
            "I had to call in a fire this morning I saw someone who was unwell set fire to a clothing donation bin then run off screaming about pyramids. It happened quick. Called the police and they would look for the person but sadly I doubt it. It was around 8:30AM.",
            "I was reading on Strava that there are a fair number of dogs the homeless have and they are not leashed.  Someone got bitten and it looked pretty bad.  I recommended they needed to see a doc ASAP because of the risk of rabies.  Then a lot of people starting mentioning their dog stories.\n\nI won't bike GRT at all any more.  There are homeless all along there.  I remember when it wasn't too bad.  But it got worse during covid and then the homeless moved into the Milpitas area and I decided to avoid it.  Too many crazy ones.",
            "Edit: “Another HOMELESS fire, 87 near the airport”",
            "Yep. Passed by and saw the police officer call it in while I was biking past the airport.",
            "I live in view of this area and I can tell you now with certainty there will be *at least* one fire there a week. I think one week recently there were 3 days in a row of fires. Fun times.",
            "Drove right by it on the way home. Went on my evening walk near Park Ave and saw a mofo lighting a plastic bag in a pot."
        ]
    },
    "PSA - Stop honking at people who are yielding to pedestrians ": {
        "title": "PSA - Stop honking at people who are yielding to pedestrians ",
        "score": 426,
        "url": "https://www.reddit.com/r/SanJose/comments/1dqr3yh/psa_stop_honking_at_people_who_are_yielding_to/",
        "content": "I experience and see this a lot. When someone stops at a green light, consider that they may be yielding to a pedestrian or waiting for an obstacle to clear. Breathe deep, humble yourself, and realize that waiting 5-10 seconds won't make a difference in your day and could save a life \n\nJust saw someone honk at a car yielding to a man with a blind walking stick. Absolutely disgusting selfish behavior from the honking car",
        "num_comments": 108,
        "comments": [
            "Cars should be equipped with two horns: a friendly, \"Wake up, the light changed to green\" beep-peep, and an alarming \"Oh my god, STOP we're all gonna die!\" HOOONK.",
            "Fuck these idiots. when somebody does that I then take it extra slow to make the turn.",
            "I don't drive and always make sure to flip off the people who honk at those who stop for me",
            "Also annoying: honking at a car that can't turn right on red because of oncoming traffic. Or: honking at a car that has to yield to oncoming cars, when making a left turn.",
            "I like running on the sidewalks around my neighborhood.  I appreciate the drivers who make a safe path for me.  Twice today drivers were more cautious than I need.  Was not necessary but appreciated.  Have had days when I'm shaming drivers cutting me off in the crosswalk.  I'm not talking about stopping in the crosswalk.  I'm talking I would have been hospitalized if I had entered the crosswalk.",
            "Amen. And DO NOT ANGRILY ZOOM AROUND THE CAR AHEAD OF YOU.\n\nYou may be ramming right into the person crossing in front of the car ahead of you, who you don't see.",
            "And then the people honking turn right and end up waiting at another stop light... No difference at all",
            "Too many people need the honk because they're busy texting.  It's easy to forget the guy ahead is not moving for something legit.",
            "Lost a few too many family friends to hit and runs. Hate these people",
            "I did it once in error. I was the 2nd car in line waiting to turn right. As it turned out, there was a pedestrian across the street  crossing in the crosswalk across 4 lanes of traffic toward us. The pedestrian was blocked from my visibility due to the car in front of me. I waited a good while trying to figure out why the car in front wasn’t turning. The driver was looking down (presumably at a phone) so I thought they literally didn’t know the light changed. I didn’t realize they were waiting for a pedestrian to cross 4 lanes of traffice toward us. Literally 1 second after I honked, the pedestrian came into my view as the entered the last lane closest to us and I instant felt like a turd. But, also, consider my patience that the amount of time I waited before honking was how long it takes a pedestrian to walk 3 lanes of traffic. \n\nSo yeah, sometimes people are disgusting and selfish, and sometimes they just don’t have visibility and think people are texting at stop lights and not paying attention."
        ]
    },
    "When you live near a BAE Systems": {
        "title": "When you live near a BAE Systems",
        "score": 122,
        "url": "https://i.redd.it/kvrxc4b1nd9d1.jpeg",
        "content": "",
        "num_comments": 27,
        "comments": [
            "Off of great oaks you used to be able to see all the tanks coming off the freeway but they cover them now",
            "I used to love driving past FMC on Coleman as a kid and seeing all the tanks",
            "Bernal & Santa Teresa. My neighborhood.",
            "duck its got you in its sights",
            "Right. It took 1024 software developers to put this particular bad boy together",
            "So your advice is to not tailgate these trucks? Gotcha.",
            "Ey uhh where exactly is this BAE Systems?",
            "Didn’t know. I was a crew member for one. Fun to shoot but a bitch to clean.",
            "I saw that on my way up to donner going the opposite way. It was heading west.",
            "You could also see and hear rocket engine tests at nearby United Technologies in that area. Those were fun."
        ]
    }
}