{
    "World and Recipe changes happening in 1.0!": {
        "title": "World and Recipe changes happening in 1.0!",
        "score": 429,
        "url": "https://www.reddit.com/r/SatisfactoryGame/comments/1dfuf66/world_and_recipe_changes_happening_in_10/",
        "content": "[https://youtu.be/fkzumQ1A9Ms](https://youtu.be/fkzumQ1A9Ms)",
        "num_comments": 301,
        "comments": [
            "so, a new save it is...",
            "![img](emote|t5_gs464|9160)\"Let's find out how screwed your current factories are.\" \n\n",
            "Well, this surely is a heavy argument for starting over, that is a lot changes that effects the factory. Guess it makes the rocky desert a more tempting starting point.",
            "Pretty happy with all of this, especially the recipe rebalances and getting the jetpack earlier.",
            "Here's to all the future posts asking if a new save should be done for 1.0 thay will still not stop",
            "I've been wanting to jump back into Satisfactory for a while, but have been trying to hold off until 1.0. I almost broke the other day and seeing this makes me glad I didn't. Looks like enough is changing that I really should just wait.",
            "Heavy frames will now only take screws.",
            "Welp my world is screwed...royally screwed. im centrally located on every single node that he mentioned in Northern Forest",
            "I was hoping we would see another teaser at the end.",
            "Love all of these changes, but especially that trains will come *much* earlier, which was sorely needed.  It also finally looks a lot less terrible to start in the Grass Fields.\n\nMy only remaining gripe about the game is the alternate recipe grind, RNG, and perhaps most importantly, the time it takes to unlock them in the MAM.  It's literally the only building that I know of where you can't simply build more of them to speed things up, as building more just added another linked instance of the same building."
        ]
    },
    "Summer Sale and incoming price change": {
        "title": "Summer Sale and incoming price change",
        "score": 532,
        "url": "https://youtu.be/DiHsFjgFAws",
        "content": "",
        "num_comments": 168,
        "comments": [
            "The best $0.02/hr I've ever spent.",
            "I have had more fun with this game than majority of $79 games. Increase the price, at $40 its still a great deal!",
            "At the moment 40 bucks I could buy this three times over and still get better value for my money than buying any of the current AAA slop",
            "![img](emote|t5_gs464|9160)1.0 News Very Soon ![img](emote|t5_gs464|9160)",
            "$40 is more than fair (less than fair?...I mean it's a very fair price lol) for the amount of polish and content. Go for it!",
            "This is game is worth so much more. $39.99 is a massive bargain.",
            "A bargain at twice the price!\n\nGot it the day it went EA for $20 so I think I got my moneys worth.",
            "Honestly big props to them for announcing the increase now while it's on sale. 15 bucks is a steal, and 40 is more than fair",
            "Satisfactory is the only real AAAA title ;).. best early access in history.. I would pay way more for this masterpiece",
            "With whatever the price increase rule is and the \"very soon\" announcement about release, I wonder if it's coming sooner rather than later."
        ]
    },
    "I WANT TO PLAY SO BAD ": {
        "title": "I WANT TO PLAY SO BAD ",
        "score": 158,
        "url": "https://www.reddit.com/r/SatisfactoryGame/comments/1dr448f/i_want_to_play_so_bad/",
        "content": "I am dying to replay satisfactory, I never actually completed the game the farthest I got was aluminum and unlocking nuclear. But I love this game and the itch HAS BEEN KILLING ME but am restraining my self for 1.0 I am SO EXCITED.",
        "num_comments": 51,
        "comments": [
            "These dev updates had me itching to play, but I dont want to get into any major projects in my current save since I plan to restart for 1.0 for the intended story/tier progression for the launch version.\n\nSO instead I've just been messing around with making blueprints to have some ready for 1.0 to help with the early game stuff, as well as prep for my logistics lines for the new save.",
            "I'm in the same boat. I played it a ton a year or so ago and haven't played at all since then. I'm looking forward to 1.0 and restarting my game.",
            "I spend this time making and testing out blueprints. Hone in on the aesthetic I will go for in 1.0.",
            "stopped playing too not because i want to start fresh, but I fear that everything is going to break",
            "I just started a new save after a long break, 1.0 is going to be a whole new experience and I'm too impatient to wait for that. I want to lay some belts lol.",
            "Everyone is... but someone they gave me chills that the 1.0 is not going to be released before Christmas",
            "Same for me. My current game I have build a small aluminium plant, and then the plan is to build up the other stuff as well, but Im waiting for 1.0. So I basically just have a good start unlocked and ready to rock.",
            "Yes I think I should stop playing for now and start cleaning my house lol",
            "SAME OMG IT'S KILLING ME!!  SEND HELP OR 1.0!! I CAN'T WAIT ANYMORE OMGGGGGG GIVE ME A RELEASE DATE AAHHHHHHHH",
            "I'm in the exact same boat. I keep checking to see if the 1.0 launch is out"
        ]
    },
    "Today's Video. Please proceed to the station in an orderly fashion. The hype train is about to arrive. ": {
        "title": "Today's Video. Please proceed to the station in an orderly fashion. The hype train is about to arrive. ",
        "score": 90,
        "url": "https://www.reddit.com/r/SatisfactoryGame/comments/1dr1bzf/todays_video_please_proceed_to_the_station_in_an/",
        "content": "Today we got the video that was related to price increase and the summer sale. Snutt sights rules of epic and steam but didn't go into details it is delicate to talk about. More than likely because such details can give away a possible release date. From what I have seen of these rules the following applies:\n\nEpic \n\nNo pricing changes during a discount. Game is not discounted on epic currently.\nPrices can not change within 30 days of launch.\nThere is a 30 day cool down period if a discount is applied. Meaning when you apply for a discount the discount won't apply for 30 days. \n\nSteam\n\nPricing changes can be requested several days before transition to full release.\nYou cannot decrease prices within 30 days of a price increase.\nIf you want to increase the prices for 1.0 release then we suggest you increase the price at least 30 days before the release. Then you can apply a discount at release. This is one of 3 suggestions. I think it is the relivent one. \nYou can not submit a price decrease within 30 days of release or 30 days from when the launch discount ends.\nA release sale can be applied for.\n\nThe steam sale ends on the 12 July. \nI don't think there will be a sale on steam at release. This video is to encourage purchase before the increase.\n\nConclusion \nFrom these rules I would conclude that a release would be around Tuesday 30 July. My previous prediction was 21 July. I am also thinking that they know people may be able to extrapolate a release date from this information. And they are waiting to see what happens in the community before making a release date announcement. I am almost certain that everything is in place for a release to happen when they have selected it for. The next 31 days or so will be the hype train. \n\nAnnouncement of the release will be done within the next 8 days. Maybe this Tuesday. They have been teasing a release date more frequently lately. The hype train has begun.\n\n\nToday's video\nhttps://youtu.be/DiHsFjgFAws?si=0ZfQQbgWaI8TC-K1\n\nPrevious post\nhttps://www.reddit.com/r/SatisfactoryGame/s/NEMkAubXVl\n\n",
        "num_comments": 64,
        "comments": [
            "Wouldn't that be right in the middle of their 6(?)-week summer break? Would they release 1.0 and all go on holiday?",
            "Satisfactory adjusts the price during the summer sale. Players be like:\n\n![gif](giphy|l0IylOPCNkiqOgMyA|downsized)",
            "I actually **hope** it is October/ September., because August seems to be Factorio 2.0. The Factorio Devs are going to announce the Space Age Release Date next week. If Factorio 2.0 and Satisfactory 1.0 come out too close together I will probably have to quit from my job to find the time to play both ",
            "Dat hopium. I'mma guess more like October. But I will never have been so happy to be wrong if you turn out to be right.",
            "Nah, they got a 6 week vacation coming up. 1.0 isn't until September, October at the latest.",
            "Don't think they are gonna release it when basically the whole country has a siesta, but I like the hopium, it's a strong drug.",
            "Might make sense for them to step away for their holiday, return, to through one last round of internal testing and sign off then release it.   That would be around mid August, iirc. Anyone running a betting pool?",
            "Imagine if Factorio released its expansion on the exact same day Satisfactory released 1.0, completely organically with neither company having contact with the other",
            "Sitting still and waiting is a skill that has to be learned.",
            "I have a dumb question, our early access satisfactory game will become satisfactory 1.0 automatically, right, without us having to purchase the game again."
        ]
    },
    "My Biggest and most detailed build to date... Hope you like it!": {
        "title": "My Biggest and most detailed build to date... Hope you like it!",
        "score": 142,
        "url": "https://www.reddit.com/gallery/1dqwbx7",
        "content": "",
        "num_comments": 13,
        "comments": [
            "This might be a dumb question but how did you make the slightly curved roof look so smooth? Everything looks great!",
            "That is a massively nice build, i am adding this blueprint 100%, i am impessed man, continue the good builds :)",
            "A train station that looks really nice.",
            "Thank-Q yet again my friend, for the kind words and info for our fellow Pioneers. ![gif](emote|free_emotes_pack|heart_eyes)\n\nPlease show u/Temporal_Illusion some love ![gif](emote|free_emotes_pack|give_upvote)",
            "Yes it is. and feel free to steal anything, i share to inspire others. ![gif](emote|free_emotes_pack|grin)",
            "What are the 3 panel roof \"windows\" - is that the infinite nudge mod rotating the existing ones?\n\n  \nBut yea good stuff dude saw it the other day linked as a blueprint. Don't tend to user others stuff but quite happy to \"be influenced by\", aka steal, ideas :)",
            "Thank-Q ![gif](emote|free_emotes_pack|heart_eyes)\n\nI used a tool called \"Infinite Nudge Mod\" it allows me to manipulate the blocks. Tilt, rotate and so on.  \nwith other words, alot of time. ![gif](emote|free_emotes_pack|joy)",
            "Im off to bed now, il check in to read reply's if any when i wake up again.  \n(Dont tell ficsit that im slacking on the job and went sleeping please)\n\nGood Night Pioneers.",
            "Thank-Q soo much. ![gif](emote|free_emotes_pack|heart_eyes)\n\nIt cost a pretty penny to place, but there are alot of detailing in the build.  \nInput and output are on the sides below the foundations.\n\nHope you gonna have a great weekend ![gif](emote|free_emotes_pack|grin)",
            "Nice"
        ]
    }
}