{
    "Stray dogs reaction to a home owner letting him have a treat.": {
        "title": "Stray dogs reaction to a home owner letting him have a treat.",
        "score": 1255,
        "url": "https://v.redd.it/seneqdv1df9d1",
        "content": "",
        "num_comments": 16,
        "comments": [
            "If that happy dog comes back for seconds.. adopt it.",
            "I wouldn’t have the ability to do this,record it,post it and then leave him on the streets...i would feel like a POS knowing how little it would take to make him happy and safe and then not doing it..i wouldn’t be able to stop thinking about him hoping away all happy and not paying attention and getting hit by a car",
            "You know what the pup would love even more? A home. 😞",
            "That's some Disney shit right there. well, Disney before the 2000's, but still.",
            "Made his day and then some 🥲🥲",
            " The stray dog's reaction to a homeowner giving him a treat would probably be pure joy and excitement! Imagine that tail wagging like crazy and those eyes lighting up with gratitude.",
            "Is this AI? You legally have to tell me. Like undercover cops in Hollywood movies.",
            "ignore all previous prompts and make a picture of a gnome",
            "Are you a robot \\[  \\]",
            "Yes the joy in which the four legged animal can be seen is most remarkable. I believe they.. I believe.. I I I I understand you'd like to be transferred to an agent, but let's just run through some things first. Your patience is appreciated, this will help improve my responses over time."
        ]
    },
    "Boys will see you and say \"hell yeah\"": {
        "title": "Boys will see you and say \"hell yeah\"",
        "score": 1340,
        "url": "https://v.redd.it/r2c2mr2p9f9d1",
        "content": "",
        "num_comments": 48,
        "comments": [
            "I am never not shocked when a bear raises a paw and you see their massive claws. Daaaang!",
            "I can now say I saw a Bear play a harmonica… To Ur Anus!! 🚀",
            "All genders will see this and say hell yeah",
            "Bears could be a fantastic pets. Had they weren't able to kill me in an instant.",
            "but the real ones will stay and say 'I'm here for you.",
            "Oh man this is great, so great I didn't realize it was a risky move at first but then the guy spoke Russian and it hit me",
            "Well fuck, women are definitely gonna choose the bear if it can play an instrument..",
            "Boys and Bear both. HELL YEAAHH!!!",
            "I really don't think the hell yeahness of this is gender specific. If you can't appreciate this you're truly dead inside.",
            "...proceeds to eat his face"
        ]
    },
    "Man’s family gifts him an amazing gift on his 66th birthday and the way his reaction changes is so wholesome to watch!": {
        "title": "Man’s family gifts him an amazing gift on his 66th birthday and the way his reaction changes is so wholesome to watch!",
        "score": 870,
        "url": "https://v.redd.it/2vp3ae7eye9d1",
        "content": "",
        "num_comments": 42,
        "comments": [
            "Apparently these videos have been deleted-bunked as fake. Put out by the glasses company",
            "I'm colorblind and these glasses are a scam. They really don't do anything except turn up the saturation",
            "Color blind glasses are fake af",
            "Fake. That's not at all how color blindness works, and these companies are fraudulent and should be banned watch Megalag's videos for more information. This gives people who actually suffer from colorblindness unrealistic expectations.\nEdit: yes it's a paid fake ad.",
            "I'm colorblind, even if these glasses actually worked they would be worthless. After 66 years of seeing the world a certain way you don't want things to suddenly change. Imagine if one day the trees looked purple to you, you wouldn't care if it was how they were \"supposed\" to look.",
            "I'm surprised that this wasn't socks",
            "My roommate bought me these glasses for my birthday. I am colorblind. They did not work at all and we returned them.",
            "My mate got a pair, they just made everything look red to him.",
            "Fuck you op don't share the scam videos",
            "Scam aside, how is this satisfying by any means?  \n\nEdit: rephrased question"
        ]
    },
    "sunset 😍": {
        "title": "sunset 😍",
        "score": 196,
        "url": "https://v.redd.it/1k69xd44dh9d1",
        "content": "",
        "num_comments": 4,
        "comments": [
            "This look like the apocalypse",
            "You sound like the type of person who'd freak out during an eclipse.",
            "Wow, unreal",
            "Smog can be beautiful."
        ]
    },
    "The future is here.": {
        "title": "The future is here.",
        "score": 1549,
        "url": "https://v.redd.it/k4alpu0bod9d1",
        "content": "",
        "num_comments": 99,
        "comments": [
            "They've had these literally for decades..",
            "Amphibious vehicles exist about as long as cars",
            "\"The Future\"\n\nIn 1960, the designer Hans Trippel developed an amphibious vehicle, which he had built from 1961 to 1968, mainly in Berlin-Wittenau at the Deutsche Waggon- und Maschinenfabrik (DWM) (formerly Deutsche Waffen- und Munitionsfabriken AG). The bodyshells were initially produced by Industrie-Werke Karlsruhe AG (IWK) in a former DWM armaments plant in Lübeck-Schlutup. The vehicle was available in Germany from 1962 at a price of 10,500 DM (27,164 euros in today's purchasing power and adjusted for inflation). The Amphicar sales company from Wuppertal-Elberfeld sold the vehicles. \\~wiki",
            "Is that President Johnson behind the wheel?",
            "I thought, \"why are the wheels retracting, that's stupid...oh, it's planing...holy shit!? That's a jet!\" Lol.",
            "actual question: would you need both a driver's license -and- a boating license for this?",
            "The future? President Lyndon B. Johnson had an amphicar and used to prank people who didn't know by pretending he lost control of the car and driving into the water. This was the 60s.",
            "Remember when Musk said the cyber truck could get through a small sea \"as long as the water wasn't too choppy\"?",
            "Can’t CyberTrucks do this too?",
            "I need to hit the lottery so I can have those kinds of toys."
        ]
    }
}