{
    "Pure visual delight.": {
        "title": "Pure visual delight.",
        "score": 702,
        "url": "https://v.redd.it/w61ews5al28d1",
        "content": "",
        "num_comments": 8,
        "comments": [
            "The mosquitoes are gonna go wild on her when she gets out 🔥🔥💀",
            "Nature is amazing!",
            "And auditory, sound on, it’s nice.",
            "Looks like Sweden",
            "Bring me there",
            "The dynamics between state and central governments are fascinating.",
            "Lol! That was my exact same thought!!"
        ]
    },
    "There is something about freezing a bubble at 9°F": {
        "title": "There is something about freezing a bubble at 9°F",
        "score": 2771,
        "url": "https://v.redd.it/zxygvsghm08d1",
        "content": "",
        "num_comments": 59,
        "comments": [
            "It said 12.8C where it should have being -12.8C.  as nothing freezes at +12C\n\nEdit, some chemical do freeze above zero.",
            "Wonder how brittle this is once frozen. Would love to touch one. Would also love popping it before it fully freezes to get some really thin ice petals",
            "Video needs to be about 3-5 seconds longer for the bottom to finish freezing",
            "Its not 12C its -12C 🙄",
            "Shrek theme ftw",
            "This would be a great video for demonstrating crystal formulation in materials. It’s a very similar process with metals, but much more difficult to see.",
            "They don’t break it!? 🥲",
            "I was waiting for them to shatter it.aww",
            "Fuck this presentation format",
            "*minus* 12 degrees Celsius"
        ]
    },
    "Perfectly aligned beauty.": {
        "title": "Perfectly aligned beauty.",
        "score": 708,
        "url": "https://v.redd.it/2alncr63t28d1",
        "content": "",
        "num_comments": 6,
        "comments": [
            "A satisfying threesome!😅",
            "I'm assuming it's a similar to the suspension table but with wildly different dimensions. But yeah, really cool",
            "My brain hurts. I understand it. Brain hurts anyway.",
            "If you \"follow\" the forces you can see its essentially turning the direction of force of gravity in the bottle in the opposite direction.\n\nSuper cool demonstration of mechanics",
            "Engineering is amazing! Also, every 8 minutes that milk is out of the fridge takes roughly a day off it’s shelf life",
            "It's fake even if the sticks supports the bottle which is unlikely due to them obviously slipping, then the center of gravity is put onto the second toothpick which tilts the bottle of the table"
        ]
    },
    "Naturally cubed Pyrite crystals ": {
        "title": "Naturally cubed Pyrite crystals ",
        "score": 11429,
        "url": "https://v.redd.it/x650s1bbcy7d1",
        "content": "",
        "num_comments": 250,
        "comments": [
            "How come they are so perfectly square?",
            "I'm enjoying the video eyes closed",
            "She’s literally moaning after every single pull. Was the Audio taken from a porn ?",
            "Before time began... there was the cube.",
            "Homegirl is WAY TOO excited about these minerals.",
            "DON'T WATCH THIS WITH SOUND ON IF YOU'RE NOT ALONE.\n\nYOU HAVE BEEN WARNED.",
            "Minecraft gold blocks",
            "Why the moaning “geolophilia”",
            "All I see are potential dice.",
            "Take that terrence „there are no straight lines in nature“ howard !"
        ]
    }
}