{
    "Which device is right for me? If you're new to the hobby - start here!": {
        "title": "Which device is right for me? If you're new to the hobby - start here!",
        "score": 326,
        "url": "https://www.reddit.com/r/SBCGaming/comments/1bl9oky/which_device_is_right_for_me_if_youre_new_to_the/",
        "content": "*Updated 2024-04-07; see change log in the comments*\n\n&#x200B;\n\nThis post is intended to give a broad overview to newcomers to the dedicated handheld emulation device scene who may not know what's reasonable to expect at what price point.  Something that can be counterintuitive to newcomers is that how hard or easy a system is to emulate doesn't always track 1:1 with how powerful we think it is.  We tend to think of the PS1, Saturn, and N64 as being contemporaries and roughly equal in power, for example, but in reality PS1 can run pretty well on a potato, N64 is trickier and needs more power than most budget devices can provide to run the entire catalog really well, and Saturn is notoriously difficult to run well and is stuck in the \"may be able to run some games\" category on many otherwise capable devices.\n\n&#x200B;\n\nIf you're a newbie that's been linked here, consider watching [this video by Retro Game Corps](https://youtu.be/fWrPCeFXv1s?si=WkdkkHpPH2TlB0Ae), a popular YouTuber and reviewer around these parts.  He goes over some of his favorite devices of 2023 in various categories, and while I don't agree with all of his picks and others have become outdated very quickly, it can be useful to see what some of these devices look like in the hand.  Links in this post are mostly to RGC video reviews or setup guides of these devices.\n\n&#x200B;\n\nAll that said, I've sorted various consoles you might want to emulate and various devices you might try to emulate them on into four broad \"tiers\":\n\n&#x200B;\n\n# Tier 1:  PS1 and Below\n\n* **Price:**  $40-$140\n* **Systems That Should Run Fine:**  NES, GB, GBC, Genesis / Megadrive, SNES, GBA, PS1\n* **Systems that \"may\" be able to run \"some\" games:**  Dreamcast, DS, N64, PSP, Saturn\n* **Chips to Look Out For:**  JZ4770, RK3326, RK3566, Allwinner H700, Allwinner A133Plus\n* **Devices to Consider:**  [R36S](https://youtu.be/1JazW_Rf0Ko?si=UTtuFZfahTEr87-5), [Miyoo Mini+](https://youtu.be/PfclsJzeyr0?si=5Z2tGGXV24hEirU3), [Powkiddy RGB10 Max 3](https://youtu.be/PVxSdVQwQ6s?si=WXZzvuNP7bGIK-A0), [Powkiddy RGB30](https://youtu.be/KTb6ik1Eb40?si=EAA3JETEyipx2LdC)\n\n&#x200B;\n\nAt this price point, consider watching [this broad overview comparing several standout devices](https://youtu.be/6UGr42nOv54?si=GXW7hZLyHl5J9YCE) under $100 in more detail than I'm able to hit here.\n\n&#x200B;\n\nI could easily have included a dozen more devices in the \"to consider\" section; there are a LOT of devices in this general tier, with lots of little differences in form factor, feature set, etc.  There are also a lot of older devices running the JZ4770 or RK3326 chips that are technically outdated, but if you're happy sticking with PS1 / SNES and below, they're still perfectly good and may have advantages such as a particular form factor you're looking for that newer more powerful devices don't have.  They may also be available on sale or lightly used for cheaper than newer devices.  Note that JZ4770 and comparable chips may struggle with a handful of the absolute hardest-to-run SNES and PS1 titles.\n\n&#x200B;\n\nThe newer RK3566 chipset and comparable Allwinner chipsets won't quite get you all the way to \"just-works, no hassle\" performance of N64 or any of the other systems in the \"some\" category, but they're not much more expensive (and may even be cheaper depending on what sales are going on and shipping costs to your part of the world).  I've listed the \"some\" systems in rough ascending order of how hard they are to run, but it's going to vary a lot depending on the individual game you're trying to play.  On N64, for example, Mario Kart 64 is a pretty easy game to run and will probably run fine on the RK3566 (I've had decent results on the RK3326), but Goldeneye or Conker's Bad Fur Day will probably not be playable.  Some N64 games run better or worse on different emulator apps or Retroarch cores, so you may be able to experiment with different options and/or enable frame skip to get some medium-weight games playable.\n\n&#x200B;\n\nKeep in mind that the PSP runs in 16:9, and most devices in this tier have 3.5\" 4:3 screens.  Even lighter PSP games that run okay performance-wise will not look good when letterboxed or stretched on such a small screen with such a drastic aspect ratio mismatch.  Keep in mind also that devices in this tier may or may not have touchscreens, which may limit what Nintendo DS games you can play even where performance is not a concern.  Most also have only one 4:3 screen, requiring you to use a hotkey to switch which DS screen you're viewing, further limiting what games you can usefully play.\n\n&#x200B;\n\nMost devices in this tier run Linux-based firmware.  Setup is usually very easy: download the firmware image, flash it to an SD card, drag and drop your ROM and BIOS files, and you're done.  Some devices, such as the Anbernic RG353V, RG353P, and RG353M, can dual-boot into Android.  This will give you access to different emulator apps that may be able to run some systems, especially N64, slightly better.  I personally don't consider this feature super worth it because the price on those devices starts to overlap with more powerful dedicated Android devices in the next tier.\n\n&#x200B;\n\n# Tier 2:  PSP and Below\n\n* **Price:**  $100-$150\n* **Systems That Should Run Fine:**  everything from Tier 1,  Dreamcast, DS, N64, PSP\n* **Systems that \"may\" be able to run \"some\" games:**  Saturn, GameCube, PS2, Wii, 3DS, Vita, Switch\n* **Chips to Look Out For:**  T610, T618, Dimensity D900, Snapdragon 845\n* **Devices to Consider:** [Retroid Pocket 2S](https://youtu.be/lKbgiyEr9JY?si=LraNbvCA2HFA8z5Y), [Anbernic RG405M](https://youtu.be/BD0ab1gr4gM?si=0bpSYZv9YiJGufjv), [Retroid Pocket 4 Base](https://youtu.be/1rsZGK5zxCM?si=ZF3PiECFICQApx6b)\n\n&#x200B;\n\nOnce again, there are a lot more devices I could have listed under \"devices to consider,\" including several older devices that are still perfectly good, but have largely been eclipsed by newer devices offering more power or better build quality at a similar price point.\n\n&#x200B;\n\nThe vast majority of devices in this tier run Android, which will require a much more involved setup process than the predominantly Linux-based handhelds in Tier 1.  Where Linux-based firmwares typically have all of the emulator apps preinstalled and preconfigured, Android-based devices typically require the user to manually install and configure each emulator app individually.  Expect a greater learning curve, but if you want good performance on systems that struggle in previous tiers like N64 and PSP, that's kind of the price of entry.\n\n&#x200B;\n\nDevices in this tier have a mix of 4:3 and 16:9 screens in various sizes.  Although PSP should run between pretty good and fantastic from a performance perspective, keep in mind that if you have a 4:3 device, 16:9 PSP games may display too small or distorted to be a very good experience.  Keep in mind also that when playing DS and 3DS games on 4:3 devices, you will need to use a hotkey to switch screens.  16:9 devices will give you more flexibility for displaying both 3/DS screens at once, but smaller screens may limit how useful it is to try to display both screens side-by-side.  Most Saturn games should run just fine at native resolution in this tier, but I still listed it as a \"may / some\" system because it's a notoriously tricky system to emulate, some games may still experience problems, and I haven't tested it at all on any of my own devices.\n\n&#x200B;\n\nMuch like N64 and PSP in the previous category, PS2 and GameCube performance is going to be very spotty in this tier.  Many games will run, but expect to experience noticeable performance problems with many titles, to need to do a lot of tinkering with performance hacks and advanced emulator settings, and to deal with the fact that your favorite game may just plain not run well no matter what you do.  I would caution the reader, when looking at video reviews of older devices such as the Ayn Odin 1 Lite and Pro, to consider the date they were reviewed.  Newer devices (see the next tier below) have changed the landscape sufficiently that devices that were once considered as good as it gets for 6th-gen performance are now considered middling at best.\n\n&#x200B;\n\nThere are community-run spreadsheets that purport to tell you what you can expect from various games on various chipsets / devices, but I try to caution people to take them with a grain of salt.  These spreadsheets are crowdsourced with very little oversight.  Anyone can submit an entry; there is no requirement that you play a certain amount of the game or, frankly, that you know what you're talking about at all.  I've seen several entries that were clearly added by someone who ran around the first area for fifteen minutes and called it a day, as well as some that are just plain misinformation by any measure.  These spreadsheets can be a useful tool if you're looking for suggestions for what advanced settings to try tweaking, but they're dangerous as a buying guide.  There are also lots of \"footage roundup\" videos on YouTube, some more trustworthy, some less, showing various games running on a device.  Keep in mind that it's easy to cherrypick footage from the smoothest-running sections, and that the cycle skip settings necessary to get some games running at full speed / frame rate can introduce so much input lag that even though a game looks great on video, it feels terrible to actually play.\n\n&#x200B;\n\nAs a rule of thumb, if you're planning on buying a device in this tier and you want to try GameCube or PS2 on it, I'd ask yourself: if it turns out that your favorite GCN / PS2 games won't run well, will you regret your purchase?  If the answer is yes, I strongly urge you to move on to the next tier.  Yes, they're more expensive, but it's cheaper to buy one device that will actually do what you want it to do than to continually buy multiple devices that are only incremental upgrades over the devices you already own.\n\n&#x200B;\n\nSwitch performance is even iffier at this tier; expect only the absolute lightest Switch games to run acceptably, mostly indie and 2D games.  3DS is generally considered somewhat harder to run than PS2 and somewhat easier than Switch, but results will vary greatly depending on the individual game, and as with DS, may be limited by the device's screen.\n\n&#x200B;\n\nOn the other hand, systems like PS1, Dreamcast, N64, and PSP really shine in this tier.  Many of the devices in this tier feature high definition displays and enough processing power to dramatically upscale these systems.  Playing PS1 games at 4x upscale (which equates to just under 1080p) on a 6\" screen makes those old games look almost like an HD remaster, it's honestly kind of magical.\n\n&#x200B;\n\n# Tier 3:  Finally, 6th Gen\n\n* **Price:**  $200-$450\n* **Systems That Should Run Fine:**  everything from Tiers 1 and 2, Saturn, GameCube, PS2, Wii, 3DS\n* **Systems that \"may\" be able to run \"some\" games:**  Vita, Switch\n* **Chips to Look Out For:**  Unisoc T820, Dimensity 1100, Dimensity 1200, Snapdragon 8 Gen 2\n* **Devices to Consider:** [Anbernic RG556](https://youtu.be/AFUu3MYQ7NI?si=a2RxZOERTj-A2sW9), [Retroid Pocket 4 Pro](https://youtu.be/iCWn9U8HHHc?si=nqPBRDZaXGIcTyG_),  [Ayn Loki Zero](https://youtu.be/1PyQGY7TUEU?si=ZucXNU_p_TL-W2ya), [Ayn Odin 2](https://youtu.be/8T7smkAG4zA?si=T3bYO_9nBx0kh7ME)\n\n&#x200B;\n\nPerformance begins to vary wildly in this tier.  While everything listed above should run the vast majority of PS2 and GameCube games very well at at least native resolution and usually 1.5x-2x upscale or more, there can be a pretty big difference in experience between dual-booting into JELOS to get 6th-gen games running decently on the x86-based Ayn Loki Zero, determining exactly how high you can afford to push upscaling on a per-game basis on the Unisoc T820-based Anbernic RG556, and running virtually everything with all the bells and whistled maxed out on the SD8Gen2-based Ayn Odin 2.  So be sure to do your homework and know what you're getting for your money, because not all Tier 3 devices are created equal.\n\n&#x200B;\n\nSaturn emulation should be much more doable in this tier, but due to the state of the software, may require a certain amount of tinkering and/or switching between emulators and cores to get some games running smoothly and without glitches.  Similarly, on Android-based devices which are the vast majority of this tier, the state of PS2 emulation is held back by the fact that the only PS2 emulator worth mentioning, AetherSX2, is no longer under active development by its original creator.  While the vast majority of games will run more or less fine, some outliers will require some amount of tweaking to run properly, and it's possible that a small number of games will have problems that simply can't be fixed until/unless some other equally talented developer takes up the challenge of bringing PS2 emulation to Android.\n\n&#x200B;\n\nNintendo Switch emulation is still in the very early stages, and while devices like the Odin 2 theoretically have the power to handle it well, the software is not yet mature enough that you can sell your Switch console and rely only on emulation.  Some games will run well, others will be \"compromised but playable,\" and upwards of 40% of the library just plain won't work at all.  You'll need to futz with GPU drivers, you may need to test different games on different emulator apps (there are a couple major ones in various states of development or abandonment), Tears of the Kingdom probably won't run well no matter what you do, QoL features like save states and in-game menus may not be implemented, there may be strange graphical glitches or crashing, and in general, you have to be comfortable with a fair amount of tinkering and troubleshooting and prepare for the possibility of disappointment.  There are multiple teams working on improving Switch emulation and the scene is constantly evolving, so it's something to keep checking back on, but that's the situation at the time of this writing.\n\n&#x200B;\n\nThe state of Playstation Vita emulation is even rougher; even on devices that theoretically have the power to run it, many games are just plain not compatible with the currently-available emulation software.\n\n&#x200B;\n\nWhile this tier should handle many if not most Wii games fine from a performance standpoint, expect to require extensive per-game configuration to make any Wii game that relies on motion controls playable.\n\n&#x200B;\n\nIt's also worth noting that while high-end Android devices are theoretically powerful enough to run other systems, there is no emulation software currently available on Android for non-Switch, non-Vita post-PS2 systems such as OG Xbox, PS3, Wii U, Xbox 360, etc, and no reason to believe they will become available anytime soon.  There are a couple major Windows emulators aimed at bringing emulated PC games to Android in various stages of development, but so far they are very much for tinkerers, not easy turnkey solutions.\n\n&#x200B;\n\n# Tier 4:  Steam Deck and Beyond\n\n* **Price:**  $350-$1000+\n* **Systems That Should Run Fine:** everything from Tiers 0-3, Wii U\n* **Systems that \"may\" be able to run \"some\" games:**  Vita, OG Xbox, PS3, Xbox 360, Switch\n* **Devices to Consider:** [Steam Deck](https://youtu.be/BBf15Z2xoiY?si=4sQ4Qfo5jTi6aslu), [ROG Ally](https://youtu.be/cEvLOM3_lkY?si=0Z29OgGcSMVv5ruC), many others I don't know enough about to recommend\n\n&#x200B;\n\n\"Just get a Steam Deck\" has become something of a meme around here, because for a long time it was the only option for really good handheld PS2 performance, and it's still the cheapest device that can handle a lot of systems that just plain aren't available on Android such as Wii U.  For the price (especially now that factory refurbished and lightly used units are starting to become available), it's hard to beat as a value proposition.  Some people dislike how large and heavy it is, and depending on what you're trying to do with it, battery life can be a limiting factor.\n\n&#x200B;\n\nIn this tier we've moved away from Android.  The Steam Deck runs a proprietary Linux-based OS called SteamOS out of the box and can dual-boot into Windows and/or Batocera Linux.  Most other devices in this tier will ship with Windows and may also be able to dual-boot into Batocera.  This is good because it brings compatibility with a lot of emulator software that plain doesn't exist on Android as well as a huge library of PC games, but bad because we're using the less-efficient x86 processor architecture, which means that battery life takes a big dip in this tier.\n\n&#x200B;\n\nFrankly this is the point where I'm a lot less knowledgeable.  I own a Steam Deck and I love it, but although I've got it set up for emulation, in practice I use it almost exclusively for what it was designed for, which is light to medium PC gaming.  While there are a lot of devices more powerful than the Steam Deck and/or smaller / lighter than it is, they all kind of run together in my mind because they're typically much more expensive than the Deck is, and I already had a hard enough time justifying a $400 toy to myself.  (-:",
        "num_comments": 159,
        "comments": [
            "We should set up a bot that replies to every post with a link to this. Super useful and detailed, thanks for the effort!",
            "**Change Log:**\n\n  \n2024-04-07:\n\n*  Moved a block of text involving perceived power of emulated systems vs. how easy they actually are to emulate from Tier 1 to the intro.\n*  Dropped the disclaimer explaining the repost from the old guide.\n*  Added a mention of Russ' new \"Favorite Retro Handhelds Under $100\" video to Tier 1, as it maps very cleanly to that power / price bracket and goes into more detail on more devices than is appropriate for this guide.\n*  Removed the Anbernic RG35XX from \"Devices to Consider\" in Tier 1; changed YouTube link from the RG35XX vs. Miyoo Mini+ comparison video to the Miyoo Mini+ review.\n*  Removed the Anbernic RG353VS from \"Devices to Consider\" in Tier 1.\n*  Added the Allwinner H700 and Allwinner A133Plus to \"Chips to Look Out For\" in Tier 1.\n*  Changed the title of Tier 2 from \"Meet the T618\" to \"PSP and Below\" now that no actual T618 devices remain under \"Devices to Consider.\"\n*  Added the RG405M to \"Devices to Consider\" in Tier 2.\n*  Streamlined and condensed the first three paragraphs of the Tier 3 section.\n*  Made a pass through the entire guide to hunt for typos and improve readability.\n\n\n2024-03-22:\n\n* Reposted in order to change title so that it no longer implies that the information included is out-of-date.\n\n\n2024-02-24:\n\n* Removed Tier 0, as it is simply no longer worth spending time discussion devices incapable of full SNES and PS1 emulation when the RK3326-powered R36S is as cheap or cheaper.  Merged \"Systems that Should Run Fine\" section into Tier 1.\n* Removed the Powkiddy x55 from \"Devices to Consider\" in Tier 1.\n* Added the Powkiddy RGB10 Max 3 to \"Devices to Consider\" in Tier 1.\n* Removed the Ayn Odin Lite, Ayn Odin Pro, and Retroid Pocket 3+ from \"Devices to Consider\" in Tier 2.\n* Added the Retroid Pocket 4 Base to \"Devices to Consider\" in Tier 2.\n* Added the Anbernic RG556 to \"Devices to Consider\" in Tier 3.\n* Changed the price ranges in Tiers 2 and 3 to reflect changes in the \"Devices to Consider\" section and the drop in price of the Retroid Pocket 2S.\n* Altered the wording of the Tier 3 section to be more inclusive of the new Anbernic RG556.  Added a paragraph cautioning readers to expect to need extensive per-game control configuration for many Wii titles.\n* Significantly streamlined the introductory section, and changed the RGC video link from the older \"New to Handheld Gaming? Start Here\" video to a less comprehensive but more up-to-date \"Favorite Handhelds of 2023\" video.\n* Deleted the final paragraph, and made a pass through the entire post to correct minor formatting errors and enhance readability.\n\n\n2024-01-09:\n\n* Moved the Ayn Loki Zero to Tier 3 after further community feedback.\n* Added the Retroid Pocket 4 Pro to Tier 3 after impressions and review videos dropped from several prominent and trusted reviewers.\n* Added the R36S to \"Devices to Consider\" in Tier 1.\n* Removed some devices from various \"Devices to Consider\" lists after observing that they have not remained very commonly recommended in the community and/or have not received strong ongoing CFW support.\n* Adjusted price ranges of various tiers to reflect price drops or new devices added to those tiers.\n* Substantially rewrote the Tier 3 section to be less Odin 2 centric and to change references to the Odin 2 being \"upcoming\".  Removed paragraph about O2 input lag as those details are reflected in linked video reviews.  Added short paragraph about the states of Saturn and PS2 emulation.  Further altered the paragraph about Switch emulation to reflect the fact that is currently evolving quickly.\n* Removed paragraph about used Odins Lite and Pro as availability and prices appear to have largely stabilized.  Added a caution to consider the date of reviews when considering devices that were once (but are no longer) considered best-in-class for 6th-gen emulation.\n* Added Odin Pro to the Tier 2 \"Devices to Consider\" after an official and apparently permanent price drop to match the price of the Lite.\n\n\n\n2023-11-??\n\n* Changed the name of Tier 0 in response to community feedback\n* Added a paragraph about the Ayn Loki Zero and JELOS in response to community feedback\n* Altered the paragraph about the state of Switch emulation after personal experimentation using the Ayn Odin 2 Base.",
            "Feels weird that one of the sections is called \"Meet the T618\" and then neither of the devices recommended has a T618 chipset. It's not like a newcomer is going to have any context for what that means.",
            "Since it keeps coming up, you probably should mention that paying extra for something that comes with games isn't worth it because it's easy to get games and the SD cards are often low quality.",
            "Thanks, wish i had read that earlier .. it is quite helpful for newbies to decide on what to buy, the social media algorithm will keep you in same ecochamber, if you search miyoo mini it will keep showing that tier only .. i bought anarbenic rg355xh which should be good starting point but i would like something powerful later like aye odin 2 …\n\nThanks a lot for the enlightenment ",
            "Is there any chance anyone has a similar list that's geared more toward children? Something that isn't too expensive and doesn't have 15000 games on it, mainly because my son will probably be overwhelmed by something like that lol. \n\nSimply because I recently got a Switch that there's no way in hell I'm letting him handle something that cost £300 while he's 3 and a half years old lol. I just want something that, when he sees me with my Switch in my hand, I can say \"Here you go mate, have a go at this.\" \n\nSomething that has preloaded games like Sonic or whatever. Simple stuff.",
            "Tier 1 is missing the Trimui Smart Pro.  Its great for everything from Atari 2600 to PSP, and costs around $100 bucks, or less, depending on where you get it and if you get the sd card with it.",
            "This is amazing, i wish someone would do one of these for ultra small form factor pcs",
            "Been watching mass RGC videos and I feel informed yet confused.\n\nI want: \n\nsuper accurate emulation\n\nreally good controls\n\nreally good sound preferably stereo but if I have to use headphones that's fine\n\n4:3 Screen that's good (I used to sell TVs so I am kind of picky)\n\nFancy UI\n\nNES/SNES/GEN/GB/GBC/Neo Geo/Some MAME\n\nGlass screen that resists scratches\n\nI sort of want:\n\nAbility to connect to TV via HDMI and bluetooth controllers\n\nMetal body\n\nA USB port either full USB A I can use straight up or with a USB C adapter for controllers\n\nI don't want:\n\nJoysticks although I am not opposed if the thing just happens to come with them they can be nice sometimes\n\nNot sure about how I feel about the sideways orientation on a 4:3 screen I am pretty decided on a gameboy layout unless there is something I am missing. There was one model that reminded me of neo geo pocket color that seemed pretty cool I just don't want full wide nintendo switch size. \n\nIf I have to start screwing around with CFW I don't mind a little bit of tinkering either I just don't want to have to constantly mess with it. \n\nThe nerd in me is like get Odin 2 but it's just too large. Im thinking either rg35xx plus or rg353m or rgb30? It seems like the fancy ui is a problem with the 353m? I've never used any of these uis though so maybe its fine? I have been manually opening roms since the 90s the fanciest I have gotten is probably retroarch or coinops and they are pretty nice. Thanks ya'll!",
            "First of all, thank you not only for this post, but also keeping it updated in a timely manner.\n\nSecond, I'm eyeing the tier 2 handhelds, and got a couple questions that aren't exactly answered in the OP.  They go for all the tiers, technically, but anyway...\n\n1. Which ones would you say have good Dpads (and buttons)?  I ask because I did get an Analogue Pocket mainly for cartridge play, but also for some other games, but the Dpad on the AP isn't exactly great.  ...or even good.  There have been plenty of times during testing where I would get diagonals when I shouldn't, or move up or down when I move the Dpad ever so slightly vertical.  So I want a Dpad that's more accurate and just all around better.  Oh, and the (and buttons) is there because I don't want to be stuck in a trade-off situation where I get a good Dpad, but subpar buttons.  Just wanted to throw that out there.\n2. I'm pretty sure there's at least one device in said tier that's going to be suitable for my needs, but it doesn't make mention of any upcoming ones that may be even better.  Any ones that are just coming out within the next few weeks to a couple months you'd say to watch out for?\n\nI'd ask about stuff like which handhelds have 16:9 ratio and how good do non-PSP games look on it, but that's more...\"hard-coded\" information that I can look up, so I won't ask it directly here.  Feel free to mention anything I need to know in this regard, though.\n\nThanks in advance."
        ]
    },
    "New rule regarding 'low value/low effort' posts": {
        "title": "New rule regarding 'low value/low effort' posts",
        "score": 85,
        "url": "https://www.reddit.com/r/SBCGaming/comments/1docmw5/new_rule_regarding_low_valuelow_effort_posts/",
        "content": "Hi everyone, as this sub continues to grow—along with the market and corresponding awareness for retrogaming handhelds—we're always looking for ways to improve the signal-to-noise ratio. For example, although we don't get too many memes, they tend to be divisive when they are posted. However based on the mostly positive poll feedback we got around memes, these will remain unmoderated.\n\nBut, after some debate we thought it prudent to add a 'Low Effort Posting' rule, which would allow us to remove any post that is lacking in substance or fails to elicit engagement from the community. A copy/pasted meme template is a good example of such a post. But this could also be a 'drive by' post that is just an image, a single sentence without adequate context, or an unsubstantiated rumor. This could even be a question that shows clear lack of any prior research and is low value to everyone except perhaps the asker.\n\nThis is a bit of an open-ended rule to enforce but it will allow us to point to a reason to take down a post with poor value that doesn't otherwise run counter to any other rules.\n\nWe ask that everyone please exercise some restraint around reporting posts that seem like they are uninformed or posed without doing prior search. We have a lot of new users who can be intimated by the choices available and may have tried to find an answer but feel overwhelmed by information. Please exercise patience with these users, refer them back to our stickied post [https://www.reddit.com/r/SBCGaming/comments/1bl9oky/which\\_device\\_is\\_right\\_for\\_me\\_if\\_youre\\_new\\_to\\_the/](https://www.reddit.com/r/SBCGaming/comments/1bl9oky/which_device_is_right_for_me_if_youre_new_to_the/) or use the !remind function to do so automatically. We can't police every such post and even if it seems like an obvious answer to you, it may not be to someone else.\n\nAlso one point of clarity: we do have some high-profile contributors who will post a review or how-to video with little or no written context. We encourage you to always add a text description for SEO/context purposes, but such a post would obviously not be considered a 'drive by'.\n\nWe'll let this rule play out for a few weeks and see if it helps, your feedback is obviously welcome.\n\n\n\n",
        "num_comments": 53,
        "comments": [
            "Nice! I'd rather see memes than the 100th \"Just got ___\" post of the week.",
            "Yeah the post that kind of sent me over the edge was titled something like \"the family grows larger\"\n\nThey are consoles, not your kids.  Would love a day / forced flair for these posts so they could be avoided by those who don't want to see a hundredth collection post.  \n\nI suggest MAIL MONDAY!",
            "I know some subs have meme only days, maybe that might help a bit?",
            "So no more showing off my new handheld with the start menu of Pokemon FireRed??\n\nDamn~",
            "Thank you.",
            "Mods over on r/SteamDeck got absolutely roasted because, among other things, they didn't allow \"Here is a picture of my Deck/I'm finally part of the club\"-posts. It feels like 2/3 of those degenerate posts hit the front page every day now. Hope you can hold out!\n\nGood luck!",
            "Have you guys checked out devvit? There's a couple of bots there, that could potentially help you.\n\n[Quality Vote](https://developers.reddit.com/apps/qualityvote2) - Will submit a sticky comment, with a downvote threshold, if reached the post gets removed. Also possible to exempt posts from the rule based on flair.\n\n[Post flair pass list](https://developers.reddit.com/apps/post-flair-vip) - Allows you to create extra flairs, that are only useable by some users. eg. \n\n > we do have some high-profile contributors who will post a review or how-to video with little or no written context\n\n  Those users would be perfect candidates for a flair that's exempt from quality vote / other automod rules. \n\nAnother option you could utilise is an Automod rule, allowing certain users to send a post straight to the report queue, rather than just reporting :\n\n    # Allow some users to Filter a post / rule for potential mods.\n    type: comment\n    author:\n        name: ['username1', 'username2]\n    body (full-text, regex): ['(!Automod(erator)?\\S? Filter this).{0,2}(.*)']\n    parent_submission:\n        action: filter\n        action_reason: '{{author}} filtered post. Reason : {{match-4}}'\n    action : remove\n    action_reason: '{{author}} sent post to modqueue'\n---\n\nIf someone types one of [the examples in this hyperlink](https://regex101.com/r/DhccXx/1) Their comment will be removed (no modqueue), and the post will be sent to modqueue, along `Username filtered post. Reason :` `section in purple` as the automod action reason in the modqueue.",
            "\"Low effort\" rules are kind of a mixed bag. I've seen subs spammed beyond recognition that needed it just to keep the sub from being overrun by a couple of users, and I've also seen it used as a \"mods can now remove anything they want\" button. I don't think either is the case here, but I think the vagueness of \"low effort\" has the potential to discourage new members of the sub. Also, referring to the guide is a nice idea, but a) with the onslaught of new devices it needs to be updated more regularly, b) people are going to have differences of opinions with, well, everything, and a guide is no exception.\n\nI think it would be interesting to see a sub implement a rule like this and after a month or two make a post that shows the submissions that were removed.",
            "With the “meme” stuff, what do you do about someone using a meme to put someone down or be passive aggressive so that they can act like a Dbag?",
            "Collection posts are absolutely garbage IMO.  It's all a group of roughly the same crap.  If it's not rare, don't care."
        ]
    },
    "Hot Take: If you have to publicly ask for ROMs or need preloaded sd cards, you're not ready for this hobby.": {
        "title": "Hot Take: If you have to publicly ask for ROMs or need preloaded sd cards, you're not ready for this hobby.",
        "score": 272,
        "url": "https://www.reddit.com/r/SBCGaming/comments/1dqvo3o/hot_take_if_you_have_to_publicly_ask_for_roms_or/",
        "content": "It sucks to be gatekeepy like this, but the ability to do basic Google searching and watching some YouTube videos or reading previous posts is an absolutely base-level skill that is needed to successfully set up most handhelds.\n\n  \nYes, almost everyone here thinks that the primary way we pirate most ROMs should be completely legal, because obvious reasons, and I agree. This would also remove the need for Rule #5.\n\n  \nBut, that is not the world we currently live in, and the most simple effort in searching is **usually** capable of finding answers. ",
        "num_comments": 130,
        "comments": [
            "Some people like these handhelds because they enjoy the technical tinkering. Some people like collecting them. Some people genuinely just want a convenient way to play old games. It’s annoying to have to field the same set of inquiries over and over again, but Reddit is honestly a more reliable source of information than Google these days.",
            "I think what always gives me a chuckle is someone can find like the most obscure devices subreddit, but not the roms one.\n\nIt always gets me, lol",
            "I'm still fascinated that in <current year> people can't google basic things\n\nIf they googled the rom they were looking for it would be the first result",
            "I think you have to remember this isn’t a hobby to a good portion of the audience buying these, they saw a cool thing on a tiktok and bought it.",
            "** Hot take. Everyone gets started somewhere before there a pro. ** \n\nThe best advice I give is this.\n\n* Do everything yourself and start from scratch so you know the ins and outs\n\n* Don't use video tutorials always follow up to date  written tuts when available.\n\nBut, realistically on day one of someone getting on the ship, they don't know where to start, what to do, what they really want or need. \n\nThese devices are a superb entry into the hobby where people can see a working device, and then have clear goals when a fix is needed, and eventually move on to a custom OS and delving into things on their own. \n\nWhat I would not do with these devices is \n\n* Give them as a gift to anyone not computer savvy, unless your ready to play I.T simulator.",
            "https://preview.redd.it/cxgiv384tf9d1.jpeg?width=1179&format=pjpg&auto=webp&s=b5f2bc9101346c5dd250a505f3b812ddebc28df3",
            "I sympathize with the spirit of this, but I wouldn't want to push away more casual gamers just because they buy a device with a preloaded card. Yes, seeking out an SD card to buy is one thing -- but what about devices that come with a preloaded card?",
            "As someone who runs a tech support company, I'm regularly flabbergasted that people can write a text or email to me with their problems, but they can't put the exact same words into Google.\n\nI don't think it's gatekeepy at all. You don't need a certain level of know-how to get something with a preloaded card and start playing. But the second you leave the \"I bought a console, all I do is start it and play\" bit, you pretty much need some savviness.",
            "Hot take: at least they're interested in playing games unlike 90% of the ewaste hoarders on this sub.",
            "It astounds me about how poor the computer literacy of particularly younger generations are. Google is legitimately a lost art form nowadays.\n\nAlso the average person will be better served by a Switch Lite with an NSO subscription."
        ]
    },
    "New Micro GBA (Thumby)": {
        "title": "New Micro GBA (Thumby)",
        "score": 165,
        "url": "https://i.redd.it/7b9i7ajq6d9d1.png",
        "content": "Looks neat. I always think it's crazy what they can get running on such small devices.",
        "num_comments": 74,
        "comments": [
            "Anything smaller than the RG Nano is a non starter for me. RG Nano is almost a non starter for me tbh.",
            "I'm just glad I can share my hobby with my 3month old infant now",
            "The crampy",
            "Asking if we could but not if we should",
            "https://preview.redd.it/bd9jnydiad9d1.jpeg?width=638&format=pjpg&auto=webp&s=e5dab15a0c3a6b9941626278407d7a97fa6c84d2",
            "What is this, a game boy advance for ants?!",
            "We’re calling it the “carpal tunnel killer”",
            ">I always think it's crazy what they can get running on such small devices.\n\n\nYeah microcontrollers are pretty capable these days. It's probably running something like an [ESP32](https://en.wikipedia.org/wiki/ESP32)",
            "More junk",
            "Wow, those are some pretty huge hands."
        ]
    },
    "I'm an adult now, I can handle it": {
        "title": "I'm an adult now, I can handle it",
        "score": 67,
        "url": "https://i.redd.it/7p3bzxnd1e9d1.jpeg",
        "content": "Im not affraid anymore, but just in case I'll play with the lights on.",
        "num_comments": 16,
        "comments": [
            "I said that about Alien:Isolation and I fucking noped out the moment the xenomorph was set loose.",
            "I'm a grown man.  I'm a big adult.  Check out my Mario and Pikachu dolls and my Crocs with ankle socks.",
            "I can't watch horror movies, but I'm interested in them so I read the plot synopsis on Wikipedia. ¯\\\\_(ツ)_/¯",
            "You’ve got this. But just in case you don’t, sleep with a lamp on for a bit",
            "After you play this one, play the sequel on PSX! \n\nThat one was a huuuge game in my childhood, I was in 6th grade and none of my friends had ever heard of it.",
            "I’ve been wanting to play that game! Crazy it came out for the SNES.\n\nIf you want to be scared. Play some Horror games in Virtual Reality. Not SBC, but a great genre for that platform.",
            "Playing on toilet?\n\nDon't shit your pants. (remember to take them off)",
            "My dad used to play this and parasite eve when we first got our PlayStation When I was like 7. Shit gave me nightmares.",
            "Don't shit your pants",
            "The scariest game of my life, glad I’ve beat it, and shouldn’t play this game again"
        ]
    }
}