{
    "First time. I may have gone a little overboard": {
        "title": "First time. I may have gone a little overboard",
        "score": 13,
        "url": "https://www.reddit.com/gallery/1dr7k3y",
        "content": "",
        "num_comments": 4,
        "comments": [
            "I get these all the time, saw on the news a few weeks back a guy committed suicide because they scammed him out of all his savings. I think it was over $100,000",
            "Yeah, I figured the jig was up. I was actually surprised it went for as long as it did",
            "The Chinese reads:\n\n> Can you understand? If you can, I will chat with you.\n\nLooks like they caught on and swapped to the pity script possibly, the one where if you engage with them in Chinese they'll tell you they're being forced to scam people.",
            "Kevin loves zoo "
        ]
    },
    "You’re not a blonde in California?": {
        "title": "You’re not a blonde in California?",
        "score": 7,
        "url": "https://www.reddit.com/gallery/1dras37",
        "content": "Nigerian scammers blocked me, but I was having fun…",
        "num_comments": 0,
        "comments": []
    },
    "I was scam baiting today and I asked this man for a picture of him with a poster he was selling. He sent me this (where are his fingers holding it???)! 😂": {
        "title": "I was scam baiting today and I asked this man for a picture of him with a poster he was selling. He sent me this (where are his fingers holding it???)! 😂",
        "score": 9,
        "url": "https://i.redd.it/n872j9yiqh9d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "This person doesnt exist type of picture",
            "Oh shit, his fingers are see through. He's a ghost!",
            "Superglue",
            "Nice! ",
            "AI"
        ]
    },
    "Hi. Is this Bill?": {
        "title": "Hi. Is this Bill?",
        "score": 137,
        "url": "https://www.reddit.com/gallery/1dqq6lv",
        "content": "",
        "num_comments": 28,
        "comments": [
            "This was so unexpected and I laughed too much.",
            "Oh my days  funny.. Im guessing theyll be pissed off and call you the N word next  theyre predictable.",
            "This is a very good one but I think you chased him off too quickly. It would have been more sweet if you took it longer.",
            "Yes, looks like the start of a pig butchering scam.",
            "Nice one bro but this scambait is completed",
            "bro i had someone do this with the same person they are using on this scam attempt",
            "Yes, you're talking to Bill Deez.",
            "You win the internet today ",
            "10/10 reveal with that second slide",
            "Ha, youre right. Its been changed. I was hoping for more Guess she didnt like pudding after all."
        ]
    },
    "Makeup Mogul": {
        "title": "Makeup Mogul",
        "score": 20,
        "url": "https://www.reddit.com/gallery/1dqzsep",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Bravo lol I would of loved to see their face when they saw the picture lol ",
            "I hope I didn't bother you! I heared hundred times that. "
        ]
    }
}