{
    "Recent research suggests that cannabis use before sex may help women who experience difficulties achieving orgasm. Among women with difficulties achieving orgasm, a significant majority reported improvements in orgasm frequency, ease, and satisfaction when using cannabis before partnered sex.": {
        "title": "Recent research suggests that cannabis use before sex may help women who experience difficulties achieving orgasm. Among women with difficulties achieving orgasm, a significant majority reported improvements in orgasm frequency, ease, and satisfaction when using cannabis before partnered sex.",
        "score": 348,
        "url": "https://www.psypost.org/cannabis-appears-to-improve-orgasmic-function-in-women-according-to-new-research/",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Wait, sex on dugs is better? Who knew...",
            "My experience (as a dude) with weed+seggs, is that I get wayyy too in my head and usually can't even get it up",
            "Just anecdotally, being relaxed leads to better sex",
            "Yeah, basic idea would be if they are less stressed, they are more likely to enjoy themselves.",
            "Ive linked to the news release in the post above. In this comment, for those interested, heres the link to the peer reviewed journal article: \n\nhttps://academic.oup.com/smoa/article/12/2/qfae023/7665106\n\nFrom the linked article: \n\nRecent research published in the journal Sexual Medicine suggests that cannabis use before sex may help women who experience difficulties achieving orgasm. Among women who reported difficulties achieving orgasm, a significant majority reported improvements in orgasm frequency, ease, and satisfaction when using cannabis before partnered sex.\n\nFemale orgasmic dysfunction is a sexual disorder characterized by a persistent or recurrent difficulty in achieving orgasm, despite adequate sexual stimulation and arousal. This condition can cause significant distress and affect a womans quality of life and relationships. Despite its prevalence, affecting up to 41% of women worldwide, effective treatments are limited.\n\nThe researchers found that women with orgasm difficulties experienced a 39.8% increase in orgasm frequency with cannabis use. Specifically, 88.8% reported reaching orgasm more frequently when using cannabis, compared to 63.3% without it. Those who almost never or never reached orgasm decreased from 36.6% without cannabis to 11.4% with cannabis.\n\nLikewise, the difficulty of achieving orgasm decreased by 35.4% among women with orgasm difficulties when using cannabis. Only 7.4% found it extremely difficult or impossible to orgasm with cannabis, compared to 22.8% without it.\n\nSatisfaction with orgasms nearly doubled, with 86.1% of women reporting higher satisfaction with cannabis use, compared to 43.6% without it. Dissatisfaction rates dropped significantly, from 56.4% without cannabis to 20.8% with it.",
            "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://reddit.science/flair?location=sticky).\n\n---\n\nUser: u/mvea  \nPermalink: https://www.psypost.org/cannabis-appears-to-improve-orgasmic-function-in-women-according-to-new-research/\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*"
        ]
    },
    "Study comparing the genetic activity of mitochondria in males and females finds extreme differences, suggesting some disease therapies must be tailored to each sex": {
        "title": "Study comparing the genetic activity of mitochondria in males and females finds extreme differences, suggesting some disease therapies must be tailored to each sex",
        "score": 4675,
        "url": "https://dornsife.usc.edu/news/stories/mitochondrial-sex-differences-suggest-treatment-strategies/",
        "content": "",
        "num_comments": 289,
        "comments": [
            "I did used to wonder about this at university as experiments were always done with tissue or cells but I am not sure if the cells were ever sexed first.",
            "You guys need to post less emotional titled posts. The title is super confusing. First impression: oh, they found something really unique for Homo Sapiens. Going to article: oh, it was just a shrimp. I appreciate any efforts in science, but I dont appreciate confusing titles and announcements.",
            "It is about time the physiological differences were observed in medical trails. These differences means actual differences on response to treatments which could changes a lot of women's lives.",
            "and now my follow-up question. what happens when someone is trans and has a mitochondrial disorder?\n\nhow the hell r we still like. not even up to speed on women's health let alone anyone else's??",
            "What?! No! It's 2024? How do I even get to identify?",
            "Centering males has always been a digesting mistake.",
            "Note that the model organism for this study is a copepod. Not a mammal. Not even a vertebrate. In general, we call whichever morph makes the larger gametes female. The study implies that the burden of producing larger gametes (colloquially eggs) results in differences in energy utilization. It will be interesting to see whether similar differences in mitochondrial function evolved in species with different sex determination systems.",
            "Yeah, all cell lines are documented male or female. Also usually age of the original patient and probably race.\n\nBy now, all common cell lines have been sequenced, so you could also just look up that.",
            "If it's a stabilized cell line and you know the name of the cell line (the researchers should), you can usually trace it back in the literature and figure out what animal it was originally sourced from!  The researchers can also karyotype their cells, which would show [ed] sex chromosomes.  Although it often also shows that the cells are chromosomally weird, like pseudo-triploid or something.  If the cells or tissues were taken recently from an animal, the person doing the experiment really *should* have kept the information about the animals' characteristics, including sex.  In short, the sex should be knowable! (And if not, shame on the lab)",
            "I work on a project that has to do with viruses and myocarditis and mitochondria, mitochondria in males and females is very different, and we think that's one of yhe reasons that myocarditis is so much more prevalent in men than women (as opposed to almost every other autoimmune diseasee). It's pretty cool stuff."
        ]
    },
    "Researchers have found unique molecular signatures of blood-brain barrier dysfunction in Alzheimer's disease. The barrier, which shields the brain from harmful substances in the blood, is disrupted in Alzheimer's. This discovery may lead to novel diagnostic and treatment approaches for the disease.": {
        "title": "Researchers have found unique molecular signatures of blood-brain barrier dysfunction in Alzheimer's disease. The barrier, which shields the brain from harmful substances in the blood, is disrupted in Alzheimer's. This discovery may lead to novel diagnostic and treatment approaches for the disease.",
        "score": 241,
        "url": "https://www.nature.com/articles/s41467-024-48926-6",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Good. These neurodegenerative disorders are some of the scariest out there.",
            "Came here to cite this paper too. The parallels between Alzheimers and what's being uncovered in long covid are beginning to stack up, it seems. Exciting, and potentially quite tragic",
            "Of all the things that could happen to me as I age, dementia/Alzheimer's disease is my greatest fear.",
            "For me personally, probably ALS. But there isnt really a good neurodegenerative disease. They are *all* terrible.",
            "When I have some time, I would like to compare the details to the findings of this paper, linking disruptions to the BBB to long COVID brain fog.  https://doi.org/10.1038/s41593-024-01576-9",
            "Press release [here.](https://newsnetwork.mayoclinic.org/discussion/researchers-identify-vascular-changes-in-the-brain-linked-to-alzheimers-disease/)\n\n*Researchers identify vascular changes in the brain linked to Alzheimers disease.*\n\nThe blood-brain barrier  a network of blood vessels and tissues that nurtures and protects the brain from harmful substances circulating in the blood  is disrupted in Alzheimer's disease. Now, researchers at Mayo Clinic and collaborators have uncovered unique molecular signatures of blood-brain barrier dysfunction that could point to new ways to diagnose and treat the disease. Their findings are published in Nature Communications.\n\n\"These signatures have high potential to become novel biomarkers that capture brain changes in  Alzheimer's disease,\" says senior author Nilfer Ertekin-Taner, M.D., Ph.D., chair of the Department of Neuroscience at Mayo Clinic and leader of the Genetics of Alzheimer's Disease and Endophenotypes Laboratory at Mayo Clinic's campus in Florida.\n\nTo conduct the study, the research team analyzed human brain tissue from the Mayo Clinic Brain Bank, as well as published datasets and brain tissue samples from collaborating institutions. The study cohort included brain tissue samples from 12 patients with Alzheimer's disease and 12 healthy patients with no confirmed Alzheimer's disease. All participants had donated their tissue for science. Using these and external datasets, the team analyzed thousands of cells in more than six brain regions, making this one of the most rigorous studies of the blood-brain barrier in Alzheimer's disease to date, according to the researchers.\n\nThey focused on brain vascular cells, which make up a small portion of cell types in the brain, to examine molecular changes associated with Alzheimer's disease. In particular, they looked at two cell types that play an important role in maintaining the blood-brain barrier: pericytes, the gatekeepers of the brain that maintain the integrity of blood vessels, and their support cells known as astrocytes, to determine if and how they interact.\n\nThey found Alzheimer's disease patients' samples exhibited altered communication between these cells, mediated by a pair of molecules known as VEGFA, which stimulates the growth of blood vessels, and SMAD3, which plays a key role in cellular responses to the external environment. Using cellular and zebrafish models, the researchers validated their finding that increased levels of VEGFA lead to lower levels of SMAD3 in the brain.\n\nThe team used stem cells from blood and skin samples of the Alzheimer's disease patient donors and those in the control group. They treated the cells with VEGFA to see how it affected SMAD3 levels and overall vascular health. The VEGFA treatment caused a decline in SMAD3 levels in brain pericytes, indicating interaction between these molecules.\n\nDonors with higher blood SMAD3 levels had less vascular damage and better Alzheimer's disease-related outcomes, according to the researchers. The team says more research is needed to determine how SMAD3 levels in the brain impact SMAD3 levels in blood.\n\n\"Our study systematically combines model systems with valuable human brain and blood data, an approach that could be used as a roadmap in future studies to prioritize molecular targets for new therapies,\" says Ozkan Is, Ph.D., a co-first author of the study along with Xue Wang, Ph.D.\n\nResearchers plan to further study the SMAD3 molecule and its vascular and neurodegenerative outcomes for Alzheimer's disease and also search for other molecules with potential involvement in maintaining the blood-brain barrier.\n\n\"This useful and productive work helps us better understand the specific mechanisms that play a role in the blood-brain barrier breakdown and other possible vascular changes in people with Alzheimers,\" says Heather M. Snyder, Ph.D., Alzheimer's Association vice president of medical and scientific relations. \"Understanding the biology that influences and impacts disease progression is essential to uncovering new avenues for novel therapies and tools to detect the earliest stages of the disease.\"\n\nThis research is part of a federal grant supporting projects that identify targets for Alzheimer's disease treatment. The study was supported in part by the National Institutes of Health, National Institute on Aging, the Alzheimer's Association Zenith Fellows Award and Mayo Clinic Center for Regenerative Biotherapeutics. For a full list of authors, funding and disclosures, see the paper.",
            "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://reddit.science/flair?location=sticky).\n\n---\n\nUser: u/AnnaMouse247  \nPermalink: https://www.nature.com/articles/s41467-024-48926-6\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*"
        ]
    },
    "Scientists have just revealed their findings on what is the most pristine trilobite fossils ever found dating 510 million years old | The fossils, which show both hard exterior features and soft inner tissues, shed new light on the fascinating creatures.": {
        "title": "Scientists have just revealed their findings on what is the most pristine trilobite fossils ever found dating 510 million years old | The fossils, which show both hard exterior features and soft inner tissues, shed new light on the fascinating creatures.",
        "score": 154,
        "url": "https://newatlas.com/biology/trilobite-fossils-volcanic-ash/",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Oh, the oldest known trilobites were just a few (~11) million years older than that",
            "Better link: https://www.bristol.ac.uk/news/2024/june/prehistoric-pompeii.html",
            "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://reddit.science/flair?location=sticky).\n\n---\n\nUser: u/chrisdh79  \nPermalink: https://newatlas.com/biology/trilobite-fossils-volcanic-ash/\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*"
        ]
    },
    "Researchers discovered that nearly 20% of the bacterial strains studied could degrade plastic, though they needed some encouragement to do so | Some of the world's smallest organisms can break down plastic into small particles, which can then be recycled.": {
        "title": "Researchers discovered that nearly 20% of the bacterial strains studied could degrade plastic, though they needed some encouragement to do so | Some of the world's smallest organisms can break down plastic into small particles, which can then be recycled.",
        "score": 106,
        "url": "https://www.nature.com/articles/s42003-024-06414-z",
        "content": "",
        "num_comments": 15,
        "comments": [
            "As per usual the human race relies on bacteria to pull itself out of trouble.",
            "Every time I see anything about this I can't help picturing a Science Fiction(I hope) novel about an lab accident or some over zealous environmentalist releasing a super strain that proceeds to attack all the plastic on Earth, rendering driving modern technology back to the early 1900's.",
            "Possible solution for ingested microplastics? I need an educated person to give me their opinion.",
            "Go bacteria go! You can do it! \nIm providing encouragement.",
            "Come on, little guy! You can do it! Make our problems go away!",
            "A future where almost no plastic is viable because we introduce a plastic digesting airborne mold which escapes our control.",
            "Organic problems require organic solutions.",
            "Hey now, sometimes we rely on fungi...",
            "Actually that wouldn't pull us out of trouble. It would add around 15 billion tons of available carbon, hydrogen, oxygen, nitrogen, sulphur and chlorine to the corresponding nutrient cycles of the biosphere, which would devastate most of these anyway by now \"broken\" natural cylces that build the base of all complex life on earth.\n\nBeside that plastic eating bacteria common in the biosphere would inevitably be similar than the movie \"the last day on earth\", just that everything manmade containing plastic would fall apart over weeks/months instead instantly",
            "The rate we are going they wont have to worry about us soon enough."
        ]
    }
}