{
    "The power of math": {
        "title": "The power of math",
        "score": 611,
        "url": "https://i.redd.it/n3m336qdyh9d1.jpeg",
        "content": "",
        "num_comments": 59,
        "comments": [
            "The 70K doesn't even tell you what it is... It's just 70K of what? The $700,000 in pennies is clearly money.",
            "This is a joke right? $700,000 stays $700,000 no matter the unit",
            "I don't think this is a math test as much as it's a reading comprehension test.",
            "70 million pennies would be about 385,810 lbs , or 193 tons ... Eeeesh",
            "Ah, but what weighs more? 1 pound of pennies or 1 pound of dollars?!",
            "The power of sh_!t , the sing seys $700,000 in pennies not 700,000 pennies",
            "Shouldn’t this be in /facepalm?",
            "thats like saying that a pound of rocks is heavier then a pound of feathers because rocks weigh more then feathers",
            "With 70,000,000 pennies i could smelt that and get (3grams per penny) 140,000kgs of zinc which i can sell for 3000 a tonne which makes me 420,000$\n\n...and a lot of work",
            "The guy is litterally in the left line."
        ]
    },
    "People on this sub be like: ": {
        "title": "People on this sub be like: ",
        "score": 1801,
        "url": "https://i.redd.it/9p84tbqq2g9d1.jpeg",
        "content": "",
        "num_comments": 87,
        "comments": [
            "Wdym I built one yesterday",
            "I got a dyson sphere at home. It was a but expensive though.",
            "I dont know what the other three are, so I just used the dyson to vacuum the other words up.",
            "🤬 I know, I know. I 🤬🤬ing know.\n\nI'm working on it.",
            "fusion energy is often enough, atleast for my worlds setting.",
            "I thought this was a stellaris meme at first.",
            "When you aim for the stars but forget to build the ladder.",
            "Its a cool yu gi oh card",
            "Such a primitive civilization, still relying on stars.  Why don't you just use singularity like a proper civilization?",
            "It takes (almost) infinite energy to make (pretty much) infinite energy, how fun."
        ]
    },
    "I challenge you to": {
        "title": "I challenge you to",
        "score": 671,
        "url": "https://i.redd.it/7cbmwnzwih9d1.png",
        "content": "",
        "num_comments": 61,
        "comments": [
            "it's like when you fold a pancake and put your penis through it, then you lay down and pretend you're a sail boat",
            "Imagine a paper and pencil in your head, now fold the paper and stab the pencil through it. Thats wormholes!",
            "Bro did us the\" non theoretical mathephysicsians\" dirty",
            "I can explain it on a beach without paper and pencil.",
            "Fine just use a whiteboard and a marker",
            "Sure. A screwdriver and a sheet of tin foil.",
            "*points at hole in the dirt on the ground*\n\n“See, worms made this”",
            "You have a cloth with a loose string on one end. You take that string and stretch it all the way to the other end of the cloth where you sew it back on. There's your wormhole.",
            "Welp, i have a leaf and a stick",
            "I'll explain it with chalk and the ground"
        ]
    },
    "Who got it, show your presence": {
        "title": "Who got it, show your presence",
        "score": 230,
        "url": "https://i.redd.it/sizz9zue8i9d1.jpeg",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Absolute value vs exterior appearance",
            "This showcases *exactly* when i was studying mechatronics and learned about positive and negative PLC logic and i was pondering if it would be possible to build a PLC that takes both, and it reminded me of when Jesus said \"Happy are you when people reproach you and persecute you...\".\n\nLike, you can pretty much decide to be happy whatever happens. So something happens, and you get the proof that \"Wow, the universe is working, yay!\"",
            "It has two meanings which are similar.",
            "Here's my presence. These are absolute value operators, removing minus sign. Because sadness is negative, it turns into happiness",
            "No I do not, my answer is final and absolute",
            "The absolute value of a frown, or 'negative smile' is a smile.",
            "I think this showing us another reality! U can’t define/know if the person is fine or happy from a smile on his face, sometimes there’s lots of sadness behind a simple smile, and Ofc there are those who pretend to be happy by smiling for some reasons",
            "This is similar to the algorithm for absolute values",
            "Results are results regardless of hypothesis",
            "how is this a science meme"
        ]
    },
    "Motivatiooooon": {
        "title": "Motivatiooooon",
        "score": 999,
        "url": "https://i.redd.it/52j7f6vsse9d1.jpeg",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Slowly craft a modern society over a period of thousands of years until you have weapons powerful enough that you can hunt your dreams to extinction.",
            "Hunting dreams like our ancestors hunted prey - steady, persistent, and never giving up!",
            "Vergil, your portal opening days are over.",
            "Humans arent hunters. Cavemen were vegan",
            "You got dreams? I can fix that. - Life",
            "before it started to get cold n chilly",
            "Can confirm.",
            "This is genius! 🧠😂",
            "r/lostredditor",
            "Damn you!"
        ]
    }
}