{
    "Just finished Hyperion. Might be my new fav sci fi novel. How do the sequels compare?": {
        "title": "Just finished Hyperion. Might be my new fav sci fi novel. How do the sequels compare?",
        "score": 306,
        "url": "https://www.reddit.com/r/scifi/comments/1d12wpy/just_finished_hyperion_might_be_my_new_fav_sci_fi/",
        "content": "I loved Hyperion so much. Each pilgrim’s story was so good and they all had their own unique style. I’m really intrigued to learn more about the world of Hyperion and the shrike, but I’m wondering how do the sequels compare? Are they as good as the first novel and would you recommend reading them?",
        "num_comments": 181,
        "comments": [
            "Fall of Hyperion is the Dune 2 of the first two books.  Large Time jump for the remaining two.  All good but fall of Hyperion is my personal favorite",
            "You will probably like the second book just as much as the first. As for the second two books, I thought they were much worse than the first two but there are those who enjoy it just as much. It is probably better to think of it as a duology and a sequel duology than a four-book series.",
            "Everything gets weirder before anything makes sense then everything makes sense",
            "It's probably better to consider Fall of Hyperion as the direct sequel. Endymion and Rise of Endymion I think of as more like \"related stories in the same universe\".\n\nThe other 2 books(Endymion) are sequels the same way that say, Lord of the Rings is a sequel to The Hobbit. Which is to say, it isn't really. They are tonally different, and are directly related, but they aren't direct continuations of the stories unless you take a really odd perspective (i.e. LoTRs is only a direct continuation from the perspective of the One ring, and Endymion is only a direct continuation from the perspective of the baby).",
            "Fall of Hyperion basically finished the story from Hyperion, it’s technically one book. I haven’t read 3 and 4 yet but Fall is a must read.",
            "Fall of Hyperion is a good book. \n\nMy only problem with it has been author's over-pandering to his presumably favourite poet, so much so that by the end of the book the story revolves around him. My god Simmons, if I wanted to read Keats, I would have been reading Keats.",
            "You have to read Fall of Hyperion if you want to know what happens next. Endymion and its sequel are a different story set in the same universe with some returning characters. Reading the last two books doesn’t make the first two any better but I liked the last two books more than the first two. \n\nIf you love the world building and the setting then the remaining three books will get better and better as more of it is revealed. I found the last two books to have much more action on the whole but it isn’t sprinkled throughout it is concentrated in some well placed scenes to show the carnage in detail.",
            "I really enjoyed Hyperion.  \n\n\nMidway through the second book I thought to myself - the author is 100%an English teacher.\n\n\nPaused to look him up. He is. ",
            "straight chubby workable follow recognise tease lip deranged husky squeamish\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "Fall of Hyperion is excellent.\n\nThe Endymion books have fascinating concepts but I don't love the story. There is also an extremely uncomfortable theme in those books that I won't harp on, but people who have read them know exactly what I'm referring to."
        ]
    },
    "Military/Space Opera Sci-fi with batshit insane wars?": {
        "title": "Military/Space Opera Sci-fi with batshit insane wars?",
        "score": 130,
        "url": "https://www.reddit.com/r/scifi/comments/1dkyuyc/militaryspace_opera_scifi_with_batshit_insane_wars/",
        "content": "As the title says, do you guys know any sci-fi novels (or maybe shows/films) that have batshit insane wars?\n\nBy batshit insane, I mean: \n\n* Grueling wars with absurd casualty counts,\n* Sprawling wars that have no end.\n* Over-the-top wars. Galactic or planetary.\n* Wars that have extreme technological shenanigans of *any kind*. \n\nSome examples off the top of my head...\n\n1. Animatrix, second renaissance part 2.\n2. Warhammer, literally anything Warhammer.\n3. And, the Mona Lisa of Grimdark, Xeelee Sequence.",
        "num_comments": 230,
        "comments": [
            "Joe Haldeman's *The Forever War* is about a baseless war that goes on for a thousand or so years and turns out to be based on a misunderstanding.  The combatants experience time dilation, so they go out on missions and come back centuries later to a profound culture shock.  This might fit your bill.\n\nHaldeman served in the Vietnam war, and the book was informed by his experiences there.  The book picked up a lot of gongs in its day, including Hugo and Nebula awards for best novel, and is considered to be something of a classic.",
            "The Lensman series starts when two groups of aliens in different universes notice a couple of galaxies will pass through each other, something they understand will cause the formation of multiple stars with planets capable of supporting life as we know it. One group sees this as an opportunity to dominate the sentient life that will appear billions of years in the future. The other group, keeping themselves concealed, begin preparations to influence the emerging civilisations to resist this domination (we are one of these upcoming civilisations.) The open warfare between their spheres of influence begin with fairly standard FTL capable ships shooting energy weapons and protected by shields but end up fairly ridiculous.",
            "Peter F. Hamilton - Commonwealth Saga…\nAlmost everything from Stefan Burban",
            "Some of the ship battles in the Culture series are brutally quick and thorough. Particularly in *Excession* and *Surface Detail*, the latter of which also involves a galactic proxy war fought in VR. An ongoing war forms the backdrop of *Consider Phlebas* as well, but isn’t really a focus of the book.",
            "Warhammer 40K is probably the peak of these tropes, as you mention. \n\nFor those that don't know, there are a TON of novels, covering all kinds of factions and blending various subgenres into the overall insanity.\n\nBattlestar Galactica might fit your goal, too.\n\nMacross and/or Robotech might interest you.\n\nBattletech/MechWarrior might fit what you're looking for.",
            "Scalzi’s old man’s war is about a universe where earth comes late to the galactic party and uses old people in retrofitted bodies to fight a never ending war.",
            "The \"March Upcountry\" series by David Weber and John Ringo. After a botched assassination attempt,  a spoiled prince and his battalion of bodyguards end up stuck on hostile primitive planet and have to fight their way across the planet to it's only spaceport",
            "Try the frontlines books. Good military pov series about overwhelming war",
            "Two Novellas:\n\nHow to Lose the Time War a bit abstract as it is written as a set of letters between two opposing spies.\n\nSome Day All This Will Be Yours which is told after the war by it's sole survivor.\n\nBoth feature suitably batshit insane technology in batshit insane wars.",
            "Legend of the galactic heroes."
        ]
    },
    "A new book that’s objectively irresistible: “Hail Mary” by Andy Weir": {
        "title": "A new book that’s objectively irresistible: “Hail Mary” by Andy Weir",
        "score": 140,
        "url": "https://www.reddit.com/r/scifi/comments/1dqwm02/a_new_book_thats_objectively_irresistible_hail/",
        "content": "I’m about halfway through this book and I’m enjoying this as much as any sci-fi I’ve ever read. No spoilers, please! Just wanted to let others know that it’s a great ride so far.\n\nEDIT: Yes, I now realize this was written ~3 years ago and that I got the title wrong (for which I blame Kindle). It's *Project Hail Mary*. Yes, I also admit that it's not as cerebral as *God Emperor of Dune* (which I adore) or even Azimov's *Foundation* series. And it's not everyone's cup of tea. But if I were to recommend a good recent novel, this would be it. Thank you for all of the responses, fellow nerds. Cheers!",
        "num_comments": 135,
        "comments": [
            "Movie on track for spring of ‘26, I think.",
            "\\*Project Hail Mary\\*",
            "I did like it, Fairly easy quick read with great pacing. Kind of a beach book.",
            "I'll admit I found the tone of the inner thoughts of the main character grating, and a little too similar to the feel of the Martian - but the overall story was intriguing enough, and Rocky was fun enough to make up for it. \n\nAll in all I liked every character *except* the main character, solely because he made me feel like Andy Weir is a bit of a one trick pony, tonally. That said, I'd absolutely read it again, I think it might even be more fun reading the first act knowing what's coming.",
            "People would rather do anything than read the title of the book.",
            "Audio book is fantastic!",
            "I loved it all the way through and so did my 2 friends who read it. It’s a blast. I need more Sci Fi like that.",
            "Why is the word \"new\" in the subject of this post? The book was published 3 years ago. Not new. Old.",
            "Not sure I'd take a book review from someone who doesn't know the meaning of 'objectively'.",
            "Happy happy happy you got to read this before the movie came out."
        ]
    },
    "What’s a lesser known First Contact (or adjacent) story that really moved you? Stand-alone or series. ": {
        "title": "What’s a lesser known First Contact (or adjacent) story that really moved you? Stand-alone or series. ",
        "score": 41,
        "url": "https://www.reddit.com/r/scifi/comments/1dr07r6/whats_a_lesser_known_first_contact_or_adjacent/",
        "content": "Recommend me something ",
        "num_comments": 51,
        "comments": [
            "On an individual level (as opposed to clash of civilizations), the novella Enemy Mine stuck with me. ",
            "*The Hercules Text* by Jack McDevitt is a great book about receiving a message from a distant alien civilization. \n\nWe never meet the aliens face-to-face, but various characters brought together by the discovery speculate on the psychology and technology of the aliens, as well as geopolitical ramifications of first contact with an unknown intelligent species. \n\nIt’s very good but rarely referenced.",
            "My vote is for Blind Lake by Robert Charles Wilson. Asks the question “if we found intelligent aliens could we understand them?” I think about that question often.",
            "David Brin's Uplift series, imo one of the best takes on the \"Aliens testing us\" trope. ",
            "I don't know if *The Mote in God's Eye* counts, because there was a time when it was really well-known and -regarded\n\nBut if you haven't read it yet, it's one of the best first contact stories of that era of scifi.  Vey clever, very fun",
            "Pushing Ice",
            "Story of Your Life by Ted Chiang",
            "Still a classic favorite…the one that started it all: Murray Leinster’s FIRST CONTACT.",
            "Fiasco - Stanislaw Lem, also Solaris",
            "Blindsight by Peter Watts. Really cool examination of both alien life and transhumanism. It was nominated for a Huge Award. Not only is it harder on the sci-if spectrum, it also gets really deep into the philosophy of consciousness.\n\nIt’s available for free on his website. There is also a pretty cool documentary on vampires (makes sense in context) available there as well. "
        ]
    },
    "A few mechs from my sketchbook. ": {
        "title": "A few mechs from my sketchbook. ",
        "score": 167,
        "url": "https://www.reddit.com/gallery/1dqndbm",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Battletech if the mechs were just guys in your neighborhood.",
            "Good stuff!!",
            "Love marker sketching 😊 They're so quick and effective, and these are pretty nice.",
            "I like the poses, they're so human yet anatomically correct for the machine as you've drawn it.",
            "As a huge Battletech fan. I love these.",
            "Very talented. You could write your own Sci/Fi stories, include your drawings as illustrations, and post them on the web."
        ]
    }
}