{
    "What's on and tourist advice thread - week beginning June 23, 2024": {
        "title": "What's on and tourist advice thread - week beginning June 23, 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/Scotland/comments/1dmysgk/whats_on_and_tourist_advice_thread_week_beginning/",
        "content": "Welcome to the weekly what's on and tourist advice thread!\n\n\\* Do you know of any local events taking place this week that other redditors might be interested in? \n\n\\* Are you planning a trip to Scotland and need some advice on what to see or where to go? \n\nThis is the thread for you - post away! \n\nThese threads are refreshed weekly on Mondays. To see earlier threads and soak in the sage advice of yesteryear, [Click here](https://www.reddit.com/r/Scotland/search?q=What%27s+on+and+tourist+advice+thread&restrict_sr=on&sort=new&t=all).",
        "num_comments": 16,
        "comments": [
            "Hello everyone, I am looking for a buddy or two to visit Lindisfarne on September 8th. We would need to share the car rental expenses (which are manageable), as the 477 bus does not run on Sundays. I am 30F and would like to travel with other women or a mixed group (one M + one F is fine).",
            "This is not the right place to ask but i got a scottish girl number in Stuttgart last night. However i canny Get through. Must have fucked up the landcode or something. \n\nIs there any online search on UK Numbers? Like a digital Phonebook. \n\nWorst part is she keeps texting me but for some reason i cant reply and her number dont show up, it’s filtered as spam 💀",
            "Hey there!! I’m gonna be visiting a friend in Stirling in a few weeks, and I’m not gonna lie, as an unfamiliar Texan, I’m terrified of train systems. We’re going to be in France before we go see her, so what’s the best train route/channel to plan for from there? We’ll be ending our France trip in Paris if that helps. \n\nI’ll probably chat with her too at some point this week, but wanted to see what advice y’all have to offer in regards to train systems!",
            "Is it safe to travel to Scotland as a trans person at the moment ?",
            "Going to Scotland for a two week holiday. Where can I find reasonable-priced accommodation ? Prices on booking and Airbnb are insane",
            "There’s no ‘phonebook’ for UK mobile numbers. Have you tried replying off a different phone?",
            "I would fly from Paris to Edinburgh, get the tram from the airport to Edinburgh Waverley, then get a train from Waverley to Stirling. I can talk you through the details if you like?",
            "Absolutely!",
            "Accommodation research is a slog. Visit Scotland has lots of listicles which should help. Itison do deals on accommodation, although you do always have to check the terms and conditions.",
            "https://preview.redd.it/zg7zpcsjyd9d1.jpeg?width=1284&format=pjpg&auto=webp&s=40647b8115a9d89b29c5e4d41e01de0b61896ae8\n\nNaah i just get sms as the sender, so nae info :/ oh well"
        ]
    },
    "[Discussion Thread] Weekend Megathread": {
        "title": "[Discussion Thread] Weekend Megathread",
        "score": 2,
        "url": "https://www.reddit.com/r/Scotland/comments/1dqn4a0/discussion_thread_weekend_megathread/",
        "content": "Hello ladies and gents!\n\n&#x200B;\n\nWelcome to the 'Weekend Thread', where people can post about what they're getting up to tonight, at the weekend, good places to go, photos of places you've been, advice on where to go, or just how your week went!\n\n&#x200B;\n\nThe premise is fairly simple.\n\n&#x200B;\n\n \\- Please be civil\n\n \\- **NO POLITICS**. Any political comments will be removed. This is a strictly meta thread, with discussion about people and their happenings.\n\n \\- Post pictures, youtube links to music you're going to see, games you're going to watch, places you'd like to go (tripadvisor, google maps etc)\n\n&#x200B;\n\n These comments will not be moderated unless it doesn't follow guideline one and two!\n\n&#x200B;\n\n This post will be stickied until Sunday, allowing for discussion all weekend!",
        "num_comments": 2,
        "comments": [
            "Still no further forward on Mum's estate\n\nAnyone one else would be getting a written warning over this but solicitors seem to be immune from this\n\nStressed out\n\nBuilding work practically complete, just a gate to build/fix\n\nSolar in and working! Now using no grid power",
            "Just returned from holidaying in Paris, my weekend will be spent recuperating from that lol"
        ]
    },
    "😅": {
        "title": "😅",
        "score": 155,
        "url": "https://i.redd.it/3p9n9j69xd9d1.jpeg",
        "content": "",
        "num_comments": 9,
        "comments": [
            "'and when the money comes in from the case we won, we'll pass almost every penny onto you'",
            "I always thought Frankie Boyle was one of the Proclaimers. \nWas a bit disappointed when I realised the truth.",
            "Scotland wouldn’t exist if this song would be erased from collective memory….along with square sausage, irn bru and buckfast.",
            "The Proclaimers are to weddings what Mariah Carey is to Christmas.",
            "I have an unnatural hate for this song.",
            "?",
            "You should listen to the rest of their catalogue.  They wrote some beautiful songs.  The only problem was that they sang in their accent.\n\nOne example: https://youtu.be/YEpmUUEkrKM?si=EEqqu-hh6HzUX0rN",
            "The proclaimers have very literal songs for most occasions be it graduation, funerals, divorce proceedings and trips to America",
            "Now I want I'm On My Way played at my funeral. 🤣"
        ]
    },
    "Voting intention by alcoholic drink preference ": {
        "title": "Voting intention by alcoholic drink preference ",
        "score": 21,
        "url": "https://i.redd.it/t09rfklpvg9d1.jpeg",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Actually says a lot. I'd like to see it broken down for Scotland because Scotland can only command 10% of the entire UK vote.  More people live in London than live in all of Scotland.",
            "No Buckfast?",
            "Interesting that SNP's greatest support lies with the Shandy drinkers. I suppose MUP doesn't really affect them?",
            "Wine, sherry (and stout) drinker here - have donated to a few pro-Palestine candidates running south and will unenthusiastically vote SNP.",
            "Are Labour voters ok?",
            "The layout is a bit confusing. I thought the labels were below the graphs for the 2nd row, but they're above it",
            "To add to that.  There is a Labour bias to this chart.  It would be good do see it with no biases.",
            "What the… why are you backing pro Palestine candidates in an election about who runs *this* country",
            "No, judging by this they are all pished.",
            "Probably a good yardstick to judge the morality and empathy of a candidate."
        ]
    },
    "Love the people of Scotland ": {
        "title": "Love the people of Scotland ",
        "score": 170,
        "url": "https://www.reddit.com/r/Scotland/comments/1dqrv6u/love_the_people_of_scotland/",
        "content": "Coming to the end of a 3 week stay in Scotland and I have to say I have never met such wonderful people. Helped us out SO many times when we were basically wandering around bumping into walls. Never seemed to be aggravated that we were probably interfering in their day. Honestly you guys are the balls. Cheers! ",
        "num_comments": 42,
        "comments": [
            "Haste ye back!",
            "Alba Gu bráth and all that",
            "You're welcome. Please come again  🤣👍",
            "“bumping into walls”….Definitely American 😂",
            "Glad to hear you enjoyed your time here. How are the folk where you live?",
            "You’re absolutely welcome!",
            "All ready planning our trip back for next summer! Enjoyed every pint and dram in every Pub, especially in the Montgomerie Arms in East Kilbride. \nSaying for a month this time!",
            "3 weeks must have been amazing, where have you been?\nI love how they start a conversation with you even if your a complete stranger, had a walk from Cullen to Portnockie just earlier and I had a small conversation with 4 different people.",
            "This was exactly my experience last year and to be honest, all I've thought about since returning home last year was planning this year's visit, which will be 6 weeks long YAY! According to my countdown calendar, my flight leaves in 37 days,18 hours, 34 minutes and 26 seconds.",
            "Completely agree with you, they are wonderful people.  Been to Scotland 3 times in past few years and every place I go the quality of the people makes me love the country so much more.  I'm seriously considering retirement there"
        ]
    }
}