{
    "Happy Pride!": {
        "title": "Happy Pride!",
        "score": 123,
        "url": "https://www.reddit.com/r/SCP/comments/1d5erfp/happy_pride/",
        "content": "Happy Pride from the SCP Foundation!  \n  \nVisit the wiki to check out or contribute to PRIDEFEST, an event for promoting LGBTQ+ content and authors in our community!  \n  \n[https://scp-wiki.wikidot.com/pridefest](https://scp-wiki.wikidot.com/pridefest)  \n(Hub art and design by syuzhet, run by our Community Outreach team!)  \n  \nRemember Pride Month is a time for togetherness and love. This year, make sure to support your favorite queer authors and artists, and make that support known. Later today, we will announce details for our Pride Month social media showcase, so keep an eye out for that!  \n  \nWe will also be sharing links to resources you can use for personal or community education, or charities you can donate to if you want to support the community. Happy Pride, everyone!\n\n[design by syuzhet](https://preview.redd.it/62to2gfa0w3d1.png?width=1802&format=png&auto=webp&s=69257748d3223d666d6391b0f45390e6816c302e)\n\n  \n",
        "num_comments": 251,
        "comments": [
            "SCP STANDS FOR SERVING CUNT AND PRIDE 🔥🔥",
            "There's something oddly fitting about a cold organization like the SCP Foundation putting up rainbows. Kinda mirrors the symbolic rainbow flag thing that corpos do (until they got called out for it one too many times).",
            "It’s pride! Forget about the Foundation’s war crimes because they have a rainbow logo now!",
            "Oh it's pride already?\n\nTime to piss off the RPC Authority",
            "This comment thread just shows the average age of this subreddit's members. (Not talking to you LGBTQ and Ally fellas, you're cool).",
            "SECURE, CONTAINING, AND PROTECTING 🗣️🗣️🗣️🔥🔥🔥🔥",
            "Yay! Two if my interests combined! Les go, Foundation! :D -Julian",
            "As a bi man, lame",
            "I wonder if there is a transgender, fan-made scp",
            "Why you added \"fest\" ?"
        ]
    },
    "Pride Month Article Features": {
        "title": "Pride Month Article Features",
        "score": 44,
        "url": "https://www.reddit.com/r/SCP/comments/1d63zpi/pride_month_article_features/",
        "content": "Last year for Pride Month, we showcased articles written by our many incredible LGBTQ+ authors, and this year we're doing it again!\n\nIf you're an LGBTQ+ contributor and you have an article (SCP, Tale, GOI, art page, ect) that's posted onto the wiki that you'd like to have featured, send us a message and we'll put you on the list!\n\nEven if you're not a contributor, you can still participate by reading and sharing the articles we feature! If you create Pride-themed art, feel free to post it here on the Reddit, and be sure to use the tag #SCPride if you post it elsewhere! We'll make sure to share what we see!",
        "num_comments": 2,
        "comments": [
            "Very cool that this sub is doing this ❤️"
        ]
    },
    "Anyone know the code? (Im an idiot lol)": {
        "title": "Anyone know the code? (Im an idiot lol)",
        "score": 242,
        "url": "https://i.redd.it/eglcv2c01h9d1.jpeg",
        "content": "Im a moron and want figure it out if it's actually easy. It's the code in the SCP-3125 document.",
        "num_comments": 61,
        "comments": [
            "55555 if you look at the top of the article you can see the breadcrumbs/ previous links and the one before is \"five five five five five\"",
            "A little late for op but to anyone else I think the mystery of this object is better uncovered by reading the “there is no antimemetics division” tale as opposed to the object article itself.",
            "I tried to say ty to everyone let me know if I missed you",
            "55555, and do read the rest of that series. It's among my favorites of the site.",
            "Don't mind me just summoning Marv (SCP-3125)",
            "Me with the actual book:",
            "My nickname that I gave to scp-3125 is Patrick the Starfish :)🌊",
            "55555\nAs this SCP is for the fifthism, the hint is based on it being 5x5x5x5x5",
            "The factors of the article number ( you are not an idiot, it is just a obvious but hidden code )",
            "55 comments.. niceish (mine is 56th)"
        ]
    },
    "[OC] The Scarlet King": {
        "title": "[OC] The Scarlet King",
        "score": 36,
        "url": "https://i.redd.it/tohcnanrrh9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Smash, next question ... erm, i mean cool art 👍",
            "Bro looks hungry. We should give him a snickers.",
            "Jesus."
        ]
    },
    "Which one is your favorite? And I ask you to choose the next scp that I will draw (I'm uploading it again because I misspelled 😞)": {
        "title": "Which one is your favorite? And I ask you to choose the next scp that I will draw (I'm uploading it again because I misspelled 😞)",
        "score": 24,
        "url": "https://www.reddit.com/gallery/1dr7ov4",
        "content": "",
        "num_comments": 11,
        "comments": [
            "I love SCP-2295. They just wanna help 🥺\n\nAnd SCP-3008. I’m probably basic for it, but I enjoy those.",
            "I like \"The World's Gone Beautiful\" one. Kinda simple, but it looks nice and works in context. \n\nHow about SCP-2547? He's just a silly little trickster guy who's definitely never done anything wrong.",
            "Kind of liked the -953 story. So far, I really liked -999, Tickle Monster (also The Eye Pods), 914/ The Clockworks, 610/ Flesh That Hates and -060/ Infernal Occult Skeleton were creepy as hell. \n\nLiked -261, Pandimensional Vending Machine, 3899/ The Night Hauler, -811/ Swamp Woman, and 1762/ Here Be Dragons.",
            "I think the 953 fox is the best",
            "Can you draw my two favourites, scp-3355 and scp-3883? I understand if you don't want to do the latter",
            "BALLS BOUNCE QUICK SCP - 018",
            "Okay, I'm going to draw these two SCPs. But which draw do you like best?",
            "I LOVE how you did SCP-3000. You managed to capture the scale beautifully. \n\nSorry that I didn’t add that in the first place 😅",
            "- [**SCP-2295 ⁠- The Bear with a Heart of Patchwork**](https://scp-wiki.wikidot.com/scp-2295) (+1132) by *K Mota*\n- [**SCP-3008 ⁠- A Perfectly Normal, Regular Old IKEA**](https://scp-wiki.wikidot.com/scp-3008) (+3266) by *Mortos*",
            "- [**SCP-3355 ⁠- St. Nick**](https://scp-wiki.wikidot.com/scp-3355) (+373) by *djkaktus*\n- [**SCP-3883 ⁠- Dildos Have Dreams Too**](https://scp-wiki.wikidot.com/scp-3883) (+368) by *Zyn, Sly161*"
        ]
    }
}