{
    "Daily Thread - June 29, 2024": {
        "title": "Daily Thread - June 29, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/Seahawks/comments/1dr5ri6/daily_thread_june_29_2024/",
        "content": "Welcome to [r/Seahawks](https://www.reddit.com/r/Seahawks/) Daily Thread! Please use this thread to discuss anything you think that doesn't warrant its own thread.\n\nComments are automatically sorted by new to keep the conversation current.\n\n**GO HAWKS**\n\n[Have you tried the /r/Seahawks Discord?](https://discord.gg/seattlesports1)",
        "num_comments": 0,
        "comments": []
    },
    "Marshawn welcomed the Kraken’s 1 rd draft pick, Berkly Catton at the NHL draft in Vegas. ": {
        "title": "Marshawn welcomed the Kraken’s 1 rd draft pick, Berkly Catton at the NHL draft in Vegas. ",
        "score": 542,
        "url": "https://i.redd.it/cl900ief0f9d1.jpeg",
        "content": "",
        "num_comments": 24,
        "comments": [
            "Love the spokane connection too",
            "Im sad the Raiders abandoned him but so glad it brought him back to us lol",
            "Love it that Marshawn is part of the Seattle welcome wagon.",
            "Damn, I just watched game 7 and they already had the draft?",
            "He has been anointed by the king of man.",
            "Marshawn will forever be ours and its the best.",
            "Gonna tell my kids this is Crockett and Tubbs from miami vice",
            "So kid, can you jump and grab your thang after you score? Is that allowed? Fuck it who cares. Beast mode that shit my dude. -Marshawn \n\nThis is how I envision it. All others just dont understand",
            "Need a Marshawn statue outside of the stadium like the Griffey one.",
            "Absolutely. Hell, he can keep his car plates."
        ]
    },
    "Drawing my uncle did during the 2013 run": {
        "title": "Drawing my uncle did during the 2013 run",
        "score": 124,
        "url": "https://i.redd.it/rjegenbgse9d1.jpeg",
        "content": "",
        "num_comments": 12,
        "comments": [
            "I was there in the stadium for that glorious moment, and went to the Super Bowl too. Even met Shaun Alexander in NYC. Crazy to think that was 10 years ago already",
            "Look at that sorry ass reciever. Go Hawks!",
            "Wow that is so awesome. Very nice. That would look so nice on my wall. Love the drawing.",
            "If you really draw that, you are very talented and can make money, if are not doing so already",
            "Perfect spot on the top of the drawing for like a Sherman autograph",
            "When you try him with a sorry receiver like Crabtree thats the result you gonna get",
            "Sorry ass receiver shouldve  knew better than to try Sherm",
            "Meeting Shaun alexander randomly is crazy, I wish I had your luck",
            "Its beautiful ",
            "A masterpiece"
        ]
    },
    "Another drawing my uncle did": {
        "title": "Another drawing my uncle did",
        "score": 54,
        "url": "https://i.redd.it/ctvuogemse9d1.jpeg",
        "content": "I believe this one he did after our superbowl win",
        "num_comments": 6,
        "comments": [
            "This is VERY GOOD, sick as hell and one million times better than I could ever do, but all the hawk logos in the background and the mini Russ on top really remind me of those times the AI art generator goes buck wild with a prompt.",
            "One of my favorite Seahawks of all time.  Unfortunately the business ruined him.  That is a bad ass painting.",
            "lol I get what you mean but I can promise you this is my uncles real art, he did this back in 2013 before ai art was around. He told me he used pics from the sports pages when hed draw this type of stuff since he lived there",
            "Proudly hung up on my wall now",
            "Oh, shoot, no. I didnt mean to say it is AI I just meant it was funny that it kinda looks that style wayyy before Dall-E and a lot of those generators were prevalent/accessible",
            "Oh very nice!"
        ]
    },
    "Are preseason games just as good? ": {
        "title": "Are preseason games just as good? ",
        "score": 30,
        "url": "https://www.reddit.com/r/Seahawks/comments/1dqb39s/are_preseason_games_just_as_good/",
        "content": "Thinking about coming down from Canada on August 24th for the Browns game. I’ve never attended an NFL game and hope this can be a great first time. Are preseason games still pretty hype and intense-ish? Thank you!!! ",
        "num_comments": 73,
        "comments": [
            "Just as good? Absolutely not. I mean there are no real stakes, and half the players you see wont even make the team.\n\nTHAT SAID preseason games are super fun to attend in their own right!",
            "If youre semi local, Preseason games are fun and wayyyy cheaper than the regular season games. I snagged $25 tickets to the preseason home opener last year and had a blast. Heck, if youve never been the stadium before, what better time to check it out than when youve got cheap tickets for a preseason game? \n\nThat said, the atmosphere is nothing compared to a regular season game. Id say a preseason game is more like a day of watching baseball in terms of vibes. A lot more casual.",
            "Save your money and come for a regular season game.",
            "No. No, man. Shit, no, man. I believe you'd get your ass kicked sayin' something like that, man.",
            "The first preseason game is okay because everyone is jonesing for football. The third preseason game has historically been a decent one because the starters typically play an entire half and the first drive of the second half. Now that theres only 3, its not guaranteed who will play. It will never be as hype as a regular season game, but by all means come and enjoy the game, our city and stadium. Its still loud and pretty energetic",
            "Went to one last year. I had fun. Not as good as a regular season game but if its all you had time for or can afford I think its worth it.",
            "No. Especially because they dont play starters. They dont want injuries before the season begins.",
            "Enjoy a day out. Just don't expected too much. It's always fun to be at the stadium",
            "No. The best players sit out most of, if not all of the game and the games are meaningless to the season. It's just a way to basically get game reps before the season officially starts and figure out which players you wanna keep on your roster.",
            "There is a very noticable difference in the feeling during a preseason and a regular season game.\n\nI have had a lot of fun at preseason games though, so if you're in town during one it would absolutely be fun to go"
        ]
    }
}