{
    "20 June, 2024 - 3.0.2 Update | Bug Reports Megathread": {
        "title": "20 June, 2024 - 3.0.2 Update | Bug Reports Megathread",
        "score": 4,
        "url": "https://www.reddit.com/r/Seaofthieves/comments/1dk8dqe/20_june_2024_302_update_bug_reports_megathread/",
        "content": "Ahoy!\n\nThis thread is in place to centralise bug reporting for the 3.0.2 update, and improve visibility for Rare. **Don't forget to also report these via [official support system](https://support.seaofthieves.com/hc/requests/new)**\n\nPlease only post a comment if you wish to state a legitimate experience of a bug, and only if the bug hasn't already been posted. For general discussion about the season please visit the [Discussions Megathread](https://www.reddit.com/r/Seaofthieves/comments/1dk8e0l/20_june_2024_302_update_discussions_megathread/)\n\nAny root comments not relating to bugs within this version will be removed. Expansive replies such as \"I've experienced this too, but only on this island\" for example, are allowed.\n\n----------\n\n[Previous 3.0.1 Bug Reports Megathread](https://www.reddit.com/r/Seaofthieves/comments/1cypytt/23_may_2024_301_update_bug_reports_megathread/)",
        "num_comments": 45,
        "comments": [
            "After diving to a seafort I looked at the map and every ship was showing as if I was the captain of all of them I could see position and ship type.",
            "Buying supplies from the Merchant's still an issue... It's been \"patched\" 4 times... Being Rare, it's not rare at all.",
            "The game keeps freezing on playstation 5!!!!!!!! When I play solo it's fine but with a friend I can't play the game. It freezes every 10 minutes and I have to restart the whole game. Sometimes it just keeps freezing over and over. Solo is fine. I read another post on reddit and a bunch of people are experiencing the same problem!!!!! FIX IT, its unplayable.",
            "3 separate treasuries for the breath of the sea. I stored them in a chest at the end of it and when i claimed the loot from the mermaid, the chests that they were in had empty spots where they were. They vanished. 3 separate times. Everything else was there, just not the breath of the seas which was the whole point ya know?",
            "On sloop after moving the mast from one side to the other I constantly have the sound of the mast being moved too far. It goes away when the sail is fully raised but comes back once it’s lowered.",
            "Captain supplies getting delivered is still bugged and not consistently working",
            "After this update my computer runs the game with 10 FPS, it use to be 80 or more FPS. I've tried to put all the settings in LOWEST and HIGHES. It's really boring I can't play anymore....",
            "If you hold the throwing knife power attack and then stash it before releasing, if you swap to any tool that requires interaction like the telescope you wont be able to use it properly until going back onto the throwing knife.",
            "Merchant voyages don't give rewards",
            "When I play my game, it runs for about 10 minutes before freezing then crashing. No error reports. I’ve tried reinstalling multiple times.\n\nPC Steam"
        ]
    },
    "20 June, 2024 - 3.0.2 Update | Discussions Megathread": {
        "title": "20 June, 2024 - 3.0.2 Update | Discussions Megathread",
        "score": 110,
        "url": "https://www.reddit.com/r/Seaofthieves/comments/1dk8e0l/20_june_2024_302_update_discussions_megathread/",
        "content": "Ahoy! This post is created specifically for discussions of update. Some other useful links to follow:\n\nFor bug reports please comment on [3.0.2 Update | Bug Reports Megathread](https://www.reddit.com/r/Seaofthieves/comments/1dk8dqe/20_june_2024_302_update_bug_reports_megathread/)\n\n[Previous 3.0.1 Discussions Megathread](https://www.reddit.com/r/Seaofthieves/comments/1cm9hg3/7_may_2024_3001_update_discussions_megathread/)\n\n[Safes Seas FAQ](https://www.seaofthieves.com/community/forums/topic/161991/safer-seas-faq)\n\n[Sea of Thieves 2024 Preview Event](https://www.reddit.com/r/Seaofthieves/comments/1bjfbhq/sea_of_thieves_2024_preview_event/)\n\n[Sea of Thieves Season 12: Official Content Update Video](https://www.reddit.com/r/Seaofthieves/comments/1cdl2g5/sea_of_thieves_season_12_official_content_update/)\n\n[Sea of Thieves Explained - Playlist](https://www.youtube.com/playlist?list=PL51podOC3ZN0M7mvsI8vdfGSn1RN32JFU)\n\n---\n\n[Official Release Notes](https://www.seaofthieves.com/release-notes/3.0.2)\n\n# Gameplay Improvements\n\n### Ship Speed Rebalancing\n\n* The Sloop, Brigantine and Galleon have all received a set of speed changes, balancing each ship type and placing more emphasis on ship direction and sail management during naval encounters.\n\n* In a straight tailwind scenario, the Galleon with its three sails angled to the wind will now gain the advantage, followed by the Brigantine, then Sloop.\n\n* In a straight headwind, the Sloop will have less wind resistance from its single sail and will be at an advantage over the Brigantine, and then the slower Galleon.\n\n* Sidewind and crosswind scenarios will also now favour the Galleon when all sails are catching the maximum amount of wind. However, Galleon crews who mismanage the wind will suffer the largest penalty.\n\n### Sailing into a Headwind\n\n* Ships heading into a direct headwind will now be required to angle the sails to reduce the wind resistance and maintain their speed over longer distances. Sailing with sails flat into the wind will no longer be optimal.\n\n### Double Barrel Pistol Balancing\n\n* The damage of standard and charged shots from the Double Barrel Pistol has been increased.\n\n* A charged shot now takes less time to charge, allowing players to prepare this heavy-damage attack more quickly.\n\n* Hip firing the Double Barrel Pistol is now slightly more accurate.\n\n* Reload time has been reduced, allowing players to reload more quickly and get back into the action.\n\n### War Chest Commendation Balancing\n\n* Following the launch of Season 12, the team has adjusted a number of Commendations from the War Chest, reducing the criteria needed to unlock the various Grades. Players with progress already above the newly rebalanced levels will be required to perform one more action to refresh the Commendation progress.\n\n* When using the Double Barrel Pistol to defeat enemy threats, the Blown-Away Bones, Blam of the Damned and Double Deep Trouble Commendations will now progress more quickly.\n\n* Utilising throwing knives to attack Gunpowder Skeletons will now progress the Keg Knife Kaboom Commendation more quickly.\n\n* Players using scattershot against enemy threats will find the Holey Wood Holes, Scatter Bones, Spooky Spread and Peppered Meg Commendations have been made easier to obtain.\n\n* Using the Bone Caller to attack Skeleton Ships will now progress the Skeleton Squared Commendation more quickly.\n\n* Crews cashing in the Horn of Fair Winds will now find the amount needed for the Storm Sale Commendation has been reduced.\n\n* Players using harpoon tightropes to transfer treasure to their ship will now progress the Carry On Lootin’ Commendation much more quickly.\n\n* The Rib Roast and Title Fight Commendations requiring players to best Skeleton Lords in combat have now been switched to provide progress to the whole crew when defeated, rather than only rewarding a single player.\n\n### Hit Registration Improvements\n\n* Recent improvements to hit registration for player encounters have now been brought to threats encountered within the world, providing an improved ranged combat experience against skeletons, Phantoms and Ocean Crawlers.\n\n---\n\n# Pirate Emporium\n\nShow off your personal style with purchases from the Pirate Emporium! Pick up exclusive cosmetics such as ship liveries, costumes, weapons, pets and emotes using your Ancient Coins, purchasable with real money. Head to the Pirate Emporium page to browse and buy the latest additions!\n\n### New Items – Now in Stock!\n\n* Pet Protector Ship Collection\n\n* Dire Dark Warsmith Ship Collection\n\n* Dire Dark Warsmith Ship’s Crest\n\n* Dire Dark Warsmith Weapon Bundle\n\n* Dire Dark Warsmith Costume Set\n\n* Paradise Garden Costume Set\n\n* Paradise Garden Weapon Bundle\n\n* Painted Cat Collector’s Pet\n\n* Storm Strike Curse\n\n* Stormfish Chaser Clothing Bundle (returning from Season Ten Plunder Pass) \n\n* Baleful Bloom Costume Set (returning from Season Seven Plunder Pass)\n\n* Tiny Tree Emote (free!)\n\n---\n\n# Outpost Cosmetics \n\n### New Outpost Stock!\n\n* The Outpost weapon shops now stock a further range of Heavy Swords and Rapiers from the Ocean Crawler, Deep Ocean Crawler and Azure Ocean Crawler sets, locked behind their associated Commendations.\n\n* The Crustacean Courtly Jacket is also available from the Outpost clothing shops for those with enough gold to spare.\n\n* Players who have reached reputation level 65 with the Gold Hoarders will now unlock access to the Gold Hoarders Boots, currently found in the Outpost clothing shops but moving to the Gold Hoarders representatives in a future update.\n\n---\n\n# Updates\n\n### Front End Pirate Log Access\n\n* The Pirate Log is now conveniently accessible from the front end menu when launching Sea of Thieves! Players can now more easily check their Season and reputation progress before joining a session on the seas.\n\n### Player Reporting Improvements\n\n* A QR code has been added to the Report a Player menu to provide easier access for console players wishing to submit a report via a mobile device.\n\n### PlayStation®5 Voice Chat Notifications\n\n* In-game voice chat notifications for speaking players will now be shown with the appropriate colour for a crew member or Alliance member.\n\n---\n\n# Fixed Issues\n\n### Gameplay\n\n* ‘The Lair of LeChuck’ – Players will no longer become stuck after the LeChuck fight or the wedding ceremony and can now once again consistently complete the Tall Tale.\n\n* Crews purchasing Captain’s Supplies from the shipwright should now consistently find their supplies are delivered to their ship’s barrels.\n\n* Players can no longer achieve full billow with the Horn of Fair Winds without it losing its charge when used.\n\n* Players should no longer find themselves joining a session in an empty grey scene when attempting to rejoin a previous session.\n\n* Attacking a Chest of Rage with a range of weapon types will now consistently enrage the chest.\n\n* Players are no longer able to swap between platforms in rapid succession and gain access to exclusive cosmetics in their session.\n\n* Selling Ashen Chests recovered from Ancient Vaults will now progress the correct Ship and Pirate Milestones.\n\n* Players using inverted mouse controls will no longer find their input switched when diving or surfacing for a Faction battle.\n\n* Food items will no longer appear in Cannonball Barrels at Skeleton Forts.\n\n* When starting an Ashen Emissary Voyage as an Athena’s Fortune Emissary, the island chosen for the map will no longer be situated outside The Devil’s Roar.\n\n* The Ashen Chest found inside the Vault at emergent Skeleton Fort encounters will now be unlocked by default.\n\n* ‘The Lair of LeChuck’ – Players will no longer be able to defeat LeChuck while inside the church before he has a chance to retaliate.\n\n* ‘Shores of Gold’ – Diving to a Tall Tale checkpoint should no longer return the crew to a nearby Outpost.\n\n### Emporium Extravaganza Event\n\n* The Ancient Coin Trinket erroneously granted to some players during this Event has now been removed from those inventories. Players who legitimately obtained the Trinket are unaffected and will retain their reward (please raise a ticket with our Support team if you encounter any issues with this).\n\n### Throwing Knives\n\n* Players will now be able to jump freely if they stow their throwing knife while charging a heavy strike.\n\n* Players will now be able to run if they stow their throwing knife while aiming.\n\n* Throwing knives embedded in ships’ ladders will no longer prevent players from grabbing on to the ladders.\n\n* Throwing knives at a Gunpowder Barrel held by a player will now consistently cause the keg to explode on impact.\n\n* Players fighting the Ghost of Graymarrow with throwing knives will now deal the intended amount of damage.\n\n* Players engaging in Raid Voyages with throwing knives will now deal the intended amount of damage to enemy threats.\n\n### Double Barrel Pistol\n\n* Players holding aim and fire while reloading will now consistently see the weapon switch to an aimed state and begin to charge.\n\n* Players holding aim and fire then releasing while reloading should no longer see the weapon briefly switch to an aimed state before returning to idle.\n\n* Players are no longer able to skip the animation for pulling back the second hammer when firing.\n\n* Players fighting the Ghost of Graymarrow with a Double Barrel Pistol will now deal the intended amount of damage.\n\n* Players engaging in Raid Voyages with a Double Barrel Pistol will now deal the intended amount of damage to enemy threats.\n\n### Environment \n\n* The cannons on the north side of Kraken Watchtower are now visible when they shoot at vessels.\n\n* Crews diving to a Raid Voyage within the Treasury of the Secret Wilds will no longer discover gold piles which cannot be claimed.\n\n* Players will now consistently be able to pick up and take items from Collector’s Chests inside the Shrine of Ocean’s Fortune.\n\n* Removed a number of areas where players could fall out of the environment within the Pirate Legend Hideout.\n\n* The Glorious Sea Dog Tavern no longer features invisible objects around the island.\n\n* ‘The Legend of Monkey Island’ – A Vanity Chest has been added to the circus stage, enabling players to remove the Skeleton Curse if they have one equipped in order to put on the circus costume.\n\n### Visual and Audio\n\n* Crews defeated in a Faction battle will now experience a smooth transition into and out of the Tunnels of the Damned.\n\n* Players using the Skull of Siren Song will now animate smoothly between wielding and using the weapon.\n\n* Sprinting onto a harpoon tightrope with a weapon equipped will no longer cause the weapon to be wielded, letting players move smoothly along the rope.\n\n* Lesedi’s Spyglass will no longer change into another spyglass when the player dies or rejoins their session with the item equipped.\n\n* The Barrel Bombardier and Checkmate Cannons now display correctly when viewed at all distances.\n\n* The Deadlock Jailer Costume now better fits pirates of all body types.\n\n* The Flaming Jackal Pocket Watch now displays the correct date.\n\n* PC players using AMD GPUs and DirectX12 should now consistently see visual effects from fireworks when fired.\n\n* ‘The Legend of Monkey Island’ – Items will now appear at the correct size when held by players during the Tall Tales.\n\n* ‘Captains of the Damned’ – When voting on the Tall Tale, one dagger will now appear on the Tall Tale book to show the player selection.\n\n### User Interface\n\n* Players should now be able to purchase the relevant promotions once they have reached the required Company reputation level.\n\n* After purchasing a Ship Renaming Deed from the Emporium in the front end, players should be able to rename their ship without needing to restart the game.\n\n* When purchasing a ship, having a ship name rejected will no longer temporarily cause the ship price to appear as free.\n\n* All barrels around the Sea of Thieves will now have category item counters, as intended.\n\n* Players will now see an infinity symbol on replayable Voyages in the Quest Table menu.\n\n* Switching quickly through the What’s New articles should no longer display the incorrect imagery alongside a piece of news.\n\n* When playing on Xbox Series X, viewing a ship from the ‘Select a Ship’ flow in the front end will now correctly display the ship’s sails without visual issues.\n\n* The Guild Motto displayed in the Guild Branding screen now consistently matches the one that was selected during Guild creation.\n\n* The pickup interaction for placed pets will now always be visible above the ground.\n\n* Dismantling a ship no longer warns players of losing Captain’s Voyages.\n\n* Playing in windowed mode on PC will now correctly display the front end session setup screen.\n\n### Text and Localisation\n\n* The description of the Quite the Collection Commendation has been updated to include the requirement to be representing the Guardians of Fortune when handing in Reaper’s Bones Emissary Flags.\n\n* Improvements made to Tall Tale Quest Books to resolve a range of text issues for those playing in Japanese.\n\n* Improvements made to text sizes within Tall Tale Quest Books to resolve overlapping text across a range of non-English languages.\n\n* ‘The Legend of Monkey Island’ – The localisation of the Sword Master has been updated to follow the correct terminology in the Korean language translation.\n\n### PlayStation®5\n\n* Players on PlayStation®5 choosing to disable crossplay will now be able to consistently join Open Crew sessions with other players from their platform.\n\n### Performance and Stability\n\n* Players leaving a crew during a session should no longer cause other crew members to be disconnected from the game and experience a Longbeard error.\n\n* Further improvements made to game stability to reduce scenarios where players unexpectedly exit the game or become disconnected from their session.\n\n* Improvements made to memory management to reduce scenarios where players may experience a sudden disconnection on lower-performance PC and console hardware.\n\n* Sea of Thieves on Steam will no longer unexpectedly close if the game is started on an HDR screen then dragged to an SDR screen during startup.\n\n* Improvements made to texture streaming on the front end for lower-performance PC hardware, reducing scenarios where players may experience textures failing to load and leaving them shown at poor quality.\n\n---\n\nDownload Size:\n\nXbox Series X: 4.83 GB\n\nXbox Series S: 3.35 GB\n\nXbox One X: 4.83 GB\n\nXbox One: 3.35 GB\n\nMicrosoft Store: 4.16 GB\n\nSteam: 3.89 GB\n\nPlayStation®5: 1.81 GB",
        "num_comments": 159,
        "comments": [
            "Thank FUCK the monkey island tall tale is fixed.",
            "* Crews purchasing Captain’s Supplies from the shipwright should now consistently find their supplies are delivered to their ship’s barrels.\n\ni can't recall how many times they said they \"fixed it\" only to find out next hourglass fight I have no food",
            "I hope they fixed the ship name not displaying when spyglassing, or when coming out of the water during HG.  \nI also didn’t see it mentioned that steam players often are locked out of being able to invite anyone to guild.  We’ve had a guild for weeks we cannot invite anyone to unless we sign into the MS version.",
            "Silent Boarding as we know it may be fixed now. There's a new sound that plays when you grab boarding ladders on boats. I tried the silent board methods I know and it no longer works.  It sounds like a chest being dropped on the deck or something. I tried ctrl+f searching and didn't see anything in the patch notes about it and I can't see why they wouldn't make a note about it. At least it's fixed now™",
            "Can we fix not getting supplies you paid for from the merchant too? It's been 1000 years 😔",
            "Anyone know the new total for finishing the wind caller comm?",
            " [Good to know the Ship Banner bug is still in the game](https://i.imgur.com/sYgUcbz.png)\n\nNot even listed as a \"known issue\". Core part of Captaincy update that came to the game 2 years ago is still not working.",
            "Not seen much discussed about server stability improvements during PvP. Games have been a laggy mess with players' jitter all around your boat when in a fight. Shot reg is still a huge mess. Doubt, this will ever get fixed. In terms of receiving supplies after purchase, this has been an issue for ages. Been \"patched \" more times than I can remember, never fixed the issue before, Doubt it will this time.",
            "So if I understand the ship speed adjustments, the brig no longer has “optimal” sail/wind position to outrun a pursuer? The sloop had against the wind, galleon with the wind, and brig with the cross wind. Now the galleon as the speed advantage with tail AND crosswinds? Where does the brig fit in now? I see that the galleon needs strong sail management for cross winds but it feels like a strange balancing choice.",
            "It’d be nice if we could just dive to an outpost as an “officially-sanctioned” form of server hopping. All types of players would probably benefit from that option, I imagine."
        ]
    },
    "Did anyone else notice the Stormy Sea Dog Concertina was from A Pirates Life?": {
        "title": "Did anyone else notice the Stormy Sea Dog Concertina was from A Pirates Life?",
        "score": 39,
        "url": "https://www.reddit.com/gallery/1dr1f5f",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Interesting. Now I want his hat",
            "Aye donkey fer sure , mate!!  perhaps with a  fancy slot fer a keg/chest upon each side, aarrrrr ...",
            "Screw the hat, I want the donkey!",
            "![gif](giphy|9wx3Ah9HBCywU)",
            "Hell yeah!"
        ]
    },
    "Played servant with some friends and one balled the entire enemy crew": {
        "title": "Played servant with some friends and one balled the entire enemy crew",
        "score": 415,
        "url": "https://v.redd.it/ohk9fxbq2b9d1",
        "content": "",
        "num_comments": 64,
        "comments": [
            "OP try to keep a cannonball crate or at least a storage crate with some cannonballs near your cannons, that way you don’t have to run down and be off cannons for too long",
            "I thought one balling referred to oneshotting someone with the cannon ball, not just killing someone when they've already taken damage",
            "Ballsy play",
            "That last guy was jumping around like “_me next! me next!_”",
            "One ball DOES mean one shot, one kill. Misleading title, but OP did state his mistake so....not holding it against him. Much. ![img](emote|t5_38oz1|2228)",
            "Oh baby a triple",
            "Well played. What language are you speaking?",
            "Nice",
            "Allahu ahkbarrrrr",
            "Turn off the shake please, help me help you"
        ]
    },
    "3 weapon loadout glitch": {
        "title": "3 weapon loadout glitch",
        "score": 298,
        "url": "https://v.redd.it/hx49jpvefb9d1",
        "content": "Idk how i did it but i permanently had 3 weapons until i got off the game. I even had to reset my game cuz of another but and i had 3 weapons when i got back in\n\nIm not sure how but it keeps your loadout that you select but keeps the cutlass in a weapon slot between 1 and 2. For example i had a blunder and eor, but when i cycled the weapons it went blunder -> cutlass -> eor",
        "num_comments": 80,
        "comments": [
            "Btw this vid isn't showing how to do it before ppl get mad, it's just me realising i have 3",
            "I posted this glitch almost a year ago but the mods removed it.",
            "I had something similar to this, but I had 2 swords for a few seconds instead. Idk how it happened",
            "Finally, the triple gun",
            "Better to spread the exploits around to even the playing field than to die because you have a disadvantage. \n\nAnything not progression/game breaking should be common knowledge.",
            "We are about to add a RDR2 weapon wheel of a inventory.",
            "Getting to have a sword with your blundy-snipe meta loadout would be beyond broken 😅",
            "Ngl id like this for the double barrel pistol and throwing knives achievements.",
            "How",
            "nah im sure there is some pvp based discord where they are hoarding this info thinking it makes them better at the game not realizing internally its just another form of cheating, same as scud launching and silent boarding.  just because all your friends are doing it doesnt make it ok."
        ]
    }
}