{
    "There is nowhere better than Seattle in the summer": {
        "title": "There is nowhere better than Seattle in the summer",
        "score": 1286,
        "url": "https://i.imgur.com/vtmVHpe.jpeg",
        "content": "",
        "num_comments": 224,
        "comments": [
            "Seattle is great in the summer.. I wish it lasted longer.",
            "Lake Union is a gem for Seattle. A calm lake in the middle of the city. Beautiful.",
            "Have fun in the sun! ☀️ I always feel a sense of jubilance when I see Mt. Rainier peeking out from a distance while entering I-90 West from I-5 after days of rain/cloud. ![gif](emote|free_emotes_pack|grin) Also makes me feel less irritated when I’m stuck in that forsaken traffic. 😂",
            "It’s still the spring 🤓\n\nBut yes I agree",
            "Pic taken on my lunch break. Wild how everything in the city gets 300% better when it's sunny & 70+",
            "Shhhh...no, it's cold and rainy and grey all summer long except when the wildfire smoke engulfs the region for weeks on end and we get a 100+ degree heat dome on us. It's awful. Don't let people come here.",
            "Extremely true. Summers here are gorgeous. At least when the smoke isn't rolling in.",
            "True. There's usually 4 months of great weather, 4 months of good weather and 4 months of not so good weather.\n\nThat's actually as much as most places not in California get. Florida is too hot and rainy for much of the spring and summer. Other places are too cold and snowy.",
            "Yep. Tough to beat Seattle on a summer day.",
            "Portland maybe? Butt I'm biased. West of Cascades, best of cascades regardless. Summer is *perfect* here"
        ]
    },
    "Anyone have tips on how to get vagrants to keep moving without it turning into a big deal?": {
        "title": "Anyone have tips on how to get vagrants to keep moving without it turning into a big deal?",
        "score": 108,
        "url": "https://www.reddit.com/r/SeattleWA/comments/1dr17k1/anyone_have_tips_on_how_to_get_vagrants_to_keep/",
        "content": "At work about once a day I have to ask someone with clear mental health problems to move off the property. I won’t delve into the details too much but it’s not about the businesses appearance, there are legitimate safety and risk management issues that arise from their presence and it’s simply not a place that tweakers and the mentally ill can exist in so it’s pretty important that they gtfo.\n\nAnyways, every single time I have the exact same experience and I was just hoping if anyone has any advice.\n\nHere’s how it goes:\nIn a respectful, not condescending or rude tone: “Hey man sorry we’ve gotta have you keep moving, we can’t have you around here while we’re in operation”\n\n“This is public property(it’s not)/You’re harassing me(I’ve politely asked you to leave once)/fuck you”\n\nAt this point, the profanity-laden ramblings start every. single. time. They get angry, they throw rocks, they intentionally destroy shit, make death threats, etc. I’ve lived in seattle my whole life so I get the drill and just give myself space and call the cops and eventually the homeless dude gets it out of their system and leaves and then the cops show up three hours later and do fuck all and just ask what they looked like and then I go home and wake up the next day and do it again.\n\nHow the hell do you get these people to just leave? Any thoughts?\n\n\n",
        "num_comments": 146,
        "comments": [
            "Ok so I have 10+ yrs of experience in conflict and dispute resolution, including a masters’ in social work and a certificate in peace studies.\n\nWhen we had an issue with a homeless dude shitting in our alley repeatedly I tried a variety of things, the only thing that was effective was when I ran outside with a stainless steel wok and giant butcher knife, banging them together like a mad woman, and shouting “BEAT IT, FUCKO!” Sometimes you just need to out crazy somebody for them to decide your juice ain’t worth the squeeze.",
            "I had a guy hanging around and I told him, truthfully, that I had a social worker coming to help him.  I didn't see him again for 3 years.  Checked with the social worker, they never found him.",
            "It’s not the answer anyone wants to hear but when I had to do this working in mass transit, I kept a pack of cigarettes (I don’t smoke) and used them for the most difficult folks. “I’ll give you a cig to leave” lol. \n\nOtherwise not much else works. Luckily for us in transit we have sheriffs at our disposal but even they can take up to an hour to remove someone from a bus or train peacefully",
            "Have you tried not being nice? They are expecting you to be timid. They are counting on you to back down. Don't give them that. \n\nPractice your best \"GET THE FUCK OUT OF HERE BEFORE WHOOP YOUR ASS\". Even non-vocal animals, like dogs and bears, will back off if you can make yourself threatening enough.",
            "Give them a cigarette or a coupon to McDonalds if they’ll leave ..",
            "As someone who used to work security downtown, it's often going to immediately turn into yelling as soon as they're confronted(despite being polite, it's how they'll see it). It often helped me to have suggestions of places they can go; shelters, parks, libraries, etc. The recommendation of picking up the phone and going through the routine of a 911 call also usually works pretty well.",
            "If your workplace is dangerous to have people wander into then there should be fences and security barriers up, as well as clear warning signs about the safety hazards. I’dd talk to whoever is in charge of such things at your company.",
            "Get your cellphone out and faux dial the cops (they're not coming anyway though). Or start recording. Be prepared to run if this escalates their behavior. \n\nThese people are the nastiest, meanest. They always go for the jugular, calling me a gay slur or the n word (I'm white)",
            "I know your building. I really love your flowers and trees. You probably have an automatic sprinkler system that comes on at random intervals.",
            "You won't do violence. They known you won't do that.\n\n\n\n\nThis is why stores have resorted to playing music and cities have made benches a burden to sleep on.\n\n\n\n\nI'm not condoning harming people--Like, are you going to hit someone with a baseball bat for loitering? You are going to have to deal with it until someone does it for you. The city council, police, vigilantes, you... nobody will do it."
        ]
    },
    "Biden failed to wow in the first presidential debate. WA Dems want voters to focus on November": {
        "title": "Biden failed to wow in the first presidential debate. WA Dems want voters to focus on November",
        "score": 93,
        "url": "https://www.kuow.org/stories/president-joe-biden-failed-to-wow-in-first-presidential-debate-washington-democrats-want-voters-to-focus-on-november-general-election",
        "content": "",
        "num_comments": 248,
        "comments": [
            "This debate proved that the establishment (both sides) does not represent nor cares for the people. Plain and simple.",
            "Oh no, he wowed.",
            "“Failed to wow” is a gross understatement.",
            "I wowed at how quickly the border patrol union tweeted that they have never and will never support Biden, just minutes after Biden claimed they support him. 🤣",
            "I said wow quite a few times.",
            "What President Biden is going through is elder abuse plain and simple. People need to be held accountable for what they’re doing to that elder statesman. \n\nRepubs are stuck with Trump but Dems are now stuck with whoever the party chooses for them. American politics is a joke.",
            "Ask yourself, who actually attempted to answer questions?",
            "\"failed to wow\" \nWow",
            "A Douche and a Turd Sandwich again.   Awesome.",
            "If you take a moment to look, there is little difference between Biden and the reconstruction of Ramesses II. I argue they are the same.\n\n[https://www.dailymail.co.uk/sciencetech/article-13580229/face-ancient-Egypt-Ramesses-pharaoh.html](https://www.dailymail.co.uk/sciencetech/article-13580229/face-ancient-Egypt-Ramesses-pharaoh.html)"
        ]
    },
    "World's best female golfer attacked by Seattle viscious dog": {
        "title": "World's best female golfer attacked by Seattle viscious dog",
        "score": 460,
        "url": "https://i.redd.it/4dmt91qcnb9d1.jpeg",
        "content": "",
        "num_comments": 337,
        "comments": [
            "Vicious:  dangerously aggressive, savage \n\n\nViscous: having a thick or sticky consistency.",
            "As someone who was also attacked by a dog in Seattle. Please leash them.",
            "But my dog is fRieNDly.",
            "Why do people not leash their dogs?! I’ve seen unleashed dogs at children’s play areas too! It’s infuriating! \nYOUR DOG IS NOT YOUR BABY. Leash them!",
            "I’m a runner and got bitten once as a teenager in Gas Works, and now I carry mace. I’ve had to mace people’s dogs not once or twice, but FIVE times in the last ~15yrs. If your dog is off leash and runs up to me while I’m jogging and gets within arms length of me, I consider that a threat to my safety, and it’s getting maced. I do feel bad for the dogs, it’s not their fault their owners suck, but I’m not getting bitten again.",
            "Ugh. Leash your dogs people.",
            "\"but he doesn't bite! he's friendlyyyyy!\"",
            "If only Seattle enforced the leash laws. Like confiscating your dog to the pound. Usage would go up to like 100% overnight.",
            "dog owner about to be getting sued for the amount of the tournament winnings, on top of everything else. and rightfully so.",
            "Gotta love shitty people and their shitty dogs. A true match made in heaven. I hope she sues that person into poverty."
        ]
    },
    "Nicholas Kristof: Is West Coast liberalism more focused on ideology than results?": {
        "title": "Nicholas Kristof: Is West Coast liberalism more focused on ideology than results?",
        "score": 135,
        "url": "https://www.msnbc.com/morning-joe/watch/nicholas-kristof-is-west-coast-liberalism-more-focused-on-ideology-than-results-213643845504",
        "content": "",
        "num_comments": 76,
        "comments": [
            "Yes and as a result, I can't subscribe to all of progressive party platform as a whole anymore. stop getting in your own way.",
            "This line stood out to me:\n\n\"The measure of success for progressivism should be progress.\" Agreed; and by that measure the response to homelessness and its root causes has been an abject -- and eye-wateringly expensive -- failure.",
            "Dow Constantine declared homelessness a crisis in King County in 2015.  He has been in charge of our response ever since.  Billions of dollars have been spent.  We currently have more homeless people here than we ever have.  Dow wants several more billions of dollars, for the purpose of doing the same exact things he's been doing for the last decade on a grander scale.\n\nThe only way you can argue that he's focused on results is if the result he's concerned with is keeping homelessness in everybody's face so that they'll keep approving new taxes and levies and the goverment has a bottomless and ever-escalating revenue stream in perpetuity.  In which case he's doing a stellar job.",
            "Yes, when they see compassion as stepping back and watching people in squalor on the streets, in a zombie-state, baking to death in the sun. That is not compassion. When they’re more focused on screaming about some issue on the other side of the globe instead of the homeless dying in our city or kids being shot by gang members- that is not compassion. It is posturing their ideals for their followers. They don’t really want to help, they want to feel like they’ve helped without doing any actual work; they want to appear compassionate without actually knowing a thing about the issues they claim to care about. \n\nI’m liberal in that I don’t want necessary medical treatment to be criminalized, and I don’t want my gay neighbors to be outlawed or hate-crimed from loving/marrying who they want. But I also think those gay neighbors have every right to carry a gun and not worry about their property being vandalized by people out of their mind on fent. \n\nThere are basically zero candidates toting these ideals of mine. It is either completely hands off the opioid crisis and homeless while allowing people their personal freedoms, while taxing every little tiny thing in the city and doing what exactly with the money? No one knows! Or it is completely ass backwards evangelical bullshit locking down women’s bodies, forcing gays back into the closet and encouraging bigotry- but at least they are actually acknowledging the homeless DO cause harm to the neighborhoods they inhabit? Unfortunately, I value my bodily autonomy and friends right to exist more than kicking out the crackhead who shits outside my apartment. \n\nEverything sucks 💕",
            "West Coast liberalism is built on making its proponents to feel good. That’s it - nothing more. \n\nThese people would shill for gun control - but buy guns nonetheless, weep about “stolen land” - but refuse to move out, wear BLM pins - while sending their kids to private schools and living in a gated communities, feel nonchalant about homelessness and drug use - in the neighborhood they don’t live in. They are “concerned” about police brutality - but will call cops for any nonsensical reason. It’s hypocrisy dialed to 11. \n\nThey play ethnicky jazz to parade their snazz on a 5 grand stereo.",
            "You want a hot take? West Coast Liberalism is focused on delivering unaccountable cash to political allies, who then return a portion of it back to the politicians in payment. \n\nNo one in California cares that they’ve spent untold billions of dollars on a few dozen miles of high speed rail, that it costs more to build public transit here than almost anywhere else in the world for a substandard product, that billions of “investments” in things like rural high speed internet bring service to a few dozen residences or that literal billions of dollars are being spent to combat a homeless issue that only appears to be getting worse. \n\nIt’s robbery, plain and simple.",
            "Always has been.  Feelz > Realz",
            "Extremism is about saying the right thing and being part of the in group, not whether you actually practice it or care about results.\n\nThis is why thought policing happens in proggo circles and evangelical churches.  Extremists on both sides are basically the same.",
            "Oh, they are definitely getting results. Results you can smell.",
            "Virtue signaling is not a conspiracy"
        ]
    }
}