{
    "r/Sekiro Moderation Update & Discord Server": {
        "title": "r/Sekiro Moderation Update & Discord Server",
        "score": 39,
        "url": "https://www.reddit.com/r/Sekiro/comments/18dm440/rsekiro_moderation_update_discord_server/",
        "content": "*Hello r/Sekiro! I'm pleased to bring a long-awaited announcement involving some upcoming changes.*\n\nIn light of moderation team turnover, we aim to give this subreddit a long overdue facelift: Moderation improvement, visual overhaul and fixes to sidebar info among other things. Stay tuned!\n\nFor those unaware, we also have a Discord Server over at [https://discord.gg/sekiro](https://discord.gg/sekiro). We are currently running a photography competition, with a couple days left to submit entries - we'd love to see yours!",
        "num_comments": 20,
        "comments": [
            "Dude what the hell is this icon you put on?",
            "Well This is gonna be interesting to see.\n\nCongratulations.",
            "Hooray! Time to rebuild Ashina🥂🍶",
            "Lets discuss something interesting. Why do the mods dont accept posts about people achieving platinum?? I think that is an interesting topic of discussion.",
            "The Ashina clan crest. It has a couple issues that we need to work through, namely because of Reddit side restrictions with icons. As with everything else right now it’s a bit of a work in progress",
            "Hi, 7 days is the age requirement.",
            "Should just make a sticky so we can see the role of honour, also, the game is 5 years old, but I only just started playing recently and a general questions thread would be awesome. Currently I'm making posts for questions that really just need a quick reply. Go on, it would be a real help and I wouldn't be clogging the feed with old questions 😁",
            "Hinting at sekiro 2",
            "Let's goo",
            "I just recently got Sekiro and been loving it. I want to join the discord community but it keeps auto kicking me out that my account is too young.\n\nI never had discord before and just recently got it. Does anyone know how old the account has to be before I can join the community?"
        ]
    },
    "Bout to get me some treasure carp scales ": {
        "title": "Bout to get me some treasure carp scales ",
        "score": 147,
        "url": "https://i.redd.it/7chmbxjs1h9d1.jpeg",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Hey, you there. Do you, perhaps...",
            "I hate that I saw the deathblow marker like a watermark created by my head",
            "Save them up for the Lapis Lazuli",
            "He’s asking for a stab",
            "Funny thing - I started a replay a couple days ago and noticed the English Pot Noble sounds exactly like Hisoka from Hunter x Hunter. Apparently Keith Silverstein does a fck ton of voice acting for anime and games.",
            "Fishing irl is never gonna be the same again.",
            "Great post"
        ]
    },
    "Should ı be scared": {
        "title": "Should ı be scared",
        "score": 1067,
        "url": "https://i.redd.it/rquhlsj8zb9d1.jpeg",
        "content": "My friend who made me start sekiro said that this boss is pretty hard, should ı be scared? Any tips?",
        "num_comments": 294,
        "comments": [
            "Yes , you could say it is terrifying",
            "I feel sorry about whats gonna happen to ur monitor",
            "It's harder than most bosses imo, but thankfully the mf only has one phase. Fromsoft really know when to cut back on healthbars and phases.",
            "He’s going to smash you, humiliate you and make you wanna give up and when you finally beat him you will be smile brighter than the light of a thousand suns.",
            "No, when you're scared you hesitate and hesitation is defeat.",
            "he gonna throw his poop at ya",
            "When I went to him first time i had approx 970 spirit emblem when I beated him finally I had 570 something",
            "You’ve lost. You’re already hesitating",
            "He might seem really scary at first with his uhh being being very big, but when you get used to his patterns it’s really not that bad. Flame vent and firecrackers are the best tools to use against him as they both stun him, remember that although it may not look like it, his attacks can actually be parried! Not the grabs though if he tries to grab you run for your life. Unlike most bosses monke only has one healthbar so as long as you play patiently you will eventually get him, good luck!",
            "My favourite boss in the 1st time experience"
        ]
    },
    "Is Owl crying before he fights Sekiro? ": {
        "title": "Is Owl crying before he fights Sekiro? ",
        "score": 60,
        "url": "https://www.reddit.com/r/Sekiro/comments/1dr590k/is_owl_crying_before_he_fights_sekiro/",
        "content": "I noticed Owl seems to be sobbing in the cutscene before he lunges at Wolf in the battle atop Ashina Castle.  Given what i know about Owls treatment of Wolf, this has me curious if he truly loved him as opposed to seeing him as a mere tool. Maybe im crazy, Maybe hes laughing? Or hes just old and grunty? Idunno. Sounds like crying to me. ",
        "num_comments": 24,
        "comments": [
            "He is pretending to cry so that wolf lowers his guard in order to stab him in the back.",
            "It is amazing what a dirty fighter he is with the moveset he uses, he is the opposite of Isshin when it comes to fighting with honour and integrity and respect, can't call himself a Great Shinobi like Wolf.",
            "I truly believe this game is the Michael Jordan of video games",
            "I think you're right. Owl even says something like \"it varms my heart to see that you have grown, even a little\" refering that Wolf didn't get killed twice by the same move.",
            "That seems like a pretty solid explanation to me!",
            "Definitely the case. The funny thing is he even tries that shit again once you've taken out his first health bar. I cant remember exactly but I think he dramatically drops to his knees and bows to you and says \"W-wait... please...\" then if you walk up to him he throws a smoke bomb and jumps away then calls you an idiot lol!\n\nOwl truly is the definition of a dirty fighter.",
            "He did care in a way. When you kill him in the first fight, he says, \"That's my boy.\" And in the second one, he says it's no altogether unpleasant to be killed by his own son. So he's an evil bastard willing to kill his own son, but he's still proud of wolf and cares in his own way.",
            "Yep it's crocodile tears. Same as claiming he can't raise a hand against Emma while preparing shurikens in a single motion, and same as feigning surrender the first time you hit phase 2 of his bossfight.",
            "so glock saint fights with honor and respect by bringing a glock to a sword fight…ok that’s neat.👌🏾",
            "You got two of his lines mixed. Old owl says \"it seems you've grown, if only just a little\", and owl father (hirata version) says \"it warms my heart to see how much you've grown...\" after the first deathblow."
        ]
    },
    "First time seeing this enemy, and fuck it, and whatever it’s name is": {
        "title": "First time seeing this enemy, and fuck it, and whatever it’s name is",
        "score": 44,
        "url": "https://v.redd.it/hmtsi4s00h9d1",
        "content": "",
        "num_comments": 14,
        "comments": [
            "I think you should have met him before the chained ogre fight i believe",
            "Yeah I'm on ng+ rn, these guys still suck. Can't quite seem to get the hang of them consistently.",
            "What do you mean first time? How did you get to the Buddha statue just before the Chained Ogre and not have seen the fella?",
            "Use stealth to get on the roof and drop down to do a ledge hang where he is standing for a deathblow",
            "They are at their most dangerous when they are out of your striking range. Literally get close to them and they can't shoot you, basically unless you let them. Just hit them and mind their swing attack, parry it and they're become piecemeal of the ashina army.",
            "Poopoobuttholes kindly helped me remember that you do indeed see one of them on your way to the Chained Ogre, but I saw it as “oh shit oh fuck some shits making shit blow up”, and ran straight through that encounter. But also speaking of, I feel like I might have actually killed one before, but I either don’t remember it just cause I never had trouble with the one time I saw one, or saw one more recently, and was actually disgusted by how much of my health they would sap me of, with just one hit. In all honesty, I had fought Snake Eyes (Poison Pool one, since I’m hearing there’s 2 of those shitters), and grew a deep hatred for ranged weapons, went back to Ashina because I had already gotten to the main hall of Mt. Senpou, and figured out I needed to kill Genichiro to go further, and explored that area. I was, once again, taken back by the high damage, cause I was assuming they were lower level Ashina members, and wouldn’t do shit against me (although I fought both the spear user, and the other samurai on the salt bridge with the giant katana, right beforehand, and should’ve connected the dots by then.)",
            "are you hesitating, perhaps?\nbut no need for a method, just get your 2 cuts in, hop onto a ledge, and do that till they die (I’ve never seen ng+, I have no clue what the fuck I’m talking about)",
            "no clue what Buddha statue you’re referring to, but you DID make me remember that I had seen an enemy that made shit blow up, so I ran straight through those few enemies, and went on from there. But I don’t ever recall having to kill any of those fucks",
            "May or may not have worded it a bit strangely, but this was just a funny little clip from like 2 or 3 days ago. I figured out a solid method of blocking the first two hits, then running the fuck out of there until he shoots, yadda yadda, rinse and repeat until deathblow. I also seriously locked the fuck in after that, and cleared out about 2-4 minibosses. Though, you got any tips on the poison pool Snake Eyes? It’s not like they’re a problem, just that the grab reach is bullshit, and I don’t wanna spend all of my Gachiin sugar stealth-deathblowing all the other enemies, before moving onto them",
            "you’ve gotta be bullshittin, cause that bitch could shoot me from the Dilapidated Temple, to within kissing range of the barrel. But do explain how the fuck they get cut, and immediately dodge a spinning shuriken, faster than Wolf can perceive a Miriki Counter??"
        ]
    }
}