{
    "Welcome to /r/SelfHosted! Please Read This First": {
        "title": "Welcome to /r/SelfHosted! Please Read This First",
        "score": 1367,
        "url": "https://www.reddit.com/r/selfhosted/comments/bsp01i/welcome_to_rselfhosted_please_read_this_first/",
        "content": "#Welcome to /r/selfhosted!\n\nWe thank you for taking the time to check out the subreddit here! \n\n##Self-Hosting\n\nThe concept in which you host your own applications, data, and more. Taking away the \"unknown\" factor in how your data is managed and stored, this provides those with the willingness to learn and the mind to do so to take control of their data without losing the functionality of services they otherwise use frequently. \n\n##Some Examples\n\nFor instance, if you use dropbox, but are not fond of having your most sensitive data stored in a data-storage container that you do not have direct control over, you may consider NextCloud\n\nOr let's say you're used to hosting a blog out of a Blogger platform, but would rather have your own customization and flexibility of controlling your updates? Why not give WordPress a go. \n\nThe possibilities are endless and it all starts here with a server. \n\n##Subreddit Wiki\n\nThere have been varying forms of a wiki to take place. While currently, there is no *officially* hosted wiki, we do have a [github repository](https://github.com/r-selfhosted/wiki). There is also at least one unofficial mirror that showcases the live version of that repo, listed on the index of the [reddit-based wiki](/r/selfhosted/wiki)\n\n##Since You're Here...\n\nWhile you're here, take a moment to get acquainted with our few but important **[rules](/r/selfhosted/wiki/rules)**\n\nWhen posting, please apply an appropriate flair to your post. If an appropriate flair is not found, please let us know! If it suits the sub and doesn't fit in another category, we will get it added! **[Message the Mods](https://www.reddit.com/message/compose?to=%2Fr%2Fselfhosted)** to get that started.\n\nIf you're brand new to the sub, we highly recommend taking a moment to browse a couple of our awesome self-hosted and system admin tools lists.\n\n[Awesome Self-Hosted App List](https://github.com/Kickball/awesome-selfhosted)\n\n[Awesome Sys-Admin App List](https://github.com/n1trux/awesome-sysadmin)\n\n[Awesome Docker App List](https://github.com/veggiemonk/awesome-docker)\n\nIn any case, lot's to take in, lot's to learn. Don't be disappointed if you don't catch on to any given aspect of self-hosting right away. We're available to help! \n\nAs always, happy (self)hosting!",
        "num_comments": 86,
        "comments": [
            "Really nice introductory post, thanks!",
            "new welcome message? what did we do to deserve this spot of loveliness",
            "Moderators, how can new services be added to the list?",
            "Why do I have to look at this face everday?",
            "Is there any post which talks about how to get started with self-hosting and what hardware to use for a beginner?",
            "> Taking away the \"unknown\" factor in how your data is managed and stored \n\n...eh...... Unpopular opinion..but.. If that was TRULY the case docker would be less recommended around here.",
            "What's the difference between this sub and r/homelab",
            "Is there a way to search posts within SelfHosted! using keywords?",
            "Im surprised n8n is not there",
            "Currently I hosted for wordpress, and want to built forum for my running  community"
        ]
    },
    "April Announcement - Quarter Two Rules Changes": {
        "title": "April Announcement - Quarter Two Rules Changes",
        "score": 28,
        "url": "https://www.reddit.com/r/selfhosted/comments/1c8332s/april_announcement_quarter_two_rules_changes/",
        "content": "Good Morning, /r/selfhosted!\n\nQuick update, as I've been wanting to make this announcement since April 2nd, and just have been busy with day to day stuff. \n\n### Rules Changes\n\nFirst off, I wanted to announce some changes to the rules that will be implemented immediately. \n\nPlease reference the rules for actual changes made, but the gist is that we are no longer being as strict on what is allowed to be posted here. \n\nSpecifically, we're allowing topics that are *not* about explicitly self-hosted software, such as tools and software that *help* the self-hosted process.\n\n***Dashboard Posts Continue to be restricted to Wednesdays***\n\n### AMA Announcement  \n\n~~The CEO~~ a representative of Pomerium (u/Pomerium_CMo, with the blessing and intended participation from their CEO, /u/PeopleCallMeBob) reached out to do an AMA for a tool they're working with. The AMA is scheduled for May 29th, 2024! So stay tuned for that. We're looking forward to seeing what they have to offer. \n\nQuick and easy one today, as I do not have a lot more to add. \n\nAs always,\n\nHappy (self)hosting!",
        "num_comments": 11,
        "comments": [
            "Who knew there was moderation on this sub? So, the big change is there is going to be no change and the sub will continue to be the same questions posted over and over, none of which have anything to do with self hosting. Marvelous work!",
            "Hey, I'm curious: What do you like about the tailscale model?",
            "Noted! Thanks for the info, I'll make the change.",
            "I apologize that the moderation has been lacking recently. Real Life priorities have taken its toll on my personal efforts on this subreddit (hence why this post ended up being 2 weeks later than I had intended originally...)\n\nAny sincere thoughts on how this subreddit could be moderated better, or would you like me to try and infer based on your cynicism?",
            "Wow - I didn't come across the github repo.. Now they've got my attention, I'm much more intrigued!",
            "Ignore him. Small subs thrive with less heavy moderation. Yes, the same questions get reposted often. Sometimes there are nuances in the questions and sometimes there are interesting answers!\n\n\nIn general, the sub seems fine. There isn't too much noise and it's still helpful for people new to the hobby.",
            "The best moderation is one you don't even notice.\n\n\nThe biggest complainers seem to offer the least constructive benefit. At best, they are mildly entertaining",
            "Since they started, they engaged the selfhoster and prosumer communities, giving support, promoting usage, even blog posts of how to deploy it into a home lab - and most importantly, they've kept that going... even recently adding new features such as the ControlD... then they've also supported OSS, and not only the client, but there is also full self-hostable alternative called Headscale, whilst not built or supported by Tailscale, then have been positive about it (rather than teying to shut it down)... taken all together, they've built up a huge amount of trust and support.\n\nIt also helps, they are available of every platform, from my phone, to my NAS, to my VPS with ARM cores - also there is huge amounts of documents and troubleshooting.available online.",
            "Quick update: the CEO is https://www.reddit.com/user/PeopleCallMeBob !\n\nI'm also part of the Pomerium team and will participate with answers when relevant.",
            "I'm assuming this is the Pomerium website: https://www.pomerium.com\n\n\nAt a quick glance it looks like a potential alternative to Cloudflare, it'll be interesting to see how they engage here, there website is unabashedly comparing itself to Enterprise focused tools, which typically market themselves to CTO's (who control the purse strings), rather than directly to the Sysadmin/Engineering teams..\n\n\nHopefully they'll look at the Cloudflare and Tailscale models, and see the benefits it's brought for everybody."
        ]
    },
    "My 12x Mini PC homelab - k8s cluster": {
        "title": "My 12x Mini PC homelab - k8s cluster",
        "score": 390,
        "url": "https://www.reddit.com/gallery/1dqq3h8",
        "content": "",
        "num_comments": 98,
        "comments": [
            "r/homelab wants to have a word with you.",
            "What do you do for shared storage?",
            "what do you actually do with this?",
            "I think my wife would divorce me. Where can I get those mini-PCs. ;-)",
            "It looks like two of them are not numbered you should hang your head in shame  \n\nHats off to you  on a nice mini cluster",
            "Ok, I'll bite. Why do you have 0% \"wine\"?",
            "Why have 12 mini instead of 1-2 powerful machines?",
            "How many units of energy does this consume on average?",
            "Don't you mean a \"k12s\" cluster? \n\nBadum tssss!",
            "I'm so jealous. I'm struggling to get even 3. \n\nWhat are the specs on those? I'm also going to build a k8s cluster."
        ]
    },
    "Unpopular opinion: I don't need new features; I just want everything to function as intended, be rock solid, and work reliably...": {
        "title": "Unpopular opinion: I don't need new features; I just want everything to function as intended, be rock solid, and work reliably...",
        "score": 454,
        "url": "https://www.reddit.com/r/selfhosted/comments/1dqo95f/unpopular_opinion_i_dont_need_new_features_i_just/",
        "content": "What drives the relentless quest for new features?",
        "num_comments": 120,
        "comments": [
            "Creating something new is more motivating than fixing broken stuff",
            "It's hard to promote a product when your marketing pitch is 'it still works'\n\nIt's much easier when your pitch is 'it now integrates with your smart fridge' , even when it's a drone.",
            "You are looking for Debian Stable branch.",
            "Find the version you like, fork it, and boom no more new features. And if there's a bug you can patch it.",
            "> What drives the relentless quest for new features?\n\nFor for-profit companies, it's just to make sales. Doesn't matter that nobody asked for your new feature or that it's bug ridden, it gives the marketing team a new buzzword to sell and it works.",
            "While you might be content with everything a platform offers, other people might not be. Someone might need the ability to do certain things that the app simply doesn't offer. What drives the quest for new features is user demand. \n\nThis isn't necessarily the case for non self hosted products though. Alot of times companies will change the interface for things just to give it a new look. Companies like ubquiti and YouTube are the best example of this. The sad part is that it works. To a company, the only thing that matters is how many people use the new changes and not how many people like it. People who are using companies like ubquiti and YouTube arnt just going to change companies because of an interface update, but at the same time, the new interface might bring some new customers.",
            "Hey this is not unpopular at all!",
            "Literally why I can't use Immich. It already does everything it needs to, but they keep adding stuff at the expense of stability",
            "Some times .. the people who create these tools on their own time are scratching a personal itch and have needs and wants that are different from you.",
            "If a company puts together a product that is rock solid and only maybe gets security updates, then it could maybe be profitable. But in todays investment culture its not enough to be profitable, a company that is not increasing its user base year over year is considered a failure. In fact, its common practice for tech companies to be unprofitable for years while they grow their user base, propped up by investor money. Additionally in tech, hype is almost more important than the fundamentals. If you make a product and all your competitors are adding the newest hype like NFTs or AI and youre not, then youll be considered a failure, regardless of whether or not any actual users want these features."
        ]
    },
    "Self hosting a password manager - Vaultwarden - Do I, Don't I ?": {
        "title": "Self hosting a password manager - Vaultwarden - Do I, Don't I ?",
        "score": 20,
        "url": "https://www.reddit.com/r/selfhosted/comments/1dr6mp7/self_hosting_a_password_manager_vaultwarden_do_i/",
        "content": "OK so I'm fairly new to self-hosting but I'm becoming ever increasingly aware of my bad password management.\n\nI currently use Microsoft Edge with its built-in password, identity and wallet features, which store all my information in their cloud via my Microsoft account. It's very convenient as it offers to automatically store my passwords, etc., as I start to use them and then auto-fills any fields as I access them. \n\nI'm ashamed to admit I have used the same password in the past for multiple devices, making it easier for me to remember. \n\nI have a very bad memory so this seemed like a good solution.\n\nHowever, now I realise that this is compromising my digital life. If a hacker gains access to one password, they have the potential to gain access to many other sites I log in regularly.\n\n## Vaultwarden\n\nSo I looked to Vault Warden, deployed via docker and exposed via Cloudflare tunnels, imported my data from Microsoft Edge and have it self-hosted. \n\nBut here are my concerns. \n\nBeing self-hosted, if my server goes down, my passwords go with it. My current method of backing up my dockers is by gzip tarring the mapped data volumes, keeping permissions of the folders and files, and then rcloning that archive to multiple Google drives. Keeping multiplier copies with a timestamped filename. \n\nIf something breaks, I can restore these services by downloading the archive from Google Drive and unzipping the mapped volume.\n\nHowever, what concerns me is both data protection and ease of use. \n\nWith my current practice, if I lose my self-hosted server, my passwords are memorable and also backed up to Microsoft Cloud, causing minimal disruption. However, self-hosted, and maybe using a built-in password generator to make each site's passwords unique, I am fully reliant on getting that backup restored.\n\nAlso if the server is stolen, they would have access to the password database that would have my full identity, passwords and worst still, all my credit card information. \n\nSo I guess my questions are\n\n1. Is my backup practice sufficient for something as critical as vault warden  \n2. If I'm going to switch to automated, generated, passwords for each site I log, would I be better off staying with my current practice of letting Microsoft Edge and its password, wallet and identity manager back up to their cloud?  \n3. Is it better to just use two-stage authentication on everything and keep the same memorable password for multiple sites, for ease of memory?  \n4. How safe is the stored Vault Warden database from being used if a self-hosted device is stolen?\n\n",
        "num_comments": 68,
        "comments": [
            "I have self hosted vaultwarden and use bitwarden clients. If you have doubts, you can always throw bitwarden a few bucks and use their service.",
            "Using Vaultwarden for two years, no problems",
            "The best thing when you self host bitwarden, you don't even need to expose it which, for me, is an extra layer of security.",
            "Not the point of the post I realise but as I had similar concerns I pay for Proton for VPN and use their password manager. I like their email service and need their VPN anyway for my Linux distro stuff so seemed like a logical solution.",
            "I keep a kdbx file in a cloud service(and multiple copies as backups) and different clients on different platforms, like Strongbox, MacPass and KeePassXC.",
            "Yes do it , why wait ???",
            "Ive contemplated it, as Im on Bitwarden right now, but Ive not seen enough of a benefit for me vs. free tier personal Bitwarden.\nI might look at it eventually, but Id rather focus on stuff that is less critical if it fails (yes yes make backups of the vault lol).",
            "A simpler solution would be to use KeePassXC and always keep the pw database file local, never on cloud.  Keep good backups of it.",
            "With the bitwarden addon in your browser of choice, it will ask to store passwords for many sites (but not all, tho) like the browser asks to store it.",
            "I use Microsoft and Authenticator. I can access from Edge in my devices as well as my iPhone via Authenticator (which I also use for 2FA).\n\nSelf-hosting is good, but I do have the same concerns as you. I suspect I am much more likely to break things, especially something critical, even if temporarily, than Microsoft."
        ]
    }
}