{
    "Read Me Now or Hate Me Later: Selfie Rules, Guidelines, Verification, & FAQ - Updated": {
        "title": "Read Me Now or Hate Me Later: Selfie Rules, Guidelines, Verification, & FAQ - Updated",
        "score": 183,
        "url": "https://www.reddit.com/r/selfie/comments/16uenaq/read_me_now_or_hate_me_later_selfie_rules/",
        "content": "**All users of the subreddit should be familiar with the rules of the subreddit which can be found here**:\n\n[Selfie Rules & Guidelines](https://www.reddit.com/r/selfie/wiki/rules)\n\n**Have a question?**\n\nThe [Selfie FAQ](https://www.reddit.com/r/selfie/wiki/faq) may have your answer.\n\n**If you are interested in getting verified please see the following wiki**:\n\n[Verification Rules & Guidelines](https://www.reddit.com/r/selfie/wiki/verification)\n\n**Are you getting unwanted messages?  Here are some helpful Links from** [**r/creepyPMs**](https://www.reddit.com/r/creepyPMs/)\n\n[How to Handle Creeps](https://www.reddit.com/r/creepyPMs/wiki/how_to_handle_creeps)\n\n[How to Block People](https://www.reddit.com/r/creepyPMs/wiki/blocking#wiki_reddit)\n\n[The Creepy Methodology](https://www.reddit.com/r/creepyPMs/wiki/methods)\n\nWe have made the following changes to the rules.  As some people did not see the post where we announced these changes we are going to also put them here.\n\n **No More NSFW Posts**\n\nNo swimsuits, no sports bras, no bikinis.  No cropping pictures of same to make it look like you arent wearing a swimsuit, sports bra, or a bikini.  \n\nNo photos marked NSFW.  If your photo is marked NSFW even if it should be considered SFW it can be removed and you can be banned for it.  You are responsible for making sure your post is labeled correctly.  The mods have seen way to many pictures they have had to bleach from their mind that were labeled NSFW and were most certainly NSFW\n\n***But what is Safe For Work content?***\n\nSafe for work content is something you can wear to work safely.  People have different opinions on that, so if you want to make sure your post gets approved imagine one of our mods is Amish.  I'd like to say we could come to some agreement but there are certain posters out there that will just try to inch over the line so keep your posts as safe as possible.  \n\nYou can be fully dressed and still be NSFW.  If you are going to contort your body to flash some cleavage or take a downshirt/upskirt photo, then we're not going to consider it safe for work.  \n\n**We allow all Redditors to post in here, we do not allow Advertisers with a Reddit Account to post**\n\nReddit guidelines say if more than 10% of your posts and comments are your own material, you're a spammer.  We're going to be a little more generous than that. We have a bot that looks at your post and comment history and if all you do is post your own pictures and comment on your own pictures, then we don't think you are right for this subreddit.  If your commenting consists of the same \"Thank you\" to every comment on your post, then that is also spam.  We're looking to make r/Selfie like the old days where people actually engaged one another not a thank you and an emoji response. \n\nThe bot is new and it will make mistakes.  We're working on it.  If the worst that happens to you is one day one of your posts doesn't make it up, please try to struggle on with life, we know it's tough, but we hope you can pull through.  \n\n**No more \"Self Timer\" shots**\n\nWe got rid of the Self Timer flair.  People were using it as cover for photos they \"self timed\" from 15 feet away.  If you can't reach out and touch the camera, we're going to say it's not a selfie.  If the dumbest mod (Hello, it's me, I'm the dumbest) can't tell you took the photo yourself, it's not a selfie.\n\n**These rules will be on all posts going forward**\n\nWe asked the community for their input, things were mostly silent.  If the people would have talked half as much on our posts before the changes as they have been in modmail. maybe things would have been different.  \n\nSure 75% of our posts and comments are ok, but when you are dealing with a subreddit of over half a million people 25% is a lot of unpaid work to do, so we're going to make it easier on the moderators.  We are hoping to get this place to be what it was when we started:\n\n# Fun, Clean, and Real\n\n&#x200B;",
        "num_comments": 1,
        "comments": [
            "Hey u/YourHumbleModerator,\n\nI am the AutoModerator, a Bot that runs on r/Selfie.  I am not a human being so please do not write me directly.  I run Automatically as a Moderator, hence my name \"AutoMod.\"  I have noticed you don't have that shiny gold verification flair for r/Selfie, If you are interested in verifying to prove these are your pictures see our FAQ https://www.reddit.com/r/Selfie/wiki/verification to see how you can become verified here and tell the world you are the person in this picture.  \n\n**PLEASE NOTE**  The human Moderators will never contact you directly via Chat or private message to ask you to verify.  If someone does ask you to verify you can go to https://www.reddit.com/r/selfie/about/moderators and see they are not on the moderator list.  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/selfie) if you have any questions or concerns.*"
        ]
    },
    "I missed my flight but at least I look cute ": {
        "title": "I missed my flight but at least I look cute ",
        "score": 283,
        "url": "https://i.redd.it/zkwkkku5448d1.jpeg",
        "content": "",
        "num_comments": 12,
        "comments": [
            "You look fantastic   Hope you get another flight soon",
            "Oh no hope you get on the next one soon!",
            "You look more than cute you're breathtakingly beautiful 😍",
            "Gd way 2 look at fings",
            "Oh noo, sorry to hear! It's meant to be for some reason <3",
            "You're a lot more than cute. You're very beautiful. I love your eyes.",
            "Your face looks amazing!!!",
            "You look delicious",
            "you're very hot.",
            "goddess!!! 😍🥰"
        ]
    },
    "Before the emails and meetings begin, here’s a little smile for you all!": {
        "title": "Before the emails and meetings begin, here’s a little smile for you all!",
        "score": 172,
        "url": "https://i.redd.it/i4zzufvk248d1.jpeg",
        "content": "",
        "num_comments": 10,
        "comments": [
            "But it's the weekend! Thank you for that wonderful smile, have an amazing day. 🥰",
            "You’re pretty!",
            "Great pic. Thanks.  You’re so beautiful",
            "you work saturdays?",
            "Wishing you a productive day despite of the fact that it's the weekend!",
            "So beautiful 😍",
            "Beautiful smile :) Hope you take some time to enjoy the weekend <3",
            "Absolutely gorgeous 😍",
            "Your hair looks amazing, do you use any special care?"
        ]
    },
    "Chillin' with my best bud, Ice Cream!": {
        "title": "Chillin' with my best bud, Ice Cream!",
        "score": 186,
        "url": "https://i.redd.it/hzh4q7ukx38d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "So adorable 🥰",
            "so cute"
        ]
    },
    "Lake days just hit different. Feeling serene and sun-kissed!": {
        "title": "Lake days just hit different. Feeling serene and sun-kissed!",
        "score": 170,
        "url": "https://i.redd.it/hmlxt98i148d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Great pic.  You’re very pretty",
            "Love the makeup and your eyes",
            "Lovin' how the photo turned out! 💗",
            "That's a beautiful shade of lipstick you have there 🥰"
        ]
    }
}