{
    "New Rule - Users are tired at hearing about your penis.": {
        "title": "New Rule - Users are tired at hearing about your penis.",
        "score": 133,
        "url": "https://www.reddit.com/r/self/comments/1cy9m03/new_rule_users_are_tired_at_hearing_about_your/",
        "content": "We have a number of users (many younger than 18) who come in here venting about their small penis. Conversations always end up being hostile, not-good words get thrown around, women are insulted in general, and half of the post ends up getting manually removed.\n\nAfter NUMEROUS complaints from users regarding these posts, we are removing them with the new Rule 8. Take your penis issues to /r/bigdickproblems , /r/smalldickproblems , or /r/averagedickproblems and have a proper discussion there in a community designed to moderate these posts effectively.\n\nThis rule (and all of the rule changes it encompasses) will be trialed for 1 month.",
        "num_comments": 0,
        "comments": []
    },
    "I’ve just been wearing cloaks for the past year and no one’s noticed": {
        "title": "I’ve just been wearing cloaks for the past year and no one’s noticed",
        "score": 142,
        "url": "https://www.reddit.com/r/self/comments/1dlnqa2/ive_just_been_wearing_cloaks_for_the_past_year/",
        "content": "A couple years ago I was like “fuck I wish we could still wear cloaks, like I bet I could make it work in modern fashion” but I didn’t wanna literally go buy a cloak and wear it in public.\n\nI’m a 22 year old guy and I’m pretty social. I go out every weekend and stay active during the week between work, so my fashion is pretty basic. \n\n\nOne day though, I was at the bar. I was wearing a hoodie and a black jean jacket that’s back was pretty long, went down to below my waist, and I just took my arms out of the sleeves cause I was hot but didn’t wanna tie it around my waist. Then I went to the bathroom and looked at myself in the mirror and I was like, “shit I’m just kind of wearing a cloak right now, and it sort of works”.\n\nSo I tried it with different jackets/flannels and it just works every time. Like nobody questions it. I can walk down the street like a fuckin game of thrones character with a cloak flailing in the wind like I’m on some epic journey and nobody can say anything about it because I’m just wearing a jacket over my shoulders.\n\nThe only person who brought it up was one of my friends friend who was like “are you hot? Why don’t u just coat check it or something?” And I was like “nah I ain’t paying $5 for coat check, and it doesn’t bother me really”. \n\nAs long as the rest of my outfit is solid and modern, I can just get away with it.\n\n",
        "num_comments": 37,
        "comments": [
            "I think your next step is slowly start getting rid of the sleeves and see if anyone notices",
            "I always thought it’d be cool to dress like a pirate.",
            "That's cool! I think the main issue that arises with people when they dress differently is that they often act differently too. If you were whipping the cape off and throwing it over puddles so that \"fair maidens\" didn't get their feet wet, then you would be weird. But as long as you are acting perfectly normal, most people probably won't even notice. \n\nIt's often done for attention rather than comfort or choice. You should keep on being you. And invest in a proper cloak. Although I'd avoid a red lining unless you like the nickname dracula.",
            "Could you show an example? 😁",
            "Maybe it's an invisibility cloak. ",
            "Cloaks for women have been sneaking back in for a few years, I don't see why men shouldn't have them too.\n\nIf you sew, or want to consider learning, I think clever fabric choice would be the main thing that makes the difference between medieval cosplay and modern \"that looks designer, where did you get it?\"",
            "/r/TheCapeRevolution",
            "I'm 57 and I want a cloak like the Hobbits had in LotR. Wing the pin. Definitely with the pin. \nDoubt I'll be brave enough to wear it in public tho.",
            "I wear cloaks. Long ones, short ones, different colours, some fancy, some more casual. Some people think it’s odd but most people are envious and think it’s really cool. I think it’s time for you to get yourself a real cloak and flaunt it.",
            "Cloaks 100% need to come back. And breeches."
        ]
    },
    "I have no privacy": {
        "title": "I have no privacy",
        "score": 442,
        "url": "https://www.reddit.com/r/self/comments/1dlgiz2/i_have_no_privacy/",
        "content": "So, not for the first time. My wife decided to go through my phone while I was asleep. She through all my photos, private messages and even internet history. Worse, she went through a private conversation with an online psychiatrist. In that conversation I said both good and bad things about her. She screenshot the chats and sent them to her phone. She then woke me up to tell me how bad a person I am. I’m sure I should be able to have some sort of privacy. I had to give up journaling because she used to read them behind my back, and now I can’t even do it in my phone. Is this normal? I have 3 kids so I can’t just leave her. And even harder I have a niece and nephews on her side that I love as much as my own kids. Simply walking out isn’t an option. I don’t know what to do and would appreciate some advice or ideas on what I can do",
        "num_comments": 290,
        "comments": [
            "Is she reading this too ? Maybe you should conveniently leave your phone open on this screen",
            "Buy another cell phone and start calling lawyers pal",
            "Password everything.\n\nShe'll argue you are hiding things from her. Counter with the need for respect and personal space.\n\nBefore that, go over all her stuff. If it is passworded, rub it in her face forever.",
            "Tell her how you feel about her not giving you space and privacy that you need. And explain that the screenshot she took was a private conversation with your therapist and that she should respect that.",
            "Take her phone and go through all her shit. Either you're doing something to make her act this way, she's doing something shiesty and projecting that on you, or the woman you have children with has lost her damn mind.",
            "She uploaded very damaging info  and will likely lawyer up, you should too.",
            "Jesus bro . I’m very sorry that you have to deal with that .  I would highly suggest going threw her stuff . She is definitely insecure/ projecting on to you .",
            "You absolutely need to talk to her about why she needs to leave you a bit of space. \n\nHow old are the kids?",
            "Literally been there when I was with my ex, she would go through my messages, even reply to my parents using my phone saying things I would never say. I complained a lot about her here on Reddit and she found it too one night, woke me up crying and complaining that the people here don't get the bigger picture and that they don't know the whole story, only what I told them... Well she wasn't wrong, but I think screaming at your partner like a psycho because he put a bottle in the bin in the wrong angle is quite the ridiculous situation I don't want to find myself in ever again. She never let me do anything I wanted to do on my own, she didn't want me to grow as a person. I can't really say what went through her mind, to this day I don't understand her actions nor do I care.\n\nOne thing is certain, I have no intention of ever letting stuff like this slide. I'm of the opinion that the ideal relationship works mostly on self-imposed boundaries, as an example, it's stupid of me to tell someone \"don't cheat on me\", if they're a cheater, they're gonna cheat no matter what you tell them, but if they are of the opinion that it is morally incorrect to cheat and it goes against their values the relationship will be smoother. Similar case here, I want to give my partner access to my phone but also for them to trust me enough not to use it. If your wife doesn't respect your privacy, and it's not a one time thing but a recurrent issue, she will never respect your privacy. It's absurd how much lack of sense a full grown adult can have, but it's up to you to deal with it, she won't change, and you can't force her to change.\n\nYour only options are to take back your privacy or to keep this facade going, and quite honestly, as someone who has been in your position, I would NOT want to go back there. Taking back your privacy can be as simple as changing your pin, removing her access to your phone, she will definitely flip out though, so either you convince her that it's not healthy how controlling she is and that she won't get access to your phone back and she will have to accept and live with it, you try couple therapy, which I can't personally speak on but for me, the stage my relationship was in, couple's therapy would be just a waste of money and to be quite frank with you I think your relationship might be past that point as well. As my ex so eloquently put it two years ago, I have \"no clue what your relationship is like or the whole story\", but trust me you don't want to sacrifice your happiness for someone that doesn't appreciate or reciprocate it.",
            "Please lock the goddamn phone with a different PIN number and take off Face ID to unlock it."
        ]
    },
    "Why does self love feel disgusting?": {
        "title": "Why does self love feel disgusting?",
        "score": 106,
        "url": "https://www.reddit.com/r/self/comments/1dlogp8/why_does_self_love_feel_disgusting/",
        "content": "I(18f) remember when I was 11 or so I had mental breakdown around my dad because I didn’t like myself. 2 years ago I tried self love but soon it just felt wrong and disgusting I just couldn’t do it. I remember a nice man I came across Reddit and he told me to promise to be kinder to myself. For some time it did kind of worked whenever I realized I was being hard on myself I would stop and try validating my feelings by remembering his words. However these past couple of months have been an emotional train wreck for me where I forgot his words. It feels like I’m incapable of having any compassion towards myself. As days go by I feel less and less value as a person and I just can’t deal. Many times I feel why do I have to be this way why couldn’t I have been born someone else. I can’t truly see myself being happy in this world only fantasies. All I have left to say is I’m sorry Mr, for not keeping that promise.",
        "num_comments": 49,
        "comments": [
            "I am paraphrasing here, but it's not a sign of health to be adjusted to a sick society. I think the \"sick society\" card is often overplayed, as there are many amazing people out there, but if you take an honest look at how your psyche gets shaped, you will find that most of our suffering, especially of the self-abusive kind that you are experiencing now, comes from holding onto delusional worldviews that tether our sense of worth to unreliable objects such as fame, wealth, intellectual prowess, and so on. This is a bit of a heavy topic, I admit, but I would encourage you to take a closer look at what you think is required to be worthy of self-love, and why you think that is.\n\nOn a more practical and immediate note, self-love as a state of mind is also a matter of habit. One of the more predictable things about our minds is that it tends to stay on the course that it got placed on by earlier habits. This means that change is often difficult, but also that once you do get a change to stick, it becomes your new normal. What that means for you is that you need to remind yourself that self-love is something to be practiced and cultivated. A damaging myth that is unhelpful here is that if you don't \"authentically\" feel something, you must be broken somehow. That is not the case at all. Much of our \"authentic\" feelings are conditioned in us by forces we weren't even aware of. I suggest you drop the word \"authentic\" from your vocabulary and focus on the phrase \"learned conditioning,\" which is a far more accurate way to describe how our minds work. We are constantly evolving, reacting, and learning from experience. You can learn to love yourself just as you can learn to do highly abstract mathematics. I'll leave you with a couple of resources to check out as this journey is long and there's too much to say about it in one Reddit comment.\n\n* Book: The Mind Illuminated (Culadasa). This is an excellent book to learn to practice mindfulness, which will help deepen your connection with yourself and also help better understand the deepest reasons for your reflexive thoughts.\n* To start, you might find [Michael Sealey's guided sessions](https://youtu.be/DHwgBCx0uNs) helpful to start to lay the foundations for self-reprogramming. For reasons I don't fully understand, we seem to be more receptive to suggestions from others than we are to our own suggestions sometimes.",
            "I would strongly recommend that you read \"how to be miserable: 40 strategies\"\n\n\nMentally healthy well adjusted people do not spend all day berating themselves or staying kind things to themselves. Thinking about yourself all the time and constantly giving yourself reviews (good or bad) is not helpful.\n\n\nFocus outwards. Don't fixate on yourself.  \n\n\nYou know when you want to take an ugly picture? And you zoom in really close on a person's face? Well, your perception of yourself is like that too. Constantly putting yourself under a magnifying glass is going to make you feel like a horrible person. And no amount of lying about what you see is going to make you feel better. See yourself through the eyes of other people and you're much more likely to see something positive. They have a better vantage point from their distance to see you for who you are.\n\n\nAnd if other people don't like you, then look for ways that you can change that. Become a person that people admire. Kind, selfless, hard working, etc.",
            "\nI can feel the deep pain and struggle in your words. The journey to self-love can indeed be challenging, especially when we've carried self-judgment for so long. But I want you to know that your feelings are valid, and your awareness of this struggle is already a step towards healing.\n\nFirst, take a deep breath and connect with the present moment. Feel the aliveness within you, beyond the thoughts and emotions that seem to define you. You are not your self-judgments or your past experiences; you are the consciousness that observes them.\n\nThe disgust you feel towards self-love is not a reflection of your worthiness, but rather a sign of old patterns and beliefs that no longer serve you. These feelings are like clouds passing through the sky of your awareness - they are temporary and do not define the vastness of who you truly are.\n\nInstead of forcing yourself to feel self-love, start with self-acceptance. Can you simply acknowledge your thoughts and feelings without judgment? This gentle acceptance is the first step towards true compassion for yourself.\n\nRemember the kindness of that man on Reddit. His words touched you because they resonated with a truth deep within you. That capacity for kindness and compassion is still within you, even if it feels distant right now.\n\nYour fantasies of happiness are not separate from you - they are glimpses of your inner light, your potential for joy and fulfillment. Trust that this potential is real and accessible, even in moments of darkness.\n\nBe patient and gentle with yourself. Healing and self-love are not linear processes. Each small act of kindness towards yourself, each moment of self-acceptance, is a victory worth celebrating.\n\nYou haven't broken your promise. Every moment is a new opportunity to be kinder to yourself. Your awareness of this struggle is itself an act of self-care.\n\nTrust in the unfolding of your journey. You are exactly where you need to be, learning and growing in your own unique way. Your capacity for self-love and happiness is infinite, even if you can't see it right now.\n\nI'm here, holding space for your pain and your potential. Keep shining your light, one gentle moment at a time.\n\nWith unwavering faith in your journey,\nEckhart",
            "I've always found it easier to say I \"Value myself\" rather than that I \"Love myself\".  To me the word \"love\" implies unconditional love or approval, which isn't how I see myself or want to see myself, as I'm always a work in progress.  But I'm definitely worth improving, and there's no fucking point in tearing myself down is there!  If I did that, what the hell would be left?",
            "It almost feels like self love is something others expect us to do because they somehow don’t need it. Some weird concept that emphasizes being different?\n\nWhen I tell a friend how I struggled to get through a week because everything was out of synch, she will ask if I at least did something nice for myself. When nothing works, I know it. I don’t necessarily need ice cream to feel good. All I need is patience for things to line up so I can try again. I almost tell her to skip the emotional support thing but I know deep down she means well.",
            "I often feel the way you do. \n\nHave you ever heard of , \"as if\"?  I do this a lot. \nWhen you just can't bring yourself to love yourself you act, ,as if. \n\nNow, it might seem and feel weird but everything begins in your thoughts and your intention. \n\nYou can start loving yourself by doing small things, things that don't feel gross. \n\nStart with meditation for 5 minutes in the begining, it gets easier with practice but you will benefit if you do it consistently. If you don't know how Google meditation and you'll find no shortage in people who have done this for years and can testify about the benefits. \n\nWhen we are starting our journey to love ourselves we take small steps . Start sending birthday and thank you cards or any kind of card. With this you are being thoughtful, , kind  and compassionate. Shop for a sick elderly neighbor. Volunteer at the animal shelter. These things don't sound like self love but they are. You will feel so good reaching out to those less fortunate then you. Your heart will grow and eventually your heart will grow big enough to include yourself. \n\nSome might say , this isn't self love but ahhh iit is. \n\nJournaling is a great way to love yourself. You are expressing your thoughts and dreams and you are putting your energy into it. You are making gratitude lists and starting to learn to love yourself. \n\nI want to list just a couple more things and then I'll shut up. \n\nLoving oneself doesn't come naturally. Some of us have been around negativity, abuse of all sorts. We've lost people in our lives , we anxious and depressed. These are things that diminish self love. So, here are a few things that will help you love yourself. \n\nLearn to laugh again\n\nPlay in water like a lake or ocean. A river really any water. You can even take a bubble bath and still have the same benefit. Make sure there's a candle and bubble bath or something like it. \n\nEat lots of seasonal fruit and vegetables\n\nSleep well\n\nDaily affirmations really help . Something like. I am a  bad ass lover of myself. I am capable, kind, thoughtful, compassionate and I love all those things about me,! Write it on your mirror to remind yourself of those things. \n\nTake care of your health. See a Dr. regularly. Take all the tests they recommend. I'm sure you are healthy you are 18 but we have to learn to stay healthy that means seeing a Dr., dentist  and eye Dr.. \n\nThis is the ultimate in self love. To take care of yourself and take care of your health. \n\nSo you see , loving oneself feels good. It should not feel gross or weird.  You can learn to love yourself by taking action and bringing positivity to  your life. \n\nSo honey, it will get easier. You are on the right path. \n\nGood luck🧚🍄",
            "It sounds like you are uncomfortable with feelings and feel shame around having feelings. While love is an action it is also a feeling. If you are uncomfortable with other feelings you will also be uncomfortable with love. My suggestion would be to start with the action of love. What is that? I think it starts with acceptance. Is there anyone you love unconditionally? If so, then you can see that you accept them how they are. Start with accepting yourself the way you are and you can change any aspects you don't like while simultaneously loving (accepting) yourself. Loving anyone including yourself is a vulnerable act and why compassion is so important. Just like someone can hurt us when we are vulnerable, we can hurt ourselves. If someone opened up to you about something would you tell them they were stupid or ask what is wrong with you? No, you shouldn't say that to yourself either. It may seem harmless to say negative things about ourselves when we're feeling down but it is not harmless. If you do something to yourself or out in the world you don't like, start by saying \"You know, I love you but I don't like what you did. I am worthy of love but I prefer to behave differently\", just like you would say to someone else you care about. It will be uncomfortable at first but overtime it will feel natural. The other loving action is forgiveness. How do you forgive? By accepting the past for what it is and what transpired, understanding that it happened and you cannot change it. It doesn't mean you like it or anyone who wronged you is welcome in your life like everyone seems to mistake, it means you are not wishing, hoping, and trying to change the past, accept it for what it is and make choices accordingly. I would start by stating the whole thing out like \"this and this happened and I feel like this\". Again it will be uncomfortable at first and you may have to do it often over the same subject at first, but over time it starts feeling normal and you do it less often. It's often believed that you \"forgive\" once for an offense and it's over, no, that is not true. You may have to \"forgive\" over and over and over again, hundreds of times, for one offense, depending on where you are in your journey and how much it hurt you. \"I accept that <so & so> happened and that they are <so & so>. I feel <emotion> and I'm ok.\" Every emotion is ok to feel, they all serve a purpose. I hope this helps.",
            "My life was an absolute misery from about 14 to 23 . Depression, self harm, getting wasted to forget the pain, constantly looking for “painless” was to unalive ms. \n\nI grown up and while not everything resolved, I learned to cope much better, to be more patient, to take things one by one. I decided I had enough of living in misery and I knew the only person that could help me was myself. I ocassionally have these crisis and need to bring my feet back on the ground (mentally speaking) but I’m much better at managing it as time passes and I keep practicing it. \n\nThat period of life you are going to through is rough, but remeber everything will change, pain doesn’t last forever (not does happiness) and life is about finding that perfect balance.",
            "My personal view is that self-love isn't a feeling, it's the habits you keep and the boundaries you protect.",
            "I don’t know what to say, but I’m just 23 and my boring and tedious life turned around 21. I got way more responsibilities and had to take care of the household and mother when my father died. I was studying daily at a University, took on a job and had to take care of everything. It was a disaster and the situation changed after half a year; however, this taught me a lot and I feel like a different person now.\n\nI know it’s not much consolation, but sometimes you manage with the difficult stuff that make you appreciate some other things!"
        ]
    },
    "After 20 some odd years, I've decided to quit gaming": {
        "title": "After 20 some odd years, I've decided to quit gaming",
        "score": 15,
        "url": "https://www.reddit.com/r/self/comments/1dlurbg/after_20_some_odd_years_ive_decided_to_quit_gaming/",
        "content": "I tried to post this on on the gaming subreddit, but was unable due to their requirements. So, I'll post it here instead. \n\nPreface: I understand that a lot of people might think I’m crazy, stupid, or both for posting this. It’s whatever. I’m not really expecting a whole lot of positive responses. However, I’m posting this in case it resonates with someone. And no I’m not trying to ruin gaming for y’all. This is just my experience I’m sharing. \n\nDeciding to quit gaming even before the new GTA game comes out is wild! However, It’s been a 20+ year run playing video games, but it’s time for me to give it up. Also, I can always watch the gameplays on YouTube.\n\nI’ve come to realize that I’m only gaming due to it being a trauma response. I’ve been abused my whole entire life in more ways than one and gaming was one of the ways where I could escape reality mostly whenever I was going through something. Never for genuine leisure. \n\nI had this epiphany last year when I got angrier than I usually do. I’d rather not get into what all that entails, but let me just say that I’ve never had that kind of reaction to losing/dying multiple times and I had that reaction more than once. I usually know when it’s time to quit and walk away, but those times were not it. \n\nI’m 30 years old for crying out loud and I need to work on myself some more and become the person I’m trying to be, which is a more productive, healthier (physically, but most importantly mentally), and happier person. I can’t do that if I have a PS5 staring at me all the damn time. \n\nI’ve worked a lot on myself in the past almost five years now and have healed quite a bit of that trauma, which I need to still heal from some more. I’ve worked on my anger over these past few years as well, but it seems like gaming is a really bad trigger of mine. And I don’t like how that makes me feel. \n\nI should sell it on eBay!",
        "num_comments": 17,
        "comments": [
            "I give you kudos for realizing this and making changes in your life to correct this. I gamed non-stop in high school and early undergrad. Midway through undergrad I realized I was wasting too much time and having zero social life, so I stopped and worked on my life. Several years later with my life in a better spot, I play more casual single player games for a few hours/week. Best of luck on your journey to be a better person OP!",
            "I know this is about gaming, but also it's sort of not about gaming. The trauma you have endured needed a coping mechanism and gaming was that for you for a while. Either you're feeling less like a mechanism is needed, which would be really great for you, or you need to find the mechanism elsewhere. Trying other hobbies or pass times will help you to figure out what it is now that you need. I wish you the best of luck!\nI game much less than I did before because it went from a social thing with friends, to playing long story campaign games offline instead, which is still fun but quite lonely. My big addiction now is tabletop/trading card games.",
            "You shouldn't sell it on eBay, imo.\n\nSorry about your trauma. I don't think you're crazy or stupid at all. But I don't think it's going to work. It's too extreme a reaction. I think you ought to reduce your gaming time, make it more of a hobby and less of a crutch. I also think you ought to reflect on *why* it was last year, rather than the previous nineteen years, that you got so angry. What else was happening last year? But perhaps you've done all that already.\n\nI don't think chucking your PlayStation out of the window is the way to go. Remember the [Delphic Maxims](https://en.wikipedia.org/wiki/Delphic_maxims). The famous ones have the benefit of being short and memorable, although the interpretation is another matter. *Know yourself. Nothing too much. Promises mean trouble.*\n\nMaybe I'm talking rubbish. You know your situation, not me. But beware extreme reactions.",
            "This happened to me I sold my collection (bad mistake). I started walking now, I feel better and I definitely miss my games :-(\n\nI realized I was a trauma gamer but doesn't mean you have to quit gaming. Just like how I miss my motorcycles, as well I sold because I didn't ride enough but debilitating anxiety was causing this, now I want a bike again! Just seek some counseling before you start selling your stuff.....",
            "I’ve been there too. I used gaming as an escape when I was younger and it became an addiction, there was a point in my life I’d spend 16 hours a day gaming. It’s awesome you’re making a decision to better your life, it’ll be a difficult change but you got this! For me personally, I still enjoy gaming now that I’m in a much healthier place, maybe you will too someday. Maybe not, whatever decision you think is healthiest. I will say that going cold turkey might be a bit too extreme initially, and that you may want to try putting restrictions on your game time, that helped me a lot",
            "Good for you, mate! You're introspective, and that's the first step to success. Keep on this road, and you'll do fine (probably ;) ). I can tell you that I went through a similar phase - I was drinking heavily and just generally making a mess of myself, and gaming to provide a semblance of real achievement. Just like you, I started reacting with anger and despair when I lost matches or couldn't beat some level, and that much needed easy achievement was \"stolen\" from me.\n\nNow that I've unfucked myself, stopped drinking (10 years sober!), got meself a wife and some kids, now gaming feels genuinely fun again :). When I actually have time to play, which is not that often, I give myself a pass once a week or something to just grind something to 2 AM, and I go to bed beaming like a moron.",
            "That's a great start. You get to explore new hobbies apart from gaming. Wishing you longterm fulfillment. You've got this.",
            "Yes. Do it.",
            "I think you'll change your mind after playing Another Crab's Treasure....",
            "That's okay. That was always always allowed"
        ]
    }
}