{
    "For those wondering what the sub icon is.": {
        "title": "For those wondering what the sub icon is.",
        "score": 4370,
        "url": "https://i.redd.it/y2k0vkhk2gab1.jpg",
        "content": "",
        "num_comments": 143,
        "comments": [
            "Literally a shitty tattoo",
            "Race tracks in the undies!",
            "What's the bj scene to the left tho?",
            "That's our flag.",
            "Calvin Klein Calvin",
            "Ok - that's the worst I've seen.  \n\nEven worse than No Ragrats",
            "Imagine being the guy who’s tattoo is the logo for a community (comprising of half a million people) centered around bad tattoos",
            "Poopy!!",
            "Deserving of the shittytattoos icon.",
            "This is genius in my opinion. Best way to incorporate a mole/birthmark into a tattoo that I’ve seen"
        ]
    },
    "Is it me or is this going too far?": {
        "title": "Is it me or is this going too far?",
        "score": 410,
        "url": "https://www.reddit.com/gallery/1dlp4og",
        "content": "There’s videos of him tattooing in the street. Looks real but it can’t be right?",
        "num_comments": 145,
        "comments": [
            "Is it dumb? Sure. \n\nBut is it really dumb? Yes it is.",
            "Holy shit those are all by the same person",
            "I want to know why the wine stain didn't get completed.",
            "As an abstract artist myself I really truly believe some things aren’t made for tattoos lmfao. All power to em though I guess. Kinda hate em tho",
            "You can already see the regret on #5's face",
            "These are terrible omg",
            "Some of his stuff would maybe even look cool if he wasn’t so bad, like if he actually put some effort into getting better with the tattoo gun. But tattooing people in a dirty fountain, using kids… you are putting people in danger for your art, even if they consent it shows your moral compass is all kinds of fucked up",
            "The second one was in a post a few days ago here and someone told me it’s not permanent ink. That was the fact that made it a little bit better to me. All in all clearly shitty.",
            "I think he regards himself as a performance artist.  There is a video of him using a drone to do the tattoo",
            "Rich parents for sure"
        ]
    },
    "Is my tattoo shitty?": {
        "title": "Is my tattoo shitty?",
        "score": 389,
        "url": "https://i.redd.it/3cdd05s2108d1.jpeg",
        "content": "Got it when I was 15. I’m afraid if I gain any weight, I’ll have a shooting star.",
        "num_comments": 162,
        "comments": [
            "This looks like album art for some beep beep boop boop music",
            "It’s a shitty titty tatty.",
            "it just looks like you have a favorite nipple lmao, not a bad tattoo, just a bit strange",
            "I'm sorry this photo looks like something from a true crime podcast. Tattoo is fine though",
            "For the star of, what Im assuming is, a Russian prison documentary it's not too bad.",
            "This photo is art",
            "I picture Paul Stanley of KISS seeing this and saying, \"Why didn't **I** think of that!?\"",
            "The tattoo is fine, but are you being held hostage right now?",
            "I think it's a bit shitty because you asked, and that got me to think whenever or not it is shitty. Should I had seen it on some random picture on the internet I would probably not even thought about it. In some ways it's hiding in plain sight",
            "I've seen a lot worse. Besides, the only thing that you should concern yourself with is whether *you* think it's shitty, not what people on the internet tells you"
        ]
    },
    "Local shop near me": {
        "title": "Local shop near me",
        "score": 110,
        "url": "https://www.reddit.com/gallery/1dlm6j2",
        "content": "Was looking for a piercer and found these gems along the way. ",
        "num_comments": 25,
        "comments": [
            "Marilyn Monroe reminds me of this\n\nhttps://preview.redd.it/fhzeqxtyy18d1.png?width=1080&format=pjpg&auto=webp&s=c3bbf0754a3bbbadf1e31a2bafcf078a9bd01fec",
            "portrait tattoos are rarely a good idea.",
            "A local shop, for local people...\n\n![gif](giphy|Ya2o92Smq6Ila)",
            "Thanks, I hate them.",
            "How is it even possible that I feel like the rose is the worst one?",
            "Sorry to the person who has to walk around with that.",
            "Scott Storch needs to get a DNA test to see if he’s related to that baby and to Murilen Menrow\n\nhttps://preview.redd.it/jz22ozt8w38d1.jpeg?width=399&format=pjpg&auto=webp&s=bc8259376db9c8699e401ba27185d83413eaa273\n\nFunny that they all have the same mouths and I have no idea how I came to that conclusion but I see Scott Storch in both of those tattoos",
            "The first one is kind of cute. The last two are completely dog shit. Great post.",
            "Shops like these need to be shut down. There is a caliber of \"artists\" that is clear that they don't care to improve the state of their work and are content to be charging people money for sh*t tattoos. It's infuriating how just, allowed it is.",
            "Marilyn Monroe, X-Files version"
        ]
    },
    "He really committed": {
        "title": "He really committed",
        "score": 314,
        "url": "https://i.redd.it/1kzpqx47rz7d1.jpeg",
        "content": "",
        "num_comments": 55,
        "comments": [
            "Those balls look like cactus",
            "What do you think his motivation is? Is he gay and loves cock? Does he just love busting nuts like that? Is this some sort of unconventional power move?\n\nThe tip and the balls are just bad. There's no fixing it at this point.",
            "why are the balls social distancing??",
            "Who only shaves one testicle is my main question?",
            "Jesus.",
            "https://preview.redd.it/zb4t2x9z608d1.jpeg?width=609&format=pjpg&auto=webp&s=d1f448ebc80cf6a2e211ee9646aeb4d66aaa5e6d",
            "Looks like 3 different artists did the separate parts. The ballhair style is totally different, and the peener doesn't match either ball... 🤔",
            "This honestly doesn't look like it was consensual",
            "Flips up. . . .trace it.",
            "*object not drawn to scale"
        ]
    }
}