{
    "You've Out your last Shit": {
        "title": "You've Out your last Shit",
        "score": 939,
        "url": "https://www.reddit.com/r/shittydarksouls/comments/17gi11r/youve_out_your_last_shit/",
        "content": "No more outshitted posts (screenshots of other Soulsborne subreddits' posts)\n\nScreenshots of other subs are against the rules (and have been for awhile), mainly because Reddit gets pissy about it, but also because WE'VE ALL FUCKING SEEN IT ALREADY. \n\nBe creative or go commit Dark Souls 2 immolation.",
        "num_comments": 126,
        "comments": [
            "Thank god, can we start shitting now?",
            "Is there also any way this can extend to people that post non shitposting stuff from main sub on here? theres one guy named jamal that keeps posting clips of a video essay defending ds2 and he post it here and on the ds2 and fromsoft subreddit and its super annoying.",
            "https://preview.redd.it/n2tvjpsrvfwb1.jpeg?width=1169&format=pjpg&auto=webp&s=36e93194ababa4dc5ddd0027bcdf8672ff5bd997\n\nFiendish screenshotters like",
            "https://preview.redd.it/ngr4x2rd4gwb1.jpeg?width=950&format=pjpg&auto=webp&s=8a3a3f848bffd3b5ec92aa72272c86099aadb294",
            "&#x200B;\n\nhttps://i.redd.it/eq84rtl6mfwb1.gif",
            "https://preview.redd.it/7jfexyqytgwb1.jpeg?width=720&format=pjpg&auto=webp&s=151596a0e7c34190901e47e7c1b40f6e196eae99\n\nlook at this loser",
            "https://preview.redd.it/tvg9hn8yhgwb1.jpeg?width=960&format=pjpg&auto=webp&s=97cd2c71b2f7751adb082f7071aa4b52ba2eefa2",
            "fucking finally",
            "About fucking time",
            "thank you thank you thank you thank you 🙏"
        ]
    },
    "For the next 7 days, all posts with references to, footage from, or memes about Shadow of the Erdtree's content must be marked with the new \"SOTE SPOILERS\" flair.": {
        "title": "For the next 7 days, all posts with references to, footage from, or memes about Shadow of the Erdtree's content must be marked with the new \"SOTE SPOILERS\" flair.",
        "score": 142,
        "url": "https://www.reddit.com/r/shittydarksouls/comments/1dkg2vn/for_the_next_7_days_all_posts_with_references_to/",
        "content": "Comments on posts without the flair must also not contain spoilers. \n\nPosts about the leaks are still not allowed due to being majorly cringe.\n\nIt's finally here, ye tarnished.",
        "num_comments": 13,
        "comments": [
            "  i would name my first born after you shitty dark souls mods",
            "Thank you (shitty) Dark souls (mods)",
            "I’ve been avoiding this subreddit because I’m a moron and I click on things that say spoiler and am surprised when there’s spoilers",
            "SOTE SPOILERS >!finna jerk it in about 2 hours!<",
            "✋ what exactly are we allowed to make memes  concerning the dlc due to it being out.",
            "I love you guys, I can’t play for the first day it comes out",
            "take off your socks",
            "darks souls player can breed now?",
            "Man me to .\nI wish started avoiding it before I got spoiled of final boss",
            "Hopefully >!Rellana’s gock measurements!<."
        ]
    },
    "FromSoft fans are the fucking worst": {
        "title": "FromSoft fans are the fucking worst",
        "score": 285,
        "url": "https://i.redd.it/kju1z6sg3g9d1.jpeg",
        "content": "",
        "num_comments": 216,
        "comments": [
            "Why is this defendable when you have the absolute peak fights like bayle in the dlc. You literally go to the peak to fight peak!!",
            "Theme is amazing, second phase with the constant chip damage from his after images and constant light beams spam? Aids to deal with, ironically that is the shit that keeps killing me the most, one moment you are fine, the next one you are dead.",
            "I have not heard anyone say one good thing about this boss",
            "I beat him pre patch without cheesing.\n\nI wouldn’t wish that on my worst enemy.",
            "The first phase is pretty fun once you manage to figure out the rhythm. There’s decent windows of opportunity to hit him\n\nSecond phase…holy fuck… I hate it \n\nMy main problem with it is that the magic that triggers on literally all his swings blocks my view of the following attack, so I can’t tell which one he’s doing and just eat it no matter what, which leads to the next magic bombardment hitting me, which leads to the next attack killing me.\n\nNever been more tempted to use a mimic tear",
            "i thought everyone was being too hard on him, then i fought him, i agree",
            "I'm so proud of this community for not glazing this shitty boss",
            "1st phase was off to a good start but then had to put in the stupid AOE attacks and the attack that turns my game into a slideshow",
            "Literally the only problems I have with the fight are the double slash X combo and the visual clutter, didn't experience any significant lag.\n\nIf these get addressed he might be my second favorite souls boss after Gael.",
            "I absolutely love first phase. Second phase, not so much"
        ]
    },
    "Yeah no. ": {
        "title": "Yeah no. ",
        "score": 2412,
        "url": "https://i.redd.it/c8phxw0g5c9d1.jpeg",
        "content": "",
        "num_comments": 277,
        "comments": [
            "Kid named boss fights",
            "What item is this now and what does it do? I haven't found this",
            "If you need more 5 minutes to beat the boss you dont need the deflect",
            "You won’t stop me from playing Sekiro at home\n\nhttps://preview.redd.it/foyykxuisd9d1.jpeg?width=1179&format=pjpg&auto=webp&s=44d09878da69a96123e41909b4bf25cc6f1a2d1a",
            "Can you use it to perfect parry with weapons if they're two handed?",
            "Better this be talisman",
            "Should have honestly been a talisman.\n\nI know there's no word about one but god I hope we get some kind of godwyn dlc.",
            "Killed the final boss with it and had a blast, skill issue.\n\n(Seriously though I thought the timer would be brutal but the tear is so good and makes fights so quick the timer doesn't matter)",
            "This should REALLY have just been implemented as an actual feature or as a talisman.",
            "I wanna see someone use that tear on Malenia. That'd make the fight sooooo much more enjoyable."
        ]
    },
    "Trump a roll-spammer 😭😭": {
        "title": "Trump a roll-spammer 😭😭",
        "score": 985,
        "url": "https://i.redd.it/6z2m9eukdd9d1.jpeg",
        "content": "",
        "num_comments": 131,
        "comments": [
            "https://preview.redd.it/tkrvn3ioxd9d1.jpeg?width=1800&format=pjpg&auto=webp&s=29467efed5cf772fd1c9ba59907bd121ea5412de\n\nThis comment section is about to get really silly . I'll begin The spirit tuner chick and smith slave are the only Good people in this game .",
            "https://preview.redd.it/xuhqr98kxe9d1.jpeg?width=1170&format=pjpg&auto=webp&s=4a28c29d0902202b4b9efbbfaa9854472edf34f4\n\nWhen you enter Mogh’s arena but realize you forgot to equip the purifying crystal tear",
            "Dude's one of those \"don't need to level vigor if you never get hit\" bozos who runs with the Crucible of Crucibles talisman, red tearstone (whatever it's called now), scarseals, etc... and then gets one shot",
            "Ameican politics actually more cooked than the Lands Between ngl\n\nThey clearly need a femboy or a four armed doll to be the new president",
            "https://preview.redd.it/tq68ykk2qe9d1.jpeg?width=556&format=pjpg&auto=webp&s=2795c2f9007c70b0040df3d32f84aa8ec44d30f2\n\nWait OP I just saw your username - this you?",
            "https://preview.redd.it/cbtv4jxfye9d1.jpeg?width=1630&format=pjpg&auto=webp&s=de1dcbd6dfcbfcf61fe29cc3689bb9b961157fd2",
            "Well his ex wife was Melania, Blade of Miquella so...",
            "Trump couldn't even beat Medicare, Biden did it on ng+7.",
            "\"omens are gonna take all the misbegotten jobs\"",
            "https://i.redd.it/tx8a1ritsf9d1.gif\n\nFrenzy my beloved"
        ]
    }
}