{
    "The Weekly for 28 June 2024": {
        "title": "The Weekly for 28 June 2024",
        "score": 13,
        "url": "https://www.reddit.com/r/ShitAmericansSay/comments/1dq60e0/the_weekly_for_28_june_2024/",
        "content": "This is a weekly thread to chat. Discussions about life, reddit and anything else are all allowed here. You may also discuss, and link to, things you saw from the [banned list](https://old.reddit.com/r/ShitAmericansSay/wiki/submission_guidelines#wiki\\_low-hanging\\_fruit\\_restriction).\n\nBanned subreddits: ShitEuropeansSay, AmericaBad, 2american4you, KotakuInAction, ActualPublicFreakouts, Le\\_Pen, memes, historymemes, PoliticalCompassMemes, pussypassdenied, pussypass, theredpill, theredpillright, justlegbeardthings, dankmemes, conspiracy, conservative, 4chan, murica, polandball, AskAnAmerican, NoStupidQuestions, UnpopularOpinion. Offshoots of these subs, similar forums, and other LHF sources also fall under rule 7.\n\nBanned subjects: Trump and his entire administration, nuking of Hiroshima and Nagasaki, Charlie Kirk/TPUSA, current events such as recent or ongoing shootings, terror attacks, hate crimes, bombings, etc.\n\nThis list may change at any time. Do you think a subreddit or subject should be banned from SAS? [Send us a message](https://old.reddit.com/message/compose?to=/r/ShitAmericansSay)!",
        "num_comments": 6,
        "comments": [
            "Wish me luck. I'm going to stay up and watch the presidential debate tonight.",
            "If I see one more comment about Biden being old and doddery, I'm going to scream. There's 3 years in it! They both seem like embarrassments, but at least one may bring back Wade v Roe and isn't a felon. \n\nI almost feel sorry for the thinking, sensible Americans, and desperately sorry for the women having their rights eroded.",
            "I tried and failed. It was chaos, on both sides. How’d you fare?",
            "Fuckers started arguing about golf halfway through I need out of here like now",
            "I lasted about 30 minutes and gave up. I hate Trump with a vengeance but how anyone thinks either of them are up to the job is beyond me. The parade of Tory leaders in the UK look like shining beacons next to those two. Biden needs to give it up and someone needs to hold Trump accountable for the never-ending torrent of lies he spouts.",
            "The clips of Biden just looked like elder abuse to me."
        ]
    },
    "REMINDER - DO NOT COMMENT IN POSTED THREADS. This is a form of brigading (which has caused subs to be banned in the past) and offenders will be permanently banned.": {
        "title": "REMINDER - DO NOT COMMENT IN POSTED THREADS. This is a form of brigading (which has caused subs to be banned in the past) and offenders will be permanently banned.",
        "score": 507,
        "url": "https://www.reddit.com/r/ShitAmericansSay/comments/w1dcca/reminder_do_not_comment_in_posted_threads_this_is/",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Reddit likes to pretend that the US doesn't have some of the best food on the planet": {
        "title": "Reddit likes to pretend that the US doesn't have some of the best food on the planet",
        "score": 260,
        "url": "https://i.redd.it/y6a166p4dh9d1.jpeg",
        "content": "",
        "num_comments": 111,
        "comments": [
            "They do have decent universities and doctors, we can give them that. A different question is being able to afford the good ones without being in the top 10%.",
            "Have to agree, they did invent pizza after all /s",
            "The US does have some great food the issue is the access and affordability to good quality ingredients and healthier foods.",
            "So why are the Americans all obsessed with Kerrygold butter if their food is so amazing?  Just asking for a friend.",
            "Culture? CULTURE!?\nAnything fermented for more than a month has more culture!",
            "They definitely have the best spray can cheese in the world. Not that anyone else would touch that garbage.",
            "I mean, it does, just nowhere near as much as they think…",
            "Don’t they put their chicken in bleach???",
            "In America they do have some really good food, but it’s not “theirs”. It’s come from other cultures that’s migrated there and become a staple. A food typically associated with America. Hamburgers, hotdogs, pizza can all be traced back to other countries. It’s no different that British food, okay we have hot pots, stews, but you’ll find variants of the same meal around the world. Let’s go chicken tika masala, I think and I might be wrong, first appeared in Britain it’s however Indian. The whole out shot is better than your shit is so far out because most of your shit, their shit and other shit came from or is inspired by another country. Nando’s, South African but inspired by Portuguese.",
            "America's food could be good if it wasn't full of corn syrup."
        ]
    },
    "“The most feared”": {
        "title": "“The most feared”",
        "score": 207,
        "url": "https://i.redd.it/rpf0dqdezg9d1.jpeg",
        "content": "",
        "num_comments": 56,
        "comments": [
            "Sure. Every team needs a clown to keep morale up.",
            "Said no one from any country, ever.",
            "Having worked with yanks when I was in the army I can confirm that they are indeed the most feared, friendly fire left, right and centre.\nThey're a fucking liability",
            "If we need someone to be loud, obnoxious and try to pay in dollars while you're in France we'll give you a bell, otherwise calm yourself big fella.",
            "If you want to die by so called friendly fire then yes",
            "You want American soldiers in front of you, not by your side, less chance of friendly fire that way",
            "When you look at the anthem's lyrics, if there's one country you don't want to mess with, it's France.",
            "America is that schoolyard bully that mistakes fear for popularity.",
            "The end of the quote says ...\"to fuck it up\"",
            "Sounds like something the talking orange arse would say."
        ]
    },
    "\"As a free American I thought Europeans(and Turks) were prohibited from owning firearms\"": {
        "title": "\"As a free American I thought Europeans(and Turks) were prohibited from owning firearms\"",
        "score": 117,
        "url": "https://i.redd.it/r8iu29e9vh9d1.png",
        "content": "Under an Instagram post about gun violence in Europe ",
        "num_comments": 22,
        "comments": [
            "OMG how does it feel to be free? I’m European 😭",
            "To be fair, America does incarcerate a disproportionately high number of its citizens, so an American specifying that they are free is not entirely unreasonable 🤔",
            "Not prohibited just properly regulated in some countries. It’s fine to want to own a gun, but you don’t really need to carry 2 guns and 3 mags to go grocery shopping.",
            "What is a Free American? An American emigrant?",
            "It surprises Americans that many in Afghanistan and border regions of Pakistan are gun owners. Some of the biggest gun industries in the world are located there. \n\nMost country governments regulate their gun industry and gun ownership though, like they do for many forms of business.",
            "We hunt with stones and pointy sticks.",
            "I like how some Americans engage with Europeans and open with “as a free….” … it’s not the not knowing we can own firearms that’s ignorant it’s assuming no one else has freedoms. Most if not all developed nations (excuse my ignorance of not knowing all) has some form of bill of rights, here in the Uk it’s Magna Carta, we are free too. Of what makes him free is he can own a gun, ask Donald trump if he’s a free American because he no longer can. Is he free because he has freedom of speech? Guess what we do too and like in America it’s with limitations… freedom of movement, access to free education, freedom to practise religion……",
            "As a free Norwegian I'm here to say, accepting money would constute prostitution.",
            "The most armed by percentage general population in the world is Finland like nearly every adult in Finland owns a gun which is much more than America.",
            "I own several machine guns that are absolutely not possible to own in the US. lol."
        ]
    }
}