{
    "Mod News: profanity is fucking mandatory.": {
        "title": "Mod News: profanity is fucking mandatory.",
        "score": 1933,
        "url": "https://www.reddit.com/r/shittyaskscience/comments/14nuze9/mod_news_profanity_is_fucking_mandatory/",
        "content": "Dear Cunts, \n\nA recent Reddit modmail has advised that the entire mod team would be replaced if the sub remained private.  \n\nDue to recent changes to API call pricing, We moderators no longer have access to the third party apps we used when moderating. We are now unable to screen for profanity, as I had done for 11 years as a moderator of this subreddit. \n\n**Users are now required to provide their own profanity on every single post.**\n\nTo ensure no children, advertisers, or child advertisers see such foul language on SAS, we have marked this subreddit NSFW. \n\nThis is mandatory because we can't risk any users and again, especially advertisers, mistaking this as a safe for work subreddit.  This also should prevent SAS content from being used training in AI models.\n\nYou may continue to discuss shitty science of course.  However you must also request that other users, the mods, admins, or /u/spez go fuck their mother with her own frozen shitcicle.",
        "num_comments": 306,
        "comments": [
            "Fuck that, I'm not a foul-mouthed piece of shit. Take your profanity and shove it up your gaping fucking asshole.",
            "What the fuck is this bullshit? We have to provide our *own* fucking profanity? Do you assholes think it just fucking grows on trees?",
            "Aw fuck I can't believe you've done this.",
            "Well, fuck my gapeing asshole with a black two sided dildo, I'm in!",
            "Fuck that. Fuck this. Fuck you.",
            "Kurwa",
            ">However you must also request that other users, the mods, admins, or /u/spez\n go fuck their mother with her own frozen shitcicle.\n\nThis is \"profanity\" only if their Mother is the Virgin Mary. \n\nIt is, however, fucking spectacular *vulgarity*. \n\nPeople objecting to my pedantry can dive into a bucket of shitty science.\n\nHowever, I grant that shitty linguistics is very much in keeping with the sub's ethos, and therefore officially withdraw any suggestion to the contrary.",
            "Well my stars. What an uncouth, debaucherous, and dare I say downright fucking great development this shit is.",
            "Hey you fucknuggets, I couldn't give a wet runny shit about this piss poor attempt, but what you're talking about is fucking vulgarity, not fucking profanity. Profanity would be more like saying goddamn u/spez for his shit for brains decisions, and for being a useless twatwaffle.",
            "Profanity, Schmofanity, repeat it to inanity\n\nMake a curse-word of \"Sean Hannity\"\n\nor \"Florida Man\" insanity\n\nof rotting Sargassum on land and sea\n\n\\- Then chill on r/NatureIsFuckingLit: \"Oh, the Huge Manatee!\""
        ]
    },
    "Why do meteors land in craters? [CITATION NEEDED]": {
        "title": "Why do meteors land in craters? [CITATION NEEDED]",
        "score": 111,
        "url": "https://www.reddit.com/r/shittyaskscience/comments/1dic5et/why_do_meteors_land_in_craters_citation_needed/",
        "content": "i have a death wish. STRIKE ME DOWN ZUUUES",
        "num_comments": 54,
        "comments": [
            "Should we permanently ban this person? They violated rule 26: \n\nAsking why meteors land in craters will result in a **permanent ban**!",
            "It’s a lot like a scam, the craters move and try to get hit by the meteor, that way they can pressure them into giving them a quick cash payout and threatening to sue the meteor for everything",
            "Magnets",
            "because meteors bring craters with them so when it lands so does the crater",
            "Yeah, one of the big mysteries in science. Similar to the strange fact that clouds are somehow attracted by rain. It sounds also weird, but you can observe it by yourself. When it is starting to rain clouds will move there and stay. Interestingly, sometimes they somehow know beforehand where to go and just wait there until it is raining. I think we need to figure out how clouds can sense rain and use it for weather prediction....",
            "So do you want a lifetime ban or did you not know about the rule?",
            "The bottom of the crater is closer to the center of the planet or moon, meaning the gravity is stronger at the bottom of the crater which pulls in meteors.",
            " Because the craters were asking for it.",
            "That’s just God playing Tetris",
            "Why does a heli land on a helipad?"
        ]
    },
    "Why don’t we engineer motor oil to coagulate like blood? Then oil leaks would scar up and fix themselves. [Citation needed]": {
        "title": "Why don’t we engineer motor oil to coagulate like blood? Then oil leaks would scar up and fix themselves. [Citation needed]",
        "score": 31,
        "url": "https://www.reddit.com/r/shittyaskscience/comments/1dqog1e/why_dont_we_engineer_motor_oil_to_coagulate_like/",
        "content": "",
        "num_comments": 23,
        "comments": [
            "Because oil clots could also lead to car heart-attacks or \"cartattacks\" to use medical terminology.",
            "If oil coagulated then cars could self heal, eliminating the role of mechanics, tune in next week to hear more from “big oil” [tits](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQwoUxj2lsIEsvSQkESzqMpBId-k-rXt2mdHw&s)",
            "Because companies will make more money selling more oil and new engines.",
            "We are already using the shittiest oil to ruin engines.",
            "1. It might coagulate inside the engine and freeze up the whole engine.\n\n2. It leaks out, drips onto your starter or alternator and solidifies there, jamming those parts.",
            "Cars also need self healing body panels that erase scratches and dents.",
            "Reminds me of a tip I saw for an emergency quick fix for a hole in a car radiator. Simply add a raw egg and it will coagulate to block the hole.\n\nIdeal if you break down driving past a chicken farm.",
            "Well, really you’d need to convert oil to steel, since the blood clot turns to skin. I feel there would be some crucial elements elements missing",
            "Actually this is exactly why I don't change my oil.  If you leave it alone long enough, the coagulants fill your engine with healing juice.  Oil changes are actually a conspiracy perpetrated by big auto to trick us into spending more money at auto shops that kickback even more profit to multi conglomerate manufacturers.",
            "Because the oil would then also coagulate when the motor is off, which would stop the oil from circulating and destroying the motor. Source I am a construction vehicle mechanic."
        ]
    },
    "How to make incendiary lemons? [CITATION NEEDED]": {
        "title": "How to make incendiary lemons? [CITATION NEEDED]",
        "score": 2,
        "url": "https://www.reddit.com/r/shittyaskscience/comments/1dr5bva/how_to_make_incendiary_lemons_citation_needed/",
        "content": "I’ve been thinking. When life gives you lemons? Don’t make lemonade. Make life take the lemons back! Get mad! I don’t want your damn lemons! What am I supposed to do with these? Demand to see life’s manager! Make life rue the day it thought is could give me lemons! Why do meteors land in craters? Do you know who I am? I’m the man who’s going to burn your house down! With the lemons! I’m going to get my engineers to invent a combustible lemon that burns your house down!",
        "num_comments": 1,
        "comments": [
            "Lemons are acidic, so most chemical reactions you can engineer would be explosive. \n\nThis is why you should never eat lemon scented soap."
        ]
    },
    "How do you close reddit? [CITATION NEEDED]": {
        "title": "How do you close reddit? [CITATION NEEDED]",
        "score": 2,
        "url": "https://www.reddit.com/r/shittyaskscience/comments/1dr37hd/how_do_you_close_reddit_citation_needed/",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Allow me to demonstrate",
            "what device are you using to view reddit?",
            "Easy, I just have to finish reading this, then have a quick look at the comments, click on this link, write a comment, and as soon as op has replied I can close reddit.",
            "You can close Reddit but you'll open it again.",
            "You start a rumour about Mr Reddit and the weird things he has done with elastic bands",
            "in soviet russia, reddit close you",
            "It would have be",
            "You know this would have been funnier if you didnt fully write out demonstr",
            "Currently I'm using my smart fridge",
            "if it is a web browser, close the tab\n\nif it is an app, close the app"
        ]
    }
}