{
    "Mod News: profanity is fucking mandatory.": {
        "title": "Mod News: profanity is fucking mandatory.",
        "score": 1938,
        "url": "https://www.reddit.com/r/shittyaskscience/comments/14nuze9/mod_news_profanity_is_fucking_mandatory/",
        "content": "Dear Cunts, \n\nA recent Reddit modmail has advised that the entire mod team would be replaced if the sub remained private.  \n\nDue to recent changes to API call pricing, We moderators no longer have access to the third party apps we used when moderating. We are now unable to screen for profanity, as I had done for 11 years as a moderator of this subreddit. \n\n**Users are now required to provide their own profanity on every single post.**\n\nTo ensure no children, advertisers, or child advertisers see such foul language on SAS, we have marked this subreddit NSFW. \n\nThis is mandatory because we can't risk any users and again, especially advertisers, mistaking this as a safe for work subreddit.  This also should prevent SAS content from being used training in AI models.\n\nYou may continue to discuss shitty science of course.  However you must also request that other users, the mods, admins, or /u/spez go fuck their mother with her own frozen shitcicle.",
        "num_comments": 306,
        "comments": [
            "Fuck that, I'm not a foul-mouthed piece of shit. Take your profanity and shove it up your gaping fucking asshole.",
            "What the fuck is this bullshit? We have to provide our *own* fucking profanity? Do you assholes think it just fucking grows on trees?",
            "Aw fuck I can't believe you've done this.",
            "Well, fuck my gapeing asshole with a black two sided dildo, I'm in!",
            "Fuck that. Fuck this. Fuck you.",
            "Well my stars. What an uncouth, debaucherous, and dare I say downright fucking great development this shit is.",
            "Hey you fucknuggets, I couldn't give a wet runny shit about this piss poor attempt, but what you're talking about is fucking vulgarity, not fucking profanity. Profanity would be more like saying goddamn u/spez for his shit for brains decisions, and for being a useless twatwaffle.",
            "Well fuck fuckity fuck fuck fuck!",
            "C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T C U N T",
            "Now thats something I can get behind. Much like u/spez gets behind his fucking shareholders, fucking cunty ass son of a bitch"
        ]
    },
    "Why do meteors land in craters? [CITATION NEEDED]": {
        "title": "Why do meteors land in craters? [CITATION NEEDED]",
        "score": 109,
        "url": "https://www.reddit.com/r/shittyaskscience/comments/1dic5et/why_do_meteors_land_in_craters_citation_needed/",
        "content": "i have a death wish. STRIKE ME DOWN ZUUUES",
        "num_comments": 54,
        "comments": [
            "Should we permanently ban this person? They violated rule 26: \n\nAsking why meteors land in craters will result in a **permanent ban**!",
            "Its a lot like a scam, the craters move and try to get hit by the meteor, that way they can pressure them into giving them a quick cash payout and threatening to sue the meteor for everything",
            "because meteors bring craters with them so when it lands so does the crater",
            "Yeah, one of the big mysteries in science. Similar to the strange fact that clouds are somehow attracted by rain. It sounds also weird, but you can observe it by yourself. When it is starting to rain clouds will move there and stay. Interestingly, sometimes they somehow know beforehand where to go and just wait there until it is raining. I think we need to figure out how clouds can sense rain and use it for weather prediction....",
            "So do you want a lifetime ban or did you not know about the rule?",
            "The bottom of the crater is closer to the center of the planet or moon, meaning the gravity is stronger at the bottom of the crater which pulls in meteors.",
            " Because the craters were asking for it.",
            "Thats just God playing Tetris",
            "Why does a heli land on a helipad?",
            "bababababan baban bababababan\n\nfor his courageousness tho I say no ban"
        ]
    },
    "[CITATION NEEDED] What is the evolutionary advantage of having hair in your buttcrack?": {
        "title": "[CITATION NEEDED] What is the evolutionary advantage of having hair in your buttcrack?",
        "score": 7,
        "url": "https://www.starwars.com/databank/chewbacca",
        "content": "Example added",
        "num_comments": 5,
        "comments": [
            "It partially obscures the source of your shame.",
            "Cut down on friction when walking!",
            "Keeps pesky flies away when the business end of a big schwantz is at work on your hole",
            "It's where all drinking water comes from.",
            "Saves all the crumbs."
        ]
    },
    "What is the chance of inserting the USB on correct side the first try? [CITATION NEEDED]": {
        "title": "What is the chance of inserting the USB on correct side the first try? [CITATION NEEDED]",
        "score": 5,
        "url": "https://www.reddit.com/r/shittyaskscience/comments/1dr82fh/what_is_the_chance_of_inserting_the_usb_on/",
        "content": "",
        "num_comments": 4,
        "comments": [
            "An USB is a 4 dimensional object. It can only be inserted if the time is right.",
            "25 %. It's a spin--object, meaning you have to turn it 720 for a full rotation. Also it's flat so you can only attempt 0, 180, 360 and 540. That's a one-in-four chance.",
            "What is not commonly know is that the chance is actually 100%.\n\nThey have been quantum engineered to require at least one full twist before proper insertion. While the reason is as of yet unknown, twistless insertion of early prototypes repeatedly crashed the universe, so the current measure has been implemented as a stop-gap. As of yet, engineers are still working on a solution.",
            "33.3%"
        ]
    },
    "How to make incendiary lemons? [CITATION NEEDED]": {
        "title": "How to make incendiary lemons? [CITATION NEEDED]",
        "score": 8,
        "url": "https://www.reddit.com/r/shittyaskscience/comments/1dr5bva/how_to_make_incendiary_lemons_citation_needed/",
        "content": "I’ve been thinking. When life gives you lemons? Don’t make lemonade. Make life take the lemons back! Get mad! I don’t want your damn lemons! What am I supposed to do with these? Demand to see life’s manager! Make life rue the day it thought is could give me lemons! Why do meteors land in craters? Do you know who I am? I’m the man who’s going to burn your house down! With the lemons! I’m going to get my engineers to invent a combustible lemon that burns your house down!",
        "num_comments": 6,
        "comments": [
            "Lemons are acidic, so most chemical reactions you can engineer would be explosive. \n\nThis is why you should never eat lemon scented soap.",
            "Freeze dry them, then soak them in fuming nitric acid to nitrate them. Make sure to dry thoroughly afterwards. If you want to maintain the classic lemon look, remove the peel and then replace the nitrated lemon flesh after treatment.",
            "You tell 'em, Mr Johnson!",
            "Clear violation of rule 26, mods. Ban this man please.",
            "put c4 instead of sugar in your lemonade",
            "Which apparently he did."
        ]
    }
}