{
    "Sins of the father": {
        "title": "Sins of the father",
        "score": 1031,
        "url": "https://i.redd.it/clq6abgj5h9d1.jpeg",
        "content": "",
        "num_comments": 86,
        "comments": [
            "\"This is the LockPickingLawyer, and what I have here is a simple padlock to secure a cock-cage..\"",
            "How tf r u meant to pee",
            "longest edging session guiness world record",
            "I thought it was a designer lemon juicer.",
            "Can we take a moment to talk about the I made sure he cannot take it off thing",
            "People can be fucking insane sometimes",
            "That parents' gonna wonder why their child stopped talking to them 15 years later",
            "Got him on lock down",
            "So talking about the logistics here. If he wears this to school doesnt he have a semi-erect shape in his pants for all to see?",
            "50mm diameter while limp? That's impressive."
        ]
    },
    "👀👀": {
        "title": "👀👀",
        "score": 5551,
        "url": "https://i.redd.it/10wkxfj9le9d1.jpeg",
        "content": "",
        "num_comments": 100,
        "comments": [
            "Love the \"ugly sneakers\" just to throw a little extra shade",
            "He looks fancy, she looks like trash lol",
            "They both have something in common thoughirrelevancy",
            "Weird how this bullshit turned out to be accurate",
            "Hey at least he has a cool jacket",
            "This picture is absolute brutality.",
            "I hate those shoes so much. (Not Wills)",
            "She looks like the hookers by the trap house",
            "The best part about incels is that they will find it hard to breed",
            "Somebody about to get slapped?"
        ]
    },
    "Average comics subreddit experience": {
        "title": "Average comics subreddit experience",
        "score": 1122,
        "url": "https://i.redd.it/r98kc3avkg9d1.png",
        "content": "",
        "num_comments": 31,
        "comments": [
            "Reddit mods when they actually have to moderate",
            "Reddit mods when they have to actually do their job",
            "Internet jannies when they're given a single crumble of power",
            "Got banned from that comics for being in r justunsubbed\n\nBecause they'd rather remove the whole sub instead of the 2 people that brigade",
            "The only reason why I took this job is cause you never have to do anything!",
            "tbh it's not a job. They don't get paid.",
            "Pizzacake posted another sexist strawman comic and they're taking turns felating her",
            "Mid ahh attempt at what if men and women were reversed comedy",
            "delete the sub, do it",
            "Its a hobby that they don't wanna do"
        ]
    },
    "HARD": {
        "title": "HARD",
        "score": 1608,
        "url": "https://v.redd.it/xk56qovuyf9d1",
        "content": "",
        "num_comments": 46,
        "comments": [
            "The knee pushups are a great touch.",
            "Im a woman but Im hard now",
            "I dont like how hes making me hard rn",
            "Holy shit is that Scott the Woz???",
            "Where's Ryan? It's not Super Mega without Ryan.",
            "Make them hard? Show them a picture of prime Megan fox",
            "With legs like that he definitely means it",
            "I got so hard watching this",
            "Teach my son to be hard",
            "big boobs around me make me hard, not anyone else's son..."
        ]
    },
    "I don't remember this ": {
        "title": "I don't remember this ",
        "score": 3096,
        "url": "https://i.redd.it/oi4mdcsxwd9d1.jpeg",
        "content": "",
        "num_comments": 29,
        "comments": [
            "must have skipped a book cause i definitely remember this happening",
            "This is when Jeff Kinney peaked as an author\n\nEverything after sucked big balls",
            "Bro is Greg Hatsune Miku ",
            "Were reviving the book series with this one ",
            "#MIKU MIKU MIKU MIKU MIKU",
            "defame the best girl and die :3",
            "i cant see the end of the horizon-\n\n# HATSUNE MIKU?!",
            "Thought he turned into a fem boy for a moment",
            "Today, we'll be talking about the **PINGAS!**\n\nToday, we'll be talking about the *dinner.*\n\nDo you think thats funny *my boy?*\n\nDo you find it amusing that we'll be talking about the **BIG BALLS!**",
            "Chat, is this real?"
        ]
    }
}