{
    "Hey guys. Check out r/ShittyGameDetails for subtle nods of the shitty game details": {
        "title": "Hey guys. Check out r/ShittyGameDetails for subtle nods of the shitty game details",
        "score": 2442,
        "url": "https://www.reddit.com/r/shittymoviedetails/comments/m93l34/hey_guys_check_out_rshittygamedetails_for_subtle/",
        "content": "[SGD](https://www.reddit.com/r/shittygamedetails)",
        "num_comments": 20,
        "comments": [
            "I only post there like once every few months but stil got banned for \"spam\" lmao",
            "What about us braindead slobs?",
            "The fact that you used subtle nod in this post really shows how half assed that rule is.",
            "The mod team at SGD has answered your modmail. There's a reason for the 7 day ban.",
            "Holy crap that sent me down a rabbit hole",
            "Its no problem. We're open again ",
            "Yeah i was banned for a week because they think my title looks \"spammy\" even though the rules dont explain what that means.\n\nI think i just got banned because it had emojis and because i typed it to sarcastically look like I was supriesed and overreacting for comedic effect (which doesnt make it spam imo)\n\nAnd the reason I said \"Imo\" is because it *is* 100% subjective on if you personally think a title looks \"spammy\" or not (And banning someone because of your subjective opinion and not because they objectivley violated a guidline is fucking stupid btw)\n\nLike if the post or title was off topic (they werent) or if the title had like a link or something (it didnt) I would understand, but even knowing that its subjective, I dont get why the mods thought my title was \"spam\" other than it having emojis \n\nbecause \"dur hur hur emojis bad only cring instagram normies use emojis not epic dank holesum 100 keanu chungus redditors\"",
            "A subtle nod",
            "Private? ;_;",
            "r/Shittygamedetails"
        ]
    },
    "In the world of Fast and Furious, this is what a 17-year old boy looks like.": {
        "title": "In the world of Fast and Furious, this is what a 17-year old boy looks like.",
        "score": 2869,
        "url": "https://i.redd.it/l82njwc4ig9d1.jpeg",
        "content": "",
        "num_comments": 81,
        "comments": [
            "Playing high school football in Texas fucks you up",
            "I knew a guy that looked like that when I was in high school... he was 16.",
            "Have you seen Mighty Morphin? They looked like they could have a kid that goes to high school.",
            "I am still wondering how Doms baby ended up being black with no black parents\n\nEdit",
            "Same. This is totally believable just not maybe the most common thing to see.",
            "The Power of Family grants the characters faster aging so they'll peak faster. Same way it makes them semi immortal.",
            "I had a friend who looked like that. He also had a worse hairline. He was 17",
            "That's a late 20s-mid 30s year old man, lol.",
            "Just checked and he was 24 irl! I was expecting early 30s",
            "Growing up in a shitty 3rd world country does that to you.\n\nDon't ask me how I know."
        ]
    },
    "This scene in The Mask of Zorro (1998) is the most replayed part of the movie on YouTube": {
        "title": "This scene in The Mask of Zorro (1998) is the most replayed part of the movie on YouTube",
        "score": 8819,
        "url": "https://v.redd.it/htx46vkzhc9d1",
        "content": "",
        "num_comments": 214,
        "comments": [
            "Hornyman strikes again. Who will put a stop to this madness?",
            "...because of the sword fighting... right?",
            "It's the only part I've even seen",
            "Isnt this puss in boots?",
            "Daily reminder that Catherine zeta Jones in Welsh and not in fact latin or whatever",
            "After re-watching it 32 times, I couldn't find what's interesting about this one clip i guess i have to watch 100 more times......",
            "She dips beneath the lazers",
            "tbf even without the undressing that's a better fighting choreography than 80% of Hollywood products",
            "from the Z to the O to the double R O...",
            "I feel like this scene does not age well"
        ]
    },
    "In Deadpool and Wolverine, Deadpool says that he is “soaking wet right now” when he is with Wolverine. This suggests that Deadpool is gay.": {
        "title": "In Deadpool and Wolverine, Deadpool says that he is “soaking wet right now” when he is with Wolverine. This suggests that Deadpool is gay.",
        "score": 805,
        "url": "https://i.redd.it/uypbn2wlcf9d1.jpeg",
        "content": "",
        "num_comments": 44,
        "comments": [
            "Gay doesnt even begin to cover it.",
            "He's canonically pansexual, look it up",
            "Bro you forgot the funny in this post .",
            "I don't think there is a sentient being that is able to comprehend this guy's sexual preferences",
            "I thought he just has incontinence.",
            "I don't think deadpool is growing any fucks for that thought.",
            "Water is wet, more news at 11.",
            "Looking at other comments no realizes this fight scene is based in a dried out lake.",
            "Ngl all of the homo-erotic humor they're pushing in the marketing is not going to sit well with me if they don't actually fuck in the movie.\n\nLike I get that the character is supposed to be sincerely attracted to these men and that it's not necessarily saying this is a bad thing, but also the premise of a man liking another man is the set-up and punchline here.",
            "Or it just means his suit is really sweaty...geez"
        ]
    },
    "In \"The Boys\" (2019-), Giancarlo Esposito's character almost gets killed by a chicken. This is due to the mass killings of chickens he committed back when he was running Los Pollos Hermanos.": {
        "title": "In \"The Boys\" (2019-), Giancarlo Esposito's character almost gets killed by a chicken. This is due to the mass killings of chickens he committed back when he was running Los Pollos Hermanos.",
        "score": 11114,
        "url": "https://v.redd.it/7swyt2eogb9d1",
        "content": "",
        "num_comments": 119,
        "comments": [
            "god damn it i just bloody finished the episode and wanted to post the exact same joke here ?",
            "I really hope that his character doesn't die, I know, he is a villain, but come one.",
            "Blud shouldn't have lost the Darksaber",
            "He is more scared of Super Chicken than Homelander.",
            "Buggin Out has really come a long way",
            "And they say a chicken never forgets...*Coo-coo-ca-CHAW*",
            "Starlight V-erectile Dysfunction is just canon. Like dude be useful with your powers. You're basically a tanky civilian at this point.",
            "How many times did he wipe blood from his face in this episode? Lol",
            "Head go boom lady saved him with her powers which she promptly forgot about as soon as the deadly flying sheep showed up",
            "He's a Chicken Man, why didn't he just speak to them in Beakinese?"
        ]
    }
}