{
    "No more t-shirts for now": {
        "title": "No more t-shirts for now",
        "score": 197,
        "url": "https://www.reddit.com/r/Shittyaskflying/comments/w2zk0x/no_more_tshirts_for_now/",
        "content": "We are getting way too many spammers trying to sell tshirts in here. So for the time being, no more posting of tshirts. And if you see others posting tshirts, especially the KSEA fly it like you stole it guy, please report these as spam.\n\nHopefully this is not a permanent change and we can get the spammers to go away.\n\nEdit: To be 100% clear, anyone asking for sources, posting links, or participating in the tshirt spam will be perma banned.\n\nDouble Edit: This also goes for any product being sold. Posters, toys, trinkets, etc. We are not selling or linking to purchasable items here.",
        "num_comments": 34,
        "comments": [
            "Awesome tshirt! Can you post the link to where you got it please?",
            "Last time I checked selling t-shirts isn’t banned in the FAR AIM. Anyone know the reg?",
            "In most of the airplane related FB groups I’m in there’s so many tshirt bots. It’s like they exploded overnight",
            "I’d like a t-shirt with this subreddit on it.",
            "I literally don't know what is satire in this sub and what is not. That being said I bought that shirt and I'm seriously considering wearing it for my Checkride which I'm gonna schedule for Aug 10th",
            "Yo what gives!! Came here for t-shirt links! \n\nTAKE MY AVGAS MONEY",
            "Hey thanks Greg, hopefully we can get this sorted out",
            "FAA trying to take us down",
            "Wait those were my air markers for my flight path, now I can't see anything.",
            "I know ERAU is a scam but in their defense they do more than sell shirts."
        ]
    },
    "Harassment filter update": {
        "title": "Harassment filter update",
        "score": 8,
        "url": "https://www.reddit.com/r/Shittyaskflying/comments/1d46zf2/harassment_filter_update/",
        "content": "Holy shit y'all.\n\nIn case you missed it, Reddit turned on a harassment filter not too long ago. See my [previous thread](https://www.reddit.com/r/Shittyaskflying/comments/1cs2qs8/announcement_harassment_filter/) for details.\n\nIt is turned on low. I thought there might be the occasional extra post or reply removed, but holy shit. 10-20 (on average) new removals a day. I take a glance at them and might let one or two through, but the rest I have to agree with.\n\nThis IS a shitposting sub. I expect some of the shitpost comments to be caught in the filter, but what I wasn't expecting was SO MANY things being caught. Things that, while clearly meant in a satirical/shitpost/not serious way, the admins of reddit and their vaunted algorhythms could easily use to shut us down if they wanted. \n\nI'm going to be clear. I don't typically browse shittyaskflying. I am not going to see the vast majority of the comments. I rely on reports, automoderator, and now the harassment filter to catch things. \n\nI wonder what would happen if I turned the harassment filter to high........ You know, for science lol.\n\nDon't worry, I'm not planning on actually doing that.....\n\nEDIT: Maybe I will turn it to high for a week or something. See how that impacts things. If I do, I won't tell anyone when. I don't want people to TRY to get more caught. But I will tell people after!",
        "num_comments": 9,
        "comments": [
            "What does this have to do with my specially made sticky milk and its effects on Jet-A?",
            "We should turn the harassment filter to high on a certain day of the week just to see",
            "So...should we all test it's boundaries in a dedicated thread? Or would that result in the automatic removal of shitposting privileges?",
            "You should do it on April fools Day or something",
            "Are your thrust levers retarded?  Because you have to do that to land.",
            "Maybe I will... See what the sub thinks.",
            "No. If I do it I won't say when. I'll want it to be as legit a test as possible.",
            "Some people are just always flying with the gear down, if you catch my drift",
            "DO IT!"
        ]
    },
    "First time flying in direct lawn": {
        "title": "First time flying in direct lawn",
        "score": 334,
        "url": "https://v.redd.it/i267ot2u1f9d1",
        "content": "",
        "num_comments": 35,
        "comments": [
            "Told you to stay out of the Bermuda Triangle.  Full right rudder now!",
            "Is that how pylotes do their laundry?",
            "Dude it takes no time to solve a Rubik’s cube these days.",
            "Why do I see the Star of David? Am I Jewish?",
            "It’s not you. The world is spinning.",
            "Gyro- from the Greek word guros (gyrate): to spin\n\nSeems to me it's doing exactly as intended",
            "It's probably just an older WWI era instrument. Back then it was easier for the whole gauge to spin around the needle instead of the other way around",
            "Hmmm this looks like your in mulch mode",
            "When AI does your cockpit videos.",
            "Maintenance will have fun with this one."
        ]
    },
    "How do you say pop a wheelie in French?": {
        "title": "How do you say pop a wheelie in French?",
        "score": 506,
        "url": "https://v.redd.it/yhjdkz4vcd9d1",
        "content": "",
        "num_comments": 60,
        "comments": [
            "Dragging butt there. May want to check for worms.",
            "pas assez de gouvernail droit",
            "They had to turn off the air conditioning to give the engines more power for take off on that one.",
            "„Quiqui baguette wheelie a la croissant“ is the correct answer",
            "I feel like it was very hot and humid there",
            "Heavy load ....Lotta Americans in that one.",
            "A surprisingly difficult maneuver apparently.",
            "C'est full of l'Americans, un climb est difficile...",
            "\"I'm giv'n er all she's got cap'n!\"\n\nErr, that's probably Scottish, nvm.",
            "v1 v1 v1 v1 v1 v1 v1 v1 v1 v1 v1 v1 v1, rotate"
        ]
    },
    "People want electric airplanes. But what happens when the sun isn’t shining and you’re still up in the air? ": {
        "title": "People want electric airplanes. But what happens when the sun isn’t shining and you’re still up in the air? ",
        "score": 19,
        "url": "https://www.reddit.com/r/Shittyaskflying/comments/1dran0f/people_want_electric_airplanes_but_what_happens/",
        "content": "I’m working for the Trump campaign and he keeps asking it’s driving me nuts. So I thought I’d ask the proyfesional pylots. ",
        "num_comments": 17,
        "comments": [
            "Erth's magnetic core. As long as you don't fly off the end of the erth. You just need a big copper coil around your playne and can fly forever, free energy, big oil haz Ben keeping this secret from everyone for yeers.",
            "The right rudder stops working",
            "Well, geez, then you need lunar panels.",
            "Unfortunately you are stuck up there until the sun shines again.  The other option is to bring some flashlights with you to supplement the loss of sun power….",
            "Dont be a fucking idiot, of course its not solar.  Your range is determined by the onboard extension cables and the ability of the flight engineer to reconnect them really quickly as you progress the flight",
            "You will never make Trump’s Boinging 7888887 electric so quit asking",
            "I'll still be up in the air, until I'm not. Ewe'll see me better cuz 🎶 IT'S ELECTRIC 🎶",
            "Fed the hamstars on da weels an dey be turnin da props",
            "Exactly why I invented electric plates that generate electricity when compressed. The compression comes from the pressure differential generated by the force of air over the wings and the packs in the seats, you gotta make sure the wings stay attached to the playne.",
            "Amazing. So.. what if I attach large rare earth magnets to the underside with the 'northpole' side facing down? Will I be airborne forever if I only fly in the northern hemisphere?\nI'm afraid if Boing finds out that I might accidentally fall out of a window next week."
        ]
    }
}