{
    "An update to our rules and ban policy": {
        "title": "An update to our rules and ban policy",
        "score": 89,
        "url": "https://www.reddit.com/r/ShitPostCrusaders/comments/1dm0blz/an_update_to_our_rules_and_ban_policy/",
        "content": "Hello everyone, over the past few months we've noticed an increase in complaints regarding the moderation of the subreddit. Due to the infamous release schedule of Part 6 and the silence from DP regarding part 7's adaptation it is a lot quieter in the fandom, and probably will be until we recieve an announcement about the part 7 adaptation. As such, we've decided to take the opportunity to address the complaints made by users of the sub, to re-do some of the rules that are frequently complained about or that we feel are outdated, and to clarify our stance on these rules and how exactly we plan to enforce them in the future.\n\n\\*\\*Rule-break policy\\*\\*\n\nIn the past our policy regarding rule breaks has been a 5 day temporary ban from the subreddit, with an additional 2 days for each additional rule broken. This worked previously because it was a smaller subreddit with fewer rules, but as time has gone on we've added more rules and more memes to the ban list (more on that later).\n\nTo compensate for this we've lowered the temp ban to 1 day across the board, with the exception of a couple rules. Additional rule breaks in a single post/comment will still incur an additional 2 days per rule broken just like before. If you continuously break the rules after being unbanned you will receive a 7 day ban instead.\n\n\\*\\*Rule 1: Jojo Shitposts Only\\*\\*\n\nThis rule will remain largely unchanged, the only difference is a matter of clarification. Previously this rule had an additonal note stating that unedited screenshots will be removed. This is still true, however while this was originally referring to things like screenshots of jojo-related articles we mainly see this rule broken when people upload unedited \"memes\". As such, we've moved this stipulation to the quality rule as we feel it fits better there.\n\n\\*\\*Rule 2: Use proper >!Spoiler tags!< and flairs. NSFW is restricted\\*\\*\n\nThis rule is also remaining unchanged, however we've added a note clarifying how exactly this rule is enforced. If your post is flaired incorrect or has an unmarked spoiler in the image we're happy to just fix it and leave the post, but if your post has a spoiler in the title or the spoiler is in a comment, it will still be removed as usual and you will receive a 1-day ban.\n\n\\*\\*Rule 3: Be nice, Use your Golden Heart\\*\\*\n\nThis rule has received no changes, however it will keep the old ban policy, so breaking this rule will result in a 5 day ban, plus 2 days for each additional rule break. There is never a reason to be mean to someone here, and it will not be tolerated, repeat or extreme offenses will result in a permanent ban.\n\n\\*\\*(OLD) Rule 4: No Elitism\\*\\*\n\nPreviously this rule covered cases where someone is shaming others for their preferences, specifically in relation to part skipping, however we feel that this falls under rule 3 and as such we've just merged it into that rule.\n\n\\*\\*Rule 4: Don’t be Dong, Don’t Repost\\*\\*\n\nThis rule has also received no changes as it was updated last year individually. I would like to re-iterate that uploading a meme you found somewhere else like Instragram or Tiktok does count as a repost.\n\n\\*\\*Rule 5: Provide the source for any non-original part of your post.\\*\\*\n\nThis rule has received no changes.\n\n\\*\\*Rule 6: Quality rule: Put effort into both the title and the content of the post\\*\\*\\*\n\nThis rule has remained mostly unchanged, however we've moved one of the stipulations, the one regarding meta-baiting, to its own rule as we feel that topic requires more clarification. Additionally, as mentioned earlier we've moved the unedited screenshot stipulation to this rule.\n\n\\*\\*(NEW) Rule 7: No Meta-Baiting\\*\\*\n\nThis is the most contested type of ban we issue due to where it was placed and how it was described before, so we've moved this stipulation to its own rule so that it will have more attention drawn to it, and so we can better outline what actually counts as metabaiting.\n\nMetabaiting refers to the act of trying to farm engagement on a post by asking for upvotes/awards, or by designing the post to fish for comments. Common examples include:\n\n\"Comment on this post and I'll tell you your stand\"\n\n\"Upvote this post or killer queen will touch you\"\n\n\"Today is my cake day, please upvote!\"\"\n\nThe most common type of post that gets removed for this is the first example, where someone asks users to comment on their post, and then they respond to those comments with some kind of gimmick. While we understand that these can be fun and do drive up engagement, these type of posts are very low effort and can easily overrun a subreddit.\n\n\\*\\*(OLD) Rule 8: Reaction Memes\\*\\*\n\nIn line with the changes to the old rule 9, we've decided to remove this rule to lessen restrictions on what can be posted.\n\n\\*\\*(OLD) Rule 9: Banned Memes\\*\\*\n\nThis is \\*easily\\* the ban we see the most complaints about. Before covering the changes we've made I'd like to clarify the reason they were banned in the first place.\n\nOccasionally when a format becomes really popular it completely overruns the subreddit with repeats of the exact same joke over and over again. The most recent example of this, and the most recent ban on the list, is the format \"Stand go and do X\". There were definitely funny uses of this format, but at a certain point it was just the exact same joke repeated ad nauseam.\n\nAs mentioned before the fandom is much quieter now than it has been in recent history so we've decided to unban everything, and will be removing this rule entirely. These rules were from a time when the sub was much more active and required more moderation, but during this period we feel they don't need enforcing. This may change in the future if problematic formats arise when we get more activity, but for now everything from this list will be allowed again.\n\n\\*\\*(NEW) Rule 8: No Brigading/Witch-Hunting\\*\\*\n\nThis rule technically already falls under 'Rule 3: Be nice, use your golden heart', however we feel this one should be displayed separately as breaking this rule is far more severe in most cases and will result in a 14 day ban at the very least, up to a permanent ban depending on severity.\n\n\\*\\*Rule 9: Manga Weekends\\*\\*\n\nThis rule has received no changes\n\nThese are all of the changes we've made to the rules, but as stated we are still open to reviewing these in the future depending on how these changes play out. Please feel free to reach out on this post or to myself if you have any concerns or suggestions about these rule changes. Thank you.\n\n--\n\nSPC Mod Team",
        "num_comments": 22,
        "comments": [
            "Any posts in the queue before this was posted have simply been removed without a ban for simplicity's sake (and because I'm lazy), anything posted from now on will be subject to the above rules ![img](emote|t5_3f7q5|7818)",
            "Ay good shit, cheers",
            "I can finally unleash my folder of banned memes",
            "Love the transparency",
            ">we've lowered the temp ban to 1 day across the board,\n\nBest news I heard all day; and yes i read the rest of the rule for it",
            "I read the whole thing, thank you.\n\nHopefully I'll be able to see Part 7 and 8 in this life.",
            "Good changes. Thanks, Mods! 👍",
            "Neat.",
            "Question. Is saying \"good bot\" counts as shit like \"Like this or Wonder of you gonna give you cancer\" Type shit?",
            "based mods"
        ]
    },
    "Why no one talks about this ??": {
        "title": "Why no one talks about this ??",
        "score": 2139,
        "url": "https://i.redd.it/4pbdaym1rc9d1.jpeg",
        "content": "",
        "num_comments": 50,
        "comments": [
            "Amazing foreskinning by Araki 🤯 ❗️",
            "What the actual FUCK is going on with this design",
            "Best Jotaro outfit.",
            "easy, because this line was replaced with another in anime adaptation.",
            "What the fuck, why did you do that what is wrong with you",
            "he looks like a pigeon",
            "He knows",
            "no way bro predicted it🤑",
            "Araki was using AI generated hands back in the days, sensei indeed",
            "Spoiler tag"
        ]
    },
    "JJBA x Beavis and Butt-Head": {
        "title": "JJBA x Beavis and Butt-Head",
        "score": 337,
        "url": "https://www.reddit.com/gallery/1dqryqc",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Jotaro ehehehehe\n\nDio ahaha ahahaha",
            "“Kick his ass in the ass” is such a butthead line too",
            "This is the highest tier of shitposting",
            "I thought the world was giving him a shoulder rub",
            "I AM CORNHOLDIO! ARE YOU APPROACHING ME?",
            "\"He cant stand because I punched him... with my Stand... heh heh.\"",
            "I know right! I did this a year ago."
        ]
    },
    "dont ask me where i got this from": {
        "title": "dont ask me where i got this from",
        "score": 1763,
        "url": "https://i.redd.it/ww8v1tukz99d1.jpeg",
        "content": "",
        "num_comments": 39,
        "comments": [
            "where did u get this from",
            "Sorry to be the guy but isn't jotaro also 6'5, the same height as jonathan and joseph?",
            "The fucking gun gets flaccid lol",
            "Where did you get it from?",
            "Literally the other way around.",
            "The \"Misc\" post flair is only to be used when the post is not about any specific part and all the other flairs don't fit. Please make sure that that is the case. If your post is about multiple *specific* parts, give it the flair of the latest of those parts, not Misc.\n\nIf you don't think there's an issue, you can ignore this comment.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ShitPostCrusaders) if you have any questions or concerns.*",
            "from the comment section of a hentai comic",
            "Jonathan, Joseph, and Jotaro are all 195CM.",
            "Just like a pancake.",
            "the comment section of a hentai comic"
        ]
    },
    "alternate part 6 ending by Honlo": {
        "title": "alternate part 6 ending by Honlo",
        "score": 138,
        "url": "https://www.reddit.com/gallery/1dqvnuf",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Jojo if it was peak",
            "I was listening to Jonathan's theme while reading this, made it even better.",
            "did Josuke time travel or does he still wear his school uniform in his late 20s?",
            "Who wrote this? Rohan???? ✍️🔥🔥🔥",
            "Peak-er",
            "I mean… Jotaro based every outfit he ever had off of his highschool uniform and it was absolutely drippy- who’s the same Josuke wouldn’t do the same?",
            "![img](emote|t5_3f7q5|15567)",
            "Peak-est",
            "Bokki... da..."
        ]
    }
}