{
    "You've Out your last Shit": {
        "title": "You've Out your last Shit",
        "score": 934,
        "url": "https://www.reddit.com/r/shittydarksouls/comments/17gi11r/youve_out_your_last_shit/",
        "content": "No more outshitted posts (screenshots of other Soulsborne subreddits' posts)\n\nScreenshots of other subs are against the rules (and have been for awhile), mainly because Reddit gets pissy about it, but also because WE'VE ALL FUCKING SEEN IT ALREADY. \n\nBe creative or go commit Dark Souls 2 immolation.",
        "num_comments": 126,
        "comments": [
            "Thank god, can we start shitting now?",
            "Is there also any way this can extend to people that post non shitposting stuff from main sub on here? theres one guy named jamal that keeps posting clips of a video essay defending ds2 and he post it here and on the ds2 and fromsoft subreddit and its super annoying.",
            "thank you thank you thank you thank you 🙏",
            "I'd say \"can we also ban or severely limit any post where the 'joke' is 'omg femboys haha amirite gamers?!?!'\", but I know 99% of this sub is into that shit, so...\n\nCan you at least post some Lady Maria femdom or something? Not all of us like dicks.",
            "this is the best post you guys ever made",
            "Praise be to the mods.",
            "Thank fucking god. Was legitimately more annoying to see “oUT ShItTed AgAiN!1!1!” posts than the blatant porn. At least the latter is blurred",
            "Give it to me, that thing… your Out Shit.",
            "Ive had to link people to this post either in comments or dms 14 times. How do ppl not read the pinned post",
            "up next  ban horny posting and this sub is back to it's glory days"
        ]
    },
    "For the next 7 days, all posts with references to, footage from, or memes about Shadow of the Erdtree's content must be marked with the new \"SOTE SPOILERS\" flair.": {
        "title": "For the next 7 days, all posts with references to, footage from, or memes about Shadow of the Erdtree's content must be marked with the new \"SOTE SPOILERS\" flair.",
        "score": 149,
        "url": "https://www.reddit.com/r/shittydarksouls/comments/1dkg2vn/for_the_next_7_days_all_posts_with_references_to/",
        "content": "Comments on posts without the flair must also not contain spoilers. \n\nPosts about the leaks are still not allowed due to being majorly cringe.\n\nIt's finally here, ye tarnished.",
        "num_comments": 13,
        "comments": [
            "  i would name my first born after you shitty dark souls mods",
            "Thank you (shitty) Dark souls (mods)",
            "I’ve been avoiding this subreddit because I’m a moron and I click on things that say spoiler and am surprised when there’s spoilers",
            "SOTE SPOILERS >!finna jerk it in about 2 hours!<",
            "✋ what exactly are we allowed to make memes  concerning the dlc due to it being out.",
            "I love you guys, I can’t play for the first day it comes out",
            "darks souls player can breed now?",
            "Man me to .\nI wish started avoiding it before I got spoiled of final boss",
            "Anything, as long as it is properly flaired so that people who haven't yet played don't get spoiled.",
            "Pretty sure anything as long as your posts are properly flared for spoilers."
        ]
    },
    "Why are ppl so negative?": {
        "title": "Why are ppl so negative?",
        "score": 1138,
        "url": "https://i.redd.it/uv5o7b44sg9d1.png",
        "content": "",
        "num_comments": 297,
        "comments": [
            "Most people enjoying something do not actively go out of their way to post it on reddit. At most it’s one passing tweet. The data is generally skewed to begin with, especially on a sub like this. As of right now the DLC is sitting at 7/10 on Steam which indicates generally positive reception, and this is despite the initial negative scores due to ongoing performance issues (which is a problem) and alleged Chinese anti-hacking.",
            "I haven't played it yet someone please tell me what my opinion is supposed to be",
            "They aren’t. Most posts are about the same couple of valid issues. I think most of us agree that overall it’s an awesome DLC. But it’s not perfect, and the genuine problems should absolutely be recognised and called out so they can be fixed, or at the very least not repeated.",
            "People usually are negative because they greatly care about something and want it to be the best it can. I generally enjoyed the DLC but there are absolutely parts of it that deserve criticism and voicing that criticism is important so that From knows what they can improve in their next titles.",
            "0/10 DLC / game because it still has no covenants",
            "The DLC as a whole is fire. There are just some pretty bad parts.",
            "Idk only problem for me it’s that when it starts raining sometimes the framerate stutters a bit, but nothing unplayable",
            "i'm already tired of this format, why do people always get attached to the most dogshit boring ass nothing memes",
            "Lore fans are malding, people who hate difficulty are malding, but most everyone else loves it.\n\nMost common complaint I end up seeing are the overtuned bosses, which is just a misguided version of a complaint against the new upgrade system of scadutree fragments. Honestly once you get all the fragments the final boss really doesn’t pose that much more of a challenge compared to Malenia.",
            "ITS TOO HARD BUT I REFUSE TO GET GOOD, SUMMON, CHANGE MY TACTICS, LEVEL UP MY SCADURTREE (i didn’t read the pop up)!!\n\nEXPLORATION IS WASTING MY TIME 😡"
        ]
    },
    "FromSoft fans are the fucking worst": {
        "title": "FromSoft fans are the fucking worst",
        "score": 1254,
        "url": "https://i.redd.it/kju1z6sg3g9d1.jpeg",
        "content": "",
        "num_comments": 476,
        "comments": [
            "Why is this defendable when you have the absolute peak fights like bayle in the dlc. You literally go to the peak to fight peak!!",
            "Theme is amazing, second phase with the constant chip damage from his after images and constant light beams spam? Aids to deal with, ironically that is the shit that keeps killing me the most, one moment you are fine, the next one you are dead.",
            "1st phase was off to a good start but then had to put in the stupid AOE attacks and the attack that turns my game into a slideshow",
            "I have not heard anyone say one good thing about this boss",
            "i thought everyone was being too hard on him, then i fought him, i agree",
            "I beat him pre patch without cheesing.\n\nI wouldn’t wish that on my worst enemy.",
            "The only issue I have with it is, like some others boss  in the dlc : visual clarity.\n\nThere's so much lights and effects that I can be hard to decipher what's on the screen, had the same issue with mesmer and his hyper saturated flame effect.",
            "I liked the idea of fighting a healthy radahn 2 years ago, not anymore",
            "I'm so proud of this community for not glazing this shitty boss",
            "Literally the only problems I have with the fight are the double slash X combo and the visual clutter, didn't experience any significant lag.\n\nIf these get addressed he might be my second favorite souls boss after Gael."
        ]
    },
    "Fire Knights are probably harder than Nameless King": {
        "title": "Fire Knights are probably harder than Nameless King",
        "score": 266,
        "url": "https://i.redd.it/rf7bvb4iai9d1.jpeg",
        "content": "",
        "num_comments": 47,
        "comments": [
            "press r1 5 times with a weapon heavier then a spoon",
            "Fire knights can just be guard countered to death.",
            "Honestly they’re more annoying then difficult.",
            "You know what? I want to come out and say it… i used a strength build and used giant hammer and hammered him to death. I beat messmer this way and the dlc as well. Nameless king? Strength build. I have come to understand that since you are struggling with this fire knight you must be a dex build.",
            "The double dagger ones are exponentially more of a pain in the ass than any of the others, it's kind of ridiculous",
            "It's funny because, if Fire Knights are the enemy I'm thinking of, they have like 5-6k HP, while Pontiff Sullyvahn has 5106 HP, and the Pontiff hits less damage, so they're unironically harder than him, if there was a mod that puts them in DS3 and you replace the Pontiff with them it'd literally be harder",
            "Divine Beast Warriors:\"Thats cute Kid!",
            "swap fire knights with that upgrade version of berurrat knights in the end game legacy dungeon",
            "1, No they're not. Nameless King is an endurance fight, his move-set is simpler than it could be because Fromsoft expect the fight with him to take a long time and that's the major challenge. Learning his moveset isn't super difficult, learning to do it consistently without slipping up for 5-10 minutes is.\n\n2, Even if they were, Elden Ring makes a lot of the enemies 'bullshit' hard, rather than 'well-designed' hard.",
            "lmao, big stick go bonk and they can't move."
        ]
    }
}