{
    "For those wondering what the sub icon is.": {
        "title": "For those wondering what the sub icon is.",
        "score": 4409,
        "url": "https://i.redd.it/y2k0vkhk2gab1.jpg",
        "content": "",
        "num_comments": 144,
        "comments": [
            "Race tracks in the undies!",
            "What's the bj scene to the left tho?",
            "Ok - that's the worst I've seen.  \n\nEven worse than No Ragrats",
            "Imagine being the guy who’s tattoo is the logo for a community (comprising of half a million people) centered around bad tattoos",
            "This is genius in my opinion. Best way to incorporate a mole/birthmark into a tattoo that I’ve seen",
            "Deserving of the shittytattoos icon.",
            "Such a well ironed pair of tightly whities too.",
            "Can we just have a standing ovulation for this? Honestly, I think I might shed a tear.",
            "I thought everybody's undies had moles, freckles and birthmarks/beauty marks?",
            "Looks like a tiny soldier running"
        ]
    },
    "My brother got this gem a few months ago… didn’t see any issues": {
        "title": "My brother got this gem a few months ago… didn’t see any issues",
        "score": 164,
        "url": "https://i.redd.it/ncmwumj82h9d1.jpeg",
        "content": "He said it’s not finished, but I really don’t see how “finishing” it is going to fix any of the issues I’m looking at. For the record, he has plenty of other tattoos that are all well done. Not sure where his judgement went during this one",
        "num_comments": 53,
        "comments": [
            "Poor choice in the placement of her left hand.",
            "if it’s any solace he can still cover it up with a panther",
            "I find the legs fascinating.",
            "I hope \"finishing it\" means putting that other croc in sport mode.  Currently, it's an ankle injury waiting to happen",
            "I think he’s in denial and don’t wanna admit the artist he went to was bad",
            "Aside from it being awful I’ll never understand why people get naked people tattooed on them",
            "Does he realize that it looks like she’s holding her penis? Lol",
            "Who goes hiking in clogs though?",
            "I’m grateful we didn’t get a full frontal cause I feel it would have been so much worse given what was produced",
            "She just got a little scoliosis."
        ]
    },
    "At least the hair will grow and cover it? ": {
        "title": "At least the hair will grow and cover it? ",
        "score": 3422,
        "url": "https://www.reddit.com/gallery/1dqjrjq",
        "content": "Found in an FB group I’m in ",
        "num_comments": 69,
        "comments": [
            "The slash on one side of the head is bothering me the most",
            "oh I thought the pronouns were She/hair before I saw the second pic",
            "I thought the first one was a joke about the common slang pronunciation of hair being “hur,” since her hair is right next to the slash, making it “she/hur.”",
            "The ear cuffs aren't at all my sort of thing but they're well done here.... A real shame about the rest of it. Kinda feels like \"LEFT\" \"RIGHT\" tattoos on your hands",
            "The ear cuff goes hard (I want one lowkey) but the pronouns.. honey just wear a pin 😭",
            "I'm sure the comments here will be just about the tattoo and nothing else.",
            "having worked retail I know people are gonna look at her tattoos and misgender her anyway, she tattooed herself a bad time ):",
            "As someone who is also non-binary... why?",
            "pride ear cuffs go harddddd but oof the pronouns are ugly",
            "My coworker is a big fan of they/them so their car is a they/them, their water bottle says “just a they/them causing may/hem”, they have a they/them sticker on their shirt every day, and their cat is apparently also a they/them. So I wouldn’t be surprised if they got this tattoo or if this is actually them\n\n(Im not against they/them’s I just don’t know much about them and found this a little funny. Not trying to be offensive)"
        ]
    },
    "Shitty Ink Master Tattoos part 1": {
        "title": "Shitty Ink Master Tattoos part 1",
        "score": 119,
        "url": "https://www.reddit.com/gallery/1dr56dg",
        "content": "Professionals on TV should not do tattoos this bad",
        "num_comments": 47,
        "comments": [
            "Reality TV is a different beast than just pros on TV. Great post.",
            "I thought the sphinx had a lion's body and not a mole rat's",
            "Gotta be honest, I kinda dig that volcano head one. Pretty dope.",
            "I remember a lot of these! The face on #6 - just ghastly.",
            "I have always loved the freaky cat one. The guy was a terrible artist but even a broken clock is right twice a day.",
            "Man should not do faces",
            "anyone else kinda see a business suit and tie on the sphinx",
            "8 is actually pretty cool",
            "Imagine thinking you were gonna walk out with some amazing ink master tattoo and being butchered with a needle like this\n\nNgl I would be happy with the cat cause crazy shit is my jam",
            "Number 1 looks like Simon Cowell now that he’s had all that flawless plastic surgery."
        ]
    },
    "🤣🤣": {
        "title": "🤣🤣",
        "score": 275,
        "url": "https://i.redd.it/t3h5zrc6ue9d1.jpeg",
        "content": "",
        "num_comments": 36,
        "comments": [
            "“Only took 20 minutes”\n\nYeah we can fuckin tell",
            "Tattooing isn’t a speed race to the finish.",
            "thank god if someone actually spent their time on that I would feel bad",
            "Wrong form of \"everyday\" too.",
            "I kinda like this. Good motto. Speed left more time for living fully.",
            "The little almost swastika really ties it all together",
            "We can tell it only took 20.",
            "20 min of tattooing for a lifetime of  shittyness",
            "Of all the things to speed run, tattooing isn’t one",
            "Bro…. That’s gonna be a fuckin HUGE panther…."
        ]
    }
}