{
    "Release of Yawntrail: Changes to the sub": {
        "title": "Release of Yawntrail: Changes to the sub",
        "score": 194,
        "url": "https://www.reddit.com/r/ShitpostXIV/comments/1dogl4k/release_of_yawntrail_changes_to_the_sub/",
        "content": "Hi guys, gals, L~~alapals,~~\n\nthe servers will soon be shut down for maintenance work for DT. Since we all will have a forced break from ERP in the near future, I would like to give you some information about upcoming changes to the sub. Please look forward to it:\n\n# New subreddit banner\n\nThanks to the work of u/zztoluca, we now have a new sub reddit banner for Dawntrail. Drink verification can to get the png of it (or just [click here](https://imgur.com/a/FA40nuv))\n\nhttps://preview.redd.it/mch53v8unq8d1.png?width=1920&format=png&auto=webp&s=36aec6e4541ff138433cc66436bd13641a7517b5\n\n# New post flairs\n\nWe now have post flairs that you can use to indicate that your post contains spoilers for a specific expansion (e.g. Spoiler: A Realm Reborn). These flairs are, apart from the Spoiler: Dawntrail flair, *optional*. The \"Spoiler: Dawntrail\"-flair is **mandatory until August 6, 2024** for all posts with spoilers about MSQ, side quests, instanced content added in Dawntrail. We updated Rule 6 to reflect this rule change. We would also like to remind you that it is still mandatory for all posts containing spoilers to use Reddit's own spoiler flair.\n\n# New rule regarding nsfw reposts from other subs/websites\n\nLast week we asked you for your opinion on a possible restriction/ban of nsfw reposts. You can read the post here. We have evaluated the survey and the comments and have come to the conclusion that, although a majority is in favor of restrictions, this majority is only around 60%, so only a slight restriction of these posts will be made: **From July 5 inclusive, nsfw reposts may no longer be posted on Fridays and Saturdays.** This does not apply to posts that supplement the source material with their own content. In addition, exceptions may be made for individual posts. \n\nPlease contact us if you are unsure whether a planned post of yours violates the rule. We will monitor how this new rule affects the subcredit and make any necessary changes.\n\n  \n\n\nWow, so many changes! Definitely more than the core design of healers is changed in Dawntrail, amirite boyzz? \n\n  \nBye\n\nu/mad_lala\n\n\n\n\n\n",
        "num_comments": 50,
        "comments": [
            "SMH now the porn artists will have to track when they post to main sub",
            "Banner looks good... except it should read DWN TRL for consistency",
            "How am I supposed to wank to this?",
            "I hate everyone especially myself",
            "Literally the bite of '83",
            "ShitpostXIV's State of the Union address",
            "holy shit new banner, we fucking made it bros",
            "I DEMAND TWO DAYS COMPENSATION BECAUSE I HAVE A SMALL PENIS",
            "Dawnt Rail (Except On Fridays And Saturdays)",
            "Wait, there are rules and moderators here?, I thought ppl just drop random shit here"
        ]
    },
    "[MSQ SPOILERS] GOODBYE ENDWALKER, HELLO DAWNTRAIL": {
        "title": "[MSQ SPOILERS] GOODBYE ENDWALKER, HELLO DAWNTRAIL",
        "score": 1049,
        "url": "https://v.redd.it/co23y0ppur8d1",
        "content": "",
        "num_comments": 64,
        "comments": [
            "FIND YOUR CHEEKS AND SPREAD THEM WIDE",
            "What?? An actually good post on this subreddit? This is forbidden this is called r/ShitpostXIV and not r/goodpostXIV after all.\n\n(Your post is now the new stickied post)",
            "Why post this on the shitpost subreddit? This is really well done.",
            "A wholesome post on the shitpost sub. You love to see it. This is really well done. Here's to another 10 years of shitposting with you all.",
            "This is way too high quality for a shitpost.",
            "Damn, just a huge rush of memories. Is a nice video op!",
            "Stuff like this makes me cry :)",
            "OP this is so good \n\ndawntrail let's goooooooooooooooooo",
            "The walking with Matoya was fantastic",
            "Excellent post.  I fucking love this game, terrible changes and players included."
        ]
    },
    "Old animations working perfectly with graphical update": {
        "title": "Old animations working perfectly with graphical update",
        "score": 934,
        "url": "https://v.redd.it/ebe2qnrd6f9d1",
        "content": "",
        "num_comments": 51,
        "comments": [
            "Really enjoying my delicious pizza",
            "The spices on that pizza be hitting different but a good different.",
            "dont ever buy no pizza from solution 9 that shit got me fucked up",
            "A single drop of fantasia in every slice",
            "blud bite into a piece of lemon",
            "What do you mean, au ra are better now",
            "Damn that pizza must be good",
            "that's how you \\*know\\* it tastes gud",
            "I feel like I'm crazy but the graphical update has to be super minimal cause I feel like it looks exactly the same lol",
            "thats how you know that shit BUSSIN"
        ]
    },
    "Final Fantasy 14 Dawntrail: Amon Ultimate": {
        "title": "Final Fantasy 14 Dawntrail: Amon Ultimate",
        "score": 160,
        "url": "https://v.redd.it/evuj701gig9d1",
        "content": "",
        "num_comments": 15,
        "comments": [
            "So they only time CT has ever been challenging since launch and its because of an unavoidable wipe mechanic via a bug.\n\nThat's pretty funny but that sucks for 1st timers stuck on MSQ.",
            "Glad Yoshida's vision for more stress returning to XIV is living up to expectations",
            "Dan really came from beyond the grave and said \"nah, imma still get you back, a-holes\"",
            "You absolutely mad lad!! You actually posted, it was an honor playing alongside you as your tank",
            "Did the res cheese and killed him after 20mins of wipe, hard but fair boss encounter",
            "very sexy\n\nI wish my parties didn't disband every single time",
            "I don't know how they thought they could get away with reworking Deep Freeze without testing the effects that would have on old content that uses Deep Freeze.",
            "Damn, now people have to actually press their buttons there instead of sleeping through the raid while like 4 dudes carry everyone else",
            "How did this even happen",
            "It's not a bug, it's a filter feature."
        ]
    },
    "Okay, who let the Balmung players design gear?": {
        "title": "Okay, who let the Balmung players design gear?",
        "score": 183,
        "url": "https://i.redd.it/2si1kqr3za9d1.png",
        "content": "",
        "num_comments": 25,
        "comments": [
            "I can bet my overflowing glamour dresser that someone will get dragged to GM jail for using this outfit on portraits/adventure plate one way or another.",
            "At least it's not another set of robes",
            "As a Balmung native, I groaned so hard when I saw it. Mad Max gear is kinda legit, but I KNOW that shit is going to become a staple of the Quicksand folks.",
            "We've all known yoshi p frequents balmung",
            "Did they really just created gimp suits for dawntrail",
            "The box! You opened it, we came!",
            "they gotta give the rpers a reason to play the game.",
            "Now we know yoshi-p's final fantasy",
            "Wait, its casting? Awwwwwwww man",
            "Hey buddy, I think you got the wrong door. The leather club is two blocks down."
        ]
    }
}