{
    "which game from my wishlist?": {
        "title": "which game from my wishlist?",
        "score": 18,
        "url": "https://www.reddit.com/r/ShouldIbuythisgame/comments/1dr5ukv/which_game_from_my_wishlist/",
        "content": "i can't decide between some games from my wishlist. which one should i definitely play first?\n\n- far cry 3\n- the Witcher 3: wild hunt\n- resident evil 7 biohazard\n- mad father\n- disco elysum - the final cut\n- omori\n- red dead redemption 2\n- corpse party (2021)\n\nThey're all on sale at the moment. I'm into horror/rpg and gameplays like horizon, the evil within, rise of the tomb raider, etc...",
        "num_comments": 26,
        "comments": [
            "Far Cry 3 and RDR2",
            "Of  these my favorite is disco elysium.\n\nBut personally i love the whole questioning reality, understanding philosophy angle in literature in general. One of my favorite games, bioshock is also on similar lines",
            "The Witcher 3 or Red Dead Redemption 2",
            "I started Far Cry 3 a couple of days ago. Just as fun as when it was released, for me",
            "far cry 3 and the witcher 3",
            "Far cry 3 is the best far cry in the series",
            "Rdr2 is a n experience to remember, it's immersive graphically excellent, great story. I've got easily 7 or 800 hours in it and enjoyed every one.",
            "i think youll like omori ",
            "My pick would be Disco Elysium but it’s weird as fuck and not your standard videogame. FarCry 3 if you’re looking for a fun, if slightly dated action game. Red Dead 2 if you’re not into playing your games but really love watching a man slowly wither and die.",
            "Far Cry 3. Then Resident Evil Biohazard"
        ]
    },
    "Quick Report Dopamine hits": {
        "title": "Quick Report Dopamine hits",
        "score": 10,
        "url": "https://www.reddit.com/r/ShouldIbuythisgame/comments/1dr4dya/quick_report_dopamine_hits/",
        "content": "Hi guys, I’m looking for quick to pick up rather fast games that gives you a kind of instant gratification and dopamine hits. I don’t have much time for gaming anymore and I found it hard to get into games that take longer time spans to master and to achieve something in I’ve recently played Balatro and this was for a time one of those games that I mean. It can be any kind of genre actually as I find myself playing apex legends for over 600 hours over the years. \n\nI was really looking forward to the Elden Ring DLC but I find that it takes too much time for me to explore everything and get good at the game again so this doesn’t bring me any joy at the moment. \n\nThanks for your help \n",
        "num_comments": 9,
        "comments": [
            "Check out Death Must Die\n\nIts cheap, awesome, and you can just go enjoy a run of it for 15-30 min and feel fulfilled with what you got out of it, imho.",
            "Evil West is really good and easy to pick up",
            "If you like FPS games I can suggest Severed steel. It has some really satisfying movement. You can dive, slide, do a 360 backflip etc. It also has no reloading and therefore you have to always steal guns from enemies, which puts your movement to test. If it isn't your thing, you can always check out boomer shooters. They're fast paced and fun to play in general.",
            "Hades. Extremely fun and addicting and easy to just pick up and play for like 20 minutes or even less if you want to.",
            "Didn’t like it. Too hard to read in the heat of battle for me. Too many effects going on 😅",
            "Movement shooters are where it's at, the dopamine hit is unlike anything else.\n\nImma list some of my favorites:\n\n\nULTRAKILL\n\nTitanfall 2 \n\nReaver\n\nSevered steel\n\nEcho Point Nova (still only a demo but fun asf)\n\nGhostrunner\n\nGet To The Orange Door\n\nDoom Eternal\n\nIf I had to pick one, I'd definitely say ULTRAKILL or Titanfall 2 (especially since you mentioned liking Apex)",
            "You might like some of the Survivors style games, popularized by Vampire Survivors.\n\nI have personally enjoyed these ones:\n\nVampire Survivors\n\nArmy of Ruin\n\nHalls of Torment\n\nYet Another Zombie Survivors\n\nSoulstone Survivors\n\nSpellbook Demonslayers (crude graphics, but a surprising amount of depth in builds)",
            "Ketsui or Rayforce",
            "That’s very fair tbh"
        ]
    },
    "Bloodborne or Sekiro?": {
        "title": "Bloodborne or Sekiro?",
        "score": 7,
        "url": "https://www.reddit.com/r/ShouldIbuythisgame/comments/1dr479g/bloodborne_or_sekiro/",
        "content": "I recently bought and platinum’d Elden Ring. I finished the DLC a few days ago and I love it so much. \n\nI am going to be taking a 2 week vacation and in that time also not game. \n\nWhen I come back though, I thought about buying numerous games but for some reason the thought of playing a game that isn’t like a souls game just doesn’t seem interesting at all to me at the moment. \n\nSo I have been looking into Fromsoftware’s other games, and have decided that I want to try one of their bigger challenges. I am not too keen on any of the Dark Souls at the moment, so Bloodborne and Sekiro are the 2 options I am choosing from. \n\nWhich should I play first? I don’t really have a preference for a specific setting or aesthetic at the moment.",
        "num_comments": 24,
        "comments": [
            "Sekiro is in my top 5 of all time list, and my favorite FromSoft game easily. It is I think the most rewarding also, in that it is very much the most 'skill based'  -  no opportunity for summons, AoW, spirit ashes or cheesy builds. (nothing wrong with any of that, but sometimes it can trivialise fights)",
            "Both are amazing. Prolly do bloodborne first as it plays closer to elden ring, then do sekiro after",
            "Very Hard to tell. Both are awesome, both have incredible aesthetics and gameplay. Though I like BB setting and story more I’d go for Sekiro simply because it’s newer, meaning it has better performance and many QoL things that can make BB a chore sometimes (like generating health drinks, grappling hook general interface). Be aware that Sekiro has you limited to only your katana as a main weapon but you do get tools which kinda act like secondary weapons. No looking for a weapons in Sekiro…",
            "My appreciation for other from softgames' combat lowered a bit after Sekiro so I would personally pick Bloodborne first. It's also easier to go from slower to faster than vice versa",
            "Imo bloodborne is overrated and runs like shit, Sekiro is the best game I have ever played surpassing Elden Ring",
            "Bloodborne is less of a challenge I'd say if you seek that. But it has the best drip, weapons, lore and atmosphere. Sekiro is too good gameplay-wise. Definitely play both.",
            "Can’t go wrong with either. Pick one you’re interested in and simply play it",
            "Well the question comes down to do you want to focus on deflecting strikes or dodging them? \n\nBoth games are great and worth it.",
            "Bloodborne by far for me. Just a mire widely likable game. Sekiro can be extremely frustrating if the combat doesn't click for you.",
            "Bloodborne looks its age and runs poorly, wasn't impressed with it at all"
        ]
    },
    "Which game Should i buy on my steam wishlist? ": {
        "title": "Which game Should i buy on my steam wishlist? ",
        "score": 2,
        "url": "https://www.reddit.com/r/ShouldIbuythisgame/comments/1dram9x/which_game_should_i_buy_on_my_steam_wishlist/",
        "content": "I just want a game that can run on low end pc.\n\n*Just Cause 2\n*Postal 2\n*Half-Life 2\n*Batman Arkham knight\n*Sleeping dog definitive edition\n*The Witcher 3 wild hunt\n*Just die already\n*Ben and ed\n\nI want a game that is open world with good story and music, fun, can play for an hour, and you guys can recommend me some games too for my low end pc",
        "num_comments": 4,
        "comments": [
            "I have spent many, many hours playing *Just Cause 2*. It's so satisfying to blow things up all over the giant map.",
            "I'd go for the Portal bundle. Portal 2 is obviously more fleshed out but the bundle is so cheap and it's fun to experience both. Portal 2 also has community maps & coop multiplayer",
            "Arkham knight",
            "Sleeping Dogs at three dollars is a steal.  \n\nJust Cause 2 is also good if you can get on its wavelength, and if not it's kind of boring.  If destroying things in creative ways without much of a story behind it sounds appealing go for it.\n\nAs for a recommendation: have you ever tried the Shadowrun trilogy?  They are tactical RPGs that are story driven, but give you a lot of freedom regarding how you want to play.  They aren't perfect and some of the choices they made annoy me (cyberdecks taking one of your weapon slots, for example) but they are definitely worth looking at.  \n[https://store.steampowered.com/bundle/26635/Shadowrun\\_Trilogy/](https://store.steampowered.com/bundle/26635/Shadowrun_Trilogy/)\n\nTower of Time is another good candidate from what you've said so far.  \n[https://store.steampowered.com/app/617480/Tower\\_of\\_Time/](https://store.steampowered.com/app/617480/Tower_of_Time/)"
        ]
    },
    "Can you guys suggest me a game? ": {
        "title": "Can you guys suggest me a game? ",
        "score": 2,
        "url": "https://www.reddit.com/r/ShouldIbuythisgame/comments/1drad8e/can_you_guys_suggest_me_a_game/",
        "content": "So the kind of game that I am finding is like a open world, modern day setting, can do crime, decent graphics, immersive gameplay, game that can be played again and again, \n\nThe game that I already played and fits in the above description are gta 5, gta 4 , gta sa, gta vc, watch dogs, watch dogs 2, cyberpunk 2077. I am finding something which I can buy and play without getting bored even after the end of story mode. Pls suggest ",
        "num_comments": 7,
        "comments": [
            "Teardown may be of interest to you. Lots of freedom and community mods",
            "Just cause 3, really cheap too",
            "Try skyrim , A/c series ,Fallout ,Far cry.\nYou can also try something like Elden Ring and Bloodborne ( ps only can be moded easily now )",
            "I had completed just cause 4. so not looking for similar kind of gameplay 😕",
            "Ah okay that's fair\n\nTbh I'd still recommend 3 it's much more based on the destruction and sandbox gameplay, and overall a much better game",
            "Sleeping dogs",
            "Saints row"
        ]
    }
}