{
    "You will never know how many sleepless nights others will have because of you.": {
        "title": "You will never know how many sleepless nights others will have because of you.",
        "score": 1130,
        "url": "https://www.reddit.com/r/Showerthoughts/comments/1dlm10j/you_will_never_know_how_many_sleepless_nights/",
        "content": "Whether worry for your wellbeing, friendship, longing, or anger, you don't know how much you influence others' thoughts.   \nMaybe the way you smiled just that that one time made them fall in love with you.  \nMaybe there was a very long night where you were in a dark place and none of your friends knew how to find you.   \nMaybe one of your friends noticed you entering a relationship that wasn't right for you and stayed up all night worrying.  \nMaybe when you fell ill, they wanted to be nearby, just in case.  \nMaybe they're desperately, desperately hoping that tomorrow's answer to The Question is \"Yes!\"  \nYou leave an imprint everywhere you go, and you'll never know the shape of it.\n\nBut I wonder - how many sleepless nights, and for whom, and why? ",
        "num_comments": 89,
        "comments": [
            "Interviewer: What keeps you awake at night?\n\nMattis: Nothing. I keep other people awake at night.",
            "I'm pretty sure no one is losing sleep over me, other than myself.",
            "I guarantee no one is losing sleep over me lol.",
            "That's the winner for longest shower thought.",
            "wow. funny coincidence im seeing this rn. yup.",
            "And it’s not always with a good perspective. Sometimes, we hurt people badly which takes their sleep away. Nonetheless nothing can be done to change it now.",
            "Take a magnesium supplement half an hour before bed.",
            "If someone is losing sleep over me, they need to stop and re-evaluate themselves",
            "This thought might keep me up tonight",
            "Quite true for sure, parents, loved ones and friends, this makes alot of sense"
        ]
    },
    "We'd all get a hell of a lot more done if humans had a natural mating season. ": {
        "title": "We'd all get a hell of a lot more done if humans had a natural mating season. ",
        "score": 8820,
        "url": "https://www.reddit.com/r/Showerthoughts/comments/1dl4uw5/wed_all_get_a_hell_of_a_lot_more_done_if_humans/",
        "content": "",
        "num_comments": 471,
        "comments": [
            "everyone's uninterested in sex most of the year except for two weeks annually when everyone gets horny and businesses and government offices and shops and supply and retail and infrastructure work all grind to a halt as everyone is too horny to work\n\nimagine that being the premise of a tv show",
            "Yeah but it would be The Purge every spring.",
            "But then we’d have an entire season where nothing got done, ever. “Sorry, dry cleaner’s closed, we’re all busy trying to have sex with everyone in the world before the leaves start changing colors.”",
            "Nah..look at the animals..i think we achieved this much because we are constantly horny",
            "It seems like [most birthdays ](https://images.app.goo.gl/F2Byz2grb4chUAyq8) are between July and September, so you could say winter is our natural mating season.",
            "From what I've experienced, this is traditionally called Nighttime.  We just have have too many mating seasons a year.",
            "Read *The Left Hand of Darkness* by Ursula Le Guin. It has a similar premise with the addition that all of the people on certain planet are genderless and asexual until the monthly breeding period where everyone gets a gender and fucks. Then they go back to normal and get shit done the rest of the month.",
            "\"For many of you, this will mean much less breeding. For me, much much more.\" Comic Book Guy",
            "Imagine hospitals in ~9 months after that.",
            "Hornieness is a major driving force behind most of the human Marvels"
        ]
    },
    "Despite the saying, most swords are double-edged and don’t normally hurt the wielder ": {
        "title": "Despite the saying, most swords are double-edged and don’t normally hurt the wielder ",
        "score": 411,
        "url": "https://www.reddit.com/r/Showerthoughts/comments/1dln6im/despite_the_saying_most_swords_are_doubleedged/",
        "content": "",
        "num_comments": 53,
        "comments": [
            "Well, aren’t you sharp?!?!",
            "Oh, I always thought the saying was referring to, like, two blades with a handle in the middle.",
            "This post is a bit of no handled, double tipped sword if you ask me.",
            "One time my coworker took this really thin slice of plywood and said \"if this was a double edged sword it would be called a *something japanese*, and you cannot Parry with these. The blade is too thin to parry a larger sword by itself. If it had been single edged, i could have placed my hand on the back of the blade to help withstand the impact, but with this i would just cut myself in the hand. Instead, i got to evade.\"\n\nHe handed me a larger piece of plywood, and says \"pretend this is a halbard and hit me\" so i think okay you fucking Kung Fu guy, lets see what you got. So i swing the halbard plywood straight for his knees.\n\nThis guy he makes a sideways flip, and while his head is upside down, mid flip, he made a very, very controlled mark on my neck with his double edged piece of plywood. I had a red line and everything, but no blood.\n\nThis guy was crazy good.",
            "I don’t know if it’s true that most swords are double edged, but it’s certainly true that *many* are not. Most notably swords like katanas, but plenty of European swords also had a blunt edge for a variety of reasons. \n\nThere are also plenty of downsides to double edged swords (more fragile, harder to maintain, can’t easily use a hand on the blade for extra leverage, etc), but it’s true that they’re not really more dangerous to their wielded than single edged swords, which the expression seems to metaphorically refer to, so your shower thought still works.",
            "Doesn't the phrase refer to a sword that cuts both when it goes in and when you pull it out?",
            "I was always confused about this. In what context would a sword, even a double edged one, be able to cut both the person I'm attacking AND myself?",
            "In the white light, a hand reaches through\n\nA double-edged blade cuts your heart in two\n\nWaking dreams fade away,\n\nEmbrace the brand-new day",
            "The saying doesnt refer to the wielder",
            "Not only that, at one point people used the blade to [thrust forward like a spear, or in some cases use the hilts as a pickaxe](https://en.m.wikipedia.org/wiki/Half-sword)\n\nYou have to think: With all this ironclad, and chainmail it would be *very* difficult to get any normal sword to pierce through by just hitting the breastplate on the broadside of the sword"
        ]
    },
    "Pretending to be rich is even more pathetic than actually being poor. ": {
        "title": "Pretending to be rich is even more pathetic than actually being poor. ",
        "score": 95,
        "url": "https://www.reddit.com/r/Showerthoughts/comments/1dlssf4/pretending_to_be_rich_is_even_more_pathetic_than/",
        "content": "Just thinking about all the people who appear worlds away from their actual living situation on Instagram. Embarassing.",
        "num_comments": 57,
        "comments": [
            "Being poor isn’t pathetic.",
            "They make money from it. Subscribers, donations. This is a earning strategy.",
            "The only thing pathetic I find in this thread is calling people worse off than you pathetic. Which is you. You're pathetic.",
            "Being poor isn’t pathetic",
            "Rich are trying to look poor while poor are trying to look rich.\nWhat an age we live in!",
            "How is being poor pathetic?",
            "I have an extended family member who made seven figures for several years. Their hubris was their downfall and lost that income stream and proceeded to blow it all on dumb get rich quick schemes and email scams (they fell for a Nigerian Prince Scam twice).\n\nToday they have the IRS coming after them and they are still trying to grift their dollar any way they can. But what is wild? They still live a life of luxury. Once you are in that category of rich, your rich acquaintances will let you borrow their boat to Cabo or their yacht in the Mediterranean or that lake house in Tahoe and it doesn't cost them a dime. So weird.",
            "Imagine giving a toss what people on Instagram can or cannot afford, embarrassing. Touch grass OP",
            "What's pretending?  How do you know the person you are glaring at is living beyond their means?",
            "You basically described my cousin. Dude works odd jobs as a painter, but acts like he’s got a lot of money spending everything on clothes and drives a car that was expensive before someone put over 200.000 km on it."
        ]
    },
    "Everyone's dad masturbated the exact right amount of times for you to be born. One more or one less before your conception and you wouldn't exist.": {
        "title": "Everyone's dad masturbated the exact right amount of times for you to be born. One more or one less before your conception and you wouldn't exist.",
        "score": 57,
        "url": "https://www.reddit.com/r/Showerthoughts/comments/1dlu6bg/everyones_dad_masturbated_the_exact_right_amount/",
        "content": "",
        "num_comments": 44,
        "comments": [
            "Mine couldn't figure out how to masturbate.",
            "That's not how that works",
            "Do you think sperm is stored for years if you dont masturbate? How many time they did it in their life in irrelevant",
            "Everyones dads dad too ad infinitum.",
            "Am I to avenge my fallen siblings?",
            "Not just masturbation. Your dad also had to have the right amount of luck with the ladies. I wonder who I’d be if my pops wasn’t such a dork.",
            "Actually this is false. Sperm stays in the body for like 70-75 days then it is reabsorbed",
            "My old man had an ingrown ball hair and I hung on to that root, clinging to the sides of his balls for weeks waiting for my shot.",
            "Would you know it wasn't you? Or would you experience you, just as a different person?",
            "Why does everyone think they’re the sperm when the majority of your organic material is from the egg?"
        ]
    }
}