{
    "We asked, you told us, and we listened: Welcome to /r/Showerthoughts 2.0!": {
        "title": "We asked, you told us, and we listened: Welcome to /r/Showerthoughts 2.0!",
        "score": 381,
        "url": "https://www.reddit.com/r/Showerthoughts/comments/1do3rkx/we_asked_you_told_us_and_we_listened_welcome_to/",
        "content": "Hello again, folks!\n\nLast week, we [asked for your input](https://redd.it/1djiftx) on how to improve /r/Showerthoughts. There were quite a few great answers, and a handful of requests were repeated several times over. Those requests were as follows:\n \n\\- Make it easier to post      \n\\- Cut down on karma-farming     \n\\- Require higher-quality posts      \n\\- Allow a greater variety of posts\n\nAs you may have noticed, half of these requests seem to contradict the other half: If it's easier to post, or if we allow a greater variety of posts, there will be more karma-farming and a greater number of low-quality submissions by default. On the other hand, if every post is required to be a high-quality and unique showerthought, the amount karma-farming will certainly be reduced, but the difficulty of posting will only increase.\n\nStill, where there's a will, there's a way... and we think that we’ve come up with one.\n\n**/r/Showerthoughts will soon feature four different post-types.**\n\nThese will be as follows:\n\n------\n\n**Showerthoughts** will be what they always were (or were supposed to be)— miniature epiphanies that make the mundane more amazing. They'll be original, they'll be unique, they'll be of exceptional quality, and they'll be exemplars of the subreddit.\n\n**Musings** will be very similar to showerthoughts, but they'll only need to be original, not unique. Basically, if you came up with a high-quality thought by yourself, you'll be able to post it, and it won't matter if a similar thought was expressed by a user of a niche forum in 1993. You'll still need to proofread your musings and ensure that they're rule-abiding, but you won't have to worry if each one is the very first of its kind.\n\n**Speculations** will be \"What if?\" premises, contemplations of things that can't be verified or falsified (like \"How does Tobias Fünke poop?\"), and thoughts on events that are *probable* but not necessarily true *yet* (like \"As AI-generated videos get better, people will almost certainly use them for next-level catfishing.\"). Speculations will still need to be thought-provoking, interesting, and likely to prompt discussion – we won't accept \"I might see a sparrow today,\" for instance – but those of you who asked for questions and \"I wonder...\" statements to be allowed will have a place for them now.\n\n**Casual thoughts** will be posts that feature original but more-common conclusions, including those thoughts that currently get removed as \"personal perspectives.\" As long as a given thought was offered with a modicum of effort and isn't in our list of done-to-death submissions (which we'll discuss in a moment), it will be allowed. This variety of post is going to be experimental, so expect it to be adjusted as time goes on.\n\n------\n\n**The Flair-System**\n\nWhen creating a new post in /r/Showerthoughts, users will select one of the above-listed flairs, then receive a prompt which encourages them to read the rules. After they've responded to that prompt, the user's post will be approved. **There will be no more question-tree**, and there will be no more \"You have violated some vaguely defined portion of the rules.\" Ideally, folks will have a much easier time understanding how and what they should be posting, and posting itself will be a smoother process.\n\nFollowing from that, something else which was suggested was a limit on the number of posts that any one individual can offer. We're going to give that a try, starting with allowing **one post per person per seventy-two-hour period**. (Only posts will have a limit, though, not comments.) Like other things, this rule may end up getting adjusted, and we'll be watching to see how it affects the community.\n\nFinally – and as alluded to in the \"casual thoughts\" section – quite a few people expressed frustration with the number of low-effort, done-to-death, and low-quality posts and comments in the community. In order to cut down on those, **we'll be condensing our fourth, fifth, sixth, seventh, and eighth rules into one catch-all rule**, and we'll be explicitly forbidding certain posts (like \"The brain named itself\") and post-formats (like \"X was Y years ago\"). Comments like those that should be silent votes (such as \"Great post!\" or \"LOL, upvoted!\") will also be forbidden, partially because they add a lot of disruptive noise, and partially because they're often offered by spammers.\n\n------\n\nThere will be a few other (smaller) changes made, too, but most of those will happen behind the scenes... and besides, this announcement is already long enough that most people will have started skimming by now. If you're one of the few individuals who is reading every word, respond to this post by discussing the virtues of having radioactive lobsters run the subreddit. The rest of this paragraph will obscure that suggestion. **Watch for future announcements as we work on details, and please don't hesitate to reach out if you see something that might require our attention.**\n\nThe rollout will take place over the next few days, but for now, let us just say this:\n\n**Welcome to /r/Showerthoughts 2.0!**\n\nWe're pleased to have you here... and happy thinking!",
        "num_comments": 64,
        "comments": [
            "LOL, upvoted! (Jk, I bow before our radioactive lobster overlords).",
            "To be fair, I skimmed, then I saw comments about radioactive lobsters, and went back looking for that. So I guess it worked. Good job there.",
            "These proposals sound promising. Let's see how they pan out. If it makes it worse that will be the time to introduce the lobsters, although how easily can they type?",
            "Why does there need to be such an unusual amount of control over content? It's just Reddit. \n\nI've tried to post and been repeatedly declined for the most anal reasons possible, and I'm just not going to even attempt to post from now on. It's no fun when you have to obey a million rules.",
            "Just a thank you to the mods who give their time to make reddit one of the last enjoyable social media options.\n\nBut no lobsters, it is all about Maryland crabs in my small world. BTW  Italians can send extras across the Atlantic!",
            "Would these lobsters need some kind of lobster-to-English translation device, and if so, could this be the one positive use of generative AI?",
            "Nice to see a moderating group that is actively listening to its community and trying to make changes for the better. I hope this works out. (And I really hope it helps avoid the dozens of infinite universes means infinite X! posts.)\n\nJust how radioactive of lobsters are we talking here? Banana radioactive or Chernobyl radioactive? Maybe neutron star? Boy, that would be kinda terrifying. Though I wonder if that would make for an interesting dinner. Say, if the mods end up going the way of Louis XVI, can we have a boil?",
            "I, for one, wholeheartedly accept our radioactive lobster overlords.",
            "I think radioactive lobsters have the potential to bring on new, innovative perspectives that us mortals cannot imagine, thus resulting in more novel shower thoughts. I nominate Larry the Lobster as our new overlord.\n\nI like this structure by the way.",
            "Im glad that were going to get less thinly veiled both-sidesism political posts. Thanks."
        ]
    },
    "Why don’t home bathrooms have urinals?": {
        "title": "Why don’t home bathrooms have urinals?",
        "score": 2184,
        "url": "https://www.reddit.com/r/Showerthoughts/comments/1dqyvny/why_dont_home_bathrooms_have_urinals/",
        "content": "",
        "num_comments": 813,
        "comments": [
            "My uncle and his neighborhood buddies helped put a commercial urinal in his garage. Man, he loved that garage.",
            "Urinals are more common in public restrooms for efficiency, while home bathrooms typically use toilets, which are versatile for family use.",
            "Anything is an urinal if you are drunk enough.",
            "I guarantee some mischievous five year old will poop in it.",
            "Urinals are toilets but made for only peeing. Turns out, it's really expensive to install multiple unnecessary pipes that leads to our sewer systems so instead we just use our toilets for peeing and pooping instead of having it as separate devices.",
            "Have seen a house where a gay couple threw lots of parties. A urinal was a necessity.",
            "Expense. You could have one if you want, but that is a whole extra drain, water supply line, and vent, plus the cost of the urinal itself. Plus, you would have a lot more cleaning to do.\n\nIt is pretty space efficient when you need to service lots of people. In a house, you don't really need to fix the maximum number of pee-recepticals in a small space.",
            "I worked for a rich guy who has his own bathroom, steam shower, tub and urinal. Heated floors, too. It was sick.",
            "Are you too good to pee in the sink?",
            "Because I like to sit and pee so I can reply to this post. Good luck doing that while standing up and peeing."
        ]
    },
    "Things would be a lot different if our skin wasn’t waterproof.": {
        "title": "Things would be a lot different if our skin wasn’t waterproof.",
        "score": 1023,
        "url": "https://www.reddit.com/r/Showerthoughts/comments/1dr25yg/things_would_be_a_lot_different_if_our_skin_wasnt/",
        "content": "",
        "num_comments": 77,
        "comments": [
            "It would pretty much rule out shower thoughts, thats for sure.",
            "While it's already been said that we're not waterproof, I will give you that things would be incredibly different if our butt holes weren't as good as they are at keeping water out.  Swimming would be.... untenable.",
            "Your skin *isnt* waterproof. Its water *resistant*. You can absorb small amounts of water through your skin. If it was completely waterproof, then things like nicotine patches or topical ointments would not work.",
            "The human skin is indeed not waterproof mate.",
            "I don't think you understand what waterproof means.",
            "Things would be different if we had hands...\n\nOur skin is not waterproof...",
            "We would have disposable clothes because fabrics we wear today would be soaked from our bodily fluids.",
            "If our skin weren't waterproof, SOMETHING would have to be waterproof. This is because we live on Earth and we're descended from fish. Either our skin would excrete a lot of oil or we'd have a layer of waterproof fur or something.",
            "Well wed be dead, so that would be different.",
            "Rain would basically be public enemy number one. And swimming? Forget about it. We'd all have to be like cats around water!"
        ]
    },
    "The most mortifying moment in your entire life is likely just a minor footnote in the lives of everyone who witnessed it.": {
        "title": "The most mortifying moment in your entire life is likely just a minor footnote in the lives of everyone who witnessed it.",
        "score": 1588,
        "url": "https://www.reddit.com/r/Showerthoughts/comments/1dqxfyd/the_most_mortifying_moment_in_your_entire_life_is/",
        "content": "",
        "num_comments": 98,
        "comments": [
            "Ripped a huge fart in 7th grade on a plastic seat.  Stopped the class dead. Yeah, I'm still sweating that one.",
            "Decades ago when I was in college, I saw a guy get to the front and an insanely long line for coffee and then drop it ten steps from the counter. \n\nHe looked so sad and embarrassed. I think about him often",
            "I once watered to fake plant for three months before realizing it was fake. This happened 15 years ago and it is still discussed at family events. It will still be discussed long after Im dead.",
            "Thats comforting to think about",
            "These little reminders are always nice.",
            "Nope. Its an epic bar story told with delight over and over adding embellishments over the years. Sorry, mortified Redditor. It lives on like a zombie.",
            "I remember the kid who ate paste. Full name and all. Literally like 45 years ago.",
            "This makes me think of a quote from, if I recall correctly, *Street Fighter* where Raul Julia, as M. Bison says \"For you, the day that Bison grabbed your village was the most important day of your life. But for me, it was Tuesday.\"\n\nFor context, he's talking to Chun Li whose father died when he came to her town.",
            "Yeah youre right. Thanks for the reminder that for 90% of us nothing we do is noticed or remembered",
            "I read this wrong and thought it said that your entire life is just a footnote in the lives of most who witnessed it, which is a LOT more depressing"
        ]
    },
    "If cow milk tastes different depending on the breed, does that mean breastmilk tastes different depending on the person?": {
        "title": "If cow milk tastes different depending on the breed, does that mean breastmilk tastes different depending on the person?",
        "score": 3602,
        "url": "https://www.reddit.com/r/Showerthoughts/comments/1dqp24i/if_cow_milk_tastes_different_depending_on_the/",
        "content": "",
        "num_comments": 406,
        "comments": [
            "Considering our bodily secretions change flavor depending on what we eat, probably.",
            "Ive heard that it changes even depending on what mom eats, but I havent exactly tested that theory",
            "Our son would throw a fit if my wife ate marinara sauce. So, there seems to be something to the idea.",
            "Semen taste varies from person to person, so I can't imagine breastmilk doesn't.",
            "My sister showed me bags of her breastmilk, they have a different color and consistency depending on the time of day she pumps. Morning is yellower and creamier, afternoon is thinner and bluer",
            "Yes, can confirm. No further questions.",
            "Yes it does. I tasted it from both of my kids moms and it was definitely different",
            "It has the same general taste but varies in the sweetness/bitterness between women. Medication can also drastically change the taste for a little bit. \n\nAnd yes, I have actually tried a couple different womens milk, mainly bc I would suck on my exs(babys mother) boobs while she was pregnant, and then my gf after her that had her own kid was having an issue with her breasts filling up and getting painful so I would alleviate the pressure for her.",
            "The milk's compositioni and taste will vary week to week even for one woman, let alone having multiple women. For example the protein lipase varies so much woman to woman that some women can't freeze their breast milk without it making the milk smell really bad.",
            "We need Homelander to investigate."
        ]
    }
}