{
    "A real side hustle that became my main source of income ": {
        "title": "A real side hustle that became my main source of income ",
        "score": 217,
        "url": "https://www.reddit.com/r/sidehustle/comments/1dqx8bb/a_real_side_hustle_that_became_my_main_source_of/",
        "content": "So I was looking for a side hustle to help combat inflation and super high expenses. I generally started with trading I sold my car for 20k and bought a 10k car and had 10k in cash. Looking at a bunch of instagram reels and what not. I got into a trading group. I initially made money in the start account went to 11,500 suddenly in a month it went to 7,000$. I knew I had to stop because i was sold on a dream. I got a better paying job after graduating college and was able to steady out. I started getting into cooking and was introduced to wagyu on YouTube. I initially got an Australian wagyu steak and paid 110$ for a 16oz steak and then a5 was 150-180 a lb. I knew that these markups were insane because in the country where these meats are originated it’s 60% cheaper. That’s where I got a side hustle idea where i started buying in bulk and selling it locally at 40$ a steak for Australian and 75$ for Japanese wagyu + 60$ shipping. The end user saves about 35% so I ended up getting a lot of clients where I started to sell around 30 packs a week which equaled to 1800 a week. Thankfully we got a couple restaurant contracts and more clients where we are doing roughly 60 packs of steak a week and 150 pounds of wholesale to restaurants. I was able to quit my job and hire 2 additional workers.",
        "num_comments": 32,
        "comments": [
            "This is awesome! So you basically went direct overseas and purchase at large quantities? How/where did you get your first local sale? Id love to learn more!",
            "Dude created 10 more competitors with this post ",
            "Can I buy some steaks? ;) Also in LA area.",
            "How much/how large are your bulk orders with ur suppliers?",
            "What does this sound like a scam?",
            "Theres a dude I folllow on instagram that does the same shit, his is called thewagyuwindow.",
            "how are you managing to purchase at better wholesale prices than big competitors?",
            "Do you have a site? How can I purchase them from you?",
            "What are your importation costs? How is the supply chain constructed?",
            "I went to Australia and Japan and got connected with the farms"
        ]
    },
    "Mowing lawns as a 34 year old. Weird? Acceptable? Creepy? 😢": {
        "title": "Mowing lawns as a 34 year old. Weird? Acceptable? Creepy? 😢",
        "score": 85,
        "url": "https://www.reddit.com/r/sidehustle/comments/1dqzy3r/mowing_lawns_as_a_34_year_old_weird_acceptable/",
        "content": "2ND EDIT: Thank you so for the responses and being so kind! I was seriously worried I would get dog piled. Idk, some subreddits are kinder than others and I never know what to expect lol.\n\nI'M GOING TO BED I CAN'T RESPOND TO ANYMORE MOST LIKELY BUT SERIOUSLY THANK YOU! Maybe I'll post an update if this ends up working.\n\nEDIT: well shit I didn't think I'd get 40+ replies thanks everyone! \n\nTo address why I asked mainly; a lot of people are saying older people in companies do this. I'm an INDIVIDUAL, and NOT a company. That's why I was like hmmm...\n\nI just want to print out nicely designed business cards to tape to people's doors in my immediate neighborhood so I can easily get to them, and maybe 1 neighborhood over. This is so I can just walk with my mower, bags, and a cart to haul off clippings. \n\nIs this weird to do at my age? I'm working part time and could use extra cash with something I can pick my hours for. \n\nWould it be more professional if I used my van to take the mower and clippings? I just don't really want to dick with getting it in and out of the van. I'm strong enough but I'm 5'5\" and my little arms make it hard to move awkward shaped stuff that's not small lol.\n\nMy friends were suggesting $35 per lawn since I'm providing equipment and removal. \n\nI'm a graphic designer so at least I can make nice business cards to catch their attention 😂 Thanks if you have input! ",
        "num_comments": 199,
        "comments": [
            "Not weird...  just make it happen!!",
            "My grandpa said a man has to do what a man has to do.",
            "Honest work is honest work. Screw what people think",
            "If you get a small trailer for equipment and trimmings you're just as legitimate as half the guys out there.",
            "Solid hustle - go for it!",
            "Go for it! Some people think everything is weird/creepy, Some appreciate the hard-working attitude. Do what you can do and don't worry about other m'fers. Live your life, let them live theirs.",
            "My dad started doing lawns as a small business after he retired and it grew into an actual business with employees, so naw youre not going to creep anyone out at 34 lol. Im a year younger than you and Id hire a 34 year old to cut my lawn if I actually had one.",
            "If I had one of your cards on my door the last thing I would think is how old is this person. Id be thinking fuck yeah Ill pay you $35 to cut my lawn cuz Im a lazy sack of shit  go for it!!",
            "Well Im 43 and do lawn care and mowing for a side hustle.   I like the extra couple hundred I get in cash every other week.  I think youll be all right.",
            "Lawn care as a 34 year old. Just market it differently. Plenty of older lawn care guys."
        ]
    },
    "I have 3+ months to learn and implement a side hustle": {
        "title": "I have 3+ months to learn and implement a side hustle",
        "score": 4,
        "url": "https://www.reddit.com/r/sidehustle/comments/1dr9s5d/i_have_3_months_to_learn_and_implement_a_side/",
        "content": "Background: My work contract ends at the end of September. Me and my husband have decided that it would be good that I stay home a bit and work on what I want. We are both supporters of starting side hustles and having multiple streams of income.\n\nMe: 23, F, Speaks Arabic, English and German fluently. I'm good at writing, I'm good at studying and I enjoy doing small things with my hands. Such as building or making creating something. I'm good at painting but it takes me way too long to finish a drawing. I'm not physically fit and I won't have access to a car. I have a laptop with multiple screens.\n\nI have two blogs. I'll mostly be working on building those. One is about reviewing books and the other is an advice bog for people in their 20s. These are more like hobbies but I'll try to monetize it next year after it gets popular.\n\nI am doing print on demand on etsy but it doesn't feel like it will work for me. I need a new thing. This has become insanely popular and it feels like a fish competing with sharks\n\nThis is the first time I will have a couple of months off. I'm a good learner and I want to learn a new skill to implement a side hustle that generates a passive income when I go back to work. It should cost less than 500 dollars to learn and implement. I would love for it to be purely online. Nothing sexual.\n\n  \nAny ideas?",
        "num_comments": 1,
        "comments": [
            "Translator for courts"
        ]
    },
    "How do you balance your time and energy between your main job and your side hustle?": {
        "title": "How do you balance your time and energy between your main job and your side hustle?",
        "score": 1,
        "url": "https://www.reddit.com/r/sidehustle/comments/1drcjzy/how_do_you_balance_your_time_and_energy_between/",
        "content": "I'm 37 working multiple jobs so I can plan my retirement properly. But day by day, I'm getting tired and I don't know now how to manage my time between my main job and my side gigs.",
        "num_comments": 0,
        "comments": []
    },
    "Sidehustles for someone studying software development?": {
        "title": "Sidehustles for someone studying software development?",
        "score": 1,
        "url": "https://www.reddit.com/r/sidehustle/comments/1drc86p/sidehustles_for_someone_studying_software/",
        "content": "So here's my situation:\n\nI'm currently in education to become a software developer. The problem is: I make only 600$ a month doing that and this IN SWITZERLAND, one of the most expensive countries on this planet. What's important for the side hustle is not really having to talk to people because of a strong social anxiety. I already stutter just when talking to a receptionist or cashier, so no way I'm able to talk to customers lmao.\n\nI researched a bit but haven't found anything useful yet. \n\n* Freelance? Nobody buys anything without having any ratings yet. \n* Building a website/app? A big time investment without knowing if it will take off. Also I need money right now\n\nWhat I've done recently is Data Annotation for 40$ an hour but oftentimes there aren't any good tasks while I'm online. Also when there are, it takes a lot of creativity so I can't do it for long. What I also tried is automating those shitty reddit story + minecraft gameplay TikTok videos but that also hasn't took off...\n\nAny ideas?",
        "num_comments": 0,
        "comments": []
    }
}