{
    "A real side hustle that became my main source of income ": {
        "title": "A real side hustle that became my main source of income ",
        "score": 143,
        "url": "https://www.reddit.com/r/sidehustle/comments/1dqx8bb/a_real_side_hustle_that_became_my_main_source_of/",
        "content": "So I was looking for a side hustle to help combat inflation and super high expenses. I generally started with trading I sold my car for 20k and bought a 10k car and had 10k in cash. Looking at a bunch of instagram reels and what not. I got into a trading group. I initially made money in the start account went to 11,500 suddenly in a month it went to 7,000$. I knew I had to stop because i was sold on a dream. I got a better paying job after graduating college and was able to steady out. I started getting into cooking and was introduced to wagyu on YouTube. I initially got an Australian wagyu steak and paid 110$ for a 16oz steak and then a5 was 150-180 a lb. I knew that these markups were insane because in the country where these meats are originated it’s 60% cheaper. That’s where I got a side hustle idea where i started buying in bulk and selling it locally at 40$ a steak for Australian and 75$ for Japanese wagyu + 60$ shipping. The end user saves about 35% so I ended up getting a lot of clients where I started to sell around 30 packs a week which equaled to 1800 a week. Thankfully we got a couple restaurant contracts and more clients where we are doing roughly 60 packs of steak a week and 150 pounds of wholesale to restaurants. I was able to quit my job and hire 2 additional workers.",
        "num_comments": 24,
        "comments": [
            "This is awesome! So you basically went direct overseas and purchase at large quantities? How/where did you get your first local sale? I’d love to learn more!",
            "Can I buy some steaks? ;) Also in LA area.",
            "How much/how large are your bulk orders with ur suppliers?",
            "Very impressive. Congratulations",
            "Where are you located?",
            "What are your importation costs? How is the supply chain constructed?",
            "I got my first few local sale through instagram from friends and family but then I went to my local churches and promoted it. Churches are honestly the best way since they love supporting one another.",
            "I went to Australia and Japan and got connected with the farms",
            "I started with 2 full boxes which comes with 90-120 pounds",
            "My fastest seller was Australian wagyu beef bacon since competition is selling for 35+"
        ]
    },
    "Mowing lawns as a 34 year old. Weird? Acceptable? Creepy? 😢": {
        "title": "Mowing lawns as a 34 year old. Weird? Acceptable? Creepy? 😢",
        "score": 60,
        "url": "https://www.reddit.com/r/sidehustle/comments/1dqzy3r/mowing_lawns_as_a_34_year_old_weird_acceptable/",
        "content": "2ND EDIT: Thank you so for the responses and being so kind! I was seriously worried I would get dog piled. Idk, some subreddits are kinder than others and I never know what to expect lol.\n\nI'M GOING TO BED I CAN'T RESPOND TO ANYMORE MOST LIKELY BUT SERIOUSLY THANK YOU! Maybe I'll post an update if this ends up working.\n\nEDIT: well shit I didn't think I'd get 40+ replies thanks everyone! \n\nTo address why I asked mainly; a lot of people are saying older people in companies do this. I'm an INDIVIDUAL, and NOT a company. That's why I was like hmmm...\n\nI just want to print out nicely designed business cards to tape to people's doors in my immediate neighborhood so I can easily get to them, and maybe 1 neighborhood over. This is so I can just walk with my mower, bags, and a cart to haul off clippings. \n\nIs this weird to do at my age? I'm working part time and could use extra cash with something I can pick my hours for. \n\nWould it be more professional if I used my van to take the mower and clippings? I just don't really want to dick with getting it in and out of the van. I'm strong enough but I'm 5'5\" and my little arms make it hard to move awkward shaped stuff that's not small lol.\n\nMy friends were suggesting $35 per lawn since I'm providing equipment and removal. \n\nI'm a graphic designer so at least I can make nice business cards to catch their attention 😂 Thanks if you have input! ",
        "num_comments": 161,
        "comments": [
            "Not weird...  just make it happen!!",
            "Honest work is honest work. Screw what people think",
            "My grandpa said a man has to do what a man has to do.",
            "If you get a small trailer for equipment and trimmings you're just as legitimate as half the guys out there.",
            "Solid hustle - go for it!",
            "Bro.. people make entire livings doing lawn work. At all ages. There’s nothing weird or creepy about mowing lawns. \n\nWeird/creepy examples: 1) looking through peoples windows.. 2) sneakily taking pictures of strangers.\n\nNon-weird/non-creepy examples: 1) mowing lawns. 2) working hard.",
            "Go for it! Some people think everything is weird/creepy, Some appreciate the hard-working attitude. Do what you can do and don't worry about other m'fers. Live your life, let them live theirs.",
            "I respect you for it brother!\n\nYou never know...you can turn it into a multi-million dollar business....\n\nInteresting fact....landscaping is one of the \"happiest\" jobs out there..meaning most land scapers enjoy what they do!",
            "My dad started doing lawns as a small business after he retired and it grew into an actual business with employees, so naw you’re not going to creep anyone out at 34 lol. I’m a year younger than you and I’d hire a 34 year old to cut my lawn if I actually had one.",
            "Well I’m 43 and do lawn care and mowing for a side hustle.   I like the extra couple hundred I get in cash every other week.  I think you’ll be all right."
        ]
    },
    "What are some of the best side hustle’s that actually make money and are real?": {
        "title": "What are some of the best side hustle’s that actually make money and are real?",
        "score": 25,
        "url": "https://www.reddit.com/r/sidehustle/comments/1dqq4t1/what_are_some_of_the_best_side_hustles_that/",
        "content": "I am just looking into finding some good side hustles that I can do at home that are real and even if it takes a little time i am willing to learn. ",
        "num_comments": 35,
        "comments": [
            "Pretty much any service based business.",
            "Are you utilizing any r/BeerMoney apps?",
            "Pretty much anything can make extra $$$ if you need it . Selling food plates can go a long way if you no how to cook, find a house with trees and offer to trim and remove debris, go to a temp service and have them see what’s available with your schedule",
            "I think nighttime office cleaning is where it's at. After trolling these side hustle subs for a while, I decided to go for an evening cleaning gig. I landed one, one night a week, that takes about 45 minutes, and I make $150 a month. It's not a lot of money, but it's easy money and good audiobook time.",
            "Donating plasma! Most places give bonuses to new users, some as much as $1K for a consecutive amount of donations for new users. This is especially popular for college students to do during the summer, but summertime is when the bonuses are lower because of the influx of new users. Hope this helps!",
            "If you think you can clean a house under 3 hours, list on fb for airbnb cleaning, charge 120 to 150 if you are in a major city.",
            "Getting a second job... I usually break down and take a break but then once I have enough rest I apply again for a second job. Saving every single penny and investing that into guaranteed interest money. Money is a tool. Don't let money control you. It is just numbers and you can make money in so many ways. Do odd jobs for your neighbours and coworkers.",
            "Selling digital products, I mean think about it.  No inventory, no stock shortages and delivery time is instant.",
            "Bank bonuses",
            "I work in a warehouse for $20 per hour, 16 hours per week"
        ]
    },
    "Is selling website templates with it?": {
        "title": "Is selling website templates with it?",
        "score": 1,
        "url": "https://www.reddit.com/r/sidehustle/comments/1dr6i9c/is_selling_website_templates_with_it/",
        "content": "Anyone who had experience selling website templates in framer or Webflow and can comment on how is it doing and was it worth it?",
        "num_comments": 0,
        "comments": []
    },
    "Any Apparel Brands on Shopify Out there? ": {
        "title": "Any Apparel Brands on Shopify Out there? ",
        "score": 1,
        "url": "https://www.reddit.com/r/sidehustle/comments/1dr6fxl/any_apparel_brands_on_shopify_out_there/",
        "content": "Hi,\nI have just launched an App on the shopify app store as a side hustle for Apparel Brands.\n\nIt is designed for Apparel Brands to conduct market and product research to find their next bestseller.\n\nIt’s called [QCards](https://apps.shopify.com/qcards) ! \n\nUsers install within the next couple of weeks can use it free forever! Would love and appreciate any feedback, and whether it’s useful for you or not.",
        "num_comments": 0,
        "comments": []
    }
}