{
    "Silent Hill 2 coming October 8th, 2024": {
        "title": "Silent Hill 2 coming October 8th, 2024",
        "score": 820,
        "url": "https://i.redd.it/9uow9yhj4n3d1.jpeg",
        "content": "",
        "num_comments": 232,
        "comments": [
            "Ill be here. Waiting for you.",
            "Thank fuck, i'm done wearing my clown makeup for a while",
            "Inb4 \"bloober should delay the game\"",
            "Glad its earlier in the month since I get married on Halloween lol.",
            "When I'm in a being miserable competition and my opponent is a silent hill fan",
            "So aside from Angelas face that actually looked so cool. Her voice worked a lot better when shes like, going crazy. Hyped",
            "Hyped af my birthday is in October also. Hopefully they show off a collectors edition during the sh transmission\n\nEdit: Is it just me or did James VA sound great in this trailer, particularly the line  I guess I dont really care if its dangerous or not  Even his body mannerism is so odd when he says it. It so James lol. Or the flat delivery of  Ill be careful . And Abstract Daddy looks incredible wow.",
            "This trailer was miles. I mean miles better than what they showed us last time",
            "I was pretty hesitant. This was the last trailer I'm watching. I'm getting this game, and now I want nothing else of it revealed. \n\nIt will certainly feel different than the original, but the vibe is *fantastic*.",
            "I got my horror game for Halloween. Can't wait"
        ]
    },
    "Subreddit Updates + Moderator Applications": {
        "title": "Subreddit Updates + Moderator Applications",
        "score": 58,
        "url": "https://www.reddit.com/r/silenthill/comments/1d52fb0/subreddit_updates_moderator_applications/",
        "content": "Hello everyone, starting from today I will be cracking down on toxicity here as I've noticed it has increased tenfold which isn't ideal. Moderator applications are now open as well as we need more hands on deck to help with the subreddit mod queue, apply via the form link below if you're interested:\n\nhttps://forms.gle/MVd7DH8ncpzSixU28",
        "num_comments": 29,
        "comments": [
            "Is this subreddit actually going to be moderated now? Thank god, it severely needs it.",
            "Honestly, I don't envy the mod team of this sub.",
            "I applied, I gotta say I'm pretty active in this place and I am always commenting and posting stuff, idk if that's an issue in case I'm accepted, (i rarely see the mods commenting or engaging with the members). But either way, good luck to you guys, I noticed we really need a tougher modding with all these trolls saying crazy things about Angela's new design and so on.",
            "Are you going to ban or warn peolple who insult others only because they criticise any of the games design including characters or is this going to be one way road?",
            "Appreciate your efforts, the toxicity has been really gross and Id love to see some of the worst offenders finally go.",
            "Good luck in all this, and partially sorry for the inconvenience caused on Twitter, but partially not sorry because it should at least make this a better subreddit in the future. I can't help moderating here as I'm already busy with another large subreddit, so I'll just wish you all the best in improving this one.",
            "Just applied myself, I am on this subreddit nearly every day. I have been looking for an active way to be involved in the community and help bring it into a more positive place than it has been before. Long time fan since the beginning. There has been times when the fanbase has been an extremely positive one and I want to keep that aspect alive.",
            "I don't understand why my post is not approved. I made a post about how dumb is to shit storm the game, when we can focus our critics on the important things like animations. I understand moderation, but it's not useful to censor who want to reduce this hate",
            "Banning arguably the most knowledgeable and level-headed user on this sub is a take to say the least.",
            "Red Pyramid Scheme revolution, were so back"
        ]
    },
    "saw it on twitter. holy...": {
        "title": "saw it on twitter. holy...",
        "score": 137,
        "url": "https://i.redd.it/ufv3to715g9d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "There was a hole here. It's gone now.",
            "Seen the same meme but it was pussy lmao, I love how its a universal experience though",
            "We know wears the pants in this uh",
            "This might be my favorite SH meme",
            "I feel personally attacked by this image, but it is completely accurate.",
            "Those nurses. I'd hit it.",
            "Not far off",
            "Schizophrenic thug",
            "Hell yeah",
            ""
        ]
    },
    "Went to a retro videogame store…": {
        "title": "Went to a retro videogame store…",
        "score": 529,
        "url": "https://www.reddit.com/gallery/1dqu68x",
        "content": "…my poor wallet",
        "num_comments": 60,
        "comments": [
            "Virgin canon James vs chad PlayStation magazine james",
            "I had a PSM subscription back then. Takes me back.",
            "I remember how ultra heroic Harry and Sybil were, and always in a different style.",
            "The cover art for the original Silent Hill was just *chefs kiss*. Simple invert of values makes it feel so off and creepy.",
            "James looks like Solid Snakes final boss.",
            "Oh god... He has a pillow! Run!",
            "how much did you pay for sh1?",
            "Ah yes, James and Solid Snake, my favorite action heroes",
            "These artists went SOOO much harder than what was arguably necessary to entice people to these magazines + games, and I LOVE that. The detail on those clothes and muscles is insane.",
            "Goddamn, James looking more ripped than a goth girl's jeans, hair brighter than my future (and Albert Wesker's), and more jacked up on steroids than Chris Redfield.\n\nHis Catchphrase: \"The hill won't be Silent anymore when James pounds down.\""
        ]
    },
    "For my client": {
        "title": "For my client",
        "score": 244,
        "url": "https://i.redd.it/9hqab2ou3e9d1.jpeg",
        "content": "I’m on IG @3rd.este",
        "num_comments": 15,
        "comments": [
            "I think that's pretty dope",
            "this is legitimately one of the worst renditions of pyramid head I've ever seen. not to talk down your own skills, on a technical level it's fine. but the design is just horrid. looks nothing like him.",
            "Too bad it's not the original design.",
            "At least use the correct design.",
            "Isn't this the silent hill movie pyramid head not silent hill 2 video game pyramid head",
            "Seriously though, the purist snobs in the comments here are cracking me up... Maybe the client wanted that design? What's the artist supposed to say: \"nuh uh, it's not EXACTLY the SH2 design. Please leave my shop.\"?\n\nThe linear is very clean and it looks good overall. Who cares if it's not game accurate? Makes it more original at any rate.",
            "I wonder how it will heal, as well. It seems to be very fine lined.",
            "looks like they are holding clouds buster sword.",
            "Pretty sure the customer decides on the design, not the artist.",
            "It was a general remark"
        ]
    }
}