{
    "r/silksong post Nintendo direct Discussion board / why your post wasn't approved.": {
        "title": "r/silksong post Nintendo direct Discussion board / why your post wasn't approved.",
        "score": 87,
        "url": "https://www.reddit.com/r/Silksong/comments/1dirsq7/rsilksong_post_nintendo_direct_discussion_board/",
        "content": "If you submitted a text post, you may have noticed that you have to wait for it to be approved. This is to make the jobs of the moderators easier.\n\nText posts must have some quality and not be toxic to be approved. We don't want this subreddit to be censored however, but also not have the main page be flooded with low-effort discussions.\n\nThat's why **you can use this post to discuss some topics that weren't approved by us** <3",
        "num_comments": 130,
        "comments": [
            "I hope we also get Silksong HD-2D!!!",
            "I'm gonna die before this game comes out",
            "where the fuck was garten of banban",
            "that was my lost skong, i cant do this anymore. keep up the fight for me yall ",
            "Silksong or not, this direct was a W. We got MIO and The Legend of Link",
            "Anyone have any copium I can borrow? I'm running low... Metroid fans get to eat but Silksong fans are gonna go hungry yet again.",
            "AHAHAHAHAHAHHAHAHAHAHAH METROID PRIME 4 BEFORE SILKSONG\n\nHOLY FUCK",
            "\"Choose your champions carefully\"  \nHow about you choose my nuts carefully",
            "Hell yeah new Mario and Luigi game",
            "Yet theres a guy here spamming 50 ads for his cookie cutters."
        ]
    },
    "r/Silksong Update, New mods, etc.": {
        "title": "r/Silksong Update, New mods, etc.",
        "score": 192,
        "url": "https://www.reddit.com/r/Silksong/comments/1dn6su4/rsilksong_update_new_mods_etc/",
        "content": "Hey gang!! \n\nI've switched accounts, but I'm the creator of this crazy subreddit, this post is just a quick update about a few things starting with our new mods!\n\nFirst of all, thank you to everyone who sent in mod applications, and if you are one of those people I apologize for the delays on this post, getting back to you etc.\n\nOur new mods are:\n\nu/oneofthejoneses28\nu/sand-sky-stars\nu/mrpie1324\nu/just-a-random-ginger\nu/GorFlop-\n\nWelcome them!! \n\nI haven't been as active as I used to be but I intend on being more active, I know we recently hit 50k members which is insane to me, thank you all really, that's why I want this subreddit to be the best for all of you, I haven't posted something like this in a long time but in this comment section please give your feedback and feelings on everything regarding the subreddit recently, I'm aware there's been some big changes, how do you all feel about that? I'll read every comment so just let us know, have a great day or night, everyone! 🫶\n\n(ETA GorFlops username)",
        "num_comments": 56,
        "comments": [
            "well I hope those new mods know what they're getting into...",
            "We had news from the creator of the sub before Silksong. That's crazy.",
            "Yay, new mods. Congrats and all the best",
            "Welcome new mods! All I can say is, ***good luck***",
            "It would be cool if someone did drawings of the mods like in r/HollowKnightMemes",
            "tfw my dreams of becoming a mod on Reddit have been crushed ",
            "Be nice if we could embed images again.",
            "I thought the games isn't out but we already have mods for it ",
            "Is the analog-horror thing still allowed?",
            "Welcome, u/oneofthejoneses28 u/sand-sky-stars u/mrpie1324 u/just-a-random-ginger u/GorFlop !"
        ]
    },
    "Small SteamDB update": {
        "title": "Small SteamDB update",
        "score": 181,
        "url": "https://i.imgur.com/vOIoY6f.jpeg",
        "content": "",
        "num_comments": 31,
        "comments": [
            "Silksong and XCOM collab confirmed!?",
            "Does that mean that they're going to officially release the game tomorrow?",
            "This sub is so cooked lmao",
            "This sub is really paranoid, lol.",
            "I love it, I'll put it on the shelf with the others.",
            "Thank god we can go onto their twitter and see allthe updates.",
            "Theyre preparing everything for the 2026 release",
            "Lace sex scene in Silksong confirmed!?![img](emote|t5_4viev2|32428)",
            "Silksong is obviously  shadow dropping tomorrow",
            "The change is just for their twitter link. It doesn't mean anything"
        ]
    },
    "Which fan base has it worse?": {
        "title": "Which fan base has it worse?",
        "score": 261,
        "url": "https://i.redd.it/6ccqa1wdqf9d1.png",
        "content": "",
        "num_comments": 14,
        "comments": [
            "Both bases looks sturdy enough imo",
            "I think the second because the first has more features",
            "Idk if it's worse that 90% of posts are \"which fan base?\" or if it's worse that every 5th one makes this exact joke as if it's original.",
            "Okay, I'll stay quiet now",
            "dude that's a battle between the mordant and the classic, you are going to set the comment section on fire",
            "The first one looks less stable",
            "Both look good, BUT the second looks like it wouldn't fall so easily, but it is taking away more space. Meanwhile the first looks cheaper due to the design. I would recommend fan #1 for people with less money and #2 for people with big houses and more money.",
            "Guys bigger isn't always better :(",
            "This ones hard. The second one can be more annoying to put at the right hight but can also be less annoying to put at the tight hight depending on the situation. Though I dont see any strength adjustments on that one. Both can prolly rotate. But the first one despite having strength adjustments is really ugly so its really a tossup. Both communities are struggling in different aspects",
            "2 because more pole length = more weight"
        ]
    },
    "Tell me your favorite moment playing Silksong": {
        "title": "Tell me your favorite moment playing Silksong",
        "score": 32,
        "url": "https://i.redd.it/8qzgkrg4ci9d1.png",
        "content": "",
        "num_comments": 52,
        "comments": [
            "I liked when you get the elder scroll so mario will help you fight jabba the huttt",
            "I like the part where it is revealed that the king of pharloom is zote and we get a coll ass battle with him using the power of the friends we made along the way",
            "The POV of Lace x Hornet",
            "When you find the elder bug of pharloom drowning in the fizzy orange goo and you have to pull him out to save him but as you do that a giant fish eats him leaving you with only his legs",
            "When at the end of the game, its revealed you need to travel to hallowmest to fight a spreading infection and a little boi also known as a vessel (the hollow knight)",
            "I loved the secret Pale Karp bossfight you get after doing the fishing mini-game for 8 hours.",
            "Might be controversial, but the Wild Expanse was easily my favourite region. Great platforming and amazing music. The camouflaspids aren't *that* bad; they're just a fun little challenge.",
            "When hornet started break dancing in front of the final boss and fucking dies",
            "When hornet said it's silking time and silked everywhere",
            "Stopped playing after like two hours when I got stuck on a wall that should have been an easy climb for hornet (especially right after discovering the shmu aura lv. 1) \nFavorite moment was seeing the few hundreds items and stuff available in shop at the start, too bad I couldnt get to that"
        ]
    }
}