{
    "\"What is 'simple living,' anyway? Where do I start?\"": {
        "title": "\"What is 'simple living,' anyway? Where do I start?\"",
        "score": 91,
        "url": "https://lemmy.ml/post/1172789",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Two of my many favourite things in one pic - my doggo and the sunset. Life's little pleasures are truly the best of all": {
        "title": "Two of my many favourite things in one pic - my doggo and the sunset. Life's little pleasures are truly the best of all",
        "score": 311,
        "url": "https://i.redd.it/ivgtr63brg9d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Your little corner here looks so cozy. I think the doggy is enjoying it too.",
            "Aww, it kinda looks like a hippo ",
            "Your dog looks like they know how to relax too lol",
            "Awwww, what a good doggo!",
            "that has got to be the most adorable doggo I've seen so far (no offense to the other doggos out there)\nAlso, what a lovely ambience your house seems to have",
            "You're gonna need to give us that hunk of handsome's name. What a cutie!",
            "HIPPOBOT 9000 v 3.1 FOUND A HIPPO. 1,688,186,636 COMMENTS SEARCHED. 34,657 HIPPOS FOUND. YOUR COMMENT CONTAINS THE WORD HIPPO.",
            "Beautiful dog.",
            "Hes adorable! ",
            "Very squeezy doggo"
        ]
    },
    "It's been a hiking kinda day.": {
        "title": "It's been a hiking kinda day.",
        "score": 39,
        "url": "https://www.reddit.com/gallery/1drd9vy",
        "content": "After a week of work and finishing up the last assignments for my study program, I decided to go for a long walk. Clears out the head like a dream.",
        "num_comments": 2,
        "comments": [
            "Wow they look like paintings. Hope you enjoyed your hike.",
            "Thank you! I definitely did!"
        ]
    },
    "I got rid of my smartphone a few months ago, and my home internet is being cut off tonight. Just want to say thanks and goodbye, Simpleliving.": {
        "title": "I got rid of my smartphone a few months ago, and my home internet is being cut off tonight. Just want to say thanks and goodbye, Simpleliving.",
        "score": 931,
        "url": "https://www.reddit.com/r/simpleliving/comments/1dqfl8l/i_got_rid_of_my_smartphone_a_few_months_ago_and/",
        "content": "Thanks for showing me that simple living is mainly what you decide, not what other people say it should be. I liked the diversity of opinions and and the accepting of others views. \n\nI won't miss most of Reddit, but this sub was valuable, though I don't need to keep returning. I'm going to take everything I've learned here and go forth into the world. There's vegetables to grow, sweaters to knit, preserves to make, local events to participate in, trees to drowse under, books to read, libraries to scour, food to forage. I hope my internet addiction will become like a bad dream that haunted a lot of my life, but we'll see. \n\nBetween this sub (and the videos of the youtuber Atomic Shrimp (who, though not a simple living youtuber, made most  simple living YouTubers look like over-produced, hollow artifice)  I've learned a lot. Though I haven't had an account in a while, I've learned how to like to be myself, to find the magic in the small town I live in, and the natural world around me. I always liked that an strange idea wasn't automatically shot down here as stupid by narrow-minded redditors trapped inside their own small lives. We may be small, but we don't lack the courage to be otherwise. \n\nPeace :)",
        "num_comments": 78,
        "comments": [
            "Godspeed! Enjoy this amazing existence! ",
            "I deeply respect you for this and I love how it is so radical the people commenting cant make sense of it ",
            "Sounds pretty nice. Won't it make some simple things like online banking a bigger hassle?",
            "Green with envy OP, I will take your lead in future! I grew up without a phone in the house, let alone internet. I have hated having a mobile, since I got one 12 years ago, it makes everyone distracted and overly accessible. \n\nTo switch off from that constant stimulation and engagement is the dream. Enjoy! Soak real life up! I will be cheering you on from Aus!",
            "Atomicshrimp  \n\nYour new life outlook sounds amazing! Please write a book about it!",
            "Good for you OP, I guarantee your happiness will increase in spades.",
            "Appreciate the courage to cut off internet, happy living, will definitely be more fulfilling and happier. What do you work as btw ?",
            "How did you manage to get rid of your smartphone and not miss it?",
            "I love this for you and it's great to see someone who isn't retired doing it. Generally when I see people doing this it's people who are comfortable with not working (pensioners) and who already have their social group closed down, it's a lot more tricky than it should be. You're an inspiration, I'm going to leave my smartphone in the office this weekend because of you",
            "Ahhh I just love this for you! I work in a technical role online so I wont be ditching the internet anytime soon. But In the last couple months Ive gotten a small home library from my library book sale, moved life planning to physical planners, reading, journaling, painting, or just laying outside in the sun which is my plan for today work from home. I feel like Im at a point where Ive learned a lot from subs and the internet that I dont feel the need to learn more unless needed. Im getting my second masters and I think Im just over information overload. Im ready to just live."
        ]
    },
    "Perspective ": {
        "title": "Perspective ",
        "score": 135,
        "url": "https://www.reddit.com/r/simpleliving/comments/1dqpqia/perspective/",
        "content": "I’m on a girls trip. I started trying to live simply awhile ago. Reduce social media, fewer clothing purchases, fewer cosmetics, just overall bring where I am and watching our budget.\n\nThe clothing options purchased and brought for this trip. The amount of social media posts — no eating or drinking until a photo is taken. The stupid one use gift bags.\n\nI’m just here to say after making small changes, it’s very apparent the differences. It’s hard to stay engaged in conversations when they’re interrupted with social media.",
        "num_comments": 17,
        "comments": [
            "I would use the trip as confirmation that you have made the right choices in your life.  So many people forgetting to live because they are lost in a phone.   It's sad.",
            "Yeah, I hit this spot maybe in my late 20's. I am 52 now and have nothing to do with that side of the social world. I figured out things like this were not my space on earth. \n\nMaterialism as a whole doesn't do much for me, maybe for you this is the start of figuring out what is important to you?",
            "Yes. And oddly enough, its the simpler approach that gets looked at as extreme. ",
            "I feel you! I was on a girls trip a year or so ago and two of the women yapped CONSTANTLY about clothing and shopping. Every outfit change had to be accompanied by high pitched squealing about what a cute outfit it is and whered you buy it. Really put things into perspective for me about the quality of relationships I want in my life and hanging with people with values more in line with my own.",
            "Dont depend on others to make you happy. Use this trip to explore new experiences: go to a caf by yourself, try a dish youve never had before, and take time to observe people with an open mind. Watching how different people live and interact can teach you a lot. \n\nChallenge yourself to do things that are out of your comfort zone; it could be as simple as starting a conversation with a stranger or trying an activity youve never done before. Embrace these moments of independence, and youll find that they can be incredibly fulfilling.",
            "Maybe you can subtly bring up simple living, or anti-consumption in your discussion. You might convert a few or you might make them disinvite you from future trips (which I am guessing you may not mind so much?). Say something like, \"I've deleted my social media and found my mental health really improved.\" Or, \"I saw this documentary on fast fashion how bad it is for the environment, it really opened my eyes.\"",
            "Yes its true. Im the only one that is a mother so Im wondering if thats part of it. Traveling with a child makes you feel differently about how you spend your time. \n\nI just dont want or need the excess. Its a very jarring place to be in when it hits",
            ">Sounds like you may want new friends too.\n\nYou're not necessarily wrong, but we don't really know their friends, and the default approach should be way more chill than that. You don't make the world less glued to social media by cutting them off completely and seeming a weirdo, but rather by gently nudging and increasing awareness.",
            "Be careful with this, it sounds very smug and holier-than-thou. Lead by example, not through words.",
            "I dont think that has anything to do with being a mother."
        ]
    }
}