{
    "r/SimRacing Monthly Super Thread | A one-stop guide for new and veteran sim racers - June 2024": {
        "title": "r/SimRacing Monthly Super Thread | A one-stop guide for new and veteran sim racers - June 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/simracing/comments/1d79gf8/rsimracing_monthly_super_thread_a_onestop_guide/",
        "content": "# Welcome to the SimRacing Subreddit\n\n>r/SimRacing aims to be the one-stop hub for any one with an interest in, or a passion for sim racing.  \n>  \n>Whether you're brand new, a seasoned hobbyist, a veteran with extensive experience, or even a practicing professional, this is the place to find what you need. If something is missing or needs to get fixed, please don't hesitate to [message the moderators](https://www.reddit.com/message/compose?to=/r/SimRacing)!\n\n## General / Introduction\n\n* [Subreddit Rules](/r/simracing/about/rules/) \\- **Please take the time to read the full rules text before posting**! Don't get yourself banned!\n* [FAQ](https://www.reddit.com/r/simracing/wiki/faq) \\- Common subreddit and hardware questions, please check here if you have any questions about sim racing in general, or about the subreddit itself.\n\n## r/SimRacing Buyer's Guide\n\nLooking to get your first wheel? Wanting to upgrade your rig? Wondering what sims are available for your platform? We have the single most comprehensive hardware and sims guide out there, so you can find what you need here!\n\n* [Buyer's Guide Main Page](/r/simracing/wiki/buyingguide) \\- Wheels and Wheel Accessories\n* [Page 2](/r/simracing/wiki/buyingguide2) \\- Rigs (wheel stands, cockpits, and more)\n* [Page 3](/r/simracing/wiki/buyingguide3) \\- DIY Hardware Guides\n* [Page 4](/r/simracing/wiki/buyingguide4) \\- Games\n\n*The Buyer's Guide is slightly outdated. An update is in the works*\n\n## Miscellaneous\n\n* [Related Subreddits](/r/simracing/wiki/index#wiki_related_subreddits)\n* [News & Community Sites](/r/simracing/wiki/index#wiki_news_.26amp.3B_community_sites)\n* [Official Game Sites](/r/simracing/wiki/index#wiki_official_game_sites)\n\n## Company Reps & Employees\n\nDo you represent a sim-racing-related hardware or software company? Please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FSimRacing&subject=Company+Representative) for verification or if you are interested in working with us or have any questions. We welcome the involvement of any simracing organization, but we have strict rules on selling and promotion.",
        "num_comments": 69,
        "comments": [
            "Hey can anyone recommend a good touring car racing game? Would be better if it has cars from the 90s and low system requirements",
            "Can you drive formula cars with a 300mm steering wheel, or would that be too big?",
            "is it worth to get the g923? budget is 300",
            "What are the most active Assetto Corsa racing leagues. Im looking for a league where people are racing in other cars than mx5. Im tired of that car",
            "**Simucube 2 Pro Emergency Stop Extension Cable** - Does anyone know if this can be purchased, or even know what type of cable it is? I'd like to add about about 50-60 cm to it (~2 feet).\n\nThanks!",
            "Will paid version of Simhub enhance the pedal vibration on my V3 pedals or is it the same as free version?\n\nAlso i hate reddit! Can't even make a post to ask a question, instead i am forced to this thread. where this question will never be seen and will have to wait days or weeks for any kind of response because of stupid reddit. Should have made another corny \"check out my rig post\" and asked my stupid question there",
            "I have never done sim racing before but I am super interested in it. Am I insane if I’m considering diving in head first and going straight to a moza r9, crp pedals, and simlab gt1 evo? Would I be better served in a more budget setup than figuring out what I like later?",
            "Hey y'all, just got the R5 bundle on ebay, its exciting to add some variety to my gaming life.\nWhere do y'all learn race craft? Learning these tracks are harder than I thought lol",
            "GTLite pro or Playseat challenge?\n\nI’m 5’10 but 250 pounds, I heard the challenge is a lot smaller, will that be a problem?",
            "Whats the minimum amount to spend, in order to get 80-90% of the experience of a multi thousand dollar setup?"
        ]
    },
    "90% percent off assetto corsa!!": {
        "title": "90% percent off assetto corsa!!",
        "score": 33,
        "url": "https://i.redd.it/6080pch6ah9d1.png",
        "content": "",
        "num_comments": 14,
        "comments": [
            "Has been for a while I think?\n\nAnyone remotely interested in getting into the OG should suck it up and get the Ultimate. A lot of mods down the line rely on having different DLCs etc. and it leads to headaches. Just get it all now and ENJOY.",
            "...big-ass steam summer sale! nice!",
            "This is happening mainly because I paid full price not too long ago",
            "I couldn’t find how to instal the mods. Where do I find the content manager?",
            "Same. I've been looking at assetto for a long time, finally pulled the trigger, a couple hours later 90% sale lmao",
            "LOL. I'm in the same path as you at the moment.",
            "> It’s the most expensive two bucks I ever spent.\n\nAnd you haven't even hit the most expensive stage yet: iRacing",
            "I would like to know how to mod as well.",
            "return it and buy again?",
            "Look, I’m all for there being no stupid questions but how are you guys on Reddit however can’t look up on YouTube “content manager install AC”? 😂"
        ]
    },
    "This dude brought his simracing rim to the 24hrs race of SPA": {
        "title": "This dude brought his simracing rim to the 24hrs race of SPA",
        "score": 646,
        "url": "https://i.redd.it/43q0vii6ac9d1.png",
        "content": "",
        "num_comments": 29,
        "comments": [
            "Would be a cool item to get signed.\n\nI’m also pretty sure Fanatec had a booth or something setup to purchase items. So that may have been the case here as well.",
            "I love that Simracing is becoming so popular, it's good for us gamers.",
            "I've brought a few of mine to races to get signed.  The drivers generally think it's pretty cool.",
            "I believe Fanatec had a booth there (they were selling another rim as a limited run) so maybe they were selling these as well?",
            "Dale Tanhardt’s influence runs deep /s",
            "Isn't this the guy who was asking if he should buy the steering on the race?",
            "Yeah someone posted earlier about a special spa fanatec wheel only being sold at the event",
            "It looks like getting it signed is exactly what he was doing. There are silver scribbles on the left side that I’m guessing are a signature.",
            "It is signed on the left side.",
            "You are totally correct that they had a booth there. However, the *only* thing they were selling at the event were 100 limited edition 24hr Spa wheel rims. The one in the photo isn't one of them, which indicates that this guy brought it to the event, most likely to get it signed."
        ]
    },
    "What ridiculous things have you done to keep your pets away from your rig?": {
        "title": "What ridiculous things have you done to keep your pets away from your rig?",
        "score": 176,
        "url": "https://www.reddit.com/gallery/1dqtsig",
        "content": "I've got a couple rowdy dogs that need to be touching me or they're not happy, which creates an issue while racing. As you probably know, it's hard to race while your dog is jumping and pulling at you.\n\nHere's what I did to keep the devils out, he's so upset now 😂",
        "num_comments": 78,
        "comments": [
            "With two cats those cardboard walls would be an invitation for them to play even more around the rig. 😅\nJust gave it up. Sleeves on all cables, just in case, but that's it.",
            "I make them watch a cartoon... 😎",
            "That good dog just wants to go for a ride",
            "I have a cat, the only thing I do is cover the seat with a blanket so that he won't scratch the seat. Apart from that, we're sharing the cockpit.",
            "Awwwww such a good boy! I bet he’ll learn with time",
            "I have to put a plastic bag over my pedals to protect them from 'accidents', it's saved them twice from one of our very disrespectful cats!",
            "Someone tell him about the invention of the door :P",
            "Haha my lab is a year and a half now. My simracing time has been cut down significantly, at first she would fall asleep under my seat and let me race for a bit but she’s in her crazy mode now…\n\nSo I pretty much only get racing time when she’s sleeping in her crate at night now.",
            "How do you like the HF8? Personally I’ve loved mine. I’m on the top floor of an apartment so I thought bass shakers might upset my neighbors.",
            "Just a seat cover here. Cat still manages to pop holes in my sparco seat. It's also his second cat bed. Gets more use out of the rig than me these days."
        ]
    },
    "Should I start sim racing with iracing ": {
        "title": "Should I start sim racing with iracing ",
        "score": 18,
        "url": "https://www.reddit.com/r/simracing/comments/1dr4y6q/should_i_start_sim_racing_with_iracing/",
        "content": "So I’m getting a sim rig for my first time and I was wondering if it’s a good idea to learn with iracing, I have some experience with gt7 but not much and on controller so is iracing good to learn? ( I don’t have that much money and I wouldn’t want to waste some by struggling to learn stuff that I could have done on a less advanced game)",
        "num_comments": 63,
        "comments": [
            "I would recommend start with AC (not ACC) you can get it as cheap as 1 or 2$ from steam and has endless cars and tracks mods (a lot of them are free) that you can have loads of fun with and can learn simracing and online competition before jumping into iRacing.",
            "I do not recommend iRacing, this simulator ruined other sims/racing games. Once you hooked up into iRacing your are done, any other sims and racing games will be boring for you.",
            "iRacing is good if you want competitive racing. BUT nothing wrong getting AC for 2 bucks in the sale right now for the days where you don't feel like competing and want to drive different stuff.",
            "Yes, iRacing is amazing. I bought a bunch of other sims before I bought iRacing, and now I never use them.",
            "You will probably end up on iRacing if you get hooked on sim racing so might as well start with it",
            "For your first dip into the sim racing world I'd recommend everything but Iracing. I don't really count GT7 as a dip into sim racing. Before you invest a fortune in this game better make sure that you're really into sim racing.\nGrab yourself something cheap like ACC, Ams2, AC, Le Man's ultimate. If you enjoy it you can still \"upgrade\" to Iracing",
            "If the premise is you are still using a controller because you are on a budget, I dont see WHY u should start with iracing. Download a sim that isnt this expensive, figure out if u like it, if you do save some money for a rig with wheels and pedals, and THEN consider payin for a sim service like iRacing. Thats what I'd do.",
            "I don't see why not. I tried different sims over the years and still had to adjust quite a bit yo iRacing, so I'd just start there anyways.\n\nJust don't expect to be fast right away and enjoy the process.",
            "Got my rig before my PC. Started on AC and Dirt 2.0 for a bit, as soon as the PC showed up I went iRacing and have never looked back.",
            "No reason not to start with iRacing, at the very least it forces you down a rookie path in cars which teach you the fundamentals of racing before you progress to higher power cars.\n\nDon't ignore other sims though, for example AC is on sale at the moment and offers (through mods) just about anything and anywhere you could want to drive."
        ]
    }
}