{
    "Welcome to r/skeptic here is a brief introduction to scientific skepticism": {
        "title": "Welcome to r/skeptic here is a brief introduction to scientific skepticism",
        "score": 203,
        "url": "https://skepticalinquirer.org/2017/01/why-skepticism/",
        "content": "",
        "num_comments": 110,
        "comments": [
            "Dr. Novella does really important work for our community.",
            "It's sad to see how little attention this post got. Lots of members of this community need substantial instruction on skepticism.",
            "I have been in the movement for 30 years and I never connected with Novella or SGU content.  It is interesting how you can be so close to something and completely miss it.",
            "The key to skepticism is a well-defined scientific method able to sift science from fake, pseudo- and wannabe science. Validation and falsification are key to that. Although you mention *falsification* in the article above (defining your skepticism project), you don't define it and you haven't given a summary definition of science or scientific method either. I think your should.",
            "Hi - I would strongly suggest adding a description of the subreddit to the **sidebar** (or the about section on mobile. You can add a link to this article there, and this would make it a bit more visible/accessible than having a pinned post. Thanks!",
            "The lack of punctuation in the headline is killing me.",
            "Skepticism = trust the experts. Lol I love this.",
            "Its nice that this is pinned, I hope those coming in today from the UFO subreddit check this post out",
            "He is one of the patron saints of scientific skepticism alongside Carl Sagan and James Randi\n\n*Only kidding, we don't have saints and nobody is considered infallible or deified within our community, but if we did...*",
            "Yeah he's definitely an important figure in skepticism and one and great advocate of science and critical thinking. In short, dude's awesome. \n\nI really like that TheSGU doesn't talk religion much. To many, skepticism is atheism and atheism is skepticism. And I don't shy away from my atheism but more importantly, I'm a skeptic. And when I do talk religion, MOSTLY I'm talking to the anti science fundamentalist crowd."
        ]
    },
    "How F*cked Are We When We Call The Liar The Debate \"Winner\"?": {
        "title": "How F*cked Are We When We Call The Liar The Debate \"Winner\"?",
        "score": 143,
        "url": "https://www.youtube.com/watch?v=GgjyHwQOUoo",
        "content": "",
        "num_comments": 56,
        "comments": [
            "The first question about the attempted coup at 41 minutes",
            "When debates are about perception and not facts.",
            "Democracy was decapitated when you got a MAGA SCOTUS.  This chicken is already dead, it just doesn't know it yet.",
            "ODonnell shows his age here. Few people may have watched the debate, but enough people cut, edited, and posted eight or ten second clips across multiple social media accounts - moments out of context that millions have seen, and memes that have concretized the most superficial binaries in the minds of low information voters. Cope all you want, but outside of the death of one of the two candidates, its clear that the election is already over. Americans should now prepare themselves for Trump II: Electric Boogaloo.",
            "We all know where this is headed. Buy guns and fortify local alliances",
            "There were no winners, only losers.  We lost the most.",
            "Pretty fucked. This is as bad as it gets for the Dems.",
            "Lying with confidence beats telling the truth nervously. Its fucked.",
            "Quite amazing how a felony conviction and trying to overthrow an election is somehow considered less of a negative than a bad debate.",
            "It wasnt a debate. Both candidates need to go away."
        ]
    },
    "Embattled Alzheimer’s Researcher Is Charged With Fraud": {
        "title": "Embattled Alzheimer’s Researcher Is Charged With Fraud",
        "score": 14,
        "url": "https://www.nytimes.com/2024/06/28/health/wang-cassava-alzheimers-fraud.html",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Hi, John. Switched to an alt, I see.",
            "This case is part of a worrying trend of research misconduct in high-profile scientific fields, especially[ Alzheimers.](https://www.thefp.com/p/where-is-the-cure-for-alzheimers)  Perhaps we need stricter protocols in grant review processes, more robust data verification methods, and most importantly a culture that prioritizes integrity over the pressure to publish positive results."
        ]
    },
    "Shades of Green | Even as an environmental activist, R.F.K. Jr. often put science second, onetime allies say": {
        "title": "Shades of Green | Even as an environmental activist, R.F.K. Jr. often put science second, onetime allies say",
        "score": 7,
        "url": "https://airmail.news/issues/2024-6-29/shades-of-green",
        "content": "",
        "num_comments": 2,
        "comments": [
            "He left the *Ring of Fire* radio show in 2020 because his personal anti-vaccine views became too much for the other hosts and most listeners. He was an original co-host in 2004.",
            "https://archive.ph/2024.06.29-053917/https://airmail.news/issues/2024-6-29/shades-of-green"
        ]
    },
    "If Donald Trump wins the 2024 Presidential election, how does this impact science based skepticism?": {
        "title": "If Donald Trump wins the 2024 Presidential election, how does this impact science based skepticism?",
        "score": 220,
        "url": "https://www.reddit.com/r/skeptic/comments/1dqpkso/if_donald_trump_wins_the_2024_presidential/",
        "content": "",
        "num_comments": 275,
        "comments": [
            "Scientific skepticism will become more important than ever.",
            "To be frank, if the Republican party wins I think the fate of scientific skepticism is the *least* of anyone's worries.",
            "Much like when Trump won the 2016 election, scientific skepticism will be *incredibly* important due to the increase of misinformation being spread specifically by the White House.",
            "There are plenty of historical examples of what happens to academics when autocratic regimes take power. None of them are good.",
            "American government will cease to exist as we know it if Project 2025 is followed. Extrapolate from there.",
            "My guess is year 1 less funding for most actual science based activities, more Christianity ham fisted into every aspect of our lives, and letting incompetent religious nut cases take over more areas of government to do permanent damage.  Look at Florida basically.",
            "According to Project 2025 the federal government would be gutted from people who don't pledge loyalty to the ~~king~~ president. Therefore any health and safety, environmental protection and educational standards, for example, would be based on science only as long as it's useful to the big man in charge or his handlers.",
            "Before mass leaders seize the power to fit reality to their lies, their propaganda is marked by its extreme contempt for facts as such, for in their opinion fact depends entirely on the power of man who can fabricate it.\n\nHannah Arendt, The Origins of Totalitarianism",
            "We will have a president who does not make decisions based on scientific evidence. If we have another science-based crisis, it could be very bad.",
            "The fact that were even asking ourselves this question means the president has way too much power."
        ]
    }
}