{
    "Welcome to r/skeptic here is a brief introduction to scientific skepticism": {
        "title": "Welcome to r/skeptic here is a brief introduction to scientific skepticism",
        "score": 208,
        "url": "https://skepticalinquirer.org/2017/01/why-skepticism/",
        "content": "",
        "num_comments": 110,
        "comments": [
            "Here is an illustration of what [scientific skepticism is not](https://i.imgur.com/kdrstv6.jpg)\n\nIf you're like this seagull and you don't trust peer reviewed evidence or official sources or scientists or academic consensus and you're visiting here looking for other seagulls, you're going to be disappointed.\n\nFor regulars - let's try and be tolerant of people like this and engage with them. Many of them don't have good epistemic toolkits and they could benefit from learning about skepticism by seeing how it is applied to claims that they acknowledge are false.",
            "Dr. Novella does really important work for our community.",
            "It's sad to see how little attention this post got. Lots of members of this community need substantial instruction on skepticism.",
            "I have been in the movement for 30 years and I never connected with Novella or SGU content.  It is interesting how you can be so close to something and completely miss it.",
            "The key to skepticism is a well-defined scientific method able to sift science from fake, pseudo- and wannabe science. Validation and falsification are key to that. Although you mention *falsification* in the article above (defining your skepticism project), you don't define it and you haven't given a summary definition of science or scientific method either. I think your should.",
            "Hi - I would strongly suggest adding a description of the subreddit to the **sidebar** (or the “about” section on mobile. You can add a link to this article there, and this would make it a bit more visible/accessible than having a pinned post. Thanks!",
            "The lack of punctuation in the headline is killing me.",
            "The substance of the article\n\n> **Respect for Knowledge and Truth:** Skep­tics value reality and what is true. We therefore endeavor to be as reality-based as possible in our beliefs and opinions. This means subjecting all claims to a valid process of evaluation.\n\n>**Methodological Naturalism**: Skeptics believe that the world is knowable because it follows certain rules or laws of nature. The only legitimate methods for knowing anything empirical about the universe follows this naturalistic assumption. In other words, within the realm of the empirical you don’t get to invoke magic or the supernatural.\n\n>**Promotion of Science**: Science is the only set of methods for investigating and understanding the natural world. Science is therefore a powerful tool and one of the best developments of human civilization. We therefore endeavor to promote the role of science in our society, public understanding of the findings and methods of science, and high-quality science education. This includes protecting the integrity of science and education from ideological intrusion or antiscientific attacks. This also includes promoting high-quality science, which requires examining the process, culture, and institutions of science for flaws, biases, weaknesses, conflicts of interest, and fraud.\n\n>**Promotion of Reason and Critical Think­ing**: Science works hand-in-hand with logic and philosophy, and therefore skeptics also promote understanding of these fields and the promotion of critical thinking skills.\n\n>**Science vs. Pseudoscience**: Skeptics seek to identify and elucidate the borders between legitimate science and pseudoscience, to expose pseudoscience for what it is, and to promote knowledge of how to tell the difference.\n\n>**Ideological Freedom/Free Inquiry**: Science and reason can flourish only in a secular society in which no ideology (religious or otherwise) is imposed upon individuals or the process of science or free inquiry.\n\n>**Neuropsychological Humility**: Being a functional skeptic requires knowledge of all the various ways in which we deceive ourselves, the limits and flaws in human perception and memory, the inherent biases and fallacies in cognition, and the methods that can help mitigate all these flaws and biases.\n\n>**Consumer Protection**: Skeptics endeavor to protect themselves and others from fraud and deception by exposing fraud and educating the public and policy-makers to recognize deceptive or misleading claims or practices.\n\n>**Addressing Specific Claims**: Skeptics combine all of the above to address specific claims that are flawed, biased, or pseudoscientific and to engage in the public discussion of these claims.\n\n>**Cultural Memory**: Skeptics as a whole act as the cultural memory for pseudosciences and scams of the past. Such beliefs tend to repeat themselves, and remembering the past can be very useful in quickly putting such beliefs into their proper perspective.\n\n>**Science Journalism**: Many skeptics spend a large portion of their time doing straight science communication and journalism, which is important because science is so central to our mission. This is also an important skill to explore and develop because it is so rarely done well. Correcting and criticizing bad science news reporting, especially in the Internet age, has become a large part of what skeptics do.",
            "Thanks for sharing",
            "As if this sub has much to do with scientific skepticism anymore.\n\nLooking at the post titles, mostly it's subject Trump, GOP, Elon Must (being a \"nazi\") etc. It's yet another left wing echo chamber. The mods do nothing to keep this from happening and political blow-hards will always take every opportunity they can to push their political bias, if you let them. \n\nAnd these posts get the most attention, the most comments."
        ]
    },
    "If Donald Trump wins the 2024 Presidential election, how does this impact science based skepticism?": {
        "title": "If Donald Trump wins the 2024 Presidential election, how does this impact science based skepticism?",
        "score": 202,
        "url": "https://www.reddit.com/r/skeptic/comments/1dqpkso/if_donald_trump_wins_the_2024_presidential/",
        "content": "",
        "num_comments": 244,
        "comments": [
            "Scientific skepticism will become more important than ever.",
            "To be frank, if the Republican party wins I think the fate of scientific skepticism is the *least* of anyone's worries.",
            "Much like when Trump won the 2016 election, scientific skepticism will be *incredibly* important due to the increase of misinformation being spread specifically by the White House.",
            "There are plenty of historical examples of what happens to academics when autocratic regimes take power. None of them are good.",
            "American government will cease to exist as we know it if Project 2025 is followed. Extrapolate from there.",
            "According to Project 2025 the federal government would be gutted from people who don't pledge loyalty to the ~~king~~ president. Therefore any health and safety, environmental protection and educational standards, for example, would be based on science only as long as it's useful to the big man in charge or his handlers.",
            "My guess is year 1 less funding for most “actual” science based activities, more Christianity ham fisted into every aspect of our lives, and letting incompetent religious nut cases take over more areas of government to do permanent damage.  Look at Florida basically.",
            "The fact that we’re even asking ourselves this question means the president has way too much power.",
            "We will have a president who does not make decisions based on scientific evidence. If we have another science-based crisis, it could be very bad.",
            "Before mass leaders seize the power to fit reality to their lies, their propaganda is marked by its extreme contempt for facts as such, for in their opinion fact depends entirely on the power of man who can fabricate it.\n\n—Hannah Arendt, The Origins of Totalitarianism"
        ]
    },
    "Redemption or ruse? Russell Brand’s conversion to Christianity examined | Abigail Kennedy": {
        "title": "Redemption or ruse? Russell Brand’s conversion to Christianity examined | Abigail Kennedy",
        "score": 176,
        "url": "https://www.skeptic.org.uk/2024/06/redemption-or-ruse-russell-brands-conversion-to-christianity-examined/",
        "content": "",
        "num_comments": 72,
        "comments": [
            "Dear Gullible Payer of my Mortgage,\n\nIn recent years, I may have given the impression that I was a neurotic, irresponsible and manipulative troublemaker who had repeatedly meddled in political matters that did not concern me and frequently masked my predatory sexual nature by belittling the victims of my 'rapey-wapey' activities.\n\nI now realise that at the moment such allegations became impossible to avoid, I became the most Christian person in the whole world. As my compassion knows no bounds, I have forgiven those who let me sexually assault them, even though they are as skanks in my eyes.\n\nI would like to express my sincere and deepest hypocrisy to all my subscribers and hope and pray that this will be enough to get me back on YouTube where I can start raking in the cash once more.\n\nThe Lord our Russell Brand\n\nAmen, nr Henley-on-Thames\n\nGoddington, Surrey, UK",
            "It's as much to realign himself with his new grifting targets as anything else",
            "OMG, Bear Grylls is an evangelical? Yikes.\n\nBut anyway:\n\n>Brand suggests he turned to religion in response to what he perceives as a “coordinated media attack” aimed at silencing his criticism of mainstream media.\n\nYeah, sounds like total BS.",
            "Celebrity conversions are almost always performative, opportunistic, and insincere.",
            "Ah yes, the sexual predator to alt right grifter pipeline continues to flow",
            "Grifters gonna grift",
            "He is 100% as Christian as anyone else. And a very typical example. Christians are all fake as shit like this. So I see absolutely no reason people would question this.\n\nThe issue people seem to have is some idealistic version of a Christian. As if they have to have morals or genuine beliefs. Not required. Any scum bag racist can be a Christian just by saying they are. There's no other requirement.",
            "Russell Brand is a savvy business man.  He knows what side to pick to rake in that sweet sweet cash on the internet.  The guy is an arts school dropout and a known sexual predator.  Christians will love him.",
            "About as legit as most \"Christians\" faith. A useful tool to mark one out as a swell guy while being a reprobate.",
            "oh he's repented all that sexual abuse has he? come on, man's a creep"
        ]
    },
    "Rain on Your Parade Ep 42: Christian Nationalism - Comedian J-L Cauvin sits down with producer Steve Okin to discuss his great documentary on Christian Nationalism, God & Country.": {
        "title": "Rain on Your Parade Ep 42: Christian Nationalism - Comedian J-L Cauvin sits down with producer Steve Okin to discuss his great documentary on Christian Nationalism, God & Country.",
        "score": 4,
        "url": "https://www.youtube.com/watch?v=L1lkJhJCDuA",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "SBM: The Lab Leak Theory and the Complicit Media": {
        "title": "SBM: The Lab Leak Theory and the Complicit Media",
        "score": 56,
        "url": "https://sciencebasedmedicine.org/the-lab-leak-theory-and-the-complicit-media/",
        "content": "",
        "num_comments": 111,
        "comments": [
            ">An outstanding 2021 WIRED article, “The Covid-19 Lab Leak Theory Is a Tale of Weaponized Uncertainty,” explained how the lack of definitive answer regarding the pandemic origins is mined by the political Right.\n\nWhat I referred to as the \"God of the gaps\" fallacy applied to SARS-CoV-2 origins. Creationism.",
            "I haven’t seen this article here anywhere yet! Great coverage of the issue and links (click all the links!) to even more great coverage.\n\nA few highlights among the links in the article and links inside the links include these:\n\n[Why is The New York Times now promoting an anti-science agenda? by Science Based Medicine](https://sciencebasedmedicine.org/why-is-the-new-york-times-now-promoting-an-anti-science-agenda/)\n\n[The New York Times Is Failing Its Readers Badly on Covid by The Nation](https://www.thenation.com/article/society/nyt-covid-opinion-coverage/)\n\n[Kristian Andersen on SkyView](https://skyview.social/?url=https%3A%2F%2Fbsky.app%2Fprofile%2Fkgandersen.bsky.social%2Fpost%2F3ku7aov4pvd23&viewtype=unroll)  \n\n[This Week in Virology on YouTube](https://www.youtube.com/watch?v=rZ1FGCPenns)\n\n[Lab Leak Mania by Beyond the Noise](https://pauloffit.substack.com/p/lab-leak-mania)\n\n[The New York Times goes all in on “lab leak”](https://www.respectfulinsolence.com/2024/06/08/the-new-york-times-goes-all-in-on-lab-leak/)\n\n[No, gain of function research did not create COVID-19 by Bigthink](https://bigthink.com/starts-with-a-bang/gain-of-function-research-covid-19/)\n\n[Treacherous ancestry by Protagonist Science](https://www.protagonist-science.com/p/treacherous-ancestry)  \n\n[Bite-size origin science by Proganist Science](https://www.protagonist-science.com/p/bite-size-origin-science) \n\n[Virology - the path forward in the Journal of Virology by Angela Rasmussen et al.](https://journals.asm.org/doi/10.1128/jvi.01791-23)",
            "The media's job is not to inform, it's to make money, so it shouldn't surprise anyone when they choose money over accuracy. Since the laws and amendments concerning media were mostly created when overt government censorship was the main impediment, those laws and amendments keep the government from regulating the spread of false information but do nothing to protect the public from the dangers of false information. Since the US Republic has entered the \"stagnation before collapse\" phase of semi-representative government,  it will only get worse from here on out.",
            "People seem to be very much on two camps on this subject: those who accept what the current evidence is telling us, whatever that is, and those that *desperately* want the lab leak to be true regardless.\n\nMy question is why? What's so compelling about the lab leak theory that makes people love it so much?",
            "It's not remotely far fetched to say a lab studying coronaviruses leaked a coronavirus.\n\nIt's not remotely far fetched to say China covered it up. [They officially claimed that only 60,000 people died once they opened up, a far cry from the 2 million who actually did.](https://www.reuters.com/world/china/nearly-2-million-excess-deaths-followed-chinas-sudden-end-covid-curbs-study-2023-08-25/)\n\nTrying to discredit the Lab Leak at this point just comes across as going to whatever lengths necessary for \"your team\" not to concede any points at all. Very similar to how people in this sub still doubt the very existence of Hunter Biden's laptop and even that it contained any of his effects at all, [despite the laptop itself being entered into evidence, along with a repair receipt, along with FBI agents testifying as to its veracity.](https://www.nytimes.com/2024/06/05/us/politics/hunter-biden-trial.html)\n\nThe right thing here is to take the L on this, tighten lab protocols so something like this never happens again, and require full transparency (looking at you China) in order to maintain funding and certification of such labs.",
            "[deleted]",
            "I smell a (lab) rat here.  Let’s unpack this claim from the first article linked in the first comment above from OP:\n\n“Science, and US tax dollars, are being blamed for a pandemic that has killed over 1.1 million Americans, and perhaps as many as 20 million people worldwide.”\n\nUmmm, nope.  Substandard laboratory biosafety controls are being blamed… and the article fails to refute that.\n\nThe dogmatic nature of these objections to the lab leak hypothesis lends it even more credibility.",
            "Weaponized by the left...  that's the irony.\n\nIt was the left that politicized it.  It was the left the helped Fauci cover it up.  It's the left that's still backing big pharma and the government in their cover up.\n\nWe have all the data needed.  From DEFUSE proposals, to testimonials, to emails, and a paper trail a mile long.",
            "[https://www.politico.com/news/2024/06/02/fauci-covid-research-investigative-panel-00161109](https://www.politico.com/news/2024/06/02/fauci-covid-research-investigative-panel-00161109)\n\n>“I learned from our foia lady here how to make emails disappear after I’m foia’d but before the search starts, so I think we are all safe,” Morens wrote to Daszak in February 2021 about Freedom of Information Act requests.\n\n>In another email, Morens wrote that he “can send stuff” to Fauci’s private email or hand it over to him at his house or at the office because Fauci “is too smart to let colleagues send him stuff that could cause trouble.”\n\nSorry Charlie, but if top scientists actively disdain honesty and transparency, then we absolutely need pushback from the media, congress, etc.",
            "I disagree.  The god of the gaps in where god is used to fill in the gaps of scientific knowledge, but scientific knowledge is not at issue here, data is.  We know it came from somewhere but we don't have the data to know where, so the lab leak theory is just a less likely competing theory."
        ]
    }
}