{
    "Update 2.1 & Maintenance 18th June": {
        "title": "Update 2.1 & Maintenance 18th June",
        "score": 94,
        "url": "https://www.reddit.com/r/SkullAndBonesGame/comments/1di0656/update_21_maintenance_18th_june/",
        "content": "Captains, a maintenance is incoming. Tuesday, June 18, the Indian Ocean of Skull and Bones will be temporarily unavailable.\n\n⏰ 8AM CEST / 4PM AET / (17 JUNE) 11PM PT\n\n⏱ \\~2hr\n\nYou will be docked at the title screen if you are playing when the maintenance starts.\n\nUpdate 2.1 will be deployed. Check out the full patch notes here 👉 [https://skullandbonesgame.com/y1s2\\_1\\_patch\\_notes](https://skullandbonesgame.com/y1s2_1_patch_notes)\n\nhttps://preview.redd.it/534pyoc3u47d1.png?width=1080&format=png&auto=webp&s=cbd9400c67ff7d6f8b5bdd1a6c7bfa403bfc83ef\n\nhttps://preview.redd.it/jx8pikx3u47d1.png?width=1080&format=png&auto=webp&s=769e16ac0cca02ee96ec17a0def29f956964c439\n\nhttps://preview.redd.it/7i3bdhp4u47d1.png?width=1080&format=png&auto=webp&s=3579d47fc6f12ddb6f4c1b3036a5e030eddf3437\n\nhttps://preview.redd.it/d6xbh1y5u47d1.png?width=1080&format=png&auto=webp&s=0b4829539129f02fb100d6683f405cfe1e6c277b",
        "num_comments": 97,
        "comments": [
            "Fast Travel to a Call For Help is awesome!",
            "I'm answering every call for help! 🥳🍻🎉🏴‍☠️🏴‍☠️🛥️🛥️",
            "Some great updates. Love how receptive to feedback the team are. Absolutely love this game.",
            "Wow! 🤩 Two major things to note\n1) Fast Travel on calls for Help!! A++ \n—— might be helpful to have a running queue for calls for help now also?? I would like to see a list of calls for help sorted by expiration, instead of a temporary pop-up.\n2) Finally fixed Master Distillers!!! 🫡🤝\n—— a long lasting bug from season 1, this will help dramatically, and most players had no idea they were affected by this.",
            "Man, I hope this fixes Xbox crashes. I love this game, but it's nerve racking every time I log on knowing my Xbox will lock up at any moment.",
            "Wow this is looking like a great patch",
            "Smol ships let’s gooo!",
            "Love the patch but still we need more warehouse space. Its hard out here",
            "Reducing the bounty cooldown is great. I could only do this once every two days.",
            "Love the fast travel changes."
        ]
    },
    "Share your ideas - Post Season 2 Launch": {
        "title": "Share your ideas - Post Season 2 Launch",
        "score": 41,
        "url": "https://www.reddit.com/r/SkullAndBonesGame/comments/1djj88c/share_your_ideas_post_season_2_launch/",
        "content": "https://preview.redd.it/lov3h2qb3j7d1.png?width=1920&format=png&auto=webp&s=642d3659a7d23394c55542caee7bd7508fe15250\n\nGreeting Captains!\n\nWe’re back again to talk ideas and suggestions. 😊\n\nNow that Season 2 has launched and you’ve had a chance to play the with the new game modes and content, we want to hear what do you most want to see added to Skull and Bones?\n\n\n\nPost your ideas and suggestions in this thread. You like an idea/suggestion? Then please upvote the comment. It'll help us understand what you would most like to see.\n\nWhilst we may not be able to give you updates on the many suggestions and thoughts you posted on our original thread, our development teams found it helpful and insightful.\n\n\n\n**As before, we welcome any and all ideas and suggestions you may have, and we know some of you have many. But bear in mind that we cannot guarantee that your ideas and suggestions will make it into the game.**\n\n**We continue to want your insights as we work on the future of Skull and Bones, you are part of the discussion, and we look forward to hearing once again what you have to say.**",
        "num_comments": 162,
        "comments": [
            "The ability to salvage equipment that we don’t use or have become obsolete.\n\nOr maybe being able to use lesser materials (I.e. bog iron) to create salvage so we can have more alternatives to create ammo.\n\nHave all equipment be shown in the codex.\n\n  \nHave world spawning rogues have a small chance in dropping rare rogue items of there faction.",
            "All I want is to manage a ship loadout without having to change to the ship",
            "I really like that you added the fast travel to takeover events. I would really like to see additional storage space added. The introduction of new materials,  weapons and such has made it frustrating to manage storage space. Thank you.",
            "My top improvement requests as far as customisation goes:\n\n1. Having flags customisable seperately to the sails. They can still use same set of premade colours/patterns/symbols as sails.\n2. Having nameplates display the ship's given name.\n3. More captain faces.\n4. More colour variations of existing costumes and ship ornaments.",
            "Plundering military forts/ outposts should drop a lot of ammo",
            "Hey Ubi. Loving season 2 so far!\n\nCan we please have better fleet management soon? It is a great new aspect to the game, but the execution could use some work. A separate tab maybe, where we can jump in and edit our ships loadout or cosmetics if we want. It isn’t great to have to completely change ships every time.\n\nIt would also be great if we could have a pirate ledger or something so we could see the breakdown of how our empire is doing. How much Po8 out manufacturers are pulling in, how many mats were making and selling. If we’re in the building-a-pirate-empire game now, let’s lean into it, and let us at least have visuals of the management aspect of it.\n\nLove the game.",
            "Please don't move focus to PvP instead of co-op. By all means add some options but a lot of players play this rather than sea of thieves because they don't want PvP. \n\nAnd please don't tie a load of rewards to it so people feel forced to do stuff they don't enjoy. Give rewards that are available elsewhere in other game modes for solo and co-op players.",
            "For the Future I would like to see Special events where the player is able to take command of a Large Vessel.\nI know currently Large vessel pose difficulty to implement especially as player owned vessels. so this is a chance to Test the Vessels in Player hands without immediatly throwing them in for everyone to use all the time.\n\nThose Events could either be PvE or PvP orientated and should Involve several players.\nAs an Example for a PvE event, it could be a Convoi Going out from Saint Anne to New York to secure Teulings and Scurlocks Trade. Now the Player gets the Ability to steer one of Teulings Cargo Vessels (a Fluyt or Corvette with stronger Weapons than the player can currently have) and try to bring it to safe havens. It should be attractive for other players to Help the Player reach the Destination while plenty of AI ships keep attacking the Player controlled convoi. To further improve teamplay, the Ship should boost combat ability as Long as they sail in Formation which adds more depth to the current PvE gameplay.\n\nthis way it would be a Teaser for the future and a way to test around and gather feedback about Large ships.",
            "Hey Devs, feedback for right now is that keep continuing the amazing work you do and we appreciate you guys! The only thing we’re having issue with rn is like I asked/commented yesterday in the stream that the bounty timers are currently not resetting every 30 minutes and the Mega Lestari is currently not giving out chest after you did the bounty already once. It will only give out 10k silver rn! So if you guys please fix that asap it would be AMAZING! Also I LOVE THE FAST TRAVELLING TO EVENTS 🏴‍☠️❤️.",
            "A group finder for several activities (fort, season boss, bounty, …) would be nice. I had it many times that you take a season boss bounty but if you are unlucky no one on your server want to do it. \n\nThe chat function is flooded with the „not all players may have the chat enabled“ error and it is in general very inactive. \n\nMore customisation for the captains (faces, beards, faces, full body tattoo) would be nice.\n\nThe fleet management is too clunky. I need equipment management available for all ships without changing the ship. Also it is annoying that I see all ships asigned to manufactories in the change ship screen. I cant equip them so dont show them please. Would make the screen more clean. \n\nSmall ships need a buff in some way. They still feel too weak in comparison to the greater ships. \n\nThe upgrade costs are a bit too high in my opinion. \n\nCulverins need a buff. Actualy they are not realy viable. \n\nIn general I have to say thanks for the great game so far. I love it. Keep up the good work <3\n\n___________\nedit: typos"
        ]
    },
    "Casual Corsairs are still here and still ruling the Indian Ocean in Season 2": {
        "title": "Casual Corsairs are still here and still ruling the Indian Ocean in Season 2",
        "score": 22,
        "url": "https://www.reddit.com/gallery/1dljwkz",
        "content": "",
        "num_comments": 7,
        "comments": [
            "I've been with the Corsairs for quite awhile now and it's an amazing community full of great people always supporting each other one of my favorites moments was when we went out ship hunting from one end of the map to the other and we finished by first plundering I never really joined a dedicated group before but they are very welcoming truly the best community out there",
            "Cheers fleet mates 🍻",
            "Wish I was cool enough to join yall!",
            "Does it matter if you can't play often and how do you join?",
            "Happy you had a nice time bubs, but even my eyes were out of breath after reading that. Punctuations are a gift, not a curse.",
            "You can if ya want to join up",
            "You're not worthy"
        ]
    },
    "Pics :)": {
        "title": "Pics :)",
        "score": 5,
        "url": "https://www.reddit.com/gallery/1dls466",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "I never gotthe Ebon Courtier crew skin when I purchased Smuggler's Pass. How do I get it now?": {
        "title": "I never gotthe Ebon Courtier crew skin when I purchased Smuggler's Pass. How do I get it now?",
        "score": 2,
        "url": "https://www.reddit.com/r/SkullAndBonesGame/comments/1dlv6u9/i_never_gotthe_ebon_courtier_crew_skin_when_i/",
        "content": "So, I purchased the Smuggler's Pass a while ago, and recently realized I never got the crew skin that it was supposed to come with. In the ship cosmetics, it says it was supposed to come in the in-game mail, but either I never got it or it glitched. How do I go about getting it to resend it so that it can be equipped?",
        "num_comments": 2,
        "comments": [
            "I think it’s doing this for everyone who got it. At least it’s been that way for me since day 1 of S2.",
            "I've heard of others with this issue, but it worked fine for me, and I don't even use it lol"
        ]
    }
}