{
    "Share your ideas - Post Season 2 Launch": {
        "title": "Share your ideas - Post Season 2 Launch",
        "score": 41,
        "url": "https://www.reddit.com/r/SkullAndBonesGame/comments/1djj88c/share_your_ideas_post_season_2_launch/",
        "content": "https://preview.redd.it/lov3h2qb3j7d1.png?width=1920&format=png&auto=webp&s=642d3659a7d23394c55542caee7bd7508fe15250\n\nGreeting Captains!\n\nWe’re back again to talk ideas and suggestions. 😊\n\nNow that Season 2 has launched and you’ve had a chance to play the with the new game modes and content, we want to hear what do you most want to see added to Skull and Bones?\n\n\n\nPost your ideas and suggestions in this thread. You like an idea/suggestion? Then please upvote the comment. It'll help us understand what you would most like to see.\n\nWhilst we may not be able to give you updates on the many suggestions and thoughts you posted on our original thread, our development teams found it helpful and insightful.\n\n\n\n**As before, we welcome any and all ideas and suggestions you may have, and we know some of you have many. But bear in mind that we cannot guarantee that your ideas and suggestions will make it into the game.**\n\n**We continue to want your insights as we work on the future of Skull and Bones, you are part of the discussion, and we look forward to hearing once again what you have to say.**",
        "num_comments": 193,
        "comments": [
            "All I want is to manage a ship loadout without having to change to the ship",
            "I really like that you added the fast travel to takeover events. I would really like to see additional storage space added. The introduction of new materials,  weapons and such has made it frustrating to manage storage space. Thank you.",
            "Plundering military forts/ outposts should drop a lot of ammo",
            "Please don't move focus to PvP instead of co-op. By all means add some options but a lot of players play this rather than sea of thieves because they don't want PvP. \n\nAnd please don't tie a load of rewards to it so people feel forced to do stuff they don't enjoy. Give rewards that are available elsewhere in other game modes for solo and co-op players.",
            "Hey Devs, feedback for right now is that keep continuing the amazing work you do and we appreciate you guys! The only thing we’re having issue with rn is like I asked/commented yesterday in the stream that the bounty timers are currently not resetting every 30 minutes and the Mega Lestari is currently not giving out chest after you did the bounty already once. It will only give out 10k silver rn! So if you guys please fix that asap it would be AMAZING! Also I LOVE THE FAST TRAVELLING TO EVENTS 🏴‍☠️❤️.",
            "I want one simple thing (don’t know if it’s on a road map or not).\n\nI want ship cargo loadouts.  If I switch ships with different weapon loadouts having to go through and clear out the ammo not being used and add ammo that wasn’t on my current ship is annoying, especially if I am trying to quickly switch out for different missions.",
            "Random and different sea monster encounters while sailing instead of having them as a quest or bounty.",
            "Springloader but with a harpoon that latches on to enemy ships and keeps them in the circle",
            "You can add some more historical decorations to the store, such as decorative carvings from the Sovereign of the Seas. We already have a lot of fantasy decorations.",
            "To make a space like this for the Latin American community that does not speak English and to be able to have a greater participation or contribution of ideas, thank you"
        ]
    },
    "Maintenance 25th June": {
        "title": "Maintenance 25th June",
        "score": 26,
        "url": "https://www.reddit.com/r/SkullAndBonesGame/comments/1dnfknj/maintenance_25th_june/",
        "content": "https://preview.redd.it/1545i6e6aj8d1.png?width=1920&format=png&auto=webp&s=5f406ec76c373f6b627435c1af32c85e83ccb4e8\n\nCaptains, a maintenance is incoming. Tuesday, June 25, the Indian Ocean of Skull and Bones will be temporarily unavailable.\n\n⏰ 8AM CEST / 4PM AET / (24 JUNE) 11PM PT\n\n⏱ \\~1hr 15mins\n\nYou will be docked at the title screen if you are playing when the maintenance starts.\n\nThe damage mitigation changes have been delayed for a future update.\n\nDuring this maintenance the Dragon Regatta rewards will be sent out, be sure to check your mailbox to claim these.\n\nUpdate 2.1.3 will deploy improved server stability and fix an issue where the cooldown period of all Bounty Contracts was still 12 hours instead of 30 mins (as intended in Update 2.1).",
        "num_comments": 39,
        "comments": [
            "Any patch notes yet? I would love the chest pity system as I've opened over 150 Fara convoy chests and still not had the Boatswain Toll!",
            "Theres still an empty trunk in my warehouse I can't do anything with 😡",
            "Maybe we will get some ice?",
            "@UbiNeptune can we please have the le peste fight be a contract instead of having to fight his people to farm.",
            "Can you make destroying ships worth more. It's really boring converting and collecting and trading helm materials just for silver. Shouldn't destroy a lvl 12 ship and get 200 silver.",
            "Y los cofres de lestari?",
            "I’d love to see a response also.",
            "Honestly was hoping they would of said something about it this week but looks like we are stuck waiting another week. Or maybe they will fix it but just not telling us :/",
            "I very much would like to know too.  Or at least if the monster will be extended.",
            "We are indeed aware of this issue, it has not been addressed with this maintenance but we hope to deploy a fix soon."
        ]
    },
    "By The Powers I Got One!": {
        "title": "By The Powers I Got One!",
        "score": 13,
        "url": "https://www.reddit.com/r/SkullAndBonesGame/comments/1dr8dhz/by_the_powers_i_got_one/",
        "content": "I managed to do a Cutthroat Cargo and get hold of a very old treasure map again. I found the chest, opened it up and looked at the text that appears bottom right, showing the chest contents. Just as I was thinking: \"Oh well, throw another Bombard Powderhouse on the growing pile of scrap\" a large animated spinning icon appeared at the top of the screen, announcing the new found worthy booty: Dardanelles Gun! It's a beast of a weapon! I've replaced my Mons Meg 3 on the bow with it but I want more for the side guns now lol. Must have taken me around 12 to 15 attempts to get it with the Cutthroat Cargo missions.\n\nhttps://reddit.com/link/1dr8dhz/video/g1zhiyt9ph9d1/player",
        "num_comments": 7,
        "comments": [
            "Got my first today too. Looking forward to breaking it in.",
            "They definitely are beasts. Have had them on the sides and rear for awhile now and they just tear ships apart. Combine that with the power of the War Hammer, you've got yourself a ship to be reckoned with.",
            "Great weapons. Them all firing at once is good but dangerous sometimes. I have about 7 of them. Sitting on fleet ships lol",
            "lol smooth moves there, Captain....",
            "I got one aswell, where is the best place to put it?",
            "Excellent!",
            "Nice, congrats. I want one so bad. Joining in S2 kinda sucks sometimes.\n\nHow many different items can appear in the Cutthroat treasure chests? I'm trying to understand the odds of getting a specific item here."
        ]
    },
    "New shots for a new day": {
        "title": "New shots for a new day",
        "score": 10,
        "url": "https://www.reddit.com/gallery/1dr7mw6",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Best Po8 ship": {
        "title": "Best Po8 ship",
        "score": 3,
        "url": "https://www.reddit.com/r/SkullAndBonesGame/comments/1draa70/best_po8_ship/",
        "content": "I was wondering what Is the best ship to choose to assign it to a Po8's route. Perhaps the Padewakang? And should i upgrade It?",
        "num_comments": 5,
        "comments": [
            "goes by ship level. anything level 11 on up pretty much except for some level 10 factories that say level 14 required.",
            "IIRC Padewakang is the most efficient for material cost\n\nAs was stated, po8 capacity is based on ship level with 610 being the max so get your ships to lvl 11",
            "I have 30 padewakang ships in my fleet for po8 collection. Easiest ships to make. Just gotta get them to level 11",
            "It really doesn’t have much to do with lvl of factory. It’s mostly distance needed to travel to telok or Anne",
            "Truth"
        ]
    }
}