{
    "Post flairs are here!": {
        "title": "Post flairs are here!",
        "score": 18,
        "url": "https://www.reddit.com/r/skyrim/comments/1d5lmcx/post_flairs_are_here/",
        "content": "Hello, Community!\n\nA little over a month ago we released [a poll ](https://new.reddit.com/r/skyrim/comments/1cfe9m0/poll_should_rskyrim_have_post_flairs/) asking whether you’d be interested in having post flairs on the subreddit. The results were very clear: You supported post flairs, but they had to be optional.\n\nHaving optional flairs means that it’s up to you to decide whether you want to use them. We encourage everyone to do so but rest assured that you will not be reprimanded for not using them. The flairs are simply to make it easier for people to filter through the content they want to see.\n\n# Post flairs on r/Skyrim\n\nWe have introduced the following post flairs:\n\n* **Discussion**: For general discussions about the game. This could be discussions about your favorite questline, character, item, etc.\n* **Question**: Similar to the above but used with the intention of asking for help related to gameplay. Maybe you’re wondering how to level a skill most efficiently, how to make lots of money, how to defeat a certain boss, etc.\n* **Bug Help**: A flair to show that you need assistance with a game bug.\n   * Note: The [UESP Wiki](https://en.uesp.net/wiki/Main_Page) contains many lists of bug fixes. Every quest has its own dedicated page too. If you need help solving a bug, consider checking the relevant page too. For example, if you run into one of the many bugs in the Blood on the Ice quest, go [here](https://en.uesp.net/wiki/Skyrim:Blood_on_the_Ice) and look for the \"Bugs\" section.\n* **Lore**: For discussions about the amazing lore found in the Elder Scrolls universe! How did the Dwemer disappear? What really happened to the ancient Snow Elves? Who was Talos really?\n* **Arts/Crafts**: For you to show off your crafts! Arts, tattoos, woodworking, etc. Everything goes as long as it's directly related to Skyrim. Do keep rule 10 (Limit Your Self Promotion) in mind, though.\n* **Screenshots/Clips**: A flair for posts featuring game screenshots and clips. Show off your character, your cool items, or how you’ve killed Nazeem for the 10th time (today).\n* **Modding**: For posts that deal with modding. This could be asking for recommendations, posting reviews, or general discussions about modding.\n   * Be aware that if you seek modding support (e.g. solving conflicts or incompatibilities), r/skyrimmods is a better place to post. It’s totally fine to ask for support here, but the modding subreddit is generally more knowledgeable about modding. You’re more likely to get professional help there from people that have the necessary experience and know-how. Posts with the “Modding” flair will be met by an AutoMod message echoing this.\n\n# Feedback\n\nIf you have any feedback on post flairs, feel free to comment below or write us through Modmail! We’re open to ideas (or criticism, should you have any). We'll make sure to do our part in monitoring the use of flairs and conversations about them.\n\nHave a nice weekend, everyone!",
        "num_comments": 4,
        "comments": [
            "Can there be multiple bug help flairs? Not everyone is willing or able to use console commands or mods to fix a bug, so it'd be helpful if there was something that would let us know whether the OP is open to a solution using either of those.\n\nAnd would it be possible to have the automod reply to bug help posts with a link to UESP?",
            "On old reddit, they're just plain text on white. They could do with prettying up.",
            "I'll speak with the team about the first one and see if we can find a way to implement it that makes sense.\n\nThe second one about linking to the UESP should be simple, though. I'll take a look at it.",
            "Thanks for the heads-up. I'll see if we can do something about that."
        ]
    },
    "So I finally got skyrim again after like 2 years of not playing and I came across this, wtf is a “soul tomato”": {
        "title": "So I finally got skyrim again after like 2 years of not playing and I came across this, wtf is a “soul tomato”",
        "score": 449,
        "url": "https://i.redd.it/77cz1qbpl18d1.jpeg",
        "content": "",
        "num_comments": 61,
        "comments": [
            "OP it doesn't look like the soul tomato is your main concern in this moment",
            "It's a soul gem looking like tomato, part of Saints & Seducers Creation Club content.",
            "It is a courtesy of Sheogorath. Don't question it, lest you want him to make rope from your entrails.",
            "Anyone gonna talk about the giant about to use the OP as skyrim first golf course.",
            "Btw the giant almost killed me but I tanked the hit because I’m him",
            "The organic equivalent of a grand soul gem.",
            "Vegan soul gem 🤣",
            "If a gem can be used as a lattice to store a soul than the intricate workings of a tomato can also be used as a soul gem. Sheogorath thinks soo too!",
            "Eat it! Also just finished doing the thief guild quest.",
            "In short, that giant could live inside that\n\n\nAlso damn, gatekeeping meridia from her beacon for over 2 years"
        ]
    },
    "This is a conspiracy? I found her dead in her parents house?": {
        "title": "This is a conspiracy? I found her dead in her parents house?",
        "score": 372,
        "url": "https://i.redd.it/jixdx558u08d1.jpeg",
        "content": "",
        "num_comments": 23,
        "comments": [
            "One of her daughter dies from blood on the ice. Another one dies when you do the optional step from the Markarth dark brotherhood contract. Tova is their mum and she commits suicide due to the grief.",
            "she has a letter around or on her",
            "OP, you straight up destroyed her life. This is the result",
            "Conspiracy? You killed her daughter dude",
            "OP, what have you done...",
            "It's not a conspiracy. One of her daughters is killed by a murderer on the loose and then you kill her other daughter if you join the dark brotherhood. She's so full of grief she kills herself.",
            "This is why I never do that optional objective, that ring is not worth it man",
            "I never kill Nilsine but a bug makes her count as dead sometimes when you do another quest, and her mom kills herself. A lot of people have never killed her and had Tova die on them, not knowing why.",
            "Her parents house? She *is* the parent",
            "When you talk to Muiri in Markath, she says that she was a friend of the family but after Alain Dufont (who is the primary target of her contract) used her to get close to the family and then robbed them. She fell in love with him and was an innocent dupe but they still blamed her and cast her out.\n\nThat said, if you kill the daughter that was her friend then the mom commits suicide.\n\nI wouldn’t wish any of that on anybody, but the Shatter Shields weren’t exactly saints to begin with."
        ]
    },
    "I just realized that that number is the amount of saves I have, lmfao.": {
        "title": "I just realized that that number is the amount of saves I have, lmfao.",
        "score": 241,
        "url": "https://i.redd.it/ap0psq1oh18d1.jpeg",
        "content": "And no comments about the coloring. I know it's fucked up lol. My old cord just broke and I'm using the AV one that,  for some reason,  switches blue and green, lol. Until Amazon sends me my new one. As for the amount of saves. I'm Gen X. I grew up with Atari, Nintendo, Sega, stuff like that when, in the beginning,  no such things as saves. Especially arcade games. So now I am so adamant about saving and not wanting to redo shit, I save like a madman, lol\n Anyway. Just wanted to share this little bit with all of you. Any from my generation wanna comment on how it sucked to not be able save and we had to wait for stupid passwords to be invented to at least have some save point, please post, lol. ",
        "num_comments": 41,
        "comments": [
            "Damn that calculator can run Skyrim?!",
            "https://preview.redd.it/13meod7f928d1.jpeg?width=1284&format=pjpg&auto=webp&s=d5356d3f48985e891082c8efd0d149d31b6da6ff",
            "https://preview.redd.it/gs3xe1akd28d1.jpeg?width=677&format=pjpg&auto=webp&s=e8728455c99b7609a557ee50909c22315b56f61c",
            "Im surprised after that many saves you haven't crashed your game and made it unplayable.",
            "![gif](giphy|w0vFxYaCcvvJm|downsized)",
            "Do you get this image off a 10y/o CCTV camera?",
            "https://preview.redd.it/ebwlzw71l28d1.jpeg?width=96&format=pjpg&auto=webp&s=bba26a1f69ffb52057aebff8f07502f64e721718",
            "https://preview.redd.it/c3opr53p638d1.png?width=853&format=pjpg&auto=webp&s=27258a67a5ae5687943c7829b4742b5d297b1471",
            "https://preview.redd.it/1h4c8xf2m28d1.jpeg?width=298&format=pjpg&auto=webp&s=289d9c05e9a4b4691f8658037147da6fbade1121",
            "https://preview.redd.it/k5b9zm5pd38d1.jpeg?width=748&format=pjpg&auto=webp&s=cf9e5290c704fbbdcb57811354c978821ca7e7ec"
        ]
    },
    "Made swords for my adopted daughters": {
        "title": "Made swords for my adopted daughters",
        "score": 379,
        "url": "https://www.reddit.com/gallery/1dlj50n",
        "content": "",
        "num_comments": 38,
        "comments": [
            "I enchanted two flawless orcish daggers for them with burning damage and they took down an attacking Giant at Lakeview together, I was a proud Skyrim parent that day.",
            "I did not know you could do this. Do they accept jewellery? Do they just accept the wooden sword as a weapon or can I give em like, a warhammer?",
            "LOL Sophie’s Choice is such a good name",
            "Basically, you gave her a tazer.",
            "I really wish they could grow up",
            "I can't help but adopt Sophie, she's gonna just die on those streets alone.",
            "Well...hopefully they don't play fight each other...",
            "That is an absolutely awesome idea. I'm stealing it.",
            "I like to give my kids daggers.",
            "I did that too but I named them Au Pair and Nanny"
        ]
    }
}