{
    "Simple Questions and General Discussion Thread": {
        "title": "Simple Questions and General Discussion Thread",
        "score": 3,
        "url": "https://www.reddit.com/r/skyrimmods/comments/1dhq76c/simple_questions_and_general_discussion_thread/",
        "content": " Have any modding stories or a discussion topic you want to share? \n\n   Want to talk about playing or modding another game, but its forum is deader than the \"DAE hate the other side of the civil war\" horse? I'm sure we've got other people who play that game around, post in this thread!\n\n   [List of all previous Simple Questions Topics](https://www.reddit.com/r/skyrimmods/search?q=author%3AThallassa%20title%3A%22Simple%20Questions%20and%20General%20Discussion%20Thread%22&restrict_sr=1).",
        "num_comments": 31,
        "comments": [
            "I was looking for quest mods and a lot of people suggested Death Consumes All, so I grabbed it. It took me a long time to find the NPC to start the quest, so I did other quests with tough enemies in the mean time. Those tough enemies all dropped this thing called Blood of Energy and I had no idea what it was for, so I held onto all of them in case they were important. \n\nThey were. >!I finally started Death Consumes All and discovered that they're used to unlock the story. So I used them. All 40 of them. And fast tracked all the way to the end of the quest while I dicked around in the wilderness, listening to the tale. I was so confused when other players were talking about a Riverwood portion or needing to do the College of Winterhold questline. Apparently, I skipped it all and went straight to the brutally difficult endgame. I still occasionally find places where the mod's assets were used, presumably to tell the actual story lol!<\n\nAt least I saved a lot of people, I guess?",
            "What would I have to do to make a magic effect hit only npc's that I'm fighting against? I'm currently in the creation kit looking to add a condition to an AoE magic effect that damages (similar to fireball). I'm not at all sure which effect would be the correct one, or if this is even  the correct approach. I could use some help.",
            "Is there anything to help with perk tree layout that I'm missing? I want to align the perks I'm making with the tree image, so far what I had been doing is using the command to reload mods mid game",
            "i aksed this yersterday but it didnt get answered so...\n\nis {{precision}} going to mess up the attack hitboxes? like make it so i have to be closer to hit things.",
            "I have never really used Wabbajack or Collections on Nexus, so this might be a dumb question:\n\nIs there like a collection for like just adding weapons and armor? I have my mod list set up the way I like it, but if I want some new weapons I don't want to have to add 40 different mods to fill out my options. \n\nI wish there was a \"click this to add in a whole bunch of high quality weapons and armor all in one go\" sort of option.\n\nCan someone smarter than me educate me on this topic?",
            "When I want to start a new game with a new LO on PC, what do I have to do? On Xbox there’s a whole process of deleting your save games, deleting your mods, and then deleting your “reserve space”, which on console is where the game puts all of your mods and Creation Club content. But on PC is it just as easy as clicking New Game?",
            "[deleted]",
            "How incompatible really is immersive citizens with other city mods? I like to use the two Capital City mods and then fill in with Dawn of Skyrim DC for the major cities (with The Great Cities as my minor cities/towns)\n\nI would imagine that I would not work well at all with something like the Capital Whiterun mod since it changes so much of that city. But I'm curious what others have found recently. Like how much are the precautions on the mod page to cover the author's ass?",
            "DrPharmDawg's mods are hidden from their page. Have they removed them permanently? like did something happen, or are they just like doing some edits or something?",
            "Is there a mod that will allow me to start the game midway through? I started a completely vanilla playthrough and I want to add mods but a lot of them require me to start a new game. I'd like to keep my character and progress but I dont know if it's possible. I know I could use console commands to get my level and perks back, but is there a way for me to start with certain quests already completed?"
        ]
    },
    "Updated information about the new Skyrim update v1.6.1130": {
        "title": "Updated information about the new Skyrim update v1.6.1130",
        "score": 666,
        "url": "https://www.reddit.com/r/skyrimmods/comments/18btob5/updated_information_about_the_new_skyrim_update/",
        "content": "Recently, Bethesda released a large update with a new marketplace, a few new features, and some bug fixes. It also launched the new Verified Creator program that introduces paid mods via Bethesda.net. Here is what we know as of Feb 10, 2024:\n\nThe Patch notes and change log\n===\nThis update is versioned 1.6.1130. Here is the the [official patch notes from Bethesda](https://elderscrolls.bethesda.net/en/article/4ORD7tshfmHUN8H4ULSgE4/the-elder-scrolls-v-skyrim-special-edition-creations-update-patch-notes).\n\nJanuary 17, 2024 Update\n===\nBethesda announced that another update (after 1.6.1130) will be released on January 17, 2024 at 11 AM (US Eastern time). This update will roll out on GOG, Epic Store, Bethesda Net, Xbox, and PlayStation first, with the Steam release coming later on:\n\n> Happy Tuesday everyone!\n\n> We're planning on patching Skyrim on January 17th at 11:00am EST. Please note, that this patch will only apply to GOG, Epic Store, Bethesda Net, Xbox, and PlayStation. The Steam version of the patch will have a slight delay and be applied after. Our patch notes will be shared here as soon as they are finalized. Thanks for your patience!\n\nHere is the [announced patch notes](https://www.reddit.com/r/skyrimmods/comments/198sr58/skyrim_special_editionanniversary_edition_january/?) for the update.\n\nThe \"ESL\" form ID increase\n===\nThis is actually only tangentially related to ESLs, as all plugin types now get 2048 addition form IDs to use.\n\nPreviously, Skyrim's ESL-flagged plugins only had 2048 form IDs to work with: 0x800-0xFFF. This is due to a Skyrim engine bug that reserved form IDs 0x0-0x7FF from all plugins when it should only be reserved from Skyrim.esm. Now the range of 0x0-0x7FF can be used by plugins other than Skyrim.esm, which means increasing the number of form IDs available to all plugins by 2048, and doubling the amount of new forms that can be stored in ESL-flagged plugins.\n\nThis was previously fixed on Fallout 4, and has been ported back to Skyrim for the v1.6.1130 update.\n\nThe issue with this fix is any new plugins, not just ESL-flagged plugins, can now be made with form IDs in the 0x0-0x7FF range. If an old SkyrimSE.exe, such as downgraded, VR, or GOG versions of the game, loads these new plugins, the game will immediately crash. There are no mods that use these new form IDs yet. The concern is that future mod makers might make plugins using form IDs in this range, which will not be backwards compatible with downgraded, VR, or GOG versions of the game.\n\nHowever, a more immediate concern is Bethesda shipped a \"_ResourcePack.esl\" with the v1.6.1130 update. This plugin uses form IDs in the 0x0-0x7FF range. So if you try to load this \"_ResourcePack.esl\" file from a downgraded (or GOG, VR) exe, your game will immediately crash. If you crash with address `SkyrimSE.exe+0198090`, `SkyrimSE.exe+0197E90` or `SkyrimSE.exe+05E1F22`, this might be the cause. **[Nukem](https://www.nexusmods.com/skyrimspecialedition/users/4995023) has released a SKSE plugin DLL that will allow 0x0-0x7FF and v1.71 plugins to be loaded on older exes: [Backported Extended ESL Support](https://www.nexusmods.com/skyrimspecialedition/mods/106441).**\n\nSKSE and Address Library\n===\nSKSE and [Address Library](https://www.nexusmods.com/skyrimspecialedition/mods/32444) has already been updated for the v1.6.1130 update. However, there appears to be lingering problems with these updates.\n\nAddress Library is in a testing phase, and [powerofthree](https://www.nexusmods.com/skyrimspecialedition/users/2148728) has reported that many existing SKSE DLL mods do not work with it. This is because this update, although smaller than the \"AE\" update from 2021, is still bigger than what Address Library can fully handle: there have been some ID changes and game structure changes that break stuff.\n\nOf course, any other DLL mod that doesn't rely on Address Library will need to be updated for the new v1.6.1130 version to work with that version. This includes [RaceMenu](https://www.nexusmods.com/skyrimspecialedition/mods/19080) and [Faster HDT-SMP](https://www.nexusmods.com/skyrimspecialedition/mods/57339)\n\nSkyUI\n===\nPeople were reporting that [SkyUI](https://www.nexusmods.com/skyrimspecialedition/mods/12604)'s and **difficulty selection** and **search bar** functionalities were not working with the new v1.6.1130 update.\n\n**Update:** What appears to have happened is that when Bethesda added the **marketplace** menu entry, they inserted it into the middle of an [enumerated type](https://en.wikipedia.org/wiki/Enumerated_type) definition used for communication between the game exe and flash. This caused all subsequent items in the enum to be offset. Skyrim uses flash for UI, so these changed offsets are no longer compatible with SkyUI.\n\nAs of SKSE v2.2.5, SkyUI's **search bar** functionality has been fixed.\n\nv1.6.1130's **difficulty selection** bug with SkyUI has been fixed with [SkyUI SE - Difficulty Persistence Fix](https://www.nexusmods.com/skyrimspecialedition/mods/106418)\n\nControl Map\n===\n**Update:** If you had a custom controlmap.txt from a mod, the game is reported to crash when you try to run the new v1.6.1130 update.\n\nThe cause of this, like with SkyUI, is the addition of the marketplace entry to the control map. If this entry is missing, as the case with old control maps, the game will crash.\n\n**Update 2:** As of SKSE v2.2.5, the controlmap.txt crash has been fixed.\n\nSSE Engine Fixes and plugins.txt loading\n===\n**Update**: People have been reporting that [SSE Engine Fixes](https://www.nexusmods.com/skyrimspecialedition/mods/17230) breaks plugins.txt loading with Engine Fixes versions 6.1.0 and older, which means your plugin load order is not loaded correctly by the game. This appears to be due to SSE Engine Fixes's achievement enabler. To fix this, update Engine Fixes to v6.1.1 or above\n\nPlugin version 1.71\n===\nBethesda also incremented the plugin version from 1.7 to 1.71. Any plugin made with this version specified in the header will also crash any older version exes such as VR, GOG, and downgraded Steam SkyrimSE.exe. No mods are using this version number yet. However this is the version number of the the updated free Fishing Creation's plugin (ccBGSSSE001-Fish.esm), and as such, running older exes with the up-to-date Fishing Creation will immediately crash the game. If you crash with address `SkyrimSE.exe+0198090`, `SkyrimSE.exe+0197E90` or `SkyrimSE.exe+05E1F22`, this might be the cause.\n **[Nukem](https://www.nexusmods.com/skyrimspecialedition/users/4995023) has released a SKSE plugin DLL that will allow 0x0-0x7FF and v1.71 plugins to be loaded on older exes: [Backported Extended ESL Support](https://www.nexusmods.com/skyrimspecialedition/mods/106441).**\n\nThe latest Unofficial skyrim special edition patch has also been updated to this plugin version. If you're using an older exe, you can fix by either reverting to an [earlier version](https://www.nexusmods.com/skyrimspecialedition/mods/266?tab=files&file_id=392477&nmm=1), editing the plugin version to 1.7 in the header with SSEedit, or by using [Backported Extended ESL Support](https://www.nexusmods.com/skyrimspecialedition/mods/106441).\n\nSteam integration is missing\n===\n\nIt appears that Skyrim Special Edition v1.6.1130 shipped without Steam integration. So this version of the game effectively has no DRM. Achievements also don't work with v1.6.1130.\n\nIt is expected that Bethesda will ship an update in the near future to address this.\n\n---\n\nVerified Creator (paid mods) program\n===\nBethesda also rolled out a Verified Creator Program to Bethesda.net. Mod makers can now apply to become a \"verified creator\" with Bethesda. If approved, they will be allowed to upload mods on Bethesda.net and charge users creation club credits. You can find the official description of the program here: [Bethesda Game Studio Creations](https://creations.bethesda.net/en/creators/bethesdagamestudios)\n\n**Current paid mods**\n\n* [Shadetree Lodge](https://creations.bethesda.net/en/skyrim/details/5492/Shadetree_Lodge) by [Elianora](https://creations.bethesda.net/en/skyrim/all?author_displayname=TheRealElianora) for 500 credits (approximately $5)\n* [Aldmeri Anti-mage](https://creations.bethesda.net/en/skyrim/details/5486/Aldmeri_Anti_mage) by [Niero](https://creations.bethesda.net/en/skyrim/all?author_displayname=Niero) for 400 credits (approximately $4)\n* [Arquebus](https://creations.bethesda.net/en/skyrim/details/5463/Arquebus) by [Shoeburglar](https://creations.bethesda.net/en/skyrim/all?author_displayname=Shoeburglar) for 600 credits (approximately $6)\n* [Legendary Dungeons: Dwarven Delves](https://creations.bethesda.net/en/skyrim/details/5401/Legendary_Dungeons__Dwarven_Delves) by [Trainwiz](https://creations.bethesda.net/en/skyrim/all?author_displayname=Trainwiz) for 400 credits (approximately $4)\n* [Katja The Thief](https://creations.bethesda.net/en/skyrim/details/5291/Katja_The_Thief) by [unoctium](https://creations.bethesda.net/en/skyrim/all?author_displayname=unoctium) for 400 credits (approximately $4)\n* [Winterfrost Plus Edition](https://creations.bethesda.net/en/skyrim/details/5584/Winterfrost_Plus_Edition) by [TheDogOfWar](https://creations.bethesda.net/en/skyrim/all?author_displayname=TheDogOfWar) for 600 credits (approximately $6)\n* [Winterfrost (PS4)](https://creations.bethesda.net/en/skyrim/details/5585/Winterfrost) by [TheDogOfWar](https://creations.bethesda.net/en/skyrim/all?author_displayname=TheDogOfWar) for 500 credits (approximately $5)\n* [East Empire Expansion](https://creations.bethesda.net/en/skyrim/details/5294/East_Empire_Expansion) by [kinggath_creations](https://creations.bethesda.net/en/skyrim/all?author_displayname=kinggath_creations) for 700 credits (approximately $7)\n* [Morthal](https://creations.bethesda.net/en/skyrim/details/5516/Morthal) by [Arthmoor](https://creations.bethesda.net/en/skyrim/all?author_displayname=Arthmoor) for 200 credits (approximate $2)\n\n**Bethesda/Creator monetization split**\n\nWe have inquired both the paid mod authors and Bethesda about the details of the split. However, neither parties have been willing to divulge the details. We have not seen any claims about the split that is credibly sourced elsewhere on the internet.\n\n**Support for paid mods**\n\nIt appears that there is currently no official support channels for paid mods on Bethesda.net. Users cannot rate or comment on paid mods. All support for paid mods are currently being handled unofficially, such as via the authors' discord servers.\n\nIt should also be noted that paid mods are not considered official Bethesda content like previous Creation Club add-ons and will disable achievements like free mods by default.\n\n**What is allowed on paid mods**\n\nComments from official Bethesda sources indicates that paid mods are limited in the following ways:\n\n* They cannot rely on any other mods or resources and must be standalone. This means they cannot use [SKSE](https://skse.silverlock.org/), must use vanilla body, and cannot use frameworks such as [Open Animation Replacer](https://www.nexusmods.com/skyrimspecialedition/mods/92109) or [Spell Perk Item Distributor (SPID)](https://www.nexusmods.com/skyrimspecialedition/mods/36869), for example. This also means any compatibility patching must be done elsewhere as separate free mod.\n* They must be new. Mod authors cannot make an existing mod a paid mod. Any collaborative work must be handled outside of Bethesda.net among the contributors themselves.\n* They cannot use generative AI.\n* They must adhere to Bethesda.net community standards. This means, for example, paid mods cannot contain nudity.\n* Since paid mods are delivered via the in-game menu, they are not fully supported by mod managers such as Mod Organizer 2 or Vortex. This also means they cannot contain installers for automatic patches or options.",
        "num_comments": 500,
        "comments": [
            "small list of mods that no longer work\n\n&#x200B;\n\nhttps://preview.redd.it/6nu45ivm2m4c1.png?width=402&format=png&auto=webp&s=b2a1bf4b3ee16a7693b93239a008dc64e259e42b",
            "according to the comments on racemenu, the author posts updates on his paid patreon and nexus gets them a week later",
            "And this is why I hate a 12 (or 7, depending on your point of view) year old game getting an unnecessary and money-driven update.",
            "Man, I'm over this. I've been modding skyrim for years now and I'm so tired of having to downgrade, remove mods, fix mods, wait for mods to be updated, etc. There's no good reason why they need to keep updating the game while breaking so many core mods. \n\nThey claim to love the modding community but they clearly don't care. They're just trying to milk CC store money while breaking the game for all the people who have kept Skyrim alive all these years.",
            ">Address Library is in a testing phase, and powerofthree has reported that many existing SKSE DLL mods do not work with it. This is because this update, although smaller than the \"AE\" update from 2021, is still bigger than what Address Library can fully handle: there have been some ID changes and game structure changes that break stuff.\n\nWelp. I was just about to start modding Skyrim again. Guess I'll be putting the game off again for a couple of months.",
            "Why are they fucking with a 12 year old single player game by still pushing updates? I dont understand it?",
            "Bethesda freaking fragmenting their own game. Now we have LE, SSE 1.5.97, AE upto 1.6.659 and AE 1.6.1130.",
            "This new update seems like it'll hurt the modding community in the long run, if people actively mod on it. Not really a big fan to be honest.",
            "Man I picked a bad time to start modding the game",
            "Tysm for this 🙏🏻"
        ]
    },
    "Are any of you also unable to quit Skyrim?": {
        "title": "Are any of you also unable to quit Skyrim?",
        "score": 75,
        "url": "https://www.reddit.com/r/skyrimmods/comments/1dlp5fr/are_any_of_you_also_unable_to_quit_skyrim/",
        "content": "I've been playing this game for years like literally since it came out I remember being ten years old (12 years ago) and watching mxr mods all the time wishing I could mod skyrim one day and then when I'm I was fifteen I saved up enough money from working to buy a cheap pc and mod skyrim.\n\nIt's the only game that I've been playing for this long I seriously can't believe I've been playing this game for more than a decade.\n\nEvery single time I rage quit modding and say I'm never going to do it again I literally will come back to it it's like a toxic ex I know it's going to make me mad and but I still come back.\n\nThis time I said I'm never going to play skyrim again after my save got corrupted but a day later and now I'm reinstalling skyrim.\n\nWhat the hell is wrong with us?",
        "num_comments": 58,
        "comments": [
            "Sure, I can quit. I've done it a hundred times ;)",
            "Dude Skyrim is like not addictive. Of course I could quit, i just don't need or want to!   \n  \n*Browse Nexus to install more mods*",
            "Skyrim is my \"comfort game\", so I always come back to it. Last year I uninstalled it because I wanted to clear more 300 GB of space in my HDD then 2 months I had to reinstall everything again lol. Afterwards I bought more storage as well to have room for other games.",
            "The first thing I do when turning on my computer is open nexus, am I cooked?",
            "I don’t need to quit (permanently) since I learned to prioritize my life.\n\n\nThe first step was to learn to stop my Skyrim game and get some sleep.\n\nThe next step was to not start the game till I was caught up on my life stuff for the day and ready to chill.\n\nGood luck 🍀 to you all\n\nEDITED to add:\n\nOh I forgot the most important step:\n\nTo play Skyrim till I was temporarily bored with it\n\nThat’s right I said it:\n\nThe cure to too much Skyrim is more Skyrim",
            "I have only 3 games that I return back to, every time. \n\n1) Skyrim\n2) Rainbow 6 Siege\n3) GTA",
            "Me, me, I might play other games, but eventually I come back to skyrim",
            "I can quit anytime I feel like it.",
            ">What the hell is wrong with us?\n\nWhat I think is going on, is that you realized playing skyrim is now a daily habit of yours and it now how you decompress and relax. Trying a new game maybe for some reason is not as comforting to you, or you want the familiar, or both.\n\nIf you do have positive outcomes from playing skyrim daily, nothing is wrong with that. It only a problem if you realize you do want to play new things or quit but cannot. Do you feel that way?",
            "I just started modding for a month now, and I still comeback after done the campaign"
        ]
    },
    "My horse just said something on skyrim": {
        "title": "My horse just said something on skyrim",
        "score": 154,
        "url": "https://www.reddit.com/r/skyrimmods/comments/1dle5r3/my_horse_just_said_something_on_skyrim/",
        "content": "First, I'm not crazy. 🤪  But my horse said something\"  it was in the subtitles  Verrsia's horse:\"I have everything I need, I don't need you.\"  My companions and I were riding towards Markarth when this happened.  \n\nWhich mod is doing this? I have a few mods but not sure which ones make my horse talk. I even went back to my mods and none say outright, \"your horse will talk\" \n\nIf someone knows please let me know. Either that or something is buggy with my mods or I am going crazy. ",
        "num_comments": 32,
        "comments": [
            "So, this might just be a captioning bug with the game/mods. I have inigo as a follower and he'll say something about sending the enemy's soul to auri-El or some shit. Sometimes it'll say whatever enemy I'm fighting, or my horse, or a different NPC said the line instead of inigo - but I know it's inigos line and they don't actually say the dialogue.",
            "Glad you didn't take it personal and launch him off a mountain",
            "Lmao typical modded experience honestly",
            "Did it actually talk or was it text?? Omg. I would love to have a talking animal mod.",
            "Its fuz-roh-do-h",
            "Somebody needs to lay off the skooma",
            "That'll be the Mr Ed mod.",
            "Do you have Clockwork installed? One of the NPC's says this line verbatim\n\nNo idea why your horse would be saying it, though",
            "For me, the horse talked about hunting and fishing. Never happened with any other mods.",
            "I have that happen with numerous animals. I can't be bothered to figure out which mod is doing it, so I just deal with it."
        ]
    },
    "Mod Release: Inconvenient Tower Of Mzark - An Anti-Quality-Of-Life Mod": {
        "title": "Mod Release: Inconvenient Tower Of Mzark - An Anti-Quality-Of-Life Mod",
        "score": 113,
        "url": "https://www.reddit.com/r/skyrimmods/comments/1dlfbyv/mod_release_inconvenient_tower_of_mzark_an/",
        "content": "[https://www.nexusmods.com/skyrimspecialedition/mods/122406/](https://www.nexusmods.com/skyrimspecialedition/mods/122406/)\n\nHave you ever thought that the quest \"Elder Knowledge\" wasn't enough of a drag as it is? Well now it's even longer! To access the tower of Mzark in Blackreach, you need to get through the Silent City Ruin, and the only easy way to enter Silent City Ruin is through the catacombs.\n\nThis adds very few objects and edits very few things. It's an ESPFE and should be compatible with everything.",
        "num_comments": 6,
        "comments": [
            "Now do the rest of Skyrim",
            "Ayy don't even bother taking a sociopath quiz.",
            "I really enjoy Daggerfall dungeons so this sounds fun.",
            "Remove the open world aspect of skyrim and your main menu is now the map. You can only access other locations after clearing the previous ones or unlocking quest stages.",
            "Dawnguard only starts after all POIs are completed.",
            "That sounds kinda nice to use but the poor soul creating this..."
        ]
    }
}