{
    "Promote your business, week of June 24, 2024": {
        "title": "Promote your business, week of June 24, 2024",
        "score": 17,
        "url": "https://www.reddit.com/r/smallbusiness/comments/1dn34wy/promote_your_business_week_of_june_24_2024/",
        "content": "Post business promotion messages here including special offers especially if you cater to small business.  \n\n**Be considerate. Make your message concise.**    \n\n**Note:** To prevent your messages from being flagged by the autofilter, don't use shortened URLs.",
        "num_comments": 186,
        "comments": [
            "I organize lives and routines. Just dm me to hire me :)",
            "Need a new website for your business? I'll build one for free.  That's right I'm waiving the setup fee for my next 10 clients. No gimmicks. No catch. Just pay a small amount monthly hosting afterwards. This is a limited time offer. Message me or tag a business that might be interested.",
            "If anyone needs aerospace grade superalloys let me know",
            "Hi, everyone! I am a virtual CFO providing advanced insights and strategic financial guidance for service-based businesses. Explore how I can transform your business's financial health at www.ascend-cfo.com",
            "Hi, is there anyone here who needs Website Design & Development?",
            "My company partners business owners with banks and private lenders.",
            "Online boutique! Shopblairscollection.com and we are shop blairs collection on fb and IG. I know online boutiques are over done. I have just been wanting one for so long I thought why not give it a try",
            "In our ever-evolving world, we have transformed into a digital society, but this means that rather than having to complete boring real-life chores, we have to complete boring online chores. Digital Helpers can help you complete boring, redundant, and time-consuming online tasks, we are like digital butlers! Our services can be perfect for busy people and other small business, who don't have to spend on tasks such as data entry, photo organizing, and spam email organizing. Sign up now to get our services for only $10 for the month of July. Contact us at: digitalhelpersrg@gmail.com \nfor more information!",
            "At Jared Poltrack CPA, LLC we save you and your small business money on taxes and keep your books pristine to allow you to make smart business decisions for your company. \n\nPlease visit www.Poltrackcpa.com or email us at jared@poltrackcpa.com to book a free consultation! We would be honored to serve you.",
            "If you are trying to get to medical school this is the right account for you!!"
        ]
    },
    "In this post, share your small business experience, successes, failures, AMAS, and lessons learned. Week of June 24, 2024": {
        "title": "In this post, share your small business experience, successes, failures, AMAS, and lessons learned. Week of June 24, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/smallbusiness/comments/1dn368k/in_this_post_share_your_small_business_experience/",
        "content": "This post welcomes and is dedicated to:\n\n* Your business successes\n* Small business anecdotes\n* Lessons learned\n* Unfortunate events\n* Unofficial AMAs\n* Links to outstanding educational materials (with explanations and/or an extract of the content)\n\nIn this post, share your small business experience, successes, failures, AMAs, and lessons learned. Week of December 9, 2019 \n/r/smallbusiness is one of a very few subs where people can ask questions about operating their small business. To let that happen the main sub is dedicated to answering questions about subscriber's own small businesses.\n\nMany people also want to talk about things which are not specific questions about their own business. We don't want to disappoint those subscribers and provide this post as a place to share that content without overwhelming specific and often less popular simple questions.\n\nThis isn't a license to spam the thread. Business promotion and free giveaways are welcome only in the Promote Your Business thread. Thinly-veiled website or video promoting posts will be removed as blogspam.\n\nDiscussion of this policy and the purpose of the sub is welcome at https://www.reddit.com/r/smallbusiness/comments/ana6hg/psa_welcome_to_rsmallbusiness_we_are_dedicated_to/",
        "num_comments": 23,
        "comments": [
            "Never hire a relative! Things get very complicated especially when you hire your older siblings ",
            "Never buy a business where the previous owner cashes out 100%. Have different stages that must be met to pay the previous owner. For example, different revenue or profitability or amount of time he puts into the business they all say they will stick around, but once they get their money, they will leave.",
            "Where is the promote thread please? I just found this one today and I dont wanna break the rules already lol",
            "So has everyone ever gone through this before,:",
            "I want to employ someone part time to make phone calls around local organisations which we could work together with. How do I even call this job? Who should I look for on fiverr upwork etc",
            "I started an Etsy shop recently and an Instagram profile where I promote my shop, and  have been receiving Instagram followers but not any views on my shop. Is there something I'm doing wrong in terms of promoting my shop? I want to earn money from doing something I love.",
            "Are you talking from personal experience? It might be YOUR personal experience, if you know what I mean.",
            "That first tip is one I heard before any other - get a business bank account and open an LLC to fully separate you and your business. So important.",
            "Were you able to do many testing for market demand before launching?",
            "That's a tough lesson to learn. Hope it turns out for the best!"
        ]
    },
    "Customer doesn't understand contract they signed, now they're mad.": {
        "title": "Customer doesn't understand contract they signed, now they're mad.",
        "score": 101,
        "url": "https://www.reddit.com/r/smallbusiness/comments/1dqwc4l/customer_doesnt_understand_contract_they_signed/",
        "content": "I own a landscaping business in Arkansas. We install drains, clear and grade land, and install gravel driveways. \n\nI have a customer that accepted our bid and signed a contract. We completed their project as outlined in the contract. They are threatening to sue us now because they thought that the price they paid for sod included sod for their entire yard. That was never discussed, my partner clearly explains to them that we only cover the areas we disturbed. The contract says 3 pallets of sod, which is about 1350 square feet. \n\nTheir argument is that they thought the price was for the whole yard and they have no idea how much a pallet covers. So they think we should pay to have the rest of the yard done because the contract wasn't clear (to them) how much sod was included. They chose a very expensive premium sod and we just can't take that hit.\n\nI thought my contract was pretty iron clad but it doesn't specify the square footage of the sod.Just amount of pallets, the type of sod, and that installation is included in the price.\n\nI already know what I am going to do in this case and I do have my own attorney for legal advice. I am just curious how you'd handle this type of situation in your business. Thanks!",
        "num_comments": 109,
        "comments": [
            "They can sue all they want, it all comes down to your contract.\n\nSounds like you need to update your contract to be more specific though for next time.",
            "The price is the price. No need to discount, they probably always do this to get money off.",
            "Threatening to sue is cheap. Actually suing isn't. Wait for them to serve you and then settle. Don't reward people who threaten you.",
            "They didn't even see square footage, just paid for it by \"pallet\"? They're lucky they didn't get scammed, a pallet could hold any amount of sod, the same amount they got could have been spread over twice as many pallets and cost them twice as much.\n\nFor me, threat of law suit is end of discussion. If they do go that far, I'm not giving them any more ammunition. They get the invoice with a hard deadline for going to a collector, and all further discussion can go through lawyers.",
            "I would say you fulfilled contract. Maybe see if he wanted to work out a deal with sod at cost and he pays labor. That would be about the only concession Id be willing to make. Other than that you did what was stated and agreed upon.",
            "Theres always that one customer that thinks theyre Liam Neeson and can threaten their way out of something clear cut that they signed.",
            "They signed. Not your fault they dont understand what they signed. Maybe they should try to be adults.",
            "The point is if they paid you for the work done or not. If not, start lien proceedings on the house. If they have, just tell them you would gladly give them a quote with how much more pallets are needed for the rest of the area and if they want to sue, we will wait to be served and go from there.",
            "Nah thats on them 100%. A pallet is pretty standard naming since they are almost always 450 sq ft. If they didnt know they should have clarified. That price isnt reasonable for a whole yard and they know it",
            "Ultimately did you deliver goods and services in line with what's on the contract?  If so they'll have a hard time with their \"case,\" regardless of their perceived and supposed lack of undertanding."
        ]
    },
    "Client won’t pay for tile job ": {
        "title": "Client won’t pay for tile job ",
        "score": 8,
        "url": "https://www.reddit.com/r/smallbusiness/comments/1dr65si/client_wont_pay_for_tile_job/",
        "content": "I recently tiled a bathroom and did some other work for a client that I've worked for many times before. She has not paid me the $1600 she owes because she claims I tiled over the floor vent in the bathroom.\n\nEven though there was no vent or piping, only rotten floor joists And debris that I repaired/cleaned up.\n\nSince we have done business multiple times before; this was just a verbal deal, but now I feel I have no recourse as I can't prove we had a deal and she won't pay. \n\nAnd she is hell-bent on the idea that there was a floor vent there despite no piping under the bathroom in the basement; other than water drainage/supply, but no HVAC. \n\nI'm at the end of my rope here ",
        "num_comments": 17,
        "comments": [
            "\"Agree with her\".  Tell her you will go in and find the vent.  Bash a few finder holes, and then walk out...\n\nI guess I would be that petty to do something like that...",
            "Put a vent cover that leads to nothing in. Make sure she tells you where she thinks it is.",
            "Just tell her to turn on the air conditioner and use a thermal camera to prove it.",
            "If theres a crawl space, go in there and show theres no vent.",
            "Put a lien on her",
            "Why did you tile over the vent?",
            "I think this is ur local customer so talking to the community might help or folks that she respects and listens to. \n\nGoing to court isn't ideal for both of you.",
            "Or agree with her, go in and add a vent at the place she thinks there was one",
            "Not for $1600. Its going to cost more than that just to get one done.",
            "Honestly, I truly did just skim it. Verbal contracts are held up in small claims if you want to take it that route though. Simply walk into any courtroom and just be like what small business owner would do 1600 dollars worth of work for free and any judge will see through her BS.\n\nEdit: still send her an invoice"
        ]
    },
    "Total Collapse of Services on WIX": {
        "title": "Total Collapse of Services on WIX",
        "score": 3,
        "url": "https://www.reddit.com/r/smallbusiness/comments/1dra6k1/total_collapse_of_services_on_wix/",
        "content": "It's incredibly frustrating to have worked so hard on multiple brands, building a strong client base and an impressive portfolio, only to have everything disappear in a single day without any explanation. Suddenly, I have no access to my account, and all websites have been unpublished. I can't log in, and my clients are constantly calling me for answers that I don't have. This situation is threatening my client relationships and reputation. Wix has been a disaster. There's no way to access support, and emails to customer service bounce back. Despite being on a paid subscription for several websites, I'm left in the dark.\n\n\"The email entered is blocked and can't be used to log in. Try a different email address. For more info, Contact Customer Care.\"\n\n\"Looks like this domain isn't connected to a website yet.\"\n\nThis is unacceptable!",
        "num_comments": 3,
        "comments": [
            "Making websites with wix, living life on the edge.",
            "One of the drawbacks of using another company to make sites. Thats why i custom code. Never have that problem. Take a front end web developer bootcamp on udemy for like $13 and only do the html and css and js portion and practice building sites. Life will be so much easier. Wonder what happened on wix for that to happen. Hopefully you didnt buy your domains from them too so you can at least spin up a new site somewhere else.",
            "This is a friendly reminder that r/smallbusiness is a question and answer subreddit. You ask a question about starting, owning, and growing a small business and the community answers. Posts that violate the rules listed in the sidebar will be removed. A permanent or temporary ban may also be issued if you do not remove the offending post. Seeing this message does not mean your post was automatically removed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/smallbusiness) if you have any questions or concerns.*"
        ]
    }
}