{
    "I like ribs. Do you like ribs?": {
        "title": "I like ribs. Do you like ribs?",
        "score": 133,
        "url": "https://i.redd.it/a4n2hvogze9d1.jpeg",
        "content": "",
        "num_comments": 20,
        "comments": [
            "no, i love ribs",
            "They look amazing. How long and what temp did you do ?",
            "I like ribs, you like ribs, we like ribs, cuz we're all ribs. #ribs. Tell us your ways.",
            "Share?",
            "I like American music.",
            "Those are absolutely gorgeous",
            "I love ribs bro 🍻",
            "I like American music. Do you like American music baaaaabyyyy?",
            "They look fantastic. I have never gotten good ribs when I try them. They just never come right. But those look right for sure. Well done.",
            "I like memphis dry rub myself. I’m weird."
        ]
    },
    "Lads. I don’t want to body shame but what would you do with this flap on my brisket?Tuck it in or snip it?": {
        "title": "Lads. I don’t want to body shame but what would you do with this flap on my brisket?Tuck it in or snip it?",
        "score": 234,
        "url": "https://i.redd.it/bc184lcntd9d1.jpeg",
        "content": "",
        "num_comments": 117,
        "comments": [
            "Trim it, throw it on the smoker along with your brisket and have yourself a little snack before your main course is ready.",
            "I trim those pieces, cook them separately on the smoker, and have a nice snack a few hours into the smoke.",
            "Left it on like an anarchist.",
            "In the grinder for burger meat.",
            "Cut it off. The brisket will cook better without it. Save it for sausage or chili.",
            "I see these posts about minor imperfections on here all the time. Do you think award-winning BBQ joints have the time to give a sh!t about a meat flap? Nah, bruh. Get your rub right, your temps right, and your times right. It won’t matter if you have a little bit of bull d0ng dangling off your brisket, it’s gonna taste delicious.",
            "Grindr\n\nu know",
            "Leave it. What's the harm? I've never had an issue leaving shit like that on.\n\nAlthough I am intrigued by how many people call them snacks...",
            "Trim it up.  Save the cuttings.",
            "Shits getting ground \n\nAnd I’m an advocate of being lazy with trimming and shit. But yea I’d take that off and make a burger"
        ]
    },
    "Friend posted this in Discord. Painfully accurate for some places...": {
        "title": "Friend posted this in Discord. Painfully accurate for some places...",
        "score": 353,
        "url": "https://i.redd.it/y8hsu7s4ec9d1.png",
        "content": "",
        "num_comments": 71,
        "comments": [
            "Yup. It’s criminal how low the bar is set for bbq.",
            "My local place that was just featured in Texas Monthly is charging $36 a pound for brisket, i.e. $360 for a 10 pound brisket. And it has a line out the door every day that they're open. Redbird BBQ in Port Neches, Texas. I mean, it's good, but damn.",
            "This is definitely how I used to feel. Now that I've started smoking I guess I can see why those places are expensive. But not why I would go to them.",
            " A vacuum sealer  and a deep freezer keep me from over paying for BBQ",
            "Pretty accurate for the Bay Area and it's not even good brisket. I'd rather just make brisket at home or wait till I go back to Texas.",
            "This is about 80% of the BBQ joints in my area, or at least very close.  Dry, lack of flavor, small portions, overpriced.  I just make it at home, better in every way.",
            "Up until 2 years ago, I lived my whole life 50+ in NYC. For most of that time there was NO BBQ at all. I didn't even know what BBQ was except maybe from some random travel quide. Instead I was a connoisseur of Pastrami!!!!!!\n\nMoved to Rockland, bought a smoker. Took a few cooks to get a feel for it but now I can not imagine how I lived my life without this.\n\n&#x200B;\n\nNow you can find BBQ in Manhattan (there is actually some good consistent stuff in Brooklyn) but it never seems to last. Some examples:\n\nHill Country was great for maybe 3 years. Still there but awful.\n\nDallas BBQ awful and still awful.\n\nMighty Quinn started out great, made a name and quality has gone down dramatically.\n\nRUB (Righteous Urban BBQ) got flooded during Sandy. Was set to reopen when someone drove a Suburban through the restaurant RIP. I really liked that place and they even made decent Pastrami! and awesome Turkey along with fantastic burnt ends.\n\n&#x200B;\n\nThere are a lot of really bad BBQ spots in Rockland. My amateur self puts them to shame. Truth be told, most places in Rockland suck. There is no edible Chinese or Pizza. Its a f'in desert so i have to make my own. When I am exhausted and need delivery there is some passable falafel and some extraordinary Pastrami YAY!",
            "Hey guys I know how I’m going to make my million!\n\n\nGet this: bbq trays at the farmers market that don’t absolutely suck. Lol.",
            "100% accurate, especially in parts of the country that have never had \"real BBQ\". I'm lookin' at you SoCal. The worst part is it isn't even good pitmasters overcharging, it's the blind leading the blind. So many people LARPing as pitmasters and making shyte BBQ, truly believe they're awesome at it and they're managing to convincing the ignorant that it's all true.",
            "I'm shit as smoking, but my wife loves it when I make ribs and pulled pork rather than us getting it from a reataraunt"
        ]
    },
    "Butt from beginning to end": {
        "title": "Butt from beginning to end",
        "score": 47,
        "url": "https://www.reddit.com/gallery/1dr08ke",
        "content": "",
        "num_comments": 8,
        "comments": [
            "I’m both relieved and feel deceived we didn’t get the toilet shot.",
            "Looks amazing! You have a recipe? Pork butt is the only thing I’ve yet to make",
            "Much rectangle cube, wow",
            "Looks like a tasty Sammy",
            "Great job.",
            "Was looking pretty good until you put cole slaw in it.",
            "Then you are really missing out my friend. Cheap, delicous, and almost impossible to fuck up.",
            "Almost impossible to fuck up?  Challenge accepted my friend."
        ]
    },
    "Finally Friday wings": {
        "title": "Finally Friday wings",
        "score": 53,
        "url": "https://v.redd.it/b8sb6ihhee9d1",
        "content": "Some beautiful wings from this evening\n\nVery basic - seasoned with super bird fire and smoke, smoked hot and fast (350ish for 30 mins) on my Weber kettle. Put directly over heat to crisp up skin at 160, pulled at 170.   \n\nHave a great weekend everyone!",
        "num_comments": 4,
        "comments": [
            "I’ve been addicted to smoked wings lately. \nI do a Cajun and curry power rub and it’s absolutely unreal. Roughly 60-40 Cajun-curry.",
            "Looking like some fire bird. Just put some wings on the kettle myself",
            "I have to admit it, I'm a smoked wings addict also!!!\nMy family loves wings, and we spend a lot of money on Wingstop. Two years ago, a friend invited us to his house and  he had smoked wings. Immediately, I fell in love! Now I can't think of another way to cook them!",
            "I didnt think other people put curry powder on wings. I do the same with tonys cajun and this chicken masala powder i got from my local indian grocery. Crazy good"
        ]
    }
}