{
    "New Releases Thread 6/24 - 6/30": {
        "title": "New Releases Thread 6/24 - 6/30",
        "score": 6,
        "url": "https://www.reddit.com/r/Sneakers/comments/1dn4jw9/new_releases_thread_624_630/",
        "content": "Please post all your questions, pics and comments about upcoming new releases here.\n\n&#x200B;\n\nRemember all screenshots of carts and order confirmations will be deleted if they're posted outside this thread.\n\n&#x200B;\n\n[https://www.soleretriever.com/](https://www.soleretriever.com/) For information on upcoming raffles.\n\n&#x200B;\n\n[http://sneakernews.com/release-dates/](http://sneakernews.com/release-dates/)\n\n&#x200B;\n\n\\*\\*You can now follow /r/Sneakers on Instagram and Twitter.\\*\\*\n\nWe will be featuring content from the sub as well as updates on upcoming releases.\n\n[www.instagram.com/SneakerSub](https://www.instagram.com/SneakerSub)\n\n&#x200B;\n\n[www.twitter.com/TheSneakerSub](http://www.twitter.com/TheSneakerSub)",
        "num_comments": 62,
        "comments": [
            "Good thing I already had the Knicks 990v6s, cause I just took a massive L on both Kayano 12.1s lol",
            "Kith ASICS didn’t even load sizes over 6?\n\nWhat the fuck was that drop?",
            "Thanks Confirmed for notifying me of the JJJJound Sambas drawing when every size is gone",
            "I take back what I said about Baklava being the worst at releases. It’s Union by far. Lot of ppl out there having to talk to fraud companies today and having cards bricked because they tried to handle a release by themselves and didn’t want to break off Shopify or PayPal anything. Joke of a company.",
            "Wanted those JJJJound sambas. Ah well…",
            "If y'all haven't checked out Finish Line's sale they have some pretty good deals. Ochre Yellow 1s for $100, lots of stuff. Some of it you can get cheaper on StockX but I prefer to buy from retailers. I got a pair of the Metallic Gold 1s for $80.",
            "I got EA on the union field generals 🤷",
            "Bruh is this the sneaker off-season right now?? 😂",
            "Wasn't there right at 10 for the field generals, but I got in after the initial website fail. I thought my payment was declining because of an address change due to moving but it finally went through. Just in time for them to shut the site down and move the drop to tomorrow. Hopefully my order sticks and they don't cancel it.",
            "Are these Union Field Generals releasing on SNKRS? I don’t see them"
        ]
    },
    "A post about legit check posts and r/legitcheck": {
        "title": "A post about legit check posts and r/legitcheck",
        "score": 112,
        "url": "https://www.reddit.com/r/Sneakers/comments/198ibxh/a_post_about_legit_check_posts_and_rlegitcheck/",
        "content": "Hi. Please don't post legit checks here. Please use r/legitcheck\n\nIf r/legitcheck is a total nightmare of a sub with no moderation and no quality engagement then I'm sorry and I can offer you this. If you create a legit check sub I will promote the hell out of it here. I'll put a pinned post up announcing it's creation and I'll leave it up for a bit\n.  I'll post it on every legit check post before I delete it. I'll even help moderate it. I'll clear the mod queue for a bit. I'm all in.\n\nThe people have spoken and I've always ran this sub like a proper democracy. Legit check posts aren't welcome by the majority so please don't post them. I never banned someone for a legit check post but I might after this post has been up for a while. Please stop.\n\nUse r/legitcheck. If that sub blows then pm me if you wanna make a good sub for legit checks and I'll help get the word out.\n\nI've been here for a minute. I'm trying my best. We have other mods that are trying their best. We want to help.\n\nOK. Bye for now.",
        "num_comments": 51,
        "comments": [
            "im all for a new LC sub. i never mod’d tho and i got a full time job so idk",
            "Legit checks at least let us help people. Better than shot ‘em screenshots and “why are these slept on”",
            "You know counterfeits are truly despised when they can make fakes look virtually indistinguishable and people STILL need to know whether or not it’s authentic. Counterfeit apologists need to take the damn hint already",
            "People are just going to just flood the brand specific subs. The majority of posts in r/nike are not only sneaker legit checks but also apparel. It sucks.",
            "But why would people offer this for free. If they like legit checking so much they could work for one of the hundred stupid legit checking apps :D",
            "I get that, I was pointing out they’re better than a common thing that people come here to do.",
            "How is it “unfair” ?",
            "Thanks for proving my point ",
            "… because the authentic pair always costs several hundred or thousands of dollars more than the illegal imitations",
            "And why does that matter? I’m not trying to start something, I just want to understand."
        ]
    },
    "Show me that youre not a slave to hype": {
        "title": "Show me that youre not a slave to hype",
        "score": 229,
        "url": "https://i.redd.it/c7r0moye0f9d1.jpeg",
        "content": "",
        "num_comments": 173,
        "comments": [
            "Shoes? This is 2024 bro, we walk with our hands",
            "Don’t even make it hot copped a pair for like 70 dollars the other day",
            "🙏🏽 very rare on this sub",
            "Too lazy to take a pic but I do rock those basic white with black stripe sambas",
            "Never thought I’d see another person wit the hot ones. I hope we wear them the same day and see each other at the f(x) 🫡",
            "Sorry no can do these chains are too tight",
            "I got 3 pairs of questions and a few pairs of answers. Real ones know",
            "Unfortunately, Reebok is releasing the retros without a single inch of tech. Their retros are so uncomfy like 30$ fake kicks…",
            "I prefer the classic Reeboks but these looking fly..😎",
            "Fuck hype, these are sickkk nice cop"
        ]
    },
    "I finally earned them.. ": {
        "title": "I finally earned them.. ",
        "score": 399,
        "url": "https://i.redd.it/scwx9rad8d9d1.jpeg",
        "content": "Always told myself that in order to buy the Air Dads, that I had to BE a dad. It ended up being a much longer journey than the wife and I had planned. We lost a few pregnancies on the way and spent thousands of dollars on tests and procedures only be told we had a very slim chance at ever having a kid. After years of heartbreak and low spirits, we finally welcomed a little girl. These are my new \"grails\". Next time I put these babies on will probably be her high school graduation. ",
        "num_comments": 38,
        "comments": [
            "This is awesome. Congratulations on becoming a dad!",
            "With the footprints.  Damn.  Already in the running for DOTY.",
            "Congratulations mate !! Wish you all the best !!",
            "Congrats man… gonna be a long time before you wear em again? Then again, seems like a long time at first, but then you reach that point of reflection and realize how quickly it all goes… time is a crazy thing 😀☝️🐣🐓",
            "Congrats man! Had my first at 46 one year ago on the 1st. Have earned myself a pair over the last year, that’s for sure! Love the footprints!",
            "Congratulations! I've been a dad for 13 years now, and I still have yet to get a pair of Air Monarch.",
            "Love your story...the journey is worth it. My wife and I will be welcoming a new addition to our family in January after five years of trying. Doctors told us we couldn't conceive naturally either, but here we are.",
            "These are fucin hard!! Congratulations 🔥🔥💪🏽",
            "Definitely the dad shoe of all dad shoes for sure the air monarch!",
            "That's awesome, man! Every good dad deserves a pair of Monarchs in life. Now, just be the best dad you can be to that precious girl!"
        ]
    },
    "Highs or Lows ?": {
        "title": "Highs or Lows ?",
        "score": 852,
        "url": "https://www.reddit.com/gallery/1dqlzua",
        "content": "Which one would you pick?",
        "num_comments": 155,
        "comments": [
            "Yo! This fucking hilarious 😂",
            "them gotta be fake😭 or u like bill gates bro",
            "Shit a iron for them pants would be the first thing",
            "\"Mom, come take a picture of me.\"",
            "You win the Internet for today.",
            "Hahahahahha well done. I thought you were posting with your kid facing you.",
            "“OH MY GAWWD WHY U WEARIN DOSEE” the highs go hard fr fr",
            "God, there’s so much wrong with this picture it’s like a highlights find the hidden items page",
            "Personally, lows. 😂 W post",
            "I always go with high tops unless it’s hot as fuck outside. The only highs I can really wear in the heat are my AJ1 Zoomies lol"
        ]
    }
}