{
    "Support Your Local Saturday - for match-going and local fans": {
        "title": "Support Your Local Saturday - for match-going and local fans",
        "score": 10,
        "url": "https://www.reddit.com/r/soccer/comments/1dr66wn/support_your_local_saturday_for_matchgoing_and/",
        "content": "# Welcome to the 'Support Your Local Saturday' discussion thread!\n\nThis is a thread to talk about your local team.\n\n*This does not necessarily mean that only comments from fans going to their local that day.* The spirit is a Discussion Thread for people who support their local team, and especially teams from lower or non-PL leagues - who can get drowned out in the pre-existing Daily Discussion Thread.\n\nFor now, we plan to alternate with the pre-existing Saturday Non-PL DDT, as we continue to trial the new thread.\n\nLike that thread, we want to **keep the focus to Non-PL teams**, to prevent discussion being drowned out by Big 6 fans - but we will soften this slightly, in that comments of PL-supporting fans are valid, providing they are/were \"at the match\" on this weekend.\n\n**Rules:**\n\n1. Discussion must be of ***your local team*** \\- whether they were you local growing up, or are your local now\n2. Discussion of PL teams is allowed ***only if you are attending the match that weekend*** \\- and hence focused on the match day experience\n3. ***Keep a high bar.*** This is not the DDT. If you want to troll, bait, or shit-talk like it's Football Twitter, use the DDT. Or even better - use Twitter.",
        "num_comments": 4,
        "comments": [
            "I'm riding my bike over to my local park later today to see a couple of Swiss guys take on some Italians.",
            "Why is the entire sub just \"ten years ago...\" posts. It's pretty boring.",
            "Allsvenskan on break. Nothing to see here.",
            "Fuck yea, I'll do that Tuesday as well. I actually wonder how every country have done with organizing something to view the match.\n\nOf course I expect Germany to have it everywhere. But I saw some pictures from Georgia where they put giant tvs on their national stadium.\n\nI thought that was super clever, and obviously not the first time it has been done, but for us, okay they didn't expect this Euro to be this historic, but we (in Bucharest) have like 2 actual places that are overcrowded and small with a TV, excluding pubs of course."
        ]
    },
    "Daily Discussion": {
        "title": "Daily Discussion",
        "score": 10,
        "url": "https://www.reddit.com/r/soccer/comments/1dr7t62/daily_discussion/",
        "content": "##Welcome to the r/soccer Daily Discussion! \n  \n###✔️ This is a thread for:  \n  \n* Discussion points that aren't worthy of their own thread.   \n* Asking small questions about football to the community.\n* if you're new to the subreddit, remember to get your **team crest** [here](https://www.reddit.com/r/soccer/wiki/set_flair) and to [read our rules and submission guidelines](/r/soccer/wiki/rules#wiki_community_rules)! \n \n---- \n    \n###❌ This is **not** a thread for:  \n  \n* Comments that aren't related to football.  \n* Trolling or baiting other users or fanbases.  \n* Comments about an ongoing game better suited for the Match Thread.   \n* Shitposting, brigading or excessive meta discussion.      \n* Any other kind of toxic or unreasonable behaviour.     \n   \nThe moderation team will **remove** comments that violate those rules and **ban** persistent offenders.   \n  \nPlease report comments you think that break such rules, but more than anything else, **remember the human**. The Internet is full of places to discuss football in bad faith. This community tries to be an exception.  \n  \n----  \n  \n###⚽ Can't find a Match Thread?  \n  \n* If you are using Old Reddit [click this link](https://old.reddit.com/r/soccer/search?q=flair%3Amatch%2Bthread+AND+NOT+flair%3Apost+AND+NOT+flair%3Apre&restrict_sr=on&sort=new&t=day#res-hide-options).  \n* If you are using New Reddit you need to try [this other one.](https://new.reddit.com/r/soccer/search/?q=match%20thread&restrict_sr=1&sr_nsfw=&sort=new)  \n* If you are using the official app [press here](https://new.reddit.com/r/soccer/search/?q=match%20thread&restrict_sr=1&sr_nsfw=&sort=new) and sort by \"new\".  \n* If you' areusing a third-party app... ¯\\\\_(ツ)_/¯\n  \nIf there's no Match Thread for the match you're watching you can:    \n\n* [Create one](https://www.reddit.com/r/soccer/wiki/matchthreads) yourself.    \n* Ask /u/MatchThreadder for one. You just need to send a PM to him with the subject \"Match Thread\" and the body \"Team A vs Team B\" (for example, \"Inter Milan vs. Udinese\") to get one from this great bot 🤖   \n\n----  \n\n###🔗 Other useful quick links:  \n  \n⭐ [**Star Posts**](https://www.reddit.com/r/soccer/search?sort=new&restrict_sr=on&q=flair%3A%E2%AD%90%2BStar%2BPost): the original content by those users that give their best to our community.   \n\n📺 [**What to Watch**](https://www.reddit.com/r/soccer/search?sort=new&restrict_sr=on&q=flair%3A%F0%9F%93%BAWhat%2Bto%2BWatch): quick but extremely-useful guides of next matches.     \n\n🌍 [**Non-PL Daily Discussion**](https://www.reddit.com/r/soccer/search?sort=new&restrict_sr=on&q=flair%3A%F0%9F%8C%8D%F0%9F%8C%8E%2BWorld%2BFootball%2B): for small discussions and questions about everything but the English Premier League.     \n\n📜 [**Serious Discussion**](https://www.reddit.com/r/soccer/search?sort=new&restrict_sr=on&q=flair%3ASerious): for high-quality discussion threads about certain topics.   \n\n👩 [**Women's Football**](https://www.reddit.com/r/soccer/search?sort=new&restrict_sr=on&q=flair%3AWomens%2BFootball): for women's football content.    \n  \n\n📧 [**Ping Groups**](https://www.reddit.com/r/soccer/wiki/userpinger/documentation): Join a ping group, our new system to find the content you want to see!  ([Explanation here](https://www.reddit.com/r/soccer/comments/u8qwe8/user_ping_groups_introducing_a_new_system_to_find/))\n\n\n----\n\n*This thread is posted every 23 hours to give it a different start time each day.*",
        "num_comments": 242,
        "comments": [
            "I have never been more sure of the result of a football match than of us losing to Switzerland this evening.\n\nGod help us all, its going to be a disaster",
            "One thing I'll praise Barcelona for is how even their Arabic twitter account never fails to post the pride flag. Call it performative, meaningless, hypocritical etc. but it still shows some semblance of the club standing by its values",
            "Fucking El Shaarawy, man. We are done.",
            "Oh he called up El Shaarawy and not Politano as a reserve so hes gonna play with 3 at the back maybe we arent so bad -A fool (me) one month ago\n\ngod help us",
            "Opened Youtube and was greated with a video titled \"How Calafiori is redifining the CB role\". I'm amazed at how much a jawline can carry your reputation.",
            "Odds on Switzerland to qualify are dropping like a rock. Italy is fucked, and so is my bet.",
            "Deeply concerning footage in the new england training video, multiple clips of Dunk overlapping on the rw and crossing it in\n\nWhat is Southgate cooking",
            ">I want to defend well to then attack well. If you leave Vinicius one on one, he finishes you. Im not entering in that offence-defence debate anymore. Hemingway once said: Man needs two years to learn how to talk, and 60 to learn how to shut up. Im 61, I already learned to shut up\n\nI ADORE the mental image of Alfaro reading that Hemingway quote at some point god knows how many years ago and writing it down, waiting to turn 61 so he could use it in a random interview",
            "Saw an article on some Croatian site yesterday with a headline \"Kristijan Lovric heading to Scottish giants?\", so of course I opened it up to see if it's Celtic or Rangers. \n\nIt was Aberdeen and I'm confused. Think that was the first time I saw someone refer to Aberdeen as giants.",
            "Italy will show all the hipster pickers levels and shithouse their way to an easy 1-0 victory over Switzerland"
        ]
    },
    "Vini Jr rainbow, nutmeg and chance creation vs Paraguay": {
        "title": "Vini Jr rainbow, nutmeg and chance creation vs Paraguay",
        "score": 2282,
        "url": "https://v.redd.it/xylukkocuf9d1",
        "content": "",
        "num_comments": 170,
        "comments": [
            "Who was that player who missed the tap in?",
            "he got tired of everyone saying joga bonito is dead",
            "one of those plays where you absolutely wish it went in haha",
            "In some leagues you get fouled if you try this\n\nIn Sunday League you get put on injure reserve",
            "Vinicius, Madrid, and Brazil fans are eating good tonight",
            "This is a different sport than the Euros",
            "Not gonna lie, the rainbow was weak af. Looks like the shit you do by accident when trying to learn how to rainbow.",
            "Alexa, play Mas que nada",
            "If that's the quality of Paraguay's defending, why the fuck not try it, lol.",
            "Football is alive. Say what you want about Brazil's current form but individually their players are keeping the game alive."
        ]
    },
    "[Fabrizio Romano] MOTM Vinicius Junior: \"We just want to put Brazil in the position it deserves\" \"It is difficult to play in these stadiums, because of the pitch and the referees are against us, not giving clear fouls. The way CONMEBOL treats us is complicated\"": {
        "title": "[Fabrizio Romano] MOTM Vinicius Junior: \"We just want to put Brazil in the position it deserves\" \"It is difficult to play in these stadiums, because of the pitch and the referees are against us, not giving clear fouls. The way CONMEBOL treats us is complicated\"",
        "score": 546,
        "url": "https://www.facebook.com/share/p/is5Qw5nhusfGDq3a/?mibextid=oFDknk",
        "content": "",
        "num_comments": 221,
        "comments": [
            "But the ref gave Brazil two pens and a red card to a Paraguayan player, what else does he want lol",
            "Bro wins 4-1 while both sides shithouse all game, proceeds to play the victim.\n\nThis aint it Vini",
            "What playing for Madrid does to a man",
            "Man is used to everything going his way at Madrid. Reality hits hard.",
            "Victim mentality is insane with this guy.",
            "It's not Madrid so he feels that referees are against them ?",
            "Both teams have to play on the pitch no? I mean almost like TY saying its raining",
            "The way CONMEBOL treats us. Lol, Brazil as the biggest sway on what Conmebol does or doesn't do. Vini always playing the victim",
            "This guy man... Great player but he's a fucking crybaby. Every single time, there's some drama with him!\n\nNot even Neymar is this much of a Diva",
            "This guy has a big victim complex"
        ]
    },
    "[UEFA]‘s official website lists Ukranian player Maksym Talovierov‘s country of birth as \"Russia\". He was born in the Donetsk region in Ukraine and never lived in Russia.": {
        "title": "[UEFA]‘s official website lists Ukranian player Maksym Talovierov‘s country of birth as \"Russia\". He was born in the Donetsk region in Ukraine and never lived in Russia.",
        "score": 455,
        "url": "https://uefa.com/european-qualifiers/teams/players/250162675--maksym-talovierov/",
        "content": "",
        "num_comments": 37,
        "comments": [
            "the website probably uses some outside package to assign country to a place of birth",
            "Looks like they fixed it",
            "Other players from the same city were listed as Ukraine, so really seems like a mistake or a blooper or something rather than any intersting statement from UEFA.",
            "That's an awful look lol",
            "Gazprom influence on uefa is crazy",
            "UEFA being a bunch of corrupt clowns, what's new",
            "Doesn't matter if its a mistake, people need to be fired for shit like this.",
            "Which now says he was born in Ukraine. Thoughts and prayers for the sysadmin on call on a Saturday morning.",
            "Not sure if an admin error is due to uefa corruption",
            "I don't think corruption means what you think it means"
        ]
    }
}