{
    "Low Ssdi benefit ": {
        "title": "Low Ssdi benefit ",
        "score": 3,
        "url": "https://www.reddit.com/r/SocialSecurity/comments/1drchvo/low_ssdi_benefit/",
        "content": "I was recently approved for ssdi and will be receiving 1100 per month. I have been on Medicaid for years and will be eligible for Medicare in Sept. I am trying to figure out what to do and have not gotten the answers I'm looking for from Medicaid, Medicare, and social security. I was told that I may qualify for Extra Help and potential Medicare savings plans. I was told the income limit for QMB was around 1200. I have been working part time but am realizing that if I continue to do so (less than 15 hrs a week) that it would throw me above that QMB limit and I would be responsible for Medicare premiums. I have not seen many posts about this issue from other people. It seems like it is more of an incentive to not work to stay under that limit instead of working the amount I have just to turn around and pay for that $175 premium. This is my dilemma. Has anyone been in this same predicament, or can help me make the better decision with more pros?",
        "num_comments": 3,
        "comments": [
            "My opinion,\n\nMedicaid pay your for  $175 premium when start if don't have Medicaid then social security would take out of benefits get the extra help for medication would call social security and enroll the program.",
            "Medicaid disregards half of your earnings. My state has a higher qmb limit of 1600 something",
            "Do you know where I can find information on them disregarding half of the earnings? The Medicaid office clerk was very rude and unhelpful and basically told me my Medicaid will automatically end when Medicare starts in Sept and come back and apply for QMB if income is under around the 1200 limit."
        ]
    },
    "Social Security": {
        "title": "Social Security",
        "score": 5,
        "url": "https://www.reddit.com/r/SocialSecurity/comments/1dr8osv/social_security/",
        "content": "My husband died unexpectedly at age 56 so he never drew any social security. I was 50 when he died. I’m now 61 and plan to retire at 65. At anytime will I be able to draw from my late husband’s social security?",
        "num_comments": 3,
        "comments": [
            "Contact your local office for an accurate benefits estimate. It may make sense to file an application now, or at 62, even if you are only due one check a year because of your work. \n\nIt is common for widows to claim the lower benefit early and hold off claiming the higher benefit until later, to allow it to grow.",
            "Since you are currently working, depending on what your income is now, you can take survivors benefits without penalty. BUTand this is a big BUT you need to see which amount is more, yours or his. I suggest you call SS (the main number, not your local SS office) and ask and they can run the numbers for you. Also, create an account online to see your work history and an estimate of your benefits. \n\nBecause you are not at full retirement age, and if you take survivor benefits while working, you can only make $1860 a month. So please do the math because anything over that, they withhold $1 for every $2 you earn above $22320 (which is $1860/mon). \n\nPlease call and click around their website. There is a .pdf online that is called How Work Affects Your Benefits and sections regarding survivors benefits. I only know this because of the digging I did when my own husband passed (he was drawing SS) but I was too young and working to take on his. Now that Im retired (but under full retirement age) I am taking his (which is more than mine) and it is slightly reduced due to not being FRA, but I can switch to mine once I reach 67 because by then mine will be more. \n\nBe prepared to sit on hold with SS for a while until they pick up and they are very helpful. Good luck!",
            ">At anytime will I be able to draw from my late husbands social security?\n\nYes.\n\nYou can draw reduced survivor benefits as early as 60. If you wait until your full retirement age, you can draw full survivor benefits while letting your own benefits grow until 70."
        ]
    },
    "EDPNA results": {
        "title": "EDPNA results",
        "score": 1,
        "url": "https://www.reddit.com/r/SocialSecurity/comments/1drc9l7/edpna_results/",
        "content": "Did anyone take the EDPNA exam this year? Results yet? ",
        "num_comments": 0,
        "comments": []
    },
    "DAC benefits ": {
        "title": "DAC benefits ",
        "score": 1,
        "url": "https://www.reddit.com/r/SocialSecurity/comments/1drc1c4/dac_benefits/",
        "content": "My daughter has been disabled since birth. She was on SSI for years. I became disabled in 2019 and they made me switch her to auxiliary benefits to draw off of me. She turned 18 in April. I had to reapply for DAC benefits February 2024. I sent all her updated records over the same day I applied. I have been stuck at level 3 online for 4 months. I thought this would just be a redeterination since she was already considered disabled through SSA. The website says it should take 30 days to make a decision. Do I have to start completely over because they made me switch her from SSI to auxiliary benefits? Sorry, I'm just confused. ",
        "num_comments": 2,
        "comments": [
            "The standards for child disability are different from the standards as an adult (18+).  It requires a new decision.\n\nDecision times vary state by state, but 6 months is a good estimate.",
            "I was aware they were have to do a reevaluation under adult disability requirements. I just didn't know it was starting completely over. Thank you for the reply."
        ]
    },
    "Unrelated oupatient surgery for short form CDR & CT Scan done in hospital?  Question about being hospitalized or recent surgeries.": {
        "title": "Unrelated oupatient surgery for short form CDR & CT Scan done in hospital?  Question about being hospitalized or recent surgeries.",
        "score": 0,
        "url": "https://www.reddit.com/r/SocialSecurity/comments/1drbjhn/unrelated_oupatient_surgery_for_short_form_cdr_ct/",
        "content": "I have a short form CDR to fill out and had an outpatient surgery for a Lipoma removal on my forehead.  I'm wondering if I would put that down for having any surgeries for the question that asks if I have been hospitalized or had surgery even though it's unrelated to my Diagnosis?\n\nAlso I had to get a CT Scan of my Neck in the hospital and was given a hospital wrist band & gown to wear for testing, had the CT Scan done, and left the hospital immediatly after my Scan.  This is related to my Diagnosis and I'm wondering if I would put that down for the question whether I have been hospitalized on th short form? \n\nAny help with these questions is greatly appreciated and I'm just confused on what to answer.  Thanks in advance.  ",
        "num_comments": 1,
        "comments": [
            "If they ask if you have had any surgeries, you answer \"Yes\". If they ask which surgery, you indicate that it was an outpatient Lipoma surgery.\n\nIf they ask if your surgery was related to your diagnosis, you answer \"No\".\n\nSince your scan was done as an outpatient, you weren't hospitalized. If asked if you were hospitalized, you answer \"No\"."
        ]
    }
}