{
    "How does a 20 year old felon (went to prison at 17) get a replacement card? ": {
        "title": "How does a 20 year old felon (went to prison at 17) get a replacement card? ",
        "score": 11,
        "url": "https://www.reddit.com/r/SocialSecurity/comments/1dqyg2t/how_does_a_20_year_old_felon_went_to_prison_at_17/",
        "content": "My brother in law just got out of prison 3 months ago. He desperately wants to start working but we can't figure out how to get a replacement card. He doesn't have an ID, and they've refused his Birth Certificate, Health Insurance card, and his Prison ID. We're at our wits end, everyone. What should we try? \n\nMy husband is going to take him to an urgent care Sunday night because they supposedly will take a doctors note. Please give us any suggestions! Thank you for reading.",
        "num_comments": 48,
        "comments": [
            "Was his Birth Certificate an official\nCertified copy with a raised seal? Start with getting the state ID using the prison photo ID.",
            "I work in homeless services in Louisville, KY. We have many clients in this exact situation. Social security needs you to have an ID and a birth certificate to get a replacement social security card. \n\nIf you don’t have an ID, you can use a certified medical doctor from a health care provider. For clients without a current doctor, I referred them to the local family health center/homeless services doctor to establish care and then have them give you a certified medical document. \n\nI’ve gotten many clients a replacement social security card this way.",
            "Chirst sake, just go to the social security website and see what's required.",
            "Reach out to constituent services at your US Representative’s office. And good luck to the young man.",
            "He can apply for a new card online if I remember correctly",
            "Go to the social security office and get his social security card with two pieces of mail  then go to secretary of state (your local DMV) and get his  id",
            "A doctor's note will absolutely not work. That is not a form of identification. \n\nGet the birth certificate, proof of residency (bank statement, discharge paperwork from prison, etc) and bring it to the DMV. Obtain an ID and then go to SSA for a new card.",
            "He has go with you to his local Congressman office",
            "This was the next attempt after trying out a doctors visit. The last time I checked with the DMV on an ID, it was conflicting. One webpage said we would only need the SS #, and another webpage said we needed the physical card. These webpages were both on the DMV website.\n\nI can't recall if the Birth Certificate had a raised seal. I believe it did but not too sure. I'll check tomorrow. Maybe that's why the BC was rejected. Thank you.",
            "I thank you for helping others in this situation. It's been super hard, to be honest. Me and hubs are 25 and still figuring out our own stuff. FIL and MIL have been of no help, they basically want nothing to do with BIL. \n\nIt's sad. My parents helped hubby when we were growing up, because his parents just really couldn't give a fuck. luckily, my parents are still wanting to help with BIL, but this SSA situation has thrown us all for a loop. I just wish the in-laws were better people. \n\nWe recently found out he has a Health Insurance card so we're going to take him to get checked out at an Urgent Care. Would the medical records have to be from a primary or would urgent care be fine? Thank you again for all the good you're doing out there in KY."
        ]
    },
    "My uncle needs a rep payee how do I get ssa to investigate him for a payee? ": {
        "title": "My uncle needs a rep payee how do I get ssa to investigate him for a payee? ",
        "score": 5,
        "url": "https://www.reddit.com/r/SocialSecurity/comments/1dqyvm0/my_uncle_needs_a_rep_payee_how_do_i_get_ssa_to/",
        "content": "My uncle is q raging alcoholic. He got arrested for a dui last month. He had a 0.19 blood alcohol at 10:30 in the morning. He is losing his house and spends his whole ssa checl on booze. How do I get social security to deem him incompetent and give him a payee. I'm the only person in my whole family on my mom's side whjo isn't on drugs. It's like trying to wrangle feral toddlers that can drive. Please help. ",
        "num_comments": 7,
        "comments": [
            "You probably can’t. People make bad decisions every day, that doesn’t mean they are incapable of managing their money. They are just unwilling. \n\nIf you got guardianship, that would do it. At the very least, SSA would either need him to agree or get a signed SSA-787 from his doctor verifying he is incapable.",
            "If he's jailed more than 30 days, his benefits are suspended until he gets out. If imprisioned (in a prison, not jail) then the benefits are terminated.",
            "Apply to be his Payee. You can search your area for Payee or contact adult protective services. \nUnfortunately if someone is unwilling to be his Payee there is little SSA can do.",
            "I would suggest reaching out to his doctor and tell him what is going on.  Ask his doctor if he would fax a letter/send a letter to SSA stating that your uncle is no longer able to handle his financial affairs and that he is recommending that he be assigned a representative payee.  He could add in the letter that his nephew  Mr. A bc is willing to serve as a rep payee (if true.)  He then should include your contact information (address/phone #.)",
            "OK thanks",
            "Lol every one on here just assumes I'm a guy.",
            "Sorry, I shouldn't have made that assumption.  People on here make the same assumption about me and I'm also not a male."
        ]
    },
    "CDR Reinstatement of Benefits": {
        "title": "CDR Reinstatement of Benefits",
        "score": 1,
        "url": "https://www.reddit.com/r/SocialSecurity/comments/1dr6ggb/cdr_reinstatement_of_benefits/",
        "content": "if Social Security makes a mistake during your CDR and you lose benefits, if you win the reconsideration and did not elect to continue benefits during appeal, will you get back pay from date of cessation?  also, when can someone expect to receive benefits again once they are reinstated?",
        "num_comments": 0,
        "comments": []
    },
    "Applying affect drivers license?": {
        "title": "Applying affect drivers license?",
        "score": 1,
        "url": "https://www.reddit.com/r/SocialSecurity/comments/1dr6eu6/applying_affect_drivers_license/",
        "content": "Has anyone ever had applying for disability benefits affect their drivers license if they already had one? In California ideally",
        "num_comments": 2,
        "comments": [
            "I don’t have an actual disability but I got restrictions on my driver license due to poor eyesight. I must have side view mirror and rear view mirror…. Which I always do cause who doesn’t?",
            "Those are very separate things SSA and DMV unless perhaps epilepsy"
        ]
    },
    "I got a job with a variable income, how do I report it each month (SSI)? Is it worth the hassle. ": {
        "title": "I got a job with a variable income, how do I report it each month (SSI)? Is it worth the hassle. ",
        "score": 1,
        "url": "https://www.reddit.com/r/SocialSecurity/comments/1dr5u1n/i_got_a_job_with_a_variable_income_how_do_i/",
        "content": "I've been on ssi for the better part of 8 years. I haven't stopped looking fir work and I finally found a job where I can work as little or as much as I can from my bed without having to talk to anyone . So I shoukd be all set. \n\nIt's not a great paying job. I'll be making somewhere in the $200-800 range every month but I'm hoping that having recent work expierence on my resume will lead to a better remote job I can manage. \n\nIs it a huge ordeal to report a variable income to social security? I should still get some, albeit less, benefits right? Will they just adjust my benefit amount the month following when I report the income? Will I have to refund them the money after I get it and report my pay? I heard there's an app you can report your income in? Do they allow you to spend money that doesn't count against you on disability work related expenses cause I'm going to have to buy some stuff to do this long term to accommodate my disabilities. \n\nOr is it not even worth it to try? Will I be risking my benefits unnecessarily? I figure it'll take me another 2 or 3 years before I can earn a substantial income and I rely on getting at least $900 a month, I was just hoping to get the expierence, have a better resume, and hopefully get hired somewhere else or get promoted within this company (they promote a lot). But I can't lose my benefits totally I was also thinking a little bit of extra money would be nice cause I heard they only reduce your benefits by $0.50 for every $1 you earn. Is that true? \n\nWill social security give me a hard time about only working part time? I'll only be working about 20 to 30 hours a month cause that's the best I can do right now. \n\nThere's not a lot of job for a hemipalegic wheelchair user with a severe vocal tic that renders me nonverbal often and mental health issues up the wazoo. I have to lay down to work, use a left handed Keyboard and roller mouse. It's a miracle I got a job offer with an 8 year gap in my employment history and at an advanced age. I've been applying to every job I could think of that I could do and I'm absolutly thrilled I got a job offer after all this time. The interview was written so I was able to do really well since I wasn't ticking or having a panic attack (has happened at other interviews) so they have no clue I'm such an odd person, they just judged me on my credentials and writing skills (it's a writing job...yes I write better in real life than on reddit). \n\nBut I absolutly can't lose all my benefits cause they automatically qualify me fir medicaid and I need a $20,000 treatment every 6 months to remain even remotely functional plus I go to physical therapy 3x a week amd I'm making great positive gains so I dint want to stop. I finally found a physical therapist familiar with my condition and I'm getting proper medical care after my last physical therapist did so much damage I had to switch from a manual chair to an electric. \n\nTldr: I got a job and need to know how to report it, if I'll lose all my benefits,  and if its worth it to go back to work cause I'm still just as disabled as ever I just happened to find a job that will accommodate me and I got an offer today. \n\nAlso horray for me! I git a job! Even if It would be impractical amd something I can't do right now it sure is a big boost to my self esteem that even with all my shortcomings I landed a job that even pays moderately well. ",
        "num_comments": 1,
        "comments": [
            "You report it the first week of each month on how much you got PAID gross amount for previous month because ssa count your income when it’s paid not when it’s earned. \n\nYou can do phone call or cell phone app or mail it in. \n\nThe basic formula for people receiving only ssi is they don’t count the first 85 dollars then whatever you make after that for each dollar you make they take $0.50 off your benefit check. So if you make let’s say $800 it will be 800-85 =715.   Then 715 / 2 = $357.50. So your benefit will be reduced by $357.50 for the month. They will deduct that couple months later.\n\nKeep copy of all your paystubs.\n\nIf you want to quit the job or got fired in the future just need to report that to the ssa then they will put your benefit back to the way it was."
        ]
    }
}