{
    "Best software features": {
        "title": "Best software features",
        "score": 45,
        "url": "https://www.reddit.com/r/software/comments/15vqgai/best_software_features/",
        "content": "**TLDR: Share the best software features, 1 per comment, add link and description, Windows only.**\n\nWe had the posts about best software, best programs, but this time it's about the best features.\n\nShare the features, you're using often, which are the best, unique, not well known, which save time, clicks - **1 feature per comment**, please.\n\nAdd the link, short description, and perhaps even the screenshot.\n\nIt could be part of the Windows, program, extension, or the web-based software.\n\nIt should be available for **Windows**, for other operating systems you can create similar post.\n\nI know a lot of such features, I even requested some of them, but I think, that not many users know about them, even if they're using software, which support those features, so I wanted to share it.\n\nI'm looking forward also for your comments.",
        "num_comments": 51,
        "comments": [
            "Streaming playback in VLC using drag-drop.\n\nI once sneezed when I was dragging a youtube link, and accidentally dropped it on VLC. VLC played it, with all the feaures VLC had (single frame, speed adjust and so on), and without the ads. I have since tried other sites as well, and it handles most of them.",
            "If you want to quickly open a cmd.exe window up in admin mode, type cmd in the search menu and when you are about to hit return instead hit Control Shift Return.",
            "The jump list A.K.A the context menu when you right click a taskbar icon. It's nice to have recent/pinned locations for quick access",
            "This doesn't seem to work for me... I can drag the link to the video and it shows a screenshot and title but it wont play. How did you do it exactly? Windows?",
            "So that's just a symbolic link. Why would I want to use this software for it when I can do it natively in Windows?",
            "Totally this! I cant believe we all survived so long without it.",
            "I immediately installed it. Thanks",
            "Can TouchPad gestures be contextual? For example, can a four-finger tap in Word 'save the file' and the same four-finger tap in outlook 'create a new email'?",
            "How good is the OCR and if I have a 500 page pdf, will it OCR that too?",
            "Windows. I've ran across a couple of linke that didn't work. Also, Youtube changes things around sometimes, so updating VLC might help. This is also a problem for YT-DL."
        ]
    },
    "What is your opinion about Microsoft Teams?": {
        "title": "What is your opinion about Microsoft Teams?",
        "score": 5,
        "url": "https://www.reddit.com/r/software/comments/1dr5mlt/what_is_your_opinion_about_microsoft_teams/",
        "content": "I frequently have errors on linux with Teams, and I'm thinking of creating an alternative for it. I think there are a lot of place for improvement...  \n  \nWhat is your opinion about Microsoft Teams? Do you know any good alternatives to it?",
        "num_comments": 11,
        "comments": [
            "The teams app is shit on Linux. Using teams in a chrome browser has usually worked well for me.",
            "It sucks. The last time I used it, only the meeting organiser had both audio and video. Half of us had audio but no video and the other half had video but no audio. We had to call in and listen on our phones.",
            "It's a peice of shit",
            "MS Teams has been a resource hog for me for quite a while. It always has some issues whether with logins or with organisations. I tend to login via Chrome due to the fact that I need sometimes 5 minutes to get into the damn meeting.",
            "Slack is the biggest competitor to Teams. Webex is another major Competitor to Teams. Zoom is another major competitor to Teams. I could go on. By all means, make another friggin chat app, I need more crapware on my computer in order to conduct business with other companies",
            "This is what's annoying with MS products. Outlook also seem to have everything, and Edge too. They try to cram everything in an app instead of making standalone well made versions of each that works well together.",
            "> Webex is another major Competitor to Teams. Zoom is another major competitor to Teams.\n\nlmao",
            "New? Unknown. I abandoned trying to use the app 3 years ago...",
            "Like 1-2 years ago they neglected Linux",
            "In my opinion, it's a worse version of Discord that wants to be more business-oriented. I think MS is trying too hard to turn Teams into a super app. You can open Words or Excel files directly in Teams, for example, and theoretically work on them together. Outlook has now also been integrated into the new version. New appointments are displayed directly in Teams. I think it's just too much and sometimes it doesn't work properly for me. The biggest problem I keep having, however, is joining a voice chat because the room is not displayed when you look in the channel. And it's always random, whether it's there or not."
        ]
    },
    "Best AI voice changer that preserves original accent?": {
        "title": "Best AI voice changer that preserves original accent?",
        "score": 2,
        "url": "https://www.reddit.com/r/software/comments/1dr8b5e/best_ai_voice_changer_that_preserves_original/",
        "content": "I am playing a little bit with AI voice changers for some music projects and I was wondering if there is a software or a service online that lets me change my voice without changing the accent (in my case Italian). Unfortunately, till now after every try I get a vocal that resembles an American trying to speak Italian other than a fluid Italian speech. ",
        "num_comments": 0,
        "comments": []
    },
    "YouTube to MP3 Converter that is safe and ad-free": {
        "title": "YouTube to MP3 Converter that is safe and ad-free",
        "score": 4,
        "url": "https://www.reddit.com/r/software/comments/1dr6cyl/youtube_to_mp3_converter_that_is_safe_and_adfree/",
        "content": "Hello Everyone,\n\nI’ve heard from many people that they cannot download YouTube videos as MP3 without getting viruses on their devices. Most converters show popup ads that cause viruses to enter their devices. So, I created an ad-free, safe, easy-to-use converter with more features than other available converters.\n\nI created EzMP3, which is safe to use and does not have ads. I cover server costs through coffee donations.\n\nI have added the option to trim the audio from the start and end. You can also select the quality, up to 320kbps.\n\nYou can read reviews about it on Trustpilot.\n\nGive it a try, and I hope you will love it!",
        "num_comments": 2,
        "comments": [
            "Here is the link [ezmp3.cc](http://ezmp3.cc)",
            "I use [https://www.atube.me/](https://www.atube.me/)\n\nEnjoy."
        ]
    },
    "Anon Chat Server": {
        "title": "Anon Chat Server",
        "score": 4,
        "url": "/r/u_Shadowknight260/comments/1dqwah6/anon_chat_server/",
        "content": "",
        "num_comments": 2,
        "comments": [
            "why use a self-signed cert rather than letsencrypt?",
            "I have not a clue how to get it running simply "
        ]
    }
}