{
    "Welcome to /r/Solana - Read This To Get Started": {
        "title": "Welcome to /r/Solana - Read This To Get Started",
        "score": 817,
        "url": "https://www.reddit.com/r/solana/comments/ci8qx2/welcome_to_rsolana_read_this_to_get_started/",
        "content": " \n\n\\# Welcome to /r/solana \\- Please Read This To Get Started\n\n⏳\n\n➖➖➖➖\n\nℹ️ BACKGROUND: \n\nSolana is a fast, secure, and censorship-resistant blockchain providing the open infrastructure required for global adoption.\n\nSay goodbye to high fees and slow confirmations. Solana is built for speed, without trade-offs.\n\n🏤The Solana Foundation is based in Geneva, Switzerland and maintains the open-source project.\n\n➖➖➖➖\n\n🚀 Join the fastest growing ecosystem in crypto 🚀\n\nTelegram: https://t.me/solana\n\nWebsite: https://solana.com\n\nNewsletter: https://solana.com/newsletter\n\nMedium: https://medium.com/solana-labs\n\nGitHub: https://github.com/solana-labs\n\nTwitter: [https://twitter.com/solana](https://twitter.com/solana?s=21)\n\nPodcast: https://solana.com/podcast\n\n➖➖➖➖\n\n💻 TECHNICAL\n\nNetwork Stats: [https://solanabeach.io](https://solanabeach.io/)\n\nDocs: https://docs.solana.com/\n\nDiscord: https://solana.com/discord\n\nWhitepaper: https://solana.com/solana-whitepaper.pdf\n\nTokenomics: https://solana.com/tokens\n\n➖➖➖➖➖➖➖\n\n⚠️ RULES ⚠️\n\nNo:\n\n❌ Spam\n\n❌ Repeat posts\n\n❌ Personal attacks\n\n❌ Swearing\n\n❌ Baseless claims\n\n❌ Misleading distortion of facts or news\n\n❌ Targeted harassment\n\n❌ Slander\n\n➖➖➖➖➖➖➖\n\nThis subreddit is used for informational purposes only. Applicable laws vary by jurisdiction and may limit or prohibit you from accessing or using various platforms or products discussed in this subreddit. Discussion of any project or product ≠ endorsement.\n\n➖➖➖➖➖➖➖",
        "num_comments": 43,
        "comments": [
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]"
        ]
    },
    "Introducing Blinks: Solana's New Primitive for Shareable Onchain Actions": {
        "title": "Introducing Blinks: Solana's New Primitive for Shareable Onchain Actions",
        "score": 54,
        "url": "https://v.redd.it/5jfa6zzyxp8d1",
        "content": "",
        "num_comments": 18,
        "comments": [
            "super handy!  We'll have to be extra vigilant with scammers of course",
            "As a user on Twitter said, Did Solana just release Frames, but for the whole internet?  I never would have thought when I started using Solana years ago that it would evolve into what it has, but Im so happy to be along for the ride.",
            "getting scammed is now only 1 click away from a link, thanks solana \n\n/s",
            "Cool af. How long until this API is implemented by other teams I wonder",
            "I love blink so much been playing around with it on x haha",
            "Very intresting. Solana keeps inovating.",
            "This is awesome Dude. Sci-fi in our everyday lives from now on",
            "Well you still need to sign a transaction",
            "It open source, so I'd say soon",
            "hypothetically no, you could just click the link after you have your wallet preconfigured for web3 on twitter and it would approve the tx."
        ]
    },
    "POV: The average memecoin experience... 🍟": {
        "title": "POV: The average memecoin experience... 🍟",
        "score": 46,
        "url": "https://v.redd.it/gk9kjjl2rf9d1",
        "content": "",
        "num_comments": 7,
        "comments": [
            "It's a casual day for guys with lettuce hands. Sell their bag in top-tier project during the correction, buy crap token, and enjoy the red screen.",
            "How can this post not have more likes",
            "Seen this happen for real, fairly accurate",
            "post too real, makin' people uncomfortable :))",
            "# ",
            "WARNING: \n1) IMPORTANT, Read This Post To Keep Your Crypto Safe From Scammers: https://www.reddit.com/r/solana/comments/18er2c8/how_to_avoid_the_biggest_crypto_scams_and/\n2) Do not trust DMs from anyone offering to help/support you with your funds (Scammers)! \n3) Never give out your Seed Phrase and DO NOT ENTER it on ANY websites sent to you.\n4) MODS or Community Managers will NEVER DM you first regarding your funds/wallet.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
        ]
    },
    "Need Advice on My Memecoin Project": {
        "title": "Need Advice on My Memecoin Project",
        "score": 6,
        "url": "https://www.reddit.com/r/solana/comments/1dradh3/need_advice_on_my_memecoin_project/",
        "content": "Hey Solana community,\n\nI want to emphasize that I'm not here to shill—there's no contract address in this post.\n\nI recently launched a memecoin based on the cool and old internet sensation, Kimbo Slice. In just a few days, we’ve taken the project from a $1k market cap to a $60k market cap. This is a legitimate and honest project without the intention to rug.\n\nIn a space where rug pulls and scams are far too common, I’m committed to transparency and integrity. Our Telegram group has grown to 550 members, and we’re building a small, dedicated team of people who believe in the coin and are invested in its success. However, what we really need now is volume and attention to take our project to the next level.\n\nI've already invested a lot of time and resources into this project. Unfortunately, I've been scammed for about 10 SOL by fake paid calls and marketers. Additionally, I've spent $2k on Dexscreener Trending Ads and around $1k on other Dexscreener ads.\n\nI’ve done most of the work myself, but now I need advice on how to gain more visibility. People have recommended raid groups and paid calls, but I’m looking for more reliable and effective methods. If anyone has advice on what to do next or contacts for legitimate groups that can help, I’d really appreciate it.\n\nThanks in advance for your support!",
        "num_comments": 11,
        "comments": [
            "Hey, props to you on launching. Ive done 3 launches and they are not even remotely easy to do. First one was almost all by myself. Exhausting af bro.\n\nDo you have any kind of marketing budget left?",
            "Its all about manipulation my friend. Nothing more... or big big spending early on the project and timing it Like influencers with all the ads etc. Lining up.",
            "How much initial liquidity did you add to the project when you launched, Im working on a project myself and Im waiting to launch the token myself, would like to do it right and we could help eachother out reaching out to more communities",
            "DM me the Telegram and/or CA. I'll gladly \"invest\" if my DYOR doesn't hit any road bumps :)",
            "If I may ask, how did you build up your telegram group?",
            "Thank you! Yes if its a legit project, its really a lot of work. But im good with that as long as we see some progress! Dont mind work. \n\nWell I paid for the whole marketing by my own pockets. I still have budget left but need to really think about how and where to spend it.",
            "Initial liquidity was 5 SOL. Make sure you have everything setup before you launch! Its more work than you think! Also I would suggest to have a good idea, a team around it beforehand and a plan how to market it.",
            "Yeah I hear you. Same approach I had. Learned a lot from my mistakes. Also learned 99% of people who contact you first for calls or marketing are TRASH. Wasted a LOT of money on them. And DEX Screener ads are dogshit. Didnt help me one bit.\n\nI gotcha. Feel free to dm me and we can chat. Im planning on doing another meme coin myself but waiting for the market to pick back up.",
            "Do you think the initial buyers of your token were people apart of your community or mostly bots upon launch were you able to profit some upon launching",
            "WARNING: \n1) IMPORTANT, Read This Post To Keep Your Crypto Safe From Scammers: https://www.reddit.com/r/solana/comments/18er2c8/how_to_avoid_the_biggest_crypto_scams_and/\n2) Do not trust DMs from anyone offering to help/support you with your funds (Scammers)! \n3) Never give out your Seed Phrase and DO NOT ENTER it on ANY websites sent to you.\n4) MODS or Community Managers will NEVER DM you first regarding your funds/wallet.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solana) if you have any questions or concerns.*"
        ]
    },
    "What happened here with this txn": {
        "title": "What happened here with this txn",
        "score": 8,
        "url": "https://www.reddit.com/r/solana/comments/1dr916n/what_happened_here_with_this_txn/",
        "content": "Not complaining but I swapped some tether into Solana last night, paid $416 worth of usdt and received $461 worth of sol? is this just some weird form of arbitage? \n\ntxn link; [https://solscan.io/tx/3PEbK1RzL4MsQdpn5MZTjmy5AspxeCYrgaESWhoyZH2YiN6GSZY7P9baNQHMmzzfMGS9Y1Mzy1rQvGbuz1zcMJYr](https://solscan.io/tx/3PEbK1RzL4MsQdpn5MZTjmy5AspxeCYrgaESWhoyZH2YiN6GSZY7P9baNQHMmzzfMGS9Y1Mzy1rQvGbuz1zcMJYr)",
        "num_comments": 14,
        "comments": [
            "its seems like u used some sort of unknown program.",
            "The price probably increased by the time your swap was confirmed and you got a small profit on your swap; this seems like a valid explanation but, hey you got some extra money have fun GG.",
            "what website did you use?",
            "notHing weird, you bought sol before it went up. That isnt usd value at the time its a live updating price api, that's the value right now, not when you got it",
            "Do research before start naything.",
            "Definitely not complaining but 10% isnt caused by small price fluctuations yk",
            "Stabble.org was grinding their airdrop campaign on a alt wallet",
            "Yes it was bro. Price was the same 20 hours ago.",
            "That is also true but I suppose it can happen maybe in the same block someone swapped a large amount making the prices go up yk",
            "10% is caused by the 10+% sol mooned after etf announcement"
        ]
    }
}