{
    "SolidWorks Laptop/PC Hardware FAQ and Recommendations": {
        "title": "SolidWorks Laptop/PC Hardware FAQ and Recommendations",
        "score": 82,
        "url": "https://www.reddit.com/r/SolidWorks/comments/x0o9pd/solidworks_laptoppc_hardware_faq_and/",
        "content": "Frequently in this subreddit, we see lots of questions about what computer hardware is good for SolidWorks, especially in the summer when new engineering students are trying to buy their laptop/PC for their first year classes. Below are some of the common questions, answers and general recommendations for this software package. \n\n***What Laptop Should I buy?***\n\nLots of people who come here looking for hardware advice are students or hobbyists, looking to purchase a laptop for college when they know they'll be doing engineering work. The good news is, **It doesn't matter that much!** Small projects are very simple usually and won't stress solidworks much. Most modern laptops featuring Intel 12th, 13th, or 14th gen, or AMD 7000 or 8000-series CPU's are going to be plenty for small projects.\n\n**If you're a student**, focus on having good general performance stats like those below that fit your price range. /r/laptops or /r/suggestalaptop are great resources for general laptop needs. If you forced me to pick a specific machine to recommend, I'm a big fan of the Dell XPS and Precision lines. At the lower/midrange price, the Dell Lattitude series and a lot of Asus laptops are perfectly fine choices as well.  A bigger screen is likely going to be a better investment of your money than focusing on getting a workstation class machine.\n\nIf you also want to play games on your school laptop, you'll want something with a dedicated GPU still, but it probably shouldn't be a workstation-grade one. I recommend [The Lenovo Legion series](https://www.lenovo.com/us/en/d/deals/laptops/?orgRef=https%253A%252F%252Fwww.reddit.com%252F&IPromoID=LEN266411&sortBy=Recommended&visibleDatas=698%3ALegion). Though there are certainly tons of other options too. \n\nIf you are required to do more complicated types of work, your school will probably have a computer lab with better-suited machines.\n\n**If you're a professional** buying a machine for work, it is strongly recommended to get a workstation-class laptop with a dedicated workstation class GPU. Dell Precision series laptops are my favorite. Lenovo ThinkPads are also a great choice. \n\n**For desktops**, the same logic applies: Any general-performance or gaming PC is going to be fine for hobby or student-level solidworks stuff. For higher end workstations, Dell, HP, and Puget Systems have great options. For a custom-built desktop better tailored for solidworks, /r/buildapc, /r/buildapcforme, or post in this thread below to get help at a given budget. \n\n***General Considerations: What hardware features are important for SolidWorks?***\n\nSolidWorks is overall fairly simple in terms of hardware requirements. Without going into specific models, I've summarized key features to pay attention to for the major hardware categories in a PC:\n\n* **CPU:** Most important for a CPU is that it has strong single-threaded performance. Most modern CPU's (Intel 12th gen or newer, AMD 5000-series or newer) are more than capable of providing enough single-threaded performance. The only reason you should be concerned about the number of cores and threads in SolidWorks is if you are doing certain types of simulations, or PhotoView 360 rendering regularly.\n* **RAM:** 16 GB is the minimum I'd recommend running SolidWorks with. Overall, the program is not sensitive to RAM speed, so get whatever is cheapest. A dedicated workstation should have 32GB at minimum. 64GB is not a bad idea if you are doing simulation, motion studies, or other heavier workloads.\n* **SSD:** You want SolidWorks on an SSD. It isn't necessary to have a super-fast PCIe 5.0 high performance NVMe drive, but a Decent SATA SSD is the minimum. Size is subjective to your specific needs and setup, but with current prices I'd probably go no less than 500GB for your primary drive.\n* Note that in general, you want to have as small number of physical, traditional spinning disk Hard Drives attached to a SolidWorks machine as you can. SolidWorks spins up every drive attached to a machine when booting, so more drives can add significant time to the initial SolidWorks boot-up time.\n* **Video Card:** I'll expand on this, but the general tl;dr consideration is \"Anything works, but a Workstation Card *can* be significantly better than anything else\" depending on your needs. Refer to the section on Workstation vs Gaming cards below if you want more info.\n\n***Dedicated Video Card Considerations: Workstation Cards vs Gaming Cards***\n\nA big point of contention and a very common question is *\"Are Workstation Cards necessary for SolidWorks\"?*  The answer is \"No! But...\"\n\nSolidWorks runs just fine for basic modeling on any GPU, from a very weak integrated GPU to a $6,000  RTX A6000. If you're making simple parts (student level, as discussed above) and small assemblies, then you really have no reason to stress about what GPU you are using for SolidWorks. A gaming grade Nvidia GeForce or Radeon RX-card will run it just fine. When you get into larger projects, however, you will start having more serious performance issues. RTX Workstation Cards, Quadro's,  Radeon Pro's, and AMD FirePro's will see much better performance with larger, more complex assemblies, to the point where you can expect (within similar generations) the lowest-end workstation card on the market to perform equivalent to, or better than the highest-end consumer grade card you can buy.\n\nIn SolidWorks 2019 and newer, this gap is further widened with the new GPU Acceleration option, which significantly boosts SolidWorks performance in tasks that scale well with GPU performance. As far as I am aware, this option can **only** be used with Certified Cards. \n\nThe downside here is that Workstation GPU's can perform **significantly** worse than similarly-priced, consumer grade cards for things like gaming. Thus, if you are going to be playing games on your machine, these cards are probably not a good idea at all, unless you are going to take advantage of fancy new [multi-GPU settings in Windows 10/11](https://www.pcgamer.com/windows-10-is-gaining-a-new-setting-for-power-users-with-multiple-gpus/) and running a dual-GPU setup. If you're a student getting a laptop or desktop for engineering school, I wouldn't personally bother with workstation cards at all, as it's going to put you in a significantly higher price bracket for workstation-grade laptops for little to no benefit to your needs.\n\n***Feel free to post any further questions or for advice on specific laptops, desktops, or custom builds below!***",
        "num_comments": 238,
        "comments": [
            "**OFFICIAL STANCE OF THE SOFTWARE DEVELOPER**\n\n> **\"AMD FirePro\"** was formerly tested and supported hardware but has since aged out of support and is unsupported with recent releases of SOLIDWORKS.  Unsupported hardware is **known to cause performance, graphical, and crashing issues** when working with SOLIDWORKS.\n\n> The software developer recommends you consult their [list of supported environments](https://www.solidworks.com/support/system-requirements) and their [list of supported GPUs](https://www.solidworks.com/support/hardware-certification/) before making a hardware purchase.\n\n> **TL;DR - For recommended hardware search for [Dell Precision-series](https://www.dell.com/en-us/shop/workstations-isv-certified/sc/workstations), [HP Z-series](https://www.hp.com/us-en/workstations/desktop-workstation-pc.html), or [Lenovo P-series](https://www.lenovo.com/us/en/workstations/) workstation computers.** [Example computer builds for different workloads can be found here.](https://www.goengineer.com/hardware-recommendations-for-solidworks)\n\n**CONSENSOUS OF THE r/SOLIDWORKS COMMUNITY**\n\n> If you're looking for PC specifications or graphics card opinions of /r/solidworks check out the [stickied hardware post](https://www.reddit.com/r/SolidWorks/comments/x0o9pd/solidworks_laptoppc_hardware_faq_and/) pinned to the top of the page.\n\n> **TL;DR: Any computer is a SOLIDWORKS computer if you're brave enough.**\n\n**HARDARE AGNOSTIC PERFORMANCE RECOMMENDATIONS**\n\n> * Regardless of what hardware is being used, [consider applying the settings in this article](https://www.goengineer.com/blog/optimizing-solidworks-for-faster-performance) to improve performance.\n\n> * If you wish to enable RealView for an unsupported graphics card, try this process ([Enable SOLIDWORKS RealView for Unsupported Graphics Cards](https://www.reddit.com/r/SolidWorks/comments/11tka6f/does_anyone_know_how_to_turn_realview_on_by_using/jclkqga/)).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SolidWorks) if you have any questions or concerns.*",
            "Just an FYI, NVIDIA has more or less retired the \"Quadro\" brand.  They are now differentiating by using the \"GeForce\" branding for the consumer products and \"NVIDIA\" for the professional products.  So for example, your high-end professional workstation GPU is now called an \"NVIDIA RTX A6000\" for desktop and \"NVIDIA RTX A5500\" for laptop.",
            "A point that I think wasn't mentioned...  SolidWorks and many other CAD/CAM/CAE vendor will not support their product on a consumer GPU because NVIDIA and AMD will not support those apps on those GPU's.  This means if there is a GPU rendering issue that needs to be fixed via the GPU vendor with an updated driver or by the professional application vendor with assistance from the GPU vendor, it likely won't happen if it only occurs on the consumer GPU's.",
            "I used this guide to narrow down a suitable computer from the Lenovo ThinkStation line. So far, I think that the [ThinkStation P360](https://www.lenovo.com/us/en/p/workstations/thinkstation-p-series/thinkstation-p360-tower/30fm002kus) with an Intel Core i9-12900 works best for professional SolidWorks use.\n\nThis is based on three assumptions:\n\n* The P Series ThinkStation line is SolidWorks certified\n* The Intel Core i9-12900 is considered to be one of the best chips for single-core computing according to [Geekbench](https://browser.geekbench.com/v5/cpu/singlecore).\n* The device comes with an NVIDIA® RTX™ A2000 12GB, which is also recommended by Dassault Systemes (see [here](https://www.3ds.com/support/hardware-and-software/hardware-and-software-configurations/)).\n\nDo you think there is a more suitable configuration for professional SolidWorks use? Thanks for all the replies.",
            "All really great points. A lot of us use SolidWorks day in, day out in an industrial setting. Personally, I’d say the products I work on are mid to high in complexity. These often include routing components and complex models such as PCB STEP files. The biggest issue I’ve seen is more around the entire ecosystem rather than just the workstation. So, network speed, document repositories (PDM/PLM) all weigh in on performance. I run a Dell 5760 with Xeon processor and 32gb (updating to 128gb this week). Besides SolidWorks, in a business setting your machine will be taxed with office applications, multiple browser windows, and myriad other applications. Multi core/multi threaded processors are essential. Over the last 20 years, I’ve used many different brands including Dell, Lenovo, HP, Toshiba, and even Sony running both Nvidia or AMD. The worst I’ve experienced were HP. Multiple HPs (could be just my luck but I would never buy an HP for CAD). Some with AMD, but most with Nvidia (FireGL/Quadro). These cards are designed to handle the rigors of 3D CAD applications by implementing OpenGL in hardware. Unlike 3D games, CAD models calculate all physical properties at all times. Games “cull” all the stuff you don’t see.\n\nInteresting marketing spin that Nvidia are dropping the Quadro moniker.",
            "Was wondering what you consider a large project (for a GPU selection)? I’m an undergrad student, but I’m part of a student team working on a pretty big project. Wanted to build a machine at home and found it difficult to find the line where it would be worth it to get a workstation card over a gaming card (like entry-level T600 cards).",
            "Can Solidworks be ran on a Apple Silicon Mac that uses parallel to run windows through?",
            "I'm trying to help set up my father with a good laptop for doing SolidWorks with. Nothing crazy, and trying to stay fairly cheap. No crazy models or simulation, just designing parts.\n\nHe really likes my ThinkPad X220T (i7) but I think he needs something like a W530, W540, or W541. I'll max the RAM out and put a good SSD in it. Any thoughts? Thanks",
            "This is a great post, thanks for this!\n\nI just ordered a Laptop (should be here sometime in 2023) and I'd like your opinion on the config I got. \n\nIt is a new Dell Precision 5770,\n\nIntel i7-12700H,\n\nNVIDIA RTX A2000,\n\n32GB DDR5, \n\n1TB Gen 4 PCIe SSD,\n\nAnd Dell's 17\" UHD+ Touch display. \n\nI found it for a really good price (less than 3k)\n\nI got this to use for school (mechanical engineering). The university has somewhat strict hardware requirements and uses SolidWorks.",
            "I feel like I'm in a weird grey area. I'm going into my last year as an aerospace engineering student (and then into the industry), ay laptop (i7 7700, GTX 1060) just started to quit on me in the last few months. Given that I won't be a student for a whole lot longer, should I take the plunge on a mobile workstation, or can I get away with a gaming laptop?\n\nAnother consideration: should I wait a couple months for Meteor Lake (or Ryzen 8xxx), or just get something that's available right now?"
        ]
    },
    "PSA: GRAPHICS ERRORS aka IF IT LOOKS WEIRD AT ALL - Sketch Ghosting, Shaded Models not Shaded, Wrong Model Transparency/Wireframing, Missing Buttons/Dimensions/Interface Elements, Graphical Garbage/Artifacts...": {
        "title": "PSA: GRAPHICS ERRORS aka IF IT LOOKS WEIRD AT ALL - Sketch Ghosting, Shaded Models not Shaded, Wrong Model Transparency/Wireframing, Missing Buttons/Dimensions/Interface Elements, Graphical Garbage/Artifacts...",
        "score": 103,
        "url": "https://i.redd.it/iwcjqm2u1xpa1.png",
        "content": "",
        "num_comments": 2,
        "comments": [
            "A lot of graphical issues come up on this sub and the sources of these issues fit a few categories.  These are some main reasons:\n\n> 1. **GPU Drivers** - Newer does not always mean better.  Using Game Ready GPU Drivers instead of Studio GPU Drivers causes graphical issues\n\n> 2. **GPU Hardware** - Using a GPU that is not a supported variety ([here is a list of supported GPUs](https://www.solidworks.com/support/hardware-certification/)).  This includes both gaming GPUs and formerly supported, but no longer supported, GPUs\n\n> 3. **GPU Hardware/Driver Combination** - Using a GPU that is supported but with the wrong version driver (much like item #1 above).\n\nHere are some things you can do about it in order of increasing difficulty:\n\n> 1. Disable \"Optimize for thin parts\" under 'Tools', 'Options', 'System Options', 'Display'.\n\n> 2. Set Anti-aliasing to \"None\" under 'Tools', 'Options', 'System Options', 'Display'.\n\n> 3. [Ensure the monitor cables are plugged into the discrete graphics card and not the motherboard graphics port(s).](https://pcguide101.com/wp-content/uploads/2022/04/ATX_computer_case_-_back_-_2018-03-18-521x1024.jpg)\n\n> 4. Disable \"[Enhanced graphics performance (requires SOLIDWORKS restart)](https://www.goengineer.com/blog/solidworks-2021-enhanced-graphics-performance)\" under 'Tools', 'Options', 'System Options', 'Performance'.\n\n> 5. Enable \"[Use software openGL](https://www.goengineer.com/blog/software-opengl-for-solidworks-explained)\" under 'Tools,' 'Options', 'System Options', 'Performance'.\n\n> 6. Install the latest GPU \"**Studio Driver**\" instead of the latest GPU \"**Game Ready Driver**\".  Execute a [clean driver install](https://www.goengineer.com/blog/clean-install-nvidia-driver) while you are at it.\n\n> 7. [Check if your GPU is supported](https://www.goengineer.com/blog/checking-your-graphics-card-with-solidworks-rx) and, if you do, ensure you have installed the [recommended graphics card driver](https://www.goengineer.com/blog/how-to-install-the-correct-video-card-driver-for-solidworks) for that hardware.\n\n> 8. If you made it this far in the last and none of this is helping, that's not good news.  At this point you are going grind through testing old graphics drivers to see if anything stabilizes these issues.  That's pretty much the end of the road.  If your GPU is not supported it is time to consider replacing it with one that is.\n\nI get that a lot of folk will feel strongly about hardware choices.  This is not the thread for that argument.\n\nThis is a pragmatic approach given in the spirit of trying to help people get in a better place."
        ]
    },
    "Preparation tips CSWA exam": {
        "title": "Preparation tips CSWA exam",
        "score": 2,
        "url": "https://www.reddit.com/r/SolidWorks/comments/1dr3xym/preparation_tips_cswa_exam/",
        "content": "\n\nI am trying to improve interpreting details from engineering drawings but I am finding it difficult.  I am familiar with the tools in solid works for example I know the use case of draft but I am not able to  it find the place of use from engineering drawing. Any tips and resource to check out",
        "num_comments": 1,
        "comments": []
    },
    "Solidworks help with extrude cutting please": {
        "title": "Solidworks help with extrude cutting please",
        "score": 3,
        "url": "https://www.reddit.com/r/SolidWorks/comments/1dqyest/solidworks_help_with_extrude_cutting_please/",
        "content": "So I've been using Solidworks for a while now but I've stumbled on this problem which idek if it can be done. Anyways, I am trying to take the current sketch (highlighted in orange) and extrude cut it through to the tip of the part but I want it to get smaller as it going? So pretty much start big then at the end it is small. Someone let me know if this is even possible, much appreciated. \n\nhttps://preview.redd.it/991rccxhme9d1.png?width=1195&format=png&auto=webp&s=433b7cbc6b99b1f77ab6c9e3232af6ba90c84a7e\n\n",
        "num_comments": 5,
        "comments": [
            "If you really want to control it, I would do a loft cut. But, you may be able to accomplish what you want by adding a draft angle to a standard extrude cut.",
            "Inside of the cut extrude there is a little draft icon. You will need to do some trig to find the draft angle if you want a specific end hole diameter. If you do not care how big the hole is make a draft that looks to what you want.",
            "Loft should do it. But the way you have it right now will result in a zero thickness error. Or do you have a bit of clearance around the edges of the cut sketch?",
            "I would recommend lofted cut. Draft would also work but you have less control on the path as it gets more narrow. Lofted cut is the best option.",
            "Yep, lofted cut is the way to go. Draw the beginning and ending profiles and this should be a breeze."
        ]
    },
    "Help modeling a shark denticle": {
        "title": "Help modeling a shark denticle",
        "score": 3,
        "url": "https://www.reddit.com/gallery/1dqvpxv",
        "content": "Hello, I have been trying to model a riblet shark denticle but have been quite unsuccessful when trying to make it a solid object.\n\nI initially tried to use the loft command with guidelines but when that failed I then switched to try and create solid surfaces one by one but I’m having issues with that as well. (The once symmetrical denticle got lopsided and there are now disconnects)\n\nI’m unsure how I should proceed, I currently just have a wire frame of my desired shape.\n\nI have attached multiple photos of my current wireframe as well as what I was going off of, please note that at the front nose, and end of the three riblets I used to have tiny circles such that I could pierce the splines when I was trying to use the loft method, however I got rid of those to connect the splines to each other such that I could try to use the solid surface method.\n\nIf anyone knows a way to easily model it or can tell me what I’m doing wrong I would very much appreciate it. Thank you!",
        "num_comments": 3,
        "comments": [
            "The dimensioned example is in mm",
            "It is quite a hard part to model, especially in SW. Surface modeling is the tool I would use to model this, I would try to separate the sharks dentile en 6 or 8 surface to model the stitch and fillet. Or use another non  Parametric software like Rhino,that would be perfect for this job",
            "Solidworks is not the right application for modeling organic geometry. Download BforArtists and look up a Blender tutorial on modelling from reference or sculpting."
        ]
    }
}