{
    "/r/solotravel \"The Weekly Common Room\" - General chatter, meet-up, accommodation - June 23, 2024": {
        "title": "/r/solotravel \"The Weekly Common Room\" - General chatter, meet-up, accommodation - June 23, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/solotravel/comments/1dmyrmh/rsolotravel_the_weekly_common_room_general/",
        "content": "This thread is for you to do things like\n\n* Introduce yourself to the community\n* Ask simple questions that may not warrant their own thread\n* Share anxieties about first-time solotravel\n* Discuss whatever you want\n* Complain about certain aspects of travel or life in general\n* Post asking for meetups or travel buddies\n* Post asking for accommodation recommendations\n* Ask general questions about transportation, things to see and do, or travel safety\n* Reminisce about your travels\n* Share your solotravel victories!\n* Post links to personal content (blogs, youtube channels, instagram, etc...)\n\nThis thread is **newbie-friendly**! In this thread, there is no such thing as a stupid question.\n\nIf you're new to our community, please read the subreddit rules in the sidebar before posting. If you're new to solo travel in general, we suggest that you check out some of the resources available on our [**wiki**](https://www.reddit.com/r/solotravel/wiki/index), which we are currently working on improving and expanding. Here are some helpful wiki links:\n\n**General guides and travel skills**\n\n* [Basic trip planning](https://www.reddit.com/r/solotravel/wiki/btt)\n* [Determining your travel interests](https://www.reddit.com/r/solotravel/wiki/interests)\n* [Packing 101](https://www.reddit.com/r/solotravel/wiki/packing)\n* [Staying in hostels](https://www.reddit.com/r/solotravel/wiki/hostels)\n* [How to meet people as a solo traveller](https://www.reddit.com/r/solotravel/wiki/meetingpeople) \n* [Staying safe](https://www.reddit.com/r/solotravel/wiki/stayingsafe)\n* [Budgeting 101](https://www.reddit.com/r/solotravel/wiki/budgeting/)\n* [Money management and safety](https://www.reddit.com/r/solotravel/wiki/money)\n* [Working abroad](https://www.reddit.com/r/solotravel/wiki/workingabroad)\n* [Travel insurance 101](https://www.reddit.com/r/solotravel/wiki/travelinsurance)\n* [Mobile data and SIM cards](https://www.reddit.com/r/solotravel/wiki/simcards)\n\n**Regional guides**\n\n* [So you want to do a Eurotrip: A beginner's guide](https://www.reddit.com/r/solotravel/wiki/eurotrip)\n* [So you want to visit Southeast Asia: A beginner's guide](https://www.reddit.com/r/solotravel/wiki/seasiatrip)\n* [Weekly Destination Threads: Archives](https://www.reddit.com/r/solotravel/wiki/weeklydestinations)\n\n**Special demographics**\n\n* [Solo travel and mental health (with a focus on depression/anxiety)](https://www.reddit.com/r/solotravel/wiki/mentalhealth)\n* [Resources for female, POC and LGBTQ+ travellers](https://www.reddit.com/r/solotravel/wiki/groupresources)\n* [Other FAQs](https://www.reddit.com/r/solotravel/wiki/faq)",
        "num_comments": 77,
        "comments": [
            "Hi Guys, just looking for some ideas on the best pub crawls in Berlin, Krakow and Prague. I'm solo travelling (I will be staying in Hostels but im not 100% sure i'll meet people who are down to go out) so im looking for a pub crawl that is solo traveller friendly and is catered towards people in my age range (ie, in their 20s). Thank you.",
            "Hello! I will be traveling to Antigua, Guatemala from July 3 to July 10. I am a 23-year-old male from the United States and was looking to see if there are any other solo travelers that will be in the area during that time. I do not speak any Spanish at all, but I have been to Guatemala before on a trip with an organization that constructed buildings for orphanages. I am really looking forward to visiting this beautiful country as a tourist this time. I completely understand that I am going during the rainy season, but hopefully the weather will be somewhat nice on the days that I am there. If you are going, please feel free to reach out to me, in the comments, through private messaging me, or even sending me a message on Instagram: @lognew",
            "Which tourist traps would you avoid in London? Which places should be can’t miss? And does anybody have any hidden gems around London and area?",
            "(US based) when do you renew your passport? Mine expires next July, I am taking a trip to Europe for 1 week in December, and am thinking about another trip in March or April. Not sure how long it takes or if I will be without current passport. Does it make sense to get it done ASAP a year before I have to, or do it right away when I come back in December? I see online that some countries want it to be valid for at least 6 months after your current trip, but that shouldn't be an issue for my December trip.\n\nI don't *think* I have anything planned soon where I need the passport (e.g., I just used it a couple weeks ago as a second ID while checking in for a certification exam). Except I haven't booked flights for December trip yet and they may want my passport number when booking (or could just be before check-in), which I assume will change on renewal.",
            "I am supposed to be traveling to Xela, Guatemala for 1 month for Spanish immersion courses. I'm scheduled to travel 2 July - 31 July. I booked a homestay through a school and I'm 4 days out from leaving and I haven't been provided the homestay information even though the school said they'd give it to me 1 week out. Then they told me they'd give it to me today and didn't. I'm getting worried they don't have a homestay option available for me and I won't have any place to stay when I get in country. I'm getting very anxious about this and thinking maybe I should cancel my entire trip. This is not my first solo travel trip but I'm feeling extremely nervous about this for some reason and having second thoughts.",
            "What’s a great Caribbean island to do solo? For about a week. Mainly want sun and yummy drinks. Was looking at Barbados.",
            "Anyone have experience with Wizz Air and/or Eindhoven airport? I'm considering booking a flight from there to Warsaw but I've never flown within the EU so I'm not sure how early I should be, if flight delays should be expected, how reliable the airline or airport is. It's a toss up between that and two train rides with an overnight stop halfway",
            "I am thinking about booking 2 weeks spain for beginning of July, preferably in the north or the south where I can also book (kinda last-minute I know...) a surf course for 2-4 days... Anyone can recommend Cadiz or San Sebastian/Zarautz ?",
            "Can anyone advise the best way to travel from Manila airport to Baguio? I have been looking online and seen some very expensive quotes by taxi.\n\nSurely, there are cheaper ways to travel though not sure if I have been able to find them.",
            "I (33F) am looking for a guided tour and isn’t a party tour and has a good variety of activities. Has anyone ever traveled with the Other Way Around tour groups? I can’t find any reviews that aren’t related to the website. Thanks!"
        ]
    },
    "Trip report of the month: Japan by u/sangtoms": {
        "title": "Trip report of the month: Japan by u/sangtoms",
        "score": 4,
        "url": "https://www.reddit.com/r/solotravel/comments/1dqmtcm/trip_report_of_the_month_japan_by_usangtoms/",
        "content": "Hi everyone - \n\nWe feature a trip report from a community member near the end of every month. Sorry this one was a bit late, I was traveling recently and not super on top of moderation-related stuff.\n\nThis month we're featuring [this Japan trip report](https://www.reddit.com/r/solotravel/comments/1d7ucjy/japan_solo_trip_report_may_2024/) from u/sangtoms - thanks for sharing your travel experiences!",
        "num_comments": 1,
        "comments": [
            "Thank you for the feature! Hope it helps people out if they want to plan a Japan trip."
        ]
    },
    "Road trip tips - Slovenia - solo black woman traveler ": {
        "title": "Road trip tips - Slovenia - solo black woman traveler ",
        "score": 6,
        "url": "https://www.reddit.com/r/solotravel/comments/1drab41/road_trip_tips_slovenia_solo_black_woman_traveler/",
        "content": "Hi everyone !\n\nI plan to road trip in slovenia from 29th July to 9th August.\n\nThe first four days I want to book a hotel in Lubjana to visit Lubjana, Bled, lake Bohinj and maybe Triglav park - do you think it's doable or it's more than enough ?\n\nThen the fifth day of my trip I want to visit Predjama castle and postojna, again do you think it's feasable in one day ? I would sleep in piran. \n\n6th day and 7th day I would visit piran and Koper (I would sleep in piran) \n\nThen I would travel to Maribor (8th day) and Ptuj (9th - maybe I will go to Ptuj thermal bath). I don't of I should stay in Maribor or Ptuj, what do you think? \n\n\nDo you think it's doable or I'm really generous with my time? \nDo you have a hostel or restaurant to recommend? \nI want to rent a car, do you have any tips? Should I rent a manual or an automatic car? Should I be scared to not get my rent deposit back? \n\nlast but not least I'm a young black French woman do you think it's safe for me to travel over there? \nIt's my first solo trip ever, I'm little bit anxious... ",
        "num_comments": 1,
        "comments": [
            "OP appears to have requested personal experiences from (women/people of color/LGBTQ+ travelers). If you are not a member of the requested demographic, please carefully consider whether your post will add value to the conversation.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solotravel) if you have any questions or concerns.*"
        ]
    },
    "Trip report: my first ever solo trip to Madrid, Spain": {
        "title": "Trip report: my first ever solo trip to Madrid, Spain",
        "score": 59,
        "url": "https://www.reddit.com/r/solotravel/comments/1dquu8k/trip_report_my_first_ever_solo_trip_to_madrid/",
        "content": "So I am 25f from the US, finished up school recently and finally have a job that allows me the time and money to travel. I did not travel much as a kid and it was always my goal to be in a position where I am able to travel. I had about a week off in March and decided to book a trip to Europe. I chose Madrid because the plane tickets were the cheapest! I also have a basic understanding of Spanish and thought I would feel more comfortable in a country where I can somewhat communicate in their language. \n\n*Budget:*\n\nTotal I spent was around $2,000 for everything... accommodation, airfare, food, activities. I could have probably gone cheaper but I wanted to stay in a hotel where I felt safe as it was my first time alone in a different country. So I picked a more expensive hotel in the city center.\n\n*Trip Length:*\n\n5 days, Monday - Friday! Mid-March 2024.\n\n*Accommodation:*\n\nHotel Regina: Alcala 19\n\nThe hotel was great! The location is unbeatable. It's in the middle of all the activities and sites that I wanted to see. To one side, you have the Royal Palace, to the other you have El Retiro Park. Everything is walkable from the hotel. I felt completely safe in this area and there were always people out at all hours. There is also a Metro station 1 minute away that I used to get to and from the airport. The rooms were updated and nice, but the only complaint I had was that the walls were so thin that you could hear everything out in the hall and in the rooms next to you. I did still feel safe and the front desk was very responsive to any concerns. There was also no view unless you want to pay for the more expensive rooms (no thanks!). I utilized the free breakfast buffet at the hotel which was amazing! It was easy to just head out to explore the city without worrying about where to get breakfast. \n\n*Getting to/from airport*\n\nThe Madrid airport has two metro stations. Once you go through immigration, there are large signs that point you in the direction of the exit and metro station. There are kiosks there where you can buy a ticket. I bought a 10 Journey Ticket (you are given a metro card). Since you are leaving the airport, you need to add an \"Airport extra charge\" to your purchase. Again, on the day you enter the airport through the metro, you need to add an airport extra charge again onto your metro card. It has to be purchased on the same day and before you enter the airport. People who didn't purchase the airport extra charge weren't able to pass through the turn styles entering the airport and had to wait in a long line at the kiosks to load it onto their metro cards. The metro was easy to use and navigate. I had a backpack and small suitcase with me and did just fine. I had to change trains twice to get from the airport to my station \"Sevilla\". I would highly recommend the app \"Citymapper\" which is what I used to find the correct route on the metro to my hotel. \n\n*Activities:*\n\n- **Plaza Mayor**: went there, took obligatory photos, walked around for 20 minutes, and was done. Way too many people and too touristy for me as a solo traveler. \n\n- **Royal Palace**: Absolutely beautiful location. I would recommend buying an entrance ticket online if you want to see the inside. There was a very long line to buy tickets there, but I walked right in because I had bought mine previously. The palace is beautiful but my favorite part was the observation deck. That is free and the view is beautiful. I ended up coming back almost daily to watch the sunset from there. It was stunning. \n\n- **Campo Del Moro Park**: Large park just behind the royal palace observation deck. Very tranquil and not very many people there. I didn't go down into it but saw it from above. \n\n- **Plaza de Espana**: This is a very nice area with **Monumento Cervantes**. Cute area with kids playing on the playgrounds, interesting buildings. Not a far walk from **Temple of Debod**. I did not buy tickets to go inside the temple but took you can take the stairs up and walk around the area. There are some nice views of the city from there. \n\n- **Retiro Park**: I walked around this park for at least 3-4 hours. I started at one end and kind of looped my way around to the other end to make sure I covered as much of it as possible. It is gorgeous and so peaceful. People are out there exercising, walking their dogs, school groups are touring the park as well. In late March, the flowers were blossoming and it was sunny and green. In the park, you have to see **the lake**, **the crystal palace**, and so many other monuments and gardens. **Puerta de Alcala** is also a can't miss monument super close to one of the park entrances. \n\n- **Bike tour of Madrid**: I booked a \"highlights of Madrid bike tour\" online and it was a great decision. I would recommend booking a tour like this on your first day. We basically rode around the whole city starting at Retiro Park and ending at the Royal Palace. We stopped along the way and learned a lot of information about different parts of the city. It was a really good introduction to the city and I was able to note what places I wanted to return to and see more of. \n\n- **Prado Museum**: Beautiful. I am not an art person but could not miss out on this. It took me about 3 hours to see most of the museum and I was going at a pretty fast pace. I also had a nice meal at the museum cafe. \n\n- **Reina Sofia Museum**: This was very different from the Prado. I probably would not recommend this one if you had to choose one or the other. It was smaller and the collections were separated in different rooms and the hallways were kind of bare. This one took me about 1.5 hours. They have cool glass elevators and a nice courtyard. \n\n- **Mercado de San Miguel**: Amazing spot to try some food. I was anxious to go solo but it turned out great. The place is so packed that you are squeezed in there like sardines so everyone is kind of solo there. You just find a place to stand and eat your food and it's not awkward at all. The vendors spoke English, I could pay with card, and there was a large selection of foods. Lots of tourists here!\n\n*Final Thoughts:*\n\nI had a very nice first solo trip. While walking around, I couldn't believe that I was on another continent all alone. I opened up my maps several times just to see the blue dot of where I was so it would sink in. I walked 20,000 steps a day, saw so many beautiful things, and ate some good food. I am a pretty shy person by nature so it was sometimes awkward to go eat alone or have to communicate in Spanish. I am not a partier either so my trip consisted of getting up early, seeing as much as I could during the day, and being back at the hotel shortly after dark. I went the majority of my days without talking to other people. I will definitely be taking more solo trips because it's just so easy to plan when you don't have to coordinate with other people's schedules. Trips like this really force you to be alone with yourself and step out of your comfort zone. I cannot wait to plan another trip!",
        "num_comments": 14,
        "comments": [
            "Congrats! I also did a solo trip there and stayed in a hostel where I met some cool people, and it was cheap and safe :)",
            "Proud of you for going on an adventure! I might be there in September so thanks for the tips.",
            "Awesome report! As someone whose first ever solo trip was to Madrid at 25, it’s cool to see others enjoying solo travel in Spain. Madrid was a solo travel gateway drug for me.",
            "Madrid’s great! Great foodie destination. I go there for work often and take day trips! Next time see if you can go to Toledo - 30 mins by train!",
            "I want to go on a solo trip so bad but I have so much anxiety, especially the airports:/",
            "Sounds like an amazing trip! I'm heading to Madrid solo in October and appreciate all the tidbits you shared here!",
            "The Reina Sofia has some incredible works (e.g. Guernica, which is one of the most powerful paintings ever IME) and the temporary exhibitions can sometimes be excellent.",
            "Nice! Yes, I really liked the city and felt safe as well!",
            "I think airports are the safest part of a trip. Once you enter and go through security, there’s no way for you to take a wrong turn or get lost. Lots of signs and people to help you.",
            "Can you take a train soon somewhere?"
        ]
    },
    "Malaysia Itinerary Help": {
        "title": "Malaysia Itinerary Help",
        "score": 3,
        "url": "https://www.reddit.com/r/solotravel/comments/1dr8zmu/malaysia_itinerary_help/",
        "content": "I’m currently in Penang and just finished up 4 days in Kuala Lumpur. Absolutely loving it here so far. The food is amazing, culture is great, and the people are so cool too. Just overall better than I expected. \n\nI took the bus from KL to Penang and did not really think about my plan from there (stupid me). I really want to go to Taman Negara and probably Cameron Highlands as well. However, people keep telling me to check out Langkawi after here because the beaches are better than here and it’s a different vibe. I originally left it off my list because of the mixed opinions on this sub. \n\nWhat do you think the best plan for me would be after leaving here? I was thinking of going to CH, Taman Negara, then back to KL and flying out to Thailand. Does that sound good or should I add/remove/change anything? Any spots I’m missing? \n\nLooking for nature, a good mix of cultural experiences and obviously great food as well. Trying to be immersed in local culture as much as possible while here. \n\nThanks guys!! ",
        "num_comments": 4,
        "comments": [
            "It's been so long since I have been to Malaysia so I'm sure others will be more helpful. But from what I remember, Langkawi does have nice beaches, but it's advertised more to newly weds and it gets boring alone. So you probably shouldn't spend more than two days there. That's my two cents, and like I said, it's been years since then.",
            "depends if you wanna go to a beach and where you're going in thailand afterwards. \n\nif you go to a beach in thailand anyways then go to the cameron highlands",
            "**Note:** Are you asking for travel advice about Malaysia? Read what the Solo Travel community had to say in the [weekly destination thread for Malaysia](https://www.reddit.com/r/solotravel/comments/135vbnu/weekly_destination_thread_malaysia/).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solotravel) if you have any questions or concerns.*",
            "It looks like you're planning a trip around Southeast Asia. Check out solotravel's [detailed guide to planning a solo Southeast Asian trip](https://www.reddit.com/r/solotravel/wiki/seasiatrip) for general planning advice plus useful tips and tricks for Southeast Asian travel!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/solotravel) if you have any questions or concerns.*"
        ]
    }
}