{
    "Do not post links to auction sites, fb marketplace, secondhand sales": {
        "title": "Do not post links to auction sites, fb marketplace, secondhand sales",
        "score": 15,
        "url": "https://www.reddit.com/r/SonyAlpha/comments/1d6a3qq/do_not_post_links_to_auction_sites_fb_marketplace/",
        "content": "As a reminder, do not create any posts or comments in threads with links to auction sites, facebook marketplace, secondhand sales sites, or any other online store or classified page for cameras, lenses, and other gear. All such posts and replies will be deleted.\n\nr/SonyAlpha is not an appropriate forum for promoting or discussing second-hand sales of gear. Please visit r/photomarket instead.",
        "num_comments": 0,
        "comments": []
    },
    "Weekly /r/SonyAlpha 'Ask Anything About Gear' Thread": {
        "title": "Weekly /r/SonyAlpha 'Ask Anything About Gear' Thread",
        "score": 1,
        "url": "https://www.reddit.com/r/SonyAlpha/comments/1dnbr2c/weekly_rsonyalpha_ask_anything_about_gear_thread/",
        "content": "Use this thread to ask any and all questions about Sony Alpha cameras! Bodies, lenses, flashes, what to buy next, should you upgrade, and similar questions.\n\nCheck out our [wiki](https://www.reddit.com/r/SonyAlpha/wiki/index) for answers to commonly asked questions.\n\nOur popular [E-Mount Lens List](https://www.reddit.com/r/SonyAlpha/wiki/lens/emount) is [here](https://www.reddit.com/r/SonyAlpha/wiki/lens/emount).\n\nNOTE --- links to online stores like Amazon tend to get caught by the reddit autospam tools. Please avoid using them.",
        "num_comments": 122,
        "comments": [
            "If I’m a back button focus user, but I know I will have to hand the camera over to someone not familiar with mirrorless cameras for group photos. In those cases, there isn’t anything wrong with leaving “AF w/ Shutter” on for those instances while I’m using BBF for the rest, right?",
            "Those who own an A7iv or those who are instantly going to buy the A7v (eventually). What upgrades are you wanting/expecting? ",
            "I don't want to create a new thread for this, so I'm gonna ask this here. Just got a Sony ZV-E10 for cheap since it was a return and noticed (should have expected) some issues. The display shows a red dot (like a dead pixel) but it's obviously not a display error since it doesn't show up in the menus.  \n  \nSo I expected a sensor issue and to see the red dot in the pictures. But the result is confusing. While the JPG files show the red dot very clearly, the raw files don't have even a tiny hint of the red dot. I'm new to cameras, but this seems weird to me? How can the preview display and the JPG show a red dot but not the actual raw file?\n\nI'll just return it and learn my lesson, but would love to have an explanation.",
            "Posted a couple times last thread asking about what’s camera to go to next. \n\nI ended up going full frame and upgrading from my a7ii to the A7iii. Thank you guys! \n\nI assumed the upgrades would be good but they are great! Excited to keep learning the cameras ins and outs!",
            "Hi everyone,\n\nI’m planning a trip to Scotland and Ireland this November, and I’m looking for recommendations on the best low light lens for my Sony A7IV. My primary concern is capturing high-quality images in low light conditions. Additionally, I’ll be doing a lot of landscape photography.\n\nHere are the lenses I currently have:\n\n\t1.\tSony FE 100-400mm f/4.5-5.6 GM OSS\n\t2.\tSony FE 28-70mm f/3.5-5.6 OSS\n\t3.\tSony FE 35mm f/1.8\n\t4.\tTamron 70-300mm f/4.5-6.3\n\nWhile these lenses are great, I’m particularly interested in a lens that excels in low light scenarios and is also good for landscapes.\n\nI’ve heard good things about the Sony FE 24mm f/1.4 GM and the Sony FE 16-35mm f/2.8 GM. Would these be good additions to my kit? Are there any other lenses I should consider?\n\nAny suggestions or advice would be greatly appreciated!\n\nThanks in advance!",
            "I recently bought a Sony A7 iii and upgraded from my Canon T3i.  The girl I bought my camera from was a coworker, and she included a Neewer EOS-NEX mount so I can mount Canon lenses on it.  I do have my old Canon EFS 55-250 IS II 4-5.6 lens (non STM) that came with the T3i probably 10 years ago (maybe more?), and fit it to the Sony fine, and took a few pictures and it seemed to work well after I switched the settings to crop sensor mode.  I know I'll have to use manual focus, buy my questions are:\n\n1 - Is this a decent lens to use since I already have it, or is there a better telephoto (crop or full size) one for $100-$300 that I could be using that would be better?\n\n2 - The sony focus mode that zooms in so you can focus easier...does that work for lenses that aren't connected electronically by chance?  I really like that feature with the kit lens the Sony camera came with so thought I'd ask .",
            "I'm looking into buying a camera stabilizer/gimbal but I'm not quite sure what to get. I know I really won't be able to use Bluetooth for now with a older camera but that's fine. I was thinking maybe a DJI Mini 3 or RS4. One perk with the RS4 is that I can use the focus tool for the zoom or focus if I do MF. \n\nWhat I have:\n\nSony a5100 \n\nSigma 30mm\n\nSony 70-350 \n\nMight be getting TBD:\n\nTamron 17-70\n\nSony a6700 or any other top of the line APS-C at the end of the year or next year. \n\nTIA!\n\nEdit: the whole post lol",
            "I want to start photographing with IR light. Namely, I want to photograph my subjects in complete darkness using an IR flash. Currently I have the A7RIV.  Will this pick-up IR flash or need I modify the sensor and or put on a filter... Hows that for today's question? :-)",
            "Hey pals!\n\nI checked the lens list and have done the compare on BH and I wanted some more input.\n\nI have an a7iv and I love it. I have a Tamron 28-75mm and a Tamron 20mm. I am looking to add one more piece of glass for some more wildlife, lunar, and aviation style photos.\n\nThe brand new Tamron 50-300mm f/4.5-6.3 Di III VC VXD Lens (Sony E) looks pretty good and is not too expensive.\n\nThere is a Sigma 100-400mm f/5-6.3 DG DN OS Contemporary Lens (Sony E) that also looks nice and is around $50 more.\n\nWith the Tamron being newer, would that be a solid choice for the shots I mentioned above? Or is the Sigma the better choice since I already have something covering the 50-75mm range and the extra 100mm on the zoom end could be better?\n\nI know \"better\" can be subjective, but I am super amateur with this being my first big deal camera.\n\nI'm also a little confused on the E vs FE bit from the wiki. The BH listings all say \"Sony E\" and the details specify that they are full-frame lenses, so shouldn't that say \"FE\"? Is this just weird cataloging on their end?",
            "I have been shooting for a little bit on an a700 but have considered getting a different 2nd hand camera with lenses due to various reasons; so I wanted to ask how the SLT cameras compare to a traditional DLSR. The one available for me to purchase is an a58 with 18-55, 55-200 and 75-300 lenses for $250aud. \n\nAnyone who has any experience with these model SLT cameras who could share some experience and maybe photos would help a lot, and whether you think this might be a worthwhile deal. Thanks :)"
        ]
    },
    "Dropped my camera for the first time in 5 years 😭💔": {
        "title": "Dropped my camera for the first time in 5 years 😭💔",
        "score": 224,
        "url": "https://i.redd.it/z9jj13tisd9d1.jpeg",
        "content": "I just bought it last month as an upgrade 🥲 my poor baby",
        "num_comments": 79,
        "comments": [
            "Battle scars. Enjoy it. Tells a story.",
            "I feel for you bro",
            "Oooof. How’s the lens? Looks like a 70-200 or 100-400 based on the color.",
            "Wrap that strap around your wrist once and it would have been fine. But hindsight is 20/20 right? Aw, I'm legit sorry but it's now a badge of honor. Proof of use and unless some of the mech is misbehaving, shouldn't be a problem. How did the lens take the drop? I would be more worried about that.",
            "you're a war photographer now, son",
            "as long as the camera is ok those scratches adds character to the camera imo 😆😆",
            "The first lesson my photographer father told me, when he bought me my first camera on my 10th birthday was, first thing you do when you take your camera is to put the strap around your neck - or wrist.",
            "idk why but i like the scratches and beat up look on the high end digital cameras. makes them unique to you and they give them like soul",
            "That's what sharpies are for..",
            "You might want to get the IBIS and shutter checked, as they might be damaged..."
        ]
    },
    "Saw this while doing a photoshoot, couldn't pass it up": {
        "title": "Saw this while doing a photoshoot, couldn't pass it up",
        "score": 151,
        "url": "https://i.redd.it/d694pwyyed9d1.jpeg",
        "content": "",
        "num_comments": 19,
        "comments": [
            "Damn that Prius looks amazing",
            "Saw what?",
            "https://preview.redd.it/82djuqxjie9d1.jpeg?width=3376&format=pjpg&auto=webp&s=5e335f488ace4fcb3df4b4c1c0fca2721bc0714c",
            "https://preview.redd.it/fh5du5u7te9d1.jpeg?width=3376&format=pjpg&auto=webp&s=3917048c6356c1511e8184a142f4921396bdf030",
            "You forgot to turn off “nightshift” mode on your camera. Im not trying to read an article, im just here to see the picture!",
            "Mustard white balance.",
            "good to see one actually being driven, whoever owns it knows what they are doing!",
            "Drive it like you stole it and stuff",
            "What car",
            "Did you purposely process like this or is your white balance off? Honest question not trying to be a dick just curious. Also did you miss focus or are my eyes bugging"
        ]
    },
    "A house in Iceland": {
        "title": "A house in Iceland",
        "score": 96,
        "url": "https://i.redd.it/c3uz4na1vd9d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Beautiful Capture 😍",
            "Shot on Sony a6500 + Tamron 17-70 f2.8 at 58mm aps-c, ISO 100, f/8, 1/1000",
            "God rays 💕",
            "Very lucky with the light, gorgeous shot! I'm heading over there in a few weeks, I can't wait!!",
            "You make me miss my a6500 🥲 Gorgeous shot.",
            "Yeah that’s a great machine! Actually I also don’t have it anymore, I sold it to upgrade to an a7iii. Apart from functionalities, the upgrade is not that big, the 6500 is very very capable."
        ]
    }
}