{
    "All Space Questions thread for week of June 23, 2024": {
        "title": "All Space Questions thread for week of June 23, 2024",
        "score": 11,
        "url": "https://www.reddit.com/r/space/comments/1dms3cg/all_space_questions_thread_for_week_of_june_23/",
        "content": "Please sort comments by 'new' to find questions that would otherwise be buried.\n\nIn this thread you can ask any space related question that you may have.\n\nTwo examples of potential questions could be; \"How do rockets work?\", or \"How do the phases of the Moon work?\"\n\nIf you see a space related question posted in another subreddit or in this subreddit, then please politely link them to this thread.\n\n&#x200B;\n\nAsk away!",
        "num_comments": 94,
        "comments": [
            "Are any studies about properties of white dwarf planetary systems existing? I found a bit of info about such things as post-main sequence formed helium gas giants. But it would be interesting to see other peculiarities of planet formation in such systems: composition of debris disc enriched by materials produced via nucleosynthesis, cooling rate of celestial bodies, level of illumination produced by white dwarf, how previously formed planets are affected, et.c.",
            "In Tim Dodd's recent interview with Elon Musk the build site seemed very empty and tidy. Did SpaceX shut down the whole site for the interview or do they often have days off where there's hardly anyone around?",
            "Will they launch space probes to Quaoar, Sedna, Orcus, Haumea, Eris, Makemake, and Gonggong? We want to see what they really look like.",
            "What would be the biggest challenges in multi-planet communications between human colonies?",
            "Does the moon \"effectively\" orbit the earth as if there was nothing else in the solar system, or is it really obvious that things other than earth is impacting it?\n\ndoes the orbit look \"wobbly and weird\", or does it look smooth",
            "If a country or company goes to SpaceX to launch something, does SpaceX contact the FAA, space force, NASA, someone else (?), to approve that payload?",
            "Does anyone have any decorating or display ideas for mission patches? I have a few from work that I would really like to display at my home because well, I'm proud to have worked it haha",
            "If the Milky Way had a quasar, how bright would it be?",
            "What are the progress on and prospects of the water extraction from moon surface and converting it into fuel ?",
            "Is max Q always around Mach 1? Watching the Falcon Heavy the two calls are almost simultaneous."
        ]
    },
    "Boeing, NASA consider extending astronauts’ Starliner mission up to three months": {
        "title": "Boeing, NASA consider extending astronauts’ Starliner mission up to three months",
        "score": 1029,
        "url": "https://www.cnn.com/2024/06/28/science/nasa-boeing-starliner-mission-90-days-scn/index.html",
        "content": "",
        "num_comments": 368,
        "comments": [
            "So they packed 90 days worth of pb&j sandwiches just in case?",
            "There's a maximum time the capsule is designed to stay in space, anyone know what it is and which components would be most impacted?",
            "They were talking about a maximum hard limit on the mission just last week.  I wonder what changed.",
            "Thats the responsible move.  Of course, the second best responsible move would have been to postpone the launch.",
            "These astronauts are gonna be saying Hi, Bob to each other for the rest of their lives.",
            ">Overcoming the perception that Boeing has underperformed in this program, however, has been a challenge for the aerospace giant already suffering major reputational setbacks in its airline division.\n\nHow is this just a \"perception\"? Boeing got more money and more time to do the same thing as SpaceX - look at the results.",
            "Are they going to make it back before SpaceX de-orbits the station?",
            "\"We have altered the deal. Pray we do not alter it further.\"",
            "At this rate, they be going up on a Starliner and coming down on a Starship.",
            "Everything else aside, if I were one of the astronauts, I would be stoked. Scheduled for a quick jaunt up, then, \"well, how would you like to do science on the ISS for the next three months?\"\n\nI would think, hell yes. Take as much time as you need. I just got the gift of three months in space. And particularly because this is probably the last trip to space for both of them."
        ]
    },
    "A chunk of space debris found in N.C. came from a SpaceX capsule, NASA says": {
        "title": "A chunk of space debris found in N.C. came from a SpaceX capsule, NASA says",
        "score": 888,
        "url": "https://www.nbcnews.com/science/space/nasa-space-debris-north-carolina-came-from-spacex-capsule-rcna159135",
        "content": "",
        "num_comments": 131,
        "comments": [
            "> he said he wasnt initially sure if it was safe to touch.\n\nSmart guy. Not many people can resist the urge to touch something new and interesting.",
            "This is a concern with every spacecraft, to be sure. It's just notable that the Dragon capsule trunk seems to be somewhat more resilient to the forces of reentry than anticipated, since several have now been found on the Eastern Seaboard.",
            "This absolutely should not happen, but at the same time I would definitely be psyched if it landed in my yard and nobody came to get it.",
            "Imagine the headlines and posts/comments in this sub if this was Starliner. The spin would be the complete opposite.",
            "Lmao Im not even defending China but the hypocrisy here is hilarious.",
            "hope they are more careful with ISS .. when is that supposed to happen?",
            "Eventually someone is going to get killed if they dont figure this shit out. I hope Im wrong.",
            "How many times can this be posted per day?  Seriously stop",
            "They need to be more responsible with their toys...",
            "That just means its better engineered.. the dragon is much more reliable that starliner so "
        ]
    },
    "A harmless asteroid will whiz past Earth Saturday. Here's how to spot it": {
        "title": "A harmless asteroid will whiz past Earth Saturday. Here's how to spot it",
        "score": 219,
        "url": "https://apnews.com/article/asteroid-sighting-2024-mk-telescope-bef7b66335d9855bf7557ce37ac24f41",
        "content": "",
        "num_comments": 31,
        "comments": [
            "It's passing by at 0.8 lunar distances. That's not that abnormal. There's another much smaller asteroid passing by at 0.2 lunar distances the day before.",
            "Interesting! What I read about this was that \"IF\" it were to hit a city on the U.S. east coast it would devastate the eastern seaboard. Doesn't sound harmless to me!",
            "I'd hardly call a 120-260m asteroid \"harmless\".  Is a bullet harmless simply because it misses you?",
            "If the math is off by a small amount, where would it hit earth. Are the same people who are watching this asteroid are they the same ones who crashed space craft on the moon and Mars and other planets .and if it comes closer, then predictions. What effect would it have on earth.",
            "A thing is only harmful if it causes harm. Otherwise its harmless.\n\nBeing that nearly everything has some ability to cause harm, itd be a pointless distinction if we were only concerned about potential.",
            "If the bullet misses you then yes, it was harmless. Are ALL bullets harmless? No of course not.\n\nSame with asteroids. This particular one is harmless",
            "You could say that about any object. Is an anvil or other heavy weight harmless simply because it stays on the ground and doesn't crush anyone's head. Is a Trojan asteroid harmless simply because it doesn't come anywhere near us?\n\nI'd suggest \"yes\" to both.",
            "If it collided with us Im pretty sure the Earth would more or less survive and it wouldnt. So really were the dangerous ones.",
            "A bullet is part of a weapon designed to kill.\n\nAn asteroid has no moral qualms it is but an orbiting object, perhaps it was even here in the solar system first",
            "Significantly smaller if it actually broke through our atmosphere."
        ]
    },
    "NASA delays next ISS spacewalk until end of July due to spacesuit leak issue": {
        "title": "NASA delays next ISS spacewalk until end of July due to spacesuit leak issue",
        "score": 30,
        "url": "https://www.space.com/nasa-iss-spacewalk-delay-july-leak-issue",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Oh man, the jokes literally write themselves on this one...",
            "This is starting to turn into a movie like \"*Gravity*\" (2013).\n\nhttps://www.youtube.com/watch?v=OiTiKOy59o4"
        ]
    }
}