{
    "Who are you watching this weekend? (June 28)": {
        "title": "Who are you watching this weekend? (June 28)",
        "score": 4,
        "url": "https://www.reddit.com/r/speedrun/comments/1dqn49o/who_are_you_watching_this_weekend_june_28/",
        "content": "Anything cool happening in the speedrunning world this weekend? Into a new game or streamer and can't wait to watch more runs? Just find an awesome speedrunning YouTube channel? This is the place to tell everyone about it! Feel free to link streamers, YouTube channels, or any other related information here, just be mindful of the [subreddit](https://www.reddit.com/r/speedrun/about/rules/) and [reddit's overall self-promotion policies](https://www.reddit.com/wiki/selfpromotion).",
        "num_comments": 2,
        "comments": [
            "There might be a little thing getting started this Sunday.",
            "I got a new WR in ssx3 100% :)"
        ]
    },
    "Bragging Wednesday (June 26)": {
        "title": "Bragging Wednesday (June 26)",
        "score": 3,
        "url": "https://www.reddit.com/r/speedrun/comments/1dp1f99/bragging_wednesday_june_26/",
        "content": "Get a new PB? Learn a new game? Figure out Barrier Skip? Here's the place to show off! Feel free to link to your stream as well.",
        "num_comments": 2,
        "comments": [
            "\"maybe this WR will survive at least a day?\" its the description that i put on my Speedrun World Record in [MS Pac-Man 10000 points gameboy version](https://youtu.be/91yQrvJdRQA) that i set more than 3 years and 3 months ago thats still standing to this day, i even forgot about me getting it and just find it again after setting the WR for the Atari 2600 version and for fun checking the other categories, it isnt the most contested record ever or even in MS Pacman itself but its cool to think about it.",
            "Damn, nice dude. It's especially impressive when a record on such a short run lasts that long. It's holding strong despite a relatively low barrier to entry. Nice job."
        ]
    },
    "In UNDER 49 hours, Summer Games Done Quick (SGDQ2024) WILL BE LIVE!! June 30th - July 7th!!!": {
        "title": "In UNDER 49 hours, Summer Games Done Quick (SGDQ2024) WILL BE LIVE!! June 30th - July 7th!!!",
        "score": 101,
        "url": "https://www.reddit.com/r/speedrun/comments/1dqmpt6/in_under_49_hours_summer_games_done_quick/",
        "content": "--- Let's see if this works since I've been having trouble posting once again... sigh! ---\n\n**Hello there everyone! It is I! Thorebane, once again, I am here to give you  the upcoming GDQ event info and links as I do each year!**\n\nWith that now out the way, **WELCOME!!!**\n\nThis year, we are hosting at and from:-\n\n# Hilton Minneapolis Downtown1001 Marquette Ave, Minneapolis\n\n\n\n* **This event will be a mixed of in person, AND online runs!!!**\n\n* **This event will also be raising money for the charity: --**  \n\n# Doctors Without Borders/Médecins Sans Frontières (MSF)\n\n\n\nSo... what is GDQ?\n\n**GDQ** is a semi-annual video game speed-run charity marathon held in the United States, originally organized by the Speed Demo's Archive and Speed-runs Live communities. The two main marathons, **AGDQ** and **SGDQ**, are both 7-day, 24-hour straight marathons that are streamed on Twitch and YouTube.\n\nApart from the streams being in English, in the last few years there has been a French, German, Spanish, Russian and even a full Japanese re-stream, with people giving up their own time to translate and commentate in their own native language. Since 2015, it has been handled by Games Done Quick, LLC.\n\nHeld since 2010, the events have raised money for several charities; the most common two being the Prevent Cancer Foundation (**AGDQ**) and Doctors Without Borders (**SGDQ**)\n\nBelow is this year's schedule! (The schedule will automatically revert to the time zone you're logged in on now!)\n\n[--- Schedule ---](https://gamesdonequick.com/schedule/48)-- (Updated now and should be the new fancy layout!)\n\n**Below is the VOD Post for the last major marathon - AGDQ2024 if you'd like to catch up on some games that ran earlier this year! (** u/VODThread I hope you got your scripts set up ready this year again, 2 days ;) ! hehe)\n\n[--- AGDQ 2024 VOD link! ---](https://www.reddit.com/r/speedrun/comments/1964i5u/agdq_vod_thread_2024/)\n\nThe link below is for the main Twitch stream - (Many re-streams on e.g. Twitch, YouTube, and other platforms will happen, including multi-language streams, however, Twitch is the mainstream that GDQ goes live on as usual).\n\n[https://www.twitch.tv/gamesdonequick](https://www.twitch.tv/gamesdonequick)\n\nBelow is the link to donate! Here you can also split amounts and pick depending on what money you donate, to win prizes and other things like choosing names of characters in some games, or even voting for bonus  games/levels/rounds!\n\n(More will unlock as the event goes on)\n\n(100% of **ALL** donated money goes directly to Prevent Cancer Foundation). (Please let's not have the fake rumours start again :P )\n\nLet's raise some money!\n\n[---Donation Link---](https://gamesdonequick.com/tracker/ui/donate/46) (Currently down, will update when open!)\n\n[---Prize List---](https://tracker.gamesdonequick.com/tracker/prizes/SGDQ2024)   (Updated - Of course we cannot forget about the PRIZE LIST!!)\n\nAnd finally, - If you want to join the Discord for GDQ -- [Here's the link for that!!](https://discord.gg/gamesdonequick)\n\n(This will update as the event goes on, but you can get a head start at looking at what prizes can be won this year!)\n\nIf you want to follow along with some trackers to do with donations and viewers, here is a fantastic tool to watch.\n\n--- [Alligator's GDQ Comparison](https://gdq.alligatr.co.uk/comparison/) --- (Already has a tab for SGDQ 2024)\n\n--- [OR! The GDQ site one! ](https://gdqstats.com/?series=0)---\n\n-EDIT-\n\nFew last random facts and info!\n\n**What do AGDQ and SGDQ stand for?!**\n\n**AGDQ** -- Stands for **A**wesome **G**ames **D**one **Q**uick.  \n\n\nOriginally called **C**lassic **G**ames **D**one **Q**uick (CGDQ), This marathon is usually held at the start of each year and  runs for a week straight (most typically starting the first or second  week of Jan running Sunday to Sunday).  \n\n\n**SGDQ** -- Stands for **S**ummer **G**ames **D**one **Q**uick.  \n\n\nThis marathon is usually held at the start of most people's  summers/end of exam time for schools. (Most typically a week either at  the end of  June or the start of July, again, running Sunday to Sunday).\n\nIn total, as of June 2024, GDQ has now raised for charities since it began over:\n\n* **$49.1 million (That's insane!!!)** across multiple marathons and through more than 877,000 separate donations from over 265,000 unique donors.\n\n---- **(WE'RE GONNA BREAK THE 50 MILLION MARK THIS EVENT!!!)** ----\n\n* Last event - **AGDQ 2024** raised a total of --- **$2,539,832 - Let's BEAT THAT FOR THIS EVENT!!!**\n\n\n\nSo what games or runners are catching your attention?!\n\nWhat intro are the hosts going to make us laugh with this year?!\n\nWhat prize do you want to donate for?!\n\nLet's get some HYPE! 💪🕹️🎮\n\nSee you on Sunday peeps!!",
        "num_comments": 13,
        "comments": [
            "Thursday night's lineup looks amazing! Halo 3 4 player Co-Op on legendary is gonna be intense! But even more wholesome and amazing is the run that follows - Ken Griffey Jr. Presents Major League Baseball run by JSR AND his amazing dog Peanut Butter, making his GDQ return to the big stage! Peanut Butter was featured at AGDQ this year and he was the most adorable speedrunner dog ever!",
            "Which runs will be the hypest?",
            "Very much looking forward to this. Been a rough couple month, and these always put a smile on my face.",
            "Fully stoked, been watching VODs of years past this week in anticipation.",
            "gaming",
            "Does anybody have a link to an ical? While I love the gamesdonequick schedule, it's valuable to put it in my Google calendar. Normally I'd use horaro, but they don't seem to have one for SGDQ 2024.",
            "> (100% of ALL donated money goes directly to Prevent Cancer Foundation)\n\nHeads up - you probably meant to say Doctors Without Borders there!",
            "Peanut Butter the dog beating Ken Griffey Jr Presents: Major League Baseball.",
            "https://www.reddit.com/r/speedrun/comments/1djiway/sgdq_2024_calendar_import/",
            "I saw someone link it somewhere a few weeks back, but I didn't save it.. if I find I'll add here. =)"
        ]
    },
    "I beat the entire Ratchet & Clank series in under 10 hours!": {
        "title": "I beat the entire Ratchet & Clank series in under 10 hours!",
        "score": 9,
        "url": "https://youtu.be/WzoNaspODcA",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Skate 2 Speed Running is Not Worth It - Part 2": {
        "title": "Skate 2 Speed Running is Not Worth It - Part 2",
        "score": 9,
        "url": "https://v.redd.it/mfwyjd84ie9d1",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}