{
    "Who are you watching this weekend? (June 28)": {
        "title": "Who are you watching this weekend? (June 28)",
        "score": 5,
        "url": "https://www.reddit.com/r/speedrun/comments/1dqn49o/who_are_you_watching_this_weekend_june_28/",
        "content": "Anything cool happening in the speedrunning world this weekend? Into a new game or streamer and can't wait to watch more runs? Just find an awesome speedrunning YouTube channel? This is the place to tell everyone about it! Feel free to link streamers, YouTube channels, or any other related information here, just be mindful of the [subreddit](https://www.reddit.com/r/speedrun/about/rules/) and [reddit's overall self-promotion policies](https://www.reddit.com/wiki/selfpromotion).",
        "num_comments": 4,
        "comments": [
            "There might be a little thing getting started this Sunday.",
            "I got a new WR in ssx3 100% :)",
            "Just over 24 hours to go!!  \nI’m really excited for this year as I’ll get to watch a lot of GDQ on a giant video screen whilst I’m at work lol",
            "Grats!! 🥳"
        ]
    },
    "Bragging Wednesday (June 26)": {
        "title": "Bragging Wednesday (June 26)",
        "score": 2,
        "url": "https://www.reddit.com/r/speedrun/comments/1dp1f99/bragging_wednesday_june_26/",
        "content": "Get a new PB? Learn a new game? Figure out Barrier Skip? Here's the place to show off! Feel free to link to your stream as well.",
        "num_comments": 2,
        "comments": [
            "Damn, nice dude. It's especially impressive when a record on such a short run lasts that long. It's holding strong despite a relatively low barrier to entry. Nice job.",
            "\"maybe this WR will survive at least a day?\" its the description that i put on my Speedrun World Record in [MS Pac-Man 10000 points gameboy version](https://youtu.be/91yQrvJdRQA) that i set more than 3 years and 3 months ago thats still standing to this day, i even forgot about me getting it and just find it again after setting the WR for the Atari 2600 version and for fun checking the other categories, it isnt the most contested record ever or even in MS Pacman itself but its cool to think about it."
        ]
    },
    "Elden Ring Shadow of the Erdtree hitless in 53:05": {
        "title": "Elden Ring Shadow of the Erdtree hitless in 53:05",
        "score": 15,
        "url": "https://www.youtube.com/watch?v=URJulP5-TQo",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Wow, I'm pretty sure I did an all hit run. Can't wait to check this out later to see how you dodge some attacks properly.",
            "He mostly just dicks the bosses down before they get a chance to act"
        ]
    },
    "I beat the entire Ratchet & Clank series in under 10 hours!": {
        "title": "I beat the entire Ratchet & Clank series in under 10 hours!",
        "score": 34,
        "url": "https://youtu.be/WzoNaspODcA",
        "content": "",
        "num_comments": 2,
        "comments": [
            "I can appreciate the dedication",
            "wow that's crazy"
        ]
    },
    "Just noticed I'm in the area for SGDQ, can you just like... show up or do you really have to register well before hand": {
        "title": "Just noticed I'm in the area for SGDQ, can you just like... show up or do you really have to register well before hand",
        "score": 7,
        "url": "https://www.reddit.com/r/speedrun/comments/1dr6ir6/just_noticed_im_in_the_area_for_sgdq_can_you_just/",
        "content": "",
        "num_comments": 3,
        "comments": [
            "You can come to the event hotel and meet up with people in the lobby if you have friends who are here, but won’t be able to go into any of the event spaces.",
            "Event registration is sadly closed. Good news is they've hosted it in Minneapolis for a decade now so it's likely that's where it will stay for next year, though we'll get confirmation of that at the end of the week most likely.",
            "According to their website, you cannot register in-person. This link says as of now there are 67 spots open. https://gamesdonequick.com/marathons/clut3zj5r0002xc01yi4t61gf\n\nI hope you are able to go! I’ve been watching GDQs for so long now, attending one seems kinda fun despite what anyone says. Digging into their registration process kinda got me thinking of going for the hell of it. One day, maybe…"
        ]
    }
}