{
    "We need you to contribute to the new rules of our Subreddit ": {
        "title": "We need you to contribute to the new rules of our Subreddit ",
        "score": 26,
        "url": "https://www.reddit.com/r/Spiderman/comments/1dodsff/we_need_you_to_contribute_to_the_new_rules_of_our/",
        "content": "Hello everyone!\nCurrently, we are in the process of working out new rules for the subreddit and decided to have you help out with it.\n\nA lot of people have sent us questions about what is considered a tired post or not and with the new rules to hopefully be more clear on that end, we decided to see what you consider to be a tired post!\n\nPlease comment what you think counts and we'll look it over for consideration.\n\nEdit :- These Morrigan posts are getting kinda out of hand. So, We will also be focusing to control that and remove the low effort and extra Lewd once ",
        "num_comments": 39,
        "comments": [
            "i think who is the best love interest posts should stop",
            "Maybe a temporary moratorium on posts about Paul would be a good idea, I think some people in this sub have an unhealthy fixation on him and could benefit from taking a break\n\nOr at least create a Megathread or Daily Discussion thread to at least declutter the sub/reduce the amount of posts about him.",
            "Get the Paul whiners out. We get it. We may even agree. However, your ten millionth jab at a fictional guy none of us liked in the first place accomplishes nothing. The horse is a fine mist or putty or something totally unrecognizable at this point. Please stop beating it.",
            "Paul, Paul, Paul, it's always about Paul! 😂\n\n![gif](giphy|antKRCcXZS5K8)",
            "Pleeeeeeease enforce stricter rules regarding spoilers. I'm in Australia, so my copy of Ultimate Spider-man is always 2-3 weeks behind the US release. The amount of times I just have to mute this subreddit because someone posts a screengrab of a panel that spoils some content...\nI know this must be hard, and my situation is uncommon (but hardly unique), but a minimum time frame after release of new media, to avoid hard spoilers or crack down on those soiling would be appreciated",
            "Can we have a harder ban on all Batman Arkham memes? That nonsense is just ruining subs. Keep it there where people want it.",
            "Any chance you could condense the paul whinging into a mega thread? No need for twenty new ones every other day.",
            "I hate the character of paul as much as anyone but after daily post about him im just like \"ohhhh brother will you guys get another hobby!\"\nSeriously this sub is the only time im reminded he exists",
            "I think there should be a daily discussion thread on how we would end the Paul storyline if we were authors\n\n/s",
            "The majority here is talking about limiting the Paul posts that has been a problem for a year(or more), but you guys decided instead to go after the Morrigan posts that is something from last week?!"
        ]
    },
    "26/06/24 Comic Discussion Round-Up (The Spectacular Spider-Men #4 & MORE)": {
        "title": "26/06/24 Comic Discussion Round-Up (The Spectacular Spider-Men #4 & MORE)",
        "score": 6,
        "url": "https://www.reddit.com/r/Spiderman/comments/1dotz3c/260624_comic_discussion_roundup_the_spectacular/",
        "content": "**Today's Comic Discussion Threads**\n\n* [The Spectacular Spider-Men (2024) #4 | Official Discussion Thread](https://www.reddit.com/r/Spiderman/comments/1dosdp8/the_spectacular_spidermen_4_official_discussion/)\n* [Superior Spider-Man (2023) #8 | Comic Discussion (r/SuperiorSpiderMan)](https://www.reddit.com/r/SuperiorSpiderMan/comments/1dotruw/superior_spiderman_2023_8_comic_discussion/)\n* [Jackpot & Black Cat (2024) #4 | Comic Discussion (r/BlackCat)](https://www.reddit.com/r/BlackCat/comments/1dotu2s/jackpot_black_cat_2024_4_comic_discussion/)\n* [Symbiote Spider-Man 2099 (2024) #4 | Official Discussion Thread (r/SpiderMan2099)](https://www.reddit.com/r/SpiderMan2099/comments/1dosdpx/symbiote_spiderman_2099_4_official_discussion/)\n* [Spider-Gwen: The Ghost Spider (2024) #2 | Comic Discussion (r/SpiderGwen)](https://www.reddit.com/r/SpiderGwen/comments/1dop1rk/happy_gwensday_spidergwen_the_ghostspider_2_is/)\n\n---------------------------------------------------------------------------------------------------------------\n\n[Last Week's Discussion Threads](https://www.reddit.com/r/Spiderman/comments/1djffhm/190624_comic_discussion_roundup_the_amazing/)",
        "num_comments": 0,
        "comments": []
    },
    "It’s ironic really ": {
        "title": "It’s ironic really ",
        "score": 1216,
        "url": "https://i.redd.it/lixy1arxae9d1.png",
        "content": "",
        "num_comments": 40,
        "comments": [
            "Tell me about it. I had someone try to rationalize this by saying that my enjoyment of Spider-Man was a subconscious coping mechanism, Peter is the alpha spider so he wouldn't fear or hate other spiders.",
            "This was literally me yesterday, massive Spidey fan but as soon as I saw a spider the size a large coin crawl out from under the bathroom door, I ran faster than Usain",
            "Same. Terrified of spiders, Spider-Man is my favorite superhero and I have his emblem on a shirt",
            "This is just me in a nutshell, I have arachnophobia (fear of spiders), but i love spider man he's one of my favorite superheroes and just characters in general, however I hate spiders is the strangest thing",
            "I think it’s the man part that really helps me like him.",
            "I’ve heard that was sort of the idea, you had this skinny kid who could crawl on the walls, like a spider, but also like he was possessed by a demon. So they were like “let’s make this spooky bitch a superhero” or something along those lines.",
            "One is an evil menace to society. The other is your friendly neighborhood, Spider-Man.",
            "Bro uncool. Spiders are rad",
            "I love spiders. Dont get me wrong, I dont want them on me unless they're really small, but I still enjoy their existence.",
            "The same reason I idolize Spider-Man but Spiders-Man and Man-Spider terrify the bejeezus out of me"
        ]
    },
    "Dang!!": {
        "title": "Dang!!",
        "score": 145,
        "url": "https://i.redd.it/vm1t6x0n4h9d1.jpeg",
        "content": "",
        "num_comments": 15,
        "comments": [
            "source of the 2nd one?",
            "What's that second picture from?",
            "At least the one from Invincible is ACTUALLY another Spider Man variant.",
            "from where does this pic come from?",
            "What the hell is that?!",
            "Ironic because they’re getting a Spider-Man Noir series",
            "thank you also nice hishe pfp",
            "No need to yell, mate",
            "You’re welcome also thanks I love Hishe",
            "It comes out next Thursday"
        ]
    },
    "Put These 4 In The Same City, Who’s pulling The Most Girls?": {
        "title": "Put These 4 In The Same City, Who’s pulling The Most Girls?",
        "score": 2154,
        "url": "https://i.redd.it/qls7s4dp1c9d1.jpeg",
        "content": "",
        "num_comments": 526,
        "comments": [
            "Not this version of Spiderman, that’s for sure",
            "I guess it depends upon how many psychics are in the area. The more their are the more Scott is likely to win.",
            "Not Kyle Rayner that’s for sure.",
            "This list is a bit unfair, Nightwing would sweep all the ladies while cyke is still strategizing about how to get one, pete cursing on his parker luck and kyle finding full fridges…",
            "I‘d definitely go with Nightwing so that’s my pick",
            "The girls are def getting Dick",
            "Nightwing. A hot, strong, emo man that's a good man.. That's like every woman's wet dream.",
            "Scott only gets telepaths, Kyle's always end up in the fridge, Peter only wants mj so nightwing is my pick.",
            "Peter will have the most and right before we tally the points they're all gonna a dump him",
            "All 4 of them have pull power but I gotta give it to Nightwing"
        ]
    }
}