{
    "Weekly Aquerium - Ask your questions in here!: June 23, 2024": {
        "title": "Weekly Aquerium - Ask your questions in here!: June 23, 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/splatoon/comments/1dmlmn5/weekly_aquerium_ask_your_questions_in_here_june/",
        "content": "Hey there Squids, Octos, and sea creatures of any kind!\n\nWelcome to the Weekly Aquerium! If you have a burning question, or looking to make new friends, here's the place to be!\n\nNew posts are pinned up on Sunday mornings at 9am ET, and they'll stay there until the following Sunday where they'll be replaced by a new thread (Pending special events and the like).\n\nBefore posting, why not check with the [Splatoon FAQ](https://www.reddit.com/r/splatoon/wiki/splatoon3_faq/) to see if your question has already been answered, or do a general search of the subreddit. If it hasn't, this is the place to be!\n\n# How do I ask questions here?\n\nThe primary use of the Weekly Aquerium is to have the freedom to ask away with any bubbling questions you may have! While this is mostly to help reduce clutter with repeat posts on the subreddit, there are various types of questions which are better asked here! These includes questions such as:\n\n* Simple Yes/No answers\n* One answer questions\n* \"How \\_ works\" or \"Why is \\_ like this\"\n\nIf you have questions which don't fit the criteria above (Such as broad questions, gear or weapon choices), you're welcome to post them to the subreddit! And if you are unsure whether a question should go here or on the subreddit, it's still perfectly fine to post straight to the subreddit!\n\n# What if I want to look for new friends?\n\nThe secondary use of the Weekly Aquerium is to double as a place to find new friends, a squad search of sorts!\n\nSince Reddit isn't the easiest place to organise your matches, we suggest joining the [r/Splatoon Discord Server](https://discord.gg/rsplatoon) where they have dedicated channels for voice chat, match finding, and metagame discussion for all your squid game needs! If you still prefer using Reddit, you are also free to look for new friends here by leaving your friend code below, or even giving a friendly hello to others!\n\n# Closing out!\n\nWe hope that this thread will be of good use to those who come across it! Once again, join the [r/Splatoon Discord Server](https://discord.gg/rsplatoon) to stay in touch! And with that, be sure to Stay Fresh, Stay Off the Hook, and Catch ya Later!",
        "num_comments": 38,
        "comments": [
            "I don't believe I'm physically capable of reacting to bombs. I don't know why others can do it but I can't. I have been playing shooter games all my life and have 2k+ hours in Splatoon alone. I don't know what to do anymore. I am beginning to think I am just physically unable to improve my reaction speed and I don't know what to do in a game as fast as this if that's the case. How can I fix/work around this?",
            "PEOPLE wth is going on with the S2 matchmaking??\nI get it, everyone went to S3, but it's been weeks since l last formed a complete Salmon Run team, and I can't even think of getting into ranked matches.. not a SINGLE player connects... maybe I have a some setting off or something so please if anyone has any recommendations l'd love to hear them",
            "Bro why did they kill Splat 1? I mean I know why but it’s more of a devastated one then a normal one",
            "Hi everyone, I used to play Splatoon 2 around 4 years ago during the pandemic but never decided to pull the trigger on 3. I know it has been almost 2 years since it was released and was wondering how late in its lifecycle it is regarding splatfests, new weapons, DLC etc. I was also wondering if there are any toxic metas in the new game, as I have recently grown frustrated with games like Fortnite, Brawl Stars, and R6 siege with their toxic players/ insane skill gaps. Thanks!",
            "Why does the matchmaking suck?",
            "So why do I randomly get the \"communication error has occurred\" in the middle of a match. It kicks me out and counts it as a loss even though I do purposely dc. My wifi will be perfectly fine for a long time before that too.",
            "Any weapons tier list by Anarchy Rank?   \nWent on a hiatus and came back, decided to play Heavy Splatling was having fun in A+, ranked up into S, and suddenly everyone moves so fast and sideways, I felt Heavy Splatling ain't cutting it in S rank, in fact I rarely seen any splatlings in S. Wondering if I should just derank back to A+ or change back to other weapons.",
            "Why do people disconnect from matches so often",
            "Usually, its the same with me, as soon as i start to hear a bomb, or just think one is going to be thrown (for example, at a area where all my team mates are) i just move further away from the fight, since bombs can only go so far…\nSometimes you can’t avoid a bomb, so then you don’t have to worry about it being your fault, I’d say practice avoiding bombs with the copy machine…\nI hope this helps (I mostly rambled here didn’t I?)",
            "The only suggestion coming to mind is to try playing different times of day if possible. The game mostly tries to match you with players who are close to you, so if you happen to be playing at off hours for your location, you're probably going to have some issues filling lobbies."
        ]
    },
    "Our statement on Jackpot": {
        "title": "Our statement on Jackpot",
        "score": 1040,
        "url": "https://www.reddit.com/r/splatoon/comments/1ddv9zk/our_statement_on_jackpot/",
        "content": "## Addressing the Jackpot controversy\n\nWe have seen the matter with the world champions, Jackpot, and we are just as disgusted with the screenshots. We want to say that we do not tolerate any of their behavior. The slurs and \"jokes\" they made do great damage to the minorities within the splatoon community if not every community there is, and everyone should know how damaging it is in our human history. Behaviour like this is reprehensible and shouldn't be welcomed in any community, and will not be welcome in ours.",
        "num_comments": 318,
        "comments": [
            "They’ll probably disband faster than ever now this has happened. They supposedly already had plans to disband weeks ago. I do wonder what is gonna happen to some weird contract they were going to sign this year… most likely gone now lol.",
            "Dude, what the hell is going on, and where have I been to somehow not have been seeing it?",
            "Why does it sound like something that would happen in valorant.",
            "Is there anywhere with more information about this or is it better that I don't learn any further than what this post says?",
            "What a bloody hell is happening over there",
            "I don't follow the competitive side so i'm kinda walking into this post like\n\n![gif](giphy|BfiL8ZJWqfw7C|downsized)",
            "don't harass individuals using the world champs splashtag many may not know what is going on.",
            "They cant be saying stuff like that, this game series is about ending a race war I mean cmon",
            "I may not have known the drama\nBut l getting annoyed that there so messed up shit DURING THE END OF A GAME",
            "No one is gonna use the Jackpot splashtag now, huh"
        ]
    },
    "M A S K": {
        "title": "M A S K",
        "score": 740,
        "url": "https://i.redd.it/gmchl70cjd9d1.jpeg",
        "content": "",
        "num_comments": 57,
        "comments": [
            "What am i looking at",
            "It’s funny to think of the arms as legs and the legs as arms",
            "why are they spreading their inkussy",
            "I'm going to wear this mask and the friendship bracelet to make the most cursed Splatfest outfit ever.",
            "It’s not even Halloween yet and they trying to scare us",
            "It's got kewpie doll vibes and I don't like it",
            "Hey how did my sleep paralysis demon get onto reddit",
            "What a horrible day to have eyes",
            "Hey can everyone wear these just to see a whole match of one and to look stupid.",
            "Someone did they same emote with he text: “bussy attack”"
        ]
    },
    "Why is the Summer Mask Creepier than the Actual Halloween Cosmetics?": {
        "title": "Why is the Summer Mask Creepier than the Actual Halloween Cosmetics?",
        "score": 1036,
        "url": "https://i.redd.it/fj6madeovc9d1.jpeg",
        "content": "",
        "num_comments": 47,
        "comments": [
            "It’s the killer of Eeltail Alley",
            "remind me of that doll from that horror movie (i forgot the name of it)",
            "I refresh my page and then I saw this thing staring into my soul. What even is that mask?",
            "And this is coming from the guy who wears the Bleak Beak regularly.",
            "Where can you get this?",
            "That inkling looks like it wants to stab me",
            "This feels like that one teacher doll(??) Thing from poppy playtime 3, like idk the face just makes me think of her before her face got fucked up.",
            "It's the Uncanny Valley. It's close enough to what you know to be \"right\" to match the concept visually, but it's also just off enough to be like \"this is wrong, very wrong\".\n\nIntentional design in this case but you can see it in a lot of bad CGI.",
            "Dear cod that is terrifying",
            "how do you get that"
        ]
    },
    "Summer Agent 8 (OC)": {
        "title": "Summer Agent 8 (OC)",
        "score": 368,
        "url": "https://i.redd.it/gpqxikpife9d1.png",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Why is she so huggable (and why does she have a beak).",
            "Ooooh she’s so wonderful!! Absolutely fantastic work on this!!!",
            "I love the little yaiba, I want ot squish her cheeks so bad!",
            "Awwwwww look at this precious little Veemo!!! Fantastic job my friend!!! ♡(⁠´⁠∩⁠｡> ω <｡⁠∩⁠`⁠)♡",
            "Aww, that looks so cute, she’s jus chillin 💖",
            "YOOOOOO! She's adorable ;w; I wanna hug her so so badlyyy ;w; Have some love <33333",
            "She's octopus. Octopi have beaks",
            "Thank you!! Really tried to nail the Splatoon aesthetic with this one",
            "This is a certified #Veemo moment!\n\n![gif](giphy|zor5shGGELirPfreQs)\n\n![img](emote|t5_324q4|4051)",
            "Cute Veemo"
        ]
    }
}