{
    "Spotify Support/Complaint Megathread": {
        "title": "Spotify Support/Complaint Megathread",
        "score": 238,
        "url": "https://www.reddit.com/r/spotify/comments/184e989/spotify_supportcomplaint_megathread/",
        "content": "This  subreddit is mainly for sharing playlists. Please keep all complaints  and support questions within this thread. Posts concerning these  subjects may be deleted. This subreddit is not endorsed, sponsored,  moderated, or supported by Spotify.\n\nPopular topics include:\n\n* Shuffle  sucks, shuffle isn’t really random, shuffle keeps playing the same  songs, I have a huge playlist and Spotify only plays the same songs. \n* Spotify for android doesn’t work, Spotify desktop doesn’t work, Spotify iOS doesn’t work, Spotify app on different devices don’t work\n* Downloaded songs don’t stay downloaded\n* Sound quality on PS5 is terrible\n* I want to share a Spotify subscription with strangers across the world, will I get caught?\n* I want access to choose my own songs and create playlists, but I won’t pay for premium\n* Why is (artist name)’s music not available?\n* I want to make playlists longer than 10,000 songs\n* Podcasts:  suck, are great, have embedded ads, i do not like their existence, i pay for ad free music why am I getting podcast ads?\n* Spotify Wrapped: where is mine? when do they stop tracking, mine is not accurate, mine included songs i listen to while i sleep\n* The new UI is horrible. The new update is horrible. The new feature is horrible.\n* AI DJ is terrible, not available in my are. \n* Spotify's recommendations are terrible\n* Spotify stopped supporting Car Thing \n* Spotify made lyrics a premium feature, they aren’t accurate, how do I report them?\n* Spotify removed the hearts and I now can’t remember what songs I like",
        "num_comments": 2363,
        "comments": [
            "Just tossing in my dislike of them taking out the like/heart button and putting in this annoying af add button in it's place.",
            "I just wish they'd remove this useless smart shuffle so I can shuffle my playlists in peace again",
            "i'm a very organized person but spotify is not and it annoys me so much\n\nwhy are there identical versions of the same album created all the time? (i'm not talking about clean/unclean versions or deluxes). i hate going through artists pages and seeing i don't have their albums saved, when i really do but it's just another identical version that magically appeared on their profile. or looking at playlists and seeing that songs i do have saved don't appear with a like because it's a different version. PLEASE SPOTIFY is it really that hard to just not duplicate the same versions of songs and albums? or to recognize that it's the same product?",
            "I just want to say that all of Spotifys UI devs should be fired and just dont hire any more. You people are idiots who keep pushing out useless UI changes that nobody wants nor asked for that never fail worsen the experience each time. The existence of your jobs is to keep pushing out garbage UI updates. Just leave it as is so it doesnt get any worse holy fuck",
            "im so mad with this new desktop UI oh my god... everyday it gets WORSE! months ago i already accepted the fact that accesing my saved albums list is now a pain in the ass, since for whatever reason its now located in the same left section of the screen i used to check my playlists, fine. later i accepted the fact that the album artwork is now in the same right section i used to check the \"friends are listening to\" tab and i can't see them at the same time anymore, whatever. but now you're telling me THE DAMN QUEUE IS ALSO GETTING MOVED?? WHAT THE FUCK!! the middle section (which is supposed to be the main section) is a waste of space now since it has become useless, it was the perfect place to check my queue and albums and now they just shoved every useful menu in two tiny sections in my screen that already had their respective functions, not to mention the fact that when you make them bigger it looks completely awful. i'm downloading an older version of the app, i'm not doing this shit anymore lol",
            "How do I stop Spotify from playing liked songs playlist automatically in the car? As soon as I start the car and phone connects to my car via Bluetooth it plays the first song in my liked playlist, even when I had another song pre loaded from last time I used Spotify. Its super annoying. Tried to google the answer but it only gives me the answers relating to auto play similar songs which is not what Im after.\n\nEdit : Im on an iPhone up to date version of Spotify",
            "Yup bring back the like/heart button. It was so much better for tracking songs, marking/tagging them etc. Binary yes/no. The new auto hiding playlist button is a lot worse.\n\nI would use the heart button to track how far down I had listened in a playlist. Songs I wanted to go back to etc. It was very good just as a visible tag, now there is no way to mark/categorize/comment/tag a song. Very sad.",
            "Why the fuck is the queue now this shitty little menu to the right? Now I can't see/manage my queue while I have now playing on the right. Another braindead UI update",
            "My Spotify wrapped is full of songs Ive never even heard of? There are a lot that I have listened too. But around 40% Ive never seen before in my life. Any ideas?",
            "You haven't mentioned song duplicates. God Spotify sucks."
        ]
    },
    "songs you think everyone should hear at least once?": {
        "title": "songs you think everyone should hear at least once?",
        "score": 32,
        "url": "https://www.reddit.com/r/spotify/comments/1dr6prn/songs_you_think_everyone_should_hear_at_least_once/",
        "content": "",
        "num_comments": 57,
        "comments": [
            "Jeff Buckley - Lover, you should have come over",
            "comfortably numb - pink floyd",
            "White Ferrari - frank ocean",
            "sextape - deftones\n\nunreal first listen experience",
            "You Know What They Do to Guys Like Us in Prison - My Chemical Romance",
            "Panic! At the Disco - But it's better if you do",
            "Apocalypse - Cigarette after sex",
            "Anything Elvis.     Especially can't help falling in love with you",
            "I think everyone should listen to the entirety of Everywhere at the End of Time by The Caretaker at least once. Not an easy listen, not a fun listen, but an important one.",
            "23 - Jimmy Eat World"
        ]
    },
    "Spa Music 2024": {
        "title": "Spa Music 2024",
        "score": 9,
        "url": "https://open.spotify.com/playlist/0bssJUXCGLNBrc8v8clvRM?si=a026d9febee64352",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Songs about being in love with someone who left you for someone else ": {
        "title": "Songs about being in love with someone who left you for someone else ",
        "score": 37,
        "url": "https://www.reddit.com/r/spotify/comments/1dr2kzp/songs_about_being_in_love_with_someone_who_left/",
        "content": "Preferably indie/alt/rock. Anything gut wrenching I can scream cry to ",
        "num_comments": 68,
        "comments": [
            "Somebody else - The 1975",
            "You Ought To Know- Alanis Morisette",
            "Operator (Thats Not The Way It Feels) - Jim Croce",
            "Kiss This.  By The Struts",
            "Best friends girl by the cars",
            "The Winner Takes it All by ABBA",
            "Valentine by Fiona Apple\nIdlers wheel is a killer break up album",
            "Sometime around midnight - airborne toxic event.",
            "Back to black. (Amy whinehouse)",
            "Somebody Else - The 1975"
        ]
    },
    "Suggest me a song": {
        "title": "Suggest me a song",
        "score": 82,
        "url": "https://www.reddit.com/r/spotify/comments/1dqvo69/suggest_me_a_song/",
        "content": "Suggest me a song that will make you get up and go for a 10km run RIGHT NOW. \n\nEDIT: wow thank you everyone just finished 15km run. Can’t wait to check all these times and add them to my list.  Here my playlist so far\n\n\nGive this playlist a listen: 👟 5k run🏃‍♂️  https://open.spotify.com/playlist/3rfS1kAoMG2B8drICOhsRY?si=RMs8gLOxQnmIOE5yWBSSjA\n",
        "num_comments": 140,
        "comments": [
            "The White Stripes - Fell In Love With A Girl",
            "Get Him! - Scarlxrd\n\nor literally any song in his discog has that effect, king scar for life bro",
            "Just a friend - biz markie",
            "Linkin Park - Forgotten\n\nOne of my fav Linkin songs",
            "Can't help falling in love with you by Elvis Presley",
            "A run specifically?  Run - OneRepublic \n\nEnergy?  A few, I don't know your taste though so let's go with the simple answer of Don't Stop Me Now - Queen",
            "Anything Sad Night Dynatime but give icy violence a shot",
            "BE SILENT WHEN THE KING IS SPEAKING - Prxjek or just anything off of PRXJEK 666",
            "Big Boi - Kill Jill (Ft Killer Mike & Jeezy)",
            "My Heart Will Go On by Celine Dion"
        ]
    }
}