{
    "SPTarkov - A Map to navigate the scene": {
        "title": "SPTarkov - A Map to navigate the scene",
        "score": 295,
        "url": "https://www.reddit.com/r/SPTarkov/comments/11eovrj/sptarkov_a_map_to_navigate_the_scene/",
        "content": "Welcome to the Sub Reddit dedicated to our Tarkov projects, **while it isn't our home base**, feel free to use the following links to join us in our recommended platforms:  \n\\>**AKI:**  \nDiscord access- [https://discord.gg/Xn9msqQZan](https://discord.gg/Xn9msqQZan)  \nMain page- [https://www.sp-tarkov.com](https://www.sp-tarkov.com/)  \nDownload page- [https://hub.sp-tarkov.com/files/file/16-spt-aki/](https://hub.sp-tarkov.com/files/file/16-spt-aki/)  \nMod page- [https://hub.sp-tarkov.com/files/](https://hub.sp-tarkov.com/files/)  \nDocumentation page- [https://hub.sp-tarkov.com/doc/lexicon](https://hub.sp-tarkov.com/doc/lexicon/)  \nFAQ page- [https://hub.sp-tarkov.com/faq/](https://hub.sp-tarkov.com/faq/)  \nGallery page- [https://hub.sp-tarkov.com/gallery/](https://hub.sp-tarkov.com/gallery/)  \nSupport page- [https://hub.sp-tarkov.com/forum/](https://hub.sp-tarkov.com/forum/)  \n(Github alternative) Gitea- [https://dev.sp-tarkov.com/SPT-AKI](https://dev.sp-tarkov.com/SPT-AKI)\n\n\\>**HARU:**  \nCommunity access is closed, project To-Be-Released  \n\n**Staff and developers are unique to each project and shouldn't be bothered about other branches**",
        "num_comments": 0,
        "comments": []
    },
    "Logo Design Contest Winners Announced!": {
        "title": "Logo Design Contest Winners Announced!",
        "score": 73,
        "url": "https://www.reddit.com/r/SPTarkov/comments/1d8tpxp/logo_design_contest_winners_announced/",
        "content": "Crossposted from Discord...\n\nHey everyone!\n\nIt took a lot of super careful deliberation, and some *really* hard choices, but we finally have a winner for our SPT Logo Design Contest!\n\nYou've probably already noticed, but we have a fresh new logo for the Discord server, and it's already being rolled out across the board for everything SPT related!\n\nSo, onto some stats and the final ranking! We had over **60** submissions, of close to **100** logo designs. Honestly? A lot less meme responses than expected... I don't know whether to be proud or disappointed.\n\nAnyway! We managed to narrow it down to a top 10, and from there we voted to come up with this ranking. I'm going to include the rewards in this ranking, so hopefully it's clear what everyone's won!\n\n# Consolation prize! A shoutout and a big thank-you for making it to the end!\n\n10. nimanul\n\n9. tyvas\n\n8. valeska\n\n7. redlaser42\n\n6. scrob\n\n# Top 5! You're getting your names added to the PMC list in SPT!\n\n5. defonotmaple\n\n4. Panicdots\n\n# Top 3! In addition to the PMC name list, you're also going to be listed as Honored in the SPT Discord!\n\n3. MoxoPixel\n\n2. ShiftedFocus\n\n# And finally, our first place winner, with all of the above prizes as well...\n\n1. Rasdow\n\nThanks so much, everyone, for your extremely professional and creative designs!\n\nAn imgur album with samples from the top 10 logo submissions can be found here: [https://imgur.com/a/yQ8ORUZ](https://imgur.com/a/yQ8ORUZ)\n\n# More information:\n\n**What logos are being used?**\n\nOnly the submission from Rasdow is being used currently. While *any* of the ones in the top 10 are definitely suitable, the SPT Team felt it was best to go with one design for maximum consistency. In addition, the logo design ended up being modular enough to work for a variety of use cases.\n\nA reminder, the logos are licensed as CC BY-NC-ND, which means credit for use is given to \"SPT Team\", for noncommercial purposes, with no derivatives.\n\nAn archive or website page with adopted logos is being considered for release for use in mods, articles, youtube videos, etc. We'll have more information about that in the future.\n\n**Reminder:**\n\nWe've officially rebranded to SPT, so we ask that when referring to the project in any form (mods, social media posts, videos, etc.), please refer to it as such. The old name is gone, and so, long live SPT!",
        "num_comments": 8,
        "comments": [
            "You guys are the best, thank you for fostering such an amazing community!",
            "Dang these are all really good logos! Lots of talented people in this community. It was probably not easy to pick a winner here.",
            "The logo looks cool, props to the person who made it",
            "They all look great, thanks everyone for their hard work! Looking forward to seeing the new branding in use.",
            "Honestly #2 looks way better than #1",
            "IMO Moxo deserved n1, but it's still very fucking cool",
            "defonotmaple was robbed of 1st  (all logos are amazing)",
            "Yep"
        ]
    },
    "new meta ak build?": {
        "title": "new meta ak build?",
        "score": 23,
        "url": "https://i.redd.it/olhhfqjgfi9d1.png",
        "content": "found this one on a pmc in factory",
        "num_comments": 8,
        "comments": [
            "We have very different definitions of the word Meta",
            "Only missing a drum mag and a bigger silencer. Then it's meta",
            "That's some crazy meta, now that question is did he waste all the Uber expensive nades?",
            "Wouldnt the flashlight negate the use of the night vision sight",
            "It would be hilarious if Tarkov had 40mm chalk training rounds",
            "luckily the bot didnt shoot the grenades when fighting me. but he had only one left in his rig and in the launcher",
            "Lol, this made me laugh harder than it should",
            "*thunk*\n*poof* \n*CYKA BLYATTTTTTTTTTT*"
        ]
    },
    "My God, What Have I Done....": {
        "title": "My God, What Have I Done....",
        "score": 166,
        "url": "https://i.redd.it/zew6sjk8de9d1.png",
        "content": "",
        "num_comments": 33,
        "comments": [
            "Mods, twist his balls counter clockwise",
            "Its... Oh my god... It's... Collapsed!?!",
            "it all started with an operational task, NGL, ive gotten killed each time ive tested it, but i blame that all on my eagerness to use it",
            "I don't get it. :/",
            "Is this tactical gear component?",
            "Satan \"hello gamer, here's the special spot I made just for you\"",
            "I do not like that, get that away from me right now",
            "after a few raids successful with this rifle, all i can say is, my eye hurts.",
            "It certainly does have the aesthetic of a confetti-maker, hipfire-only rifle that some mobsters would pull out in a movie before shooting all of the conveniently stacked papers that explode into little fragments that can rain down when their magazines run out.",
            "What is that?  What the fuck is that?"
        ]
    },
    "Soviet dad: eating techniques ": {
        "title": "Soviet dad: eating techniques ",
        "score": 133,
        "url": "https://v.redd.it/niuhd5ttqc9d1",
        "content": "",
        "num_comments": 17,
        "comments": [
            "tarkov players when slavic culture",
            "Prapor back in the 80s",
            "I love how he eats the kiwifruit with label on it",
            "I'm getting a stomach ache just watching him",
            "Dad eating like he's still fighting in Chechnya",
            "What is the white ball at the end and what is he dipping it in??",
            "Yeah Im gonna need an onion and pickle jar mod STAT",
            "My man sidorovich doing good with the workout",
            "I mean, technically they are made of all food-safe components. So if you're too lazy to peel it off...",
            "Looks like an onion but I have no idea what he's dipping it in.\n\nEdit: It's salt, apparently. Thanks."
        ]
    }
}