{
    "[DISC] SPY x FAMILY - Chapter 100": {
        "title": "[DISC] SPY x FAMILY - Chapter 100",
        "score": 255,
        "url": "https://www.reddit.com/r/SpyxFamily/comments/1dmo63r/disc_spy_x_family_chapter_100/",
        "content": "**Check out the official** [**Discord server**](https://discord.gg/hG8wW9C267) **to discuss this chapter live with other fans!**\n\n**Support the manga and creator by reading the chapters legally and buying the volumes!**\n\n**Read here:**\n\n* [VIZ Media](https://www.viz.com/shonenjump/chapters/spy-x-family)\n* [Manga Plus](https://mangaplus.shueisha.co.jp/titles/100056)\n\n**Reminder:**\n\n* Keep all chapter discussions in this thread for 24 hours.\n* Do not link to illegal piracy sites.\n\n[View Poll](https://www.reddit.com/poll/1dmo63r)",
        "num_comments": 352,
        "comments": [
            "Who would've *thunk* Endo would throw something like All Quiet on the Western Front for initial pages in new chapter. I never expected to see a clean headshot in this manga. And no this isn't one of those comical assasination from Yor or one of Loid's adversaries like earlier chaps. Martha and other women soldiers were just meat shield for rest.",
            "When everyone was expecting a more meaningful connection to the main plot, like the person who rescued Martha being a Blackbell or Yor or Loid's family, the person is a simple Westalis woman who also lost a lot because of the war but maintained her humanity.\n\nI kinda like how the focus of this arc is profoundly anti-war and that's it. That's one of the main themes of Spy x Family after all",
            "It's just like this manga to immediately follow up the Toddler Prom Arc with an All Quiet on the Western Front Arc lol.",
            "I loved this chapter so much, and I genuinely believe Endo's strong suit is writing these angsty, war-centric chapters. He knows how to drive the anti-war sentiment home in a way that focuses on its effects on *people* rather than the politics itself. When Martha made note of the same night sky between the two countries, I was taken aback! It really highlighted the vanity of war in the grand scheme of things. I never thought I'd come to love Martha as a character this much! I am not looking forward to when we see her reaction to Henry's marriage!",
            "I love Spy x Family the best when it leans into its darker elements. With all the fluff and Anya's usual shenanigans, it's easy to forget that this story is set against a cold war backdrop. That's why I don't get the people complaining about this arc being 'filler'. The entire point of Operation Strix is to prevent war. This arc does an immaculate job of driving home the anti-war narrative (and of course, adding to the worldbuilding).",
            "Things to take from this chapter...Martha's all women 'Squadron', was essentially cannon fodder for the main line.  That made me really mad.  But she was saved, by a piece of artillery from Blackbell industries...a name she will be linked in the future.  But here, we get a nice boi, for chapter 100.  And we get another reminder of 'War is Hell.'  Now, she's gotta go back, and probably face the consequences of being behind enemy lines, and find out what happened with Mr. Henderson.  More tears and angst ahead, methinks.",
            "While some folks already seemed to agree Martha and Henrys backstory took place during WWI, this chapter outright confirms it with the presence of _landships_. Im not surprised if next chapter wed see the background characters mention mustard gas attacks. \n\nStill, _holy fuck_. Grim chapter all around.",
            "Holy shit that was dark, seeing the women cowering for their lives only to get shot by their OWN COMMANDER...glad that fucker died quickly.",
            "Its interesting that Martha and Henry got a longer backstory than Loid lol, especially considering the backstories focus on similar themes. I think the severed limbs is the most morbid imagery the series has had this far. Also interesting that this chapter breaks the framing of the past 3 chapters: No thought bubbles from Henry or Martha, we are seeing Martha in the moment. I wonder if we get 1 or 2 more chapters of this backstory before we return to modern times and see the reactions of the people listening to these old lovebirds. I hope they hang out more to show the capacity to live and love after trauma.",
            "Endo once again showing he's not scared of crossing the gore line when needed"
        ]
    },
    "The only one capable to assassinate Makima ": {
        "title": "The only one capable to assassinate Makima ",
        "score": 236,
        "url": "https://i.redd.it/ezotwz6a5i9d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "What if died eating food Yor made?",
            "See, but a good Yor/Yoru crossover.......",
            "Wouldn't she have to kill all of Japan to kill Makima? I mean, I assume Yor *could*, but she probably wouldn't lol",
            "YOR DONT TOUCH HER PLEASE YOR ITS NOT YOUR TIME GET OUT OF TOKYO",
            "I can only Imagine this fight, but what if she fought Chainsaw man himself?",
            "What if Yor attack arent meant to harm her but to protect Anya?",
            "Ohh that could actually work ",
            "Protecting Anya by hurting Makima would not kill Makima.",
            "YOR!!! YOR!!!! YOR THAT IS NOT A NORMAL WOMAN, SHE CANNOT BE KILLED BY ATTACKS INTENDED TO HARM HER! YOR!!!\n\nhttps://preview.redd.it/yjx2h7ew9i9d1.jpeg?width=565&format=pjpg&auto=webp&s=257816a0d6a3209caf0d05efb627db1ac394fa2d",
            "The only way to kill makima is a power that can destroy a whole country since makima's contract allows her to use all of Japan as a meat shields to transfer any killing blows to a random person in Japan\n\nhttps://preview.redd.it/ym5lds8ewi9d1.jpeg?width=800&format=pjpg&auto=webp&s=70530db0b85c3908136947c332f5500fef14dd7e"
        ]
    },
    "She asked for no pickles ": {
        "title": "She asked for no pickles ",
        "score": 184,
        "url": "https://i.redd.it/5jwxb9ip8i9d1.png",
        "content": "",
        "num_comments": 2,
        "comments": [
            "\"I bought the McD's.\"",
            "Basic innocense :3\n\nhttps://preview.redd.it/0sri0uv0si9d1.png?width=128&format=png&auto=webp&s=db72bad69ea4be7f44e8fc963c81170d26f99582"
        ]
    },
    "Do you think that Yor and Yuri’s strength is hereditary?": {
        "title": "Do you think that Yor and Yuri’s strength is hereditary?",
        "score": 274,
        "url": "https://www.reddit.com/gallery/1dr6js7",
        "content": "We see them both achieve feats of incredible strength, and maybe it’s an inherited trait",
        "num_comments": 33,
        "comments": [
            "Yor is strong naturally but she was training to be an assassin from a young age so its hard to tell how much is hereditary and how much is from hard work. Yuris durability comes from eating yors food ",
            "The gruesome stuff Yor fed him including medicine should unintentionally train him",
            "as far as I know, Yuri<Loid<Yor strength wise.",
            "Maybe we'd know when we get to know their backstory. Also Yuri is still only 20, so he might still get stronger as he grows a bit older",
            "Theres something in Ostanias water",
            "Yor got it naturally, Yuri is basically Popeye eating yor's food daily",
            "I think it's circumstantial. They both were left to fend for themselves from a young age so they had to get tough and train.",
            "Probably not. All Garden members are crazy strong, rumored to be capable of decimating an army by themselves, so Yor is probably strong due to training. While Yuri got strong because he lived with Yor, eating her food daily and her superhuman hugs and the like.",
            "The funny thing is that Yuri is not even stronger than Loid. The power scale still has Yor as the top contender.",
            "Clearly it was their diet."
        ]
    },
    "One of my favorite Henderson moments": {
        "title": "One of my favorite Henderson moments",
        "score": 186,
        "url": "https://i.redd.it/2zajyf5cog9d1.jpeg",
        "content": "",
        "num_comments": 9,
        "comments": [
            "I admired the fact that he was willing to put his life on the line for his students even if it put him in danger",
            "One of my favourite Henderson moments is actually from one of the more recent chapters. >!When he swallowed his pride and pretended to take back what he had said about war so that he can continue teaching. Normally a shonen would have the character not swallowing their pride to defend their honour, even if it would be the smarter choice to just lie. Which is an inspirational message about self respect. Hendersons story does the opposite of that, because his mission is beyond his own pride. It doesnt matter what happens to him as long as he can make the future generation be better than the previous ones!<",
            "Henderson is a straight up G and I ain't hearing anyone out that disagrees.",
            "He's such an elegant Chad",
            "This is why Henderson's backstory is so necessary!",
            "this is one of the many reasons why Henderson is the best",
            "He also literally does while on the bus. Henderson is a real one.",
            "He's a straight up E (Elegance)",
            "Best teacher ever"
        ]
    }
}