{
    "S.T.A.L.K.E.R. Gameplay Help Desk (for the month of June 2024)": {
        "title": "S.T.A.L.K.E.R. Gameplay Help Desk (for the month of June 2024)",
        "score": 23,
        "url": "https://www.reddit.com/r/stalker/comments/1d5h69o/stalker_gameplay_help_desk_for_the_month_of_june/",
        "content": "In case your question gets buried by the memes, feel free to use this post for more visibility to ask/answer questions or receive/provide help with any S.T.A.L.K.E.R. game-related issues, including difficult parts of the game or mod compatibility problems, for any of the three games in the trilogy.\n\nIf your question was not answered in a previous post, please feel free to re-comment it here. To find posts from earlier months, please run a search in /r/stalker for `author:AutoModerator` or `help desk`.",
        "num_comments": 51,
        "comments": [
            "What's in the red forest?",
            "I bought shadow of chernovyl last week but the textures of things like trees, bushes and other things appear bugged, I tried to lower the resolution, the graphics or uninstall and install the game but the bug continues, does anyone know how to fix it?",
            "Sound delay on Ps5, multiples topic about this",
            "approximately how large is the GAMMA download? I have a crappy 3rd world internet connection, and my SSD isn't that big, so I gotta know if I need to free up space, and if I need to go to a cybercafe to download it",
            "GAMMA first try, does Sirodovich's shop ammo auto filled? I\\]m using Thomson gun but runout of ammo now. Guns found on bandit bodies are very low condition and I can't find any gun tools yet. What should I do for this situation?",
            "Is there english subtitle mods for hard of hearing? I found one but the link was dead and there was no other information about it.",
            "Looking for 3rd flash drive in Cordon for CS - got the stash from the stalker trader and found 2nd on a military dude.  Cant find the 3rd.",
            "I've been enjoying Anomaly a lot however enemies respawn way too quickly is there a mod that slows, stops or reduces enemy respawns?",
            "Hello everyone, Im trying to 100% Cs after being done with Soc. Does progression towards picked artifacts, unique weapons and flashdrives carry on between multiple playthroughs in Clear sky?? For ex: If getting the 25 different artifacts is rng based and I can only get 22 on my first playthrough, can I try getting the last 3 on a new game and will i keep my earlier progress towards it ? I also have 17/18 flashdrives but cant get the last one because of a glitch on console , can I start a new game and get the last one only or do i have to get everything in a single playthrough ?",
            "can you have different folders for gamma and anomaly in separate drives because i have limited space and want to                     install gamma on my ssd and anomaly on my hhd , can some one help me thanks"
        ]
    },
    "S.T.A.L.K.E.R. 2: Heart of Chornobyl — The time of opportunities Trailer": {
        "title": "S.T.A.L.K.E.R. 2: Heart of Chornobyl — The time of opportunities Trailer",
        "score": 1841,
        "url": "https://www.youtube.com/watch?v=g6HH5kKLAlw",
        "content": "",
        "num_comments": 415,
        "comments": [
            "Brother-stalkers, I like what I see.\n\nController and Pseudogiant are looking mighty fine. Wonder how the chimera and other mutants look.",
            "Liking the combat, one hit kill headshots im bouta fuckin nut",
            "I said come in! Dont stand there!",
            "try not to cum challenge ( i lost )",
            "GOOD FUCKING LORD MY EYES! NVIDIA RELEASE THE 5090 ASAP!",
            "My wallet is telling me no to a new PC but my body... My body is telling me CHEEKI BREEKI IV DAMKE",
            "looks great, very excited, but some of the reloads look a bit out of place.",
            "Time for Anomalous Dugout's 40-min analysis of every single frame in the trailer.\n\n*And I'm looking forward to it.*",
            "Fuck~! Ah, shit... It's all over my computer...",
            "Interesting how they have Upgrades as a tab in the PDA wonder if its RPG style character upgrades or PDA upgrades?"
        ]
    },
    "Being zombified is not fun, I guess": {
        "title": "Being zombified is not fun, I guess",
        "score": 131,
        "url": "https://i.redd.it/81ydz4ltvh9d1.png",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Gen Z zombie suffering from brainrot, not even emission can keep him entertained ",
            "With a name like that he was destined to be a zombie.",
            "He's just angry that no one else got zombiefied with him, now he has to wander the zone to find his kind.",
            "even the communication centre is like hol up",
            "Was just gonna say :internet goes out: I CANNOT EXIST AND HAVE NO HOBBIES",
            "Lol",
            "He acts like a Chad, all emissions burned his brain out so there's nothing left and now he's unstoppable so he's just \"this was so fucking weak, y'all got anything else ?\"\n\nTruely a chad zombie. Be aware OP.",
            "He's missing his skibidis"
        ]
    },
    "Artifact collection": {
        "title": "Artifact collection",
        "score": 334,
        "url": "https://www.reddit.com/gallery/1dr1ss0",
        "content": "",
        "num_comments": 46,
        "comments": [
            "Artifacts are beautiful in SoC",
            "Are you telling me that's possible without crashing? X ray can't be so powerful.",
            "Marked one, what the hell?",
            "nice collection man, i hope mine is that big some day :)",
            "like some main hero ofone stalker book",
            "So this... this is what peak gaming looks like...",
            "Only 3.6 roentgen in this room. Not great, not terrible",
            "Radioactive, Radioactive, woah oh oh oh oh oh, woah oh oh oh, ow, radioactive, Radioactive",
            "All I see there is...money!",
            "where would one find so much of them? asking for a merc, erm I mean friend...."
        ]
    },
    "Breathe deep the Nooshpere": {
        "title": "Breathe deep the Nooshpere",
        "score": 1191,
        "url": "https://i.redd.it/a05r9x4nrc9d1.jpeg",
        "content": "",
        "num_comments": 47,
        "comments": [
            "What's next? An Auschwitz humidifier? ",
            "This one looks cool actually. I want it.",
            "They could have at least tried to disguise the wire as pipes from a real nuclear power plant",
            "So, wake up Strelok. Wake up, and, smell the radiation.",
            "This unironically goes hard as fuck.",
            "Shut up and take my money. I need those 3.6 roentgen.",
            "what about a wish granter table lamp??",
            "\nImagine getting fucking cancer from this thing and u see it in some kids fucking room",
            "Was the nosphere ever mentioned in the vanilla games? I only remember seeing it in the wiki.",
            "You've got to respect the craftsmanship.  ATBGE worthy"
        ]
    }
}