{
    "S.T.A.L.K.E.R. Gameplay Help Desk (for the month of June 2024)": {
        "title": "S.T.A.L.K.E.R. Gameplay Help Desk (for the month of June 2024)",
        "score": 23,
        "url": "https://www.reddit.com/r/stalker/comments/1d5h69o/stalker_gameplay_help_desk_for_the_month_of_june/",
        "content": "In case your question gets buried by the memes, feel free to use this post for more visibility to ask/answer questions or receive/provide help with any S.T.A.L.K.E.R. game-related issues, including difficult parts of the game or mod compatibility problems, for any of the three games in the trilogy.\n\nIf your question was not answered in a previous post, please feel free to re-comment it here. To find posts from earlier months, please run a search in /r/stalker for `author:AutoModerator` or `help desk`.",
        "num_comments": 50,
        "comments": [
            "Playing Anomaly GAMMA for the first time. While traveling to Jupiter, from Army Warehouses via Red Forrest, there was a Sin/Monolith mine encampment before the path leading to Jupiter.\n\nI was packed full 600HP and 300+AP 5.45x39mm bullets and wasted most of it. I survived barely and by the time I arrived in Yanov station I'm now almost empty, only 50ish HPs left, only to find out that Yanov has only NATO merchants. Where can I by Russian ammo in Jupiter?\n\nI have a backup, shotgun with me but still, I would like to avoid going back the Bar or wherever to restock on ammo.\n\nEdit: On another note I believe like something is missing at this place in Yanov.  There's Ashot, who is a NATO merchant. Then there are three other mechanic merchants, ironically one of them is a one of the professors at the mobile science lab (*seriously doc, you're selling hardware now?*), and two others are the Loners, Nitro and Cardan in Yanov. Who needs three mechanics really?? One of them could've easly been a Russian supplies merchant.",
            "What's in the red forest?",
            "I bought shadow of chernovyl last week but the textures of things like trees, bushes and other things appear bugged, I tried to lower the resolution, the graphics or uninstall and install the game but the bug continues, does anyone know how to fix it?",
            "Sound delay on Ps5, multiples topic about this",
            "approximately how large is the GAMMA download? I have a crappy 3rd world internet connection, and my SSD isn't that big, so I gotta know if I need to free up space, and if I need to go to a cybercafe to download it",
            "GAMMA first try, does Sirodovich's shop ammo auto filled? I\\]m using Thomson gun but runout of ammo now. Guns found on bandit bodies are very low condition and I can't find any gun tools yet. What should I do for this situation?",
            "Is there english subtitle mods for hard of hearing? I found one but the link was dead and there was no other information about it.",
            "Looking for 3rd flash drive in Cordon for CS - got the stash from the stalker trader and found 2nd on a military dude.  Cant find the 3rd.",
            "I've been enjoying Anomaly a lot however enemies respawn way too quickly is there a mod that slows, stops or reduces enemy respawns?",
            "Hello everyone, I’m trying to 100% Cs after being done with Soc. Does progression towards picked artifacts, unique weapons and flashdrives carry on between multiple playthroughs in Clear sky?? For ex: If getting the 25 different artifacts is rng based and I can only get 22 on my first playthrough, can I try getting the last 3 on a new game and will i keep my earlier progress towards it ? I also have 17/18 flashdrives but can’t get the last one because of a glitch on console , can I start a new game and get the last one only or do i have to get everything in a single playthrough ?"
        ]
    },
    "S.T.A.L.K.E.R. 2: Heart of Chornobyl — The time of opportunities Trailer": {
        "title": "S.T.A.L.K.E.R. 2: Heart of Chornobyl — The time of opportunities Trailer",
        "score": 1842,
        "url": "https://www.youtube.com/watch?v=g6HH5kKLAlw",
        "content": "",
        "num_comments": 415,
        "comments": [
            "Brother-stalkers, I like what I see.\n\nController and Pseudogiant are looking mighty fine. Wonder how the chimera and other mutants look.",
            "Liking the combat, one hit kill headshots im bouta fuckin nut",
            "I said come in! Don’t stand there!",
            "MAMA IM COMING HOME",
            "# SKADOVSK SIGHTED",
            "it loooks so fkin good  \n\n\ninject that straight into my veins",
            "try not to cum challenge ( i lost )",
            "Looks insane GSC,\n\n  \nI wish you guys all the luck with this release",
            "GOOD FUCKING LORD MY EYES! NVIDIA RELEASE THE 5090 ASAP!",
            "The Rostok map is the same. The Controllers look the same. The Giants are the same.\n\nI wish more games took *that* much care into maintaining visual continuity between delayed sequels."
        ]
    },
    "Breathe deep the Nooshpere": {
        "title": "Breathe deep the Nooshpere",
        "score": 890,
        "url": "https://i.redd.it/a05r9x4nrc9d1.jpeg",
        "content": "",
        "num_comments": 36,
        "comments": [
            "What's next? An Auschwitz humidifier? 💀",
            "me want",
            "This one looks cool actually. I want it.",
            "They could have at least tried to disguise the wire as pipes from a real nuclear power plant",
            "Oh man, it's real: [https://www.etsy.com/listing/1741704973/chernobyl-nuclear-power-plant-with-smoke](https://www.etsy.com/listing/1741704973/chernobyl-nuclear-power-plant-with-smoke)\n\nI'd add a few orange, or maybe color-changing, LEDs to make it look like the core is still glowing.",
            "That’s dark.",
            "Shut up and take my money. I need those 3.6 roentgen.",
            "So, wake up Strelok. Wake up, and, smell the radiation.",
            "This unironically goes hard as fuck.",
            "Omfg I want this.."
        ]
    },
    "Artifact collection": {
        "title": "Artifact collection",
        "score": 103,
        "url": "https://www.reddit.com/gallery/1dr1ss0",
        "content": "",
        "num_comments": 12,
        "comments": [
            "[presses Drop All]\n\n*Loud explosion, geiger counter ringing, deafening alarms blasting.*\n\nOh dear, it's not... Its not shutting down, its not...\n\n*HL1 scientist scream.wav*",
            "Artifacts are beautiful in SoC",
            "Are you telling me that's possible without crashing? X ray can't be so powerful.",
            "nice collection man, i hope mine is that big some day :)",
            "Clean your room!",
            "Hello hello indeed",
            "like some main hero ofone stalker book",
            "So this... this is what peak gaming looks like...",
            "All I see there is...money!",
            "this is beautiful, like explosions in the test chamberrr..."
        ]
    },
    "Found an 86 kg “lightened” enfield": {
        "title": "Found an 86 kg “lightened” enfield",
        "score": 176,
        "url": "https://www.reddit.com/gallery/1dqr21c",
        "content": "Found it on a dead stalker named Master, had 8000 rounds in the mag but couldn’t tell if I actually needed to reload because it kept jamming after a couple shots, what’s up with it?",
        "num_comments": 19,
        "comments": [
            "So the ammo is definitely a bug. Other than that the weapon is pretty decent but is outclassed by the sniper TRS. But evidently you broke it so you can't use it anyways.",
            "Obviously it's so heavy because it had 8000 rounds in it.",
            "That's an  81kg magazine attached to a 5kg gun lmao",
            "Just what you want to hear when you pick up an L85, it's parts have been lightened\n\nThat's an interesting find though...",
            "ngl though guns fused with certain anomalies sounds badass won't happen but still",
            "lightest L85 rifle",
            "There is a cool way to repair it tho",
            "…I will legitimately trade you a gauss rifle for this.",
            "What in the cinnamon toast fuck",
            "Well the original was made entirely out of osmium, then they came back and swapped out the furniture, so they're not wrong."
        ]
    }
}