{
    "Welcome to /r/standup! Please read this before posting/commenting on this sub.": {
        "title": "Welcome to /r/standup! Please read this before posting/commenting on this sub.",
        "score": 285,
        "url": "https://www.reddit.com/r/Standup/comments/3jvwy7/welcome_to_rstandup_please_read_this_before/",
        "content": "Welcome to /r/standup, reddit's home for discussing the art of standup comedy. Here are a few things you should read before you interact with the community:\n\nNote: Please follow the video posting guidelines, and do not try to use this sub to promote individual shows, or your posts will be removed. Also, don't post your podcast here unless the individual episode you're posting has something to do with performing standup. (Just having a comedian on as a guest or being hosted by a comedian isn't enough. If it's not discussing some element of the craft of standup, this isn't the place for it.) And keep your podcast posts to no more than one a week, this isn't a podcast sub.\n\n**Are you looking to start doing standup?**\n\nGreat! We have some resources you can check out:\n\n* [/r/standup's How to start in standup comedy](https://www.reddit.com/r/Standup/wiki/index)\n* [John Roy's Free on-line standup comedy course](http://johnroycomic.tumblr.com/post/54132250195/my-complete-entirely-free-on-line-comedy-class)\n* [Ari Shaffir's advice video](https://www.youtube.com/watch?v=k43XcdlO22s)\n* [Ralphie May's advice video] (https://www.youtube.com/watch?v=7uBB8HncsrU)\n* [Stewart Lee - On Not Writing](https://www.youtube.com/watch?v=IrXVaytvJtQ)\n* [Steve Hofstetter's Comedy Pro-Tips](https://www.reddit.com/r/Standup/search?q=author%3Athehofstetter+tip&sort=new&restrict_sr=on&t=all)\n\n\n\n**Are you looking for places to perform?**\n\nHere are some resources that should help you find some stage time:\n\n* [Badslava.com \\(a large directory of open mics around the world\\)](http://www.badslava.com/)\n* [/r/standup's local group list \\(Regional Facebook Groups and websites\\)](https://www.reddit.com/r/Standup/wiki/local_groups)\n\n\n\n**Are you posting a video asking for feedback on your act?**\n\n* Is it video of one of your first few times on stage? You probably don't really want to post that. You should do standup a few dozen times first, then post a video.\n* ~~Is it shot vertically instead of horizontally? You probably don't really want to post that. You know that makes the video nearly impossible to see on mobile devices and wastes tons of screen space on computers, right? You should make another video where you shoot it horizontally and post that instead.~~ I blame TikTok for ruining this one.\n* Is it hard to hear the sound or make out what you're saying? You probably don't really want to post that. If it's difficult to hear you, how is anyone going to give you any feedback on what you say? You should either fix the audio problem on the video, or just shoot another where the audio is decent, then post a video.\n* Is it just video of you in a room somewhere not in front of an audience? You definitely don't want to post that. It's not standup comedy, so you might want to try another sub for that. Or just go get on stage (at least a few dozen times), then shoot video of you on stage in front of an audience and post that video instead.\n\n\n**Are you posting a video of a comedian because you want fans of comedy to see it?**\n\nCool, we all like comedy- but if you're doing that, you should probably also post a comment about why you want to discuss this particular set. If you don't have a reason to discuss it, it might be better to just post it in /r/standupcomedy instead (that's the sub for fans of comedy to share video of their favorite comedians). Also, please make sure that it's not a pirated video, or we'll have to remove it. Most comedians don't make very much money, so please don't take away one of the few revenue generators they have.\n\n\n**If you still want to post a video, here are our rules:**\n\n\nIt must have a descriptive title telling us why you are posting it. If you're sharing a video, it should be to generate some kind of discussion. Video of your own act is totally fine, but please own that it's yours (in the first person) and give us something to talk about. Video of famous comedians is fine, if you're sharing it to make a point and your title reflects that. If you post videos repeatedly that are just to try to get attention and not discuss the craft of standup, we'll remove them and eventually ban you from the sub.\n\n\nGOOD VIDEO TITLES:\n\n* Is this set too blue to submit to festivals?\n\n* I got heckled last night, could I have handled this better?\n\n* Doug Stanhope's bit about his mother shows how to make a dark and difficult subject completely hilarious.\n\n\nBAD VIDEO TITLES:\n\n* My Name - My Joke Title\n\n* Bo Burnham - Can't Handle This (Kanye Rant) - MAKE HAPPY Netflix [HD]\n\n* HECKLER OWNED\n\nIf you ignore this request, we'll remove your video and not even bother telling you why, because clearly you didn't even read this.\n\n\n\n**Are you posting about a show you're doing?**\n\nDon't. Just...don't. We're comedians- we're not going to pay to see your show. Also, your show is in a place where almost all of us aren't. We're all over the globe on this sub, so even if your show is in LA, NYC, Toronto, London, etc. the vast majority of us aren't there. If you ignore this and post it anyway, it will be removed.\n\n**Want to chat about standup?**\n\nCheck out the [r/standup chatroom here](https://s.reddit.com/channel/371709_abff0a88d59d785c7d946801922c1e0617e401dc).\n\nYou can also visit a number of standup related Discord servers. Please note, none of these are affiliated with this sub in any way, we're just linking to them in case you want to check them out.\n\n[Stand up comedy](https://discord.gg/AmvDg8h)\n\n[Stand-Up Comedy](https://discord.gg/GVjb72Z)\n\n[Stand up Comedy](https://discord.gg/8GZf38s)\n\n[Comedy Collective](https://discord.gg/t5fGmhK)\n\n\n\nThanks for reading, and welcome to the community!",
        "num_comments": 74,
        "comments": [
            "What if I just want to bitch forever about how people that don't laugh at my rape jokes are ruining comedy? ",
            "thank you for breaking it down for us newer guys",
            "Bravo",
            "Is this a good sib to share cool comedy related projects,  like documentaries? Particularly if there is a crowd sourcing/fund raising pitch associated with the post?",
            "[deleted]",
            "Is it okay to post about comedy festivals in this sub? I work with one, and we are coming back this year after a couple years off. I don’t want to spam this sub, but thought it would be a good place to get the word out that submissions are open.",
            "I'm a joke writer, but not a performer.  Is there a venue/sub/whatever that can link up writers with performers?",
            " I felt a great disturbance in the Force, as if millions of voices suddenly cried out in terror and were suddenly silenced...",
            "Are people allowed to post events/competitions going on that comedians can participate in? Or is there a separate place for that kind of information",
            "Thank you!"
        ]
    },
    "Read this one too before posting anything": {
        "title": "Read this one too before posting anything",
        "score": 65,
        "url": "https://www.reddit.com/r/Standup/comments/193xobv/read_this_one_too_before_posting_anything/",
        "content": "If your post is just about a podcast and/or podcast appearance by a comedian, but not about them actually doing standup, don't post it here. This isn't the place for it.\n\nAnd if you post any content that was generated by AI, don't post it here- it's not standup, and doesn't belong on this sub.\n\nIf you're trying to sell tickets to a show, go somewhere else to do it. This isn't a place to do that.",
        "num_comments": 3,
        "comments": [
            "Nice to know some spaces are still being moderated. Thanks and appreciate the volunteer work. 👍",
            "Check, now wher is this \"sticky note\"????",
            "I think this is the info you are seeking. [Welcome to /r/standup! Please read this before posting/commenting on this sub. : r/Standup (reddit.com)](https://www.reddit.com/r/Standup/comments/3jvwy7/welcome_to_rstandup_please_read_this_before/)"
        ]
    },
    "Finally decided to pursue stand up comedy.": {
        "title": "Finally decided to pursue stand up comedy.",
        "score": 4,
        "url": "https://www.reddit.com/r/Standup/comments/1dr5ldu/finally_decided_to_pursue_stand_up_comedy/",
        "content": "I’m 23, and I always dreamt of performing stand up comedy, I’ve done it this year. I remember my civics teacher thought I was too quiet and suggested I should be a comedy writer. That dream just faded away as the years went by. Now, I finally decided to write stand up comedy and it’s been better than I expected. I only bombed one time and I still got laughs, other than that, I’ve been pretty successful. Not to sound dramatic but I’ve always felt destined for a career in comedy, never had original ideas or any stand up ideas at the time… now, I’m more confident in my writing than ever, and I can happily say that comedy is saving my life. This sounds basic as shit. ",
        "num_comments": 3,
        "comments": [
            "Finally pursuing that stand-up comedy dream, huh? Break a leg and make 'em laugh!",
            "You go girl! I’m so proud of you! You’re 1000% ahead of everyone who hasn’t had the courage to try. Keep on going",
            "Hahahahahaha"
        ]
    },
    "What exactly did Louis CK mean when he said \"it's not up to them how good the show is\" and \"if the crowd sucks, I have to work harder/put in more efforts\"?": {
        "title": "What exactly did Louis CK mean when he said \"it's not up to them how good the show is\" and \"if the crowd sucks, I have to work harder/put in more efforts\"?",
        "score": 8,
        "url": "https://www.reddit.com/r/Standup/comments/1dr1xsg/what_exactly_did_louis_ck_mean_when_he_said_its/",
        "content": "Prompted from another thread on the youtube clip (Louis CK on JRE)(https://www.youtube.com/watch?v=QPHpCOl0UtI) around 6:30 mark.\n\nI can understand some comics phone it in - but if you already have a set, you do the delivery the way you intended to do, and the crowd sucks, then how exactly do you \"put in more efforts\"?",
        "num_comments": 7,
        "comments": [
            "He meant that he has decided the show will go well regardless of the quality of the crowd. So it it's a good crowd it will go great, and if it's a bad crowd he will up his energy, \"lean in\" to bits, go into crowd work, switch out new material with old standards, heighten emphasis on lines, etc... to get them there. but regardless, he will make sure it gets there",
            "This is a crowd of people that have given up their time and money to come listen to you.  \n\nIt’s very very unlikely none of them want to laugh, otherwise they wouldn’t be at a comedy club, so the question is, are you skilled enough at your craft to find the right jokes for that room?  If not, that’s more on you than them.",
            "That he is prepared enough with the material, and good enough at what he does through experience, that he can pull off a good show. If the audience doesn’t like it initially, he’ll work harder to make them laugh. \n\nThe point he’s making is about not leaving the show going well up to chance. If you’re not well prepared, the show might go well if you’re lucky. But leaving it up to luck it stupid an unprofessional - he’s saying you need to be prepared to put on a good show, know what you’re going to say well, etc. not leave it up to chance whether it goes well.",
            "The comment was also addressing how and why he’s become so diligent about working out. Performance is exhausting, and you need to be somewhat physically fit in order to sustain the energy level required to give a good performance. \n\nSomeone who’s out of shape is eventually going to hit a wall, and at that point they’ll only be able to meet the audience where they’re already at. A comic who’s in good shape, who’s unphased by the physical demand of their performance, is going to be better equipped to respond to the audience’s energy and change it if necessary. \n\nI don’t think he meant it as a blanket statement that every comic needs to live by – most of aren’t performing hour-long arena shows anytime soon. But as far as his process goes, this seems to be what works for him.",
            "Start talking shit?",
            "Can’t speak for him but what I think he means is becoming so good at the craft that even if the crowd sucks, you are still performing at a high level, and therefore doing well even if they’re not that into it.",
            "It's also the mentality. A lot of comics will phone it in if they think the show sucks anyway. Some pro comic once told me you gotta go in with the mentality that you can be the reason the show doesn't suck. \n\nIt's a very cool attitude to have."
        ]
    },
    "My first show": {
        "title": "My first show",
        "score": 23,
        "url": "https://www.reddit.com/r/Standup/comments/1dqrzni/my_first_show/",
        "content": "I'm having my first show tonight. I've only been doing open mics for 3 months, but the owner of the bar I do them at asked me to do a spot tonight. She wants me to do between 10 and 15 minutes. I'm feeling incredibly anxious, to the point of tears with 8 hours left. I've worked very hard on writing since she asked two days ago, but I feel as if no matter what I will not be prepared. My brain and insecurities are creating these ideas. I'm wondering if there's anything you guys do or have heard that will help with getting through the anxiety of walking towards my execution. What did you guys learn from the first experience that might be helpful? Thank you for taking the time to read this if you did.",
        "num_comments": 15,
        "comments": [
            "Next time don't agree to do 10-15 minutes if you only have 5. Non comedians will never understand how much time it takes to write a solid 10 minutes. \n\nHow many other comics are gonna be on this show? I've been on shows where they hadn't told me how much time they wanted from me, I just assumed 5 because they know I'm new, and I showed up and they were giving each comic 10 minutes and I just did 5 and it was fine because there were 9 other comics on the show filling up the time",
            "You're gonna be fine. Watch the recordings of your sets (you do film, right?) and pick you the best ten minutes' worth of jokes. \n\nI used to a) go full graphomania on it and write my set list over and over like a crazed mathematician in an oscar-bait movie, and b) record myself speaking the words into the sound recorder app on my phone and listen back to it repeatedly on the way to the venue. Perhaps doing these things would serve you as they did me; perhaps not.",
            "Amy Poehler says “Great people do things before they’re ready.” If you’re not regularly making stretches like this then you’re not growing. Congrats on getting booked, try your best, and if it goes bad, it’s fine because you’re only 3 months in and that’s what happens. If you do well then that’s amazing and if you don’t do well than that’s normal.",
            "Nothing matters go have fun",
            "To calm your brain down, take a very deep breath in, hold it, and slowly breath it out. Just do this every once in awhile. Definitely tape set and watch it over and over. When rehearsing the set, eventually my brain gets fatigued and I have to leave for a bit and come back to it. Wear a plain t shirt or shirt unless you want people deciding if they like you or not by what’s on your chest. After about the eighth or 10th time, you will be significantly less nervous. You’ll still have butterflies before you go on. It sounds like the stakes are low for your gig, you don’t have to stand up there for the full 10. Nobody’s gonna say anything. Unless you’re getting a check. Don’t quit.",
            "Nobody will remember or think about it; just have fun.",
            "I’ll try to break my set down into chunks. It’s just another way to memorize. I also try to connect the last word of a bit with the first word or topic of the next bit and that way I don’t forget what’s next.",
            "Hello! I struggle less with having enough material to fill up the time, and moreso a lack of confidence in pretty much every applicable category. I think you're right that it takes much more effort to write any \"funny\" real amount of time than people give credit for. There's gonna be two other comics, I'm going second and then the headline is going after me. I think that's a good point that I'm not going to be killed if I go under time.",
            "Thank you so much! I think those are both incredibly helpful pieces of information. I've been writing and rewriting my roadmap for the set but I think recording myself is an excellent idea. I appreciate you taking the time to share that.",
            "Leave on any good note after 4 minutes. Give the host a heads up so they're not caught with their pants down at the urinal. If you really need to fill time, it's a good time to practice crowd work."
        ]
    }
}