{
    "Announcing TL.net TEAM Map Contest #4! Looking to give the 2v2/3v3/4v4 scenes a much needed infusion of new ladder maps—submissions open until July 7th.": {
        "title": "Announcing TL.net TEAM Map Contest #4! Looking to give the 2v2/3v3/4v4 scenes a much needed infusion of new ladder maps—submissions open until July 7th.",
        "score": 72,
        "url": "https://tl.net/forum/starcraft-2/626886-tl-team-map-contest-4-presented-by-monster-energy",
        "content": "",
        "num_comments": 11,
        "comments": [
            " my wife and i recently replaced our baby formula with Monster Energy Drink (Zero Ultra) ever since they started sponsoring map contests and sc2 events. my baby has so much energy, you can really tell that the compounds in this drink make you strong and healthy!",
            "Will Microlizzard actually put them in the map pool, though?",
            "Nice. I still play 2v2 with a friend about once a week. I would love new maps for those.",
            "This is so good and has been sorely needed\n\nMonster & TL 🤘",
            "Beautiful!  I appreciate Monster's sponsorship.  I know ESL doesn't have much investment in the team game scene so it's nice that they're still coordinating this stuff.",
            "I am going to buy some Monster today to celebrate this",
            "Damn this will be FUN!",
            "please please please get some new team maps on the ladder!!!",
            "this a very welcome initiative indeed! since I have been grinding mostly 2v2 in the past seasons due to ladder anxiety, seeing the map pools just rotating the same maps instead of seeing new maps is kinda boring. Thank you map makers for the effort! Appreciated!",
            "Why wouldn't they be added to the map pool?  Less than three months ago there were multiple Community Edition maps added to the team map pools that included new maps and updated versions of old maps.  There's already a process for it."
        ]
    },
    "2024 Global StarCraft II League Season 2: Code S, Semifinals and Grand Finals match thread\n": {
        "title": "2024 Global StarCraft II League Season 2: Code S, Semifinals and Grand Finals match thread\n",
        "score": 51,
        "url": "https://www.reddit.com/r/starcraft/comments/1dqgdqr/2024_global_starcraft_ii_league_season_2_code_s/",
        "content": "# Welcome to 2024 Global StarCraft II League Season 2: Code S! The tournament concludes tomorrow, Saturday the 29th, with the Sefiminals and Grand Finals.\n\nLive updated scoreboards on [**Liquipedia**](https://liquipedia.net/starcraft2/Global_StarCraft_II_League/2024/Season_2) and I will also do my best to keep up the ones in this post throughout the broadcast, as my other obligations permit.\n\n# Broadcast time\n\n**Saturday the 29th**\n\n**08:00 UTC -** [**Countdown to broadcast**](https://www.timeanddate.com/countdown/generic?iso=20240629T08&p0=1440&font=cursive&csz=1)\n\n# Supporting GSL\n\n[**GSL Official Patreon**](https://www.patreon.com/GSL)\n\n[**Live audience ticket purchase**](http://www.ticketlink.co.kr/)\n\n# Commentary and updates:\n\n* [**Liquipedia Tournament Page. Includes a regularly updated bracket visual as well as timestamps**](https://liquipedia.net/starcraft2/Global_StarCraft_II_League/2024/Season_2)\n* [**Discord for live commentary and more**](https://discord.gg/BDWE78p)\n\n# Stream(s)\n\n* [AfreecaTV YouTube](https://www.youtube.com/watch?v=tOZSybQWU_s)\n* [AfreecaTV English](http://play.afreecatv.com/gslenglish)\n* [AfreecaTV Korean](http://play.afreecatv.com/afgsl)\n* [AfreecaTV Spanish](http://play.afreecatv.com/alphaxesp)\n* [AfreecaTV Russian](https://play.afreecatv.com/starladder/)\n* [AfreecaTV Taiwan](http://play.afreecatv.com/gsltw)\n* [AfreecaTV Japan](http://play.afreecatv.com/afgsljp)\n* [SCBoy](https://douyu.com/3484/)\n\n# VODs\n\nVODs will be available in the following places:\n\n* YouTube (linked above)\n* AfreecaTV (linked above)\n* [sc2links. com (spoiler free)](https://www.sc2links.com)\n\nBoth Semifinals matches are best of 5 (first to win 3 maps wins the match)\n\nThe Grand Finals is best of 7 (first to win 4 maps wins the match)\n\n# Semifinals Scoreboard\n\n|**Match**|**Team**|**Player**|**Score**|**Player**|**Team**|**Aligulac prediction**|\n|:-|:-|:-|:-|:-|:-|:-|\n|1|[Team Liquid](https://liquipedia.net/starcraft2/Team_Liquid)|[Cure](https://liquipedia.net/starcraft2/Cure)|1-3|[Dark](https://liquipedia.net/starcraft2/Dark)|[Talon Esports](https://liquipedia.net/starcraft2/Talon_Esports)|[1-3](http://aligulac.com/inference/match/?bo=5&ps=1665%2C76)|\n|2|[Blacklist International](https://liquipedia.net/starcraft2/Blacklist_International)|[Creator](https://liquipedia.net/starcraft2/Creator)|1-3|[Maru](https://liquipedia.net/starcraft2/Maru)|[Team Vitality](https://liquipedia.net/starcraft2/Team_Vitality)|[1-3](http://aligulac.com/inference/match/?bo=5&ps=2%2C49)|\n\n# Grand Finals Scoreboard\n\n|Team / Player|Map winner|Score: 4-2|Map winner|Team / Player|\n|:-|:-|:-|:-|:-|\n|[Talon Esports](https://liquipedia.net/starcraft2/Talon_Esports) / [Dark](https://liquipedia.net/starcraft2/Dark)|X|[Ghost River](https://liquipedia.net/starcraft2/Ghost_River_LE)||[Team Vitality](https://liquipedia.net/starcraft2/Team_Vitality) / [Maru](https://liquipedia.net/starcraft2/Maru)|\n||X|[Goldenaura](https://liquipedia.net/starcraft2/Goldenaura_LE)|||\n|||[Oceanborn](https://liquipedia.net/starcraft2/Oceanborn_LE)|X||\n||X|[Site Delta](https://liquipedia.net/starcraft2/Site_Delta_LE)|||\n|||[Alcyone](https://liquipedia.net/starcraft2/Alcyone_LE)|X||\n||X|[Amphion](https://liquipedia.net/starcraft2/Amphion_LE)|||\n|||[~~Dynasty~~](https://liquipedia.net/starcraft2/Dynasty_LE)|||\n\nIf you've read this far, do also [check out the event calendar on](https://tl.net/calendar/) There's plenty of Starcraft going on before and after this event!\n\n**Enjoy the games!**",
        "num_comments": 58,
        "comments": [
            "GG! Well played by Dark he was reading Maru like a book",
            "If it's really the end of GSL, I hope Maru to win it to get G9L...actually I'm fine with any of these four winning it. I've had so much fun and joy from watching GSL over years and I'm thankful to all the GSL players for all the wonderful moments, brilliant builds and great games. I know all good things must come to an end, I will always remember all of these beautiful memory which keeps popping into my mind - I used to wake up at 2am just to catch up GSL live, we used to have 9pm GSL on Friday, the greatest TvT by Maru/TY in 2018 S3 Finals, gumiho's run in 2017, Maru's 4 GSLs in a row, Trap losing PvZ sadly in 2019 patch, sOs being so close to get his first GSL against Innovation, sOs' proxy nexus into DT vs bunny, Byun's win in 2016, \"Roar\", ... It's been a good run. No matter if it's the end, Thank you GSL.",
            "damn I've been watching this game for 10 years and this is the first time seeing dark cry on stage...",
            "Maybe GSL isn’t dead after all. Tasteless said there will be more info to come after EWC",
            "Would love to see a protoss win. Go creator!",
            "Can’t win them all 🤷🏻‍♂️\n\nDark’s tearing up talking about his daughter 😭",
            "Dark is always so fun to watch, his read on the game and decision making is so unique",
            "Wow, a great finals to end a really good season. So happy for Dark, he deserves every bit of it and played absolutely incredibly today. His reads on what Maru was going to do were incredible, and his nydus's were so on point.\n\nI really hope this isn't the last season of GSL. I hope to see everyone for the next season :)",
            "Despite him being really strong in TvT and TvP, Cure hasn't looked that great in TvZ to me, so we could well see a Maru v Dark finals again.\n\nExpected Dark 4-2 Cure, Maru 4-1 Creator, Maru 4-2 Dark.",
            "Msl.. Maru star league. But go creator!"
        ]
    },
    "Sarah Kerrigan cosplay by me": {
        "title": "Sarah Kerrigan cosplay by me",
        "score": 879,
        "url": "https://i.redd.it/ascdlhqbre9d1.png",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Focused butt shots just like Blizzard would",
            "not only is the cosplay and the gun peak but in typical Blizzard fashion both the face and somehow the butt are both visible from the front\n\n10/10",
            "Sarah Kerigan cosplay posted by a bot account farming upvotes*\n\nMy mistake this isn't the yearly sarah kerrigan bot farm post.",
            "Concept artists all over the world: \"See, that's totally a normal and anatomically possible way to stand!\"",
            "could, am lookjing at this all day, this a real person? meh who cares.",
            "I'm sorry about for your dms, sis",
            "Blizzard knows what fans like",
            "It's still a bot though.",
            "Amazing",
            "Great cosplay!"
        ]
    },
    "Test driving the Boardgame, I'll post files soon.": {
        "title": "Test driving the Boardgame, I'll post files soon.",
        "score": 39,
        "url": "https://www.reddit.com/gallery/1dr7air",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Just at first glance, I'm thinking that you must construct additional pylons.",
            "Please drop the CC file. I want to paint one for my dad who got me into sc",
            "Im interested to see how this will turn out. Keep us posted!  I've made a couple board/card games for my kids that we still play, but getting around to having them truly printed was always daunting for me.",
            "Ah crap, this landing site doesn't have any gas!",
            "Cults3d.com"
        ]
    },
    "So, was or wasn't this the last GSL?": {
        "title": "So, was or wasn't this the last GSL?",
        "score": 19,
        "url": "https://www.reddit.com/r/starcraft/comments/1draskh/so_was_or_wasnt_this_the_last_gsl/",
        "content": "There was very mixed messaging here. They kept saying \"last GSL\" but also talked about more announcements and the future. Which is it?\n\nAnyways, if it was, it was a wild run and I'll always cherish the memories.",
        "num_comments": 4,
        "comments": [
            "They said more news after EWC. So we don't know.",
            "I thought I heard we would hear after the esports World Cup, but others can correct if wrong..",
            "Last GSL but future announcements could mean partnering up with other organizations to share the responsibility of more SC2 tournaments, and they will call it something different.\n\nBut who knows",
            "[It's quite normal to have no announcement at the end of GSL season finals](https://www.reddit.com/r/starcraft/comments/y4hg4w/comment/iseiulg/), so no announcement here was quite par for the course. \n\nNow of course, this says nothing about whether or not GSL will continue, but I would not start sweating it before Afreeca actually announces something or other. There's very little point."
        ]
    }
}