{
    "The JOJOLands - Chapter 16": {
        "title": "The JOJOLands - Chapter 16",
        "score": 835,
        "url": "https://www.reddit.com/r/StardustCrusaders/comments/1distwg/the_jojolands_chapter_16/",
        "content": "The JOJOLands is the ninth part of JoJo's Bizarre Adventure.\n\nChapter 16 is now out officially in Japan. Discuss the chapter here.\n\n* [Mangadex](https://mangadex.org/chapter/494bad68-08ab-4e22-be3d-e15707768e8b) ([Hi Wa Mata Noboru](https://hiwamatanoboru.com/))",
        "num_comments": 389,
        "comments": [
            "\"The unending pursuit begins\"\n\nJoJolion is so fucking back, baby",
            "Seems like Jodio mixing up three letter acronyms wasn't just a one off joke when he was talking about music with Charmingman",
            "I like the part where Jodio explains what the fuck an mri is",
            "Oh my god that last scene is incredible. They effectively got her killed as a mechanism to bring the land to them. I'm glad we are already setting up that using the rock means potential sacrifices being made, and that the gang will be willing to accept progressively worse consequenses to achieve it. This is the best chapter in a while.",
            "The Jodio pose on the cover page is insane. It's like he broke all of his limbs",
            "When they first showed the land registry woman in the hospital I thought it was Holly for a second lol",
            "Stand name discovered: Bags' Groove, a Miles Davis album.\n\nEDIT: Well, not sure whether we should go with song or album...\n\nEDIT THE SECOND: It was actually composed by Milt Jackson (it's jazz). Davis was the one behind its most famous rendition.",
            "Smooth operators shrunk to fit in Dragona's windpipe!! Stand shrinking is back!!!1!",
            "Jodio yelling \"There's a sequence Dragona!\" while Dragona is on the floor dying is so funny",
            "Seems like the greater the price (or harder to get in possession of) of the thing they’re trying to steal is the greater the price other people will have to pay to get it to them. Like the few dollars made it right to them with no worry, that 80k watch had the guy who bought it lose the money he spent and had his girl leave him, and this 50 billion dollar land got someone killed. \n\nI can see this over time leading to something like one of the main characters getting killed off for a extremely large some of cash and completely regretting it. Something like Jodio finally becomes filthy rich like he wanted but at the price of losing dragona, someone Jodio would probably consider to be priceless. Giving him the maximum reward for maximum price.\n\n\nGreat chapter. I know we’re already 16 chapters in but it still feels weird when new characters get introduced"
        ]
    },
    "Which MILF do you prefer the most?!?!": {
        "title": "Which MILF do you prefer the most?!?!",
        "score": 253,
        "url": "https://i.redd.it/p8jgz072a28d1.jpeg",
        "content": "",
        "num_comments": 101,
        "comments": [
            "Where is bucciarati in this ?",
            "Lisa Lisa and Tomoko man",
            "Lisa Lisa",
            "call me crazy but holy’s where its at",
            "Shinobu honestly and I don’t even know why",
            "Suzi Q where?",
            "My ranking starts from Lisa Lisa and goes counterclockwise",
            "Shinobu",
            "Tomoko ![img](emote|t5_2tny5|49675)",
            "These are all very funny ways of drawing Speedwagon 4 times."
        ]
    },
    "If Star platinum was still as strong and accurate/precise as part 3, then why can't he throw a particularly huge rock Ratt's location?": {
        "title": "If Star platinum was still as strong and accurate/precise as part 3, then why can't he throw a particularly huge rock Ratt's location?",
        "score": 242,
        "url": "https://i.redd.it/joe59147a28d1.png",
        "content": "It would only make sense that Jotaro already knew its position. Even if jotaro didn't know Ratt's precise location, he knew it was somewhere between those 2 identical looking rocks, and we've already seen jotaro defeat an enemy because of 2 oddly shaped looking rocks. So, couldn't he just have star platinum chuck a Boulder at its position like an artillery strike?",
        "num_comments": 39,
        "comments": [
            "Jotaro didn't know it's location tho. Why else would he be asking Josuke if he found it yet? You can't punch away Ratt's dart without poisoning yourself so bringing out your stand is just expanding your hit box.",
            "Because he was training josuke",
            "Because Araki instead wrote the fight around Josuke needing to deal the finishing blow instead of Jotaro. Besides a big boulder would make Jotaro incredibly vulnerable since Star Platinum is too busy lifting it to defend itself.",
            "If Jotaro did that, I guarantee you Araki would write it that the rat dodged it or something. If a bullet going at incredible speeds struggles to hit a rat, than I doubt a large boulder would fare better.",
            "because the two rocks Ratt was between would stop the boulder from landing directly on top of it duh",
            "Because that's not the point of the arc; it's not the story Araki wants to tell. Jotaro (and Araki) was giving Josuke his time to shine.\n\nIf JoJo was just about killing the enemy as quick as possible it wouldn't be nearly as good. You're missing the forest for the trees.",
            "More importantly, why didn't he bring something from house to use as improvised shield? Earlier Crazy Diamond blocked a shot from another rat with frying pan.",
            "Because then we wouldn't have Josuke's cool fucking homing projectile in the final battle)",
            "Actually, Jotaro could have dealt the finishing blow to Ratt even easier than Josuke, but he just let Josuke do it because he was trying to mentor him",
            "I think the point of the rat fight was jotaro training up josuke, making sure he was capable for future fights as much as possible. He could have just crushed the rat, but then the next time josuke was in a bind he'd have to come solve that one too, and so on and so on"
        ]
    },
    "can someone please tell me what this is (from opening \"heaven's falling down\")": {
        "title": "can someone please tell me what this is (from opening \"heaven's falling down\")",
        "score": 1349,
        "url": "https://i.redd.it/10lduycq1z7d1.png",
        "content": "",
        "num_comments": 136,
        "comments": [
            "I guess this jsut explains that most people weren't in hospital to just guess what this can be.\n\nBasically, isnce Jotaro is not functional, yet his body still kinda functions. This tube connects to lower intestine to take all that his organs produce. Because otherwise he'd piss and shit himself.",
            "How about the ones that aren't even connected to anything lmao",
            "Cock protecter",
            "It's genuinely the stupidest panel in the whole series. They literally said Jotaro by that point could already understand ~~20~~ 30 words and shower by himself among other tasks.",
            "He need it to pee. \nAnd they just made it so it was exactly on his proper canon d*ck size because jojo needs to out-gay itself constantly to survive.",
            "Food tube",
            "THE MEGA CATHETER",
            "cock holder. it has to be that large to hold it. it's fucking gigantic",
            "An enemy stand with the ability to steal semen",
            "I swear this looks almost AI generated with how jank it appears."
        ]
    },
    "If you could make one thing canon in JoJo, what would it be?": {
        "title": "If you could make one thing canon in JoJo, what would it be?",
        "score": 1202,
        "url": "https://i.redd.it/akzwbmha1z7d1.jpeg",
        "content": "",
        "num_comments": 468,
        "comments": [
            "Giorno and Mista stopped at Disney World Orlando on their way to cape Canaveral and that’s why they don’t make it in time to stop Pucci.",
            "Crazy Diamond being unnable to heal Josuke is actually a phisicological limitation due to Josukes strong sense of self, refusing to change the way he is. And that once he accept change, crazy diamond will be able to use his reconstruct ability on him.",
            "Alessi making Joseph younger In part 3 inadvertently making him stronger. Even just for a moment. Would've been great.",
            "Emporio's cry scene at the end of Stone Ocean causes it to >!rain because he still has Weather Report's disc inside of him.!<",
            "Part 7 Spoilers: >!Hot Pants doesn't die. She just retreats to tend to her wounds and couldn't catch up with everyone because I am still salty about her death.!<",
            "Bucciarati being relative to zepelli’s cause I’m kinda mad that there isn’t even a mention to zepelli family in the part being set in Italy",
            "Chariot requiem was heading towards to Jotaro",
            ">!The In a Silent Way encounter was actually Sandman from another universe!<",
            "Just one thing? I guess I’d go with Purple Haze Feedback.",
            "Diavolos deaths are actually his soul being send to the body of his counterparts in other universes a moment before their natural deaths by fate would occur."
        ]
    }
}