{
    "FAQ and Beginner Questions Thread [March 14, 2024]": {
        "title": "FAQ and Beginner Questions Thread [March 14, 2024]",
        "score": 138,
        "url": "https://www.reddit.com/r/StardewValley/comments/1bebrg7/faq_and_beginner_questions_thread_march_14_2024/",
        "content": "Welcome to Stardew Valley! Here are some common answers to get you started. Feel free to ask beginner questions here rather than making a full post on the subreddit. \n\n# General questions\n* **[Common gameplay questions](https://www.reddit.com/r/StardewValley/wiki/faq/)**\n* [Tips and guides](https://www.reddit.com/r/StardewValley/search?sort=top&q=flair:Resource&restrict_sr=on)\n* Official [wiki](http://www.stardewvalleywiki.com/), [website](http://stardewvalley.net/), and [forums](https://forums.stardewvalley.net)\n* [Stardew Valley Discord](https://discord.gg/stardewvalley)\n* [Using mods](https://stardewvalleywiki.com/Modding:Player_Guide)\n\n# Previous pinned posts, subreddit announcements, and new rules\n* Want to look through old FAQ threads for an answer to your question? Here is our [old FAQ thread](https://www.reddit.com/r/StardewValley/comments/16jt60y/faq_and_beginner_questions_thread_september_16/)\n* [Animated Custom Flairs and Prestige Flairs](https://reddit.com/r/StardewValley/comments/sju1h5/announcing_custom_user_flairsand_animated/)\n* [Community Updates and Inclusivity Reminders](https://reddit.com/r/StardewValley/comments/w7pzoh/community_reminders_and_updates_inclusivity/)\n* [/r/StardewValley left /r/ popular and /r/ all](https://reddit.com/r/StardewValley/comments/w7ppsm/rstardewvalley_is_leaving_rpopular_and_rall/)\n* [After user voting, AI generated content will be added to the list of removed topics](https://reddit.com/r/StardewValley/comments/x9963t/rule_update_aigenerated_content_will_be_removed/)\n* [Simple questions are welcome](https://www.reddit.com/r/StardewValley/comments/ymdiko/mushrooms_or_fruit_bats_simple_questions_are/)\n* [Content warning rules](https://www.reddit.com/r/StardewValley/comments/1367xy8/spoiler_tags_content_warnings_sensitive_topics/)\n* [New mods announcement](https://www.reddit.com/r/StardewValley/comments/15rfn3q/our_new_mods_have_joined_the_team/)\n* [Metrics for IRL posts and relativity](https://www.reddit.com/r/StardewValley/comments/15ooqfe/is_this_relevant_to_stardew_valley_on_giant_crops/)\n* [Userflairs for bot bouncers](https://www.reddit.com/r/StardewValley/comments/166och5/new_userflairs_for_bot_bouncers/) \n\n# Very common FAQs / removed topics \n* **[insert item here] showed up on my farm, what is it?**\n     It could be a a few different items that are >!relatively rare but have a high enough spawn rate!< that they are included in our removed topics. Check out our [list of removed topics here](https://www.reddit.com/r/StardewValley/wiki/removed_topics)\n\n* **\n\n\n# Game updates\n* **What was in the last update?**  \n  See release notes [for PC](https://stardewvalleywiki.com/Version_History), [for consoles](https://stardewvalleywiki.com/Console_Version_History), and [for mobile](https://stardewvalleywiki.com/Mobile_Version_History).\n\n   See also a table of [which version and features each platform has](https://stardewvalleywiki.com/Stardew_Valley#Current_versions).\n\n* **Are future releases planned?**  \nStardew Valley 1.5 was released on PC in late December 2020 and console in February 2021. Android/iOS received the 1.5 update in early January 2023. Stardew Valley 1.6 released on 19 March 2024 on PC. [Console release to follow ASAP](https://twitter.com/ConcernedApe/status/1762192764899627457).\n\n* **Does every platform get the same content/updates?**  \n  Mostly yes. Updates are developed for Linux/Mac/Windows first, then ported to other platforms. There are customizations for each platform (like tap to move on mobile), but otherwise content is identical across all platforms. See also a table of [which version and features each platform has](https://stardewvalleywiki.com/Stardew_Valley#Current_versions).\n\n  The exceptions are PS Vita (which won't get any further content updates [due to platform limitations](https://twitter.com/ConcernedApe/status/1232797409010278400)), and Android/iOS (which will continue getting all updates, but [don't support multiplayer](https://twitter.com/ConcernedApe/status/1262068497086967808) or Chinese translations).\n\n* **Is Stardew Valley on XBox GamePass?**\n\n     Stardew Valley is on XBox GamePass as of December 2, 2021. See [here](https://news.xbox.com/en-us/2021/12/01/coming-soon-xbox-game-pass-december-2021/) for details.\n\n# Multiplayer\n* **How does multiplayer work?**  \n  See [Multiplayer](https://stardewvalleywiki.com/Multiplayer) on the wiki.\n\n* **Is crossplay supported?**  \n   All PC players can play together, whether they're on Linux/Mac/Windows or GOG/Steam. [Console crossplay isn't supported](https://twitter.com/ConcernedApe/status/1036993838613651459), and mobile versions don't have multiplayer.\n\n* **Is split-screen supported?**  \n  Yep, split-screen was added on PC and console in Stardew Valley 1.5.\n\n* **Will Android/iOS get multiplayer?**  \n  There are [no current plans for multiplayer on mobile](https://twitter.com/ConcernedApe/status/1262068497086967808) (including split-screen multiplayer).\n\n* **Will the 1.6 update apply to my current game?**  \n  Yes! New updates always apply to existing saves.\n\n# Other\n* **Can I transfer saves between devices?**  \n   You can [transfer saves](https://stardewvalleywiki.com/Saves#Transfer_a_save) between Android, iOS, and PC (Linux/Mac/Windows).\n\n   Consoles unfortunately don't let you access the save files. The Switch version also has a different format that's not compatible with other platforms (the format used by other consoles is unknown).\n\n* **How do I take a screenshot of my full farm?**  \n  See [this guide to taking farm screenshots](https://forums.stardewvalley.net/threads/how-to-share-your-farm-and-use-stardew-planner.152/).\n\n* **If I buy the game on one platform, can I get it for free on a different one?**  \n   If you buy it on PC, you get the Linux + macOS + Windows versions; if you buy it on PS4, you get the PS4 + PS Vita versions. Otherwise each platform is a different edition with separate development, so you'll need to buy it again if you want it on a different platform.\n\n* **Where can I report bugs?**  \n  1. If you use mods, see the [troubleshooting guide](https://stardewvalleywiki.com/Modding:Player_Guide/Troubleshooting) first.\n  2. If you use mods and the bug disappears when playing without them (by running `Stardew Valley.exe` directly in [your game folder](https://stardewvalleywiki.com/Modding:Game_folder)), report it to r/SMAPI or see [Modding:Help](https://stardewvalleywiki.com/Modding:Help).\n  2. If it happens without mods, report it in the official [bug report forum](https://forums.stardewvalley.net/forums/help-bug-reports.12/), which the game developers keep an eye on.\n\n* **How do I use or create mods?**  \n   See the pinned thread in r/SMAPI for more info, and feel free to ask questions in r/SMAPI!",
        "num_comments": 2319,
        "comments": [
            "Our save games will be fine once the 1.6 upgrade happens right?! People on the sub are talking like I finished x before 1.6 and Id better hurry up and do abc before 1.6\n\nBut the save games will be fine right? (Thinking of the devastation of my 7y/o if it didnt work)",
            "I started a new save on the new meadow farm, and I keep getting \"You've got some new ideas to sleep on...\" message what does this mean?",
            "Can dogs randomly give you sticks now? I just now went to go pet my dog and I ended up getting a piece of driftwood in my inventory as if my dog had found a stick and had given it to me, much like dogs do Irl.",
            "I don't have much of a comment, but I am getting back at Stardew Valley now, and I just wanted to say that I really appreciate this post! As someone who hasnt played in years, the \"console/PC patches\" link is a god sent!",
            "Silly question but what is that impossible to catch fish in the ocean? Ive noticed a similar pattern where it leaps to the top of the bar at the start and then crazily goes up and down & I lose the fish every single time. Im so determined to catch it but what on earth is it?! Its not a puffer or octopus because Ive catched those",
            "The post still says there's no release date for 1.6, but it's been announced it's now March 19th, at least for PC.",
            "do we know what blue grass does?  \ni tried to look on the wiki but only get  \"Has a chewy blue grass that animals love\"",
            "I'm struggling to figure out what to even do on a most basic level. I've cleared some ground, planted and harvested turnips, and walked to the town. I don't know what comes next. I talk to people and the general vibe is \"hey you're new, fuck off!\". It also seems that by the time I walk to town, my character needs to sleep, so then it's time to walk home. I see screen shots of elaborate farms and stuff and I don't know how that's possible.",
            "Is it worth getting more than 20 lightning rods? Heard they give diminishing returns",
            "What should i have done by the end of the second year?"
        ]
    },
    "r/StardewValley is looking for new moderators!": {
        "title": "r/StardewValley is looking for new moderators!",
        "score": 38,
        "url": "https://www.reddit.com/r/StardewValley/comments/1dk8eoh/rstardewvalley_is_looking_for_new_moderators/",
        "content": "Hiya farmers!\n\nWe're looking to add a few new moderators to our team. If you're interested, please apply [in this form](https://forms.gle/S5EdoXcrirEHdx8r6).\n\n---\n\n# FAQs\n\n\n**What if I'm not always online?**\n\nModerators are unpaid volunteers. You won't be expected to moderate full-time or keep a set schedule; the benefit of having multiple moderators is to distribute the work and fill in gaps when someone is offline. \n\n\n**Am I qualified?**\n\nWe're looking for users who fit these requirements:\n\n- active in posting/commenting anywhere on Reddit;\n\n- active on the subreddit (even if just as a reader);\n\n- account age of at least 6 months;\n\n- willing to join our private Discord;\n\n- willing to help with routine work like reviewing user reports at least a few times a week.\n\n\nBonus (not required):\n\n- have previous experience moderating a subreddit.\n\n---\n\n**Applications are open until Thursday, July 11th.** We will contact those selected to join the team by DM. We tend to get a lot of applications each time, so the selection process can take several weeks.\n\nPlease let us know if you have any questions!\n\n---\n\n# Google forms\n\nhttps://forms.gle/S5EdoXcrirEHdx8r6\n",
        "num_comments": 30,
        "comments": [
            "let the hunger games begin ",
            "how many applications are there and how many people will be selected?",
            "i applied. Best of luck to everyone else. ",
            "Good luck to those applying!",
            "***Moderators are unpaid volunteers.***\n\nIf you'd like me to be a moderator, we're going to have to discuss the salary because this is unacceptable with a multi-million dollar company.",
            "Why does clicking the '1.6 release thread' button take me here?",
            "Third time's the charm, let's go! ",
            "I was thinking, I could be a moderator! Until I saw account of six months Cant wait to see new moderators though!",
            "Just submitted an application! I'm hopeful and excited :D",
            "Is it ok that I edited my response 2 times I just forgot to add info and was wondering if that affects the process in any way ?"
        ]
    },
    "Did I just become an accessory to murder?": {
        "title": "Did I just become an accessory to murder?",
        "score": 619,
        "url": "https://www.reddit.com/r/StardewValley/comments/1dr20kd/did_i_just_become_an_accessory_to_murder/",
        "content": "https://preview.redd.it/1xm6wivvkf9d1.png?width=834&format=png&auto=webp&s=5677684a172a427153b7e3bdc3b2c321c712bdc7\n\nhttps://preview.redd.it/rmcfglvvkf9d1.png?width=383&format=png&auto=webp&s=763da180467318104608ba2e8f4d6cd3cf956f2b\n\nhttps://preview.redd.it/d5vauivvkf9d1.png?width=1250&format=png&auto=webp&s=49ee7c78b70c4b89100025acaa355025912ead78\n\n",
        "num_comments": 36,
        "comments": [
            "Who cares if its Pierres murder amiright",
            "Nah, probably just knocked him out so she could sneak off to the mines to hunt for amethyst. Also...it's *Pierre*. Give him two red mushrooms. One for her prank and the other to get back at him for claiming to be selling his own home grown produce when really it's stuff from your farm. Revenge is fun-gi. ![gif](emote|free_emotes_pack|joy)",
            "I have two questions. What is Abigail's outfit and how have I never seen this request?",
            "Nah, the red mushroom (amanita muscaria) is toxic in the sense it will make you throw up and have hallucinations but it isnt lethal.  Pierre would be tripping out for a few hours, which might do it for Caroline if shes hitting her special tea at the same time. ",
            "My best friend has a vendetta against Pierre",
            "I still don't quite get the hate for Pierre. Someone explain?",
            "Maybe Pierre already has a favorite red mushroom and she Just wants to act if she is destroying it in front of him. And then go like, tada, its fine!",
            "Kent asked me for a megabomb once",
            "And that's why I marry her.\n\nAlibi.",
            "Nah cuz it's Pierre it's for the good of the town"
        ]
    },
    "Haley in my style ": {
        "title": "Haley in my style ",
        "score": 608,
        "url": "https://i.redd.it/ibwmpmqo2f9d1.png",
        "content": "",
        "num_comments": 18,
        "comments": [
            "okay i need you to do them all",
            "Honestly reminds me a little of Julia from Cowboy Bebop, just in the style and sass.",
            "shes so gorgeous im cryingsobbing",
            "And Ive decided I love your style!",
            "this is so beautiful omg  i love your art!",
            "MY WIFE omg. youre so good OP my eyes are blessed ",
            "I already did penny and abigail! I'm thinking about posting them tomorrow. Maru is on the way as well!",
            "This is really good!",
            "Would",
            "Absolutely gorgeous "
        ]
    },
    "Does anyone else not bother with having a horse in the game? (or any of the most basic parts of the game, I'm curious)": {
        "title": "Does anyone else not bother with having a horse in the game? (or any of the most basic parts of the game, I'm curious)",
        "score": 131,
        "url": "https://www.reddit.com/r/StardewValley/comments/1dr548g/does_anyone_else_not_bother_with_having_a_horse/",
        "content": "I had a horse in my OG playthrough but in my current one save I don't even bother. My farmer drinks Triple Shot Espresso and goes \"BRRRR\". I like to forage and talk to people while moving across the map and I'm just too lazy to get off the horse. Plus I'm rather...efficient with space on the farm so no, no space for you mate.",
        "num_comments": 82,
        "comments": [
            "The horse makes me sad because if I leave them alone for weeks they just stand and stare and I don't have to pet them and they don't love me :( LOL ik that's crazy but when I have the horse I feel like I have to ride it.  And then I get guilt tripped if I ride it to the bus stop and am out in the skull caves too long :( LOL",
            "Oh no Im so happy when I unlock the horse! Hes so much faster, I hate how slow we move when walking. Also I can put hats on his head.",
            "I do use the horse, because coffee buff works with it, as well as food buff, and then you have that book which speeds it up as well as a carrot speed buff, and in the end game you have a whistle. Aside from teleporting and minecarts, horse is the fastest way of travel in the game.\n\nIt's nice to have, and practically a necessity on beach farm due to the insane verticality of that farm compared to the rest.",
            "I don't bother with a horse, either. I had one in my first save, but didn't use it much. I haven't bothered with a horse in any of the subsequent farms.",
            "I've never had a horse in Stardew, I like the slower way of life while walking everywhere and talking to anyone I encounter.",
            "I can't be without the horse, our character is very slow",
            "You know that espresso stacks with the horse right? You drink it and you ride faster",
            "I hardly ever get a horse, I get annoyed having to get on and off all the time so dont bother",
            "When I played on tablet, I used horse, but did not like that. I'm on PC now. I'm a tractor person. You'd be amazed what you can do on the tractor.",
            "I got my horse in summer year one it was awesome"
        ]
    }
}