{
    "My Manager Wonders Why Our Scores Are Bad": {
        "title": "My Manager Wonders Why Our Scores Are Bad",
        "score": 108,
        "url": "https://i.redd.it/lq89kxk0xh9d1.jpeg",
        "content": "Like maybe cause we have to train 2-3 people every few months, so now you know why our customer score is below 40 🫠🙃",
        "num_comments": 14,
        "comments": [
            "\"Am I really such a bad manager? No... no, it's the partners who are wrong.\"",
            "Lets see the ssv turnover babe I see a 40 something ",
            "99%. Not bad. My first \"real job\" was a company owned Taco Bell (not a franchise), in Northridge CA.  After about 6 months, I was the most senior employee in the store, which included the managers. I lasted about 1 1/2 years there. I lost count how many managers and front line employees went through the place. Maybe a couple hundred.",
            "I'm amazed that this is a metric that most DMs gloss over. If the company really wanted to change their culture they would reward SMs and DMs who could keep this number low.",
            "this post brings me so much happiness",
            "I can literally hear it in my head ",
            "And also reward workers with proper pay.",
            "Abysmal omg",
            "Good lord",
            "Dear Neptune"
        ]
    },
    "I’m a customer holy shit ": {
        "title": "I’m a customer holy shit ",
        "score": 438,
        "url": "https://www.reddit.com/r/starbucks/comments/1dqsbo6/im_a_customer_holy_shit/",
        "content": "Just saw three people quit and the one lady remaining start crying today. Eau Claire Wisconsin. Maybe this Bogo shit has gone too far.",
        "num_comments": 70,
        "comments": [
            "I feel for everyone working on those days. Customers can be brutal. I think the prices on the drinks have gotten so high now that customers feel entitled to a lot. $7.25 is a lot to spend on a single drink.",
            "Holy shit, how many people were on the floor to begin with? And did those three people quit at the same time? BOGO has been hell. Corporate will NOT let us schedule more people because all they care about is money. Maybe if enough people quit and they lose business because of it, they'll finally learn. Not holding out much hope, though.",
            "Had a customer tell me I was rude because I kept asking her \"anything else?\" When she was ordering, she was like why do you keep saying anything else and not let me finish? She's like your rude. All I said was oh. Cause she was pausing each time so I had to pursue her order along like usual with customers",
            "..what has this company come to..more of a reason for me to gtfo",
            "There were only 3 of us scheduled for the bogo today, and we're sooo busy right now that my shift almost cried sending us out onto our lunches. People are being impatient and rude, and there's been yelling from both parties. I'm tired of people thinking that behaving this way is acceptable. This isn't okay, we don't deserve this, and corporate should know better. This is why so many people are quitting, and why the remaining are trying to unionize\n\nIf you're one of the kind ones, we can't appreciate you enough, and we'd probably do anything for you lmao. You don't have to tip, just be human and its enough",
            "It would be different if they werent like every damn week it gets ridiculous. it causes rushes at times we normally are slower and have time to do other things, and we dont have as much staff. If they really wanna bring in customers they should lower the mf prices instead. Today has been soo tiring, im on my last 10 and cant wait to leave.",
            "Where's Lax? Isn't he supposed to be working shoulder to shoulder with us?",
            "Canada doesn't seem to get as many promos as everyone else gets. Customers don't seem to enjoy it but I hope it helps keep the baristas sanity a bit more because holy shit is right.",
            "Yeah the bogos are not fun. I love peak because I love being busy but when you have two peaks in the same shift its not amazing. Even with the projected scheduling its odd. My sm is awesome and helps out as much as she can but it is still sucky",
            "Literally just waiting for the company to explode. I dodged a bullet leaving when I did."
        ]
    },
    "What does it mean when a barista draws a smiley face on your drink?": {
        "title": "What does it mean when a barista draws a smiley face on your drink?",
        "score": 216,
        "url": "https://i.redd.it/ni4wk06czd9d1.jpeg",
        "content": "I went to Starbucks this morning and when I got my order, I noticed four smiley faces on the lid and it truly made me smile and made my day. I never really get these kind of drawings or smileys at all so when I saw this like I said it made my day. I was wondering if there is any meaning behind when baristas draw or write on your cups. Is it a sign of flirting? I know this sounds stupid but I’m genuinely curious.",
        "num_comments": 85,
        "comments": [
            "Just a nice thing some baristas do when were slow or if a car is holding up the line with a big order and were waiting on items. Or if theyre just feeling nice, we have stickers to put on cups and some carry sharpies to write a nice message or in your case a smiley face on your cup",
            "It means the store was slow, but it always comes from the nicest people! Glad that made your day! If you have the starbucks app make sure to leave a good review if it gives you a survey!",
            "This is the reason I draw and write notes on cups!!! Im glad someone appreciates it, even if its not at my store.",
            "Im glad youre sweet and happy in the replies but seeing these posts all the time make me laugh like there will be a sticker that says Have a great day! and people will be like WHAT IS THIS??????? ",
            "A barista once wrote her number on my latte cup.\n\nWeve been together 13 years and married for 6.",
            "You need to get into witness protection right now",
            "It actually means there is poison in that one :/",
            "just means were bored during opening and start doodling on cups",
            "Oh nothing much, just that youre next",
            "You have been marked. Leave a cup of lamb's blood on the windowsill tonight or suffer the consequences."
        ]
    },
    "Latest Starbucks Energy Drink Tweet Reviews": {
        "title": "Latest Starbucks Energy Drink Tweet Reviews",
        "score": 470,
        "url": "https://i.redd.it/bynpex66cc9d1.jpeg",
        "content": "",
        "num_comments": 147,
        "comments": [
            "Its literally selling out every day in my store  a lot of people add light lemonade or peach juice to enhance the flavors.",
            "ah yes, the two most trusted",
            "Its bc people are too used to sugar drinks that they cant even enjoy anything else",
            "I get a pump of classic in it and lemonade instead of tea. Customers arent allowed to customize it but as a barista I can cuz we dont care",
            "I love the melon cucumber one. I just had a baby and had gestational diabetes the whole time. I couldnt have anything from Starbucks really because its all so sugary. Its nice theyre embracing sugar free drinks. I know the ingredients of sweet sugar free drinks are controversial, but as someone who literally couldnt drink any sugar something like this would have been nice.",
            "The melon one was kinda bad but the tropical citrus with light peach juice and a little bit of classic goes so hard.",
            "I cant lie, I love it! I love it without the passion or green tea. I actually feel it stronger than coffee and it gets me through these long shifts",
            "A seltzer devoid of flavour sounds good to me",
            "Thankfully I base my opinion off of random tweets that nobody saw",
            "I find it very refreshing. Gonna be my go to for the rest of the summer instead of coffee."
        ]
    },
    "Again! Is like they want to work you to death or quit.": {
        "title": "Again! Is like they want to work you to death or quit.",
        "score": 21,
        "url": "https://i.redd.it/wfx2icdech9d1.jpeg",
        "content": "Is tmw you guys have time to call out. ",
        "num_comments": 11,
        "comments": [
            "Love that they told us a couple months back that theyd let us know as soon as possible when promos are happening, with enough time for managers to schedule  and whats the fucking point of giving us the promo calendars every month if theyre just gonna spring this shit on us?",
            "It's simple: work at the pace of one barista because that's what you are. If customers complain, let them call corporate. Corporate won't listen to us, so they might as well hear it from the people dishing out money to wait 40 minutes for their drinks. TAKE YOUR BREAKS. We don't get paid more if we work faster. We don't earn commission on sales. Laxy, my man, you're running this company and thr culture it was founded on into the ground, and you suck.",
            "Of course this is the one Sunday I work, the usual Sunday shift requested off so I covered to help them out ",
            "Bro! Probably because they know people dont want to work in that madness.",
            "That's why they aren't telling us ahead. It's so that the managers CAN'T add the extra labor, otherwise the labor: profit ratio would be more balanced. The shareholders don't want balanced workloads for employees, they want maximum profits.\n\nWe are all special unique irreplaceable individual.....cogs in a machine that could be replaced in a day.",
            "kind of hard when youre a closer and corporate is screaming at you to get out at 9:30 on the dot because if youre any later you cut into everyone elses hours. we may not get paid more but we want to go home on time and we are pressured to do so constantly. its not right and something needs to change.",
            "You're right. Something needs to change, and closing is really hard. You can either meet customer demands or have cleanliness, but in my experience, you can't have both. I'm strictly an opener now, but when I was closing, my 8 hour shift would often turn into a 10 hour one just because we needed a couple hours to fix the place after working 2 partner plays for most of the afternoon/night. That was before the rapid fire of bogos too. This is absolute lunacy.",
            "Shit with my SSV M-F I dont get out till 9:45-10:12 however my weekend one I get out before 9:30 the latest with her was 9:38 and that was the last 4 for 20 it was a shit show",
            "there is no way that having 2-3 partners for 2-3 hours before close is sustainable and its genuinely breaking people down, myself included. ive been a closer for 2 years and its just been getting worse. no replacements for partners who have quit or changed schedules, no pre closers that care or have time to pre close. when i began we had 4-5 people until closing time and then 3 after close and we got out on time almost every day. the only way i can get out on time now is to leave someone on the floor to do EVERYTHING while someone does dishes and the shift does shift work. its not right. i wish i could leave the store as a massive mess to show how unsustainable it is, but no one gets blamed for that except the closers. not corporate. its ridiculous",
            "That's how I had to run closes too, with one person on the floor and the other to clean. It felt awful. When our new sm came, I said no more. I told myself I'd rather demote than be a closing shift. Idt there is much of an opener/closing war at my store. If they forget something major at night, I just let the other shift know without involving anyone else. We all kind of just get that it's an inevitable shitshow. Some of the people I work with are amazing, but I can't wait for the day that I find a job that doesn't stress me out the way this dumpster fire does."
        ]
    }
}