{
    "There appears to be a Reddit bug preventing users from posting via the official Android app": {
        "title": "There appears to be a Reddit bug preventing users from posting via the official Android app",
        "score": 23,
        "url": "https://www.reddit.com/r/startrek/comments/1d64j6g/there_appears_to_be_a_reddit_bug_preventing_users/",
        "content": "We've had several users report they're unable to make text posts. After some investigation we've confirmed there's a bug affecting the official Android Reddit app.  \n\nThe bug manifests as the Post button being unusable unless a link is entered. This prevents the creation of text posts since they do not use links.   \n\nReddit has yet to acknowledge the bug or provide an timeline for fixing it. \n\n# Workarounds  \n\nPlease don't enter a random link to create a text post. There are better workarounds you can use until it's fixed:\n\n1. Use your mobile devices web browser to make the post. Once you create the post, you can interact with it in the app. The bug doesn't affect commenting on an pre-existing post. \n\n2. Use a non-Android device such as iOS (iPhone/iPad) or a desktop computer. Once the post is made you can switch back. \n\nWe tried swapping around random isolinear chips but that only seemed to make things worse. The suggested workarounds are the only known solution for now. If you think you have a different solution please feel free to [send us a modmail.](https://old.reddit.com/message/compose/?to=/r/startrek) If it works we'll add it to the list. \n\n# Reporting  \n\nPlease report the bug to Reddit if you're experiencing it. The more people who report it, the faster Reddit will fix it (hopefully.)  \n\nBug reports can be filed by making a post on /r/bugs. Yes we understand that's silly since the bug prevents posting. Unfortunately that's just how Reddit chose to handle bug reports. The aforementioned workarounds should help.",
        "num_comments": 0,
        "comments": []
    },
    "Watching Star Trek in chronological order & started with Enterprise. Confused by the premise of the show though, hard to believe they would let their only starship just wander around aimlessly.": {
        "title": "Watching Star Trek in chronological order & started with Enterprise. Confused by the premise of the show though, hard to believe they would let their only starship just wander around aimlessly.",
        "score": 374,
        "url": "https://www.google.com/imgres?imgurl=https%3A%2F%2Fm.media-amazon.com%2Fimages%2FM%2FMV5BODg3ZmFmMzAtMTY0Yi00ZDdmLTk1MWMtOThjNjJjODlhMzkwXkEyXkFqcGdeQXVyNTE1NjY5Mg%40%40._V1_.jpg&tbnid=53ft99wwnbVKBM&vet=1&imgrefurl=https%3A%2F%2Fwww.imdb.com%2Ftitle%2Ftt0244365%2F&docid=QjWm7bHfhyDTJM&w=2480&h=3508&source=sh%2Fx%2Fim%2Fm1%2F2&kgs=41c1a31b80f587ab&shem=abme%2Ctrie",
        "content": "So I just finished the first season of Enterprise and am working my way through the second. I can't understand why they are just wondering aimlessly around deeper regions of space though. It becomes obvious that they have no oversight or direction on what they are doing out there. It's humans (as a collective species) ONLY ship. In TNG they get directives on where to go and what missions to do. Enterprise should be patrolling trade lanes (it's shown on the series that raids against trader vessels is a real problem and you would think star fleet would have a vested interest in protecting it). They have a database collected from the Vulcans, they should be combing through it and assigning Enterprise to contact known species that humans might be able to ally with or trade with. Towards the end of the season the admiral tells Archer he is \"doing good work out there\" but I have to disagree, he isn't doing anything. Maybe this type of aimless exploration would make sense if they had several ships but this is their only ship wandering around getting nothing done for the organization that funded and launched the ship. \nI'm still enjoying the series but this plot point urks me, I'm not going to lie.",
        "num_comments": 246,
        "comments": [
            "Enterprise is not their only ship. It is their first Warp 5 ship.  There are some other more primitive ships, and you see a few of them on the Season 2 season finale fighting off a Klingon Ship.",
            "The premise of most of Star Trek is exploring which ... Can look like wandering around aimlessly",
            "been a while since I saw it.\n\nbut basically: humans were a bit fed up by the vulcan babysitting. They just wanted to go out and see what the galaxy had to offer.\n\nWhy go to places that the vulcans already explored, when humans can do so as well with new places?\n\nDangerous, risky and potentially stupid? Sure. But so were basically all humans who explored new frontiers",
            "Because wandering aimlessly is exactly what exploring is all about. \n\n\"Not all who wander are lost\"",
            "T'Pol is their babysitter...or at least she's expected to be.",
            "It's not their only ship, it's their fastest ship.\n\nCivilian humans have been in space for at least a generation.\n\nHuman ships are garbage compared to almost every other space civilization at this time.",
            "To paraphrase a saying in motorcycling, \"Young riders choose a destination.  Older riders choose a *direction*.\"",
            "Ships are safe in the harbor,  but that's not what ships are made for.",
            "Release order is better imo. There's a few references in enterprise about things that happen in the future.\n\nAnd going from Enterprise to Discovery actually feels cool for some reason maybe because of some Archer references.",
            "As their first warp five ship, it makes sense to assign them to exploration. They're heavily armed to defend against the unknown, they can get out there and report back, faster than any other ship, and while they're out there they can deploy subspace transponders to bust Starfleet communication signals.\n\nStarfleet has other, slower ships they use for known routes. They are in contact with races other than the vulcans (phlox) but the whole point of Archer's mission is to wander around and find things the vulcans haven't. To seek out new life and new civilisations. To boldy go where no one has gone before."
        ]
    },
    "What your favourite Jeffrey Combs-character?": {
        "title": "What your favourite Jeffrey Combs-character?",
        "score": 112,
        "url": "https://www.reddit.com/r/startrek/comments/1dqxdhc/what_your_favourite_jeffrey_combscharacter/",
        "content": "There have been so many. Which one is your favourite? ",
        "num_comments": 168,
        "comments": [
            "Shran",
            "Brunt, FCA. \n\nHe was your typical bureaucratic a**hole. You screw with him, he’ll nail you to the floor if he wants to.",
            "Shran. It’s not even really close.",
            "He perfected his performance with Shran",
            "Shran.",
            "Weyoun",
            "While Enterprise is not my favorite show, it was usually very good whenever he appeared as Shran.",
            "AGIMUS",
            "Shran. Always Shran. All the time Shran. Shran. Shran. Shran. *Shran*.",
            "He’s actually the person behind the accounts for all of these answers, including this one."
        ]
    },
    "Appreciation for the \"Silly\" Trek Eps": {
        "title": "Appreciation for the \"Silly\" Trek Eps",
        "score": 26,
        "url": "https://www.reddit.com/r/startrek/comments/1dr3c7v/appreciation_for_the_silly_trek_eps/",
        "content": "I love myself a \"moral quandary\" episode or a \"new lifeform episode\", but sometimes I just crave a silly episode with Q or with the mirror universe. There are some days that I absolutely cannot stomach a Q episode, but other days, I need his fay ass to screw around with Captain Picard. And the mirror episodes (while not all being very good) were always entertaining to watch. \n\nDo other fans of Trek enjoy the silly episodes or find them hard to bear? ",
        "num_comments": 24,
        "comments": [
            "Honestly I couldn't stand mirror universe episodes for a while, but have come enjoy the silliness now I agree \n\nI've always enjoyed the fact that Star Trek traverses the entire human condition, from serious to silly and everywhere else, to me that what the Trek is all about",
            "Honestly I find most of the ‘worst’ episodes (Spock’s Brain, Threshold, etc) cross over into that wonderfully funny “so bad it’s good” zone. They’re very enjoyable in that way.\n\nBut the ones where they intentionally go for silly/fun? Bride of Chaotica, Trials and Tribble-ations, Qpid, etc? Oh those are just a ball to watch!",
            "I love the silly episodes, especially \"The Trouble With Tribbles.\" That one has A LOT of humor, particularly in terms of dialogue. \n\nBones: Do you know what you get if you feed a tribble too much? \n\nKirk: A fat tribble? \n\nBones: No. You get a whole bunch of hungry little tribbles. \n\nKirk: Well, Bones, all I can suggest is you open up a maternity ward.",
            "Rascals. One of the best silly episodes.",
            "Some of the best episodes and my personal favorites are the ones where Trek doesn't take itself too seriously.",
            "I like most of the silly episodes, but Mirror Mirror should have  been the first and last of that (I'm not counting stuff like Parallels from TNG season 7).",
            "https://youtu.be/VT4d7PIFFKM?si=zKJ4Rt1xPWsW8i2s",
            "I love the intentionally silly episodes! The Doctor singing the Pon Farr song cheers me up every time.",
            "I personally love a good breather episode, especially one following a dark/dramatic episode. I’ve always felt that you need the levity and humor to provide a cushion. Ferengi-centric episodes of DS9 come to mind.",
            "I also didn't care much for the mirror universe at first, but then I thought of it as something more fun than serious and it became more fun to watch those episodes. Sometimes it's okay to have a flair for the dramatic and the absurd. Life is certainly absurd sometimes! That's why I keep coming back to Trek. It's got everything I want."
        ]
    },
    "Alice Krige has one of the sexiest voices in Star Trek.": {
        "title": "Alice Krige has one of the sexiest voices in Star Trek.",
        "score": 22,
        "url": "https://www.reddit.com/r/startrek/comments/1dr0ek0/alice_krige_has_one_of_the_sexiest_voices_in_star/",
        "content": "Change my mind.",
        "num_comments": 8,
        "comments": [
            "she has a really calming voice. \n\njaneway's is my favourite, then sisko.",
            "Alice Krige is great. Loved her on Deadwood, too.",
            "What about Claire Rankin, \"Alice\" from VOY? I'd run away with that shuttle if I was in Tom's shoes! LoL",
            "Leonard Nimoy's **Spock**. \n\n*It's the only logical choice.*",
            "She narrated some audiobooks; perfect voice and accent for it.",
            "I love Alice Krige as the Borg Queen.\n\nBut amazingly... one the few Trek voices that was even sexier than Krige's was that of the [German actor who dubbed the Borg Queen in First Contact](https://www.youtube.com/watch?v=1TjSt40bk9M). She was great.",
            "Didn't she play the hallucinated personality of Alice too, i.e. the woman Tom sees?",
            "Why Civ IV is still the best"
        ]
    }
}