{
    "r/Starlink Availability, Questions & General Discussion": {
        "title": "r/Starlink Availability, Questions & General Discussion",
        "score": 179,
        "url": "https://www.reddit.com/r/Starlink/comments/tgffjv/rstarlink_availability_questions_general/",
        "content": "# [AVAILABILITY THREAD](https://www.reddit.com/r/Starlink/comments/q0136r/rstarlink_availability_thread/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n# [QUESTIONS THREAD](https://www.reddit.com/r/Starlink/comments/13p51ld/rstarlink_questions_thread_2023/?utm_source=share&utm_medium=web2x&context=3)\n\n# [Official Starlink Cell Map](https://www.reddit.com/r/Starlink/comments/tqchyl/official_starlink_cell_map/?utm_source=share&utm_medium=web2x&context=3)\n\n# [Guide: How to get a user flair next to your name!](https://www.reddit.com/r/Starlink/comments/u7brmp/announcement_introducing_new_user_flairs/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n# Scroll down for General Discussion in the comments!\n___\n[**Rant Thread**](https://www.reddit.com/r/Starlink/comments/r1fies/r_discussionrants/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n[**Important Subreddit Rule: No Soliciting**](https://www.reddit.com/r/Starlink/comments/rdtf68/new_rstarlink_rule_no_soliciting/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\n**For additional links and resources, please visit the “About” and “Menu” sections (if you’re using the Reddit App) or view the sidebar on the right side of your screen (if you’re on PC or tablet)!**",
        "num_comments": 2822,
        "comments": [
            "Where can I find a map showing availability by area?    I ordered over a year ago and still waiting.   Also a little irritated when I see people with other high speed isp options getting starlink before me and I'm stuck with 1.5Mbps dsl.  I digress....",
            "Anyone else frustrated that you are still stuck on mid 2022?",
            "Why is the SE USA just not getting any coverage? I'm a day 1 pre-orderer and I still haven't heard anything. Our status still says \"Mid 2022\" but that's highly doubtful.",
            "Ordered last year Feb 08/2021. Friend of mine 20 min away Ordered Feb 25th  he got his first. I'm still waiting. Infuriating.",
            "Just got our Starlink, booting was scary, but eventually it did it's thing, 4 hours in, and running like a champ, I've been traumatized by shoddy wireless service for the past five years, this whole, \"stable\" internet thing is like a wonderful dream, that I'm constantly waiting to end in catastrophe.   I am 100% happy with it so far and am super impressed.    I needed a place to say as much, thank you for reading :)",
            "I submitted my deposit in February 2021first it said Mid 2021, then late 2021, then mid 2022it still says mid 2022 and we are halfway through August. Feels like Ill never get away from <1-3mbps",
            "20% price hike in less than a year for an already expensive service. Pretty damn annoyed right now. I fully expected another increase but I figured they would stagger them out a bit more. They will push these prices as far as they think they can get away with.",
            "Should the \"New $500 Order\" flair be changed to reflect the new price?",
            "Was able to put in an order and said my starlink kit should ship within 2 weeks! Im geeked right now. Finally have some decent internet in the rural area where I live!",
            "ordered feb 10 or 11 2021 still waiting"
        ]
    },
    "A huge r/Starlink milestone: 200.000 members!": {
        "title": "A huge r/Starlink milestone: 200.000 members!",
        "score": 44,
        "url": "https://www.reddit.com/r/Starlink/comments/1d7yo7y/a_huge_rstarlink_milestone_200000_members/",
        "content": "# Wow, 200k! That’s a big number! Since our last milestone (150k) almost two years ago, Starlink has expanded across many additional countries around the globe and gained more than two million subscribers. [🚀](https://preview.redd.it/a-huge-r-starlink-milestone-200-000-members-v0-lpragenjuk4d1.jpg?width=2600&format=pjpg&auto=webp&s=2074a574ef0df644231ce1f5b78ecadcbf8ad4fc)\n\n**A (not so) brief chronology of** r/Starlink:\n\n* December 15, 2008: **The Subreddit is born.**\n* February 22, 2018: **The first Starlink test satellites, Tintin A & B, are launched.**\n* March 19, 2018: **1.000 members**\n* May 24, 2019: **The first full stack of 60 Starlink satellites is launched.**\n* May 29, 2019: **10.000 members**\n* October 27, 2020: **The first 'Better Than Nothing Beta' invites are sent out.**\n* November 1, 2020: **50.000 members**\n* November 21, 2020: **The Starlink team joins us for an awesome AMA session.**\n* April 16, 2021: **100.000 members**\n* June 30, 2021: **The Transporter-2 mission carries the first v1.5 satellites with laser links to space.**\n* September 14, 2021: **First dedicated launch from Vandenberg on the U.S. West Coast (Starlink 2-1).**\n* November 13, 2021: **The first Group 4 launch occurs after the completion of the initial shell.**\n* November 15, 2021: **125.000 members**\n* February 2, 2022: **Introduction of Starlink Premium (later renamed to Starlink Business).**\n* May 23, 2022: **Introduction of Starlink for RVs.**\n* July 7, 2022: **Introduction of Starlink Maritime.**\n* July 11, 2022: **First dedicated mission to polar orbit and 50th launch in total (Starlink 3-1).**\n* August 26, 2022: **Announcement of Starlink for mobile phones in collaboration with T-Mobile.**\n* September 14, 2022: **Starlink is now available on all seven continents, first official confirmation of fully operational laser links.**\n* September 15, 2022: **150.000 members**\n* February 27, 2023: **The first batch of 21 v2 mini satellites is launched, sporting bigger dimensions and higher performance.**\n* April 20, 2023: **The first integrated flight test of the Starship rocket occurs, paving the way for launches of future Starlink satellite generations with unmatched capabilities.**\n* November 17, 2023: **SpaceX unveils the newest Starlink Dishy generation, which does away with the integrated positioning motors.**\n* January 2, 2024: **The first six Starlink satellites with direct-to-cell hardware reach orbit.**\n* June 4, 2024: **200.000 members!**\n\nThank you for discussing, helping others, posting pictures and sharing unique experiences every single day! The future is looking incredibly bright for Starlink, and we are glad to have all of you along for the ride!\n\n*The* r/Starlink *Mod Team*\n\n[SpaceX launches the Starlink 6-52 mission with 23 v2 mini satellites on April 18, 2024. \\(Source: SpaceX\\)](https://preview.redd.it/lpragenjuk4d1.jpg?width=2600&format=pjpg&auto=webp&s=f2cd0ce2d43946e78a479f9502d61759838be8dd)",
        "num_comments": 3,
        "comments": [
            "201K  ",
            "It's impressive that the members list is 1/10th the total Starlink subscribers."
        ]
    },
    "Why is a cluster of flies attracted to this Starlink terminal?  (There's nothing dead on it, I checked!)": {
        "title": "Why is a cluster of flies attracted to this Starlink terminal?  (There's nothing dead on it, I checked!)",
        "score": 177,
        "url": "https://v.redd.it/dax9tvfhud9d1",
        "content": "",
        "num_comments": 60,
        "comments": [
            "When it rains then Starlink goes into heat mode to disperse the rain. Same with Snow. They are attracted to the heat.",
            "White colors can also attract flies and lady bugs.",
            "Drones recharging from the signal.",
            "Im sure its heat as everyone mentioned but I came to say I have a white pickup that it seems like they come from miles around just to hang out on, could be color aswell",
            "Can we talk about the resemblance to mechazilla of this setup?",
            "Because it's hot. Flies like things that are warm because things that are warm mean food. You're essentially gaslighting them.",
            "Get a pet lizzard, problem solved",
            "Maybe the satellite was transmitting the debate and flies love the smell of shit.",
            "It could be because its warm. Starkink produces heat when operating.",
            "Those are just lost tcp/ip packets from the 90's looking for a home!"
        ]
    },
    "Starlink mini on 12v direct connect": {
        "title": "Starlink mini on 12v direct connect",
        "score": 53,
        "url": "https://www.reddit.com/gallery/1dqw6nc",
        "content": "OK, just got my mini. I chopped the cable short and added Anderson power poles. It works amazing! Around 25 watts under load, idles at 12-15, just perfect. A winner in my opinion for true off grid and mobile usage",
        "num_comments": 18,
        "comments": [
            "That's just a little over 2 amps.  This is the setup I've been waiting for!",
            "So you cut the SL cable and have it connected directly to a 12v battery? I ask because using a DC barrel plug cable it does not want to work on a 12v battery bank for me. Maybe its the cable to battery combo",
            "Nice - would you mind showing what you added and linking the parts.   Trying to figure out the best way to connect SL mini to a larger Anker battery.   Thanks",
            "Will it work in Motion have you tried that yet. Ive heard mixed reports some say Starlink doesnt enforce the 10mph ban Starlink of course says it wont work in motion.",
            "I like this shit 4sho 4sho..",
            "Need more pictures of the cable splice you did.",
            "Two Amps at what V?",
            "I cut the cable at three feet and installed Anderson power poles. Then I used a decent Guage cable that was already Anderson and supplied directly from my battery. That cable is too thin for fifty feet",
            "If you use the supplied cable at 12V, the length is too long for the higher current (less volts means more amps for the same power), and there is too much loss in the cable.\n\nEither shorten the cable, supply your own, or run at a higher voltage like the supplied wall wort does.",
            "Literally just chopped the cable at three feet and stuck Anderson power poles on it, then plugged into my existing higher Guage power pole extension cord. Their cable is too thin for that length"
        ]
    },
    "Network Issues": {
        "title": "Network Issues",
        "score": 3,
        "url": "https://i.redd.it/3z0d0kpdei9d1.jpeg",
        "content": "Hi Guys,\n\nI've had Starlink now for two weeks but today is the first day it's been raining long enough during the day to test it out. \nToday is the most network Issues I have had. Is this rain related and something I can expect on a regular basis or is something else going on?\nThe dish has an all blue unobstructed view of the sky. \nAny help greatly appreciated thanks.",
        "num_comments": 5,
        "comments": [
            "I find if I never look at outages less than 2 seconds my life is good. The small ones will always show up as the nature of radio and high speed satellites will always produce small interruptions. Unless you notice severe service degradation, don't bother with the small interruptions",
            "Click on one of those network issues and you will see from the description that it is an issue between the satellite in space and the rest of the internet. Therefore nothing to do with your particular installation including rain or obstructions.",
            "Ignore anything <2 sec. You can't do anything about it.",
            "What you are seeing here is the normal operation of the service .... Just ignore ",
            "Thanks for the reply everyone. I tested it with some online gaming and had no interruptions what so ever. I just thought it might had been unusual as I hadn't seen it before when it wasn't raining heavy. I'll just keep enjoying Starlink so."
        ]
    }
}