{
    "The JOJOLands - Chapter 16": {
        "title": "The JOJOLands - Chapter 16",
        "score": 891,
        "url": "https://www.reddit.com/r/StardustCrusaders/comments/1distwg/the_jojolands_chapter_16/",
        "content": "The JOJOLands is the ninth part of JoJo's Bizarre Adventure.\n\nChapter 16 is now out officially in Japan. Discuss the chapter here.\n\n* [Mangadex](https://mangadex.org/chapter/494bad68-08ab-4e22-be3d-e15707768e8b) ([Hi Wa Mata Noboru](https://hiwamatanoboru.com/))",
        "num_comments": 418,
        "comments": [
            "\"The unending pursuit begins\"\n\nJoJolion is so fucking back, baby",
            "Seems like Jodio mixing up three letter acronyms wasn't just a one off joke when he was talking about music with Charmingman",
            "I like the part where Jodio explains what the fuck an mri is",
            "Oh my god that last scene is incredible. They effectively got her killed as a mechanism to bring the land to them. I'm glad we are already setting up that using the rock means potential sacrifices being made, and that the gang will be willing to accept progressively worse consequenses to achieve it. This is the best chapter in a while.",
            "The Jodio pose on the cover page is insane. It's like he broke all of his limbs",
            "When they first showed the land registry woman in the hospital I thought it was Holly for a second lol",
            "Smooth operators shrunk to fit in Dragona's windpipe!! Stand shrinking is back!!!1!",
            "Jodio yelling \"There's a sequence Dragona!\" while Dragona is on the floor dying is so funny",
            "I’m really enjoying the pacing here. Jojo is usually infamous for taking its time to introduce new characters. \n\nBut Araki just dropped an entire folder of them on our asses.",
            "I gotta say, November Rain's precision is insane. \n\nAlso really liking the design of the new villains. I like how Araki subverts the expectation by making us think the hat-wearing guy was the stand user, when it was in fact the girl."
        ]
    },
    "Petition to get shocked Josuke as a community emoji": {
        "title": "Petition to get shocked Josuke as a community emoji",
        "score": 217,
        "url": "https://i.redd.it/igxxejdy9g9d1.jpeg",
        "content": "",
        "num_comments": 19,
        "comments": [
            "When did he make this face? 😂",
            "Lol this is my steam pfp",
            "What about the janken boy???",
            "YES YES YES YES!\n#YES",
            "Bro is straight up flabbergasted",
            "YES YES YES\n\nYES !",
            "Peak also reminds me of Robbie Rotten. (Don't ask why)",
            "you are right. tomoko is hot",
            "During the rat incident, they had to cross some sort of small lake, and he had to take off his expensive shoes and socks, but then he dropped them into the lake, and this was his reaction. He also breaks the 4th wall and says: \"Since when did I become the comic relief character?\".",
            "best jojo mom no debate"
        ]
    },
    "Who is the best character in Part 4: Diamond is Unbreakable?": {
        "title": "Who is the best character in Part 4: Diamond is Unbreakable?",
        "score": 169,
        "url": "https://i.redd.it/gtx755wjhg9d1.png",
        "content": "",
        "num_comments": 103,
        "comments": [
            "That dude that got a boner over the Mona Lisa",
            "Dont talk about his hair",
            "Our goofy okuyasu, can't have part 4 without our Okuyasu",
            "My name is Kira Yoshikage. I'm 33 years old. My house is in the northeast section of Morioh, where all the villas are, and I am not married. I work as an employee for the Kame Yu department stores, and I get home every day by 8 PM at the latest. I don't smoke, but I occasionally drink. I'm in bed by 11 PM, and make sure I get eight hours of sleep, no matter what. After having a glass of warm milk and doing about twenty minutes of stretches before going to bed, I usually have no problems sleeping until morning. Just like a baby, I wake up without any fatigue or stress in the morning. I was told there were no issues at my last check-up. I'm trying to explain that I'm a person who wishes to live a very quiet life. I take care not to trouble myself with any enemies, like winning and losing, that would cause me to lose sleep at night. That is how I deal with society, and I know that is what brings me happiness. Although, if I were to fight I wouldn't lose to anyone.",
            "rohan is absolutely amazing but this gotta go to kira",
            "His name is Yoshikage Kira, he's 33 years old and he's the best villain to ever grace this series",
            "NGL speedwagon belonged in overrated 1000000%",
            "Watashi no na wa “kirayoshikage” nenrei 33-sai jitaku wa moriōchō hokutō-bu no bessō chitai ni ari… kekkon wa shite inai… shigoto wa “kameyūchēn-ten” no kaishain de mainichi osokutomo yoru 8-ji made ni wa kitaku suru tabako wa suwanai sake wa tashinamu teido yoru 11 tokiniha yuka ni tsuki kanarazu 8-jikan wa suimin o toru yō ni shite iru… nerumae ni atatakai miruku o nomi 20-bu hodo no sutoretchi de karada o hogushite kara yuka ni tsuku to hotondo asamade jukusui-sa… akanbō no yō ni hirō ya sutoresu o nokosazu ni asa-me o samaseru nda… kenkōshinda demo ijō nashi to iwa reta yo\n\nNo need to explain that... hands down",
            "It has to be Rohan for sure",
            "I understand why people are saying Kira and Rohan, but I'm fine with my Koichi"
        ]
    },
    "My current Joestars tierlist (might change in the future)": {
        "title": "My current Joestars tierlist (might change in the future)",
        "score": 81,
        "url": "https://i.redd.it/ta7xkfqpgh9d1.png",
        "content": "",
        "num_comments": 45,
        "comments": [
            "Jonathan once again is at the bottom ![img](emote|t5_2tny5|49674)",
            "Gappy is too low but I forgive you because of Johnny and Jolyne’s placement ",
            "Also I want to say, that I love every JoJo, but some are better than the others imo",
            "my man this is not a tierlist it's an order ranking",
            "Me seeing my pookie Jonathan at the bottom hurts me.",
            "These guys are definitely on my top 9 JoJo protagonist list.",
            "Personally, I would change Jotaro and Joseph, and Gappy should be above Jotaro as well. But otherwise pretty good list.",
            "That's not a tier list that's just a ranking",
            "How does it feel to be straight up wrong?",
            "Dawg this is just a ranking not a tier list"
        ]
    },
    "Which stand do you personally feel like was underused": {
        "title": "Which stand do you personally feel like was underused",
        "score": 116,
        "url": "https://i.redd.it/uzfmro2hog9d1.png",
        "content": "",
        "num_comments": 48,
        "comments": [
            "Off topic but this photo with his hand going through the gun is so cool to me I don’t know why",
            "Hermit Purple. Let me see what that Stand is capable of in the hands of a powerful Hamon User who’s more practiced than Post-Battle Tendency Joseph. I wanna know about the ways it could develop in the hands of different Hamon Users, how innovative you could get with it. I don’t think we got to see it being used to its fullest potential with Parts 3 + 4 Joseph which is a shame because it’s a versatile Stand that leaves a lot of room for resourcefulness and creativity.",
            "I love Moody Blues but its used like three times D:",
            "Id say Purple Haze as we never got to see it much",
            "Hermit purple. At the very end he Spider-Man’s around the place and I guess just never thought about using hermit purple to grab things from far away",
            "there are SO many characters to list, but i gotta say Purple Haze",
            "Doggystyle for sure didn't have enough page time",
            "Spice Girl. Trish had no focus outside of the Notorious B.I.G. fight. It also has a really versatile power that could have had a lot of cool applications.",
            "Not a stand but hamon. Like after part 2 araki just sorta forgot it existed. Why joseph did not teach it to avdol even is beyond me",
            "Magician’s red and I’m tired of pretending it wasn’t."
        ]
    }
}