{
    "Spoilers warnings required for Bad Batch ended. As a reminder Acolyte premieres June 4 and all associated posts will require spoiler warning until 14 days after series conclusion.": {
        "title": "Spoilers warnings required for Bad Batch ended. As a reminder Acolyte premieres June 4 and all associated posts will require spoiler warning until 14 days after series conclusion.",
        "score": 11,
        "url": "https://www.reddit.com/r/starwarsmemes/comments/1d1uhxd/spoilers_warnings_required_for_bad_batch_ended_as/",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Starfortress sucks and I refuse to say the opposite": {
        "title": "Starfortress sucks and I refuse to say the opposite",
        "score": 1603,
        "url": "https://i.redd.it/cerv637pif9d1.jpeg",
        "content": "",
        "num_comments": 236,
        "comments": [
            "Except that B-17's actually had a high enough airspeed to avoid at least a few hits.",
            "They had bombers, they're called Y-wings.",
            "Lets just make sure we all cluster together so that we can all crash into each other",
            "It's funny how like a third of them or so got wiped out by a single tie fighter",
            "Weren't they supposed to be mining ships that the rebellion co-opted into being half-assed bombers?",
            "But why are we dropping bombs in space. They work because of gravity.",
            "Y-wings are the B52s of star wars. They were used in 3 major conflicts between the space of 50 plus years",
            "Theyre so damn slow, their supposed firepower equivalent of how many squadrons of Y-wing dont make up for it like at all. It also felt like the only way for them to be effective is if theyre up against a single frigate or if the enemy's cruiser/frigate/whatever have shit defenses and blind gunners.",
            "Dont lose the remote control for releasing the bombs",
            "So dumb. Such a useless bit."
        ]
    },
    "Palpatine is a genius": {
        "title": "Palpatine is a genius",
        "score": 340,
        "url": "https://i.redd.it/m18f2vggnf9d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "I am pretty sure that the Clone was his backup plan.",
            "I mean TBF it probably should have worked. How could he plan for Luke motherfuckin lavawalkin Skywalker?",
            "You're saying that like a 23 year reign is short.",
            "The problem with Sith is that they are inherently self destructive. \n\nOne relatively savvy one will gain power, only to then have an apprentice try to undermine them, one who does not have the political savvy, and whose blatant evil will turn the non-force using troops against himself.",
            "when tf did palpatine reign for 7 years....",
            "He was chancellor for like the 10 years between phantom and revenge (emergency powers granted for 2-3 years or clone wars), and then 19 years between revenge and new hope (lukeleia are 19 years old)",
            "How many years last the New Republic?",
            "![gif](giphy|o39frNEZwNAIhDQhII|downsized)\n\nHe only reigned for 23 years!",
            "His goal was to reign _forever_. 23 years is short compared to that.",
            "The events of the entire ST take place over a year and a week.\n\nSnoke came to power in TFA, and died in TLJ, both movies taking place over the span of a single week.\n\nIn the following year, Kylo REN was the Supreme Leader.\n\nPalpatine exposed himself and his plan, and then was destroyed hours later.\n\nWhere do you get the Reign for 7 years comment?"
        ]
    },
    "What do you think the entrance music of the other council members is?": {
        "title": "What do you think the entrance music of the other council members is?",
        "score": 413,
        "url": "https://i.redd.it/fxn8lagcfe9d1.jpeg",
        "content": "",
        "num_comments": 18,
        "comments": [
            "I feel like Windu has gotta be something from either DMX or Tech 9",
            "Plo Koon: Damn it feels good to be a gangster.",
            "Joking aside the line exit light, enter night is a good way to describe his fall to the Dark side.",
            "Oh my, my this here Anakin guy,\nMaybe Vader someday later, now he's just a small fry",
            "Yoda has his Lego death noise",
            "That had to be the coldest shit Mace had ever done.   Everyone knows,  bro hates sand.  It gets everywhere.",
            "Tbf thats hard. sleep with one eye ooopeeen",
            "Yaddle has *Wuthering Heights* by Kate Bush",
            "When Vader walks in to reminisce. \n\n(Subtle Imperial March)",
            "Remember - Disturbed  for Ki-Adi"
        ]
    },
    "If Anakin was a tad smarter": {
        "title": "If Anakin was a tad smarter",
        "score": 541,
        "url": "https://i.redd.it/2exy38stid9d1.jpeg",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Are you threatening me, master Jedi...wait, you're not a master",
            "\"Chancellor, I'll let you go if you agree to listen to my 2 hour thesis on Darth Plaguis the wise and Dichotomy\"",
            "Or not so hypnotised by pussy. Fair cop though, it is Natalie Portman",
            "They didn't upgrade his card to Mastercard yet haha. What a loser.",
            "\"Please, take me to prison.\"",
            "Hello there. Are u a sith?\n\nHere I have this lie detector would u wanna try it?\n\nIt gives u like a shock when it detects u lying.",
            "Exceeded all my expectations"
        ]
    }
}