{
    "Share your startup - quarterly post": {
        "title": "Share your startup - quarterly post",
        "score": 102,
        "url": "https://www.reddit.com/r/startups/comments/1c1k7f1/share_your_startup_quarterly_post/",
        "content": "Share Your Startup - Q4 2023\n\n[**r/startups**](https://www.reddit.com/r/startups/) **wants to hear what you're working on!**\n\nTell us about your startup in a comment within this submission. Follow this template:\n=====================================================================================\n\n​\n\n*   **Startup Name / URL**\n*   **Location of Your Headquarters**\n    *   Let people know where you are based for possible local networking with you and to share local resources with you\n*   **Elevator Pitch/Explainer Video**\n*   **More details:**\n    *   What life cycle stage is your startup at? (reference the stages below)\n    *   Your role?\n*   **What goals are you trying to reach this month?**\n    *   How could [r/startups](https://www.reddit.com/r/startups/) help?\n    *   Do **NOT** solicit funds publicly--this may be illegal for you to do so\n*   **Discount for** [r/startups](/r/startups) **subscribers?**\n    *   Share how our community can get a discount\n\n​\n\n\n\\--------------------------------------------------\n\n​\n\n**Startup Life Cycle Stages** (Max Marmer life cycle model for startups as used by Startup Genome and Kauffman Foundation)\n\n**Discovery**\n\n*   Researching the market, the competitors, and the potential users\n*   Designing the first iteration of the user experience\n*   Working towards problem/solution fit (Market Validation)\n*   Building MVP\n\n​\n\n**Validation**\n\n*   Achieved problem/solution fit (Market Validation)\n*   MVP launched\n*   Conducting Product Validation\n*   Revising/refining user experience based on results of Product Validation tests\n*   Refining Product through new Versions (Ver.1+)\n*   Working towards product/market fit\n\n​\n\n**Efficiency**\n\n*   Achieved product/market fit\n*   Preparing to begin the scaling process\n*   Optimizing the user experience to handle aggressive user growth at scale\n*   Optimizing the performance of the product to handle aggressive user growth at scale\n*   Optimizing the operational workflows and systems in preparation for scaling\n*   Conducting validation tests of scaling strategies\n\n​\n\n**Scaling**\n\n*   Achieved validation of scaling strategies\n*   Achieved an acceptable level of optimization of the operational systems\n*   Actively pushing forward with aggressive growth\n*   Conducting validation tests to achieve a repeatable sales process at scale\n\n​\n\n**Profit Maximization**\n\n*   Successfully scaled the business and can now be considered an established company\n*   Expanding production and operations in order to increase revenue\n*   Optimizing systems to maximize profits\n\n​\n\n**Renewal**\n\n*   Has achieved near-peak profits\n*   Has achieved near-peak optimization of systems\n*   Actively seeking to reinvent the company and core products to stay innovative\n*   Actively seeking to acquire other companies and technologies to expand market share and relevancy\n*   Actively exploring horizontal and vertical expansion to increase prevent the decline of the company",
        "num_comments": 784,
        "comments": [
            "[removed]",
            "* **Startup Name / URL**: [npm.watch](http://npm.watch)\n* **Location of Your Headquarters**: USA\n* **Elevator Pitch**: Keeping your npm packages up-to-date is crucial but often a hassle. Our new tool automates this process by analyzing your `package.json` file and generating detailed reports on which packages need updating and why. Save time, enhance security, and ensure compatibility with effortless updates. Stay focused on what matters most—building great software—while we handle the dependency management for you. Try it now and simplify your development workflow!\n\n* **More details:**\n   * What life cycle stage is your startup at?: We are at the Validation stage. This week we went live with the product.\n   * Your role?: I am Co-founder \n* **What goals are you trying to reach this month?**: Trying to get our first users to start using the platform. \n* **Discount for** [](https://www.reddit.com/r/startups) **subscribers?**: Right now it is completely free.",
            "**Startup Name / URL**: Caseguru / [https://www.caseguru.app/](https://www.caseguru.app/)\n\n\n\n**Location of Your Headquarters**: Glasgow, UK\n\n\n\n**Elevator Pitch**: Think of Caseguru as the eBay for legal cases—there's nothing else like it for legal services.\n\nFor individuals, our AI takes the hassle out of legal cases. Start with just an idea, and our AI will craft a precise, legally formulated case summary for you—no need to explain your case multiple times. Then, watch top lawyers compete for your case, ensuring you get both quality and affordability. Plus, manage everything from one dashboard—communicate with your lawyer, track tasks, and handle payments seamlessly.\n\nFor lawyers, Caseguru is a game-changer. Get more business with pre-qualified cases that match your specialty and preferences. Let our AI handle the initial discovery, making your case selection process smoother and faster. Connect directly with clients, submit bids, and manage cases all from one integrated platform. It's a streamlined way to grow your practice without the overheads.\n\nNo other platform offers this kind of comprehensive, AI-powered solution for legal services. Join us and experience the future of legal case management.\n\n\n\n**What life cycle stage is your startup at**? We're are launching the MVO 2.0 in June (with quite a few lawyers in line)\n\n\n\n**Your role**? Cofounder/CEO\n\n\n\n**What goals are you trying to reach this month?** We aim to increase awareness and understanding among both lawyers and individuals about how groundbreaking our platform is. We're also **focused on getting more people to join the waitlist and sign up when we launch in the first day of June. Also looking for feedback form potentials users and lawyers!**\n\n\n\nHow could r/startups help? Share our platform with anyone in need of legal assistance or any lawyers looking to expand their practice in the UK for now(but we consider launching in US and Canada as well, so feedback from those places is much appreciated). We also welcome feedback on our platform's features and usability to better serve our users.\n\n\n\n**Happy to answer any other questions!**",
            "[removed]",
            "[removed]",
            "\n\n* **AirScale** [**airscale.ai**](http://airscale.ai)\n* **Location of Your Headquarters** - Delhi, India\n* **Elevator Pitch/Explainer Video -** Scale chatgpt prompts on your data in an excel-like interface. Create prompt templates and rerun them again and again on your data just like you create and use excel reports. No technical know how needed. Here a quick launch video - [https://www.youtube.com/watch?v=C8WoI63orUs](https://www.youtube.com/watch?v=C8WoI63orUs) \n* **More details:**  I am the founder of the company. Currently we are in beta and looking for PMF. Currently our product is horizontal but we are exploring it's fit for Marketing teams and building all integrations around that.\n* **What goals are you trying to reach this month?** We are trying to get as much constructive feedback from marketers as possible. We are also open to people from other fields trying out the product as well. r/startups can help us reachout to all these experienced folks and get quick and honest feedback\n* **Discount for** [r/startups](https://www.reddit.com/r/startups) **subscribers?** The product will be free for all r/startups users. You will get free access to GPT4, Mistral, Whisper and Web Scraping\n* Reach out to me in DMs to get the Free Access today!",
            "**Startup Name / URL:** Coincide  \n**Location of Your Headquarters:** Florida  \n**Elevator Pitch:** Coincide is a calendar-based tool designed to help you spend more time doing what you love. It simplifies coordination and ideal slot selection based on external data (place availability/weather).  Spending more time doing what you love reduces stress/anxiety or burnout.   \n**What life cycle stage is your startup at?** We're in the discovery phase. MVP is being built and we have people signing up.  \n**Your role?** Cofounder  \n**What goals are you trying to reach this month?** Users feedback.  \n**How could** [](https://www.reddit.com/r/startups/) **help?** Share it with someone who you think may need it. Any feedback is great at this stage.\n\nHappy to answer any other questions!",
            "[deleted]",
            "* **Startup Name / URL - Our Space /** [**https://inourspace.net/**](https://inourspace.net/)\n* **Location of Your Headquarters**\n   * Armenia/ Yerevan\n* **Elevator Pitch/Explainer Video** [**https://www.youtube.com/watch?v=O8i5iwP2Mcg&ab\\_channel=OurSpace**](https://www.youtube.com/watch?v=O8i5iwP2Mcg&ab_channel=OurSpace)\n* **More details:**\n   * Product in the Play store and we have to work on marketing\n   * Your role? CEO\n* **What goals are you trying to reach this month?**\n   * How could [](https://www.reddit.com/r/startups/) help?  How to correctly promote the app\n   * Do **NOT** solicit funds publicly--this may be illegal for you to do so\n* **Discount for** [](https://www.reddit.com/r/startups) **subscribers?**\n   * Share how our community can get a discount",
            "[removed]"
        ]
    },
    "Feedback Friday": {
        "title": "Feedback Friday",
        "score": 5,
        "url": "https://www.reddit.com/r/startups/comments/1dqbod6/feedback_friday/",
        "content": "Welcome to this week’s Feedback Thread!\n\n# Please use this thread appropriately to gather feedback:\n\n* Feel free to request general feedback or specific feedback in a certain area like user experience, usability, design, landing page(s), or code review\n* You may share surveys\n* You may make an additional request for beta testers\n* Promo codes and affiliates links are ONLY allowed if they are for your product in an effort to incentivize people to give you feedback\n* Please refrain from just posting a link\n* Give OTHERS FEEDBACK and ASK THEM TO RETURN THE FAVOR if you are seeking feedback\n* **You must use the template below**\\--this context will improve the quality of feedback you receive\n\n&#x200B;\n\n# \n\n# Template to Follow for Seeking Feedback:\n\n* Company Name:\n* URL:\n* Purpose of Startup and Product:\n* Technologies Used:\n* Feedback Requested:\n* Seeking Beta-Testers: \\[yes/no\\] (this is optional)\n* Additional Comments:\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n# This thread is NOT for:\n\n* General promotion--YOU MUST use the template and be seeking feedback\n* What all the other recurring threads are for\n* Being a jerk\n\n&#x200B;\n\n&#x200B;\n\n# Community Reminders\n\n* Be kind\n* Be constructive if you share feedback/criticism\n* Follow all of our rules\n* You can view all of our recurring themed threads by using our Menu at the top of the sub.\n\n#   Upvote This For Maximum Visibility!",
        "num_comments": 8,
        "comments": [
            "*Company name* \n\nStakeweb\n\n*URL*\n\nhttps://stakeweb.com/ (mvp 0.5, fully launching in July) \n\n*Purpose of Startup and product*\n\nHey all! I'm working with a guy who's building a product (Stakeweb) that's all about monetising domains you don’t use and are renewing every year (face palm). Right now we're trying to learn all we can about people's problems and the best solutions currently out there.\n\n*Feedback requested*\n\nHas anyone here ever tried to monetize their unused domains in some way - and if so, how did it go? Has anyone got a backlog of domains they do nothing with, and what pains / confusion do you feel about this? Have you tried to monetise them, and why / why not?\n\nAnd here is a live example of someone who has registered a domain on Stakeweb - https://getricheventually.com/\n\n*Seeking beta testers* \n\nyes! You can sign up for free now. Just bear in mind not all features are live. \n\n*Additional comments*\n\nIt’s due to launch officially in July with monetisation features. We’re collecting feedback and marketing it, so it has the right offerings and lands with a bang on launch. Any feedback is much appreciated!",
            "**Company name:** Passwd\n\n**URL:** [https://passwd.team/en/](https://passwd.team/en/)  \n  \n**Purpose of startup and product:** A self-hosted team password manager tool built specifically for businesses on Google Workspace. Only the businesses have access to their data, no third party.\n\n**Technologies used:** Google Cloud, Google Key Management Service, Google Workspace\n\n**Feedback requested:** Expanding is very challenging, with our primary problem being converting leads into customers. We're feeling a bit stuck with progress moving forward slowly and our advertising efforts not quite hitting the mark as we hoped. Even after hiring Google Ads professionals. Most customers stay with us even after their trial runs out and are satisfied. But advertising is hard due to specific audience. (Google Workspace businesses)\n\n**Additional comments:** I believe this startup has a potential in its architecture and privacy along with the benefit of being Google Workspace integrated, but not sure what channels could help it grow more.\n\nI would love to hear your feedback. Thank you.",
            "**Company name:** Chapter  \n  \n**Url**: [https://chapter.show/](https://chapter.show/)  \n  \n**Purpose:** Give technical founders high quality leads based on niche information like hiring activity and tool stack. \n\n**Technologies used**: Python, Typescript, APIs, Scraping, LLMs\n\n**Feedback:** Is outbound sales something you're struggling with? What tools/processes have you used and how happy were you with those solutions for your specific use-case?\n\n**Seeking beta testers:** Yes. We have a form on the landing-page (url above) where we give you three leads for free. For us, it's great to learn more about your search queries, for you hopefully a good lead.",
            "Looking forward to trying out your product and providing feedback!",
            "**Company name:** fokusly\n\n**URL:** [fokusly.com](http://fokusly.com) \n\n**Purpose of startup and product:** fokusly is the only true multi-profile social networking platform where you can showcase your various personas side by side in a single powerful display. Each profile has its own privacy level, different content and different sets of followers. We bring you the concept of Social Portfolios. Powerful personal branding, local talent discovery, naturally relevant content (not dictated by algorithms) are some of the key features. We allow you to follow just what you are interested in another user and not everything that user shares. \n\n**Technologies used:** Node, React, AWS Cloud, Server-less Architecture, DynamoDB, OpenSearch, Lambda, API Gateway, S3, CloudFront, CloudWatch, SQS, SNS, SES, IAM, KMS, Amplify Framework, and so on. Built to scale for any number of users, using distributed, highly scalable architecture and design patterns. \n\n**Feedback requested:** We have a pretty good MVP that you could sign in to using Google authentication. Could you please sign in and provide feedback to let us know if you will be a user, if so why, what you like and do not like, what more you like to see, if you would consider being a paid user to use the advanced privacy options (invite-only, hidden profiles), more than 5 profiles on your portfolio, get advanced analytics etc. Any feedback is good feedback and you cannot hurt my feelings. I would love you to be brutally honest if that's what it takes for me to get the message.\n\nI would love to see some feedback specifically on the signed out / Guest user experience. Is it confusing as I am showing a fictitious user and her profiles in the guest mode for illustrative purpose? Any ways to improve the UX  for guest mode and beyond? \n\n**Feedback requested:** yes, please sign in using Google auth and get your preferred username. No separate sign up required. We provision a user account for you on your first sign in.",
            "If you have good retention, can you build on top of that? Retention is usually the hardest thing. Ideas: figure out how to grow horizontally within orgs, referrals to similar clients, building a great experience for your existing users. \n\n  \nWhat was the main problem use/case your existing customer had to try you, and figure out how to message that as social proof."
        ]
    },
    "People keep telling me to hire and not have a technical cofounder. What do I do?\n": {
        "title": "People keep telling me to hire and not have a technical cofounder. What do I do?\n",
        "score": 32,
        "url": "https://www.reddit.com/r/startups/comments/1dqtb9q/people_keep_telling_me_to_hire_and_not_have_a/",
        "content": "I have a MVP built. Got some users to engage with the MVP, received some suggestions/feedback. I built it using no code tools and want to stick to this route. I designed and built the MVP but hired someone just to do the logic side. now I want to start iterating the product and brainstorm with someone to make it better before I actually start making some sales.\n\n",
        "num_comments": 54,
        "comments": [
            "If you identify as a tech startup you should absolutely have a technical cofounder. Even if it is a tech enabled company, I would absolutely have one because it will allow you to move a lot faster which is super important for a startup",
            "As someone from the dev side, it's impossible for you to make some decisions if you aren't tech savvy yourself and working in the tech space.\n\nStay away from dev shops especially from people claiming they will create your product in one month, even if you think your MVP provides great value you still should be talking to someone that has a realistic idea of the technical side.",
            "It all depends on the size and scope of your product and company. \n\nLooks like you're in early stages with an MVP. Its just the first step, take it to some real customers and see is it a good fit for the market, If you find traction and need to grow, go for the technical cofounder. \n\nYou may not need in the very early stages!\n\nFeel free to Chat if need additional suggestions.",
            "A top-notch technical co-founder won't waste their time on your company unless you can show them a solid business plan and revenue model that's got real potential. They're not looking for a joyride; they want to see a clear path to success. So, if you want to attract someone who's serious about building a business, you need to get serious about it yourself. Prove that your idea has legs by putting in the work to develop a robust plan and model. Only then will you be taken seriously by the kind of technical co-founder who can help you achieve your vision.\n\nAnd even then, there's no guarantee. Not every person will be willing to take the risk, no matter how solid your plan is. And if you can't quantify the level of risk somehow, it's even harder to convince someone to join you. You need to be able to have a clear-eyed conversation about what could go wrong, and what the potential upside is.",
            "100% depends what you built in my opinion. A technical cofounder isn't a black box of where code comes from. It's a 1+1 = 3 scenario.",
            "Depends on the domain you are in. If your startup is tech-enabled (lets say like AirBnB) then it is better to hire. But if your startup depends a lot more on Tech, it is better to find a Tech founder.",
            "A co-founder is like a girlfriend/ boyfriend you can't break up with.  Even if you love them in the beginning, you might eventually decide you hate them. It is 100% worth it to hire someone if you can.  Alternately, make sure that your agreement with your co-founder is one which is fair for all, including requiring their departure for abandonment or poor performance.",
            "It’s like saying not to wipe you ass after shitting",
            "I would love to help. \n\nI have created 2 companies as a technical founder.  DM me and I can offer advice or support",
            "Any one who has ever tried to raise money for any startup will know that it is not just about an idea. It is also about a team.\n\nIf you want a successful tech startup your chance of success will increase a lot by having a tech cofounder who believes in your product, knows how to scale and knows how to translate business requirements to technical requirements.\n\nIt also depends on how much you believe in your idea. If you are in it for the long haul you need to start building a team you can trust and you need to do it as quickly as you can."
        ]
    },
    "Cofounder at 50% not contributing just paying 50% of bills. What to do": {
        "title": "Cofounder at 50% not contributing just paying 50% of bills. What to do",
        "score": 10,
        "url": "https://www.reddit.com/r/startups/comments/1dqyigm/cofounder_at_50_not_contributing_just_paying_50/",
        "content": "Esteemed colleagues,\n\nI am writing to bring to your attention a matter of concern regarding the equity distribution within our joint venture. As the primary contributor to the development of our mobile application, I believe it is necessary to reassess the current split of the company.\n\nInitially, I approached a colleague with a technical background, assuming that their expertise would complement my own and facilitate the app's construction.I also  possess a background in technology and have been managing the project in other areas (marketing, software assessments and coordination)  and my colleague has not actively participated in the coding process. Their involvement has been limited to attending weekly checkpoints and contributing 50% towards operational expenses, such as cloud services, email accounts, and software licenses.\n\nDespite my colleague's lack of direct involvement in the app's development, I have diligently dedicated my time and effort to bring the project to fruition. During my recent period of unemployment, prior to commencing my new corporate role, I devoted 24 hours a day to the app's development. In contrast, my colleague has been preoccupied with their regular job and has not demonstrated a significant level of commitment to the project.\n\nRecently, we encountered a critical issue with our cloud provider that required immediate attention. I spent three days diligently working to resolve the problem, yet my colleague did not participate in any troubleshooting sessions or offer assistance.\n\nIn light of these circumstances, I propose a revision to our equity distribution. I believe that a fair and equitable split would be 75% for myself, reflecting my substantial contributions in both technology and financial investments, and 25% for my colleague, acknowledging their financial contributions.\n\nIt is important to note that we have not yet incorporated the company, and all agreements thus far have been verbal. I kindly request your guidance and wisdom in navigating this delicate situation.\n",
        "num_comments": 12,
        "comments": [
            "If nothing is signed, look for another co-founder. If you’re having these sort of committment issues now in the beginning, think about whether this is someone you really want to go into the trenches with.",
            "OP just a small advice you can use your own words and sentences instead of using AI for writing posts. I personally feel that if it lacks human touch I can’t resonate much. Again i might be wrong but its just what i feel.",
            "Founders agreement is a MUST. And topics covered should be - what if one person slacks? What do we do?\n\nAnd of course 4 yr vesting with 1 yr cliff for everyone in company including founders.",
            "Look, when you're working with someone, you need to have a clear understanding of what's expected of each other. That's why you need a solid agreement in place. It's not about micromanaging every little thing, but about having a framework for making decisions and resolving disputes. If you don't have one, get a lawyer who knows what they're doing to draw up a contract that covers the basics. Trust me, it's worth the investment.",
            "Then this might be the best time to reconsider. Whether your designated Co-Founder actually has what it takes to be a co-founder or just an employee reporting at scrum.\n\nFor a co-founder, commitment to regular work, showing up, keeping posted is secondary. Their main role and responsibility is to lay the foundations, stepping up, initiating decisions and actions, taking the ownership. \n\nI myself have been delaying my decision to go fulltime because I don’t think I can rely on my counterparts. I know that the plan needs a team, and I can’t do it alone. But at the same time, I can’t go all in and risk everything I have if my “entitled” co-founders are chilling out with their regular work and not doing sh₹t here, right? \n\nI would suggest, hire freelancers or interns if you can. Build a relationship with those who have the drive and you can trust. And sac your co-founder asap.\n\nCheers :)",
            "85 -90% for you. 10 - 15 % for him. Talk with him. Either he agrees or he quits. You refund him the money in installments and get 100% ownership",
            "If anyone is reading this and is a full stack dev and looking for a venture to join please contact me. I can guarantee this is worth your time and that you’re going to be amazed at my concept. I’ll give you a hint it has to do in part with this post and giving people a better way to integrate resources (including but not limited to cofounders) into their ventures. It’s called Hoook.",
            "My dear esteemed colleague,\n\nI hope this missive finds you in good health and spirits. I have given your predicament much consideration and feel compelled to offer my counsel on this most delicate matter.\n\nIt is with the utmost gravity that I must express my concerns regarding the oversight in establishing clear expectations at the commencement of your venture. Such an omission, particularly in matters of equity, can indeed lead to grievous consequences.\n\nThe reduction in equity percentage, as you have astutely observed, may serve to diminish the enthusiasm and dedication of your esteemed co-founder. This turn of events could prove detrimental to the future prosperity of your shared enterprise.\n\nAfter careful deliberation, I humbly submit for your consideration the notion of procuring your co-founder's stake in its entirety. Such an action, while bold, may prove judicious in preserving the integrity and momentum of your venture.\n\nI implore you to weigh this counsel with the gravity it deserves, for the decisions made in these formative stages shall undoubtedly shape the destiny of your endeavor.\n\nI remain, sir, your most humble and obedient servant\nu/kiwialec",
            "Maybe it's not too late to have an agreement, like a formal one? But if you don't think things will work out, just find another co-founder. Building a startup is already stressful, you want to be at least okay with the team.",
            "Agreed, better to break now than in the future. The other thing to always do when you bring in a partner is get their equity to vest rather than upfront."
        ]
    },
    "Preference between a 5 vs 50 person startup?": {
        "title": "Preference between a 5 vs 50 person startup?",
        "score": 2,
        "url": "https://www.reddit.com/r/startups/comments/1dr4p87/preference_between_a_5_vs_50_person_startup/",
        "content": "What is your role and what stage startup do you prefer and why?\n\nCurrently i’m at a series b company with about 60-70 people but Im ready to quit. I’ve mostly just been frustrated with my manager and the borderline offensive pay “raises”. I was hired as a SWE intern and was employee 12 (i don’t know if it matters but 8 people above me left or were fired at some point in the past 5 years which makes me number 4 in terms of tenure).\n\nI have an offer to join a 5 person startup (literally had their seed round 2 weeks ago) and another offer to join 50 person series b startup. the series b startup has a lot of overlap with my current company and might even be considered as competition and I know the VP of Eng really well. The seed startup’s CEO was so incredibly cool to talk to. He was super humble and honestly i  felt like I could trust him immediately which is pretty hard for me to do bc I’m always skeptical of executives who are a little too nice lol. I’m kind in a bit of a dilemma bc I really like both companies. The comp/equity/benefits are pretty much close enough that I don’t think it matters a whole lot here.\n\nI feel like when the team is smaller, there is obviously more work to do but there’s also a lot less overhead and a lot more trust. And in my experience, when the team is larger, there is still a lot to do but the pressure is spread out over the team so there is more trust in the team as a whole but there is just more overhead which I can find frustrating at times. I was only an intern when the team was small so I don’t know if Im just wearing rose-colored glasses as to how working at a small company felt like.",
        "num_comments": 6,
        "comments": [
            "The payoff from a startup is the equity. Join earlier, higher risk:reward ratio if they make it big. But, will they make it?\n\nYou’re bang on about what diff companies are like to work for. IMO if you aren’t focused on share options you should optimise for learning or getting skills in a direction you want to move in",
            "IMO it depends on career stage. If you're still very early in your career, the seed stage startup offers a potential faster path to seniority assuming the startup grows. If you're later in your career seed startups offer little in terms of growth and you'll likely need to be at a larger company to move up.\n\nThere is a natural tiering effect that when you move up tiers your seniority gets bumped a level down-ish. Like a VP at a series A might be considered a Director at a series B. Of course that's dependent on how you're able to sell yourself. But just something to keep in mind for career progression - I didn't know this and sorta painted myself into a corner of being too senior for A and too junior for B simultaneously and it is not a fun place to be.",
            "I personally prefer 50+ person. By 50 employees you can see what the culture of the company is going to be like and they’ve just proven so much more by that stage.\n\nGoing in as employee number 5 is a complete lottery - and to be totally honest, what are the actual chances of vesting all the equity, the company succeeding in such a huge way, and being able to capitalise on your options? So rarely happens.",
            "It depends how much runway the 5 person startup has. Need at least 2 years .\n\nOtherwise the 50 member as it will provide you stability . Since they just raised series B it means they got some big folks supporting them and their idea.\n\nSame cannot be said about the 5 member one",
            "The perfect number is a balanced 3. Everything above this is complexity. Which is more cost and risk. Decision making changes. Vision alignment becomes more difficult. 3 individuals collaborating efficiently are creating exponential output. If this collaboration is maintained for a long enough period it creates sustainable energy. This is not symbolic. This is literal.",
            "100% This. But it's also worth considering your life situation. If you don't have kids and don't plan for it for the next couple of years. Also if you want to take risks or are fed up with internal politics.\n\nAnd going medium-large-sized company before going to a startup is also fine. As it makes it easier to pick choose the startup to join.\n\nAnother tip, consider when to leave when things don't work out. I stayed too long at a zombie startup. If it isn't growing, it's time to move on."
        ]
    }
}