{
    "Announcing TL.net TEAM Map Contest #4! Looking to give the 2v2/3v3/4v4 scenes a much needed infusion of new ladder maps—submissions open until July 7th.": {
        "title": "Announcing TL.net TEAM Map Contest #4! Looking to give the 2v2/3v3/4v4 scenes a much needed infusion of new ladder maps—submissions open until July 7th.",
        "score": 72,
        "url": "https://tl.net/forum/starcraft-2/626886-tl-team-map-contest-4-presented-by-monster-energy",
        "content": "",
        "num_comments": 11,
        "comments": [
            " my wife and i recently replaced our baby formula with Monster Energy Drink (Zero Ultra) ever since they started sponsoring map contests and sc2 events. my baby has so much energy, you can really tell that the compounds in this drink make you strong and healthy!",
            "Will Microlizzard actually put them in the map pool, though?",
            "Nice. I still play 2v2 with a friend about once a week. I would love new maps for those.",
            "This is so good and has been sorely needed\n\nMonster & TL 🤘",
            "Beautiful!  I appreciate Monster's sponsorship.  I know ESL doesn't have much investment in the team game scene so it's nice that they're still coordinating this stuff.",
            "I am going to buy some Monster today to celebrate this",
            "Damn this will be FUN!",
            "please please please get some new team maps on the ladder!!!",
            "this a very welcome initiative indeed! since I have been grinding mostly 2v2 in the past seasons due to ladder anxiety, seeing the map pools just rotating the same maps instead of seeing new maps is kinda boring. Thank you map makers for the effort! Appreciated!",
            "[ Removed by Reddit ]"
        ]
    },
    "2024 Global StarCraft II League Season 2: Code S, Semifinals and Grand Finals match thread\n": {
        "title": "2024 Global StarCraft II League Season 2: Code S, Semifinals and Grand Finals match thread\n",
        "score": 43,
        "url": "https://www.reddit.com/r/starcraft/comments/1dqgdqr/2024_global_starcraft_ii_league_season_2_code_s/",
        "content": "# Welcome to 2024 Global StarCraft II League Season 2: Code S! The tournament concludes tomorrow, Saturday the 29th, with the Sefiminals and Grand Finals.\n\nLive updated scoreboards on [**Liquipedia**](https://liquipedia.net/starcraft2/Global_StarCraft_II_League/2024/Season_2) and I will also do my best to keep up the ones in this post throughout the broadcast, as my other obligations permit.\n\n# Broadcast time\n\n**Saturday the 29th**\n\n**08:00 UTC -** [**Countdown to broadcast**](https://www.timeanddate.com/countdown/generic?iso=20240629T08&p0=1440&font=cursive&csz=1)\n\n# Supporting GSL\n\n[**GSL Official Patreon**](https://www.patreon.com/GSL)\n\n[**Live audience ticket purchase**](http://www.ticketlink.co.kr/)\n\n# Commentary and updates:\n\n* [**Liquipedia Tournament Page. Includes a regularly updated bracket visual as well as timestamps**](https://liquipedia.net/starcraft2/Global_StarCraft_II_League/2024/Season_2)\n* [**Discord for live commentary and more**](https://discord.gg/BDWE78p)\n\n# Stream(s)\n\n* [AfreecaTV YouTube](https://www.youtube.com/watch?v=tOZSybQWU_s)\n* [AfreecaTV English](http://play.afreecatv.com/gslenglish)\n* [AfreecaTV Korean](http://play.afreecatv.com/afgsl)\n* [AfreecaTV Spanish](http://play.afreecatv.com/alphaxesp)\n* [AfreecaTV Russian](https://play.afreecatv.com/starladder/)\n* [AfreecaTV Taiwan](http://play.afreecatv.com/gsltw)\n* [AfreecaTV Japan](http://play.afreecatv.com/afgsljp)\n* [SCBoy](https://douyu.com/3484/)\n\n# VODs\n\nVODs will be available in the following places:\n\n* YouTube (linked above)\n* AfreecaTV (linked above)\n* [sc2links. com (spoiler free)](https://www.sc2links.com)\n\nBoth Semifinals matches are best of 5 (first to win 3 maps wins the match)\n\nThe Grand Finals is best of 7 (first to win 4 maps wins the match)\n\n# Semifinals Scoreboard\n\n|**Match**|**Team**|**Player**|**Score**|**Player**|**Team**|**Aligulac prediction**|\n|:-|:-|:-|:-|:-|:-|:-|\n|1|[Team Liquid](https://liquipedia.net/starcraft2/Team_Liquid)|[Cure](https://liquipedia.net/starcraft2/Cure)|0-1|[Dark](https://liquipedia.net/starcraft2/Dark)|[Talon Esports](https://liquipedia.net/starcraft2/Talon_Esports)|[1-3](http://aligulac.com/inference/match/?bo=5&ps=1665%2C76)|\n|2|[Blacklist International](https://liquipedia.net/starcraft2/Blacklist_International)|[Creator](https://liquipedia.net/starcraft2/Creator)|0-0|[Maru](https://liquipedia.net/starcraft2/Maru)|[Team Vitality](https://liquipedia.net/starcraft2/Team_Vitality)|[1-3](http://aligulac.com/inference/match/?bo=5&ps=2%2C49)|\n\n# Grand Finals Scoreboard\n\n|Team / Player|Map winner|Score: 0-0|Map winner|Team / Player|\n|:-|:-|:-|:-|:-|\n|Semifinals 1 winner||Map 1|Semifinals 2 winner||\n|||Map 2|||\n|||Map 3|||\n|||Map 4|||\n|||Map 5|||\n|||Map 6|||\n|||Map 7|||\n\nIf you've read this far, do also [check out the event calendar on](https://tl.net/calendar/) There's plenty of Starcraft going on before and after this event!\n\n**Enjoy the games!**",
        "num_comments": 13,
        "comments": [
            "If it's really the end of GSL, I hope Maru to win it to get G9L...actually I'm fine with any of these four winning it. I've had so much fun and joy from watching GSL over years and I'm thankful to all the GSL players for all the wonderful moments, brilliant builds and great games. I know all good things must come to an end, I will always remember all of these beautiful memory which keeps popping into my mind - I used to wake up at 2am just to catch up GSL live, we used to have 9pm GSL on Friday, the greatest TvT by Maru/TY in 2018 S3 Finals, gumiho's run in 2017, Maru's 4 GSLs in a row, Trap losing PvZ sadly in 2019 patch, sOs being so close to get his first GSL against Innovation, sOs' proxy nexus into DT vs bunny, Byun's win in 2016, \"Roar\", ... It's been a good run. No matter if it's the end, Thank you GSL.",
            "Let's go Darkuuuu! You glorious moustached badass!\n\nLow key also supporting Creator, he looked awesome last round. He's been struggling but showing glimpses of brilliance for a long time now.",
            "Despite him being really strong in TvT and TvP, Cure hasn't looked that great in TvZ to me, so we could well see a Maru v Dark finals again.\n\nExpected Dark 4-2 Cure, Maru 4-1 Creator, Maru 4-2 Dark.",
            "Msl.. Maru star league. But go creator!",
            "Would love to see a protoss win. Go creator!",
            "**Group Stage 1 VODs**\n\n[Group Stage 1, Group A VOD](https://www.youtube.com/watch?v=TeawlJd7Q_I)\n\n[Group Stage 1, Group A spoilerless VOD](https://www.sc2links.com/match/?match=62374)\n\n[Group Stage 1, Group B VOD](https://www.youtube.com/watch?v=-v7RpY1OWoo)\n\n[Group Stage 1, Group B spoilerless VOD](https://www.sc2links.com/match/?match=62395)\n\n[Group Stage 1, Group D VOD](https://www.youtube.com/watch?v=CrB_cC0dMaY)\n\n[Group Stage 1, Group D spoilerless VOD](https://www.sc2links.com/match/?match=62414)\n\n[Group Stage 1, Group C VOD](https://www.youtube.com/watch?v=76YbC2Nv1t0)\n\n[Group Stage 1, Group C spoilerless VOD](https://www.sc2links.com/match/?match=62459)\n\n**Group Stage 2 VODs**\n\n[Group Stage 2, Group A VOD](https://www.youtube.com/watch?v=a9YqoeK_OBg)\n\n[Group Stage 2, Group A spoilerless VOD](https://www.sc2links.com/match/?match=62596)\n\n[Group Stage 2, Group B VOD](https://www.youtube.com/watch?v=3n7SIRz9k34)\n\n[Group Stage 2, Group B spoilerless VOD](https://www.sc2links.com/match/?match=62601)",
            "I give Maru a 64.8% chance to take it again.",
            "Is there something wrong with my TV or does it seem like the observer has vsync off?",
            "Is there any chance that Maru fumbles this?",
            "chances that maru wins are about 89%"
        ]
    },
    "Sarah Kerrigan cosplay by me": {
        "title": "Sarah Kerrigan cosplay by me",
        "score": 658,
        "url": "https://i.redd.it/ascdlhqbre9d1.png",
        "content": "",
        "num_comments": 9,
        "comments": [
            "Focused butt shots just like Blizzard would",
            "not only is the cosplay and the gun peak but in typical Blizzard fashion both the face and somehow the butt are both visible from the front\n\n10/10",
            "Amazing",
            "Great cosplay!",
            "Sarah Kerigan cosplay posted by a bot account farming upvotes*\n\nMy mistake this isn't the yearly sarah kerrigan bot farm post.",
            "Onlyfans advertising lol",
            "It's still a bot though.",
            "Where sarah Kerrigan boobies",
            "Gotta respect the hustle"
        ]
    },
    "GSL selling commemorative GSL logo badge set 6/28-7/10": {
        "title": "GSL selling commemorative GSL logo badge set 6/28-7/10",
        "score": 70,
        "url": "https://i.imgur.com/RxAgfcA.png",
        "content": "",
        "num_comments": 16,
        "comments": [
            "https://bj.afreecatv.com/afgsl/post/128851405\n\nSales page: https://shopfreeca.afreecatv.com/products/120846388\n\nKoreans forums are doomposting speculating it may be hints of GSL ending or maybe rebrand. Either way, they are doing what they normally don't do usually, so it's sus.\n\nRegardless, GSL finals in less than 24 hrs, come watch it then.",
            "I want the jacket man....",
            "classic gsl. They have free money by selling outside of Korea yet they ignore us. Very annoying ",
            "I’d pay twice if someone reshipped from Korea. If I’m not the only one, maybe someone could make some $",
            "I take it there's no shipping outside of Korea? Went on the purchase page and it doesn't recognise my foreign address which is a real shame.",
            "Why are they always trying to force international fans out of cool stuff. English YT live stream sucking, not shipping international (they could ignore taxes and everything and people would still buy).",
            "Wish I knew someone in korea who can ship it to me...",
            "GSL beyblade when?",
            "That first GSL logo is unmatched.",
            "oh, if you buy it, it doesn't come with the case, its just badges"
        ]
    },
    "L.O.S.E.R. —a full proof system to nip your friends mech addiction in the bud before it’s a problem": {
        "title": "L.O.S.E.R. —a full proof system to nip your friends mech addiction in the bud before it’s a problem",
        "score": 261,
        "url": "https://www.reddit.com/r/starcraft/comments/1dqhr9e/loser_a_full_proof_system_to_nip_your_friends/",
        "content": "\nMech players. Ohhh mech players. We all now at least one. As a humble, hardworking bio Terran myself, I’m often overcome with a sense of pity for my simple-minded mech friends. For years I made excuses for them:\n\n“He’s figuring out the game bro, let him play the style he likes”\n\n“Mech is really strong in TvZ man, he’s being strategic”\n\nIt’s starts off harmless enough. Perhaps your mech friend dabbles in a little cyclone Helion. Maybe he enjoys the occasional 1/1 tank all in. But what seems like a quaint, silly little hobby at first will inevitably, sooner or later, metastasize into a full blown mech addiction.\n\nThe signs are subtle at first. The third base starts becoming a planetary instead of an orbital. Their engineering bay will be researching building armor and turret range as suspiciously early junctures. And before you know it: Turrets everywhere, planetaries in every choke point, and more tanks than the battle of El Alamein. \n\nYou’ll be 35 minutes into a TvT on Goldenaura, breathlessly spamming Vikings and researching liberator range wondering where it all went wrong. Why can’t two decent men agree to Stim their marines into each other’s tanks over and over again like a normal, healthy TvT?\n\nAs the most eLiTE MuLtIaskiNG, hardworking Gaymers, it is the responsibility of honorable bio Terrans the world over to stop your friends from descending into pure mech idiocy. To aid you in your struggle, I’ve come up with a fool proof five step system to save your mech friends from moral degeneration: \n\nL.O.S.E.R.\n1.  L.—Listen to your mech friends. \n\n2. O.—Observe how slowly their cursor moves as they carefully siege their tanks behind a line of 20 turrets\n\n3. S.—Suggest alternative, more respectable playstyles: “you can always play Protoss if real Terran is too hard bro”\n\n4. E.—Empathize with their lack of skill, human decency, and inability to not waste everyone’s time\n\n5. R.—Remind them that Protoss exists and you don’t even have to siege anything or switch Thors to high tech impact mode if you’re a-moving carriers\n\nWe must all do our part to save our mech friends from themselves. ",
        "num_comments": 56,
        "comments": [
            "As a recovering mech addict, what still bothers me to this day is why didn’t anyone warn me? The signs were all there, yet everyone simply watched and let me burn. Friends don’t let friends suffer in silence! Some truths need to be spoken, no matter how hard.",
            "I only mech to de-stress after a long tvp. I can stop building factories anytime I want. Get off my back.",
            "Quality shit post!",
            "...I didn't play mech on purpose! I swear! The Zerg opened aggressively and forced me to reactor Cyclones! And then I just started winning! Oh god it's too late for me right?? OH GOD!",
            "Mech is cool. End of thought process.",
            "I bet that you keep listening those thors hammers over ur poor marines in sleep",
            "Nice, i am safe.  \nBC rush is perfectly fine.",
            "I feel personally attacked so I chant you an old mech dwarf song full of wisdom\n\n*Far over the Zerg creeps cold*  \n*Vs Protoss fleet and bio old*  \n*We mech always, on ladder day*  \n*To find our league long over gold*  \n*The cruisers were roaring on the height*  \n*The sieges were owning in the fight*  \n*The fire was red, blueflame instead*  \n*Marines like torches blazed with fire*",
            "I will never forget offracing as T, getting stuck in a 45 minute mech TvT, barely winning, and the dude gg'd after. Blew my mind as I realized that dude was having a good time the whole game. Mech players are a different breed.",
            "I'm dying over here. L.O.S.E.R. is the most relatable thing I've ever read on Reddit. The Protoss reference had me giggling uncontrollably. As a fellow Terran bio myself, I can attest that it's indeed a noble cause to save our mech friends from their own destructive tendencies. Well done, good sir!"
        ]
    }
}