{
    "The Acolyte - Episode 5 - Discussion Thread!": {
        "title": "The Acolyte - Episode 5 - Discussion Thread!",
        "score": 1148,
        "url": "https://www.reddit.com/r/StarWars/comments/1dolpd7/the_acolyte_episode_5_discussion_thread/",
        "content": "&#x200B;\n\n['Star Wars: The Acolyte' Episode Discussion](https://preview.redd.it/rvz6nfwm0e4d1.png?width=1616&format=png&auto=webp&s=10b0650f4180d7df8eb2026ebc7a508babf26603)\n\n[Episode Schedule](https://preview.redd.it/syq8mk7o0e4d1.png?width=1616&format=png&auto=webp&s=9518034da7024252ba91e99cb185430c3868f253)\n\n**SPOILER POLICY**\n\n**Outside of this thread all spoilers must be tagged until 14 days after the air date.**\n\n['Star Wars: The Acolyte' Subreddit](https://preview.redd.it/pds04c7p0e4d1.png?width=1616&format=png&auto=webp&s=417112283f2f08231da5f92041cc5ac909152d04)\n\nBe sure to check out the 'Star Wars: The Acolyte' subreddit - r/TheAcolyte\n\n[Places to check out](https://preview.redd.it/ujvxadeq0e4d1.png?width=1616&format=png&auto=webp&s=8c80f90ff0140c59401cc5b90d5d011a1bef8efd)\n\n**Official** [**r/StarWars**](https://new.reddit.com/r/StarWars/) **Discord server** \\- [discord.gg/StarWars](https://discord.gg/StarWars)\n\n**Star Wars Television Discord server** \\- [discord.gg/SWTV](https://discord.gg/SWTV)",
        "num_comments": 9007,
        "comments": [
            "Well thats a lot more stab wounds than we normally get. Goodbye Jecki ",
            "Begun, this Parent Trap has.",
            "So Mae switched places with Osha, the sith knows it and so does the little animal thing cause he can smell the difference.",
            "I love how Manny jacintos career is most defined by playing an idiot pretending to be a religious zealot and now by a religious zealot pretending to be an idiot",
            "Wow theyre really killing everyone",
            "So Qimir is totally a sith apprentice trying to find his own apprentice right?",
            "It's really crazy to see a mission with a survival rate of like 10%.",
            "Manny Jacintos arms will turn me to the dark side.",
            "The Yord horde is gone. We had a good run",
            "Me: Oh another short episode, what could happen\n\nMe 30 min later: well fuck"
        ]
    },
    "Star Wars movie (New Jedi Order I think) and Dune Messiah are being reported to release on the same day. Thoughts?": {
        "title": "Star Wars movie (New Jedi Order I think) and Dune Messiah are being reported to release on the same day. Thoughts?",
        "score": 2240,
        "url": "https://i.redd.it/klna4eymsd9d1.jpeg",
        "content": "Do you think they will keep this release date or move? Also what does this say to the state of Star Wars that Dune, a franchise which has yet to make a billion for a film, feels confidently enough to do this?",
        "num_comments": 692,
        "comments": [
            "Theres not a chance in hell these two movies release on the same day. Makes absolutely no business sense.",
            "1. Not confirmed to be *Dune*\n2. Release dates change over the course of 2.5 years",
            "I'm more excited for Dune Messiah tbh",
            "In forty seven years I have never felt so little excitement for the release of a Star Wars movie.",
            "Villeneuve already said his next project wont be Dune Messiah.",
            "I kind of hope they push the New Jedi Order movie back to May 2027. It could be a great release for the 50th anniversary of the series, plus if it's true that it's set 15 years after TROS that would also mean it's set 50 years after ANH",
            "There is no way any release dates for a Star Wars movie can be trusted. Ill have my ticket in hand, walking to the theater and expect Kathleen Kennedy to jump out from behind a standee yelling gotcha!!",
            "With how fractured the SW fan base is atm, I honestly think if its Messiah, it backhands that SW movie",
            "I hate saying it but after 9 I'm ok with watching a Dune over Star Wars. It's disappointing but I didn't make the decision to reboot the franchise with 7,8,9.",
            "Do it, you cowards! Itll be 2026s Barbenheimer! Dune Wars!"
        ]
    },
    "When do you consider the start of the Age of Rebellion?": {
        "title": "When do you consider the start of the Age of Rebellion?",
        "score": 624,
        "url": "https://www.reddit.com/gallery/1dr23cl",
        "content": "",
        "num_comments": 110,
        "comments": [
            "When Bail Organa saw that Jedi kid get gunned down. Cold-blooded executed without trial. So literally minutes after the Empire formed.\n\nI feel like that's a kind of \"haunt your dreams\" moment to see.",
            "Luthen was right. He doesn't get credit for starting the fight even in memes.",
            "I think the rebellion started informally before Andor and formally at the end of it. \n\nBut to me, it's when that girl said \"I rebel\" in the Rogue One trailer.",
            "The Rebellion started about the same time Bail Organa watched Clone Troopers kill a child. However, the actual Age of Rebellion started after Luke blew up the Death Star. \n\nIt was at that point that the Empire knew that they couldn't just treat the Rebellion as a group of pesky annoyances. This was a legitimate threat to their power now and they had to destroy it in order to maintain their power.",
            "Its technically Legends, but Padme and the Petition of the 2000\n\nIf not that, whenever the Rebel Alliance has consolidated into a unit (so during the time where Andor is set)",
            "\"At an and your rule is and not short enough it was.\"",
            "In 2 BBY when Mon Mothma, Bail Organa and  Garm Bel Ibris signed the Corellian treaty and created the Alliance to Restore the Republic.",
            "I want to say Anto Kreegyr's attack on the Imperial Power Station at Spellhaus, but admittedly it's more about saying Spellhaus because I thought that was a pretty cool name to just toss in. That and I love Forest Whitaker's little monologue in that episode...\n\n> \"Kreegyr's a separatist. Maya Pei's a Neo-Republican. The Ghorman Front. The Partisan Alliance? Sectorists! Human cultists? Galaxy partitionists. They're lost! All of them, lost! Lost!...I am the only one with clarity of purpose.\"",
            "When Mon Mothma put out a call and met with different cells gather together at Dantoonie",
            "From a historian perspective, the Lothal Crisis or the Funeral Riot make for the best \"start\" points. The Aldhani Heist or Narkina 5 can be considered instigating events, but Lothal (especially the broadcast) and Marva's Funeral were the two instances where the target is explicitly and publically announced as the Empire itself."
        ]
    },
    "A common sentiment?": {
        "title": "A common sentiment?",
        "score": 155,
        "url": "https://i.redd.it/obzgl5mqrh9d1.jpeg",
        "content": "",
        "num_comments": 28,
        "comments": [
            "But is he still a Jaguars fan?",
            "Janet was one lucky not a girl.",
            "Honestly that ship sailed long ago for me back with The Good Place thanks to that dumb sweet hottie Jason",
            "Remember, he's evil. Sexy, sexy evil.",
            "We agree that until he has a name we're going to call him Darth Jason, right?\n\nMuch like we all called Grogu \"Baby Yoda\"?",
            "It did but it happened when I first saw him in A Good Place",
            "This single man fixed half of the entire problems with the show. He chopped those problems.",
            "END ME PLZ SIR AHHHHH",
            "Anyone else think his arms are disproportionately huge? Hes just a little dude with massive arms",
            "\"We just need a defense and an offense and some rule changes!\""
        ]
    },
    "My 7-year old son decided he wanted to start watching Star Wars. While we were watching our first (A New Hope) I saw he had been taking notes.": {
        "title": "My 7-year old son decided he wanted to start watching Star Wars. While we were watching our first (A New Hope) I saw he had been taking notes.",
        "score": 506,
        "url": "https://i.redd.it/aadkmhe15f9d1.jpeg",
        "content": "",
        "num_comments": 64,
        "comments": [
            "Adorable & very best printing. :) \n\nWe will watch his career with the great interest.",
            "Your kid has great spelling!",
            "The Battle of Hoth is gonna blow his mind. Seeing those AT-AT's across the tundra in that rebel soldiers optics is locked in my head until the day I die. Same with Boba Fett.",
            "The force is strong with this one",
            "Imagining a world where Han Solo was a jawa and Im not hating it.",
            "Your kid is goin places!",
            "The boy is a credit to your movie watching experience.",
            "I imagine starwars is important to you. Thats sweet that he wants to learn and share in what you like. I bet youre a good parent.",
            "He wrote \"peaple\" with an a at first just like I used to  how sweet",
            "Your kid is awesome!\nEDIT: cheat vid"
        ]
    }
}