{
    "[Megathread] Steam Summer Sale 2024! 6/27 to 7/11/24 @10am PST. $19 Billion in Games Never Played by Steam Users...and counting. They're doing their part. Are you? Service Guarantees Citizenship. Would you like to know more? ": {
        "title": "[Megathread] Steam Summer Sale 2024! 6/27 to 7/11/24 @10am PST. $19 Billion in Games Never Played by Steam Users...and counting. They're doing their part. Are you? Service Guarantees Citizenship. Would you like to know more? ",
        "score": 475,
        "url": "https://youtu.be/bd6HrWFNPrc?si=jNLHlGjOY0rjCduk",
        "content": "",
        "num_comments": 401,
        "comments": [
            "Man, here is the thing. I didn't buy that $2 copy of Deus Ex: Human Revolution because I wanted to play it. I bought it in case I ever wanted to play it again.",
            "Looks at my 200+ game backlog......yep, nothing to play, so glad there's a huge sale starting today! Fmw.",
            "Bought 4 games.\n\nTime to go back to Balatro",
            "I bought Forza Horizon 4 again so I can play it on my Deck. It runs beautifully.",
            "Holy hell. My whole wishlist is on sale",
            "Very hyped I just got my first steam deck and I barely have any games to play. Was waiting for the summer sale and now my bank account will be scared",
            "Great! Cant wait to buy bunch of games ill never play, im so excited..",
            "Press F for everyone looking to get a discounted OLED",
            "I got Elden Ring, Witcher 3, and Celeste for $47. My first steam deck and practically nothing in my library. So Im happy to have gotten 3 games for less than the price of a normal one now ",
            "Disco Elysium at 3.99! Damn, that's pretty good."
        ]
    },
    "As is custom by now, here is the overkill.wtf post with the best deals under $10 in the Steam Summer Sale": {
        "title": "As is custom by now, here is the overkill.wtf post with the best deals under $10 in the Steam Summer Sale",
        "score": 901,
        "url": "https://overkill.wtf/best-games-under-ten-10-dollars-in-the-steam-summer-sale-2024/",
        "content": "",
        "num_comments": 350,
        "comments": [
            "Thinking about a subnautica game myself, heard good things about atleast the first one",
            "Spiritfarer is under $10\n\nOne of the most beautiful, emotional games Ive ever played",
            "I got disco elysium, journey, a short hike, firewatch, and inside for $21. All new to me and needed something light hearted and easy to set down at a moments notice",
            "hey look at that a bunch of games I bought and never got around to playing are under 10 dollars now ",
            "Shadow of Mordor from the UK so it's 1.20 for me not to sure what that is in dollars",
            "I just got Doom 2016 at 80% discount :D",
            "CrossCode for 5,99.\nIts a complete steal",
            "Brotato for $3.50 is great",
            "Metro series for under $10! First 2 games are verified, last game is playable. Never tried it before but Im gonna pick it up and jump in!",
            "I am begging you to buy Disco Elysium"
        ]
    },
    "So I bought Balatro yesterday...": {
        "title": "So I bought Balatro yesterday...",
        "score": 875,
        "url": "https://www.reddit.com/r/SteamDeck/comments/1dqt30t/so_i_bought_balatro_yesterday/",
        "content": "I heard all of you fools talking about this game and it just didn't seem that interested to me but I decided to look at it and I liked the way it looked so I bought it and now I've played for about 15 hours. Holy shit. I can't put it down. Probably the best game to watch TV with.",
        "num_comments": 199,
        "comments": [
            "There is crack and then there is balatro.",
            "I watched someone on YouTube play it and it seemed boring at first to me too but man is it addictive. I've prolly put 15-20 hours in recently",
            "It feels like a bit of a scam to me. No way you can return it within the normal steam two hour window. I just tried it out for a bit and then 3 hours were gone.",
            "I think it was the besties pod who said something along the lines of we know hearing someone talk about Balatro does not make it sound interesting or fun, but trust me, play it and youll understand. \n\nGlad youre enjoying it.",
            "My exact experience I was avoiding it cause I couldnt see myself liking a card game. Then I got it and was hooked. Its great but for me it had no staying power. Still a great game nonetheless",
            "Lol Im in that same boat. It does not look interesting at all to me but everyone on Reddit recommends it so I just picked it up. Going to get at it this weekend and Im sure I wont be let down",
            "lol literally did the same thing for the same reason today.  I just cant stop.  Apparently this is coming to phones too, at which point I think I might as well quit my job.",
            "I really enjoy balatro. But my girlfriend who is not a gamer at all, loves it way more than me! Its something that we really enjoy playing together and its fun having a second set of eyes. She asked if I could leave my steam deck at her place for a few days while I was away so she could play lol!",
            "Im to broke for cocaine so balatro it is",
            "I thought it looked dumb, then I bought it and lost a few hours into it. I must not like roguelites though because I beat a run after a few hours and lost most motivation to do it again."
        ]
    },
    "Elden Ring is now the most-played game on Steam Deck according to new Steam list ": {
        "title": "Elden Ring is now the most-played game on Steam Deck according to new Steam list ",
        "score": 1619,
        "url": "https://www.pcguide.com/news/elden-ring-is-now-the-most-played-game-on-steam-deck-according-to-new-steam-list/",
        "content": "",
        "num_comments": 263,
        "comments": [
            "It's things like this which make me really wish that more developers would code in a \"Steam Deck\" graphics preset that's optimized for the deck. \n\n...and make it so that I don't have to use a hex editor in order to play in 16:10...",
            "Making sure Elden Ring ran well on the deck was genius marketing at launch.",
            "Whats the download size for elden ring btw? Im thinking on buying it",
            "Does the DLC run about the same or is it worse?",
            "I contributed. My first playthrough was entirely on the deck.",
            "I just beat messemer in bed last night on my deck. I love this thing.",
            "Im having trouble, I like to go back and forth on my deck and PC. But I still get the Inappropriate activity detected pop up and I cant play online or pick up my save from my pc.. Is there anything I can do?",
            "I do Moonlight/Sunshine remote play to my gaming PC and it's been an unexpected delight. Input delay is not noticeable enough to cause me any real issues. I play better without remote play, but it's a perfectly acceptable way to play on the Deck.",
            "Honestly yeah. Its remarkable it works so well on the Deck. Its honestly better than playing on an actual high end PC because of how it fixes the stuttering issues if you lock it at 30fps. Its a truly remarkable game on a remarkable system. Being able to play on the go and in bed has been great!",
            "Can you actually play the game on Deck now, or is it still throwing the \"Inappropriate Activity Detected\" error at the main menu? Wasn't able to play at all the first 3 days of the DLC launch, haven't bothered trying since."
        ]
    },
    "Smells are for free": {
        "title": "Smells are for free",
        "score": 728,
        "url": "https://i.redd.it/cisndt7yyc9d1.jpeg",
        "content": "",
        "num_comments": 45,
        "comments": [
            "The pleasures of vent smelling cannot be limited to one species",
            "I see KH on steam deck I upvote",
            "How'd you manage the final mix? Mind sharing what emulator and rom location?",
            "They can sniff the emotions youre about to go through with this game",
            "Im discovering that the Trickmaster really is a massive pain in the ass boss, and it wasnt just me sucking at the game when I was a kid.",
            "Why does the vent smell good when it gets hot",
            "I am intrigued by this \"Kingdom Haters\" game.  As, apparently, is small stuff.",
            "Kh steam deck based. Game is amazing on deck",
            "How is it on deck? Ive never played the games but had my eyes on them for a while now",
            "Is KH worth getting into, zero nostalgia, if we already know that KH3 wrecked the landing? Are any of the games in these collections actually good to a modern audience besides KH1 and 2? (Asking honestly because the bundle is currently $60 on GMG)"
        ]
    }
}