{
    "Rate me daddies. ": {
        "title": "Rate me daddies. ",
        "score": 502,
        "url": "https://i.redd.it/n6wvqcomt08d1.jpeg",
        "content": "First time poster. Rate my picanha steaks? ",
        "num_comments": 97,
        "comments": [
            "Looks great! I’ve been meaning to try grilling some picanha.",
            "That right there is cooked to perfection! Even with a thermometer I still end up overcooking by a bit lol, I gotta practice to make mine just like that.",
            "Y’all can keep the meat, Just give me that gorgeous grilled fat to eat.",
            "Damn good job",
            "10 out of 10 Hawk Tuah!",
            "I want to taste your meat daddy",
            "That's a perfect medium rare, at least to me. Looks absolutely delicious. Great work!",
            "Delicious! I'm more of a rare/blue rare gal but I love me a good medium rare too",
            "Gawd daYUM!",
            "Yum"
        ]
    },
    "Good morning. Just hit chest, shoulders, and tri’s. Now inhaling steak and eggs.": {
        "title": "Good morning. Just hit chest, shoulders, and tri’s. Now inhaling steak and eggs.",
        "score": 77,
        "url": "https://i.redd.it/y7povm2xh38d1.jpeg",
        "content": "Have a great day!",
        "num_comments": 29,
        "comments": [
            "Can’t think of anything better",
            "https://preview.redd.it/65420pl3248d1.png?width=500&format=png&auto=webp&s=9674a10493c8779495f5826a91634455a3df59a3",
            "Push/Pull/Legs?",
            "What kind of hot sauce?",
            "Steak and eggs and eggs and steak ! That’s what you should have for breakfast delicious!",
            "When you back to eating some carbs diced steak with sweet Potatoes makes an amazing hash !",
            "It amazes me that you guys have steak for breakfast lol In Brazil we have bread, cake, deli at the most. If u into gym, maybe eggs, but thats it",
            "It’s Back and bi’s, chest and tri’s and legs head and shoulders!😂",
            "That’s the way….",
            "Especially after being ravenous from training. Euphoric."
        ]
    },
    "Top sirloin is $4.97/lb at safeway": {
        "title": "Top sirloin is $4.97/lb at safeway",
        "score": 110,
        "url": "https://i.redd.it/i5ng0vna128d1.jpeg",
        "content": "Cooked 4lbs in the sous vide for 3.5 hours at 125, only 2lbs plated. Served with asparagus and tortellini pasta salad. About $4/person. Decent cheap dinner for the family.",
        "num_comments": 5,
        "comments": [
            "If you don’t have sous vide can you do this in the oven?",
            "Looks great.",
            "Tell us how it tastes!",
            "Nice! Top sirloin is an underrated cut in my opinion… you’ve inspired me to go buy some soon lol",
            "Yup. Reverse sear."
        ]
    },
    "My first bone-in ribeye from a local butcher. How would you rate his meat?": {
        "title": "My first bone-in ribeye from a local butcher. How would you rate his meat?",
        "score": 226,
        "url": "https://www.reddit.com/gallery/1dlie31",
        "content": "",
        "num_comments": 53,
        "comments": [
            "I mean, you covered the marbling with seasoning so there isn't much way to tell there but it looks like it was a great steak and cooked to perfection!",
            "U gotta learn how to spread ur seasoning lol they are all piled up in the middle of the steak",
            "Imo, the best way to judge a new butchers meat is to just salt it (diamond crystal) and eat pure not with all the seasoning.",
            "https://preview.redd.it/n06wsj3qe18d1.jpeg?width=680&format=pjpg&auto=webp&s=9eb7f6d38bffa6b3de1fee9557f947ebca3da1f5",
            "That’s a well butchered steak",
            "Perfecto!",
            "Looks grass feed only. $35 is plenty for those 2 steaks",
            "Just FYI serrated knives don't cut. They rip and tear.\n\nI mean downvote if it makes you feel better, but thems the facts. That's why the steak in this pic is frayed.",
            "Agreed with other ratings and comments. Seasoning is sort of uneven, and please don't use a saw for ribeyes. They're already tender. \n\nHowever, very nice char and beautiful med rare color for your first bone-in ribeye. Nice job!",
            "One with nice rib cap and the other with small cap IMO need consistency and both with large caps."
        ]
    },
    "Went to Applebee’s for the first time in 20 years.": {
        "title": "Went to Applebee’s for the first time in 20 years.",
        "score": 1742,
        "url": "https://i.redd.it/4aoogtpw8x7d1.jpeg",
        "content": "I ordered a rib-eye. ",
        "num_comments": 591,
        "comments": [
            "Lay a luke-warm tennis racket across a rectangular hamburger patty and stick it all in the microwave.",
            "Until I read your notes, I thought this was a salisbury steak",
            "That’s not a ribeye, that’s a school paddie",
            "For the love of god people, stop ordering steaks at cheap chain restaurants lol",
            "Stop lying. That’s a McRib from McD’s isn’t it 🤣",
            "You really have no one to blame but yourself here",
            "Connecticut strip",
            "I feel like you deserve your fate for ordering a ribeye at Applebee's.",
            "Should’ve gone to Texas Roadhouse",
            "Last time I went was 2011, never again. Looks like it's the same steak from 2011. Looks lab grown and tastes like shit. Last time Applebee's was decent was like 2004. Waiting for my local one to fail hard and close down so they can put a proper Long Horn in its place."
        ]
    }
}