{
    "Monthly Support Thread & FAQ- June 2024": {
        "title": "Monthly Support Thread & FAQ- June 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/steelseries/comments/1d5rijz/monthly_support_thread_faq_june_2024/",
        "content": "Hey everyone,\n\nThis is our monthly Support & FAQ thread. The goal of this thread is to answer some very common questions you may have, and to provide a place for users in need to request assistance with their tickets on [SteelSeries.com](https://SteelSeries.com).\n\n**FAQ:**\n\n**Is this subreddit official?**\n\nWhile this subreddit is *the* SteelSeries subreddit, it is not an official support channel, and is mainly a place for our awesome community to come together. Some of the great SteelSeries staff may stop by to volunteer some time with comments, but that is not guaranteed. If you need help from SteelSeries directly, [please open a ticket!](https://support.steelseries.com/hc/en-us?solvvy=true)\n\n**How can I open a ticket to get assistance with my gear?**\n\nPlease check out the product FAQ at [support.steelseries.com](https://support.steelseries.com). If you can't find your answer, please open a ticket with [the chat window in the bottom right!](https://puu.sh/Jl9Zz/7bfaddaa11.png) It'll ask a few questions to make sure the ticket is directed to the right team, and once confirmed, you can open a ticket in that window.\n\nIf you are having issues with viewing this chat window, please make sure that any ad-block plugins on your browser are temporarily disabled, as they may interfere with the support systems.\n\n**Can I ask about product restocks or upcoming products?**\n\nAs product availability can vary based on region, store, retailer, type, and other global factors, we cannot assist with restock questions. For more information, [please see this article](https://support.steelseries.com/hc/en-us/articles/360044380891-Out-of-Stock-Products) on how to sign up for restock notifications, or check with your local retailers.\n\nAs for upcoming products, you'll just have to wait and see.....\n\n**Where can I find update notes for SteelSeries GG?**\n\nInformation on updates can be found on the tech blog at [https://techblog.steelseries.com/](https://techblog.steelseries.com/)\n\n**Where can I give feedback on SteelSeries GG or products?**\n\nYou can click the \"Give feedback\" option within SteelSeries GG to submit it directly to SteelSeries. Of course, you are also free to post it to the community for other community members to look at and discuss!\n\n**What is this thread for?**\n\nThis thread is for additional assistance on a support ticket, if needed. If you're unhappy with your ticket response or resolution, please post the ticket # here. If you do not have a ticket open, please open a ticket. We are unable to assist with comments that do not have a ticket number listed.",
        "num_comments": 65,
        "comments": [
            "Apex Pro: Update after firmware 4.15.7 / gg 63.0 lighting goes black / off, live preview doesn't work. I've tried rebooting, keyboard factory reset, reinstall GG software. Just borked, can't get any lighting configuration to stick. (while application is running) and even lighting turns off sometimes if app is not running (exited from tray). Was working perfect before update :(",
            "Apex Pro: I'm also experiencing the issue of all lighting turning off following the GG/firmware updates. Not sure which one caused it, as I updated both together. Making it so that GG \\*doesn't\\* start up with my PC appears to fix the problem. But starting GG causes the lights to turn off again.\n\nEdit: GG version 63.0, Apex Pro Firmware 4.15.7",
            "Last night, it said there was a critical update, so I updated it. After that, the keyboard turned off and didn't turn on anymore. It's plugged into my PC and is completely unresponsive. Apex pro",
            "Is there a way to revert my apex pro to a previous firmware version because the latest one is causing issues with keystrokes not being registered and there's also a noticeable lag on key illumination after being pressed.",
            "I pretty often, when low battery, charge my headphone (artis 7 wireless) while using it and it always work until today.   \nToday I started not seeing at all the \"Artis 7 chat\" and \"Artis 7 game\" in the windows audio output dropdown bar or in the device manager. any idea why?",
            "Having problems with key illumination with the latest firmware on my Apex Pro keyboard. Pressing keys like Caps Lock or Num Lock result in a delay between pressing the key and the light under the key changing. Can record a video if needed.",
            "I have a PC, Switch, and PS5 all in different parts of the house-with the Arctis Nova Pro Wireless do I have to connect the base station to both the Switch and PS5 for these headphones to work with them, or can I utilize the bluetooth function in the headset to connect to my consoles while keeping the base station connected to my PC?",
            "Is there a way to change the color of the meta-binding keys while holding the steelseries / metalayer button? I use a static red-ish color and the orange meta layer color is really hard to spot.",
            "Steelseries stops recording Destiny 2 after a few seconds now with new update.",
            "Just ran a Windows update and now the Steel Series GG isn't detecting my Sonar headset. Tried restarting, reinstalling the interface - no dice. The computer itself detects it and is showing activity but it's not giving me any sound."
        ]
    },
    "GG 65.0 Update Notes": {
        "title": "GG 65.0 Update Notes",
        "score": 0,
        "url": "https://www.reddit.com/r/steelseries/comments/1dp3x2b/gg_650_update_notes/",
        "content": "**\\*If there are any issues after the update, please connect with our Support Team (via the Monthly Support Thread or our Support Website (**[support.steelseries.com](https://support.steelseries.com/)**). We will do our best to get you back in the game!**\n\n***Update Notes Include:***\n\n\n\n# Sonar\n\nNew Presets: \n\n* Escape from Tarkov Arena\n* MultiVersus\n* NieR: Automata\n\n# Engine\n\n* Bug Fixes\n\n# Moments \n\n* We’ve fixed an issue affecting the quality of trimmed clips. The quality should be much better now!\n\n\n\n**\\*If there are any issues after the update, please connect with our Support Team (via the Monthly Support Thread or our Support Website (**[support.steelseries.com](https://support.steelseries.com/)**). We will do our best to get you back in the game!**",
        "num_comments": 34,
        "comments": [
            "how much longer will we have to wait until we can have lights again in keyboards?",
            "Two software updates and still no firmware update/revert to fix keyboards partially bricked by faulty firmware?",
            "NOVA Pro Wireless DAC screensaver when???",
            "When will you fix the profiles? They don't switching automatically since v. 64",
            "if its not in the plan just let us know so we can buy from another brand",
            "personal mix stopped working for me in update. reverting to previous version did not fix either rip",
            "This update fix LED bug in APEX PRO yet ?",
            "Did the update ruin anyone else's audio? Mine keeps cutting in and out for whatever reason every other second. Was fine yesterday, came on today and now it's awful",
            "Thanks for sharing this! I will be sure to pass it along!",
            "Hey! It works! Thanks a ton for posting this."
        ]
    },
    "Customer Service VS NO Customer Service": {
        "title": "Customer Service VS NO Customer Service",
        "score": 1,
        "url": "https://www.reddit.com/r/steelseries/comments/1drb6ss/customer_service_vs_no_customer_service/",
        "content": "THE GOOD - I had a Corsair Liquid cooler fail.  Started an RMA and 1 week later and 5 messages my replacement part was shipped.  THE REALLY BAD - My 2 month old 7X headphones failed.   Started an RMA and over a month and innumerable messages later my RMA was approved - but not really!   Went to the website to provide my serial number it was not accepted.   Sent a screenshot to CS.  A week goes by and more requests.   This was just another runaround.   The RMA was closed. THE MORAL OF THIS STORY IS TO NEVER PURCHASE A STEELSERIES PRODUCT. ",
        "num_comments": 0,
        "comments": []
    },
    "Plans for a Full size Wireless Keyboard?": {
        "title": "Plans for a Full size Wireless Keyboard?",
        "score": 1,
        "url": "https://www.reddit.com/r/steelseries/comments/1dramzs/plans_for_a_full_size_wireless_keyboard/",
        "content": "Wondering if there are any plans for a full sized , or one of those 90% style keyboards in wireless.  I love the Steelseries software, but I need a wireless keyboard",
        "num_comments": 0,
        "comments": []
    },
    "Arctis nova 7 wireless vs Arctis nova pro wireless ": {
        "title": "Arctis nova 7 wireless vs Arctis nova pro wireless ",
        "score": 1,
        "url": "https://www.reddit.com/r/steelseries/comments/1dra1qi/arctis_nova_7_wireless_vs_arctis_nova_pro_wireless/",
        "content": "The main question is there big difference in sound quality?  \nIs this worth to pay more for this.",
        "num_comments": 4,
        "comments": [
            "same audio, more money just for the other features such as double battery.",
            "Pro gives you a dock and swappable batteries.",
            "I had both. Pro : I like the way u can swap the batteries and change the audio per game. If you have the money, a no brainer. If you have a budget, go for the 7. They are sick aswell",
            "The sound is a bit better, the drivers (speakers) are not the same. \n\nBut if you're not actually planning on having multiple devices connected to the dock and using the features then the price is not worth it. \n\nThe wired version sounds better fyi."
        ]
    }
}