{
    "Monthly Support Thread & FAQ- June 2024": {
        "title": "Monthly Support Thread & FAQ- June 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/steelseries/comments/1d5rijz/monthly_support_thread_faq_june_2024/",
        "content": "Hey everyone,\n\nThis is our monthly Support & FAQ thread. The goal of this thread is to answer some very common questions you may have, and to provide a place for users in need to request assistance with their tickets on [SteelSeries.com](https://SteelSeries.com).\n\n**FAQ:**\n\n**Is this subreddit official?**\n\nWhile this subreddit is *the* SteelSeries subreddit, it is not an official support channel, and is mainly a place for our awesome community to come together. Some of the great SteelSeries staff may stop by to volunteer some time with comments, but that is not guaranteed. If you need help from SteelSeries directly, [please open a ticket!](https://support.steelseries.com/hc/en-us?solvvy=true)\n\n**How can I open a ticket to get assistance with my gear?**\n\nPlease check out the product FAQ at [support.steelseries.com](https://support.steelseries.com). If you can't find your answer, please open a ticket with [the chat window in the bottom right!](https://puu.sh/Jl9Zz/7bfaddaa11.png) It'll ask a few questions to make sure the ticket is directed to the right team, and once confirmed, you can open a ticket in that window.\n\nIf you are having issues with viewing this chat window, please make sure that any ad-block plugins on your browser are temporarily disabled, as they may interfere with the support systems.\n\n**Can I ask about product restocks or upcoming products?**\n\nAs product availability can vary based on region, store, retailer, type, and other global factors, we cannot assist with restock questions. For more information, [please see this article](https://support.steelseries.com/hc/en-us/articles/360044380891-Out-of-Stock-Products) on how to sign up for restock notifications, or check with your local retailers.\n\nAs for upcoming products, you'll just have to wait and see.....\n\n**Where can I find update notes for SteelSeries GG?**\n\nInformation on updates can be found on the tech blog at [https://techblog.steelseries.com/](https://techblog.steelseries.com/)\n\n**Where can I give feedback on SteelSeries GG or products?**\n\nYou can click the \"Give feedback\" option within SteelSeries GG to submit it directly to SteelSeries. Of course, you are also free to post it to the community for other community members to look at and discuss!\n\n**What is this thread for?**\n\nThis thread is for additional assistance on a support ticket, if needed. If you're unhappy with your ticket response or resolution, please post the ticket # here. If you do not have a ticket open, please open a ticket. We are unable to assist with comments that do not have a ticket number listed.",
        "num_comments": 65,
        "comments": [
            "Apex Pro: Update after firmware 4.15.7 / gg 63.0 lighting goes black / off, live preview doesn't work. I've tried rebooting, keyboard factory reset, reinstall GG software. Just borked, can't get any lighting configuration to stick. (while application is running) and even lighting turns off sometimes if app is not running (exited from tray). Was working perfect before update :(",
            "Firmware 4.15.7 messed up the lighting effects of the Apex Pro keyboard. Video demonstration here:  \nhttps://x.com/C0DEDEAD/status/1797040643396477038?t=yGP88j3eFEXGsB4n6sgoFA&s=19",
            "[deleted]",
            "Apex Pro: I'm also experiencing the issue of all lighting turning off following the GG/firmware updates. Not sure which one caused it, as I updated both together. Making it so that GG \\*doesn't\\* start up with my PC appears to fix the problem. But starting GG causes the lights to turn off again.\n\nEdit: GG version 63.0, Apex Pro Firmware 4.15.7",
            "Last night, it said there was a critical update, so I updated it. After that, the keyboard turned off and didn't turn on anymore. It's plugged into my PC and is completely unresponsive. Apex pro",
            "Rocket league not working with SteelSeries Sonar since last update (yesterday) it only happens with this game. In the GAME channel on Sonar, the Rocket League source seems to \"flicker\" in and out. Here are fixes I've tried:\n\n- Turning pc off and back on\n\n- reinstalling rocket league\n\n- reinstalling steelseries gg\n\n- switching rocket league output from \"speakers\" to \"headphones\"   \n- checked all audio drivers\n\nI can hear the game fine when I disable SteelSeries Sonar. The software works fine with all other games, including games through Epic Games launcher.",
            "Chatmix still not synchronized with hardware wheel. Love it when I cant hear game coz software slider stuck all the way at chat.\n\nhttps://preview.redd.it/rtrjzx7mrb4d1.png?width=400&format=png&auto=webp&s=bb31aa608e2681df767d05e99657fd7a0ec88de0",
            "Fix the GG app each update it becomes more and more broken, hire some proper support. I'm thinking the app being this shit is because of the people working on ir being not competent enough.",
            "Arctic 7+'s Issues when using sonar (using latest version of GG)\n\n  \nIts sort of hard to explain, but essentially sonar is making my audio glitch in a weird way. Audio feels like its \"bouncing around\". Volume will go up or down, switch from the left ear to the right and generally just bounce all over the place. Disabling sonar fixes the issue. Then it will fix itself for maybe a minute, then return to weirdness. Started maybe around 8 months ago.\n\n  \nRight now im going to try a factory reset on my pc. Hope it fixes it",
            "I was about to report a problem about Sonar changing all of its inputs and outputs to use my audio interface, rather than my Arctis Pro Wireless devices, upon waking from sleep. But then I remembered the device priority lists, and had a look there. Sure enough, the Arctic devices were all at the bottom of the list.\n\nThis started happening following my last reboot for Windows Update, and I think I also had a Steelseries update pending too.\n\nSo I've hopefully been able to fix it myself, but I figured I'd still put it here to help others who may be having the same problem, but to also bring it to Steelseries' attention, in case there's something they can do to prevent this from happening in the future."
        ]
    },
    "GG 65.0 Update Notes": {
        "title": "GG 65.0 Update Notes",
        "score": 0,
        "url": "https://www.reddit.com/r/steelseries/comments/1dp3x2b/gg_650_update_notes/",
        "content": "**\\*If there are any issues after the update, please connect with our Support Team (via the Monthly Support Thread or our Support Website (**[support.steelseries.com](https://support.steelseries.com/)**). We will do our best to get you back in the game!**\n\n***Update Notes Include:***\n\n\n\n# Sonar\n\nNew Presets: \n\n* Escape from Tarkov Arena\n* MultiVersus\n* NieR: Automata\n\n# Engine\n\n* Bug Fixes\n\n# Moments \n\n* We’ve fixed an issue affecting the quality of trimmed clips. The quality should be much better now!\n\n\n\n**\\*If there are any issues after the update, please connect with our Support Team (via the Monthly Support Thread or our Support Website (**[support.steelseries.com](https://support.steelseries.com/)**). We will do our best to get you back in the game!**",
        "num_comments": 32,
        "comments": [
            "# How to Fix RGB Keyboard Issues with SteelSeries\n\nIf you're experiencing issues with your SteelSeries RGB keyboard, follow these steps to troubleshoot and fix the problem:\n\n# Steps to Fix the Issue\n\n1. **Unplug the Keyboard**\n   * Disconnect your SteelSeries RGB keyboard from your computer.\n2. **Hold the Roller and Menu Button**\n   * While unplugged, press and hold the roller and the menu button on the keyboard.\n3. **Reconnect the Keyboard**\n   * While still holding the buttons, plug the keyboard back into your computer.\n4. **Open SteelSeries GG Engine**\n   * Launch the SteelSeries GG Engine software on your computer.\n   * You should be prompted to reinstall the firmware update.\n5. **Reinstall the Firmware**\n   * Follow the on-screen instructions to reinstall the firmware.\n   * After the firmware installation, unplug and replug the keyboard again as instructed.\n6. **Reconfigure Your Keys**\n   * After the keyboard is recognized, you may need to set up most of your keys again.\n   * Open the GG Engine and customize your RGB settings and key configurations as needed.\n\n# Additional Tips\n\n* Downgrade your version of GG : You can also uninstall the 65 version to install the 62 how seems to work properly\n\nBy following these steps, your RGB keyboard should be working properly again.\n\nThanks to u/The_Ma1o_Ma for the sollution give in an other post !",
            "how much longer will we have to wait until we can have lights again in keyboards?",
            "Two software updates and still no firmware update/revert to fix keyboards partially bricked by faulty firmware?",
            "When will you fix the profiles? They don't switching automatically since v. 64",
            "NOVA Pro Wireless DAC screensaver when???",
            "if its not in the plan just let us know so we can buy from another brand",
            "personal mix stopped working for me in update. reverting to previous version did not fix either rip",
            "This update fix LED bug in APEX PRO yet ?",
            "Every goddamn update completely breaks my settings with this app. None of my sound channels are working, none of my audio swaps are working.",
            "Another update - another reinstall of GG software due to Sonar not switching devices based on the order that is set in the Backup Device Switch settings.\n\nI have the headphones on, but Sonar still picks up the speakers that I have on (which are the second device in the list after the headphones).\n\nProblem is - the reinstall is not helping anymore and the problem that was gone after the last reinstall is not going away. You would think that after all the complaints from users on reddit on how Sonar device switch is not working something would be done. \n\nHad a ticket with support, provided all the logs and evidence of the issues, and was told that it would be fixed in the next couple of releases. That was about 5-8 releases ago though..\n\nMaybe someone knows another workaround to get Sonar to work properly and pick up devices properly?\n\n  \nThank you"
        ]
    },
    "CHATMIX confusion ": {
        "title": "CHATMIX confusion ",
        "score": 1,
        "url": "https://www.reddit.com/r/steelseries/comments/1dr6hca/chatmix_confusion/",
        "content": "I recently bought Arctic nova 7. I play Warzone 3.\n\nhere is the problem  - I used chat mix to reduce game chat (in game). It reduce overall game volume,\n\n  \nso at 0, I hear nothing at all\n\nat 100 game and chat volume both are loud. \n\nhelp plz ",
        "num_comments": 1,
        "comments": [
            "Hello /u/nen101,\n\nThis is a reminder that /r/SteelSeries is an unofficial subreddit, and is not monitored by SteelSeries support staff. For full support or to open a ticket with our support team, please check out https://support.steelseries.com. \n\nAs a reminder to our community members: If you are assisting another user with their issues, please do you best to follow subreddit rules and be as kind and helpful as possible! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/steelseries) if you have any questions or concerns.*"
        ]
    },
    "Steelseries artic nova pro wireless audio sounds so horrible": {
        "title": "Steelseries artic nova pro wireless audio sounds so horrible",
        "score": 1,
        "url": "https://www.reddit.com/r/steelseries/comments/1dr5hw7/steelseries_artic_nova_pro_wireless_audio_sounds/",
        "content": "I don't know what I'm doing wrong. I just got these today and I spent quite sometime messing around with the settings and such to make the audio sound relatively decent but somehow, my 80$ razer blackshark just sounds SO much better. This headset barely picks up game audio, plays spotify decently, but watching videos/twitch streams it just sounds atrocious. I'm at a lost to what to do, how to make it sound okay, if I missed any settings? Because something this much $ shouldn't be outperformed by an 80$ headset.",
        "num_comments": 4,
        "comments": [
            "Hello /u/ishiOW,\n\nThis is a reminder that /r/SteelSeries is an unofficial subreddit, and is not monitored by SteelSeries support staff. For full support or to open a ticket with our support team, please check out https://support.steelseries.com. \n\nAs a reminder to our community members: If you are assisting another user with their issues, please do you best to follow subreddit rules and be as kind and helpful as possible! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/steelseries) if you have any questions or concerns.*",
            "Ok, so there’s either some sort of settings issue or you had a dodgy pair. Because I’ve got these headphones and the sound quality is pretty dam good.\n\nWhat are you using them on? How are you connecting? Have you tried different EQs? In terms of the quality being bad, can you try to describe what feels bad about that?",
            "Define why it sounds bad to you.",
            "Need to know why it’s sounds bad? No bass? Buzzing? One sided audio only. It could be broken or you could have the settings wrong. I was very underwhelmed at the out of the box sound but as soon as I tuned it to my liking in sonar it became the nicest sounding headset I’ve ever owned. Everyone prefers different sounds. I like bass heavy. I looked up a guide online and have a tune for music and a tune for gaming. Great headset."
        ]
    },
    "Arctis nova 7 ear cushions dirty (white)": {
        "title": "Arctis nova 7 ear cushions dirty (white)",
        "score": 1,
        "url": "https://www.reddit.com/r/steelseries/comments/1dr4yc9/arctis_nova_7_ear_cushions_dirty_white/",
        "content": "How do you clean your white ear cushions? Ive had them for 3 weeks and it's starting to show :/",
        "num_comments": 0,
        "comments": []
    }
}