{
    "Stellaris Space Guild - Weekly Help Thread": {
        "title": "Stellaris Space Guild - Weekly Help Thread",
        "score": 2,
        "url": "https://www.reddit.com/r/Stellaris/comments/1djo5vm/stellaris_space_guild_weekly_help_thread/",
        "content": "Welcome to this week’s Stellaris Space Guild Help Thread!\n\nThis thread functions as a gathering place for all questions, tips, bugs, suggestions, and resources for Stellaris. Here you can post quick-fire questions for things that you are confused about and answer questions to help out your fellow star voyagers!\n\n**GUILD RESOURCES**\n\nBelow you can find resources for the game. If you would like to help contribute to the resources section, please leave a comment that pings me (using \"u/Snipahar\") and link to the resource. You can also contribute by reaching me through private message or modmail. Be sure to include a short description of what you find valuable about the resource.\n\n[**Stellaris Wiki**](https://stellaris.paradoxwikis.com/Stellaris_Wiki)\n\n* Your new best friend for learning everything Stellaris! Even if you're a pro, the wiki is an uncontested source for the nitty-gritty of the game.\n\n[**Montu Plays' Stellaris 3.0 Guide Series**](https://www.youtube.com/playlist?list=PL5nBclq6WdvckE68W_Z8IOUta5qxPhrmL)\n\n* A great step-by-step beginner's guide to Stellaris. Montu brings you through the early stages of a campaign to get you all caught up on what you need to know!\n\n[**Luisian321's Stellaris 3.0 Starter Guide**](https://www.reddit.com/r/Stellaris/comments/mxgwfn/stellaris_30_starter_guide/)\n\n* The perfect place to start if you're new to Stellaris! This guide covers creating your own race, building up your economy, and more.\n\n[**ASpec's** ***How to Play Stellaris 2.7*** **Guides**](https://www.youtube.com/playlist?list=PLCEcpynDmD0rzpp6xYGtVVI-2cwfaYj_t)\n\n* This is a playlist of 7 guides by ASpec, that are really fantastic and will help you master the foundations of Stellaris.\n\n[**Stefan Anon's** ***Ultimate Tierlist*** **Guides**](https://www.youtube.com/playlist?list=PLmWvxQ8MpQPHJWuKF2T3tg7CCy94XuAbO)\n\n* This is a playlist of 8 guides by Stefan Anon, which give a deep-dive into the world of civics, traits, and origins. Knowing these is a must for those that want to maximize their play.\n\n[**Stefan Anon's** ***Top Build*** **Guides**](https://www.youtube.com/playlist?list=PLmWvxQ8MpQPFsuxYPah--KMM2XV55qxC5)\n\n* This is a playlist of an ongoing series by Stefan Anon, that lay out the game plan for several of the best builds in Stellaris.\n\n[**Arx Strategy's Stellaris Guides**](https://www.youtube.com/playlist?list=PL7oTRiQn0-67TjGz1EoWa2gLZwctfHYjq)\n\n* A series of videos on events, troubleshooting, and builds, that will be of great use to anyone that wants to dive into the world of Stellaris.\n\nIf you have any suggestions for the body of this thread, please ping me, using \"u/Snipahar\" or send me a private message!",
        "num_comments": 35,
        "comments": [
            "I forget.... I saw it in a random YT vid that I can't remember. \n\n\nHow do you change your map settings so you can quickly adjust to see what systems other empires  made claims on ",
            "How well do workers cooperative and catalytic processing work together? Wondering if it would be beneficial or otherwise good for a tall game.",
            "If I'm invited to join a war with the goal to seize a relic, do the victors share the relic or does it go to the empire who initiated the vote for war?",
            "More of a bug report than a question: FE and AE titans are going weaponless in my game for some reason. Thought it was odd there was a 0 fleet strength fleet and it turns out they arent merging the titans with their fleets and ship details shows its filled with armour pieces but no weapons.",
            "Under \"Empire Size\" and \"From Pops\" I have a new modifier that I didn't have before.  It's a 5% penalty from Bureaucracy.  It's right below my 10% bonus from Psionic Theory.  What is causing that and how do I get rid of it?",
            "I want to do one more playthrough before I take a break from Stellaris.  Looking for suggestions for a build because I have no imagination of my own :)\n\nI picked Stellaris back up a month before MA release.  Here's a some details on the plays (successful or otherwise) I have done.\n\n-Under One Rule - absolutely dominate with vassals + military federation\n\n-Basic machine ascensions with the new ones from MA for example the unity rush + virtual\n\n-Pop growth plantoid cybernetic + galactic nemesis (didn't like this one as much)\n\n-Driven Assimilators (pre MA release).  I love these guys.\n\n-Rogue Servitor (pre MA release)",
            "ok seriously can some one confirm if they fixed the dyson swarm limit yet?? like can you still only build 2? cuz i tried and it keeps canceling still.",
            "Playing virtuality and I'm pretty wide, wondering if habitats count as additional colonies and what my planet max should be.   \n\nI think I have 8 or 9 planets at the moment and a few physical pops, but not many.  Using the ascension that lowers plant empire size modifier by 50% and technophage. Should I stop getting colonies at this point?",
            "Coming back after over a year break. Playing with one friend, and wanting to do something I haven’t tried before. That is play as lithoid, try to gain vassals, and go psionic. Would it be better to pick the Teachers of the shroud origin or the one where you yeet asteroids to colonize? I plan on choosing the covenant of the strands as it helps with pop growth. Any tips or suggestions would help!",
            "Need help getting a Shattered Ring Machine non-trade focused Megacorp empire off the ground, but starting with -30ish energy deficit right off the bat has been really hard for me to combat. I do think part of my issue is wanting to colonize the other two parts as soon as I can instead of waiting until after I've colonized a planet to get generator districts going."
        ]
    },
    "Post-Humans on an Earth Tomb World?": {
        "title": "Post-Humans on an Earth Tomb World?",
        "score": 64,
        "url": "https://www.reddit.com/gallery/1dlt10t",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Knew evolved cockroaches could spawn but i've never seen human survivors before- they also have an early space station called the ISS II despite being in the stone age",
            "And they just evolved into the bronze age 👏 👏 👏  \nEdit: got that event with the rogue scientist and they've been catapulted into the industrial age",
            "Fallout",
            "this is just regular early-space earth being hit with nuclear war or asteroid, not the actual cockroach post-apocalypse earth.",
            "It happens if at the start of the game, humans are early space age and then nuke themselves along the way.",
            "Fallout 5",
            "Well, maybe a nuclear apocalypse happened sometime at the end of the 21st century and humanity built ISS II instead of the first. \n\nThen there was a nuclear war and although humanity on the surface returned to the stone age, the crew of the station managed to survive.\n\nI hope you will not enslave or exterminate them. \nI hope you uplift them instead of this.",
            "This is great! Perhaps with the help of this scientist, they will be able to become an interstellar civilization before the endgame!",
            "More special if anything",
            "I always thought post-apocalypse earth defaulted to spawning cockroaches but this is also a pleasant surprise.\n\nNo promises on the uplifting tho- we'll see how it goes :)"
        ]
    },
    "What kind of world would you build here?": {
        "title": "What kind of world would you build here?",
        "score": 68,
        "url": "https://i.redd.it/e2k1r7qhr28d1.png",
        "content": "",
        "num_comments": 39,
        "comments": [
            "Depends on what features the planet has but probably an industrial world unless you need goods (factory world) or alloys (forge world) specifically",
            "~~Well, look at that lovely ocean. People can go diving or sunbathe. The fish would be so fresh!~~\n\nForge world.",
            "Unless you have mods, definitely forge world.",
            "Planet has 26 district spots. What planet type would you recommend?",
            "Forge world unless you really need a factory world.",
            "Forge ecu if possible. Alternatively, unity ecu if you're aiming for all edicts",
            "Why do you districts sit on the left hand side?  \nMine sit along the middle of the screen under the image",
            "You mean “what would you attempt to build only to derail halfway through as you realize you need consumer goods/ alloys/ power”?",
            "That's an easy forge/factory world.\n\nPlanets with a lot of 1 resource become dedicated to that, small planets with no resources become tech/unity/refinery/fort worlds, large worlds with no resources become forge/factory worlds.",
            "Walmart"
        ]
    },
    "How do people get minerals without any miners?": {
        "title": "How do people get minerals without any miners?",
        "score": 286,
        "url": "https://www.reddit.com/r/Stellaris/comments/1dldu3r/how_do_people_get_minerals_without_any_miners/",
        "content": "I keep seeing many high-level players talk about never employing worker jobs, which seems sensible: food from starbases, energy from traders, minerals from... well, where DO the minerals come from?\n\nI've seen guides that say your first few planets should be research, forge, factory, etc. with generator districts on them but, uh, where are all the minerals to support the forge and factory worlds??? Those suckers require a LOT of minerals, and you can only buy around 42 minerals per month before the price starts skyrocketing to unreasonable levels, and that's only enough to finance like.. 3 or 4 industrial districts. Nowhere near enough if you need alloys AND cg. Of course you can offset that by selling excess consumer goods and food but it'll keep rising basically forever and eventually get to an unsustainable level. Is there some kind of trick to all this I don't know about? The easy answer is vassalization of course but that requires you to be a decent amount of years into the game, as well as having already financed a very large fleet, which then creates a chicken or the egg problem. Am I missing something obvious or do people just make mineral worlds and not talk about it?\n\nEdit: sorry, i should have specified the main issue is early game before you can start taxing vassals or making arc furnaces!",
        "num_comments": 113,
        "comments": [
            "Probably grand admiral players making vassals pay them basic resources.\n\nU can milk a lot from vassals late game. Barely even need mining worlds. Tho i play heavily modded now. Idk what vanillas like any more since 3.9 for GA",
            "Mining stations for one thing, especially after getting an Arc Furnace or two set up.",
            "You can get plenty of minerals from space, especially with Astro-Mining Drones civic, arc furnaces and a cybrex mining hub if you're lucky enough to get it.\n\nAlternatively,  you can be a Worker Cooperative and convert trade value into minerals and food.",
            "- Space. Especially wide empires typically have lots of space with mining stations, and there are lots of techs and traditions to boost that.\n\n- Vassals. If you are meta gaming, vassals are the way to go.\n\n- Galactic market. It’s often profitable to buy minerals, press them into alloys, then sell.\n\n- Trade. You can trade ten rare resources for hundreds of raw resources",
            "Ai gets absurd bonus for basic production if you can get only a little bit of this ressources you have enough to be worker free. Second Idea Trade heavy empires get consumer goods from trade and can funnel all the minerals from space station in to alloys or buy more. Notabally you dont use the clerk jobs because they are grbage only the specalist and leader variations. So they answer is space station market and some districts till you get your first vassals",
            "Catalytic processing FTW.",
            "I personally like a workers coop for my workers free needs",
            "I prefer getting my food and cg from farms, unity from trade, ec from trade, and alloys and sr from food. and minerals? i barely need em but i can buy em",
            "As a tall plantoid megacorporation with catalytic processing, mining stations, vassal contracts, and galactic market trades when necessary. I find I am almost always in a massive surplus of minerals.",
            "It's kindof a shame the game is like this IMO. Like a ton of the games bonuses synergies and flavour are set up as if workers and specialists are both equally important parts of your economy, or at least in a similar ballpark. But there's just so many things that make this not the case.\n\nThe most obvious is vassal taxing (shaped by the AI overusing workers a tad) but there's also the fact that the planetary specialisation bonus reduces minerals needed for CGs and alloys and the fact that % buffs to CG/alloy output mena you need less minerals per CG/alloy than you did before aaaaand there's the fact that you can get a tone of minerals and energy from space but comparatively far less alloys and no CGs.\n\nThere's a lot stacked up all making specialists and synergies with them faaar more important to your economy.\n\nI kinda wish buffs to CGs and alloys got the same treatment many research buffs got, where the upkeep and output scale together. The buffs would still be valuable as it would let each specialist process more material per month, but it would mean that % buffs didn't make you produce alloys with less and less minerals as you got deeper into the game. Might stop the massive relevency dropoff workers have and make things like mining guilds more meaningful."
        ]
    },
    "Had to stand up out of my chair and celebrate after seeing this.": {
        "title": "Had to stand up out of my chair and celebrate after seeing this.",
        "score": 18,
        "url": "https://www.reddit.com/gallery/1dlt580",
        "content": "",
        "num_comments": 6,
        "comments": [
            "R5: Probably one of my best spawns ever in terms of ruined megastructures. Science array, interstellar assembly, and sentry array all in one.",
            "Update: just found a ring world",
            "Wish we had world spawn seed systems like minecraft or other games, ya know?",
            "What Lotto numbers did you use today?",
            "I presume you’re also Arc Welders?",
            "You know it."
        ]
    }
}