{
    "The Ultimate Step 1 Guide": {
        "title": "The Ultimate Step 1 Guide",
        "score": 360,
        "url": "https://www.reddit.com/r/step1/comments/1bcsp3p/the_ultimate_step_1_guide/",
        "content": "# WELCOME!\n\nA lot of students ask the same questions, so I created this guide to help everyone out. If you have something to add please let me know. Happy studying!\n\n### What is USMLE Step 1?\n\nIn the past, USMLE Step 1 was the crucial exam for med students. While it's now pass/fail, it remains a tough test that demands serious preparation. Passing is essential, and the skills you develop here will benefit you for Step 2 and Step 3. **Tldr- Take Step 1 seriously.**\n\n### What is the format of Step 1?\n\nThe exam is held over one day, divided into seven 60-minute blocks. It's an 8-hour session, with an optional 15-minute tutorial and 45 minutes of break time included. Each block contains a varying number of questions, up to a maximum of 40, with a total of no more than 280 questions on Step 1. \n\nYou can run the [Step 1 interactive testing experience here](https://orientation.nbme.org/Launch/USMLE/STPF1), to get used to the test software prior to taking the exam. It’s the same interface as UWorld/Bootcamp/any big question bank.\n\n### How many questions do I need to answer correctly to pass?\n\nThe USMLE doesn’t release this data, but based on historical norms and the new passing standard of 196, you need to score higher than the lowest 5th percentile of students. That usually comes out to answering \\~60% of the questions correctly. \n\n### When should I start preparing?\n\nYou should’ve been preparing through M1/M2. Most schools give you a dedicated study period in your 4th semester to pass the exam, so you want to start studying heavier in the 6 months leading up to that.\n\n### What are the best resources for Step 1?\n\nThis guide does not favor one product over another, and the price tag doesn't necessarily reflect the quality. These resources have been effective for many students and are provided to assist you in making informed choices.\n\n#### Most popular resources for Step 1\n\n1. [UWorld:](https://www.uworld.com/step1/step1_qbank.aspx) Popular qbank with good explanations and images. Some questions can be harder than the real exam, but good practice.\n2. [Med School Bootcamp](https://bootcamp.com/med-school): A well-rounded resource for Step 1 prep. Has both great video lessons and a qbank similar to Step 1.\n3. [First Aid](https://www.mhprofessional.com/usmle): Great for a high-level, high-yield overview of target areas for review. As valuable as it is, First Aid is not recommended as a stand-alone resource. Also if you like books, this is the best option.\n4. [Anking](https://www.ankihub.net/step-deck): If you swear by Anki, this is the deck for you. It’s worth the $5 to get the latest deck.\n5. [Pathoma](https://www.pathoma.com/): Video lessons covering high yield pathology. Step 1 has gotten progressively harder so it’s good for a high level overview, but Ch. 1-3 is still a helpful refresher on core concepts. All content is covered in other resources.\n6. [NBME Self-Assessments](https://www.nbme.org/examinees/self-assessments): Web based self assessments. Do these towards the end of your dedicated period. You want to be scoring 65%+ consistently to pass.\n7. [NBME Free 120](https://orientation.nbme.org/Launch/USMLE/STPF1): Everyone should do this before their exam. [Review the explanations here](https://bootcamp.com/blog/new-free-120-nbme-step-1-explanations) after.\n8. [Sketchymedical:](https://www.sketchy.com/) Good for visual learners. Mostly known for its microbiology series. Pharm/path series have mixed reception.\n9. [Amboss](https://www.amboss.com/us): Top contender to UW, but also adds a library so you can look up anything. I recommend downloading their Anki extension.\n10. [Boards and Beyond:](https://www.boardsbeyond.com/homepage) Decent video review source, although some videos look a little outdated. Step 1 qbank quality is a bit of a miss, but good practice after watching the video.\n11. [Pixorize](https://pixorize.com/): A visual mnemonic series for biochemistry, microbiology, immunology, and pharmacology, similar to Sketchy. Recommended mostly for biochem. \n12. [Lecturio:](https://www.lecturio.com/medical/usmle-step-1-qbank/) Some people use this for classes, but not really used for Step 1.\n\n#### YouTube Channel Recommendations\n\n1. [Dirty Medicine](https://www.youtube.com/c/DirtyMedicine?app=desktop): Known for excellent biochemistry videos and mnemonics.\n2. [Randy Neil biostatistics](https://www.youtube.com/playlist?list=PLuyQGqW98Zlsm4MInaD2LJCub8i9D3pms): Good playlist covering biostats.\n3. [Ninja Nerd Official](https://www.youtube.com/@NinjaNerdOfficial): Goes into a ton of detail, better for classes.\n4. [Med School Moose](https://www.youtube.com/@MedSchoolMoose): Good for buzzwords and HY Images.\n\n### Quick tips on Step 1 strategy\n\n* Read the last sentence of the question first. Sometimes, that’s all you need to answer the question, and the rest of the information is fluff.\n* Pay attention to any histology, pathology, tumor markers, high confidence evidence, etc. This will usually override any vague/conflicting clinical information in the question.\n* Your first answer is probably right. Avoid changing answers unless you are 100% sure.\n* “Which of the following is a risk factor for x…” the answer is smoking.\n* If the disease is lasting months and there’s weight loss, it’s cancer. UNLESS if you suspect GI involvement, then it could be a bunch of things.\n* If you can’t interpret the media questions (ex. heart sounds), you can probably answer the question without it. Look at the case history for clues.\n* About 15-20% of your questions will be experimental (unscored) questions. So don’t get stuck on the impossibly hard questions, make your best guess and move on.\n\n### Step 1 Study Schedules\n\n* [9-week study schedule](https://bootcamp.com/blog/9-week-step-1-study-schedule) from Bootcamp, they have a system-based schedule too.\n* [10-week study schedule ](https://elitemedicalprep.com/the-ultimate-10-week-step-1-study-schedule/)from Elite Medical Prep\n\n### Passed posts from the P/F era\n\n* [Unconventional prep: Passed Step 1 using ONLY Bootcamp + Sketchy + UW primarily. Did NOT use First Aid AT ALL.](https://www.reddit.com/r/step1/comments/1b6ygm9/unconventional_prep_passed_step_1_using_only/?utm_source=share&utm_medium=web2x&context=3)\n* [4 Month Dedicated Step 1 Prep Schedule Breakdown ](https://www.reddit.com/r/step1/comments/175g6mu/passed_my_step_1_4_month_journey/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n* [PASSED!! You can do it too](https://www.reddit.com/r/step1/comments/wlwpif/passed_you_can_do_it_too/)\n* [I passed with <55% NBME!!!](https://www.reddit.com/r/step1/comments/16hljrj/i_passed_with_55_nbme/)\n* [Passed Step 1 with resource breakdown, study methods and advice (long post)](https://www.reddit.com/r/step1/comments/yyt6ay/passed_step_1_my_journey_advice_long_post/?utm_source=share&utm_medium=web2x&context=3)\n* [IMG Step 1 Journey, PASS](https://www.reddit.com/r/step1/comments/19ffsze/passed_dare_to_believe/)\n* [Passed Step with low UWSAs + Resource Breakdown](https://www.reddit.com/r/step1/comments/1ar7q9o/passed_with_really_low_uwsas/)\n* [11 Month Prep for Step 1, resource breakdown with study methods](https://www.reddit.com/r/step1/comments/1765lpc/heres_how_i_passed_without_basic/)\n* [Write-Up on Stats, Sources, Exam Thoughts, and Advice.](https://www.reddit.com/r/step1/comments/130qyhz/passed_yesterday_entire_writeup_on_stats_sources/)\n* [Passed Step 1 with 4 resources!](https://www.reddit.com/r/step1/comments/14f2dqi/passed_step_1_with_4_resources/)\n\n#### When do I get my Step 1 results?\n\nUsually, you'll get your exam results within 2–4 weeks after completion. If you pass, you won't receive specific feedback on the content. If you fail, you'll receive details on how close you were to passing, along with feedback on the content.\n\nScores for all USMLE Step exams are usually released on Wednesdays. [Check USMLE announcements](https://www.usmle.org/announcements) for possible score result delays.\n\nYour permit will disappear on Sunday/Monday before an expected Wednesday score release on the NBME website (or OASIS if you’re IMG). Or your permit will disappear when your eligibility ends, whichever happens first.\n\n‘Permit disappear’ means the print button is gone. If you see the print button, your permit has not disappeared.\n\n📌 Feel free to message the mods if you want anything added to this sticky thread.",
        "num_comments": 126,
        "comments": [
            "Way to go mods! Love how comprehensive the guide is!",
            "Using bootcamp, are all the pathoma chapters essential?",
            "Perfect. Someone please get the mods of the IMG Reddit to see this and pin it on their sub",
            "Can't emphasize enough to take it seriously! Too many people failed when it went pass/fail for being too lax.",
            "This is great! Really appreciate the hard work you guys are doing. \n\nMight I suggest, a mega thread for UW know how and other tips? So many people always ask how to use UW, blah blah and so many people slept on the amazing features available on uworld like the analysis section, the charts etc, keeping track of average time spent per question and also noting how many times the user changed the answers and what category (wrong to wrong, wrong to correct, correct to wrong). \n\nThe last one really helped me understand that I tend to change wrong answers to correct ones most of the time based on my stats so I continued the approach in my NBMEs and the exam itself.",
            "Very wholesome & comprehensive, thank you!",
            "Thank you so very much for this!",
            "Thanks for the info! 🔥",
            "Would you mind adding any podcasts that you recommend to this? All of these are great, but I love finding ways to maximize my efficiency so I end of doing podcasts and stuff while I’m cooking or at the gym. I’m currently listening to Daddy Goljan and Spoonful of Sugar which are both great, but I’d love to know if there are any that are regarded as absolute top tier",
            "Does permit disappearing mean you passed?"
        ]
    },
    "Weekly Step 1 Discussion Thread": {
        "title": "Weekly Step 1 Discussion Thread",
        "score": 6,
        "url": "https://www.reddit.com/r/step1/comments/1dn9vfk/weekly_step_1_discussion_thread/",
        "content": "This is a thread where you can discuss Step 1, anything that is related to step 1 preparation & studying. Need to vent? Maybe help deciding on a resource? Or questions about step application and exam day. This thread is a freedom wall. Just make sure to still follow the community rules. \n\nFor pass posts and questions that require a longer discussion/thread feel free to make a separate post. This weekly thread is only for cutting down posts that can be easily answered by yes/no etc.",
        "num_comments": 30,
        "comments": [
            "Set up some automod filters on *\"Am I ready posts\"* & *\"when are the results\"* these types of post will be redirected here and is also encouraged to be posted here. We will start removing posts similar to this to remove sub content clutter.",
            "I just received my results and I failed. I will try again though so any advice is welcomed. I am a mom of a 16 month old daughter, IMG, and with a lot of grit. I was under prepared for the exam and I had some pressure from my family to take this exam knowing I wasn’t prepared enough for it. I only took NBME 26 and I had a 50% and I didn’t even finish uworld which I only did 46% with  $54% average. My exam was high on communication and I did good in cardio, biostatistics, and biochem and genetics. I need to tackle down my foundations. I also did all lectures of boards and beyond. What should I do now? Just questions? Or what do you recommend? Thank you 🙏",
            "6/11 - Got the P an hour ago. Felt like I failed coming out of it so much I started studying for a retake afterwards lol. Mid nbmes (63-68% range across all 28-31), 52% uworld completion at 72%, Free 120 78%. Can’t tell what’s harder, the studying up to the test or the wait afterwards. Only thing I will say is to trust your NBME pass predictions. There’s gonna be some whack ass questions on the real thing, chances are they’re experimental, don’t let them trip you up, just do your best and move on. \n\nAmp yourself up, get yourself pumped, and kill the thing. You’ve got this.",
            "Vent mostly-- if I get a score that tells me I have over a 90% chance of passing on an NBME, that should be good enough for me to take the exam. I shouldn't have to get a 99% chance of passing on a practice exam to feel secure. Idk. I'm just irritated at the chance of passing percentages not really meaning much.",
            "Any tips for surviving the 3 week wait for results?? The wait is agonizing 😫",
            "NBMEs in the low 60s, 61% and 63% on form 30 and 31, respectively, 90% and 93% chance to pass respectively, free 120 upper 50s, one question away from a 60.\nAll these tests were within the week of my exam.\n\nTest is this Wednesday. Has my tests shown im both accurate and precise and okay to test this week?\nPlanning to sit on Wednesday (2 days from now)",
            "is giving new free120 3 days out okay and safe ? serving guessing because most of the people i knew irl gave it like a week before the exam",
            "How do you stay focused? Like everyone says “do 100 questions a day,” or any number really but it’s like how do you just keep going? Something’s off and I kinda feel like people are hate keeping. I can barely make it through a block.",
            "did any 6/15 test takers get their results or is that going to come after the july 4th week?",
            "I recently got my results of step 1 and it did not turn out good. \nI had read FA and given NBMES 26 to 31 with free new 120 and UWSA 1 and 2.\nOne of the problems that I am facing is that while solving questions I am able to recognize the content but I am unable to reach the diagnosis. I find myself in between 2 of them. I get confused. \nI have started reading again but am lost.\nKindly help. \nI am really worried."
        ]
    },
    "SGU Cheating": {
        "title": "SGU Cheating",
        "score": 7,
        "url": "https://i.redd.it/bmam5fvqnf9d1.jpeg",
        "content": "Step 1\n",
        "num_comments": 6,
        "comments": [
            "Students are going to learn the hard way when NBME will void their score for suspicion of cheating. It’s going to happen just like Nepal",
            "I’m confused, isn’t this similar to those offline nbme floating around that people take as practice?",
            "there’s a lot of cheaters everywhere. You should prolly delete this and worry about your own self. Nbme isn’t stupid. They have many diff ways of finding out.",
            "The exams came directly from an SGU test site for the NBME CBSE. The coverups that go on at this school are unimaginable. Looking forward to that NBME investigation",
            "This was provided by SGU admin to select students to increase pass rates",
            "The point is to expose SGU's corrupt administration not to help them cover it up"
        ]
    },
    "Girlfriend vs step1": {
        "title": "Girlfriend vs step1",
        "score": 13,
        "url": "https://www.reddit.com/r/step1/comments/1dqvg6e/girlfriend_vs_step1/",
        "content": "Hi guys\nI'm in my dedicated and can't study because my girlfriend keeps threatening with breaking up, we are dating for 5 years since starting med school and i love her so much, we  considered being engaged in this summer but i don't understand what happened. \nShe is keeping saying that I'm not into the engagement because i prioritized passing step 1 before it. \nI'm in my dedicated and don't know what to do, shall i delay the exam which I'm studying for 1 year or what? Am i bad person because I'm studying? ",
        "num_comments": 28,
        "comments": [
            "I think if she doesn’t understand she won’t understand everything it take to pass the residency etc so … the sooner the later. \nLeave  her",
            "You still have step2 step3 residency fellowship the journey is long my friend let her go the road is already a pain in the ass.",
            "Step 1 is for you! Yourself! On your own! Which no one will take away from you. Prioritize yourself and your efforts then someone else.",
            "Dump her!",
            "leave now!",
            "I think she should understand that just bc it’s p/f does NOT mean its easy. Maybe make her take a practice test herself before she starts judging you for spending time STUDYING, which is what ur SUPPOSED TO DO in med school ???",
            "Rn its step 1..later it would be step 2 and then residency..remember..break up is better than getting a divorce..at least you won’t have to pay alimony",
            "Same threats same exam medical student. I thought I took care of the additional stress. But the good times sometimes come to haunt me as professor Sattar’s voice fades in the background. But atleast I only have one problem now i guess.",
            "Seen a few of these posts lately. I was here (exactly here, down to the engagement) and I did a break up during dedicated. I'll say the same thing I've said on the others- If she calls it off, then that's on her. She couldn't take it, it's not your fault, lots of people can't, be glad you found out before you got engaged or married because the time and dedication doesn't stop after step 1. You're working on a future right now, one that she currently stands to benefit from. Your partner should be supporting you through this in every way possible, no exceptions. A lot of people will say you just need to leave her. I agree, but don't don't just yet. \n\n\nRight now, you have one objective- pass. I know it's hard, but you just gotta put the relationship on a back burner, don't fight, don't deal with the engagement, don't give any of it the time of day, and don't feel guilty. Just pacify as much as possible. If you've got to stay somewhere else so you can focus, that's totally okay- go stay with your family or whoever you have. I'd avoid going through a breakup during dedicated if you can. It can be devastating to your ability to study. Wait until after you've passed, then consider if a person that refuses to be supportive of you during your time of need is really someone you can trust to be with for the rest of your life. If not, then shortly after step is a good time to call it. If she decides to break it off now- get it done fast, separate the stuff, then block her. Any communication after it's done is only going to take way more time and distract you more. I know it sucks, but if you let it get to you, it'll get a lot worse. She can walk away completely unscathed if she'd like, but if you let her mess with your ability to move forward in your career, you take damage regardless of if you two stay together or not. ",
            "Have a talk with her. If she doesn't understand Leave her.\n\n\nLife is tough. \nThere are going to be times where you won't be able to give her time, love and care, a person deserves, and there will be times when she won't be able to do so.\n\n\nPartners are partners for tough times too, they need to understand this.  \n\n\n We need people more when we are going through rough times, good times well, if you offer me a beer and a party, why would I or anyone say no? (Except if they also are in their dedicated period 😂) "
        ]
    },
    "Passed 🎉🎉": {
        "title": "Passed 🎉🎉",
        "score": 51,
        "url": "https://www.reddit.com/r/step1/comments/1dqiui9/passed/",
        "content": "Hello everyone as u can tell from the title I got my P 2 days ago. \n\nOverall the exam was easier than I thought, soo many ethics and communication and risk factors questions and little biochemistry and immuno.\n\nI used FA read it like 10 times, uworld 60% complete at 60% correct and finally all the mehlman content from pdfs to modules to youtube videos. \n\nMy self assessment scores were:\nOld Free120: 67% (baseline at 2 months out)\nNBME 25: 71%\nNBME 26: 72% \nNBME 27: 74% \nNBME 28: 71% \nNBME 29: 73% \nNBME 30: 70.5% \nNBME 31: 78% (1 week out)\nNew Free120: 78% (2 days out) \n\nOverall the exam was similar to the free120 in terms of stem length, same exact NBME wording also got 3 image repeats from NBMEs \n\nGood luck feel free to reach out for any help \nMy insta: @naserrrv\n\n",
        "num_comments": 44,
        "comments": [
            "Would u say mehlmans risk factor pdf is useful for the exam?",
            "Reading fa 10x is wild",
            "I’m new to this, so can you please tell me what the “risk factors” is everyone refers to?\nThank you",
            "Which NBME do u recommend to do first?",
            "did u use any video lecture resources?",
            "Much congrats 🥳 what resources did u use aside from UW and FA? How did u prepare for ethics? ",
            "Congratulations 🎊",
            "Congrats! You had great practice scores as well!!",
            "Congrats on ur P 👏. Ik it’s probably the silliest question but where can I get the Mehlman PDFs?",
            "Congratulations on the P. Just curious are all the high yield and low yield are form FA, because many students say that exam is tough is it is because the stems are long or what's the reason? After completing uworld will it be best to just rely on NBME( are all the questions tested in the real deal is similar to NBME concepts) I am asking this because some are saying that exam is tougher than uworld it's scaring me a lot"
        ]
    }
}