{
    "The Ultimate Step 1 Guide": {
        "title": "The Ultimate Step 1 Guide",
        "score": 361,
        "url": "https://www.reddit.com/r/step1/comments/1bcsp3p/the_ultimate_step_1_guide/",
        "content": "# WELCOME!\n\nA lot of students ask the same questions, so I created this guide to help everyone out. If you have something to add please let me know. Happy studying!\n\n### What is USMLE Step 1?\n\nIn the past, USMLE Step 1 was the crucial exam for med students. While it's now pass/fail, it remains a tough test that demands serious preparation. Passing is essential, and the skills you develop here will benefit you for Step 2 and Step 3. **Tldr- Take Step 1 seriously.**\n\n### What is the format of Step 1?\n\nThe exam is held over one day, divided into seven 60-minute blocks. It's an 8-hour session, with an optional 15-minute tutorial and 45 minutes of break time included. Each block contains a varying number of questions, up to a maximum of 40, with a total of no more than 280 questions on Step 1. \n\nYou can run the [Step 1 interactive testing experience here](https://orientation.nbme.org/Launch/USMLE/STPF1), to get used to the test software prior to taking the exam. It’s the same interface as UWorld/Bootcamp/any big question bank.\n\n### How many questions do I need to answer correctly to pass?\n\nThe USMLE doesn’t release this data, but based on historical norms and the new passing standard of 196, you need to score higher than the lowest 5th percentile of students. That usually comes out to answering \\~60% of the questions correctly. \n\n### When should I start preparing?\n\nYou should’ve been preparing through M1/M2. Most schools give you a dedicated study period in your 4th semester to pass the exam, so you want to start studying heavier in the 6 months leading up to that.\n\n### What are the best resources for Step 1?\n\nThis guide does not favor one product over another, and the price tag doesn't necessarily reflect the quality. These resources have been effective for many students and are provided to assist you in making informed choices.\n\n#### Most popular resources for Step 1\n\n1. [UWorld:](https://www.uworld.com/step1/step1_qbank.aspx) Popular qbank with good explanations and images. Some questions can be harder than the real exam, but good practice.\n2. [Med School Bootcamp](https://bootcamp.com/med-school): A well-rounded resource for Step 1 prep. Has both great video lessons and a qbank similar to Step 1.\n3. [First Aid](https://www.mhprofessional.com/usmle): Great for a high-level, high-yield overview of target areas for review. As valuable as it is, First Aid is not recommended as a stand-alone resource. Also if you like books, this is the best option.\n4. [Anking](https://www.ankihub.net/step-deck): If you swear by Anki, this is the deck for you. It’s worth the $5 to get the latest deck.\n5. [Pathoma](https://www.pathoma.com/): Video lessons covering high yield pathology. Step 1 has gotten progressively harder so it’s good for a high level overview, but Ch. 1-3 is still a helpful refresher on core concepts. All content is covered in other resources.\n6. [NBME Self-Assessments](https://www.nbme.org/examinees/self-assessments): Web based self assessments. Do these towards the end of your dedicated period. You want to be scoring 65%+ consistently to pass.\n7. [NBME Free 120](https://orientation.nbme.org/Launch/USMLE/STPF1): Everyone should do this before their exam. [Review the explanations here](https://bootcamp.com/blog/new-free-120-nbme-step-1-explanations) after.\n8. [Sketchymedical:](https://www.sketchy.com/) Good for visual learners. Mostly known for its microbiology series. Pharm/path series have mixed reception.\n9. [Amboss](https://www.amboss.com/us): Top contender to UW, but also adds a library so you can look up anything. I recommend downloading their Anki extension.\n10. [Boards and Beyond:](https://www.boardsbeyond.com/homepage) Decent video review source, although some videos look a little outdated. Step 1 qbank quality is a bit of a miss, but good practice after watching the video.\n11. [Pixorize](https://pixorize.com/): A visual mnemonic series for biochemistry, microbiology, immunology, and pharmacology, similar to Sketchy. Recommended mostly for biochem. \n12. [Lecturio:](https://www.lecturio.com/medical/usmle-step-1-qbank/) Some people use this for classes, but not really used for Step 1.\n\n#### YouTube Channel Recommendations\n\n1. [Dirty Medicine](https://www.youtube.com/c/DirtyMedicine?app=desktop): Known for excellent biochemistry videos and mnemonics.\n2. [Randy Neil biostatistics](https://www.youtube.com/playlist?list=PLuyQGqW98Zlsm4MInaD2LJCub8i9D3pms): Good playlist covering biostats.\n3. [Ninja Nerd Official](https://www.youtube.com/@NinjaNerdOfficial): Goes into a ton of detail, better for classes.\n4. [Med School Moose](https://www.youtube.com/@MedSchoolMoose): Good for buzzwords and HY Images.\n\n### Quick tips on Step 1 strategy\n\n* Read the last sentence of the question first. Sometimes, that’s all you need to answer the question, and the rest of the information is fluff.\n* Pay attention to any histology, pathology, tumor markers, high confidence evidence, etc. This will usually override any vague/conflicting clinical information in the question.\n* Your first answer is probably right. Avoid changing answers unless you are 100% sure.\n* “Which of the following is a risk factor for x…” the answer is smoking.\n* If the disease is lasting months and there’s weight loss, it’s cancer. UNLESS if you suspect GI involvement, then it could be a bunch of things.\n* If you can’t interpret the media questions (ex. heart sounds), you can probably answer the question without it. Look at the case history for clues.\n* About 15-20% of your questions will be experimental (unscored) questions. So don’t get stuck on the impossibly hard questions, make your best guess and move on.\n\n### Step 1 Study Schedules\n\n* [9-week study schedule](https://bootcamp.com/blog/9-week-step-1-study-schedule) from Bootcamp, they have a system-based schedule too.\n* [10-week study schedule ](https://elitemedicalprep.com/the-ultimate-10-week-step-1-study-schedule/)from Elite Medical Prep\n\n### Passed posts from the P/F era\n\n* [Unconventional prep: Passed Step 1 using ONLY Bootcamp + Sketchy + UW primarily. Did NOT use First Aid AT ALL.](https://www.reddit.com/r/step1/comments/1b6ygm9/unconventional_prep_passed_step_1_using_only/?utm_source=share&utm_medium=web2x&context=3)\n* [4 Month Dedicated Step 1 Prep Schedule Breakdown ](https://www.reddit.com/r/step1/comments/175g6mu/passed_my_step_1_4_month_journey/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n* [PASSED!! You can do it too](https://www.reddit.com/r/step1/comments/wlwpif/passed_you_can_do_it_too/)\n* [I passed with <55% NBME!!!](https://www.reddit.com/r/step1/comments/16hljrj/i_passed_with_55_nbme/)\n* [Passed Step 1 with resource breakdown, study methods and advice (long post)](https://www.reddit.com/r/step1/comments/yyt6ay/passed_step_1_my_journey_advice_long_post/?utm_source=share&utm_medium=web2x&context=3)\n* [IMG Step 1 Journey, PASS](https://www.reddit.com/r/step1/comments/19ffsze/passed_dare_to_believe/)\n* [Passed Step with low UWSAs + Resource Breakdown](https://www.reddit.com/r/step1/comments/1ar7q9o/passed_with_really_low_uwsas/)\n* [11 Month Prep for Step 1, resource breakdown with study methods](https://www.reddit.com/r/step1/comments/1765lpc/heres_how_i_passed_without_basic/)\n* [Write-Up on Stats, Sources, Exam Thoughts, and Advice.](https://www.reddit.com/r/step1/comments/130qyhz/passed_yesterday_entire_writeup_on_stats_sources/)\n* [Passed Step 1 with 4 resources!](https://www.reddit.com/r/step1/comments/14f2dqi/passed_step_1_with_4_resources/)\n\n#### When do I get my Step 1 results?\n\nUsually, you'll get your exam results within 2–4 weeks after completion. If you pass, you won't receive specific feedback on the content. If you fail, you'll receive details on how close you were to passing, along with feedback on the content.\n\nScores for all USMLE Step exams are usually released on Wednesdays. [Check USMLE announcements](https://www.usmle.org/announcements) for possible score result delays.\n\nYour permit will disappear on Sunday/Monday before an expected Wednesday score release on the NBME website (or OASIS if you’re IMG). Or your permit will disappear when your eligibility ends, whichever happens first.\n\n‘Permit disappear’ means the print button is gone. If you see the print button, your permit has not disappeared.\n\n📌 Feel free to message the mods if you want anything added to this sticky thread.",
        "num_comments": 126,
        "comments": [
            "Way to go mods! Love how comprehensive the guide is!",
            "Using bootcamp, are all the pathoma chapters essential?",
            "Perfect. Someone please get the mods of the IMG Reddit to see this and pin it on their sub",
            "Can't emphasize enough to take it seriously! Too many people failed when it went pass/fail for being too lax.",
            "Very wholesome & comprehensive, thank you!",
            "Thank you so very much for this!",
            "Thanks for the info! 🔥",
            "Would you mind adding any podcasts that you recommend to this? All of these are great, but I love finding ways to maximize my efficiency so I end of doing podcasts and stuff while I’m cooking or at the gym. I’m currently listening to Daddy Goljan and Spoonful of Sugar which are both great, but I’d love to know if there are any that are regarded as absolute top tier",
            "Does permit disappearing mean you passed?",
            "Great tips! Thanks for write up."
        ]
    },
    "Weekly Step 1 Discussion Thread": {
        "title": "Weekly Step 1 Discussion Thread",
        "score": 6,
        "url": "https://www.reddit.com/r/step1/comments/1dn9vfk/weekly_step_1_discussion_thread/",
        "content": "This is a thread where you can discuss Step 1, anything that is related to step 1 preparation & studying. Need to vent? Maybe help deciding on a resource? Or questions about step application and exam day. This thread is a freedom wall. Just make sure to still follow the community rules. \n\nFor pass posts and questions that require a longer discussion/thread feel free to make a separate post. This weekly thread is only for cutting down posts that can be easily answered by yes/no etc.",
        "num_comments": 30,
        "comments": [
            "Set up some automod filters on *\"Am I ready posts\"* & *\"when are the results\"* these types of post will be redirected here and is also encouraged to be posted here. We will start removing posts similar to this to remove sub content clutter.",
            "I just received my results and I failed. I will try again though so any advice is welcomed. I am a mom of a 16 month old daughter, IMG, and with a lot of grit. I was under prepared for the exam and I had some pressure from my family to take this exam knowing I wasn’t prepared enough for it. I only took NBME 26 and I had a 50% and I didn’t even finish uworld which I only did 46% with  $54% average. My exam was high on communication and I did good in cardio, biostatistics, and biochem and genetics. I need to tackle down my foundations. I also did all lectures of boards and beyond. What should I do now? Just questions? Or what do you recommend? Thank you 🙏",
            "6/11 - Got the P an hour ago. Felt like I failed coming out of it so much I started studying for a retake afterwards lol. Mid nbmes (63-68% range across all 28-31), 52% uworld completion at 72%, Free 120 78%. Can’t tell what’s harder, the studying up to the test or the wait afterwards. Only thing I will say is to trust your NBME pass predictions. There’s gonna be some whack ass questions on the real thing, chances are they’re experimental, don’t let them trip you up, just do your best and move on. \n\nAmp yourself up, get yourself pumped, and kill the thing. You’ve got this.",
            "Vent mostly-- if I get a score that tells me I have over a 90% chance of passing on an NBME, that should be good enough for me to take the exam. I shouldn't have to get a 99% chance of passing on a practice exam to feel secure. Idk. I'm just irritated at the chance of passing percentages not really meaning much.",
            "Any tips for surviving the 3 week wait for results?? The wait is agonizing 😫",
            "is giving new free120 3 days out okay and safe ? serving guessing because most of the people i knew irl gave it like a week before the exam",
            "How do you stay focused? Like everyone says “do 100 questions a day,” or any number really but it’s like how do you just keep going? Something’s off and I kinda feel like people are hate keeping. I can barely make it through a block.",
            "did any 6/15 test takers get their results or is that going to come after the july 4th week?",
            "Brutal test today. Very low yield and most of it was just focused on 2-3 systems. I was averaging 80s on NBME 27 - 31 so my confidence got demolished.",
            "Hey everyone, I had a quick question about Step 1 prep courses. I know all the resources people recommend (pathoma, bnb etc) but I really need a program or some structure for step 1 prep and would really love to be able to do a course or program for step 1. I’m 7 months from when I have to take step 1 and want to get started on a course that would preferably span over a few months, does anyone have any recommendations or good programs they had good experiences with? I would greatly appreciate any advice, thank you so much!"
        ]
    },
    "Score release when?": {
        "title": "Score release when?",
        "score": 7,
        "url": "https://www.reddit.com/r/step1/comments/1dr6xn0/score_release_when/",
        "content": "I took my exam on 24/6 which was a Monday,some say 2 Wednsday has to pass inorder to get score some say exactly 2 weeks.Did anyone get the score after 2 Wednsday???",
        "num_comments": 0,
        "comments": []
    },
    "SGU Cheating": {
        "title": "SGU Cheating",
        "score": 16,
        "url": "https://i.redd.it/bmam5fvqnf9d1.jpeg",
        "content": "Step 1\n",
        "num_comments": 16,
        "comments": [
            "Students are going to learn the hard way when NBME will void their score for suspicion of cheating. It’s going to happen just like Nepal",
            "It disgusts me that people will cheat instead of learning the material. We aren’t fixing cars we are saving lives. The people who put their trust in us because they believe we know our stuff. I pray those who cheat never make it through the medical crucible and get cut out. Learn the material for the sake of the people who trust in you, and respect the gravity of being a healer",
            "Wasn't SGU already on probation for their accreditation since 2019 and then \"voluntarily withdrew\" to have their own accrediting body? What a shitshow, they should lose their NBME",
            "It's only a matter of time when these people start getting their real scores invalidated!",
            "i dont get the context sorry, is this the actual exam that got leaked, or a practice test?",
            "I’m confused, isn’t this similar to those offline nbme floating around that people take as practice?",
            "damn that sucks. but did you make a reddit account just to throw your school under the bus? xD   \nsuddenly their tuition makes sense 😂",
            "The exams came directly from an SGU test site for the NBME CBSE. The coverups that go on at this school are unimaginable. Looking forward to that NBME investigation",
            "This was provided by SGU admin to select students to increase pass rates",
            "The point is to expose SGU's corrupt administration not to help them cover it up"
        ]
    },
    "SGU holding back students": {
        "title": "SGU holding back students",
        "score": 4,
        "url": "https://www.reddit.com/r/step1/comments/1dr71f1/sgu_holding_back_students/",
        "content": "In 2022, Step exam pass rates fell across the board after the shift to a pass/fail system. St. George's University (SGU) responded by mandating students score 70% on the Comprehensive Basic Science Examination (CBSE) to sit for Step exams. Initially implemented in February 2024, only 20% of a 500-600 student cohort passed. SGU then lowered the cutoff to 67% for an April retake, but still, only another 15-20% passed. By June 2024, 60-70% of the class had not passed, barring them from the Step exam.\n\nAdding to the stress, SGU's latest May 2024 graduates were given only five weeks to prepare for the CBSE, still with a 67% cutoff. Administration expects just 30% to pass. This rigid approach suggests a profit-driven motive, ignoring the significant number of students who would typically pass under normal circumstances.\n\nFurther complicating matters, SGU abruptly advanced the start of the second year by one month for first-year students finishing in May, without notifying the 600 affected students. This sudden change disrupted pre-made plans, sparking widespread frustration.\n\nSGU's handling of the CBSE has raised concerns about their approach to improving Step pass rates. The school's recent track record shows lowered cutoffs and delayed progression, which many see as a reflection of their profit-oriented priorities rather than genuine educational support.\n\nMoreover, SGU has enforced a mandatory attendance policy allegedly tied to California's clinical requirements, despite inconsistencies compared to other institutions like Ross University. This policy led to expulsions for students caught using clickers to mark attendance for peers, highlighting the administration's inconsistent enforcement and severe penalties.\n\nProspective students should carefully consider these ongoing issues at SGU, where policies seem increasingly reactionary and communication is poor, potentially jeopardizing educational outcomes and financial investments.\n\nSGU is worse than what you think guys.",
        "num_comments": 0,
        "comments": []
    }
}