{
    "Monday Megathread - your weekly \"dumb question\" thread": {
        "title": "Monday Megathread - your weekly \"dumb question\" thread",
        "score": 17,
        "url": "https://www.reddit.com/r/sto/comments/1dn4gyv/monday_megathread_your_weekly_dumb_question_thread/",
        "content": "Post all the questions you may have about anything STO-related. PC? Console? Everyone's welcome to post their questions here.\n\nLast thread can be found [here](https://old.reddit.com/r/sto/comments/1dhn020/monday_megathread_your_weekly_dumb_question_thread/). \n\nStay safe out there and happy flying!",
        "num_comments": 67,
        "comments": [
            "What exactly should I do once I've got my ship fully kitted out with Isomags? Should I be putting more power into other systems, or keeping it all in weapons? I thought weapon power was pointless after 125 except as a cushion. (I'm on console so I can't fine tune it)",
            "Is the junior officer event up and running yet (06/25)? I went to the KDF academy and can't find Laroj to claim the Reman doff...",
            "I can't seem to figure out how to get my free exo comp doff from the current event. I (fed) took my toon to see lieutenant cat person on the academy grounds, no option there",
            "I was wondering if Disco and TOS characters can craft Disco and TOS era phasers or are only the TNG era phasers craftable?",
            "Walkthrough for the \"tour the galaxy\" said (Kdf) to get an \"honor guard engine\" but the options are \"adapted Klingon honor guard\" and \"omega\" no plain honor guard. \n\nAdapted did not result in (secspd)2+(secspd) when upgraded to gold? So something changed there? Is the Omega now the one that does it?",
            "This new Aetherian event just started on console and doesnt end until late July, so when will the summer event start?",
            "Anyone happen to know when the next upgrade event will arrive on console?",
            "Any idea why the Excalibur class redesign doesn't have phaser arrays at the rear of the ship like the other cruiser variants do? Is it to keep it as close to the original look as possible?",
            "on console the Borg Battle Royale does not count towards the \"Complete Borg TFOs\" endeavors.",
            "I feel like a noob here.  Can someone explain to me, like you would a small child, how Intel ship abilities work?"
        ]
    },
    "Eventful - Ep. 22 - Risian Luxury Cruiser (T6)": {
        "title": "Eventful - Ep. 22 - Risian Luxury Cruiser (T6)",
        "score": 13,
        "url": "https://www.reddit.com/r/sto/comments/1dr8ao8/eventful_ep_22_risian_luxury_cruiser_t6/",
        "content": "[Risian Luxury Cruiser \\(T6\\)](https://preview.redd.it/hsq0bnadnh9d1.jpg?width=1920&format=pjpg&auto=webp&s=72329f4c5440c9ff853c7c309fea9c3051b2237b)\n\nWelcome to Eventful, my chronological run through the T6 event ships.\n\nHow it works - using my intentionally modestly equipped level 65 Romulan engineer I scrap together a build and play a ship to complete its mastery doing content no harder than advanced through a mix of patrols and RTFOs.\n\n[Previously I stealthily flew around in the Temer Alliance Raider](https://www.reddit.com/r/sto/comments/1dpntwa/eventful_ep_21_temer_alliance_raider/).\n\nRounding out our trio of the Risian fleet is the T6 upgrade to one of the few event ships I don't actually have, the [Risian Luxury Cruiser](https://stowiki.net/wiki/Risian_Luxury_Cruiser_(T6)). Doing its best job at cosplaying Flotsam Paradise, the luxury cruiser is our first standard cruiser since the Samsar all those years back. I was rather excited to get this given I missed out on the T5 offering and honestly? Yup, it's a cruiser alright. Still, its name is accurate as this looks like a cruise ship that can fly, but also maybe glide along the water too. Can this thing do atmospheric flight? I have no idea, however let's find out what this simple, yet gorgeous ship can do.\n\n[Generating soliton waves](https://preview.redd.it/fuj4ncemnh9d1.jpg?width=1920&format=pjpg&auto=webp&s=1ddd8bcff20380e94053d2e7af50e0e931b03580)\n\n*How's the general lay-out?*\n\nUnfortunately this cruiser is pretty routine. Time has been kind to it in the form of isomags coming along and sure, it has the novelty of having decent mobility for a standard cruiser, it's just nothing else is really going in its favour. Compare and contrast with the corvette for instance. Even as a 4/3 escort it carves out a niche as being extraordinarily mobile and that's before getting to the fleet upgrade. Getting a cruiser moving now is not a particularly challenging or expensive task. In fact I'd actually forgotten that the luxury cruiser doesn't have any pilot seating bucking the trend from the other two Risian ships. I'm not entirely sure why it has temp ops either other than to tie it in with the original Risa episode “Captain's Holiday”. Not that it having pilot seating would've made it utterly unique, just that if it had the same drive towards agility as the other two Risian ships then it probably would've felt more special.\n\nWith a 5/3/3 console lay-out your best bet to pump up its DEW numbers is with the aforementioned isomags. With a commander and ensign engineering it really presents itself as an Auxiliary to Battery ship, giving you those, EPtW3, EPtS/E1 and Engineering Team 1 to cover all your engineering necessities. The LtC Tac is great to empower your beams, but not enough seating if you want to empower more than just those. For me the set Lt Sci is not enough to slot Photonic Officer 2, so the LtC Uni/Temp Ops has to go to sci, annoyingly reducing my tactical options. To try and bring some energy out I wanted to try and slot some Temp Ops abilities despite the desirable Recursive Shearing 1 conflicting with the more urgent PO2. Instead I equipped Channeled Deconstruction and Rapid Decay. Unable to really boost its damage much, CD is there to set up Rapid Decay which I'm using to get a load of damage resistance reduction going. So that's neat. If I did have AtB going, I'd slot the universal with tactical for some KLW and TS along with RS1. Alas.\n\n*Customisation options?*\n\nA boatload. You can freely switch parts with the T5 cruiser to mix-and-match to your delight, along with various windows and the many Risian hull materials and glows. Throw in some wild hull patterns and, well, the randomised selections in the image at the top should give an indication of the kind of things you can do. Funny in a way because though the T6 model and textures are sharper and just generally better, I actually think the T5 version does a better job of selling the luxury cruise idea.\n\n*How's the trait and console?*\n\nMaintaining the general vibe of the ship, Leisurely Pace has you keeping a low throttle in exchange for a stacking EPG and control buff. It's not particularly difficult to obtain and maintain the buff, it's just not super valuable; if you're slotting it because you need those stats in your EPG/control build, your equipment is probably lacking. If you don't need those extra stats, you're more than likely better off slotting something else. There's also a small AoE debuff that adds some extra flavour, but Leisurely Pace absolutely gives off the sense that it's designed as filler until you're, ironically, up to speed with your build as a whole.\n\nThe Enhanced Soliton Wave Generator console, however, is a little more interesting. With a 60 second cooldown as opposed to the usual two minutes and a decent duration where it's active there's a pretty good uptime here. With it doing a decent chunk of radiation damage and having a passive that boosts the critical damage of exotic abilities, I've found this having a home on most of the builds on my science character. All-in-all? Pretty good.\n\n*Any other fun toys?*\n\nAn innate Solar Sail granting increased performance during slipstream to the tune of a slightly faster speed and a longer duration. Hey it's not much, but it is something.\n\n*Overall thoughts...*\n\nI really wish I liked this more than I do. It's fine though. As a platform the LtC Uni/Temp Ops is really its greatest feature to me and ultimately I don't think that's quite enough. By this point we already had the support cruisers, hell we had their legendary versions too, and I think they pre-emptively ate the luxury cruiser's lunch. In some respect I think it's more forgettable than the Samsar, if only because that thing was built to tank whilst this can go a bit fast, sort of. Despite this the console has a place and the trait, whilst no means great, can be useful in a pinch. Ultimately this is a ship where it has tons of style, just not enough anything else to keep it afloat. Boat puns!\n\n*Don't all the Risian consoles form a set?*\n\nThey sure do. The 2pc will grant you bonus engine power and EPG and control stats which is certainly not bad, whilst the 3pc is...unique. Your pilot bridge abilities recover 10% quicker which, I mean, I guess it's better than nothing, but it also makes Rock'n'Roll recover quicker too. I think that actually is pretty neat, though certainly not something I'd want to use as a crutch.\n\n*Next time?*\n\nPicked the renegade option.",
        "num_comments": 6,
        "comments": [
            "The 3-piece set also launches fireworks when using a pilot skill when not at red alert. Adds some pizzazz to your alpha strike.",
            "Maybe a dumb question but I'm only a week into discovering sto. How do you already have this ship? The event isn't till next week right?",
            "Waaaaaaaait what? I had no idea. That's amazing.",
            "I had an oddball build, way back, where I combined the Risa Consoles with Fek'Iri Consoles. The Chains of Gre'Thor roped and dragged a whole bunch of enemies while the Soliton Waves burned them down. It was surprisingly effective.\n\n\nAlso pissed off more than a few TFOs, to go flying off with all the enemies.",
            "My favorite event ship, like you I wanted the old T5 but I missed it. But once I got this ship I built a whole theme around it what I found on Reddit STO Costumes here https://www.reddit.com/r/stocostumes/s/XkbsAu67pV\n\nBut the Crew has grown and I wanted to keep the theme so I added a few more to it  https://www.reddit.com/r/stocostumes/s/yMBIGoaKyL",
            ">cosplaying Flotsam Paradise,\n\n[\\*Exactly\\* what I thought of when I saw this ship.](https://www.celebquote.com/wp-content/uploads/2013/03/the-fifth-element-quotes-5.gif)\n\n>The Enhanced Soliton Wave Generator console, however, is a little more interesting.\n\nHmm.  That \\*is\\* interesting.  I hadn't realized this console is only a 60s cooldown.  I'm going to have to have another look at it.  Thanks!\n\nStill looking forward to every entry in this series!"
        ]
    },
    "Any love for the Avenger Class? Not typical for Starfleet but a great ship all round IMHO 🖖": {
        "title": "Any love for the Avenger Class? Not typical for Starfleet but a great ship all round IMHO 🖖",
        "score": 102,
        "url": "https://www.reddit.com/gallery/1dqusw4",
        "content": "",
        "num_comments": 44,
        "comments": [
            "I use the avenger nacelles on my inquiry",
            "Love it, would use it much more if it had a Flight Deck Version :)",
            "I love the Avenger, it's like an angry baby Odyssey.",
            "The Overload cannons from the legendary Avenger are so awesome.",
            "Levenger is fun to fly :D",
            "I remember when it came out and introduced the cruiser abilities, good times for a memorable ship ",
            "Legendary Inquiry here.. it's my main characters main ship and I f'n love it! Handles like a dream, hits like a truck and looks like poetry in motion. \n\nThe perfect ship.",
            "I have a particular kit bash I use so it doesnt look like the straight up Avenger, but I love how the ship handles, its seating and its combat prowess!",
            "The first fed ship with 5 fore slots, back in the day.",
            "I love the Avenger. I'm currently using the Arbiter skin on mine, but just to change things up. It feels like a battleship in the way many other Federation ships don't. It has a compact, aggressive profile that I admire."
        ]
    },
    "Elysian War Magick Set is MIA": {
        "title": "Elysian War Magick Set is MIA",
        "score": 4,
        "url": "https://www.reddit.com/r/sto/comments/1drcgoh/elysian_war_magick_set_is_mia/",
        "content": "Am I tripping or is the [Elysian War Magick Set](https://www.stowiki.net/wiki/Elysian_War_Magick#Elysian_Spellsword) missing from the Summer Event Store? This set was added to the event store as part of 2023 Risa Lohlunat Festival. Apparently, it has been missing for sometime.",
        "num_comments": 1,
        "comments": [
            "This happens quite often because they don't properly version control things, so patches will remove the previous years event items and they have to add them back in. It'll happen again at some point between this year's event and next years unless deca actually starts properly controlling patches."
        ]
    },
    "I am once again asking for the Salcombe to be added to the game": {
        "title": "I am once again asking for the Salcombe to be added to the game",
        "score": 107,
        "url": "https://www.reddit.com/gallery/1dqmtu8",
        "content": "A little late, but here’s my monthly post about how much I want the Salcombe from Star Trek Beyond.\n\nAbove renders by Daniel Broadway. Movie model by unknown (to me) designer",
        "num_comments": 39,
        "comments": [
            "I am totally behind adding some diversity to the kelvin fleet lol\n\nREALLY want the kelvin sister ships from STIX like the Armstrong or Newton variants.",
            "Before they add it to a lockbox or worse.",
            "Is it that time of the month again!?",
            "I like it, but is it just me or does that dome in the center look like it should be for a Star Wars R2 droid",
            "I am once again with you my friend. May the Salcombe LLAP! ",
            "Heck yeah! This would be great to fly!",
            "Wow, cool ship. Can't remember this ship in ST Beyond ",
            "Hell, more designs like this in general added to STO would be awesome.",
            "with that big cutout, itd make a fine carrier",
            "Other than the dome, I really dig it.  Love the improved Kelvin nacelles"
        ]
    }
}