{
    "Monday Megathread - your weekly \"dumb question\" thread": {
        "title": "Monday Megathread - your weekly \"dumb question\" thread",
        "score": 17,
        "url": "https://www.reddit.com/r/sto/comments/1dn4gyv/monday_megathread_your_weekly_dumb_question_thread/",
        "content": "Post all the questions you may have about anything STO-related. PC? Console? Everyone's welcome to post their questions here.\n\nLast thread can be found [here](https://old.reddit.com/r/sto/comments/1dhn020/monday_megathread_your_weekly_dumb_question_thread/). \n\nStay safe out there and happy flying!",
        "num_comments": 62,
        "comments": [
            "What exactly should I do once I've got my ship fully kitted out with Isomags? Should I be putting more power into other systems, or keeping it all in weapons? I thought weapon power was pointless after 125 except as a cushion. (I'm on console so I can't fine tune it)",
            "Is the junior officer event up and running yet (06/25)? I went to the KDF academy and can't find Laroj to claim the Reman doff...",
            "I can't seem to figure out how to get my free exo comp doff from the current event. I (fed) took my toon to see lieutenant cat person on the academy grounds, no option there",
            "I was wondering if Disco and TOS characters can craft Disco and TOS era phasers or are only the TNG era phasers craftable?",
            "Walkthrough for the \"tour the galaxy\" said (Kdf) to get an \"honor guard engine\" but the options are \"adapted Klingon honor guard\" and \"omega\" no plain honor guard. \n\nAdapted did not result in (secspd)2+(secspd) when upgraded to gold? So something changed there? Is the Omega now the one that does it?",
            "Does anyone have experience in \"catching up\" from changing platforms?\n\nI've played on Xbox for the last 5-6 years and geared out my main character really well, lots of currencies with a couple store bought ships, overall really enjoyed my time on Xbox.\n\nBut I've since returned to PC and found my old fleet still playing, and it's been nice just playing with them every day, having people to talk to in-game compared to console. \n\nLooking to just move over permanently now, but.. I feel a bit lost having none of my currencies, BOFFs, admirality or gear etc, so not too sure whether it's going to be painful to catch up, or try something new.",
            "I have a bunch of infinity prize packs:\n\nKit Module 2x\nPersonal Trait Ground 2x\nPersonal Trait Space 1x\nWeapon Pack 4x\n\nI want to sell some of them on the Exchange, but don't know what items are good for that, or their actual price range. (Exchange prices could be greatly inflated)",
            "This new Aetherian event just started on console and doesn’t end until late July, so when will the summer event start?",
            "Anyone happen to know when the next upgrade event will arrive on console?",
            "Any idea why the Excalibur class redesign doesn't have phaser arrays at the rear of the ship like the other cruiser variants do? Is it to keep it as close to the original look as possible?"
        ]
    },
    "Any love for the Avenger Class? Not typical for Starfleet but a great ship all round IMHO 🖖": {
        "title": "Any love for the Avenger Class? Not typical for Starfleet but a great ship all round IMHO 🖖",
        "score": 70,
        "url": "https://www.reddit.com/gallery/1dqusw4",
        "content": "",
        "num_comments": 26,
        "comments": [
            "I use the avenger nacelles on my inquiry",
            "Love it, would use it much more if it had a Flight Deck Version :)",
            "The Overload cannons from the legendary Avenger are so awesome.",
            "Levenger is fun to fly :D",
            "I love the Avenger, it's like an angry baby Odyssey.",
            "I remember when it came out and introduced the cruiser abilities, good times for a memorable ship 😁",
            "Legendary Inquiry here.. it's my main characters main ship and I f'n love it! Handles like a dream, hits like a truck and looks like poetry in motion. \n\nThe perfect ship.",
            "Love it.",
            "Has always been a favorite of mine.",
            "The first fed ship with 5 fore slots, back in the day."
        ]
    },
    "I am once again asking for the Salcombe to be added to the game": {
        "title": "I am once again asking for the Salcombe to be added to the game",
        "score": 90,
        "url": "https://www.reddit.com/gallery/1dqmtu8",
        "content": "A little late, but here’s my monthly post about how much I want the Salcombe from Star Trek Beyond.\n\nAbove renders by Daniel Broadway. Movie model by unknown (to me) designer",
        "num_comments": 38,
        "comments": [
            "I am totally behind adding some diversity to the kelvin fleet lol\n\nREALLY want the kelvin sister ships from STIX like the Armstrong or Newton variants.",
            "Before they add it to a lockbox or worse.",
            "Is it that time of the month again!?",
            "I like it, but is it just me or does that dome in the center look like it should be for a Star Wars R2 droid",
            "Take my upvote and support.",
            "I am once again with you my friend. May the Salcombe LLAP! 🖖",
            "Heck yeah! This would be great to fly!",
            "Yeah I support this request! I just hope that Cryptic/DECA listens and provides it with good stats & boff seating.",
            "Wow, cool ship. Can't remember this ship in ST Beyond 👀",
            "That's badass"
        ]
    },
    "Starting next week, with the launch of the Summer Event on PC, a brand new ship from StarTrekDiscovery comes to the Infinity Lock Box: The Credence Class!": {
        "title": "Starting next week, with the launch of the Summer Event on PC, a brand new ship from StarTrekDiscovery comes to the Infinity Lock Box: The Credence Class!",
        "score": 83,
        "url": "https://www.playstartrekonline.com/en/news/article/11569844",
        "content": "",
        "num_comments": 96,
        "comments": [
            "I just realised that all the 32 century starfleet ships look quite Forerunner esque with all the detached parts like the warp nacelles.",
            "Creedence Clearwater Revival",
            "The *Kirk*-class is definitely the best looking of the 32c ships, but this design doesn't fall too far behind.  And the stats aren't half-bad either.",
            "Miracle Worker/Temporal is a rare (and slightly weird) combo. There's only something like four ships in the game with that paring.",
            "Does anyone know if there will be an option to look out the backdoor?",
            "It ain't me",
            "This could be very good.",
            "Are the trait and console good though?",
            "I think it looks awesome. Possibly a candidate for a future campaign ship choice.",
            "Just answer this one question: In an emergency, when power to transporters is offline, how to do get from one section to another if nothing is connected?"
        ]
    },
    "Voyager A": {
        "title": "Voyager A",
        "score": 131,
        "url": "https://i.redd.it/z4pais927a9d1.jpeg",
        "content": "i bet this will be a lock/promo box ship if and when it comes to STO ",
        "num_comments": 43,
        "comments": [
            "For some reason, the lack of windows on this ship really bugs me",
            "The Lamar class looks like a relative of the Vesta class ships. It wouldn't surprise me if this was a promo ship that was specifically cross-compatible with the Vesta frame.",
            "Looks like a sovy mashed with a vesta, kinda dig it. But yeah, best case it's lockbox, worst case it promo. Basically no other possibilities with ships related to the main cast nowadays.",
            ">i bet this will be a lock/promo box ship if and when it comes to STO\r  \n\r\n\nit absolutely will be, that's not me being pessimistic or grumpy, idk why this many years into the game and the lockbox system why people still entertain the idea of \"maybe it'll be zen store\"",
            ">i bet this will be a lock/promo box ship if and when it comes to STO\n\nCount on it\n\nNot my favorite design ever, personally, looks like somebody sat on the Oddy and then glued Sovy nacelles to the struts - though, I will admit to preferring it to the Pathfinder class\n\nIn the case of the Intrepid line - I'm more of a base model kinda gal - all the discarded concept art versions were discarded for a reason imo \n\nKind of the same stance on the Defiant - though I will admit to having a soft spot for the Vigilant and Adamant models",
            "It looks like someone shaved a Sovereign.",
            "If you ever wanted to see what the child of a sovereign and intrepid looked like, you'd have this beautiful lady.",
            "Looks like a Sovereign with an Intrepid deflector.",
            "It's not in the spirit of a ship called \"Voyager\" but I'd love to see this get added to the Sovereign-class family with stats that are befitting of a true assault cruiser. 5/3, command/temporal maybe?",
            "Looks like a Sovereign had a good time with Vesta or Intrepid in dock."
        ]
    }
}