{
    "Rate My Portfolio - r/Stocks Quarterly Thread June 2024": {
        "title": "Rate My Portfolio - r/Stocks Quarterly Thread June 2024",
        "score": 42,
        "url": "https://www.reddit.com/r/stocks/comments/1d5itn0/rate_my_portfolio_rstocks_quarterly_thread_june/",
        "content": "Please use this thread to discuss your portfolio, learn of other stock tickers, and help out users by giving constructive criticism.\n\nWhy quarterly?  Public companies report earnings quarterly; many investors take this as an opportunity to rebalance their portfolios.  We highly recommend you do some reading:  A list of [relevant posts & book recommendations.](https://www.reddit.com/r/stocks/wiki/index#wiki_relevant_posts_.26amp.3B_book_recommendations)\n\nYou can find stocks on your own by using a scanner like your broker's or [Finviz.](https://finviz.com/screener.ashx)  To help further, here's a list of [relevant websites.](https://www.reddit.com/r/stocks/wiki/index#wiki_relevant_websites.2Fapps)\n\nIf you don't have a broker yet, see our [list of brokers](https://www.reddit.com/r/stocks/wiki/index#wiki_brokers_for_investing) or search old posts.  If you haven't started investing or trading yet, then setup your [paper trading to learn basics like market orders vs limit orders.](https://www.reddit.com/r/stocks/wiki/index#wiki_is_there_a_way_to_practice.3F)\n\nBe aware of [Business Cycle Investing](https://eresearch.fidelity.com/eresearch/markets_sectors/sectors/si_business_cycle.jhtml?tab=sibusiness) which Fidelity issues updates to the state of global business cycles every 1 to 3 months (note: Fidelity changes their links often, so search for it since their take on it is enlightening).  [Investopedia's take on the Business Cycle](https://www.investopedia.com/articles/investing/061316/business-cycle-investing-ratios-use-each-cycle.asp).\n\nIf you need help with a falling stock price, check out Investopedia's [The Art of Selling A Losing Position](https://www.investopedia.com/articles/02/022002.asp) and their [list of biases.](https://www.investopedia.com/articles/stocks/08/capital-losses.asp)\n\nHere's a list of all the [previous portfolio stickies.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all)",
        "num_comments": 239,
        "comments": [
            "$ccl 20%, $arco 20%, $goog 40%, $shop 20%",
            "100% PBR \n\nLol I'll probably rebalance it. Just felt funky a week ago.",
            "I just checked, and CrowdStrike has become 16% of my portfolio. Should I rotate out my original cost, or is there more upside? I’m aware of the importance of security in the coming years.",
            "My portfolio: 94 shares in NVIDIA at a value of £8.9k I am thinking to stop at 100 shares and start investing in other companies by diversifying my portfolio on the other hand I feel like NVIDIA still has the most potential to grow. I'd be looking at A small amount of gold maybe 5-10% of my portfolio for now then INTC as I feel its affordable steady and got plans for the future, Amazon and ASTS.",
            "General question: Now that NVDA has split, do we think it’ll continue to grow as it has the last few months? Or is now a good time to sell some off and invest in MSFT, APPL, GOOG, etc for the next solid bump? Long term investor but trying to remain above the inflation rates 🥲",
            "Serious question: how to hedge against a Trump presidency?",
            "What happened to Vertiv today 😥",
            "baby investor here. can someone confirm that NYSEARCA: VOO is the one to buy, if im looking to buy Vanguard index fund?",
            "Many of the stocks you hold are incredibly volatile and speculative in nature. My concern is are you able to track each one to the point where you have a comfortable idea as to when you should sell an individual position or add more?",
            "Would recommend consolidating into VTI because the criteria for QQQM makes no sense. QQQM only makes sense if your investing philosophy is \"US large cap stocks will do well in the future, but mostly only the ones on the NASDAQ that aren't financial companies.\"\n\nFor example, do you think Pepsi will significantly outperform Coke? Pepsi is in QQQM but not Coke because Pepsi trades on the NASDAQ and Coke trades on the NYSE. If you think both will do well then you would be better off owning both to reduce your uncompensated risk."
        ]
    },
    "/r/Stocks Weekend Discussion Saturday - Jun 29, 2024": {
        "title": "/r/Stocks Weekend Discussion Saturday - Jun 29, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/stocks/comments/1dr7equ/rstocks_weekend_discussion_saturday_jun_29_2024/",
        "content": "This is the weekend edition of our stickied discussion thread.  Discuss your trades / moves from last week and what you're planning on doing for the week ahead.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%22Rate+My+Portfolio%22&restrict_sr=on&sort=new&t=all).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&restrict_sr=on&sort=new&t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&restrict_sr=on&include_over_18=on&sort=new&t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&restrict_sr=on&include_over_18=on&sort=new&t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&restrict_sr=on&include_over_18=on&sort=new&t=all) Friday.",
        "num_comments": 0,
        "comments": []
    },
    "Where do you think the S&P will be by 2030?": {
        "title": "Where do you think the S&P will be by 2030?",
        "score": 175,
        "url": "https://www.reddit.com/r/stocks/comments/1dqxdj6/where_do_you_think_the_sp_will_be_by_2030/",
        "content": "I heard Tom Lee say that he believes the S&P will be at 15,000 by 2030. He believes that we’ll see a stretch of mid to high teens annualized returns due to favorable demographics and the earnings lift from generative AI.\n\nObviously this is *very* bullish and probably a bit too optimistic. But where do you think the S&P will be in 2030? I think this is a fun but also useful exercise to make it easier to stay invested. Instead of thinking about “7% per year” or “10% per year”, think about the actual number we’ll be at in 5, 10, or 20 years. \n",
        "num_comments": 281,
        "comments": [
            "Up and to the right",
            "To Tom Lee the market is always going to be up 100% by next week.",
            "Probably higher or lower than what it is now",
            "If he thinks the sp500 will compound at 18% for the next 6 years, he’s out of his mind and selling something \n\nHe can say whatever he wants- when he’s wrong, it doesn’t matter. Short term bs like this doesn’t matter, just keep investing and stay invested",
            "Probably higher than it is now",
            "I’m more concerned about how much a loaf of bread is going to cost.  Purchasing power is my primary concern regardless of where the numbers are.",
            "15,000 is a bit aggressive, but I definitely think over 10k",
            "Where will it be? Same place it’s always been, at the top of the WSJ home page.",
            "Zero. You'll own nothing and eat ze bugs. All property will belong to the NWO.",
            "I’ll just keep buying and dollar cost averaging. Whatever it is, it is."
        ]
    },
    "Is anyone here bullish on Airbus for the long term?": {
        "title": "Is anyone here bullish on Airbus for the long term?",
        "score": 101,
        "url": "https://www.reddit.com/r/stocks/comments/1dqqcox/is_anyone_here_bullish_on_airbus_for_the_long_term/",
        "content": "Airbus took a 9% hit recently due to them falling short of their delivery guidance. If I’m not mistaken, they were poised to deliver 800 aircraft, but could only fulfill 770. The stock took a nose dive. However, the company is profitable (unlike Boeing) and doesn’t have the myriad of safety issues it’s American counterpart is facing.\n\nCurrently, the company is operating on 15% gross margin, 25 P/E, and a P/FCF of 17. Which, again, compared to the other incumbent is leagues better.\n\nThe American ticker is EADSY and I’m thinking about dropping some cash on it. I feel that investors are seriously overreacting on the latest news.\n\nAnyone here think differently?",
        "num_comments": 63,
        "comments": [
            "It's not a business that interests me, but you should look into why, in a duopoly, one company can't capitalize on the other's difficulties.",
            "I wouldn't be bullish over the long-term because I just don't think the long-term returns for the company since IPO have been all that compelling and short/medium-term if we do run into the economy slowing this wouldn't be something I'd want to be in and the market will try to anticipate that. Could I see an oversold bounce? Sure. \n\nLong-term if I wanted aerospace exposure I'd much rather get and forget TDG or HEI, both of which are superbly managed companies that have delivered - particularly in the case of the latter being up about 118,000% since IPO  - for shareholders consistently over time.",
            "I think you might have just convinced me to take a position on Airbus....\n\nManufacturing takes time to expand, but, it can be done - I suspect the recent Boeing issues may help Airbus too.",
            "I have been holding AIRp for some time because of their research focused on environmental friendly flight in the future, specifically hydrogen. I think whoever cracks that nut is going to win. So far AIRp has not delivered, but I’m holding.",
            "They are subject to political pressures from European governments, especially with 1/4 of their shares owned directly by European govts.\n\nI prefer RTX (aka Raytheon).  Through Pratt & Whitney, half of their business is civilian aerospace, while the other half is defense.  This gives me exposure to expanding demand for commercial air travel, and a steadily increasing demand for defense systems.",
            "I'm a long time Boeing hold. Bought when covid hit and then watched the government bail them out. They could murder all the whistle blowers and I wouldn't sell. I'm not claiming it's a great stock just that it's a safe one.",
            "I’m bullish about NASDAQ LOBO long term but airbus’s and Boeing’s operations will have huge issues",
            "Bullish but it’s an airline stock and they hardly fucking move.",
            "If airline industry is complex,  I can’t even say a word of plane manufacturing at this point of time.",
            "To be honest if you look at the trajectory of the stock price for the last 10 years the gains are dismal, buying a stock at 15 dollars and it being 30 dollars 10 years later is not a good return. You’re better off putting your money in an ETF or a CD account generating a steady annual return."
        ]
    },
    "Why is Disney stock only going down after Q1 report, which were good?": {
        "title": "Why is Disney stock only going down after Q1 report, which were good?",
        "score": 117,
        "url": "https://www.reddit.com/r/stocks/comments/1dqn1hh/why_is_disney_stock_only_going_down_after_q1/",
        "content": "Man, I just don't understand stock market, Disney has good Q1 earnings, Disney+ finally turns profit,  it has major releases this year, so it takes -10% for last month.  \n  \nIn other turn, TESLA is burning pile of garbage, literally every product has flaws, their cars are withdrawn because of major safety issues and they don't deliver features which they previously promoted (isn't that fraud?), so naturally it's +10% for last month.\n\nCan someone explain this? How does it work? Is whole market just \"bigger fool\" or gambling on \"potential growth\" now?",
        "num_comments": 183,
        "comments": [
            "Idk anything about Disney specifically, but when the stock moves opposite to the earnings report it may seem counterintuitive but it's just this: the stock is moving relative to expectations, not relative to their last earnings report. It doesn't matter if a company crushes earnings if the market was expecting it to crush earnings even harder.",
            "Leftovers from the proxy fight. Selling their positions. I'm holding during the buyback.",
            ">Can someone explain this? How does it work? Is whole market just \"bigger fool\" or gambling on \"potential growth\" now?\n\nWelcome to the reality of trading.",
            "It initially went down because they hinted during the earnings call that there may be softness at the parks this quarter. Don't get me wrong the parks will still do well but just not as good as some analysts were expecting.  Its probably down today because other consumer stocks have had some weak results, such as Nike.  The concern is a slowdown in consumer spending will hit Disney's earnings also.",
            "Big drops in the linear networks and a bad guidance for Q3 DTC",
            "Stock is about the future, the past can give you some idea about what will happen but stock prices is not based on past performance.   DIS revenue disappointed investors.   If the economy continues to trend down, I'd expect people to cut back on fun activities which will hurt their bottom line.  Disney+ turning a profit is nice but they've lost to Netflix on the streaming side and their future in this space is far from certain.  Furthermore, the content they create is no resonating with audiences.  Why would I invest in an entertainment company who 1) is bad at creating content.  2) is facing a headwind due to the economy.\n\nTesla, on the other hand, has a bright future.  You may not like their product but our government has effectively eliminated their biggest competition with tariff.   Aside from perhaps Rivian, doesn't look like any domestic/Japan/SK/Europe car maker can compete with them.   If I am to invest, why wouldn't I put money on TSLA instead of DIS.",
            "Idk ..people over their wokeness? In need of some good solid movies to regain the publics confidence?",
            "Teslas doing just fine. I think a lot of people out there would rather have all their money in Tesla than Disney.",
            "You drank too much Reddit kool aid it seems. How come redditors are the enlightened ones yet their \"undervalued\" stock picks (Dis, Intc, Pypl) are underperforming \"trash\" stocks like Tesla and Robinhood? maybe you guys aren't that smart as you think, huh?",
            "Great company that's made some mistakes. I'll load up if it gets into the 80s again."
        ]
    }
}