{
    "Rate My Portfolio - r/StockMarket Quarterly Thread April 2024": {
        "title": "Rate My Portfolio - r/StockMarket Quarterly Thread April 2024",
        "score": 27,
        "url": "https://www.reddit.com/r/StockMarket/comments/1bsyq77/rate_my_portfolio_rstockmarket_quarterly_thread/",
        "content": "Please use this thread to discuss your portfolio, learn of other stock tickers, and help out users by giving constructive criticism.  \n\n\nPlease share either a screenshot of your portfolio or more preferably a list of stock tickers with % of overall portfolio [using a table.](https://www.reddit.com/r/YouShouldKnow/comments/y37p6/ysk_how_to_make_a_table_on_reddit/)\n\nAlso include the following to make feedback easier:  \n\n\n* Investing Strategy: Trading, Short-term, Swing, Long-term Investor etc.\n* Investing timeline: 1-7 days (day trading), 1-3 months (short), 12+ months (long-term)",
        "num_comments": 161,
        "comments": [
            "Link to Portfolio: [https://imgur.com/a/t6RlRgG](https://imgur.com/a/t6RlRgG)\n\nHi All, I'm a long time lurker and I need some advice. I consider myself a long-term investor. The strategy that appeals to me is low-risk and dividends over growth stocks. I've been growing my S&S ISA since 2021, and these pictures are today's snapshot.\n\nI don't have time or energy to do a lot of studying of stocks etc. and opted to follow others on YouTube instead that match my strategy. I've followed TheDividendExperiment (Daily Dividend Pie) when it first started, but I've reached a level of money in my portfolio that makes me anxious simply following YouTube advice. In addition to the Daily Dividend Pie, I've also invested in choice stocks for personal experimentation like DIS and SBLK.\n\nGeneral consensus I've read on Reddit is to simply invest into an S&P500 Index but I wonder if it's the best course of action for me to simply sell everything and buy an S&P500 Index tracker right now, or do I need to selectively sell stock and keep others instead.\n\nI would appreciate any advice, thanks!\n\nPS: I rarely post on Reddit and it's my first time posting here so if I'm making a formatting or general mistake in this post let me know also.",
            "l am 19 planning to hold until retirement\n10% Microsoft 10%amazon 10% meta 10%alphabet 10% s&p 500 5% apple 5% visa 5% Mastercard 4% Berkshire\nHathaway 3%tsmc 3%uber 3% Netflix 3%asmI\n3%chipotle 2% united health 2% costco 2% Lvmh 2% booking holdings 2% air bnb 1% sofi",
            "I am a 65 y retiree, fairly new in stock market. My current porfolio stays pretty much the same. MSFT, GOOGC, AAPL,AMZN, JPM - about 20% each. I also have 6,000 HITI stocks.\n\n I have been getting 38-40% return for 2-3 years. I trade failry often. I like tech stocks more than anything.\n\nWhen I retired in 2016 I had about the same amount of money as now. But, I have been withdrawing the profits to supplement my pension. So far I've ben fortunate.",
            "What stocks should I invest in? I’m new and i need some advice.",
            "hello, I am trying to get into stocks and have read up on the system but don’t 100% understand it. i probably shouldn’t get into it without a full understanding but F it. \n\nMy question is with $50 on robinhood how should i start? \n\nI strongly want to invest in AI stocks i just know not a lot of them. If anyone has any beginner tips or anything to help that would be great. \n\nfigure stocks might be better for the long game than sports betting 🤣",
            "[deleted]",
            "VOO 100%\n40 year timeline",
            "***ROTH IRA***\n\nMy current fund allocation is\n\nFXAIX (Fidelity S&P 500 Mutual Fund) - 35%\n\nSCHG (Charles Schwab Large-Cap Growth) - 20%\n\nFTIHX (Fidelity Total International Mutual Fund) - 15%\n\nAVUV (Avantis US Small-Cap Value ETF) - 15%\n\nSMH (VanEck Semiconductor ETF) - 15%\n\n***BROKERAGE***\n\nMy current fund allocation is\n\nVOO (Vanguard S&P 500 ETF) - 21.25%\n\nUSD (ProShares Ultra Semiconductor ETF) - 17%\n\nSCHG (Charles Schwab Large-Cap Growth) - 12.75%\n\nQQQM (Invesco NASDAQ 100 ETF) - 12.75%\n\nVGT (Vanguard Information Technology ETF) - 12.75%\n\nAVUV (Avantis US Small-Cap Value ETF) - 8.5%\n\nAMZN (Amazon) - 3%\n\nMSFT (Microsoft) - 4.5%\n\nGOOGL (Google) - 4.5%\n\nNVDA (Nvidia) - 3%",
            "Nvda",
            "Google- A....20%\n\nAmazon........20%\n\nSMH..............20%\n\nPDD Holding....15%\n\nCognet Bio.........7%\n\nRiot.......................7%\n\nGrayscale...........7%\n\nOculis................4%\n\n  \nYTD Return: 29.78 %\n\nI need better returns. Grayscale and Riot have been losers for me, the rest are in the green.."
        ]
    },
    "Daily General Discussion and Advice Thread - June 29, 2024": {
        "title": "Daily General Discussion and Advice Thread - June 29, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/StockMarket/comments/1dr70nn/daily_general_discussion_and_advice_thread_june/",
        "content": "Have a general question?  Want to offer some commentary on markets?  Maybe you would just like to throw out a neat fact that doesn't warrant a self post?  Feel free to post here! \n\n&#x200B;\n\nIf your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions, you should include relevant information, such as the following:\n\n&#x200B;\n\n\\* How old are you? What country do you live in?  \n\n\\* Are you employed/making income? How much?  \n\n\\* What are your objectives with this money? (Buy a house? Retirement savings?)  \n\n\\* What is your time horizon? Do you need this money next month? Next 20yrs?  \n\n\\* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)  \n\n\\* What are you current holdings? (Do you already have exposure to specific funds and sectors? Any other assets?)  \n\n\\* Any big debts (include interest rate) or expenses?  \n\n\\* And any other relevant financial information will be useful to give you a proper answer.  .  \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered investment adviser if you need professional support before making any financial decisions!",
        "num_comments": 0,
        "comments": []
    },
    "Stock market at all time highs, housing market at all time highs": {
        "title": "Stock market at all time highs, housing market at all time highs",
        "score": 51,
        "url": "https://www.reddit.com/r/StockMarket/comments/1dr1pu4/stock_market_at_all_time_highs_housing_market_at/",
        "content": "One must wonder why both the stock market and housing market are both at all time highs? The median price of a home sold in May was **$419,300** — an all-time record. As we know the stock market is at all time highs as well. Now lets look at what's driving the stock market to all time highs, not hard to figure it out its big tech. Wall St has a love fest with big tech right now. Just buy big tech and get rich right? Not so quick, those of you that remember the [dot.com](http://dot.com) bubble in the 90's remember how that ended. Between March 2000 and October 2002, the NASDAQ fell from 5,048 to 1,139, erasing nearly all of its gains during the dot-com bubble. By the end of 2001, most publicly traded dot-com companies had failed. I was a trader back then and bought many penny stocks that skyrocketed in price during the [dot.com](http://dot.com) boom. Lucky for me I cashed out around the highs before most of them went bankrupt. This brings me to the current AI-boom which I missed out on. I am not saying the AI-boom is not justified. However, the market has already deemed the new winners. Just like it was during the dotcom boom there were winners but many went bankrupt. We shall see how the AI boom evolves, but when a sector is only thing leading the market to new highs history tells us a crash will follow.\n\nNow lets look at housing. I lived through the first major correction in the housing market in 2008. I took my gains from the 90s dotcom boom and invested in real estate soon after. I got lucky and sold most of my real estate right before it crashed in 2008. The stock market and housing market crashes of 2008 trace their origins to the unprecedented growth of the subprime mortgage market that began in 1999. Could we have a repeat of previous events? Right now average people can not afford a home. Why is this? Could it be Wall St has become a major buyer of real estate remembering the government bailed them out last time, who knows. What I do know is what my ole grandpappy used to say, what goes up must come down. Baby boomers own most real estate and will soon be major sellers due to death or downsizing, this is just facts. Right now, boomers have a pretty large grip on the US housing market. The generation accounts for about 21% of the total US population, but they own 38% of American homes We shall see what happens in the future but history always repeats its self.\n\nCHEERS!!  \nMAV",
        "num_comments": 16,
        "comments": [
            "We’re probably mid cycle in a bull market. Too many people have doubts this can keep going up and to the right. Wait until everyone believes numba can only go up. Doesn’t feel like we’re there yet.",
            "Price of groceries is at an all time high, the price of everything is at an all time high ..so why wouldn't the stock market be the same? Its a global thing.",
            "Probably has something to do with the constant 2 trillion dollar spending packages getting passed every year and debt monetization and the resulting inflation.",
            "The fed printed trillions of dollars and handed them out to everyone.  This caused massive inflation and so here we are.",
            "the market isn’t going to crash if that’s what you’re getting at.  If anything the AI boom is just getting started as we are potentially entering an era of increased productivity with AI and automation combined with rate cuts. The era you want to look at is the mid to late 90s because that’s when the internet first started to become mainstream and increased productivity combined with rate cuts. We’re on the cusp of a new bull market",
            "I’ve lost track of how many unsubstantiated points you tried to establish as patterns or rules",
            "What are you trying to say? Both real estate and equities should be at least somewhat correlated. Both are investment opportunities with somewhat similar risk profiles. It isn't that surprising that when one is at ATH, so is the other. They should be influenced by many of the same macroeconomic trends.",
            "The historical patterns are definitely worth considering. However, the AI and tech sectors today have a lot of solid growth drivers. And while the housing market's future is uncertain, there are always opportunities for those who stay informed and adaptable.",
            "normies are selling and shorting? time to rekt them. there's absolutely no correlation between the state of the economy and the stock market",
            "This 👆🏼more money in circulation equals inflated prices all around, for all markets. And, when the last two presidency’s, as was so kindly pointed out the other night, increase the deficit back to back by the two largest amounts on record… everything goes up in price."
        ]
    },
    "Historical P/E ratio of the S&P 500. Current value is 26.": {
        "title": "Historical P/E ratio of the S&P 500. Current value is 26.",
        "score": 192,
        "url": "https://i.redd.it/2s72o5h9tc9d1.png",
        "content": "",
        "num_comments": 45,
        "comments": [
            "Those high peaks in 2000 and 2008 were caused by the massive drop in earnings.",
            "I would at most, keep this to the past 50 years",
            "Years ago, it was not easy to invest.  You had to use a broker.",
            "Yeah it's \"only\" 26 because most of the growth concentrated in the top 10 companies or so.",
            "There are pockets of the stock market that are fairly valued.\n\nSmall caps, International developed, and Emerging Markets.\n\nDon't use this chart as a reason to stay on the sidelines and stay in cash. The PE ratio of the S&P in 1992 is about the same as it is today, and we all know how stocks went up in the 1990s.",
            "Looks kinda fine if you only consider the relevant last 20 years. Looking forward to some good pumps!",
            "I would love to see this charted against actual earnings.  If earnings are rising more quickly then higher PEs make sense.",
            "It may seem low compared to those peaks in 2000 or 2008 but that was when the E in P/E had practically vanished due to a recession. So don’t look at this chart and think S&P 500 is ‘cheap’",
            "Interesting how much more chatter there has been in the data since 2021... I wonder if there were any significant events during that time which have gone unresolved... 🤔🤔🤔",
            "Smooth sailing to 40x!"
        ]
    },
    "Your thoughts on technical analysis and trading automation?": {
        "title": "Your thoughts on technical analysis and trading automation?",
        "score": 10,
        "url": "https://www.reddit.com/r/StockMarket/comments/1dqitsm/your_thoughts_on_technical_analysis_and_trading/",
        "content": "Automated trading is the process of using computer programs and algorithms to automate trading strategies in the financial markets. Instead of manual execution, traders rely on trading robots that automatically analyze the market, make decisions, and execute trades.\n\n# What is the advantage of automating analysis?\n\nFirst, it allows traders to react to market events much faster than manual trading. Platforms can instantly analyze and interpret huge amounts of data, which makes rapid decision-making possible.\n\nSecond, automated trading eliminates the emotional errors associated with human error. Traders can be emotionally stressed, which can lead to irrational decisions. Trading robots work based on predetermined algorithms without the influence of emotion, which increases the discipline of trading and the prospect of an initially working strategy,\n\n**Technical analysis and automated decision making**\n\nTrading robots are based on technical analysis, analyzing historical data of prices, volumes and other parameters. They can automatically make decisions to enter and exit trades based on set conditions such as support and resistance levels, indicators and market trends.\n\n**Automated trading software**\n\nThere is a variety of automated trading software available. Some platforms offer off-the-shelf solutions, including trading robots and tools to incorporate into their own strategies. Other platforms offer APIs that allow traders to create their own programs based on specified conditions.\n\n**Functionality and features**\n\nAutomated trading software can offer a variety of features and functionality. These can include real-time feedback, data visualization, tools to optimize strategies, backtesting and testing capabilities on historical data, and risk and portfolio management.\n\nhttps://preview.redd.it/hse8a28t6b9d1.png?width=1147&format=png&auto=webp&s=1e3ec00af513608cae84b06bc88159fde87f1317\n\n**Pros and cons of automated trading**\n\nAutomated trading has several advantages. First, it allows traders to greatly increase their speed of reaction to market events, as robots can instantly analyze and make decisions. Second, automated trading eliminates the emotional errors associated with human error.\n\nHowever, automated trading also has its limitations and risks. Technical glitches, market connectivity issues, and software bugs can lead to lost trades or even financial losses. In addition, trading robots can be sensitive to changes in market conditions and may not always be able to adapt to new situations.\n\nHow to choose the right trading robot or software\n\n1. Consider your requirements and goals\n\nWhen choosing a trading robot or software, you need to consider your individual requirements and goals. Different robots and platforms may offer different features and strategies, so it is important to determine what you need and what best suits your trading goals.\n\n2.  Testing and optimizing strategies\n\nOnce you have chosen your software, it is recommended that you test and optimize your strategies on historical data. This will help you verify the effectiveness of your chosen robot and customize its parameters according to your preferences and trading strategies.\n\n# Examples of successful use of automated trading\n\n**Example 1: Increasing Profitability with a Trading Robot**\n\nOne example of a successful use of automated trading is the case of a trader who was able to significantly increase his profitability through the use of a trading robot. The robot analyzed market data and made decisions about entering and exiting trades based on predetermined algorithms and strategies. This allowed the trader to reduce emotional errors and increase his trading efficiency.\n\n**Example 2: Reducing emotional errors and increasing discipline**\n\nAnother example of the successful use of automated trading has to do with reducing emotional errors and increasing trader discipline. Trading robots are not subject to emotional stress and do not succumb to panic or greed, ",
        "num_comments": 6,
        "comments": [
            "1) clearly an ad\n\n\n2) the fucks a trading robot?\n\n\n3) anyone with a working strategy should probably build something themself",
            "ChatGPT written spam. 💩",
            "AI 💩",
            "Don’t even think of robot shitc they want your pretty money, stay away from\nAll those shot platforms",
            "Well, all the techcalnanalyiss boils down to volume, volatility and price , automation is not good unless you are a supper wealthy fund with quantum computer, all the tech or better say most of the tech sucks",
            "May be, bots eat shit"
        ]
    }
}