{
    "Rate My Portfolio - r/StockMarket Quarterly Thread April 2024": {
        "title": "Rate My Portfolio - r/StockMarket Quarterly Thread April 2024",
        "score": 24,
        "url": "https://www.reddit.com/r/StockMarket/comments/1bsyq77/rate_my_portfolio_rstockmarket_quarterly_thread/",
        "content": "Please use this thread to discuss your portfolio, learn of other stock tickers, and help out users by giving constructive criticism.  \n\n\nPlease share either a screenshot of your portfolio or more preferably a list of stock tickers with % of overall portfolio [using a table.](https://www.reddit.com/r/YouShouldKnow/comments/y37p6/ysk_how_to_make_a_table_on_reddit/)\n\nAlso include the following to make feedback easier:  \n\n\n* Investing Strategy: Trading, Short-term, Swing, Long-term Investor etc.\n* Investing timeline: 1-7 days (day trading), 1-3 months (short), 12+ months (long-term)",
        "num_comments": 161,
        "comments": [
            "What stocks should I invest in? I’m new and i need some advice.",
            "VOO 100%\n40 year timeline",
            "I got PEPSI and CISCO. My aim is to get INTEL, BOEING, AKAMAI, ROCKWELL. What do you think?",
            "NVIDIA 200%\n\n(all margin used)",
            "I am looking at buying RDDT and holding for as long as a month, do you guys think it is a great idea? This will be my very first stock to purchase.",
            "do you guys think nvidia is being inflated? i’m totally new but i saw that their expected earnings are lower than normal and they come out apr 30. are people inflating it to sell before then? or do the lower expected earnings increase their odds of exceeding them, making the stock more valuable?",
            "Why are my posts being taken down?",
            "I'm looking to start investing some of my savings while l'm young and have no clue where to start.\nAny recommendations for what platform to invest through? What should I invest in that isn't a big risk? I'm only looking to invest a few hundred as of now. Any help or advice is appreciated!",
            "Personally, I think there is still a chance for a big rise.",
            "What should I invest in?\nI’m a college student, working part time. I do all my banking with Wealthsimple as I’m based in Canada and hate big banks. I have roughly 9k in the bank, split between various accounts. Most of its in managed accounts, or ETFs, though I do have about 1k in stocks for larger companies and $500 in crypto for fun. I want to learn how to properly do options trading, but I don’t currently have the time to *invest* a lot of effort into it right now. Any advice or things I should change? Thanks."
        ]
    },
    "Daily General Discussion and Advice Thread - June 29, 2024": {
        "title": "Daily General Discussion and Advice Thread - June 29, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/StockMarket/comments/1dr70nn/daily_general_discussion_and_advice_thread_june/",
        "content": "Have a general question?  Want to offer some commentary on markets?  Maybe you would just like to throw out a neat fact that doesn't warrant a self post?  Feel free to post here! \n\n&#x200B;\n\nIf your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions, you should include relevant information, such as the following:\n\n&#x200B;\n\n\\* How old are you? What country do you live in?  \n\n\\* Are you employed/making income? How much?  \n\n\\* What are your objectives with this money? (Buy a house? Retirement savings?)  \n\n\\* What is your time horizon? Do you need this money next month? Next 20yrs?  \n\n\\* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)  \n\n\\* What are you current holdings? (Do you already have exposure to specific funds and sectors? Any other assets?)  \n\n\\* Any big debts (include interest rate) or expenses?  \n\n\\* And any other relevant financial information will be useful to give you a proper answer.  .  \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered investment adviser if you need professional support before making any financial decisions!",
        "num_comments": 2,
        "comments": [
            "Is Walmart stock worth buying?"
        ]
    },
    "Breaking: Nike stock price went down by 20%": {
        "title": "Breaking: Nike stock price went down by 20%",
        "score": 91,
        "url": "https://i.redd.it/usqvvcozoi9d1.jpeg",
        "content": "Meme ",
        "num_comments": 17,
        "comments": [
            "I’m a shareholder and avid sneakerhead/Nike fan - I thought I was crazy because I thought their recent lineup was just straight up uninteresting and a far far cry from 90s/2000s which I consider their golden age. But I thought hey, I guess that’s what sells. Well apparently it doesn’t! They’ve lost their way, forgot what made them the powerhouse sports band that commanded Apple-like followings. Stop making bland shit, look to your golden age for ideas or just retro the shit out of them. The Agassi collection is a great example of leading design/tech (what I would give if they retro that collection). Heck, even the older Lebrons were more interesting and the current ones. 23Engineered was interesting a few years ago but that fell off a cliff recently. I’m debating about picking up more shares because this looks like a solvable problem but maybe i have too much faith in the current leadership.",
            "The comeback though ! Is it the bottom idk will it get back to $166 idk ? I think it’s time to buy this stock",
            "If you look at the past 5 years or so it’s hit this level and rebounded each time.",
            "canary in the coal mine",
            "Just scooped up $10k. Dca is your friend 🙂",
            "It could be a good opportunity for the dividend portfolio.",
            "Jiminy Cricket Batman how will they ever recover from this!! Quick! Someone get Michael Jordan on the phone!!!",
            "As a fellow sneakerhead, something definitely different is going on with the company.  \n\nI have a friend who works on branding there and they are focusing on squeezing and cutting more than being original.",
            "You referring to the Air Tech Challenge 2 when you say Agassi collection?",
            "the canary's already dead by the time someone posts a 20% loss post."
        ]
    },
    "Stock market at all time highs, housing market at all time highs": {
        "title": "Stock market at all time highs, housing market at all time highs",
        "score": 109,
        "url": "https://www.reddit.com/r/StockMarket/comments/1dr1pu4/stock_market_at_all_time_highs_housing_market_at/",
        "content": "One must wonder why both the stock market and housing market are both at all time highs? The median price of a home sold in May was **$419,300** — an all-time record. As we know the stock market is at all time highs as well. Now lets look at what's driving the stock market to all time highs, not hard to figure it out its big tech. Wall St has a love fest with big tech right now. Just buy big tech and get rich right? Not so quick, those of you that remember the [dot.com](http://dot.com) bubble in the 90's remember how that ended. Between March 2000 and October 2002, the NASDAQ fell from 5,048 to 1,139, erasing nearly all of its gains during the dot-com bubble. By the end of 2001, most publicly traded dot-com companies had failed. I was a trader back then and bought many penny stocks that skyrocketed in price during the [dot.com](http://dot.com) boom. Lucky for me I cashed out around the highs before most of them went bankrupt. This brings me to the current AI-boom which I missed out on. I am not saying the AI-boom is not justified. However, the market has already deemed the new winners. Just like it was during the dotcom boom there were winners but many went bankrupt. We shall see how the AI boom evolves, but when a sector is only thing leading the market to new highs history tells us a crash will follow.\n\nNow lets look at housing. I lived through the first major correction in the housing market in 2008. I took my gains from the 90s dotcom boom and invested in real estate soon after. I got lucky and sold most of my real estate right before it crashed in 2008. The stock market and housing market crashes of 2008 trace their origins to the unprecedented growth of the subprime mortgage market that began in 1999. Could we have a repeat of previous events? Right now average people can not afford a home. Why is this? Could it be Wall St has become a major buyer of real estate remembering the government bailed them out last time, who knows. What I do know is what my ole grandpappy used to say, what goes up must come down. Baby boomers own most real estate and will soon be major sellers due to death or downsizing, this is just facts. Right now, boomers have a pretty large grip on the US housing market. The generation accounts for about 21% of the total US population, but they own 38% of American homes We shall see what happens in the future but history always repeats its self.\n\nCHEERS!!  \nMAV",
        "num_comments": 56,
        "comments": [
            "We’re probably mid cycle in a bull market. Too many people have doubts this can keep going up and to the right. Wait until everyone believes numba can only go up. Doesn’t feel like we’re there yet.",
            "We have a trifecta here.  Population is at an all-time high.  When does your grandpappy think we get back to the population numbers of previous generations?",
            "I’ve lost track of how many unsubstantiated points you tried to establish as patterns or rules",
            "Probably has something to do with the constant 2 trillion dollar spending packages getting passed every year and debt monetization and the resulting inflation.",
            "Price of groceries is at an all time high, the price of everything is at an all time high ..so why wouldn't the stock market be the same? Its a global thing.",
            "What are you trying to say? Both real estate and equities should be at least somewhat correlated. Both are investment opportunities with somewhat similar risk profiles. It isn't that surprising that when one is at ATH, so is the other. They should be influenced by many of the same macroeconomic trends.",
            "The fed printed trillions of dollars and handed them out to everyone.  This caused massive inflation and so here we are.",
            "It's because your money is worth less as a result of QE",
            "It’s fake😎 Watch it come crashing down after the elections. We don’t know when, but it will.",
            "And yet most of my stocks are down 30-60 percent. It's only a few big companies doing really really well.."
        ]
    },
    "Historical P/E ratio of the S&P 500. Current value is 26.": {
        "title": "Historical P/E ratio of the S&P 500. Current value is 26.",
        "score": 242,
        "url": "https://i.redd.it/2s72o5h9tc9d1.png",
        "content": "",
        "num_comments": 69,
        "comments": [
            "Those high peaks in 2000 and 2008 were caused by the massive drop in earnings.",
            "I would at most, keep this to the past 50 years",
            "Years ago, it was not easy to invest.  You had to use a broker.",
            "Yeah it's \"only\" 26 because most of the price growth concentrated in the top 10 companies or so.",
            "Looks kinda fine if you only consider the relevant last 20 years. Looking forward to some good pumps!",
            "It may seem low compared to those peaks in 2000 or 2008 but that was when the E in P/E had practically vanished due to a recession. So don’t look at this chart and think S&P 500 is ‘cheap’",
            "I don’t think comparing data from that long ago gives us good information. Maybe the PE will always be above the previous average because the market is more populated due to easy investing through our phones. Still interesting tho",
            "Interesting how much more chatter there has been in the data since 2021... I wonder if there were any significant events during that time which have gone unresolved... 🤔🤔🤔",
            "I wonder if any technological developments happened between the 1880’s and now.\n\nProbably not.",
            "I would love to see this charted against actual earnings.  If earnings are rising more quickly then higher PEs make sense."
        ]
    }
}