{
    "The Daily Check-In for Friday, June 28th: Just for today, I am NOT drinking!": {
        "title": "The Daily Check-In for Friday, June 28th: Just for today, I am NOT drinking!",
        "score": 267,
        "url": "https://www.reddit.com/r/stopdrinking/comments/1dqd2yf/the_daily_checkin_for_friday_june_28th_just_for/",
        "content": "*We may be anonymous strangers on the internet, but we have one thing in common. We may be a world apart, but we're here together!*\n\n**Welcome to the 24 hour pledge!**\n\nI'm pledging myself to not drinking today, and invite you to do the same.\n\nMaybe you're new to /r/stopdrinking and have a hard time deciding what to do next. Maybe you're like me and feel you need a daily commitment or maybe you've been sober for a long time and want to inspire others.\n\nIt doesn't matter if you're still hung over from a three day bender or been sober for years, if you just woke up or have already completed a sober day. For the next 24 hours, lets not drink alcohol!\n\n---\n\n**This pledge is a statement of intent.** Today we don't set out *trying* not to drink, we make a conscious decision *not to drink*. It sounds simple, but all of us know it can be hard and sometimes impossible. The group can support and inspire us, yet only one person can decide if we drink today. Give that person the right mindset!\n\nWhat happens if we can't keep to our pledge? We give up or try again. And since we're here in /r/stopdrinking, we're not ready to give up.\n\n**What this is:** A simple thread where we commit to not drinking alcohol for the next 24 hours, posting to show others that they're not alone and making a pledge to ourselves. Anybody can join and participate at any time, you do not have to be a regular at /r/stopdrinking or have followed the pledges from the beginning.\n\n**What this isn't:** A good place for a detailed introduction of yourself, directly seek advice or share lengthy stories. You'll get a more personal response in your own thread.\n\n---\n\nThis post goes up at:\n\n- US - Night/Early Morning\n- Europe - Morning\n- Asia and Australia - Evening/Night\n\nA link to the current Daily Check-In post  can always be found near the top of the sidebar.\n\n---\n\nGood morning sobernauts,\n\nTo me, your advice on yesterday’s topic gratitude, really marked a highlight, this week. Thank you!\n\nToday, I would like to discuss a serious topic, which is particularly relevant to me and probably the most of us.\n\n**Relapse prevention aka “seemingly trivial decisions”**\n\nRecently, me and my girlfriend were invited to a family barbecue by her aunt and uncle. It was still 2ish weeks until then, and I joyfully accepted, because I knew there will be a ton of homemade charr-grilled shashlik. My gf always asks me first out of consideration, because there is usually a lot of beer and vodka on the table. Her family knows about my alcoholism, so they wouldn´t offer me any, but it´s there. And usually, it doesn’t bother me at all. \n\nThe day comes, and I´m in a poor mood for a couple of days already. We went there anyway and looking at all the people smashing beers and vodka in beautiful sunny setting made me jealous.\n\nWe went home early, and my gf went to her night shift. My gfs daughter was spending the night at her dads. \n\nBOOM – there I was… the appartement to myself, the whole night and cravings as fuck. Mental gymnastics are setting in: “You can have a few…., nobody will know….”   FUCK NO!\n\nLuckily, I made the call to one of my friends from a sober group and we met up immediately and he helped me through it. But – close call – closer than ever in those 11 months I am sober now.\n\nI just wanted to share how a series of seemingly trivial decisions put me in a spot, I certainly didn’t want to be in. Endangering my sobriety. I should have cancelled the BBQ that day. \n\n**Question: Have you had a close call or relapsed out of a series of seemingly trivial decisions?**\n\nMy late dad always used to say: “The devil is a squirrel!”, Now I understand. \nMy dad died 2009 of liver failure, because he was an alcoholic btw….\n\nThat’s one more reason why…..\n\nI WILL NOT DRINK WITH YOU TODAY!\n\nTortey\n\nSorry for the long-winded post today, but tomorrow, there will be a special, so stay tuned! :-)\n",
        "num_comments": 707,
        "comments": [
            "Day 420. IWNDWYT.",
            "Day 13 (lucky for some)\n\nInsomnia has got me by the balls at the minute and I feel like I'm gonna be in for a rough weekend in terms of trying to resist the booze.\n\nI'm so sick of the cycle though. Sick of starting from square one.\n\nI might be hanging out here a lot over the next couple of days :)",
            "Day 4. ☕️ I’ve certainly been in similar situations, the alcoholic butterfly effect I guess. One slightly wrong move or event in early sobriety is probably better planned around or evaded. I skipped some work drinks this week in the scorching heat as my colleagues are very pro-booze. I think it gets easier to expose yourself to those things the longer you’re sober. IWNDWYT.",
            "I did not drink with you for a year! Thank you so much, and here's to another day of freedom.",
            "I will not drink with you today",
            "Day 12\n\nGood morning, lovley sober people ❤️\n\nThe temptation in this early days is everwhere. I work in the restaurant, so there it is. Just one shot, nobody needs to know, just small beer after shift, just one glass of bubbles at home. You name it, there it is.\n\nIt is going semi ok. I run home from work, try to keep myself busy at home, it feels like Im making up most banal tasks just to keep me occupied.\n\nHubby is going out tomorrow with our drinking buddies. I still dont feel I can socialise too much, at least not with those people, but I don't plan on stopping him, he is not the one with the problem. \n\nI will spent the night reading my journal from past days, specially first ones, to remember myself why I don't want to be there. Last year, after 2 and something months sober, I fell into moderating trap and found myself on the ground with fucked up face 10 months later. Not doing it again.\n\nIWNDWYT ❤️",
            "Day 2:  IWNDWYT. \n\nFor once, it was lovely to wake up without that pervasive shame cloud. \n\nGreat post, the devil IS a squirrel.",
            "Checking in from NZ, day 41",
            "Day 1104 checking in!",
            "IWNDWYT!"
        ]
    },
    "Saturday Shares for June 29, 2024": {
        "title": "Saturday Shares for June 29, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/stopdrinking/comments/1dr1doy/saturday_shares_for_june_29_2024/",
        "content": "Hello Fellow Sobernauts!\n\n[Last week](https://www.reddit.com/r/stopdrinking/comments/1dlmiqh/saturday_shares_for_june_22_2024/) saw a just a couple shares:\n\n- /u/Ares3003 [hit a week sober and enjoyed quality time with loved ones](https://reddit.com/r/stopdrinking/comments/1dlmiqh/saturday_shares_for_june_22_2024/l9sj3yu/)\n- /u/nohandsfootball [had a good night of sober sleep](https://reddit.com/r/stopdrinking/comments/1dlmiqh/saturday_shares_for_june_22_2024/l9um0ix/)\n- **/u/DesignerSea494 [had a beautiful share](https://reddit.com/r/stopdrinking/comments/1dlmiqh/saturday_shares_for_june_22_2024/l9usncg/)**\n- /u/FTSeeOwboys [started a new job with a strong drinking culture](https://reddit.com/r/stopdrinking/comments/1dlmiqh/saturday_shares_for_june_22_2024/l9w2k8m/)\n\nIf you feel like sharing, go ahead and drop your share in the comments and I'll link to it in next Saturday's post. Feel free to share whatever, and however much, of your story as you want. Please keep in mind the [community guidelines](http://is.gd/sdfaq) for posts. You might want to follow this loose structure:\n\n- Some background on your drinking\n- Why you sought to get sober\n- How your life has been in sobriety\n\nAlso, feel free to make an actual post and tag it \"Saturday Share\" and I'll be sure to include it in next week's round up.\n\nIWNDWYT",
        "num_comments": 6,
        "comments": [
            "Last weekend was awful and I was an emotional mess. But I worked through those emotions and Tuesday I just had this intense moment of peace. And I’ve honestly been pretty much just peaceful ever since, regardless of what is going on. It’s pretty great.",
            "Day 8! Going on a vacation with husband and kids and it will be my first time going to this place not drinking. Really looking forward to it as well as building new sober neural pathways. IWNDWYT!",
            "After dipping my toes back into the sand as they say, I again realized that I get horrendous anxiety multiple days after drinking.  It's not just 1, maybe 2, its now 3 and sometimes 4 days afterwards.\n\nI already feel a billion times better after only a few days away from the booze.  Self esteem has sky rocketed and life in general is better.\n\nI used to be able to party and put on my work clothes and take care of business, but that's just not the case anymore.",
            "Got a call at 10pm last night, my elderly parents were stuck in the middle of nowhere as the bus they were on had broken down and a repair or replacement was hours away. Of course usually on a Friday night I'd be well over the drink-drive limit. Instead I picked up my keys, got in the car and had them picked up within half an hour and delivered to their door half an hour after that.\n\n1 week in now and feeling good about myself, which is a nice feeling that I want to hang onto.",
            "14 days today. I can’t remember the last time I’ve been this long without drinking - Im going to say 20years ( fuck that’s rough to type out) \n\nThis sub, the DCI and I am Sober app have been great for me to check in on during the day and remind myself why I will not drink with you today. \n\nI commented this on another post last night..\n\n\nSomething that’s working for me - I’m using the I am Sober App and everyday when I check in it asks for your emotions for the day. I always put Proud, Happy and Confident ( even when it’s a rough day), it’s an attempt to retrain my brain into actually feeling that way !\n\nWatch your thoughts, they become your words; watch your words, they become your actions; watch your actions, they become your habits; watch your habits, they become your character; watch your character, it becomes your destiny. Lao Tzu\n\nI WILL NOT DEINK WITH YOU TODAY 🙌",
            "Congrats on making it a whole week!! That is really big. \n\n\nI just got back from my first sober vacation last week. It was wonderful. Yes, there were a couple of moments I wanted to drink, but I used those as learning moments to better understand why I drink. It was so nice to be fully present with my family, really enjoy the days, and my goodness the mornings are sublime, doing my own thing, no work... \n\n\nKeep up the great work and I hope you have a fabulous vacation :)"
        ]
    },
    "Who’s Gladly Not Drinking on a Friday Night?!": {
        "title": "Who’s Gladly Not Drinking on a Friday Night?!",
        "score": 130,
        "url": "https://www.reddit.com/r/stopdrinking/comments/1dr2ja7/whos_gladly_not_drinking_on_a_friday_night/",
        "content": "Man, what a potential for a relapse. Family is gone for a couple nights, it’s beautiful outside, Friday night, I have a fridge oddly stocked with leftovers from my favorite Chinese AND Indian restaurants, got my dog with me, Netflix lined up, and I’m not craving anything else. \n\nThanks to a newfound (although definitely hard-won) freedom and happiness after intense work on steps 2 and 3 in my PHP program, I’m cracking an ice cold la croix and will enjoy everything with gratitude for being sober and present, and for the gifts I am fortunate to receive. What a feeling. First of its kind in this situation. \n\nOld, shitty me would be halfway through a 6 pack of high ABV beers, opened the minute my family rolled out the driveway, I would have likely spilled food on my shirt, barely remembered the show and would have to rewatch it, neglected my dog, and probably spent a moment or 5 wallowing in some form of self-pity, waking up on the couch at 3am with the lights on. \n\nFUCK. THAT.\n\nRaising a non-alc bev to this community that I have leaned on often. Hope a lot of you are similarly having a genuinely good evening and if you’re struggling, I raise it to you too — giving up the booze is saying yes to a better life. ",
        "num_comments": 28,
        "comments": [
            "I drank 4 Spindrift seltzers with lime and a ton of still water. It was a crazy time...:)",
            "Well said! Raising my NA IPA to you on this beautiful summer night. It's such a great feeling to be rolling into the weekend sober and healthy. IWNDWYT!",
            "Me! I joined some friends for a backyard get together but couldn't last more than an hour with everyone else drinking so I left and bought a cherry pie lol time to eat some feelings and play some video games!",
            "I’m in the exact same boat. I have been so happy tonight, eating food I made at home. Watching old movies. Hanging with my dog. Watching the rain…and being sober for it. I’ll remember it tomorrow….when I wake up without a hangover and ready to get things done, and then off to have fun with a friend. In the old days, since I didn’t have anything scheduled, I would have just slept all day. \n\nI like this a whole lot better.",
            "Meee!! Woke up hungover af and wanted to drink to \"help\" it but stuck through the pain instead and feeling better now, gonna feel even better in the morning YEE",
            "Kinda great not waking up with a hang over on a Saturday.",
            "Me! I recently took a break from my break.  I went 6 months without a single drop, and then decided to imbibe while on vacation.  This was a planned move. I didn't \"give in\" to anything.  \n\nI was worried that the first Friday night after I got back home would be a bit of a mental struggle, since that was the biggest challenge when I initially quit but nope. Right back on track.",
            "I'll never miss waking up at 3 am on the couch with the lights on. Nope. That just made me shudder. Had a chill night at home watching movies with my hubs and laughing at his silly commentary. Hung out here throwing support and love around, and got it back in spades. \n Drank about ohhh 6-7 flavoured water and mio with frozen cherries. 🤣 Fuck you Friday. I owned your ass today ! 👊😁🙌🙌",
            "Had the same thoughts, but was smart enough to immediately think about how fast a fun (hour or two max) and nice Friday night is replaced with a miserable (10+ hours) morning and crappy sleep. No thank you.  IWNDWYT",
            "I’m rewatching the Office Superfan episodes. First time I watched them I was always drunk so it’s kinda like I’m watching them for the first time."
        ]
    },
    "Anyone Been To Jail Cause Of Alcohol ": {
        "title": "Anyone Been To Jail Cause Of Alcohol ",
        "score": 401,
        "url": "https://www.reddit.com/r/stopdrinking/comments/1dqusb2/anyone_been_to_jail_cause_of_alcohol/",
        "content": "I might need to post this elsewhere but not sure where.\n\nI did a 3 month stint which I got out on last Friday thanks to a DUI.  Even for that little amount of time I've had a sensory overload of all the TV and info and smartphone etc they the last two days I have retreated to my bedroom just to feel safe and read books.\n\nThis wasn't my first DUI arrest but it's the one that caught up to me.  Being locked up forced me into sobriety wether I liked it or not and personally I want to thank the judge.  It gave me a lot of time to think and reevaluate life.  I have made some short term goals I'm in the process of accomplishing. \n\nIWNNDWYT",
        "num_comments": 148,
        "comments": [
            "I think it’s a great place to post this but I do want to remind everyone that we don’t do any one up contests or horror stories here.  But I think the subject of jail time as a catalyst for recovery is a great topic. So glad to hear you’re on your way, OP!!",
            "I’ve only been to jail because of alcohol.",
            "Yes. 3x. 0/10 do not recommend.",
            "What I did I regret every single day.",
            "Jail no, woke up in the ER though. That was 102 days ago. Been sober ever since.",
            "I’m 38 and just starting my sober journey.\n\nIn my 20’s i spent the night in the “drunk tank” on 3 separate occasions for public intoxication.\n\nThey should’ve been wake-up calls but were treated as funny drinking stories.",
            "3 months oof. I'm sure you're happy to be out. The sensory overload will calm down quickly, within a few days to a week. Stay sober brother. Next stop is prison. Good reminder to us all that this addiction ends in death or prison. No happy endings.",
            "I want to wish you all the best and success for your journey.   \nIWNNDWYT",
            "Been arrested twice. Only spent a total of 3 nights in holding. Very grateful I was fortunate to get out with an ACD both times.\n\nSecond time I voluntarily went to rehab within a few days of arrest and that helped greatly when it came to my judgement.\n\nBeen sober ever since going on 8.5 years.",
            "Since I've been sober, I have not spoken to a police officer once. And let me tell you, it's fucking great\n\nIn the end of my drinking days alcohol only ever caused me problems. Financial, relationship, work, and problems with the law\n\nI still have problems, but I am damn glad to be rid of the ones cause by drinking\n\nGood luck to you, friend"
        ]
    },
    "Just threw my entire life away": {
        "title": "Just threw my entire life away",
        "score": 95,
        "url": "https://www.reddit.com/r/stopdrinking/comments/1dr335t/just_threw_my_entire_life_away/",
        "content": "Quit my job, called all of my friends and told them bye. No suicidal tendencies or ideations, I just know that I can’t keep living this way because alcohol has completely taken over my life in a way that I never imagined and I need to get help. My family is supportive in the fact I am admitting to my substance abuse issues and they are willing to help me. \n\nBeen a longtime lurker, I don’t post that’s often and y’all have been a great support for me in my worst days but I cannot quit on my own. Going to a treatment facility this weekend because my physical dependency of alcohol is going to kill me if I don’t quit without outside help. I wish you all the best, and I hope I see y’all on the other side!",
        "num_comments": 18,
        "comments": [
            "I kinda view rehab as taking life back rather than throwing it away.",
            "Congrats on taking the right steps! We are here for ya! Let us know how it went. \n\nIWNDWYT",
            "Smart decision. You’ll look back fondly on these days soon, it’s the beginning of your new life!",
            "Sounds like you did the exact opposite of throwing your life away. My sobriety truly started with asking for help and having a supportive family. It continued by truly putting in work in outpatient rehab. I’m proud of you.",
            "Good on you.  It’s only up from here.",
            "So excited for you, you got this!",
            "Proud of you!!",
            "Congratulations and proud of you for taking these hard steps.",
            "So happy for you! This is the best possible outcome. IWNDWYT",
            "Best decision you've ever made."
        ]
    }
}