{
    "Kim Jong un Gay Awakening fanfic (page 1)": {
        "title": "Kim Jong un Gay Awakening fanfic (page 1)",
        "score": 114,
        "url": "https://www.reddit.com/r/stories/comments/195kq28/kim_jong_un_gay_awakening_fanfic_page_1/",
        "content": "\nSomeone requested I make this story. Then someone else requested I post it here. Enjoy.\n\nIt was 7:00AM, July the 4th. A young dictator named Kim Jong Un had an important meeting with the US president in just a few hours. This meeting was one of many on his to do list. No big deal normally but this time he felt something strange, a feeling he wouldn’t normally feel for these meetings. Maybe something important was to come, perhaps he overhead talk of economic prosperity earlier this week that had somehow snuck into the back of his mind. It made Kimchi boy think. Not to think too hard and stress himself out, Kim decided to shake it off. His mental health came first. No need for stress. The dictator proceeded to climb out of bed and put on his regular businesses suit. He tied his best shoes on ready to start the day. Kim couldn’t help but take a look at his gorgeous self in the mirror, as per usual. His beautiful body was something to take a gander at. He couldn’t help but feel he looked heavier today, his skin noticeably imperfect, as well as his hair unusually frizzier. Anxiously, the young dictator ran to grab his bathroom scale. Not a single pound gained as he stepped on. “That can’t be right”. Kim stepped on the scale one more time. The number being the same. He measured his waist and thighs. Nothing different. “I understand  now, it’s the suit.” “The housemaid must have shrunk it accidentally” what a relief, it was his outfit not his body that was the issue. The beautiful dictator pulled out a gun and swiftly executed the nearest housekeeper. “I’ll wear this suit, I haven’t put it on since I bought it so it should be okay” as he put on the suit he still couldn’t help but feel dissatisfied with his body. His usual beautiful appearance not just felt so inadequate, with there being nothing left to do the tight bodied dictator averted his eyes from the mirror and walked out the bedroom door. Feeling defeated and anxious as he strutted down the hallway. His staff greeted him with the usual. “Good morning Kim, looking fit as always” “good morning Mr. Dictator, your hair looks beautiful today”. Their kind words feeling somehow patronizing today. “Why must they all pay attention to my body today?” “Why do they keep patronizing me” “why are they secretly mocking me, these assholes I hate them just leave me alone”. The young dictator’s mind racing with negative thought. “SHUT UP ALL OF YOU, GUARDS EXECUTE THESE FAKES!” “HOW DARE YOU MOCK ME”. Kims shouting was enough to silence the whole room. One by one his housekeepers executed in front of him. He continued down the hallway and to the dining hall. A long table filled with a feast fit for a god was presented to him. Yet again he felt distain. His fast metabolism brought him comfort most mornings, looking at the plates of eggs, bacon, sweets and fried food was normally no challenge to him as he did not need to watch what he ate. “ I’m not hungry” kimchi told the chef. “ but sir, your metabolism. If we don’t get your 5,000 calories in per meal your body will starve!” Again kimmy boy grew angry. “I see now” he exclaimed. “YOURE TRGING TO MAKE ME FAT” “GUARDS EXECUTE THIS CHEF FOR TREASON”. One more body on the floor. Another favorite staff member of his now dead. \n\n\n\n(Page 1. Page 2 comming soon)",
        "num_comments": 72,
        "comments": [
            "Wuh....wha.....what?",
            "What the fuck lol",
            "That was so good!",
            "Reminds me of the movie \" the dictator\" 😂",
            " I love reading the stories posted here as many of you do, I started a  channel designed to tell these stories creatively. If you are interested  at all please subscribe and help me fulfill my dreams!!!  \n[https://www.youtube.com/@RedditorsGalore](https://www.youtube.com/@RedditorsGalore)",
            "what just what  oh k  i hate this",
            "[deleted]",
            "My freshman kid is part of science Olympiad, and she has got a 1st places in one of the science Olympiad torments. I was and is proud of my daughter, and I posted on the high school group chat. I was hoping that parents would be happy and proud of my daughter because she is a freshman, she represents the school and she bit everyone, included older kids. The message was send to parents of freshmen kids and how they should be proud of them. The parent who created the group chat and brags about her 10th grade daughter, did not like that my daughter won over older kids and other nyc schools. She said my daughter won because of money and not her brain. I send her a message back that she has to be proud of freshmen not only her daughter. Anyway, she dropped me from the chat, her admirers were gossip about me. They found my personal information and posted on group chat, my phone, my name and home address. I contacted the principal, but no word from the school since she is part of PA and she things money can solve everything. No brain is required, you can buy everything with money. This parent remained me college scandal!! Can I do anything legal to protect myself and my kid?  Please help me post this story, so I can see comments on it. Thank you so much ",
            "page 2 release date?",
            "You have been banned from r/Pyongyang"
        ]
    },
    "I got to say Cuck Today! A tribute to some of my more adoring fans. ": {
        "title": "I got to say Cuck Today! A tribute to some of my more adoring fans. ",
        "score": 15,
        "url": "https://www.reddit.com/r/stories/comments/1dpv02k/i_got_to_say_cuck_today_a_tribute_to_some_of_my/",
        "content": "As I sit here in my Mom's Basement, dick in one hand, Slim Jim in the other.  Well, I guess you could say Slim Jim in both hands. Got the lap top open on the TV tray right next to me, Reddit on the screen.  Just looking for something to get me going.  \n\nAnd just like that! There it is! Some guys thinking about giving his girlfriend another chance.  My inner Randy Savage surfaces, \"Ooohhhhh Yeeeaahh, It's Playtime.\"   My heart races, the sweat forms upon my brow before my middle finger even graces the caps lock.  By time I've typed the 2nd \"C\" I can barely contain myself.\n\nThe Rush...The Release...The Ecstasy....I got to say Cuck today!!!\n\nI hurry over to my Private Facebook Group \"Patriots of Higgins Town\" to spread the word.  \n\n\"FELLAS, there's a guy talking about taking his girlfriend back, we get to say CUCK today!!\"\n\nEarl types furiously, \"Goddamn it Jeff, you got say basement warning first, I'm sitting here on my mom's couch no shirt on, gray sweatpants, give a guy a heads up.  Luckily she's already on her 3rd Whiskey Sour of the morning otherwise that would have been really embarrassing.  You heard him Boy's we got a live one on the Cuck Line\" \n\nJerry pops in, \"My mom won't let me in the basement no more after I ruined another hand towel.\"\n\nEarl fires back, \"For fuck sake Jerry, just use your socks, this guy says his girlfriend dated another guy when they were broke up, we might not get another chance like this for 12 hours.\"\n\nJerry fired up, types back emphatically, \"Yeah! Fuck you Mom, I go where I want.  TO THE BASEMENT!!!\"\n\nThe beauty of the next 17 minutes was indescribable.  A dozen grown men at 10:45 in the morning, giving unified voice.  We focus all 94 days of our combined relationship experience into every comment.  Unleashing our original wit upon the OP:\n\n\"CUCK\" .... \"Your a Cuck\".....\"what a fucking cuck\"....\"Cucck\"....and finally, I come back with the ultimate finisher \"you r a simp cuck lol\"\n\nThey have no response, at least I think they don't, I can't see the post anymore.  But nonetheless.....\n\nI got to say cuck today!",
        "num_comments": 6,
        "comments": [
            "Reddit needs a new mandatory acronym. NSFMH. Not safe for mental health. I feel like I need a shower now.",
            "LOL'd hard on this! One of the funnier things I've read today!",
            "Try it now",
            "Ok, that was funny.",
            "🤣😂🤣😂🤣😂🤣😂🤣😂🤣😂🤣😂",
            "That's not a bad idea"
        ]
    },
    "My girlfriend took a break from me and spent the summer with another guy, so she could \"be sure\" I was the one. Part 5 (Zoey's Post)": {
        "title": "My girlfriend took a break from me and spent the summer with another guy, so she could \"be sure\" I was the one. Part 5 (Zoey's Post)",
        "score": 30,
        "url": "https://www.reddit.com/r/stories/comments/1dqviuz/my_girlfriend_took_a_break_from_me_and_spent_the/",
        "content": "I've never posted on here before, but for those who followed my husband Sam over the years, I am Zoey.  I linked his last post to this one.  I'm only doing this because a lot of you showed him tremendous support, which I appreciate, and hope that anyone who finds themselves going through crisis like he was will get help.  \n\nThose who followed him know that 6 months ago we had an incident where he fell asleep while watching our son Stephen.  I wasn't angry, and I didn't blame him.  I knew he was having a hard time.  I was afraid.  I had been trying to get him to get help for awhile at that point, and with the emotion on the moment he snapped, and lashed out.  He hadn't done so in many years.  \n\nAt that point I made a horrible mistake I regret more than all my other life regrets combined.  I was frustrated, but thought a little space would help us both diffuse.  I was calm, I told him I just needed a break.  I meant just for a few hours and we went to my Mother's house.  I never should have left him alone.  \n\nAbout an hour and half later I got a call from my brother.  He was so distressed.  He had gotten a text from Sam asking for some help in the basement and to just let himself in. That's where he found him.  He had hung himself from the basement ceiling.  \n\nI hate that I couldn't see it sooner, years went by before I really started to notice.  Its just so hard when you're young.  I was working too, we were trying to buy a house, and have kids, travel.  It was a whirlwind.  When Stephen came I started to stay home.  That's when I finally noticed.  There had been hints, I just didn't want to see it I guess.  \n\nYou just don't want to admit things to yourself.  You want to think he did all this just because he wants to.  You think you're reciprocating it.  Reading his posts, I didn't even realize how much I missed.  I know he was actively hiding his stress and habits.  I know he rug swept all his emotions that could be taken negatively.  But there were hints, why couldn't I see them?\n\nI'm the catalyst of his descent.  I know I didn't deserve him after what I did.  I've felt that shame for 8 years now.  I've done everything I could think of to repent for my choices.  I won't justify them, I was wrong, and I hurt someone I love beyond measure. \n\nI'm sure some of you wonder how I could do that to him. I wonder that myself often.  It's easy to throw out the usual excuses, I was young, I was immature.  To tell you the actual truth it really was just FOMO.  Combined with having a few \"friends\" in my ear, which I now realize they were not friends, and a school girl crush on a classmate was all it took for me to traumatize the most important person in my life.  It sounds so dumb written out, but it's true.  The NRE lasted about a month, then it was 3 weeks of making up reasons to see it through.  By time I left I knew I had made a huge mistake, and came crawling back.  I still shutter thinking how much I compartmentalized.  The sight of him when I showed up has always haunted me.  It's guilt I deserve and will always hold on to. \n\nFor all the remorse I feel over what I did when I was 21, it pales to the feelings I have not being able to help him before it was too late. I think I have read his posts almost everyday in these last 6 months. I failed him so much, I'll hold on to this pain for the rest of my life.  I'll have to watch our son grow up without his father.  Nothing will ever fill this void. \n\nI don't know what I wanted to accomplish with this, though it's been surprisingly cathartic.  Maybe this will help someone else, someone holding onto something they can't handle on their own.  If that's you seek help, it's not weakness, it's strength.  No one is perfect.  No one can do it ALL on their own. ",
        "num_comments": 28,
        "comments": [
            "Another great story! I know they are fiction but I still get so wrapped up in them.",
            "For those unfamiliar, NRE stands for New Relationship Energy.  Had to look it up myself.",
            "She broke a good man. I hope she's happy...\n\nPS: I know its fiction. Felt I had to call her out the harlot!",
            "Good story.\n\nFor all the Zoeys out there, just leave and don't return. If you force a break to find something,know you are leaving devastation behind you.\n\nComing back means the heartbreak is always right there, in your life, in your bed and in your heart.",
            "Sometimes taking a break isn't a solution but a silent cry for help.",
            "Oh, man. I was afraid this would happen. Another good story, but so depressing 😭",
            "Good story!\n. i was thinking it was going to be a double murder suicide about how she would never be able to leave him again.",
            "If this was a tv show, it would end with contact information for the national suicide prevention helpline.",
            "Probably a creative writing project…but if so, great work!! \n\nYou made me hate Zoe more than Skyler from Breaking Bad….and I really hate that bitch.\n\nOn the off chance this is real, Zoe…you’re a piece of shit.",
            "Oh no! Sam deserved SO much better than Zoey and a noose.\n\nI did fill a smidgen of sadness for her, but the hatred and disdain I also felt far outweighed it, so F-her!\n\nEven with this story taking a different journey to your previous ones, I  still enjoyed it.\n\nHave you ever thought of publishing a book of short stories? I'd buy it!\n\nI'm just saying TheStoryBoy."
        ]
    },
    "My girlfriend took a break from me and spent the summer with another guy, so she could \"be sure\" I was the one. Part 4": {
        "title": "My girlfriend took a break from me and spent the summer with another guy, so she could \"be sure\" I was the one. Part 4",
        "score": 42,
        "url": "https://www.reddit.com/r/stories/comments/1dqq888/my_girlfriend_took_a_break_from_me_and_spent_the/",
        "content": "[Part 3](https://www.reddit.com/r/stories/s/sZeJh55tNK)\n\nI've failed.  It's all fallen apart.  This last year she has been pushing me. Ever since she became a SAHM she became more aware of my habits.  She wants me to see a therapist.  She even offers couples counseling.  I don't need a therapist, that implies there's something wrong with me.  How can there be something wrong, I do it all, I've done it all forever.   I tell her I'm fine, I don't know why she won't accept that.  She keeps saying I don't sleep enough, I have workout addiction, I seem paranoid, I have no social life.  I do those things to give us the life she wants, I stay fit for her, I'm not paranoid I am just deligent of others.  \n\nShe has been going on about our lives and I point out how well I've handled everything all these years, why does she think I can't now.  I can keep going, I don't need a break.  And yeah I faltered today, but they'll never have to worry about that happening again.  \n\nIt was her, she brought up the past more and more.  She thinks it stems from when she left, and maybe it does, but I don't want to go back there.  That was so long ago, and I've done so well since then.  She just won't let it go.  She keeps apologizing, and telling me she loves me, and wants the best for me.  I know all that. She says I can't keep this up, says she knows how I feel, says I need help.  She doesn't know.  No one knows.  \n\nThen this morning happened.  It's was just once.  She went grocery shopping, I stayed with Stephen.  I was focused, I was playing with him.  Then we started watching Spidey and Friends, and just sitting on the couch.  I didn't mean to fall asleep, he was right by me. Zoey came home found him in the kitchen, he had gotten into 2 boxes of cereal, it was everywhere.  \n\nI popped up, immediately began to help, apologized.  She scooped him up told me to stop and relax.  But there was this huge mess.  She said I was manic, that this was what she was talking about.  That I need to rest, I need to talk to a therapist.  I snapped.  I screamed at her.  I told her to drop it, to appreciate what she has, that I was fucking fine, and wasn't some loser who needed help, I was better than that, better than everyone.  \n\nShe just stood there and took it.  Then she looked me right in the eye and said, \"Do not scream and cuss at me, I know you are struggling, it's okay, go lay down.  You need to rest.\" Then she grabbed Stephens go bag, took him and started for the door.\n\nI asked where she was going, she said, \" Just rest please, I'm going to my Mother's, I'm just taking a break.\"\n\nA break.  I just stood there, quietly, watched her walk out.  She needs a break.  The last time there was a break it broke me.  I have done so much  and it wasn't enough.  I still failed to protect my son and that's it, she's not coming back.  I failed as husband and a father.  \n\nI texted her brother.  Asked if he would come, he said he will be here in an hour.  That should be it then, for those of you who followed me all these years I guess you were right, no ones good enough, not even me.  ",
        "num_comments": 45,
        "comments": [
            "Good depiction of someone succumbing to obsession and mania.  What a tragedy his asshole wife started it by needing to go comparison shopping for someone better.",
            "Ooohhhh boy it's getting saucy!! I'm calling it now the next update will be the wife!!",
            "What’s the betting that the next update will come from the wife reporting that her brother found her husband dead on the floor.",
            "He is cracking up. \n\nI'm not sure how many more parts this story has left, but please let him agree to therapy. Maybe then he'll realise that his self-destructive behaviour all stems from his wife's (then gf) cheating and leaving him for her AP and only returning when her AP kicked her to the kerb.\n\nI really feel for him.\n\nI'm so glad that this is fiction, though.\n\nWay to really make me care for a fictional character!",
            "Nice story, but seriously, if someone needs a break to decide, you definitely aren't right for each other.",
            "His wife is correct about him being manic. He’s afraid he’s not good enough for her and is going overboard to prove his worth to his wife. In the end, he’s gonna either suffer a stroke or heart attack, because he’s unwilling to accept the fact that he is good enough “as is”! He’s literally working himself to death without realizing that no one on their deathbed ever wishes they’d spent more time working at the office. He will wish he’d spent more time with his loved ones, but by that time it will be too late!",
            "Man, your stories are so riveting! So glad I found that TikTok and the commenter who pointed to you as the author! Hope you are getting some credit from the person who is using your stories.",
            "These keep getting better. I am afraid what the brother is going to find when he gets there.",
            "Scream at everyone who tells you that you need help, that will work. It's everyone else not you.",
            "Damn MC still killing himself over a woman that doesn't truly love him and never did. Honestly heartbreaking. I hope Part 5 gives him some peace and some karmic justice to Zoey."
        ]
    },
    "I made my grandfather eat licked Pringle’s": {
        "title": "I made my grandfather eat licked Pringle’s",
        "score": 26,
        "url": "https://www.reddit.com/r/stories/comments/1dqsnnk/i_made_my_grandfather_eat_licked_pringles/",
        "content": "My grandpa bought a can of chili lime Pringle’s and had told me he didn’t really care for the flavor. In my thirteen year old brain, that translated to “you can have the rest of these” but I was on some sort of a weight loss journey at the time and ended up just licking the seasoning off of all the chips and stacking them back in the can to come back for later (super gross, I know) so I put the can back in the cupboard with the full intention of eating them the next day. Well, I get home from school the next day and head over to the cupboard for my afternoon snack and to my absolute shock and horror, I find the empty can sitting at the top of the trash bag.\n\nMe and my grandfather were the only people living in the house at the time. I'm 23 now and to this day, I still haven’t had the heart to tell him.",
        "num_comments": 12,
        "comments": [
            "Reminds me of the joke about the teenager who went to visit his grandmother in the hospital. She was sleeping so he sat down until she woke up. Noticing a jar of peanuts on her side table, he helped himself and before he knew it, he had eaten them all.\n\nWhen she woke up, he apologized and told her he had eaten them. She responded \"That's OK Sonny, I wasn't going to eat them anyway, I already sucked the chocolate off them\"",
            "This is one of the things I think is best to leave him in ignorance. I'll probably take this one to my grave.",
            "Never ever tell anyone what you did.",
            "When I was growing up, we had a couple dozen acres of land with some cows and a bunch of trees. We had a large fire pit about 20 feet across that we would burn branches and trees when they died or needed trimming. The pit would occasionally get an in or so of water in it, and the cows liked to drink the water. Oftentimes, they would also poop in the water, and so it was a muddy mess. \n\nOne day, I had brought a can of soda out while doing various jobs and finished the drink. I wanted to mess with my brother, and so I filled the can with water from the fire pit. My brother never came over and so I set the can down and forgot about it. The plan was to offer it to him but prevent him from actually drinking it when he went for it.  My dad then came by after I had wandered off and, seeing a can of soda, took a huge swig of it and swallowed before he tasted that it wasn't actually soda. He was sick for several days afterwards. I still feel bad for it.",
            "Reminds me of a story I read in a readers digest years ago.\n\nA neighbour gifted a large bag of Brazil nuts to a family every Xmas, he seemingly got them as a gift but didn't like them.\n\nEventually someone questioned why he didn't ask for something different?\n\nHe explained that he liked the chocolate around the outside, just not the nuts.",
            "Yeah - just pretend that never happened 🤢",
            "I would have to tell him, after a month.",
            "Shit, my wife did this to me. She would lick the Salt and Vinegar Pringles and stack them next to her on the couch. I wasn't paying attention and I had one or two, and thought \"why are these chips damp?\"  She had a good laugh and I was extremely grossed out.  She now licks the seasoning off her chips and feeds them to the dog.",
            "Haha. This belongs in r/foundSatan.",
            "This is like the grape in the door jam story."
        ]
    }
}