{
    "For all UFO/Alien/UAP news": {
        "title": "For all UFO/Alien/UAP news",
        "score": 14,
        "url": "https://uapnewscenter.com/",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Ray Kurzweil: in the 2030s we will have nanobots in our brains, expanding our intelligence a million-fold by 2045, enhancing human flourishing and leading to the Singularity": {
        "title": "Ray Kurzweil: in the 2030s we will have nanobots in our brains, expanding our intelligence a million-fold by 2045, enhancing human flourishing and leading to the Singularity",
        "score": 62,
        "url": "https://v.redd.it/h97a4855uh9d1",
        "content": "",
        "num_comments": 49,
        "comments": [
            "These fools live in a bubble of their own perceived reality.  They have never left their corner of the world and believe all the bs they speak.",
            "Got nano dots in the suspenders. Baaaazoong",
            "we wont be able to afford...just the elites",
            "Only \"some\" of us will...",
            "There's more to reality than spacetime. Some prefer to explore the physical, some prefer to explore consciousness.",
            "According to his wig and suspenders I’m going to say this guys is dreaming he’s going to be funnier and sexier.",
            "uhmmm a BIG FAT NO!",
            "Doubt it,greedy rich cunts are gonna ruin everything",
            "I wish. I wanna enhance my being.",
            "I want to know how he got his hair back"
        ]
    },
    "What is going on here?! This dark colour came out of the sky from nowhere with a straight line down to the ground…": {
        "title": "What is going on here?! This dark colour came out of the sky from nowhere with a straight line down to the ground…",
        "score": 435,
        "url": "https://v.redd.it/o2a0vefm1e9d1",
        "content": "Seen in Hull, England- today ",
        "num_comments": 109,
        "comments": [
            "It's the dark tower. The crimson king awaits.",
            "Cool vid. The sky alone looks magnificent! But yeh that is a little odd tbf",
            "Hmm interesting. Looking at natural phenomena, could it be a precipitation shaft or virga? Not sure if that explains the part of the line above the clouds, but I'm also no meteorologist.",
            "The Earth got a boner",
            "A water spout? Or whatever its called. Its a heavt downpour of rain a single spot kinda drags the clouds down with it",
            "Noctilucent clouds*   Seemingly a very good example of them too.  Essentially they are electrically charged gases in the high atmosphere that remain illuminated when the sun is just below the horizon.  Due to the 8 min trip those photons took to get there, id guess this was taken within 10 mins of sunset.",
            "That’s called a thruster cloud, it builds in strength and girth, extending into and eventually penetrating the cloud flap above, seeding it with heavy warm moist air from below.",
            "Is that not the reckits chimney down stone ferry lane?",
            "Apple doing a lot of promotion for Invasion Season 3.",
            "OH I KNOW THIS, I DO!!! ITS A SPACE-X ROCKET LAUNCHING 1,000 BALLOON DRONES INTO THE SPOTLIGHTS FROM AN EXPANSIVE CONCERT!!!\n\nDid I do it right guys? Did I say the right stuff?"
        ]
    },
    "Göbekli Tepe (left) versus Khakassia (right). Khakassia is a natural & archaeological marvel in Siberia, Russia. It's Russia’s smallest region, but is also one of Russia’s undiscovered historical gems and considered a mecca of archaeological discoveries. To be continued...": {
        "title": "Göbekli Tepe (left) versus Khakassia (right). Khakassia is a natural & archaeological marvel in Siberia, Russia. It's Russia’s smallest region, but is also one of Russia’s undiscovered historical gems and considered a mecca of archaeological discoveries. To be continued...",
        "score": 37,
        "url": "https://i.redd.it/02j46uw59h9d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Good find!"
        ]
    },
    "Despite indefinite landing hold, NASA insists Boeing Starliner crew not \"stranded\" in space": {
        "title": "Despite indefinite landing hold, NASA insists Boeing Starliner crew not \"stranded\" in space",
        "score": 177,
        "url": "https://i.redd.it/kqob28hlle9d1.jpeg",
        "content": "The return to Earth of Boeing's Starliner capsule is on indefinite hold pending results of new thruster tests and ongoing analysis of helium leaks that cropped up during the ship's rendezvous with the International Space Station, NASA announced Friday\n\n\"We don't have a targeted (landing) date today,\" Steve Stich, NASA's Commercial Crew Program manager, told reporters during a teleconference. \"We're not going to target a specific date until we get that testing completed.\n\nAfter several failed attempts to launch, and now an indefinite landong hold, the future looks rocky for Boeing's space endeavors.\n\nNASA claims in order to get the crew back to earth they need to: \"..essentially, it's complete the testing, complete the fault tree, bring that analysis into (the mission management team), and then have an agency-level review. And then we'll lay out the rest of the plan from undock to landing. I think we're on a good path.\"\n\nhttps://www.cbsnews.com/news/nasa-insists-boeing-starliner-crew-not-stranded-in-space/",
        "num_comments": 49,
        "comments": [
            "Boeing is so fucked. What a disappointment. Their open corruption and greed is now visible from space. They're too far gone if you ask me.",
            "That's horrifying. I really hope they make it down safely",
            "C'mon, it doesn't look that high up. Give them a parachute.",
            "Did any of them whistleblow?",
            "Yeah if I was an astronaut driving a Boeing I would nope the fuck out",
            "The next resupply mission to the ISS is scheduled for August 2024. They need to figure it out before then.",
            "Did they outsource the construction parts via TEMU, because that would explain A lot!",
            "Boeing makes orbiting spacecraft? 😅",
            "But that's exactly what \"Indefinite landing hold\" means...lol",
            "Someone said it was supposed to be an 8 day mission, thats gonna be hella overtime at this point."
        ]
    }
}