{
    "For all UFO/Alien/UAP news": {
        "title": "For all UFO/Alien/UAP news",
        "score": 15,
        "url": "https://uapnewscenter.com/",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Former NASA astronaut Brian O'Leary said before his death 'We have Contact With Alien Cultures & Their Appearance Is Bizarre'": {
        "title": "Former NASA astronaut Brian O'Leary said before his death 'We have Contact With Alien Cultures & Their Appearance Is Bizarre'",
        "score": 280,
        "url": "https://i.redd.it/mvokjgsat18d1.png",
        "content": "",
        "num_comments": 68,
        "comments": [
            "[Click here to read the full article:  Ex-NASA Astronaut: ‘We have Contact With Alien Cultures & Their Appearance Is Bizarre’](https://www.howandwhys.com/ex-nasa-astronaut-we-have-contact-with-alien-cultures-their-appearance-is-bizarre/)",
            "\"Their appearances are bizarre\" Posts a picture of a bunch if fine ass aliens...",
            "The smurfs was soft disclosure",
            "Ironically, what *would* be bizarre is if they looked like normal",
            "I’m sure our appearance is bizarre for them",
            "He's an older one by the looks of him , he's just gone home",
            "Is that Ric Flair?",
            "“and use co-rotating magnetic disks for their propulsion systems”\n\nOk so how do they rotate the discs? That takes energy, where does that come from?",
            "Sports Mars Illustrated",
            "His wiki article is interesting."
        ]
    },
    "Last message before the internet was cut... listen very carefully.": {
        "title": "Last message before the internet was cut... listen very carefully.",
        "score": 211,
        "url": "https://v.redd.it/zldra6mlu18d1",
        "content": "",
        "num_comments": 54,
        "comments": [
            "You mean like…micro plastics?",
            "God do not show this video to a schizophrenic",
            "The level of obsession they have with surveillance and only should tell you how much they fear us or being exposed",
            "I think he is talking about [these.](https://www.bloomberg.com/news/features/2018-10-04/the-big-hack-how-china-used-a-tiny-chip-to-infiltrate-america-s-top-companies)",
            "Not a lot of context here",
            "Who's the biggest purchaser of glitter and why?",
            "But... What do they do?",
            "Cocaine?",
            "Chem trails",
            "You store them in your balls"
        ]
    },
    "The Las Vegas Metropolitan Police Department has removed the monoliths, which were discovered earlier this week and described as mysterious. The reason for the removal was public safety and environmental concerns. The monolith is being stored at an undisclosed location.": {
        "title": "The Las Vegas Metropolitan Police Department has removed the monoliths, which were discovered earlier this week and described as mysterious. The reason for the removal was public safety and environmental concerns. The monolith is being stored at an undisclosed location.",
        "score": 207,
        "url": "https://www.reddit.com/gallery/1dlmk19",
        "content": "",
        "num_comments": 95,
        "comments": [
            "You wouldn't think that the aliens would use concrete and rebar to plant their monoliths",
            "They have top men looking into it right now.",
            "Woah the aliens use re-bar and concrete?! Fascinating…I can definitely see why there was a need to remove it. Super dangerous… lol",
            "I could see someone walking out there unprepared and dying of heat or hydration related things being a real possibility.",
            "Feels like we are making this a bigger deal than it is. Someone planted a little shiny, reflective statue in the middle of the dessert and we're making it out like it's some ticking time bomb nuke.",
            "So, then, \"mono\" means \"one.\" And \"lith\" means \"lith.\" And that concludes our intensive three-week course.",
            "Kinda seems lame to remove it",
            "Ahh good ole alien rebar",
            "I think this one is art but research the first one ever in a remote region of Utah only accessible by helicopter.....",
            "Why City police? Seems outside of town..."
        ]
    },
    "This was posted on X with the description \"Unusual activity recorded on the Sun.\" I cannot find the source, but if you do, share it in the comments.": {
        "title": "This was posted on X with the description \"Unusual activity recorded on the Sun.\" I cannot find the source, but if you do, share it in the comments.",
        "score": 149,
        "url": "https://v.redd.it/iz17m4gav18d1",
        "content": "",
        "num_comments": 28,
        "comments": [
            "I can watch this all day. Probably none of this uncommon or unusual.",
            "\"unusual\"? how long has footage like this existed? like how do we know its actually unusual?",
            "This is normal for rhe sun. This is a magnetically charged plasma filament breaking apart and resurfacing. This phenomenon releases solar flares.",
            "Source: The Sun 🌞",
            "This is closer to the original, it says credit to NASA but I can't find the original NASA video. [https://www.youtube.com/watch?v=cDviMcu70T8](https://www.youtube.com/watch?v=cDviMcu70T8)",
            "How is this unusual ?",
            "Activity was probably only recognized by using a different than usual filter.",
            "Absolutely Majestic",
            "Making planets",
            "The source? xastronautkardashian69 flying around the star system getting the best footy."
        ]
    }
}