{
    "Street Fighter 6 Character Guide | M. Bison": {
        "title": "Street Fighter 6 Character Guide | M. Bison",
        "score": 300,
        "url": "https://www.youtube.com/watch?v=oT1SLN39OiI",
        "content": "",
        "num_comments": 98,
        "comments": [
            "Capcom really said 'it's Tuesday so let's drop MvC collection and Bison's character guide'",
            "Interesting to see that they made OD headstomp throw invincible. I wonder if they'd do that for other OD attacks that put you in the air (I'm looking at you, OD buttslam).",
            "He seems pretty solid against projectiles? Wonder who will be strong against him.",
            "I'm curious to see if his lvl 3 and CA have some travel distance or only hits from close up.\n\nAlso I wonder if overdrive crusher will go through Rashid's lvl 2. Seems like psycho punisher will be a counter to that",
            "I noticed that, like guile moveset, your world avatar might probably be able to use bison’s entire moveset since I believe each of his four specials have a unique directional input from each other. Correct me if I’m wrong but I think he has one qcf motion, one qcb motion, one (b)f motion, and lastly one (d)u motion.",
            "And here I thought there was no way they’d be able to top how badass Akuma is. Capcom is the absolute Goat at character design.",
            "I was a Bison player in the SF4 days and tbh it might be time to go back to tha old me",
            "We don't know yet about Dictator's story mode, but I'm pretty sure he wants to get his old power and prestige back (we always saw him as the ruler of Shadaloo, so it's the first time he's in a more \"underdog\" role).\n\nAnd that REALLY aligns with his more \"aggressive\" gameplay in SF 6. I personally REALLY enjoy that \"storyline - gameplay integration\".\n\nFor the same reason, I think that having the manipulative JP as a zoner fits his personality like a glove.",
            "He's gonna be scary when he comes out, but I don't think he'll be the next Akuma or Rashid.  All of his non-EX specials seem punishable on block?  And no EX DP of course.  But he does have great walkspeed and what look like some great normals too, including a cancelable low forward.",
            ">Shadow Rise and it's follow-ups\n\nI realize this is an incredibly minor spelling mistake but it caught me off guard because these videos usually have pretty good production value"
        ]
    },
    "Buckler's Boot Camp - Posted every wednesday for questions and training": {
        "title": "Buckler's Boot Camp - Posted every wednesday for questions and training",
        "score": 7,
        "url": "https://www.reddit.com/r/StreetFighter/comments/1djilge/bucklers_boot_camp_posted_every_wednesday_for/",
        "content": "**This post is to provide a place for everyone to ask simple questions and chat about anything reasonably on topic.**\n**If someone posts something worthy of their own thread, let them know! Like wise, if a thread is personal or answered in the FAQ elsewhere on the subreddit, point them here!**\n\n[](#break)\n\n| **PLEASE READ!** | ☚☚☚|\n| ---------------------- | -------------------------------------------------------------- |\n| Got a question?  | This is the place! Ask anything you like!\n| Just wanna get something off your chest? | Have at it!\n| Want to help? | 1. Help other players with their questions  |\n|| 2. [Apply for mod status on any of our projects](https://docs.google.com/forms/d/e/1FAIpQLScT3DXcd1hoFdTSTDfxwIAZtZia4GMNbMgOQZcOjLWeZOGHAw/viewform)|\n|| 3. Request wiki edit powers! /r/streetfighter/wiki|\n[](#break)\n---\n*If you didn't get a response in the last thread before the new one was made, feel free to post again!*\n\n---\n\n\n---\n[](#break)\n#FAQ:\n|/r/STREETFIGHTER FAQ ||\n| -- | --- |\n|**Beginning**| |\n|👊||\n|Who do you want to see in season 3?|[Most recent thread](https://www.reddit.com/r/StreetFighter/comments/1dcom6w/my_year_3_wishlist/)\n|Who do you NOT want to see in season 3?|[Most recent thread](https://www.reddit.com/r/StreetFighter/comments/1ddmxbh/hot_take_no_more_new_characters_for_sf6/)\n|--|---\n| Who should I start with?  | [Ongoing reddit thread](https://www.reddit.com/r/StreetFighter/comments/15d4cg8/make_your_pitch_why_should_people_main_your/) |\n| Where can I find a basic overview of each character? | [SF6 Universe Android and iOS](https://play.google.com/store/apps/details?id=fr.karucode.sf6universe&hl=en_US), [Supercombo.gg](https://wiki.supercombo.gg/w/Street_Fighter_6) |\n| What does _____ mean? Is there a glossary?| [The latest glossary thread](https://www.reddit.com/r/StreetFighter/comments/13xguzw/street_fighter_glossary_the_wordsphrases_you_need/), [iPlayWinner General Glossary](http://iplaywinner.com/glossary/), [Infil's glossary](https://glossary.infil.net/) |\n| Tips for Story Mode | [Ongoing reddit thread](https://redd.it/1csk29u)\n|**Training**| |\n|👊||\n| How can I fight people of my skill level?| [Ranked and battle hub tips](https://redd.it/1d1ii4n)\n| Where can I find character combos / bread-n-butters? | https://combotier.com/ |\n| How can I stop being bad? | [For the new players struggling...](https://www.reddit.com/r/StreetFighter/comments/1440dm1/for_the_new_players_struggling_to_learn_classic/) |\n| What are footsies?  | [Footsie handbook](http://sonichurricane.com/?page_id=1702), [Juicebox's explanation of footsies](https://www.youtube.com/watch?v=FQQCan5oo90), [RPS footsies in SF6](https://www.reddit.com/r/StreetFighter/comments/14taq7a/a_relatively_basic_look_at_footsies_and_how_they/)|\n| How can I improve my execution? | |\n| What are 'advanced techniques'? | (some of these are old) [Option selects](http://www.youtube.com/watch?v=aHHoGHcgK9k), [hit confirms](http://www.youtube.com/watch?v=eDMboPnznJc), [negative edge and input shortcuts](http://www.youtube.com/watch?v=_laZyBnClDQ), [input buffering](http://www.youtube.com/watch?v=SbhlZUPFxII), [tiger knee motion and kara cancel](http://www.youtube.com/watch?v=1rGjrBLHumk), [plinking](http://www.youtube.com/watch?v=PfP3oj_8oXM), [pianoing](http://www.youtube.com/watch?v=bmx_mnW9h-Q), [sliding](http://www.youtube.com/watch?v=x6RhIUyEuws), [double tapping](http://www.youtube.com/watch?v=yulm5TFOmRU), [links and frame data](https://www.reddit.com/r/SF4/comments/28li8f/how_do_i_use_frame_data_to_know_what_combos_into/), [safe jumps](https://www.youtube.com/watch?v=XqpiyuwRstw) |\n|**Participating**| |\n|👊||\n| What controller should I get?  | Check out /r/fightsticks, they're more than just fightsticks |\n| Where is everyone posting Avatar codes to copy? | Check out /r/SF6Avatars |\n| Where can I find replays of good players?| [replay theatre](https://replaytheater.app/?game=sf6), [High level replays](https://www.youtube.com/@SF6HighLevelReplays/playlists), or more specific yts like [Guile's Garden](https://www.youtube.com/@GuilesGarden/playlists) |\n| Where can I find good shows? When are they on? ||\n| Where are other fighting game communities?  |[fgc.network](https://fgc.network) and [mstdn.games](https://mstdn.games) twitter alternatives\n| |[supercombo.gg](https://supercombo.gg) wiki-like\n| |[discord list](/r/streetfighter/wiki/discords)\n| |[reddit list](/r/streetfighter/wiki/subreddits)\n| |[Newbie fight club](https://www.reddit.com/r/StreetFighter/comments/14ffkdc/new_to_sf6_and_not_sure_how_to_improve_join_us/)\n| |[Faulty Hands fight club](https://www.reddit.com/r/StreetFighter/comments/14bafxp/faultyhands_club_for_people_with_limited_motor/) For people with limited motor skills\n| How can I get critique on my replays? | You can post here, or make your own thread. Up to you!\n| What is the current version of the game? | The current version is ~~Street Fighter V: Champion Edition~~ **Street Fighter 6**\n\n---\n[subreddit overview: the rules and my perspective on modding](https://www.reddit.com/r/StreetFighter/comments/1bivijx/subreddit_overview_the_rules_and_my_perspective/)",
        "num_comments": 86,
        "comments": [
            "Why is https://combotier.com/sf6 linked as combo site, when it seems that it stopped updating after Aki release?\n\nIt's also just bad.",
            "What is the point of Akuma’s backwards teleport in this game? It’s not invincible to anything, it doesn’t have the grab, and it’s too slow to be used as a shimmy. It feels like it was just put in there for legacy’s sake",
            "What the frick do people do who have more than 33% time spend in training room?",
            "Question regarding available moves when using modern controls. Practicing with Dee Jay and during the in game guides it displayed a combo, 236+B, to do a different version of the Rolling Sabat that has two kicks. \n\nThis isn't documented anywhere in the Modern command list that I see. Are there other classic inputs that I can use in Modern? Just curious if there's a list somewhere of if this is a strange one off with Dee Jay.\n\nAaaand, I kept searching after asking and found my answer here. Has the full modern list with some moves that aren't in the game command list, https://streetfighter.fandom.com/wiki/List_of_moves_in_Street_Fighter_6#Dee_Jay\n\nThanks!",
            "Just started playing SF6, rank low silver.\n\n1. How do you incorporate Ken's Jinrai kick?  Do you use it first or cancel from cr.mk?  If I land the first hit and land the crouch second hit, it feels awkward afterward since it's not a combo.  I usually  do medium low kick for continued harass and repeat.\n2. What's his bread-n-butter combo?  I do JHP/HK + std HP + spin kick + shoryuken which does just under 3000.  In some video I saw a longer one that was still safe and reliably able to pull off.\n3. What are his standard dash combos?\n4. In this game, if you're crouch spamming LP on the opponent's wake-up and the enemy is looking to grab you, who wins?  Who wins if flipped?  The wake-up spamming LP or the standing opponent looking to grab?\n5. I use Ken's cr.mk a lot.  It reaches long and isn't punishable and you can cancel into movesets.  I use that to poke a lot or break rhythm.  How do other Ken players poke around using what?",
            "so Punish Counters is where you attack someone during the recovery of their attacks, but ive seen punish counters in other situations like when someone wakes up and mashes and loses to meaty command grab, I was wondering what other situation will give punish counters",
            "Which setting should I have my battle BGM set to as to hear my playlist?",
            "weird question but I'm struggling with light buttons/strings/combos, not with the execution but I just dont know when to use them, I pretty much always use my 6f crouching strong/low forward as my bread and butter, I have a hard time identifying when I should be using light inputs over medium inputs, I mostly use jab to call out fake pressure mostly and that's about it",
            "kinda new to fight gaming meta so bear with me. when I have oki, I usually alternate between throw, meaty button (cr. HP, cr. MP, etc.) and block.\n\nbut it feels like my opponent knows which option I'm going to take every time. any ways of like, masking it? making it appear more ambiguous?\n\nI'm eating way too many EX DPs attempting to throw/meaty on their wakeup, so I go for the dash-up block, but then they throw me! it's like they're in my head lol",
            "If I like playing Juri and Akuma, what others would y'all recommend based off that? (No to Marissa, Blanka, and Honda, and Sim)"
        ]
    },
    "1HP clutch because Ryu is him": {
        "title": "1HP clutch because Ryu is him",
        "score": 709,
        "url": "https://v.redd.it/7n30ihw7b08d1",
        "content": "",
        "num_comments": 112,
        "comments": [
            "Silver rank players got bread and butter combos now? Streets are not safe",
            "\"That's why he's the GOAT! THE GOAT!\" - Cyclops",
            "Silver has combos now??",
            "I’m having a very hard time believing you’re silver rank. Call me crazy, but idk, doesn’t seem legit. Did you just pick up Ryu?",
            "Himberley",
            "Good shit, when I was Silver at launch I could barely string cMk > Hadouken",
            "silver players cooking like this now?? maybe i shouldn’t swap to AKI☹️😭",
            "Yo what was that made up combo IN SILVER.",
            "That guy ain't silver. And you know it.",
            "Found the smurf farming upvotes."
        ]
    },
    "Tokido explains why he pick Ken only(for now/this season) in his new video.": {
        "title": "Tokido explains why he pick Ken only(for now/this season) in his new video.",
        "score": 104,
        "url": "https://www.reddit.com/r/StreetFighter/comments/1dlrgsy/tokido_explains_why_he_pick_ken_onlyfor_nowthis/",
        "content": "Here's the [video from Tokido](https://www.youtube.com/watch?v=43lA_1-BRRM).\n\nSo basically, Tokido said:\n\n1. Akuma and Ken have very similar concept in sf6(for now), so since Tokido already decided to play Ken for tournaments, there is no advantage to use  2 similar characters(can not covering each others' weaknesses).\n\n2. Since they are similar, it's easy to confuse them. When using similar characters, basically you're doing the same thing while pressing different buttons. This may cause more mistakes.\n\nAnd Tokido is looking forward to Akumas's future changes.\n\nAbout the Akuma's playstyle, Akuma is pretty much like a glass cannon version of Ryu in sf6. Akuma has a very strong fireball game(basically top 1 fireball) and it seems Tokido don't really like to stand still and doing fireballs all day. Instead players who are favor of fireball games like Daigo can be seen playing Akuma a lot. Tokido seems have more favor of getting close distance, applying pressure and hitting some meaty combos. So Ken seems fit his playstyle better for now. ",
        "num_comments": 44,
        "comments": [
            "I had more success zoning and playing lame with akuma than going rushdown, I guess tokido's last reasoning makes more sense now. Apart from low health and great fireball game, a lot of his normals are great pokes or whiff punishers (st.hp/hk fwd st.hp/mk). I placed D1, gone back to P5, but now in D4 after having this realization.",
            "Well that sucks. I stole his corner combo and have been using it to great effect, and was hoping to have him available to copy well into the character's future. I'm guessing if the game launched with Akuma, or maybe had him as the very first DLC character, Tokido might have mained him.",
            "Chris Wong mentioned with Akuma low health and FT2 tournament format, playing Akuma is too risky. He thinks Luke is still a better character",
            "The discourse around akuma has been interesting. Angrybird and tokido both put Ken as a stronger character. Angrybird went as far as saying that Akuma isn’t even top 5, which is definitely interesting. Meanwhile the rest of Japan has been switching over to akuma, as seen in the recent topanga tournament \n\nThe shotos in general are in a really good position, all of them being considered top 10. Will be interesting to see how the meta develops tho",
            "Tokido saying he doesnt wanna do fireballs is so hilarious cause i vividly remember watching him do jump back air fireballs for 50 seconds straight every round back in sf4",
            "Tokio always played high tier characters. That's the only reason he picked Ken.  There's no reason ever to play anything but the highest tier characters. Because he wants to win.",
            "Tokido really out here trying to get buffs for Akuma... and this cry for help shit will probably work too because it clear how much the devs love this character.",
            "This is exactly why I stepped away from Akuma and went back to Ken. I can’t stand that fireball/DP baiting playstyle. I like to rushdown as fast as possible and be directly on top of my opponent, and Ken simply does that better than Akuma. Giving the opponent breathing room is not my thing, and I’d rather rush in and get a low kick conversion than toss a fireball and try to keep people out, lol.",
            "Tl;dr: Tokido isn't interested in playing his lifelong main if he's anywhere below the absolute top tier.",
            "Max's hopes of maining Ken one day in shambles."
        ]
    },
    "Upcoming QOL Update - Training mode will be accessible from the main menu ": {
        "title": "Upcoming QOL Update - Training mode will be accessible from the main menu ",
        "score": 339,
        "url": "https://x.com/streetfighter/status/1804288356995477682?s=46&t=kzTXbPeJQ5u43GLyT2I4aQ",
        "content": "Street Fighter Twitter account:\n\n“Introducing some QOL improvements and additional features coming with the M. Bison Update.\n\n[Training Mode Shortcut]\nAdded a shortcut to start Training Mode by just pressing [□ button / X button / R key] in the Main Menu.”",
        "num_comments": 57,
        "comments": [
            "Oh thank fuck. Hopefully they continue to make improvements like this.",
            "Please let me open settings menu while a match is being loaded.",
            "Would be the ultimate QoL if we could access it from the activities card on the PS5 lol",
            "now give the option to create a desktop shortcut straight to training mode",
            "Aight, that’s a handy QOL change. The tweet says “improvment**s**” so I wonder what else is getting changed?",
            "I wonder if this means skipping the character select screen also. ",
            "How about replay accessible from post match options?",
            "Why does logging into the main menu screen take a while? It was like that in SFV too, kinda baffling how long it takes compared to most games these days",
            "The only QoL that matter is : **To be able to quit the game from the training mode/rematch menu !!!**\n\nYou have to leave training mode/quit the match, then go back to title menu, then press start and then choice to quit the game. THIS IS THE WORST GAME DESIGN",
            "Why not just go a step further and let us boot directly into training mode?"
        ]
    }
}