{
    "Heads up: Deadline to get on PAYE and for non-Parent Plus borrowers, ICR is July 1, 2024": {
        "title": "Heads up: Deadline to get on PAYE and for non-Parent Plus borrowers, ICR is July 1, 2024",
        "score": 31,
        "url": "https://www.reddit.com/r/StudentLoans/comments/1di1g0g/heads_up_deadline_to_get_on_paye_and_for/",
        "content": "Please read the entire post and links!!\n\nA regulatory change effective July 1 2024 will sunset the PAYE plan and with the exception of consolidated Parent Plus borrowers, income contingent repayment.  Also note that starting July 1, if you are on SAVE for at least sixty months (clock starts July 1), you will no longer have access to \"new\" IBR.\n\n**Who is currently eligible for PAYE?**\n\nOnly Direct Loan borrowers not in default with no loans taken out prior to October 1, 2007 and who have at least one disbursement (which could be a consolidation loan) on or after October 1, 2011 are eligible for this plan.  Note if first entering the plan your income must be such that your payment under paye would not be higher than it would be under a ten year standard/level plan.  PP loans are only eligible if they meet the above criteria and are double consolidated.\n\n**Who is currently eligible for ICR?**\n\nAll non-defaulted Direct Loan borrowers are eligible for ICR regardless of income and loan balance.  PP borrowers must consolidate to access the plan (but no need to double consolidate)  EDIT - i've confirmed that double consolidated PP loans will remain eligible for ICR\n\n**Who should consider ICR or PAYE?**\n\nThe PAYE plan forgives the balance of your loans after 20 years on the plan regardless of loan type.  SAVE forgives at 25 years if you have even a dollar of graduate school debt or double consolidated PP loans.  PAYE caps the payment at no more than you would pay under a ten year standard/level plan regardless of how high your income goes.  SAVE has no such cap.  Therefore borrowers with graduate school debt and/or whose income is high or anticipated to rise may want to consider switching to PAYE to get the assurance of the capped payment amount and/or the 20 versus the 25 year forgiveness.\n\nICR caps the payment at no more than what would be paid under a 12 year term, minus a percentage related to income.  ICR has a 25 year forgiveness.  Borrowers close to either PSLF or IDR forgiveness whose income is high compared to their loan balance should consider ICR as in that scenario, it can often be the lowest IDR/PSLF qualifying payment.\n\n**How do i know if i should switch?**\n\nIt's time to math!  Use the loan simulator tool https://studentaid.gov/loan-simulator/  and see what your payment would be under SAVE, PAYE and ICR.  Determine how long you have before forgiveness under PSLF, if applicable, or the IDR plans.  You may not know exactly but you should have a ballpark idea in your head how long you've been making payments.  Multiply the payment amount in the calculator by how many months you have left until forgiveness.  You likely want the plan that results in the lowest amount.\n\nIt may be that paye has a higher monthly payment for you, but because the forgiveness is five years sooner, and therefore 60 monthly payments less, that paye is the cheaper option over time.\n\n**If i go on paye or ICR now can i switch back to another plan such as SAVE?**\n\nYes - but if you do you will never be able to get back on paye or ICR.  You also must be sure to recertify your income annually to stay on  those plans.\n\n**What if I apply today for these plans and they aren't processed by July 1?**\n\nYou will still have been considered to have met the deadline as long as the application was completed and processed eventually.\n\n**Why are they sunsetting these plans?**\n\nTo simplify the options for borrowers and to avoid a loophole where a borrower gets a lower monthly payment on SAVE and then in year 19 flips over to the shorter forgiveness programs of paye and new ibr.  Note that PP borrowers will not be barred from ICR at any point as long as the loans are consolidated (do not need to be double consolidated for ICR)\n\nMore information about these plans.  https://studentaid.gov/manage-loans/repayment/plans/income-driven#eligibility  \n\nExample:\nBorrower has been paying for 15 years\nBorrower owes $100K - income of $120K\nSAVE payment is $727\nICR is $1275\nPAYE is $818\n\nBorrower should consider PAYE.  While the payment is higher it will never get above $1085 no matter how high their income goes and therefore their total left out of pocket before the 20 year forgiveness at most will be $65,100.  If they stay on the currently lower monthly SAVE they will pay back at least $87,240 before forgiveness at the 25 year forgiveness.\n\n\nThis is just an example - results are very borrower specific.",
        "num_comments": 102,
        "comments": [
            "The ICR info is extremely important.  I make too much for SAVE to be a reasonable payment so I got on ICR and my payment is only in the $100s per month.  I need to be on this bc I believe I am close to but haven’t qualified for forgiveness yet - I may need a year or two more.  I had no idea about this being an option and that there was a deadline.  Everyone should look at this option if SAVE wouldn’t work for them.",
            "Excellent reminder since we're 2 weeks away from the deadline!",
            "I think I’m a prime candidate for switching from SAVE to PAYE: income 160K, graduate loans 200K, and I’ve already made 15 years of payments.\n\nI have one concern though: will my interest be capitalized when switching to PAYE? I’m seeing conflicting answers to that question when searching. I have ~40K in interest.",
            "Thank you for specifying the part about having an application in by July 1st being what matters, and not the servicer completely processing the application by July 1st.\n\nFrom the DOEd final rules document, I had interpreted it as needing to have the application processed by July 1st.  Internally I thought that would be difficult for servicers to differentiate and carry out, and anxiety provoking for borrowers like myself.  Glad this is not the case.",
            "Do you apply on student aid website? I’m going to do this today. I have only what i think is less than a year until my 25 years is up and it will be way less than save but still more than my standard payment by far. Thank you.",
            "Given that the SAVE plan might get struck down, would it be a wise decision to go ahead and sign up for PAYE since it's going to be taken away soon, and then if SAVE doesn't get scrapped to switch back down the road?",
            "Can we count on SAVE payments being cut in half starting next month? The loan simulator is still using the 10%. ICR is *significantly* better for me is SAVE stays at 10% but SAVE is slightly better if my payments get cut in half. Now I’m wondering if I should just switch to ICR to be safe… ",
            "thank you! I am on SAVE and considering switching to ICR. I just want to confirm that is not going to mess me up in any way in terms of counting time in repayment towards forgiveness?",
            "Trying to decide whether I should switch to ICR or stay on SAVE.  Deadline is July 1 to switch to ICR, and the website will be down for maintenance Sat and Sun, so trying to make a decision today.  Would appreciate anyone’s input, thanks.  \n\n \nI currently have $34,000 balance, at a 3.13% interest rate, and the loans include grad school loans.  I went into repayment in 2006 and had commercially held FFELP loans.  I consolidated to Direct loans in April in order to get the benefit of the upcoming one-time IDR adjustment, so that all my years of payments from 2006 would be counted and get me closer to the 25 years I’d need for forgiveness on the remaining balance at that time.  My household adjusted gross income is currently about $97,000, and we have a lot of expenses with childcare and one of my children has special needs.  We need to continue to file taxes as married filing jointly, in order to continue to receive our partial subsidy for health insurance under the ACA.  \n\nReasons in favor of staying on SAVE: \n\n·       SAVE brought my payment down from $295 (when commercially held) to $250 a month.  I expect my income to go up which would raise my SAVE payment to the $280-300, but not much more than that. \n\n \n·       Although further forgiveness under SAVE is currently blocked, in the next 6 years before I’d reach the 25 year mark, it’s possible the Supreme Court could find that the 20/25 year forgiveness still applies to SAVE.  And if Biden is re-elected, his administration could come up with a new plan that provides forgiveness that could be upheld by the courts.  Even if he is not re-elected, a candidate could win in 2028 that could come up with something by 2030.  \n\n \nReasons to switch to ICR: \n \n\n·       The courts have blocked further forgiveness under SAVE, and if that doesn’t change, I won’t get any forgiveness unless I switch to ICR (I’m not eligible for IBR or PAYE).  Although the court opinion cast doubt on the constitutionality of any forgiveness on other IDR plans such as ICR and PAYE, the current court order only blocks forgiveness under SAVE.  It’s possible that the cases could languish in the court system and that by 2030 SAVE could be dismantled with no replacement, or forgiveness under it is still blocked, but nothing else will have been done to block forgiveness under ICR or PAYE.  In which case, I’d get forgiveness under ICR.\n\n \n·       The discretionary income calculation results in a huge payment for me – over $1000 a month.  But the 12-year adjusted payment calculation results in a payment of approximately $330 per month.  More than the SAVE payment, but not out of the question for me to do.  And at least it’s a cap.  If my income were to go higher than I’m expecting, the cap could be helpful. \n\n \n·       If SAVE gets dismantled without being replaced (if Biden loses election and SAVE gets dismantled, I don’t foresee Trump administration coming up with a similar plan), and the deadline to switch to ICR passes, I’d be out of luck for any IDR plans or possible forgiveness, since I’m not eligible for PAYE or IBR (old or new).  One of the moderators commented that the ICR sunset is tied to the final rule, which arguably is blocked by the current court order, but I don’t trust that studentaid.gov will honor that; I think it’s possible applications to switch to ICR will no longer be accepted after July 1.  \n \n\nSorry for the long post.  I’ve learned so much from you all in reading through this subreddit, and really value the group’s advice.  Thanks for reading and weighing in! ",
            "Wait, is ICR 25 years for undergrad? We just consolidated into a ICR to get forgiveness. We are at 20 years (next month). Did we mess up?"
        ]
    },
    "This Week In Student Loans (politics & current events megathread)": {
        "title": "This Week In Student Loans (politics & current events megathread)",
        "score": 51,
        "url": "https://www.reddit.com/r/StudentLoans/comments/1doot1s/this_week_in_student_loans_politics_current/",
        "content": "It's an election year and there are changes on the horizon (of one kind or another) for federal student loan borrowers, so we have regular politics megathreads. This is the one place in /r/StudentLoans to post speculation, opinion, rants, and general discussion about student loan changes in Washington, student-loan-related litigation, the upcoming election's impact on student loan policies, and to ask for advice about how to manage your loans in light of these actual and anticipated developments.\n\n----\n\nWhere things stand on June 25, 2024:\n\n* **SAVE Repayment Plan Litigation**: On Friday, federal judges hearing separate lawsuits in Missouri and Kansas both held that the Biden Administration likely violated the law when it used its rulemaking authority in 2023 to create the SAVE repayment plan. Our own /u/Betsy514 has a megathread explaining those decisions [here](https://www.reddit.com/r/StudentLoans/comments/1dnrbah/court_partially_blocks_further_changes_for_save/). While both courts held that some elements of SAVE are either permissible or immune from challenge at the moment, they both ordered ED to halt implementing elements of SAVE that have not yet taken effect, including all forgiveness under the plan (which can be as short as ten years) and the lower 5% of discretionary income calculation for undergraduate loans. Expect the Biden Administration to appeal both orders soon -- since Kansas and Missouri are in different federal appellate circuits, these questions are ultimately headed to the Supreme Court. \n\n* **Servicer transitions**: As happens from time to time, ED is in the process of moving Direct loan accounts among its servicers. (The bulk of the current transfers are because MOHELA requested that ED move about 1.5 million accounts to other servicers.) These servicer shuffles are a routine administrative matter as ED balances its portfolio among its servicers -- there's nothing that affected borrowers can do to cause or prevent a transfer and it's neither a good or bad sign that your loans are/aren't transferred. Transferring *can* be a small inconvenience; transferred borrowers will usually need to create a login with their new servicer and may need to input their payment information (e.g. bank routing numbers) again. During a transition, borrowers will be unable to make payments or access most information about their loans -- this will not affect your credit, if the transition prevents you from making regular monthly payments, you'll get an automatic administrative forbearance for those months.\n\n* **PSLF Processing Pause**: ED is in the process of bringing the paperwork processing for the Public Service Loan Forgiveness (PSLF) and Teacher Education Assistance for College and Higher Education (TEACH) grant programs in-house. Previously loan servicers received and processed those forms and handled the bulk of the administrative tasks for those programs. [Starting May 1st and continuing into July](https://studentaid.gov/announcements-events/streamlining-loan-web-experience), borrowers can still submit their forms for those programs, but all processing is paused while all of the servicers' files are moved to ED and ED stands up its internal processing group. During the pause, borrowers will not see any updates on previously submitted forms and may see incorrect (or no) information where they previously saw PSLF qualifying payment counts or data about previous TEACH grants. Loan servicers will continue to handle all other matters, including collecting payments, changing or recalculating repayment plans, and loan consolidation.\n\n* **2024 Election**: The two major presidential candidates have their first debate on Thursday June 27 and it would not be surprising if student loans policy came up. President Biden has been publicizing his administration's various actions on loans, including [at a recent speech](https://www.instagram.com/reel/C7kmMNttcQH) where he noted that his most high-profile effort -- to forgive up to $20,000 of federal student loan debt for millions of borrowers -- was blocked by the Supreme Court. If it comes up, I would expect Biden to tout his Administration's successes in granting or streamlining forgiveness and other relief for tens of millions of borrowers, promise to continue to defend SAVE and other recent borrower-friendly changes in court, and to attempt to reinstate his $20K forgiveness plan through Congressional action or a different Executive strategy that is more likely to survive in court. For his part, [Trump has strongly criticized Biden's student loan actions](https://www.forbes.com/sites/adamminsky/2024/06/20/trump-knocks-bidens-vile-student-loan-forgiveness-plans-suggests-reversal/) but has been less specific about what, if anything, he would do differently to help borrowers. Groups allied with the Trump campaign, including Project 2025, have made more specific proposals focused on repealing most federal forgiveness programs, including PSLF, IDR forgiveness, and Borrower Defense to Repayment.\n\n* **FAFSA Troubles**: Changes to student aid rules by Congress and ED were supposed to make the 2024-25 aid process easier for everyone involved and expand aid eligibility. However, those changes took time to implement and, [due to a combination of delays, administrative complexity, and failures](https://www.usatoday.com/story/graphics/2024/05/01/fafsa-rollout-timeline-key-events/73492356007/), the new FAFSA form [was published months behind schedule and still had issues](https://www.npr.org/2024/06/19/1198912680/federal-student-aid-still-up-in-the-air-for-many). As a result, many students were not able to apply for aid and colleges were not able to calculate aid packages timely (many still haven't). Federal financial aid is important or essential help to most students who are now making plans for the fall -- do they start/continue a degree without knowing how much aid they'll get? Do they afford their preferred school or should they apply to a cheaper alternative? Should they move to a cheaper area, look for a full-time job, apply for private loans...? It will be tough to know exactly how bad the problem is until after it's over and we can see how enrollment changed and how much aid was actually disbursed, but it looks to be quite a mess currently.",
        "num_comments": 147,
        "comments": [
            "June 28 update:\n\nIn both [*Missouri v. Biden*](https://www.courtlistener.com/docket/68419292/state-of-missouri-v-biden/?filed_after=&filed_before=&entry_gte=&entry_lte=&order_by=desc) (in Missouri federal court) and [*Alaska v. Cardona*](https://www.courtlistener.com/docket/68386192/kansas-state-of-v-biden/?filed_after=&filed_before=&entry_gte=&entry_lte=&order_by=desc) (in Kansas federal court), the government on Thursday filed appeals of the respective injunctions against the SAVE plan. In *Alaska*, the government also asked the district court to stay its injunction (which has not yet gone into effect) during the appeal.\n\nThe cases are:\n\n## | ***Missouri v. Biden***\nFiled | April 9, 2024\n---|---\nCourt | Federal Eastern District of Missouri\nNumber | 4:24-cv-00520\nDocket | [LINK](https://www.courtlistener.com/docket/68419292/state-of-missouri-v-biden/)\nStatus | [Preliminarily Injunction](https://storage.courtlistener.com/recap/gov.uscourts.moed.211135/gov.uscourts.moed.211135.35.0.pdf) (PDF) granted (Jun 24, 2024)\n---|---\nCourt | Federal Appeals 5th Circuit\nFiled | June 27, 2024\nNumber | 24-2332\nDocket | [Link](https://www.courtlistener.com/docket/68897716/state-of-missouri-v-joseph-biden-jr/)\nStatus | Government's opening brief due Aug 16, 2024.\n\n## | ***Alaska v. Cardona***\nFiled | March 28, 2024\n---|---\nCourt | Federal District of Kansas\nNumber | 6:24-cv-01057\nDocket | [LINK](https://www.courtlistener.com/docket/68386192/kansas-state-of-v-biden)\nStatus | [Preliminarily Injunction](https://storage.courtlistener.com/recap/gov.uscourts.ksd.151881/gov.uscourts.ksd.151881.76.0_1.pdf) (PDF) granted (Jun 24, 2024) (stayed until June 30). Gov't has requested further stay pending appeal.\n---|---\nCourt | Federal Appeals 10th Circuit\nFiled | June 27, 2024\nNumber | 24-3089\nDocket | [Link](https://www.courtlistener.com/docket/68897732/state-of-alaska-v-educ/)\nStatus | [No briefing schedule set yet]",
            "[deleted]",
            "Boomers on the bench and all republicans in power are jockeying for a win. And for them, liberal heartache, discomfort, and suffering is a win. It’s red meat. They would rather see you pay every penny of compounded interest for the rest of your life, even if it causes you to miss a meal or delay life milestones they call the American dream. \n\nIt’s literally vote in November or we won’t need this sub because Betsy Devos or someone far worse will take over the Dep of Ed and make examples of every one of us. Don’t put it past them to unforgive loans. And if we sue? Laughable. The same courts and USSC cracking us today will laugh in our faces.",
            "All of the legal challenges are political theatre for the election. Plus Republicans use the courts to legislate because they can’t be forthright and tell their constituents that they hate poor people. I received a notice from Nelnet that they were recalculating my payment based on the 5% rule last week. The Dept. of Ed isn’t as worried as these threads make it seem, it’s very hard to undue a government program once it’s been started You can make it less effective  but the structure and basic framework will remain.  \n\nI’m not worried. And you shouldn’t be either. I also wasted my college years on degrees in Political Science, so what do I actually know. 🤷🏼‍♂️",
            "After this latest stint, anyone dumb enough to vote Republican, with student loans, is just shooting themselves in the foot.",
            "[deleted]",
            "\n\nI initially assumed the injunction preventing forgiveness under SAVE was only referring to the low balance 10 yr forgiveness. However, after reading some posts it appears that some are interpreting it to mean no forgiveness at all...so if with the IDR adjustment you reach 20/25 and you are on SAVE plan you would not get forgiveness (while the injunction is in affect)?\n\nDo we think this is the correct assumption?\n\nI consolidated FFEL to DIRECT 2 years ago and left old IBR for SAVE mainly to stop interest accrual. In light of these court actions should I go back to IBR? Can I still?",
            "Something occurred to me today. The current legal challenges won't affect the 1-time adjustment. If you are on SAVE and it continues as planned forgiveness is in 20 years of payments. That is the biggest benefit for the SAVE, IMO, because if it doesn't go through then even though the adjustment still happens, forgiveness isn't until 25 years.\n\nIs this correct?",
            "For the attorneys/legal scholars in the group, what are your initial thoughts on SCOTUS overturning Chevron and how this could potentially affect the various student loan repayment programs? \n\nThis was written before the decision, but makes me nervous: [https://www.americanprogress.org/wp-content/uploads/sites/2/2024/01/Federal-Education-Policies-1.pdf](https://www.americanprogress.org/wp-content/uploads/sites/2/2024/01/Federal-Education-Policies-1.pdf)",
            "If IBR forgiveness under REPAYE (my current plan) goes away I will let my loans fall into delinquency. Theres no way I will ever pay them off and I plan to retire (im 47 next week) in this century. Eff it. Theres really nothing else left for me."
        ]
    },
    "SAVE PLAN: Education Dept. freezes loan payments for 3M student borrowers after court rulings ": {
        "title": "SAVE PLAN: Education Dept. freezes loan payments for 3M student borrowers after court rulings ",
        "score": 184,
        "url": "https://www.reddit.com/r/StudentLoans/comments/1dqvx1y/save_plan_education_dept_freezes_loan_payments/",
        "content": "Paywall-free article here: [https://www.politico.com/news/2024/06/28/student-loan-freeze-education-department-00165853](https://www.politico.com/news/2024/06/28/student-loan-freeze-education-department-00165853)\n\nFingers crossed that borrowers on the SAVE plan are spared some confusion and chaos while they sort this s\\*\\*\\* out. I'm not getting my hopes up until I see the damn banner on the MOHELA site\n\nEDIT: If you are with MOHELA like me, keep an especially keen eye on your account. I sent them a message asking about this freeze just so I can screenshot the timestamp of their reply. I also plan on calling. I was already on forbearance for a different issue, but now I have about three different dates when my forbearance should end, three different due dates for my loans, and two different $$ amounts that are supposedly due in July. As always, abide by the earliest date. I expect MOHELA to be even more of a clusterf\\*\\*k, if that's even possible.",
        "num_comments": 158,
        "comments": [
            "Anybody who is eligible for forbearance under this needs to give the servicers at least a week or even two to get them in the account.  The announcement just came on a Friday afternoon and next week is a holiday.",
            "This whole situation is bananas.  Add to it the SC Chevron ruling today and who knows where we will end up.  Millions of us have arranged our budgets and other obligations around these payment plans.  Pulling the rug out from under them after they were set in motion TWO YEARS AGO without any practical plan to accommodate people some other way is ridiculous.  This will be a financial disaster for millions if they roll it all back.",
            "What a mess. I wrote Miguel Cardona a letter about the Kansas and Missouri rulings, mainly to make me feel better and vent my frustrations. It's ridiculous that two states can have so much say over a federal program. Now SAVE is in limbo.",
            "Honestly, I don't care anymore. They can go ahead and keep adding on the interest  however much they care to tack on because they're still getting $0 from me every month. No job equals no money and they can kiss my white butt because I'll be buried with it sticking up out of the ground so they can kiss each cheek!",
            "I think this pause will probably only stick around for, like, a month? Pretty sure states will sue and it will be immediately granted an injunction. Still, an extra month or so isn't nothing when my payments are $400.",
            "The servicers have no clue, not even paying attention to the news.",
            "How many free months toward PSLF am I going to get out of this, assuming it still exists when I am eligible?",
            "Cool, if they undo it I’m not paying a single cent on any loans.",
            "I checked my loan.  Interestingly enough, now it shows the payment being cut in half and due in August.  (Nelnet).  We'll see if that changes.... Again...",
            "We really need to be concerned about Chevron being overturned. Like the last law passed by congress in 1993 says IBR should be 20% of discretionary income? So now we get some federal judge in Texas who rules that all IBR since then is illegal. Great government we got here.\n\nhttps://www.forbes.com/sites/adamminsky/2024/06/28/student-loan-forgiveness-and-idr-plans-in-serious-danger-after-new-supreme-court-decision/"
        ]
    },
    "All SAVE Plan IDR applications (pending and new) are on hold": {
        "title": "All SAVE Plan IDR applications (pending and new) are on hold",
        "score": 74,
        "url": "https://www.reddit.com/r/StudentLoans/comments/1dqmx1s/all_save_plan_idr_applications_pending_and_new/",
        "content": "I recently got off the phone with a supervisor at MOHELA who said that they were notified today that all pending and new SAVE applications should be put on hold pending further information.\n\n  \nAnyone else have this experience?\n\n",
        "num_comments": 107,
        "comments": [
            "I'm not sure this is true.  Let me see what I can find out.  Edit to say it's after five in Friday so I may not have an update until next week.",
            "😭😭😭 this is a complete disaster",
            "WTF. I consolidated my loan before the April deadline, and my application for SAVE is still pending. Now it’s on hold while I accumulate interest? Great!",
            "Nelnet employee here.  Can confirm we’ve been given direction to stop processing SAVE plans for the time being.",
            "This kind of seems like big news, because I was about to apply for Save",
            "Let’s all sue Missouri and Kansas for damaging US. Hello? Don’t we have rights too? Or do we have to go incorporate ourselves to be protected by government?",
            "Thanks Republican ag’s and judges.",
            "What about if you are already in the SAVE plan and the anniversary date is November? Are we still able to renew since it's not a new application? I'm supposed to renew starting July 17th according to Nelnet.",
            "The website says you can still enroll in save . The actual Mohela .studentaid.gov website",
            "If I am already on SAVE will this affect my payments?"
        ]
    },
    "67k gone and debt free! ": {
        "title": "67k gone and debt free! ",
        "score": 86,
        "url": "https://www.reddit.com/r/StudentLoans/comments/1dqj4ag/67k_gone_and_debt_free/",
        "content": "What a wild month, but completely worth the roller-coaster of emotions. \n\nIn March I consolidated a bunch of student loans totaling about 28k. Shortly after this was completed (early April) I received notice that a different group of loans I had in default (long story) were removed from default due to fresh start. I filled out a form to have these loans added to the original consolidation. \n\nWhile I was waiting for those to be added, I received notice that my consolidated loans were eligible for relief. I received the Golden email 5/15 and my consolidation was placed in IDR forgiveness suspension 2 days later. I had until 6/5 to opt out and received notice that they were discharged on 6/6. \n\nHalf my loans were gone but the other half in purgatory as they waited to be added to a consolidation loan that no longer existed due to discharge. \n\nI called my servicer (Nelnet) and they told me the 2nd group of loans would be added and completed this Monday on 6/24. I didn't hear anything back from them that day and that evening was when court injunctions ruled loan forgiveness couldn't continue. \n\nTuesday my account showed a status of paid in full. Wednesday my account showed the forgiven group was added back to my amount due in addition to the new group so I went from paid in full back to indebtedness of 67k overnight. \n\nThis obviously freaked me out because with no more loans being forgiven it appeared I would be back where I started. \n\nThursday morning my account reflected paid in full again. \n\nThis morning I received a payment history file and it clearly shows all 67k were discharged as of Monday and posted effectively of yesterday. \n\nIt appears my loans were forgiven Monday morning/early afternoon, right before the court order suspended forgiveness. \n\nFeel blessed beyond words and hoping others get to share this feeling shortly. \n\n",
        "num_comments": 20,
        "comments": [
            "Congrats! I got the 5/15 golden email as well.  Had all 23k forgiven on Wednesday this week.",
            "YAY! Keep hoping for the rest of us!",
            "Congratulations! Now feel your freedom 💖",
            "This time last year, I had 185k wiped out! I know Biden had a rough debate, but in my eyes, he’s the best President since Lincoln.",
            "Awesome!   Looking forward to posting similar news for myself one day soon!",
            "Congrats!! Love seeing all the one-time IDR Account Adjustment success stories, and I am so so glad you were able to roll everything in to benefit!",
            "How did you get student loan forgiveness?",
            "Congratulations!!",
            "Congrats! Very happy for you!",
            "Didn’t even know there was a golden email. Congrats!!"
        ]
    }
}