{
    "r/Studium sucht nach Moderator:innen!": {
        "title": "r/Studium sucht nach Moderator:innen!",
        "score": 5,
        "url": "https://www.reddit.com/r/Studium/comments/1dhwsj3/rstudium_sucht_nach_moderatorinnen/",
        "content": "Hallo zusammen! \n\nDas Subreddit wächst immer weiter und wir würden von daher gerne weitere Mods für dieses Subreddit finden. Vorerfahrung ist keine notwendig, auch der Arbeitsaufwand hält sich prinzipiell in Grenzen. Wir freuen uns über frische Impulse und Ideen für das Subreddit! \n\nWer Interesse hat, kann [hier](https://forms.gle/4nPs9mC6xH8qZkjx7) unser kurzes Bewerbungsformular ausfüllen! \n\n\nFragen können gerne in den Kommentaren gestellt werden!",
        "num_comments": 1,
        "comments": [
            "Tritt unserem [Discord-Server](https://discord.gg/W8wrxCJUVp) bei, für einen noch direkteren Austausch mit anderen Studis!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Studium) if you have any questions or concerns.*"
        ]
    },
    "Mathestudium lässt grüßen!": {
        "title": "Mathestudium lässt grüßen!",
        "score": 148,
        "url": "https://i.redd.it/tebmr59guc9d1.jpeg",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Tritt unserem [Discord-Server](https://discord.gg/W8wrxCJUVp) bei, für einen noch direkteren Austausch mit anderen Studis!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Studium) if you have any questions or concerns.*",
            "ich kenne einen der macht bald seinen bachelor in fünf semestern fertig",
            "Ich der seit 2 Semestern eingeschrieben ist und nur 3 mal da war",
            "cries in 2 semester an ects in 3 semestern, jetzt beim versuch mit 51 ects aufzuholen (bin happy wenn ich 39 schaffe btw)",
            "Ich kenne einen der wollte das Ding in 4 Semestern machen(BWL). Der Typ war von morgens bis Abends in der Uni.     \nKeine Ahnung ob er es geschafft hat, hab nämlich abgebrochen(ups)",
            "ich kenne einen (mich) der wahrscheinlich 8 braucht",
            "4 ist schon stabil auch wenns nur bwl ist (/s)"
        ]
    },
    "Die höchste Hochschule?!": {
        "title": "Die höchste Hochschule?!",
        "score": 42,
        "url": "https://www.reddit.com/r/Studium/comments/1dqti16/die_höchste_hochschule/",
        "content": "Hallo,\nHeute waren mein Mann und ich in der ICE. Als wir nördlich durch Mannheim gefahren sind, haben wir auf der linken Seite ein Hochhaus mit ca. 15 Etagen gesehen mit 'Hochschule Mannheim' drauf.\nDaraufhin haben wir gedacht... was ist denn eben die höchste Hochschule Deutschlands?!\nGenauer gesagt: wo in Deutschland kann man in einem Hochschulgebäude sein und gleichzeitig die größte Distanz zur Erdoberfläche haben, d.h. Höhe über NN spielt keine Rolle... sonst wäre München wahrscheinlich der Gewinner??\n",
        "num_comments": 26,
        "comments": [
            "Tritt unserem [Discord-Server](https://discord.gg/W8wrxCJUVp) bei, für einen noch direkteren Austausch mit anderen Studis!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Studium) if you have any questions or concerns.*",
            "Die meisten Hochschulen sind am Boden, manche haben auch Hochhäuser.",
            "Nachdem mich ChatGPT (erwartungsgemäß) zu dem Thema kräftig belogen hat, habe ich entdeckt, dass es tatsächlich eine Wikipedia Seite dazu gibt:  \n[https://en.wikipedia.org/wiki/List\\_of\\_tallest\\_educational\\_buildings](https://en.wikipedia.org/wiki/List_of_tallest_educational_buildings)\n\nDanach ist das höchste Gebäude das Geomatikum in Hamburg mit 85m.  \nDanach folgt das Telefunken Hochhaus in Berlin mit 79m (wäre mein Tipp gewesen).",
            "Zur frage weiß ich nix, aber...\n\n>in der ICE.\n\nDie ICE???",
            "Vielleicht in Bremen? ;) https://de.m.wikipedia.org/wiki/Fallturm_Bremen\n\nAnsonsten fiele mir noch Berlin ein: https://de.m.wikipedia.org/wiki/Telefunken-Hochhaus",
            "Die FSU Jena hat zum Teil Räumlichkeiten im JenTower angemietet. Ist 144,5 m hoch und man hat definitiv eine tolle Aussicht.",
            "Ich glaube die höchst gelegene HS ist die Hochschule Albstadt-Sigmaringen. Das höchste Uni-Gebäude  ist der AfE-Turm",
            "Also wir sind denke ich nicht die höchste, aber die HSWT liegt auf einem einem Berg und kann über München bis in die Alpen blicken.",
            "Das C10 Gebäude der Hochschule Darmstadt ist auch relativ hoch",
            "Ich frag mich ja einfach nur warum es diese Seite gibt?? Aber verblüfft mich sehr zufriedenstellend \nEdit: Okay, wenn man sich die einzelnen Türme anschaut, scheinen einige Universitäten sich durch solche Gebäude zu definieren. Ich denke, das ist irgendwelchen Wikipedia-Editoren aufgefallen…"
        ]
    },
    "Privates Fernstudium an der IU - wem kann man zu Erfahrungen wirklich glauben?": {
        "title": "Privates Fernstudium an der IU - wem kann man zu Erfahrungen wirklich glauben?",
        "score": 41,
        "url": "https://www.reddit.com/r/Studium/comments/1dqtg8f/privates_fernstudium_an_der_iu_wem_kann_man_zu/",
        "content": "Servus,\n\nhabe mein Präsenzstudium nicht richtig auf die Reihe bekommen und den Absprung leider viel zu spät geschafft. Corona und co. habe ich als Grund genommen und im Sinne von \"danach wird alles besser\" mich selber ziemlich belogen. \n\nNun überlege ich in meinen alten Job zu gehen und nebenbei das Studium an einer privaten Fernuni zu beenden. So sind die Semester wenigstens nicht komplett verschenkt und falls ich es nicht abschließend auf die Reihe bekomme, dann habe ich wenigstens weiter Berufserfahrung gesammelt.\n\nMein Problem ist allerdings, dass die Meinungen zur IU und generell zu privaten Fernstudiengängen sehr zwiegespalten sind. Mein noch viel größeres Problem an der Sache ist, dass ich Bewertungen im Netz nicht mehr richtig traue. Zusätzlich bin ich mir unschlüssig,  ob nicht hier auch einige IU Angestellte unterwegs sind und positive Posts und Antworten unter Fragen verfassen?\n\nWie seht ihr das? Meint ihr, es könnte so sein, dass hier ggf. auch einige unterwegs sind?\n\nWas haltet Ihr sonst von meiner Überlegung? Oder lieber komplett sein lassen?\n\nIst es denn an solchen Fernstudiengängen wirklich wesentlich leichter? Mir geht es nicht um den Ruf des Abschlusses, möchte nur nicht, dass die ganze Zeit komplett umsonst für mich war.\n\nRückgängig machen kann ich ja leider nichts mehr, daher muss ich nun das beste für mich mögliche rausholen...",
        "num_comments": 14,
        "comments": [
            "Tritt unserem [Discord-Server](https://discord.gg/W8wrxCJUVp) bei, für einen noch direkteren Austausch mit anderen Studis!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Studium) if you have any questions or concerns.*",
            "Ich meine, wenn du es nebenberuflich machst, ist dass für viele wahrscheinlich sogar einigermaßen nachvollziehbar. Wenn es wiederum ein reines Vollzeitstudium wäre, eher weniger. Bis auf den Aspekt des \"Lernens\" und Prüfungen ablegens, bleibt an der IU nicht viel von einem Studium übrig. Weder der soziale Kontakt, noch die sinnvolle Struktur des Studiums, noch die hohe Qualität der Lehre, noch die Möglichkeit als Interessensvertiefungen in andere Fächer oder Sprachkurse, etc. reinzuschauen, noch die günstigen Semesterbeiträge, und und und...\n\nIch bin absolut überzeugt, dass die IU sich künstlich im Netz besser darstellen lässt, als sie ist, das heißt nicht dass ich denken würde, irgendwelche Bewertungen seien fake. Aber Unternehmen wie die IU fragen etwa gelegentlich gerne ihre Studierenden, ob sie nicht eine Bewertung für sie da lassen und wenn Menschen dadurch indirekt dazu aufgefordert werden, eine Bewertung zu verpassen, tun die meisten von ihnen intuitiv eine bessere Bewertung verfassen, als wenn sie von selbst auf die Idee gekommen wären, da die Frage nach einer Bewertung unterbewusst den Eindruck vermittelt, dass die IU sich ernsthaft für ihre Studierenden interessieren würde.\n\nAber am Ende des Tages sind die Studierenden der IU mehr ihre Kund:innen. Kund:innen die sie nicht verlieren möchte. Deshalb wird alles scheinbar so angenehm und flexibel wie möglich gemacht. Damit die Kund:innen sich wohlfühl und weiter Geld in eine Bildung reinstecken, die im Regelfall weit weniger Qualitätsstandards hat, als die von mind. 98% der staatlichen deutschen Unis.\n\nWenn du die Flexibilität zu jedem Zeitpunkt jeden x-beliebigen Kurs, die in 90% eh nicht zusammenhängen, brauchst und die Möglichkeit haben möchtest, zu jedem Zeitpunkt deine Prüfung darin abzulegen, dann bietet dir ein Fernstudium natürlich diese Möglichkeit. Es versteht sich natürlich von selbst, dass es einfacher ist, einen Kurs zu lernen und dann die Prüfung darin zu machen und dann einfach zum nächsten Kurs weiterzugehen, als mehrere Kurse gleichzeitig zu machen und die Prüfungen zu fest vorgegebenen Zeiten gegen Semesterende abzulegen, wie es an Präsenzuniversitäten der Fall ist.\n\nAlso, wenn du wieder arbeiten und dich nebenbei weiterbilden möchtest, ist es eine legitime Option. Es ersetzt aber qualitativ kein ordentliches Präsenzstudium an einer staatlichen Hochschule.\n\nZum Thema der Schwierigkeit: Es ist auf jeden Fall leichter an der IU Prüfungen zu bestehen, als in vielen anderen Fällen, die Klausuren der IU folgen immer demselben Format von 14 Single-Choice Fragen und 6 offenen Fragen, wovon die allermeisten spezifische Fachbegriffe oder ähnliches aus dem Skript abfragen. Solange du dieses vor kurzem gelesen hast und die wichtige Sachen rausgeschrieben hast, wird das zum bestehen in den allermeisten Fällen reichen, was in schwierigeren Fächern an staatlichen Unis kaum der Fall sein dürfte.\n\nEine andere Sache ist es aber mit sehr guten Noten aus den Klausuren rauszugehen. Dadurch dass du an der IU jederzeit eine Klausur ablegen kannst, werden die Fragen zufällig aus einem Aufgabenpool ausgewählt. Dies bedeutet, dass potenziell auch Fragen drankommen, die sich eben gerade mal auf eine Stelle des Skripts beziehen, die du nicht gelernt hast und schon bist du eine Teilnote schlechter, weil du mit dieser Frage nichts anfangen kannst. Wenn du extrem gut im auswendig lernen bist, dann ist diese Gefahr eher gering, wenn du aber eher die Person bist, die sich gerne logisch Sachen herleitet bzw. nur \"wichtige\" Aspekte lernt, dann wird es mit einem sehr guten Abschluss an der IU eher schwierig. Weil es aber dennoch sehr viele schaffen, scheint es nicht so schwer zu sein, dafür genug zu lernen.\n\nBei allen anderen Prüfungsformen als der Klausur ist es an der IU wie überall sonst auch, nur minus den persönlichen Kontakt zu Dozierenden und anderen Studierenden in Lehrveranstaltungen. Dementsprechend schreibst du eine Hausarbeit, ohne jemals in einem Seminar gewesen zu sein und über das Oberthema geredet zu haben oder hältst eine Präsentation, die kein Mensch außer der dozierenden Person jemals zu Gesicht bekommt. Über die Subjektivität der Bewertung, insbesondere wenn die Studierenden und Dozierenden miteinander kaum etwas zu tun haben, möchte ich gar nicht anfangen. Wenn du schon Vorerfahrungen mit diesen Sachen hast, dann werden sie dir auch an der IU leicht fallen. Aber wenn nicht, glaube mir, der lächerliche 5 ECTS Kurs \"Einführung in das wissenschaftliche Arbeiten\" an der IU, wird dir weder gute Herangehensweisen noch gute Beispiele für die Bearbeitung dieser Prüfungsformen liefern, da spreche ich aus Erfahrung. So ziemlich jedes Tutorium zum wissenschaftlichen Arbeiten in den meisten Präsenzstudiengängen wird dir da sinnvollere Einblicke liefern können. Selbst wenn dies nur daran liegt, dass diese sich meistens zumindest irgendwie auch konkret aufs Fach beziehen und auch Beispiele beinhalten.",
            "Für Fernstudiengänge gibt es immer eine klare Faustregel: berufsbegleitend Top. Ansonsten eher Flop. \n\nIch persönlich habe einen Bachelor an der rwth gemacht, dann dort einen zweiten angefangen und meinen Abschluss an der IU berufsbegleitend beendet. \n\nIch persönlich fand es an der IU viel angenehmer. Die Klausuren waren viel leichter, dafür war aber der Inhalt viel besser aufbereitet. Das liegt aber auch zum Teil daran, dass die IU keine Uni, sondern eine FH ist. \n\nWenn ich mich aber generell dazu entscheiden kann, in Veranstaltungen und Skripts nichts zu lernen, alles selber mit Sekundärliteratur lernen zu müssen und dann in gottlos schwere Klausuren gesteckt zu werden (RWTH) oder eben richtig gut aufbereitet und sehr entspannt den Inhalt aus dem Skript zu lernen und dann ne Klausur zu schreiben, die auch wirklich darauf ausgelegt ist (IU), dann nehme ich immer Option nummer 2.\n\nGenerell würde ich aber niemanden empfehlen, dies als erste Option zu machen. Wenn du die Wahl hast, dann nimm eine staatliche FH und mach einen Werkstudi Job parallel. \n\nAuch wenn ich gute Erfahrungen gehabt habe, hört man hier allerdings öfter Horrorgeschichten. Glaube, dass an vielen nichts dran ist, da auch meine Kollegen im Studium keine ähnlichen Probleme hatten (zumindest wurde ganz selten mal sowas im Discord angesprochen), aber man sollte trotzdem immer aufpassen. \n\nKurz gesagt: wenn du + Werkstudent für dich nicht drin ist, dann ist die IU berufsbegleitend eine valide Option.",
            "Die Uni Hagen ist eine staatliche Universität. Schau doch mal, ob Dein Studiengang dabei ist oder ein ähnlicher Studiengang möglichst viele Anrechnungsmöglichkeiten bietet.\n\n\nIch frage mich, warum die Leute immer auf diese privaten Universitäten schielen. Ich hatte mit denen beruflich zu tun. Am Ende wurden die Uni in diesem Studiengang nicht akkreditiert und alles ging flöten.",
            "Ich bin bei der IU. Wenn du genaueres wissen möchtest kannst du mir schreiben.",
            "Guck Mal auf Fernstudium-infos.de\nDa gibt es auch einige Blogs von Studenten verschiedener Fernhochschulen.\nDie IU wird auf Reddit immer schlechter gemacht als sie ist.",
            "Deinen letzten Absatz kann ich gerade mal gar nicht nachvollziehen. \nHabe besagten Kurs gerade abgeschlossen (also tatsächlich inhaltlich bearbeitet) und habe entsprechend das Skript gelesen und die Hausarbeit geschrieben. Das Skript beschreibt 1:1 wie eine wissenschaftliche Arbeit auszusehen hat, was man ja objektiv prüfen kann. Fand dies einer der wertvollsten Module bislang, gerade weil man in der Hausarbeit  tatsächlich in die Praxis geht.\n\nSonst ist die IU halt für mich als Papa und Vollzeitarbeitender die einzige Option. Und dieses Qualitätsgebrabel muss erstmal jemand beweisen, anstatt das aus einer Assoziation \"kostet also schlecht\" abgeleitet wird. \nDieser Gedanke würde ja bedeuten, dass sämtliche Fachbereiche, sämtliche Dozenten (als Fachkräfte) und sämtliches Lehrmaterial schlecht sind, nur weil privat.\n\nKann gerade davon nichts nachvollziehen. Das wurde zum Glück durch unabhängige Gremien akkreditiert und nicht durch Reddit-Posts.",
            "Im Grunde eine sehr gute Zusammenfassung. Fairerweise muss man aber sagen, dass die Qualität der Lehre usw. an staatlichen Hochschulen nicht immer absolut überlegen ist. Klar hat man den Kontakt mit den Dozenten, aber ansonsten kann auch bei einem staatlichen Studium viel Mist dabei sein. Habe selbst meinen Bachelor an einer Feld-, Wald- und Wiesen-FH gemacht und muss ganz ehrlich sagen, dass es dort genug Kurse gab die quasi geschenkt waren und / oder bei denen man nichts gelernt hat. Der Vorteil an der IU ist, dass es da bestimmte Standards gibt. Jeder Dozent muss ein gut ausgearbeitetes Skript zur Verfügung stellen und jede Prüfung ist ähnlich aufgebaut. Bei meinen FH-Studium hingegen gab es durchaus Dozenten, die lediglich ein bisschen was über das Thema erzählt haben, aber kein gutes Skript oder irgendwas hatten. Am Ende bekommst du dann noch eine geschenkte Klausur und hast eigentlich nichts vom Modul gelernt. Klar war nicht jedes Modul so und vielleicht haben Unis nochmal andere Standards, aber die IU ist zumindest im Vergleich zu staatlichen FHs nicht so unterirdisch, wie manche behaupten",
            "Ziemlich Präzise alles zusammengefasst. Dem habe ich nichts hinzuzufügen.",
            "Vielen, vielen Dank für Deine ausführliche Antwort. Bin immer wieder erstaunt, wie gut und strukturiert einige Leute Texte in kurzer Zeit verfassen können. \n\nHast Du selbst dort studiert, oder woher hast Du die Informationen bzgl. des Aufbaus der Klausuren? Oder gibt es Quellen, wo ich mir Informationen wie diese beschaffen kann?\n\nDer Verlust des Studentenlebens, den Kontakt zu anderen Studierenden etc. ist mir mittlerweile egal. Die Zeit hatte ich und leider habe ich mein Studentenleben nie so positiv erlebt, wie viele diese Zeit beschreiben. Dies mag jedoch daran liegen, dass ich ziemlich überfordert im Studium bin / war und dadurch immer unter Druck stand. Leider habe ich auch nie richtig die technischen Grundlagen nachgeholt. Die Semester häuften sich und Semesterferien konnte ich nie richtig genießen, da ich im Semester eigentlich viel zu wenig geliefert habe. Viel aktive Freizeit hatte ich nicht. Vielmehr habe ich in meinem Zimmer gesessen, mir vorgenommen etwas zu tun und letztendlich wenig gemacht und der Tag war rum, ohne dass ich wenigstens etwas schönes unternommen hätte.\n\nNun sind 8 Semester vergangen und ich habe in etwa die Hälfte der ECTS. Als Option bleibt mir entweder zurück in meinen alten Job und das Studium nebenbei fortführen, oder ich suche mir eine Werksstudentenstelle und habe so mehr Zeit für das Studium. Ob ich das ganze rückblickend auf meinen bisherigen Studienverlauf schaffe, sei mal dahingestellt. Daher eben auch die Frage, ob es schon einfacher ist. Die Angst ist natürlich da, sich in neue, z.B. finanzielle, Probleme zu stürzen...\n\nMein alter Beruf ist eigentlich keine Erfüllung für mich. Noch schlimmer wäre es jedoch mich, wenn ich noch einige Semester studiere und es dann trotzdem nicht fertig bekomme. \n\nStecke in einer ganz schönen Lebenskrise, die ich mir natürlich selbst eingebrockt habe und viel zu lange nicht war haben wollte. :/ Sorry für's Abschweifen..."
        ]
    },
    "Was passiert, wenn man mehr als 538 im Monat verdient?": {
        "title": "Was passiert, wenn man mehr als 538 im Monat verdient?",
        "score": 47,
        "url": "https://www.reddit.com/r/Studium/comments/1dqhesz/was_passiert_wenn_man_mehr_als_538_im_monat/",
        "content": "Ich bin Bachelorstudent und ziehe bald von zu Hause aus. Ich möchte mich so gut es geht selbst finanzieren und habe mir deshalb einen Minijob gesucht. Bis jetzt habe ich immer nur Minijobs gearbeitet und war deshalb steuerfrei. Was würde passieren, wenn ich mehr Stunden arbeite und somit steuerpflichtig werde? Ändert sich dann etwas bei der Versicherung etc? ",
        "num_comments": 59,
        "comments": [
            "Tritt unserem [Discord-Server](https://discord.gg/W8wrxCJUVp) bei, für einen noch direkteren Austausch mit anderen Studis!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Studium) if you have any questions or concerns.*",
            "Deine Krankenversicherung steckt dir den Fuß in den Arsch",
            "Du musst dich selber krankenversichern über die studentische KV, kostet circa 130 € im Monat. Heißt, wenn du vorhattest nur minimal über die Grenze zu kommen, macht es keinen Sinn.\n\nFalls du mehr als 20h die Woche arbeitest (also mehr als ein Werkstudent), zahlt die KV der AG weil du dann den Studentenstatus verlierst.\n\nDann kannst du noch 90 Tage lang eine kurzfristige Beschäftigung machen (1x pro Kalenderjahr meine ich), das beeinflusst deinen Studentenstatus nicht.\n\nSprich, je nachdem was du vorhast, sind die Auswirkungen unterschiedlich",
            "* **Über 538€ bis 1.076€:** pauschale Besteuerung mit 2% vom Bruttogehalt (Minijob-Zentrale) oder individuell über Lohnsteuerklasse (Lohnsteuerkarte)\n* **Über 1.076€:** volle Steuer- und Sozialversicherungspflicht\n* **Steuererklärung:** Ab einer gewissen Höhe des Jahreseinkommens (meist ab ca. 10.000€) Abgabe einer Steuererklärung notwendig\n\n# Du zahlst also Steuern, diese bleiben aber überschaubar. Du solltest aber ggf. auf Bafög etc Rücksicht nehmen und am besten unter der 10.000 Euro Grenze bleiben, dann kannst du dir deine Sozialabgaben über die Steuererklärung größtenteils zurückholen (bei nem normalen Job kannst du das denke ich recht günstig über eine App machen, lohnt sich also).",
            "Bist gefickt. Deshalb ist der Niedriglohnsektor in Deutschland so weit verbreitert",
            "Wenn du bafög bekommst, wird dir jeder 1€ drüber vom Bedarf abgezogen. Zudem meldet sich deine Krankenkasse und möchte 130€ pro Monat von dir.",
            "Du darfst drüber kommen du musst nur im Jahresschnitt drunter bleiben. Wenn das also schwankt ist an sich kein Problem. \nProblematisch wird es erst wenn du die Jahres Grenze reißt. In der Theorie darfst du zwei mal pro Jahr aus „unvorhersehbaren Gründen“ mehr verdienen. Das bedeutet maximal das doppelte für 2 Monate.\nHeißt du darfst maximal auf 14 Gehälter zu 538 kommen. Du kannst also wenn du es perfekt machst auf 7532 Euro kommen.\n\nDas seltsame an der Regel wenn du mehr als die 2 mal die monatsgrenze reißt ist die Gesamtsumme irrelevant.\nHeißt selbst wenn du mit 2 mal mehr als das doppelte auf 7532 kommen kannst ist das erlaubt. Du darfst aber nicht 3 mal reißen und über die Grenze von 12x538 kommen egal ob es 1 Euro oder 2x538 Euro sind. \n\nHoffe das war verständlich und es hat sich nichts an den Regeln geändert seit ich mich vor nem Jahr krass deshalb mit denen gestritten habe. 90% der Leute mit denen ich gesprochen habe kannten ihre eigenen Regeln auf der Homepage nicht.",
            "SEK bricht deine Tür auf",
            "Also, such dir eine Werkstudenten Stelle. Unter 25 kannst du dich mit der Familie versichern über 25 musst du es selbst tun. Kostet pro Semester ungefähr 700-900 Euro. \nDu verdienst bei 20h die Woche und etwa 15-20 Euro die Stunde 1200-1400 davon werden ungefähr 100-200 steuern abgehen.",
            "Dann fällt man tot um \\s"
        ]
    }
}