{
    "r/Studium sucht nach Moderator:innen!": {
        "title": "r/Studium sucht nach Moderator:innen!",
        "score": 6,
        "url": "https://www.reddit.com/r/Studium/comments/1dhwsj3/rstudium_sucht_nach_moderatorinnen/",
        "content": "Hallo zusammen! \n\nDas Subreddit wächst immer weiter und wir würden von daher gerne weitere Mods für dieses Subreddit finden. Vorerfahrung ist keine notwendig, auch der Arbeitsaufwand hält sich prinzipiell in Grenzen. Wir freuen uns über frische Impulse und Ideen für das Subreddit! \n\nWer Interesse hat, kann [hier](https://forms.gle/4nPs9mC6xH8qZkjx7) unser kurzes Bewerbungsformular ausfüllen! \n\n\nFragen können gerne in den Kommentaren gestellt werden!",
        "num_comments": 1,
        "comments": [
            "Tritt unserem [Discord-Server](https://discord.gg/W8wrxCJUVp) bei, fr einen noch direkteren Austausch mit anderen Studis!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Studium) if you have any questions or concerns.*"
        ]
    },
    "Mathestudium lässt grüßen!": {
        "title": "Mathestudium lässt grüßen!",
        "score": 283,
        "url": "https://i.redd.it/tebmr59guc9d1.jpeg",
        "content": "",
        "num_comments": 15,
        "comments": [
            "ich kenne einen der macht bald seinen bachelor in fnf semestern fertig",
            "cries in 2 semester an ects in 3 semestern, jetzt beim versuch mit 51 ects aufzuholen (bin happy wenn ich 39 schaffe btw)",
            "Ich der seit 2 Semestern eingeschrieben ist und nur 3 mal da war",
            "ich, der nach 6 semestern erst 75 ects hat ",
            "Ich kenne einen der wollte das Ding in 4 Semestern machen(BWL). Der Typ war von morgens bis Abends in der Uni.     \nKeine Ahnung ob er es geschafft hat, hab nmlich abgebrochen(ups)",
            "ich kenne einen (mich) der wahrscheinlich 8 braucht",
            "Jeder in seinem Tempo, aber irgendwann will man auch mal fertig werden und dann kickt die Motivation.",
            "4 ist schon stabil auch wenns nur bwl ist (/s)",
            "hab ein drittversuxh in Ana3 und hab einfach schiss",
            "Verstehe ich war auch im 3. Versuch in ExPhy1 und es war sehr stressig aber lief damals gut also bereite dich gut vor, dass du alles kannst dann hast du auch weniger Stress. Packst du"
        ]
    },
    "Ab WS 2024/25 gibts ein zusätzliches Flexibles Semester BaföG Verlängerung... Sachbearbeiter weiss noch von nichts, wie siehts bei den Studenten aus ?": {
        "title": "Ab WS 2024/25 gibts ein zusätzliches Flexibles Semester BaföG Verlängerung... Sachbearbeiter weiss noch von nichts, wie siehts bei den Studenten aus ?",
        "score": 7,
        "url": "https://www.reddit.com/r/Studium/comments/1dr7oz8/ab_ws_202425_gibts_ein_zusätzliches_flexibles/",
        "content": "Moin allerseits,\n\nerstmal zu meiner Situation. Da mein Bewilligungszeitraum für BaföG im März 2025 ausläuft, ich aber noch ein Semester länger brauchen werde, hatte ich mich schon drauf eingestellt, neben der Bachelorarbeit Teilzeit arbeiten zu müssen. Ob da jetzt gut oder schlecht gewesen wäre, lass ich mal offen.\n\nJetzt ist es aber so das es laut der kürzlich beschlossenen BaföG Novelle 29 (13 Juni), neben einigen weiteren positiven Neuerungen ( mehr Bafög, Studienstarthilfe, Verbesserte Zeiträume beim Studienfachwechsel) auch ein sogenanntes Flexibilitätssemester eingeführt wird (ab WS 24/25). Heisst man kann ein weiteres Semester über die Studienregelzeit ohne Angabe von Gründen BaföG beziehen. \n\nDa ich gerade eh dabei war meinen BaföG Antrag, habe ich auch direkt mal mit meinem Sachbearbeiter telefoniert um rauszukriegen wie ich das ganze am besten vorausgreifend einreiche. Der hatte innerhalb des Gespräches keinen Plan wovon ich Rede, weil er meinte es müssen plausible Gründe für eine Verlängerung vorliegen über die dann seine Vorgesetzten entscheiden.  Meine Vermutung ist jetzt, dass das Ganze einfach noch nicht wirklich bekannt ist, da das ja eigentlich ab WS 24/25 greift.\n\nDeshalb auch mal an euch die Frage ob Ihr gnerell über die Neuerungen Bescheid wisst oder das auch an euch vorbei gegangen ist, weil das ja eigentlich ziemlich gute Neuigkeiten für BaföG Empfänger sind.\n\nIch stelle auch noch den Link von Studis Online rein, wo nochmal die Details der Beschlüsse aufgelistet sind\n\n[https://www.bafoeg-rechner.de/FAQ/bafoeg-2024.php](https://www.bafoeg-rechner.de/FAQ/bafoeg-2024.php)\n\n",
        "num_comments": 4,
        "comments": [
            "Also laut dem faq zur bafgreform muss das ganze noch  das grne licht vom bundesrat bekommen. Aber vielen dank fr die meldung mich betrifft das ebenso und ich hatte das vorher nicht auf dem schirm. Falls ich mich dran erinnere berichte ich was meine bafg betreuerin gesagt hat",
            "Weit du ob das Flexible Semester auch genutzt werden kann um den Leistungsnachweis ein Semester nach hinten zu schieben?",
            "Das stimmt. Der Bundesrat muss tatschlich noch zustimmen, dass ganze entscheidet sich dann am 05. Juli. Hatte ich so nicht auf dem Schirm, also danke fr die Info.",
            "Tritt unserem [Discord-Server](https://discord.gg/W8wrxCJUVp) bei, fr einen noch direkteren Austausch mit anderen Studis!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Studium) if you have any questions or concerns.*"
        ]
    },
    "Gibt es eine Uni in Deutschland bei der man Archäologie oder Anthropologie mkt Schwerpunkt Pazifik studieren kann?": {
        "title": "Gibt es eine Uni in Deutschland bei der man Archäologie oder Anthropologie mkt Schwerpunkt Pazifik studieren kann?",
        "score": 4,
        "url": "https://www.reddit.com/r/Studium/comments/1dr9ax1/gibt_es_eine_uni_in_deutschland_bei_der_man/",
        "content": "Moin. Ich habe im Bachelor Altamerikanistik studiert und Studiere jetzt Anthropology of the Americas im Master. Ich habe ein archäologisches Praktikum in Guatemala gemacht und arbeite neben dem Studium in der Bauarchäologie. Neben den Amerikas finde auch die Sprachen, Archäologie und Geschichte  pazifischen Inseln super interessant und habe neben dem Studium viel zu dem Thema gelesen. Ein Auslandssemester Pacific Island Studies an der University of Hawaii wäre komplett unbezahlbar. Deshalb die Frage oben, ob es Universitäten in Deutschland gibt die Kurse zu Archäologie, Anthropologie oder Sprachen im Pazifik anbieten.",
        "num_comments": 6,
        "comments": [
            "Ist schon sehr spezifisch, aber schau doch mal in Leipzig. Am dortigen Max Planck Institut forscht Aymeric Hermann zu Sprach- und Kulturevolution im Bereich evolutionrer Anthropologie. Er war u.a. Erstautor einer Studie zu Mobilitt im Pazifikraum, in der mit Hilfe geochemischer Untersuchungen menschliche Langstreckenmobilitt zwischen den zentralen und westlichen Pazifikinseln whrend des letzten Jahrtausends rekonstruiert wurden.",
            "Ich wrde Dir raten, Dich bei einem PhD-Programm in den USA zu bewerben. Privatunis haben oft Erlass von Studiengebhren und Stipendien fr  die Lebenshaltungskosten.\n\nStaatliche Unis wie die University of Hawai'i haben oft weniger funding, aber manchmal kann man einen Deal machen, als T.A. ttig zu sein (vielleicht auch fr German Studies je nach Uni). Die Mglichkeiten fr funding sollten bei einem PhD-Programm jedoch auch bei staatlichen Unis deutlich besser sein als bei MA oder nur einem Auslandssemester. (Wobei fr Auslandssemester gibt es natrlich auch funding durch deutsche Institutionen, Begabtenfrderungswerke etc.)",
            "Ich kann es dir leider nicht sagen, aber ich finds geil, dass du Archologie studiert hast und jetzt weiter machen willst. Und sogar auch auslandserfahrung gemacht hast. Wenn ich knnte wrde ich auch Archologie studieren",
            "Du meinst wohl: ist schon sehr *pazifisch",
            "Danke, ich werde mal nachschauen! \nUnd ja, es ist schon ein sehr spezifisches Interesse.",
            "Tritt unserem [Discord-Server](https://discord.gg/W8wrxCJUVp) bei, fr einen noch direkteren Austausch mit anderen Studis!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Studium) if you have any questions or concerns.*"
        ]
    },
    "Die höchste Hochschule?!": {
        "title": "Die höchste Hochschule?!",
        "score": 61,
        "url": "https://www.reddit.com/r/Studium/comments/1dqti16/die_höchste_hochschule/",
        "content": "Hallo,\nHeute waren mein Mann und ich in der ICE. Als wir nördlich durch Mannheim gefahren sind, haben wir auf der linken Seite ein Hochhaus mit ca. 15 Etagen gesehen mit 'Hochschule Mannheim' drauf.\nDaraufhin haben wir gedacht... was ist denn eben die höchste Hochschule Deutschlands?!\nGenauer gesagt: wo in Deutschland kann man in einem Hochschulgebäude sein und gleichzeitig die größte Distanz zur Erdoberfläche haben, d.h. Höhe über NN spielt keine Rolle... sonst wäre München wahrscheinlich der Gewinner??\n",
        "num_comments": 37,
        "comments": [
            "Die meisten Hochschulen sind am Boden, manche haben auch Hochhuser.",
            "Die FSU Jena hat zum Teil Rumlichkeiten im JenTower angemietet. Ist 144,5 m hoch und man hat definitiv eine tolle Aussicht.",
            "Ich glaube die hchst gelegene HS ist die Hochschule Albstadt-Sigmaringen. Das hchste Uni-Gebude  ist der AfE-Turm",
            "Das C10 Gebude der Hochschule Darmstadt ist auch relativ hoch",
            "Also wir sind denke ich nicht die hchste, aber die HSWT liegt auf einem einem Berg und kann ber Mnchen bis in die Alpen blicken.",
            "Eine Beobachtung die ich schon lnger gemacht habe, Hochschulen werden irgendwie immer auf nem Berg gebaut. Oder ich habe einfach durch Zufall immer nur solche gesehen",
            "Ich frag mich ja einfach nur warum es diese Seite gibt?? Aber verblfft mich sehr zufriedenstellend \nEdit: Okay, wenn man sich die einzelnen Trme anschaut, scheinen einige Universitten sich durch solche Gebude zu definieren. Ich denke, das ist irgendwelchen Wikipedia-Editoren aufgefallen",
            "Falls jetzt jemand ein prunkvolles Gebude erwartet, das Geomatikum ist in hchstem Mae baufllig, dient aber trotzdem noch zur Folter durch Mathematikvorlesungen",
            "Haha - danke - daran haben wir gar nicht gedacht! Das ist ja lustig",
            "Die Liste ist unvollstndig, das Elektrotechnik Hochhaus der Uni Hannover mit 69 Metern fehlt"
        ]
    }
}