{
    "(SQSA) Simple Questions and Simple Answers, or FAQ: Getting Started? Breeding, EV, and Nature Questions? Looking For A Moveset? Ask here!": {
        "title": "(SQSA) Simple Questions and Simple Answers, or FAQ: Getting Started? Breeding, EV, and Nature Questions? Looking For A Moveset? Ask here!",
        "score": 11,
        "url": "https://www.reddit.com/r/stunfisk/comments/1d5q78p/sqsa_simple_questions_and_simple_answers_or_faq/",
        "content": "Welcome to the SQSA thread! Beginners are always encouraged to ask questions here to start off their journey—but remember, if you want help with your questions, you need to give thorough information to the Stunfiskers that are willing to help you!\n \nSince this thread is likely to fill up a lot over time, please consider sorting the comments by \"new\" (instead of \"best\" or \"top\") to see the newest posts if it hasn't already been done for you. Minimize questions that have been answered so you can easily spot those unanswered posts. Before we get to the nitty-gritty:\n \n# [Click here to see our ever-growing FAQ](https://www.reddit.com/r/stunfisk/wiki/faq)!\n \n1. Check the sidebar for links! The buttons there link to articles, analyses, and how-to guides! Reddit redesign users should also check the navigation bar. Alternatively, [click here to check out this comprehensive list of links in text format](https://www.reddit.com/r/stunfisk/wiki/links)! \n2. Want to learn to make great posts? Check out our [Posting Rules](https://www.reddit.com/r/Stunfisk/wiki/rules/) and [Teambuilding Post Guidelines](https://www.reddit.com/r/stunfisk/wiki/rmt/)!\n3. Looking for real-time advice and discussion? [Click here to join us on the Stunfisk Discord server](http://discord.gg/stunfisk)!\n4. Didn't get your question answered in the last SQSA thread? Repost it here!\n5. Want to prompt the owner of the subreddit? Mention him by his full username (/u/TheLaughingCat2) in a comment and he'll get to you as soon as he can.\n \n# What kind of questions should I ask here?\n \n* \"I don't know my EVs from my IVs!\"\n* \"Where do I start?\"\n* \"How do I get into Singles or Doubles?\"\n* Clear-as-crystal definitions\n* Breeding questions\n* Any questions/comments/concerns you have about the competitive scene\n* Any other small questions\n \n# You're encouraged to put your \"Discussion\" posts in here too!",
        "num_comments": 99,
        "comments": [
            "I feel like all the \"how's my draft\" are very low-effort posts, along the lines of rmt. If there's no description or explanation, why are we allowing them?",
            "How would yall feel if gen 10 were to remove Ice's weakness to Rock? What else would need to be done to balance that? I feel like Ice has a memey amount of weaknesses that completely gimps the type. Rock types tend to have better defenses to make up for the amount of weaknesses but Ice typing is a major liability.",
            "Anybody had issues with Showdex in random battles lately? It's not loading sets for me (even for my own Pokmon), so I have to add them manually every time which is pretty annoying.",
            "Why is walking wake still banned in Natdex? I feel like powercreep from the new dlcs could let it back in OU",
            "Is there a reason why Raging Bolt builds recommend precisely 20 Atk IVs (despite said builds being fully Sp.Atk based)?",
            "Why do people use clefairy but not magmar? Magmar has better defensive stats and flame body",
            "Okay how can a heatran move before a 324 speed pokemon and hit it wit ha rock type move ? Ha choiced scarf full iv and ev in speed heatran can only reach 313.5 speed and it can't learn any priority rock type move... I'm stumped and need answers pls",
            "Why is this subreddit named after stunfisk?",
            "I'm new to watching VGC, is there a place to find later brackets or schedules? Also what's anticipated for tomorrow as I had only seen there'd been only 2 days for regionals.",
            "Hi so, I know what natures are. But what is that part where it says something like \"This pokemon likes to take siestas\" does that affect the stats in any way? Or is it just for fun"
        ]
    },
    "Theorymon Thursday is over! See you next Thursday!": {
        "title": "Theorymon Thursday is over! See you next Thursday!",
        "score": 4,
        "url": "https://www.reddit.com/r/stunfisk/comments/1dqam5q/theorymon_thursday_is_over_see_you_next_thursday/",
        "content": "Yesterday was **Theorymon Thursday**! All [theorymon](https://www.reddit.com/r/stunfisk/comments/5vfvxp/psa_rule_13_clarification_or_what_is_a_theorymon/) posts are now **no longer allowed** on the subreddit until next Thursday.  See you then.\n\nIf you are reading this and are sad it is not Thursday, please go to our [**Discord**](http://www.discord.gg/stunfisk) or wait until next Thursday to talk about theorymon!",
        "num_comments": 2,
        "comments": [
            "**Please send any feedback to our modmail!**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stunfisk) if you have any questions or concerns.*",
            "Theorymon Thursday rules have changed! Please check out the new [posting guidelines](https://www.reddit.com/r/Stunfisk/wiki/rules#wiki_theorymon_thursday).\n\n* Does your post include a 600 character description explaining its impact, rationale, or intention?\n\n* Is your image well-formatted?\n\n* Is your Theorymon clearly broken?\n\n* Is it a [Retired Topic](https://www.reddit.com/r/Stunfisk/wiki/rules#wiki_theorymon_thursday)?\n\nIf so, it may be **removed**. If this is not a Theorymon post, check your flair.\n\n&#x200B;\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stunfisk) if you have any questions or concerns.*"
        ]
    },
    "The Zamazenta spam needs to stop": {
        "title": "The Zamazenta spam needs to stop",
        "score": 259,
        "url": "https://www.reddit.com/r/stunfisk/comments/1dr4nv6/the_zamazenta_spam_needs_to_stop/",
        "content": "I can't fucking take it anymore. This pokemon needs to be fucking gone. EVERY GOD FORSAKEN GAME HAS ZAMAZENTA. Out of your 6 pokemon, you need like 3 dudes just to beat one dog. It's too bulky to be killed by most special moves, even some that are super-effective, and its blistering speed allows it to get Iron Defenses so fast your head will spin. preventing any physical attacker from KOing it. This doesn't even address the fact that its uninvested attack stat allows it to bypass should-be counters with coverage. There's such a small selection of things that actually beat it one on one that it's so goddamn frustrating.\n\nHow is it that all the ban conversations I hear are about Darkrai, Kyurem, and Raging Bolt when all of these pokemon straight up lose to this dumb dog? \"Oh, Kyurem runs a mixed coverage set that has loaded dice, icicle spear, and scale shot, that's the real problem!\" Those pokemon at least have counter-play. I'd rather play against Unaware Dozo Clod Clef stall every matchup than play against one more drooling ladder player with that dumb Iron defense set where I have to guess if it has Heavy Slam to beat my Fairy type, Crunch to beat my ghost, or fucking Stone Edge to beat my Moltres. This all ignores the fact that no pokemon abuses Tera half as well as this obese bitch. Oh, how quaint, your Valiant outspeeds and has super effective moonblast? Tera Fire Iron Defense go brrrrrrrr. Don't even get me started on those Life Orb attacker sets that have been popping up.\n\nIt's enabled the most obnoxious, low IQ teambuilding. Now every damn team is Zama + Glowking + Twave spam. How is one team style running the meta healthy? How is it that Stall sucks? Why I am I running into niche pokemon picks that are chosen just to beat one pokemon, and how come it's never enough? Did everyone forget how boring Gen 8 was? Are we all content to go back to that, where the fat legendary comes in and wins you the game?\n\nEveryday we stray further from Arceus and the beloved Son he sacrificed 'pon the cross, and when the day of reckoning comes, we will all deserve the damnation he will bring upon us. Do you think the creator of everything is happy when he looks at OU and sees that they unbanned this stupid boxart so that everyone can click Iron Defense in unison? Thou shalt not worship false swipe idols.\n\nZamzenta needs a suspect yesterday. If I'm wrong and the people choose to keep his dumbass in, fine, whatever, but there at least needs to be a vote. This isn't healthy or fun. It's macabre, sick, twisted, and perverse. If there's any justice in this world, the Holy Smogon council will take swift action against this monster, and we'll be better off for it.",
        "num_comments": 73,
        "comments": [
            "Chat does playing OU actually make people go insane or is this an isolated incident",
            "I forgot Zama is a top OU mon for a sec and thought this was a VGC post",
            "Bro actually swore on Arceus were cooked ",
            "Tbh no idea how they actually allowed Zamazenta Hero back in ou",
            "Stinkpost or Skill Issue\n       \ncall it",
            "Manthis essayan absolute work of art. This shits so good that its comparable to the Lavos rant!",
            "Baby wake up new copypasta dropped",
            "Oh man, sunday came early this week!",
            "Dont even get me fucking started on the Roar sets now too. This shit isnt even funny anymore, literally unplayable.",
            "I would say new copypasta just dropped but honestly this is genuinely more intelligent than most \"serious\" posts here since this rant actually displays knowledge of the game \n\nAnyways wake up babe new copypasta just dropped"
        ]
    },
    "many initially unbanned pokemon, that people think bring positive balance to the OU tier, end up becoming controversial down the line.": {
        "title": "many initially unbanned pokemon, that people think bring positive balance to the OU tier, end up becoming controversial down the line.",
        "score": 21,
        "url": "https://www.reddit.com/r/stunfisk/comments/1dr855e/many_initially_unbanned_pokemon_that_people_think/",
        "content": "So I've been looking at the old gens OU meta and noticed that many pokemon that ended up unbanned initially for bringing positive stuff and not being broken in that moment eventually end up becoming controversial down the line. We have multiple concrete cases of this.\n\n1. Excadrill (BW OU) - unbanned to help against Jellicent and bring one more rapid spinner to the tier, banned sand rush, people still complain about it.\n\n2. Kyurem-B (BW OU) - unbanned because it proved to be balanced, nowadays people say we shouldn't have bothered with it and instead ban stuff.\n\n3. Hoopa-U (ORAS OU) - allowed because initially it didn't prove to break the tier, then its specs set was discovered and was booted (though some people want it back)\n\n4. Darkrai (SV OU) - unbanned initially because everyone wanted it to, at first proved to be completely welcome in the tier, then sleep got banned and many people were saying darkrai was the issue, now there's more and more evidence for an upcoming darkrai test\n\n5. Zamazenta (SV OU) - unbanned because it was initially balanced, provides great speed control, decent blanket check, nowadays more and more people are frustrated with its body press set and it was banned from natdex OU already\n\nThere's also Keldeo and Latios which survived a couple of suspect tests back when BW OU was the main gen, now many people keep complaining about them 10-12 years later.  There's also Kyurem in SV OU which barely survived a suspect test, yet many people keep complaining about it.",
        "num_comments": 5,
        "comments": [
            "The BW Excadrill paragraph is a gigantic oversimplification of an issue that has been such an integral part of how BW OU has worked since day 1. Drills influence is so deep-rooted in how the BW metagame operates and has operated in the past that saying that it was to help against jellicent is a very misleading way to show how Excadrill was and still is a very controversial mon.\n\nOther than that yea unbanning a mon just because it doesnt break the meta doesnt mean it doesnt make it more toxic, which is often the case.",
            "there's plenty of examples of unbans proving to be perfectly balanced too, which is why they still happen. people nowadays seem really against retests of ubers which i can understand to an extent but you can't really know if something is broken until you play with it again, and you can always go back and ban if it's still busted. also idk if kyu-b is a good example, it's more of a situation of bad suspect timing than actually being busted afaik",
            "I mean yeah you're right but these mons are so much fun",
            "I feel although some examples are really spot on, the banning/unbanning of a mon has to do more with what the tier is expected to play as, all things considered.\n\nAn easy example of that would be with Gen 2 Snorlax.\n\nThat pokemon is nowhere near balanced. it is without a doubth the best mon in OU and arguably UBERS of that gen, however, as gen 2 games are expected to play methodically and \"slow\" his pressence is also what single handledly holds the tier from being barraged by special attackers and turning into a offense fest (or needing quite the number of bans)\n\nAnother example is Gen 5 Stall. I feel that with a tier as offensively oriented as Gen 5 you cant really have all playstyles fit into the meta, not even in a rock-paper-scissors situation where HO, stall, and balance counter each other somewhat, as dragons are wildly unchecked (barring themselves) and spamming dragon type attacks + magneton was a somewhat usable strategy.\n\nThat being said, what i think gen 9 will be known in the near future as a \"pseudo gen 5\" in the way that its more offensively oriented, seeing its wild moveset restrictions on status moves and, in general, moves like scald, that would slow down games significantly, and the absurdly complementary nature of setup sweepers and Terastalization, along with the feeling of having a Once-per-battle get out of jail card (defensive tera) that has literally forced VGC high-level play to be open sheet format so it doesnt become a guessfest.\n\nThe threats in gen 9 would be way easier to check if a light version of an open sheet format allowed both parties to see the tera type the foes pokemon are running, so as to be able to take more stimated guesses and so it doesnt turn into the rich-get-richer mechanic that is proving to be, seeing as the best pokemon in gen 9 were able to run a multitude of different tera types.",
            "Alderans Proposal o7"
        ]
    },
    "What are the strongest multipliers without direct stat boosting? ": {
        "title": "What are the strongest multipliers without direct stat boosting? ",
        "score": 35,
        "url": "https://www.reddit.com/r/stunfisk/comments/1dr49l0/what_are_the_strongest_multipliers_without_direct/",
        "content": "I was just thinking about how Miradon became so popular in VGC, and was surprised at all the hype/thought it was common sense.\nThat's what made Kyogre so popular for such a long time.\n\nThat got me thinking, what is the most multipliers you can  get on a pokemon with unaware/without stats boosts from swords dance/calm mind.\n\nThe ones that came to mind are\n\nKrogre- Water Spout:  rain*(STAB+ Tera)*specs= 1.5 * 2 * 1.5 = 4.5\n\nMaradon- hadron engine * terrain* stab+tera* specs = 1.3 * 1.3 * 2 * 1.5= 5.7\n\nDravocish is crazy (move first) fishious rend * choice band* stab*strong jaw=  2 * 1.5 * 1.5 * 1.5 = 6.75 (9 if it is Nat dex with tera, or 13.5 nat dex tera+ rain.)\n\nWas there any I might be missing?\n",
        "num_comments": 28,
        "comments": [
            "Psychic Terrain, Specs, Psychic Tera+ Expanding Force maybe???\n\nEdit: or should I say, let's just throw Hatterene's name out there.",
            "Torkoal Eruption is probably one worth considering too.",
            "Depending on the gen, you might want to look at gems as well. And helping hand, power spot, the ruin abilities, etc for doubles",
            "Would it be possible to use x as multiply for easy reading?",
            "Well, it's a good thing my Quagsire has water absorb instead of unaware ",
            "Yes! I think sun+ specs+ tera eruption would match Kyogre Water Spout",
            "Yeah, that seems up there too!\n1.5 * 1.5 * 1.5 *2 = 6.75",
            "I wasn't sure how many outside factors we were considering, but with Helping Hand...Raging Bolt...In Sun...Choice Specs...Rising Voltage...Electric Terrain+ Electric Tera.",
            "* is used over x specifically because it is easier to read",
            "Sorry, I edited it and added more spaces in between the * \n\nI think I triggered some special characters by accident."
        ]
    }
}