{
    "Welcome to /r/StupidFood. Please read": {
        "title": "Welcome to /r/StupidFood. Please read",
        "score": 1190,
        "url": "https://www.reddit.com/r/StupidFood/comments/5x6ahd/welcome_to_rstupidfood_please_read/",
        "content": "---\n\n&nbsp;    \n\n###Introduction\n\nDear readers old and new, welcome to /r/StupidFood.\n\nPlease take the time to have a look around and get to know the place.\n\n**History** : We have been here since spring 2015, although our slightly younger friends over at /r/WeWantPlates have thoroughly outgrown us. What started as a silly idea has morphed into a decent small sub that has regular influxes of subscribers whenever we get namechecked on /r/food or elsewhere. It is the brainchild of /u/Clackpot.\n\n**Content** : Feel free to post your own Stupid Food without worrying too much about quality, if it isn't good enough it'll drop off the front page and we'll all move on. There is no shame in unsuccessful posts.\n\n**Behaviour** : This sub is explicitly both partial and prejudiced, but nevertheless tolerance and consideration are required. Don't get too carried away. Insults and flaming are acceptable as long as they are creative, funny, imaginative, or otherwise thoughtful; but being shallow, boring, unoriginal, or derivative are cardinal sins.\n\n&nbsp;    \n\n\n\n---\n\n&nbsp;    \n\n\n\n###Our philosophy, and the elusive sidebar\n\nFrom time to time there has been some confusion about what exactly this sub is for. The sidebar explains it all in some detail.\n\nRemember, **/r/StupidFood does NOT try to be fair or impartial** in its efforts to poke fun. We will ridicule and scoff at whatever targets we choose, without first asking whether it is justified.\n\nBut many of you will be reading on mobile clients, blissfully unaware of our sub's sidebar and how that describes its ethos. Some of you may even be reading on desktop, *still* blissfully unaware of the sidebar, despite it being just over there ---->\n\nSo, **read the bloody sidebar!** On mobile you may need to click an icon such as an 'i' in a circle. In particular, pay  attention to this comment tucked away under the 'YOUR RIGHT TO TAKE OFFENCE' heading :-\n\n> ###/r/StupidFood is intended to be a somewhat puerile place to poke fun at other people's creativity, ***without regard to whether they deserve it***.\n\nThis is important! Do not expect the court of /r/StupidFood to be a just one. It is here to vent spleens and spout prejudices. It is not meant to be true or fair. It will cheerfully ignore the facts in pursuit of a cheap gag.\n\n&nbsp;    \n\n---\n\n&nbsp;    \n\n###Regarding moderation\n\nThis sub has a light-touch approach, preferring that most moderation be performed by subscribers voting items onto or off the front page.\n\n**Removal:** Items may be removed if they are wholly irrelevant, spam, grossly rude or inflammatory, or for any other reason the mods don't like. Posts which are merely low quality will not be removed.\n\n**Subreddit rules**: [Rules](https://www.reddit.com/r/StupidFood/about/rules/) will be added and amended as and when required. Please look at them.\n\n**Bans and suspensions:** May be dispensed for anyone with no interest in the sub's welfare; for crap bots; and anyone else failing to be part of the community. Other contributors will have to try *really* hard to earn themselves a suspension or even permanent ban. /r/StupidFood does not subscribe to big stick policing.\n\n**Overturning decisions:** We're not perfect, we'll get it wrong from time to time. Please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2FStupidFood) if you feel a decision is wrong or over the top and it will be reviewed.\n\n&nbsp;    \n\n---\n\n^(*/u/Clackpot*, last updated 30th October 2017)\n\n&nbsp;    \n\n\n",
        "num_comments": 95,
        "comments": [
            "PLEASE ban Rick Lax videos and others following his rage-bait formula! They very clearly fall under the \"spam\" category in the sub rules and I think it's pretty safe to say that everyone here is sick of that shit. \n\nIf you don't recognize the name Rick Lax, you will definitely recognize the formula. A model in yoga pants makes something gross, wasteful, and unsanitary in an LA mansion, while the person filming acts amazed and not at all disgusted. Remember that toilet ice cream cocktail video? That's the shit I'm talking about and it needs to stop.",
            "boner sex",
            "Don't know if this is the right place to ask but did the subreddit ban those over the top ChefClub videos? Feels like ages since I've seen one posted and it stopped around the time I saw people asking for it to be banned.",
            "Lately there’s been an influx of uninformed ppl submitting “stupid cooking” videos that turn out to have more cultural meaning than first glance. Can there be a way to tag those or something? A bit insulting to tag cultural cooking as stupid when OPs are just not informed.",
            "Can we revisit the Chefs Club topic? Perhaps if we are not open to banning the videos we could create a flair. It's oversaturating the sub and is intentionally making stupid food to gain traction.",
            "Thank",
            "Can we get rid of the creepy fetish stuff",
            "im surprised this only had 2 comments before me",
            "Okay so I'm new, but if I check out \"new\" it seems like most of the people posting here are r/lostredditors who should really be posting on r/shittyfoodporn.   Just because you made an anemic looking dish using processed ingredients doesn't mean your food is stupid, it's just bad.\n\nI'm cool with the hands-off approach to moderating (overmoderation ruins many humour subs), but wanted to check if this is the kind of thing that *technically* falls under the rule of \"missing the point\" of the sub, or just something that the sub is used to and decides to ignore since these posts will get downvoted anyways?  Basically, would reporting these just annoy people or should I be doing it when I see it?",
            "I have a suggestion (not sure if this is the right place): That posters be required to leave a \"starter comment\", in which they provide some context as to why their post belongs on \"Stupid Food\".\n\nI've noticed a lot of posts where the majority of comments are just people asking why something is stupid, with no cohesive answer, and I think holding OPs responsible for explaining why something is stupid would lead to higher quality posts and discussions.\n\nCheers!"
        ]
    },
    "Burger at a Mexican restaurant my friend ordered": {
        "title": "Burger at a Mexican restaurant my friend ordered",
        "score": 902,
        "url": "https://i.redd.it/yxoe0oac218d1.jpeg",
        "content": "",
        "num_comments": 174,
        "comments": [
            "Excuse me, waiter?  I think my burger just shit itself",
            "That's what he gets for ordering a burger at a Mexican restaurant",
            "I mean I’d eat the fuck outta that burger with a fork and knife",
            "Cheese and queso are the same… except on burgers, apparently…",
            "I was in Texas two months ago, and ordered a breakfast burger  for brunch at a Mexican place.  But it was like 10 miles from the border, every other restaurant is basically a Mexican restaurant with Mexican food options.  The burger was the best burger I have had out to eat in a long time.  There were only 4 or 5 options for brunch, so they must sell a lot of them.",
            "I would definitely eat that.",
            "Did he order it “wet?” 🤣",
            "first issue: ordering a burger at a mexican rest.   \nsecond: It threw up on itself.",
            "NGL I would eat this and enjoy every single delicious cheesey bite. ",
            "The Sloppy Jose"
        ]
    },
    "$60 after tax and tip.": {
        "title": "$60 after tax and tip.",
        "score": 6797,
        "url": "https://i.redd.it/683v0f1w4y7d1.jpeg",
        "content": "",
        "num_comments": 1057,
        "comments": [
            "Private msg me OP I have these beans that are magic for a great price...",
            "Stupid food or stupid person?",
            "you literally went to erewhon\n\njust dont touch erewhon with a 6 foot pole",
            "Wtf is with the recent trend of “let’s give the most expensive store our money for posts”. I have never heard of this place in my life and in the last week I have seen it come up in about 10 videos where everyone just throws away like $200 on a bag of chips and some water",
            "OP... Are you ok? Is there a reason why you're acting this..\n\n\nLooked it up online and they are $22.. how can someone charge $22 for a smoothie and there's no money to pay the person making it. \n\n\nJFC",
            "Just looked at the menu. \n\nI think they are\n\n(Pink)\n\nHailey Bieber's Strawberry Glaze Skin Smoothie\n$19.00\n\nMalk almond milk, organic bananas, organic strawberries, organic avocado, organic dates, organic maple syrup, Vital Proteins vanilla collagen, vanilla stevia, sea moss, organic coconut creme, Driscoll's Organic Strawberry Glaze\n\n\n(Blue)\n\nCoconut Cloud Smoothie\n$18.00\n\nMalk organic almond milk, organic pineapple, organic banana, organic avocado, organic almond butter, organic vanilla collagen, vanilla stevia, blue majik, and organic coconut cream.\n\nIf anyone was wondering. I think this is $40 bucks before tip and after tax.",
            "Why the fuck would you have to tip? This place has $20 smoothies, they have the money to pay their workers a decent wage more than anyone!",
            "I mean it’s Erewhon, it’s known for being expensive.",
            "More like stupid OP tho",
            "More like /stupidcustomer"
        ]
    },
    "Judge for yourselves": {
        "title": "Judge for yourselves",
        "score": 477,
        "url": "https://v.redd.it/ahjs31x5b18d1",
        "content": "",
        "num_comments": 158,
        "comments": [
            "Isn't this basically just elotes with Doritos and pineapple sauce? Pineapple sauce might be too sweet. But, seems fine for street food.",
            "needs more chips for the amount of sauces and things i think 🤔",
            "I could do without the pineapple sauce. Maybe a squeeze of lime?",
            "Fact: Mexicans love corn,  cheese, msg, fruit sugar, and mayo.\n\nThe stupidest part of this video is the lack of hot cheetos.",
            "I'm okay with this.",
            "I'm going to continue to believe r/stupidfood is mostly people that lack culinary creativity...\n\nI wouldn't eat this because I hate mayo, but there's nothing stupid about this.",
            "I’d fuck that shit up.",
            "savory parfait",
            "Esquites from a street vendor in Mexico City is one of the best things ever . The least stupid food ever posted here.",
            "These are called elote cups. They sell shit like this at the food trucks in my town.  The only thing I can't handle is when it's 110 degrees and it's all that hot mayonnaise. You've really gotta be willing to get down with the mayo and not barf. Besides that this shit slaps."
        ]
    },
    "It seems unnecessary ": {
        "title": "It seems unnecessary ",
        "score": 1798,
        "url": "https://v.redd.it/18pjs5o20z7d1",
        "content": "It’s always Instagram reels. ",
        "num_comments": 291,
        "comments": [
            "Lol the very curious person in the background.",
            "Stupid portion, but stupid delicious idea. Poor execution regardless.",
            "My digestive tract and toilet are shuddering from watching this",
            "The size of the burata is a bit to much for my liking but i’m sure it tastes great",
            "Off subject:\n\nI have this stupid theory that people's heads are getting physically larger. Is it just the camera lens? Both women in this video look like their heads are bigger. I'm noticing this in real life interactions and wondering if anyone else has this thought pattern?",
            "At the end, you could see her wondering if she could stomach all that cheese.",
            "#I was waiting for smoke to come out for some reason",
            "If that's real burrata on that pizza, that's a *very* expensive pie.",
            "Wtf kinda fungus looking puff ball did she just bisect and dip it's viscous insides?",
            "Her facial expressions! lol. like a commercial."
        ]
    }
}