{
    "CVT Fluids: A Consolidated Thread": {
        "title": "CVT Fluids: A Consolidated Thread",
        "score": 72,
        "url": "https://www.reddit.com/r/subaru/comments/1d80zgo/cvt_fluids_a_consolidated_thread/",
        "content": "Hello r/subaru,\n\nWe've been seeing a big influx of questions about CVT fluids lately, with an average of 1-2 threads per day for about the past month. So, I've decided to make one consolidated thread about it. Future question posts about CVT fluid will be deferred to this thread. In response, I want to get as much information as possible into a single place, so users like yourself can make as informed of a choice as possible.\n\n------\n\n#What is a CVT?\n\nLet's start with the basics here. The Continuously-Variable Transmission, or CVT, does not work the same way as a \"conventional\" automatic transmission which you may have been used to previously. So let's start our journey with a conventional auto trans.\n\nIn an automatic transmission, there are a series of planetary gearsets. These gearsets will be surrounded by a number of hydraulically-actuated clutches. The hydraulic fluid inside of the clutches are controlled by the transmission computer, through a mechanism of valves that are controlled by solenoids. The solenoids and valves all exist in a component known as a \"valve body.\" As the TCM commands certain valves to open or close, different clutches will be engaged which subsequently will control elements of the planetary gearsets. This is how your conventional automatic transmission achieves changing gear ratios.\n\nIn a CVT, by contrast, the gear ratio mechanism is a set of cone-shaped sheaves or \"variators\" with a belt (or in Subaru's case, chain) run between them. Instead of the valve body controlling clutch packs, it instead varies the fluid pressure inside of both sheaves, such that the cone surfaces can get closer together or further apart. Because the thickness of the chain doesn't change, by opening the sheaves, the chain will ride down lower into the cone shapes, thus being on a smaller diameter. Because the chain doesn't change length either, there needs to be a corresponding change to the opposite change to get closer together to make the chain ride on a larger-diameter part of the sheave. Thus, the transmission computer achieves different gearing ratios by adjusting the gap of both sheaves in tandem. If you're having trouble visualizing this, [here is a good animation](https://www.youtube.com/watch?v=PEq5_b4LWNY) explaining the motion.\n\nBefore someone interjects, yes there are clutch sets inside of a CVT as well. Specifically in a Subaru transmission, there are 3 relevant ones; there is a planetary set inside the powerflow for your Drive or Reverse functionality; there is a Lock-Up clutch inside the torque converter, and in most cases there is a Multi-Plate Transfer clutch for your all-wheel drive \"center differential\" function. These functions are more-or-less identical to their equivalent components in a conventional automatic transmission.\n\n#OK but what about the fluid?\n\nThere are quite a few differences between CVT fluid and conventional ATF. Part of these differences are how the fluid is used in the transmission, and part of the difference is because of what the transmission does to the fluid.\n\nIn a conventional transmission, you have many clutch packs actuating whenever the car is changing gear ratios. Just like in a manual transmission clutch, or like your brake pads, every time there is slip between the clutch material and the friction surface, a little bit of that clutch material will wear off. In a conventional transmission, this means that over time, that clutch material will begin to accumulate in the fluid, which gives it a burnt smell and a brown tinge. By contrast, a CVT does not use as many clutches inside of it, and as such, clutch material contamination is drastically reduced inside of the CVT fluid.\n\nAnother main difference has to do with the fluid pressure inside of the transmission. While a conventional auto only needs fluid pressures around 150-250 PSI to operate the clutch packs, a CVT requires much higher line pressures of 650-850 PSI in order to keep enough \"squeeze\" force on the sheaves to hold the chain. The CVT fluid also functions as a friction modifier between the chain and sheave, wherein it helps the chain \"grip\" on the otherwise-smooth pulley surface. Because of this, CVT fluid is very specific about its chemical properties and should not be substituted for any other fluids.\n\n\n#So... should I service the fluid?\n\nLet's start this by looking back at what a conventional automatic transmission requirement would be. [Here is the service manual schedule from a 2010 Forester.](https://imgur.com/o15NYKr) I've highlighted ATF for you, but basically it only says \"Inspect [and replace as necessary] every 30k miles.\" Okay, but what does it mean by Inspect? The service manual has [this inspection procedure](https://imgur.com/ndrdp6T) for checking the level. It also has [this condition table](https://imgur.com/ZTk88cO) listed for what to do when you find a condition-based failure. I've highlighted the \"thick and varnish\" section because this would be the clutch wear condition I described above. *Generally speaking,* your average Subaru 4EAT or 5EAT will have noticeable signs of discoloration every ~60k miles.\n\nSo what does Subaru say about CVT fluid then? Well for comparison, let's look at a 2018 Forester service manual. [Here is the service schedule,](https://imgur.com/dC5EmY2) which  you can see has an identical \"Inspect [and replace as necessary]\" every 30k miles. As for an inspection process, it only offers [this inspection procedure](https://imgur.com/pC3RDem) and [the same condition table](https://imgur.com/WN4EyoS) as before. \n\nBecause the schedule and condition checks are basically the same for both service manuals, it would be very easy to assume the fluids needs the same replacement schedule -- and I strongly suspect this is the driving force behind so many CVT fluid recommendations. However, if we read this again, remember that we only need to address the fluid *if if fails one of the condition checks*, and that the most common failure condition in a conventional automatic transmission largely no longer happens in a CVT. It is because of this that your Owner's Manual probably describes the transmission fluid as a \"lifetime fluid.\"\n\n#What about what other countries say?\n\nA claim I very often see made in threads about CVT fluid is that \"Country XYZ requires fluid changes every X miles!\" I want to nip this in the bud now, because it's not true. Now because I work in the US, I cannot access foreign service manuals, but I can get ahold of owner's manuals, so here are a few examples:\n\n[here's a UK 2018 forester owner's manual](https://imgur.com/xkJgOkz) ([link](https://subarucore.s3.eu-west-2.amazonaws.com/wp-content/uploads/2020/06/12140046/Forester-2018-Owners-manual-1.pdf))\n\n[Here's a n Australian 2020 forester/XV schedule.](https://imgur.com/iFkSian) Subaru Australiia [has .pdf copies here of warranty booklets.](https://www.subaru.com.au/owners/warranty).\n\n[here's a Japan 2018 forester's owner's manual](https://imgur.com/dgpDL2P) ([link](https://www.subaru.jp/afterservice/tnst/forester/pdf/A8230JJ-G.pdf?downLoaditemRadio=&downLoaditemRadio=pdf%2FA8230JJ-G.pdf)) and it says in the bottom row there: 交換時期  | 無交換 which translates as Replacement time | No replacement\n\nHere is a 2020 WRX owner's manual from Japan, straight off Subaru.jp: https://www.subaru.jp/afterservice/tnst/wrx/pdf/A1760JJ-A.pdf\n\n[pg. 465 is the service information for transmission/differential/etc gear oils.](https://imgur.com/hwlL95X) The 3rd section is for CVT fluid:\n\n>トランスミッション フルード\n\n> 使用オイル スバルハイトルクCVTフルード リニアトロニック用\n\n> 規定量 約12.4L\n\n>交換時期 無交換\n\nTranslated:\n\n>Transmission Fluid\n\n>Used oil Subaru high torque CVT fluid\nfor Lineartronic\n\n>Prescribed amount about 12.4L\n\n>[**Replacement time No replacement**](https://imgur.com/e8162c1)\n\nThe only subaru branch AFAIK that [does list a required CVT fluid interval](https://imgur.com/OMfHvgm) is Canada, ([soruce](https://www.subaru.ca/WebPage.aspx?WebSiteID=282&WebPageID=18541)) where if I'm being honest the way it's written in their maintenance guide makes it seem like they just never changed it from ATF-era cars, where Canada also listed replacement as necessary every 100k km. (It only refers to \"transmission oil\" and does not specifically mention CVT fluid, but everywhere else differentiates the two. It also does not differentiate manual vs. automatic transmission fluid, like everyone else does.) There, it's listed as a 100k km service item.\n\n#that didn't answer the question though.\n\nYou're right, I didn't. The long answer is that you should have your fluid inspected by a technician familiar with Subaru CVTs, and if deemed necessary, you should replace the fluid with genuine Subaru fluid as required by your particular model. If following the conventional wisdom from ATF-era cars also makes you feel more comfortable, then defer to Canada's schedule and plan to perform a fluid service at your 100k km (60k miles) service.\n\n#A quick note about \"Severe Usage Schedule\"\n\nAnother common discussion point I see brought up is the Severe Usage schedule. I largely blame the confusion for this on Subaru, who have written this in a hard-to-understand way in the owner's manuals. However, a 2010-2014 Legacy/Outback service manual [has the best representation of the severe usage shceudle.](https://imgur.com/lJHNnJk) As you can see, the only time Severe applies to your CVTF is if you \"repeatedly tow\" with the vehicle. This guidance has not changed with newer cars, however the new way it's written [is confusing to read.](https://imgur.com/Sc4o1lw)  (CVT fluid is maintenance item 12; see above where it shows this as Note 4.)\n\n#A last quick note on Differential Fluid\n\nJust want to quickly touch on this one. Your Subaru has separate, distinct fluid for the front differential. While you can see from the above service schedule that the guidance for its fluid is functionally the same, differential oil gets contaminated in a completely different way. Because a differential is basically all metal-on-metal wear of gear teeth, especially after break-in your fluid will get dark and metallic very rapidly. This is normal. [Here's my personal Crosstrek at 19k miles.](https://youtu.be/etBBiMih10I) **In my own personal experience,** I would recommend replacing your gear oils at 30k miles, but the fluid condition will stay good for longer after the initial change, such that it can go every 60k thereafter.\n\n#On fluid changes and failures.\n\nI just want to quick touch on ways that we see CVT failures at the dealer and how it relates to fluid. By far the most common issue we'll run across, is from the \"small\" CVT, the TR580, which is paired with any of the 2.0L or 2.5L naturally-aspirated engines. Typically somewhere in the 100-150k mile range, a failure in the valve body, usually for the Torque Converter Lockup Duty solenoid, is relatively common. This is a failure in the electronics side of the solenoid, and thus has no relation to the CVT fluid; as such, changing or not changing the fluid has no real bearing on the likelihood of this failure occuring. The second issue we see, the most terminal one, is called Chain Slip. [Here, at 0:23, is a fantastic example of severe chain slip.](https://www.youtube.com/watch?v=uyYbt1Zt1H0) Chain Slip can develop from a variety of causes, but generally is the result of a lack of fluid pressure squeezing the sheaves against the chain; when this happens, the chain essentially does a burnout on the sheaves. This leaves a wear groove in the sheave face, and makes chain slip much more likely to occur whenever the same gear ratio is used. There are some conditions of fluid degradation that can increase the risk of slip; these largely result from fluid overheating, which degrades the additives that help provide friction between the sheaves and chain.\n\n-------\n\nHopefully there is enough info in here for you to decide for yourself if or when you would like to change your fluid. Feel free to post your questions or anecdotes below. Thanks! :)",
        "num_comments": 50,
        "comments": [
            "Thanks for this resource. What are the symptoms of a solenoid failure vs slip failure?",
            "Very thorough breakdown, thanks for taking the time. \n\nIn my opinion, as well as other master techs that I've worked with, it's a good idea to drain/fill your CVT fluid around 75-80k miles. I did my 2017 Outback 2.5i at 74k and sent it out to Blackstone, it came back with zero issues. What are your opinions on a drain/fill as a preventative service?",
            "Much appreciation, clarity but with nuance is a wonderful thing the internet.",
            "Great info, thanks for putting all that together. I've been wondering if I should get my CVt fluid changed on a '17 XT with 55k miles. The dealer didn't recommend it but ended up giving me a $400 service estimate. \n\nI had a leaking transmission pan gasket they replaced a year ago - how much fluid would have been lost for that? The service records didn't indicate replacement fluid.",
            "Excellent write up as usual.",
            "Thanks for putting this together. I recently did a drain and fill for the first time at 130k miles. I notice a significant improvement in how smooth the transmission shifts now. Previously, I would notice lag at times, and symptoms similar to what you described as chain slip. Those are gone. So, I’m happy that I did it.",
            "Planning to change myself at 70k....\n\nAny special procedures? Other than draining and filling the correct hole?",
            "Thank you for this. Great writeup. \n\nI just had my '23 Outback Wilderness CVT fluid changed at 23k miles because I was trying to be super cautious.  Looks like I can wait a while for the next one!",
            "Ok, let's say, asking for a friend, their CVT failed on their '16 Outback due to the lockup solenoid and it was replaced under the extended warranty, but the installation of the remanned transmission caused a leak somewhere around the rear of the trans and put off taking it back well beyond a reasonable time in which the dealership would give me the time of day to fix it under any kind of parts or workmanship warranty. \n\nI'm more experienced with cars than your average human...I mean my friend is..., but CVTs are foreign. Is topping it off something to even consider as a DIY, or just pay for a drain and fill once a year or so? No way I'm paying for it to get removed and re-sealed, it's almost 10 years old with well over 100k miles and is going off to college next year.",
            "148k in my 2016 Legacy, CVT fluid has never been changed to my knowledge.... Is it going to explode?"
        ]
    },
    "Radio update available for Denso CP1.5 systems!": {
        "title": "Radio update available for Denso CP1.5 systems!",
        "score": 17,
        "url": "https://www.reddit.com/r/subaru/comments/1dqto8b/radio_update_available_for_denso_cp15_systems/",
        "content": "TSB 15-305-22R was updated today for a description of Update #4 for Denso CP1 systems. For older update patch notes, please [see my megathread](https://www.reddit.com/r/subaru/comments/17t2uvf/subaru_radio_updates/k8u0kdg/) CP1.5 system. Here's your patch notes:\n\n##Applicable cars:\n\n* 23-25MY Outback/Legacy Models (including Wilderness models)\n* 23-24MY Ascent Models\n* 24MY Impreza\n* 24MY Crosstrek (including Wilderness models)\n* 24MY WRX\n* 25MY Forester\n\n##New software version numbers:\n\n* FM1WHM073-980 (High model software)\n* FM1WMM073-980 (Mid model software)\n* FM1WBM073-980 (Base model software)\n\n##How to check your software version:\n\nTurn on your car, and navigate to the home screen of the radio. Find and open the \"Settings\" app (gear icon). On the first tab (\"General\"), scroll down to \"System Information.\" This will display the software version your radio is currently running.\n\n##Patch Notes:\n\nSymptoms Addressed By Update #4:\n\n* System:\n * Reset CID screen (CCU) repeatedly resets every 3 minutes.\n* CarPlay:\n * **Wireless conenction drops while using wireless CarPlay due to external signal interference from surrounding facilities etc.** (only applicable to HIGH and MID trim)\n * **During CarPlay handsfree call receiving party is not able to hear the caller as the microphone data is muted**\n* Android Auto\n * When wireless AndroidAuto connection failed, the same connection failure error was displayed in all cases. Since it was difficult to understand how to deal with the problem, the connection failure error was divided into several phases.\n  * 1st step: Bluetooth connection phase\n  * 2nd step: Confirmation phase of Wi-Fi connection information\n  * 3rd step: Wi-Fi connection and Android Auto connection phase\n  * Failure in the 1st step: Various error messages are displayed to try the user to redo the connection procedure.\n  * Failure in the 2nd step: When an error occurs, an automatic retry is performed by internal processing, and the screen indicates that a retry is in progress.\n  * Failure in the 3rd step: The timer for determining failure is too long, so it is changed from 130 seconds to 45 seconds to shorten the time until the error message is displayed. (only applicable to HIGH and MID trim)\n * When the USB cable is disconnected while using Android Auto with wired connection (USB connection), automatic switching connection to wireless Android Auto connection may fail. (only applicable to HIGH and MID trim)\n * Wireless Android Auto connection fails. (only applicable to HIGH and MID trim)\n * The Android Auto icon does not appear on the Home screen; pressing the Android Auto icon from the Apps screen does not activate wireless Android Auto. (only applicable to HIGH and MID trim)\n * AndroidAuto connection via USB connection sometimes fails. (Caused by the USB connection mode connecting the Android device to the on-board device not switching in the expected order)\n* Bluetooth\n * Toggling the CarPlay ON/OFF switch multiple times on the Manage Devices screen while the iPhone is connected via USB, may result in a \"Bluetooth connection unavailable\" state. It is the same as a \"CarPlay connection unavailable\" state. Bluetooth icon in the top right corner of the CID screen\nmay still indicate a connected state.\n * When multiple Android Devices attempt to connect during ignition on, it may result in a \"Bluetooth connection unavailable\" state. It is the same as a \"wireless Android Auto connection unavailable\" state. Bluetooth icon in the top right corner of the CID screen may still indicate a connected state.\nBluetooth connection may not be available and the pairing Delete may not work. (only applicable to HIGH and MID trim)\n* Audio\n * After ignition on, the audio may not return to the audio that was playing at the previously played audio.\n * Audio sound may not sound immediately after ignition on.\n * On iPhone audio with iOS 16.4 or later the song list disappears when a song in the playing playlist is selected. (only applicable to HIGH and MID trim)\n * After ignition on it may take approximately 16 seconds for iPod audio audio to play. (only applicable to HIGH and MID trim)\n* Display \n * The registered mobile device information is not displayed on the Manage Devices screen. (This occurs when the name or device ID of a mobile device contains a character code that cannot be displayed.) (only applicable to HIGH and MID trim)\n * The order of 1.First Name and 2.Family Name in the phone book is set to 1.→2. even if the order is set to 2.→1.\n * The message function may become unavailable following repeated page scrolling up and down of the list on the phone's message list screen. (only applicable to HIGH and MID trim)\n * When transitioning to the maintenance screen and the setting value is set to AUTO, a popup prompting the user to sign a MySubaru contract is displayed and the setting is switched to Manual. (only applicable to HIGH and MID trim)\n * When turning off and on while two or more shortcuts of DMS/SRH/SRVD icons are set on the Home screen, the order of icons changes from DMS to SRVD, SRH, VDC, AVH, and ISS.\n * The AVH icons on the HOME screen are initially lined up next to the ValetMode icon. However, in some cases they are placed at the top (upper left corner of the first page) or next to the MAP icon. (only applicable to HIGH and MID trim)\n * After switching the clock function to AUTO, the CID screen display may become distorted. (only applicable to HIGH and MID trim)\n * It may take excessive time to start the CID screen after ignition on.\n* SXM \n * The first time ignition on after the CCU software update added the SXM360 functionality, the SXM playback screen may remain at “Loading...” after the CCU software update.\n * The SXM function will not accept any further operations during playback of SXM360 IP communication channel. After the progress bar is displayed with silence due to communication breakdown, etc., operate IRPLay/Pause.\n * Operation of SXM function becomes unresponsive and SXM function restarts if the user quickly alternates between SXM satellite and IP channels\n * Playback may not start when perform fast switch of SXM channel selection selecting an SXM channel using steering wheel switch\n * After booting, the SXM playback screen may remain blank for about 45 seconds.\n * After ignition off/on, SXM may play a channel that was not the last channel played.\n * When viewing preset registered SXM IP channels with the steering wheel switch to feed presets and switch preset pages, the list may not switch.\n * Screen remains on FM/AM, SXM with the sound on and off, after switching audio source to FM/AM from SXM.\n * The tab buttons for switching settings items may not be displayed. From the SXM Notification screen, press and hold the Tune knob button to enter the Sound Settings popup screen. Close the popup with the × button to transition to the Radio Settings screen.\n * In the SXM screen, the On Demand button in the upper right corner is grayed out and cannot be operated in the Sports→ Sports Talk screen. (only applicable to HIGH and MID trim)\n* Navi \n * After booting, the Map screen may not appear even if the Map icon on the Home screen is pressed. (only applicable to HIGH trim)\n * Three destination suggestion displays in the navigation system are sometimes displayed overlapping each other. Originally, up to three destination suggestions are displayed at the bottom of the screen when the navigation system is started. (only applicable to HIGH trim)\n * The total delay time due to traffic and other factors is not displayed at the top of the navigation route bar. (only applicable to HIGH trim)\n * When turning ignition off and on while the Map screen is displayed, the message \"Loading Navigation...\" may remain on the screen, and the Map screen may not be displayed. (only applicable to HIGH trim)\n * The route guidance operation starts with the screen displaying the entire route to the destination. Your Information & Privacy screen is displayed when the navigation system is booting for the first time and you have not accepted the privacy policy. Set the destination of the navigation system by voice recognition commands, launch the navigation screen. (only applicable to HIGH trim)\n * While driving with the navigation destination set, the estimated time of arrival may be interrupted halfway through the speech, and after that the navigation voice guidance may not sound. (only applicable to HIGH trim)\n * When a destination is set and the map data of the state through which the route passes is updated during route guidance, the navigation application may be restarted or the route in the route guidance may disappear. (only applicable to HIGH trim)\n* Audio/Voice recognition\n * The record of the boost peak value may be reset after the engine is started. (only applicable to WRX model)\n* SUBARU STARLINK\n * **Delete Subaru STARLINK function icons and setting items on the CID screen.** Note: Subaru STARLINK apps service was ended in 2023.\n* Translation \n * The screen display containing the word “Depress” was mistranslated in four languages (Canadian French, European French, Slovak, and Malay) to mean “Release the brake” instead of “Depress the brake\".\n * Among the error messages in case of CarPlay connection failure, there was a screen that corresponded only to English. Support translations for languages other than English.\n* Performance \n * After ignition on, screen operation may be slow when using CarPlay or other functions without once starting Map. (only applicable to HIGH trim)\n* New Functions and Enhancements included in Update #4:\n * The certificate of the data distribution server for the map update service by MapOTA (MOTA) will be changed from 2025, and the previous server certificate will no longer be able to connect. Therefore, the updated server certificate will be added. (See Appendix 10 (page 76) for more details)",
        "num_comments": 6,
        "comments": [
            "Thanks for the info Chippy!",
            "THANK YOU the fucking muting during a CarPlay call might be fixed; it was driving me nuts.\n\nPraise the iSubaru",
            "Now if only us folks in MA could get an OTA update. Since the systems locks us out of WiFi upgrade. And it’s a hassle schedule a day for the dealership. Especially when they try to charge you for it.",
            "I thought of you when I bolded the starlink app being deleted lol",
            "Tell them you're having problems with the infotainment freezing so they can classify it as warranty work and you won't be charged. \n\n\nOr diy it(not officially supported but lots of us have done it) gen6firmare.com might be a few days before the new files are available",
            "Haha it really is about time they got rid of it, caused way too much confusion for people!"
        ]
    },
    "RIP my dear Subie": {
        "title": "RIP my dear Subie",
        "score": 103,
        "url": "https://www.reddit.com/gallery/1dqzuie",
        "content": "Got an aquaplaning, just opened the door and walked outside. Only few scratches on my head and left hand. I will miss you 😭",
        "num_comments": 19,
        "comments": [
            "God damn, did the car roll over? Glad you walked away",
            "Dang. Glad you're relatively unscathed.",
            "Bet you aren’t injured tho",
            "Glad you're OK! Second Gen Legacys are where it's at!",
            "Still miss my 97. Also had a roll over and it saved me. Be safe out ther!",
            "Эх",
            "You sure it was aqua?",
            "My uncle had the same exact car in Poland, and a day or two before visiting us in the US someone went into his lane and hit him at around 100kph head on. He showed us the pictures and it looked awful, but the most shocking part was that he only had a couple scrapes, bruises, and minor back pain. It was at that moment that I learned just how safe these cars are.",
            "Wow 😮",
            "Yes, thanks"
        ]
    },
    "So this just happened.": {
        "title": "So this just happened.",
        "score": 207,
        "url": "https://i.redd.it/7kdl1hdfsc9d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "What is wrong with that persons parents giving them the initials ASS",
            "Now that’s funny.",
            "ass, gas, or grass... we know which she's choosing.",
            "Get your ass in a Subaru?",
            "I hope that's framed on a wall",
            "That's amazing",
            "Good on them for being brave enough to do it. Someone with those initials knows what it looks like and would find this just as funny.",
            "Have done so, multiple times."
        ]
    },
    "For the love of god who is going 20k between oil changes.": {
        "title": "For the love of god who is going 20k between oil changes.",
        "score": 13,
        "url": "https://i.redd.it/3vkirl87bg9d1.jpeg",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Jerry from Little Lake, MI and Frank from Kanosh, UT. I'm sure there's more but those two I know for sure.",
            "Absolutely nobody that cares about their car.",
            "I found that oil kinda crap for my ej205 if you don't wanna splurge on motul check out valvoline advanced, can get for cheap/on sale and had much better results",
            "If i did my Km to US miles conversion correctly then I do change oil every 6213 miles. (10 000 km metric system which is 1000 miles in europe / sweden.) I am very picky over not going over 6213 miles with both my Subarus.",
            "I'd be interested to see the numbers, I had a garage oil change at about 7k on a car (Vauxhall/Opel) not long ago and they said they'd do it but it'd be a waste of money.\n\nMost of the non US markets seem to recommend far higher mileage (or kilometre-age?) oil changes. \n\nLet me check my Scooby manual to see what the recommendations are.",
            "On my 2007 Matrix, if I get the 10k oil.. I do 8000 miles.\nIf I get the 20k oil, I may push it to 12,000 miles.\n\nSo far so good!  I replaced the valve cover gasket (the car was built in 06, it's 18 years old), and it looks spotless. It also burns zero oil between changes.\nTo be fair, it's all highway miles cruising at 80-95mph, very rarely do I step into the city. \n\n\nMy STI obviously does 5k MAX, with rotella, also doesn't burn oil.",
            "Nissan Altima drivers",
            "That's so detailed. I'm impressed!",
            "I am reading up on the Restore & Protect formula. It is supposed to 100% clean by at least 4 oil changes.\n\nMight want to check your local Walmart for either one. They appear to have the best 5qt oil prices.",
            "I’d love to splurge on oem oil but my ej253 leaks oil so I kind of find it a waste at $34.99gal at my local Subaru dealer. I’ve been using the Valvoline restore and protect and after about 6 oil changes I’ll get their HighMileage+ formula."
        ]
    }
}