{
    "Lots of people are saying time capsules are not being approved anymore. This is not true!": {
        "title": "Lots of people are saying time capsules are not being approved anymore. This is not true!",
        "score": 809,
        "url": "https://www.reddit.com/r/subnautica/comments/zq65tg/lots_of_people_are_saying_time_capsules_are_not/",
        "content": "Edit on 2/21/2024: This is still up-to-date info!\n\nTime capsules are still being approved today. It's a slow process, but it's still happening. Not every capsule gets approved, and the ones that do are hand-selected. \n\nSo if you see anyone saying otherwise, feel free to reference this post :)\n\nUse this thread to AMA about time capsules!\n\nEdit: A couple important things I want to point out:\n\n- When a capsule is jettisoned, it's uploaded to the [time capsule website](https://subnautica.unknownworlds.com/time-capsules) where devs manually review them.  \n- A dev must approve a capsule before it starts showing up in the game.  \n- Around 40 time capsules are placed in your game as you explore, and only spawn in surface biomes.  \n- Time capsules can come from any game mode, but they are platform-specific. Which means PC will only get capsules from other PC players, Switch from Switch players, etc.    \n- A list of blacklisted items can be found [here.](https://www.reddit.com/r/subnautica/comments/zq65tg/lots_of_people_are_saying_time_capsules_are_not/j0z7sdt/)  \n\nThere have been some fantastic questions so far. Feel free to scroll through the comments (or my post history) to find them. If you don't get an answer it's likely because it has already been answered.",
        "num_comments": 305,
        "comments": [
            "Is there a list of things you know aren't permitted? \n\nI know late game items (kyanite for example) will usually not get approved from what I understand.",
            "Huh. I didn't know there was an approval process! Figured it was sort of automated. Makes me a bit sad to know though, as it probably means the ion batteries I filled my capsules with likely didn't get approved. Boo.",
            "Is there something stopping you from using an automated moderation system to approve time capsules?",
            "I just got one with all the main tools with ion batteries and a thermal blade.",
            "After searching and searching for confirmation before investing any more time into my capsule, this is exactly the post I needed to find. Thank you for this.\n\nGlad to see none of my items are on the blacklist, and that approvals are still happening on some timescale.",
            "Do time capsule in creative work as well?",
            "Welp, can’t wait too see what gets picked! Glad non of my shitty ass capsules will get chosen.",
            "I'm wondering what screenshots are blacklisted. Like if I have a screenshot of a reaper, etcetera.",
            "I found a couple! They had posters and water in them super cool",
            "So if you put an item that was black listed in the time capsule, would the time capsule not be put in the game or would they take that specific item out of the time capsule if it was approved?"
        ]
    },
    "We want your Subnautica 2 questions!": {
        "title": "We want your Subnautica 2 questions!",
        "score": 2880,
        "url": "https://www.reddit.com/r/subnautica/comments/1d2rtz7/we_want_your_subnautica_2_questions/",
        "content": "https://preview.redd.it/le6ooz3kv73d1.jpg?width=1600&format=pjpg&auto=webp&s=fb7ef13b4fa363db231a31f60c168ba9abe95196\n\nHello Subnauts,\n\nAt the start of the year, we shared a few [details about Subnautica 2](https://unknownworlds.com/subnautica/an-update-about-the-next-subnautica/). But we’re sure you still have many questions about the next game in the Subnautica universe.\n\nWhich is why we’d love to hear from you all.\n\nWherever you see this posted, reply with what you’d most like to know about Subnautica 2! While we won’t be able to answer everything immediately (no spoilers 🤫), we’ll do our best to answer as many questions as possible in our upcoming posts.\n\nDon’t forget to follow us on all our social channels and [join the official Discord](https://discord.gg/subnautica) to ensure you’re one of the first to hear the latest Subnautica news!\n\nKeep diving,\n\n*The Subnautica Team* ",
        "num_comments": 1278,
        "comments": [
            "How much more customization for base building is there compared to the first two games?",
            "How many leviathans are gonna scare the shit out of us lol",
            "How cool is the protagonists hair going to be?",
            "Is it true that the next game will take place on a different planet or are we staying at 4546B?",
            "Can you put me in the game? My name is Tyler and I'm bald. I want to be memorialized.",
            "Will the Cyclops or a Cyclops-like submarine be returning or added?",
            "Will there be any returning/variations of fish? Like arctic peeper in BZ",
            "Will co-op play affect the story? Or will it be single player story but the world can have multiple people building/exploring etc?",
            "How many creepy biomes are we talking about?\n\n4, maybe 5?",
            "Can the community name a fish?"
        ]
    },
    "So I played this game A LOT with my father. We would just kinda take it in turns passing the controller back and forth. Then he helped me design a tattoo.": {
        "title": "So I played this game A LOT with my father. We would just kinda take it in turns passing the controller back and forth. Then he helped me design a tattoo.",
        "score": 125,
        "url": "https://www.reddit.com/gallery/1dr8iai",
        "content": "The first two photos are when they were freshly tatted. The last photo I just took from another angle. I’ve had more tattoos done in the meantime ",
        "num_comments": 9,
        "comments": [
            "We can't see a good one w the reaper!!",
            "This is so cute 🥰 I hope looking at it will always bring back good memories of playing with your dad.",
            "Now have him spray paint the ghost levithan",
            "The hand tattoo is not directly related to subnautica btw",
            "Definitely, i replayed below zero by myself a few weeks ago. Was a lot of fun",
            "Thats so sick!",
            "Thank you 🥰🥰",
            "Definitely looks more friendly",
            "https://preview.redd.it/l62ubrrywh9d1.jpeg?width=1242&format=pjpg&auto=webp&s=4b7214e3dd1ef9fdce1604cb4aa79a08ff7f268e\n\nI’ve been told he looks quite goofy 😂 he’s definitely not as fierce as in the game"
        ]
    },
    "Subnautica or Below Zero first? I assume Below Zero since it's the lower number; it's all so confusing": {
        "title": "Subnautica or Below Zero first? I assume Below Zero since it's the lower number; it's all so confusing",
        "score": 968,
        "url": "https://www.reddit.com/gallery/1dqwhhb",
        "content": "",
        "num_comments": 148,
        "comments": [
            "I’m gonna take this as a joke due to the Minecraft-painting images and the title. \n\nIf you somehow are not joking, Subnautica first.",
            "I can count the pixels",
            "Sea Combat Zero: the Alterran War",
            "The image here represents the only way I can run Subnauts @ 60fps on my shitty laptop.",
            "To get the full story I suggest to start with Ecco the Dolphin.",
            "Subnautica came out first so...",
            "Need the pixel counter bot in here",
            "Should I watch Dune or Dune Part 2 first?",
            "i know exactly what this post is referencing 😭",
            "If your talking about what to play first subnautica. below zero is more like subnautica 1.5 it's after the first but it's not directly related to the first"
        ]
    },
    "Which abomination do you wish could have been in Subnautica?": {
        "title": "Which abomination do you wish could have been in Subnautica?",
        "score": 340,
        "url": "https://www.reddit.com/gallery/1dr2i4x",
        "content": "Out of all of these creatures in Subnautica, which do you wish we could’ve seen in-game? Oh! And just to clarify, the sea emperor was actually originally gonna have hands, and was gonna be hostile as shown in the teaser trailer.",
        "num_comments": 105,
        "comments": [
            "The Ice Dragon is so cool, im really disappointed it didn’t end up in the game. ",
            "11, I want a alpha reaper",
            "Probably number 2. Although I wouldn’t mind if all of them were added",
            "12 is honestly really cool and I'd love to see it in the next game. I loved the reefbacks but would honestly take lantern turtle over the reefbacks if I could make a choice",
            "All of them. Except for handed sea emperor(ess). Seriously when I realized that version has hands I nearly had a stroke and heart attack at the same time",
            "What is #7, an early concept for the sea dragon? If so, it honestly looks a lot cooler/scarier than what we got",
            "1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13",
            "It would b great if 3 was just a docile kelp munching fish abomination that served to scare the crap out of you. The slug and floating hermit crabs are fantastic too",
            "the sea monkey leviathan like one. They scrapped it for the cute sea monkeys in bz",
            "Number 5 the eldritch god"
        ]
    }
}