{
    "New wiki on how to avoid accidentally encouraging suicide, and how to spot covert incitement": {
        "title": "New wiki on how to avoid accidentally encouraging suicide, and how to spot covert incitement",
        "score": 1784,
        "url": "https://www.reddit.com/r/SuicideWatch/comments/cz6nfd/new_wiki_on_how_to_avoid_accidentally_encouraging/",
        "content": "We've been seeing a worrying increase in pro-suicide content showing up here and, and also going unreported. This undermines our purpose here, so we wanted to highlight and clarify our guidelines about both direct and indirect incitement of suicide.  \n\nWe've created a wiki that covers these issues.  We hope this will be helpful to anyone who's wondering whether something's okay here and which responses to report.  It explains in detail why *any* validation of suicidal intent, even an \"innocent\" message like \"if you're 100% committed, I'll just wish you peace\" is likely to increase people's pain, and why it's important to report even subtle pro-suicide comments. The full text of the wiki's current version is below, and it is maintained at [/r/SuicideWatch/wiki/incitement](http://www.reddit.com/r/SuicideWatch/wiki/incitement). \n\nWe deeply appreciate everyone who gives responsive, empathetic, non-judgemental support to our OPs, and we particularly thank everyone who's already been reporting incitement in all forms.  \n\nPlease report any post or comment that encourages suicide (or that breaks any of the other guidelines in the sidebar) to the moderators, either by clicking the \"report\" button or by [sending us a modmail](https://www.reddit.com/message/compose?to=%2Fr%2FSuicideWatch) with a link. We deal with all guideline violations that are reported to us as soon as we can, but we can't read everything so community reports are essential. If you get a PM that breaks the guidelines, please report it both [to the reddit sitewide admins](http://www.reddit.com/report) and to us in modmail. \n\nThanks to all the great citizens of the community who help flag problem content and behaviour for us.  \n    \n    \n\n******\n***[/r/SuicideWatch/wiki/incitement](http://www.reddit.com/r/SuicideWatch/wiki/incitement)***  \n*******\n\n###Summary###\n\n**It's important to respect and understand people's experiences and emotions. It's never necessary, helpful, or kind to support suicidal intent. There are some common misconceptions (discussed below) about suicidal people and how to help them that can cause well-meaning people to inadvertently incite suicide. There are also people online who incite suicide on purpose, often while pretending to be sympathetic and helpful.** \n\n###Validate Feelings and Experiences, Not Self-Destructive Intentions###\n\nWe're here to offer support, not judgement.  That means accepting, with the best understanding we can offer, whatever emotions people express.  Suicidal people are suffering, and we're here to try to ease that by providing support and caring.  The most reliable way we know to de-escalate someone at risk is to give them the experience of feeling understood. That means not judging whether they should be feeling the way they are, or telling them what to do or not do.  \n\nBut there's an important line to draw here.  There's a crucial difference between empathizing with feelings and responding non-judgmentally to suicidal thoughts, and in any way endorsing, encouraging, or validating suicidal intentions or hopeless beliefs. **It's both possible and important to convey understanding and compassion for someone's suicidal thoughts without putting your finger on the scale of their decision.**\n\nAnything that condones suicide, even passively, *encourages* suicide. It isn't supportive and does not help. It also violates reddit's sitewide rules as well as our guidelines. Explicitly inciting suicide online is a criminal offense in most jurisdictions. \n\nDo not treat any OP's post as meaning that will definitely die by suicide and can't change their minds or be helped. Anyone who's able to read the comments here still has a chance to choose whether or not to try to keep living, even if they've also been experiencing intense thoughts of suicide, made a suicide plan, or started carrying it out.  \n\nIn [the most useful empirical model we have](https://en.wikipedia.org/wiki/Interpersonal_theory_of_suicide), the desire to die by suicide primarily comes from two interpersonal factors; alienation and a sense of being a burden or having nothing to offer. These factors usually lead to a profound feeling of being unwelcome in the world. \n\n**So, any acceptance or reinforcement of suicidal intent, even something \"innocent\" like \"I hope you find peace\", is actually a form of covert shunning that validates a person's sense that they're unwelcome in the world. It will usually add to their pain even if kindly meant and gently worded.**  \n\n###How to Avoid Validating Suicidal Intent###\n\nKeep the following in mind when offering support to anyone at risk for suicide.  \n\n* **People who say they don't want help usually can feel better if they get support that doesn't invalidate their emotions.** Unfortunately, [many popular \"good\" responses are actually counterproductive](https://www.speakingofsuicide.com/2015/03/03/what-not-to-say/). In particular, many friends and family tend to rely exclusively on trying to convince the suicidal person that \"it's not so bad\", and this is usually experienced as \"I don't understand what you're going through and I'm not going to try\".  People who've had \"help\" that made them feel worse don't want any more of the same.  It doesn't mean that someone who actually knows how to be supportive can't give them any comfort.   \n\n*  **Most people who are suicidal want to end their** ***pain,*** **not their lives.**  It's almost never true that death is the only way to end these people's suffering. Of course there are exceptional situations, and we certainly acknowledge that, for some people, the right help can be difficult to find. But preventing someone's suicide doesn't mean prolonging their suffering if we do it by giving them real comfort and understanding. \n\n* ***An unfixable problem doesn't mean that a good life will never be possible***.  We don't have to fix or change anything to help someone feel better. It's important to keep in mind that the correlation between our outer circumstances and our inner experience is weaker and less direct than commonly assumed.  For every kind of difficult life situation, you will find some people who lapse into suicidal despair, and others who cope amazingly well, and a whole spectrum in between. A key difference is how much inner resilience the person has at the time. This can depend on many personal and situational factors. But when there's not enough, interpersonal support can both compensate for its absence and help rebuild it.  We go into more depth on the \"it gets better\" issue in [this PSA Post](https://www.reddit.com/r/SuicideWatch/comments/25igd7/whats_wrong_with_it_gets_better_what_if_it_doesnt/) which is always linked from our sidebar (community info on mobile) guidelines. \n\n* **There are** ***always*** **more choices than brutally forcing someone to stay alive or passively letting them end their lives**.\n\nTo avoid accidentally breaking the anti-incitement rule, don't say or try to imply that acting on suicidal thoughts is a good idea, or that someone can't turn back or is already dead.  Do whatever you can to help them feel cared for and welcome, at least in this little corner of the world.  [Our talking tips](http://redd.it/igh87) offer more detailed guidance.\n\n###Look Out for Deliberate Incitement.  It May Come in Disguise.###\n\nOften comments that subtly encourage suicidal intent actually come from suicide fetishists and voyeurs ([unfortunately this is a real and disturbing phenomenon](https://en.wikipedia.org/wiki/William_Francis_Melchert-Dinkel)). People like this *are* out there and the anonymous nature of reddit makes us particularly attractive to them.  \n\nThey will typically try to scratch their psychological \"itch\" by saying things that push people closer to the edge.  They often do this by exploiting the myths that we debunked in the bullet points above.  Specifically you might see people doing the following:\n\n* Encouraging the false belief that the only way suicidal people can end their pain is by dying.  **There are** ***always*** **more and better choices than \"brutally forcing someone to stay alive\" or helping (actively or passively) them to end their lives**.\n\n* Creating an artificial and toxic sense of \"solidarity\" by linking their encouragement of suicide to empathy.  They will represent themselves as the only one who really understand the suicidal person, while either directly or indirectly encouraging their self-loathing emotions and self-destructive impulses.  **Since most people in suicidal crisis are in desperate need to empathy and understanding, this is a particularly dangerous form of manipulation.**  \n\nMany suicide inciters are adept at putting a benevolent spin on their activities while actually luring people away from sources of real help.  A couple of key points to keep in mind: \n\n* **Skilled suicide intervention -- peer or professional -- is based on empathic responsiveness to the person's feelings that reduces their suffering in the moment.**  Contrary to pop-culture myths, it does **not** involve persuasion (\"Don't do it!\"), cheerleading (\"You've got this!\") or meaningless false promises (\"Trust me, it gets better!\"), or invalidation (\"Let me show you how things aren't as bad as you think!\").  Anyone who leads others to expect these kinds of toxic responses, or any other response that prolongs their pain, from expert help may be covertly pro-suicide. (Of course, people sometimes do have bad experience when seeking mental-health treatment, and it's fine to vent about those, but processing our own disappointment and frustration is entirely different from trying to destroy someone else's hope of getting help.)\n\n* **Choices made by competent responders are always informed by the understanding that breaching someone's trust is traumatic and must be avoided if possible.**  Any kind of involuntary intervention is an **extremely unlikely** outcome when someone consults a clinician or calls a hotline. (Confidentiality is addressed in more detail in [our Hotlines FAQ post](http://redd.it/1c7ntr)). The goal is always to provide all help with the client's full knowledge and informed consent. We know that no individual or system is perfect.  Mistakes that lead to bad experiences do sometimes happen to vulnerable people, and we have enormous sympathy for them. But anyone who suggests that this is the norm might be trying to scare people away from the help they need.  \n\nPlease [let us know discreetly](https://www.reddit.com/message/compose?to=%2Fr%2FSuicideWatch) if you see anyone exhibiting these or similar behaviours. We don't recommend trying to engage with them directly.",
        "num_comments": 248,
        "comments": [
            "I'm sorry did you say suicide fetishists? As in people who actually find pleasure in others committing suicide?",
            "I didn’t necessarily see this addressed, perhaps I overlooked it. I personally think the whole “it gets better” campaign was BS. It’s not 100% true, yay for those whose lives have improved and they can honestly look back and say wow, I’m really glad I didn’t die. Is that little bandaid still discouraged? I hope so. Because as someone who has wanted to die (not necessarily kill myself) since I was probably at least 25, and I’m now 48 and at the lowest point I’ve been, it does not get better. And it can get worse. \n\nI would never encourage anyone to kill themselves. But if their mind is made up, I want them to know it’s ok, I want them to be at peace because it’s obviously not with them now.",
            "I read so much about what NOT to do, what not to say. Just let the person know you are there for them. \"It must be hard to feel this way\" blabla. OKAY. Nice. That works fine the first time, maybe a second time the person tells you that. But if this person repeats themselfs OVER AND OVER AGAIN. For the last fucking 3 years, every day, everrrryyy fucking day, WHAT THE FUCK AM I SUPPOSED TO SAY? If they keep saying that they are useless, that nothing is gonna help, that they need to die, that everyone is better off without them, everyday. What am I supposed to respond? Evertyime just \"oh it must be hard to feel this way\" or \"I wish I could help you get better\". Just let them sit there and not try to find a way out? This person extects help. Would be great if you gave tips about how to behave THEN. The long-term-conversation.",
            "For the longest time, I thought this was a sub in which people could share their suicidal tendencies without judgement or ridicule and find support...not to stay alive, but in whatever decision they ended up making. Definitely wrong about that.",
            "Bruuuh if a sane person wants to die it’s their right.",
            "Oh my gosh thank you for this.  Sometimes I feel like I'm annoying for reporting so much posts and comments, but it was disturbing me.",
            "Everyone in the place is just incredibly condescending.",
            "I don't know why, but that simple phrase \"I hope you find peace\" riles me up. Like you said, it just feels like dismissiveness and a lack of willingness to actually try talking to and comforting the person. And people on this sub continue to use it even after you outline it's a form of \"covert shunning.\"",
            ">This undermines our purpose here\n\nNot trying to be funny, but what *is* your purpose? I've been coming here for years and it seems like this place is only helpful for people who have made attempts. Any other posts are either ignored or closed/locked.",
            "This just kind of makes me feel afraid to post here, like I’ll get banned for expressing the pain that makes me want to kill myself. It just adds to my sense of rejection like not even this place wants me. Thanks. I’ll just keep it to myself like always"
        ]
    },
    "Please remember that NO ACTIVISM of any kind is ever allowed here. No matter what day it is.": {
        "title": "Please remember that NO ACTIVISM of any kind is ever allowed here. No matter what day it is.",
        "score": 716,
        "url": "https://www.reddit.com/r/SuicideWatch/comments/pl9suy/please_remember_that_no_activism_of_any_kind_is/",
        "content": "Activism, i.e. advocating or fundraising for social change or raising awareness of social issues (and suicide is, inescapably, a social issue) is absolutely against the rules here at all times. \n\nPlease understand that we're all for smart, strategic mental-health and suicide-prevention activism. It's essential to fight against stigma, misinformation, and discrimination, and to fight for research, treatment, accommodation, acceptance, and understanding. Most of us, one way or another, are mental-health activists IRL. \n\nBut activism just doesn't work in a dedicated support space that serves a vulnerable population. We used to allow it but the evidence that it was undermining our primary purpose became overwhelming.  We do regret the need for this rule, but the need is inescapable. \n\nOur population is all too well aware of the issues and causes that need support and largely not in a position to take action, so besides the fact that activism is often salt in our community's wounds, it's a waste of the activists' time.\n\n**tl;dr** Any fundraising, awareness raising, petitions, calls for participation, or any post that's about any cause or issue (rather than a request for personal support) is not allowed here.  Please report everything of the nature that you see.",
        "num_comments": 43,
        "comments": [
            "thank you for explaining what you ment by activism, this comment was really helpful",
            "Got it",
            "I love the firmness of your stance",
            "[removed]",
            "Ok, got it",
            "[removed]",
            "i see. thanks for the info",
            "I don't get it, this is very contradicting . What did you mean by no activism but what were doing here is activism ?",
            "[deleted]",
            "smart"
        ]
    },
    "My mom got me a cat after my suicide attempt, despite me CONSTANTLY telling her i never wanted one ": {
        "title": "My mom got me a cat after my suicide attempt, despite me CONSTANTLY telling her i never wanted one ",
        "score": 181,
        "url": "https://www.reddit.com/r/SuicideWatch/comments/1dqvff4/my_mom_got_me_a_cat_after_my_suicide_attempt/",
        "content": "Last week, i attempted suicide for the second time. While i managed to keep my first attempt, mostly a secret, that did not happen to my second. My parents found me in my room almost dying and took me to the hospital. And yk, the docs did the stomach cleaning stuff, and now i am home. \n\nThroughout these last few days, i have barely talked with my parents. Stuff has been really awkward because they want to talk about it, and i don't. \n\nYesterday, when i came back to my room after my walk, i found this open box with a little cat inside of it. And there's cat food on my desk, and some water and this note from my mom about how he was there to help me get better, and how taking care of him would make me love life more, and give me a sense of responsibility. \n\nAnd like, i don't want him. He's lovely, truly. His meows are adorable, and he wants to play, and he looks so cute. But i don't have what it takes to take care of a cat. And worse, i don't want him to get attached to me because if i kill myself, I'll break his little heart. \n\nAnd idk what to do, because my mom said that she won't take care of him, neither will my dad, nor brother. So she gave me this responsibility, which she knows i don't want, and she'll get pissed if i get rid of it. Cause i can't give him away. She'll get mad and most likely get another one.\n\nCause here's the thing. Sometimes, i send her memes and videos of cats doing silly and cute things because i love cats and dogs. They're adorable. But that doesn't mean i want them. And whenever i send her one of those, she asks me, \"Hey, don't you ever want one?\" and i always answer \"No, mom. I do not\"\n\nSometimes, i do monologs about why i don't want a pet. Because i know how she is. I know how her mind interprtates things. So i was as explicit as possible. ",
        "num_comments": 99,
        "comments": [
            "Sorry your mum sprung this on you…\nThrowing responsibility in a vulnerable state is not it \nCats help they can be therapeutic but yeah you need to want one haha…\nI’d say give it a try for now but honestly if it really drains you…have a word with mum \n\nThe best thing you can do is be honest about it making you feel worse \nand if she dismisses you then I’m sorry \nIt’s hard…I hope you’re doing well though\n\nIf you need cat tips I can help \nNot trying to convince you to keep it but right now there’s a living being in your care and I think it might be good to put some focus on taking care of it for the time being until you find a solution.\n\nBut I think your mom is sweet for trying but she should’ve listened to you xx\n\nAnyway hope you recover,- have a good weekend\nLife is funky I hope it gets better for you ❤️",
            "Give the cat a chance. They do help. You can talk to cats, play with cats. They love you for who you are without judgement. \n\nI’m not sure I would even be around if it wasn’t for my cat. \n\nWhat’s surprising is the hospital let you leave. Usually attempts get you held for a minimum of 72 hours.",
            "I love cats and pets… but having one not by choice does not help things. I’m sorry your mom is so out of touch with your needs and your feelings. It sucks.",
            "Man im so sorry about half of these comments wtf. yeah, cats are cool and in MY personal experience mine helped me. but that's MY experience and half these mfs don't seem to understand that personal experience doesn't equal universal truth 😭 real talk though, im sorry your mom did that. Its really not fair on you to be basically forced into taking care of an entire animal when you need to be focusing on taking care of yourself, especially when you've explicitly told her you really don't want one. Its shitty that your mom has basically seen this cat as a \"quick fix\" and completely disregarded your wants and opinions simply because she thinks she knows best",
            "The fact is, your mom did a completely braindead thing to try and anchor you to this world. Burdening you with responsibility to keep you in check seemed to her a better option than waiting a bit more time till you're willing to talk and communicating with you, trying to figure out what it is that YOU would rather she does. The amount of people in this comment section that are on her side is mindblowing, am I even on the right sub?\nI'm sorry this has happened to you, I hope you manage to give the cat away soon.",
            "To add a bit of levity to your post, you could get your mom a puppy. See how she reacts to that!",
            "Comment section is infuriating.\n\nI’m so sorry that this was sprung upon you by your mother. Maybe cats are less responsibility than other pets, but they are still a responsibility and your responsibility should be focusing on taking care of yourself right now, not another living being. \n\nAs someone who relates to your state of mental health, and who has a cat, some days it is near impossible to get up just to clean a litter box when I also can’t even brush my teeth. And I get up and do it anyway, but the amount of GUILT I feel for looking at my cat as an inconvenience to my depression at times only serves to bring me down further.\n\nNot only that, but it is also a financial commitment in terms of regular every day care as well as surprise vet visits when they do something stupid (eat a dead lily, in my case. No flowers around anymore before anyone comes for me.)\n\nI am so sorry you are in this position. I completely hear you and feel for you. I hope you are looking after yourself as best you can.\n\nEdit to add: I love my cat. I will always take good care of my cat. But if it was thrust upon me in a situation like this I would be full of resentment.",
            "This comment section is NOT it. I feel you OP, my parents did something similar to me, but with a dog. I’m not a dog person, I love my cat dearly and she really did give me something to live for when I really needed it, but I made the choice to get her. Having a living thing that is dependent on you is exhausting and terrifying if you’re already barely taking care of yourself. I’m sure your mom had good intentions, but this definitely wasn’t the way to go about it. Since you’re saying that re-homing the kitten isn’t an option, do you think that if you maybe give it a week or so that you could take care of him and then try to talk to your mom about it? maybe if she sees that you’re trying and gave it an honest effort and still aren’t ready/don’t want a pet she’ll be more receptive and understanding to re-homing or taking responsibility for him. I’m sorry I really can’t help much in the way of advice, but please know that your feelings on this are valid and I hope you’re taking as good of care of yourself as you can. :)",
            "Jesus these comments are just astounding. A cat doesn’t cure mental health. That’s something that requires therapy and possibly medication. I have severe anxiety and depression and getting out of bed is a chore. I have 5 cats and none of them help with my mental health and honestly if it wasn’t for my boys taking care of them they’d be dead. A cat is NOT the solution. If you’re mom wants a cat that’s great let her have it. You need to focus on you. If I were you I’d revoke the cat and not tell your mom. The other option is to close your door and ignore the car and force your mother to care for it. She brought it into the home which makes it her responsibility. If you’re a minor then it’s even more her responsibility. Just tell her you can’t bring a cat into the home and expect it to make everything better. Tell her it’s her cat and she can care for it. Do what I do lay in bed all day with the door closed, curtains closed and veg in bed all day. If your mom demands you care for it just politely say no thank you.",
            ">the stomach cleaning stuff,\n\nI was offered to do this, but since I'm an adult, I didn't give consent for it (they would only do it if I fainted or sm). \n\n\nCan someone explain what exactly happens during that?"
        ]
    },
    "I was born in the wrong time": {
        "title": "I was born in the wrong time",
        "score": 111,
        "url": "https://www.reddit.com/r/SuicideWatch/comments/1dqx0vk/i_was_born_in_the_wrong_time/",
        "content": "First of all, I would like to honor anybody who were born in 2000-2008. I (2004) lost this war against this declining economy. I can’t find a job, I ran out of savings, my credit card account just got locked, and I want to go to college but I wanted to get a job first so I could pay my bills. I already thought about joining the military but I seriously don’t want to go that route. I’ve been thinking of suicide ever since I was 14. I already went through meds and therapy, which didn’t work out for me. My family pretty much doesn’t care about me since they all have things to care about themselves. I have no friends or anything so nobody but probably like 5 people are going to grieve for my death and I’m sorry for them but we all are going to die anyways. ",
        "num_comments": 21,
        "comments": [
            "There’s so much shit on here about the economy it’s messed up. The world can’t go on like this forever, something has to change before our society collapses",
            "This is my life, its almost impossible to land a job in my country. I've applied to hundreds of places with no luck, I sit in my apartment all day and just wallow in sadness, cry and cry some more. Idk what to do at this point just wanna end it, I can barely afford to eat",
            "I'm 17 (2006) and honestly I'm scared of joining the work force because of the prices and inflation.\n\nI'll probably try to become a 9-1-1 dispatcher or something.\n\nOr become a ranch hand",
            "I was born in 1970. I have my own issues and have no home that I own and a job that I don't love.\n\nIt is not easy to go though life with issues, i know this.\n\nI suppose you are getting help, I hope so...I am.\n\nI don't know what the way forward will be for you or for me, but I am working on it, I can only hope you do to.\n\nI am an ear if you ever need one, for what that is worth.",
            "You know, 5 people that would grieve your passing is not nothing. Ive learned as I get older that being popular is really important when younger, but the idea of it just does not interest the deep sensitive souls of the world, as many of us here, are. \n\nWhat you are going through is very tough and I cant tell you it will get better. All I can say is try to hold out just a few more years . Even a week. \n\nYou can set a date in the future, like this time next year, if my life is worse or hasn’t gotten a little better, or I have gotten stronger (in the sense that I have gained tools and framing of troubles) , then I will hit delete . \n\nYou are not alone",
            "2001- i came here with the same reasons in my mind. This economy gives me no hope. I can’t get a job despite my education and only a few people will grieve me as well. I know my death would be talked about a quite a bit but only a few people would truly hurt. I would love to just disappear to spare those people and I only hold on for them.",
            "Did you apply for a fast food or retail job, ❤️ they \naccept a lot. And grocery stores also pay good. You don’t have to d13",
            "Pretty much the same thing is going on with me, except I’m choosing the military route",
            "Where I live needs good workers. Declare bankruptcy if your debt is unmanageable, buy a ticket,  get on food stamps, free Healthcare, get a cash under the table job,  work hard and start over.  I am not joking my worker I've had for a year showed up here with nothing but a few bucks and clothes and just  this last month dropped 25k he saved on his own piece of land. It can be done.  I'm happy to pay well for good work and so are many people here. I hope you consider it.  And really free Healthcare in this state, 500 or more in food stamps. It's a big welfare state and while I don't really like welfare states if my taxes go to hard workers in need it's easier to handle. There's a lot of satisfaction to be had working hard outside.",
            "I joined the military it was the best decision i ever made 🫡"
        ]
    },
    "Why is this world so cruel": {
        "title": "Why is this world so cruel",
        "score": 208,
        "url": "https://www.reddit.com/r/SuicideWatch/comments/1dqs4fm/why_is_this_world_so_cruel/",
        "content": "The US Supreme Court just ruled in favor of jailing homeless people simply for not being able to find a place to sleep. Watching cops harass the homeless has always made me feel like this world truly has no compassion left. This country is sad and cruel and now things just got even bleaker. I hate that I was born into a nation of cruel hypocrites. ",
        "num_comments": 75,
        "comments": [
            "I wonder about this kind of stuff too. I don't understand how people can do these things and tell themselves that they're good people.",
            "This world is ruled by psychopaths. That's why",
            "Because human is stupid. \nsomehow... The least valued value is that of human life among each other.",
            "The opinion is online: google City of Grants Pass v. Johnson, to read Gorsuch’s vile opinion. This just cleared the way for all American cities to jail someone for the “crime” of not having a place to live due to poverty. Imagine being jailed when there are no homeless shelter beds available. And when you get arrested, your pets and belongings are taken and usually never returned. Americans are so cruel.",
            "And imagine me being an autistic person who likes to be outside and sleep outside….now there will be cops harassing me….i have no escape",
            "Nobody else thinks like this, so whoever agrees with me that the world is cruel can you please be my friend……?",
            "It is a cruel country now, but I hope you know you are not alone.",
            "It's absurd. How sad. Science is saying the earth is on its sixth mass extinction. The end of humanity...? Times really are that bad. Inhumane treatment of innocent people.",
            "A lot of intellectuals have discussed how and why we have gotten to this horrible place. Mark Fisher (*Capitalist Realism*),  and Marta Russell (*Capitalism and Disability*) are among two of my faves.",
            "I recently became homeless due to a shitty roommate. I'm so fucked. I don't care anymore about my life. I'd rather be dead than in jail."
        ]
    }
}