{
    "New wiki on how to avoid accidentally encouraging suicide, and how to spot covert incitement": {
        "title": "New wiki on how to avoid accidentally encouraging suicide, and how to spot covert incitement",
        "score": 1784,
        "url": "https://www.reddit.com/r/SuicideWatch/comments/cz6nfd/new_wiki_on_how_to_avoid_accidentally_encouraging/",
        "content": "We've been seeing a worrying increase in pro-suicide content showing up here and, and also going unreported. This undermines our purpose here, so we wanted to highlight and clarify our guidelines about both direct and indirect incitement of suicide.  \n\nWe've created a wiki that covers these issues.  We hope this will be helpful to anyone who's wondering whether something's okay here and which responses to report.  It explains in detail why *any* validation of suicidal intent, even an \"innocent\" message like \"if you're 100% committed, I'll just wish you peace\" is likely to increase people's pain, and why it's important to report even subtle pro-suicide comments. The full text of the wiki's current version is below, and it is maintained at [/r/SuicideWatch/wiki/incitement](http://www.reddit.com/r/SuicideWatch/wiki/incitement). \n\nWe deeply appreciate everyone who gives responsive, empathetic, non-judgemental support to our OPs, and we particularly thank everyone who's already been reporting incitement in all forms.  \n\nPlease report any post or comment that encourages suicide (or that breaks any of the other guidelines in the sidebar) to the moderators, either by clicking the \"report\" button or by [sending us a modmail](https://www.reddit.com/message/compose?to=%2Fr%2FSuicideWatch) with a link. We deal with all guideline violations that are reported to us as soon as we can, but we can't read everything so community reports are essential. If you get a PM that breaks the guidelines, please report it both [to the reddit sitewide admins](http://www.reddit.com/report) and to us in modmail. \n\nThanks to all the great citizens of the community who help flag problem content and behaviour for us.  \n    \n    \n\n******\n***[/r/SuicideWatch/wiki/incitement](http://www.reddit.com/r/SuicideWatch/wiki/incitement)***  \n*******\n\n###Summary###\n\n**It's important to respect and understand people's experiences and emotions. It's never necessary, helpful, or kind to support suicidal intent. There are some common misconceptions (discussed below) about suicidal people and how to help them that can cause well-meaning people to inadvertently incite suicide. There are also people online who incite suicide on purpose, often while pretending to be sympathetic and helpful.** \n\n###Validate Feelings and Experiences, Not Self-Destructive Intentions###\n\nWe're here to offer support, not judgement.  That means accepting, with the best understanding we can offer, whatever emotions people express.  Suicidal people are suffering, and we're here to try to ease that by providing support and caring.  The most reliable way we know to de-escalate someone at risk is to give them the experience of feeling understood. That means not judging whether they should be feeling the way they are, or telling them what to do or not do.  \n\nBut there's an important line to draw here.  There's a crucial difference between empathizing with feelings and responding non-judgmentally to suicidal thoughts, and in any way endorsing, encouraging, or validating suicidal intentions or hopeless beliefs. **It's both possible and important to convey understanding and compassion for someone's suicidal thoughts without putting your finger on the scale of their decision.**\n\nAnything that condones suicide, even passively, *encourages* suicide. It isn't supportive and does not help. It also violates reddit's sitewide rules as well as our guidelines. Explicitly inciting suicide online is a criminal offense in most jurisdictions. \n\nDo not treat any OP's post as meaning that will definitely die by suicide and can't change their minds or be helped. Anyone who's able to read the comments here still has a chance to choose whether or not to try to keep living, even if they've also been experiencing intense thoughts of suicide, made a suicide plan, or started carrying it out.  \n\nIn [the most useful empirical model we have](https://en.wikipedia.org/wiki/Interpersonal_theory_of_suicide), the desire to die by suicide primarily comes from two interpersonal factors; alienation and a sense of being a burden or having nothing to offer. These factors usually lead to a profound feeling of being unwelcome in the world. \n\n**So, any acceptance or reinforcement of suicidal intent, even something \"innocent\" like \"I hope you find peace\", is actually a form of covert shunning that validates a person's sense that they're unwelcome in the world. It will usually add to their pain even if kindly meant and gently worded.**  \n\n###How to Avoid Validating Suicidal Intent###\n\nKeep the following in mind when offering support to anyone at risk for suicide.  \n\n* **People who say they don't want help usually can feel better if they get support that doesn't invalidate their emotions.** Unfortunately, [many popular \"good\" responses are actually counterproductive](https://www.speakingofsuicide.com/2015/03/03/what-not-to-say/). In particular, many friends and family tend to rely exclusively on trying to convince the suicidal person that \"it's not so bad\", and this is usually experienced as \"I don't understand what you're going through and I'm not going to try\".  People who've had \"help\" that made them feel worse don't want any more of the same.  It doesn't mean that someone who actually knows how to be supportive can't give them any comfort.   \n\n*  **Most people who are suicidal want to end their** ***pain,*** **not their lives.**  It's almost never true that death is the only way to end these people's suffering. Of course there are exceptional situations, and we certainly acknowledge that, for some people, the right help can be difficult to find. But preventing someone's suicide doesn't mean prolonging their suffering if we do it by giving them real comfort and understanding. \n\n* ***An unfixable problem doesn't mean that a good life will never be possible***.  We don't have to fix or change anything to help someone feel better. It's important to keep in mind that the correlation between our outer circumstances and our inner experience is weaker and less direct than commonly assumed.  For every kind of difficult life situation, you will find some people who lapse into suicidal despair, and others who cope amazingly well, and a whole spectrum in between. A key difference is how much inner resilience the person has at the time. This can depend on many personal and situational factors. But when there's not enough, interpersonal support can both compensate for its absence and help rebuild it.  We go into more depth on the \"it gets better\" issue in [this PSA Post](https://www.reddit.com/r/SuicideWatch/comments/25igd7/whats_wrong_with_it_gets_better_what_if_it_doesnt/) which is always linked from our sidebar (community info on mobile) guidelines. \n\n* **There are** ***always*** **more choices than brutally forcing someone to stay alive or passively letting them end their lives**.\n\nTo avoid accidentally breaking the anti-incitement rule, don't say or try to imply that acting on suicidal thoughts is a good idea, or that someone can't turn back or is already dead.  Do whatever you can to help them feel cared for and welcome, at least in this little corner of the world.  [Our talking tips](http://redd.it/igh87) offer more detailed guidance.\n\n###Look Out for Deliberate Incitement.  It May Come in Disguise.###\n\nOften comments that subtly encourage suicidal intent actually come from suicide fetishists and voyeurs ([unfortunately this is a real and disturbing phenomenon](https://en.wikipedia.org/wiki/William_Francis_Melchert-Dinkel)). People like this *are* out there and the anonymous nature of reddit makes us particularly attractive to them.  \n\nThey will typically try to scratch their psychological \"itch\" by saying things that push people closer to the edge.  They often do this by exploiting the myths that we debunked in the bullet points above.  Specifically you might see people doing the following:\n\n* Encouraging the false belief that the only way suicidal people can end their pain is by dying.  **There are** ***always*** **more and better choices than \"brutally forcing someone to stay alive\" or helping (actively or passively) them to end their lives**.\n\n* Creating an artificial and toxic sense of \"solidarity\" by linking their encouragement of suicide to empathy.  They will represent themselves as the only one who really understand the suicidal person, while either directly or indirectly encouraging their self-loathing emotions and self-destructive impulses.  **Since most people in suicidal crisis are in desperate need to empathy and understanding, this is a particularly dangerous form of manipulation.**  \n\nMany suicide inciters are adept at putting a benevolent spin on their activities while actually luring people away from sources of real help.  A couple of key points to keep in mind: \n\n* **Skilled suicide intervention -- peer or professional -- is based on empathic responsiveness to the person's feelings that reduces their suffering in the moment.**  Contrary to pop-culture myths, it does **not** involve persuasion (\"Don't do it!\"), cheerleading (\"You've got this!\") or meaningless false promises (\"Trust me, it gets better!\"), or invalidation (\"Let me show you how things aren't as bad as you think!\").  Anyone who leads others to expect these kinds of toxic responses, or any other response that prolongs their pain, from expert help may be covertly pro-suicide. (Of course, people sometimes do have bad experience when seeking mental-health treatment, and it's fine to vent about those, but processing our own disappointment and frustration is entirely different from trying to destroy someone else's hope of getting help.)\n\n* **Choices made by competent responders are always informed by the understanding that breaching someone's trust is traumatic and must be avoided if possible.**  Any kind of involuntary intervention is an **extremely unlikely** outcome when someone consults a clinician or calls a hotline. (Confidentiality is addressed in more detail in [our Hotlines FAQ post](http://redd.it/1c7ntr)). The goal is always to provide all help with the client's full knowledge and informed consent. We know that no individual or system is perfect.  Mistakes that lead to bad experiences do sometimes happen to vulnerable people, and we have enormous sympathy for them. But anyone who suggests that this is the norm might be trying to scare people away from the help they need.  \n\nPlease [let us know discreetly](https://www.reddit.com/message/compose?to=%2Fr%2FSuicideWatch) if you see anyone exhibiting these or similar behaviours. We don't recommend trying to engage with them directly.",
        "num_comments": 248,
        "comments": [
            "I'm sorry did you say suicide fetishists? As in people who actually find pleasure in others committing suicide?",
            "I didnt necessarily see this addressed, perhaps I overlooked it. I personally think the whole it gets better campaign was BS. Its not 100% true, yay for those whose lives have improved and they can honestly look back and say wow, Im really glad I didnt die. Is that little bandaid still discouraged? I hope so. Because as someone who has wanted to die (not necessarily kill myself) since I was probably at least 25, and Im now 48 and at the lowest point Ive been, it does not get better. And it can get worse. \n\nI would never encourage anyone to kill themselves. But if their mind is made up, I want them to know its ok, I want them to be at peace because its obviously not with them now.",
            "I read so much about what NOT to do, what not to say. Just let the person know you are there for them. \"It must be hard to feel this way\" blabla. OKAY. Nice. That works fine the first time, maybe a second time the person tells you that. But if this person repeats themselfs OVER AND OVER AGAIN. For the last fucking 3 years, every day, everrrryyy fucking day, WHAT THE FUCK AM I SUPPOSED TO SAY? If they keep saying that they are useless, that nothing is gonna help, that they need to die, that everyone is better off without them, everyday. What am I supposed to respond? Evertyime just \"oh it must be hard to feel this way\" or \"I wish I could help you get better\". Just let them sit there and not try to find a way out? This person extects help. Would be great if you gave tips about how to behave THEN. The long-term-conversation.",
            "Bruuuh if a sane person wants to die its their right.",
            "Oh my gosh thank you for this.  Sometimes I feel like I'm annoying for reporting so much posts and comments, but it was disturbing me.",
            "Everyone in the place is just incredibly condescending.",
            "I don't know why, but that simple phrase \"I hope you find peace\" riles me up. Like you said, it just feels like dismissiveness and a lack of willingness to actually try talking to and comforting the person. And people on this sub continue to use it even after you outline it's a form of \"covert shunning.\"",
            ">This undermines our purpose here\n\nNot trying to be funny, but what *is* your purpose? I've been coming here for years and it seems like this place is only helpful for people who have made attempts. Any other posts are either ignored or closed/locked.",
            "This just kind of makes me feel afraid to post here, like Ill get banned for expressing the pain that makes me want to kill myself. It just adds to my sense of rejection like not even this place wants me. Thanks. Ill just keep it to myself like always",
            "Some subs let you state which sub rule is broken when you report on mobile. Is there a reason that's not the case here? Itd make it easier for mobile users to help."
        ]
    },
    "Please remember that NO ACTIVISM of any kind is ever allowed here. No matter what day it is.": {
        "title": "Please remember that NO ACTIVISM of any kind is ever allowed here. No matter what day it is.",
        "score": 718,
        "url": "https://www.reddit.com/r/SuicideWatch/comments/pl9suy/please_remember_that_no_activism_of_any_kind_is/",
        "content": "Activism, i.e. advocating or fundraising for social change or raising awareness of social issues (and suicide is, inescapably, a social issue) is absolutely against the rules here at all times. \n\nPlease understand that we're all for smart, strategic mental-health and suicide-prevention activism. It's essential to fight against stigma, misinformation, and discrimination, and to fight for research, treatment, accommodation, acceptance, and understanding. Most of us, one way or another, are mental-health activists IRL. \n\nBut activism just doesn't work in a dedicated support space that serves a vulnerable population. We used to allow it but the evidence that it was undermining our primary purpose became overwhelming.  We do regret the need for this rule, but the need is inescapable. \n\nOur population is all too well aware of the issues and causes that need support and largely not in a position to take action, so besides the fact that activism is often salt in our community's wounds, it's a waste of the activists' time.\n\n**tl;dr** Any fundraising, awareness raising, petitions, calls for participation, or any post that's about any cause or issue (rather than a request for personal support) is not allowed here.  Please report everything of the nature that you see.",
        "num_comments": 43,
        "comments": [
            "thank you for explaining what you ment by activism, this comment was really helpful",
            "I love the firmness of your stance",
            "i see. thanks for the info",
            "I don't get it, this is very contradicting . What did you mean by no activism but what were doing here is activism ?",
            "None of that has anything to do with activism.  But saying \"you are loved\" is a terrible tactic.  See the PSA post linked from point 4d in the guidelines.",
            ">  what were doing here is activism ?\n\nWhere does it say that?",
            "Delete what?  This is an official post from the mod team.\n\nAnd mods are not \"always watching\".  That's impossible.  Use the report function for inappropriate content.",
            "Unfortunately all the ones I know of that were specifically suicide-related were either started or invaded by the militant pro-suicide/antinatalist faction and the reddit admins were forced to shut them down.   These twisted souls even destroyed /r/suicidology and they constantly cause us no end of trouble here.",
            "Oh, its one of those this is why we cant have nice things, gotcha. That tracks, and so does the explanation in the main post. Thanks for elaborating",
            "Even if it's true, it's still terrible."
        ]
    },
    "Well… NSFW": {
        "title": "Well… NSFW",
        "score": 27,
        "url": "https://www.reddit.com/r/SuicideWatch/comments/1drbw8d/well_nsfw/",
        "content": "I’ll always love you babygirl. This last cheating is my last straw. I’ve been in constant pain due to a spinal cord injury in 2008. It killed my social life and I haven’t been able to do much of anything since then. In 2011 I thought my time had come. I met my wife of 15 years and told myself to stick around for her; she’d be worth it. I truly believe she my soulmate and that’s the only reason this hurts so deeply, so completely. True despair comes when you thought you were most happy. Two years after we got married her gmom passed and she’s been off the rails since. Serial cheating isn’t enough of a description to put a label on what she’s done. She’s s*xually abused me numerous times. Physical, mental, emotionally has abused me more times than I can count. It’s an actual smalll miracle she hasn’t given either of us an STI or worse. \n\nI’m 6’2” 260 mostly muscle and NO ONE has believed my abuse. She’s 5,2 250. Every time I open up about it I’m laughed at and not believed. “You’re a marine (ret) how can anyone abuse you?!?!” \n\nI’ve not taken this lightly and this is NOT a cry for attention. Let my passing serve as an example of abuse can happen within ANY relationship. \n\nMom I pray I see you on the other side with grandmom. Dad, if you ever see this None of this is your fault. You’re the best dad I could ever wish for. None of this is your fault daddy. None. \n\nI’m 42 in constant physical pain and not having another surgery. \n\n(Spouse) I’m sorry I couldn’t satisfy your whims of threesomes etc. Who you are today is not the woman I married and sacrificed everything for. And yet…I still love\nYou. I always will. I wish I could’ve helped you more than I did. Goodbye. \n\nIn the end it doesn’t matter who did what anymore. Just that I can’t go on with this hurt. \n",
        "num_comments": 7,
        "comments": [
            "Please dont hurt yourself. Life is completely unfair. Imm so sorry they didnt believe you, especially with chronic pain its absolutely possible for you to be abused. Please run from her because shes is awful. What shes done is unforgivable and she doesnt deserve you at all. Try to get therapy or counseling if you can. I care about you and hope the best for you.",
            "That's SO heavy my guy. I'm so sorry",
            "they are laughing at the fact thatyoure crying over some 5'2 250 block of cheese cheating on u",
            "Hey, please take a moment to read this. Stay with us. I think I can understand what you're going through. Maybe I don't, because you've been through a lot we don't even know.\nLife can really be unfair and I know it, but please, give it another chance\nI know you're probably tired of giving chances to something that doesn't seem to be getting better, I'm in the same situation right now.\nThere's always someone who will try to help, you can start therapy, you can do anything that makes you feel better but please don't hurt yourself like that.\nI hope you get better, sending hugs",
            "Fuck off"
        ]
    },
    "My mom got me a cat after my suicide attempt, despite me CONSTANTLY telling her i never wanted one ": {
        "title": "My mom got me a cat after my suicide attempt, despite me CONSTANTLY telling her i never wanted one ",
        "score": 295,
        "url": "https://www.reddit.com/r/SuicideWatch/comments/1dqvff4/my_mom_got_me_a_cat_after_my_suicide_attempt/",
        "content": "Last week, i attempted suicide for the second time. While i managed to keep my first attempt, mostly a secret, that did not happen to my second. My parents found me in my room almost dying and took me to the hospital. And yk, the docs did the stomach cleaning stuff, and now i am home. \n\nThroughout these last few days, i have barely talked with my parents. Stuff has been really awkward because they want to talk about it, and i don't. \n\nYesterday, when i came back to my room after my walk, i found this open box with a little cat inside of it. And there's cat food on my desk, and some water and this note from my mom about how he was there to help me get better, and how taking care of him would make me love life more, and give me a sense of responsibility. \n\nAnd like, i don't want him. He's lovely, truly. His meows are adorable, and he wants to play, and he looks so cute. But i don't have what it takes to take care of a cat. And worse, i don't want him to get attached to me because if i kill myself, I'll break his little heart. \n\nAnd idk what to do, because my mom said that she won't take care of him, neither will my dad, nor brother. So she gave me this responsibility, which she knows i don't want, and she'll get pissed if i get rid of it. Cause i can't give him away. She'll get mad and most likely get another one.\n\nCause here's the thing. Sometimes, i send her memes and videos of cats doing silly and cute things because i love cats and dogs. They're adorable. But that doesn't mean i want them. And whenever i send her one of those, she asks me, \"Hey, don't you ever want one?\" and i always answer \"No, mom. I do not\"\n\nSometimes, i do monologs about why i don't want a pet. Because i know how she is. I know how her mind interprtates things. So i was as explicit as possible. ",
        "num_comments": 124,
        "comments": [
            "I love cats and pets but having one not by choice does not help things. Im sorry your mom is so out of touch with your needs and your feelings. It sucks.",
            "Jesus these comments are just astounding. A cat doesnt cure mental health. Thats something that requires therapy and possibly medication. I have severe anxiety and depression and getting out of bed is a chore. I have 5 cats and none of them help with my mental health and honestly if it wasnt for my boys taking care of them theyd be dead. A cat is NOT the solution. If youre mom wants a cat thats great let her have it. You need to focus on you. If I were you Id revoke the cat and not tell your mom. The other option is to close your door and ignore the car and force your mother to care for it. She brought it into the home which makes it her responsibility. If youre a minor then its even more her responsibility. Just tell her you cant bring a cat into the home and expect it to make everything better. Tell her its her cat and she can care for it. Do what I do lay in bed all day with the door closed, curtains closed and veg in bed all day. If your mom demands you care for it just politely say no thank you.",
            "Man im so sorry about half of these comments wtf. yeah, cats are cool and in MY personal experience mine helped me. but that's MY experience and half these mfs don't seem to understand that personal experience doesn't equal universal truth  real talk though, im sorry your mom did that. Its really not fair on you to be basically forced into taking care of an entire animal when you need to be focusing on taking care of yourself, especially when you've explicitly told her you really don't want one. Its shitty that your mom has basically seen this cat as a \"quick fix\" and completely disregarded your wants and opinions simply because she thinks she knows best",
            "To add a bit of levity to your post, you could get your mom a puppy. See how she reacts to that!",
            "You know whats so special about you, even though you are going through so much and are on the verge of dying , you are still thinking about how it might affect his little heart and whos going to take care of it , you are a beautiful human!",
            "This comment section is NOT it. I feel you OP, my parents did something similar to me, but with a dog. Im not a dog person, I love my cat dearly and she really did give me something to live for when I really needed it, but I made the choice to get her. Having a living thing that is dependent on you is exhausting and terrifying if youre already barely taking care of yourself. Im sure your mom had good intentions, but this definitely wasnt the way to go about it. Since youre saying that re-homing the kitten isnt an option, do you think that if you maybe give it a week or so that you could take care of him and then try to talk to your mom about it? maybe if she sees that youre trying and gave it an honest effort and still arent ready/dont want a pet shell be more receptive and understanding to re-homing or taking responsibility for him. Im sorry I really cant help much in the way of advice, but please know that your feelings on this are valid and I hope youre taking as good of care of yourself as you can. :)",
            "The fact is, your mom did a completely braindead thing to try and anchor you to this world. Burdening you with responsibility to keep you in check seemed to her a better option than waiting a bit more time till you're willing to talk and communicating with you, trying to figure out what it is that YOU would rather she does. The amount of people in this comment section that are on her side is mindblowing, am I even on the right sub?\nI'm sorry this has happened to you, I hope you manage to give the cat away soon.",
            "thats a difficult situation, she definitely shouldnt have done that. my parents got me a kitten when i got out of hospital after one of my first attempts but the major difference was i wanted him and he did help me so much, but i *wanted* him. i was willing to take on the responsibility and love him. hes now 5 years old and a bit emotionally messed up because of me, that very thing of getting so attached to me but then i was gone (sectioned in hospital) for a few years. i have a lot of guilt for that. pets are a big responsibility and im sorry thats been sprung on you unwillingly, i hope things work out for you and the little guy",
            "This reminded me of my ex he was suicidal and so depressed he stopped brushing his teeth and taking care of himself so his parents thought Id be a good idea to get him a dog. The dog was so cute and for a few days it helped him get out of the house but I think within a month he had to re/home the dog. That was such a sad realization my ex was gorgeous when I met him and he was brilliant and his family was well off I couldnt believe how good he had it and he still just wanted to die and he pushed everyone away including me. I wanted to be there for him so badly but he pushed me away to the point that he made me feel like a stalker for caring. I hope to goodness hes okay but he definitely became reclusive. I heard he got better after traveling to a country he always wanted to go to but I dont know if its true. I hope theres something that you can look forward to.",
            "Ive went to one counsellor saying that I shouldnt have a pet if Im not ready to take care of it, and another counsellor recommended that I do get a pet because it will make you happy. Theres a lot of mixed reviews, so ultimately do what you think is right for you in that moment. Since your parents also gifted you with the cat, they should help out too."
        ]
    },
    "i took 300+ pills & all i got was kidney failure.": {
        "title": "i took 300+ pills & all i got was kidney failure.",
        "score": 58,
        "url": "https://www.reddit.com/r/SuicideWatch/comments/1dr4dju/i_took_300_pills_all_i_got_was_kidney_failure/",
        "content": "this was a couple months ago, & im not going to tell u all which pills. just posting this to say, ODing on pills is NOT worth the physical toll.\n\nit's an EXTREMELY PAINFUL way to die, that doesn't even normally kill you. even without medical attention, it typically doesn't kill you, & you can get LIFELONG complications.\n\nlife sucks, i know firsthand, i have a slew of mental & physical illnesses. but if you're thinking about overdosing, please don't. you will only make your life SO much more painful.\n\nplease seek help if u are thinking of unaliving yourself, please stay safe y'all <3",
        "num_comments": 7,
        "comments": [
            "I went temporarily insane from my OD",
            "Yeah pills just fucking suck\n\nI used them my first attempt and I woke up vomiting my guts out",
            "I know how it feels. My lower intestinal area was ON FIRE when I tried to overdose by blending stashed pills. Never again. Not worth it. If I try to die again, its going to be some other way",
            "i feel this. i had a NDE DMT trip for hours, the brain is wild",
            "i hope u don't ever make an attempt again, but i feel this. all methods have their drawbacks, but yea pills r awful..\n\nalso is that ur art in ur PFP? you're an amazing artist!! i hope u stay alive & so u can make more art, but i understand feeling a need to end suffering. take care fellow creative",
            "i feel that. most of my attempts weren't pill-related but my first was too when i was 12, & my most recent was too.\n\ni forced myself not to throw up w the one when i was 12 bc i didn't want to lose any of the pills & i took all i could stomach.. couldn't sleep cause it was the worst pain of my life & didn't get any medical attention just went to middle school in crippling pain the next day.. then every time i drank for like a year the same pain came back, so ik it damaged my liver.\n\nthis time fucked up my kidneys so bad though. forced myself to not throw up for hours afterwards & didn't go to a hospital until a day later, but during the night/day i wasn't seen i was fading in & out of conciousness & convulsing & pissing myself & throwing up in my sleep & nearly choking. i totally had forgotten what happened too & bc of the natural release of DMT when near-death so i thought i was just tripping. by the time i went to the hospital i could barely see thru the rainbow visuals & i kept forgetting who & where i was. i couldn't feel my body then but afterwards i def felt it. \n\nkidney & liver pain hurts so much worse than broken bones, brain bleeds, a c-section sans painkillers afterwards, & any other surgery or acute injury i've had imo. def is no joke. the only pain i've had that was worse was severe GI bleeds & organs prolapsing outside of myself lol. shit sucks\n\nalso sucks cause now i cant ever take the only mood stabilizer that ever helped me cause it's hard on the kidneys\n\nlol sry 2 ramble, hope ur doin well!"
        ]
    }
}