{
    "$GME Daily Directory | New? Start Here! | Discussion, DRS Guide, DD Library, Monthly Forum, and FAQs": {
        "title": "$GME Daily Directory | New? Start Here! | Discussion, DRS Guide, DD Library, Monthly Forum, and FAQs",
        "score": 93,
        "url": "https://www.reddit.com/r/Superstonk/comments/1dr5c7u/gme_daily_directory_new_start_here_discussion_drs/",
        "content": "[GameStop.com](https://www.gamestop.com/) || Shop [Internationally](https://www.reddit.com/r/Superstonk/comments/vyyzmx/gamestop_retail_international_nft_game_informer/) || [NFT Marketplace](https://nft.gamestop.com/)\n\nGameStop [Investor Relations](https://news.gamestop.com/)\n\n**Read** [**the Rules & Wiki**](https://www.reddit.com/r/Superstonk/wiki/index) **||** [**MOASS FAQ**](https://www.reddit.com/r/Superstonk/wiki/index/faq) **|| Join our** [**Discord**](https://discord.gg/hZqWV2kQtq)\n\nHow do I [feed DRSBOT](https://www.reddit.com/r/GMEOrphans/comments/qlvour/welcome_to_gmeorphans_read_this_post/)? Get a [user flair](https://www.reddit.com/r/Superstonk/comments/yuarvq/how_to_get_a_userflair_on_superstonk_new_emojis)? Hide [post flairs and find old posts](https://www.reddit.com/r/Superstonk/comments/v0oxp2/how_to_filter_by_flair_search_for_posts_on/)?\n\n[Reddit & Superstonk Moderation FAQ](https://www.reddit.com/r/Superstonk/wiki/index/reddit-faq/)\n\nOther [GME Subreddits](https://www.reddit.com/r/Superstonk/about/wiki/index/gme_communities/)\n\n# 📚 Library of Due Diligence [GME.fyi](https://fliphtml5.com/bookcase/kosyg)\n\n>A collection of over 200 of the most important, groundbreaking **D**ue **D**iligence. If you're looking to familiarize yourself with the GME bull thesis or the underhanded tactics of the short sellers involved in this trade– then this is for you\n\n# 🟣 [Computershare Megathread](https://www.reddit.com/r/Superstonk/comments/1ch3lrh/questions_about_direct_registering_ask_here_have/) \n\n>Wondering what DRS is? Want to know how and why people are Direct Registering their shares? Here you'll find our guide and additional resources, as well as a welcoming community answering questions in the comments!\n\n# 🍌 [Monthly Open Forum](https://www.reddit.com/r/Superstonk/comments/1ciapwp/open_forum_may_2024/)\n\n>Each month, we will host a Monthly Open Forum (our monthly meta post) where you can ask questions relating to the sub, share your rants, raves, suggestions for improvement, etc.\n\n# 🔥 Join our [Discord](https://discord.com/invite/y4dK3y5DXJ) 🔥 \n\n#",
        "num_comments": 38,
        "comments": [
            "Time and pressure lads, time and pressure.",
            "Steve Cohen is still a fat bitch ",
            "Ken Griffin bite my shite",
            "were put holders able to profit off of the brk glitch at all or was that reversed? I wonder if they really are tied in here.",
            "Remember 3 years ago today when banks increased and some doubled their stock dividends?",
            "Just 600 People on ? First time seeing that",
            "I bet that american flag turns to a canadian flag",
            "Ken Griffins mommas a ho",
            "Jim Cramers wife is a crack head",
            "Can we start talking about low risk option plays now??"
        ]
    },
    "Open Forum July 2024": {
        "title": "Open Forum July 2024",
        "score": 227,
        "url": "https://www.reddit.com/r/Superstonk/comments/1dpvb1f/open_forum_july_2024/",
        "content": "**Content:**\n\n* **Monthly Forum Explanation**\n* **Some notes/reminders**\n* **Options are back (important read)**\n* **Do not call anyone \"shill\"**\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n**DRS Megathread:**\n\n[**https://www.reddit.com/r/Superstonk/comments/1ch3lrh/questions\\_about\\_direct\\_registering\\_ask\\_here\\_have/**](https://www.reddit.com/r/Superstonk/comments/1ch3lrh/questions_about_direct_registering_ask_here_have/)\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n**What’s the Open Forum?**\n\nTo share feedback, critique, and suggestions for improvement regarding the sub, rules, content etc. Although these things can always be done through [modmail](https://www.reddit.com/message/compose?to=%2Fr%2FSuperstonk), we want to ensure there is still a way to communicate what would be considered ‘meta’ in a public space.\n\nThe Open Forum is where you can ask questions relating to the sub, share your rants, raves, suggestions for improvement, etc. Please be mindful of the rules of the sub and Reddit TOS; although this is the space for ‘meta’ discussion, comments do still need to remain civil.\n\n***Meta discussion does need to be centric to this sub; comments about other subs, their users, or their mod teams will always be removed.***\n\n[Post about the restrictions placed on this sub](https://www.reddit.com/r/Superstonk/comments/1336ri9/censorship_mods_r_sus_and_brigading/)\n\nThis will only be pinned for a couple days, but the post will remain open for the duration of the month. We'll try our best to get back to everyone!\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n**Some notes/reminders**\n\n* Anytime you see a post with the ‘Community Post’ flair, that post will also be open for Superstonk meta discussion.\n* If you need immediate mod attention, you can comment !MODS! anywhere on Superstonk and we usually will get back to you pretty quickly! Once the monthly forum is no longer pinned, the mods will still be checking the post, but for anything urgent, please use that tag or you know, send a [modmail](https://www.reddit.com/message/compose?to=%2Fr%2FSuperstonk)!\n* Then there's the Superstonk Community Corp (SCC) which you can call into a discussion using !SCC! should you want their input instead of mods. These are volunteers to be members of our community advisory board, providing real-time feedback on post removals, appealing for the restoration of moderator-removed content, and providing watchdog-like feedback to the community. For those who have disagreements with the way this community has been moderated in the past, this is your chance to get involved and participate in constructive discussions about making it better. If you'd be interested in applying to be part of the SCC please type !apply! in the comments.\n* For those who still don’t know, we’ve got an official [Superstonk Discord](https://discord.gg/hZqWV2kQtq)!\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n**Options are back**\n\nSo DFV is back and he's here! But it's really put a question mark on Rule 11 and so we're addressing that by allowing some bullish option positions to be posted. This will be a 2 weeks trial where we'll see how this goes and then we'll take another look at it, so we genuinely want to hear from you all across the two weeks. We've created a post to help educate those that don't understand options:\n\n[**https://www.reddit.com/r/Superstonk/comments/1dpv5ap/so\\_you\\_want\\_to\\_learn\\_about\\_options/**](https://www.reddit.com/r/Superstonk/comments/1dpv5ap/so_you_want_to_learn_about_options/)\n\nWe're a community that's bullish on GameStop and so it doesn't make any sense for us to gatekeep anyone that is bullish. This has been a repeatedly requested feature for the sub with bullish posts being removed for no reason other than Rule 11 being gatekeepy. Options are a tool that give investors more choices than just buying and selling, but just as with buying and selling there are risks and in some cases those risks outweigh the benefits. In order to hopefully prevent anyone in this community from getting convinced into irresponsible positions we'll be moderating options posts in a specific way:\n\n*A new rule*\n\nWe're implementing \"Rule 14: Options must be Bullish, Calculated and Explained\" which will be:\n\n---\n\nNeutral/Bullish Options (e.g. Calls/CSPs) with strike, expiry date and quantity may be posted, gains/losses or the day/time of your purchase cannot. Include the reason you purchased those contracts for example:\n\n* why buy now?\n* why that strike?\n* why that expiration?\n* what's your exit plan?\n\nUneducated/unsafe \"YOLO's\" will be removed indiscriminately. Be responsible.\n\n[Learn more about options here](https://www.reddit.com/r/Superstonk/comments/1dpv5ap/so_you_want_to_learn_about_options/)\n\n---\n\nSo let's talk a little more about this rule. You'll notice that this only allows for neutral/bullish option positions to be posted as bullish is what this subreddit is all about. For most people this will be sold Puts (Cash Secured Puts) and bought calls.\n\nMore advanced strategies such as; credit/debit/calander spreads, iron condors, butterflies, jade lizards, synthetic longs, will be allowed if:\n\n1. they are neutral/bullish positions \n2. you take some time to explain how they work and the risks associated with them\n\nWe're not allowing irresponsible option positions which means no YOLOs, no FDs, no putting your money into a position you don't understand. \n\nUnlike a DRS post you can't just post your options contracts without any explanation. We need to know that you're being responsible by making an informed play. As the rule implies you need to explain why you're buying that specific contract. We're not tell you want you can and can't do with your money, but we are telling you what you can and can't post on Superstonk.\n\n*A new flair*\n\nWe're adding a flair that'll be specifically for option positions. So if you want to browse the subreddit without seeing any options you can by filtering out the flair (you can read about how to do that on the subreddit sidebar or using \"see more\" at the top of the sub on mobile). Images of option positions should be given this flair and at the moment that's it; education about options can be under the education flair as per usual.\n\n*Looking for feedback*\n\nAs mentioned before we're running this on a trial basis both for the community and for the moderation team. We’ll be making changes based on user feedback in two weeks. Please let us know in the comments if you have any thoughts or suggestions. It's okay if you don't like options but remember: \"No fucking fighting\" - DFV. No matter your feelings the positions posted here are going to be bullish and the people posting them are your allies. Rule 1 + 5 will be enforced just as strictly as they are on the rest of the subreddit. Which brings us nicely into the next section:\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n**Do not call anyone \"shill\"**\n\nIf you feel like you're having déjà vu that's because this is a copy-paste from the last open forum, but frankly a vocal minority need to hear it again:\n\nThere's been a noticeable uptick of a loud minority of users dropping the insult \"shill\" whenever someone says something that isn't the most bullish statement that's ever been posted here. We're not an echo chamber and we allow content that's questioning the company/stock/DD or whatever. You've got loads of option when it comes to seeing a post or comment you don't like:\n\n* If you don't like some content then you're welcome to downvote and move on\n* If you disagree with someone's content then you're welcome to downvote it or to engage with them in good faith to have a discussion about why you disagree and to see if there's a misunderstanding\n* If you think some content is suspicious then you're welcome to report it or comment !MODS! under it with some (non-callout: rule 5) context\n* If you believe someone is a literal shill then you're welcome to report their content, reply !MODS! and/or send us a modmail explaining your reasoning\n* If you're angry or frustrated at another user you're encouraged to disengage, block them and report any of their content that you believe breaks the rules\n\nYou get the idea, Rule 1: Be Nice. There's never an excuse to be rude or insulting. Calling someone a \"shill\" is breaking Rule 1 and frankly we've clearly been too tolerant about that, we're sorry.\n\nApe no fight Ape has always been a motto here and it's one that needs to be followed.\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nThank you to everyone that engages in good faith because it is the **vast** majority of you.\n\nI'll see you all tomorrow for MOASS after I buy the dip.",
        "num_comments": 138,
        "comments": [
            "Permission to call various people shills: Cokerat, anyone on CNBC, Shitron, Hester and SEC, anyone writing articles on shill media like Sozzi, Jeff Macke, Larry Harris....\n\nI need a T+0 ape exemption for calling these shills out in realtime.",
            "When there are mod changes, can we get a post?",
            "Cash secured Puts should have been promoted from ages ago. Back when the stock was dropping to $10 it was practically free money. Even if you had sold them when the price is higher getting assigned isn't bad at all when you want shares.",
            "I've seen some posts questioning whether the karma requirements have been relaxed. Have they? If not, how do we report users who appear to be below the requirements?",
            "This is gonna go well. Open the forum to options and see what the cut off is for mods definition of \"yolo\".",
            "I think we need to be really careful to keep the quality bar EXTREMELY high on options posts.\n\nOtherwise actual shills will push extremely OTM calls that have no gamma effect like $100 strike calls while we're at $20 and change, as we have seen the last few weeks.",
            "I'm glad that we're finally talking about options. This topic has been a blind area for too long.",
            "I welcome rule 14, it seems like a good compromise. The details can probably be refined over time, based on how things unfold, but if nothing else it should get rid of the obnoxious type of options posts, like the obvious fellow-kids ones that try to bait everyone into specific options.\n\nThis is a GameStop stock subreddit, ideally the discussion on the stock would revolve more around its fundamentals and not trying to reverse-engineer market trends to time it (IMO that's a fool's errand because the price has been constantly fake for the past few years), but I agree that it cannot be shut down completely without making the mod team seem gatekeepy.",
            "ape no fight ape is very good. people can not like rc and still like the stock.",
            "I've been reading a lot. Once I turned the book right-side up, I placed a $23C for August 16 . I feel good, but if it tanks, it is my fault..."
        ]
    },
    "FLAG MICROPHONE CODE CRACKED": {
        "title": "FLAG MICROPHONE CODE CRACKED",
        "score": 2281,
        "url": "https://i.redd.it/nlpywr27mf9d1.jpeg",
        "content": "\nEMOJIS MONOCHROME UNTIL MICROPHONE FLAG ON DANCING KID\n\nWHO THIS KID? ALYSON STONER -  DISNEY’S “MIKE’S SUPER SHORT SHOW”\n\nMIKE’S SUPER SHORT SHOW = MIC IS SUPER SHORT SHOW\n\nMIC EMOJI = SINGING\n\nSONG SINGER? MISSY ELLIOT\n\nHER BIRTHDAY? JULY 1\n\nFLAG = JULY 4\n\nEMOJI =  SUPER SHORTERS WILL BE SHOWN 👀 ON JULY 1-4 (but no dates)\n\nTRUE OR I WIPE MY ASS WITH TOILET PAPER\n\nCHECKMATE  ATHEISTS",
        "num_comments": 227,
        "comments": [
            "It turns to color when the kid Kansas city shuffles.",
            "This is the closest thing to watching Lost in real time as it gets kids, fucking sick post OP!",
            "the fact that this is even possible, includes super short+741+emojis+meme tweet  unfuckin real. I love this stock so much, most fun Ive ever had",
            "Thats it Im buying more",
            "I need to smoke crack more.",
            "Isnt july 5 T+35 days since CAT system was implicated?",
            "is black and white because markets are closed july 4th",
            "Motherfucker, you've got a beautiful brain son.",
            "For the sake of this man's asshole, let him be right!",
            "Interesting. Im not sure about it pointing to missy elliots birthday but I'll add that the dog could be \"dog days of summer\", commonly july 3rd to august 11"
        ]
    },
    "Whilst at the euros in Germany I came across this beautiful store": {
        "title": "Whilst at the euros in Germany I came across this beautiful store",
        "score": 662,
        "url": "https://i.redd.it/z3pb1gyfgh9d1.jpeg",
        "content": "My first ever store...Long time stock holder. DRS'd",
        "num_comments": 34,
        "comments": [
            "Lots of stores in Germany!",
            "I love this company what else can I say",
            "must be the most exiting thing for an english fan that attends the euros",
            "Nice, Ape! Have fun at the Euro in Germany :)",
            "Tell southgate to bench Kane already!! ",
            "I also take a photo of every gamestop i come across!! This should be a trend!!! Share a photo every time you see a gamestop!",
            "Thats right fren,stonks go up!  Nice find!",
            "I found one in Cologne but dont take a picture :(",
            "awesome. are they profitable ?",
            "Sorry, that's like posing in front of a starbucks and saying you have found coffee in europe."
        ]
    },
    "Called Out Bloomberg Authors On LinkedIn For Their Bullshit Roaring Kitty & GameStop Article Published Today": {
        "title": "Called Out Bloomberg Authors On LinkedIn For Their Bullshit Roaring Kitty & GameStop Article Published Today",
        "score": 2694,
        "url": "https://v.redd.it/je8c698r6f9d1",
        "content": "",
        "num_comments": 89,
        "comments": [
            "I love how you called them out on their bs. Its blatantly obvious what is going on and Im proud to be a part of the movement for change. Long GME. Buy. Hold. Repeat. Week after week my paycheck goes into my GameStop savings account.",
            "Good call out, well worded.",
            "That was well put, you kept to the facts, presented an argument and didn't fall into the trap of just shouting manipulation which we sometimes see around here",
            "This needs to go to the top. Everything said right here, is the real news and needs to be spread for everyone to see.",
            "Nice work. It's Flash Boys the next generation. Algos are set up to respond instantaneously to information to front run all human interaction, whether it be quarterly reports, formal filings, or stupid ass joke memes. The idea that actual people are making moves that fast is insanity.",
            "#If you continue facing enemies your going the right direction ",
            "I hope you post this to every forum, social media site, and send to EVERY news organization that has posted the trash",
            "Wait a second, back to the internal white coloring of trades. Hasnt there been tweets specifically using black and white colored emojis?",
            "Getting paid Monday. I know what I'm doing with a piece of that check. ",
            "Good job. All good data, no emotion. That was perfect!"
        ]
    }
}