{
    "This week in SUPER Comics Discussion [Jun 24, 2024] - What other Super-Family members should have their own animated series?": {
        "title": "This week in SUPER Comics Discussion [Jun 24, 2024] - What other Super-Family members should have their own animated series?",
        "score": 3,
        "url": "https://www.reddit.com/r/superman/comments/1dngqxi/this_week_in_super_comics_discussion_jun_24_2024/",
        "content": "**Welcome to The (Not So) Daily Planet!**\n\nComment below with a discussion on the releases this week or the question of the week. Try to reply to others instead of starting new threads on the same topic. Keep the conversations civil and have fun!\n\n[Keeping r/Superman open and welcoming for all](https://www.reddit.com/r/superman/comments/qbop89/keeping_rsuperman_open_and_welcoming_for_all/)\n\n# Question of the Week\n\n**What other Super-Family members should have their own animated series?**\n\n([Join our Discord to discuss further!](https://discord.gg/GyKuh4Q))\n\nFeel free to suggest future weekly questions!\n\n# Comic Singles\n\n[*Action Comics* #1066](https://m.media-amazon.com/images/I/81RteNKz8HL.jpg)\n>THE BRAINIAC QUEEN UNLEASHES COSMIC HORROR! THE BRAINIAC QUEEN IS ALIVE! Now that Brainiac has created his masterpiece, all bets are off, and Superman and his family are witness to a cosmic horror unlike anything they've ever seen. As we learn the true history of Brainiac, the main man, Lobo, must choose what side he is on before all hell breaks loose!\n\n[Preview](https://aiptcomics.com/2024/06/21/dc-preview-action-comics-1066/)\n\n[*Superman* #15](https://m.media-amazon.com/images/I/91r-Nc0yaAL.jpg)\n>FALL OF THE HOUSE OF BRAINIAC! Superman and Lex have figured out how to stop Brainiac and his Queen, but it will take a great sacrifice. Can they do the unthinkable to save their family and friends? This all leads directly into DC's summer event… ABSOLUTE POWER!\n\n[Preview](https://aiptcomics.com/2024/06/21/dc-preview-superman-15/)\n\n[*Absolute Power: Ground Zero* #1](https://m.media-amazon.com/images/I/91WGxSfFq-L.jpg)\n>WITNESS THE TRINITY OF EVIL'S RISE TO POWER IN THE CAN'T-MISS PRELUDE TO DC'S SUMMER BLOCKBUSTER! THE DOMINOS FALL! As the DC Universe braces for the \"Absolute Power\" blitzkrieg, the key to capturing metahuman powers on planet Earth will at last be unlocked! Bridging the events of Batman, Superman: House of Brainiac, and Suicide Squad: Dream Team, this special oversize GROUND ZERO issue brings Waller's total dominance to the doorsteps of the world's finest heroes… using the combined might of FAILSAFE, BRAINIAC QUEEN, and the SUICIDE SQUAD to do it! Witness years of storytelling culminate, brought to you by Absolute Power series architect MARK WAID and the masterminds behind the trinity of evil, CHIP ZDARSKY, NICOLE MAINES, and JOSHUA WILLIAMSON!\n\n[Preview](https://aiptcomics.com/2024/06/21/dc-preview-absolute-power-ground-zero-1/)\n\n[*Power Girl* #10](https://m.media-amazon.com/images/I/91FFQhbF5LL.jpg)\n>Break out! Power Girl joins the Holliday Girls in this action-packed \"House of Brainiac\" tie-in! Goblin and his goons may have the neighborhood, but they’ll never break the spirit of our local hero and her new allies. With the biker gangs brawling, it’s now up to Crush and Paige to shut the Czarnians down for good. Can the power of brains, brawn, and beauty prevail?\n\n[Preview](https://aiptcomics.com/2024/06/21/dc-preview-power-girl-10/)\n\n# Trades\n\n[*Absolute Final Crisis* [**HC**]](https://m.media-amazon.com/images/I/71f02-wlwhL.jpg)\n>The mind-blowing event from 2008 is collected in this spectacular new hardcover collecting FINAL CRISIS #1-7, FINAL CRISIS: SUBMIT #1, FINAL CRISIS: SUPERMAN BEYOND #1-2 and the FINAL CRISIS SKETCHBOOK, plus the newly added FINAL CRISIS #1 DIRECTOR'S CUT and BATMAN #682-683, all written by Grant Morrison, now with SEVEN NEW STORY PAGES BY MORRISON AND MAHNKE! What happens when evil wins? That's the devastating question Superman, Batman, the Justice League and every other super being in the DC Universe must face when Darkseid and his otherworldly legion of followers actually win the war between light and dark. This oversized, slipcased hardcover comes with its own pair of 3-D glasses!\n\n[*Absolute Superman by Geoff Johns & Gary Frank* [**HC**]](https://m.media-amazon.com/images/I/81VDHHX2ohL.jpg)\n>Experience Geoff Johns and Gary Frank’s legendary Superman trilogy like never before!\n\n>Experience Geoff Johns and Gary Frank’s legendary Superman trilogy like never before. Presented in DC’s prestigious, oversized hardcover format, the Absolute Edition collects the complete Superman and the Legion of Super-Heroes, Superman: Brainiac, and Superman: Secret Origin, together for the first time!\n\n>Featuring Action Comics #858-863, #866-870, Superman: Secret Origin #1-6, and stories from Action Comics Annual #10, Superman: New Krypton Special #1, and Action Comics #900, along with character designs by Gary Frank, the Action Comics #858 script by Geoff Johns, an extensive cover gallery, and more!\n\n[*Lobo Big Fraggin Compendium Book One* [**TP**]](https://m.media-amazon.com/images/I/913lfe0BdPL.jpg)\n>Everyone’s favorite bastich gets his own series of fraggin’ compendiums that are just as big and bombastic as the Main Man himself!\n\n>Collects Lobo (miniseries) #1-4, Lobo #0-9, Lobo Annual #1-2, Lobo Paramilitary Christmas Special #1, Lobo’s Back #1-4, Lobo: Blazing Chain of Love #1, Lobo: Infanticide #1-4, Lobo: Portrait of a Victim #1, Lobo: Unamerican Gladiators #1-4, Lobo Convention Special #1, Lobo: A Contract on Gawd #1-4, Lobo: In the Chair #1, Green Lantern Corps Quarterly #8, Superman: The Man of Steel #30, The Demon #11-15, The Omega Men #3, profile pages from Who’s Who #8, and the Lobocop #1 parody!\n\n# TV\n\n[**Saturday, 6/29:** ***My Adventures with Superman*** **S02E07** - *Olsen's Eleven*](https://static.tvmaze.com/uploads/images/original_untouched/517/1292950.jpg)\n\n\nTime/Date: June 29 12:00 AM ET\n\nNetwork/Channel: Adult Swim",
        "num_comments": 1,
        "comments": [
            "Superboy conner kent"
        ]
    },
    "My Adventures With Superman S2E6 \"The Machine Who Would Be Empire\" Episode Discussion": {
        "title": "My Adventures With Superman S2E6 \"The Machine Who Would Be Empire\" Episode Discussion",
        "score": 106,
        "url": "https://www.reddit.com/r/superman/comments/1dmdagd/my_adventures_with_superman_s2e6_the_machine_who/",
        "content": "[The Machine Who Would Be Empire](https://m.media-amazon.com/images/M/MV5BMzk0NGI1M2UtNGJmYS00MzZlLWExMDQtNDlkMzk4ZjdiY2E4XkEyXkFqcGdeQXVyMzQ0MzA0NTM@._V1_FMjpg_UX1000_.jpg)\n\nr/SupermanAdventures | [Discord](https://discord.gg/GyKuh4Q)\n\nPlease keep all discussions civil and about the episodes. Mark comic and future spoilers. Report any rule-breaking and enjoy!",
        "num_comments": 80,
        "comments": [
            "Brainiac's VA is amazing in this.",
            "I love how Clark and Kara act like siblings despite the fact Kara kidnapped Clark",
            "\"I will not crush Jimmy Flamebird!\" I don't think he'd complain.",
            "This episode got dark! Braniac is quite the cold hearted villain.",
            "Wow brainiac is just straight up evil and is not hiding the fact he enjoying it he just jumped straight to Mind Control for Clark instead of Gaslighting like he did for Kara I think he might have had grudge against Jor-el because he was giddy watching Clark getting kicked around.",
            "Was that Green Lantern from the comics? Thats a sick ass design, I hope we learn more about that guy. (Probably not, but let me dream )\n\nLoved this episode though. Having Clark and Kara interact as family was funny and heartwarming, which made the ending of this episode with Kara finally realizing what she did more powerful. Cant wait to see how Jimmy and Lois got into space with the goats.",
            "Okay the nice Green Lantern easter egg in the combat simulation, alongside the reference to Thanagar, and the stuff with Lois being offered the job in Gotham and Silver St. Cloud makes me think they're building up a sort of animated Universe with this stuff, similar to the DCAU. Which, honestly? I'm all here for, Animation has always been the best format for comic adaptations, so it's nice to have one for modern audiences. At the very least it would be somewhat similar to the other shows where characters would appear for specials and whatnot.",
            "Man, I cannot wait to see what the next episodes have in store for us. But Green Lantern easter egg and a parademon great world building stuff. I mean Gotham City and Vicki Vale mentioned, my guess they will eventually have Batman in it, and potentially more DC stuff.",
            "Honestly tho Kara as an antagonist was cool Im glad shes not taking too long to come to her senses and its also cool to see her and Clark actually connecting as cousins",
            "Before I get into the episode proper: Holy shit, that's the most metal title I've seen in a while!\n\nEdit: Was that a parademon?! I'm sorry, are they implying Krypton conquered *Apokolips*?!"
        ]
    },
    "The permanent damage edgy superhero media has done to peoples brains where they’re unable to comprehend the concept of someone being a nice person": {
        "title": "The permanent damage edgy superhero media has done to peoples brains where they’re unable to comprehend the concept of someone being a nice person",
        "score": 575,
        "url": "https://www.reddit.com/gallery/1dr7ugk",
        "content": "",
        "num_comments": 158,
        "comments": [
            "I love The Boys but some people keep taking that show as gospel.",
            "You know how every single adult goes around and punches babies in the face because they are stronger than them?\n\nNo? Doesn't happen? Huh, I wonder what that could mean....",
            "The similar powersets, costumes and themes are the obvious reasons why Homelander and Superman are constantly compared, but are these people forgetting Starlight exists in the same show? A country girl who grew up with loving parents who believes in the traditional superhero, and rose to the ranks of the Seven because of her image as the kind and friendly hero? Her personality more resembles Superman and she is a person that exists in The Boys.",
            "Hancock is a more realistic depiction of modern Superman than Homelander tbh",
            "a guy who was raised by loving parents on a farm VS a guy who was raised in a lab",
            "How do they miss the fact Homelander was raised horribly from birth before saying that's obviously exactly how an irl superman would be...",
            "I dont think it has anything to do with edgy super hero stories at all.  I think its more about peoples perception of the real world rather than other fiction.\n\nWe see humans abuse power imbalances every day in virtually every way imaginable.",
            "Lex Luthor is one of the most realistic characters ever because theres way too many people in real life who are so unable to imagine a guy like Superman who is just a genuine nice guy and imagine anyone in his position would be a nutjob with a god complex (theyre projecting)",
            "Homelander and Superman were raised completely differently. Homelander was raised in a lab by uncaring scientists and was brainwashed into being the ultimate product. Superman was raised by two loving parents in a small farm town in Kansas. He was instilled with the values of doing what is right rather than what is easy. But most importantly the difference between the two is how people react to them in universe, Homelander is treated like another rich pompous celebrity who is only in it for himself, While in universe Superman is down to Earth people look up to him not because of his movies or media tie ins but what he represents and who he is as a person",
            "Homelander is not a realistic depiction of someone with supermans powers, nor was he ever meant to be. Maeve, Deep, A-Train, sure, theyre mostly meant to be just regular celebs with superpowers. \n\nHomelander was bred in a laboratory as a dissociative sociopath. Saying hes a realistic depiction is like saying Ted Bundy is a realistic depiction of normal people."
        ]
    },
    "I like Jesse Eisenberg as an actor but his portrayal of Lex Luther was horrible What the heck was Zack Snyder thinking he butchered Lex Luthor ": {
        "title": "I like Jesse Eisenberg as an actor but his portrayal of Lex Luther was horrible What the heck was Zack Snyder thinking he butchered Lex Luthor ",
        "score": 96,
        "url": "https://www.reddit.com/gallery/1dr7iwf",
        "content": "People can say what they want about Kevin Spacey, but his portrayal of Lex Luther was excellent nearly identical to the comics ",
        "num_comments": 80,
        "comments": [
            "Reinventing Luther as a tech genius type was a good idea, but they got the wrong one. It should have been Musk, not Zuckerberg.",
            "With the exception of the piss jar and jolly rancher scene,he really does things resembling normal Lex but Eisenberg essentially turned him into Schumacher villain who makes Micky Mouse noises.\n\nSpacey was good when allowed to be Post-Crisis Lex but was 99% of the time forced to be an imitation of Hackman.",
            "He's a great interpretation of lex luthor on crack",
            "Snyder was thinking \"New 52\", similar to his decision to make Superman's outfit look like space armor.",
            "He's everything Lex isn't supposed to be.",
            "I just hope all new versions of Lex have a scene where they slowly push a Jolly Rancher into another persons mouth.",
            "Eisenberg was playing this Manic Pixie Boy who I couldn't for a minute buy that he was one of the smartest people on the planet.\n\nKevin Spacey may have been one of the best casting choices in *Superman Returns* but we run into another major problem with that movie, and that would be the fact that his plan is terrible. Even dumber than dropping California into the ocean and hoping no one notices.",
            "Elisenburg was hot after his performance in the social network, so I think he was over indulged in his choices of character interpretation. Also Zack Snyder  is a director more concerned with visual spectacle more than in-depth exploration of motivation or character arcs out of his performers",
            "He should've of been the Riddler instead",
            "He was trying to Jokerize it, because Snyder really thinks Joker is a cool villain and doesn't really get Lex? The post JL tease with him was closer to the \"right\" version of this actor-role combo but in BvS the character was Lex in name only."
        ]
    },
    "[Artwork] Kara does a romantic gesture for Jimmy in MAWS by Jourd4n": {
        "title": "[Artwork] Kara does a romantic gesture for Jimmy in MAWS by Jourd4n",
        "score": 40,
        "url": "https://i.redd.it/vse8ns3mki9d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Jimmy the Rizz, its so good even the alien wants it",
            "This is so cute!",
            "Cute. Destructive, but cute",
            "Source link\n\n[https://twitter.com/Jourd4n\\_/status/1806529505231802530](https://twitter.com/Jourd4n_/status/1806529505231802530)",
            "**Does This Post Reveal Spoilers?**\n\nSpoilers include unreleased content (rumors, leaks, set photos, etc.) and new content (under a month old). Titles should never have twists, surprises, or endings.\n\n* u/CapAccomplished8072, is there a spoiler in the title? Delete and repost, indicating what it spoils (name of show, movie, etc.). Spoiler in the post? Mark it.\n* Commenters, don't spoil outside the scope of the post, hide the text with spoiler code. [(Formatting Help)](https://support.reddithelp.com/hc/en-us/articles/360043033952-Formatting-Guide)\n\n*Spoiling may result in a ban, depending on the severity. Please report if it happens.*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/superman) if you have any questions or concerns.*"
        ]
    }
}