{
    "So is that the reason there are so many AFK's lately? Vanguard DIFF": {
        "title": "So is that the reason there are so many AFK's lately? Vanguard DIFF",
        "score": 214,
        "url": "https://i.redd.it/5tvqk46mub7d1.png",
        "content": "",
        "num_comments": 54,
        "comments": [
            "Note: I was playing normally, we were doing well, until two players (mid, adc) disconnected, and continued connecting and disconnecting for the rest of the game, until in the last 5 minutes of the game I was disconnected and received this message as if Vanguard had stopped to work, since this shit was on. Now my client decided to randomly close by itself, flagging an error in Vanguard that I have no idea what it is, I really don't know what to do, now I'm afraid of it randomly closing during the game and I'll be punished like the players in my game departure, maybe it's time to abandon this once and for all",
            "I was just playing an Aram with friends and 2 people from the enemy team disconnected not 3 minutes later my friends are gone aswell.\n\nLet say I played the „we have 3v3 at home“.",
            "Had that also yesterday. I was flamed because they thought i was afking. And was punished with low prio queue. Sorry i was trying my best.",
            "Same happens to me since yesterday. 2 games got disconnected. Today another 2 all in ranked. Fun thing is last game literally everyone got disconnected :D one by one from both teams untill only 2 of us were still hanging then vanguard disconnected me as well... It seems in arena theres no problem at least from my experience.",
            "Vanguard is kinda down. Out jungler disconnected, we managed to win somehow and then it crashed for me.",
            "Error van 84 for me haha",
            "Ever since vanguard, my alt key stopped working whenever I played DOTA... Then over time it just stopped working in general, after I uninstalled DOTA.",
            "Has anyone's fps just drop down to 10 sometimes I have a good pc I play on 120 stable its just in the middle of a game usually 25 to 30 min in it almost crashes 1 to 2 min later it's fixed  like nothing happened",
            "Happened to me this morning all 10 of us in the match got that",
            "Though I still follow different subs, I stopped playing league. Too much bs for too long now. I'm sure there are still people who care about the game at the company but it honestly feels like things aren't gonna get better."
        ]
    },
    "To celebrate Milio's new skin, r/MilioMains are hosting a GIVEAWAY on our Discord Server and the winner will receive Rain Shepherd Milio 🐸 (check the pinned comment for more information)": {
        "title": "To celebrate Milio's new skin, r/MilioMains are hosting a GIVEAWAY on our Discord Server and the winner will receive Rain Shepherd Milio 🐸 (check the pinned comment for more information)",
        "score": 38,
        "url": "https://i.redd.it/wrg30psgny8d1.png",
        "content": "",
        "num_comments": 24,
        "comments": [
            "Theres also alot of other giveways going",
            " Good luck to everyone participating 💚",
            "Come for the giveaway, stay for the cozy community and the fun events we have planned!",
            "Yes and it won’t be the last! 😊",
            "NA, EUW, EUNE, BR, SG",
            "That part. It’s a family 🫂",
            "Ohh im saying it in the good way, frogs are cute",
            "Oh I’m sorry I didn’t understand you the first time than you for clarifying 😅🙈",
            "Oh I’m sorry we didn’t have an account there 😭",
            "There will be a Reddit giveaway for this skin too. That will be available for all regions!"
        ]
    },
    "Who do you want?": {
        "title": "Who do you want?",
        "score": 5,
        "url": "https://i.redd.it/7jiyowq98j9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "if it’s not a draven player i don’t want it",
            "Ezreal is so out of place here. Idk what Elo this is supposed to be but Ezreal is a super aggressive champ, not an afk farmer.",
            "Definitely something I hate about support. We are the only ones who get so fucking hard flamed for our picks. You don't see me locking in an enchanter and freaking out because my ADC picks Samira when it's not ideal synergy.\n\nBut God forbid I wanna play my main in a normal draft game."
        ]
    },
    "I seem to be losing games because of my irresponsible playing ": {
        "title": "I seem to be losing games because of my irresponsible playing ",
        "score": 2,
        "url": "https://www.reddit.com/r/supportlol/comments/1drb9rr/i_seem_to_be_losing_games_because_of_my/",
        "content": "so yes, I play support since season 3/4 something like this and rather prefer to play quite aggressively, and frankly speaking being such a kda player is a very big challenge for me. Generally playing through the game I have about 5-10 deds, but this is also caused by me sacrificing myself so to speak so that they kill me and the team does its job, but also by my stupid play like destroying a pin knowing that the enemy bot is not far away, etc. Do you have any advice for me ? i currently have p3 and sometimes i think about changing the role \n\n\n\n[https://www.leagueofgraphs.com/pl/summoner/euw/kapuczino-2115#championsData-all-queues](https://www.leagueofgraphs.com/pl/summoner/euw/kapuczino-2115#championsData-all-queues)",
        "num_comments": 4,
        "comments": [
            "Look at how you die and just gradually stop doing that. Not every death is worth it, but sometimes it's fine to die for your carries.\n\nAlso, you have way too many champions played, stick to 1-2 champs and improve on them. Your winrates are generally really good tho, so you shouldn't worry.",
            "I’d say changing role really helps, especially adc if you could, to know how far the champions could go and when to start a fight.",
            "better to play with pocket picks, trust me if ever you're tilted to your gameplay just play the champion who you're most comfortable with and who doesn't tilt you because you find their kit very enjoyable\n\nit's important to at least have three pocket picks, better make sure you have for engage as well enchanters. try to watch proplays as well if ever you dont know what to do throught early game laning phase and late game teamfights, lol is all about objs\n\nif ever you're tired to your main role you can swap to any roles you want to practice with and it's a blank canvas. it's all about exploration"
        ]
    },
    "How bad is it really to steal your ADC's CS as support?": {
        "title": "How bad is it really to steal your ADC's CS as support?",
        "score": 0,
        "url": "https://www.reddit.com/r/supportlol/comments/1dre9uy/how_bad_is_it_really_to_steal_your_adcs_cs_as/",
        "content": "Not even trolling, it's actually a serious question. I mean, in some cases wouldn't it be better to spread the wealth around?",
        "num_comments": 3,
        "comments": [
            "If you both get 500 gold, you can each buy a single basic Item. If one guy gets 1000 gold they can buy a much more useful epic Item.\n\nThe idea is that the adc (who scales hard with items) will take as much gold as possible, to reach their items as soon as possible, so they can end the game as soon as possible. Taking their CS slows them down, thus putting your team behind.",
            "No, not unless your adc trolls and goes 0/10\n\nYour champions work on support budget, while adc needs a lot of money to come unline. So, by stealing, you actively try to lose",
            "It’s terrible.\n\nChamps played as support are designed to be impactful with lower gold income. ADCs are the opposite; they are designed to scale directly with their income, peaking at different points in the game depending on the champ, but all wanting to get to whatever that peak is as quickly as possible.\n\nYou obviously don’t let minions die for free if your ADC is walking back to lane and they are under tower, but you should always prefer your lane partner to receive gold over you whenever it’s possible."
        ]
    }
}