{
    "How to unlock new experiences on your Copilot+ PC": {
        "title": "How to unlock new experiences on your Copilot+ PC",
        "score": 3,
        "url": "https://www.reddit.com/r/Surface/comments/1djq7bh/how_to_unlock_new_experiences_on_your_copilot_pc/",
        "content": "[The new Surface Pro and Surface Laptop](https://preview.redd.it/2jkul0jhlk7d1.png?width=1590&format=png&auto=webp&s=3098aef08b13f2382e0400176be0fa954c0d4633)\n\nLearn how to use the new experiences on your Copilot+ PC with this [article from Microsoft](https://blogs.windows.com/windowsexperience/2024/06/18/how-to-unlock-new-experiences-on-your-copilot-pc/).\n\nThe above-described experiences are available to all Copilot+ PC devices, not just the new Surface devices.\n\nAdditional AI-powered experiences can be enabled by subscribing to the [Copilot Pro plan](https://www.microsoft.com/en-us/store/b/copilotpro). Since Copilot Pro relies on the cloud, it can be used across different devices and platforms and is not limited to Copilot+ PCs.\n\nOf course because this is a launch week, there are a lot of threads, questions, and answers. We're noticing that most of the questions being asked are already answered or being actively discussed so **please use the search function**.\n\nImportant to note:\n\n* Recall is not available at this time. There is no date or ETA.\n* Due to the delay of Recall, review units were not sent out to press prior to launch, therefore official reviews will be delayed/incomplete.\n* As is always a good practice, you should update your device using Windows Update and update all apps available through the Microsoft Store for the best experience. You need to update your new Copilot+ PCs in order to enable most of the AI features.\n\nOther useful articles:\n\n* [Windows ARM-based PCs FAQ](https://support.microsoft.com/en-us/windows/windows-arm-based-pcs-faq-477f51df-2e3b-f68f-31b0-06f5e4f8ebb5#ID0EFD=Windows_11)\n* [Top things to know about Copilot+ PCs from Microsoft Surface](https://blogs.windows.com/devices/2024/06/18/top-things-to-know-about-copilot-pcs-from-microsoft-surface-available-today-at-microsoft-com/)\n* [Update on the Recall preview feature for Copilot+ PCs](https://blogs.windows.com/windowsexperience/2024/06/07/update-on-the-recall-preview-feature-for-copilot-pcs/)\n* [A Step Forward for Gaming on Arm Devices](https://devblogs.microsoft.com/directx/step-forward-for-gaming-on-arm-devices-2024/)\n* [Microsoft Surface for Business](https://surface.com/business)",
        "num_comments": 25,
        "comments": [
            "Is the AI talks you through Minecraft feature they demonstrated at the reveal locked behind Copilot pro? I cant seem to get it into a mode where the AI is aware of my screen (other than uploading a screenshot manually).",
            "It would be cool if they had a chat not llm I could run locally on my device!",
            "So when is Recall coming out officially?  Because all the reviews are positive, but vary alot. Hoping for the bigger reviewers to come out.",
            "If paint, it says it will generate while I draw for cocreator.  But it doesnt do anything when I draw.  Any ideas?",
            "Honestly I have yet to see ANY feature that I'm willing to pay $20/month for. Heck the image stuff I get in my $11 Adobe Photoshop subscription. Why would I pay MS to ALSO have that feature. Nearly everything else that would be useful to me is also available in the free Copilot.",
            "This was one of my biggest disappointments with the new surface. Copilot worked in minecraft because MS build a version of minecraft with copilot built in. There is no way (yet) to make copilot+ aware of your screen, so no using AI to improve desktop workflows :/",
            "The feature was demo'd as simply \"coming soon\". There was no official announcement of when or how it will be enabled. Otherwise, I'm sure it'd be listed on the linked article.",
            "I don't see any promos there",
            "This is the comment/question/answer I've been searching the web for. Thank you.",
            "I'm pretty sure the feature will use GPT-4 vision on any active window. If you look at the icon they pressed to activate this feature in the Copilot App, it seemed like so at least."
        ]
    },
    "Surface Pro Plus/LCD vs Elite/OLED - testing together, short review, battery use playing video": {
        "title": "Surface Pro Plus/LCD vs Elite/OLED - testing together, short review, battery use playing video",
        "score": 14,
        "url": "https://www.reddit.com/r/Surface/comments/1drc2f5/surface_pro_pluslcd_vs_eliteoled_testing_together/",
        "content": "I'm testing Surface Pro 11 - Plus/LCD (16GB, 256GB) and Elite/OLED (16GB, 512GB) against each other - to decide which one to keep.\n\n(that will be my 5th Surface Pro device - I like them)\n\nBoth charged to 100%, recommended power mode, disabled automatic brightness control, screen always on, screen 120hz/dynamic, windows update done, apps from store updates done\n\n\n**battery use** - playing video - brightness set to 35% (good for use when it's darker), unplugged at the same time, Big  Buck Bunny H.264 1080p60, in default Media Player - playing in loop\n\nafter 12h 44m:\n\nPlus/LCD: 26% battery left\n\nElite/OLED: 29% battery left\n\n**screen quality**\n\nLCD: as expected\n\nOLED: this is complicated...\n\ngrain is visible on any lighter color solid space - especially white one\n\nlooking at news websites now - and in some places, if there is a color photo next to white background next to vertical scroll bar, there is a little of extra noise visible on white. it changes when scrolling - sometimes not visible, sometimes slightly visible - it's there when you look for it. But I don't think I will notice it without looking for it. I've tried to make a photo but because of moiré it's useless\n\nbut when playing videos the colors, contrast, blacks and HDR are much better on OLED \n\n**performance**\n\nin best performance mode, Geekbench 6\n\nPlus/LCD: CPU 2445/13147, GPU 19856\n\nElite/OLED: CPU 2833/14348, GPU 19717\n\nin recommended performance mode, Geekbench 6\n\nPlus/LCD: CPU 2309/12045, 19073 GPU \n\nElite/OLED: CPU 2373/13122, 18983 GPU \n\n\n\n**strange performance/application issue** standard Media Player on Elite/OLED machine when pausing/resuming/resizing video (especially on 4k hdr hevc) stutters/pauses for longer time (like 0.5 - 1 second) than on Plus/LCD machine. After that video play smoothly. Same video file, both machines fully updated, restarted, I don't understand it.\n\n**noise** - under 100% load you have to put your ear next to the device to hear that it's even running\n\n**Windows on ARM** - I'm surprised that even my electronic signature (dedicated software + USB reader + smartcard) works just fine. But VLC arm64 is still unstable and crashes sometimes. And many of VPN clients do not work\n\n**conclusion** - looks like for my needs Windows on arm is finally ready - so I'll keep one of them. Still have to decide which one - currently I prefer the OLED one because movies look better and I don't really care about the grain. The plan is to use OLED one for next few days to confirm that",
        "num_comments": 7,
        "comments": [
            "Thanks for the review! Keep us updated! I saw both models next to each other this morning and the OLED \"default \" didn't bother me at all.",
            "Nice. You got an automatic upvote because you actually mention what settings you used! :)",
            "I ended up returning my elite for the base plus. The performance between the 2 is pretty minimal and I already had a 1tb ssd laying around.\nI would have liked the black or sapphire color, but figured I'd just get a dbrand skin to spice up my device.",
            "amazon has a 256gb 16gb oled elite in black (amazon exclusive)",
            "Nice, I didn't know that. That's a good option for those who are wanting to do an ssd swap on the elite models.",
            "i tweaked my oled color profile : [SP11 OLED - Color Calibrate vs default : r/Surface (reddit.com)](https://www.reddit.com/r/Surface/comments/1dm7soq/sp11_oled_color_calibrate_vs_default/)"
        ]
    },
    "which games are you successfully playing on the Snapdragon laptops ?": {
        "title": "which games are you successfully playing on the Snapdragon laptops ?",
        "score": 8,
        "url": "https://www.reddit.com/r/Surface/comments/1drarhk/which_games_are_you_successfully_playing_on_the/",
        "content": "hi folks,\n\nwhich games are you successfully able to play (decent playable framerate. no crashes) ?\n\nnot looking for benchmarks...just playability. ",
        "num_comments": 29,
        "comments": [
            "Minecraft Bedrock works for straight from Microsoft store. I don't play Java and have no care for mods.\n\nAll of my friends and family that I truly care about are only playing on Bedrock.",
            "I'm curious about this one too, especially about minecraft Java edition",
            "Can some folks shed light on whether egpu works on these devices ?",
            "Id love to know if games like anno 1800 or stellaris or CK3 work",
            "Rocket League can get around 110 fps on low settings and max resolution.... but only on windowed mode. Fullscreen takes it down to 70-80 fps, and borderless windowed seems kinda glitchy..",
            "Any idea about older rts games ? Command & Conquer series, warhammer etc ? I m on the fence to upgrade from a surface pro 2 to have a better screen for them",
            "Two Point Campus. Runs well with smaller universities. Starts to struggle the larger you grow.",
            "Warcraft runs good enough to do my mop remix dailies.",
            "I tried genshin and honkai star rail, both work really well but genshin tends to crash in fontaine and fontaine only. Minecraft bedrock from the microsoft store also works really well. I also tried scarlet nexus, and it runs fairly well at lower graphics, but starts to struggle at medium to higher graphics.",
            "Many many hours of heavily modded Stardew Valley so far."
        ]
    },
    "Snapdragon X Elite vs. Apple M3 Pro Battery Test! (Robotic )tested for 2 days approx ": {
        "title": "Snapdragon X Elite vs. Apple M3 Pro Battery Test! (Robotic )tested for 2 days approx ",
        "score": 25,
        "url": "https://youtu.be/R1TxnZzs4kI?si=GcX2_OB9O-jx8URD",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Great video. Thank you for posting.",
            "Pretty impressive considering the much smaller battery.",
            "Thank you for posting the results! Can't view video at work, but I will like the video since you did this.",
            "Tldr \n\nRobotic arm testing both devices based on real life usage (not 100 % tho ) \n\nHe calibrated brightness,sound level to same level \n\nSurface laptop x elite 54wh vs apple m3 pro 70wh \n\n1st test : browsing for 2 hours \n\nSurface lost 26 percent \n\nMacbook lost 16 percent \n\n2nd test : productivity apps (excel,word ) with spotify running in background for 2 hours \n\nSurface lost 21 percent \n\nM3 pro lost 25 percent \n\n(Wink ,wink )\n\n3rd test : webcam for 30 min \n\nBoth drop 6 percent (but Surface has less battery  remember )\n\n4th test :stand by for 16 hours \n\nSurface lost 4 percent \n\nM3 pro lost 2 percent \n\n5th test :video streaming for 2 hours \n\nSurface  lost 16 percent \n\nM3 pro lost 18 percent \n\n6th test : gaming \n\nM3 pro sustains around 60fps while Surface around 30fps\n\n\nM3 pro dies while Surface continues the test \n\nX elite is not for gaming as we all know unlike pathetic youtubers \n\nIt's impressive that Surface beats m3 pro with much lower battery\n\nImp point :all apps tested are native arm apps",
            "It's crazy that reviewers have such a hard time hiding their bias.  Nothing against the test itself, but his flavour commentary and conclusions are 100% Apple apologies and \"but, but, but!\" whenever the Surface beats the Mac.\n\nHe also conveniently failed to mention Surface has a touchscreen constantly drawing power, but of course mentioned *several times* that the Apple has \"more speakers\" contributing to significant power drain (not correct), hence why it lost the video playback test.\n\nTL;DR:  Reviewer is a simp.",
            "Normalized for Wh and W\n\nSurface laptop x elite 54wh vs apple m3 pro 70wh\n\n1st test : browsing for 2 hours\n- Surface lost 26 percent = 14.0 Wh, 7.0 W\n- Macbook lost 16 percent = 11.2 Wh, 5.6 W (80% of surface)\n\n2nd test : productivity apps (excel,word ) with spotify running in background for 2 hours\n- Surface lost 21 percent = 11.3 Wh, 5.7 W, \n- M3 pro lost 25 percent = 17.5 Wh, 8.8 W (155% of surface)\n\n3rd test : webcam for 30 min\n- Surface lost 6 percent = 3.2 Wh, 6.5 W\n- M3 pro lost 6 percent = 4.2 Wh, 8.4 W (130% of surface)\n\n4th test : stand by for 16 hours\n- Surface lost 4 percent = 2.2 Wh, 0.14 W\n- M3 pro lost 2 percent = 1.4 Wh, 0.09 W (65% of surface)\n\n5th test : video streaming for 2 hours\n- Surface lost 16 percent = 8.6 Wh, 4.3 W\n- M3 pro lost 18 percent = 12.6 Wh, 6.3 W (146% of surface)\n\n6th test : gaming\n\nM3 pro sustains around 60fps while Surface around 30fps\n\nM3 pro dies while Surface continues the test"
        ]
    },
    "Can't wait for the Laptop Go 4 !": {
        "title": "Can't wait for the Laptop Go 4 !",
        "score": 7,
        "url": "https://www.reddit.com/r/Surface/comments/1dr9wdu/cant_wait_for_the_laptop_go_4/",
        "content": "I hope next October we will have a snapdragon surface laptop go 4 ! The laptop 7 and 11 surface pro are too heavy for me.",
        "num_comments": 0,
        "comments": []
    }
}