{
    "Previously On, /r/Survivor: No-Judgement Questions": {
        "title": "Previously On, /r/Survivor: No-Judgement Questions",
        "score": 4,
        "url": "https://www.reddit.com/r/survivor/comments/1dmkkc5/previously_on_rsurvivor_nojudgement_questions/",
        "content": "Welcome to \"Previously On, /r/Survivor,\" a weekly thread intended for anyone to **ask any question about Survivor, without judgement.**\n\nThis community contains many superfans who know ~~too~~ much about the show. And it also contains many up-and-coming fans, who may have questions about Survivor that they're hesitant to ask for various reasons. This is the thread for those questions.\n\nOr any Survivor questions from anyone, really.\n\n**There are no dumb questions in this thread. Please do not downvote questions unless they're obvious trolling/shitposting.** Otherwise, ask away, and those of us who know the answers will provide insight.",
        "num_comments": 50,
        "comments": [
            "What would the protocol be for a 'circular vote'?\n\nA votes for B votes for C votes for D votes for E votes for A resulting in a 1-1-1-1-1 vote.\n\nNo individual immunity, no hidden idols in play, no SITD played, etc.\n\nThe normal tiebreak rules don't hold up.  Normally everyone in the tie doesn't re-vote, but that means 0 people would be in the re-vote.\n\nMaybe everyone votes again?  Or it's considered an immediate deadlock and the whole tribe goes to rocks?",
            "Does anyone know for certain why the jury residence is called \"Ponderosa\"?  Yes, I know about the ranch from *Bonanza*, but if that is in fact the origin of the name, how did it come to be applied to the jury residence?",
            "in the old days when they did endurance challenges, did they get to reapply sunscreen at any point? i'm thinking of the ones on poles out in the water especially, or the \"hand on the idol\" type one like in africa.. because no one ever seems hideously sunburned at tribal/the next day. i know they give it to them at camp but they have to had given it to them to reapply right? or maybe crew very delicately applied it (lol)?",
            "At what point and why did the challenges pivot from being combative to endurance-focused? \n\nWatching some of the earlier seasons, I was surprised at how many challenges were based on physically fighting one another. It felt a lot more 'Lord of the Flies' and lacked that community I love about the show. \n\nAt some point, challenges have become more about endurance, smarts, team work, and overall fitness and strength. When did this happen and was there a specific incident that caused this change?",
            "Survivor is a very different game depending on your cast mates awareness of your threat level. \n\nThreat level management has shown to be a crucial piece of the puzzle for finding your way into the final tribal council.\n\nMy question is:\n\nIf you were on survivor, your cover is blown, and your tribe mates are all looking to vote you out, what maneuvers are you using to try and survive another tribal council?",
            "Is there any HD footage of winners before Gabon being announced?",
            "How come there's no picture of the Survivor 45 Final Three in the Wiki yet? There's already a picture of the S45 and 46 juries in the Jury gallery, but the gallery in the Final Three article skips 45 and went straight to 46 after 44.",
            "What was the perception of Pearl Islands at the time of airing? I’m curious because it’s my favorite season and that’s quite the common opinion among fans now.",
            "Did Ometepe members get the same reception at Ponderosa that Andrea received when she went to Redemption Island?",
            "Was JT considered for Winners at War? Or was there a reason he wasn’t there? I just rewatched Tocantins and am now starting to watch WAW for the first time. \n\nAnd when I search the sub, obviously lots of stuff comes up for JT so I thought I see if this was a faster/easier way to get my answer :)"
        ]
    },
    "Drew just did something really funny in Jeopardy": {
        "title": "Drew just did something really funny in Jeopardy",
        "score": 686,
        "url": "https://www.reddit.com/r/survivor/comments/1dqyaz6/drew_just_did_something_really_funny_in_jeopardy/",
        "content": "I've been tracking Drew's run on Jeopardy and updating his Survivor wiki page accordingly. I put in that he was a \"several-day\" champion after he won his 7th game and it seems like a lot of people really liked that. So, I spent part of the day today figuring out how to keep that part in there after his next game. As it turns out, I don't have to worry about it anymore, as Drew unfortunately lost today, but that means he will forever be: a several-day Jeopardy champion lol. Long live Jelinsky!!!",
        "num_comments": 61,
        "comments": [
            "He had a hell of a run, but it was a terrible performance for him today. I think he was letting his emotions get the best of him and was over thinking everything ",
            "He lost to a nurse from New York City, Kellie Nalbandian's karma is real.",
            "Bummer I was hoping he could go longer. Can't wait to see the several day champion in the Tournament of Champions",
            "This is amazing dude jalinsky is a walking meme, I wish he lasted longer for more comedy but the fact that he went first is also perfect",
            "He wasn't kidding when he said he's one of the smartest Survivors ever. Winning 7 games of Jeopardy should cement that idea. Drew was winning by so much in some of the games that he didn't need to wager anything in Final Jeopardy because no matter what the others did it wouldn't be enough, but he did it anyway lol.",
            "On the day he gets to answer a Survivor clue, too!\n\nSee you in the ToC, Drew!",
            "How’s much money did he end up with?",
            "How did he not know the answer was Helen Keller??? It was so obvious!!!!",
            "sad that Drew lost :(",
            "Drew might've lost Jeopardy, but there is a possibility that his lose was on purpose because he knows deep down that somebody would want to call him a Several-Day Jeopardy Champion.\n\n\n\nOkay, Tin Foil Hat Conspiracy Class is now over. You can all take the Tin Foil Hats off now."
        ]
    },
    "What is the worst twist that survivor has ever introduced? ": {
        "title": "What is the worst twist that survivor has ever introduced? ",
        "score": 49,
        "url": "https://www.reddit.com/r/survivor/comments/1dr0lq2/what_is_the_worst_twist_that_survivor_has_ever/",
        "content": "There's a lot of good contenders for this list:\n\n* Super Idol\n* Haves vs. Have-Nots \n* Fake Merge\n* Final 3 \n* Captains\n* Edge of Extinction, Redemption Island, and Outcasts\n* Forced F4 Firemaking\n* Medallion of Power \n* ...and much more.\n\nI personally think Final 3s have done the most damage overall but maybe I'm the only one who thinks that lol ",
        "num_comments": 100,
        "comments": [
            "In terms of gameplay, there's nothing worse than the hourglass twist and it's not even close. As a viewer, the have-nots twist ruined an entire pre merge. I'll call \"do or die\" the dumbest twist simply because it adds nothing to the game and is actually completely avoidable as a player.",
            "The hourglass.",
            "Hourglass is the worst thing survivor has ever done",
            "Hourglass is the worst because it broke a basic rule of the game: if your tribe wins you are safe.",
            "Long term worst twist: edge by far\n\nShort term worst twist: the original final 3. No one plays that final 5 the same way if they knew. Screwed ozzy maybe more than any player in history. Same with fire making in a way",
            "the Do or Die. thank goodness it didn’t actually take anyone out, but still that was such a mistake.",
            "Voting out players immediately before any type of challenge. I would be so pissed if I was voted out randomly the same day I arrived",
            "Yall are forgetting how badly Sharea and Aaron were screwed probably more than anyone has been screwed ever by production in China when the opposing tribe was allowed to select two of the strongest people to join their tribe",
            "Palau and BvW's schoolyard pick eliminations, and it's not even close.",
            "That forced fire making to save Ben in Survivor 35: HHH is definitely up there. Ben had already “conveniently” found like 5-6 idols before then. I was rooting for Devon heavy so it wrecked me when he got screwed over like that."
        ]
    },
    "How was James on the Hero tribe? ": {
        "title": "How was James on the Hero tribe? ",
        "score": 139,
        "url": "https://www.reddit.com/r/survivor/comments/1dqn9gy/how_was_james_on_the_hero_tribe/",
        "content": "James was rude to people in China and in Micronesia. I think the only reason why he was on the hero tribe was because he was hot. That’s it. His social game is terrible. He barks at people all the time. The way he bullied Stephanie was brutal. Am I wrong? ",
        "num_comments": 122,
        "comments": [
            "He was one of the most popular characters ever. That’s why. The labels pretty arbitrary, and one can make the case that a lot of the heroes are villains and vice versa.",
            "I think the producers did OK with what tribe they put James in.\n\nIt just so happened that starting with HvV, James started acting like a massive dick.\n\nMaking fun of Eliza for \"complaining\" after she took a hit to the dome and was displaying fairly obvious symptoms of a concussion was not very *heroic.*",
            "There were a few questionable casting choices on HvV (Sugar being a hero is always wild to me) but I think a lot of it came down to a mix of the audience opinion on the players and the archetype they'd filled - James was generally beloved at the time (his hotness definitely played a factor) but he was also portrayed as the \"good guy trying to do an honest day's work\", especially during his China edit. This era was heavily defined by the two camps of \"form an alliance and play an honest game with them\" and \"backstab and blindside your way to the final tribal\" and James' game play generally fit into the former",
            "He was a two time fan favorite award winner. That man was a lock for the Heroes tribe.",
            "Because he never lied or backstabbed people and just wanted to win. But I'm HvV at that challenge he really did act like a villain.",
            "He was incredibly easy to root for in both cina and Micronesia in my mind. Of course he's the villain in hvv but people loved gravedigger James in china",
            "“Hero” was pretty much defined as “Someone who production wanted to bring back who wasn’t necessarily a Villain”\n\nAlso, I feel like James was a lot more pleasant in 15 and 16, or at least the edit showed he was\n\nHe would’ve felt more out of place if production put him on the Villains tribe IMO\n\nJust being rude isn’t really Villain material. I can’t think of anyone on the Heroes tribe who never did anything on their original seasons that could be interpreted as Rude, except maybe Amanda",
            "Okay let's not forget what a complete ahole Stephenie was. The edit could be interpreted that way but IDK if that is 100% accurate. It is also said that he quit smoking the day before he got on the plane or something like that, which could also attribute to his irritability. (Not an excuse, but a reason... and one that production might not have been aware of in the casting)\n\nI think overall he was seen as a hero due to his physical strength and for how much the fans love him. He also had a very tight alliance in China and was viewed as very loyal in both China and Micronesia. Those are \"heroic\" qualities in the game. So no I don't think it was just because of his looks.\n\nHe is not the most questionable casting in HvV by far. There is a lot of questionable casting on HvV. Parvati being one of them. Candace being another. and Even Stephenie as mentioned above. It could be said after her performance in Guatemala that she could be cast on the Villains.",
            "I’m rewatching Micronesia currently, and this seems like selective memory. Think about the way he handles Kathy. He’s kind, supportive, and doesn’t judge her for her quit. In fact, I’d say the only moment in Micronesia where he seems not heroic is when he’s getting testy with Eliza, saying that they should have voted her out. But even then, he said it directly to her face, not behind her back.\n\nI don’t remember China quite as well, but I don’t remember him being all that difficult or mean in that season. HvV, yeah, he was crabby and not super nice, but if you judge him by his seasons before then, I’d say it’s pretty clear why he’s a hero.",
            "The real question is how was *Stephenie* a hero. James was loved by his castmates on both China & Micro, the same can’t be said for Stephenie on Palau and Guatemala."
        ]
    },
    "The first Survivor Alum to do a Tiny Desk concert...": {
        "title": "The first Survivor Alum to do a Tiny Desk concert...",
        "score": 104,
        "url": "https://youtu.be/Vrk2Q9AZrYI?feature=shared",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Queen Taj, Coko, and Lelee still sound sooooo good it's insane",
            "It always shocked me that more people playing on Tocantins didn't know who she was. I know SWV's popularity was short-lived (5 years) and Taj wasn't the face of the group, but I expected her being a former SWV member to come up at least once lol.",
            "So excited about this!!",
            "She looks phenomenal. I know she's a firm \"no\" but I would love love love to see her play one more time.",
            "The way survivor had the audacity to frame taj as just “Eddie George’s wife”",
            "So good!  I love SWV",
            "Finally!!!! I’ve been waiting for SWV’s tiny desk to be uploaded",
            "Get Coach in there next.",
            "Man, what is The Dragonz management doing if they can't book them this gig!?",
            "Right! It was more like oh that’s Eddie George’s wife!!! Which, yes, but uh HELLO. She had a full music career that was very successful and those songs people are still listening to today"
        ]
    }
}