{
    "A man fights two sharks for a tuna.": {
        "title": "A man fights two sharks for a tuna.",
        "score": 560,
        "url": "https://v.redd.it/7yaifsc2738d1",
        "content": "",
        "num_comments": 124,
        "comments": [
            "dude fought sharks.",
            "This is pretty wild footage. Why did he risk his safety fighting for it rather than letting it go and getting the fuck out of there?",
            "Those sharks looked small in the water but at the surface 👀👀",
            "Big risk that the sharks get into the fishingline.",
            "This guy never watched jaws",
            "Does he know he can fish from the surface where the sharks are not?",
            "man i prefer dead silence over  that shitty 8 bit cd rip off music",
            "That was crazy as fuck. Really wanted that fish. S",
            "That's some hardcore stuff. Big brass balls",
            "Im so broke i fully understand fighting 2 sharks for a tuna on a primordial level, Like: fuck it, I'm eating today or die trying to have a belly full of food!"
        ]
    },
    "Observing a rock avalanche": {
        "title": "Observing a rock avalanche",
        "score": 489,
        "url": "https://v.redd.it/ow99u5xn038d1",
        "content": "",
        "num_comments": 53,
        "comments": [
            "Cameraman, balls of steel staying on the bridge.",
            "I was waiting for the cameraman to zoom out from far away at the end",
            "Rock avalanche sounds way cooler than landslide. Thank you for this!",
            "That looks leathal as fck!",
            "![gif](giphy|55itGuoAJiZEEen9gg)",
            "Welome to Switzerland! This happened yesterday as there‘s tons of rain coming down…\n\n[https://www.20min.ch/video/mattervispa-geroelllawine-rauscht-walliser-fluss-hinunter-103132465](https://www.20min.ch/video/mattervispa-geroelllawine-rauscht-walliser-fluss-hinunter-103132465)",
            "Is the full video anywhere?  \nReally curious for the other side or an afterwards view.",
            "Darwin contender right there",
            "I'd run for my life.\n\nI'd think about who to contact to warn people down there.\n\nI'd regret not having taken such a breathtaking video.",
            "Seeing a river of rocks coming at you, must be terrifying. I would not be on that bridge."
        ]
    },
    "Bro got skills": {
        "title": "Bro got skills",
        "score": 2404,
        "url": "https://v.redd.it/acna6g0e1z7d1",
        "content": "",
        "num_comments": 103,
        "comments": [
            "There is a saying, that a bad electrician dies from electricity. A good electrician dies from alcohol.",
            "You can't be insulted, if you are insulated...",
            "The slight head turn away when he cuts the conductor lets you know this guy is a pro.",
            "Your momma so poor, you use high voltage lines for fireworks.",
            "Can someone explain what he’s doing?",
            "I was waiting for the pop and him to fly backwards in a puff of smoke",
            "I don't understand electricity. Why is the guy not catching on fire? Why is the thing sparking if it isn't connected to anything? I thought there needs to be a complete circuit for electricity to flow. This is why I'm afraid of electricity, I don't know how it works.",
            "At least he had his gloves on",
            "People are shocked when they learn I am a bad electrician.",
            "I've seen a lot of very nasty videos where the guys (it's always a guy) actually got 100% roasted by high voltage wires. And I don't mean metaphorically roasted. Literally roasted, in the former definition of \"literally,\" meaning literally.It is *not* pretty."
        ]
    },
    "Heroic passerby jumped into a raging river to save an unconscious driver and his passenger trapped in a sinking car ": {
        "title": "Heroic passerby jumped into a raging river to save an unconscious driver and his passenger trapped in a sinking car ",
        "score": 2958,
        "url": "https://v.redd.it/lwyz684v7y7d1",
        "content": "The dramatic rescue took place in Chengdu, China. ",
        "num_comments": 100,
        "comments": [
            "Thats a fcking hero. Thats fast water",
            "anyone who’s ever been in fast moving water knows how brave those guys were. This is some heroic stuff",
            "Good thing there were swimming enthusiasts nearby",
            "Well done that water was moving quickly",
            "The best of us",
            "That's a hero!",
            "Incredible...",
            "He is so brave",
            "Can’t even imagine how difficult that was, dude is a hero",
            "There are good people in the world!!"
        ]
    },
    "student pilot enters a spin as a trainings": {
        "title": "student pilot enters a spin as a trainings",
        "score": 324,
        "url": "https://v.redd.it/xpip61gqzy7d1",
        "content": "",
        "num_comments": 22,
        "comments": [
            "May the Lord bless me with this demeanor in similar situations. Amen",
            "That is one way to learn for sure",
            "This might sound crazy but this was the best part of my flight training. In my case this was done in an aerobatic aircraft that’s almost specifically designed to do stuff like this. We learn how to stall and recover from stalls from very early on, before we can go solo. \n\nThis Spin training is part of a module carried out much later on during training (in my case right at the end) called Upset Prevention and Recovery Training, or UPRT. \n\nBy the time I did spin training I’d flown loops, barrel rolls, and had the instructor demonstrate wingovers, and stall turns, as well as flown constant 2.5g turns. I’ve been on the biggest roller coasters in the world, not a brag, but just to demonstrate I’ve got a *fairly* decent stomach for this kind of thin, but given in a loop you’re using more than double the height of the tallest coaster in the world, it did still get to me. \n\nAnother thing that was great fun is the instructor would tell you to close your eyes, and then he’d deliberately confuse the balance sensors in your ears, put the plane into a crazy attitude, and then say “you have control” and you have to open your eyes and recover.",
            "Does the instructor have some sort of override in a plane like this so he can take over if the trainee has a melt-down?",
            "Salute to the instructor for being calm and able to teach the student without shouting",
            "My crazy cousin had his pilot’s license. He took my dad up one day and then said, “Want to see me get out of a dead spin?” And before my dad could answer, they were in that same state as in the video. Dad said he nearly crapped his pants.",
            "Still a great video!",
            "id love to do this but my god the nausea kicked in from here fuck",
            "Damn, that's some brass cojones. Steady voices too.",
            "Just started training to be a pilot, I hope I never have to worry about this"
        ]
    }
}