{
    "THE MOST WRETCHED HIVE OF SCUM AND VILLAINY - WEEKLY RANT THREAD - June 24, 2024": {
        "title": "THE MOST WRETCHED HIVE OF SCUM AND VILLAINY - WEEKLY RANT THREAD - June 24, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/SWGalaxyOfHeroes/comments/1dn7coi/the_most_wretched_hive_of_scum_and_villainy/",
        "content": " HAVE SOMETHING YOU NEED TO GET OFF YOUR CHEST?\n\n**DID YOUR GW TAKE 2 HOURS? JUST COULDN'T FINISH IT?**\n\n**COULDN'T FILL IN THOSE PLATOONS?**\n\n**DID GK/ZARRISS OR CLS DECIMATE YOUR TEAM??**\n\n### WELL YOU'RE IN THE RIGHT PLACE!\n\nWELCOME TO MOS EISLEY SPACEPORT, THE MOST WRETCHED HIVE OF SCUM AND VILLAINY!\n\nSOB AWAY! SAY YOUR GOODBYES! USE AS LITTLE EFFORT AS YOU WANT!\n\nRULES\n\n* CAPS LOCK IS HIGHLY ENCOURAGED!\n* ALL CONTENT MUST BE SFW!\n* KEEP IT CIVIL AND ON TOPIC. DON'T MAKE PERSONAL ATTACKS ON OTHERS. EVERYONE IS ENTITLED TO THEIR OPINION, AND PEOPLE CAN OFTEN DISAGREE!\n* ALL HATEFUL COMMENTS THAT DERAIL CONVERSATION WILL BE REMOVED!\n* FORGET ABOUT RULE 13!\n\n*This* *thread* *will* *be* *reposted* *every* *Monday.* *Archived* *submissions* *are* *available* [*here*](https://www.reddit.com/r/SWGalaxyOfHeroes/search?q=the+most+wretched+hive+of+scum+and+villainy&restrict_sr=on&sort=new&t=all)*.*",
        "num_comments": 6,
        "comments": [
            "I’m trying to start farming Dark Bastila so I can unlock Darth Revan and I’ve gone five days without getting a single shard. I get once or twice but you’d think a WEEK of playing would get me SOMETHING",
            "Because of a glitch my guild is doing Hoth this week.\n\nBOOOO CG GET YOUR SHIT TOGETHER, BOOOO",
            "A pop-up appeared in my game app saying you could buy Ben Solo shards in some pack or other, so naturally I clicked, but all it did was take me to the stupid in-app store with no sign of Ben Solo shards…WTF? Why tease me like that and then crush my hopes and dreams \\*sobs\\*",
            "I've been playing this game for years 6.5m.  Lately, I'm getting very tired of loosing to outmatched enemy squads, with lacking mod configs, only a couple lvl1 or 2 relics and a few gold gear12 against my squad with major mod setups on relic 7 & 8 chars. Buff and debuff abilities getting squashed, i.e., x can't be resisted or evaded, yet doesn't happen.  Enemy characters with debuffed heal, healing anyway, while my turn meter increases and healing effects don't appear to be working. What gives CG? Do they think seeing my heavy-weight squad loose to a feather-weight will convince me to spend even more money.",
            "3v3 sucks ass",
            "Was about to start a battle in GA and the game restarted due to maintenance, and now this is how it looks, saying I’m in progress of fighting and I’m angry. CLS team wasted.\n\nhttps://preview.redd.it/k0jhoemi3k8d1.jpeg?width=1792&format=pjpg&auto=webp&s=a3c245328d5b99ac6f98b0a42735b1c5ea030ed3"
        ]
    },
    "Weekly Pride and Accomplishment Megathread - June 24, 2024": {
        "title": "Weekly Pride and Accomplishment Megathread - June 24, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/SWGalaxyOfHeroes/comments/1dn7cop/weekly_pride_and_accomplishment_megathread_june/",
        "content": "**Welcome to the Weekly Pride and Accomplishment Megathread!**\n\nThis megathread has been created for everyone to share things they are working on Star Wars Galaxy of Heroes and the things they are proud of. Any Pride and Accomplishment post not made in this megathread can fall under Rule 14 and can be deleted. The megathread will be replaced daily in order to prevent massive amounts of comments and increase visibility.\n\nAny Pride and Accomplishment posts are allowed, such as (but not limited to):\n\n* New character(s) unlock\n* G13 or Relic unlocks\n* Event progression\n* GP progression",
        "num_comments": 4,
        "comments": [
            "Hit 7-star on Marauder (and will have my first BB pilot relic'd very soon), completed Tier 4 for Rey and all the Tier 1 battles for SLKR.",
            "Got my Savage Opress to relic today, so that’s cool, been saving for a while so he went straight to r7, I’m excited to see how he works on my GAC defense.",
            "Finally got my FOCS up to 7-star, meaning I can finally finish up the Finalizer event tomorrow!",
            "Hit a 30 speed secondary mod today! I'm stoked!\n\nhttps://preview.redd.it/1kon8jeo8e9d1.png?width=2340&format=pjpg&auto=webp&s=03f8ed358e667690689012ca44a5fd56f6aa1f01"
        ]
    },
    "Galactic Legend Ahsoka Tano is coming to the Holotables!!!": {
        "title": "Galactic Legend Ahsoka Tano is coming to the Holotables!!!",
        "score": 486,
        "url": "https://i.redd.it/onjkr58s0g9d1.jpeg",
        "content": "",
        "num_comments": 290,
        "comments": [
            "Relic 9 Ahsoka Tano is one of the requirements. ",
            "Betting we get padawan Sabine as one of the marquees for this gl.",
            "Unaligned Force User GL or perhaps Neutral.",
            "Not my type of GL but kind of obvious in the end. GL thrawn will be next I guess.",
            "I know they are going to somehow box her out of Cere Malicos with her kit, but man imagine slotting a GL into Cere Maligos. That would be nuts.",
            "As soon as we saw the night trooper I knew it had to be her. Too early for thrawn",
            "I'd just prefer new characters. So many dublicates.",
            "Finally a Vader lifter GL. I knew he'd finally get a lifter making him relevant",
            "I bet some of her abilities will move extremely slow.",
            "Force ghost Anakin relic 9 incoming"
        ]
    },
    "How we solved the CG puzzle": {
        "title": "How we solved the CG puzzle",
        "score": 221,
        "url": "https://www.reddit.com/gallery/1dr66y3",
        "content": "",
        "num_comments": 61,
        "comments": [
            "I have no idea how anyone came up with or solved that puzzle",
            "Holy shit that is goddamn impressive, kudo to people solving this",
            "I thought the last slide was going to be Stanley Hudson telling me to stick it up my butt.",
            "if only they put this much effort into fixing their night sister event lol",
            "The bonus info scares me. Ahsoka tano relic 9. That's a costly investment",
            "Thanks so much for this post. I loved the explanation and walk through. It’s so unbelievably impressive.",
            "The folks who are able to solve these puzzles, absolute legends.",
            "Maybe it's just me but GL ashoka is kinda lame",
            "So much time to fix the bugs and yet, a riddle",
            "I cannot express how absolutely demented that shit is."
        ]
    },
    "Night Trooper found through CG Puzzle!": {
        "title": "Night Trooper found through CG Puzzle!",
        "score": 389,
        "url": "https://i.redd.it/xib9pq503f9d1.png",
        "content": "",
        "num_comments": 85,
        "comments": [
            "I wonder what tags it will have?",
            "Is it just me, or was the last puzzle Starkiller like 2 years ago?",
            "I'm out of the loop what is said puzzle the title is referring to?",
            "Could be Balin Skoll...or heaven forbid a new Ezra...we've already got 3 versions of Ahsoka",
            "Why am I just now discovering there's a puzzle out?",
            "Didn’t realize: we had a ouzzle",
            "It would be cool if this functioned like Nightsister Zombie but for Imperial Remnant/Trooper teams.",
            "Cool. What are the abilities? It's so fuzzy I can't make it out.",
            "Well now I definitely see Thrawn and Ahsoka as the new GLs",
            "Purge trooper....as long as we have a trooper tag to complete 3 squads, I don't care if it's dumpster trooper"
        ]
    }
}