{
    "SwiftlyNeutral - Daily Discussion Thread | June 28, 2024": {
        "title": "SwiftlyNeutral - Daily Discussion Thread | June 28, 2024",
        "score": 11,
        "url": "https://www.reddit.com/r/SwiftlyNeutral/comments/1dqlphh/swiftlyneutral_daily_discussion_thread_june_28/",
        "content": "**Welcome to the SwiftlyNeutral daily discussion thread!**\n\nUse this thread to talk about anything you'd like, including but not limited to:\n\n* Your personal thoughts, rants, vents, and musings about Taylor, her music, or the Swiftie fandom\n* Your personal album + song reviews and rankings (including TTPD)\n* Memes, funny TikToks/videos that you'd like to share\n* Screenshots of Swifties acting up on other social media platforms (ALL usernames/personal info must be removed unless the account is a public figure/verified)\n* Off-topic discussions, or lower effort content that might not warrant a wider discussion in its own post\n\nAll sub rules still apply to the discussion thread and any rule breaking comments will be removed. Please report rule breaking comments if you come across them.\n\nIf you are taking screenshots from places like TikTok, Twitter, or IG, please remove all personal information before posting it here. Screenshots posted to make fun of users from other Taylor-related subreddits are not allowed and will be removed.\n\nComments directly linking to other Taylor Swift subreddits will be removed to discourage brigading.\n\n*Posts that are submitted to the sub that seem like a better fit for this thread will be redirected here. A new thread will post each day at 11:00am Eastern Time. This thread will always be pinned to the subreddit for easy access.*",
        "num_comments": 152,
        "comments": [
            "This is coming from all the coverage of Sabrinas tour but it def applies to Eras Tour. I have a possibly stupid question: Is Ticketmaster really letting people sit in the queue to wait their turn for hours *even after the show has sold out* ? They dont just stop all that once the show has sold out? Like, if Im 900 in the queue and they sell out at 700, are they still going to let me sit in the queue until its my turn even if its fully sold out by then? \n\nIve never used the site and that looks like what most people are complaining out. And yeah, thats ridiculous.",
            "How Did It End and I Look In Peoples Windows are both devastating. \n\nI attribute them as Joe songs (no one correct me, I dont care if theyre not, let me believe!) and I just cant imagine my relationship of 4 years just petering out (no pun intended).",
            "Im going to Vegas to see the Lady Gaga Jazz and Piano show this weekend and after all the talk about Taylors performing style this week Im looking forward to it even more. I admire artists who expand their musical interests. And I cannot wait to hear her voice in a smaller venue.",
            "This has been adressed before but \"You said normal girls were boring\" is suuuch a red flag, of course he was gone in the morning!",
            "We have been wandering around Dublin today and it makes me happy seeing a bunch of older men wearing wearing Taylor shirts and hats. I feel like that is a demographic that I always assumed wouldnt be into her music and yet, there they are here during Eras weekend",
            "nah I didnt expect all tickets to be gone for sabrina. I know shes popular but like these got to be bots",
            "Does anyone else find the champagne problems cheering incredibly obnoxious? It was cute the first time but now it feels like every city is competing to be like \"omg we love Taylor the most!\". She only has so long to perform and a curfew for noise, so it just holds the show up.... I low key sat down and quietly clapped because my feet were tired when I went.",
            "People interpreting Travis performance on stage as him bringing her back to life after her break up is wild to me. The entire point of the skit and song is shes being forced to perform when shes unhappy, and hes playing one of the people forcing her. I feel like people are in la la land when it comes to Taylor and Travis.",
            "Yall, I really hate the title The Tortured Poets Department. Taylor may be a poet, but shes not tortured.",
            "As someone who grew up with a mother with severe depression and had a partner with bad depression, I get the feeling of having to swim a drowning person to shore while struggling to keep afloat myself. \n\nSo, I get So Long London, but I'm baffled by Fresh Out the Slammer. I'm willing to re-consider Fresh Out the Slammer if someone has a song with a similar theme (\"our relationship was a prison bc of your sadness, so I left you for another man, who I'd wanted for a long time\"), so I can see it with new eyes."
        ]
    },
    "Megathread: The Eras Tour in Dublin": {
        "title": "Megathread: The Eras Tour in Dublin",
        "score": 8,
        "url": "https://www.reddit.com/r/SwiftlyNeutral/comments/1dqkcej/megathread_the_eras_tour_in_dublin/",
        "content": "The Eras Tour has officially arrived in Dublin, Ireland and will be there from June 28th through June 30th.\n\nPlease use this megathread for all discussion about Taylor’s stop in Dublin.\n\nTo reduce repetitive posts, we will be removing most other posts about the Dublin concerts through the 30th.",
        "num_comments": 23,
        "comments": [
            "All he wanted was her sweet nothing was a hoax. A couple weeks ago I joked that she should do Delicate/Hoax, but Sweet Nothing / Hoax is another diabolical combination.",
            "I am excited, third time seeing her in Dublin (saw her at 1989 and Reputation). Did anyone see her at Fearless tour - I believe it was in the Three Arena circa 2011?",
            "she chose violence today. Third greatest acoustic set so far (first of course Exile LA, then evermore Cincinnati)",
            "I KNEW IT. I said to my friend yesterday she's going to play Sweet Nothing bc of the Wicklow mention but combine it with something devastating like Hoax so annoying people will feel validated lol",
            "So happy she is back in my country  I cant go but hope everyone has a great time here! And i hope she comes back again really soon ",
            "she looked so sad singing the surprise songs ",
            "Man that sweet nothing and hoax  just wrecked me!",
            "There's a free Dublin City Council \"Swifts Row\" photos and friendship bracelet event on King Street South (by stephens green shopping centre) stand staff were lovely but was in a rush! Do visit",
            "SOG and YOYOK? Interesting I agree",
            "State of Grace is an interesting choice in Dublin seeing as it is considered to be a total rip-off of (or homage to) U2"
        ]
    },
    "Curious about your thoughts on why she does this. ": {
        "title": "Curious about your thoughts on why she does this. ",
        "score": 157,
        "url": "https://www.reddit.com/r/SwiftlyNeutral/comments/1dr4haj/curious_about_your_thoughts_on_why_she_does_this/",
        "content": "I am a fan of her songwriting. I know some people think it’s dumb, probably because she also writes bubblegum pop, but as a songwriter, myself,  I recognize some crazy talent in her songwriting. Anyway, I was considering going to eras after seeing a video of her getting like a 20 minute standing ovation.  THEN, I saw another and another and then found out she does it every.single.show. It really bothered me to the point that I decided I wasn’t sure I  sit through that and not have it turn me off from even her songwriting, forever, so I’d rather not.  It’s almost disturbing to me.  Not that she gets ovations, but that she takes out her ear piece and mouths “omg” “really?!” “You guys!” “Seriously?!” Every.single.time.  She’s so talented, but this makes her seem incredibly fake to me.  Is there something I might be missing about why she does this? Is there an angle I’m missing? I was a theater kid, so I get being a ham and appreciating an ovation, but I’m referring to her reaction, specifically. Is there an entertainment reason for this I am missing?",
        "num_comments": 134,
        "comments": [
            "I think we have to accept that by this point in time, every element of the Eras show is scripted. Everything.",
            "Consider the Eras tour more of a play than a concert. Shes performing a scripted musical.",
            "I think thats a down side to shows being live streamed. We become hyper-aware of anything scripted and it can really showcase if certain things arent genuine.",
            "Im not 100% on this but I think it may have started as a chance for the table and everything to get set up for the Tolerate It set. But I only ever watched the live streams so Im not sure when that actually got set up or where or how. Then it turned into a tradition. That was always my guess.",
            "This is one way social media has ruined live shows. Major tours have always been micromanaged this way, there's very little that's spontaneous or truly authentic when you have time constraints and 40+ songs to get through; *it's more like musical theatre than a gig*.\n\nI know it sucks the moment you realise what you thought was so pure and real is actually planned, but that's just how it is, and it's not a new thing or an exclusively Taylor thing at all. Only a fraction of the most obsessed fans see the curtain pulled back in such a way.",
            "![gif](giphy|GjB41rKHBnOkE)\n\nI suppose its better than this",
            "i think this is her attempt at looking modest, but it's so fake and she's a truly terrible actor so it comes off as even worse.",
            "That particular situation was fans doing, they did a longer ovation at one concert, then the following night the crowd wanted to outdo the initial ovation and then it spiralled into what it is now. I have a lot of beef with Taylor but that's not on her.",
            "The ovations usually last from about a minute to 3 and a half minutes. Occasionally shes had longer ones with a max of like 8 minutes. But its wild to form this whole opinion off of something thats just not true.",
            "Its not a 20 minute ovation; that is an exaggeration. Ive been to the show and watched it multiple times via streaming so I know. Usually the ovation is a few minutes at most. The longest ovation recently was one where there was someone getting help in the crowd and the lights were turned on to deal with it. She was delaying starting again after Champagne Problems for that. Even then, the ovation was less than 10 minutes long, and that was an outlier.\n\nIf you want to complain that it is scripted each time or that she bothers to seek the cheering each time, sure, those are factually based points. But not the time length claimed here."
        ]
    },
    "Anthony Fantano responds to allegations of sexism for giving TTPD a low rating": {
        "title": "Anthony Fantano responds to allegations of sexism for giving TTPD a low rating",
        "score": 432,
        "url": "https://youtu.be/O8ZXR9bt_90?si=DU3bPwdRn3Y8prcM",
        "content": "",
        "num_comments": 180,
        "comments": [
            "Ridiculous that he even had to make this. Swifties are some of the most toxic people I have ever had the displeasure of interacting with. Not everything is misogyny or sexism, and claiming the opposite makes the words mean nothing.",
            "Not really a fan of his usually, but hes right. Swifties are using misogynistic or sexist too loosely, any time someone says anything critical about Taylor or her music, theyre sexist.\n\nIt honestly makes me angry. Dave Grohl saying she doesnt sing live is not sexist, Fantano or other critics not like TTPD is not sexist. It takes away from instances where she actually does experience misogyny, because of course that does happen. They are watering down the meaning of the word for their petty fanwars.",
            "He gave Brat a 10/10 but when its not their fav its misogynistic and sexist ",
            "This is the consequence of the feminism of Taylor, she trained her fans that way",
            "I didnt like TTPD when I first listened to it and it never grew on me. Must be all of my internalized misogyny! It keeps me from being able to understand its depth \n\n(Obligatory /s I really hope I dont need)",
            "He wasn't that harsh, I expected an even lower rating from him. And it's ridiculous he had to make this video",
            "He debated that delulu #1 Drake stan and I so wish hed do the same with a swiftie lol",
            "I will like to add that Fantano is also responding to swifties calling him sexist for giving Gracies album a low score so not just the TTPD review.",
            "God forbid someone not liking Tortured White Woman. Swifties are a laughing stock every time they scream sexist if someone doesnt praise their mother. It screams insecure.",
            "I love watching his reviews even when I don't necessarily agree with his ratings. He's very articulate and he doesn't suck up to any fandom and just shares his honest opinions. And I love him for what he did to Drake lmao"
        ]
    },
    "what are your taylor swift unpopular opinions?": {
        "title": "what are your taylor swift unpopular opinions?",
        "score": 39,
        "url": "https://www.reddit.com/r/SwiftlyNeutral/comments/1dr4u2r/what_are_your_taylor_swift_unpopular_opinions/",
        "content": "these can be about songs, about her different eras, about her as a person, etc. but what unpopular takes do you have?",
        "num_comments": 226,
        "comments": [
            "I don't care about the \"lore\" or who the songs are about. They have meanings for me and my life, and that's what makes them relatable. \n\nTaylor wouldn't be friends with any of us. She's not an adorable dork.",
            "idk if it's unpopular or not, but the new 'sticking out tongue to look cool' every few minutes just cringes me out. she didn't do it even a few years back. now it's almost in every performance",
            "Speak Now is her magnum opus, and I will die on this hill.",
            "*Both 1989 TV and Speak Now TV are bland compared to their originals*. So to the fans saying we shouldn't listen to the stolen versions, I can't hear you from my house blasting off **The Story of Us** *(stolen version)*.",
            "None of the words or linguistic choices she makes are *that* highbrow or hard to understand, and you definitely dont need a Literature degree to understand them",
            "i don't think she's that good of a songwriter and the fact that she's so praised for it is actively ruining what amount of talent she did have because she keeps trying to sound intellectual and just 'more' than she actually is",
            "Taylor has become as popular as she is because she's made a spectacle of her personal life through her music, and she's basically a reality show people are tuning into with each album. Her diehard fans need to believe she's a songwriting genius because they can't admit that to themselves; they want to believe they're fans of intellectual art from a feminist icon on the same level as Joni Mitchell, not someone who belongs on Bravo. \n\nI say this who likes a lot of her music, but I think she's an average pop musician with a couple of exceptional moments.",
            "Idk if this is unpopular, but TTPD is my least favorite album and I wish she just made The Anthology",
            "The Taylors versions are um not great and are rushed. Fans need to chill out so maybe she can put out quality over quantity.",
            "evermore is miles better than folklore"
        ]
    }
}