{
    "SwiftlyNeutral - Daily Discussion Thread | June 21, 2024": {
        "title": "SwiftlyNeutral - Daily Discussion Thread | June 21, 2024",
        "score": 11,
        "url": "https://www.reddit.com/r/SwiftlyNeutral/comments/1dl63sa/swiftlyneutral_daily_discussion_thread_june_21/",
        "content": "**Welcome to the SwiftlyNeutral daily discussion thread!**\n\nUse this thread to talk about anything you'd like, including but not limited to:\n\n* Your personal thoughts, rants, vents, and musings about Taylor, her music, or the Swiftie fandom\n* Your personal album + song reviews and rankings (including TTPD)\n* Memes, funny TikToks/videos that you'd like to share\n* Screenshots of Swifties acting up on other social media platforms (ALL usernames/personal info must be removed unless the account is a public figure/verified)\n* Off-topic discussions, or lower effort content that might not warrant a wider discussion in its own post\n\nAll sub rules still apply to the discussion thread and any rule breaking comments will be removed. Please report rule breaking comments if you come across them.\n\nIf you are taking screenshots from places like TikTok, Twitter, or IG, please remove all personal information before posting it here. Screenshots posted to make fun of users from other Taylor-related subreddits are not allowed and will be removed.\n\nComments directly linking to other Taylor Swift subreddits will be removed to discourage brigading.\n\n*Posts that are submitted to the sub that seem like a better fit for this thread will be redirected here. A new thread will post each day at 11:00am Eastern Time. This thread will always be pinned to the subreddit for easy access.*",
        "num_comments": 254,
        "comments": [
            "Something I've been thinking about is how much people want to be 'right' about Taylor. I think some of this is Taylor's fault for gamifying things (but never her personal life). It's just interesting to see when I and others could not care less about that side of her fame.",
            "I find Kayleigh Teller to be very strange.",
            "I saw folks sharing their own lists here of tracks they like and I never fully felt like I could do that yet. So far, I streamed the anthology 15 times now (long commute) and the only fully developed cohesive standouts are:\n\n- Guilty As Sin?\n- The Manuscript\n- loml\n- Peter\n- Robin\n- Clara Bow\n\nMost of the album is now forgotten or not enjoyable at this point. I just took these out in a separate album and stream them.",
            "Again with the paternity test about The Black Dog all over this fandom. I actually once cared about this, but now I'm just so over it. Matty doesn't care about Taylor, he's engaged. Joe possibly cares even less. Travis is just shaking it off. If she's sending signs she's just being a fool, which I don't believe she is actually. \n\n\nTo me personally she's playing swifties as fools because she knows people will try to decode songs that sometimes just go well together. Swifties are just doing a huge favor by streaming the songs 25251717 more times to discover hidden meanings and some think it's Joe, others are sure it's Matty, some have entire thesis it's even Kylie, a minority believe it's Harry Styles and everyone swear they have better evidence. It's honestly exhausting at this point. ",
            "That fire video was too funny! I’m glad nothing bad happened and everyone was okay. \n\nAlso cat crumbs! I love seeing her cats",
            "[removed]",
            "The fandom is going to be Insufferable this weekend and I’m equally 😬🍿",
            "I miss the sub when it was on private lol\n\nLike I like this place because it is neutral. But when you have people from that sub just piling on - it's hard to engage when you know it's not a good faith discussion. \n\nAnd I find it hard to take the person seriously when they rail about the stupidity of swifties and then proceed to display the same behaviour and spread misinformation to suit their own narratives. It's beyond weird to hate someone so much you post about her endlessly in snark subs AND pop culture subs",
            "I had a friend who’s a huge Swiftie in my car for a long ride and she played mostly recent Taylor. I didn’t realize just how repetitive some of her rhymes are and how she repurposes some lyrics. I still enjoy her music but this is why I can’t listen to a playlist of her recent works.",
            "I think there was a post about this earlier. But I’m very sick of the “x city won.” Feels like she just uses the same 5 base songs to match with others"
        ]
    },
    "Megathread: The Eras Tour in London": {
        "title": "Megathread: The Eras Tour in London",
        "score": 20,
        "url": "https://www.reddit.com/r/SwiftlyNeutral/comments/1dl4qge/megathread_the_eras_tour_in_london/",
        "content": "The Eras Tour has officially arrived in London, England and will be there from June 21st through June 23rd.\n\nPlease use this megathread for all discussion about Taylor’s stop in London.\n\nTo reduce repetitive posts, we will be removing most other posts about the London concerts through the 23rd.",
        "num_comments": 120,
        "comments": [
            "For the amount of times she chooses to play Maroon (or YOYOK) they should've just been in the setlist...",
            "Nicola Coughlan is there and that’s the only person I care about.",
            "London you won so bad with those surprise songs 😭😭",
            "It's London tour! what do you think the surprise songs?\n\nhere's my guesses:\n\nlondon boy x how did it end   \nthe last kiss x hoax   \nall of the girls you love before x false god   \nhappiness x it's time to go   \nso long, london x closure\n\nthere are rumors that travis will going to watch.",
            "Surprise Song Guitar: Hits different x Death By A Thousand Cuts\nPiano: the black dog x come back, be here x MAROON\n\nYALL I can’t breath 😭",
            "Maroon has to be her favorite song ever written at this point, and with good reason",
            "Apparently the royal family is there.",
            "Prepared to lose The Black Dog and So Long London this weekend. I'm very curious about what song mashups she'll do! I want So Long London/ It's Time To Go",
            "I have this feeling that she will mashup so long london with tolerate it. Idk why but I feel she’ll play tolerate it there since she removed it from the setlist. I am not ready. \n\nAlso, I don’t think she’ll make a big announcement except for maybe a music video. She just released the behind the scenes for Fortnight. It seems to me she is closing it up with that. We’ll see 🍿",
            "Damn it I missed Hits Different😭"
        ]
    },
    "Taylor posted a selfie with Travis, Prince William and his kids on her social media accounts": {
        "title": "Taylor posted a selfie with Travis, Prince William and his kids on her social media accounts",
        "score": 85,
        "url": "https://i.redd.it/urslusoyc48d1.jpeg",
        "content": "It's the first photo with Travis she posts and the first time she posts a photo with a boyfriend on Instagram since 2016 (Calvin was the last one).",
        "num_comments": 81,
        "comments": [
            "The randomness of this whole scenario is sending me into fits 😂",
            "Those kids look exactly like william",
            "Many, many layers to this, but all I’ll say is that this is quite possibly the funniest/shocking way she could have opened up the eras tour in London.",
            "Travis wearing a Team USA hat is truly sending me",
            "The picture posted by the royals’ account is one without Travis though 🙃",
            "Going Instagram Official by posting a picture w the future King of England at your stadium tour is something only Taylor Swift could/would do",
            "I think this is cute? William and Taylor have met previously before and even sung together? And his kids are at the age where they would likely be new Taylor swift fans. I bet a lot of their classmates would have wanted to go!\n\nAlso, seems like their cousins are also there!",
            "“Talk about a hard launch” has me confused because we know she’s been in a relationship with Travis?",
            "https://preview.redd.it/rhfntfrlg48d1.jpeg?width=1170&format=pjpg&auto=webp&s=fe6392fbd5d053fc2dbb2f1912b4083447e9a788\n\nI didn’t make this but I saw it yesterday and this pic makes it 100 times funnier.",
            "Has Taylor had work done recently?"
        ]
    },
    "DAE find it upsetting that Taylor has formed a close friendship with Gracie Abrams despite her openly talking about wanting to fuck a 14 year old when she was 18? ": {
        "title": "DAE find it upsetting that Taylor has formed a close friendship with Gracie Abrams despite her openly talking about wanting to fuck a 14 year old when she was 18? ",
        "score": 117,
        "url": "https://i.redd.it/fec0yy0cr18d1.jpeg",
        "content": "Given that Taylor has spoken about being a victim of sexual assault herself, it’s unfortunate to see her allign herself with someone who openly showcased her sexual desires a literal child when she was a grown adult. ",
        "num_comments": 161,
        "comments": [
            "![gif](giphy|31TsJOgYOvIWWYMEaR)",
            "Sadly Gracie wasn’t the only one saying this shit about Finn during the first couple seasons of Stranger Things. Both him and Millie were highly sexualized by adults. I like to give people the benefit of the doubt but this shit was…..idk. Calling him a cute kid or a handsome young man would be appropriate, but acknowledging his age and saying you’re “down for him” is disturbing.",
            "What?  Never heard of this.",
            "Wait what the fuck??? He looks about 9!!! Oh my god\n\nETA: I cannot stop thinking about this. That is a baby!!! Like what the actual fuck is wrong with her???",
            "She was attracted to a child on this series when babysitter of the decade, Steve Harrington/Joe Keery, was right there??\n\n![gif](giphy|l310xkkI0lnhOe3OOW)",
            "The person in the image looks 10, not even 14. Even as a joke that is really disgusting to say. Idk why people say things like this and pass it off as a joke when it's not really something you should joke about.",
            "If you actually went through every artists interactions/collabs, you will find that the artists who stand up against stuff like sexual abuse, harassment, especially of minors and women, have 100% of the times interacted with someone who's involved in such stuff. Its gross. Artists don't actually care about these things. They speak a normal line and gain followers. The most recent example, apart from Taylor ofc, is Kendrick. He literally called out Drake for being a creep and pedo, also abandoning his kids. But just few days ago, Dr Dre opened up his concert. Dr. Dre has been accused by multiple women for abusing and beating them up. That was maybe decades ago, but still, the fact he never apologised properly proves he never improved as a person. How can Kendrick call out Drake, when he literally collabed with Kodak Black? A guy who was arrested for sexual assault, and battery to a TEEN GIRL? \n\n\nThis is just the few popular examples. The real losers in this whole fight are victims themselves. These people just support them in fake manner to increase followers and use them as weapons to bring other artists down. No one actually cares about them. Its really hard to find an artist who hasn't collabed with someone that does not have a past related to gross things like these, makes me wonder if the artists themselves choose voluntarily to collab with people like them or the industry is so corrupted that you just can't enter and NOT meet people like these, they are everywhere.",
            "He LOOKS like a child so not sure how she’s “incredibly down” ……. very yuck",
            "EL COME GET YOUR MAN\n\nI got really confused I thought this was the stranger things reddit before reading everything fully 💀",
            "i mean WHAT!? "
        ]
    },
    "Pince William dancing to Shake It Off ": {
        "title": "Pince William dancing to Shake It Off ",
        "score": 35,
        "url": "https://v.redd.it/mczbm4onf38d1",
        "content": "Get it King 😂",
        "num_comments": 22,
        "comments": [
            "I’m dying 😂 he definitely wins for the most enthusiastic guest she’s had so far.",
            "https://preview.redd.it/ln7qhtnh948d1.jpeg?width=1170&format=pjpg&auto=webp&s=18cd5b27182838e4ceee57dc09ceb74ea20a3968\n\nTravis in his USA hat meeting Prince William 😂",
            "LMAO I hate the royal family but this clip is actually very endearing. He’s LIVING.",
            "I can't believe he used to be the hot one 🤣\n\n(I tease! I grew up in Australia and am a similar age, so Wills was always heartthrobbin' on the magazine covers.)",
            "https://preview.redd.it/olvajl52d48d1.jpeg?width=1284&format=pjpg&auto=webp&s=a2e0db0a982cf1dfd5aa35dd4ff55c27d7ff9af0",
            "William is the cringiest ever.",
            "Its not him 😂 there are many in uk who looks like him",
            "Him trying to be friendly but not touch him and get tased by royal protection officers 😆",
            "I think there is Princess Charlotte on the right so…",
            "Lmao! I read him and the kids were in a super private box so that no one could pics of them."
        ]
    }
}