{
    "May 1st Stream Highlights": {
        "title": "May 1st Stream Highlights",
        "score": 197,
        "url": "https://www.reddit.com/r/swtor/comments/1chvvrm/may_1st_stream_highlights/",
        "content": "Not sure how a thread with everything hasn't been made yet, but here are the highlights (screenshots mostly grabbed from [Twitter posts](https://twitter.com/SWTOR/status/1785731607652872665)). Hopefully I didn't miss anything.\n\n**Darth Malgus Deco**\n\nhttps://preview.redd.it/0d369irfcvxc1.png?width=2870&format=png&auto=webp&s=ab50ae624d70f8c2b74ab9e9068ab379d960f994\n\n**Desperate Defiance**\n\nWe will be heading to Hutta with Sa'har in a mission to reclaim the holocron. [Story cutscene](https://twitter.com/SWTOR/status/1785733223827279946) shown during the stream.\n\nMission on Hutta will include new characters:\n\n[Adi Vonapa, leader of worker's rebellion](https://preview.redd.it/rssya7fwcvxc1.png?width=1920&format=png&auto=webp&s=4fd09f490a8af3e5c9dad2a7a0b668832943da88)\n\n[Rakit, another leader of the worker's rebellion](https://preview.redd.it/w52qkqixcvxc1.png?width=1920&format=png&auto=webp&s=0bc0fb7768568d1245e13b8ae4891883dbc0959a)\n\n[Yusinduu the Hutt](https://preview.redd.it/g4ccu9iycvxc1.png?width=1920&format=png&auto=webp&s=473eeb75adab1fe28ee1711e12e3624b932b4f28)\n\n**Hutta Update**\n\nWith Desperate Defiance, they have done some graphical updates.\n\nTrailer: [https://twitter.com/SWTOR/status/1785735370446950522](https://twitter.com/SWTOR/status/1785735370446950522)\n\n**Spring Abundance Festival**\n\nFinally finishing the seasonal activities calendar, we now have a spring festival. Starts with someone giving you a farm on Dantooine for absolutely no nefarious reason. Activities mentioned in the stream include:\n\n* Egg hunts\n* Farming\n* Baking pies\n* Eating pies\n* Electrocuting random fish while you sit on a blanket\n* Collecting orphaned animals for your farm\n* Dancing\n\nTrailer: [https://twitter.com/SWTOR/status/1785736264743899348](https://twitter.com/SWTOR/status/1785736264743899348)\n\nRewards:\n\nhttps://preview.redd.it/orsxrb8bevxc1.png?width=2076&format=png&auto=webp&s=c865ea816189e6d6975e9c025e6243d8c19ab2c0\n\n**Basilisk Prototype Venture**\n\nVentures are a new thing that are meant to be major undertakings for solo play (compared to something like acquiring the Wings of the Architect, but uhhh we'll see). As you complete missions you will improve B3-S1 (Besi) eventually unlcoking her final form as a full companion.\n\nProgression shown in the stream:\n\nhttps://preview.redd.it/6y67csatevxc1.png?width=1920&format=png&auto=webp&s=0afa0ce180f6965dd3ebb2f5ead606aae1d83d51\n\nTrailer: [https://twitter.com/SWTOR/status/1785737944105415011](https://twitter.com/SWTOR/status/1785737944105415011)\n\n**PVP Season 6**\n\nPVP seasons are apparently getting some overhauls in terms of timing and length. A full post on this can be found on the forums: [https://forums.swtor.com/topic/934933-pvp-seasons-increased-to-16-weeks-long-with-75/#comment-9812918](https://forums.swtor.com/topic/934933-pvp-seasons-increased-to-16-weeks-long-with-75/#comment-9812918)\n\nRewards:\n\nhttps://preview.redd.it/wis1gck1fvxc1.png?width=1920&format=png&auto=webp&s=7ee97e5031e4c807f595d8fd962f405459ea800f\n\nTitle: Pirate Hunter (I expect to see a lot of Zoros with this)\n\nText only Emote: Arr\n\nLegacy Title: Privateer\n\n**Cartel Market**\n\n[Armor of the Fallen Master](https://preview.redd.it/2kesxhxvfvxc1.png?width=1920&format=png&auto=webp&s=9afa3d475e59010de8b3b8324723edf8ad873e9e)\n\n[Fallen Master Hair and Beard Customizations](https://preview.redd.it/yl7k855zfvxc1.png?width=1920&format=png&auto=webp&s=db628bf1e75608f7ba5fe25be23c3086ddd12d4d)\n\n**Nar Shaddaa Nightlife**\n\n[High Stakes Squadron Helmet](https://preview.redd.it/uoxlwgd3gvxc1.png?width=1920&format=png&auto=webp&s=13cad54aa6182566e75eb96ab70229c665b0911f)\n\n**PTS**\n\n7.5 will be on the PTS (soon).",
        "num_comments": 99,
        "comments": [
            "Damn, I actually quite like most if not all of the armor sets this update. Also nice to get some new hair.",
            "Lmao warzone adrenals and medpacs added to the rewards for PvP seasons? We have thousands of those already",
            "Can we get a Hutt companion?!?",
            "I like that the helmet has a transparent visor. There are SO few helmets in the game that would actually protect your head, provide eye protection, and don’t block your eyes in cutscenes.",
            ">Electrocuting random fish while you sit on a blanket\n\nAh, yes, just like the ancient pagans did before Christianity.",
            "Fuck, modernized Hutta actually looks phenomenal.",
            "Who is the Fallen Master they refer to?",
            "i'm really interested in the new ventures thing they're doing since i'm a solo player. granted i've not done the \"in between\" content yet and don't plan to until either the mandalorian story line is concluded or the next expansion is released.",
            "I like yellow Hutta though 🥹",
            "Oh no, a PVP season armor reward I actually like and want? As a solo/story only player this will wreck me...\n\nThe Basilisk is amazing though, love it already"
        ]
    },
    "Got Questions? SWTOR Questions & Answer Thread + New & Returning Player Posts (week of Jun 24, 2024)": {
        "title": "Got Questions? SWTOR Questions & Answer Thread + New & Returning Player Posts (week of Jun 24, 2024)",
        "score": 5,
        "url": "https://www.reddit.com/r/swtor/comments/1dn000u/got_questions_swtor_questions_answer_thread_new/",
        "content": "Feel free to ask any SWTOR related questions in this thread!  \nNew & Returning Players are also welcome to post their introductions here too.  \n\n - - - \n\n##SWTOR Frequently Asked Questions  \n\n* [Is SWTOR Worth trying?](https://www.reddit.com/r/swtor/comments/fcflez/is_swtor_worth_trying_in_2020/?sort=random)  \n* [Should I Subscribe to SWTOR?](https://www.reddit.com/r/swtor/wiki/subscriber#wiki_should_i_subscribe_to_swtor.3F)   \n* [Common Technical Issues (crashing, black screen, etc)](https://www.reddit.com/6cyjvx)\n* [Which Class Should I Choose? Best class? Viable classes?](https://www.reddit.com/r/swtor/comments/7zh9qy/which_swtor_class_should_i_play_player_opinions)  \n* [What should I spend my Cartel Coins/CC on?](https://www.reddit.com/r/swtor/search?q=title%3Awhat+%22cartel+coins%22&restrict_sr=on&sort=new&t=all)  \n* [Free to Play / Preferred / Subscriber Differences](https://www.reddit.com/r/swtor/wiki/f2p)  \n* [Find a Guild/Group to Play With](https://www.reddit.com/r/SWTORGuilds/comments/btqsla/how_to_find_a_guild_to_play_with_in_swtor) \n* [How do I start the next quest or expansion? What's next in the story?](https://www.reddit.com/r/swtor/wiki/story)\n* [Ultimate 6.0 Link Guide](https://www.reddit.com/r/swtor/comments/eix2s6/ultimate_collection_of_links_to_guides_discussion)\n\n- - - \n\n##The State of SWTOR  \n\n* [Expansions and Updates](https://www.reddit.com/r/swtor/wiki/returning_player/expansions)\n* [Major Game Changes & the Current State of SWTOR](https://www.reddit.com/r/swtor/wiki/major_changes)  \n* [Story Order Guide & Solo Guide](https://www.reddit.com/r/swtor/wiki/story)  \n* [The State of Player vs. Environment (PvE): Dailies, Flashpoints, Uprisings & Operations](https://www.reddit.com/r/swtor/wiki/returning_player/pve)\n* [The State of Player vs. Player (PvP)](https://www.reddit.com/r/swtor/wiki/returning_player/pvp/ground)\n* [The State of Galactic Starfighter](https://www.reddit.com/r/swtor/wiki/returning_player/pvp/space)\n\n- - -\n\n##Free Stuff  \n\n* **Free Pet, Mount and Flair Codes:** Go to [https://account.swtor.com/user/codes](https://account.swtor.com/user/codes) Enter these codes separately to get some free mounts and pets! *NYCANTINA19* (free flair), *SWCELEBRATION17* (M8-3R Droid Pet). Note these codes eventually expire, but we don't know when. Please [contact the mods](https://www.reddit.com/message/compose?to=%2Fr%2Fswtor) if they no longer work.",
        "num_comments": 66,
        "comments": [
            "Does recruiting people for the Alliance base (via the alerts in the \"Companions & Contacts\" tab) in KOTFE impact the story or player character in any way, or is it just something to do for more xp? Does the base's survival depend on me completing those? The dying doctor and arena wookie are really annoying to get to affection level 10.",
            "Is there any good source for actual break down of attributes and what they do. I can find loads about what each class should focus on but I have a hard time finding how much 1 point of mastery gives vs 1 point of power",
            "I really want to transfer servers, but posts and forms from years ago says that all my different outfits that I had saved would all be lost in the process. Is it still true today?\n\nI'm a returning player btw. Started playing again after 4 years.",
            "Do relics still function. I'm seeing some posts saying they don't work during leveling.",
            "Do relics still function. I'm seeing some posts saying they don't work during leveling.",
            "I can't seem to be able to start the ilum quest. I already completed Shadow of Revan just to progress but wondering if I can still do Ilum. The twilek on the fleet says I have \"unfinished business on corellia.\" My class story is done, anything else I need to do on corellia?",
            "Question regarding the gear track to 340. I know you can do it via Flashpoint gear, FP-1 Stabilizers, etc. I am wondering though, is there a way to do it through Conquest Coms? You can get a green 324 set with either currency, so I assumed that I could do the full upgrade path with Coms and was just missing something",
            "regarding the weekly reputation cap is there a fixed time where you can start earning reputation again or is it individual based on the time in the week when you hit the cap",
            "I am aware of the canon size of the XS light freighter but I personally find it really hard to believe that is it as large as it's claimed to be, any one here crunched the numbers?",
            "WIll the new pink/gold pearly color from the Galactic Season be added to my collections or is it a one-time, one character item?\n\nThanks for any answer."
        ]
    },
    "Fun Fact: The Acolyte had the first Live-action depiction of a Selkath, a species first introduced in the \"Knights of the Old Republic\" game": {
        "title": "Fun Fact: The Acolyte had the first Live-action depiction of a Selkath, a species first introduced in the \"Knights of the Old Republic\" game",
        "score": 107,
        "url": "https://i.redd.it/gchmqgzdjg9d1.jpeg",
        "content": "",
        "num_comments": 17,
        "comments": [
            "That looks *surprisingly* good for something in a DSW show.",
            "Have they had a mention of kolto yet?",
            "Oh no...",
            "It is really good.",
            "What’s that supposed to mean?",
            "What, the Selkath, or The Acolyte? If it's the former, I'd agree, but if it's the latter, having seen a bit of it... ehhhhhhhh, I can't really agree.",
            "That they know about the Old Republic and are coming for us next.",
            "Man some of my friends are growing grey hairs because either last or lastlast episode had the best fightchoreography in DSW, or at least some of the best.\nOtherwise shit show though but made them feel conflicted for liking it, then again the choreography for the Prequels were praised pretty well too, even with the flaws people found.",
            "planet from swtor was already referenced in andor during the prison sentencing scene",
            "I mean they had the fight choreographers from the Kingsman and Daredevil on it. It’d be hard for it not to be good but imo the fact that it implements so many actual Star Wars lightsaber combat moves while still felling grounded and gritty is impressive. You can see when Smilo Ren swaps from Form II to Form V or Form VII. Also his use of Trakata, Cortosis, and Dun Möch were a nice addition. \n\nI don’t like the show but I have to give props that this episode is a standout in Disney Star Wars, which I mean isn’t saying much considering how many shitty duels and fight scenes we’ve had since they through them in as flashy filler now when they have no idea what else to put in. It has weight to the story, there’s immense plot relevance, multiple main characters die, and it’s a turning point in the plot. \n\nNow I just want Smilo Ren’s armor in SWTOR. He’s imo how I view my Sith Warrior fighting, a literal beast in combat that has elegance and is smart. Juyo (Form VII) is all about channeling emotions to allow the acrobatics of Form IV while also having very strong and unpredictable, almost bestial, attacks. It’s the quintessential Sith lightsaber form and I’m glad to see it portrayed so well. \n\nAlso this is probably the first Disney Star Wars project to get the Sith right. They aren’t just mustache twirling villains, they’re obsessed with the Jedi and control. The Sith have a twisted social darwinistic view, thinking that those with power deserve to control those without and the Jedi restrict their freedom to do so. However just as the Jedi code ironically breeds fear of the dark side the Sith code makes the Sith slaves to their passions while claiming to free them. That’s why so many Sith become sadistic madmen, they’re enslaved to their deepest desires and thoughts most people would ignore."
        ]
    },
    "How have I not played the dlc until now": {
        "title": "How have I not played the dlc until now",
        "score": 206,
        "url": "https://i.redd.it/48280vkxmd9d1.jpeg",
        "content": "If I had known I would get speech options like this I would’ve gotten the dlc stuff ages ago",
        "num_comments": 10,
        "comments": [
            "When does this happen, I need to replay it",
            "Now if only that's what you actually said",
            "Fym nuh-uh?!",
            "Which one is it? I’m a newb to this game",
            "It’s on shadow of Revan when you’re in the republic bunker on Rishii, if you lie and tell them the sith are planning on betraying them you get these two",
            "I'll never forget the time my Sith Warrior said of >!Jaesa!< on Tattooine: \"I'm going to do much more than *touch* her...\"\n\nI immediately thought \"my guy, this is a game for kids, you can't be talking like that...\"",
            "I wish",
            "Shadow of revan, on rishii in the bunker infiltration section on the republic bunker, if you lie to the guy and tell him the empire is planning on betraying them you get two gems of different make",
            "More proof Shadow of Revan is peak",
            "Really took it for granted back in the day especially compared to what came after."
        ]
    },
    "Malavai Quinn fanart": {
        "title": "Malavai Quinn fanart",
        "score": 273,
        "url": "https://i.redd.it/nfu1rh435d9d1.jpeg",
        "content": "Malavai Quinn commissioned from MarseilleCraft (username here on reddit, patreon [here](https://www.patreon.com/MarseilleCraft)). \n\nNow I need a version of him in his fifties… I keep you updated ❤️",
        "num_comments": 28,
        "comments": [
            "Wow he is just as pretty as he is in the games.",
            "Oh no!! He's *hot*!!",
            "Fuck Malavai Quinn. All my homes hate Malavai Quinn.\n\n(Great art tho)",
            "Where's the lightsaber-shaped hole?",
            "okay fineeeee >!he can betray me again !<",
            "Would forgive this man for anything…",
            "Yassified traitor. *ignites lightsaber with malicious intent*\n\nEdit: very good job on the art tho",
            "KILL HIM (Great Pic, btw) ... but ... KILL HIM!!!",
            "I'm noticing a lack of suffocation indicators (I force choked the shit outta him)",
            "Dang he cute 👀"
        ]
    }
}