{
    "Sydney Daily Random Discussion Thread 29/06/2024": {
        "title": "Sydney Daily Random Discussion Thread 29/06/2024",
        "score": 0,
        "url": "https://www.reddit.com/r/sydney/comments/1dqpmlg/sydney_daily_random_discussion_thread_29062024/",
        "content": "Welcome to /r/Sydney. Feel free to use this thread to chat, self-post, or ask questions.\n\nNew to this subreddit? [Our wiki](https://www.reddit.com/r/sydney/wiki/index) has lots of good info on getting around Sydney, what to do when you visit, where to eat, and more.\n\nUsing a third party app or desktop view on mobile and can't read the sidebar? Please [**have a look here**](https://docs.google.com/document/d/1yt_ZZ7Y686kU1kdEOq0HOrXZNY56E1-r85nDgfB412o/edit) first ಠ⁠_⁠ಠ\n\nIf you're new here, please read [the answer to pretty much every self post](https://docs.google.com/document/d/1yt_ZZ7Y686kU1kdEOq0HOrXZNY56E1-r85nDgfB412o/edit), [reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439) and [self promotion](https://www.reddit.com/wiki/selfpromotion#wiki_here_are_some_guidelines_for_best_practices.3A).",
        "num_comments": 25,
        "comments": [
            "Just heard from a friend who was laid off by his employer. When he told me the circumstances a while ago I pointed out that they were doing something very dodgy and probably desperate to do it by the 30^th of June as well. He brought up my barrack-room-lawyer objections with them and guess what, they're paying him a whole extra months salary just to keep his mouth shut.",
            "It seems like I have got my teenager a lead on a good part-time job just through connections at Parkrun. This is how all those years of dragging ourselves out of bed at 6:30 AM in the cold and the rain have paid off.\n\nNot just a connection to someone but that someone is also a Parkrun person who will appreciate the dedication (and volunteering) because they've done it themselves.",
            "Its forecast to be another week of cold rain, boooooo",
            "I remember when Red Rooster had a Boomerang toy a decade ago. I didn't think it would work, and son of a bitch, it actually came back.",
            "So hot gossip from the Parkrun world, Pirrama Park Pyrmont Parkrun is conducting some load testing runs through July and should be opening soon after.\n\nThere's always been a bit of a city blackspot with Centennial and St Peters the closest to the city. Great Harbour front location.",
            "Best spot in the CBD for some bacon and eggs?",
            "Intermittent Sunshine today, everyone - Better make the best use of it!! :)",
            "Just watched Jubbs win a wrestle by doing nothing but laying on top of Bobs ",
            "Just heard a bunch of BANGs coming from the south? Am in the Forest area.",
            "Neighbour's parked their totaled car on the street in front of my house. It's been there for a week. What can I do?"
        ]
    },
    "Come to Ryde, stay for the hole": {
        "title": "Come to Ryde, stay for the hole",
        "score": 281,
        "url": "https://i.redd.it/rbc6meikyf9d1.jpeg",
        "content": "Funny how it was called “the new heart of Ryde”",
        "num_comments": 72,
        "comments": [
            "Whats supposed to go in there?",
            "how long has it been like that? is the civic building gone?",
            "Put some broken flashy light bulbs on the ground next year and call it a vivid installation, and charge $10 a pop they will get their funding so fast, I promise\n\nBetter if they can float in the water",
            "You know something's gone creatively bad when you're left with a swamp at the *top* of a hill.",
            "Havent been to top ryde in a long time",
            "How dare you talk about such a glorious smelling hole like that.",
            "Its a bit of a planning tragedy, this one. Council wants it apartment-free with some great features and facilities. Has anyone got a spare $100m?",
            "Didn't that hole used to be a service NSW?",
            "Sorry, I can't come, I don't have a ticket to Ryde...",
            "What is the toxic waste in that hole that's going to cost millions of dollars to remediate before they do anything else?"
        ]
    },
    "The World’s Least Affordable Housing Markets in 2024": {
        "title": "The World’s Least Affordable Housing Markets in 2024",
        "score": 87,
        "url": "https://i.redd.it/qg25g1w2w99d1.jpeg",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Sydney isnt a city I recognise anymore sadly. As someone who aspired to own a house here my chances are slim to none. An apartment still is super expensive and unaffordable in areas Ive grown up in.\n\nIts a sad reality that many of us consider leaving due to how fucking expensive its become.",
            "So not number 1, we have some room to grow",
            "Just wanted to point out that this survey only covers 8 countries as stated in very fine print at the bottom.\n\nYes, the housing market sucks and is most likely one of the worst ones in the world. The headline is misleading, though.",
            "I love this city, shame housing so expensive.",
            "Im surprised Adelaide beat out Brisbane",
            "Across 8 countries? Not a big range..",
            "In 20 years there will only be 8 countries left.",
            "I know right. I can still get worse.",
            "If we all work hard this year, we can reach no. 1 next year. Go Sydney!",
            "This guy with his actual critical thinking and checking sources. We're here to rage, not learn."
        ]
    },
    "Why are Sydney bus drivers so erratic with their driving?": {
        "title": "Why are Sydney bus drivers so erratic with their driving?",
        "score": 106,
        "url": "https://www.reddit.com/r/sydney/comments/1dr6wpf/why_are_sydney_bus_drivers_so_erratic_with_their/",
        "content": "The bus drivers tend to accelerate hard and break hard. It feels like sometimes they’re trying to run orange lights and then end up needing to brake hard.\n\nHonestly feel car/ motion sickness a lot when taking buses cause of this. \n\nHas this generally been your experience ?",
        "num_comments": 52,
        "comments": [
            "Bus will blow up if they dont maintain 50mph",
            "Its been like this since the dawn of time. Its because theyre running late due to Sydney traffic, so they try to make up time. I actually feel bad for them. People are unhappy if the bus is late, but its not the bus drivers fault that theres bad traffic.",
            "I cant speak for all drivers but I have to drive a bit harshly sometimes to meet the ridiculously tight timetables, especially at night. If you take a look at TripView timetables youll understand. Otherwise Id always drive as smoothly as I can as I regularly take buses too and understand the passengers pain. Also our breaks between each trip are only a few minutes so if we run a few minutes late then we wont have little to no break. I feel bad for all the new drivers as theyre constantly running late and not having their breaks between trips to make up time.",
            "Most of them, yes. Occasionally you get a good one who drives normally. \n\nI'm not sure if their KPI includes on time running. If so it might explain the erratic driving.",
            "Privatised, trying to put on as many services so they look like they are doing a good job. I'd say having very tight runnings for the drivers to get extra runs. Also conditions went to shit so most of the experienced drivers left, now they will hire anyone. Drivers in my area don't even have uniforms most the time",
            "Ah, I see you have met the driver Jerky McJerk-Foot.\n\nYep, a really common occurrence unfortunately.",
            "The last time I rode a bus I felt nauseous at the end of the trip ",
            "There was a huge push for more bus drivers recently, they're probably the wave of new recruits.",
            "You dont need a PhD or alot of experience to drive a bus coupled with extreme demand for drivers tends to lower the standard alot. Worth noting that they have a timetable to adhere too as well so the whole conservation of momentum thing for heavy vehicles goes out the window as well.",
            "I get motion sickness as it is and couldnt agree more with you. The number of times Ive nearly vomited from the erratic driving from the bus driver. They also dont realise people who are standing go flying from the hard brakes and acceleration!"
        ]
    },
    "Sydney family lucky to be alive after inhaling carbon monoxide from outdoor BBQ used to heat home": {
        "title": "Sydney family lucky to be alive after inhaling carbon monoxide from outdoor BBQ used to heat home",
        "score": 100,
        "url": "https://www.abc.net.au/news/2024-06-29/sydney-family-use-bbq-as-indoor-heater-inhale-carbon-monoxide/104039702",
        "content": "",
        "num_comments": 50,
        "comments": [
            "My husband worked at Bunnings and said he would have to tell way to many people that they couldnt use these inside",
            "I tried studying to be a teacher a few years ago because I genuinely believed a lack of education was responsible for a lot of what's wrong in this world. The usual manifestations I cite are bigotry, tribalism/other-ism, disregard for nuance, glorifying of ignorance.\n\nThen I see shit like this and go \"oh okay, I guess we're doing this now\". What the actual fuck guys.",
            " Ive seen other posts on this incident and a lot of comments mention these people are stupid but I just want to say - Australian houses can be absolutely freezing and I bet they were desperate to warm up.\n\nI think world health organisation set a temp for whats considered acceptable in living conditions and most Australian homes dont meet it.",
            "This happens at least once every winter.\n\nI'm not saying this is responsible behaviour, but ffs, we should be able to afford heating.",
            "This article should be re-titled:\n\nSydney family lucky to be alive after, lacking high-school level scientific literacy, nearly poisoning themselves",
            "What the actual fuck. \n\nIm at a loss for words.",
            "Every winter a story comes out about a family dying from inhaling carbon dioxide from their bbq used as a heater",
            "I work retail in Wenty, deal with the locals everyday, let's just say there's not a lot of brain cells going around, plenty of ice and coke though...",
            "\"Best explanation I can think of is they had a BBQ anyway, and decided to bring it inside?\"\n\nGiven they've survived, I'd say thats the case. Given, how much more they smoke at the start I don't think anyone is doing that inside.",
            "\"I've got a great way to ease cost of *living*\"\n\n\"Why are you emphasising living?\""
        ]
    }
}