{
    "Weekly 'I made a useful thing' Thread - June 28, 2024": {
        "title": "Weekly 'I made a useful thing' Thread - June 28, 2024",
        "score": 8,
        "url": "https://www.reddit.com/r/sysadmin/comments/1dqg1tz/weekly_i_made_a_useful_thing_thread_june_28_2024/",
        "content": "There is a great deal of user-generated content out there, from scripts and software to tutorials and videos, but we've generally tried to keep that off of the front page due to the volume and as a result of community feedback.  There's also a great deal of content out there that violates our advertising/promotion rule, from scripts and software to tutorials and videos.\n\nWe have received a number of requests for exemptions to the rule, and rather than allowing the front page to get consumed, we thought we'd try a weekly thread that allows for that kind of content. We don't have a catchy name for it yet, so please let us know if you have any ideas!\n\nIn this thread, feel free to show us your pet project, YouTube videos, blog posts, or whatever else you may have and share it with the community. Commercial advertisements, affiliate links, or links that appear to be monetization-grabs will still be removed.",
        "num_comments": 10,
        "comments": [
            "this will be an off topic, but, i need help with a capstone project for my masters. i'd like to conduct a comparative study in regards to two software firewalls. what are the software firewalls that gets compared usually?",
            "We used to do Ascii art in Typing class. tab tab space space.",
            "> You can DM me\n\nOr you can post a link here so we can all learn.",
            "I'll share it on github. Didn't publish it yet.",
            "Im sorry. Full stop\n\nYou are so good to stop that kinda tshooting. Misfire on my post",
            "Yes / no, fsrm triggers the script which blocks user access.",
            "Intune Win32 App Wrapper Powershell Script.\n\nI became sick of manually running the Intune win32 packager, so I created a script that requires far less typing and even for certain packages creates a .txt file with the some of the publishing info in it.\n\n* Put the files in a subdir under the packaging folder\n* The script has logging\n* The script shows a numbered pick list listing all the subdirs of the packaging folder\n* Enter the number you want\n* Then the script shows another numbered picklist of \\*.exe,\\*.msi,\\*.msp,\\*.ps1,\\*.bat,\\*.vbs and \\*.cmd files in the specified folder\n* Enter the number you want\n* The script then asks if you want to copy the original files to a content repo for backup\n* Uses the intunewin wrapper utility to create the .intunewin file in a folder, name: \\[app name\\] + \\[timestamp\\]\n* Script extracts some package info and puts it in a .txt file for .exe, .msi and also from the publishing variables of the PSADT in the Deploy-Application.ps1 file.\n\nNow wrapping up Intune win32 apps is a breeze and I also have a backup of the original files. Being so used to SCCM, and being able to just look in the SCCM content repo to see what files version or scripts are in there is really handy, hence why I like copying the original files to a repo before Intune encrypts them in the intunewin file.\n\n",
            "> Everytime a file with a suspicious file extension is beeing written on a file server, the script gets triggered.\n\nCan't people do this with the built-in File Server Resource Manager?",
            "I scripted a ransomware detection with powershell. Everytime a file with a suspicious file extension is beeing written on a file server, the script gets triggered. If you trigger it, for example 5 times in 1 minute, the script blocks access to the share for that user.\nFor now we luckily only had false positives, but in those cases it worked great \n\nYou can DM me for the script and details for installation.",
            "I realize this isn't the most syadminy-tool ever. However, in the old days, sysadmins used ASCII art extensively on shell servers, in documentation, etc.\n\nDurdraw ([homepage](https://durdraw.org)/[github](https://github.com/cmang/durdraw)) is my little, but growing, project. It is an ASCII and ANSI Art text editor for drawing in the Linux/Unix/macOS  terminal, with animation, 256 and 16 colors, Unicode and CP437 character encoding, and  customizable themes.\n\nSorry, it doesn't run on Windows yet without WSL. In due time, perhaps. \n\nHere is a [video tutorial](https://www.youtube.com/watch?v=vWczO0Vd_54) I made for it."
        ]
    },
    "Patch Tuesday Megathread (2024-06-11)": {
        "title": "Patch Tuesday Megathread (2024-06-11)",
        "score": 68,
        "url": "https://www.reddit.com/r/sysadmin/comments/1dd65v4/patch_tuesday_megathread_20240611/",
        "content": "Hello [r/sysadmin](https://www.reddit.com/r/sysadmin), I'm /u/AutoModerator, and welcome to this month's **Patch Megathread!**\n\nThis is the (*mostly*) safe location to talk about the latest patches, updates, and releases. We put this thread into place to help gather all the information about this month's updates: What is fixed, what broke, what got released and should have been caught in QA, etc. We do this both to keep clutter out of the subreddit, and provide you, the dear reader, a singular resource to read.\n\nFor those of you who wish to review prior **Megathreads**, you can do so [here](https://www.reddit.com/r/sysadmin/search?q=%22Patch+Tuesday+Megathread%22&restrict_sr=on&sort=new&t=all).\n\nWhile this thread is timed to coincide with Microsoft's [Patch Tuesday](https://en.wikipedia.org/wiki/Patch_Tuesday), feel free to discuss any patches, updates, and releases, regardless of the company or product. **NOTE:** This thread is usually posted before the release of Microsoft's updates, which are scheduled to come out at 5:00PM UTC.\n\nRemember the rules of safe patching:\n\n* Deploy to a test/dev environment before prod.\n* Deploy to a pilot/test group before the whole org.\n* Have a plan to roll back if something doesn't work.\n* Test, test, and test!",
        "num_comments": 268,
        "comments": [
            "Pushing to 18,000 endpoints tonight, will know tomorrow morning if Im still hired.\n\nEdit: looking excellent this morning, Im still employed too!",
            "No guts, no glory. Pushing out to 2500 endpoints as soon as it drops. Testing is for suckers.",
            "First month making my intern do all the patching.  Ready for all kinds of issues.",
            "In the name of security, approve all, deny nothing.",
            "Lets break some stuff boys.",
            "What is the best way to get notifications about known issues, like when they pulled KB5037765 last month? Not necessarily direct from MS either.",
            "KB5039212 broke *ticket printing* in our environment.  Only from our ticket software (a product called Tessitura) to our ticket printers.\n\nEnjoy.",
            "Does threat actor have to be on the same wifi network or just have to be within wifi range?",
            "Is there a POC for this exploit?",
            "Anyone seeing issues with SharePoint links sent within the Outlook client after June's updates related to Trust Center?"
        ]
    },
    "25 years of technical debt Part 2: Welp, I got fired": {
        "title": "25 years of technical debt Part 2: Welp, I got fired",
        "score": 628,
        "url": "https://www.reddit.com/r/sysadmin/comments/1dqxcv8/25_years_of_technical_debt_part_2_welp_i_got_fired/",
        "content": "A lot of folks over in my [original thread a few weeks ago](https://old.reddit.com/r/sysadmin/comments/1dcwki9/25_years_of_technical_debt_and_an_incompetent_it/) wanted a \"part 2\" to the saga\n\nAfter raising the concerns I discussed that we'd never make the September audit timeline, a new \"plan\" was hatched by the executive team. ***Delay***\n\nThe official line on SOC 2 compliance was to be \"we're not compliant ***\"yet\"*** but we're \"making demonstratable progress toward it\"\n\nDemonstration of this \"progress\" was to be by writing policies and procedures. As a seeming warning of things to come I was put directly at the head of this task. Matching titles in pre-existing policies by our security vendor to employees (most being the incompetent IT director)\n\nWriting ***procedures*** proved significantly more difficult. Simply because we lacked the technical capability to perform them. Procedures such as \"onboarding a new user\" consisted of the IT director running VNC on each server, opening `/etc/passwd` in gedit and hand-writing an account for them. On each server, manually. Offboarding was seemingly done by just expiring their password to break logins. \n\n\nAs a result during this I was still largely performing Sysadmin tasks where possible. Particularly as my own boss was still heavily using up his \"25 years of stored PTO\". Anything to at least push toward SOC 2 compliance. Migrating some databases from Windows 7 machines turned servers to Ubuntu 24.04 VM's (IBM DB2 is *horrible* to work with!) being a particular thorn that would come back to haunt me later.\n\nOn the surface everyone seemed rather happy with the work performed, particularly our developers. Being able to move from VNC'ing into Windows 7 to having a modern Linux machine with MariaDB, MS-SQL and IBM DB2 all running concurrently made database work between the developers a comparative breeze.\n\nUnfortunately, cracks were forming below the surface. The 15 year old server I'd re-purposed to run Proxmox on had its (SATA II era) SSD begin to fail. The I/O errors caused the system to become unresponsive and the developers lost several hours of work as a result. (the boot disk wasn't in a RAID array, fortunately the VM storage was)\n\nI was thankfully able to force a hard reset by poking some kernel values (`reboot` and most other commands on the terminal would just hang) \n\nAfter reboot I initiated a live migration (thank you Proxmox!) while the developers began restoring their work. At the same time I submitted a request for four new SSD's for the aging server. Explaining it had crashed, caused developer downtime etc. Despite being a $150~ purchase this was put on hold by the acting director/CFO until my boss had returned to confirm it was a \"justifiable course of action\" (my boss was presently on PTO for several days, delaying the response)\n\nIn the interim I had migrated the VM's to a presently unused server. One my boss had built himself to run \"AI\" (read: \"GPT4ALL\") with. \n\nHe had slapped a mid-range Threadripper with a half terabyte of RAM, buckets of NVME storage and two Nvidia RTX 4090's into a bitcoin mining rig looking frame (he's ***huge*** into crypto). Due to his...\"general incompetence\" it was running an extremely outdated version of Fedora (I think like Fedora 32?) and was largely unused by other members of staff. (we *had* a paid OpenAI license anyway, what was the point?)\n\nBack at the end of April he had decided he would \"likely scrap it\" due to the issues he had and finding that it was unused by anyone else for months. This first started in a clownish attempt to upgrade the system to fix it. To which he later came in and ranted \"Nvidia broke the drivers so fans won't spin to make people buy new graphics cards!\" a fact I vehemently disagreed with, and would also come back to haunt me later.\n\nThis server was wiped and reprovisioned with Proxmox. Ubuntu 24.04 seemingly fixed the GPT4ALL problem. Passing the GPU's through worked fine, though my boss felt it was \"slower\". It was agreed to not be a priority and shelved for later performance tuning.\n\nFast forward to this past Monday, June 24th. I get a message from my boss asking about the VM's on the GPT server. I reminded him that the other Proxmox server is out of commission and explain the workloads were transferred there. \n\nHe makes a remark about \"learning Proximus\" and reinstalling Debian to get his GPT4ALL pet project working again. I make a remark privately to friends that I fear he's going to wipe out the physical host the VM's are running on instead of just spinning up a new VM\n\nThe next day (Tuesday, June 25th) I get an alert at about 9:00 PM from Teams asking \"where'd the SQL VM's go? I can't ping them\" \n\nI reply that I'll log in and check\n\nNo response on ping. Let's check Proxmox\n\nThe VM node itself is down...\n\n#...why is the entire VM node down?!\n\nI call my boss in a panic and ask if he was at work that day. He says \"No\". I mention that the Proxmox machine was unreachable. \n\n\"Weird. I just worked on that yesterday!\"\n\n\"What did you do, exactly?\"\n\n\"Yeah I had to reinstall Debian 9 times to get it to work!\"\n\n\"You installed Debian...over Proxmox?\"\n\n\"Yeah I dunno why it took so many tries I have the same setup at home and it just worked\"\n\n\"...That machine had our developers SQL VM's on it. With no backups\"\n\n\"Wait but that should all be on [old VM server] right?\"\n\n\"...I told you both verbally and by email that machine is down for repairs. The VM's were migrated to [server he reinstalled] temporarily\"\n\n\"Oh man...I really screwed the pooch on this one. I'm sorry\"\n\nI send out a rather frank email to my boss, the CFO and other leadership requesting to schedule a meeting to discuss planning building a *VM backups* server. Citing this specific incident (generously referring to it as a \"mistake\" on my bosses part)\n\nAs we had previously had meetings about implementing systems to enable writing processes (like having...any form of backups) I thought nothing of it and went to bed.\n\nThe next day I awoke to my boss declaring \"All IT work is to be suspended pending investigation. Only do SOC 2 policies for now\"\n\nIn a meeting with myself, my boss and the manager in charge of the development team I stepped through the confluence of events that lead to my boss nuking the VM host. He argued that he only did it because \"the Nvidia fans still weren't spinning! that means it was still broken!\" \n\nI countered that we'd discussed that back in May and I'd explained (and demonstrated) that computer hardware will spin down fans at idle. He had originally accepted that explanation but had either forgotten or disagreed with it now. A fact that made him increasingly incensed during the call. \n\nMy boss announced he would be going in that day to \"reinstall Proximus\" on ***all*** the impacted servers, as well as setting up the VM's again for the developers to run their databases on.\n\nConcurrent to this I was suddenly messaged by HR asking me to \"take the day off\" pending what was initially described as an \"infrasec security incident\" and later re-worded to a \"policy review\"\n\nAfter receiving the message. this \"day off\" was extended to the rest of the week via formal email. \n\nFor those playing at home you can probably tell what's coming next.\n\nLater that same day my access to Outlook/Teams was revoked. This unfortunately prevented me from creating a detailed timeline of exactly what had happened and how much of it was specifically the fault of my boss. \n\nI wrote to HR via text message specifically requesting a meeting with the executive team as I believed (and stated) that I was thrown under the bus about this incident. This message was not replied to. \n\nToday I was invited to a meeting via my personal email and formally terminated. The reason given being \"the executive team decided you weren't a good fit for the role\"\n\nWhen I pressed what exactly they took issue with, HR replied they were \"not privy to that information. And it's an at-will state anyway so it doesn't matter\"\n\nI reiterated that I had requested a meeting with the executive team based on what I felt was willful negligence on part of my boss. This was denied with \"the decision was already made and is final\"\n\nI absolutely realize that any speculation I make about the fate of the company going forward will be dismissed by many as \"sour grapes\" over my own termination. So please spare me that kind of reply.\n\nI will however say that anybody reading this post if they're able to connect the dots, either before or after being hired:\n\nYou can't fix stupid. Don't try and be a hero. Just start looking for a new job elsewhere",
        "num_comments": 312,
        "comments": [
            "if they can't afford to buy a hard drives and need a second opinion I wouldn't want to work for that place. not sure why you're trying to go back.",
            "A CFO gets involved of 4 x $150 purchase?\n\nThat company has to be dog crap and going under, surely",
            "The fact that the c-suite was happy to let your boss go out on PTO within 90 days of a major compliance deadline indcates they are complicit in the stupidity. You seem like a talented and driven individual who likes a challenge (maybe even to a fault). You can do better. Try not to lose sleep over this one.",
            "You got fired because some fans didn't spin all the time.\n\nWild times at this dumbass company indeed.",
            "You have hopefully learned an important lesson: dont work for someone you dont respect at a technical level. Thats not to say you should never work for someone who has fading technical knowledge, that is common with management, but you should steer clear of those who are too ignorant to get out of their own way lest you get thrown under the bus for their ineptitude.",
            "You probably dont feel this way right now, but you were just given the biggest gift of your career. You now know what to look for in an unhealthy company. Interviews are a two way process, you need to ask questions and understand the environment youre potentially going into.\n\nTheres zero chance theyre passing an audit anytime soon, and if theyre waffling on $150 worth of hard drives, theyre either broke or IT isnt being viewed as a force multiplier. If theyre implementing SOC 2 its because theyre finally losing sales due to vendor management.",
            "I thought this was a shit post. I still think it's a shit post. I really hope it's a shit post.",
            "wtf kind of IT shop is this? Nobody should run a business that way!",
            "Your former company's environment is less robust and secure than my homelab, by the sounds of things...and I'm not even a technician in any capacity",
            "This was constructive dismissal (yes, even in at-will states this is illegal) and you can sue your employer. Contact an employment attorney. It's just a free phone call and if they'll tell you whether you have a case.\n\nMake them regret this!"
        ]
    },
    "Microsoft just seems to have ok'd piracy": {
        "title": "Microsoft just seems to have ok'd piracy",
        "score": 117,
        "url": "https://www.reddit.com/r/sysadmin/comments/1dr5feq/microsoft_just_seems_to_have_okd_piracy/",
        "content": "[Microsoft AI CEO: Web content is ‘freeware’](https://searchengineland.com/microsoft-web-content-freeware-443775)\n\nIf anything on the Web is fair game including stuff behind paywalls & robot.txt I guess I can scrape all their source code and any downloads available from their websites & just pass them off as my own.\n\nI'm going to need a bigger NAS\n\nEdit : The sysadmin community on reddit is stunning. \nPosts are amazingly employer dick sucking \"oh yeah I'll do that free overtime for you \n\nThere seems to be a total lack of giving a shit of a tech firm does anything.\n\nIt's ok for anyone else's work to be stolen & jobs to be removed but \"how are we only earning 1/3 of what guys before earnt \" posts...\n\n",
        "num_comments": 48,
        "comments": [
            "It's OK. The internet will close up, move content behind closed doors and this will die down eventually - or - in other words: just let it happen and it will all be over soon.",
            "No but arguably you can take it and train a model of it to create new content",
            "Sure dude if you can host some manual pages or msis thats all traffic microsoft wont have to serve, go for it as far as theyre concerned",
            "Devil's advocate: If the web archive can copy, store, and reproduce copies of website data, why can't Microsoft?",
            "It's ok to steal, just not from them?",
            "He's right. Yo ho ho.",
            "Yes, if you publish it to a public facing web page it's definitely fair game for whatever. You don't get to eat your cake and have it too.",
            "Technically, if you download their code off Github or any other repositories, it is indeed freeware, subject to the licenses under which they are made available. Freeware does not mean free for unrestricted use.",
            "He thinks Ms should be allowed regardless of the robots.txt & the wishes of the content owner.",
            "I disagree.\n\nNow, if you'll excuse me, I'm about to meet Jimi Hendrix to go pony trekking under the sea."
        ]
    },
    "Finding out another engineer is fired before he is": {
        "title": "Finding out another engineer is fired before he is",
        "score": 407,
        "url": "https://www.reddit.com/r/sysadmin/comments/1dqmi27/finding_out_another_engineer_is_fired_before_he_is/",
        "content": "Yeah, yeah, yeah.  We've all gotten the calls that we need to disable an account between 10:01 and 10:06.\n\nToday was something completely different.  I was cleaning up disabled AD accounts and testing our AD object backup solution before blowing away 300+ disabled accounts.  I see that an engineer on another team has had their regular and admin accounts disabled in the backup report.\n\nI check AD & it's still active there, but I assume this is a propagation thing or was a mistake that was reverted.  I message my manager and ask if there is something up with the user and he asks how I figured it out.  I explain I was testing AD backups before removing accounts in bulk.  He asks me not to say anything, which is fine.  This isn't my first rodeo.\n\nWhat bothers me is that his accounts are now disabled in AD, he's offline on teams.  The thing that's creepy is that it's been nearly 2 hours and no official announcement.  This is the part that kinda bothers me.\n\nAnyone else have a similar experience like this?\n\nEDIT: I knew what this was when I saw it because it's payday Friday and the end of the current pay period.",
        "num_comments": 197,
        "comments": [
            "His accounts aren't disabled yet in AD because they planned to sit with him at a specific time to give him the news, and he's not available. This happens a lot with terminations in my company. We get notification from HR that an involuntary termination is coming and to be ready to shut it down when they get them in the conference room or on Teams, and then they have to delay it because they can't find that person. (which is probably part of the reason they are being termed)",
            "Maybe he's getting a promotion and he doesn't need his engineer account access anymore.  It's not always a bad thing...\n\nOkay, now that we have laughed...  Obviously they are outsourcing all of you.",
            "At least you didn't have the engineer come to you with \"Hey, my logins don't work for some reason.  Can you check them and fix it?  I'll wait while you do.\"\n\nAwk...ward...",
            "I was the one who had to term accounts regularly at my old company. I went through a couple of downsizing/restructuring events in my time there. One of the last times, a restructuring occurred, I got a list of names and time frames of when to disable and who to give access to the data. On this particular list was the IT department head. I was so happy. I ran into my supervisor's office and told her today was a great day. She asked why. I said I can't tell you, but you will find out. I won't do into details about why I was happy they were leaving, but it was cool to be one of the first to know.",
            "A previous place I worked had a very strict policy for firings.  I was given notice and terminated their accounts and at the same time security was sent to escort the person out the door.  Then after all that a boring \"we wish this person well in all their future endeavors\" form letter was sent to the entire company.\n\nOne day a \"we wish this person well\" email went out to the company for a person that was still sitting in the same room as me.  \"WHAT THE FUCK?!?\" I hear him yell and I immediately jump on terminating his accounts.  A minute later security rushes in and hustles the guy out the door.  Turns out HR screwed up and sent the email out early.",
            "Your HR tells you when people are terminated? Proactively? I have to call them up every week and beg for a list of changes, AND schedule a quarterly meeting with them to go through the list of current employees and job titles. Its like pulling teeth to find out who got laid off or who retired. Promotions are easier because people put in tickets asking for access to stuff that they shouldnt need, and then tell us that they got promoted and now they need it. Cue another call to HR",
            "I have done terminations at past companies and sometimes its a gut punch to know someone is gone before they know. Other times I enjoy it because that person was a pain to work with.",
            "My example of this was at a small organization where the entire IT infrastructure team was just me and my boss. We started noticing that HR and Finance were having a lot of not-so-secret closed-door meetings, and could sense the impending doom. \n\nWe shared an office, so when my boss got a call from the CFO to come to his office we both knew what was on the agenda. Seconds after he left, HR came in and asked me to disable all of his accounts and those of about 10% of the office staff. It was a rough start to the day at 8:30 AM, knowing what was coming for those folks over the next few hours.",
            "This is why I always enjoy disabling my accounts myself when I leave a company. I enjoy imagining someones face when they go to do it and see I beat them to it. lol",
            "On the other side. It's scary as fuck if you are on a messaging app and the account goes disabled before your manager talks to you. Had that happen at the beginning of the pandemic when I worked for a travel agency."
        ]
    }
}