{
    "Weekly 'I made a useful thing' Thread - June 21, 2024": {
        "title": "Weekly 'I made a useful thing' Thread - June 21, 2024",
        "score": 8,
        "url": "https://www.reddit.com/r/sysadmin/comments/1dl0cn7/weekly_i_made_a_useful_thing_thread_june_21_2024/",
        "content": "There is a great deal of user-generated content out there, from scripts and software to tutorials and videos, but we've generally tried to keep that off of the front page due to the volume and as a result of community feedback.  There's also a great deal of content out there that violates our advertising/promotion rule, from scripts and software to tutorials and videos.\n\nWe have received a number of requests for exemptions to the rule, and rather than allowing the front page to get consumed, we thought we'd try a weekly thread that allows for that kind of content. We don't have a catchy name for it yet, so please let us know if you have any ideas!\n\nIn this thread, feel free to show us your pet project, YouTube videos, blog posts, or whatever else you may have and share it with the community. Commercial advertisements, affiliate links, or links that appear to be monetization-grabs will still be removed.",
        "num_comments": 1,
        "comments": [
            "Written PowerShell script to configure signatures in Outlook. If you prefer using PowerShell to set up your email signature instead of the usual Disclaimer methods, here's a script for you. This script helps to effortlessly configure email signature in 12 different cases. For example,\n\n* Configures default text signatures for all mailboxes\n* Configures custom text signatures\n* Configures HTML signatures using in-built templates.\n* Configures HTML signatures using custom templates.\n* Setting up signature for onboarded users\n* Setting up signature for user mailboxes alone and more\n\nScript download and detailed execution steps available here: [https://o365reports.com/2024/06/18/how-to-set-up-an-email-signature-in-outlook-using-powershell/](https://o365reports.com/2024/06/18/how-to-set-up-an-email-signature-in-outlook-using-powershell/)"
        ]
    },
    "Patch Tuesday Megathread (2024-06-11)": {
        "title": "Patch Tuesday Megathread (2024-06-11)",
        "score": 64,
        "url": "https://www.reddit.com/r/sysadmin/comments/1dd65v4/patch_tuesday_megathread_20240611/",
        "content": "Hello [r/sysadmin](https://www.reddit.com/r/sysadmin), I'm /u/AutoModerator, and welcome to this month's **Patch Megathread!**\n\nThis is the (*mostly*) safe location to talk about the latest patches, updates, and releases. We put this thread into place to help gather all the information about this month's updates: What is fixed, what broke, what got released and should have been caught in QA, etc. We do this both to keep clutter out of the subreddit, and provide you, the dear reader, a singular resource to read.\n\nFor those of you who wish to review prior **Megathreads**, you can do so [here](https://www.reddit.com/r/sysadmin/search?q=%22Patch+Tuesday+Megathread%22&restrict_sr=on&sort=new&t=all).\n\nWhile this thread is timed to coincide with Microsoft's [Patch Tuesday](https://en.wikipedia.org/wiki/Patch_Tuesday), feel free to discuss any patches, updates, and releases, regardless of the company or product. **NOTE:** This thread is usually posted before the release of Microsoft's updates, which are scheduled to come out at 5:00PM UTC.\n\nRemember the rules of safe patching:\n\n* Deploy to a test/dev environment before prod.\n* Deploy to a pilot/test group before the whole org.\n* Have a plan to roll back if something doesn't work.\n* Test, test, and test!",
        "num_comments": 239,
        "comments": [
            "all 30 of my VMs are good after patching... not that anyone cares :(\n\nedit: holy fucking shit, thank you for the up votes! 😭😭😭 in a thread where everyone flexing their 5k+ servers and endpoint I feel so loved 😭😭",
            "Ready to rock and roll, 11,000 servers/workstations getting patched tonight. Endure. In enduring grow strong.\n\nEDIT1: I know some people were asking about when the curl.exe updates would drop. Looks like they're included in this release, it's now 8.7.1\n\nEDIT2: Everything has been good so far. Onto the monthly optionals",
            "Pushing to 18,000 endpoints tonight, will know tomorrow morning if I’m still hired.\n\nEdit: looking excellent this morning, I’m still employed too!",
            "Just got this warning:\n\nAUTHLITE ANNOUNCE: Warning! Hold off 2024-06 Windows Update on Domain Controllers\n\nThe just-released 2024-06 Cumulative Update will make Domain Controllers stop calling the AuthLite module, thus breaking the authentication of all AuthLite Users. Please hold off installing this update, or log in with a 1-factor break-glass/emergency account to roll it back.  We are urgently investigating what this update has changed to cause the issue, and so far suspect it is probably a mistake .  See the knowledge base section of our site for more information as we learn more.\n\nAffected OS and KBs:\nServer 2022 (KB5039227) domain controllers only\nServer 2019 (KB5039217) domain controllers only\nServer 2016 (KB5039214) we are not sure yet if 2016 DCs are affected, but please assume so and hold off the update.",
            "Today's Patch Tuesday summary Digest from Action1:\n\n* Microsoft has fixed 51 vulnerabilities, no zero-days, one of the vulnerabilities, a previously identified DNS bug has a proof of concept (PoC) available.\n* Third-party: including Google Chrome, Mozilla Firefox, PHP, Azure, Check Point, GitHub, Rockwell, Veeam, Fluent Bit, and QNAP. \n\nVisit the [Vulnerability Digest from Action1](https://www.action1.com/patch-tuesday-may-2024/?vmr) for comprehensive summary updated in real-time.\n\nQuick summary:\n\n* Windows: 51 vulnerabilities, no zero-days, one PoC     \n* Google Chrome: CVE-2024-5274 zero-day (CVSS 8.8) and eight other vulnerabilities\n* Mozilla Firefox: 21 vulnerabilities\n* PHP: CVE-2024-4577 (CVSS 9.8)\n* Azure: vulnerability potentially exposing customers' personal information\n* Check Point: CVE-2024-24919 (CVSS 8.6)\n* GitHub: CVE-2024-4985 (CVSS 10)\n* Rockwell: seven vulnerabilities\n* Veeam: CVE-2024-29849 (CVSS 9.8)\n* Fluent Bit: CVE-2024-4323\n* QNAP: 15 vulnerabilities\n\nMore details: [https://www.action1.com/patch-tuesday](https://www.action1.com/patch-tuesday/?vmr)\n\nSources:\n\n* [Action1 Vulnerability Digest](https://www.action1.com/patch-tuesday?vmr)\n* [Microsoft Security Update Guide](https://msrc.microsoft.com/update-guide/releaseNote/2024-Jun)\n* [Zero Day Initiative](https://www.zerodayinitiative.com/blog/2024/6/11/the-june-2024-security-update-review)",
            "Installed on more than 200 esxi hosted VMs, Server 2016/19/22 with all roles you can have. Running smooth. No fkkn languace pack issues anymore.\n\nClients showing up tomorrow morning",
            "Just finished the SUP Sync in my ConfigMgr lab... it looks like MS might have screwed up the catalog.\n\nFrom what I'm seeing, the June 2024 updates for Win11 22H2/23H2 are not set to supersede the May 2024 updates for those two OS versions.\n\nedit: confirmed against the catalog.update.microsoft.com page... KB5039212 does not supersede KB5037771 and it really probably should.\n\nhttps://imgur.com/a/A6oKjbK",
            "**Microsoft EMEA security briefing call for Patch Tuesday June 2024**\n\nThe **slide deck** can be downloaded at [aka.ms/EMEADeck](http://aka.ms/EMEADeckJun)\n\nThe **live event** starts on Wednesday 10:00 AM CET (UTC+1) at [aka.ms/EMEAWebcast](http://aka.ms/EMEAWebcastJun).\n\nThe **recording** is available at [aka.ms/EMEAWebcast](http://aka.ms/EMEAWebcastJun).\n\nThe slide deck also contains worth reading documents by Microsoft.\n\nWhat’s in the package?:\n\n* A PDF copy of the EMEA Security Bulletin Slide deck for this month\n* ESU update information for this month and the previous 12 months\n* MSRC Reports in .CSV format, for this month’s updates including detailed FAQ’s and Known Issues data.\n* Microsoft Intelligence Slide\n* A Comprehensive Handbook on \"Navigating Microsoft Security Update Resources\" !\n\nAlso included in the downloadable package are handy reference reports produced using the MSRC Security Portal PowerShell Developer Functionality: [https://portal.msrc.microsoft.com/en-us/developer](https://urldefense.com/v3/__https:/portal.msrc.microsoft.com/en-us/developer__;!!La4veWw!x75oqCSB5L66w-Kbd7Nje6qiIcY4bvSEWfIQtN3_MlOLnH8Lo4LuumYTbpAkyb_hknLuIh5A4DnPviJ2oCkP6t4-6IskyXMy$)\n\n[May 2024 Security Updates - Release Notes - Security Update Guide - Microsoft](https://msrc.microsoft.com/update-guide/releaseNote/2024-jun)\n\n[5039227](https://support.microsoft.com/help/5039227) Windows Server 2022\n\n[5039217](https://support.microsoft.com/help/5039217) Windows Server 2019\n\n[5039214](https://support.microsoft.com/help/5039214) Windows Server 2016\n\n[5039212](https://support.microsoft.com/help/5039212) Windows 11, version 22H2, Windows 11, version 23H2\n\n[5039213](https://support.microsoft.com/help/5039213) Windows 11, version 21H2\n\n[5039211](https://support.microsoft.com/help/5039211) Windows 10, version 21H2, Windows 10, version 22H2",
            "No guts, no glory. Pushing out to 2500 endpoints as soon as it drops. Testing is for suckers.",
            "First month making my intern do all the patching.  Ready for all kinds of issues."
        ]
    },
    "Lock your Workstation": {
        "title": "Lock your Workstation",
        "score": 271,
        "url": "https://www.reddit.com/r/sysadmin/comments/1dlb6bo/lock_your_workstation/",
        "content": "As a spinoff of a reply chain in https://www.reddit.com/r/sysadmin/s/s95UCOYiZI, what methods have you used to get end users to remember to lock their workstations when they walk away?\n\nEdit: While I appreciate all the \"correct\" responses like GPOs and 15 minute idle logout, this was intended for the \"other\" means of reminding users, like Hasselhoffing. I apologize for the confusion. Was hoping to start off the weekend with some humor.\n\nFor those that mentioned Hasselhoff, My Little Ponies, Bob Ross, ect, ya'll understood the assignment. Let's keep it going.",
        "num_comments": 408,
        "comments": [
            "Previous job had a GPO deployed that would auto-lock the PC after 15 minutes idle. I've currently got a setting in my setup script to make the PC lock after 20 minutes idle.\n\nA lot of folks around here with older systems don't seem to know what \"locking\" their computer is.",
            "Lock after 15 or 20 minutes (cannot remember) of inactivity. There ends IT responsibility.",
            "One NOC i worked in would Hasselhof you if you left it unlocked.  They would change your wallpaper to a naked David Hasselhof holding two puppies in a barely SFW pose.  It didn't take too many times getting Hoffed before you took it seriously.",
            "We had an admin that was notorious for leaving his shit unlocked. He would also leave his wallet and phone right at the desk. \n\nWe opened a browser and went to instacart, and it auto logged in to his profile. We ordered and sent 15 watermelons 🍉  to his house. So when he got home, there were a shit ton of watermelons at his front door. \n\nThe next day, he didn't say anything. Then we started dropping hints... and it hit him he said, \"WTF I hate you guys, that was you!!! WTF am I going to do with all these watermelons?\" \n\nWe ended up giving him his money back and told him to lock his shit.",
            "Send an email out to the office from them saying they are buying lunch for everyone please let me know what you guys want!",
            "I'm gonna be honest those 15 minutes autolock is too long. Not a sysadmin just a dumb field tech. I work in some Banks and you would be suprised how many times I had to tell people in important positions to lock their screens because they have highly sensitive information that a low wage, dumb field tech should never in his life get even a glance at. They will leave for lunch, have the screen unlocked while me and my work buddy walk around doing stuff on their thin clients. \n\nI'm supposed to report every single one of them to higher ups but got told by my Supervisor to just not bother and try to not see the information on the screen and kindly remind them.",
            "This hasn’t been an issue for us in years since I got executive buy in to enforce a policy, but in the past I’ve used a series of escalating consequences:\n1. Friendly reminder\n2. Friendly reminder email with supervisor copied\n3. Embarrassing email sent from violator’s account to their teammates\n4. Embarrassing desktop background and Lock Screen image\n5. Custom desk phone ringtone that is a recording of me reminding them to lock their computer when they leave their desk\n6. Editing the autocorrect options in the Microsoft dictionary to replace “but” with “butt”\n\n\nMy first week here, I left my computer unlocked when I left at the end of the day. When I arrived the next morning my mouse pointer had been replaced with an animated penis. Left click made it erect, right click made it ejaculate.",
            "I put fakeupdate on the marketing lead's PC and he was like \"But I just stepped away for a minute... this Windows 11 upgrade is going to take forever!\"\n\nI told him after 10 minutes",
            "This has worked well for me:\n\n1. When you notice, open lockyourscreen.com for them in a web browser and lock it. Friendly reminder. I'll do this a couple times. \n2. Progress to a more serious message or warning. \n3. Send them to training on locking their screen\n\nMost people improve drastically after a couple times unlocking their screen with a meme.",
            "Want to introduce/lower your idle workstation timeout? It's called desensitization.\n\nStorytime.\n\nWe didn't have a workstation locking policy at all at our company. Most likely a janitor was caught after hours using a computer for something they shouldn't, so IT communicated to executive management that we wanted to implement a 30 minute idle lock.\n\nWe had a Finance Director was that a real hard ass and hated IT for some reason, but had more power in the company than the IT Director. She insisted on a 90 minute idle lock policy so her employees could go to lunch and come back without having to re-enter their password. IT Director knew he'd lose the battle, so he agreed to the 90 minutes, as it was better than nothing at all, and at least they would eventually lock after hours. So we implemented the ridiculously long idle lock policy via Group Policy.\n\nEvery workday, I would come in and adjust the policy setting down by one minute. Slowly over weeks and months the workstation would lock at incrementally lower idle times until after about 3+ months later we were sitting at 15 minutes.\n\nOnly one person noticed and didn't really care.\n\nCaution: This behavior can be a resume generating event depending on how strict your organization is, but this company was pretty casual, and I was young."
        ]
    },
    "IT to staff ratio, salary, venting, 1 man IT situations": {
        "title": "IT to staff ratio, salary, venting, 1 man IT situations",
        "score": 69,
        "url": "https://www.reddit.com/r/sysadmin/comments/1dlk1tm/it_to_staff_ratio_salary_venting_1_man_it/",
        "content": "So off the start I know this is a wildly vast complex topic with countless variables. From country to exact industry to location in a country. I have in the past read its normal for a 1:15 on the high end smaller companies to 1:30 and 1:18 and 1:25 on small med business under 500 and companies 5k+ on the more efficient side\n\n  \nTLDR: Jack of all trades, 1:80+ IT to staff ( actual workers is something like 200-300 sometimes but do not use tech or use shared accounts / devices etc ) most of the people who are using tech have at least a laptop and phone and or ipad also. Head office with 6+ remote sites, ms365 backend, fancy office with various systems doors, cameras, printers, boardrooms blah blah  \n  \nI am the sole IT person / department for a medium sized business. Construction industry. Yearly revenue 20mil+, 30-40mil + past few years. Biggest player in our field and specialization in area. \n\n  \nThe owners also have other businesses I am occasionally involved in, reached out to as the IT source. Consulting, setting up backends, websites, network, w.e\n\nEverything from designing, ordering, unboxing and crawling under desks to run cables to designing setups, ordering, setting up, installing, supporting etc.\n\nMain company is \\~100 users, 100 workstations laptop or desktop, 130+ LTE devices mobile, ipad, LTE router. Also desk / voip for some and reception / service and answering service.\n\nBeing the only IT person I mange everything from on prem to cloud. MS 365 backend for 4 tenants, on prem servers, building access, surveillance, printers, plotters, building automation, boardrooms, power BI, some automate, purchasing licensing and support on, EDR, Autocad, estimating, backups,etc, etc etc.\n\nMy KeePass has over 120 accounts\n\nThe head office is \\~25% of the users. We have at any given time 6-10 worksites mostly large jobs lasting several years. Also a service department.  \nRemote sites are connected via various ISP, starlinks, LTE modems, etc etc.\n\nI get paid 80k, im in North America, my take home after tax is a bit over 2k bi weekly, I do have deductions for pension etc\n\n Software licensing MS, Autocad, edr, etc etc etc its north of 100k.   \n\n\n",
        "num_comments": 102,
        "comments": [
            "Grossly underpaid.",
            "You have full control of your life. Make an airtight case of your true market value and fight for your money. If they don’t care then start updating your resume and bounce when you ready.",
            " So what do you do all day?  Are you just help desk?",
            "Ask them for an assistant.\n\nTake off two weeks and turn off your phone. \n\nAsk them again.",
            "Wow. Understaffed as hell!\n\nhttps://preview.redd.it/hz4qnm24528d1.jpeg?width=946&format=pjpg&auto=webp&s=20dbd918cdf80f5b8295cbfa7076e8939b276ef2",
            "Cry’s in 2 IT’ for 1700 people",
            "I didn't read the whole thing but I'm a one-man show kinda like you. My boss is a programmer who knows our MRP system in and out (we're a manufacturing company). He handled the programming side and I'm tasked with EVERYTHING else. It's stressful at times for sure",
            "My previous job that I left last week, I had 400 users, 1000 endpoints (printers, computer, thin clients, servers, access points, mobile devices) and 24/7 mandatory uptime (healthcare facility).\n\n12 different sites, most of which were 30-60 miles away minimum (rural location).\n\nI was solo, doing everything you’ve named in this and more. I did it for 3 years and was being paid $20.32 when I departed. \n\nI would have killed for your $80k…",
            "I'm literally in the same boat.",
            "Ehh. This all really depends on the philosophy of your leadership. If they're comfortable with having no IT support when you're on vacation, or if when stuff breaks it's not an emergency, then 1 person is probably ok based on what you referenced. 2 is probably the correct number if there are emergency situations. \n\nYou're underpaid either way for what you're doing. With these kind of setups, this is really where MSPs shine. Your company really needs to decide if it wants to source specific IT services from an MSP or acquire a help-desk equivalent second person and accept that turnover will happen."
        ]
    },
    "How much development/coding does your system admin team(s) do?": {
        "title": "How much development/coding does your system admin team(s) do?",
        "score": 10,
        "url": "https://www.reddit.com/r/sysadmin/comments/1dlsf1i/how_much_developmentcoding_does_your_system_admin/",
        "content": "I guess I'm asking this question with the mindset I was a developer before moving to operations and for the past few years I've been working on a team where nearly everyone else also has a developer background (kind of that whole SRE thing but for reasons I really don't like using that term).  We've automated the entire flow end to end. Even writing our own APIs for the application developers to integrate in their code to optimize our deployments, monitoring and reliability of the products in production.\n\nNow leadership wants to reorg (or breakup) our team and move us to other operations/application teams around the company to help them with automating their work flows but while I've been chatting with the managers or leads I'm finding very few admins have any knowledge of development or coding, beyond some scripting.  \n\nSo here's my question. Do you think it is feasible to expect a system admin or folks in operations to learn how to code?  I'm not expecting full on developers who need to know system design but more who are comfortable with programming.\n\n",
        "num_comments": 14,
        "comments": [
            "I manage a team of mostly sysadmins and about 1/2 are interested in coding. I do some myself, and a couple guys from the team do automations and integrations in Python. Now we're looking into what Ops are doing and working to automate their processes centrally.\n\nSo yes, sysadmins and Ops can code/learn to code. Also, your team does not need to be broken up to automate other teams' work.",
            "If they want to get paid more, yes. Being a point and click admin just isn’t as feasible today.",
            "I personally think any sysadmin who hasn't already started learning some form of IaC and moving towards a DevOps skill set is setting themselves up for failure.\n\nThe market is shifting towards DevOps even for old dinosaur enterprises, even if you don't get exposure to IaC, cloud technologies, containerisation etc. I would suggest teaching yourself.\n\nScripting would be the bare minimum expectation for me, I find it wild that some of my Windows colleagues don't push themselves to use powershell for as much as possible.",
            "Depends on the member. \n\n- Some of us are neck deep in Puppet/Chef/Terraform. \n- Some of us write Python Flask on top of our different systems to give management/help desk an easy view.\n- Some of us write Powershell/DSC/Bash to automate tasks/reporting.\n- Some of us click next on installers. \n\nJust depends.\n\nI will say, those who _can_ code are more valuable than those who can’t and integrate better into Delivery Teams than those who are just glorified desktop techs.",
            "Expecting system admins to code is completely unreasonable aside from writing some simple powrshell/bash scripts. Sounds like you need some devops engineers",
            "Programming is not IT.",
            "I guess I'm confused. If your team would be responsible for automation, why do the sysadmins need to know code, wouldn't you be the one facilitating that?\n\nBased on my experience with overloaded sysadmins, it is not reasonable to assume that someone can take on more work, especially if it's something outside of their lane that they would need to learn. Some can and will, but it's not reasonable to expect.",
            "Hardly. We only use/create batch files for executables to make it easier for the engineers to deploy apps etc. I mainly use CMD/Powershell for things like DISM to add driver packs to Wim’s which is hardly “coding”.",
            "I’d argue it’s even more feasible then ever, it’s just not gonna get you the big bucks, it’ll get you a smb job managing much less infrastructure. Almost anything from an smb standpoint can be done with gui click-ops",
            "What if the business requires it to move forward? Do they need to hire new people to replace the sysadmins who won’t learn coding?"
        ]
    }
}