{
    "The monthly r/tall discussion thread!": {
        "title": "The monthly r/tall discussion thread!",
        "score": 9,
        "url": "https://www.reddit.com/r/tall/comments/1d5i0gl/the_monthly_rtall_discussion_thread/",
        "content": "In this thread, you can tell us how your days are going, what's bothering you and anything else you'd like to share or rant about!",
        "num_comments": 4,
        "comments": [
            "How can I figure out which part of my body is actually tall? For reference I’m 6’4",
            "Wdym?"
        ]
    },
    "Ways to improve the sub/general opinions?": {
        "title": "Ways to improve the sub/general opinions?",
        "score": 16,
        "url": "https://www.reddit.com/r/tall/comments/1dkpl1x/ways_to_improve_the_subgeneral_opinions/",
        "content": "Hello! I realize it’s been a while; it’s been really busy, but I have some more time now (just graduated!) and it’s been really fun getting back into this sub. \n\nJust wanted to make this post and see what the community is thinking about the sub and if you have any suggestions to make it better.\n\nI am slowly making my way through reports but uh there’s a lot, so I appreciate your patience.",
        "num_comments": 51,
        "comments": [
            "Please make it a requirement to have your height in your flair. It’s incredibly annoying when someone posts a picture of themselves or asks a question related to their height, but doesn’t include their height. Multiple then comment and ask their height and OP takes several hours to respond. I feel like this happens all the damn time",
            "make me a mod, i've modded (and modding) bigger communities, my mere existence brings happiness (ong)\n\nedit: What do we learn from this? sometimes you just gotta ask WOOOOOO",
            "I would recommend banning the many users in this [post](https://old.reddit.com/r/tall/comments/1djwqgi/i_think_we_have_haters/) whose comments are obviously NOT polite and respectful towards short people, even when the person in-question wasn't even short and was 5'10\"! These types of comments towards short people will continue to happen if these users are not banned or if there is no punishment for those types of comments being made. Simply removing comments is not enough to deter people from making those types of comments. Many other tall users have pointed out the toxicity coming from other tall users.",
            "Can we put a “no sniveling” rule or something? Half the posts are sorry ass average height people whining about how sad sack their lives are. I’m not doubting their sad lives part, but height isn’t why. \n\nNext, can we do something about the fetishizers? They’ll start a shoe thread and then PM those who answer asking to “worship” our feet (I’m a dude). It’s lame & creepy. I know you’re not an almighty mod, but any action would boost QoL/ keep subs.",
            "Idk how one would make a community based around the discussion about height \"better\" really. Maybe link some resources for new comers but besides that I think that's kind of it.",
            "So these are just the ones that irk me - I understand that not everyone will share the same, but the following I think contribute nothing or just exist to cause issue.\n\nCelebrity|Politician height/comparisons - I mean just a picture of \"Tall famous person\" doesn't really mean anything to me, and I mean before it was cracked down on, it was just The Rock 5 times a day because the WWE made a height for him.  I don't care about the fact that some celebrities are tall, it just doesn't bring anything here.\n\n\"Are you taller than your mom/dad/brother/etc\" - Everyone is unique, this question comes around often, and there's literally *nothing* it provides.\n\nEvery creepy-ass dating post from a short person who is \"Totally not in any way\" just trying to find some \"trick\" to dating a tall woman/man/see feet.\n\nPolls - each time I've answered a poll it is followed by a creepy DM from an account with no posts.  The polls themselves were mindless anyway, but I think it's possibly more nefarious.  Could be coincidence, but I've just stopped answering polls.\n\nEvery single post about \"I was this tall this morning (no shoes) and this tall this evening (shoes maybe) and the 0.5 inch difference is my whole personality now.\" are insufferable.  It's over-posted for a shitpost anyway, but it is the *most* annoying, menial stuff I've ever read. \n\nThere has been an uptick in some pretty weird shit here lately but it gets dealt with it seems, but still on that - Incel memes about some height just being the absolute only thing in the world/anyone talking about wasting height/anyone coming to put all tall men or women (or both) in a box of some sexual conquest.",
            "As a man who has been over 40, I know it coudl be a bit grumpy here. So I make it points and really hope the Mod / admin could read my words here: \n\n* True story: My workmate is 7ft1-2 and sometimes he found people were like tracking him behind. He can't hide himself from being standout ,but he doesn't like to be photographed secretly and later found himself somewhere from any social media. He told me he has seen his pic once here (long time ago) and today's phone making him anxious. \n* At the same time I do feel creepy here - there are lots of Fetish / worshipers here. Perhaps the pandemic has turned on our weird switch inside then people started to do creepy things? Could we just set a limit here? \n* Some people like to promote themselves from selfies . Honestly I don't know what is that for. Are they asking for their problem with height,  just looking for a short date, fashion advise, or warning other tall people there are cautions in somewhere?  \n* Once the topic is interesting , the copiers comes, like leg rooms, door frames posts keep repeating from time to time. Could we just put them into a single topic? \n* Rants, ventilation, real-life true advices. I am not very tall but I do want to ventilate myself about the \"small stuff\" in our real life, and looking for real-life useful advices .  \n* About lesser-tall people - I am not sure whether there are any haters, or just looking for a date with tall guys/gals. I believe keep polite and gentle as the first rule , and not here to stir up an event as the second. Maybe if that continues we could ban those users from entering?",
            "Ban the annoying and hateful short people.",
            "This is a snark but I personally get offended when women that are 5’6-5’8 comment I mean cmon, it’s just not the same dude 🤣🤣🤣",
            "I would like to say the posts trying to determine which celebrity or influencer lied about their height don't go here. I would wager most people don't really care about other people's claimed height."
        ]
    },
    "Really tall people (6’6+), do you notice differences in height?": {
        "title": "Really tall people (6’6+), do you notice differences in height?",
        "score": 49,
        "url": "https://www.reddit.com/r/tall/comments/1dqqgqr/really_tall_people_66_do_you_notice_differences/",
        "content": "Being 6’2, I can usually pinpoint someones height down to within less than an inch if they’re honest. I’d imagine if you were really tall you couldn’t tell the difference between, say, 5’2 and 5’5 and such. ",
        "num_comments": 72,
        "comments": [
            "I only notice when someone is my height (6’8”) or taller because it’s just really unusual for me.",
            "i can’t tell at all. i’m 6 6. generally speaking i can identify ppl based on their height but i can’t tell anything under about 6 ft. i just consider everything around 6 2 and under to be short.",
            "No, we're always seeing from a bird's eye view. \nSo the viewing angle is very steep and it's very hard to distinguish vertical differences in length.",
            "I (6’7”) don’t even really notice people’s height at all until I can’t see over you. I am a terrible judge of height.",
            "Other people's heights aren't usually a topic, so no. I definitely notice tall people though, and feel strange meeting someone taller",
            "I kind of just associate with friends/family whose heights I know, like “this person looks about the same height as (x) who is (height)”.",
            "No, there's shorter than me, fight or flight in my eye level, and comically tall.",
            "No, anything below 6ft is the same, anything from 6’1”to 6’4” is the same.",
            "You are correct.   4'10\"to 5'3\" all look identical to me.   I'm a school teacher so I see lots of short people",
            "Ish. I can usually pinpoint the height of someone who is like 5'9\" and above, but the margin of error increases with shorter folks to around 2\" instead of 1\". I can still tell the difference between 5'2\" and 5'5\", but might be off by an inch or two on the exact number.\n\n\nFor 7'+ though I also have no clue. "
        ]
    },
    "Looking for a California Queen mattress, where do I find one?": {
        "title": "Looking for a California Queen mattress, where do I find one?",
        "score": 4,
        "url": "https://www.reddit.com/r/tall/comments/1dr24te/looking_for_a_california_queen_mattress_where_do/",
        "content": "Son is growing, 5' 10 now, but we don't want to have to buy a new bed next year. Who sells California Queens, and where do I find bed frames for them? What about California Kings?",
        "num_comments": 9,
        "comments": [
            "5ft 10 at what age? Cause to me that's not enough height for a Cali queen. I personally have an alaskan king but 5ft 10? Seems like a normal height to me unless he's 8?",
            "Costco has the Nectar brand in Cali King and it's really comfy. My husband is 6'9\" and it's great for him. Not sure about Cali Queen, though. ",
            "i'm 6'3 and i have a twin xl honestly idgaf that my feet hang off the edge, if he's younger than me (15) then he'll soon have the same problem as me and eventually have it quite a bit worse. what ima do when i have my own money ima get a regular full and sleep diagonal  on it, they're 72x72 so if you do a little math you get that being diagonal gives you 101.8 inches of room. you probably have more money to spare than my family but i really don't know where you would buy that, probably somewhere online",
            "This post is the first time I've ever heard of a California Queen. I've only ever seen California Kings before.",
            "You could fit a small village on your bed, lol",
            "Growing like a weed though, 2 inches in a month.",
            "Shouldn't a twin xl be big enough for you?",
            "Fits about 7 normal size people.",
            "Dmed you cause I'm concerned."
        ]
    },
    "has anyones shoe size gone up in their mid 20s? ": {
        "title": "has anyones shoe size gone up in their mid 20s? ",
        "score": 21,
        "url": "https://www.reddit.com/r/tall/comments/1dqmjey/has_anyones_shoe_size_gone_up_in_their_mid_20s/",
        "content": "24 here, 6’3. Been wearing size 11 since i was about 17 or so when my height maxed out (ik my feet are small) Last few weeks my shoes have started to feel very tight in the toebox, like theyre a size small. I kinda ignored this but after playing some basketball for like, an hour (in nice basketball shoes), i got a wicked hematoma (bleeding under toenail). Since then I cant help but notice that all of my shoes feel way too tight , barring a pair that used to be a little bit loose (now theyre perfect)\n\n\n\nI don’t think its just a brand sizing difference because my newest pair of shoes from 6 months ago (some new balances) fit absolutely perfect up until a few weeks ago. \n\n\n\n\n\nIs this even possible? I’m still the same height - TBH I am a little concerned that my feet are swelling ",
        "num_comments": 42,
        "comments": [
            "Yes your arches collapse and increase your shoe size. \n\nI went from 11.5 to 12 last year.",
            "I used to vary between 13 and 14 from shoe to shoe, but in recent years whenever I try on shoes have noticed that 14 always feels better than 13 now",
            "When I turned 40, my shoe size went from 11 to 12.  Not sure why.  I've had no issues really, just bigger feet now.",
            "Got married at 24. Shoe size 13. Had been in 13s for many years. Now I'm a 14/15 depending on brand at 61. Not exactly sure when my feet grew. But they did.",
            "Your feet will continue to “grow” as you age just due to use. They’ll flatten out, tendons and liniments get looser etc. However, going up a size at 24 and fast enough to be noticeable seems like it’s more than just the natural process. Should probably check with a doctor if you’re able to.",
            "Another viewpoint. I didn't know how much space was needed up front for a comfortable fit, and then I went out and bought some larger shoes. I went from 9.5(?) to 11 and it finally wasn't rubbing against the digits anymore ",
            "Im about to be 22, and my shoe size has increased again since 2022, in 2022 I was in between a size 15 and 16 but now im a solid size 16 with some shoes even fitting as a size 17. It’s crazy and I hope it stops 💀.",
            "In my late 30’s shoe size went up twice. From 15 to 16, then 16 to 17.",
            "I have long, narrow feet, and I went from 13 to 14 when I turned 31.  I legit can't fit into my 13s anymore.  It'd make more sense to me if my feet got fat or something, but I guess they just grew.\n\nSucks because I had some pretty cool shoes, but there's always more shoes, haha!",
            "I was a size 13 at age 20.  I'm in my 50s now, and I wear 15EEE."
        ]
    }
}