{
    "Stop spamming Top X tanks posts. We are removing them all and repeated spamming may incur a ban.": {
        "title": "Stop spamming Top X tanks posts. We are removing them all and repeated spamming may incur a ban.",
        "score": 824,
        "url": "https://www.reddit.com/r/TankPorn/comments/1dfpax7/stop_spamming_top_x_tanks_posts_we_are_removing/",
        "content": "The influx of Top X tanks spam has led to us issuing a blanket ban on these kinds of posts. Please don't post something like this in again.",
        "num_comments": 49,
        "comments": [
            "YAAAS!!!!!  \nTHANK YOU MODS!",
            "r/TankPorn has been saved, billions must live",
            "Mods being sane and doing the subreddit a solid?  The devil you say!\n\nSeriously, thank you Mods!\n\nI suspected that many of these \"Top 5 Tank\" posts were bots.",
            "We did it reddit",
            "yipeeee",
            "It is my great pleasure to inform you that the Spam has been stopped, thank you mods, you did good",
            "Thank you, mods!",
            "Billions must not post low effort garbage",
            "Thank you!",
            "F*cking Finally!\n\nIt was getting tiresome."
        ]
    },
    "Bought at tankfest 88mm flak shell (inert) can for scale": {
        "title": "Bought at tankfest 88mm flak shell (inert) can for scale",
        "score": 1228,
        "url": "https://i.redd.it/vi2zvawpmc9d1.jpeg",
        "content": "",
        "num_comments": 92,
        "comments": [
            "I'm glad the can is inert, could have dangerous to have in your home.",
            "cool, throw it at someone",
            "Imagine walking with this In middle of London  🤣",
            "They sell militaria at Tank Fest?! So envious!",
            "The door itself is a scale good enough, I think",
            "I do need a doorstop...",
            "Where on earth did you buy that?? Surely not at one of the stalls I'm assuming",
            "Anything’s a dildo if you’re brave enough",
            "Phahaha premier inn reception must have been concerned",
            "How deep can you go?"
        ]
    },
    "Now would you just look at that big gunnnn": {
        "title": "Now would you just look at that big gunnnn",
        "score": 520,
        "url": "https://v.redd.it/cl28qvitfd9d1",
        "content": "",
        "num_comments": 22,
        "comments": [
            "I'm so glad they got the Shit Barn restored.",
            "Utterly colossal, width is the size of a head",
            "HESH! aah aah. Saviour of the universe.",
            "The Hesh express has risen",
            "I'll never forgive my dad for talking me out of going",
            "183mm gun. There were commissioned destroyers and cruisers with smaller main armaments",
            "There is a reason the Ukrainians like hesh",
            "BFG",
            "Anti is3/4",
            "That's awesome, great job by the tank museum, WG and of course Mr. Hewes' crew. Too bad I could not go - at least I'll have an airshow to enjoy today."
        ]
    },
    "How effective is this land dragon in ww2?": {
        "title": "How effective is this land dragon in ww2?",
        "score": 857,
        "url": "https://i.redd.it/ismd2tybhc9d1.jpeg",
        "content": "Churchill crocodile btw",
        "num_comments": 67,
        "comments": [
            "Effective enough that captured Crocodile crews were usually summarily executed by the Germans.",
            "the funnys generally were extremely effective, especially the crocodile. humans tend not to enjoy the idea of getting set on fire so they cause a lot of surenders.",
            "Depends on what you want it to do. \n\nTake out an enemy tiger from 1000 yards? Probably not that good at it.\n\nClearing an enemy bunker? There's not really a better tool for the job. If I remember correctly the Croc didn't even have to hit the bunker to cause it to ungarrisson and surrender, simply a small flame burst in front of the bunker was sufficient.",
            "Flame tanks very effective",
            "very",
            "Everybody gangsta until this mf comes in",
            "I’d run away from it, so very effective I’d imagine.",
            "Watch the lindybeige video about it, he pretty much sums it up",
            "So effective its use is banned by civilised countries.\n\nEdit: As people don't seem to like this....\nHere is some context. From British army law.\nJSP 383: Manual of the Law of Armed Conflict.\nUse of weapons such as napalm and flamethrowers against combatant personnel is not dealt with specifically in the Conventional Weapons Convention or any other treaty. Such uses are governed by the unnecessary suffering principle so that they should not be used directly against personnel but against armoured vehicles, bunkers, and built-up emplacements, even though personnel inside may be burnt. The same applies to white phosphorous, which is designed to set fire to targets such as fuel and ammunition dumps or for use to create smoke, and which should not be used directly against personnel.",
            "The UK tanks were supporting by soldiers because they had used some fire gun and support equipment, it not a tank than German tanks. But we should forget ww2 was growing up mobilize by army system"
        ]
    },
    "Russians try to push a stuck BMP with another one and get it stuck too so a third one has to help them out": {
        "title": "Russians try to push a stuck BMP with another one and get it stuck too so a third one has to help them out",
        "score": 464,
        "url": "https://v.redd.it/n1ayupb87d9d1",
        "content": "",
        "num_comments": 38,
        "comments": [
            "No tow, hump better.\n\nI think they could've stacked at least 3 more if they tried.",
            "So this is how BMPs are made.",
            "That \"Ura blyat\" needs no translation. Full of frustration, relief and \"it gonna happens again with these idiots isn't it\" in the tone of voice.",
            "Average War Thunder lobby",
            "It would be funny if the third one was a BMP-3",
            "Mating season?",
            "\"Excuse me!\" Ahh BMP",
            "I like the camo netting on the truck, really hides those lights.",
            "The Chev got stuck and the Ford got stuck\nBut the Chev unstuck when the Dodge showed up\nBut the Dodge got stuck in the tractor rut,\nWhich eventually pulled out the Ford",
            "I'm impressed."
        ]
    }
}