{
    "Stop spamming Top X tanks posts. We are removing them all and repeated spamming may incur a ban.": {
        "title": "Stop spamming Top X tanks posts. We are removing them all and repeated spamming may incur a ban.",
        "score": 820,
        "url": "https://www.reddit.com/r/TankPorn/comments/1dfpax7/stop_spamming_top_x_tanks_posts_we_are_removing/",
        "content": "The influx of Top X tanks spam has led to us issuing a blanket ban on these kinds of posts. Please don't post something like this in again.",
        "num_comments": 49,
        "comments": [
            "r/TankPorn has been saved, billions must live",
            "It is my great pleasure to inform you that the Spam has been stopped, thank you mods, you did good",
            "Billions must not post low effort garbage",
            "F*cking Finally!\n\nIt was getting tiresome.",
            "Just a matter of time until something else annoying will pop up",
            "Can we please include meta meme posts about top 5 meme posts? Thank you.",
            "All hail the mods !",
            "I used to pray for times like these.",
            "Is it weird that I'm on reddit almost every day and never seen a single one of these?",
            "You are the M60 we always needed!  Thank you!"
        ]
    },
    "The shit barn lives ": {
        "title": "The shit barn lives ",
        "score": 259,
        "url": "https://v.redd.it/tc4r54nrei9d1",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Is that the one which was standing outside for many years?",
            "The Brits were putting sheds on tanks decades before the Russians.",
            "Talk about intimidating presence. Sweeeeet",
            "I think its nice, that the Hewes Crew was parading the tank, that was restored by them.",
            "There IS something taller than an M60A1!",
            "cant wait to see her on Sunday :3",
            "Yes its been restored over the last 6 months. If you want to see videos of it getting restored then look up mr hewes he and his team did the work on it",
            "Dont need to worry about making shed door big enough for tank to drive through if tank is shed and British MIC is shed based.",
            "I know it's tongue in cheek, but a better comparison would be to the Soviet KV-2, first produced in 1939. The FV4005 stage II was made in 1955.",
            "Great news! Would be great to see it firing this big boom stick! \nProbably very unlikely..."
        ]
    },
    "Swamp monster ": {
        "title": "Swamp monster ",
        "score": 303,
        "url": "https://i.redd.it/lj4hljxk8g9d1.jpeg",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Panzer III Ausf. N - one of three dug up in Bardufoss, Norway in 2007 (now at Muzeum Broni Pancernej in Poland)",
            "Oh panzer of the swamp what is your wisdom?",
            "Dont worry, itll buff out.",
            "Didn't realize it was two pictures at first. Looked like a panzer & a baby panzer.",
            "These were buried right? Why?",
            "If I were to guess, it looks like they made a stationary defensive gun placement out of it. This didnt just sink in a swamp, it was buried in concrete (with the turret still operational). You can see all the hammer marks where the concrete was chipped away.",
            "Didn't have big enough oven for cremation",
            "They got stuck and sunk in nobody burries tanks",
            "If the engine or undercarriage was damaged beyond repair, they absolutely would bury it (as armor and concealment) and continue to use the gun.",
            "Panzer of the swamp"
        ]
    },
    "What are these russian vehicles?": {
        "title": "What are these russian vehicles?",
        "score": 237,
        "url": "https://i.redd.it/bwnz14lp9g9d1.jpeg",
        "content": "seems like a kamaz mrap of some kind but I can’t figure out what specific variant it is. Possibly up armoured?",
        "num_comments": 39,
        "comments": [
            "It is not a Kamaz MRAP - iirc this is from a video of some captured equipment",
            "Two far ones are captured Kozak-2. That one closer to us looks close to Kirpi, but it's not it. Most likely captured too.",
            "Pretty sure its a KrAZ shrek which is a homemade ukrainian vehicle afaik",
            "Likely the best vehicles the z team ever operated",
            "Scrap metal if their track record is anything to go off",
            "If it's in russia, and it's not russian-built, it's stolen.",
            "indicates they have the zombie virus, stay back",
            "yes its from a video where they show off a captured ukranian BTR but I didnt realise the other vehicles were captured as well.",
            "It is obviously not the Kirpi because it has no firing holes. I think it looks like Akhmat or something",
            "Sir, r/UkraineRussiaReport is down the aisle to the left. Thank you."
        ]
    },
    "183mmm of pure boom": {
        "title": "183mmm of pure boom",
        "score": 135,
        "url": "https://www.reddit.com/gallery/1dr6o2o",
        "content": "",
        "num_comments": 10,
        "comments": [
            "183 milli-millimeters of pure boom",
            "I even got to meet Mr Hewes",
            "Look how they un-massacred my boy!",
            "It's such a good feeling seeing fully restored sh*tbarn after following every step of its restoration",
            "Ted did a cracking job of this",
            "183 metric millimeters of pure boom",
            "That's awesome but, did you meet Ted?",
            "\"SPUD\"",
            "Happy cake day",
            "  "
        ]
    }
}