{
    "Pride 2024 TM Voices": {
        "title": "Pride 2024 TM Voices",
        "score": 64,
        "url": "https://www.reddit.com/r/Target/comments/1d3ouav/pride_2024_tm_voices/",
        "content": "Good evening, my wonderful team members.\n\nAs we've discussed [here](https://www.reddit.com/r/Target/comments/1co136l/pride_2024/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) among so many other threads, we know the Pride 2024 set is A: only making it to 50% of stores, and B: less than stellar, to be very mild. The point of Pride is not just buying rainbow stuff from a corporation, but sometimes that's all the representation someone gets to see. Representation matters, and our queer community matters to me *a lot.* I yell a lot about our lack of field representation, not to mention HQ having a shit system for getting feedback from the field for anything. \n\nLike I did last year, I wanted to make a place for you to share your reactions and feedback - communication restrictions into the field has been a major focus of my team and I on the Pride+ Employee Resource Group \"Inclusion Acumen\" team. (Formerly Team Member Advocacy). A big part of why I want to do this is because of how damaging poor communications can be, and how badly I am trying to force that message into the ears of the people who could do something about it. (Re: damage - last year, when we only found out about product being recalled ahead of set thanks to u/PrinceKido and a few folks. We have a whole ass chain reaction of events since that point, culminating in a fucking Equal ^(Ity) shirt design of all things.)\n\nWhat I did last year with your messages was post them in the Pride Plus Business Council Slack channel, so that all of the people across the enterprise could receive feedback from the field and understand how things were feeling. I anonymized the messages if there were identifying features, left in the cursing, and posted them into a thread with updates in the main channel every single time I put a new batch up. This is the goal again this year - even if we can't force them to suddenly make the collection for 2024 not suck, anything we do to shift the needle towards the right direction is real helpful. \n\nu/128Gigabytes u/JayUnderscore_ u/n1njaunic0rn u/SamNoche u/grumpyoldfartess u/BroIBelieveAtYou u/ElderEmoAdjacent ",
        "num_comments": 78,
        "comments": [
            "What I want to know is: does corporate really believe that pulling or watering down the collection is the only way to keep stores, TMs and profits safe? What has changed between \"we're keeping the bathrooms inclusive, go suck it\" and now? We handled angry, armed guests fighting over Purell and toilet paper in 2020... I can't understand why guidance couldn't have been issued like it was for Covid. Just let us set the merch and empower us to handle the idiots? \n\nI'm so extremely disappointed in not just the cave-in, but also the utter lack of meaningful discourse surrounding it. Not just for stores, but also for the artists/vendors, something I learned today on this sub. \n\nI've been an ally since the '80s AIDS protests, and I chose to work for Target in large part because of their track record of inclusivity. To watch, and inadvertently be a part of, this kind of spineless, greed-driven decision-making really, really bothers me. The protesters shouldn't be our target demographic, pun intended.\n\n(I need to change my flair. I came back last month after 4 years in another industry.)",
            "the pride collection this year feels so bland\n\nhalf the clothes coulda gone in a new day without batting an eye, and even the more overtly rainbowy things still just feel like they're hiding it, compare this years rainbow stripe lawn chair to last years full rainbow\n\nand there's not even bullseye it sounds like? no socks or flags!\n\ni'm glad my store has it but everyone i've talked to here has been shocked both by how.. meh the designs are and the fact its hidden away on the backside of an aisle with future collective, completely hidden from the entrance\n\ndoesn't feel out and proud at all, it feels like Target's pride is in the closet",
            "Just looked at it.  Super underwhelming.  They were starting to give ace recognition and they yanked it away.\n\n![gif](giphy|gfsQffBnuc6e096brx)",
            "I said it in the survey this year and I will say it again, it’s not just about Pride; the rest of the heritage collections sucked this year and weren’t promoted and they still haven’t done shit for AAPI heritage on a wider scale. If they don’t really want to do it, don’t do it.\n\nIt’s just the latest in a line of collabs and LTOs that don’t sell for crap. Who’s misreading the market that bad?\n\nWith that said, why did they contract outside designers for Pride 2024 and then cut the lines last minute? They could have just done basic in-house designs like they did pre-2022 and not burned all that goodwill, if any remained. Just pick a lane.\n\n(I’m in one of the stores that didn’t carry Pride before 2021, and never had the full run. I don’t know if we’re too tiny or too exurban.)",
            "I saw the collection online (and in store today) and... I was vastly underwhelmed. It appears to strive to be so inoffensive and bland that it's actually a joke. By my eye, it looked like more than half of the collection is... for pets. Whoever made the decisions for this year's curation clearly doesn't get what Pride means.\n\nI predict it won't sell and that will just give the higher-ups more ammunition to eliminate Pride from the sales floor.",
            "For me... I feel more endangered as an openly, proudly and loudly queer member of the team, than I did when hearing about bomb threats. \n\nThis choice of action gave power to the nastiest, cruelest voices imaginable. Why is that the group you want to appeal to? The folks with no human empathy or concern for human life and well being? That's the Target audience? We chose them above queer folk? Who have been pretty damn loyal to Target because once upon a time they stood for Pride and stood for inclusion, loudly and openly. \n\nI chose Target for how open and seemingly welcoming they once were when it came to the Pride community, now I can't help but feel a pretty strong sense of betrayal... but sadly not surprise. I don't know where we are headed but at this rate with these very clear and harmful moves, I don't think it'll be a good road we navigate along.",
            "It feels...shitty, to say the least.\n\nI kind of figured that they'd kowtow to the bigots, but it still takes the wind out of my sails.\n\nI'm not out, but I'm also open about it (more or less). I've never bought anything, but I've always looked and admired. Hell, the Drag Queen Bird was 🔥 last year, and if our store had any, I would have 100% bought it lol.\n\nIt always made me smile, seeing the display and the merch.\n\nA handful of years ago we had a really cool HR. She made Pride, Ally, Trans, and Equality Target pins and buttons. I've worn my (Pride) one every year, despite getting called the F Slur on a few occasions, it felt nice to do.\n\nLooking at me you'd never suspect in a million years that I was part of the community, but it always felt nice to show my Pride when and where I can, in my own way.\n\nI don't know how to describe it, really.\n\nThis year though...I feel it might be prudent *not* to wear it. Either because they're admonish me, or because of something a \"guest\" might do.\n\nhttps://preview.redd.it/yy0q1w643h3d1.jpeg?width=3024&format=pjpg&auto=webp&s=a12f479ca73807b6395cfd59d578a3ca73cd5ce3",
            "Great work!!\n\nI was reading the weekly update today and had a good laugh about how Target respects and supports its LGBT+ TMs. I sure as hell don’t feel respected by anything the decision makers have been doing. They rolled over last year like dogs. Shameful!",
            "this shit is ugly af and wont sell and corporate will say \"well its them wokies\" and pull it entirely. it sucks so much as an lgbt team member who routinely has to put up with \"she, him, *they\"* every time i go into work and then to see target not only capitulate last year to alt right nutjobs but then to HIDE pride (at least in my store) and then make it appeal to exactly one demo (parents and friends of lgbt ppl) feels like a slap in the face. target pride was the first time as a child i felt like it was okay to be lgbt and i ROUTINELY wear my first pride shirt ever to target. it sucks that target is less lgbt friendly now then they were in 2015.",
            "Nothing in this year's pride \"collection\" has me excited about potentially getting it, like it has in the past. And having it tucked in the middle of the women's floorpad instead of in the gateway (and featuring more fugly swimwear in gateway, meaning more stuff people will buy 3 sizes/styles of and then return half of it 2 days later) feels like it's an afterthought, and it's really a slap in the face to LGBTQ+ TMs who are seeking any kind of support in an increasingly unsupportive world."
        ]
    },
    "HR put the pride flag upside down ": {
        "title": "HR put the pride flag upside down ",
        "score": 375,
        "url": "https://i.redd.it/fnvg52l5ly7d1.jpeg",
        "content": "I dont think she meant anything by it and tbf the gays at our store are in distress 🤣",
        "num_comments": 68,
        "comments": [
            "According to the U.S. flag code, this means that the gays are in distress lol",
            "the way it’s taped to the wall 😭😭😭",
            "My guy, EVERYONE at Target is in distress. Our sign is always upside-down, but it's a fucking circle, so no one will ever know.",
            "https://preview.redd.it/kcxpq8zhry7d1.jpeg?width=602&format=pjpg&auto=webp&s=a5809a6a9faecb737b63b87f9df7c1d15901b3da",
            "https://i.redd.it/tpau53lqb08d1.gif",
            "Looks backwards AND upside down. Yeesh.\n\nPlus, not to keep piling on this poor HRE, but surely they could've hung it with something better than tape thats visible from this far out.",
            "They a little confused",
            "As a lesbian with an intersex condition, I just have to say...\n\nDear God, the flag gets uglier ever year! What was wrong with the rainbow?!\n\nDon't get me wrong, I love the intent behind it. But I think we need to get together and elect someone who is a tiny bit better at designing pretty stuff, lol",
            "The tape too… lmaoooo your HRE is goin through it",
            "To be fair, I like living upside down."
        ]
    },
    "I’m convinced guests lose all brain cells in target (rant sort of) ": {
        "title": "I’m convinced guests lose all brain cells in target (rant sort of) ",
        "score": 71,
        "url": "https://www.reddit.com/r/Target/comments/1dlkm7c/im_convinced_guests_lose_all_brain_cells_in/",
        "content": "The amount of times in the past week I’ve had to put up with our guests lack of brain cells is insane ._. First off, when a product has a promotion such as buy 2 for $5 THAT MEANS YOU NEED TO BUY 2, don’t go saying “back there the sign said buy 2 for $5” like do you not hear yourself ??!??!? Second, does no one know how to use self checkout !?! Like I’ve seen you in here why are you tapping your card on the security camera and getting upset it’s not working ~_~ Third, again with self checkout, when it’s roped off with a sign saying “self checkout is currently closed” and the screens turned off why are you scanning each item then finger wagging me over when nothings happening 🧍🏻‍♀️ Fourth, why are we getting mad when coupons or promotions weren’t applied to a purchase when I asked you 3 times if you would put in your phone number associated with a target account or let me scan your barcode and you refuse to let me and then come back angry that you didn’t get your stupid $5 gift card when I know your a regular who knows how this works 😒 (there’s so many other stories but these were just the highlights) ",
        "num_comments": 10,
        "comments": [
            "I know I’m supposed to advocate for guests but when I see someone walk past huge signs that alert them self check is closed and proceed to bypass obviously roped off self check areas to try to scan their items at registers that are physically off, working their way down the line trying every one even though the screens are black…. I feel no desire to jump in and save them from their own stupidity.",
            "felt 😭",
            "What do you mean “lose brain cells”? They don’t have any brain cells, it’s why they act stupid and treat us like trash…",
            "I think the number one things guest do that annoy me is leaving carts or garbage. Carts is the worse because I know damn well you gotta leave the store at SOME point. You can’t put it away on your way out?",
            "My pet peeve is \"Where is the restroom?\" when my store in particular has a huge red sign hanging from the ceiling that reads \"restroom\"...",
            "Promotions like \"buy 2 for $5\" at some stores means you can \"buy one for $2.50\" if that's what you're getting at.  I know it's like that at Kroger at least",
            "Preach it!",
            "Imma be honest, if I saw “buy 2 for $5” I’d assume I can… you know, buy 2 for $5.",
            "I used to watch this happen because umm the sign is big as FUCK and when you look at the screen you can tell it’s not currently available for use. And I’ve had people see me watching them struggle and get mad at me like “why didn’t you tell me this isn’t working?!” Like I didn’t think I needed to when you walked past that big ass sign that says CLOSED💀. Then they’ll say “well I didn’t come to the store to read.”😂😂😂",
            "And Publix"
        ]
    },
    "Target in 1986": {
        "title": "Target in 1986",
        "score": 333,
        "url": "https://v.redd.it/uzg2x1laiy7d1",
        "content": "",
        "num_comments": 43,
        "comments": [
            "damn, the flatbed hasn't changed AT ALL in 38 years",
            "How is it that the whole basic structure of the store is practically the same? Was Target ahead of their time in terms of design or something?",
            "I wish the keyboards at the registers actually worked. I hate typing dpcis on a touch screen 😔",
            "A tie!   WOW!  Haven't seen a TM wear a tie in our store - ever LOL!",
            "Muh ancestors.",
            "Besides some tech. It looks all the same lol",
            "We don’t get a target where I live until 95. I only knew about target cuz of Career Opportunities.",
            "You want to see even more vintage Target....check out the movie Career Opportunities from 1991",
            "The more things change, the more they stay the same",
            "this one always gets me bc of the lady in the blue jacket carrying a shitload of stuff in her arms. i, too, always refuse to get a cart."
        ]
    },
    "What is something you wish your Zebra device would do?": {
        "title": "What is something you wish your Zebra device would do?",
        "score": 81,
        "url": "https://www.reddit.com/r/Target/comments/1dlizfm/what_is_something_you_wish_your_zebra_device/",
        "content": "I work GM and during my pulls I wish I could select just the aisle I want to pull from in the stockroom. So many times there are other TMs pulling in aisles next to mine making mine inaccessible. Instead of skipping 40 items to get to the one aisle I can pull I wish I could just filter it to go to specific aisles only. ",
        "num_comments": 129,
        "comments": [
            "Shut the fuck up about me not being signed in, stop the random calls, actually work when I need it to, and to not log me out as I’m signing in.",
            "Honestly, having 2 people be able to do the same batch for OPU if we’re very crunched up on time 😩",
            "I wish they would work. I'm tired of randomly being signed out, randomly disconnecting from the internet, getting calls that don't pertain to my department, my scanner stops scanning, the occasional freezing. The Zebra device just needs to be completely redone",
            "Actually let me search things the way i can on the app",
            "for them to actually scan stuff",
            "I wish it would sign out of the phone app.\n\nThere should be a \"TAKE\" button on the backstock screen to make consolidation of items easier.  And after you scan the location in backstock, it should show how many of the item is currently located.  Just as a double-check so you can ensure accuracy.",
            "Honestly wish we could message eachother on there so we don’t have to keep using the walkie",
            "To stop getting those damn alerts about a guest needing assistance and no more phone calls would be nice to just switch off",
            "Built in RFID scanning. It’s a long shot but beats the hassle of trying to connect to a scanner during an OPU order.",
            "I've always wanted a function where you could make a list of bookmarked items in MyDay. Like if a guest needs multiple things pulled from the back or I'm filling an endcap from the home, I can save them and have that for reference."
        ]
    }
}