{
    "Pride 2024 TM Voices": {
        "title": "Pride 2024 TM Voices",
        "score": 73,
        "url": "https://www.reddit.com/r/Target/comments/1d3ouav/pride_2024_tm_voices/",
        "content": "Good evening, my wonderful team members.\n\nAs we've discussed [here](https://www.reddit.com/r/Target/comments/1co136l/pride_2024/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) among so many other threads, we know the Pride 2024 set is A: only making it to 50% of stores, and B: less than stellar, to be very mild. The point of Pride is not just buying rainbow stuff from a corporation, but sometimes that's all the representation someone gets to see. Representation matters, and our queer community matters to me *a lot.* I yell a lot about our lack of field representation, not to mention HQ having a shit system for getting feedback from the field for anything. \n\nLike I did last year, I wanted to make a place for you to share your reactions and feedback - communication restrictions into the field has been a major focus of my team and I on the Pride+ Employee Resource Group \"Inclusion Acumen\" team. (Formerly Team Member Advocacy). A big part of why I want to do this is because of how damaging poor communications can be, and how badly I am trying to force that message into the ears of the people who could do something about it. (Re: damage - last year, when we only found out about product being recalled ahead of set thanks to u/PrinceKido and a few folks. We have a whole ass chain reaction of events since that point, culminating in a fucking Equal ^(Ity) shirt design of all things.)\n\nWhat I did last year with your messages was post them in the Pride Plus Business Council Slack channel, so that all of the people across the enterprise could receive feedback from the field and understand how things were feeling. I anonymized the messages if there were identifying features, left in the cursing, and posted them into a thread with updates in the main channel every single time I put a new batch up. This is the goal again this year - even if we can't force them to suddenly make the collection for 2024 not suck, anything we do to shift the needle towards the right direction is real helpful. \n\nu/128Gigabytes u/JayUnderscore_ u/n1njaunic0rn u/SamNoche u/grumpyoldfartess u/BroIBelieveAtYou u/ElderEmoAdjacent ",
        "num_comments": 82,
        "comments": [
            "Just looked at it.  Super underwhelming.  They were starting to give ace recognition and they yanked it away.\n\n![gif](giphy|gfsQffBnuc6e096brx)",
            "I saw the collection online (and in store today) and... I was vastly underwhelmed. It appears to strive to be so inoffensive and bland that it's actually a joke. By my eye, it looked like more than half of the collection is... for pets. Whoever made the decisions for this year's curation clearly doesn't get what Pride means.\n\nI predict it won't sell and that will just give the higher-ups more ammunition to eliminate Pride from the sales floor.",
            "this shit is ugly af and wont sell and corporate will say \"well its them wokies\" and pull it entirely. it sucks so much as an lgbt team member who routinely has to put up with \"she, him, *they\"* every time i go into work and then to see target not only capitulate last year to alt right nutjobs but then to HIDE pride (at least in my store) and then make it appeal to exactly one demo (parents and friends of lgbt ppl) feels like a slap in the face. target pride was the first time as a child i felt like it was okay to be lgbt and i ROUTINELY wear my first pride shirt ever to target. it sucks that target is less lgbt friendly now then they were in 2015.",
            "My store has a section right in the front, it’s very small. But I can see almost everything from Guest Services. The first thing I saw was the “Movie Star Bird” and the only indication that it was a pride tag. I question a lot of things people buy when they return them, but who tf is going to buy this crap? And a silver car…I walked by it today and it was very underwhelming. The Prince set and DVF were decent, but this is sad. My store seems to have a lot of queer+ TM and Target has a chance to celebrate that. But, per usual, we’re either ignored or whatever this is…tolerated? I don’t know. There was a time when I wasn’t a TM and I always thought highly of this place. But it’s definitely lost its shine and I could feel that when I started November 2023.",
            "As an employee, proud is the last thing I'm feeling right now.",
            "We cut Pride down like crazy this year. \n\nBut GAHDAMMIT if you and yours are Swingers? WE GOT SO MUCH PINEAPPLE SHIT FOR YOUR ASS!",
            "As a member of the community, I personally don’t have an interest in pride month merch, but WOW, this year’s Pride line is disrespectfully small and bland. So low effort it’s hilarious.",
            "I was genuinely, deeply disappointed. The collection is a whimper, a whisper in the back of a loud crowd. It barely counts as a collection at all - I felt like they had more for pets than people. If I can find better, more interesting pride designs at Old Navy of all places, Target has deeply failed. And deeply fail they did, with the 2024 collection.\n\nBut hey, at least bigots know that they can whine and wail and throw tantrums over their eyes being sullied by people who are not them existing and Target will knuckle under and show its belly.",
            "Obviously rainbow capitalism isn't the best, blah blah, but I remember being a younger teen and the only real representation I saw in my world was the Target Pride collection. I'm so disappointed that my store doesn't have it this year, and I'm disappointed in the collection in general. It is so good for kids to see this stuff and it makes me so angry that the homophobes are somehow winning. It feels representative of the general publica opinion on pride too... for fucks sake the first pride was a riot.",
            "My initial reaction to reading the little pride communication they put out on myday was to be kind of pissed they didn't even acknowledge last year's bullshit, but upon further reflection I'm kind of glad they didn't because nothing they would realistically put in that would really be anything other than bullshit. None of the LGBT team members at my store I've spoken with believe target pulled pride last year for TM safety, and most are of the mind that it actually made us less safe because it emboldened people. Moreover... target just really doesn't give a shit about store level TMs, no matter what they say. Our benefits are worse than industry average, the safety culture in stores is nonexistent IME, hours are constantly cut but expectations are always on the rise. Hell, during peak covid, HQ got to work from home, district leads got to check in on us virtually while store and DC still had to show up every day with an unenforced mask policy and a cart wiper who got pulled to do other shit as soon as they clocked in.\n\nThere are  signup sheets in my store for volunteers for local pride events that are completely empty, and I imagine they'll probably stay that way. Nobody at my store wants to represent target at a pride event after last year."
        ]
    },
    "[HOLIDAY] Thursday, July 4th is Independence Day.": {
        "title": "[HOLIDAY] Thursday, July 4th is Independence Day.",
        "score": 36,
        "url": "https://www.reddit.com/r/Target/comments/1dqol06/holiday_thursday_july_4th_is_independence_day/",
        "content": "\nFor those of you who are paid by the hour and are scheduled this coming Thursday, you WILL receive 1.5x your normal hourly rate. $15.00 times 1.5 is $22.50. [If your area's starting wage is above $15/hr](https://www.reddit.com/r/Target/wiki/asants/storewages), you will receive 1.5x pay based on what your compensation rate is.\n\nThe next Target recognized holiday is Labor Day on September 2nd. Independence Day is also the second to last time-and-a-half paid day of the year, so enjoy it while you can!",
        "num_comments": 10,
        "comments": [
            "Naturally, I didn't get scheduled for it. Oh well, a day off is fine too.",
            "8 hour shift bros where we at!!!",
            "Nice I work 4 hours that day",
            "So does Holiday pay have a cap or not? Is it capped a 8 hours? Many people say different mixed things and I never remember to ask HR before these days happen.",
            "It's one of my days off we don't get an FDC truck so I'm SOL ",
            "I didn’t get scheduled (since it’s a regular day off for me) but I still put in a request for PTO on that day (which was approved),",
            "I usually get every 1.5x holiday off too but luckily this holiday falls on a freezer day so I’m scheduled by default 😆",
            "thats me but imma stay even longer to make it 9 or 10 hours :)",
            "ive managed to work 9+ hours on them and know of people who work 12+ hours on them",
            "i work at least 12 hours every 1.5x day in addition to 40 hours in the other four days of the week and i've never had HR issues"
        ]
    },
    "Ugh Teenagers": {
        "title": "Ugh Teenagers",
        "score": 182,
        "url": "https://www.reddit.com/r/Target/comments/1dqzbop/ugh_teenagers/",
        "content": "So some teenagers today stole a walkie and all day have been messing around on it saying random crap and playing music\n\nFirst, said there's shit in the men's restrooms can someone come clean it up. (First sign we knew something was up)\n\nSecond, said there's a fight outside, nothing was happening outside.\n\nThird, went on our channel and started to respond anytime we said anything on walkie and we didn't recognize their voices so we knew.\n\nAnd lastly so far, started to play the Wellerman  through the walkie.\n\nUgh I love teenagers, especially on a Friday night where we already don't have enough people and now this.",
        "num_comments": 26,
        "comments": [
            "Happened at my store once. They said someone was wanking in produce. We don't have produce. Otherwise they might have got us for a bit lol",
            "Good grief... at least they're battery powered so it'll eventually just shut off?",
            "\"They're gonna clean up your looks\"",
            "When I was security, this happened to someone while on the floor, and the parents came in with their kids kicking and screaming to apologize. Unfortunately, the employee was let go, but it wasn't their first infraction. They lost floor keys but a little old lady brought them to one of the managers.",
            "Last time we had a stolen walkie incident our mystery teenagers just said slurs",
            "lmao it was probably one of those people who do “harmless pranks “ for\ntiktok vids 😭",
            "we had someone steal a walkie last year and say the absolute most vile shit you can think of for what seemed like weeks.. the walkie just never seemed to die i guess. not really fun helping out a guest and all of a sudden hearing the hard R being screamed :(",
            "They stole a walkie from my store before I started working, they just nonstop played porn so everyone turned off the walkies until the next day 😂.",
            "At my store we just throw out teenagers immediately if they’re start doing dumb stuff…AP has had enough so warnings are not given to them anymore",
            "We’ve had a number of kids/teenagers recently who have been goofing around with the motorized carts.  I’ll be so glad when school starts back up."
        ]
    },
    "Found this while doing priority pulls today": {
        "title": "Found this while doing priority pulls today",
        "score": 191,
        "url": "https://i.redd.it/saaaefwqsd9d1.jpeg",
        "content": "",
        "num_comments": 10,
        "comments": [
            "I wouldn't blame them for doing that. Because their motto is expect more pay less. They don't pay more but expect more work with less people.",
            "In the DC I find a new note every week lol",
            "I guess somebody doesn't like the company much (?)",
            "They got a .05% raise with the last review cycle.",
            "so tru bestie",
            "environmental storytelling",
            "I agree",
            "Vibes",
            "That's the spirit.",
            "And? Nothing unusual."
        ]
    },
    "There are no words": {
        "title": "There are no words",
        "score": 55,
        "url": "https://i.redd.it/tm7ka5ghjf9d1.jpeg",
        "content": "",
        "num_comments": 10,
        "comments": [
            "this is the inverse of people who take the plastic off the shrinkwrapped art/pop-up books in entertainment",
            "This is too funny. I had a coworker ask once should he take off the plastic from the decorative pillows. I said, um yeah. The customers may want to feel the texture. ",
            "and I can just hear \"but they came like that!! what do you mean it isn't a 2 pack!!! it was on the shelf!!!!\"",
            "I'm always finding those floral legal pad mutlipacks unwrapped 😭",
            "yep! I couldn't remember the exact number, I haven't been in stationary in a while",
            "Meanwhile you'll get clowns up remove boxes of Caprisun out of multi packs thinking they're singles. \n\n\nOr in my area, a box of danimals that looks like it's made for a box display for individual servings but it's still a whole case in one. ",
            "With 2 exclamation points!!",
            "The 3-packs…right?",
            "https://preview.redd.it/t6ldbea4lf9d1.jpeg?width=3024&format=pjpg&auto=webp&s=92c93e4d681f21d64be13ca648c6717a7b591d50\n\nsame.",
            "https://preview.redd.it/yd7xhw6h1g9d1.jpeg?width=484&format=pjpg&auto=webp&s=f3ad7577d18052c25de292cc36d6d6bb0ff5cccd"
        ]
    }
}