{
    "Taskmaster Australia - S2E06 - Discussion": {
        "title": "Taskmaster Australia - S2E06 - Discussion",
        "score": 54,
        "url": "https://www.reddit.com/r/taskmaster/comments/1dplwxz/taskmaster_australia_s2e06_discussion/",
        "content": "Tonight on [Network 10](https://10play.com.au/), join Tom Gleeson as the Taskmaster, and Tom Cashman as his assistant as they put the newest series of contestants through their paces.\n\nThis season features [Anne Edmonds](https://taskmaster.fandom.com/wiki/Anne_Edmonds), [Jenny Tian](https://taskmaster.fandom.com/wiki/Jenny_Tian), [Josh Thomas](https://taskmaster.fandom.com/wiki/Josh_Thomas), [Lloyd Langford](https://taskmaster.fandom.com/wiki/Lloyd_Langford) and [Wil Anderson](https://taskmaster.fandom.com/wiki/Wil_Anderson).\n\n\\--------------------------------------\n\n**NEW HERE?** Please familiarize yourself with the rules of the subreddit before posting. We don't tolerate any sexism or bigotry towards contestants or users – posts & comments of that nature could lead to a ban. Thanks!\n\n\\--------------------------------------\n\n**DISCORD:**\n\nJoin our discord server for live episode discussion and a whole lot more: [https://discord.gg/WuddpyZadE](https://discord.gg/WuddpyZadE)",
        "num_comments": 204,
        "comments": [
            "\"I VOTED YES FOR NOTHING\"",
            "I haven't seen such an epic fail on a duck-related task since Ed Gamble",
            "\"Number five I accuse you of being a goose!\" - Jenny (oh Jenny)\n\n\"You got zero from the same task twice\" - Greater Tom",
            "I love that theyve revisited tasks twice now! Using Lloyds challenge as a bonus, and Jenny having a second chance on the ducks.",
            "I'd already lost it at Jenny's duck duck goose attempt, composed myself, and then the fluke task . . .",
            "My mum absolutely lost it when Jenny said she used a matrix again",
            "Wil's giggling this episode is sending me.",
            "Has Jenny just become the first contestant in Taskmaster history to get 0 points on the same task twice?",
            "Josh actually fluked the duck task. Would've been funny if he brought that up for the fluke task hahha",
            "Jenny's extended duck duck goose task was so funny. Perhaps one of the best Taskmaster moments ever"
        ]
    },
    "Weekly spotted/alumni/chat thread for June 23, 2024": {
        "title": "Weekly spotted/alumni/chat thread for June 23, 2024",
        "score": 12,
        "url": "https://www.reddit.com/r/taskmaster/comments/1dmklc3/weekly_spottedalumnichat_thread_for_june_23_2024/",
        "content": "This is your weekly thread to drop your links or stories that might not be relevant enough to get their own thread. Good examples include:\n\n* Taskmaster alumni appearing elsewhere (TV shows, tour dates, etc.)\n* Selfies and pictures featuring alumni\n* Sharing ideas about Taskmaster themed parties\n* Random pics of things that remind you of Taskmaster (I'm looking at you, rubber duck.)\n\nThis is something new we're trying to give you a place to share these sorts of posts . A new post happens every Sunday at noon (UTC). Be sure to follow this post if you want to see updates!\n\nHave fun!",
        "num_comments": 12,
        "comments": [
            "On Tuesday I went to a recording of Ivo Graham's Obsessions for BBC Radio 4 at the Marylebone Theatre. Ivo is the host and one of the celebrity guest obsessives was John Robins. I was surprised when his obsession for discussion wasn't Freddie Mercury and Queen. I think the producer said they expect the series to be broadcast in September.",
            "Lenny Rush is in the latest two episodes of Doctor Who.",
            "I realized because there's been 17 seasons and 3 NYTs, there have been exactly 100 contestants on Taskmaster.",
            "Elden Ring DLC: Rada Fruit. \n\nMe: You mean pineapples?",
            "Are you allowed to tell us what John's obsession was? Because I have some guesses but I'm so curious and September feels like a long time to wait",
            "In case it is meant to be secret, it's someone whose name also starts with Fr, and who is best known to most people for the eccentric names he gave his children, and his facial hair!",
            "Okay thanks, that was definitely one of my guesses! Er, I mean, I totally have no idea who youre talking about because youre being so secretive!",
            "Nick Mohammed playing the world's worst comedy writer in Steven Moffat's 'Douglas is Cancelled' which just dropped in it's entirety this week.\n\n\nHe gets confused with a hired car driver played by Joe Wilkinson.",
            "*taps nose and winks*",
            "Joanne McNally is going to be in Portland, OR this October! https://polarishall.com/"
        ]
    },
    "It's not quite Greg's golden noggin, but it's the closest I'll get": {
        "title": "It's not quite Greg's golden noggin, but it's the closest I'll get",
        "score": 122,
        "url": "https://i.redd.it/0jlerxwflg9d1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "I love that Greg played a ruthless tyrant and everyone spends the episode trying to get his head. I think there could be a panel show format in there somewhere.",
            "I believe this piece is called When Your Friend Tells You He's Leaving... Check.",
            "At least it looks a bit like him",
            "I thought it was Greg as a space marine there  \n\nNow thats a cameo Amazon needs to make happen ",
            "I just watched this episode last week!",
            "I wonder if a bts photo exists of Greg posing with his own prosthetic head, like a creepier version of what people do with their figures at Madame Tussauds.",
            "I cant look at it!",
            "Good episode. Greg made for a fun villain.",
            "That looks nothing like the comedian Greg Davies, Greg has had a beard for years",
            "Halfway between Greg and Alan Rickman."
        ]
    },
    "The Task that broke the contestant...": {
        "title": "The Task that broke the contestant...",
        "score": 94,
        "url": "https://www.reddit.com/r/taskmaster/comments/1dr5194/the_task_that_broke_the_contestant/",
        "content": "In TM Aus a contestant mentioned how there was one task that \"broke him\" and I was wondering what you think that task was for other contestants. Not something they were bad at, but something they probably thought about days later asking \"what did i even think i was doing?\"\n\nSome examples would be:\n\nEd Gamble and the duck task from CoC\n\nKatherine Parkinson and the spider\n\nDavid Correos and the grape",
        "num_comments": 92,
        "comments": [
            "David Correos shoelace prank task in Taskmaster NZ comes to mind.\n\nOthers include Ed Gamble and the 7 tasks task, Johnnys beer mat house and Bridget trying to find the phone and being left on her side banging a pan.",
            "Ed Gamble and the live task where he had to draw on Baddiel's back. The rage almost came out his ears",
            "She was already a little broken I think, but the pedometer task absolutely destroyed Bridget Christie.",
            "Dara trying to find the back of his hand. He said the task haunted him for ages.",
            "Danielle Walker with the password task and Jenny Tian on the duck task.",
            "This weeks taskmaster Australia. Duck duck goose broke Jenny Tian for sure",
            "Joe Thomas and his lovely hinged legs",
            "Susan Wokoma and the suitcase of forks and marbles haha",
            "Literally Ursula Carson broke her collarbone doing a task that we've never seen!",
            "Rhod's satsuma broke James Acaster"
        ]
    },
    "Greg Davies voice over work": {
        "title": "Greg Davies voice over work",
        "score": 119,
        "url": "https://v.redd.it/6481s2lq4f9d1",
        "content": "",
        "num_comments": 3,
        "comments": [
            "The birth of the \"Alex is secretly a horrible person\" meme",
            "Alex looks genuinely quite hurt by that one.",
            "These two are such a great team. Protect them at all cost!"
        ]
    }
}