{
    "Weekly r/Tattoos Question/FreeTalk Thread! - June 03, 2024": {
        "title": "Weekly r/Tattoos Question/FreeTalk Thread! - June 03, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/tattoos/comments/1d72ou1/weekly_rtattoos_questionfreetalk_thread_june_03/",
        "content": "***It's question time!***\n\n------------------------------------------------\n\n\n\nPart of our subreddit's recent transformation includes a new weekly discussion thread! Ask any question you'd like, and people from our community will give you their most honest opinions/answers. Please remember that most usual rules apply.\n\n\n\nImportant rules:\n\n------------------------------------------------\n\n\n\n- No **aftercare/medical questions/advice**\n\n- No **pricing questions/advice**\n\n- Please be kind to your fellow tattoo-lovers, and follow [reddiquette](https://www.reddit.com/wiki/reddiquette)\n\n\n\nSome examples of things to ask the community about:\n\n------------------------------------------------\n\n\n\n- Tattoo placement\n\n- Skin tone\n\n- Tattoo subject/style/design\n\n- Recommended tattoo artists in your area\n\n- Pain\n\n- *Anything else you'd like!*\n\n\n\nIf you're asking about your tattoo, please provide an image of the stencil or final tattoo, rather than elaborately describing it in a paragraph. Also, remember that unless a user has a verified flair, their advice *may not* be coming from a history of tattooing.",
        "num_comments": 124,
        "comments": [
            "Hey I’m thinking about getting a tattoo. I’m an autistic male has anyone that’s autistic had tattoos before here? I’m worried about getting overstimulated and melting down or not being able to finish the tattoo. I’m high functioning I’m just scared because I do have a decent amount of sensory issues.",
            "Hi! It might feel out of topic, but I'm an aspiring tattoo artist and was looking for information about how you started. I feel a bit lost. I know that I have to draw, I have a good basis (anatomy and can draw in different styles), and I practice. But I don't know where to start to get a \"book\". Should I draw flash tattoo sketches? Should I explore how to place a tattoo? Should I learn how to draw in American Traditional, Neo Traditional, New School, Black and Grey, Realism, Japanese, Tribal, Script / Lettering, Watercolor, and Geometric tattoo styles? I have no idea.",
            "Any tattoo artist recommendations in Croatia or Albania?",
            "If there are any tattoo artists in here, has anyone brought an AI generated tattoo to you? If they have, did you tattoo it on them?\n\nMy friends and I were talking about them and we’re pretty divided on it. But none of us are tattoo artists. Just looking for some opinions from artists.",
            "So far I've got one tattoo, wrist/lower arm, all tickety-boo. I'm ready for my next one, I know what I want and that I want it to go on my thigh, above the knee.\nI live in Scandinavia, so it's gonna be warm for the next 3, 4 months,  then shorts and dresses without tights are a no go.\nShould I try to see if someone can get me in in the next month or so, so I can let it breathe as much as possible? Or is it wiser to get it in autumn, so I don't have to cover it when swimming outside? Obviously that will mean fabric covering it pretty much all the time.",
            "Is there actually a big difference between a very expensive tattoo gun and a cheap knock off? I’m asking about the battery powered ones.",
            "Looking for a TRASH POLKA tattoo idea. Thinking a sleeve. I love the song “Demons” by Imagine Dragons and was hoping to capture some imagery and lyrics into the tattoo.",
            "I'm trying to find a fine line tattoo artist and/or baroque painting tattoos in WA/OR. From Seattle to Salem ideally, but im open to further away. I'm having a very difficult time finding exceptional artists for these.I love tattoos of the human figure and florals/animals in particular. Pls help I've been looking for so long",
            "Does anyone know of any tattoo artists near NC who do softer realism? I like the styles of @dorok.tattoo (insta) and @mustafaalakoc_ (insta) but neither of them are even in the US. I haven’t been able to find a tattoo artist with a similar style close to me. So I was just wondering if anyone knew of any? I’m open to traveling a bit it doesn’t have to be in NC. I just don’t want to drive more than like 6 hours or so.",
            "So I'm interested in getting a half sleeve traditional Japanese with a Koi on my upper left arm. I alredy have 2 tattoos on my lower arm that are not trad Japanese. One is a portrait of my dog who passed and the other is sone orchids that wrap around a bit on my forearm. Would these existing tattoos clash with a trad Japanese sleeve on the upper arm?"
        ]
    },
    "Weekly r/Tattoos Question/FreeTalk Thread! - June 24, 2024": {
        "title": "Weekly r/Tattoos Question/FreeTalk Thread! - June 24, 2024",
        "score": 0,
        "url": "https://www.reddit.com/r/tattoos/comments/1dnbrot/weekly_rtattoos_questionfreetalk_thread_june_24/",
        "content": "***It's question time!***\n\n------------------------------------------------\n\n\n\nPart of our subreddit's recent transformation includes a new weekly discussion thread! Ask any question you'd like, and people from our community will give you their most honest opinions/answers. Please remember that most usual rules apply.\n\n\n\nImportant rules:\n\n------------------------------------------------\n\n\n\n- No **aftercare/medical questions/advice**\n\n- No **pricing questions/advice**\n\n- Please be kind to your fellow tattoo-lovers, and follow [reddiquette](https://www.reddit.com/wiki/reddiquette)\n\n\n\nSome examples of things to ask the community about:\n\n------------------------------------------------\n\n\n\n- Tattoo placement\n\n- Skin tone\n\n- Tattoo subject/style/design\n\n- Recommended tattoo artists in your area\n\n- Pain\n\n- *Anything else you'd like!*\n\n\n\nIf you're asking about your tattoo, please provide an image of the stencil or final tattoo, rather than elaborately describing it in a paragraph. Also, remember that unless a user has a verified flair, their advice *may not* be coming from a history of tattooing.",
        "num_comments": 78,
        "comments": [
            "Is tattoos requiring lots of white not recommended. I want a bird species that is primarily white in colour.",
            "how does a tattoo above the bend of the elbow compare pain wise to getting botox for migraines or an iv?",
            "Does anyone know of any good medieval wood etched style tattoo artists in Melbourne, Aus?",
            "Hey guys I tried making a post but I can't, so hopefully I csn leave a comment here and if any of you guys could help me out that would be great, so I am wanting a full ancient egypt backpiece as my next tattoo I have a photo of a design that I like and that I think will base my design off, obviously adding my own changes and such. If anyone would like to see the photo I have please private message me so I can show you as I would love to hear your input on the tattoo and any recommendations you think may be good to add. Thanks",
            "Can dark colors be covered with lighter colors? If so, whats the result? Ex: Pink over brown? Green over black?",
            "I have an allergy to all forms of alcohol. Am I even able to get tattooed? Are there artists that can tattoo without the use of alcohol?",
            "Looking for a tattoo artist who commonly tattoos objects in black and grey. Pretty simple, shaded. Looking to get an illustrative tattoo of a piece of furniture. Preferably east coast but open to anywhere.",
            "I just moved to Colorado (Denver - five points area) and am looking to get a few pieces. One is a black/gray hourglass on my ribs, the other more cartoonish bird driving a racecar. Any recommendations for artists/shops for either? I'm a bit overwhelmed with the number of shops in the city!!",
            "Are fake/temporary tattoos any good? Where can I get them online and is there any place I can get custom temporary ones? \nI've seen ads recently but I don't remember the brand or anything are there any recomendable brands for temporary tattoo sleeves or small ones? Thanks",
            "This sub probably gets this question alot. But i wanna know. \n\nDo tattoos HAVE to mean something? Is it bad if i get something that i think looks cool just for that purpose? I don’t mean getting a certain tattoo because it’s trending or something."
        ]
    },
    "Leg sleeve done by me (Ivan Zagusta) at Zaraza tattoo shop in Warsaw, Poland": {
        "title": "Leg sleeve done by me (Ivan Zagusta) at Zaraza tattoo shop in Warsaw, Poland",
        "score": 10373,
        "url": "https://www.reddit.com/gallery/1dqso6b",
        "content": "I did this leg sleeve in 8 sessions at Zaraza tattoo shop in Warsaw. ",
        "num_comments": 410,
        "comments": [
            "woodcut tattoos are so fuckin dope",
            "This is the best tattoo I’ve ever seen",
            "Thank you all folks for your kind words! I really appreciate that so many people like my works. It’s a big honour for me. 🙏🏽🙏🏽🙏🏽🤟🏽",
            "This is the sickest leg sleeve I have ever seen.",
            "I LOVE IT!! That’s beautiful",
            "Holy moly! That’s just flat out amazing! Excellent job, sir.",
            "It's not really a sleeve on the leg, why don't we call it a pant 🤔\n\n(Also it's fucking gorgeous I love it)",
            "So very cool. Beautiful work.",
            "Amazing work! Do you have an Instagram?",
            "dont let me near that on acid i will be looking for waldo all night"
        ]
    },
    "My trippy octopus, by Jon Dredd at Crucial Tattoo, Salisbury, Maryland": {
        "title": "My trippy octopus, by Jon Dredd at Crucial Tattoo, Salisbury, Maryland",
        "score": 183,
        "url": "https://i.redd.it/153gntwyjh9d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "This is amazing!\n\nSo, I'm going to get a sleeve myself this year, are elbows really as bad as they say? What can I expect?",
            "Awesome man how many sessions was it",
            "Straight up one of the best and coolest tattoos I've been blessed to lay my eyes on",
            "I think so too. Jon's an awesome dude, and I couldn't be happier with the end result.",
            "Thanks, man.\n\nUh, quite a few. Like maybe 60+ hours. I stopped keeping track. Sessions were usually 4 to 6 hours.",
            "Dang, yeah, for me it's gonna depend on the final design, I have a first appointment soon, so we'll see if there's going to be a lot on the elbow.\n\nIf it looks good, it looks good!",
            "I have a very traditional japanese octopus tattooed on my right arm.  I may be biased to octopos tattoos.  :-)",
            "Thanks!\n\nSucked pretty bad, yeah. We had trouble getting the color to stick in that area too, so ended doing two, *maybe* three passes over it before deciding it was as good as it was gonna get. \n\nGood times good times.",
            "That is fantastic",
            "Thank you for the submission, optimistically_eyed! Please make sure your post follows the guidelines found in the sidebar, or it will be removed. If you're asking a question, please delete your post and ask in the pinned Weekly Discussion thread.\n\n###Users, please report any comments that break rules, such as ANY comments on personal appearance (both insults and compliments), promotion, or unnecessary rude judgment.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tattoos) if you have any questions or concerns.*"
        ]
    },
    "Pretty keen on my peach by Eunice at Empress Tattoo in Chattanooga, TN!!!": {
        "title": "Pretty keen on my peach by Eunice at Empress Tattoo in Chattanooga, TN!!!",
        "score": 258,
        "url": "https://i.redd.it/3vodkka7ye9d1.jpeg",
        "content": "",
        "num_comments": 16,
        "comments": [
            "Dope peach! those water droplets are 🤌🏼🤌🏼🤌🏼",
            "I can't tell if the artist somehow managed to work in the texture of a peach skin, or if it's skin follicles. Either way - very realistic!",
            "You might even say it’s…peachy keen! 😂\n\nSeriously though, that’s really well done! Dig it!",
            "Are you movin’ to the country?",
            "Stunning, and I like the blackberries(?) up top too!",
            "Thank you!! She’s SUCH a gifted artist, has a ton of different pieces up in her studio!",
            "The speckling is mostly my skin, which is a baby and hates being shaved, it’s also noticeable on the leaf closest to the fruit. That brown dot on the edge is actually a birthmark!",
            "My dad played that when I got home 😂 I’ve been sent lyrics from Chevelle, The Stranglers, The Front Bottoms, and Prince for the past few days",
            "They are and thank you!! JJ at The Hive in Gainesville, Georgia did them!!!",
            "Ooh! Well that worked out well!"
        ]
    }
}