{
    "📣 Reddit is killing 3rd party apps with absurd API pricing": {
        "title": "📣 Reddit is killing 3rd party apps with absurd API pricing",
        "score": 104,
        "url": "/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/",
        "content": "",
        "num_comments": 22,
        "comments": [
            "Hi, ghost mod here. I've been hearing about this and think it's bullshit, but assumed my mod status must've been revoked long ago with how long I went unable to dedicate time to this sub.\n\nRegained access to my account, and discovered I'm still technically a mod, but sure enough, I was absent long enough that the system doesn't register me as active right away- I was thus initially unable to take the sub private in support of the protest, but thought I'd at least give this post whatever extra traction the pinned position may bring.\n\nIt's a bittersweet feeling, since I'm in a much more stable place in life that would enable me to do much more with the sub, expand the team, and provide a smoother, better experience for everyone interested (which is a huge amount of people at this point, holy shit)- but these changes don't fare well for the site in general.Thanks for reading. I'll post updates / plans for the mod team as soon as there are any... If you have any suggestions, I'll be keeping an eye on the modmail inbox again for the foreseeable future.  \n\n\nEDIT: The sub remained private from June 15th until just now- I've unlocked it after receiving the same threat from the site's administration that other moderators have received, about forcefully replacing them due to the protest efforts."
        ]
    },
    "Please ignore all DMs from people claiming they'll make a design for you, especially new/empty accounts.": {
        "title": "Please ignore all DMs from people claiming they'll make a design for you, especially new/empty accounts.",
        "score": 75,
        "url": "https://www.reddit.com/r/TattooDesigns/comments/1b04lsl/please_ignore_all_dms_from_people_claiming_theyll/",
        "content": "##This is now an official rule, all posts asking for art or offering to draw for people will be removed.\n\nThis sub has a huge problem with bots, scammers, and people who have no idea (or don't care) how to find clients. It's not an official rule but this really isn't a sub to hire anyone, people come here asking for ideas and will get bombarded with DMs.\n\nTalk to your tattoo artist about designs, do not hire a nobody with a brand new Reddit account with a name like hungry-aardvark1234 (currently unused name as an example). Most artists worth your time are going to have a waitlist, they will not DM you on Reddit with an immediate offer. And it's part of your artist's job to help come up with what they'll tattoo on you **and** not all of them will tattoo someone else's art anyway.\n\nIf you really want to show them a drawing to help with visuals, check out r/DrawMyTattoo where someone can sketch your idea for free. Ignore anyone trying to charge you, that's money that should go to your artist.\n\nIf you're an artist who attempts to find clients in this sub, don't. You look fake and desperate, you're one of dozens spamming people with \"I can help, DM me\" so OP can't even tell who's legit.\n\nAnd I'm not here to argue this point, so if you have a problem with this announcement, that's too bad. I'm here to try to keep this sub a friendly place, people shouldn't have to worry about getting scammed.",
        "num_comments": 4,
        "comments": [
            "This has happened to me whenever I posted something Design related. However, I knew those were fake accounts and stopped posting anything regarding tattoo designs .",
            "Every post I made here I got hit with people trying to sell me drawings like gtfoh.",
            "If you ever have to ask, the sale was already lost. \n\nWish people knew this."
        ]
    },
    "Update on my Cherry Blossom": {
        "title": "Update on my Cherry Blossom",
        "score": 1435,
        "url": "https://www.reddit.com/gallery/1dqrsdj",
        "content": "Got color added to the blossoms yesterday. Likely two or more appointments left. Next one is to give more definition, color, and detail to the trunk & the branches. Addressing the hard cutoff at my wrist as well before its done. Falling in love with my artist, looking forward to my next color appt. \n\nFeedback is welcome and appreciated.",
        "num_comments": 160,
        "comments": [
            "Ok, you asked for honest feedback so i'll tell you what I think: it looks like a rash. A really, really painful rash. Maybe it's where the paler pink is applied that gives it that 3D \"raised skin\" effect, but I would suggest to go over it with a darker color, or to have just a bit of black to define the petals, because right now I don't think it looks good :(",
            "Pink and white with no outline will disappear after a summer outside. Just a heads up.",
            "I have a watercolor tattoo that is 13 years old and still looks brand new. Same with my other one on my arm that was started 4 years ago. No black outline. A lot of tattoo artists don’t like watercolor tattoos, it’s a preference thing. I’ve been hearing it for many years. But you don’t need black lines. It looks great! Who did it?",
            "It looks sick, and not in the rash way. \n\nI have contact dermatitis and polymorphic light eruption and have seen tons of cases of eczema and psoriasis, I don't know how anyone could mistake this for a skin condition.",
            "Do something around the base your wrist the stump so it’s not just a stump",
            "looks really good to me",
            "For whatever’s worth, I really like the tattoo and the placement!",
            "I think it just needs more contrast. Will you be adding any color to the background? :) like blue sky or something? I think that would help contrast the pink and red in the blossoms with your pink undertone. If not maybe some black outlines on the blossoms (doesn’t have to be crazy thick lines)",
            "Wtf is wrong with y’all this tat is sick!",
            "Look if you’re happy w it ….. don’t post it here"
        ]
    },
    "Is this tattoo poorly done?": {
        "title": "Is this tattoo poorly done?",
        "score": 1937,
        "url": "https://i.redd.it/h8tzv4dhjc9d1.jpeg",
        "content": "I got this tattoo about two years ago. I feel like some shading could really elevate it. Looking for some unbiased opinions I guess since everyone around me says they love it lol. ",
        "num_comments": 306,
        "comments": [
            "Lines are wonky but overall it's legible so no need to worry",
            "Lines on the diamond could be sharper, but it's pretty nice overall",
            "I agree the lines are wonky, but they’re consistently wonky so it almost feels like that’s the style. I love the design.",
            "It’s cool, don’t overthink it. ",
            "90% of the lines are wonky as hell but could easily be hidden with some nice shading tones! \nMe personally I wouldn’t go to the same artist for the shading, try n find someone who’s don’t mind going over someone else’s work and have the tighten it up for you",
            "I love it. The fact that it isn't perfect adds to the charm, in my opinion. I have a tattoo that I love that has started to fade and I actually like it more now.",
            "The lines are pretty wonky",
            "I dig it a lot",
            "It looks good. No one is ever gonna look at your tats under a microscope.",
            "If you saw some of my tattoos, you wouldn’t be complaining 😂"
        ]
    },
    "I finished this tattoo today! What do you think?": {
        "title": "I finished this tattoo today! What do you think?",
        "score": 63,
        "url": "https://i.redd.it/bc9ze5x62f9d1.jpeg",
        "content": "A baby nine tailed kitsune.",
        "num_comments": 4,
        "comments": [
            "Gorgeous, love the colouring :)",
            "Looks good! love the color choice!",
            "its a good tattoo\ni like the colour combo you went with",
            "Thank you for the submission, Shawthon! Please make sure your post follows the guidelines found in the sidebar. If you're asking for design advice, **please ignore all DMs** from anyone offering to sell/give you art, unfortunately you're bound to get more scam replies from this sub than actual artists. You can read more about it [in this mod post.](https://www.reddit.com/r/TattooDesigns/comments/1b04lsl/please_ignore_all_dms_from_people_claiming_theyll/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TattooDesigns) if you have any questions or concerns.*"
        ]
    }
}