{
    "Subreddit Updates - Rules & AutoMod Commenting": {
        "title": "Subreddit Updates - Rules & AutoMod Commenting",
        "score": 17,
        "url": "https://www.reddit.com/r/tax/comments/1amtqnq/subreddit_updates_rules_automod_commenting/",
        "content": "Hey r/tax, I'm a relatively new mod to this group in the last 3-6 months, looks like the long time mod quakerots left a few months back and quite a few of the AutoMod actions are outdated from the pandemic, so I'm looking at updating the rules and AutoMod commenting and would like to get feedback from subreddit users\n\nAs a reference, [here's the post](https://old.reddit.com/r/tax/comments/3zf1bs/before_you_post_see_if_you_can_find_your_answer/) that used to be pinned with a bunch of the IRS links, unfortunately I don't think people in general tend to look at pinned posts if they're looking to get a specific question answered\n\n**AMA Announcement**: There will be an [AMA on Feb 12th with USAToday](https://old.reddit.com/r/tax/comments/1anizkt/upcoming_usa_today_ama_feb_12th_noon_to_3_pm_et/) personal finance team 12-3pm ET\n\n## Rules\n\n### [Current Rules](https://old.reddit.com/r/tax/about/rules/)\n\nThey're pretty simple - be nice, don't solicit business, no self promotion\n\n### New Rules\n\nNo AI generated comments/content - it's low quality, and we're not here to be AI fact checkers\n\nNo discussion of tax fraud - openly suggesting/supporting tax fraud calls into question the reliability of the comments here, of course people should always take reddit advice with a grain of salt, but suggesting fraud on top of that just degrades the subreddit\n\n**Anything else specific that frequent subreddit users would like to see added?**\n\n## AutoMod Commenter\n\nI've removed all the oudated auto-comments/removal, here are the new ones I'm thinking of adding - note that these would just be an FYI comment on the post, the post itself would not be removed, just saves frequent users the effort of linking the same things or re-iterating the frequently asked questions around this time of year\n\n -  **Explaining how tax brackets work** - users could comment \"!ELI5taxes\", AutoMod would reply with a breakdown that's frequently repeated here - if someone has a preferred example they've seen here please link it in the comments\n\n -  **Explaining how tax refund works** - users could comment \"!ELI5refund\", AutoMod would reply with the paying cash at the grocery store example plus explaining lower refund vs lower paychecks\n\n -  **Return vs refund** - I've seen this one frequently mentioned as an AutoMod request, but I suspect figuring out the right regex trigger would be tricky as I wouldn't want it to just be blindly commented on every single post mentioning a tax return or refund\n\n -  **IRS withholding estimator** - [links to tool](https://www.irs.gov/individuals/tax-withholding-estimator) for updating W4(s) with summary of frequent mistakes like double counting dependents for married couples or not properly accounting for multiple jobs\n\n -  **Dependents** - links to [IRS dependent tool](https://www.irs.gov/help/ita/whom-may-i-claim-as-a-dependent), if someone wants to draft a summary with it then you're welcome to comment it here, just not sure if that's necessary as it could get lengthy \n\n -  **Do I have to file** - link to [IRS tool](https://www.irs.gov/help/ita/do-i-need-to-file-a-tax-return) plus summary\n\n -  **Others** - wishlist that may be helpful, but not sure if these are really needed/not sure of regex trigger\n\n  - $600 threshold for 1099-K\n\n  - Do I have to include x income?\n\n  - How do I report income without a 1099/Do I have to? (similar to previous)\n\n  - When will I get my refund?\n\n - 1099 vs W2 misclassification\n\n - Can I claim x if I work from home? (Think these have mostly died down the last 1-2 years)\n\n**Open to any reasonable/genuine feedback on these from frequent users of the subreddit**",
        "num_comments": 51,
        "comments": [
            "Perhaps a warning/[link](https://www.irs.gov/newsroom/taxpayers-should-beware-of-ghost-preparers) about ghost preparers or how to find a reputable preparer? And/or a warning about scammers reacing out via comments/DM? I know that These Things Happen, I Know Stuff, Its A Write Off, and I have all responded with warnings to posts saying 'send me a DM, I can help.'\n\nI generally push folks to credentialed preparers and the IRS directory, but I also recognize that not all credentialed preparers are listed in the directory, and that there are some very fine preparers without credentials for various reasons.",
            "Yo, antonio, I have another off-the-wall idea, in case you're running out of things to think about 😎 !\n\nIS IT EVEN POSSIBLE ... to prevent people from deleting answered posts?\n\nI find it -immensely- frustrating to craft a quality response to a legitimate question, maybe even have a 2- or 3-level back-and-forth over a day or two ... only to have it all lost when the OP deletes the whole thing.  The good answers are left, but the original question is gone, ergo the answers are useless.\n\nCan that be prevented? OR, perhaps, can deletion requests go to a mod queue for approval?  Yeah, I'll concede that that makes more work, but some questions really were stupid and deleting them doesn't lose any knowledge.  But good answers to good questions can be retained...",
            "Keep the r/cantax autobot!",
            "Q: are blog links not connected with a specific tax preparer or professional ok? I've been thinking about making a blog just to help Non-filers get back into compliance - it won't have my name connected with it and no ads, so I won't benefit from it personally in any way.\n\nAlso I frequently link to taxcure.com, astps.org etc directories for people who need a tax resolution specialist. I hope those are still ok since they are directories.\n\nI'm sad quakerorts is gone - I hope they are well. And thank you for taking on mod work on this sub! I don't have any suggestions for auto mod posts off the top of my head.",
            "I’m late to the party but I’m wondering if there’s a way to prevent or even just warn people about unhelpfully vague post titles like “tax question”?",
            "**Also Others -**\n\n* I live in state «X» and work in «Y», how to pay taxes.\n * *Edit:* Recognising every combination of two states, plus NYS and NYC for example, is impractical.  You might be able to intercept a majority just by triggering off of NY (plus NYS and NYC), PA, and NJ.  Apparently few people in Delaware have this problem!\n* I \"forgot\" to file taxes for the past four years, or I \"forgot\" to include a form that just arrived, what to do.\n* ANY post with \"Can I claim...\" in it should link to the IRS' dependency tool -- if you can sort out the trigger 😉.\n\n&nbsp;\n\n* *Edit:* One more: there are three questions just today on 1095-A forms.  Candidate??",
            "[removed]",
            "I'd like to lobby that you restore the Helpful Links (either pinned or as a sidebar or wiki)! I check these in subs when I don't understand a topic, want to be considerate of other sub members, or to see what resources others have found useful. Also, if I'm trying to answer someone's question, it saves me time to have good links to point to that have already been vetted.\n\nWhile many people just post without checking, some people do check first. I know I did when I first joined the sub.  \n\nThanks for moderating!",
            "Wondering what the tax implication is on a non family member giving $100k to a friend? I understand that you can give up to 18k without reporting and can give up to 13M in a lifetime. I just want to make sure the giver is only liable for reporting and the receiver does not have a taxable event on their 100k. Any help is greatly appreciated!",
            "What about preventing tax fraud? That rule is counterproductive"
        ]
    },
    "Important Notice: Clarification on Tax Policy Discussions": {
        "title": "Important Notice: Clarification on Tax Policy Discussions",
        "score": 23,
        "url": "https://www.reddit.com/r/tax/comments/1dfu1dg/important_notice_clarification_on_tax_policy/",
        "content": "Hi r/tax community,\n\nWe appreciate and encourage thoughtful discussions on tax policy and related topics. However, we need to address a recurring issue.\n\nRecently, there have been several comments suggesting that \"taxes are voluntary\" or claiming that there is no legal requirement to pay taxes. While we welcome diverse perspectives on tax policies, promoting such statements is not only misleading but also illegal. This subreddit does not support or condone the promotion of illegal activities.\n\nTo clarify:\n\n* **Tax Policy Discussion:** Constructive conversations about tax laws, policies, reforms, and their implications.\n* **Illegal Promotion:** Claims or suggestions that paying taxes is voluntary or that there is no legal obligation to do so.\n\nIf a comment promotes illegal activities, our practice is to delete it and consider banning the user, either temporarily or permanently, based on their comment history.\n\nThis policy is in place to ensure that our subreddit remains a reliable and law-abiding resource for all members. We've had several inquiries about this topic recently, so we hope this post provides the necessary clarification.\n\nThank you for your understanding and cooperation.\n\n* r/tax Mod Team",
        "num_comments": 4,
        "comments": [
            "That is a good policy.  A few decades ago I regularly participated on a tax message board.  It was basically destroyed by those who in those days were known as \"illegal tax protesters.\"",
            "It probably doesn't help that the IRS literally says that taxes are based on voluntary compliance.\n\nOf course by \"voluntary\", they mean that you're expected to to comply without being asked. It doesn't mean you can choose not to. You can either voluntarily comply, or you will be forced to involuntarily comply when the IRS catches up to you, those are the two options. Usually voluntary compliance is more pleasant.",
            "Should this be included in the subreddit rules?",
            "I think voluntary compliance just means they don't take the taxes from you until after you earn the income.  In some countries, income tax is automatically taken out of income, like 9% out of every income source, and there are no tax returns to file.  They never see that money."
        ]
    },
    "Father hasn't filled taxes in 15-20 years": {
        "title": "Father hasn't filled taxes in 15-20 years",
        "score": 4,
        "url": "https://www.reddit.com/r/tax/comments/1dltg2l/father_hasnt_filled_taxes_in_1520_years/",
        "content": "So my father stopped filling taxes about 20 years ago, thinking that would stop his wages from being garnished for child support (but they were anyway? My mother got the checks). Now he's nearly 70, unable to work, and needs to get on Medicare and social security.\n\nTo my knowledge, he never owed taxes, since he was still paying from his paychecks. How will his lack of tax records affect getting benefits, and what can be done to fix this mess?",
        "num_comments": 12,
        "comments": [
            "His SS benefits are based on his work record, not his tax filings.  If he was working on the books this whole time, he has the credits to apply for SS benefits.\n\nNot filing is a separate issue.",
            "Hi!\n\nNOT a tax professional but I recently went through this same thing with my mom but she was 10 years non compliant. \n\nIt depends on if he owes money to the IRS or not. If he owes, they could put a lien/levy on his SS benefits. \n\nIf he doesn’t owe, I don’t think they’ll do anything. When filling out the SS application it doesn’t ask if you’re current on taxes but it will ask about income and health insurance coverage (approximate income amounts, dates coverage began, etc). \n\nTo find out if your dad owes, you can create him an account on the IRS website using ID.me (he’ll have to have a valid ID) OR you can request his transcripts online. \n\nYour dad should file 6 years of back taxes (2018-2023) as that is generally what the IRS requests to get back in compliance with them. You can do this for free or hire a tax preparer. If his tax situation is simple, I’d recommend doing it yourselves. He’ll have to mail in 2018-2020 while 2021 - 2023 can be e-filed. \n\nThe statute of limitations for the IRS to COLLECT money is 10 years but the statute of limitations for us as tax payers to get refunds is 3 years - so who knows, he might even get some money back for the 2021-2023 tax years. At a minimum, he should get a stimulus check back….assuming the IRS withheld those payments due to non compliance?\n\nYes, wage garnishments go through pay checks and not through the IRS. I think the IRS only levies money owed to them directly.",
            ">Now he's nearly 70, unable to work, and needs to get on Medicare and social security.\n\nIf he was a W-2 employee and his employer(s) properly filed copies of the W-2 forms each year, he is not required to have filed tax returns in order to qualify for SS and Medicare benefits.  (Not filing his tax returns is a separate issue.)\n\nBut his benefits won't start until he submits an application.  Also be aware that there is NO benefit to waiting until after age 70 to submit a Social Security application.  Maximum monthly SS benefits are paid when benefits start at age 70.  (Note I said maximum monthly benefits, not maximum lifetime benefits.)\n\n  \n\nSo the solution is to his benefits problem is to contact the Social Security Administration and submit an application.  The solution to his tax problems is separate.",
            "So he tried to screw your family over for 20 years and is an irresponsible ass - and you want to help him now that he can’t help himself? You are a much better person than I am.",
            "I have an uncle is a similar situation his wife died and he hasn’t filed taxes since 2004 he was a 1099 worker he got injured at work and can’t do that type of high paying work now. When he tried to get disability he pretty much got told to kick rocks so now he helps a guy doing some light carpenter work.",
            "Your father can use IRS form 4506-T to request his wage and income transcripts for the past 10 years. Those will have things like his W-2, 1099, etc. Note: they will not have state income tax withholding. He will need to reach out to his state income tax agency, and hopefully they will have that information.",
            "His Social Security and Medicare benefits will be based on the FICA taxes paid and reported on Form W-2, which is done by the employer and so will have happened regardless of whether he filed.\n\nHe should attempt to obtain as many years of records as possible to confirm that he did not owe additional tax in any year (this is not certain either way).  If he owes, the IRS will usually catch up eventually based on their records, and assess tax with interest and penalty.  If he overpaid (and was due a refund) in all of those years, there is basically no consequence other than the fact that the refunds from more than 3 years ago are forfeit (and he would not have succeeded at avoiding child support anyway).  The 3 most recent years of refunds (2021-2023) can still be claimed.",
            "Oh boy, I hope you got your brains from your mom.  Not sure your dad deserves the help, but good for you for doing it.",
            "Tax lawyer",
            "I just wanted to say that there is no statute of limitation for the IRS to assess and collect taxes if a return has never been filed!"
        ]
    },
    "Relatives listed me on the closing disclosure for inherited property as \"gift\"": {
        "title": "Relatives listed me on the closing disclosure for inherited property as \"gift\"",
        "score": 3,
        "url": "https://www.reddit.com/r/tax/comments/1dluim8/relatives_listed_me_on_the_closing_disclosure_for/",
        "content": "* This is regarding US taxes.\n* Grandparents left some property to their children, one of which would have been my parent who pre-deceased them, making me and my sibling next in line in terms of a per-stirpes distribution.\n* The property has recently been sold, and on the closing disclosure, the portions of the proceeds for my sibling and myself are labeled as \"gift\" rather than \"proceeds.\"\n\nWhat are the tax implications, and/or what are the relevant portions of tax code I should be looking at?",
        "num_comments": 2,
        "comments": [
            "How it's labeled on the closing disclosure probably doesn't matter.  Either you legally inherited the property or you didn't.   Are you sure the property was inherited via per stirpes and not per capita?  This sounds like a discussion to have with the executor of the estate.",
            "Sounds like a concern with generation skipping transfer tax to me. Although with your own inheriting parent deceased and not themselves inheriting anything, I wonder if the will was written before the death of your parent and it contemplated you receiving a gift separately from what your parent received.\n\nReading the will might help. On the assumption that the property is real estate, maybe the title company was trying to be proactive."
        ]
    },
    "Husband claimed daughter on federal taxes, but I’m the custodial parent": {
        "title": "Husband claimed daughter on federal taxes, but I’m the custodial parent",
        "score": 22,
        "url": "https://www.reddit.com/r/tax/comments/1dljdkj/husband_claimed_daughter_on_federal_taxes_but_im/",
        "content": "While doing my 2023 taxes I was informed that someone else had already claimed my daughter. It was my soon to be ex husband. He was with our daughter maybe 10% of the time the whole year. He said he did it because he would get a larger return and it was going toward my kid’s braces. I think you know where I’m going with this. I asked him about it and he’s ghosted me. I’m really certain it’s gone. I know it was incredibly naive of me, but he’s been emotionally abusive towards me for a decade, and I’m still trying to put my pieces back together. What can I do? He lives in a completely different city, and my child went to the school here, so I think I can prove it. I could really use some guidance as to he to proceed. ",
        "num_comments": 21,
        "comments": [
            "Paper file your tax return and claim your daughter. Once the IRS processes your return, they'll contact you both asking you to provide information supporting your claim of being custodial parent. When you do, you'll be granted the right to claim her and the IRS will adjust his return to remove her and he'll have to repay any benefits he received for including her on his return.\n\nIf you have a concern that he'll do this again in the future, you can request an IPPIN for your daughter so he won't be able to.",
            "School records will be on your side.",
            ">soon to be ex husband\n\nWhen did you get separated. You are the custodial parent now, but were you living together in 2023. Who provided more than 50% of support in 2023?",
            "This has happened to me in the past. If you went ahead and filed trying to claim your daughter as well most likely what will happen initially is the irs will send you notification that someone has claimed your daughter before you and the proper steps to follow to prove otherwise. You need to go to your daughters school and ask the office to write you up a letter with the school letterhead that states the exact dates ie sept 2023- June 2024 blank attended school in this district while residing at blank address. It took a few weeks for me to “prove” I rightfully could claim my daughter so my taxes were then processed and my ex had to pay back the money plus penalties. Hope this helps.",
            "And make sure your divorce decree states who can claim your daughter going forward. Hang in there!",
            "That’s illegal. You can report him as a tax cheat and get rewarded 25% I think, of whatever they recover.",
            "Just came to say this. You have the correct answer here.",
            "Thank you!",
            "IRS won't automatically adjust it. They will send a notice to both parents asking for 'proof' that the child lives with them.  It does not matter what the decree says, IRS only looks at their physical address.\n\nSchool or daycare records should indicate the custodial parents' address.  Medical records might show the other parent as the responsible party but SHOULD show the custodial parent's address as the child's address. If Head of Household was involved, IRS also questions that most of the time. They will want proof the parent paid more than half the rent (full rent  before subsidies) utilities, food (and food stamps counts against them) etc.  But on very low income Head of Household does not make any difference other than make it likely the IRS will send a notice asking for proof. Head of Household requires paing more than half the cost of housing, groceries, utilities, and if there are subsidies the taxpayer has to pay half of everything as if there were no subsidies. \n\nBut as someone said, file your return including the child. You WILL get a notice from IRS with form 556-something asking for birth certificate, proof of residency (school, medical records, lease) etc.  It will take them many months to fix it, but you'll get paid interest on the taxes they owe you. And it probably won't happen again.",
            "The end of December 2022 is when we separated. I provided the vast majority of support"
        ]
    }
}