{
    "RULES 📜": {
        "title": "RULES 📜",
        "score": 52,
        "url": "https://www.reddit.com/r/taylorandtravis/comments/1akm1cp/rules/",
        "content": "Hello all! As this sub grows, we always want to remind everyone to follow our sub rules! Moderators don’t always see everything so please report anything that breaks the rules!\n\nThe rules are:\n\n1. **No Bullying & Harassment**\n2. **No Racism & Homophobia**\n3. **No Unnecessary & Hate Comments**\n4. **No Stale Posts** \\- No low effort posts, no old news articles, no repetitive posts, or things that could've been said in a comment.\n5. **No Faulty Links** \\- Do not post links that don't work. Do not post something as \"news\" if it isn't from a credible website. If the website is questionable then post it as a rumor.\n6. **No Sexual, AI, or Graphic Content** \\- This includes comments or posts about sex or sexually suggestive content, it will be deleted and you will be banned based on the severity of the content.\n7. **No Disrespectfully Discussing Exes** \\- This sub is about Taylor and Travis, please stop negatively comparing their current relationship to their exes, being disrespectful towards the exes, or throwing out false accusations towards the exes. **THIS IS NOT A JOE AND KAYLA HATE PAGE!! KEEP YOUR DISRESPECTFUL AND MEAN COMMENTS TO YOURSELF!!**\n8. **No Posting or Spreading Information About Minors** \\- If you feel a photo needs to be posted but has a minor, **COVER THEIR FACE AND BODY!** Any comments asking about information of the minor will be deleted. Minors cannot consent to being posted everywhere and deserve privacy.\n9. **No Posting Rumors Without Where You Got It From** \\- When we say where you got it from, we mean an article, a photo, a gossip page, etc. Don't just say \"I heard Taylor and Travis are supposed to be at this place today\" or \"Travis may have cheated on Taylor\" and not show anything of where you got that from.\n10. **No Brigading** \\- Do not brigade other subs or you will be banned.\n11. **No Self-Promotion** \\- We allow all types of art (except AI) to be posted but this is not an Etsy shop. You can share your business name and social media but selling from this subreddit is not allowed.",
        "num_comments": 0,
        "comments": []
    },
    "NO SNARKERS ALLOWED": {
        "title": "NO SNARKERS ALLOWED",
        "score": 649,
        "url": "https://www.reddit.com/r/taylorandtravis/comments/1bz6rt5/no_snarkers_allowed/",
        "content": "From now on, if you are an active participant in r/TravisKelceSnark r/kaylanicole_snark2 or  r/joealwyn_snark and you’re also a member of this sub, that will result in an automatic ban.  We  have noticed a quite a few people coming over from those subs and coming here to spew their hate.  You can like Taylor & Travis without spreading hate or harassing their exes.\n\n**No exceptions. If you actively participate in those pathetic subreddits, you should be ashamed of yourself. You are not welcome here.**",
        "num_comments": 72,
        "comments": [
            "I had to block Travis kelce snark. They’re just mean there.",
            "i've never understood Snark pages. Why spend so much energy on people you don't like?",
            "I cannot believe there is a Kayla Nicole snark page good lord leave the woman alone!",
            "Oh my goodness, GOOD. I was on Facebook this morning and so many comments under any post about Taylor and/or Travis were so hateful and untrue. And from fully grown adults!! Honestly, people really show their true colors when they’re incapable of empathy and kindness toward people they don’t know. \n\nI’d like this and for the main Taylor sub to be a safe space to be happy about music and LOVE.",
            "Yeah, I didn't know what a snark sub was at first and got linked to a post there. It was so outrageous that I just commented something nice/defending Travis in it and it got deleted because it said \"No fan behavior\" 😭🤣.\n\nYou know something is extremely toxic if they don't allow any positive/nice comments. I can't even imagine how miserable those ppl have to be. 😩",
            "I’m all for a good snark. But the Travis page is willllld, like wtf is wrong with some people",
            "They are Parasocial FREAKS. They snark on his body hair!",
            "Thank you. When this sub popped up with all sorts of snark yesterday I wondered I had I hit the wrong sub.\nI don’t understand all the hate and the desire to express all the hate. \nI’m just here for fun, cute pictures and a nice time…",
            "I am amazed that anyone would create a subreddit to hate on a celebrity. Why do they think anyone cares that they hate a celebrity? And why would anyone participate in something so stupid and useless??  It's so bizarre. Wouldn't it be easier to just ignore that celebrity? What am I missing here?",
            "Oh I’m glad I haven’t seen them\n\nYa it gets tough to see such nastiness and for no reason, and we wonder why kids /teens bully? It boggles my mind"
        ]
    },
    "Seems like he’s just as big a melt as his brother 😂😂": {
        "title": "Seems like he’s just as big a melt as his brother 😂😂",
        "score": 31,
        "url": "https://i.redd.it/qnijd21toi9d1.jpeg",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Someone tell chelbelle9 she does it everywhere 😂",
            "I think he said it was because he's a dad now with girls, so he almost teared up seeing how much joy it brought that girl getting the hat",
            "Great family!!! Really feeling this!!!",
            "Jason is peak girldad"
        ]
    },
    "Lip Reader Reveals What Travis Kelce Said To Taylor Swift As He Performed On Stage At Eras Tour": {
        "title": "Lip Reader Reveals What Travis Kelce Said To Taylor Swift As He Performed On Stage At Eras Tour",
        "score": 13,
        "url": "https://watchinamerica.com/news/lip-reader-travis-kelce-taylor-swift-eras-tour/",
        "content": "",
        "num_comments": 3,
        "comments": [
            "“Wake up. You get back out there! Get back out there!”",
            "![gif](giphy|u23zXEvNsIbfO)",
            "![gif](giphy|U5hvUeqw10e0U)"
        ]
    },
    "Kam’s post about Travis’ Eras You appearance": {
        "title": "Kam’s post about Travis’ Eras You appearance",
        "score": 1409,
        "url": "https://i.redd.it/2dihn37wcr8d1.jpeg",
        "content": "Not a lot of people know that Kam’s brother played for the Chiefs (being a chiefs fan myself, this is one of the reasons why I started following Kam on Insta). Anyway, thought this was a pretty cool moment for Kam. ",
        "num_comments": 106,
        "comments": [
            "Travis said in response ….”More memories to come “…👀",
            "Dude, something has shifted this past week.",
            "I love Kam! He is a national treasure and must be protected at all costs",
            "I’ve probably said this a lot but I love Kam, this is a pretty full circle moment for him.",
            "Kam is a treasure.  ❤️",
            "This is so cute!!!! \n\nJust like Taylor with Travis’s circle, I love seeing how warmly and happily Travis has been embraced by everybody in Taylor’s corner!! Kam’s a bit of an outlier since he’s also got the Chiefs connection, but still 🥺 I’ll never forget Kam’s huuuge grin and throwing his head back laughing when Taylor first sang “the guy on the chiefs” 😂",
            "And Travis's comment on this post melted my heart. This weekend felt like a true turning point in their relationship. Especially with Jason and Kylie experiencing the show. I can't imagine what this weekend was like for them. They know Taylor as just their brother's/brother in law's girlfriend and now they've seen her command a stadium full of people. That has to be CRAZY.",
            "Travis replied to this as well.",
            "Isn’t Kam the one who set them up? I know that early on Travis said he had someone in Taylor’s camp on his side. I assumed it was Kam. Either way it’s a sweet moment 😊",
            "I had no idea Kam and Travis had this link. Maybe Kam put in a word for him with 'the boss lady' when Travis went public with his bracelet plan."
        ]
    }
}