{
    "What's in your cup? Daily discussion, questions and stories - June 29, 2024": {
        "title": "What's in your cup? Daily discussion, questions and stories - June 29, 2024",
        "score": 4,
        "url": "https://www.reddit.com/r/tea/comments/1dr9n5e/whats_in_your_cup_daily_discussion_questions_and/",
        "content": "What are you drinking today? What questions have been on your mind? Any stories to share? And don't worry, no one will make fun of you for what you drink or the questions you ask.\n\nYou can also talk about anything else on your mind, from your specific routine while making tea, or how you've been on an oolong kick lately. Feel free to link to pictures in here, as well. You can even talk about non-tea related topics; maybe you want advice on a guy/gal, or just to talk about life in general.",
        "num_comments": 10,
        "comments": [
            "Harney and Sons \"Cherry Blossom\" Tea while eating breakfast and relaxing a bit since in a week I got a final exam that is getting me nervous.",
            "Oriental Beauty from tealyra. Not my favourite, but it's definitely worth drinking up.\n\nIn other news, I haven't made tea in anything other than my gaiwan since I got it.",
            "Earl Grey Moonlight from Adagio Tea.\n\nMy morning tea while playing Stardew Valley.",
            "Earl grey for the morning since I had a big translation to finish, and for the afternoon I'm planning to finish the last of the MST Coastal Deep Water oolong and just chill in the garden with my cats.",
            "Today is one of those days. You know - you had a hard time falling asleep, woke up too early and couldn't go back to bed, tripped over everything, couldn't get your morning right. Days like this I only care about tea <3 I am so happy that I can enjoy some kamairicha!",
            "Best of luck on your exam!",
            "More FLT '24 Sweet Spring Alishan this morning.\n\nWe're off to our local Pride parade a little later today.\n\nHappy tea drinking, friends!",
            "I tried making a dirty chai with my Teabox Assam masala chai and then a shot of Aeropress, didn't turn out great. Had a little too much coffee to chai and the whole thing came out a little watery.\n\nSo instead I'm brewing up my Okayti spring clonal black which is definitely only black by traditional Indian nomenclature but looks closer to a typical TGY by oxidation levels.\n\nUpdate: brew finished, tastes a lot like a more vegetal TGY. Like you brewed a TGY in green bean water. It's right on the edge of being bitter so I'm glad I didn't follow the instructions on the package and steep for 5 min.",
            "Thank you!",
            "A 2-cup pot of [Light Roast Wild Tree Purple Varietal Black Tea of Dehong](https://yunnansourcing.us/products/light-roast-wild-tree-purple-varietal-black-tea-of-dehong?_pos=1&_sid=9ab890fa8&_ss=r) from Yunnan Sourcing. Part of \"Scott's Private Stash Yunnan Black Tea Sampler\". A great aroma and a sweet and fruity flavor."
        ]
    },
    "Marketing Monday! - June 24, 2024": {
        "title": "Marketing Monday! - June 24, 2024",
        "score": 6,
        "url": "https://www.reddit.com/r/tea/comments/1dnb85l/marketing_monday_june_24_2024/",
        "content": "We realize there are lots of people involved in the tea industry here, so this thread is a weekly feature where anyone can promote their current projects without worrying about the self-promotion rules.  Feel free to include links to your shop, crowdfunding sites, surveys, sales, or discount codes.  The rule against claims of health benefits remains in effect here.  It should go without saying that we still expect people to be respectful and follow the reddiquette.  While we intend for this to be a free-for-all promotion zone, please don't overrun the thread posting the same thing over and over.",
        "num_comments": 7,
        "comments": [
            "Nio Teas is Offering a Free Pack of Shincha Tea on All Orders over $69: [https://nioteas.com](https://nioteas.com)",
            "Professional Tea Taster is an information portal about tea, teaware, recipes, reviews, and industry news.\n\n[https://professionalteataster.com](https://professionalteataster.com)",
            "Le PuerhJunky here!  The Spring Ripe Champion crowning ( [Championship Round: Ripe Puerh - Mid-aged and thematic puerhs (puerhjunky.com)](https://www.puerhjunky.com/championship-round-ripe-puerh/) ) and a sampler set of the contestants awaits.  Some interesting findings on airing ripes for maximo performance.",
            "[**Teasenz.com**](http://Teasenz.com) **Deals (Global Store, Shipping from China)**\n\n* 15% OFF: New Premium Xiao Qing Gan pu erh tea\n* 20% OFF: Pre-packed Shui Jin Gui oolong tea\n* 15% OFF: Shuiping shape glass tea pot\n* Up to 25% OFF: Travel tea sets\n* Up to 40% OFF: Pu erh tea and more\n* See all deals: [https://www.teasenz.com/sale](https://www.teasenz.com/sale)\n\n[**Teasenz.eu**](http://Teasenz.eu) **Deals (EU Store, Shipping from the Netherlands**\n\n* 15% OFF: New Premium Xiao Qing Gan\n* 10% OFF: New tea infuser mugs\n* Up to 20% OFF: Cold brew tea bottles, gaiwan tea set with cups, black tea cakes, and lots of Chinese tea!\n* See all offers: [https://teasenz.eu/collections/sale](https://teasenz.eu/collections/sale)",
            "Hey there, fellow tea lovers!\n\nIt’s your last chance to get in on the amazing deals at [**Zerama Tea**](http://www.zeramatea.com)! Our [**Buy 2 Teas Get 1 Tea Free Sale**](https://new.zeramatea.com/pages/buy-two-teas-get-one-free) is coming to an end this Sunday, so don’t miss out!\n\nFor one more week, you can indulge in our delicious teas and stock up for a rainy day (or a tea party with friends). With no code needed, simply add two teas to your cart and get the third one free! It’s like getting 33% off your entire order!\n\nDon’t let this opportunity steep away! Treat yourself or gift someone special with our wide variety of [black tea,](https://new.zeramatea.com/collections/tea-black-tea) [green tea](https://new.zeramatea.com/collections/green-tea), [oolongs](https://new.zeramatea.com/collections/tea-oolong-tea), and [more](http://www.zeramatea.com). Our teas are carefully crafted to transport you to a world of tranquility and joy.\n\nSo mark your calendars for the final countdown: Sunday is the last day to take advantage of this incredible deal! Don’t miss out on the fun - visit us today and get ready to steep up the savings! **Free US Shipping**!\n\nHappy sipping, and thank you for being part of our tea-loving community!",
            "Celebrate 30 months of MyTeaPal! Join our vibrant community of over 400 TeaPals from 50+ countries. We've introduced 139 teas in 30 themed sampler boxes and hosted 200+ virtual events.Every month, receive a curated box with the rich flavors of four distinct teas, delivered right to your doorstep.\n\nUse the promo code TEACLUB30 before June 30 for $10 off your subscription! Subscribe to a multi-month plan (3, 6, or 12 months) and get a gift tasting cup, corresponding gift teaware, and a portion of our June tea club (Dancong oolong tea themed) valued at $40 for free!\n\nMyTeaPal is more than just tea; it's a lifestyle. Our exclusive club integrates seamlessly with our app, available on the App Store and Google Play. Participate in two virtual tasting events weekly, connecting with tea lovers worldwide.\n\nEnjoy the art of tea with free worldwide shipping, exclusive discounts, and thoughtful teaware gifts. Don’t miss out on this unique experience. Connect, explore, and savor the world of tea with MyTeaPal. Join us today at [MyTeaPal.com](https://l.facebook.com/l.php?u=http%3A%2F%2FMyTeaPal.com%2F%3Ffbclid%3DIwZXh0bgNhZW0CMTAAAR2vFk7JLuhEASwz3w5Mq9aW4Xv6692EL0v4YGHom2sF1zUO7_jKicg9BrQ_aem_BgGcHOMD-FrpILFmPUOLTw&h=AT2XebvHIZ79MwtXlluMRQEkXrh2ODtsx0nD-haoDbddbAZ9DuJByViEobwHl2y7K7ld1f0jrcPKQUbHxS_NvUe3LGus7xAv01ZJ56qvu2BrYnK1It6x6swQzxR29sfLPAJLM4vOBA&__tn__=R]]-R&c[0]=AT3fskyO7MJfPXs_XhhxVMZ2Si1b44hqyl4D0ssJGRFN4YH8Vop5qhkKRUr33Ld5cp9sB5xvpmRakhfnuBLXr3Vf14pZlrFS0pw-XAmoDvVvy1gd-SK5wD6RHtZ-3HjJi0wtFDElo2VwQLIk_hSiEcBsS8Z1sHcDfE6tMzpCLiwp0xp5nQbeplZu0-B1qy9jxunnir0Hc8McrkTjdAL-FHgg6q2t51nFVnQA95PkW6u1yfhH) and elevate your tea journey!"
        ]
    },
    "This morning I'm drinking Grandma Style": {
        "title": "This morning I'm drinking Grandma Style",
        "score": 19,
        "url": "https://i.redd.it/1omiqqinhi9d1.jpeg",
        "content": "I found this sweet carnival glass tray at Goodwill yesterday and it's the perfect size for gongfu. I'm drinking Verdant's Original Wulong Revival from their $5 sampler and it's very nice.",
        "num_comments": 4,
        "comments": [
            "Do you use a d20 as a tea pet???? I love that!!\n\nYour set up is so cozy.",
            "Thats actually not a regular d20, its a hitpoint counting die (the adjecent numbers are on adjacent faces) great for tracking your steeps.",
            "Great idea"
        ]
    },
    "I make my own Ghibli-inspired tea pets and tea \"cans\" ": {
        "title": "I make my own Ghibli-inspired tea pets and tea \"cans\" ",
        "score": 25,
        "url": "https://www.reddit.com/gallery/1dr57cn",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Aw hell yeah, love those man-eating parakeets",
            "Wow those look awesome!",
            "Adorable!",
            "Hello, /u/Elbert3d!  This is a friendly reminder that most photo posts should include a comment with some additional information.  For example: Consider writing a mini review of the tea you're drinking or giving some background details about the teaware in your photo.  If you're posting your tea order that just arrived or your tea stash, be sure to list the teas and why you chose them and if you're trying something for the first time, etc.  **Posts that lack a comment for context or discussion after a resonable time may be removed.**  You may also consider posting in /r/TeaPictures.  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tea) if you have any questions or concerns.*"
        ]
    },
    "Starting my journey into tea": {
        "title": "Starting my journey into tea",
        "score": 9,
        "url": "https://i.redd.it/bs4gi4a1rh9d1.jpeg",
        "content": "I've been lurking here for a wee while now trying to learn something about tea, all the varieties and how to get my head around all these loose leaves and brewing options!\n\nWhile the photo is terrible and doesn't in anyway show the fresh light green colour of the time, I just wanted to share the start of my journey into the world of tea.\n\nThanks for all the great info already and I look forward to learning a lot more in the future!",
        "num_comments": 1,
        "comments": [
            "Hello, /u/Steve_G165!  This is a friendly reminder that most photo posts should include a comment with some additional information.  For example: Consider writing a mini review of the tea you're drinking or giving some background details about your teaware.  If you're posting your tea order that just arrived or your tea stash, be sure to list the teas, why you chose them, etc.  **Posts that lack a comment for context or discussion after a reasonable time may be removed.**  You may also consider posting in /r/TeaPictures.  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tea) if you have any questions or concerns.*"
        ]
    }
}