{
    "Dear Students Lurking on this sub thinking about posting": {
        "title": "Dear Students Lurking on this sub thinking about posting",
        "score": 1157,
        "url": "https://www.reddit.com/r/Teachers/comments/1dhzt02/dear_students_lurking_on_this_sub_thinking_about/",
        "content": "The post flair \"student teacher\" is not for you. It is for those who are in the process of becoming a full time teacher. You can think of these as teacher interns.\n\nThe one you want to select is \"student or parent\".\n\nHere's a Gatorade and a sour apple lollipop; now head back to class.\n\n  \nBetty\n\n𝓛𝓲𝓿𝓮 𝓛𝓸𝓿𝓮 𝓛𝓲𝓯𝓮 𝓟𝓪𝓷𝓬𝓪𝓴𝓮\n\nCopy Manager | Teacher Coordinator and Supervisor | Event Coordinator | Executive Synergy Coordinator | Health and Mental Support Mentor | Director and President of Zen Productivity | Chief Inspiration Officer | Guru of Educational Enlightenment | Senior Vice President of Creative Motivation\n\n\"Teacher knowledge is not merely power; it's the spark that continues to ignites the fires of innovation and progress in a dark cave for students until it dies.\"",
        "num_comments": 136,
        "comments": [
            "Also this sub wasnt really designed for hey, my teacher wont accept my three week late assignment. Tell me how to fix it posts.",
            "Im also tired of the fake fantasy stories that get posted on here frequently. Is it weird if my teacher gropes my friends breasts?like no normal teen would ask that since they would already know its weirdleave your kinks on wattpad.",
            "All those job titles are hilarious. It reminds me of former colleagues/coworkers who do one menial task and all of a sudden it's in their email signature.  Example: walks students from classroom to lunchroom as part of their duties, all of a sudden they're the \"Student Transition Supervisor\"",
            "Surely, you have some degrees you can add to that email signature. How will I know you are qualified if I do not know what you have a bachelor's in?",
            "The formatting of your OP is giving me flashbacks Jesus",
            ">until it dies\n\nDoes this refer to the spark, the student or the dark cave? Asking for a friend.",
            "Thank you. Im so sick of reading moronic posts from teenagers who were too lazy to read past the first word of the flair and instantly thought it meant them when they saw the word student in student teacher.",
            "as a student lurking on this sub (who knows what student teacher means), thanks for the sour apple lollipop! you do know what students like ",
            ">sour apple lollipop\n\nAmazing taste",
            "I feel like this sub should take a stance similar to r/Professors , rule #1 is no student posts, only people who teach college level courses may post, including TAs and grad students, but no students at all and they keep on top of that super well."
        ]
    },
    "Jammed Copy Machine Lounge Talk": {
        "title": "Jammed Copy Machine Lounge Talk",
        "score": 0,
        "url": "https://www.reddit.com/r/Teachers/comments/1dqamq8/jammed_copy_machine_lounge_talk/",
        "content": "Hey everyone!  The copy machine is down.  We called Susan, and she said it won't be fixed until next week.  Anyway, since it's Friday...\n\nWhat were some challenges that you faced recently? Anything that irked you? Maybe a co-worker is getting on your nerve? Class caught on fire because little Billy shoved a crayon into your pencil sharpener?\n\nShare all the vents and stories below!",
        "num_comments": 1,
        "comments": [
            "Dealing with Susan would be a welcome reprieve right now..\n\n\n\nBooks are getting banned....\n\nreligious extremists are just getting started....\n\nSome of you all are posting about how you live in a state where that won't happen.\n\nyeah,  that was me too.\n\n\n\nToday, our region was on newsofthestupid with our book bans."
        ]
    },
    "Kids need phones in school \"in case of an emergency\" argument...": {
        "title": "Kids need phones in school \"in case of an emergency\" argument...",
        "score": 478,
        "url": "https://www.reddit.com/r/Teachers/comments/1dr14gc/kids_need_phones_in_school_in_case_of_an/",
        "content": "Rant inc.\n\nThere is no \"worst case scenario\" where the kids having a cell phone will help.\n\nIn any ACTUAL emergency at school cell phones will be a straight up hinderance.. Calling mommy during the shooting or event is more likely to just let the shooter find and kill them. They can clog up cell phone networks blocking out REAL emergency calls. Texting with friends (any of whom could BE the shooter) or posting on social media is once again going to help them be found. Being on the phone means they AREN'T listening to the instructions of the teacher on what they need to do, or making intelligent decisions themselves. Calling the parents so they can show up in a rage at the school, getting in the way of law enforcement and emergency personnel isn't going to help either.\n\nHell, even if it is a medical thing, the teacher and office need to know first so they can take quick action. Not wait around for the kid to get ahold of their parents before telling us they are having a reaction/episode.\n\nKiddo needs a cell phone active at all times so mommy and daddy can feel better though..\n\nWonder how much better they will feel identifying the body in the morgue?\n\n(Sorry... but the argument that kids need phones in school in case of emergencies is a real nerve point for me and it seems to come up in every topic on cell phone restrictions. We were doing our first shooter drill years ago and a kid said they would not come with the group to evacuate as her mommy told her that she should hide and call home instead. I told her if she tried that in a real situation I was throwing her over my shoulder and carrying her out.... Needed to rant.)\n\n...but no. The educational experience in the classroom needs to be harmed by cell phones because... we want kids to be LESS safe?",
        "num_comments": 171,
        "comments": [
            "Last year, there was some miscommunication between middle schoolers about a potential gun and instead of alerting a teacher, the entire 8th grade called their parents in a panic with their phones. 5 minutes later, 100s of panicked parents showed up at the school rushing the entrance, some parking in the middle of the streets and running to the school through the traffic jam of cars. People strapped, locked and loaded trying to get into a school! It was complete chaos, and the emergency vehicles and police couldn't even get into the school to help because parents were blocking the way. They were hysterical and out of their damn minds over rumors from their dramatic 8th grade kids, and made a potentially bad situation 10x worse.",
            "We had a lockdown this year. The room where kids had their phones on them had the most noise happening when police came to release us. They were getting conflicting info from friends, social media, and their parents. This resulted in arguing and heightened emotions.  My students were in the middle of an activity when it was called and did not have their phones- they were silent because all info and reassurances were coming from me.",
            "The only kids who need them are those who have the continuous glucose monitoring - and I have never had a problem with those kids and cellphone misuse.",
            "I roll my eyes when parents tell me this. I can't tell them over the phone that in case of a school shooting, they'll be fucking useless and so will those phones seeing as I don't need a meeting with admin, but one of these days, I'll just lay out what went down in Ulvalde and ask them how the kids having phones helped them. \n\nThe usual I usually get is parents calling their kids for stupid reasons. One time, I had a parent text their child from another country to tell them that their grandad was dead. What did that achieve? That child was inconsolable for the rest of the lesson and I wrote her a pass to go to the bathroom/ walk around. That should have been a phone call when you knew your child was free -\\_-",
            "Years and years and YEARS went by without students needing cell phones. Im not a total boomer - I believe phones can be used for projects and many students are quite adept at utilizing them creatively. However, Id be just as fine with cell phones being totally gone. This notion of, I need the phone in case my parents need me means the kid is lying, the parents are lazy or irresponsible, or some combination of those. Phones need to GO.",
            "If you child is having a medical emergency, obviously they cannot call. God forbid they are unconscious, how would anyone be able to unlock their phone to use it? If there is  shooter on campus, do you want your child's hiding place given away by a message ping or it ringing? Phones should be banned in school - PERIOD",
            "Had a lockdown drill earlier in the school year: principal came on, told the students it was a drill (teachers knew ahead of time of course), then proceeded with the drill. After the drill had ended, principal came back on and basically had to say \"yeah you guys knew that was a drill yet I had a dozen parents calling ME asking what was happening and if you were okay. Guys we shouldn't be on our phones at ALL during lockdown\" so... yeah",
            "We had a kid with a loaded gun in our school this year. The kids found out and started calling parents. Parents called the school and principal. The principal searched the kid. No gun. The stupid kids had the wrong perp. Kid had the loaded gun all day. Principal had to spend all his time dealing with the false information. One kid came to a teacher at the end of the day and said we had the wrong kid. Principal had to wrestle the gun from the kid.  It was at dismissal and was real scary. Feel like the principal could have gotten it taken care of quicker if the kids werent calling their parents and the office having to deal with all that stuff. \n\nKids are bringing guns to school. Kids are bringing loaded guns to school. Its hard to scan the class now and wonder. Middle schools and elementary schools are not exempt. They are in our schools.",
            "Yep. I have conversations with the students about not using phones during an emergency. And I explain why. I also tell them my personal stories of being in lockdowns and how using our phones make them last longer and prevent police from helping out. \n\nI was in a lockdown, first in my state and nobody dangerous ended up being in the building. But we had never practiced a lockdown before and had zero clue what was going on. I was in high school and the girls in my class were having full on mental health crisises because they weren't going to be able to go to Mexico again. My younger brother's basketball coach was the chief of the patrol in our town and because we didn't fucking know better, I called him. He was dumb enough to answer but he could hear that there was a legit problem happening where I was at and disclosed that the problem wasn't inside the school and they advised this as a precautionary measure and because lockouts weren't really a thing either. So it was either Fire, Tornado, or Lockdown. He told me how important it was that we stay off our phones because it makes the cell tower too busy to carry police communication and therefore situations are going to take longer to resolve if they don't have the clear to go forward etc. It goes for calling and texting and I tell them once we get the okay from police, I'll let them call their parents, but not until we get the okay.",
            "25 year veteran teacher here: YOU ARE 100% COMPLETELY AND TOTALLY CORRECT!!"
        ]
    },
    "New cellphone ban. ": {
        "title": "New cellphone ban. ",
        "score": 636,
        "url": "https://www.reddit.com/r/Teachers/comments/1dqx75g/new_cellphone_ban/",
        "content": "“County Board of Education unanimously approved a new policy banning the use of cell phones during the school day for most students.\n\nThe policy states that students must have their phones powered off and out of sight for the entirety of the school day. An exception is made for high schoolers, who are allowed to use them during lunch. “\n\nI am so mixed about this.  I hate dealing with students and their phones as a teacher, but as a parent, in a worse case scenario, I want my kids to have access to theirs. \n",
        "num_comments": 453,
        "comments": [
            "NYU psychology professor Jon Haidt in his new book *The Anxious Generation* makes the case that the introduction of smartphones into adolescence since 2012 has been quite corrosive and--in addition to counterproductive changes to parenting--has been one of the primary drivers of the rise in anxiety and other disorders in children (among other things). Anyway, he highlights that if the youth suicide rate had remained at its 2012 levels there would be many thousands more adolescents alive today. The grim calculus and dark irony at play here is the fact that cell phones have probably gotten many many many times more kids killed than any of the \"worst case scenarios.\"",
            "Phones have only been prevalent in schools for about a decade or so. Before that, parents still were able to reach their kids in an emergency. And if something major happens, it sounds like theyll have their phones but they will be turned off, so they can just turn them back on. \n\nCell phones are destroying education and mental health for teens. This is a necessary step.",
            "In a worst case scenario youd rather have them being situationally aware and having a chance instead of looking at a phone typing their goodbyes. Not to mention overloading the cell network at the exact time first responders need them.",
            "Parents blew it.  If students had flip phones without internet access, this wouldn't be an issue.",
            "Sounds like in an emergency theyd have easy access to their phones.",
            "If the cellphone is off and away where exactly is your concern about your kid having access to it in a worst case scenario coming from? There is literally nothing stopping them from powering it on during an emergency.\n\nI swear people get so irrational the moment there is even a hint of their addiction box being taken away",
            "The district should be handling any emergencies. We have a problem with kids texting their parents to get them home because they are bored.  Sorry folks sometimes you have to put effort into learning.",
            "I still have never seen a convincing argument that kids having their phones in an emergency like a shooter will accomplish anything but having students ignore the instructions of teachers and first responders as they overload cell towers calling mommy.",
            "Powered off and out of sight doesn't mean the students won't have them in an emergency.  If the time it takes to power back on is too long, the phone wasn't going to help them anyway. \n\nIt's a far more likely scenario that instead of being used for emergencies, the phone will be used for social media,  games,  photos and videos,  cheating, r etc.  Phones are a huge distraction and if kids could manage to reasonably stay off them then bans wouldn't be necessary.",
            "My son's school has a ban in place and the sun came up the next day. Nothing but positive results"
        ]
    },
    "Prediction: there will be a national report on the teacher shortage in August on the major TV networks on the evening news.": {
        "title": "Prediction: there will be a national report on the teacher shortage in August on the major TV networks on the evening news.",
        "score": 274,
        "url": "https://www.reddit.com/r/Teachers/comments/1dqvp3e/prediction_there_will_be_a_national_report_on_the/",
        "content": "My prediction is that, by the end of summer (early to mid-August), there will be coverage on the major and increasing teacher shortage in the United States. It will be on all of the major TV networks (ABC, CBS, CNN, FOX, NBC, PBS, etc.). They will report this: - it is the worst than it has ever been \n- increasing religiosity in public schools in certain states\n- teacher pay is low\n- increasingly dangerous schools and no support\n\nWhat do you think? \n\n",
        "num_comments": 96,
        "comments": [
            "My district has been getting teachers from overseas who are then trapped because if they quit they lose their visas. They are not certified here and many have no experience or training at all. There is no interest in helping them because, again, they cant quit, and also because administrators do not care.",
            "Then by mid September they will stop reporting on it again until next August.",
            "But that's what they want. (To destroy public education so that charters and private schools can use that funding. To cut education for special populations and minorities. )",
            "Every time you hear about a job shortage it boils down to a) bad pay and b) crappy work conditions. And clueless supervisors not sure why the can't attract more people to work for them because a and b",
            "Also the post-Covid student behaviors. This past year there were second graders who fought and argued almost every single day (Title 1 school, might be normal)",
            "Next prediction: Nothing will be done.",
            "That's all they ever wanted.  Then they turn around and claim that as proof of the failure of the \"public school experiment,\" and push it all back to church schools and private tutors for the wealthy.",
            "Honestly I have job security so thats a plus. You have to actively try to be fired at my school",
            "Yeah, this isn't a flaw in design but rather a feature.",
            "Prediction: More and more states will make it easier to become a teacher until all you need is an associates degree. But, it wont solve the shortage because new teachers realize how hard the job is with relatively mediocre pay."
        ]
    }
}