{
    "Shop Distribution - The Nerdiest Post you’ll read today": {
        "title": "Shop Distribution - The Nerdiest Post you’ll read today",
        "score": 1322,
        "url": "https://www.reddit.com/r/TeamfightTactics/comments/1d3c09b/shop_distribution_the_nerdiest_post_youll_read/",
        "content": "Hey folks. Mort here with what is going to be the nerdiest game design post you’ll see in a while, but I wanted to share it with you. Generally in all aspects of life, even if you’re confident in something, it’s helpful to double check your biases and make sure you’re actually correct or not. So that’s what I did.\n\nWe’ve all seen posts where a player rolls down 50 gold and doesn’t see the uncontested unit they’re looking for, heck you may have even been on that end yourself (sorry, but wait for the punchline). Sometimes, this experience can be so stark that you’re concerned with the reliability of the system. Could this be bugged? I can’t really be that unlucky—is something wrong with the game? Now, my initial reaction is that this is a common thing called “confirmation bias” where a recent experience is being weighted more heavily. This, in conjunction with negativity bias, where negative experiences are seen to have a higher impact, become the fuel for many “Mortdogged” experiences. But even with knowledge of these biases, is everything fine? I mean, TFT has had its share of bugs, so let’s take a deep dive in the design space to make sure everything works as it should.\n\nFor this experiment, I focused on 4 costs. We pulled out 6 copies of nine of the Four Costs (these are our contested units), and left the other three Four costs as our uncontested units, with all 10 copies in the pool. At this point, this means there are 4 copies of the contested units (36 contested units total) and 10 copies of our three uncontested units (30 uncontested units total). If we do a large extensive roll down, we should see uncontested champions (30/66) 45% of the time approximately.\n\nWe ran this experiment for the first time, with Ornn, Ashe, and Kaisa as the three uncontested units (lol, Ornn is uncontested, right?), and here are the results.\n\n* Ornn: 136\n* Ashe: 168\n* Kaisa: 120\n* Lillia: 58\n* Morgana: 52\n* Kayn: 58\n* Lee Sin: 61\n* Syndra: 38\n* Nautilus: 53\n* Galio: 61\n* Annie: 50\n* Sylas: 46\n\nThe total 4 costs seen was 901, and the uncontested ones made up 424. This is (424/901) 47% of the time, which is within expected variance for something of this sample size, and matches our expectations. Good news. But of course, one time isn’t enough, so let’s run the experiment two more times. \n\n* Ornn: 154\n* Ashe: 141\n* Kaisa: 178\n* Lillia: 57\n* Morgana: 72\n* Kayn: 48\n* Lee Sin: 53\n* Syndra: 57\n* Nautilus: 52\n* Galio: 62\n* Annie: 52\n* Sylas: 41\n* Total: 473/967 = 48.9%\n\nAnd again\n\n* Ornn: 150\n* Ashe: 140\n* Kaisa: 152\n* Lillia: 63\n* Morgana: 58\n* Kayn: 55\n* Lee Sin: 48\n* Syndra: 54\n* Nautilus: 47\n* Galio: 60\n* Annie: 64\n* Sylas: 55\n* Total: 442/946= 46.7%\n\nSo yeah, generally we’re seeing the results we’d expect with a sample size this big. It’s not EXACTLY 45%, but the law of large numbers shows that this is expected, and if we dramatically increased the sample size, we would likely converge to that expected 45%. From a purely mathematical standpoint, it seems like our shop is working as expected. Huzzah!\n\nSo all is good right, and there’s nothing to be done…right? Well…no actually. Just because it is mathematically correct does NOT mean the design is perfect. If you’ve ever watched my stream, I’ve talked about how good design doesn’t just let RNG take the wheel, and designs around the core player experience. In this case, the player is not rolling down 1000 times and letting the law of large numbers do its job…instead, it’s rolling down 60 gold and expected results that are intuitive, which is that uncontested units show up more.\n\nLet’s repeat the experiment, but instead of 1000 rolls, let’s only do 40 and see what happens. Same thing, with Ornn/Ashe/Kaisa as our uncontested units, and see what happens.\n\n* Ornn: 8\n* Ashe: 6\n* Kaisa: 1\n* Lillia: 6\n* Morgana: 0\n* Kayn: 1\n* Lee Sin: 6\n* Syndra: 2\n* Nautilus: 4\n* Galio: 4\n* Annie: 0\n* Sylas: 2\n* Total: 15/40 = 37.5%\n\nBecause the sample size is so low, the variance expands pretty dramatically. Much like if you flip a coin 10 times and hit heads 7 times, 70% is way higher than 50%, but the reality is when the sample size is lower, the variance is higher. Again, this all lines up from a mathematical sense…but from a game design standpoint it’s pretty rough. Kai’Sa is uncontested here and is seen one time, while Lee Sin has 6 copies out of the pool, and is seen 6 times! These are the experiences people have that feel off, and make them not trust the game.\n\nNintendo games do a lot of fudging behind the scenes I’ve talked about before, to try to make expected outcomes more likely to happen. Famously one of the most basic versions of this is in Fire Emblem, where they double roll odds, so if something says 75%, it’s actually 87.5% so it FEELS more like 75% to people (A 95% chance in Fire Emblem is much closer to 99%!) Based on this, I think there are improvements we can and should make here, so the game behaves closer to what you would EXPECT it to, even if it is within acceptable outcomes.\n\nPersonally, this was awesome for me to confirm and was a good use of time yesterday. I like constantly challenging our game design to see if we can do better, and I think this confirms we can. It won’t be easy, it won’t be overnight, and it may not even be soon…but I think it is worth exploring, and I think we’ll start doing that as soon as possible. \n\nThanks for reading all. Hope your roll downs are within expected variance, and take it easy :)\n\n",
        "num_comments": 212,
        "comments": [
            "Going to keep this pinned for a while since the amount of conspiracy theories about shop odds have been a little high recently",
            "Mort, thanks for being so engaged with the community. TFT isn't perfect but you instill faith that the people behind the scenes care and are doing their best and that's all I can ask for in a multiplayer game.",
            "There is a simple fix to this. Give me all of the units that I want, and don't give me the ones that I don't want.",
            "Ok that's cool and all but you're still a nerd",
            "Wouldn't it just confuse things more though to have a hidden percentage that doesn't align with stated values? People can hardly understand MMR vs Rank as it is lol. There's already a lot of tft knowledge I would never have if I wasn't following high elo players who explain hidden mechanics.",
            "Great post! I've had several discussions in this sub with people claiming It was bugged and I explaining them It was probably just confirmation bias. So I'm glad I can take a victory lap now lol.",
            "In todays world of video games I am truly thankful for the time you put into this game and into the community. Great post and thanks again for being awesome Mort",
            "As a fcking nerd, I really like this nerd post",
            "i cant think of anyone who deserves their job more than you",
            "All I gathered from this is that it's not my fault I'm bad at this game"
        ]
    },
    "Used an entire lifetime's worth of luck for this": {
        "title": "Used an entire lifetime's worth of luck for this",
        "score": 109,
        "url": "https://i.redd.it/ssmwi2hapf9d1.jpeg",
        "content": "",
        "num_comments": 18,
        "comments": [
            "This not being Pengu Party is bonkers. Ive still never even hit Fortune 7.",
            "Portal was Trainer Sentinels. My sentinel had fortune, inkshadow, and arcanist. Got Fortune Crest on 2-1, Hedge Fund on 3-2. Leveled to 7 on 3-2 and rolled down for Fortune 7. Cashed out 270 Luck on 4-7 for Fortune 9+ and the rest was history.",
            "When did you/did you loss streak??",
            "Its so jarring that you have games like this but the possibility of hitting an 8th the next game to wipe out all that Lp gain feels just so dirty",
            "You're missing 3* Xayah /s \n\nCongrats on the fortune game!",
            "I hit Fortune 8, but lost :(",
            "U already won when you got 2 fortune emblems on 2-1 lmao, still very cool",
            "I hit Fortune 7 with about 65 hp. You gain luck after every fight regardless of win or loss with Fortune 7. Got really lucky with final cash out as I rolled a 1 with 15hp left before raptors.",
            "If you already have 2 fortune emblems you shouldnt try to lose streak and instead strive to field seven fortunes as fast as possible, I.e. its perfectly correct to roll down lvl 7 to find one Annie and then win the game",
            "I got 1st again the next game with Storied Champion Garen. He had Radiant Archangels and Radiant Dclawmort was blessing me last night."
        ]
    },
    "Lucky Lucky Gloves": {
        "title": "Lucky Lucky Gloves",
        "score": 161,
        "url": "https://i.redd.it/vvdrfj5tgd9d1.jpeg",
        "content": "",
        "num_comments": 20,
        "comments": [
            "You don't even have pandora's so I can only assume this is anvil buffet portal?",
            "7 is a lucky number",
            "If this is a real thing that actually happened in a real match, then it might be one of the rarest things to ever happen in TFT.",
            "\"I will make it legal\"",
            "3 of them from encounter when you pick a component and get 3. The other 4 were just random",
            "Even at that it's incredibly rare as anvils are less likely to show you items they already have",
            "Lucky Gloves+ gives 3 wolves and he got an encounter (zyra I think?) giving him the Sam component 3x (gloves). So it's not rly lucky",
            "Doesnt lucky gloves give 2 as well?",
            "Anvils are weighted to give you items you dont have duplicates of.",
            "Dont have on the bench or everywhere?"
        ]
    },
    "Silly cashout": {
        "title": "Silly cashout",
        "score": 67,
        "url": "https://i.redd.it/26jqcpf17e9d1.jpeg",
        "content": "Just played a game and early got 7 fortune.\nWhen there were about 300 cashout I decided to take it... And got about 8 emblems of fortune. During the game after this screen I was still getting emblems from cashouts.\n \nThanks to Pandora's bench these emblems were made in different however it is still silly! Like you've made a squad using these fortune champs and you need to rebuild it in a few rounds including the facts that there are plenty of items and there are a lot of extra emblems that are useless because you can't make more than 7 fortunes",
        "num_comments": 16,
        "comments": [
            "Oh, honey... I'm so sorry.\n\n9 Fortune exists. You just didn't try it. It moves the Fortune tree to your board, and during combat the tree shoots ludicrous amounts of money at the enemy. You can then collect that practically infinite money and roll for every 5-cost in the pool.",
            "Well TIL 9 fortune exists. I hate this trait so much. I swear every time I get early fortune 3 theres a fan player that fucks the whole thing up. Its so obnoxious that it completely resets the traits momentum",
            "Why exactly are people downvoting OP in the comments? The game does not indicate existance of 9 Fortune and I too would't have known had I not seen it on here previously...?",
            "Bro had 14 emblems holy shit.",
            "Loool bro missed out on the instawin\n\nUnlucky thag you didnt put the emblems on before removing the units",
            "This is what happens to a lot of casual players because the devs expects every players to be in a tft community",
            "Dude has been living under the rock, not knowing 9 fortune and managing to post on Reddit ",
            "Guys I haven't seen 9 fortune in the list of this trait, like there are 3,5,7 fortunes. Maybe I have a different version or this 9 fortunes is hidden ",
            "Right and I only found out by watching streamers that attempt crazy builds.",
            "You failed to satisfy your self, bro."
        ]
    },
    "Is this intented?  \"I have a shop where I can upgrade my irella to 2 Star with BIS next turn, I locked the shop because no money to upgrade. But the encounter refresh my shop because of the mechanics.\" Mortdog Please 😭": {
        "title": "Is this intented?  \"I have a shop where I can upgrade my irella to 2 Star with BIS next turn, I locked the shop because no money to upgrade. But the encounter refresh my shop because of the mechanics.\" Mortdog Please 😭",
        "score": 6,
        "url": "https://i.redd.it/48qg6dbflh9d1.png",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Has happened to me once, too - locking shop but losing my unit to an encounter. Not a bug if that was your question, but it definitely blows.\n\nAre there any shop encounters other than the 1/2/3/4/5?",
            "And I deeply hope that other players won't share the same fate as mine, it is an easy 1st, now it is a 2nd by design.",
            "You got Mortdogged"
        ]
    }
}