{
    "The Legend of Zelda: Echoes of Wisdom – Announcement Trailer – Nintendo Switch": {
        "title": "The Legend of Zelda: Echoes of Wisdom – Announcement Trailer – Nintendo Switch",
        "score": 1406,
        "url": "https://www.youtube.com/watch?v=94RTrH2erPE",
        "content": "",
        "num_comments": 138,
        "comments": [
            "Finally. A game where you can play as Link",
            "Thirty friggin years later, you can finally play as the title character",
            "It's just princess Zelda with auto build. I'm here for it",
            "New Legend of Link game is looking great",
            "Zelda = Kevin from Home Alone",
            "This game looks incredibly fun! Only thing that would have made this direct a 11/10 for me, was if Windwaker and Twilight Princess HD got revealed as switch ports :/.... maybe some day..",
            "Jesus, they made a subreddit for the game already?",
            "Me and my 5 year old are both excited",
            "It's a good day for blonde heroines.",
            "Zelda is a necromancer!"
        ]
    },
    "What Was Your Favourite Side Quest/Side Adventure?": {
        "title": "What Was Your Favourite Side Quest/Side Adventure?",
        "score": 228,
        "url": "https://i.redd.it/6gff2jduce9d1.jpeg",
        "content": "I’ve always loved them more than the main storyline itself. I love getting sidetracked with them. I think my favourite would have to be Penns quests. ",
        "num_comments": 34,
        "comments": [
            "Definitely the Lurelin Village quests. Once things are in full swing it is such a helpful spot in so many ways!",
            "The Hateno Mayor election quest. \n\nEven though it's literally just a go around and talk to people quest, I enjoyed the nice change of pace. It was really nice to have a low stakes quest that takes you all over the village and gets you involved with all the people. Also when I first played it, I legit thought that we would have to actually pick one in the end and have that affect the village.",
            "Top 5 would be:\n\n1.Potential Princess sightings\n\n2. The seventh heroine \n\n3. The Stable Trotters \n\n4. All the Monster Crew questlines \n\n5. Kolton questline",
            "The monster brigade quest with Hoz, only because I was farming for Boko things in a camp, and his “battalion” randomly showed up, and in the great words of Patrick Star, I went, \"WHO ARE YOU PEOPLE?!\"",
            "Addison's sign quest make me so happy.\n\n\nI must support the President!",
            "I really liked taking the pictures for the stables.",
            "Maybe the mushroom hunting one that ended in the cave of shroomies",
            "PIRATES!!",
            "Bird Journalist for sure",
            "I don’t think a quest exactly, but I was so into following the underground path from lookout landing all the way through to the castle. Was really thrilling to me. \n\n\nRunners up would be Hateno mayor election. Funny and, like someone else said, low-stakes. And the newspaper quest. Both Penn and the frog suit are pretty cool."
        ]
    },
    "Doing  this combo lead to my demise": {
        "title": "Doing  this combo lead to my demise",
        "score": 488,
        "url": "https://v.redd.it/wcliffjc1d9d1",
        "content": "Wait till then end lmaooooo",
        "num_comments": 33,
        "comments": [
            "r/OneSecondBeforeDisast",
            "https://preview.redd.it/3vl208n7od9d1.png?width=1955&format=png&auto=webp&s=6e272c3c1b24b3523f2f567c903486fe0a68e6c8",
            "the foreshadowing of the moblin going to grab the bomb at the beginning is peak storytelling",
            "oof",
            "😂😂😂  perfectly cut screams but the screaming was me",
            "Quick, reverse time!",
            "There was a sick opportunity to reverse that keg. If only.",
            "Was the title intended to be a LoZ pun or...?",
            "Oh no",
            "This is so fucking perfect"
        ]
    },
    "TIL a faster way to cook": {
        "title": "TIL a faster way to cook",
        "score": 87,
        "url": "https://www.reddit.com/r/tearsofthekingdom/comments/1dr0mvo/til_a_faster_way_to_cook/",
        "content": "Marked spoiler in case some newcomers want to also learn the hard way haha. \n\nI have over 150 hours in the game right now. To date, I’ve been entirely experimental when it came to cooking: just trying different ingredients together. Obviously that took time and was tedious occasionally, but it’s gotta be done. \n\nTonight, I was clicking on ingredients like always, but suddenly it was like I had new eyes. I saw the “select for recipe” option, and clicked it for the first time ever. And lo and behold, all the recipes pop up showing what I’m missing per recipe, or what I can make right now. Clicking on one, I’m dumbfounded as it auto-adds everything needed and I can cook it…\n\nI laughed and told my husband, I can’t believe it’s taking me this long! Now I’ll love cooking a little more!",
        "num_comments": 14,
        "comments": [
            "Definitely not alone there. I was so annoyed with cooking things that I just stopped for awhile. Got to the point I wanted to start doing the end game stuff and figured I'd try it out again. Saw the the same thing you did and just started making a lot of gloom food 😂",
            "This is going to come in handy!!! Thank you!",
            "It took me a while to find that too. With 100+ hours I’ve also just started using grilled meat/mushrooms for standard health and all my other slots for enhanced meals. At least two of every type (defense, speed, stamina, etc.) I currently have 300+ grilled apples, 120+ of the grilled meats. They’re so much faster to cook 15+ at a time and they stack in your inventory so they don’t take up more space.",
            "Every time I go on this sub I find something new about this game",
            "Definitely not alone on that. It took me a few months of playing before I noticed that. 200+ hours in and I’m still terrible at Dodging.",
            "Wow I didn’t know until this post and I have 400 hours lmao",
            "Damn I had no idea lol",
            "Gloom food isnt hard just throw lile, a flower in there and eat it",
            "So nice to not be the only one! I was getting a little frustrated each time trying to figure out how to make certain elixirs. This will be a game changer",
            "I was in a similar boat. It definitely helped motivate me to find hearty items so I could minimize my clicking haha"
        ]
    },
    "Does anyone know what these perfectly straight lines on my hero's path are?": {
        "title": "Does anyone know what these perfectly straight lines on my hero's path are?",
        "score": 637,
        "url": "https://i.redd.it/qs17851xza9d1.jpeg",
        "content": "I'd attach a video if I could, but basically when you watch it play out, the cursor just instantly jumps across the map in one frame. \n\nThere's a bunch of these here and a few more in my other playthrough. The only thing I've noticed is that in this one, and my other account, it seems to take you to the temple of time on the great sky island. So does anyone know what these are?",
        "num_comments": 92,
        "comments": [
            "The cutscene after pulling the master sword takes you straight to the temple of time from whatever position you pulled the sword. I guess the game just moves link to the temple really quickly in a straight line instead of teleporting him.",
            "It happens if you load from an unsolid surface. For example, if you stand on a dragon, save and reload, the game will teleport you to the last piece of solid ground you stood on.",
            "It's a specific teleport, can't remember which, though.",
            "Flying?",
            "U used the metroline?",
            "so the line the little person is at that leads to the GSI is definitely from pulling the Master Sword. The other lines that fade out might just you be flying relatively straight enough for the game to register it as that but I'd have to see if they continue on the surface map, otherwise idk\n\nedit: i notice most if not all of those lines are from skyview towers so it might just you be gliding straight",
            "Are teleports shown on the path?",
            "I just started playing not too long ago and got a straight line after being teleported to rito village for the cutscene after completing the wind temple + boss",
            "You must be going a long distance in the air before being forcibly warped back. For instance, falling into water and running out of stamina.",
            "Anytime you teleport during a cutscene it counts as movement for hero’s path"
        ]
    }
}