{
    "Honeypot flairs.": {
        "title": "Honeypot flairs.",
        "score": 36,
        "url": "https://www.reddit.com/r/technicalminecraft/comments/191fuf4/honeypot_flairs/",
        "content": "To cut down on the increased number of posts involving rule-breaking mods (notably Paper), 3 new post flairs have been introduced for testing.\n\nPosts made using these flairs will be automatically removed.\n\nDon't use them.\n\nEDIT: After 3 weeks, this seems to have been a very successful test, with the vast majority of rule-8 violations blocked by the new filters.",
        "num_comments": 17,
        "comments": [
            "Thank god this sub is in dire need of moderation. Kudos for stepping up when no one else on the team can.",
            "Thanks for your work, mods!",
            "Are these still present? I'm new to Reddit, so I don't know which flairs are new and old here. I'd like to avoid having a post auto-banned.",
            "I know that from that YouTube shorts wizard programmer dude.\n\nI meant why honeypot",
            "Yes I get how it works I'm talking about the individual word itself",
            "That's explained by the wiki link...\n\nIt's the name of a scheme where you pro-actively defend yourself by leaving traps that seem innocent for \\[in this case: \"rule breakers\"\\] to fall into.",
            "The one like 6 comments earlier in the chain that you glanced passed because Thor had a short on it, lol.",
            "But are you sure that's a wiki link, as to me it looks like a link to Wikipedia.org",
            "Brilliant, you should apply for MENSA   :1",
            "Honeypot?"
        ]
    },
    "Villager Trades in 1.14": {
        "title": "Villager Trades in 1.14",
        "score": 4,
        "url": "https://www.reddit.com/r/technicalminecraft/comments/1dr6viy/villager_trades_in_114/",
        "content": "I just started a new world in Minecraft 1.14 to get the god armor. As almost every normal person I found a village and trapped the villagers in a box underground (that was a joke please don't ban me). I get a fletcher for emeralds, buy out all of his stock and when he restocks (keep in mind that I have only bought out all his stock one time) he trades we rather than 1 emerald for 32 sticks, 1 emerald for 54 sticks. Then I trade with him again and buy all his stock again and he trades me 1 emerald for 64 sticks. Anyone know how to fix this?",
        "num_comments": 4,
        "comments": [
            "Those are the 1.14 mechanics, stopping exactly that, just spamming sticks for emeralds. You can trade other stuff to reset both the trades and the prices, they should drop down again. \n\nOtherwise, zombify and cure, should normalise and give you a significant discount as well.",
            "Yeah I know I can do that, but the weird thing is that unlike in resent updates in 1.14 villagers are incredibly brutal with their prices. Like if I buy a fletcher villager's stock twice in 1.21, they'll lower their price to 29 sticks for 1 emerald. but if I do that in 1.14 they'll charge 64 sticks for 1 emerald.",
            "Basic Iron farm with some villagers that buy iron is a good way to get easy early emeralds.\n\n\nBut you can zombify and cure the villagers up to 5x to lower their prices in that version on  hard difficulty. When you buy out villagers it can raise their prices for a while, it is temporary and decays with time.",
            "Thanks!"
        ]
    },
    "Mooshroom farming in v1.21: Farming cooked beef without a single fuel item.": {
        "title": "Mooshroom farming in v1.21: Farming cooked beef without a single fuel item.",
        "score": 2,
        "url": "https://www.reddit.com/r/technicalminecraft/comments/1dr9pko/mooshroom_farming_in_v121_farming_cooked_beef/",
        "content": "This video presents two version of the same farm.\n\n- First, a simple and efficient iteration which outputs about 42 stacks of cooked beef per hour. This simple version of the farm has a full building tutorial. It is compact, acceptably cheap and extremely easy to build. \n\n- Second, the advanced version of the above. This advanced version is a lot more complex to build. It has about the same rates for cooked beef as the simple one, but adds to those about 8,650 bone meal items per hour, thanks to a shearing trick which allows to produce an insane 95,000 red mushrooms per hour (yes, the figure is correct: ninety-five thousands red mushrooms).\n\n[https://youtu.be/LyIyGGYWBuU](https://youtu.be/LyIyGGYWBuU)",
        "num_comments": 0,
        "comments": []
    },
    "World eater in deep frozen ocean": {
        "title": "World eater in deep frozen ocean",
        "score": 1,
        "url": "https://www.reddit.com/r/technicalminecraft/comments/1drcn68/world_eater_in_deep_frozen_ocean/",
        "content": "I planned on making a 160*160 perimeter for a guardian farm in a deep frozen ocean and I'm a bit worried about ice. Is there a way to prevent ice formation completely? I planned on building a roof over the entire area but I'm not sure if it would work if the roof is at bloc limit or if there is an other possibility less time consuming.\nThanks for the help :)",
        "num_comments": 0,
        "comments": []
    },
    "reliable 1.21": {
        "title": "reliable 1.21",
        "score": 1,
        "url": "https://www.reddit.com/r/technicalminecraft/comments/1drbhhu/reliable_121/",
        "content": "is oink oink a reliable source for farms in 1.21 bedrock?",
        "num_comments": 1,
        "comments": [
            "Well, his stuff might be good enough for new players.  I don't really watch his videos but I often notice that he makes the same.tutorials for a lot of the same farms every few months, so that makes me think that he doesn't actually teach you much about how the game works.  When I was a new player, I watched a bit of JC playz.  I \"learned\" how to make a few simple farms, but later when I wanted to get a deeper understanding of how the game works, in realized that I wasn't really learning anything from JC playz.  I have the same suspicion about oink oink "
        ]
    }
}