{
    "We are Jocelyn Gecker and Barbara Ortutay, reporters for The Associated Press. We reported on how social media can impact teen's mental health. Ask us anything!": {
        "title": "We are Jocelyn Gecker and Barbara Ortutay, reporters for The Associated Press. We reported on how social media can impact teen's mental health. Ask us anything!",
        "score": 114,
        "url": "https://apnews.com/article/influenced-social-media-teens-mental-health-e32f82d46ea74b807c9099d61aec25d5",
        "content": "",
        "num_comments": 34,
        "comments": [
            "What do teens themselves think of social media and efforts around understanding its dangers? What are there ideas around reducing usage; what are their thoughts when presented with info on negative mental health effects of social media? Do they buy it?",
            "Are any specific social media apps more harmful than others? And is there any info on what type of social media use is worse than others… is scrolling through videos better or worse than messaging, for example?",
            "**EDIT: That's all the time that we have for today.  Thank you for joining us!**\n\nThe COVID-19 pandemic fundamentally changed the relationship kids have with social media, which has become a space that teenagers increasingly turn to for socializing, trying out emerging identities and seeking advice. As the risk of mental health problems has risen with the time youth spend online, we looked at ways that parents, experts and young adults themselves have suggested to navigate better between digital and non-digital worlds. ***Join us today, June 18, at 12 p.m. ET.***\n\n**Who is here:**\n\n* Expert: Dr. David Bickham research director at Boston Children's Hospital's Digital Wellness Lab. Bickham’s research explores media as an environmental factor that can influence children’s physical, psychological, social, and academic well-being.\n* Barbara Ortutay, a technology reporter at the AP.\n* Jocelyn Gecker, an education reporter at the AP.\n\n**More from the series:**\n\n* [Keeping children safe on social media: What parents should know to protect their kids](https://apnews.com/article/social-media-kids-teens-instagram-tiktok-parents-safety-45df57c32384207ffedc463870b8a6d2)",
            "Do you see a shift in the way parents and teens are approaching social media use, and is there an economic disparity in approach if so?",
            "What responsibility do you think we have on a public policy level to address your concerns? Do you think laws banning or limiting teenager access to these platforms could even be effective, let alone a good idea in the first place? I'm strongly of two minds on this subject, would really like to know what you think!",
            "As a millennial, I’ve been able to be right in the middle of social media’s exploding popularity and was caught up in the “social status” of it growing up. I was worried about friends/followers/what I posted and how people would view me. \n\nAs I got older, I got out of that thought process and began to avoid it like the plague. It began to seem like a rat race to me that I wasn’t interested in and looking back, can definitely see some of the mental health effects y’all wrote about. \n\n*My question is, with it still being in the infancy of what we know about the long term effects, what can be done to address its impacts?* I just saw something recently about wanting to pair a warning with negative effects of social media just like smoking. \n\nI just turned 30 and have eradicated most social media. I recently got back on IG and the reels reel me in sometimes. *But more than anything, what I realize now is that the former want to check social media and what’s new has proliferated into everyday life. I’ll check my phone constantly now, that has minimal social media, like you check the fridge over and over again hoping something you want is in there* \n\n*Are there plans to look at long term negative effects down the road of social media/technology and its impact on teens as they grow older?*",
            "Q to **Dr. Bickham**: Are you comfortable with the title of this post, which makes it sound like the AMA is with two AP beat reporters? Were you involved in this decision? (If not, would you have preferred a title that focused more on the expertise that you can uniquely provide?)",
            "How many of the negatives are so ingrained into social media from the start? I haven’t used some popular sites social media in over 10 years and the dark patterns definitely existed then. Can social media where most interactions are with people we don’t know be healthy while still “filtering” content to be what we’re interested in?",
            "Any general suggestions to parents? What to look out for, what to do when the topic comes up with younger children, or even just general best practices?",
            "Do you see evidence or believe that certain major events or daily interactions would have been/be drastically without the presence of social media? Do the kids you talk to ever consider this? \n\nFor example, the recent campus protests. Protest happens, but did the drive to make content change the nature of SOME (not all but some) of the protesters to possibly go to greater lengths to stand out on social media? And what about more every day interactions? Do teens feel that arguments/incidents being filmed and posted are keeping people in check or do they see how it may distort the full version of what happened? I guess this is just a \"how much of social media do they see as real life\" question?"
        ]
    },
    "Girl, 15, calls for criminal penalties after classmate made deepfake nudes of her and posted on social media": {
        "title": "Girl, 15, calls for criminal penalties after classmate made deepfake nudes of her and posted on social media",
        "score": 10407,
        "url": "https://sg.news.yahoo.com/girl-15-calls-criminal-penalties-190024174.html",
        "content": "",
        "num_comments": 922,
        "comments": [
            "I remember when Facebook would take down anything for no reason at all and now they leave everything and even encourage people to make multiple accounts",
            "I feel absolutely disgusted by what I'm about to say, and I can't believe I have to say it, but here we go.\n\nI agree with Ted Cruz.",
            "A guy in Australia just got nine years in prison for this.",
            "Her classmate basically created child porn? Wow. Sex offender list possibly just got a new name added...",
            "Absolutely side with this girl on this. This is nuts",
            "AI deepfake porn of private citizens should be treated like revenge porn since it will eventually become indistinguishable and result in similar harm to victims.",
            "How exactly is this enforced?\n\n\nI'm not against it in principle, but how exactly do you determine a deep fake is of a specific person and not just kind of looks like them?",
            "Unfortunately, I feel like this is a lost cause. The genie is out of the proverbial bottle.",
            "Websites that allows these features should be punished too, when they implement nothing to prevent this. I’m not talking about the open source models which would be entirely users fault, it’s those undress sites that get more and more popular.",
            "god i'm so glad i didn't grow up in the deepfake age, high school would have been somehow worse"
        ]
    },
    "Dell said return to the office or else—nearly half of workers chose “or else”": {
        "title": "Dell said return to the office or else—nearly half of workers chose “or else”",
        "score": 24562,
        "url": "https://arstechnica.com/gadgets/2024/06/nearly-half-of-dells-workforce-refused-to-return-to-the-office/",
        "content": "",
        "num_comments": 1481,
        "comments": [
            "god bless em. I would opt for remote too given the choice. i don't need a promotion or a new role.  just let me do the fuckin job man",
            "Michael Dell lives in a 34,000 square foot house. It’s hard to take the guy seriously when it comes to the quality of life of his employees. ",
            "Honestly WFH is almost as important to me as salary at this point. I will never choose to primarily work from an office again if I can.",
            "I'd love big corporations to realize, one-by-one and very publicly, that near-zero faith in their corporate advancement or potential for meaningful promotion exists.\n\nIt's not like Dell wasn't aware they're in an industry where job hopping has been the expectation for almost two decades.",
            "I mean, the 'or else' punishment was that they couldn't be promoted or allowed to transfer internally. If you already had one foot out the door, or were thinking of jumping ship, this was a no-brainer. Also, not being promoted is a blessing for many people who don't want to deal with managing teams or having to go down the management track, which sometimes has very little extra compensation in it over being an individual contributor....",
            "Remote work makes me more efficient and a better person NGL",
            "CEO says how important it is to be in the office from his pool house... As he doesn't want anyone seeing the mansion he lives in",
            "You laugh, but this is how you lay people off without paying severance.",
            "\"One person said they'd spoken with colleagues who had chosen to go hybrid, and those colleagues reported doing work in mostly empty offices punctuated with video calls with people who were in other mostly empty offices.\"\n\n\"Executive management at the companies trying to restore in-person work culture claim that working together in a physical space allows for greater collaboration and innovation.\"\n\nThey cannot even be honest about it. Just say that corporations have too much invested in commercial real estate instead of playing this song and dance.\n\nOh, and when you're used to closing deals on a golf course and boat decks, and rampant nepotism is part of your business M.O., of course you may think in-person collaboration is where work happens.",
            "Well done! Keep doing this and show remote work is here to stay."
        ]
    },
    "Internet Archive forced to remove 500,000 books after publishers’ court win": {
        "title": "Internet Archive forced to remove 500,000 books after publishers’ court win",
        "score": 1729,
        "url": "https://arstechnica.com/tech-policy/2024/06/internet-archive-forced-to-remove-500000-books-after-publishers-court-win",
        "content": "",
        "num_comments": 97,
        "comments": [
            "At least we still have public libraries (for now).",
            "Please donate to Internet Archive if you can. \n\n https://archive.org/donate",
            "Some people start archived it. \nhttps://reddit.com/r/Piracy/comments/1dfls77/since_i_know_500000_books_was_deleted_i_decide_to/?sort=new",
            "God... are we REALLY fucking headed this way?",
            "This hurts humanity.",
            "Disgusting behavior. And it paves the way for further erosion.",
            "lol \"win\" is a stretch. \n\nIf one digital copy of a book went on the internet at some point, it's now free forever. \n\nCongrats on removing the largest tree in the orange grove (slow clap)",
            "what's the text of the ruling? this makes zero sense at all and seems extremely dentrimental to the 7th amendment.",
            "Meanwhile GPT uses millions of copyrighted books with nothing happening...",
            "Glad we still have libgen ... i'm gonna go download a few free books out of spite right now."
        ]
    },
    "Five Men Convicted of Operating Massive, Illegal Streaming Service 'Jetflicks' That Allegedly Had More Content Than Netflix, Hulu, Vudu and Prime Video Combined": {
        "title": "Five Men Convicted of Operating Massive, Illegal Streaming Service 'Jetflicks' That Allegedly Had More Content Than Netflix, Hulu, Vudu and Prime Video Combined",
        "score": 12433,
        "url": "https://variety.com/2024/digital/news/five-men-convicted-jetflicks-illegal-streaming-service-1236044194/",
        "content": "",
        "num_comments": 975,
        "comments": [
            "Don’t worry another one will pop up",
            "That streaming service sounds awesome",
            "Maybe they should've put \"no copyright infringement intended\" in front of every movie",
            "The group used “sophisticated computer scripts” \n\nDOJ press releases are peak alarmist boomer.",
            "Sounds like the kind of streaming service everyone actually wants, not the fragmented ad riddled crap the mainstream providers are hell bent on providing.",
            "Rest in power, kings",
            "Damn I missed out",
            "If they got rich off exploiting artists and gouged their customers they would have been labelled successful executives.",
            "Horrible! thats why Netflix' revenue was so low at 33bn last year! Despicable...",
            "How did I never hear of this? \n\nI’m ok with some laws being broken and piracy laws are one of them…."
        ]
    }
}