{
    "Honeypot flairs.": {
        "title": "Honeypot flairs.",
        "score": 33,
        "url": "https://www.reddit.com/r/technicalminecraft/comments/191fuf4/honeypot_flairs/",
        "content": "To cut down on the increased number of posts involving rule-breaking mods (notably Paper), 3 new post flairs have been introduced for testing.\n\nPosts made using these flairs will be automatically removed.\n\nDon't use them.\n\nEDIT: After 3 weeks, this seems to have been a very successful test, with the vast majority of rule-8 violations blocked by the new filters.",
        "num_comments": 17,
        "comments": [
            "Thank god this sub is in dire need of moderation. Kudos for stepping up when no one else on the team can.",
            "Thanks for your work, mods!",
            "Are these still present? I'm new to Reddit, so I don't know which flairs are new and old here. I'd like to avoid having a post auto-banned.",
            "Honeypot?",
            "2 of the tags are related to modifications, one is related to that game server which is named by the product made from wood :)",
            "That sounds like a request to [read the rules](https://www.reddit.com/r/technicalminecraft/about/). Welcome to the sub! May your redstone eventually work as intended. ✊",
            "https://en.wikipedia.org/wiki/Honeypot_(computing)",
            "I know that from that YouTube shorts wizard programmer dude.\n\nI meant why honeypot",
            "To save the mods time - they’ll auto get removed and people don’t read the rules so will add the flairs?",
            "Yes I get how it works I'm talking about the individual word itself"
        ]
    },
    "116,000 item/hr simple Slime farm using oozing ": {
        "title": "116,000 item/hr simple Slime farm using oozing ",
        "score": 13,
        "url": "https://youtu.be/j_BPhn7nVw4",
        "content": "",
        "num_comments": 2,
        "comments": [
            "In 1.21 it's easy to farm slime balls anywhere without a player using oozing effect.",
            "Does this work on Bedrock edition?"
        ]
    },
    "bad distribution in super smelter": {
        "title": "bad distribution in super smelter",
        "score": 4,
        "url": "https://www.reddit.com/r/technicalminecraft/comments/1dr1w2o/bad_distribution_in_super_smelter/",
        "content": "The fuel distribution is weird, so in the beginning the fuel was getting distributed fine, but then it started distributing the carpets slower, then the smelter stopped smelting. Any fixes?\n\nSuper smelter used : [https://www.youtube.com/watch?v=67ylHYrlemo](https://www.youtube.com/watch?v=67ylHYrlemo)",
        "num_comments": 7,
        "comments": [
            "Correct me if im wrong but TheySix is another infamous name amongst those that steal (often poor) designs that easily break or dont actually work as intended to begin with",
            "It’s not a great idea for carpet duping on a super smelter in my opinion. Why not use a kelp farm?\n\nThe reason is because the minecarts only distribute one item over the hoppers at a time and it takes 3 carpet to burn a block. So if you can’t deliver the fuel at least 3 times faster than the block your smelting your dead in the water…\n\nA lot of farm designs from these YouTube tutorials work maybe for a few mins and don’t survive actual extended use…",
            "You're 100% correct. [There was a post just yesterday about exactly that](https://www.reddit.com/r/technicalminecraft/comments/1dq7a6a/is_farm_theft_the_standard_for_youtube/)\n\nBesides, TheySix's description in this video says this works in Bedrock and last I checked carpet dupers definitely don't. I'll credit that he at least mentioned it wont work on PaperMC in the vid\n\nTheySix and Shulkercraft both grew their channels from stolen designs and neither really develop redstone so they can (and have) frequently posted mistakes or fail to explain *why* you're building something so you'll have a tougher time troubleshooting issues.\n\n/u/ufartedlol -- build any of the popular bamboo farms. If you're on 1.21 then you can even drop in an auto-crafter to change the bamboo to to wood > planks > slabs if you wanted to get extra w/ it.\n\n[potato_noir's bamboo farm smelter](https://www.youtube.com/watch?v=K6dEeGHEIOY) should still work beautifully in 1.21",
            "Why is that? I recently built my first one and use a carpet duper. It's only been a few weeks, but it's been working fine.",
            "I’m not against them I just made a video playing with one today actually it’s just that they make such garbage fuel for larger designs, and they often can’t keep up with continuous use if they are delivered via minecart especially…",
            "Gotcha. That makes sense. I have mine delivered via water streams and also set to auto run based on the last hopper in the line being full or not and it's been working great. Haven't necessarily had it running continuously though. Just running back with an inventory full of cobblestone while I work on some projects.",
            "Yea no I’m def pro duping carpet for normal hopper fed systems hell yea…\n\nYea calling system is the go to bc the noise.. u got any pics?"
        ]
    },
    "In a drained and hollowed out ocean monument where is the best place for the farm?": {
        "title": "In a drained and hollowed out ocean monument where is the best place for the farm?",
        "score": 3,
        "url": "https://www.reddit.com/r/technicalminecraft/comments/1dr312x/in_a_drained_and_hollowed_out_ocean_monument/",
        "content": "Hello i recently drained and hollowed out an ocean monument to turn it into a base /farm and i was just wondering where is the best place to put it inside it for maximum spawn rates",
        "num_comments": 1,
        "comments": [
            "On bedrock, guardians spawn in specific x,z locations in the bounds of the monument. There's a post here that shows those locations: https://www.reddit.com/r/MinecraftHelp/s/fsGRDL7ZAD"
        ]
    },
    "Has anyone made a item sorter that sorts into categories with multiple items instead of one specific item?": {
        "title": "Has anyone made a item sorter that sorts into categories with multiple items instead of one specific item?",
        "score": 2,
        "url": "https://www.reddit.com/r/technicalminecraft/comments/1dr4trg/has_anyone_made_a_item_sorter_that_sorts_into/",
        "content": "I mean instead of one thing for specifically oak planks, I could have a whole section for planks or oak or whatever. Also, it cant be the type where the chest needs to be completely filled.",
        "num_comments": 8,
        "comments": [
            "You're looking for a MIS - a multi item sorter.\n\nThere are plenty of designs out there, I'll link you my 2 favorite ones:\n\nMoony MIS v5 with great explanation by Raps: https://youtu.be/lgmB0znXhrA?si=ntTSBIz-_XNFIKsO\n\nCart based CartMIS 2.0 by Raps and others: https://youtu.be/LPshwkDboXk?si=-WbMTuISiDPaWEKK",
            "Based on op's post on r/redstone they're playing bedrock. Not sure why they used the non version specific flair here",
            "will either of those work on bedrock? sorry I didn't think I needed to specify",
            "i didnt think there would be many differences for something like this. idk redstone tho that's why I'm here lol",
            "You could try this: https://youtu.be/SG5kRzjH-qs?si=eknXaWmvnpap2HOH\n\nMaddhatter is good and I notice that he's posted an update in the description for 1.21 so it should be up-to-date. I've not used it personally though. *Read the description*",
            "this seems great, but the only problem is he posted part one back in febuary and hasn't made a video on it since and he has some other series going on, so idk if he will go back to it. is there something similar? I don't play on pc so I cant use his structura files",
            "what do you think about this one?\n\n[https://www.youtube.com/watch?v=pYNgP19UA1w](https://www.youtube.com/watch?v=pYNgP19UA1w)",
            "Again, not tried it, but I've seen someone else recommend it before and I've seen good stuff from dawgie, so I know he's trustworthy. \n\nIt should be good"
        ]
    }
}