{
    "Clamping down on low effort / off topic / bot content": {
        "title": "Clamping down on low effort / off topic / bot content",
        "score": 119,
        "url": "https://www.reddit.com/r/technicallythetruth/comments/1b42fvb/clamping_down_on_low_effort_off_topic_bot_content/",
        "content": "We are fed up of the amount of off-topic / low effort / bot accounts content here and are claming down on it. Please report any you see. Bans are going to be issued. This is not a dumping ground for such content and is ruining the subreddit.  So many bot accounts have been banned in 24 hours alone. \n\nThank you to those of you who have been reporting such content.",
        "num_comments": 26,
        "comments": [
            "Please let us know if you think things have improved regarding spam bots. Thanks.",
            "THANK YOU! \n\nWe need to make content on this sub better.",
            "How do we spot bots?",
            "# FINALLY something is being done about the spam. Good work",
            "thank you moderator very cool",
            "how do we report bots?",
            "# Finally! Something is happening to bots! :D",
            "If someone posting the same memes over and over and over it's a bot",
            "Amen to this.  Hurray for taking action against the bots.",
            "I have to go through thier history?"
        ]
    },
    "We need video evidence of that experiment.": {
        "title": "We need video evidence of that experiment.",
        "score": 4242,
        "url": "https://i.redd.it/qlezoeljyf9d1.jpeg",
        "content": "",
        "num_comments": 138,
        "comments": [
            "Good maybe reverse cowgirl will finally be a comfortable position",
            "Is this what they are doing in International Space Station?",
            "Same with missionary and cowgirl I guess",
            "Am I the only one who did the figuring and geometry, and without gravity, yep that sounds right? ",
            "That's one small step for man, one giant leap for mankind",
            "Look, to keep it simple, just remember that the enemy's gate, is 'Down'.",
            "Do people do the deed in space?",
            "Why did we need NASA to confirm this?",
            "*technically* you are never not in space",
            "Me: You people got problems.\nAlso me: here have an upvote."
        ]
    },
    "Fat makes people look fat.": {
        "title": "Fat makes people look fat.",
        "score": 674,
        "url": "https://i.redd.it/tpu28t2ozg9d1.jpeg",
        "content": "",
        "num_comments": 18,
        "comments": [
            "After this one, I would have chosen Harry too ",
            "The dress makes you look like youre in a dress.",
            "To conclude with another one from that tv show,\n\n\"The prostitution rests\".",
            "Can't argue with that logic!",
            "\"The dress makes you look ugly. The question about the dress making you look fat makes you sound stupid. So now you're stupid and ugly.\"",
            "Also I missed the part where that's my problem.",
            "when you ask your boyfriend to be honest and he does what you ask and you hate him for it - classic",
            "yeah idk, sometimes the hard truth, the cold honest truth is pretty hurtful and not many people are ready to hear it. Im not talking about special snowflake syndrome people haha maybe Im flexing but when were talking about feelings and relationships, we need to know how to play the honesty card :/",
            "i think if you cant handle a basic truth and you need me to cover it in daisies and pillows when your in a relationship then its not an honest relationship and is basically enabling , theres telling white lies and then there is just being untruthful and not yourself, so as much as i need to baby someones feelings its always better to tell the truth so they can grow into a strong person , and just ask for what you want , if you want me to glaze you with compliments just ask and i will , but dont ask for a bloody burger and expect nuggets , thats crazy",
            "Seems to be a fat person"
        ]
    },
    "One of the best feelings in the world": {
        "title": "One of the best feelings in the world",
        "score": 680,
        "url": "https://i.redd.it/h4sk110l6g9d1.jpeg",
        "content": "",
        "num_comments": 10,
        "comments": [
            "In other words, I find you average.",
            "If you see what i mean...",
            "you are median to me",
            "Still better than 50% of the sample. Yay.",
            "you're so median to me",
            "\nHey there u/All_Is_Time, thanks for posting to r/technicallythetruth!\n\n**Please recheck if your post breaks any rules.** If it does, please delete this post.\n\nAlso, reposting and posting obvious non-TTT posts can lead to a ban.\n\nSend us a **Modmail or Report** this post if you have a problem with this post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/technicallythetruth) if you have any questions or concerns.*",
            "Nah, that'd be the median. Average can get skewed by outliers.\n\n\nFor example, consider a group of six people. Let's say on some arbitrary metric they were rated 1, 1, 2, 2, and 3 and 9. The average is 3. If you were average in this group, you'd be better than four people.",
            "r/lostredditors",
            "Yes",
            "That's mean."
        ]
    },
    "They trully would have to do it.": {
        "title": "They trully would have to do it.",
        "score": 570,
        "url": "https://i.redd.it/29zoewxc6g9d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "why would you do it though",
            "What if they just postponed it until the crowd could disassemble and dispose of it?",
            "and if they move it?",
            "it would also die if you dont put it in a basketball court",
            "Well at least it will be able to breathe",
            "ofcourse they are there, but you have to zoom in a bit.\n\nAlso, the petunias are broken from the fall.",
            "\nHey there u/All_Is_Time, thanks for posting to r/technicallythetruth!\n\n**Please recheck if your post breaks any rules.** If it does, please delete this post.\n\nAlso, reposting and posting obvious non-TTT posts can lead to a ban.\n\nSend us a **Modmail or Report** this post if you have a problem with this post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/technicallythetruth) if you have any questions or concerns.*",
            "It would also die.",
            "Would there be petunias?",
            "Damn."
        ]
    }
}