{
    "[mod] TeenCast Episode 2 out now!": {
        "title": "[mod] TeenCast Episode 2 out now!",
        "score": 74,
        "url": "https://www.reddit.com/r/teenagers/comments/1cvxupj/mod_teencast_episode_2_out_now/",
        "content": "Hey everyone!\n\nI am delighted to announce that episode 2 of r/teenagers very own podcast, TeenCast, funded by Reddit Community Funds is out now!\n\nThis episode features the esteemed **Ned Batchelder**!\n\n  \nApologies for the delay in getting this episode out, episodes should be a little more frequent now!\n\n\n\nWe had a lot of fun recording with Ned, and it was actually the *first* episode we ever recorded!\n\n\n\nHe gives an insight on his experiences with coding, but also talks about his general life stories, all of which, were really interesting and insightful! \n\nHe gave some great advice, so I encourage everyone to give it a listen! :)\n\n\n\nYou can watch the episode on [Youtube](https://youtu.be/QaEQHq2X8aM), or listen/watch on [Spotify](https://open.spotify.com/episode/73CMCTspKTQnosj8xZYjrU?si=21a5ce2ceb2549f7) :)\n\nYou can also watch episode 1, recorded with Glitch Productions on the respective pages!\n\nThanks everyone, and catch you next time!",
        "num_comments": 48,
        "comments": [
            "Will it ever be published to Apple Podcasts? I’d love to listen it there! By the way, if you guys wanted a person who could edit your audio and/or video you can reach out to me, I have access to Adobe Premiere Pro and Adobe Audition. Id be happy to do the work for free, as it’s just fun for me",
            "I didn’t even know we had a podcast",
            "That's awesome!! Keep up the good work ❤️❤️",
            "If it aint pancakes, i aint havin' it",
            "once again i stand by my statement pal 😤",
            "Bee poop.  They didn’t pull his hair yet",
            "Won his son ? Morons",
            "Now I have to check this out",
            "Anyone wanna drive an f 35",
            "Dick and balls cock and nuts and maybe penis and ballsie"
        ]
    },
    "[mod] Self-post weekend is active - Introduce yourself and make friends!": {
        "title": "[mod] Self-post weekend is active - Introduce yourself and make friends!",
        "score": 3,
        "url": "https://www.reddit.com/r/teenagers/comments/1dq4qim/mod_selfpost_weekend_is_active_introduce_yourself/",
        "content": "**Welcome to** r/teenagers**'s** **self-post weekend. Self-post weekend is when we, the moderating team, disable link posts for the period of the weekend to encourage more discussion and less memes during our higher traffic period of the week.**\n\n&#x200B;\n\nIn this thread we also encourage you, the community, to introduce yourselves. Post a parent comment reply, and let us know who you are, what your hobbies are like or maybe a weird quirky fact that could work as an icebreaker. In addition, we'd like to remind users not to include any [personally identifying information.](https://www.reddit.com/r/teenagers/wiki/rules#wiki_3._no_personal_information.2C_of_yourself_or_others.)\n\n&#x200B;\n\nGet to know one another more and *Remember the Human* behind that username! We encourage all users to comment and reply to each other's parent comment replies to meet the interesting members that comprises this community.\n\n&#x200B;\n\nLooking for even more specific places to meet new friends and a sense of community? [Visit our Discord server, where you can talk to each other in real time with a variety of topics that occur! Our Discord server is one of the top active servers you can join to participate, so never feel as if it's empty to join and discuss!](https://discord.gg/teenagers)\n\n&#x200B;\n\n<3,\n\n&#x200B;\n\n\\- r/teenagers moderating teams",
        "num_comments": 9,
        "comments": [
            "IT'S 5AM ON FRIDAY PLEASE\n\nalso fix the \\**'s** I beg of you",
            "Hello! I'm a teen who plays chess",
            "Hi guys I’m new to this and I’m Camy and I’m 16 and I like to write songs, dance, and play roblox.",
            "no?",
            "No",
            "Noooooo no more images",
            "Booo",
            "No",
            "vergil realness"
        ]
    },
    "Why are girls so fucking hot ?!": {
        "title": "Why are girls so fucking hot ?!",
        "score": 462,
        "url": "https://www.reddit.com/r/teenagers/comments/1dr5r5x/why_are_girls_so_fucking_hot/",
        "content": "Cause I don't wanna be unfair tbh....┐(￣ヘ￣)┌",
        "num_comments": 305,
        "comments": [
            "Ikr, I'm 36,6°C after all",
            "Fr Why they gotta be all hot and cute 😭🙏",
            "Cuz they live inside microwave",
            "True girls are just so fucking cute it just makes me skldjfkwdlejhfjenfjekflkjehfoiidkjfscfiefoi:3:3:3:3:3:3:3:3:3",
            "True! \n\nTo be honest, I would say that beauty standards are set much higher for women than for men.",
            "i really wish i was hot",
            "Indeed, my fellow girl liker",
            "Because we have good air conditioning and they don't?",
            "The real question is….why is EVERYONE hot? 😔",
            "Fr I'm tall and every short girl looks hella cute bro 😭"
        ]
    },
    "I’m so disturbed": {
        "title": "I’m so disturbed",
        "score": 3649,
        "url": "https://www.reddit.com/r/teenagers/comments/1dqtncv/im_so_disturbed/",
        "content": "I was in class today and I saw that the 2 boys next to me wouldn’t stop laughing at something under the desk. So out of curiosity I looked and they were watching porn.what I saw was so disgusting. But why were they watching it together ? And why in school ?! They realised that I saw and just started laughing more..they weren’t embarrassed at all. I don’t understand teenage boys.",
        "num_comments": 558,
        "comments": [
            "They ain’t ever beating the gay allegations",
            "I'm convinced boys turn into a different species between the ages of 13 and 18, take or leave 2 years",
            "they make reading/writing fanfiction in school look like its child's play",
            "As a teenage boy, what the fuck, they gotta be at least A LITTLE zesty.",
            "I feel kinda bad cause I was in a situation similar I had a odd friend growing up and he always was trying to get me to watch porn and masturbate with him and I never wanted to but kept hanging out with him because we were both in the same boy scout troop together and one day my family invited him over to spend they night (they didn't know and still don't because I'm afraid to tell them they were not the best parents) but long story short he molested me that night and I'm pretty sure that's partly responsible for the porn addiction and suicidal and homicidal thoughts I have.",
            "there was a kid in my class who did this frequently... IN 4TH GRADE",
            "oh lord, this reminded me of the time this one guy who sat next to me in spanish class, he smelt like he hadn't taken a shower in like... 2 weeks and instead just sprayed on axe body spray, but he was literally jacking off right next to me, trying to hide it underneath the hoodie he had on 😭",
            "Well, like a week ago in religion class. Two guys were sitting and also watching porn, but one whipped his dick out, my friend told me and i looked at him. When i looked at him he just smiled, idk what's wrong with them",
            "I am too cuz like my classmates were doing the same (like one of my friends with one kinda friend) but like it doesnt even surprise me. Like its not like thats 80% of what my class talks abt",
            "As a teenage boy myself, I do not understand them either\n\nWe're not all like that. What those boys are doing is inappropriate and pretty creepy behavior."
        ]
    },
    "Lost my virginity ": {
        "title": "Lost my virginity ",
        "score": 181,
        "url": "https://www.reddit.com/r/teenagers/comments/1dr8tvd/lost_my_virginity/",
        "content": "Okay so I’m 17 and a transgender male. I have a boyfriend who I’m very happy with and we’ve been dating for a good bit now. He’s sweet, he’s met my parents and they like him too. Today I saw him again and we were home alone, so we decided to fool around a little.\n\nI don’t masturbate often and when I do it’s never fingering, only outside stuff cause I’ve never enjoyed penetration, even with just one finger. Anyways so it happened, and he had a condom, and oml it hurt like a bitch. Like it felt horrid at first, then turned tolerable but no where near as good as masturbation, and he kept apologising and asking if I was okay and I just kept saying I was fine and just needed to adjust. Anyways things got worse cause he pulled out and there was blood and I genuinely felt so bad and I’m so scared he might be disgusted with me or smth or be worried that I hate him. Neither of us finished cause my dad came home and everything seemed fine after that but still. It was also so awkward when I offered to just stop and tell him this wasn’t working, and he respected my decision but he looked a little disappointed. Losing my virginity wasn’t enjoyable at all really, and I’m scared to have sex again if he tries to bring it up, I don’t want it to hurt like a bitch again.",
        "num_comments": 86,
        "comments": [
            "Lube is your friend use it",
            "Hey! Yes this is normal, there is nearly always blood the first time, nobody finishes and it hurts like a BITCH. It gets better - thats all I can say sadly",
            "I thought u was a dude and got f ind the ass",
            "This is very normal. It’s going to hurt and be a bit uncomfortable because your hymen is stretching for the first time that’s what they call “ popping your cherry”. This can cause some bleeding but each time will be less and less. It will also get more enjoyable over time! I didn’t really enjoy it till 10+ times of being with my boyfriend. Voice what feels comfortable and be safe!\n\nAlso, nobody really has a good first time so don’t stress it.",
            "Damn bro that sucks, hope you find it.",
            "You might wanna go see a doc",
            "Wait so are you gay? Or straight? Sorry I'm not familiar with lgbt",
            "I don't know anything about vaginas but my gf said you need to prep more and masturbate with a small amount of penetration and use plenty of lube also try and locate your bladder (the g spot) if you want to have an easier time orgasming penetratively",
            "Sorry to hear it wasn’t an enjoyable experience definitely talk to him about it and weight out ur options",
            "From what I know (I’m a guy idk much) it’s normal so there really shouldn’t be nothing to worry 👍🏽"
        ]
    }
}