{
    "Tekken Dojo: Ask Questions Here": {
        "title": "Tekken Dojo: Ask Questions Here",
        "score": 949,
        "url": "https://www.reddit.com/r/Tekken/comments/r5kux2/tekken_dojo_ask_questions_here/",
        "content": "Welcome to the [Tekken Dojo](/r/Tekken/about/wiki/tekken-dojo), a place for everyone to learn and get better at the wonderful game that is Tekken.\n\n## Beginners should first familiarize themselves with the [Beginner Resources](/r/Tekken/wiki/beginner-resources) to avoid asking questions already answered there.\n\nPost your question here and get an answer. Helpful contributors will be awarded [Dojo Points](https://www.reddit.com/r/Tekken/wiki/tekken-dojo/dojo-leaderboard), which can make them Dojo Master at the end of the month (awards a unique flair). Please report unhelpful contributors to ensure the dojo remains a place dedicated to improvement.",
        "num_comments": 24529,
        "comments": [
            "I don't know much about the etiquette of online play so if someone could enlighten me as to why \"ki charging\" makes people so upset? Sorry if this has been asked before. \\^\\_\\^;;;",
            "Not a question, but I can understand if its best not suited here but I sincerely want to say how for all personal life pressures and current countdown until rolling out to work that * this Reddit has made for some of the most casual fun Ive had on this platform * even if its not being the fun sunshine poking through the monotonous clouds of Reddit postings on the cy sociopolitical deterioration, demise ad despair of the world. \n\nI was too nervous but to post this even as a fluff posting which might throw off the theme of Tekken fun but thank you all ! ^_^ .",
            "Got the game. Played through arcade quest, all the character episodes, main story, picked a main, and spent a few hours reading up/learning basic moves.\n\nCurrently at 0-10 in ranked, hoping to get to 0-100 if I really stick at the grind, wish me luck.",
            "Dear diary I punished with EWGF on wifi",
            "how come there wasnt a thread about red bull golden letters event? it was pretty hype but i see 0 discussion about it",
            "I don't want to make a whole post because I feel it's a waste of space but holy fuck I'm so hyped. New to the franchise and I just hit red with Lee. You all told me to pick a character I thought was cool, so I did, and then proceeded to hop on the fucking struggle bus for 2 months and nearly 700 matches. Nowhere to go but up but man I am so fucking pumped.",
            "If I block Julia's df2,1 leaving me +18, and it takes 11 frames for my WGF to come out, does that mean I have only a 7 frame long window to input for a punish?",
            "How do I deal with fighting a character ive never seen before or maybe only once in a hundred games? I just got my 100th win on Steve and my next game was against an Eliza. Needless to say I lost badly barely understood what she was even doing then they denied the rematch. Do I just ignore the rarer match ups? Accept that once in a hundred games I just have to lose to an Eliza or Ganryu? Or is there some \"trick\" to dealing with matchups you dont know and are unlikely to ever face often. I mean it can be hard enough to simply understand what to do against King not mention the other 50 people doing god knows what. Thanks.",
            "is there a way to stop king from moving so much while customizing? it makes me kinda dizzy",
            "I want to start labbing properly. Do i need to purchase the \"TEKKEN 7 - DLC13: Frame Data Display\"? Or are there any mods that can replace it"
        ]
    },
    "This weekend's competitive Tekken – CEO 2024 [28.06-30.06.2024] feat. Chikurin, Joka, Shadow 20z, Keisuke, Joey Fury, Qudans, Atif, Super Akouma, Anakin, Saint, Speedkicks, Tibetano, Fear of Silence, K-Wiss and more!": {
        "title": "This weekend's competitive Tekken – CEO 2024 [28.06-30.06.2024] feat. Chikurin, Joka, Shadow 20z, Keisuke, Joey Fury, Qudans, Atif, Super Akouma, Anakin, Saint, Speedkicks, Tibetano, Fear of Silence, K-Wiss and more!",
        "score": 117,
        "url": "https://www.reddit.com/r/Tekken/comments/1doykjy/this_weekends_competitive_tekken_ceo_2024/",
        "content": "This weekend we have CEO 2024 in Daytona Beach, Florida.\n\nThis is a TWT Master event with another 2 slots for the Esports World Cup. \n\nThere are only 3 players, that already qualified for the EWC (Chikurin, Keisuke, Kkokkoma) so it's going to be a harsh fight for the top 2 positions.\n\n---\n\n## CEO 2024 (2 EWC Slots, Master TWT tournament)\n\n---\n\n## Streams:\n\n|EN – Twitch|EN – YouTube|\n|:-|:-|\n|[https://www.twitch.tv/Tekken](https://www.twitch.tv/Tekken)|[https://www.youtube.com/@BNEEsports/streams](https://www.youtube.com/@BNEEsports/streams)|\n\n---\n\n## Start/gg link:\n\n[**https://www.start.gg/tournament/ceo-2024-6/event/tekken-8/overview**](https://www.start.gg/tournament/ceo-2024-6/event/tekken-8/overview)\n\n---\n\n## Schedule:\n\n[Image form via ceogaming.org](https://ceogaming.org/wp-content/uploads/2024/06/ceo-2024-schedule.png)\n\n|Round|Countdown|Date (DD.MM.YYYY)|EDT (local) \\[UTC-4]|CEST [UTC+2]|JST \\[UTC+9]|US West \\[UTC-7]|\n|:-|:-|:-|:-|:-|:-|:-|\n|Pools A-D|[Link](https://www.tickcounter.com/countdown/5451062/ceo-2024-pools-a-d)|28.06.2024|12:00|18:00|01:00 (29.06.2024)|09:00|\n|Pools G-H|[Link](https://www.tickcounter.com/countdown/5451067/ceo-2024-pools-g-h)|29.06.2024|12:00|18:00|01:00 (30.06.2024)|09:00|\n|Phase 2|[Link](https://www.tickcounter.com/countdown/5451072/ceo-2024-phase-2)|29.06.2024|16:00|22:00|05:00 (30.06.2024)|13:00|\n|Top 24|[Link](https://www.tickcounter.com/countdown/5451073/ceo-2024-top-24)|29.06.2024|20:00|02:00|09:00 (30.06.2024)|17:00|\n|Top 8|[Link](https://www.tickcounter.com/countdown/5451074/ceo-2024-top8)|30.06.2024|18:00|00:00 (01.07.2024)|07:00 (01.07.2024)|15:00|\n\n---\n\n## Notable participants:\n\n[link (via Liquipedia)](https://liquipedia.net/fighters/Community_Effort_Orlando/2024/T8#Participants)\n\n---\n\n## EWC Qualified players as of 27.06.2024\n\n|||||\n|:-|:-|:-|:-|\n|Chikurin|LowHigh|Chanel|Mangja|\n|Nobi|Rangchu|CBM|Mulgold|\n|AK|Arslan Ash|Sephiblack|Farzeen|\n|Yagami|Ulsan|JeonDDing|THE JON|\n|KaneAndTrench|Raef|Keisuke|Jodd|\n|Kkokkoma|Edge|Knee|Meo-IL|\n\n---\n\n## Prizepool and points\n\n|Place|Prize money|TWT Points|\n|:-|:-|:-|\n|1st|$6170 + EWC Slot|560|\n|2nd|$2468 + EWC Slot|400|\n|3rd|$1604|300|\n|4th|$863|220|\n|5th–6th|$370|180|\n|7th–8th|$246|150|\n\n^(*Prize money is not confirmed.)\n\n---\n\n## Current TWT Leaderboard\n\n\n[https://tekken-esports.bn-ent.net/ranking](https://tekken-esports.bn-ent.net/ranking)\n\n---\n",
        "num_comments": 20,
        "comments": [
            "Hey thanks. Always appreciate you making these threads.",
            "Looking out for JDCR. Hope he gets in.",
            "The hero we need, as an avid tournament watcher I have been longing for posts like these. Not only do you provide them but with consistency and frequency as well, keep it up!",
            "Really big for NA Tekken, good chance at finally getting someone to represent at the EWC.",
            "Damn Ahsan Ali not making it to this one either? Dude's been sponsored but still can't make it to any tournaments.",
            "Victim of ritual's Nina ",
            "32 sets of pools, Jesus! Thats double the amount of last year if Im not mistaken.",
            "Good stuff as always, thanks",
            "This threads with the schedule are so good, thank you!",
            "wow none of the DRX members is going?"
        ]
    },
    "High School Social Circles": {
        "title": "High School Social Circles",
        "score": 183,
        "url": "https://i.redd.it/30jtrybnhg9d1.png",
        "content": "",
        "num_comments": 44,
        "comments": [
            "Swap Asuka and Lidia for sure. Asuka rides her bike around town wading fists-first into gang fights; Lidia is on track to hold the highest political office in the country before she's 30.",
            "Zafina is definitely on the weirder side",
            "Victor would be class president. Azu would be popular. She dances and shit. Eddy to weird kids. Asuka to chill kids and Lin to smart kids.",
            "Asuka wouldn't be smart kid. Lol",
            "Jack is definitely special ed. You see his win poses? He flops on the ground throwing a temper tantrum.",
            "Youre missing a category of Emo / Goth where youll have Jin, Zafina, and always for some reason, that random Arab kid Shaheen",
            "Kazuya is the son of the school principal. Probably the scariest bully of all",
            "How is Jin not weird weebs",
            "why is bryan in bully he got expelled at orientation for bringing his minigun",
            "Kinda wish there was a tierlist that included other characters / not exclusively Tekken 8 characters"
        ]
    },
    "You know what? Kazuya had opportunity to continue Williams bloodline two times ": {
        "title": "You know what? Kazuya had opportunity to continue Williams bloodline two times ",
        "score": 684,
        "url": "https://i.redd.it/qs70viaj4e9d1.jpeg",
        "content": "",
        "num_comments": 127,
        "comments": [
            "Bro had Anna, Nina *and* Azucena in his payroll at one point. He could've been exactly like Heihaichi lol",
            "He more than likely knew that the Williams sisters would've flipped on him in an instance.  Especially Nina.",
            "in the 2010 movie Kazuya bangs both Anna and Nina at the same time.\n\nI'm sorry I dredged up the memory of that movie in the heads of everyone who saw it, I just find it fascinating how the sisters were basically there to just be pieces of ass for Kazuya x'D",
            "But Kazuya is only faithful to Jun despite being absent from her and Jin",
            "He may be a psycho, but at least he is a stick to one type of man",
            "The Williams sister werent strong enough, Kaz said on his ending, his special lady is... 'strong'",
            "Nah his true love is jun, he could never betray her",
            " Nah. I ship Anna and Lee.",
            "Idk if he didn't want another offspring like Jin with the Devil Gene as a rival or he just loves Jun so much he can't see another woman the same way as he does to her.",
            "I really wish Anna was the one working for Kazuya in T8, instead of Nina :') I think they, like, have an actual appreciation for each other and enjoy each other's company, so it would've been nice to see some fun/interesting interactions between them throughout Story Mode, as opposed to what we got w Nina and Kazuya which was very much 'Right, down to business, hello and goodbye'.\n\nI really think Anna could've worked so well being incorporated into the base game plotline :') Nina could've also then worked for Jin and co. because she's worked w Jin before, and Lee and Nina having a special intro would make more sense because right now that little side story or w/e lowkey feels tacked on, like I don't think she even takes Lee's request in the canon timeline so what was even the point  It's cool and all but imo it would've made more sense for Lee's other intro to be, idk, Alisa or Kazuya or smth (at least he gets special dialogue w Kazuya ig :'D). But yeah anyway I think Anna would've fit right into the plotline and it would've been neat to draw back on her and Kazuya's history, and would've been a good way to bring the Williams sisters' plotline back, but ah well :'D"
        ]
    },
    "Well that's new to me": {
        "title": "Well that's new to me",
        "score": 59,
        "url": "https://v.redd.it/6pnt92llrh9d1",
        "content": "",
        "num_comments": 6,
        "comments": [
            "So thats how you counter flea shenanigans!",
            "The rare occasion a Yoshi gets confused himself",
            "I never understood that. I always thought that a low, d,4 for example, should get hit by flea stance. Would be such a cool way to do hard reads as a round finisher.",
            "You mean we get to annoy the Yoshi's??? Time to crawl baby",
            "I, err... \n\n...maybe she crawled between Yoshi's swords? Zafina is pretty bendy\n\n(Either way, cool interaction! I'll have to try this against flea stance in future)",
            "me and who?"
        ]
    }
}