{
    "What are you watching and what do you recommend? (Week of June 21, 2024)": {
        "title": "What are you watching and what do you recommend? (Week of June 21, 2024)",
        "score": 22,
        "url": "https://www.reddit.com/r/television/comments/1dl62jv/what_are_you_watching_and_what_do_you_recommend/",
        "content": "Comments are sorted by new by default.\n\n* Feel free to describe what shows you've been watching and what you think of them.\n\n* Feel free to ask for and give recommendations for what to watch to other users.\n\n* All requests for recommendations are redirected to this thread, however you are free to create your own thread to recommend something to others or to discuss what you're currently watching.\n\n* Use spoiler tags where appropriate. Copy and edit this text: \\>!Spoiler!< becomes >!Spoiler!<. Type *inside* the exclamation marks, with no extra spaces.",
        "num_comments": 106,
        "comments": [
            "I finally started **The Sopranos** for the first time. Obviously I don't have too many thoughts yet but I can understand why this was the start of \"prestige tv\" as we know it. Even now, a lot of this stuff feels timeless.",
            "Shows from last week's [thread](https://www.reddit.com/r/television/comments/1dfsw2c/comment/l8ld2yd/) mentioned in at least 10 comments:\n\n|**Show**|**On**|**Comments**|**Upvotes**|**Consec. Weeks**|**Comment Gain**|**Total Weeks on Top**|\n|:-|:-|:-|:-|:-|:-|:-|\n|**The Boys**|Prime Video|44|426|2|23|3|\n|**House of the Dragon**|HBO|26|231|3|16|4|\n|**Dark Matter**|Apple TV+|26|214|7|1|7|\n|**Presumed Innocent**|Apple TV+|24|204|1|16|1|\n|**The Acolyte**|Disney+|22|158|3|-10|3|\n|**Severance**|Apple TV+|16|110|2|2|4|\n|**Interview with the Vampire**|AMC+|14|200|2|2|3|\n|**Colin From Accounts**|Paramount+|11|117|1|4|1|\n|**Fallout**|Prime Video|10|60|1|5|9|\n\nShows Dropped From 10+ Comments List this Week: Star Wars: Andor\n\n\\*Total Weeks on Top began on 12/8/23, as did all data collection.\n\n\\*\\*I took up grubster11's mantle after their retirement. You can view the original code they created to tally comments here: [https://github.com/GrubHubGitTub/r-television-Weekly-Thread-Data](https://github.com/GrubHubGitTub/r-television-Weekly-Thread-Data).\n\n\\*\\*744 comments in last week's thread. All-time high comments on 3/23/24 thread - 901 comments. All-time low comments on 4/19/24 thead - 514 comments.\n\n\\*\\*\\*\\*All-time high shows with 10+ comments on 5/31/24 thread - 15 shows. All-time low on 2/23/24 thread - 3 shows.\n\n\\*\\*\\*\\*\\*All-time high comments for a show in one week: Fallout (127) on 4/19/24 thread.",
            "just finished Slow Horses Season 1, Gary Oldman is brilliant as Jackson Lamb really looking forward to next seasons \n\nFollowing The Boys weekly, Episode 4 was diabolical \n\nAnd waiting for The Bear next week",
            "Presumed Innocent. A high level adult drama. Not just a thriller. It explores the tumultuousness of marriage. Jake G really is at his best playing Rusty a complex character. The dialogue is amazing. It gives you a peek into inner desires and weaknesses we all have. \n\nI went in expecting suspense, but came out loving how mature it was. I was completely pulled in by the characters. Ruth Negga is also terrific as his wife. \n\nOnly 1 episode in so far, but I'd give it an 8.5",
            "**Detroiters**  \nDecided to give this show a try after seeing it recommended here. Wow. I haven't laughed this much since Cunk on Earth. The characters are likeable and natural. And someone on the writing team must be from Michigan!\n\n**Blue Lights S2** \n\nAlmost done and very much enjoying it. Seems like all the actors have unique faces.\n\n**Colin From Accounts S2**\n\nNo drop in quality from S1.",
            "Ripely on Netflix is astoundingly good. I thought Shogun was going to put the cap on this year. Nope.\n\nIt’s maybe not everyone’s speed, but damn. Every single shot of this show is cooking.",
            "**House of the Dragon** - I found myself not remembering some things after watching the first episode, so I binged S1. I enjoyed it SO much more than my original watch. I think I still had severe GOT PTSD before.\n\n\n**The Boys** - I'm on the pro team for this season, very much enjoy still",
            "My family and I started Wings last night. It’s so fun! Can’t wait to keep watching. Very underrated",
            "I don't usually bring up anime on here but since a lot of you liked Scavengers Reign I thought some of you might also like some of my favorite strange unique anime. They're not at all similar, just some more one of a kind shows, that are probably not for everyone but hopefully those that are into it will love them. There's a lot of different types of anime out there and usually only the mainstream ones ever get mentioned, so a lot of people think anime is all just like demon slayer, attack on titan, naruto etc. Also these are only 12 episodes (20 minutes each).\n\n**Mononoke** (2007 series on Netflix) - really unique art style kind of like woodblock art, very colorful. It was recently remastered so I could finally watch it in good quality when it came to netflix. Definitely a classic. It's basically short stories about a guy who exorcises demons by discovering the circumstances of the curse. I really love the Japanese voice actor for the MC, if you're willing to watch subs (and I want dubs plenty so I'm not a sub snob) but it has a dub as well. It was based on a 3 episode arc from a show called Ayakashi Japanese Classic Horror (eps 9-11) although those episodes aren't on Netflix. And there's a new movie coming out next month for the 15th anniversary that looks [drop dead gorgeous.](https://youtu.be/0x-SryQQmRs)\n\n**Sonny Boy** (Hulu) - this is one of those trippy confusing shows with a non-linear timeline. It's about kids that end up in an alternate world/reality in a sort of Everything Everywhere All at Once sort of way. It has amazing cinematography, everything was very intentional and thought out. It's full of metaphors and symbolism that I'd go read people's thoughts after each episode to understand wtf just happened. It's really about the journey, not explaining why or how they're in this situation because that's not important, and thus there's a lot of time jumps. At the end of the day it's just a coming of age story about them experiencing these weird things as a metaphor for growing up. It's so unique and I was just so engrossed in it.\n\nI actually have quite a lot more great unique anime I could mention, but idk if anyone is even gonna care or read this lol.",
            "Dark Matter: after a slow start, it just gets better and better\n\nTrying: the most underrated series on TV. Season 4 is great. Just want more and more episodes \n\nHouse of Dragon season 2: first episode was ok"
        ]
    },
    "'Jeopardy!' Host Alex Trebek Immortalized With Forever Stamp by United States Postal Service": {
        "title": "'Jeopardy!' Host Alex Trebek Immortalized With Forever Stamp by United States Postal Service",
        "score": 3518,
        "url": "https://tvline.com/news/alex-trebek-jeopardy-stamp-how-to-buy-usps-1235270071/",
        "content": "",
        "num_comments": 133,
        "comments": [
            "Looks like they are not exactly putting Trebek on a stamp, if the picture in the linked article is accurate. Trebek is on the printed sheet, but the actual stamps are just a Jeopardy! clue.\n\nIt's actually a rule that a person needs to be deceased at least 10 years before they can be on a stamp (with the exception of Presidents). Not actually having Trebek on the stamp proper seems like a bit of an end-run of this rule.",
            "Glad to see the American postal service doing this even though he’s Canadian.",
            "Please it’s not a “forever stamp.\nIt’s “what is, A Forever Stamp”",
            "Great move. Alex Trebek is great.",
            "don't often see stories about the USPS that are actually good news.",
            "The USPS should do a young Alex/old Alex vote like they did when they released the Elvis Presley stamps. Do we want the older, grey, distinguished gentleman Alex, or the young big 'fro big 'stache Alex?",
            "Now we all get to “suck it Trebek”",
            "That’s cool but ain’t nobody forgetting about that legendary Canuck",
            "Do Dolly next",
            "AWSOME"
        ]
    },
    "A New Reality Show, 'Flat Earthers,' Will Pay Cash if Players Can Convince Experts the Earth Is Flat": {
        "title": "A New Reality Show, 'Flat Earthers,' Will Pay Cash if Players Can Convince Experts the Earth Is Flat",
        "score": 1921,
        "url": "https://www.indiewire.com/news/breaking-news/reality-series-flat-earthers-win-cash-prize-the-network-1235018506/",
        "content": "",
        "num_comments": 331,
        "comments": [
            ">...if players can convince experts the earth is flat.\n\nGood way to keep costs down.  Hell, I'll offer a trillion for such a \"proof\" - and my bank account will remain untouched.",
            "don't platform these morons we know the earth is triangle",
            "“Hey, so we have a real problem in society where people live in echo chambers and end up believing absolute nonsense, and recently all those lunatics have used their collective power to make the world and the media significantly shittier. We have some air time and can use it to combat this if we…”\n\n“LET’S TURN IT INTO A GAME SHOW!”",
            ">“Flat Earthers” is described as part docuseries, part competition show, and it will follow five families who each genuinely believe the Earth is flat. But rather than just document their exploits, **the families will each be given $50,000 worth of resources for research and will ultimately present their findings to a panel of scientists, theologians, and cartographers**. If they can convince a majority of the panelists that the Earth is in fact flat, they’ll be awarded a cash prize. The amount of the cash prize was not disclosed. It probably doesn’t even have to be decided upon.",
            "Welp, we’ve hit peak stupid.  If 3 Body Problem were a real scenario the aliens would be all, “Nope, we’re good. No real threat here.”",
            "> scientists, theologians, and cartographers\n\nThe idea that theologians would be considered experts here is pretty silly.",
            "Why are we even entertaining these nutjobs?",
            "this is a show that would air in a grand theft auto video game.\n\nWhy is it happening in real life?",
            "So the first game show with zero winners.",
            "Luckily Kyrie’s calendar just opened up!"
        ]
    },
    "'Hawaii Five-0' Star Taylor Wily Dead at 56": {
        "title": "'Hawaii Five-0' Star Taylor Wily Dead at 56",
        "score": 4205,
        "url": "https://www.tmz.com/2024/06/21/taylor-wily-hawaii-five-0-dead-dies-forgetting-sarah-marshall/?adid=social-tws",
        "content": "",
        "num_comments": 295,
        "comments": [
            "The very first competitor in the UFC, and despite not winning, he still was able to carve out a successful acting career.  RIP.",
            "Never forget his love of Subway Sandwiches:\n\nhttps://www.youtube.com/watch?v=oQYwFND7rHE",
            "Loved him in \"Forgetting Sarah Marshall\" and REALLY wanted him to play Strong Belwas on Game of Thrones.",
            "\"I'm not crying, I'm not a baby.\"\n\n\n\"Really, because you look like a giant baby.\" ",
            "One of my favorite actors on the Hawaii Five-O show. It was a joy to watch his character, Kamekona. When I think of shrimp, it will be due to him.  RIP.",
            "Those are sad tissues",
            "This guy was the recurring character on Hawaii 5-0 that you were always glad was there. His role in Forgetting Sarah Marshall was also very memorable. He will be missed.",
            "Rip to the shrimp king",
            "Re: his role on Five-0, the article mentions:\n\n>He reprised the role in the shows \"Macgyver\" and \"Magnum P.I.\"\n\nSeriously?! Hot damn, I'll be checking those out.",
            "raise a shaved ice to the king!"
        ]
    },
    "‘Beef’s Second Season Eyeing Oscar Isaac And Carey Mulligan To Star": {
        "title": "‘Beef’s Second Season Eyeing Oscar Isaac And Carey Mulligan To Star",
        "score": 1385,
        "url": "https://deadline.com/2024/06/beef-oscar-isaac-carey-mulligan-season-2-1235979489/",
        "content": "",
        "num_comments": 195,
        "comments": [
            "A Drive reunion!",
            "The parts were originally rumored for Jake Gyllenhaal and Anne Hathaway, but it didn’t end up happening.\n\nCailee Spaeny and Charles Melton are still attached to star.",
            "Even not being Asian, it was so interesting having a show centered around Asian Americans and their customs and struggles through that lens. It’s nice seeing a different culture and not just the usual, boring shit",
            "Moon Knight S2 is never gonna happen at this point",
            "The Asian representation in beef was so raw and real. It was the little shit , like the parts about having your parent’s business under your name , or paying off your parent’s house that made it so relatable. The realest part to me was when the guy built his parent’s house but it burned down cuz he did the electric wiring wrong. That’s some shit my cousin would do. So sad to see S2 not have more of this :(",
            "According to creator Lee Sung Jin, he has 3 seasons mapped out in his head. Best guess would be Yeun and Wong will return but they will join forces for a *beef* with Isaac and Mulligan.",
            "I love Carey mulligan. That’s all",
            "My dream casting for the third season will be Chris Rock and Will Smith",
            "Inside Llewyn Davis reunion!",
            "Season Two not being about Asian Americans is disappointing"
        ]
    }
}