{
    "The California apartment I just moved out of is charging me $785 to repaint a 1 bedroom apartment.": {
        "title": "The California apartment I just moved out of is charging me $785 to repaint a 1 bedroom apartment.",
        "score": 11,
        "url": "https://i.redd.it/3gpciwlt6e9d1.png",
        "content": "As you can see in the screenshot, the apartment management is charging me over $700 just for repainting. It's one of the older unrenovated apartments, but it's still a nice place. There was no paint damage aside from nail holes when I moved in and when I moved out. No pets. I lived in the apartment for about 1 year 8 months. I know in California, normal wear and tear is not chargeable to the tenant.\n\nI'm looking for any and all advice on how I can fight this. Any help and assistance is greatly appreciated and thank you in advance!",
        "num_comments": 22,
        "comments": [
            "I mean, what evidence do you have? Are they renovating the unit after you leave anyhow?\n\n*According to the HUD,* ***nail holes in the walls are considered normal wear and tear****. However, it's reasonable to classify large screw holes or multiple nail holes that cause damage to the paint or drywall as property damage.*\n\n***If the tenant has caused damage to the walls beyond normal wear and tear, the landlord may deduct the cost of repairs, including repainting, from the tenant's security deposit****. Examples of tenant-induced damage include excessive holes, large stains, or unauthorized painting.*",
            "Bs charge",
            "In Ontario we pay $100 cash.",
            "You should only be charged for any patches and second coat of paint if you used candles/ smoked/ etc.",
            "I would say repaint is only really necessary if you painted the walls or scratched them up a ton.  Think of it like if it was your place.  Would you repaint all the walls for a nail hole?  The judge will agree, but that means small claims.",
            "If they are actually entitled to repaint at your expense, then $785 is a pretty good deal.",
            "The dispo doesn’t say painting because of nail holes. It just says paint. \n\nCA has pretty consistent guidelines (not rules) on charging back to tenant on paint. 3 years to 5 years are acceptable life expectancy. \n\nYou were there about 1.5 years. If they had to repaint due to above wear and tear (marks on walls from furniture, kids coloring walls) then the prorate to repaint is what you owe. \n\nDid you get invoiced receipts? At the very least assuming you owe anything, it should be prorated. \n\nBut I can tell you labor costs are high.  Share the invoice. If you don’t have one, ask for it.",
            "I took a thorough video after I cleared and cleaned the apartment. I even sent them the video and explained that I know what my rights are, etc. I write professional emails every day so it was very professional. Clearly they didn't care.\n\nI almost guarantee they are renovating it.",
            "I've looked through my lease, and nowhere does it say they are.",
            "I knew the paint lifespan would be an issue since I didn't spend long there. I don't have an invoice but I'm definitely going to ask for one. Thanks for that information."
        ]
    },
    "Should I take my roommate off the lease and have my other friend move in with me? (She owes me almost $800 and we haven’t even fully moved in yet) ": {
        "title": "Should I take my roommate off the lease and have my other friend move in with me? (She owes me almost $800 and we haven’t even fully moved in yet) ",
        "score": 0,
        "url": "https://www.reddit.com/r/Tenant/comments/1dr52l8/should_i_take_my_roommate_off_the_lease_and_have/",
        "content": "(AR, US) \nThis is gonna be a bit lengthy just so I can explain everything properly. Main question is: should I wait it out and give her time to pay me back or just nip it in the bud before any more problems arise?\n\nI’ve been apartment searching for months, and have been looking for a roommate. One of my friends, who im not very close with, was also wanting to move out. We got accepted for a nice apartment, but I have paid for absolutely EVERYTHING. \n\nHer application fee, deposit, pro-rated rent, and im about to have to pay for electric and first month of rent by myself. Now, if I wanted to pay for everything, I would’ve moved in somewhere by myself. The reason she can’t pay is because she just started a new job and she gets paid every 2 weeks, and has to get car insurance + pay a phone bill + gas + food (me too bitch??)\n\nShe got her first check today, about $400. At first she offered to pay me $118 of this check out of the almost $800 she owes me!! But we realized the electric deposit would be $270 so she offered to just go ahead and pay her half of that. \n\nI have been trying to give her the benefit of the doubt but we aren’t even fully moved in yet and she owes me almost a grand, not including the furniture I’ve bought. She keeps telling me “just wait until I get settled into this job” “im good with my money don’t worry” “I promise I’ll pay you back” but she won’t be able to until July 27th, but by then next months rent will be due.\n\nI have another friend who I trust a lot more financially, and just in general who has offered to move in with me instead and pay me back for half of everything. Would i be an asshole if I took her off the lease and tried to get my friend added? \n\nI already signed a year lease with this girl, so im not sure what to do/ what I CAN do, all I know is she severely fucked me over already. The landlord is pretty nice and understanding, but im scared to bother him with this so early on. Also, what would I do about getting other girls name off the lease? Would that totally fuck her over?\n\nBefore anyone judges me for my poor choice in roommates, I know. But I was under the impression she was a lot more responsible financially and didn’t know id be paying for everything myself. \n",
        "num_comments": 1,
        "comments": [
            "Welcome to /r/Tenant where tenants share their problems and seek advice from others.\n\nIf you're posting a question, make sure a Country and State is in the title or beginning of your post. Preferably, in this format: [<COUNTRY CODE>-<STATE CODE>].\n\nExample:\n  [US-VA] Can you believe my landlord did this?!?\n\nOtherwise, tag your post with the flair \"Tenant Update\".\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Tenant) if you have any questions or concerns.*"
        ]
    },
    "I received a rental agreement and it includes me paying commission to the landlord’s real estate agent?": {
        "title": "I received a rental agreement and it includes me paying commission to the landlord’s real estate agent?",
        "score": 12,
        "url": "https://www.reddit.com/r/Tenant/comments/1dqofmk/i_received_a_rental_agreement_and_it_includes_me/",
        "content": "I didn't employ this agent, why should i give him $2000 and he is working for the landlord not me? I saw the listing, applied and viewed and accepted. $2000 for what?",
        "num_comments": 13,
        "comments": [
            "Was the rental listed with the words “ broker fees paid by tenant” ? It’s common in my area .",
            "Don’t sign it — strike that part and tell the landlord that you don’t agree to that term and ask for it to be taken out.\n\nThere are some landlords who just assume you are not going to read the lease — once you mention it, they either agree or bitch, but i doubt they will re list it if you withdraw. They wjll likely still be out the cash.",
            "$2000??? What kind of highway robbery is this? I would NOT pay that, and would back out of the whole deal, even if they offered to waive it.",
            "Do not sign that lease",
            "If the landlord has this in there I would walk away. who knows what other insane things this person is capable of",
            "Is it considered the first month’s rent or a separate broker fee in addition to the first month? As part of my lease agreement, I had to pay a real estate agent the first month’s rent rather than the landlord.",
            "Welcome to /r/Tenant where tenants share their problems and seek advice from others.\n\nIf you're posting a question, make sure a Country and State is in the title or beginning of your post. Preferably, in this format: [<COUNTRY CODE>-<STATE CODE>].\n\nExample:\n  [US-VA] Can you believe my landlord did this?!?\n\nOtherwise, tag your post with the flair \"Tenant Update\".\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Tenant) if you have any questions or concerns.*",
            "Did you receive the rental agreement from the landlord, or the real estate agent? If you say you are not going to pay it will you be telling this to the landlord or the real estate agent? Your outcome might be different depending on who you tell. Please let us know how this proceeds once you tell them you are not going to pay it.",
            "The LL had to pay $2,000 for his broker to find a tenant, and he is passing the cost off to the tenant.",
            "Brokers typically charge one month's rent."
        ]
    },
    "[USA-CA]  I am a subtenant - Original lease holder is not renewing lease - is the master tenant required to give us a 30 day moveout notice? What happens if they do not give us the moveout notice? (Lease ends in less than 30 days)": {
        "title": "[USA-CA]  I am a subtenant - Original lease holder is not renewing lease - is the master tenant required to give us a 30 day moveout notice? What happens if they do not give us the moveout notice? (Lease ends in less than 30 days)",
        "score": 0,
        "url": "https://www.reddit.com/r/Tenant/comments/1dr49h8/usaca_i_am_a_subtenant_original_lease_holder_is/",
        "content": "California (Santa Clara County). I am a subtenant - Original lease holder is not renewing lease (they moved out months ago) - is the master tenant or landlord required to give us a 30 day moveout notice? What happens if no one gives us a move out notice and the lease ends? I have tried to communicate with the landlord, but they have not signed a lease with us yet.\n\n* The original lease (and sublease agreement) ends in less than 30 days.\n* I do not know if the master tenant has provided the landlord with a notice that they are moving out (master tenant has not told me)\n* Master tenant has not given me a 30 day moveout notice\n* Original landlord has not given me a 30 day moveout notice\n\nI have asked the original landlord to sign a lease with me. The original landlord does not want to sign a new lease until the master tenant (my current landlord) has done a walk through and assessed damages caused by me at the property (there are no new damages at the property: the condition is the same as when I took over from the primary tenant).\n\nThe master tenant's lease includes a 'surrender' clause: does this mean that the lease will not automatically go month-to-month?\n\nTimeline: Original tenants have been leasing the house for 2+ years. I signed a sublease with the master tenant less than 1 year ago. Landlord approved the sublease.\n\nThe original lease (landlord and master tenant) includes these clauses (and more)\n\n* SURRENDER: On the last day of the term of this Lease, Tenant shall surrender the Premises to Landlord in good condition, broom clean, ordinary wear and tear and damage by fire and the elements excepted.\n* HOLDING OVER: If Tenant, with the Landford's consent, remains in possession of the Premises after expiration or termination of the term of this Lease, such possession by Tenant shall be deemed to be a tenancy from month-to-month at a rental in the amount of the last monthly rental plus all other charges payable hereunder, and upon all the provisions of this Lease applicable to such a month-to-month tenancy.\n\nSublease includes these clauses: (and more)\n\n* This Sublease is subordinate to and will be at all times subject to the Original Lease. The Original Lease is hereby incorporated by reference.\n* Term: This Sublease will be for a term beginning on X and ending on July X, 2024\n* Severability. If any provision of this Sublease is held invalid, illegal or unenforceable in whole or in part, the remaining provisions shall not be affected and shall continue to be valid, legal and enforceable as though the invalid, illegal or unenforceable part had not been included in this Sublease.\n* Governing Law. This Sublease and the rights and obligations of the Parties hereto shall be governed by and construed in accordance with the laws of the State of California, without regard to its conflicts of laws provisions.\n* Disputes. Any dispute arising from this Sublease shall be resolved through mediation. If the dispute cannot be resolved through mediation, then the dispute will be resolved through binding arbitration conducted in accordance with the rules of the American Arbitration Association.\n* Miscellaneous. Subtenants may discuss with landlord directly to renew the lease after 07/X/2024.",
        "num_comments": 0,
        "comments": []
    },
    "Lease Agreement starts July 1st & deposit is being collected July 1st? Landlord is charging 1.5x rent. Legal w/ regard to AB12? (CA)": {
        "title": "Lease Agreement starts July 1st & deposit is being collected July 1st? Landlord is charging 1.5x rent. Legal w/ regard to AB12? (CA)",
        "score": 1,
        "url": "https://www.reddit.com/r/Tenant/comments/1dr2wdo/lease_agreement_starts_july_1st_deposit_is_being/",
        "content": "My roommate and I are moving into a new place (hopefully) in Los Angeles, CA. We signed the lease agreement today. \n\nAs we are looking over the lease agreement it shows they are trying to charge a security deposit of 1.5x the first month’s rent.\n\n- I have verified they do not apply as an exemption to AB12\n\nThe lease agreement terms state that the lease starts on July 1st, 2024 and we are paying the security deposit on July 1st. Wouldn’t this mean that they aren’t able to charge more than one month’s rent because of AB12? \n\nHere’s more context on AB12:\n\n[Link 1](https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=202320240AB12)\n\n[Link 2](https://www.blakelawca.com/articles/deposits)\n\nAny advice or help regarding this is appreciated!! I posted earlier so sorry if this was a repeat but this was before I knew when we were paying the deposit/signed the lease.\n\nThanks in advance. ",
        "num_comments": 1,
        "comments": [
            "Welcome to /r/Tenant where tenants share their problems and seek advice from others.\n\nIf you're posting a question, make sure a Country and State is in the title or beginning of your post. Preferably, in this format: [<COUNTRY CODE>-<STATE CODE>].\n\nExample:\n  [US-VA] Can you believe my landlord did this?!?\n\nOtherwise, tag your post with the flair \"Tenant Update\".\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Tenant) if you have any questions or concerns.*"
        ]
    }
}