{
    "[USA-CA] Can my landlord require cash payments? ": {
        "title": "[USA-CA] Can my landlord require cash payments? ",
        "score": 4,
        "url": "https://www.reddit.com/r/Tenant/comments/1dr8u88/usaca_can_my_landlord_require_cash_payments/",
        "content": "For some context: my bf (21 m) and I (20 F) rent a room from our landlord in his house. We live in California. He has done a lot of illegal nonsense and caused a lot of problems but currently we can’t move out because of our personal circumstances. \n\nMy landlord requires that we pay him in cash, it is written in the lease that we have to pay in cash. He has openly admitted that he has us pay him in cash because he doesn’t report the income so that he doesn’t have to pay taxes. According to California law (based on my limited understanding) he cannot require that we pay him in cash, but he says that because it’s in the lease we have to. He always gives us written receipts after we pay him, but I just don’t feel comfortable paying him cash and would rather just transfer him the money or give him a check. Can he really demand we pay cash? ",
        "num_comments": 5,
        "comments": [
            "this is probably tax fraud you should report him",
            "Thank you for the link!!",
            "Yep, u/sillyhaha is correct, I'm adding the code it's from below: \n\n>According to California Civil Code Section 1947.3, **landlords in California are prohibited from demanding cash as the exclusive form of payment for rent or security deposit**.. Landlords must allow tenants to pay rent using at least one of these other options as well: check, cashier's check, or money order.",
            "OP, there is a law in CA requiring landlords toast rely on cash or other payment methods. There are exceptions, so please Google it. \n\nIt sounds like you are possibly renting a room. Is it monthly?  Do you have a lease?  Consider if this is worth making a fuss as you stated you aren’t in position to find a mother rental at the moment. \n\nI suggest making sure you continue to get and save your rental receipts. Save them somewhere outside of the house to be safest.",
            ">My landlord requires that we pay him in cash, it is written in the lease that we have to pay in cash. He has openly admitted that he has us pay him in cash because he doesn’t report the income so that he doesn’t have to pay taxes. According to California law (based on my limited understanding) he cannot require that we pay him in cash, but he says that because it’s in the lease we have to. He always gives us written receipts after we pay him, but I just don’t feel comfortable paying him cash and would rather just transfer him the money or give him a check. Can he really demand we pay cash? \n\nLLs in CA **CANNOT** require that you pay rent with cash *unless* you have bounced a check in the past 3 months.\n\nThe clause in the lease isn't legal. Thus, you cannot be required to pay in cash.\n\nAll LLs are required to be willing to accept a check, money order, or cashier’s check.\n\nhttps://www.courts.ca.gov/documents/California-Tenants-Guide.pdf\n\nSee page 38\n\nEdit: photocopy page 38 for your LL.\n\nYour LL cannot retaliate because you stop paying in cash."
        ]
    },
    "52 page lease included provisions for charging me for the home's property taxes at any point.": {
        "title": "52 page lease included provisions for charging me for the home's property taxes at any point.",
        "score": 3,
        "url": "https://i.redd.it/sy8tnpt9eh9d1.jpeg",
        "content": "[US-UT] I declined to sign this lease, because it would have been insane.",
        "num_comments": 0,
        "comments": []
    },
    "[USA-NY] Landlord accused us of running an illegal sublet": {
        "title": "[USA-NY] Landlord accused us of running an illegal sublet",
        "score": 0,
        "url": "https://www.reddit.com/r/Tenant/comments/1drcyht/usany_landlord_accused_us_of_running_an_illegal/",
        "content": "I live in Brooklyn. My building is owned by New Park Management. My boyfriend and I live together and are currently out of town on vacation. My boyfriend’s brother is watching our apartment and cats while we are away, for less than two weeks. He is not paying us and we are not paying him. Building manager found out and is accusing us of running an illegal sublet bc we did not notify him in advance of this. Is there any legal weight to this?\n\nThe building manager found out about this bc the brother left the keys inside the unit. The super refused to unlock the door, so I called the building manager and asked what to do. After accusing us of breaking the law, he suggested that they try to enter the unit via the fire escape via a neighbor’s window. He successfully did this per the advice of the building manager, and then later found the super trying to enter the unit on his own (after refusing to help before). I’m wondering if we could be in trouble and if we should seek legal counsel. Thanks",
        "num_comments": 1,
        "comments": [
            "Let them accuse you in an official manner, then respond in the same official manner.\n\nMind you (I don't know NY laws), but this might lead them to refuse to renew your lease, regardless who's right."
        ]
    },
    "The California apartment I just moved out of is charging me $785 to repaint a 1 bedroom apartment.": {
        "title": "The California apartment I just moved out of is charging me $785 to repaint a 1 bedroom apartment.",
        "score": 18,
        "url": "https://i.redd.it/3gpciwlt6e9d1.png",
        "content": "As you can see in the screenshot, the apartment management is charging me over $700 just for repainting. It's one of the older unrenovated apartments, but it's still a nice place. There was no paint damage aside from nail holes when I moved in and when I moved out. No pets. I lived in the apartment for about 1 year 8 months. I know in California, normal wear and tear is not chargeable to the tenant.\n\nI'm looking for any and all advice on how I can fight this. Any help and assistance is greatly appreciated and thank you in advance!",
        "num_comments": 23,
        "comments": [
            "In Ontario we pay $100 cash.",
            "You should only be charged for any patches and second coat of paint if you used candles/ smoked/ etc.",
            "I would say repaint is only really necessary if you painted the walls or scratched them up a ton.  Think of it like if it was your place.  Would you repaint all the walls for a nail hole?  The judge will agree, but that means small claims.",
            "That’s about the cost of repainting a room in California these days",
            "If they are actually entitled to repaint at your expense, then $785 is a pretty good deal.",
            "I took a thorough video after I cleared and cleaned the apartment. I even sent them the video and explained that I know what my rights are, etc. I write professional emails every day so it was very professional. Clearly they didn't care.\n\nI almost guarantee they are renovating it.",
            "I knew the paint lifespan would be an issue since I didn't spend long there. I don't have an invoice but I'm definitely going to ask for one. Thanks for that information.",
            "I've looked through my lease, and nowhere does it say they are.",
            "What he meant by \"actually entitled to repaint at your expense\" is that they are entitled to charging you for the repainting due to damages you caused.  \nSo, did you cause any damage that warrant a complete repainting?",
            "I just mean the cost is reasonable. I don't know if you should be charged or not, nor does my opinion really matter in that regard. However, personally it sounds like normal wear and tear but I have seen some pretty large holes made by nails or even thumb tacks."
        ]
    },
    "Landlord raised rent two weeks after move in US-RI": {
        "title": "Landlord raised rent two weeks after move in US-RI",
        "score": 0,
        "url": "https://www.reddit.com/r/Tenant/comments/1drcjei/landlord_raised_rent_two_weeks_after_move_in_usri/",
        "content": "My landlord remade the lease a couple weeks after my bf and I moved in (room for rent) and raised the rent for us. It’s our first month here, and we haven’t even gotten to the next pay period. Or end of the 6th month lease. He raised it because the other couple in the house are paying more, but he never told us to pay their same amount. They found out how much we’re paying, complained to him and now he raised our rent to make them feel better? He has all the tenants on the same piece of lease paper, so I assume they found out how much we are paying from that. Does this go against any laws, he never gave us notice on the raise of rent, he even told us he wasn’t going to. And when he came to bring new lease papers he even asked if I can sign for my bf. ",
        "num_comments": 2,
        "comments": [
            "Welcome to /r/Tenant where tenants share their problems and seek advice from others.\n\nIf you're posting a question, make sure a Country and State is in the title or beginning of your post. Preferably, in this format: [<COUNTRY CODE>-<STATE CODE>].\n\nExample:\n  [US-VA] Can you believe my landlord did this?!?\n\nOtherwise, tag your post with the flair \"Tenant Update\".\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Tenant) if you have any questions or concerns.*",
            "Do not sign anything. You are locked into your rate. Do NOT sign your boyfriend’s name either. What he is doing is against the law. \n\nWho cares what the other people think?  He is breaking federal fair housing laws for discrimination and by trying to change the lease. Technically you can move out with no repercussions. \n\nBring up federal fair housing and tell him that you refuse to sign a new lease. He is not allowed to disclose what you are paying to another renter. That is against the law. \n\nI work in PM and we would get sued if we told another renter what someone else is paying."
        ]
    }
}