{
    "Weekly Questions Thread Jun 17, 2024": {
        "title": "Weekly Questions Thread Jun 17, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/Terraria/comments/1dhvcom/weekly_questions_thread_jun_17_2024/",
        "content": "Welcome to the Weekly Questions Thread! Feel free to ask questions such as help with the game, build advice, issues with the game, or whatever Terraria related questions you have. If you are able to help out your fellow Terrarians, feel free to lend your assistance! Please remember to include any relevant information when asking your questions.\n\nRemember to check the sidebar for general links! Additional game information available in the [wiki](https://terraria.wiki.gg/wiki/Terraria_Wiki).",
        "num_comments": 74,
        "comments": [
            "Hello, for the farm on this video:\n\nhttps://www.youtube.com/watch?v=ai7VL_5KqJc\n\nAre those measures internal? Meaning is not counting the blocks on the outside? So 101 from top to bottom counting the bricks i use?\n\nDoes it even matter if i do it a bit bigger?",
            "https://preview.redd.it/rur9dwd2ee7d1.jpeg?width=1280&format=pjpg&auto=webp&s=b8d4b950bbd665a0eb33f3026f2a550e61d48a60\n\nMy minimap isn’t showing up and the toggle in the menu is set to On but it’s dulled out, how do I fix this?",
            "why is this not a snow biome? it has more than 300 snow blocks so im confused.  \n[https://imgur.com/a/hnxQWM7](https://imgur.com/a/hnxQWM7)",
            "Why undead miners are not spawning? They spawned 2-3 times when I was digging first tunnel and now none. Skeletons are spawning but not the miners. I have killed like 850 bats now..\n\nhttps://preview.redd.it/e6z2gyx7387d1.jpeg?width=1920&format=pjpg&auto=webp&s=0a6357f3511fe55da9c258d73b62a0adaa4bd79c",
            "So this is minor suggestion, but I thought of it because I'm currently doing an underground build. We currently have the planked wall which is wooden slats over stone, it'd be cool to have a couple of variations of the planked wall with wood over say dirt, or sandstone, etc.",
            "can anyone either help me  cleanse or tell me how to find this last 1% of hallow in my world, i just want it all gone",
            "Ayo, I want to post something and am not sure if here is appropriate, or if I should in r/TerrariaMemes. The post in question is that I found a random Empress of Light sound effect inside an unrelated netflix show, and want to know where to post.",
            "I'm trying to make a texture pack that changes what Moon Lord looks like, but I can't find what the ID is for its body and arms. I tried looking on the wiki, but the closest thing I could find is the ID for core. Does anyone know or know where I could find out?",
            "Is the worm scarf worth it post Mech bosses? I read that it applies after buffs and defense, so now that im starting to stack both and have \"high\" defense numbers im wondering if i should change it.\n\nIm playing melee and while i avoid damage as much as i can in boss fights, i do get hit quite often.",
            "How do I open the equip menu in the mobile(phone) version? I have armor and extras equipped but I bought a vanity item from a traveling merchant that I want to wear over them. I have forgotten how to open it before and It may have changed. I can double tap to equip the vanity item but It takes away a non-vanity item because it's not placed in a vanity slot. How do I open the menu that shows me what I have equipped and my empty slots?"
        ]
    },
    "Terraria State of the Game - May 2024": {
        "title": "Terraria State of the Game - May 2024",
        "score": 49,
        "url": "https://forums.terraria.org/index.php?threads/terraria-state-of-the-game-may-2024.135770/",
        "content": "",
        "num_comments": 16,
        "comments": [
            "Rats, we're Rats, we're The Rats",
            "From dinosaurs,to bats and no Rats!",
            "Crazy? I was crazy once.",
            "Ummm are you guys going to make mages and Summoner Any better or? Cause i mean we can clearly see that melee and ranger are the most played by far and well the best to pay.. Just wanted to know",
            "RATS",
            "I AM THE GIANT RAT THAT MAKES ALL OF DA RULES",
            "Celebrate another one, a Birthday bash",
            "They locked me in a room.",
            "summoner is getting more whips so that'll probably help a lot\n\n\nMage just needs it's early game buffed, Gem staves are just weaker than their equivalent bows. Otherwise it's fine.",
            "Mage is well balanced as it is, just a little lacking in the very early game (when you aren't necessarily intended to be a single class anyway). Summoner is getting more whips which will be nice too. Consider that the four classes don't need to be equal in terms of skill. Mage is a good stepping off point for intermediate players who have gotten used to playing the easier classes of Melee and Ranger, requiring you to dodge more and play smarter but with the benefit of many healing weapon options, attack variety, and many more homing weapons. Summoner is better suited to multiplayer when other players can take the heat off of you, and gives you the advantage of getting to focus almost entirely on dodging and running at the cost of attacks hurting more."
        ]
    },
    "I got ripped off, now i'm one dirt block short on building a house because i got this \"\"pet\"\" instead": {
        "title": "I got ripped off, now i'm one dirt block short on building a house because i got this \"\"pet\"\" instead",
        "score": 2952,
        "url": "https://i.redd.it/vcj2lrdklz7d1.png",
        "content": "",
        "num_comments": 59,
        "comments": [
            "A similar thing happened to me as well, all I wanted was to farm essences for hallowed mimics, but everything those stupid elementals dropped was some stupid pink rods",
            "Reminds me of the time I was building an overworld surface mimic farm. A bunch slimes dropped this \"staff\" that did like 2 damage. I threw them in the trash. Smh my head",
            "When you realize the Dirtiest block is just 120% the dirt of a normal dirt block.",
            "🗿",
            "yeah same. looks like ass so I threw it in the trash",
            "Lol. Terraria luck amr?",
            "[removed]",
            "Reminds me of Sip’s dirt Factory from the yogscast, like dirt guy",
            "Sucks",
            "Give to me and I’ll trade a dirt block for it"
        ]
    },
    "The Vortex armor.": {
        "title": "The Vortex armor.",
        "score": 500,
        "url": "https://i.redd.it/bzfmg4kp318d1.png",
        "content": "Artwork by me.",
        "num_comments": 38,
        "comments": [
            "Autoturret summon goes hard",
            "War machine armor goes hard",
            "Honestly kinda reminds me of V1 ULTRAKILL.",
            "MACHINE",
            "The legs remind me of Optimus Prime.",
            "IS THAT V1 ULTRAKILL IN TERRARIA??!??????",
            "ultrakill?",
            "he looks like he visits hell to get fresh blood in it",
            "The little detail of the bullet casings being green is really nice.",
            "THIS LOOKS SO AWESOMEEEEEEEEEEEEEEEEEEEEEEEEEE"
        ]
    },
    "Day 0/30 - Top comment is added to the guide’s house ": {
        "title": "Day 0/30 - Top comment is added to the guide’s house ",
        "score": 1104,
        "url": "https://i.redd.it/qw9s6kjb7z7d1.jpeg",
        "content": "",
        "num_comments": 111,
        "comments": [
            "https://preview.redd.it/88ofmhjlqz7d1.png?width=800&format=png&auto=webp&s=929c878d03bec012dc47182383f1ae6cce3bdb80\n\nWe must do this. Cherry Blossom biome from Infernum.\n\nEdit: Hi there.\n\nEdit 2: How the hell did this get the top comment?",
            "put thhe cherrpy blossom from infurnuym\n\nhttps://preview.redd.it/ywb1qh2bbz7d1.jpeg?width=1080&format=pjpg&auto=webp&s=95d17818027ef15d004f194674eb5410abdcb1cd",
            "At this point just succumb to the blossom rot make the cherry blossom biome",
            "https://preview.redd.it/w1mobuyzd18d1.png?width=800&format=pjpg&auto=webp&s=a42c77ef4e907d3b7d209b19583110084b81abad",
            "Ebonwood Bathtub painted brown",
            "Terra toilet",
            "Voodoo doll suspended over lava",
            "Moon lord relic, have fun",
            "Any queer flag so the next 30 days are filled with incel cope.",
            "Terra Toilet"
        ]
    }
}