{
    "Kind reminder that political topics are not allowed here (Rule 4)": {
        "title": "Kind reminder that political topics are not allowed here (Rule 4)",
        "score": 144,
        "url": "https://www.reddit.com/r/TerrifyingAsFuck/comments/1afrtig/kind_reminder_that_political_topics_are_not/",
        "content": "Hi everyone, we would like remind everyone that this is not a political subreddit. r/TerrifyingAsFuck is not a place to discuss or argue about politics, spread your political views, blame or praise political parties or individual politicians, etc.\n\nWe understand that the US presidential elections are coming and that several other countries also have their elections this year. We also understand that some of you find actions or words of certain politicians or parties terrifying. However, this subreddit is not the place to talk about these topics. Please focus on terrifying people (not politicians), animals, natural disasters, true crimes, historical moments, military conflicts, etc. instead.\n\nFor political discussions, we recommend to visit some of the many subreddits dedicated to politics (like r/PoliticalDebate) or to individual countries (check their rules to see whether they allow political topics).\n\nThank you for understanding.",
        "num_comments": 0,
        "comments": []
    },
    "Hope he's OK...": {
        "title": "Hope he's OK...",
        "score": 1272,
        "url": "https://v.redd.it/hixyqi6v538d1",
        "content": "",
        "num_comments": 106,
        "comments": [
            "He's been discharged from hospital. Docs says he is good just dehydrated apparently. \n\n[Source](https://www.google.com/amp/s/www.dailymail.co.uk/sport/boxing/article-13556231/amp/Tramaine-Williams-discharged-hospital-tells-fans-good-boxer-suffered-seizure-midway-TCL-fight-v-Ryan-Allen.html)",
            "Yeah dehydration is so much scarier than most people realise. I’ve gone from completely fine to slumped on a chair unable to move for a few minutes before. \nSelf inflicted! Cycling in stupidly hot temperatures and not increasing my fluid intake. I lost 6kg of weight in 2 hours! All sweat.",
            "Hats off to the opponent who was genuinely concerned. A lot would have turned and threw their hands up in victory.",
            "good sportsmanship from the opponent",
            "He had a seizure, Doctors believe its cause of TCL",
            "Props to the other guy, he looked really concerned for him.",
            "😧. I'm old enough to remember what I consider both the greatest and the saddest boxing match of all time. \nRAY Boom Boom Mancini vs South Korean boxer Kim Duk-koo (1955-1982). One of those fights where neither gave an inch and refuse to lose. Breaks my heart right now thinking about it.",
            "Oh poor man😢",
            "Kudos to Allen for his sportsmanship.",
            "Absolute hats off to his opponent. So many fighters would have tagged him when he stopped defending himself. He obviously saw there was something very wrong and didn’t take the shot. \n\nWell played sah, well played. 🫡"
        ]
    },
    "Sometimes helmets can't protect you, drive slowl be careful": {
        "title": "Sometimes helmets can't protect you, drive slowl be careful",
        "score": 473,
        "url": "https://v.redd.it/oct1zcjmh38d1",
        "content": "",
        "num_comments": 70,
        "comments": [
            "Dayum is that brains",
            "Am I looking at brain",
            "I was like wow that's not a legit helmet. It's supposed to use that foam like in football helmets that hardens into like a brick to protect under the plastic that is usually double flexible to allow for impact aborbson..... oh that's a lot of brain matter 😳",
            "This is also why to make sure your helmet is certified by the right authorities",
            "I hope he's ok",
            "I prefer not to drive bikes when it's raining outside",
            "Is he ok?",
            "Cheapy helmet",
            "Is that brain matter?🤮",
            "If the rider is alive, helmet saved his life."
        ]
    },
    "Guy tries to touch telephone pole with rod.": {
        "title": "Guy tries to touch telephone pole with rod.",
        "score": 673,
        "url": "https://v.redd.it/eifblfaaf18d1",
        "content": "\n\n",
        "num_comments": 65,
        "comments": [
            "It's a lineman doing lineman things.",
            "That pole ain't got nothing to do with telephones",
            "This is an employee of the electric company closing a popped switch. Obviously there is a short circuit somewhere along the line that pulled too much amperage and blew the transformer. Happens all the time.",
            "I think he succeeded",
            "Not a telephone pole. Lol",
            "Maybe a lineman can chime in, but I this has something to do with having too much load on the distribution side. \n\nThis is dangerous shit. Stuff like this is the reason my electrician apprenticeship was only three years and I said \"fuck this!\" We did commercial hot work all the time, and I watched a journeyman blow a hole in his hand with 277 by grabbing a bx he thought was dead. I watched another journeyman burn his face off in a 480 panel because he was adjusting wires, and one got caught on a threaded screw coming through the back of the panel.\n\nThe last straw for me was working in a drop ceiling, and a hot stranded wire fell out of a red wire nut and hit an ac duct, and copper splattered on my face and burned into my glasses. I peaced out after that.\n\nEDIT: Gee, thanks for the enlightening comments about working unsafe. Also, it shows you know nothing about the industry. There are plenty of reasons you can't just shut everything down. You can't just shut down the lighting in a 24hr plant to change out light fixtures. That's just one example, so get off your stupid soap box. I was simply discussing my experience and expressing how dangerous it can be.\n\nAnd to the Europeans that made it illegal, that's great, but this is in the US.",
            "So what happed to the guy?",
            "OP pulling stuff out of his ass",
            "What do you mean \"try\"?",
            "Was the oil in the transformer supposed to blow?\nI recently learned those things are submerged in oil."
        ]
    },
    "student pilot enters a spin as a trainings": {
        "title": "student pilot enters a spin as a trainings",
        "score": 352,
        "url": "https://v.redd.it/xpip61gqzy7d1",
        "content": "",
        "num_comments": 25,
        "comments": [
            "Somebody had to figure this out. Geez. How Many times did that take.",
            "Hands on the dash was an incredibly good way to teach the importance of rudder to the student.  Bravo.  CFI kept a good calm demeanor and instructed the entire time.  Quality video and experience (from a major airline captain and CFI)",
            "What would be the equivalent of this in other vehicles? Car, Boat, ??",
            "Fucking Hell indeed.",
            "I would simply shit my pants.",
            "![gif](giphy|7wk6RQYXDDytXalsL4)",
            "*It's PARE.*",
            "my sympathetic autonomic nervous system is activated just by watching this. Absolutely crazy how cool, calm and collected they are!! Mad respect.",
            "this reminded me, I have a video of me doing a spin somewhere. for the life of me i cant find it.",
            "This also works in warthunder!\n\nTo my fellow wt players, use it... It works."
        ]
    }
}