{
    "RETURN TO OUR ROOTS": {
        "title": "RETURN TO OUR ROOTS",
        "score": 1635,
        "url": "https://www.reddit.com/r/terriblefacebookmemes/comments/126zu46/return_to_our_roots/",
        "content": "Hello everyone,\n\n&#x200B;\n\nOriginally this subreddit was about \\*Boomer memes\\*. It was about memes so painfully unfunny and out of touch that you would choke on a minion if you had to endure one more cry-laughing emoji on a sad post.\n\nhttps://preview.redd.it/db2c8xfg2yqa1.jpg?width=680&format=pjpg&auto=webp&s=d43ee1e3dc8d6a5e567363048eb9a13650e92344\n\n&#x200B;\n\nOver time we have slowly mutated into some kind of unholy abomination where today most of the posts made to this subreddit are just outright racism or transphobia. \n\n&#x200B;\n\nAlright, we said, ok, but the point is to make fun of sad little memes that these people think are so profoundly common-sensical so our mandate is preserved. This place exists to showcase bad memes for purpose of education and entertainment. \n\n&#x200B;\n\nUnfortunately we spend an inordinate amount of time banning people who \\*agree with the racism\\*.  \"This is based!\" they will gurgle, \"This isn't bad at all\" we hear fartily from the wings. \"But this is just true. It's not fair! This racism is just true!\" cries a third. \n\n&#x200B;\n\nThis will not do. \n\n&#x200B;\n\nSomewhere in Febuary a smarter than average subscriber in modmail alerted us to the fact that reddit has a terms of service and today we alert you to that too.\n\n&#x200B;\n\n[These are the rules we all agreed to follow when we made an account](https://www.redditinc.com/policies/user-agreement-september-12-2021)\n\n&#x200B;\n\nSo, apparently, subreddits can get banned and users can get sitewide suspended for the shit we feature here. Even if it is meant to laugh at. Even if we explicitly say that agreeing with the bad memes is forbidden.\n\n&#x200B;\n\nFor some bizarre, unfathomable reason we do actually like this place. We want to keep it. We want to see it prosper.\n\n&#x200B;\n\nSo we need to go back to our roots.\n\nhttps://preview.redd.it/nruh6xc52yqa1.jpg?width=1590&format=pjpg&auto=webp&s=98ac4e3ef9ed6d32929173daa85b0cd3944565aa\n\n&#x200B;\n\nNo more racism. No more transphobia. No more homophobia. No more making fun of my mom. \n\n&#x200B;\n\nFrom now on all posts have to follow the site-wide rules. \n\n&#x200B;\n\nFrom now on we will be about Boomer memes again. \n\n&#x200B;\n\nThank you everyone and happy minioning!\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/efzmd36x1yqa1.png?width=300&format=png&auto=webp&s=a0f87b658a9ef749d1550956537f3b20775cc6b7",
        "num_comments": 210,
        "comments": [
            "Well i'm sure we will have very calm discussion about it",
            "Honestly I’m glad, I was getting very tired of seeing that stuff on my feed. There’s still r/forwardsfromklandma for racist/bigoted boomer memes anyway.",
            "Hoenstly the. Worst part is it’s getting harder and harder to find the cliassic boomer humour as the new hatred is shifting away from the clsssic stuff  and more towards politics",
            "See, I totally understand all of that and agree. Though cause you mention it near the end, I kinda wanna make fun of your mom now. Probably just the weed talking though.\n\nOn a serious note thank you, it's kind of getting to be too much to see the constant transphobia lately, especially when we have to see it so many other places already",
            "As long as it provides material for r/ComedyNecrophilia",
            "The problem is that most boomer humor is bigoted. \n \n We will have way less content and way more reposts",
            "Unfortunately most boomers almost by definition have been taken in by the Trump cult that’s why there’s more racist homophobic and trans phobic memes nowadays, because those same boomers are posting them",
            "Dang okay... This sub might lose a lot but ig there's nothing to do about it:/",
            "Omg thanks finally. Sick of these political posts it’s hella redundant",
            "This sub will now share the fate of /r/boomerhumour"
        ]
    },
    "Oh Grandma, You've Never Read or Watched Batman Have You?": {
        "title": "Oh Grandma, You've Never Read or Watched Batman Have You?",
        "score": 1649,
        "url": "https://i.redd.it/e0dcpb2sgf9d1.jpeg",
        "content": "",
        "num_comments": 89,
        "comments": [
            "Maybe this meme is actually FROM the DC universe and the person who made it doesn’t actually know Batman is Bruce Wayne",
            "I love the part where batman has a mom.... really a character defining moment",
            "Tbh I kinda like this one",
            "Holy shit!? Well. I mean. I don't actually think he would mind this in the slightest. Hell. He probably dreams about stuff like this. This is depressing.",
            "This one is funny. I don't see how it's terrible.\n\nI mean, yeah...Batman's parents are dead, and so are his grandparents, I'm sure, but, y'know...Death is just a social construct anyway, right?",
            "Nah, I like this one. It’s stupid but harmless.",
            "I’m sorry but this is funny",
            "This one is genuinely funny though",
            "Just because something is in this art style doesn't make it a bad meme",
            "It's obviously a reference to  “To Kill a Legend” from Detective Comics 500 where Batman ended up in the past of an alternate world, and managed to save the Waynes from being killed. The ending of the story revealed that the Bruce Wayne of that world was inspired by the hero who saved his parents to become a hero himself, and that world still got a Batman anyway. This is clearly a real fan."
        ]
    },
    "Being an American is embarrassing af sometimes 😣": {
        "title": "Being an American is embarrassing af sometimes 😣",
        "score": 590,
        "url": "https://i.redd.it/222t5ctnfg9d1.jpeg",
        "content": "",
        "num_comments": 79,
        "comments": [
            "Turning Point kinda feels like a cheat for this sub. Their entire point is trying to piss people off.",
            "You won't get Trump celebrating sacrifice. He thinks captured or killed forces are losers.. it's on record.",
            "Cool, May is Military Appreciation Month... Why didn't these people just celebrate then?\n\nThey're like toddlers who say that they aren't hungry, but then cry when you're having a snack and they aren't.",
            "I guess America has no time time for Pride month. Far too busy giving troops a pat on the back, and then abandoning them when they're no longer useful as a political prop.",
            "Both. I choose both.\n\n![gif](giphy|JWTRODzYFf3pe|downsized)",
            "But America celebrates the delusion of Christianity all the time and wants to push this delusion into schools.",
            "It's so sad we can't possibly celebrate both, and we don't have multiple holidays and celebrations for veterans in this country, and it's all because of the gays.",
            "You don’t have to like stop giving a discount on Veterans Day because pride also exists. What’s wrong with people?",
            "Even worse considering that being LGBTQ isn't a choice but enlisting absolutely is",
            "Using the troops as status quo fodder."
        ]
    },
    "Some Say It’s Not Like That.": {
        "title": "Some Say It’s Not Like That.",
        "score": 5093,
        "url": "https://i.redd.it/6eiim5rv0d9d1.jpeg",
        "content": "",
        "num_comments": 297,
        "comments": [
            "if a straight guy like anal why doesnt he just go have it with other guys? they have buttholes too",
            "Plenty like dick, just not attached to men.",
            "Yeah, I don't think the penis is the actual problem for many of them.",
            "To be fair, lots of dicks just don't look that great.  ",
            "Is OOP one of those gross weirdos who claim that lesbians are lesbian because they haven't gotten with the right man? That's the vibes I'm getting from this meme.",
            "Men really just don't understand when a woman doesn't need a dick, do they? Unless a dick is somehow involved, they don't see it as real sex.",
            "But also like, fake dicks and real dicks are totally different things?? With real dicks you have to deal with actual flesh which comes (no pun intended) with a certain smell, taste, feel, etc. not to mention cum and precum, risk of pregnancy, and even getting and maintaining an erection. Tbh real dicks can be  intimidating and off putting to some!",
            "The issue is not the blade, but who wields the blade.",
            "Well, sometimes your veevee itches for some action and you just want to rub one out without all the fuzz of the actual penetrative sex.",
            "It’s not about the dick, it’s about the man attached to it"
        ]
    },
    "Titty-fuck the lasagna": {
        "title": "Titty-fuck the lasagna",
        "score": 257,
        "url": "https://i.redd.it/tmf81tisog9d1.jpeg",
        "content": "",
        "num_comments": 56,
        "comments": [
            "This is pretty funny actually",
            "Is it that usual for people to post actual funny things here 😂?",
            "I swear if I start seeing Biden copium on here....\n\nNeither Trump or Biden is fit for presidency. Trump's a lying narcissistic criminal who should be in prison, and Biden is a rambling dementia patient who would probably be in a coffin before the end of his next term anyway. I feel bad they continue to dress him up for the role and put him on a pedestal when he struggles to speak clearly and coherently or even walk properly sometimes. Let the guy retire and put someone younger and livelier up there. Give us someone that doesn't divide, stir up conflict, and lie every other sentence please for fuck's sake. American politics is such a joke.",
            "Fuck Biden. His senile ass should not have been chosen over so many capable candidates. Saying that at least he surrounds him with sensible people while Trump is a crazy person who surrounds himself with crazy people",
            "The fuck is that title?",
            "I’ve made the mistake of underestimating the power and latency of edibles. So, this isn’t terrible.",
            "Vote for the administration, not the president. That's what you have to do when they're both shifty candidates. But at the very least, Biden doesn't say immigrants are murderers and rapists set out to destroy America",
            "Sometimes a person with dementia will behave in ways that are difficult to understand in the late afternoon or early evening. This is known as 'Sundowning'.",
            "Nah the only thing terrible about this meme was the debate 😭",
            "Noooo they made fun of an establishment politician! It must be a terrible facebook meme because the mainstream media told me so!"
        ]
    }
}