{
    "Frequently asked questions": {
        "title": "Frequently asked questions",
        "score": 51,
        "url": "https://www.reddit.com/r/tesco/comments/105lx0w/frequently_asked_questions/",
        "content": "We get a lot of common questions asked here, and there are various misconceptions going around as to things like availability, holiday pay, premiums etc. Should we create a FAQ thread to cover all of these & help newcomers?",
        "num_comments": 34,
        "comments": [
            "There should be a sticky at least, pay, premiums, holiday booking etc, I don't know if there are even active moderators here ?",
            "Please please please can the pay dates be posted in the faq same questions every month about when next pay date is",
            "The majority of the information people are asking for is on the system. If there's going to be an FAQ then really there should be links to the places where people can find the relevant policy and read it for themselves. This is especially important as policies do change.\n\nThe amount of misinformation and blatant lies being posted, sometimes by people claiming to be managers or shift leaders, on this sub is ridiculous.",
            "Hi one of the mods here. This post has been pinned to the top of the sub Reddit and I’ve tried to pin the comment that seems to be the starting point but not sure if this was successful.",
            "Looks like this has already been pinned! Please keep in mind, all information can be found on colleague help, however all these faqs are great. Hopefully any new questions can be added here",
            "Question: what should I wear on my first day?\nQuestion: how do I resign?\nQuestion: what is my notice period?",
            "I was responsible for something gross and unbelievable. Will I be fired?",
            "Do you have to work for Tesco for 12 months before you get your first week sick pay? I understand the first 3 days are unpaid. Just want to know if you start with 1 week or after 12 months of service. Thanks",
            "How long do you have to be with the company to transfer to another store? I’ve only been with the company for around a month and the travel is becoming an issue. I have to pay to park somewhere as I work in an area where there’s limited parking and most areas are expensive, I have to leave an hour before my shifts start so that I can park my car and get the bus into town(the area where I work can be like London on most days so a ton of traffic) and I end up having to sit in the staff room for half an hour before my shift starts. Where I live there are 2 big Tesco’s close to me so I could either walk there or drive and I wouldn’t have to pay for parking as there’s parking on sight. I don’t want the company thinking I’m just “jumping ship” because I’ve worked there for such a short time but that money is starting to add up. I have to pay for parking, train fairs, petrol, buses.",
            "How were you offered an interview? I’m worried about being able to fit in around the times that I’m working at the moment."
        ]
    },
    "User Flair": {
        "title": "User Flair",
        "score": 23,
        "url": "https://www.reddit.com/r/tesco/comments/18bp6m6/user_flair/",
        "content": "Hi guys. We hit 20,000 members today and as a result I’ve added the ability for user flairs. If you are wanting a flair added to your username comment below with what your role is in the company. Let me know if I’ve missed anything. I’m also having an emoji to differentiate from the moderators as our flairs are also just our roles so suggest an emoji if it’s not on the below list. \n\nAt the moment I’ve got:\n📦 Depot/ Fulfilment centre, \n📈 Tesco Bank, \n 🛒 Trolley, \n🥛 Dairy, \n 🥕 Produce, \n🍾 BWS, \n🥫 Dry grocery, \n📢 CSD, \n🗄️ Admin, \n👕 F&F, \n🧾 Checkouts, \n🖥️ Dot-Com Picker, \n🚚 Dot Com Driver, \n📱 Tesco Mobile, \n 🗂️ Manager, \n🧁 Bakery, \n🚛 HGV Driver, \n⛽️ PFS, \n💄 Health and Beauty, \n🏷️ stock control,\n🚛🚪 Backdoor,\n❄️ Frozen,\n🏢 Head office,\n🏠 Home,\n💨Express,\n👨‍💼Shift leader, \n🧸Non food/ General Merchandise,\n🍖Meat and Poultry,\n🚨Security,\n🗣️ USDAW Rep\n☕️ Cafe,\n⚒️ Maintenance, \n📥 Dot Com Dispatcher",
        "num_comments": 312,
        "comments": [
            "Could I have 💨 Express and 👨‍💼Shift Leader please, added emoji that seemed appropriate cause there wasn’t any 😁",
            "How about one for ex-staff?",
            "Iam a picker and a driver",
            "Insane that this has reached 20k people. Can you put mine as CSD?",
            "What about us at the cafe please?",
            "Could I get CSD and Express? I work at two stores 😭",
            "Does warehouse mean dc/depot workers or store warehouse/backroom workers? What about hgv drivers?",
            "Could I make a suggestion of adding a Security one?",
            "CSD/Checkouts/PFS for me please 😊",
            "Can I have Checkouts please! Thanks."
        ]
    },
    "banter ": {
        "title": "banter ",
        "score": 3,
        "url": "https://i.redd.it/1xbq3x4kti9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Lol as a day work who does early mornings too I can confirm",
            "🤣",
            "HO: 🤣👉"
        ]
    },
    "Point of been security here?": {
        "title": "Point of been security here?",
        "score": 61,
        "url": "https://www.reddit.com/r/tesco/comments/1dqv70r/point_of_been_security_here/",
        "content": "Saw a male de tagging 5 items  (which he got away with) I radio duty when I see the first item getting stuffed down his pants no answer. So I try to stop the male. Didn’t touch or shout just asked for the items back whilst semi kinda blocking his way but still been able to walk n leave. Because of this I been let go for been too “aggressive”. \n\n\nEdit:\nLet go from that specific store the actual subcontractor I’m still employed too I just had full time at that store now I’m on a zero hour contract until they find me another store.",
        "num_comments": 59,
        "comments": [
            "I mean, the way you've gone about it is entirely right, and in line with the sia licencing so you're not in the wrong. You've gone for an approach and deter method so I don't see what's wrong. Just corporations that don't see it that way cos they're scared of getting being liable if these scrotes get a slap.\n\nJust in future though, be wary of who and how you approach mate. A security guy in sainsbos a few years ago ended up on involuntary manslaughter charges for following a guy who nicked spirits, fell running away and died cos the bottles in his jacket smashed and killed him.   Not the guards fault but he ended up having to wait ages for a trial and shit,pretty sure it got thrown out but you don't need that shit in your life. TSS or whoever your boss is won't back you in that case, and neither would tesco. So fuck them.",
            "why would u risk your life for tesco ? They have insurance, they will get their money back, you wont get your life back. The first thing they teach you in training is just report theft, never try to stop it. \n\nIf he had stabbed you, tesco would have been in great legal trouble and a huge PR shit storm. I am not saying it's the right thing but it's what the policy is which you should have adhered to. In a perfect world we all employees would love to hold down the thief and give a beating or two but we dont live in a perfect world",
            "A few months ago, as I exited Morrison's, I observed the security man on the floor wrestling with a thief.",
            "That's insane. Me and my manager chased a guy 200 meters down the road before and apprehended him after he was stealing and done a runner. We both got a few sneaky digs in before gardai arrived. ",
            "My security  always love throwing up",
            "Also a security guard at Tesco, only so much we can do. Done everything that you were told to do, radioed for assistance and never came.",
            "Minimum wage, minimum effort, Tesco don't give a shiny shite about you, so why risk your safety for them.",
            "There was a clip with a guy who grabbed a shoplifter and flipped him on the floor when he tried to run. He got away with it for \"protecting the brand while the assigned guard was on break\"",
            "“Both got a few digs in”",
            "Now that the police aren't interested it basically comes down to there's nothing anyone can do about shoplifting. As far as I can see security guards are just scarecrows (no offence).\n\nI watched a guy in B&M stuffing a tote bag full with stuff of the shelves and walking out past the cashiers. I told them what I saw but they understandably weren't interested."
        ]
    },
    "What do you guys do when you've done all you're supposed to?": {
        "title": "What do you guys do when you've done all you're supposed to?",
        "score": 26,
        "url": "https://www.reddit.com/r/tesco/comments/1dqxewm/what_do_you_guys_do_when_youve_done_all_youre/",
        "content": "I work 1600-2015 on a Friday night on fresh, and it's miserable. I've asked my manager if I could work a different shift and the answer was a resounding no. Guess nobody wants to work Friday nights. \n\nMy issue is that my store is pretty small for a big tesco, and there isn't actually that much to do on my department after about 6 o'clock. I get in. I get in at 4, I work the backstock (which is already pretty slim, because the people on before me have done most of it.) I will also refill the milk, which takes me to just about 6 o'clock, to do the evening reductions. After that, I don't really have anything else to do. There's not really any point dragging the backstock cages out again, because I'll usually only get one or two items on the shelf, if that. \n\nToday I had everything finished by 6:25, which is pretty standard. I went over all the cages again and then faced up, but there's a woman on after me who's supposed to face up, and she complains when I do her job. \n\nI'm a person who likes to be doing things. I'll happily work a 12 hour shift as long as there's 12 hours of work to do, but when I'm idle it's just so exhausting. \n\nWhat do you guys do when you're basically finished, but you've got 2 hours of your shift to fill?",
        "num_comments": 31,
        "comments": [
            "Rumble (de carding) trust me the night team will love you for it",
            "I'm normally quite busy on BWS, but occasionally I get a shift where the delivery is super light or most stuff has been worked by the time I come in. I usually just wander round and ask my colleagues if they'd like a hand - there's usually someone else who's got a bit more on their plate than they can manage alone, so I just pitch in with them for the rest of the shift.",
            "Ask your SL if there's anyone who might need help. If that fails, cleaning and OSI.\n\nIf your backstock is 99% worked, what's the person after you doing? Do you get evening deliveries for night shifts or something?",
            "Hide.  But I’d do that the moment I clocked in.",
            "Stand in the middle of the busiest isle having a chat with other members of staff. Customers love it.",
            "I just go up to my manager and ask them what to do.",
            "As someone In express I'm surprised you can run out of things to do",
            "Tell the duty manager you’re done on fresh and they’ll move you to grocery or produce, and maybe let the person on off till activity know to just come and grab you 🤷‍♂️ I guarantee the duty manager will appreciate it",
            "I used to have this issue when I did night shifts at Sainsbury’s but it was the opposite way around at the start of the shift😂 Delivery didn’t come until 1am usually so from 9pm until 1 we would work overs (backstock) which had been mostly done by the evening people, and then dress the isles (think Tesco calls it facing up?) and this would only take a couple hours so from 11-1am everyone would be looking for things to do until delivery came in and it was horrible lol. I would have horrible anxiety over having nothing to do, I hate looking for work and standing around like a lost lemon. That was one of the reasons I left the job, I like being busy as the time flies by, when it’s dead it drags so much",
            "Every shelf in your dept must be sparkling then 😆"
        ]
    }
}