{
    "I tried to enable dog mode it thought I mentioned something else": {
        "title": "I tried to enable dog mode it thought I mentioned something else",
        "score": 224,
        "url": "https://i.redd.it/qw2ms31iod9d1.jpeg",
        "content": "My screen need to be cleaned it looks much cleaner in person lol",
        "num_comments": 45,
        "comments": [
            "It is in dog mode 100%.  So dirty.",
            "Can’t see it through all that dust",
            "Please for the love of god wipe your  screen",
            "Hmmm Elon has something up his sleeve or that scene from leave the world behind about to come true.",
            "what is that on your screen? holy christ lol",
            "The real world version of star power isn’t quite available yet\n\n![gif](giphy|lYiQWU9xMJrBsb2RHX)",
            "Your screen drives me nuts, get a large line free cloth from Amazon and leave it in your glovebox!",
            "Gross bro clean your car.",
            "DOOM music starts playing.  On screen graphical representation of other vehicles turn into imps and cacodemons.  Lane lines turn into fire.",
            "*There is no cow level*\n\nEdit: *Power overwhelming*"
        ]
    },
    "I’m at a non Tesla dealership buying a model Y and has these alerts are present. Not sure if these is a quick fix or they can be overwritten. They’re are supposedly fixing it. Any advice please?": {
        "title": "I’m at a non Tesla dealership buying a model Y and has these alerts are present. Not sure if these is a quick fix or they can be overwritten. They’re are supposedly fixing it. Any advice please?",
        "score": 172,
        "url": "https://i.redd.it/g0h7hgon2c9d1.jpeg",
        "content": "",
        "num_comments": 229,
        "comments": [
            "The general rule when it comes to buying cars. If it was an inexpensive fix they would have fixed it before selling so they could have sold it for more. \n\nI would avoid this car. These problems look expensive.",
            " It got hit to be so misaligned. Check the bottom",
            " I wouldn't touch it then. Unless half price of equivalent non damaged car",
            "OP, you should ask this over at r/TeslaServiceCenter they might help you.\n\nBut I would avoid buying a car with known issues (That dealer/car owner could just as easily get it fixed).",
            "2c here. there are literally hundreds of other comparable Ys anywhere you look. i wouldn't touch this one, unless it was free.\n\nit's one thing to buy something with these warnings from Tesla directly, but some other dealer? nope. you'll be SOL instantly.",
            "Get permission to take it to a Tesla dealer to have a pre-purchase inspection. You will learn everything you need to know, including potential warranty coverage.",
            "Advice: don’t buy a Tesla from anyone except Tesla.",
            "I had an alignment done on my Model Y at the dealership I work for. They didn’t know how to reset it afterwards so all the safety features were disabled. I opted to take it into a Firestone that actually does Teslas and they aligned it and reset  it with zero issues",
            "As a body shop who repairs these vehicles a lot, I would only buy it once repairs are done, and the vehicle is certified by Tesla.  Otherwise walk away!",
            "The fact that they haven’t fixed it before putting on the lot is questionable."
        ]
    },
    "Saw 9 Cybertrucks in SoCal yesterday!": {
        "title": "Saw 9 Cybertrucks in SoCal yesterday!",
        "score": 33,
        "url": "https://i.redd.it/w3e957xo7e9d1.jpeg",
        "content": "This was the only one fully loaded.",
        "num_comments": 13,
        "comments": [
            "Nice to see one actually being used as a truck!",
            "I saw a bunch near (or before) launch but have only seen 1 since. (also SoCal). \n\nThe 2nd CT I ever saw was in Louisiana at a SC (Pecanland Mall), which was a few days before launch.",
            "Possibly. My gut feels like its near the Clairemont Mesa area where the 52 merges.",
            "I know nothing about truck beds but am familiar with the Final Destination franchise. Is that a properly secured load?",
            "Very first one that I've seen on the road with a loaded bed.  Five stainless, one on a girl's test drive, one black, one bronze/pewter, and this working baby blue wrap.",
            "I-5 North of the reactors.",
            "big lumber pieces so it isn't going anywhere",
            "Unless he floors it, then the lumber will just sort of fall to the ground in a heap.",
            "San Onofre area.",
            "Is this near SD? Spitballing because the freeway sign posts/support remind me of SD. And I still routinely go days without seeing a CT on the freeway in greater LA heh"
        ]
    },
    "Advice on Buying Used Model 3": {
        "title": "Advice on Buying Used Model 3",
        "score": 2,
        "url": "https://www.reddit.com/r/TeslaLounge/comments/1drasv6/advice_on_buying_used_model_3/",
        "content": "Hey everyone,\n\nOutside of my week of research, I’m essentially new to the Tesla world and looking to buy my first one, likely a used Model 3, and potentially under $25k to qualify for the EV tax credit. I need some advice on:\n\n**Model Year Differences**: Any significant updates to know about from one year to the next? Like, is there any year you'd recommend not buying anything older than?\n\n**SR vs. SR+**: Is the price difference worth it? My thought is I don't want the \"cheapest\" Tesla\n\n**General Tips**: Any buying tips or things to watch out for?\n\nThanks in advance for your help!",
        "num_comments": 2,
        "comments": [
            "There’s an income cap too.",
            "Thanks for the heads up! Fortunately (or unfortunately lol) I don't have to worry about that. We're close but still under."
        ]
    },
    "Any overseas military Tesla owners?": {
        "title": "Any overseas military Tesla owners?",
        "score": 5,
        "url": "https://www.reddit.com/r/TeslaLounge/comments/1dr5n2o/any_overseas_military_tesla_owners/",
        "content": "Are there any military overseas Tesla owners who have found a way, either thru Tesla or some kind of hack, to get updates, navigation, etc... And has anyone found an adapter that can use the Tesla Station's fastest charging speed (250kw) instead of stuck with the 150kw?\nI have a 2018 model 3 and have been in active duty military in Europe since 2021. My haven't gotten an update to my car since 2021 (and even the Tesla service centers can't do it - I've been to 4 different ones in 3 different countries); I can't use maps or plan where/when to charge. I did find an adapter that lets me charge at ONLY the Tesla Stations that have the slower 150kw charger, and I'm thankful for that (even though it takes an hour to charge for every 3 hours of driving - not great). I feel like there's got to be a way to get a US Tesla to work overseas. Right?? \nEven with both arms and legs tied behind its back, it's still the best thing in the world to drive. Especially here in Europe. (And selling it won't help. It's paid off and no one here would buy it.) ",
        "num_comments": 4,
        "comments": [
            "I was about to tell you to try a wifi router that can connect to a VPN and to set the VPN to the US. That *might* trick the car into thinking it can get US software updates. But, then I remembered that the car will still have GPS, and that's probably part of what is considered in its software logic. Not sure of a way to trick that.",
            "Sorry to not answer your question but I’m having a problem charging. Is your adapter one of the Type 1/2 adapters?"
        ]
    }
}