{
    "Conversation I just found between my wife if 15 years (blue) and her friend. I need someone to talk to before I blow up": {
        "title": "Conversation I just found between my wife if 15 years (blue) and her friend. I need someone to talk to before I blow up",
        "score": 1059,
        "url": "https://www.reddit.com/gallery/1dqvwot",
        "content": "I feel so incredibly disrespected. Back in April it was discovered she sent a picture to another guy “by accident” when drunk. This picture was also sent to me and she immediately followed up with “im so sorry please delete” to the other guy. We got into a huge fight but ultimately I forgave and moved on due to putting my trust in our 15 year relationship, 7 of those as married.\n\nI was away for a business trip and she mentioned the same person wanted to buy something so she was going to send it with a mutual friend that stay with her while I was gone so she wasn’t alone.\n\nThis sparked my uneasiness so I immediately went to see, searched his name and found these texts that happened AFTER we reconciled over the picture.\n\nPlease someone talk me down and tell me what to do.. I’m so lost, angry and feel like I’m about to blow up. ",
        "num_comments": 464,
        "comments": [
            "The whole delete/evidence stuff means she has thought about this seriously & knows what she is doing. Sorry you are going through this OP.\n\nIf it was me I’d send her these pics without text then block her number then leave/move out. My phone receives texts from blocked numbers but doesnt notify me. So I wouldnt read her texts let alone reply until I felt ready & had already consulted a lawyer to go through with the divorce. There is no excuse for this.",
            "Yeah this is a huge betrayal. You deserve someone who doesn't ask \"what dat D look like\" about someone when they're married. Unacceptable. Sorry, OP.",
            "Seems like she’s a bit hesitant but her friend is egging it on. They for the streets bro",
            "It’s ok to be single. My ex was crazy asf. Sorry you went thru that my guy.",
            "WHAT DAT D LOOK LIKE!  \nJesus christ\nMan get rid of her, 15 years or not , ain’t worth it",
            "This very much reads as if your wife is in her late teens or early twenties and she’s newly in a relationship but having trouble cutting off the attention. Big yikes buddy, you are valid in your response to this.",
            "Your wife's a hoe, sorry.\n\nIf you don't want to blow things up, block his number on her phone without her knowing if possible.",
            "But did she get the D pic? Haha\n\nYeah. That’s pretty bad. When I got divorced, though, my lawyer said it didn’t matter if they cheated.",
            "Problematic for sure. I’d be hella mad if I found my husband texting like that. Doubtful it’s gone very far then girl chatter, but the flirting and all that has to end immediately, and the friendship with him.",
            "Very disrespectful but don't reach for the bottle brother."
        ]
    },
    "The one time I try to go on a date": {
        "title": "The one time I try to go on a date",
        "score": 347,
        "url": "https://www.reddit.com/gallery/1dqvw31",
        "content": "This was the second date me & this guy have been on, I gave him a kiss on the CHEEK when I first saw him. Other than that I was not touching him or giving him any hints that I wanted to hook up with him which I also said before we had even gone out that I wasn’t looking to hook up, I told him that I would pay for dinner because he had paid for us to go mini golfing before hand but he insisted on paying for our dinner, he seemed like a pretty cool guy on our first date. I don’t really know if I’m in the wrong or not.",
        "num_comments": 139,
        "comments": [
            "Dude has the typical \"alpha male\" mentality you dodged a 50 cal bullet",
            "Why do they always think talking about how many other woman supposedly want them is going to make us jealous? It's not, we don't care. OP just told the guy she didn't want a hook up and he's all like \"well I got all these other people waiting (I'm not going to repeat what he actually said)\" OK? And? Go be with them then. It's like when entitled customers threaten never to shop someplace again, the employees don't care. They're just glad to be rid of you",
            "LMAOOOO THEY ALWAAYS SWITCH UP SO HARD WHEN YOU REJECT THEM WHEWEWWWW YOU DODGED A HUGE BULLET !",
            "Hoes in his phone begging to fuck him? I mean I know snapchat sends out messages every holiday but I’m pretty sure they’ve never been provocative /j",
            "You dodged a fuckin Nuke",
            "If other hoes we’re begging to fuck him, he def wouldn’t be acting a fool like this",
            "Poor excuse for a human being. Disrespected you in every way. Better to find out now.",
            "Omfg. How TF are you a hoe when you literally wouldn't fuck him. I hate these kind of people",
            "No, you're not wrong at all. You aren't obligated to hug, kiss or do anything else on a date or beyond.  You set your boundary and he wasn't willing to respect it.  For someone that has so many \"hoes in his phone begging to fuck him.\" He sure as hell is pressed 😒 he seems like a loser.",
            "Why is Ian worried abt you?"
        ]
    },
    "Texts from my emotionally abusive mother": {
        "title": "Texts from my emotionally abusive mother",
        "score": 388,
        "url": "https://i.redd.it/kfnchy0jzc9d1.jpeg",
        "content": "For context: \n\nI didn't do anything to prompt this. We were having a normal conversation before this happened. She gets drunk and does this once or twice a week. This was the last straw for me though. I'm renting a property that my dad owns. I don't live with her, thank fuck. ",
        "num_comments": 97,
        "comments": [
            "Woww... Meanwhile when she's on her death bed \"Please forgive me!!!\"",
            "Ahhh yes, the vitriol of an alcoholic. I’m familiar.",
            "I’m so sorry. You don’t deserve any of this. I’m glad you are getting away.",
            "Wow. That’s absolutely horrible. No parent should ever talk to their children this way. Sometimes you have to cut toxic family out of your life because nothing you can do will make them treat you the way they should.",
            "I just want to say, I hope you go no contact with her. These are horribly scarring words, even if she has some sort of mental illness or disease like alcoholism. Take care of yourself- you deserve so much more love and appreciation that this woman can give you.",
            "Sheesh. I could never speak to my child like this.",
            "Omg! I couldn’t imagine talking to my daughter that way! I’m so sorry you have to deal with that.",
            "Bitch is so angry she time traveled a month.",
            "Sorry OP 😭 you deserve so much better.",
            "Does she use social media? I would post these and tag her and call her out publicly. I don't care if you're the antichrist, I'd never speak to my children this way. Saying those things are honestly unforgivable."
        ]
    },
    "Maybe I’m Crazy But Is That Okay To Say To Someone?": {
        "title": "Maybe I’m Crazy But Is That Okay To Say To Someone?",
        "score": 889,
        "url": "https://i.redd.it/w14mzdvo6b9d1.jpeg",
        "content": "",
        "num_comments": 107,
        "comments": [
            "LMAO that response is gold",
            "What’s up with referring to women as a porn category 😭",
            "Facing it rn 😆😆😆 perfect!",
            "That’s wild asf\n\nWith the anime pic too! It’s always the dudes with the anime pics",
            "People have become entirely too comfortable being able to say things without consequences",
            "“I wasn’t into Ebony”\n\nMy teeth hurt reading that.",
            "That’s fucking unhinged 🤣 “when I saw you I knew I was into ebony” kind of vibes. Your response was hilarious",
            "Referring to a person as ebony in a personal interaction is wild. Dude watches way too much porn.",
            "he's disgusting, but your response was perfect\n\nhowever, he seems too short to catch it 💀",
            "WTF. Yea, that is very problematic. You responded beautifully."
        ]
    },
    "What happens when you go no-contact with an abusive parent.": {
        "title": "What happens when you go no-contact with an abusive parent.",
        "score": 19,
        "url": "https://www.reddit.com/gallery/1dr74f6",
        "content": "Strap in kids its a DOOZY. This is my mom. She and my brother (J) abused me physically, financially and mentally and emotionally for the entirety of my childhood. From being tasered for fun to full blown temper tantrums where she would stomp her feet and scream at the top of her lungs. \n\nI moved out the day I graduated high school. She signed my name on my paycheck and stole money from me while I was homeless. She would leave my dog tied up outside my job and force me to leave work to take care of it. \n\nWhen my grandparents died she ransacked their house and kept saying “i bet i can sell this”. I took a skirt my grandmother sewed and a sewing machine to remember her by, which I still have 6 years later. She never gave me information to their funerals. She had her Facebook friend message me to tell me my grandfather died. She would have friends stalk me on Facebook to the point where I deleted it. \n\nI gave my brother a car for free and it caused so many arguments because she wanted it. \n\nI got a good paying job and it made her mad. \n\nGuess her dog passed away and that is somehow my issue too. Her being physically assaulted is likely a lie as well. She did the same thing to all her previous boyfriends where she physically assaulted them and then called the cops on them when they tried to leave. I have never seen any of them actually hit her. \n\nAs for her and my brother not fighting, i highly doubt it. Every time I visited it was an argument or the brink of an argument where the household tension was so high you could cut it with a knife. \n\nThe last straw was her telling my nephew she hated him straight to his face. Maybe I was triggered at the time but she said that to me growing up that it really bothered me. I cut all contact. \n\nShe tries this shit every few years as a guilt trip. She’s not sick (at least not physically). She had an opioid addiction and would make up illnesses to the doctor to get drugs. She lies about just about everything. \n\nI sometimes miss my brother and nephew but i cant keep in contact with them and have her out of my life as they live with her. ",
        "num_comments": 20,
        "comments": [
            "The journey to peace often means cutting off toxic ties.",
            "I’ve come to realize anyone who repeatedly declares they’re good people, are indeed not good people",
            "I once had a Therapist asked me if I had met my mother any other way, would she be in my life? I said no. She was awful human being. That question changed my life.",
            "Belongs in r/raisedbynarcissists. I’m sorry you had and still have to deal with this.",
            "„if it makes you feel better criticise me you selfish asshole“ is such a classic line. they are afraid of criticism and so they try to prevent it by making it perceive it as egoistic and assholish behaviour.",
            "“I have a big heart and am a nice person.” \n\nI’m glad you’re away.",
            "Yes, unfortunate though because now I have no blood family.",
            "They’re trying to convince themselves tbh",
            "I might cross post there, I just wanted y’all to enjoy what I get to deal with lol",
            "Honestly this. I couldn’t criticize her because it was always “my mom ACTUALLY abused me and you aren’t “ or “I apologized you should forgive me” when they gotta apologize for the same shit constantly and dont change the behavior"
        ]
    }
}