{
    "It's Time to STOP THE BOTS #FixTF2 June 3rd! ": {
        "title": "It's Time to STOP THE BOTS #FixTF2 June 3rd! ",
        "score": 13944,
        "url": "https://i.redd.it/apxnfk0ris2d1.png",
        "content": "",
        "num_comments": 1081,
        "comments": [
            "And remember everyone - do not fear bomb! **PUSH!**\n\nWe must all **PUSH!**",
            "THE #FIXTF2 CAMPAIGN IS OFFICIALLY LIVE.\n\nWe've made a shitload of changes from how the original #SaveTF2 iteration went, we hope to cause more of a fuss this time. Let's run it gentz!",
            "Will this be enough to get Valve to act? Im not sure. However, it is absolutely worth going for and to call them out collectively for neglecting this game.\n\nLets do it.",
            "We got this lads ",
            "DON'T STOP AFTER A TWEET. DON'T STOP AFTER A WEEK. KEEP GOING AT WHAT WE SEEK.",
            "if this doesnt work out, we might as well resort to hunting down the bothosters and stealing their hardware",
            "Hopefully something happens. I really hope this game doesnt die as it is so much fun. I mean I havent played in a few months because of the crisis.\n\n#FixTF2",
            "Surprised they didn't mention the CP. Bots using (or used to use I'm not sure) sexually explicit images of children as their sprays in game.\n\nThey aren't just making a video game less fun to play, they're straight up criminals",
            "# Standing near ze point does nussing, get on ze point, Dummkopf!",
            "**If not us, Who? If not now, when?**  \nDo not live in the tides of doubt, swirling you around like a turd in the toilet bowl. Rise and act, so you may be seen and your voice be heard.   \nJames 2:15-16, it is not enough to simply \"care\", you must act, or nothing will change. Nihilism is a garbage cope, instead of whining about the pile of crap you are in, grab a shovel and start digging your way out."
        ]
    },
    "PSA: Here is a list of common scams going around nowadays. Please use common sense when dealing with random strangers. Spread the word to any new players to the game.": {
        "title": "PSA: Here is a list of common scams going around nowadays. Please use common sense when dealing with random strangers. Spread the word to any new players to the game.",
        "score": 1406,
        "url": "https://www.reddit.com/r/tf2/comments/101y77k/psa_here_is_a_list_of_common_scams_going_around/",
        "content": "If you don't want to read through the whole post, just know this:\n\n#If it's too good to be true, it is.\n\nRandom people who add you out of the blue and immediately ask you for something is a red flag. They try to cast a wide net and add as many people as they can. You might be thinking, it's already bad enough we have to deal with aimbots in our games, but now we need to fight off scammers outside the game too? Sadly, yes. And if you're the type of person who has never seen these scam attempts before, maybe you should keep reading.\n\nThankfully, these scammers are not very creative. The vast majority of them have been using the same scams for years. And yet people still fall for them. Don't be the latest sob story on r/tf2. Here are the most common scams going around today:\n\n#1) Highlander/Tournament Scam [\\(see here for an example\\)](https://i.redd.it/74rxrwlmemk71.jpg)\n\nSomeone will randomly add you and ask you \"which class you prefer to play in Team Fortress 2\". No matter what you respond with, they will follow up that their team is missing a player for their tournament with a kickass prize pool. A variation of this is they will ask you to vote for their team. They might even try to stay topical by saying one of their teammates got covid and can't play. Either way, you will be led to a (fake) tournament site to either sign up or vote for this team.\n\n**How does the scam work?** The site they redirect you to is a fake tournament site, [which might look something like this](https://i.imgur.com/vzxqG3J.png). It exists only to steal your Steam login details. Once you find their team and try to join/vote, you will be redirected to a Steam login page. If you enter in your Steam name and password, your account will get stolen and your items taken.\n\n**How do you know this is a scam?** There are only a few legitimate comp leagues in TF2: UGC, RGL, ETF2L, ozFortress, and AsiaFortress. But even if you're unfamiliar with comp TF2, you should know there's something fishy about someone offering to share such a large prize pool with you with minimal participation. If we look even closer at the site, you'll notice a few things. Many of the \"players\" have profiles related to CS:GO and other real esports athletes, but none that are specific to TF2. You might even notice that many players share the exact same profile pictures. Too bad you can't click on any of their names to check their Steam pages because the site creator didn't think you'd notice.\n\nAnd if that didn't tip you off, take a look at the TF2 tournaments that are supposedly going on. Some players are registered on multiple teams at the same time. [The tournaments page says they are all free to enter, but there is also a monetary prize pool.](https://i.imgur.com/sRvdLkv.png) Where is this money coming from then? Perhaps from a certain bodily part where the sun don't shine.\n\n#2) Steam Admin/False Report Scam [\\(see here for an example\\)](https://blog.malwarebytes.com/scams/2021/03/steam-users-dont-fall-for-the-i-accidentally-reported-you-scam/)\n\nSomeone will randomly add you because they've accidentally reported your Steam account to Steam Support. It was all a mistake, they say, and you should add this \"steam admin\" to sort it out. Once you talk to this (fake) Steam admin, he will either get you to log out of your account and tell him your email address and the verification code sent to your email, or ask for your Steam  username and password. There is even a trading related variation of this scam where your account was reported for \"duped items\", and the fake Steam admin will ask you to send items to a phony trading bot to \"verify\" the items.\n\n**How does the scam work?** This one is pretty simple: once you send your Steam account details or your items to this scammer, they'll be lost. They'll be free to withdraw any items of value from your account and drain it dry.\n\n**How do you know this is a scam?** There is no such thing as a \"steam admin\". [Steam Support also clearly states that \"Steam Support representatives will never ask you for your password\".](https://help.steampowered.com/en/wizard/HelpWithAccountStolen#:~:text=Steam%20Support%20representatives%20will%20never%20ask%20you%20for%20your%20password.) \n\n#3) Gambling Site Promotion Scam [\\(see here for an example\\)](https://www.youtube.com/watch?v=zNdHdxOVXXo)\n\nBy now you probably know how this starts. Someone out of the blue will add you on Steam and start asking you something. In this case he will ask you to help him promote his site through Steam, and in return you will be paid. He will then explain how the payment works. He'll link a gambling site and say he can control who wins the jackpot.\n\n**How does the scam work?** He will pick out a random player on the site, or ask you to pick one out, and he'll make him win the jackpot. Seeing as how he introduced himself as the owner, it's likely that he does indeed have the ability to manipulate the results. However none of the players or roulettes are real. They are all made up and don't link to actual profiles. The scammer will then ask you to bet items of your own and guarantee a win for you. You do as he says and it seems like he made you a winner as well, but of course, you can't seem to get your items back. He might even be cheeky and ask you to do it again. But he has your items and likely will not give them back, even if you ask nicely.\n\n**How do you know this is a scam?** There are no legitimate gambling sites on TF2 today. [They were taken down years ago after Valve was involved in lawsuits about involvement with illegal gambling.](https://www.theverge.com/2016/7/14/12186584/valve-gambling-statement-counter-strike) Anyone trying to peddle a gambling site today is relying on the chance that you don't know this. You might also notice that the gambling sites don't have real players who link to real profile pages, or that the conversations in the chat feed make no sense.\n\n#4) Mannco.store Bot Scam [\\(see here for an example\\)](https://preview.redd.it/237wdqgy2k0a1.png?width=1848&format=png&auto=webp&s=57929f2df8b74d3160dde2f2d026529ec3ed5034)\n\nMannco.store is a legitimate trading site, but it also attracts a lot of scammers who pose as admins or reroute you to fake bot accounts. A trader will add you, usually offering you an incredibly generous deal for your items, but wants to be extra sure that your items are real and you're not scamming them. How ironic. Their reasons will be one of the following: to check the value of your items, to have your items go through a verification process, or to check that your items are \"100% marketable\". Another version of this scam is a phony trade offer posing as a \"deposit request\" from people who might even threaten to delete your items if you don't cooperate.\n \n**How does the scam work?** You will be asked to verify your items through mannco.store. They'll guide you through the steps of adding a mannco.store bot, then you'll receive a new trade offer from an account that appears to be a real bot. [The trade offer will ask for your expensive items with nothing to give you in return.](https://i.imgur.com/HqIPp31.png) They are supposedly going to give your items right back after they \"verify\" them, but they won't. This bot account is a fake. Accept their trade and your items go bye-bye.\n\n**How do you know this is a scam?** Mannco.store explicitly tells you that [their staff will never contact you outside of their own internal messaging system](https://i.imgur.com/4CQk4vc.png). Any invites on Steam or discord from \"admins\" will be scammers. If you're looking to deposit items into your mannco.store account, only accept the trade link generated through their site. And once you do trade with a mannco.store bot, make sure that it's one of the bots from [this list on their website](https://mannco.store/bots), and also that the account is part of the [\"Mannco.store | Bots\" steam group](https://steamcommunity.com/groups/MANNCOBOT). You might recognize a fake bot account because [he'll join the \"Mannco.trade\" Steam group](https://i.imgur.com/XN0cLHi.png) but not the official bot group.\n\n#5) Particle Mayhem Scam (\"Vote for my artwork\" Scam) [\\(see here for an example\\)](https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2Fpd7cle86n7lc1.png%3Fwidth%3D1703%26format%3Dpng%26auto%3Dwebp%26s%3Df6f0919e2b2d35b8106b9fcc8660490dbf3c7064)\n\nThis scam is pretty similar to scam #1, but it's becoming common enough that maybe people need to be warned about this one in particular. Be wary of ANYBODY who asks you to do them a favor in exchange for payment.\n\n**How does the scam work?** It works the same way as the highlander vote scam. You'll be asked to vote for a custom particle effect in exchange for keys as payment. Now how does he want you to vote for his submission? Why through a fake steam login site, of course. Again this is just the highlander vote scam with a fresh coat of paint. These scammers are already reusing old scam methods.\n\n**How do you know this is a scam?** [\"Particle Mayhem 2\"](https://particle-mayhem-2.tf2maps.net/) is a real community contest created by the TF2Maps.net mapping community. However the official site warns that no one will be asked to log in to vote for any submissions. They even point out that the \"Malibu Sunset\" effect is not one of their official entries. It seems these scammers couldn't be bothered to link an actual submission and instead keep sending out the same fake one every time. The contest is also over and the winners announced, so anyone still trying to get votes for their submissions are either obvious scammers or time travelers. \n\n#\"What do I do if I accidentally logged into a scammer's website?\"\n\nAssuming it's not too late and your account/items haven't been stolen yet, go through the following steps:\n\n1) Change your Steam password\n\n2) Go to http://store.steampowered.com/twofactor/manage and deauthorize all devices from logging in to your Steam account.\n\n3) Go to your [Steam API Key page](https://steamcommunity.com/dev/apikey) and click “Revoke My Steam Web API key”. This will turn your old API key obsolete and generate a new one. This way you make sure no one retrieves data through your Steam account’s API.\n\n4) Reset your [Steam Trade URL.](https://steamcommunity.com/my/tradeoffers/privacy#trade_offer_access_url) This will disallow scammers from sending you trade offers once you made sure they cannot access your account. Make sure to add your new Trade URL to accounts on websites that you trust so you can otherwise keep on trading as per usual.\n\nBut if all else fails, you might still have a chance of recovering your Steam account by contacting Steam Support.\n\n­ \n\nThose are the most common ones I see going around, but there are likely many more. To reiterate, don't trust any opportunity that seems too good to be true. Don't click on suspicious links from strangers. And immediately be very suspicious of random people adding you on Steam asking you for something. If you notice any of the telltale signs above, block the scammer and report their account on Steam. Steam two-factor authentication doesn't make your account bulletproof, especially if you are fooled into giving your Steam info away to strangers.",
        "num_comments": 115,
        "comments": [
            "Might want to post this on r/newtoTF2 just to be safe",
            "Imagine thinking you are good enough that someone wants to recruit you for tournaments. Can't relate.",
            "This isnt about tf2 but this one is common too: the giveaway site. They make a fake site which apperantly gives you free games but just steals your login info.",
            "Its kinda funny to me that in the game were you can become the enemy team and stab someone in the back there are more scammers then any other game out there",
            "Ayyyyyyy!\n\nThis thread is back! :)",
            "Hopefully this will make a dent in the million i gOt ScAmEd posts",
            "I fell for the first one - just trying to help out with a team vote & not even giving money away. I was suspicious, but the login page had Steam URL and everything. Luckily I caught on when I got a text telling me my Steam Guard was deactivated after \"logging in.\"\n\nI've never fallen for scams before that but the danger is real.",
            "Interesting thing to see about the gambling sites, as Ive seen one sponsor a YouTuber quite recently.  Cant remember which creator or video, but it was still in my recommended.  Curious whether the site was legit or not.",
            "Don't forget about fake trade offers! If a person ask to go through a \"Moderater of trading\" it's BS. Your items will be gone forever.",
            "this is good list. On Reddit, this list should not be banned"
        ]
    },
    "Valve has added a new ban page SPECIFICALLY for TF2 ": {
        "title": "Valve has added a new ban page SPECIFICALLY for TF2 ",
        "score": 1351,
        "url": "https://i.redd.it/1tjek3dbog9d1.png",
        "content": "",
        "num_comments": 49,
        "comments": [
            "Lol, \"manipulation of competitive mode rank\"",
            "Your ban is Non-negotiable. **Enclave intensifies**\n\nAnyways, besides that. Thank you Valve. Thank you for FINALLY GETTING ON THE TREADMILL.",
            "They aint fuckin around this time. (I hope)",
            "Manipulation of competitive rank is the bizarre one, especially considering how Devs abandoned comp mode after meet your match update, they would release like 1-2 minor patches for it and boom, nothing.\n\nI really wish I could say that's the sign TF2 Devs are considering updating it properly so comp players leave casual and play their comp mode but for now I'm remaining sceptical.",
            "Finally, it's almost feels like we've been heard. Though I'm not celebrating yet.",
            "Well, this is a good start",
            "It's like they came back with the milk boys ",
            "My mouth hurts from smiling so much",
            "THE LORD CALLED GABE HATH SAVED US ALL",
            "finally valve is finna stopping them"
        ]
    },
    "New Steam Support info page about TF2 Game Bans": {
        "title": "New Steam Support info page about TF2 Game Bans",
        "score": 1584,
        "url": "https://help.steampowered.com/en/faqs/view/37C7-829B-5DE3-CC3B",
        "content": "",
        "num_comments": 182,
        "comments": [
            "Some of the known cheaters had backpacks in the thousands, I believe one of them had a backpack worth 10k. Imagine losing 10k in untaxed savings  #RIPBOZO",
            "wow they are not taking any shit lol. almost every single sections very first sentence is just \"No.\"",
            "I love that every response is just \"No, the ban is permanent.\" The bot hosters must be absolutely seething right now.",
            "Gaben- \"I swear to god if you botting shitheads make me get on the treadmill one more time\" \n\n\\*stuff mouth with romaine lettuce \\*",
            "Hopefully, this means Valve will read reports now",
            "Holy cannoli with guacamole, I never thought I'd see the day they go zero tolerance with cheating in TF2.",
            "Actually fucking surprised to see anything like this. Actually kinda hopeful now",
            "\"The destruction of the Saxxy was a canon event, Miles\"",
            "Hopefully the secrecy regarding how these bans are issued makes it harder for botters and cheaters to circumvent. I'm sure they will eventually, but anything that makes their job harder is a good thing.",
            "FixTF2 doomers have been real quiet lately..."
        ]
    },
    "To all bot hosters that have gotten banned…": {
        "title": "To all bot hosters that have gotten banned…",
        "score": 1563,
        "url": "https://i.redd.it/ufb0ettmff9d1.jpeg",
        "content": "",
        "num_comments": 106,
        "comments": [
            "Tear off your skin! Do it! Tear it off! Bot hosters don't need protection from the sunlight!",
            "$400,000 to host those bots huh? Yeah money well spent!",
            "Dammit, Scout's laugh is too iconic.",
            ">I *HATE* ye campers! *Everyone* bloody hates you!",
            "next time eat a salad!",
            "Bot hosters have no dad",
            "Perfect image, great spoiler mark :D",
            "\"You can't hear pictures\"  \n\\*this image*",
            "I can hear this image and it is extremely funny.",
            "the chucklenuts did not think fast enough"
        ]
    }
}