{
    "Planning a trip to Thailand? Here's what you need to know about wet season": {
        "title": "Planning a trip to Thailand? Here's what you need to know about wet season",
        "score": 72,
        "url": "https://www.reddit.com/r/ThailandTourism/comments/1dchpgl/planning_a_trip_to_thailand_heres_what_you_need/",
        "content": "It's currently wet season, or rainy or monsoon season, whatever you want to call it in most of Thailand in June 2024 when this is being written, but not all of Thailand at the same time. Give the repeated questions and a request for a pinned thread; here's my effort at explaining what you need to know if you are visiting Thailand as a tourist. For the time being, this is the one-stop thread for all things wet season - if you have questions, put them here.\n\n**When is wet season?**\n\nWet season in most, but not all of Thailand, runs from May to October/November. Officially, Thailand entered wet season this year [on May 21](https://www.thaipbsworld.com/thailand-officially-enters-rainy-season/) and it usually ends around October/November. Last year it [ended Nov. 14](https://www.bangkokpost.com/thailand/general/2684871/winters-here-and-its-warmer-than-last-year), but it can end earlier. The rain in places where wet season started in May starts to drop off in October, irrespective of the date the season officially changes. And seasons change in Thailand with the [change of climatic conditions in the upper atmosphere](https://thailand.go.th/issue-focus-detail/009_142). \n\nIt's currently wet season in all of Thailand except the Gulf Islands and the Gulf side south of Samui down to the Malaysian border. \n\nIn the Gulf Islands (like Samui), the wet season runs roughly from October to December.\n\n**How often does it rain?** \n\nMost likely the most common misconception I read here as a mod is the idea that wet/rainy season means it rains all the time. Put simply, it rarely does* and I'll get to the * in a moment. \n\nThe general rule, anywhere in Thailand, when and where it's wet season, is that it rarely rains all day. You might get a big downpour 30-60 minutes in the afternoon and/or evening. And depending on where and which month, it won't rain every day, either. \n\nNow the * - the exception where it may rain for days on end is when a typhoon or the remains of one crosses into Thailand. And when they do, it's not the whole country - they can and have crossed into the North, tracked across Isan and Central Thailand, or even crossed the Gulf and hit Samui and Phuket at the same time. The forecast from the Thai Meteorological Department this year is that there may be 1-2 such situations this wet season and if they happen, most likely in August and September. \n\n**But I see reports of flooding in Thailand throughout the year.** \n\nFlash floods, typhoons, remains, or a really wet year aside, the main reason places flood most commonly in Thailand is drainage. Be it Bangkok, Chiang Mai, Pattaya, Phuket, Hua Hin, or anywhere else, a heavy downpour overloads the drains. And it's not as if drains don't exist; it's that Thais dump garbage, oil and more down them, and local authorities don't clean them regularly, so when it rains really heavily, the drains can't handle the water. \n\n**Edit: and per u/Schalke4ever - will it ruin my holiday?**\n\nAs long as it's not a Typhoon or remnants, no and see above - no one can predict where or when. Wet season, which generally rarely rains all day, is a great time to visit. The air is clean, everything is green and it's low season so there's not as many tourists around. \n\nIf you have any wet season questions, ask them here.",
        "num_comments": 58,
        "comments": [
            "[deleted]",
            "Is it worth mentioning the safety/schedules of small boats in monsoon season? It's not just about the rain......",
            "Rainy season is the best time to be in Thailand",
            "Would just recommend to avoid sea travels during this season, or atleast check the forecast of swells and wind (should have guessed my self as it was very windy and the sea was pretty rough on the east of Lanta) but thought it will be more sheltered on the other side, bottom line is the tour company don't really care and will still go ahead unless they will have concerns for their boat lol.\n\nTook a long boat for the 4 island tour today from Koh Lanta and that was unpleasant as hell, couldn't see much while snorkeling, couldn't visit emerald caves due to rough conditions, at least the beach was nice at Koh Ngai, but not worth getting tumbled around the unprotected straights between the islands and people getting sea sick and getting sprayed with water non stop, best part of it was getting back lol",
            "Good post on the weather - thank you.\nIt’s actually a good time to visit Thailand. No burning or excruciating heat in the North, can even be cool in Bangkok occasionally,  and windy milder weather in Phuket. \nIf you want crowds of badly behaved tourists then come to Phuket in high season. \nIf you want to chill, surf, meet nice people, enjoy amazing sunsets with thunder clouds & sun together - then rainy season is the time. And you can still get a tan if that’s important. Enjoy!",
            "wet season leads to alot of eating at new restaurants, visiting new coffeeshops and small stores as you wait for the rain to pass, its actually not bad.  unless your only option is sitting on a bench under a 7-11, but grab a toasty and some crab curry chips, and its still not bad.",
            "Which month is your favourites to visit Bangkok? Is July a good month to spend time there?",
            "Thanks for the information. I'm flying into Bangkok tomorrow, I'm nervous but also really excited.",
            "Thank you. This is an amazing post. Well explained and simple. Rainy season questions / perceptions drive me crazy.\n\nRelated side note, rainy season is a missed opportunity tourists. Cool, cheaper prices, so green and beautiful.",
            "I have gone to Phuket six Julys and the rain doesn’t bother me at all. The dive boat goes through some crazy waves. Summer in Thailand is great."
        ]
    },
    "Saturdays are the best for market food.": {
        "title": "Saturdays are the best for market food.",
        "score": 7,
        "url": "https://i.redd.it/u7c6szjwog9d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Grilled Tilapia?",
            "Which market? And how much that grilled fish cost?"
        ]
    },
    "Nice rainy day in Hua Hin": {
        "title": "Nice rainy day in Hua Hin",
        "score": 6,
        "url": "https://www.reddit.com/gallery/1dr42bm",
        "content": "Beautiful rainy day in Hua Hin. Been having a great time just exploring the beach and alleys and getting wet from the rain.",
        "num_comments": 0,
        "comments": []
    },
    "Best Bangkok Hotel": {
        "title": "Best Bangkok Hotel",
        "score": 8,
        "url": "https://www.reddit.com/r/ThailandTourism/comments/1dqyv1b/best_bangkok_hotel/",
        "content": "I have a layover in Bangkok for a few days, I’m looking for the top of the line best hotel to stay in during this time that offers airport pickup. Where did you love staying and why?",
        "num_comments": 26,
        "comments": [
            "Mandarin Oriental , only the best for you",
            "Peninsula and Sukhothai",
            "Capella",
            "Capella. Check out time can be stretched to midnight (check in also highly flexible). Service is top notch. Get a room with a balcony",
            "I like the Carlton Sukhumvit. New, fresh rooms, great staff, excellent breakfast to order.",
            "The Capella and the Mandarin Oriental are both beautiful hotels, as good as you will find anywhere in the world: the Capella for deeply comfortable modern style; the Oriental for a taste of imperial luxury. The service at both is flawless.",
            "If money's not a problem then the Four Seasons.",
            "mandarin oriental charoenkrung",
            "Waldorf",
            "Park Hyatt. Great service, great food, awesome penthouse/rooftop bar, nice location."
        ]
    },
    "Recommendations for itinerary? Bangkok": {
        "title": "Recommendations for itinerary? Bangkok",
        "score": 2,
        "url": "https://www.reddit.com/r/ThailandTourism/comments/1dr5yna/recommendations_for_itinerary_bangkok/",
        "content": "For context, I’m going to Chiang mai and Bangkok this year and I have some questions. Do you think a month is long enough to explore both cities? What are some places you recommend that I must go to or see, preferably not touristy area, not a fan of large crowds. It can be any types of places. I also want some good food recommendations. Are there any cool amusement parks that I could go to?",
        "num_comments": 1,
        "comments": [
            "I can only answer one of your questions. Yes a month is long enough to explore both cities."
        ]
    }
}