{
    "Cyberpunk 2077 depths": {
        "title": "Cyberpunk 2077 depths",
        "score": 50,
        "url": "https://i.redd.it/iblg0uevze9d1.jpeg",
        "content": "It was terrifying. No game is safe. ",
        "num_comments": 4,
        "comments": [
            "Say Hi to Judy while you're there. 👋",
            "I would if I could, she blocked me cause I turned her down. My V was into her right up until everything was recorded.",
            "I explored the dam yesterday. Went for a badlands race and decided to walk around. \n\nOn the left side (where the trash is) you can find a leader to get down to sluice level. Some of them are open. I went to the furthest one and dived in to another side. \n\nMan, the weird feeling of seeing this huge structure under water. It goes down so deep you can see it's foundation. I've dived as deep as I could and used up about 75% of my air. I was taking damage and almost died by the time I got back to surface. \n\nNever expected Cyberpunk of all games to trigger that feeling. Especially when exploring some area that wasn't meant to be a zone of interest.",
            "That's indeed terrifying"
        ]
    },
    "JAWS Ride - Alone in the boathouse (until another boat arrives) - I'd hate this!": {
        "title": "JAWS Ride - Alone in the boathouse (until another boat arrives) - I'd hate this!",
        "score": 424,
        "url": "https://v.redd.it/3qxhp1tflb9d1",
        "content": "I initially saw this over on /r/UniversalOrlando but Reddit would not allow me to cross-post. Originally posted there by /u/MesaVerde1987. ",
        "num_comments": 23,
        "comments": [
            "Wow this brings back memories - I remember going on this ride in 1998 when I was 7 and it scared the shit out of me.",
            "Idk what it is about large animatronics and water but they always freak the shit out of me",
            "Ive only been to Universal Hollywood and there wasnt a boathouse as far as i remember. This video was so well done! The fades, no shaking, the slow pans. 5/5",
            "Bringing this ride down for another HP clone was such a waste. HP didn't need to be in every single park!",
            "I hate this so much.",
            "What’s hilarious is that I was on that ride years ago, and I was facing the wrong way the whole time so I saw nothing",
            "Falling into that water would almost be as terrifying as having to walk around small world.",
            "Wow,\n\nI was on this ride when I got the call from the police detective (lived across the street)  back home that my now ex wife had broked into \"the marital property\" to empty the house. I flew home the next day cutting my trip short.  Hilarity and a massive custody case followed.  That was almost 29 yrs ago, Good TImes..../sarc",
            "I swear the boat tour guide fell off and got eaten in a pool of blood when I went. I was also 5 or 6 tho 😂",
            "We are the same age and have suffered the same trauma lol scared out of my goddamn mind"
        ]
    },
    "Without any creatures, it's less scary?": {
        "title": "Without any creatures, it's less scary?",
        "score": 11,
        "url": "https://youtu.be/rHLifi-VzSQ?si=Yo0ot9T7hUkoyEMz",
        "content": "Who agree with me? It's just the depth or it's mostly about what can be there that you don't see?",
        "num_comments": 11,
        "comments": [
            "‘Falling into Uranus’ they have to have realised how that sounds.",
            "“After WEEKS of falling???????” 😭",
            "IF I could be positively, 1000% guaranteed there was nothing alive, nothing that could harm me, then and only then would I be okay with it.\n\nBut I know that's not possible, and that there are loads of creepy things hidden unseen in the depths, that are going to grab my ankles and pull me down, down, down, to meet a fate more horrible than death.",
            "The bottom of Uranus is really, really deep.",
            "It depends on the depth :P ahah",
            "There are absolutely no living things in Uranus ocean that's 100% scientifically proven :)",
            "I like to think our science only captures things within the grasp of our comprehension. We don’t know things exist until we discover them, maybe there are monstrosities on there that we cannot detect or even understand yet (probably not)",
            "No don’t deprive me of my fantasy of fuzzy diamond-encrusted sea cucumbers",
            "Aaaalriiight there are fuzzy furries on Uranus I promise :P",
            "Aside from the fear of things that live in ordinary oceans, and the obvious depth - the isolation and vastness of the planet sized sea would be the thing that would push me over the edge into inconsolable fear.\n\nIf Neptune and Uranus are named after Roman/Greek gods then their depths would be the abyss of Tartarus.\n\nNo, being alone in these places would NOT bring me any comfort!  \nAt least give me a cuddlefish to cling onto you demented sadist!"
        ]
    },
    "Looks like there’s nothing there at first…": {
        "title": "Looks like there’s nothing there at first…",
        "score": 728,
        "url": "https://v.redd.it/jmktdx9m679d1",
        "content": "About 40 miles from shore over a deep canyon that pelagic fish tend to cruise, we jump in to see if anyone is home. Out of nowhere a school of baby Yellowtail (Hamachi 🍣) come in to say hi as I take a shallow dive…it’s what we are here for, but looking for their grandparents 🤤 ",
        "num_comments": 49,
        "comments": [
            "I kept waitin for a shark/shipwreck/sea creature 🤣🤣🤣🤣",
            "It's so disorienting in the water. They're close to the surface, so you can still see bubbles going up, but I get how deeper divers get confused and lost",
            "Why would you put me through this 😭",
            "I don’t know why, but those creaky sounds give me such instant dread. Like they’re so slight, but at the same time, horrifying. Great job!",
            "To me, this is thassophobia. I hate the endless blue, to the point where I need to put my phone down.",
            "Turns out there is actually nothing.",
            "*sigh* \n\nCan someone just tell me happened? I can't watch this.",
            "So random but I love the pattern of your wetsuit! It's like pixelated tie dye, very cool",
            "Like there's anything in the ocean scarier than a Great Ape in a high tech breathing apparatus wielding a speargun",
            "What was the constant clicking sound? At first I thought maybe dolphins, but it kept on going."
        ]
    },
    "In Case You Needed More Reasons": {
        "title": "In Case You Needed More Reasons",
        "score": 4,
        "url": "https://www.reddit.com/r/thalassophobia/comments/1dqz0w4/in_case_you_needed_more_reasons/",
        "content": "Saw this video and immediately thought of this subreddit.\n\n  \n[https://youtube.com/shorts/8BiZuqJD08k?si=SC8xmT7Mu2G1skwo](https://youtube.com/shorts/8BiZuqJD08k?si=SC8xmT7Mu2G1skwo)\n\n",
        "num_comments": 0,
        "comments": []
    }
}