{
    "This is how big elephant herds used to be (1950s)": {
        "title": "This is how big elephant herds used to be (1950s)",
        "score": 8646,
        "url": "https://i.redd.it/hq1w3l70ld9d1.png",
        "content": "",
        "num_comments": 274,
        "comments": [
            "Just like the American bison.",
            "This is seriously depressing. \n\nOn a different note, with so many elephants, they would need a serious amount of food. I wonder if they were migrating between feeding areas when this pic was taken.",
            "Sad to think there will be some still alive that remember those times vividly",
            "We ruined this planet for a temporary profit. How sad.",
            "We have destroyed the natural world at a staggering rate.",
            "Something tells me todays herds are sad in numbers compared to this",
            "I dont know how to live with the existential pain and rage facts / news like this give me",
            "They said elephants will be extinct by 2050",
            "We really need to stop fighting and take better care of the planet.",
            "We really are killing this planet."
        ]
    },
    "guy tryna f* around with a baton, get to know what's up": {
        "title": "guy tryna f* around with a baton, get to know what's up",
        "score": 44,
        "url": "https://v.redd.it/x8nxpb2l3i9d1",
        "content": "this is the cleanest hook that i've ever seen.",
        "num_comments": 16,
        "comments": [
            "Whyd he hit him? Stupid.",
            "Bro was eepy so he got handed a nap",
            "He did it to himself, don't pretend you're going to hit someone they have every right to protect their body. And he was way too close, for me that's a danger flag and I'd do the same thing to ensure I'm not the one going to the hospital.",
            "Damn. That was a beautiful hook.",
            "After \"double fart Jackson says...\" I can't make out the rest...",
            "Excessive if you ask me.",
            "ah..its just my reflex action",
            "What do you mean? If you thought someone was about to bash you in the face with something you wouldn't protect yourself?",
            "Dont worry, no one is",
            "Turn your sound on and watch the video again"
        ]
    },
    "3 Connecticut Cops get ambushed during a call, 2 of them are killed before the third officer kills the shooter with a single shot from 78 feet away": {
        "title": "3 Connecticut Cops get ambushed during a call, 2 of them are killed before the third officer kills the shooter with a single shot from 78 feet away",
        "score": 7986,
        "url": "https://v.redd.it/799e704yb99d1",
        "content": "",
        "num_comments": 1439,
        "comments": [
            "This whole situation is insane... what a fucking shot from 78 feet away, I hope that man who survived has proper mental health services for the rest of his life and physical. Jesus.",
            "Where are the shots coming from? The man at the door doesn't seem to have a gun?",
            "I live next door to this house, this shit rocked our town",
            "The sick fuck literally stood over the already critically injured officer and shot him 24 more times in the face and chest. That's disturbing af. He obviously knew that he was going to die that night because why else would you place a fake ass 911 call and then gear up and position yourself so that you can ambush and murder the responding officers. He was either going out with suicide by cop or just killing himself.",
            "Holy shit. If that wasn't an auto the sheer number of times that piece of shit pulled the trigger is insane. Officers didn't have a chance. Can't imagine the survivor can continue to police after that. Brutal. RIP officers.",
            "Good shot by the surviving officer. That poor woman will never have a return to normalcy. The surviving cop will never not relive this night.",
            "78 feet away with a fkn hand gun? I don't think people realize how hard that is. That's like movie level expertise.",
            "Absolutely awful. This shit is what officers walk into these days. An officer was killed recently where I'm from after attending to a \"victim\" who ended up ambush shooting him and killing him.\n\nI know I'm not supposed to feel this way but I don't care. I'm glad the manchild who thought he was hard as fuck died by getting shot in the neck. What a fucking coward to stand over someone and shoots them 24 fucking times in the face and body. Rot in hell you miserable fucking bastard. You deserve worse.",
            "One of the sickest fucks ever. Hope they chucked his body in the woods.",
            "Video isn't working/ loading anymore"
        ]
    },
    "His skill goes crazy": {
        "title": "His skill goes crazy",
        "score": 1269,
        "url": "https://v.redd.it/6l4z6y79ha9d1",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Must have been his first attempt. He clearly didn't know how it worked.",
            "Like watching cows being put out to pasture after winter housing",
            " Fella on that Wave Race 64 shit.",
            "The whole time he's screaming \"The throttle is stuck! haaaaallp!\"",
            "Someone told him to \"Flip off\"",
            "That's not how you jetski. This guy doesn't know how to jetski.",
            "Damn whats the cc and torque on that thing?",
            "That is impressive my goodness.",
            "I knew a guy who broke his neck doing something similar...",
            "Acting like a Boxer puppy spazzing out when heading out for a walk."
        ]
    },
    "This stupid video being shared this frequently on this very subreddit": {
        "title": "This stupid video being shared this frequently on this very subreddit",
        "score": 127,
        "url": "https://v.redd.it/7vae8i1p8d9d1",
        "content": "Come the hell on",
        "num_comments": 26,
        "comments": [
            "This is getting way to often on reddit, I mean, not talking about this exact video, but for people (or bots), posting the same video/post on different subreddits and all showing at the same time",
            "It crazy how very few people realize he's holding a vape behind it..",
            "A tear gas canister can hit 300 degrees C when it's operating, those things start fires, I never thought he was inhaling tear gas.",
            "And besides, isn't it a bad idea anyhow to smoke something meant to inflict untold amounts of searing hot pain onto a rowdy crowd?",
            "And then you shared them all?\n\nOkay...",
            "The algorithm must think you are stupid,  I haven't seen it one time.",
            "Strange that yours is the only one I've seen",
            "People always bitch about how filled with bots Twitter was/is.  Ive got bad news, Reddit is also absolutely over run with bots as well.",
            "I dont get it. He looks gangster as fuck! Who cares if he is just hiding a vape?",
            "And so you shared it again? Good job dicklock"
        ]
    }
}