{
    "Diversity & Social Justice Thread - June 28, 2024": {
        "title": "Diversity & Social Justice Thread - June 28, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/thebachelor/comments/1dqhfcs/diversity_social_justice_thread_june_28_2024/",
        "content": "Please use this thread to discuss anything about or related to diversity & social justice issues. This can range anywhere from personal experience to what is happening in the world. \n\nThis thread is intended to be a safe space. Rule breaks in this thread will result in an automatic temporary or permanent ban. \n\nConversations related or unrelated to Bachelor Nation are permitted here.",
        "num_comments": 0,
        "comments": []
    },
    "Watch Party Megathread- June 29, 2024": {
        "title": "Watch Party Megathread- June 29, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/thebachelor/comments/1dr95mi/watch_party_megathread_june_29_2024/",
        "content": "Are you looking to watch this season of The Bachelorette with some fellow bachelor fans? Then this thread is for you!\n\nPlease include the location, address, and time of your watch party. If applicable, also include if people should bring food, vaccination requirements, or any other pertinent information.\n\nHappy watching!",
        "num_comments": 0,
        "comments": []
    },
    "Katie’s story and resources": {
        "title": "Katie’s story and resources",
        "score": 149,
        "url": "https://www.reddit.com/gallery/1dr8kla",
        "content": "I know there is already a post about what Katie’s been going through but I didn’t see these slides shared and I wanted to share them since they paint a clearer picture of her story and provide resources. Love to all.\n",
        "num_comments": 9,
        "comments": [
            "I have never been so proud of a stranger. It took me many years to share my story with anyone. Seriously, I'm so proud of her for her bravery. This is still just devastating.",
            "Oh my heart hurts. Hugging everyone whose heart is a little broken because the system is broken.",
            "This is heartbreaking, wishing Katie and all the people who been through peace, gosh the are no words.",
            "Disgusted and absolutely furious that this happened to her. Immensely grateful that shes talking about and sharing these resources. This will for sure help someone ",
            "So so sad for her",
            "Im so heartbroken that this happened to her (and happens to anyone). Shes so brave to be sharing her voice.",
            "I am so glad she had those amazing resources but sad that she will not receive her justice."
        ]
    },
    "Katie Thurston just revealed that she was raped 7 months ago and has just found out that she will not receive justice": {
        "title": "Katie Thurston just revealed that she was raped 7 months ago and has just found out that she will not receive justice",
        "score": 890,
        "url": "https://www.reddit.com/r/thebachelor/comments/1dqowru/katie_thurston_just_revealed_that_she_was_raped_7/",
        "content": "https://preview.redd.it/uvm6rqyfic9d1.png?width=276&format=png&auto=webp&s=8c593fe1cdf1e9924bd67e8e4cb3d88cca9b0e7a\n\n",
        "num_comments": 301,
        "comments": [
            "Heartbreaking. Thank you Katie for speaking up about it. Her platform makes others know theyre not alone. \nI was a junior in college. He was my personal trainer. I never reported it. \nMy heart breaks for Katie and all of the other women who experienced this. I am so sorry.",
            "I was raped a little more than eight years ago. It doesnt go away, but it DOES get easier. There will forever be triggers. But Im not thinking about it every hour anymore. Or even everyday. \n\nIm so sorry to Katie. And Im so sorry to all my fellow survivors here.",
            "This comment section breaks my heart. So many of us have been hurt. Love to all my survivors ",
            "Yet we never stop hearing about why survivors dont report these things. Cause they *know* the judicial system will retraumatize them all over again ",
            "As someone who agreed to stand trial in September against the massage therapist that assaulted me, this is absolutely the worst case scenario Im bracing myself for. Im so sorry she didnt receive justice. ",
            "I know many women who have been sexually assaulted or raped. Only a few were able to report. None of them got justice. None. Even when it was obvious or witnessed. To come forward and report and pursue charges is so brave, knowing what we all know. Sending her love.",
            "Who the fuck is he ",
            "I remember she said months ago something horrible happened and I was so so hoping it wasnt this. I wish her all the peace and healing",
            "This reminds me to give people grace because you never know what theyre going through behind closed doors. This doesnt surprise me as a former paralegal the conviction rate for rapists and sexual offenders is abysmal",
            "Someone I know was raped. The police wouldnt take a rape kit because its not like it would ever get processed anyways. A couple months after they came back asking for more details because other women had been attacked in the same manner"
        ]
    },
    "Jenn Tran shares advice former lead Michelle Young gave her about facing racism": {
        "title": "Jenn Tran shares advice former lead Michelle Young gave her about facing racism",
        "score": 47,
        "url": "https://www.eonline.com/news/1404471/bachelorette-jenn-tran-shares-advice-michelle-young-gave-her-about-facing-racism",
        "content": "",
        "num_comments": 7,
        "comments": [
            "I hate that Michelle even needed to give her advice and a heads up about the racism shes going to deal with it and the fact that she needed to ask. I hope shes able to stay strong and block out the hate. It has nothing to do with her its just evil people who need to get past the fact that all the bachelor and bachelorettes arent gonna all be white.",
            "Two gorgeous ladies! Happy were at a point in this franchise where they at least have each other to talk to with subject matters like this. Also makes me realize how much more difficult it mustve been for Rachel Lindsay as the first lead of color for the entire franchise.",
            "Michelle had the huge advantage that the show gave her a very favorable edit, and as a heartbroken runner up she seemed like the logical choice to be the next lead. Katie was the one who got the backlash for being picked outside of the F4. ABC really screwed over Jenn by not bringing her to F4, and by not giving her a more sympathetic edit.",
            "Michelle experienced racism regardless of her edit. The edit can only do so much when the audience just dont want to see a person of color as a lead.",
            "You're welcome! Yes, I actually copy pasta'ed the article this time instead of just linking out.",
            "As Jenn Tran began her journey, there was one member of Bachelor Nation she wanted to talk to.\n\nSo ahead of filming season 21 of The Bachelorette, taking up the mantle of being the first Asian-American to lead the franchiseshe reached out to fellow alum Michelle Young.\n\nI really wanted a perspective from a person of color and just get to know what her experience was like and where to kind of go with it, Jenn told E! News Francesca Amiker in an exclusive interview. I know that being in the limelight, you get a lot of backlash for it and racism, specifically. And I wanted to know how she handled all that and whether she thought it was worth it in the end.\n\nShe added, And she was really great with a lot of good guidance. She was like, There are gonna be haters out there, theres gonna be racism out there, but know that youre doing it for a reason and be strong-willed.\n\nIn fact, Jenn found that she and Michellewho led season 18 of the franchisehad similar approaches to their journeys, both on and off the screen.\n\nWere both in the same mindset in that we both want to keep making change happen, the 26-year-old explained. And if were the people who are spearheading that, then all the better.\n\nJenn first appeared on Joey Graziadeis season of The Bachelor, which aired earlier this year. And though she didnt find love with the tennis pro, shes eager for another shot at finding her true matchand shes grateful for the impact shes making along the way.\n\nWHAT A DREAM, she began her March 27 Instagram post following the announcement of her casting. I can not begin to explain how grateful I am and how surreal this all feels.\n\nAlso, FIRST ASIAN BACHELORETTE?! she added. Growing up I never got to see anyone who looked like me lead their own love story on TV. To be able to inspire a generation of people to be proud of their culture is something Im so grateful for.\n\nAnd while noting the opportunity is so much bigger than myself, Jenn expressed, I am so incredibly excited for this crazy adventure to find my person and I cant wait for all of us to laugh and cry together.\n\nJenns journey on The Bachelorette premieres July 8 at 8:00 p.m. ET/PT on ABC and streaming next-day on Hulu. Until then, keep reading for a refresher on the love lives of all your favorite Bachelor Nation alums.",
            "Thank you for sharing!"
        ]
    }
}