{
    "The Boys - Season 4 Episode Discussion Hub": {
        "title": "The Boys - Season 4 Episode Discussion Hub",
        "score": 414,
        "url": "https://www.reddit.com/r/TheBoys/comments/1dex9ws/the_boys_season_4_episode_discussion_hub/",
        "content": "This is the one stop shop to find all discussion threads for the fourth season of The Boys, airing Thursdays at 3am EST on Amazon Prime Video.\n\n**Season FOUR episode discussion threads:**\n\n●  [4x01 - \"Department of Dirty Tricks\"](https://www.reddit.com/r/TheBoys/comments/1despns/the_boys_4x01_department_of_dirty_tricks_episode/)\n\n● [4x02 - \"Life Among the Septics\"](https://www.reddit.com/r/TheBoys/comments/1despo3/the_boys_4x02_life_among_the_septics_episode/)\n\n● [4x03 - \"We'll Keep the Red Flag Flying Here\"](https://www.reddit.com/r/TheBoys/comments/1despo9/the_boys_4x03_well_keep_the_red_flag_flying_here/)\n\n● [4x04 - \"Wisdom of the Ages\"](https://www.reddit.com/r/TheBoys/comments/1dk5c5w/the_boys_4x04_wisdom_of_the_ages_episode/)\n\n● 4x05 \"Beware the Jabberwock, My Son\" - **Coming June 27th @ 3am EST**\n___\nWelcome back everyone for a new season of The Boys! Join the official subreddit discord server to discuss everything The Boys!!\n\n[JOIN THE DISCORD](https://discord.com/invite/Zf97hRJbAe)\n\nWe are also still accepting moderator applications. If you are interested in helping out:\n\n[APPLY TODAY!](https://docs.google.com/forms/d/1JzSvXcehhpCCrnH666Zy4P0y_mnM1NvTghq0msPAKPw/edit)",
        "num_comments": 3,
        "comments": [
            "Welcome back everyone for a new season of The Boys! Join the official subreddit Discord server to discuss everything The Boys!! \n\n\n[JOIN THE DISCORD](https://discord.com/invite/bykapbyqGY)\n\n   We are also still accepting moderator applications. If you are interested in helping out:\n\n[APPLY TODAY!](https://docs.google.com/forms/d/1JzSvXcehhpCCrnH666Zy4P0y_mnM1NvTghq0msPAKPw/edit)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheBoys) if you have any questions or concerns.*",
            "Welcome back everyone for a new season of The Boys! Join the official subreddit discord server to discuss everything The Boys!! \n\n\n[JOIN THE DISCORD](https://discord.com/invite/bykapbyqGY)\n\n   We are also still accepting moderator applications. If you are interested in helping out:\n\n[APPLY TODAY!](https://docs.google.com/forms/d/1JzSvXcehhpCCrnH666Zy4P0y_mnM1NvTghq0msPAKPw/edit)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheBoys) if you have any questions or concerns.*"
        ]
    },
    "The Boys - 4x04 \"Wisdom of the Ages\" - Episode Discussion": {
        "title": "The Boys - 4x04 \"Wisdom of the Ages\" - Episode Discussion",
        "score": 3513,
        "url": "https://www.reddit.com/r/TheBoys/comments/1dk5c5w/the_boys_4x04_wisdom_of_the_ages_episode/",
        "content": "**Season 4 Episode 4**: Wisdom of the Ages\n\n**Aired**: June 20, 2024\n\n**Synopsis**: Vought News Network is proud to announce its new series #Truthbomb! Join host Firecracker and her celebrity guests for the live 6-hour premiere as they expose Starlight’s Adrenochrome Parties!\n\n**Directed by**: Phil Sgriccia\n\n**Written by**: Geoff Aull\n\n[Join our Discord here!](https://discord.com/invite/ykYZZhHTMb)\n\n● Spoilers for the current episode and all previous episodes do not need to be marked in this post.\n\n● Spoilers for the comics and all upcoming episodes are required to be marked including trailers.\n\n● Please report any spoilers you may see in posts or comments\n\nProceed at your own risk\n\nThe episode discussion posts are where comments, observations, and reactions to the episode belong. Well thought out, in-depth discussions may deserve their own posts depending on if they have not previously been covered. Otherwise, please use the appropriate location for your discussion. A post with a title featuring one to three sentences belongs in the episode discussion posts, not its own post.\n\nhttps://preview.redd.it/d7mabg1xip7d1.jpg?width=1400&format=pjpg&auto=webp&s=19e927efbeb9f507e8217ed37365d7f537574199\n\n",
        "num_comments": 12745,
        "comments": [
            "Welcome back everyone for a new season of The Boys! Join the official subreddit Discord server to discuss everything The Boys!! \n\n\n[JOIN THE DISCORD](https://discord.com/invite/bykapbyqGY)\n\n   We are also still accepting moderator applications. If you are interested in helping out:\n\n[APPLY TODAY!](https://docs.google.com/forms/d/1JzSvXcehhpCCrnH666Zy4P0y_mnM1NvTghq0msPAKPw/edit)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheBoys) if you have any questions or concerns.*",
            "I love A Train using his powers to go from one side of the room to another",
            "Well, in an episode that highlighted the awful cycle of revenge and abuse, I thought Hughie forgiving A-Train was a pretty cool and meaningful counter.",
            "crazy how firecracker took that pedo shit to the chin and keep on pushing, actually insane 😭",
            "Goddamn, the ending with the elevator dinging and Homelander smiling was fucking eerie and unsettling as hell. Really solid way to end the episode",
            "If you think about it, killing a mans family and then sleeping with him for several months is something Reverse Flash would do",
            "Does anyone remember The Boys: Diabolical in the episode where the husband gives his wife dying of pancreatic cancer V and it gives her cancer tentacle powers.\n\nIs it possible the V Butcher took just gave power to the tumor in his brain and when it was threatened with death it lashed out and killed the aggressor.",
            "At 16, his name was The Homelander. \n\nAnd then Sean Parker told him to drop the ‘The’ \n\n“Just Homelander. it’s cleaner”",
            "Homelander was terrifying. I dont know why anyone would keep working for Vought. Seems just like a matter of time before Homelander snaps on your department.",
            "I just realized I was scared of Homelander showing up in all the A-Train scenes... even though there was no chance of that happening because of Homelander's plot this episode... maybe the most terrifying character I've ever seen."
        ]
    },
    "I like Annie but she's definitely not a good person": {
        "title": "I like Annie but she's definitely not a good person",
        "score": 1333,
        "url": "https://i.redd.it/4gpraz3ke18d1.png",
        "content": "",
        "num_comments": 338,
        "comments": [
            "Welcome back everyone for a new season of The Boys! Join the official subreddit Discord server to discuss everything The Boys!! \n\n\n[JOIN THE DISCORD](https://discord.com/invite/bykapbyqGY)\n\n   We are also still accepting moderator applications. If you are interested in helping out:\n\n[APPLY TODAY!](https://docs.google.com/forms/d/1JzSvXcehhpCCrnH666Zy4P0y_mnM1NvTghq0msPAKPw/edit)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheBoys) if you have any questions or concerns.*",
            "That’s the point. No one on the show is purely anything. It’s all gray like any person in real life is. It’s just amplified because she’s a supe",
            "Well, yes, but you just don't do what they are doing without having your hands dirty",
            "The Gecko situation is I agree pretty much wholly fucked. \n\nThe carjacking tho contains more. Annie while not intending to did kill a guy, she definently commited manslaughter. However the only reason the situation developed as it did was cause of Butcher. He brandished a weapon, escalated and deliberately agitated both Annie and the driver. Annie is responsible for his death but the only reason that occurred is cause Butcher is a callous ass.",
            "That's the whole point of The Boys: to bring accountability to the supes. Most of them have no training, there seems to be almost no protocol to rescue civilians / hostages (if there is, they don't follow since there will be a clean up crew and PR team to sweep it under the rug), ...",
            "According to this episode, Annie is close to maxing out her credit card too.\n\nWhat a horrible person!",
            "y’all think you’d be butcher but you’d be one of the general public idiots whose opinions get swayed by vought’s propaganda",
            "People who are watching and keeping score of who is a “good person” or “bad person” are doing it wrong.  There’s no such thing as an objectively “good person” in the show or real life.  These posts with some kinda “gotcha!” as a way to tear down a character aren’t particularly insightful. \n\nAnnie is presented as someone trying to navigate the situations she finds herself as best she can.  She’s made mistakes, and her hands aren’t clean.  No one’s hands on this show are clean - it’s a f***ed up, sick world they inhabit.  Characters are messy and complex (like real people) - depth and insight is found by embracing the grey, and the contradictions that they represent.",
            "Okay, first, having an abortion isn't anything you get to judge the right or wrongness of.  \n\nI am glad the show didn't make it into something she did behind Huey's back and have him find out that way as it would have been the worst manufactured conflict with them yet.\n\nBut the entire point was that wasn't even something wrong that she did, yet she's more vilified for it than if Firecracker gave her real reason for hating Annie.  Because the argument is not whether or not Annie has done bad things, Firecracker is a literal manifestation of a bad thing she did in the past and is paying for now.  In case you haven't noticed it's kind of the overarching theme of season 4.  Frenchie falling for a man whose family he slaughtered, Huey's mom coming back to the family she abandoned, Huey after not having been there for his dad in recent seasons now not being trusted to make decisisons about his health, Kimiko running into a girl she helped abduct, just to name a few.",
            "Man’s dropping Truth Bombs out here"
        ]
    },
    "She really was like \"what's 17 more years?\"": {
        "title": "She really was like \"what's 17 more years?\"",
        "score": 3831,
        "url": "https://i.redd.it/bvxk0atsqz7d1.jpeg",
        "content": "",
        "num_comments": 469,
        "comments": [
            "Welcome back everyone for a new season of The Boys! Join the official subreddit Discord server to discuss everything The Boys!! \n\n\n[JOIN THE DISCORD](https://discord.com/invite/bykapbyqGY)\n\n   We are also still accepting moderator applications. If you are interested in helping out:\n\n[APPLY TODAY!](https://docs.google.com/forms/d/1JzSvXcehhpCCrnH666Zy4P0y_mnM1NvTghq0msPAKPw/edit)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheBoys) if you have any questions or concerns.*",
            "Idk how the seven can possibly keep up appearances when one of their own keeps getting her shit rocked",
            "Getting tossed by a drunk Kimiko.\n\nGetting knocked out by Butcher.\n\nAnd now this.\n\nDamn, she a victim.",
            "\"WHAT WILL YOU HAVE AFTER 500 YEARS IN PRISON?!\"\n\n\"Fans...I'll still have fans.\"",
            "\"I thought you were stronger\"- Starlight",
            "What was her power again?",
            "This needs a “The Hangover” title added to it lol",
            "She got invincible’d lol.",
            "Honestly think that Firecracker had no idea that Starlight was going to beat the living shit out of her. She was about to say debate before she got her clock rung. I wonder if she's smart enough to realize that this was Sage's intention all along?",
            "Wop wop wop wop \n\nAnnie fuck her up"
        ]
    },
    "💀💀💀": {
        "title": "💀💀💀",
        "score": 4349,
        "url": "https://i.redd.it/u6ivlu3sbz7d1.jpeg",
        "content": "",
        "num_comments": 268,
        "comments": [
            "Welcome back everyone for a new season of The Boys! Join the official subreddit Discord server to discuss everything The Boys!! \n\n\n[JOIN THE DISCORD](https://discord.com/invite/bykapbyqGY)\n\n   We are also still accepting moderator applications. If you are interested in helping out:\n\n[APPLY TODAY!](https://docs.google.com/forms/d/1JzSvXcehhpCCrnH666Zy4P0y_mnM1NvTghq0msPAKPw/edit)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheBoys) if you have any questions or concerns.*",
            "Keep Ryan away from her",
            ">P,C\n\n>C,P",
            "\"Deep got a weird case why is he around?\"",
            "With Stormfront we could make a Venn diagram",
            "What do you mean!? Firecracker said that Sage is one of the good ones! She clearly has many many black friends. Propaganda smh i'm sure you're with those Zionist minions!",
            "Rap Cist",
            "Fire Cracker makes the Deep look like a reformed man, holy shit.\n\nJust… every white trash thing turned up to 11.",
            "Even if it was consensual the kid was a minor, legally that constitutes statutory rape.",
            "Someone cooked here"
        ]
    }
}