{
    "Diversity & Social Justice Thread - June 28, 2024": {
        "title": "Diversity & Social Justice Thread - June 28, 2024",
        "score": 0,
        "url": "https://www.reddit.com/r/thebachelor/comments/1dqhfcs/diversity_social_justice_thread_june_28_2024/",
        "content": "Please use this thread to discuss anything about or related to diversity & social justice issues. This can range anywhere from personal experience to what is happening in the world. \n\nThis thread is intended to be a safe space. Rule breaks in this thread will result in an automatic temporary or permanent ban. \n\nConversations related or unrelated to Bachelor Nation are permitted here.",
        "num_comments": 0,
        "comments": []
    },
    "Katie Thurston just revealed that she was raped 7 months ago and has just found out that she will not receive justice": {
        "title": "Katie Thurston just revealed that she was raped 7 months ago and has just found out that she will not receive justice",
        "score": 840,
        "url": "https://www.reddit.com/r/thebachelor/comments/1dqowru/katie_thurston_just_revealed_that_she_was_raped_7/",
        "content": "https://preview.redd.it/uvm6rqyfic9d1.png?width=276&format=png&auto=webp&s=8c593fe1cdf1e9924bd67e8e4cb3d88cca9b0e7a\n\n",
        "num_comments": 291,
        "comments": [
            "https://preview.redd.it/6e672viomc9d1.jpeg?width=599&format=pjpg&auto=webp&s=f2c67473407405fa41f957d48f9c1a63288c59d9\n\nI said this like a mantra after I was raped, eight years ago. I’m sharing in case it helps anyone else. ❤️",
            "Heartbreaking. Thank you Katie for speaking up about it. Her platform makes others know they’re not alone. \nI was a junior in college. He was my personal trainer. I never reported it. \nMy heart breaks for Katie and all of the other women who experienced this. I am so sorry.",
            "I was raped a little more than eight years ago. It doesn’t go away, but it DOES get easier. There will forever be triggers. But I’m not thinking about it every hour anymore. Or even everyday. \n\nI’m so sorry to Katie. And I’m so sorry to all my fellow survivors here.",
            "This comment section breaks my heart. So many of us have been hurt. Love to all my survivors 🩷🩷🩷🩷",
            "The court system can re-traumatize survivors, especially so when there’s no justice. \n\nI’ll bet it felt really satisfying for her to post his picture, she got to take some of her power back with that; and I’m sure a lot of us can feel satisfaction vicariously about that one part. She may have done it in a moment of fed-up/ desperation but it’s really brave and strong and I think it’ll speak to and help a LOT of people.\n\nWhen courts aren’t doing anything but making it worse, I wish we could all take that power back in a way like this: exposing the person for who they are, and without a shitty retaliatory response like a defamation suit that even further re-traumatizes.",
            "As someone who agreed to stand trial in September against the massage therapist that assaulted me, this is absolutely the worst case scenario I’m bracing myself for. I’m so sorry she didn’t receive justice. 💔",
            "Yet we never stop hearing about why survivors don’t report these things. Cause they *know* the judicial system will retraumatize them all over again 😡",
            "i’m so sorry to see this. i didn’t report either of the men who assaulted me - she was so brave to press charges and go through this process. i hope she has her people around her for support and takes care of herself this weekend ❤️",
            "I know many women who have been sexually assaulted or raped. Only a few were able to report. None of them got justice. None. Even when it was obvious or witnessed. To come forward and report and pursue charges is so brave, knowing what we all know. Sending her love.",
            "Who the fuck is he 🤬"
        ]
    },
    "It's gonna be a good season": {
        "title": "It's gonna be a good season",
        "score": 177,
        "url": "https://v.redd.it/cpw6ijp2rd9d1",
        "content": "I haven't been this excited for a bachelorette season since Rachel Lindsay. Jenn is gonna be so great!",
        "num_comments": 38,
        "comments": [
            "jenn like\n\n![gif](giphy|j5uEVYERR0ncYlJ36e|downsized)",
            "lol @ her eavesdropping",
            "the eavesdropping 💀",
            "\"If somebody is here for the wrong reasons...\" \n\nI'll save you some time. Nobody is there solely for a relationship.",
            "I don't think I've seen promotions so centered around specifically the lead and how this will be her journey. Jenn really will be the star and main character of this season and I'm here for it!",
            "the eavesdropping is so funny. july 8th cant come fast enough!",
            "def love the looks of the trailer. jen deserves this im so happy for her ❤️",
            "Ooh I like her reactions to the guys esp on couch and while eavesdropping, she’s owning her role!, trailer did its job, I’m excited for the season! Lol also that’s saying something too bc I wasn’t really before but obvs bc it’s Bachelorette I’d watch regardless. \n\nEta: also how do y’all know the names of the guys already lol you really prep huh, I’m going into it with no knowledge except for one cute guy that looks like a math teacher but has a health smoothie supplement co or something",
            "If your name is Thomas make no mistake the producers will villify you haha",
            "Jenn's really is super pretty, isn't she? She looks like a Disney star who grew up to be an unproblematic adult."
        ]
    },
    "Rachel Lindsay Learned Bryan Abasolo Had Filed for Divorce 'Via Text Message': 'I Was Shocked'": {
        "title": "Rachel Lindsay Learned Bryan Abasolo Had Filed for Divorce 'Via Text Message': 'I Was Shocked'",
        "score": 214,
        "url": "https://people.com/rachel-lindsay-learned-bryan-abasolo-had-filed-for-divorce-via-text-message-8671233",
        "content": "In a June 26 filing, the former Bachelorette claims that she discovered Abasolo had filed for divorce on January 2 \"via text message\" — and she included a screenshot of the conversation to prove it.\n\nIn documents obtained by PEOPLE, Lindsay, 39, claims that she and Abasolo, 44, \"had a conversation in my kitchen during which he failed to mention that he had filed for divorce\" on the same day that he eventually filed.\n\n\"Approximately 30 minutes after he left the house, he sent me a text message that simply read 'Hey ... I just wanted to let you know that I officially filed,'\" Lindsay claims.\n\nThough she knew that she and the chiropractor — who she met and got engaged to on season 21 of The Bachelorette — \"were separating and would be headed toward divorce,\" she said she was \"shocked\" to be informed that he'd officially filed over text.\n\nShe noted that their \"prior conversations\" had been \"amicable\" and the two had discussed how to navigate filing for divorce in a way that \"would not attract media attention.\"\n\nIn the screenshot Lindsay provided, Abasolo texted her at 11:43 a.m. on Jan. 2, \"Hey...I just wanted to let you know that I officially filed.\"\n\n\"Wait what?\" she responded. Later that night, she stopped sharing her location with Abasolo, per the screenshot.\n\nLindsay claims that she \"tried to talk to Bryan about the divorce in order to settle this matter swiftly and amicably, but he was not interested.\"\n\n\"He informed me in no uncertain terms that everything must go through lawyers. He has not made any effort – reasonable or not – to resolve this matter with me,\" she says in the filing.\n\nIn the initial divorce filing, Abasolo cited \"irreconcilable differences\" as the reason for the divorce after four years of marriage. In a since-deleted post on Instagram, he called the separation a \"difficult decision,\" as he said, \"Sometimes loving yourself and your partner means you must let go.\"",
        "num_comments": 160,
        "comments": [
            "> Later that night she stopped sharing her location \n\nWhy did this make me lol",
            "I actually think this is a perfect example of social media being indicative of where a relationship is at for influencers. They never posted together and didn’t live together for quite a while, and Rachel insisted they just kept their relationship private. But now she’s saying they hardly went on dates and didn’t even fly the same class and it sounds like they weren’t just keeping things private they just didn’t have anything worth showing off on social media",
            "Let this be a reminder to everyone: your ex is not on your team. The moment you decide to split, your ex is focused on themselves.",
            "She knew it was happening just not when.  Finding out it was filed that way stinks.  But it wasn’t a real surprise that it happened.\n\nBoth wanted out in a way that benefited themselves the most",
            "😬The more I learn about their divorce, the less I actually want to know.",
            "I feel like Bryan doing this over text is the epitome of: “I’m sorry. I can’t. Don’t hate me.” \n\nIYKYK",
            "So many people on the sub called out the weirdness of them never spending time together. Rachel was always traveling for work and going to events without Bryan. The excuse was him being busy with work or maybe not being as social as her. Now we find out they really didn’t spend any time together, never went on dates, and didn’t even sit together on some flights. \n\nThis was from last year \n\nhttps://www.reddit.com/r/thebachelor/s/zHotjR9st3",
            "Finding out over text that your husband filed for divorce sucks. But I don’t blame Bryan at all for wanting to keep things going through the lawyers. That’s just smart in any divorce dealings.",
            "I’m having a hard time understanding how Rachel went along with their situation as long as she did. She defended him and he never deserved it. After reading how little time they actually spent together while married, I’m confused why they ever decided to tie the knot.",
            "She tried so hard to make us believe they were soulmates, in love, etc. Now look at them 👀Never liked his plastic ass"
        ]
    },
    "Jenn Tran shares advice former lead Michelle Young gave her about facing racism": {
        "title": "Jenn Tran shares advice former lead Michelle Young gave her about facing racism",
        "score": 24,
        "url": "https://www.eonline.com/news/1404471/bachelorette-jenn-tran-shares-advice-michelle-young-gave-her-about-facing-racism",
        "content": "",
        "num_comments": 4,
        "comments": [
            "As Jenn Tran began her journey, there was one member of Bachelor Nation she wanted to talk to.\n\nSo ahead of filming season 21 of The Bachelorette, taking up the mantle of being the first Asian-American to lead the franchise—she reached out to fellow alum Michelle Young.\n\n“I really wanted a perspective from a person of color and just get to know what her experience was like and where to kind of go with it,” Jenn told E! News’ Francesca Amiker in an exclusive interview. “I know that being in the limelight, you get a lot of backlash for it and racism, specifically. And I wanted to know how she handled all that and whether she thought it was worth it in the end.”\n\nShe added, “And she was really great with a lot of good guidance. She was like, ‘There are gonna be haters out there, there’s gonna be racism out there, but know that you’re doing it for a reason and be strong-willed.’”\n\nIn fact, Jenn found that she and Michelle—who led season 18 of the franchise—had similar approaches to their journeys, both on and off the screen.\n\n“We’re both in the same mindset in that we both want to keep making change happen,” the 26-year-old explained. “And if we’re the people who are spearheading that, then all the better.”\n\nJenn first appeared on Joey Graziadei’s season of The Bachelor, which aired earlier this year. And though she didn’t find love with the tennis pro, she’s eager for another shot at finding her true match—and she’s grateful for the impact she’s making along the way.\n\n“WHAT A DREAM,” she began her March 27 Instagram post following the announcement of her casting. “I can not begin to explain how grateful I am and how surreal this all feels.”\n\n“Also, FIRST ASIAN BACHELORETTE?!” she added. “Growing up I never got to see anyone who looked like me lead their own love story on TV. To be able to inspire a generation of people to be proud of their culture is something I’m so grateful for.”\n\nAnd while noting the opportunity is “so much bigger than myself,” Jenn expressed, “I am so incredibly excited for this crazy adventure to find my person and I can’t wait for all of us to laugh and cry together.”\n\nJenn’s journey on The Bachelorette premieres July 8 at 8:00 p.m. ET/PT on ABC and streaming next-day on Hulu. Until then, keep reading for a refresher on the love lives of all your favorite Bachelor Nation alums.",
            "I hate that Michelle even needed to give her advice and a heads up about the racism she’s going to deal with it and the fact that she needed to ask. I hope she’s able to stay strong and block out the hate. It has nothing to do with her it’s just evil people who need to get past the fact that all the bachelor and bachelorettes aren’t gonna all be white.",
            "Thank you for sharing!",
            "You're welcome! Yes, I actually copy pasta'ed the article this time instead of just linking out."
        ]
    }
}