{
    "The Division 2 - Y5S3 Community Survey": {
        "title": "The Division 2 - Y5S3 Community Survey",
        "score": 0,
        "url": "https://www.reddit.com/r/thedivision/comments/1dp8f4q/the_division_2_y5s3_community_survey/",
        "content": "#Y5S3 Community Survey\n\nTell us what you think about Year 5 Season 3: Vanguard by completing our short survey. Click the link to share your experience and help us improve!\n\n&nbsp;\n\nSurvey link: https://forms.office.com/pages/responsepage.aspx?id=htMb4FH6EEKipCnlq296scegqqRaCs9BodidEcGroZNUNllPUDlSNVcyRjBKRU9LU01YS1A5MktLRyQlQCN0PWcu",
        "num_comments": 25,
        "comments": [
            "Survey...why exactly? We all know nobody's going to listen anyway.",
            "Manhunts are busy work designed to distract you from the daily grinding. Y6S2 will be that plus forcing you to play a character you dont want to. Just a hot garbage mess. The game would be better without manhunts at this point.",
            "Do you need a survey?\n\nLook the reddit posts since they announced Season 2.0.",
            "Big No to seasons 2.0",
            "Oh, goodie! More ways to be ignored!",
            "Alright. Nobody say I use Aegis + Mosquito as my primary gear.!",
            "Always fun to see who's paying attention - the survey is about *last* season.",
            "well, I told them it's working really well that Y5S3 doesn't have seasonal characters",
            "\"How likely are you to recommend Tom Clancy's The Division 2 to a friend or colleague?\" - Well.. with seasonal characters? Not at all likely.",
            "Not that it will be taken onboard but I gave my thoughtstold them not to go ahead with Seasons 2.0."
        ]
    },
    "Daily Thread - Fashion Friday": {
        "title": "Daily Thread - Fashion Friday",
        "score": 2,
        "url": "https://www.reddit.com/r/thedivision/comments/1dqhz3w/daily_thread_fashion_friday/",
        "content": "Greetings Agents!\n\nYou're getting ready for a fun weekend, with time off from a long week of commitments. It's time to get your agent geared up and ready for action.  And it's time to show the community your drip.\n\nWhether it's a tacticool look, or your scuba and flipflops, bring it on.  Trying to recreate a faction look? We'll rate it!   \n\n---\n\n**Rules:**\n\n* Post pictures of your agent, decked from head to toe, from The Division.\n\n* No down talking, we all have different looks we care about. If you don't like someone's look, move on, or make a suggestion in a friendly manner.",
        "num_comments": 3,
        "comments": [
            "This reminds me of one video of a robber who got a job at the bank but still wearing the sock on his head XD You look like an Outcast who finally found his way into the army and became high ranking officer but still wears the same mask from his Outcast days haha",
            "Besides doing missions, raids and incursions my character is also a Victoria secrets model\n\nhttps://imgur.com/a/K5bBqGX",
            "https://preview.redd.it/g9i219prgg9d1.jpeg?width=724&format=pjpg&auto=webp&s=70f9600176d098362ef952a4e270d5e56a1bf3f3"
        ]
    },
    "Trying a high health build with clutch": {
        "title": "Trying a high health build with clutch",
        "score": 6,
        "url": "https://www.reddit.com/r/thedivision/comments/1dr71ik/trying_a_high_health_build_with_clutch/",
        "content": "https://preview.redd.it/xkhcai477h9d1.png?width=1600&format=png&auto=webp&s=1f3d33df06008a27b34425d390c5e4f8668703db\n\nJust trying to build a high health and see if clutch can make up for it, still not viable as we don't have that sweet health on hit, but at least can tank little bit of damage before I go down, also 30% health on kill is my savior",
        "num_comments": 13,
        "comments": [
            "Interesting build. Sounds like just using firewall or HF with anything else would be better tho",
            "High health is actually okay. As youve demonstrated, you can get to 2m total HP on a 6 red, which makes a big difference to your overall ability to output damage without the need for Armor cores.",
            "Very cool line of thought, it's a shame Health is such a bad stat. \n\nI think all armor regen/armor on kill should apply to armor and health. (Not sure if that would really save it though..)",
            "Agreed. Made a high health build, it worked somewhat, was very very slow to do anything",
            "sadly, yes, but I wish they bring back health on hit, to at least shake the meta again",
            "yep, it just kinda jarring after a long time to let my agent eat some bullets without armor lol, but yes, surprisingly I can play heroic on solo (havent tried grouped yet) and just tried cp4 a while ago, and its kinda good\n\nits a mix of run and gun and cover to cover gameplay playstyle, at least with how I do it",
            ">  the devs now probably dont know to remove any of the old systems remaining mechanics\n\nthe problem is that the number of stats, talents, whatever in this game is not based on functionality, as in add this or that to provide worthwhile functionality, but mainly to feed rng. that's why there's so much completely useless stuff and never even a hint of removing any of it.",
            "I was there 3000 years ago, hence i make this build to at least make it like the good ol days\n\nhealth was really OP, most people don't realize that they aren't really one shot to down, but they have invincibility window everytime they hit 0 health, and that invincibility window is the reason why old clutch was the king, making you to have health on crit",
            "Berserk/Clutch was the bomb in Gear 1.0.\n\nPeople would go mad if you healed them in the raid, youd just let your little seeker healer go wild, ahh the glory days.",
            "yep, actually this build is useless due to the 100% health on kill of hunter's fury\n\nthough at least I won't die when my agent is armor stripped lolol\n\nif we only can have health on hit again, health stat will be great"
        ]
    },
    "I want the One Arm Sling back. I wish this was an option to choose for your gear.": {
        "title": "I want the One Arm Sling back. I wish this was an option to choose for your gear.",
        "score": 119,
        "url": "https://i.redd.it/p6zl21mbpb9d1.png",
        "content": "",
        "num_comments": 35,
        "comments": [
            "They would have to rework all the cosmetics and gear to accommodate the diagonal chest strap.  Not going to happen for this game, but perhaps for Div 3.",
            "Sling bags are great if you like to get your carotid/jugular jammed up constantly, they're great casual bags, but horrible tactical bags.",
            "I was just thinking the same",
            "The sling should be a 7th gear piece. I will die on this hill.\n\nOops, I didn't see you meant backpack. Still, I stand by my statement.",
            "I hated the 1 arm sling because I know what its like to run in a one arm sling pack, it sucks. So it seems like a good agent would never opt to use an unsecured bag. I know division is a pseudo fantasy game but this is just my opinion.",
            "I want to know where you see that van with a full set of headlights and tail lights?",
            "yep, they already made the hunter's fury backpack, but it is funny it has second strap like a normal backpack while being a single strap backpack design",
            "Lore wide it make sense  sling bad where the bugout bag of division 1. Made for a quick reaction type mission. Division 2 is more for the long run. So advanced backpack make more sense ",
            "I bought a sling backpack for school, then eventually went back to a standard two-strap backpack because of how annoying and uncomfortable they actually were..\n\nBut you can't deny how cool and uniquely aesthetic they had become to the franchise, which was why I bought it in the first place lol",
            "It would be a problem, it would clip on many armor in game. I think they could implement this on an outfit. Like if you equip an outfit it also changes the backpack appearance."
        ]
    },
    "Global events 2024???": {
        "title": "Global events 2024???",
        "score": 1,
        "url": "https://www.reddit.com/r/thedivision/comments/1draztq/global_events_2024/",
        "content": "Any news when global events will return to division (1) in 2024? ",
        "num_comments": 2,
        "comments": [
            "I mean most of us have got the hint now.",
            "Nothing so far"
        ]
    }
}