{
    "Bapa’s Secret to Success": {
        "title": "Bapa’s Secret to Success",
        "score": 1154,
        "url": "https://v.redd.it/f2sdm9p21c8d1",
        "content": "",
        "num_comments": 79,
        "comments": [
            "LMAO gawd dawlg ygot me good brotha ",
            "My compliments to the fry cook on this one!",
            "Youd be surprised how good his hawk tuah is.",
            "Bapa cant help himself inytime he goes to Awlstin.",
            "It's no flaming young but this was a good appetizer, B.",
            "You one of the thousand?",
            "This needs to be the closing arguments on why AI should be permanently banned",
            "Hawk Tuah Me To My Trugg",
            "Lol that one's gonna make the rounds",
            "He happened upon the strategy while trying to pronounce \"octagon\" on air."
        ]
    },
    "Schaubzilla": {
        "title": "Schaubzilla",
        "score": 344,
        "url": "https://v.redd.it/nv82y29i9r8d1",
        "content": "",
        "num_comments": 34,
        "comments": [
            "Way sceerier than the real Godzilla\n\nGodzilla: Minus Talent",
            "Shout out to that one comedian who memorized gringo papi word for word and performed it on stage",
            "Cats making the Gringo Papi watchable. Beast of a Wilhelm scream b.",
            "This is fucking great b.",
            "Im still trying to figure out the whole tweaker Johnson and Johnson bit. Im just a civilian tho b",
            "Gahw dogg ya Stephen Spillburrgg b?",
            "The guy opening the door ",
            "Fuggin neggflix b\n\nYou're due for a promotion",
            "I was waiting for beans cheese beans Cheese to come shooting out of the turret gun",
            "chef, this is a masterpiece. you got the week off "
        ]
    },
    "One Last Bridge to Burn....": {
        "title": "One Last Bridge to Burn....",
        "score": 120,
        "url": "https://i.redd.it/czy24lgo6h9d1.jpeg",
        "content": "DO NOT GO TO THIS FACEBOOK POST AND CHECK THE CAWLMENTS.",
        "num_comments": 82,
        "comments": [
            "A 53 juiced up gorilla with nipples like a sharpened pencil vs a 62 awldonis with late stage CT, truly a war of redaction.",
            "Straight up wrasslin? I think people be surprised",
            " I doubt Brenda has that voilent dna needed to kill",
            "I think toe would probably agree",
            "I mean hes obviously right, but why would he bring that up?",
            "Hed tee off on em",
            "As much of a redact he is, he would.",
            "Will Rogans head ever stop growing?",
            "Rogan is on a different level though. he'd get in Brandon's head by suggin his own digg while not breaking eye contact. Brandon would be flooded with questions like does it feel like getting a bj or giving one? then bam sissy kick to the back of the dome.",
            "He'd use Toe as a gnome-shaped butt plug."
        ]
    },
    "Will Sasso asks Brenda why he doesn't like homeless cats in italian lmao (gatto senzatetto)": {
        "title": "Will Sasso asks Brenda why he doesn't like homeless cats in italian lmao (gatto senzatetto)",
        "score": 861,
        "url": "https://streamable.com/29y4jk",
        "content": "",
        "num_comments": 147,
        "comments": [
            "Move over General Lee, Commander and Chief Sasso has entered the chat",
            "100% a troll job LMAO. Sasso is a bbbbbbeast",
            "Bapa isnt gonna be too happy when he finds out about this",
            "Mama Mia! Commendatore el President Sasso!",
            "Hahah this is wonderful. Sasso is way too funny to be associated with these two bozos.",
            "Oh goddamn this is good",
            "As a homeless cat I thank'm\n\n![gif](giphy|OaNtfLLzPq4I8|downsized)",
            "TMP was great because of Sasso. Great on Mad TV, legend.",
            "I swear, if this doesn't get pinned I'm deleting reddit for 30 min",
            "Subsequently, BS shits on Sasso on GH. Once again saying the quiet part out loud. This waterheaded moke criticizing Sassos choices is pure oblivious stupidity. redundant redundant redundant redundant redundant , I know."
        ]
    },
    "There’s always a home": {
        "title": "There’s always a home",
        "score": 202,
        "url": "https://i.redd.it/9ep75uldef9d1.jpeg",
        "content": "How long till this fella finds his way over to Thiccc Boy Studios?  aka The Protective Custody section of YouTube. ",
        "num_comments": 40,
        "comments": [
            "Miner chasers are all ways well cum at thicccboy stews",
            "Theyll repurpose the Haters Will Say set for him.",
            "Holy shit that would be hilarious. Amirite <city>\n\n* slaps mic on thigh *",
            "I was a 360 no scoper all my life AVGN was my norf star",
            "Golden hour newest Co host",
            "Dr diddly and Chris d'fiddler, ray pest and Brenda schlob... What a line up",
            "ur talking bout the dock tear",
            "That dude seemed corny and creepy to me when he first started that schtick.  The people that become internet famous would be basement dwellers if not for streaming. Its so crazy but you have to consider their fanbases",
            "is this hawk tuah or something why does it keep showing up",
            "New plastic leather jacket: unlocked"
        ]
    }
}