{
    "I've been told on here that I look like I do hard dr*gs and dr*nk on the daily so what can I do to change that. I am trying so hard to improve my skin but still haven't had any luck. All is welcomed ": {
        "title": "I've been told on here that I look like I do hard dr*gs and dr*nk on the daily so what can I do to change that. I am trying so hard to improve my skin but still haven't had any luck. All is welcomed ",
        "score": 451,
        "url": "https://www.reddit.com/gallery/1dr0cip",
        "content": "For the record I've never done dr*gs or have dra*k  alcohol ever so I don't know why people think that I do those things and on the daily. ",
        "num_comments": 257,
        "comments": [
            "I think that hair colour is draining your face of colour. I think your natural brown or a zhuzhed up version, like medium golden brown, or even just strawberry blonde would bring more warmth to your skin tone.",
            "Stay away from those horrendous rating subreddits. They’re cesspools of misogynist hate; they’re full of men who’ve made a hobby out of tearing down women because they hate themselves and their lives. You are literally so beautiful.",
            "Change your hair colour maybe different shade of blonde, or even brown",
            "Try not lining your bottom eye waterline and maybe a warmer blonde or autumn hair color?",
            "It’s because your hair color is making you look really pale and washed out. I would go back to brunette or at least a warmer honey blonde",
            "I took a look at your profile and you made a post in a subreddit dedicated to an eating disorder, it is most definitely affecting your appearance in a negative way and is hard to deal with mentally, no products or tips can fix a problem that is deeply rooted. That being said, I do not say this to judge, my words cone from a place of understanding and compassion",
            "I'd suggest a more natural hair color and no eyeliner in the waterline. You are stunning btw !",
            "Maybe a different hair colour! These kinda wash you out instead of giving you a glow. A cut or style which gives you more volume would probably also help.",
            "I think that gaining weight and putting on some muscle would have a positive impact.",
            "Korean skincare has worked wonders for me because it emphasizes moisture and has fewer ingredients that irritate my sensitive skin. \n\nI think the shade of blonde might also be washing you out and contributing to that perception?"
        ]
    },
    "I really don't like the way I look. How can I look better? I'm 29F and I know I look much older": {
        "title": "I really don't like the way I look. How can I look better? I'm 29F and I know I look much older",
        "score": 363,
        "url": "https://www.reddit.com/gallery/1dqq2ho",
        "content": "",
        "num_comments": 179,
        "comments": [
            "I think the first 4 pics are aging you because you are in \"old person pose\". Staring straight and without any expression. You look much younger and your age in the latter pics with the blue dress and the mirror selfie pose. Also, like another commenter said, change up your hair a little! Layers, highlights, something that frames your face more. You have nice skin and features.",
            "I think you might try clothing in colors that enhance your skin tone and hair color.  You have a lovely skin/hair color combo.   But I think pale powder blue doesn’t work with your skin tone, but that same dress in magenta or a deep rose/jewel tone green or purple?  You’d be really rocking it and looking 🔥.  Same with shirts- have you tried lighter (white/off-white/light gray) t-shirts). That dark gray/black t shirt is also not optimal for your skin tone and hair color— it looks harsh.   But I think lighter colors would go great with you hair.",
            "Honestly, I think you’re very pretty and minor changes like eyebrow shaping, curling your lashes, wearing mascara and a little lip product would help you achieve what you’re looking for. Find a good eyebrow waxer or threader in your area and making consider getting them tinted as well. Eyebrows frame your face and they make all the difference! \n\nBut I really don’t think you look older and you have very beautiful hair!",
            "I would suggest for you to start playing more with your clothes. Accessories make a big difference. You're really pretty already so it shouldn't be hard. I also agree that maybe a trendier hairstyle would be nice, but maybe keep it long.\nBut the most important, your attitude, just feel like the sexy human you are 🥰",
            "Shape your eyebrows and get a lash lift.  Consider therapy; you are being overly critical of yourself. ❤️",
            "you're so pretty! I'd change the hairstyle, like try a middle part maybe. pluck your eyebrows. and regarding to clothing i'd just go on pinterest or tiktok and check some outfits. always dress up as if you're going to run up to an ex lmao, confidence is key. Try straightening your hair for special ocasions , actually you could just experiment in general with your looks. makeup, hair, clothes.",
            "You’re super cute, and I say that as someone who is 20. I think wearing your hair down like in picture 4 makes you look more youthful, especially because your hair is so pretty. I would also recommend maybe trying different clothes or accessories, as what you wear can drastically change how old anybody looks. Also, I wouldn’t worry about your face too much. You look how everyone looks without makeup in normal lighting.",
            "You seem to be really curvy tbh you should wear clothes that show off your figure (only if you are comfortable with that ofc) also get color tested I think more pastels would look lovely on you",
            "I don’t think you look older than 29. I think you look pretty also.",
            "Eyebrow shaping, and maybe try out different hairstyles, I think wispy curtain bangs would look great on you"
        ]
    },
    "What it means to be a “girls girl”": {
        "title": "What it means to be a “girls girl”",
        "score": 30,
        "url": "https://www.reddit.com/r/TheGirlSurvivalGuide/comments/1dr5pj6/what_it_means_to_be_a_girls_girl/",
        "content": "I recently went out with some coworkers and I’ve always felt a strange vibe from one of them. I had it confirmed when it was briefly brought up that a male coworker had hit on me and it had me feel very uncomfortable. Regardless of whether that man was explicitly creepy or not, I was uncomfortable. And that’s what matters. I was uncomfortable. End of story. And rather than listen to my side, understand my story, or even ask what had happened, this girl instead chose to say “well you should get used to that and handle it better. You can’t just make things awkward every time it happens.” I don’t think accepting that I’ll be made uncomfortable by male advances in the workplace is correct.  \n\nIt just astonished me that this person had done nothing to recognize my situation or learn about the circumstances and yet still felt the need to tell me that the awkward situation afterward was my fault. I think being a girls girl isn’t about excusing female behavior or condoning every action, but rather understanding the fear and discomfort we women feel in life. There has to be an understanding about what women deal with and how it’s universal, and then how to move forward. We shouldn’t be expected to just “deal with it”. \n\nIt’s so dissapointing when some women roll their eyes at situations where they’ve been in before and now have learned to navigate. This doesn’t help others at all and instead furthers the misogyny. We should listen first always, and then choose how to proceed. ",
        "num_comments": 4,
        "comments": [
            "She's a well-trained agent for the opposition. Disengage completely, only engage when necessary. These are the types of folks who will put you in a situation to be assaulted and then have Olympic-level mental gymnastics to hammer home how it was your fault, while getting off on the whole ordeal. If you are more attractive than her, she wants to see you punished for it... same as the \"red pill incel\" dudes, you are out of their league so you must suffer for it and be \"humbled\" into your place below them. The whole thing is sick.",
            "they're jealous. that's what they are. they're the reason I hesitate before I bring up such situations, \"well at least you get attention\".\n\nI usually distance myself from them.\n\n💯💯💯 not everyone knows how to navigate such situations at the start.",
            "Wow, that's so annoying, and frankly rude as hell. I'm so sorry you had to go through that, *all of us* should be supporting and uplifting each other. Like you said, no this does not mean just excuse every action women make if it's bad just because they're women, however this is not one of those moments. The cognitive dissonance to be a woman furthering the patriarchy is astounding, so just remember that this girl is legit slow as hell, fuck women like this. Period. She's a damn Serena (handmaid's tale reference). You didn't do anything wrong girl, keep on rocking🫶🏻"
        ]
    },
    "How do I decenter love? ": {
        "title": "How do I decenter love? ",
        "score": 12,
        "url": "https://www.reddit.com/r/TheGirlSurvivalGuide/comments/1dr5v8g/how_do_i_decenter_love/",
        "content": "I (21F) am feeling so broken down because of the way men treat me. I feel constantly sexualized or manipulated and it’s so exhausting. For context I have a shapely body and I feel like it works against me. I was just crying, upset at how I’ve been feeling because of it. Went to the gas station in my loose pajamas and a hoodie to get a snack, and a guy was yelling disgusting sexual shit to me about my body as I walked out to my car. I can’t do it anymore. \n\nNo man takes me seriously. They only want me for sex. I tell them no, or I want to wait, and they disappear. It breaks my heart that nobody wants to get to know me for the person I am. I’ve started to question if I’m even good enough for anything other than my body. I thought that I was pretty, intelligent, kind…now I don’t even know anymore. I feel like I’m always walking on eggshells wondering if I’m unintentionally putting out a “vibe” as I’ve been told by men before for literally just existing. I overthink what I wear, how I act, what I say. \n\nAll the effort I put into myself just feels worthless. I work so damn hard. I have a job, my own apartment, I’m majoring in a complicated field and will have a high paying job in the future. I love hard and like taking care of people. I love babies and animals and elderly people. I have good friends and amazing family that I treat well. I try my hardest to be kind to everyone. I have cool interests and hobbies. Nobody sees it. I just want someone to love me and I want to love and take care of them too. I’m just so mentally and physically drained. Every time I want something serious with a man they reject me if sex isn’t involved. Then if I give in they don’t take me seriously regardless. I’m always losing. \n\nPlease, does anyone relate? I just feel so alone right now and need to talk to some girlies who get it. I need a safe space.🤍\n\n\n\n \n",
        "num_comments": 7,
        "comments": [
            "I feel you girl 💜 I have my guard up so high with men because of what you described",
            "I don’t think it sounds like you need to decenter love. Your definition of love is both expansive and has appropriate boundaries. You know love isn’t abuse, and you don’t confuse the two. That’s where most people go wrong in their understanding of love.\n\nWhat I think needs to shift is your understanding of where love needs to come from. Take a break from the dating scene and shift your time to volunteering at a day camp, senior center, or animal shelter. The time I spent volunteer tutoring ESL lifted me up. There were days I didn’t want to do it, but I was always glad afterwards. That’s the sort of love that lifts you up and makes your heart feel weightless. Decenter the dating scene for a bit, not love itself.",
            "It's a good idea decenter love. With the wrong person its so mentally and emotionally draining. I am not in love but I used to. Honestly almost everyone I meet is sick, twisted and emotionally need...so it will never be enough. Find something to live for, something other than love.",
            "It really is such a terrible feeling. 😔💔",
            "Girl, I feel you. It's like we can never escape the constant sexualization and objectification. Our worth is reduced to our bodies and it's exhausting. And to make it worse, society tells us it's our fault if we get unwanted attention because we should just cover up or behave a certain way. It's a never-ending cycle. But don't let these men make you doubt yourself. You are so much more than just a body. Keep being the badass that you are and don't settle for anyone who doesn't see that. And always remember, you have a whole community of girlies here to support you. We got you. 💪",
            "Don't decenter love.  Redefine what love is important and what it means to you.  \n\nAbout 7 years ago, I had an awful blow out ending of a relationship and decided it was time to stop even caring about relationships or dating and center only really beneficial friendships.  It wasn't the easiest thing to do because society is so focused on marrying everyone off, but I put a lot of therapy and a lot of work into building myself and other types of non-romantic relationships and I have never been happier.  I'm surrounded by the best people anyone could ask for, I have the most amazing support system and funniest of all, people start coming out of the woodwork wanting to date or whatever.  \n\nI know not everyone will be into decentering romantic love but I've never been happier.  I have a very committed, non-romantic life partner.  I couldn't ask for a better friend or \"relationship\" and I never feel the urge to seek out \"romance\" anymore but I do sometimes find someone I'm interested in that sparks that little thing.  But because I'm not focused on wanting or needing to find a romantic relationship, my standards are so much higher and it's much easier to spot red flags and incompatibility because I'm not blinded by the prospect of being alone if that one thing doesn't work out.  It takes the pressure and stress off of that kind of relationship to know you don't NEED it to feel safe and happy.\n\nMy only regret is not learning to do this much earlier.  It took into my mid-30s to get to this point.",
            "I've ben single for 7 years. You will love the peace and quiet.\n\nI stay focused on my friends, family and hobbies when I'm not working my ass off.\n\nThere is a huge unspoken reason why the number of single women are growing and its why those in power are going after abortion, contraception, no fault divorce, and our voting rights in the usa.\n\n\nNearly 118 million Americans, or about 46% of those over 18 years old, are single, according to the U.S. Census Bureau. But that percent is actually much higher for women—a record-breaking 52% of them are unmarried or separated as of 2021, according to a recent report from Wells Fargo Economics.Mar 18, 2023\n\nhttps://fortune.com/2023/03/18/record-number-american-women-single-costs/#:~:text=Nearly%20118%20million%20Americans%2C%20or,report%20from%20Wells%20Fargo%20Economics.\n\nIt's estimated that 45% of women ages 25–44 will be single by 2030, according to a study by Morgan Stanley. With the modern dating market, nearly half of women in their “childbearing” years will be without a male counterpart. There are a few reasons for this prediction. One, women aren't getting married young anymore.Oct 27, 2022\n\nhttps://medium.com/hello-love/study-predicts-45-of-women-will-be-single-by-2030-1fbc99bad6a8#:~:text=It's%20estimated%20that%2045%25%20of,t%20getting%20married%20young%20anymore.\n\nFurther, the same study found that college-educated women initiate divorce at an even higher rate of 90 percent.\n\nhttps://www.irwinirwin.com/why-do-women-initiate-divorce-more-than-men/\n\nWomen outnumber men in college enrollment and outpace them in graduation. According to the National Student Clearinghouse Research Center, in the fall of 2022, about 8.3 million women were undergraduate college students, versus 6.1 million men.\n\nhttps://www.bestcolleges.com/research/women-in-higher-education-facts-statistics/#:~:text=in%20higher%20education.-,1.,students%2C%20versus%206.1%20million%20men.\n\n\nSingle women in the U.S. own 10.95 million homes—2.71 million more than the 8.24 million homes owned by single men.\n\nhttps://www.google.com/search?client=ms-android-tmus-us-revc&sca_esv=7898575184a519fd&source=android-browser&sxsrf=ADLYWILy15t9X1xLzUrA5V0HTVniDhiPYg:1718616864270&q=mkre.women.own.homes+than.me.+in.us&sa=X&ved=2ahUKEwjtqszdquKGAxWfg4QIHXVSAxoQ7xYoAHoECAYQAQ&biw=360&bih=572&dpr=3#vhid=zephyr:0&vssid=atritem-https://nowbam.com/single-women-still-own-more-homes-than-single-men-and-the-gap-is-widening/"
        ]
    },
    "Piercing earlobes... Help me rank the pain.": {
        "title": "Piercing earlobes... Help me rank the pain.",
        "score": 3,
        "url": "https://www.reddit.com/r/TheGirlSurvivalGuide/comments/1draqrk/piercing_earlobes_help_me_rank_the_pain/",
        "content": "This might be a stupid question, but I plan on getting my ears pierced twice on both my earlobes. I decided to go with the needle instead of the piercing gun, it sounds safer. Can someone tell me from 1-10 on the scale of period cramps how much this will hurt. Just want to know if I can handle it, I'm really nervous.",
        "num_comments": 4,
        "comments": [
            "You can handle it. It’s a very fast pinch and it’s over . Super fast.  And they usually numb the earlobe. Which in general doesn’t have many nerve endings to feel pain in the first place \n\nNot bad at all.",
            "The first one in each ear you might not even feel it. The second ones (if happening in the same appointment) will pinch a bit because your ears will already be like what the heck just happened. But it’s really not bad AT ALL. You’ll be okay",
            "Honestly I psyched myself out thinking about it more than the actual 1 second it took the piercing needle. Your earlobes itself is skin and fat so truly the pain was at most a 0.5/10 and thats because I mentally made it a bigger deal than it was.",
            "Coming from someone who was afraid to do it until like age 23, it's not bad at all. Feels like a pinch and then it's over. Like a 1 out of 10, if that. The anxiety hurts worse than the pain honestly lol. Real piercers using a needle do it all the time they will likely make it so you hardly feel much. Tell the person you're afraid of needles and they'll put some extra care into easing your anxiety. Good luck"
        ]
    }
}