{
    "Which version of the games should you buy? FAQ inside.": {
        "title": "Which version of the games should you buy? FAQ inside.",
        "score": 298,
        "url": "https://www.reddit.com/r/thelastofus/comments/185xj9e/which_version_of_the_games_should_you_buy_faq/",
        "content": "**Should I buy TLoU pt1?**\n\nYes. It's one of the most awarded and critically acclaimed games of all time. Yes, it's still good.\n\n**Which version should I buy?**\n\nThere is the ps3 original, then the Ps4 remaster which comes with the (incredible) DLC and somewhat better graphics, and then the Ps5/PC remake which also comes with the DLC and vastly updated graphics. You should buy the newest one you can afford, but you shouldn't worry if you can't get that one, because there's not all *that* much difference. It doesn't matter if you get it on Playstation or PC. It should be noted that the Ps5/PC Remake doesn't include Factions, the multiplayer mode, so the remastered may be a better bet if you'd really like to play it.\n\n**Has the PC version been fixed?**\n\nYeah. \n\n**Should I buy TLoU pt2?**\n\nYes. It's one of the most awarded and critically acclaimed games of all time. Yes, it's still good.\n\n**But I heard some people say it was bad?**\n\nThere was a great internet shitstorm near the time of release. I won't get into the reasons why, but to sum it up: the game is a massive critical and commercial success, and the scores are very high in websites that only let those who purchased the game rate it. In websites that let anyone rate it (including those who haven't played), its scores are much lower, suggesting that much (though not all) of the hate comes from those who never played it. Nevertheless, there is a chance you may not like it - here is a quote from the lead writer:\n\n>\"Some of [the fans of the original game] are not going to like this game, and not like where it goes, and not like what it says or the fate of characters that they love,\" Druckmann said. \"I'd rather have people passionately hate it than just be like, 'Yeah, it was OK.'\"\n\nYou will have to decide for yourself. If you are unsure, look up the dozens of posts asking the same question; don't make yet another post asking it again. Naturally, most opinions here will be positive, but hopefully people can explain why. Be warned that in doing this you may stumble upon spoilers; we don't allow them in untagged posts, but sometimes they slip through.\n\n**Is pt2 still worth it if I had the big reveals spoiled?**\n\nYes. The real meaty, emotionally intense parts are rarely mentioned in those spoilers; instead, people just talk about the same 2-3 moments nonstop. In any case, it’s a really fun game and you should experience it for yourself, as that’s very different from hearing about it; it’s not a game in which the story impact comes just from shock value, but rather from subtler stuff.\n\n**Okay. Which version of pt2 should I buy?**\n\nThere is the original pt2 version, which runs on both Ps4 and Ps5, and then the Remaster coming out for ps5 which will have slightly improved graphics, faster loading times, and also some new features and game modes, such as Speedrun Mode and No Return, a \"roguelike survival mode\" which lets you play with other characters, some extra “Lost Levels” that weren’t included in the base game, and other miscellaneous stuff like guitar free play. In any case, the base story is unchanged between them, so once again you shouldn't worry if you can't afford the newest one. If you already have the Ps4 version, [you can upgrade to the Ps5 version for 10 USD](https://www.naughtydog.com/blog/the_last_of_us_part_ii_remastered_announcement). This option will be available once the game releases.\n\n**Should I play the games if I've already watched the show?**\n\nYes. The games differ from the show in some key ways, and the performances from the original cast are incredible.\n\nWe'll be removing future posts asking these same questions for the near future. Hope you understand. If you see any posts like this, feel free to drop a link to this one in the comments and report the post.",
        "num_comments": 88,
        "comments": [
            "Good write up. I look forward to nobody reading it and continuing to see daily posts asking.",
            "I think you should mention **Factions** under the PS3 and PS4 TLoU versions as that is a massive plus.\n\nEdit: and perhaps mention the fact that the PS4 TLoU2 version has a fps boost when played on the PS5.",
            "The fact that a FAQ is even needed for people to understand what version to buy...",
            "As someone who didn’t enjoy the story too much (of part 2), the gameplay is fun as hell, and it’s a technical masterpiece. Still totally worth it.",
            "I'm glad you made this. I mean I understand why some people make the \"Which one should I get\" posts, but they had like 3 a week. It was getting a little old in my opinion.",
            "I don’t understand how anyone in their right mind would rather play Tlou part 1 og or remastered instead of the remake, the downgrade in graphics and gameplay completely ruin the immersion",
            "So which version should I get meshes ?",
            "Is there a timeline for the show vs the game if I want to do both in parallel?  I watched the first 3 episodes on the plane and now can't figure out where I want to go. If I want to stop and play the game or just continue with the show.",
            "I'm going to as well but going to try to keep playing and watching at the same time.",
            "Q. Why is Last of us 1 for PS5 so much more expensive online (compared to disc version)? Is there a difference between them?"
        ]
    },
    "TLOU2 Remastered bug/glitch unofficial report thread": {
        "title": "TLOU2 Remastered bug/glitch unofficial report thread",
        "score": 76,
        "url": "https://www.reddit.com/r/thelastofus/comments/19be19w/tlou2_remastered_bugglitch_unofficial_report/",
        "content": "Unfortunately, the TLOU2 remaster seems to have introduced quite a few bugs that were not present in the original release. This is fine, since some things are always missed, but I thought I'd make a thread for people to post any of the bugs they've run into in game to hopefully increase the chances that Naughty Dog will learn of these issues and patch them. So far, I have experienced or seen people mention the following:\n\n&#x200B;\n\n* In No Return mode, some characters are unable to change their weapon skins for some reason. If you try to select any of the different weapon skins, the game will make the \"locked\" noise and you'll be stuck on whatever skin you had equipped at the time of the glitch occurring. I've personally seen this with Jesse, Yara, and Mel so far, but it may happen with other characters too.\n\n&#x200B;\n\n* Enemy dialogue that would play at the start of and during Abby's brewery encounter on day 3 no longer triggers. The WLF soldiers would call out Abby for betraying them and talk about Owen doing the same briefly, but now none of the enemy dialogue throughout this encounter triggers at all. (I'm also wondering if there's any other missing/broken dialogue).\n\n&#x200B;\n\n* Ellie's \"Boston\" skin from promotional material seems to be missing from the game entirely. It's unable to be seen or selected in any of the menus. While it's possible this was cut prior to release, it would be very strange since the skin looked finished and was very recently seen in the marketing prior to release. Additionally, Abby's Santa Barbra skin does not use the correct backpack model despite the menu indicating that it should. \n\n&#x200B;\n\n* Skins seem to not be applying for multiple users correctly in story mode.\n\n&#x200B;\n\n* The main menu won't change back to the original boat in the water look after starting a new game.\n\n&#x200B;\n\n* I've not experienced this myself, but No Return seems to cause major frame drops for many players. Personally, I'm really curious what's causing this as it only seems to affect some people.\n\n&#x200B;\n\n* Some users report being unable to escape from grapples despite mashing the square button as prompted by the game.\n\n&#x200B;\n\nIf you know of any other bugs, please feel free to list them here! I'm not sure if Naughty Dog often responds to support requests, but you could still try filling out one [here](https://feedback.naughtydog.com/hc/en-us/requests/new). Most of these bugs aren't game breaking, but hopefully Naughty Dog still learns of them and takes the time to fix them as some of these are pretty unfortunate. ",
        "num_comments": 286,
        "comments": [
            "some people’s trophies aren’t transferring over properly. all of mine transferred except for my grounded trophy 🥲",
            "I want to know if they miscounted the number of developer commentary tracks in the Seattle Sewers Lost Level, or the 16th one is just extremely well hidden.\n\nTrack 15 is right by the exit, so it's probably just a mistake, but I can't help being paranoid.",
            "Mods, may we pin this post please?",
            "Adding a new one I haven’t seen: I completed a clean (non-new game +) grounded permadeath run (per chapter) and did not receive any points to redeem on extras. I am also having similar issues to others already being talked about in this thread.  Thankfully all my trophies transferred. Sounds like I was really lucky in that regard.\n\nEdit: ND just responded to me and said they are aware and looking into the following bugs: not receiving points after completing a story run, menu not resetting to boat after starting a new non-new game + story, and WLF not speaking during the late game brewery encounter.",
            "Journal entries still disappear on level transitions. All good through to the very end of capital hill, but when I crossed the gate and discovered the traps all 3 of the journal entries were suddenly gone.",
            "In Atlanta, there’s a place where Ellie is walking on the ground and then just randomly falls through the map. I couldn’t get around it because there was a huge split in the map that you couldn’t see, but just kept falling through.",
            "The settings for the game reset every time I load the game. Display control everything resets.",
            "There is a micro stutter that plagues all of ND's PS5 releases (and the PS4 version of part 2 running on a PS5) small stutters in both gameplay and audio, as well as major FPS drops. This issue doesn't effect everyone but seems like a lot of people are suffering with the issue. Uncharted Lost Legacy seems to be the most affected game so google LL stutters to see example. This has been present for a year plus in ND games with no obvious cause or acknowledgement from ND.",
            "Has anyone else had an issue of their PS5 trying to reinstall the PS4 version when the disc is in? I deleted it to save space and clean up the UI but it keeps repopulating. Anyway to stop that?",
            "I just did my first daily run and upon trying to check the leaderboards for the daily run it says \"You haven't completed this Daily Run\", but the daily run is locked because I did it. \n\nTo my knowledge you don't need to beat the whole thing for a score to post, no? I died to the boss."
        ]
    },
    "got my tlou tattoo last night :)": {
        "title": "got my tlou tattoo last night :)",
        "score": 359,
        "url": "https://www.reddit.com/gallery/1dr2tav",
        "content": "i made this window design by just tracing over the title screen from the first game, and my tattoo artist did such an amazing job bringing it to life!!! ^^",
        "num_comments": 38,
        "comments": [
            "i love this so much, i want a tlou tattoo so badly without outright getting a copy of ellie’s tattoo\n\nthis is a great original idea and really well executed!!",
            "I hope to get something very similar! The title screen is beautiful & your tattoo's crispy lines turned out great!!",
            "I haven’t seen this one done before. It’s awesome.",
            "This is an amazing idea… I think I wanna get one of the boat from the second game now",
            "well that’s super fkn cool omg",
            "i love this so much!!! such a creative yet recognizable take!!! very well done",
            "I'll get that Ellie's forearm tattoo soon.",
            "i want to get a moth tattoo, like on joel’s guitar at the beginning of p2",
            "Omg that's so cool !!!\nMan I can't wait to get my tlou tatt now",
            "It’s so beautiful i love it!"
        ]
    },
    "Would you ever want to see infected animals in a future installment of TLOU?": {
        "title": "Would you ever want to see infected animals in a future installment of TLOU?",
        "score": 635,
        "url": "https://i.redd.it/5bwrcc0v5e9d1.jpeg",
        "content": "Pic stolen from DomTheBomb on Twitter, but wanted to carry on the conversation.",
        "num_comments": 145,
        "comments": [
            "While I do think gameplay wise they would massively help with giving more creative and interesting enemy variety, the themes of humanity's fall from grace in the series is just too strong. I do think that the next game will have a hard time justifying a new infected type.",
            "I feel like the theme of nature going on with or without humanity is too big in the previous two games. I think it would cheapen moments like the giraffes. But the gameplay would be awesome.",
            "Doesn't have to be animal related, but after The Rat King I for sure want to see some more infected that are out of the norm, what other abominable creatures have been cooking up in deep dark locations? That would be cool.",
            "I remember the community was very hyped about this concept back in 2013-2014, but looking back now I find it less interesting. It would be innovative in terms of enemy variety, but for me the idea that nature is reclaiming its place as a whole in the midst of humanity's existence is much better, and this is evidenced by the idea that only humans are suffering from this abnormal mutation of the fungus.",
            "Yeah my mother in law certainly would make for a frightening infected",
            "As much as I would love new types of Infected, I don't think infected animals is the way to go with it. Well, actually, maybe if it's only animals that are closely related to humans like chimpanzees/bonobos/etc. lol\n\nAnyway, I mainly just want new types of Infected that are created based off the environment they grew in like how Shamblers are created because of exposure to high amounts of water instead of the typical dry environments",
            "Nope. Leave the animals alone.",
            "Nope. I’d rather not. The game established very well that mankind was brought to its knees and nature was replenishing itself. Moments like the giraffes would be less meaningful.",
            "I think it would be sick to see a massive mutated bat as clicker. Bats are supposed to have extremely good immune systems, so it would be a fun challenge.",
            "absolutely not 😭 i love the theme of the humanity being fucked and the animals being unscathed. it's only fair tbh"
        ]
    },
    "Uh... Joel? You okay there buddy?": {
        "title": "Uh... Joel? You okay there buddy?",
        "score": 85,
        "url": "https://v.redd.it/vrtjj0ixyg9d1",
        "content": "",
        "num_comments": 8,
        "comments": [
            "A vaccine could have prevented that, Joel. smh",
            "Joel's back finally gave out",
            "Joel did a full split wow",
            "This is why you stretch.",
            "That's a fallout death right there",
            "Grounded runners ain’t messin.",
            "/r",
            "Too many backshots…"
        ]
    }
}