{
    "ATLA Team Avatar Treasury Library Edition Releasing October 29th": {
        "title": "ATLA Team Avatar Treasury Library Edition Releasing October 29th",
        "score": 54,
        "url": "https://i.redd.it/frxbz6qtds7d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "Team Avatar Treasury (previously released as a box set) is the name for the collection of the first three ATLA one-shot graphic novels: \"Katara and the Pirates' Silver\", \"Toph Beifong's Metalbending Academy\", and \"Suki Alone\". The library edition is a hardcover book with some extras.",
            "YES I knew it would serve me to hold off on getting these individually.",
            "Suki fans should be happy about this, they think she’s ignored often."
        ]
    },
    "First look at the Reckoning of Roku Hardcover , Releasing July 23rd": {
        "title": "First look at the Reckoning of Roku Hardcover , Releasing July 23rd",
        "score": 13,
        "url": "https://www.reddit.com/gallery/1dktp8i",
        "content": "",
        "num_comments": 2,
        "comments": [
            "I know its not same author but I wonder if it will follow same pattern as Kyoshi and Yangchen books of being Duology",
            "Dang. I have money to buy the books now but no time due to work. Funny how that happens"
        ]
    },
    "\"I'm never happy\"": {
        "title": "\"I'm never happy\"",
        "score": 561,
        "url": "https://www.reddit.com/gallery/1dlrjq6",
        "content": "",
        "num_comments": 30,
        "comments": [
            "https://preview.redd.it/u464xxmjh38d1.jpeg?width=1170&format=pjpg&auto=webp&s=4d8919152a5921a1a45721bdbd51383ed31e8188",
            "https://preview.redd.it/xw87vgitl38d1.jpeg?width=828&format=pjpg&auto=webp&s=c189c0fb8d3375d7a9cd72c469aa6649a3d50830",
            "My reaction when the depressed person dares to smile around me",
            "He smiled, guess he doesnt have crippling trauma after all",
            "Fact only someone who lived a prolonged sad period of time can truly understand: Being able to enjoy a moment of joy doesn't mean you are Happy in general.",
            "Of course he’s never happy, you stole all the pixels from when he *was* happy!",
            "his smile is the most adorable thing he’s so precious",
            "Happiness is not the same as the occasional moment of joy, similar that when someone cries, it isn’t a direct sign of depression.",
            "When Zuko isn't massively struggling or dealing with the universe throwing shit at him for a second:",
            "Thanks! I didn't know that \"Zuko smiling\" is something i needed to see today... i am happy 🙂"
        ]
    },
    "Which seat would you take?": {
        "title": "Which seat would you take?",
        "score": 105,
        "url": "https://i.redd.it/x5b4159n248d1.png",
        "content": "",
        "num_comments": 87,
        "comments": [
            "3 gives you the best advice for your life",
            "8 would be so fucking funny",
            "3 easily, IROH next to you, Suki and Ty lee infront of you, and Toph across from you with Sokka next to her",
            "7 because I'm interested in propane and propane accessories.",
            "Definitely 1",
            "6 for sure",
            "Unpopurtal opinion: 4 would be crazy good",
            "3",
            "So, let's analyze the risks:\n\n* 1: Ozai might incinerate me voluntarily or start arguing with Hakoda and turning me in a casualty of the conflict\n* 2: Same thing as 2 but with even bigger chances of dying considering Cabbage Man's luck\n* 3: It will be a nice flight, enjoying tea with 3 fascinating strangers.\n* 4: Either I get brainwashed by Long Feng or I'm forced to listen to Zuko and Mai quarreling and then making up repeatedly... I prefer jumping out of the airplane without the parachute.\n* 5: Same thing as 4 but now I have to worry about Azula too.\n* 6: Same thing as 5 but now I have to worry about Bumi and Toph suddenly deciding to have a contest inside the airplane and taking down the airplane by accident.\n* 7: Same as 6, except I won't have to listen to Mai and Zuko quarreling.\n* 8: I have to worry only about Toph and Bumi now, it could be fine.\n\nI'm gonna go with 3 and spend a nice time drinking tea with Iroh and two fascinating ladies.",
            "Hank Hill got me so bad, I shot coffee out of my nose"
        ]
    },
    "my katara cosplay! 🌊": {
        "title": "my katara cosplay! 🌊",
        "score": 216,
        "url": "https://i.redd.it/4ubf1n75m28d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Wow that's really good! Love the details like the hair :)"
        ]
    }
}