{
    "The Owl House Season 3 | FULL SEASON! | 2 Hour Compilation | @disneychannel": {
        "title": "The Owl House Season 3 | FULL SEASON! | 2 Hour Compilation | @disneychannel",
        "score": 3064,
        "url": "https://youtu.be/Jg2i4vqSFxM",
        "content": "",
        "num_comments": 207,
        "comments": [
            "Time to watch \"Owl House: The Movie.\"",
            "Disney:  Lets see how much we can milk this.",
            "I was waiting for someone to do this turns out Disney did it themselves. Maybe Disney can also allow more content for this show that they are trying to milk every last view out of",
            "Im pissed that this still isnt the definitive way to watch season 3 because they put the end credits scene at the bottom left of the screen at the end of the finale. Best way is still to switch to the end credits video so you can actually get a fullscreen bye",
            "When the doctor says you have 2 hours left to live",
            "This is basically Disneys way of saying: *We done f**ked up.*",
            "Me who lives in a country where everything is blocked: LET ME IN! LET ME INNNN!",
            "Disney really trying to milk that ad revenue huh.",
            "TFW Disney comes right out and tells you \"Yeah. We really did make Dana boil the whole S3 down to essentially 4 episodes.\"  \n\nWhatever. We should get this one up past 2M views in 24 hours too, just to keep driving home how dumb Disney's decision was.",
            "Its actually kinda hilarious to imagine what the Disney execs are doing now that their biggest animated show is dead and they have no one to blame but themselves. You can just feel the panic seeing how many different ways they aired this finale"
        ]
    },
    "Prop Hunt ": {
        "title": "Prop Hunt ",
        "score": 1452,
        "url": "https://www.reddit.com/gallery/1drbtvw",
        "content": "",
        "num_comments": 69,
        "comments": [
            "I think Vee might be a better prop 'cuz she can change colors.",
            "Gotta learn how to change colors string bean",
            "That second to last panel...",
            "They are absolutely chill about it lol",
            "hmmm i see they got tired of that game pretty quick. they need to think of something a little more challenging for the next game.",
            "Her color is too distinct, maybe she should try an octopus or a chameleon form and see if she can blend in better.",
            "Hahahaha! Luz and Stringbeans face are like:",
            "Honestly I think it'd be really cool if a shapshifted string bean appears in every MorningMark comic from now on as an Easter egg",
            "When Prop Hunt fails, video games begin.",
            "Gamer Stringbean lol. Just like her mom"
        ]
    },
    "[Aweirdlatina] Whatever it is, Azura doesn't approve.": {
        "title": "[Aweirdlatina] Whatever it is, Azura doesn't approve.",
        "score": 463,
        "url": "https://i.redd.it/1t62qo29dh9d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "I am sure they will eventually start cuddling again like when Azura first met Ada.",
            "This is maximum adorability! Kitty and puppy siblings daughters of Lumity! This is invigorating! More powerful than coffee!",
            "Its so adorable and azura is still getting around it",
            "ME TOO!! Dying from this is the best way to go!",
            "I kinda wanna put a pickle behind Azura and see how she reacts.",
            "Amity and Azura are part cat. Amitys just hides her catlike baser reflexes.",
            "Ill never understand what cats have against them.",
            "I think it's an instinctive reaction to a snake like object",
            "It may not scare her since she has grown up with Stringbean around her.",
            "Eda: *rawrs cutely*\n\nAzura: *hisses*\n\n*Crying from cuteness* they're so adorable!?! I WANT TO DIE FROM CUTENESS!!!"
        ]
    },
    "Eda Clawthorne, the Owl Lady": {
        "title": "Eda Clawthorne, the Owl Lady",
        "score": 269,
        "url": "https://www.reddit.com/gallery/1dr8z92",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Simply the best and strongest wild witch in the Boiling Isles",
            "She truly is and still kicking!",
            "Dont underestimate her and never mess with her kids(and Raine)",
            "they forgot to mention that she's surprisingly foxy for her age.",
            "Eda: *standing triumphantly atop her enemies*\n\nRaine: That's hot.",
            "I can't escape JJK",
            "Nah Id win"
        ]
    },
    "Problem Solving [Xierra099]": {
        "title": "Problem Solving [Xierra099]",
        "score": 202,
        "url": "https://i.redd.it/wjs8b2dash9d1.jpeg",
        "content": "Source: https://www.deviantart.com/xierra099/art/Problem-Solving-914473400",
        "num_comments": 8,
        "comments": [
            "Whether it works out or not this makes Luz happy and that is all Amity needs.",
            "Luz: yes, she used my line!",
            "Wow...thanks for the joke Amity.",
            "Luz: Amity's so pretty when she's beating someone up.",
            "POV: you called the good witch azura cringe",
            "Luz: *See? She does know how to use puns!*",
            "Luz freely gave Amity her nose.",
            "Amity stole luz's nose"
        ]
    }
}