{
    "Weekly student question thread!": {
        "title": "Weekly student question thread!",
        "score": 2,
        "url": "https://www.reddit.com/r/therapists/comments/1dqhym7/weekly_student_question_thread/",
        "content": "Students are welcome to post any questions they have for therapists in this thread. Got a question about a theoretical orientation and how it applies in practice? Ask it here! Got a question about a particular specialty? Cool put it in a comment! \n\nWondering which route to take into the field of therapy? See if this document from the sidebar could help: [Careers In Mental Health](https://docs.google.com/document/d/1udpjYAYftrZ1XUqt28MVUzj0bv86ClDY752PKrMaB5s/edit)",
        "num_comments": 10,
        "comments": [
            "Im curious how you chose your theoretical orientation.",
            "MFT vs. an LPC program. I was certain I wanted to go into an LPC program after undergrad. I am finishing up an undergraduate internship in an MFT program, and I really love the systemic modality they use. So now I am doubting myself. I know I mainly want to work with individuals, the queer community, and college students. I know that environment and outside factors can have a significant impact on one's mental health, and I was wondering. How do MFT and LPC programs compare and contrast the therapy modalities they teach?",
            "I am currently working on my Masters in Mental Health Counseling and am taking a Community Mental Health course. This class is requiring me to do a brief interview with a LMHC or a registered intern who worked/works at a community agency. Its very brief and I only need a little bit of your time.\n\nThank you in advance!",
            "I'm a 27-year-old based in Greece and currently studying counseling. I'm eager to level up my skills inside the therapy room and would love some advice from experienced therapists or anyone knowledgeable in the field. Whether it's techniques for building rapport with clients, effective communication strategies, or ways to navigate challenging sessions. Recommendations for books, online courses, or practical exercises would be incredibly helpful. Thank you in advance!",
            "There are online quizzes you can take and it will rank it for you. Then read up on the top 3-5!",
            "The one that made sense and feels right. Not only by reading it but by experiencing being in therapy with several therapists myself.",
            "Our program was for both, at the end you choose which route. Our training was excellent and I see few new clinicians as well equipped as those from my program. At treatment center, i work with mft, LPCC, msw, and PsyD.",
            "Where can I find these quizzes?",
            "Sometimes you choose your theoretical orientation and sometimes the theoretical orientation chooses you.\n\nA common way is that once you start getting hands on experience and being supervised by different people, youll naturally find some orientations/modalities that you gravitate towards and are excited to learn more about and try it implement on your own.\n\nAnd youll also find some orientations/modalities that appear to be a poor fit.",
            "**Do not message the mods about this automated message.** Please followed the sidebar rules. r/therapists is a place for therapists and mental health professionals to discuss their profession among each other. \n\n**If you are not a therapist and are asking for advice this not the place for you**. Your post will be removed. Please try one of the reddit communities such as r/TalkTherapy, r/askatherapist, r/SuicideWatch that are set up for this.\n\nThis community is ONLY for therapists, and for them to discuss their profession away from clients.\n\n**If you are a first year student, not in a graduate program, or are thinking of becoming a therapist, this is not the place to ask questions**. Your post will be removed. To save us a job, you are welcome to delete this post yourself. Please see the PINNED STUDENT THREAD at the top of the community and ask in there.  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/therapists) if you have any questions or concerns.*"
        ]
    },
    "Weekly burnout check in": {
        "title": "Weekly burnout check in",
        "score": 8,
        "url": "https://www.reddit.com/r/therapists/comments/1dmitza/weekly_burnout_check_in/",
        "content": "Welcome to the Sunday Scaries! Feeling burn out,, struggling with compassion fatigue, work environment really sucking right now? Share your feelings here to get support. \n\nAll other posts about burnout will get redirected here. \n\n**This is the place for you to vent and complain WITHOUT JUDGEMENT about any stressful work situations going on at work and/or how much you are feeling burnt out doing this work.** \n\nBurn out making you want to change career? Check out this [infographic](https://www.reddit.com/r/therapists/comments/144cxnv/im_a_burned_out_therapist_what_should_i_do_about/?utm_source=share&utm_medium=web2x&context=3) by one of our community members (also found in sidebar) to consider your options.",
        "num_comments": 14,
        "comments": [
            "my facility shut down today\n\nim really gonna miss it",
            "Def have the Sunday Scaries today, I work at a major hospital and we're just so short staffed, longer lists of complex patients, and everyone is stressed esp bc of our budget issues. I like what I do and my patients but it's getting harder with little breaks in sight.  It's even more frustrating bc management doesn't always get it and overpromises vs understanding what is realistic.  I feel like the weekends are over in a blink and I spent a lot of it asleep since I'm so tired. Any other healthcare folks relate?",
            "I remember being in grad school, its super draining in its own special way so that's totally valid to feel like that. If it helps, my job is also totally different from my schooling which was a relief! You can do it and you're almost there, its def a marathon not a sprint so just keep on trucking <3",
            "I'm so sorry. Must be a lot of complex feelings.",
            "Not hospital, but residential, and I could have written this post. Especially the part about completely crashing on the weekends. My last day was Friday and this is the first Sunday in months that I haven't had gnawing anxiety since the moment I woke up.",
            "Oh yeah I could imagine residential getting crazy for sure, and I'm glad to know it's not just me feeling it!",
            "Good evening, I am an LMFT-A with three years experience and 124 relational hours left to gain full license. I also have an autoimmune disorder which already leaves me exhausted.\n\nThe attempt to gain the relational hours that I need and make the money that I need has been overwhelming. I also work for a practice that has determined that I am part-time simply because I work three 10 hour days instead of coming in 5 days a week. Funny thing is they cant even fill the three days that I come in. I am so sick of the expectations of others and believe that it is because I am in a profession with blurred lines. I work with a lot of LCSW. Funny how they can fill counseling positions yet I cant fill social work positions.\n\nI love being an LMFT Systemic Therapist  . What I dont like is competing with for relational hours, especially when I need them! Before signing my co tract I was told that no one there wanted to do couples and families. Then I see couples and families being scheduled with LCSWs and LPCs and they dont even need them to gain licensure.",
            "This is going to sound bad, but I'm not even burned out from a real job yet. I'm on my last semester of grad school, just two online classes. I don't know why but I'm having a really hard time staying motivated and sitting down to write papers and such. My professors have very oddly specific instructions for peer replies as well. I'm sorry if it sounds like I'm complaining and \"idk how good I have it\". But I'm up late every night, the discussion boards and papers and projects are overwhelming, and I'm really struggling to get this done. I love therapy, I can see myself liking the work, but the schooling process is just sucking the life out of me.",
            "Hey yall. Im a clinical mental health therapist with a masters degree and 5 years experience. Ive worked in substance abuse, both inpatient and outpatient,and recently  Ive been in the community the last few years mostly working with kids and their parents.\n\nTo say Im burnout is an understatement. The company I work for is filled with non clinical staff who also have 0 experience in healthcare and its really frustrating. I live in a small town in southern OH, so the opportunities for me to do something else arent very extensive. I need some help in getting out of this cycle, so please let me know if any of yall have made a transition out of therapy and into some other type of work?? I have experience with CPS, I have been a bartender and worked in retail and restaurants as well. My experience is vast but my education is super specific. I also have a cert in trauma therapy and use that as well. Id love to do some education for people, or training. But I dont know where to start or if I have any other options. I need to have a flexible schedule since Im a single mom, and I dont have the $$ to start a private practice. Any and all of the insight or advice yall have would be super helpful for me! Thanks yall ",
            "Hi! Dallas-based LMSW here! Truthfully Im just burnt out by job hunting and also having a lack of clients coming in! Sorry in advance for the long, vent-y post. \n\nI was working at an inpatient facility from Sept-March and then had sudden onset of a chronic illness (still trying to get an actual diagnosis, we love spread out doctors appointments) and in the process of me being unable to work due to symptoms, and going to the hospital and doctors appointments I transitioned to PRN with work and then my job essentially forced me out. Luckily my LCSW-S was willing to bring me on to her telehealth group practice, but I have been absolutely struggling to market myself and bring in clients and Im burnt out trying. Ive decided to try to get contracted with another group practice, only to find out a majority only want fully licensed clinicians, or only work with LPCs or LPC-As (which you all are lovely people and do great work, but its frustrating and discouraging all the same).\n\nThat is my little rant/burn out thing. Sorry yall"
        ]
    },
    "Those times when a client takes baby steps forward and then life comes round and throws them back…": {
        "title": "Those times when a client takes baby steps forward and then life comes round and throws them back…",
        "score": 53,
        "url": "https://www.reddit.com/r/therapists/comments/1dr3o4f/those_times_when_a_client_takes_baby_steps/",
        "content": "Bad day. Think along the lines of a traumatized client who was just starting to trust me and set boundaries with their problematic family. I was feeling so proud of their progress, so excited to see the little glimmers of safety they could feel. Now a parent has a terminal illness and they’re buckling under the pressure to move back home and help (cultural expectation along with a shitload of emotional manipulation). Struggling with wanting to save them and just feeling like I’m losing all our progress. \n\n(I put the rant flair because that’s what this is, but feel free to give advice if you have any.)",
        "num_comments": 8,
        "comments": [
            "Have them do a cost benefit analysis for helping and not helping. Pros and cons for both. And then boundaries based on the cons for helping. It can become easier to have boundaries when you're the one in control (ie caretaker).",
            "Yup, remind myself of all this! Just hard to let it go sometimes. A night of sleep definitely helped.",
            "Perhaps others have experienced this as well, but I've definitely found that it's difficult, especially with some clients, to not feel the same sense of \"helplessness\" when it's so actively present in the client's life. One thing that I've been implementing lately is growing apathetic to my clients' outcomes-- not to mean that I've stopped caring or have become numb to their struggles, but mostly in a way where *I* don't become dysregulated as a result of *their* struggles and feelings.  \n\nI've noticed, especially about a month ago, where some clients would come to me and we'd brainstorm on possible solutions or ways to take care of ourselves, and it would be roadblock after roadblock. It seemed like nothing we explored could be helpful or beneficial, and I was struggling with some awful imposter syndrome (I'm only 2 years into the field). It wasn't until I read some great advice on here (can't remember specifically) that I've learned to let go of the responsibility of my clients' actions--they either 1) come back to me and we explore why they didn't implement strategies or 2) come back to me and we explore ways to maintain what they are doing. Either way, I'll be here to help",
            "A couple of thoughts:\n\n1. You wrote, \"Struggling with wanting to save them and just feeling like Im losing all our progress.\" The client is not yours to save, and their progress is not yours to lose. You are their therapist, not their avatar.\n2. Life does not \"throw them back.\" Life challenges them and they choose how to respond. Sometimes those choices are forward moving, and most of the time they are not.\n\nI get the impulse to feel exactly how you are feeling. We have all been there. However, you are feeling this way about choices and a life that is not yours to live.",
            "If you take responsibility for client outcomes then thats a one way ticket to burnout",
            "**Do not message the mods about this automated message.** Please followed the sidebar rules. r/therapists is a place for therapists and mental health professionals to discuss their profession among each other. \n\n**If you are not a therapist and are asking for advice this not the place for you**. Your post will be removed. Please try one of the reddit communities such as r/TalkTherapy, r/askatherapist, r/SuicideWatch that are set up for this.\n\nThis community is ONLY for therapists, and for them to discuss their profession away from clients.\n\n**If you are a first year student, not in a graduate program, or are thinking of becoming a therapist, this is not the place to ask questions**. Your post will be removed. To save us a job, you are welcome to delete this post yourself. Please see the PINNED STUDENT THREAD at the top of the community and ask in there.  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/therapists) if you have any questions or concerns.*",
            "[removed]",
            "Your comment has been removed as it appears you are not a therapist. This sub is a space for therapists to discuss their profession among each other. Comments by non therapists are left up only sparingly, and if they are supportive or helpful in nature as judged by the community and/or moderation team.\n\nIf this removal was in error and you are a therapy professional, please contact the mod team to clarify. For guidance on how to verify with the mod team please see the sidebar post here: https://www.reddit.com/r/therapists/comments/sbq2o4/update_on_verification_within_the_subreddit/"
        ]
    },
    "People that say...": {
        "title": "People that say...",
        "score": 7,
        "url": "https://www.reddit.com/r/therapists/comments/1drbuux/people_that_say/",
        "content": "\"I was just raised that way\" or \"it's subconscious\". How do you respond when this seems to be an excuse to not acknowledge, change, or work on things? Are these just excuses or how do you dig into this more? I am just curious to see how others approach this. ",
        "num_comments": 14,
        "comments": [
            "When you say its subconscious, it feels like youre saying that is not something that is controllable or able to be worked on. Or maybe even that you feel resigned to it staying that way. Is that what you mean? My perspective is that one of the tasks of therapy is to bring the unconscious into conscious awareness and then decide if its something that aligns with our values/goals and something we want to intentionally change. How do you feel about that idea?",
            "It's a reason, not an excuse. An excuse makes it ok. But being raised that way or doing something out of habit are legitimate major contributing factors",
            "Oh I have a client who, when we get into the deep stuff, he goes: thats what Ive know all my life-my mother gave me this idea over x y z\n\nOk yes, but how do we create something new then? We cant keep letting the past inform the future.",
            "Roll with resistance! I typically go with something like, I get that. Is it helpful to you?\n\nDepending on the context, a lot of times the client is being protective of whoever raised them, She was doing the best she could, or, I dont think they did anything wrong. Ill roll with it again & clarify that it isnt about placing blame, just understanding what the client learned from it & how its influencing them now.",
            "i think theyre not excuses, but learned limited ways of relating to self. yes, and the way you were raised of course has an impact on who you are as a person thats what were trying to understand and make connections to here if its unconscious, it came from somewhere: family, society, relationships, school lets find out !",
            "**\"I was just raised that way.\"** ... And? The ways we were raised do not necessarily have to continue into our lives if we do not want them to. Let's look at how we can catch this thought/feeling/behavior before it causes problems.\n\n**\"It's subconscious.\"** ... No, it *was* subconscious, but now you are aware that this is something you have a tendency to do in X situations, so let's look at how we can catch it earlier and what we can do instead that will move you closer to your desired outcome.",
            "It largely depends on if they want to change these things or more accurately would want to if they realized it was possible. If the answer is yes I usually say something like there are always things we don't like about ourselves that we believe they are innate and unchangeable but our brains are so cool and we can change how we think about things and how we view ourselves. \n\nIf they're into science or medical facts I talk about neuroplasticity. If they're not I say that can work together to reduce or eliminate those thoughts and/or behaviors. It's not an instant change, it takes time and effort but I know it's possible because have personally done it.",
            "There are already lots of great suggestions! I might say, Tell me more about thatHow has that played out in your life - what has that looked like for you?Now that what was subconscious is now conscious, how might you act? Not sure if this would be helpful. Just food for thought.",
            " I get the sense that this really feels like theres not much you can do about it. Whats it like to feel like you have no control over xyz?",
            "My supervisor has encouraged me to help the client get curious about these types of responses. If they struggle to go deeper in these moments, it can feel frustrating. It might mean they dont feel they can change. Somethings Ive been encouraged to ask is how has this (behavior,coping strategy, reaction etc) been helpful to you in your life?, observe/affirm how its been helpful before and in some way helped keep them safe (in some capacity), then encourage client to consider if it still feels helpful now. If its no longer a helpful coping strategy but causes more issues than you can ask something like if you could respond differently in these moments, would you want to?. I also usually provide psychoeducation on the brains neuro plasticity. In a lot of these cases, even if they feel the behavior isnt helpful or okay, they may not feel they are able to change if they consider it a character trait. I often say to my clients, if it was learned, then it can be unlearned or everything is figureoutable. Idk if any of this is helpful as each client is so different but thought Id offer some of the stuff thats been helpful for me as a clinician. Hang in there! This is definitely frustrating at times and can feel either triggering from our own experiences or feel like we are having to pull our clients along in their goals."
        ]
    },
    "What do you do when a client is very upset and you find yourself at risk of being swept up into their tornado?": {
        "title": "What do you do when a client is very upset and you find yourself at risk of being swept up into their tornado?",
        "score": 4,
        "url": "https://www.reddit.com/r/therapists/comments/1drdpmn/what_do_you_do_when_a_client_is_very_upset_and/",
        "content": "Every once in a while I seem to absorb what my clients are feeling. I get a massive hit of something that isn't mine - grief, revenge, anxiety. And then there are the clients that are just having the worst time ever and it's like a storm came into the room with them. In these cases, sometimes I get my own anxiety or feel out of control because nothing I am doing is helping them in that moment of crisis. What do you do when you are with someone to protect your heart from overwhelm, or help bring coherence back into the session?",
        "num_comments": 2,
        "comments": [
            "Grabbing the chair or something physical to ground myself, reminding myself this isnt mine, or taking a break to take a breath and collect my thoughts (we dont do this one enough in my opinion, but a pause to think can really help to turn a session around)",
            "**Do not message the mods about this automated message.** Please followed the sidebar rules. r/therapists is a place for therapists and mental health professionals to discuss their profession among each other. \n\n**If you are not a therapist and are asking for advice this not the place for you**. Your post will be removed. Please try one of the reddit communities such as r/TalkTherapy, r/askatherapist, r/SuicideWatch that are set up for this.\n\nThis community is ONLY for therapists, and for them to discuss their profession away from clients.\n\n**If you are a first year student, not in a graduate program, or are thinking of becoming a therapist, this is not the place to ask questions**. Your post will be removed. To save us a job, you are welcome to delete this post yourself. Please see the PINNED STUDENT THREAD at the top of the community and ask in there.  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/therapists) if you have any questions or concerns.*"
        ]
    }
}