{
    "To tell the world they are not using human shields": {
        "title": "To tell the world they are not using human shields",
        "score": 1700,
        "url": "https://v.redd.it/txfj00z7b38d1",
        "content": "",
        "num_comments": 203,
        "comments": [
            "#Welcome to r/Therewasanattempt!\n\n#Consider visiting r/Worldnewsvideo for videos from around the world!\n\n[Please review our policy on bigotry and hate speech by clicking this link](https://www.reddit.com/r/therewasanattempt/wiki/civility)\n\n\nIn order to view our rules, you can type \"**!rules**\" in any comment, and automod will respond with the subreddit rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/therewasanattempt) if you have any questions or concerns.*",
            "I read about tying locals on cars only once in my life and it was a book about Waffen SS. These guys are truly building an irony dome.",
            "That is a warcrime, documented on video.\n\nThose responsible will either have to face justice or Israel looses even more support.",
            "How many sanctions?",
            "Vids like this make me think more that in war there are no rules. The Geneva convention is more like a Geneva suggestion",
            "![gif](giphy|T4wMnIG3Xyww0|downsized)\n\nIsrael be like that to the west - and the western cowards actually close their eyes.",
            "What in the actuall fuck",
            "Scum",
            "Inhuman scum",
            "Cartoon levels of villainy.. Why are they even pretending at this point?"
        ]
    },
    "To make sure the brown person was ok.": {
        "title": "To make sure the brown person was ok.",
        "score": 5463,
        "url": "https://v.redd.it/v64qja27v08d1",
        "content": "",
        "num_comments": 447,
        "comments": [
            "#Welcome to r/Therewasanattempt!\n\n#Consider visiting r/Worldnewsvideo for videos from around the world!\n\n[Please review our policy on bigotry and hate speech by clicking this link](https://www.reddit.com/r/therewasanattempt/wiki/civility)\n\n\nIn order to view our rules, you can type \"**!rules**\" in any comment, and automod will respond with the subreddit rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/therewasanattempt) if you have any questions or concerns.*",
            "what is wrong with his bottom lip.... did he get Greyscale like in Game of Thrones?",
            "That lady is an idiot, but she’ll never find out.",
            "Jesus Christ this is such a clusterfuck, if the blue lipped dude wasn’t so earnest I’d fully believe this was a work of fiction",
            "'How dare that woman interrupt my virtue signalling with her own virtue signalling!'\n\ncall the cops and be done with it instead of getting enough content to fit in some ad breaks.",
            "So I thought saying “houseless” was a little weird but then topped it off with saying “the brown person”",
            "The thunder sound effect got me bro",
            "People in America are so racist. Like i get that they think it's not racism cause they see themselves as fighting oppression. But walking up to someone and being like this person is a different colour so i must defend them is so messed up.",
            "Develop some nuance people. Homeless mutual aid lady is not wrong for her concern - which is not exclusively a PDX characteristic. That said, Brown person is still a POS in this situation.\n\nEdit: I would like to address the negative responses - which is mostly accusatory of racism and is mostly the responses I’ve received so far. \n\nPredictably, the rhetoric of all negative responses can be categorized under post-racial outrage. As in, there is no racial classification and using the term brown as a racial classification is of itself racist. Shaming me for addressing and acknowledging that the alleged pedophile is a brown person. Such Shapiro-Owens logic is performative at best and anti-antiracist at its worst. \n\nLet’s briefly handhold you through this shall we by flipping the script. Would you be just as accusatory and outraged if instead the person is white and addressed as white person? We take care of our white people.",
            "Is this one of those pedo hunter groups? They think they're doing good but all they're doing is causing the pedos to be way more cautious "
        ]
    },
    "To win over the U.N": {
        "title": "To win over the U.N",
        "score": 4873,
        "url": "https://v.redd.it/fnxq3wjdfz7d1",
        "content": "",
        "num_comments": 317,
        "comments": [
            "#Welcome to r/Therewasanattempt!\n\n#Consider visiting r/Worldnewsvideo for videos from around the world!\n\n[Please review our policy on bigotry and hate speech by clicking this link](https://www.reddit.com/r/therewasanattempt/wiki/civility)\n\n\nIn order to view our rules, you can type \"**!rules**\" in any comment, and automod will respond with the subreddit rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/therewasanattempt) if you have any questions or concerns.*",
            "Against (9):\n\nArgentina, Czech Republic, Hungary, Israel, Micronesia, Nauru, Palau, Papua New Guinea, United States",
            "The israli speaker is right though they would be turning in their graves if they knew that isral was doing this and was still part of the UN",
            "The Israeli ambassador reminds me cunning nazis. Strange feeling. Came out of no where. Almost.",
            "The UN already has at *least* one terror state within its ranks: Israel.",
            "Israel has been like this for a long time, the world's realization that Israel is a murder state built on lies and propaganda is happening so fast that Israel's mouthpieces are still regurgitating old lies we no longer fall for.\n\nIsrael will change but it will take a lot to gain any kind of trust from the world today.\n\nNo matter how much the USA fawns over those Assholes.",
            "Churchill a man that ordered the starvation of millions of Bengalis. No wonder they care what Churchill would say. Same racist, colonial pieces of shit.",
            "While the majority of the assembly voted, it is irrelevant unless a member state candidate is put forward by the security council. \n\nThe security council are not going to do that.",
            "Lmao referencing American presidents he might as well run in the US at this point it's very clear that he only cares about one demographic.",
            "Israeli ambassador should have to look in a mirror when he speaks"
        ]
    },
    "to bypass traffic ": {
        "title": "to bypass traffic ",
        "score": 10768,
        "url": "https://v.redd.it/9rl2vtnu2y7d1",
        "content": "",
        "num_comments": 267,
        "comments": [
            "#Welcome to r/Therewasanattempt!\n\n#Consider visiting r/Worldnewsvideo for videos from around the world!\n\n[Please review our policy on bigotry and hate speech by clicking this link](https://www.reddit.com/r/therewasanattempt/wiki/civility)\n\n\nIn order to view our rules, you can type \"**!rules**\" in any comment, and automod will respond with the subreddit rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/therewasanattempt) if you have any questions or concerns.*",
            "All this going on, and near the end of the clip there's a car barreling down the wrong direction on the far shoulder.",
            "The movement of the truck makes it look as if the truck itself - not just the guy driving it - is angry.",
            "That horn is the traffic equivalent of the walk of shame.\n\n![gif](giphy|vX9WcCiWwUF7G|downsized)",
            "Why is there some random clearly unrelated audio looping all over this?\n\nVideo was no more interesting or attention grabbing as a result.",
            "What a weird sound has been added?",
            "oh MAN that was painful to watch",
            "Is this a BMW? Of all car makes, who would have thought?\n\nEDIT: and again I fall victim to my bias and my ignorance of all things car",
            "Truck being a good guy bully. Good on ye.",
            "I love how the truck driver didn’t settle for the half ass merge in. He used all that mass to scrooch the little guy into place haha."
        ]
    },
    "To eat at a buffet": {
        "title": "To eat at a buffet",
        "score": 2299,
        "url": "https://v.redd.it/frrh20nxlz7d1",
        "content": "",
        "num_comments": 27,
        "comments": [
            "#Welcome to r/Therewasanattempt!\n\n#Consider visiting r/Worldnewsvideo for videos from around the world!\n\n[Please review our policy on bigotry and hate speech by clicking this link](https://www.reddit.com/r/therewasanattempt/wiki/civility)\n\n\nIn order to view our rules, you can type \"**!rules**\" in any comment, and automod will respond with the subreddit rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/therewasanattempt) if you have any questions or concerns.*",
            "That shit eating grin on the woman’s face sold it 😂😂😭",
            "How would he not feel his plate suddenly get lighter? Are people just going to Golden Corral stoned AF?",
            "the world wants to watch the world burn\n\nhttps://preview.redd.it/aqp2nh0gc08d1.jpeg?width=843&format=pjpg&auto=webp&s=a70697e57388a05ebbfccf3fad748fe372e6603f",
            "What do you think the serving spoons are for on those plates slob.",
            "Jokes on you. Dude didn't wash hands after visiting the toilet.",
            "I was not ready for the second girl. Spat my coffee everywhere 🤣",
            "Amateur",
            "Joke on them he scratched his balls with that hand. XD",
            "Hey wasn't this one of the challenges on impractical jokers"
        ]
    }
}