{
    "The entire day, I kept saying, \"I'll join the Simpsons discord a little later, I'll join a little later...\" And when I tried to join, they told me they just closed. And when I asked the discord guy if they'll ever come back again, he said he didn't know.": {
        "title": "The entire day, I kept saying, \"I'll join the Simpsons discord a little later, I'll join a little later...\" And when I tried to join, they told me they just closed. And when I asked the discord guy if they'll ever come back again, he said he didn't know.",
        "score": 448,
        "url": "https://discord.gg/thesimpsons",
        "content": "",
        "num_comments": 41,
        "comments": [
            "Link above not working? This one should http://discord.gg/MCZP5yE\n\nOnce you join let a mod know the above link broke and we will fix it!",
            "They have the internet on computers now.",
            "Worst discord server ever.",
            "I saw weird stuff in that place last night. Weird, strange, sick, twisted, eerie, godless, evil stuff-\n\n-and I want in.",
            "It’s the no Homers club. They’re allowed to have one Homer.",
            "Well, I'm never going to let something like that happen again! I'm joining The Simpsons discord today! https://discord.gg/thesimpsons",
            "But what would happen if ET and Mr T has a baby?",
            "Don't let the haircut fool you. I'm exceedingly wealthy.",
            "Check out https://squabbles.io/ Small migration from Reddit happening now. Maybe the mods here can open a new sub there just in case?\n\nYah I’m cross posting this on a lot of subs. Im only posting this comment on subs that i follow, that have a going dark post up already. I’m not a bot or affiliated with the new site. I just want to raise awareness. I’m so upset at Reddit for ruining the way i experience Reddit going forward and I’m really enjoying this new site where there is traction for a Reddit replacement for at least some of us.\n\n\n•\tposted from Apollo app",
            "This contest is over! Give that man the $10,000!"
        ]
    },
    "Good show last night": {
        "title": "Good show last night",
        "score": 431,
        "url": "https://frinkiac.com/img/S03E22/699300.jpg",
        "content": "",
        "num_comments": 59,
        "comments": [
            "Good night Springton. There will be no encores",
            "The bleedin' splish-splash show?",
            "Yeah quite good",
            "As for the first time ever a hockey arena becomes the scene of violence",
            "https://i.redd.it/odsvnxzfoe9d1.gif",
            "You know, people only think there are 5 members of Spinal Tap but they're wrong..",
            "We salute you, our half-inflated dark lord!",
            "I can’t think of anyone who’s benefited more from the death of communism than us.",
            "We are the children....",
            "Ahh! My *vision!*"
        ]
    },
    "\"My Huckleberry friend, moooon riveeeer, and me...\"": {
        "title": "\"My Huckleberry friend, moooon riveeeer, and me...\"",
        "score": 184,
        "url": "https://i.redd.it/wjeluh1ihf9d1.gif",
        "content": "",
        "num_comments": 24,
        "comments": [
            "Andy Williams!",
            "I didn’t think he was going to do “Moon River” and then bam second encore",
            "This is  Bronson, MO.",
            "Nice gif, considering that in the original episode it was a panning motion from left to right to reveal Nelson's expression last. Did you make this OP?",
            "Branson, MO. My dad says it's like Vegas if it were run by Ned Flanders.",
            "BOOM! SECOND ENCORE!!",
            "love this episode because all of Nelson’s suggestions are all incredibly boring",
            "The thing about huckleberries is, once you've had fresh, you'll never go back to canned.",
            "S07E20.",
            "Hey NZAvenger, You didn't fill in a season and episode or somehow it didn't get saved properly when submitting, reddit is buggy sometimes.\n\n^(\\(Quick Tip: Adding season and episode info into the TITLE or BODY TEXT/IMAGE DESCRIPTION of a post can set the flair - Woo-Hoo!\\))\n\nPlease reply to this comment with the correct Season and Episode Number in the following format:\n\n---\n\n**S##E##**   |   ( Example: `S03E10` )\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TheSimpsons) if you have any questions or concerns.*"
        ]
    },
    "Favorite book/magazine etc in the show?": {
        "title": "Favorite book/magazine etc in the show?",
        "score": 1812,
        "url": "https://i.redd.it/wloi9fmsqb9d1.jpeg",
        "content": "",
        "num_comments": 228,
        "comments": [
            "https://preview.redd.it/aqeohdcpsb9d1.jpeg?width=640&format=pjpg&auto=webp&s=588329e8f0e506275cd01d2b8d0bbb7045665ebe",
            "https://preview.redd.it/ruwc4ig70c9d1.jpeg?width=640&format=pjpg&auto=webp&s=35c136f3babb6070f59e46ff0312877524d76b54",
            "https://preview.redd.it/slvqh2v66c9d1.jpeg?width=360&format=pjpg&auto=webp&s=83bebc31b3957de51a7169e77480f2596e774200",
            "https://preview.redd.it/nimduxirwb9d1.jpeg?width=250&format=pjpg&auto=webp&s=79dc5d8d4cacb48a9a67fec7f97839b060a3dda4",
            "https://preview.redd.it/yaxb6k93yb9d1.png?width=720&format=png&auto=webp&s=d0db691a6c0ab44286ab8861d749be367c3833ac",
            "https://preview.redd.it/1ranjaa5sb9d1.jpeg?width=640&format=pjpg&auto=webp&s=89e3de01c8df63ab7a9c0e92bbf70339056e64d8",
            "This could be useful.\n\nhttps://preview.redd.it/ndb7277l5c9d1.jpeg?width=1170&format=pjpg&auto=webp&s=4a9ef8013c842a7346a826b460fcb9f6578f1bf1",
            "https://preview.redd.it/xlj7nssqoc9d1.jpeg?width=360&format=pjpg&auto=webp&s=b95491bfb0435fd6061caacbd303e28b0f5ca470",
            "The 10 Do's.. and 500 Don'ts of Knife Safety",
            "https://preview.redd.it/b8yqnpk0ec9d1.png?width=1080&format=pjpg&auto=webp&s=90b7214e21cce560b0e7192e26516f4f8e1de18f"
        ]
    },
    "An old time freakout sounds tempting, Homer. But we've got a big order to fill! (RIP Martin Mull)": {
        "title": "An old time freakout sounds tempting, Homer. But we've got a big order to fill! (RIP Martin Mull)",
        "score": 248,
        "url": "https://i.redd.it/4axqkahrme9d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Thanks to him, we have confirmation Mona Simpson was a demon in the sack.",
            "Homer, those were our *personal* vegetables.",
            "First I find out from this sub Sutherland passed away and now this",
            "In a way, the 60s ended the day we sold it: December 31, 1969.",
            "My god! It's nothing but carrots and peyote!",
            "Uptown girl, she’s been living in her uptown world",
            "Huh didn't realize that was Mull",
            "Holy shit I didnt know he died. I always got him and Stanley from the TV version of It confused. Richard Masur",
            "Damn. This subreddit is how I learned about Donald Sutherland. Now you're telling me Gene Parmesean is dead too?",
            "Oh, you heard about that, eh?"
        ]
    }
}