{
    "Questions & Answers - Weekly Megathread! Please use this post to ask any Pokemon GO question you'd like!": {
        "title": "Questions & Answers - Weekly Megathread! Please use this post to ask any Pokemon GO question you'd like!",
        "score": 10,
        "url": "https://www.reddit.com/r/TheSilphRoad/comments/1do5f50/questions_answers_weekly_megathread_please_use/",
        "content": "# Hey travelers! \n\nIf you have any questions about Pokemon GO (anything from basics to specifics of a certain mechanic), ask here! We also have a wealth of information available in historical posts, so try using the search bar. Or [click the Discord link in our topbar](https://discord.gg/thesilphroad) and head to the #boot\\_camp channel - where helpful travelers are standing by to answer questions.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# What is /r/TheSilphRoad?\n\nThe Silph Road is primarily focused on discoveries and analysis related to Pokemon GO, as well as constructing an in-person network of Pokemon GO enthusiasts. General discussion topics (Jokes, stories, a photo of a recent catch) would likely be better suited for another subreddit, such as a general subreddit like /r/PokemonGO, or /r/Pokemon, or a subreddit with a more specific focus, like /r/PokemonGoSnap, /r/PokemonBuddy, /r/ShinyPokemon, /r/PoGoRaids, /r/TheSilphArena, /r/PokemonGOTrades, /r/PokemonGOFriends, or /r/NianticWayfarer. \n\n**Silph Road Content Policy**\n\nThe Silph Road is **heavily moderated to promote civility/courtesy, and high-quality content and discussion.** You can read our full policies in the sidebar, but don't be surprised if a comment is removed for being rude, cynical, or off-topic. We strive to foster civil discussion about the game. We are first and foremost a network of real people, and this network is being built by volunteers! If you simply want to complain or bring something to Niantic's attention, your post would be better suited elsewhere.\n\n**Research**\n\nThe community culture here also attracts the more analytically-minded element of Pokemon GO. Consequently, the Silph Research group was formed to align this brainpower and leverage the massive Silph datasets that the community can gather. We post our findings in infographics, videos, and walls of text on Reddit. Check out the top bar for [links to the current pools](https://www.reddit.com/r/TheSilphRoad/comments/13fwpg8/current_raid_quest_rocket_egg_pools/).\n\n**Final words**\n\nFinally, welcome once more! We're glad to have you join us on the Road :) \n\n\\- The Silph Executives -\n\n[Link to other Questions & Answers posts](https://www.reddit.com/r/TheSilphRoad/?f=flair_name%3A\"Weekly%20Megathread\")",
        "num_comments": 457,
        "comments": [
            "Do we have a decent idea what the GoFest Global Necrozma raids will be like schedule-wise? How often how long, egg timer duration? Or put another way, how many Necrozma raids can one gym be expected to host throughout the event?",
            "I know Kyogre is a functional hundo, but Primal Kyogre isnt. Should I hold back on my functional hundo Kyogre because of this when thinking about Master League with Megas?",
            "Has anyone else had their game start using low res graphics after the recent forced update? Happened to me and can't figure out how to fix it. Already tried uninstall reinstall, and download all assets. Nothing.",
            "As a rural player am I just cooked? I was really hyped for this mega rayquaza event, and I just learned you cant remote raid elite raids. So am I just locked out of rayquaza for now?",
            "Is there going to be a fossil week? Was it called adventure week last year?",
            "How common are unown events? Is it guaranteed like once a year? \n\nI just started playing again after taking years off and I still need unown to complete my Johto dex. Is buying the Go Fest ticket just for that worth it, or will I be able to get unown another way soon?",
            "My gf and I will be road trippin from Mobile, AL to Fenwick Island, DE this weekend. Any suggestions on places to stop and play along the way? Should be going through Atlanta, Charlotte, Richmond, DC, & Baltimore. We live in a small town in Alabama which doesnt have my stops/gyms etc. Any recommendations you guys have would be very much appreciated.",
            "The routes in my area currently arent appearing in the game, but are showing in campfire. Does anyone have a fix for this?",
            "Any sub or group in Rio de Janeiro? I've heard a lot of stuff about getting your phone stolen from your own hands so I'm a little afraid to play there once I arrive.",
            "Pretty simple question, but I've never done an in-person go fest before. I did one of the in-person Go Fests and got the marshadow. If I buy the global ticket, do I get a 2nd Marshadow or is it replaced with something else?"
        ]
    },
    "Pokemon GO's 8th Anniversary Event Megathread": {
        "title": "Pokemon GO's 8th Anniversary Event Megathread",
        "score": 68,
        "url": "https://www.reddit.com/r/TheSilphRoad/comments/1dq3g2u/pokemon_gos_8th_anniversary_event_megathread/",
        "content": "Everything you need to know about the event, all in one place. A lot of these pieces will be verified by the Silph Research Group, so throughout the post we'll use the formatting:\n\n* *Italics*: Reports from comments or single Research Group report\n* **Bold**: Multiple Research Group reports\n\nAlso note that (s) will be used for species whose shiny form is available, and (s?) for new shinies that we haven't seen yet.\n\nThis verification isn't meant to replace reports here, rather to provide an extra level of verification and depth to the event. Travelers are always welcome to join here and help out with data collection: https://discord.gg/WpAvRRsaRT\n\nHave fun and stay safe this week!\n\nhttps://pokemongolive.com/post/pokemongo-8th-anniversary\n\n**Event Date:** Friday, June 28, at 10am to Wednesday, July 3, 2024, at 8pm\n\n# Bonuses\n\n* Introduction of Party Hat Grimer and Muk\n* Meltan shiny reenabled\n* Increased change to become Lucky Friends\n* Friendship levels increases twice as fast\n* Find 8 or 88 Gimmighoul coins when spinning Golden Lured Pokestops\n* Rolling bonuses\n   *  Fri/Saturday - 1/2 egg hatch distance \n   * Sun/Monday - 2x Catch XP\n   * Tues/Wednesday - 2x Catch stardust\n* Timed and Paid Timed Researches\n* Paid Masterwork research \"Whisper in the Woods\" for players who haven't already completed one for shiny Celebi\n* Trainers who finish the Masterwork research, or already have shiny Celebi get the following bonuses until the end of the Party event:\n    * 2× Incense duration\n    * 2× Daily Adventure Incense duration\n    * 2× Lucky Egg duration\n* Showcases\n\n# Boosted Spawns\n\nHere's what is listed in the announcement. Anything else to report?\n\n* Party hat Bulbasaur (s)\n* Party hat Charmander (s)\n* Party hat Squirtle (s)\n* Cake hat Pikachu (s)\n* Party hat Grimer (s?)\n* Party hat Eevee (s)\n* Sprigatito\n* Fuecoco\n* Quaxly\n* Alolan Grimer (s)\n\n\nAlso on Fri/Sat:\n\n* Chikorita (s)\n* Cyndaquil (s)\n* Totodile (s)\n* Treecko (s)\n* Torchic (s)\n* Mudkip (s)\n\nOn Sun/Mon:\n\n* Turtwig (s)\n* Chimchar (s)\n* Piplup (s)\n* Snivy (s)\n* Tepig (s)\n* Oshawott (s)\n\nTues/Weds:\n\n* Chespin (s)\n* Fennekin (s)\n* Froakie (s)\n* Rowlet (s)\n* Litten (s)\n* Popplio\n\n\n\n# Field Research\n\nJust looking for event tasks. You can find the [full list here](https://docs.google.com/spreadsheets/d/e/2PACX-1vQk4n_p-dDpBNQyZfMPLsxMbBy68w8JepV7hKdT1T1hXS8TYM7-BmTeC3WGZXm3Q1PVZYlGXybRl99b/pubhtml?gid=118910739)\n\n|Task Text|Reward|\n|:-|:-|\n| Send a gift with a sticker | *Squirtle (s)*, *Bulbasaur (s)*,  Charmander (s)\n|| Chikorita (s) |\n| Spin 2 Pokestops or gyms | **Cyndaquil (s)** |\n|| Totodile (s) |\n|| Treecko (s) |\n| Take 3 snapshots of wild Pokemon | *Torchic (s)* |\n|| Mudkip (s) |\n| Make 5 curveball throws | **Oshawatt (s), Snivy (s)**|\n| Power up Pokemon 9 times | *Sprigatito*, *Fuecoco*, *Quaxly* |\n| Use 6 berries to catch Pokemon | *Froakie (s)*, **Fennekin (s)** |\n| Earn 4 hearts with your buddy | *Turtwig (s), Chimchar (s), Piplup (s)* |\n| Catch 7 different species of Pokemon | **Popplio**, **Rowlet (s)**, *Litten (s)* |\n|| Venusaur Mega Energy |\n| Make 8 nice throws | **25x Charizard Mega Energy, 25x Sceptile Mega Energy, 25x Blastoise Mega Energy, 25x Blaziken Mega Energy** |\n||Swampert Mega Energy |\n| Catch 8 Pokémon | 10 Poke Ball, 5 Great Ball, 2 Ultra Ball |\n\n# Raid Bosses\n\nYou won't see any new bosses until 11:00am local time. [Difficulty ratings](https://docs.google.com/spreadsheets/d/e/2PACX-1vQk4n_p-dDpBNQyZfMPLsxMbBy68w8JepV7hKdT1T1hXS8TYM7-BmTeC3WGZXm3Q1PVZYlGXybRl99b/pubhtml?gid=1244874466)\n\n|Tier|Raid Bosses|\n|:-|:-|\n|1| Party hat Bulbasaur (s), Party hat Charmander (s), Party hat Squirtle wearing a party hat (s), Cake hat Pikachu (s), Party hat Grimer (s?)|\n|3||\n|5||\n|Mega||\n\n# Timed Research\n\n**Stage 1**\n\n* Earn 8 hearts with your buddy - Party hat Bulbasaur (s)\n* Catch 88 Pokemon - Party hat Charmander (s)\n* Spin 8 different Pokestops or gyms - Party hat Squirtle (s)\n* Earn 8888XP - Party hat Wurmple (s)\n* Make 88 curveball throws - Party hat Wobbuffet (s)\n* Earn 8888 stardust - Party hat Nidorino\n* Evolve 8 Pokemon - Party hat Raticate\n\nRewards: 8888 stardust, Cake hat Pikachu (s), 8888XP\n\n**Stage 2**\n\n* Autocompleted - Meltan (s)\n* Autocompleted - Meltan (s)\n* Autocompleted - Meltan (s)\n* Autocompleted - Meltan (s)\n* Autocompleted - Meltan (s)\n* Autocompleted - Meltan (s)\n* Autocompleted - Meltan (s)\n* Autocompleted - Meltan (s)\n\nRewards: Meltan (s)\n\n# Paid Timed Research - 8th Anniversary Party Premium Timed Research\n\n**Stage 1**\n\n* * Earn 8 hearts with your buddy - Lucky Egg\n* Catch 88 Pokemon - Incubator\n* Spin 8 different Pokestops or gyms - Rocket Radar\n* Earn 8888XP - Premium Battle Pass\n* Make 88 curveball throws - Poffin\n* Earn 8888 stardust - Star piece\n* Evolve 8 Pokemon - Incense\n\nRewards: Super Incubator, ??? encounter, 88888XP\n\n# Whisper in the Woods Masterwork Research\n\n**Stage 1**\n\n*",
        "num_comments": 146,
        "comments": [
            "Can any of our New Zealander friends confirm yet if they did indeed turn shiny Meltan back on, and if the mystery box recharge time is down to one day?",
            "Can confirm shiny meltan is live",
            "Any news on Community Day moves by evolving for the starters?",
            "Any word on lucky rates?",
            "How common are the Mega Energy granting tasks, and did they cram all of the Mega starters into one task?",
            "Someone confirm the showcase for the weekend",
            "Popplio shiny hasnt been released yet",
            "So I've tried multiple times to set up Pokemon Home, but it makes it sound like I need an account on a Switch if I don't want to use a guest account, which it says doesn't get mystery boxes. Can anyone confirm this is accurate?",
            "Question about the Mystery Box spawns: Do you get more if you catch the spawned Meltan, or is the rate of appearance basically the same if you let each one despawn? From a rough estimate opening a box today, it seemed to be the same (about one a minute) regardless of whether I caught the spawned Meltan or let it despawn, but I'm curious if we know any numbers (and whether this also applies to the Incenses). Thanks!",
            "The number in the field research task matches the generation of the starter that it rewards (e.g. \"spin 2 PokStops\" rewards a Gen 2 starter). This is a nice detail, and it makes it easy to remember what the possible reward Pokmon are. Kudos to the designer(s) on that one."
        ]
    },
    "Free Meterorite Code!!": {
        "title": "Free Meterorite Code!!",
        "score": 1150,
        "url": "https://i.redd.it/1x42z0hoxd9d1.jpeg",
        "content": "7QJ6P2NX2U7KX",
        "num_comments": 155,
        "comments": [
            "So instead of giving you a Meteorite, the code gives you a duplicate of the timed research to obtain a Meteorite, including \"Win an Elite Raid\" which judging by the early reports, just seeing one is going to be a miracle...\n\nSee you all for the make up event soon!",
            "The advertised free meteorite... \n\nNiantic: but you have first win an elite raid or find one which might or might not appear at your city...",
            "Well that's horrible, I was hoping I would be able to at least get the meteorite for my lucky Ray and get the energy who knows when, but looks like Niantic hates to see it's players happy.  \n\nStill looks like there's barely any raids spawning, perhaps we will see a make up after all...",
            "Woot, promising a code for a free meteorite then making you have to do a elite Raid to claim it is pretty bait and switch. Seems like a very pokemongo thing to do.",
            "Wait, it's a code for a timed research in which you have to do an Elite Raid? This is worthless then",
            "Great. Now let us invite people to Rayquaza raids. Otherwise, the meteorite is useless since some of us don't have enough Mega energy.",
            "So it's just another timed research? Love that I can't do these ",
            "Got excited until I read the comments. This reminds me of that gif of the dude opening a fridge only to be disappointed. Meh.",
            "I redeemed it but it looks like it gives the timed research. Not sure where you're located but I'm in the US so I shouldn't have it until tomorrow.",
            "I'm recovering from surgery earlier in the week. I physically can't go out to do an elite raid, so I was looking forward to at least getting this one Meteorite. It is what it is, but they really shouldn't have phrased it like they did."
        ]
    },
    "Mega Rayquaza has boosted CP Multiplier while having 22500 HP at the same time": {
        "title": "Mega Rayquaza has boosted CP Multiplier while having 22500 HP at the same time",
        "score": 193,
        "url": "https://www.reddit.com/r/TheSilphRoad/comments/1dr2227/mega_rayquaza_has_boosted_cp_multiplier_while/",
        "content": "When Mega Rayquaza becomes a Elite Raid Boss, we all wondered how its stats are. Are they following Mega Legendary Raids (\\~0.79 CP Multiplier, 22500 HP)? or Elite Raid (1 CP Multiplier, 20000 HP)? Turn out, it seems both of them are wrong, and instead, Mega Rayquaza has both stats combined on the difficult side, with 1 CPM and 22500 HP.\n\nVideo evidence: [https://www.youtube.com/shorts/OtifiwF5ZRI](https://www.youtube.com/shorts/OtifiwF5ZRI)\n\nAs soon as we know its CP, 88200, we can immediately tells it is the same as how much it had in Mega Legendary Raid, aka 22500 HP. But, we knew CP value of raid boss does not associated with CP Multiplier correctly. In order to find out its CP Multiplier, the most straightforward way is let a high HP Pokemon tanks its powerful charged move and see how much it takes.\n\nThis simulation shows how much damage an Outrage from Mega Rayquaza on Blissey: \n\n[https://www.pokebattler.com/fights/attackers/BLISSEY/quickMoves/ZEN\\_HEADBUTT\\_FAST/cinMoves/HYPER\\_BEAM,MOVE\\_NONE/levels/30/ivs/FFC/defenders/RAYQUAZA\\_MEGA/quickMoves/AIR\\_SLASH\\_FAST/cinMoves/OUTRAGE,MOVE\\_NONE/levels/RAID\\_LEVEL\\_MEGA\\_5/strategies/CINEMATIC\\_ATTACK\\_WHEN\\_POSSIBLE/DEFENSE\\_RANDOM\\_MC?includeDetails=true&weatherCondition=NO\\_WEATHER&randomAssistants=0&numMegas=0&numParty=1&monteCarlo=DEFENSE\\_RANDOM\\_MC&seed=1719628042625](https://www.pokebattler.com/fights/attackers/BLISSEY/quickMoves/ZEN_HEADBUTT_FAST/cinMoves/HYPER_BEAM,MOVE_NONE/levels/30/ivs/FFC/defenders/RAYQUAZA_MEGA/quickMoves/AIR_SLASH_FAST/cinMoves/OUTRAGE,MOVE_NONE/levels/RAID_LEVEL_MEGA_5/strategies/CINEMATIC_ATTACK_WHEN_POSSIBLE/DEFENSE_RANDOM_MC?includeDetails=true&weatherCondition=NO_WEATHER&randomAssistants=0&numMegas=0&numParty=1&monteCarlo=DEFENSE_RANDOM_MC&seed=1719628042625)\n\n  \nwhich means it should deals 152 damage if it has CP Multiplier of \\~0.79.\n\nHowever, the result was 181/371 after taking one Outrage from full, which is 190 damage, which aligns better to Elite Raid stats.\n\nSo, how much is the difference between this stats and normal T6? It basically cancelled both Best Friend bonus and non-STAB Primal Boost while it does 20％ more damage to your team. So make sure you know what you are doing before attempting to fight it with a small group.",
        "num_comments": 58,
        "comments": [
            "So unless you have 4+ this is going to be extremely hard work. Excellent.",
            "Doing gods work out here. Speedy analysis too, thanks bro",
            "Jesus christ, Mega Legendary raids are already T6. This practically makes it a T7/T8 raid.",
            "Yep, Certainly felt the extra CPM. Those attacks hit hard. \n\nHad a couple of raids where It was 6 of us, my brother and my wife using lvl 40 non shadow counters I was the only one using level 50 shadows and the other 3 accounts were mid 30s. Still smashed them out within about 210 seconds. But be prepared to revive a lot. Aerial Ace just about OHKOs' most things, as does Ancient Power. Outrage is definitely a dodge or die.",
            "Why only tier 3 or 4 rewards though? There were only 2 raids in my city. I hung around for an hour to do a second one, and caught neither. Nowhere near enough balls for low level players and that difficulty.",
            "We cleared it with 4 accounts, best friend and party bonus, fairly comfortably on the timer.",
            "So I can only guarantee two accounts - should I even bother?",
            "Did it with a 9-person raid of avg lv40+ trainers. Not the most optimal line up of Pokmons and we took it down to about 10% before time runs out. So you guys do the calculations.",
            "People keep mentioning the primals due to the passive 10% boost to attacks, but which primal\nIs best to have? Or is it the case of leave it in the back, when you get to it coming out, relobby, heal n renter?",
            "Thanks. I'm on it.\n\nWill get Pokebattler updated asap"
        ]
    },
    "[Niantic Help] Trainers, we have resolved an issue limiting the availability of Mega Rayquaza Elite Raids. We are planning a make good for affected Trainers and will share more details as they become available.": {
        "title": "[Niantic Help] Trainers, we have resolved an issue limiting the availability of Mega Rayquaza Elite Raids. We are planning a make good for affected Trainers and will share more details as they become available.",
        "score": 294,
        "url": "https://x.com/niantichelp/status/1806850577013350565",
        "content": "",
        "num_comments": 130,
        "comments": [
            "Best we can do is 5 revives and 10 Pokeballs.",
            "This could have been prevented by having the eggs appear 24 hours before start",
            "\"make good for affected trainers.\"\n\nOh boy! 3 razz berries incoming",
            "Why not just make mega rayquaza a raid day  they making it harder on themselves for no reason",
            "Every. Dang. Time. It's **always** something.",
            "It literally took them the entire Friday work day to fix elite raids",
            "Enjoy your 5x Mega Rayquaza (Postcard stickers)!",
            "Thanks again for the beta test, Aussie, NZ, and Japan bros.",
            "Niantic: Wait, people actually wanted to do these raids?",
            "Were sorry about the mega rayquaza eggs. Enjoy this timed research rewarding trainers with 5 encounters with party hat pikachu. Luck trainers may encounter a shiny one."
        ]
    }
}