{
    "Updated Rules - No Cross-Subreddit Trolling/Harassment": {
        "title": "Updated Rules - No Cross-Subreddit Trolling/Harassment",
        "score": 301,
        "url": "https://www.reddit.com/r/thesopranos/comments/t9x9g5/updated_rules_no_crosssubreddit_trollingharassment/",
        "content": "The Sopranos Subreddit Rules\n================\n\n**Please adhere to the subreddit's rules. If found violating any of these rules, posts or comments may be subject to removal. Users may also face ban.**\n\n---\n\n###1. Keep a Civil Discussion/No Discrimination.\n\n* Be civil when discussing a topic with another person. A direct quote or mentioning a specific scene in the tv show or movie are fine, but don't let it get out of hand or personal. We expect users to treat each other with respect. Additionally, any comments or posts that have racial, ethnic, homophobic, sexist or otherwise offensive slurs in them will be removed. Users making these comments, especially repeatedly, can expect a permanent ban.\n\n###2. No Cross-Subreddit Trolling/Harassment.\n\n* You make all of us look bad when you go into the /r/mafia subreddit and heckle and harass others. Doing so will lead to a permanent ban on their subreddit as well as ours.\n\n###3. Posts must be related to The Sopranos/The Many Saints of Newark.\n\n* All posts must be related to the Sopranos universe in some way. This means it must be related to the original six seasons, movie or any podcasts or books. Any other posts will be removed.\n\n###4. No Pictures/link posts are allowed.\n\n* Due to the large amount of memes and pointless pictures getting posted, it takes away from the content on this subreddit. If you wish to post pictures, head over to /r/CirclejerkSopranos.\n\n###5. No Politics or Religion.\n\n* This is a subreddit for The Sopranos Universe. Not politics or religion. Democrat, Republican, etc; it doesn't matter! Jokes are ok, but it has to be specific with The Sopranos universe and not current day events. Jokes or memes related to the current war on Ukraine will not be permitted and users can expect a permanent ban.\n\n###5. Threads marked [SERIOUS DISCUSSION] is not a place to meme.\n\n* Posts that are marked [Serious Discussion] are meant to have an actual discussion and is not a place to troll or include memes or one-liners. Not abiding by this will result in warnings and could lead to a permanent ban.",
        "num_comments": 0,
        "comments": []
    },
    "Vito's New Hampshire romp was 99% fantasy.": {
        "title": "Vito's New Hampshire romp was 99% fantasy.",
        "score": 334,
        "url": "https://www.reddit.com/r/thesopranos/comments/1dqzgaj/vitos_new_hampshire_romp_was_99_fantasy/",
        "content": "He did drive away from NJ and go into new england.  I suspect the only real parts were fucking off on the handyman job, and killing that diligent woodsman concerned with car crash fault.\n\nThis rest was an ethereal fantasy sequence.  Romance, intense feelings, high drama, love-making at a picnic...\n\nRemember when Gene Pontecorvo said: \"Must be like kissing a fiyaman.\"\n\nJust one of those things which stuck in his subconscious.\n\nA motorcycle driving fireman who rescues kids from burning buildings.  How many fires are in one small town??  And a whole crew of fireman finochs?   And then everyone clapped. Madon!\n\nI think his fantasy took over when he was reading the fitness magazine in bed.",
        "num_comments": 136,
        "comments": [
            "11:30 has to be. Look at the angle of the sun.",
            "This storyline always made absolutely NO sense to me. \n\nThere is a zero percent chance Vito just takes off randomly out of town, crashes and is aimlessly walking....and just happens across the gayest town in history. And not only that, the hottest one there, a grizzled, muscular firefighter nonetheless, is SUPER attracted to his jiggly, overweight self? I don't buy that shit for one second.",
            "Think I read an interview with Chase that it was based on the Twilight Zone Episode A Stop at Willoughby. About an imaginary place a stressed out yuppie invents in order to escape his mundane life.",
            "yeah OP youre absolutely right \n\ncause that was Gino not Vito",
            "Johnny cakes are fucking delicious though.  \n\nIve said my piece.",
            "This actually is the only explanation of this hallmark episode that makes sense.",
            "is that all you guys do is talk about cooze?!?",
            "When Vito hauls cock in his ass, hes got to make two trips for cornholer Jim",
            "Hey Vito, did Johnny Cakes ever really exist?",
            "Why not? Last year you believed that flying saucer was over East Rutherford "
        ]
    },
    "Which character did you dislike at first but eventually grew to enjoy on a rewatch?": {
        "title": "Which character did you dislike at first but eventually grew to enjoy on a rewatch?",
        "score": 242,
        "url": "https://www.reddit.com/r/thesopranos/comments/1dqv0hp/which_character_did_you_dislike_at_first_but/",
        "content": "For me, it was Ralph. I thought he was too lousy to even find funny, but on my rewatches he’s such a well written prick who cracks so many good one liners and snarky bits of dialogue. Damn that horse killing mf ",
        "num_comments": 222,
        "comments": [
            "Janice. I hate her more than ever but I came to appreciate her as a character. So infuriating, dramatic, and manipulative. We all know someone who has at least some Janice in them.",
            "Livia for sure. I could not STAND her the whole first season, I almost turned off the show because she was so annoying. On rewatches I die laughing at every scene she's in and look forward to them. I wish the lord would take me now, op was a saint",
            "I go back n forth with Artie.  Hes such a pussy you feel bad for him but then he does something to really make you go . Da fuq you doin Artie.",
            "Honestly for me it was Paulie, on first watch I didn't find him interesting until like season 4 but 2nd and on I noticed his little mannerisms and habits that I love , like when he tells a joke hes so proud of it he repeats it to make sure everyone understood his joke lol",
            "The homeless woman with the newspaper up her ass",
            "Carmine, he was the only real stand up guy, always about the money.",
            "Its the jackeeeeeet  did it for me the second time around",
            "Janice. She is fucking hysterical, but with the compassion and respect that shes famous for",
            "Carmine Jr. I thought he was an idiot the first time around. Second and beyond was that hes still an idiot but not a bad person.",
            "Honestly, I appreciate AJ as a character more now than I did originally. I used to just think of him as some stupid, bratty, entitled kid for the most part, but on rewatch its kinda interesting to see how AJ is not only the polar opposite of Tony but also how he evolves (and devolves) into an exaggerated reflection of Tonys own failures as a person. Robert Iler absolutely *nailed* the character."
        ]
    },
    "Hey, it’s really me.  You said to make a post in 5 minutes.": {
        "title": "Hey, it’s really me.  You said to make a post in 5 minutes.",
        "score": 77,
        "url": "https://www.reddit.com/r/thesopranos/comments/1dr2eaf/hey_its_really_me_you_said_to_make_a_post_in_5/",
        "content": "Uhh… watching a guy clean his windshield.  He’s got a green hat on.\n\nSome birds up ahead flying…\n\nSome weeds across the street there…\n\nI think I can see a rabbit or a squirrel… I donno what it is… \n\n#…maybe it’s a possum?\n",
        "num_comments": 32,
        "comments": [
            "No Im not upvoting anything important right now",
            "Its that big huh? Well i can be there in half an hour.",
            "Well, to be continued I guess. r/CirclejerkSopranos needs me. Well figure this out another time.",
            "Ngl you had me for a second. I'm like wtf is dude talking about till I realized the scene you were referring to. Nice job.",
            "I remember when you used to wait in the car",
            "Im going to sleep. Let me get some of that carpet.\n   ",
            "How can it be a possum if its askew?",
            "Fear knocked. Faith answered. There was no one there",
            "Looking for flying saucers in east Rutherford is more rewarding.",
            "It's a possum, quick, get it before someone from Elvis country eats it"
        ]
    },
    "If Minn Matrone had played it cool when she caught Paulie in her house, would he still have killed her? ": {
        "title": "If Minn Matrone had played it cool when she caught Paulie in her house, would he still have killed her? ",
        "score": 82,
        "url": "https://www.reddit.com/r/thesopranos/comments/1dqztkh/if_minn_matrone_had_played_it_cool_when_she/",
        "content": "Something I've always wondered. Minn was home unexpectedly, she freaked out when she saw Paulie, and things escalated. But pretend she doesn't freak out, she pretends to buy Paulie's BS story, and just plays it off. What does Paulie do? I appreciate your thoughts.",
        "num_comments": 51,
        "comments": [
            "He could've just said he was there and it was a joke. Vito almost got away with using that line anyway.",
            "Those Parker House Rolls belonged to his Ma! He had the right to defend himself.",
            "One of my favorite little details is her reaching for her life alert necklace and him saying dont set that fucking thing off!",
            "She would have never kept her fucking mouth closed.",
            "I dont know who this Paulie you are all speaking of is, his name is Clarence, and he just wanted a cup of coffee.",
            "She must have crawled under the pillow for warmth",
            "Dont set that thing off!",
            "Yeah if she could've acted as stupid as Paulie's ma did with the prank call and weird sheks, it easily could've saved her life.  Sometimes, you gotta lie to let someone scarier get away with their lie.",
            "Social club??!!?????! Shes gotta go!",
            "Bitch tried to cop Mas dinner rolls!"
        ]
    }
}