{
    "Living in a Post Update World (For Rent edition)": {
        "title": "Living in a Post Update World (For Rent edition)",
        "score": 37,
        "url": "https://www.reddit.com/r/TheSims4Mods/comments/18iczo4/living_in_a_post_update_world_for_rent_edition/",
        "content": "# We made it!\n\nThank you to everyone in the community for your patience and kindness as we tried some new rules during the latest For Rent update. Most mods have been updated since the latest patch and we are happy to get back to our regularly scheduled activities.\n\n# New Rule (Trial Run)\n\nThat being said, we are going to trial run a change to the rules going forward around posts requesting help with mods being \"broken\" or \"glitchy\" etc. These posts will now have to be accompanied by additional information to help the community better understand the issue. Information like your mod list, what you've tried to resolve the issue, relevant screenshots are all things that would provide additional information.\n\nPosts titled \"Help?\" with a screenshot and nothing else will run the risk of being removed as spam. (Providing additional information in the comments below the automod response is also sufficient.)\n\nIf you see a post that you do not think meets the criteria above, feel free to report it and a member of our Mod Team will review it. Even if you think a post does not meet the criteria, please remember to be respectful of other community members. Helping others and sharing our knowledge of mods and custom content is the reason this subreddit exists, whether it's as simple as sharing your favorite creator or a work around for a broken mod.\n\n*As The Sims 4 continues to roll out content or any major updates, we will reinstate our \"no broken mods\" rules temporarily to avoid spam.*\n\n# Thank You\n\nThank you to everyone in this community,  your willingness to lend a helping hand, provide advice, and engage in constructive discussions is what makes our subreddit special. We will continue to work on our FAQ/Wiki to better support the subreddit in the new year.\n\n*If you would like to assist in creating a wiki section, please reach out via modmail.*\n\nPlease remember to be kind and as always, update your mods.",
        "num_comments": 2,
        "comments": [
            "I love this new update. I think it will cut back on a lot of help posts, since people will be forced in investigate on their own first.",
            "Thanks for this :) helps declutter!"
        ]
    },
    "Oh my god": {
        "title": "Oh my god",
        "score": 65,
        "url": "https://i.redd.it/hqgmsknffd9d1.jpeg",
        "content": "Didn't know that extreme violence mod could cause this as default. This was my toddler's make up when she aged up. Not a fan lol ",
        "num_comments": 7,
        "comments": [
            "https://preview.redd.it/6m1a77hhbe9d1.jpeg?width=622&format=pjpg&auto=webp&s=d3cabe45a921781fa9792a1ead9338bbd1a8f1a4\n\nWhat..what is that????",
            "I'm pretty sure that in the latest update of this mod, this no longer happens... Make sure you have the latest version...",
            "Honestly I wouldn’t even be mad about this lmao",
            "Wtf??? 😂😂😂 She looks like she's had a rough day bless!! 🙈😂😂",
            "Looks just like the Wendy's sign in my neighborhood lol",
            "Bro that happened to my sim and for some reason it was like face paint when I found it in cas🤣",
            "I’m calling cps"
        ]
    },
    "I can't stop. I... I can't.": {
        "title": "I can't stop. I... I can't.",
        "score": 1011,
        "url": "https://i.redd.it/op278np8e3a81.png",
        "content": "",
        "num_comments": 96,
        "comments": [
            "Your computer sound like an airplane, I jus know it",
            "I can see the lag now",
            "Can your sims walk around the area 😭",
            "Are u using a space station computer? Idk if I should be impressed or scared",
            "\"I tend to be a fan of adding clutter, and sometimes wonder if I'm adding too much stu--...\"\n\n*Looks at OP's post*\n\n\"Oh, never mind, I'm good!\"",
            "My computer would've explode 😔",
            "Girl link the items I need especially that Christmas tree",
            "Something would definitely be broken if i tried this",
            "i need your cc oh my god",
            "loading this room would *fry* my laptop, and my legs that rest beneath it 😭"
        ]
    },
    "Does anyone have this?": {
        "title": "Does anyone have this?",
        "score": 9,
        "url": "https://i.redd.it/vpuwcwqive9d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "It’s free on Kemond.su",
            "Yes, I belong to his Patreon."
        ]
    },
    "Wicked whims": {
        "title": "Wicked whims",
        "score": 3,
        "url": "https://www.reddit.com/r/TheSims4Mods/comments/1dr5l6c/wicked_whims/",
        "content": "I don't know why, but I can't get wicked whims to work. It was in its own folder in the mods folder but then I took the stuff out of the folder and put it outside of the original wicked whims folder in the mods folder. I don't know if that would fix it but thought I'd see what people say. I have all the animations installed too. I also have a bunch of other random stuff installed for the sims so I don't know if that would be why (including but not limited to MCCC and basemental drugs but also a lot of CC). If no one knows why, I'll just uninstall it and wait for it to get updated again. ",
        "num_comments": 4,
        "comments": [
            "Uninstall what you have now and do a fresh install. Literally just unzip it directly into your Mods folder and do not take anything out of it.\n\nMake sure your script mods are enabled in game. \n\nIt’d be more helpful if you could describe what’s not working. Does the Wicked menu not pop up at all for you when you click on something, anything at all?",
            "when you unzip the WW folder, there is another folder inside that file called WickedWhims. place that folder directly in mods file",
            "I just installed it a few minutes ago. Wicked menu doesn’t pop up at all, it doesn’t show up in mods list when I look at it in game, nothing",
            "Like various items will show up but nothing works"
        ]
    }
}