{
    "A Beloved Pet RIP": {
        "title": "A Beloved Pet RIP",
        "score": 483,
        "url": "https://i.redd.it/cd7imow07h9d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "This is so lovely and poignant.",
            "Surely he had a name!",
            "He deserved a lake burial",
            "It’s really moving. Might have been added to make the line rhyme (you understand / out of our hand).  Even so, it makes it very personal and brings the reader in.",
            "It's for the rhyme. It's a poem.",
            "Lol apparently it was just called fish, it has a house named after it now though, Fish Cottage in Blockley, Gloucestershire. It’s owner was called William Keyte and the fish was a trout.",
            "Love the ‘you understand’",
            "Love knows no boundaries.",
            "His name was Dolie!",
            "do lie."
        ]
    },
    "A gallery of historical subcultures, 60s-80s": {
        "title": "A gallery of historical subcultures, 60s-80s",
        "score": 57,
        "url": "https://www.reddit.com/gallery/1drbp3q",
        "content": "",
        "num_comments": 9,
        "comments": [
            "Punks and Mods and Hippies and Goths, oh my! Great photos, thanks! Reminds me of my heavily accessorized punk days.",
            "The 60s to 80s were truly transformative decades. These images capture their essence beautifully",
            "What is the subculture of the three dudes and their mini cooper in slide 5?",
            "What were the vending machines on pic 4?",
            "Thanks for sharing some great photos. Nice to see some other people may have a few 'wow! I forgot I had that phase' memories. 🤣😊",
            "I feel like I could walk by any of these people in the first five pics tomorrow lol",
            "Looks like one says \"Cadburys\",so maybe chocolate,if that's actually what it says?",
            "More specifically, Countercultures.",
            "Mods"
        ]
    },
    "My dad and his brother outside 10 Downing Street - mid 1960s. ": {
        "title": "My dad and his brother outside 10 Downing Street - mid 1960s. ",
        "score": 213,
        "url": "https://i.redd.it/1zkas856eg9d1.jpeg",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Which one is your dad? The one who looks like he just left a flaming bag of dog poo for the Prime Minister, or the one who knows he's going to be blamed for it and everything else?",
            "Interesting how lax security was back then, you could just walk up to the door.",
            "Could be a Simon and Garfunkel album cover.",
            "😂 the latter."
        ]
    },
    "Grandpa James": {
        "title": "Grandpa James",
        "score": 942,
        "url": "https://i.redd.it/zri998u2wd9d1.jpeg",
        "content": "A photo of my grandfather born in Montserrat, British West Indies in 1902. He came over to live in Harlem, NY around 1922. He worked at the post office and a bank and retired from both. He was very distinguished and the life of the party! He lived to be 94. ",
        "num_comments": 50,
        "comments": [
            "dude has a massive head",
            "The boys used to call him Big Head Jones.",
            "Man, folks used to dress to the nines for a portrait! It was an occasion.",
            "Wonderful to have that history available to you.",
            "Looks like a gentleman of character and dignity. Penetrating gaze too.",
            "He looks like a real gentleman.",
            "Love this. The pose is striking, and I love how both the pin & wristwatch accentuate his outfit. \n\nSide Note: Do we still make 1 button suits? I’d rather wear that than the 3 button suit that has a weird 2 button rule",
            "So classy! Thanks for sharing your gorgeous ancestor with us.",
            "He looks too young to be a Grandpa",
            "Nice photo. Very gentlemanly. Sounds like he was an amazing man! Thanks for sharing."
        ]
    },
    "Circus performer, close to a caravan car. Circa 1930s. ": {
        "title": "Circus performer, close to a caravan car. Circa 1930s. ",
        "score": 94,
        "url": "https://i.redd.it/nepglx3vlg9d1.jpeg",
        "content": "",
        "num_comments": 3,
        "comments": [
            "I’ve all of a sudden got Stranglehold stuck in my head.",
            "Not sure what was her act, I mean trapeze artis used more flamboyant outfits so maybe, but not sure.",
            "The World’s Strongest Woman!"
        ]
    }
}