{
    "The Walking Dead: The Ones Who Live S01E06 - The Last Time - Episode Discussion": {
        "title": "The Walking Dead: The Ones Who Live S01E06 - The Last Time - Episode Discussion",
        "score": 262,
        "url": "https://www.reddit.com/r/thewalkingdead/comments/1bsoqxk/the_walking_dead_the_ones_who_live_s01e06_the/",
        "content": " \n\n# All sub rules apply\n\nREMINDER: This is a piracy free sub. Do not ask for streams or provide links to sites with illegally hosted content. These actions will result in a ban.\n\n**Season 1 Episode 6, The Last Time**\n\n* **Released (AMC+ & AMC):** March 31, 2024\n\n**Synopsis**: Rick and Michonne have to perform a near-impossible miracle.",
        "num_comments": 1262,
        "comments": [
            "Rick will ONLY swear on his wife's sword!",
            "My God, Terry O'Quinn does not age, does he?  I mean, he still looks the same as he did when I saw him in Lost.",
            "Rick beats a guy to death with his bare hand(s) and Michonne comes out of the elevator and reacts like it’s just a normal Tuesday. Yeah, they are crazy.",
            "So Thorne and Jadis got the echelon briefing and was like “Hell yea, I’m in!!!” Wtf lol",
            "I'll never forget Rick tearing out that biker's throat, holy hell",
            "I love how Michonne coming upon Rick beating a man to death and reacts like it's totally normal.  Then again, not the worst thing she's seen him do.",
            "Halloween 2010 to Easter 2024, been a good ride yall!",
            "So 2 things I have to say theorywise\n\n1.) I now think in DD, Carol told Daryl over the walkie that Michonne was back. Sounded way too calm for her to say Rick in that cutout, maybe she wants to surprise him.\n\n2.) I honestly dont know where we go from here on the macro level as a franchise. Sure there can be smaller stories through Tales or spinoffs. But now you have the Commonwealth which is huge and stable in Ohio, the CRC airlifting supplies everywhere, and Victor Strand’s crew driving supplies all over the south. \nI guess a final stand against the walkers/variants or a search for a cure can be in play but tbh at the very least America seems to be in good shape, aside from NYC which as a native New Yorker, can say it’s not that much different 🤷🏻‍♂️",
            "Rick, you may wanted to have kept the prosthetic until AFTER you and Michonne escape.",
            "I enjoyed it but a single episode to totally destroy/reform the entire CRM after all of the buildup it had felt bizzare."
        ]
    },
    "RIP the best boy, Seven who plays dog has passed away 💔": {
        "title": "RIP the best boy, Seven who plays dog has passed away 💔",
        "score": 6559,
        "url": "https://www.reddit.com/gallery/1df5qxk",
        "content": "",
        "num_comments": 240,
        "comments": [
            "I didn't need to know this 😢",
            "“If dog dies, we riot”\n\nso when and where?",
            "We’re getting old. This sucks.",
            "All dogs go to heaven. Rest well good boy.",
            "This is heartbreaking, I know everyone in the cast loved that dog😢",
            "I had such anxiety when he was in the scenes cause I was terrified he was going to get eaten. I grieved for Shiva and she was just CGI! 😂",
            ":( This is heartbreaking. RIP Seven. ❤️",
            "Daryl's pants rock\n\nRIP dog",
            "This is tragic my eyes feel watery 💔",
            "I never even considered that the Dog could die before Daryl made it back from France."
        ]
    },
    "Honestly one of my favorite scenes in the whole show": {
        "title": "Honestly one of my favorite scenes in the whole show",
        "score": 135,
        "url": "https://v.redd.it/1wbzlltncf9d1",
        "content": "I don’t think I ever really gotten over Shane’s death. He was always one of my most favorite characters. Him and Rick together would’ve been unstoppable. It was so nice to finally see him again. Also it’s crazy to think that the entire group had reached Shane’s mentality in like season 5. ",
        "num_comments": 20,
        "comments": [
            "Brilliant scene. How it flowed greetings to reminiscing, to teasing and joking, to insults then instructing, finally apology and acceptance. All within a few minutes while eating burgers and fries. The nose and ears jokes were hilarious. Lincoln looked so startled when Bernthal started slapping his chest. I don't think he knew it was coming.",
            "Top tier scene for sure",
            "Easily, one of my favorite shots and scenes in the series.",
            "Two of the best actors of our lifetime",
            "Shane was a good man under difficult circumstances.",
            "I wanna know where they got the food from. It looks generic but those fries look good to me xD",
            "This scene just makes me want a burger everytime😅",
            ">Also it’s crazy to think that the entire group had reached Shane’s mentality in like season 5.\n\nNo. Shane's mentality was shelfisness. He would have gotten everybody killed, because he couldn't look past his nose.",
            "No. They didn’t. Shane was bad. He sexually assaulted people.",
            "This made me realize just how much I missed both Shane and Hershal."
        ]
    },
    "Male friendship": {
        "title": "Male friendship",
        "score": 83,
        "url": "https://www.reddit.com/gallery/1dqx77h",
        "content": "",
        "num_comments": 9,
        "comments": [
            "“You’re ma BROTHER”  fucking love that line I rewatch that episode just for that sometimes",
            "Rick and Daryl are by far the most closely bonded.\n\nDaryl feels, and literally is, responsible for Glenn's death.  His guilt drives most of his actions in s8 and s9.  Notably no one other than Daryl blames him, though he blames himself a lot.\n\nDaryl and Aaron are not really that close.",
            "Sorry, I seem not to be able to create posts with both tect and images... Help. :)\n\nHowever, here is the text I had written for the post:\n\nI know Daryl and Rick are seen like brothers (and they both even refer to one another as such) but I feel that Daryl and Glenn's friendship was the deepest.\n\nI get the feeling Daryl did not really confide in Rick or share openly with him, even though they bonded so much. It is true though that at a certain point >!Daryl mistrusted Rick and was willing to \"betray\" him in a sense!<.\n\nThen Daryl and Rick's and further on Daryl and Aaron's.\n\nWhich one do you think was the most meaningful?",
            "Daryl definitely had the deepest bond with Rick. They referred to and thought of each other as brothers. He will always feel guilty for what happened to Glen even though Negan is the one who killed him. Even Maggie doesn’t blame Daryl. \nI didn’t really notice Daryl and Aron being all that close but he knew Daryl could really appreciate that motorcycle and they did grow to trust each other. Although as someone else already mentioned, he didn’t share his feelings/fears with any of the men, only Carol and Beth.",
            "I will say that even though they weren't emotionally close as others have pointed out, Daryl and Glenn's eventual friendship does mark an important change in Daryl. He starts out being a total asshole, telling Glenn he's got big balls for a Chinaman, making cracks about Asian flush when they were drinking, and driving like an Asian. So when they're in the woods and Merle calls Glenn 'that Chinese kid' and Daryl pops off on him about how Glenn is Korean, that's a special moment. Knowing Glenn and learning to respect him changed Daryl to such a degree that he stood up to his big brother, probably for the first time in his adult life.",
            "Aaron has him over for dinner to ask him to help find more people, and knows Daryl well enough to know what that motorcycle would do for Darryl. (I’m sorry I can never remember if he has one or two r’s in his name) Darryl responds to good people, and he has a great sense of knowing someone’s character. That’s why he likes Aaron so much.",
            "Daryl didn’t confide in or share openly with any of these men, or men in general. He does that with Carol and Beth. \n\nDaryl never mistrusted Rick, and his “betrayal” to kill Negan was no less than the betrayal to spare him.",
            "I see Daryl and Rick as the brothers who grew up with each other, bickering all the time. Glenn being that one sibling who was born 10 years after them and doesn’t see his siblings much but when he does it’s always a memorable moment. \n\nAnd at the end of the day if one of them gets hurt the other 2 would come together and fight for their brother.",
            "He likes Aaron, but they are not that close.  Aaron and Gabriel are much closer.  Though Aaron focuses most of himself on Gracie (after losing Eric).  It's unfortunate they did not explore Aaron and Jesus relationship further, they seemed to be very good friends as well as potentially very complimentary to each other as a couple."
        ]
    },
    "Let's get real : What would you've done if you were in Shane's situation ?": {
        "title": "Let's get real : What would you've done if you were in Shane's situation ?",
        "score": 155,
        "url": "https://i.redd.it/l6k6ya2sxc9d1.jpeg",
        "content": "",
        "num_comments": 73,
        "comments": [
            "All the same, except we would continue walking at a turtle speed, since walkers were slow enough for those two to have a tea party",
            "Go get back in the truck. Honk and drive around to get walkers to follow me away from fema trailer so Otis could get what they needed. Then double back pick up Otis and all the supplies from the trailers, and police cruisers.",
            "I don't know but I sure as fuck wouldn't shoot a poor guy in the leg to save myself.",
            "I think what doesn’t get discussed  is that Shane was trying to sacrifice himself first. Otis was being all noble and refusing leave Shane behind. But he clearly wasn’t going to make it out by himself. Someone had to get those supplies back to Carl.\n\nNOT  saying Shane was right or wrong here. But he wasn’t trying to be a cold blooded killer, and the weight of his actions clearly pushed him over the (already fragile) edge.\n\nNobody was listening to him at that point. But even Lori seemed to soften towards him after someone told her that Shane killed Otis. She got why he did it. I don’t think she hated him for it either. \n\nI kind of even think that’s why Lori whispered In Rick’s ear about Shane being dangerous. The look on her face when Rick told her what happened- I think it could be interpreted as disappointment, that she didn’t count on Rick coming out on top of that fight.",
            "They absolutely, without a doubt could’ve both made it back to the car. They spend like a full minute tussling on the ground before the walkers catch up, they could’ve just kept walking, made it back to the car and fucked off\n\nSeason 2 was full of stupid bullshit like that",
            "I’d leave him behind, most likely, but I wouldn’t intentionally fuck him by shooting his foot.",
            "Definitely wouldn’t have shot Otis unless it was a mercy shot and he was already too far gone. My morals would have me dying trying instead of using him as bait.",
            "I'm not a Shane apologist or defender, but....\n\nIn Shane's defense for this one choice, he genuinely didn't see a way that guaranteed Carl got the medicine that didn't involve one of them sacrificing themselves. He knew that he was the one with a compromised ankle, and he suggested a plan to Otis where Otis would get the supplies to Carl while he stayed behind. Otis turned this down, and Shane thought they would both die, and Carl wouldn't get the help he needed.\n\nI don't believe Shane sacrificed Otis as a way to save himself. He did it to get the supplies to Carl, and he was ready to die if it meant saving Carl.\n\nLater on in the season, we will Shane slip more and more into self survival motives, but at this point, I believe this was done 100% with Carl in mind.",
            "I don’t remember the scene exactly but if the situation is so fucked then I’d kill Otis. Not shooting his ankle but headshot so he wouldn’t have to suffer.",
            "Anything but not shooting a man in the leg and leaving him behind to die. Worst thing I'm willing to do is leave Otis behind to fend for himself while I escape."
        ]
    }
}