{
    "The Walking Dead: The Ones Who Live S01E06 - The Last Time - Episode Discussion": {
        "title": "The Walking Dead: The Ones Who Live S01E06 - The Last Time - Episode Discussion",
        "score": 264,
        "url": "https://www.reddit.com/r/thewalkingdead/comments/1bsoqxk/the_walking_dead_the_ones_who_live_s01e06_the/",
        "content": " \n\n# All sub rules apply\n\nREMINDER: This is a piracy free sub. Do not ask for streams or provide links to sites with illegally hosted content. These actions will result in a ban.\n\n**Season 1 Episode 6, The Last Time**\n\n* **Released (AMC+ & AMC):** March 31, 2024\n\n**Synopsis**: Rick and Michonne have to perform a near-impossible miracle.",
        "num_comments": 1262,
        "comments": [
            "Rick will ONLY swear on his wife's sword!",
            "My God, Terry O'Quinn does not age, does he?  I mean, he still looks the same as he did when I saw him in Lost.",
            "Rick beats a guy to death with his bare hand(s) and Michonne comes out of the elevator and reacts like its just a normal Tuesday. Yeah, they are crazy.",
            "So Thorne and Jadis got the echelon briefing and was like Hell yea, Im in!!! Wtf lol",
            "I'll never forget Rick tearing out that biker's throat, holy hell",
            "I love how Michonne coming upon Rick beating a man to death and reacts like it's totally normal.  Then again, not the worst thing she's seen him do.",
            "Halloween 2010 to Easter 2024, been a good ride yall!",
            "Rick, you may wanted to have kept the prosthetic until AFTER you and Michonne escape.",
            "I enjoyed it but a single episode to totally destroy/reform the entire CRM after all of the buildup it had felt bizzare.",
            "As far as I'm concerned, this is the true ending of the whole franchise. Rick and Michonne, having gone through hell, fire, and brimstone to see their children again (Rick meeting RJ for the first time), is all that we need to bring their tale to a fitting closure. Rick started this whole story looking for his family, and ended it finding his family. No need for a second series for \"The Ones Who Live\"; I'm satisfied as a viewer."
        ]
    },
    "RIP the best boy, Seven who plays dog has passed away 💔": {
        "title": "RIP the best boy, Seven who plays dog has passed away 💔",
        "score": 6562,
        "url": "https://www.reddit.com/gallery/1df5qxk",
        "content": "",
        "num_comments": 240,
        "comments": [
            "I didn't need to know this ",
            "If dog dies, we riot\n\nso when and where?",
            "Were getting old. This sucks.",
            "All dogs go to heaven. Rest well good boy.",
            "This is heartbreaking, I know everyone in the cast loved that dog",
            "I had such anxiety when he was in the scenes cause I was terrified he was going to get eaten. I grieved for Shiva and she was just CGI! ",
            ":( This is heartbreaking. RIP Seven. ",
            "Daryl's pants rock\n\nRIP dog",
            "This is tragic my eyes feel watery ",
            "I never even considered that the Dog could die before Daryl made it back from France."
        ]
    },
    "What is your cringiest moment in the whole show?": {
        "title": "What is your cringiest moment in the whole show?",
        "score": 122,
        "url": "https://i.redd.it/hwb2zs1oyh9d1.png",
        "content": "For me it's Michonnes \"loVE doEsN't diE\" man that was cringy as hell",
        "num_comments": 84,
        "comments": [
            "Shane and Andrea car sex",
            "Either this or RJ's i BeLieVeD. To be honest, that whole reunion scene was cringe overload.",
            "Ftwd but Morgan taking a shit was sth else",
            "The first two episodes hold so much potential. Hate how everything just got thrown out in the finale",
            "The entirety of episode 6, and where Michonne and Rick act so chill with that group of people robbing them in the woods like they simply dont care gives me Mary sue vibes",
            "When they didn't force Negan to drink a whole bottle of bleach.",
            "Probably love doesnt die or anything Eugene did",
            "This is about world beyond, but when a lady asked iris \"what is she here for?\" or something like that. Iris says, \"For hope\" That shit was so fucking corny and wack",
            "Morgan's good 'ole \"We don't kill people! (Proceeds to kill a fuckton of people)\"\n\nLike not any scene specifically but the amount he preaches and the amount of immediate backpedaling he does",
            "Are you the brave man"
        ]
    },
    "Honestly one of my favorite scenes in the whole show": {
        "title": "Honestly one of my favorite scenes in the whole show",
        "score": 375,
        "url": "https://v.redd.it/1wbzlltncf9d1",
        "content": "I don’t think I ever really gotten over Shane’s death. He was always one of my most favorite characters. Him and Rick together would’ve been unstoppable. It was so nice to finally see him again. Also it’s crazy to think that the entire group had reached Shane’s mentality in like season 5. ",
        "num_comments": 31,
        "comments": [
            "Brilliant scene. How it flowed greetings to reminiscing, to teasing and joking, to insults then instructing, finally apology and acceptance. All within a few minutes while eating burgers and fries. The nose and ears jokes were hilarious. Lincoln looked so startled when Bernthal started slapping his chest. I don't think he knew it was coming.",
            "Top tier scene for sure",
            "Easily, one of my favorite shots and scenes in the series.",
            "Two of the best actors of our lifetime",
            "I wanna know where they got the food from. It looks generic but those fries look good to me xD",
            ">Also its crazy to think that the entire group had reached Shanes mentality in like season 5.\n\nNo. Shane's mentality was shelfisness. He would have gotten everybody killed, because he couldn't look past his nose.",
            "This scene just makes me want a burger everytime",
            "I wish he would have rubbed his head at least once",
            "Shane was a good man under difficult circumstances.",
            "No. They didnt. Shane was bad. He sexually assaulted people."
        ]
    },
    "How would this scene have played out with Rick?": {
        "title": "How would this scene have played out with Rick?",
        "score": 117,
        "url": "https://i.redd.it/99epyrtcdg9d1.jpeg",
        "content": "I was wondering what you guys think this scene would be like with Rick and Daryl/Rick, michonne, ",
        "num_comments": 16,
        "comments": [
            "\\*tilts head and squints eyes\\* \"What did you sayyy?\"",
            "Hopefully by Rick ripping out his throat with his teeth ",
            "Why couldn't they give Norman Reedus proper fitting armor ",
            "\"You see this machete with a red handle....Yeah it's done stuff Sebastian....thannngs\"",
            "\"Say something like that to me again I'll knock your teeth out, break your jaw.\"",
            "Rick comes back, covered in this little fucker's blood\n\n\"What, walkers got him\"",
            "The little bastard wouldve had to get a colonoscopy  to get his teeth cleaned.",
            "i've seen seiya cosplayers with cardboard armors look better protected than that\n\nthis shit has me FURIOUS",
            "Probably the same, just with Rick's gun would be pressed against Sebastian's head and two dead soldiers.",
            "Probably the same way. They couldn't kill Sebastian"
        ]
    }
}