{
    "[Request] How much would it cost to build a pirate ship split between 25-50 people?": {
        "title": "[Request] How much would it cost to build a pirate ship split between 25-50 people?",
        "score": 2721,
        "url": "https://i.redd.it/iowlw454w99d1.jpeg",
        "content": "",
        "num_comments": 143,
        "comments": [
            "Honestly building the ship isn't the issue, outfitting and provisions are.  Is everyone cool with eating hardtack, water, and rum for months on end? Are we going full blown 1600s with no entertainment? Or is there wifi and AC?  Canvas only, or do we have a diesel option?",
            "One of the major issues would be the building in of itself. The shipyard workers from back in the day simple don't exist to provide the detailed expert level tireless work not to mention the constant maintenance of swabbing the deck, pitching and tarring,...\n\nWood is very much a living material.",
            "A pirate ship is just a ship thats not registered under a countrys flag. But actually sailing that way is anything from a terrible idea to suicidal. So itd just be the cost of a regular ship.",
            "$100,000 to equip 25 people with inflatable boats, AK's and body armour. 25 motivated people should be able to steal a suitably equipped boat, else they've no business being pirates in the first place.",
            "It's all fun and games until you get around Somalia and actual pirates decide to show up. Good luck with your cutlasses flintlock pistols and blackpowder canons.",
            "In 2009 a full sized replicate of Blackbeard's ship, Adventure, is estimated to have cost $3.7 million. In 2002 a replica of an East India trading vessel called Gthborg was estimated to cost around $40 million.  If you're looking for something more in your price range you can get a pirate ship for $40 from Temu, a bottle of gutrot spiced rum for under $20, and a passable pirate outfit for around $100.  You're on your own for making friend to sing shanties with.",
            "Currently building a Viking longship that holds 15 men for a charity race against modern yachts next year. Cost me about 12k. \n\nI've seen a schooner that cost 1mil, could house 20-25 but will be hammocks and shit",
            "I suggest commandeering a J class yacht. It doesnt have any guns but you can invite some americans and youll be set. Its fast as hell, houses about the right number of people and seaworthy at the big seas.",
            "Different Polynesian groups and several time replicated their journies to other Polynesian islands and their trade routes with south America with their old fashioned way-finding and technology. That is a few months. I would don't want to do more than that.",
            "You will face a major problem. On a pirate ship, the capitain need to have the absolut authority. He has to own the whole ship. You can't share the cost.\n\nEdit: seems like i am wrong! Read below."
        ]
    },
    "[REQUEST] How much paper would this use?": {
        "title": "[REQUEST] How much paper would this use?",
        "score": 5987,
        "url": "https://i.redd.it/e29prl4p3d9d1.png",
        "content": "",
        "num_comments": 105,
        "comments": [
            "I did this to my dad once by accident when I was 8. Was screwing around in a random spreadsheet on the family computer. Found the bottom right cell after scrolling for a while and typed something like this is the end in it. Course it was only 65535 rows down and 256 columns across back then.\n\nA few days later there is a stack of printed out blank cells on the desk. The file must have been something important to have him want to print it.  I saw that and knew it was my fault. Never said a word. To this day I wonder if my dad ever figured out what caused this massive print job.",
            "If i remember correctly, that the grid doesn't get printed\nWouldn't most of the pages just come out blank and unused and can therefore be put back into the printer. \nIt wouldn't cost any extra pages since even the last one with the 0 is white",
            "Not directly related, but to fix this you select the area you want, then reverse select (which selects everything but what you just selected) and delete.",
            "A typical box of paper has 10 reams, and a pallet of paper at my store is typically 12 per layer, 6 high, so 72 boxes. 73,135.458 / 720 = 101.577 pallets, each one approaching the weight of a 2006 toyota corolla",
            "That is approximately 3657 trees if google is correct",
            "I think its worth taking into account that most likely, 99.99% of the pages would be blank and could be reused numerous times. \n\nFurther, if you changed the last cell font to white that too would be blank.",
            "So about half of a Walgreens receipt?",
            "If you set scaling to 400% you can get the page count to 780,910,592",
            "Dwight Schrute has just become the top salesman",
            "How long would it take to print out?"
        ]
    },
    "[Request] Say this was a real DB level , what would happen upon use?": {
        "title": "[Request] Say this was a real DB level , what would happen upon use?",
        "score": 2801,
        "url": "https://i.redd.it/vwmt6kb2qc9d1.jpeg",
        "content": "",
        "num_comments": 216,
        "comments": [
            "Once you reach 194dB the low pressure region of the sound wave would be a full vacuum. At this point it ceases to be a sound wave and becomes a shock wave.",
            "Haha logarithmic scales, man. 120db is the threshold for pain, like someone screaming directly into your ear. Being near the nozzle of a jet engine is around 160db. Being near the nozzle of a rocket engine is around 180db. Loud, no?\n\nThe good news is that the 1000db air horn hasn't been used yet. We know this because the earth hasn't been destroyed completely (and I mean essentially atomized). The other good news is that there probably doesn't exist enough energy in the universe to power something to produce a 1000db pressure wave.",
            "1000 dB would completely destroy anything in the near vacinity. Keep in mind decibels are in a logarithmic scale, so 1000 decibels would be somewhere around 10^(90) times louder and more intense than something at 100 dB, which is an approximate intensity of sound of loud headphones.",
            "The loudest sound known to man is the krakatoa eruption at 310db. Decibel is a logaritmic scale. 10 db means double the energy. So that horn would generate about a 5,9x10^20 times stronger soundwave than krakatoa. Upon use it will obliterate our planet.",
            "This reminds me when I was a junior engineer at Telekom in Germany, working in a unit for special IP solutions (early VOIP mostly). We had a large hall for us where 15 engineers were monitoring and engineering solutions. We had a row of screens in the rear of the room where status messages were scrolling through. I came up with an idea of lets say a very very simple version of network monitoring written in Java, to inform the engineers if something goes wrong, instead of having one of us scan the screens all the time.  The solution was welcomed. To inform the engineers if something goes wrong, I made the app play the sound of a foghorn every time an error was noticed, and I installed a set of active speakers to the computer. The foghorn sound  came very convincing through the speakers, a few times per hour. It could be heard well at the front of the hall. The guy having his seat at the rear of the hall, closest to the speakers suffered a little. To keep the story short, The honk was usually followed by a German curse. The memory of this still gives me a giggle fest. It is not good to traumatize work colleagues. But it has a funny component.",
            "Despite the harsh implications of this device, I can imagine some people around these parts dutifully attaching it to a wooden frame on their BMX and blasting out some Celine Dion for a fraction of a second and that's how the humans destroyed the universe.",
            "Dammit, I dont know how many times Ive stumbled across something like this and then try to scroll sideways to see the next picture",
            "We all know this is nonsense, but it's not even the correct unit as the uppercase \"D\" isn't a valid unit prefix opposed to \"d\" signifying a tenth. \n\nSo dB is actually a tenth of a Bel and DB is nonsense.",
            "OH BOI! So I dont even know if 1000 dB has been observed on Earth, but 200 dB is enough to kill a person. The pressure wave is just that immense.",
            "Tony stark invented it for millitaries who wanted to kill Hulk, I didn't knew stark upgraded it to such small scale.\n\nAnyways it can't be heard but can be used to ki**"
        ]
    },
    "[Request] How much would something like this actually cost? And how long would it take? ": {
        "title": "[Request] How much would something like this actually cost? And how long would it take? ",
        "score": 2755,
        "url": "https://v.redd.it/k8t2p6rvgc9d1",
        "content": "YT: Frostech",
        "num_comments": 26,
        "comments": [
            "How the hell was the person able to pay that much money? Also why does the streamer pretend like he doesn't like this goldmine of a viewer?",
            ">  Or roughly 3/10ths of Elon Musk's daily revenue.\n\nThat puts into perspective just how ridiculous the wealth that the top billionares have.",
            "How on earth did you calculate Elon musks daily revenue?",
            "I'm guessing a Google Earth step isn't equivalent to a human step, you'd have to measure it. Also, it looks like it's in GBP, not USD.",
            "i don't think geo guesser moves 1 human step at a time",
            "I think a \"step\" on google earth and similar is 10-15 meters.",
            "Because its a skit? With fake donations?",
            "Or how cheap traveling the world in geoguessr is",
            "Billionaires should be guillotined like the old aristocrats",
            "I just Googled it "
        ]
    },
    "[Request] How much elytras would this actually take?": {
        "title": "[Request] How much elytras would this actually take?",
        "score": 485,
        "url": "https://i.redd.it/ze65vemxwc9d1.jpeg",
        "content": "",
        "num_comments": 19,
        "comments": [
            "Two quick google searches reveal that the farlands in the end are about 12.5 million blocks away from the center, and and a single elytra last for over 10,000 blocks, on average. 12.5 million / 10,000 = 1,250 elytras to get there.",
            "Well if you use the power of redstone you just need one elytra and a ludicrously powerful cannon the likes of which you'd see from cubicmetre",
            "But is that only counting for a single direction?",
            "One that launches you 12.5 million blocks?",
            "Not sure. I literally just looked up 'how long does an elytra last' and the top few sites all said over 10,000 blocks so I trusted it to be accurate.",
            "Thecnically a much slower way that requires 0 elytras is making a redstone flying machine",
            "The reference u/Kotimaantieteilija used already included using unbreaking 3.",
            "How many items do you need to repair the elytra that drop from phantoms, I forgot the name of the item\n\nEdit: if you use only one elytra",
            "Unbreaking 3 quadruples the durability of an elytra. (432 -> 1728)\n\nTherefore, you would need 1250 / 4 = 312.5 elytras.\n\nHowever, a more practical approach would be to use mending. Since there's endermen everywhere, you can always repair the elytra by killing endermen, so you'd only need one.\n\nEdit: Taking into account u/kotimaantieteilija 's figures, this further reduces the number to 62.5",
            "What about unbreaking 3?"
        ]
    }
}