{
    "Thanks I hate the Titanoboa": {
        "title": "Thanks I hate the Titanoboa",
        "score": 167,
        "url": "https://www.reddit.com/gallery/1dqzoxn",
        "content": "",
        "num_comments": 17,
        "comments": [
            "If it makes you feel better, they may have been piscovorous, so you wouldn't be on the menu if true",
            "This guy was definitely patrolling outside of Midgar just waiting to snack on some spikey-haired kid with an oversized sword.",
            "Can we mass produce them in plush? I want this as a ultra-xl-pillow to sleep on...",
            "Fishingarret would like to have a word with it.",
            "Wait till you discover Vasuki Indicus",
            "Me too. The taming method is ridiculous, and it takes way too long. I’m not getting a bunch of fertilized eggs together and then dropping them from above over the course of 20 minutes just to get a level 1 titanoboa.",
            "I do not consent to my private parts being shown to the world!.",
            "Imagine the size of the fish it had to eat to get to that point though. I would think those you would have to worry about",
            "Yeah but the one on the scale pic is about to eat that guy",
            "see its funny cause the punchline is sex"
        ]
    },
    "Thanks I hate this": {
        "title": "Thanks I hate this",
        "score": 452,
        "url": "https://i.redd.it/jm0c4eka8c9d1.jpeg",
        "content": "",
        "num_comments": 25,
        "comments": [
            "The sex doll industry is watching this very closely.",
            "Who was asking for this? Skynet?",
            "The smile says “please end it”",
            "Why would they do this?",
            "Shockingly accurate to MFW I see titties.",
            "God damnit I was js about to go to sleep",
            "How a prosciutto slice looks at you, well knowing it will be eaten",
            "Ars Technica claims it was made with cells isolated from \"juvenile foreskin\"",
            "What in the Thomas the tank engine blob fish hell am I looking at",
            "I can perfectly comprehend these manmade horrors, the rest of you must have a skill issue or something :p"
        ]
    },
    "Thanks, I hate the pissky.": {
        "title": "Thanks, I hate the pissky.",
        "score": 1771,
        "url": "https://i.redd.it/l3uof27nx69d1.jpeg",
        "content": "",
        "num_comments": 56,
        "comments": [
            "Heyyyyyy post apocalyptic reason to be kept alive 😭",
            "Nothing in there is true.\nThe only source of sugar allowed in SINGLE MALT is malt. Fermenting piss won't make it beer or wine. Distilling piss won't make is single malt whisky or a cognac or a rhum",
            "I know what to give my father in law this christmas",
            "EWWWW... there is no way in hell that tastes good.",
            "Time to get piss drunk fellas",
            "Call me boring but what is the appeal?",
            "There is a reason the saying goes “[insert product] has all the export potential of English whiskey”",
            "Perfect gift for someone you dislike",
            "Missed the chance ro turn it into beer and call it Pißwasser",
            "The only drink Bear Gryils takes with him on his expeditions into nature."
        ]
    },
    "Thanks I Hate Miraculous Feet": {
        "title": "Thanks I Hate Miraculous Feet",
        "score": 226,
        "url": "https://i.redd.it/j5dynn5qx69d1.jpeg",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Well, someone has had a lot of time on their.. hands",
            "what a bad day to have eyes",
            "Is this a new show by Dan the foot man Schneider?",
            "I just opened Reddit. I have no words for this.",
            "I thought the mouths were cuts in the feets",
            "Still a better story than the actual show at this point",
            "Lets just chop these off, atleast we can make tacos from their feet",
            "What is there to hate",
            "I'm gonna rip my eyes off",
            "Ah, yes. Recovering from surgery. Couchbound. Seen all of Netflix. Seen all of Hulu. The boredom sets in. The makeup comes out.\n\n\nI've never had foot surgery, but I get it."
        ]
    },
    "Thanks, I hate this Lovecraftian horrowshow I pulled out of a fresh bag of sphagnum moss": {
        "title": "Thanks, I hate this Lovecraftian horrowshow I pulled out of a fresh bag of sphagnum moss",
        "score": 64,
        "url": "https://i.redd.it/zokzhfuaaz8d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "I don’t know what sphagnum moss is but this looks pretty close to what I’d imagine it to be",
            "Life ain’t all sunshine and rainbows kid\n\n![gif](giphy|hJ8ISu3zLrHws)",
            "No idea what you just said but I don’t like it either.",
            "I think it's sometimes used in terrariums to keep plant roots moist",
            "Moist",
            "Thank you for posting to [r/TIHI](https://www.reddit.com/r/TIHI/)! Make sure to follow the subreddit rules.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/TIHI) if you have any questions or concerns.*"
        ]
    }
}