{
    "New Location for FAQ and Useful Links/Apps": {
        "title": "New Location for FAQ and Useful Links/Apps",
        "score": 87,
        "url": "https://www.reddit.com/r/Tiktokhelp/comments/um0gtd/new_location_for_faq_and_useful_linksapps/",
        "content": "We have removed the pins on the **FAQ** and **Useful Links/Applications**. You can now find these post under \"Menu\" for mobile and under the banner for PC.",
        "num_comments": 166,
        "comments": [
            "Hi so I got banned a few months ago and my name was like Jacob Cruz and my profile was me doing the rock face I just want to know why",
            "Hey. I logged out of my tiktok but now i dont remember the pass nor what email i used. Is there any way i can find the email which i used to open the acc?",
            "my account suddenly drop views under 300views\n\ndo anyone know why and how to fix that",
            "hii, after my account got banned, I requested for a data download and waited for 1-2 days, then was able to click download. This then redirected me to a login page to \"download my data\". After putting in my details it says \"login success\" but nothing happens after that, it just redirects me to another login page. please help.",
            "Can someone please help me!!!! Almost all of my videos were falsely MASS REPORTED and I have been emailing and appealing to TikTok for 4 days! They only sent me 1 message back saying they were looking into the problem\nand I should have my videos restored yesterday but it never happened",
            "For fucks sake, ban these creator fund posts",
            " Tiktok bot system is very sh\\*t, i been reported a lot as \"gambling\" and \"fraud scams\" just for playing monopoly go games in emulator. lmao. appeal and get suspended over and over again. Sending countless video, screenshot of me playing monopoly go games, even show them the link for the game in playstore that its not even using real money",
            "Hello! I just created a new TikTok account for a podcast I’m apart of, but it’s not letting me follow anyone??? Literally I hit the follow button and it doesn’t record in my followers. Or I refresh the page and someone I followed it switches back to the follow button.\n\nI’ve tried this on both desktop and mobile. Can’t seem to find a solution. Is there anything I can do?",
            "Hey I have been having an issue also with the suggestions on TikTok because it only shows celebrities when I go to Any account",
            "I uploaded the same video in German and English at the same time and both have 0 views after a day. Did I get shadow banned?"
        ]
    },
    "Please tell me how to make all the trolls and freeloaders leave me alone!": {
        "title": "Please tell me how to make all the trolls and freeloaders leave me alone!",
        "score": 3,
        "url": "https://www.reddit.com/r/Tiktokhelp/comments/1drbeub/please_tell_me_how_to_make_all_the_trolls_and/",
        "content": "All people want to do is join my live and try to trick me into saying something racist or wrong, or constantly demand me to do a request for free, No matter how much I ignore them or block them or mute them. ",
        "num_comments": 2,
        "comments": [
            "Enjoy the free traction. Ignore",
            "Thank you for posting, please be sure to check [FaQ](https://www.reddit.com/r/Tiktokhelp/comments/n99g9o/frequently_asked_questions/)\n\nPlease keep in mind that this is a community run subreddit and posts from young accounts (<1 days) or accounts with low karma may be removed. We have no official affiliation with TikTok.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Tiktokhelp) if you have any questions or concerns.*"
        ]
    },
    "A new banger ": {
        "title": "A new banger ",
        "score": 3,
        "url": "https://i.redd.it/fs9od53p2i9d1.png",
        "content": "My best video. Hasn't died yet either. ",
        "num_comments": 3,
        "comments": [
            "When u boost you don’t get paid?",
            "No, boosted views aren't paid. Btw, I don't pay for boosting, it's a TikTok promotion for videos over a minute. As you can see, they didn't boost it much because the video is already viral.",
            "Thank you for posting, please be sure to check [FaQ](https://www.reddit.com/r/Tiktokhelp/comments/n99g9o/frequently_asked_questions/)\n\nPlease keep in mind that this is a community run subreddit and posts from young accounts (<1 days) or accounts with low karma may be removed. We have no official affiliation with TikTok.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Tiktokhelp) if you have any questions or concerns.*"
        ]
    },
    "Safe way to make a new account? Give your advice": {
        "title": "Safe way to make a new account? Give your advice",
        "score": 4,
        "url": "https://www.reddit.com/r/Tiktokhelp/comments/1dr4y1e/safe_way_to_make_a_new_account_give_your_advice/",
        "content": "Hey guys\nI made the mistake to promote some content which prevented my entire account from having organic views, even after waiting 20 days.\nFunfact: my tiktok ad manager (working for tiktok) actually confirmed this shadowban is actually a thing.\n\nSo I deleted my account and I wanted to start fresh, but my posts would now only get 0 or 1 views for videos that usually get a few thousands. I waited for 20 days after posting consistently, nothing changed...\n \nNow I'm wondering what's the way of safely creating a new account and posting?\nDo I need a new phone, do I need to re-export the videos to prevent being detected as re-upload,...?\n\nThanks for the advice!!\nSheena ",
        "num_comments": 2,
        "comments": [
            "This is weird, we are all facing this issues. From my testing, new phone does nothing. Might be the same wifi a problem too. I would try with a new phone with a separate sim and never connect to the same wifi...i tried resetting my IP from the router but no luck. somehow i get shadowbanned eventually for having more accounts. idk what to say....i hope we will find a way soon. Also, do you think I could get in touch with your ad manager? thanks!",
            "Thank you for posting, please be sure to check [FaQ](https://www.reddit.com/r/Tiktokhelp/comments/n99g9o/frequently_asked_questions/)\n\nPlease keep in mind that this is a community run subreddit and posts from young accounts (<1 days) or accounts with low karma may be removed. We have no official affiliation with TikTok.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Tiktokhelp) if you have any questions or concerns.*"
        ]
    },
    "CONSERVATIVE ACCT BANNED ": {
        "title": "CONSERVATIVE ACCT BANNED ",
        "score": 1,
        "url": "https://www.reddit.com/r/Tiktokhelp/comments/1drbvmn/conservative_acct_banned/",
        "content": "AFTER SCOTUS  decision that the government could be involved and determining what was misinformation on private apps on Wednesday, TikTok took down a large amount of large content creators that were conservatives! I’m trying to find a way to get the actual number because I believe that it is very large! They stated Community guidelines violations, most of us did not have community guidelines! And it’s funny because no one is talking about it! I would say over 100,000 accounts were taken within two hours! Is there anyway we could accurately determine that information?? I have friends in high places and I need to get this number to Congress. Someone help me.  Can we do Foia? Help! ",
        "num_comments": 1,
        "comments": [
            "Thank you for posting, please be sure to check [FaQ](https://www.reddit.com/r/Tiktokhelp/comments/n99g9o/frequently_asked_questions/)\n\nPlease keep in mind that this is a community run subreddit and posts from young accounts (<1 days) or accounts with low karma may be removed. We have no official affiliation with TikTok.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Tiktokhelp) if you have any questions or concerns.*"
        ]
    }
}