{
    "The Titanfall wiki is moving to titanfall.wiki.gg": {
        "title": "The Titanfall wiki is moving to titanfall.wiki.gg",
        "score": 321,
        "url": "https://www.reddit.com/r/titanfall/comments/1b53rux/the_titanfall_wiki_is_moving_to_titanfallwikigg/",
        "content": "Hey there pilots o/\n\nThis is just a quick message to let you know that the Titanfall has moved to https://titanfall.wiki.gg/\n\nThe reason for the move being that _Fandom_, the company that hosts many gaming wikis, has recently been caught up in multiple controversies regarding turning wiki pages into ads, auto-generating incorrect random trivia questions, and making the wiki near unusable without an adblock.\n\nFor more info on Fandom in general check out [this YouTube video](https://www.youtube.com/watch?v=qcfuA_UAz3I) or [this Wikipedia entry](https://en.wikipedia.org/wiki/Fandom_\\(website\\)#Controversies).\n\nHence the Titanfall wiki is moving places. At this point also a huge shout-out to /u/The_Sniperstock for orchestrating the move.\n\nYou can follow up on their activity including the following posts:\n\n- Initial announcement: https://redd.it/1aq9sni\n- Announcement of the new wiki https://redd.it/1b1qlxl\n- First update post on the new wiki: https://redd.it/1b4i27x\n\nThat's all for now, give [the new wiki](https://titanfall.wiki.gg/) some love <3\n\nAnd as always, see you on the Frontier, pilots o7",
        "num_comments": 14,
        "comments": [
            "Hey pilots, Sniperstock here. I almost forgot to add: if you have a fandom account and want to edit on the new platform, here's the special link for porting your stuff over to wikigg:  https://titanfall.wiki.gg/wiki/Special:ClaimExternalAccount",
            "Seems like a good move to me. Have not checked out the link yet but sounds good.",
            "LET'S FUCKING GOOOOOO",
            "Sounds about right, could never open a fandom link without automatically being a viewer of a completely unrelated twitch stream so this doesnt surprise me",
            "Finally.",
            "Hell yeah!",
            "Thank Scorch, fandom wiki is a plague on this earth",
            "Good riddance.",
            "W",
            "Hmmm good to know"
        ]
    },
    "Weekly Discussion | June 24, 2024": {
        "title": "Weekly Discussion | June 24, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/titanfall/comments/1dnaqvx/weekly_discussion_june_24_2024/",
        "content": "Use this weekly thread to ask small questions and discuss all things Titanfall and beyond.\n\nPlease [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Ftitanfall) if you want to leave feedback or have ideas on how to improve these threads.",
        "num_comments": 3,
        "comments": [
            "Titsfallin 3 when?",
            "I’m making tf3 project",
            "Is the horde mode on TF2 still populated?"
        ]
    },
    "You have GOT to be kidding me": {
        "title": "You have GOT to be kidding me",
        "score": 394,
        "url": "https://i.redd.it/yj4ot5trdf9d1.png",
        "content": "",
        "num_comments": 30,
        "comments": [
            "As it turns out, he sells cheats on his Discord server as well",
            "Get his ass boys",
            "He better be ready for a non-stop Frontier Defense",
            "they have the most accurate username i have ever seen ",
            "I fucking knew it dude\nThere are cheaters in Titanfall I thought it was just lag or ping being 400.",
            "*cracks knuckles*       \nTime to do something I vowed to never say again",
            "No, I think he deserves his 4 views. No more than that though.",
            "4chan might be able to help with this problem. you know, getting his discord server taken down and getting him banned from the game.",
            "Yall better get his ass, give him what he deserves Titanfall fam 🤝",
            "username checks out"
        ]
    },
    "You are not welcome anymore": {
        "title": "You are not welcome anymore",
        "score": 428,
        "url": "https://i.redd.it/o16i26rmle9d1.jpeg",
        "content": "",
        "num_comments": 26,
        "comments": [
            "Why is he holding a shoe",
            "At least a wall + spitfire  can be easily countered,staying still in a movement heavy game means death\n\n\nIt would be way worse with grapple + car,which is immensely more powerful\n\n\nFor tone... It's a one trick pony with the barrier,without it,tone is easily dismissed",
            "*proceeds to pull out a Tommy gun and mow him down*",
            "nice shoe",
            "MFW I main Tone, and run Spitfire with Grapple",
            "Why is he holding an Air Force 1",
            "shoe comment",
            "And smart pistol",
            "I laughed way too hard at this.",
            "I used to play sidewinder+A-wall just to annoy my friends in 1v1's. Am I beyond God's redemption?"
        ]
    },
    "How it Feels to Use the L-STAR as a Doom Fan (OC)": {
        "title": "How it Feels to Use the L-STAR as a Doom Fan (OC)",
        "score": 870,
        "url": "https://i.redd.it/usmdx9b6qc9d1.png",
        "content": "",
        "num_comments": 34,
        "comments": [
            "Stand proud, OP, you cooked those grunts with perfection.",
            "Fun fact: The L-STAR functions almost identically to the classic Doom plasma rifle, with the only differences being the fact that it has spread and overheats. That little one-second choke after you release the trigger feels especially like it was drawn directly from Doom. Anyways, that's where the inspiration for this drawing came from. Hope you all like it!",
            "L star nah w star you are the w's",
            "L-star as plasma rifle, Thunderbolt as BFG\n\nRonin as the Dark Ages mech?",
            "Should I start making demonic noises?",
            "Best thing I’ve seen all day",
            "Great drawing",
            "Literally me",
            "I just completed 2016, I loved the Plasma Gun and was my second favorite weapon (behind the Gauss Cannon)",
            "This is glorious"
        ]
    }
}