{
    "New symbol on phone ": {
        "title": "New symbol on phone ",
        "score": 22,
        "url": "https://i.redd.it/4m3sbtus8e9d1.png",
        "content": "Has anyone gotten this? Do you know what the lightening bolt-ish symbol is? TIA",
        "num_comments": 15,
        "comments": [
            "Ya broke it. Congratulations. \n\n(I kid. I kid.)",
            "According to this (https://android.stackexchange.com/questions/250507/whats-this-icon-that-looks-like-a-frequency-wave-with-a-slash-through-it-on-my) it means sensors off, which can be toggled from developer mode.",
            "What phone is it? I tried circle to search and found nothing.",
            "BTW, does anyone know what the satellite symbol look like?  \n\nEdit: Okay, I found this. If real then it should look like a satellite.  \n\nhttps://pt.root-nation.com/ua/articles-ua/tech-ua/ua-starlink-direct-to-cell/  \n\nhttps://root-nation.com/wp-content/webp-express/webp-images/doc-root/wp-content/uploads/2024/01/starlink-direct-to-cell-3.png.webp",
            "Idk. Not getting a free phone for it tho",
            "If it's a samsung device,  you have the sensors off active.",
            "That would be the sensors off, a dev option hidden in the dev options, basically it turns all your sensors like mic, camera, the thing that auto rotates your phone (forget what it's called)    \n[As seen here.](https://imgur.com/a/dMgs1Co)",
            "It means you have no heartbeat and are walking around as a zombie now.",
            "Gemini is trying to say it's \"airplane\" mode",
            "This sub is about T-Mobile this is not related to"
        ]
    },
    "Even T-Mobile's Own AI Chatbot Thinks They Violated The Price Lock Guarantee": {
        "title": "Even T-Mobile's Own AI Chatbot Thinks They Violated The Price Lock Guarantee",
        "score": 141,
        "url": "https://tmo.report/2024/06/even-t-mobiles-own-ai-chatbot-thinks-they-violated-the-price-lock-guarantee/",
        "content": "",
        "num_comments": 16,
        "comments": [
            "I got the text. I called and the rep said \" this is going to happen\". \nConsidering the service sucks locally. They've been having tower issues since January and no idea when our how to fix. Still the cheapest game in town by far unfortunately.",
            "This is unsurprising. The chatbot is basically citing the ToS - which are clear about price locks, including Un-Contract Promise:\n\n>CAN T-MOBILE CHANGE, SUSPEND OR TERMINATE MY SERVICES OR THIS AGREEMENT?   \nYes. Except as described below for Rate Plans with the price-lock guarantee (including the “Un-Contract Promise”), we may change, limit, suspend or terminate your Service or this Agreement at any time, including if you engage in any of the prohibited uses described in these T&Cs, no longer reside in a T-Mobile-owned network coverage area, or engage in harassing, threatening, abusive or offensive behavior. If your Service, Product, or account is limited, suspended, or terminated and then reinstated, you may be charged a reconnection fee. Your account may still accrue charges even if the Service is suspended. You are responsible for any charges that are incurred while your Service or account is suspended.  \nUnder certain limited circumstances, we may also block your Device from working on our network. If the change to your Service, Product, or Rate Plan will have a material adverse effect on you, we will provide 14 days’ notice of the change. You’ll agree to any change by using your Service or Product after the effective date of the change. We may exclude certain types of calls, messages or sessions (e.g. conference and chat lines, broadcast, international, 900 or 976 calls, etc.), in our sole discretion, without further notice. For information about our unlocking policy, visit www.t-mobile.com/responsibility/consumer-info/policies/sim-unlock-policy.  \nIf you are on a price-lock guaranteed Rate Plan, we will not increase your monthly recurring Service charge (“Recurring Charge”) for the period that applies to your Rate Plan, or if no specific period applies, for as long as you continuously remain a customer in good standing on a qualifying Rate Plan. If you switch plans, the price-lock guarantee for your new Rate Plan will apply (if there is one). The price-lock guarantee is limited to your Recurring Charge and does not include, for example, add-on features, taxes, surcharges, fees, or charges for extra Features or Devices.",
            "So, I have not gotten the price increase notification and are still on Price Lock. \n\nMagenta Max. \n\nI believe I am in the clear due the signup date and the version of price lock.",
            "There's a reason it thinks this - because they did.",
            "My bill went up $10. Even though the \"price lock\" \"un-CONtract\" rate plan I'm on stated I'd keep my price as long as I kept the plan. \n\nWhen newer plans began to emerge and the benefits started to differentiate between rate plan tiers, any time I found myself disappointed, left out, shopping other competitor deals,  I  ALWAYS deferred back to \"well my rate plan is fixed so (insert)\" \" I could switch to (insert) but lose rate\" \"lower trade in value, but my bill is fixed\" \"no thanks, I'll keep what i have \" - time and time again. The set rate directly influenced my decisions over the years, if my rate plan was not secure,  I would not have made certain decisions that were predicated on those terms. \n\n It's frustrating how T-Mobile is gaslighting its customers, especially your long-time customers. I'm on top of my business finances,  I stayed with T-Mobile , disregarded competitors, promotions, deals, opportunities contingent on what's now been a deceitful false sense of security.  If my T-Mobile rate plan was not locked, as agreed upon,  then I would have remained vigilant looking for better deals, if my rate was just as volatile as the next. \n\nI miss the T-Mobile SideKick. I miss the feeling of nostalgia and brand recognition. I'm not a \"loyal\" customer, this is business,  quid quo pro; and right now T- Mobile is bad business , and as a consumer they feel soulless any empty, of course I know their primary intentions were to make money, as a for profit business, I'm no fool, it's being lied to that's very off-putting and upsetting.  I'm not going down without a fight!!! \n\nT-Mobile might as get rid of Magenta and idk mix red and blue and just turn is it purple? They took the worst of their \"competitors\" and have become them. You can't tell me they don't sit and have \"secret\" meetings, they are all in cahoots 😂",
            "Even if there was a FAQ / fine print linked from the T&C that said they'd pay your final bill if they did decide to raise your price, I don't see how that would invalidate the fact that the T&C explicitly says that they won't raise your price.\n\nIt's like if I said to you, \"I'm not going to punch you in the face.\" And then there was fine print that said, \"If I do punch you in the face, I'll take you to the doctor.\" The fine print is only relevant if I'm lying to you.",
            "They can do whatever they want nobody cares",
            "AI chat bots make things up too, so this really doesn't tell you anything.",
            "I have one plan tax excluded and haven't gotten the text either. Finger crossed",
            "I never got the notification either. Also on magenta max. Bill increased by $2/line for the voice lines. Interestingly it's discounted by the insider discount to $3.20 total for two paid voice lines. Free lines were not affected.\n\nAnnoyingly, next to the increase on the bill says \"You received a notification about this change on 5/22/24.\""
        ]
    },
    "FCC rule would make carriers unlock all phones after 60 days": {
        "title": "FCC rule would make carriers unlock all phones after 60 days",
        "score": 1414,
        "url": "https://techcrunch.com/2024/06/27/fcc-rule-would-make-carriers-unlock-all-phones-after-60-days/",
        "content": "",
        "num_comments": 213,
        "comments": [
            "Fuck locked phones period. Get rid of carrier exclusives, locked phones, and other American carrier bullshit now.",
            "It would be a big FU to T-mobile if the proposal passes!",
            "This is how it should be, and it would be hilarious if this goes into effect within a few months of T-Mobile changing their policy.",
            "I’m all in for this!!",
            "I wonder if this possibly played a role in T-Mobile’s decision into changing the promo EIP credits. 🤔",
            "FCC just pulling straight W’s all year",
            "With all the dual SIM phones now this is needed since it keeps those with financed phones from being able to use the dual sim function.",
            "I want this so bad",
            "The intent of the subsidized phone is to:\n\n* motivate a customer to buy who does not have the cash (gaining the carrier more sales and revenue than if they patiently waited for customers to show up with a new iPhone in hand looking for activation.\n* *buy* a customer for a length of time. \n\nThis costs the carrier some money and the carrier has to take on some risk.  Everyone who signs onto the program is paying into the same risk pool (like it or not).\n\nEvery person in a cell phone store is a salesperson.\n\nI pay cash for my phones and use MVNO's these days.",
            "I think T-Mobile got the heads up this was coming and changed the EIP policy to stop the credits once the device is paid off... This essentially locks these customers in for the length of the EIP..."
        ]
    },
    "Binge On / Walmart $30 5GB plans": {
        "title": "Binge On / Walmart $30 5GB plans",
        "score": 5,
        "url": "https://www.reddit.com/r/tmobile/comments/1dr0dqv/binge_on_walmart_30_5gb_plans/",
        "content": "Anyone still rocking the old plans mentioned above?  Is Binge On still working?",
        "num_comments": 0,
        "comments": []
    },
    "Switching data from T-Mobile to esim": {
        "title": "Switching data from T-Mobile to esim",
        "score": 3,
        "url": "https://www.reddit.com/r/tmobile/comments/1dr241i/switching_data_from_tmobile_to_esim/",
        "content": "I bought an esim (data only) for an upcoming Switzerland trip. I know that T-Mobile will automatically provide sub-5G data for many countries (256kbps) when entering the country, but that is unfortunately not fast enough so I decided on the esim which provides 50mbps speeds. \n\nMy question is -- how do I ensure that my phone is using data from the esim and not from my T-Mobile plan. I actually bought an esim for a Canada trip last month  to test using esims and from what I can tell, it was never used. I think that my T-Mobile plan just automatically gave me 5GB of data for Canada and although my second esim was activated and had 'data roaming' enabled, it was never used. \n\nI am not sure if this is important, but I am using an iPhone 13 Pro.",
        "num_comments": 1,
        "comments": [
            "In the cellular settings on the device you can tell the device what ESIM data you wanna use. It will ask what primary and secondary for calls and texts and data. Make sure you set up your international to use the data."
        ]
    }
}