{
    "Switched from tmo to Verizon yesterday and so far… 🤔": {
        "title": "Switched from tmo to Verizon yesterday and so far… 🤔",
        "score": 19,
        "url": "https://www.reddit.com/r/tmobile/comments/1dr7sn2/switched_from_tmo_to_verizon_yesterday_and_so_far/",
        "content": "After the T-Mobile price increase nonsense and waiting for customer service reps on the phone for ridiculously long hold times… I finally jumped ship to Verizon. \n\nSaving $8 a month but getting more hotspot and unlimited on my watch instead of 500mb a month. I live in the suburbs just north of Philadelphia where everyone’s network should be good if not great right? \n\nWellll…. No 5G in my development. A painfully slow LTE. I gotta drive 2 miles to see any trace of 5G. Verizon customer service said they’re doing ongoing maintenance to the cell site to enhance our experience. (There’s never been 5G… I’ve been there for 2 years and everyone who visits says why does my phone suck in here?)\n\nNo solid and consistent 5G/5G UW along major roads like the PA turnpike northeast extension to the Lehigh valley and the poconos exit for I-80. \n\n1-2 bars consistent lte and slow speeds on Apple Maps or Spotify which makes driving roads very tough up here where I’m at in the poconos this weekend. \n\nPoor coverage in the casino I went to last night. \n\nWith T-Mobile not only did I have 5G at home and even faster on their home internet but I had solid signal that was usable for voice and streaming in the rural and mountain like back roads and up and down the turnpike. \n\nI am really really shocked how underwhelming and how lacking Verizon is. I don’t know if they plan on doing something about it but the coverage map is just a red blanket of lies lol. \n\nUsing iPhone 15 pro max unlocked. \n\nI’m wondering if I made a big mistake and need to go back. ",
        "num_comments": 93,
        "comments": [
            "Should’ve done the free trial Verizon offers before would’ve saved a lot of aggravation.",
            "The great news is, once you’re gone 90 days you could come back and get 3rd line free (if still running) and insider hookup (assuming we offer again in Q3) AND get your Vz phones paid off (keep & switch). Hopefully our wifi will still be around $40 at that time as well. You could be looking at $160 for 3 lines Go5G+ & wifi with add’l lines costing $28.\n\nSorry for all the rest that happened & caused you to switch.",
            "This rant should be in Verizon sub reddit.. It should have been I'm missing tmobile post instead",
            "Verizon gambled on the wrong horse for 5G and are paying the price. It will be a decade before they catch up to what T-Mobile has built out.",
            "So for 2 years everyone who visits has issues with Verizon signal and you choose to switch to them? That’s on you player.",
            "I remember when TMO's network was the laughing stock of the industry and VZ's the gold standard.\n\nMy how has the tables turned.",
            "This is why it's always recommended to test out their network before switching usually by trying a prepaid sim. The assumption used to be Verizon works everywhere you go while T-Mobile sucks outside of major cities. Things definitely have changed every since they started to rollout 5G.",
            "Don't mean to twist the knife, but are you sure you are saving money? Wait till VZW starts adding in the random fees on top of taxes and your savings will disappear just like their 5g bars.",
            "Sounds like my experience when I switched to Verizon for a month last year.  FaceTime audio calls in the car would fade in and out as I traversed town (all while the phone switched incessantly between 5g, LTE and 5uw).   Mediocre speeds throughout except when on mmWave. This was central Houston, BTW.  My Verizon bill ended up being outrageous (had ported 3 lines and was billed like $35 setup fee for each of them even though I did it all myself online- no help from customer service).  So I went back to tmo the following month.  Truly impressive coverage / speeds.  Happy with tmo.  Horribly disappointed with Verizon.",
            "Verizon is good for LTE and terrible for 5G."
        ]
    },
    "Is the 5G home internet good?": {
        "title": "Is the 5G home internet good?",
        "score": 3,
        "url": "https://www.reddit.com/r/tmobile/comments/1drcj7h/is_the_5g_home_internet_good/",
        "content": "Been looking at the prices of it and it's pretty low compared to what I pay for internet now. Seems a little too good to be true. To those who have it, is it worth it?",
        "num_comments": 14,
        "comments": [
            "Nobody here can answer your question, it is very location dependent. Good thing is there is a short trial period for you to see what service you get at your location. Works for your needs, great. Doesn't work for your needs, cancel it.",
            "I've had it 2 years.  Had occasional hiccups but I still using an older unit .",
            "T-Mobile Home Internet is a wireless signal just like your cell phone. If your service and speeds are good at your house with T-Mobile, then it’s a strong probability T-Mobile home internet will have a good signal. I currently use it, and I’m getting about 400mbps. We have multiple devices running at the same time on it and it works great! My kids can play Fortnite while we are streaming a movie and there’s no hiccups. But it really depends on where you live. You do have 14 days to try it out. There is an app that you DL to determine the best place to put the modem. If you live in a place with terrain issues (hills, trees, valleys, etc) that can affect your strength of signal. Also how close the nearest cell tower is to you can help or worsen your signal. Lastly, it’s important to know that just because you have T-Mobile where you live, doesn’t mean you can get home internet through T-Mobile. Depending on how many users are already connected to the tower you currently use will sometimes determine your eligibility. T-Mobile does this to ensure there isn’t any congestion to their network. For the top internet package it’s $75 a month, or $70 with autopay. If you have a voice line already through T-Mobile, you get an additional $20 off, which would make it $55, or $50 with autopay. The equipment is free. The premium package also comes with a mesh router to extend the signal through your home. I hope this helps and good luck!",
            "All depends on your location and how close to towers it is. I like mine, a few hiccups in the beginning but it’s been great since. I still can’t stream Prime video with it for some reason. When I need to watch Prime Video, I use my phone’s hotspot.",
            "Highly depends on location. And may vary over time. Only one way to find out.",
            "How do I know I have a good location?",
            "Order it, if available for your location, and see during the trial period offered.",
            "Do you currently have T-Mobile as your cell provider?",
            "If you have great phone speeds, it might be decent. (But TMHI is lower priority than cell plans so it could be slower)\nBut as they say, it’s location dependent.  It’s possible for a neighbor to have great TMHI and you have a poor experience, or visa versa.",
            "How are your speeds?\n\nEdit: at home*"
        ]
    },
    "GO5GPLUS vs International Data pass": {
        "title": "GO5GPLUS vs International Data pass",
        "score": 2,
        "url": "https://www.reddit.com/r/tmobile/comments/1drb3aw/go5gplus_vs_international_data_pass/",
        "content": "My husband and sons are going to Africa for two weeks. We have the GO5GPlus plan. Can someone explain the benefits for international travel that comes with our planl vs adding an international data pass? I already looked up the country and it is one that works with T-Mobile. Just not sure if we should add a pass for them or not. TIA! ",
        "num_comments": 3,
        "comments": [
            "You'll have 5GB of high speed data, free sms, and $0.25 per min calling if you do nothing, this is a benefit during each bill cycle.\n\nIf you add an international data pass you'll first use the high speed data from the pass (then you'll use the 5GB of high speed data), unlimited calling and still free sms. This is only during the valid duration of the international data pass, so if you only bought a 10 day pass, on the 11th day, calls are now charged.",
            "Ok that helps. If they’ll be using Apple Maps for driving directions and boys wanting to watch YouTube then we should probably get the pass.",
            "Can always download videos ahead of time in the YouTube app with premium."
        ]
    },
    "New symbol on phone ": {
        "title": "New symbol on phone ",
        "score": 22,
        "url": "https://i.redd.it/4m3sbtus8e9d1.png",
        "content": "Has anyone gotten this? Do you know what the lightening bolt-ish symbol is? TIA",
        "num_comments": 15,
        "comments": [
            "Ya broke it. Congratulations. \n\n(I kid. I kid.)",
            "What phone is it? I tried circle to search and found nothing.",
            "Idk. Not getting a free phone for it tho",
            "If it's a samsung device,  you have the sensors off active.",
            "It means you have no heartbeat and are walking around as a zombie now.",
            "This sub is about T-Mobile this is not related to",
            "Gemini is trying to say it's \"airplane\" mode",
            "Not related to tmobile, may want to inquire in the sub of the device's manufacturer",
            "Some kind of new \"no signal\" icon?",
            "That is just the iOS emergency satellite mode icon that shows up when in Globalstar mode."
        ]
    },
    "AMEX Biz Debit Card?": {
        "title": "AMEX Biz Debit Card?",
        "score": 1,
        "url": "https://www.reddit.com/r/tmobile/comments/1drd80z/amex_biz_debit_card/",
        "content": "I feel iv seen mixed reviews on this, if someone has first hand knowledge would be the best! I have a Amex business checking account, want to setup auto payment using debit card for the savings of $5/line auto pay discount. \n\nBeing its an AMEX debit card does it still qualify? \n\nIt just easier for everyone if its paid out of the business account, I know T-Mobile data breaches and etc.",
        "num_comments": 0,
        "comments": []
    }
}