{
    "\"The Collected Poems of J. R. R. Tolkien\" to release this September. (Three volume box set, 1368 pages, edited by Wayne Hammond and Christina Scull)": {
        "title": "\"The Collected Poems of J. R. R. Tolkien\" to release this September. (Three volume box set, 1368 pages, edited by Wayne Hammond and Christina Scull)",
        "score": 158,
        "url": "https://www.reddit.com/r/tolkienfans/comments/1bd35ma/the_collected_poems_of_j_r_r_tolkien_to_release/",
        "content": "- The Collected Poems of J. R. R. Tolkien\n- Edited by Christina Scull and Wayne Hammond\n- Three-volume boxed set\n- 1620 pages and 240 poems, including 77 previously unpublished\n- 12 September 2024\n- ISBN 9780008628826\n\n[From the Press Release (via TCG)](https://www.tolkienguide.com/modules/newbb/viewtopic.php?post_id=55644#forumpost55644):\n\n>HarperCollins has announced it is to publish The Collected Poems of J.R.R. Tolkien, edited by Christina Scull & Wayne G. Hammond, in September 2024.\n>\n>Poetry was the first way in which Tolkien expressed himself creatively and through it the seeds of his literary ambition would be sown. Out of one of his earliest poems, The Voyage of Éarendel the Evening Star, begun in 1914, would appear the character, Eärendil, and from him would spring the world of ‘the Silmarillion’, and then The Hobbit and The Lord of the Rings, each of whose stories are enriched with poems both humorous and haunting, magical and moving.\n>\nThe world-renowned Tolkien scholars, Christina Scull & Wayne G. Hammond, provide the stories behind, and analysis of, each poem, as well as revealing the extraordinary amount of work that Tolkien devoted to every one, creating a landmark new publication which confirms that J.R.R. Tolkien was as fine a poet as he was a writer.\n>\n>Christina Scull & Wayne G. Hammond say: ‘It has been an honour to prepare, at Christopher Tolkien’s invitation, these volumes of his father’s poems, putting into print many previously unpublished works and ensuring that Tolkien’s talent for poetry becomes more widely known. Charged at first to review only his early poems, we soon saw the benefits of examining his entire poetic opus across six decades, vast though it is with hundreds of printed and manuscript sources, and of showing its evolution with comments in the manner of Christopher’s magisterial History of Middle-earth series. Not long before his death, we were able to send Christopher a trial portion of the book, which he praised as “remarkable and immensely desirable”.’\n>\n>Chris Smith, Publishing Director, says: ‘Poetry runs like a vein of mithril through all the books that J.R.R. Tolkien wrote. He delighted in language and storytelling, and the almost 200 poems contained in this collection reveal him at his creative best in verse. Within this new three-volume set, there are worlds in miniature to be discovered and revelled in, populated with unforgettable characters and settings both familiar and full of wonder.’\n\n\n[From the Amazon listing](https://www.amazon.co.uk/dp/0008628823):\n\n>World first publication of the collected poems of J.R.R. Tolkien, spanning almost seven decades of the author’s life and presented in an elegant three-volume hardback boxed set.\n>\n>J.R.R. Tolkien aspired to be a poet in the first instance, and poetry was part of his creative life no less than his prose, his languages, and his art. Although Tolkien’s readers are aware that he wrote poetry, if only from verses in *The Hobbit* and *The Lord of the Rings*, its extent is not well known, and its qualities are underappreciated. Within his larger works of fiction, poems help to establish character and place as well as further the story; as individual works, they delight with words and rhyme. They express his love of nature and the seasons, of landscape and music, and of words. They convey his humour and his sense of wonder.\n>\n>The earliest work in this collection, written for his beloved, is dated to 1910, when Tolkien was eighteen. More poems would follow during his years at Oxford, some of them very elaborate and eccentric. Those he composed during the First World War, in which he served in France, tend to be concerned not with trenches and battle, but with life, loss, faith, and friendship, his longing for England, and the wife he left behind. Beginning in 1914, elements of his *legendarium*, ‘The Silmarillion’, began to appear, and the ‘Matter of Middle-earth’ would inspire much of Tolkien’s verse for the rest of his life.\n\n[From Wayne and Christina](https://wayneandchristina.wordpress.com/2024/03/12/tolkiens-collected-poems/):\n\n> HarperCollins having announced today that The Collected Poems of J.R.R. Tolkien will be published this September, we’re able to speak publicly about our next book for the first time since an edition of Tolkien’s verse was suggested to us in HarperCollins’ offices in April 2016. ...\n\n>...In the beginning, Christopher had no thought of publishing his father’s entire vast, complex poetic opus. Instead, he focused on what he called the ‘early poems’, which we interpreted as those composed mostly before the 1930s. Many of those were, indeed, not yet published, some not even recorded in our Chronology. But we saw that there were also unpublished poems of note from later decades, as well as some which had been published but were now hard to find, and we knew that not a little of Tolkien’s earlier poetry had evolved into later verse, for example in his 1962 Adventures of Tom Bombadil. Surely, no one can appreciate Tolkien as a poet fully without considering all of these works together.\n>\n>Discussions with Christopher about the book occurred at intervals; he himself was busy, preparing *The Fall of Gondolin*. At length, we proposed that it would be a lost opportunity not to collect as many of his father’s poems as possible, regardless of their date of composition, language, or circumstance, and to model such a collection after Christopher’s *History of Middle-earth*, combining original texts with editorial notes and commentary. For Tolkien’s longer poems already published as separate books, such as *The Legend of Sigurd and Gudrún* and *The Fall of Arthur*, or in composite works such as *The Lays of Beleriand*, we suggested that brief, representative extracts be included, in order to show in full Tolkien’s development as a poet and verse forms he did not use elsewhere; and in the same way, we would draw also from his translations of Old and Middle English poems, such as *Beowulf* and *Sir Gawain and the Green Knight*. In March 2019, in what would be the final message he sent to us, Christopher approved our concept and trial entries....\n\n>...A number of factors, namely economies of production, ruled out a *Complete Poems* by Tolkien. Nevertheless, the *Collected Poems* will include most of the verses Tolkien is known to have written, and for most of these, multiple versions which show their evolution. There are at least 240 discrete poems, depending on how one distinguishes titles and versions, presented in 195 entries and five appendices. When possible, we have used manuscripts and typescripts in the Bodleian Library, at Marquette University, and at the University of Leeds. We have chosen not to include all of the one hundred or so poems contained in The Hobbit and The Lord of the Rings, but have made a representative selection – surely, no one who reads the *Collected Poems* will not already have at least one copy of Tolkien’s two most popular works. His longer poems, as we have said, will be presented as excerpts. The book will also include a long introduction to Tolkien as a poet, a brief chronology of his poetry, and a glossary of archaic, unusual, or unfamiliar words he used in his verse.\n>\n>HarperCollins have announced the *Collected Poems* as a three-volume boxed set. The Amazon UK description gives its extent as 1,368 pages, which is close to the number in our typescript; in fact, the printed text will run to more than 1,500 pages. There are currently no plans for a de luxe edition, but we’re aiming for an elegant trade release. We have not yet heard about a U.S. edition.\n\n[From Wayne and Christina (via TCG)](https://www.tolkienguide.com/modules/newbb/viewtopic.php?post_id=55668#forumpost55668):\n\n>The Amazon description, which we didn't see before it was posted, seems to be based on our initial report to Christopher in December 2016, ... We had guessed, way back when, that Tolkien wrote between 250 and 300 poems altogether, without knowing how many one would, or could, include in a collection, and that \"some 60\" poems among the scans we received were unpublished. We knew, however, of other unpublished poems not in that group of scans, which we had seen at the Bodleian, and later we learned of still more.\n>\n>We say in our blog post that the Collected Poems will include \"at least 240 discrete poems\". This does, as we also say, depend on one's definition. Some of the poems morph in their evolution so much that one could either count a work as a single entity in a variety of forms, or as a variety of separate poems that are closely related. Hence our vagueness about the number: we didn't want to overhype it.\n>\n>There's a similar issue with counting which poems have been published and which haven't. The best we can say is that among the poems we include, 77 have not been published before in any form, or only a few lines from them have appeared, e.g. in Carpenter's biography. But that is to leave out alternate, unpublished forms of some poems included in The History of Middle-earth, an extreme example of which is the sequence The Grimness of the Sea > The Tides > Sea Chant of an Elder Day > Sea-Song of an Elder Day > The Horns of Ulmo > The Horns of Ylmir. Christopher Tolkien included only the latter of these in full in The Shaping of Middle-earth, with notes on and snippets from some earlier versions, and by the time one reaches the text at the end of the evolution, only about one-half of one line of The Grimness of the Sea has survived! At any rate, there will be a lot that's new.",
        "num_comments": 72,
        "comments": [
            "I’m hoping for *Reginhardus the Fox* and *The Complaint of Mîm the Dwarf* among the 60 previously unpublished poems.",
            "I am extremely impressed at how they're still managing to pull together new Tolkien books 50 years after he died. I mean that sincerely - I loved the Great Tales books and The Fall of Numenor.\n\nBut, surely, we must be getting to the point where there's no unpublished stuff, or even new packages of previously-published stuff, to be released?",
            "“A number of factors, namely economies of production, ruled out a Complete Poems by Tolkien. Nevertheless, the Collected Poems will include most of the verses Tolkien is known to have written, and for most of these, multiple versions which show their evolution. There are at least 240 discrete poems, depending on how one distinguishes titles and versions, presented in 195 entries and five appendices. When possible, we have used manuscripts and typescripts in the Bodleian Library, at Marquette University, and at the University of Leeds. We have chosen not to include all of the one hundred or so poems contained in The Hobbit and The Lord of the Rings, but have made a representative selection – surely, no one who reads the Collected Poems will not already have at least one copy of Tolkien’s two most popular works. His longer poems, as we have said, will be presented as excerpts. The book will also include a long introduction to Tolkien as a poet, a brief chronology of his poetry, and a glossary of archaic, unusual, or unfamiliar words he used in his verse.\n\nHarperCollins have announced the Collected Poems as a three-volume boxed set. The Amazon UK description gives its extent as 1,368 pages, which is close to the number in our typescript; in fact, the printed text will run to more than 1,600 pages. There are currently no plans for a de luxe edition, but we’re aiming for an elegant trade release. We have not yet heard about a U.S. edition.”",
            "For anyone who isn't aware, Tolkien Gateway has a short list of known about but as of yet unpublished poems: [https://tolkiengateway.net/wiki/Index:Unpublished\\_material#Poetry](https://tolkiengateway.net/wiki/Index:Unpublished_material#Poetry)  \n\n\nPersonally I really hope we get The Complaint of Mîm the Dwarf in the newly published works!",
            "Wow; best literary news all year!",
            "Well, now I know what my birthday present will be.",
            "I'm surprised that it took this long to actually get this.",
            "Where’s a US link?",
            "A compulsory purchase for u/killingmemesoftly, surely? :D",
            "This is great news. My next Christmas present to myself."
        ]
    },
    "(Take 2) 2024 The Silmarillion and The Fall of Gondolin Read-Along Announcement and Index": {
        "title": "(Take 2) 2024 The Silmarillion and The Fall of Gondolin Read-Along Announcement and Index",
        "score": 26,
        "url": "https://www.reddit.com/r/tolkienfans/comments/1ckl628/take_2_2024_the_silmarillion_and_the_fall_of/",
        "content": "# Welcome to 2024 all ye present!\n\nThis year I am scheduling a Read-Along of *The Silmarillion* followed by *The Fall of Gondolin* books split up over the 52 weeks of 2024. Most weeks will cover one chapter. The exceptions being the final two sections of *The Silmarillion* will be grouped in one week and \"The Original Tale\", and \"The Last Version\" chapters of *The Fall of Gondolin* will be split up into three weeks each. Week 1 will begin Dec. 31, 2023.\n\nI have also decided to interject a special *Overlithe* (leap day on the Shire Calendar) discussion on Feb. 29, 2024.\n\nA year-long schedule means nobody has to feel rushed or stressed to keep up, but able to take a leisurely approach, savoring every chapter and page. Someone who comes in late, or has to give it up for a while, would have time to catch up. And those new to JRRT's great work would have plenty of time to discuss each chapter to their heart's content.\n\nI also look forward to people's comments concerning their particular edition of the book they are reading (or possess) including artwork, misprints, errors, interesting facts, etc. I would like the discussions to stay on-target with just the books (referencing other Tolkien-related books and materials is fine) but not various movies, TV productions and the like.\n\nMy personal primary texts used:\n\n*The Silmarillion*, 2nd ed. (Trade paperback ed., 8th printing). Houghton Mifflin. 1991. ISBN: 0-618-12698-8.\n\n*The Silmarillion* with illustrations by Ted Nasmith (Illustrated hardcover ed., 1st printing), HarperCollins. 2021. ISBN: 978-0-00-843394-9.\n\n*The Fall of Gondolin* with illustrations by Alan Lee (Illustrated hardcover ed., 8th printing), HarperCollins. 2018. ISBN: 978-0-00-830275-7.\n\n&#x200B;\n\nMy wish for 2024 is that this Read-Along will be the most comprehensive set of discussions anywhere. I certainly value your opinions. And thank you, [r/tolkienfans](https://web.archive.org/web/20240215110857/https://www.reddit.com/r/tolkienfans) moderators, for your help and patience.\n\n&#x200B;\n\n**THE SILMARILLION**\n\n**PREFATORY MATERIAL**\n\n|**Schedule**|**Starting Date**|**Chapter**|\n|:-|:-|:-|\n|Week 1|Dec 31|[Foreward](https://new.reddit.com/r/tolkienfans/comments/18v04iy/2024_readalong_week_1_the_silmarillion_foreward/)|\n|Week 2|Jan 7|[Preface to the Second Edition and From a Letter by JRR Tolkien to Milton Waldman, 1951](https://new.reddit.com/r/tolkienfans/comments/190ltwx/2024_readalong_week_2_the_silmarillion_preface_to/)|\n\n&#x200B;\n\n**PART I: The** ***Ainulindalë*** **(The Music of the Ainur)**\n\n|**Schedule**|**Starting Date**|**Chapter**|\n|:-|:-|:-|\n|Week 3|Jan 14|[AINULINDALE - The Music of the Ainur](https://new.reddit.com/r/tolkienfans/comments/1969w4m/2024_readalong_week_3_the_silmarillion/)|\n\n&#x200B;\n\n**PART II: The** ***Valaquenta*** **(Account of the Valar and Maiar according to the lore of the Eldar)**\n\n|**Schedule**|**Starting Date**|**Chapter**|\n|:-|:-|:-|\n|Week 4|Jan 21|[VALAQUENTA - Account of the Valar and Maiar according to the lore of the Eldar](https://new.reddit.com/r/tolkienfans/comments/19bx694/2024_readalong_week_4_the_silmarillion_valaquenta/)|\n\n&#x200B;\n\n**PART III:** ***Quenta Silmarillion*** **(The History of the Simarils)**\n\n|**Schedule**|**Starting Date**|**Chapter**|\n|:-|:-|:-|\n|Week 5|Jan 28|[Of the Beginning of Days](https://new.reddit.com/r/tolkienfans/comments/1acyeg3/2024_readalong_week_5_the_silmarillion_quenta/)|\n|Week 6|Feb 4|[Of Aule and Yavanna](https://new.reddit.com/r/tolkienfans/comments/1aihyjn/2024_readalong_week_6_the_silmarillion_quenta/)|\n|Week 7|Feb 11|[Of the Coming of the Elves and the Captivity of Melkor](https://new.reddit.com/r/tolkienfans/comments/1ao3ed0/2024_readalong_week_7_the_silmarillion_quenta/)|\n|Week 8|Feb 18|[Of Thingol and Melian](https://new.reddit.com/r/tolkienfans/comments/1atoshh/2024_readalong_week_8_the_silmarillion_quenta/)|\n|Week 9|Feb 25|[Of Eldamar and the Princes of the Eldalie](https://new.reddit.com/r/tolkienfans/comments/1azi3hz/2024_readalong_week_9_the_silmarillion_quenta/)|\n|Leap Day|Feb 29|[Overlithe](https://new.reddit.com/r/tolkienfans/comments/1b32qp5/2024_readalong_week_9_the_silmarillion_quenta/)|\n|Week 10|Mar 3|[Of Feanor and the Unchaining of Melkor](https://new.reddit.com/r/tolkienfans/comments/1b57bfk/2024_readalong_week_10_the_silmarillion_quenta/)|\n|Week 11|Mar 10|[Of the Silmarils and the Unrest of Noldor](https://new.reddit.com/r/tolkienfans/comments/1bb47a9/2024_readalong_week_11_the_silmarillion_quenta/)|\n|Week 12|Mar 17|[Of the Darkening of Valinor](https://new.reddit.com/r/tolkienfans/comments/1bgrxuj/2024_readalong_week_12_the_silmarillion_quenta/)|\n|Week 13|Mar 24|[Of the Flight of the Noldor](https://new.reddit.com/r/tolkienfans/comments/1bs29in/2024_readalong_week_13_the_silmarillion_quenta/)|\n|Week 14|Mar 31|[Of the Sindar](https://new.reddit.com/r/tolkienfans/comments/1c0g1rg/2024_readalong_week_14_the_silmarillion_quenta/)|\n|Week 15|Apr 7|[Of the Sun and Moon and the Hiding of Valinor](https://new.reddit.com/r/tolkienfans/comments/1c21x1n/2024_readalong_week_15_the_silmarillion_quenta/)|\n|Week 16|Apr 14|[Of Men](https://new.reddit.com/r/tolkienfans/comments/1c9c8g2/2024_readalong_week_16_the_silmarillion_quenta/)|\n|Week 17|Apr 21|[Of the Return of the Noldor](https://new.reddit.com/r/tolkienfans/comments/1ca1ta4/2024_readalong_week_17_the_silmarillion_quenta/)|\n|Week 18|Apr 28|[Of Beleriand and its Realms](https://new.reddit.com/r/tolkienfans/comments/1clde2f/2024_readalong_week_18_the_silmarillion_quenta/)|\n|Week 19|May 5|[Of the Noldor in Beleriand](https://new.reddit.com/r/tolkienfans/comments/1cqs4mw/2024_readalong_week_19_the_silmarillion_quenta/)|\n|Week 20|May 12|[Of Maeglin](https://new.reddit.com/r/tolkienfans/comments/1cvhr72/2024_readalong_week_20_the_silmarillion_quenta/)|\n|Week 21|May 19|[Of the Coming of Men into the West](https://new.reddit.com/r/tolkienfans/comments/1cwvdp6/2024_readalong_week_21_the_silmarillion_quenta/)|\n|Week 22|May 26|[Of the Ruin of Beleriand and the Fall of Fingolfin](https://new.reddit.com/r/tolkienfans/comments/1d0ustt/2024_readalong_week_22_the_silmarillion_quenta/)|\n|Week 23|Jun 2|[Of Beren and Lúthien](https://new.reddit.com/r/tolkienfans/comments/1d688eq/2024_readalong_week_23_the_silmarillion_quenta/)|\n|Week 24|Jun 9|[Of the Fifth Battle: Nirnaeth Arnoediad](https://new.reddit.com/r/tolkienfans/comments/1dcegpu/2024_readalong_week_24_the_silmarillion_quenta/)|\n|Week 25|Jun 16|[Of Turin Turambar](https://new.reddit.com/r/tolkienfans/comments/1dhhvlv/2024_readalong_week_25_the_silmarillion_quenta/)|\n|Week 26|Jun 23|Of the Ruin of Doriath|\n\n&#x200B;\n\n**PART IV:** ***Akallabêth*** **(The Downfall of Númenor)**\n\n|**Schedule**|**Starting Date**|**Chapter**|\n|:-|:-|:-|\n\n\n**PART V: \"Of the Rings of Power and the Third Age\"**\n\n|**Schedule**|**Starting Date**|**Chapter**|\n|:-|:-|:-|\n\n\n**BACK MATTER**\n\n|**Schedule**|**Starting Date**|**Chapter**|\n|:-|:-|:-|\n|Week 31|Jul 28|Tables|\n|Week 32|Aug 4|Notes of Pronunciation|\n|Week 33|Aug 11|Index of Names|\n|Week 34a|Aug 18|Appendix: Elements in Quenya and Sindarin Names|\n|Week 34b|Aug 18|Map of Beleriand and the Lands of the North|\n\n**THE FALL OF GONDOLIN**\n\n&#x200B;\n\n&#x200B;",
        "num_comments": 5,
        "comments": [
            "[ Removed by Reddit ]",
            "Glad to see this has come back!",
            "Here are some online resources to help enhance your appreciation of all things Tolkien. Search for them on your favorite browser. The previous Comment listing these items had gotten deleted this evening, apparently, when I edited it enclosed the URL weblink to Stan Brown's \"FAQ of the RIngs\". At that point, Reddit deleted the Comment. Not sure what of that URL Reddit didn't like. So once again, here these all are in pure text form.\n\n* The Tolkien Meta-FAQ -- compiled from USENET newsgroups postings on rec.arts.books.tolkien and alt.fan.tolkien by Steuard Jensen. Last revised 2009.\n* FAQ of the Rings -- Frequenty Asked Questions about the Rings of Power by Stan Brown. Last revised 11/28/2021.\n* Rings of Power -- FAQ created by Erik Tracy (website capture from 9/5/2023).\n* The FAQ-Like Guide to the Letters of J.R.R. Tolkien -- Compiled and indexed by Mike Brinza. Last revised 12/4/2005.\n* Tolkien Gateway -- A J.R.R. Tolkien encyclopedia currently serving 12,519 articles.\n* [TheOneRing.net](http://TheOneRing.net) Forums\n* [TheOneRing.net](http://TheOneRing.net) on Discord\n* r/MiddleEarth on Discord\n* Lord of the Rings FAQ: Answers for Simpletons (Like Me) -- By Eric J. Juneau. Last revised 5/13/2021.\n* J.R.R. Tolkien Forums on LOTRO\n* The Tolkien Forum\n* The Encyclopedia of Arda -- An Interactive Guide to the Works of J.R.R. Tolkien\n* The Silmarillion on The Lord of the Rings Wiki\n* The Fall of Gondolin on The Lord of the Rings Wiki)\n* The Silmarillion on Wikipedia\n* The Fall of Gondolin on Wikipedia\n* Interactive Middle-earth Map by the LOTR Project.",
            "Indeedy! Hope to get new content posted for last week and this week … this afternoon. Thanks for sticking around.",
            "No pressure - real life comes first! I once took on a two-day posting schedule that lasted over a year and that taught me a lot. Besides, more time to read the Realms of Beleriand, which is genuinely my favourite chapter, is an excellent prospect."
        ]
    },
    "A solution to the Orc problem that Tolkien has if Orcs are corrupted elves/men ....": {
        "title": "A solution to the Orc problem that Tolkien has if Orcs are corrupted elves/men ....",
        "score": 16,
        "url": "https://www.reddit.com/r/tolkienfans/comments/1dqyqs3/a_solution_to_the_orc_problem_that_tolkien_has_if/",
        "content": "Basically, Tolkien was struggling with the issues of Orcs' origins and one idea of the Orcs was that they were corrupted by Melkor from Elves or Men (depending on which you believe in). The trouble is that they would need to be shown mercy whenever possible and there would be individuals or tribes that would be good despite what Melkor and Sauron did to them (due to Tolkien's beliefs that not one race would be wholly evil). Maybe a solution would to have those good orcs\\* and scenes of showing mercy to orcs be 'offscreen'\\*  both to not mess up the pacing of the books and to allow for more side stories while allowing for 'onscreen' depictions of orcs to be bad guys to kill if needed.\n\n&#x200B;\n\n(I actually came up with this concept originally when brainstorming concepts for a Command and Conquer fanfic universe where the Tiberium universe is not a splinter timeline of the Red Alert timeline but the far, far future of Arda (again branching off from Arda becoming our world) to bring in good orcs and explain where would they be during the events of the War of the Ring)\n\n&#x200B;\n\n\\*Tolkien actually wanted it in a draft of Lord of the Rings and Frodo would have met them. He canned it as he can't find a way to put it in the books...\n\n&#x200B;\n\n\\*Similar to ground based operations in the Freespace video game . We don't get to see them onscreen because it would cause issues with pacing",
        "num_comments": 56,
        "comments": [
            ">Tolkien actually wanted it in a draft of Lord of the Rings and Frodo would have met them. He canned it as he can't find a way to put it in the books...\n\nYou have a cite for that?\n\nHe found a way to suggest that not all the Men in Sauron's armies were bad: \"He wondered what the man’s name was and where he came from; and if he was really evil of heart, or what lies or threats had led him on the long march from his home; and if he would not really rather have stayed there in peace.\"",
            "In later writings, Tolkien notes that the Orcs were naturally bad, and would do evil things regardless of the directives of Morgoth or Sauron.\n\n\nI don't think calling them \"good\" is quite defensible. The closest I've seen Tolkien get to that concept is that Eru/God at least tolerated them as being part of the world, and so \"ultimately\" good, but not necessarily redeemable by Elves or Men. My take on that is that Eru may rehabilitate them after they die.",
            "The nature of Orcs really is a thorny problem when it comes to Tolkien's metaphysics, so it makes sense that Tolkien always felt a bit uncomfortable with their origin.\n\nI think that if we keep the assumption that Ainur are incapable of creating free-thinking creatures (which the Orcs definitely are) on their own, we have to accept that Orcs were created at least partially from Elves (with men added to the mix later on).\n\nI think on a spiritual level, we might compare the Orcs to Men, though far more 'innately' corrupted. While the awakening of Men and what Morgoth did to them is nebulous, even in-universe, its generally accepted that Morgoth managed to partially corrupt the *entire* Race of Men at their beginning, leaving them susceptible to Darkness.\n\nI don't think its too hard to imagine that the original Orcs were the recipients of a similar level of Race-wide innate corruption during their creation in Utumno (combined with other undescribed flesh-crafting to corrupt their bodies on top of their spirits), but far stronger at the expense of it not encompassing the majority of Elves.\n\nI guess what I'm saying is that I think that the original Orcs got a similar but much stronger dose of the 'original sin' that Men got, so while they weren't pure evil to the core they were a lot more susceptible to its influence and domination when a powerful evil will was active in the world. Combined with millennia of cultural baggage, of course.",
            "It is arguable that mercy was shown \"onscreen\" when after the war, Aragorn gives the land of Mordor to those dwelling there. Who lives in Mordor? A lot of freaking orcs. Many will say that it was given to just the human slaves of Sauron. But if that is true, what happened to all the orcs? There had to be workers, children, and mothers. That would imply that Aragorn committed genocide.",
            "I never really understood this call for mercy re: the orcs. First, I can’t think of any situation where the Fellowship could’ve shown greater mercy to the orcs without jeopardizing the Quest. Second, I don’t think they show any less mercy to the orcs vs the men in service of Sauron or Saruman. Third, the theme of showing mercy to one’s enemies is already explored beautifully in the story with Sméagol. Fourth, even if you were to argue that the Free Peoples behaved unmercifully toward orcs during the story… that’s fine? I think the story probably benefits from having heroes who mostly act in accordance with the values of their societies and their needs in the moment rather than to the author’s moral principles.",
            "*Maybe you have heard of Trolls? They are mighty strong. But Trolls are only counterfeits, made by the Enemy in the Great Darkness, in mockery of Ents, as Orcs were of Elves...*\n\nTreebeard said this to Merry and Pippin in the Two Towers, so that was Tolkien's final reasoning at the time, after reviewing the books and finally publishing it. Thats the thing, its been *published*. The Lord of the Rings is **canon**, so in my opinion, after the publication, the right thing to do would be to comply to the ideas presented in TLOTR. \n\nI honestly can't see a good reason to make Treebeard being outright wrong about it. He's a very ancient being, he had contact and talked with the first Elves at the dawn of time, so he would actually be one of the best living sources of ancient knowledge in TLOTR and a witness to many things since the beginnings of Middle-earth, so making him being wrong would be a very difficult thing to do. \n\nThats why I think the most logical course would be to support the idea that indeed Orcs were mockery of Elves.",
            "I actually thought about writing a fanfic once upon a time that touched upon this. It would have involved an Orc essentially following the mythic cycle of Eärendil and sailing to the West.",
            "> there would be individuals or tribes that would be good despite what Melkor and Sauron did to them (due to Tolkien's beliefs that not one race would be wholly evil)\n\nI'm not sure this is correct. The closest we see to anything like resistance in orcs are two orcs who are totally subservient to the will of Sauron think aloud about being able to rape, pillage, rob, burn, etc. on their own without someone else telling them to do it or having to share the loot. \n\nWe never see orcs actually demonstrate the most important characteristic of free-thinking beings or independent agents with a will of their own. We never see orcs disobey or want something out of their nature. Humans can obey or disobey, they have wants and desires independent of what others want them to want and desire, and despite their fallen natures humans still yearn and strive for Heaven. Humans, despite being corrupt, can still want and do good.\n\nOrcs, in contrast, are never shown wanting or doing anything other than what Morgoth bred them to do, which is to rape, pillage, and destroy. They are never shown as capable of wanting or doing anything other than what it is their nature to do. They never even demonstrate an ability to disobey the Dark Lord(s).\n\nOrcs remind me very much of demons. Demons are arranged into an [hierarchy of the damned](https://www.newadvent.org/summa/1109.htm) in Catholic teaching. And demons are theoretically capable of disobeying specific orders from their damned masters. But that doesn't mean demons are capable of doing good because all good has been annihilated from a demon's spirit by its rebellions against God. The demon is totally evil, incapable of ever doing good, and therefore while the demon can act it has no agency or independent will and can only do evil. This seems to be the case with orcs in their relationship to Sauron and Morgoth.",
            "I think we just have to live with Tolkien having quite solid morals; but all his work is written with mythical/biblical morality where people can be inherently evil and collectively punished\n\nYou know, imagine you're a random man of the mountains and find out your king didn't honour an oath so you're doomed to 3000 years of torment and undeath",
            "Tolkien mentions an interesting thing in the Unfinished Tales regarding the Druedain and the Orcs:\n\nTo the unfriendly who, not knowing them(The Druedain) well, declared that Morgoth must have bred the Orcs from such a stock the Eldar answered: \"Doubtless Morgoth, since he can make no living thing, bred Orcs from various kinds of Men, but the Drúedain must have escaped his Shadow; for their laughter and the laughter of Orcs are as different as is the light of Aman from the darkness of Angband.\" But some thought, nonetheless, that there had been a remote kinship, which accounted for their special enmity. Orcs and Drûgs each regarded the other as renegades\n\nHere Tolkien mentions a possible kinship between the Druedain and the Orcs, saying that Morgoth may have bred the orcs from men, including the Druedain, but that the Druedain escaped from Morgoth, and that both sides consider each other renegades, this last part further implies that there was a relation between them, and even some common origin,its possible the druedain are descendents of some mens that have been ''experimented'' by Morgoth when he was breding the orcs, maybe some type of proto orcs, but that they escaped Morgoth and became free, and therefore something close to the idea of ​​a good orc, although the kinship is mentioned in the form of a rumor said by those that dont like the Druedain, probaly mens, but the part of the Druedain having escaped Morgoth is said by the Eldar, that are a more reliable source, and ,of course, the idea that orcs were created from men is just one of Tolkien's many ideas about their origin, but it appears to have been the most predominant idea about the origin of orcs in his final writings."
        ]
    },
    "Comparisons in the Fellowship of the Ring": {
        "title": "Comparisons in the Fellowship of the Ring",
        "score": 26,
        "url": "https://www.reddit.com/r/tolkienfans/comments/1dqqzny/comparisons_in_the_fellowship_of_the_ring/",
        "content": "A comparison in *Many Meetings* caught my eye today, so naturally I went through all occurrences of the word 'like' in the Fellowship of the Ring. Here's what I found:\n\nThere are 447 occurrences of the word 'like' in the main text of *The Fellowship of the Ring*. Of these, 43 times it is used as verb (the Hobbits like walking at night) and 7 times as an adjective, as in *Many Meetings*:\n\n>\\[...\\] so like was \\[Arwen\\] in form of womanhood to Elrond that Frodo   \nguessed that she was one of his close kindred.\n\nThe remaining 397 uses are as a preposition of comparison. I explicitly noted 16 occurrences as a comparison to a specific person, 28 uses to describe a sound and 140 uses for a visual comparison.\n\n  \nThere are several examples I picked out to take a closer look at (Warning, lots of quotes ahead!). The most common use of a comparison I would expect is to give further description of something, or to make something unusual relatable by comparing it to something common-place. In *The Long-expected Party* for example, we have\n\n>There were rockets like a flight of scintillating birds singing with sweet voices.\n\nIn the case of\n\n>The dragon passed like an express train\n\nthe comparison is even used explicitly to paint a clearer picture in the mind of a modern reader.\n\nI noted several anthropomorphic comparisons, specifically of hills and other features of the landscape:\n\n>Stone rings grinned out of the ground like broken teeth in the moonlight.\n\nfrom *In the House of Tom Bombadil*. In *A Knife in the Dark*:\n\n>\\[Amon Sul\\] was burned and broken, and nothing remains of it now but a tumbled ring, like a rough crown on the old hill's head.\n\n  \nThere are two comparisons that serve as foreshadowing in some way:\n\n>\\[Frodo\\] may become like a glass filled with a clear light for eyes to see that can.\n\nin *Many Meetings* might foreshadow the Light of Galadriel, and the following from *A Journey in the Dark* precedes the Watcher in the Water:\n\n>When \\[the Fellowship\\] came to the northernmost corner of the lake they found a narrow creek that barred their way. It was green and stagnant, thrust out like a slimy arm towards the enclosing hills.\n\nWhat intrigued me most, however, were several comparisons that from their structure look like ones to make something more understandable, but really didn't:\n\n*In the House of Tom Bombadil:*\n\n>Then another clear voice, as young and as ancient as Spring, like the song of a glad water flowing down into the night from a bright morning in the hills, came falling like silver to meet them: \\[...\\]\n\n'falling like silver'? Does water sound different in the evening when there was sunshine in the morning?\n\n>\\[The Hobbits\\] came a few timid steps further into the room, and began to bow low, feeling strangely surprised and awkward, like folk that, knocking at a cottage door to beg for a drink of water, have been answered by a fair young elf-queen clad in living flowers.\n\nI have personally never been greeted by any elf-queen, fair and young or otherwise, but I will try to imagine it.\n\n*Many Meetings:*\n\n>\\[...\\] and the firelit hall became like a golden mist above seas of foam that sighed upon the margins of the world.\n\n*The Breaking of the Fellowship:*\n\n>Up \\[Frodo\\] went and sat upon the ancient chair, feeling like a lost child that had clambered upon the throne of mountain-kings.\n\nI really love these comparisons (and the one in *Many Meetings* was what inspired this post). They don't fit the usual *'\\[weird thing\\] like \\[less weird thing to help you understand weird thing\\]' f*ormula at all. However, they evoke the right feelings and associations. They give the impression of the author (be it Tolkien or Frodo/Bilbo/whoever) trying and struggling to describe the Indescribable.\n\n  \nThank you for taking the time to read this! Due to the time I stopped after the first two books, but I might take a further look at the rest as well. As a final quote, I also noted\n\n>His enemy halted again, facing him, and the shadow about it reached out like two vast wings.\n\nHowever, there seems to be nothing in this statement to warrant any discussion at all.",
        "num_comments": 8,
        "comments": [
            "This post made me simile.",
            "I think the point of this one:\n\n> [The Hobbits] came a few timid steps further into the room, and began to bow low, feeling strangely surprised and awkward, like folk that, knocking at a cottage door to beg for a drink of water, have been answered by a fair young elf-queen clad in living flowers.\n\nis that any folk knocking at a cottage door would not expect nor have imagined anything as astonishing as that.",
            "I like this.",
            ">like the song of a glad water flowing down into the night from a bright morning in the hills, came falling like silver to meet them\n\nTo me this conveys a glad person that comes home at night after a long day out, to food and rest; \"came falling like silver\" made me think of rain, probably because of the \"glad water\" premise. Obviously in a *highly* metaphoric sense.\n\nEdit: I like the last sentence of your post a lot.",
            "> The dragon passed like an express train\n\nSo.. they have trains in Middle Earth?",
            "good one!",
            "I agree! In a way it almost works by giving an example of what it is describing: „The Hobbits felt strangely surprised, like folk that, starting to read the word ‚like‘, have continued to read this unusual comparison.“",
            "I like this interpretation. In the case of the River-daughter there might not even be that much difference between her resting after a long day and water flowing into the night."
        ]
    },
    "Fall of Numenor material": {
        "title": "Fall of Numenor material",
        "score": 2,
        "url": "https://www.reddit.com/r/tolkienfans/comments/1dr5uxl/fall_of_numenor_material/",
        "content": "I am a bit unsure on FoNs material.\n\nIt was promoted as a collection of all canon friendly 2nd age material. So obviously there have to be omissions. Having read UT and the Galadriel stuff in it, there are obvious reasons why that material did not make the cut for example \n\nBut since I have not read HoME, I cant really judge if the omissions from there make sense. Heard especially Sauron defeated has been mostly left out. I have a rough understanding from hearsay that the Notion Club papers are time travel stories, so it seems likely that most of that material would be omitted due to being incompatible with canon.\n\nBut just for the little completionist in me (that still has to come around to HoME, being in the middle of FoN and Letters Extended right now): Are there any small or big omissions worth looking up while going through FoN that did not make the cut?\n\nI know that for some reason a paragraph was removed from the description of Numenor for example.\n\nThanks in advance for any hints! :) ",
        "num_comments": 3,
        "comments": [
            "I don't have my copy handy, but I don't remember anything being omitted. It was just more of a completed 2A package rather than it existing in bit-pieces all over the place in other publications.",
            "https://www.reddit.com/r/tolkienfans/comments/g0ii2o/quarantine_second_age_readalong_accelerated_catch/\n\nThis excellent readalong of a few years ago is very thorough. FoN is kinda the published Silm of the Second Age - it's a slimmed down version without the drafts and bits that don't mesh with each other. \n\nFoN is a nice easy read, but not for the completionist. eg The unfinished story of Tal-Elmar, a member of a group living on the shores of Middle-earth during Numenor's colonial era, isn't included, and it's Tolkien's last Legendarium writing.\n\n(Canon, especially when is comes to Galadriel and Celeborn, is rather a slippery concept.)",
            "It does try to create a (more or less) internally-consistent view of the Second Age, but Sibley does underscore every omission that's made in the text and where one can go to seek out variant versions for further reading. I was quite happy with the work, and the omissions made sense to me, but Sibley doesn't hide the stuff he cuts."
        ]
    }
}