{
    "For those who are looking for more Tomb Raider content, I highly suggest checking out the novels and comics! [(RE)REDUX Post, contains canon and non-canon content]": {
        "title": "For those who are looking for more Tomb Raider content, I highly suggest checking out the novels and comics! [(RE)REDUX Post, contains canon and non-canon content]",
        "score": 128,
        "url": "https://tombraider.fandom.com/wiki/The_Amulet_of_Power",
        "content": "",
        "num_comments": 19,
        "comments": [
            "Thank You!",
            "This post will be replacing the pinned [Legend of Lara Croft Netflix anime](https://www.reddit.com/r/TombRaider/comments/16tq3ol/tomb_raider_the_legend_of_lara_croft_official/) announcement teaser post Friday night.\n\nThis is an update on the original post which did not have the Frozen Omen comic or the J.R Milward AOD novel included.",
            "Might check out Omnibus 1 and 2, are there digital versions available?",
            "I've been doing exactly this! I just got a few issues of the top cow comics a few weeks ago. The comics can redue her to an object at times, but I really enjoy seeing classic Lara get some fleshed-out characterization.",
            "Question is the novels based on angel of darkness cannon?",
            "I remember reading translated version of Amulet of Power. It was entertaining.",
            "Rough chronology of the three main eras. Main games in bold, comics and books in italics.\n\n\n**Original**\n\n* **Tomb Raider**\n* Unfinished Business\n* **Tomb Raider II**\n* Golden Mask\n* **III: Adventures of Lara Croft**\n* The Lost Artefact\n* The Times Bonus Level\n* **The Last Revelation**\n* **Chronicles [Present]**\n* *The Amulet of Power*\n* **The Angel of Darkness**\n* *The Lost Cult*\n* *The Man of Bronze*\n\n\n\n**Remake**\n\n* **Anniversary**\n* **Legend**\n* **Underworld**\n* Beneath the Ashes\n* Lara's Shadow\n* The Guardian of Light\n* The Temple of Osiris\n* *The Frozen Omen*\n* *The Blade of Gwynnever*\n\n\n**Survivor**\n\n* *The Beginning*\n* **Tomb Raider**\n* *The Ten Thousand Immortals*\n* *Season of the Witch [1-6]*\n* *Secrets and Lies [7-12]*\n* *Queen of Serpents [13-18]*\n* **Rise of the Tomb Raider**\n* *Spore [1-6]*\n* *Choice and Sacrifice [7-12]*\n* *Survivor's Crusade [13-16]*\n* *Inferno [17-20]*\n* *Path to the Apocalypse*\n* **Shadow of the Tomb Raider**",
            "Interesting. Thanks 👍🏻",
            "Just reading Abnett's The Ten Thousand Immortals now and giggling over his including [Sinister/Dexter](https://i.imgur.com/MVm6sFK.jpeg) from his 2000AD comics as Fife's bodyguards.  Bit like Croup and Vandemar constantly reappearing in Gaiman and Pratchett's works.",
            "The books are all incredible! The lost cult got hard to read at times but they’re all very engaging"
        ]
    },
    "Was reminded of something while playing this level...": {
        "title": "Was reminded of something while playing this level...",
        "score": 58,
        "url": "https://v.redd.it/78uchf5c328d1",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Haha 😅 Good old Snakeeater 🐍it is about to be remastered as well btw 😁",
            "It’s funny because the long ladder climb in Snake Eater made me think “reminds me of that offshore rig of TR2.. At least there’s good music here” :)",
            "Well done OP 👏",
            "Brilliant!",
            "I alway laugh at tjis part! The original too long climbing up!",
            "Here's the challenge, can you climb the ladder, kill the guard, grab the key, and get back up the ladder before the song ends?",
            "I always think of the super mario 64 staircase to bowser when climbing this ladder",
            "I love how the music just abruptly cuts off one you reach the ledge.",
            "Love me some snake eater ❤️",
            "Haha nice"
        ]
    },
    "Lara 🫶😻": {
        "title": "Lara 🫶😻",
        "score": 16,
        "url": "https://i.redd.it/jc4dhs3dx38d1.jpeg",
        "content": "Is there a mechanism that when a certain number of damage is taken, the appearance and details of the blood change? I liked her like that ",
        "num_comments": 0,
        "comments": []
    },
    "The Tomb Raider randomizer mod now supports the Remastered Trilogy!!!": {
        "title": "The Tomb Raider randomizer mod now supports the Remastered Trilogy!!!",
        "score": 11,
        "url": "https://github.com/LostArtefacts/TR-Rando/blob/master/USING.md#tr-i-iii-remastered",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Nice, this will definitely keep interest in the game for much longer! And it's only been made in 4 months since release.",
            "This is Major!!",
            "This on PlayStation as well?",
            "Unfortunately, no, it's pc only"
        ]
    },
    "Rolling out! [Art by diabolumberto ]": {
        "title": "Rolling out! [Art by diabolumberto ]",
        "score": 175,
        "url": "https://i.redd.it/pltoglc5ex7d1.jpeg",
        "content": "Artist link:\nhttps://www.deviantart.com/diabolumberto",
        "num_comments": 11,
        "comments": [
            "As a Transformers fan seeing that title, I'm now imagining Lara as an Autobot lol\n\nLara looks awesome here - her Nevada outfit is still one of her all time best.",
            "Awesome art!! Also love how detailed the ATV is!!",
            "Awesome",
            "I haven't even seen the film, but Lara here makes me think of Sarah Connors in Terminator 2.\n\nIt's a great piece of fan art.",
            "Amazing! 🤩",
            "I think Lara would be like Arcee if she was an Autobot.",
            "Tomb Raider x Transformers crossover comic would be awesome.\n\nMaybe an alt universe where she is caving for a lost relic and instead finds the Ark buried after centuries. Accidentally activates something and some of the \"dead\" Transformers start to wake up.\n\nLara vs Ravage chase!\n\nTeam her up with Hound, I say.",
            "Agreed. The ATV looks great!",
            "Yeah\n\nNow I wanna see a TF show or game where Arcee is voiced by one of Lara’s VAs like Keeley Hawes.",
            "Ooooh, YES!\n\nI would love a Hound and Lara team up!"
        ]
    }
}