{
    "Our Longstanding “No Politics” Rule remains unchanged": {
        "title": "Our Longstanding “No Politics” Rule remains unchanged",
        "score": 442,
        "url": "https://www.reddit.com/r/Tools/comments/y4oc4i/our_longstanding_no_politics_rule_remains/",
        "content": "Read our rules.  We have had a longstanding “No Religion, No Politics” rule here at r/tools.\n\nThe mods aren’t stupid. We also don’t like getting buckets of reports in the inbox.\n\nIf someone posts/comments with politics, resist the urge to reply and argue. Just report, downvote (if that’s your jam) and move on with life.\n\nA small flag, sticker, etc that appears in a photo will generally be allowed (so long as it doesn’t violate other rules and doesn’t draw a bunch of reports) but a bunch of people in the comments saying “Hell Yeah, a fellow [INSERT PARTY] Supporter!” is gonna get the post pulled. Political content that is clearly the motivation for the post will get the post pulled.\n\nFirst time it’s a short ban, second time it’s permanent. And as we’ve discussed before, the mod team doesn’t go looking for posts, we’re not lifeguards, we respond to the reports we receive.",
        "num_comments": 73,
        "comments": [
            "Agreed on the tightest of standards possible from either party or mindset.  Im here to get hot and bothered by tools, and diy ideas, not for propaganda from either party!",
            "Does this go for comments too? This place has been pretty well behaved for the last good while (from what I've seen at least) but I have noticed in the past that the real political instigating nonsense usually seems to come out more in comments than posts",
            "So greatful of this sub not allowing politics, like fr its a nice break from the rest of Reddit.",
            "What does politics have to do with tools?  When I am working on something with a tool, politics does not come to mind.",
            "THANK YOU mods! Politics is everywhere these days and its nice to escape it. I dont care who you voted for or who you sleep with or who/what you worship. Lets just get out there with our tools, be safe, and work hard.",
            "It's refreshing to see a subreddit taking a strong stance on keeping politics out of the discussion. It's all about focusing on the tools and techniques, not arguing over political ideologies. Let's keep the community productive and positive!",
            "We wont go looking for you, but we will find you",
            "Red or blue here should be Milwaukee versus Makita.",
            "I was only intending to show off my magnetic tool holders, my apologies.",
            "Lets make screwdrivers great again ... oh wait no, I didn't mean to "
        ]
    },
    "Call for Moderators": {
        "title": "Call for Moderators",
        "score": 25,
        "url": "https://www.reddit.com/r/Tools/comments/1c3uthk/call_for_moderators/",
        "content": "We are looking to add a couple more moderators to r/tools. If you’re interested in being considered, please leave a comment on the post. Briefly describe why you’d want to be a mod and what you think the sub’s moderator’s role should be.\n\nNo new accounts, please. We need to be able to see at least 1 year’s worth of content/engagement on this and other subs.\n\nEDIT: If you are not interested in moderating, feel free to upvote people who post here if you like their approach. This isn't a democracy (because as mods our job is to preserve the health/utility/enjoyment people get from of the sub, not do whatever the masses want) but we will take heavily upvoted approaches to moderating as a positive sign when considering who to invite.\n\nAlso, if we don't end up sending you an invite, please don't take it personally. Too many cooks in the kitchen, and all that...",
        "num_comments": 30,
        "comments": [
            "Im interested. Ive done substantial mechanical work, but my real specialty is electrical tools and equipment. If you need someone who can delete spam, Id be happy to help.",
            "How much does the position pay?",
            "Why don't my posts go thru? I've msgd mod team, no response.",
            "Sure would be nice for a moderator to approve my post. There's ridiculous crap being posted here but I have to wait for approval? I posted about a new tool from a major brand that has still not been posted yet.",
            "Sign me up. I am an automotive engineer and been operating my own garage since 10 years. I have 8 apprentices under me. We specialise in hybrids - all kinds.\n\nMods role should be to carry out in accordance with the subs guidelines.",
            "Yeah Id be willing to help. Just clear up the trash mostly, spam, fake bots, political nonsense, people who break the rules.",
            "I would like to be a mod to help this community. I think sub moderators are there to police content, make sure that no rule breaking posts are being made and keep things civil. I agree with others saying less is more. The rules in this sub are pretty clear and should be easy to follow, and it will be very clear when people break them.",
            "Hey, Id totally be down to mod! Been part of this sub for a hot minute now, and I dig keeping things in check. Mods should be like the chill bouncers of the subreddit, you know? Keeping the peace, making sure everyones playing nice, and tossing out the troublemakers. Plus, Im all about fostering a rad community vibe. Lets keep this place legit!\n\nAnd yeah, fair call on not being a democracy. Gotta keep the balance, or itd be chaos. No hard feelings if I dont make the cut, though. Too many chefs spoil the broth, aint that the truth.",
            "Sign me up, please! I can spend more than 1 hour on Reddit every day.",
            "Hello Mods. Any chance someone could review my pending post and hopefully approve it. It's been out there for almost a day. Do all posts need approval or just ones from new members?"
        ]
    },
    "I learned something about Husqvarna today. ": {
        "title": "I learned something about Husqvarna today. ",
        "score": 51,
        "url": "https://www.reddit.com/r/Tools/comments/1dr1m7q/i_learned_something_about_husqvarna_today/",
        "content": "Short version: Husqvarna also makes sewing machines. \n \nI needed to open up a wire harness today to find a corroded wire. So I stopped in the local craft store during lunch to get a seam ripper.  Walking around the store I saw the Husqvarna logo on a banner. I asked an older lady working  in the store \" what's up with the Husqvarna banner, I know you don't sell outdoor equipment here\". She informed me that Husqvarna also makes sewing machines and they have a very long history of making different products. \n \nWhat I learned from a Google search, the company was founded in 1689 to make muskets. They produced muskets and later on shotguns until 1989. They also made kitchen equipment out of cast iron, bicycles, motorcycles, and sewing machines before getting into outdoor equipment. \n\n \n \n\n",
        "num_comments": 50,
        "comments": [
            "Next your going to tell me Texas Instruments the calculator company makes javelin anti tank missiles.",
            "Husky was basically the Swedish equivalent to Mitsubishi for a long time- you need a motorcycle, a sewing machine, or a lawn care implement? They had you covered.",
            "Like their good saws, their good sewing machines aint cheap",
            "They are one of the best sewing machine brands along with Bernina (Swiss) and Pfaff (German).",
            "I've seen a Husqvarna 2-stroke motorcycle.",
            "Also Toyota. Actually they do sewing machine first before automotive.",
            "They also make quite high end mountain ebikes. Like the kind that go for $10,000+",
            "I knew them for sewing machines then motorcycles then gardening machines",
            "My mother bought her first Viking sewing machine around 1975. Singer made the inertial navigation system for the missile I worked on. Diamond Match made an early version of the missile launcher. Food Machinery Company (FMC) made the tracked vehicle.",
            "The Husqvarna logo is a rifle sight.\n\nYou know those tall, fancy pepper mills you see on cooking shows and expensive steak houses? Those are made by Peugeot. Peugeot -- the French car company."
        ]
    },
    "this was me today": {
        "title": "this was me today",
        "score": 85,
        "url": "https://i.redd.it/xklxgnb1he9d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Can't be stuck if it's a liquid.",
            "Sometimes the solution comes to you when you're about to fall asleep",
            "\"if you can't fix it with a hammer it must be an electrical problem\".",
            "The only thinking I would be doing is where I set that MAPP torch haha.",
            "i can remove anything once",
            "9 out of 10 times its Dremel.",
            "If you haven't tried an air hammer you haven't tried everything",
            "This happened to me when even my breaker bar broke/bent at the tip or w/e it's called. I hammered the end of the bar, put some of that  penetrating fluid in there, let it soak, went as hard as I could.....it got loose and I breathed a sigh of relief. Then I had to do the other side .",
            "Can't be stuck if it's plasma.",
            "This has happened to me twice. The first time it hit me like a slap in the face just as I was falling asleep.\n\n I sat straight up in bed and loudly proclaimed \"THAT'LL DO IT!\" Then hopped outta bed and started getting dressed. Scared the ever loving shit out of my wife."
        ]
    },
    "You ever just buy a set of tools because they’re so beautiful? ": {
        "title": "You ever just buy a set of tools because they’re so beautiful? ",
        "score": 163,
        "url": "https://i.redd.it/ja2mz4lc7d9d1.jpeg",
        "content": "",
        "num_comments": 63,
        "comments": [
            "now sand off the barcode",
            "I don't need more screwdrivers, I don't need more screwdrivers, I don't need more screwdrivers, I don't need more screwdrivers....",
            "Yes. I have an entire Snap On tools box full of tools because they look pretty",
            "All the time.  Since the 90s.  Same with knives.",
            "Yes! I ordered the German Felo set. They are nice, except the printing on them is a bit funky, but the finish they came with can easily be improved. It's a sloppy coat of lacquer.",
            "One day i will get a nice vintage style toolbox and it defenitly will need a nice set of wood handle screwdrivers.",
            "I'd like to get some wood handled ratchets",
            "They would be covered in 5200,  caked on oil from whatever 35+ year old pile of crap I dragged home this month, paint, and tears in a couple weeks anyway.  So no.  But they are pretty.",
            "Yup.  My Narex wood handled screwdrivers while visiting their factory - I couldn't resist!",
            "Yes, I bought a hand forged set of carving chisels \\[62\\] about 25 year ago.  I was on a trip to pick up a mahogany hand made carved coffee table in central Mexico.  Found out the guys brother made him all the chisels he used. He had about 20 made but needed another month to make the rest. Best tool money I ever spent."
        ]
    }
}