{
    "Things to do: June 17 to June 23": {
        "title": "Things to do: June 17 to June 23",
        "score": 16,
        "url": "https://www.reddit.com/r/toronto/comments/1dhuh2b/things_to_do_june_17_to_june_23/",
        "content": " Things to do: \n\nHi [/r/Toronto](https://www.reddit.com/r/Toronto) community, please add your events and upcoming things to do in Toronto this week in this thread",
        "num_comments": 17,
        "comments": [
            "June 17-19\n\nJays vs Red Sox @ SkyDome (18th is $1 hot dog night)\n\nhttps://www.mlb.com/bluejays/schedule/2024-06\n\nJune 19\n\nWaterfront Toronto free boat tour. Rush line only\n\nhttps://x.com/PortsToronto/status/1798768107626078638\n\nFree ROM Walk. Rosedale\n\nhttps://www.rom.on.ca/en/whats-on/free-walk-rosedale-2-june-1924\n\nThe Bikeriders. Free preview @ Scotiabank Cinema.  YMMV\n\nhttps://forums.redflagdeals.com/toronto-june-19-bikeriders-preview-scotiabank-cinema-ymmv-2698232/\n\nTFC vs Nashville FC @ BMO Field\n\nhttps://www.bmofield.com/\n\nMaple Leafs vs Royals. Free baseball @ Christie Pits\n\nhttps://www.mapleleafsbaseball.com/\n\n9 to 5. Free outdoor screening @ Fort York\n\nhttps://www.topictureshow.com/9-to-5\n\nTrivia @ Kramer's w/Meetup\n\nhttps://www.meetup.com/toronto-movies-and-social-group/events/301613070/\n\nJune 20\n\nSorry To Bother You.  Free outdoor screening @ Fort York\n\nhttps://www.topictureshow.com/sorry-to-bother-you\n\nThe Outfit. Free screening @ Palmerston Library Theatre \n\nhttps://www.torontopubliclibrary.ca/detail.jsp?Entt=RDMEVT503315&R=EVT503315\n\nJune 21\n\nThe IndigiDivas. Free concert @ Toronto Music Garden\n\nhttps://harbourfrontcentre.com/series/summer-music-in-the-garden/\n\nNope. Free outdoor screening @ Fort York\n\nhttps://www.topictureshow.com/\n\nJune 22\n\nArgos vs Elks @ BMO Field\n\nhttps://www.bmofield.com/\n\n Talladega Nights: The Ballad of Ricky Bobby. Free screening @ Sorauren Park\n\nhttps://soraurenpark.wordpress.com/festivals-movies/outdoor-movies/\n\nButch Cassidy and the Sundance Kid @ Chefs Hall\n\nhttps://www.eventbrite.ca/o/chefs-hall-63998464123?aff=ebdsshother\n\nTwister.  Free outdoor screening @ Fort York\n\nhttps://www.topictureshow.com/\n\nUltimate pizza crawl w/Meetup\n\nhttps://www.meetup.com/toronto-movies-and-social-group/events/301177220/\n\n\nJune 23\n\nFree ROM Walk. Mount Pleasant\n\nhttps://www.rom.on.ca/en/whats-on/free-walk-mount-pleasant-1-june-2324\n\nRachel Mercer. Free cello concert @ Toronto Music Garden\n\nhttps://harbourfrontcentre.com/series/summer-music-in-the-garden/\n\nMaple Leafs vs Cardinals. Free baseball @ Christie Pits\n\nhttps://www.mapleleafsbaseball.com/\n\nFree drop-in kickball @ Alexandra Park. Beginners welcome\n\nhttps://www.facebook.com/TorontoKickball\n\n$20 unlimited evening bowling @ Splitsville\n\nhttps://www.splitsville.ca/special-events\n\nOut of Sight.  Free outdoor screening @ Fort York\n\nhttps://www.topictureshow.com/\n\nJune 22 & 23\n\n$10 GO Transit deal\n\nhttps://www.gotransit.com/en/partners-and-promotions/weekend-passes-with-go\n\nWoofstock Dog Festival @ Woodbine Park \n\nhttps://woofstock.ca/",
            "[Sunday, June 23: Latin Fair at Wychwood Barns](https://hispaniccanadianheritage.ca/lets-go-to-the-latin-fair-2024/)",
            "**Wed Jun 19 - Tues Jun 25**\n\nToronto Outdoor Picture Show presents a week of films @ Fort York.  Free admission.\n\n* Wed - \"9 to 5\"\n\n* Thu - \"Sorry to Bother You\"\n\n* Fri - \"Nope\"\n\n* Sat - \"Twister\"\n\n* Sun - \"Out of Sight\"\n\n* Mon - \"Backspot\"\n\n* Tues - \"Wet Hot American Summer\"\n\nhttps://www.topictureshow.com/fort-york",
            "[Thursday, June 20: Thursday app singles event @ Mademoiselle](https://t.day/3KHiDFR)",
            "These free or low cost events happen each week and are posted here for visitors.\n________________________________________\n\n* Drop-in leisure skating, free admission.  https://www.toronto.ca/data/parks/prd/skating/dropin/leisure/index.html\n\n* Indoor swimming pools, free admission.  \nhttps://www.toronto.ca/explore-enjoy/recreation/swimming/\n\n* Toronto History Museums, free admission.  \nhttps://www.toronto.ca/explore-enjoy/history-art-culture/museums/plan-your-museum-visit/\n\n* Self guided Discovery Tours, free.  \nhttps://www.toronto.ca/services-payments/streets-parking-transportation/sidewalk-tours-wayfinding/self-guided-tours/discovery-tours/\n\n* Day trip to Niagara Falls:  \nhttps://www.gotransit.com/en/partners-and-promotions/promo-visit-the-city-of-niagara-falls   \nwith Go train discounted tickets on weekends:   \nhttps://www.gotransit.com/en/partners-and-promotions/weekend-passes-with-go\n\n* Royal Ontario Museum (ROM), free admission to the main floor galleries, Jul 2 - Sep 3.  \nhttps://www.rom.on.ca/en/free-main-floor-2024\n\n* Toronto Reference Library, free admission.  A good place to take a break while downtown: main gallery on the ground floor, free wifi, a cafe, and public washrooms on all floors.  \nhttps://www.torontopubliclibrary.ca/programs-and-classes/exhibits/trl-exhibits.jsp\n\n* Tommy Thompson Park (the \"Leslie Spit\"), free admission.  Man-made peninsula with wildlife and views of the Toronto islands and downtown cityscape.  \nhttps://tommythompsonpark.ca/  \n\n* Evergreen Brickworks, free admission.  A ravine park in the city maintained by a non-profit organization dedicated to sustainability.  \nhttps://www.evergreen.ca/evergreen-brick-works/  \n\n* Don River Valley Park, free admission.  Walk, or rent a bike and cycle the trail, from [Edwards Gardens](https://torontobotanicalgarden.ca/get-gardening/public-gardens/edwards-gardens/) in the north, to the [Martin Goodman Trail](https://www.toronto.ca/home/311-toronto-at-your-service/find-service-information/article/?kb=kA06g000001cvpaCAA) along the beaches of Lake Ontario in the south.  \nhttps://donrivervalleypark.ca/ \n\n**some Tuesdays**\n\n* Royal Ontario Museum (ROM), third Tuesday each month, free admission 4:30 - 8:30 pm.  \nhttps://www.rom.on.ca/en/third-tuesday-nights-free\n\n**Wednesdays**\n\n* Aga Khan Museum. Free admission 4:00 - 8:00 pm.   \nhttps://agakhanmuseum.org/visit/tickets-hours.html\n\n* Gardiner Museum. Free admission 4:00 - 9:00 pm.   \nhttps://www.gardinermuseum.on.ca/visit/hours-admission/\n\n**some Wednesdays**\n\n* Art Gallery of Ontario (AGO), first Wednesday of each month, free admission 6:00 - 9:00 pm.  \nhttps://ago.ca/visit\n\n**Wednesdays - Sundays**\n\n* The Power Plant Art Gallery. Free admission, Wed-Sun 11:00 am - 6:00 pm.  \nhttps://www.thepowerplant.org/visit\n\n**Fridays**\n\n* Museum of Contemporary Art (MOCA). Free admission, 5:00 - 9:00 pm.  \nhttps://moca.ca/free-friday-nights/\n\n**Sundays**\n\n* Bata Shoe Museum. Free admission, 12:00 - 5:00 pm.   \nhttps://batashoemuseum.ca/visit-us/\n\n**Other lists of events**\n\n* For some attractions like Toronto Zoo, Ripley's Aquarium, Ontario Science Centre, and more, Toronto Public Library card holders can request a free pass, subject to availability.   \nhttps://www.torontopubliclibrary.ca/map/\n\n* Toronto Outdoor Picture Show, free movies in public parks during the summer.  Various dates and locations.    \nhttps://www.topictureshow.com/\n\n* A list of farmers markets, some are year-round but it is an old list, so be sure to click on the market name to see if it is open.   \nhttps://www.blogto.com/eat_drink/2014/06/farmers_markets_in_toronto_by_day_of_the_week/\n\n* Arts in the Parks, a list of free events taking place in local parks in the summer.    \nhttps://artsintheparksto.org/events/\n\n* City of Toronto Festivals & Events Calendar:  \nhttps://www.toronto.ca/explore-enjoy/festivals-events/festivals-events-calendar/\n\n* BlogTO events.   \nhttps://www.blogto.com/events/\n\n* TodoToronto events.   \nhttps://www.todotoronto.com/\n\n* Presto discounts for various attractions, shows, restaurants, etc.   \nhttps://www.prestocard.ca/en/about/presto-perks",
            "**Fri Jun 21**\n\nIndigenous Day Celebration @ Harbourfront Centre.  Free admission.  \nhttps://ncct.on.ca/indigenous-day-june-21st-2023/",
            "**Fri Jun 21 - Sun Jun 23**\n\nPLAY Taiwan Music & Food Fest @ Mel Lastman Square.  Free admission.  \nhttps://www.playfest.ca/",
            "**Fri Jun 21 - Sun Jun 23**\n\nPhilippine Legacy and Cultural Awareness (PLACA) presents: All For One Multicultural Festival @ Woodside Square.  Free admission.  The schedule says there will be fireworks.  \nhttps://allforonefest.ca/",
            "June 21-30  \nToronto Jazz Festival  \nhttps://torontojazz.com/2024-schedule/  \nIncludes two free stages in the Yorkville area as well as ticketed shows",
            "My friend and I started a film club in Toronto this summer called Final Girls Film Club! Our first screening is next thursday (june 27) at Cinecyle. Check us out on insta @finalgirlsfilmclub tickets are $5 at the link in the bio. Our goal is to bring together film lovers and celebrate women in horror/film. Doors open at 6 for mingling and screening is at 7:30 - BODIES BODIES BODIES is the first one. \n\nThe next two screenings are July 25 & August 22. Screenings TBA. \n\n🩸🩸🩸"
        ]
    },
    "Notable increase of racism in the sub / Augmentation du racisme dans la communauté": {
        "title": "Notable increase of racism in the sub / Augmentation du racisme dans la communauté",
        "score": 337,
        "url": "https://www.reddit.com/r/toronto/comments/1cgqvms/notable_increase_of_racism_in_the_sub/",
        "content": "Hello everyone,\n\nThe mod team has noticed a marked increase in racism and intolerance, in particular towards immigrants from India. Reddit has noticed as well and has begun removing such posts and/or comments.\n\nIt’s pretty clear that one side of the political spectrum has found their wedge issue and they are pushing it as hard as they can, stirring up hatred however they can and blaming immigrants for everything from jaywalking to the housing crisis despite the fact that many of the issues are worldwide. Facts and reality don’t matter, only blaming \"brown people\" and those they perceive as being responsible for those \"terrible\" people being here.\n\nTherefore, we would like to remind all of our users that the [Reddit sitewide rules](https://www.redditinc.com/policies/content-policy) apply here and will be enforced.\n\n**You ALL AGREED to these rules when you created your account.**\n\nYour “opinion” is irrelevant, it’s doesn’t matter if you really, really believe it, you cannot push your unfounded racist positions here.\n\n**Again, for the people in the back, being able to use Reddit is conditional to respecting these rules.**\n\nIn particular:\n\n>**Rule 1**  \n>  \n>Remember the human. Reddit is a place for creating community and belonging, not for attacking marginalized or vulnerable groups of people. Everyone has a right to use Reddit free of harassment, bullying, and threats of violence. Communities and users that incite violence or that promote hate based on identity or vulnerability will be banned.\n\nThe important parts are:\n\n**users that incite violence or that promote hate based on identity or vulnerability will be banned**\n\n[Marginalized or vulnerable groups include, but are not limited to, groups based on:](https://support.reddithelp.com/hc/en-us/articles/360045715951)\n\n* their actual and perceived race\n* colour\n* religion\n* national origin\n* ethnicity\n* **IMMIGRATION STATUS**\n* etc\n\nWhile the rule on hate protects such groups, it does not protect those who promote attacks of hate or who try to hide their hate in bad faith claims of discrimination (E.G. “I’m just stating my opinion” or “I’m just stating fact”).\n\nAnother important portion is:\n\n**free of harassment, bullying, and threats of violence**\n\nThat includes all of our users and the moderator team. Insults, derogatory comments and attacks will not be tolerated. If you post comments or message the moderators with insults and/or attacks, you WILL be banned on the spot.\n\nTherefore, going forward, we are going to clamp down hard on posts or comments attributing, without damn good evidence, the cause of any issue to immigrants or a subset thereof. That includes any reference to area with high immigration (e.g. Brampton) or any other form of dog whistles. It also includes attributing to an ethnic group of people the crimes or faults of an individual (e.g. the guy who proposed using food banks to save money). Message to the bigots: you’re nowhere as subtle as you think you are.\n\nAnd before any complaints bring it up: [No, your right to free speech nor freedom of expression has not been violated](https://xkcd.com/1357/).  \n\n---  \n\nBonjour à tous, L'équipe des modérateurs a remarqué une augmentation marquée du racisme et de l’intolérance, en particulier envers les immigrants venant de l’Inde. Les administrateurs de Reddit ont aussi remarqué et ont commencé à supprimer les publications et les commentaires de ce genre.\n\nC’est assez clair qu’un côté du spectre politique a trouvé son sujet pour diviser les gens et ils le poussent autant qu’ils le peuvent en créant de la division et la haine autant que possible en blâmant les immigrants pour tout et rien même quand le problème attribué est mondial. Les faits et la réalité sont sans importance, la seule chose qui compte c’est de blâmer les “bruns” et les personnes perçues comment étant responsable de la présence de cer derniers\n\nDonc, nous voulons rappeler à tous nos utilisateurs que les [règles à l'échelle du site Reddit](https://www.redditinc.com/policies/content-policy) s'appliquent ici aussi et seront appliquées.\n\n**Vous avez TOUS ACCEPTÉ ces règles lors de la création de votre compte.**\n\nVotre « opinion » est sans conséquence et ça ne fait rien si vous y croyez très très fort, vous ne pouvez pas pousser votre merde raciste ici.\n\n**Encore une fois, pour les personnes qui tardent à comprendre, l’utilisation de Reddit est conditionnelle aux respect de ces règles.**\n\nEn particulier:\n\n>**Règle 1**  \n>  \n>Souvenez-vous de l'humain. Reddit est un lieu destiné à créer une communauté et un sentiment d'appartenance, et non à attaquer des groupes de personnes marginalisés ou vulnérables. Tout le monde a le droit d’utiliser Reddit sans harcèlement, intimidation et menaces de violence. Les communautés et les utilisateurs qui incitent à la violence ou qui promeuvent la haine basée sur l'identité ou la vulnérabilité seront interdits.\n\nLes parties importantes sont :\n\n**les utilisateurs qui incitent à la violence ou qui promeuvent la haine basée sur leur identité ou leur vulnérabilité seront bannis**\n\n[Les groupes marginalisés ou vulnérables incluent, sans s'y limiter, les groupes basés sur :](https://support.reddithelp.com/hc/en-us/articles/360045715951)\n\n* leur race réelle et perçue\n* la couleur\n* la religion\n* l'origine nationale\n* l'appartenance ethnique\n* **STATUT D'IMMIGRATION**\n* etc\n\nMême si la règle sur la haine protège ces groupes, elle ne protège pas ceux qui promeuvent des attaques haineuses ou qui tentent de cacher leur haine en faisant état de discrimination de mauvaise foi.\n\n# Exemple : article décrivant une minorité raciale comme étant sous-humaine et inférieure à la majorité raciale. Indice : cela inclut la capacité de conduire.\n\nL’autre partie importante est : **sans harcèlement, intimidation et menaces de violence**\n\nCela inclut tous nos utilisateurs et l’équipe de modérations. Les insultes, commentaires désobligeants et les attaques ne seront pas tolérés. Si vous insultez ou attaquez les modérateurs via des commentaires ou des messages privés, vous serez bannis sur le champ.\n\nPar conséquent, à l’avenir, nous allons réprimer durement les publications ou les commentaires attribuant, sans preuves solides, la cause d’un problème aux immigrants ou à un sous-ensemble de ceux-ci. Cela inclut toute référence à une zone à forte immigration (par exemple Brampton) ou toute autre forme sous-entendus racistes. Ceci inclus aussi attribuer à un groupe ethnique les fautes d’un individus (Ex. la personne suggérant l’utilisation des banques alimentaires pour sauver de l’argent). Message aux racistes: vous n’êtes pas aussi subtil que vous le pensez.\n\nEt avant toute plainte, faites-le valoir : [Non, votre droit à la liberté d'expression n'a pas été violé](https://xkcd.com/1357/).",
        "num_comments": 0,
        "comments": []
    },
    "One last quick look at the Science Centre": {
        "title": "One last quick look at the Science Centre",
        "score": 1262,
        "url": "https://www.reddit.com/gallery/1dlklm1",
        "content": "",
        "num_comments": 199,
        "comments": [
            "So sad, its like a part of my childhood died 🥲",
            "Ford's legacy, I believe, is bulldozing things in Toronto, giveaways of protected land, highways, boondoggle transit projects and handshakes with greasy land developers.",
            "I have a feeling the science centre will be a hot spot for urban explorers in these next few months…",
            "Loved as a kid with the field trips.",
            "What happens to the employees?",
            "Unfortunately I couldn't get into the rest of the centre as it was a few minutes before closing. I really wanted to walk that interior bridge to the pod in the forest one more time.",
            "Ford is the ultimate POS. He's ruining Ontario. His I'm just a regular Joe schtick makes me hate him more than anything.",
            "People were actually duped into voting for Ford and he went on a rampage to destroy as much of Toronto as he could as fast as he could.\n\nShame what he and his cronies have gotten away with.",
            "VOTE FORD OUT.",
            "Went all the time as a kid and was lucky to have my high school graduation at the auditorium here"
        ]
    },
    "Ontario Science Centre has one last hard lesson to teach us all | If we let our most valuable assets to rot and crumble, guess what happens eventually": {
        "title": "Ontario Science Centre has one last hard lesson to teach us all | If we let our most valuable assets to rot and crumble, guess what happens eventually",
        "score": 129,
        "url": "https://www.thestar.com/opinion/star-columnists/ontario-science-centre-has-one-last-hard-lesson-to-teach-us-all/article_89e23d6c-2fec-11ef-b3e1-6f7edf7e32a2.html",
        "content": "",
        "num_comments": 30,
        "comments": [
            "Some of the key takeaways from this OpEd:\n\n>I remember romping through Raymond Moriyama’s modernist concrete halls and lanes, gazing through windows (dotted with bird silhouettes) at the majesty of the ravine, and wandering into the maze of fascinating and fun exhibits where you could happily lose hours to learning.  \n>  \n>Many of us will recall it as the best kind of “educational experience” — the kind that provides large dollops of sugar to help the medicine go down. The kind that feels more like a trip to the fair or a giant playground. The kind you might prefer to a trip to the playground.  \n>  \n>...  \n>  \n>And now, suddenly, it’s shuttered because no one, in successive governments from different parties, gave enough of a crap to maintain the place.  \n>  \n>There was a plan to shut it down anyway, of course — for the same reason but on a longer schedule — that will move it to much smaller digs at Ontario Place. Of course, that site is itself another example of the same phenomenon. Ontario Place, the former public theme park, opened in roughly the same era as the Science Centre, to similar fanfare as a proud asset the provincial government could provide for its citizens. Then left to stagnate and eventually shuttered, and allowed to rot in place until there’s little choice but to move on and try to start something else from scratch.  \n>  \n>That one too, was a repository of nostalgia, where childhood memories (and the possibility of creating more for a new generation) have been discarded on the great scrap heap of parsimony.  \n>  \n>There are other, arguably more important areas where the same dubious strategy is paying the same dubious dividends. Canadians were long prouder of our health-care system than of almost anything, and yet we have let it deteriorate. Our schools are, one trustee said this week, “managing decline.” Our transit system has seen one entire rapid transit line lost to a neglect-caused derailment, and this week another, larger one, was forecast as a possibility unless the federal government steps up with dollars in a hurry.  \n>  \n>Piece by piece, place by place, we see the cost of trying to save money in the short term by not taking care of our stuff over the long term.\n>\n>...\n>\n>As I said before, most of the lessons we all learned at the Science Centre in our childhoods were effortless, and joyful. This lesson, the kind we should have internalized in childhood, about what happens to things if you don’t take care of them properly, is stunningly different. \n\nThis is a critical point. We see so much evidence of this neglect of our civic and cultural institutions and structures. There's always a choice when decisions need to be made about what to spend on new things and what to spend on maintenance. The first is sexy and gets media attention and politicians and organizations love it for that reason. The second gets no such attention, and frankly we've done a terrible job explaining to the public why this is in many ways more critical: If you don't take care of what you have, you will lose it.",
            "Honestly this has really hammered home for me to never vote conservative. Thank you Doug for preventing me from making the mistake of voting for Pierre.",
            "Doug Ford will find a way to fuck things up for everyone",
            "Science crumbles under Conservative crack dealers \"fiscally responsible\" leadership",
            "905’ers don’t care and will vote for Doug regardless. Fucking scum.",
            "Depressing article.  \nFond memories of elementary / HS trips.  Some of the oldschool Toronto rave groups even threw a few good parties there back in the 90s.",
            "Completely and utterly diabolical for Doug Ford to allow the Science Centre to fall into disrepair these last thirty years.",
            "Letting it fall apart was a choice.",
            "And guess why? If the government wants the land, they'll get the land. It is amusing that the public naively thought they'd be able to save OSC. It was condemned the moment the original proposal to tear it down was published.",
            "There’s no “we” here. It’s elected officials."
        ]
    },
    "This person REALLY doesn't want their SUV stolen": {
        "title": "This person REALLY doesn't want their SUV stolen",
        "score": 579,
        "url": "https://i.redd.it/160eqcsnh18d1.jpeg",
        "content": "",
        "num_comments": 166,
        "comments": [
            "I went to visit my parents today and I saw this just down the street. This is next level for a house in North York, lol.",
            "Or he doesn't want it to be stolen again and again and again...",
            "It's come down to this.",
            "i heard you can buy these at costco now",
            "I mean who wants their car stolen?",
            "My car got stolen when I was work once. It never resolved and cost me a ton of money to get another car.",
            "I know this guy wakes up early",
            "They prob learned it the hard way. I don’t blame them, it’s such a headache to wake up to in the morning and deal with a stolen vehicle. \n\nIt’s sad that it’s getting this bad and the justice system isn’t being more harsh towards crimes like this.",
            "Can't blame them. Ours got stolen last summer and it was such a hassle. Car seats, stroller etc all inside and a summer full of plans for the kids that we no longer had a car to get to.",
            "Some insurance companies will offer discounted premiums provided you have theft deterrent systems in place, especially of models that are more frequently stolen - the CRV being one of them."
        ]
    }
}