{
    "[Cunningham] League sources confirm that the Sacramento Kings have agreed to trade Sasha Vezenkov, Davion Mitchell, the 45th pick in today’s second round draft and Portland’s 2025 second round pick to Toronto for 6’9” forward Jalen McDaniels.": {
        "title": "[Cunningham] League sources confirm that the Sacramento Kings have agreed to trade Sasha Vezenkov, Davion Mitchell, the 45th pick in today’s second round draft and Portland’s 2025 second round pick to Toronto for 6’9” forward Jalen McDaniels.",
        "score": 255,
        "url": "https://x.com/seancunningham/status/1806417506233696414?s=46&t=sbk6yuyliVaFRQjBUBJCMQ",
        "content": "",
        "num_comments": 147,
        "comments": [
            "HOW DOES THIS KEEP GETTING BETTER\n\nPOR 2025 SRP will likely be a SRP in the 30s, and we already didnt have a SRP in 2025 so thats really nice",
            "#2 seconds\n\nThere's no way Raps are only sending the wrong McDaniels brother.",
            "All this for McDaniels and the trade exception for Siakam\n\nAmazing",
            "Wait we got another 2nd round pick LOL At first I thought just Davion and Sasha were good but then Woj twitted again and we got the 45th pick too and I thought that was a totally fleece. Getting another 2nd rounder is just a masterclass. Kings GM must be mistaken Jalen McDaniels for Jaden McDaniels cause this move doesn't make any sense",
            "At this point, I think the Sacramento FO had a mix-up and think they're getting **Jaden** McDaniels, because this is a huge over-pay for Jalen. If so, they're going to be in for a surprise come training camp.",
            "ANOTHER PICK?! The Trailblazers second round pick could be in the 30s which could be great for the 2025 draft.",
            "god damn what a return for McDonalds",
            "this is an awesome trade for us, even if Davion Mitchell struggled a bit hes still serviceable and a good project to work on, I thought we were gonna be lucky to get a 2nd round for Jalen, but we got all this??? Masai worked his magic",
            "Wait, we got a 2025 2nd as well? That has got to be one of the biggest fleece jobs Masai and Bobby have ever pulled off! They're back!!!",
            "Remember when we were all screaming to waive him  and now the   tank commander fetched us this"
        ]
    },
    "Shams Charania (@ShamsCharania) on X - Immanuel Quickley intends to sign a five-year, $175 million deal to return to the Toronto Raptors, league source tells @TheAthletic @Stadium.": {
        "title": "Shams Charania (@ShamsCharania) on X - Immanuel Quickley intends to sign a five-year, $175 million deal to return to the Toronto Raptors, league source tells @TheAthletic @Stadium.",
        "score": 776,
        "url": "https://x.com/shamscharania/status/1806683144898126088?s=46",
        "content": "",
        "num_comments": 222,
        "comments": [
            "Scottie, RJ, Quickley locked up long-term. Now we go.",
            "Quick for 5 years?  LETS GOO!\n\n![gif](giphy|BVOTjEdZD7czDYCm8l|downsized)",
            "JaBBQDick locked up long term",
            "That number is going to pop for some, but remember the cap is exploding over the next years. This is starter money. A good deal for IQ and for the Raptors..",
            "Mans got paid! God damn! $35 mill per year!",
            "My guess is that it's closer to 150 with incentives",
            "$35m is the new $25m",
            "yeah I think GTJ is out",
            "That's more than I was expecting, but glad he's locked up long term.",
            "Damn he got paid but locked in for 5 years"
        ]
    },
    "[Harpidis] Sasha Vezenkov has reportedly decided to return to Europe by signing a multiyear deal with Olympiacos, according to @Sportando.": {
        "title": "[Harpidis] Sasha Vezenkov has reportedly decided to return to Europe by signing a multiyear deal with Olympiacos, according to @Sportando.",
        "score": 90,
        "url": "https://x.com/chrisalucard/status/1807026478464250148?t=Jd9xWM1vJ2MI_BywTwJYuQ&s=19",
        "content": "",
        "num_comments": 63,
        "comments": [
            "Was hoping he would stay, but I guess they must have known he was probably leaving. Can anyone weigh in on the cap implications of this?",
            "That's too bad. I was excited to see him get a chance.",
            "Well there goes our championship hopes",
            "I guess he thought he wouldn't get enough minutes here and wants to play a lot of basketball while he's in his prime. I thought the situation with the Raptors would have been perfect for him but now it just opens up a spot for other guys to get more minutes which is the good thing.\n\nRaptors 4/5 right now is Barnes (even though he can play the 2/3 as well), Poeltl, Olynyk, Mogbo, Chomche (who will be on the 905 basically all year) and Boucher (who won't see many minutes). Either Mogbo is going to get giant opportunities right away as the backup 4 or the Raptors are going to sign someone.",
            "Bummer. Dude could of been a good shooting pf for us",
            "He could have given us a chance. he'd have gotten the minutes.\n\nnow we need to find a FA for our backup PF spot",
            "Anyone smarter than me know if Patrick Williams is attainable at the full MLE or Bulls likely to retain? It would be him or Jalen Smith for me",
            "Nobody has really reported on this yet so I wouldnt jump the gun.",
            "Something something higher ambitions ",
            "Who the fook is this guy?"
        ]
    },
    "[Grange] So, according to those in position to know, reports that Sasha Vezenkov is leaving NBA to play in Greece are … not true. The former King has 1yr left on his NBA deal, Raptors control his rights, & have no intention of waiving him & expect to have him in training camp. Carry on.": {
        "title": "[Grange] So, according to those in position to know, reports that Sasha Vezenkov is leaving NBA to play in Greece are … not true. The former King has 1yr left on his NBA deal, Raptors control his rights, & have no intention of waiving him & expect to have him in training camp. Carry on.",
        "score": 40,
        "url": "https://x.com/michaelgrange/status/1807063822110281921?t=LnhrL7rP32f51RATcbqPzA&s=19",
        "content": "",
        "num_comments": 9,
        "comments": [
            "Good I think he could have a role here tbh he can easily eat off of drive and kicks and off ball screens from jak or kelly",
            "I honestly would have kinda been surprised that Darko wouldnt have been able to talk him into atleast trying to play.",
            "Well then. That ends the discussions this morning lol",
            "Sasha and Darko injecting the EU culture into the young squad",
            "hope he stays, I really want to see him play for the raptors",
            "I am going choose to trust this over the other reports. Just doesnt make sense for him to go back. He is on a new team that desperately needs size and shooting. \n\nGot the euro connection with Drako as well though I doubt how much that matters.",
            "Also they both Vezenkov and Darko were panel speakers at a coaches conference last week and were super buddy buddy so wouldnt be surprised if Darko convinced him otherwise.\n\nI think hell be a great mentor and helps embolden the pass first system.",
            "Im confused now",
            "that's a relief"
        ]
    },
    "The new kids are in town 🤞": {
        "title": "The new kids are in town 🤞",
        "score": 214,
        "url": "https://www.reddit.com/gallery/1dr122p",
        "content": "",
        "num_comments": 24,
        "comments": [
            "Last time we picked up 2 players with these exact numbers we won a chip just sayin",
            " New Kawhi and Danny Green lol",
            "Are we getting new jerseys or what?",
            "Kings trade came in clutch ",
            "Dick Walter, Waldick, Dickba, Mogdick, . ",
            "Cant wait for the rest of our rookies to come in",
            "Ja'Kobe and Jordan in the locker room, let's goooo!",
            "As a soccer fan i wish players could still use #10, its such a sexy number.",
            "Dont want to see those jerseys",
            "You bastard Im all in already"
        ]
    }
}