{
    "LAST UPDATE: r/TOUHOU MOD APPLICATIONS ARE NOW CLOSING ON JUNE 30TH 7AM UTC": {
        "title": "LAST UPDATE: r/TOUHOU MOD APPLICATIONS ARE NOW CLOSING ON JUNE 30TH 7AM UTC",
        "score": 2,
        "url": "https://www.reddit.com/r/touhou/comments/1dmgd15/last_update_rtouhou_mod_applications_are_now/",
        "content": "Thank you to everyone who's submitted an application so far! If you have or just now been thinking of applying to become a mod, we're giving you 1 final week to send one in.\n\nAfter this week, we'll be looking over the candidates and announce the new mods shortly.\n\n[r/Touhou moderator application form](https://docs.google.com/forms/d/e/1FAIpQLSdLkBAqwBCZ-ilrPoEBXnhF3mQ1k-dSA99r1yt_sNIZm6getQ/viewform)",
        "num_comments": 1,
        "comments": [
            "View in your timezone:  \n[JUNE 30TH 7AM UTC][0]  \n\n[0]: https://timee.io/20240630T0700?tl=LAST%20UPDATE%3A%20r%2FTOUHOU%20MOD%20APPLICATIONS%20ARE%20NOW%20CLOSING%20ON%20JUNE%2030TH%207AM%20UTC"
        ]
    },
    "Weekly Threads and News for June 2024": {
        "title": "Weekly Threads and News for June 2024",
        "score": 13,
        "url": "https://www.reddit.com/r/touhou/comments/1d5vnzb/weekly_threads_and_news_for_june_2024/",
        "content": "[Last month's threads](https://redd.it/1chehrg)\n\n[Where to get started with Touhou](https://redd.it/yt87b4)\n\nPing me for megathread-worthy posts.\n\n---\n\n**Community News**\n\n* [**r/Touhou Moderation Update**](https://redd.it/1cvi78s)\n\n* [r/TOUHOU MOD APPLICATIONS ARE NOW OPEN (CLOSING JUNE 13TH 00:00 AM UTC)](https://redd.it/1d3qlb3)\n\n* [PRIDE MONTH BANNER CONTEST WINNER ANNOUNCEMENT](https://redd.it/1d4gx2g)\n\n**Official News**\n\n* TBA\n\n**Other News**\n\n* TBA\n\n**Weekly Fanworks & Translations**\n\n* [Touhou Chireikiden - Cheating Detective Satori Chapter 35 by Akimaki Yuu](https://redd.it/1d2dybk)\n\n* [Lotus Eaters Ch. 53: To Wait for Good Fortune Is to Wait for a Drink (Part 1), translated by Gakugaku-blog](https://redd.it/1d4q3o9)\n\n* [Touhou Chireikiden - Cheating Detective Satori Chapter 36 by Akimaki Yuu](https://redd.it/1do5aom)\n\n**Weekly Random Discussion**\n\n* [The Weekly Random Discussion Thread ~ Week 517](https://redd.it/1d5m0wr)\n\n* [The Weekly Random Discussion Thread ~ Week 518](https://redd.it/1db0mba)\n\n* [The Weekly Random Discussion Thread ~ Week 519](https://redd.it/1dgfq2x)\n\n* [The Weekly Random Discussion Thread ~ Week 520](https://redd.it/1dm3pr9)",
        "num_comments": 3,
        "comments": [
            "whats the relevance of the number 710 in touhou? in a rhythm game theres a special award if you clear knight of nights 710 times",
            "View in your timezone:  \n[JUNE 13TH 00:00 AM UTC][0]  \n\n[0]: https://timee.io/20240613T0000?tl=Weekly%20Threads%20and%20News%20for%20June%202024"
        ]
    },
    "Do you prefer Meira with her hair down or with her default ponytail?": {
        "title": "Do you prefer Meira with her hair down or with her default ponytail?",
        "score": 238,
        "url": "https://www.reddit.com/gallery/1dr77s3",
        "content": "",
        "num_comments": 29,
        "comments": [
            "Hair down makes her look more like a princess or a priestess. Ponytail samurai lady for the win.\n\nGreat art btw.",
            "I prefer Sukusuku.\n\nCan't stand how squishy it looks!",
            "....\n\nI might be st00pid, but who's her?",
            "Honestly? Ponytail looks too good on her to say no!",
            "Both, both hair styles look great on her.",
            "The default ponytail makes her more motivated to fight",
            "Hair down. She looks beautiful~",
            "I'm down for both. Now I really see how why reimu fallen in love with her",
            "Long hair doesn't look like Meira, but is hotter.",
            "Oh my god, now I see why Reimu wanted to marry her. (Kind of true)"
        ]
    },
    "Hmmm... Very fumo": {
        "title": "Hmmm... Very fumo",
        "score": 326,
        "url": "https://i.redd.it/jb8jhi30bg9d1.jpeg",
        "content": "",
        "num_comments": 26,
        "comments": [
            "Why is it Alice(or Rumia)?",
            "The mode fumo is Rumia",
            "Why all of them converge on Alice 😭? It must be because she is a master doll.",
            "Through heaven and earth she is the only honored one.",
            "It's Alice but with Miko headphones.",
            "This is just Ash Blossom.",
            "so Alice with more Raiko-ish drip",
            "ive seen this before and everyone said this was yuuka or sumireko. Now people here are seeing alice. What a phenomenon.\n\nI see sagume though.",
            "Looks like Yukari without her hat.",
            "Composite fumo negs all other plushies"
        ]
    },
    "HAPPY 15TH ANNIVERSARY FROM KKHTA To commemorate it, the artists from KKHTA International Community bring you a Collab that is responsible for re-drawing and re-animating the opening of the web-comics ❤️\n": {
        "title": "HAPPY 15TH ANNIVERSARY FROM KKHTA To commemorate it, the artists from KKHTA International Community bring you a Collab that is responsible for re-drawing and re-animating the opening of the web-comics ❤️\n",
        "score": 205,
        "url": "https://v.redd.it/e0f6i3e8wg9d1",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Me when no fishing rod:",
            "Orin getting beheaded caught me off guard lmao",
            "Someone must remaster KKHTA into a less gruesome and more action-heavy storyline with bigger scale than before.\n\nThis is the changes I'd like to see in a KKHTA remaster:\n\n- Meiling actually puts up a good fight before getting her throat slit by Koishi\n\n- Lunarian invasion of Gensokyo feels bigger than what we were shown in the original. Instead of flying saucers ripping people apart, they send it battalions of moon rabbits to do the dirty work.\n\n- The \"staring at the moon makes you insane\" thing is tweaked a bit. Yuyuko tortures Youmu similar to what Sanae did to Kogasa. Also, Mokou fights back against the moonies (whilst dealing with the insanity), Team 9-ball survives, while Byakuren and the gang became a third party faction.\n\n- Much of the story will be between different perspectives (most of which will come from the Watatsukis, Yukari, and Koishi)\n\n- Ran and Chen would have C4 strapped to their backs instead of inside their bodies. Rei'sen is just using the two to force Yukari to surrender.\n\n- Flandre and Remilia's part of the story is extended.\n\n- The 3 vs 1 at the Hakurei shrine is altered but ends in the same result. However, instead of the infamous Reisen bisection scene, she gets decapitated instead. Remilia and Kanako puts up a good fight before dying. Marisa would also get an injured Reimu out of the fight against Yorihime.\n\n- Koakuma imprisoned Patchouli (and never assaulted her.)\n\n- With Gensokyo under full Lunarian occupation, Yukari organized a resistance movement to fight back.\n\n- In the flashbacks, the Lunarians didn't show up to Earth just to make them think that the true enemy is Gensokyo. Instead, the Lunar War happens, but Earth lost. Since Earth is under the influence of the moonies, Yukari had no choice but to nuke the entire planet to deny the Lunarians their victory. Also, those giant Buddha statues (called Vijokas), are the pinnacle of Lunarian engineering.\n\n- The final battle to stop the Moonlight Descent Ceremony is divided between several perspectives (ex. Junko, Yuyuko, Okuu, and more...)\n\n- The final battle involved some outside world allies as well, in the form of the Scottish Black Watch (because old gap hag decided to end the world Battletech style) and some of the world's space agencies.\n\n- The ending is bittersweet. Yukari launches the entire world's nuclear arsenal, halting the MDC, at the cost of much of human civilization. Most of the main cast survives, but without a home to return to, they decided to settle in Germany for the time being.\n\nWhat do you think?",
            "Oh no... not kkhta",
            "*Vietnam war flashbacks*",
            "Yeah babyyyyy",
            "##AHHH UGHHH AGHHHH",
            "2000s trauma",
            "It was funny lol",
            "[Youtube link](https://youtu.be/JewUPgE_J-M)"
        ]
    }
}