{
    "Join our Discord!": {
        "title": "Join our Discord!",
        "score": 44,
        "url": "https://discord.gg/CgxTTZnXAy",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Found a hidden feature on our trucks": {
        "title": "Found a hidden feature on our trucks",
        "score": 791,
        "url": "https://i.redd.it/85mcqmnc92yc1.jpeg",
        "content": "",
        "num_comments": 40,
        "comments": [
            "Man, I really wish this display was hackable like this.",
            "Don't get cheap on me Dodgson.",
            "Then when you pull up to a gas station Samuel L. comes on the screen and says “Hold on to your butts”",
            "Pin this",
            "Nicely done",
            "Thank you for your post!",
            "I bet that would fit perfectly in the square cup holder too!",
            "Everyone should steal this image and spam it in the comments of every MPG post.",
            "A truer thing has never been posted. Mods, make this a sticky please.",
            "Well if you drove intelligently (I have taken online IQ tests that say I'm in the 95th percentile) and just lie and say it's all uphill with stop lights and traffic, then you could easily get 26 mpg.\n\nThe trick is you have to be a virgin, be 37 years old, and believe that for some fuckin god forsaken reason, people give a shit about your ability to get good gas mileage, and then think it's a brag to post said gas mileage on a truck subreddit.\n\nIt takes a VERY HIGH IQ. You wouldn't get it."
        ]
    },
    "Praise the Sun! (Solar install)": {
        "title": "Praise the Sun! (Solar install)",
        "score": 149,
        "url": "https://www.reddit.com/gallery/1dqt2un",
        "content": "",
        "num_comments": 35,
        "comments": [
            "A few weeks ago I posted my seat delete and finally got around to installing the 200w solar panel I mentioned.\n\n  \nSetup:\n\n1. 16 busbar 200w BougieRV solar panel\n2. Victron MPPT smart solar converter\n3. Uptop overland Bravo Rack with hsome cheap solar panel mounts\n4. Various circuit protection devices\n\nIn brief testing, it'll be enough to power our computers, fridge, and then some",
            "+1 For the Dark Souls reference. At least I hope it is. 😂",
            "I’m a simple man. I see a DS reference, I upvote.",
            "Is there a way to route this into the cab via existing channels or did you have to drill through the rear of the cab?",
            "I've got the uptop overlander rack with 2x100watt Renogy glass panels with a Bluetti AC200L power station running an electric cooler running all the time, unbelievable amount of power on reserve in the power station for enough to survive the apocalypse. Best mod ever. Also deleted my rear seat. I 3d printed a panel to run the cables through the rear slider",
            "`\\~[T]/`\n\nIf only I could be so gloriously incandescent",
            "This is a rad setup! What kind of sleeping arrangement you workin with? I’m jealous of being able to run a fridge 🤤",
            "I love this",
            "Dark souls forever.",
            "Can I see a pic of your truck :) it looks nice but I want to take a step back and get a load of it in all it’s glory"
        ]
    },
    "New to me 2020": {
        "title": "New to me 2020",
        "score": 34,
        "url": "https://i.redd.it/5loxfc8pcf9d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Nice looking truck! I have a 21 OR Cement, but those MGM trucks always catch my eye, too.",
            "MGM gang 😎 I also have a 2020 🤙"
        ]
    },
    "Finally got to park next to some Tacoma homies! Happened at Costco of course.": {
        "title": "Finally got to park next to some Tacoma homies! Happened at Costco of course.",
        "score": 49,
        "url": "https://i.redd.it/pzc3sgi1ke9d1.jpeg",
        "content": "Mine is the white SR.",
        "num_comments": 7,
        "comments": [
            "Y'all back in at Costco? Are you just going in for a hot dog?",
            "The off-road guy is jealous of how much money we saved on our SR's.",
            "Tahomies.",
            "As is tradition",
            "Well, I was there for only one thing which turned into five things which is customary at Costco for me. I did end up leaving with a hotdog on the way out.",
            "They like keeping their tailgates",
            "I said Taco'mies in my head but I like yours."
        ]
    }
}