{
    "Join our Discord!": {
        "title": "Join our Discord!",
        "score": 41,
        "url": "https://discord.gg/CgxTTZnXAy",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Found a hidden feature on our trucks": {
        "title": "Found a hidden feature on our trucks",
        "score": 786,
        "url": "https://i.redd.it/85mcqmnc92yc1.jpeg",
        "content": "",
        "num_comments": 40,
        "comments": [
            "Man, I really wish this display was hackable like this.",
            "Don't get cheap on me Dodgson.",
            "Then when you pull up to a gas station Samuel L. comes on the screen and says Hold on to your butts",
            "Thank you for your post!",
            "I bet that would fit perfectly in the square cup holder too!",
            "Everyone should steal this image and spam it in the comments of every MPG post.",
            "A truer thing has never been posted. Mods, make this a sticky please.",
            "I wish the Newman feature unlock , my  is thirsty ",
            "dam tacomaworld is claiming treason , you belong here tho",
            "DODGSON - WE GOT DODGSON HERE"
        ]
    },
    "First Truck and Tacoma!": {
        "title": "First Truck and Tacoma!",
        "score": 41,
        "url": "https://www.reddit.com/gallery/1draskc",
        "content": "Really wanted a 24’ Sport in Bronze Oxide. Looked around in March and finally found one on order with all the add-ons and no dealer markup. Put in the order and it was delivered at the beginning of June. I’ve needed a truck for a long time, love this thing.\nRipping off the air dam and installing a tonneau today ",
        "num_comments": 13,
        "comments": [
            "Love the color! Nice choice/truck ",
            "Nice, love the wheels over the OR wheels. Are they 17 inch?",
            "What tonneau are you going with?",
            "Looks awesome! Thank you for picking that amazing colour and not white! \n\nGreat job",
            "Congrats man! Looks great! Once this whole cyber attack on dealerships is over I hope to take delivery of my bronze oxide as well :)",
            "That is a sweet colour. Very nice.",
            "Sweet pic up. Im planning on buying one next summer. Can you tell me the RPM at 100 MPH?",
            "Nice, I'm stalking a TRD OR in the Bronze Oxide that has been allocated to a dealer near me. Hoping we can come to terms on pricing.",
            "I was going to say the same. They look great.",
            "I think the sports get 18\" I wish the offroad had all black wheels"
        ]
    },
    "I got the ‘24 Tacoma TRD Pro": {
        "title": "I got the ‘24 Tacoma TRD Pro",
        "score": 75,
        "url": "https://i.redd.it/vvrkaypetf9d1.jpeg",
        "content": "Anyone know how to turn on the Rigid (white and yellow) light ? I think I’m missing the button lol",
        "num_comments": 25,
        "comments": [
            "Does the Pro have a locking gas door? My OR does not.",
            "If your asking how to turn the light bar on you need to have the high beams on for the light bar to light up",
            "Thats what all the blanks on my OR are supposed to be",
            "I legitimately thought this was a photo shopped 3rd gen control panel until I saw the digital dash",
            "I think I read that the light bar comes on when you turn your high beams on",
            "I recently got the sport. Can I pick up some of those aux switches for my own installs somewhere?",
            "Do the 2024 models come with safety sense 3.0? Like do they have the driving assist features like traffic jam assist?",
            "Slightly irritated I went down the rabbit hole of (not) finding this answer for you. You might be the second person on here with a pro and the literature online sucks as its so new. So I would exercise the manual in your glove box or the sales rep that you paid a lot of money to. I tried. Maybe a long press or just jack around with it to see what you come up with.",
            "Is the truck bed 3 1/2 or 4ft?",
            "Thanks for this. I tried turning mine on and the button just blocked. Figured it was due to something like this. I really should read my owners manual."
        ]
    },
    "Is this pan a big deal?": {
        "title": "Is this pan a big deal?",
        "score": 10,
        "url": "https://www.reddit.com/gallery/1dratcj",
        "content": "This pan came off and was located above the fat part of the muffler. 2016 Tacoma. Is this a big deal and what does it protect? Seems like it would be a cheap part but getting a new one and replacing it seems like it would be a pain based on its location. ",
        "num_comments": 7,
        "comments": [
            "It's a heat shield. You'll probably be ok without it, but it is there for a reason. If you go without, be careful re-entering the Earth's atmosphere.",
            "I had one come off on my Tacoma. Just buy some fender washers and you can put it back on without having to buy a new one.",
            "I remember one of this coming off my FJ six months after I bought it. I was so pissed.",
            "They all broke off my corolla I had. Nothing bad happened, just chocked it up to weight reduction.",
            "Anyone else have an older taco and all the heat guards are rusting off the bolts? So annoying. Like others have said, a wide washer or hose clamps work well to reattach them.",
            "Mexicos finest tequila  funnel",
            "This"
        ]
    }
}