{
    "Yet Another Reminder ": {
        "title": "Yet Another Reminder ",
        "score": 213,
        "url": "https://i.redd.it/104kevg6rk6d1.jpeg",
        "content": "Do *not* attempt to privately message moderators about subreddit matters. Use modmail only. ",
        "num_comments": 26,
        "comments": [
            "Happy pride month\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/traaaaaaannnnnnnnnns2) if you have any questions or concerns.*",
            "Wait people do that?!? God damn That's silly...",
            "Hey that's not a meme! I'm telling! /lh",
            "apartment complex? i find it quite simple",
            "Bird Flu? What about Trans? Do trans not fly?",
            "lol I remember as a mod I removed a post and the guy went and harassed the mod at the top of the modlist who was relatively inactive. Some reddit users don't understand the workings of this stuff",
            "🍳",
            "who are the silly bozos doing that?",
            "Yep. It's happened to me several times over, with different accounts each time. I'm not sure if it happens to the other mods or not.",
            "You do realise that I'm a mod, making a mod post to communicate with the subreddit?"
        ]
    },
    "It doesn’t feel fair to those that came before me": {
        "title": "It doesn’t feel fair to those that came before me",
        "score": 691,
        "url": "https://i.redd.it/c3jxezerze9d1.jpeg",
        "content": "I’ve read so many stories about trans people in the past (and even present fuck this world) and they all have had to fight tooth and nail to get anywhere. But so far, on my end, the internalised transphobia has been the only transphobia in my path. It doesn’t feel right. It makes me feel spoiled and I hate it. ",
        "num_comments": 67,
        "comments": [
            "Happy pride month\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/traaaaaaannnnnnnnnns2) if you have any questions or concerns.*",
            "Dudette, I feel this so much with my friends. Being actually accepted instead of either insulted, ignored or bullied still makes me feel guilty to some extent, or generally, I just feel like something's wrong.\n\nStill, it is of great value that therapists who are supportive are... well, existant. It is doubleplusgood that you have someone on your side, at the very least.",
            "It is fair!! it's what everyone fought for!! enjoy it and live your best life, it's not supposed to be hard!!!!",
            "Don’t feel upset about it! It makes us very very happy to see people like you succeed even when we can’t. So you doing so well is actually bringing us who are unfortunate hope, I can not tell you how glad it makes me when I see someone with only supportive people in their lives it makes me remember that there is hope and there are good people. And yes it is supposed to be that easy, you’re living the life our ancestors fought hard for. I know they’re looking down on you with so much love and such great joy that you’ve finally made it <3 much love sister! And I hope things keep going well for you!",
            "I know exactly what you’re talking about. But that’s what they fought for all these years, and we shouldn’t feel guilty about it.",
            "My girlfriend transitioned 10 years ago, Ive been on HRT for a year and am starting to socially transition. The differece in our experiences is insane. I feel so bad for the hell she went to and the relative ease of my experience. It breaks my heart.",
            "I really hope its far, far better for you now than what it was in 2008, when I came out and transitioned. I think it is.",
            "Also how are you everywhere",
            "https://preview.redd.it/zvx5rhrrqf9d1.jpeg?width=193&format=pjpg&auto=webp&s=f573ad9c18ae4f840728047a52f028a932a09f84\n\nSometimes it is that easy",
            "It's not supposed to be hard, just some dickwads who hate people for existing are fucking it up, be proud that you don't have to go through hate for being simply who you really are!"
        ]
    },
    "me if the worst of project 2025 comes to pass": {
        "title": "me if the worst of project 2025 comes to pass",
        "score": 767,
        "url": "https://i.redd.it/s4ritwc46e9d1.jpeg",
        "content": "",
        "num_comments": 58,
        "comments": [
            "Happy pride month\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/traaaaaaannnnnnnnnns2) if you have any questions or concerns.*",
            "I don't care what the government says, if I'm ready for top surgery, I'm GETTING my titties and they will be as BIG as I please",
            "if it happens I'm doing what my great grandparents did and fleeing the country.... just gotta figure out where to go",
            "Yeah if project 2025 passes I will protest the streets until I get shot or I change the government brick by brick until all laws are reversed. You’d be fucking stupid to think trans people won’t fight for their freedom in this country.",
            "For me I've got 2 plans.  Plan A is already in the works, making myself indispensable at my job and having a solid support base in a group that is used to helping people in legally difficult situations -my church does a lot with refugees.  Id definitely get a lot of help from my church because not only are they super helpful but Im also well established with them, like out and a member for 20 years established.  Plan B involves using said resources and emigrating to a friendly country like Canada or Germany.",
            "If it happens I’m fleeing the nation and (maybe) encouraging a US-EU war (in Minecraft)",
            "i am fucken praying that it doesn't get passed and lucky Trump killed his campaign (i think)",
            "Just remember that the good people far outnumber the bad people. If this does happen, we’re not going down without a fight\n\nBut dear fuck I hope it doesn’t come to that",
            "If shit happens, I'm fighting! I'm not going back. It's either I win and I keep getting to be happy, or I just end up where I would have gone if I followed through! \n\nAnd you better believe I am gonna fight like hell until I can't fight no more!",
            "If this happens I’m doomed. Being a minor fucking sucks"
        ]
    },
    "So i made another one, Is this better?": {
        "title": "So i made another one, Is this better?",
        "score": 1307,
        "url": "https://i.redd.it/oorpvdacoc9d1.jpeg",
        "content": "",
        "num_comments": 91,
        "comments": [
            "Happy pride month\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/traaaaaaannnnnnnnnns2) if you have any questions or concerns.*",
            "Master oogway is so cringe 💙💕🕊️💕💙",
            "Here People List:\n\n1. FairyPrincessLucy (Youtuber)\n2. Eskay (Youtuber)\n3. The Prettiest Platypus (Comics Artist)\n4. Nyxis (Comics Artist)\n5. Masteroogway (A Stupid Racist who said the N-words multiple times such as \"Uhh, Adolf Hitler is my N-\", Posting videos every 1 hour and even made fake Apology, Luckily he got Banned now.)\n6. Alice in Wonder1and (Youtuber)\n7. Nagi (Youtuber & Artist)\n8. TaeYai (Programmer and Youtuber)\n9. ICKY (Youtuber)",
            "Icky!! ❤️",
            "Is masteroogway trans?",
            "How about TheLexikitty? (She’s an awesome YouTuber)",
            "I didnt know one of my favorites overwatch creators was trans, Eskay is awesome :))",
            "Ugh I remember I liked a few of that guy's videos a long time ago wish I could just remove the likes 😭😭",
            "Funny that MasterOogway is on here since he's transphobic.",
            "We have too many people to include everyone but I kinda miss Brooke2valley here. There's so many I don't know."
        ]
    },
    "A fine addition to my gender envy collection!": {
        "title": "A fine addition to my gender envy collection!",
        "score": 529,
        "url": "https://i.redd.it/vy5vvxtsbd9d1.png",
        "content": "",
        "num_comments": 40,
        "comments": [
            "Happy pride month\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/traaaaaaannnnnnnnnns2) if you have any questions or concerns.*",
            "There's a couple pictures of her from the spring sale as well.\n\n\nAll hail the Steam Sale mascot!",
            "I thought this to like immediately.",
            "Another target struck by the steams sale girl",
            "At least I’m not the only one - I literally was thinking the same thing when I got my first card from the steam sale.",
            "Already set my profile to her set",
            "yes, I want to put it as my profil pic but still closeted and my dad can see it",
            "when i want to play the steam sale mascot game more than any of the steam sale games :'(",
            "Dysphoric minds think alike",
            "i wanna cosplay her so bad"
        ]
    }
}