{
    "2024 Trader Joe's Unionization Discussion Megathread": {
        "title": "2024 Trader Joe's Unionization Discussion Megathread",
        "score": 269,
        "url": "https://www.reddit.com/r/traderjoes/comments/1aep4d8/2024_trader_joes_unionization_discussion/",
        "content": "There has been some misunderstanding and/or or misinformation claiming that human moderators are intentionally censoring or deleting union posts on r/traderjoes, which is false. \n\nHuman Moderators are not and should not be expected to be online 24/7. Moderators often rely on AutoModerator (bot) to assist with various tasks. Posts that do not follow subreddit rules and/or are reported multiple times may be removed for varying reasons. When a post is repeatedly reported, AutoModerator will automatically remove that post as a precautionary measure.\n\nPrevious union related posts that were removed by AutoModerator preemptively will be reviewed and manually reinstated as long as subreddit rules were followed and they are not reposts.\n\nMoving forward, all future union discussions will be directed to this Megathread. This will help keep all unionization discussions and union updates organized. \n\nAs previously mentioned, we understand the importance of support for Crew Members and creating a space for union discussions but if you do not agree with somebody else's comment, please keep comments civil - this includes no name-calling and please do not vindictively report comments for \"Someone is considering suicide or serious self-harm\" inappropriately. \n\nArticles that have already been posted:\n\n01/26/24 - [Bloomberg: Trader Joe’s Follows SpaceX in Arguing US Labor Board Is Unconstitutiona](https://www.bloomberg.com/news/articles/2024-01-26/trader-joe-s-follows-spacex-in-arguing-nlrb-is-unconstitutional)l\n\n01/26/24 - [Huffington Post: Trader Joe’s Attorney Argues National Labor Relations Board Is ‘Unconstitutional’](https://www.huffpost.com/entry/trader-joes-attorney-nlrb-unconstitutional_n_65b41e7ae4b014b873b11cc2)\n\nOther recent articles:\n\n01/29/24 - [Trader Joe’s Wine Shop in NYC could reopen after grocer accused of union-busting](https://nypost.com/2024/01/29/business/nyc-trader-joes-wine-shop-could-reopen-after-union-busting-allegations/)",
        "num_comments": 164,
        "comments": [
            "I love Trader Joe's, and have always been happy with how they seem to be Pro-employee. But hearing about their lawyers seeking to bring down the National Labor Relations Board makes me wonder what is going on at corporate. I am angry Trader Joe's has aligned itself with the right wing anti-labor movement. I support Trader Joe's employees, and am glad most are happy in their jobs. But this move by TJ's lawyers feels like a shot across the bow.\n\n###",
            "I don’t think it’s right to have this single mega thread that’s hidden from view. The issue is also not just about unionization but protecting workers’ rights. The title minimizes the situation",
            "I am boycotting my favorite store. Fuck Trader Joes. Just read TJ is supporting a lawsuit against the NLRB, along with POS Elon Musk and Amazon.",
            "wow. This is disappointing to hear that Trader Joe’s is a part of the legal action to get rid of the NLRB. \nStill, maybe not surprising.\nYears ago I lived in South Pasadena and frequented Trader Joe’s all the time... had a shocker encounter with the boss at the time(1987) when he confronted two of his employees speaking, OMG, Spanish. Very loudly, he told them to not speak that language, and that they could get fired for it. I did not know that Trader Joe’s was an english only store.\nA bit of a shocker, because I loved Trader Joe’s, and thought it was a very welcoming, friendly and kind place.",
            "Hi mods, thank you for pinning this. \n\nWe're the AFL-CIO, America's largest federation of labor unions. TL;DR: **You have a legal right to organize**. Union-busting is a violation of the National Labor Relations Act. Trader Joe's current pattern of behavior doesn't just go against their mission statement of crafting a \"welcoming journey full of discovery and fun,\" they are part of a larger, terrifying pattern of businesses stopping at nothing to protect their bottom line. \n\nICYMI, Trader Joe's recently joined Elon Musk in arguing about constitutionality of the National Labor Relations Board. The NLRB is America's independent **federal** agency tasked with protecting workers' legal right to organize a union. This should scare everyone - it is an incredibly dangerous attempt to dismantle any regulatory oversight over business and labor relations. For more context, the members of Trader Joe's Unite won their union elections by filing through the NLRB, a longer, more tedious election process that happens after management refuses to recognize a union despite majority employee support. \n\nUnions aren't just about securing a contract with better wages, benefits, and job security. It's about having a seat at the table and secure, legal enforcement of whatever it is you choose to bargain into your union contract. As we like to say, \"A boss's promises are temporary, a union contract is in writing.\" And FWIW, union dues do not take effect until \\*after\\* the first contract is won. \n\nAs of right now, the union is not calling for an official boycott of the store. You can take action by sending a letter to TJ's management asking them to stop union-busting: [https://actionnetwork.org/forms/tell-trader-joes-stop-union-busting?referrer=group-traderjoesunited&source=group-traderjoesunited](https://actionnetwork.org/forms/tell-trader-joes-stop-union-busting?referrer=group-traderjoesunited&source=group-traderjoesunited)",
            "Has there been any evidence that the massive online horror and revulsion I have been seeing  is translating to the senior leadership team at TJs?\n\nLike are people there who are making decisions aware of how much this has ruined their brand?\n\nAnecdotally is anyone seeing a reduction in customers at stores? Is this an object of discussion internally? Is this something too dangerous to talk about?\n\nFor me and mine, unless TJ transitions to a worker owned co-op I am done there.",
            "I’m just got a reply back from an email I sent this afternoon.\n\nhttps://preview.redd.it/e7gvg18msznc1.png?width=1178&format=png&auto=webp&s=dcb0abd40f102f10282992c1a7a42bddf5e6e373",
            "Why is this thread in contest mode?\n\nWhy are all union posts forced to be here?\n\nWhy do we have a set of rules that the community doesn't like?",
            "I do not work at TJ's and am a frequent shopper. Below is a statement I sent to their \"feedback to my store\" [website](https://www.traderjoes.com/home/contact-us/local-tjs-feedback).\n\n>The recent comments made by Trader Joe's attorney Christopher Murphy at the NLRB meeting in Connecticut are disappointing. Because Trader Joe's does not believe in the constitutionality of the NLRB and the workers' right to unionize, I will no longer shop at your stores, including my local store in **INSERT STORE**. I am very discouraged this company's stance on workers' rights and I will be encouraging my friends and family to avoid your stores.\n\nI won't be shopping there anymore. I'm just one person, but I can't support them after this.",
            "Making this a megathread only topic (and putting the comments in contest mode) sure makes it seem like intentional censoring."
        ]
    },
    "PRODUCT SAFETY NOTIFICATION: Trader Joe’s Mango Tangerine Scented Candle (SKU# 56879) may have an unexpected burn pattern. The candle flame can spread from the wick to the wax causing a larger than expected flame, posing a safety risk. Return to any Trader Joe’s for a full refund.": {
        "title": "PRODUCT SAFETY NOTIFICATION: Trader Joe’s Mango Tangerine Scented Candle (SKU# 56879) may have an unexpected burn pattern. The candle flame can spread from the wick to the wax causing a larger than expected flame, posing a safety risk. Return to any Trader Joe’s for a full refund.",
        "score": 21,
        "url": "https://i.redd.it/lfx0d83x689d1.jpeg",
        "content": "Trader Joe's Mango Tangerine Scented Candle (SKU# 56879) may have an unexpected burn pattern. The candle flame can spread from the wick to the wax causing a larger than expected flame, posing a safety risk.\n\nIf you purchased the Mango Tangerine Scented Candle, please do not use it. We urge you to discard the product or return it to any Trader Joe's for a full refund.\n\nCustomers with questions may contact Trader Joe's Customer Relations at (626) 599-3817 or send us an email.\n\nhttps://www.traderjoes.com/home/contact-us/product-feedback",
        "num_comments": 3,
        "comments": [
            "Posts that don't follow r/traderjoes subreddit rules may be subject to removal. \n\nFriendly reminder that choosing descriptive post titles with exact product names mentioned yields better subreddit search results and helps our subreddit be more inclusive to those who use Screen Reader Software or Text-to-Speech apps. to access Reddit. Thank you.\n\nIF THIS MESSAGE DOES NOT APPLY TO YOUR POST, PLEASE IGNORE.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/traderjoes) if you have any questions or concerns.*",
            "I have a candle warmer lamp thing so I’m going to keep using mine. 😬",
            "Probably shouldn't have left my candle burning in my apartment while I ran errands last weekend 😕"
        ]
    },
    "PSA: The Vegan Thai Green Curry is amazing and I’m not even vegan": {
        "title": "PSA: The Vegan Thai Green Curry is amazing and I’m not even vegan",
        "score": 242,
        "url": "https://i.redd.it/h395bz3xue9d1.jpeg",
        "content": "",
        "num_comments": 53,
        "comments": [
            "Posts that don't follow r/traderjoes subreddit rules may be subject to removal. \n\nFriendly reminder that choosing descriptive post titles with exact product names mentioned yields better subreddit search results and helps our subreddit be more inclusive to those who use Screen Reader Software or Text-to-Speech apps. to access Reddit. Thank you.\n\nIF THIS MESSAGE DOES NOT APPLY TO YOUR POST, PLEASE IGNORE.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/traderjoes) if you have any questions or concerns.*",
            "I just wish they added more tofu sheets!",
            "You don’t have to be vegan to enjoy vegan food! 😉😉\nI think TJs does an amazing job with a lot of their vegan things.",
            "I always add my own veggies to this one. Brocolli or green beans!",
            "Yes! I love this curry. The sauce keeps exploding though in my microwave after the stir the sauce step, so I skipped that step last time.",
            "SHHH! The others will buy it!!!",
            "Grabbed one on a whim when I was there a couple days ago and totally agree! Microwaved it for a fast lunch today and was surprised at how good it was. Also not vegan, and don’t even play one on TV.",
            "It’s not gluten free by chance? My wife has celiac and always looking for new stuff.",
            "Yes, 100% agree, and also, not vegan.  It has some actual heat to it, the flavor is fairly legit. I like that it uses yuba instead of common firm tofu, so kinda interesting. I find it a bit low in the veggies, so I often add a little more of my own, but an easy option and beats a lot of thai takeout. Bonus points for garnishing with the TJ chile lime cashews.",
            "Yes! Wish they sold the sauce separately."
        ]
    },
    "dinner inspiration - sweet corn burrata ravioli ": {
        "title": "dinner inspiration - sweet corn burrata ravioli ",
        "score": 63,
        "url": "https://www.reddit.com/gallery/1dr1pne",
        "content": "burrata that i let sit in room temp water for 10 minutes, heirloom and basil salad, seasoned with salt pepper and a splash of balsamic, corn and burrata ravioli, topped with pesto, EVOO, and red pepper flakes, and the whole thing topped with more EVOO and balsamic glaze. i had some prosciutto on the side but it didn’t need it! ",
        "num_comments": 6,
        "comments": [
            "Posts that don't follow r/traderjoes subreddit rules may be subject to removal. \n\nFriendly reminder that choosing descriptive post titles with exact product names mentioned yields better subreddit search results and helps our subreddit be more inclusive to those who use Screen Reader Software or Text-to-Speech apps. to access Reddit. Thank you.\n\nIF THIS MESSAGE DOES NOT APPLY TO YOUR POST, PLEASE IGNORE.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/traderjoes) if you have any questions or concerns.*",
            "i was kidding myself with that half burrata ball.. i went back for the other half shortly after starting my meal",
            "Beautiful presentation! I need to remember this. Sounds so delicious.",
            "Thank you, making this in the coming days!",
            "And here I was admiring your restraint."
        ]
    },
    "the Cheesecake Kringle is back!": {
        "title": "the Cheesecake Kringle is back!",
        "score": 45,
        "url": "https://i.redd.it/zkwk8aivte9d1.jpeg",
        "content": "after 3 years (maybe 4?) the cheesecake Kringle is back wooo! definitely my favorite as the others are much too sweet for me ",
        "num_comments": 6,
        "comments": [
            "Oooh I’ll have to try and find this! The others are too sweet for me too but this sounds yum",
            "Omg it’s so good 🤤",
            "Oh my gosh, I wonder if they will set two aside for me if I call and they have it. I’ve got a 2 hour drive to my nearest Trader Joe’s lol.",
            "😳",
            "They had one with raspberries in it. Oh that was so delicious"
        ]
    }
}