{
    "Ladies and Gentlemen: My Wife": {
        "title": "Ladies and Gentlemen: My Wife",
        "score": 5347,
        "url": "https://i.redd.it/8kfj1z8vwd9d1.jpeg",
        "content": "Crisis averted, hopefully? 🤞 ",
        "num_comments": 835,
        "comments": [
            "So many possible baby names in LOTR and you go with Frodo? The obvious baby boy name would be Smeagol.",
            "\"Oh. That's on there?\"  this is so funny",
            "You countered a Tragedeigh with a dog name, its a slight improvement ig.",
            "Thats on there?\n\nOf course its on here! Anything ending in -eigh",
            "My wife had some truly terrible names. I probably did too. Thats the fun of it",
            "I dunno. Frodo does have a nice ring to it.",
            "I hope thats a joke because Frodo is god damn terrible. As a former kid, I absolutely would have made fun of any kid named Frodo.",
            "So if you name her Everleighand the next two kids are boys.would they be the  Everleigh Brothers?",
            "Its very entertaining to me how many commenters are taking this at face value and are concerned with the possibility of Frodo \n\nPersonally Id do Ayyohmer or Ayo-Win but Ive been accused of sympathies towards The Horse Girl community.",
            "Everleigh is fine. Everyone just hates on anything containing leigh because mostly Americans have overused it and stuck it on the end of everything including gibberish. \n\nEverleigh is a village in England thats existed for hundreds of years. I think its nice as a name."
        ]
    },
    "Is my friends new babies name a bit of a tradgedeigh or am I being to paranoid for the kid? ": {
        "title": "Is my friends new babies name a bit of a tradgedeigh or am I being to paranoid for the kid? ",
        "score": 144,
        "url": "https://www.reddit.com/r/tragedeigh/comments/1dr8e72/is_my_friends_new_babies_name_a_bit_of_a/",
        "content": "My mate and his wife have just had a baby boy .\n\nThey called him Quest. \n\nI admit I did have to look twice and now I can't help thinking it's a bit of a tradgedeigh but maybe I'm wrong? \n\nEither way he's never going to find his name on a keyring",
        "num_comments": 106,
        "comments": [
            "Is it short for Questopher?",
            "At least they didn't do something like Kwesst",
            "Not misspelled but an incredibly stupid name with which to burden a kid.",
            "Someone posted years ago on a riding forum that they wanted to call their new horse Quest because it had a mark a bit like a question mark. They changed their mind after having the absolute piss ripped out of them. If it's a bad name for a horse, it definitely should not be used for a human.",
            "Tragedy not tragedeigh. A tragedeigh would be Kwest not Quest.",
            "They could have used it as a middle name and first name Johnny.",
            "It isn't misspelled, so no, but it's still an odd choice. Corny, even. It seems like they're trying too hard to make him stand out. Let the kid's personality do the talking instead of the name.",
            "A tragedy but not a tragedeigh. Quest is a not a good name for a person ",
            "Not a tragedy per se but they're setting the kid up for a life time of bad jokes about all the games and movies and brand names and expressions with the word \"Quest\" in them",
            "Not a tradgedeigh, it's just plain tragedy."
        ]
    },
    "Is my son's name a tragedeigh?": {
        "title": "Is my son's name a tragedeigh?",
        "score": 398,
        "url": "https://www.reddit.com/r/tragedeigh/comments/1dr0518/is_my_sons_name_a_tragedeigh/",
        "content": "I named my first son Theodin. I know in the LOTR books it is spelled Theoden, but I thought it looked better with the 'in instead because it spells \"The Odin\", who as we all know is the king of asgard. So tell me, is it a tragedeigh?",
        "num_comments": 316,
        "comments": [
            "Is this our first Trajengard?",
            "Yes it is. And I am a LOTR fan.",
            "A portmanteau of Thoden King and Odin the Allfather? IDK man, its like a whole new category. Its better than combining Glorfindel and Hel into Glorfindhel I guess. The people who are big enough into LOTR to think Thoden is a cool name, will think Theodin is weird because of the spelling. Everyone else will just think its weird.",
            "CHILDREN ARE NOT BILLBOARDS FOR YOUR FANDOMS.",
            "I deliberately misspelled the name because I thought it looked better this way.\n\nI mean. Its not the worst tragedeigh today.",
            "What if I say 90% of the names in fantasy novels are tragedeigh?",
            "\"Who we all know is the king of Asgard\"\n\nYou give general population waaaaay too much credit",
            "Theoden is a cringe name for a kid either spelling tbh, but at least he has the very normal name option of Theo. Really not that bad in a practical sense.",
            "Only saving grace is at least he gets to go by Theo and pretend you never did that to him",
            "It sure is. Poor kid."
        ]
    },
    "Figured these would be appreciated here.": {
        "title": "Figured these would be appreciated here.",
        "score": 402,
        "url": "https://www.reddit.com/gallery/1dqvctb",
        "content": "",
        "num_comments": 15,
        "comments": [
            "My son's former pre k teacher's son is named Bentley. ",
            "Lets hope Bentley change his last name into Continental GT in the future",
            "I admit it took me way too long to realize that neveah was heaven backwards ",
            "Toss my salad Playset ",
            "That's awesome! For a sec I thought they were from \"obvious plant\"",
            "I live in the south. I've seen kids in my sons school with all three names... Okay several kids with all three and far worse. Heck parents here think those are boring and to common. ",
            "Thank you for your submission!\n\nThis is just a quick reminder to all members here: **Original content is always better!** Memes are okay every once in a while, but many get posted here way too often and quickly become stale. Some examples of these are Ptoughneigh, Klansmyn, Reighfyl & KVIIIlyn. These memes have been around for years and we don't want to see them anymore. If you do decide to post a meme, make sure to add the correct flair. Posting a random meme you found does **not** mean you found it \"in the wild\".\n\nThe same goes with lists of baby names, celebrity baby names, and screenshots of TikToks. If the original post already had a substantial amount of views, there is a 99% chance it has already been posted here. Try and stick to OC to keep our sub from being flooded with unoriginal content. Thank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tragedeigh) if you have any questions or concerns.*",
            "Hilarious!",
            "Asshole names ",
            ""
        ]
    },
    "I took my cat to the vet today and couldn't resist": {
        "title": "I took my cat to the vet today and couldn't resist",
        "score": 2016,
        "url": "https://i.redd.it/2jsm2ko8wa9d1.png",
        "content": "My teenager, a big fan of this group, is horrified.",
        "num_comments": 109,
        "comments": [
            "When its an animal I find it funny as hell. When its a person it horrifies me. I love this lol",
            "I like how your brain works",
            "At first I thought that this was implying that the genders are Female and Cat.",
            "Oooh. running off to change my doggo Ginny to Gyneigh   \n\nDont want Luna to feel left out.  Is Lloonah yoo-neek enough?",
            "The real question is: Frieslan or Vlaanderen? Also Kitteigh is too cute. Your teen needs to embrace pet-related tragedeighs.",
            "Awww ! Cat tragedeighs are the best ! I named one of mine 'Hawaiian roll' - great for a cat , horrendous for a kid .",
            "I saw a dog named \"Death by Chocolate Lab,\" and I've never been the same. Best name ever",
            "I read this in Cartmans voice lol",
            "Okay, this is going to be the name of my dog and cat will be Doggeigh. I did know someone who named their dog D.O.G. Dee-oh-gee",
            "Thanks for making me smile today! Hope the appointment went whelll"
        ]
    }
}