{
    "r/Trains Monthly Discussion & Questions Thread - May 2024": {
        "title": "r/Trains Monthly Discussion & Questions Thread - May 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/trains/comments/1d39fqh/rtrains_monthly_discussion_questions_thread_may/",
        "content": "Welcome to the r/Trains Monthly Discussion Thread.\n\nThe goal of this thread is to serve as the place to ask short questions or just chat about anything trains related that might not warrant its own post.",
        "num_comments": 12,
        "comments": [
            "hello! my boyfriend is a train enthusiast and id like to get him a railway map of europe (or many individual maps of each country). my idea is to get it printed big and nice but in such a way that he can color in the journeys he has taken. if someone sells something like this thats good, but if i have to just find maps and then have them printed myself that is also okay. maybe i can make a binder with each country map printed separately.  \nso i guess the question is: does anyone know very nice, rather minimalistic railway maps of european countries that I can buy, digitally or phisically? thank youuu",
            "Always been *kinda* into trains, but now that I'm getting into things like electronics and such, it's the *perfect* excuse to go crazy about train history, *especially* the designs. Already found things like the LNER Class A4 4468 Mallard and the [Chesapeake and Ohio No. 490](https://redd.it/17twlnr). What's some good reading material to go over the history/development of trains & train designs? \n\nI'm a Canuck from Montreal, so if there are some great books in French you weren't sure could be suggested, definitely send them my way! Not that I won't take the English books...",
            "Are (train-related) memes allowed in this thread?",
            "Are there any good train enthusiasts channels on YouTube? Basically like how there’s channels like MKBHD or LinusTechTips if you want to learn about tech. So looking for edutainment to learn more about trains",
            "I had to wait for a train today. saw these really weird cars on it.  not sure where to really ask and google wasn't working.\n\nit was l[ike an double decker flatbed of sorts.](https://images-wixmp-ed30a86b8c4ca887773594c2.wixmp.com/f/3c6255e9-ab08-4b2c-b281-aa170be184bf/dhlyt1i-2c482539-041b-4ddc-87cc-ffb81ec35e4a.png/v1/fit/w_612,h_360,q_70,strp/weird_train_car_by_scottahemi_dhlyt1i-375w-2x.jpg?token=eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJzdWIiOiJ1cm46YXBwOjdlMGQxODg5ODIyNjQzNzNhNWYwZDQxNWVhMGQyNmUwIiwiaXNzIjoidXJuOmFwcDo3ZTBkMTg4OTgyMjY0MzczYTVmMGQ0MTVlYTBkMjZlMCIsIm9iaiI6W1t7ImhlaWdodCI6Ijw9MzYwIiwicGF0aCI6IlwvZlwvM2M2MjU1ZTktYWIwOC00YjJjLWIyODEtYWExNzBiZTE4NGJmXC9kaGx5dDFpLTJjNDgyNTM5LTA0MWItNGRkYy04N2NjLWZmYjgxZWMzNWU0YS5wbmciLCJ3aWR0aCI6Ijw9NjEyIn1dXSwiYXVkIjpbInVybjpzZXJ2aWNlOmltYWdlLm9wZXJhdGlvbnMiXX0.blJln_jLkvDoGu2iU6XNE7gLn9QTyyXHtn8Wmtw5QEM) the top row had what I assumed where hand rails on it, and each car where pretty close to each other as opposed to the usual separation? there was like 30 of these going north to canada",
            "I'm a customer trying to track a shipment on a train. It left Kentucky on Norfolk Southern and destined here to Northern California. I have the number but Norfolk Southern requires an alphanumeric code and I don't have the alpha part. Am I tracking in the right place? How do I look up the alpha part? The shipper's system doesn't have it. Thanks",
            "Yo banner needs updated to show CPKC.",
            "A brief question. What are the fundamental limitations of pin mounting that make it so that one cannot pin the driving rods at the outer edge of the drive wheel.",
            "If i see a small crossing in the middle of nowhere, can i railfan there?",
            "Here are some technical maps from ARTC In Australia. Probably not what you're after but might be interested in them anyway. I work in the Hunter Valley corridor 🙂\n\nhttps://www.artc.com.au/customers/maps/system/"
        ]
    },
    "New subreddit icon competition! Read post for details!": {
        "title": "New subreddit icon competition! Read post for details!",
        "score": 10,
        "url": "https://i.redd.it/21z1legr6k8d1.jpeg",
        "content": "We are holding a competition to get a new subreddit and discord icon! A vote will be held on the 30th of June to decide the winner, and the new logo will be implemented on the 1st of July. Everyone is eligible to enter 3 designs, and they must be submitted through the [official r/trains discord server](https://discord.gg/y6gsT4m7), in the contest submissions channel. \n\nRules\n1: No photos of trains. We are looking for logos, not photographs.\n\n2: Logo must be easy to recognize in a small format, with or without text. \n\n3: Submissions must follow all subreddit and discord rules.\n\n4: Submissions must also be easy to recolor or edit for special events like pride month or historical events in railway history.\n\n5: Make it fun and eye catching! ",
        "num_comments": 0,
        "comments": []
    },
    "Railfanning from the dome car": {
        "title": "Railfanning from the dome car",
        "score": 174,
        "url": "https://i.redd.it/nf1471anhe9d1.jpeg",
        "content": "Also we’ve been following that stack train all day and it’s why we’re behind schedule.",
        "num_comments": 8,
        "comments": [
            "... how late are you? \n\nWatched Amtrak reports for a week before taking it . The route I took had routine 8 hour delays!  Just  my damn luck,  almost exactly on time.",
            "Ah The Canadian.  Truly the last of it's kind.",
            "its a great spot to do it..",
            "One of my favorite kinds of shots 😁",
            "What a cool and unique shot. My eye follows your train, then heads out to the stacks in the distance. Thanks for sharing",
            "Enjoying some of these pics posted just recently.  That's a beauty.",
            "Actually less behind than I thought. There must be a ton of padding in the schedule because we were following that train at 30 MPH for hours, but we just got to Edmonton only about 30 minutes late.",
            "There's a few places for refueling and resupply (water, food...)\n\nYou must have had a fabulous crew resupply the train in half the usual time. \n\nI was on the Empire Builder.. running 15 mph below normal speed because of high winds. (Superliners are TALL!)"
        ]
    },
    "A genuine caboose on the rails!": {
        "title": "A genuine caboose on the rails!",
        "score": 116,
        "url": "https://i.redd.it/9tck5qekze9d1.jpeg",
        "content": "",
        "num_comments": 9,
        "comments": [
            "You can see a BNSF version pretty much every day on the Trains.com New Rochelle IL webcam. An extra run happens to and from the UP yard and it typically has an old BN caboose as a shoving platform.",
            "That's a shoving platform,  not a \"real\" caboose.",
            "I love seeing them on the LIRR, they use them as work site offices as far as I am aware on the LIRR. Likely MNRR too but I don't take that as much as I would like to.",
            "Is this Milwaukee? I gotta see if there's a caboose in the yard there",
            "Looks like it has been seen regularly in Milwaukee since 2001. Another pic with SOO bandit 4510 http://www.rrpicturearchives.net/showPicture.aspx?id=5861380\n\nToo bad CP recently chopped up their last bandits. Yeah they were beyond worn out but there were people trying to save them.",
            "It be.  However this was a few days ago, but also not the first time I have see it go by.",
            "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^PathofTotality:\n\n*Is this Milwaukee?*\n\n*I gotta see if there's a*\n\n*Caboose in the yard there*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
            "I'll have to message some people in the area to see if anyone knows anything",
            "What an honor"
        ]
    },
    "Theyre the same 😅😶": {
        "title": "Theyre the same 😅😶",
        "score": 22,
        "url": "https://www.reddit.com/gallery/1dr54vj",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}