{
    "I love the siege megatron mold but this is getting ridiculous.": {
        "title": "I love the siege megatron mold but this is getting ridiculous.",
        "score": 279,
        "url": "https://i.redd.it/6ip0l0kwnf9d1.jpeg",
        "content": "I really enjoy the siege megatron mold but how many times do they expect us to buy it? Which really sucks because this Orion pax figure looks amazing\n",
        "num_comments": 82,
        "comments": [
            "11th siege megatron repaint, 12th figure",
            " it makes sense for this figure but it is funny that this mold has been reused so much but they pretty much never use the Earthrise retool.",
            "Hasbro: But w-what if he smeared lipstick on himself and draped all of his garden tools on himself?",
            "Genuinely love the Optimus here. Can't believe that it's stuck as a sdcc exclusive of all things, I need it so bad. Exclusives are awful. What a nice way to just say fuck anyone who can't go to san diego. Only people it benefits are scalpers. It's like hasbro is allergic to money.",
            "What do you want to bet the upcoming SS '86 movie Megatron will just be the Siege mold again?",
            "Hey now, some people still dont have it (It's me, im \"some people\")",
            "You know it's bad when one of the most popular characters of the franchise gets the \"Yeah, I'm good...\" treatment.",
            "Optimus having his gun plugged into a wall outlet is pretty funny",
            "Yeah, I'm honestly skipping it. I'm not a fan of gamer edition prime and siege Megatron is outdated now. My next Megatron will be studio series 86.",
            "I really want an affordable and actually available repaint/mold of earthrise. Without the dumb weaponstaff. And not yellowing."
        ]
    },
    "What exactly was this? Were they just weirded out by the camaraderie they showed?": {
        "title": "What exactly was this? Were they just weirded out by the camaraderie they showed?",
        "score": 51,
        "url": "https://v.redd.it/0tb9fft9ai9d1",
        "content": "",
        "num_comments": 7,
        "comments": [
            "No, they were weirded out because knockout just flirted with him",
            "I think they were a little weirded out by that.",
            "Say gex",
            "Roommates",
            "gex"
        ]
    },
    "What is that figure you like but it has its flaws? Heres mine,": {
        "title": "What is that figure you like but it has its flaws? Heres mine,",
        "score": 89,
        "url": "https://www.reddit.com/gallery/1dr733i",
        "content": "The figure is actually good in terms on how it looks... but that's literally like it's only pro, it's flaws has so many flaws, all of their limbs pop off so easily and anything that moves pops off way too easily, wish it didn't end up like this but it did....",
        "num_comments": 43,
        "comments": [
            "MP-11ND Dirge. Awful for posing, loose as hell, barely balances to stand up. But I love it.",
            "I took some nail polish to mine. It took like five or six good coats, but it helped immensely.\n\nAs for my pick, I'd probably have to go with Earthrise Skylynx for the same reason as you. I have waited years for a Skylynx that was both, big, Sky and Lynx, and I absolutely would not trade my copy for anything. That said, it took a number of Nail Polish coats to even be able to pose his wings in anything other than a relaxed droop. His bird legs can barely handle the weight of said bird, and his Lynx half leaves much to be desired posing wise.",
            "Earthrise Doubledealer. The figure is wonky, but it has a fun transformation.",
            "My cw figures (mirage, scattorshot, sunstreaker, potp swoop and prowl) . Yes I get that CW(and subsequently potp) went ham on retools and all the figures look pretty much the same and don't have modern articulation, but I still like the combination gimmick (I love combiners) and I like how CW gave the limb bots combiner parts that turned into BFGs for them to wield.",
            "Mine is SS Car Mode Shatter, it's undoubtedly bad but I like it",
            "WFC Kingdom Tracks, his legs are too wobbly and Im afraid it will break if I use him",
            "Gamer Editiom Barricade. He fucking sucks. I love him. He makes me feel happy.",
            "Legacy Blitzwing. Such an awesome robot mode, tank is..ok. Jet mode suuuuuucks. Still love him though.",
            "SS 01 bayverse bumblebee, looks great but is unbelievably unstable",
            "Energon Optimus.\nI think I don't even need to explain the flaws, but I love him. And combined with Saber he is stellar."
        ]
    },
    "I was driving to do a photoshoot with my new Optimus today and had my first wreck in 13 years. ": {
        "title": "I was driving to do a photoshoot with my new Optimus today and had my first wreck in 13 years. ",
        "score": 794,
        "url": "https://i.redd.it/bkyrcywfld9d1.jpeg",
        "content": "How was I supposed to explain this passenger situation to the trooper that took the wreck report? ",
        "num_comments": 59,
        "comments": [
            "Swap seats and tell them Optimus was driving.",
            "Seriously?! I hope ur ok!",
            "Did you do the photo shoot while driving? Because that could be an issue",
            "Which Optimus is that? Sorry about the wreck, hope everyones ok!",
            "Damn Decepticons!\n\nHope youre ok- be safe",
            "Is Optimus okay?\n\nOh yeah, I should also ask about you.",
            "I hope hes ok. Be terrible if he got hurt.",
            "Buckle up buckaroo!  Glad youre both okay!",
            "Of course hope your doing good but I cant wait to get that thing it has die cast right",
            "Glad you both ok. I can imagine Optimus saying till all are one right before the crash."
        ]
    },
    "Probably no one in 1984 would have guessed Chris Latta would be gone a decade after he first voiced Starscream": {
        "title": "Probably no one in 1984 would have guessed Chris Latta would be gone a decade after he first voiced Starscream",
        "score": 306,
        "url": "https://i.redd.it/mwfna656re9d1.jpeg",
        "content": "",
        "num_comments": 34,
        "comments": [
            "Well, he took really bad care of himself. He showed up to work drunk a lot.",
            "Heard Flint Dille say they had to bail him out of jail constantly. Seems he really had a substance abuse problem, along with Roger C. Carmel.",
            "I think people that worked with him expected it as he was a pretty wild guy",
            "Was pleasantly surprised when I found out he was in a few Star Trek episodes too.",
            "Ngl I'm so used to hearing Steve Blum as starscream now I forgot he wasn't his original voice",
            "He looks like he doesnt have the makings of a varsity athlete",
            "I heard about the jail thing. Probably why his surviving characters were written off after the movie.",
            "Damn though, could you imagine getting drunk with Starscream and Harry Mudd?",
            "Who wouldn't want to party with goddamned Cobra Commander?",
            "Jeffrey Combs (TFP Ratchet) is also in Star Trek"
        ]
    }
}