{
    "I was driving to do a photoshoot with my new Optimus today and had my first wreck in 13 years. ": {
        "title": "I was driving to do a photoshoot with my new Optimus today and had my first wreck in 13 years. ",
        "score": 580,
        "url": "https://i.redd.it/bkyrcywfld9d1.jpeg",
        "content": "How was I supposed to explain this passenger situation to the trooper that took the wreck report? ",
        "num_comments": 48,
        "comments": [
            "Swap seats and tell them Optimus was driving.",
            "Criminal Optimus strikes again!\n\nhttps://preview.redd.it/sjc6y62vwd9d1.jpeg?width=900&format=pjpg&auto=webp&s=ddbd90be4b51c0e578a706d3b0421a264249cc66",
            "Seriously?! I hope ur ok!",
            "Did you do the photo shoot while driving? Because that could be an issue",
            "Which Optimus is that? Sorry about the wreck, hope everyone’s ok!",
            "Are you ok?",
            "Self driving car's fault.",
            "Damn Decepticons!\n\nHope you’re ok- be safe",
            "Is Optimus okay?\n\nOh yeah, I should also ask about you.",
            "Buckle up buckaroo!  Glad you’re both okay!"
        ]
    },
    "I love the siege megatron mold but this is getting ridiculous.": {
        "title": "I love the siege megatron mold but this is getting ridiculous.",
        "score": 130,
        "url": "https://i.redd.it/6ip0l0kwnf9d1.jpeg",
        "content": "I really enjoy the siege megatron mold but how many times do they expect us to buy it? Which really sucks because this Orion pax figure looks amazing\n",
        "num_comments": 38,
        "comments": [
            "https://preview.redd.it/bsjc6tp1zf9d1.jpeg?width=2048&format=pjpg&auto=webp&s=fd8ad209985914cf3927591ab1830faffc4e1aea\n\nlol",
            "11th siege megatron repaint, 12th figure",
            " it makes sense for this figure but it is funny that this mold has been reused so much but they pretty much never use the Earthrise retool.",
            "Hasbro: “But w-what if he smeared lipstick on himself and draped all of his garden tools on himself?”",
            "Genuinely love the Optimus here. Can't believe that it's stuck as a sdcc exclusive of all things, I need it so bad. Exclusives are awful. What a nice way to just say fuck anyone who can't go to san diego. Only people it benefits are scalpers. It's like hasbro is allergic to money.",
            "Fractured but whole",
            "Optimus: FRACTURED FRIENDSHIP?\n\nMegatron: I didn't choose the name!\n\nOptimus: What kind of friends pick out a nice apartment in Iacon to live in together?  What kind of friends get matching tattoos?\n\nMegs: Lots of friends!  HAVE YOU SEEN THE HOUSING MARKET?\n\nOptimus: You introduced me as your 'special friend more than a brother' to your gladiator friends!\n\nMegs: You are more than a brother to me!  And not in a Lannister way!\n\nOptimus: NO ONE CARES ABOUT GAMES OF THRONES ANYMORE.",
            "Hey now, some people still dont have it (It's me, im \"some people\")",
            "I really want an affordable and actually available repaint/mold of earthrise. Without the dumb weaponstaff. And not yellowing.",
            "What do you want to bet the upcoming SS '86 movie Megatron will just be the Siege mold again?"
        ]
    },
    "My Skybound Universe Optimus Prime finally came in. ": {
        "title": "My Skybound Universe Optimus Prime finally came in. ",
        "score": 292,
        "url": "https://www.reddit.com/gallery/1dqw2o9",
        "content": "Gotta say, I kind of prefer the Mp44 transformation. Also, he's bad luck on car rides. ",
        "num_comments": 37,
        "comments": [
            "You the guy who got in the first car crash in 13 years?",
            "I was going to ask if you happen to be the poor fella that got into a car accident with Mr. Optimus all buckled in but then I saw the other comment. At least Optimus, and you, are ok!!! Sorry he did your car in...",
            "“What the hell is this?”( if ykyk)",
            "What is that figure?",
            "Is MS-02EX everything you'd hoped for? I'm so close to pulling the trigger on one.",
            "Technically true. The artist did use Light of Peace on his desk as the base of the design. Now you need a white logo and maybe a Megatron arm",
            "How much is this?\nAlso sorry about the car accident, hope you’re alright",
            "Haha I just saw your crash post\n\nSome people say he was actually based on the dx9 commander Dutch, but the guy literally said it was based off of the Ms light of peace\n\nhttps://preview.redd.it/w0mqk01rre9d1.png?width=2006&format=png&auto=webp&s=79e225ffb6bc52917ba7d4b34fc153c5bedc2bc9",
            "I got mine too, best Optimus I’ve had. I need a Megs to go with him. Have Crimson Wings Starscream on pre-order and an Acoustic Wave Soundwave being shipped now.",
            "This somehow transforms? That’s nuts"
        ]
    },
    "Probably no one in 1984 would have guessed Chris Latta would be gone a decade after he first voiced Starscream": {
        "title": "Probably no one in 1984 would have guessed Chris Latta would be gone a decade after he first voiced Starscream",
        "score": 183,
        "url": "https://i.redd.it/mwfna656re9d1.jpeg",
        "content": "",
        "num_comments": 27,
        "comments": [
            "Well, he took really bad care of himself. He showed up to work drunk a lot.",
            "Heard Flint Dille say they had to bail him out of jail constantly. Seems he really had a substance abuse problem, along with Roger C. Carmel.",
            "I think people that worked with him expected it as he was a pretty wild guy",
            "Was pleasantly surprised when I found out he was in a few Star Trek episodes too.",
            "Gone as in deceased?",
            "Ngl I'm so used to hearing Steve Blum as starscream now I forgot he wasn't his original voice",
            "He was the original voice of Moe and Mr. Burns on The Simpsons, but they stopped using him after the first season because he was unpleasant to work with.",
            "I heard about the jail thing. Probably why his surviving characters were written off after the movie.",
            "Jeffrey Combs (TFP Ratchet) is also in Star Trek",
            "Yes, he died quite early"
        ]
    },
    "Anyone else think that the cassettes are the most fun to collect?": {
        "title": "Anyone else think that the cassettes are the most fun to collect?",
        "score": 144,
        "url": "https://i.redd.it/7vrp0gc2xe9d1.jpeg",
        "content": "",
        "num_comments": 27,
        "comments": [
            "Not with the ridiculous aftermarket prices they’re not",
            "https://preview.redd.it/6wnvxm8ljf9d1.jpeg?width=1592&format=pjpg&auto=webp&s=bdd157e9fbbf3d434b2574a35bf497c23ea44ecb",
            "Same! I wish they weren't so hard to come by. \nAlso wish hasbro just released a full set for autobots and decepticons, not the crappy version blobs either, some higher quality ones.",
            "They've been a hassle to find.",
            "You even got the target optimus prime dog. 😆",
            "I agree.",
            "I love my cassettes!",
            "Yes but some of them dont fit in soundwave sometimes like they get stuck and I dont know why",
            "where the fart did you get that rewind and that rumble to the right",
            "OP how do you have a solid plastic rewind?"
        ]
    }
}