{
    "Trash Taste Podcast: Weekly Discussion Thread - Episode 209": {
        "title": "Trash Taste Podcast: Weekly Discussion Thread - Episode 209",
        "score": 41,
        "url": "https://www.reddit.com/r/TrashTaste/comments/1dldbmp/trash_taste_podcast_weekly_discussion_thread/",
        "content": "Episode: **209**\n  \nTitle: **WE CAN'T DO EXERCISE**  \n  \n# [Watch this episode here.](https://www.youtube.com/watch?v=11CEoyYAraw) ",
        "num_comments": 86,
        "comments": [
            "I love Joey and I’m so happy he is getting into fitness, truly one of the most satisfying journeys a person can take. I have my reservations about CrossFit but what matters most is that he is trying to be active(and he’s enjoying himself). That alone already means he’s doing more than most people. But I highly question his comment of being below 10% body fat without a proper diet.",
            "It was interesting to see them talking so candidly for the first 2 minutes while they didn't know they were being recorded. The voice tones and demeanors change so much once they know they have to be in content mode haha.",
            "Recently started getting healthier and I experienced the same thing Joey did. Walking around with all my camera gear on a backpack will just destroy your back if you're not fit. Cut out all the junk food and shrunk my portion sizes to be the recommended portions while just using a stationary bike in my garage for 30 minutes a day. Went from around 200 to 165 in a few months.\n\nJoey's right, once you're without all the junk, you don't really crave it. Sure, I'd love a donut but it's no longer something I'd go out of my way to get and after one, I'm done.",
            "Same mentality as Connor, workout and get fit so you can eat all the delicious food of the world 🙌. Though this is not going to work for everyone.",
            "Good episode, genuinely would be surprised if Joey was sub 10 percent body fat.  I know he’s probably a lot fitter now then he was but that is a very low percentage considering he really doesn’t look it  from his recent content \n\n Regardless huge ups for getting fit around 30. Hell ya dude !",
            "joey casually capping how his long jump record is 5m when the highest in recorded history is lil more than half that",
            "\"Objectively, the gym is one of the most depressing places in the world\" was just sad to hear and untrue.",
            "As someone who likes trains and works in the industry, people who like trains are their own worst enemies at times.",
            "I am glad Joey is on his fitness journey and is looking and feeling better. But there is no way he is under 10% body fat, while only going 1 or 2 times a week for a couple of months without dieting. It takes a lot of time and hard work to get to and stay at sub 10%. Good shit to him for finally getting out there, but he was just way off.",
            "Joey’ whole story about getting in shape had me cringing so much. I mean i have my reservations about crossfit but whatever, it’s good that he’s trying to get fit. Then he says he’s below 10% body fat and there’s no way that’s true. Then he says his coach doesn’t have dietary restrictions and this had me hopelessly screaming into my speakers"
        ]
    },
    "Trash Taste Podcast: Weekly Discussion Thread - Episode 210": {
        "title": "Trash Taste Podcast: Weekly Discussion Thread - Episode 210",
        "score": 75,
        "url": "https://www.reddit.com/r/TrashTaste/comments/1dqsw9y/trash_taste_podcast_weekly_discussion_thread/",
        "content": "Episode: **210**\n  \nTitle: **We FORCED The Boys To Watch This**  \n  \n# [Watch this episode here.](https://youtu.be/nfdD8slgIhM)",
        "num_comments": 83,
        "comments": [
            "2024.06.28 the meme is dead :(((((((\n\n(many memes now are lol)",
            "What a great idea for an episode!",
            "This is the breaking Canon Events episode.",
            "Already the number one contender for \"Best Episode of the Year/Season\"\n\nHoly shit",
            "SAYA NO UTA, LORD OF THE RINGs, ARCANE, BREAKING BAD AND GOODBYE ERI. LETS FUCKING GO TRASH TASTE IS BACK",
            "Im not sure if this sub still hates guests/loves regulars or only the new fans do, correct me if im wrong, but are the guest episodes getting even more rare now? Last guest was 2 months ago i think?",
            "Fun seeing Connor being giddy about the bois talking about F&H hehe",
            "3 hours episode?! This is going to be a banger...",
            "It's always funny to me hearing Connor gush about Fear and Hunger. It feels like everything he loves about this game is stuff he normally says he hates in other games.",
            "Hopefully we get to hear about Garnt's full lord of the rings experience in a future episode since he had only watched the first movie in this one."
        ]
    },
    "Betterhelp, the worst sponsorship, is back.": {
        "title": "Betterhelp, the worst sponsorship, is back.",
        "score": 1909,
        "url": "https://i.redd.it/833ggejpdd9d1.jpeg",
        "content": "The boys doesn't seem to care even after being called out by other YouTuber.\n\nWhile every other YouTubers tries to distance themselves from Betterhelp, the boys still take the sponsorship.\n\nMore and more \"betterhelp bad\" video is out today, surely they know and just choose to not care.",
        "num_comments": 157,
        "comments": [
            "Fuck betterhelp, boys' podcast is my therapy",
            "I've not heard, what happened has better help done?",
            "Have you considered the possibility of them being in an incredibly strict contract (something the company is known for doing) instead of jumping to the conclusion of them being morally bankrupt capitalist leeches that is intentionally ignoring audience backlash? Betterhelp bad and they shouldn't have accepted the contract in the first place, but why are you assuming they can just exit? They would get sued to oblivion and Betterhelp have taken down videos criticising them before. This is pointless speculation. ",
            "maybe TT is helping spread awareness by saying it is *trash*",
            "Never heard of betterhelp, what makes them controversial?",
            "Garnt has spoken on the podcast before about how better help helped him through tough times. It's most likely just a situation where they value their personal experience more than YouTube movements.",
            "They probably don't even use half the sponsor products they've had ads for all these years, ultimately it whatever",
            "betterhelp is like the airbnb of therapy there is likely some decent ppl using it but chances are it's just scum taking advantage of a easy to manipulate platform",
            "There are a few topics that I would personally stay away from, if I had sponsors. Anything to do with healthcare would be right up there.",
            "That's cool. Hope they are getting paid well by this company with a bad reputation."
        ]
    },
    "trash taste in the dungeons of fear and hunger": {
        "title": "trash taste in the dungeons of fear and hunger",
        "score": 279,
        "url": "https://www.reddit.com/gallery/1dr3jjx",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Joey's eyes somehow make him look Korean here, or at least more Asian than how he looks now.",
            "This is awesome! They look so done with the dungeons",
            "The vibe reminds of that one actor that's always playing mob/mafia roles",
            "DUDE!! That looks awesome!",
            "Daz crazy",
            "Radical!"
        ]
    },
    "You guys are hypocrites.": {
        "title": "You guys are hypocrites.",
        "score": 314,
        "url": "https://i.redd.it/5jirfv3iee9d1.png",
        "content": "",
        "num_comments": 35,
        "comments": [
            "Isn’t the second option still betterhelp?\n\nCuz ya have to gacha for a good therapist if ya actually do go into it",
            "Gacha is like, transparently predatory. It's not being hidden at all, and that's why I just accept it, at least.\n\nBetterHelp pretends it's all sunshine and goodness and you have to read the fine print and do some homework to find out how much they're hiding. Gacha gets your credit card info, but Betterhelp gets that and (allegedly?) various sensitive data about you and (allegedly?) monetizes it.",
            "The fuck? Gacha doesn’t promise to help your mental health problems.",
            "That's a stupid comparison. Gacha games, like with gambling, is fine in moderation. As long as you don't spend what you can't afford you're fine. \nBetter help is a product where people are supposed to go if they have problems. But they are a shitty service and people aren't getting the help they need. Which when dealing with mental issues can be the difference between life or death. If you don't care how the boys make the bag that's fine, no one is asking you to care. But don't be disingenuous",
            "Gacha is a serious problem but I also hate when people reduce gacha games to just gacha when it's an actual game with actual gameplay and story and worlds that the devs poured their heart and souls into.",
            "Anything is addictive to some people, using this logic they shouldn't be sponsored by G Supps either since some people will get addicted to it and spend a bunch of money on it",
            "And you are Stupid. The evil practice of better help has been known for some time now. With gachas you dont expect to be helped. You expect that of an therapist. You are comparing completely different things.",
            "This is the dumbest argument. Gacha games are good if you're doing it in moderation. I play gacha games like Genshin, spend money on chars I like. But I'm not just gonna spend 1000s on one character. Or even for pulling multiple copies of them. If you have gambling problems, you shouldn't be playing that game in the first place. The game can't change the whole system just because a few people can't control themselves. So just because something is gacha doesn't mean you just shit on it.",
            "What? Gacha says what it is on the tin. You know what you're going to get yourself into. Betterhelp isn't and is maliciously bad",
            "Im not. I dont care about either sponsor."
        ]
    }
}