{
    "MUSTARD & TRAVIS SCOTT - 'PARKING LOT' OUT NOW!": {
        "title": "MUSTARD & TRAVIS SCOTT - 'PARKING LOT' OUT NOW!",
        "score": 145,
        "url": "https://www.reddit.com/r/travisscott/comments/1dkuwk7/mustard_travis_scott_parking_lot_out_now/",
        "content": "https://preview.redd.it/mqq7c2umeu7d1.png?width=1000&format=png&auto=webp&s=7958aab4281c6f9f25f7f1b73bb813e28acc05d5\n\nAPPLE MUSIC: [https://music.apple.com/au/album/parking-lot-single/1752189829](https://music.apple.com/au/album/parking-lot-single/1752189829)\n\nSPOTIFY: [https://open.spotify.com/album/6YQ5Y4ITpAQCANWhNHraXi](https://open.spotify.com/album/6YQ5Y4ITpAQCANWhNHraXi)",
        "num_comments": 58,
        "comments": [
            "Hard as a muthafuckin Scott La Rock",
            "I like it, just vibey and a cool lil feature not everything needs to be a masterpiece, especially as a feature",
            "This shi hard asf tf yall on",
            "Im not a too big fan of it. Some good sections but it lacks an actual melody at all. Like not everything needs to be melodic but this could certainly use one.",
            "This some 2016-17 Trav right after Birds type shit!! Goes crazy af!!!!",
            "That shit is fucking fire!!!",
            "Me personally, i loved the song. Kinda hurts to see a good amount of people shit on it. We gotta remember that Travis has a tour and a few upcoming projects on the way. I aint finna give up on him, just appreciate hes atleast trying his best on dropping new music. All said respectfully",
            "I love rap flowin travis. I really hope he leans more into this side, like what he also did in MY EYES and nee-nah.",
            "ngl i get drake w savage type vibe first listen i fw it a lot its gas ",
            "Travs best lyrics in a while and yall still think this is bad??? Man is spitting real shit"
        ]
    },
    "FREE THE RAGE TEE #2 LIVE NOW ⛓️‍💥 shop.travisscott.com": {
        "title": "FREE THE RAGE TEE #2 LIVE NOW ⛓️‍💥 shop.travisscott.com",
        "score": 361,
        "url": "https://i.redd.it/7hhlmaxrsr7d1.jpeg",
        "content": "",
        "num_comments": 144,
        "comments": [
            "Mann i would buy it in a heartbeat if shipping wasnt outrageous",
            "Shipping should not be that high",
            "Some of the proceeds going to the foundation is great to see, love when he does that",
            "18 bucks for shipping in California and closed my browser haha",
            "what is its miami supposed to mean.  Did he say that while they arrested him or sum?",
            "Is there gonna be some sort of coupon code?",
            "Gotta pay the lawyer fees I see lmao",
            "How long they out for",
            "anyone got a code for the tee? s broke",
            "My first Travis Scott t"
        ]
    },
    "What happened🤣": {
        "title": "What happened🤣",
        "score": 105,
        "url": "https://i.redd.it/lkiy45dz1h9d1.jpeg",
        "content": "",
        "num_comments": 22,
        "comments": [
            "Where did mo bamba go",
            "mike dean couldnt finish the album by 12 ",
            "Damn they done took Astroworld...can't have shit in Detroit...",
            "Nothing its just a glitch nigga",
            "One of the best albums of this generation",
            "this album is a ripoff of Astronaut Status",
            "Sonny digital the only mf to show up ",
            "I'm not really sure if you're black",
            "Wtf is up with the hostility",
            "Hes just helping you out nigga"
        ]
    },
    "Last night was crazy 🥹✨": {
        "title": "Last night was crazy 🥹✨",
        "score": 33,
        "url": "https://v.redd.it/lk1xizx04i9d1",
        "content": "Was first row and it was magical ",
        "num_comments": 5,
        "comments": [
            "Bro did the jump man logo",
            "Yoo l love how he gets progressively more aggressive in that verse lol",
            "Yo whats he wearing on his head, Nike headband? And what sneakers are those?",
            "hes such a good performer, first time i saw him in concert was back in december and ive seen lil wayne in concert, best performer ive ever seen"
        ]
    },
    "THANK GOD for this camera": {
        "title": "THANK GOD for this camera",
        "score": 28,
        "url": "https://v.redd.it/jji16j2e8i9d1",
        "content": "",
        "num_comments": 5,
        "comments": [
            "At what time did the concert end?",
            "Little after 23:00, but he started an hour later than scheduled because of technical stuff",
            "Which phone?",
            "15 Pro"
        ]
    }
}