{
    "Come smoke with your fellow ents on TreesRadio.com Share your new favorite song, or kick back and find some new tracks. Click this link to join us!": {
        "title": "Come smoke with your fellow ents on TreesRadio.com Share your new favorite song, or kick back and find some new tracks. Click this link to join us!",
        "score": 301,
        "url": "https://treesradio.com",
        "content": "",
        "num_comments": 32,
        "comments": [
            "[deleted]",
            "Damn, y'all are still going? Nice! Used to hang out in the old plug.dj room before that site died. Good on y'all for keeping going :)",
            "I'm probably missing something due to my current goldfish memory, but how do I suggest a song? \"Join waitlist\" doesn't do anything, and it won't let create a playlist 🤷",
            "This is awesome! Streaming it now",
            "How do i chat?",
            "ooo i like this",
            "It stills on?",
            "[removed]",
            "i found a box like this in the street, the usb stick seems clean and filled with syrup.  my guess is some high schooler walking thru dropped it - should i try it?\n\nhttps://www.dogstarorganix.com/product/kic-delta-8-high-potency-disposable-assorted-flavors/?attribute_pa_flavors=orange-creamsicle",
            "[removed]"
        ]
    },
    "You peole are crazy....": {
        "title": "You peole are crazy....",
        "score": 467,
        "url": "https://www.reddit.com/gallery/1dln65z",
        "content": "Visiting vancouver and bought a pre roll  Smoked barely the tip and ended up in my bath listening to the entirety of The Wall blasting on my headphones.\n\nTwice.....\n\nThis shit is weapons grade now.",
        "num_comments": 87,
        "comments": [
            "What is this? A joint for ants?",
            "lol, a CBD joint with 3% total THC. Please be super careful if you end up smoking type one weed. We’ll continue with the weapons-grade metaphor. If the weed one would usually get at a dispensary is a nuke, what you’ve got there is some brass knuckles.",
            "![gif](giphy|6mRA7NS04xSZG|downsized)",
            "![gif](giphy|13VSAbTVuYJfLa)",
            "Finally someone with as small a tolerance as me!\n\nIll take a 5-8 second hit of my vape n be bearly able to move...*i took less than a second a moment ago n its so mich harder to read*. think thats a dyslexia thing, dont think most people get more and more illiterte while high...",
            "Now try dabs. They'll have you fucked up all night. Went to WWE Raw after smoking one and it was a nice, but interesting trip.",
            "I smoked half of a hybrid blend pre-roll. It was 1/4 g worth, and that joint got me so high that I was laughing at myself while I was taking a shower. For no reason. I thought it was weak at first, until my ex walked into the bathroom because I was laughing, to tell me, \"Yeah, you're high as f*ck\" and walk out. 🤣 \n\nI was laughing so hard, I could barely even dry myself off with my towel.",
            "Homie’s out here getting stoned off CBD 🤣",
            "Small, but packs a puncha! Just the “tip”, huh? 🤣",
            "My roomates came back from visiting Vancouver and they can also attest to the quality of BC weed,  don't get me wrong we have good stuff in Alberta but BC weed? Hope you had a good time!"
        ]
    },
    "Where can i order a bong like this?": {
        "title": "Where can i order a bong like this?",
        "score": 728,
        "url": "https://i.redd.it/1x7exu26ez7d1.jpeg",
        "content": "",
        "num_comments": 82,
        "comments": [
            "pretty sure this is AI",
            "No where, this is ai",
            "Smoking like 0.2grams lol",
            "There's not even a place to put your mouth bro😅",
            "You could ask a small business to custom make you something like that. I couldn’t find any Jake bongs though",
            "in your imagination\n\nthe bowl is the size of a pea and there’s no reasonable spot to smoke out of lol",
            "What do you mean a bong like this? This is an AI image of Finn smoking a Jake bong. There is not bong in the picture that a human could operate with.",
            "MATHEMATICAL!",
            "Check the Cartoon Network website :)",
            "He looks like he’s sucking his head wang"
        ]
    },
    "In Japan, the government is currently taking public comments for a proposed THC cap of 0.001% for CBD products, in addition to a potential 7 year prison sentence for having THC in your system.": {
        "title": "In Japan, the government is currently taking public comments for a proposed THC cap of 0.001% for CBD products, in addition to a potential 7 year prison sentence for having THC in your system.",
        "score": 566,
        "url": "https://www.cannabisindustrydata.com/what-is-the-thc-limit-for-cbd-products-in-japan/",
        "content": "",
        "num_comments": 74,
        "comments": [
            "That’s not just strict it’s oppressive",
            "I’m Japanese and I can tell you that if you write to Japanese institutions (like the embassy, tourism department, etc.) with really innocent questions just expressing genuine concern about all this because you are considering traveling to Japan for holiday next year, it will greatly increase the chances of Japan reversing all of these draconian decisions.",
            "What's wrong with just fuckin legalizing it?",
            "I’m sorry, prison sentence for a failed piss test for a substance that stays in your system for anywhere between 1-5 weeks? What if I travel over there and consume no weed while there, but I use it at home in my own country?",
            "Why stop at 1mg might as well ban 1 nanogram or picogram. In fact why don't they just arrest you if you had a thought about THC while using your CBD. Seems reasonable. /s\n\nJapan needs to get out of the dark ages and embrace cannabis. They have a massively over stressed population that has no outlet other than booze.",
            "Whoa..",
            "anyone else just waiting for all these geezers to keel over so we can implement much needed changes to our daily lives? sheeez",
            "Japan just digging their own grave",
            "But why?",
            "That will solve their population problem."
        ]
    },
    "Just a big ol box of purple nugs": {
        "title": "Just a big ol box of purple nugs",
        "score": 200,
        "url": "https://i.redd.it/ybwqwb3wv08d1.jpeg",
        "content": "Latest harvest of red poison by sweet seeds after first wet trim, in the drying tent now and then a month cure! ",
        "num_comments": 28,
        "comments": [
            "purple bud is beautiful.",
            "Purple is my favorite color",
            "Damn near looks fake, I’ve never enjoyed many purps because I found they are either force purps or just dyes. Not saying that’s what this is just saying.",
            "Thought it was a box of lavender lol",
            "what strain?\n\nI am excited to see what granddaddy purple does this year… I hope it looks like the flower you have in your post!",
            "I can smell this picture",
            "Ngl I thought it was lavender",
            "It's so purple it should be asking where's Ronald",
            "wtf is that real??? I have never seen photos of cannabis that purple before 🤯",
            "![gif](giphy|3ofT5ySFXZ01oJ7aoM|downsized)"
        ]
    }
}