{
    "For June 2024, what was your favourite song and which song are you tired of hearing, and why?": {
        "title": "For June 2024, what was your favourite song and which song are you tired of hearing, and why?",
        "score": 8,
        "url": "https://www.reddit.com/r/triplej/comments/1dqu4vb/for_june_2024_what_was_your_favourite_song_and/",
        "content": "Take a look at the most played tracks on [**triple j**](https://www.abc.net.au/triplej/featured-music/most-played/) and [**Double J**](https://www.abc.net.au/doublej/most-played)\n\nWhat was your favourite song over the last month and which song are you tired of hearing, and why?",
        "num_comments": 11,
        "comments": [
            "Been really loving “Baddy On The Floor” by Jamie xx! I recently re-discovered Jamie’s 2015 album *In Colour* and fell in love with it all over again. So awesome that he still has that magic after all those years!\n\nAlso been liking last couple of singles by The Buoys, as well as the new tracks by Clairo and Amyl & the Sniffers.",
            "Loving \n\nDisclosure - She's Gone, Dance On\n\nFred Again. - places to be \n\nCharli xcx - The girl, so confusing with Lorde (obsessed and has to be my favourite of the year, incredible album)\n\nRufus Du Sol - Music is Better (it has really grown on me over the past week) \n\n1300 - Levitate \n\nAyesha Madon - Eulogy \n\nNot loving as such \n\nGlass Animals - A Tear in Space (I'm a fan of them but I haven't been able to get around this and the new releases)",
            "The new sophie song and the charli song with yung lean along with black balloon for me over the past week and preceding that was think of you by becca hatch, effy an mall grab with iluv and also sideshow by carla wehbe. I dig run and curious/furious by willow smith too",
            "I, like pretty much everyone on the internet, have been rinsing \"brat\", but \"The girl, so confusing version with lorde\" just elevated not only that track, but the whole project to another level for me. \n\n\nAlso loved Pond's new album, with \"Last Elvis\" and \"Fell From Grace With The Sea\" probably the two non-single standouts, but \"Black Lung\" would be a recommendation for all the old Pond fans.\n\n\n\"VOLCA\" from SBTRKT is hella cool.\n\n\nSpeaking of dance music, it's been an incredible year so far and Jamie xx's \"Life\" and \"Treat Each Other Right\" are right up there along with \"I CAN'T LOSE YOU\" by Confidence Man.\n\n\nFinally, because they're two of my favourite artists, was surprised and delighted to see Maggie Rogers and L'Impératrice team up on \"Any Way\".",
            "Favourite - Allday Miss you still",
            "Loving U should not be doing that -amyl and the sniffers.\n\nNice to hear a rock song with a bit of attitude that hits hard.",
            "Million Dollar Baby will be on the hottest 100. Also loved Best Bits from King Stingray!",
            "Reason Why has been on loop, that song makes me feel at peace. Also a lot of Brat, really good album to have on loop. Hope those can get on the Hottest 100 this year.",
            "Baby, We’re Ascending - HAAi",
            "Favourite song has to be Houdini by Eminem. Probably my vote for the Hottest 100."
        ]
    },
    "Feels bad, man.": {
        "title": "Feels bad, man.",
        "score": 37,
        "url": "https://i.redd.it/kw2bx4toog9d1.png",
        "content": "",
        "num_comments": 9,
        "comments": [
            "I am still bemused and perplexed as to who thought it was a great idea to have G Flip as a subheadliner for Australia's biggest alternative multi day festival.\n\nIf that was the option that won out, I'm somewhat curious to know what the alternatives were that got rejected.",
            "Meanwhile the heavy music industry is thriving in Australia…",
            "This meme isn't necessarily meant to be a blanket statement on the general state of how all Australian festivals are doing at the moment - from what I've been seeing Good Things, Laneway and Knotfest have actually been doing pretty well lately - but I've been watching clips of this year's Glastonbury and I can't help but feel a bit jealous",
            "Flip had the most entries in a single Hottest 100 of any artist ever, one of which was second place. It’s pretty reasonable to think they would’ve been a draw card.",
            "Pretty much explains why Knotfest and Good Things are still doing well. Genre-specific festivals seem to have weathered the post-pandemic storm the best, it seems.",
            "Please don’t talk about Glastonbury..We had our Glastonbury! but then whoever decided Lizzo and Kylie and Mumford Arcade Firesons etc would be enough to charge 3 day festival prices for a 2 day festival that’s who took our Coachella",
            "Same as edm/techno/house whatever the fuck you wanna call it. Lost, BTV, and pitch are all pretty niche with dance bookings and they sell the fuck out",
            "Can’t wait to see the good things lineup for 2024 it will be hot 🔥",
            "I reckon it's the difference in dedication. Because it's not as mainstream anymore, people who listen to heavy metal or the harderstyles want to see it live more and are more dedicated to each scene. With pop and even indie music, you can hear that everywhere."
        ]
    },
    "Jordan Barr new weekend breakfast host ": {
        "title": "Jordan Barr new weekend breakfast host ",
        "score": 14,
        "url": "https://www.reddit.com/r/triplej/comments/1dqtx6l/jordan_barr_new_weekend_breakfast_host/",
        "content": "Replacing stacy gougoulis ",
        "num_comments": 15,
        "comments": [
            "I'll miss Stacey.",
            "I just wish we got all the announcements in one hit:\n- Tim Shiel leaving JJ arvos\n- Stacey moving from JJJ weekend breakfast to JJ arvos\n- Bryce moving from JJJ breakfast to JJJ lunch with Dave Woodhead\n- Luka moving from JJJ weekend arvos to JJJ breakfast\n- Jordan moving from JJJ weekend arvos to JJJ weekend breakfast.\n\nSo who tf is doing JJJ weekend arvos?",
            "😍😍",
            "So who gets Jordan and Luca's spot? I can do it.",
            "This is great news. Looking forward to see how she does riding solo.",
            "Stoked for Stacey to be on one of the prime time spots. He has been there weekends, late nights, sick leave fill ins, just doing his time, doing good work every chance they give him.",
            "Did Frankie just announce it was her?",
            "i don't think she'll work great solo. her tiktoks are some of the least interesting shit ive ever seen",
            "Hope not",
            "Good thing she’s not on the radio to do tiktoks"
        ]
    },
    "Halfway through the year already. What songs will make the Hottest 100?": {
        "title": "Halfway through the year already. What songs will make the Hottest 100?",
        "score": 0,
        "url": "https://www.reddit.com/r/triplej/comments/1dqzxuf/halfway_through_the_year_already_what_songs_will/",
        "content": "I’m not 100% sure how the Hottest 100 works  despite living here but for some reason I’ve never voted in it. I probably have listened to it though.\n\nAnyway, my understanding is that popular songs get nominated. Which songs/artists do you think will make it to the list?\n\nMy basic list of songs that will definitely make it (based on charts):\n\n* \"Beautiful Things\" — Benson Boone\n* \"Cruel Summer\" — Taylor Swift\n* \"Houdini\" — Eminem\n* \"Last Night\" — Morgan Wallen\n* \"Not Like Us\" — Kendrick Lamar\n* \"Stick Season\" — Noah Kahan\n\nAnd so on.\n\nAny thoughts?\n",
        "num_comments": 52,
        "comments": [
            "You’re right about one thing, you have no idea how the hottest 100 works",
            "Murder on the Dancefloor - Royel Otis LAV will top 10",
            "[deleted]",
            "Looking at the charts is often not the best way to determine what will end up in the Hottest 100. The music Triple J plays is skewed towards more Australian and indie artists and typically avoids some of the mainstream pop that appears on the charts.\n\nI would be very surprised if those Taylor Swift, Benson Boone or Morgan Wallen songs made it into countdown. In fact Taylor Swift is sort of blacklisted from appearing in the countdown at all.\n\nTake a look at the 50 most played songs on Triple J (https://www.abc.net.au/triplej/most-played) and you’ll struggle to recognise any artists from the charts there. The only one currently in the most played Triple J charts and the ARIA charts is Billie Eilish. That most played chart will give you a better idea of who to expect in the Hottest 100",
            "Lunch, I had Some Help, Good Luck Babe, Texas Hold Them - will definitely chart",
            "None of those songs you've listed are making it bar Kendrick",
            "Billy eilish lunch wins this year",
            "That's not quite right. Yes, popular songs do make it on, but it's popular songs that also resonate with the triple j listenership, which is different to that of commercial stations.  \n(So Taylor Swift and Morgan Wallen are not making it.)\n\nHow it works is that triple j provides a shortlist of songs, and the option for write in submissions, and you can vote for up to 10 songs.  \n\n(Edit: Also, people will say Taylor Swift is banned from the countdown. That's complete misinformation based on one incident where the voting rules were broken.)",
            "Billie eilish, Charlie xcx, Chapell roans “good luck babe” single I feel will all make pretty high up spots!",
            "I am thinking either Chappell Roan (Good Luck, Babe!), Kendrick Lamar (Not Like Us), G Flip (Cruel Summer LAV) or Royel Otis (Murder on the Dancefloor LAV) wins. It should be Chappell Roan though.\n\nCXLOE's Good Luck, Babe! LAV gets in the top 10 too and places higher than Texas Hold 'Em.\n\nalso in regards to OP's list, 3 of the songs are in reliable (Cruel Summer came out in 2019, Stick Season in 2022 and Last Night in 2023)."
        ]
    },
    "Toxic subreddit": {
        "title": "Toxic subreddit",
        "score": 0,
        "url": "https://www.reddit.com/r/triplej/comments/1dr24kd/toxic_subreddit/",
        "content": "Just looking at some of the comments on my last post. Not very constructive in your criticism. Quite toxic actually.\n\nWhy does this subreddit have such a toxic culture? Looking at users like u/TheJeffJackson.",
        "num_comments": 11,
        "comments": [
            "You seem to be the one calling people cunts.",
            "Although correct, why bother making a post about it? If the subreddit is not for you, which judging by your last post, it’s probably not. Just ignore and move on.",
            "Look at his account, it’s obviously account created just to troll subreddit’s",
            "Just report his account and he'll be banned.",
            "And he’s the one calling people pedos and murderers and N words?",
            "That's not too flash.",
            "This has to be satire right???",
            "Your post?",
            "No, saying that the N word “isn’t too flash” but “cunt” is."
        ]
    }
}