{
    "If you get stuck somewhere, think of this..": {
        "title": "If you get stuck somewhere, think of this..",
        "score": 847,
        "url": "https://v.redd.it/288aqz5pud9d1",
        "content": "",
        "num_comments": 82,
        "comments": [
            "Isn't this what the \"differential lock\" switch is for?",
            "Keep a log in cab📝✅",
            "Yup just carry a fucking 3ft wide chunk of wood behind your seat",
            "I have full lockers, I'll just hit a couple switches and wait a second for them to engage and away I go.",
            "I'll borrow this backwards ass technique.",
            "Now you can use the runaway truck ramps without the need to call a wrecker",
            "Saving this for when I need it 😭",
            "I got 3 lockers and power divider and chains, don't need log",
            "Of course. That log that everyone has",
            "Good trick dangerous start out"
        ]
    },
    "How would you dump 2 pallets of unwanted product?": {
        "title": "How would you dump 2 pallets of unwanted product?",
        "score": 778,
        "url": "https://i.redd.it/egqpcf0b9d9d1.jpeg",
        "content": "2 pallets / 288 cases / 110,592 non flavored coffee creamer half and half pods?",
        "num_comments": 551,
        "comments": [
            "Contact the nearest local food bank",
            "Go to East St. Louis n put a seal on your trailer n leave it parked on the side of the street for 20 minutes.",
            "Pull into a Blue Beacon and tell them it is free if they remove the pallets after.  Everyone there will load up their cars.",
            "Park in Walmart lot and sell for a dollar or two a box 🤷‍♂️",
            "Most people I've seen pull into a truck stop, or grocery store and give them out, or sell them for cheap.",
            "Find 2 pallets of vodka, 2 pallets of Kahlua, and The Dude...",
            "Rest area or truckstop.  $1 a box.  Make a cardboard sign.   Make some under the table cash.",
            "I use these. But damn not two pallets worth. Maybe a local coffee shop would take these off your hands?",
            "Dang u got stuck with the LAMEST refuse freight 😂",
            "I had 2 pallets rejected once while I was in Pennsylvania. The yard dog suggested I go to an Amish store a few miles away, he said they would unload me. Those Amish fellas emptied my trailer in less than 10 minutes."
        ]
    },
    "Why is it doing this and when I get on the bunk it started again": {
        "title": "Why is it doing this and when I get on the bunk it started again",
        "score": 281,
        "url": "https://v.redd.it/uu0lmkwfpe9d1",
        "content": "No there is no sex happening either but pretty sure people outside are like Wow they keep going and going   Even with engine off and batteries off it does it ",
        "num_comments": 126,
        "comments": [
            "just like your suspension, the cab has a leveling valve...at least my shitbox international does...give that a check...\n\nedit...if looks to be next to the left cab airbag...your gonna have to dump your air tanks to get it to stop so you can examine it safely.",
            "Stop picking up lot lizards,  and that won't happen",
            "Try replacing the 2 shocks that connect from the cab down they are the small ones.",
            "The cab shocks are bad or the leaving valve for the cab has failed. Maybe both. They are both easier fixes. Could even replace them your self if you are handy with tools. If you drain your air when parked with the engine off the bags should deflate and won’t bounce till you can get it fixed.",
            "You have to turn off the Dr Dre first",
            "I don't know but I wish were in there while it's going on  mmmm bet it'd be fun 😊",
            "🎶Well the house is a rockin' don't bother knockin'\n🎶Yeah the house is a rockin' don't bother knockin'\n🎶Yeah the house is a rockin' don't bother come on in",
            "Gots a lil dubstep goin. Un chhh un chhh un chhh.... i was kinda jammin while reading comments. 😁 \n\nMy guess is the leveling valve is bad.",
            "If you like getting paid you'll stop working for Translines immediately.",
            "That is the new jack off assistant mode...everytime there is bunk pressure it is there to help you get there...lmao"
        ]
    },
    "I was told \"pics or it didn't happen\"": {
        "title": "I was told \"pics or it didn't happen\"",
        "score": 1626,
        "url": "https://i.redd.it/zykbei3rpa9d1.jpeg",
        "content": "So here ya go. Been a driver for 20 years, highest weight was 568 lbs (probably was higher, but when you get over 450, it's hard to find scales that work) and currently around 200 lbs. If you are struggling with your weight on th road, keep rolling, it's possible. ",
        "num_comments": 246,
        "comments": [
            "Way to go driver! I wish you the best in your health. \n\nYou can add at least 100lbs of weight onto your drives now ;)",
            "Congrats! You probably added years to your life hopefully",
            "Congrats driver. I too am trying. 330 to 228 here. I wanna see Mars inhabited.",
            "Wow, If you were a wanted man in the first pic... The second pic wouldn't be the age progression anyone is looking for.\n\nI think you could start a new life without having to move to Mexico hiding from the law",
            "Little bit of meth goes a long way.\n\nJk, good job driver.",
            "Your a inspiration. What did you do.",
            "Congrats, how'd you do it?",
            "Tip 1 lay off the soda. Tip 2 subway is the worst thing you can possibly put in your mouth",
            "Damn! Now I need to do that! 100 lbs down!",
            "I was like wait, isn’t that the Estes guy? Yup! Congrats man!"
        ]
    },
    "I Hate Needle Dicks": {
        "title": "I Hate Needle Dicks",
        "score": 159,
        "url": "https://v.redd.it/ctkoz0621e9d1",
        "content": "",
        "num_comments": 37,
        "comments": [
            "Eh. The light was still red when he tried to wiggle out. Just bad timing but I wouldn’t be mad.",
            "No good deed goes unpunished. \n\nWhen I come up to busy lights like this, if I see they want to go right, please take the space in front of me; want to go left, nope, I won't give them any quarter; when in doubt, they can wait.",
            "Let me introduce myself, they called me beer can in high school",
            "extended cab, short bed, speed stripes",
            "I don't see anything wrong with what that guy did.",
            "The car in front of you screwed up, should have either stopped a cars length earlier or got right behind the car in front.\n\nIt's just really bad timing that it stopped you getting through the light.",
            "If that makes a bad day for you then you need bigger problems!",
            "He did nothing wrong.  We don’t own the road as drivers.  If we want other to let us in we need to let them in.  Swallow that ego homie.",
            "Bro GPS told me to",
            "Ehhhhh, you’re on a big ass truck, light is red, let him go, don’t complain about your dick size."
        ]
    }
}