{
    "High wind Rollover": {
        "title": "High wind Rollover",
        "score": 895,
        "url": "https://v.redd.it/67gw4u6ol08d1",
        "content": "",
        "num_comments": 197,
        "comments": [
            "If you see the wind move your trailer around, keep on driving and record a video with a good amount of eye contact with the camera and hands off the wheel",
            "If this is happening you, you need to STOP. The fact that he is fucking saying that hes watching his trailer lift off the ground and not stopping, is INSANE",
            "I-25 between Cheyenne and FT Collins or I-80 between Cheyenne and Laramie. Never seen so many rigs on their sides in my life when I lived there.",
            "Dude said “here we go!” Like it was all part of the plan lmao",
            "Lord son, if you're seeing that, why not put your seatbelt on and stop or slow down?",
            "\"Ooooohhh shhh - here we go!\"\n\nCompletely unflappable. Just pure optimism and politesse on his way out the world.",
            "Too stupid to know he was going to get trashed.  Get your unit so half your wheels are in the ditch, leaning the trailer into the wind, stop and wait for the wind to calm down.  Or take a side road so the wind is not broadside to you, stop and wait there.  For hours if you need to, getting blown over is not an option.",
            "Super trucker of the year right here. \n\n- Too “cool” to wear a seatbelt( Gotta show off the flashy button up tee) ✅ \n\n- Saw how much the trailer was getting shifted and lifted around (for how long I wonder before recording?) and decided the smart thing to do is video it ✅\n\n- Hardly even has his hands on the steering wheel ✅\n\n- Doesn’t do the safe thing, fully sends it while not looking at the road ✅",
            "Maybe im a pussy but if I even start to feel wind I slow waaaay the hell down. This guy was just asking for it.",
            "Nice seatbelt work"
        ]
    },
    "PRIME, what in the holy hell are you doing? ": {
        "title": "PRIME, what in the holy hell are you doing? ",
        "score": 1407,
        "url": "https://v.redd.it/agw5uihaqz7d1",
        "content": "I've seen some stupid shit in my time, but a u-turn on railroad tracks in front of a passenger train might take the top prize. ",
        "num_comments": 336,
        "comments": [
            "My god. Missing the flashing lights is one thing,  but he had plenty of time and space to get through the tracks. But did a u-turn for what? Maximum damage?",
            "Not only should that driver be fired. That ignorant motherfucker needs to lose his license.",
            "Does blue balling the train count as a win?",
            "Ohhhh shit, that could've been bad",
            "Give me 40 acres and I’ll turn this rig around. \n\nFor the whippersnappers that don’t get it:\n https://m.youtube.com/watch?v=qDxVJ471hyg",
            "what the FUCK was this guy doing",
            "My brothers on rubber. Train operator here. Just popping in to say if the gates come down on you, keep fkn going. They are fiberglass or aluminum and made specifically to break away. There are sensors in the machines that (usually) trip our signal system that something is wrong.\n\nAdditionally if you get stuck, do not call 911 or the local cops. FIRST FIRST FIRST look around for a metal walk in hut or metal cabinets near the crossing. On that is supposed to be a blue sign with a phone number AND additional numbers. That phone number usually goes to the train dispatcher of that line who, with the information you give him, will attempt to get all trains in that area stopped. And of course get the FUCK away from your truck or car or whatever. When we hit vehicles they fly all over the place.\n\nOnce its determined trains are stopped then get the local cops involved and tow trucks and whatnot. \n\nI dont know why this is a thing but many of our towns police along our lines dont know who to call to report stuff with the railroad OR the numbers they have will take a long time to get the info where its gotta go.\n\nPrime dude did a dummy here but managed to get it off the tracks in the nick of time.",
            "So we have seen enough of these at this point that ok we just have some dumbasses...why not just drive through the other barrier...its gotta be better then the potential destroying of lives on that passenger train and the ptsd the train driver is gonna have for hitting you...",
            "Hmm, wonder where in Utah this happened.",
            "Holy hell, they're stupid, I've actually engineered that train before   it's the UTA front runner in UT, people and cars are always running through last minute causing incidents,  most the time when there's a major delays, because of an incident where someone lost a life"
        ]
    },
    "Play stupid games, win stupid prizes ": {
        "title": "Play stupid games, win stupid prizes ",
        "score": 579,
        "url": "https://v.redd.it/9tw3l9ozbz7d1",
        "content": "I couldn't crosspost this from another sub.",
        "num_comments": 53,
        "comments": [
            "I'm disappointed that car got a spot.",
            "The other car going by in the emergency lane on the left at the end 😂 \"boy, I'm glad I'm not that guy\"",
            "I bet that driver left a little poop in the seat and that car left some oil in the road lol",
            "Why is the fake ass repeating sound clip necessary?",
            "Now that’s putting someone in their place!",
            "wtf is this idiotic sound loop, good god, worse than tiktok music smh...",
            "with all that jiggling i thought the truck would transform",
            "Virtual ass beating so he don’t do it again",
            "Where is this place? It looks like traffic gridlock hell",
            "Another unprofessional trying to out-stupid a four wheeler."
        ]
    },
    "What a week": {
        "title": "What a week",
        "score": 119,
        "url": "https://i.redd.it/1iej6zaky08d1.jpeg",
        "content": "From a trailer tire blowout at midnight to waking up the next day with DEF spewing everywhere. Im really feelin this pic right now. Hope everyone else is having a safe week. ",
        "num_comments": 4,
        "comments": [
            "Classic. 🤣😂",
            "Sometimes I think that then I see my check and get rejuvenated",
            "Same. For six minutes until I pay my bills and then I’m sad again."
        ]
    },
    "I am such a child.": {
        "title": "I am such a child.",
        "score": 48,
        "url": "https://i.redd.it/tuwe2ztla28d1.jpeg",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Did you take another pic .3 miles later?",
            "Not a child, but a man of culture. 😎",
            "One thing that makes this so much better in my opinion is that it was completely unintentional. I was making a delivery, came back to the truck, got in, and the screen lights up and greets me with 8008.2. I couldn’t believe it.",
            "BOOB 2 = BOOBIES??",
            "nice",
            "Exactly."
        ]
    }
}