{
    "Natalee Holloway \"fought like hell\" moments before death, her mom says after Joran van der Sloot's murder confession": {
        "title": "Natalee Holloway \"fought like hell\" moments before death, her mom says after Joran van der Sloot's murder confession",
        "score": 93,
        "url": "https://www.cbsnews.com/news/natalee-holloway-fought-like-hell-before-death-mom-says-joran-van-der-sloot-confession/",
        "content": "Natalie Holloway was 18.  In 2005 she went on a school trip to Aruba.  After a night of drinking and partying with her friends, things took a turn for the worse.  She was seen getting in the car with 3 men. After that she was never seen again. Joran Van der Sloot, the murderer is the son of a well respected judge on the island.  Now after 18 years he confesses.  He also murdered the daughter of a prominent political figure from Peru.",
        "num_comments": 22,
        "comments": [
            "I dont believe in capital punishment, but Joran van Der Sloot makes a great case for it.",
            "Words cannot express the hate I hold in my heart for this guy.",
            "I don't believe he just \"pushed her out to sea.\"  She was dumped out at sea and he had help. I always felt they shoved her in a weighted crab trap, took her out by boat,  and sank her",
            "Wild, when this happened I thought this was just another woman who went missing because I was a little girl. Now Im an adult myself and seeing she was only 18 when she went missing makes me so sad, she was just a girl.",
            "In addition to him murdering women, he also was arrested for drug smuggling in Thailand and embezzlement  of the Holloway attorney.",
            "I dont believe in capital punishment, but Ill make an exception for this case\n\n-Redditors on every single case",
            "He was involved in criminal activity from way back in his lifetime.",
            "They think his father was involved some how with the coverup of the murder as his son Joran went to his father for help.",
            "I agree. I think she would have been found if that was the case. He wouldn't have taken her far out if he only waded out till he was knee deep as he claims. I just don't think it's plausible. Whoever helped him dispose of her body is almost as much of a monster as him - how could they watch the torture Natalee's family has gone through?",
            "Desperation is a hell of a feeling. Because the only reason he got himself in trouble in the US is because he was broke and needed money, and figured a great way to get money was to extort the family of the woman you supposedly didnt murder. \n\nI rarely think criminals are as dumb and people like to say, but damn, thats just so stupid."
        ]
    },
    "Father whose murder conviction was overturned in son’s hot-car death is released from prison and moved to jail": {
        "title": "Father whose murder conviction was overturned in son’s hot-car death is released from prison and moved to jail",
        "score": 42,
        "url": "https://edition.cnn.com/2024/06/18/us/justin-harris-georgia-hot-car-prison-release/index.html",
        "content": "",
        "num_comments": 30,
        "comments": [
            "I dont know what all these people are talking about, this guy killed his son on purpose. I live in Atlanta as well as Im sure some of the people in the comments, this guy is as guilty as it gets!! No justice for that poor little boy!!",
            "He was sending disgusting pics of his private parts to a young woman while his baby son was roasting to death in that hot car",
            "I remember this stupid puke.  Why did he not get some justice in prison so we dont have to see him anymore ?",
            "Some of yall are so convinced he did this on purposeIm not saying he didnt, but isnt the only evidence extramarital affairs? It feels like a weak motive without any other pieces of evidence\n\nDownvote away, I stand by my opinion that this is flimsy evidence, and the state clearly agreed ",
            "As much as a scumbag as this guy is, the evidence against him was so flimsy I'm glad it got overturned. Next time it might result in a good person being prosecuted.",
            "Its crazy to me his now ex wife stood by him saying it was an accident. No chance in hell that it was!",
            "There is not an ounce of me that's thinks this is an innocent mistake. I've watched everything I can about this and TRIED TO see it. He purposefully baked his son. He even goes to check to make sure he is dead at one point. NOT seeing or smelling your dead son in a hot car (the kids bowels would have emptied) is absolute BS for one.",
            "Did you see his fake ass hell crying in the interrogation room. The guy was acting like his water was his savior to stop crying and \"hyperventilating.\" So fake and pathetic.",
            "That's what I think too. I really don't think he had any contempt for his son like that. He was a cheater, a creep who was into teenagers, and negligent, but I don't think he left his baby to die in a hot car on purpose.",
            "yeah idk. He's a skeezy guy but even the ex wife was like, our marriage sucked and he was a shitty husband but he loved his kid. "
        ]
    },
    "Middle school principal sentenced for murder-for-hire plot to kill teacher and her unborn child": {
        "title": "Middle school principal sentenced for murder-for-hire plot to kill teacher and her unborn child",
        "score": 412,
        "url": "https://www.usatoday.com/story/news/nation/2024/06/27/cornelius-green-sentenced/74232636007/",
        "content": "",
        "num_comments": 46,
        "comments": [
            "The principal was the father of the unborn child.",
            "This dirt bag stole money from a school fundraiser to hire a hitman so he could cover up his decisions. What a piece of shit.",
            "I cant find an eloquent way to say that 2500 bucks is a crazy low number to kill a pregnant woman",
            "First of all, ever hear of birth control?!  He got her pregnant three times!  If you didnt want the kid you should have planned better.  What an absolute monster thank goodness youre being locked up for life!",
            "While she was working on baby shower invitations and then he made her mother go check on her knowing she was dead.. what a POS",
            "Feels like a good time to reiterate that homicide is a greatest mortal risk to pregnant women.",
            "$2500 to kill a pregnant woman??? WTAF? \nTalk about \"Dirty Deeds Done Dirt Cheap\"",
            "Working in education with so many batshit admins this story completely tracks!",
            "This is local for me. The kids of one of my friends had her as a teacher and loved her. There is no punishment sufficient for her death & the pain caused not just to her & her baby, but to the whole community of that school. Seriously. Nothing Dante came up with in the Inferno is nasty enough for him.",
            "As a teacher, mother and human- this is one of the worst things Ive ever seen. How horrific. My heart goes out to her family, friends and students."
        ]
    },
    "Iowa Woman Sentenced to 304 Months in Prison for Hate Crimes Involving Attempting to Kill Two Children Because of their Race and National Origin": {
        "title": "Iowa Woman Sentenced to 304 Months in Prison for Hate Crimes Involving Attempting to Kill Two Children Because of their Race and National Origin",
        "score": 94,
        "url": "https://www.justice.gov/opa/pr/iowa-woman-sentenced-304-months-prison-hate-crimes-involving-attempting-kill-two-children",
        "content": "",
        "num_comments": 13,
        "comments": [
            "304 months so 25 years. Federal so she's going to do most of it.\n\nHopefully by the time she's out assuming she lives that long, she's either cleansed herself of her hatred or she's to old to be a threat to anyone.",
            "This one is a wee bit older, but it had recently come up on my crime feed and alerts. Thankfully nobody was critically injured. I do wonder how the kids are doing now. I wasn't able to find anything more recent.",
            "Im glad the word gets out about this. People who perpetuate crimes like this dont need to be around everyone else. \n\nIf this is the best justice we got, lets catch em all.",
            "Mother said the kids are traumatized, her daughter cowers in fear when someone is at the door. Islamophobia needs to stop! It is rampant everywhere! Including Reddit!",
            "I totally read the title wrong and thought it said Im a woman sentenced. Was waiting for the AmA at the end and thinking wtf!",
            "Upon seeing the children and believing that the victim was of Middle Eastern or African descent, Poole Franklin drove her vehicle over the curb towards both children, striking one of them.\n\nas if the kids being poc justifies murdering them",
            "It said on each count. I think there were 3 counts.",
            "That entire ama is so disturbing. The amount of people who kiss the killers ass is frightening",
            "To be somewhat fair, she was a child groomed by an older man. I highly doubt she would have killed if she wasnt being abused and manipulated. Obviously doesnt justify it, but thats an important element.",
            "Shes no victim. She stabbed her baby brother who ran to her for help"
        ]
    },
    "No one else being looked for in murder investigation of 24-year-old paramedic and his girlfriend who were found dead at a house": {
        "title": "No one else being looked for in murder investigation of 24-year-old paramedic and his girlfriend who were found dead at a house",
        "score": 140,
        "url": "https://www.walesonline.co.uk/news/wales-news/major-police-update-after-welsh-29442402",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Also important to note that the police force in question (Staffordshire Police) has referred itself to the Independent Office for Police Conduct over previous contact with the couple as they have been called out to assist with them before.\n\n Not sure in what context as there's no more info as far as detail released to the public via media  goes that I have read.",
            "Could this have been a murder-suicide?\n\nIt's certainly give that vibe off to me, esp with those pix posted.",
            "If this is was a murder sucide it feels very messed up how people keep praising him in articles and not even mentioning the young woman.",
            "Ohh so sad  possibly drug overdose? Or carbon monoxide poisoning.",
            "Reading around online, the main rumour  on a local level appears to be he murdered her , then killed himself. There's also talk he was out on bail for alleged sexual assault against a previous partner meaning he was suspended from his job. He also had a history of mental health struggles. In other words, what people are surmising here about murder-suicide could be possibly correct and he may not be  the 'decent  person'  he's been painted as by some media and those who have given tributes on their socials.  It's a sad situation.",
            "If theyve been called out to the couple before, and knowing how taxing frontline work is on mens mental health, Id put money on this being a murder suicide.",
            "True, but I dont think they knew the context at the time and reporters were particularly interested in the story because he had been on TV before for his paramedic work, so they questioned his colleagues who would naturally be complimentary before they knew what had happened. I think this will be a shock for them as well. Hopefully the tone of the reporting will change now.",
            "It's a true crime subreddit......",
            "Frontline work isnt taxing to womens mental health, too? Women are first responders as well.",
            "If you read the article - they ruled out homicide? The autopsy will be released."
        ]
    }
}