{
    "I live in Albuquerque and work in a hospital. Last year, a detective I talked to at work pretty much confirmed who is responsible for the West Mesa murders.": {
        "title": "I live in Albuquerque and work in a hospital. Last year, a detective I talked to at work pretty much confirmed who is responsible for the West Mesa murders.",
        "score": 26,
        "url": "https://www.reddit.com/r/TrueCrimeDiscussion/comments/1dltdp8/i_live_in_albuquerque_and_work_in_a_hospital_last/",
        "content": "I live in Albuquerque and work in a hospital.\n\nLast year, a detective came in to question one of our patients who had been shot. Because I am a true crime nerd and had done a lot of reading about this case, I couldn't resist asking the detective about the West Mesa case (In 2009, the bodies of 11 sex workers were found in the West Mesa in Albuquerque, NM).\n\nhttps://en.wikipedia.org/wiki/West_Mesa_murders\n\nI showed him I didn't have a phone on me and that I was just wearing scrubs and assured him I was just curios. I made sure he knew that if he talked to me about it... There would be absolutely no way for me to prove the conversation happened.\n\nI asked flat out \" Do you think Lorenzo Montoya killed those young ladies?\". The detective smiled and said \"I can't give any names, but I can say that I believe the person who committed those murders is no longer alive and I personally consider the case closed\".\n\nNow you can believe me or not. I don't have any proof. But you can check my profile to see I do live in ABQ and I do work in a hospital. I swear on my daughter that this interaction happened.\n\nLorenzo Montoya is 100% the person who committed those murders. He was caught red handed murdering a sex worker. He had had a sex worker in his trailer. The sex worker's boyfriend/pimp had grown concerned because the date was taking so long. When he pulled up to the home, he found Lorenzo loading up the body of the sex worker in his car and proceeded to shoot and kill Lorenzo.\n\nLorenzo was killed in 2006. The pimp was never charged with a crime for killing him. The bodies of 11 sex workers were found in the West Mesa in 2009. All of the women had been killed prior to Lorenzo's death (between 2001 and 2005). And the site where the bodies were found was less than a mile from Lorenzo's home.\n\nOn top of all this, the following video was found at Lorenzo's home:\n\nhttps://www.youtube.com/watch?v=3dZSEY06eyo\n\n\nAccording to police, in the full video Lorenzo is having sex with a woman. Then the video abruptly cuts to the footage linked above like the sex video had been taped over.\n\nIn the video, you can hear someone doing something with trash bags and duct tape. The sex worker Lorenzo was caught red handed murdering had been wrapped in trash bags and duct tape. Some of the bodies that were found in the West Mesa also showed signs of being wrapped in duct tape and trash bags.\n\nThere is absolutely no doubt in my mind that Lorenzo committed those murders. And that was the case even before I had this conversation with the detective. Albuquerque Police still consider the case \"open\". Every few years they will have a press conference and ask the public for information. But it is pretty clear no one is working the case and they also unofficially consider it closed.\n\nAnother thread prompted me to make this post... So I just thought I would share. I know this has major \"My dad works at Nintendo\" vibes. But if I had any proof... There's no way the detective would have talked to me. So it is what it is!",
        "num_comments": 11,
        "comments": [
            "I think the cop would say what he thinks will work in the moment...but also I believe you & I think you're right.",
            "I mean, I’ll give you the benefit of the doubt this happened. \n\nBut it doesn’t really prove anything. You live there. Obviously the detective lives there. Of course he is familiar with the case and has opinions. Professional and personal. \n\nI’m sure he likely would’ve agreed with you in a vague round about way no matter what you said. Same basic concept as if you ask any FBI agent about DB Cooper.",
            "I'm from ABQ also. I'll give you the benefit of the doubt. It sounds like a regular response he would give.",
            "There wasn't really anything the detective would be trying to \"work\" when the conversation took place. \n\nI spoke to him in the hallway of the hospital I work at at about 2:00 AM in the morning. He was checking on a patient who had been shot, hoping he was able to answer questions about the shooting. \n\nIt was just the detective and I in the hallway. I'm pretty confident the detective was being honest about his feelings on the case with no ulterior motives.",
            "I hear you and get where you are coming from. But I don't think that's a fair comparison. \n\nThere are over 10,000 special agents in the FBI. And they are spread all over the United States. \n\nThere are likely only, at most, a couple dozen detectives in Albuquerque. And they are all located in this one medium sized city. I think an Albuquerque detective is a lot more likely to know a bit about the most famous unsolved murder case in their city than an FBI agent is to be familiar with the DB Cooper case. \n\nThat being said... If you had the opportunity to pick the brain of an FBI agent about something you were interested in that they may have knowledge of... Wouldn't you take it!?",
            "Maybe it's his honest opinion, maybe it's just what you say to appease a random member of the public, you know?\n\nNot arguing. I believe you. I think you're right.",
            "I would be careful being *this* specific. You've used a time now. You wouldn't want this officer to get in trouble.",
            "According to Wikipedia, there’s 1100 police officers in Albuquerque. That’s a pretty huge department. They have two helicopters lol \n\nAnd sure it’s not exactly the same, just saying that people who work in law enforcement have opinions too - profesional and personal. I live in a much smaller town, and actually know a lot of cops(mostly in the have mutual friends sense), and my dad is a criminal court judge. I totally get it. \n\nJust saying, I really do not think he would have spouted off to anyone other than very vaguely. I just meant that plenty of FBI agents are willing to talk about DB Cooper (an often discussed and very popular unsolved true crime case) and give generic and vague opinions. Very few will go into specifics.",
            "Albuquerque has a huge field office. Way, way more than \"a couple dozen detectives\" there.",
            "We're on the same page for sure. \n\nJust to be clear... The detective made it clear he **personally** considers the case closed. You're right that it was just his opinion. \n\nThere's no way he would say anything like that to the media or in an official capacity. The department still officially considers the case open."
        ]
    },
    "What unsolved murders do you think law enforcement know the answer to? (But can’t take action yet)": {
        "title": "What unsolved murders do you think law enforcement know the answer to? (But can’t take action yet)",
        "score": 103,
        "url": "https://www.reddit.com/r/TrueCrimeDiscussion/comments/1dllzh1/what_unsolved_murders_do_you_think_law/",
        "content": "Do you think there’s some unsolved cases that police are close to solving/know who did it but can’t arrest due to lack of evidence or something else?\n\nI know a lot of people I’ve spoke to think Liz Barraza’s killer is in the sights of the police but they can’t do anything yet.  \n\nAre there any other cases like this? ",
        "num_comments": 146,
        "comments": [
            "I feel like they know who the [West Mesa Bone Collector](https://en.m.wikipedia.org/wiki/West_Mesa_murders) was, but can’t take action because he’s dead. There’s a lot of publicly available evidence so I’d guess they have even more than we know.",
            "Tabatha Tozzi’s case, they know who did it but the mf has been on the run since he killed her",
            "Missy Beavers is hopefully one of them.",
            "I highly suspect the cops know what happened to Patti Adkins and who is responsible (pretty sure we're almost all agreed on the guilty party/s), but they need one more piece of the puzzle to fit before they move in.",
            "Robert Wone. We know it was some combo of the guys in the house: Joe Price, Dylan Ward, and Victor (I can’t be assed to look up how to spell his last name). They are All accomplices in hiding the murderer(s). But there’s not enough evidence to bring charges.",
            "The fbi pretty much know who did the Tylenol murders but don’t have enough evidence to charge. \n\nSource: Killer Psyche podcast",
            "I think the police know who The Doodler is, but also can’t make a move due to lack of evidence and no one willing to testify.",
            "Suzanne Morphew",
            "Katelin Akens",
            "Tara Calico."
        ]
    },
    "What cases had you the most conflicted?": {
        "title": "What cases had you the most conflicted?",
        "score": 16,
        "url": "https://www.reddit.com/r/TrueCrimeDiscussion/comments/1dlt59d/what_cases_had_you_the_most_conflicted/",
        "content": "As in- which ones had you feeling like there was so much evidence going in different directions, did the person who got convicted do it, was it someone else, were there other suspects, etc.\n\n  \nOne that always makes me wonder is the case of Sandy Melgar - She was convicted of stabbing her husband to death, and there was a huge lack of physical evidence suggesting that she did it, but the only other reasonable hypothesis is that one or two people broke into her house, killed her husband for no reason, then tied her up and left her alive. I personally lean towards her being innocent.",
        "num_comments": 14,
        "comments": [
            "Timmothy Pitzen.\n\nThere are indications in that case both for his mother killing him and for her giving him away to be raised by someone else. You can read that case in both ways and both would make sense. That is why it is so weird to me.\n\nHopeful part of me believes he is still alive somewhere living his life but rational part of me thinks he is most likely dead and buried somewhere only his mother knew.",
            "Honestly, Michael Peterson.",
            "I was conflicted most of my young life about Darlie Routier but with life experience I look at her now with a more informed eye. Now that I’ve lived with a narcissist and met sociopaths I can decipher behaviors and now it’s plain as day to me that she’s guilty. It’s a case I hadn’t thought of for over 20 years. A blurb about her case popped up on TV the other day, I looked at her and said to myself ‘she is guilty.’ Revisiting her interviews it’s clear to me now.",
            "Listening to the Tom Brown podcast again.  \n\nI don’t trust anyone and don’t have a clue what happened. The only thing I strongly believe (besides that Klein and Lewis are both full of shit) is that the family had been in possession of the phone.",
            "Stuff with kids doing violence bothers me. I'm not a huge fan of society often condemning them for life and not really asking questions about is there more to the story and can the person be rehabilitated.",
            "I’m very conflicted about Kyron. I go back and forth on if I think Terry did something, but I just can’t figure out how she pulled it off if she did.",
            "Murdaugh. That was very much a He's a jerk, he's a scammer, he was there so it must have been him. But there's not much real evidence. Calling the financial crimes a motive seems unrealistic. He wouldn't murder his family to. Buy time that's extrem.",
            "There's no indication that she gave him away other than her claiming so, she killed him i'm shocked that anyone is conflicted. It wouldn't make sense at all. Timothy was not a two month old, he was 6 he'll remember who he is and his family there's no way you could keep him secret unless you are keeping him prisoner which would contradict her nonsense claim that he would be treated well.",
            "What a bizarre case. I would need more info to make a better guess. If there is nothing on the cell phone records, and her family is being truthful then I would have to lean toward she killed him. For a moment I almost wondered if she didn’t traffic him and killed herself out of guilt. The only way she would have “given” him to someone else to live a good life would be if she had lots of support in doing so. There would be some kind of record of that, someone would know something. But I can’t recall a single case where a parent takes the kids out for all kinds of fun adventures before killing them. What was her financial situation like? Did someone give her a bunch of money to do those fun things w him before they took him off to a better life? If he was killed was there anywhere she could have disposed of his body that he wouldn’t be found? Very strange indeed.",
            "Same, nothing about that case remotely adds up except the fucking owl theory, and even that has holes."
        ]
    },
    "TV star Victoria Vera Blyth shot dead by her husband in murder-suicide": {
        "title": "TV star Victoria Vera Blyth shot dead by her husband in murder-suicide",
        "score": 1289,
        "url": "https://metro.co.uk/2024/06/18/british-businessman-shoots-tv-star-wife-murder-suicide-turkey-21059985/",
        "content": "",
        "num_comments": 95,
        "comments": [
            "An utterly evil thing to do. Leaving your children with no parents at all and for them to find your bodies? Vile",
            "I worked with this guy for some time in Brazil. Absolute animal on the coke. It later came out that he liked to beat prostitutes about.",
            "A TV star shot dead by her British businessman husband said ‘you never know what can happen’ before being killed in an apparent murder-suicide.\n\nDavid Thomas Blyth, 53, shot singer, TV presenter and comedian Victoria Vera Blyth at their villa in Ankara, Turkey, while their three young children were at home.\n\nHe first shot his wife before turning the same gun on himself with a bullet in the head on June 11, Turkish newspaper Hürriyet reported.\n\nIt is believed that the couple had argued over messages he found on Victoria’s phone.\n\nJust months earlier, while discussing future projects in her last ever interview, Victoria said: ‘I don’t like to plan completely into the future, because you never know what can happen.’\n\nShe had been planning to return to her music career and buy a ranch, a friend told Czech newspaper Blesk.\n\nVictoria’s sister, Alexandra, posted on Instagram: ‘It is with deep sadness and pain that I have to announce that my beloved and beautiful sister, the sunshine of our lives who brought us so much joy, with her laughter, positive spirit, drive and energy, has left us forever.\n\n‘Please, I’m begging you all, give us time for the sake of the children.\n\n‘My family is going through a very difficult time because they lost both parents.\n\n‘We recently buried our father and now our sister and brother-in-law and we need time to recover, but most of all we need to be here for the children.\n\n‘We really appreciate your beautiful messages, but in these difficult times we need time to breathe.’\n\nTheir children – aged four, 10 and 14 – are being looked after by relatives who have travelled to Turkey.\n\nA statement released through Victoria’s family’s lawyer says: ‘During this difficult time, we would like to ask for the family’s privacy.\n\n‘The loss of loved ones is extremely painful, and the whole family needs time to process this misfortune and find out all the necessary matters related to these moments.’\n\nOriginally from South Africa, 40-year-old Victoria moved to Czechia with her family when she was 14.\n\n‘Dad was Czech, but in 1969 he fled abroad and traveled all over Africa’, she was reported by Blesk as saying.\n\n‘He then met my mother in Namibia and they moved to South Africa together.’\n\nSometimes called Victoria Velvet, she first rose to fame with her 2006 debut album called Killing Me Softly, featuring a cover of Eagles’ Hotel California.\n\nBut her music career was cut short just three years later when she became pregnant with her and Edinburgh-born Blyth’s first child.\n\nVictoria ‘thought she had bagged a Hollywood star’ when she first met Blyth in a central Prague bar, a close friend once said.\n\nThe couple continued living there after marring in 2014.\n\nShe later presented the Morning Show on Czechia’s Evropa 2 radio, alongside Leoš Mareš, before she moved to Turkey where Blyth had started a business.\n\nA statement on the station’s website says: ‘The tragic news that came from Turkey affected everyone who knew Victoria.\n\n‘All the more so because we knew her personally and for two years we met the beautiful and full-of-life Victoria at work.\n\n‘We loved you so much Victoria and you will never be forgotten.’\n\nVictoria, who described herself as ‘half Turkish, half Czech, half South African’ on social media, got heavily involved in the local community after moving to Turkey in 2019.\n\nShe launched DazSpor, a sports event company responsible for a half marathon called Runkara and other races.\n\nThe 40-year-old also launched other organisations focused on art and social solidarity, along with working to improve relations between Czechia and Turkey.\n\nA statement on her company’s Instagram page says: ‘Condolences, we are deeply saddened by the passing of DazSpor founder Mrs. Victoria Blyth.’\n\nCzechia’s Ministry of Foreign Affairs said: ‘We can confirm that a Czech citizen died a violent death in Turkey.\n\n‘Our embassy is in contact with the family and provides consular assistance. Out of consideration for the survivors, we will not be releasing any further information.’\n\nBlyth’s body was handed over to his relatives to be returned to Scotland after an autopsy.\n\nA UK Foreign Office spokesperson said: ‘We are supporting the family of a British man who has died in Turkey and are in contact with the local authorities.’",
            "Their kids were in the house. How awful.",
            "That sick psycho who shot her should have his ashes thrown in the toilet. He doesnt deserve to rest in peace for what he did",
            "Another horrific example that the most dangerous time for a victim of domestic abuse is when they leave or are in the process of leaving their abuser. For an abuser, homicide may be perceived as the ultimate form of control.",
            "The photo captions in the article feel a little weird….",
            "There’s a great episode on Mandy Matney’s podcast with an expert talking about coercive control.  It about the Mika Miller case but it’s about the topic in general.  There are good thoughts on this thread about leaving an abusive relationship is the most dangerous time for a woman, as well as taking precursors of these men seriously. The expert talks about all of this - she’s awesome.  She got a coercive control law passed in the UK. It’s definitely worth a listen.",
            "Dude looks like Corey Feldman on booze and roids.",
            "why can’t these assholes just do it to themselves and leave everyone else alone."
        ]
    },
    "Do you know anyone who was caught by DNA in a cold case?": {
        "title": "Do you know anyone who was caught by DNA in a cold case?",
        "score": 74,
        "url": "https://www.reddit.com/r/TrueCrimeDiscussion/comments/1dlhm7f/do_you_know_anyone_who_was_caught_by_dna_in_a/",
        "content": "With so many cold cases being solved by DNA these days, I've always wondered what the perpetrators were like while they were roaming free. \n\nEspecially perpetrators who lived regular lives after committing a horrendous crime.\n\nEx: I was reading about the murder of Lindy Sue Beichler and how her killer left a knife sticking out of her neck. DNA solved the case a bit ago and the perpetrator (a guy) lived a (seemingly) normal and crime-free life, getting married and having kids. \n\nAnother example : The murders of pre-Michelle Welch and Jenny Bastian in Washington state. They were both pre-teens around the same age who were killed around to the same time in the late 1980s and their deaths had similarities. So people thought they were killed by the same person. Turns out it was two different men and they both had lived regular lives (getting married, working regular jobs, having their own kids, etc) since committing the crimes.\n\nSo I've wondered: What do the people those killers interacted with think now? Did they have any inklings? I couldn't imagine being married to someone and finding out my partner murdered someone.",
        "num_comments": 41,
        "comments": [
            "Yes. Wearside Jack aka John Samuel Humble aka The Yorkshire Ripper hoaxer. An alcoholic who lived in my street. I still remember looking out of my window and seeing all of the police and the white tent etc. I will never understand why he done that. Had the police looking in Sunderland instead of Yorkshire. Awful man.\n\nMore than 25 years after the event, a fragment from one of Humble's envelopes was traced to him through DNA, and in 2006, Humble was sentenced to eight years in prison for perverting the course of justice. \n\nhttps://en.m.wikipedia.org/wiki/Wearside_Jack \n\nhttps://en.m.wikipedia.org/wiki/Peter_Sutcliffe",
            "Timothy Hennis. His story is a complex one, he was convicted, overturned, then convicted again when they tested the DNA again years later.",
            "I think a lot of people are missing the actual question here. Maybe try rephrasing it, such as \"have you personally ever interacted with someone whose DNA was used to convict them in a cold case?\"",
            "Samuel Legg, the Dr No killer, a trucker who frequented prostitutes suspected of over 12 murders across the 80s and 90s. The killer at the time earned the nickname Dr no as it was a trucker radio alias for a man asking for where to find hookers at the same areas of the murders. It’s still unclear how many murders Samuel committed but he was DNA connected to 4 of them.",
            "So, this is weird. But yes, I do know a guy caught many years later with DNA. I didn’t know him well, but literally just a normal dude. Definitely no “cold case killer” vibes.",
            "I will tell you what.\n\nI have doubts myself about how much I want to share my or my children’s DNA with unscrupulous companies. But I have a very large family, and I happen to know a few people through blood or marriage that sound a bit too worried about their genes being closely examined. I almost want to get tested just to see what’s what!",
            "Yes, but I worked in a prison where they were incarcerated",
            "I just watched an episode abt the murder of Janeen Brown and 30 years later Andrew Gustafson who was married with kids and grandkids was arrested because of DNA evidence that convicted him.",
            "There’s a podcast called DNA ID which covers cases like this. There’s quite a few cases where the perpetrator went on to live a “normal” life.",
            "In the Netherlands there have been cold cases solved with DNA and often through indirect DNA... I don't know the English word... where they find a family match after asking everyone of a certain area to give DNA.\nA few years ago the murder of Nicky Verstappen was solved like that (boy murdered at camp   https://en.m.wikipedia.org/wiki/Death_of_Nicky_Verstappen and the murder of Marianne Vaatstra as well https://en.m.wikipedia.org/wiki/Murder_of_Marianne_Vaatstra \n\n\nWe had this crime reporter who really bit into these cases to have them solved and to make DNA matches bases on familiarity possible on a legal basis. https://en.m.wikipedia.org/wiki/Peter_R._de_Vries\nHe was also very much involved in the case of Joran van der Sloot and the murder on Natalee Hollaway. "
        ]
    }
}