{
    "Mega Post. Free plans no longer have access to lyrics.": {
        "title": "Mega Post. Free plans no longer have access to lyrics.",
        "score": 168,
        "url": "https://www.reddit.com/r/truespotify/comments/1ck8i6l/mega_post_free_plans_no_longer_have_access_to/",
        "content": "Keep all discussion of this topic here. All other posts regarding this topic will be removed.",
        "num_comments": 101,
        "comments": [
            "Making new features premium only is fine. Making OLD features that were for free premium only is called \"corporate greed\".",
            "Thing that costs money isnt able to be used by people who dont pay for it. Makes sense.",
            "Quite hard of hearing myself, had hearing aids in Kindergarten but haven't been able to afford them as an adult as no insurance I've had ever covers them. (My last pair cost over $6,000 in 2008) Went ahead and deleted my account today. If you want to entice me to pay for your services, removing the accessibility features I require in order to simply understand spoken words is not the way.",
            "This continues to show the risks and dangers of streaming services. If you truly want the best experience, purchase the content directly. Then they cant make changes and pull the rug out from underneath people",
            "at least in america, arent there laws around providing disability aids for media? I feel like I remember some tv networks getting in hot water for censoring/not providing subtitles.",
            "making users pay for words on a screen, nice",
            "To all of you who says 'go find yourself a job'. I'm from Russia and I can't pay for Premium, even if I want to. When Spotify left our country, they've canceled all the subscriptions (I've paid for a year in advance) without giving money back. So what am I supposed to do? I have my library with a ton of tracks and playlists, and I don't want to go to other music service. Idgaf about Spotify losing money or whatever, it is their problem, not mine. I'm ready to pay for the subscription, but I don't have an option.",
            "Can't you just download the Musixmatch app and use the overlay thingy?",
            "why are people downvoting people who are saying whats on their mind? this is reddit ffs",
            "What will happen to all of these videos that screen record Spotify lyrics and the song, speed them up, edit them etc. and post them to TikTok?\n\nWhat happen to all of these people (including me) that post lyrics to their Instagram stories? (Can you even share lyrics if you aren't on premium now?)"
        ]
    },
    "Spotify is hiking its prices again | CNN Business": {
        "title": "Spotify is hiking its prices again | CNN Business",
        "score": 361,
        "url": "https://amp.cnn.com/cnn/2024/06/03/tech/spotify-price-increase",
        "content": "Is it just me of Spotify is digging its own grave?? ",
        "num_comments": 307,
        "comments": [
            "Keep all discussion of this topic here please.",
            "Ok Spotify, keen to see some features that aren't useless audiobooks or AI now.",
            "This subreddit - I swear if you raise the price like 4 or 6 more times, I might go to Apple Music.",
            "If they dont announce HIFI and all the other bullshit theyve been testing this month, I swear to god",
            "Spotify once again raises prices and still refuses to add actually good features.",
            "18% price hike less than a year after the prior hike shows such complete disdain for customers. \"Innovation\" lol. The struggle, as always, is switching for long time users is such a horrible undertaking I'll just wind up turning the other cheek for the zillionth time...",
            "Its to cover the cost for the new font",
            "Bold decision after scrapping Car Thing. Must have figured that their press is already bad, might was well keep going.",
            "Theyre seeing how far they can push it before people start canceling.",
            "Didnt they just reduce the amount they pay the artist for their content? This is just greed"
        ]
    },
    "SPOTIFY MIX FONT SUCKS!!": {
        "title": "SPOTIFY MIX FONT SUCKS!!",
        "score": 6,
        "url": "https://www.reddit.com/r/truespotify/comments/1dr4de1/spotify_mix_font_sucks/",
        "content": "Yeah, that's just about it. I hate how it looks, I was used to Circular and it looked neater. If anybody knows how to revert back to Circular, that could be of great help.   \n\n\n[Look how hard it is to distinguish between the \\\\\"Daily Mix #\\\\\" and the \\\\\"Artist Names\\\\\"](https://preview.redd.it/ykww6n6o9g9d1.png?width=1440&format=png&auto=webp&s=d63c46dd8dfaf059eb680f5b0fbca3d3a8d070fe)\n\nPlus, it looks kinda immature and lost it's seriousness that it had with Circular IMO. I don't understand what was the need of such a lame UI change. Bring back Spotify 2021 and everything will be alright again.",
        "num_comments": 14,
        "comments": [
            "Do you use Spotify to look at the app, or to listen to music?\n\nI don't know how anyone even notices most of the complaints on this sub.",
            "Youll get used to it and just complain about the next font change.",
            "Untested, but perhaps downgrading app version may work? No conventional way out of this one it seems",
            "The complaints are so overboard, I wouldnt have even noticed if I didnt see all these posts",
            "This fella is asking for solutions, not copes",
            "Naaaaaaaaaah man, yk what I was used to? Prime 2021 Spotify UI and I'm still holding onto it in my androids by using APKs from then. I personally liked Circular Sans and even rocked it as my font in my phone. First they make the worst possible decisions about the UI and then they make this shitty font that doesn't even look good on PC screens :/",
            "But I don't use the client :/ I like to use the web version with some \\*uhmm\\* blockers  Cause I'm broke asf.",
            "Yep, using an apk from 2021 and that just does it for Android (I also hate the modern UI for the phone app) but on PC, especially on web it's hard to not let them decide what they wanna push on you.",
            "Thank you for understanding :(",
            "You can use blockers on spicetify"
        ]
    },
    "You can share your Sound Capsule now ": {
        "title": "You can share your Sound Capsule now ",
        "score": 127,
        "url": "https://i.redd.it/1612pdbfdb9d1.png",
        "content": "",
        "num_comments": 66,
        "comments": [
            "why are they upgrading the feature without rolling it out to the rest, clearly everyone wants it",
            "Thank god stats fm exists",
            "where do i find it",
            "How do you get it",
            "Is this a beta feature? I still don't have a sound capsule",
            "Man.. we all need this, unsure of why spotify hasn't rolled it out to everyonem everybody I've showed it too from online says they'd like to see it.. I'd love to see mine because I listen to too much music",
            "How does one see a sound capsule? \n\nAsking for a friend...",
            "And HIFI still crying in the corner...",
            "Where were in the app when you triggered that screen? (How did you get to your Sound Capsule?)\n\nI know they've been working on expanding the Sound Capsule stats as a monthly sharable, but it's not clear how to get to it!",
            "I do have these, but not as exactly the same as yours (i.e the UI)"
        ]
    },
    "Annoying": {
        "title": "Annoying",
        "score": 4,
        "url": "https://i.redd.it/qxbrbavg9g9d1.jpeg",
        "content": "Why does this keep happening? Lyrics aren't showing on half the songs",
        "num_comments": 2,
        "comments": [
            "Do you have premium?",
            "Yes"
        ]
    }
}