{
    "True Detective - 4x06 \"Part 6\" - Post-Episode Discussion": {
        "title": "True Detective - 4x06 \"Part 6\" - Post-Episode Discussion",
        "score": 861,
        "url": "https://www.reddit.com/r/TrueDetective/comments/1aud4rg/true_detective_4x06_part_6_postepisode_discussion/",
        "content": "**Season 4 Episode 6**: Part 6\n\n**Aired**: February 18, 2024\n___\n**Synopsis**: [In the midst of a brutal storm, Danvers and Navarro find themselves stuck at Tsalal with no electricity or means of contact. As the truth about what happened to Annie and the Tsalal men unfolds, Navarro and Danvers each confront the demons from their past.](https://ibb.co/1vpgwdQ)\n___\n**Directed by**: Issa López\n\n**Written by**: Issa López\n___\n[Join our True Detective Discord server here!](https://discord.com/invite/XfJyGj4Hry)",
        "num_comments": 8949,
        "comments": [
            "Turns out the right question to ask was: \"who folded the clothes?\"\n\nThen we'd know the killer is the cleaning ladies!",
            "Ok but why was there a trailer full of Blair witch stick figures",
            "Soooo who left Annie’s tongue? Is that the right fuckin question?",
            "So did I miss something? Who put the tongue there? And what about the psycho guy with the shotgun in the trailer that went missing?",
            "\"So we had to melt the Perma Frost to find the life-changing microbes.\"\r  \n\"how did you melt it\"\r  \n\"Pollution\"",
            "Oliver Tagaq was the smartest character on that show. Upon hearing that everyone at Tsalal was dead, he immediately noped out. Didn't even bring the shotgun, just took off running.",
            "Minor oversight by the tsalal engineers to apparently not put any insulation in a research station in northern Alaska.",
            "Why did Rose talk like she's also killed somebody. I definitely thought she was going to suddenly drop that she killed Travis at the end there.\n\nAlso why did Rose talk to Pete like killing his father was like.... part of a spiritual journey lol\n\n(inb4 i'm not asking the right question)",
            "HOLDEN the haaaatch",
            "Whyd the caribou yeet themselves off the cliff"
        ]
    },
    "Announcing the r/TrueDetective Official Discord Server!": {
        "title": "Announcing the r/TrueDetective Official Discord Server!",
        "score": 79,
        "url": "https://www.reddit.com/r/TrueDetective/comments/18y1fuj/announcing_the_rtruedetective_official_discord/",
        "content": "With Season 4 on the horizon, we now have a subreddit discord server! Come join us to discuss everything True Detective including all of the wild theories we're sure to have throughout Season 4 \"Night Country\"!\n\nhttps://discord.com/invite/jNVeP9HgXM",
        "num_comments": 83,
        "comments": [
            "the discord isn't moderated and the users insult each other in \n juvenile ways.  I suggest avoiding it.",
            "Will you cross-post said discussions here? Not a Discord user or inclined to join. \n\nThank you for the invitation. 🙏🏽",
            "Season 4 is awful. I gave it a chance. But it’s definitely the worst one. Rushed directing, sub par acting, a sense of trying to force a story into submission. There are many things that make this show awful but those are just a few. I would like to thank everyone who supported this season and helped to ruin one of the best shows of all time. I really appreciate it.",
            "I theorize that drunk driver in episode one killed Danvers man and their baby boy some time ago. And now Danvers is raising his daughter.",
            "True detective season 4: Game of thrones",
            "yall, is anyone getting a weird vibe even from the patch from the police uniform? I have astigmatism and whenever I see it without glasses it looks like a face or something",
            "The things that frustrates me the most about this season is somehow it’s going to be tied into season 1. I don’t want to be too negative, I’ll try to appreciate something for what it is, but dear god, this season should have nothing to do with season 1, it was a gem.",
            "I made an alternate credit sequence for season 4[https://youtu.be/9n7derFqH7I?feature=shared](https://youtu.be/9n7derFqH7I?feature=shared)",
            "I wonder why I’m still watching this show tbh. It’s horrendous. I don’t want to give up on it, but I feel like it’s getting worse? Idk. I’m a huge Jodie fan too. Just a huge, messy, disappointment.",
            "I’ve never tried Discord. So I’m curious:  why add another discussion medium?  Isn’t Reddit good enough?  What does Discord bring to the equation?"
        ]
    },
    "Ture Detective Season 5": {
        "title": "Ture Detective Season 5",
        "score": 142,
        "url": "https://i.redd.it/7lmaqpsaod9d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "This place is like somebody's memory of a sea, and the memory is fading. Its like there was never anything here but water.",
            "Let's make the paddleboard a place of silent reflection.",
            "You’re obsessive. You’re obsessive too just not about paddle boarding",
            "Who paddles that fucking slow?",
            "**Detective Rustin Cohle:**  \nWhat do you think the average IQ of this group of fish is, huh?\n\n**Detective Martin Hart:**  \nCan you see Texas up there on your high paddleboard? What do you know about these fish?",
            "You know ~~Carcosa~~ Croatia?",
            "The comments on this thread are hilarious.",
            "I just want you to stop saying odd shit.",
            "Let's make ... A place of silent reflection. Probably the quote I use most from that show.",
            "People incapable of rowing usually do have a good time"
        ]
    },
    "This cracks me up because he really did walk fucking slow.\n": {
        "title": "This cracks me up because he really did walk fucking slow.\n",
        "score": 130,
        "url": "https://i.redd.it/ve9ib42ffc9d1.jpeg",
        "content": "",
        "num_comments": 9,
        "comments": [
            "They had him right then and there. Great scene!",
            "He also walked strangely upright throughout the series. It always looks odd to me.",
            "Yes! great scene! 😄👏🏽",
            "I had to spice things up this year for my rewatch so I’ve been playing season one backward/ from the last episode to the first",
            "I swear to The Yellow King himself, I was in a line of people at a store earlier, guy on the checkout scanning items at a snail’s pace, and I said to myself - BUT OUT LOUD - “Who scans that fuckin’ slow?” - in Marty’s accent. And I’m British.",
            "I’m always behind someone that walks slow in every hallway I’m ever in and passing them feels a little rude",
            "I'm from Arkansas and when it's that hot you take your damn time.  Only fools run in this stupid heat.",
            "Next step is to turn on the audio description, close your eyes and treat the entire show like it's an audiobook!",
            "Me <at shop, using a self checkout machine and seeing cashier gaze out at me>: *Hey, what do you think about these?* <pointing at the SCO>\n\nCashier: *I think self-checkout machines are a tragic misstep in this shops' evolution. They became too self-aware. Nature created an aspect of nature separate from itself. They are creatures that should not exist by natural law. They are things that labor under the illusion of having a self. This accretion of sensory experience and feeling programmed with total assurance that they're each somebody. When, in fact, everybody’s nobody. Maybe the honorable thing for their species to do is deny their programming, stop reproducing, walk hand in hand into extinction, one last checkout, brothers and sisters opting out of a raw deal.*"
        ]
    },
    "Time is a flat circle ": {
        "title": "Time is a flat circle ",
        "score": 4,
        "url": "https://i.redd.it/d83y759dfg9d1.jpeg",
        "content": "Stone pattern at strawberry field in Liverpool. ",
        "num_comments": 0,
        "comments": []
    }
}