{
    "Casual Discussion Thread (June 27, 2024)": {
        "title": "Casual Discussion Thread (June 27, 2024)",
        "score": 6,
        "url": "https://www.reddit.com/r/TrueFilm/comments/1dq4q85/casual_discussion_thread_june_27_2024/",
        "content": "General Discussion threads threads are meant for more casual chat; a  place to break most of the frontpage rules. Feel free to ask for  recommendations, lists, homework help; plug your site or video essay;  discuss tv here, or any such thing.\n\n**There is no 180-character minimum for top-level comments in this thread.**\n\n**Follow us on:**\n\n* [Letterboxd](http://letterboxd.com/truefilmreddit/)\n* [Twitter](https://twitter.com/truefilmreddit)\n\nThe sidebar has a wealth of information, including the subreddit  rules, our killer wiki, all of our projects... If you're on a mobile  app, click the \"(i)\" button on our frontpage.\n\nSincerely,\n\nDavid",
        "num_comments": 1,
        "comments": [
            "In the same way that we have diagetic and non-diagetic music, there should be a term for when scary things are only scary because the characters are in a horror movie. \n\nIt's something that's haunted me (pun intended) ever since I started watching horror and I wonder if anyone's written an essay about this phenomenon but I don't even know where to start."
        ]
    },
    "Jack Lemmon in \"Some Like It Hot\" and... Heath Ledger as the Joker?": {
        "title": "Jack Lemmon in \"Some Like It Hot\" and... Heath Ledger as the Joker?",
        "score": 22,
        "url": "https://www.reddit.com/r/TrueFilm/comments/1dr28w7/jack_lemmon_in_some_like_it_hot_and_heath_ledger/",
        "content": "Tonight I watched \"Some Like It Hot\" for the first time, and not too far into the movie (particularly in the train scenes), my boyfriend and I simultaneously realized that Jack Lemmon as \"Daphne\" is eerily, unsettlingly akin to Heath Ledger's Joker in The Dark Knight. The mannerisms, the laughter, the way he smiles... once we noticed it, we couldn't unsee it.\n\nIt's well known that Ledger references Alex from \"A Clockwork Orange\" and Tom Waits as inspirations for his performance as the Joker, but has anyone else noticed the seeming connection to Lemmon & \"Daphne\" before? Was this something Ledger ever talked about? Or is it just an unsettling coincidence?",
        "num_comments": 1,
        "comments": [
            "I can what you mean in terms of a similar energy, very twitchy and manic, with a lot of sharp movements. I think the make-up probably plays a role as well, both with the lipstick and pale faces. I don't know if there's any clear inspiration, but there's definitely similarities."
        ]
    },
    "Symbolism of lazy eye and mitten in The Holdovers (2023)?": {
        "title": "Symbolism of lazy eye and mitten in The Holdovers (2023)?",
        "score": 9,
        "url": "https://www.reddit.com/r/TrueFilm/comments/1dqs3v7/symbolism_of_lazy_eye_and_mitten_in_the_holdovers/",
        "content": "Two scenes in The Holdovers stand out to me as moments that are meant to carry a certain symbolic weight but I cannot exactly parse them. \n\nThe first is the mitten that the Mormon kid loses in the river near the beginning of the movie. Angus tells him that it was cruel he was left with only one mitten so he feels the loss that much more. We then see the Mormon kid throw the remaining mitten and it floats down the stream. I suppose this is meant to represent how the holdover kids as well as both Paul and Mary are alone, alienated, or dealing with loss? But why would the Mormon kid go and throw his other mitten too? Any ideas on this?\n\nThe other is Paul Hunham’s lazy eye. It’s a great detail for characterization but I do wonder if there is deeper meaning to the whole “this is the eye that you look at” thing. He tells Angus this right after saving his ass from getting expelled so it’s obviously a symbol of their growth together? But why the eye specifically and which one to focus on? Anything I’m missing here?\n\nI’d love to read anyone’s thoughts.\n",
        "num_comments": 5,
        "comments": [
            "Maybe it's tied to the old adage that a man with two eyes can only see the one eye of the one-eyed-man.  But the one-eyed-man can see the other's two eyes.\n\nIt's a means by which those seemingly with less sense skills are actually more intune with the world than those with them.",
            "The glove reminds me of the position the main character is in. He has a parent, but the parent isn't present, so all it does it remind him of what he's missing. It makes him ache knowing his parent is *there* but just doesn't care about him. It is just a constant reminder of the abandonment (by parent or mitten), so by rejecting the reminder you can walk away more freely.",
            "I think it’s this take\n\nhttps://www.reddit.com/r/movies/s/MgtE5xrcpp\n\nThe glove that was thrown away represents Hunham getting kicked out of Harvard, and he needs to throw his other glove away, by getting fired from Barton, in order to move on with his life.\n\n(But it applies to Angus and Mary too.)",
            "I’m just now realizing that the mitten is likely more symbolic of Angus’s mother than Angus himself, as she attempts to remove him from her life after the whole thing with the father. \n\nMakes a lot more sense if you read it this way as it’s not like Angus is rejecting his mom. It’s the other way around, obviously, because he reminds her of the mentally ill man she married."
        ]
    },
    "What do you think of Stan Brakhage? HOw do you think he compares to Lynch, von Trier, Jodorosky and Jamil Jarares?": {
        "title": "What do you think of Stan Brakhage? HOw do you think he compares to Lynch, von Trier, Jodorosky and Jamil Jarares?",
        "score": 46,
        "url": "https://www.reddit.com/r/TrueFilm/comments/1dpznu2/what_do_you_think_of_stan_brakhage_how_do_you/",
        "content": "I've seen a few of Brackage's works, a combination of his films and short films. Obviously, his works tend to be very, very strange. Even by postmodern filmic standards, he is weird. His stuff has blobs of colour, shapes, weird footage, and hardly any characters or plot.\n\n  \nWhat do you think of him?\n\n  \nIt's not hard to see why he isn't popular. I mean, even for an experimental director. There is something fascinating about his works though. The weirdness of them, the visual nature, and the way he probably isn't human. How did these works even get releases? It's surprising that Lynch's early works got released, and The Holy Mountain by Jodorosky (probably) took decades to come out. But how did Brakhage get his films out, and what kind of people like, or even, understand them? How do you feel about them? Do you have a favourite, and if so, why? Do you care about them?",
        "num_comments": 27,
        "comments": [
            "I'm not sure narrative, feature filmmakers like Lynch or Jodorowsky are the best comparisons. As experimental as their films might get, they still involve scripts and actors and sets; Brakhage once made a film not by using a camera but by pressing insect wings, flower petals and other objects directly onto the film itself. \n\nI would argue that much better comparisons for Brakhage would be other experimental animators like Norman McLaren, Oskar Fischinger or Caroline Leaf. Or other avant-garde filmmakers on the border between cinema and museum video art, like Michael Snow or Maya Deren and Alexander Hammid.\n\nAs for Brakhage himself, I'm a fan, especially of *The Dante Quartet*, which strikes me as one of the great animated films. He is one of the very, very few filmmakers who could be accurately described as creating new possibilities for the medium.",
            "Brakhage was an experimental filmmaker not in the sense that he made stuff that was “weird” but in that he was literally *experimenting* without necessarily knowing what the final result would look like. He would do things like paint or attach other materials directly onto a strip of film without ever using a camera and run it through a projector. A lot of his work was created with an element of randomness, and the titles were only assigned afterwards based on what they made him think of, for example [stellar](https://youtu.be/L8r9t135_xY?si=DLV0u8gbN5oxmjJ4) reminded him of satellite photos of space and the [Persian](https://youtu.be/n4Ux04WI6nc?si=g-lGNiViOjIWX2DF) series reminded him of the style of Persian miniatures. A lot of his work is an exploration of form with any explanation being secondary. He spent most of his life more in the art world and academia rather than anything close to a conventional film path. It doesn’t really make sense to compare him to narrative filmmakers. “How does Brakhage compare to Hollis Frampton or Michael Snow” might be a better question.",
            "He was an experimental filmmaker so you can't compare him to narrative filmmakers. You have to view his work with a different lens. His work and technique has actually been very influential to narrative directors, other artists, and even musicians. Anytime we see scratched celluloid or painted film frames we should be thinking of Brakhage. I remember seeing The Tree of Life and was happy to see sequences that were probably influenced by Brakhage.",
            "Brakhage is probably the most popular avant-garde filmmaker of all-time, so where are you getting the idea that people don’t like his work? No avant-garde artist has ever had mass appeal.",
            "Imo the only thing that he has in common with the others you listed is that he used a camera (but not always). I watch something like Dog Star Man and it’s about as impressionistic, abstract and avant garde as film can come. Everyone is going to interpret it completely differently; while one shot might remind someone of their mother’s womb it might cause another to have visions of a nuclear wasteland. Whereas there is an objective way to understand parts (or the majority) of something like Mulholland drive or el topo. I love his work but it’s not about narrative. I don’t think he needed much of a budget to create his art so that’s probably how he built up a fan base over time but I’m not an expert.",
            "I would recommend P. Adams Sitney's Visionary Film, which is a fantastic, readable overview of American experimental film. It has a chapter on Brakhage which will explain him in much more context and prep you for watching Dog Star Man, if you choose to go that route.",
            "As other comments have made clear, it may be moot to compare an experimental filmmaker with narrative filmmakers. It'd better be to compare his work with that of his contemporaries or modern filmmakers who work in a similar vein. Also, who is Jamil Jarares? I cannot find anything online when I look up his name. Is this a pseudonym for someone else?",
            "Really insightful comment, you’ve given me some names to explore. thankyou!",
            "But Lynch and Jodorosky have both released works that were experimental and narrative works. Brakhage really is, you know, very strange.",
            "Yes, that's one of the points of the avant-garde -- that it's not a mainstream work with mass appeal."
        ]
    },
    "Composing the Anatomy of a Fall": {
        "title": "Composing the Anatomy of a Fall",
        "score": 31,
        "url": "https://www.reddit.com/r/TrueFilm/comments/1dpjytg/composing_the_anatomy_of_a_fall/",
        "content": "I can't post my entire write-up of Anatomy of a Fall because this sub doesn't allow images in posts, which is confounding in a sub discussing cinema, so I'm going to post an excerpt from it and a link to [the full theory posted on my profile page](https://www.reddit.com/user/IAmDeadYetILive/comments/1dpirca/composing_the_anatomy_of_a_fall/) (please read the full theory because this excerpt is a very small part of my analysis). In the theory I explain how the visuals allude to Samuel not committing suicide (that may seem obvious to some of you but a lot of viewers think he killed himself), detail the timing of the opening sequences leading to the discovery of Samuel's body, discuss the music and literature used in the film, how Sandra subtly influences Daniel, Snoop's presence on screen as another layer of the story, and... show possible evidence of MURDER! I'm going to limit this excerpt to the composition aspect.\n\nI know *Anatomy of a Fall* isn’t really about whether she did it or not; it’s primarily about the narratives Sandra and Daniel are forced to construct when facing the absurdity of the legal system, the sexism and biphobia she’s up against, the bloodlust of a public eager to demonize people they don’t know except through sensational press coverage, and the frailty and impressionability of human memory. However, the film is not only about the narratives we are forced to construct in order to vindicate ourselves publicly and in a court of law, but how we absolve ourselves of guilt and responsibility every day of our lives. It’s about the stories we convince ourselves of and we subtly influence others to believe, about who we are, what we’ve done, and what role we play in each other’s misery and misfortune, whether intentional or not. And, it’s a great *possible* murder mystery, one of the best in years. Who doesn’t want to figure out how Samuel died?\n\nOne of the things I love most about this film is how it’s also telling a story visually and through sound, that at times supports the dialogue and action on screen and at other times is in conflict with it. How do the visual puzzle pieces fit together to tell another layer of the story? On the surface, the film asks us to consider the question of Sandra’s innocence or guilt, but the deeper question asked of viewers is “what do your assumptions about what happened, based on what I’m showing you, say about *you*?” We are being asked to self-reflect from the beginning of the film. The first shot during Samuel’s autopsy is a doctor’s hand grabbing hold of an examination light, which he points directly into the camera. Perhaps we should examine ourselves before we make our judgements.\n\nDuring the police investigation at the house, we see a photo of Samuel on a bookshelf, surrounded by some interesting titles.\n\nHis photo sits atop a book by José Cabanis, the title upside down and illegible from any angle. José Cabanis was a French novelist, essayist, historian and magistrate. This is a likely part of Samuel and Sandra’s literary collection as she is a writer and he lectured at the nearby university and had dreams of being a novelist. The two other titles we can make out are *L'été meurt jeune* (*Summer Dies Young*) by Mirko Sabatino, and *Nés deux fois* (*Twice Born*) by Giuseppe Pontiggia.\n\nThe *L'été meurt jeune* title perhaps speaks to the death of Daniel’s childhood innocence. *Nés deux fois* is about a father with a disabled son, who blames himself for his son’s impairment, thinking he caused it by cheating on his wife while she was pregnant. He also burdens his wife with all the childcare. Here we have obvious parallels with the dynamics between Samuel and Sandra regarding Daniel’s blindness. Sandra initially blamed Samuel for not being where he was supposed to be when Daniel had his accident. Samuel felt immense guilt over this and took on the majority of Daniel’s care.\n\nThere is a scene in the book where the parents are intent on getting a photograph of their son on the beach, so the father positions him to take a perfect picture but the boy’s body won’t stay put, he keeps falling. Over and over and over again, he forces him back into position only for the boy to collapse. We can draw a parallel with how Daniel is trying to construct a particular story of what he heard and what he thinks happened, eventually creating the perfect picture that will exonerate his mother. He falters just like the boy on the beach keeps collapsing, ruining the story the father wants the picture to tell about his family. I also think Sandra is subtly influencing Daniel through the film, perhaps not even aware that she is doing so, “positioning” him to think of what happened in a way that benefits her.\n\nThere is also a line in the book: *“You must be as I want you, because only in this way can I have a relationship with you”* which pretty much sums up the conflict at the heart of Samuel and Sandra’s relationship. Sandra sees Samuel’s desire to have more time for himself as a non-issue, oblivious to the fact that him having more time depends on her taking on more responsibility, being reciprocal. “Twice Born” may also refer to the story of Samuel that is born through Sandra and Daniel in court, and the birth of Daniel from child to man of the house. Note in the final scene between Daniel and Sandra, it is he who cradles and comforts her, a role reversal.\n\nBecause it’s the father in *Nés deux fois* who hands off childcare and keeps trying to take the perfect picture, the parallel may not seem apparent at first, but consider that in *Anatomy of a Fall*, Sandra is in the role we historically associate with men, and Samuel is playing the role typically taken by women. How does that affect *our* perception of the relationship? If we listened to their recording with the roles reversed, with a man cheating on his wife, burdening her with the great majority of childcare (regardless that she initially wanted to, (s)he is now asking for help), belittling her for asking for more time for herself, then *hitting her*, we’d all say he was horribly abusive at least in that moment.\n\nThe reaction to *her* doing this is fascinating.\n\nI've read so many people saying Samuel was at fault, he's abusive and manipulative and resents her for being a strong, successful woman. She *is* a strong, successful woman and he *is* envious of her success, but she's also self-absorbed and dismissive of him. He is not blameless because even if his physical violence is only against himself or the house it creates a tense environment; she is right that he uses her selfishness and his fear of failure to justify never trying or carving out his own space, and she did move her entire life for him at the expense of what she wanted. In my opinion, it’s not really about who is right or wrong but instead about the expectations we have of each other and why so often familial responsibilities are unfairly divided, whether it’s the man or the woman.\n\nBut when she says to him *“I don’t believe in reciprocity in relationships”* what was your reaction to that? I thought wtf? In what world does an intimate or any kind of long-term partnership not involve reciprocity? To me, it sounded borderline sociopathic. She may have only been saying it because she was being stubborn in that moment, but again, imagine a man saying this to a woman who he has cheated on numerous times, is the primary caregiver to their child, and who is complaining she has no time to pursue her own ambitions. Does it hit differently? Ideally it would have the exact same effect no matter who is saying it, but I don’t think it does for many viewers.\n\nThis role reversal is another way in which the film asks us to examine our own biases and the stories we tell each other about who we are and the measure of our impact on those closest to us.\n\nMost of the film is about constructing a story about and around this impact. Through the film Daniel is learning to play a complex piano piece called *Asturias (Leyenda)* by Isaac Albéniz, this is symbolic of him learning how to tell a story, in effect he’s “learning the composition,” which he struggles with through most of the film. The first time we see Daniel at the piano, the camera slowly zooms forward on a picture of Samuel staring back at us.\n\n“*Leyenda” means* legend, another word for story. *Asturia (Leyenda)* was originally published by Albéniz in 1892 as *Prelude*, and was posthumously named *Asturia* (*Leyenda)* by a German publishing company. It was also posthumously included in the 1911 \"complete version\" of the *Suite española*, although Albéniz never intended the piece for this suite. In fact, the assigning of the new name may have been a mistake due to the fact that Albéniz actually wrote a different piece called *Asturias* which was lost. Described online “As part of *Suite española*, *Asturia (Leyenda)* does not reflect the geographical region to which the suite refers. *Asturias (Leyenda)*’s Andalusian Flamenco rhythms have little to do with the Atlantic region of Asturias.\" This speaks to the idea that Daniel’s current “composition” is misplaced within the story Sandra needs to tell in court.\n\nAround 35 minutes into the film his mother joins him at the piano and guides him to play something else. The film’s soundtrack lists this piece as Chopin’s *Prelude in E Minor Op. 28 No. 4.* Sandra wants Daniel to tell a different story, play a different song with her. Like the stories they’re constructing about Samuel’s death, currently the song they’re trying to play together sounds like two different compositions, not in sync, disharmonious. Daniel becomes frustrated and leaves the piano.\n\nThe description of this piece reads “*The piece is only a page long and uses a descending melody line. The melody starts with the dominant B and works its way to the tonic E, but halfway through the piece the descending line is interrupted and the melody starts over again. Only in the last bars does the melody dissolve in the tonic and go through a chord progression to the soothing and satisfying.*” This sounds a lot like the trajectory of how Sandra and Daniel compose their stories and in the end unify.\n\nAt 2:08 Daniel plays *Variations sur un Prélude*, making the piece his own as he eventually puts together the final story he tells in court.\n\n*Prelude* appears again in the film around 2 hours and 16 minutes. It’s quite brilliant, we can hear the clicking of a metronome as the notes are slowly and carefully played by an offscreen Daniel, over the visual of a reporter speaking on T.V. as a commotion from inside the courthouse moves outside. We don’t hear what the reporter is saying, we hear the metronome, the piano, Snoop drinking his water and then his heels clicking across the floor, the same sound that began the film. It then cuts to Daniel happily watching/listening to his mother on T.V. as she speaks to reporters about her victory in court. This conjunction of sound in the house with image outside the courtroom suggests Sandra and Daniel’s story is being “lapped up” as the court and the public move to their side. Daniel played his part of their duet perfectly.\n\nThe Chopin piece plays for a third and last time at the very end of the film as the credits begin, perfect this time and also non-diegetic, as Sandra cuddles with Snoop. Even if she did accidentally or intentionally push his father, or was merely witness to the emotional decline that led him there, Daniel needs his mother. So while Sandra’s story removes her from Samuel’s vicinity at the time of his death (which may or may not be true), thus absolving her of any responsibility, Daniel’s story cements for the court and public the reason for Samuel’s alienation and solitary action. Now the music is harmonious, not one missed note, but it also speaks to the pervading grief that is now part of their family’s story.\n\n“Hans von Bülow called the prelude \"suffocation\", due to its sense of despair. In fact, Chopin's last dynamic marking in the piece is *smorzando*, which means \"dying away\". It was also referred to as *\"Quelles larmes au fond du cloître humide?\"* (*\"What tears \\[are shed\\] from the depths of the damp monastery?\"*)”\n\n(Read full analysis with images [here](https://www.reddit.com/user/IAmDeadYetILive/comments/1dpirca/composing_the_anatomy_of_a_fall/)).\n\nEdit to add - Please follow the link and read the piece in full, people are responding without having read it in full and arguing points I haven't made. I know it's long, it's a detailed analysis, describing my journey through the film, everything I noticed from multiple perspectives, and the conclusions I come to based on my observations.",
        "num_comments": 36,
        "comments": [
            "I appreciate the rigor of this post but i think you yourself fell for the misogynistic red herrings in the subtext of the film (not saying you are a misogynist). \n\nCase in point is in your discussion or framing, its interesting how you havent at all noticed all the clear art direction choices made around the house that shows that Samuel was actually kicking holes in the drywall (by the kids room) and completely lagging ass in putting in insulation (with a steel studded roof like the one in the chalet this is a very simple process that shouldnt be taking endless days without progress and needing a hypermasculine soundtrack of PIMP). \n\nMe and the buddy i watched this with (both femmes) are in the building trades and we later reflected how both of us were really fixated on the obvious tells that this dude was just dithering because of how emotionally dysregulated he was and then trying to make it seem like the hard man work was oh-so-hard for him on top of his childcare and whatever he was saying his creative process was. \n\nIt seems more like the evidence youve perceptively traced, esp when coupled with the evidence of both physical destruction (serving no functional purpose and itself stalling the needed work on the chalet) and proof of Sam simply not doing the work (vis a vis the bare roof bays he somehow managed to not just slide the bats of insulation into over many weeks/months), actually augments the conclusion that he in fact did commit suicide. And that the inclusion of books (both hers previously published, his whatever it was gonna be before he self-murdered, as well as the ones on the shelves) merely serve to reinforce the idea that there was a prevailing mental environment of narratives (written and thought) that could serve to  reinforce a romantic story that places him in the center as a protagonist/victim, whether because thats in the subtext of the books you’re pointing out or because it would be a salacious true crime tidbit for the bloodthirsty public if so. \n\nAlso as someone who has had an experience in the past with suicidal ideation stemming from a brutal rejection/betrayal from what was thought of as a life-long partner, i spoke with some other people with similar experiences and we felt that the scene where the prosecutor is saying “this man is screaming about justice; is that the last thing a suicidal person would say? I think not” was the point where we were like “um, no actually, a thwarted appeal to justice is DEFINITELY something that could be the final straw to send someone struggling over the edge.” As in the notion that in Samuel’s mind, this is all just some act of feminine calculated cunning and Samuel is like “hey, time out, stop gaslighting me that im having emotional problems, can you just ‘act right’ (aka affirm my reality and completely change your pattern of behavior i find to be personally harmful and without merit).”\n\nFrom an evidentiary standpoint, there are multiple ways he could have jumped from the window or even slipped, but for her to have killed him required an almost john wick-like command of biomechanics to strike him and push him at the perfect time and angle. This reinforces the subtext of the fear and loathing of her not just as a powerful and unpredictable woman, but a *German* woman, with all the cultural stigma (esp french, post ww2; etc) that can be attributed to a person with german ancestry when foul play or violence is a possibility. I mean, the film that practically spells out the prejudicial notion that “oh the French people are just expressive and emotional, but the Germans are sneaky and evil and manichean.”\n\nFinally, it seems like you’re also missing the point that this is a French film and that the French film industry is notoriously misogynistic and has barely even begun to have its me too moment, because the cultural baggage of misogyny in France is so strong that you still have repeated in mainstream media and pop culture in france that the 50, 60, 70 year-old male rapist actors/directors/producers were just these passionate lovers doing what frenchmen do best and in fact the teenagers that they’re grooming and abusing, well they are actually just willing harlots who chose to get involved, knowing that it could advance their careers.\n\nNotice the symmetry here with a movie about an emotionally immature man who creates an abusive atmosphere, but then is centered as the victim protagonist when he is examined by a court of law within an infamous film industry where emotionally mature men who create abusive atmospheres are centered as the victim protagonist in the court of public opinion.\n\nEdit: spelling, clarity",
            "Perhaps you could take some time to clarify what you mean by “she accidentally killed him” in plain english rather than lashing out that the reddit-o-sphere hasnt given you your proper due with as close and careful a read as you feel you deserve. \n\nAs a writer, you should probably know that when people are supposedly misunderstanding something you’ve written - you are receiving information about ways your writing could have more clarity - lashing out by accusing them of “cherry picking” or “willfully misunderstanding you” is both childish and unprofessional. \n\nOr are we commenters who feel youve missed the mark also guilty of a grander conspiracy of willful cruelty and insensitivity to your hard emotional labor, much like Samuel.\n\nTime youve spent on a reddit piece doesnt entitle you to what you believe is an equal level of reciprocity. If you think people are gonna spend 10 hours reading and meditating on your piece, especially when it clearly has missing logical pieces and is more about your specific deep dive into one possible interpretation. Like, seriously, touch grass dude.",
            "I was very surprised to how people reacted to the movie. To me, the conclusion was fairly obvious but basically no one shared it:\n\nShe killed him, didn't mean to (non-premeditated murder), the kid knows her mother killed his dad but convinces himself of a lie in order to not have to live the shitty shitty shitty life that truth would bring him. He chooses a murderous mom over the truth.\n\nFor me, the center of the movie was the kid learning to deal with the lying world of adults where truth doesn't matter and everyone is just making up stories. He sees that the truth (mom killed dad) will land him in a life of suffering, and chooses a lie instead. I think he does this knowingly, to the extent that a kid can reason through these things.\n\nI agree that the guy definitely didn't jump out of the window, that's just a silly way to commit suicide, it never held water for a second in my viewing of the movie.\n\nI thought that *the movie was gaslighting me* into not believing the obvious: no one commits suicide by jumping less than 10 meters into snow. What if you don't die and your kid comes back home to find you a wailing, barely alive mess of sinew, muscle and bone? Nah, never bought it for a second.\n\nFor me, it was especially interesting to make the movie about the kid in my mind, how he realizes that he's actually and agent in all this, and that in the end the choice will be his. The adults in the movie are all fairly pathetic beings. \n\nThe kid is amazing and takes responsibility for life and death on his hands and makes the pragmatic choice.",
            "Just wanted to say that this is an excellent comment. Really nice breakdown of how the film touches on misogyny, and how it's reflected in audience response.",
            "> From an evidentiary standpoint, there are multiple ways he could have jumped from the window or even slipped, but for her to have killed him required an almost john wick-like command of biomechanics to strike him and push him at the perfect time and angle.\n\nWhat? Wait. This implies she *tried* to murder him. She could've just wanted to hit him or hurt him and the death was unintended. I don't think OP was arguing for premeditated murder, more like violent manslaughter.",
            "*Case in point is in your discussion or framing, its interesting how you havent at all noticed all the clear art direction choices made around the house that shows that Samuel was actually kicking holes in the drywall (by the kids room)*\n\nI didn't miss it, I mention his violence against himself and the house and that he played a role in her torment, too. Maybe you didn't read to the end of the piece?\n\nIt's difficult to \"appreciate the rigor of \\[my\\] post\" when you haven't actually read it.\n\n*Me and the buddy i watched this with (both femmes) are in the building trades and we later reflected how both of us were really fixated on the obvious tells that this dude was just dithering because of how emotionally dysregulated he was and then trying to make it seem like the hard man work was oh-so-hard for him on top of his childcare and whatever he was saying his creative process was.*\n\nI'm getting the impression you skimmed through what I wrote because I said he was using her as an excuse to not try or carve out his own space.\n\n*Also as someone who has had an experience in the past with suicidal ideation stemming from a brutal rejection/betrayal from what was thought of as a life-long partner,*\n\nWelcome to the club.\n\n*i spoke with some other people with similar experiences and we felt that the scene where the prosecutor is saying “this man is screaming about justice; is that the last thing a suicidal person would say? I think not” was the point where we were like “um, no actually, a thwarted appeal to justice is DEFINITELY something that could be the final straw to send someone struggling over the edge.” As in the notion that in Samuel’s mind, this is all just some act of feminine calculated cunning and Samuel is like “hey, time out, stop gaslighting me that im having emotional problems, can you just ‘act right’ (aka affirm my reality and completely change your pattern of behavior i find to be personally harmful and without merit).”*\n\nI mentioned that after Sandra's lawyer paints Samuel as suicidal and in despair, Sandra says to him \"That was not Samuel.\" Even in court, all odds stacked against her *and at the risk of the prosecutor hearing her,* she felt so strongly about how inaccurately Samuel was being portrayed that she was compelled to speak against it. Sandra objected to this portrayal of Samuel because it wasn't the full picture. I'm saying the \"suicide\" (note the quotation marks) Samuel suffered was his emotional decline and that Sandra played a part in that. Even the director/writer of the film says the central core of the film is about the idea of reciprocity. He is part of her torment, she is a part of his.\n\n*From an evidentiary standpoint, there are multiple ways he could have jumped from the window or even slipped, but for her to have killed him required an almost john wick-like command of biomechanics to strike him and push him at the perfect time and angle.*\n\nHere's an idea. I spent probably 30 hours in total writing this piece, maybe you could take 20 minutes to read it in full before responding? When I say MURDER in the first paragraph, it's because I'm hoping to get people to fully engage with the analysis. **My conclusion is that there is no murder**, and that she is telling the truth. If you had read what I wrote, you'd know that.\n\n*This reinforces the subtext of the fear and loathing of her not just as a powerful and unpredictable woman, but a German woman, with all the cultural stigma (esp french, post ww2; etc) that can be attributed to a person with german ancestry when foul play or violence is a possibility. I mean, the film that practically spells out the prejudicial notion that “oh the French people are just expressive and emotional, but the Germans are sneaky and evil and manichean.”*\n\nI love how you claim I've fallen for misogynistic red herrings when you've cherry picked tiny parts of what I wrote and paint my entire perspective with them.\n\n*Finally, it seems like you’re also missing the point that this is a French film and that the French film industry is notoriously misogynistic and has barely even begun to have its me too moment, because the cultural baggage of misogyny in France is so strong that you still have repeated in mainstream media and pop culture in france that the 50, 60, 70 year-old male rapist actors/directors/producers were just these passionate lovers doing what frenchmen do best and in fact the teenagers that they’re grooming and abusing, well they are actually just willing harlots who chose to get involved, knowing that it could advance their careers.*\n\nIt's not relevant to the film, nor my analysis. If that's a subject you feel strongly about (I do too) please write your own piece about how its relevant to the story in Anatomy of a Fall.\n\n(continued in next comment)",
            "I'm lashing out because I asked you to read my piece in full before replying? You obviously didn't read it and are unwilling to admit that.\n\nI don't expect 10 hours, I do expect at least a full reading, one that takes longer than it takes you to write out a lengthy response in which you argue with positions I haven't even taken.\n\nAnd I did explain what I meant, in quite a lot of detail.\n\nEdit - spelling",
            "I like the theory that he tripped on the dog's ball.  I think it's the very first thing you see, the ball rolling down the stairs.  Then later the kid is playing with the dog using a different toy.",
            "I entertained the idea that she may have accidentally killed him but came to a different conclusion in the end.",
            "I didn't argue that there was any manslaughter. Did anyone read my piece in full?\n\nMy conclusion is that it wasn't murder and that she is telling the truth."
        ]
    }
}