{
    "IMPORTANT: We Need To Talk About The Content Policy...": {
        "title": "IMPORTANT: We Need To Talk About The Content Policy...",
        "score": 219,
        "url": "https://www.reddit.com/r/TrueUnpopularOpinion/comments/ncm4ou/important_we_need_to_talk_about_the_content_policy/",
        "content": "The Reddit Admins have messaged us and have brought it to our attention that several posts in violation of the Content Policy had been either gone unnoticed or were allowed to remain.\n\nIn light of this, we are going to be more strict regarding violating content in the future. Furthermore, we have added extra measures to decrease the amount of content that will be allowed to slip through the cracks.\n\nPlease understand that all subreddits on Reddit are required to follow these rules in order to be allowed to exist.\n\nAs a reminder, **any** of the following will be considered a violation, and is **not permitted**:\n\n* **Advocating for, justifying, glorifying, or encouraging violence towards ANY group or person** except in self-defense (includes defending or advocating for corporal punishment for children)\n* Stating or implying that **certain races or protected groups are genetically or inherently less civilized, less intelligent, more violent, or otherwise inferior as compared to others** (includes mentioning racial crime, intelligence, responsibility, accomplishment, or competency differences without also presenting further context that explains that the differences are not due to inherent or genetic superiority or inferiority)\n* **Making any statement or implication that has the effect of denigrating LGBTQ+ people**, including:\n   * Stating or implying that trans (wo)men aren't (wo)men or that people aren't the gender they identify as\n   * Criticizing, mocking, disagreeing with, defying, or refusing to abide by people's pronoun requests\n   * Stating or implying that gender dysphoria or being LGBTQ+ is a mental illness, a mental disorder, a delusion, not normal, or unnatural\n   * Stating or implying that LGBTQ+ enables pedophilia or grooming or that LGBTQ+ individuals are more likely to engage in pedophilia or grooming\n   * Stating or implying that LGB should be separate from the T+\n   * Stating or implying that gender is binary or that sex is the same as gender\n   * Use of the term tr\\*nny, including other spellings of this term that sound the same and have the same meaning\n* Criticizing, mocking, or expressing contempt towards any protected or vulnerable group based on their identity in a manner that denigrates the group\n* **Making negative statements or generalizations about a demographic or protected group** (i.e. \"<People of a certain race> are violent\") or making positive statements or generalizations about a non-protected group in a manner that implicitly or explicitly excludes protected groups or is not meant to apply to other groups (i.e. \"White people are civilized\")\n* Advocating for the removal of rights or privileges from a demographic or protected group in a manner that would leave them with less rights or privileges than the general population (unless doing so in a manner that solely advocates for people to be punished for crimes or immoral actions)\n* Utilizing slurs in a derogatory manner\n* Stating or implying that racism, sexism, homophobia, transphobia, or other forms of hate or misgendering are justified, should be acceptable, or aren't hateful\n* Arguing that the age of consent should be below 18, or otherwise stating or implying that pedophilia or grooming should be acceptable\n* Advocating in favor of rape or engaging in victim-blaming against rape victims\n* Initiating or participating in brigades against other subreddits\n* Agreeing with any user saying something in violation of these rules\n* Posting spam/unsolicited self-promotional content or [threatening, harassing, or bullying](https://support.reddithelp.com/hc/en-us/articles/360043071072) a user\n* Posting sexually suggestive content involving minors or posting involuntary pornography\n* Encouraging users to communicate or do anything that would violate any of these rules\n\nAs a separate reminder, please **remember to follow Rule 4 - Keep discussion civil.**\n\n**Personal attacks, insults, name calling, mocking, or other forms of rudeness are not permitted, NO MATTER HOW MUCH THE OTHER USER DESERVES IT.**",
        "num_comments": 408,
        "comments": [
            "Note: Some of the comments on this post are outdated, because this post occasionally gets edited in light of new information",
            "My thoughts.\n\n1. I appreciate the mods efforts - I know it isn't easy to run a sub like this where you're getting pressure from the users on one side and Reddit on the other.\n\n2. Reddit's policy as listed above, is obviously racist and sexist, based on its protected vs unprotected classes.  The same racist statement that will get you censored or banned becomes just fine and will probably be upvoted once you redirect it at white people.\n\n3. Aside from sexism and racism, it is just bad all around.  In 1901, WEB Dubois, the first black Harvard PhD, earned in sociology, wrote a book called the Philadelphia Negro, in which he talked about the challenges facing the black community.  Not just this book, but any detailed discussion of its points would be banned on Reddit.\n\n For a more recent example, in  2008 as a Presidential candidate, Obama gave a father's day speech supported by statistics in which he specifically told black fathers that they needed to do more to improve the outcomes of their (black) children.  I believe this speech, or any detailed discussion of it, would be banned as well.\n\n4. Having \"protected\" and \"unprotected\" classes will absolutely be abused and in fact I know it is already been abused by trans activists.  You should be on the lookout for people posting false and even sexist and racist arguments that, if you refute it, will get you banned.\n\n Trans example:  Someone says that trans children should be given puberty blockers.  Well, what exactly is a trans child?  You can't have that discussion, because it will invariably involve trying to figure out who is trans and who isn't.  (Even if you're a pediatrician, or it's your own child.)\n\n Race example:  Someone says white people are responsible for most hate crimes against asians.    Based on Reddits policies, virtually anything you do to try to refute this point will get you banned.\n\n5. Complaining on reddit may be easy and might feel good but in the end it doesn't do much.  Contact your state attorney general, which is likely an elected position, and ask them if it is acceptable for a company to have a set of rules that protects certain sexes and races and not others to operate in their state.  For extra points, do it publicly, and let the opposing party know what you are doing, and they can use it in their election campaigns.",
            ">As a reminder, any of the following will be considered a violation, and is not permitted:\n\n* Truth\n\n* Fact\n\n* Reality",
            "⠀⠀⠀⠀⠀⠀⠀⣠⡀⠀⠀⠀⠀⠀⠀⠀⠀⢰⠤⠤⣄⣀⡀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢀⣾⣟⠳⢦⡀⠀⠀⠀⠀⠀⠀⢸⠀⠀⠀⠀⠉⠉⠉⠉⠉⠒⣲⡄ ⠀⠀⠀⠀⠀⣿⣿⣿⡇⡇⡱⠲⢤⣀⠀⠀⠀⢸⠀⠀⠀1984⠀⣠⠴⠊⢹⠁ ⠀⠀⠀⠀⠀⠘⢻⠓⠀⠉⣥⣀⣠⠞⠀⠀⠀⢸⠀⠀⠀⠀⢀⡴⠋⠀⠀⠀⢸⠀ ⠀⠀⠀⠀⢀⣀⡾⣄⠀⠀⢳⠀⠀⠀⠀⠀⠀⢸⢠⡄⢀⡴⠁⠀⠀⠀⠀⠀⡞⠀ ⠀⠀⠀⣠⢎⡉⢦⡀⠀⠀⡸⠀⠀⠀⠀⠀⢀⡼⣣⠧⡼⠀⠀⠀⠀⠀⠀⢠⠇⠀ ⠀⢀⡔⠁⠀⠙⠢⢭⣢⡚⢣⠀⠀⠀⠀⠀⢀⣇⠁⢸⠁⠀⠀⠀⠀⠀⠀⢸⠀⠀ ⠀⡞⠀⠀⠀⠀⠀⠀⠈⢫⡉⠀⠀⠀⠀⢠⢮⠈⡦⠋⠀⠀⠀⠀⠀⠀⠀⣸⠀⠀ ⢀⠇⠀⠀⠀⠀⠀⠀⠀⠀⠙⢦⡀⣀⡴⠃⠀⡷⡇⢀⡴⠋⠉⠉⠙⠓⠒⠃⠀⠀ ⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠁⠀⠀⡼⠀⣷⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⡞⠀⠀⠀⠀⠀⠀⠀⣄⠀⠀⠀⠀⠀⠀⡰⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⢧⠀⠀⠀⠀⠀⠀⠀⠈⠣⣀⠀⠀⡰⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
            "This website went to shit a long time ago and the only reason I'm still using it is that there's really no alternative. This place was one of the last sensible places left and now it's gone too. Sad. If anyone knows any good reddit alternatives, please tell me what they are. Ruqqus is full of self proclaimed neo nazis so it's an echochamber just like reddit but just for a different audience. Thus it isn't really a valid alternative. Chan imageboards are nice and I use them a lot but they can't fill the same hole as reddit either due to their disorganized, anonymous nature. Reddit could really use some more competition but trying to start a rivalling site with more tolerance for a wider array of political views probably wouldn't be very profitable in today's political climate.",
            "You either die the hero or live long enough to see yourself become the villain. Just shut down the subreddit.",
            "Doesn't this kinda defeat the purpose of this sub?",
            "[removed]",
            "It's been amazing watching reddit die these last few years.",
            ">Generalizing groups in a way that speaks positively of non-protected groups specifically or speaks negatively of protected groups (i.e. \"White people are smart\" or \"Black people are violent\" would not be allowed)\n\nIsrael has a right to exist.... am I banned?"
        ]
    },
    "Joe Biden looked great last night.": {
        "title": "Joe Biden looked great last night.",
        "score": 848,
        "url": "https://www.reddit.com/r/TrueUnpopularOpinion/comments/1dqknnd/joe_biden_looked_great_last_night/",
        "content": "Everyone is saying how awful Joe Biden did in the debate, but he was alive. His skin didn’t look rotten at all and his movement was pretty fluid. He stood up all by himself and didn’t even need a recasting of his necromancy spell. What more do you want from the man?!",
        "num_comments": 447,
        "comments": [
            "For him to blink more than once ever five minutes",
            "He looked and talked like a hospice patient whose family was told it's time to gather around.",
            "He answered all the questions! -actual praise he got from his wife after the debate.",
            "He had a pulse! Great news!",
            "Oh come on man, that’s a bunch of malarkey!  And that’s… what we’ve done……… got the…………….. homeless……………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………\n^Medicare",
            "He sounded almost coherent at times!",
            "Yeah, they really went all out on last night's Biden clone",
            "The fact that CNN of all places is saying Biden had a “disastrous debate” proves everything.",
            "He beat Medicare! Good for him I guess.",
            "Jokes aside I wonder if there is anything that can be done in terms of him stepping down and having someone else run? He's clearly compromised in some way."
        ]
    },
    "Biden performance wasn’t a surprise at all": {
        "title": "Biden performance wasn’t a surprise at all",
        "score": 73,
        "url": "https://www.reddit.com/r/TrueUnpopularOpinion/comments/1dr1fgo/biden_performance_wasnt_a_surprise_at_all/",
        "content": "I’ve been seeing clips of him acting as he did last night for the past 2 years. The only people who are surprised are all the brainwashed libs who ate up all the “cheap fake” and “he’s the best president ever”. If you were surprised you should consider where you get your information ",
        "num_comments": 43,
        "comments": [
            "I'm actually shocked that people were shocked at what bad shape he's in.",
            "My favorite is looking at all the headlines from news outlets from the past weeks/months saying Biden is doing fine and all those gaffes are just lies and right wing propaganda, and then from this morning that are all like holy shit.  If you only get your news from NYT or WaPo, this very well could have hit you like a ton of bricks.",
            "\"I just assumed that everything that is said about the democrats must be a lie cause they are all definitionally the good guys, man that stutter has really gotten worse over the years.  Welp blue no matter who as they say\"\n\nThe party told you to reject the evidence of your eyes and ears. It was their final most essential command.   Obviously calling things a 1984 is very overdone but god dammit if they didn't do a 1984 on this one.",
            "uhh he's actually writing sonnets in private trust me bro",
            "I actually didn’t expect him to be that bad but it’s funny that the media is surprised he came off as an old man when we’ve been expressing concerns about his age for years and all they did was gaslight us.",
            "Both were exactly how I expected",
            "What SHOULD be the takeaway here?  The White House, half the elected politicians, and staffers lied to America for years.  Then, they canceled and gaslit anyone who stood by what they saw. \n\nJesus..",
            "\"I can't believe we just saw that happen\" so they won't. Again and again and again. Living in complete denial,  as always!\n\nWe tried telling you, but you're so much smarter than us \"basket of deplorables\" and \"smelly Walmart shoppers.\" Good luck in your safe space, and be sure to install a sump pump there to remove all of those liberal tears. TRUMP 2024  ULTRAMAGA",
            "It wasn’t a surprise because we’ve seen him have these mental lapses quite a few times over the last couple years. \n\nThat said, to see the sitting president not be able to put 3 coherent sentences together and shit himself in front of the whole world was a stunning, watershed moment.",
            "The betting market 10 point swing during the debate is evidence that priors were being adjusted for new information."
        ]
    },
    "If you only just realized Biden is senile then you seriously need to reevaluate your trust in the media": {
        "title": "If you only just realized Biden is senile then you seriously need to reevaluate your trust in the media",
        "score": 363,
        "url": "https://www.reddit.com/r/TrueUnpopularOpinion/comments/1dqninn/if_you_only_just_realized_biden_is_senile_then/",
        "content": "It's been FUCKING OBVIOUS for YEARS that Biden has a major cognitive impairment, yet there are seemingly millions of people who only just admitted this to themselves when CNN finally told them so after the debate.\n\nThe primary reason people bought into this falsehood instead of trusting their own eyes is because of the media's BLATANT LIES about Biden being \"at his best.\"  If you still trust a word of what the mainstream media tells you, then it's time to wake up and stop being taken for a fool.",
        "num_comments": 211,
        "comments": [
            "Yeah like I consider myself to be pretty solidly left wing and it's insane to me that it's considered left wing these days to swallow the official line wholesale these days",
            "It's actually scary how much power the MSM has over the masses. \n\nDon't blindly trust \"the experts\". Make up your own mind based on the data.",
            "It’s so surreal to see The president of THE UNITED STATES be some senile old man who can barely string two words together. \n\nLike how are you guys chill with that 💀",
            "Yea I've heard people saying that they thought that it was just political mud slinging.   I have no idea under what rock they have been living.",
            "I think most knew deep down the cognitive decline thing was real, but before this, the left leaning propagandist types had some wiggle room to deny it. \n\nNow it’s in their face and too obvious to push back against.",
            "I would argue that they need to reevaluate their basic critical thinking skills. I have basically accepted the fact that the media is feeding us bullshit. Blind trust in the media also implies a lack of critical thinking.",
            "I will admit that yesterday was the worst I think he's ever truly been on TV.  Usually you see him slip or and stumble a bit but low key the look he had on his face yesterday was not one I've seen and that was a look of an old lost guy in the middle of Disney World at times looking for his grandchildren.",
            "it's reddit, it is a delusional informational bubble.",
            "This is a case of the emperor has no clothes. \n\n\nSo many people live in their bubbles and refuse to even acknowledge that there's the possibility that they could be wrong. They have such disdain and hatred for the other side they refuse to even acknowledge a word that is spoken. \n\n\nAnd then at some point good old Joe wanders out into full public view and is standing naked and is Stark raving mad",
            "It's been painfully obvious for several years that President Biden is dealing with progressing vascular dementia. It's sad to watch him struggle to get his point across. You can't help but feel bad for him. \n\nThe people who should feel truly ashamed of themselves are his family, for not intervening in his best interest when he decided to run again, and the media, who did everything they could to downplay or outright conceal his OBVIOUSLY DETERIORATING mental acuity."
        ]
    },
    "The debate is all the proof you need the media is lying to you and Biden's supporters are completely disconnected from reality.": {
        "title": "The debate is all the proof you need the media is lying to you and Biden's supporters are completely disconnected from reality.",
        "score": 338,
        "url": "https://www.reddit.com/r/TrueUnpopularOpinion/comments/1dqm9p1/the_debate_is_all_the_proof_you_need_the_media_is/",
        "content": "For months on end now Biden's supporters, backed by most major media organisations, have been denying the obvious reality.\n\nWe have been told over and over and over again ad nauseam that suggestions of Biden's mental competency and age-realted decline were \"misinformation\" or a \"conspiracy\".\n\nPeople have been pointing this out day in and day out and his supporters have just denied the obvious reality.\n\nWe just recently had his press secretary complain about deep fakes of his gaffes. She assured the media he was fit and sharp. Even when challenged by journalists in the press room she doubled down.\n\nHis wife went on record saying he is as \"sharp as he has ever been\".\n\nI made a post here just a few weeks ago pointing out how bad his decline was only for hordes of delusional supporters act like this was all just political spin.\n\nThe media should *never* be trusted again. If you trust them after this you are a moron.\n\nWe told you. We told you over and over and over again. You looked reality on the face and flatly denied it.",
        "num_comments": 487,
        "comments": [
            "This whole election is a total clusterfuck. Trump & Biden should be at home watching \"The Price Is Right\" & napping.",
            "If the democrats will vote for anyone who runs against trump anyway, why are they insisting on this fossil?",
            "Sadly maybe he is indeed “ sharp as he’s ever been”",
            "People hate Trump so passionately they are blind to anything else",
            "The only ones surprised by Biden’s performance on debate night were Democrat voters.  Makes you really wonder why.",
            "\"The debate is all the proof you need the media is lying to you and Biden's supporters are completely disconnected from reality.\" \n\nYes, I'll just add that this is not a new reality today. This has been going on for the 3 years B's been in office and the year+ before the last election.",
            "I think what you fail to understand is that there are almost zero actual \"Biden Supporters\".  There are just people who think that the mediocrity of Biden is still far better than the absolute dumpster fire of Trump.  Biden could sit in the oval office, stare at the wall and drool for 4 years doing absolutely nothing and it would still be preferential to Trump",
            "Tribalism. Tribalism everywhere.",
            "I mean it's not really a surprise that many Democrats, and Redditors by extension, are deriving all their talking points from establishment sources that prop up the career politician this country has grown to hate. Anyone who says Biden is mentally well should really touch some grass and do soul searching because the corporations you claim to stand against have sold you a bridge.",
            "\nAmerica has 2 wholly inappropriate candidates for president. \n\nOne seems kinder than the other but neither are fit to be running. \n\nI have a lot of sympathy. But I also fear for you guys  and the world if Trump wins again. His last stint weakened the status of America and emboldened America’s rivals. I can only fear what his next one would do."
        ]
    }
}