{
    "Sokak Köpekleri Sorunu - Kişisel Görüşler Megathread": {
        "title": "Sokak Köpekleri Sorunu - Kişisel Görüşler Megathread",
        "score": 11,
        "url": "https://www.reddit.com/r/Turkey/comments/1d162sq/sokak_köpekleri_sorunu_kişisel_görüşler_megathread/",
        "content": "Merhaba r/Turkey üyeleri,\n\nSon zamanlarda sokak köpekleri konusu gündemde ve hepimiz farklı bakış açılarıyla bu konuyu tartışıyoruz. Ancak, bu tartışmalar bazen kirliliğe neden olabiliyor. Bu durumu kontrol altına almak ve tartışmaları daha verimli hale getirmek amacıyla bu megathread'i oluşturduk.\n\nLütfen Dikkat Edin:\n\n* Bu başlık altında sokak köpekleri konusuyla ilgili tüm görüşlerinizi paylaşabilirsiniz.\n* Sokak hayvanları konusunda sadece haber niteliği taşıyan ve aktif bir politikayı veya politikadaki değişimi ifade eden haber gönderilerine izin verilecektir. Kişisel görüş, yorum ve tartışmalarınızı bu megathread altında yapmanızı rica ediyoruz.\n* Amacımız, konunun daha düzenli ve anlaşılır bir şekilde tartışılmasını sağlamak ve topluluğumuzdaki kirliliği önlemektir.\n\nKuralları unutmayalım:\n\n* **Saygı ve Nezaket**: Herkesin fikrine saygı duyalım. Kişisel saldırılardan ve hakaretlerden kaçınalım.\n* **İnsan Onuruna Saygı**: Sokak hayvanlarına yönelik yasadışı şiddeti teşvik etmeyin, normalleştirmeyin veya onaylamayın. Yasal ve meşru devlet eylemleri önermekte serbestsiniz (ör. devlet kontrolü altındaki bir itlaf önerisi), fakat vatandaşın bireysel şiddete başvurmasını önermeyin, banlanırsınız.\n* **Kaynak Belirtme**: Haber niteliğinde bir bilgi paylaşıyorsanız, güvenilir kaynaklarla destekleyin.\n* **Konu Dışına Çıkmayın**: Bu başlık altında sadece sokak köpekleri konusuyla ilgili paylaşımlar yapın. Diğer konular için uygun başlıkları kullanın.\n\nGörüşlerinizi, önerilerinizi ve sorularınızı buradan paylaşabilirsiniz.\n\nKatkılarınız için teşekkür ederiz!\n\nr/Turkey Moderasyon Ekibi",
        "num_comments": 131,
        "comments": [
            "Geçtiğimiz birkaç ay önce yengeme istanbul atasehirde sokak köpekleri saldırdı. Kafa derisini parçalayıp tek gözünü kör ettiler. Melek gibi bir insandır kendisi. Söyleyeceklerim bu kadar. Hayatta kaldığı için şükrediyoruz. Siz olsaydınız ne düşünürsünüz?",
            "Hepsi itlaf edilmeli. Başka bir çözümü yok.",
            "Sokakta kopek olmaz, dunyayin en uysal kopekleri olsalar bile hastalik ve hijyen bakimindan olmaz. Bu kopekler her tarafa diskilarini ve idrarlarini yapiyor, cocuklarimizin oynadigi parklar dahil.\n\nBugun Turkiye'de itlaftan baska care yok, bu da bu milletin  baska bir rezilligi. Itlaf ettikten sonra, sahipli kopeklere zorunlu cip takilmasi lazim ve belediyelerin hic bir sekilde sokaklarda kopek birakmamasi lazim.",
            "**İtlaf edilmeli arkadaşlar**, yüzyıllardır süre gelmiş bir şey bu. Madem başka bir çözüm yolu vardı neden yıllardır bulunamadı? Bu konu yeni değil yıllardır konuşulan bir şey, madem başıboş sokak köpeklerini çok seviyorsunuz itlaf kararı çıktıktan sonra 30 gün içinde sahiplenin. **Son 28 ayda 172 insan sokak köpekleri tarafından öldürüldü**, insanlar çocuğunu çoluğunu, yaşlısını sokağa çıkaramıyor, söyleyin hangi ülke bu kadar ilkel, Hindistan falan mı? Evimin arka sokağına giremiyorum çünkü 20-30 tane köpek var, sokaklar insanlara ait değilse ne anlamı var? Bu ittaparlar ya gerçekten bizimle taşşak geçiyorlar yada Cihangir, Beşiktaş gibi yerlerde yaşayıp evde besledikleri köpeklerden başka köpek görmüyorlar. Arkadaşlar bi köpeği yalnızca evde tutabilmek için bile onlarca aşı yapmanız gerekiyor, o aşıları bir insan olarak size yapsalar siz bile etrafta mal mal dolaşan bişeye dönüşürsünüz. Bu ülkenin en büyük sorunlarından biri **Başıboş Sokak Köpekleri.**   \n  \nKediler adamdır beyler, ne sokağa sıçarlar ne de millete saldırırlar.",
            "sayıları 10 milyonu aşan köpeklerin barınaklara alınma dönemi bitti geçti, tek çözüm itlaf.",
            "Köpeklerle ilgili Türkçe sub var mı?  \nr/kopek yasaklanıp kapatılmış.",
            "6 kere saldırıya uğradım artık köpek görünce yol değiştirmeli gibi hissediyorum",
            "#sokak köpekleri bir sorun değildir. asıl sorun sokak köpeklerinin yaşam alanlarını düzenlemeyen, onlara gereken bakımı sağlamayan yöneticilerdir.",
            "O kadar köpeği kısırlaştırmak için memleketin bütün veterinerlerinin işi gücü bırakıp aylarca buna çalışması lazım. Masrafı da ortada. İnsan hayatı daha önce gelir temizlenmeli.",
            "Önce insani sayılabilecek yollar değerlendirilmeli, insan olarak diğer canlılara karşı sorumluluklarımız var? Sadece insanı önemsemek iki yüzlü geliyor, insanı karşısında hayvanın hiçbir değeri olmadığını açıklayabilecek birisi varsa beklerim. Nefret kusan kitle ile sahiden çözüm yolları arayanları ayırabilmekten bahsetmiyorum bile."
        ]
    },
    "Adam kendine köle arıyor galiba": {
        "title": "Adam kendine köle arıyor galiba",
        "score": 80,
        "url": "https://i.redd.it/nfoxcql7fi9d1.jpeg",
        "content": "İlanda yazanlar çok anormal değil mi sizce?",
        "num_comments": 28,
        "comments": [
            "İş ilanın siyasi görüşü var kendine kuma arıyor.",
            "İlanı yazmadan önce bir 31 çekip öyle yazaymış",
            "Eskort sitesinde mi nerede buldun bunu",
            "Adamın aradığı partnerden gerçek beklentisi ilana yazılmamış ama satır aralarından bangır bangır bağırıyor.",
            "9-19, 6 gün, asgari ücret… Suriyeli ya da Gürcü alabilir ancak işe…",
            "\"erkekten mesaj gelen kişiler başvuru yapamaz\"",
            "Bu nedir ya 😂 Nasıl insanlarla yaşıyoruz şu ülkede yareppiğm",
            "Feriha'nın annesi gündelik giderken bile bu kadar şeyi yoktu bu ne",
            "Bu adam bir de müfettiş. Kamunun durumu.",
            "Bu sanki başka bir şey arıyor gibi ama neyse"
        ]
    },
    "Turkish medicine students ignored Islamist faculty member's homophobic censorship attempt during the Hippocratic Oath": {
        "title": "Turkish medicine students ignored Islamist faculty member's homophobic censorship attempt during the Hippocratic Oath",
        "score": 677,
        "url": "https://v.redd.it/rqk3tvwjqc9d1",
        "content": "",
        "num_comments": 69,
        "comments": [
            "mükemmel mükemmel amk nası susuyor hoca orda keyfe geldim aq",
            "Şu paçavra kafaların 28 Şubat 28 Şubat diye ağlayıp en ufak güç kırıntısı ellerine geçince tirana dönüşmelerinden bıktım dostlar",
            "If she can read and comprehend what she read, she will understand there is no need to censor but we don't have people with this much capacity in administration seats. It's only stating that I will look after all humans no matter what. It's not even a controversial statement. \n\nOkuyup, okuduğunu anlasa o ibarenin çıkarılmasını gerek olmadığını anlayacak ama nerede bizde öyle siyasal islamcı? \"Hoşgörü dini İslam\" sözüne ne büyük zarar verdiğini de anlayacak. Yeminde kim olursa olsun tüm insanlara bakacağım diyor.",
            "Cinsel yönelim ayırmama kısmı kaldırıldığında bir doktor sadece eşcinsellere bakıyorum dese ne tepki verirler acaba? Hipokrat yeminin anlamını ve işlevini bile kavrayamamış insanların üniversitelere dekan yapıldığı yerde eğitimin çökmesi kadar doğal bir şey olabilir mi?",
            "buna artik radikal bi cozum gerekiyor. oyle %1'lik adamlar degil ozgur ozel cikip diyecek ki kardesim akp'nin kayitli 10 kusur milyon uyesi var. hepsinin ismi cismi tc nosu adresi belli. sadece bu kisilerden vergi alarak devleti finanse edeceksiniz. ne sgk'dan ne devlet hastanesinden ne de devletin herhangi bir hizmetinden faydalanmak istemiyoruz. bize oy veren veya bu rezalete dur demek isteyen herkesi de chp uyesi olmaya davet ediyorum. biz de kendimizi finanse edecegiz ama sizden farkli olarak siyasi gorusune, etnik kimligine, cinsel yonetimine vs bakmadan herkese hizmet edecegiz. devlet icine devlet. hodri meydan recep 2 paralik serefin varsa kabul edersin. yok oyle kancik orospu cocugu gibi psikolojik harp yoluyla radikal islamcilik oynamak.",
            "Amk Beyin Yoksunu 22 Yılın Özeti Rezil İnsan ! Güzel göt olmuş.",
            "Böyle bir haber beklemiyordum. Az da olsa iyi şeyler yaşanıyor he",
            " Hocamızı boşu boşuna töhmet altında bırakmaya gerek yok. Orijinal halinde zaten daha sonra geliyor cinsel yönelim kısmı belki de kadın söyleyecekti? Cinsel yönelim lafına takacak kadar islamist bir tip olsa zaten baş örtüsü de takardı.",
            "This is blatant political grandstanding",
            "Ex-Muslims from muslim majority countries are thinks they are secular, nice and cool. I think they are just woke."
        ]
    },
    "Alexis Tsipras visits Ekrem Imamoglu in Istanbul": {
        "title": "Alexis Tsipras visits Ekrem Imamoglu in Istanbul",
        "score": 46,
        "url": "https://x.com/imamoglu_int/status/1806710269155905728",
        "content": "",
        "num_comments": 31,
        "comments": [
            "Ula Ekrum ne yazdın anlaşılmıyor",
            "Diplomatically beneficial relationships, I see. Keep going!",
            "son zamanlarda vites arttırdı dünya lideri lehamdülillah",
            "gavur ekrem yunanla görüştü 😡😡 halbuki sürekli savaşla tehdit etmesi gerekiyordu!!",
            "arap akraba yerine yunan akrabayı tercih ederim. yüzyıllarca birlikte yaşamışız, dil ve din hariç her şeyimiz ortak. sen arap birliği üyeliği hayallerine devam et, türkiye muasır medeniyetler seviyesine ulaşma yolunda daima ilerleyecek",
            "Bir sonraki cumhurbaşkanımız erken seçimle çok ileri olmayan bir tarihte Ekrem İmamoğlu olacak. Rum,Yunan,Laz yönetmesin diyen Türkçü Turancılar %2 alan sosyal medya partileriyle tekrardan bir hezimete uğrayacaklar.",
            "Sende onu paylaşıp duruyorsun, senin sorunun ne güzel insan? Biraz Mevlana sözü paylaş sen önce.",
            "ikiside tercih etmiyorum şahsen,  kardeş veya akraba olarak gördüğüm tek devlet Azerbaycan ve Azeri(Türk) halkıdır, Yunanistan kardeşim değildir",
            "Araplar ve Farslarlada 100yillarca birlikte yasadik, yunanlarla beraber olman seni muasir medeniyetler seviyesine nasil çikaracak? Yunanlilarin ellerine firsat geçse ilk yapacaklari seni barbarca Anadoludan kovmak, zaten 100 yil önce bunu yapacaklardi, Izmiri Manisayi Selanigi onlar yakti. Sizin su Avrupa yalakaligi en az bazi kitlenin Arap hayranligi kadar kötü.",
            "2023 seçimlerindede aynısı söylüyordunuz sonra gidip dedenizi aday yaptınız hatta o sizin çok değerli \"bir sonraki cumhurbaşkanınız\" ben KKyi satamam, istanbul daha önemli diyip köşesine çekilmişti 🤣💀"
        ]
    },
    "Karadeniz kasveti (cevabı pek kimse bilemedi gerçi) ": {
        "title": "Karadeniz kasveti (cevabı pek kimse bilemedi gerçi) ",
        "score": 69,
        "url": "https://www.reddit.com/gallery/1dqwbkf",
        "content": "",
        "num_comments": 23,
        "comments": [
            "İlk Ukrayna sandım fakat bu kadar yeşillik fışkırması Ukrayna ve Polonya'nın kuru yeşilliğine benzemiyordu, burası nemden dolayı çok canlı çünkü burası Karadeniz.",
            "Bu Karadenizliler böyle güzel yerlerde yaşayıp sonra gelip İstanbul'un anasını siktiler ",
            "sis zamanı karadeniz dağlarında böyle melankolik bir ortam oluşuyor cidden, özledim",
            "Tam korku filmi çekilmelik ortam",
            "İşte bu yüzden karadeniz en güzel yer bence, bu resimlerdeki yerlere benzer yerleri aynı hava durumunda ziyaret etmiştim kastamonudayken. buralara gelirseniz kulaklığınızı takın, yüksek sesli sözsüz nostaljik deepwave bir müzik dinleyin ve yürüyüşünüzü yapın, doğa hariç hiçbirşey yok neredeyse.",
            "karadenize bir kere gitme şansım oldu keşke kafa insanlarla tekrar gidebilsem. İnanılmaz yeşil bitki örtüsü var neredeyse her zamab toprağın kahverengisinden çok yeşilini görüyorsunuz havası ayrı temiz sisi ayrı güzel ne bileyim asıkoldum ve bunu bir bursalı olarak söylüyorum",
            "Bu yaz nasip olursa yine bi 2k rakım üstü yapıp deniz gibi görünen bulutları izlerim.\n\nMümkünse tüm karadenizi bombalayın ama 1k rakım altını bombalayın. 1k üstü her şey güzelleşmeye başlıyo.",
            "Antalyada da böyle yerler var genel olarak.",
            "Kasvet mi? Ben böyle havalarda daha mutlu oluyorum. Tepende seni yakan bir güneş yok, it gibi gereksiz yere terlemiyorsun, havadaki sis yüzünü nemlendiriyor ve bir ferahlama geliyor, aldığın nefesler daha bir lezzetli oluyor, çeşitli kuş sesleri sana huzur veriyor...",
            "Merak etme artık hepsini yavaş yavaş Araplara satıyorlar."
        ]
    }
}