{
    "Sokak Köpekleri Sorunu - Kişisel Görüşler Megathread": {
        "title": "Sokak Köpekleri Sorunu - Kişisel Görüşler Megathread",
        "score": 8,
        "url": "https://www.reddit.com/r/Turkey/comments/1d162sq/sokak_köpekleri_sorunu_kişisel_görüşler_megathread/",
        "content": "Merhaba r/Turkey üyeleri,\n\nSon zamanlarda sokak köpekleri konusu gündemde ve hepimiz farklı bakış açılarıyla bu konuyu tartışıyoruz. Ancak, bu tartışmalar bazen kirliliğe neden olabiliyor. Bu durumu kontrol altına almak ve tartışmaları daha verimli hale getirmek amacıyla bu megathread'i oluşturduk.\n\nLütfen Dikkat Edin:\n\n* Bu başlık altında sokak köpekleri konusuyla ilgili tüm görüşlerinizi paylaşabilirsiniz.\n* Sokak hayvanları konusunda sadece haber niteliği taşıyan ve aktif bir politikayı veya politikadaki değişimi ifade eden haber gönderilerine izin verilecektir. Kişisel görüş, yorum ve tartışmalarınızı bu megathread altında yapmanızı rica ediyoruz.\n* Amacımız, konunun daha düzenli ve anlaşılır bir şekilde tartışılmasını sağlamak ve topluluğumuzdaki kirliliği önlemektir.\n\nKuralları unutmayalım:\n\n* **Saygı ve Nezaket**: Herkesin fikrine saygı duyalım. Kişisel saldırılardan ve hakaretlerden kaçınalım.\n* **İnsan Onuruna Saygı**: Sokak hayvanlarına yönelik yasadışı şiddeti teşvik etmeyin, normalleştirmeyin veya onaylamayın. Yasal ve meşru devlet eylemleri önermekte serbestsiniz (ör. devlet kontrolü altındaki bir itlaf önerisi), fakat vatandaşın bireysel şiddete başvurmasını önermeyin, banlanırsınız.\n* **Kaynak Belirtme**: Haber niteliğinde bir bilgi paylaşıyorsanız, güvenilir kaynaklarla destekleyin.\n* **Konu Dışına Çıkmayın**: Bu başlık altında sadece sokak köpekleri konusuyla ilgili paylaşımlar yapın. Diğer konular için uygun başlıkları kullanın.\n\nGörüşlerinizi, önerilerinizi ve sorularınızı buradan paylaşabilirsiniz.\n\nKatkılarınız için teşekkür ederiz!\n\nr/Turkey Moderasyon Ekibi",
        "num_comments": 131,
        "comments": [
            "Kimseye cevap vermeden kendi gorusumu paylasmak istiyorum.  \nBiz senelerce Bakirkoy'de oturduk, milyonda bir gordugumuz tv habeleri disinda bizim sokak kopeklerinin hepsinin kulaginda kupe var ve sokakta sereserpe yatarlar. AVM kapisi olsun, ptt nin onu olsun, Migros tezgahini  alti olsun... 2 metre hayvanlar yazin sicakta nerde golge bulsa kimseye zarar vermeden gezer otururlar. Saniyorum belediye de besliyor(zaten kisirlastirmis), Bakirkoyun Allah sevdalisi\\*! kullari da garibanlara bir kap yemek su veriyor.\n\nAyrica Canakkaleliyiz, gittigimde kopekler yine kulaklari kupeli , Canakkale otogarin icinde uyuyor ne kimse host diyor ne de kopekler kimseyi rahatsiz ediyor.\n\nSimdi Allah'in daginda Sivasin koylerinini vs tenzih ederek konusuyorum,\n\nBelediyeleriniz senelerce bu duruma bir el atmamis, yasa bile varken bu kopekleri korumaya almamis, hatta hepimiz Turkiyeliyiz biliyoruz ki yasaya uydum diyen anadolu belediyesinin ne kadari bunu sadece kagit uzerinde yapmistir hepimiz biliyoruz. Ilceye Itfaye araci aldim diye kendisine makam arabasi ceken baskandan dusun sen.\n\nSiz bu insanlari sectiniz, belki bu belediyelerin yillik cay, lokum, fistik gideri bir barinagin giderinden daha fazlaydi, ve simdi gelip,  toplu kiyimdan baska care yok diyorlar.\n\nAllah zalimin cezasini verisin insallah.\n\nGazaba ugrayan insanlarda lutfen bizim memleketlere gelmesin, kuruyo mu noluyo kendi memleketinde dursun.",
            "Geçtiğimiz birkaç ay önce yengeme istanbul atasehirde sokak köpekleri saldırdı. Kafa derisini parçalayıp tek gözünü kör ettiler. Melek gibi bir insandır kendisi. Söyleyeceklerim bu kadar. Hayatta kaldığı için şükrediyoruz. Siz olsaydınız ne düşünürsünüz?",
            "Hepsi itlaf edilmeli. Başka bir çözümü yok.",
            "Sokakta kopek olmaz, dunyayin en uysal kopekleri olsalar bile hastalik ve hijyen bakimindan olmaz. Bu kopekler her tarafa diskilarini ve idrarlarini yapiyor, cocuklarimizin oynadigi parklar dahil.\n\nBugun Turkiye'de itlaftan baska care yok, bu da bu milletin  baska bir rezilligi. Itlaf ettikten sonra, sahipli kopeklere zorunlu cip takilmasi lazim ve belediyelerin hic bir sekilde sokaklarda kopek birakmamasi lazim.",
            "**İtlaf edilmeli arkadaşlar**, yüzyıllardır süre gelmiş bir şey bu. Madem başka bir çözüm yolu vardı neden yıllardır bulunamadı? Bu konu yeni değil yıllardır konuşulan bir şey, madem başıboş sokak köpeklerini çok seviyorsunuz itlaf kararı çıktıktan sonra 30 gün içinde sahiplenin. **Son 28 ayda 172 insan sokak köpekleri tarafından öldürüldü**, insanlar çocuğunu çoluğunu, yaşlısını sokağa çıkaramıyor, söyleyin hangi ülke bu kadar ilkel, Hindistan falan mı? Evimin arka sokağına giremiyorum çünkü 20-30 tane köpek var, sokaklar insanlara ait değilse ne anlamı var? Bu ittaparlar ya gerçekten bizimle taşşak geçiyorlar yada Cihangir, Beşiktaş gibi yerlerde yaşayıp evde besledikleri köpeklerden başka köpek görmüyorlar. Arkadaşlar bi köpeği yalnızca evde tutabilmek için bile onlarca aşı yapmanız gerekiyor, o aşıları bir insan olarak size yapsalar siz bile etrafta mal mal dolaşan bişeye dönüşürsünüz. Bu ülkenin en büyük sorunlarından biri **Başıboş Sokak Köpekleri.**   \n  \nKediler adamdır beyler, ne sokağa sıçarlar ne de millete saldırırlar.",
            "Köpekçi tayfaya sorular,\n\nSen sivrisinekleri kısırlaştırıyor musun? Çok üredi diye sıçanları fareleri veya benzer diğerlerini kısırlaştırıyor musun?  Civcivler bunlara mama olsun diye canlı canlı kıyma makinelerine giriyorlar bunlardan haberin var mı? Köpekleri bu diğer hayvanlardan ayıran fark ne?Sevimli olmaları mı?\n\nHer sene ölen çocuklardan haberin var mı? Her sene kaç kediyi parçalıyorlar, kaç kuş öldürüyorlar biliyor musun? Üzerlerinde taşıdıkları parazitleri etrafa nasıl yayıyorlar farkında mısın?\n\nİnsanlar kıt kanaat geçinirken 80 m2 lik evlerde en az 4 kişi yaşarken nereye koyacaklar köpekleri? İçin bulunduğun ülkenin farkında değil misin?",
            "Dünyanın hiç bir medeni ülkesinde sokaklarda yırtıcı hayvanların bu şekilde cirit attığını göremezsiniz. Bu hem insan sağlığına hem de bölgenin biyo çeşitliliğine çok zararlı. Ülkede sincap kalmadı mesela, biyo çeşitlilik derken bundan bahsediyorum. \n\nKısırlaştırıp sokağa salmak bundan 10 yıl önce çözüm olabilirdi. Ancak o zaman itperest kesim “sen kendini kısırlaştır, onun da senin kadar yavrulama hakkı var hem ben onun yavrusunu seninkinden çok seviyorum” diye yaklaşarak konunun bu şekilde çözülmesini engelledi. Bu süre içerisinde de artık sokak köpeklerinin sayısı kısırlaştırmayla kontrol altına alınabilecek seviyeyi çoktan geçti.\n\nŞu anda bu işin çözümü toplatılıp sahiplenilmeyen hayvanların uyutulması. Eğer şimdi bu yapılmazsa 10 yıla insanlar kendi imkanlarıyla itlafa başlayacaklar.\n\nBirazcık kenar mahallelerde yaşamak zorunda olan. İşine veya okuluna gitmek için zifiri karanlıkta servisine veya toplu taşımaya yürümek zorunda olan genç, yaşlı, çoluk, çocuk sayısız insanla empati yapın.",
            "Otanazi uygulanmalı ancak tek basina bir cozum degil , uzun vadeye odaklanan cozumler yapilmali \n\nAcip biraz arastirdiginizda sadece otanazi ile bu sorunu cozmenin cok cok zahmetli cok cok masrafli ve imkansiza yakin oldugunu gorebilirsiniz , niye derseniz bu hayvanlar uremeye devam ettigi surece yerleri hizlica doluyor , komunite bilgisi olanlar bunu gayet iyi bilir. \n\nBen hicbir gorusun fanatigi vs degilim , insanlarin hayatini kaybetmesi hosuma falan gitmiyor ama uzun vadede en dogrusu neyse o yapilmali , barinaklar cok masrafli ve cozum kesinlikle degil kaldi ki o hayvanlar orda fazlasiyla aci cekiyor sıkış tıkış lanet yerlerde , adi uzerinde barinak bu huzurevi degil. \n\nE dogru ne derseniz , otanazi ve kisirlastirmayi birlikte yurutmek , sahiplendirme politikalarini arttirmak. Otanazi dediginiz is oldukca efor isteyen bir iş kopegi yakalamak her zaman kolay olmuyor , ayrica asıl olay kopegi yakalamak yakaladiktan sonra uyutmak ve asilamak ayni islem sayilir , nasil isledigini acip okuyabilirsiniz. \n\nBu konuda gorev devlete belediyelere dusuyor ama isini dogru sekilde yapan olmadigi icin bu sorunun cozulmesi cok zor , yıllardir tek bir asilama bile yapmayan sayisiz belediye var yuzlerce...\n\nSimdi gelip insanlar hayatini kaybediyor acilen yok edilmesi lazim kopeklerin vs diyeceksiniz , soyle bir durum var. Bu kopekleri yok edebilirsiniz ama kopeklerin yeri doluyor anasini satayim , yapmayalim demiyorum basarili olamayacagiz diyorum bakın romanyaya , zaten sonuc vermeyecek bir şeyi inatla uygulama trendi zamanla solar farklı goruslerin aninda ortaya atildigini bizzat otanazi tek cozum diyenlerden ( muhtemelen) goreceksiniz, uzun lafin kisasi mantikli olan politikayi uygulamadigimiz surece bu sorunla basbasa kalmaya devam edecegiz \n\nYorumunuz varsa tartisabiliriz",
            "Bu konuda iyi bir yazı okumuştum. Bazı aklımda kalan ve katıldığım kısımlar şöyle : \n\n\\* Köpeklerin yanı ne doğa ne de insanların yaşadığı şehirler. Köpeklerin yaşam alanı İNSANLARIN YANI, İNSANLARLA BERABER YAŞAMAK. Bu çok önemli bir ayrıntı. Biz köpeklerin yaşam alanını aldık diyorlar. Bu günü bilinen köpek türlerinin hepsi üretilmiş, insanların ihtiyacına göre melezlenmiş türler. Hiç biri doğada olmayı bilmediği gibi, şehirler de doğal alanları değil. Doğal alanları İNSANLARLA BERABER YAŞAMAK. Evimizde, bahçemizde bizimle olmaları. Evimizin dışındaki sokak değil. İlerideki çocuk parkı değil. Ötedeki rekreasyon alanı değil. Evinize alıp bakmıyorsanız, yanlış yapıyorsunuz. \n\n\\* Şehirlerdeki köpeklerin toplam yaşam süresi ortalama 4 yıl civarında. Yetersiz beslenme, hastalıklar, kavga ve kazalardan kaynaklı yaralanmalar ve sakatlıklar gibi sebeplerden dolayı yaşam süreleri çok kısa. Şartları çok kötü. Birbirlerine de zarar veriyorlar, güçsüz olanlar zaten hayatta hiç kalamıyor. Besleyenler, daha güçlü olanların diğerlerini ezmesine katkıda bulunuyor. \n\n\\* Gelişmiş ülkelerin neredeyse hepsinde sistem aynıdır. Hayvan sahibi olmak bazı kurallara tabidir. Hayvanlar kayıt altına alınır. Sokakta hayvan bulunursa sahibine ciddi cezalar verilir. Toplama merkezlerinde de hayvanlara geçici bir süre (en fazla bir kaç ay) bakım verilir ve sonrasında sahiplenen olmazsa uyutulur. Sokaklarda sürüler halinde hayvanlar yoktur. Şehir, insan yaşam alanıdır. ŞEHİR İNSAN YAŞAM ALANIDIR. Bunu unutmayın. Gidip x bir hayvanın yaşam alanına şehir dikilmemeli ancak şehirlerdeki hayvan sürüleri de normal değil. \n\n\\* Besleyip, büyüttüğünüz sokak hayvanları her gün kavgalara karışıyorlar, yemek için mücadele ediyorlar. Şartları iyi değil. Ben burada (maalesef) ciddi bir vicdan otuzbiri olduğunu düşünüyorum. \"Üstüme düşeni yaptım oh\" deniliyor. O hayvanı gerçekten düşünen biri sahiplenir, evine ve bahçesine alır. Aksi halde o hayvanların boktan yaşantılarına destek vermiş oluyorsunuz. \n\n\\* Saldırıya uğrayan sayısız insanı saymıyorum bile. \"Onlar da köpeklere birşey yapmıştır\" tartışmasına hiç girmeyeceğim. En basitinden çevremdeki en büyük hayvanseverlerden biri olan eniştem 3 sene önce ilçe merkezindeki meydanda sabaha karşı saldırıya uğradı. Bacakları diş izleriyle doluydu. Bana kimse maval anlatmasın.",
            "sayıları 10 milyonu aşan köpeklerin barınaklara alınma dönemi bitti geçti, tek çözüm itlaf."
        ]
    },
    "Turkish medicine students ignored Islamist faculty member's homophobic censorship attempt during the Hippocratic Oath": {
        "title": "Turkish medicine students ignored Islamist faculty member's homophobic censorship attempt during the Hippocratic Oath",
        "score": 311,
        "url": "https://v.redd.it/rqk3tvwjqc9d1",
        "content": "",
        "num_comments": 25,
        "comments": [
            "Mezunların yolu açık olsun.\n\nhttps://preview.redd.it/a8zrm5h2pe9d1.jpeg?width=1170&format=pjpg&auto=webp&s=1d92c2b541224c2eb3a6196230dd8e2bf8860597\n\nGüya kağıttan okuyan hocaları nasıl bir ego zedelenmesi yaşadıysa kutlamaları iptal edip getirilen atıştırmalıkları kaldırmış. Velilerin ise mezunlar ile fotoğraf çekmesi engellenmiş ve güvenlik tarafından çıkartılmışlar. [haber link](https://www.gercekgundem.com/guncel/hipokrat-yeminine-sansur-dekan-yardimcisi-yemini-sansursuz-okuyan-ogrencileri-salondan-cikartti-467260)",
            "Şu paçavra kafaların 28 Şubat 28 Şubat diye ağlayıp en ufak güç kırıntısı ellerine geçince tirana dönüşmelerinden bıktım dostlar",
            "mükemmel mükemmel amk nası susuyor hoca orda keyfe geldim aq",
            "W\n\nhttps://preview.redd.it/wyvllj0lif9d1.png?width=385&format=pjpg&auto=webp&s=b038601e88503726e8cbc640f942704963b69d23",
            "If she can read and comprehend what she read, she will understand there is no need to censor but we don't have people with this much capacity in administration seats. It's only stating that I will look after all humans no matter what. It's not even a controversial statement. \n\nOkuyup, okuduğunu anlasa o ibarenin çıkarılmasını gerek olmadığını anlayacak ama nerede bizde öyle siyasal islamcı? \"Hoşgörü dini İslam\" sözüne ne büyük zarar verdiğini de anlayacak. Yeminde kim olursa olsun tüm insanlara bakacağım diyor.",
            "Helal olsun size çocuklar!",
            "buna artik radikal bi cozum gerekiyor. oyle %1'lik adamlar degil ozgur ozel cikip diyecek ki kardesim akp'nin kayitli 10 kusur milyon uyesi var. hepsinin ismi cismi tc nosu adresi belli. sadece bu kisilerden vergi alarak devleti finanse edeceksiniz. ne sgk'dan ne devlet hastanesinden ne de devletin herhangi bir hizmetinden faydalanmak istemiyoruz. bize oy veren veya bu rezalete dur demek isteyen herkesi de chp uyesi olmaya davet ediyorum. biz de kendimizi finanse edecegiz ama sizden farkli olarak siyasi gorusune, etnik kimligine, cinsel yonetimine vs bakmadan herkese hizmet edecegiz. devlet icine devlet. hodri meydan recep 2 paralik serefin varsa kabul edersin. yok oyle kancik orospu cocugu gibi psikolojik harp yoluyla radikal islamcilik oynamak.",
            "Offf helal be sizlere!",
            "This is blatant political grandstanding",
            "Ex-Muslims from muslim majority countries are thinks they are secular, nice and cool. I think they are just woke."
        ]
    },
    "Karadeniz kasveti (cevabı pek kimse bilemedi gerçi) ": {
        "title": "Karadeniz kasveti (cevabı pek kimse bilemedi gerçi) ",
        "score": 15,
        "url": "https://www.reddit.com/gallery/1dqwbkf",
        "content": "",
        "num_comments": 2,
        "comments": [
            "İlk Ukrayna sandım fakat bu kadar yeşillik fışkırması Ukrayna ve Polonya'nın kuru yeşilliğine benzemiyordu, burası nemden dolayı çok canlı çünkü burası Karadeniz.",
            "İşte bu yüzden karadeniz en güzel yer bence, bu resimlerdeki yerlere benzer yerleri aynı hava durumunda ziyaret etmiştim kastamonudayken. buralara gelirseniz kulaklığınızı takın, yüksek sesli sözsüz nostaljik deepwave bir müzik dinleyin ve yürüyüşünüzü yapın, doğa hariç hiçbirşey yok neredeyse."
        ]
    },
    "Türkiye'deki uyuşturucu kullanımının haritası.": {
        "title": "Türkiye'deki uyuşturucu kullanımının haritası.",
        "score": 370,
        "url": "https://i.redd.it/h9fqm3rrxa9d1.jpeg",
        "content": "Cengiz Erdinç'in, 'Overdose Türkiye' kitabında paylaştığı grafikte metamfetamin kullanımın bir senede bir çok ilde iki katına çıktığı görülüyor. Hatta beş katına çıkan dâhi var (Burdur).\n\nİçişleri Bakanlığı tarafından yayımlanan [2021](https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://www.narkotik.pol.tr/kurumlar/narkotik.pol.tr/TUB%25C4%25B0M/Ulusal%2520Yay%25C4%25B1nlar/NARKOLOG-2022-MADDE-KULLANICILARI-PROFIL-ANALIZI.pdf&ved=2ahUKEwiRx_innv6GAxVvX_EDHUOXA1cQFnoECB0QAQ&usg=AOvVaw0oAHPslmaxdbue7exadwwC) ve [2022](https://www.narkotik.pol.tr/narkolog-2023-profil-analizi-yayinlanmistir) Narkolog raporlarına göre ülkemizde her yıl metamfetamin kullanımı artmakta. Kullanıcılar Metamfetamini, %98 ortalama ile ya arkadaş çevresinden temin ediyor ya da satın alıyor. Sık bir şekilde kullanılmaya başlanan yaş ise 21. Kullananların %65'i uyuşturucu suçundan işlem görmüş.\n\nGençlerimizin karşı karşıya kaldığı en büyük sorunlardan biri uyuşturucu kullanımı. Bu yüzden sizlerle de paylaşmak istedim. 2021-2 yıllarında İçişleri Bakanı Süleyman Soylu idi. Öylesine bir bilgi.",
        "num_comments": 95,
        "comments": [
            "Aydın is the new Albequerque.",
            "Tokat'ta aşırı fazlaydı yav bizim lisede 9. Sınıf bi oğlan vardı abi sigara içecem kapıda durun dedi tamam dedik girdi içeri iki dakika oldu olmadı tuvaletten bi çıktı götü başı ayrı oynuyor pustun o halini görünce anladık ne vurduğunu deneme kağıdına üç tane sigara sardım diyor yalancı götelek",
            "Türkiye eskiden transit ülkeydi şimdi pazarın kendisi oldu teşekkürler siyasal islam.",
            "samsun ve uşakta ülkü ocakları büyük yatırımlar yapmışlar anladığım kadarıyla",
            "Peki ne kadar saflıktaymış? Bir arkadaş soruyor da. \n\nAyrıca her gün interpol tarafından aranan birileri vs yakalanıyorken bunun şimdiki verilerinin daha düşük olması lazım :q\n\nSonuçta Soylu büyüklerimizden kim kaldı?",
            "devletin gizlice ulkeye sokup sattirdigi bir yerde nasil dusuk olmasi bekleniyor",
            "Karaman'da ayık gezen yok amına koyayım",
            "Köyde dağa taşa işeyenler de var. Bazi iller daha yüksek çıkabilir.",
            "Ot yasallaşırsa meth ve bonzai gibi pislikler azalır/biter mi acaba?",
            "Bay beyaz..."
        ]
    },
    "Doğru mu bu? Denemeye değebilir ama bana ne ben içmiyorum içen herkese takacam": {
        "title": "Doğru mu bu? Denemeye değebilir ama bana ne ben içmiyorum içen herkese takacam",
        "score": 186,
        "url": "https://i.redd.it/gv9qjy0ema9d1.jpeg",
        "content": "",
        "num_comments": 45,
        "comments": [
            "Merhaba! Görünüşe göre bir sorunuz var. Paylaşımınız kaldırılmadı, ancak artık Türkiye ile ilgili olsa bile güncel konularla ilgili olmayan sorulara izin vermiyoruz. Sorunuz bu kriterlere uymuyorsa sorunuzu r/AskTurkey'de paylaşmalısınız. Teşekkür ederiz.\n\nHi there! It looks like you have a question. This is not a removal message, but we no longer allow questions that are not related to Turkey and are not up to date. For a better chance of getting your question answered, we recommend posting it in r/AskTurkey. Thank you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Turkey) if you have any questions or concerns.*",
            "Yılmaz?",
            "Açıkçası garip ve acı çektirici duruyor.",
            "Ben çok üzüldüm neden bilmiyorum",
            "Fetişi vardır q",
            "Adam sigara içmemek için kolunu da kırmış.",
            "Belki çalıştı, belki adamı sinir krizi yada benzere soktu",
            "Bunlar yarrak kafesiyle fantezi de yapıyordur orospu çocuklari",
            "Yılmaz?",
            "Sinir bozucu olur bence"
        ]
    }
}