{
    "Generally accepted TV placement procedures. Quick reference guide.": {
        "title": "Generally accepted TV placement procedures. Quick reference guide.",
        "score": 1529,
        "url": "https://www.reddit.com/r/TVTooHigh/comments/12tg0o2/generally_accepted_tv_placement_procedures_quick/",
        "content": "Lots of people posting lately asking “Is this too high?” so here is a quick guide on what is generally accepted TV placement procedure (GATPP) as seemingly defined by this subreddit.\n\n\n- If the TV is above the fireplace, IT IS TOO HIGH.\n- If the TV is angled down, IT IS TOO HIGH.\n- If the TV is mounted to the wall above a TV stand, and the clearance between the stand and TV is equal to, or greater than ONE vertical PS5, IT IS TOO HIGH.\n- If when standing the TV is at eye level, IT IS TOO HIGH.\n\nNow let’s look at some opposite GATPP use cases.\n\n- If the TV is in a bedroom and meant to be viewed from the bed, IT IS PROBABLY NOT TOO HIGH.\n- If the TV’s only viewing position is in the reclined state, IT IS PROBABLY NOT TOO HIGH.\n- If you are at a sports bar, IT IS PROBABLY NOT TOO HIGH.\n- If the TV is at eye level when sitting down, IT IS PROBABLY NOT TOO HIGH.\n- If the TV is in the kitchen it is more for listening, mounted high as to avoid any splashes or spills, IT IS PROBABLY NOT TOO HIGH.\n- If the TV is purposely mounted higher to keep out of range of a toddler, you’re a parent so your neck already hurts and IT IS PROBABLY NOT TOO HIGH.\n\nI hope this helps clear up some questions. If you have any other rules to add, please comment below.",
        "num_comments": 130,
        "comments": [
            "This should be pinned and a rule pointing to it",
            "I will also add that kitchen tvs are an exception like households with toddlers.\n\nThe kitchen tv is more for listening than watching, and you want it away from splashes and spills. The only remaining space is up.",
            "Maybe everyone should start hanging their tv’s high to balance out the neck strain from looking down at your phone all day",
            "This should be put in the about and adapted into rules for the sub",
            "GATPP? Is OP an accountant? 😂\n\nGreat post. Mods should pin this to the top of the sub.",
            "This was a hilarious post. But this is a weird sub.",
            "I only disagree the toddlers rule. The tv is more important. Find a way to keep chlildren far from tv.",
            "if i can’t put the TV above the fireplace i can’t put it anywhere lol.",
            "The tv in my living room would definitely be considered high in this sub but the only furniture I have is a recliner. So when I’m in the recliner it does end up being at eye level cos I’m looking up… is that fine?",
            "the ultimate rule: if the top 1/3 line of the tv meets your eyeline, without you needing the to bend your neck up or down, it is probably a good placement. (1/3rd line is my threshold, anyone can correct what that should be)"
        ]
    },
    "My friends put their tv in front of the fireplace": {
        "title": "My friends put their tv in front of the fireplace",
        "score": 120,
        "url": "https://i.redd.it/lsi6319obf9d1.jpeg",
        "content": "They don’t use the fireplace. I think that was the right move. ",
        "num_comments": 30,
        "comments": [
            "I do this with my TV as well, it’s larger than that one and it almost entirely covers the fireplace - works perfectly! \n\nThe fireplace is entirely unused, I suppose if I did need to use it in an emergency I could just rearrange the tv haha",
            "It totally works. Especially if you don’t use it.",
            "If they eventually get a bigger TV and a new TV stand to go with it nobody will even think about how it's in front of a fireplace.",
            "And we have a winner 🏆",
            "Blocking Santa’s entrance? Naughty boy",
            "Thank your friends from all of us.",
            "does the tv have amazon fire?",
            "Why are you posting this here?",
            "This is where those transparent TVs would be epic! 🔥",
            "On a family dollar tv stand. Asinine"
        ]
    },
    "Just mounted this (ignore the cable)": {
        "title": "Just mounted this (ignore the cable)",
        "score": 389,
        "url": "https://i.imgur.com/G4eGt9b.png",
        "content": "",
        "num_comments": 201,
        "comments": [
            "My friend… the cable is only PART of the problem",
            "Bro what’s up with the height of the door knob",
            "Are you sure your Hobbit necks can look up that high?",
            "You like your TVs like your door knobs, too high.",
            "What is this, a door for ants?!?!",
            "# (ignore the cable)... but I can't.",
            "It will be awesome as long as you never plan on sitting down.",
            "Might as well buy a hot air balloon to watch it",
            "Is another tv supposed to go under that?  Like what's the deal here?..  🤔",
            "how can you lounge with TV that high?"
        ]
    },
    "Yeah but that tv tho": {
        "title": "Yeah but that tv tho",
        "score": 13,
        "url": "https://v.redd.it/5lmvsrq79c8d1",
        "content": "",
        "num_comments": 6,
        "comments": [
            "I think this video has been posted here at least 10 times",
            "This dude 5000% designed or heavily invested in whatever that is",
            "kids would smash that thing if it is any lower.",
            "That's not an excuse to put your TV that high. Just teach your kid how to behave. If your kid becomes a thrower, height isn't really going to protect it. A kid can smash a TV at any height.",
            "I’m gonna agree here. My tv has always been low around the kids, you definitely want earthquake straps just in case. But a couple good corrections and they’ll leave the tv alone even as toddlers",
            "Soundbar is chin level"
        ]
    },
    "Had to post this monstrosity!": {
        "title": "Had to post this monstrosity!",
        "score": 6,
        "url": "https://i.redd.it/ujyfb0daji9d1.jpeg",
        "content": "Saw it today!",
        "num_comments": 1,
        "comments": [
            "Push the furniture with the aquarium below the tv"
        ]
    }
}