{
    "Oq acharam do cancelamento do gato galático? Faz sentido ou a glr ta viajando demais?": {
        "title": "Oq acharam do cancelamento do gato galático? Faz sentido ou a glr ta viajando demais?",
        "score": 482,
        "url": "https://i.redd.it/2erflkorob9d1.jpeg",
        "content": "",
        "num_comments": 858,
        "comments": [
            "Obrigado por contribuir para o r/Twitter_Brasil!\n\nNosso sub está crescendo muito rápido, por isso podemos não conseguir monitorar todos os comentários. Caso leia algo que quebre nossas regras, denuncie para que nossos moderadores consigam agir com maior rapidez.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Twitter_Brasil) if you have any questions or concerns.*",
            "Se for o meu leite tudo bem",
            "Sdds de qndo gato galáctico escrevia cueio (o anime) 😞✊",
            "alguem explica\n\nedit:estou mais perdido que criança no shopping sem os pais",
            "Leite cru é ilegal? Nem sabia disso",
            "Nunca vi nada dessa cabra além das abobrinha que ele tá metido. Anos atrás ele entrou de cabeça no mundo das NFTs, vendendo foto de macaco pro público criança.\n\nDepois entrou no mundo das arte de IA, acho que não deu em nada\n\nDepois virou fanático religioso e começou a meter umas dog whistle bizarra de nazismo\n\nOu a esposa dele, alemã, que no dia do ANIVERSÁRIO DO HITLER, coloca uma cena dos bastardos inglórios com uma suástica totalmente em evidência. \n\nPode ser coincidência total. Mas são dezenas de coincidências estranhas pra caralho",
            "Vou encher um copo com a minha porra e ver se ele bebe",
            "Pra quem não entendeu, historicamente o leite é associado à supremacia branca, como um objeto que representa a pureza e superioridade genética da raça ariana. Recentemente ele voltou a ser usado na internet com esse mesmo intuito, então postar uma foto bebendo um copo de leite é um apito de cachorro pra neo Nazi. \n\nPra quem perguntou do leite cru, é o leite que não é pasteurizado, ou seja, vem direto da teta. Tem gente que afirma que ele é mais natural e por isso melhor pra saúde, mas isso é burrice. A pasteurização não retira nutrientes, mas elimina o risco de zoonoses transmitidas pelo leite, como a brucelose",
            "Off Topic: a porra desse leite amarelo grotesco que o gato tá tomando. Negócio parece tinta de parede.",
            "Que porra é leite cru? Onde o gato galatico foi nazista? Q porra ta acontecendo? Alguem me explica"
        ]
    },
    "Ajoelhou tem que rezar ": {
        "title": "Ajoelhou tem que rezar ",
        "score": 758,
        "url": "https://i.redd.it/nk7oou8d549d1.jpeg",
        "content": "",
        "num_comments": 170,
        "comments": [
            "Obrigado por contribuir para o r/Twitter_Brasil!\n\nNosso sub está crescendo muito rápido, por isso podemos não conseguir monitorar todos os comentários. Caso leia algo que quebre nossas regras, denuncie para que nossos moderadores consigam agir com maior rapidez.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Twitter_Brasil) if you have any questions or concerns.*",
            "O que os piá vão mamar nesse banheiro não tá escrito",
            "Pq cristão acha que é algum ser único no mundo e mais especial que quem nao é?",
            "Tá seguindo a onda de: \"Igreja não paga imposto\"",
            "Vai rolar muito sexo anal com culpa.",
            "É um pessoal que pensa ser uma sociedade paralela, exclusivista e prepotente.",
            "A putaria vai  comer solta...  A varoa pegando o vara do varão da irmã",
            "O que vai rolar de indecência não tá escrito",
            "Mano a mulher na foto tá grávida?",
            "\"Senhor, me ajude a levantar 110kg no supino\""
        ]
    },
    "Você, morador de São Paulo, votará nesse candidato? ": {
        "title": "Você, morador de São Paulo, votará nesse candidato? ",
        "score": 106,
        "url": "https://i.redd.it/27h9mtf8549d1.jpeg",
        "content": "",
        "num_comments": 150,
        "comments": [
            "Obrigado por contribuir para o r/Twitter_Brasil!\n\nNosso sub está crescendo muito rápido, por isso podemos não conseguir monitorar todos os comentários. Caso leia algo que quebre nossas regras, denuncie para que nossos moderadores consigam agir com maior rapidez.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Twitter_Brasil) if you have any questions or concerns.*",
            "Droga, me distrai com o lance de transar com o buraco do rato, qual era a pergunta msm?",
            "Eu consigo imaginar o Pablo Marçal palestrando pros cracudos desbloquear o vício",
            "Do jeito que o pessoal gosta de \"bater palmas para maluco\" nesse país, ele tem chances. Elegemos (sim, eu também votei) um presidente assim...",
            "Pablo Marçal mano, o cara que quase matou 30 numa montanha (incluindo ele) e era conhecido como o pai da mentira...",
            "Não, porque o Janones nem concorre por São Paulo.\n\nE outra: Não morro de amores pelo Danones. Mas gosto de ver como ele deixou o gado putinho quando ele deu pro Mito um gosto do veneno dele.",
            "Se o coch ganhar, SP definitivamente vai ser só um estado grande, formado por idiotas...",
            "Eu sempre achei que esses candidatos concorrem a uma eleição majoritária pra usar o tempo de propaganda na TV pra fixar bem a figura dele pro público e depois concorrer a vereador ou deputado estadual na próxima eleição.   \nMas num grupo de Whatsapp com colegas de trabalho de todo o país, teve dois caras de fora de SP que disseram que se voltassem em São Paulo, votariam no \"Mamãe Falei\" por ele ser o mais preparado. \nObviamente isso foi na eleição que ele concorreu pra prefeitura, bem antes da viagem pra Ucrânia.",
            "Voto num membro assumido do pcc mas não voto nesse boçal",
            "Quando até o Janones percebe q alguém tá sendo idiota, é pra se preocupar. Paulista não cansa de fazer merda, esse porra do Marçal ainda vai virar deputado e dar muita dor de cabeça pro povo brasileiro."
        ]
    },
    ".": {
        "title": ".",
        "score": 568,
        "url": "https://i.redd.it/gu8jf9iam09d1.jpeg",
        "content": "",
        "num_comments": 67,
        "comments": [
            "Obrigado por contribuir para o r/Twitter_Brasil!\n\nNosso sub está crescendo muito rápido, por isso podemos não conseguir monitorar todos os comentários. Caso leia algo que quebre nossas regras, denuncie para que nossos moderadores consigam agir com maior rapidez.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Twitter_Brasil) if you have any questions or concerns.*",
            "Não baixaram a textura da casa",
            "a minecrafitização do mundo é real",
            "Tá rodando no low",
            "caralho, ficou muito feio.",
            "Reza braba contra o minimalismo amanhã as 18:00🙏🙏",
            "Minimalismo é meuzóvo.\n\nConstruir/cuidar o antes custa muito mais caro.",
            "deve ser muito legal ser tao burro pra nao entender que rodar graficos detalhados e muito caro e no low da mais fps.",
            "agora tudo é minimalismo na cabeça de quem não entende de arte\n\nisso aí não é minimalista não, é só mau gosto mesmo",
            "Na soviet Rússia, enquanto você anda a textura das coisas n carrega."
        ]
    },
    "Daí passa e era ele sim ": {
        "title": "Daí passa e era ele sim ",
        "score": 2336,
        "url": "https://i.redd.it/b7oakvri7u8d1.jpeg",
        "content": "",
        "num_comments": 82,
        "comments": [
            "Obrigado por contribuir para o r/Twitter_Brasil!\n\nNosso sub está crescendo muito rápido, por isso podemos não conseguir monitorar todos os comentários. Caso leia algo que quebre nossas regras, denuncie para que nossos moderadores consigam agir com maior rapidez.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Twitter_Brasil) if you have any questions or concerns.*",
            "Só ver o número de palavras escrito no ônibus, o segredo",
            "Me resumiu. Mas nossa a vida muda muito quando se passa a usar lente de contato, quem não gosta de óculos como eu deveria usar. Eu tinha medo de lente e vivia sem óculos até 2020, depois testei lente e nunca mais parei",
            "Cara, eu reconheco minha esposa de longe sem óculos, msm ela sendo só um borrão",
            "Uma vez quando eu tava trocando lente eu tomei aquele colírio que dilata o olho e tava quase cego por um dia, e mesmo assim decidi ir pra facul.\n\nEu tinha um plano infalível de simplesmente pegar o mesmo onibus  que os outros universitários pegarem.\n\nAnyway eu fui parar na universidade errada.",
            "Pior que eu fui perceber que precisava usar óculos por não conseguir ler o número do onibus mais",
            "■ ■ ■ ■ ■ ■  _■ ■ ■ ■ ■ ■\n\nDroga\n\n■ ■ ■ _ ■ ■ ■ ■ ■ ■ ■ ■ ■\n\nOpa, chegou o meu ônibus!\n\n(Baseado em fatos reais)",
            "É torcer pra reconhecer algum desconhecido que todo dia pega o mesmo ônibus que você",
            "Que porra q é aura e pq todo mundo começou a falar isso????",
            "É só ver se a luz de dentro do ônibus tá visível. Quando não tá significa que é o meu porque tá cheio, se dá pra ver a luz de dentro não é o meu"
        ]
    }
}