{
    "Two Hot Takes Podcast Feedback/Community discussion ": {
        "title": "Two Hot Takes Podcast Feedback/Community discussion ",
        "score": 2,
        "url": "https://www.reddit.com/r/TwoHotTakes/comments/1dp6twm/two_hot_takes_podcast_feedbackcommunity_discussion/",
        "content": "This thread will cover the following: \n\nSuggestions for guest co-hosts\n\nSuggestions for Episode themes/topics \n\nGeneral podcast feedback (feedback for specific episodes goes into the respective episode threads) \n\nMessages to Morgan/Podcast staff (Lauren, Justin, etc.) \n\nEpisode Guide Questions\n(Example: what episode is X story in?) \n\nLive show questions/info/ticket offers\n\nMeta subreddit questions (Example: Is there a flair for this?)\n\nWe recommend any off-topic discussion/general discussion be taken to the official Discord Server. ",
        "num_comments": 4,
        "comments": [
            "Unhinged 3.0 I need some WILD stories!",
            "Theres a story that Shane from Smosh covered a while back, but it only had two updates at the time yall, that story went WILD! A total of EIGHT updates on that post, and it was a rollercoaster that blasted through several layers of reality and into the realm of fiction, except Im pretty sure humans cant conceive such splendor on their own without the help of several chaos demons! This could honestly be an episode all on its own.\n\nAITA for jumping out of the way when my niece and nephew tried to push me into a pool, resulting in them falling in?",
            "Have Stacey Diaz on as a guest, she used to go on Big Mood a lot and give her opinion. It'd be nice to hear a Mexican opinion represented",
            "Hey guys, just a question - wasnt sure where else to put it - but I ordered one of the fleece half zips from the merch drop but Im worried I got the wrong size. Im a mens L/XL so I got an XL - is it cropped? Does anyone know? Thanks!!"
        ]
    },
    "Worms in the Brain.. || Reddit Readings || Two Hot Takes Podcast": {
        "title": "Worms in the Brain.. || Reddit Readings || Two Hot Takes Podcast",
        "score": 1,
        "url": "https://youtu.be/ckYFGwMVhD4?si=LHn-lUiBjmvAFnYS",
        "content": "Two Hot Takes host, Morgan, is joined by guest co-host Michaela Oakland! \n\n>This week's episode has us reading stories where someone just doesn't seem to be thinking straight. Whether it's worms in the brain, emotions running high, or psychological games.. worms can come in many shapes and sizes. Can't wait to hear your thoughts on these stories! \n\n",
        "num_comments": 8,
        "comments": [
            "Oooo we need the cake recipe!!! Great episode!!",
            " Ah, the infamous Worms in the Brain Reddit thread! That's some wild stuff. I bet the Two Hot Takes Podcast had a field day with that one.",
            "Just clearing up something that Morgan said in this one which is a common misunderstanding: insurance will cover any amount of slashed tires, thats under comprehensive coverage. Your deductible might be too high to justify claiming it though! And any amount of slashed tires is a hassle, even WITH insurance coverage!",
            "Story 1: I was raised super religiously/in a cult. My parents once threw me a fruits of the spirit themed carnival in our back yard. Silly little games like fishing plastic fish with numbers out of the kiddie pool or doing trust falls all themed around the fruits of the spirit (Galatians 5:22-23). We actually ended up being asked to bring it to several church picnic type events for the next 3 years. Other years we just didnt have a theme other than party or a color or an animal (like zebra) or a culture (Hawaiian luau for example but it was very white washed down to just grass skirts and leis and fake poi). My family was slightly more liberal than other families I knew so I once had a Barbie themed partybut several of my friends declined to attend that one because so many parents thought Barbie was evil too. I did attend several veggie tales themed parties and it was the primary entertainment for a lot of us.",
            "Story 1: I was raised Mormon and while my parents weren't at all strict about what I watched, the same could not be said for my friends. \nI knew one guy in school who had never seen a Disney movie. He watched church shows (Prince of Egypt for example) Golden Age musicals (Music Man) and A LOT of Mr. Rogers Neighborhood. For reading time he'd just read scriptures. His little brother once told me all he wanted was to watch a Disney movie. Honestly it was just sad to witness. The oldest brother was very on board with all of it but the second oldest definitely had some \"rebellious tendencies\" (aka wanted to see Frozen) I never went to a birthday party for anyone in that family so I don't know what theming they might have had. But they also had ten kids so they maybe couldn't afford birthday parties",
            "Hold on wait, didnt you read a story about how a girl had a trip planned with her boyfriend and his girl best friend but he ditched her and went on the trip with his girl best friend alone because the girl best friend was uncomfortable with his girlfriend and now in this story this guy had gone on a trip to Spain with his girl best friend alone because she was uncomfortable with his girlfriend and then his girlfriend broke up with him. Is this about the same guy????",
            "RFK Jr.",
            "Here are the links for this week's episode: \n\nStory 1: [My family won't come to my sons birthday party because it's Shrek themed](https://www.reddit.com/r/TwoHotTakes/comments/1dm7rf7/my_family_wont_come_to_my_sons_birthday_party/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nStory 4: [AITAH for filing for divorce because my husband over tightens all the jar lids? ](https://www.reddit.com/r/TwoHotTakes/comments/1dn0d48/aitah_for_filing_for_divorce_because_my_husband/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\n*Please note that Story 4 was crossposted to this sub, the crosspost link is what is linked above.* \n\n*Story 6:* [am I the asshole for making my coworker sit in the backseat so my dog can sit upfront](https://www.reddit.com/r/TwoHotTakes/comments/1dnpjv3/am_i_the_asshole_for_making_my_coworker_sit_in/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nLast story/Past Episode Update: The last story is an update from Story 5 in the episode \n\n\"Someone's Feeling Triggered..\" ft Michaela Okland.\n\nOP heard the podcast and posted an update in our very own THT subreddit.\n\n[Update: AITA for taking away my brother's plus one and inviting his girlfriend myself?](https://www.reddit.com/r/TwoHotTakes/s/TIAFpEqQFz)"
        ]
    },
    "My Friend’s Mom Braided My Hair aAnd It Broke Me": {
        "title": "My Friend’s Mom Braided My Hair aAnd It Broke Me",
        "score": 3653,
        "url": "https://www.reddit.com/r/TwoHotTakes/comments/1dqt3zs/my_friends_mom_braided_my_hair_aand_it_broke_me/",
        "content": "Growing up, my mother never did my hair except brushing unless I begged her. She has alopecia and finds hair disgusting so I never learned to do my own hair. Even for special events I had to beg her to help me with my hair since I always have trouble, even a braid. \n\nLast night, I asked my friend’s mom if she could braid my hair so it would be wavy in the morning. It always looked weird when I did it myself and my hair can’t hold texture. She sat me down in a chair and braided my hair for me, being kind and talking to me during it. I didn’t have to beg or anything and she didn’t make pointed remarks. \n\nThe whole time I was holding back tears because the only people who have touched my hair in 7 years have been hair dressers and myself. I didn’t think she would actually do my hair for me since I’m used to my ask being rejected from my mother. I felt so loved in that moment but I can’t tell her without seeming strange.",
        "num_comments": 181,
        "comments": [
            "My heart hurt for you, tell her, I'm sure she would love to know, if you can't say it to her then write it in a little note, if I made someone as happy as she has made you I would love to know. ",
            "You should tell her. Thats a little heartbreaking but very sweet",
            "OP, I know that I am just an internet auntie, but if you were close to my location, I would brush & braid your hair anytime.  It's a kindness that we all deserve. I am very sorry for your experiences. Sending you a gentle hug and I hope you find more ways to love yourself. ",
            "Please tell her. Im sure it would warm her heart",
            "Tell her. I had friends of my kids who would thank me for doing little things that they didn't get at home. I was happy to help them.",
            "Def tell her, thats a lifetime of a compliment",
            "I wish I knew her, I would just show her this post. On some level, she must know, but its never too late to learn the art of what we old people used to call the thank-you note",
            "I'm so glad she did that for you! Your deep appreciation speaks volumes. I think you should tell her what you have just told us. She should know what her kind act really meant to you. \n\nSo were the waves beautiful? Were you pleased with it?",
            "I wish I could reach through the internet and give you a hug. Please tell your friends mom.",
            "She would love to hear you say that to her. I'm 100% certain. Ask her how she did it since it hadn't been working for you. Ask her for help figuring out how to do it yourself. \n\nIt's okay to have an extra mother figure in your life!"
        ]
    },
    "My friends won’t let me go to the beach because I don’t have kids. ": {
        "title": "My friends won’t let me go to the beach because I don’t have kids. ",
        "score": 4673,
        "url": "https://www.reddit.com/r/TwoHotTakes/comments/1dqmxa9/my_friends_wont_let_me_go_to_the_beach_because_i/",
        "content": "In the group chat with my two best friends I said that we should all have a beach day this weekend. I have been begging them to go to the beach since last summer. \n\nMy two best friends both have five year-old boys. I don’t have any children. \n\nMy friend Michelle said she probably won’t go to the beach that much this summer so she wants to make it a family event and is including her son and husband, then she suggested our other friend Rachel in the group chat, should also bring her son and her husband. I was OK with that. I love them and I love their children so it was really no problem to me even though I would be a fifth wheel. \n\nWell, Rachel’s husband and me do not get along. He is emotionally abusive. Plus a cheater and a liar. Because he knows that I feel this way about him in return he hates my guts. He has tried to isolate Rachel for me for a long time, but thankfully, she has been strong enough to stay friends with me despite it all. \n\nAfter said plans were made our friend Michelle reached out to me and asked if I would mind if we rescheduled the trip to next week just the girls no kids and I said I wasn’t available the other weekend. Why did you want to change it? and she said because Rachel’s husband doesn’t want to go if  I’m there. So I said “well isn’t that his problem?” In which Michelle responds “well no offense, but we have kids who wanna play together and you don’t so unfortunately it comes down to the fact that if he doesn’t go, his kid doesn’t go and that ruins the boys beach day.” \n\nI’m trying to my best to be mature about this but did I really just get kicked out of my own plans to accommodate my friends abusive husband? And am I supposed to be ok with that? ",
        "num_comments": 978,
        "comments": [
            "I would say it might be time to reevaluate your friendship with these two.",
            "You need other friends. This is super crappy.",
            "Literally wrote what you wrote 'are you kicking me out of the plans I made'?",
            "Do the beach day solo and enjoy yourself!",
            "I think its time for you to leave this group chat and downgrade Rachel and Michelle to acquaintances instead of friends.",
            "I am also single and have two best friends that are married with children. I am included in every beach day, dinner, birthday, brunch, pool day, group text, everything. These people are not your friends OP. You deserve better.",
            "Yes, you did get kicked out of your own plans in favor of an abusive husband. \n\nKid cant go if dad doesnt go is more evidence of the abuse.",
            "Honestly, it's not your lack of kids. It's straight up because the husband doesn't like you. If you had children he would claim that your kids are \"bad influence\" on his or whatever BS he could think of to keep you away.  Sadly, you seem to be the only one he can't manipulate which is why to him you are enemy # 1.",
            "It's a public beach and you should go if you want. Rachel should have been the one to bring it up to you if her husband is the one with the problem. I'm curious how often you're excluded from things because of family plans. Pretty shitty of your friends.",
            "It sounds like Michelle needs to reschedule her kids beach trip and not yours. \n\nWhat does Rachel have to say about it because your title makes it seem like both friends don't want you to go when it's really just Michelle."
        ]
    },
    "AITAH for refusing to pay $200 to share a hotel room?": {
        "title": "AITAH for refusing to pay $200 to share a hotel room?",
        "score": 155,
        "url": "https://www.reddit.com/r/TwoHotTakes/comments/1dr6ge0/aitah_for_refusing_to_pay_200_to_share_a_hotel/",
        "content": "Hey everyone, bare with me it's 3am and I'm tired of overthinking this stupid situation.\nSo my husband (M.22) and myself (F.22) were invited to denver comic con by my friends Nikki (F.26) and Braxton (M.44) as well as nikkis mom (F.49). We had been saving up for the better part of a year just to make sure we could afford to go and had finally been able to pull together enough cash for tickets, some for a hotel and food while we were there. This last month Nikki offered to let us stay with her and everyone else in the hotel room that they booked in August of 2023 (relevant later). My husband and I agreed since we would be sleeping on the couches and we're expecting to pay like $50 each. Two days ago she called me and asked me if we wanted to pay her before the trip for this hotel room I asked how much we owe her and she said $450 I immediately knew we couldn't afford that and started asking a whole bunch of questions. She said it was $225 for each of us, (we are going to sleep there that is it), she said it was our portion of the hotel bill split 5 ways between everyone else. I told her there was no way we could afford that and she offered to pay what we couldn't but she expected us to pay her back. I told her thank you but we won't be able to due to us living paycheck to paycheck while trying to get a house when our lease is up. After asking a whole bunch more questions she told me when they booked the hotel we hadn't even been invited yet, and they booked an 8 person hotel suite for the three of them. This suite has 3 bedrooms and a living room, they each get their own rooms while we get the couch but are paying the same amount? It kinda pissed me off so I've been stewing and told her no way in hell am I paying $450 to sleep on a couch for 10 hours and not be there anymore than that. \n\nSo AITAH? If you need more info let me know this is the gist of it tbh. Also we leave July 3rd and won't be back til July 7th. Plz help",
        "num_comments": 46,
        "comments": [
            "I wouldn't  be paying  anyone to sleep  on a sofa. If you can't  afford  money for a hotel ,stay home",
            "hahhahaha so she booked this suite for 8 people when originally 3 were going....you know you were ONLY invited to help them pay for THEIR GOOD TIME. I wonder who else she is going to try and get to come along now.\n\nnext time, ask how much before you agree to do anything.",
            "I just did a search. Double Tree Hilton rooms are $150 a night. You could go and book yourself.",
            "That is a rotten \"deal\".  Your friend is insane to think anyone would go for that.",
            "I mean, I invited a friend on my kids' birthday Disney Vacation. We stayed in their hotel for a week and everything, and I only made her pay for her own tickets. \n\nAnd I'm not rich (seriously, this was just a once-in-a-lifetime thing I always said I'd do with my kids), but inviting her didn't change the price of the room. So... do they really value your presence?? Or are you there to help with the bills?",
            "Sound like really awful people. Not the asshole and well done for have a clear head and calling her out.",
            "NTA. Shes taking the piss. No way would I pay $450 to sleep on a couch when everyone else pays to get a room. Also the maths seems off so does everyone pay $225 to have their own room while you and your husband spend $450 to share a couch? You would literally be subsidising there holiday and for them to have a bedroom. \n\nYou also say youre only there for 10 hours? So how many nights are you planning on spending at the hotel? Just get your own hotel room or Airbnb as they are being ridiculous and theirs no point you trying to work this out with them since they seem to not have any common sense.",
            "Uh they are bad friends and you're not overreacting or an asshole.",
            "It isn't fair to divide it per person, it's more fair to divide it per bed, with the couch bed paying considerably less. I'm assuming the total accommodation is $1125. $50 for 4 nights is absolutely way too low. $200 for the 2 of you for 4 nights is much more reasonable.",
            "So your share is $450 and their share is $675. You didnt say for how many nights. So heres what I do. Option #1 - tell your friend ok but you need one of the 3 bedrooms and can only pay X, but will pay her back the rest later (take 3 years) OR Option #2 - Youll pay her $50 a night to crash on the couch for both of you."
        ]
    }
}