{
    "[PLEASE READ] Sh!tposts, permabans, and literally 1984.": {
        "title": "[PLEASE READ] Sh!tposts, permabans, and literally 1984.",
        "score": 463,
        "url": "https://www.reddit.com/r/TwoSentenceHorror/comments/17e39nq/please_read_shtposts_permabans_and_literally_1984/",
        "content": "This is all dumb.\n\nFor the past several months, the sub has experienced a flood of intentionally poor quality stories in an effort to get onto parody subs and TikToks. We've historically hit you with a  strike (🔴) and if you received three, you were permabanned (check out the [wiki](https://www.reddit.com/r/TwoSentenceHorror/wiki/rules/#wiki_red_dot_warnings.3A)).\n\nHowever, if you've submitted one of these stories in the recent past, you may have noticed that your account was permabanned from TwoSentenceHorror without going through the strike process. While we've made this current one-and-done rule known within each of our monthly announcements for forever, we felt it was only fair to have a separate post to lay out the approach.\n\n# If you intentionally submit a poor quality story (we're looking at you \"meat worm\" and \"killer guy\" crews), you will be permabanned with no warning.\n\nIf and when these posts chill out, the mod team will reconsider this rule. Until then, please continue to report these intentional poor quality stories, read the sub rules, and submit awesome, horrifying tales to maintain the quality of the sub!",
        "num_comments": 0,
        "comments": []
    },
    "June announcement and May winners!": {
        "title": "June announcement and May winners!",
        "score": 24,
        "url": "https://www.reddit.com/r/TwoSentenceHorror/comments/1d656rh/june_announcement_and_may_winners/",
        "content": "Happy June!\n\nBefore we get into this month’s prompt, here's a few announcements for your pleasure and enjoyment:\n\nANNOUNCEMENTS\n\n* Big thank you to those who helped flag rule breaking posts this month! We're still seeing troll posts and appreciate everyone's help keeping an eye out for posts that don't fit the sub.\n* We are continuing to remove most posts about gratuitous sexual violence as per Rule 7: Overused Tropes.\n* We're also removing stories that use spoiler tags, spoiler marks, or irrelevant NSFW tags, as these constitute formatting gimmicks, again as per Rule 7.\n* Obvious💩-posters will be permabanned! Read more [here](https://www.reddit.com/r/TwoSentenceHorror/comments/17e39nq/please_read_shtposts_permabans_and_literally_1984/).\n* Lastly, be familiar with our Three Strikes and you're out rule-- trolling or sexualizing minors will typically get you a strike. If you earn a 🔴, it will take 60 days of chill to clean it up. Read more [here](https://www.reddit.com/r/TwoSentenceHorror/wiki/rules/#wiki_red_dot_warnings.3A).\n\n# JUNE 2024 Contest Prompt\n\nFor those in the Northern Hemisphere June holds the Summer Solstice, where the night is at its shortest. Dusk is pushed back and the dawn comes early-- all that daylight seems to invite every manner of celebration.\n\nWeddings, reunions, and parties in general all see an uptick this time of year and of course: those who've completed their study programs celebrate their graduation.\n\nAnd there's our theme and our prompt for this month's contest:\n\n*graduation*\n\nYou must use the word or its reasonable variations/ derivations (ex: graduates, grads, graduated, etc). While the theme refers to graduation in the academic sense, we'll also accept definitions relating to metrics (graduated income tax, graduated cylinders, etc). \n\n\n\n**However: to meet the prompt you must use \"graduated\" or it's derivations. Unfortunately, words that aren't derived from \"graduation\" don't fit this month's theme. So a story using** ***gradually, graded, gradient, degrade, Stalingrad,*** **etc won't be included in the final ranking.**\n\nWhile you're of course more than welcome to use these (or other g-r-a-d words) as broader two sentence horrors, please do not tag them as contest entries.\n\nThis theme is less flexible than last month's, so we anticipate a more difficult challenge and wish everyone the best of luck!\n\nPS: Congrats and job well done to anyone graduating this month :)\n\nOf course, entries will always be weighed against sub rules!\n\n**Properly formatted June 2024 examples:**\n\n\\[JUN24\\] I chose this month's prompt to brag about my upcoming graduation from murder school! By the end of this month I'll have a bachelors degree in killing!\n\n\\[jun24\\] This is the first sentence. Please don't let that distract you from the fact that this month I'm graduating from murder school!\n\n**Improperly formatted examples**:\n\n\\[june2024\\] The 'e' in June and the '20' in 2024 make this a doubly incorrect tag. I'm afraid this shameful error will cast a negative light on my graduation from murder school.\n\n\\[JUN24\\] This time the tag is right. But I forgot to include the prompt because I'm so overtired from all the hours I put into the lab practical in Killing 101.\n\n**June 2024 Contest Rules**\n\n* Submissions that are improperly formatted, do not fit the theme, or break any of the existing sub rules will be disqualified and removed.\n* The top 10 highest-voted stories will be the winners!\n* Winners can only place in the top 10 once. The highest of the entries will be their winner.\n* Only net new stories will be allowed (no repurposing old stories you've previously submitted).\n* Max three stories per day as a general rule, and all three can be used towards the contest.\n* Winners will be decided by total community upvotes. In the unlikely event of a tie for the top spots, moderators will vote for a tiebreaker.\n\n**WINNERS WILL RECEIVE:**\n\n1st, 2nd, and 3rd Places: You receive a custom personal flair of your choosing to show off to the TSH community! (If you're a repeat winner, you can modify your flair.... but that's it.) And a cool fancy flair on your winning stories.\n\n7 honorable mentions: you'll get visibility and bragging rights! Story links will be featured on next month’s announcement.\n\nContest ends on June 30, 2024 @ 11:59pm (GMT)\n\nAny questions should be made below in the comments, within our [discord](https://discord.gg/FZ5dVfxsD6), or a note on [modmail](https://www.reddit.com/message/compose?to=/r/TwoSentenceHorror).\n\nLots of great stories this month, **congrats to May's winners in the comments below**!",
        "num_comments": 23,
        "comments": [
            "# Congrats to our May Winners! Great stories all.\n\nTheme was \"bull\", any word including those four letters in order was fair play and it was fun to see the many different directions you all went with the prompt!\n\n* [1st place](https://www.reddit.com/r/TwoSentenceHorror/comments/1cmyw4e/may24_temperatures_today_are_expected_to_reach_a/) by [tinytabbytoebeans](https://www.reddit.com/user/tinytabbytoebeans/) \n* [2nd place](https://www.reddit.com/r/TwoSentenceHorror/comments/1cnchv8/may24_despite_what_the_veterinarian_said_you/) by [Chemical-Elk-1299](https://www.reddit.com/user/Chemical-Elk-1299/) (In addition to placing in the top 3, Chem placed in the raw top ten as well!)\n* [3rd place](https://www.reddit.com/r/TwoSentenceHorror/comments/1crq2ax/may24_if_you_need_some_extra_d6_feel_free_to_grab/) by [Gogo726](https://www.reddit.com/user/Gogo726/) \n\nGreat job! If you placed in the top three, contact us via modmail for your personalized custom flair! It can be anything (within reason): a mixture of text and emoji, up to 20 characters. If you've won before, you can request to change your flair, or, just do nothing. Absolutely nothing....and for your runners up!\n\n* [4th place](https://www.reddit.com/r/TwoSentenceHorror/comments/1cpqg4a/may24_1_2_3_4_the_classroom_was_silent_except_for/) by [CaptainPanda99](https://www.reddit.com/user/CaptainPanda99) \n* [5th place](https://www.reddit.com/r/TwoSentenceHorror/comments/1ckul1k/may24_my_husband_and_i_increased_our_insurance/) by [RaynaClay](https://www.reddit.com/user/RaynaClay) (Rayna also placed in the raw top ten more than once! great stuff)\n* [6th place](https://www.reddit.com/r/TwoSentenceHorror/comments/1cirqqk/may24_titanic_sinks_1500_dead_read_the_headline/) by [Weirdo\\_writer](https://www.reddit.com/user/Weirdo_writer/)\n* [7th place](https://www.reddit.com/r/TwoSentenceHorror/comments/1cu7eno/may24_leda_traced_the_clinic_bulletin_with_a/) by [spintale](https://www.reddit.com/user/spintale)\n* [8th place](https://www.reddit.com/r/TwoSentenceHorror/comments/1cmefhq/may24_waking_to_find_her_head_slumped_against_the/) by [movingstasis](https://www.reddit.com/user/movingstasis/)\n* [9th place](https://www.reddit.com/r/TwoSentenceHorror/comments/1ctqeb0/may24_the_cherub_looked_upon_me_with_4_sets_of/) by [VagrantDog](https://www.reddit.com/user/VagrantDog/)\n* [10th place](https://www.reddit.com/r/TwoSentenceHorror/comments/1clti4r/may24_these_drills_are_such_bullshit_schools/) by [LoveyDoveySkills](https://www.reddit.com/user/LoveyDoveySkills/)\n\nCongrats to all! \n\nReddit filters comments with too many u/ mentions, so I'm tagging those who placed below in separate comments:",
            "OMG I won!?!?!?! Oh man, I'm stuck between two old horror story memes for a tagline. I'll have to think about it XD I'm just so happy people liked my story :,)",
            "This was neither 2 sentences \nNor horrifying",
            "I have a question. What's a \"relevant\" nsfw tag and do we need to use it, compulsorily? If this whole sub is nsfw (and if it isn't it should be), then using an nsfw tag on any post here is redundant, right? 🤔",
            "I have a quick question about the prompt. Does it have to be a derivative of \"graduation\" or could I use the word gradually?",
            ":) \n\n  \nwell earned, good work!",
            "Hey boss you deserve it. Your story was awesome",
            ":)",
            "Hey Ghost, that's a great question. \n\nTo be utterly transparent I've always thought NSFW tags on a text based sub were kind of silly. If we think of nsfw tags as denoting graphic visuals, then they shouldn't apply here ever. If we think of nsfw tags as denoting themes you shouldn't talk about at work, then you're right: all the stories here ought to be tagged which makes the use redundant. \n\nThe way I see it the only sensible use for nsfw tags on this sub specifically would probably be to flag stories that deal with sexual themes. While we don't require use of nsfw tags in such cases, the mod team was deliberate about still allowing their use. When the mod team discussed these tags we agreed that we should still allow them as they constitute a built in reddit user safety feature, which we don't want to interfere with. \n\nBut there's lots of room for interpretation as to what counts as relevant use, so perhaps the other mods might add better insights. \n\nAnyway, we try our best to weigh stories that use those tags in good faith. If a story seems to use the tags as a formatting gimmick to catch reader's eyes, then it will likely be removed. \n\n(also worth noting, we generally remove most stories dealing with sexual assault as overused tropes, so a large number of stories that might make relevant use of NSFW tags may still be removed regardless).",
            "Thanks for asking!\n\nUnfortunately, words that aren't derived from \"graduation\" don't fit this month's theme. So a story using \"gradually\" won't be included in the final rankings. Same goes for other words that considerably shift from the original prompt (graded, gradient, degrade, Stalingrad, etc). \n\nWhile you're of course more than welcome to use these (or other g-r-a-d words) as broader two sentence horrors, please do not tag them as contest entries. \n\n  \nI'll update our announcement to clarify this."
        ]
    },
    "Because every one of the computer’s predictions had come true, we asked it what year humans would cease to exist.": {
        "title": "Because every one of the computer’s predictions had come true, we asked it what year humans would cease to exist.",
        "score": 1906,
        "url": "https://www.reddit.com/r/TwoSentenceHorror/comments/1dqt25y/because_every_one_of_the_computers_predictions/",
        "content": "We were shocked when the screen displayed a simple “1945”. ",
        "num_comments": 66,
        "comments": [
            "all these different calendars in different cultures... 🤷‍♂️",
            "\"1944, 1943...\"",
            "Must be an integer overflow error.",
            "When asked to clarify on which calendar that date was based, the response of \"Saka Samvat\" elicited first confusion and then dawning horror as we translated the year into the standard Gregorian.",
            "We did, indeed, cease to be human when we used an atomic weaponry terror attack on our fellow humans.\n\nMaybe when we can collectively admit that it was reprehensible, we can start earning it back.",
            "# r/PeterExplainsTheJoke",
            "1945 in hex is 6469 in decimal.",
            "oracle?",
            "?",
            "and we trust computers that couldn't count to 2000?"
        ]
    },
    " \"Mommy, there's a ghost in my room pretending to be you!\" cried my son as he ran into my arms": {
        "title": " \"Mommy, there's a ghost in my room pretending to be you!\" cried my son as he ran into my arms",
        "score": 815,
        "url": "https://www.reddit.com/r/TwoSentenceHorror/comments/1dqxhdb/mommy_theres_a_ghost_in_my_room_pretending_to_be/",
        "content": "It's only when I smiled with all my three rows of teeth that the  poor thing realised I wasn't his mom either ",
        "num_comments": 16,
        "comments": [
            "When his fingernails sharpened into claws and ripped into my lungs, I realized he wasn’t the mother’s little boy either.",
            "Jeez buddy, it’s Two Sentence Horror, not Two Sentence Sadness!",
            "I have literally had multiple nightmares like this before",
            "I think you maybe mean \"rows\" of teeth?",
            "Oooh! Plot twist!",
            "Her kid got there first damn",
            "I think ghosts pretending to be a kid's mom is pretty spooky",
            "Me too and I know exactly how terrifying being alone with monsters in your dreams is so please don't take this reaction the wrong way but...\n\nYey, that means I've hit a core childhood fear with that one",
            "Fuck me and my own brain  translations, you're right! First language uses a word similar to \"ranges\". Thanks!",
            "I took it as the ghost WAS his mom, cause the monster got to her first..."
        ]
    },
    "\"Go outside to play, and I'll just tell your dad that we couldn't figure out the homework.\" my babysitter assured me. ": {
        "title": "\"Go outside to play, and I'll just tell your dad that we couldn't figure out the homework.\" my babysitter assured me. ",
        "score": 2854,
        "url": "https://www.reddit.com/r/TwoSentenceHorror/comments/1dqkqb2/go_outside_to_play_and_ill_just_tell_your_dad/",
        "content": "I knew the beating would be severe, when she instead told him \"I've been trying to get him to do his homework all day, but he didn't want my help.\". ",
        "num_comments": 44,
        "comments": [
            "So the next time I left a condom in my parents’ bed and told them that the sitter’s boyfriend was there almost all evening.",
            "Just go hide the jumper cables.",
            "Yes\n\nBad schools, heartless unfair adults, child abuse, are : \n\nH\nO\nR\nR\nO\nR",
            "Oof… my teachers used to lie about me to my dad because they knew he would beat me lmao and they wanted that. \n\nThey’ve hit me before too and I didn’t even know to tell because I mean… dad hit me. And in Pre-K I was so convinced that my teacher would hit me (again) if I said my ABCs wrong because that’s one of the times dad used to hit me.\n\nI have zero tolerance for people who abuse their children or abuse their students.",
            "If only she'd known how my dad punishes those who he believes fail to provide for my educational needs, whether or not it is their fault, she might still be able to walk",
            "Vicky?",
            "This really hurts 😳☠️😢🫣🫣\n\n\n( Growing up: School Was CRUEL,   teachers refused to teach and could \" prove\" you were cheating when you were NOT cheating)\n\n\n( Homework is unhealthy unfair unhelpful,  the teachers need to TEACH so the students LEARN, 6 to 9 hours is MORE than enough time for excellent TEACHING learning, excellent gym class with NO humiliation or bullying, and a healthy free lunch)",
            "I have seen this post before!!!!!",
            "This is horrendous. Take my upvote.",
            "Oh, bloody hell. This one hits home."
        ]
    }
}