{
    "[MINI FAQ] Do I have to be a woman to participate here? What about the subreddit name? What about trans women? What are the rules, anyway?": {
        "title": "[MINI FAQ] Do I have to be a woman to participate here? What about the subreddit name? What about trans women? What are the rules, anyway?",
        "score": 1739,
        "url": "https://www.reddit.com/r/TwoXChromosomes/comments/fejj7u/mini_faq_do_i_have_to_be_a_woman_to_participate/",
        "content": "#Do I have to be a woman to participate in this community? \n\n##**No.** Any user who can follow the rules is welcome here. Women, men, nonbinary, agender, genderqueer, cis folks and trans folks, *everybody*. If you're not on board with that, you can fuck right off.\n\n#But what about the subreddit name? \n \n##[Read this post](http://www.reddit.com/r/TwoXChromosomes/comments/9283g/addressing_the_genetics_issue_you_dont_have_to_be/) from when 2XC was only a month old. We haven't changed our stance since then, and never will.\n\n#What about trans women?  \n\n##Trans women are women. TERFS can fuck right off. \n\n#What are the rules, anyway?  \n\n##TL;DR: Keep it civil, keep it relevant. Don't start shit, won't be shit.  \n##You can find the rules in the sidebar (community info for mobile users), or here's a direct link:  [2XC Rules](https://www.reddit.com/r/TwoXChromosomes/wiki/rules#Rules)   \n\n####Most moderator actions are the result of users breaking Rule 1: RESPECT. If you keep Wheaton's Law* in mind and participate in good faith, you'll probably never hear from the mod team.\n\n&nbsp;&nbsp;\n\n ^*Wheaton's ^Law: ^Don't ^be ^a ^dick.\n\n\n-----\n\n###For more in-depth interpretations of the rules above, see the [2XC FAQ](https://www.reddit.com/r/TwoXChromosomes/wiki/faq) and [2XC Moderation Policy](https://www.reddit.com/r/TwoXChromosomes/wiki/moderationpolicy).\n\n-----\n\n#Wow that's awesome! How do I volunteer to join the mod team?\n\n## [FAQs and the application process can be found in our wiki. We're always looking for more volunteers.](https://www.reddit.com/r/TwoXChromosomes/wiki/jointheteam)",
        "num_comments": 0,
        "comments": []
    },
    "Trans Women are Women.": {
        "title": "Trans Women are Women.",
        "score": 4034,
        "url": "https://www.reddit.com/r/TwoXChromosomes/comments/1by0725/trans_women_are_women/",
        "content": "Here at r/TwoXChromosomes we try our best to create and maintain an inclusive space for everyone to contribute about women. That includes trans women. We expect our users to adhere to the rules set in place, so as a reminder…\n\n#Trans Women are Women.\n\nWe will ***not*** have any transphobia or TERFs in this sub.\n\nFor example, telling someone who brings up trans in posts about women that they’re not talking about trans women, or that they’re derailing is basically the same thing as saying trans women aren’t included in being women.\n\nAny transphobia will be met with a permanent ban. End of story. ",
        "num_comments": 0,
        "comments": []
    },
    "Girl, 15, calls for criminal penalties after classmate made deepfake nudes of her and posted on social media": {
        "title": "Girl, 15, calls for criminal penalties after classmate made deepfake nudes of her and posted on social media",
        "score": 8366,
        "url": "https://sg.news.yahoo.com/girl-15-calls-criminal-penalties-190024174.html",
        "content": "",
        "num_comments": 391,
        "comments": [
            "\"This week, Republican Senator [Ted Cruz](https://www.independent.co.uk/topic/ted-cruz), Democratic Senator [Amy Klobuchar](https://www.independent.co.uk/topic/amy-klobuchar) and several colleagues co-sponsored a bill that would require social media companies to take down deep-fake pornography within two days of getting a report.\n\nThe [Take It Down Act](https://www.commerce.senate.gov/2024/6/sen-cruz-leads-colleagues-in-unveiling-landmark-bill-to-protect-victims-of-deepfake-revenge-porn) would also make it a felony to distribute these images, Cruz told Fox News. Perpetrators who target adults could face up to two years in prison, while those who target children could face three years.\"",
            "In Australia a man has just been sentenced to 9 1/2 years jail for a similar offence.  This is the type of sentence that is needed. ",
            "Stop adding new laws and enforce existing ones.\n\n>Visual depictions include photographs, videos, digital or computer generated images indistinguishable from an actual minor, and images created, adapted, or modified, but appear to depict an identifiable, actual minor.  Undeveloped film, undeveloped videotape, and electronically stored data that can be converted into a visual image of child pornography are also deemed illegal visual depictions under federal law. \n\n[Citizen's Guide To U.S. Federal Law On Child Pornography](https://www.justice.gov/criminal/criminal-ceos/citizens-guide-us-federal-law-child-pornography)\n\nSomebody is trying very hard to scare people into believing that no laws cover AI, when they do. The law already makes it illegal to circulate images of a child, even if those images were fake, and the penalty is the same as if they were real. If prosecutors are refusing to do their jobs, that is a whole different problem.\n\nJust to be clear, this law would mean fake images would get more jail time than actual images, which makes no sense at all. The reason Ted Cruz is on board, is this is a way of going after social media, and removing LGBTQ from society, because Right-Wing Republicans like Cruz continue to say LGBT images are child porn or grooming children. This legislation is a Trojan Horse to undermine rights, while pretending to help women.",
            "On the one hand we've developed these new tools and massive technological advancements, and in the middle of all that, we have the patriarchy using it to create and distribute nonconsensual porn at a moment's notice.\n\nThis stuff needs legislation and jail time, like yesterday",
            "This is horrible and literally child pornography. In Australia, where I live the government is already on its way to making deepfake porn illegal. All countries should follow",
            "This ai shit needs new laws and rules....like yesterday",
            "This should count as child pornography",
            "Deep fakes regardless of how innocent should result in fines or jailable offenses. So pictures, videos, audio, etc... It's all fraud.",
            "Isn't that distribution of child pornography? How did the guy who did it only get probation? The family should press for criminal charges.",
            "AI that cannot understand and obey the code of law isn't ready to be released."
        ]
    },
    "Thank you, sisters. Because of you, I hiked, hosted a BBQ, and did so many other things instead of moping around the house": {
        "title": "Thank you, sisters. Because of you, I hiked, hosted a BBQ, and did so many other things instead of moping around the house",
        "score": 633,
        "url": "https://www.reddit.com/r/TwoXChromosomes/comments/1dlkfwy/thank_you_sisters_because_of_you_i_hiked_hosted_a/",
        "content": "My ex boyfriend crushed me. I am still depressed and living with regret. I was at the end of my patience. \n\nBut thanks to YOU all, I realize this isn’t all my fault. You asked me to articulate why he was a good boyfriend and what he did that made me happy. The list was weak. Then I made a list of things he hated that I love but I didn’t do for the last year so he wouldn’t be sitting home alone. \n\nI started doing things on that list this week!\n\nI went on a 8 mile hike  \nI hosted a BBQ  \nI went to a game night  \nI went out with a big group of friends to a brew pub  \nI ate sushi  \nI went to karaoke  \n\nAll my friends were happy to have me back. No one was mad at me especially when I explained what I was going through. I’m still keeping up with counseling but things are looking up. \n\nThank you! ",
        "num_comments": 37,
        "comments": [
            "Never underestimate the power of your own passions.  \nYou know what you want, now go out and do it!",
            "Girl, I love this for you!!! Keep powering through :)",
            "I’m doing this now. Thanks for passing it along!",
            "Yes!  Reconnecting with friends!  Such a healing thing to do.",
            "Brilliant! I remember reading some guy claiming we can do all of these things when in relationship. Bullshit. When you’re a maid in a relationship, you too busy washing their dirty underwear to pay attention to your own hobbies. It is constant compromise on YOUR part. \n\nWell, I rather be “alone” forever that live like half of person most of my life!",
            "He didn’t like hiking?",
            "That’s so awesome.  And inspiring!!!   Thanks for posting ",
            "Congratulations, enjoy the things you enjoy with the people you enjoy, and it's good to hear you're keeping up with counseling too.",
            "Love this for you. Living your best life!!",
            "I definitely wish he was here with me instead. I would still trade in all these things for a happy life with him. So I have a long way to go but I will be ok!"
        ]
    },
    "Throwback to that time I had a tumor in my neck and my doctor insisted it was due to pregnancy ": {
        "title": "Throwback to that time I had a tumor in my neck and my doctor insisted it was due to pregnancy ",
        "score": 69,
        "url": "https://www.reddit.com/r/TwoXChromosomes/comments/1dltniz/throwback_to_that_time_i_had_a_tumor_in_my_neck/",
        "content": "I saw some tweet on X that brought back a repressed memory lol\n\nWhen I was 17, I was washing up in the sink and noticed there's a golf ball sized tumor in my neck \n\nI quickly made an appointment with my GP and rushed to get it checked\nShe did her thing and insisted I call my mom, that she needs to be here for this \nShe prints me a piece of paper that stats it's either pregnancy complications or cancer (ofc the cancer part was in medical lingo so I had to google it)\n\n\"Whelp you're probably pregnant that's why it popped up, first thing first's I'm referring you to a pregnancy blood test\"\nI argued it's impossible for me to be pregnant and she just went \"yeah save it\" \n\nAfter a bit of protest, my mom arrives \nDoc kicks me out the room and starts telling my mom the news, I pop my head back in like \"you know I can read what's on the paper you just gave me yeah? No need to kick me out\"\n\nAnyway, turns out I wasn't pregnant nor had cancer, funny ",
        "num_comments": 9,
        "comments": [
            "Ugh, you'd think cancer would have been the bigger concern...",
            "What a shit ass doctor for so many reasons. Also r/badwomensanatomy kind of",
            "That’s a possibility in pregnancy? WTF. I had three kids and never once had something like that. \n\nI would have lost it if that happened to me and a doctor acted the way yours did. Thank goodness everyone else was competent and didn’t let you suffer for years like some women have with misdiagnoses.",
            "Luckily though, the hospital I went to was fantastic and they did speed me through the system because they thought it's likely cancer and couldn't properly diagnose before completely removing it \n\nI think the tumor was out within two weeks of arriving to the hospital",
            "I wonder how much of the treatment I received was due to going to a children's hospital (I was 17) rather than a normal one, I did get the occasional nurse who was like \"ain't you too old to be here?\"\n\nI did get gaslight and screamed at (once Infront of other patients) for other medical problems or asking to change meds by docs tho",
            "I have on my file that I stopped going to a certain doctor \"due to a disagreement\"\n\nThe disagreement: writing me a prescription of two medications you are not allowed to combine together, have no benefits together and will likely end in hospitalisation, according to 4 other medical professionals I asked, I asked for a different combo and doc started flopping her arms around and screaming at me\nSaid prescribing doctor wrote I'm refusing any treatment because she reminds me of my sister (what?? Ahahahaha)",
            "Yep. I developed a blood clot tumor in my cheek because of pregnancy. Not cancerous in any way, but not fun to deal with",
            ">\"ain't you too old to be here?\"\n\n\nWhat is it with that attitude, though? I switched from a pediatrician to my parents' GP at around 17 and I remember feeling weird about it, because I knew that many others my age had done this switch earlier. And know I think back to that and don't understand, why teenagers were supposed to be treated like adults in a medical context, when it's medical science that tells us that their brains haven't fully developed until 25. ",
            "With a blood clot it makes sense, I've heard of them happening sometimes during pregnancy (usually in legs or chest tho) my specific tumor or other possible tumors in the area had nothing to do with pregnancy tho"
        ]
    }
}