{
    "[MINI FAQ] Do I have to be a woman to participate here? What about the subreddit name? What about trans women? What are the rules, anyway?": {
        "title": "[MINI FAQ] Do I have to be a woman to participate here? What about the subreddit name? What about trans women? What are the rules, anyway?",
        "score": 1739,
        "url": "https://www.reddit.com/r/TwoXChromosomes/comments/fejj7u/mini_faq_do_i_have_to_be_a_woman_to_participate/",
        "content": "#Do I have to be a woman to participate in this community? \n\n##**No.** Any user who can follow the rules is welcome here. Women, men, nonbinary, agender, genderqueer, cis folks and trans folks, *everybody*. If you're not on board with that, you can fuck right off.\n\n#But what about the subreddit name? \n \n##[Read this post](http://www.reddit.com/r/TwoXChromosomes/comments/9283g/addressing_the_genetics_issue_you_dont_have_to_be/) from when 2XC was only a month old. We haven't changed our stance since then, and never will.\n\n#What about trans women?  \n\n##Trans women are women. TERFS can fuck right off. \n\n#What are the rules, anyway?  \n\n##TL;DR: Keep it civil, keep it relevant. Don't start shit, won't be shit.  \n##You can find the rules in the sidebar (community info for mobile users), or here's a direct link:  [2XC Rules](https://www.reddit.com/r/TwoXChromosomes/wiki/rules#Rules)   \n\n####Most moderator actions are the result of users breaking Rule 1: RESPECT. If you keep Wheaton's Law* in mind and participate in good faith, you'll probably never hear from the mod team.\n\n&nbsp;&nbsp;\n\n ^*Wheaton's ^Law: ^Don't ^be ^a ^dick.\n\n\n-----\n\n###For more in-depth interpretations of the rules above, see the [2XC FAQ](https://www.reddit.com/r/TwoXChromosomes/wiki/faq) and [2XC Moderation Policy](https://www.reddit.com/r/TwoXChromosomes/wiki/moderationpolicy).\n\n-----\n\n#Wow that's awesome! How do I volunteer to join the mod team?\n\n## [FAQs and the application process can be found in our wiki. We're always looking for more volunteers.](https://www.reddit.com/r/TwoXChromosomes/wiki/jointheteam)",
        "num_comments": 0,
        "comments": []
    },
    "Trans Women are Women.": {
        "title": "Trans Women are Women.",
        "score": 4135,
        "url": "https://www.reddit.com/r/TwoXChromosomes/comments/1by0725/trans_women_are_women/",
        "content": "Here at r/TwoXChromosomes we try our best to create and maintain an inclusive space for everyone to contribute about women. That includes trans women. We expect our users to adhere to the rules set in place, so as a reminder…\n\n#Trans Women are Women.\n\nWe will ***not*** have any transphobia or TERFs in this sub.\n\nFor example, telling someone who brings up trans in posts about women that they’re not talking about trans women, or that they’re derailing is basically the same thing as saying trans women aren’t included in being women.\n\nAny transphobia will be met with a permanent ban. End of story. ",
        "num_comments": 0,
        "comments": []
    },
    "According to men in charge of deciding regulations for womens’ annual check ups, putting gel on a speculum is no longer allowed during pelvic exams": {
        "title": "According to men in charge of deciding regulations for womens’ annual check ups, putting gel on a speculum is no longer allowed during pelvic exams",
        "score": 2703,
        "url": "https://www.reddit.com/r/TwoXChromosomes/comments/1dqxz5w/according_to_men_in_charge_of_deciding/",
        "content": "I had my annual visit yesterday, and this visit included a pap smear. When my doctor (a woman I love) went to insert the speculum, she apologized in advance because she’s “not allowed” to put lube on it anymore. I asked why, and she said “because men in charge of these regulations said it screws up the results of the Pap smear. I’ve been doing Pap smears regularly for 16 years and I can tell you that an abnormal pap will be abnormal with or without the use of gel. But this is how it is now.” I just don’t understand. These exams are uncomfortable enough as it is but now someone who will literally never get one is denying me the comfort of gel on the speculum? What? WHY. JUST. WHY. ",
        "num_comments": 255,
        "comments": [
            "Uh my female gyno in the US is still using WARMED lube for pap smears. ",
            "Oh, just no. I’m a pcp and do lots of Pap tests. It’s true that lots of lube can be a problem. I just put a bit of lube on the top and bottom. Leaves the inside clear of lube and good specimen obtained. Easy peasy.",
            "Apparently vaginas don't feel pain. That's why we have to suffer through every test with no pain relief.",
            "So I guess I’ll be pre-loading with lube?",
            "My PCM not only had lube, but used the smallest speculum that had because she didn't want me to be uncomfortable. She also tried to tell me a bad joke, but forgot the punchline. \n\nThis was at a VA clinic in one of the reddest states.",
            "In Australia, we aren't even doing pap smears anymore. Most women can just do a vaginal swab at home and drop it to the pathology. It's the best!",
            "Cool. I will never get one again if this stands. I already hate it and if it was without gel.... *shudders*",
            "Wes this ontario?\n\nThe same just happened to me but no explanation was offered at all.",
            "I would have simply told her no. I would refuse the test. If enough women refuse, they will have to change the policy.",
            "Why? Because he hates women and want them to suffer."
        ]
    },
    "Everytime I bend over my husband pokes me in my vagina/butt at home and in public": {
        "title": "Everytime I bend over my husband pokes me in my vagina/butt at home and in public",
        "score": 222,
        "url": "https://www.reddit.com/r/TwoXChromosomes/comments/1dr83ti/everytime_i_bend_over_my_husband_pokes_me_in_my/",
        "content": "Just like the title says everytime I(32) bend over and my husband(42) is around me he’ll poke me in my butt and vagina.It doesn’t matter if I’m at home unloading the dishwasher and our son is watching he’ll jam his fingers in my butt or vagina over my pants. Or if I’m in public and I go grab something or bend over he’ll do it. \n\nSometimes he’ll poke me so hard that my underwear goes into my vagina and become wet. \n\nSome recent examples: \n\nI’ll bend over to pick up our son and he’ll poke me\n\nI’ll bend over to clean up toys\n\nPutting our son into his car seat \n\nGrabbing things off shelfs at stores \n\nBending down to put on my shoes \n\nBending over to get dressed (naked) - really hate when he does this \n\nIt’s so frustrating and embarrassing. I’ve told him so many times to stop but like with everything else he doesn’t listen and his excuse is he’s allowed to touch me because he’s my husband or he’ll get mad  tell me it’s NBD and he’s attracted to me and I should be flattered. \n\nIt makes me so uncomfortable because we’ve been going through a really hard time the last year with our relationship and he also knows I don’t like being touched liked that :( he thinks it is funny and a joke. \n\nI feel so violated ",
        "num_comments": 143,
        "comments": [
            "Imagine telling your SO “I’m allowed to disrespect your body because you’re my wife” - just imagine.",
            "Have you used the words \"sexual assault\" when telling him to stop?",
            "What an awful example to set for your son. He’s seeing his mother get sexually assaulted and disrespectful in her own home.",
            "That is assault and abuse.",
            "It doesn’t matter if you are married or not, no one has the right to treat you that way.",
            "You married a dirty old man",
            "No one has the right to touch you when you don't want to be touched, even your husband.\n\nYour son is seeing this happen... Think about what type of man you want your son to be.",
            "This man has punched you, raped you, and is sexually assaulting you on a regular basis. You need to get you and your son to safety. Your life and your child's life are in deadly danger with this man.",
            "I briefly dated a guy who did something similar. The relationship ended because he felt entitled to touch me how he wanted, when he wanted, regardless of my feelings.",
            "I have read your post history. Please find a women's shelter and leave. You are worth far more than being sexually and physically assaulted and threatened with your life. I wish you you all the best. Please ask for advice on how to leave him. Your life will not get better until you do. Hugs."
        ]
    },
    "My 29F Boyfriend 30M was 100% certain on marriage and now 1.5 years later he’s “unsure”. Am I an idiot?": {
        "title": "My 29F Boyfriend 30M was 100% certain on marriage and now 1.5 years later he’s “unsure”. Am I an idiot?",
        "score": 233,
        "url": "https://www.reddit.com/r/TwoXChromosomes/comments/1dr4n56/my_29f_boyfriend_30m_was_100_certain_on_marriage/",
        "content": "So my boyfriend courted me like no tomorrow. Flowers, food delivery, flights, dates, gifts, you name it. He went out of his way to get our families involved. He loved spending time with my siblings and mom. My dad died suddenly during our time together and he stepped up. However we were still only 4 months into dating. It was a lot I guess for a new relationship. He started saying things like he loves me and sees ne around forever. He initiated the conversations about the future and kids. And then after a boys trip to Mexico he came back and was super distant. He began acting like my presence irritated him. I felt a pulling away and asked. With some\nGentle coaxing he finally confessed he’s no longer sure about me and is worried about wasting everyone’s time. He wouldn’t tell me what his concerns are but just asked for more time and to take things slow. In the moment I agreed and thought this was reasonable but the more time passed the more I realized I was pissed off at this man for winning me over with the notion of marriage and then just switching up. \n\nIt really hurt me and I hence I ended up in a messy break up. I still love this man but I just see an anxious avoidant trap playing out.\nHe didn’t seem to want to work on things. He’s rather pretend there’s a happier more positive option for him out there and I refuse to chase. I know my ego is getting in the way but my anxiety was peak high towards the end with this guy. He made me lose a lot of the little self esteem I had to begin with. I miss having him in my life but also hate that he didn’t accept\nMe for me and if anything rejected me once he got to know the real me. \n\nAny advice on how to move forward? My entire vacation in Italy has been moping about this man who has now ghosted me for over two months. \n\nAddendum: I forgot to mention, he told me he’s been unsure for 9 months. That’s half our relationship. This coincides with the time we went to a fitness event as a group and he placed both his hands on my sister and another girl’s butts to help then with an obstacle. He paid for our hotel and drove us to the event but I couldn’t get past the weirdness of this gesture especially since he seemed to be withholding physical touch from me at this point. I raised my concern with him and he seemed devastated that this was my takeaway. I understand how he might’ve been hurt but I also couldn’t overlook this issue. Iunno maybe I was immature and insecure. This seems to be the genesis of our downfall…lol ",
        "num_comments": 110,
        "comments": [
            "Focus on yourself, on establishing what you want in your life and for your future. This man is now part of your history. It's not easy to get over someone you loved but time marches on and you go through the stages of grief as they come but keep moving forward regardless. \n\nYou're in Italy?! Honey Jesus H. Christ! Go out there and have fun! Go do stupid tourist stuff, pick a random restaurant to visit, go enjoy your life. Put your phone down, go and actually actively participate in your life instead of looking over your shoulder.",
            "You aren't an idiot at all, dear! It is so hurtful when you open up to a person, feel loved and safe and suddenly everything changes without warning or reason. I can only tell you from experience that time will make everything better. You may even get an unterstanding why he acted like an asshole. However you are right not to chase him and it is not a case of \"ego getting in the way\" but  necessary to keep up self respect and self care. Don't take blame or feel he rejected the real you. Very often it doesn't have anything to do with you at all! Take time to heal, maybe get therapy. And try to live in the moment and not in the past. Italy is far to beautiful to waste the experience on a man.",
            ">And then after a boys trip to Mexico he came back and was super distant. He began acting like my presence irritated him. I felt a pulling away and asked. With some Gentle coaxing he finally confessed he’s no longer sure about me and is worried about wasting everyone’s time.\n\nIt honestly sounds like he cheated on you during that \"boys trip\" to Mexico and doesn't want to admit to it.  His becoming distant could be the result of guilt or it could be the result of him realising that what he feels with you isn't what he thought it was - I do not know him at all so I cannot really say for sure.",
            "Cut him off all socials and stop sharing your location.  You are right that he is trying to make you doubt yourself by halfassing the breakup.  Move on and heal.  If he truely wants to get back together, he has your phone number and can do so properly.",
            "Sounds like he manipulated you from the beginning.  Any promises of marriage less than 1.5 years in a relationship should send red flags in the future.  Marriage is a mutual agreement something discussed at the right time",
            "Likely cheated on you in Mexico or had encounters with prostitutes there, decided he would rather live it up or become a passport bro than have a future with 1 woman. Good riddance.",
            "The fact he changed after the guys trip is a red flag. He friends probably discouraged him. I would get to know his male friends. Sometimes friends especially male friends resent their friends getting married.",
            "Depends on whether you decide to stay in an unsatisfying relationship",
            "do you live in montreal? this sounds exactly like a dude i dated in Montreal several years ago. turned out he was bipolar.",
            "People change, people change their minds. For better or worse.\n\nExpensive gifts are a red flag though, basically trying to buy you."
        ]
    }
}