{
    "NEW TO CAMPUS MEGATHREAD: Post all your admissions, housing, new-to-UBC and general questions here!": {
        "title": "NEW TO CAMPUS MEGATHREAD: Post all your admissions, housing, new-to-UBC and general questions here!",
        "score": 798,
        "url": "https://www.reddit.com/r/UBC/comments/q44oiu/new_to_campus_megathread_post_all_your_admissions/",
        "content": "Per the deluge of complaints we've gotten, all admissions, housing, questions about being new to UBC (e.g. what should I know as XYZ, give me life pro tips) and general questions (questions that don't deserve their own thread and things that you really should've Googled first) belong here.\n\n---\n\n**Other Megathreads**\n\n* Course, program and major questions megathread: https://redd.it/ke5yjc\n\n---\n\n**Previous Megathreads**\n\n* Previous new-to-campus megathread (admissions+housing): https://redd.it/m6rqr0\n* Previous housing megathread (including odds for waitlist): https://redd.it/ftyx13\n* Previous admissions megathread: https://redd.it/iwnazm",
        "num_comments": 36641,
        "comments": [
            "I think I speak for lots of people on here: If you have been accepted, and are NOT going.... PLEASE REJECT so that other people can get off the waitlist.",
            "#READ BEFORE COMMENTING! (admissions) ↓\n\nA couple of notes:\n\nPlease provide us with as much pertinent information as possible.\nEveryone is always more helpful when it seems like you've already tried to solve your problem. Tell us what you've searched, and that sort of thing.\nThe answer to many questions will be 'get in touch with someone who works for UBC'. The process changes every year, and nobody here works for UBC.\nTry to ask several small questions. For example, don't ask if you should apply for residence - that's totally subjective. Ask specific questions you have about residence.\nRemember that everyone is doing this out of the goodness of their hearts.\nUpvote good answers: saying 'thanks' is nice, but if someone helped you out, upvotes will make the information more visible to everyone.\nPre-med and pre-law are not real major/specialization options at UBC. If you say that you are pre-anything, it will become obvious that you don't know what you're talking about. Calling yourself that generally causes people to make prejudiced judgements about your personality.\nDo not:\nTake any information on reddit as more valid than anything you hear from UBC.\nSuggest taking multiple offers from UBC, SFU or other competitive admissions-based schools when you have no real intention of going there or in case you fail to maintain your conditional offer. You'll be banned for admissions fraud. Review application ethics here.\n\n##**Common Myths:**\n\n###Myth 1: Going straight into a major.\n\nPlease be mindful that specializations for many faculties are chosen in second or third year, based on your GPA at UBC (not your high school average).\n\nExample 1: There is no direct entry into Computer Science from high school, and you would apply after completing your first year of UBC Science or Arts, or in the summer before Commerce first year.\n\nExample 2: There is no direct entry into English from high school. You would declare it after completing your first year of UBC Arts (there may be other procedures depending on your degree program) in SSC. There is no application process (except for honours).\n\n###Myth 2: The \"internal transfer loophole\"/\"It's easier to transfer within UBC/from another university.\n\nNearly just about everyone who is rejected for their first choice (e.g. Science, Sauder) and who puts down Forestry, Arts, SFU or UBC-O as their backup option, has a big brain moment where they think that they'll take the offer that they have no interest in, with the intention to transfer to the UBC faculty they want to get into. This is usually informed by some misguided, desperate attempt to study at UBC, and the belief that it'll be an easier transition. This rarely works, and every year, a large proportion of people, believing in the internal transfer myth, posts on reddit about how their academic plans, dreams and lives have been derailed.\n\nIt is not easier to transfer between UBCO to UBC Vancouver, or between the Faculty of Arts/Forestry -> another faculty. UBCO/SFU/UVic/other university students do not have an advantage over transfer college students (and this may even be the opposite).\n\nYou require the same grades as you would if you were transferring between schools. High school students sometimes consider UBC (and other university) courses to be harder than their college-transfer counter-parts. Not all credits from UBC-O transfer to UBC Vancouver. They are considered to be separate schools curriculum wise.\n\nThink hard and wisely on why you may have been rejected from your first choice. Every student convinces themselves that they'll do better on the next try. We're all guilty of it; but we rarely follow through. It's common knowledge that getting great grades in high school is not a predictor of whether you'll do exceptionally well in university, but getting grades that don't meet the cutoff for your first choice program is generally a good predictor of whether you won't do well in your first year, especially if you're studying something that you have no interest in or your calculus background is weak.\n\nExternal transfers from college transfer programs such as Corpus Christi College, Langara and Douglas tend to be issued much earlier than internal transfers. For all intents and purposes, external transfers take precedence over internal transfers.\n\nIf your end goal is to study business and you were only admitted to UBC Arts, then you should take the Beedie offer, and failing that, you should register for a college transfer program. If your end goal is to study science, and you were only admitted to UBC Forestry, then take the SFU offer in science, and failing that, register for college transfer program.\n\nUnless you're exceedingly confident that you can pull this off or wouldn't mind graduating with a degree in your second choice, it's almost never a good idea to try and transfer from Arts, Forestry, or UBC-O to a program at UBC.\n\nWe say this after having heard nearly a hundred stories about the stories where people didn't make it. We're serious: Don't take this decision lightly.\n\n###Myth 3: ECs make your Personal Profile\n\nThere is an enduring myth that the number and type of Extracurricular Activities you list in your personal profile equates to how good your personal profile is. This is false, and several above-average students who feel that they wrote above average personal profiles are consistently waitlisted for UBC. At the same time, students with few ECs or just a single part time job are admitted in early admissions without issue.\n\nIt should be obvious that not everyone applying for UBC comes from an upper-class, highly-ranked school background, and that many of the supposed very strong ECs such as leading a club, winning national writing awards or saving puppies from Ebola are simply not available to youth in many parts of the world, especially those from rural or Indigenous communities. Some ECs considered strong by high school students are actually very weak, dubious or even unethical, such as voluntourism (aka volunteering abroad) or claiming to found a non-profit organization/NGO with no clear impact or scale.\n\nSeriously, when 1 out of every 3 applicants is the founder of a \"student-run not-for-profit organization dedicated to xyz\", a Model UN \"Secretariat\" or \"Vice President of Engagement and Special Projects\", it's not unique, leadership experience or remotely interesting: it's giving yourself a loaded title.\n\nThere is no sugar coating this. Personal profiles are largely scored by alumni, who are at a fundamentally different place in life with a much different understanding of what is important and meaningful, and what is not. What may seem like a killer EC for you (i.e. saving 100 puppies from Covid-19), will probably read like a poorly articulated attempt to pad your resume to anyone past their second year at UBC, while a minimum wage job delivering newspapers or helping your mom battle cancer*, may read as a genuine commitment to hard work, perseverance and investment in your community. (Note: Family responsibilities are considered a valid leadership activity)\n\nYour personal profile is scored based on how profound, exceptional and meaningful your accomplishments were, especially in the context of your personal development and resiliency. If your answers just list out various responsibilities you had while volunteering or brag about the non-profit you run, you have a bad personal profile. When you claim you had a great or terrible personal profile because of how many ECs you have, everyone here rolls their eyes, and either moves onto the next question or will call you out with this myth.\n\nIn the words of one PP scorer: Don't write what you think we want to hear. Write in a way that shows us who you really are.\n\n###Myth 4: Admissions offers are handed out linearly\n\nJust because your friend Sally from Surrey got an offer before you, doesn't mean that you were passed over for an offer or that you're less qualified for UBC than they are. Admissions offers are processed in batches of students with similar backgrounds.\n\nBatches might include: International IB students, BC students in Linear systems applying for Arts, BC students in Semester Systems, AB students, Transfer students from BC, UBC-O transfers, ON students with a first choice in Science, Domestic students applying for Sauder.\n\nThere's no point getting anxious when other people on reddit have gotten an offer before you have. It doesn't really mean much; you should start worrying when you're waitlisted or rejected, not beforehand.\n\n###Myth 5: That we know what we're talking about\n\nThe vast majority of people who are answering questions on this thread are either other applicants, or current UBC students. Other applicants tend to not know more than you might from a bit of Googling, and the current UBC students are the ones that have made it (you don't see rejected applicants hanging around, telling you if the \"good advice\" is actually wrong).\n\nWe aren't admissions officers, and there are way more factors than what you think your calculated GPA is, or how well you think you did on a personal profile question. We don't really know how grades are weighted, how current personal profiles are scored, and how many seats will exist for X and Y program this year. We can't tell you if you have a good case for appealing a decision. We can't predict how much money the provincial government will be awarding this year for domestic student seats.\n\n**In reality, if you have a question about admission, you should be calling or emailing admissions. Don't blame reddit if you're fed outdated or wrong info. If you're asking about your chances, you're going to get dicey guesses at best.**",
            "I think ubc will release decisions after I graduate from UofT",
            "I probably sound like I’m complaining (which I am) but is anyone else starting to get extremely irritated with this whole process? I get that there are a lot of applicants and the admission process takes time…but to think that some of us have been waiting well over 5/6 months for an answer/not getting answers in time to make decisions about other schools doesn’t sit right with me. We’re paying these damn application fees for what? People’s lives are literally being put on hold here, man. Absolutely ridiculous. \n\nAnyway. Rant over.",
            "[deleted]",
            "waterloosimp wish all early applicants bestest of luck. \n\n&#x200B;\n\nwaterloosimp will constantly refreshing megathread.",
            "PLEASE UBC PLEASE JUST GIVE ME A DECISION",
            "Stop teasing me with the “Your Journey to UBC” virtual info sessions 😩😩 just tel me if I got in 😩😩",
            "I just know y’all shakin yo boots today because same but also not really because ubc doesn’t deserve me but ill go if i get off the waitlist because my ego would never decline but also ubc doodoo peepeepoopoo and shouldve accepted me early good luck everyone",
            "[deleted]"
        ]
    },
    "Workday Woes Megathread #2 + Newly updated wiki section": {
        "title": "Workday Woes Megathread #2 + Newly updated wiki section",
        "score": 18,
        "url": "https://www.reddit.com/r/UBC/comments/1dfnerz/workday_woes_megathread_2_newly_updated_wiki/",
        "content": "## 1. Updated guide:  [ubcwiki.ca/course-planning/registration/](https://ubcwiki.ca/course-planning/registration/)\n\nWe have updated the registration page on the community wiki. Tools that no longer work because they were made for SSC have been replaced with the tools that were made for workday (see the **\"Survive Workday\"** section). We also updated the FAQ and important reminders section with information that has come up frequently.\n\nIf you think something should be included on this page or this post, please send us a modmail or use one of the other contribution options.\n\n## 2. Enforcing Megathread\n\nWorkday and registration questions are now being reported as spam or duplicates. We are going to start sending most of the workday related questions to this megathread.\n\nThis should clean things up and create one place for people to answer questions. This thread will be sorted by new, and we are open to adding relevant information to this post or the wiki page. See above.\n\nIf you think something belongs in a top level post, such as a PSAs about an issue you discovered, let us know!\n\n---\n\nPrevious threads:\n\n- [Workday Woes Megathread #1](https://www.reddit.com/r/UBC/comments/1cxyyoq)\n- [All Caps Rage Thread](https://www.reddit.com/r/UBC/comments/1cxyxin)",
        "num_comments": 111,
        "comments": [
            "Why does it say some of my term 2 courses are ineligible? I have all the pre-requisites in term 1 and can't figure out why I can't take it (the course is COMM 191 btw)",
            "haha this sucks so much compared to ssc i'm gonna eat beans",
            "anyone else stuck with their course registration?",
            "what is going on with math 100, im trying to regisger for term 2 it says 24 spots are available yet I’m waitlisted",
            "The xlsx to ics tool doesnt work, ok campus if that matters",
            "How do you get a calendar schedule? Sem 1 overlaps with sem 2 and you cant see the texts on it. You cant even add them to the saved schedules because when sem 1 classes overlaps with sem 2 it gives an error",
            "Any 3rd year student got registration appointments today?",
            "Hi I'm the author of the Workday Hide Average extension, I finally published it to the chrome store as unlisted [here](https://chromewebstore.google.com/detail/lidgjcpdepnoaeagepckbnklnccgifij?authuser=0&hl=en). I haven't tested on other browsers besides Chrome so it might not be super robust.",
            "Hi - I keep getting an error that says:\n\nYour saved schedule is missing course sections that must be taken together.\n\n  \nI've already registered both lecture and discussion sections to my saved schedule. Is there anyway to resolve this issue? Thank you so much!",
            "Added a major and it shows reqs as 0 out of 0?"
        ]
    },
    "Parking ticket for 2 mins": {
        "title": "Parking ticket for 2 mins",
        "score": 99,
        "url": "https://i.redd.it/lk476ev0ge9d1.jpeg",
        "content": "The parking ticket of UBS is ridiculous. First time visiting UBC and getting a parking ticket for exceeding 2 mins is a great experience.",
        "num_comments": 33,
        "comments": [
            "Just dispute the ticket on the website and they will cancel the ticket.",
            "Oh yep they‘re insanely quick 🙂🙂",
            "oh the humanity! good on the police for enacting the full power of the law on a dirty criminal like yourself!",
            "The officer probably cooked off the meter. Saw that time was about to expire and basically wrote the ticket as soon as it expired. Easy way to fill a quota.\n\nParking enforcement in Toronto is notorious for this. They spot cars with less than five minutes left on the meter and just sit there and prepare the ticket and issue the ticket within seconds of the meter expiring. \n\nAs to penalties, UBC basically has municipal powers on campus. They write their own rules and their main enforcement for parking violations is towing or immobilizing a vehicle after three unpaid infractions. They could go to Court for the usual remedies for a debt but this would be unlikely. ",
            "You got spawn camped",
            "Unless you’re planning on getting a parking pass I wouldn’t pay. UBC parking is considered to be a private parking lot so nothing will happen to you.",
            "Thank you guys for the information.  \nI feel much better now.",
            "Just dont pay for it..  however, ubc will tow after the 3rd unpaid ticket.\n. \nI haven't paid for mine... and it was like from back 2017. Lol",
            "Take the bus next time",
            "You were in the parking lot earlier, that’s how I know you."
        ]
    },
    "Is is still possible for people to get PhDs in their early, mid 20s nowadays?": {
        "title": "Is is still possible for people to get PhDs in their early, mid 20s nowadays?",
        "score": 8,
        "url": "https://www.reddit.com/r/UBC/comments/1dqy596/is_is_still_possible_for_people_to_get_phds_in/",
        "content": "Stephen Hawking got his PhD at 24 and Einstein completed PhD became professor at 26. Does this still happen regularly in some departments or it was due to different education system at the time in their countries?",
        "num_comments": 10,
        "comments": [
            "Depends on the field, the institution, and the student.\n\nPhDs are generally brief in Europe compared to North America. Europe has lots of three-year undergrad programs and three year PhD programs are not uncommon. Some of the older universities, most famously Oxbridge, give their three-year bachelor degree recipients a masters degree automatically two-years later. \n\nLots of European 25-26 year old PhDs but they often have to complete a number of post-docs to have training comparable to the North American PhDs. In Canada the main funding agencies often have a five-year cap on funding so five-years tends to be an upper limit but this is often after a two-years masters so you can get seven years of grad school funded. In the US the rich schools have huge endowments and don’t care about external funding rules so the richer US universities often keep PhD students around for eight plus years. Although in the US this often includes the masters degree-independent research masters degrees are rare-they are usually rolled up into a doctoral program. I can think of a fair number of US trained friends who spent ten years in their doctoral program. In fairness, the rich US schools usually pay reasonably well compared to Canadian schools which softens the blow. And you will be more likely to get a research or faculty position out of the prolonged PhD without having to do endless post-docs like the European grads usually need to do. ",
            "In the uk, yes.  My ex got her’s at 23.",
            "Many PhD programs don't require a Master's to enrol so you could theoretically, without being a child prodigy, graduate high school at 18, get your Bachelor's at 22, and then your PhD at 26.\n\nPerhaps if you are somewhat gifted, like if you attended UBC's Transition Program, you could graduate high school a lot earlier than 18 or finish your Bachelor's in 3 years if you applied a bunch of credits. Conducting original research to finish a PhD in less than 4 years is probably a lot less common than the previous two.",
            "It‘s pretty rare but generally the possibility exists.",
            "The Oxbridge ma doesn’t count for graduate work tho; most do a MPhil or MStud as the bridge to a PhD program",
            "how come it is fewer years of study? In the arts, it is typically 2 year MA, plus 6 years for PhD. As explained to me by a grad student in history",
            "Not that rare.",
            "Nope. You don’t have to do an ma (it’s usual in Canada, but in USA it’s often direct to PhD program). The uk ma is 1 year, then 3 for the PhD.",
            "why does the Canadian form take more time?",
            "Because it’s more aligned with the us structure"
        ]
    },
    "CPSC 317 2024 S1 Final Exam": {
        "title": "CPSC 317 2024 S1 Final Exam",
        "score": 7,
        "url": "https://www.reddit.com/r/UBC/comments/1dqv21m/cpsc_317_2024_s1_final_exam/",
        "content": "How we feelin' folks?",
        "num_comments": 5,
        "comments": [
            "Does Prairie learn save my asnwers even if I didn't submit 🤡",
            "anyone else see their grade after submitting lol",
            "I haven’t seen my grade yet but not too too bad. I felt it was a step up from the quizzes, since those were quite similar to the practice questions.",
            "Yeah it does. You're good."
        ]
    }
}