{
    "Monthly Existing User Promo Code Thread": {
        "title": "Monthly Existing User Promo Code Thread",
        "score": 28,
        "url": "https://www.reddit.com/r/UberEATS/comments/1d6948i/monthly_existing_user_promo_code_thread/",
        "content": "**Do not post new user/referral promo codes. You will be banned.**\n\n&#x200B;\n\nPost promo codes for existing users here.  Do not post them anywhere else.\n\n&#x200B;\n\n**Don't downvote someone just because a code doesn't work for you.**  Some codes are targeted or region-specific. Others may have expired before you tried it.\n\n&#x200B;\n\n**Top level comments must be promo codes for existing users.**  Do not post a promo code that is already in the thread.  Reply to that code if you have input. Violations will result in a temporary ban. Multiple violations will result in a permanent ban.\n\n&#x200B;\n\n**Do not ask for promo codes.**  If there are no working promo codes listed here, complaining/asking for codes is not going to make more magically appear.\n\n&#x200B;\n\n**FINAL WARNING: DO NOT POST NEW USER/REFERRAL PROMO CODES. YOU WILL BE BANNED.**",
        "num_comments": 62,
        "comments": [
            "College24 got me $10 off my next 10 by July 1 in Raleigh/Durham",
            "[removed]",
            "Any codes for phoenix?",
            "Hello u/AutoModerator, please take a moment to review our subreddit rules if you haven't already. \n\n(This is an automatic reminder added to all new posts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UberEATS) if you have any questions or concerns.*",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "Expiration  \nJun 30, 2024 at 11:00:00 PM Mountain Daylight Time  \n\n\nLocation  \nRaleigh-Durham  \n\nDetails\n• For 10 orders  \n• $15 minimum order  \n• Delivery orders only  \n• Alcohol or other regulated items may not be eligible for this promotion  \n\nOffer valid for $10 off your next 10 orders at select restaurants before 6/30/24. Order min of $15 (before taxes/fees) required. Taxes/fees still apply. Must apply promo code in app before completing the order. Delivery only. Cannot be combined. US only. Raleigh-Durham only. Until supplies last. Offer & terms subject to change. See Uber Eats app."
        ]
    },
    "We need to get rid of tip editing": {
        "title": "We need to get rid of tip editing",
        "score": 6,
        "url": "https://www.reddit.com/r/UberEATS/comments/1dr5o7g/we_need_to_get_rid_of_tip_editing/",
        "content": "It is absolutely not fair that we accept a job with an expected income for said job only to end up in the loss when you have to drive 40 minutes to a drop off for only 2$. That is not fair at all to drivers. They LOOSE their gas. ",
        "num_comments": 16,
        "comments": [
            "i must disagree\n\ni get great tips on uber eats, and i think that's partly because they know they can take the tip back if i don't do a good job\n\nit's really rare that anyone actually removes or reduces the tip... and you can just call support and ask to be permanently unpaired from them",
            "Hello u/Dannie2930, please take a moment to review our subreddit rules if you haven't already. \n\n(This is an automatic reminder added to all new posts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UberEATS) if you have any questions or concerns.*",
            "Agreed",
            "They need to take a look at their competitors on how they do it for their  drivers, they might learn something! Unfortunately drivers get the short end of a stick.",
            "$2 base fare for 40 minutes drive is very wrong to begin with",
            "As a customer, bad drivers are unfortunately a semi frequent occurrence.\n\nThere is no way I'm tipping big up front without the ability to remove it for poor service, which is why I always use Uber over DD when ordering.\n\nA lot of drivers think they should be the top priority of all of Ubers decisions, and forgot that they also have to cater to the customers who order as well. This is a decision that favors the customer. Doordash went with the driver.",
            "For this order the tip was removed after he invited me into his trailer and asked if he could kiss me. After I decline the tip is removed. It is the first time it has happened to me but it sucked",
            "Most definitely. There was a 10$ tip he took off after he tried to invite me into his trailer and asked if he could kiss me than COINCIDENTALLY my tip was removed.",
            "People always add more tips later, they don't need to be massive upfront. We are constantly being scammed by customers and we are the ones paying out of pocket.",
            "well that is sexual harassment, extortion, very fucked up. \n\ni wonder if the cops would do anything if you called them about it?"
        ]
    },
    "Had a customer try to get me to go into his trailer": {
        "title": "Had a customer try to get me to go into his trailer",
        "score": 4,
        "url": "https://www.reddit.com/r/UberEATS/comments/1dr5w10/had_a_customer_try_to_get_me_to_go_into_his/",
        "content": "I did a delivery tonight and the customer tried to get me to go into his trailer and asked me for a kiss. I refused both so he took the 10$ tip away and I lost money on that order having drive a total of 40 min (20 each way) for 2$. When I called customer service to report the man all they did was remove him from my pairing!!!!!! What about the next female delivery driver!?!? How am I the one being punished for holding onto my MORALS!?!?",
        "num_comments": 5,
        "comments": [
            "20 miles for $12? You accepted that?????????????????????????????????????????????????????????????\n\n![gif](giphy|m7FdxI252QN3y)",
            "Hello u/Dannie2930, please take a moment to review our subreddit rules if you haven't already. \n\n(This is an automatic reminder added to all new posts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UberEATS) if you have any questions or concerns.*",
            "Be happy you didn’t lose your life. That experience gave me second hand creeps.",
            "Needed the money. Only had one other order the entire day and I was on since 8am.",
            "Definitely. I carry a tazer on me but it didn't help it was dark"
        ]
    },
    "Tired of UberEats, customer service is terrible.": {
        "title": "Tired of UberEats, customer service is terrible.",
        "score": 8,
        "url": "https://www.reddit.com/r/UberEATS/comments/1dr1nr0/tired_of_ubereats_customer_service_is_terrible/",
        "content": "This is post for venting. I am really tired of UberEats and their stupid policies. \n\n1) The other day, I ordered an item for my friend in a different city (Chicago). The driver didn’t even bother delivering the order. Took an image of an entirely different order, from a different restaurant, that was already lying there in the lobby, submitted of that order as a proof of delivery and completed the trip. \n\nOutcome: I paid an insane amount for the food, which UberEats claims was delivered (as per their policies) and hence it’s not eligible for refund. I paid for a delivery that never happened. \n\n2) Today I ordered 2 items which included a can of coke. Upon delivery, I see the coke can is missing. I file a complaint again stating my drink is missing. \n\nThis is the response I get \n\n> After looking into this order and the information provided, it was determined that the delivery matches the order. Therefore this order can't be refunded.\nIn addition, after reviewing your account, we’ve noticed repeated violations of our refund policy. We encourage you to review the Uber Community Guidelines if there are further questions.\n\nWhat did I do for that I get flagged for repeated violations?\n It’s not like I’m claiming refunds for every order I make (I order often and I have good enough history for that).\n\nThe complaints I filed are genuine cases where one or the whole is stolen from me and I still have to pay it. \n\nI think messing around with customers is part of their policy. Might as well steal my money and call it a part of their policy.\n",
        "num_comments": 7,
        "comments": [
            "They do their employees dirty too. I had a order this evening that was 20 minutes drive time each way, when I got there the note displayed requesting that I get him WEED (we live in Nm where it's legal) and drop it off and included his phone number. When I got there he begged me to give him a ride to the weed shop before they close and said he'll fill up my tank and give me 40$. I chose to help him out to be kind. He did fill up my tank but when I dropped him off he tried to get me to go into his trailer and asked me for a kiss. I reported the sexual harassment to Uber eats and they just said they won't pair us together.",
            "Hello u/Gullible-Leader-3107, please take a moment to review our subreddit rules if you haven't already. \n\n(This is an automatic reminder added to all new posts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UberEATS) if you have any questions or concerns.*",
            "I would throw the blame at them and say \"Check the GPS location of the delivery agent THEN tell me I'm wrong\"\n\nI quit using Uber eats a long time ago and only use doordash, mostly because one of my brothers is a driver for them and even before that, never had any issues so far and I've been using them for years.\n\n\nIf über eats says they can't look up the GPS, they are lying through their teeth and don't want to take responsibility.\n\nPersonally, I'd just contact your financial institution with a clause of improper billing of services and failure of said party to issue a refund and negligence to provide proper proof to said correct delivery address. \n\nIf they deny or cancel your account, document everything (emails, screenshots, etc) just in case.\nThey just don't want to admit their workers are fucking around so they can get paid.\n\n\nBut that's just my 2¢",
            "Does their customer service even exist anymore? They fucked up my entire order, only got bot bullshit for a partial refund, do not see any venue for human contact whatsoever.",
            "Forgot to add he removed my tip so I drove 40 minutes to deliver his food for 2$"
        ]
    },
    " ÜBER EATS is THE WORST!": {
        "title": " ÜBER EATS is THE WORST!",
        "score": 6,
        "url": "https://www.reddit.com/r/UberEATS/comments/1dr2icj/über_eats_is_the_worst/",
        "content": "I’m so fed up with this poorly run company. Maybe Amazon is hanging out with UE? Idk, but, it’s a gosh darned miracle when my order is correct, everything I paid for is there, the driver knows how to read directions and makes it to my location and the driver is who the app says they are. I’ve spent too much money with them hoping they’d finally get it right but, it’s gotten worse. I’m so DONE! Customer service does nothing, like Amazon and I’m cutting ties as we speak. If there’s a class action law suit, please send me the info. I’ve got more than enough damning  evidence than one person should have. ",
        "num_comments": 10,
        "comments": [
            "You know, just throwing this out here. Everyone keeps blaming UE or Skip or DD but have you ever tried just contacting the restaurant directly? It is the restaurant that screwed up am I right/wrong? \n\nNow trust me, I am not saying you are wrong and they are right, but everyone just goes through uber support and have problems, call the restaurant? Maybe they will fess up to the problem and offer a refund on their own end. Just saying, doesn't hurt to try.",
            "They rather protect their ego than to fix any issues. Had to talk to them about the location of one of the resturant being off nearly 3 and a half miles from the agreed apon pickup. Uber way of fixing it is to call the resturant to get the order. Told them that's cheating drivers out of their pay but of course, they'd lie....but you can't say they lied or you are a very very evil person.\n\nNow all the sudden I'm getting invoices like this. All my deliveries were in fact delivered.\n\nhttps://preview.redd.it/bt3jnogdyf9d1.png?width=1080&format=pjpg&auto=webp&s=9caa8b7fab65851d014ade7657bb484218587dfd\n\nPlus 3 extra cancelations have been added onto my cancel %. I was at 0% last night and canceled only twice today but shot up to 5.8%. What is up with the 0.8 part?!",
            "Walmart says we can't fix the problem if we don't know about it. With Ubereats, the drivers don't have communication. \n\nCould you imagine, if Ubereats had PowerPoint lessons online course. Please don't leave food in front of door screens because they go outward. My dumbass was putting the drinks right next to the door. At Walmart they have cbls.",
            "Well its even worse for us drivers, like today I delivered a 44 dollar order and only got 3 bucks out of it including tip that was only 2 bucks and I drove 10 miles into the countryside.\nI have no idea how Uber is getting away with these peasant wages, its practically slave labor lol.",
            "Hello u/Downtown_Leopard6525, please take a moment to review our subreddit rules if you haven't already. \n\n(This is an automatic reminder added to all new posts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UberEATS) if you have any questions or concerns.*",
            "Nobody cares",
            "I have tried that before and I’ve been told to contact UE",
            "That sucks! I’m sorry.",
            "What exactly is wrong with my post?",
            "If you’re curious, you got downvoted for ignoring the obvious text in the bot response"
        ]
    }
}