{
    "uBlock Origin (uBO) 1.58.* Announcement Thread || Please follow all the RULES of the subreddit and the Posting Guidelines": {
        "title": "uBlock Origin (uBO) 1.58.* Announcement Thread || Please follow all the RULES of the subreddit and the Posting Guidelines",
        "score": 136,
        "url": "https://www.reddit.com/r/uBlockOrigin/comments/1cx8m6j/ublock_origin_ubo_158_announcement_thread_please/",
        "content": "## Changelog:\n\n[https://github.com/gorhill/uBlock/releases/tag/1.58.0](https://github.com/gorhill/uBlock/releases/tag/1.58.0)\n\n* Interface\n    - [Improve dashboard layout at high zoom factor](https://github.com/gorhill/uBlock/commit/6152f5269e)\n    - [Add a console pane to the logger](https://github.com/gorhill/uBlock/commit/3b4f02db21)\n    - [Fix bad date computation in auto-comment feature](https://github.com/gorhill/uBlock/commit/a5f6c35bb0)\n    - [Fix regression breaking import of `file://` lists](https://github.com/gorhill/uBlock/commit/c223a8cd39)\n    \n* Core    \n    - [Add checksum validation when loading trie buffers in selfie](https://github.com/gorhill/uBlock/commit/0e6d607484)\n    - [Fix potential corruption when reading serialized data](https://github.com/gorhill/uBlock/commit/c098eb8625)\n    \n* Scriptlets    \n    - [Improve `trusted-click-element` scriptlet](https://github.com/gorhill/uBlock/commit/ee67cd6284)\n    - [Catch exceptions in API calls for the sake of old Chromium versions](https://github.com/gorhill/uBlock/commit/bb479b0a66)\n    - [Add `accept`/`reject` to `set-local-storage-item`](https://github.com/gorhill/uBlock/commit/363ad6795c) (by @ryanbr)\n    - [Improve `noeval-if` scriptlet](https://github.com/gorhill/uBlock/commit/4d8ee35ef7)\n    - [Improve `trusted-set-local-storage-item` scriptlet](https://github.com/gorhill/uBlock/commit/2ccc3135c1)\n    - [Improve `remove-[attr|class]` scriptlets](https://github.com/gorhill/uBlock/commit/91dfcbef2a)\n    - [Improve `spoof-css` scriptlet](https://github.com/gorhill/uBlock/commit/277e90a4a7)\n    - [Add `trusted-replace-outbound-text` scriptlet](https://github.com/gorhill/uBlock/commit/21e1ee30ee)\n    - [Improve `[trusted-]set-cookie` scriptlets](https://github.com/gorhill/uBlock/commit/49ff7cffb1)\n    - [Fallback to `requestAnimationFrame` when `requestIdleCallback` is not available](https://github.com/gorhill/uBlock/commit/59ffc96e89)\n    \n* Filters    \n    - [Replace EasyDutch with AdGuard Dutch](https://github.com/gorhill/uBlock/commit/ca7d2ad61d)\n\n* Building\n    - [Use raw string for regex patterns in python scripts](https://github.com/gorhill/uBlock/commit/923452b788)\n\n    \n\n\n\nVisit GitHub releases page for more information.\n\n**Extension will be auto-updated after browser restart!** (*when available for your platform*)\n\n**If you want to update manually:**\n\n* Do not use links from release page \"Assets\" section - these are not signed.\n* Use add-on store or links in release description on GitHub releases page when they are available (basically - they will be add-on store links).\n* In some cases, installation may be blocked until browser restart. This is protection against accidental mid-session reloads, [Issue #717](https://github.com/uBlockOrigin/uBlock-issues/issues/717).\n\n**Q: Why no release for Firefox yet?**\n\n**A:** [1.58.0 is available on AMO](https://addons.mozilla.org/en-US/firefox/addon/ublock-origin/) as of May 24.\n\nuBO is a [recommended extension on AMO](https://support.mozilla.org/kb/recommended-extensions-program), and as such it must undergo a formal code review each time a new version is published.\n\n**Q: Why Chrome/Chromium/Brave is not updating uBlock Origin?**\n\n**A:** [1.58.0 is available on CWS](https://chrome.google.com/webstore/detail/ublock-origin/cjpalhdlnbpafiamejdnhcphjbkeiagm) as of May 23.\n\nAuto update will occur in stages - to spot and react on possible bugs.\n\n**Q: When Opera version will be updated?**\n\n**A:** [1.58.0 is available on Opera addons](https://addons.opera.com/en/extensions/details/ublock/) as of May 22.\n\nUsually it's submitted a week after bug-free version is published in AMO.\n\n**Q: When Edge Chromium version in the Microsoft Store will be updated?**\n\n**A:** Submission pending.\n\n[Microsoft Store](https://microsoftedge.microsoft.com/addons/detail/odfafepnkmbhccpbejgmiehpchacaeak) submission is controlled by [/u/nikrolls](https://www.reddit.com/u/nikrolls/).\n\nThis is official version and will be kept updated, see [Issue #890 (comment)](https://github.com/uBlockOrigin/uBlock-issues/issues/890#issuecomment-611836643) and following comments.\n\n**Warning:**  importing profile from Chrome may cause issues - you may need to reinstall uBO on Edge to fix this. You can transfer settings by saving them to file in uBO Dashboard -> bottom of the Settings tab.\n\n^(Previous announcement thread) [^(https://www.reddit.com/r/uBlockOrigin/comments/1bquaw8/ublock_origin_157_announcement_thread_please/)](https://www.reddit.com/r/uBlockOrigin/comments/1bquaw8/ublock_origin_157_announcement_thread_please/)\n\n# ​\n\n---\n\n# [**Posting Guidelines**](https://www.reddit.com/r/uBlockOrigin/comments/18wujad/posting_guidelines_how_to_ask_for_help_and_report/) | [**Subreddit Rules**](https://old.reddit.com/r/uBlockOrigin/about/rules) | [**Removal of the \"Purge all caches\" button**](https://www.reddit.com/r/uBlockOrigin/comments/1995cww/why_purge_all_caches_is_now_removed_from_ubo/)\n\n# ​",
        "num_comments": 22,
        "comments": [
            "Just poppin in to say, amid Google trying to fuck it up, yall make the internet usable. Thank you!!",
            "I don't even know how to do this.... thx ublock.",
            "If you're looking for help in regards to YouTube, please post on the YT mega thread",
            ">Hi I don'tknow where to ask this but I'm on Firefox latest build.\n\nCreate a new post about this. At least more users will be able to see it and help.",
            "Since Brave will enable Enterprise policies by default, might as well migrate to it and ditch Chrome once and for all.",
            "Hi I don'tknow where to ask this but I'm on Firefox latest build.\n\nMy filters keep resetting everytime I restart the browser.\n\nThis is very annoying because it keep defaulted to not filtering anything. So I have to tick every box everytime I close my browser.\n\nI also have didabled every other extension and no changes.\n\nI also tried reset to default settings but no changes. I have to manually ticked the filter box everytime.\n\nHelp.",
            "Thank you!!",
            "Many thanks!",
            "thank you so much.",
            "Thanks"
        ]
    },
    "📌 YouTube Detection, Ads & Breakages (2024 / 02 / 18) uBO solutions and related discussions ONLY (Mega Thread)": {
        "title": "📌 YouTube Detection, Ads & Breakages (2024 / 02 / 18) uBO solutions and related discussions ONLY (Mega Thread)",
        "score": 428,
        "url": "https://www.reddit.com/r/uBlockOrigin/comments/1atwzem/youtube_detection_ads_breakages_2024_02_18_ubo/",
        "content": "#IMPORTANT!\n\n**The status page no longer functions. Please disregard any mentions of it. Rewriting the thread accordingly might take some time.**\n\n\n&#x200B;\n\n―――――――――――――――\n\n[**~~View the Wiki copy of this Mega Thread~~**](https://www.reddit.com/r/uBlockOrigin/wiki/solutions/youtube/megathread/)~~ to take advantage of its navigation.~~ (OUTDATED)\n\n―――――――――――――――\n\n**Disclaimer:** YouTube changes their detection scripts regularly, which means there might be times that you encounter their message. There's no way around this if you want to remain logged in. It should only happen in brief periods of time between them updating their script and and our volunteers finding a new solution.\n\n&#x200B;\n\nWhile this post talks mainly about YouTube **detecting the use of \"ad blockers\"** and interrupting or blocking playback, the same instructions apply if you're **seeing ads** or encounter any **unexpected issues** (videos not loading, taking a long time to load, and so on).\n\n&#x200B;\n\nThis post is on a **support forum** for **uBlock Origin** (**uBO** in short). We'll only be discussing/allowing discussions of **uBO solutions** here.  \n**Comments suggesting other solutions** (extensions, userscripts, frontends, apps, etc.) **will be removed**. We don't want the ensuing spam - find another subreddit for these. Similarly with random filters - **all custom filters** need to be **vetted** in a discussion with **uBO Team**. More info in the FAQ below.\n\n&#x200B;\n\n**Do NOT comment if you haven't read and followed the entire post.** There are **specific instructions regarding reporting issues**. Comments ignoring these will be removed.\n\n&#x200B;\n\n**There is a TL;DR below.** Scroll to it or use Ctrl+F to locate it if you find all of this too overwhelming to read.\n\nJust be aware that following the post in its entirety (from top to bottom) will likely answer all your questions. Comments asking about things covered in this guide already or reporting issues without including info required in this guide might be met with removal.\n\n# ―――――――――――――――\n\n&#x200B;\n\n#### 🟧 FOR ANSWERS: START FROM THE TOP 🟧\n\n#### 🟧 FOR INSTRUCTIONS: SCROLL DOWN 🟧\n\n&#x200B;\n\n* [**Image: How the 4 stages of YouTube Detection look like**](https://preview.redd.it/8bsp6n4k11xb1.png?width=1200&format=png&auto=webp&s=3f0ad8c5764f07e5c042ff9970825d04cd9fdb7d)\n\n# \n\n## 🟦 **FREQUENTLY ASKED QUESTIONS** 🟦\n\n&#x200B;\n\n* **What do these 4 stages of detection warning actually do?**\n   * Stage 1 is just a simple popup interruption, you can dismiss it and continue on.\n   * Stage 2 is the same, but the close button is only available after a time delay.\n   * Stage 3 is a type of \"last chance warning\" - it gives you 3 videos to open (not necessarily watch) before it moves you to the next stage.\n   * Stage 4 is the final stage. It's no longer a popup. It replaces your video, making it \"impossible\" to watch.\n* **I don't want my playback blocked! What can I do?**\n   * Simply follow this guide below. It will help you hide from detection and resume your playback.\n* **I heard YouTube is banning accounts if I don't stop - can I prevent that?**\n   * People just misinterpret the \"playback is blocked\" message into thinking they're banned.\n   * There's no reason to think YouTube is going to ban your entire account. This would accomplish nothing - banned users can't buy premium. And would likely just make a new account to continue on.\n* **I've never seen this message. Is this because of my browser being X or Y?**\n   * No, YouTube didn't roll this out to everybody yet. They are still expanding their reach with this impediment to other regions.\n   * The detection is account and cookie based, which means you're less likely to encounter consistent warnings in a private window or just not logged in. Some users report detection occurring without logging in though.\n   * We've had reports of this happening on all browsers. The reason people think a new browser resolved this for them is likely due to it not having old YouTube/Google cache and cookies. The same can be accomplished by creating a new browser profile or by:\n      * Logging out of all Google services,\n      * Closing all YouTube/Google tabs,\n      * Clearing cache and cookies (all or just Google/YouTube),\n      * Restarting the browser,\n      * Logging back in.\n* **Is installing/using uBlock Origin enough to never see this message again?**\n   * Never? Unfortunately, no. As explained the very top of this thread, YouTube changes their detection scripts regularly. This means there can be some windows of time between their new script going live and our filters bypassing it.\n   * uBO can't fix issues caused by:\n      * Other extensions - they don't even need to be YouTube related. Totally random extensions might cause the message. Most common are other content blockers or privacy extensions.\n      * Your browser's own adblocking mechanisms.\n      * DNS blocking, which is often included in a VPN.\n      * Other outside the browser protections such as: HOSTS file blocking, Antivirus/Internet Security programs and other privacy tools.\n   * which is why the instructions below will ask you **to test** without using your personal config. This is to eliminate conflicts. You can try restoring your config later. If you do it gradually, you'll find out what was causing the issue in the first place.\n* **Can I somehow check if uBO's filters are up to date?**\n   * NOT CURRENTLY. YT has changed their approach so the status page no longer works.\n\n&#x200B;\n\n* **I've seen people suggesting I add specific filters, use a userscript or another extension. Is that safe?**\n   * **No, it's not.** Most of the suggested filters going around are very outdated, some were taken from our first threads.\n   * Even fresh filters go outdated very quickly. If they work today, they might be the exact cause of the problem tomorrow.\n   * Userscripts have a lot of power, they can be abused to cause damage. Even \"safe\" ones may cause conflicts.\n   * Same thing for extensions - better not install random ones. And, again, they may easily cause conflicts.\n   * Even if a niche solution works for you and lasts a little longer, it's only because it's too small for YT to care. Once you popularize it, they'll take it down too.\n* **I was able to hide the popup simply by blocking it with uBO's Picker. Why aren't you doing that?**\n   * This only works temporarily. For stages 1-3. You'll still reach stage 4 by doing this. And this might cause scrolling issues, not let videos autoplay, prevent you from adding videos to playlists, and so on.\n* **I'm a technical user, I've read the latest detection script and I believe I found a way of defeating it. Can I help?**\n   * Absolutely! Please contact us via [modmail](https://www.reddit.com/message/compose?to=/r/uBlockOrigin). Or head over to [github](https://github.com/uBlockOrigin/uAssets/issues?q=is%3Aopen+is%3Aissue+YouTube.com%3A+ALL+issues+label%3Aongoing) to contact us there.\n   * Please don't share filters in the comments - even if they were to work now, they'll likely cause issues later. If you contact us, we'll evaluate and perhaps improve them with your help. In which case, they'll be added to our lists for the benefit of everyone. And this will also allow us to update them later when necessary.\n\n&#x200B;\n\n* **How often should I manually update filter lists? Can I somehow automate this?**\n   * Starting **uBO 1.54** default lists get automatic updates **every 5 hours.** There should be no need for manual updates now.\n      * Triggering a manual update will knock you back into a (several days) long cycle (depending on the list).\n      * **Don't do it unless absolutely necessary.**\n      * Before forcing a manual update, make sure **you've excluded config issues + cleared YT/Google cache/cookies + closed old YT tabs and restarted the browser**. If you've done so, but you still get detected - you can try updating the list named `uBlock filters - Quick fixes`.\n      * It's the list containing YouTube solutions. And the only list you might ever need to update.\n      * The above mini-steps might need to be repeated after updating.\n   * ***If you're NOT getting detected. DON'T UPDATE!***\n      * Updating for no reason places burden on the servers hosting uBO's filter lists.\n      * uBO's not a company, it's a volunteer project using free services, which have limits that we cannot cross.\n      * Here's the [estimated bandwidth cost](https://github.com/uBlockOrigin/uBlock-issues/discussions/2958) for just ONE of uBO's CDNs. And that's with lists updating every few days.\n      * uBO 1.54's differential updates get only changes to the files instead of whole lists when updating. This should help lessen the bandwidth usage while making updates much more frequent than before.\n      * **Do NOT undermine this effort by forcing manual updates for no reason.**\n\n&#x200B;\n\n* **The** ***uBlock Origin*** **name is too long - can I shorten it somehow when referring to it?**\n   * Of course! *The correct short name is* **uBO**. Please use this abbreviation freely.\n   * I thought I can just use the first word - is that wrong?\n      * It is. You can read about the extension history including the name change on our github wiki and on Wikipedia. The links are in the sidebar.\n\n# ―――――――――――――――\n\n&#x200B;\n\n# 🟥 PLEASE READ AND FOLLOW ALL OF THE **INSTRUCTIONS** 🟥\n\n&#x200B;\n\n* **First time visitors: Make sure to read the above FAQ, so that the instructions below don't cause any confusion.**\n* **The best place to start it to make a TEST in a new browser profile:**\n   * Firefox\n      * Open `about:profiles` in your address bar.\n      * Click the \\[Create a New Profile\\] button.\n      * Proceed through the wizard, naming the profile as you wish. E.g. \"test1\".\n      * Click the \\[Launch profile in a new browser\\] button.\n      * Skip any config importing/customizations.\n      * Open `about:addons`, search for **uBlock Origin** and install it.\n      * Don't install anything else.\n      * Click 🛡️ uBO's icon > the [⚙ Dashboard](https://github.com/gorhill/uBlock/wiki/Quick-guide:-popup-user-interface#the-tools) button > the [Filter lists](https://github.com/gorhill/uBlock/wiki/Dashboard:-Filter-lists) pane > the [🔃 Update now](https://github.com/gorhill/uBlock/wiki/Dashboard:-Filter-lists#update-now) button.\n      * Open YouTube, log in and browse.\n      * No detection? Great! That means something on your regular profile was causing it. You can proceed to the steps.\n      * Still getting detected? It might be some privacy or adblocking tool outside the browser is causing it. More on that in the FAQ above.\n* **If testing in your regular browser profile make sure to log out of all Google services, close all YT tabs, clear YT/Google (or all) cache and cookies, and restart the browser before logging back in.**\n\n&#x200B;\n\n**‼️ The points below will ask you to remove custom config and disable other extensions. This is only to make sure they're not what's causing the detection message (or other issues you might be experiencing). It's all explained in the FAQ above. ‼️**\n\n&#x200B;\n\n# ―――――――――――――――\n\n## #️⃣1️⃣ Make sure your uBO version is **1.57** or higher\n\n* If it's not - update it. The extension itself. It's for technical improvements.\n   * You do this in your browser's addons/extensions page.\n* **The biggest benefit of the new version is default lists updating every 5 hours**\n   * Forcing manual list updates knocks automatic filter updates back to their (several days) long cycles before you can return to the short cycles.\n\n&#x200B;\n\n* *This is the only point that should not need repeating. So long as your* ***uBO version matches or exceeds*** *what's mentioned above - you're all set for this point.*\n* [**How to update uBO to latest version - video tutorial**](https://old.reddit.com/link/16xnrdx/video/bylnfcoq9wrb1/player)\n\n# ―――――――――――――――\n\n## #️⃣2️⃣ Remove your custom uBO config / reset to defaults\n\n* Remove your custom filters (or disable `My filters` temporarily).\n* Disable ALL additional lists you've enabled.\n* Make sure you didn't disable any default lists.\n* Remove other customizations.\n   * It might be quicker to [make a backup of your config and restore to defaults](https://github.com/gorhill/uBlock/wiki/Dashboard:-Settings#backuprestore-section) instead.\n\n&#x200B;\n\n* [**How to disable custom filters and additional lists - video tutorial**](https://old.reddit.com/link/184fivk/video/kw5v1g92z5xb1/player)\n* [**How to make a backup and reset to defaults - video tutorial**](https://old.reddit.com/link/184fivk/video/fpz6b305z5xb1/player)\n\n# ―――――――――――――――\n\n&#x200B;\n\n## #️⃣3️⃣ Remove all external interference\n\n* If you disable uBO and still get detected - **something else is causing it**. You need to figure out what and disable it.\n* If you disable uBO and don't get detected - something else might be **interfering with our solutions**.\n\n&#x200B;\n\n* **Disable ALL extensions except uBO**.\n   * ALL of them. Really. Do NOT pick and choose what YOU think could be causing this.\n      * Seemingly random extensions have been reported as causing detection.\n      * The same extensions cause it for some but not for others.\n      * Do not listen to other people telling you what extension is safe to keep.\n      * At first, you disable everything. **Once the issue is gone**, you can gradually **try enabling them back**. This will help you find out what was responsible for detection in the first place.\n   * If you're using the **Firefox Multi-Account Containers** add-on - [**DO NOT DISABLE IT**](https://www.reddit.com/r/uBlockOrigin/comments/173jmog/comment/k51eodg/?utm_source=share&utm_medium=web2x&context=3) or you'll wipe all its data.\n   * **Make sure to disable extensions entirely via the browser's addons/extensions page.**\n      * **Whitelisting YouTube** inside specific extensions' settings has been reported as **still causing detection** many times.\n\n&#x200B;\n\n* **Some browsers with built-in blockers to turn off:**\n   * Opera, Vivaldi, Brave\n   * Edge: Click the 🔒 \"lock\" icon on the left of URL bar -> `Turn off Tracking Prevention`\n\n&#x200B;\n\n* **Disable your outside-the-browser ad or tracking protections**\n   * **DNS blocking**/filtering.\n      * It's often included in a VPN.\n   * **Ad/tracking Anti-Virus**/Internet Security **protections.**\n   * **HOSTS file** modifications.\n   * Any other system or network-wide ad/tracking protections.\n\n&#x200B;\n\nAfter getting rid of the issue on default settings, you can slowly start restoring your config (if you *really* need it). Do it gradually, to easier find out what was causing the issue in the first place. Once you find the culprit, simply skip it in your setup.\n\n*If you want to use* ***Enhancer for YouTube***, you have to ***disable its adblocking.***\n\n&#x200B;\n\n* [**How to disable other extensions - Video tutorial**](https://old.reddit.com/link/184fivk/video/wilp9e7ez5xb1/player)\n\n# ―――――――――――――――\n\n&#x200B;\n\n## #️⃣4️⃣ Close all open YouTube tabs and restart the browser\n\n* YouTube is a dynamically updated website.\n  * Navigating inside it doesn't load new pages.\n  * The current page gets updated by adding new content and hiding (not deleting) what's not needed for the link you've clicked.\n  * **This means any detection, ads or breakages experienced on a previously opened YT tab will follow you regardless the steps you take. Until you close that tab (or at least do a manual refresh).**\n* **Chromium-based browsers don't wait for extensions to be ready before loading websites.** This happens at browser launch e.g.:\n  * When starting the browser by clicking an outside link.\n  * When `Settings` > `On startup` > `Continue where you left off` is enabled / when restoring a session.\n  * When opening a link in an incognito window.\n  * When opening a link as a Person/User X (in another profile).\n  * **All such instances will likely encounter ads. This will last until a page is refreshed or the tab is closed an another one is used.**\n\n# ―――――――――――――――\n\n&#x200B;\n\n## #️⃣5️⃣ Keep default lists up to date\n\n* Lists are what determine what's blocked or not. These updates take place within uBO itself.\n* It's an automatic process that shouldn't require your input. If you haven't interfered with default settings (or have reset back to defaults in step 2).\n   * Lists update after specific periods of time, which differ depending on a list's purpose.\n      * All YouTube solutions are included in a list named `uBlock filters – Quick fixes`, which fully updates every 12 hours (as opposed to several days for other lists).\n      * However...\n* **Starting uBO 1.54: the most important default lists update automatically every 5 hours**\n   * To take advantage of these quicker updates, **do NOT update manually unless absolutely necessary**.\n   * ‼️ **Manual updates push back automatic updates** ‼️\n      * A manually updated list will need to wait its whole long cycle before it can resume getting short cycle updates.\n\n\n&#x200B;\n\n# ―――――――――――――――\n\n&#x200B;\n\n### Do NOT\n\n- Do NOT use or advise the use of:\n   - multiple blockers\n   - old/random filters or lists not provided by uBO Team in the latest pinned thread/its pinned comment\n- Do NOT remove or advise the removal of default lists\n   - If a list causes breakage, try disabling cosmetic filtering to see if this removes the problem (it will show static ads though).\n   - Report breakages to us by including all necessary info. (Read \"How to properly report issues\" below.)\n\n&#x200B;\n\n# ―――――――――――――――\n\n&#x200B;\n\n### 🟨 I've read and followed EVERYTHING up to this point, but I'm still experiencing issues 🟨\n\n&#x200B;\n\n1. Please **make sure you've really followed EVERYTHING** that's written from the very start of the post.\n   1. **Please repeat the whole process.**\n   2. **Do NOT assume** that an extension which was previously fine **doesn't need to be checked** anymore.\n      1. This logic applies to other things as well.\n2. **If all else fails, try making a new browser profile with only uBO installed and on default settings.**\n3. Fixing anti-adblock *may* cause ads or breakages.\n   1. On Chromium-engine browsers, uBO might not reliably block ads after you just launched the browser or switched profiles, including \"Open link in incognito\" and \"Open link as User X\". This state of unable-to-block will be kept until you do a manual refresh of the page.\n   2. If you encounter such issues, please report back the EXACT URL + your country when accessing the URL so that volunteers can investigate. Comment here or [in this thread on github](https://github.com/uBlockOrigin/uAssets/issues?q=is%3Aopen+is%3Aissue+YouTube.com%3A+ALL+issues+label%3Aongoing). Read below for requirements in \"How to report issues\".\n4. Last, but not least - please convince others [to do this](https://www.reddit.com/r/uBlockOrigin/comments/15srqdw/youtube_is_dead_for_me/jwkqq8c/) since it's up to everyone to convince YouTube to change their ways.\n\n&#x200B;\n\n### 🟨 Experimental filters to help combat issues 🟨\n\nFor users who still see anti adblock occasionally, adding this custom filter might help:\n\n    ! Warning: This will break push notifications\n    www.youtube.com##+js(set, yt.config_.EXPERIMENT_FLAGS.service_worker_enabled, false)\n\nFor slowly loading YouTube, TEST these filters:\n\n    www.youtube.com##+js(nano-stb, resolve(1), *, 0.001)\n    www.youtube.com##+js(set, yt.config_.EXPERIMENT_FLAGS.web_enable_ab_rsp_cl, false)\n    www.youtube.com##+js(set, yt.config_.EXPERIMENT_FLAGS.ab_pl_man, false)\n    ||googlevideo.com/videoplayback$xhr,3p,method=get,domain=www.youtube.com\n\nUse them at your own risk. Try them separately or in combination.\n\n# \n\n# ―――――――――――――――\n\n&#x200B;\n\n# 🟩🟩🟩 HOW TO PROPERLY REPORT ISSUES 🟩🟩🟩\n\n&#x200B;\n\n**If you've followed everything written above and still encounter some issues (detection, ads, breakages), please comment with the required info:**\n\n&#x200B;\n\n1. Your **Troubleshooting Information** from YouTube. Video tutorial below.\n2. A **screenshot of** `about:addons` / `chrome://extensions` / `brave://extensions` / `edge://extensions` / `opera://extensions`. Whichever is **your browser's extensions** page.\n3. List of every single thing you've tried/step you've taken while troubleshooting.\n   1. No, please do not write: \"I did steps 1-5\" or \"I did everything\".\n      1. List every single sub-step or action you've taken.\n      2. We do not trust \"Everything\". \"Everything\" has almost always been a lie.\n   2. If you think we're requiring too much and you don't want to waste your time like that:\n      1. You're free to look for help elsewhere.\n      2. If you don't want to put any effort on helping us help you, then we simply won't :)\n      3. Keep in mind that we're all just volunteers. Our free time is a very finite resource that we'll happily spend elsewhere.\n4. If you're encountering ads, share the **EXACT URL** \\+ the **country** you're accessing from/as.\n\n&#x200B;\n\n* [**How to grab your troubleshooting information - Video tutorial**](https://old.reddit.com/link/184fivk/video/hvgibcylz5xb1/player)\n\n# \n\n### ‼️ REPORTING ISSUES WITHOUT THIS INFO WILL PROMPT A REMOVAL ‼️\n\n&#x200B;\n\n# ―――――――――――――――\n\n&#x200B;\n\n# ➡️ Temporary workarounds ⬅️\n\n**If a new solution is pending, you should still be able to watch YouTube when:**\n\n* In a Private Window / Incognito\n* Click on `Share` button -> `Embed`\n* Change the URL from `https://www.youtube.com/watch?v=`**videoID** \\-> - `https://www.youtube.com/embed/`**videoID**\n* Logged out (might not work for some)\n\n&#x200B;\n\n**Please be patient, we're all volunteers that can't be online 24/7.**\n\n&#x200B;\n\n# ―――――――――――――――\n\n&#x200B;\n\n# ‼️ Detailed TL;DR ‼️\n\n1. You see the warning message, while you're on uBO 1.57+.\n  1. Log out of your account.\n  2. Clear YouTube Cookies.\n  3. Close all YT tabs.\n  4. Check Google. If you're logged in, log out.\n  5. Clear Google Cookies.\n  6. Close all Google tabs.\n  7. Restart your browser.\n  8. Open YouTube and test.\n  9. Not working? Look for other causes.\n      1. Open your browser's Addons/Extensions page.\n      2. Disable all extensions except uBlock Origin.\n      3. Check if your browser has a built-in adblocker. Disable it.\n      4. Open uBO's Dashboard. In the Settings tab click \"backup\", then \"reset to defaults\".\n      5. In the \"Filters list\" tab. Click \"Update now\" or wait for it to update on its own. (Green clock icons mean lists just updated.)\n      6. Disable ad-blocking/filtering DNS. It might be in your VPN.\n      7. Remove any HOSTS file modifications on your system.\n      8. Disable any ad/tracking protections in your Anti-Virus or Internet/Total Security Suite.\n      9. And any other ad/privacy protections you might have on your device/network.\n      10. Still no luck? Make a new browser profile, install only uBO and don't change any settings (other than disabling built-in adblocker). Test there.\n2. Above not working? You might have to wait until we update our filters.\n   1. No point of updating uBO's filter lists before they change.\n   2. In the meanwhile, you can try a private/incognito window without logging in.\n   3. Or watching via the share button > embed > open fullscreen.\n\n&#x200B;\n\n# ―――――――――――――――\n\n### 🟩 uBO doesn't accept donations 🟩\n\nWe appreciate the sentiment many of you have expressed, but it is against uBO's [policy](https://github.com/gorhill/uBlock/wiki/Privacy-policy) to [accept donations](https://github.com/gorhill/uBlock/wiki/Why-don't-you-accept-donations%3F). What you can do instead, is to support other filter list makers by grabbing their website/donation info at the top of their filter lists (click the eye icon 👁️ next to a list to see its contents) and continuing from there.\n\n# ―――――――――――――――\n\n### 🟧 ALL IMPORTANT UPDATES WILL BE PROVIDED IN A STICKY COMMENT 🟧\n\nIf the thread gets locked, it means [there's a newer one available](https://www.reddit.com/r/uBlockOrigin/about/sticky?num=2). If the link doesn't work (mobile), please turn on desktop mode to reach it. Or simply view the subreddit when sorting by \"Hot\" to display pinned posts.",
        "num_comments": 1540,
        "comments": [
            "**Update: Method 1 is now added to Quick fixes**, will soon become effective by default. If you added Method 1 rules, no need to remove soon as they're currently identical. If you added Method 2 or 3 rules, they can interfere so you have to remove or disable the added rules once the update came. It usually takes 6 hours \\~ 1 day for the update to arrive at your computer, but it depends.\n\n**Please do not report endcards appearing too early.** This is yt's own issue and not our fault.",
            "Seems like they're now punishing adblock users by limiting the ability to play HD videos. Signed in with uBO videos buffer heavily at anything above 360p, but in incognito they play easily.",
            "AdGuard – Ads filter list seems to be the issue thats causing the YT Ad thing not work. I know because have nearly every other filter list enabled.",
            "I'm not here asking for help (yet). But I do want to point out that the claim that YouTube is no longer changing their ad detection stuff seems to be false. You might want to reconsider having that detection page shut down. YouTube is still changing how they display ads.\n\nYou wouldn't be having so many people posting if this wasn't the case. I don't think it makes sense to assume that, just because YouTube seems to have stopped for a period means that they will remain stopped.",
            "\"An error occured. Please try again later.\" I saw that there was an update today that disabled rules for SSAP ads, but I still got the error. Do I need to do anything besides downloading the latest version?",
            "It's been months since I last had issues with YouTube showing me ads, so I was surprised to see them come back again today. The status page is red so I guess I just have to wait for the update :/",
            "Getting the Playback error as others are. Works fine if I turn off uBlock. :(\n\nEDIT: Error has fixed itself. Weird as hell.",
            "The June 09 fix did not work for me. Manually updated Quick fixes and then I signed out of my google account, cleared cache + cookies + temp files, closed my browser and re-opened and I am still getting SSAP ads after signing back in and verifying my filters were up to date. Its not just random videos its practically every single video. Ads are also not skippable as the button doesnt appear.\n\nFirefox user. Accessing from Canada.",
            "Just wanted to say thanks to the uBlock team. Youtube works again on my main account :) (firefox on windows and linux both working)",
            "I remember a similar issue like this happened last year. An update by uBo should fix it. Let's be patient."
        ]
    },
    "Filter for my fellow Indians using Irctc website": {
        "title": "Filter for my fellow Indians using Irctc website",
        "score": 6,
        "url": "https://www.reddit.com/r/uBlockOrigin/comments/1dram1z/filter_for_my_fellow_indians_using_irctc_website/",
        "content": "If you are a fellow Indian like me, you must've booked a train ticket through the [Irctc website](https://www.irctc.co.in/nget) atleast once.\n\nAnd you must've encountered the pop up 'Ask Diksha 2.0' regularly on the bottom right side of the page as you can see here.\n\n[Irctc Website Homepage](https://preview.redd.it/zhr9610jci9d1.png?width=1366&format=png&auto=webp&s=9974ba3c1ad31df0e9173a6936d95a7efdd4a56d)\n\nIt is not an ad, hence why none of the uBO filter apply to it. But what it is, is an annoyance for sure and none of the mods or any list maintainers or anyone will ever be able to convince me otherwise.\n\nTo block the pop up, go to *uBO Dashboard* >> *My filters* and add this static filter :\n\n`||sdk.irctc.corover.ai^$domain=irctc.co.in`\n\nIt will make sure the script is blocked rather than hide it with cosmetic filter.\n\nThere is an even easier way for those who have enabled 'I am an advanced user'. Ask me if you want the dynamic filter instead of the static filter.\n\nPretty sure many must've figured it out before already, but this is for those who are not well versed.\n\nHave a good day and thank you Raymond and all the contributors and list maintainers for uBO,",
        "num_comments": 0,
        "comments": []
    },
    "Mac users served info-stealer malware through Google ads - Ars Technica": {
        "title": "Mac users served info-stealer malware through Google ads - Ars Technica",
        "score": 71,
        "url": "https://www.reddit.com/r/uBlockOrigin/comments/1dqsv9g/mac_users_served_infostealer_malware_through/",
        "content": "Just more proof that uBlock Origin is a necessity for security reasons [https://arstechnica.com/security/2024/06/mac-info-stealer-malware-distributed-through-google-ads/](https://arstechnica.com/security/2024/06/mac-info-stealer-malware-distributed-through-google-ads/)",
        "num_comments": 4,
        "comments": [
            "Google: We take no responsibility if any of the ads we're trying to force you to watch potentially ruin your life.\n\nAlso Google: Don't you dare block our ads criminal scum!",
            "At the very least adding Google domains to your host file will mean every site which uses reCAPTCHA will no longer work for you. Also all the workplaces and schools that use Google Workspace accounts. It seems kinda impractical.",
            "Friends don't let friends use Google.\n\nI've worked a long time to de-google my life and am getting there.\n\nDo I need to add the Google domains to my etc/hosts file? I'll have to think about going that far."
        ]
    },
    "Regards to that \"Fake Ublock\"": {
        "title": "Regards to that \"Fake Ublock\"",
        "score": 13,
        "url": "https://www.reddit.com/r/uBlockOrigin/comments/1dr15ht/regards_to_that_fake_ublock/",
        "content": "As of recent i went to download unlock origin upon opening it I saw it wasn't the same i had on my other browser I went to check and it only had 700k I saw another post including comments saying it might be malware will this affect me in anyway and how can I make sure its all gone\n\n[https://chromewebstore.google.com/detail/ublock/epcnnfbjfcgphgdmggkamkmgojdagdnn/reviews?hl=en](https://chromewebstore.google.com/detail/ublock/epcnnfbjfcgphgdmggkamkmgojdagdnn/reviews?hl=en)\n\nThe one Im speaking of \n\nIve also heard it is an older version of ublock but id like to have more people to confirm for me  Much love - Tanner",
        "num_comments": 0,
        "comments": []
    }
}