{
    "For all newly accepted or waitlisted students, please ask your questions here! [Megathread]": {
        "title": "For all newly accepted or waitlisted students, please ask your questions here! [Megathread]",
        "score": 85,
        "url": "https://www.reddit.com/r/ucla/comments/1bgbydk/for_all_newly_accepted_or_waitlisted_students/",
        "content": "Congrats new Bruins! Please use this thread to ask anything pertaining to your UCLA admission decision and related follow up actions (waitlist, enrollment, SIR decisions, majors, campus life, rescindment, housing, etc.)\n\nThreads about these topics that show up on the main feed may be redirected here.",
        "num_comments": 1310,
        "comments": [
            "To the new Bruins, use \"BruinWalk\" when selecting classes! Basically Rate My Professor, but only for UCLA",
            "Incoming freshman here, is the roommate request deadline also May 15?",
            "Hello! Incoming admitted freshman here and I have been searching and trying to learn more about the different dorms offered at ucla. I really want a double dorm, but I heard freshman only get triples? Can freshman get doubles?",
            "Hello! I recently got admitted into the UCLA DMA program and was wondering what are people's thoughts on the program.\n\nThe DMA website describes the program ad not focusing on professional development, but rather experimentation across a range of different media. I have mainly done traditional art and digital illustration, and do not see myself making the kind of work shown in DMA exhibitions. As someone who wants to solely focus on either animation or illustration and possibly graphic design, does this program seem like a good fit for me?  I am personally gravitating more towards career-orientated programs like SJSU Illustration/Animation, but at the same time would much rather go to UCLA for the campus and location (I've lived in the bay for my whole life).",
            "Hi, I just recently got accepted to UCLA and Princeton. I just want to know your guys' opinions on which school is more suitable for a person like me who is seeking to be an aerospace major. I know UCLA has closer access to some NASA facilities and aerospace internship opportunities. But how about Princeton? Would you have a better chance interning at NASA if you were to go to Princeton or UCLA? Overall, which school would you guys recommend is more fitting?",
            "How is UCLA for premed? Is it as competitive as cutthroat as people make it seem? Heavily considering going since its been my dream school but I also got into Rice which has a higher percent of students get into med school their first try ",
            "I just got accepted and I was wondering what forms I should try and get and does UCLA revoke admission pretty easily.",
            "Thanks for the thread!\n\nWhere do people usually find roommates? I'm a bit stressed with this due to personal circumstances.",
            "Is there any particular reason why the amount of students accepted off the waitlist in 2022 was just 367/11,169 but in 2023 it was 1400/11725? \n\nIs there a chance this years may look like last years?",
            "Hello! I am currently waitlisted for Engineering, but UCLA is absolutely, hands down my #1 choice. I was torn between majoring in Econ and Engineering - would it be possible at this point to switch to Econ and would that potentially increase my chances of getting off the wait list?  Thank you so much!"
        ]
    },
    "Free & For Sale, Campus Events, Club & Job Recruitment, Housing Rentals, and All Other Miscellaneous Things [Megathread]": {
        "title": "Free & For Sale, Campus Events, Club & Job Recruitment, Housing Rentals, and All Other Miscellaneous Things [Megathread]",
        "score": 23,
        "url": "https://www.reddit.com/r/ucla/comments/1bi0a6g/free_for_sale_campus_events_club_job_recruitment/",
        "content": "The weekly pinned thread doesn't get a lot of action. So we're creating this thread as an ongoing space for all advertising and self-promotion posts, which are typically not allowed on the main feed.\n\nPlease exercise caution with your personal info and stay alert for potential scammers.",
        "num_comments": 161,
        "comments": [
            "Hello! I'm graduating this year and I'm looking to sell my 2011 Ford Escape that I bought about 2 years ago. It's in great condition when I got it from the previous owner, and I have taken good care of the car too. It has brought my friends and I onto multiple road trips comfortably and reliably (camping in yosemite and ski trips at mammoth mountain just to name a few).\n\nDm if you're interested! I'm looking to hand it off this summer and price is $6000 obo. Thanks!",
            "Hi beautiful bruins! Would anybody be interested in an interdisciplinary Bruin network, especially those who are pursuing double majors, combined majors, and minors? We can come together to network, apply our knowledge, and give insights for people who are undecided, for example as an yearly conference on campus",
            "Looking to buy a Bruin u-pass code/card for the summer",
            "Hi! Looking for roommates. Im 20M, and Im not too picky, so hmu if interested.",
            "Graduation Sale: Used steelcase leap v2 chair for $200.\n\nAll functionalities are perfect. Some signs of usages. Pickup or delivery in June near 90024 (I live on Wilshire Ave, feel free to come and check)",
            "Hello,\n\nI'm looking for an apartment close to campus to sublet for the summer. I'll be there from mid June to mid September most likely. I prefer something close to 800 per month, but I can be flexible depending on how it is. DM me if you have a room available or know someone who does. Thank you!",
            "Entire bedroom available in 2BR apartment for next school year!\n\nLooking for a roommate for next academic year, starting Sept 1! 2BR near campus, grad student or later undergrad preferred. $1350/mo for your own bedroom with a balcony and a parking spot (within walking distance of campus!), no pets but must be good with dogs (because one already lives here ). Hoping for someone relatively quiet / chill, and everythings already furnished except your bedroom. DM me if interested",
            "Hi everyone, Im a graduating male student looking to sublet from June 15 through mid September in Westwood.PM me if you have either preferably a single or a spot in a double! Thanks guys",
            "Hi I am selling a cap and gown and white tassel for $35",
            "Looking to sublease my apt on 403 Landfair Ave. (closest apt you can find to ucla) starting anytime from now until as late as mid september. The apt will be shared with 3 other male subleasers and furniture is included. This deal is for the bigger room in the apt with an attached bathroom in the room. With rent and utilities, it will be 1k flat a month. Please reach out to me if interested or if you know anyone!"
        ]
    },
    "UCLA Google Photos and Drive Access Gone": {
        "title": "UCLA Google Photos and Drive Access Gone",
        "score": 56,
        "url": "https://www.reddit.com/r/ucla/comments/1dr1m8q/ucla_google_photos_and_drive_access_gone/",
        "content": "Hello, UCLA students and faculty,\n\nI received a notification via email yesterday (6.27.24) that UCLA students and alumni would no longer have access to drive or photos. I was in a state of panic and quickly went to Google Photos... I had lost all access—childhood photos, wedding photos, from my entire life, gone. Same with drive. I searched through my email and had missed a notification that we were losing access.\n\nIn addition, I've lost research I conducted in grad school and current assignments for another degree I am working on.\n\nI am incredibly sad. Can anyone help me retrieve anything? I already submitted an IT ticket.\n\nCalling on those who implemented this to do a better job socializing major IT projects. I was told while at UCLA that our unlimited Google storage would live on forever by IT. I would have been happy to move everything if I had known. I am devastated.\n\nMichael J. Beck\n\nAdministrative Vice Chancellor\n\nRoger M. Wakimoto\n\nVice Chancellor for Research & Creative Activities\n\nLucy Avetisyan\n\nAssociate Vice Chancellor and Chief Information Officer",
        "num_comments": 16,
        "comments": [
            "It's absolutely absurd this was never emailed clearly to all alumni emails. I only found out about this in time to back up my things due to this subreddit.",
            "Received the notification as well but never bothered to store anything there so I was relieved. However, what annoys me is that with how much students pay in tuition, with how much alumni paid for membership, and how often alumni get hounded for donations and etc., that they would just shank everyone like this. It's fucking infuriating.",
            "omg i just found out about this. please please someone help, my entire life is on this drive. i didnt receive any emails regarding this,\n\nwhat can i do?",
            "Does anyone know if google calendar is still accessible/usable or is it only email?",
            "theyve sent a few emails about it (maybe like, 3) but honestly it would be sooo easy to miss it if youre not thoroughly reading each email. i wish they would have put some kind of pop up warning when you opened google drive or photos. im sorry :(",
            "Thank you so much! Submitted a ticket.",
            "tbh I knew this would happen when they roll it out, just too good to be true lol. So I never used the drive",
            "I got them but for some reason no one else I knew did?? Really awful roll out, totally screwed over the IT helpdesk",
            "I never trusted it bc I didn't pay for it lol",
            "I just tested and Google Calendar is still usable. I think it's only Drive and Docs that's affected."
        ]
    },
    "Northern lights panini 😭": {
        "title": "Northern lights panini 😭",
        "score": 13,
        "url": "https://i.redd.it/3ckp2sin3g9d1.jpeg",
        "content": "Cleaning out my camera roll and found this gem 🥹 lmao lowkey miss this panini bread compared to the one they switched to😭\n",
        "num_comments": 1,
        "comments": [
            "At this time of day?  At this time of year?  At this part of the country - localized entirely in your kitchen?!"
        ]
    },
    "Does the 216 credit limit apply to aproved double major candidates???": {
        "title": "Does the 216 credit limit apply to aproved double major candidates???",
        "score": 5,
        "url": "https://www.reddit.com/r/ucla/comments/1dr67ix/does_the_216_credit_limit_apply_to_aproved_double/",
        "content": "Ive seen a few biochem majors who where able graduate with BS is Biochem and in Neuroscience like through tik tok, are you still restricted to the 216 credit limit or do you just have to get everything done by summer of your senior years. I am genuinly confused because I don’t want to do 2 neuro courses just to be told I dont have enough credits. (Also I personally think the credit limit is stupid) ",
        "num_comments": 2,
        "comments": [
            "Youre fine and can go over the limit. i went over the limit as a single major in the college of letters and sciences and was told that we dont even have to petition for it anymore. I recommend still reaching out to your advisor but you should be fine",
            "Just submit a petition and forget about it once it's approved. Makes enrollment less stressful and you don't have the lingering question looming over you!"
        ]
    }
}