{
    "Reminder to use /r/UCSB4Sale for ads including subleasing": {
        "title": "Reminder to use /r/UCSB4Sale for ads including subleasing",
        "score": 16,
        "url": "https://www.reddit.com/r/UCSantaBarbara/comments/1covvat/reminder_to_use_rucsb4sale_for_ads_including/",
        "content": "Hi everyone! To keep /r/UCSantaBarbara from getting flooded by ads, we have a sister subreddit for that sort of thing: /r/UCSB4Sale\n\nPlease use /r/UCSB4Sale for posting:\n\n* Housing ads, including looking for subleasers and roommates\n* Items you have for sale\n* Requests for buying text books\n* Jobs, internships, etc. that you're trying to hire for\n\nMods will generally remove those sorts of posts if they show up here.\n\nThank you!",
        "num_comments": 0,
        "comments": []
    },
    "FOUND CAT": {
        "title": "FOUND CAT",
        "score": 29,
        "url": "https://www.reddit.com/gallery/1dr3sjd",
        "content": "breakpointe and coronado! super friendly, no collar, she was found in the parking lot, she is SUPER socialized so i am pretty sure she has an owner but pls reach out if u have any info!",
        "num_comments": 8,
        "comments": [
            "She says lemme just go ahead and lay right here",
            "She’s so cute and sweet looking! I’d also recommend posting on the app Nextdoor or in local Facebook groups, in case the owners aren’t UCSB students but other members of the community.",
            "If you have FB, there's a UCSB cats group and lowkey I feel like she kinda looks like one of them so would be worth a try!",
            "Give it to me, I'm the owner (no I'm not I just want to play with the cat)",
            "I'm the owner 🙋‍♂️. You can give it to me.\n(I'm not but the cats cute af)",
            "Look at her all curled up... I think she's already decided she lives there now /j",
            "she’s literally the sweetest :,)",
            "i requested to join the group, thank you so much!!! can u dm me a picture of the listing?"
        ]
    },
    "Cal Resident Tuition ": {
        "title": "Cal Resident Tuition ",
        "score": 2,
        "url": "https://www.reddit.com/r/UCSantaBarbara/comments/1drd2n2/cal_resident_tuition/",
        "content": "Both my parents are California residents and have been paying taxes to the state for 20-something years. Will I be subject to California Tuition, as I’m a dependent on them and don’t have any income?\n\nWorst case scenario, I pay out of state for first year. Will I be eligible for California Tuition the following 3 years?",
        "num_comments": 5,
        "comments": [
            "Do you live in California, graduate from a CA HS or attend a CA college? Are you under 24 years of age?",
            "I have a California address, haven’t graduated from a CA HS. But I’m also under 24",
            "Then you would be a CA resident for tuition purposes if you lived in CA for at least a year. Why did you think you would pay OOS fees?",
            "It said on my acceptance, that CA residency is undetermined and assumed residency is OOS",
            "Did you fill out the SLR Statement of Legal Residency?\n\nhttps://www.ucop.edu/residency/process.html"
        ]
    },
    "How Early Should You Go To Kin Bakeshop to Avoid a Line?": {
        "title": "How Early Should You Go To Kin Bakeshop to Avoid a Line?",
        "score": 1,
        "url": "https://www.reddit.com/r/UCSantaBarbara/comments/1drc2zk/how_early_should_you_go_to_kin_bakeshop_to_avoid/",
        "content": "Title. This is a pretty niche question, but I know soooo many UCSB students who go, so I feel like they would know best. For anyone with experience with going to Kin, how early should you go so you don’t get stuck in a line forever? ie how early to be like the first person there?",
        "num_comments": 4,
        "comments": [
            "The best time I’ve found is roughly 10am or 10:30 am or so - when they’re at a point that the line is only 20 mins but they still have mostly everything. They also have their Instagram where they post live updates about wait times",
            "i see, thank you so much!",
            "I haven't gone in a while, so take this with a grain of salt, but when I last went (a couple months ago), people were already in line 45min before open.  The only time I haven't seen a line there is in the afternoon when donuts are sold out, if you're only interested in getting a drink!\n\nThey are just so popular, it's not super feasible to not have a line when you get there.\n\nEdit: typo",
            "Okay, thank you!"
        ]
    }
}