{
    "housing & roommate search/questions megathread!!": {
        "title": "housing & roommate search/questions megathread!!",
        "score": 42,
        "url": "https://www.reddit.com/r/UCSD/comments/1b8ipp0/housing_roommate_searchquestions_megathread/",
        "content": "hi y'all!!\n\n&#x200B;\n\nhere is a megathread for all y'all's questions about housing for summer and the upcoming academic year and for finding roommates!!\n\nwe will remove posts about housing and roommates and such from outside the megathread to keep everything in here!!\n\n[facebook student off-campus housing group](https://m.facebook.com/groups/2387457222/?ref=share&mibextid=S66gvF)\n\n&#x200B;\n\na good checklist for comments:\n\n1. age & gender\n2. on or off campus and what college/SD area \n3. summer, academic year, calender year lease\n4. have a group/looking for a group \n5. UCSD students or coming to live in SD\n6. what you're looking for in a roommate\n7. what you're looking for in housing \n8. any particulars about you or housing \n\n&#x200B;\n\nfeel free to delete your comment when you find a good group!!\n\n&#x200B;\n\n&#x200B;\n\ngood luck with finding housing, and thanks for using this!!",
        "num_comments": 371,
        "comments": [
            "Hi I am planning on getting a single at Sixth College (female), so the numbers are not really working out for my current group, so I am thinking about still getting a single, but in the apartment next to them.  Their earliest enrollment time is 9:30 am, so if any group has an enrollment time around there would be ideal! I am clean, caring, drama-free and would also love meeting new people, although at night I do really value my quiet time because I have a hard time sleeping. That is something very important to me. I’m still not completely sure yet about leaving my current group, but let me know if anyone is open to suiting with me and picking the apartment next to my current group. That is a lot to ask, so I understand if people aren’t able to. Nevertheless, if I do join your group, I would be really happy too and looking forward to meeting you guys and talking it out in person :)",
            "Hi, currently a second year who received a contract to live on campus next year. Just wondering, where do third years typically get placed, or how likely is it to get a room in Rita apartments? Would you recommend staying on or just living off-campus in terms of living and everything? Any insight is greatly appreciated",
            "Hey!! I’m an incoming transfer (21F) looking for on-campus female dorm mates for the fall quarter. \n\nI’m majoring in Neurobiology. Got into Muir. \n\nI’m pretty clean (except during exams..)\nI don’t smoke, but I drink socially.\nI’ll probably be either in class, library, or a cafe most of the time!\nI can cook and bake!\n\nPreference: Ive got pretty bad insomnia and am an irritatingly light sleeper so I can’t do night owls!\n\nHobbies: crochet, mycology, coffee, hiking, movies/anime, mixology, scifi, some games!\n\nDm me for questions or if you’re interested!",
            "Hello ucsd friends!\n\nMy roomate fell through last minute and I'm looking for a female that is interested in joining a double with me on campus in Sixth college. I have an apartment group but I'm flexible to joining yours or a new group. I'm clean, friendly, and love meeting new people.",
            "Hello, I'm a current male second year looking for some off-campus suite mates. I'm looking for someone that's down for a single ($1333) or two people that are willing to share a room ($1600 split amongst two). I would prefer someone that cares for cleanliness, isn't too loud, has no pets, and doesn't smoke. The property is quite stunning and only 2 miles from campus. The lease should run from 5/15/24 to 6/15/25 although that may change. PM if interested.",
            "Hi, recently got a housing contract offer and have to pay $450. (Current 2nd year, 3rd year for housing contract) I would like to be on campus but if I end up paying and then choosing not to live on campus because I dont want to be in a res hall or a triple, will I get refunded? Also did anyone do this last year and were you able to get a double in a nice living space like 6th or muir?",
            "[deleted]",
            "Is it hard to get in a multiculturalsm LLC?",
            "im just wondering when tf do summer housing applications open",
            "Sublease Available in UCSD Grad housing  \n2 rooms in a 4Bed 2Bath unit — fully furnished - June 15th through September 30th (flexible), $1005/mo per room (all inclusive)  \n•⁠  ⁠4 Bed, 2 Bathrooms   \n•⁠  ⁠Electricity, Water and other utilities included in rent  \n•⁠  ⁠Furnished Hall & Kitchen with sofa and TV  \n•⁠  ⁠Full size bed, mattress, table, chair, wooden wardrobe available in the room  \n•⁠  ⁠Fully equipped kitchen including oven, microwave, fridge   \n•⁠  ⁠Washer and Dryer (Laundry) available right next to room  \n•⁠  ⁠24/7 hot water, oven, refrigerator  \n•⁠  ⁠free WiFi   \n•⁠  ⁠The community has a gym, swimming pool, game room, BBQ grills, and study rooms.  \nImportant Landmarks:  \n•⁠  ⁠20 min walk / 4 min drive from SN office  \n•⁠  ⁠Target, Ralphs, Vons in 5 min  \n•⁠  ⁠5 mins walk to the nearest trolley station   \nDM for details"
        ]
    },
    "ITS ServiceDesk /Resnet Hiring for 2024 Start Dates!": {
        "title": "ITS ServiceDesk /Resnet Hiring for 2024 Start Dates!",
        "score": 18,
        "url": "https://www.reddit.com/r/UCSD/comments/1bo1a9p/its_servicedesk_resnet_hiring_for_2024_start_dates/",
        "content": "ITS Service Desk/ResNet Hiring for Fall 2024 Start Dates!\n\n**ITS Service Desk (also known as ResNet)** is hiring for positions starting in Fall Quarter! Here is a link to our online application: [https://resnet.ucsd.edu/jobs](https://resnet.ucsd.edu/jobs) \n\nAll the details are spelled out on the \"Apply Here\" page, but here's some info at a glance:  \n  \n· **$18.05/hour for the base role, with raises for each year you work for us.** You can even apply to be a student lead after you've been working for a bit for $20 an hour plus annual raises!\n  \n· **All UCSD Students welcome. (including incoming freshman and grad students!)**  \n  \n· Good critical thinking and problem solving and Google skills will get you most of the way there, and we'll teach you the rest during the paid training. \n\n· **You do not need to be a CS or STEM major.** Many of our best techs have been humanities or social sciences majors!  \n  \n· **You do need excellent English and communication skills**, in-person, on the phone, and via email.  \n  \n· **Scheduling is flexible.** You're a student first! We plan your schedule around prior conflicts/commitments. \n  \n**So what do we do?** We help students and staff with a wide range of technology-related issues including email, accounts, Canvas, lab machines, classrooms, Zoom, and wireless internet. If you're interested in a bit of a peak behind the curtain at UCSD IT infrastructure, this role may interest you. This role is primarily customer service.\n  \n**Is this job right for me?** As long as you like helping people, are inquisitive, and are willing to learn, we think you'll find this job quite fulfilling!  \n  \n**How many hours per week?** Between 15-20 hours per week.  \n  \n**Is this job in person?** Provided things stay constant, yes! \n  \n**Sounds great! When do I start?** We're targeting a start date of 9/10/2024 for Fall. We will close the applications when we have filled all our spots, so the earlier you apply the better!\n  \nIf you have any questions that aren't answered on the application (hit the \"Apply Here\" button for more info), please email [helpdeskjobs@ucsd.edu](mailto:helpdeskjobs@ucsd.edu).  \n  \nAdditionally, after a period of inactivity on the job application SSO will automatically sign you out, so we recommend typing longer responses into a separate document before copy-pasting them into the application!",
        "num_comments": 2,
        "comments": [
            "Work here!! It’s a fantastic place to be.",
            "FYI - Peek 👁not peak ⛰"
        ]
    },
    "trash panda ‼️": {
        "title": "trash panda ‼️",
        "score": 65,
        "url": "https://www.reddit.com/gallery/1dr01dj",
        "content": "bros just chilling",
        "num_comments": 10,
        "comments": [
            "Did you pet it?",
            "What a cutie",
            "it just wants to sleep 😔",
            "Is our king stuck",
            "Nice and thiccc! Beach body is ready!",
            "Fucking feel that vibe bro",
            "That's literally me",
            "no 😔",
            "Becarefull of Rabies",
            "Its worth it guys.\n\n\n\nRight?"
        ]
    },
    "The pandas are back!!!": {
        "title": "The pandas are back!!!",
        "score": 166,
        "url": "https://www.reddit.com/r/UCSD/comments/1dqqlso/the_pandas_are_back/",
        "content": "After many years with no pandas in the SD Zoo panda exhibit, they're back! They arrived yesterday and will be getting acclimated in a private exhibit for a few weeks before they're opened to the public. So, hopefully we can expect to see some pandas in August!\n\nhttps://timesofsandiego.com/life/2024/06/28/san-diego-zoos-pandas-acclimating-to-new-home-after-arriving-safely-from-china/",
        "num_comments": 11,
        "comments": [
            "Time to go see pandas in the fall 👀👀👀",
            "It will be pure Pandamonium! :)",
            "Lessgooo",
            "Panda watch is back baby!",
            "I bought an annual pass just for the pandas 🐼❤️",
            "Sorry but I refuse to have fun in a zoo while Gazans are being genocided and have no zoo of their own",
            "Shutup",
            "bait used to be believable",
            "I never even say this to people because I think it’s annoying af but truly, nobody asked",
            "😭😭😭😭"
        ]
    },
    "Sixth GenEd so much easier": {
        "title": "Sixth GenEd so much easier",
        "score": 12,
        "url": "https://www.reddit.com/r/UCSD/comments/1dqx52g/sixth_gened_so_much_easier/",
        "content": "Why is sixth genEd so much easier than warren’s 😭😭 I’m an incoming CS major but my AP credits would’ve satisfied basically all the requirements for sixth whereas for warren, i have to complete Area Studies which i don’t even understand still",
        "num_comments": 15,
        "comments": [
            "Wait until bro finds out about erc and Revelle",
            "Just be happy you didn’t get put into ERC",
            "Welcome to UCSD",
            "You haven’t even seen the housing difference yet 😭",
            "#sixthontop",
            "> which i don’t even understand still\n\nHave you read through the [warren ge page](https://warren.ucsd.edu/academics/general-education/area-studies.html) that describes area studies? If you have a specific question about something on there, it might be easier to get help or clarification than just saying that you don't understand it.",
            "Actual pain and suffering ",
            "👆",
            "Yeah speaking of housing as well, i really should’ve just ranked sixth as number one",
            "Well i do understand it, i was just over exaggerating how warren’s area study is too versatile, making it hard for me to fully plan out which courses to take whereas other colleges’ ges are straight forward"
        ]
    }
}