{
    "Armfield AMA Delay": {
        "title": "Armfield AMA Delay",
        "score": 12,
        "url": "https://www.reddit.com/r/ufc/comments/1dlr20s/armfield_ama_delay/",
        "content": "Apologies everyone, the AMA has been delayed due to a sudden issue that came up for Garrett. It is being rescheduled and we will post an update in the next few days on when that will be.",
        "num_comments": 15,
        "comments": [
            "couldnt make weight for the ama",
            "Probably saw all the terrible questions in the thread and said nah fuck that 🤣",
            "Alright! Looking forward to it!",
            "Well I'm sure less people care now. Who tf is that guy anyway,?",
            "He’s the official fighter of r/ufc have some hespect",
            "Had a banger of a fight last weekend. Fellow Reddit nerd like the rest of us degenerates",
            "I didn't know this. My bad.",
            "K",
            "[deleted]",
            "Nah he was just so touched by the outpouring of support that he had to take some time to reflect"
        ]
    },
    "I did a fan artwork poster for UFC 303 Pereira vs Prochazka": {
        "title": "I did a fan artwork poster for UFC 303 Pereira vs Prochazka",
        "score": 160,
        "url": "https://i.redd.it/r3mebxoa379d1.jpeg",
        "content": "",
        "num_comments": 14,
        "comments": [
            "I had hoped to have more time to polish it up more, but had some health issues and had to rush this project. Still, hope y'all like the colors and style!",
            "Bro this is sick! Well done, Respect. I dont mind if ufc goes for these types of posters",
            "I wish the UFC made a special contest for international fight where fans can submit their own artwork of the fighters and the winner has their poster as the official one",
            "r/ufc endorses the use of impact for UFC posters",
            "Thanks for the kind words brother! I wanted to have more time to polish it up and make it more professional and presentable.",
            "Would be an awesome opportunity!",
            "![img](avatar_exp|181499815|bravo)",
            "🔥",
            "🤩👌",
            "I like this."
        ]
    },
    "Nasty KO hope he's alive 😬": {
        "title": "Nasty KO hope he's alive 😬",
        "score": 1745,
        "url": "https://v.redd.it/vtiixaiggf9d1",
        "content": "",
        "num_comments": 196,
        "comments": [
            "UFC missed out bad cutting Rafael Alves last year",
            "Man karate combat gotta have a terrible marketing team because I actively want to watch them yet I have no idea when they are live",
            "“Alves kissed his head” is crazy 😭",
            "When I saw who was fighting, I unfortunately immediately knew wbo was going to get brutally KO'd",
            "That was NASTY! That's the first switch kick KO I've ever seen.",
            "Bro wtf? I actually thought the short dude was about to get knocked out but then names came up and I was like \" that's James Vick? Oh shit, he's the one getting ko'ed\" and lo and behold it happend",
            "Nothing like a James Vick KO. Dude has gotta stop fighting",
            "That's what? 5 of his last 6 being ko losses?",
            "When GSP was talking about retiring before the sport retires you, he was talking about those types of situations. Hope he recovers .",
            "That dude has permanent damage bro"
        ]
    },
    "The magicfucker tried to jinx Jiri with his eyes now!!! Luckily the holy Samurai just doesnt care ": {
        "title": "The magicfucker tried to jinx Jiri with his eyes now!!! Luckily the holy Samurai just doesnt care ",
        "score": 2284,
        "url": "https://v.redd.it/mpid3me7we9d1",
        "content": "",
        "num_comments": 440,
        "comments": [
            "I am fucking loving this.",
            "Jiri was into the spiritual shit until someone did it to him back 🗿 I need a trilogy man\n\n![gif](giphy|HHeS6NfqYNL5TKcm1d|downsized)",
            "Jiri by pure performance or Alex by chamanic magic ?",
            "Damn, Jiri and Alex are both so likable.\n\nI really don’t have a favorite here.",
            "This guy is bat shit crazy LMAO",
            "This fight has such a unique buildup than most fights that relies on trash talk, racial slurs, or altercation just to be exciting. I don’t mind a trilogy at all if this is the build up we get every time these two fight each other. These two are just so detached from reality that their fight becomes very fictional almost lol",
            "Reminds of Borat’s interaction with Jews and gypsies",
            "“I don’t care I don’t care I don’t care” - a man who can’t help but care",
            "What is he wearing around his neck",
            "Jiri is not being serious right? Like dude seems shook lol. It's gotta be a bit."
        ]
    },
    "Diego Lopes actually posted this🤣": {
        "title": "Diego Lopes actually posted this🤣",
        "score": 1002,
        "url": "https://i.redd.it/afoa6bssdf9d1.jpeg",
        "content": "",
        "num_comments": 58,
        "comments": [
            "Putting $25 on him now.",
            "That’s him..\n\nThat’s our emo king.",
            "I hope his curtains match his drapes\n\n![gif](giphy|hJJrnnA8Hl21BVzHHP)",
            "That was shitty of Ortegas team to call at 4 am on weigh in day, saying he has to be at 155 or the fights off. Lopez being at 147. Ortega likely already knew he wasn't making weight and stringed him along",
            "Do we have any normal fighters on this card at all? There's Jiri, Poatan, MVP, and now Lopes... who's next?\n\nMind you, I'm not complaining at all here: 303 is shaping up to the most anime event ever, and I'm fucking loving it!",
            "The balls on him to post this shit.",
            "Lopes gang today we will Dream Believe And Make It Happen",
            "It's fuck Ortega win or lose",
            "I used to like Ortega but he's a bitch for intentionally missing weight and forcing Diego to fight him at 155. LFG Lopes!",
            "Regardless of 155 or 145 lopes smokes ortega. There levels when it comes to momentum and activity"
        ]
    }
}