{
    "Official Verdict League": {
        "title": "Official Verdict League",
        "score": 91,
        "url": "https://www.reddit.com/r/ufc/comments/19c6ker/official_verdict_league/",
        "content": "Hey guys, just in case you missed the pinned comment on the discussion thread, we now have an official verdict league to replace the old Reddit predictions feature. Use the link to join or I will oil you up personally.\n\nhttps://verdictmma.com/seasons-leagues/league/rufc-predictions-league-3524?token=b3edf2d63b7ae137794c3564323238d4&isShareable=1",
        "num_comments": 40,
        "comments": [
            "oil me up then",
            "Yo why isn’t there a pinned discussion for this card?",
            "![gif](giphy|VYk5o8rvpTI9j2cjnG|downsized)",
            "why? reddit poll was cool and fun. aint signing up to some bs site for this... thanks for ruining the fun you farts",
            "Official verdict - Jon Jones is a homo",
            "I installed the app and after I login, it's just stuck on a blank screen. Anybody else? I'm using a Galaxy Fold 5",
            "Why is Vicente luque fighting Joaquin Buckley",
            "Looks like there’s only a few bangers on here. But maybe I’ll be pleasantly surprised ",
            "Just joined, made my picks for the card.",
            "What book am I supposed to buy?"
        ]
    },
    "Armfield AMA Delay": {
        "title": "Armfield AMA Delay",
        "score": 2,
        "url": "https://www.reddit.com/r/ufc/comments/1dlr20s/armfield_ama_delay/",
        "content": "Apologies everyone, the AMA has been delayed due to a sudden issue that came up for Garrett. It is being rescheduled and we will post an update in the next few days on when that will be.",
        "num_comments": 7,
        "comments": [
            "[deleted]",
            "K",
            "Well I'm sure less people care now. Who tf is that guy anyway,?",
            "Had a banger of a fight last weekend. Fellow Reddit nerd like the rest of us degenerates",
            "He’s the official fighter of r/ufc have some hespect"
        ]
    },
    "How an interview changed the sport": {
        "title": "How an interview changed the sport",
        "score": 1258,
        "url": "https://v.redd.it/7t8mofhst28d1",
        "content": "",
        "num_comments": 119,
        "comments": [
            "Learns English only to troll Izzy.",
            "All-time great sports rivalry. A couple of legends.",
            "Surprised this rivalry in the ufc ended so fast. Izzy lost then sent Alex’s head to the moon and they went completely different paths. The way he left Alex in Miami 😭",
            "If u posted this on TikTok there would be about 200 comments going smthn like ‘now izzy da guy in bar beat that guy one time😀😀’",
            "What’s the song at the end?",
            "That \"Come to Daddy\" line was cool AF",
            "Thanks for reposting it again I almost didn't see it this week.",
            "Didn’t change the sport bro, it set up a few good fights but it changed AP’s life for sure tho",
            "Izzy pulled a Ray Stanz with those comments",
            "This guy really is something else, from SEVERE alcoholism to Poatan. Love this guy"
        ]
    },
    "No way UFC just posted this": {
        "title": "No way UFC just posted this",
        "score": 868,
        "url": "https://i.redd.it/oirrfg9rr18d1.jpeg",
        "content": "",
        "num_comments": 91,
        "comments": [
            "Dont do my boy Dustin like that 😭",
            "Is danawhitescousin an official UFC account?",
            "As someone who it took 13 years to have my son, this hit me super hard.",
            "“You’re taking everything I worked for “ Israel Diaz",
            "Actually spit my drink for this shit haha",
            "The wording of “teenagers in the lunch break” is confusing. Poor delivery. 7/10",
            "He's not making them money anymore, why wouldn't they take pot shots at him?",
            "Premise is funny, delivery is terrible.",
            "I don't get it",
            "Alex is a generational talent. Not a knock on dustin but Alex is legit a special fighter"
        ]
    },
    "What happened?": {
        "title": "What happened?",
        "score": 1657,
        "url": "https://i.redd.it/bpu763pwl08d1.jpeg",
        "content": "",
        "num_comments": 378,
        "comments": [
            "Jon getting a favourable judges decision again.",
            "Well how’d that happen when he 10-8 his wife",
            "Still remember the police report and security audio of his kids asking security to call the police on him because he was beating up his fiance. Pretty sure his kids were far from happy about him that day.",
            "I thought he had all daughters?",
            "Am I the only one shocked that he has a son?",
            "https://preview.redd.it/n17l8pbbj18d1.jpeg?width=1200&format=pjpg&auto=webp&s=2e0e0721304e851df6363a31a4eb56a007c144e4\n\nI know who's gonna be excited to hear about this",
            "Huh, they had a split and got back together during Jones fight against Gane, looks like they split again\n\n\nBut also, 50/50 custody with this man's history 💀",
            "His wife fucked up.  Never leave it in the hands of the judges 👨🏻‍⚖️",
            "Son fearing for his life",
            "I thought he had 3 daughters. Since when does he have a son?"
        ]
    }
}