{
    "Upcoming AMA with Yuan Fung and Matt Ford from the UAP Disclosure Fund, on Saturday, June 22 at 1:00PM PST": {
        "title": "Upcoming AMA with Yuan Fung and Matt Ford from the UAP Disclosure Fund, on Saturday, June 22 at 1:00PM PST",
        "score": 87,
        "url": "https://www.reddit.com/r/UFOs/comments/1diw6nd/upcoming_ama_with_yuan_fung_and_matt_ford_from/",
        "content": "Hello Everyone!\n\nr/UFOs will be hosting an AMA with Yuan Fung and Matt Ford from the UAP Disclosure Fund, on **Saturday June 22 at 1:00pm PST** ([Click here for your local timezone](https://www.timeanddate.com/worldclock/fixedtime.html?msg=r%2FUFOs+-+AMA+with+the+UAP+Disclosure+Fund&iso=20240622T13&p1=137))\n\n[The UAP Disclosure Fund](https://www.uapdisclosurefund.org/) is a nonpartisan political nonprofit 501(c)(4) that advocates for greater government transparency regarding unidentified anomalous phenomena (UAP). They work to support new UAP legislation, provide legal representation for whistleblowers, promote scientific research and raise public awareness in an effort to better address the UAP issue.\n\nTheir team includes:\n\n- Luis Elizondo (Board of Directors)\n- Garry Nolan (Board of Directors)\n- Karl E. Nell (Board of Directors)\n- Christopher K. Mellon (Advisory Board)\n- Kirk McConnell (Advisory Board)\n- Yuan Fung (Executive Director)\n- Matthew Ford (Director of Strategy)\n- Lesley Duckworth (Chief Financial Officer)\n\nThe UAP Disclosure Fund is [currently petitioning](https://www.uapdisclosurefund.org/#petition) for UAP legislation to be included in the 2025 NDAA.  Now is the time to let the U.S. Senators who cosponsored the UAP Disclosure Act of 2024 know that you support including a new version of the UAP amendment in the 2025 National Defense Authorization Act (NDAA)!  You can sign the petition [here](https://www.uapdisclosurefund.org/#petition) to let lawmakers know that UAP transparency and legislation is important to you.\n\nYuan Fung has worked for over 20 years as a creative director and consultant for campaign politics and issue advocacy. He has worked on behalf of congressional, gubernatorial, senate and presidential campaigns.  Highlights include the late Senator Harry Reid, and both of Obama's presidential campaigns.  He has also done work for causes like consumer safety, the environment and clean energy.  Leveraging his political expertise and talent, he is now the executive director for the UAP Disclosure Fund.\n\nMatt Ford is an Emmy-winning political consultant, media personality, and producer based in Los Angeles. He is a trusted advisor to leading congressional representatives and their staffers on the UAP issue.  Matt has spearheaded numerous successful projects as a producer, including creating over 100 political ads for social media platforms which have been viewed by millions.  His production prowess extends to hosting The Good Trouble Show, where he engages in thought-provoking discussions with influential figures such as Senator Kirsten Gillibrand and other prominent political figures.  He is now the Director of Strategy for the UAP Disclosure Fund.\n\n---\n\nWe're thrilled to have Yuan and Matt participate in this AMA with the community, and we know that everyone is sure to have lots of questions! If you're unable to attend, but would still like to ask questions, feel free to share them below and we'll do our best to facilitate them on your behalf.\n\nIf you have any feedback or thoughts on other guests you'd like to see, message us directly here or let us know in the comments below.",
        "num_comments": 38,
        "comments": [
            "Just a friendly reminder to everyone that during the AMA, the mod team will be actively removing any questions that are inflammatory, overly accusatory or otherwise uncivil (no different than any other AMA that we have conducted in the past). With that being said, we absolutely want to be permissive in letting the community ask whatever questions they might have - even if they are hard questions. We just want to ensure that the questions are asked respectfully and with kindness towards guests that have given their time to engage with the community.\n\nAlso, please post your questions as top-level comments, not as replies to this sticky. We will not collect any questions that are posted as replies to this stickied comment. Thank you!",
            "**QUESTION**\n\nIf what Grusch has said is true, and If multiple, high level whistleblowers have already provided evidence to congressional staff, who are now well aware of things behind the scenes that the public is not privy to, how realistic can “public pressure”  be at this point? If the UAPDA can be blocked by just a handful of people, presumably under the influence of the “gatekeepers”, what inside deals can be made to persuade them to disclose? Every strategy thus far essentially boils down to pleading with them. What can organizations like yours offer the “gatekeepers” that would be enticing for them to give up their secrets?",
            "Shout out to y'all, I think the mods do a great job (for free!) to keep the sub moving. Thanks for doing the work so we can have interesting conversations.",
            "Guys, I probably won't be available when this happens, so someone please press Matt Ford on his \"OGA are conducting retrievals\" story. While I believe there are crash retrievals, I don't see how or why he and the guy at Liberation Times would be privy to this information. \n\nThey drop this bombshell, we talk about it for a week, then it just goes away and nobody questions him on his sources and nobody presses for more info. Everyone talks about Coulthart and mocks his continual \"I can't divulge my sources\" spiel, but this was one of the biggest things ever dropped in this community and nobody even questions it.",
            "[removed]",
            "I donate $2k a year, what exactly would my money go towards if I made that donation to you?",
            "How can I watch live?",
            "Was this AMA requested by the community or this team?",
            "There have been public disclosure efforts in the US for the better part of a century. Is there any actionable information collected by the UAPDF –no need to share in this moment, I’m patient– that makes the board of UAPDF think that this push will return different results?\n\nAdditionally, due to the lack of progress over the previous 50-60yrs, many who bear an interest in this topic have become jaded by public disclosure efforts such as yours. Are there any avenues of disclosure an individual could pursue (that don’t involve donating money or disclosing my identity) that might result in more salient, personal disclosure? I.e. is the UAPDF aware of any practices or protocols that could result in contact experiences and/or increase an individual’s metaphysical understanding of the phenomena? Or is the UAPDF aware of any widely/freely available resources that could shed light on these mysteries?",
            "Don't give the demons your money"
        ]
    },
    "We're Looking For Moderators": {
        "title": "We're Looking For Moderators",
        "score": 55,
        "url": "https://www.reddit.com/r/UFOs/comments/1dhlfck/were_looking_for_moderators/",
        "content": "Hey everyone, we're looking for new moderators for r/UFOs. [Lack of moderators is still one of the biggest issues facing the subreddit.](https://www.youtube.com/watch?v=VxlIcsWHZHI) No previous moderation experience is necessary. Patience and an ability to communicate are the most important skills to have. \n\nWe have two levels of moderators: **Full Moderators** and **Comment Moderators**. Comment Moderators only act on comments and have less responsibility overall, but are still able to apply to be Full Moderators at any time. \n\nWe're accepting applications for both. You can apply and see the details for each via the links below. If you want an even more granular overview of what moderation entails, you can look through our [Moderation Guide](https://www.reddit.com/r/UFOs/wiki/moderationguide). If you'd like to see an example of what working through the modqueue looks like, you can [watch this walkthrough video.](https://www.youtube.com/watch?v=UHkzORqmeHw) \n\n&nbsp;\n\n\n#[Apply Now](https://www.ufos.wiki/apply/)\n\n\n&nbsp;",
        "num_comments": 79,
        "comments": [
            "It appears that there are 60+ moderators already for this sub (based on the ticker). Are most of them dormant?",
            "I work for the USAF, is that ok or do you have too many of us already? Asking for a friend. Actually the guy in the cube next to me 😂",
            "I'm a current moderator of numerous different subreddits I am more than happy to help",
            "How much does this pay?  My hourly rate is $78 per hour and what are the 401k and medical benefits?",
            "Be careful. Reddit is full of political partisans. I'd hate to see this sub ruined.",
            "Applied.",
            "Here here here",
            "Does it matter if even when multiple people flag a misleading post for violating multiple rules no one moderates it? [https://www.reddit.com/r/UFOs/comments/1dixkui/comment/l97tur8/](https://www.reddit.com/r/UFOs/comments/1dixkui/comment/l97tur8/)\n\nLike, what is the purpose of moderation if it isn't to cut down on disinformation?",
            "How much does it pay?",
            "How many moderators are you looking for in each case?"
        ]
    },
    "Mystery sonic boom traveling at 400 miles per second rattles Mediterranean resorts": {
        "title": "Mystery sonic boom traveling at 400 miles per second rattles Mediterranean resorts",
        "score": 612,
        "url": "https://insiderpaper.com/mystery-sonic-boom-rattles-mediterranean-resorts/",
        "content": "",
        "num_comments": 176,
        "comments": [
            "\n\n\nThe following submission statement was provided by /u/Yoyoyoyoy0yoy0:\n\n---\n\nThe region’s Geophysics Institute and the University of Florence said in a joint statement that whatever caused the boom was traveling at 400 miles per second.\n\nIt is not the first time mysterious sonic booms have been registered on Elba, the Corriere della Sera said. Similar events in 2012, 2016 and 2023 have yet to be explained, it said.\n\n---\n\n Please reply to OP's comment here: https://old.reddit.com/r/UFOs/comments/1dlfbj9/mystery_sonic_boom_traveling_at_400_miles_per/l9oerdt/",
            "I've just read the news in the original language from [https://www.iltirreno.it/piombino/cronaca/2024/06/21/news/boato-sulla-costa-l-ipotesi-bolide-i-dati-e-le-prima-analisi-su-cosa-ha-spaventato-mezza-toscana-1.100542099](https://www.iltirreno.it/piombino/cronaca/2024/06/21/news/boato-sulla-costa-l-ipotesi-bolide-i-dati-e-le-prima-analisi-su-cosa-ha-spaventato-mezza-toscana-1.100542099) , an italian newspaper and I noticed an error of translation in the post that OP linked. The speed of the object is said to have reached a 400 meters/second ( around 0,25 miles/second ) , which is way slower than 400 miles/second.\n\nNow, I don't know if it's a coincidence but also the new experimental Lockheed Martin X-59 supersonic aircraft is expected to fly at 925 miles/hour which is around 0,25 miles/second.",
            "[deleted]",
            "The region’s Geophysics Institute and the University of Florence said in a joint statement that whatever caused the boom was traveling at 400 miles per second.\n\nIt is not the first time mysterious sonic booms have been registered on Elba, the Corriere della Sera said. Similar events in 2012, 2016 and 2023 have yet to be explained, it said.",
            "wait what? I bet it was written as 400 m/s (meters/sec) but the author thought it meant 400 miles per second.  The speed of sound is 343 m/s which could produce a sonic boom.",
            "Why would Italian geophysicists use imperial measurements? And wouldn’t a sonic boom travel at um… the speed of sound? Stay in school, kids",
            "1,440,000 MPH?",
            "This is the funniest UFO I've ever seen. Mixing up meters and miles is so hilariously obvious, with just the right amount of blind US bias - it's chef's kiss perfection.",
            "At a litteral million MPH, if it interacted with air at all it would cause alot more devastation than a sound wave.",
            "I'll copy my comment from somewhere else in this thread for everyone to see. Especially for those who thinks it's just a random meteor.   \n\n\n650000 m/s is really a lot for a meteor. Asteroid's speed would generally be in 10s of kilometres per second, not in hundreds. 650000 m/s is also around 2% of speed of light.   \n\n\nIf their calculations are right the object's velocity is more than galactic escape velocity and the objects they detect could be extragalactic in origin. It would make this detection the first of it's kind.   \n\n\nUFO or not it's either a false detection or not a prosaic object.\n\n\nEdit: apparently it's a translation error and the speed was 400 meters per second not 400 miles per second "
        ]
    },
    "Official Documents Related to the Fabled INERTIAL MASS REDUCTION DEVICE with Redacted Names and NAVAIR Backed FOIA": {
        "title": "Official Documents Related to the Fabled INERTIAL MASS REDUCTION DEVICE with Redacted Names and NAVAIR Backed FOIA",
        "score": 84,
        "url": "https://www.navair.navy.mil/foia/sites/g/files/jejdrs566/files/document/%5Bfilename%5D/2021-003244%20FINAL%20INERTIAL%20MASS%20REDUCTION%20DEVICE%20(1)_0.pdf",
        "content": "",
        "num_comments": 25,
        "comments": [
            "\n\n\nThe following submission statement was provided by /u/FedsRGei:\n\n---\n\n[https://www.navair.navy.mil/foia/sites/g/files/jejdrs566/files/document/%5Bfilename%5D/2021-003244%20FINAL%20VERSION%20PAX%20205%20-%20INERTIAL%20MASS%20REDUCTION%20DEVICE.pdf](https://www.navair.navy.mil/foia/sites/g/files/jejdrs566/files/document/%5Bfilename%5D/2021-003244%20FINAL%20VERSION%20PAX%20205%20-%20INERTIAL%20MASS%20REDUCTION%20DEVICE.pdf)\n\nTurns out its literally the guy who made the Patent for the NAVY\n\n---\n\n Please reply to OP's comment here: https://old.reddit.com/r/UFOs/comments/1dlmjxd/official_documents_related_to_the_fabled_inertial/l9pv728/",
            "It’s interesting that the patent office wrote to the navy to say “this doesn’t work obviously” and the navy wrote back to say “actually it does” and the patent office granted the patent.",
            "[https://www.navair.navy.mil/foia/sites/g/files/jejdrs566/files/document/%5Bfilename%5D/2021-003244%20FINAL%20VERSION%20PAX%20205%20-%20INERTIAL%20MASS%20REDUCTION%20DEVICE.pdf](https://www.navair.navy.mil/foia/sites/g/files/jejdrs566/files/document/%5Bfilename%5D/2021-003244%20FINAL%20VERSION%20PAX%20205%20-%20INERTIAL%20MASS%20REDUCTION%20DEVICE.pdf)\n\nTurns out its literally the guy who made the Patent for the NAVY",
            "*They called it the greatest discovery in human history.*\n\n*But the civilizations of the galaxy called it…*\n\n*…the MASS EFFECT*\n\nQue mysterious synth music",
            "Those that can't acknowledge the possibility simply aren't worth convincing",
            "[deleted]",
            "Pais and his patents are the real deal. This is how we democratize what’s been kept hidden from us. In Ross’s interview with Gallaudet a couple of days ago, he highlights how the US Navy is more transparent about UAP/USO than the Air Force. Because the Air Force has been trying to monopolize what they’ve found.\n\nhttps://youtu.be/Qh_h5OUMKIE?si=Ne-o0N_cWSS2I160\n\nGallaudet’s Sol presentation is super important.\n\nhttps://youtu.be/oq7of1A7F_E?si=9Oam1gUe4tMRAO9_\n\nAs is his interview on the Shawn Ryan show recently.\n\nhttps://youtu.be/2NVDCtSxIac?si=npIN9ot-D-j3OPcq\n\nHaven’t watched this yet, but here he is with Ryan Graves on Graves’ Merged Podcast.\n\nhttps://youtu.be/2NVDCtSxIac?si=npIN9ot-D-j3OPcq",
            "Probably just some goofy project sent to the Navy at one time. Nothing is redacted except personal info which is what b(6) is",
            "Where do you see that?",
            "[https://www.navair.navy.mil/foia/sites/g/files/jejdrs566/files/document/%5Bfilename%5D/2022-006587%20FINAL%20VERSION%20Concept%20Papers.pdf](https://www.navair.navy.mil/foia/sites/g/files/jejdrs566/files/document/%5Bfilename%5D/2022-006587%20FINAL%20VERSION%20Concept%20Papers.pdf)\n\nThis one has some formulas but I'm no good at these things. Can someone take a look at them?"
        ]
    },
    "James Fox promises to us all that we won't be disappointed": {
        "title": "James Fox promises to us all that we won't be disappointed",
        "score": 215,
        "url": "https://i.redd.it/6j3dssfg408d1.png",
        "content": "",
        "num_comments": 205,
        "comments": [
            "\n\n\nThe following submission statement was provided by /u/kake92:\n\n---\n\nAnd before you say James didn't answer the question, he did confirm that Jason Sands will be in his upcoming documentary [https://x.com/jamescfox/status/1793433632532521397](https://x.com/jamescfox/status/1793433632532521397)\n\nHe also said that it will take several months to roll it out once it's finished. Will release likely later this year.\n\n---\n\n Please reply to OP's comment here: https://old.reddit.com/r/UFOs/comments/1dlgl0l/james_fox_promises_to_us_all_that_we_wont_be/l9onno8/",
            "That's not a promise, he said he doesn't think you'll be disappointed",
            "lol is this tweet really worth a thread/discussion about???",
            "Not a single question answered. I'm fine with him letting the work speak for itself but this isn't news. ",
            "I think that I will be disappointed.",
            "This is almost always the first sign that you’re going to be disappointed.",
            "I can’t get any more disappointed at this point. ",
            "No way, someone selling a product says the product is good?",
            "Lol. Guys. Years of this. Vague statements promising news. And yall still fall for it.",
            "oh but many of us will be. i dont care how many first hand witnesses tell me a story. we have many of those and as interesting as they are scientifically they mean nothing. we need a smoking ship a severed alien hand giving us the finger."
        ]
    }
}