{
    "Reminder - the spam filter is a little too aggressive and flags a lot of posts that it shouldn't": {
        "title": "Reminder - the spam filter is a little too aggressive and flags a lot of posts that it shouldn't",
        "score": 279,
        "url": "https://www.reddit.com/r/UIUC/comments/lypvic/reminder_the_spam_filter_is_a_little_too/",
        "content": "If you make a new post and don't see it appear in /new after a couple of minutes, it probably got caught in the spam filter and wasn't removed intentionally. The mods check the spam queue regularly, but if you make a post that isn't showing up then [sending a mod mail](https://www.reddit.com/message/compose?to=/r/uiuc) will help us see it more quickly.",
        "num_comments": 1,
        "comments": [
            "If your posts and comments are being deleted and your account is established in age and karma, please check r/ShadowBan to see if your account is shadow banned. If so, we cannot unban your account. You must message the admins to be unbanned."
        ]
    },
    "What do I do if my apartment is infested with these creepy crawlies?": {
        "title": "What do I do if my apartment is infested with these creepy crawlies?",
        "score": 3,
        "url": "https://i.redd.it/kdhf5402ri9d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "It depends on what they are. Sometimes they just wandered in and don't live there so the best thing is to remove them and try to exclude them by closing cracks and having screens fixed. Sometimes there is a problem in the building and your landlord needs to call pest control for extra treatments. Sometimes something you're doing is encouraging them and you can clean, take trash out."
        ]
    },
    "Help needed ": {
        "title": "Help needed ",
        "score": 21,
        "url": "https://www.reddit.com/r/UIUC/comments/1dqx2ee/help_needed/",
        "content": "So I foolishly thought it would be easy peazy getting a room for this upcoming school year as a returning student.  Turns out I missed the deadline. \n\nI’m returning for my junior year as it was my first semester this past spring. \n\nIt seems that orchard downs apartments are cheaper than Sherman hall (where I was last semester). \n\nI’m 31 years old and I think I had to live in Sherman hall due to my age. And I’d rather not do the more expensive Danial’s hall. \n\nDoes anyone have any input or guidance on this matter?  I was abit irresponsible enjoying myself after my studies along with having a job off campus. Im also the first to leave home for university so I really didn’t have  guidance on this stuff. ",
        "num_comments": 13,
        "comments": [
            "The university has a shortage of housing, even for their apartments. You might be better off getting an apartment from a regular landlord rather than the university.",
            "See if University YMCA  has any rooms left.",
            "I would definitely live in an apartment unless if my dorm was being paid for and even thenour co-ops are pretty cheap though less than 400 for a bedroom and its not just undergrads really",
            "I thought orchard downs is for graduate students.",
            "University owned apartments are completely full, and the waitlists are very long (source: asked the housing office). Youd be best off with off-campus housing. Because youre older look in downtown Champaign or in Urbana, thats where grad students and mature students hang out.",
            "  Octave and smile still have units",
            "You can rent an 2b2b apartment for the full month of July (and only July) if you're interested.  It's a very nice and brand new (or was before I moved in lol) \"luxury\" apartment with a gym, etc and a reserved parking spot I prepaid. Wifi, water, electricity and trash is also covered. Has great AC and heating power and a balcony too. Basically I'm moving out this Sunday and the lease doesn't end until the end of July. Rent is usually $1500+ utilities per month but I can let you sublet for very cheap for a month if you need a place to stay for cheap for a month. I gotta pay the rent anyways and no one is using the apartment, so  just throwing it out there.\n\nAfter July you'd have to start your own lease if you wanna stay. But I can help you cover July if you just need a temp place to be.",
            "Whats your budget?\n\nMy apartment in Champaign is opening up. Its right on the green and blue bus lines so its super convenient.",
            "Roland Realty has rooms I think.",
            "comment of the year goes to.."
        ]
    },
    "CHEM102 What is the syllabus like? What content/textbook does it follow? ": {
        "title": "CHEM102 What is the syllabus like? What content/textbook does it follow? ",
        "score": 2,
        "url": "https://www.reddit.com/r/UIUC/comments/1dr98m4/chem102_what_is_the_syllabus_like_what/",
        "content": "I know it's ultimately up to the professor (prof.Hummel for me), but It would be nice to get to know more about the syllabus for my first year.",
        "num_comments": 1,
        "comments": [
            "This is Hummel's website which contains the course policy and assignments for his section. It also contains the past hourly exams if you are interested.\n\n[https://chemistry.illinois.edu/clc/courses/chemistry-102-hummel/course-policy-and-assignments](https://chemistry.illinois.edu/clc/courses/chemistry-102-hummel/course-policy-and-assignments)"
        ]
    },
    "Available August 1st: Re-Letting 301 W University Avenue Apartment": {
        "title": "Available August 1st: Re-Letting 301 W University Avenue Apartment",
        "score": 1,
        "url": "https://www.reddit.com/gallery/1drcwox",
        "content": "Available August 1st: Re-Letting 301 University Avenue Apartment\n\n1 bed 1 bath available August 1st 1 year lease\n\n301 West University Avenue\n\nFully furnished- $1360 per month\n\nAvailable for early move in July or August 1st\n\nSewer, trash, and internet are included in rent\n\nApartment is brand new, fully furnished, fast internet, in unit washer and dryer, dishwasher, full kitchen, outdoor balcony, flat screen TV.\n\nProperty Management is also extremely attentive and the property is clean and well maintained.\n\nDM me with questions or if you are interested",
        "num_comments": 0,
        "comments": []
    }
}