{
    "r/UKJobs Monthly CV Advice Thread": {
        "title": "r/UKJobs Monthly CV Advice Thread",
        "score": 6,
        "url": "https://www.reddit.com/r/UKJobs/comments/1d5gayp/rukjobs_monthly_cv_advice_thread/",
        "content": "# Welcome to the r/UKJobs monthly thread for CV advice. You can post your CV here and receive feedback from other users.\n\nBe careful when posting your CV that you don't leave any identifying information, and be wary of anyone sending you private messages offering to write your CV for you or claiming that they have a job available for you. Don't engage with anyone privately messaging you. Report users via the built in reddit reporting, or via [modmail here.](https://www.reddit.com/message/compose?to=%2Fr%2FUKJobs)\n\nYou may find it easiest to take a screenshot of your CV and post as an image, either directly using the Reddit app or with a service such as Imgur.\n\nYou'll likely find that you get more useful feedback if you provide some background to your current situation and what kind of roles you're looking for. Are you struggling to break into a new industry? Perhaps you're not getting interviews for roles with increased seniority that you feel you're qualified for?\n\n# Rules\n\n* **Anonymise your CV.** Obscure any personal details, including the names of employers and schools/universities.\n* **Provide context as to what you need help with.** If you're trying to break into a specific industry, this is useful to know. If you only want advice on how to phrase something, or if the layout is okay, say so.\n* **Be constructive in feedback.** People are asking for help, so don't be rude when looking at their CV. Job hunting is hard, why make it harder for someone?\n* **No solicitation.** Don't offer to write people's CVs for them, whether for free or as a paid service. Don't advertise CV writing services. Don't ask for recommendations as to CV writing services. Don't message people either asking for or advertising jobs.\n\n# Mod Request\n\nPlease use this thread to also leave any feedback you feel is relevant, in relation to this thread or the wider subreddit, cheers!",
        "num_comments": 22,
        "comments": [
            "Metrics only matter if they're relevant. Are you applying for retail positions? If so, previous retail is enough, whatever the scale.",
            "Look at it from the employers point of view. They will read between the lines that there wasnt a field sales role available as you werent getting enough sales so they didnt want to displace anyone else to give you the role. If you were that good they would have made a role available, so why didnt they. \n\nI'd go with something along the lines of it was a fixed term role but due to restructuring in the team you and uncertainty in the future of the role and and your personal circumstances at the time you were happy to go back to the Customer Services role as it had better job security but you are now very keen to go back to field sales and build on the success you had while doing it.",
            "Most references these days just say the dates of employment and your last job title, so anyone getting a reference from them it will just show 5 years and last job Customer Services. If youre telling them you have sales experience from that employer you need to explain why you finished up in customer services",
            "I've seen on some websites that you're supposed to add metrics to improve your CV. \n\nWhat if you don't really have any? Like if you've worked at small stores in the past, but they weren't large high street brands? I don't really have any metrics, didn't really have things like customer satisfaction surveys, health inspection scores, error rates or even yearly evaluations. So what do I do there?\n\nI'm looking to get into a retail position at a larger high street store, so I wanna write the best CV possible. Can anyone give me any advice on this when it comes to 'metrics'? Or maybe share a good example of a CV that got you a retail position at one of these stores? (Anonymise your details obviously)\n\nThanks.",
            "Okay so this may be a lengthy post and may not be articulate but need to get this off my chest.\n\nI am 33 this year, always been employed since I was 18, never any gaps, never been sacked either. Unfortunately I have always been resigned to jobs that are low end that other people refuse to do thus have been treated with a total lack of decency and respect. \n\nI was with my previous employer since 2012 until 2022 at a supermarket, unfortunately I never did anything other than working the tills and trolley collection which wont look very good on my CV and as a referree. I left my job to go to a new place thinking I would start fresh and maybe have a better time where I could improve but nope as usual, the curse that has followed me around all my life has happened again.\n\nI work for a medium sized catering company and despite knowing how to operate different machinery and know how to work their till systems im mostly stuck up unloading deliveries and dish washing which I might add nobody else does and outright refuses to do when asked by manager. Anyway im constantly being singled out, I think the problem is one of two things, im placid and kind of quiet and tend to just get on with stuff, on the other hand there are a few work colleagues who dont like me and think im worthless and they dictate to the manager who is to do the undesirable jobs.\n\nOkay so I am aware whoever reads this may think I have some faults which I do as many others do but Im confident in my ability to do other things and I have , the problem is nobody seems to take me serious. I get passed over and underhanded a lot and also when I raise these concerns I get told things will improve but they never do and now im at the point of either going off due to stress or just straight up quitting. \n\nThere are two new employees who have started off working with me but now they have been assigned to different things and I am left doing the work of two people on my own because nobody seems to want to work with me. I have experience and im capable of a lot more than my employer/colleagues are letting on. I am feeling completely alienated and defeated in how I have been and currently being treated, seems Im always going to be resigned to pick up the shit that nobody else wants to do and I am at the end of my tether with it.\n\nHow the hell to deal with and get out of this messed up situation?",
            "I don't think you need to state you're returning to work after a long period of absence. No matter how negative the experience was looking after your relative, simply use that in a positive way and use it as a work experience. For example remove the mention of absence in your summary. Include it as a work experience for example:\n\n2019 - 2024 - Full time carer for a close relative.\n\nIf you still want to include it in your summary then reword it differently such as \"The most challenging stage in my career so far was moving from a 9-5 job to becoming a full-time carer. This presented new challenges and opportunities that has allowed me to adapt and grow\"\n\nYou can also use it as part of your interview questions. Usually you may be asked something along the lines of \"Tell me about a challenging time in your life and how did you overcome it\" or \"Tell me about a time you dealt with a difficult situation and how did you overcome/resolve it\"",
            "First of all, well done on getting out of very challenging circumstances.\n\n  \nI agree with the previous feedback that your caring duties and voluntary work are valuable experiences that should be included in your work history.\n\nI would also change your CV around so that the skills you have are under the job you did.  That's my personal preference, though.  Rather than listing your duties, think about what you accomplished using the Accomplished \\[X\\] as measured by \\[Y\\], by doing \\[Z\\] model.  eg \"Achieved efficient inventory management and supply ordering(X), maintaining a 100% adherence to the finance budget (Y) by collaborating with staff to forecast supply needs.(Z).\"  If that sounds like a robot, it's because I used ChatGPT, but it gets the point across.  You would have to make it your own and it doesn't always have to have numbers - I have this for communication on my own CV: Managed customer inquiries via email and phone with clear communication, providing timely responses and achieving service goals consistently.\n\n  \nHope that helps, and good luck :)",
            "I know it's been a while since you posted, but I think there are a few things you could do to improve your CV.  First off, let's deal with the obvious:\n\n\\* Yes, definitely add that you don't need visa sponsorship to your CV, probably in your personal statement, so that employers can see it straight away.\n\n\\* Remove A levels and GCSE results. If you have post-grad qualifications, there is no need for this information. It's just clutter.\n\n\\* Remove the qualifications header and that you have qualified as a solicitor—it's obvious from your employment history.\n\n\\* Remove the extra course information from your courses.  If you are not applying for solicitor jobs, then you need to list all modules.  Even if you applied for solicitor jobs, you wouldn't need it, as law firms would know what is involved in a law degree.\n\nNow for the trickier part:\n\n\\* You want a job in project management - showcase some pm skills that you have carried out in your current and previous roles, e.g. planning x, delivering something within budget and/or time, managing people, quality assurance, collaboration, and leading on something.\n\n\\* Same for your courses - highlight any projects that you did, eg a group project - what did you contribute/how did you make a difference?\n\n  \nI hope this helps.  Good luck.",
            "Putting my third concern in a separate comment...\n\n**3. University education**\n\nThe other thing that I'm worried about on my CV is the way that my higher education might come across.\n\nI first went to a red brick university in 2004, where I completed the first year of a STEM course. However I couldn't keep up with the second year. So I transferred to an equivalent course at a former polytechnic university, where I repeated the second year, completed the third, and (somehow!) graduated with a First.\n\nOn my CV this is presented like this:\n\n    2006—2008\t[University I graduated from]\n    [Subject] B.Sc. (Hons) degree: First-Class Honours.\n\n    2004—2006\t[First university I attended]\n    Completed first year of [Subject] B.Sc. course.\n\n    2000—2004\t[Secondary school]\n    [A-Level and GCSE results]\n\nNow, I always worry that this admission about not completing the course at my first university will count against me. But how else to present it? I can't claim to have attended the second university for that whole 2004-2008 period. I can't leave the first university out entirely because it'll leave a gap.\n\nHow do you think it comes across at the moment?",
            "Would suggest checking the wiki for r/engineeringresumes and implementing the guidelines for improving your resume.   \nPersonally, I would recommend the following -   \n1. Move the Education before Experience  \n2. Lose the summary, doesn't provide much info for entry-level.  \n3. Try to quantify your bullet points (for eg., improved speed by X%, improved turnaround time by Y mins, etc)."
        ]
    },
    "Accepted a 50 hour week job at 36k per year. Am I crazy? ": {
        "title": "Accepted a 50 hour week job at 36k per year. Am I crazy? ",
        "score": 39,
        "url": "https://www.reddit.com/r/UKJobs/comments/1dr8i2j/accepted_a_50_hour_week_job_at_36k_per_year_am_i/",
        "content": "Just accepted a job concrete batching for 36k 7-5 Monday to Friday 50 hours per week with half an hour lunch per day. \n\nAm I crazy? I’m living off savings atm and have had a few interviews but I’m worried this job is going to be way too many hours / hard work\n\nAnyone else in a similar field / hours? ",
        "num_comments": 97,
        "comments": [
            "If it makes you feel better that is more than a junior doctor earns once they qualify.\n\n£35261 for a 48 hour week working those same hours",
            "I'm living off savings and likely to accept a job thats also way below what I should get but money is money and watching your savings vanish is depressing. Job searching is easier when you are working. Partly cos you aren't worrying about how to pay the bills.",
            "This is the hours I did as Chef but with worse money. Suck it up I say and just look for another job in the meantime. Any prospective employer offering a normal working hours will understand why you are only in this job a short time!",
            "Stick it out for a few years, then use that experience for another job. That’s what I did working on the motorways, could’ve been anywhere between 40 and 80 hours weeks on nights and I averaged about the same over the year. Helped me get a deposit for the house I’m currently renovating with a job that’s the same pay but 40 hour days that I got because of the experience I gained. \n\nThe hard work now will pay off, just got to stick at it.",
            "Jobs are to pay bills, if this pays your bills then fuckin do it lad.\n\nThat being said, that's a lot of hours for relatively meh recompense, I'd be looking for a better position if I had to take this to meet immediate finanacial needs.",
            "I work 60 hours for about 40k as a hgv driver. Alot of my day is easy because sat around so it's not like I'm doing hard graft all day. I don't think I could work where your expected to work constantly 12 hours a day.\n\nThere's lots of jobs I've seen as hgv driver that pays 30k but there much less hours.",
            "You could earn that doing security work, sitting down and doing a few patrols now and then. Kicker is it means working nights and weekends ( not all the time but some of the time ).",
            "I can confirm that earning money prevents starvation and self flaggelation.\n\nAlso, the perfect job doesn't exist.",
            "I very much doubt there would be hard labour involved,maybe a sweep up in areas that get spilled.\nThe loader takes care of that",
            "Pick people’s brains get skills ,learn always be the student ,give it time you will soon move up the ladder"
        ]
    },
    "Being rejected from everywhere": {
        "title": "Being rejected from everywhere",
        "score": 9,
        "url": "https://www.reddit.com/r/UKJobs/comments/1dr6ikz/being_rejected_from_everywhere/",
        "content": "Hi all! I’m a university student currently on their summer break and I’m on a job hunt. So far, I would guess I have applied to around 30 jobs and I just keep getting rejection after rejection. Admittedly, I have no paid work experience but my degree requires me to work in hospitals and I have a little volunteering work behind me. Is there any way I can improve my chances of getting a job? Thanks :)",
        "num_comments": 14,
        "comments": [
            "Isn’t the nhs crying out for people ?",
            "i’m in the same boat except even more jobs applied to and no hospital experience",
            "What kind of jobs are you applying to",
            "When did you start applying? As we had students looking for things months ago",
            "try freelancing if ur have skills like video editing on fiverr or tutoring",
            "Only if you're willing to be paid 1 pound an hour.\n\nFun fact: no.",
            "i mean, the only thing i would be able to do is HCA work but since i am in uni, i'd have to do this on bank, i am waiting for this to re-open but so far, no luck",
            "Minimum wage is £11ish bro",
            "Doesn't stop them from hiring and importing slaves to work for a 10th of the salary.",
            "Agencys"
        ]
    },
    "I feel like indeed is a dead space now. ": {
        "title": "I feel like indeed is a dead space now. ",
        "score": 2,
        "url": "https://www.reddit.com/r/UKJobs/comments/1drd2q0/i_feel_like_indeed_is_a_dead_space_now/",
        "content": "I can’t find anything on there. I’m either not qualified, or it requires a degree, drivers license, or certifications I can’t get. \n\nI’m trying to look for work, but indeed just seems like a ploy to gather information now, instead of actually offering employment. \n\nAnywhere else I can look that isn’t a scam? ",
        "num_comments": 1,
        "comments": [
            "Thank you for posting on r/UKJobs. Help us make this a better community by becoming familiar with the [rules](https://www.reddit.com/r/ukjobs/about/rules/).\n\nIf you need to report any suspicious users to the moderators or you feel as though your post hasn't been posted to the subreddit, message the Modmail [here](https://www.reddit.com/message/compose?to=/r/UKJobs) or Reddit site admins [here](https://www.reddit.com/report). Don't create a duplicate post, it won't help.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UKJobs) if you have any questions or concerns.*"
        ]
    },
    "£23,795 ....... An hour?!  ": {
        "title": "£23,795 ....... An hour?!  ",
        "score": 42,
        "url": "https://i.redd.it/ogwq5d5ixd9d1.jpeg",
        "content": "",
        "num_comments": 24,
        "comments": [
            "They have only done that so it appears in the searches when people put a minimum per hour, higher than minimum wage.\n\nIf anyone complains, they'll say \"oops we meant to put yearly salary\"",
            "Wage stagnation is getting real",
            "Certainly beats the £14k/yr I was getting in 2009 for 70+ hour weeks. McColls can GTFO. Absolutely dreadful company to work for.",
            "Report them. I've seen plenty of such offers. Clickbait",
            "Shame they put 8.00 hours a week, if it was 8.01 hours a week you'd earn an extra £237.95 :(",
            "Apply bro. I think you have a good chance",
            "Could it be £24k per annum pro-rata so about £5k per year or so in reality?",
            "190k a week, that'll bloody do! /s",
            "Even if it’s only 24k, more than worth it for 8 hours a week",
            "Haha they filled the form in wrong."
        ]
    }
}