{
    "Discussion/Question Thread": {
        "title": "Discussion/Question Thread",
        "score": 409,
        "url": "https://www.reddit.com/r/UkraineRussiaReport/comments/12bwp6n/discussionquestion_thread/",
        "content": "All questions, thoughts, ideas, and what not **about the war** go here. Comments must be in some form related directly or indirectly to the ongoing events.\n\nFor questions and feedback related to the subreddit go here: [Community Feedback Thread](https://www.reddit.com/r/UkraineRussiaReport/comments/128l61i/community_feedback_thread/)\n\nTo maintain the quality of our subreddit, breaking rule 1 in either thread will result in punishment. Anyone posting off-topic comments in this thread will receive one warning. After that, we will issue a temporary ban. Long-time users may not receive a warning.\n\nWe also have a subreddit's discord: https://discord.gg/Wuv4x6A8RU",
        "num_comments": 41705,
        "comments": [
            "Anyone else just want this war to end?",
            "Shout-out to the mod who changed my flair from Anti Mods to I love the Mods. I'll keep because you made ma laugh.",
            "This sub needs Priogozhin back. No one can replace his content from challenging Zelensky to a dog fight from an SU-24 to signing boxes of Bakhmut wine in a recently captured underground storage area.",
            "BREAKING: African leaders are on an emergency flight to Moscow with a new peace plan for Shoigu and Prigozhin.",
            "Got banned from /r/CombatFootage and suspended from reddit for 3 days for posting ... wait for it... combat footage on the /r/CombatFootage sub BEFORE reddit introduced a rule specifically targeting anything anti-Israel. This site is a joke. Even more so than when the Russian invasion began.",
            "Biden: If Putin wins against Ukraine he is coming for all NATO countries therefore we should admit Ukraine to NATO because Putin will be scared to attack a NATO country.",
            "Thank God we are back. Imagine being downvoted all over Reddit cause I have a different opinion. This place was one of the only neutral ones. We can’t let it die.",
            "Just imagine Prigozhin is just drunk sitting in his tent making angry messages on telegram and the entire Russian state shat itself and stationed tanks in Moscow and Putin fled on his train in reaction to it.",
            "So Wagner has shown that you can march on Moscow with a few thousand mercenaries, unsuccessfully coup the government and still end up with no reprisals. Certainly a good sign for a healthy state.",
            "Henry Kissenger is dead and shockingly just about everyone is ecstatic in these divided times. From the Cambodia sub, the Chile Sub, Leftist subs, the default news sub, and way more are happy. Even the Conservative sub has little kindness for him and his actions. Can't say it's not deserved though."
        ]
    },
    "Civ pov Pictures in Comments are back, but...": {
        "title": "Civ pov Pictures in Comments are back, but...",
        "score": 148,
        "url": "https://www.reddit.com/r/UkraineRussiaReport/comments/1btbi9w/civ_pov_pictures_in_comments_are_back_but/",
        "content": "They are only the be used to add context to the post such as Hardware / Maps. Any Shitposting or memes will result in a ban ( possibly permanently). We would like to keep them, so don't abuse this. ",
        "num_comments": 73,
        "comments": [
            "I miss prigozhin memes in comment section",
            "I will miss that photo of Zelenskyy in a barrel plane that occasionally appeared in the comments",
            "a sub without memes is like a war without Prigo, come on...",
            "Tbh some pictures were comedy gold and gave me good laughs many times, shame they can’t come back",
            "Unfortunate, but understandable, given how fragile these \"controversial\" parts of Reddit can be. One wrong post and the entire thing is vanished by the website admins.",
            "do warn for the first day of errors first.",
            "Hmmm... Sad we can't do memes... But yeah, better follow the rules than never....",
            "Booooooo! It's a minor inconvenience but life goes on.",
            "I miss the Vilnius of Z on his own looking very annoyed with the caption\" I still get my money don't I\". But that said understand and accept the reasons why. We need to look after this place, or we will lose it, and we know how that feels now.",
            "Could we not have just one stickie where we can run riot within reason with shitposts and memes which can be ignored by those that wish to? Maybe without karma to discourage abuse ?"
        ]
    },
    "UA POV: A Graffiti has purportedly appeared in Munich after Ukraine's elimination in the Euros. It depicts a Ukrainian National Team Player being led away by cheerful military recruiters": {
        "title": "UA POV: A Graffiti has purportedly appeared in Munich after Ukraine's elimination in the Euros. It depicts a Ukrainian National Team Player being led away by cheerful military recruiters",
        "score": 274,
        "url": "https://i.redd.it/nkqgsx6eeh9d1.jpeg",
        "content": "",
        "num_comments": 43,
        "comments": [
            "Will reddit make jokes same like NK got disqualified, but this time switching from going to force labor to trenches?",
            "Damn it was litherly win euro ro die",
            "What an excellent piece of graffiti, it is beautiful and powerful.",
            "It is sad they finished tha last in the group, with the same number of points as the first in their group.",
            "Hopefully, that horrible practice of abduction into forced service gets more press, so it stops.",
            "Why all the puff pieces no major gains in the front, no break through guess its 3 years to Kyiv..",
            "Ofc it had to be Banksy's art style to make it look more credible. One user already fell for it",
            "In North Korea they send you to gulag, In Ukraine they send you to war, choose wisely...\n\nThe art is really amazing too and painfully accurate.",
            "Nothing beautiful about it. Just pro Russian painting trying to put Ukraine in a bad light. Where is the painting of Russians murdering and pillaging. Glory to Ukraine",
            "Kremlin propaganda comrades, don't be deceived, democracy is in peril."
        ]
    },
    "RU POV: Lancet destroys a piece of Ukrainian equipment, Kherson direction ": {
        "title": "RU POV: Lancet destroys a piece of Ukrainian equipment, Kherson direction ",
        "score": 61,
        "url": "https://v.redd.it/7qe4c39sjh9d1",
        "content": "",
        "num_comments": 15,
        "comments": [
            "clearly a decoy including remote controlled decoy soldiers with 'running away' AI protocol to fool the russians",
            "hmm.Russia seems to be running low on lancets,we've seen a massive drop on lancet videos. i guess they don't have a proper production line for these as one article noted.",
            "Either that or Ukraine seems to be running out of targets, and they learned from last month to hide them a lot better.",
            "A massive drop in published videos means absolutely nothing. You still don't know how many videos were made. You still don't know how many misses or hits there scored. You still don't know how many Lancets were launched.",
            "There are fewer videos with Lancet than before.",
            "Only 50 Lancets left guys! Just ignore the 1000+ since",
            "That's only so much better you could get at hiding stuff in the fields. Maybe UA is pulling stuff back or something?",
            "It looks inline with previous months though. May is the anomaly here with almost double the amount",
            "Last month was with the whole kharkov thing, they interdicted tons of equipment",
            "Lol, 'the number of Reddit videos I see allows me to make conclusions about Russia's logistical bottlenecks'.\n\n\nBrilliant."
        ]
    },
    "RU POV: Russian girl meets her pilot from the war": {
        "title": "RU POV: Russian girl meets her pilot from the war",
        "score": 47,
        "url": "https://v.redd.it/j3fdud2tvh9d1",
        "content": "",
        "num_comments": 35,
        "comments": [
            "She got a personal pilot?",
            "lol in America you come back to see your wife banged by your neighbour",
            "Damn, she's seemingly an exceptional keeper. I'm glad for the man.\n\nBtw, song name, please?",
            "🥵 she can't wait to see her man...",
            "good to see Russians have emotions",
            "By pilot, she probably means Nazi that lobs bombs  and missiles on civilian targets from the security of the Russian airspace. Wholesome.",
            "No, his rank is efreytor (corporal) is too low for a pilot, most likely an Air Force mechanic or other maintenance personnel",
            "Yeah but she has to buy her own plane.",
            "it takes one to know one",
            "Eh, usually the pilot will pick a friend to keep his wife occupied.\n\nPeople have needs.  There is no orthodoxy here in the US."
        ]
    }
}