{
    "The Daily Hog is back + Discussion Megathread": {
        "title": "The Daily Hog is back + Discussion Megathread",
        "score": 24,
        "url": "https://www.reddit.com/r/UkrainianConflict/comments/1dp1abp/the_daily_hog_is_back_discussion_megathread/",
        "content": "After a period of hibernation, The Daily Hog is back!\n\nYou can find the previous editions in the last [thread](https://www.reddit.com/r/UkrainianConflict/comments/182f1fp/discussion_megathread_and_daily_news_briefings_by/) or in our [wiki archive](https://www.reddit.com/r/UkrainianConflict/wiki/dailyhog/index).\n\nAs always, it is provided in its original format as a picture and as a text version, for screen-readers and easier access.\n\nA big shout-out and thank you to our friend Hedgehog and all the anonymous helpers who make this excellent daily news summary possible!\n\n---\n\nBelow is a regular discussion Megathread again. This is open for all discussions, ideas, and questions about the war and related topics. The subreddit rules apply here, but we will be more relaxed about slightly off-topic posts or discussions that meander away from the main topic.\n\n---\n\n###The Daily Hog\n\n_To indicate the current edition, we will update the flair of this post with the date of the current briefing._\n\n* 2024-06-27 [Original Format](https://imgur.com/a/UCQ3iMC) / [Text only](/r/UkrainianConflict/wiki/dailyhog/2024-06-27)\n\n* 2024-06-26 [Original Format](https://imgur.com/a/R1LAQCG) / [Text only](/r/UkrainianConflict/wiki/dailyhog/2024-06-26)\n\n* 2024-06-25 [Original Format](https://imgur.com/a/E3yskNz) / [Text only](/r/UkrainianConflict/wiki/dailyhog/2024-06-25)\n\n* 2024-06-24 [Original Format](https://imgur.com/a/tV8miPC) / [Text only](/r/UkrainianConflict/wiki/dailyhog/2024-06-24)\n\n* 2024-06-09 - 2024-06-23 HIBERNATION",
        "num_comments": 1,
        "comments": []
    },
    "🤔 Despite its losses, Russia is recruiting 25,000 to 30,000 new soldiers a month — roughly as many as are exiting the battlefield. That has allowed its army to keep sending wave after wave of troops at Ukrainian defenses, - NYT": {
        "title": "🤔 Despite its losses, Russia is recruiting 25,000 to 30,000 new soldiers a month — roughly as many as are exiting the battlefield. That has allowed its army to keep sending wave after wave of troops at Ukrainian defenses, - NYT",
        "score": 103,
        "url": "https://x.com/Maks_NAFO_FELLA/status/1807027202447335491",
        "content": "",
        "num_comments": 25,
        "comments": [
            "Its a matter of who holds on the longest... how long can they afford to lose that many men.",
            "They may have the numbers but the competence (which was never high) will be tanking and these new Russian recruits will probably never come home.",
            "Even if the numbers are true it's still unsustainable for them. If they continue to have this casualty rate, they are on track to have lost 1% for their entire population in another 3-4 years. That's an astronomical high number of casualties.",
            "Even if is true, they cannot replace equipment at the same rate.",
            "Yes but the Russians  are running  out of every type of equipment and will mot have anything  left by the end of the year. Even if somecsre replaced they can't make artillery  barrels or tank or optics or many other key parts inc helicopters,  planes etc",
            "Ukrainian officials keep on complaining about being outnumbered at the front.  Russia is replacing its losses, and building its Army at a higher rate than Ukraine is able to replace and replentish losses.",
            "this is accurate if u take the Ukraine posted daily losses. Russia is averaging 1k people a day.",
            "I have no idea what source the NYT used.",
            "> If it's from russia we can ignore it.\n\nThe west literally claims that the Russia army is bigger now than it was at the start of the war so of course it is true.",
            "What are people in Russia even thinking?  Do they think 99% of them come back alive and hale?"
        ]
    },
    "ATACMS struck Russia's newest S-500 \"'Prometheus\" SAM system—reports": {
        "title": "ATACMS struck Russia's newest S-500 \"'Prometheus\" SAM system—reports",
        "score": 2812,
        "url": "https://www.newsweek.com/atacms-russia-s-500-prometheus-attack-1918798",
        "content": "",
        "num_comments": 238,
        "comments": [
            "The S-500 is more advanced because it can fail to detect anything at ranges up to 600km whereas the S-400 can fail to detect anything at ranges up to 400km.",
            "This would be embarrassing. S-500 is their version of THAAD, *specifically designed* to counter ballistic missiles much better than their Patriot analogue S-400. \n\nAnd in kinematic terms, ATACMS isn't a particularly impressive ballistic missile. It's fat & slow for the type (albeit more maneuverable than average).",
            "Well there goes Russia's order book for the S500. If it can not work on the missile that the US is in the process of upgrading with a newer and hopefully better missile then why would anyone want them.",
            "Already? I would have laughed at anyone suggesting it could happen this fast. I look forward to further information on the topic, whether it confirms this or not.",
            "If true would be amazing.  Having ATACMS with 300km range successful will eventually force Russia to push back air defences further from the line (well after being stubborn and taking expensive losses).",
            "So, let me get this straight. A 30 year old ATACMS missile just took out Russias one and only top of the line S-500 system, which costs $ 2.5 billion in todays dollars to replace? Damn. 40 year old F-16s will be like gods from above when finally deployed! Lol",
            "Guessing this is why they flattened an apartment block in Dnipro then",
            "Wow. Whats that, three weeks since it was sent to Crimea? \n\nKeep going russia, you're doing great.",
            "Is the S-500 engineer in the gulag yet?",
            "If this is true, it's potentially a huge setback for the whole program. This is/was the *only* S-500 in existance, it's effectively a prototype, the kind of thing you test for five years before taking the lessons learned and building the production units. If that thing got toasted, it's not just the machine: all that testing is lost, along with part or all of what's probably the only trained S-500 crew in existence. They might even be the factory techs, legit rocket scientists, and some portion of them would be dead and all their knowledge and experience lost."
        ]
    },
    "Russian coal industry profit drops by 93% amid sanctions and loss of clients – The Moscow Times .": {
        "title": "Russian coal industry profit drops by 93% amid sanctions and loss of clients – The Moscow Times .",
        "score": 557,
        "url": "https://english.nv.ua/nation/russian-coal-industry-profit-collapses-by-93-amid-sanctions-50430857.html",
        "content": "",
        "num_comments": 42,
        "comments": [
            "\"This means war!\" -- russians, 2024",
            "Not like he can go against North Korea and start dumping it in China.",
            "Fine. Let them make soup from it.",
            "I like when ruzzians say that: \"Sanctions have no effect\" :D.\n\n93% of profit loss is basically riding fast towards bankruptcy, I doubt they will be still operative one year from now.",
            "These are just the profits, industries can slouch on for a long time while piling up debts.",
            "It would affect global gas prices a lot, wouldn't it? As I understand, we in Europe have stable prices mostly because we are re-buying the same ruzzian oil through India.",
            "There is the story of Bob Murray, a US coal baron who bought coal mines right and left, became a huge Trump donator, and got his personal coal policy wish list (taxes, enviroment protection rollbacks) rubber stamped while he was in office. His company went bancrupt in 2019. Some economic trends are so strong that you just can't turn the tides.",
            "Thats what Russia said two years ago.",
            "According to russia sanctions have no effect except to hurt the west and yet every time there is any discussion on Ukraine russia demands all sanctions end.",
            "have you seen interest rates in Russia right now?\n\nYep, bankruptcy, fast."
        ]
    },
    "Ukraine: Solar installations explode in the face of bombardment": {
        "title": "Ukraine: Solar installations explode in the face of bombardment",
        "score": 88,
        "url": "https://energynews.pro/en/ukraine-solar-installations-explode-in-the-face-of-bombardment/",
        "content": "",
        "num_comments": 13,
        "comments": [
            "solar power is for energy production during wartime what the Javelin is for destroying tanks: decentralized, impossible to stop,easy to learn how to use",
            "I think they could use a better word than explode",
            "That headline made me scratch my head for a moment",
            "Explode is probably a poor choice of word there",
            "Like i literally did an essay on it, the decentralisation of infrastructure is vital in a situation like this.",
            "I was surprised when Ukraine announced a new nuclear plant about 3 months ago given what has happened.",
            "I think it is only you who had this thought...",
            "Without nuke plants to run baseline, the grid's as good as dead.\n\nThey're the main reason we have power cuts, instead of perma-blackout.",
            "What a dishonest negative-sounding clickbait title for an actual good news article.\n\nWhen you say something \"explodes\" because of bombardment in war, nobody is going to think it means \"explode\" in the euphamistic sense of \"a sudden increase in popularity\" like they mean here.\n\nThey knew what they were doing there.",
            "Thank you."
        ]
    }
}