{
    "Ukraine War MegaThread for the Week of June 24, 2024": {
        "title": "Ukraine War MegaThread for the Week of June 24, 2024",
        "score": 79,
        "url": "https://www.reddit.com/r/UkraineWarVideoReport/comments/1dn173w/ukraine_war_megathread_for_the_week_of_june_24/",
        "content": "Use this thread to discuss, ask questions or speculate.\n\nPlease remember the subreddit and Reddit rules and stay civil.",
        "num_comments": 3,
        "comments": [
            "Watching videos of Ukrainian soldiers fighting in full gear during the summer with temps now heading beyond 30degC makes me wonder how the hell it's possible? I work an outdoor manual job and if I wear anything more than shorts and a vest at the moment I feel like passing out.",
            "Please remember the human. Adhere to all Reddit and sub rules. Toxic comments (including incitement of violence/hate, genocide, glorifying death etc) WILL NOT BE TOLERATED, keep your comments civil or you will be banned. Tagging u/SaveVideo bot to archive this video in a link below this comment. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UkraineWarVideoReport) if you have any questions or concerns.*"
        ]
    },
    "UPDATE - Reporting War Crimes": {
        "title": "UPDATE - Reporting War Crimes",
        "score": 3026,
        "url": "https://www.reddit.com/r/UkraineWarVideoReport/comments/wb6bsm/update_reporting_war_crimes/",
        "content": "Hello all, thanks for the continued support of the sub and for being the frontline for exposing war crimes.\n\nOn the subject of war crimes, the recent video circulating of the castration of a Ukrainian POW, has made an impact on us all. These acts cannot go unpunished.\n\nPublishing peoples private information is against Reddits rules however below we have provided links to submit information and footage of war crimes and the perpetrators to The Hague.\n\nThe Hague:\n1) By post to: \nInternational Criminal Court Office of the Prosecutor Communications Post Office Box 19519 2500 CM The Hague The Netherlands \n\n2) By email to: \nhttps://otplink.icc-cpi.int/\n\n3) By fax to: \n+31 70 515 8555\n\nThanks again for the support and keep up the good work!",
        "num_comments": 137,
        "comments": [
            "I understand but I pray to god this guy will get caught",
            "I got to the part of them just about to cut, had to turn off, makes me so angry and sad that you could do that. Only way I want to see Moscow is rubble",
            "We as the moderators of this sub have no say or influence in Reddits set rules. We are pointing them out to the community so that you will not be unnecessarily shadow banned from ours or any other sub.",
            "Pics put up and other info available on social media is not private info.",
            "Can you please stick it on topic for permanent access? THX",
            "He who fights with monsters might take care lest he thereby become a monster himself.\n\n-Friedrich Nietzsche, Beyond Good and Evil",
            "People private information were never shared, that's not a \"people\" anymore.",
            "Is anyone actually being prosecuted for a single warcrime in this invasion yet? Would be hard to bring them to justice when they are occupying the country and no one is willing to go get them in russian territory.",
            "In countries like Brazil, Mexico, Colombia and the rest of South America people are killed in this way every day or even in worse ways, even in Asian countries or countries with oil and poor countries they cruelly kill people and I don't see anyone protesting or complaining of those crimes",
            "The Reddit hierarchs need to go"
        ]
    },
    "Ukrainain drone captures a video of a \"Russian Zombie\"": {
        "title": "Ukrainain drone captures a video of a \"Russian Zombie\"",
        "score": 458,
        "url": "https://v.redd.it/38xb2dtwlh9d1",
        "content": "",
        "num_comments": 30,
        "comments": [
            "Did he lose his eyes? Holy shit",
            "Shaun and Ed will be throwing their record collection at this one in no time",
            "You can see a gaping hole about the size of a golf ball center of his forehead between eyebrows. I bet he's functioning on limited mental ability due to TBI. So yes, a Zombie we can call it.",
            "Probably got left for dead and then woke up a few days later. Hes no longer a threat but if I were a drone pilot id put him out of his misery as an act of mercy.",
            "At this point I just want this war to stop. The mad politicians who give orders are not the one who suffer. Putin needs to pull his troops out of other's nation border to end this madness.",
            "Was probably a cocky Z patriot yesterday. Look at it now.",
            "There's an error in the title of this Post.\n\nThe word \"russian\" is redundant.",
            "Rick Grimes is on his way to put him out of his misery",
            "Its russias dream at this point. War would have been over a long time ago if most of the nation didnt stand behind it.",
            "No. The word 'Zombie' is redundant, not 'ruZZian' :)"
        ]
    },
    "A Ukrainian and two Russian women talk in chat roulette about the war, history and NATO. ": {
        "title": "A Ukrainian and two Russian women talk in chat roulette about the war, history and NATO. ",
        "score": 2777,
        "url": "https://v.redd.it/sdronu86pe9d1",
        "content": "",
        "num_comments": 440,
        "comments": [
            "i thought that being young the two women might be a bit more politically aware and sympathetic to what their country is doing to ukraine. But it turns out they're just as smoothbrained and propaganda filled as all other russians.",
            "Facts aka The Truth Comes harder than any weapon of war",
            "How are you a country you dont have oil! Smdh",
            "I watched about half of it and I just could not go on. These girls are so brainwashed and so ignorant.",
            "I'm gonna assume this is too depressing to watch.",
            "You can't just change the mind of the stupid and the ignorant, it takes a long time to educate them.   \nThe kid does a very credible job, though.  \nSLAVA UKRAINI!",
            "I listened to all of it.  Russians are ignorant because they aren't taught history if it doesn't somehow glorify Russia and in the current environment, they're taught only what they're spoon-fed.  I know because I'm married to a Russian.  Well, half-Ukrainian and half-Russian.  She's from Barnaul so I suspect her ancestors on her mother's side were forcibly relocated to Siberia by Stalin.  Simply generation after generation of wrongs perpetuated on non-Russians whether it be Soviet or Federation peoples.  Those who rule or have ruled Russia historically are just plain barbarians.   If you're in Russia's orbit and you're not Russian, you're fucking nobody unless you're a toady like Ramzan Kadyrov.  I will say, though, that the people I know in Russia I loved.  They were good to me and I won't indict all Russians for Putin's crimes.\n\n Frankly, I was amazed about how little my wife knew about history outside of any of Russia's place in it until after the Soviet state ceased to exist.  She didn't even know anything about the Berlin wall.  She's all in on Ukraine though.  She has nostalgia for her homeland and place of birth as most people would but she has absolutely zero desire to go back to that corrupt shithole.",
            "This is a master class in arguing by the Ukrainian.",
            "They have such a hard time hearing anything he is saying and squaring it with how they have been told to view the world. I think it's better for the world if Russians stay behind their own borders.",
            "This is the average Russian. They have no idea what NATO is but yet they will blame NATO for them invading Ukraine. Then they say things like Nazism despite the fact that the Ukrainian president is a Jew. Bunch of brainwashed idiots."
        ]
    },
    "Trucks don't survive long at the front, and APCs are in short supply, so this is what Russia is making do with now: Motorcycles and sidecars awaiting delivery to Russian forces.": {
        "title": "Trucks don't survive long at the front, and APCs are in short supply, so this is what Russia is making do with now: Motorcycles and sidecars awaiting delivery to Russian forces.",
        "score": 616,
        "url": "https://v.redd.it/osdt3vtvqg9d1",
        "content": "",
        "num_comments": 173,
        "comments": [
            "LMAO. Using a red cross symbol that they don't even recognize on the battlefield. Oh the irony. Knowing the Russians, they will just use the \"red cross\" vehicles to transport arms and military supplies. Hiding behind a medical symbol - sounds Just like a terrorist group we know in the middle east.",
            "Is that the same boxer engine tech they took from Germany after ww2??",
            "Wow, they found a few Wehrmacht BMW's with sidecars and air cooled boxer engines. Orcs plundering museums now.",
            "No other fucking military is doing this shit right now and Russia is going this and we see in drones how easy pickings these are god lee man what a shitty way going out",
            "Theyve been making these for years. Really popular with the WW2 reenactor crowd.",
            "Poor Horses - they will be the next ..",
            "This looks like the bike design the Soviet Union copied from Germany in WW2.",
            "Motorcycle with sidecar, why does this sound and look so familiar...",
            "Russia never diverted from line infantry-style combat. This is what happens when all you do is zergling rush all your ground forces into a gun line of advanced weaponry in the hands of people trained in manouver warfare. Everything you have is ground down.\n\nI never thought I'd see Iranian munitions used by russia in old ww2-era soviet weapons drawing infantry auxiliary from africa, india, china, and north korea. Slowly but steadily becoming a Chinese Vassal...",
            "So they come with a coffin"
        ]
    }
}