{
    "4:50 EEST; The Sun is Rising Over Kyiv on the 856th Day of the Full-Scale Invasion. How Irpin is being restored (Part 1).": {
        "title": "4:50 EEST; The Sun is Rising Over Kyiv on the 856th Day of the Full-Scale Invasion. How Irpin is being restored (Part 1).",
        "score": 98,
        "url": "https://www.reddit.com/r/ukraine/comments/1dr0ch5/450_eest_the_sun_is_rising_over_kyiv_on_the_856th/",
        "content": "We are **Ukraïner**, a non-profit media aimed at advocating for the authentic Ukraine - and unexpected geographical discoveries and multiculturalism.\n\n**This is part one of an article was first published on June 5th, 2024.**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n# How Irpin is Being Restored (Part 1)\n\nhttps://preview.redd.it/dn8uft6osd9d1.png?width=1333&format=png&auto=webp&s=5d5a73fe92633e539977f742d42b45e9c54af6a2\n\nIrpin is one of the cities whose reconstruction has become an extensive process with many contributors. Residents of an apartment building repair a shell-damaged roof and install windows in their apartments on their own. Lithuanian partners restore some socially important facilities, such as a kindergarten. Ukrainian authorities initiate the construction of a critically important bridge next to a destroyed one. Ukrainian specialists have created a massive digital platform where affected communities and interested donors can find each other and build transparent cooperation.\n\nIrpin is located in the suburbs of Kyiv, so at the beginning of the full-scale armed aggression by the Russian Federation, it was partially occupied and became a gray zone where battles took place. Many residents evacuated on the first day, some passing under a destroyed bridge over the Irpin River, and others stayed in the city - including in the occupied part. They had no electricity, communication, or water and were forced to hide in basements while the occupiers looted their apartments. After the liberation of Irpin on March 28th, 2022, various media and foreign delegations began visiting to see firsthand the aftermath of the \"Russian world\": death and destruction. In the first month of the full-scale invasion, 70% of the infrastructure of Irpin was damaged.\n\nhttps://preview.redd.it/ut83y3basd9d1.png?width=1500&format=png&auto=webp&s=66646d47a91d527717277173e8f651415827336a\n\nSo far, the reconstruction of Irpin has been piecemeal: residents are taking care of their homes, foreign partners are implementing projects mostly related to social infrastructure, and so on. However, compared to the spring of 2022, there has been significant progress towards a more comprehensive approach to recovery. In a new article from the multimedia project \"City Reconstruction,\" we discuss the State-managed digital fundraising platform for reconstruction — DREAM, the activities of the National Agency for Reconstruction and Development of Infrastructure, particularly the rebuilding and memorialization of the Irpin Bridge. We also cover the kindergarten \"Ruta,\" which the State of Lithuania has undertaken to restore, and the vision of Irpin resident and architect Oleh Hrechukh on how his city should develop further.\n\n# Reconstruction Agency\n\nAt the beginning of 2023, the National Agency for the Reconstruction and Development of Infrastructure was established in Ukraine, based on the National Agency for Infrastructure Projects and the National Agency for Auto Roads. It is subordinate to the Ministry for Restoration. The head of the Agency, Mustafa Nayem, explains: the Ministry forms the recovery strategy, and the Agency works on its implementation. The current main tasks of the Agency are numerous, including state roads, bridges; building mechanical protection for energy facilities from debris; water supply in the Dnipro and Zaporizhzhia regions; infrastructure of checkpoints on the western border (a logistics artery for deliveries, such as weapons); reconstruction of civil infrastructure; housing restoration, particularly in Yahidne in the Sivershchyna region, Posad-Pokrovske in the Black Sea region, and Irpin in the Kyiv’s Polisia region.\n\nhttps://preview.redd.it/8hwgse9bsd9d1.png?width=1500&format=png&auto=webp&s=8f031f72187129bae96b3ecd9c0eb04b0457a3f8\n\nMustafa explains the priority of the chosen directions using the example of a road checkpoint: before the full-scale war, ports were operating, airplanes were flying, so the load on roads and railways was significantly lower:\n\n\"Currently, 80% of everything leaving the country travels by road.\"\n\nhttps://preview.redd.it/0z85uufcsd9d1.png?width=1500&format=png&auto=webp&s=73611a3b03b2b9e554e66a3c744096c6610db94b\n\nHe says that there are many challenges posed by the full-scale war: the country has never faced such extensive destruction, and large projects like the 140-kilometer aqueduct were not carried out for a long time, possibly not since the USSR era. Reconstruction and housing construction need to be adjusted: the State lacks the appropriate mechanisms because the real estate market was private.\n\n\"Currently, we are organizing the recovery machine, which, after the war, will focus on modernizations, new standards, and so on. One of our goals is to be the most stable partner trusted by all players in the construction sphere. That includes donors, the State, local governments, and most importantly, citizens. Therefore, reputation is important to us.\"\n\nIn February 2024, the Agency presented the first edition of the recovery manual, detailing the sequence of actions and the list of documents needed for the recovery project. Local governments, among others, can use it.\n\nOne of the Agency's messages, both domestically and abroad, is that all of this needs to be done now, during the war. Mustafa emphasizes that they are talking about the infrastructure needed for the country to continue living and defending itself:\n\n# \"For now, we're talking about the survival stage, not recovery. The country needs to survive until the end of this war, to win. Then we will deal with recovery, development, and so on. At this stage, with limited human, financial, and even emotional resources, [we need] to do the maximum so that people can live with the comfort they can have.\"\n\nMustafa believes that nearly all projects funded by the State should involve the public, except perhaps for military or other classified facilities. The agency has various tools for this, including the Council of Integrity, which includes representatives of civil society.\n\n\"Since we work locally, in regions, and the main clients are the residents there, \\[...\\] we always conduct public hearings. There is a clear legal procedure for how it should be done, people vote.\"\n\nThis was the case when discussing the design code for the Yahidne village and deciding whether to combine a school, kindergarten, library, and stadium into one structure in Posad-Pokrovsky. According to Mustafa, officials from different regions sometimes treat this procedure as a formality, but, in his opinion, it is about the legitimacy of decisions and people's trust in the authorities.\n\n\"It seems to me that trust is the main asset that will enable our Agency and the country as a whole to attract more resources and progress faster in the future.\"\n\n# Irpin Bridge\n\nIn the context of modern war, many significant events are associated with footage from reporters. One such event is the blown-up bridge over the Irpin River on February 25th, 2022. It halted the movement of the occupiers towards Kyiv but also prevented people from leaving Bucha, Vorzel, and Hostomel, where fighting was taking place. Photos of the pedestrian evacuation under the rubble of the bridge were shocking. Mustafa Nayem says:\n\n\"Hundreds of people were under the bridge, transport was blown up, and it really was one of the symbols of those days - the beginning of \\[full-scale\\] war, when people were left without the opportunity to leave, but it was the only way to stop the occupiers.\"\n\nhttps://preview.redd.it/gw01cckrsd9d1.png?width=1500&format=png&auto=webp&s=7ef504501ac67bd682b8852df5f8ea52e964dcc8\n\nAfter Ukrainian defenders pushed occupiers out from under Kyiv, a narrow temporary embankment bridge was quickly constructed near the destroyed bridge. This temporary structure enabled the movement of transport to carry weapons, medicine, food, and allowed people to return. Simultaneously, a decision was made to build a new bridge resembling the one before it was destroyed near the ruined section. According to Mustafa, action began swiftly, which is unusual for projects funded by the State.\n\n\"Probably, in peacetime, such decisions would take much longer to be made.\"\n\nHe explains the rationale behind restoring the bridge not only for the community's comfort (as the narrow embankment caused constant traffic jams) but also for the importance of transportation arteries, particularly during wartime.\n\n\"It's important to understand that logistics during war is part of military infrastructure, part of what enables us to fight. When we talk about bridges, roads of defense significance, fortifications, and so on, it's not in opposition to war.\"\n\nhttps://preview.redd.it/6mgeq3agsd9d1.png?width=1500&format=png&auto=webp&s=0b7eb1187621fe7ce3e346eedf78948c0074d238\n\nIn addition to its practical role, this construction had a symbolic importance:\n\n\"For us, it's a vivid example that despite the war, we must continue living. People cannot stop their lives because they still have tasks, including the military, who have to keep fighting and somehow survive during this time. Therefore, despite the war, this reconstruction is ongoing.\"\n\nFurthermore, Mustafa's team initiated the creation of a memorial on the basis of the destroyed bridge. Public hearings were held where this idea was approved. They plan to create a park, and there are already sketches that will be realized after the war.\n\n\"The idea is to preserve the bridge exactly as it was after its destruction. This means even the vehicles that were destroyed there will be preserved, and they will remain in that state; nothing will be restored in this ruined section.\"\n\nMustafa adds that he understands for people who pass by it daily, this scene can be painful; however, it's primarily about preserving the memory for future generations of Ukrainians.\n\n# \"I really hope that our children, grandchildren will remember this and remember at what cost freedom comes, and most importantly, they will not allow the return of those same traditions when Ukraine was permeated with Russian influence at all levels. This memorial is meant to be a monument that will prevent this from ever happening again.\"\n\nThe restored bridge was opened in 2023 on the Day of Dignity and Freedom.\n\n\"By the way, it's a symbolic story. On November 21st, we opened traffic on it, which happened to be the day the Revolution of Dignity began. It wasn't planned… it just happened that way.\"\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThe 856th day of a ten year invasion that has been going on for centuries.\n\nOne day closer to victory.\n\n# 🇺🇦 HEROYAM SLAVA! 🇺🇦",
        "num_comments": 5,
        "comments": [
            "I am sorry that just as you were starting to build your country, the orcs started destroying it. It's been uphill for you every step of the way. But your people seem to have the will to make great things happen.\n\nSlava Ukraini! Good night.",
            "Strong article. Good work the put out there in Irpin. \nThis still is a fact that blowd my mind somehow. They defy that ruZZian BS EVERY.SINGLE.DAY to work and rebuild. 💙💛",
            "🇺🇦 !",
            "I’m so sorry\nWhat can we do besides supporting NATO?\nI don’t want to see more suffering",
            "\nПривіт u/Ukrainer_UA ! During wartime, this community is focused on vital and high-effort content.  Please ensure your post follows [r/Ukraine Rules](https://www.reddit.com/r/ukraine/about/rules) and our [Art Friday Guidelines](https://www.reddit.com/r/ukraine/wiki/artfriday).\n\n**Want to support Ukraine?** [**Vetted Charities List**](https://www.reddit.com/r/ukraine/wiki/charities) | [Our Vetting Process](https://www.reddit.com/r/ukraine/wiki/charities-vetting)\n\n**Daily series on Ukraine's history & culture:** [Sunrise Posts Organized By Category](https://www.reddit.com/r/ukraine/wiki/sunriseposts/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ukraine) if you have any questions or concerns.*"
        ]
    },
    "Special $5 raffle! Maxim Kilderov \"Blank on Black\" sticker set signed. by. Budanov. Proceeds go toward a vehicle for the Raven Group of the UDA.": {
        "title": "Special $5 raffle! Maxim Kilderov \"Blank on Black\" sticker set signed. by. Budanov. Proceeds go toward a vehicle for the Raven Group of the UDA.",
        "score": 79,
        "url": "https://www.reddit.com/r/ukraine/comments/1dpsh2u/special_5_raffle_maxim_kilderov_blank_on_black/",
        "content": "# Made by Kilderov. Signed by Budanov. What's not to love-ov-ov?\n\n&#x200B;\n\n[Blank of Black sticker set with Budanov's signature on the back](https://preview.redd.it/b5mmx6h4g49d1.png?width=1811&format=png&auto=webp&s=08dcd2177794d4c7f4feffa88b840ff21a63836f)\n\n[You guys remember this goodness, right? When Budanov signed a bunch of Kilderov's work?](https://new.reddit.com/r/ukraine/comments/1djrmth/finally_the_best_picture_in_the_world_have_a_big/)\n\nWell.\n\nYou could own one of them.\n\nRaffle link in case you're like OMG DON'T NEED BACKGROUND INFO GOTTA HAVE IT NOW: [https://givebutter.com/ByXsHJ](https://givebutter.com/ByXsHJ)\n\nFor the rest of you:\n\nThe Raven Group of the Ukrainian Volunteer Army, part of the Territorial Defense Forces, needs a vehicle for various combat purposes. They need at least $5000 to get a halfway decent one.\n\nIn case you don't know u/Kilderov's story:\n\nNova Kakhovka-born artist [Maxim Kilderov](https://www.instagram.com/kilderov) has been working to support Ukraine since the first day of the full-scale war. Under occupation, he cofounded a volunteer network to get food and medical supplies to Nova Kakhovka's most vulnerable residents. He had to leave Nova Kakhovka for his own safety after [he spray-painted a burnt out, abandoned russian IFV](https://www.cbc.ca/radio/asithappens/as-it-happens-the-wednesday-edition-1.6394867/ukrainian-artist-turns-abandoned-russian-tank-into-resistance-art-1.6394872) and caught the attention of the occupiers. Since then, he's poured most of his time and energy into supporting the UAF through art sales and fundraising.\n\nWe and Kilderov want to help Raven close their collection, so we're raffling this Blank of Black sticker set signed by none other than the man, the myth, the meme: **Chief of Defense Intelligence of Ukraine Kyrylo Budanov**.\n\nKilderov painted Blank of Black after he escaped occupation, as part of [an exhibition in the Kyiv's Lavra Art Gallery](https://www.youtube.com/watch?v=UujeXg02eDA). Blank of Black is currently on exhibit in the [Ukrainian Revival exhibition at UNESCO in Monaco.](https://sites.google.com/view/ukrainian-revival/max-kilderov)\n\nTickets are $5 and you can buy as many as you wish! Givebutter does limit you to 10 per transaction, though. [Buy yours here!](https://givebutter.com/ByXsHJ)\n\n**Please note**\n\nThough the event description mentions a livestream, there will be none. And while we do deeply appreciate those of you who choose to donate as well as buying raffle tickets, we want to make it clear that donations are *not* required to enter the raffle.\n\nThe winner will be drawn and notified on Monday, July 1.\n\n&#x200B;\n\nhttps://preview.redd.it/0yrl1hy0i49d1.png?width=894&format=png&auto=webp&s=60e161e5ff2d670f72cfb2ea2f41361c6b9b6ed3\n\nAt the one day we will wake up not because of explosions but because of passion and desire.On the blank of black we will build our yellow and blue.\n\n&#x200B;",
        "num_comments": 5,
        "comments": [
            "awww that's awesome. loving all the raffles. gonna order some tickets shortly!",
            "This is one raffle not to be missed!  Well, all raffles by UFL are not to be missed. :)",
            "Commenting to boost here. Get in on this raffle!",
            "Donated + some tickets",
            "\nПривіт u/UFL_Robin ! During wartime, this community is focused on vital and high-effort content.  Please ensure your post follows [r/Ukraine Rules](https://www.reddit.com/r/ukraine/about/rules) and our [Art Friday Guidelines](https://www.reddit.com/r/ukraine/wiki/artfriday).\n\n**Want to support Ukraine?** [**Vetted Charities List**](https://www.reddit.com/r/ukraine/wiki/charities) | [Our Vetting Process](https://www.reddit.com/r/ukraine/wiki/charities-vetting)\n\n**Daily series on Ukraine's history & culture:** [Sunrise Posts Organized By Category](https://www.reddit.com/r/ukraine/wiki/sunriseposts/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ukraine) if you have any questions or concerns.*"
        ]
    },
    "U.S. Army orders 870 more Patriot missiles": {
        "title": "U.S. Army orders 870 more Patriot missiles",
        "score": 820,
        "url": "https://mil.in.ua/en/news/u-s-army-awards-contract-for-production-of-870-patriot-missiles/",
        "content": "",
        "num_comments": 46,
        "comments": [
            "Coming to an oblast near you , angry little orc.",
            "Those are rookie numbers. Need to build more factories that build them.",
            "Good, send them what they need then send more!",
            "$4m a pop. Put into context, an iron dome missile costs $50,000.",
            "That doesn’t seem like much",
            "Woah - that would cost... well, an absolute bomb! $3 billion for all of them? \n\nThey'd be worth it if they are taking down 20 million dollar fighters and 50 million dollar AWACS etc.",
            "\"Why you bully me?\" -- angry little orc",
            "Express delivery! (*Launcher sold separately. Restrictions apply*)",
            "Not enough. They have to limit usage to try to save some for important targets. If we could increase supply they could be hitting a lot more targets and we wouldn't be seeing as many bombs falling on civilians.",
            "At the end of the day, it's all cold math.  \n  \nThe patriot missile costs 1M$, no one can afford to shoot a patriot on the first target that comes."
        ]
    },
    "Total combat losses of the enemy from 24.02.22 to 29.06.24": {
        "title": "Total combat losses of the enemy from 24.02.22 to 29.06.24",
        "score": 987,
        "url": "https://i.redd.it/7f7u1yeipf9d1.jpeg",
        "content": "",
        "num_comments": 44,
        "comments": [
            "Yes!! Artillery getting wrecked today!",
            "Can’t wait until the S-500 is added to the stats",
            "Day after day russia is becoming less significant. Good news for the future of humanity.\n\nSlava Ukraini 🇺🇦!",
            "When did they reach 500,000? End of May? 40,000 since the end of May! 200,000 b4 the end of Nov? 750,000 by Christmas? This is unsustainable. Putz needs help to the River Styx.",
            "Better dust off my 20,000 Vehices & Fuel Tanks hat.",
            "Tanks back down to single-digit. Guess we wait for the next train-load to turn up.",
            "Russian artillerycraft number are looking spicy.",
            "My goodness is orc artillery feeling the pain. Good",
            "How many tanks do they possibly have left? I thought I heard at the beginning they were supposed to have something like 10,500 but a good chunk were believed to be junk / parts / inoperable…",
            "How do the uaf manage to destroy that much of artillery the last weeks, have there been any new weapons given to do such?"
        ]
    },
    "Cease-fire offer for Ukraine described as 'propaganda' by Italian Premier Meloni": {
        "title": "Cease-fire offer for Ukraine described as 'propaganda' by Italian Premier Meloni",
        "score": 802,
        "url": "https://apnews.com/article/italy-g7-meloni-putin-ukraine-78cdbaa0d45f9b11a190ee647063eb5f",
        "content": "",
        "num_comments": 33,
        "comments": [
            "\"Cease-fire\" = \"Opportunity for russia to rebuild its forces ready for the next round\"",
            "Ukraine absolutely should not let up. Any sort of “ceasefire” is only going to serve Putin to build up reserves. At this point, they are losing as many (or more) people per month than they can recruit. Mobilization is next. Make the Muscovites fight and they’ll turn on their little tzar. We need to get Ukraine the all the weapons necessary to take this fight to them. \n\nKeep your heads high. More help is coming.",
            "I'm not a fan of Meloni, but compared to her counterparts on the right, she seems to have her values in the right place.",
            "putin's ceasefire: Time out! Timeout! Stop shooting back at me! Let me catch my breath so I can shoot at you some more!",
            "nice to see a top EU politician using the correct words for RU sh*t.",
            "Putins peace plan: give me the conditions to take everything or i'll take everything.",
            "Exactly what I was thinking of",
            "Also why any talk about letting Putin have territory should be completely off the table.  All it will do is give him an area to build up for his next attack.",
            "Putin thinks he only needs to hold out until the US/German/French elections. He's not wrong.",
            "The only thing I'm worried about is if Ukrainians don't turn on their government first. Mobilization is already in full effect, people are getting taken off the streets. Ukraine is simply running out of people and no amount of equipment can fix that. Unmanned equipment can help, sure, but rotations on the front have already almost stopped and the badasses in the trenches are growing tired. \n\nJust please don't call me pro-ruzzian for this. I hate ruzzia and I wish nothing more than a complete strategic defeat to them. Ukraine deserves peace and justice, I just wish the price to pay wasn't so high and horrific."
        ]
    }
}