{
    "r/Ultralight - \"The Weekly\" - Week of June 24, 2024": {
        "title": "r/Ultralight - \"The Weekly\" - Week of June 24, 2024",
        "score": 9,
        "url": "https://www.reddit.com/r/Ultralight/comments/1dn7d7q/rultralight_the_weekly_week_of_june_24_2024/",
        "content": "Have something you want to discuss but don't think it warrants a whole post? Please use this thread to discuss recent purchases or quick questions for the community at large. Shakedowns and lengthy/involved questions likely warrant their own post.",
        "num_comments": 376,
        "comments": [
            "I had my first black bear encounter backpacking this weekend.  My doggie and I had just broken camp, hiking along a ridge with really thick underbrush, when I hard a loud crashing through the underbrush, and realized it was a medium-sized black bear (maybe a yearling?) charging at us through the underbrush; maybe 20 yards away.  As soon as my brain had come to grips with what was happening, I saw another similarly-sized black bear charging at us from another direction.  The 2nd bear got to within about 10ft of us, before they both turned and disappeared back into the underbrush and were gone.  Maybe I yelled at them; maybe my dog barked at them; TBH I'm not sure.\n\nI'm not sure what, if any, lessons to take away from this experience.  I don't carry bear spray, and even if I had, I don't think I could have deployed it effectively.  From the time I saw the 1st bear until the 2nd bear was right by me was maybe 20 seconds (maybe less?  Hard to judge time when my adrenaline's flowing).  I guess the biggest takeaways for me are a reminder to be aware of your surroundings, and the importance of food safety in bear country.  I had camped less than a mile from where this occurred, so it seems likely that the bears could have wandered by my campsite during the night.  I had done a reasonably good bear hang the previous night, but TBH, I don't always.  Maybe it's a sign that I should bite the bullet and buy a bear can.",
            "Anyone have any durability issues with Lineloc V and 1.3mm Z-line?",
            "Anyone still stocking/selling the old nu25?  Looks like Amazon might but not certain.  The new one aggravates me.",
            "The Rab ultrasphere 4.5R LW sleeping pad is listed at 505 grams, but weighs in at 607. Why are they lying? I feel like returning it before even trying it. \n\nAm I being unreasonable?",
            "Really considering buying the Plasma 1000 down vest to add just a bit of warmth for those trips when my alpha piece isn't enough to keep me comfortable in camp. It's pretty cheap with the exchange rate being so good but at the end of the day it's only like 4oz savings over my Anorak so I'm on the fence about it. Anyone currently using one in their kit? If so would love to hear about  how it's going.",
            "Anyone know of a way to buy the adapter piece for the outlet of a quickdraw to thread into a smartwater?\n\nThe only way I could find was getting a whole new filter. I might just buy a new filter anyways, it'll be needed at some point",
            "I know from living in SF that temperatures on the coast can feel a lot different e.g. 55 in SF can feel very cold. How should I think about this when it comes to sleeping bag temp ratings? 50 and low humidity in the mountains or desert feels a lot different than 50 with humidity and wind chill \n\nI’m going on the Lost Coast trail and I feel like my 40 degree apex quilt makes sense here but I don’t want to be cold if it’s windy and foggy at night",
            "Any vendors selling 1/8\"  thinlight pads right now? Looks like gg is out if stock.",
            "Have to confess that sleeping on wooden floors is the one thing I can't seem to get dialed in after all of these years. It feels like a stupid problem, but I'm always flopping like a fish on the first night or two of a trip. It's just too flat compared to the dirt.\n\nDo any of you make gear substitutions specifically for shelters and platforms, or set anything up differently for a more comfortable leg position? I'm using a NeoAir XLite right now, so I'm not sure if a different / thicker inflatable would make much of a difference, or if there are smaller adjustments I haven't thought of yet.",
            "Arc ULs available with a short lead time. You won't regret it!"
        ]
    },
    "European LighterPack, gear suggestions": {
        "title": "European LighterPack, gear suggestions",
        "score": 4,
        "url": "https://www.reddit.com/r/Ultralight/comments/1dr98q1/european_lighterpack_gear_suggestions/",
        "content": "Thank you for taking your time to look at my [LighterPack](https://lighterpack.com/r/hy7r88). I greatly appreciate any advice.\n\nI am from[ Slovenia](https://www.google.com/maps/place/Slovenija/@46.141491,13.6669849,8z/data=!3m1!4b1!4m6!3m5!1s0x476524e75e968361:0xe740451e25e2d465!8m2!3d46.151241!4d14.995463!16zL20vMDZ0OHY?entry=ttu) (Europe), and I am trying to keep my pack budget-friendly (or at least semi-budget-friendly). Currently, I have been in the process of lightening my gear, and I have reached the step where I want to get some advice before I actually purchase all the gear. I am mainly looking for suggestions for better gear that I could buy, primarily for the items marked on LighterPack as not yet bought. It is expensive for me to buy gear outside of Europe (customs), so I would appreciate any suggestions for gear that can be bought here and that is in a similar price range to the options I found. I plan on taking trips in the Alps as well as other parts of the world.\n\nI'm 178 cm tall (5 ft 10 in) and weigh 70 kg (145 pounds).\n\nI also have some questions that I would appreciate if you could answer:\n\n1. Should I change [my sleeping bag](https://www.decathlon.co.uk/p/trekking-sleeping-bag-mt900-0degc-down/_/R-p-309272)? I got it for quite cheap, but I know a quilt would be lighter. Does anyone know of any quilt in the 250 EUR range that has a comfort level of around 0°C and can be bought in Europe? I would greatly appreciate it.\n2. In case I want to layer summer and winter quilts/sleeping bags, would it be better to layer a sleeping bag with a quilt on top, or would it be better to layer two quilts instead? Essentially, is it better to have a sleeping bag or quilt as the inner layer?\n3. Which backpack should I choose? The [Aguila Rs ](https://hyberg.de/collections/aguila-ultralight-backpack/products/aguila-rs-ultralight-backpack)looks really nice but it's a tad expensive. On the other hand, the [Amazon one](https://www.amazon.de/gp/product/B08H7LPNSV/ref=ox_sc_act_image_4?smid=ANDA39PDIBN6P&psc=1) is super cheap and weighs just 390g, but I am worried about comfort and the lack of a removable hip belt (even though I am not sure if I really need it if my pack weight will be a maximum of around 9-9.5 kg (20-21 pounds) with water and food). There is not much info about the amazon pack, but I did manage to find this [review](https://youtu.be/pyYcFluLxj0?si=3roMDCThrJBZyI4x&t=765) (it has english subtitles).\n4. Can you actually cook in a 650ml (22oz) [pot](https://www.amazon.co.uk/Lixada-Titanium-Portable-Foldable-Backpacking/dp/B0788LHCHQ?th=1)? The pot is rather small, and I doubt you can boil more than 500ml of water inside. Do you think it is only okay for boiling water, or could it also be used for cooking pasta or couscous?\n5. For the tent I listed ([Trekkertent Stealth1](https://www.trekkertent.com/home/home/3-stealth.html)), it is required to use 2 poles to set it up. On the lower side of the tent, where the pole has to be set to the minimum length (around 60cm) , does it need to be a collapsible pole, or could I theoretically use a Z-fold pole? Since the pole would be too long, would it be somehow possible to use one third section of the pole and expend it so that it would fit or perhaps do something else or is that impossible?\n6. Lastly, I would like to mention [Decathlon cap](https://www.decathlon.co.uk/p/unisex-trail-running-cap-kiprun-flexible-desert-cap-black/_/R-p-307997?mc=8552545&c=black) that I think deserves more recognition. I believe it is one of the lightest, if not the lightest, caps you can get. It is the Decathlon trail running cap that weighs 20g and is really cheap at just 12 euros. It also comes with a removable rear shade, which is definitely a plus! I have bought it, and so far I am pleased.\n\nThank you for all the help. I really appreciate it.\n\nHave fun hiking :)",
        "num_comments": 11,
        "comments": [
            "In terms of packs I would definitely not go for a cheap Amazon one. The fabric and hardware tend to be low quality and having a pack fail is a miserable experience. Possibly also consider the offers from Liteway which are made of standard/higher end pack materials while still being quite lightweight. Alternatively there are some cheaper packs out of China like the Qidian Pro which are somewhat popular in budget setups. If you think that you would be light enough for a frameless bag then there is also the option to make it yourself and AdventureXpert is based out of Slovenia and offers everything you would need.",
            "I think 650 mL is fine for cooking if you boil the water first and then add the food, so you don't risk it boiling over and spilling everywhere. I can comfortably fit one pack (60 g) of noodles, and two packs is doable if I crush them first. If you want to boil food in it regularly, especially more than one pack of noodles, I would get something bigger.",
            "1. You probably won't find something lighter that is at 200€. If anything it would be imported via China, like one of the Aegismax or Windhard bags. If you have another 100 or 150€ you could look into a Cumulus for example. Would be the biggest saving in terms of weight. \n\n2. I don't think that makes a difference. If it gets cold enough, I prefer a sleeping bag, with an synthetic overquilt. A summer Apex quilt should also be among the cheaper options. \n\n3. Don't do that cheap Amazon one, you'll regret it. The Hyberg is fine, Liteway and some China options are also available. \n\n5. Any pole that has strength should work, it just needs to be able to transfer the load along the long axis, but as a trekking pole it has to do that anyways.",
            "Get the liteway gramless if you can handle the shipping time they have defect ones on sale right now that'll just make your shirt dirty a little bit. 139eur 390g\n\nDefinitely different bag if you wanna cut weight. Check out cumuluses false bottoms (like the aerial 330) they can keep you warm below freezing if you have the right sleeping pad almost half a kilo weight savings.\n\nWhat pack off Amazon are you thinking about? It seems strange that people are writing off a pack from Amazon but are recommending stuff of AliExpress (no hate I think 3F UL stuff is great).\n\nGet sleeping pad from Rab the Ultrasphere 4.5\n\nBut I'm liking the gear list 💪🏻",
            "As for quilts I would save up another 100 EUR and buy Cumulus. It's a long term investment and you should be able to use it for many years. If you've never had a quilt before I would get one and see if it works for you before getting another one to layer. Many people prefer a sleeping bag for winter camping because of drafts, while a quilt works well in warmer temperatures.\n\nI like a 900ml pot but I know people do make even 500ml work. You won't really be cooking in it but boiling water and then adding couscous or pasta.\n\nAs for the tent are you happy to wait a couple of months for it or do you want to use it soon? I've seen on here that those tents have unreliable lead times that are often longer than stated on the website.\n\nAlso, I wouldn't buy a backpack from Amazon. I can recommend Atom Packs instead but they're more expensive. And I personally would like a hip belt to carry 10kg but I'm a woman so YMMV.\n\nAnd one more thing - R value 3.1 isn't enough for -7C so you might want to get a foam pad to layer. Decathlon has them for cheap. I have a women's version of that pad with R value 3.7 and get cold on it around 0C.",
            "You can check out my profile for a bunch of stuff from decathlon or AliExpress as those were my only option to get ultralight on a student's budget in germany. \n\nI don't have enough experience with the Aegismax wind hart pro quilt to fully recommend it but it has performed really well so far. \n\nFor the poles I would recommend getting those from decathlon because they actually carry affordable replacement parts for them. I bent the lower section while almost sliding down a snowfield and it only cost 5€ to replace.",
            "Quilt: Aegismax Windhard Twilight. On AliExpress \n\nBudget friendly. Down. And budget friendly specially if you get It on sale. \n\nI have one and im very satisfied camping with It in the Pyrenees",
            "1. This are great answers, thank you :). You are right, i meant to write that the budget is 250 not 200, but yeah even this might not be enough. But I like the Aegismax Twilight quilt you recomended, I think it suits my needs relly well! Comlus is also a great choice, I will se if i can streatch my budget. \n\n2. I was actually looking into making apex summer quilt since it seams quite easy to make :)\n\n3. Thank you I think I will go with Hyberg. \n\n4. Sorry I think my question was confusing, I meant to write that since on the short end of the tent you would need a pole of around 60cm of lenght, could you somehow use Z-fold pole for that? Like is it possible to somehow use one third of the section of the pole and extend it so that it fits? Or is there perhaps another way. I can't really imagine how you would do this and I could't find any information online. \n\n  \nThank you a lot for advice, I appreaciate it :)",
            "Thanks for answering! Comulus seem like a great option and I might buy from them in the future. I will also get a summer quilt first as you suggested, before getting a winter one.\n\nSounds great, perhaps I will use 650ml for shorter trips.\n\nI also heard that the lead time is quite long haha, I think I would wait for it because I like it, even tho I could certainly use it before.\n\nI really like the Atom Pacs design and I will definitly consider it too, thank you!\n\nYeah I think you must be right, I based this number on one time where I slept in -7/8 with the same sleeping bag and similar sleeping pad ([Decathlon insulated, R 3,3](https://www.decathlon.co.uk/p/inflatable-trekking-mattress-mt500-air-insulating-l-180-x-52-cm-1-person/_/R-p-311475?mc=8853280)), but to be fair I was a bit cold that night so i will probably get a foam pad as you recomended :)\n\nThank you again :)",
            "Thank you for the advice! I checked out Litway and their packs look nice, but I am a bit hesitant because of the customs and 20 EUR shipping since it’s based in Ukraine. I was also looking at Quidian Pro before, but I don't like that it is only made to be used with a sleeping pad as back support. Still, these are great suggestions, thank you :).\n\nI was actually planning on making a summer quilt based on the [eLite quilt](https://www.gramxpert.eu/product/elite-quilt/) from AdventureXpert, but I don't think my sewing skills would be good enough to make a backpack :)"
        ]
    },
    "Ultralight vs Lightweight Subs": {
        "title": "Ultralight vs Lightweight Subs",
        "score": 63,
        "url": "https://www.reddit.com/r/Ultralight/comments/1dqq8zn/ultralight_vs_lightweight_subs/",
        "content": "It’s awesome to see this community thriving and increasing curiosity with the Ultralight lifestyle. I see a lot of fair questions about gear that come from non-UL folks, folks aspiring to UL, or simply lightweight backpackers looking for recs. It seems this sub has become something of a big tent forum, perhaps to the chagrin of some. \n\nOften, when an OP self-identifies a base weight in the teens without much desire to shakedown, folks are quick to recommend the r/lightweight sub. As a member of both subs, it’s clear there is a exponentially larger and more active community in UL. In fact, the community is currently 10x: nearly 700k in UL vs just over 7k in lightweight. r/lightweight sees relatively little engagement on most posts, so it’s just not nearly as robust of a resource. \n\nI’d wager this is inversely proportional to the *actual* ratio of lightweight to ultralight hikers on the trail, and this sub actually has a huge contingent of non-UL members.\n\n1) In your view, what the allure of this sub? what makes r/ultralight so much more robust than many other backpacking-focused subs?\n\n2) Is lightweight just a waypoint on the way to ultralight OR is lightweight still the end goal for most folks in the backcountry? \n\nEdit: correction r/ultralight has 100x the followers as r/lightweight",
        "num_comments": 135,
        "comments": [
            "I mean, the real ultralight sub is r/ultralight_jerk",
            "I'll be honest: I have never backpacked in my life. Where I live it's just not as easy/alluring as in countries like the US. However, this subreddit has been invaluable in providing information for improving my day hikes and, especially, for shaving a lot of weight from my backpack when traveling. This is probably the first comment I've made on this sub, because I actually don't have anything to contribute. A lot of people here are already extremely knowledgeable.",
            "The allure of this sub is that r/lightweight is dead",
            "Moderators here are the biggest allure.\n\nDon't look at my lighterpack because you might find a chair.",
            "1. The people with the most backpacking knowledge are here. Those who are inclined to go, \"Meh, 15 pounds is fine,\" will tend not to develop the encyclopedic knowledge of backpacking gear, materials, techniques, philosophy, etc. that some users here have. This sub will always draw the most questions because it's capable of giving the best answers. It's also notable that knowledgeable people continue to post here because it's aggressively and appropriately moderated.\n\n2. I think lightweight is neither an endpoint nor a waypoint. It's more a solution to a problem (pack hurts) for people who have no interest in getting really nerdy about gear. Most people will do a few pack-lightening moves, go, \"Okay, hey, the pack's pretty light for my 10-mile days, and I'm having fun,\" and leave it at that. I think that's 100% fine, and I'm totally happy to answer questions and help people out who aren't as fanatical as I am.",
            "700k is 100x not 10x 7k. That sub doesn't have real discussion happening. That's why everyone is here.",
            "Honestly people seem to forget the lightweight sub was started from someone who got roasted on a shakedown and said fuck you guys I’ll make my own with blackjack and hookers.\n\nThis was a few years ago now iirc, I can’t remember all the deep lore of the sub.",
            "I came here after back surgery left me unable to comfortably carry more than 35 pounds. Thanks to this sub I got my gear below that weight.\nThanks all!",
            "There are more experienced people here, so it is a better place to learn. That is true whether you are a newbie or an old-timer. You don't have to apply all of the advice if you don't want to.\n\nThere are several manufacturers present here, at least a couple of YouTube reviewers, and a large number of experienced people. There are even some tech-aware hunters who carry light on their way in, and heavy on the way out.",
            "Best not gear post I’ve seen on this sub. I’m lightweight, no doubt, and don’t truly desire to be UL. I don’t feasibly believe I’ll go below a 10lb base weight due to the nature of my trips and my intentions during these trips. The lighterpack lists I have posted get ridiculed to the point of borderline gatekeeping. I’m sure it’s a minority of the UL community, but these comments come across as if the users don’t want me in this sub unless I’m already UL. Some of the comments I communicate with are met with responses that insinuate I should pack and hike exactly like them or I will never enjoy myself. As you mentioned, the insane difference in user base between UL and LW subs will keep me making fake lighterpack lists, just to get decent responses and not deal with filtering thru all the irrelevant comments about how I should post in LW because I’m not even close to UL."
        ]
    },
    "Have you cut your titanium windshields, need tips": {
        "title": "Have you cut your titanium windshields, need tips",
        "score": 2,
        "url": "https://www.reddit.com/r/Ultralight/comments/1dr942e/have_you_cut_your_titanium_windshields_need_tips/",
        "content": "Before cutting my Toaks windshield, does it rip easily after cutting? I have low Evernew kettles., and I'm thinking is it better to cut windshield so low that it goes ynder the handles at whole lenght. \n\nOr better to make just opening for the handles. I'm sure that the later one will save a little fuel compared to the first one, but does it rip? Goes with the fancy feast stove.",
        "num_comments": 6,
        "comments": [
            "I’ve not had issues with the sheet tearing. I used scissors to cut the windscreen. I’m sure it improves efficiency a little in Highwinds but creating some wind blocks in general is always going to be useful.",
            "Ok. Maybe I'll punch a hole in the corners to be sure.",
            "A new hole puncher (paper) will work great for a while as the tolerances are pretty tight.  It will degrade after multiple punches, but they are cheap.  My 2 cents.",
            "Yep. I tried alufoil at first also. Had to replace pretty often because it melted. Thats why I ordered the titanium one.",
            "It was cut to make its current shape. It'll be fine. Cut carefully and be careful of sharp edges. \n\nIt's titanium. \n\nCompletely separate from its strength, you might want to make a mock-up with a few layers of aluminum foil and try it for a few cooks. Mostly just because of the cost. Why cut your real shield on a way that you end up not liking? Do a dry run and make sure it's going to fit well and be convenient to use that way.",
            "I made a mockup with aluminum cans before making my [4g titanium windscreen](https://www.reddit.com/r/Ultralight/s/Dxeg3T8IHd). The aluminum melted almost instantly when I tested it out…"
        ]
    },
    "Difference Between Camping Mats": {
        "title": "Difference Between Camping Mats",
        "score": 0,
        "url": "https://www.reddit.com/r/Ultralight/comments/1drbrhq/difference_between_camping_mats/",
        "content": "There are different camping mats out there - some have dimples and others do not. Is that just aesthetic design or do the dimples serve a purpose?\n\nAre the mats that come with a pump sack not actually self inflating mats because you have to inflate them yourself?\n\nMy main question: what type of design should I look for in a sleeping mat that won't deflate on me through the night? I've heard of so many people having this issue. \n\nWhat would you suggest that is light but also warm for colder weather down to about -5C?\n\nTossing up between the Sea to Summit Ether Light XT Extreme and the THERMAREST NEOAIR XTHERM NXT but open to other recommendations, especially cheaper options. ",
        "num_comments": 11,
        "comments": [
            "If it's deflating *on* you you're using it wrong.  At worst it should deflate *under* you.",
            "To add, how do you store them  longer term - can they be stored rolled up inside their stuff sack, unlike a sleeping bag?",
            "Get an infaltable i.e. a mat you inflate yourself. S2S, Thermarest or Nemo Tensor. I have S2S ultralight and find it very comfortable. It's a personal preference though. I've seen on here that some people don't find horizontal baffles comfortable, for instance. Also, some buy a wider version so think about that as well. None of those mats should deflate under you unless you get a puncture.",
            "I don't store my pads rolled up.  I stand them up slightly inflated next to my sleeping bag that is hanging in the closet.",
            "If you’re using your warm breath to inflate, as the night gets colder (pv = nrt), you will loose some pressure in the pad.  This is mitigated by some kind of inflation device. I toss and turn a lot, so I usually don’t like a fully inflated pad. \n\nThe dimples or chambers are there to keep you or the pad in place while keeping that section in a type of shaped section\n\nR-value is important based on the trip. Maybe I’m a warm sleeper but my older  Xtherm feels hot to me for 3-season use. So badly that it makes it hard to sleep. It’s awesome on snow though.",
            "So theres a few things to cover here:\n\n1. Design of pads - generally a pad with more baffles/pockets will be more comfortable for side and front sleepers. Flat pads are really only good for sleeping on your back, unless they are a really decent thickness.\n\n2. Pads that inflate with a pumpsack are not self inflating, but it is worth using a pump sack over blowing it up with your mouth or an electric pump for a couple of reasons - if your mat is deflating through the night and it isnt a slow leak puncture, it's likely because when you inflated it by mouth or pump you were effectively filling it with warm damp air. When this cools later on the pressure will drop. A pump sack avoids this by filling the mat with air at the same temperature as the air around it. \n\n3. Self inflating mats are usually a mat with a layer of open cell foam inside with sucks in air when the valve is opened, they're heavier than a regular inflatable mat and just not worth it.\n\nEither of the mats you've mentioned should be good but i'd lean toward the sea to summit if you're a side sleeper, if you want a cheaper option I've had good experiences with Robens mats.",
            "Dimpled based mats are reported to be more comfortable. \n\nNemo Tensor, Big Agnes Rapide or Boundary Deluxe, Sea to Summit Etherlight XT etc. \n\nThe 2022 and earlier Nemo Tensor pads had major problems with leaks. Avoid. The newer Tensor All Season is supposed to be much more reliable. \n\nI personally am a fan of Exped pads. Way more comfortable than Thermarest, no loud potato chip sound like with Thermarest and Nemo and very reliable. YMMV.",
            "One doesn't have to inflate themselves because one can bring battery-powered inflating air pumps with them.\n\nInflatable pads develop leaks in many ways.  For example: \n\n* Poke a hole from a sharp object such as a nose ring, earring, metal zipper pull, pine cone, thorn, sharp rock, ....\n\n* Thermal welds fail because too much force on them because of localized body weight, air pressure, heat, or design flaw.\n\n* Wear-and-tear from friction, sand, valve-tear, oxidation, brittleness. folding, rolling, ....\n\nThe dimples have a purpose:  They are where the top and bottom of the pad are connected together by a piece of material thermally welded to top and bottom.  If the top and bottom of the pad was not connected together in many places throughout their areas, then one would have a simple balloon and not an air mattress.",
            "The dimples are usually for weight savings if you are referring to solid closed cell foam pads. If you are talking about inflatable, then those are called baffles or air chambers. \n\nSelf inflating pads really aren’t a thing anymore. \n\nThere is no design to look for to avoid leaks, only brands. Some have had luck with Klymit Static V, but not me. \n\nMy Neoair has been going strong for 4 years.",
            "Yes"
        ]
    }
}