{
    "[Announcement] Happy pride month! (also new user flairs)": {
        "title": "[Announcement] Happy pride month! (also new user flairs)",
        "score": 157,
        "url": "https://i.redd.it/2cs5dibchx3d1.png",
        "content": "",
        "num_comments": 62,
        "comments": [
            "The cake incident shall not be discussed (I'm under NDA)",
            "Please tell me the cake in question is an actual cake and not his ass.",
            "Please tell me the cake in question is his ass and not an actual cake.",
            "Please tell me the cake in his ass is an actual cake and not a question.",
            "Oh yes, glamorous new flairs!",
            "Homosexual? Nah, I'm a homosansual.",
            "Guys I want his cake",
            "One glaringly important issue: Whatever happened to posting pictures in the comments?",
            "ive had this flair for a long time",
            "Guys, the cake incident was just him trying to kill another human to put their soul into a cake. Stay calm."
        ]
    },
    "[Underground Assembly] If you could insert one swear word of your choice into the story, which and where would put it?": {
        "title": "[Underground Assembly] If you could insert one swear word of your choice into the story, which and where would put it?",
        "score": 226,
        "url": "https://www.reddit.com/r/Undertale/comments/1dnckin/underground_assembly_if_you_could_insert_one/",
        "content": "[Underground Assembly](https://preview.redd.it/ghtsfac6mi8d1.png?width=5120&format=png&auto=webp&s=829170b7d43cae1b28014b3c198ca4754a49343e)\n\n*“To answer the toughest questions as old as the game’s release, subreddit’s denizens gather to debate, vote and hopefully not murder each other in the process.”*\n\n***Previous entry***\n\n* [Favourite shopkeeper poll](https://new.reddit.com/r/Undertale/comments/1djur8d/underground_assembly_favourite_shopkeeper_poll/) | Winner: ***Tem!*** *(29 votes)*\n\n**Today's topic; If you could insert one swear word of your choice into the story, which and where would put it?**\n\n* What is says on the tin. Yea, this series is spirilling quickly. It can be either in middle of a quote or characters reaction to something. Be ✨ creative ✨\n* Reminder that slurs are not swear words and thus don't count. And will get you banned, since... you know. Rules\n\n**General series info**\n\n* Succession of poll and discussion posts for and about the community. Bringing forth various topics concerning the fandom at large or the game itself to be discussed, pondered and joked about\n* Got a topic suggestion? Pass it to us [here!](https://forms.gle/4DhG5NYFttS3arNM6)",
        "num_comments": 200,
        "comments": [
            "I could definitely see Undyne use expletives when she’s fired up about something so I’d give it to her. Maybe “fuck it. I don't care if you're my guest anymore” or “You're gonna have to try a little fucking harder than THAT”",
            "*Your ass is grass!\n\n(Papyrus begins to wonder if he's ever seen grass before).",
            "*You said fuck, Mettaton screamed at you for swearing in his all ages program.\n\n(MTT EX fight.)",
            "\"Howdy! I'm FLOWEY! FLOWEY the FUCKING FLOWER!\"",
            "As hillarious it would be for Papyrus to say fuck, I think I would want Flowey to say it before the Asriel fight.",
            "\"If you keep going the way you are now, you're gonna have a shit time.\"\n\nOr just add a line in the MTT cooking show segment about Frisk being a “fucking idiot” or an “incorrigible dumbass”",
            "The F bomb, when you don't block Undyne's spears, pissing her off ![img](emote|t5_2xdht|32944)",
            "\"Who the hell is Sans?\"",
            "\"See that heart? No shit!\"\nSomeone had to do this",
            "Did you really think it was over?\n\nHeh, we haven't even used the one PG-13 fuck yet!"
        ]
    },
    "Why didn't Sans just do this": {
        "title": "Why didn't Sans just do this",
        "score": 2149,
        "url": "https://i.redd.it/tn2fpx2asd9d1.png",
        "content": "",
        "num_comments": 100,
        "comments": [
            "He didn’t think you would be able to move the box",
            "Go down then left instead of left then down",
            "I like how its a *blue* bone instead of a normal bone. Like sans is taunting you by figuratively saying \"haha you cant move through this anyway too bad\"",
            "Because sans is too tired to keep attacking. Remember how he just threw you against walls like over 30 times?",
            "I don't remember there any monsters that could keep an attack manifested while they are sleeping.",
            "why didnt sans just fill the box with bones and kill you immediately every start",
            "I personally feel like he just gave up. He was too tired. He knew the determination would let Frisk be able to move the box and that he was done for. But at least he got to go in good old Sans fashion, trolling you one more time before he let you have the kill. But that's just how I see it.",
            "Why does Sans just used the Dunked On move in the beginning of the foght? Is he stupid?",
            "He is tired and can’t use attacks or teleport you away, duh\n\nThat’s why he fell asleep",
            "You ask the same question every really."
        ]
    },
    "Is this thing canonically named \"Gaster Blaster\"?": {
        "title": "Is this thing canonically named \"Gaster Blaster\"?",
        "score": 173,
        "url": "https://i.redd.it/o64x4zuilh9d1.png",
        "content": "",
        "num_comments": 32,
        "comments": [
            "It's named like that in the game files, but we don't have anything in game that tells us that",
            "This attack has that name in the game files so I think  this is canon.![img](emote|t5_2xdht|32949)",
            "That is what they are referred to as in the files",
            "That's what its filename calls it, and the first part is omitted in official, first-party merch, so until disproven, I'm gonna say yes.",
            "Idk but I always thought this dragon thing looked cool with my man sans the bone",
            "What happen to my fricking pixels?!",
            "It is in the files",
            "Sans names each and every one of them, this one is Bob for example",
            "not canonically but its called like that in game files",
            "In the files, it is."
        ]
    },
    "Reasons Green sans is better than original sans": {
        "title": "Reasons Green sans is better than original sans",
        "score": 127,
        "url": "https://i.redd.it/ifqj9syw9g9d1.png",
        "content": "",
        "num_comments": 21,
        "comments": [
            "No eyebrows ❌      Has eyebrows ✅",
            "Wait Green Sans has a kid?",
            "But does he have such a wonderful hairstyle as Sans?",
            "Not gonna lie, characters that can turn into Michael Jackson absolutely rock",
            "Do it, \nTurn into Michael Jackson",
            "He can turn into Michael Jackson?!",
            "✔️ I can consume him for healing",
            "What is green sans!!!\n I'm not up to date on the green sans lore 😭😭😭",
            "who tf put sans undertale on my pip boy",
            "Those are probably just fuzzy caterpillars sticked on his head"
        ]
    }
}