{
    "he lost 10 years of life with that scare": {
        "title": "he lost 10 years of life with that scare",
        "score": 27213,
        "url": "https://v.redd.it/bll4fm82gf9d1",
        "content": "",
        "num_comments": 458,
        "comments": [
            "The crocodile was the only one who never lost concentration.",
            "He checks to see if he has his arm 🤣🤣🤣",
            "I think it's part of the act, I've seen 3 videos of very different places where this happens.",
            "Pull out game still good.",
            "Well the whole \"how can they bite shit underwater and not drown\" thing  is now answered for me.",
            "Relax, folks. It's all part of the show.",
            "The croc: \"ya good bro? Im just waiting here man\"",
            "There was a photo going around for years of a croc at one of these shows with just a forearm in his mouth, fist still clenched. I don’t like watching these videos now without reading the comments first.",
            "Why’s bro risking his hand for the 3 people watching lol",
            " Well, at least he has a good story to tell now!"
        ]
    },
    "Biker loses body part": {
        "title": "Biker loses body part",
        "score": 6330,
        "url": "https://v.redd.it/r7v9hp95ig9d1",
        "content": "",
        "num_comments": 224,
        "comments": [
            "Good choice for a counter balance on that quad though. Pretty easy to wheelie.",
            "Alright, I was expecting the body part to be the butt",
            "These people are very different than me.",
            "And here I was wondering why there isn't a NSFW tag if someone loses a body part... Well played.",
            "Oh .... oh thank God. I was beginning to imagine the worse scenarios as the video kept going. Yet, I kept watching. Curiosity is a bitch!\n\nSometimes it's nice to be unexpectedly surprised!!!",
            "The fat girl dream to be a meat crayon",
            "To be fair it’s Florida. It’s not THAT unexpected.",
            "Well.. that counts as a body part... I suppose lol",
            "Was expecting a meat crayon. Did not see that coming.",
            "he put this woman in the back seat on purpose. So that the quad bike would run on its rear wheels)"
        ]
    },
    "Father finding son": {
        "title": "Father finding son",
        "score": 1555,
        "url": "https://v.redd.it/p6215u3vyg9d1",
        "content": "",
        "num_comments": 22,
        "comments": [
            "From a comedy series, Hardy Bucks.",
            "\"Turns out, no relation at all, and I just head butted him\" 😭😭",
            "The most Irish story EVER",
            "I love this video. Always gotta updoot.  :):)",
            "Life can be so easy",
            "Ah Buzz! - He wouldn't ate a snack box!",
            "i found it challenging to understand his accent",
            "Famili guy portrayed Ireland bery well. Peter went over there 😂😂",
            "Best re-scroll from hitting the home tab on accident",
            "I wish this is true but it can't be"
        ]
    },
    "So now lets wait ": {
        "title": "So now lets wait ",
        "score": 8130,
        "url": "https://v.redd.it/93r6x35uhe9d1",
        "content": "",
        "num_comments": 158,
        "comments": [
            "I feel like this is one of those things you only need to learn once and for some reason it always sticks with you from there on.",
            "If you're wondering why that happened, that is because that plastic cup is made of the same plastic used in shrinky dinks.",
            "Who else think tech decks are still kinda cool",
            "I dont even know why i cant stop laughing",
            "why is this in unexpected?",
            "Is that a Tom Waits song?",
            "They put hot liquid in a shitty plastic cup and the plastic reacted poorly. Where's the unexpected part?",
            "Who else got a costco magazine in the mail today?",
            "this is how condoms are made",
            "It's the forbidden invisibility potion!"
        ]
    },
    "when a cat has better game than you": {
        "title": "when a cat has better game than you",
        "score": 3461,
        "url": "https://v.redd.it/jxmk6iz0le9d1",
        "content": "",
        "num_comments": 32,
        "comments": [
            "its easier when you're cute as heck tho",
            "I need to learn how to flirt from this cat.",
            "That’s how it’s done, homies",
            "I was just licking my ass and she would still rather kiss me than you bro.",
            "I really want a little cat, but my boyfriend won't let me. What's the deal with that?",
            "I can't even pull and now I got this cat as competition?! 😭",
            " Well, I guess I need to up my flirting skills if I'm getting outplayed by a cat!",
            "Even as a male dude, I would kiss(makeout) witth this cat",
            "btw that cat has probably just eaten its own ass.",
            " Well, I guess I should start taking flirting tips from the feline world!"
        ]
    }
}