{
    "I'm gonna cut this guy off": {
        "title": "I'm gonna cut this guy off",
        "score": 14993,
        "url": "https://v.redd.it/pvtv9ykd528d1",
        "content": "",
        "num_comments": 961,
        "comments": [
            "OP sent the following text as an explanation on why this is unexpected:\n\n---\n\n>!this is a normal day but dude cut the car but didnt expected it was a police car!<\n\n---\n\nIs this an unexpected post with a fitting description? Then upvote this comment, otherwise downvote it.",
            "r/convenientcop",
            "Interestingly most drivers in Germany would just make some space, so you can change the lane. At first I was confused, why the car on the left just didn’t give any space and even pushed to close the space in front, until I read the comments.",
            "I am not American. Here this would be seen as a safe, sensible lane change. If anything the police car would be judged as a bit of a dick for making it so hard for the car to change lanes.",
            "[removed]",
            "He merges into the middle lane forcing the car behind to hit his brakes.  Then he merged into the lane already occupied by the officer.  You can't expect to put your blinker on and immediately be let in.",
            "why is this illegal ?\nhe uses his blinkers and i dont know how much space there is in front of him but it would be legal in my country, seems like a salty police man.\n\nif anything the police van should be fined for not letting him in",
            "…. am i the weird one thinking the cop was in the right?\n\nWhite car should only merge when its safe and not force his way in.",
            "Kinda funny that people are calling that move perfectly reasonable and in their country completely legal. Might set stuff in my country in perspective. That move would be quite illegal in Germany, people here also think indicating grants them the right of way. Thats not the case, we ve got the rule that the person who's already in the lane has the right of way (§ 7 Abs. 5 StVO). Exceptions being of course stuff like zipper merging and courtesy.\n\nFunny to see the differences.",
            "I think the dude cut way too close for comfort that's why he is being pulled. I can't tell how much space was out front either."
        ]
    },
    "A girl calls her pet for a sugarcane snack": {
        "title": "A girl calls her pet for a sugarcane snack",
        "score": 30859,
        "url": "https://v.redd.it/krngu4hxc18d1",
        "content": "",
        "num_comments": 750,
        "comments": [
            "OP sent the following text as an explanation on why this is unexpected:\n\n---\n\n>!Her pet is not one you'd expect...!<\n\n---\n\nIs this an unexpected post with a fitting description? Then upvote this comment, otherwise downvote it.",
            "That thing had the most gentle looking face",
            "That was freaking awesome. Now that is some major trust in a large animal. Wow.",
            "At this point I’m pretty sure if humans were to live with dinosaurs in past they would make them their pets",
            "We raised a newborn bull calf when I was a kid. He acted like a big clumsy dog. He'd get excited to see you and start doing zoomies. It was as terrifying as it was cute because he weighed almost a ton. He used to go for runs around the farm with my mother and the farm dogs.",
            "This is giving me \"Okja\" movie vibe",
            "What’s up with the rope through the nose?",
            "Can she actually chew that up enough to swallow it, or is it just the kind of thing you gnaw on to get the sweetness and eventually spit it out?",
            "Sick septum piercing my dude",
            "This some cute anime sh*t"
        ]
    },
    "Getting even": {
        "title": "Getting even",
        "score": 3615,
        "url": "https://v.redd.it/120qrenm718d1",
        "content": "",
        "num_comments": 65,
        "comments": [
            "OP sent the following text as an explanation on why this is unexpected:\n\n---\n\n>!You think a huge fight is about to break out for sleeping with each other’s SOs, but then they end up hugging it out!<\n\n---\n\nIs this an unexpected post with a fitting description? Then upvote this comment, otherwise downvote it.",
            "bro the situation went from bad to worst to the best",
            "Her face was the best part. When she realized she was nothing more than tool to get even. Ahh .... too funny.\n\nOf course it's all staged .... right? At least most of these situations are.",
            "Brothers will be brothers",
            "Well 1-1 its a draw",
            "I guess quality television is still out there.",
            "Now they both gonna sleep with each other",
            "Bros before…wives and girlfriends.",
            "The woman looks a bit like Tom Holland",
            "Bit confused why they're hugging it out at the end. Even if he did get revenge it doesn't change the fact that his wife and brother betrayed him..."
        ]
    },
    "I can do this all day": {
        "title": "I can do this all day",
        "score": 2168,
        "url": "https://v.redd.it/4b495kcbs18d1",
        "content": "",
        "num_comments": 13,
        "comments": [
            "OP sent the following text as an explanation on why this is unexpected:\n\n---\n\n>!The monkey imitate bro when he's flip!<\n\n---\n\nIs this an unexpected post with a fitting description? Then upvote this comment, otherwise downvote it.",
            "... Monkey see monkey do\n\nI'll see myself out",
            "\"Oooo la la, look at me I'm a human\"",
            "“Try it again monkey”  \n- Monkey",
            "He is just monkeying around",
            "Yeah ok that was pretty great :)",
            "very good Monkey! 😂",
            "I'm fitter than you.",
            "Couldn't even copy it right. /s",
            "I'll do myself out"
        ]
    },
    "A secret revelation": {
        "title": "A secret revelation",
        "score": 1164,
        "url": "https://v.redd.it/5r94gdhs828d1",
        "content": "",
        "num_comments": 25,
        "comments": [
            "OP sent the following text as an explanation on why this is unexpected:\n\n---\n\n>!The teacher erased a picture of a cat from the board and received a surprise!<\n\n---\n\nIs this an unexpected post with a fitting description? Then upvote this comment, otherwise downvote it.",
            "Older then the oldernet 😊",
            "It's Dylan...its always Dylan drawing dics.",
            "Unsolicited dick pic",
            "Great use of both dry erase and permanent marker. She had no choice but to leave it there for everyone’s enjoyment.",
            "Uncropped version: https://www.youtube.com/watch?v=bvjToFFuGa8",
            "That's funny.",
            "A golden oldie 10/10",
            "Someone just watched fist fight",
            "Can I show this next week?"
        ]
    }
}