{
    "Marc Whitten (CPTO) quits Unity": {
        "title": "Marc Whitten (CPTO) quits Unity",
        "score": 255,
        "url": "https://mobilegamer.biz/marc-whitten-quits-unity/",
        "content": "",
        "num_comments": 88,
        "comments": [
            "He was a prominent advocate and designer of the installation fees. Following that debacle, it became evident that Unity required a change in leadership.",
            "#The best part of this article \n\n>One major partner apparently said Fuck you, were not paying to Riccitiello in a meeting over the fee.",
            "First big thing incoming CEO Bromberg does is show the door to the poor-track-record-holding product & technology head, very positive news!",
            "Is it a good thing for unity ?",
            "Pls I want my game engine to heal!!",
            "A big step in the right direction. Marc damages every product where he is in a leadership position. He is Unity's biggest problem.",
            "Quits? More like house cleaning.",
            "Any news on who's replacing Marc? CTO is such a key position.",
            "and now they are shutting down the forums. wtf?  seriously?",
            "Unity will probably strategize for mobile as first class citizen unfortunately. Other areas are much harder to compete against unreal or specific engine."
        ]
    },
    "Major Nelson is joining Unity": {
        "title": "Major Nelson is joining Unity",
        "score": 97,
        "url": "https://www.theverge.com/2024/6/17/24180241/major-nelson-larry-hryb-unity-community-xbox",
        "content": "",
        "num_comments": 58,
        "comments": [
            "This could be interesting.  Clearly, Unity still has an image problem.  My biggest concern will be if this is just to make things look better, or if it will actually result in positive change.",
            "Yeah we all like Major Nelson but its never been super clear what he contributes besides being a hype man. I will say he's had good commentary on the gaming industry since leaving microsoft so it seems like hes got the right ideas but like I said idk if theyre paying him to take his advice on the direction of the engine.",
            "I used to listen to Major Nelson way back in the mid 2000s and enjoyed his Xbox coverage.  I can see him being a good fit for Unity, provided Unity really steps up in a major way.  I say this as the value of their engine right now as compared to the free open source options is more or less the same for flat screen games and even XR soon with Meta currently working on extending their XR SDK to Godot.  If Unity seriously delivers features and functions that speed up and make my development easier and justifies their fees, then I am ready to listen to Major Nelson again, but if Unity is going to continue to milk their engine while not being better than free options then I am moving to Godot as soon as the XR SDKs are available.  It is in your court Unity and slick marketing is not what will keep me in your engine.  I wish Larry all the best at Unity.",
            "It seems that this role might be similar to the one that he took with Midwest Games as the \"Advisor For Communications\".  I think they are doing better partially because of him, but I don't follow the company that well.  One thing that I do know is that he seemed to always be someone who was down to earth with gamers in general and those that met with him personally had good things to say.  So, fingers crossed.",
            "So are we going to need to talk to Major Nelson now when Unity once again sends us an email saying that we need to upgrade our license for nebulous reasons and then they ghost us when asking for clarification?",
            "From a recent game jam I was a part of, a HUGE percentage of games are now being made in Godot. Not sure how that impacts Unity necessarily, but the movement away from Unity is actually very palpable.",
            "Larry is a PR guy. they're obviously doing it for image reasons. having said that, i really like Larry going back to the xbox 360 launch days.",
            "Unity dosnt have an image problem, unity has a structural problem",
            "What you saw of me at Xbox was a lot of the external facing work - I did a ton of stuff that no one saw in terms of connecting community back to the product team. I plan on doing that on a grander scale with Unity.",
            "100% in agreement.  Deeds, not words."
        ]
    },
    "Grab and Slice": {
        "title": "Grab and Slice",
        "score": 41,
        "url": "https://v.redd.it/2hgwwiw5lh9d1",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Damn that's awesome. How did you do that, I wouldn't even know where to start with achieving this",
            "But can you also slice animated objects? still looks fantastic. Is there any tutorial on how to do that?",
            "Would be awesome if you could slice another character so dynamically",
            "I think Disney lawyers are going to knock on your door if you release anything with a lightsaber.",
            "this is thicc dude. good job",
            "Other comment gives a good explanation on how to but this guy uses a library called ezy slice to achieve it",
            "yep I use ezy slice library and just calculate the average cut plane based on the swing animation",
            "yep skinned meshes are next, I will have to modify the mesh slicing to work with them",
            "Just googled it and seems like you are fine if you call it something else and make it sound different.",
            "Did you write it all yourself or did you use any external package?"
        ]
    },
    "It's like cutting butter with a hot knife": {
        "title": "It's like cutting butter with a hot knife",
        "score": 540,
        "url": "https://v.redd.it/hhs06dr7dd9d1",
        "content": "",
        "num_comments": 36,
        "comments": [
            "Niiice\n\nQuick question how do you cut objects like that? At runtime?",
            "So kiss me if I'm wrong, but it looks like you add verts to a mesh when the saber strikes - my guess is using a distance-limited raycast and mesh intersections - split the mesh along those verts, and fill the gaps with a single face with a \"cut\" shader?",
            "Thanks a lot! I bought 3 assets for slicing and here is a free one! Wow\n\nThanks for your work!",
            "Damn, that's impressive. How did you manage that at runtime?",
            "That is cool! I think if you gave the player the ability to choose the angle of the cut with some sort of bullet time effect you would have the basis for a very cool combat system",
            "Jedi Academy fan too, ay?",
            "I think mix and jam used the same lib",
            "Very nice! Good Job! ezy-slice looks cool!",
            "Will you make it possible for player to control the slash direction or this going to be only for the effects? I had problem with how to show player what place is going to be cut. My current method make people think i throwing chess board instead.",
            "This would be sick in VR"
        ]
    },
    "As a developer, when my disabled daughter told me she loved farm games with horses but found them too hard due to their objectives, I decided to create a game just for her. A game with no mandatory objectives, just to let her live and enjoy the game as she feels. ": {
        "title": "As a developer, when my disabled daughter told me she loved farm games with horses but found them too hard due to their objectives, I decided to create a game just for her. A game with no mandatory objectives, just to let her live and enjoy the game as she feels. ",
        "score": 580,
        "url": "https://www.reddit.com/gallery/1dqqjb7",
        "content": "",
        "num_comments": 86,
        "comments": [
            "it's a really lovely idea \n\ndid you come up with a name together for the game?",
            "Thats what its all about. Youre a good dad",
            "Looks really lovely! theres no mandatory objectives but can you still do stuff like grow that garden and things? And it looks like that truck is actually driving can you get hit by cars lol",
            "Needs a nice blue sky and sun! \n\nWell done :)",
            "That is absolutely adorable! 12/10 idea and execution. You're a great parent.\n\nYou mentioned no *mandatory* objectives. What optional mini-games / side content are you including?",
            "Thats beautiful and youre amazing for doing this! Hope she enjoys it!",
            "Hell yea, that's awesome. Keep up the good work",
            "Stories like this restore my faith in the power of technology.",
            "Nice use for the Synty assets. Love it \\^\\^",
            "When can I get this game?! I also have a relative that would love it "
        ]
    }
}