{
    "JK Rowling says David Tennant is part of ‘gender Taliban’ after trans rights support": {
        "title": "JK Rowling says David Tennant is part of ‘gender Taliban’ after trans rights support",
        "score": 2338,
        "url": "https://www.independent.co.uk/arts-entertainment/tv/news/jk-rowling-david-tennant-trans-kemi-badenoch-b2570909.html",
        "content": "",
        "num_comments": 1280,
        "comments": [
            "I'm sorry the term \"gender Taliban\" is so funny I cannot believe a person with a functional mind would use it seriously. \n\nBut being serious for a moment, any comparison between trans rights and the Taliban - a group that shoots women for wanting education - is extremely crass. Imagine being someone who has worked in Afghanistan, being trans or knowing trans people, and hearing this woman think you should be compared to the Taliban. It's a horrifyingly extreme position to take and she's lost the plot to the point of genuine derangement. She's tipping hard into Graham Linehan territory over this and it's just pathetic.",
            "JK Rowling talks more about trans issues than trans people do.",
            "She really has made this her entire personality. It’s a mental illness.",
            "Keir Starmer thinks this woman is worth attempting to engage with in good faith but wants David Tennant to be more \"respectful\"",
            "The trans population of the UK is only around 0.5%  I cannot believe so much hated and political football is being used to target such a tiny amount of people",
            "Maybe we should double-check the policies of the Taliban when it comes to trans rights. Something tells me they much more align with JK Rowling then David Tennant.",
            "Anyone who loves David Tennant even more now, you should definitely watch Good Omens on Amazon. I only just discovered it and it's really rather good.",
            "The feminist compares trans rights to *the fucking Taliban*.",
            "What a rational and well thought out argument. I'm so glad this is the level of the national discourse, and that the press covers it so rigorously.",
            "Rich person who never has to work again expresses personal opinion."
        ]
    },
    "‘Stanley Johnson caused our flight to be cancelled’ say BA passengers": {
        "title": "‘Stanley Johnson caused our flight to be cancelled’ say BA passengers",
        "score": 194,
        "url": "https://www.independent.co.uk/travel/news-and-advice/stanley-johnson-flight-cancelled-british-airways-b2570789.html",
        "content": "",
        "num_comments": 52,
        "comments": [
            "Stanley Johnson caused most of the problems in Britain by failing to keep his zip done up several decades ago.",
            "So they diverted to Heathrow instead of Gatwick. BA wanted to sit around waiting at Heathrow with everybody in the plane and wait for Gatwick to reopen. Why didn't they just let everybody off at Heathrow and arrange free transportation to Gatwick for passengers who needed to go to specifically to Gatwick.\n\nYeah no shit, if a plane diverts to another airport serving the _same city_ passengers are going to want to get off...",
            "Sucks if your car was parked at Gatwick I guess, but it’s not like he _totally_ ruined anyone’s holiday, as the headline implied.",
            "It's not a bus and the Captain calls the shots.  Ban him from flying BA again.",
            "he's a massive cunt, hope he accidentally falls off of a cliff",
            "That’s what makes my blood boil beyond all else, that these people go through life with such an air of entitlement.\n\nWe’re in the position we’re in now by enabling cunts like this",
            "A bastard in the House of Lords!? *clutches pearls*",
            "> illegitimate daughter\n\nWhose that?",
            "Why report on fact when opinion gets more views. Social media has ruined most people ability to be critical. Just feed the people a overwhelming amount of info and hope some of it sticks.",
            "I’m pretty sure that the 99% of passengers bit refers to the people who had to take a bus from Heathrow to Gatwick."
        ]
    },
    "Top scientists turning down UK jobs over ‘tax on talent’, says Wellcome boss": {
        "title": "Top scientists turning down UK jobs over ‘tax on talent’, says Wellcome boss",
        "score": 164,
        "url": "https://www.theguardian.com/education/article/2024/jun/29/top-scientists-turning-down-uk-jobs-over-tax-on-talent-says-wellcome-boss",
        "content": "",
        "num_comments": 182,
        "comments": [
            "I think we all know that science and engineering are massively underpaid and undervalued in the UK.",
            "I've spent a decade within the academic and industrial sectors of life sciences within the UK and I'm done with it. Wages are unbelievably shit for the level of expertise and knowledge you have to bring to the table. Imagine having a literal PhD and only earning £35k for performing ridiculous complex work with poor work life balance.\n\nThings have gradually gotten worse over the last decade and I don't see it as a reliable career path anymore. Less funding, fewer jobs and a huge international talent pool means you have to fight very hard to get a job in which you're underpaid. Why even do it? Probably better off being an electrician.",
            "If you are recruiting from overseas the visa is normally covered by the employer. Perhaps scientists are turning down jobs because of cheapskate employers.",
            "Nothing whatsoever to do with the sheer ballsache of dealing with the UKVI, the crumbling infrastructure and the social fragmentation of the UK, of course. Or the better offers from other countries that won't treat them like criminals just for wanting to work there.\n\n No, it's only the tax - which entirely coincidentally would apply to senior figures at large pharmaceutical firms too.",
            "Yeah I'm was a medicinal chemist until I got made redundant for the third time in 6 years. Now looking to leave the UK because this country just doesn't give a shit about its scientists.\n\nGermany will hopefully take me...",
            "I’ve come through a science career and now work in the UK for a multinational company. My salary is about £75k which is a decent salary here. My colleagues in the US who do the EXACT same role earn $175-200k. We have the same qualifications and experience, have the same responsibilities, almost identical career pathways but unfortunately very different career progression opportunities which also favour the US team.",
            "Yeah if your employer isn’t willing to pay a few thousand in visa fees I’d question whether you are “top global talent”.\n\nIt’s going to be tough convincing the British public that visas are too hard to obtain.",
            "Companies underpay, then said underpaying companies complain and then get someone on a skilled worker visa for £28,000.",
            "It's mystifying how it can be difficult to settle in the UK (and other western European countries) for qualified foreigners (like it was for my partner), and yet there are many unqualified, unproductive people with unqualified, unproductive dependants who end up with passports anyway. How do they do it?",
            "The top tax rate kicks in at £55k. This is an absurdly low amount. Whoever abolishes the fiscal drag gets my vote."
        ]
    },
    "Missing Dillon Duffy found safe and with his dad in hotel ahead of return home": {
        "title": "Missing Dillon Duffy found safe and with his dad in hotel ahead of return home",
        "score": 100,
        "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/missing-dillon-duffy-18-found-29443583",
        "content": "",
        "num_comments": 35,
        "comments": [
            "Dillon was found because he turned on his phone and saw he was all over the news, felt guilty and found the Facebook group searching for him. This was 3 days ago according to him, then last night plucked up the courage to post in the Facebook group. He had a gambling habit that had spiralled and felt trapped. Luckily his dad had just gone back down to London to continue looking and was able to go and get him.",
            "As much as it's none of my business, I always want to know what it is that leads up to people going like that.",
            "I recently posted about Dillon going missing, so it's great to hear he's been found safe.",
            "Is this the guy that tried to kill someone with a machete?",
            "Interesting that his mum wanted to withdraw funds from the GoFundMe that was setup earlier this week.... I dunno make's you wonder!!",
            "So from this statement,Dillon had a dirty weekend in the hotel room with his dad?",
            "Brave lad facing by up to it. Glad he has been found. Thank you for sharing this.",
            "It’s been reported that he is depressed",
            "Sometimes things feel so overwhelmed that you feel like getting away is the right course of action. But, it doesn’t solve whatever problem you’re running from which then might push someone over the edge.\n\nGlad they found this kid.",
            "Hell yeah, this is great news. I remember it being posted the other day."
        ]
    },
    "Revealed: how Sunak dropped smoking ban amid industry campaign including legal threats and charm offensive from tobacco firms": {
        "title": "Revealed: how Sunak dropped smoking ban amid industry campaign including legal threats and charm offensive from tobacco firms",
        "score": 36,
        "url": "https://www.theguardian.com/business/article/2024/jun/29/rishi-sunak-smoking-ban-bill-backlash-tobacco-firms",
        "content": "",
        "num_comments": 34,
        "comments": [
            "The charm offensive from tobacco firms involved leaning back on a Cadillac, wearing shades whilst smoking. They also tucked the cigarette packet into the sleeve of their tight t shirt",
            "Look forward to Labour implementing this immediately then 😉",
            "So you want to live in a nanny state that tell you what plants you can put into your own body?",
            "Haha I disagree with a smoking ban (prohibition doesn't work) but he's gone back on it for all the worst reasons so I'm not sure how to feel about it!",
            "Theyre taking up vaping and then moving onto tobacco. I don't have any figures, I'm not sure they exist, but I'm watching it happen in my workplace and its pretty heartbreaking.",
            "Interesting that Philip Morris also own General Foods and Kraft.",
            "That argument only works if it doesn't impact others. Second hand smoke is a killer.",
            "Yeh they do. You just will get baccy sorted on the black market",
            "No, I want all drugs legalised and the tax revenue/police savings spent on healthcare and education.\n\nThat being said, if we absolutely must do the war on drugs, let's include the thing that has zero benefits and pictures of grotesque deformities with \"you're definitely gonna die horrifically, pal\" written all over them.",
            "Mate we already do, weed is illegal..."
        ]
    }
}