{
    "Unraid 7 Public Beta Sneak Peek": {
        "title": "Unraid 7 Public Beta Sneak Peek",
        "score": 66,
        "url": "https://www.youtube.com/watch?v=f2VwlAw5xXU",
        "content": "",
        "num_comments": 27,
        "comments": [
            "Always happy when things move forward but for the average user not using ZFS I don't see much benefit here. I'll be hanging back for a while until things are completely stable.",
            "For Plex, does anyone know on UnRAID 7 Beta how I need to configure it to use my Intel ARC card? I set the device to \"/dev/dri\" and it still uses my iGPU instead of the Intel ARC card. Not sure why Plex doesn't see the GPU. My Windows 11 VM sees it just fine though",
            "Docker engine v25 plz, no idea why its taking this long when stable was released 6 months ago.",
            "Did you already pass it to the vm when trying to access it from Plex?\n\nAlso there is a setting to choose which card to use in Plex settings.",
            "Safe to assume you haven't watched the video then? :P",
            "Not everyone wants to run an beta version",
            "Sure once I update I'll swap the cards, configure Plex of course and provide feedback.  I should be able to get to this over the weekend.",
            "Noooo seriously?  I've got an ARC 310 on the way to replace my Quadro P400.",
            "Is there much of a benefit to using ZFS as the file system of array drives? I thought the main benefits of ZFS were from creating pools?",
            "You'll need to add it to your docker parameters if your using it for plex, but a quick Google and 2 lines of code are all you need."
        ]
    },
    "Unraid 7 Public Beta is now available": {
        "title": "Unraid 7 Public Beta is now available",
        "score": 117,
        "url": "https://unraid.net/blog/unraid-7-beta",
        "content": "",
        "num_comments": 73,
        "comments": [
            "Never have I been so excited for something that I refuse to try, before at least a couple of months have passed",
            "Is it weird the feature I was most eagerly awaiting was the hardware database mentioned in the video months ago. Id love to get failure rates and brand stats on hard drives and SSDs",
            "\"Unraid array now optional\" huzzah!",
            "Unraid arrays are optional now. I can now use my ZFS pool without keeping some random USB drive connected to act as an array device. Lol",
            "I bought a second license for exactly this! *hard nips* LETS GOOOOO!",
            "I am on an test licence. Does anybody know if i get 7 if i buy now?\n\nDoes anyone know when 7 is expected to be fully released?",
            "Is there auto snapshots or do we still need to use spacesinvader script?",
            "Awesome !! Proxmox with good Nas",
            "What's the hesitancy with updating? Can't you easily make a backup and restore if something goes wrong",
            "Yes I will finally do my first upgrade. I need to add a 9500 card this weekend and it will be a perfect time to try it out"
        ]
    },
    "CCTV Options on unRAID; docker/VM, passing through a hard drive?": {
        "title": "CCTV Options on unRAID; docker/VM, passing through a hard drive?",
        "score": 6,
        "url": "https://www.reddit.com/r/unRAID/comments/1dr8ejy/cctv_options_on_unraid_dockervm_passing_through_a/",
        "content": "I currently have a CCTV DVR that has several cameras connected via BNC, however it has finally given up the ghost and died.  I have recovered and checked the HDD is still good.\n\nNow I could buy a new DVR and just swap it out; but this seems like a good time to maybe upgrade to something more modern and install IP CCTV cameras.\n\nHas anyone any suggestions on using unRAID as a CCTV recorder? I want to reuse my surveillance  HDD, so is there a way I can pass through the drive to a VM?  Or would I need to set it up as its own pool then record over the network to it?\n\nOr is there a docker specifically for this?",
        "num_comments": 10,
        "comments": [
            "There several ways you can make this work using unRAID. I use Frigate NVR which runs in a Docker container on unRAID.",
            "I'd highly recommend Frigate. \nIt has a little bit of a learning curve, and does have a focus around Machine Learning detections, but you can just use it to record without detections and it's rock solid for that.",
            "Frigate every day of the week. Inside unraid as a docker container for sure",
            "I run Scrypted (in a container), and just have a single 2tb ssd in its own pool dedicated to NVR storage, works great and I have all the cams uploading to Apple HomeKit for offsite backup.",
            "Do you use scrypted as the NVR? How does it compare to frigate?",
            "I do use Scrypted as the nvr, never used frigate sorry. Scrypted does work great tho and handles what I need.",
            "Thanks for the info. Does it work for people detection using a Google coral. Is there an app for live viewing and notifications etc?",
            "Yes to both.",
            "Awesome thanks",
            "So I'm not 100% reliant on UnRAID I've got a two level setup.\n\n1. Amcrest NVR with all IP camera's hooked into that recording 24x7\n2. Frigate as a docker container on unraid using a Coral for AI detection. With frigate subscribed to the cameras via the NVR's RTSP feeds.\n\nRedundancy is king."
        ]
    },
    "Change Device 1 from internal SSD to USB stick?": {
        "title": "Change Device 1 from internal SSD to USB stick?",
        "score": 2,
        "url": "https://www.reddit.com/r/unRAID/comments/1drb2tw/change_device_1_from_internal_ssd_to_usb_stick/",
        "content": "Hello everyone,  \n\n\nI paused my unraid project for a while and stareted my miniPC now again with the first goal a better device/space management.  \nMy MiniPC has a 32 SSD in it and it is the \"device 1\" and the dockers are installed there. So after a few apps, the free space on the ssd vanished rapidly... My plan was to add a usb stick (256gb) and install the apps there.  \n  \n When I insert the usb-stick it is no problem to use it as \"device 2\" (1st screenshot), but when I try to use it as \"device 1\" I get an error with the meta data from the ssd...\n\nWhat am I doing from? Is it even possible to do what I'm planing?\n\nThanks for your help in advance :-)\n\nhttps://preview.redd.it/x5bqc538gi9d1.png?width=1597&format=png&auto=webp&s=7c199b8aa56a8ecbb247834912377caa45a64cdc\n\nhttps://preview.redd.it/mqqrjhz8gi9d1.png?width=1614&format=png&auto=webp&s=4ecf178195cdb30a89a1b3c2617ad79befdaf89d\n\n",
        "num_comments": 0,
        "comments": []
    },
    "UnRaid drives setup recommendation": {
        "title": "UnRaid drives setup recommendation",
        "score": 3,
        "url": "https://www.reddit.com/r/unRAID/comments/1dr85bf/unraid_drives_setup_recommendation/",
        "content": "Hello,   \nNew to UnRaid - please help with hard drives allocation (Pools / Array / Cache?)\n\n  \nI'm retiring my HP MicroServer Gen8 (8 GiB DDR3 Single-bit ECC) Windows Server. Physically, I can stick in 5xSata drives and 1x M.2 SSD through M.2 PCIe NVMe Adapter. I currently have UnRaid Basic licence but I'm ok with upgrading to get update to 7 and more drives in the future if and when I decide to upgrade the hardware.  \n\nMy planned usage:   \n- storage and repository of photos and videos (action cameras)- for future editing  \n- family photos (immich / photoPrism - not sure as yet)  \n- local backups of google drive (2tb) and family OneDrive   \n- media files storage (mainly music for Serato access)  \n- other media, old downloaded movies, etc  \n- other Docker apps (not sure yet what I may need, want to test)\n\n  \nAt my disposal I currently have:  \n- 2x Seagate Enterprise Capacity v7 ST12000NM0127 - 12 TB  \n- 3x Seagate ST4000VN008 - IronWolf 4TB  \n- 2x Western Digital Red NAS \\[WD30EFRX\\] - 3TB  \n- 1x WD Blue SN570 M.2 NVMe SSD\n\nI also have 3x Seagate Ent Cap v4 SAS drives but since I don't have HBA nor space in the current box - wont be used. If I find a need (e.g. not enough CPU power)  I might be upgrading hardware in the future. \n\nPlease advice what would be the best drive allocation?   \nThanks in advance.",
        "num_comments": 1,
        "comments": [
            "12tb parity drive,\n12tb and 3x4tb data drives,\nNAS drives as a mirrored cache,\nSsd for docker AppData"
        ]
    }
}