{
    "Check out my latest video where I demonstrate how to effectively use GameMode and GameState to build a multiplayer game in Unreal Engine! ": {
        "title": "Check out my latest video where I demonstrate how to effectively use GameMode and GameState to build a multiplayer game in Unreal Engine! ",
        "score": 8,
        "url": "https://youtu.be/ZL0xmxTKvXQ",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Haven't watched the video but based on recent threads I think some updated videos on core gameplay classes is a good thing.",
            "Great video, subbed. I am learning unreal and game modes are kinda the last thing i have learned so this is handy"
        ]
    },
    "004: Godzilla Breaks The Internet and Riven Returns (29th June 2024) - Unreal Outpost Newsletter": {
        "title": "004: Godzilla Breaks The Internet and Riven Returns (29th June 2024) - Unreal Outpost Newsletter",
        "score": 4,
        "url": "https://www.reddit.com/r/unrealengine/comments/1dr76kz/004_godzilla_breaks_the_internet_and_riven/",
        "content": "*Unreal Outpost is a newsletter about the latest in Unreal Engine, the people who use it and the things they make. It is published every Saturday to get you up to speed with anything you might have missed.*\n\nAs always the whole newsletter will be published here on Reddit, but you can sign up to have it delivered to you inbox at [https://www.unrealoutpost.dev/subscribe/](https://www.unrealoutpost.dev/subscribe/)\n\n--\n\n# 004: Godzilla Breaks The Internet and Riven Returns - [https://www.unrealoutpost.dev/p/004](https://www.unrealoutpost.dev/p/004)\n\nWelcome back to the Outpost. It’s the 29th June 2024. \n\nIt’s been a hot one this week, but it hasn’t stopped the Unreal community. This week we have some impressive Unreal filmmaking, a classic game reborn and a deep dive into Unreal Subsystems. Whether you’re cooling off in Stockholm or working away on your personal project on vacation. Here are your weekend reads.\n\nIf you have a great story that you want to tell, a new plugin you want to share or art you want to show off, reach out to me [here](mailto:ollie@unrealoutpost.dev).\n\n--\n\n# The Latest\n\n**Creating Hollywood Style Effects In Unreal Engine**\n\nJosh Toonan’s Godzilla has been making the rounds on social this week as something of a tech demo for what is possible in Unreal Engine. In this video he breaks down his process for building his set piece.\n\nThis is great masterclass in filmmaking in Unreal, he shares all the assets, environmental design considerations and sound cues. This is a great watch for cinematic artists and filmmakers.\n\n[https://www.youtube.com/watch?v=Og9za5-VCag](https://www.youtube.com/watch?v=Og9za5-VCag)\n\n**Riven Returns In Unreal Engine 5**\n\nCyan, the storied developer behind Myst and Riven has returned with another Unreal Engine remake. This time it’s Riven in Unreal Engine 5. The gorgeous visual upgrade gives the classic something new to offer, while keeping the heart of what came before.\n\nDigital Foundry has a great breakdown not just on the visual upgrades but also the differences from the original and the tasteful decisions made it updating for a modern era.\n\n[https://www.youtube.com/watch?v=b\\_jL7\\_65OYE](https://www.youtube.com/watch?v=b_jL7_65OYE)\n\n--\n\n# Toolbox\n\n*The Outpost’s Toolbox is for new or updated tools to help make your Unreal Engine experience a little bit easier.*\n\n**Runtime Audio Importer**\n\nAudio can be a wild beast to manage, especially if you are trying to pull from different sources to build the soundscape you want. RuntimeAudioImporter simplifies that process by allowing you to import a number of formats from raw to compressed. There’s even some functionality for streaming if that’s something you have been considering.\n\n[https://github.com/gtreshchev/RuntimeAudioImporter](https://github.com/gtreshchev/RuntimeAudioImporter?utm_source=www.unrealoutpost.dev&utm_medium=newsletter&utm_campaign=004-godzilla-breaks-the-internet-and-riven-returns)\n\n**SubsystemBrowserPlugin**\n\nThis plugin visualises and opens up the hidden world of Unreal’s Subsystems. Subsystems if you haven’t come across them before allow you to crate classes that extend the capabilities of the engine with overriding engine defaults. They are super handy if you’re building your own extensions in Python or Blueprints, and you don’t want to edit source.\n\nThe Subsystem…system is not all that well exposed. This plugin gives you a great way of displaying your modifications, showing you what is active at any time and letting you build things like custom tooltips.\n\n[https://github.com/aquanox/SubsystemBrowserPlugin](https://github.com/aquanox/SubsystemBrowserPlugin?utm_source=www.unrealoutpost.dev&utm_medium=newsletter&utm_campaign=004-godzilla-breaks-the-internet-and-riven-returns)\n\n--\n\n*Check out the latest art we have been keeping a lookout for this week.*\n\nThis week’s selection for the Pinboard starts with Mailman Beckett - Island from [Lincoln Phung](https://www.artstation.com/artwork/ZaKAdx). A student project based on an idea for a platformer. If you check out Lincoln’s Art Station you can check out the little details and a few fly throughs of this bright, realised and stylised environment.\n\nNext up is [Christophe Desson’s](https://www.artstation.com/artwork/49APq8) “Training Ground”. Based off concept art from Robin Lhebrard. Christophe has a great breakdown on his ArtStation with Material node graphs and a Blueprint break down. Not pictured here is the additional character animation, which is also detailed in the post. \n\n--\n\nThat’s it from the outpost this week, we’ll be back with more from the horizon next weekend. \n\nWant to see your work featured in Unreal Outpost. Reach out to Ollie [here](mailto:ollie@unrealoutpost.dev).\n\nGet the newsletter delivered to your inbox at [https://www.unrealoutpost.dev/subscribe](https://www.unrealoutpost.dev/subscribe)",
        "num_comments": 0,
        "comments": []
    },
    "Added first character in Tampered | Tampered Adventure RPG game": {
        "title": "Added first character in Tampered | Tampered Adventure RPG game",
        "score": 4,
        "url": "https://youtu.be/oR4XHtOfxD8",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Awesome. Would you like to go a little into the details of your damage thresholds and the way you apply damage?",
            "Looks great"
        ]
    },
    "Importing Skeletal Mesh from Maya to unreal creates extra root bone?": {
        "title": "Importing Skeletal Mesh from Maya to unreal creates extra root bone?",
        "score": 2,
        "url": "https://www.reddit.com/r/unrealengine/comments/1dr8jpr/importing_skeletal_mesh_from_maya_to_unreal/",
        "content": "My skeleton\\\\Mesh are inside a transform group called SKM\\_Manny which has a -90 rotation due to the Y Up in Maya (required to use some libraries) which is done automatically when i import the manny rig.\n\nWhen i export and import the fbx into Unreal and (convert it to Z up on export) i get a extra 0,0,0 root which has the same name as the maya group name SKM\\_Manny showing up as the new parent root bone.\n\nDoes anybody have any ideas on how to fix this? I cant remove the group from maya or else it messes up the rotation, should be a setting on the export but i just cant seem to find it?\n\n",
        "num_comments": 1,
        "comments": [
            "If you are looking for help, dont forget to check out the [official Unreal Engine forums](https://forums.unrealengine.com/) or [Unreal Slackers](https://unrealslackers.org/) for a community run discord server!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/unrealengine) if you have any questions or concerns.*"
        ]
    },
    "Custom/Special animations (eg: Smoke dash) on a humanoid rig?": {
        "title": "Custom/Special animations (eg: Smoke dash) on a humanoid rig?",
        "score": 4,
        "url": "https://www.reddit.com/r/unrealengine/comments/1dr4hli/customspecial_animations_eg_smoke_dash_on_a/",
        "content": "As the title says, I'm trying to add special animations like a dash that turns you into a smoke cloud during its duration. \n\nHow would I go about this with a humanoid character? How do I make the transition into and back from the cloud smoother?",
        "num_comments": 3,
        "comments": [
            "The first option that comes to mind is to hide the character mesh, spawn the cloud particles, attach them to the actor. When the dash is complete you just reverse that process: remove the clouds, destroy the particles, make the character visible again. You can improve the transition by messing with animation montages and/or another particle system that 'dissolves' the player into a cloud-like mesh, you can look at the Content Examples project for how they make particles render in the shape of a character mesh to get an idea.",
            "If you are looking for help, dont forget to check out the [official Unreal Engine forums](https://forums.unrealengine.com/) or [Unreal Slackers](https://unrealslackers.org/) for a community run discord server!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/unrealengine) if you have any questions or concerns.*"
        ]
    }
}