{
    "CENSORSHIP UPDATE:": {
        "title": "CENSORSHIP UPDATE:",
        "score": 2674,
        "url": "https://www.reddit.com/r/UpliftingNews/comments/1bbm5nm/censorship_update/",
        "content": "Quick MODERATOR post: As of today, we will officially be removing any and all, obvious \"Political\" posts. This subreddit is meant to be a literal safe space from that divisive stuff.\n\nQ?: \"Isn't that censorship!?\"  - Yes, it literally is. By design. If you don't like that, make a post on /r/AmItheAssHole\n\nThis is a place to share Uplifting News stories, and **AUTHENTIC** examples of humanity or stories of people helping others, or of good things happening to fellow humans on our planet without any affiliation or care of race/color/creed/gender/sexuality/politicalaffiliation and without the plethora of well paid influences/influencers meddling in attempts to further their well paid narratives.\n\nBeen that way since 2012 and beyond!\n\n&#x200B;",
        "num_comments": 620,
        "comments": [
            "We all live in a weird world today, full of awareness but also censorship. This post was meant to alleviate some blatant and obviously lazy attempts at censoring and dictating discussion, but this isn't gonna happen here. \n\nSpeak your mind, no harm no foul. The goal is to bring people together and foster dialogue... Not to try to squash certain people's opinions or thoughts. But any opinions that disagree with this concept are welcome as well, so long as they don't violate Rule #1 here!  Love!",
            "How do you handle things that shouldn't be political, but people make them political by being assholes?\n\nFor example: when insulin became far more affordable in the US. That's about as objective as you can get when it comes to good news. But on every post about it I've ever seen, there are assholes who are talking about how big government is intruding on the rights of private corporations, and how it's going to stifle innovation, etc., etc.\n\nWould a post about insulin prices being capped then be removed because it's \"political?\"",
            "Wanting to be non-divisive is valid but either:\n\nA. You do extreme enforcement and the only thing allowed becomes stories about dogs getting wheelchairs.\n\nB. You try to enforce based on some subjective line and get accused of the censorship itself having a political agenda... which it inevitably will. This just becomes \"political posts are allowed unless they're contentious around the moderators' politics\".\n\nThat's just the reality of trying to be apolitical.",
            "Could you provide a few examples of posts you would and wouldn't remove?  Just curious.",
            "Are the following example headlines political?\n\n* Federal government announces new regulation that landlords can't discriminate against LGBT tenants\n* Taiwan legalizes gay marriage\n* Pay gap between white and black earners reaches historical low in the US\n* Ukraine regains territory in South\n* US Energy transitioning to renewables faster than originally estimated",
            "The most meaningful good news will always intersect with politics. \n\nWhen laws, politics, or the lack thereof infringe on the rights, health, and safety of people, animals, and the planet — the most meaningful good news will come from people working to right those wrongs.\n\nI hope you'll reconsider this rule.",
            "There are a lot of uplifting topics that could be considered political. Unless what is off limits is clearly defined, this sub will just have dog videos.",
            "The desire to go down the front page flagging everything is high.\n\n- Coral reef restoration? I dunno, seems like that's infringing on the safe space for the oil tycoons, who are protected under their political affiliation and creed.\n\n- An Arizona governor did what to a foreign owned farm? Anything a governor does is political.\n\n- A man spent 44 years in prison after a wrongful conviction? Uh oh, people might ask why that could occur, or who's responsible, or if there was injustice in the appeals. Better scrub it.\n\n- The US economy got more jobs? That's an instaban. Super political.  \n\n- Sweden joined NATO? I thought this was an apolitical space. Putin says this is WRONG and NOT UPLIFTING.",
            "This will be difficult to both communicate and implement.\n\n\nExamples:\n\n- Mark Cuban offers free prescription drugs: incredibly political because of extremely high drug prices in the US \n\n- ex-felon exonerated: political bc of US criminal justice system\n\n- country X legalizes gay marriage\n\nEtc etc.",
            "Everything is political. Get your head out of the sand."
        ]
    },
    "She thrifted this vase for $4. It turned out to be an ancient Mayan artifact": {
        "title": "She thrifted this vase for $4. It turned out to be an ancient Mayan artifact",
        "score": 6023,
        "url": "https://www.npr.org/2024/06/21/nx-s1-5013645/mayan-vase-thrift-store",
        "content": "",
        "num_comments": 128,
        "comments": [
            "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "Instead of selling it for profit, she gave it back to Mexico where it will be placed in a museum.\n\n\"The vessel dates back to between 200 AD and 800 AD, according to the Mexican embassy in D.C., during the Classic period – what historians widely regard as the height of the indigenous Mayan civilization.\"\n\n\n\"On Monday, the Cultural Institute of Mexico in D.C. held a ceremony to mark the repatriation, with Mexico’s Ambassador to the U.S. Esteban Moctezuma Barragá in attendance.\"",
            "From the article:\n\n\nShe was told to contact the Mexican embassy, she said, which she did. After sending in photos and dimensions of the vase, she said she was told by Mexico’s National Institute of Anthropology and History that she had an authentic piece of history on her hands: \"I got an email saying, 'Congratulations — it's real and we would like it back.'\"\n\nlol, “don’t fuck with us Anna” - Mexican Embassy ",
            "I think some compensation for doing the right thing is in order, even if to encourage others to do the same",
            "Shout out to the Anthropology museum in Mexico City she went to, that place is incredible.",
            "Nice.. I would have said I’ll bring it myself but y’all need to get me some tickets and accommodations",
            "I went to a yard sale, end of day, and bought a cute red \"cup\" for $5, They were asking for $1. Something told me I'd feel bad paying $1, the seller would be happy with a 80% markup  without suspicion. It turned out to be a 500 year old  oxblood & blue glazed comb holder. $700. Roommate broke it.",
            "Yay Anna!",
            "‘It belongs in a museum!’",
            "returning it of course is a good thing but if i got that email with that tone, you can be sure it goes into reddit and all social media to shame the museum before the vase goes back"
        ]
    },
    "Japan's Supreme Court recognizes transgender woman as parent": {
        "title": "Japan's Supreme Court recognizes transgender woman as parent",
        "score": 1495,
        "url": "https://www.japantimes.co.jp/news/2024/06/21/japan/society/post-transition-woman-parent/",
        "content": "",
        "num_comments": 42,
        "comments": [
            "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "Maybe im just out of the loop, but was the idea of someone being trans and a parent ever in question?",
            "It didn’t recognize her second child that she had after transitioning and only as a “biological father”. Not really a win unfortunately :(",
            "Please note that this decision by the court REFUSED the transgender woman's request to be recognized as the child's \"mother\". It forced her to be recognized as the \"father\", otherwise the child would not get benefits.\n\nThis was not what the parent wanted, and is the default way in cases like this as Japan does not recognize same-sex marriage.\n\nSocial media is strange. Another thread about this exact case framed it as \"court refuses to recognize transgender woman as the mother\", and people were criticizing Japan as being backward.\n\nBut in this thread, they are getting praise...?",
            "This happens right as I’m in the middle of a rewatch of Tokyo Godfathers",
            "[removed]",
            "[removed]",
            "Yeah, this is actually pretty big for japan. Previously it was impossible to legally transition if you were married or had children under the age of 18 there. \n\n\nThe government actually acknowledging an already transition woman as a father just wasn't something that happened.",
            "It's simply a very see-through idea",
            "This is incorrect, this article is a bit confusing. The **high court**, NOT the **Supreme Court**, had originally denied this woman custody of only the second daughter (post-transition). The first daughter (pre-transition) was granted recognition even by the high court. The Supreme Court reversed their decision, which allowed both of her daughters to claim recognition. It is an unambiguous win for trans rights in Japan. \n\nHere is an article which spells out the situation more clearly imo:\n\nhttps://english.kyodonews.net/news/2024/06/078f9f108176-japan-top-court-rules-trans-woman-father-of-girl-born-after-switch.html"
        ]
    },
    "Researchers invent one hundred percent biodegradable \"barley plastic\"": {
        "title": "Researchers invent one hundred percent biodegradable \"barley plastic\"",
        "score": 1440,
        "url": "https://news.ku.dk/all_news/2024/06/researchers-invent-one-hundred-percent-biodegradable-barley-plastic/",
        "content": "",
        "num_comments": 32,
        "comments": [
            "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            ">Together with researchers from Aarhus University, the research team founded a spinoff company in which they developed a barley variety that produces pure amylose in its kernels. This new variety is important because pure amylose is far less likely to turn into a paste when it interacts with water compared to regular starch.\n\nI was going to complain about pesky researchers messing with the future of my beer supply chain but this is actually pretty cool!",
            "This gives me so much hope!\n\nSimultaneously, I hope Big Plastic doesn't kill the invention beforehand. I would absolutely pay extra for the option to not contribute to the swirling masses of ocean plastic. I hope more people learn about alternatives such as this and that consumers will start to demand biodegradables.\n\nEdited for clarity and to not be a Debbie Downer.",
            "Sounds pretty good, especially the decomposition demo. Most bioplastics are just standard polymers made partly from or filled partly with some kind of plant material. \n\nThe only issues I see are that packaging doesn't generally sit around for 40-60 days in the environment and that people with Celiac disease or an allergy to the starch sources are going to be pretty hosed. Corn starch, for example, is allowed to contain 0.5% protein that can cause allergic reactions.",
            "This is great! But as someone with Celiac I’m not sure what to think lol",
            "Nice, now our bloodstreams can be filled with barely micro plastics.",
            "Interesting! A graduate student at Syracuse University did this with my spent grain from brewing like four years ago. I still have the piece of plastic from his first successful go. \n\n\nIt was cool then and it's still cool now. ",
            "Feels like some new solution is always getting developed. Plastics made out of mushroom, algae, corn. Fungus and worms that can eat plastic. \nAt this point I’m more interested to know if or when any of these will be widely used/available, because it also seems like the microplastics news is getting more dire and unfixable by the minute. \n\nI’m so tired of being fed hope only to go to bed starving because it was actually just greenwashing or some pet project to give the *appearance* of trying. \n\nUgh, I think this is my sign to get off my phone for the day.",
            "Do you want to know why it’s 100% biodegradable? Because it BARELY plastic!",
            "What's the catch this time?"
        ]
    },
    "Pet donkey found 'living best life' with elk, five years after escape": {
        "title": "Pet donkey found 'living best life' with elk, five years after escape",
        "score": 202,
        "url": "https://www.bbc.com/news/articles/cjjje07x35do",
        "content": "",
        "num_comments": 12,
        "comments": [
            "Reminder: this subreddit is meant to be a place free of excessive cynicism, negativity and bitterness. Toxic attitudes are not welcome here.  \n\nAll Negative comments will be removed and will possibly result in a ban.\n---\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UpliftingNews) if you have any questions or concerns.*",
            "My wife used to work at the local city shelter and they once got a call about a pig that had been roaming around some yards. Turns out the pig had been adopted by a herd of white tail deer, and when animal control showed up they all bounded off into the brush together lol",
            "“Escaped”\n\nBro is just trying to live.",
            "Not sure I believe this article.\n\nAt least one of them Elk clearly has a device/collar around it's neck.",
            "I don’t see one, which elk? Besides, wild elk are tracked for many reasons",
            "Surely they wouldn't make stuff up, on the internet, just for clicks? 🤔😉",
            "Not uncommon to see wild elk with collars. I’ve actually shot one with a collar. Another one I’ve shot had an ear tag and was previously collared.",
            "The elk right in front of the Donkey when they all turn away at the same time. Clearly has a collar on.\n\nYeah, some wild elk are tracked. It's also much more common to track elk on a managed game property. It's also much much more common to have a donkey with a managed herd, because donkies are badass at protecting managed herds of all kinds.\n\nYeah, it might be legit. My bullshit detector says otherwise tho.",
            "I mean, they have a guy quoted as having lost his donkey hiking in that same area. Idk if you’ve ever been out west but private and public lands often Criss-cross with little to no physical boundary.\n\n On top of that, local, state, and federal orgs conduct studies on wild animal populations often by tagging them. For all we know, they tagged bulls with large harems to track herd movement across the valley.",
            "I don't believe that guy that \"lost his donkey\""
        ]
    }
}