{
    "/r/USCIS Frequently Asked Questions, Megathreads, and Other Useful Info - READ BEFORE POSTING - COME BACK HERE AND LOOK FOR UPDATES EVERY NOW AND THEN": {
        "title": "/r/USCIS Frequently Asked Questions, Megathreads, and Other Useful Info - READ BEFORE POSTING - COME BACK HERE AND LOOK FOR UPDATES EVERY NOW AND THEN",
        "score": 37,
        "url": "https://www.reddit.com/r/USCIS/comments/149j4u9/ruscis_frequently_asked_questions_megathreads_and/",
        "content": "# /r/USCIS FAQs\n\nThis post will get updated over time. Come back every now and then.\n\n*Please listen carefully as our menu options have recently changed.*\n\n## First: **VERY** frequent questions\n\nPlease review [this link](https://www.reddit.com/r/USCIS/wiki/index/vfaq) before creating a new post to see if it answers your question. We hope this will lower the number of posts asking the same questions over and over. If you create a post to ask a question already covered here, your post may be deleted. \n\nThe list may change over time, so please check back every so often.\n\n## Read the wiki!\n\nYes, we have a wiki: https://www.reddit.com/r/USCIS/wiki/index\n\nIt doesn't hold answers to everything. But go through it and see if it helps with your question. If yes, great! And if you need more info, read on.\n\nThe wiki is intended to be updated every now and then, too. Your post may be deleted and you may be pointed at wiki resources if your question doesn't extend beyond what the wiki already covers.\n\n## Megathreads\n\nMegathreads are used to centralize discussions and knowledge about a given subject and to avoid creating redundant posts. \n\nSee [this link](https://www.reddit.com/r/USCIS/wiki/index/megathreads) for the list of active megathreads.\n\nIf your question relates to one of these subjects, there's a good chance it was already answered, but either way, you should ask it there rather than create a new post.\n\nAgain, the list may change over time, so please check back every so often.\n\n## We have rules\n\nMany Reddit communities have rules, and that includes r/USCIS. Please review the link below if you haven't already, or take another look every now and then to refresh your memory.\n\nhttps://www.reddit.com/r/uscis/about/rules\n\nOn a desktop or laptop, you can always find them in the sidebar on the right.\n\n## Last but not least\n\nIf you don't find the info you're looking for in one of the resources above, then don't hesitate to create a new post and ask the community! We do encourage you to first do some research on your own, so you can post semi-educated questions rather than super basic/lazy ones like \"how do I apply for citizenship\". Doing a bit of homework can go a long way toward empowering you in your immigration proceedings. Use your best judgment and be considerate of everyone's time.",
        "num_comments": 0,
        "comments": []
    },
    "Official eligibility requirements for Biden’s new parole in place program finally released ": {
        "title": "Official eligibility requirements for Biden’s new parole in place program finally released ",
        "score": 50,
        "url": "https://www.reddit.com/r/USCIS/comments/1dipxah/official_eligibility_requirements_for_bidens_new/",
        "content": "More details on Parole in Place.  To be announced today Wednesday June 18th.  Eligibility requirements from DHS released yesterday:\n\nhttps://www.dhs.gov/news/2024/06/17/fact-sheet-dhs-announces-new-process-promote-unity-and-stability-families\n\n“Eligibility and Process\n\nTo be considered on a case-by-case basis for this process, an individual must:   \n\nBe present in the United States without admission or parole; \nHave been continuously present in the United States for at least 10 years as of June 17, 2024; and \nHave a legally valid marriage to a U.S. citizen as of June 17, 2024.  “\n\nIt looks like it would only benefit people that came in without a visa. Essentially if you came in with your i94 and visa you wouldn’t qualify from the looks of it. Very limited program.  It looks like the main goal is to grant “admission” to people so they don’t have to leave the country.  For people that don’t have to leave but are scared to apply for green card they’re out of luck apparently.\n\n",
        "num_comments": 199,
        "comments": [
            "So basically this program will just provide an I94 so this category of immigrants will be able to adjust their status",
            "> For people that don’t have to leave but are scared to apply for green card they’re out of luck apparently.\n\nYes people who already don't have to leave the country don't benefit from a program that changes things so you don't have to leave the country. Not sure why anyone who is already eligible for a green card would be \"scared\".",
            "A relative of mine left the country in March to serve his 10 year ban. His wife is a US citizen. Would this possibly benifit him? He was here for over 10 years.",
            "What about the DACA recipients who have been working over 10 years, paying taxes, and have a clean record? Those rules and cut off dates are not fair to them.",
            "As someone whose spouse has DACA and has been vetted by USCIS every two years for a decade, not having to go to Juarez to finish the green card process is an extremely beneficial and tangible benefit for us. To dismiss this as pandering ignores other people who benefit and is crabs in a bucket mentality from fellow prospective immigrants.",
            "I'm the type of person this program would benefit immensely. What I am worried about is that I am not married as of June 17, 2024. I've been engaged to my US citizen fiancé for a couple years. We were going to get married this year. I'm happy for all the people this program will benefit.",
            "This is a good thing, because these people can already get waivers (which as spouses are usually approved) and leave and get visas and come back, but it costs a lot of money for lawyers and stress and time for USCIS in litigation and review. This simplifies the process for people who would basically get the same result with more headache for everyone.",
            "Interesting, how desperate can he be to attempt to win the vote of these citizens, who were forgotten for a while, in the upcoming elections?",
            "Im just waiting for my i601a to get approve  to go to the interview since my i30a was already approved. Will this benefit me?",
            "Looks like most people in this thread are more entitled than the Karens of this world"
        ]
    },
    "Feb Filer 2024 APPROVED ✅ 🇮🇪 ": {
        "title": "Feb Filer 2024 APPROVED ✅ 🇮🇪 ",
        "score": 9,
        "url": "https://i.redd.it/unqjfo4a1i9d1.jpeg",
        "content": "PD 2/9. Can’t believe the journey is finally over. I owe a great debt to the nice folks on this sub. Please feel free to ask any questions.\n\nCase details:\n• Irish citizen married to US citizen in 2023. Overstayed my J1 visa. Applied for AOS.\n• Filed i-130, i-485, i-765, i-131 concurrently + medicals\n• Everything processed at NBC.\n• We did all the paperwork ourselves but consulted an immigration lawyer to go over our completed file and he made very minor suggestions. This cost $100 in South Carolina. \n• NO RFE and Interview waived.\n• Without Kseniya International on Youtube we would be out A LOT of money on a lawyer. She’s the best. \n\nSlainté 🇮🇪 \n",
        "num_comments": 4,
        "comments": [
            "Ksenia International doing God's work, seriously",
            "These assclowns sent me a RFE after 4 month, like wtf.",
            "She got office in Texas?",
            "Hi there! This is an automated message to inform you and/or remind you of several things: \n\n- We have [a wiki](https://www.reddit.com/r/USCIS/wiki/index). It doesn't cover everything but may answer some questions. Pay special attention to the \"[REALLY common questions](https://www.reddit.com/r/USCIS/wiki/index/vfaq)\" at the top of the FAQ section. Please read it, and if it contains the answer to your question, please delete your post. If your post has to do with something covered in the FAQ, we may remove it.\n- If your post is about biometrics, green cards, naturalization or timelines in general, and whether you're asking or sharing, please include your field office/location in your post. If you already did that, great, thank you! If you haven't done that, your post may be removed without notice.\n- This subreddit is not affiliated with USCIS or the US government in any way. Some posters may claim to work for USCIS, which may or may not be true, and we don't try to verify this one way or another. Be wary that it may be a scam if anyone is asking you for personal info, or sending you a direct message, or asking that you send them a direct message.\n- Some people here claim to be lawyers, but they are not YOUR lawyer. No advice found here should be construed as legal advice. Reddit is not a substitute for a real lawyer. If you need help finding legal services, visit [this link](https://www.uscis.gov/avoid-scams/find-legal-services) for more information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/USCIS) if you have any questions or concerns.*"
        ]
    },
    "When I get greened I won’t tell, but there’ll be signals": {
        "title": "When I get greened I won’t tell, but there’ll be signals",
        "score": 70,
        "url": "https://i.redd.it/n5coak9qme9d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "I'm in an AOS group, and a lot of my Hispanic family did this and wore green!😊😊  when I say my Hispanic family, I mean it as a term of endearment. I'm non Hispanic, and everyone like myself is DACA or were former DACA😊",
            "This is such a splendid idea!! Omg!",
            "Jajaja ya lo había visto por face",
            "congrats! i’m going to do the same thing! did u give the cake making company a picture of ur greencard and blur out the uscis number? what else did u blur out?",
            "I love this, what a great idea!",
            "In my case when I got green I did the same and I went to saint patricks \nSame when I became a citiEn",
            "A mi me lo mandó mi novia hahah",
            "Oh no, that’s not me.\n\nThat was a meme I saw on facebook",
            "Fvkn awesome!  Yes I'm thinking of doing this too about the cake. The saint paddys outfit for citizenship is a great idea!",
            "Congratulations 🎉"
        ]
    },
    "CASE APPROVED!!!! 77 Days!! 😭💖": {
        "title": "CASE APPROVED!!!! 77 Days!! 😭💖",
        "score": 75,
        "url": "https://www.reddit.com/r/USCIS/comments/1dqts68/case_approved_77_days/",
        "content": "We can't believe it!!! 😭\n\nMy husband is a US Citizen and we filed for AOS for me (German Citizen) on April 12th through a lawyer (I came here through ESTA, and by the end of my 3 month stay, my husband simply didn't want to let me go again LOL).\n\nThe classic \"Your case is actively being reviewed by USCIS\" status message was updated for my I-485 about 6 weeks ago. Nothing changed for the I-130. Didn't think too much about it though, as I had read in many cases that this is pretty common. Then yesterday, all of the sudden, the I-130 changed to \"actively being reviewed\". My husband was through the roof, saying that this means things are moving along and they're working on our case right now. Me being me, I disregarded allllll of it (😂) after lurking on this subreddit for way too long, saying that this notification doesn't mean anything and we won't hear anything else until at least the end of the year.\n\nThen, about 24 hours later today, I received the notification that our case has been approved!!! 🥹 I did not have to attend an interview.\n\nI was convinced I wouldn't be able to see my family in Germany for Christmas, but I am BEYOND thankful that this is now possible.\n\nSENDING GOOD VIBES TO EVERYONE OUT THERE!!! MAY ALL OF YOUR CASES GET APPROVED IN LIGHTNING SPEED!!!!!!!! 💖💖💖💖💖💖💖\n\nhttps://preview.redd.it/q4csvh5jkd9d1.png?width=1084&format=png&auto=webp&s=049b15d42fbb886587e396ea28e247e190543b8e\n\n",
        "num_comments": 38,
        "comments": [
            "Let’s go !!! I got approved today too just after 56 days !!!",
            "Did they ask for any proof of marriages, such as pictures?\n\nDid you send these since the beginning, in case they asked for them?",
            "Congratulations from a fellow German 💗",
            "Congratulations to both of you!! 🙂",
            "Im german too but still waiting, what a shitshow. But still better than shitty Germany.",
            "How were you able to Adjust status from WWP (ESTA)? Wouldn't you need to do K1 and file I-129f? \n\nFellow German here, probably have to go K1 route.",
            "Congratulations!!  Is your I-130 also approved or just the I-485?",
            "I literally thought the same thing about the i130 notification yesterday hahaha",
            "May I ask what’s wrong with Germany?",
            "My husband and I married in Denmark (really easy, Germany can be anal when it comes to marrying a foreigner), therefore we were already married when I came here to visit him on my ESTA. Given I was already married to a US citizen when I came over, I was allowed to simply apply for AOS. USCIS states on their website somewhere that direct spouses of US Citizens are able to do that, but I'd have to look for that again."
        ]
    }
}