{
    "Admission / High School Megathread (Fall 2024)": {
        "title": "Admission / High School Megathread (Fall 2024)",
        "score": 107,
        "url": "https://www.reddit.com/r/uwaterloo/comments/17z19sy/admission_high_school_megathread_fall_2024/",
        "content": "# This megathread is for prospective frosh and current high school students interested in Waterloo. Ask your questions here.\n\n# Please avoid making separate individual posts on the subreddit regarding admissions to prevent the same 10 posts of \"can I get into program with x average\".\n\n&#x200B;\n\n# RELEVANT ADMISSION INFORMATION\n\n[PSA FOR NEW KIDS](https://www.reddit.com/r/uwaterloo/comments/vlnrpn/psa_for_new_kids/)\n\n[ADJUSTMENT FACTORS 2022](https://github.com/MohammedAl-Rasheed/Waterloo-Adjustment-Factors-2022/blob/main/AdjFactors2022.pdf)\n\n[COURSES OF PROGRAMS (VERY IMPORTANT LINK!!)](https://ugradcalendar.uwaterloo.ca/page/uWaterloo-Undergraduate-Calendar-Access)\n\n[RESOURCES FOR ***MATURE APPLICANT***](https://uwaterloo.ca/future-students/admissions/mature-students)\n\n[Resources for ***NON-UW TO UW***](https://uwaterloo.ca/future-students/transfer-students)\n\n[Fall 2023 Megathread here](https://www.reddit.com/r/uwaterloo/comments/yhyadl/admissions_high_school_megathread_fall_2023/)",
        "num_comments": 2942,
        "comments": [
            "To everyone who is a F24 hopeful: Waterloo is great but it's not heaven. \n\nBe prepared for the longest, hardest, and most academically grueling 4-5 years of your life. Think about if that is something you are willing to put yourself through. I work with a guy who went to Western Eng and he can't remember all the parties he went to, while I can't remember all the times I cried in DC lmao.  \n\nThen remember....you won't be alone. There will be 100s of people just like you for you to lean on. \n\nGood luck!",
            "Finally this megathread has been made lol",
            "UW genuinely slowly becoming my top choice for having the funniest reddit.",
            "Anyone else stressed with early offers coming out soon for engineering",
            "GOT INTO BME! It says \"conditional admit\", but no letter or email yet.",
            "Got uw admit for mangement just now",
            "Got SE! 101",
            "Early admits will hear by this friday.  From the Road to engineering blog “ Offers to non-OSS students will appear on Quest this week. These offers often involve manually coding due to the complexity of the offer letters. Often, non-OSS students have more conditions that must be met. This may include providing official transcripts and test scores. For this reason, offers do not tend to appear all at once. We expect all early round admission offers to be indicated on Quest by the end of Friday, March 15th”. (Edited typo).",
            "Today is the deadline to receive mid-terms.  Assumption is that acceptances should start coming in from tomorrow to May 15.  Now is the time to start worrying.",
            "Does anyone know if CS offers are rolling?"
        ]
    },
    "WaterlooWorks Megathread (Fall 2024)": {
        "title": "WaterlooWorks Megathread (Fall 2024)",
        "score": 63,
        "url": "https://www.reddit.com/r/uwaterloo/comments/1cmwg2v/waterlooworks_megathread_fall_2024/",
        "content": "This thread is for students applying to Fall 2024 co-ops during the Spring 2024 term.\n\nI have made a new salaries/blacklist spreadsheet since the previous one wasn't being updated anymore (thanks to  for the original though). It also contains some new columns. Now, a lot of this information is probably very old by now. Therefore **if you have any salaries to share or companies to add to the blacklist**, whether it is from a new company or one already on the sheet, please send me a chat message/PM, as it would greatly benefit from realistic numbers. If possible, please include the position, year, co-op term and any benefits you were given.\n\nThe sheet is here: [Salaries + Blacklist Spreadsheet](https://docs.google.com/spreadsheets/d/1OEDRTAalRsyD1iAO5fkp_8HUJUxbYTavotHhwX0AwBU/edit?usp=sharing)\n\n[Average Canadian Co-op Earnings (2023)](https://uwaterloo.ca/co-operative-education/about-co-op/co-op-earnings)\n\n[WaterlooWorks Important Dates](https://uwaterloo.ca/co-operative-education/important-dates)\n\ngib even more job\n\nEDIT: In regards to the blacklist, I've realized that a single account probably can't justify adding a company, especially large ones with many teams. Thus, I will list blacklist candidates suggested by users below, and **I would encourage anyone who has also had negative experiences with companies on the candidates list to share them with me as well**. 2 complaints will usually be enough to add something with the exception of very large institutions.\n\nCandidates:\n\n* **Canadian Nuclear Laboratories**\n* **Baron Biosystems**\n* **Console One**\n* **LavaReach** (Added)",
        "num_comments": 1435,
        "comments": [
            "Can the default sort be set to new?",
            "RIP I got no interviews",
            "I thought luck and WW would gift me something since I'm looking for my last co-op\n\nTurns out I been given \"nothing\". I'm extremely grateful for this humbling gift!! I shall cherish this treasure and use it to remind myself where I stand! 🥰",
            "anyone taking my will to live?",
            "OMG, I got nothing!",
            "Anyone taking cocaine?",
            "Still no interview ![gif](emote|free_emotes_pack|sob)",
            "Applied to 100 positions for my sixth coop and got 0 interviews and 0 OAs so far :(",
            "[deleted]",
            "where interview😭😭😭😭"
        ]
    },
    "On what grounds is UW Admin suing the students for 1.5 mil?": {
        "title": "On what grounds is UW Admin suing the students for 1.5 mil?",
        "score": 5,
        "url": "https://www.reddit.com/r/uwaterloo/comments/1dr337c/on_what_grounds_is_uw_admin_suing_the_students/",
        "content": "Iv been hearing a lot about this and seeing posts on insta, can someone explain in more detail? Like is the administration really suing students for that much money for peaceful protest?",
        "num_comments": 6,
        "comments": [
            "From the claim:\n\nDirect Costs: Expenses for property repairs, security upgrades, and other safety measures to restore Campus operations and ensure community safety.\n\nOperational Disruptions: Cancellations and postponements of academic and commercial events, as well as delays in construction projects, leading to substantial economic losses and lost revenue opportunities.\n\nReputational Damage: Negative effect on the University's ability to, among other things, attract and retain students and faculty, secure funding, and maintain its academic and community standing.\n\nLegal and Administrative Costs: Expenses related to legal counsel and increased administrative efforts to manage disruptions and legal challenges.\n\nDiminished Property Values: Reduction in the market value of the University's\nproperty assets, affecting financial status and future investment potential. \n\nSome of these points are questionable but both parties agree it’s more of a scare tactic to get the encampment to end sooner, rather than a way for the university to make dough.",
            "The details are all here - please read it for yourself lest you get tainted by the extreme perspectives of Reddit users\n\n[https://uwaterloo.ca/freedom-of-expression/sites/default/files/uploads/documents/statement-of-claim-university-of-waterloo-24-jun-202479.pdf](https://uwaterloo.ca/freedom-of-expression/sites/default/files/uploads/documents/statement-of-claim-university-of-waterloo-24-jun-202479.pdf)",
            "Other universities were quick to settle on agreeable terms and had their encampments packed up within the first/second week. \n\nIs somebody able to explain why this carried on for such a long period? Who is to blame—the university or the protestors or both? \n\nI’m sure this was the university’s last card as obviously none of the protestors can afford this amount of money and the suit will make them quick to comply.",
            "Truely a \"fuck around and find out\" moment.",
            "Reading the entire document, it seems like the university did try to reach out many many times. The main person who seems to have taken a position of leadership, Ahmad, continually accepted, asked to change locations/dates last second including inside the encampment, and then either cancelled himself a day or 2 later, or the university couldn't change their plans last second or couldn't meet in the locations due to safety concerns.\n\nThe police wouldn't take down the encampment after being contacted by UW as even though it's clearly illegal, there's a process involving the need of a court order. By repeatedly making the encampment aware that university policy, and Ontario law were being violated, they've essentially covered their ass for the organizers to wiggle out of, which is really the only option you have to ensure there's a stop.\n\nAs someone with zero legal background, I don't think the entire payment will be made, the fact that there are people brought up who are unknown opens a lot of deals to reveal their identities to the court if this goes through, but I'm not sure how that stuff works out.",
            "I'd also like to point out that the case has nothing to do with the protest, specifically the claims have zero reference to the protest. This is specifically the illegal building of the encampment, and the unwillingness to comply with not only UW policy that has existed longer than these people have been students, but also Ontario, and Canadian laws revolving around private property and fire codes."
        ]
    },
    "What does a prof/ta do if there are no students attending their lec/tut? ": {
        "title": "What does a prof/ta do if there are no students attending their lec/tut? ",
        "score": 32,
        "url": "https://www.reddit.com/r/uwaterloo/comments/1dqplq7/what_does_a_profta_do_if_there_are_no_students/",
        "content": "Do they just wait for students? Also, are they required to stay until the ending time of the lecture, or can they just leave? ",
        "num_comments": 9,
        "comments": [
            "If it's a poorly attended lecture, they just continue as normal. If nobody showed up? I don't think we have policies that cover this, but personally I'd probably sit there and wait to see if anyone showed up late.",
            "Scroll reddit for about 20 minutes then leave a note on the door & leave.",
            "I'm a TA. If there is even one student there, I proceed as normal. But you can bet the tutorial is going to be specifically tailored to that student. \n\nI've never had a completely empty classroom. I'd probably sit and relax until a student comes in or the official end of the tutorial.",
            "Watch inside out (2)",
            "When I was at UW I TAed several courses a term for something like five years and never had a totally empty tutorial. There were at minimum a few keeners who showed up every time, even for 8:30am CS245. But I guess if it ever happened I'd probably just get some work done just in case someone turned up and had questions or whatever.",
            "I know if no one show up, sometimes prof might cancel the lecture",
            "I've been at UW since 2021 and have had multiple tutorials/office hours with student no-shows. Contractually, I am obligated to be there for the designated time. I typically take the time to work on my own research or \"homework\" - it's a great use of time not devoted to meetings/classes/etc. :)",
            "Get bored, go to reddit, make a post that asks:\n\nWhat does a prof/ta do if there are no students attending their lec/tut? \n\nDo they just wait for students? Also, are they required to stay until the ending time of the lecture, or can they just leave?",
            "Some of you may be experiencing a difficult time or new emotions after <no one attending your lecture>.\n\nThe movie Inside Out is an excellent film to help you connect with these emotions.\n\nUW counselling is also available to help support you as you need."
        ]
    },
    "How strict are the student card photo requirements?": {
        "title": "How strict are the student card photo requirements?",
        "score": 3,
        "url": "https://www.reddit.com/r/uwaterloo/comments/1dr2i7c/how_strict_are_the_student_card_photo_requirements/",
        "content": "To be more specific it says no gestures of any kind. So can I smile or no? It says hair brushed back or behind ears and what about glasses are those fine? ",
        "num_comments": 3,
        "comments": [
            "You can smile and glasses are fine",
            "\"A typical mug shot is two-part, with one side-view photo, and one front-view. The background is usually plain to avoid distraction from the head.\"",
            "They let me wear my glasses"
        ]
    }
}