{
    "Weekly Discussion Thread": {
        "title": "Weekly Discussion Thread",
        "score": 5,
        "url": "https://www.reddit.com/r/valheim/comments/1dnjxdm/weekly_discussion_thread/",
        "content": "Fellow Vikings, please make use of this thread for regular discussion, questions, and suggestions for Valheim.  For topics related to the r/Valheim community itself, please visit the [meta thread](https://www.reddit.com/r/valheim/comments/mrjtnr/meta_subreddit_updates_and_discussion/).  If you see submissions which should be comments here, you should either *kindly* point OP in this direction or report the post and the mod team will reach out.  Please use spoiler tags where appropriate.\n\nThank you everyone for being part of this great community!",
        "num_comments": 27,
        "comments": [
            "Someone, Please HELP!\n\nSo my friends and I have been playing Valheim for about 6 months now, on and off during school. Once school got out, we quit for a bit, but we are now back on it, trying to find The Queen. We have sailed to two different islands where the Valheim Map World website tells us there is a Queen base located. We have scavaged these lands, and the base is nowhere to be found. We have also gone through countless invested mines looking for the location but can't find it. Is there another website that is more accurate? We made sure our map was updated on the website, but it's still inaccurate. Are there any tips or ideas? We are struggling to find a solution.",
            "Is the AI in the swamp acting weird for anyone else? The enemies all seem to run away way more frequently then they used to",
            "Finally just got to Ashlands after a restart.  This update sucks so bad.  I get difficulty, but this is BS.  6 sword skill lost in like an hour for 11 ore.  Total garbage.  When does the balancing patch come out?  It needs to be quick before I thumbs down this nonsense on steam after 400 hours in the game.  Mistlands was super annoying with the constant blindness, but this is is just stupid.  This is the grindiest nonsense I've ever had the displeasure of dealing with in any game I think.  After grinding and grinding for 6 biomes, it's just too much.",
            "Well, crap.\n\nI am out of cold mead and died in a ice cave. To get my stuff out, I need to make more mead. And bring armor to fight the enemies.",
            "Its been awhile since i've played this game, has the boating gotten any better? I played until the swamplands and after making that 45 minute trip 6 times, transporting loot, i lost all motivation to keep playing the game.",
            "Do complex large builds affect gameplay experience significantly? My builds are usually small so I was wondering what affects valheim's performance the most. As well as creatures, would too much tamed creatures cause performance drops? I would also like to know, does the presence of tamed creatures have any effect on # of generated hostile mobs in a biome?",
            "WARNING: potential to offend or annoy some people, but please consider my sad feelings about Valheim today:  \n  \nWhatever people say, there is no real point to this game. I say this because, technically speaking, you don't actually need to kill any bosses. This is Valheim's fatal flaw. If you consider the point of the game is to \"be able to easily traverse and survive in every biome\", then you should and need to kill the bosses. But the problem with Valheim is that you don't really need to move through or survive in most biomes. They're just there, taking up space. The game would make more sense if there was like some kind of **place** that functions as a finish line, or some kind of metric of \"days gone without dying x distance travelled & biomes plundered\". There is no actual point to doing any of this, beyond your own satisfaction of saying \"yay I can stand here and not get killed\". And then, if you get killed, so what? You just respawn. Oh you lost some skills? The skill system isn't that tangible anyway, and can be mostly compensated by gear. Oh some beasts destroyed your farm? Rebuild it, most creeps don't pose an existential threat to your bases most of the time. This vicious cycle of aimlessness makes the game feel meaningless beyond the idea of making your character invincible, but then again, there's no point in your character being invincible beyond your own fleeting feeling of awesomeness and coziness within the inertia of the cave you created.",
            "Did you try uploading the save file instead of putting the seed?",
            "Look at the website both with A. your seed uploaded and B. your world files uploaded (two separate tabs that you can look at). Compare to in-game. Whichever one you've tried so far and has been misleading you, use the other one. If your uploaded world file has been deceiving you, I'm sure the website would like to hear it.",
            "Pro tip for caves: Bring a sledgehammer and ooze bombs."
        ]
    },
    "Valheim The Board Game Announcement": {
        "title": "Valheim The Board Game Announcement",
        "score": 123,
        "url": "https://gamefound.com/en/projects/mood-publishing/valheim-the-board-game",
        "content": "",
        "num_comments": 49,
        "comments": [
            "Honestly, I do not think every game needs a board game adaptation....",
            "Cool, can't wait for the 'DEEP NORTH WOULDN'T TAKE SO LONG IF THEY DIDN'T WASTE VALUABLE TIME ON BOARD (MORE LIKE BORED) GAMES!!!1' posts.",
            "I hope my friends can still beat it while I spend the entire time mining copper and iron ore",
            "Video games getting a board game adaption is starting to become a really bad sign.",
            "I feel like this is stuff you do after the game is finished first",
            "Curious how this will play. After being disappointed to not get a Prison Architect board game Im looking forward to this!",
            "Valheim gravestone next? A man can dream!",
            "Video was too long for me",
            "If its at GenCon I will test it and get back to you",
            "I don't know,  this tells us nothing about the game. That's not usually a good sign."
        ]
    },
    "First time to the plains ": {
        "title": "First time to the plains ",
        "score": 1065,
        "url": "https://i.redd.it/0yl614ysje9d1.jpeg",
        "content": "",
        "num_comments": 37,
        "comments": [
            "You forgot the snickers from his mates in the background.",
            "Totally underestimated these bad boys on first encounter. Thankfully, it was just one and I left him to fight multiple draugr",
            "If you are lucky, the mozzies will ensure you never get to meet these rude fellows.",
            "Excuse me, it took them that long? I expect half the time!",
            "Me: *barely touching the ground when getting off the boat         \nInconspicuously-grass-looking fuling cloning machine:",
            "Dam I would have got as close as I could to the plains biodome and built a portal and then run over",
            "Flaming skeleton waiting to crash the party.",
            "when I first stumbled upon the plains with a friend, I thought it was humans at first because I never saw them, just heard the voices, lol, even after seeing one, I think I still thought the same thing XD",
            "My first introduction was in the Black Forest which had plains nearby. I was like \"oh there are these cute little yodas with torches\" and the response was \"OH GOD GET IN THE BOAT RUN\"",
            "i remember my first fuhling. Coming from a warhammer 40k background, i thought \"look, a gretchin. How dangerous can a gretchin be? come ooon\". 20 seconds later OMG WTFFFFFFFFFF."
        ]
    },
    "I offered to build a Greydwarf farm in our group server. Might have gone a little overboard :) Welcome to Fort Greybane!": {
        "title": "I offered to build a Greydwarf farm in our group server. Might have gone a little overboard :) Welcome to Fort Greybane!",
        "score": 55,
        "url": "https://v.redd.it/dplnvjdtjh9d1",
        "content": "",
        "num_comments": 2,
        "comments": [
            "there is never overboard, just almost done.",
            "Peekaboo, I found you!"
        ]
    },
    "straight outta Compton": {
        "title": "straight outta Compton",
        "score": 48,
        "url": "https://i.redd.it/xzu0ugxr7h9d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "I remember I entered Dark Forest for the first time and saw a giant creepy blue face starring at me with its yellow eyes right behind a few trees. That was scary",
            "CANT ENFORCE THE GENEVA CONVENTION IF YOURE ON FIRE. NOW FUCKING BURN BY MY TORCH SCUM OF RATS."
        ]
    }
}