{
    "2024 Wildfires Resources and Information": {
        "title": "2024 Wildfires Resources and Information",
        "score": 80,
        "url": "https://www.reddit.com/r/vancouver/comments/1cr62t0/2024_wildfires_resources_and_information/",
        "content": "**With 2024 predicted to be an especially bad wildfire year, and communities already being heavily affected this early in the year, we want to highlight official sources of information given how quickly the situation can change.**\n\n##Fire Resources\n\n######[Emergency Info BC](https://www.emergencyinfobc.gov.bc.ca/current-wildfire-information-2023/) \nUp to date list of evacuation alerts and orders.\n\n######[EMCR Wildfire Map](https://wildfiresituation.nrs.gov.bc.ca/map) \nShows all known wildfires in the province.\n\n######[DriveBC](https://drivebc.ca/#listView&eventType=Incident) \nDetailed road closures due to wildfires.\n\n\n#Current Fort Nelson Evacuation Info\n\n####[Evacuation Order 0830 May 13th](https://www.northernrockies.ca/en/news/Evacuation_Order_Fort_Nelson__FNFN__Highway_77_North__Highway_97_South__292_Subdivision.aspx)\n\n######[Evacuee Registration](https://ess.gov.bc.ca/)\n\n######[North Rockies Municipal Information](https://www.northernrockies.ca/modules/news/en)\n\n\n\n##Donation Links\n\nMany service providers in British Columbia will see increased demand due to the wildfires and evacuations. If you can spare it, consider donating to these organizations:\n\n######[Central Okanagan Food Bank](https://cofoodbank.com/donate/)\n\n######[Greater Vancouver Food Bank](https://foodbank.bc.ca/?form=FUNLJTXEYMH)\n\n######[Disaster Aid Canada](https://www.canadahelps.org/en/dn/m/6306?v2=true)\n\n######[BC SPCA](https://spca.bc.ca/donations/make-a-donation/)\n\n\n##Smoke Resources: \n\n######[BCCDC Wildfire Smoke Information](http://www.bccdc.ca/health-info/prevention-public-health/wildfire-smoke#)\n\n######[Information from UBC on how to adapt to the smoky conditions](https://beyond.ubc.ca/wildfire-smoke/)\n\n######[BC Childrens Hospital Recommendations for Protecting Children](http://www.bcchildrens.ca/about/news-stories/stories/tips-for-wildfire-smoke-and-children)\n\n##Air Quality and Smoke Monitoring\n\n######[Firesmoke.ca Smoke Forecast](https://firesmoke.ca/forecasts/current/)\n\nThe best place to get accurate air quality data are the agencies that collect that data in the first place:\n\n[Metro Vancouver Airmap](https://gis.metrovancouver.org/maps/Air)\n\nBC Ministry of Environment and Climate Change Strategy:\n\n[Home page](https://www2.gov.bc.ca/gov/content/environment/air-land-water/air)\n\n[AQHI Map](https://www.env.gov.bc.ca/epd/bcairquality/readings/find-stations-map.html)\n\nIf you want to view “citizen science” data in addition to the government data, you can check out [PurpleAir](https://map.purpleair.com/1/mAQHI/a10/p604800/cC0#11.44/49.268/-123.123)\n\n#####Please feel free to share additional resources in the comments and we’ll do what we can to update this list.",
        "num_comments": 3,
        "comments": [
            "Hi r/Vancouver. As a safety resource, we'd also recommend our page on hot weather and extreme heat safety. It's a collection of information that includes wildfire smoke management tips, signs and symptoms of heat and smoke-related illnesses and more. [https://www.vch.ca/en/extreme-heat](https://www.vch.ca/en/extreme-heat)",
            "Welcome to /r/Vancouver and thank you for the post, /u/Stevegap! Please make sure you read our [posting and commenting rules](https://www.reddit.com/r/vancouver/wiki/faq#wiki_general_participation_guidelines_and_rules_overview) before participating here. As a quick summary:  \n\n* We encourage users to be positive and respect one another. Don't engage in spats or insult others - use the report button.  \n* Respect others' differences, be they race, religion, home, job, gender identity, ability or sexuality. Dehumanizing language, advocating for violence, or promoting hate based on identity or vulnerability (even implied or joking) **will** lead to a permanent ban.  \n* Most common questions and topics are limited to our sister subreddit, /r/AskVan, and our weekly [Stickied Discussion](https://www.reddit.com/r/vancouver/wiki/faq#wiki_stickied_discussions) posts.   \n* Complaints about bans or removals should be done in modmail only.  \n* Posts flaired \"Community Only\" allow for limited participation; your comment may be removed if you're not a subreddit regular.  \n* Make sure to join our new sister community, /r/AskVan!   \n* Help grow the community! [Apply to join the mod team today](https://www.reddit.com/r/vancouver/comments/19eworq/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/vancouver) if you have any questions or concerns.*"
        ]
    },
    "Weekly Vancouver Discussion, Q&A, and Recommendations": {
        "title": "Weekly Vancouver Discussion, Q&A, and Recommendations",
        "score": 3,
        "url": "https://www.reddit.com/r/vancouver/comments/1dn7d5d/weekly_vancouver_discussion_qa_and_recommendations/",
        "content": "Welcome to /r/vancouver's Weekly Stickied Discussion thread, a place for Redditors to share and seek information on questions or recommendations related to:\n\n* Moving  \n* Landlords  \n* Real Estate  \n* Travel, Vacations, or Holidays  \n* Local Services or Products  \n* Events  \n* Self-Promotion and Surveys  \n* R4R: Dating or Friends \n* Job Postings and Volunteer Opportunities  \n* Rants or PSAs  \n* Asking About Random Sounds\n* Free-for-all Discussion\n\nIf you see commonly asked questions or posts throughout the week that you feel would be better suited to our stickied discussion threads, please be sure to share the link to this post.\n\n[See Previous Stickied Discussion threads](https://www.reddit.com/r/Vancouver/search?q=flair%3AStickied+Discussion&restrict_sr=on&sort=new&t=all)",
        "num_comments": 10,
        "comments": [
            "Ill be moving to vancouver this august and i am looking for someone for sharing an apartment ...let me know if u are looking for a flatmate.",
            "I am currently visiting Vancouver as a 22 year old male, what should I do? My girlfriend works here until 5 so I got the mornings to myself. I love sports, dont like much walking. I got 2 weeks. Any ideas?",
            "Variety of businesses offering **discounts** to Transit riders\n\nwww.translink.ca/rider-guide/offers",
            "Did someone in Vancouver die? I'm seeing a lot of flags at half mast.",
            "There is a Moving to Vancouver link on the right sidebar \n\nIf using public transit, adults save with www.compasscard.ca",
            "also a lot of people wearing black, maybe just a co incidence.",
            "As it's getting hotter, fyi I randomly found this interesting videeo about a diy salt-based cooling packs, that can be adapted into cooling blankets, and last for hours. Interesting science stuff in any case.\n\nhttps://www.youtube.com/watch?v=Nqxjfp4Gi0k",
            "**Academic Survey Request**\n\nHey there! I am conducting a research survey for my Masters thesis. The survey asks about your perspective on decision-making at the Canadian government. I am a student at Bocconi University in Milan and I am from Ontario. I would really like to get a better distribution of responses from people across all provinces and territories. I hope to collect over 400 responses and would appreciate your help in strengthening BC's representation in my sample. \n\nFYI individuals with any Canadian legal status are welcome (i.e. citizen, permanent resident, temporary resident, etc).\n\n**Survey Link: https://bocconi.eu.qualtrics.com/jfe/form/SV_6QNxQxQFaWhVUeq**\n\nThe survey takes less than 10 minutes and you will be eligible for a chance to win a $30 Tim Hortons gift card.\n\nResponses are completely anonymous. If you have any questions or concerns, please do not hesitate to contact me directly. \n\nThank you so much! :)",
            "r/askvan\n\nBe a tourist, go explore...\n\nwww.vancouverattractions.com\n\nwww.destinationvancouver.com\n\nhttps://miss604.com/tag/vancouver-events\n\nr/vancouver4friends\n\nSocialize with your neighbours\n\nGo to a gym/fitness centre\n\nwww.translink.ca/schedules-and-maps/skytrain shows the regions 3 subway lines\n\nLynn Valley suspension bridge and regional park; Lonsdale Quay, Cleveland dam, Whytecliff park, Deep cove; Granville Island, Museum of Anthropolgy\n\nClean her place, bake/cook dinner",
            "Welcome to /r/Vancouver and thank you for the post, /u/AutoModerator! Please make sure you read our [posting and commenting rules](https://www.reddit.com/r/vancouver/wiki/faq#wiki_general_participation_guidelines_and_rules_overview) before participating here. As a quick summary:  \n\n* We encourage users to be positive and respect one another. Don't engage in spats or insult others - use the report button.  \n* Respect others' differences, be they race, religion, home, job, gender identity, ability or sexuality. Dehumanizing language, advocating for violence, or promoting hate based on identity or vulnerability (even implied or joking) **will** lead to a permanent ban.  \n* Most common questions and topics are limited to our sister subreddit, /r/AskVan, and our weekly [Stickied Discussion](https://www.reddit.com/r/vancouver/wiki/faq#wiki_stickied_discussions) posts.   \n* Complaints about bans or removals should be done in modmail only.  \n* Posts flaired \"Community Only\" allow for limited participation; your comment may be removed if you're not a subreddit regular.  \n* Make sure to join our new sister community, /r/AskVan!   \n* Help grow the community! [Apply to join the mod team today](https://www.reddit.com/r/vancouver/comments/19eworq/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/vancouver) if you have any questions or concerns.*"
        ]
    },
    "\"don't worry, you're still dilfs!!\"": {
        "title": "\"don't worry, you're still dilfs!!\"",
        "score": 515,
        "url": "https://www.reddit.com/r/vancouver/comments/1dqxp1e/dont_worry_youre_still_dilfs/",
        "content": "So couple weeks ago i saw a show in a small indie venue in Vancouver. One of the bands was guys in their 40s playing a set. Most of the crowd were people in their 20s and the band seemed to have this kind of embarrassed vibe and at one point the lead singer goes like \"i know, you're probably thinking we are just some lame dads playing here..\" \n\nTo which some guy from the audience shouted \"Don't worry, you're still dilfs!\"\n\nTo which the band members all lighted up and the rest of the set was much happier. it was such a wholesome moment between generations, to show support no matter what, made my night.",
        "num_comments": 40,
        "comments": [
            "I have grey hair.  I was walking down Granville street late last night and some young women stopped me to ask me if I knew where a club was.  I did know where the club was and I gave them clear non-creepy directions and we all exchanged pleasantries and then went on our respective ways.  \n\nAnd the rest of the night I was kind of skipping around just at the fact that a group of attractive young women felt like they could stop me to ask me something.  Like I'm just glad that this is the vibe that I'm giving off, non-threatening, come ask me a question no problemo, definitely not an old lech.  If someone told me I was a dilf.. shit I think that comment would float me through life for at least a decade.",
            "Jeez can't wait to be called a dilf, I'm 38 and feel like I'm in limbo haha",
            "I love this. I was playing golf not that long ago as a single so I got paired up with a group. I was quite touched that these cool young women thought I was young and funny and not an old fuddyduddy like they had feared. It was a really nice compliment and was a fun round (albeit terrible on the scorecard)",
            "When ever I'm at a diy or indie show I feel old at 27, huuuge respect to the dudes still having fun with it in their 40's LOL",
            "Good for them, there's life after 40 if you want it. In many parts of the world, it's normal to do things in your 40s, but in Vancouver, there's always been some ageism, both weirdly voluntary   by that I mean, people shutting themselves away because they turned 31 or so, and also the discrimination inflicted on older people, but that obviously changing. Very cool.",
            "That's community!  Lol !!",
            "I'm so old and out of touch with reality that I had to google what a \"dilf\" is.",
            "DILFs = wholesome moment?!  lol  I really do get what you mean, it just sounds funny when you think about it.",
            "In my 30s, I was walking home in the summer while it was still light out and tweens were heading to the bars. A mildly intoxicated young woman ran over to me and very politely said that I have a \"really nice bum - it's perfect\". It's been 5 years and I still think about it.",
            "Right? I was at Fusion fest a few years back and a little boy, maybe 4 years old, stopped me in the massive throngs of people, and asked for help because he couldn't find his parents. Me, the fat, white, (he was indian) tattoo'd chick with a bit of a grumpy resting face. He thought I was the best choice? Warmed my heart! I don't even like kids all that much, but it made my day that he saw me and thought \"yes, she's safe.\" I took his hand, and his parents found us in less than a minute, haha."
        ]
    },
    "Does Richmond actually have more car accidents?": {
        "title": "Does Richmond actually have more car accidents?",
        "score": 176,
        "url": "https://www.reddit.com/r/vancouver/comments/1dqyk2p/does_richmond_actually_have_more_car_accidents/",
        "content": "Heyo!\n\nI’ve heard a lot about how the driving in Richmond is so bad so I decided to see if that’s actually true, statistically.\n\n**So, does Richmond have more accidents than other cities in the Lower Mainland?**\n\nhttps://preview.redd.it/vaqwlsz2se9d1.png?width=1943&format=png&auto=webp&s=ffe7a190d206e0b945fbeee36fe564bb13e15bf8\n\n**Not really!** Richmond makes up about 8.2% of Lower Mainland crashes and has about 3% higher crash rates per person than Vancouver Proper (in 2022, for all following stats).\n\nFor reference, Vancouver Proper makes up 25% of crashes in the Lower Mainland of the \\*communities I chose to include with 64.1 crashes per 10 000 people. Richmond makes up 8% of crashes with 66.4 crashes per 10 000 people. However North Vancouver, with only 4% of total crashes, has about 86.3 crashes per 10 000 people, 3*4% higher* than Vancouver Proper!\n\nI think a lot of the disproportionate blaming of Richmond and Surrey is from intentional and unintentional racism, so I also looked at some of the numbers of ethnicities.\n\nRichmond is mostly Asian (74.8%), Vancouver proper is 48.2% European settlers and 49.6% Asian and North Vancouver is a majority of Europeans (65.2%)!\n\nLangley, on the other hand, is 12.6% Asian, 79.1% European descent but has 15% higher crash rates than Richmond. Surrey is 54.3% Asian and actually has *16% fewer* accidents per 10 000 people than Vancouver Proper.\n\nhttps://preview.redd.it/u2hqvrz2se9d1.png?width=2617&format=png&auto=webp&s=dffe0f864a8a23bdd9b2a4cae189b91907ac6dc3\n\nFinally, on a more subjective note, I see comments talking about “it being okay to come to Canada, but don’t try to make it the country you chose to leave”. I suspect that upon interviewing Immigrants to Canada, ‘quality of driving’ would probably not be in the top 10, even 50 reasons someone might leave their home country. It’s certainly not why my ancestors immigrated, European nor Asian. Also, if you’re like me and not Indigenous and from this area, remember that *you're guests on this land*. Check yourself.\n\nI’m a mix of Asian and European blood and I drive in the Lower Mainland so I figured I was a reasonable person to make these graphs. I also say this to explain why I talked about Europeans and Asians in particular and to cover myself from identity politics finger-pointing!\n\nA few places where this data fails (to keep the haters at bay):\n\n1. No unreported accidents.\n2. No near misses.\n3. No types of vehicle nor traffic (industrial, tourists, etc.).\n4. Mismatched data - Crash and total population data from 2022, ethnic makeup is from 2016 - although I doubt it’s changed considerably.\n5. \\*Some communities aren’t technically Lower Mainland, but I don’t know what other region would claim them that has a similar sized audience. I chose the cutoff as approximately Lower Mainland and at least 10 000 people.\n6. Ethnicity data doesn’t well represent mixed kids like myself; there’s actually a negative percentage of people who aren’t Asian or European in Richmond. Definitions of Ethnicities are given by Stats Canada, linked below.\n7. I grouped everyone who isn’t Asian or European as just “Other”.\n8. **\\*Edit from comments\\*** Does not consider commuters - assumes that every crash is of people from that area. I don't know of a better way than to assume that most people driving in an area are from that area, and bordering cities to Richmond are still lower than Richmond itself.\n\n[Crash Data](https://public.tableau.com/app/profile/icbc/viz/ICBCReportedCrashes/ICBCReportedCrashes-LowerMainland#1)\n\n[Population Estimates](https://www2.gov.bc.ca/gov/content/data/statistics/people-population-community/population/population-estimates)\n\n[Ethnicity Breakdown](https://www12.statcan.gc.ca/census-recensement/2016/dp-pd/prof/index.cfm?Lang=E)\n\nLet me know what you think I missed! Just be nice :)\n\nhttps://preview.redd.it/aztnge03se9d1.png?width=2475&format=png&auto=webp&s=57c705df8ffffd9e482674e94c85c9ce1b5577ce\n\nhttps://preview.redd.it/fqjtyrz2se9d1.png?width=2997&format=png&auto=webp&s=5bc52da6b596350b027077f42429c726963db2dc\n\nhttps://preview.redd.it/du1j4sz2se9d1.png?width=2354&format=png&auto=webp&s=22245c902b5557e587591b9c44155a29b50aa6b0",
        "num_comments": 110,
        "comments": [
            "Driving from Surrey to Richmond to get to the airport for work daily.\n\nI don't notice a difference in the level of idiots on the road. They seem to be evenly distributed by geography and ethnicity.",
            "Richmond drivers has always just been code for Asian.",
            "not the tiniest bit surprised about langley",
            "Pardon my ignorance but if many people commute to Vancouver proper to work and get into accidents in Vancouver, does that count for Vancouver or for wherever they are from?",
            "Thank you for calling out the racism. It's this, 100%.\n\nI worked for years in Richmond and would much rather drive there than in Vancouver proper.",
            "Of course it doesn't. This is the oldest and most tired racist trope in the Lower Mainland, and it's a bunch of bull.\n\nNow there IS one demographic on the local roads that is responsible for a lot of accidents: the olds. We should be pulling boomers licences, or at the very least making them take a test every 2-5 years.",
            "The stereotype of \"Richmond drivers\" are not driving *dangerously*. They are perceived to be driving *stupidly* with less confidence. So, assuming that were true, they would naturally tend to get into less major accidents because they tend to be less reckless.\n- My mom is one",
            "It is definitely just racism, just like the people who start yelling about deportation in crime posts before the name or ethnicity or residency status of the offender is released.",
            "The two factors I can think of are: There was a scandal a few years back where some folks at the Richmond ICBC office were taking money under the table for years, to give people a pass on their driving test. And there are some pretty convoluted and confusing traffic configurations in Richmond, especially near the airport, which probably feel especially crazy and stressful for the folks who only ever go through there when theyre catching a flight.",
            "The top four on your list are all areas where most of the traffic is highway traffic.  Even though there are less accidents per driver on highways, the sheer volume of traffic on them means there are more accidents per resident due to commuters from other cities.\n\nRichmond is mostly local street traffic, and if you are driving in a city on regular roads with intersections, bikers, pedestrians then yeah Richmond has the worst drivers."
        ]
    },
    "What's the deal with the large helicopter that's been circling the west end for the past half hour ": {
        "title": "What's the deal with the large helicopter that's been circling the west end for the past half hour ",
        "score": 91,
        "url": "https://i.redd.it/bg8spz7tef9d1.jpeg",
        "content": "",
        "num_comments": 22,
        "comments": [
            "It's an RCAF CH-149 Cormorant. Search and rescue helicopter, flying out of Comox. \n\nUsually means a major search and rescue operation is underway out on the water, or it's just a training exercise. But likely, it's a search and rescue operation.",
            "Coast Guard, they are looking for missing swimmers or boaters.",
            "Hovercraft went ripping around past Spanish Banks / Tower Beach around 9:45.",
            "SAR - either searching for someone or training drill",
            "Its lost and looking for its mommy helicopter.",
            "Paddle board? Kayak? I hope they have more details out for boaters in the area...",
            "Hopefully the giant hovercraft doesnt suck in the missing paddler.",
            "I was always wondering what the hovercraft is for, pretty impressive machine",
            "That's actually RCAF, not Coast Guard.",
            "Coast guard ain't yellow lmao"
        ]
    }
}