{
    "Mod reminder regarding reporting posts/comments ": {
        "title": "Mod reminder regarding reporting posts/comments ",
        "score": 182,
        "url": "https://www.reddit.com/r/vanderpumprules/comments/1d9iq0a/mod_reminder_regarding_reporting_postscomments/",
        "content": "We’ve seen a massive uptick in reports of comments and posts that do not violate our rules, so we wanted to remind people to review our rules in our side bar before posting or reporting. We appreciate reports as we cannot always capture rule-breaking comments if they’re not flagged by our filters, but some reports lately seem to just be purely over disagreement in opinion, which is abuse of the reporting feature. \n\nJust because someone has a negative opinion of a cast member, a scenario, an episode, etc. does not necessarily mean it’s trolling or hate speech. We know it may be hard to believe, but some people have a minority opinion. Some people genuinely do like cast members such as Sandoval or Schwartz, for example. Just because users post in favor of these cast, for whatever their reasoning is, does not automatically mean it should be reported as trolling. We are aware there is a majority opinion in this sub, but we can’t remove posts simply because it goes against this, provided it does not violate our specified rules. \n\nFor example, calling a cast member slurs or curse words such as a bitch, a hoe, or the like *is* hate speech and should be reported. Baiting users into arguments, mocking users, leaving sarcastic/snarky replies unwarrantedly, name calling *are* examples of trolling and violations of our rules. And just because one user does it does not permit you or others to return it back. Report the violation and move along. \n\nOur fired cast rule has remained the same. Users are permitted to post about Jax, Stassi, and Kristen regarding their time on VPR. We do not permit posts regarding their life currently if it does not directly relate to the show, and any content regarding Jax and Kristen that pertains to their time on The Valley will be denied as The Valley has its own subreddit. \n\nWe spend hours combing through the queue each day. There are 6 moderators for 200,000+ users. Please be patient with us. If your post does not fit our guidelines, removal reasons are provided via comments or modmail. If you have a question, politely contact us to inquire about why it was removed. Reporting the removal reason comments will result in a permanent ban for abuse of the report button. ",
        "num_comments": 64,
        "comments": [
            "Thank you to all the moderators for all the hard work y’all do! I can’t imagine how hard it is to keep up with everything. If you are ever looking to expand your numbers, I’d be interested!",
            "We can also report your reports to Reddit admin from our queue which will result in Reddit admins suspending/banning your account. If Reddit is making you this upset please just log off. This is a reality show.",
            "Genuine question: do posts criticizing the cast's bodies count as report-worthy?",
            "![gif](giphy|xdMXeiY2iCfSQ6faTk)",
            "Why are we reporting comments in general. I've only ever done that like twice in my whole life and it was because a man was inciting SA or death. We need to feel some grass on our fingertips and reconnect with real life. Xoxo",
            "Thank you mods!!\nIf someone doesn't agree with a comment that's what the downvote button is for 😅",
            "Just for clarification: now that several former VPR cast members are on The Valley, are they allowed to be discussed in this sub?",
            "I love the mods here, thank you for your discernment and hard work. 🙏🏼💕",
            "[removed]",
            "This sub has basically turned into a fawning obsession over one cast member. Maybe we should change the name to r/arianaechochamber."
        ]
    },
    "VPR Daily Discussion Thread": {
        "title": "VPR Daily Discussion Thread",
        "score": 2,
        "url": "https://www.reddit.com/r/vanderpumprules/comments/1dqhzel/vpr_daily_discussion_thread/",
        "content": "Please use this daily thread for any and all small thoughts on the most recent episode, re-watch discussion or any other VPR thoughts that pop into your head!",
        "num_comments": 4,
        "comments": [
            "i’m watching satc, season 3 episode 14, they’re visiting LA. samantha buys a convincing knock off bag, and tells the other women, “i got the [seller’s] card— he lives somewhere called, ‘the valley’” jax-coded lmao",
            "$300 for a mashed potato bar doesn’t seem very overpriced JAX",
            "I would tear up a potato bar",
            "when you see mashed potatoes in a martini glass… that’s when you know it’s a high class affair"
        ]
    },
    "Tom and Arianna house update...thoughts?": {
        "title": "Tom and Arianna house update...thoughts?",
        "score": 580,
        "url": "https://www.reddit.com/r/vanderpumprules/comments/1dquxbm/tom_and_arianna_house_updatethoughts/",
        "content": "I saw this today...As of June 2024, Vanderpump Rules stars Ariana Madix and Tom Sandoval are involved in a court case over their joint property that could go to trial in February 2026.\n\nSo, she has moved out but he is still there.  It's been, what a year? And another year and a half before it goes to trial? So, he gets what he wants by still living there dragging this out cause he can't afford to refinance? And people wonder how she can still have anger. He is still cheating her. Dude, you moved on from the relationship years ago, move on. Get your own life and finances and quit holding that house hostage.\n\nWhat are your thoughts?",
        "num_comments": 265,
        "comments": [
            "And judge set a trial date for 2026. \nYes, you read that right.\n2026.",
            "My ex-husband did this when I had to leave the house we shared for my safety. I paid half the down payment and we financed the rest. He did everything he could do drag out our divorce. He lived there for free for over a year. He never made a single mortgage payment. Finally we have a court order and since he can’t afford to rub two nickels together to buy me out, the house is on the market. He’s evil and did so much of the same stuff Sandoval did. I can’t wait for the house to sell to be completely rid of him. I feel so deeply for Ariana.",
            "At this point, I would try to find someone super unbothered to live there in my place for free who would make Tim's life a living hell...",
            "Yea he's just prolonging the inevitable just to be a dick. That's Tom. He is spending more in layers than he will ever see for that house.  What an utter loser.",
            "The really sick part is that I don’t think that he could have ever been in a house like that *without Ariana*. Over the years — and well documented in other threads — he has thrown money at the most ridiculous whims. I would suspect that it was Ariana who came with both the capital and the credit to get *that* particular house. \n\nI generally believe her to be emotionally intelligent and she’s portrayed as someone who makes well-thought decisions.  It’s wild that she let him borrow against the house for his weird bar.  Did he whine and wear her down?  Was she blind to his faults?  Did she just love him so much she wanted to see him succeed with something of his own?\n\nI don’t understand. I think watching it play out has put many young women on guard to protect themselves in an unmarried-with-property situation.",
            "sandoval is becoming a hobosexual, because he's basically squatting in a house he only has 50% ownership of, refusing to do the **NORMAL HUMAN BEING THING** which is putting the house on the market to sell and split accordingly. Nooooo he's dragging his feet because he doesn't want to live anywhere else **BECAUSE HE IS INCREDIBLY SELFISH** and is taking advantage of the situation THAT HE CREATED AND WAS EXPOSED FOR DOING IN MARCH OF **2023** BY CHEATING ON ARIANA FOR AT LEAST 7 MONTHS WITH THEIR SUPPOSED GOOD FRIEND. \n\nDisgusting and subhuman behavior",
            "No idea how it works but I wonder if it is determined they have to sell, if he’ll be required to pay her back for the portion of the mortgage she’s paying while not living there 🤔 or if that’s something she’d have to sue him for",
            "He’s an idiot. Just sell the house and move on like Katie and Schwartz",
            "I feel so badly for her too that all the furniture it still there and we saw it was all furniture that she picked out and paid for. I saw an ad she filmed recently in her new house with new furniture in it & I just remember how hard she worked to get all those unique pieces. Just let her sell the house, Tom! Jesus. ",
            "She should use her half of the house as a storage for shit she doesn’t want just to annoy him lol I wonder if she can even rent out her half and have strangers move in there"
        ]
    },
    "Is Tom Schwartz the most sinister man on the show ?": {
        "title": "Is Tom Schwartz the most sinister man on the show ?",
        "score": 353,
        "url": "https://www.reddit.com/r/vanderpumprules/comments/1dqvhe1/is_tom_schwartz_the_most_sinister_man_on_the_show/",
        "content": "So this is my first watch of seasons 1-10. I always knew of the major players and who everyone was, but just never watched.\nAnyway, obviously Jax is a socio and Sandoval is a narcissist and the list goes on. But there is just something extra diabolical to me about Schwartz. The way he speaks to Katie and then blames her for starting it all. Or how he loses the marriage certificate twice and acts like it was an accident. And then the cheating etc etc etc. And then he puts on that little boy act and talks like a baby when apologizing. I could go on but I know this has prob been discussed. I just needed to express this on here bc my friends don’t watch 😂😂",
        "num_comments": 101,
        "comments": [
            "Schwartz is my least favorite person on the show. He’s manipulative, spineless, and overall just gross. The way he treated, talked to, and talked ABOUT Katie for a decade is just repulsive. That people think he’s this lovable goofball is honestly mind boggling to me for anyone who has legitimately watched the show. Ugh I will die on this hill - he makes me so angry and I’m so glad Katie finally got out.\n\nI’m adding more because that’s how much this guy rages me. His whole shtick was to poke and prod and antagonize Katie to no end, she’d eventually react, and then he’d be like “You see! Tequila Katie! Rage texts!” Blah blah blah. But she was 99% of the time reacting to him tormenting her. He’s said and done so many mean things to her he makes Jax taylor seem like a standup husband.",
            "God I always think about that time they were all at dinner, and Katie was rightfully very sad about something (idk what), but instead of comforting her, Schwartz started making digs and called attention to her mood and everyone started attacking her, calling her a bitch, saying she was ruining their dinner. All Schwartz had to do was give her a hug and tell her it’d be okay, but he made her feel even worse. \n\nThat’s when I realized how awful he truly is. It was just heartbreaking to watch :-(",
            "Listen, I just have to say on this sub lately there have been a TON of posts and comments about how bad of a person Tom Shwartz is. \n\nAnd I'm here for everyone of them. Fuck that dude. He's the absolute fucking worst.",
            "One of the most annoying things to watch is how The Worm paints the relationship between Katie and Schwartz are abuser and abused. When her frustrations with him are totally understandable. He says terrible things to her all the time and when she gets upset The Worm calls her \"evil\". That trio, the Toms and Jax is so startlingly toxic. They enable each others bad behaviour and demonise anyone who tries to hold them accountable.",
            "If Schwartz has no haters I’m dead",
            "Schwartz showed us his true self when he poured beer on Katie’s head in season 1.",
            "My friend and I talked about this last night. He is dark. Lala does an accurate impersonation of him holding his mouth in his innocent boy act. He’s actually disturbing to me and he’s incredibly abusive. You can also see how Katie became lighter after they decided to part ways. He is also really manipulative.",
            "It’s crazy because Schwartz is literally my (ex)baby daddy’s favorite character and I feel like that just speaks volumes to who he is as a person. He’s a huge manchild just like Schwartz lmao",
            "#justiceforkatie",
            "I am so fucking here for the re-litigation of his character as people are rewatching!\nThat man has been flying under the radar while being low key the most evil man on that show (in a sea of very strong contenders).  \nEat shit Schwartz."
        ]
    },
    "Why have I never noticed Tom’s feet before😷": {
        "title": "Why have I never noticed Tom’s feet before😷",
        "score": 108,
        "url": "https://i.redd.it/gn306nxczd9d1.jpeg",
        "content": "I don’t think I’ve seen this talked about…I just got this text from a friend who’s watching for the first time and I spit out my water 🤣🤣 \n\nTom having dirty feet tracks though. ",
        "num_comments": 48,
        "comments": [
            "Schwartz is known for having his filthy hooves out all over the place. I mean, the man bathed in a creek on his wedding day ffs.",
            "He’s known as Shoeless Schwartz on Danny Pelligrinos podcast. It’s talked about quite a bit haha",
            "![gif](giphy|CCWe81Q4p0Fx4tLhtg|downsized)",
            "Jax probably wants to suck on Shortz’s dirty feet",
            "Dirtfoot with lemonpeel pits. 🤢",
            "HE BROUGHT THOSE FEET INTO KATIES BED FOR YEARS. EVERY DAY WITH THE FEET.\n\n![gif](giphy|sR9Vr12mP8c6Yg8rm3)",
            "Omgggg this is seriously my biggest ick and fear! Gross af",
            "NO ARE THOSE REALLY HIS THO",
            "![gif](giphy|l2R08bZq7dRbOGMJG)",
            "Filthy grippers"
        ]
    }
}