{
    "Are you passionate about AI, animal advocacy and animal welfare? ProVeg International is looking to help animals with your AI idea! ✊": {
        "title": "Are you passionate about AI, animal advocacy and animal welfare? ProVeg International is looking to help animals with your AI idea! ✊",
        "score": 31,
        "url": "https://www.reddit.com/r/vegan/comments/1clx0xa/are_you_passionate_about_ai_animal_advocacy_and/",
        "content": "This month r/Vegan is collaborating with ProVeg International to leverage AI and end the horrors of factory farming. Together, we are looking for the most impactful ideas and talent to help animals!\n\nReady to bring your ideas to life? [Apply here!](https://docs.google.com/forms/d/e/1FAIpQLSfcZMdQ-zwhYg6WEezJqasDBVNtbs-H28z49PtTdEq1Y9VSFQ/viewform) **Applications for the 2024 Kickstarting for Good cohort are now open until May 26th.** 🙏\n\nAs part of the program, you will receive:\n\n* Fundraising support and exposure to major funders.\n* Access to expert mentorship and networking opportunities.\n* Help finding like-minded potential co-founders & partners.\n* Grant of up to $5,000 to cover travel and accommodation costs.\n* Comprehensive evaluation and guidance to fine-tune your budget, assess cost-effectiveness, and develop a change strategy.\n* Support in branding, website design, and other technical aspects to elevate your project's visibility.\n\nIf you're hesitant about your idea, submit it anyway! Every idea has value, and in our mission to help animals and transform the food system, we need all the creative input we can gather.\n\n**Go ahead and submit your idea  ➡** [**right here**](https://docs.google.com/forms/d/e/1FAIpQLSfcZMdQ-zwhYg6WEezJqasDBVNtbs-H28z49PtTdEq1Y9VSFQ/viewform)**! and learn more about the program** [**here.**](http://kickstartingforgood.org)\n\nWe’re looking forward to hearing from you!",
        "num_comments": 1,
        "comments": [
            "**Go ahead and submit your idea **[right here](https://docs.google.com/forms/d/e/1FAIpQLSfcZMdQ-zwhYg6WEezJqasDBVNtbs-H28z49PtTdEq1Y9VSFQ/viewform)**!**"
        ]
    },
    "My top 5 vegan benefits (as a vegan of 7.5 years)": {
        "title": "My top 5 vegan benefits (as a vegan of 7.5 years)",
        "score": 129,
        "url": "https://www.reddit.com/r/vegan/comments/1dr6lei/my_top_5_vegan_benefits_as_a_vegan_of_75_years/",
        "content": "Some of these might be unusual but wanted to share\n\n1.) Vegan food doesn't go bad as easily, there has been times where my fridge has stopped working or lost power overnight I didn't notice. Usually if the fridge had meat or dairy in it I assume you would just have to chuck it all away. But being vegan I just plugged the fridge back in and everything was fine.\n\n  \n2.) Your house doesn't stink. I've been in peoples houses who eat meat/dairy and you can tell if its been a couple days since they took out the rubbish since their bin smells so bad. Personally I only take out my rubbish once a week or sometimes like 10 days and it doesn't smell. \n\n  \n3.) Opens your eyes to how much people just don't care. For some reason people are generally rude to vegans in my experience. Like people making fun of you for being vegan and just being hateful.\n\n  \n4.) So much healthier I have IBS so stomach pain, rushing to the bathroom is pretty common for me but it's nothing like before I went vegan still bad but WAY  better.\n\n  \n5.) More creative with cooking, you want chocolate? Maybe you have limited options at the grocery store so you decide to make your own (something I did today :)\n\n  \nInterested to hear others benefits too",
        "num_comments": 61,
        "comments": [
            "Im a baby vegan but so far I feel Ive been having more energy.",
            "Funnily enough, point 4 and 5 cancel each other out for me. I used to control myself by not keeping snacks in the house, but since going vegan I've learned so many recipes that that doesn't work any more. I can just make a batch of naan bread out of basically nothing whenever I want some!\n\nOne big difference i noticed was dishes. I used to hate having to clean solidified fat off a frying pan every time, but you never get that with vegan food (even doing a big fry-up).",
            "0.) I no longer have to be a hypocrite.",
            "> So much healthier I have IBS so stomach pain, rushing to the bathroom is pretty common for me but it's nothing like before I went vegan still bad but WAY better.\n\nI **had** IBS, but since I went vegan, I very rarely have any flare ups. It's been so good. I was having diarrhoea nearly every single day when I was an animal abuser.",
            "I agree, especially 1), it's sooo much less stressful to eat something that have been there in a while in my fridge",
            "1. Animals arent killed, tortured and exploited because of me.",
            "This is a great post, really brilliant to hear the benefits you have from being vegan. I've been a vegan for 5 and a half years now. I noticed a few things. I feel sharper, my memory and attention are a lot better than they used to be and I feel more emotionally regulated, my mind is less prone acting on major anxiety. I also get less stomach issues and I have a lot more energy. I take more time to manage my food and plan out my meals (I am also gluten free due to non coeliac gluten intolerance) and being vegan forces me to be more imaginative with food.",
            "The smell was one I had never considered before going plant based. No slimy meat and dairy products smelling up the place changed how I do garbage. I only need to use one 20-gallon bag a week.\n\nI live in an apartment, and I may actually start composting stuff and reduce my waste even more. We",
            "Acid reflux and GERD used to be a big problem for me. Now, nothing.",
            "Easier to clean your dishes, also."
        ]
    },
    "Black bean burgers FTW": {
        "title": "Black bean burgers FTW",
        "score": 74,
        "url": "https://www.reddit.com/r/vegan/comments/1dr0sxs/black_bean_burgers_ftw/",
        "content": "***HAPPY UPDATE: The Morningstar Chipotle Black Bean Burgers I bought at Costco in Canada are 100% PLANT-BASED and VEGAN*** \n\nI love beyond or impossible burgers. But I just had an old-timey black bean burger. It was spicy, nutty, so tasty, and without that very full feeling (which I’m often seeking) that comes with the meat imitations. It was just one of the frozen ones from Costco, warmed in a frying pan, with all the fixins. SO GOOD. ",
        "num_comments": 33,
        "comments": [
            "I constantly think about how black bean burgers used to be the onllyyyy option and now you can't find a good one anywhere!",
            "Best black bean burger I ever had was in the food hall at my university (known for having good food!) And that was before I went vegan. Pretty sure they made them in-house but I so wish I could have them again!",
            "I get what imitation burgers are doing for the mainstream appeal but boy do I miss the black bean era...",
            "Just had my first black bean burger a couple months ago. I was completely shocked at how wonderful it was! Genuinely prefer them much more than meat burgers",
            "I would take basically any veggie patty Ive had over beyond/impossible 10/10 times, but black bean reigns supreme. Restaurants swapping them out has been one of the most disappointing shifts in recent years",
            "Oh, I like a good black bean burger. It's so rare to find at restaurants. One of these days I'll learn to prepare them myself.",
            "I love black bean and Oat burgers there a regular on my meal plans wayyy better then fake meat",
            "LIDL sells a Vemondo Black Bean burger with a crispy quinoa coating and it's AMAZING",
            "What is the brand name of the burgers ?",
            "I love black bean burgers!  I am in Canada so I get the PC brand, it's my absolute favorite "
        ]
    },
    "Shopping without Having to Read the labels!": {
        "title": "Shopping without Having to Read the labels!",
        "score": 11,
        "url": "https://www.reddit.com/r/vegan/comments/1dr97wx/shopping_without_having_to_read_the_labels/",
        "content": "Hello dear fellow vegans /vegetarians enthusiasts,\n\nWhat do you think about a place where we can shop comfortably without the need to read the labels?\n\n\nMy name Vanessa Das Neves, I am 30 years old and I live in Lisbon, Portugal. I became vegetarian 4 years ago,  and Vegan for 6 months. In the beginning it was a little bit tough to find some replacement due to lack of offer in the market. But, I survived 😁😁😁. After sometime of being vegan here I noticed that here there is not a vegan grocery store that offers wide range of products, what makes things a little bit difficult for vegans and vegetarians like me. With that I decided to open a vegan grocery store which will not only a grocery, it will be also a community for vegans and vegetarians to feel comfortable when shopping. Here comes the question, do you think that the vegan community is prone to help or support a vegan business to develop? ",
        "num_comments": 14,
        "comments": [
            "We need you in USA ",
            "Prone, but vegans can behave in cliquey ways antithetical to notions of community, so try to avoid drama while preparing for it. This means if there are multiple local producers of vegan cheese, stock em all. And when customers bicker about which one is better/which artisan is an asshole, dont participate.\n\nFormer vegan business owner in New York City. This shit happened a lot. ",
            "I was in awe of one I stumbled upon in Paris! Wished I could go there every day, wanted to bring everything home to Canada. Definitely prone!",
            "People with allergies are still going to have to read the labels. Were a vegan household but my wife is celiac and my son is allergic to nuts so even if I trusted that a store was completely vegan it wouldnt matter.",
            "Whatever your diet is you should be reading nutrition labels",
            "Who knows, in the future.",
            "Hello, it is always good to have one close to us. Thank you very much for reply. We are planning to open one in Lisbon, if everything goes well, if you come to Lisbon, we will be happy to receive you",
            "Thank you for your insight . We have been doing some market research with vegans and non vegans. As I currently work with public I take this chance to do some research",
            "We plan to include everyone, since we also develop some products thinking about who is allergic to nuts and gluten. In the future we plan to include an all vegan and gluten free bakery.",
            "agreed , allergies exist and even if you don't have any known ones introducing a new potential allergen to your diet should be done with caution. and in general if you care for your health some ingredients aren't the best + checking fortified food to see what they have in them."
        ]
    },
    "New vegan, need some advice!": {
        "title": "New vegan, need some advice!",
        "score": 35,
        "url": "https://www.reddit.com/r/vegan/comments/1dr39zq/new_vegan_need_some_advice/",
        "content": "So i've decided recently that i want to be vegan. i just cant stand to keep eating animal products and meat knowing how much they suffer. Im starting off with just no meat although i do hope to go full vegan someday, does anyone have any tips for me? what are some good alternatives for typical foods? and id also like to ask if eating fish still would be okay, as far as i know fish are relatively happy before a quick death and i dont see a point in cutting out fish from my diet if they die happy. Thanks! ",
        "num_comments": 68,
        "comments": [
            "hii! welcome, thats so amazing that you decided to start to switch :)) you really will find that it is so easy to find replacements of your favorite foods and you will end up feeling so much better in the process! beyond and impossible have so many fake meats that taste so good, and a lot of restaurant chains have beyond burgers. if theres a trader joes near you they have so much. tempeh and seitan are also amazing. so many grocery stores and literally target have vegan foods if you just look for them. thats all i can think of rn but if you have any questions feel free to dm me whenever!",
            "Fish are usually killed through suffocation. Nothing happy about that.",
            "Peanut sauce is great with veggies or noodles and easy to make.  It also stores well.  Raw tofu and salsa are an awesome lazy combination and nutritious to boot.  Soy milk is a good source of calcium.",
            "Most fish don't die quickly. they suffocate which can take some time",
            "There are fish farms and its horrifying if you look it up also veganism is about non consensual death and treatment in any form",
            "Fish dont die happy. At best, they writhe and fight while suffocating for a minute at minimum. Many of the people I formerly saw at piers were deliberately and pointlessly brutal, engaging in activities like throwing or slamming a fish, snapping minnows in half to remove them from nets, and butchering before the animal died with sharks specifically. I cant provide commentary on commercial farming.",
            "You dont need to substitute meat, fish, dairy or eggs. There is not a single essential nutrient that is unique to animal flesh or secretions! Zero! Nada! Nil! No substituting necessary!",
            "So you want to be vegan but keep on eating fish? That'd make you a prescetarian tho and not a vegan. \n\nBesides you think it's okay to kill the fish and eat them because... they were happy once they were still alive? Did I get that right? Once they're dead and on your plate they can't be happily living their life anymore now can they? They were robbed of their life for you to be able to eat them after all.",
            "Hi! I suggest switching to legumes. There are many kinds of legumes and they're some of the healthiest foods on the planet, cheap and very versatile. That's what I did when I cut out animals from my diet.",
            "Rather than try to find 'alternatives' just try enjoying vegetable stuff. \nVegetable curry, stew, soups etc.\nAdd noodles, rice or bread, wraps etc"
        ]
    }
}