{
    "Posting referral links will result in a ban": {
        "title": "Posting referral links will result in a ban",
        "score": 28,
        "url": "https://www.reddit.com/r/verizon/comments/172c4ff/posting_referral_links_will_result_in_a_ban/",
        "content": "As the title says, no referral codes.",
        "num_comments": 0,
        "comments": []
    },
    "Class Action Lawsuit megathread": {
        "title": "Class Action Lawsuit megathread",
        "score": 86,
        "url": "https://www.reddit.com/r/verizon/comments/196kp7e/class_action_lawsuit_megathread/",
        "content": "Please keep post about the class action lawsuit here",
        "num_comments": 139,
        "comments": [
            "Finally got my email.  I have 6 lines.  Hopefully it's per line",
            "Unsure if this is for another thread, but wonder if Verizon is setting up for another Class Action with their planned $4/line increase in Mar 1, 2024 when there are likely so many people on device payment plans with monthly trade-in credits. And they are now 36mo plans, no longer 24!",
            "I received 3 emails so Im assuming its per line and not per account",
            "Just submitted. I honestly didnt think it was legit when I got the email back on the 7th lol",
            "Verizon is making us pay for this lawsuit.  Starting March 2024, we will all be billed 5 dollars extra per line regardless of the plan you have.",
            "How do you know if you should file this or not? I have been with Verizon for a long time.",
            "Reading the actual settlement agreement, it definitely appears to be per account, not per line. The language is \"account holder,\" \"per account,\" etc. I received two emails because I had two separate accounts during the specified time period, and the claim form had each account number auto-populated. Multiple lines would have the same account number.",
            "The website has been broken every day since Ive found it, for months now. The online submission form doesnt work, and the website where the mail-in form is said to be hosted doesnt even \\*exist.\\* Is this just a scam or a hoax?",
            "funny I never saw any email about this, glad I came to check this page out. \n\nWhat month does it stop at? im trying to roughly figure out how much we may get, I think we signed up in early 2017 for Verizon",
            "Anyone know when the payments are going out on this settlement?\n\nThe website does not show anything and the lawyers won't answer questions."
        ]
    },
    "I can’t keep steady UW inside my house. ": {
        "title": "I can’t keep steady UW inside my house. ",
        "score": 1,
        "url": "https://www.reddit.com/r/verizon/comments/1dreals/i_cant_keep_steady_uw_inside_my_house/",
        "content": "  For starters. I live in the Chicago suburbs with very good UW coverage and nearby mmWave nodes. When I’m outside my house, I have a very good UW connection but as soon as I step inside, my UW is gone and I have absolutely horrendous 10mbps down low-band 5g with unusable upload speeds. \n\n  However, yesterday was different. When I came back home, my UW didn’t disappear. In fact, I had UW for almost 3 hours straight until my signal randomly cut out, which never happens. My phone had said SOS for some reason, and when my signal comes back, I’m back on regular 5G. Why is Verizon hellbent on ensuring I don’t have UW in my house?? It’s not like the walls are too thick and penetrating the signal as shown by yesterday. Any answers? ",
        "num_comments": 0,
        "comments": []
    },
    "Does a single TravelPass day also cover a \"Connected Device\" on your plan": {
        "title": "Does a single TravelPass day also cover a \"Connected Device\" on your plan",
        "score": 1,
        "url": "https://www.reddit.com/r/verizon/comments/1dre6jg/does_a_single_travelpass_day_also_cover_a/",
        "content": "I was thinking about getting an iPad with the cellular option which I would be taking with me during some upcoming overseas travel, which I would be adding to my normal Verizon line as a [Connected Device](https://www.verizon.com/plans/devices). TravelPass works fine for my phone but I've never tried using it with a tablet, so I thought I'd ask you guys. When I have TravelPass active, does it also cover connected devices? Or would I need to pay/use banked days separately for my phone and each device?",
        "num_comments": 0,
        "comments": []
    },
    " Verizon home internet router broke in 2 months": {
        "title": " Verizon home internet router broke in 2 months",
        "score": 0,
        "url": "https://www.reddit.com/r/verizon/comments/1dre2ju/verizon_home_internet_router_broke_in_2_months/",
        "content": "Any feedback on this device? How long did yours survive? It’s the rectangle type - wouldn’t power on one morning. Replacement comes in 3 days from today. ",
        "num_comments": 0,
        "comments": []
    }
}