{
    "Start HERE! (Sub's Knowledge Base)": {
        "title": "Start HERE! (Sub's Knowledge Base)",
        "score": 103,
        "url": "https://www.reddit.com/r/VeteransBenefits/comments/1914o0e/start_here_subs_knowledge_base/",
        "content": "Welcome to the Veterans Benefits SubReddit!\n\nOur sub has an extensive collection of articles on everything VA. We encourage you to start your knowledge adventure there before making a new post, as you might be able to find your answers there.\n\nClick [HERE](https://www.reddit.com/r/VeteransBenefits/w/index) to access the Knowledge Base.\n\nOf course, if you are having trouble finding an answer in the Knowledge Base or in previously posted threads or you simply want more specific feedback, feel free to make a new post.\n\nBut, before you make a new post please be mindful of the Sub's rules:\n\n1. Help other: Don't be a jerk. If your comment is not constructive or helpful, do NOT hit reply.\n2. We're Ad-Free:  Do **not** recommend a service or product - unless as a comment to a post **specifically** asking for recommendations, **and** it is a service or product that you have direct experience using. Posting links to useful content (videos, blogs, web pages) is fine, but posts  that we determine to be purely promotional will be deleted.\n3. Don't doxx yourself, or anyone else: Respect Reddit's tradition of anonymity and don't disclose your information or that of others. Please no phone numbers, emails, license numbers, or other contact information. This also includes QR codes (the box with black and white squares) on decision letters. This rule does **NOT** apply to private entities such as VSOs, law firms, or other official agencies. EXAMPLE: It's fine to post the VA's phone number, but not an examiner's professional/personal contact information.\n4. News should only be posted once: Breaking news often gets posted and reposted. We all  enjoying seeing news posted ONCE, but a dozen posts saying  basically the same thing not so much - and this also makes discussion  tough, since nobody knows which post to comment on.\n5. Memes are for Mondays: Please keep the Meme posts to Mondays.\n6. Get verified if you want to say you work for XXX: If you are a VA employee, VSO, Accredited Claims Agent, etc. Your credentials **MUST** be verified via the sub's [Mod Mail](https://www.reddit.com/message/compose?to=/r/VeteransBenefits) **BEFORE** you can claim to be someone of such authority. Users who have completed the process will have an appropriate user flair.\n7. Keep claim status posts and success stories to the pinned weekly post.",
        "num_comments": 9,
        "comments": [
            "Curious if anyone has had any luck submitting a claim for Lumbar/Cervical damage caused by the Marine Corps Martial Arts Program and/or carrying excess heavy loads in Afghanistan? Went through Grey and Green Belt course in Afghanistan. No mats just a hard and wet sandpit. Curious of others experience. Of course none of the sessions with corpsman were documents in my medical record.",
            "Awesome! Thank you!",
            "Thoughts on adding this as an automod comment to new posts?",
            "Can someone put my mind at ease please.  So I completed all my appointments in my previous claim but they \"lost\" my paperwork from my claim I submitted way back in August 2022. Then I resubmitted 2 more times and my official claim date is July 2023 now. On December 7 I got the update that they need schedule me for the no show appointments. Then now i see is 12 “You or someone else submitted “DBQ” last appointment for those was December 21. I even got the packet from QTC again. And every time I call I ALWAYS get a different answer from the VA people. So... now I'm thinking it'll take 6 more months probably???",
            "In the absence of medical records you'd need to supply personal and buddy statements.\n\nhttps://www.reddit.com/r/VeteransBenefits/wiki/buddy\n\nIf you do have the certificate of completion for the belts that can be used as evidence as well.",
            "[VA Board of Veterans' Appeals Case](https://www.va.gov/vetapp23/Files9/A23026363.txt)",
            "By then it is already to late. We already have a message for people to check the knowledge base before they make a post.",
            "I doubt 6 months, but just keep rolling with the punches.",
            "I'm trying to have the mentality that I'm getting a low rating even though like most if us I have a good amount of wear and tear on me. Surgery and other claims. $1200 a month would be a blessing."
        ]
    },
    "Weekly Claim Status and Success Thread": {
        "title": "Weekly Claim Status and Success Thread",
        "score": 4,
        "url": "https://www.reddit.com/r/VeteransBenefits/comments/1dne7mn/weekly_claim_status_and_success_thread/",
        "content": "Has your claim been taking the scenic route or did it take the express lane this week?\n\n* Use this thread to share how long/short you have been waiting on your claim. As well as sharing with us your victory against the VBA Juggernaut!\n\nFor those looking to share their success you may also want to make a post in our sister sub: [r/VeteransSuccess](https://www.reddit.com/r/VeteransSuccess/).\n\nFor those looking to share their claim status you may also want to make a post in our sister sub: [r/VeteransWaitingRoom](https://www.reddit.com/r/VeteransWaitingRoom/).\n\nClaim status Template:\n\n* Type of claim: (New, Original, Supplemental, Increase, etc)\n\n* Submitted/received date:\n\n* Initial review date:\n\n* Evidence gathering/review date:\n\n* Preparation for Decision date:\n\n* Pending Decision Approval date:\n\n* Preparation for Notification date:\n\n* Completed date:\n\n* Misc details:\n\nTo tag specific people in replies on redit type: \"u/username\". The \"u\" does need to be lowercase.\n\nHelpful Links:\n\nCurrent average wait time for claims click [HERE](https://www.benefits.va.gov/reports/mmwr_va_claims_online.asp).\n\nFor those interested in learning more about the stages of a claim click [HERE](https://www.reddit.com/r/VeteransBenefits/w/stages/).\n\nTo see list of benefits based off combined disability evaluations click [HERE](https://www.reddit.com/r/VeteransBenefits/w/combinedbenefits).",
        "num_comments": 155,
        "comments": [
            "June 3, 2024 - Filed Supplemental claim (Sleep apnea secondary to PTSD)\n\nJune 11, 2024 - VA requested ACE exam through QTC\n\nJune 13, 2024 - QTC send in results to VA\n\nJune 15, 2024 - Found out the examiner gave very favorable opinion\n\nClaim is still pending!",
            "* Type of claim: Secondary x4\n* Submitted/received date: 3-26-2024\n* Initial review date: 3-26-2024\n* Evidence gathering/review date: 3-27-2024\n* Preparation for Decision date: 05-01-2024\n* Pending Decision Approval date:\n* Preparation for Notification date:\n* Completed date:\n* Misc details: Cricket.... cricket.",
            "How are late march, new claims looking? I’m still in PFD since May 8 and I started my claim March 30. Any one else from march seen movement?",
            "Type of claim: Increase\n\n3/4/24 submitted and initial revdiew\n\n3/6/24 Evidence gathering (C and P on 3/15)\n\n3/22/24 PFD\n\n6/25 Assigned temp jurisdiction\n\nPDA - 6/27/24\n\nPFN - 6/27/24\n\nClosed 6/28 and got my increase\n\nI was expecting early July to get assigned temporary jurisdiction based on what I was seeing here but I guess early March claims are really starting to get picked up!",
            "* Type of claim: New/Initial\n* Submitted/received date: 02/26/2024 (119 days)\n* Initial review date: 02/27/2024\n* Evidence gathering/review date: 03/05/2024\n* Preparation for Decision date: 06/14/2024\n* Pending Decision Approval date: n/a\n* Preparation for Notification date: n/a\n* Completed date: n/a\n* Misc details: EAOS was 02/28/2023. My last command lost my medical records and it took about 9 months to get them located. Was able to submit my claim just under 1 year after EAOS, so luckily I'll be able to receive back pay.\n\n**Had a phone call with VERA last week and found out the mental health C&P examiner marked my block 4a considerably lower than he told me he was going to. So other than still waiting like everyone else, at least I know I'll be disappointed with the outcome ahead of time. Takes some of the anxiety away I suppose.**",
            "* Type of claim: Supplemental for PTSD, Hearing Loss/Tinnitus Recurring.\n* Submitted/received date: Intent to File Jan 2024 - Submitted claim May 4, 2024\n* Submitted VA mental health diagnosis; VA records, therapy, and medication taken, third party medical mental health exam/diagnosis with evaluation notes included. Personal lay statement of in-service events, awards and decs and letters of evaluation linking in service event to diagnosis. \n* Misc details: C&P Exams for mental health & hearing loss/tinnitus scheduled and attended on May 24th and 28th, with reports both being sent to VA within 3 days. \n* Now I wait. Ony been about 60 days, so roughly 2 months more until a decision based on the 120 day estimate. We'll see...",
            "    Intent to file: Apr 2022\n    Submitted/received: Feb 2023\n    Initial review: Feb 2023\n    Evidence gathering/review: Feb 2023\n    C&P Exam: March 2023\n    ACE #1: May 2023\n    PFD #1: May 2023\n    ACE #2: May 2023\n    PFD #2: Jun 2023\n    DECISION: June 2023 (1 connected, 1 deferred for \"development\")\n    Denied: July 2023\n    Requested HLR: Aug 2023\n    Duty to Assist Error ID'd: Dec 2023\n    Still waiting: 24 June 2024",
            "* Type of claim: New x1, 2x Supplemental, Increase x2, secondary's x2\n* ITF : November 2023\n* Submitted/received date: March 25th 2024\n* Initial review date: March 26, 2024\n* Evidence gathering/review date: March 27, 2024\n* Preparation for Decision date: May 19, 2024\n* Pending Decision Approval date: N/a\n* Preparation for Notification date: N/a\n* Completed date: N/a\n* Misc details: 91 days in total , in PFD for 36 days",
            "Who in 2024 got a completed date is my question and if u got a march date like me dont worry bros we going make it to the finish line",
            "I have an appointment coming up this week and wanted to see if there's anything specific I should do or ask.\n\nETS 2010, currently 30 or 40% disability.\n\nWhen I ETS they said my back, hips, and knees were not service connected and I'm hoping to get that changed.\n\nI was airborne but didn't go to the doctor while I was in for either of the items."
        ]
    },
    "VA added Obesity to my claim": {
        "title": "VA added Obesity to my claim",
        "score": 207,
        "url": "https://i.redd.it/ch3zkm330d9d1.jpeg",
        "content": "I originally filled an increase for migraines & new claim for sleep apnea secondary to PTSD. Noticed today that they added a claim for obesity secondary to PTSD. Has anyone had this happen before and what was the outcome? thanks for any insight ",
        "num_comments": 155,
        "comments": [
            "Sick burn 🔥lol. Joking, actually sounds like they hooked you up",
            "Congratulations fatty!\n\n\\- Another fatty",
            "Obesity can’t be service connected for a rating but it can be used as a intermediary step so that is probably why it was added",
            "PTSD > obesity > OSA \n\nIt’s about the only way to get it connected without in service diagnosis that i have seen.",
            "OP: “but, I’m not obese…”\nVA: “Well… you’re looking a little fluffy, let’s just call it stress eating.”",
            "Man you need to go buy a lottery ticket today. I’m on claim #4 now trying to get them to understand this same nexus, so far they’ve basically just refused to acknowledge it. Hope the claim falls into place for you.",
            "Sounds like they're throwing you a bone",
            "Obesity is an intermediate step to another disability and is not a condition that can be service connected ,rather works as a secondary \nEx. Backpain intermediate step obesity because of weight gain the secondary sleep apnea. Needs to be properly written out a self-statement 21-4138  how the direct condition manifested and created xzy intermediate step as a secondary xyz. It will also help if you can get your primary Dr to write a Nexus letter with at least as likely as not. Submit as evidence and will help c&p examiner to properly rate your condition.",
            "That's cold",
            "The VA can add conditions to your claim?"
        ]
    },
    "What did you do/buy, or who did you tell when you first found out about your rating?": {
        "title": "What did you do/buy, or who did you tell when you first found out about your rating?",
        "score": 46,
        "url": "https://www.reddit.com/r/VeteransBenefits/comments/1dqybl5/what_did_you_dobuy_or_who_did_you_tell_when_you/",
        "content": "Genuinely curious about what others did once they found out their ratings. Taking the advice of those in this sub I’ve only told my spouse. And the first thing we bought was the nice pair of running shoes that had been sitting in our Amazon cart for months! ",
        "num_comments": 132,
        "comments": [
            "Paid off the bills I accrued while waiting for the VA.",
            "Immediately enrolled in healthcare and called the emergency nurse and she got me back on my diabetic meds and other meds. It was like a huge weight lifted off my shoulders to be able to get my diabetes under control again.",
            "I rented an apartment so I could get off my friends couch. Then spent a month nesting and catching up on sleep. Then I bought a PS5. :)",
            "Only my wife knows my rating, and nobody else will ever know it, no matter what. When I got my back pay, we caught up on all our bills and I paid off quite a few items and really boosted my overall credit. We are very close to being debt free. I was at the same rating for 12 years and we struggled a bit during that time, and recently at the beginning of this year jumped up significantly. If my TDIU case is approved, I will pay off the remaining few debts, and put a chunk into our retirement savings, and the rest hold onto for whatever may come up. We have never gone crazy and bought a bunch of crap, or spent too much on ourselves. 90% of the time we treat our kids to nice things like amusement park trips and such. My wife and I, hardly ever spoil ourselves, unless it includes our boys.",
            "I bought a brand new 1995. Ford Explorer limited., And took a trip 6 months to central and south america But it was a long fight against the v. A and I received 12 years worth of back benefits, so I think I'll deserve it.",
            "I’m pretty open with my rating. Cause my family and friends knew what I dealt with in the military. From my perspective nobody cares and if they are jealous I wouldn’t give a shit anyways. 🤷‍♂️",
            "Immediately invested my back pay into a wealth account. All of it.",
            "I told the wife as soon as she got home from work. We paid off our car, some credit card debt, went on a small vacation and pocketed the rest into savings. \n\nThe wife told my sisters and her side of family as well, only because we knew they wouldn't be mad or jealous. \n\nFor most ppl it's not the same story and they usually don't tell anyone about their disabilitiy compensation. \n\nAfter going through many therapies, sleepless nights etc. I finally got on meds for PTSD. I then chose to pursue a career in nursing. I was a diesel tech for 14 years, physically couldn't do it anymore.",
            "My mother-in-law had a stroke. She lives overseas, no insurance. So I paid her hospital bill. So it goes.",
            "I was homeless, so I got into an apartment and bought a truck"
        ]
    },
    "Chevron overruled; what it means for the future of veterans' benefits": {
        "title": "Chevron overruled; what it means for the future of veterans' benefits",
        "score": 239,
        "url": "https://www.reddit.com/r/VeteransBenefits/comments/1dqljkk/chevron_overruled_what_it_means_for_the_future_of/",
        "content": "I don't suppose today's Supreme Court decision overruling *Chevron* will be on many peoples' radar today, especially in regards to the VA; but here is why it matters. Take a look at the screenshots from a concurring opinion by Justice Gorsuch. He cites an example of a veteran who lost his appeal in the courts because the courts gave deference to the VA's denial based on *Chevron*'s requirement that courts simply defer to agency interpretations under most circumstances. And since the VA is in the habit of making many self-serving policy interpretations that disfavor claimants, this necessarily results in many veterans losing benefits that the law almost certainly says they're entitled to. I suspect that today's decision will open the floodgates of veterans' appeals being heard and decided favorably in the courts going forward. Let us all hope so!\n\nhttps://preview.redd.it/2sqtxtwctb9d1.png?width=435&format=png&auto=webp&s=ed3d0dbe8f8e9937e567f897072da10398323b25\n\nhttps://preview.redd.it/ilrlehedtb9d1.png?width=444&format=png&auto=webp&s=c429e6b1d4fc74885bcb3ce2536e6f0e7d616064\n\n",
        "num_comments": 191,
        "comments": [
            "I’m still lost what exactly does it or doesn’t it do?",
            "Can someone explain this correlation like I'm 5",
            "You all think cycle times were long for claims before... get ready. Also this impacts how long the VA will need to implement new laws. The current process of OGC review, reg writing, notice and comment rulemaking, reg revisions, and implementation takes years now. Under this new scheme, OGC will likely have to defer to a federal judge to clarify any ambiguity.",
            "This is in no way a good thing...",
            "Not good. Conservatives loved it back in 1984 when chevron was established but, now they don’t want it. So they got what they wanted from the S Court.\n\nBusiness, corporations will benefit from this, not us or any common folks. \n\nOh well.",
            "Lol I will never understand how some yall (who aren't rich) believe these people (who are insanely rich) want to dismantle the government, not to fill their own pockets of course not but instead to help you (the person who isn't rich). Lol make it make sense.",
            "It's a HUGE deal. Thanks for sharing\n\nhttps://preview.redd.it/605o042a2c9d1.png?width=1566&format=png&auto=webp&s=6dd62f54fc1ab0cc8ae414edee2df3a976a437dd",
            "Wouldn’t overturning Chevron make it harder for veterans to get disability benefits?\n\nDoesn’t it give courts more power to question decisions, potentially leading to stricter interpretations of laws and regulations and mean more denials or delays for veterans seeking benefits?\n\nIf I understand it correctly, didn’t the Chevron deference give agencies leeway to interpret ambiguous laws. Now courts might favor stricter readings, making it harder for veterans to qualify for benefits under existing laws leading to more and more appeals which could take years and years and soooo much money which is what some legislators want - if you can’t afford, monetarily or because of a terminal disease, to keep fighting you’ll stop. \n\nAnd legislators might hesitate to create new policies that benefit veterans, because they want to control discretionary spending, healthcare specifically,that a lot of vets rely on. \n\nI don’t know if this is a good a thing as we think.",
            "Exactly how would this benefit Veterans?",
            "But isn’t every law ambiguous and open to interpretation?"
        ]
    }
}