{
    "My hero.": {
        "title": "My hero.",
        "score": 146,
        "url": "https://i.redd.it/r3hayicfqe9d1.jpeg",
        "content": "Found this gem on the ground in Millstream Village (I swear I wasn't served), and I'm in love.  I need a box of these, to be refilled regularly.  Touché, whoever spent money to make these.  🤌🏼",
        "num_comments": 28,
        "comments": [
            "The thing I think of every time I see one of these cards posted are the cases where people are forced to park out of the lines due to the person next to them parking incorrectly. But for egregious stuff I think it's alright.",
            "I really don’t understand why so many people don’t give a shit about the polite rules of driving. Parking, turn signals, not speeding through residential areas…etc",
            "Business cards are very cheap to buy. You can custom design them.",
            "I want a stack of these please",
            "A five year old can’t drive!",
            "OP Don't Lie, with fingers like those we know you are driving a RAM and taking 3x parking spaces.",
            "I would love it if there was a person attributed to the quote. \n\nLike \n-your parents at your wedding\n-your 11th grade teacher \n\n\nSomething like that.",
            "These card, and then there is a parking turtle XD",
            "My SIL got something similar off of a Temu!",
            "Sounds like Victoria."
        ]
    },
    "An octopus at the Ogden Point Breakwater this morning": {
        "title": "An octopus at the Ogden Point Breakwater this morning",
        "score": 388,
        "url": "https://v.redd.it/udtikshp6c9d1",
        "content": "",
        "num_comments": 32,
        "comments": [
            "I saw several at the breakwater last year, but this is the first one I've seen this summer.",
            "This is the content I’m here for 🧡",
            "Jealous! I keep hoping to spot one of these glorious squishies. So far I've only seen a jellyfish. Wrong squishy.",
            "Octopus🐙 Watch, 2024!",
            "That’s so cool! Thank you for sharing this video.",
            "I walked the breakwater probably 30 times in the summer of 2008 and all I saw were jellyfish and and a baby sea otter. I got ripped off!",
            "Friend",
            "I saw one last summer, the very first time I went out on the breakwater! But guessing lightning won't strike twice. 🙃",
            "Ogtapuss!",
            "Lucky! I heard from Rockfish Divers that his name is Hank."
        ]
    },
    "Five Storeys of Supportive housing for 56 people opens in Victoria at 953 Balmoral Road": {
        "title": "Five Storeys of Supportive housing for 56 people opens in Victoria at 953 Balmoral Road",
        "score": 76,
        "url": "https://www.cheknews.ca/supportive-housing-for-56-people-opens-in-victoria-1211841/",
        "content": "",
        "num_comments": 32,
        "comments": [
            "I'm 2 blocks from the supportive housing for young adults building on Meares near Cook. 48 units for 19-27 years old. It's operated by Beacon Services through BC Housing and opened October 2023. Some pearl clutchers in my building started a Block Watch prior to the opening fearing the worst. I've noticed zero difference in the area since. EDIT. Should clarify, I've noticed zero negative impact from supportive housing.",
            "Great news! 56 people in Victoria get housing security. I can't imagine the feeling these people would get from that",
            "“Having a safe place to lay your head at night is something everyone deserves, and we know that when people have stable housing with supports they can start to rebuild their lives and enjoy contributing to the community,” Ravi Kahlon, minister of housing said in a news release.\n\nHe's correct. These rooms mean that 56 more people each night can have a place to sleep, to recover, and to start rebuilding. Those of us who have always had that don't truly understand how important and valuable that is. I'm glad this is happening. I only wish there was a way to safely provide this sort of service to all who are currently without a place to stay.\n\n\"Cool Aid Society will operate the building and will provide 24/7 staffing, meal programs, life skills training, employment assistance, health care referrals and wellness support, and connection and referral to community services and support groups.\"\n\nGood, leave it with the people who know how to provide these services. I particularly like the idea of life-skills training being an inherent part of the building. I'm a big education guy, so seeing this here, as well as similar services at that new proposed building for those just leaving the prison system... I like where this is all heading. I just want more, please.",
            "I put my name in for it, seriously hoping and praying I can get in, I’ll take anything. Tired asf of being in a homeless shelter.",
            "I understand something needs to be done, and we desperately need more housing. But for this project the province spent $345,000 per person, just in construction cost alone. Not including support services and building maintenance going forward.\n\nIn terms of cost per individual helped, these kinds of housing projects must be one of the least efficient programs the province has to offer. \n\nI honestly don't know what the answer is, and I'm not even necessarily against this project or ones like it, but... Damn that's a lot of money for only 56 people benefitting from it. You could have given $10,000 to every single homeless person in Victoria for the cost of just this building.",
            "I lived beside supportive housing for years that was reserved for those with substance use issues, mental health crises or who had experienced homelessness. Never had a single issue, aside from my cat doing daily stare downs with the cats in their building.\n\nThe neighbours in my building were worse.",
            "No surprises. Housing first works. It ain't perfect but it's the best we got.",
            "Ty for posting this. We never hear this side of the story so the narrative continues about supportive housing brings crime and unsafe conditions",
            "> I've noticed zero difference in the area since.\n\nSounds like you owe the block watch a thank you!",
            "I got an opportunity to tour the building the other day. It's well designed and set up, units have crazy high ceilings and are quite nice. Definitely a huge step up from a sidewalk."
        ]
    },
    "Run-by Recycle Kicker": {
        "title": "Run-by Recycle Kicker",
        "score": 31,
        "url": "https://www.reddit.com/gallery/1dqz8xc",
        "content": "Random guy ran across the street, decided to kick my blue bins onto my yard, and keep on running...",
        "num_comments": 43,
        "comments": [
            "A blue bin killed his father",
            "I’ve never bin that angry before.",
            "I actually laughed out loud at this. Like, why?",
            "This is like the opening of Trainspotting. \"Choose your future. Choose life.\"",
            "Just helping to keep the sidewalk clear for those less mobile.",
            "Take your bins off the sidewalk, maybe?",
            "big angy",
            "Lolol fuk those bins",
            "Somebody took all his cans",
            "Oh no"
        ]
    },
    "Airbnb operator says he’s facing losses of hundreds of thousands of dollars because of B.C.’s new short-term rental laws": {
        "title": "Airbnb operator says he’s facing losses of hundreds of thousands of dollars because of B.C.’s new short-term rental laws",
        "score": 183,
        "url": "https://metropost.us/airbnb-operator-says-hes-facing-losses-of-hundreds-of-thousands-of-dollars-because-of-b-c-s-new-short-term-rental-laws/",
        "content": "",
        "num_comments": 233,
        "comments": [
            "This article reads weird.  It is dated June 23rd 2024, but it appears to have been written well before this date.  For example:\n\n> “(The legislation) doesn’t come in until May 1, so individuals do have some time, whether they want to rent them out for long-term or whether they want to sell them,” said Kahlon Tuesday.\n\nUm, the legislation came into force on May 1st 2024, nearly 2 months ago.",
            "So the laws are working.",
            "TL:DR: moron invests in a short term rental business while the government is actively discussing the banning of said business practice. Moron is then surprised when his lack of market research lead to him overpaying on a residential property. \n\nThat being said I looked at the photos of the apartment it looks amazing.",
            "Maybe he shouldn't have bought property he couldn't afford to pay for. He could probably have been able to cover the mortgage if he stopped buying avocado toast and take out coffee. He should be making sacrifices and not going out to eat. He needs to better manage his finances.\n\nThis is what people tell those who are struggling to buy one home, which they want to live in. I have no sympathy for people who bought a second, third, etc, property with the intent to profit.",
            "Is that the world’s tiniest violin I hear?",
            "🎻",
            "I have noticed an increase of tenancy rentals where we are but many are furnished!!   These fucking fuckers.",
            "Awww boo. Someone thought investments always went up and didn't consider the entirely foreseeable regulatory risk during their due diligence and risk assessment.\n\nIf we combined the amount of extra rent people have to pay due to AirBNB's I bet it would be a lot higher.",
            "When people invest money in the stock market, they know it's a gamble and there's no guarantee of a return. Yet somehow, when it's housing investments, people feel so entitled that it should be a guarantee. \nYou took a risk, you lost, move on. Government should not compensate for these losses. When it comes to a public good, its hard for many to sympathize with this, when we know someone else's profits are coming directly at our own expense.\n\n*And renters aren't being compensated for skyrocketing rents, thanks to businesses operating in a fashion that increases pressure on the housing supply (*ie: degree mills, Air B&B, Canada's current immigration exploitation industry).",
            "No sympathy here. I just received a 3.5% rent increase on my overpriced apartment which already costs 2 weeks salary per month. Whose idea was it to make it so high?"
        ]
    }
}