{
    "What Cameras Are You Shooting On? Click Here for Camera Recommendations! - Q1 2024": {
        "title": "What Cameras Are You Shooting On? Click Here for Camera Recommendations! - Q1 2024",
        "score": 22,
        "url": "https://www.reddit.com/r/videography/comments/17u6li0/what_cameras_are_you_shooting_on_click_here_for/",
        "content": "# So… what y’all shooting on?\n\nThe purpose of this post is to create a public repository of what cameras videographers are using to do their work.\n\nThis is to help newbies and pros alike figure out what their first or next camera should be, and to help cut down on repetitive questions on the subreddit.\n\nThis is a very experimental system. ‘Mega threads’ on this topic have not been very effective in the past as they end up being a thread full of questions and no answers. We’re trying to flip the idea on its head and have a thread full of answers instead!\n\n## Guidelines for posting\n\n* All top level comments in this post must be discussing a camera you’re using (or have used) - any other comments will be removed\n    * you can make multiple comments for different cameras if you like\n    * if someone has already recommended your camera, we would prefer if you added your information as a reply to that person rather than a new comment\n* You are welcome to show off your videos, website, showreels, case studies, reviews, and anything else that demonstrates the camera in use\n    * please be clear which parts are shot using the camera you’re discussing\n* Include the price you paid for the camera if possible\n    * please be specific about the currency used\n* Tell us what kind of content you’re shooting\n* feel free to list lenses and any other equipment you’re using\n* **No affiliate links in comments!**\n    * if you have them on a website you link to, that’s fine *as long as the page clearly discloses they are affiliate links*\n\n**This post will be renewed every quarter** and archives of previous discussions will be made available.\n\nComments in this post are in ‘contest mode’ so the order they are displayed is randomized.\n\n### Huge thank you to anyone who contributes - you’re helping the greater community!\n\n---\n\n# I’m Looking for a Camera\n\nWe allow [posts to the subreddit](https://www.reddit.com/r/videography/submit) with camera buying advice, but ask that before doing so that you...\n\n## Have a look through the comments of this post\n\nThe purpose of this post is for /r/videography members to share what cameras they're currently shooting on, share examples of their work, and give you a way to talk directly to an actual user of the equipment.\n\nWe have a very diverse membership on the subreddit covering many niches, so over time we're hoping you'll be able to find recommendations and discussion that helps you make an informed decision.\n\n## Search the subreddit!\n\n/r/videography has over a decade of information, though Reddit doesn’t make searching easy.\n\nA useful trick that typically gets better results than Reddit’s own search bar is to add the following to a Google search:\n\n    site:reddit.com/r/videography\n\n## Try the Discord\n\nWe have a very active Discord:\n\nhttps://discord.com/invite/d65kgBn\n\nYou’ll usually get a quicker answer asking there than here!\n\n## /r/videography Camera Buying Guide\n\nThis is a placeholder!\n\nThe mods are currently working on a guide for camera selection with some general recommendations at various budget ranges.\n\nThis post will be updated once that guide is ready - ~~it might take a few weeks~~ longer than expected, will try to get *something* up for the Q2 post.\n\n## Still can’t find what you’re looking for?\n\n###Fill out the following form and **[post it to the subreddit by clicking this link.](https://www.reddit.com/r/videography/submit)**\n\n**Important!**\n\n* Please [post your question to the subreddit](https://www.reddit.com/r/videography/submit) - not as a comment to this post.\n* If you’re posting from desktop Reddit, please enable ‘Markdown Mode’ when posting\n* Select the ‘Camera Recommendation’ post flair\n* **Only** edit the text in {braces} - you can remove the braces!\n* Do not remove or change any other text in the template - if you don’t have an answer for a question, leave it blank but don’t edit the question text.\n\n*Your post will be removed if you do not follow the above instructions.*\n\n    #Camera Recommendation Form\n    \n    ##Budget\n    {Add your budget here.}\n    {Please specify your local currency!}\n    \n    ##What are you using it for?\n    {describe your use case for your camera.}\n    {tip: link to some content or videos}\n    {that are similar to what you want}\n    {to create.}\n    \n    ##How long do you need to record for?\n    {Recoding time is a limiting factor}\n    {for many cameras!}\n    \n    ##What equipment do you already have?\n    {Knowing what you’re used to}\n    {will help you get better advice.}\n    {Sometimes a new camera isn’t}\n    {the best way to improve your}\n    {results, and your money would}\n    {be better invested elsewhere}\n    \n    ##What software do you edit in?\n    {pro cameras often require pro}\n    {software to work with their footage.}\n    \n    ---\n    \n    {please add any other notes}\n    {or comments that you think}\n    {are relevant here.}\n\n\n\n###**[Reddit Mobile users click this link to get the template](https://pastes.io/xzka1hpnlk)**\n\n^(Thanks Reddit for making it almost impossible to copy text in the official app...)",
        "num_comments": 183,
        "comments": [
            "I’ll preface saying I know nothing about video recording. I am looking at a GoPro, but before I jump in I want to make sure it will fit my use case. I want to record my family’s camping and 4wheeling trips, specifically because we are finally taking my 8 year old up. She has seen the outdoor boys and she is psyched about going and having memories to look back on. \n\nWill that be enough for car rides, setting up camp, cooking and hanging out at the fire at night? I don’t need it to be pro quality, just better than a shaky shot taken from my iPhone.",
            "Looking for a rec for shooting High school basketball/track for my nephew. Currently using my iPhone 14pro. I have been looking at the fx30. I have the a7III, but want 60fps for the sports. Wondering if I am better off sticking with the phone, or if the fx30 is worth the jump in price. The zoom ability is garbage on the phone so I tend to stick with 1x and crop it when editing, its ok and works, but it would be nice to be able to zoom in more (would need new lens) The battery life on my phone pushes it close when he has back to back basketball games, I can make it, but it would be nice to not worry about battery life as much, sometimes he plays 2 back to back 40 minute games, I usually record each half (20 mins) at 4k60. Open to any other suggestions, just kind of curious.",
            "I was gifted a Canon XA-10 that I am using primarily, just getting started in shooting and editing. I mostly do home-video sorts of things with my kids, and recently started working on some various promo videos for my local Fire Department.\n\nI always wanted to like editing, and also forced myself to use iMovie because it is free and plenty of people seem to do fine with it. I am not one of those people. I recently switched to DaVinci Resolve (free), and now I actually find joy in the editing process.",
            "Canon C70.    The more I use it, the more I love it.   I use with a Tilta cage and sennheiser wireless mics.  I love that I can adapt 4 professional wireless mics at once if needed.    Some hate the 35mm form factor although I love that aspect.   It works great with EF and RF lens's.    I sometimes use the EF system which gives an extra stop, which works great in low light.   I love how crisp and clean the blacks look.    Internal Raw and Clog 2.    I'm putting on blinders on new camera's and will just keep using this camera... at least for another 5 years or so.   Every time I load the footage into premiere I'm impressed at how comparable it is to the 35MM film I used to shoot back in the day.",
            "Continue shooting (video/stills) on a Sony A7 or upgrade to something else under $1500 with a kit lens, orrrr buy a nice lens for the Sony a7?",
            "For anyone that does top down videos, what camera do you use to obtain a crisp quality when you zoom in on the workbench where you have your project?",
            "Canon® HF-G10, HF-G20, HF-G30, HF G60, Panasonic® Lumix® GH4, GH5 & GH6, Panasonic® HC-X1500, Sony® NEX-5n and Sony® A6000, A6300 and not necessarily in that order. ☝🏽😉",
            "I shoot with the Sony A7c.",
            "Hi, I have been doing photography for 6 years and recently wanted to learn videography too. I have a Canon 90D and had shot some videos on it but it doesn’t have log, so I’ll keep it as my photography camera. I’m looking for a camera to shoot video, not bulky, budget and has log so I can learn colour grading. I wish to document my travels and my life this year in a cinematic video form. I heard that Sony has some good video cameras. Is there any good cameras from Sony or other brand that I can learn video with?",
            "I'm mainly working off of an URSA 12K and 2x Sony A7SII's. Upgrading this winter."
        ]
    },
    "Trying some unique POV shots with a teeny camera": {
        "title": "Trying some unique POV shots with a teeny camera",
        "score": 583,
        "url": "https://v.redd.it/lpcwol6znc9d1",
        "content": "",
        "num_comments": 67,
        "comments": [
            "Looks great, what is that little camera?",
            "Awesome sequence, super nicely lit too 😍",
            "Didn’t expect the insta360 GO 3 to look so good in relatively low light",
            "I like the track, who is it?",
            "How did you get the locked off shot for the cartridge and cable? Did you just use the insta360 pole removal? Attached to your hand? Use your hand to obscure the pole? I need to know.\n\nController looks like it's attached off frame but the cartridge moves differently.",
            "This is awesome and inspiring. Love it",
            "That was actually really cool what camera is that",
            "What smoke/fog/mist machine did you use? Looks awesome! Great work.",
            "Fun! Go work for an ad agency lol!",
            "Recently picked up ones of these, it's dope. What arm are you using?"
        ]
    },
    "Beverly Boy productions dont pay me": {
        "title": "Beverly Boy productions dont pay me",
        "score": 10,
        "url": "https://www.reddit.com/r/videography/comments/1dr6q41/beverly_boy_productions_dont_pay_me/",
        "content": "Some weeks ago we had a almost similar Post here.\nThey are now 40 days late to me the rest of the 50%\nThey owe me 1300€.\nI hope they will pay me soon.\nSean from Accounting answered my questions very fast.\nBut I dont understand why its so hard to Transfer money in 2024.\n\nI worked with the Departement in California. \nI am in Germany. ",
        "num_comments": 15,
        "comments": [
            "They paid me like 30 days late, they suck.\n\nI had someone tell me recently that interest rates are so high some production companies are keeping all their money in high interest accounts and not wanting to pay out to keep collecting interest and letting us be hurt over it. My friend had Fox pay him like 100 days late",
            "Honestly, I've had this happen twice to me with the same company. Net 30 sucks ass, so it double sucks when the payment is late.\n\nStill waiting on a check now actually lol.",
            "Pick up the phone and call them",
            "How come you work for them as german editor? Did they hire you over a plattform like fiverr or upwork?",
            "What were the payment terms in your contract?",
            "Thanks mods for being vigilant on keeping the post up. Wild there was a successful campaign to take the previous post down. Hopefully their name is flagged in Reddit searches.",
            "It will be interesting to see if this post also gets mass-reported.",
            "Time to threaten to take them to small claims court then.",
            "If you we make another one as well about the Mass reporting.\nMaybe my lawyer finds this interesting",
            "Yes I am in contact with them.\nI phone them yesterday.\nBut first I will contact Tavares the company owner and ask him why Sean from Accounting forgot to pay me."
        ]
    },
    "Recently been working some more festivals and events and I wanted a showreel to reflect that. Critique welcome!": {
        "title": "Recently been working some more festivals and events and I wanted a showreel to reflect that. Critique welcome!",
        "score": 2,
        "url": "https://vimeo.com/970599520?share=copy",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "Live concert, loud, camera search, current": {
        "title": "Live concert, loud, camera search, current",
        "score": 1,
        "url": "https://www.reddit.com/r/videography/comments/1dra80p/live_concert_loud_camera_search_current/",
        "content": "I am currently just using my Samsung phone, but like to shoot live concerts, from front row, but audio is rather poor. Video is somewhat OK. Tried <$300 units from Amazon and audio is unbearable, but video fine. Suggestions? \n",
        "num_comments": 0,
        "comments": []
    }
}