{
    "Announcing a ban on AI generated videos (with a few exceptions)": {
        "title": "Announcing a ban on AI generated videos (with a few exceptions)",
        "score": 1917,
        "url": "https://www.reddit.com/r/videos/comments/1cg9nud/announcing_a_ban_on_ai_generated_videos_with_a/",
        "content": "Howdy r/videos,\n\nWe all know the robots are coming for our jobs and our lives - but now they're coming for our subreddit too.\n\nMultiple videos that have weird scripts that sound like they've come straight out of a kindergartener's thesaurus now regularly show up in the new queue, and all of them voiced by those same slightly off-putting set of cheap or free AI voice clones that everyone is using.\n\nNot only are they annoying, but 99 times out of 100 they are also just bad videos, and, unfortunately, there is a very large overlap between the sorts of people who want to use AI to make their Youtube video, and the sorts of people who'll pay for a botnet to upvote it on Reddit.\n\nSo, starting today, we're proposing a full ban on low effort AI generated content. As mods we often already remove these, but we don't catch them all. You will soon be able to report both posts and comments as 'AI' and we'll remove them.\n\nThere will, however, be a few small exceptions. **All of which must have the new AI flair applied** (_which we will sort out in the coming couple days - a little flair housekeeping to do first_).\n\nSome examples:\n\n- Use of the tech in collaboration with a strong human element, e.g. creating a cartoon where AI has been used to help generate the video element based on a human-written script. \n- Demonstrations the progress of the technology (e.g. [Introducing Sora](https://www.youtube.com/watch?v=HK6y8DAPN_0))\n- Satire that is actually funny (e.g. [satirical adverts](https://www.youtube.com/watch?v=qSewd6Iaj6I), deepfakes that are obvious and amusing) - though remember Rule 2, NO POLITICS\n- Artistic pieces that aren't just crummy visualisers \n\nAll of this will be up to the r/videos denizens, if we see an AI piece in the new queue that meets the above exceptions and is getting strongly upvoted, so long as is properly identified, it can stay.\n\nThe vast majority of AI videos we've seen so far though, do not.\n\nThanks, we hope this makes sense.\n\n**Feedback welcome! If you have any suggestions about this policy, or just want to call the mods a bunch of assholes, now is your chance.**",
        "num_comments": 288,
        "comments": [
            "I, for one, welcome our new Human overlords.",
            "Why is there not just a general \"no low quality video\" rule? Shouldn't all low quality posts be removed? ",
            "I'm good with low effort spam, AI or not, being removed.\n\nPlus, there should be an AI tag.",
            "And it was in this day… we struck back.",
            "How long until we can’t distinguish do you think. A year?",
            "Good mods.",
            "Great, lots of other subreddits should also follow suit. I’ve had to unsubscribe from a few that were getting overwhelmed with low quality AI content",
            "You're a bunch of assholes. I don't actually mean that but I didn't want to miss out on this opportunity.",
            "Thank you!",
            "I will say what I've said in every sub I'm a member of that has proposed similar: banning low-effort, content that contributes nothing to the sub is a great idea. Trying to do so by specifically targeting AI generated outputs is a mistake for many reasons:\n\n1. The need to carve out specific exceptions to the AI rule in your OP makes it clear that AI itself is not the problem, just another vector for low quality.\n2. The quality of AI generated results in any given genra or medium is going to start out poor and grow better with time (c.f. *Will Smith Eating Spaghetti* from a year ago.) The baseline AI generated video will probably be better than most of the content out there in 10 years and it will be a continuous gain until then.\n3. Low quality is hardly difficult to find, AI or not. (c.f. *Jim Cornette on Chris Jericho Thinking He Was Abducted By Aliens*, and *This video only has 300 views... Please explain*, posted an hour ago and two hours ago respectively)\n\nSo you end up adding more bulk to the rules while adding little or no value in terms of their aplication.\n\nHere's an alternate proposal that I think gets you everything that you want:\n\n### Rule #n: Baseline quality\n\nAll posts must involve some recognizable element of effort and quality. Videos that have no original elements, audio or video that is too low quality to be intelligible, or do not advance any recognizale infoformation, commentary or satire will be deleted. Exceptions will be made in exceptional circumstances, but this is the \"you must be this tall\" for this sub.\n\nThere you go."
        ]
    },
    "LeafGuard messes up elderly couple's home, offers measly $15k settlement, and asks them to remove the video.": {
        "title": "LeafGuard messes up elderly couple's home, offers measly $15k settlement, and asks them to remove the video.",
        "score": 4935,
        "url": "https://www.youtube.com/watch?v=ST5Hk8Tu6PY",
        "content": "",
        "num_comments": 504,
        "comments": [
            "My grandma is 90 years old with early dementia. She wanted to get new gutters and wanted the independent choice rather than allowing my mom to work with the contractors, so she got LeafGuard gutters. Her house is basically a square with 2 gutters, each around 50ft. They charged her $20,000 for the work. Compare this to my house that has a very complex gutter arrangement without gutter guards and I paid $3000 for our first set of gutters and $4000 for the second set after years of inflation.",
            "\"The buy today only discount\"... yeah, never do business with anyone offering that. Sleezy salesmen 101 sales tactic to create false urgency and pressure you to sign before you have time to think or research. LeafGaurds are also trash and a waste of money.",
            "I tried to get a Leafguard reseller to give me an estimate over the phone.  I just wanted to know the ballpark if it was even reasonable to consider.  They insisted there was \"no way\" to estimate without a site visit.  I said \"It's 200 linear feet in 3 sections, 4 downspouts\", they said \"there's a lot more to it than that\".  so I asked \"what is the per foot cost of just the gutter\" and again \"we don't price it that way\"\n\nso I had them come out, took a day off work, and the guy measured and handed me a quote that said \"200 feet, 4 downspouts:  $30 per ft\".  total was almost $6000\n\neven if they weren't gut punchingly overpriced, I wouldn't have done business with them just for jerking me around on estimating.",
            "Leaf Guard and similar seem very dodgy to me. You can get your gutters cleaned every year for the rest of your life for a fraction of what they are charging people for some plastic or wire screens that don't really do much to solve the clogging problem. They advertise so heavily on TV, etc., that they must be raking in big profits.",
            "\"The finish has got to wear in\" - what the fuck does that mean?",
            "Not knowing how much gutters go for I was so close to paying $10k for new gutters. Looked up gutter pieces as soon as the slimy salesman slithered out the door and called to cancel 30m later. Got new gutters for only $3500 and they're great",
            "We got the EasyOn Gutter Guards from Costco for our house. I think I spent like $300 in total for all of the guards. Went right on top of my existing gutters. They work great. However, you DO have to make sure that you bend the screen material according to your roof pitch. There is a guide to tell you how much. And you do have to sweep them off once a year. They even gave us a free stiff bristle brush for cleaning them off. The big gotcha is valleys. I used some flashing to create some diverters so that they water funneling down the valleys would divert to either side of the gutter instead of overwhelming the screen material and flowing over them. It's not perfect, but it works good enough. They do sell diverts specifically for this problem, but they seemed rudimentary enough for me to fabricate my own. Highly recommend the guards from Costco, and I can't believe LeafGuard charges thousands for something you can do for hundreds on your own. Straight up highway robbery.",
            "I had a LeafGuard salesman give me an estimate a couple years sgo. He took two hours of my time, then wouldn’t give me a firm bid if I wasn’t willing to sign a contract that day. A couple days later, he called and left a message for someone else who was apparently on his potential client list, which I thought was either inept or sketchy. The shit icing on the LeafGuard cake was when, about a week later, the salesman opened my front door and poked his head into my house, claiming he was on an estimate visit at another house in the neighborhood and wanted to check in with me. I really let him have it and kicked him off my property. Seems like a dodgy af company.",
            "I had a leafguard salesman come to my house to give an estimate. I told him upfront I expected it would cost about $3k (you should never do this, but I wanted to gauge how much integrity they had). Somehow he comes to an estimate that (with an applied 30% \"discount\") was $3150, but he offered me exactly $3k if I could sign on the spot. Should tell you about the integrity of their salesmen that they came to the exact number I threw out. They don't set a fee based on estimated materials and labor, they just try to get how much they think they can from you.",
            "I took a sales position selling *Gutter Helmet* , *it's* absolute garbage. I learned quickly it doesn't work if it's dirty, due to no surface tension. So you don't technically have to clean your gutters twice a year, but you do have to clean the system. If you have a house without trees over head they work great, but then what's the need. I also learned the home improvement company that hired me changes their name every few years to avoid warranty's. I quit within 3 weeks, worst job I every had, and I grew up working on farms.\n\n*edit*"
        ]
    },
    "40 years after starting his Hip-Hop career, Rakim drops this fresh cut off an upcoming album": {
        "title": "40 years after starting his Hip-Hop career, Rakim drops this fresh cut off an upcoming album",
        "score": 434,
        "url": "https://www.youtube.com/watch?v=sGpxTtDJU3s",
        "content": "",
        "num_comments": 55,
        "comments": [
            "If you listen to all rap from 1979 to 1987, Rakim is the point where it suddenly sounds modern. It sounds actually like a different kind of thing.",
            "I am here for the greybeards era.",
            "DOPE AF!   \n2024, and Still thinkin' up a master plan....",
            "Finally some good fucking music",
            "Deltron vibes. Or, did Del have Rakim vibes?\n\nYeah, that one.",
            "He hasn’t missed a step. I saw him open for a Wu-tang concert years ago and he held it down with ease.",
            "He should’ve called this come back “It’s been an even longer time”",
            "God I miss this kind of hip hop and not what is generally being produced these days.",
            "1980’s clean AF today, all I got.",
            "It's so good.  Three absolute legends just tearing it up."
        ]
    },
    "Dueling porch pirates fight to steal package outside home": {
        "title": "Dueling porch pirates fight to steal package outside home",
        "score": 169,
        "url": "https://youtu.be/WDCKCKO3s-8?feature=shared",
        "content": "",
        "num_comments": 156,
        "comments": [
            "I just don't get how some problems exist in the US.",
            "What’s worse is the homeowners were home. What happened to ringing doorbells and physically giving the package to someone?",
            "A lot of shipping warehouse people tip their friends about certain kinds of packages.",
            "The depravity is amazing, not even waiting fo the delivery man to leave before pouncing on the package.",
            "What gets me is the size of the box. Every time I've ordered a phone, it's been in a small box that can easily fit in my mailbox. The fact that these guys were parked and waiting and then racing each other doesn't pass the smell test. Heck, with certain items now I often elect to pick them up from UPS or FedEx at a dropoff spot, like Walgreens or a UPS store.",
            "Too bad it was a phone. Imagine these dorks duking it out over a Vixen Creations Bandit Vixskin Dildo, Vanilla, 1 Count",
            "They should break both of these guy's kneecaps",
            "this is some yakkity sacks level shit",
            "They were there already waiting, probably following the delivery guy around. And he's like \"HEY!\" and walks off to the next delivery. I wouldn't expect him to contront them about it, but at least call the cops when you notice those guys are following you around. Surely being followed around by thieves all day is dangerous for him as well.",
            "Maybe it’s a kilo of cocaine drop ship"
        ]
    },
    "Bo Burhnam - Can't Handle This": {
        "title": "Bo Burhnam - Can't Handle This",
        "score": 69,
        "url": "https://www.youtube.com/watch?v=rYy0o-J0x20",
        "content": "",
        "num_comments": 14,
        "comments": [
            "This performance is equal part hilarious and cathartic, but it gets even better with context. Bo was having constant panic attacks on stage and AFAIK this was his last live performance before quitting for years up until resurfacing again with the amazing 'Inside' music special where we finally get the context of why he just vanished.\n\nIt requires a lot of talent and balls to just open up to a crowd like that in a comedy show and no one does it like him.",
            "> steadily declining mental health, and laugh as he attempts to give you what he cannot give himself\n\n🥺 oh man that hit hard",
            "This was the bit where I realised that he wasn't just funny, he's an actual genius.",
            "Damn, that last line is layered and makes me pretty sad.",
            "For me it's Bo best work, it's his Mona Lisa, that song hits hard.",
            "Then once you realize it’s at metaphorical, it hits even harder. Burrito = fame.",
            "A lot of people focus on this song as demonstrating his true feelings and mental health at the time, but he really put himself out there way earlier in [Art Is Dead](https://youtu.be/Eo9pU1q8sy8?feature=shared).",
            "Great video. Bo has the rare comic talent to make you laugh and then think about what he said. \n\nWish him all the best and long and happy life and career in whatever he wants to do,",
            "I hope you’re happy",
            "I can't cry at 6:30 in the morning, please don't."
        ]
    }
}