{
    "Wich game is this for you?": {
        "title": "Wich game is this for you?",
        "score": 1286,
        "url": "https://i.redd.it/yaiozkx6a28d1.jpeg",
        "content": "For me it's Day of the Tentacle (i know, i'm old)",
        "num_comments": 640,
        "comments": [
            "Terraria. I see a clip somewhere and start that new play through.",
            "Skyrim, Resident evil 4, dead space.",
            "tetris",
            "Subnautica",
            "Borderlands 2",
            "Bioshock",
            "Assassin's Black Flag",
            "The Mass effect trilogy, usually when I dig it up I play the entire trilogy and since I have enough of a memory as to how to get the best ending at the end of it all I will force myself to basically 100% all the available missions that have any influence on the future which includes a lot of booking ass around planets just to steal everything on it or do everything on it at least",
            "Sly Cooper and Kingdom Hearts.",
            "FF7 until the day I die"
        ]
    },
    "Say something bad about these games": {
        "title": "Say something bad about these games",
        "score": 211,
        "url": "https://i.redd.it/rn69cfqxg18d1.png",
        "content": "",
        "num_comments": 577,
        "comments": [
            "Zelda: Break of the Weapons",
            "Great at encouraging exploration, terrible at rewarding it.",
            "The weapon durability complaint has been beaten to death, resurrected and killed again so I’ll say large parts of the world feel empty and vacant, and shrines are too easy. They add nothing but busywork. \n\nIMO Zelda was better when there were temples you had to progress through, each one containing an item you needed to finish the rest of it and defeat the boss at the end.",
            "Can't pet the dogs",
            "The weapon durability system can go fuck itself",
            "They barely feel like LoZ to me.\n\n\nInstead of tons of neat items i just have sticks with numbers and durability.",
            "Dungeons are way too short and wayyyyy too easy, i cant wait for them to go back to traditional temples\n\nIf they ever do",
            "Good games. But not the best games of all time as so many people like to claim. Not even the best LoZ games.",
            "Lacks story",
            "Weapons breaking…. That is all"
        ]
    },
    "Legend recognizes Legend": {
        "title": "Legend recognizes Legend",
        "score": 916,
        "url": "https://i.imgur.com/EdbrJPN.jpeg",
        "content": "",
        "num_comments": 40,
        "comments": [
            "Game recognize Game",
            "I stole this art and I don’t regret it",
            "This art begs the question, how would lore accurate Geralt fare in Elden Ring?",
            "Blood and Wine wore the crown well. An honorable end to their reign is fitting.",
            "Santa Monica and CD project red have good sportsmanship.",
            "Cant wait to play it Tonight",
            "That art goes so hard.",
            "So what is it about the DLC that makes it amazing. Is the story more enthralling, is it just another area with more bosses, is it massive? Or are people just stoked because it’s more of a game they love?",
            "Who did Geralt kill in this pic?",
            "Witcher 3 will always be my GOAT."
        ]
    },
    "What video game series becoming good again will make you like this?": {
        "title": "What video game series becoming good again will make you like this?",
        "score": 510,
        "url": "https://i.redd.it/170p77etgy7d1.jpeg",
        "content": "Mine is Pokémon.",
        "num_comments": 650,
        "comments": [
            "Pokemon (been trash for 10+ years)\n\nA good Halo game (good graphics and gameplay cant substitute for good story. Wish 343 understood that)\n\nJak and Daxter (not necessarily becoming good again but its been forever since we had new one)\n\nSly Cooper (same here)\n\nMegaman (X series)\n\nFallout (Bethesda needs to stop dropping the ball with the series)",
            "Halo. Halo 2/3/Reach were the most fun I've ever had playing video games and 4/5/Infinite just aren't as good.",
            "Personal for me and unlikely to get support but Dynasty Warriors. 9 was one of the worst games of all time and wasn't even enjoyable for fans of the series. They literally took every mechanic that made the games stupid fun and just made it stupid. Here's hoping the recently announced installment will be a return to form.",
            "gears of wa",
            "It never became bad but that was me when I finally saw footage of Metroid Prime 4.",
            "Dead Rising",
            "Left 4 Dead being popular again.",
            "Battlefield.  2042 was not good.",
            "Just Bethesda as a company.",
            "Mortal Kombat\n\nTenchu\n\nSyphon Filter \n\nTomb Raider"
        ]
    },
    "Which older game do you think deserves a remake?": {
        "title": "Which older game do you think deserves a remake?",
        "score": 210,
        "url": "https://i.redd.it/6bftht4vuz7d1.jpeg",
        "content": "",
        "num_comments": 195,
        "comments": [
            "Legend of Dragoon",
            "I'm going to limit this to 5.\n\nTenchu\n\nSyphon Filter\n\nBlasto\n\nArmy Men (3D)\n\nNightmare Creatures",
            "Chrono Trigger in HD 2D",
            "Mortal Kombat Mythologies Sub Zero\n\nDino Crisis\n\nZelda 2 adventure of Link\n\nClock Tow...oh wait",
            "Final Fantasy IV (as long as it's not action rpg)\n\nBlood Omen: Legacy of Kain\n\nTimesplitters",
            "Vagrant Story",
            "Parasite Eve needs a remake just for the AMAZING piano techno opening credits.  I don’t remember a lot else about the game other than an opera crowd melting into goo but I’m in it for the music.",
            "Haunting Ground",
            "Dino Crisis\n\nI can only imagine what that would look like with the current REngine",
            "Take my money!"
        ]
    }
}