{
    "What is a game that gets a lot of underserved hate?": {
        "title": "What is a game that gets a lot of underserved hate?",
        "score": 2385,
        "url": "https://i.redd.it/ufrk4tjorc9d1.jpeg",
        "content": "",
        "num_comments": 1963,
        "comments": [
            "Mass Effect 3.Yes the ending sucks, but aside from that its still an incredible game.",
            "If we are talking about social media there's a very, very long list.\n\nGamers love to hate on everything",
            "Borderlands 3, the story is horrendous, but the gameplay is honestly good",
            "Just my 2 cents but from what Ive observed, Spider-man 2018 brought a whole new standard for Spider-man games. Spider-man 2 didnt add a drastic change/upgrade like that. But it doesnt mean its not great, it just didnt wow people the same way.",
            "Sonic Unleashed imo. The day stages are praised as being some of the best in the series, but the night stages get the hate. Personally, I enjoy the night stages, but feel like they drag on for a bit too long. I also enjoy the difficulty, especially Eggmanland.",
            "Literally every game. You can say Zelda BOTW is your favorite game ever and you'll have a ton of people calling it empty and bland then a bunch of other zelda fans call you \"a fake fan\" for like BOTW over OOT. Or you can say Halo Infinite is your favorite game then get rauled by the community the same way because you \"don't like 3 or Reach\" but it's probably because those games are too old for newer gamers to enjoy to the fullest.",
            "Cyberpunk from people who are still stuck in 2020.",
            "I think Spider-man 2 got a ton of hate because the two games before it had much better stories. The story in SM2 was okay, but both SM1 and SMMM blow it out of the water",
            "Alan Wake framchise. The ammount of hate I found holy shit",
            "Spider-Man 2 it's such a weird paradox. \n\nIt's the most acclaimed Spider-Man game both by critics and players (just look at Metacritic, if you don't believe me) and yet it's a divisive topic on Reddit."
        ]
    },
    "What do you think is the worst IGN review in your opinion?": {
        "title": "What do you think is the worst IGN review in your opinion?",
        "score": 41,
        "url": "https://i.redd.it/ave78djeqh9d1.jpeg",
        "content": "The worst review in my opinion is tier review of Alien Isolation, they gave the game a 5.9 out of 10 because the guy playing the game was dumber than the alien ai.",
        "num_comments": 82,
        "comments": [
            "I remember they gave Doom 2016 a 7 and had a ton of nonexistent negatives stuff to say about it being like any other boring shooter (which obviously it wasn't) for some reason without praising every cool innovative thing it did. And it was right when they kept giving annual releases of actual repetitive FPS games that did the exact thing as last year better scores.",
            "Prey 2017 originally got a 4. It might have been pc version because of a bug and has since been fixed in the review but prey 2017 is a masterpiece",
            "Monster Hunter Generations Ultimate for Nintendo Switch. Dude just won't shut the fuck up about MH World.",
            "The infamous PlayStation 1 Aliens game review. The reviewer in question berated the twin stick control method that the game implemented, which later became an industry standard.",
            "Alien Isolation was great. Me and my girlfriend watched one of our friends play it start to finish over a few sessions and it was one of the most fun and memorable gaming experiences I have.",
            "Not a review, but their Halo Infinite Oddball multiplayer gameplay was laughable",
            "That one reviewer for plagiarizing anothers review on Dead Cells I believe it was only to deny the allegations.",
            "We all know IGN is a trash pander network now for sure. \n\nRegardless , going Death Stranding a 6/10 was wild to me. Call it a walking simulator if you want, but that game had so much going for it. Was unique. Had an ALL STAR cast, amazing mocap and updates on updates of free shit.",
            "I was literally about to type Alien Isolation before seeing your full post lol",
            "Too much water sticks out. \n\nI havent read an IGN review in years"
        ]
    },
    "How bad does it end up for you?": {
        "title": "How bad does it end up for you?",
        "score": 210,
        "url": "https://i.redd.it/spzag5np3e9d1.jpeg",
        "content": "",
        "num_comments": 615,
        "comments": [
            "Considering the last game I played was Elden Ring and its DLC. Id say impossibly fucked",
            "Elden Ring, more specifically the dlc. Well shit.",
            "Dont Starve Together. Yeah, its a cycle of constant suffering. One of those respawns youll get really far, have a never-ending food supply, but one slip up and back to suffering",
            "Forza horizon so i will just vibe in some great cars",
            "Ultrakill. I am probably going to die instantly but hopefully i can get sex with gabriel",
            "Astral Chain... Please tell me I have a Legatus...",
            "Deep Rock Galactic\n\nProbably hit the Abyss Bar and ROCK AND STONE!!",
            "since doom (1993) was the last game I played, I'm pretty much fucked unless I'm the doom guy",
            "Hogwarts Legacy. My dream would come true.",
            "I was just playing Left 4 Dead 2. I don't even need to say anything, we all know who this goes"
        ]
    },
    "What’re your favorite under-appreciated games?": {
        "title": "What’re your favorite under-appreciated games?",
        "score": 45,
        "url": "https://i.redd.it/csus7rkmhg9d1.jpeg",
        "content": "What're some of your favorite games that you feel are unknown, niche, not popular, or not appreciated enough? Blue Dragon and Portal Runner are two of mine that come to mind. I haven't really met anyone that has played or knows about these games!",
        "num_comments": 56,
        "comments": [
            "Tomorrow Never Dies and Yugioh Forbidden Memories",
            "Im gonna say: Ape Escape 2 and MySims!",
            "Def jam fight for ny OgXbox\nYugioh duelist of the roses ps2\nFucking Bangers",
            "portal runner was so good but some levels were such bs",
            "Blue dragon is one of my favorites also S.L.A.I. Was great on the ps2",
            "The Warriors by Rockstar Games for PS2.",
            "Revenge of the fallen video game for the ps3 and Xbox 360 slaps",
            "The insanely generic sounding Summon Night: Swordcraft Story 2 for the Gameboy Advance",
            "Sonic forces (I am serious, please don't stab me)",
            "Indiana Jones and the fate of Atlantis"
        ]
    },
    "Why are these games so fondly remembered?": {
        "title": "Why are these games so fondly remembered?",
        "score": 40,
        "url": "https://i.redd.it/g80ru2vf2g9d1.jpeg",
        "content": "",
        "num_comments": 25,
        "comments": [
            "Nostalgic memories with friends and family members who wouldn't usually game but played this",
            "Theyre starter games. Wii sport came default on the console. So for many, its the first experience of gimmicks that the Wii is capable of.",
            "I dont know how common this was but the first came free with my Wii. It used the Wii controller gimmick perfectly and showed what the system could do in a low-stakes, repeatable way.",
            "Resort was awesome, had some great times playing with friends and family",
            "It was because anyone could play. Playing with grandparents because all they had to do was fake bowl? It was great.",
            "It's couse it's one of the first games gamers played that involved sports",
            "Wii Sports was pretty solid for what it was, can't say the same for the other one though, really feels like Wii sports was lighting in a bottle for Nintendo",
            "man I loved Wii sports, I got Resort lke last year and tryed golf but it played nothing like the OG and we didn't really like it. but we did like the bow game ;3",
            "Because I *still* play them. I had *just* gotten Resort a couple months ago.",
            "If you owned a Wii, extremely high chance is that you also owned Wii Sports. One of the few games where EVERYONE was easily able to pick up and play.\n\nI cant speak for Resort. I wasnt aware of that game until only a few years ago. Im glad I didnt know though as it likely would have tainted how much fun I had with Pilotwings Resort on 3DS on release had I known the same island was reused."
        ]
    }
}