{
    "Announcing a ban on AI generated videos (with a few exceptions)": {
        "title": "Announcing a ban on AI generated videos (with a few exceptions)",
        "score": 1952,
        "url": "https://www.reddit.com/r/videos/comments/1cg9nud/announcing_a_ban_on_ai_generated_videos_with_a/",
        "content": "Howdy r/videos,\n\nWe all know the robots are coming for our jobs and our lives - but now they're coming for our subreddit too.\n\nMultiple videos that have weird scripts that sound like they've come straight out of a kindergartener's thesaurus now regularly show up in the new queue, and all of them voiced by those same slightly off-putting set of cheap or free AI voice clones that everyone is using.\n\nNot only are they annoying, but 99 times out of 100 they are also just bad videos, and, unfortunately, there is a very large overlap between the sorts of people who want to use AI to make their Youtube video, and the sorts of people who'll pay for a botnet to upvote it on Reddit.\n\nSo, starting today, we're proposing a full ban on low effort AI generated content. As mods we often already remove these, but we don't catch them all. You will soon be able to report both posts and comments as 'AI' and we'll remove them.\n\nThere will, however, be a few small exceptions. **All of which must have the new AI flair applied** (_which we will sort out in the coming couple days - a little flair housekeeping to do first_).\n\nSome examples:\n\n- Use of the tech in collaboration with a strong human element, e.g. creating a cartoon where AI has been used to help generate the video element based on a human-written script. \n- Demonstrations the progress of the technology (e.g. [Introducing Sora](https://www.youtube.com/watch?v=HK6y8DAPN_0))\n- Satire that is actually funny (e.g. [satirical adverts](https://www.youtube.com/watch?v=qSewd6Iaj6I), deepfakes that are obvious and amusing) - though remember Rule 2, NO POLITICS\n- Artistic pieces that aren't just crummy visualisers \n\nAll of this will be up to the r/videos denizens, if we see an AI piece in the new queue that meets the above exceptions and is getting strongly upvoted, so long as is properly identified, it can stay.\n\nThe vast majority of AI videos we've seen so far though, do not.\n\nThanks, we hope this makes sense.\n\n**Feedback welcome! If you have any suggestions about this policy, or just want to call the mods a bunch of assholes, now is your chance.**",
        "num_comments": 290,
        "comments": [
            "I, for one, welcome our new Human overlords.",
            "And it was in this day we struck back.",
            "How long until we cant distinguish do you think. A year?",
            "You're a bunch of assholes. I don't actually mean that but I didn't want to miss out on this opportunity.",
            "Good. Fuck AI content. Generic garbage.",
            "Looking forward to the day a human made video gets taken down for being suspected to be AI made.",
            "I'd rather see a more targeted approach as opposed to an outright ban. 1) No low-effort videos (despite popular belief, no, this does not include all AI work by definition), and 2) AI videos must be flaired as such. Seems more reasonable, yeah? If someone goes to great lengths to create an actual, high-quality video, using AI in part or all of it, seems sad it couldn't be posted here.",
            "There will come a moment very soon that we cannot tell anymore if someone chooses not to apply a tag",
            "So you're going to ban tiktok videos with the AI voice right...?\n\nRight?",
            "Honest question: Shouldn't Reddit's \"democratic\" system (I put that in scare quotes because the moderators exist as opaque authoritarians) determine whether those videos are good enough?"
        ]
    },
    "Undertaker vs. Mankind – Hell in a Cell Match 1998": {
        "title": "Undertaker vs. Mankind – Hell in a Cell Match 1998",
        "score": 90,
        "url": "https://youtu.be/89BPNcsL7QI?si=yY0DDcIPePjK62o_",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Come out, come out, wherever you are",
            "Ill never stop taking the opportunity to tell any- and everyone that I saw this shit live and in-person with 8 of my friends. Totally melted my brain.",
            "I saw this Live PPV. This is and always be a top five WWE match. It was an absolutely Insane  match.  This was a defining moment that I don't think will ever be repeated",
            "The captions were killing me, \"McDonald's got a witness.  He is broken in half.\"",
            "The 1900s was a wild time",
            "This or Mankind V the rock \"i quit\" match?",
            "That dude is a reddit legend",
            "Oh man if he shows himself on the same week /shittywatercolor made an appearance it would be epic.",
            "Reading the list of injuries and permanent issues Mankind had from that, I sure hope so...",
            "And hopefully won't be repeated. As fun and badass as it was to watch back then, it was incredibly dangerous and could have killed him or gave him a permanent, life-altering injury. It's not worth it just for some cheers."
        ]
    },
    "Uncovering Every Lie in MKBHD's Softball Interview; a scathing critique of 'brand safe' influencers": {
        "title": "Uncovering Every Lie in MKBHD's Softball Interview; a scathing critique of 'brand safe' influencers",
        "score": 4610,
        "url": "https://www.youtube.com/watch?v=Z0DF-MOkotA",
        "content": "",
        "num_comments": 1301,
        "comments": [
            "Before watching this video: I know nothing \n\nAfter: Why the fuck are these dumbasses putting pin 1 next to pin 43 when they know it will fry the CPU?",
            "Personal review of Rossman- a few years ago I had a significant issue with my laptop due to water damage and an over-excited pup. Apple told me it was unfixable, DriveSavers (Who Apple referred me to) and others all said the same thing. Rossmann and his team were professional, no bullshit, and charged me a fraction of what they would have and knew their shit. Can't trust this guy enough.",
            "Wait, is the \"Apple Repair Guy I Love\" going after the \"Apple Review Guy I Love\"!? This is like my Ironman fighting Captain America in Civil War moment.",
            "I'm not familiar with the man presenting this video and 5 seconds in I'm concerned he may not have slept for several years.",
            "Im starting to think he doesnt like Apple.",
            "the second that guy walked around the piece of crap that the Cybertruck is and just repeatedly says \"it's simply so COOL!\" i stopped clicking on anything that includes him lol",
            "All tech review guys/girls when they hit a certain level just become cheerleaders for brands. It's lucrative because you get invited places and get to vlog, it's also easier for views because everyone loves geeking out about the latest whatever.\n\nIt's also the same for this guy who's niche has become shitting on Apple. We all know what they are, and consumers have accepted the downsides of owning an Apple device which is no repairs.",
            "so apparently this guy got into a backlash for being too harsh on a company and potentially bankrupt them, now he got into a new backlash for being a walking billboards? seems like ppl just piss off that this guy have a different opinion about certain products compares to them lol",
            "I don't watch MKBDH for the same reason as I don't watch any The Rock movies, or their Instagram posts or announcements.\n\nTo me they are just walking billboards/brand/sponsor safe ambassadors that has to toe the line to some parent corporate entity. Every single breath they take is to sell something or say something due to contractual obligations.",
            "Hateboners for everybody and everything."
        ]
    },
    "The Dresden Dolls - 'Girl Anachronism'": {
        "title": "The Dresden Dolls - 'Girl Anachronism'",
        "score": 88,
        "url": "https://youtu.be/sO5APfKnR50?si=9an71V7t4fifN6T4",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Put on a great show when they opened for NIN. Drummer stole the show",
            "People forget that the prototype for \"Manic Pixie Dream Girl\" was actually \"Feral Homicidal Goth GF\"",
            "Love this album. Found them when I heard Coin Operated Boy on the radio of all places. Jeep Song is such a great track. Their second album has some bangers on it too like Sex Changes, My Alcoholic Friends, and Dirty Business. \n\nI wasn't a fan of their third album. The songs aren't as charming, and the audio mix has a lot of issues IMO.",
            "Good song, one of their few, but is this really the best quality available atm? Shit looks and sounds like it's from the day they uploaded it at 240p on old YouTube.",
            "My #1 angsty teenage obsession.",
            "I have always enjoyed the energy of this song. Ive never had the pleasure of seeing them live but I imagine it would be quite the show.",
            "Daaamn, I forgot they existed! They came out around the same time as The White Stripes and fell into that general vibe.",
            "Brian Viglione. Amazing drummer! Played with my favorite band, The World/Inferno Friendship Society for a short time.",
            "Which nin tour was that?",
            "the kid her and Neil Gaiman had has probably got to be part of some kind of goth prophecy"
        ]
    },
    "America's Income Crisis: How It's Triggering a Collapse in Birth Rates": {
        "title": "America's Income Crisis: How It's Triggering a Collapse in Birth Rates",
        "score": 460,
        "url": "https://www.youtube.com/watch?v=Q9lo7GAIJCo",
        "content": "",
        "num_comments": 231,
        "comments": [
            "Hey it's what started happening in Japan 20 years ago",
            "It's not just income. It's the rise in the costs of everything, in large part due to speculation or investment in everything.",
            "no flourishing middle class <=> socioeconomical stagnation",
            "\"Consumer confidence\" isn't a thing. That's just what business owners choose to call a lack of societal demand stemming from workers being severely underpaid. Consumers don't lack confidence, they lack disposable income.",
            "I want children and I cannot afford it. I do not even have a proper place to raise a child.",
            "Can't improve economic conditions to make people feel comfortable starting families, better import people from countries with a lower standard of living to reach replacement level instead ",
            "And the trend line they're hanging their data on was still way below the gains versus CPI and productivity.",
            "Because only rich people have kids??",
            "Interesting hypothesis, but I think we're drawing conclusions from limited data. Focusing solely on American economic explanations for the sluggish birth rates leaves out the international perspective. What would happen if the author (or someone else) were to conduct the same kind of analysis for other nations around the world?",
            "Dont worry, once the working class is affected enough that it starts to impact the wealthy elites profits theyll be so kind as to through us some scraps. After all, without us they have no one to exploit or siphon resources away from. Theyre really only hurting themselves with their selfishness and gluttony "
        ]
    }
}