{
    "Post your questions & inquiries here! - r/Vietnam monthly random discussion thread - F.A.Q": {
        "title": "Post your questions & inquiries here! - r/Vietnam monthly random discussion thread - F.A.Q",
        "score": 9,
        "url": "https://www.reddit.com/r/VietNam/comments/1d59yga/post_your_questions_inquiries_here_rvietnam/",
        "content": "*Lưu ý: Đây là thread chủ yếu dành cho người nước ngoài hoặc không nói tiếng Việt đặt câu hỏi. Nếu có thể, hãy trả lời giúp họ nhé.*\n\n#Please read the 3rd rule of the sub. Don't post your general questions & inquiries outside of this thread as they will be removed.\n\n#Lots of your questions have been answered already so make sure you do a search before asking (how-to below). \n\n---\n\nTo keep this subreddit tidy, we have this monthly thread that is open for random discussions and questions. **If you post your basic/general questions outside of this thread they will be removed.** Sorry, we want to make this sub friendly but also want it to be clean and organized.\n\nSome examples of the questions that should be posted here:\n\n- Questions that can be answered with just Yes/No\n- Basic questions like \"Where can I buy this?\"\n- Questions that were asked many times before. Please do your research\n- Questions that are not specific\n\n---\n\n##**Tips to quickly find answers for your questions:**\n\nMany of your questions may have been answered since people keep asking the same ones again and again. Here is a quick tip to find the answers for yours.\n\nFirst, [have a look at our old sticky threads](https://www.reddit.com/r/VietNam/search?sort=new&restrict_sr=on&q=flair%3ASticky). A lot of useful information there. A lot of questions have been answered.\n\nYou can also use the search feature of Reddit, just like you do with Google.\n\nAnother option is to use Google, as Google understands your queries better than Reddit and can return better results.\n\nGo to Google. Add 'site:https://www.reddit.com/r/VietNam/' next to your queries (without quotes). For example, if I want to find info on eVisa in this subreddit, my query to put in Google is 'eVisa site:https://www.reddit.com/r/VietNam/'.\n\n---\n\n##**F.A.Q**\n\nHere are the common questions about travel/visa/living in Vietnam which have been answered by the community members, plus other useful information. Let me know if I forget to mention anything!\n\n**Visa:**\n\n[Legit official website for eVisa](https://evisa.xuatnhapcanh.gov.vn/trang-chu-ttdt)\n\n[What is an eVisa and how to apply?](https://www.reddit.com/r/VietNam/comments/7v30qc/six_more_countries_including_canada_and_australia/dtp4lex/)\n\n[Best sites for applying eVisa.](https://www.reddit.com/r/VietNam/comments/dcqged/visa/)\n\n[Another thread on which websites to get a Vietnam visa from.](https://www.reddit.com/r/VietNam/comments/8duvpa/q_whats_a_reliable_site_to_get_a_vietnam_visa_from/)\n\n[A US citizen's eVisa ordering experience.](https://www.reddit.com/r/VietNam/comments/60jxaf/my_vietnam_evisa_ordering_experience/)\n\n[EVisa or pre-approved visa letter?](https://www.reddit.com/r/VietNam/comments/dbg187/which_is_better_evisa_or_upon_arrival_visa/)\n\n[Visa services?](https://www.reddit.com/r/VietNam/comments/domax8/three_month_multiple_entry_visa_help/)\n\n[Vietnam eVisa eligible ports on immigration.](https://www.google.com/maps/d/u/0/viewer?mid=1USxj53_wJXod9q-HZvQ0kwIqLiQ&ll=16.392907443238467%2C106.07993824999994&z=6)\n\n[New list of eVisa ports](https://evisa.xuatnhapcanh.gov.vn/documents/20181/117155/List-of-evisa-port.pdf/c774e24b-1ab8-4fb6-9ac1-dcdfaccecf8e)\n\n**Travel**\n\n[Information on travelling to some northern cities of Vietnam + General tips.](https://www.reddit.com/r/VietNam/comments/3a8mge/vietnam_common_travel_qs_answered/)\n\n[A super informative AMA from a teenager living in Saigon.](https://www.reddit.com/r/VietNam/comments/i6pqz8/teenager_living_in_saigon_already_super/)\n\n**Living in Vietnam:**\n\n[Advice for any expats looking to relocate to Vietnam](https://www.reddit.com/r/VietNam/comments/eivr6w/for_any_expats_looking_to_relocate_to_vietnam/)\n\n[An American expat married to a Vietnamese wife, fluent in the language, and living in Vietnam forever.](https://www.reddit.com/r/VietNam/comments/b19zu8/im_an_american_expat_married_to_a_vietnamese_wife/)\n\n[A Canadian looking to live and work in Vietnam.](https://www.reddit.com/r/VietNam/comments/b9y5jd/canadian_looking_to_live_and_work_in_vietnam/)\n\n[A Vietkieu asking for people's experience on moving back to Vietnam.](https://www.reddit.com/r/VietNam/comments/cskfyt/viet_kieus_moving_back_to_vietnam/)\n\n[Story of an American man lived in Vietnam in 4 years then moved back to the US + members discussing about living in Vietnam.](https://www.reddit.com/r/VietNam/comments/dbmjtc/vietnam_is_the_greatest_place_on_earth_and/)\n\n[Why so many foreigners live in Vietnam, while Vietnamese people think this is a very bad place to live?](https://www.reddit.com/r/VietNam/comments/d1nomh/why_so_many_foreigners_live_in_vietnam_while/)\n\n[Teaching in English in Vietnam without a bachelor's degree.](https://www.reddit.com/r/VietNam/comments/9d3x21/can_i_teach_english_in_vietnam_with_no_bachelor/)\n\n[Some tips and advice on learning Vietnamese.](https://www.reddit.com/r/VietNam/comments/d2msow/starting_to_learn_vietnamese_next_week/)\n[Several ways to send money to Vietnam.](https://www.reddit.com/r/VietNam/comments/e9xvt4/does_anyone_know_the_best_way_to_send_a_huge/)\n\n[Bike reviews](https://www.reddit.com/r/VietNam/comments/hajjcm/air_blade_2020_positive_review/)",
        "num_comments": 182,
        "comments": [
            "Hi, where can i play football in vietnam?  \n Im going back to vietnam for 2 weeks to visit my grandparents and I take football seriously as a 15 yo. Is there anywhere I can play like an open field, dropping in with strangers, or a football academy or tryouts/trials? Im going to stay in hanoi and Thanh Hóa. I also have a citizenship with this country so that could probably help me get into a football academy for a week?",
            "Anyone know where I can play Volleyball In hcmc? I am here for there whole summer and would like to find a place or group I can play some volleyball 🏐! Thanks",
            "I applied for an eVisa yesterday Friday (31st May) and my flight to Vietnam is this Thursday (6th June) afternoon. Have I left it too late for approval of the eVisa? The site says 3-5 working days for approval, I'm a little worried it wont get approved before my flight and not sure what to do.",
            "Any must visit restaurants in Da Nang or Hoi An?",
            "# While I was living in Vietnam I bought a Galaxy 4 mobile phone. When I return to the U.S., will an AT&T sim card work /fit in the phone or will I now have to  buy a new U.S. cell phone and sim? I'm looking at the Galaxy 4 and the sim looks super small..",
            "Im traveling from Canada and I need to get my adhd medication refilled. Has anyone had any luck here and how did you do it?",
            "Travel/Visa Question!!! \n\nMy passport expired during my contract, I got a new one so I was never given a new TRC, simply a visa in my passport that expires in late October. I asked HR several times if they wanted my passport (to cancel my visa) and they said no. The last time I met with them they told me they would simply tell immigration to cancel my visa at the end of June. It's a large company and HR has always seemed to be very competent in the past. I want to stay until I can get my pension without doing visa runs. Anyone know what the rule is here, and when I do leave do I need an exit visa (provided I leave before the end date which of course I will). Thanks for the assistance.",
            "Can I check in two pieces of luggage under a combined luggage allowance?\n\nI’m flying from Ho Chi Minh to Hanoi via Vietjet Air and have purchased a 30-kg baggage allowance. I have two pieces of luggage with me and am wondering if their weights can be combined, or if the baggage allowance applies to each piece of luggage separately?",
            "Hello folks! I was planning a visit to Vietnam end of this month. Due to my budget and time, Ho Chi Minh City is the most suitable, negating most other travel options. I have been speaking to a few folks who recently went there, and the common theme was heat and monsoon as things to look out for.\n\nHow has the summer been there this year? Is an early/delayed/on-time monsoon expected? What could I be seeing weather-wise at the end of June? I don't mind the heat, (till 30-35 degrees), and don't mind the rain either. I just don't want to be holed up inside. I should be booking the tickets in the next few hours so any tips will be super helpful!",
            "Anyone in nah Trang ? Looking for people to explore the city \n\nLike I said just looking for people to hang out , get some food , partying. I’ll be there for 2 weeks and just want to fully experience nah Trang ! Also divers are very welcomed ( I just freedive )"
        ]
    },
    "Hướng dẫn sử dụng r/Vietnam - How to r/Vietnam": {
        "title": "Hướng dẫn sử dụng r/Vietnam - How to r/Vietnam",
        "score": 125,
        "url": "https://www.reddit.com/r/VietNam/comments/txs0ew/hướng_dẫn_sử_dụng_rvietnam_how_to_rvietnam/",
        "content": "(please find English below)\n\nChào mừng bạn đến với r/Vietnam. Dưới đây là một vài hướng dẫn ngắn gọn để bạn nhanh chóng tham gia vào cộng đồng này.\n\n- Từ ngày 6/4/2022, r/Vietnam được chuyển đổi thành một subreddit song ngữ. Bạn có thể dùng cả tiếng Việt và tiếng Anh trong subreddit này. Lưu ý rằng tại r/Vietnam số lượng người nước ngoài hoặc không nói tiếng Việt chiếm số lượng đáng kể. Vì vậy khuyến khích bạn sử dụng tiếng Anh + Việt để giao lưu với tất cả mọi người trong subreddit.\n- r/Vietnam áp dụng một số quy tắc đơn giản để giữ cho cộng đồng lành mạnh và vui vẻ cho tất cả mọi người. Bạn có thể tìm thấy các quy tắc này trên Sidebar (cho Desktop), About (cho Mobile), hoặc có thể [xem tại post này](https://www.reddit.com/r/VietNam/comments/txkoxs/rules_quy_t%E1%BA%AFc/)\n- Nếu account của bạn quá mới thì comment của bạn sẽ tự động bị chặn bởi bot để chống spam. Bạn có thể liên hệ và yêu cầu mod duyệt comment cho bạn.\n- Các bài đăng cần có tiêu đề và không nhất thiết phải đi kèm nội dung nếu đó là hình ảnh/video. Bạn cần gắn mác (flair) cho tất cả các bài đăng trước khi gửi (Thảo luận/Văn hóa/Lịch sử/Ẩm thực..v..v..)\n- Người nước ngoài đến du lịch/làm việc/học tập/sinh sống tại Việt Nam thường có rất nhiều câu hỏi và thắc mắc cần giải đáp. Tất cả những câu hỏi này được tập trung tại [bài sticky](https://www.reddit.com/r/VietNam/comments/ttdb2i/post_your_questions_inquiries_here_rvietnam/) của sub. Vậy nên nếu thấy câu hỏi/thắc mắc nào bạn có đáp án, hãy giúp đỡ họ bạn nhé.\n- r/Vietnam có một Discord [tại đây](https://discord.gg/2cRvfymfTf) và khuyến khích bạn tham gia. Trên Discord này các chủ đề sẽ rộng và linh hoạt hơn, thiên về các cuộc nói chuyện ngắn và mang tính giải trí thông thường hơn. Ví dụ như confession, nghe nhạc,..v..v..\n\n---\n\nHello and welcome to r/Vietnam. Below are some quick guidelines to help you better participate in the community activities.\n\n- r/Vietnam is now a dual language subreddit. You can use both English and Vietnamese here.\n- Please read the rules before participating, making a submission or comment. You can find them on the Sidebar (Desktop), About tab (Mobile), or this [thread](https://www.reddit.com/r/VietNam/comments/txkoxs/rules_quy_t%E1%BA%AFc/)\n- Trivial questions that can be answered quickly, or google-able, or without the intention of creating a discussion, should be posted in the sticky thread. Travel/visa questions should be posted there too.\n- r/Vietnam has a Discord server [here](https://discord.gg/2cRvfymfTf) which aims to be more open and flexible to handle more casual conversations. You can also find both English and Vietnamese channels there.\n\n---\n\nAbout the changelog.\n\nI've made some changes to the sub:\n\n- Re-writing the rules to make them more concise. Adding Vietnamese.\n- Remove some unnecessary flairs.\n- Big change: Switching r/Vietnam to a dual-language subreddit. This is based on the fact that the number of Vietnamese people in this sub has increased significantly. I know this is controversial and some of you don't like this but I think we should just give it a try.\n- Making a Discord server. This is after r/place event that I realized we need a place to handle future events like this better and for the ease of casual, chit-chat type of conversations.",
        "num_comments": 11,
        "comments": [
            "Hey, this is actually a good change. I like it.",
            "tôi rất thích sự thay đổi này",
            "That's what I like it. \nI'm Vietnamese, I'm come from Vietnam, hope to find a good pal to talk english with, ^^.",
            "kinda good changes bro, but bilingual subreddit is kinda hard to adapt :))",
            "I’m a Canadian citizen and plan to fly to Vietnam in a few weeks. My flight is from YVR (Vancouver) to MNL (Manila) then a 4 hour layover, and then MNL to SGN.   What’s the COVID requirements like? Do I need to get a negative covid test to fly? If so, what’s the time window for it to be accepted?  And flying back to Canada, what’s required?  Thank you 🙏",
            "A lot of us would gladly help you out if you're in doubt",
            "Please post your question in the dedicated thread.",
            "That is very kind though it suspect it might become a burden quickly for the folks here doing the translation.",
            "[deleted]",
            "[deleted]"
        ]
    },
    "Man gets beat, revives himself, then kills 2 birds with 1 stone. ": {
        "title": "Man gets beat, revives himself, then kills 2 birds with 1 stone. ",
        "score": 210,
        "url": "https://v.redd.it/i4itni0pxa9d1",
        "content": "",
        "num_comments": 54,
        "comments": [
            "That last kick woke him up from the dead",
            "Man's a true Vietnamese. Get conquered by a higher power -> rise up -> liberation",
            "I just love how Vietnamese can turn anything into a weapon. Makes me fear my wife that little bit more.",
            "That one guy caught a ricochet. So clutch",
            "Repeat after me kids, \"there is no violence in Vietsingse, if you keep saying there is, you'll get a formal invitation to lake Laogai\"",
            "Bro was playing with his food in the last circle of warzone, didn't know the other guy had the self res",
            "\"Call an ambulance! But not for me!\"",
            "Can someone tell from which region in Vietnam based on their accents in the video?",
            "Vãi thật! Nhìn sợ vậy 😰",
            "Why is the guy in red holding his head?"
        ]
    },
    "Vietnam GDP grew 6.93% in Q2 with risks to recovery 'high'": {
        "title": "Vietnam GDP grew 6.93% in Q2 with risks to recovery 'high'",
        "score": 19,
        "url": "https://asia.nikkei.com/Economy/Vietnam-GDP-grew-6.93-in-Q2-with-risks-to-recovery-high",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Lưu ý,\n\nBất kể bạn đang tham gia vào chủ đề thảo luận gì, hãy lịch sự và tôn trọng ý kiến của đối phương. Tranh luận không phải là tấn công cá nhân. Lăng mạ cá nhân, cố tình troll, lời nói mang tính thù ghét, đe dọa sử dụng bạo lực, cũng như vi phạm các quy tắc khác của sub đều có thể dẫn đến ban không báo trước.\n\nNếu bài viết của bạn có liên quan đến chính trị hoặc bạn muốn bàn về chính trị, xin hãy đăng bài bên r/VietNamPolitics rồi đăng lại bình luận có đường dẫn đến bài viết đó.\n\nNếu bạn thấy bất kì comment nào vi phạm quy tắc của sub, vui lòng nhấn report.\n\n***\n\nA reminder.\n\nIn general, be courteous to others. Debate/discuss/argue the merits of ideas, don't attack people. Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban.\n\nIf your post is Political or you would like to have a Political Discussion, feel free to create a post in r/VietNamPolitics then add a comment with a link to that post here.\n\nIf you see comments in violation of our rules, please report them.\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/VietNam) if you have any questions or concerns.*",
            ">Vietnam's economy expanded 6.93% in the second quarter from a year earlier, surpassing the 5.66% in the January-March quarter, as it strives to bounce back from the pandemic, official data showed Saturday.\n\n>In what's been called an uneven recovery, the Southeast Asian supply chain hub kept steady export growth of 12.5% in the second quarter, boosted by electronics and seafood, according to the General Statistics Office.\n\n>Domestic consumption lagged somewhat, increasing 5.78% in the first six months versus a year earlier, data showed, while economists are split on whether Vietnam will raise interest rates to tackle inflation or hold to encourage business lending this year. One of the world's fastest-growing economies, Vietnam targets gross domestic product to increase by 6-6.5% in 2024.\n\n>\"Downside risks are high,\" said Paulo Medas, International Monetary Fund fiscal affairs department division chief, after meetings with the prime minister and other top leaders. \"Exports, a key driver for Vietnam's economy, could weaken if global growth disappoints, global geopolitical tensions persist, or trade disputes intensify.\"\n\n>Low foreign demand has weighed on exporters, though more long term, they have benefited from investors' migration from China, which is locked in a trade war with the U.S. It is unclear how the war will play out after the U.S. presidential election in November, but leading candidates Joe Biden and Donald Trump have both clamped down on what they call Beijing's unfair trade.\n\n>Analysts do not agree on whether Vietnam's economy is strong enough to bear interest rate rises. The statistics office said inflation was 4.39% in the first quarter, putting pressure on the central bank to tame elevated prices.\n\n>Tim Leelahaphan, economist for Vietnam and Thailand at Standard Chartered Bank, predicts the State Bank of Vietnam will increase the refinancing rate by half a percentage point in the fourth quarter of 2024, if not sooner, citing rising inflation and foreign exchange weakness.\n\n>\"Despite the likely \\[second-quarter\\] slowdown, we think Vietnam's recovery remains intact,\" Leelahaphan said. \"However, economic challenges could persist in \\[the third quarter\\] amid rising price pressures, FX weakness, and soft global demand.\"\n\n>A manufacturing base for global companies like Samsung Electronics and Foxconn, Vietnam has seen chronic underinvestment in infrastructure and shaky power supplies, which were interrupted in factory zones last year. Vietnamese Deputy Prime Minister Le Minh Khai at Nikkei's Future of Asia forum in May acknowledged the shortages and said grid improvements will help avoid a repeat.\n\n>The IMF said renewable energy and productivity gains are the two factors the country needs in \"a new wave of reforms\" to sustain growth in the face of climate change and an aging population.\n\n>\"Given the uneven economic recovery, policies remain highly supportive in 2024,\" Medas said.\n\n>He added: \"Vietnam's anti-corruption efforts are important for high-quality development and would benefit from stronger preventative anti-corruption institutions, economic governance and transparency. Efforts to reduce legal uncertainty and allow for swifter decision making by public officials would also foster a more business-friendly environment.\"\n\n>The graft crackdown has left top state officials out of a job, business tycoons in prison, and bureaucrats reluctant to make decisions.\n\n[Chart](https://archive.ph/HKeDI/83a6a47e3d927f69bcb7300ec17419e8de408d91.avif)"
        ]
    },
    "Is this worth much? ": {
        "title": "Is this worth much? ",
        "score": 95,
        "url": "https://www.reddit.com/gallery/1dqofod",
        "content": "",
        "num_comments": 47,
        "comments": [
            "After a quick search, it’s 100k VND before 2004. They might be rarer than 500 VND and 200 VND. The ID is not really special. No idea how much it values.",
            "Wtf is this cursed 100k dong",
            "I just checked my stash of foreign currency… I still have a 2000 VND and it’s dated 1988!",
            "Definitely worth more than 100k, but probably not worth more than 200k.",
            "keep it bro, if u see someone is collecting old money, let them buy that for higher price",
            "have never seen this note before O.O but how much it's worth depends on whether there's a collector that cares assuming it's real",
            "It’s worth about tree fiddy",
            "Damn haven't seen that for a long time",
            "Wow where did you get it?",
            "$4, but it’s old money, so you have to exchange it into current money to use it."
        ]
    }
}