{
    "Weekly Questions Thread for the week of June 24": {
        "title": "Weekly Questions Thread for the week of June 24",
        "score": 7,
        "url": "https://www.reddit.com/r/vinyl/comments/1dn7dgi/weekly_questions_thread_for_the_week_of_june_24/",
        "content": "Comments are automatically sorted by new so if you wish to have them sorted differently you have to do so by yourself above the comment field.\n\nIf you want our help in choosing equipment, please list your budget and the area you are in. (Something like \\*\\*\\[$100\\] I'm looking for a belt driven table. Amazon only \\[Ohio, USA\\*\\*\\]) Try to include as much information as you can, such as online only or if you are willing to do craigslist’s or just stores in your area. \n\nIf you need help diagnosing a problem, please be as descriptive as possible and if you can post pictures of what is wrong. \n\nIf you see a post that would fit in this thread, please politely direct them to this thread. They may have not seen the sticky.\n\nAlso check out /r/audiophile /r/BudgetAudiophile for additional information.\n\n&#x200B;\n\n\\*\\*Links and guides:\\*\\*\n\n\\* \\[The Vinyl Guide\\]( [http://www.reddit.com/r/vinyl/comments/fiedy/my\\_attempt\\_at\\_creating\\_a\\_guide\\_to\\_vinyl\\_to\\_answer](http://www.reddit.com/r/vinyl/comments/fiedy/my_attempt_at_creating_a_guide_to_vinyl_to_answer/))\n\n\\* \\[Beginner's Guide\\]([https://www.reddit.com/r/vinyl/comments/4reid2/beginners\\_guide\\_to\\_vinyl\\_2016\\_edition](https://www.reddit.com/r/vinyl/comments/4reid2/beginners_guide_to_vinyl_2016_edition/)) by /u/nevermind4790\n\n\\* \\[Turntables to avoid\\]([https://www.reddit.com/r/vinyl/comments/5bh435/list\\_of\\_turntables\\_to\\_avoid\\_and\\_the\\_reasons\\_why](https://www.reddit.com/r/vinyl/comments/5bh435/list_of_turntables_to_avoid_and_the_reasons_why/)) by /u/slavikcc\n\n\\* \\[Best new entry-level turntables to start out with\\]([https://www.reddit.com/r/vinyl/comments/5ghkwd/best\\_new\\_entrylevel\\_turntable\\_to\\_start\\_out\\_with](https://www.reddit.com/r/vinyl/comments/5ghkwd/best_new_entrylevel_turntable_to_start_out_with/)) by /u/slavikcc\n\n\\* \\[Vinyl record care/Setups\\]( [http://www.reddit.com/r/vinyl/comments/dx10z/just\\_bought\\_my\\_first\\_vinylhelp](http://www.reddit.com/r/vinyl/comments/dx10z/just_bought_my_first_vinylhelp/))\n\n\\* \\[Setting up a turntable/Basics\\]( [http://www.reddit.com/r/vinyl/comments/e2akm/new\\_to\\_turntables\\_help](http://www.reddit.com/r/vinyl/comments/e2akm/new_to_turntables_help/))\n\n\\* \\[Inspecting used vinyl\\]( [http://www.reddit.com/r/vinyl/comments/q5d7v/inspecting\\_used\\_vinyl\\_what\\_to\\_look\\_for](http://www.reddit.com/r/vinyl/comments/q5d7v/inspecting_used_vinyl_what_to_look_for/)) \n\n\\* \\[How and why to align a cartridge properly\\]( [http://www.reddit.com/r/vinyl/comments/t9vsh/psa\\_how\\_to\\_properly\\_align\\_your\\_cartridge\\_and\\_why](http://www.reddit.com/r/vinyl/comments/t9vsh/psa_how_to_properly_align_your_cartridge_and_why/))\n\n\\* \\[Vinyl Storage Options\\]([http://www.reddit.com/r/vinyl/comments/21qsse/record\\_shelving\\_options\\_my\\_research\\_list](http://www.reddit.com/r/vinyl/comments/21qsse/record_shelving_options_my_research_list/))\n\n\\* \\[Speaker Placement Guide\\]([http://www.reddit.com/r/vinyl/comments/shqx0/your\\_setup\\_sucks\\_hear\\_me\\_out\\_im\\_trying\\_to\\_help](http://www.reddit.com/r/vinyl/comments/shqx0/your_setup_sucks_hear_me_out_im_trying_to_help/))\n\n\\* \\[Shipping records\\]([http://imgur.com/a/ba8Ot](http://imgur.com/a/ba8Ot)) by /u/GothamCountySheriff\n\n\\* \\[Beginner's Guide to Dating and Identifying Records\\]([https://www.reddit.com/r/vinyl/comments/4e1e84/a\\_beginners\\_guide\\_to\\_dating\\_and\\_identifying](https://www.reddit.com/r/vinyl/comments/4e1e84/a_beginners_guide_to_dating_and_identifying/)) by /u/GruttePier1\n\n&#x200B;\n\nLooking to buy, or research vinyl? Here are some good online resources:\n\n\\* \\[Discogs\\]([http://www.discogs.com](http://www.discogs.com/))\n\n\\* \\[Popsike\\]([http://www.popsike.com](http://www.popsike.com/))\n\n&#x200B;\n\nEveryone please be respectful and remember we were all new to this at one point.\n\n&#x200B;\n\n\\*\\*Recently reddit's spam filter has become a bit more aggressive, meaning that comments with multiple links are likely to get removed. We try to approve them as fast as possible, but please message us if you think your comment got removed and we'll sort it out asap.\\*\\*\n\n&#x200B;\n\nVinyl related Subs:\n\n1. /r/VinylCollectors \n\n2. /r/VinylReleases \n\n3. /r/VinylDeals \n\n&#x200B;\n\n\\[Previous threads\\]([https://www.reddit.com/r/vinyl/search?q=%22Weekly%20Questions%20Thread%20for%20the%20week%20of%22&restrict\\_sr=1&sort=new](https://www.reddit.com/r/vinyl/search?q=%22Weekly%20Questions%20Thread%20for%20the%20week%20of%22&restrict_sr=1&sort=new))",
        "num_comments": 146,
        "comments": [
            "I want to buy some records, but should I wait with the heat, I know they can warp. could it be fixed by packaging?",
            "Hello, \n\nI recently bought a few Picture LP‘s and wanted to hang them on the wall in a picture frame and I wanted to ask if anyone has some recommendations on which picture frame to use or any advice in general because I am fairly new and don’t want anything to happen to them.",
            "I always dust off a record before playing, then i spritz it with a cleaner, then a microfiber cloth, then a drying bush. theres always a bit of dust left. i mean they look MUCH cleaner than the start. no more fingerprints, smudges and less dust than previous. but no matter how much i clean em seems like theres always a few flecks of dust I cant get off. Im a newer type of collector as in i havent been doing this as long as most. Ya'll have made me believe dust is the devil and its going to destroy the grooves in my precious/rare records if i cant get every spec. How much should i worry, and is there a better way to clean those pesky dust flakes.",
            "Today I got a brand new record (Chemtrails Over The Country Club by Lana Del Rey) and while playing it, my cat decided to jump on the turntable. She got scared and jumped off but left behind a pretty nasty scratch. Luckily it was on the second to last song, but now it loops the same 2 words over and over again. I googled it and watched videos, and after trying many methods it’s seems I’ve done more harm than good and now there are multiple loops (in the same spot). I’d much rather that section just skip than loop. It’s only a 10 second portion of song and isn’t the chorus or anything. If anyone could give some tips on how to get the issue to stop please let me know.",
            "Does county/location of plant matter when figuring out if something is an original pressing? For example I have the original US release of Let It Be, Would that be considered the OG pressing or not because presumably the UK version was pressed first during the same year?",
            "Hi! I recently purchased a pre owned vinyl however upon inspection it looks like there’s sticker residue on it for some reason? I wanted to ask what would be the best route for cleaning off the sticky off it.",
            "Hello everyone. I recently started collecting vynils from my favorite bands, I'm fairly new to the hobby and I found out that it is supposed to clean them regularly. I would like to ask what are some basic maintenance practices you should have with your records and, above all, the best cleaning products and sleeves, without spending a ton of money on it. Thanks in advance ;)",
            "VG listed record came as closer to Fair, smothered in scratches and all tracks have multiple skips. This record isn't rare ENOUGH for anyone to pay anything for this, especially in a discobag. Anything else I could do with it other than trash it? Already got a refund.\n\nPearl Jam - Ten (Europe 1992)",
            "Hi,\nAnyone know of any portable, battery-operated record players, with 16 and 78 rpm and/or enough pitch control to these speeds? Looking for a brand new one you don't have to plug in, that has these features, plus with belt drive turntable that is full size to hold 10\" or 12\" records. How about the best stylus to use to play 78s? or LPs or 45s in stereo or mono? Thanks!",
            "I just got a record player but the sound of the track playing directly from the vinyl record (that can be heard in addition to the sound from the amplifiers) is too audible and very annoying, especially the drum line. What could be the cause and what can I do ?"
        ]
    },
    "Anybody else HATE when there is no way to identify which is side A or B?": {
        "title": "Anybody else HATE when there is no way to identify which is side A or B?",
        "score": 267,
        "url": "https://www.reddit.com/r/vinyl/comments/1dr0kht/anybody_else_hate_when_there_is_no_way_to/",
        "content": "Just got a new record, and this is the second time recently I've opened a record to find there is absolutely no way to identify which side is which.\n\nWhy would they do that?!",
        "num_comments": 96,
        "comments": [
            "I’ve never seen one that doesn’t have it somewhere in the dead wax, but the less obvious, the more annoyed I am.",
            "When in doubt, check the dead wax for a hint, usually says which side",
            "That’s what we call a bad user experience. There is no logical reason to not label the sides in some way, even if it is in the art in a subtle form that may have to be figured out on first use. \nTo the designer of the label: you had one job.",
            "Looking at you Radiohead OKNOTOK....",
            "Ordinarily, but Beck's Hyperspace actually plays better imo with side B first (I guessed wrong the first spin). Now I *can't* listen to side A first.",
            "My personal favorite alternative to just saying A or B is the album Lungs by Florence and the Machine.  One side is In, the other Out.",
            "also: no mention of 45 rpm! always a 'fun' surprise :')",
            "seemingly all of flying lotus' vinyl releases do not have A/B/C/D markings on the labels. i've had to basically memorize the artwork and make sure when putting them back in the sleeve that they're facing in correct order for when i pull them back out. c'mon steve... just some tiny letters wouldn't hurt.",
            "Usually, if there are matrix numbers in the dead wax, the lower number is side A.\n\nIt isn't a hard and fast rule, tho'",
            "F#A# infinity has blank labels, but once you figure out the sides you can easily identify them by looking at the grooves (side B ends in a locked groove, so it doesn't have the deadwax groove that spirals near the end)"
        ]
    },
    "Find of the week!!!": {
        "title": "Find of the week!!!",
        "score": 95,
        "url": "https://i.redd.it/3a8chnhdle9d1.jpeg",
        "content": "Technics SL-1950",
        "num_comments": 15,
        "comments": [
            "Scored on a new player yesterday! It’s a Technics model SL-1950. It was priced at 20 but was half off, so I got it for $10. I don’t know much about the brand, but I knew this was an older table and looked well made and in good shape, so I took a chance on it! I currently use an Audio Technica AT-LP120-USB, which funny enough, I thrifted a year ago. I don’t know a ton about record players, but I’m curious which one y’all prefer and would keep personally. I figured out this funny-looking arm thing on the left is for stacking multiple records, which I think is a hilarious feature. I’m curious if anybody has used this model table before and what their experience is with owning it also if y’all know how to fix a sticky cue arm let me know!",
            "I have that pressing on black.made in Germany sticker. Pressed at Pallas Germany. Exquisite sound.",
            "Great score! I got mine for $17  about 7 years ago off a goodwill shelf, instantly recognized it from the strobe, and grabbed it. The fancy spindle is for 45's and double LP's with sides labeled A-C, and B-D or 1-3 and 2-4, stacked properly on the spindle they will automatically drop. You can find manuals online for users, and technical. \n\nI'd bring it to the shop, and have an Ortofon red properly installed and balanced, a cleaning and lubrication, you'll be good for another decade with a classic vintage turntable.",
            "That’s definitely a sweet find (model and price). Take good care of it and it’ll last you a lifetime :-)",
            "To answer your question, I would take an SL-1950 over an LP120 every day of the week.\n\nAnd twice on Sundays.",
            "Fuck yeah, that’ll play so many grails!!! 🔥🔥",
            "You scored an excellent vintage turntable. \n\nI have an SL-D1 and the SL-1600. Both are absolute workhorses and should serve you well for a very long time.",
            "Nice! I've got an SL-1900, it's a beaut.",
            "I used to have an SL-2000 from 1977, which seem to share a lot of parts, but yours is automatic and looks to have a better tone arm (just judging by looks). It was an incredibly fun and dependable turntable. I also thought it sounded great. Only issues I've had to solve was cleaning the speed adjustment pots to solve unstable speeds, replaced the RCA cables with an RCA bracket because it would hum badly or lose signal when moving the cable slightly. I also should have refilled the cue lever with some damping oil, as the tonearm lowered a bit too quickly, but I didn't know about this fix at that time.",
            "Hell yeah, welcome to the thrifted Technics club! Hope it lasts a long time!  I have an sl-3350 I found for $60 that’s been trouble-free for around 12-13 years."
        ]
    },
    "Why are Japanese records sought after?": {
        "title": "Why are Japanese records sought after?",
        "score": 33,
        "url": "https://www.reddit.com/r/vinyl/comments/1dr2wup/why_are_japanese_records_sought_after/",
        "content": "When I look on eBay for records, a lot of them are Japanese. Is it because records are more common in Japan or that Japanese records sound better?",
        "num_comments": 46,
        "comments": [
            "I buy Japanese records of Japanese artists. And they are hard to come by. \n\nJapanese pressings of U.S./British bands… I don’t really care. If I can get a clean copy at a good price with OBI sure. But I’m fine with a European or N. American press of the time.",
            "U can squeeze a couple more upvotes out of them if there's an extra ribbon with japanese writing on it ",
            "I’m a huge Beatles fan and I’m Japanese. From my experience, Japanese Beatles LP have great packaging, but generally speaking (with some exceptions here and there) I really don’t like their EQ choices. They favor boosting treble and lowering the bass on a copy (sometimes, not so great 2nd or 3rd generation one) of master tape. This is actually generally true for many albums by a US/UK rock bands from 60s, 70s and 80s. I understand most modern systems allow you to fix the eq but no thanks. I cannot be bothered to fix more stuff every time I want to play a record.  For Beatles LPs, I’m gonna stick to UK, Germany and Netherlands pressings. For me, obi, high quality dead-quiet-between-the-tracks vinyl and horribly translated lyrics sheet (the curse of knowing how to read Japanese)  don’t justify the prices these LPs are going for. From a collecting point of view, I totally get it, but sound quality is what makes vinyl special for me and unless we’re talking Jazz or Japanese artists, generally speaking, Japanese records don’t cut it for me.",
            "The other point that I can't see already mentioned, is that second hand LPs from Japan are typically very well looked after and often down-graded by sellers (e.g. a 'VG' from Japan might match a 'NM' from sellers in some other regions). This has at least held true on each occasion I've imported from Japanese stores.",
            "Japan never really dropped physical media, especially vinyl and CDs, like the US. It’s remained a significant part of the market there for decades. Because of this active and dedicated market, the pressings and packaging tend to be high-quality.",
            "From what I've read, Japanese pressings have, in most cases, always used fresh virgin vinyl for their albums. And compared to other parts of the world, also tended towards smaller numbers in a pressing leading to the master disc getting less wear and tear which leads to overall better quality of the albums that are pressed from it.",
            "Just discovered a Japanese act called Mrs Green Apples…apparently they’ve been around for years…new single “Lilac” most creative and interesting pop I’ve heard in years (and I’m in my late 60’s) Obviously I don’t understand a word. Nevertheless,have already asked my son to pick me up some albums when he goes skiing in Japan later in the year.",
            "Japanese albums are just overall higher quality. From the actual vinyl, to the cover, and to the mastering, Japanese albums were made with quality as the priority so most of the problems that other countries albums could have, such as occasional pressing flaws, are much less common. While Japanese mastering may not necessarily sound the best in all instances, it is said they were meant to replicate the masters as well as possible, not improve them. Whether that is fully true or not I’m not sure, google it and find out for yourself. Also people just like the OBIs",
            "They were pressed on the best vinyl in the world. Incredibly silent. \n\nHaving said that, mastering can be hit-and-miss. But when they get it right, they’re as good as vinyl can possibly get.",
            "Japanese mastering engineers and pressing facilities have always been top-notch, some old pressings are indeed better, just because the pre-pressing process has been done with extreme care to avoid any misalignment during the different steps leading to the final pressing matrix. I remember one such Japanese actor requesting we send them a copper master instead of lacquer for example, lacquer was just not admissible in their process for some doctrinal reason i guess  - very very careful and precise mindset."
        ]
    },
    "Think this is my new favourite album just for the inventive artwork": {
        "title": "Think this is my new favourite album just for the inventive artwork",
        "score": 6,
        "url": "https://www.reddit.com/gallery/1drbefm",
        "content": "So this came in the post today as a gift from my wife. Scene Queen is kind of a polarising taste, but it’s a genuinely fun listen and this whole 2000’s internet and porn pop up motif for the artwork is so vibrant, I can’t help but really enjoy it. I can’t remember the last time I saw an album cover with quite this much individuality. Fits the musical content really well.\n\nRecord plays really nicely, too. I guess it’s a guilty pleasure but it’s honestly more just a good bit of fun. ",
        "num_comments": 0,
        "comments": []
    }
}