{
    "Jolly Jurist Justice - Weeklyish Discussion Thread - June 21st, 2024": {
        "title": "Jolly Jurist Justice - Weeklyish Discussion Thread - June 21st, 2024",
        "score": 90,
        "url": "https://www.reddit.com/r/VirtualYoutubers/comments/1dl0wfx/jolly_jurist_justice_weeklyish_discussion_thread/",
        "content": "Was it Justice is Cute or Cute is Justice?\n\nI wonder what brought that on...\n\n[Follow the Rules](https://www.reddit.com/r/VirtualYoutubers/wiki/index/rulesandguidelines)\n\n[Previous Weekly Thread](https://www.reddit.com/r/VirtualYoutubers/comments/1detc1m/yielding_yachts_yawning_weeklyish_discussion/)",
        "num_comments": 403,
        "comments": [
            "Hololive English 4th Generation Unit -Justice- Debut\n\n[Thread](https://www.reddit.com/r/VirtualYoutubers/comments/1dlc6ss/hololive_englishs_new_4th_generation_justice_unit/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n\nDo talk and use this specialized thread for all things new gen (rather than the weekly thread), especially regarding expectations, live debut watching, and more across these two days.",
            "[English speaking Yagoo, talking about overseas expansion ](https://www.youtube.com/watch?v=-CYSz5lu3g0)\n\nLooks like Holo is gonna start ramping up overseas stuff",
            "[Kiaras watchalong for the Austria - Poland match has begun](https://www.youtube.com/watch?v=tggPK1mpGWw)\n\nPS:  \nSlightly lol'd that Cover actually legit puts out an article for once were they outright say East-Asia and Europe are what they want to expand into next and apparently didnt tell their one Talent already living there lmao",
            "In less than 100 years there will be vtuber merchandise experts on Antiques Road Show.",
            "[https://twitter.com/momosuzunene/status/1804143578299666849?s=46&t=IQ79cksnUeCTRZ7I8SmoqQ](https://twitter.com/momosuzunene/status/1804143578299666849?s=46&t=IQ79cksnUeCTRZ7I8SmoqQ)\n\n【✨BIG NEWS✨】\n\nKAIGAINIKI\\~\\~\\~\\~\\~\\~♡\n\nNENE GOOOOOOOOO✨ACGHK2024✨\n\nI look forward to meeting you all🍑💛\n\n[https://m.facebook.com/story.php?id=100064742494395&story\\_fbid=864969219004487](https://m.facebook.com/story.php?id=100064742494395&story_fbid=864969219004487)\n\nhttps://preview.redd.it/yev7rblcjx7d1.jpeg?width=1145&format=pjpg&auto=webp&s=d7fa231397bc639c63553adf57f3c9ed960548ff",
            "Good news on Mio’s health from Subaru. Stream is still ongoing.\n\n[https://www.youtube.com/live/CN6jdwWX8hg?si=ZYyB8HnBbOGr8QLS](https://www.youtube.com/live/CN6jdwWX8hg?si=ZYyB8HnBbOGr8QLS)\n\nhttps://preview.redd.it/c5rmllsa818d1.jpeg?width=1284&format=pjpg&auto=webp&s=4ea1a835c9270e221a67420ea4a2260100a13736",
            "【COVER】OTONABLUE (Elizabeth Rose Bloodflame)\n\nhttps://youtu.be/zZXW_iXIrss?si=tax_uS65cEk6RraR",
            "【MV】Hitomania - Gigi Murin (Cover)\n\nhttps://youtu.be/bmT_cEfOTJE?si=CgYOjJPGpeeRxVww",
            "[Sora playing HoloEarth](https://www.youtube.com/watch?v=e_k2JiT8JDg)\n\nI guess the line outside the shops are tradition now. Iirc people did it for Watame, IRyS, Bae, Ollie, and now Sora.\n\nEdit: waiting patiently\n\nhttps://preview.redd.it/m624g4etow7d1.png?width=2559&format=png&auto=webp&s=6f13dfaa632dd4125b59f0e60b1ddcd53bcc9183",
            "[YAGOO](https://www.youtube.com/watch?v=-CYSz5lu3g0)"
        ]
    },
    "Weekly VTuber Spotlight: Bonnie Barkswell - June 17, 2024": {
        "title": "Weekly VTuber Spotlight: Bonnie Barkswell - June 17, 2024",
        "score": 203,
        "url": "https://www.reddit.com/r/VirtualYoutubers/comments/1dhyhw2/weekly_vtuber_spotlight_bonnie_barkswell_june_17/",
        "content": "# [Bonnie Barkswell](https://www.youtube.com/@BonnieBarkswell)\n\n[ All aboard! Brave Group’s globie Gen 2 #Solstia 's goodest girl!, Airship Engineer Bonnie Barkswell from Gen 2! 🔧 Expert at napping & yapping! Enjoyer of art & snacks 🥰 ](https://preview.redd.it/ys63go8wu47d1.png?width=2010&format=png&auto=webp&s=3c4f26bc99fba2ec1c62df86620288dbfb97f7ae)\n\n# Overview \n\n* Name: Bonnie Barkswell\n* Illustrator: [@Anzu\\_1026](https://x.com/Anzu_1026/status/1781421238398914688)\n* Affiliation: Globie (Brave Group Europe)\n* Active since: April 2024\n* Nicknames: Ballswell\n* Oshi Mark: 🐶🔧\n\n&#x200B;\n\n[Character design by Anzu\\_1026](https://preview.redd.it/bo57bqeav47d1.jpg?width=2048&format=pjpg&auto=webp&s=70cf66f0af4195b97e354637842f9aa8faf67fe5)\n\n# Introduction\n\nBonnie Barkswell is a female English-speaking VTuber member of globie  as part of their 2nd generation, under the subgroup, Solstia, alongside  Kiri Kilovolt, Rubarb N. Kustard, and Alicja Da Lontano. Bonnie also  speaks conversational Japanese, and can understand a little French.\n\nBonnie is a Golden Retriever Airship Engineer with a Steampunk style,  complete with goggles, leather gloves, sturdy boots, large overalls and  various tools hanging from a belt. She also has short, orange hair with  white tips and a paw-print marking on one of her ears. \n\nBonnie loves to chat and free-talk with her viewers and collaborate  with other VTubers. She also enjoys doing Karaoke streams, cozy games  and  and playing old point-and-click adventure games from the 90's.  Bonnie is also a hobbyist illustrator and sometimes does art streams and  posts her work on twitter. She likes to draw herself or fan-art of  other VTubers. Bonnie's favourite streams are ones where she can push  the boundaries and be innovative and creative with assets and viewer  interactions.\n\nOn 17th April 2024, Bonnie was the first member of globie to reach  over 10,000 subscribers on Youtube, 2 days before her debut on the 19th.  She then reached 20,000 subscribers on 7th June 2024. Her debut stream  consisted of a short skit inspired by a cruise ship safety briefing  video, and a minigame in which chat had to use various tools to \"fix\"  the pipes and clear the room of steam, revealing her model. \n\n# Trivia\n\n* Bonnie is often teased on twitter for being \"old\" and some of her  most viral tweets have involved memes from the community joking about  \"refiring a dying star\". One of these memes even being featured in a  \"Know Your Meme\" entry. Her viewers also coined the terms \"Pupmaxxing\"  and \"Litterpilled\" in reference to her.\n* Bonnie revealed on her debut that she is a Golden Retriever and 4  in dog years, making her age approximately 28-32 years old in human  years. \n* Due to Bonnie's first ASMR stream being derailed by many  high-value donations from viewers, it is now a running joke in the  community that every Friday stream is called \"Findom Fridays\".\n* It's a common misconception in her lore that Bonnie is the  Captain of the airship, however she is actually just the Engineer and  often refers to a mysterious Captain figure who flies the ship. One of  her goals at debut was to be promoted to Captain.\n* Bonnie has stated that one of her biggest passions is travelling the world and has so far visited over 22 different countries.\n* When Bonnie began streaming, she had a small collection of 4 or 5  Hatsune Miku figurines. However, due to a large number of donations  from her viewers via Throne, she now has over 20 different figures.\n* Bonnie loves space and sci-fi movies like Interstellar,  Hitchhiker's Guide To The Galaxy and Gravity, but her favourite movie of  all time is The Martian.\n* Bonnie's catchphrase at the start of her streams is \"BALLS OUT  FOR BONNIE! 🥎\", a reference to her first tweet and to how dogs are  commonly associated with tennis balls.\n\nLinks\n\n* [Youtube](https://www.youtube.com/@BonnieBarkswell) \n* [Twitter](https://x.com/BonnieBarkswell) \n* [TikTok](https://www.tiktok.com/@bonnie.barkswell) \n* [Instagram](https://www.instagram.com/bonniebarkswell/) \n* [Reddit](https://www.reddit.com/user/Bonnie_Barkswell/) \n* [Throne](https://throne.com/bonniebarkswell) \n* [Twitch](https://www.twitch.tv/bonnie_barkswell)\n* [Streamlabs](https://streamlabs.com/bonniebarkswell/) \n* [Globie website](https://globie.net/) \n* [Globie twitter](https://x.com/globiesocial) \n* [Globie Subreddit](https://www.reddit.com/r/globie_hub/) \n* [Globie Youtube](https://www.youtube.com/@globieofficial) \n\n[ Goodest girl!🐶 art by  @Anzu\\_1026](https://preview.redd.it/hzfuypx1z47d1.jpg?width=2000&format=pjpg&auto=webp&s=f57678fd6570fbb17b46b0f1f218d70ef977c2b2)",
        "num_comments": 12,
        "comments": [
            "WHOA! A DOG! 🫵\nThank you for your help setting this up 🥰",
            "After watching last nights's Phasmo collab all I can say about Bonnie Barkswell is that Bonnie barks well.",
            "She's live right now with ~~Mliking Monday~~ Mommy Monday\n\nhttps://youtu.be/wV2TkaJUXSE",
            "HAG LOVE HAG LOVE HAG LOVE.",
            "***\n\n######Editor's Notes\n\nThank you for reading this week's spotlight! Thanks to u/Bonnie_Barkswell writing and providing the information for this spotlight.\n\nAs always, if there's a VTuber you think we could spotlight for the future then feel free to comment about it and depending on the circumstances we may be able to feature them. If you want to help write one of the spotlights on a VTuber that you know about, then feel free to reach out as well by sending us your entry to our modmail which you can find in the sidebar. \n\n***\n\n#####Previous Spotlights:\n\n- [**FalooVT - January 22, 2024**](https://redd.it/19df2wh)\n- [**Rurudo Lion - January 29, 2024**](https://redd.it/1adqqdj)\n- [**Kyaramel - February 05, 2024**](https://redd.it/1ajfi69)\n- [**Maru Nanamona - February 19, 2024**](https://redd.it/1aut7yn)\n- [**RainyRentyn - February 26, 2024**](https://redd.it/1b0ho7z)\n- [**Kiona - March 04, 2024**](https://redd.it/1b6bl3t)\n- [**Saori - March 18, 2024**](https://redd.it/1bhk8au)\n- [**Zli the Slime - March 25, 2024**](https://redd.it/1bnbn9b)\n- [**Bajiru - April 01, 2024**](https://redd.it/1bt2cmo)\n- [**Eleska Bell - April 08, 2024**](https://redd.it/1byxoby)\n- [**Twig - April 15, 2024**](https://redd.it/1c4jxeb)\n- [**Liari - April 29, 2024**](https://redd.it/1cfzkrc)\n- [**Mirai Xavier - May 06, 2024**](https://redd.it/1clhllh)\n- [**USS New Jersey BB-62 - May 13, 2024**](https://redd.it/1cqv58y)\n- [**Nanami Urara - May 20, 2024**](https://redd.it/1cwh14u)\n- [**Kiri Kilovolt - June 10, 2024**](https://redd.it/1dcl32j)\n\n***",
            "Hag love",
            "Good timing for this promotion. I wonder how many decided to check her out after seeing this and experienced yesterday's stream as their first Bonnie stream. That'd be quite the start for sure.",
            "She’s the coolest",
            "She's great! I love how comfy her voice is. Don't ask her about the fan-fic they wrote about her...",
            "Bonnie stole my tennis balls. 10/10 Dog behavior!"
        ]
    },
    "Gigi Murin【DEBUT】GG STANDS FOR GIGI! 👧 #hololiveEnglish #holoJustice": {
        "title": "Gigi Murin【DEBUT】GG STANDS FOR GIGI! 👧 #hololiveEnglish #holoJustice",
        "score": 553,
        "url": "https://youtube.com/live/15aufXwBIKw",
        "content": "",
        "num_comments": 102,
        "comments": [
            "Ngl this line up really makes me wonder who’s all was auditioning behind the scenes lol. Like I never really expected >!eilemonty!< and >!biscotti!< the talent pool must be insanely good",
            "D&D FAN?! \n\nBRO COUNT ME THE HELL IN BOIS",
            "anyone can figure who she is from her voice?",
            "So the mascot is an active part of the model. That’s so fuckin cool",
            "Congrats to both Liz and Gigi! I was a fan of their PLs and found them super entertaining and talented. They averaged like 80 viewers… so I’m glad they get a huge audience now!",
            "This lore video is an acid trip.",
            "is she >!biscotti!< ?",
            "~~111k~~ 131k subs and ~~50k~~ ~~117k~~ ~~120k~~ ~~117k~~ 115k watching already. Wowzers",
            "That's quite a unique debut(Hololive). Interactive chat is something I have not seen in a debut. Previous debuts sometimes feel prerecorded.\n\nDid she make that chat controlled game? If so, she really deserves the spot.",
            "Hope she doesn't feel too bad about failing that math check, EBR also borked her height conversion, lol"
        ]
    },
    "Elizabeth Rose Bloodflame【DEBUT】Ello Ello Ello~! 💄 #hololiveEnglish #holoJustice": {
        "title": "Elizabeth Rose Bloodflame【DEBUT】Ello Ello Ello~! 💄 #hololiveEnglish #holoJustice",
        "score": 537,
        "url": "https://youtube.com/watch?v=NdlSHUEVCj8",
        "content": "",
        "num_comments": 109,
        "comments": [
            "This girl is actually Yuri-Shipping Kiara and Calli LIVE!",
            "It DEF sounds like, >!**EileMonty**!<",
            "How in the god *damn* does Yagoo keep finding these women who don't already have million dollar contracts when they ought to\n\nFirst it was >!~~Caitlyn Myers~~!< Nerissa Ravencroft, and now it's the Queen With The Pipes. I cannot believe she wasn't already totally sewn up.\n\nAnyway that's one hell of a way to come out swinging.",
            "Oh this girl is absolutely getting shipped with Risa.",
            "Jesus. ~~107k~~ ~~117k~~ 128k subs and ~~52k~~ ~~118k~~ ~~122k~~  120k viewers already",
            "Unintentional FFXVI reference with her...\n\nAs soon as she said her fans are Rosarians, I immediately thought of the Shields of Rosaria, and then she even went on after to say the fans are Shields if she's the Sword. Just a really nice detail on top of everything else here lmao.",
            "Wat, oh it ended lmfao",
            "I can unironically say Hololive has connections to The Living Tombstone now.",
            "~~^(So are we taking bets on who folks used to be?)~~\n\nI actually do wonder if some of these folks might be previously unknown-ish talents in the V-Tubing sphere, like some of the older JP and ID members were.",
            "Is that Bettel in a fur suit?"
        ]
    },
    "Do other girly Vtubers have a similar thing?  😭😂 (I don’t mind but wowww)": {
        "title": "Do other girly Vtubers have a similar thing?  😭😂 (I don’t mind but wowww)",
        "score": 144,
        "url": "https://i.redd.it/n8qru159s18d1.jpeg",
        "content": "My YT: ZyaaaVT",
        "num_comments": 15,
        "comments": [
            "Female Vtubers in general have very male dominated viewership",
            "I'm a man tuber and still have that ratio. It might just be the demographics of the games we play.",
            "Was that... unexpected?",
            "Yes, it’s actually a running joke among the girls of Phase Connect that their female viewership is too low to get sponsorships from otome games they might want to play on stream. In particular, some of them wanted to get sponsored by Love and Deepspace I think it’s called. Chisaka Airi even did a joke stream to brainstorm ways to get her female viewership up, and that stream had even less female viewers than average.\n\nSome girls do get higher female viewership, but I think it’s a matter of the type of content you make and what you choose to talk about.",
            "The female Vtubers are everywhere meanwhile the male viewers are bountiful\n\nExpect this to stay consistent for the future\n\nIt takes a lot more work for male Vtubers to stand out too imho (especially if you don't have an instantly-pleasing/sultry voice)",
            "Connor/Cdawgva used to have 93% female viewership back when he started out. So it can happen the other way around too. (Even if he wasn't really a Vtuber back then).",
            "Yes",
            "I think the Vtuber audience is just predominantly male. I can only think of a few vtubers with a majority female audience, and it's usually the BFE type male vtubers. Not always, of course, but that's the common theme I've noticed.",
            "Hey check it out, the male loneliness epidemic in analytic form.  Most women don't need to watch a woman on a screen, they can just hang out with their friends.",
            "vtuber viewers are just horny weird guys, sorry you had to find out like this"
        ]
    }
}