{
    "Get Officially Verified as a Vision Pro Owner": {
        "title": "Get Officially Verified as a Vision Pro Owner",
        "score": 229,
        "url": "https://www.reddit.com/r/VisionPro/comments/1ah5kmg/get_officially_verified_as_a_vision_pro_owner/",
        "content": "We are introducing a new custom \"Verified Vision Pro Owner\" Reddit Flair. If you have it, users will trust that you are speaking as someone who has extensive experience with Vision Pro. In [our Discord server](https://discord.gg/yRJmAhAQvX), verified owners also have access to exclusive channels to chat and share content with other owners!\n\n[This flair will appear next to your username](https://preview.redd.it/iboi52gnq6gc1.png?width=1238&format=png&auto=webp&s=666a321a42cffafb6cdf8a4820f93b793d7865f2)\n\n**To Get Verified:**\n\n1. Hand-write your Reddit username on a slip of paper.\n2. Take a picture of the slip of paper next to your Vision Pro.\n3. Send your picture as a comment on this post.\n\nIf you would like to be verified on Discord please make sure that you have joined [our Discord server](https://discord.gg/yRJmAhAQvX), then TYPE your Discord username in your comment alongside your picture.\n\nFor the Developer flair, follow the instructions in [this post](https://www.reddit.com/r/VisionPro/comments/1b201up/get_officially_verified_as_a_vision_pro_developer/).",
        "num_comments": 2830,
        "comments": [
            "I was wondering why people were in Apple Store were taking pictures of a Vision Pro with their name written on a  piece of paper. /s",
            "What is this “paper” you speak of?",
            "Let me try “reddit chat”\n\nedit : it worked",
            "Thanks for verification, but I don't see any badge on me( Also I believe app makers should have \"Apple Vision Pro Creator Verified\" badges, how do you think?",
            " I can’t get the image button to work on vision, Pro, and I can’t find it on the Reddit app. Am I going crazy?",
            "Commenting on Get Officially Verified as a Vision Pro Owner...",
            "Thank you for adding /s to your post. When I first saw this, I was horrified. How could anybody say something like this? I immediately began writing a 1000 word paragraph about how horrible of a person you are. I even sent a copy to a Harvard professor to proofread it. After several hours of refining and editing, my comment was ready to absolutely destroy you. But then, just as I was about to hit send, I saw something in the corner of my eye. A /s at the end of your comment. Suddenly everything made sense. Your comment was sarcasm! I immediately burst out in laughter at the comedic genius of your comment. The person next to me on the bus saw your comment and started crying from laughter too. Before long, there was an entire bus of people on the floor laughing at your incredible use of comedy. All of this was due to you adding /s to your post. Thank you.\n\nI am a bot if you couldn't figure that out, if I made a mistake, ignore it cause its not that fucking hard to ignore a comment",
            "How did you scrape up the battery pack already?",
            "Not a creator myself but I like the idea",
            "You need to clarify what exactly are you verifying here 💀"
        ]
    },
    " Inception....A.K.A.  mirroring  Watch to  Vision Pro the hard way!": {
        "title": " Inception....A.K.A.  mirroring  Watch to  Vision Pro the hard way!",
        "score": 40,
        "url": "https://i.redd.it/nc3ct80l7e9d1.jpeg",
        "content": "Using the Apple Watch mirroring option on an iPhone, which with iOS 18, will also be able to be mirrored to Mac and then shown as Mac Virtual display on  Vision Pro.   This is a lot of hops to avoid just looking at one's wrist via pass through.  One layer could be removed/swapped out by using airplay from the phone directly to the  Vision Pro or FaceTiming the iPhone but both those methods would take some interaction on the iPhone itself. \n\nWould be great if they just floated a mirrored   Watch screen directly over your watch when looking at   Watch much like the new floating control panel clock/battery widget when looking at back of hand gesture.  This could be larger and floating above the wrist and still be effective solution versus the four layer inception method. ",
        "num_comments": 10,
        "comments": [
            "iPhone mirroring refuses to connect when im mirroring my Mac",
            "I am assuming this is done using the developer cable?",
            "Imagine how good everything need to work to seamlessly do this",
            "What information could possibly be on your watch that you don’t already have in your VP, MacBook and Phone already ? \n\nHow many copies of the same texts and how many clocks showing the same time do you need ?",
            "it might be using the same protocol which limit 1 connection at the time",
            "Just plug your iPhone to your Mac, no need for an AVP dev cable.",
            "I read on another thread that a user tried it and it doesn't work. I'll have to test myself :)",
            "I tried and it doesn’t work.",
            "Same for me!!!!!!!",
            "*Imagine how good*\n\n*Everything need to work to*\n\n*Seamlessly do this*\n\n\\- Disruptor2211\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")"
        ]
    },
    "We still don't have VR videos for use 100% of potential": {
        "title": "We still don't have VR videos for use 100% of potential",
        "score": 3,
        "url": "https://www.reddit.com/r/VisionPro/comments/1dra7t3/we_still_dont_have_vr_videos_for_use_100_of/",
        "content": "After avp received os 2, it significantly improved the quality of vr video and display in general.  But all the video platforms now (YouTube, deovr) and so on cannot offer the quality that would satisfy Apple's performance and displays.  The only and highest quality videos that will reveal the potential of vr today are, oddly enough: huge NSFW videos, 8K 60FPS videos, downloaded and launched in mono player.  Unfortunately, streaming 4k video in the browser is not worth the game.  But now Apple is creating new content with the help of its new cameras, I hope that this year we will see new tools for shooting, as well as rendering, perhaps an AI function will appear to improve the quality of any video on the fly and get rid of the gigantic sizes of uncompressed video.  So we will get VR videos that look like regular 4k 2d videos on YouTube.",
        "num_comments": 4,
        "comments": [
            "Immersive is flat out different than shooting typical film/video, from storyboards forward. The only content that will look good at 180 was content shot in and for 180.",
            "Frankly even the current 8K videos look like crap on AVP when done immersive 180°; forget about 360°. They look great flat; but once stretched to 180° they lose sharpness. \n\nContent creators will figure it out but it’s gonna take a long time.",
            "Here's a hot take: two streams of video will never be enough, no matter the resolution or frame rate. We want captures that are similar to the environments-- 3d geometry scanned, textured and animated in the foreground, then video to capture the background. That's the interesting step forward to me, 8k vs 6k vs Nk is still just a head-lock. I think people are underestimating how interesting the environments are-- esp as they are (slowly, slowly, ever so slowly) getting more complex and animated.",
            "This is 100% the correct answer. We aren't going to get truly immersive content until we create Volumetric media studios, lined with cameras, that will piece together the images in real time. These already exist but only in major experimental spaces, so it's just a matter of time for the creators to make it happen."
        ]
    },
    "MX ink please": {
        "title": "MX ink please",
        "score": 3,
        "url": "https://www.reddit.com/r/VisionPro/comments/1dr9ioq/mx_ink_please/",
        "content": "I hope we can have it before Apple Pencil come to us.",
        "num_comments": 0,
        "comments": []
    },
    "I underestimated the effort it takes translating an app... not just the language but the cultural and colloquial nuances too. Still, 1000% worth bringing spatial computing to the world 🌏! ": {
        "title": "I underestimated the effort it takes translating an app... not just the language but the cultural and colloquial nuances too. Still, 1000% worth bringing spatial computing to the world 🌏! ",
        "score": 23,
        "url": "https://v.redd.it/orizce24xd9d1",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Just checked out the update and it looks great. Any suggestions or lessons learned that you can share with other developers in the same situation?",
            "Congrats to all the new Apple Vision Pro owners 🥳! To celebrate the launch in Asia, I updated Museas to include new artworks from 12th century Asian artists too 🏯👹. Personal favorites: \"Listening to the Qin \" (c. 1100) by 宋徽宗 and \"Dragons and Clouds\" (c. 1600) by 俵屋宗達.\n\nThe app remains free for all regions! Just excited to be sharing my interest for art history in spatial computing to other side of the world :D.\n\nMuseas: [https://www.museas.com](https://www.museas.com)\n\nApp Store: [https://apps.apple.com/app/museas/id6496682427](https://apps.apple.com/app/museas/id6496682427)"
        ]
    }
}