{
    "Weekly Questions and Recommendations Megathread - Need some help? - Jun 23": {
        "title": "Weekly Questions and Recommendations Megathread - Need some help? - Jun 23",
        "score": 7,
        "url": "https://www.reddit.com/r/visualnovels/comments/1dmlmda/weekly_questions_and_recommendations_megathread/",
        "content": "**Welcome to the** [**/r/visualnovels**](https://www.reddit.com/r/visualnovels) **Weekly Questions and Recommendations Megathread!**\n\nAny and all questions/recommendations related to visual novels are permitted in this thread. This includes recommendation questions, technical questions, as well as meta questions about the subreddit. No matter if your question is small, big, or seemingly impossible to solve. Anything.\n\nBut please don't forget that our [**rules**](http://www.reddit.com/r/visualnovels/wiki/rules) still apply. Summarized, that means no unmarked spoilers, no piracy in any shape or form, give warnings for 18+ stuff, and be nice!\n\n**Useful links to check out before asking questions or for recommendations**\n\nGeneral:\n\n* [VNDB: The Visual Novel Database](http://vndb.org/) \\- A fantastic resource for anything and everything visual novels. The visual novel equivalent to IMDB or MAL. It's where you'll find the answers to 90% of your questions.\n* [Guide to Japanese](https://docs.google.com/document/d/15uvv72eVFBtcOlfHaHUfT_HhZsgWxd7VjT9u-zVSwdw/pub)\n* [This recommendation site may be useful if you're new to reading visual novels!](https://old.reddit.com/r/visualnovels/wiki/recommendations)\n* [Consider this recommendation site if you're interested in reading a visual in Japanese.](https://old.reddit.com/r/visualnovels/wiki/recommendations)\n* Looking for a relatively easy VN to read in Japanese? [Click here!](https://docs.google.com/document/d/e/2PACX-1vSoafwp4Ig2hqG1n_vH2WP2QFMPeWD08fo4k-jfGceMmDDDRdFSbkAQyMpV_mbhFaIHuSmrOC69mWTi/pub)\n\nFrom our [wiki](http://www.reddit.com/r/visualnovels/wiki/index):\n\n* [Having trouble with a visual novel?](https://www.reddit.com/r/visualnovels/wiki/problems) \\- A page with some possible solutions and links.\n* [How to Hook and Extract Visual Novel Text](https://www.reddit.com/r/visualnovels/wiki/vnhooking) \\- A how-to on dealing with untranslated visual novels.\n* [Buying visual novels](https://www.reddit.com/r/visualnovels/wiki/buy) \\- Where and how to buy visual novels, translated and untranslated.\n\nMore awesome and useful links can be found [here](https://www.reddit.com/r/visualnovels/wiki/links).",
        "num_comments": 103,
        "comments": [
            "Anyone have recommendations for buying physical copies of visual novels in Japan?",
            "Where can I buy VN from?\nI am from south asia and all the sites are of US.",
            "I haven't owned Steam Deck yet but I want to know that ja\\_JP.UTF-8 is installed under SteamOS 3.6.8 by default ?",
            "Can you recommend a VN with some cute romance? Preferrably one that ends happily.",
            "Would it be better to start Witch on the Holy Night or Tsukihime ?",
            "need recommendation vn denpa\n\nhii, I'm looking for Denpa VNs to read, so I'm open to recommendations I'm more looking for non-mainstream stuff",
            "Does anyone have a Suggestion for an english visual novel that is about moving on/letting go?",
            "Where do I find visual novels without adult content?",
            "I'm playing Dohna Dohna  day 66 just started chapter 10 and twice now in combat I've had one of the other currently deployed characters assist Kuma when he uses his skill A first time it was Medico second time it was KiraKira and I can't find any skill or badge that is causing it to trigger. Does anyone know what triggers this and is it specific to Kuma or can other characters get assisted when they use a skill?",
            "Is there any difference between the My Girlfriend is a Mermaid?! on the switch and the Refine version for ps4?"
        ]
    },
    "What are you reading? - Jun 26": {
        "title": "What are you reading? - Jun 26",
        "score": 8,
        "url": "https://www.reddit.com/r/visualnovels/comments/1dp6j3j/what_are_you_reading_jun_26/",
        "content": "**Welcome to the weekly \"What are you reading?\" thread!**\n\nThis is intended to be a general chat thread on visual novels with a focus on the visual novels you've been reading recently. A new thread is posted every Thursday at 4:00 AM JST (or Wednesday if you don't live in Japan for some reason).\n\nGood WAYR entries include your analysis, predictions, thoughts, and feelings about what you're reading. The goal should be to stimulate discussion with others who have read that VN in the past, or to provide useful information to those reading in the future! Avoid long-winded summaries of the plot, and also avoid simply mentioning which VNs you are reading with no points for discussion. The best entries are both **brief** and **brilliant**.\n\n**Use spoiler tags liberally!**\n\nAlways use spoiler tags in threads that are not about one specific visual novel. Like this one!\n\n* They can be posted using the following markdown: \\>!hidden spoilery text!< , which shows up as >!hidden spoilery text!<. Make sure there are no spaces at the beginning and end of the spoiler tag because this will break it for users on [http://old.reddit.com/](http://old.reddit.com/). In other words do this: >!properly hidden spoiler!<, but not this: >! broken spoiler tag !<\n\nRemember to link to the VNDB page of the visual novel you're discussing so the indexing bot for the [What Are You Reading Archive](https://www.reddit.com/r/visualnovels/wiki/wayrarchive) can pick up your post.",
        "num_comments": 15,
        "comments": [
            "I'm reading WA2 as well, Finishing Setsuna true ending route... It gets a bit repetitive when you get to coda",
            "[White Album 2](https://vndb.org/v7771) is so freaking sad man. I'm having to alternate between it and Majikoi so I don't get depressed. I watched the anime almost a decade ago and I remember liking it, so I decided to read the VN since I heard the anime only covered the prologue.\nJust finished IC, so I'm officially spoiler free from now on. I just want to give Setsuna a hug.",
            "Since Fate is getting a rerelease soon, I thought it was a great opportunity to read [Mahoyo](https://vndb.org/v777). So I finished it yesterday, and it was pretty good. However, my biggest complaint with it is that the pacing of the first half is awful. And don't get me started with Chapter 5. It dragged on way too long than necessary and felt like most of the scenes were them mostly running around. Everything before Chapter 9, the story seemed rather laid back and not much of a high stake. Soujuurou is super weird but he is so unintentionally funny. It was only after Chapter 9 that the \"good\" part I was waiting for finally came and that got me really into it. After finishing Mahoyo, I can't help but feel like certain parts of the story felt \"uncooked\". Like there were some things they didn't bother touching on again and some shit I frankly didn't understand. Either way, I still enjoyed it and I got a huge appetite to consume more fate stuff again. Probably should check out the Kara no Kyoukai novels",
            "i finished [subarashiki hibi](https://vndb.org/v3144) (my favorite piece of media by quite a margin now) and have started [umineko](https://vndb.org/v24) (played thru the opening sequence & theme song, not far in at all)",
            "okay [Totono](https://vndb.org/v7738)'s nsfw stuff was great until (SPOILERS) >!miyuki breaks the third wall to have sex with us the reader and clings on the idea that the reader would own a penis!< It was just not relatable at all and I couldn't skip it so I was just sitting there like a duck",
            "Just finished [Muv-Luv Alternative ](https://vndb.org/v92)last night and now that I've fully digested it, what a fucking experience the Muv-Luv trilogy has been. I went in completely blind to everything except for the critically acclaimed status of Alternative. Feel like its very hard to explain but Alternative kept on subverting my expectations of what was going to happen, but delivering even more. It exceeded my expectations when I expected it to kick right into the action instantly. But it didn't, it continued to build up the plot and lay way for an unforgettable final 3 chapters. \n\nI don't have many gripes if any. I adored Extra and Unlimited which made Alternative all the more special, especially when growing so attached to the characters. They are all deeply flawed and remained flawed till the end, but that just made it more endearing. Hell of an experience.",
            "I just finished[Symphonic Rain](https://vndb.org/v38). First of all, what a great OST.*Subarashii*, from start to finish the openings, the training of the songs, the endings, the arrangements, the voices, everything. I enjoyed it a lot.\n\nThe setting felt like that of a classic European romance, more so with the constant rain. It might be a matter of personal taste, but I found it to be a great place for the world of magic instruments. The mini-game grew on me more and more. In the end, I was playing some of the songs, although on easy levels. The lyrics of the songs, each with the character's sense, I found that to be great too.\n\n>!Even though I expected the final happy ending, it was still enjoyable.!<I loved that the characters weren't black and white, that the darker side was shown in different forms.>!Considering the MC's state, Fal's ending made a lot more sense to me.!<Phorni was such a charming character.\n\nI guess there were a couple of things that could liked different. >!Essentially, the story has a clear direction, but I think it could have been a little longer, and the sadder endings could have been more complex in their development and perhaps shown different \"happy\" aspects in them as well, the opposite applies for the happy ending.!<Above all, I leave with a comfortable note and feeling from this VN. I didn't know much about it, thought it would be a lighter story, but it ended up surprising me a lot.",
            "Just finished [Rance 2 kai](https://vndb.org/v18970). The plot was fun since it is impossible to get bored since Rance gimmicks always makes me burst out laughing. I didn't really like the gameplay that much, but it didn't bother me that much since the game is really short it took me only 12 hours to finish it and I raised both Rance and Sill to level 41 + all Cgs.\n\nOverall it was and entertaining game and it was an important entry to understand the origins of Shizuku and Maria and other characters that will shown up in the later games:\n\nscore: 6.5/10",
            "I'm replaying [Dungeon of Regalias](https://vndb.org/v18761). The gameplay is very simple and basic, but fun enough. The OST seems pretty average, though. The female cast is sweet. But I don't like the MC. He's 99% a horndog who let his dick to the thinking. And if his dick says \"Yes\", he doesn't care about when, where and the \"partners\" opinion in 99% of cases. Though he doesn't rape, it felt her and there rather \"manipulative\"? Telling just the things the partner wants to hear in order to get it on, or the woman is \"resisting\" but not really rejecting the advances + the actual act. You know the deal XD. And of course he's the absolute \"sex god\" in terms of szie and technique. But the latter seems to be the status quo for Astronau Sirius MCs. \n\nAlso been replaying Kyonyuu Fantasy 2+4. Still liking them, though I feel the final victory felt quite eyebrow-raising in 2. In 4, I thought it happened mostly because the enemy country/army was portrayed in a very binary ligh. >!Like Gunevia might have never become a General, but if the enemy soldiers would't have kicked the corpses of her fallen brethern, she had probably been more hesitant in switching to Astor's side, whereas everyone on Astor's side imediately trusts her incl. the MC of course + her plan that lead ultimately to victory.!<\n\nI kinda wish that KF5 doesn't use too much of the early \"abusive\" superiors like the 2 dudes whose names get  mispronounced frequently. I also wouldn't mind if the MC would start out on average standing instead of the very bottom just to lightly spice things up.",
            "Your comment has **not** been deleted. This is a request to edit your comment to link to the [VNDB](https://vndb.org/) page of the visual novel you are discussing. If your vndb link has potential questionable content on its cover/preview images you're unsure about, you can instead include '@v[number of vndb in URL]' (eg '@v1234') somewhere in your post.\n\nThis makes it easier for fellow readers to find the visual novel you're talking about, and also makes sure the indexing bot for the [\"what are you reading\" archive](https://old.reddit.com/r/visualnovels/wiki/wayrarchive) doesn't miss your reference. Thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/visualnovels) if you have any questions or concerns.*"
        ]
    },
    "Liquid announces \"Holy Slave Academy 3\"!": {
        "title": "Liquid announces \"Holy Slave Academy 3\"!",
        "score": 284,
        "url": "https://i.redd.it/icenq9j1ee9d1.jpeg",
        "content": "",
        "num_comments": 30,
        "comments": [
            "NLNS doing their job to keep the steets clean",
            "Nukige? Is the story worth it",
            "love the artstyle, I checked VNDB and the only recent game by the artist (Natsuhiko) that got an official translation is Suzukuri Dungeon, where he is only credited as an assistant. wish holy slave academy 2 would get a translation because the art is dope and the first game is a bit too old for me, not a fan of that oldschool anime style",
            "I hope this comes to the West.",
            "No chippai makes me sad. The smallest breasts are 2nd's Maya-size",
            "Do you know where to download the first 2 games?",
            "Kinda weird they basically just remade the exact same cover image from the second game. Couldn't even tell they were different at first.",
            "Is this a nukitashi reference ?",
            "Does somewhere exist an English version of the 2nd game?",
            "They are adding 6 new H-scenes for the heroines (5 are already revealed with each heroine in one of them) and 2 new H-scenes for Chisa. Also including the Towa DLC that was in the original"
        ]
    },
    "Summer Pockets anime announced for 2025 release": {
        "title": "Summer Pockets anime announced for 2025 release",
        "score": 104,
        "url": "https://www.reddit.com/r/visualnovels/comments/1dr0xjt/summer_pockets_anime_announced_for_2025_release/",
        "content": "https://x.com/key_official/status/1806870387734819260?s=19",
        "num_comments": 24,
        "comments": [
            "Please, please dont mess this up",
            "Why is everyone hating on Feel.? I liked Oregairu",
            "No Nomiki route and I'm out. I hope there are at least good figures that release because of the adaptation. It's pretty lacking at the moment.",
            "Studio Feel is not what you want for a VN adaptation... Probably why they kept silent about it for so long.",
            "If it aint made by KyoAni i dont fuckin want it",
            "Prima Dolls sucked though. They want another one?",
            "Maybe they keep Shiki as a \"secret\" character of sort (or keep for S2 but I doubt it), as lore-wise she >!pops up into story midway!<.  \nCutting Miki and Shizuku are understandable but Shiki is more important so cutting her out is weird.",
            "I THINK the little busters anime didnt have the ecstasy exclusive heroine so it might be the same here, just hope they dont screw it up by biting more than they can chew.\n\nDid something happen to kamome v.a? I remember liking her voice so its a shame but if at least shiroha is the same, im golden, wish for the ping pong noises to be animated.",
            "Feel made many good anime, Yosuga no Sora, Tsuki ga Kirei, its writer adapted Hinamatsuri, Oregairu, its director worked on Utawarerumono, Sola, Steins;Gate or Amagami etc.\n\nI guess it all depends on how long it will be, if only one cour then its doomed even before it starts.",
            "I had a tiny hope that the silence was because they were negotiating a secret deal with Kyoani (they only do IP they own these days).  Imagine what this could have been.  You just have to look at the current season of Sound Euphonium to see how much more care and detail they put into their animation than pretty much anyone else.\n\nProve me wrong Studio Feel!  Make me love your work!  I noticed the teaser doesnt even show Shiroha walking, sigh."
        ]
    },
    "[Nukitashi 2] Sure, why not!": {
        "title": "[Nukitashi 2] Sure, why not!",
        "score": 162,
        "url": "https://i.redd.it/ckhuvlxlxb9d1.png",
        "content": "",
        "num_comments": 14,
        "comments": [
            "I recall the reason the meteor was going to hit the island was also crazy",
            "Never did I ever think that I would read this combination of words in a sentence before. This game really goes beyond crazy, I love it ",
            "How hard would you have to nut in order to actually fragment a decent size gravel pile meteoroid with a diameter of say 10 meters?",
            "Dont lie, Shiravune ruined it, the censored art does not fit the theme and setting.",
            "Yep, that entire part was stupid ",
            "I dont know, I have rarely come across a game which goes this crazy ",
            "Pretty damn hard. \n\nNot a scientist btw. You probably couldn't tell.",
            "I meant in terms of hard numbers. I'm pretty sure a 10 meter wide ball of gravel is not going to be held together by gravity rather by static electricity forces mostly so essentially nothing, so the force required to break it apart is mostly going to come down to the inertia of each individual piece of gravel. I think I remember Sir Isaac Newton coming up with a formula that approximates how far a projectile will bury itself in a given material assuming the projectile is perfectly rigid and given the densities of the projectile and the material but I can't remember it at the moment.",
            "Well I can atleast say one thing with absolute certainty, our dick probably wont survive if we nut hard enough to destroy a meteor",
            "Love this game"
        ]
    }
}