{
    "Mégafil conseils personnalisés d'investissement - semaine du 24/06/2024": {
        "title": "Mégafil conseils personnalisés d'investissement - semaine du 24/06/2024",
        "score": 6,
        "url": "https://www.reddit.com/r/vosfinances/comments/1dn6hdy/mégafil_conseils_personnalisés_dinvestissement/",
        "content": "Ce mégafil regroupe toutes les demandes de conseils d'investissement, **merci de ne pas créer un nouveau post juste pour un conseil d'investissement.**\n\n&#x200B;\n\n**Quels sujets pour ce mégafil ?**\n\n* Tout ce qui concerne une demande d'aide personnalisée pour investir son argent, au sens large: Livret A, actions, assurance-vie, immobilier, autres...\n* Les autres sujets (actualités, budget, banque, impôts...) sont à traiter dans des posts séparés\n\n**Comment faire ?**\n\n1. Prendre connaissance de [l'article sur les risques auxquels on s'expose en investissant](https://www.reddit.com/r/vosfinances/wiki/index/risques)\n2. Prendre connaissance des [conseils standards d'investissements de vosfinances](https://www.reddit.com/r/vosfinances/wiki/index/conseilsstandards2) et s'en inspirer pour sa situation\n3. Prendre connaissance du [paysage des placements disponibles en France](https://www.reddit.com/r/vosfinances/wiki/stickies/ou_placer_mon_argent)\n4. Créer un commentaire dans le mégafil avec au moins les informations suivantes:\n\n* ton âge\n* tes revenus\n* ta situation familiale (marié, enfants, éventuellement régime de mariage : communauté réduite aux acquêts, séparation de biens, communauté, si tu ne sais pas c'est que tu es en communauté réduite aux acquêts)\n* tes investissements existants si tu en as\n* ton existant immobilier (locataire, propriétaire avec durée restante du crédit)\n* tes objectifs financiers à moyen et long terme (acheter une voiture dans 2 ans, un bien immobilier dans 5 ans, partir à la retraite dans 20 ans etc...)\n* ton appétence pour le risque\n\n**FAQ**\n\n* Je suis timide, j'ose pas parler d'argent ?  \n\\-> Rassure-toi personne n'en a rien à cirer, tu es anonyme ici, vas-y balance les chiffres.\n* Même si je suis anonyme je ne veux pas que tout Reddit sache que je suis riche (ou pauvre) !  \n\\-> Crée un compte jetable, tu ne seras pas le premier.\n* Je ne sais pas quels sont mes objectifs je n'arrive pas à me projeter au-delà de la semaine prochaine.  \n\\-> C'est dommage, se donner des objectifs c'est 50% du travail d'investissement. Fais un effort.\n\nEvidemment ces profils standards ne sont pas pour tout le monde. D'où les conseils personnalisés dans ce mégafil. De plus nous sommes très ouverts à la discussion, dans ce mégafil, sur les conseils standards.",
        "num_comments": 63,
        "comments": [
            "Bonjour à tous, j’ai 25 ans, je suis en CDI avec des horaires qui me libèrent la moitié de mes journées ( 7-14 ou 14h30-22h30 ). Je touche 1800€ par mois, je suis proprio d’un appartement depuis 1 ans avec une mensualité de 670€ par mois que je viens tout juste de mettre en location à 800€ par mois. En Septembre je vais emménager dans un appart que j’ai tiré d’un héritage, je n’ai donc pas de crédit sur celui-ci, je vais donc pouvoir bien épargner ( je vise entre 1000 et 1300€ par mois ). Ma question est que faire dans ma situation ? Je pensais refaire une grosse épargne pour pouvoir acheter puis relouer une nouvelle fois derrière. Puis continuer ainsi, mais je me demande si il n’y a pas plus intéressant à faire ?\n\nEn vous remerciant",
            "Bonjour\nJ'ai 65 ans, marié 1 enfant, je suis propriétaire  je viens d hériter de 30k € et compte tenu du contexte politique actuel je voulais savoir où placer ces petites économies (sans avoir à se préoccuper de la bourse tous les matins). Mon livret A est au maximum et j'ai deux assurances vie (12k et 15k €). Ma retraite me permet de régler mes charges quotidiennes.\nAppétence pour le risque faible.",
            "Pour ce besoin c'est soit AV, soit CTO à ton nom dont tu lui feras donation moyennanbt le paiement d'un notaire. Ce qui est cool c'est que ça purge toute plus-value effectuée pendant ta durée d'investissement et la valeur du CTO au moment du leg sera le PRU sur lequel la plus-value sera calculée pour ta fille.",
            "Il y a des gens avec des AV bien plus fournies que 70k. Ca ne me choque pas d'avoir un tel encours sur un seul \"compte\", surtout depuis l'introduction des fonds de garanti et depots qui te garantissent tes fonds jusqu'à 100 000€, j'imagine que les AV sont aussi eligibles.\n\nVendre l'appartement peut etre une bonne idée, quant à savoir où placer cet argent ça dépend vraiment de la situation de ta maman. Comme elle est atteinte d'une maladie qui à partir d'un moment nécessite une prise en charge médicale, si ce n'est pas déjà le cas, il ne s'agit absolument pas d'argent avec lequel tu vas pouvoir \"jouer\"donc livrets réglementés et bancaires en priorité. Comme il s'agit d'une belle somme tu peux mettre tout ce qui dépasse du livret A et LDDS sur un Bourso+ avec taux boosté de 0.5% grâce à boursoprim (10€par mois mais remboursé dès que tu atteints 25k€ placé, proportionnellement intéressant au-dela puisque pas de limite il me semble).",
            "Le PEA est la bonne enveloppe si tu prévois cet investissement en vue d'une retraite. Je te conseille clairement davantage les PEA de banques en ligne comme Fortuneo ou BoursoBank. A part les frais de transactions, qui sont de toute façon cappés à 0.5%, tu n'as aucun autre frais comme en appliquent souvent les banques tradi (frais de garde, etc...). \n\nLe PEA propose moins d'ETF qu'un compte titre ordinaire mais si tu veux aller sur des indices type S&P500 tu auras aucun probleme avec l'ETf ESE, ou PUST si tu veux du Nasdaq100.",
            "En priorité LEP puis Livret A/LDDS pour constituer une épargne de sécurité.\n\nEnsuite/en parallèle, un PEA pour anticiper le long terme (cf le wiki sur quoi mettre dedans), mais ce n'est pas une priorité tant que tu n'as pas un travail stable.",
            "Les minerais autre que l'or j'en sais rien, mais pour l'or j'en suis certain, il n'y en a pas éligible au PEA.\n\nD'ailleurs si tu es intéressé par l'or je t'invite à faire davantage de recherches et plutôt à t'intéresser à en posséder en physique, il y a peu de pertinence à chercher à y être exposé via ETF.",
            "Soit tu fais des recherches pour une stratégie stock pick soit tu regarde du coté des ETF à levier (LQQ pour nasdaq X2 ou CL2 pour MSCI USA X2).\n\nDans tout les cas, renseigne toi bien avant pour comprendre les risques associés.",
            "Plein de sujets sur le sous et de questions dans les précédents megatghread contiennent la réponse à ta question",
            "oui, par contre je conseillerais de renforcer l'épargne de sécurité en priorité car ce clairement pas beaucoup vu vos revenus et que vous ayez un investissement locatif (c'est recommandé ~3/6 mois de dépenses courantes et ceci hors provision pour vos dépenses liées à l'immobilier)."
        ]
    },
    "Finance dans un couple et achat ": {
        "title": "Finance dans un couple et achat ",
        "score": 2,
        "url": "https://www.reddit.com/r/vosfinances/comments/1drd4mp/finance_dans_un_couple_et_achat/",
        "content": "Bonjour tout le monde,\n\nMa copine et moi envisageons d’emménager ensemble, l'appartement que j'occupe étant un peu petit pour deux. Pour se faire j'envisage d'acheter un appartement (seul - préférence personnel + elle n'a pas l'apport / les moyens pour participer) pour que nous puissions y vivre tous les deux.\n\nLa question se pose concernant la gestion des finances. Il faut savoir que nous somme dans la trentaine (bien entamée), que je gagne environ le double d'elle (+/- 80k+bonus vs +/- 40k brut) et qu'elle n'a recommencé à travailler qu'il n'y a que très peu de temps (après plusieurs années sans rien donc pas d'apport / réserve).\n\nMa proposition est la suivante: je prends en charge 100% du financement de l'appartement (normal j'achète seul) et ne lui demande aucune participation (type \"loyer\"). Pour tout le reste (charges, vie commune, vacances, etc.) on fait 50/50. Cela ne m'empêche de pas l'inviter de temps à autre (ou vice versa j'imagine) pour sortir, weekend, etc. selon mes envies/moyens. Je précise également que tous les frais directement liés à l'appartement (et qui incombent normalement au propriétaire dans une relation propriétaire / locataire) seraient à ma charge (travaux à réaliser dans l'immeuble, etc.).\n\nDe mon coté ça me parait plus qu'équitable et si les rôles étaient inversés je sauterai sur l'occasion.\n\nMais ma copine me dit que ce n'est pas \"fair\", que mon net après remboursement de crédit sera toujours supérieur au sien (de quelques centaines d'euros j'imagine) et qu'elle souhaiterait qu'on répartisse les dépenses au \"prorata\" entre son \"net\" et mon \"net après remboursement de crédit\". Son raisonnement étant que ne pas faire au \"prorata\" c'est de \"l'argent en moins sur son capital personnel\" (filet de sécurité en cas de coup dur - séparation - etc.).\n\nJe peux comprendre qu'effectivement son idée du prorata est bien plus avantageux pour elle mais cela ne me parait pas \"juste\" comme façon de procéder; n'avoir aucun loyer à payer étant déjà une situation très enviable (surtout en île de France...) permettant de réaliser une belle épargne.\n\nQu'en pensez vous? Pour ceux ou celles dans une situation similaire, comment avez vous fait?\n\nMerci!\n\n  \nedit: ajout de quelques précisions",
        "num_comments": 6,
        "comments": [
            "OK pour le prorata mais qu'elle paie les charges comme une vraie locataire (hors loyer). Après avouons le, ta copine y gagne un max et pour le coup abuse un peu.",
            "Vu son état d'esprit, emménage seul et ne parlez plus d'argent entre vous tant qu'elle ne redescend pas sur terre.",
            ">\"Je peux comprendre qu'effectivement son idée du prorata est bien plus avantageux pour elle mais cela ne me parait pas \"juste\" comme façon de procéder; n'avoir aucun loyer à payer étant déjà une situation très enviable (surtout en île de France...) permettant de réaliser une belle épargne.\" \n\nC'est vrai lorsque tu regardes le bon côté des choses.\n\nC'est faux lorsque tu regarde le mauvais côté : en cas de séparation, ta copine ne bénéficie d'aucune protection, tu peux littéralement la mettre à la porte quand tu le souhaite, c'est une situation \"extrêmement précaire\" et non pas \"très enviable\".\n\nConcernant le débat du 50-50 ou du %-%, s'il n'y a vraiment que \"quelques centaines d'euros\" de différence entre vos nets après ton remboursement, cela ne devrait rien changer... Le mieux étant peut être d'en être sûr et de chiffrer les deux options ?",
            "A mon avis il faut payer les charges moitié moitié. Pareil pour la nourriture ou sinon chacun paie sa consommation.\n\nAprès oui 50-50 pour les vacances aussi. Tu ne lui dois pas ton argent.\n\nSi vous vous mariez elle va demander que tu lui payes une partie de ses impôts ? Peut-être il faudra opter pour un taux individualisé..",
            "Merci d'avoir posté dans /r/vosfinances. Veuillez noter quelques conseils.\n\nCe message est-il une demande de conseil en investissement \"J'ai X ans et Y euros que faire ?\". Si oui, merci d'effacer ce post et d'utiliser [le mégafil](https://www.reddit.com/r/vosfinances/about/sticky?num=1) de conseils personnalisés en investissement.\n\nCe message est-il une [question fréquente](https://www.reddit.com/r/vosfinances/wiki/questionsfrequentes) ? Si oui il peut être effacé par la modération.\n\nIl est vivement recommandé de consulter [le wiki](https://www.reddit.com/r/vosfinances/wiki/index) qui contient de nombreuses réponses.\n\nRappel: toute demande ou offre de parrainage est interdite.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/vosfinances) if you have any questions or concerns.*"
        ]
    },
    "Est il possible de d'avoir un portefeuille très diversifié sans utiliser d'etf?": {
        "title": "Est il possible de d'avoir un portefeuille très diversifié sans utiliser d'etf?",
        "score": 12,
        "url": "https://www.reddit.com/r/vosfinances/comments/1dr3p8k/est_il_possible_de_davoir_un_portefeuille_très/",
        "content": "Imaginons une situation hypothétique : j'ai 100k€ à investir, je veux un portefeuille très diversifié mais je ne veux pas donner mon argent à un fond d'investissement. \n\nEst ce qu'en achetant une action de toutes celles qui constituent un indice boursier je peux faire la même performance que si j'avais investi le même montant dans l'etf correspondant à cet indice boursier ? \n\nMerci d'avance pour vos réponses. ",
        "num_comments": 23,
        "comments": [
            "Avec un ETF tu ne donnes pas ton argent à un fond d'investissement, celui-ci prélève certes des frais de gestion notamment pour gérer le marketing et les aspects légaux mais l'ETF est un package dont la réplication est géré par des market makers (spécialistes). Le capital ne se retrouve jamais sur un compte de blackrock ou autre contrairement à des fonds.",
            "Revient avec 100kk euro et ça peux valoir la peine d’avoir un petit family office pour faire ça.",
            "Oui c'est possible mais tu vas perdre du temps à aller chercher chaque nouvelle ligne et accessoirement de l'argent avec les frais de ta plateforme\n\nÀ la rigueur prends-toi quelques ETF avec des secteurs d'activités/pays différents faut juste éviter d'avoir des doublons du style SP500 et Nasdaq100 par exemple, donc pense à bien regarder la composition de chaque ETF",
            "Tu peux avoir un portefeuille diversifié et utiliser d'etf aussi. Par exemple: VOO + AAPL. VOO déjà a AAPL dans son portefeuille, mais c'est juste 6.29%, donc si tu veux avoir une exposition plus grande, par exemple, tu peux avoir AAPL séparément en même temps que tu utilises un etf très diversifié et très bon.",
            "Surtout que les etf ce sont des professionnels qui gèrent ça, c'est donc pas juste un panier d'actions mais aussi des décisions à des moments clefs, type achat / vente / renforcement, que tu ne ferais sûrement pas",
            "On pourrait mieux te répondre si tu expliquais pourquoi tu as peur de donner tes sous à un fond d'investissement.\n\nLa seule raison valable, à mes yeux, serait un désaccord avec la gouvernance et comment votent ces fonds d'investissement d'un point de vue éthique.",
            "Merci pour vos réponses.  Petite précision : je n'ai pas peur des ETF ni des des fonds d'investissements. Seulement étant dans une démarche d'optimisation de mes placements je me demandais s'il n'était pas possible de faire ma diversification moi même sans avoir à payer ce service qu'est l'ETF. En fait dans ma logique un ETF c'est déjà une sorte de gestion pilotée.",
            "Il  pourrait également monter son propre fond d'investissement",
            "Le mieux à faire est de prendre des etf pour multiplier t'es expositions. Msci  cac nikkei etc....\nEt renforcer sur des actions d'entreprises qui te tiennent à cœur.\nJ'ai 4 lignes etf msciw , Japon , sp500 , Inde et du air liquide par exemple.",
            "Juste avec ce que tu vas payer en frais de passage d'ordre + Frais de 30% sur un cto à l'encaissement de plus-value/dividende, tu feras beaucoup, beaucoup, moins bien qu'un etf."
        ]
    },
    "Question sur le PEA Fortuneo": {
        "title": "Question sur le PEA Fortuneo",
        "score": 2,
        "url": "https://i.redd.it/psihh259oi9d1.jpeg",
        "content": "Bonjour,\n\nIl y a quelqu’un qui peut m’aider à comprendre pourquoi j’ai deux comptes courants chez Fortuneo ? \n\nJe viens d’ouvrir mon PEA, donc c’est logique pour moi d’avoir un compte courant pour envoyer l’argent avant d’acheter des actions. \n\nMais je comprends pas pourquoi je vois deux comptes courants quand même ? \n\nMerci !",
        "num_comments": 4,
        "comments": [
            "Merci, c’est logique ton réponse. Je dois utiliser que les deux pour mon PEA alors:\n- le compte courant pour faire des dépôts,\n- le compte PEA pour acheter des titres.",
            "Exactement 😊\n\nTu vires l'argent sur ton compte courant de base et ensuite sur le PEA pour pouvoir acheter ce que tu veux avec",
            "Bonjour, \n\nJe viens d'ouvrir aussi récemment mon pea chez Fortuneo et je continue d'apprendre au fur et à mesure son fonctionnement\n\nQuand tu ouvres un pea, tu as automatiquement un compte espèce qui est ouvert avec pour faire tes dépôts dessus qui est intégré au compte pea (tu le vois quand tu cliques sur ton pea si je dis pas de bêtises)\nTu as également un compte courant qui est ouvert pour faire tes dépôts depuis ta banque de base dessus et ensuite les transfèrer sur le compte espèce du pea dont je parle au dessus\n\nTu as aussi automatiquement un cto qui est ouvert avec un compte espèce qui lui n'est pas rattaché au cto mais un compte a part\n\nDonc si je résume et que tu es dans le même cas que moi, tu dois avoir 4 onglets normalement:\n- compte courant (dépôts de base)\n- compte titre (le cto pour acheter des actions)\n- compte espèces (rattaché au cto pour l'alimenter)\n- PEA (qui comprend donc tes etf/actions et le compte espèce qui leur est rattaché\n\nDonc dans ton cas, je tablerais pour une erreur d'affichage dans la dénomination de ton compte espèce du cto qui s'appelle compte courant mais je veux bien des avis supplémentaires parce que je découvre encore comme toi",
            "Merci d'avoir posté dans /r/vosfinances. Veuillez noter quelques conseils.\n\nCe message est-il une demande de conseil en investissement \"J'ai X ans et Y euros que faire ?\". Si oui, merci d'effacer ce post et d'utiliser [le mégafil](https://www.reddit.com/r/vosfinances/about/sticky?num=1) de conseils personnalisés en investissement.\n\nCe message est-il une [question fréquente](https://www.reddit.com/r/vosfinances/wiki/questionsfrequentes) ? Si oui il peut être effacé par la modération.\n\nIl est vivement recommandé de consulter [le wiki](https://www.reddit.com/r/vosfinances/wiki/index) qui contient de nombreuses réponses.\n\nRappel: toute demande ou offre de parrainage est interdite.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/vosfinances) if you have any questions or concerns.*"
        ]
    },
    "Woob et la MFA": {
        "title": "Woob et la MFA",
        "score": 3,
        "url": "https://www.reddit.com/r/vosfinances/comments/1dr7u2i/woob_et_la_mfa/",
        "content": "Bonjour,\n\nJe suis à la recherche de petits curieux qui auraient développé des modules de banque pour récupérer les transactions via Woob. La Société Générale et d'autres banques ont ajouté la 2FA pour l'identification et je n'ai absolument pas d'idée sur comment l'implémenter...\n\nVous avez réussi de votre coté ? ",
        "num_comments": 2,
        "comments": [
            "En ce moment, j'utilise ActualBudget qui synchronise via GoCardless. Pour l'instant, ça marche très bien\n\nA défaut de pouvoir te proposer une solution avec woob, tu dois pouvoir regarder le code de [Actual](https://github.com/actualbudget/actual) et essayer de t'inspirer. Mais je recommande Actual Budget, c'est très sympa !",
            "Merci d'avoir posté dans /r/vosfinances. Veuillez noter quelques conseils.\n\nCe message est-il une demande de conseil en investissement \"J'ai X ans et Y euros que faire ?\". Si oui, merci d'effacer ce post et d'utiliser [le mégafil](https://www.reddit.com/r/vosfinances/about/sticky?num=1) de conseils personnalisés en investissement.\n\nCe message est-il une [question fréquente](https://www.reddit.com/r/vosfinances/wiki/questionsfrequentes) ? Si oui il peut être effacé par la modération.\n\nIl est vivement recommandé de consulter [le wiki](https://www.reddit.com/r/vosfinances/wiki/index) qui contient de nombreuses réponses.\n\nRappel: toute demande ou offre de parrainage est interdite.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/vosfinances) if you have any questions or concerns.*"
        ]
    }
}