{
    "Weekly theme sharing thread": {
        "title": "Weekly theme sharing thread",
        "score": 3,
        "url": "https://www.reddit.com/r/vscode/comments/1dnbr83/weekly_theme_sharing_thread/",
        "content": "Weekly thread to show off new themes, and ask what certain themes/fonts are.\n\nCreators, please do not post your theme every week.\n\nNew posts regarding themes will be removed.",
        "num_comments": 1,
        "comments": [
            "I converted the 35+ PowerShell ISE themes in my [https://github.com/marzme/PowerShell\\_ISE\\_Themes](https://github.com/marzme/PowerShell_ISE_Themes) repo into VS Code themes: [https://github.com/marzme/marzme-VSCode-Themes](https://github.com/marzme/marzme-VSCode-Themes) . Don't really have the time or desire to publish them on VS Code Marketplace so sharing them here."
        ]
    },
    "extension to highlight specific lines with a different background": {
        "title": "extension to highlight specific lines with a different background",
        "score": 2,
        "url": "https://www.reddit.com/r/vscode/comments/1dqwy6c/extension_to_highlight_specific_lines_with_a/",
        "content": "Hi everyone,\n\nI'm looking for an extension for Visual Studio Code that allows me to highlight specific lines of code with a different background color. Essentially, I want to mark some important lines so they stand out visually, making the code easier to read and understand.\n\nDoes anyone know of an extension that has this functionality? Any recommendations or tips would be greatly appreciated!\n\nThanks!",
        "num_comments": 0,
        "comments": []
    },
    "Interacting with a GUI app inside a devcontainer ": {
        "title": "Interacting with a GUI app inside a devcontainer ",
        "score": 2,
        "url": "https://www.reddit.com/r/vscode/comments/1dqupub/interacting_with_a_gui_app_inside_a_devcontainer/",
        "content": "I have a devcontainer and when I run my playwright tests headed, I cannot see the browser launched inside the container.\n\nI read about x11 and noVNC but struggle to make these work\n\nDo you guys have a repo working with a devcontainer and a GUI app running?\nAlso, would you recommend devcontainers with playwright? So far the setup has been taugh for me..",
        "num_comments": 0,
        "comments": []
    },
    "Invalid python interpreter selected": {
        "title": "Invalid python interpreter selected",
        "score": 0,
        "url": "https://www.reddit.com/r/vscode/comments/1dqyobo/invalid_python_interpreter_selected/",
        "content": "Whenever I try to set my python interpreter to /bin/python3.12, it just says its invalid. If I use /bin/python3, the version is 3.11.9 for some reason and there is no other valid interpreter available. In the terminal \"python -V\" shows 3.12.3, I installed torch and some other modules which work perfectly fine in a jupyter notebook (version is also 3.12.3), but in vscode its always 3.11.9 and no modules work. Also same thing in pycharm. I am completely clueless on why this could be, also pretty new to linux which definitely doesnt help me figure this out. Im using Fedora 40\n\nhttps://preview.redd.it/6q1t5cshoe9d1.png?width=454&format=png&auto=webp&s=62e21ceec8ee598f002c09d053e5c816e3c3c4e6\n\n",
        "num_comments": 2,
        "comments": [
            "Are you sure that’s where your 3.12 interpreter is? In your terminal use the command:\n\nwhich python \n\nIt will tell you where your 3.12 interpreter location is (since invoking python -V shows 3.12)",
            "Youre right its not where it actually is, but it still doesnt work. the location is /usr/bin/python, inside vscode its 3.11.9, in terminal its 3.12.3."
        ]
    },
    "Java on Visual Studio Code Update - June 2024": {
        "title": "Java on Visual Studio Code Update - June 2024",
        "score": 6,
        "url": "https://devblogs.microsoft.com/java/java-on-visual-studio-code-update-june-2024/",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Update includes Project Settings Page Enhancements, Testing Coverage, and Spring Feature Updates."
        ]
    }
}