{
    "If you're here, as a customer, to complain about absolutely anything; kindly, fuck off.": {
        "title": "If you're here, as a customer, to complain about absolutely anything; kindly, fuck off.",
        "score": 17066,
        "url": "https://www.reddit.com/r/walmart/comments/jy56so/if_youre_here_as_a_customer_to_complain_about/",
        "content": "👆",
        "num_comments": 1530,
        "comments": [
            "Here as a customer, but only to show my support!!! You guys work SO DAMN HARD and never get enough credit. We’re not all Karen’s - there are A LOT of us who LOVE YOU!!! That’s all I wanted to say.",
            "omg a message from a mod.",
            "What if I consider myself a tenant? You see, I cook meth in the bathrooms and, honestly, lately I've been considering moving because the quality of my workspace has been declining over the past few months.",
            "Maybe someone should start a sub called \"walmartcustomercomplaints\" and they can all go rant there.  HO can read the sub or not, as they please. We could have another bot that refers customers there.\n\nI fail to understand why *anyone* with a legitimate complaint would think the appropriate action is to post on a reddit sub instead of contacting Customer Service at corporate.",
            "[Lmao. Cry more](https://ibb.co/J79HJ9W)",
            "Holy shit is that... a mod? I see them as often as I see my store manager",
            "[deleted]",
            "Here's a quarter. Call 1-800-Walmart. They're paid to pretend to care, I'm  off the clock.",
            "If you’re a customer on this sub and haven’t ever worked retail. Next year pick up Walmart as a side job during Black Friday. A job that truly chips away at your soul every day you show up.",
            "woah i didn’t know this sub had a mod"
        ]
    },
    "Weekly Salt Thread 255 - Vacation, wish I ever got it": {
        "title": "Weekly Salt Thread 255 - Vacation, wish I ever got it",
        "score": 4,
        "url": "https://www.reddit.com/r/walmart/comments/1dn90d5/weekly_salt_thread_255_vacation_wish_i_ever_got_it/",
        "content": "it's 255, i've counted.  i was trapped in one of those vest water pockets on a floatie\n\nDisclaimer: Don't be disrespectful,  don't be rude, don't be racist, homophobic, sexist, etc, etc, etc. This  thread is to let y'all vent about whatever you want to vent about while  working at wally world may it be customers, co-workers, managers, etc.\n\nIf you have any title suggestions, feel free to leave them.\n\n[Last Week's Salt Thread](https://www.reddit.com/r/walmart/comments/tdt2xg/weekly_salt_thread_246_back_on_the_schedule_with/)",
        "num_comments": 8,
        "comments": [
            "These Madame Web DVDs aren't moving 😢",
            "Customer: I need h.e.l.p.\nMe: how can I help you?\nCustomer: lithium batteries!\nMe: all batteries are on the display behind you.\nCustomer: I knowww t.h.a.t. but they are locked up!\nMe: *blink* (new policy I dunt know about???) Show me which you need.\nCustomer: *shows me*\nMe: those arent locked up\nCustomer: I cant get it off.\nMe: those arent locked up, you c a n get it off, it comes right off the peg.\nCustomer: *lifts it off the peg*\n\n\nYa'll it was a security tag, a yellow security tag and it wasnt even on a difficult hba zigzag peg. How do these people make it to adult age?",
            "Weird question, and will delete this after an answer, but I know that a customer can get a copy of their receipt if they paid with a card, but could they get one of they used a tax exempt at check out?",
            "Home office, I’m sweating like an overnighter being told there’s three trucks and no excuses. Turn on the AC.\n\nShit, I already am getting complaints from the Karens about sweat. How can I keep a professional minimum wage look when I’m sweating buckets?",
            "Same with Falcon and the Winter Soldier. Its a crime 😥",
            "I’m under the assumption that a customer can request a copy of a receipt for any purchase regardless of what was used to purchase it",
            "As a basic associate, the only way I know how to manually print a receipt is with a button on the register that reprints the most recent receipt (it works on Walmart Pay purchases too), and it requires another associate's numbers. IIRC, tax exempt purchases still get a normal receipt automatically, at least at my store.\n\nWould like to hear of any other methods.",
            "A manager should be able to print a receipt for any purchase for that day so long as they have enough proof/info to print that receipt for them. I’m not sure how long the time line is for this is. I think they can do this up to 30 days. Not sure"
        ]
    },
    "Got in trouble for saying hi?": {
        "title": "Got in trouble for saying hi?",
        "score": 185,
        "url": "https://www.reddit.com/r/walmart/comments/1dqw7te/got_in_trouble_for_saying_hi/",
        "content": "So I’ve been a Walmart associate for about seven months now? And I went to my hour break, I said hi to one of my friends I was walking by, and our manager asked me “What are you doing?” I replied with “headed to my lunch” and he told me “you can’t be bothering any workers on lunch”. What? I then was like “I  can’t even say hi to my friend in passing?” And he said “not if you want to keep your job” bruh wtf is wrong with Walmart 💀",
        "num_comments": 63,
        "comments": [
            "Yeah, there is no shortage of assholes, just ignore them and keep it moving",
            "That manager is on something, I would stay out of their way lmao",
            "Ask him what the 10 foot rule is!",
            "I’ve been with the company for almost 9 years and I say hi to everybody my mother my dad who shops at Walmart too. This isn’t seem right.",
            "My mother came to shop when I worked at Walmart. I didn't treat her any different besides saying \"oh hi, funny to see you here\" and then just normal interaction. Got coached. Some people are just Satan's rectal discharge.",
            "That's not walmart. That's your boss being a control freak asshole. As long as you're not hindering her job by doing so (saying hi on your LUNCH BREAK), he can kick rocks. Srsly.",
            "Just ignore them and say hi to your friends all you’d like.\n\nIf they write you up, coach you or fire you for it, you can open door and royally fuck them over for acting like an ass.",
            "Thank you guys for all the support, kinda cried in my car after since it’s such bullshit",
            "Walmart wants you to say hi and interact. Report him they also have a no retaliation rule",
            "I'd start saying hi to that manager every time I saw them, I'm petty tho"
        ]
    },
    "“You’re clocked out, so you can’t answer a question?”": {
        "title": "“You’re clocked out, so you can’t answer a question?”",
        "score": 231,
        "url": "https://www.reddit.com/r/walmart/comments/1dqu0mu/youre_clocked_out_so_you_cant_answer_a_question/",
        "content": "Nope, no longer on the clock and my responsibilities are off my shoulders till the next day.  \nI told the lady it was against policy, and she just looked me crazy and scoffed.  \nAlso anyone in their right mind could tell I was off, because I just had my vest on one shoulder and not fully on and zipped up.",
        "num_comments": 119,
        "comments": [
            "Customers don't care if we're off the clock. I'm surprised yours only scoffed, I've had customers block the aisle to try to force me to answer their questions.",
            "[deleted]",
            "I once asked someone where they worked and I have a question for them too and they said they felt threatened ",
            "\"Where do you work ma'am? You work for an insurance company? Great! Let me ask you questions about my insurance while we're here and you're not on paid time. Thanks!\"",
            "I was literally out the door, no vest, jacket on, bag of groceries in my hand, and a lady ran out after me to ask me to talk to a manager about something.  I was like \"Lady, there's 100 people getting paid to help you right now.  I'm not one of them.  You walked past at least 2 to get to me.  Have a good day.\"",
            "I had a customer report me for not helping them while I was off the clock. TLs tried to coach me for it, but I left early so they forgot about it",
            "I'd just flatly say \"I'm off the clock, but (nearest on-clock associate) over there should be able to help\" and if they kept pushing I'd completely ignore them and walk away. People are just people, and people are shit. Don't waste time on shit.",
            "They give zero fucks. I had a nasty woman tell me, \"Heaven forbid you get off your ass and answer a question while not clocked in.\" Twice this woman stopped me on different days. Neither day did I have a vest on. No badge. No nothing.  \n\nShe was rude both times. But I knew our  management. I would have been in trouble had I not helped her. We are expected to take them to find an employee at the least. Which is.... still helping them?? It's incredible just how good or bad working can be depending on the management and if they have your back, or the customer's.",
            "Hey by the way what do you do for a living?\n\nA doctor? Hey so I got this chest congestion what are the chances it's mold instead of being influenza?\n\nA lawyer? A pallet fell and broke my foot here what are my chances of winning a lawsuit?\n\nAn electrician? So hey I was remodeling the drywall in my house and I forgot exactly how many feet apart is it mandated to have another electrical outlet to not violate the code?\n\nOh what I have to make an appointment or consultation?\n\nYeah fuck you bye",
            "I just usually say \" Sorry, I don't work for free.\""
        ]
    },
    "Only 3 years left for a discount card for life. ": {
        "title": "Only 3 years left for a discount card for life. ",
        "score": 153,
        "url": "https://i.redd.it/tl1b9ew07e9d1.jpeg",
        "content": "",
        "num_comments": 30,
        "comments": [
            "I’ve worked at WM for 3 years and I’ve only saved about 450 dollars with my 10% discount card…",
            "I don't know how you do it. I'm at year 3 and I take a bunch of medication daily just to stay alive",
            "You are stronger, stronger than the strongest person in the world.",
            "Is it more than 10%?",
            "It should be upped to 20%+ for rest of life. Not 10%",
            "My wife got hers this year. If got quite a few years before I get one for life lol",
            "Happy anniversary!!!",
            "How can u do 17. I'm at 8 years and I hate it.",
            "Above a certain age you can get one at 15 years, or at least you used to be able to",
            "happy anniversary! i hope you treated yourself to something nice today!"
        ]
    }
}