{
    "Tiana’s Bayou Adventure Megathread (Pt. 3)": {
        "title": "Tiana’s Bayou Adventure Megathread (Pt. 3)",
        "score": 10,
        "url": "https://www.reddit.com/r/WaltDisneyWorld/comments/1dqpcpn/tianas_bayou_adventure_megathread_pt_3/",
        "content": "Hi, folks! [Opening day](https://disneyworld.disney.go.com/attractions/magic-kingdom/tianas-bayou-adventure/#:~:text=This%20musical%20adventure%20crescendos%20with,Resort%20on%20June%2028%2C%202024) is finally upon us!\n\nThere’s understandably a lot of excitement and buzz around this, so we’re designating this as our de facto Tiana’s Bayou Adventure megathread for the time being.\n\nWhile we may allow a select few standalone posts on the sub, all questions, commentary, etc. related to the new attraction should go in this thread.\n\nPlease see megathreads [Pt. 1](https://www.reddit.com/r/WaltDisneyWorld/s/2zGVkziffi) and [Pt. 2](https://www.reddit.com/r/WaltDisneyWorld/s/WJQxOruf8D) for prior discussions during the attraction’s preview phase.",
        "num_comments": 14,
        "comments": [
            "Please be aware that discussions about this attraction (and its predecessor) have frequently become very heated.\n\nWe will therefore be limiting discussion to Tiana’s Bayou Adventure only, as with past megathreads on this topic.\n\nWhile we understand many of us will always miss Splash Mountain, the time to debate its merits, shortcomings, and fate have passed — and, frankly, it generates dozens of vitriolic comments and attracts brigading by internet “culture warriors” each time it comes up on the sub.\n\nThanks for your understanding, and enjoy the new attraction! :)",
            "Reall cute overlay with a lot of ton of fun show scenes, but I just gotta laugh that Disney didn't put a deep frier or frying pan in the queue kitchenette.\n\n\nWhich begs the question; is she baking those begniets?",
            "How long is this likely to remain on Virtual Queue? Really getting sick of travelling so far and then having to play a lottery to get on the good rides.\n\nWe're going to be at WDW from August 26th to September 7th this year, and wondered what the likelihood of Tiana coming off VQ by then is – their wording of 'we plan to open a standby queue shortly after opening day' gives me some hope we might just be able to good old-fashioned rope drop it.\n\nThen again, GOTG is still VQ two years down the line, so who knows?",
            "I tried at 7am and 1pm to try to get on the ride. I did it the exact second it turned 7 and 1 and it said it was full. Rip",
            "Can you buy an individual lightning lane for it?",
            "Sooo excited this ride is finally open. Do y'all think it will be taken off Virtual Que by August or September. Disney said it won't be on virtual for long.",
            "I have seen speculation that it will end on July 24th when the Multi-Pass changes take effect, but nothing confirmed.",
            "Splash/Tiana is a people-eater attraction, unlike both Guardians and TRON. If they can't get over the downtime issues, I think it might stay VQ longer than expected. But, otherwise, I bet they'll get rid of it at the end of the \"summer season\". (Either July 22nd or August 5th.)",
            "Did you use an atomic clock app to make sure the clock on your phone is accurate? I get a spot in the VQs every single time.",
            "No. It's on Genie+, though. The only ILL rides at MK are TRON and 7DMT."
        ]
    },
    "Weekly FAQs & General Discussion Thread": {
        "title": "Weekly FAQs & General Discussion Thread",
        "score": 2,
        "url": "https://www.reddit.com/r/WaltDisneyWorld/comments/1dn4kkz/weekly_faqs_general_discussion_thread/",
        "content": "Please post all your **general** WDW comments and **FAQs** here. If your **post is removed** for being **too general** and/or a **FAQ**, please feel free to **resubmit it in this thread**.  If you'd like to **chat about WDW** in real-time, come visit us on our [Discord server](https://discord.com/invite/reddit-waltdisneyworld)!\n\n***Please note:*** *if you are posting from a* ***newer/low-karma account****,* ***automod*** *will typically* ***send your posts*** *to the* ***spam filter****. Please* ***do not message the moderators*** *about this. We* ***check the spam queue throughout the day****, and will eventually* ***approve your post*** *if it does not violate any sub rules. Thanks!* \n\n**Examples of questions/comments that belong here include things like:**\n\n* What should I do to **prepare** for **the weather (heat, rain, tropical storm, etc.)** during my upcoming trip?\n* What are the **crowds** and **wait-times** like during the **week/month of** \\_\\_\\_\\_\\_\\_?\n* How do **ticketing, admissions,** and/or **parkhopping work** now that the **park reservation system has ended**? Is it possible for **admission** to be **closed** if a **park reaches capacity**? \n* How does **Genie+** and/or **Individual Lightning Lane (ILL)** work? Are they **worth the price**?\n* What type of **shoes/backpacks/strollers** do you recommend for the parks?\n* How does the **TRON/Guardians of the Galaxy (GotG) virtual queue** work? Will I have issues **fitting in the ride vehicle**? Will I experience **motion sickness**?\n* How do I get **tickets** for an **after-hours event,** such as **Mickey’s Not-So-Scary Halloween Party (MNSSHP), Jollywood Nights,** or **Mickey’s Very Merry Christmas Party (MVMCP)**, etc.? What happens if they’re **sold out** on the night we want to attend?\n* How do **dining plans work**? Do you think a **dining plan** is **worth it**?\n* I'm thinking about taking a **solo trip**. **Should I** **do it**? Any **tips** or **advice**?\n* **How** can I **purchase/upgrade** an **Annual Pass (AP)**?\n* Should I **purchase** a **MagicBand?** Where can I find a **wider selection** of **MagicaBands**? When will my **MagicBand order ship/arrive?**\n* How does the **application/approval** process work for **Disability Access Services (DAS)**?\n* Is the **\"magic\" gone**? Is a trip to WDW still **worth it** right now?\n* Has \\[x\\] **reopened** yet?\n* What's the best way to get a **dining reservation (ADR)** for a certain restaurant? What if an **ADR** isn't available to accommodate the **size of my party**?\n* Do you feel **safe traveling to WDW** right now? How can I **avoid Covid, flu**, and/or **other illnesses** while visiting WDW? \n* Do you think **park hours** will be extended for my upcoming trip?",
        "num_comments": 37,
        "comments": [
            "Going to Mickeys not so scary. If I want to ride Tron at night that day, I’m guessing the only way to ride it would be to use the 6pm VQ. For those who went last year, does the VQ go pretty quick? I’ll definitely get the ILL for it but would rather guarantee two rides during the day compared to missing out on the second ride. Going Aug 27th so shouldn’t be a crazy busy party.",
            "Hoping to park hop to EPCOT during our trip for extended evening hours. A virtual queue for Guardians will open at 6 PM for this. \n\nDo we need to have been in EPCOT at all on this day in order to join the queue? Looking like we might be at AK prior.\n\nLike I said, we’ll have park hoppers and I’m just trying to make sure we don’t miss out when it gets to 6 PM.\n\nThank you!",
            "I'm looking at getting the discounted Magicbands from a resort stay and the cheapest ones are $25. Every website I look at says you can get them for $10. I know stock changes frequently on them, should I keep checking on it to see if any $10 ones show up? I'm not needing anything fancy, I want to get some for my kids since this will be their first trip and I want them to feel special!",
            "What is the wait time for Flight of Passage like at 8:00/8:30 AM with early access opening at 7:30? I don’t have early access to the park, but I want to try to get to FoP as soon as the park opens to everyone. \n\nAlso, when I see people talk about rope drop, is that usually referencing early access? Or public open?",
            "Does anyone know if the \"do a DVC tour, get a $200 gift card\" promo is still happening and what the easiest way to get in on it is? Staying at Yacht Club tonight and will probably have some downtime tomorrow afternoon.",
            "Is Undercover Tourist a good place to book a WDW hotel?",
            "\n\nPlanning our first WDW trip as parents, with our five year old. I very much appreciate all the kind comments and advice from others here still masking at the parks. We’re trying to go in off season to avoid crowds, will mask indoors and in any really packed outdoor spaces, and only dine outdoors. \n\nMy questions are about the Bibbidi Bobbidi Boutique and character dining experiences. For BBB, could most of that still be enjoyed masked? Thinking she could do most of it with a mask on and take it off for final pictures but have never done it so I’m not sure. \n\nI’ve tried searching and it seems like there are not any character meals that offer outdoor seating - any one who knows the parks better able to confirm that? \n\nShe’ll still have a wonderful time without either of these experiences, but wanted to try and figure out if they’re on the table for our family. \n\nThank you!",
            "Do you guys think you could see and do everything in Animal Kingdom from 7:30am to 3pm?",
            "A few questions:\n\n\nCan we use the Disney app to pay for parking? (We want to use a card that only has swipe no chip or Disney gift cards)\n\n\nWould they take Disney gift cards as checkout/buying food?\n\n\nCan we use the Disney app to top up w Disney gift card to use in Disney park?",
            "I’m kind of bummed out that the new multi pass system doesn’t seem to include any meet and greets or things like Enchanted Tales with Belle. I was planning to use lightning lanes for those when I visited with my kindergartener next January."
        ]
    },
    "Your trauma is not everyone else’s": {
        "title": "Your trauma is not everyone else’s",
        "score": 199,
        "url": "https://www.reddit.com/r/WaltDisneyWorld/comments/1dr31ke/your_trauma_is_not_everyone_elses/",
        "content": "My husband and I are here celebrating our 10th anniversary on the Boardwalk at Jellyrolls. Someone was celebrating their divorce WHICE IS GREAT; LIVE YOUR BEST LIFE. \n\nThen they announced our 10 year anniversary and her whole crowd (not the entire crowd) booed us. \n\nThis is our happy/place. I’m so sorry things haven’t worked out. We were very close ourselves to moving on. But please…the trip may mean life or death for some couples. \n\n",
        "num_comments": 34,
        "comments": [
            "Super weird to boo when somebody's celebration is announced at a restaurant. Imagine if you were at a restaurant and the waiter came over with a birthday dessert for another table and somebody started booing them...I doubt somebody would do that. Not sure why an anniversary should be any different.",
            "Those people are so unkind.  Happy anniversary.",
            "Weird and super tacky. I’m really sorry they were such jerks. \n\nMeanwhile, congratulations to you!",
            "Well, I understand why they were divorced in the first place with that attitude",
            "I am totally the gal who would go out and celebrate something like a breakup or divorce, but I would NEVER wish ill on someone else’s happiness. How horrible and rude of them.",
            "Misery loves company and that’s why they booed you. \nCongrats on 10yrs!",
            "Some people just want to see the world burn",
            "So tacky, they could have just stayed quiet if they didn’t want to clap. \n\nCongratulations on 10 years. Hope the rest of your trip is more magical.",
            "I'm sorry to hear that happened! I've been one of the gorms at the divorce party-- but I'd never boo another's celebration of love!\n\nHappy anniversary! I hope the rest of your evening was more magical",
            "I'm ashamed of what I'd say back....so I'll keep it to myself"
        ]
    },
    "View from the WDWRR - Splash Mountain vs. Tiana's Bayou Adventure ": {
        "title": "View from the WDWRR - Splash Mountain vs. Tiana's Bayou Adventure ",
        "score": 136,
        "url": "https://i.redd.it/xw6ahr1qne9d1.png",
        "content": "",
        "num_comments": 18,
        "comments": [
            "Let’s bring in the downvotes: this one Tiana actually did improve on",
            "Whats is wdwrr?",
            "Pretty!",
            "Wow....that is a glow up and gorgeous.",
            "Those flatscreen TVs totally blend in from that angle.",
            "Feels off now",
            "Yep, much better use of the space here.",
            "I’m gonna be honest, I think the only thing that splash mountain did better that you can’t really argue is the story.",
            "Walt Disney Wold Railroad at the Magic Kingdom",
            "The loss of zip a dee doo dah is tragic to me"
        ]
    },
    "Beautiful Friday night in the rain": {
        "title": "Beautiful Friday night in the rain",
        "score": 132,
        "url": "https://i.redd.it/4daaywgnbe9d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Yessss. Oh man I am working nearby and would love to stop by tonight. Enjoy!",
            "Holding the umbrella like a true dad! Have fun with your girls :)",
            "Love Disney in the rain. I hope y'all had the best time!",
            "Completely unrelated, but may I ask where you got that tshirt op? 🔥",
            "Hollister"
        ]
    }
}