{
    "Update 36: Jade Shadows": {
        "title": "Update 36: Jade Shadows",
        "score": 306,
        "url": "https://www.reddit.com/r/Warframe/comments/1dit9kb/update_36_jade_shadows/",
        "content": "[Source](https://forums.warframe.com/topic/1400346-update-36-jade-shadows/)\n\n[e4e0963af77446ab93d7a3398312175_1600x900](https://www-static.warframe.com/uploads/thumbnails/e4e0963af77446ab93d7a3398312175_1600x900.png)\n\n**UPDATE 36.0: JADE SHADOWS**\n\nIn moments of despair, let the battle resonate with song. Delve into long-held secrets of the Origin System with our new Ascension Game Mode, Operation: Belly Of The Beast and the latest cinematic Quest that uncovers a secret, long kept by the Stalker. \n\nJade Shadows also brings our 57th Warframe, Jade, a glorious herald of both life and death. An Arsenal of her radiant weapons awaits you, fit to combat that which lies in the dark. \n\nDiscover New Warframe Augment Mods, the Yareli Pandea Skin Bundle, new TennoGen and more! We’ve also packed this Update with reworks and QOL - read on to learn everything Jade Shadows has brought!\n\nJade Shadows is a Mainline Update! \n\nMeaning that everything the team has been working on since the launch of Dante Unbound is in this update (with the obvious exception of content that is not ready to be released). It is very likely, as it is with all Mainline updates, that things slip through the cracks so we will be watching for bug reports and feedback in the [dedicated Jade Shadows Subforums](https://forums.warframe.com/forum/1966-update-36-jade-shadows/) to address in follow-up Hotfixes.\n\nIf any of the terms above are new to you, visit “[The Warframe Lexicon for Updates](https://forums.warframe.com/topic/1355354-the-warframe-lexicon-for-updates-patch-notes/)” to learn more about Warframe’s development cycle. \n\nUpdate Download Size: ~1.15 GB \n\n**Total Warframe Download Size: 39.5 GB**\n\n* * *\n\n**TABLE OF CONTENTS:**\n\nThere is much to explore in Update 36: Jade Shadows! We highly encourage you to read the patch notes in full but if you are looking for a specific topic, simply CTRL+F the following keywords to jump to its dedicated section:\n\n  * New Cinematic Quest: Jade Shadows \n  * New Warframe: Jade \n  * New Weapons \n    * New Bow: Evensong \n    * New Thrown Secondary: Cantare \n    * New Scythe Melee: Harmony \n  * New Game Mode: Ascension \n  * New Eximus Unit: Jade Light Eximus \n  * Operation: Belly Of The Beast (begins today at 11:30 AM ET) \n  * New Warframe Augment Mods \n  * Tennogen Shadows \n  * New In-Game Market Additions \n    * Jade Collection \n    * Jade Chorus Pack \n    * Jade’s Ensemble \n    * Yareli Pandea Skin Bundle \n  * Resistances And Status Rework \n    * The following list is featured sections and is not exhausted: \n      * Simplified Faction Resistances \n      * Armor Adjustments \n      * Shield Adjustments \n      * Status Effect Reworks \n      * Warframe Changes \n        * Includes Frost Rework, Ember Changes and more \n  * Duviri Additions & Changes \n    * New Decrees \n    * New Undercroft Mission: Alchemy \n    * Pathos Clamps Rewarded From Undercroft Portals \n  * New Player Experience Improvements \n    * Debt-Bond Farming Changes \n    * Voidrig Acquisition Improvements \n    * Awakening Quest Improvements \n  * UI Additions, Changes & More \n    * Loadout Customization From Navigation \n    * Arsenal UI Additions & Changes \n    * Stat UI Changes & Fixes \n  * HUD Changes \n  * Finisher Changes \n  * New Video Setting: Reduce Frame Latency \n  * Additions \n  * Changes \n  * Top Fixes \n  * Optimizations \n  * Fixes  \n\n\n\n\n* * *\n\n  \n\n\n[95e413030679a8f8b410866f5929164f.png](https://www-static.warframe.com/uploads/95e413030679a8f8b410866f5929164f.png)\n\n**NEW CINEMATIC QUEST: JADE SHADOWS**\n\nStruggling to understand the oldest and deepest secret from his past, Stalker finds himself allied with sworn enemies on the troubling road toward uncovering the truth… and averting an incalculable loss. \n\n**Spoiler Courtesy**\n\nJade Shadows contains significant spoilers for Warframe! **To ensure that all Tenno enjoy the best possible experience, we ask that you allow others to complete the Quest at their own pace, and to please be kind by avoiding spoiling it for others.**\n\nIf you’d like to discuss or share anything related to the Quest after playing (and we certainly expect that you will), **please use spoiler tags so everyone can experience it as intended.**\n\nHere’s how you can use spoiler tags/warnings to share your experience without impacting others:\n\n  * Use “Spoiler” warnings on any content pertaining to the Ques. This includes social posts, live streams, videos, Capturas, Fan Art, Etc. \n    * On our Forums you can use the “Spoiler” tag to properly mark your post, as well as the built-in**** “Spoiler” button to cover your text up when posting:  \n[97d4fe7820f0842c6453f85bd04bcc9d.png](https://www-static.warframe.com/uploads/97d4fe7820f0842c6453f85bd04bcc9d.png)\n  * Content Creators should clearly label spoiler content and use spoiler-free thumbnails and titles.\n\n\n\n**Quest Prerequisites**\n\n**You must have completed The New War Quest in order to play the Jade Shadows Quest**. The Quest will become available from your Codex once you have done so. \n\n**Quest Commitment & Duration**\n\nSimilar to The New War Quest, once you commit to beginning Jade Shadows you will be unable to do other Warframe activities for the duration of the Quest. You will be able to pause the game, and your progress will be saved between missions. It is roughly a ~30 minute experience, perhaps faster for seasoned Tenno! \n\n**Content warning:** This quest contains scenes of trauma related to motherhood. \n\n**Quest Rewards**\n\n  * **Jade** Warframe Blueprint\n  * Access to **Operation: Belly Of The Beast**\n    * Read the dedicated section below to learn more about the Operation\n  * Access to the new **Ascension Game Mode**\n    * Read the dedicated section below to learn more about the new Game Mode\n  * New Captura Scene from the Quest\n  * New Displays from the Quest\n\n\n\nShare your [Feedback](https://forums.warframe.com/forum/1985-jade-shadows-quest-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1978-jade-shadows-quest-bugs/) on the Jade Shadows Quest in the dedicated Feedback Subforum. \n\n  \n\n\n[44753cfd6f1d407fd4e9b4b51bf9d487.jpg](https://www-static.warframe.com/uploads/44753cfd6f1d407fd4e9b4b51bf9d487.jpg)\n\n**NEW WARFRAME: JADE**\n\nBecome enraptured by the song of devastation. Through her, the Jade Light can be a source of destruction or a source of support.\n\n**How To Acquire Jade**\n\n  * **Completing the Jade Shadows Quest:** Jade’s Blueprint is rewarded after completing the Quest.\n  * **New Ascension Game Mode - Brutus (Uranus) Drop Tables:** Jade’s Component Blueprints have a chance to be rewarded from the new Ascension Game Mode on Brutus, Uranus (more information in the “New Game Mode: Ascension” section below). \n  * **Ordis’ “Release Vestigial Motes” Store in the Larunda Relay:** Jade’s Blueprint and Component Blueprints can be exchanged for Vestigial Motes via Ordis in the Larunda Relay on Mercury (more information about Vestigial Motes can be found in the “New Game Mode: Ascension” section below).\n  * **In-Game Market:** Jade and her Collection are available for purchase in the in-game Market for Platinum. \n\n\n\n**Jade’s Abilities**\n\n**Passive: The Anointed**\n\nJade’s profound understanding of the relationship between life and death grants her two Aura Mod Slots. Some of her Abilities apply **Judgments,** increasing enemy damage vulnerability by 50% for 10s. \n\n**Ability 1: Light’s Judgment**\n\nCreate a well of light that heals allies and hurts enemies. Those who enter the well will be highlighted by Judgment.\n\nLight’s Judgment is Jade’s Railjack Kinesis ability. \n\n**Ability 2: Symphony of Mercy**\n\nCycle through three songs that strengthen allies. Extend the duration of each song by killing enemies surrounded by Judgments.\n\n  * **Power Of The Seven:** Increases Ability Strength \n  * **Deathbringer** : Increases Weapon Damage\n  * **Spirit Of Resilience:** Increases Shield Regeneration and decreases Shield Regen Delay \n\n\n\n**Ability 3: Ophanim Eyes**\n\nJade summons an accusatory gaze that slows nearby enemies and dissolves their Shields and Armor. When the gaze falls upon allies, they can be revived from a distance.\n\nOphanim Eyes is Jade’s subsumable Helminth ability. \n\n**Ability 4: Glory on High**\n\nSoar with destructive power. Use alternate-fire to detonate Judgments, causing an explosion of Jade Light. Enemies inside the Light’s Judgment radius empower the explosion. \n\n**Jade’s Glory on High Exalted Weapon: Glory**\n\nUnleash the power of the Jade Light. \n\n**Maximum Loadout Slot Increase:**\n\nWith the release of Jade, the maximum number of purchasable Loadout Slots has been increased from 25 to 26. \n\n**Jade’s Prex Card**\n\nExpand your Prex Card collection with a new addition! Jade’s Prex Card can be found in a special location in the new Ascension Game Mode’s tileset.   \n\n\nShare your [Feedback](https://forums.warframe.com/forum/1974-ascension-game-mode-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1979-jade-new-weapons-bugs/) on the Jade in the dedicated Feedback Subforum. \n\n**NEW WEAPONS**\n\nJade brings with her a full Arsenal of weapons that evoke feelings of hope, a counterpart to that which evokes an absence of light. \n\n[fbdf592487c4990a6816491023319a27.jpg](https://www-static.warframe.com/uploads/fbdf592487c4990a6816491023319a27.jpg)\n\n**New Bow: Evensong**\n\nCounter the dread of battle with a song of praise. Enemies cannot hurt your allies while wounded by Evensong’s arrows. Kills with Evensong empower ally weapons with Multishot. \n\n**Unique Trait - Evensong Devotion**\n\nDamage dealt by Evensong's arrows applies 7 stacks of Puncture Status, which reduces the target's damage output by 100% and increases their Critical Chance of damage taken by 35%. Kills with Evensong activate Evensong Devotion, a buff that increases Multishot by 35% for allies.\n\n  \n\n\n**How to Acquire Evensong:**\n\nAcquire the Evensong Blueprint from the new Ascension game mode, or obtain the Blueprint in exchange for Vestigial Motes from Ordis in the Larunda Relay on Mercury. It can also be purchased fully built via the in-game Market for Platinum.\n\n[9e662544cb85481b5cf1a5faa7cdab28.jpg](https://www-static.warframe.com/uploads/9e662544cb85481b5cf1a5faa7cdab28.jpg)\n\n**New Thrown Secondary: Cantare**\n\nIn moments of despair, let the battle resonate with song. Cantare’s blades lodge into the battlefield and return upon reload. When returning blades strike enemies, Cantare empowers allies with increased Reload Speed. \n\n**Unique Trait - Cantare Chorale**\n\nCantare's blades have a 300% Critical Chance when they return upon reload. Strike enemies with returning blades to activate Cantare Chorale, a buff that increases Reload Speed by 20% for allies.\n\n**How to Acquire Cantare:**\n\nAcquire the Cantare Blueprint from the new Ascension game mode, or obtain the Blueprint in exchange for Vestigial Motes from Ordis in the Larunda Relay on Mercury. It can also be purchased fully built via the in-game Market for Platinum.\n\n[4dd96a10fc711f7daa6b2c5c6d0027d7.jpg](https://www-static.warframe.com/uploads/4dd96a10fc711f7daa6b2c5c6d0027d7.jpg)\n\n**New Scythe Melee: Harmony**\n\nHarmony triumphs over hate. Heavy Attacks condense Status Effect damage into a single instance. Heavy Attack kills empower allies with increased Status Duration. \n\n**Unique Trait - Harmonic Resonance**\n\nHeavy Attacks condense all Status Effects that deal damage over time into a single instance. Heavy Attack kills activate Harmonic Resonance, a buff that increases Status Duration by 30% for allies.\n\n**How to Acquire Harmony:**\n\nAcquire the Harmony Blueprint from the new Ascension game mode, or obtain the Blueprint in exchange for Vestigial Motes from Ordis in the Larunda Relay on Mercury. It can also be purchased fully built via the in-game Market for Platinum.\n\n**Jade’s Ensemble Buff**\n\nWhen all three weapons are used together they have a unique buff! Evensong, Cantare, and Harmony sing together. Their buff effects are doubled.\n\nShare your [Feedback](https://forums.warframe.com/forum/1974-ascension-game-mode-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1979-jade-new-weapons-bugs/) on the new Weapons in the dedicated Feedback Subforum. \n\n[b1d7659a31e0763af00b60401b156412.jpg](https://www-static.warframe.com/uploads/b1d7659a31e0763af00b60401b156412.jpg)\n\n**NEW GAME MODE: ASCENSION**\n\nThe Stalker’s stronghold is under intensive assault from marauding Corpus forces, but what they’re after must remain safe. You’ll need to initiate an emergency evacuation before embarking on a grueling ascent through enemy-infested elevator shafts to the Extraction waiting for you above.\n\nVisit the new **Brutus node on Uranus** after completing the Jade Shadows Quest to assist Ordis in gathering Vestigial Motes! This new non-endless mission unfurls in three stages:\n\n**Stage 1 - Mote Collection**\n\nThe Corpus have set up **Mote Collectors** to extract energy from the air - Ordis has taken them over, so you must defend them while they complete extraction!\n\n**Stage 2 - Ascension**\n\nOnce you have extracted the Motes, they must be transported in their **Extraction Capsule** top-side! To do so, power the elevator using **Ionic Capsules** dotted throughout the map, or dropped from enemies. As you approach them, they’ll be marked with a small green waypoint! Keep your eyes peeled for extra-glowy **Boosted Ionic Capsules** that offer an additional power and speed boost. Once picked up, use the Alternative Fire to throw them at the Extraction Capsule to power your ascent!\n\n  \nPlayers can keep up with the ever-rising gameplay with increased jump height (thanks to a special Air Support deployed by Ordis), and via jump pads littered on various platforms. Should you take an unfortunate fall to the bottom of the map, use the jump pad at the bottom of the elevator to catch up to its height. \n\n**Bonus Objective:**\n\nAlong with the Ionic Capsules, players may come across **Sister Beacons** hidden throughout the map, identified by the soft pinging noise they emanate upon approach. Collect three of these to summon a Sister of Parvos, who will spawn once you reach the top of the Elevator shaft. Defeating the Sister will reward you with 5-7 Vestigial Motes and a chance at a new Arcane, listed below (8-10 Motes and a guaranteed Arcane on Steel Path). Sisters of Parvos will also drop Steel Essence in Steel Path Ascension missions.\n\n**Stage 3 - Extraction**\n\nOnce you’ve made it to the top, escort the Extraction Capsule safely to extraction and defend it from Corpus foes along the way! Should enemies manage to deplete the health of the Extraction Capsule, its progress will stop briefly and the health will regenerate, at which point it will continue on its path once more. \n\n**Rewards**\n\nSuccessfully completing an Ascension mission will award players with 11-13 Vestigial Motes (16-18 on Steel Path), as well as a reward from the mission drop table, including:\n\n  * Jade’s Component Blueprints\n  * Endo\n  * Relics\n  * Harmony Blueprint\n  * Cantare Blueprint\n  * Evensong Blueprint \n\n\n\nFor a full overview of the Ascension Drop Tables, please review our[ Drop Tables site](https://www.warframe.com/droptables). \n\n**Releasing Vestigial Motes**\n\nVisit Ordis in the Larunda Relay on Mercury during Operation: Belly of the Beast to exchange Vestigial Motes for various wares, including: \n\n  * Jade Main and Component Blueprints\n  * Harmony Blueprint\n  * Cantare Blueprint\n  * Evensong Blueprint\n  * New Arcanes (read on below to learn more!) \n\n\n\nOnce Operation: Belly of the Beast ends, Ordis will relocate to the Drifter Camp and offer his wares there. He finally got a job, yipee!\n\n**New Arcanes**\n\nEnhance your Arsenal with these new Arcanes! Acquire these new enhancements from Sisters of Parvos spawned in the new Ascension game mode, or exchange them for Vestigial Motes via Ordis in the Larunda Relay.\n\nStats below are shown at max rank. \n\n**Arcane Ice Storm (Warframe)**\n\nOn Enemy Frozen: Gain +2% Ability Strength and +2% Ability Duration for 15s. Stacks up to 20x.\n\n**Arcane Battery (Warframe)**\n\nGains 0.30 maximum Energy per Armor point, up to 1000 Energy. \n\n**Secondary Surge (Secondary)**\n\nOn Ability Cast: Next shot gains a Damage Multiplier for every 200 current Energy, up to x8. \n\n**Secondary Fortifier (Secondary)**\n\nGain 1 Overguard for every 100 Damage dealt to an enemy’s Overguard. Deals x8 Extra Damage to Overguard.\n\n**Melee Afflictions (Melee)**\n\nEnemies affected by Status Effects gain 6 additional stacks when they're knocked down or flung by melee attacks.\n\n  \n\n\n**New Semi-Auto Fire Mods**\n\nThese new Mods can be equipped on Semi-Auto Fire weapons only, and prevent their firing speed from being modified once equipped. \n\nTarget Juno Sapper Moa enemies in Ascension missions to earn these Mods!\n\nYou can identify which weapons are eligible via the Arsenal if their Trigger type is “SEMI”. \n\n**Semi-Rifle Cannonade**\n\n+240% Damage  \n+1.5 Punch Through\n\n**Semi-Pistol Cannonade**\n\n+300% Damage  \n+1.5 Punch Through\n\n**Shotgun Cannonade**\n\n+240% Damage  \n+1.5 Punch Through\n\n**New Status Damage Mods**\n\nThis mechanic was originally introduced with Dante, and we have dedicated a whole series of Dual-Stat Mods to it! Increasing your Status Damage stat increases the damage per tick for Statuses that do damage over time (specifically Slash, Heat, Electricity, Toxin, Blast, and Gas). \n\nEarn these Mods from new Juno Sapper Moa enemies found in Ascension missions!\n\n**Rifle Elementalist**\n\n+90% Status Damage\n\n+0.6 Punch Through\n\n**Melee Elementalist**\n\n+90% Status Damage\n\n+60% Heavy Attack Wind Up Speed \n\n**Pistol Elementalist**\n\n+90% Status Damage\n\n+60% Reload Speed\n\n**Shotgun Elementalist**\n\n+90% Status Damage  \n+60% Magazine Capacity\n\nShare your [Feedback](https://forums.warframe.com/forum/1974-ascension-game-mode-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1981-ascension-game-mode-bugs/) on the new Ascension game mode in the dedicated linked Feedback \n\nSubforums. \n\n[7d345af2728b287a9a3e05514132c58c.jpg](https://www-static.warframe.com/uploads/7d345af2728b287a9a3e05514132c58c.jpg)\n\n**NEW EXIMUS UNIT: JADE LIGHT EXIMUS**\n\nIntroducing a new Eximus Type: Jade Light Eximus.\n\n  \nPlayers will find them in all missions where Eximus spawn, where they will face the threat of Jade Light on the battlefield.\n\nThese new foes will target up to 2 players, and will summon a beam of Jade Light that follows them and deals increasing damage the longer you are in contact with it. Players can either avoid the Jade Light until it dissipates (~8 seconds) or attempt to destroy the beam by shooting at the top of it — or kill the Eximus unit itself, of course. Once a Jade Light is summoned, the Eximus' Ability will go on a short cooldown before another can be cast.\n\n[b4d5e5e6f0e8a4d87fea68e95e7e7844_1600x90](https://www-static.warframe.com/uploads/thumbnails/b4d5e5e6f0e8a4d87fea68e95e7e7844_1600x900.png)\n\n**OPERATION: BELLY OF THE BEAST**\n\nJUNE 18TH @ 11:30 AM ET - JULY 18TH @ 11:30 AM ET\n\nParvos Granum is attempting to harvest Volatile Motes to make his own Jade Light Eximus army, and only you and Ordis stand in his way. With Ordis’ help, you can commandeer the Mote Collectors and put an end to Parvos’ plans. \n\nVenture to a secretive location (discovered in the Jade Shadows Quest) at **Brutus on Uranus** to preserve Jade’s legacy! Fight against the Corpus to earn new and returning rewards from previous Operations.\n\n**What You Need To Know**\n\nOperation: Belly of the Beast requires you to step into this shrouded location - only those who have completed the **Jade Shadows Quest** are permitted to do so. \n\nAfter finishing the Jade Shadows Quest, players will have access to a new node on Uranus: Brutus. Here they can access the new Ascension game mode and access Operation-specific missions. Successfully foiling Parvos’ efforts will reward you with special Volatile Motes, which can be exchanged for Operation rewards.\n\n**What You Need To Do**\n\nWhile Operation: Belly of the Beast is live, players will have access to special nodes that allow them to take on Parvo’s forces. In these missions, all Eximus units you face will be empowered by Jade Light - meaning the only Eximus units that will spawn are Jade Light Eximus. You can help Ordis in his mission to stop Parvos in one of three ways:\n\n  * Operation Variant of Brutus (Uranus)\n  * Operation Alerts\n  * Stalker Joins the Fray\n\n\n\n**Operation Variant of Brutus (Uranus)**\n\nIn traditional Operation style, the new Brutus node on Uranus has its own Operation variant. Play Ascension as you know it, but with all Eximus units spawning in as Jade Light Eximus. On top of the regular Ascension rewards, each Operation mission will award players with 4-6 **Volatile Motes** (8-10 on Steel Path), which can be traded for rewards via Ordis in the Larunda Relay.\n\nSummoning a Sister of Parvos will also earn players an extra 1-3 Volatile Motes (2-4 on Steel Path), as well as her usual drops.\n\n  \n\n\n**Operation Alerts**\n\nIn addition to the Brutus node on Uranus, timed Operation Alerts will appear across the solar system that will also reward players with 10 Volatile Motes (15 on Steel Path). These non-Ascension missions will have normal gameplay, but will feature increased Eximus Spawns, and will only feature Jade Light type Eximus. Look for these time-limited Alerts appearing every half hour or so as an alternative method to earning Volatile Motes. \n\n**Stalker Joins the Fray**\n\nVisiting Ordis in the Larunda Relay not only allows you to earn Operation Rewards, but also lets you call on an old foe to assist in your efforts. In speaking to Ordis, selecting the “A Shared Purpose?” option will allow you to join another Squad’s mission as Stalker. Doing so will reward you with the usual mission rewards, but at risk of losing them all should you be downed.\n\n**Rewards**\n\nNo Operation is complete without rewards, and Ordis has collected quite a few offerings for you to choose from. Ordis can be found in the Larunda Relay in the Navigation Room, where he will trade Volatile Motes for rewards.\n\n**Community Progress**\n\nBelly of the Beast comes with a Community Progress segment, tracking the total Volatile Motes collected by players. As the total number of Volatile Motes collected ticks up, progress is made towards a new variant of the Jade Light Ephemera, unlocking it for purchase for all players at Ordis in the Larunda Relay.\n\n**Commit Volatile Motes**\n\nOrdis is carrying a vast array of items in exchange for Volatile Motes:\n\n  * Low Guardian Chest Plate\n  * Belly of the Beast Sigil\n  * Aspirus Ephemera (Once overall Operation progress has reached 33%)\n  * Aspirus Emergent Ephemera (Once overall Operation progress has reached 66%)\n  * Aspirus Apex Ephemera (Once overall Operation progress has reached 90%)\n  * Krios Signa\n  * Prominence Wisp Totem\n  * Fluctus Rahk Skin\n  * Ceti Lacera Blueprint\n  * Basmu Blueprint\n  * Stance Forma Blueprint\n  * The Ballroom Simulacrum\n  * Arcanes:\n    * Arcane Tempo\n    * Arcane Consequence\n    * Arcane Momentum\n    * Arcane Ice\n    * Arcane Nullifier\n    * Arcane Warmth\n    * Arcane Resistance\n    * Arcane Healing\n    * Arcane Deflection\n    * Arcane Victory\n    * Arcane Strike\n    * Arcane Awakening\n    * Arcane Guardian\n    * Arcane Phantasm\n    * Arcane Eruption\n    * Arcane Agility\n    * Arcane Acceleration\n    * Arcane Trickery\n    * Arcane Velocity\n    * Arcane Precision\n    * Arcane Pulse\n    * Arcane Ultimatum\n    * Arcane Aegis\n    * Arcane Arachne\n    * Arcane Rage\n    * Arcane Fury\n    * Arcane Avenger\n\n\n\n**Clan Contributions**\n\nOrdis is also carrying additional stock for Tenno who are in a Clan:\n\n  * Enlightened Hate Skin\n  * Gilded Clan Sigil\n  * Glyphed Clan Sigil\n  * Phased Clan Sigil\n  * Belly of the Beast Emblem\n  * Arcanes:\n    * Arcane Energize\n    * Arcane Grace\n    * Arcane Barrier\n\n\n\nAll Arcanes purchased from the “Commit Volatile Motes” and “Clan Contributions” stores will be limited to 42 (2 max rank Arcanes) per Arcane per player to prevent Operation burnout. \n\n**Clan Trophies**\n\nVolatile Motes collected by Clan members throughout the Operation will earn your Clan Trophies! \n\nLike previous Operations, Clan Trophies are available in Terracotta, Bronze, Silver, and Gold. The amount of Volatile Motes required to unlock each tier are as follows:\n\nClan Tier  |  Terracotta  |  Bronze  |  Silver  |  Gold   \n---|---|---|---|---  \nGhost  |  15  |  30  |  45  |  60   \nShadow  |  45  |  90  |  135  |  180   \nStorm  |  150  |  300  |  450  |  600   \nMountain  |  450  |  900  |  1350  |  1800   \nMoon  |  1500  |  3000  |  4500  |  6000   \n  \nPlayers can view their Clan’s progress in the “Event” tab in Navigation.\n\nShare your [Feedback](https://forums.warframe.com/forum/1987-operation-belly-of-the-beast-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1988-operation-belly-of-the-beast-bugs/) on Operation: Belly Of The Beast in the dedicated Feedback Subforum. \n\n**NEW WARFRAME AUGMENT MODS**\n\nNew Augment Mods for Dagath, Protea, Sevagoth and Qorvex are available to acquire from the Syndicates! \n\nStats below are all shown at max rank. \n\n[3b82a0375e8b4cc989cc5841a2654d5f.jpg](https://www-static.warframe.com/uploads/3b82a0375e8b4cc989cc5841a2654d5f.jpg)\n\n**Dagath Grave Spirit Augment: Spectral Spirit**\n\nImmediately assume Grave Spirit’s Spectral Form. 100% chance for weapons and abilities to apply Doom. Kills outside of Spectral Form decrease its cooldown by 1s.\n\nAvailable in the Red Veil and The Perrin Sequence’s Offerings. \n\n  \n\n\n**Protea Blaze Artillery Augment: Temporal Artillery**\n\nWhen Temporal Anchor is activated, one existing Artillery unit will attach to Protea, halting its duration countdown. Max combo count is 20x.\n\nAvailable in the Arbiters Of Hexis and The Perrin Sequence’s Offerings. \n\n  \n\n\n**Sevagoth Sow Augment: Dark Propagation**\n\nEnemies killed while inflicted with Sow spread its effect in a 15m radius. Shadow's Death Harvest also inflicts Sow.\n\nAvailable in the Cephalon Suda and The Perrin Sequence’s Offerings. \n\n**Sevagoth’s Sow Change:**\n\n  * Sow can now be recast! \n    * Previously, Sow could not be recast if at least one enemy was affected by it. This has long been a feedback point from players requesting we allow it to be recast regardless of this and with the introduction of the new Augment Mod which will also benefit from this, it is now Sow! (heh). \n\n\n\n  \n\n\n**Qorvex Containment Wall Augment: Wrecking Wall**\n\nStrip 50% of armor and shields from struck enemies. Hitting 5 or more enemies will restart the duration of any Chyrinka Pillars and empower them.\n\nAvailable in the Cephalon Suda and Steel Meridian’s Offerings. \n\nShare your [Feedback](https://forums.warframe.com/forum/1973-new-warframe-augments-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1980-new-warframe-augments-bugs/) on the new Augment Mods in the dedicated Feedback Subforum. \n\n**TENNOGEN SHADOWS**\n\nA brand new batch of creations from talented community artists arrive with Jade Shadows! TennoGen Shadows includes original takes on Equinox and Lavos, as well as Armor and Operator Accessories to expand your Arsenal. \n\n[68860e68e92a7462cce244a0aa2189e4.jpg](https://www-static.warframe.com/uploads/68860e68e92a7462cce244a0aa2189e4.jpg)\n\n**Equinox Omni Helmet**\n\nA helmet for the Equinox Warframe, designed by Rekkou.\n\n[6a76d9dd856191631e665bdef7ae3330.jpg](https://www-static.warframe.com/uploads/6a76d9dd856191631e665bdef7ae3330.jpg)\n\n**Lavos Yersin Skin**\n\nA unique skin for the Lavos Warframe, designed by Lubox.\n\n[161496c6764315bc311b79f13687a728.jpg](https://www-static.warframe.com/uploads/161496c6764315bc311b79f13687a728.jpg)\n\n**Corachrix Shoulder Armor**\n\nA unique shoulder armor for your Warframe, designed by LostEpoch & DasterCreations.\n\n[2cca1fd5c0fc281cbcbe57c4bb331ade.jpg](https://www-static.warframe.com/uploads/2cca1fd5c0fc281cbcbe57c4bb331ade.jpg)\n\n**Spicularis Oculus**\n\nA unique Oculus, designed by VentralHound.\n\n**Spicularis Mandible Mask**\n\nA unique Mask, designed by VentralHound.\n\n[76d22dfbf0c09f0a304fc6fcbbeaf440.jpg](https://www-static.warframe.com/uploads/76d22dfbf0c09f0a304fc6fcbbeaf440.jpg)\n\n**Kuva Pump Chest Plate**\n\nA unique chest armor for your Warframe, designed by CERF. The Kuva Pump Chest Armor is available only on the PC version of Warframe. \n\n  \n\n\n**NEW IN-GAME MARKET ADDITIONS**\n\n**In-game Market Change:** When viewing a bundle for Platinum that has a similar, real world currency Pack, the related pack will now appear in that bundle’s Market screen under the header “There is a similar bundle available” (and vice versa for the real money currency pack). Players can view the similar bundle’s contents and price on-hover, or select it to go to its Market screen.\n\n  * For example, the Dante Collection screen now has an option to preview/view the Dante Chronicles Pack and vice versa. This also applies to the new Jade Market bundles.   \n[dc49c12a22c76b750b4d0462d099e16c.jpg](https://www-static.warframe.com/uploads/dc49c12a22c76b750b4d0462d099e16c.jpg)  \n[254c15d19c78ca0d9e0899965da73109.jpg](https://www-static.warframe.com/uploads/254c15d19c78ca0d9e0899965da73109.jpg)\n  * The purpose of this change is to increase visibility of the purchase options that are available to players.\n\n\n\n**Jade Collection**\n\nLife and death meet in Jade. Her collection includes (all of the items listed can also be purchased individually): \n\n**Jade Warframe**\n\nBecome enraptured by the song of devastation. Through her, the Jade Light can be a source of destruction or a source of support.\n\n[51ac313c18dc1573e0d84537c8fe4305.jpg](https://www-static.warframe.com/uploads/51ac313c18dc1573e0d84537c8fe4305.jpg)\n\n**Jade Aureolt Helmet**\n\nAffirm Jade’s sacred nature.\n\nAs with all newly released Alt Helmets, its Blueprint will eventually be added to the Nightwave Cred Store in the future. \n\n[62c4ca234f021511d53a43cd2d75bd2a.jpg](https://www-static.warframe.com/uploads/62c4ca234f021511d53a43cd2d75bd2a.jpg)\n\n**Motetique Signa**\n\nMuch as music enriches the atmosphere, the Motetique Signa enhances your appearance.\n\n**Evensong Bow Primary**\n\nCounter the dread of battle with a song of praise. Fully drawn arrows fired by Evensong impale enemies and empower ally weapons with Multishot.\n\n**Cantare Thrown Secondary**\n\nIn moments of despair, let the battle resonate with song. Canatare’s blades lodge into the battlefield and return upon reload. When returning blades strike many enemies, Cantare empowers allies with increased Magazine Capacity.\n\n**Harmony Scythe Melee**\n\nHarmony triumphs over hate. Its Heavy Attacks instantly kill enemies that are open to Mercy kills. Defeat hordes in this manner to empower allies with extended Melee Range.\n\n**Jade Ophanim Decoration**\n\nBe not afraid with Jade’s gaze in your Orbiter. \n\n  * **Gift Bonus:** Gift the Jade Collection to another player and receive the Jade Ophanim Decoration as a Gifting Bonus in return. \n\n\n\n  \n\n\n[08827c7833b8623739bc65306e26f9ef.jpg](https://www-static.warframe.com/uploads/08827c7833b8623739bc65306e26f9ef.jpg)\n\n**Jade Chorus Pack**\n\nPierce through suffocating darkness by adding the radiant songstress Warframe, Jade, along with her signature Customizations to your Arsenal! \n\n**Note: As mentioned above, this real-world currency pack is the real world currency “sister” pack to the Jade Collection and is available to view from that collection’s preview screen.**\n\n**This pack features everything in the Jade Collection, the following items AND 275 Platinum** (also available for individual purchase in the in-game Market with the exception of those marked with *): \n\n[ac6163a3e1a35852c25eb72615d885c5.jpg](https://www-static.warframe.com/uploads/ac6163a3e1a35852c25eb72615d885c5.jpg)\n\n**Terror Landing Craft Skin**\n\nTransform your Landing Craft into a perfect match for Stalker’s. \n\n**Light & Shadow Color Palette**\n\nInvoke the play of light and dark with this selection of colors. \n\n**Jade Ophanim Sigil**\n\nA sigil depicting Jade’s Ophanim gaze. \n\nJade In Action Glyph* (exclusive to the Jade Chorus Pack) \n\nA glyph for your profile. \n\n**Jade’s Ensemble**\n\nArm yourself with Jade’s entire signature weapon collection. Includes the Evensong Bow, Cantare Secondary and Harmony Scythe. \n\n  \n\n\n[540293f90ab40623cd1bd5175f3d80dc.jpg](https://www-static.warframe.com/uploads/540293f90ab40623cd1bd5175f3d80dc.jpg)\n\n**Yareli Pandea Skin Bundle**\n\nStrike forth from the watery depths with the power of Yareli Pandea. Her collection includes (all of the items listed can also be purchased individually): \n\n**Yareli & Merulina Pandea Skin **\n\nWith the fall of the Orokin, Yareli Pandea drifted into the ocean’s depths where Hunhow rediscovered her. Now, she ascends to fight once more. Call upon Yareli Pandea’s faithful companion with the**** Merulina Pandea Skin (included with the purchase of the Yareli Pandea Skin and Collection). \n\n**Nidoblast Kompressa Skin**\n\nCapture your prey with Yareli Pandea’s signature Kompressa skin.\n\n**Rubra Sugatra**\n\nGive your weapons a deep sea flourish with Yareli Pandea’s signature sugatra.\n\n**Merulina Pandea Domestik Drone**\n\nFight dirt and grime with this aquatic Domestik Drone inspired by Merulina Pandea.\n\n  * **Gift Bonus:** Gift the Yareli Pandea Skin Bundle to another player and receive the Merulina Pandea Domestik Drone as a Gifting Bonus in return. \n\n\n\n**Yareli Fixes:**\n\n  * Fixed falling off a platform in the Mastery Rank 13 test while riding Merulina resulting in broken physics for Yareli. \n  * Fixed Companions not gaining Affinity from player kills while riding Merulina or K-Drive. \n  * Fixed being unable to use Transference after switching to Operator while riding Merulina and dying as Operator. \n  * Fixed icons for available K-Drive races in an Open Landscape not appearing in the detailed map when riding Merulina. \n  * Fixed being able to still use the Operator Void Beam attack after completing The New War Quest while riding Merulina and a strange dead Excalibur spawning at the same time without a head. \n  * Fixed kills while on Merulina not counting towards Sanctuary Onslaught Efficiency. \n\n\n\n  \n\n\n[9ef874e5bdcdad53ea70eb1e0a22f603.jpg](https://www-static.warframe.com/uploads/9ef874e5bdcdad53ea70eb1e0a22f603.jpg)\n\n**RESISTANCES AND STATUS REWORK**\n\nAs discussed over the last two months, across both Devstreams 179 and 180, we’ve overhauled Warframe’s Health Types and Resistances alongside a select few Status Effects! \n\n**To help players revisit their builds following these changes, an inbox containing 3x Forma will be sent to all players today (June 18th) at 12pm ET today.**\n\n**New Health Types**\n\nPreviously, enemy resistances and vulnerabilities were split between 13 Health Types: \n\nGrineer  |  Cloned Flesh  |  Ferrite Armor  |  Alloy Armor  |  Machinery  | - | -  \n---|---|---|---|---|---|---  \nCorpus  |  Flesh  |  Shields  |  Proto-Shield  |  Robotic  |  Ferrite Armor  |  Alloy Armor   \nInfested  |  Infested  |  Infested Flesh  |  Fossilized  |  Infested Sinew  |  Ferrite Armor  | -  \nSentient  |  Flesh  |  Robotic  |  Ferrite Armor  |  Alloy Armor  |  Shields  | -  \nMurmur  |  Indifferent Facade  |  Ferrite Armor  |  Infested  |  Machinery  | - | -  \n  \nEach of these Health Types had unique interactions with the various Status Types: \n\nPhysical  |  Impact: Stagger  |  Puncture: Reduced Damage Output/+Crit Chance  |  Slash: Bleed  | - | - | -  \n---|---|---|---|---|---|---  \nIndividual Status  |  Cold: Slow/+Crit Damage  |  Electricity: Tesla Chain  |  Heat: Burn  |  Toxic: Poison  | - | -  \nCombined Status  |  Blast (Heat + Cold): Inaccuracy  |  Corrosive (Toxic + Electricity): Corrosion  |  Gas (Heat + Toxic): Gas Cloud  |  Magnetic (Cold + Electricity): Shield Disruption  |  Radiation (Heat + Electricity): Friendly Fire  |  Viral (Cold + Toxic): Amplified Health Damage   \n  \nOptimizing builds to make use of this system required players to memorize health types per enemy (not just per Faction) and their resistances/vulnerabilities. Our goal is to reduce the friction necessary to engage in optimal play, so we’ve:\n\na) Simplified the number of Health Types\n\nb) Redesigned how Faction Resistances work \n\nc) Increased the visibility of the new vulnerabilities in normal gameplay flow \n\nInstead of having 13 Health Types, we have simplified them into 4:  \n\n\n  * Health\n  * Armor\n  * Shields\n  * Overguard\n\n\n\nNow, these Health Types only serve to differentiate between Status Effects and Abilities that affect them, such as Magnetic hindering Shields, Corrosive stripping Armor, or Viral amplifying Health damage.\n\nWe’ve changed the system so that Resistances and Vulnerabilities are **no longer tied to the previous Health Types**. Resistances and Vulnerabilities are now based upon the Faction a player is engaging with. \n\n**Star Chart “Suggested Damage”**\n\nVulnerabilities are now listed in The Star Chart mission nodes! Here, we aim to recommend the appropriate per-Faction Resistances, which will then universally affect that specific group.\n\n**The Star Chart** now shows Faction Resistances per node. Aligned with the present Faction, **Vulnerabilities and Resistances** will be listed to communicate the “Suggested Damage” options best used against any specific Faction or location.\n\n[66f1be34ab89ea74fe28f2b721efe055.jpg](https://www-static.warframe.com/uploads/66f1be34ab89ea74fe28f2b721efe055.jpg)\n\nSub-Factions will also have different Vulnerabilities and Resistances from their primary counterpart. The three main Sub-Factions are:\n\n  * Kuva Grineer\n  * Corpus Amalgam\n  * Deimos Infested\n\n\n\nViewing Faction Vulnerabilities and Resistances now also depends on where the player is within Warframe’s Story. The Factions (and Sub-Factions) will be unlocked via:\n\nFactions:\n\n  * Grineer: Unlocked by **default.**\n  * Corpus: Unlocked by **default.**\n  * Infested: Unlocked by **default.**\n  * Orokin: Unlocked after **Phobos Junction.**\n  * Sentient: Unlocked after **The Second Dream Quest** completion.\n  * Narmer: Unlocked after **The New War Quest** completion.\n  * Zariman: Unlocked after **Angels of the Zariman Quest** completion.\n  * Murmur: Unlocked after **Whispers in the Walls** **Quest** completion.\n\n\n\nSub-Factions:\n\n  * Kuva Grineer: Unlocked after **The War Within Ques** t completion.\n  * Corpus Amalgam: Unlocked after **Jupiter Junction.**\n  * Deimos Infested: Unlocked after **Heart of Deimos Quest** completion.\n\n\n\n**Simplified Faction Resistances**\n\nWith the removal of Resistances/Vulnerabilities being tied to Health Type, they will now be Faction-specific.\n\nDefault Faction Vulnerabilities and Resistances:\n\n  * Grineer: Vulnerable to **Impact** and **Corrosive**\n  * Corpus: Vulnerable to **Puncture** and **Magnetic**\n  * Infested: Vulnerable to **Slash** and **Heat**\n\n\n\nFactions by Quest Vulnerabilities and Resistances:\n\n  * Orokin: \n    * Vulnerable to **Puncture** and **Viral**\n    * Resistant**** to**Radiation**\n  * Sentient: \n    * Vulnerable to **Cold** and **Radiation**\n    * Resistant**** to**Corrosive**\n  * Narmer:****\n    * Vulnerable to **Slash** and **Toxin**\n    * Resistant**** to**Magnetic**.\n  * Zariman: Vulnerable to **Void**\n  * The Murmur: \n    * Vulnerable to **Electric** and **Radiation**\n    * Resistant to**Viral**\n      * Rogue Necramechs also fall under these Vulnerabilities and Resistances.\n\n\n\nSub-Faction Vulnerabilities and Resistances:\n\n  * Kuva Grineer: \n    * Vulnerable to **Impact** and **Corrosive**\n    * Resistant**** to**Heat**\n  * Corpus Amalgam:****\n    * Vulnerable to **Electric** and **Magnetic**\n    * Resistant**** to**Blast**\n  * Deimos Infested:****\n    * Vulnerable to **Blast** and**Gas**\n    * Resistant**** to**Viral**\n\n\n\nWith these Resistance and Vulnerability changes, we’ve made a notable decision to make **Impact** deadlier towards the **Grineer** , while making **Puncture** deadlier towards the **Corpus**. This is a departure from the previous system, however, we believe that these two Statuses are more suited for these specific Factions.",
        "num_comments": 157,
        "comments": [
            ">Stalker Joins the Fray\n\n>Visiting Ordis in the Larunda Relay not only allows you to earn Operation Rewards, but also lets you call on an old foe to assist in your efforts. In speaking to Ordis, selecting the “A Shared Purpose?” option will allow you to join another Squad’s mission as Stalker. Doing so will reward you with the usual mission rewards, but at risk of losing them all should you be downed.\n\nThis seems like we're joining as allies right? Would be fun to join as an enemy, but could probably lead to griefing and Souls style sweatiness.",
            "* The Heat damage per second from ring of fire can now trigger Heat Status Effects\n\nPablo heard and cooked\n\n* Players often hop into Operator/Drifter mode to traverse gaps, but doing so over a void would reset your Warframe once they hit the teleport volume. If you ever experienced a fade-to-black while Void Slinging over a void, this was what caused it! Now this will no longer happen, provided you are in Transference when your Warframe falls into the teleport volume.\n* Kuva and Tenet weapons with 58% Elemental Bonus or above will now automatically round that value up to 60%.\n\nluv u DE",
            ">We’ve improved enemy spawn logic in Excavation missions to decrease the wait time between completing Excavators.\nThis addresses the player reported issue that it often would take far too long for enemies to spawn when moving from one Excavator to another.\n\nAFTER TEN THOUSAND YEARS I'M FREE",
            "Since**Impact Status Effects** enables **Mercy** actions, we found that it wasn’t all too effective against **Corpus** due to their lower Health counts compared to their **Shields** , while **Mercy** killing **Grineer** is more accessible due to their innate tankiness. The **Corpus** can deliver incredibly high amounts of raw damage, allowing for **Puncture** to naturally play effectively into limiting their damage potential.\n\n**Armor Adjustments**\n\nImportant Note: We have not changed player Armor. This only applies to enemy Armor!\n\nEnemy Armor scaling in its previous current iteration meant that Armor Stripping was almost an all-or-nothing game, especially at higher levels. This resulted in players focusing on Armor Stripping as a way to tackle Grineer at higher difficulty content. Our goal is to reduce some of the extreme damage reduction offered by Armor at high levels, and make partial Armor Stripping more feasible. \n\nTo do so, we are making the following changes: \n\n  * Armor has a maximum cap of 2700 Armor (90% Damage Reduction).\n  * Armor has a minimum cap of 200 Armor.\n  * Steel Path no longer increases Armor values.\n  * Grineer enemies have increased Health scaling.\n  * Altered the formula for Armor Reduction to increase the effectiveness of Partial Armor Stripping.\n    * For reference, currently around 50% of Damage Resistance came from just 300 Armor, which is why complete Armor Strip felt so needed at higher levels.\n\n\n\nAdditionally, our goal was to make partial Armor Stripping a more valuable tool. By capping enemy Armor and adjusting how Armor is calculated, a partial Armor Strip will allow players to engage with high-level Grineer more easily - meaning max Corrosion stacks against an Armored enemy (reducing the Armor by 80%) will feel more impactful due to the new distribution of Damage Resistance from Armor values). \n\nFull Armor Strip is still valuable, but we wanted to even the playing field so players didn’t feel forced to build around it.\n\n**Shield Adjustments**\n\nImportant note: We have not changed player Shields. This only applies to enemy Shields!\n\nThe Grineer are tankier by design, but the Corpus try to make the difference through their Shields. However, Corpus Effective Hit Points (EHP) are significantly lower, making them often trivial to deal with by comparison. Our goal is to reduce the discrepancy between Grineer and Corpus time-to-kill (TTK) by making Corpus Shields a bit more challenging and interesting to fight. \n\n**Changes to Enemy Shields** :\n\n  * Shields now scale more quickly starting at level 80. This means stronger Shields than before as players fight higher-leveled Shielded enemies. \n  * Shield Recharge Delay is now unified across all enemy types.\n  * Shield Recharge Delay now has a minimum and maximum length depending on how much damage has been dealt to enemy Shields.\n    * The more damage dealt, the slower enemy Shields will begin recharging, so if you can’t outpace enemy Shields right away, you can chip their Recharge Delay down within a maximum and a minimum.\n      * For example, if enemy Shields break at any point, it automatically acts as if 200% damage (which becomes the maximum delay) has been inflicted on those Shields. However, if an enemy absorbs 99% damage (so 1% of their shields left), their accumulated damage taken now sets their Recharge Delay in the middle of their respective minimum and maximum delays. Should they Recharge and you deal another 99% damage to their Shields, they’ll have absorbed 198% damage, taking them to the maximum Recharge delay of what that scaled enemy can have.\n  * Shield Recharge Rate scales with enemy level, recharging at a faster rate for higher-leveled enemies.\n    * Shield Recharge Rate will also accelerate while Shields are actively Recharging.\n      * Shield Recharge Acceleration Rate’s base multiplier greatly increases after level 80, resulting in faster Recharge rates at higher levels.\n  * Steel Path Shields are now multiplied by 2.5x, in place of the previous 6.25x. Steel Path Shields were doubly-applying the multiplier unintentionally.\n\n\n\n**Effective Hit Points (EHP) Adjustments**\n\nEnemy stat scalings, such as Health and Shields, now grow faster as enemy level increases, in compensation of the loss in Enemy Armor and to make Shields more engaging to deal with. \n\n**Changes:**\n\n  * After Level 75-80, enemies receive increased stats, such as Health, at a slightly increased rate to prevent EHP stagnation.\n    * It’s important to note that the increase in Health scaling is not meant to match the EHP values seen by previous levels of Armor. \n\n\n\n**Status Effect Reworks**\n\n**Blast**\n\nOur goal with Blast is to invoke an immediate and on-death effect to emphasize explosions. \n\nNow, instead of enemy inaccuracy, you **detonate** your enemies! When dealing a Blast Status Effect to an enemy, the following will happen:\n\n**Blast Changes:**\n\n  * Upon inflicting a Blast Status Effect, individual stacks will cause a mini-explosion, and a max stack count of 10 will inflict combined damage in a 5m radius\n    * After 1.5 seconds, an individually incurred Blast Status Effect deals a percentage of base-inflicted damage per stack-explosion and over 100% of base-inflicted damage for a full (10 stack) explosion.\n  * Status Duration will increase the delay before the Status Effect applies and depletes.\n  * Removed the previous Status Effect of inaccuracy.\n\n\n\n**Cold**\n\nWith Cold, we want to fully realize the fantasy of slowing, freezing and shattering your enemies. The existing Cold Status mechanic of slowing enemies is unchanged, but now has a new mechanic upon applying Max Stacks - freezing your foes!\n\n  \n\n\n**Cold Changes:**\n\n  * Cold now has a maximum cap of 10 stacks (was 9).\n  * Applying 10 Cold stacks to a foe will make them **Frozen** for 3 seconds. Frozen enemies cannot move, will not recharge Shields, and receive double Critical Damage. After the Frozen effect wears off, 3 Cold stacks will remain. \n    * Bosses, such as Alad V or Kela De Thaym, will be unable to be Frozen since they cannot accumulate 10 Cold stacks.\n\n\n\n**Gas**\n\nGas often lacked effective readability, making it difficult to distinguish its presence from the enemy or yourself. We’ve introduced enhanced visuals so that when the Gas Status Effect is active, you’ll be able to recognize it more clearly.\n\n**Gas Changes:**\n\n  * Added VFX on top of the target affected by a Gas Cloud to clearly show an effect is active.\n    * In addition to current and new VFX, Gas VFX now also more clearly shows the radius of the Gas Damage-over-Time (DoT) effect around a given target to better understand its impact on surrounding enemies.\n      * If a player is inside the radius of the Gas DoT, the visuals are reduced for them to maintain visibility, similar to Frost’s Snow Globe. \n  * Gas VFX now has billowy volume to better present presence.\n  * Gas VFX now has additional floating particles around the smoke.\n\n\n\n**Magnetic**\n\nMagnetic has received a few buffs to increase its effectiveness against Shields and to hammer home the power fantasy of overloading enemy Shields.\n\n**Magnetic Changes:**\n\n  * Damage to Nullifier Bubbles has been increased\n    * Minimum Damage raised to 300 Damage per shot.\n    * Maximum Damage raised to 1200 Damage per shot.\n    * Additionally, we now show the minimum and maximum damage numbers against Nullifier Bubbles, with Magnetic attacks displaying the buffed damage shown above, while non-Magnetic sources will display the original, unbuffed damage.\n      * Known issue: Clients see the incorrectly unbuffed damage from Magnetic sources, which is strictly a UI/visual bug. Magnetic sources will continue to deal increased damage towards Nullifier Bubbles despite the incorrect numbers displayed. We will look to resolve this in a future Hotfix/Update. \n  * Reduced Shield Regeneration by a percentage per Magnetic stack against affected targets.\n  * Upon Shield/Overguard Breaking a target, the enemy will now be dealt Electric Status damage for a percentage of Max Shields/Overguard per Magnetic stack while also forcing an Electric Status Effect.\n  * Magnetic stacks on an enemy with Overguard now allow for bonus damage to Overguard, similar to how Magnetic affects Shields. \n\n\n\n**Warframe Changes**\n\nWith the above changes to Resistances and Status Effects, we took a look at Warframe abilities and made some adjustments to compliment the changes.  \n\n\n**Frost Rework**\n\nFrost, the definitively-themed Cold Warframe, has received a rework to better situate him for how Cold works with this Update! While Frost dealt icy attacks to his foes, the Freeze from his hit was not tied to Cold Status Effects. With the update to the Cold status, we have also amended his kit to properly use Cold Status Effects to Freeze enemies! \n\n**New passive - Fortifying Freeze:**\n\nCold Status Effects applied by Frost Abilities have their duration increased by 100%. Frost gains 50 Armor per enemy inflicted with Cold Status within 15m.\n\n**Freeze (1st Ability):**\n\n  * Adds required Cold stacks to freeze instead of simply freezing to both initial hit and AoE interactions.\n  * “Duration” is now known as “Freeze Duration,” indicating how long an affected target is Frozen.\n  * Doubled the baseline Area of Effect component of the projectiles.\n  * The Area-of-Effect aspect now scales with the Ability Range stat. The Area-of-Effect Radius is now present in the Ability description. \n\n\n\n**Ice Wave (2nd Ability):**\n\n  * “Duration” is now known as “Freeze Duration,” indicating how long an affected target is Frozen.\n  * **Ice Wave Impedance Augment Changes:**\n    * Leaves a frozen trail for 12s that adds a Cold Status Effect per second on enemies in contact with it.\n\n\n\n**Snow Globe (3rd Ability):**",
            "The new Semi-Auto mods that add punch through are game changing, especially for secondaries and shotguns. Modding punch through was extremely hard for those weapons due to a lack of options, and now they have a great one that combines with your damage.\n\nFor Primaries, it may still be worth taking Shred since it combined your fire rate mod and your punch through mod already, but many weapons still didn't want or need that fire rate.",
            "only took 10 years to be able to duplicate our mod loadouts lol",
            "- Changed Tenet Diplos to continuously burst fire at already marked targets while aiming and holding the firing input. \n\nThis little nugget in here is amazing, thank you. No longer will we be forced to hip-fire!\n\nWas the hold to fire semi-auto function coming with this update, or a later one? I can't remember.",
            "I'd like to take a moment to thank the sponsor of today's update, Jade: Shadows Legend",
            "Love, love, love the idea of having Sisters of Parvos as a kinda zone boss ala Void Angels. I hope we can have something similar for Liches in high level Grineer content someday. \n\n\nSomething to maybe test, can you subsume Doom and still apply it through Dagath's augment? Might honestly make her a little cracked if so.",
            "Aren't the new Status damage mods kinda huge for some builds? I don't remember seeing those in devstreams lmao"
        ]
    },
    "Jade Shadows - Spoiler Courtesy": {
        "title": "Jade Shadows - Spoiler Courtesy",
        "score": 160,
        "url": "https://www.reddit.com/r/Warframe/comments/1dfx2k0/jade_shadows_spoiler_courtesy/",
        "content": "[Source](https://forums.warframe.com/topic/1400054-jade-shadows-spoiler-courtesy/)\n\n[image.png](https://content.invisioncic.com/Mwarframe/monthly_2024_06/image.png.114f0c47f5adfc197d065518636ef9ca.png)\n\nHey Tenno! \n\nWe are just a few days away from the release of our next update & cinematic quest - _Jade Shadows!_ As we reveal more of Warframe’s story, we ask that you help preserve the mystery for fellow Tenno as they enjoy the update at their own pace. \n\n**Spoiler warnings** on your respective platforms, as well as**spoiler tags on the forums** , are the best way to share your experience without ruining the quest for others. \n\n**Content Creators (streams, videos, Captura, fan art, etc.) should clearly label spoiler content and use spoiler-free thumbnails and titles.**\n\nFor our forums, you can use the **‘Spoiler’ tag** to properly mark your post, as well as the built-in **‘Spoiler’ button** to cover your text up when posting: \n\n  \n[image.png](https://content.invisioncic.com/Mwarframe/monthly_2024_06/image.png.2238775c6e01d1ee904c5eabb325d16c.png)\n\nWe will have a dedicated subforum for Jade Shadows on launch, which will house all update-related discussions, questions, and more so that we can keep the rest of the Forums spoiler-free. \n\nWe’re excited for you to revisit the mysterious Stalker, and learn more about Jade - see you on **June 18th!**\n\n------\n^(This action was performed automatically, if you see any mistakes, please tag u/desmaraisp, he'll fix them.) [^(Here is my github.)](https://github.com/CephalonAhmes/CephalonAhmes)\n\n^(I have found a new home on AWS Lambda, RIP Heroku free tier.)",
        "num_comments": 78,
        "comments": [
            "Reddit fellas, this post is in discord and forums format. \n\nTo add spoilers in the body or comments:\n\n```>!insert spoilers in here!<```\n\nExample: >!insert spoilers in here!<\n\n###Titles for posts do not use this format.\n\nSo please, tag it [Spoiler] or [SPOILER] and DO NOT put the actual spoiler in the title.\n\nThis respects users who are also on other apps or browsers.\n\nPosts that do not follow this will be removed. \n\nOur rule is that ***this spoiler enforcement will last up to 10 days*** after the last platform has obtained it.",
            "the part where its revealed that the Stalker was just a stack of 8 corpus ratel robots in an elaborate warframe costume and hat completely blew my mind\n\nand all the robots having thick cockney accents was a stroke of genius\n\n  \nbravo, i say!",
            ">!Did not expect to play Guitar Hero on a pregnant Warframe but here we are. I want that damn Upgrade for the Hate it looked awesome.!<",
            "> asspoiler \n\n\nThe perfect location for a typo, =D\n\n\nWe shall avoid all ass poilers! o7",
            ">!Well that’s was short. And weird.!<",
            "Holy shit these vestigial mote rates are INSANELY slow. 2 hours of doing the event and I have 149 motes. Taking like 6-8 minutes to do SP with the sister.",
            ">!Testing, testing 1, 2, 3!< \n\nIs this thing on?",
            "Well, regarding story progression,  \n>!THAT'S A FREAKING WARFRAME BABY, AND IT'S SENTIENT(as in it's not a puppet), HOLY FUCK!!!!!<  \n>!I bet the next-ish story update will see the remaining Grineer Queen try to take that baby to do transferance on it.!<  \n>!I mean, yaeh a tenno body is cool and all, but here we're talking of something completely new and with untapped, possibly gigantic, potential.!<",
            "Just a reminder that it's a 25-30 minute quest, meaning we'll probably only get 5-10 lines of dialogue as the rest is running Ascension for the first time as a tutorial",
            "has anyone figured out which settign fixes my UI scale?"
        ]
    },
    "Stalker at the supermarket": {
        "title": "Stalker at the supermarket",
        "score": 480,
        "url": "https://i.redd.it/8z32jt98t28d1.jpeg",
        "content": "",
        "num_comments": 24,
        "comments": [
            "I was not expecting to wake up see reddit and see this gem this made me laugh so hard 🤣",
            "I need a short sfm or something showing stalker and his kid's antics",
            "Living for stalker as single dad.\n\n\nChild proofing corners. Those little gates everywhere. Then remembers its a WARFRAME baby and panics about baby proofing for THAT.",
            "\"I made this.\"",
            "What will he buy",
            "Give us six seasons and a movie of two and a half men esque antics with stalker, stalkers kid and hunhow",
            "https://i.redd.it/gz92szvmz38d1.gif",
            "I just imagine the lights at walmart flicker....",
            "So cute!",
            "Spoiler, thank you"
        ]
    },
    "Meet the Space family": {
        "title": "Meet the Space family",
        "score": 508,
        "url": "https://i.redd.it/da8dkcfkm28d1.jpeg",
        "content": "",
        "num_comments": 65,
        "comments": [
            "Don't forget to add our step family, the Entrati, into the lineage. Mother immediately was titled Space Step Mom upon release.",
            "I would swap Umbra and Teshin. Teshin is more of a Space Dad, white Umbra is that weird uncle who you see once a year - and half of the time he's in jail.",
            "Ordis is the best friend that you consider like an older brother",
            "Where CLEM!? he's like the cool cousin.",
            "U forgot grandma",
            "I'd say Umbra is another uncle we adopted. We don't really have a space dad",
            "Ordis is space dad #2 because he deserves it",
            "To me, Stalker has always been the brother who hates the family and wants nothing to do with us. So the little ball of cuteness is my sweet little nephew. \n\nAND I DEMAND TO BE A PART OF HIS LIFE, SHADOW!!",
            "We gave birth to our cousin 😃",
            "Now where would the Drifter fall in line here?"
        ]
    },
    "Jade Eximus are getting out of hand (kind of a rant)": {
        "title": "Jade Eximus are getting out of hand (kind of a rant)",
        "score": 998,
        "url": "https://v.redd.it/9fdad6wob18d1",
        "content": "So I don’t ever post on my Reddit account but I do sort of lurk around reading posts here and there and I’ve been reading different reactions to Jade Eximus. Personally, I found them fun and encouraged more active gameplay out of some of the more afk builds that are becoming more common, and introduced an actual challenge beyond extreme level/ armor scaling. But THIS was so bad I had to post it somewhere hoping that this is some sort of bug. And this happened to me TWICE beforehand. \n\nExplanation (skip this paragraph if you can see lol):\nIn this clip you’ll see that the Hyldryn is staying on the target to provide shields to the defense target while I cast Tentacle Swarm to provide crowd control in the area while I go to kill an Eximus that was in the area. Another Jade Eximus appears and (apparently from BEHIND A DOOR) targets the Hyldryn and in FIVE SECONDS absolutely shreds the defense target, causing the mission to fail. The eximus I tagged was the only one I could see in the area.\n\nIn what universe is this fair? An eximus that can attack from what appears to be more than double my cc range, is not effected by my cc anyways, and can shred a defense target faster than anyone can have the opportunity to react. I’m happy to have challenging content but this is just excessive. I understand that it’s not good for allies to stand on the defense target as it can get hit by stray bullets and draws more enemies to the target but even in those cases you have a good while to clear the enemies from the area or move before it gets out of control. It’s actually kind of ironic because the Jade Eximus seem to be made ignoring all the restrictions most warframes have to follow. They have incredibly strong damage with no obvious LOS check all with ridiculous range. This isn’t a challenge, it’s just straight up impossible to handle. \n\nSide note: Why do eximus abilities effect defense targets anyways? They’re already difficult enough being immune to all cc, I don’t see the point in them nuking the defense target too.",
        "num_comments": 436,
        "comments": [
            "This will probably get buried under all the comments here but allow me to clarify a few things. \n\n1. The damage is perfectly fine on players and as I state IN THE POST I absolutely welcome a unit punishing AFK players \n\n2. My problem is not that it punishes AFK players, it’s that the punishment ends the game for everyone who’s actually playing properly \n\n3. Im not the hyldryn? I know how to play around the eximus? Im genuinely confused at how someone else going AFK is MY “skill issue”. \n\n4. Just to be absolutely clear: if the hyldryn went down as punishment for being afk, maybe even a noticeable amount of damage to the objective to encourage players to rally back to the area, that would’ve been fine. It’s the fact that the game ended faster than I could even notice the health bar depleting that’s bothering me. \n\n5. No “just subsume” is not a good counterpoint",
            "I see too many people saying \"don't afk on the objective!\" Like the person is just unaware, but what if they do it on purpose?\n\nThis is an extremely effective grieffing tool and will absolutely be used as such, let's see how those opinions change when people start trolling on purpose",
            "I agree completely. My genuine concerns with this isnt that it’s too strong, it’s the ability it gives the toxic players for griefing. Anyone who is targeted by the jade eximus who wants to fail the mission for everyone now can. I hate that there is toxic players in this community but it is a sad fact. I’m assuming they are going to remove its damage on defense targets when they realize this. \n\nSide note, don’t just say play solo. If an enemy is forcing the entire player base to play solo it’s a problem with the enemy.",
            "I thought we collectively had a conversation about why being AFK on top of the objective is bad back in what... 2015?",
            "People all talk about \"anti-afk\", since when stoping for 3 seconds is being afk? You stop to respond a message and you are dead, you want to write something to squad, you are dead, wanna use Mesa's 4 for more than 4 seconds, you are dead. I think its a cool mechanic but the damage is off the charts. I played Belly of the Beast on SP for a day and it looked like a green laser hydra, you shot 1 laser and 2 more would appear, i think i spent more time looking up and destroying lasers than playing the actual mission.",
            "DE on Warframe abilities: \"Oh no no no NO\" you can NOT hit enemies that are not in your view !  \nDE on eximus:  \"Yeah so this cool laser will target the player across the walls\"",
            "One of the most frustrating threads I’ve seen on here\n\nJust play solo\n\nJust subsume silence\n\nJust stand on the platform the whole time and babysit\n\nJust get better teammates. Try discord!\n\n\nSimple answer is that it does less damage to the objective. \n\nThe same try hards saying this shit are the ones that complained about circle killing netracells. You *liking* that boring ass content that you HAVE to play solo since those bad teammates drove you off?\n\nThis will be patched though. I can’t imagine DE will keep that in once the fails start rolling in. If not, this will be the first post of many…",
            "While I agree that they shouldn't be able to target you through doors or walls this is 100% on the person who just stood there while the beam charged up and didn't bother to move. All they had to do was not stand still once the beam started. Just slide to the left.",
            "Defense objectives in particular have always been garbage at being able to take a few hits at high levels. \n\nThe defense objective on Akkad can tank an entire wave of the infestation, compared to this scenario where the objective has *even more health and shields*, I think a great fix for this kind of thing would be to just change all objectives to the same health, and filter enemy hits so they deal a certain portion of the objectives health at any time.\n\nThere is no scenario where the defense objective should be one-shot by ANY enemy.",
            "The OP's video literally proving how unfair this new eximus is: while trying to \"punish\" the afk, but also involving everyone together. It doesn't solve anything, just makes it worse.\n\nMeanwhile the majority is saying: \"skill issue\", \"yep I love the new anti-agk mechanic\".\n\nBro is the problem the afk? Kick them out asap instead of this bs. It's completely unnecessary and we already had 2 different eximus that targeted you with damaging bubbles. Rocket League for example doesn't even wait 1 minute to kick afk players.\n\n-Nothing stops the afks to be dead the entire mission while you complete it for them. Or respawn right at the end.\n-Neither them running some immortal frame like Revenant and doesn't helping for any reason.\n\nI know those things because I've been getting those afks on my squads, especially the first case. I got some prints and clips from a guy just running around on sp circuit, not that would change anything. Still I'm right here having my invisible operator taking dmg while reviving a squad mate, then instantly being dead when going back to frame, resulting on two people down."
        ]
    }
}