{
    "Update 36: Jade Shadows": {
        "title": "Update 36: Jade Shadows",
        "score": 322,
        "url": "https://www.reddit.com/r/Warframe/comments/1dit9kb/update_36_jade_shadows/",
        "content": "[Source](https://forums.warframe.com/topic/1400346-update-36-jade-shadows/)\n\n[e4e0963af77446ab93d7a3398312175_1600x900](https://www-static.warframe.com/uploads/thumbnails/e4e0963af77446ab93d7a3398312175_1600x900.png)\n\n**UPDATE 36.0: JADE SHADOWS**\n\nIn moments of despair, let the battle resonate with song. Delve into long-held secrets of the Origin System with our new Ascension Game Mode, Operation: Belly Of The Beast and the latest cinematic Quest that uncovers a secret, long kept by the Stalker. \n\nJade Shadows also brings our 57th Warframe, Jade, a glorious herald of both life and death. An Arsenal of her radiant weapons awaits you, fit to combat that which lies in the dark. \n\nDiscover New Warframe Augment Mods, the Yareli Pandea Skin Bundle, new TennoGen and more! We’ve also packed this Update with reworks and QOL - read on to learn everything Jade Shadows has brought!\n\nJade Shadows is a Mainline Update! \n\nMeaning that everything the team has been working on since the launch of Dante Unbound is in this update (with the obvious exception of content that is not ready to be released). It is very likely, as it is with all Mainline updates, that things slip through the cracks so we will be watching for bug reports and feedback in the [dedicated Jade Shadows Subforums](https://forums.warframe.com/forum/1966-update-36-jade-shadows/) to address in follow-up Hotfixes.\n\nIf any of the terms above are new to you, visit “[The Warframe Lexicon for Updates](https://forums.warframe.com/topic/1355354-the-warframe-lexicon-for-updates-patch-notes/)” to learn more about Warframe’s development cycle. \n\nUpdate Download Size: ~1.15 GB \n\n**Total Warframe Download Size: 39.5 GB**\n\n* * *\n\n**TABLE OF CONTENTS:**\n\nThere is much to explore in Update 36: Jade Shadows! We highly encourage you to read the patch notes in full but if you are looking for a specific topic, simply CTRL+F the following keywords to jump to its dedicated section:\n\n  * New Cinematic Quest: Jade Shadows \n  * New Warframe: Jade \n  * New Weapons \n    * New Bow: Evensong \n    * New Thrown Secondary: Cantare \n    * New Scythe Melee: Harmony \n  * New Game Mode: Ascension \n  * New Eximus Unit: Jade Light Eximus \n  * Operation: Belly Of The Beast (begins today at 11:30 AM ET) \n  * New Warframe Augment Mods \n  * Tennogen Shadows \n  * New In-Game Market Additions \n    * Jade Collection \n    * Jade Chorus Pack \n    * Jade’s Ensemble \n    * Yareli Pandea Skin Bundle \n  * Resistances And Status Rework \n    * The following list is featured sections and is not exhausted: \n      * Simplified Faction Resistances \n      * Armor Adjustments \n      * Shield Adjustments \n      * Status Effect Reworks \n      * Warframe Changes \n        * Includes Frost Rework, Ember Changes and more \n  * Duviri Additions & Changes \n    * New Decrees \n    * New Undercroft Mission: Alchemy \n    * Pathos Clamps Rewarded From Undercroft Portals \n  * New Player Experience Improvements \n    * Debt-Bond Farming Changes \n    * Voidrig Acquisition Improvements \n    * Awakening Quest Improvements \n  * UI Additions, Changes & More \n    * Loadout Customization From Navigation \n    * Arsenal UI Additions & Changes \n    * Stat UI Changes & Fixes \n  * HUD Changes \n  * Finisher Changes \n  * New Video Setting: Reduce Frame Latency \n  * Additions \n  * Changes \n  * Top Fixes \n  * Optimizations \n  * Fixes  \n\n\n\n\n* * *\n\n  \n\n\n[95e413030679a8f8b410866f5929164f.png](https://www-static.warframe.com/uploads/95e413030679a8f8b410866f5929164f.png)\n\n**NEW CINEMATIC QUEST: JADE SHADOWS**\n\nStruggling to understand the oldest and deepest secret from his past, Stalker finds himself allied with sworn enemies on the troubling road toward uncovering the truth… and averting an incalculable loss. \n\n**Spoiler Courtesy**\n\nJade Shadows contains significant spoilers for Warframe! **To ensure that all Tenno enjoy the best possible experience, we ask that you allow others to complete the Quest at their own pace, and to please be kind by avoiding spoiling it for others.**\n\nIf you’d like to discuss or share anything related to the Quest after playing (and we certainly expect that you will), **please use spoiler tags so everyone can experience it as intended.**\n\nHere’s how you can use spoiler tags/warnings to share your experience without impacting others:\n\n  * Use “Spoiler” warnings on any content pertaining to the Ques. This includes social posts, live streams, videos, Capturas, Fan Art, Etc. \n    * On our Forums you can use the “Spoiler” tag to properly mark your post, as well as the built-in**** “Spoiler” button to cover your text up when posting:  \n[97d4fe7820f0842c6453f85bd04bcc9d.png](https://www-static.warframe.com/uploads/97d4fe7820f0842c6453f85bd04bcc9d.png)\n  * Content Creators should clearly label spoiler content and use spoiler-free thumbnails and titles.\n\n\n\n**Quest Prerequisites**\n\n**You must have completed The New War Quest in order to play the Jade Shadows Quest**. The Quest will become available from your Codex once you have done so. \n\n**Quest Commitment & Duration**\n\nSimilar to The New War Quest, once you commit to beginning Jade Shadows you will be unable to do other Warframe activities for the duration of the Quest. You will be able to pause the game, and your progress will be saved between missions. It is roughly a ~30 minute experience, perhaps faster for seasoned Tenno! \n\n**Content warning:** This quest contains scenes of trauma related to motherhood. \n\n**Quest Rewards**\n\n  * **Jade** Warframe Blueprint\n  * Access to **Operation: Belly Of The Beast**\n    * Read the dedicated section below to learn more about the Operation\n  * Access to the new **Ascension Game Mode**\n    * Read the dedicated section below to learn more about the new Game Mode\n  * New Captura Scene from the Quest\n  * New Displays from the Quest\n\n\n\nShare your [Feedback](https://forums.warframe.com/forum/1985-jade-shadows-quest-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1978-jade-shadows-quest-bugs/) on the Jade Shadows Quest in the dedicated Feedback Subforum. \n\n  \n\n\n[44753cfd6f1d407fd4e9b4b51bf9d487.jpg](https://www-static.warframe.com/uploads/44753cfd6f1d407fd4e9b4b51bf9d487.jpg)\n\n**NEW WARFRAME: JADE**\n\nBecome enraptured by the song of devastation. Through her, the Jade Light can be a source of destruction or a source of support.\n\n**How To Acquire Jade**\n\n  * **Completing the Jade Shadows Quest:** Jade’s Blueprint is rewarded after completing the Quest.\n  * **New Ascension Game Mode - Brutus (Uranus) Drop Tables:** Jade’s Component Blueprints have a chance to be rewarded from the new Ascension Game Mode on Brutus, Uranus (more information in the “New Game Mode: Ascension” section below). \n  * **Ordis’ “Release Vestigial Motes” Store in the Larunda Relay:** Jade’s Blueprint and Component Blueprints can be exchanged for Vestigial Motes via Ordis in the Larunda Relay on Mercury (more information about Vestigial Motes can be found in the “New Game Mode: Ascension” section below).\n  * **In-Game Market:** Jade and her Collection are available for purchase in the in-game Market for Platinum. \n\n\n\n**Jade’s Abilities**\n\n**Passive: The Anointed**\n\nJade’s profound understanding of the relationship between life and death grants her two Aura Mod Slots. Some of her Abilities apply **Judgments,** increasing enemy damage vulnerability by 50% for 10s. \n\n**Ability 1: Light’s Judgment**\n\nCreate a well of light that heals allies and hurts enemies. Those who enter the well will be highlighted by Judgment.\n\nLight’s Judgment is Jade’s Railjack Kinesis ability. \n\n**Ability 2: Symphony of Mercy**\n\nCycle through three songs that strengthen allies. Extend the duration of each song by killing enemies surrounded by Judgments.\n\n  * **Power Of The Seven:** Increases Ability Strength \n  * **Deathbringer** : Increases Weapon Damage\n  * **Spirit Of Resilience:** Increases Shield Regeneration and decreases Shield Regen Delay \n\n\n\n**Ability 3: Ophanim Eyes**\n\nJade summons an accusatory gaze that slows nearby enemies and dissolves their Shields and Armor. When the gaze falls upon allies, they can be revived from a distance.\n\nOphanim Eyes is Jade’s subsumable Helminth ability. \n\n**Ability 4: Glory on High**\n\nSoar with destructive power. Use alternate-fire to detonate Judgments, causing an explosion of Jade Light. Enemies inside the Light’s Judgment radius empower the explosion. \n\n**Jade’s Glory on High Exalted Weapon: Glory**\n\nUnleash the power of the Jade Light. \n\n**Maximum Loadout Slot Increase:**\n\nWith the release of Jade, the maximum number of purchasable Loadout Slots has been increased from 25 to 26. \n\n**Jade’s Prex Card**\n\nExpand your Prex Card collection with a new addition! Jade’s Prex Card can be found in a special location in the new Ascension Game Mode’s tileset.   \n\n\nShare your [Feedback](https://forums.warframe.com/forum/1974-ascension-game-mode-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1979-jade-new-weapons-bugs/) on the Jade in the dedicated Feedback Subforum. \n\n**NEW WEAPONS**\n\nJade brings with her a full Arsenal of weapons that evoke feelings of hope, a counterpart to that which evokes an absence of light. \n\n[fbdf592487c4990a6816491023319a27.jpg](https://www-static.warframe.com/uploads/fbdf592487c4990a6816491023319a27.jpg)\n\n**New Bow: Evensong**\n\nCounter the dread of battle with a song of praise. Enemies cannot hurt your allies while wounded by Evensong’s arrows. Kills with Evensong empower ally weapons with Multishot. \n\n**Unique Trait - Evensong Devotion**\n\nDamage dealt by Evensong's arrows applies 7 stacks of Puncture Status, which reduces the target's damage output by 100% and increases their Critical Chance of damage taken by 35%. Kills with Evensong activate Evensong Devotion, a buff that increases Multishot by 35% for allies.\n\n  \n\n\n**How to Acquire Evensong:**\n\nAcquire the Evensong Blueprint from the new Ascension game mode, or obtain the Blueprint in exchange for Vestigial Motes from Ordis in the Larunda Relay on Mercury. It can also be purchased fully built via the in-game Market for Platinum.\n\n[9e662544cb85481b5cf1a5faa7cdab28.jpg](https://www-static.warframe.com/uploads/9e662544cb85481b5cf1a5faa7cdab28.jpg)\n\n**New Thrown Secondary: Cantare**\n\nIn moments of despair, let the battle resonate with song. Cantare’s blades lodge into the battlefield and return upon reload. When returning blades strike enemies, Cantare empowers allies with increased Reload Speed. \n\n**Unique Trait - Cantare Chorale**\n\nCantare's blades have a 300% Critical Chance when they return upon reload. Strike enemies with returning blades to activate Cantare Chorale, a buff that increases Reload Speed by 20% for allies.\n\n**How to Acquire Cantare:**\n\nAcquire the Cantare Blueprint from the new Ascension game mode, or obtain the Blueprint in exchange for Vestigial Motes from Ordis in the Larunda Relay on Mercury. It can also be purchased fully built via the in-game Market for Platinum.\n\n[4dd96a10fc711f7daa6b2c5c6d0027d7.jpg](https://www-static.warframe.com/uploads/4dd96a10fc711f7daa6b2c5c6d0027d7.jpg)\n\n**New Scythe Melee: Harmony**\n\nHarmony triumphs over hate. Heavy Attacks condense Status Effect damage into a single instance. Heavy Attack kills empower allies with increased Status Duration. \n\n**Unique Trait - Harmonic Resonance**\n\nHeavy Attacks condense all Status Effects that deal damage over time into a single instance. Heavy Attack kills activate Harmonic Resonance, a buff that increases Status Duration by 30% for allies.\n\n**How to Acquire Harmony:**\n\nAcquire the Harmony Blueprint from the new Ascension game mode, or obtain the Blueprint in exchange for Vestigial Motes from Ordis in the Larunda Relay on Mercury. It can also be purchased fully built via the in-game Market for Platinum.\n\n**Jade’s Ensemble Buff**\n\nWhen all three weapons are used together they have a unique buff! Evensong, Cantare, and Harmony sing together. Their buff effects are doubled.\n\nShare your [Feedback](https://forums.warframe.com/forum/1974-ascension-game-mode-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1979-jade-new-weapons-bugs/) on the new Weapons in the dedicated Feedback Subforum. \n\n[b1d7659a31e0763af00b60401b156412.jpg](https://www-static.warframe.com/uploads/b1d7659a31e0763af00b60401b156412.jpg)\n\n**NEW GAME MODE: ASCENSION**\n\nThe Stalker’s stronghold is under intensive assault from marauding Corpus forces, but what they’re after must remain safe. You’ll need to initiate an emergency evacuation before embarking on a grueling ascent through enemy-infested elevator shafts to the Extraction waiting for you above.\n\nVisit the new **Brutus node on Uranus** after completing the Jade Shadows Quest to assist Ordis in gathering Vestigial Motes! This new non-endless mission unfurls in three stages:\n\n**Stage 1 - Mote Collection**\n\nThe Corpus have set up **Mote Collectors** to extract energy from the air - Ordis has taken them over, so you must defend them while they complete extraction!\n\n**Stage 2 - Ascension**\n\nOnce you have extracted the Motes, they must be transported in their **Extraction Capsule** top-side! To do so, power the elevator using **Ionic Capsules** dotted throughout the map, or dropped from enemies. As you approach them, they’ll be marked with a small green waypoint! Keep your eyes peeled for extra-glowy **Boosted Ionic Capsules** that offer an additional power and speed boost. Once picked up, use the Alternative Fire to throw them at the Extraction Capsule to power your ascent!\n\n  \nPlayers can keep up with the ever-rising gameplay with increased jump height (thanks to a special Air Support deployed by Ordis), and via jump pads littered on various platforms. Should you take an unfortunate fall to the bottom of the map, use the jump pad at the bottom of the elevator to catch up to its height. \n\n**Bonus Objective:**\n\nAlong with the Ionic Capsules, players may come across **Sister Beacons** hidden throughout the map, identified by the soft pinging noise they emanate upon approach. Collect three of these to summon a Sister of Parvos, who will spawn once you reach the top of the Elevator shaft. Defeating the Sister will reward you with 5-7 Vestigial Motes and a chance at a new Arcane, listed below (8-10 Motes and a guaranteed Arcane on Steel Path). Sisters of Parvos will also drop Steel Essence in Steel Path Ascension missions.\n\n**Stage 3 - Extraction**\n\nOnce you’ve made it to the top, escort the Extraction Capsule safely to extraction and defend it from Corpus foes along the way! Should enemies manage to deplete the health of the Extraction Capsule, its progress will stop briefly and the health will regenerate, at which point it will continue on its path once more. \n\n**Rewards**\n\nSuccessfully completing an Ascension mission will award players with 11-13 Vestigial Motes (16-18 on Steel Path), as well as a reward from the mission drop table, including:\n\n  * Jade’s Component Blueprints\n  * Endo\n  * Relics\n  * Harmony Blueprint\n  * Cantare Blueprint\n  * Evensong Blueprint \n\n\n\nFor a full overview of the Ascension Drop Tables, please review our[ Drop Tables site](https://www.warframe.com/droptables). \n\n**Releasing Vestigial Motes**\n\nVisit Ordis in the Larunda Relay on Mercury during Operation: Belly of the Beast to exchange Vestigial Motes for various wares, including: \n\n  * Jade Main and Component Blueprints\n  * Harmony Blueprint\n  * Cantare Blueprint\n  * Evensong Blueprint\n  * New Arcanes (read on below to learn more!) \n\n\n\nOnce Operation: Belly of the Beast ends, Ordis will relocate to the Drifter Camp and offer his wares there. He finally got a job, yipee!\n\n**New Arcanes**\n\nEnhance your Arsenal with these new Arcanes! Acquire these new enhancements from Sisters of Parvos spawned in the new Ascension game mode, or exchange them for Vestigial Motes via Ordis in the Larunda Relay.\n\nStats below are shown at max rank. \n\n**Arcane Ice Storm (Warframe)**\n\nOn Enemy Frozen: Gain +2% Ability Strength and +2% Ability Duration for 15s. Stacks up to 20x.\n\n**Arcane Battery (Warframe)**\n\nGains 0.30 maximum Energy per Armor point, up to 1000 Energy. \n\n**Secondary Surge (Secondary)**\n\nOn Ability Cast: Next shot gains a Damage Multiplier for every 200 current Energy, up to x8. \n\n**Secondary Fortifier (Secondary)**\n\nGain 1 Overguard for every 100 Damage dealt to an enemy’s Overguard. Deals x8 Extra Damage to Overguard.\n\n**Melee Afflictions (Melee)**\n\nEnemies affected by Status Effects gain 6 additional stacks when they're knocked down or flung by melee attacks.\n\n  \n\n\n**New Semi-Auto Fire Mods**\n\nThese new Mods can be equipped on Semi-Auto Fire weapons only, and prevent their firing speed from being modified once equipped. \n\nTarget Juno Sapper Moa enemies in Ascension missions to earn these Mods!\n\nYou can identify which weapons are eligible via the Arsenal if their Trigger type is “SEMI”. \n\n**Semi-Rifle Cannonade**\n\n+240% Damage  \n+1.5 Punch Through\n\n**Semi-Pistol Cannonade**\n\n+300% Damage  \n+1.5 Punch Through\n\n**Shotgun Cannonade**\n\n+240% Damage  \n+1.5 Punch Through\n\n**New Status Damage Mods**\n\nThis mechanic was originally introduced with Dante, and we have dedicated a whole series of Dual-Stat Mods to it! Increasing your Status Damage stat increases the damage per tick for Statuses that do damage over time (specifically Slash, Heat, Electricity, Toxin, Blast, and Gas). \n\nEarn these Mods from new Juno Sapper Moa enemies found in Ascension missions!\n\n**Rifle Elementalist**\n\n+90% Status Damage\n\n+0.6 Punch Through\n\n**Melee Elementalist**\n\n+90% Status Damage\n\n+60% Heavy Attack Wind Up Speed \n\n**Pistol Elementalist**\n\n+90% Status Damage\n\n+60% Reload Speed\n\n**Shotgun Elementalist**\n\n+90% Status Damage  \n+60% Magazine Capacity\n\nShare your [Feedback](https://forums.warframe.com/forum/1974-ascension-game-mode-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1981-ascension-game-mode-bugs/) on the new Ascension game mode in the dedicated linked Feedback \n\nSubforums. \n\n[7d345af2728b287a9a3e05514132c58c.jpg](https://www-static.warframe.com/uploads/7d345af2728b287a9a3e05514132c58c.jpg)\n\n**NEW EXIMUS UNIT: JADE LIGHT EXIMUS**\n\nIntroducing a new Eximus Type: Jade Light Eximus.\n\n  \nPlayers will find them in all missions where Eximus spawn, where they will face the threat of Jade Light on the battlefield.\n\nThese new foes will target up to 2 players, and will summon a beam of Jade Light that follows them and deals increasing damage the longer you are in contact with it. Players can either avoid the Jade Light until it dissipates (~8 seconds) or attempt to destroy the beam by shooting at the top of it — or kill the Eximus unit itself, of course. Once a Jade Light is summoned, the Eximus' Ability will go on a short cooldown before another can be cast.\n\n[b4d5e5e6f0e8a4d87fea68e95e7e7844_1600x90](https://www-static.warframe.com/uploads/thumbnails/b4d5e5e6f0e8a4d87fea68e95e7e7844_1600x900.png)\n\n**OPERATION: BELLY OF THE BEAST**\n\nJUNE 18TH @ 11:30 AM ET - JULY 18TH @ 11:30 AM ET\n\nParvos Granum is attempting to harvest Volatile Motes to make his own Jade Light Eximus army, and only you and Ordis stand in his way. With Ordis’ help, you can commandeer the Mote Collectors and put an end to Parvos’ plans. \n\nVenture to a secretive location (discovered in the Jade Shadows Quest) at **Brutus on Uranus** to preserve Jade’s legacy! Fight against the Corpus to earn new and returning rewards from previous Operations.\n\n**What You Need To Know**\n\nOperation: Belly of the Beast requires you to step into this shrouded location - only those who have completed the **Jade Shadows Quest** are permitted to do so. \n\nAfter finishing the Jade Shadows Quest, players will have access to a new node on Uranus: Brutus. Here they can access the new Ascension game mode and access Operation-specific missions. Successfully foiling Parvos’ efforts will reward you with special Volatile Motes, which can be exchanged for Operation rewards.\n\n**What You Need To Do**\n\nWhile Operation: Belly of the Beast is live, players will have access to special nodes that allow them to take on Parvo’s forces. In these missions, all Eximus units you face will be empowered by Jade Light - meaning the only Eximus units that will spawn are Jade Light Eximus. You can help Ordis in his mission to stop Parvos in one of three ways:\n\n  * Operation Variant of Brutus (Uranus)\n  * Operation Alerts\n  * Stalker Joins the Fray\n\n\n\n**Operation Variant of Brutus (Uranus)**\n\nIn traditional Operation style, the new Brutus node on Uranus has its own Operation variant. Play Ascension as you know it, but with all Eximus units spawning in as Jade Light Eximus. On top of the regular Ascension rewards, each Operation mission will award players with 4-6 **Volatile Motes** (8-10 on Steel Path), which can be traded for rewards via Ordis in the Larunda Relay.\n\nSummoning a Sister of Parvos will also earn players an extra 1-3 Volatile Motes (2-4 on Steel Path), as well as her usual drops.\n\n  \n\n\n**Operation Alerts**\n\nIn addition to the Brutus node on Uranus, timed Operation Alerts will appear across the solar system that will also reward players with 10 Volatile Motes (15 on Steel Path). These non-Ascension missions will have normal gameplay, but will feature increased Eximus Spawns, and will only feature Jade Light type Eximus. Look for these time-limited Alerts appearing every half hour or so as an alternative method to earning Volatile Motes. \n\n**Stalker Joins the Fray**\n\nVisiting Ordis in the Larunda Relay not only allows you to earn Operation Rewards, but also lets you call on an old foe to assist in your efforts. In speaking to Ordis, selecting the “A Shared Purpose?” option will allow you to join another Squad’s mission as Stalker. Doing so will reward you with the usual mission rewards, but at risk of losing them all should you be downed.\n\n**Rewards**\n\nNo Operation is complete without rewards, and Ordis has collected quite a few offerings for you to choose from. Ordis can be found in the Larunda Relay in the Navigation Room, where he will trade Volatile Motes for rewards.\n\n**Community Progress**\n\nBelly of the Beast comes with a Community Progress segment, tracking the total Volatile Motes collected by players. As the total number of Volatile Motes collected ticks up, progress is made towards a new variant of the Jade Light Ephemera, unlocking it for purchase for all players at Ordis in the Larunda Relay.\n\n**Commit Volatile Motes**\n\nOrdis is carrying a vast array of items in exchange for Volatile Motes:\n\n  * Low Guardian Chest Plate\n  * Belly of the Beast Sigil\n  * Aspirus Ephemera (Once overall Operation progress has reached 33%)\n  * Aspirus Emergent Ephemera (Once overall Operation progress has reached 66%)\n  * Aspirus Apex Ephemera (Once overall Operation progress has reached 90%)\n  * Krios Signa\n  * Prominence Wisp Totem\n  * Fluctus Rahk Skin\n  * Ceti Lacera Blueprint\n  * Basmu Blueprint\n  * Stance Forma Blueprint\n  * The Ballroom Simulacrum\n  * Arcanes:\n    * Arcane Tempo\n    * Arcane Consequence\n    * Arcane Momentum\n    * Arcane Ice\n    * Arcane Nullifier\n    * Arcane Warmth\n    * Arcane Resistance\n    * Arcane Healing\n    * Arcane Deflection\n    * Arcane Victory\n    * Arcane Strike\n    * Arcane Awakening\n    * Arcane Guardian\n    * Arcane Phantasm\n    * Arcane Eruption\n    * Arcane Agility\n    * Arcane Acceleration\n    * Arcane Trickery\n    * Arcane Velocity\n    * Arcane Precision\n    * Arcane Pulse\n    * Arcane Ultimatum\n    * Arcane Aegis\n    * Arcane Arachne\n    * Arcane Rage\n    * Arcane Fury\n    * Arcane Avenger\n\n\n\n**Clan Contributions**\n\nOrdis is also carrying additional stock for Tenno who are in a Clan:\n\n  * Enlightened Hate Skin\n  * Gilded Clan Sigil\n  * Glyphed Clan Sigil\n  * Phased Clan Sigil\n  * Belly of the Beast Emblem\n  * Arcanes:\n    * Arcane Energize\n    * Arcane Grace\n    * Arcane Barrier\n\n\n\nAll Arcanes purchased from the “Commit Volatile Motes” and “Clan Contributions” stores will be limited to 42 (2 max rank Arcanes) per Arcane per player to prevent Operation burnout. \n\n**Clan Trophies**\n\nVolatile Motes collected by Clan members throughout the Operation will earn your Clan Trophies! \n\nLike previous Operations, Clan Trophies are available in Terracotta, Bronze, Silver, and Gold. The amount of Volatile Motes required to unlock each tier are as follows:\n\nClan Tier  |  Terracotta  |  Bronze  |  Silver  |  Gold   \n---|---|---|---|---  \nGhost  |  15  |  30  |  45  |  60   \nShadow  |  45  |  90  |  135  |  180   \nStorm  |  150  |  300  |  450  |  600   \nMountain  |  450  |  900  |  1350  |  1800   \nMoon  |  1500  |  3000  |  4500  |  6000   \n  \nPlayers can view their Clan’s progress in the “Event” tab in Navigation.\n\nShare your [Feedback](https://forums.warframe.com/forum/1987-operation-belly-of-the-beast-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1988-operation-belly-of-the-beast-bugs/) on Operation: Belly Of The Beast in the dedicated Feedback Subforum. \n\n**NEW WARFRAME AUGMENT MODS**\n\nNew Augment Mods for Dagath, Protea, Sevagoth and Qorvex are available to acquire from the Syndicates! \n\nStats below are all shown at max rank. \n\n[3b82a0375e8b4cc989cc5841a2654d5f.jpg](https://www-static.warframe.com/uploads/3b82a0375e8b4cc989cc5841a2654d5f.jpg)\n\n**Dagath Grave Spirit Augment: Spectral Spirit**\n\nImmediately assume Grave Spirit’s Spectral Form. 100% chance for weapons and abilities to apply Doom. Kills outside of Spectral Form decrease its cooldown by 1s.\n\nAvailable in the Red Veil and The Perrin Sequence’s Offerings. \n\n  \n\n\n**Protea Blaze Artillery Augment: Temporal Artillery**\n\nWhen Temporal Anchor is activated, one existing Artillery unit will attach to Protea, halting its duration countdown. Max combo count is 20x.\n\nAvailable in the Arbiters Of Hexis and The Perrin Sequence’s Offerings. \n\n  \n\n\n**Sevagoth Sow Augment: Dark Propagation**\n\nEnemies killed while inflicted with Sow spread its effect in a 15m radius. Shadow's Death Harvest also inflicts Sow.\n\nAvailable in the Cephalon Suda and The Perrin Sequence’s Offerings. \n\n**Sevagoth’s Sow Change:**\n\n  * Sow can now be recast! \n    * Previously, Sow could not be recast if at least one enemy was affected by it. This has long been a feedback point from players requesting we allow it to be recast regardless of this and with the introduction of the new Augment Mod which will also benefit from this, it is now Sow! (heh). \n\n\n\n  \n\n\n**Qorvex Containment Wall Augment: Wrecking Wall**\n\nStrip 50% of armor and shields from struck enemies. Hitting 5 or more enemies will restart the duration of any Chyrinka Pillars and empower them.\n\nAvailable in the Cephalon Suda and Steel Meridian’s Offerings. \n\nShare your [Feedback](https://forums.warframe.com/forum/1973-new-warframe-augments-feedback/) & [Bug Reports](https://forums.warframe.com/forum/1980-new-warframe-augments-bugs/) on the new Augment Mods in the dedicated Feedback Subforum. \n\n**TENNOGEN SHADOWS**\n\nA brand new batch of creations from talented community artists arrive with Jade Shadows! TennoGen Shadows includes original takes on Equinox and Lavos, as well as Armor and Operator Accessories to expand your Arsenal. \n\n[68860e68e92a7462cce244a0aa2189e4.jpg](https://www-static.warframe.com/uploads/68860e68e92a7462cce244a0aa2189e4.jpg)\n\n**Equinox Omni Helmet**\n\nA helmet for the Equinox Warframe, designed by Rekkou.\n\n[6a76d9dd856191631e665bdef7ae3330.jpg](https://www-static.warframe.com/uploads/6a76d9dd856191631e665bdef7ae3330.jpg)\n\n**Lavos Yersin Skin**\n\nA unique skin for the Lavos Warframe, designed by Lubox.\n\n[161496c6764315bc311b79f13687a728.jpg](https://www-static.warframe.com/uploads/161496c6764315bc311b79f13687a728.jpg)\n\n**Corachrix Shoulder Armor**\n\nA unique shoulder armor for your Warframe, designed by LostEpoch & DasterCreations.\n\n[2cca1fd5c0fc281cbcbe57c4bb331ade.jpg](https://www-static.warframe.com/uploads/2cca1fd5c0fc281cbcbe57c4bb331ade.jpg)\n\n**Spicularis Oculus**\n\nA unique Oculus, designed by VentralHound.\n\n**Spicularis Mandible Mask**\n\nA unique Mask, designed by VentralHound.\n\n[76d22dfbf0c09f0a304fc6fcbbeaf440.jpg](https://www-static.warframe.com/uploads/76d22dfbf0c09f0a304fc6fcbbeaf440.jpg)\n\n**Kuva Pump Chest Plate**\n\nA unique chest armor for your Warframe, designed by CERF. The Kuva Pump Chest Armor is available only on the PC version of Warframe. \n\n  \n\n\n**NEW IN-GAME MARKET ADDITIONS**\n\n**In-game Market Change:** When viewing a bundle for Platinum that has a similar, real world currency Pack, the related pack will now appear in that bundle’s Market screen under the header “There is a similar bundle available” (and vice versa for the real money currency pack). Players can view the similar bundle’s contents and price on-hover, or select it to go to its Market screen.\n\n  * For example, the Dante Collection screen now has an option to preview/view the Dante Chronicles Pack and vice versa. This also applies to the new Jade Market bundles.   \n[dc49c12a22c76b750b4d0462d099e16c.jpg](https://www-static.warframe.com/uploads/dc49c12a22c76b750b4d0462d099e16c.jpg)  \n[254c15d19c78ca0d9e0899965da73109.jpg](https://www-static.warframe.com/uploads/254c15d19c78ca0d9e0899965da73109.jpg)\n  * The purpose of this change is to increase visibility of the purchase options that are available to players.\n\n\n\n**Jade Collection**\n\nLife and death meet in Jade. Her collection includes (all of the items listed can also be purchased individually): \n\n**Jade Warframe**\n\nBecome enraptured by the song of devastation. Through her, the Jade Light can be a source of destruction or a source of support.\n\n[51ac313c18dc1573e0d84537c8fe4305.jpg](https://www-static.warframe.com/uploads/51ac313c18dc1573e0d84537c8fe4305.jpg)\n\n**Jade Aureolt Helmet**\n\nAffirm Jade’s sacred nature.\n\nAs with all newly released Alt Helmets, its Blueprint will eventually be added to the Nightwave Cred Store in the future. \n\n[62c4ca234f021511d53a43cd2d75bd2a.jpg](https://www-static.warframe.com/uploads/62c4ca234f021511d53a43cd2d75bd2a.jpg)\n\n**Motetique Signa**\n\nMuch as music enriches the atmosphere, the Motetique Signa enhances your appearance.\n\n**Evensong Bow Primary**\n\nCounter the dread of battle with a song of praise. Fully drawn arrows fired by Evensong impale enemies and empower ally weapons with Multishot.\n\n**Cantare Thrown Secondary**\n\nIn moments of despair, let the battle resonate with song. Canatare’s blades lodge into the battlefield and return upon reload. When returning blades strike many enemies, Cantare empowers allies with increased Magazine Capacity.\n\n**Harmony Scythe Melee**\n\nHarmony triumphs over hate. Its Heavy Attacks instantly kill enemies that are open to Mercy kills. Defeat hordes in this manner to empower allies with extended Melee Range.\n\n**Jade Ophanim Decoration**\n\nBe not afraid with Jade’s gaze in your Orbiter. \n\n  * **Gift Bonus:** Gift the Jade Collection to another player and receive the Jade Ophanim Decoration as a Gifting Bonus in return. \n\n\n\n  \n\n\n[08827c7833b8623739bc65306e26f9ef.jpg](https://www-static.warframe.com/uploads/08827c7833b8623739bc65306e26f9ef.jpg)\n\n**Jade Chorus Pack**\n\nPierce through suffocating darkness by adding the radiant songstress Warframe, Jade, along with her signature Customizations to your Arsenal! \n\n**Note: As mentioned above, this real-world currency pack is the real world currency “sister” pack to the Jade Collection and is available to view from that collection’s preview screen.**\n\n**This pack features everything in the Jade Collection, the following items AND 275 Platinum** (also available for individual purchase in the in-game Market with the exception of those marked with *): \n\n[ac6163a3e1a35852c25eb72615d885c5.jpg](https://www-static.warframe.com/uploads/ac6163a3e1a35852c25eb72615d885c5.jpg)\n\n**Terror Landing Craft Skin**\n\nTransform your Landing Craft into a perfect match for Stalker’s. \n\n**Light & Shadow Color Palette**\n\nInvoke the play of light and dark with this selection of colors. \n\n**Jade Ophanim Sigil**\n\nA sigil depicting Jade’s Ophanim gaze. \n\nJade In Action Glyph* (exclusive to the Jade Chorus Pack) \n\nA glyph for your profile. \n\n**Jade’s Ensemble**\n\nArm yourself with Jade’s entire signature weapon collection. Includes the Evensong Bow, Cantare Secondary and Harmony Scythe. \n\n  \n\n\n[540293f90ab40623cd1bd5175f3d80dc.jpg](https://www-static.warframe.com/uploads/540293f90ab40623cd1bd5175f3d80dc.jpg)\n\n**Yareli Pandea Skin Bundle**\n\nStrike forth from the watery depths with the power of Yareli Pandea. Her collection includes (all of the items listed can also be purchased individually): \n\n**Yareli & Merulina Pandea Skin **\n\nWith the fall of the Orokin, Yareli Pandea drifted into the ocean’s depths where Hunhow rediscovered her. Now, she ascends to fight once more. Call upon Yareli Pandea’s faithful companion with the**** Merulina Pandea Skin (included with the purchase of the Yareli Pandea Skin and Collection). \n\n**Nidoblast Kompressa Skin**\n\nCapture your prey with Yareli Pandea’s signature Kompressa skin.\n\n**Rubra Sugatra**\n\nGive your weapons a deep sea flourish with Yareli Pandea’s signature sugatra.\n\n**Merulina Pandea Domestik Drone**\n\nFight dirt and grime with this aquatic Domestik Drone inspired by Merulina Pandea.\n\n  * **Gift Bonus:** Gift the Yareli Pandea Skin Bundle to another player and receive the Merulina Pandea Domestik Drone as a Gifting Bonus in return. \n\n\n\n**Yareli Fixes:**\n\n  * Fixed falling off a platform in the Mastery Rank 13 test while riding Merulina resulting in broken physics for Yareli. \n  * Fixed Companions not gaining Affinity from player kills while riding Merulina or K-Drive. \n  * Fixed being unable to use Transference after switching to Operator while riding Merulina and dying as Operator. \n  * Fixed icons for available K-Drive races in an Open Landscape not appearing in the detailed map when riding Merulina. \n  * Fixed being able to still use the Operator Void Beam attack after completing The New War Quest while riding Merulina and a strange dead Excalibur spawning at the same time without a head. \n  * Fixed kills while on Merulina not counting towards Sanctuary Onslaught Efficiency. \n\n\n\n  \n\n\n[9ef874e5bdcdad53ea70eb1e0a22f603.jpg](https://www-static.warframe.com/uploads/9ef874e5bdcdad53ea70eb1e0a22f603.jpg)\n\n**RESISTANCES AND STATUS REWORK**\n\nAs discussed over the last two months, across both Devstreams 179 and 180, we’ve overhauled Warframe’s Health Types and Resistances alongside a select few Status Effects! \n\n**To help players revisit their builds following these changes, an inbox containing 3x Forma will be sent to all players today (June 18th) at 12pm ET today.**\n\n**New Health Types**\n\nPreviously, enemy resistances and vulnerabilities were split between 13 Health Types: \n\nGrineer  |  Cloned Flesh  |  Ferrite Armor  |  Alloy Armor  |  Machinery  | - | -  \n---|---|---|---|---|---|---  \nCorpus  |  Flesh  |  Shields  |  Proto-Shield  |  Robotic  |  Ferrite Armor  |  Alloy Armor   \nInfested  |  Infested  |  Infested Flesh  |  Fossilized  |  Infested Sinew  |  Ferrite Armor  | -  \nSentient  |  Flesh  |  Robotic  |  Ferrite Armor  |  Alloy Armor  |  Shields  | -  \nMurmur  |  Indifferent Facade  |  Ferrite Armor  |  Infested  |  Machinery  | - | -  \n  \nEach of these Health Types had unique interactions with the various Status Types: \n\nPhysical  |  Impact: Stagger  |  Puncture: Reduced Damage Output/+Crit Chance  |  Slash: Bleed  | - | - | -  \n---|---|---|---|---|---|---  \nIndividual Status  |  Cold: Slow/+Crit Damage  |  Electricity: Tesla Chain  |  Heat: Burn  |  Toxic: Poison  | - | -  \nCombined Status  |  Blast (Heat + Cold): Inaccuracy  |  Corrosive (Toxic + Electricity): Corrosion  |  Gas (Heat + Toxic): Gas Cloud  |  Magnetic (Cold + Electricity): Shield Disruption  |  Radiation (Heat + Electricity): Friendly Fire  |  Viral (Cold + Toxic): Amplified Health Damage   \n  \nOptimizing builds to make use of this system required players to memorize health types per enemy (not just per Faction) and their resistances/vulnerabilities. Our goal is to reduce the friction necessary to engage in optimal play, so we’ve:\n\na) Simplified the number of Health Types\n\nb) Redesigned how Faction Resistances work \n\nc) Increased the visibility of the new vulnerabilities in normal gameplay flow \n\nInstead of having 13 Health Types, we have simplified them into 4:  \n\n\n  * Health\n  * Armor\n  * Shields\n  * Overguard\n\n\n\nNow, these Health Types only serve to differentiate between Status Effects and Abilities that affect them, such as Magnetic hindering Shields, Corrosive stripping Armor, or Viral amplifying Health damage.\n\nWe’ve changed the system so that Resistances and Vulnerabilities are **no longer tied to the previous Health Types**. Resistances and Vulnerabilities are now based upon the Faction a player is engaging with. \n\n**Star Chart “Suggested Damage”**\n\nVulnerabilities are now listed in The Star Chart mission nodes! Here, we aim to recommend the appropriate per-Faction Resistances, which will then universally affect that specific group.\n\n**The Star Chart** now shows Faction Resistances per node. Aligned with the present Faction, **Vulnerabilities and Resistances** will be listed to communicate the “Suggested Damage” options best used against any specific Faction or location.\n\n[66f1be34ab89ea74fe28f2b721efe055.jpg](https://www-static.warframe.com/uploads/66f1be34ab89ea74fe28f2b721efe055.jpg)\n\nSub-Factions will also have different Vulnerabilities and Resistances from their primary counterpart. The three main Sub-Factions are:\n\n  * Kuva Grineer\n  * Corpus Amalgam\n  * Deimos Infested\n\n\n\nViewing Faction Vulnerabilities and Resistances now also depends on where the player is within Warframe’s Story. The Factions (and Sub-Factions) will be unlocked via:\n\nFactions:\n\n  * Grineer: Unlocked by **default.**\n  * Corpus: Unlocked by **default.**\n  * Infested: Unlocked by **default.**\n  * Orokin: Unlocked after **Phobos Junction.**\n  * Sentient: Unlocked after **The Second Dream Quest** completion.\n  * Narmer: Unlocked after **The New War Quest** completion.\n  * Zariman: Unlocked after **Angels of the Zariman Quest** completion.\n  * Murmur: Unlocked after **Whispers in the Walls** **Quest** completion.\n\n\n\nSub-Factions:\n\n  * Kuva Grineer: Unlocked after **The War Within Ques** t completion.\n  * Corpus Amalgam: Unlocked after **Jupiter Junction.**\n  * Deimos Infested: Unlocked after **Heart of Deimos Quest** completion.\n\n\n\n**Simplified Faction Resistances**\n\nWith the removal of Resistances/Vulnerabilities being tied to Health Type, they will now be Faction-specific.\n\nDefault Faction Vulnerabilities and Resistances:\n\n  * Grineer: Vulnerable to **Impact** and **Corrosive**\n  * Corpus: Vulnerable to **Puncture** and **Magnetic**\n  * Infested: Vulnerable to **Slash** and **Heat**\n\n\n\nFactions by Quest Vulnerabilities and Resistances:\n\n  * Orokin: \n    * Vulnerable to **Puncture** and **Viral**\n    * Resistant**** to**Radiation**\n  * Sentient: \n    * Vulnerable to **Cold** and **Radiation**\n    * Resistant**** to**Corrosive**\n  * Narmer:****\n    * Vulnerable to **Slash** and **Toxin**\n    * Resistant**** to**Magnetic**.\n  * Zariman: Vulnerable to **Void**\n  * The Murmur: \n    * Vulnerable to **Electric** and **Radiation**\n    * Resistant to**Viral**\n      * Rogue Necramechs also fall under these Vulnerabilities and Resistances.\n\n\n\nSub-Faction Vulnerabilities and Resistances:\n\n  * Kuva Grineer: \n    * Vulnerable to **Impact** and **Corrosive**\n    * Resistant**** to**Heat**\n  * Corpus Amalgam:****\n    * Vulnerable to **Electric** and **Magnetic**\n    * Resistant**** to**Blast**\n  * Deimos Infested:****\n    * Vulnerable to **Blast** and**Gas**\n    * Resistant**** to**Viral**\n\n\n\nWith these Resistance and Vulnerability changes, we’ve made a notable decision to make **Impact** deadlier towards the **Grineer** , while making **Puncture** deadlier towards the **Corpus**. This is a departure from the previous system, however, we believe that these two Statuses are more suited for these specific Factions.",
        "num_comments": 163,
        "comments": [
            "only took 10 years to be able to duplicate our mod loadouts lol",
            "The new Semi-Auto mods that add punch through are game changing, especially for secondaries and shotguns. Modding punch through was extremely hard for those weapons due to a lack of options, and now they have a great one that combines with your damage.\n\nFor Primaries, it may still be worth taking Shred since it combined your fire rate mod and your punch through mod already, but many weapons still didn't want or need that fire rate.",
            "I'd like to take a moment to thank the sponsor of today's update, Jade: Shadows Legend",
            "Patiently waiting for kengineer to do the armor math for me on if I want 2 green shards or if I can do 1 tau green",
            "Aren't the new Status damage mods kinda huge for some builds? I don't remember seeing those in devstreams lmao",
            "Dagath augment in a syndicate I actually have let’s gooooooooo ima have some fun",
            "Jade Chorus pack in the patch notes says it is supposed to have everything in the Jade collection, but doesn't include the weapons\n\nEdit: Ok I bit the bullet to test, it doesn't include the weapons and it locks you out of buying the Jade Collection with plat because it's marked as \"owned\". Seems like an oversight I guess, will raise a ticket.",
            "I’m a little saddened by status effects on enemies no longer matching your energy color, but everything. Else seems great!",
            "WE’RE GOING BACK TO THE EMO ORIGINS WITH THIS ONE‼️‼️🗣️🔥🔥 🖤🖤",
            "As an Exergis enthusiast this new Shotgun Elementalist mod has me kinda stimulated.\n\nFriendship with Ammo Stock ended."
        ]
    },
    "Baro Ki'teer inventory and recommendations 2024-06-28": {
        "title": "Baro Ki'teer inventory and recommendations 2024-06-28",
        "score": 363,
        "url": "https://www.reddit.com/r/Warframe/comments/1dqjau1/baro_kiteer_inventory_and_recommendations_20240628/",
        "content": "Tennocon is approaching! Baro is going to bring his entire collection to the special relay! If you got a ticket but don't know what to buy, check out [my complete guide here.](https://docs.google.com/spreadsheets/d/1l9vY8iVBGg7W5j7Capeh6Cr3BOp4fVD3NRJ3X6fW3xI/edit?usp=sharing)\n\nNew item of the week: Primed Dual Rounds: A really good mod... for Archguns.\n\nSorry for the lack of embedded images... the newReddit interface just hates me. Here's a link instead.\n\n[IMGUR LINK](https://imgur.com/a/4jHzQgm)\n\nRecommendations in the comments.",
        "num_comments": 108,
        "comments": [
            "After half a year, primed dual rounds is finally here. Nice.\n\nHopefully Primed Deadly Efficiency is next.",
            "Sorry, no directly embedded images today - Reddit decided to crap out on me again. The IMGUR link should still contain all the usual stuff.",
            "Dual round mod hoarders in shambles, someone should post the graph from Warframe.market\n\nEdit: already 35p->14p lmao",
            "Me, two hours ago scrolling here: where's my Baro guy with reviews?!?",
            "Primed reach AND Primed Firestorm!?!?\n\nDon’t mind if I do",
            "Is primed reach that essential?",
            "holy fuck almost half a year after i sold my dual rounds to prep, he finally brings primed dual rounds",
            "Man this is the first time I think baro has too many things I want to get",
            "I've been waiting for primed firestorm for a while now",
            "Woooo Prisma Lenz is finally back."
        ]
    },
    "Jade and Dagath kinda look like sisters": {
        "title": "Jade and Dagath kinda look like sisters",
        "score": 2040,
        "url": "https://i.redd.it/sg70v0tl6e9d1.jpeg",
        "content": "",
        "num_comments": 92,
        "comments": [
            "Goth girl with her Christian sister",
            "Ah yes, Dade and Jagath",
            "I had someone say in the Design Council chat that Dagath looks like Jade in the afterlife. Honestly messed with my mind for like 2 hours.",
            "I knew I wasn’t the only one who thought they looked similar. \n\nI can’t wait for the day they both get deluxe skins but I wonder how they’ll handle Jade’s >!baby!<.",
            "Jade looks like shes flippin the bird lol",
            "The single sister that loves slutty halloween and the devoted sister that made a family.",
            "Ngl for a split second i thought it was 2 jades",
            "I spent a shameful amount of time wondering how did you managed to unpregnant Jade.",
            "That unicorn horn. Lore wise they both “work” for Orokin before they become Warframe.",
            "Thought so too, they look very simmilar, like, incredibly simmilar"
        ]
    },
    "Thank God for the new Warframe part pity purchase options... ": {
        "title": "Thank God for the new Warframe part pity purchase options... ",
        "score": 644,
        "url": "https://i.redd.it/i8ckh16jtf9d1.png",
        "content": "...Because this is bullshit.",
        "num_comments": 115,
        "comments": [
            "Dude I gave up and bought him when I got a 50% off coupon lol.",
            "ehm nidus ehm octavia ehm harrow",
            "The same can be said about nidus",
            "Good thing i got him form the game awards Twitch drop",
            "Ah yes. Who remembers Ivara farming?",
            " Protea was like this for me. But instead of getting multiples of one or two of her parts I literally got 8 of everything else that was on her drop tables before I got the ONE part. It was agony and I would never wish that on my worst enemy",
            "I had to do 100 plus nerid runs for ivara optics. The day I got her, ivara prime was announced",
            "Ya know I have no idea how Sevagoth got into my inventory",
            "I got lucky with a lot of frames but for some reason NEKROS took me forever to get. I nearly had his Chassis blueprint go into triple digits...",
            "Perchance, proclaim part pity purchase priorities presently."
        ]
    },
    "Proto Mirage Warframe 1999.": {
        "title": "Proto Mirage Warframe 1999.",
        "score": 1306,
        "url": "https://i.redd.it/10ys2l1tbe9d1.jpeg",
        "content": "Making her was a lot of fun, I really love the way she turned out ✨✨. Who should I do next?",
        "num_comments": 53,
        "comments": [
            "Really captures the energy of the only 'frame crazy enough to laugh at Ballas's face during the transformation process. Well done!",
            "She's crazy and I love it",
            "I could take 5 of her at once.",
            "Kill Bill Uma Thurman vibes",
            "It captured the essence of a manic agent of chaos very well, it's the exact image I have in mind about Mirage",
            "If Harley Quinn was a Warframe .",
            "As a Mirage main am in love 😍",
            "She's so god damn cool\n\nBut you laughed",
            "I can’t fix her but she could make me worse, and that’s even better.",
            "If mirage is anything less than this Aeon Flux level of erotic French insanity I'll be disappointed."
        ]
    }
}