{
    "Weekly General Q&A and Discussion Thread: 26 Jun, 2024 - 03 Jul, 2024": {
        "title": "Weekly General Q&A and Discussion Thread: 26 Jun, 2024 - 03 Jul, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/Warhammer40k/comments/1dp6j71/weekly_general_qa_and_discussion_thread_26_jun/",
        "content": "## Welcome to the /r/Warhammer40k Q&A and Discussion Thread.\n\nThis sticky thread is for any general questions and discussion you may have about the Warhammer 40k hobby. Want to know the best paints to use? Unsure how a rule works? Need suggestions for the best glue to use? Post your question here! Just want to have a chat about something 40k related. This is also the place! Of course, if you see a question you know the answer to, please don't hesitate to pop an answer in a comment.\n\n## New to Warhammer 40k?\n\n[View the /r/Warhammer40k Beginners Guide HERE](https://www.reddit.com/r/Warhammer40k/wiki/beginners)\n\n## Useful Resources:\n\nFree core rules for 40k are available [HERE](https://www.warhammer-community.com/wp-content/uploads/2023/06/dLZIlatQJ3qOkGP7.pdf)\n\nSee a list of all current 40k rules [HERE](https://www.reddit.com/r/Warhammer40k/wiki/currentrules)\n\nView a list of retailers that have discounts on GW products [HERE](https://www.reddit.com/r/Warhammer40k/wiki/retailers)\n\nFind your nearest GW Stockist [HERE](https://www.games-workshop.com/en-GB/store/storefinder.jsp).\n\n## Current Important Topics:\n\n[10th Edition Megathread and Q&A](https://www.reddit.com/r/Warhammer40k/comments/11z8zjc/10th_edition_megathread_and_qa_post/)\n\n## When do pre-orders and new releases go live?\n\nGW announce pre-orders on Sundays at 6pm in the UK. Pre-orders and new releases go live on Saturdays at the following times:\n\n* 10am GMT for UK\n* 11am CEST for Europe and Rest of the World\n* 10am PST/1pm EST for US and Canada\n* 10am AWST for Australia\n* 10am NZDT for New Zealand\n* 10am JST for Japan",
        "num_comments": 50,
        "comments": [
            "What do you guys hope to see in the Death Guard battleforce when (if) it drops later this year?",
            "I've just got my first job since I've graduated college a year ago. I've went to the GW store once a month for the free mini for the past year, and I want to finally get a set to celebrate once I get my first paycheck. I'm looking at the different options, but I'm not sure as to what I want to get because I was/am too poor to think about it until now lol\n\nWhat are you guy's suggestions for a good celebration set?",
            "Question about being combat. If my unit is in melee combat and I remove units after being shot at from the front line so I’m no longer in engagement range. Does that unit then start the turn no longer locked in combat and can move and shoot, freely?",
            "I'm thinking I should start taking notes during my games so I can \"review the tapes\", so to speak. However there is a TON of information being generated each turn. What are the things I should absolutely be tracking?",
            "What do you guys do with your old brushes?\n\nI've got about 50 spent brushes and while some can be repurposed for drybrushing I don't know what to do with the rest and I'm loathed to just throw them out.",
            "Just bought a pack of Vanguard Veteran Squad w/ Jump Packs this past weekend. Given that they are not the \"pop in/pop out\" kind of mini, and the fact that I don't want to glue them together, I'm thinking of magnetizing them. Any suggestions on tutorial videos for that & where to find the right magnets needed?",
            "Did GW ever update Combat Patrol rules?",
            "Can someone tell me where the Indomitus Lieutenant is in battlescribe? I don't see an option for his Volkite pistol or shield.\n\nThank you",
            "I'm getting ready to start my 40k journey but I'm a little confused on what rules are okay to buy. I want to play sisters and a friend of mine gifted me their \"pile of shame\". I'm planning to put together a 500/1000 point list. Is there somewhere that I can find the detachment rules? Or do I need to buy the new codex? Or what rules do I need to get? \n\nI heard there was a lot of stuff changed recently and I don't want to buy something that is already out of date or going to be out of date before my first game with friends. I don't know how these things work.",
            "Hey so I have a previous version custodes combat patrol box, would it still be as balanced? Did they just change things up for fun, or would it no longer be viable if some friends and I were thinking of just getting a combat patrol each? Never played only painted.\n\nAlso I’ve been veering away from custodes as I’ve fallen for the whole imperial agents thing, is there any form of combat patrol with them as the flavour? Love me some inquisition 👍"
        ]
    },
    "Hey kids, wanna see a dead body?": {
        "title": "Hey kids, wanna see a dead body?",
        "score": 264,
        "url": "https://www.reddit.com/gallery/1dr4stx",
        "content": "The new and shiny Chaos Lord painted for my slowly growing Night Lords army. Quite proud of the fella.",
        "num_comments": 29,
        "comments": [
            "Hey nightlord wanna see a dad who loves me? Yeah me to but idk where to find one",
            "The stitching on the cape is marvelous. Well done.",
            "Love ~~evil batman~~  night lords. Love this",
            "How’d you do the resin like that?",
            "Instructions unclear, I was the dead body",
            "Splendid! The first example of the new Lord I've come upon in the wild so far! Nice to get a good look at it beyond the studio examples, conversions included!",
            "ADD WARPSTONE CORE-CENTER TO THE HAMMER-WEAPON",
            "How long it took ?",
            "Yaaaaaaaay death. skin the enemies into submission",
            "i take my enemy blood with my cereal,  They’re GREAT!"
        ]
    },
    "Saw this really cool conversion on display at my local store.": {
        "title": "Saw this really cool conversion on display at my local store.",
        "score": 114,
        "url": "https://i.redd.it/zn7iieetkh9d1.png",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Hello fellow astartes",
            "Looks dope"
        ]
    },
    "I like the loss of money ": {
        "title": "I like the loss of money ",
        "score": 181,
        "url": "https://www.reddit.com/r/Warhammer40k/comments/1dr5eug/i_like_the_loss_of_money/",
        "content": "I was out with a friend and she told me that all her hobbies are basically  (to some extent) get rich schemes.\n\nSo I thought about the Hobby we all share and about the piles of shame, we have lying around. I tried selling some of it a short time ago and I lost so much money. But the loss of money in the Hobby is a nice part. I mean I buy a box and Boom, I lost 25% of the gw value, as soon as the return is expired. Then I rip it open and now I lost 2 or 3 more Euros. Then I build them and Boom they are 20% less worth. After that prime them and lose another 5%. Then Paint and Base them and they're basically worthless now and I love it. I got hours of fun and there is not a chance in the world for me to make any money with it. ",
        "num_comments": 55,
        "comments": [
            "A hobby is, by most definitions, done for pleasure. Sure, it's great if you can make money off your hobbies, but that should *never* be the main focus of them. If it's the main focus of an endeavor, then it's a job.\n\nI accept the loss of money towards plastic crack because Warhammer brings me pleasure. I have made exactly 20$ out of it, and spent many times that. Most people in this hobby won't make a cent off it. But here we all are, because it brings us pleasure!",
            "Get rich schemes?\n\nWhats her hobby, opening \"weiss/schwarz\" boxes? XD",
            "A hobby should be fun. Hustle culture is poison built on lies. All those side hustles to earn one hundred grand are bollocks",
            "I treat hobby’s as an expense and not an investment. It helps with my enjoyment to keep a balance of both",
            "Get rich as a Hobby sounds like some Crypto Bros stuff. Never thought of profiting off a hobby. In the end it would become work, and take the fun out of it",
            "That's the hustle culture BS of \"hobbies should make you money\". Hustle culture is one of the most toxic aspects of capitalism. It tells you that everything you do should be generating money. F that.",
            "Monetised Hobbies aren't hobbies, they are jobs. I already have one job that sucks enough of my life out of me...",
            "This is the first hobby where I didn’t try to “master it” and try to make money off it. I’m building a rhino/razorback. (My first vehicle) I just spent the last 4 hours painting the space marine manning the heavy bolter. Loved it.",
            "The need to monetise everything in life, down to what are meant to be the things you do to relax, is an annoying trend in the last few years. It's a stupid counter argument to stagnant wages, just turn your hobbies into money making schemes!\n\nOr just have something you enjoy regardless, we all probably don't want to admit how much we have spent of warhammer, or other game systems, but it makes us happy so who cares.",
            "Someone should tell ebay sellers that painting models devalues them... \"professionally painted\""
        ]
    },
    "Test model for my Genestealer Cults army. What do you think of him?": {
        "title": "Test model for my Genestealer Cults army. What do you think of him?",
        "score": 83,
        "url": "https://www.reddit.com/gallery/1dr7jr9",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Amazing. Better job then I could do and subtly not human enough to trigger my uncanny valley good job",
            "Looks good! Much better than my bare plastic 😋 I did however put some red on my Magos.",
            "looks great if i had to say anything i'd say add more emphasis to the blue lights , maybe even a different colour so they standout more. or just more white/lighter blue so they pop.",
            "He looks good, and a nice looking base too!",
            "Amusingly this is my scheme reversed.",
            "What a amazing loyal imperial servant of the 4 armed emperor☺️",
            "Thanks for your sweet comment :)",
            "Thanks for your sweet comment :) that’s my intention with the army haha",
            "Thanks :) \nYeah that was annoy me the most on him :/ in your opinion, what’s a good idea of couleur to nuance the most ?",
            "Hard to say without seeing it, but something that contrasts well with the green and orange, maybe even a lime green? if you wanted something a bit different I actually think pink/light purple would work quite well.\n\ndon't get me wrong though the blue looks great and it's not like you need to change it if you like it."
        ]
    }
}