{
    "Gretchin's Questions - Weekly Beginner Questions Thread": {
        "title": "Gretchin's Questions - Weekly Beginner Questions Thread",
        "score": 17,
        "url": "https://www.reddit.com/r/Warhammer/comments/1b66dwg/gretchins_questions_weekly_beginner_questions/",
        "content": "&#x200B;\n\nhttps://preview.redd.it/qz1syruwgd961.png?width=960&format=png&auto=webp&s=c2c0e07623ecfb35161f9e617be222f7ce155d61\n\nHello Hammerit! Welcome to Gretchin's Questions, our weekly Q&A post to  field any and all questions about the Warhammer hobby. Feel free to ask burning questions about Warhammer hobby, lore, gaming and more! If you see something you know the answer to, don't be afraid  to drop some knowledge!",
        "num_comments": 328,
        "comments": [
            "Where should I start if I'm looking to get into the lore of the Warhammer universe? I know very little, but I'd like to learn more",
            "Why is the warhammer site so damn awful? \n\nIt's worse in every way when trying to search for and look at models...",
            "Howdy Reddit, I have a question about paints. I've seen many tutorials on YouTube by now and they seem to recommend things like Citadel, AK, Vallejo etc. I've been doing scale military models for years and absolutely LOVE Ammo by Mig. How does it do on miniatures? My daughter and I are about to dive head first into Warhammer, and I've never used citadel paints...",
            "Not sure if this would be the place to ask. My spouse is getting into war hammer and also collecting the novels - I wanted to get some of the books as a gift for him for Fathers Day. This universe is MASSIVE! I do not know where or what to look for. He has False Gods Horus Rising and galaxy in flames",
            "I have a question regarding some of my models I have purchased some tactical squad space marines, primaris hell blasters, a Terminator squad, and a venerable dreadnought. I was originally planning on painting and making an ultramarine but after learning some more I switched my focus to space wolves and I'm wondering which of these models I can use in a space wolf army. Any help is appreciated",
            "Does Sigmar have a box vs box mode like 40k has with Combat Patrol? I dont want to start a full army or anything for sigmar, but I've really fallen in love with the Seraphon and would pick up a box of them for that",
            "Do you guys know if they plan on doing something like \"Warhammer Age of Sigmar: Stormbringer\" for 40K?  Also any clue of it coming to US?",
            "I noticed that Automoderator has just been leaving this thread pinned as opposed to starting a new one each week. I'm not quite sure why it's doing that, but in the meantime I set the suggested comment sorting to \"new.\"",
            "Its my boyfriends birthday next week and he has mentioned a magnifying lamp for painting. Are there any the community recommended? Thank you in advance!",
            "Got a cupboard full of boxed GW games from the 90s.  \nIf I wanted a clear out, is there a market for this stuff or just into the bin?  \nEditions and condition unknown, but includes Warhammer Fantasy Battle, Blood Bowl, Man O'War, Advanced HeroQuest, Space Marine and various boxes I don't remember but I think were expansions."
        ]
    },
    "Everyone posting the new Skaven sculpts - let’s show the oldies some love!": {
        "title": "Everyone posting the new Skaven sculpts - let’s show the oldies some love!",
        "score": 97,
        "url": "https://i.redd.it/2bxnfb1gkh9d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "These guys are my favorite sculpt of clanrats",
            "Im running him as a clan Eshin sorcerer in my Mordheim warband "
        ]
    },
    "UK skaventide": {
        "title": "UK skaventide",
        "score": 63,
        "url": "https://i.redd.it/adzvnmrx7h9d1.jpeg",
        "content": "Queue is 45 mins but element games has stock of the box and for a discount! ",
        "num_comments": 43,
        "comments": [
            "That price makes me a bit jealous. But can't complain, grapped mine at a local store at a lower price then I was expecting.",
            "Good luck. Any time I've pre-ordered from Element, they've *always* oversold. And instead of cancelling orders they were never going to fulfil, they just left me waiting expecting a restock for months.",
            "Nice! I live round the corner from a gw and went in to preorder like a mug but thats a great discount. They had the minis in store and they look so good!",
            "Cost me the equivalent of 180 where I am, but I am happy with it regardless.",
            "Everywhere still seems to have a good amount of stock unlike for Leviathan.\n\nReally hoping I can snag a bargain in a few months and get the skaven side, sadly I don't know anyone who wants any stormcast minis",
            "Yeah, I grabbed mine pretty quickly. Its nice when a discount reminds you of a time before inflation.",
            "Part of me wants the books (for rules, spearhead etc) but then the other, large part of me, looks at the models and terrain and just thinks...nope. I'm glad, very, very glad, as the last thing I wanted was to add to my pile of shame. Decent box though, so good luck and have fun to everyone buying!!",
            "i cant talk about pounds, but its about 210 euro from gw, and 150 euro from element games",
            "If you guys are in canada wondering if we got good deals : darkcrystalcards sell it for 270 instead of 320 !",
            "This is the price I actually expected the thing to be in local stores here in Sweden, not 150 gbp local."
        ]
    },
    "My finished Rabble Rowza ": {
        "title": "My finished Rabble Rowza ",
        "score": 72,
        "url": "https://i.redd.it/76iq709bsg9d1.jpeg",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "\"Frank Horrigan - American Secret Service.\"": {
        "title": "\"Frank Horrigan - American Secret Service.\"",
        "score": 21,
        "url": "https://i.redd.it/5t1jt7wepi9d1.png",
        "content": "\"Your rides over mutie, time to die.\"",
        "num_comments": 0,
        "comments": []
    }
}