{
    "Weekly General Q&A and Discussion Thread: 19 Jun, 2024 - 26 Jun, 2024": {
        "title": "Weekly General Q&A and Discussion Thread: 19 Jun, 2024 - 26 Jun, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/Warhammer40k/comments/1djr2js/weekly_general_qa_and_discussion_thread_19_jun/",
        "content": "## Welcome to the /r/Warhammer40k Q&A and Discussion Thread.\n\nThis sticky thread is for any general questions and discussion you may have about the Warhammer 40k hobby. Want to know the best paints to use? Unsure how a rule works? Need suggestions for the best glue to use? Post your question here! Just want to have a chat about something 40k related. This is also the place! Of course, if you see a question you know the answer to, please don't hesitate to pop an answer in a comment.\n\n## New to Warhammer 40k?\n\n[View the /r/Warhammer40k Beginners Guide HERE](https://www.reddit.com/r/Warhammer40k/wiki/beginners)\n\n## Useful Resources:\n\nFree core rules for 40k are available [HERE](https://www.warhammer-community.com/wp-content/uploads/2023/06/dLZIlatQJ3qOkGP7.pdf)\n\nSee a list of all current 40k rules [HERE](https://www.reddit.com/r/Warhammer40k/wiki/currentrules)\n\nView a list of retailers that have discounts on GW products [HERE](https://www.reddit.com/r/Warhammer40k/wiki/retailers)\n\nFind your nearest GW Stockist [HERE](https://www.games-workshop.com/en-GB/store/storefinder.jsp).\n\n## Current Important Topics:\n\n[10th Edition Megathread and Q&A](https://www.reddit.com/r/Warhammer40k/comments/11z8zjc/10th_edition_megathread_and_qa_post/)\n\n## When do pre-orders and new releases go live?\n\nGW announce pre-orders on Sundays at 6pm in the UK. Pre-orders and new releases go live on Saturdays at the following times:\n\n* 10am GMT for UK\n* 11am CEST for Europe and Rest of the World\n* 10am PST/1pm EST for US and Canada\n* 10am AWST for Australia\n* 10am NZDT for New Zealand\n* 10am JST for Japan",
        "num_comments": 43,
        "comments": [
            "Does anyone have some good examples of the Sororitas Exorcist vehicle redressed for Chaos? It would look so good for Word Bearers and the old Chaos Rhino is shows quite a lot of age in comparison.",
            "I am building a chaos space marines incursion list. Right now I have a Chaos Lord with a mark of Slaanesh leading a 5 man Chosen with a mark of Khorn.\n\nIf I use the Torpefying Refrain stratagem on this unit. Does only the chaos lord get the \"If youer unit is a slaanesh unit, until the end of turn, your unit is eligible to shoot and declare a charge in a turn in which it Advanced or fell back\" bonus?\n\nI would obviously like if having two different marks on a single unit, thanks to having a leader, got me benefits they otherwise couldn't get, but I also understand how that may not be the rules are written.",
            "When I'm rerolling dice (specifically with Oath of Movement or Command Reroll), do I have to reroll all the dice that failed, all the dice in general or only 1 die?",
            "Does the Core rule Change also applys for Combat Patrol?\n\nFor example the New rule that you can use reinforcement Stratagems only once per Game would be a huge Nerf on the Astra Militarum Combat Patrol that very much rely on this Stratagems.",
            "Question about a 9th edition rule, \n\nDo named characters always have their specified warlord traits, regardless of whether they are a warlord or not?  \n\nI'm confused because most sources say that they need to be nominated for warlord first, except for this one definition here. \n\nhttps://preview.redd.it/0wsoflmfet7d1.png?width=742&format=png&auto=webp&s=e38d8bf6246991adaaf69f17406cd266a5556b7e",
            "I'm done my first pass at narrowing down which two factions to start WH40K with, and would appreciate your input to help me narrow it down. Obviously I don't yet own any codices for specific unit info, and only have 10th Ed indices to look through.\n\n* Experienced tabletop gamer / playtester who's new to wargames\n* Johnny+Spike. Will definitely attend local Strikeforce tournaments. I'd see the game as a challenge vs myself more than anything else.\n\nWhat I enjoy and am looking for in descending order of importance:\n\n1. Adaptability\n2. Certainty and consistency in achieving results of \"at least x\", at the expense of power if need be\n   * Flat bonuses\n   * Re-Rolls\n   * Not relying on crits\n   * Crit fail impact reduction\n   * Faction's fave strategems are those that are used on my turns, as opposed to defensively\n   * My high mobility gives me more options to make the right decision\n3. Increasing opponent uncertainty by non-strategem means\n   * Flat negative modifiers\n   * High mobility / deepstrike encourages the opponent to make contingencies\n4. I don't want to retire my minis anytime soon, and I have no idea which minis are new vs due to be made into 'Legends'.\n\nGiven those criteria, the rest of the focus would be on points and winning. That is to say I'd rather the above criteria be met and lose games due to my decisions and bad meta than regularly win through a 50% coin toss.\n\nI like pretty much all the lore. If I have 'gotcha' abilities, I always remind opponents about them. I can have fun with hordes, or just a few units. I care more about depth than complexity, if that makes any sense.",
            "Last year when they made making army lists free on the gw app I made like 6 lists and I’m still able to view and edit them if I sign into my gw app with my account now will it delete those armies? Also if I pay for premium make a bunch of armies then when I cancel the membership do I keep all the army lists I made?",
            "So outside of asking a TO to overule it, is it still correct that non-codex Chapter unique marine units (e.g crusade squad, proteus killteam) can't have an Apothecary/Lt+(Captain/Chapter master) as although they would normally both be allowed to attach, the unique units aren't in the \"above list\" called out in the ability of the Apoth/Lt?",
            "Question on a combo before I commit to it.\n\nWith the Repulsor update I believe 6 Eradicators and an attached Gravis Captain will fit in a 14 capacity Repulsor.\n\nCan the Vanguard Spearhead stratagem \"calculated feint\" allowing you to \"make a normal move up to d6 inches\" in the charge phase allow you to re-embark into the repulsor if charged and the repulsor isn't in engagement range?\n\nTo my understanding the only restriction would be that you can't disembark and embark in the same phase. Meaning disembarking during movement and re-embarking if charged should work.",
            "With the new indirect fire making 1 2 3 always miss can voice of command overwrite that and make them hit on threes?"
        ]
    },
    "Noticed something in the space marine 2 gameplay overview": {
        "title": "Noticed something in the space marine 2 gameplay overview",
        "score": 423,
        "url": "https://i.redd.it/r5nsr1e0u18d1.jpeg",
        "content": "So in the space marine 2 overview trailer I noticed in one of the frames in the top right there was a currency, what could this currency be? They said they wouldn’t add microtransactions so these are probably earnable right? I doubt they’d straight up lie so I wonder how it’s obtained and what it’s for.",
        "num_comments": 62,
        "comments": [
            "It could be EXP points used to unlock items.",
            "Achievements and unlocking skins I'd guess",
            "One of the trailers mentioned earning XP by playing missions to unlock the customization; seems to me that could just be the XP tracker and they just have a fun symbol for it.",
            "They said you would unlock trinkets and skins to customize your multi-player avatar, this is probably how you do that. Earn in game currency by winning games and completing objectives, and use currency to buy new armor and skins.",
            "343 said halo infinite was gonna have reach level customization with plenty of earnable armors, then dropped one of the most limiting customization systems yet and no longer even let you choose your Spartans colors.\n\nNever put much stock in what devs say lol.",
            "So Titus was Alpha Legion all along? That explains a lot",
            "Does anyone know how much customisation there is in the campaign? \n\nIt looks like there’s heaps in operations/pvp which is great.",
            "In the trailer they get that currency when finishing a mission, it’s essentially unlock tokens so you pick what you unlock instead of having to wait till a certain level to unlock something.\n\nImagine you really like a certain color or armor but you have to play 100 hours to get it. With this system, you can just get it right away",
            "I don't remember the exact wording the use, but they will have micro transactions but for cosmetic items only. It was something along the lines of not having an in-game shop, then the dlc would be free, and then their next statement was something about purchases would be for cosmetic items only.",
            "The new gameplay trailer explained it all."
        ]
    },
    "Ventrilokar": {
        "title": "Ventrilokar",
        "score": 187,
        "url": "https://www.reddit.com/gallery/1dlp4km",
        "content": "Ventrilokar stands as a terrifying testament to the ingenuity and cruelty of the Iron Warriors.\nClad in a menacing eyeless helm, Ventrilokar perceives the world through the eyes of a captive Rogue psyker, twisted into a grotesque puppet and mounted atop a pole. This tormented psyker, corrupted by the powers of the warp, serves as both his master's seer and weapon, revealing the deepest secrets of their enemies through a voice amplified by dark technology.\nVentrilokar's unique method of warfare strikes fear and despair into all who oppose him, as no secret is safe from his relentless pursuit of victory.\n\nhttps://www.instagram.com/p/C8gGYmmSvJY/?igsh=bDdheDc5bTF5dmNp\n\n",
        "num_comments": 10,
        "comments": [
            "ok now this is extremely sick, both model and story",
            "This is so awesome that I would love to star such an army!",
            "Stunning! Love what you did here. Marvellous idea! Very thematic and so damn well executed.",
            "Niiiice",
            "That Plague Marine is the basis for so many epic conversions 😅",
            "holy shit that's metal af!",
            "Not to bash OP, because absolutely stunning work, but to inspire you: that's clearly ChatGPT, so wholly within your reach to achieve as well! ",
            "Yeah they have such good poses, it’s a shame the new mk3 kit wasn’t the same design and scale as the plague marines just de-nurgled",
            "Why clearly GPT?\n\n>wholly within your reach to achieve as well\n\nI didn't think I couldn't, but thanks I guess.",
            "The third person used in the description does seem a bit like an llm, not that it really matters considering the model is what counts"
        ]
    },
    "Could Quar models work as Astra militarum?": {
        "title": "Could Quar models work as Astra militarum?",
        "score": 774,
        "url": "https://i.redd.it/6vohafib208d1.jpeg",
        "content": "I love these little guys, and I want to use them in 40k. IG was the most logical army to play them as, but if there are any problems, please tell me",
        "num_comments": 53,
        "comments": [
            "I have no idea what these are but fuck yeah! As long as the base sizes are good and your opponents are clearly informed of their role then his would be the silliest thing to play with.",
            "I actually have some I purchased recently! They're surprisingly small! Shorter than a standing guardsman! If you put some basing material to give them some height, itd be perfect!",
            "Only if you state you're Italian before each match",
            "Personally, I would have no problem playing against an army of these guys",
            "I saw these on ‘Eons of Battle’ this morning! I hope these little models get more exposure! I love quirky models.",
            "Is that earthworm jim?",
            "With heavy proxy use like this it really just comes down to if your specific opponent is cool with it. Tournament play is obviously out of the question but I would personally love to fight against these dudes.",
            "i just wanna say i love quar and they would make a unique regiment",
            "[Do you like Mouse Quest?](https://youtu.be/tvAj_yGW6BE?si=pYU_cDYINxI1adqq)",
            "Yes, because they are awesome"
        ]
    },
    "Ultrasonic cleaner timer malfunctioned, came back to this melted heap. Sad times 🥺": {
        "title": "Ultrasonic cleaner timer malfunctioned, came back to this melted heap. Sad times 🥺",
        "score": 71,
        "url": "https://i.redd.it/42fk5l3jq38d1.jpeg",
        "content": "RIP the following:\n\nJudiciar \nBladeguard ancient\nLibrarian in terminator armour\nPhobos captain\nPhobos Lieutenant \nLieutenant with Combi \nGravis Captain with heavy bolt rifle\nRedemptor plasma ",
        "num_comments": 27,
        "comments": [
            "dare I ask if it had a built in heater what did you set it to? Looks like it was straight up boiled in acetone rather than a gentle IPA bath.",
            "IDK about yours, but my ultrasonic cleaner came with a bright red label that says: DO NOT PUT FLAMABLE LIQUIDS IN",
            "Congrats. You now have a chaos spawn. Paint it.",
            "Gellar field failure. Perform appropriate rites, select volunteers for the next batch.",
            "Can I ask why you are putting them in an ultra sonic cleaner in the first place ?",
            "Legion of the Damned, great choice!",
            "You don't need to use a ultrasonic cleaning. IPA is strong enough.",
            "Paint it for terrain/scenery. Looks like the aftermath tbh kinda cool",
            "So if you're planning to use something flammable in an ultrasonic cleaner, put the minis and the flammable liquid in a zip lock bag and submerge in water in the ultrasonic cleaner filled with water. It is a LOT safer, cleaner and the vibrations still travel through the bag and work fine.",
            "Turn it into scenery….like a korne or tzeench pile of bodies…..could even add a chair and make it a weird choas type throne\n\n\nOr an admech sevitor colony base"
        ]
    }
}