{
    "[Shop] Shades On — It’s Time For The Sizzling Summer Sale!  - News - War Thunder": {
        "title": "[Shop] Shades On — It’s Time For The Sizzling Summer Sale!  - News - War Thunder",
        "score": 331,
        "url": "https://warthunder.com/en/news/8962-shop-shades-on-its-time-for-the-sizzling-summer-sale-en",
        "content": "",
        "num_comments": 538,
        "comments": [
            "The clickbait is on sale for the first time, get ready for the horde",
            "Thats actually an amazing sale too bad its not on console. Hopefully we get something that isnt the same 5 planes theyve put on sale the last few times.",
            "GE and Talismans won't be on sale I presume?",
            "good sale, but damn i wanted to get premium time since it runs out in a month...",
            "Never get a down tier in 9.3 again",
            "Naval so unloved it doesn't even take part in the sales any more :-)",
            "Guys stay away from Type 16 and XM-1, Leopard 1A1 L\\44 still good",
            "Ok, Ill buy Leopard 2A4 PzBtl 123 Since Tier VII is embarassing, no completely lineup",
            "35 (I guess the same stands true for $) for a vehicle that includes 2.5k GE and 20 days of premium, which cost respectively 16,5 and 7,5, is actually really good, means you actually pay 14 for the vehicle itself (I know, I'm not considering the discounts for larger packs of GE and premium time)",
            "Before anyone asks, do not waste your time or money with the JASDF F-4EJ ADSTW. Its great as a bomb/rocket truck, really poor as a dogfighter. Additionally, the tech tree F-4EJ (not the Kai, the EJ) is identical in every way except the premium status and the admittedly cool black livery."
        ]
    },
    "[Special] Celebrating British Armed Forces Day with a Decal! - News - War Thunder": {
        "title": "[Special] Celebrating British Armed Forces Day with a Decal! - News - War Thunder",
        "score": 28,
        "url": "https://warthunder.com/en/news/8965-special-celebrating-british-armed-forces-day-with-a-decal-en",
        "content": "",
        "num_comments": 5,
        "comments": [
            "That would be cool loading screen",
            "There are sooo many excellent artworks used for news/changelogs/etc which would be great as loading screens, I wish they'd add them.",
            "I also wish they'd give us the wallpapers as a download without the WT logo, it kinda ruins it.",
            "A nice decal. :)",
            "#Celebrating British Armed Forces Day with a Decal!\n\n> 28 June 2024 \n\nWallpaper - British Armed Forces [...] [3840x2160](https://static.warthunder.com/upload/image/0_Wallpaper_Renders/Other/3840x2160_british_armed_forces_logo_98ebc6aa96d1ac7392f13bfc12e6a84d.jpg)\n\nIn the UK, Armed Forces Day is celebrated on the last Saturday of June. This celebratory day was approved in 2006 as Veterans Day, and then renamed to also honor currently serving soldiers and officers. More than 185,000 people serve in the British Armed Forces, of which 111,000 are in the army, 36,000 in the air force and 38,000 in the navy.\n\n##Earn the Emblem of the UK Ministry of Defense decal!\n\n> When: Until July 1st (07:00 GMT).\n\n> Task: Play 3 battles using British vehicles at rank III or higher to receive the Emblem of the UK Ministry of Defense decal.\n\n[Emblem of the UK Ministry of Defense decal](https://staticfiles.warthunder.com/upload/image/0_2024/6_June/Britain/uk_mod_emblem_decal_86097b57646ab0f714509a8bddf09338.png)\n\n\n\n**Additional details:**\n\n*    You must use a minimum of rank III.\n*    Your activity must not be below 70%.\n*    You can complete the task in random battles, except for Enduring Confrontation missions, and [Assault] mode.\n*    Track your progress in the hangar by clicking Nickname  Achievements  Holidays  British Armed Forces Day..\n*    You can find the decal in the Britain  Tanks tab in the Customization menu."
        ]
    },
    "Petard Mortar (ignore my reflection)": {
        "title": "Petard Mortar (ignore my reflection)",
        "score": 214,
        "url": "https://i.redd.it/yaltbvm5qg9d1.jpeg",
        "content": "Found at the tank museum durning tankfest",
        "num_comments": 24,
        "comments": [
            "cant ignore that magnificent chad reflection",
            "Can angle tank armour perfectly to bounce shells capable of tearing you apart, can't angle a camera to avoid being in the reflection. I can respect that.",
            "The reflection is exposing you lol",
            "Honestly, just came here for the reflexion.",
            "Bro r u a chef?",
            "Didn't see the reflection till you pointed it out. Can't ignore it now",
            "What's the tank behind you? For the sprocket looks like a Panzer's but idk",
            "Unc got the Italian main uniform on.",
            "For real man, my wife is sitting right here.",
            "That case is the shiniest shit known to man"
        ]
    },
    "The Scout UAV test drive is a bit.. bugged?": {
        "title": "The Scout UAV test drive is a bit.. bugged?",
        "score": 122,
        "url": "https://v.redd.it/phtmqvujkh9d1",
        "content": "",
        "num_comments": 21,
        "comments": [
            "The drone is pulling 50gs XD",
            "50G overload and pilot didnt pass out",
            "How do u test fly the drone",
            "you got any more of them uh? pixels",
            "what of you use the test drive dev thing to bring it up to 10000m",
            "You can do a scout UAV test drive?",
            "I meant technically can't be bugged if it's not a feature",
            "Stalininium radio waves are fucking up the test drive so you do bad with it in combat",
            "Plastic covered drone with depleted uranium structure underneath, as god intended.",
            "Ah yes.\n\nUnmanned Aerial Vehicle indeed has a pilot in the cockpit."
        ]
    },
    "For those who have played them, what should I get next.": {
        "title": "For those who have played them, what should I get next.",
        "score": 148,
        "url": "https://i.redd.it/97f731uv7h9d1.png",
        "content": "",
        "num_comments": 113,
        "comments": [
            "The begleit is a lot of fun and the leopard a1a1 is also great just depends on what you want from the tank",
            "I will say the Begleitpanzer 57 although i don't recommend play 9.3 and 9.7 since it's just up tiers",
            "Begleitpanzer 57 is fun to play",
            "since when can you collapse ranks????",
            "German m48s arent so good. Kpz is really fast and armor is mid but the gun doesnt do any damage for some reason. Go for the begleitpanzer 57 or the leo a1a1/1a5",
            "Bagel is probably the most fun high tier tank in the entire game imo But preferably, you should have 9.0 stuff before you get it. Also I'm no sure if 9.3 is still an uptier hellhole.",
            "I will be getting the bagel then.",
            "9.3 plays with 10.3 like 90% of the time is there really isnt much difference. you'll get bad matchups every game",
            "Get Leopard A1A1 as a backup for TAM. Begleitpanzer 57 is very situational, requires good positionals and a blind/deaf sloth reflexes enemies to be effective and its main AP round has terrible velocity. And don't even think about taking M48A2 with DM23 higher than 8.3. APFSDS is good but it struggles with no stabilizer and poor mobility. KPz-70 has a nice 6-second reload with an autoloader and it is fast but its top round is miserable post-nerf when all you see at 9.3 is full uptiers to Leopards 2A4, Abrams M1s, T-80Bs, Objects 292 etc that don't need to aim to kill you while the best damage you might inflict is yellow crew member on a direct HEAD hit. Leopard 1A5 is good with DM33 and 1st gen thermals but again it barely faces anything below 10.3 and you are a glass cannon.   \n  \nMy advice would be to rush to 10.0-10.3 as soon as possible (TAM 2C, PUMA, Leopard 2A4, Flarakpanzer, maybe even Wiesel 1A2 together with them) becasue it's a blackhole that sucks in everything up to 1 BR away and you will mostly play against the vehicles of your own battle rating or lower with some rare 11.3, and difference between 10,3 and 11.3 is not that noticeable than between 9.3 and 10.3 that is hella compressed now. So, for now make yourself a lineup with a 8.3 Gepard (more effective as a rat corner-camping tank destroyer and not as pure SPAA), TAM, JaPz.K A2, Leopard A1A1, Alpha Jet and maybe even Huey with 6 AGM-22s and stick to it until you have enough vehicles of 10.0-10.3 purchased. Skip 9.3-9.7 entirely unless you don't care about your mental health.",
            "Personally I love the M48 Super. It has more horse power then the previous one and often seems bomb/AGM proof. A really good MBT if a slightly slow one at that."
        ]
    }
}