{
    "Warzone 2 is experiencing constant crashes and disconnects. When this post is removed the issue is fixed.": {
        "title": "Warzone 2 is experiencing constant crashes and disconnects. When this post is removed the issue is fixed.",
        "score": 1405,
        "url": "https://www.reddit.com/r/Warzone/comments/z0nm5l/warzone_2_is_experiencing_constant_crashes_and/",
        "content": "",
        "num_comments": 630,
        "comments": [
            "I am experiencing this too nothing like having like 7 kills then crashing with no ability to at least come back and spectate. Additionally the bomb drone is broken, my character always freezes when launching it. Such a shame, this game is a massive improvement from the original Warzone too bad its bug ridden",
            "The mods are alive!!!! Hip hip hurray ",
            "I can't even start the game. When I try to launch it, my PC just shuts off. No bluescreen or anything, it just reboots. Already tried a fresh Win11 installation, before I had Win10. New PC-hardware and newest drivers.",
            "They need to provide an update asap.",
            "been getting it here and here on xbox series x",
            "Nothing like crashing in DMZ while in a deep run and holding the weapons cache. \n\nWish I saw this sooner so I wouldnt have wasted my time.",
            "seems like every time i get brave enough to load my insured weapon, bam. crash. two hour wait",
            "I'm so lost. I just played a solo game, left due to death and now only quads are available; but at attempt to queue I get error cause: 10, error code: 2012. What the fuck.",
            "Such a bummer that a game with such potential like Warzone is constantly plagued by bugs and experiences that dont allow the users to fully enjoy the game",
            "Is anyone else having their whole PC crash with this, or just me? Never had PC crash issues aside from mid-game in Warzone"
        ]
    },
    "Middle finger to the lobby ": {
        "title": "Middle finger to the lobby ",
        "score": 43,
        "url": "https://v.redd.it/wo7fz7ndig9d1",
        "content": "",
        "num_comments": 14,
        "comments": [
            "You lost the second you bought that skin.",
            "How much did that cost?",
            "The pistol is not showing lol",
            "But here I am in the chopper ",
            "I don't remember since I had the points available",
            "Ohhhhh!!! lmao that should be an animation tho!!",
            "You only won because of your skin is a wild assumption about a match you didnt watch at all lol. Its a wild thing to say regardless tbh",
            "It was a bot lobby. Smh ",
            "You have no way of actually knowing, because you werent there. You understand that right?",
            "Thank you."
        ]
    },
    "Is every lobby insanely difficult now? ": {
        "title": "Is every lobby insanely difficult now? ",
        "score": 52,
        "url": "https://www.reddit.com/r/Warzone/comments/1dr3s19/is_every_lobby_insanely_difficult_now/",
        "content": "I’m not like an amazing warzone player by any means, but up until a couple weeks ago I’m good for like 5-8 kills per quads match. Recently the lobbies have been brutal, I’m getting 2 kills max. Even switched over to my other gamertag that I’ve never used for warzone so I’m a level 1. Still getting absolutely wrecked. Anyone else seeing this? ",
        "num_comments": 84,
        "comments": [
            "The last few days of resurgence Ill hop on and there are just teams sniping from buildings not moving at all so I only last a couple of games before I switch to something different. Getting chased around by iris in ranked isnt ideal either though. If you are below diamond Id recommend wz ranked, pretty easy lobbies up until diamond.",
            "Played 2 rounds of plunder and 2 rounds of battle Royale trios. Every single round I played, I was killed by crazy shooting shotguns.",
            "Weekend nights gotta bring out all these sweatys",
            "kids are out of School... they have no chill.",
            "Casual players, like me, have quite the game. They should make matchmaking take longer to match players up with corresponding k/d players",
            "Well...it IS summer break so there's that",
            "I used to be good at WZ in the Verdansk and Caldera days. Now I just get absolutely minced. Stopped playing a while back. Its a shame as the COD mechanics are amazing and just makes every other FPS feel sluggish but I literally cannot compete on COD now.",
            "I had back to back matches with the same blatant hacker.",
            "Theyre mostly stacking, not many are good. The good players plus stacking are unstoppable.",
            "Im getting the most kills on my team, team mates tend to steal kills and are usually noobs. Man wassam?"
        ]
    },
    "That was brutal 😱😅": {
        "title": "That was brutal 😱😅",
        "score": 83,
        "url": "https://i.redd.it/gm2xd2dfhe9d1.jpeg",
        "content": "",
        "num_comments": 22,
        "comments": [
            "Bro got a pedo tatted on him lmfao",
            "Why the fuck would you tattoo a dumbass streamer on yourself in the first place? I used to find his videos entertaining as well but really",
            "That won't be minor job...",
            "A good cover-up artist could make the reflection of a kid in his sunglasses",
            "Bros definitely been through worse.",
            "Bruh I thought for a sec the real Ninja tweeted the reply and I was shocked lmao",
            "All in all, thats an excellent tat. Even got the reflection of the monitors in his glasses.",
            "I am starting to think that He may not have even been a real Dr",
            "I hated this guy from the start. I never once faltered.",
            "I get people getting Sports players tattoos but YouTubers/Streamers? Nah."
        ]
    },
    "Nothing make sense ! ": {
        "title": "Nothing make sense ! ",
        "score": 16,
        "url": "https://v.redd.it/npdk1pgkyg9d1",
        "content": "",
        "num_comments": 23,
        "comments": [
            "Stuns dont work anymore my boy, smokes are the way to go.",
            "Skipping frames , inconsistent hit markers, super bullets. Everything and at once. Game even has an audacity to lie that I am on 50ms ping. Make it 250 ms and then I'll understand all the crap that is happening with this game.  How am I suppose to 1v1 this , when I have 0 chance at winning ??",
            "aim assists is better when stunned...",
            "aside from all the bullshit the game did in this situation, id say if you use your left stick to strafe left and right as you're shooting at him, you would've hit alot more of your shots and most likely won that fight as your roational aim assist would've kicked in. Whereas in the clip it looks like you used your right stick to do most of your aiming, resulting in the left to right over correction.",
            "Bro hit you with that ",
            "Cant believe people play a rigged game",
            "Im pretty sure he teleported because of grounded mantle.",
            "Aside from the obvious horrendous stuttering, the swarm outside of up close is absolutely horrid and gets outbeamed by basically any mw3 smg, let alone the meta smg rn on a stunned controller player that you didnt manage to break their AA at all. Aim a bit higher for the chest, he hit all chest.\nAlso, when using meta vs non-meta weapons it feels like the game allows the meta weapons user the opportunity to hit their shots, if they hit them youre dead, if not the meta weapon user is dead. Its really hard to explain but there is a weird window the game has where you should be dead but since you are using the meta weapon you survive.",
            "You miss 100% of the shots youmiss",
            "You missed your fucking bullets and AA goes burr during the nerfed stuns.  Been that way since WZ2 dropped."
        ]
    }
}