{
    "[Semi-Weekly Inquirer] Simple Questions and Recommendations Thread": {
        "title": "[Semi-Weekly Inquirer] Simple Questions and Recommendations Thread",
        "score": 2,
        "url": "https://www.reddit.com/r/Watches/comments/1dknr9f/semiweekly_inquirer_simple_questions_and/",
        "content": "This thread is a place for any recommendation requests or simple watch-related questions. Please feel free to post them here, rather than making a new thread, per our [posting rules](http://www.reddit.com/r/Watches/wiki/rules#wiki_if_asking_for_a_watch_recommendation.2C_either_for_yourself_or_as_a_gift.3A). Please keep in mind that all of our [community posting rules](http://www.reddit.com/r/Watches/wiki/community_rules) apply here as well.\n\n&#x200B;\n\nFor recommendation questions, you may want to read the [relevant section of our posting guidelines](http://www.reddit.com/r/Watches/wiki/rules#wiki_if_asking_for_a_watch_recommendation.2C_either_for_yourself_or_as_a_gift.3A) first, and check out our [Brand](http://www.reddit.com/r/Watches/wiki/brandguide/) and [Buying](http://www.reddit.com/r/Watches/wiki/buyingguide/) Guides as well. Remember, the more information you give us, including pictures or links to watches that interest you, the better we can help you find a watch that you really like!\n\n&#x200B;\n\nQuestions should be as thorough as possible to avoid confusion, and to help the respondents answer more concisely. Include links pertinent to your question and read through the above recommendation information that may be applicable. Feel free to ask your question on our [Discord Chat](https://discord.gg/DvgRkUG) for a possibly faster response.\n\n&#x200B;\n\n# For the latest questions, sort by 'New'.\n\n&#x200B;\n\n# A new Inquirer thread will be automatically posted on Mondays at 6am and Thursdays at 6pm, all times UTC-5. You can also view all [previous Inquirer Threads](https://www.reddit.com/r/Watches/search?q=Simple+Questions+Recommendations+%28author%3Aautomoderator%29&sort=new&restrict_sr=on&t=all).\n\n&#x200B;\n\n*Please note that Reddit does not like URL shorteners.  Please do not use them, as reddit will remove your comment if you do.  No one will see your comment if that happens*.",
        "num_comments": 51,
        "comments": [
            "Looking to buy my first \"nice\" watch. I normally wear an Apple Watch every day, but I'd like to get a nice automatic watch to wear for client visits (I work in tech and would wear with a blazer) and weddings (would wear with a suit). I tried watches on in a few different boutiques recently (Tudor, Tag, Breitling) and really liked the look and feel of the Tag Heuer Carrera Date in black/rose gold (WBN2113.BA0639). I especially liked the simplicity of the look with minimal complications. Could that watch serve my purpose? I don't have a specific budget in mind, but I'm seeing that model on Chrono24 and eBay for under $3k, which I'm comfortable with. Reading through the buying guides, I'm a bit overwhelmed with the amount of options. I'd also like to get a black leather strap for it but am not sure of the best place to do so.",
            "How idiotic will I look if I wear a smart watch on one wrist and a Rolex on the other?",
            "Looking for recommendations for my wife’s first real watch. She likes the bead of rice bracelets, likes a two tone or steel. Leaning towards the omega de ville or a ref 160 seamaster, Longines La Grande. \n\nAny other suggestions? Trying to keep around 1200, open towards quartz.",
            "I would like to find an automatic vintage pre-1969 Hamilton watch that would have been made in Lancaster, Pennsylvania to use as an heirloom piece. Where is the best place to look?",
            "I'm looking for my first nice watch, and landed on the YEMA Navygraf Marine Nationale GMT as one of my options. From what I've seen, Yema has had pretty bad QC from a year or 2 ago. Is this still the case? Would the Yema be worth the risk of bad quality?",
            "Can anyone recommend a company that makes quality straps?  My Omega AT has 16mm between lugs and the official Omega straps have only a few options.",
            "Hey all,\n\nJust curious, I want a hand-winding (not automatic) watch with a glass case back. My price range is up to $2000. Open to suggestions, preferably a field watch but really anything.\n\nThank you!",
            "Is Chrono24 legit?",
            "Can anyone recommend- \nLightweight watch with metal bracelet. An everyday wear watch. Automatic. Max size 40. Green (or steel blue) face with date.  Up to $1200 budget. ",
            "Ok, I worry this isn't going to go over well, but I have no choice. I recently saw a watch I loved on the subway, but I couldn't read the brand from where I was. I'm going to describe everything I can about the watch, and you tell me if you have ANY IDEA what it might be. \n\nIt was a round steel-colored case on a blue rubber-looking strap. The face was flat white, and the only Arabic numerals were 3, 6, 9, and 12, in a modern-looking font. Other than that the face was pretty plain - it didn't look like it had a lot going on, but there was definitely a spot of red that might have been part of the logo and might not. The second hand was red. Overall size I would guess 30-40MM.\n\nI know, it's not a lot to work with. But any ideas?"
        ]
    },
    "[Wrist Check] Official Wrist Check Thread for June 22, 2024": {
        "title": "[Wrist Check] Official Wrist Check Thread for June 22, 2024",
        "score": 2,
        "url": "https://www.reddit.com/r/Watches/comments/1dlnyvt/wrist_check_official_wrist_check_thread_for_june/",
        "content": "**Wrist Check** = **What are you wearing?**\n\n&#x200B;\n\nPost a photo of your watch of the day.\n\n&#x200B;\n\nPlease try to include the brand and model in your post!\n\nYou're also encouraged to write a few words about your watch. Some users might also appreciate knowing your wrist size, for a virtual fit check.\n\n&#x200B;\n\nIf you'd like some tips on improving the quality of your watch photos, check out these useful guides:\n\n&#x200B;\n\n* [GUIDE: Your Phone Camera & You](http://www.reddit.com/r/Watches/comments/36nn95/guide_your_phone_camera_you/) by /u/EnderBaggins\n* [Watch Photography Guide: Taking better watch photos, it can be done cheaply and easily!](http://www.reddit.com/r/Watches/comments/1fneu8/watch_photography_guide_taking_better_watch/) by /u/FrancisHC\n* [Timekeeping: How To Take Better Watch Photos](http://gearpatrol.com/2012/08/14/timekeeping-how-to-take-better-watch-photos/)\n* [Tips on watch photography](http://pippick.com/oddsods/phototips.htm)\n* [Photographing Watches](http://thirtyfivemill.com/photographing-watches/)\n* [http://forums.watchuseek.com/f109/tips-tricks-15719.html](http://forums.watchuseek.com/f109/tips-tricks-15719.html)\n* ([...and some inspiration from SJX](http://www.watchesbysjx.com/p/photo-essays.html))\n\n&#x200B;\n\nAs always, be respectful of others and follow the rest of our [rules](http://www.reddit.com/r/Watches/wiki/community_rules). All reasoned opinions are welcome, and remember: **criticism about a watch is not a criticism of the owner**. Just because someone hates your watch doesn't mean they hate you.\n\n&#x200B;\n\nHave fun!\n\n&#x200B;\n\n...and one quick note: these threads will be auto-posted each morning at 6am eastern. Any other WRUW posts/threads will be removed.",
        "num_comments": 0,
        "comments": []
    },
    "[Citizen] PRX killer? ": {
        "title": "[Citizen] PRX killer? ",
        "score": 68,
        "url": "https://www.reddit.com/gallery/1dlss6j",
        "content": "",
        "num_comments": 64,
        "comments": [
            "Don’t know and don’t care if it’s a PRX killer or not but I personally love mine. Paid £300 for it and it’s a great watch for that price.\n\nhttps://preview.redd.it/4tvi662t748d1.jpeg?width=3024&format=pjpg&auto=webp&s=33757a9eb7f6bb5816e073a238c336d175f64f0c",
            "In 38 or 36 of course",
            "Why don't y'all just buy the watches you think look nice",
            "I don’t think any watch is another’s “killer.” That’s just a YouTube buzzword to get views. Both are great in their own regard and appeal to different folks for different reasons.",
            "I enjoy the looks of it better, but some people think swiss watches are better than Japanese.",
            "40.5 mm?? This ain’t killing anything.",
            "The adjective \"testicular\" comes to mind looking at that skin-tone dial texture. I love Citizen watches, but that dial is not it.",
            "Damn",
            "Imo Japanese movements are better than Swiss ones, at least at this price level.",
            "Nice to see another integrated bracelet option. My issue has always been that the PRX has an essentially disposable movement. That sort of design goes against the spirt of \"heirloom\" watches in my opinion. That said it is a fine piece for the money and if you like it, wear what you like."
        ]
    },
    "[New Watch] Hermès H08 - The Future Classic": {
        "title": "[New Watch] Hermès H08 - The Future Classic",
        "score": 479,
        "url": "https://i.redd.it/gp1ak5k0mz7d1.jpeg",
        "content": "I randomly stumbled upon this 1/184 Boutique Edition H08 2 weeks ago and immediately fell in love. The squircle case shape, strikingly simple dial and unique typeface comes together so perfectly. To me it’s almost a modern take on a classic field watch.\n\nAfter digging into this more, I found out that it actually has an in-house movement that is manufactured by the famous Vaucher Manufacture Fleurier that makes movements for AP, Richard Mille, and many more. The H08 is MUCH more than just another fashion watch.\n\nHermès actually acquired a 25% stake in Vaucher years ago which absolutely sealed the deal for me and I had to pick up an H08. Hermès is in it for the long run and this is their first men’s sports watch which I believe will be a future classic.\n\nReally enjoying this piece! Let me know what you guys think!",
        "num_comments": 87,
        "comments": [
            "This looks great on paper...and looks even better on wrist. Really impressed how Hermes has made a proper watch with their own very distinctive design language. The seconds hand is fantastic.",
            "My guy said, squircle.",
            "I like these H08s a lot and I don’t know why. I don’t like square watches, I don’t like the seconds hand, I don’t like everything in the middle of the dial, I don’t like the date window. Put it all together and it’s pretty perfect. I want one, I want that chrono they have in the pipeline.",
            "Really does look nice, but not a fan of the date placement. Would almost prefer no date on it.",
            "Why is the date window cut and placed that way?",
            "I call it Berkin deposit",
            "Really nice and great movement, future classic is maybe aggressive",
            "There’s some watches that shouldn’t have a date window. Beautiful watch but can’t stand that date window.",
            "https://preview.redd.it/l6v1fmwff28d1.jpeg?width=600&format=pjpg&auto=webp&s=7c0f7601ed4ca4591214df420e410c0291a8e693",
            "In the pre-owned market, it is a lot of watch for the money. I just don't like the case style/shape. Really like the font/numerals/dial design."
        ]
    },
    "[Discussion] Which one do you think?": {
        "title": "[Discussion] Which one do you think?",
        "score": 19,
        "url": "https://www.reddit.com/gallery/1dltt0p",
        "content": "I’m getting married in August and I’m trying to pick my wedding watch. Now I’ve come down to the Baltic MR01 or the Hamilton Murph 38mm. So which one do you guys think looks better? I’m slightly leaning towards the Hamilton. I’ve been going back and forth between the two though. \n",
        "num_comments": 57,
        "comments": [
            "White has more pop of color on the outfit.",
            "I think the murph. Mainly because i think it will last the test of time and still be a cool watch to own in 10-20-30 years",
            "Baltic",
            "Hammy",
            "For the wedding, MR01. For everything else, the Murph.",
            "The Baltic is so much more interesting and I personally think it would dress up better. The Hamilton has solid, reliable field watch vibes. Do you want your wedding watch to feel special, or like an every-day watch? I say a special day calls for a special watch.",
            "Hamilton, it’s more timeless",
            "BALTIC!",
            "I think the Baltic looks better and is a more interesting watch. The Hamilton is solid but that model has just never excited me.\n\nEdit - the smaller size is also more flattering for your wrist imo.",
            "The Baltic and its not remotely close. Visually speaking, at least."
        ]
    }
}