{
    "/r/WeAreTheMusicMakers Weekly Feedback Thread": {
        "title": "/r/WeAreTheMusicMakers Weekly Feedback Thread",
        "score": 9,
        "url": "https://www.reddit.com/r/WeAreTheMusicMakers/comments/1dmkwdw/rwearethemusicmakers_weekly_feedback_thread/",
        "content": "Welcome to the /r/WeAreTheMusicMakers Weekly Feedback Thread! The comments below in this post is the only place on this subreddit to get feedback on your music, your artist name, your website layout, your music video, or anything else. (Posts seeking feedback outside of this thread will be deleted without warning and you will receive a temporary ban.)\n\n\nThis thread is active for one week after it's posted, at which point it will be automatically replaced.\n\n##Rules:\n\n***Post only one song.**- *Original comments linking to an album or multiple songs will be removed.*\n\n* **Write at least three constructive comments.** - *Give back to your fellow musicians!*\n\n* **No promotional posts.** - *No contests, No friend's bands, No facebook pages.*\n\n##Tips for a successful post:\n\n* **Give a quick outline of your ideas and goals for the track.** - *\"Is this how I trap?\" or \"First try at a soundtrack for a short film\" etc.*\n\n* **Ask for feedback on specific things.** - *\"Any tips on EQing?\" or \"How could I make this section less repetitive?\"*\n\n***\n\n#Other Weekly Threads (most recent at the top):\n\n* [Click here for Feedback threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22feedback%22&sort=new&restrict_sr=on&t=all)\n\n* [Click here for Quick Questions threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22Questions%22&sort=new&restrict_sr=on&t=all)\n\n* [Click here for Collaboration threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22collaboration%22&restrict_sr=on&sort=new&t=all)\n\n* [Click here for Promotion threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22promotion%22&restrict_sr=on&sort=new&t=all)\n\n* [Click here for Our Former Gear threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22Gear%22&sort=new&restrict_sr=on&t=all)\n\n\n\n[Questions, comments, suggestions? Hit us up!](https://www.reddit.com/message/compose?to=%2Fr%2FWeAreTheMusicMakers)",
        "num_comments": 358,
        "comments": [
            "Great song with nice sound selection and atmosphere. It was enjoyable to listen to.",
            "the quick hammering of the one synth is very cool. all of the sounds come together to provide something funky but also hypnotic, which i like. nice job!",
            "I was thinking that I wanted it to be more in my face than it was, then I realized I had the volume down 😂. Very fun, my only comment is I almost wanted more width out of the bass synth growling out at me. Like I wanted it to cover more space. Hard to describe but it hope that makes sense",
            "I enjoyed that quite a bit. Sounds like something off Flying Lotus - Until The Quiet Comes.",
            "Wow this is different than other stuff I've heard from you.  Very nice! This style suits you well. I'm bad at checking my subscriptions but it looks like I've missed a lot from you, do you make a new track every week?",
            "Dude this is great it's like the cure meets trap on acid. Lots of changes of pace and style within the one track. Well done.",
            "It's amazing. It sounds like multiple different song smashed together, but somehow they still have the same theme. Great job.",
            "The vibe is, I don't know, energetic I guess? But I think it really needs a melody on top of it. I don't know what the correct term is, but the mix is mostly low. The mid/high could be used for some melody.",
            "this is pretty cool sounding, i love the way the bass sounds, the ticky percussion's super satisfying! \n\ni'd say it's primarily missing vocals to fill out the middle space, but it is supposed to be just a beat so i get it. however, a nice break into a chord progression or something for a \"hook\" would be cool, give the ears a bit of rest and maybe each time it comes around you could spice it up even more so it builds upon itself. it's always a little tough to listen to the exact same thing for the entire duration of a song, but at least aforementioned thing sounds pretty cool.",
            "That's awesome! I love the sax solo at the end, such a cool explosion of notes. Personally I like music that has some dirt on it, so if I was making this I'd add some grit on the organ or add a dirty bass-guitar. But I didn't make this so don't mind me. Great track, good job!"
        ]
    },
    "/r/WATMM - Weekly Motivation Thread": {
        "title": "/r/WATMM - Weekly Motivation Thread",
        "score": 1,
        "url": "https://www.reddit.com/r/WeAreTheMusicMakers/comments/1dr3icy/rwatmm_weekly_motivation_thread/",
        "content": " Welcome to the [/r/WeAreTheMusicMakers](https://www.reddit.com/r/WeAreTheMusicMakers)  Weekly Motivation Thread!  Share your successes and and encouraging words here.  Posts/Comments looking for motivation can also be appropriate here.\n\nThis thread is active for one week after it's posted, at which point it will be automatically replaced. Note that our rules on \"no promotion\" are still in effect and apply to this post.\n\nIf you are interested in helping us mod these weekly threads please inquire about moderation opportunities by writing in to mod mail.\n\n## Other Weekly Threads (most recent at the top):\n\n&#x200B;\n\n* [Click here for Feedback threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22feedback%22&sort=new&restrict_sr=on&t=all)\n* [Click here for Quick Questions threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22Questions%22&sort=new&restrict_sr=on&t=all)\n* [Click here for Collaboration threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22collaboration%22&restrict_sr=on&sort=new&t=all)\n* [Click here for Promotion threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22promotion%22&restrict_sr=on&sort=new&t=all)\n* [Click here for Our Former Gear threads.](https://www.reddit.com/r/WeAreTheMusicMakers/search?q=author%3A%22automoderator%22+title%3A%22Gear%22&sort=new&restrict_sr=on&t=all)\n\n[Questions, comments, suggestions? Hit us up!](https://www.reddit.com/message/compose?to=%2Fr%2FWeAreTheMusicMakers)",
        "num_comments": 0,
        "comments": []
    },
    "What Vocal Mic Should I Buy - Specific Needs": {
        "title": "What Vocal Mic Should I Buy - Specific Needs",
        "score": 1,
        "url": "https://www.reddit.com/r/WeAreTheMusicMakers/comments/1drblh0/what_vocal_mic_should_i_buy_specific_needs/",
        "content": "hey yall, I'm tryna up my mic quality. Need something versatile that is great with vocals but can pick up acoustic guitar or little percussion like tambourines as well. Right now I'm looking at the Shure SM7B. It seems great but I hear I should buy a condenser mic for vocals, not a dynamic? If anyone can lmk how the Shure is or recommend me another mic in the same price range (\\~$400) that would be great!",
        "num_comments": 0,
        "comments": []
    },
    "Have you ever taken a music \"Retreat?\"": {
        "title": "Have you ever taken a music \"Retreat?\"",
        "score": 19,
        "url": "https://www.reddit.com/r/WeAreTheMusicMakers/comments/1dqvfx4/have_you_ever_taken_a_music_retreat/",
        "content": "Hey there! I'm wondering if anyone here has ever gone on vacation or taken a period of time specifically dedicated to music creation. I thought about doing something like this last winter, but nothing ever came about it. This summer however, I'm thinking about following the idea to fruition and taking a few days to focus only on music. \n\nIf I were to do a music retreat, here's what it might look like:\n\nI would rent out an Airbnb for 3-5 days and go just by myself. I find that being in a new place always inspires me, but whenever I'm on vacation, it's always hard to make music, as I'm usually with family or friends, so renting out a place by myself would let me focus solely on my music. \n\nThe Airbnb would ideally be completely off the grid. It doesn't matter if it's a cabin or a house or even a shed, but somewhere without service and away from people is ideal for me. In my head, I can never completely \"let go\" with my music creation process. Letting go while singing always feels somewhat... \"cringey.\" I'm worried about what my roommates or neighbors might think, and I think that being completely alone for a few days would let me be completely in my head and express it in a musical form to the best of my abilities. Also, being without service would be extremely helpful to limit distractions and help me focus solely on music creation. \n\nThe thing about making music is that life doesn't stop just because you have a good idea. Some of the most interesting music I've made, I needed to stop midway in the creative flow to do something like go to class, work, to sleep, run errands, etc.. The idea of multiple days without distractions is extremely alluring, and I hope that investing in along drive and paying for an Airbnb would pay off in terms of what I would make. Famous musicians have the time and funds to focus all of their recourses on music creation, but as a regular person, this seems like a cheap and worthwhile alternative.\n\nWhat do you think of my plan? Are there things you would do differently? Or have you already done something like this? Are there any famous artists or bands who go on such retreats to make albums? Please let me know!!! Thanks!",
        "num_comments": 16,
        "comments": [
            "Make sure before you do this that you aren't just using these distractions and interruptions as excuses. Sometimes, there are internal reasons (fear, insecurity, perfectionism, a lack of passion, or just plain laziness) why we avoid making music. But rather than admit this to ourselves, we blame it on something external. If this is the case, a retreat won't help.",
            "last summer, my bandmates and i rented an airbnb in the woods for a weekend and diy recorded an album and it was one of the best experiences of my life \n\nyou should do it. maybe go into it with some songs started already, to give yourself some momentum",
            "I’ve done exactly this on a farm in Asheville. Honestly? It went very poorly. I think I felt a little pressured to create something amazing while I had the time, and ended up forcing myself to push out music with very literal actual inspiration. I’d probably have felt more inspired if I just treated it more as a vacation and waited to get back home to make music. This was several years ago though and it would probably would go better now.",
            "For me, it would be going in the opposite direction, all I do typically is write music, however, not in the past one year. I’ve taken a hiatus to work on visuals and programming and and other aspects of the business. I wrote intensely for a long time and I need a  giant breath.",
            "Yes. Do it. In the great big shut down I peaced out to the woods in a trailer for months and I have never ever written so much music. Time and space does wonders. Best if you can find a way to get off the cellular grid, in my experience.",
            "I love the idea of it and I've thought of it for years but have never done it.",
            "Sometimes I record in NYC, sometimes Boston, sometimes Austin, LA, Philly, London, Hoboken, Nashville etc. Yeah, it depends on where the chosen producer wants to work and what studio is selected. The band travels to the producer, not the other way around. I don’t think I’ll ever attempt remote recording in a rental home unless there’s a sound truck parked in the driveway. \n\nI’ve recorded in plenty of houses, but that’s just for demos so the producer knows what they’re getting into.",
            "I'm wrapping an album and a live show and can't really go anywhere because of work, but I'm thinking of booking some extended studio time towards the end of the process. I think getting out of my cluttered, untreated apartment-living-room studio will be a nice treat for me.",
            "No Wi-Fi would be nice to avoid just end up up on Reddit. Hopefully iLok doesn’t get in the way.\n\n\nI‘ve done this, but I didn’t write a ton of new material. I think if I did this again it would be with the intention of polishing and finishing a project.",
            "Yep. Thought I'd write my greatest songs yet but just ended up dealing with some emotions I'd had pent up and felt kinda sad and didnt wanna write anything down lol\n\nI'm not saying it won't work for you, but as others have said don't pressure yourself. Maybe make a little routine and say okay I'm gonna wake up at 9am everyday and just start making stuff until noon. Then get out of your little hidey hole to explore and come back in the afternoon or evening to either finish up your morning ideas or start on some others. \n\nBelieve it or not it might STILL feel a little cringe to really find your voice and fully open up to even yourself. Stay curious and you'll find what you're looking for"
        ]
    },
    "Where should I place my microphone in this room? I've tried to test, but I'm lost.": {
        "title": "Where should I place my microphone in this room? I've tried to test, but I'm lost.",
        "score": 1,
        "url": "https://www.reddit.com/r/WeAreTheMusicMakers/comments/1dqp9jb/where_should_i_place_my_microphone_in_this_room/",
        "content": "Pictures of the studio (important): [https://imgur.com/a/UVbyrNV](https://imgur.com/a/UVbyrNV)\n\nIt's got a decent sound and no horrible reverb. But when I rap/sing towards the drums, some reverb is produced, but I'm sure my SM7B isn't picking that up. Or maybe a little? I'm not sure.\n\nWhere do you reckon I should place my microphone for the best possible audio. Should I have rap/sing towards the drums or have them behind me? I have a hard time finding a good place. Does anyone have a good place to start? I've been testing, but I can't find the perfect spot and I really wanna get to recording. If you have a good guess, I would really appreciate it. I know this post may be stupid.\n\nWhich direction should I rap/sing towards? Probably not close to the drums I'm guessing. But where in the room do you think and which direction? I tried to provide as many pictures as possible, so you'd have a good sense of the room.\n\nThere is a booth as you can see, but it isn't too great. Gives a very boxy sound.\n\nOne final thing: I also have a shield that can go behind the microphone. I don't think it would be necessary, but do you think there's a position that would be perfect with it. Or do you think I should use it no matter what? I can test with or without it though.\n\nI hope this post is okay. If you have some advice, thank you in advance. I'm really lost. I have really tried to test it, but it's hopeless. I just want to record and focus on my performance, but I need to make sure I'm in a good spot. If you have any idea, I would some advice. I just need a place to start. I know it's always different, but I'm sure there's some general guidelines with the room and the things I described. The drums and shield just make it extra difficult to choose.",
        "num_comments": 7,
        "comments": [
            "Probably what you're hearing is the drums resonating a bit with your voice. Point the back of your mic at the drum kit, that's the dead spot so it shouldn't pick anything up, aka you'll be facing the drums. And for good measure throw a blanket or something over the drum kit so it's completely dead. \n\nAn sm7b is the ideal mic for this situation, I guarantee when you put the vocals in a mix you won't hear any room sounds.",
            "Walk around the room while you rap until you find the spot that sounds the best. Place the mic in front of you. ",
            "1) Throw a packing blanket over the drums so nothing resonates while you are tracking vocals.  2) Put the mic stand immediately   in front of the black curtain \"door\" to the booth, track facing that curtain.",
            "DO you think the shield would the shield be necessary then? I don't want my vocal to sound any more muffled. I want that brighter sound, which is already harder on the SM7B.",
            "So looking into the curtain? Why do you reckon that would be good? And thank you!",
            "I really don't think the shield would make any difference for this mic, it's not very sensitive like that. It would be more useful for a condenser mic. \n\nFor a little extra brightness you could try removing the foam windshield, so you're left with just the metal grille, and put a pop filter in front to stop the plosives. It's not a huge difference but it can help. Otherwise just some EQ afterwards will work too.",
            "Yes, looking at the curtain, it will help absorb sound that passes past the mic and keep it from rebounding into the room."
        ]
    }
}