{
    "Feedback Thread": {
        "title": "Feedback Thread",
        "score": 3,
        "url": "https://www.reddit.com/r/web_design/comments/1dqg1kd/feedback_thread/",
        "content": "Our weekly thread is the place to solicit feedback for your creations. Requests for critiques or feedback outside of this thread are against our community guidelines. Additionally, please be sure that you're posting in good-faith. Attempting to circumvent self-promotion or commercial solicitation guidelines will result in a ban. \n\n# Feedback Requestors\n\nPlease use the following format:\n\n>**URL**:  \n>  \n>**Purpose**:  \n>  \n>**Technologies Used**:  \n>  \n>**Feedback Requested**:  *(e.g. general, usability, code review, or specific element)*  \n>  \n>**Comments**:\n\nPost your site along with your stack and technologies used and receive feedback from the community. Please refrain from just posting a link and instead give us a bit of a background about your creation.\n\nFeel free to request general feedback or specify feedback in a certain area like user experience, usability, design, or code review.\n\n# Feedback Providers\n\n* Please post constructive feedback. Simply saying, \"That's good\" or \"That's bad\" is useless feedback. Explain why.\n* Consider providing concrete feedback about the problem rather than the solution.  Saying, \"get rid of red buttons\" doesn't explain the problem. Saying  \"your site's success message being red makes me think it's an error\"  provides the problem. From there, suggest solutions.\n* Be specific. Vague feedback rarely helps.\n* Again, focus on why.\n* Always be respectful\n\n# Template Markup\n\n    **URL**:\n    **Purpose**:\n    **Technologies Used**:\n    **Feedback Requested**:\n    **Comments**:\n\n[**Also, join our partnered Discord!**](https://discord.gg/web)",
        "num_comments": 2,
        "comments": [
            "Hey guys\n\nI would love to have some feedback on my first website. \n\nI recently just built a website from Framer for my friend’s dance crew.\n\nThe goal of this website is to showcase the crew’s talents and allow potential clients to contact them while keeping it simple.\n\n**URL**: [**https://bright-signposts-917753.framer.app/**](https://bright-signposts-917753.framer.app/)\n\n**Purpose**: Showcase crew’s talents and allow potential clients to contact them\n\n**Technologies Used**: Figma, Framer\n\n**Feedback Requested**: Usability, layout, aesthetic, general feedback\n\n\n\nAny feedback is welcome and appreciated. Cheers!",
            "Looks really good from my point of view! I'm not a fan of scroll capturing, but you've not overdone it here and it works well on smartphones, so no stress. \n\n- The language select is initially obscured by the framer tag and might not be as noticeable even without it. The video and large headline will draw most of the attention immediately, so smaller parts, like the navigation links or the language select could be missed by the user. \n\n The navigation isn't as catastrophic, since its where its supposed to be, but the language select might not be in a expected place, given common patterns. \n\n For your image grid that follows, you used some lines attached to the headlines. Maybe you could use a similar highlighter for the language switch. Or a low-opacity border around it. \n\n You could also craft this into a button with just a #000 background that scrolls with the user. \n\n Just so its more noticeable while browsing the site.\n\n- In your image grid layout underneath your header portion, I would try to align the text/copy to the constraints of the images. Here: [Screenshot](https://i.imgur.com/Pq2EEkm.png) and here: [Screenshot](https://i.imgur.com/ka4JRpT.png)\n\n Basically limit the text to the width of each image its assigned to. That would make for a more clean layout. But maybe thats just me.\n\n- On larger screens, some images have a unintended hover effect? Since they scale down or get switched to object-fit:cover or contain, when hovered with the mouse. \n\n- On a Smartphone the image hovers, switching from monochrome to color, don't work obviously. Maybe you can create some kind of scroll effect with framer that colors the images as the user scrolls by. As an alternative. Just an idea.\n\n- On smartphones, your mobile menu works fine as it is, but you just have three links. I think you can style it similarily to your headlines. Larger font-sizes, left-alignment and a bit more margin between them, so the areas are more easily tappable by fingers of all sizes. \n\n The close button could also use some padding, so it doesn't hug the viewports borders.\n\nThats all I noticed so far! Overall a really solid site, straight to the point, with just enough animations to make this a balanced experience to browse/scroll."
        ]
    },
    "Beginner Questions": {
        "title": "Beginner Questions",
        "score": 5,
        "url": "https://www.reddit.com/r/web_design/comments/1dqg1kn/beginner_questions/",
        "content": "If you're new to web design and would like to ask experienced and professional web designers a question, please post below. Before asking, please follow the etiquette below and [review our FAQ](https://www.reddit.com/r/web_design/wiki/faq) to ensure that this question has not already been answered. [Finally, consider joining our Discord community. Gain coveted roles by helping out others!](https://discord.gg/Zv3BDusVUz)\n\n# Etiquette\n\n* Remember, that questions that have **context** and are **clear and specific** generally are answered while broad, sweeping questions are generally ignored.\n* Be polite and consider upvoting helpful responses.\n* If you can answer questions, take a few minutes to help others out as you ask others to help you.\n\n[**Also, join our partnered Discord!**](https://discord.gg/web)",
        "num_comments": 0,
        "comments": []
    },
    "I got a bigger project than I expected": {
        "title": "I got a bigger project than I expected",
        "score": 12,
        "url": "https://www.reddit.com/r/web_design/comments/1dr5swf/i_got_a_bigger_project_than_i_expected/",
        "content": "Starting a new job as a builder and noticed their website was still filled with placeholder text and incomplete css. \n\nI took a web publishing class in uni some years ago so I said I could complete the site if wanted, they put me to do a whole new page instead. \n\nCan I do the index and the subs with the px/scale for desktop version and create a separate «index» for mobile screens or do i need to combine them? \n\nNever done scaling for mobile so thats all Im asking if any has some input, id appriciate it",
        "num_comments": 7,
        "comments": [
            "No definitely don't create a separate page for mobile. I always build client websites by building the site/page out for desktop, and at the end then do a final pass for the tablet and mobile screens using media queries. Just ensure to make your life easier that you don't build the desktop with px widths or position absolute everything. You ideally want to work with percentages and max-widths. So for example {width: 95%; max-width: 1400px, margin-inline: auto; padding: 0px 16px} can be a quick example of a container row which shrinks well for mobile and also looks fine on desktop. There will be no issues with the website having a horizontal page overflow on mobile because you have based the styling of the percentage of the screen",
            "Please look into responsive design and mobile first design before starting. It will save you tons of headache.\n\nDon't do separate files for different screens. Don't start with desktop design and work towards mobile. Start with mobile. Use media queries for usual breakpoints.",
            "You should go with a site builder if they don’t want to hire a professional. \n\nUse Wordpress and be done. \n\nDo not under an circumstances make different sites for mobile and desktop and do not under any circumstances omit the mobile version.",
            "Keep the same index and just change the styling by using multiple breakpoints for eg tablets and smartphones.\n\nAlso use percentages (for widths) instead of fixed units.\n\nLook up responsive web design if this is uncharted territory for you.",
            "Create the responsive css for each section. Use \n\n/* Extra small devices (phones, 600px and down) */\n@media only screen and (max-width: 600px) {...}\n\n/* Small devices (portrait tablets and large phones, 600px and up) */\n@media only screen and (min-width: 600px) {...}\n\n/* Medium devices (landscape tablets, 768px and up) */\n@media only screen and (min-width: 768px) {...}\n\n/* Large devices (laptops/desktops, 992px and up) */\n@media only screen and (min-width: 992px) {...}\n\n/* Extra large devices (large laptops and desktops, 1200px and up) */\n@media only screen and (min-width: 1200px) {...}\n\nInclude it under the normal css. You would most likely just need the 768px",
            "First thing you need is a mobile viewport in the HTML. Put this within the head tag:\n\n```\n<meta name=\"viewport\"content=\"width=device-width, initial-scale=1.0\">\n```\n\nThen look up media queries for adding styles specific to certain screen sizes. ",
            "https://developer.mozilla.org/en-US/docs/Learn/CSS/CSS_layout/Responsive_Design\n\n\nWhen designing a website on a static medium, you won’t be able to address all the issues that might arise with various screen sizes. It’s best to equip yourself with a bit of understanding of common practices. I usually use three concepts with clear breakpoints for screen sizes, each covering desktop, tablet, and mobile screens. The rule of thumb is that all screens should theoretically contain exactly the same components unless there’s a specific reason not to. Visibility can be toggled, but each component must retain the same contextual and functional state regardless of the screen size. Even some design flaws get spotted during the development stage sometimes."
        ]
    },
    " E-commerce built using CSS/HTML or website builder?\n": {
        "title": " E-commerce built using CSS/HTML or website builder?\n",
        "score": 1,
        "url": "https://www.reddit.com/r/web_design/comments/1drbsms/ecommerce_built_using_csshtml_or_website_builder/",
        "content": "I recently working on a project and I need to build an e-commerce for it. I have a good knowledge of CSS/HTML, and have created some websites before, but I have never created an e-commerce website. I'd like to know how much it will cost to build an ecommerce website (I am creating a website for a niche clothing brand)? Perhaps I can use the website builder for e-commerce? Many people recommend Shopify, Woocommerce, or Wordpress. Do you have any other suggestions?\n\n",
        "num_comments": 3,
        "comments": [
            "Yes you should use shopify or Wordpress with woo commerce",
            "If you want to have a functional onlineshop, you can’t just build with html/css. Many content management systems are also a bit restricted in their designs, as they often are build with php and frameworks, they are usually set up for casual people, who don‘t care so much about design, or just install a theme for that.\n\nWordpress can be combined with the Woocommerce plugin, to create a shop also based on premade templates. But it is not that difficult to style the template with css anyway. You and also use a page builder to create the websites around the shop a bit easier. Depending on the page builder and the theme, you have a bit more flexibility in designing the product pages, but it is not as free as just using html/css.\nYou can always add plugins for more functionality. But for more flexibility, you will need knowledge in php, at least to understand code snippets from the internet.\n\nOther content management systems have also the option to add plugins. Shops like shopware or prestashop are more complex than wordpress.",
            "I agree with this sentiment here. Trying to build something from scratch is going to be a large undertaking, and on top of that, you still have to deal with issues like security. It's much easier to get a customer to hand over that credit card number online when they know it's a secure system. \n\nPersonally, I always tell anyone that wants an e-commerce site to really think about what their end goal is. As a business. Things are changing so much in the world that the idea of your own web address and people find you organically or through advertisement and then shop on your site is not necessarily the best route anymore. \n\nI look for instance at my wife. She always goes on the Amazon app when she wants something, but the bigger thing I noticed is that if it's not on Amazon, but it is somewhere else, she seems more reluctant. For her. Her it isn't about security, it's more about just having to go sign up and deal with all the web forms, and then wondering how long the shipping will take. \n\nI think this is a lot of reason why people started using platforms like Etsy, eBay, Amazon, Shopify, etc. It is something to consider when one wants to go e-commerce. I also feel like it's akin to putting a store in the mall as opposed to on a street. You might get more leads being a part of something, even though you have to give up a piece of your sales to it."
        ]
    },
    "I made this dashboard.": {
        "title": "I made this dashboard.",
        "score": 133,
        "url": "https://www.reddit.com/gallery/1dqd66c",
        "content": "It let's you get News, Weathers and track tasks.\n\nI am looking for more ideas to integrate into this site. I am also looking into making a second page so I could have more freedom to implement new functions without space constraints.\n\nCheck out my project: https://github.com/Epicalable/ComDash\nDon't forget to star it :-)",
        "num_comments": 63,
        "comments": [
            "Always a fan of bento boxes but you need to change the font and darken the background image to make the text pop more",
            "The text is difficult to read, which makes it not very accessible. You need to balance things out so that it's easier on the eyes. Make sure you use contract checkers.",
            "Function over form.  It isn't legible.",
            "1. Nothing is aligned \n2. Hard to read",
            "This wouldn't be ADA compliant.",
            "Looks cool until the background is white and I'm reading white text.",
            "Everything is fighting for attention, don’t know where to look",
            "The background images can be a little dark some of the text is just hard to read!",
            "Really hard to read fr",
            "It would be so much nicer if I could read it."
        ]
    }
}