{
    "Monthly Check In....it's June 2024": {
        "title": "Monthly Check In....it's June 2024",
        "score": 9,
        "url": "https://www.reddit.com/r/weddingplanning/comments/1d5ebxp/monthly_check_inits_june_2024/",
        "content": "How's it going? Posts are organized by month as far as 18 months out. Add where needed!\n\nAlso check out the [Daily Chat](https://www.reddit.com/r/weddingplanning/search/?q=daily%20chat&restrict_sr=1&t=day), which is a great place for quick questions and casual chatting.",
        "num_comments": 112,
        "comments": [
            "\"September 2024\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/weddingplanning) if you have any questions or concerns.*",
            "\"June 2024\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/weddingplanning) if you have any questions or concerns.*",
            "\"August 2024\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/weddingplanning) if you have any questions or concerns.*",
            "September 21st over here. I just went in for my second fitting for my wedding dress and they did nothing to it. I bought my dress last June 2023, they had to order it and said that it would take 8 to 10 months. Well, at the 9 month mark I called to check on progress. They had it in but didn't call me. We go in for an initial fitting. Few minor alterations were needed but mostly it needed hemming. (I'm 5'0 lol). They took my measurements and said they would alter it. I asked when It should be done and if they would call me. I was told that they would call in about 2 weeks. 3 weeks go by and nothing. I call and they said we could come in for another fitting. We go in this morning and none of the alterations were done. Now I have to find a new seamstress 🤦‍♀️ because no way was I dealing with them again. ",
            "\"October 2024\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/weddingplanning) if you have any questions or concerns.*",
            "\"November 2024\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/weddingplanning) if you have any questions or concerns.*",
            "\"April 2025\"  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/weddingplanning) if you have any questions or concerns.*",
            "\"September 2025\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/weddingplanning) if you have any questions or concerns.*",
            "\"December 2024\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/weddingplanning) if you have any questions or concerns.*",
            "\"March 2025\"  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/weddingplanning) if you have any questions or concerns.*"
        ]
    },
    "Daily Chat & Quick Questions - June 29, 2024": {
        "title": "Daily Chat & Quick Questions - June 29, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/weddingplanning/comments/1dr2ic3/daily_chat_quick_questions_june_29_2024/",
        "content": "Discuss anything on your mind with your fellow wedditors. This is an especially great place to ask short  (1-2 lines) questions or commonly asked questions instead of making an individual post.\n\nAll discounts and deals should be posted here.\n\nDon't forget to check out the latest Monthly [Check In thread](https://www.reddit.com/r/weddingplanning/search?q=title%3Acheck+in&restrict_sr=on&sort=new&t=month)! The Monthly Check In is great for finding date twins, as well as seeing where others are at in their \"To Do\" timelines.",
        "num_comments": 0,
        "comments": []
    },
    "What do we think?": {
        "title": "What do we think?",
        "score": 503,
        "url": "https://i.redd.it/0p1g1vp2af9d1.jpeg",
        "content": "\nTried on dresses today for the first time. Looking to get this gown custom made. The lady at the boutique said I kept glowing in this one. I also kept comparing it with everything else I tried on. This wouldn’t be my veil of choice, but it was nice to see how it looked with a veil.",
        "num_comments": 105,
        "comments": [
            "This is stunning, but you genuinely look like a bridal model so anything would be stunning \n\nHow do you feel in it?",
            "OMG. This dress was made for you. \nYES.",
            "Absolutely stunning! I thought you were actually a model, not the bride!",
            "this looks absolutely incredible on you",
            "So beautiful! It’s perfect on you and I love how unique it is. It’s really special",
            "I usually don’t like basque waist dress, but this looks like it was made for you!",
            "Who is the designer? It’s gorgeous ",
            "Stunning gorgeous phenomenal outstanding groundbreaking jawdropping!",
            "Stunning is really the word.",
            "This looks absolutely gorgeous on you, and I love that it's a bit unique while still feeling very timeless!"
        ]
    },
    "Why are people clueless when it comes to RSVP’ing": {
        "title": "Why are people clueless when it comes to RSVP’ing",
        "score": 168,
        "url": "https://www.reddit.com/r/weddingplanning/comments/1dqy8wf/why_are_people_clueless_when_it_comes_to_rsvping/",
        "content": "**“Oh, I didn’t RSVP?… I thought I did”**\n\n**“I don’t know how to RSVP”**\n- did you get the invitation?\n- yes.\n- did you see the RSVP card in the invitation?\n- yes.\n- did you see the instructions on that card?\n- yes. \n- that’s how you you rsvp… by following those instructions. \n\n**“I didn’t know I had to RSVP.”**\n- did you get the invitation?\n- yes.\n- did you see the RSVP card with instructions?\n- yes.\n- why would you think that didn’t apply to you?\n\n**“You have a wedding website? What website is this?”**\n- this is after having the website on the save the date and on the invitation in two different places — this was the most infuriating and flat out disrespectful/insulting. I audibly gasped 🥲\n\n**It’s not hard. You go to the website, click the RSVP button and voila! People are bonkers…**\n\n\n",
        "num_comments": 40,
        "comments": [
            "I feel this so hard 🤣🤣 my cousin’s rsvp showed up after the wedding",
            "A lot of our closer guests were clueless about RSVPing. I had to tell my sister and my future in-laws that yes they actually do need to RSVP even though yes I do know that they're coming. You still need to pick your meal on our website!",
            "You have people asking how to RSVP ? 😩\n\nMine just dont do it until I beg them to lol.",
            "Old people don’t know how to do that. We are sending out invites just for them and the rest codes.",
            "I did this once a few years ago. I was so young and had never been to a wedding without my parents haha. I literally didn’t know we needed to rsvp for some reason. Now that I am planning my own wedding, I cringe so hard at that memory. Just know that most people don’t mean to not rsvp probably, it’s an oversight.",
            "It’s a bit annoying, but to offer a different perspective wedding websites are pretty recent and not a traditional way of RSVPing. One of my relatives had literally never seen one before and told my mom. I’d just send them the link directly and ask them to RSVP there.",
            "Omg! Are we the same person??  I'm having the same experience.",
            "For real. I didn't send my save the dates yet but I sent a link for people to fill in their info (email, phone numbers, addresses) to about 80 people. Only 10-15 filled it in 🙄 sigh I'm glad my wedding is still a year away but it's really annoying setting up this neat online RSVP knowing I'll probably have to manually contact each of these people anyway in the end coz they won't do it.",
            "Most people don't have occasion to go to fancy parties that require formal RSVPs. They don't really understand what RSVPs are unless they've thrown a fancy wedding. It's not malicious, they just really have no idea how it works or why it's important.",
            "I’m literally preparing for the shitshow that will be people RSVPing through our website. Especially since we chose to have a password, which is written on the invitation, which will be overlooked and thus no RSVP provided. \n\nThankfully 90% of our guests are my fiancés family and any questions will be directed to him because thankfully no one has my number! I refused to shell out even more money on paper RSVPS when those would also get lost anyways."
        ]
    },
    "Recently married! My two cents": {
        "title": "Recently married! My two cents",
        "score": 14,
        "url": "https://www.reddit.com/r/weddingplanning/comments/1drb30i/recently_married_my_two_cents/",
        "content": "First, I am so grateful for this subreddit. I read so many posts about what to expect and received so much good advice, I hope to give back with my own experiences. I had a large wedding in a city.\n\nPlanner: If you can, getting a planner makes your life so much easier. She was the most helpful resource for my questions and constantly anticipated exactly what we needed. On the day of my wedding, she took care of everything. I did not have a watch and just went where she told me and did all of the fun things all day and night long!\n\nYou and your fiance: Communication is key. I planned a lot of the wedding and realized I am not the best communicator. I had him sit in the meetings with the photographer and DJ. The first so he knew what to expect of the day since he (like me) doesn’t like taking a lot of photos and could add his thoughts. The second because music is so important to him. This leads to my next point.\n\nKnow yourselves: What is important to you two? I knew from the beginning I wanted 30min between the ceremony and reception where we could relax and just be married before jumping back into the whirlwind. It was so nice! I always liked the advice, write down 3 things that matter to you most and focus on them. Make sure your fiance does to, and discuss!\n\nThe week before the wedding (emotions): I was so stressed out about last minute things that I could not get excited about my wedding. I felt empty and guilty I felt this way. People constantly asking me how planning was going and if I was excited didn’t help. The week leading up to the wedding had some low lows and was also the most intense love I had ever felt for my fiance as he helped me through it. Finally, I let go of everything and actually found joy again as I started to see my friends at the rehearsal.\n\nMindfulness: Everyone kept telling us the day was going to fly so we decided together to be mindful throughout the day. We would literally say “we are sitting in this car on the way to the reception” and then enjoy the moment. I think this and having a planner take care of logistics made this day feel long and special. \n\nBridesmaids getting ready: I made a kit that had bandaids for painful heels, scissors in case the dresses had extra straps etc, and cheap pearl hair pins that were optional. I also brought colored straws so girls knew which drinks were theirs.\n\nLittle things I would keep the same: Feet numbing spray for heels before the ceremony, wedding reception white sequin sneakers, coffee stand at the reception, a special outro song to end the night\n\nMost importantly: And this matters more than upgraded silverware or salad choice, you are marrying a wonderful person!! Many congratulations to you both :) Best of luck with planning!",
        "num_comments": 1,
        "comments": [
            "Thanks for sharing your experience with us!  Love the advice about being mindful on a day you get swept up in the whirlwind.  Sounds like your married life is off to a wonderful start!  Bright blessings to you!"
        ]
    }
}