{
    "Monthly Check In....it's June 2024": {
        "title": "Monthly Check In....it's June 2024",
        "score": 10,
        "url": "https://www.reddit.com/r/weddingplanning/comments/1d5ebxp/monthly_check_inits_june_2024/",
        "content": "How's it going? Posts are organized by month as far as 18 months out. Add where needed!\n\nAlso check out the [Daily Chat](https://www.reddit.com/r/weddingplanning/search/?q=daily%20chat&restrict_sr=1&t=day), which is a great place for quick questions and casual chatting.",
        "num_comments": 112,
        "comments": [
            "I just joined this subreddit to read up on tips and tricks.  I'm a May 2025 bride, and we just paid a planning fee to Pink Iceland to help us plan our destination wedding in Iceland.  I AM EXCITE",
            "\"September 2024\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/weddingplanning) if you have any questions or concerns.*",
            "\"June 2024\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/weddingplanning) if you have any questions or concerns.*",
            "Wedding is two months away and I messed up badly!! My passport expired. Thought ok I’ll get it eventually I don’t need it now. I have my license. I need photo ID for our marriage license. Well guess what?\nI forgot my license expiration was coming up and it just expired yesterday..\n\n So now I have ZERO photo ID and I need it ASAP to get our wedding license… 🤦🏻‍♀️🤦🏻‍♀️😭",
            "\"August 2024\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/weddingplanning) if you have any questions or concerns.*",
            "September 21st over here. I just went in for my second fitting for my wedding dress and they did nothing to it. I bought my dress last June 2023, they had to order it and said that it would take 8 to 10 months. Well, at the 9 month mark I called to check on progress. They had it in but didn't call me. We go in for an initial fitting. Few minor alterations were needed but mostly it needed hemming. (I'm 5'0 lol). They took my measurements and said they would alter it. I asked when It should be done and if they would call me. I was told that they would call in about 2 weeks. 3 weeks go by and nothing. I call and they said we could come in for another fitting. We go in this morning and none of the alterations were done. Now I have to find a new seamstress 🤦‍♀️ because no way was I dealing with them again. ",
            "\"October 2024\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/weddingplanning) if you have any questions or concerns.*",
            "\"November 2024\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/weddingplanning) if you have any questions or concerns.*",
            "\"April 2025\"  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/weddingplanning) if you have any questions or concerns.*",
            "\"September 2025\"\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/weddingplanning) if you have any questions or concerns.*"
        ]
    },
    "Daily Chat & Quick Questions - June 29, 2024": {
        "title": "Daily Chat & Quick Questions - June 29, 2024",
        "score": 1,
        "url": "https://www.reddit.com/r/weddingplanning/comments/1dr2ic3/daily_chat_quick_questions_june_29_2024/",
        "content": "Discuss anything on your mind with your fellow wedditors. This is an especially great place to ask short  (1-2 lines) questions or commonly asked questions instead of making an individual post.\n\nAll discounts and deals should be posted here.\n\nDon't forget to check out the latest Monthly [Check In thread](https://www.reddit.com/r/weddingplanning/search?q=title%3Acheck+in&restrict_sr=on&sort=new&t=month)! The Monthly Check In is great for finding date twins, as well as seeing where others are at in their \"To Do\" timelines.",
        "num_comments": 0,
        "comments": []
    },
    "What do we think?": {
        "title": "What do we think?",
        "score": 289,
        "url": "https://i.redd.it/0p1g1vp2af9d1.jpeg",
        "content": "\nTried on dresses today for the first time. Looking to get this gown custom made. The lady at the boutique said I kept glowing in this one. I also kept comparing it with everything else I tried on. This wouldn’t be my veil of choice, but it was nice to see how it looked with a veil.",
        "num_comments": 67,
        "comments": [
            "This is stunning, but you genuinely look like a bridal model so anything would be stunning \n\nHow do you feel in it?",
            "OMG. This dress was made for you. \nYES.",
            "Absolutely stunning! I thought you were actually a model, not the bride!",
            "this looks absolutely incredible on you",
            "How amazing.",
            "You look amazing",
            "So elegant",
            "Girl 🤯🔥",
            "Stunning!!",
            "Who is the designer? It’s gorgeous "
        ]
    },
    "Why are people clueless when it comes to RSVP’ing": {
        "title": "Why are people clueless when it comes to RSVP’ing",
        "score": 122,
        "url": "https://www.reddit.com/r/weddingplanning/comments/1dqy8wf/why_are_people_clueless_when_it_comes_to_rsvping/",
        "content": "**“Oh, I didn’t RSVP?… I thought I did”**\n\n**“I don’t know how to RSVP”**\n- did you get the invitation?\n- yes.\n- did you see the RSVP card in the invitation?\n- yes.\n- did you see the instructions on that card?\n- yes. \n- that’s how you you rsvp… by following those instructions. \n\n**“I didn’t know I had to RSVP.”**\n- did you get the invitation?\n- yes.\n- did you see the RSVP card with instructions?\n- yes.\n- why would you think that didn’t apply to you?\n\n**“You have a wedding website? What website is this?”**\n- this is after having the website on the save the date and on the invitation in two different places — this was the most infuriating and flat out disrespectful/insulting. I audibly gasped 🥲\n\n**It’s not hard. You go to the website, click the RSVP button and voila! People are bonkers…**\n\n\n",
        "num_comments": 32,
        "comments": [
            "People are clueless about the RSVP process for the same reason why people ask questions on Reddit or Facebook that have answers that would show up as the first result in a google search. And for the same reason why I am frequently answering professional questions with, \"Have you read the instructions for the form?\" Because the answer is in the instructions.\n\nBasically, people don't read and want someone to spoon-feed them everything. It's a human nature thing, not specific to RSVPs.\n\nIt's annoying AF though.",
            "We had a lot of people who viewed not RSVPing at all as the equivalent of a \"not attending\" response. I think because with evites for birthday parties and such, that's basically how most people do it. Respond yes, or ignore the email. They don't realize that with wedding planning, we need those numbers to be accurate.\n\nMy mom in her seventies figured out how to RSVP online; she complained, but still did it all by herself!\n\nWe had some young adults, where it was their first time attending a wedding, who needed some coaching on what to do. I didn't mind those.\n\nI had a guest, who absolutely knew better, send me a \"yeah, I'll be there\" text, and then a week before the wedding wanted to know if she could bring a plus one...there was a plus one for her if she had RSVP'd properly, but by then we had already turned in catering numbers. That one I was less sympathetic towards!",
            "I feel this so hard 🤣🤣 my cousin’s rsvp showed up after the wedding",
            "I did this once a few years ago. I was so young and had never been to a wedding without my parents haha. I literally didn’t know we needed to rsvp for some reason. Now that I am planning my own wedding, I cringe so hard at that memory. Just know that most people don’t mean to not rsvp probably, it’s an oversight.",
            "Old people don’t know how to do that. We are sending out invites just for them and the rest codes.",
            "From what I’ve seen:\n\n1. People don’t read through the entire invite, so they never see the website. I’m the type to usually read everything, and even then I used to only look at the time and place. I remember going to my friend’s wedding and we had like 30-40 people hanging out the day beforehand and asking the couple a ton of logistical questions. They joked about how they never should have bothered with the website and literally everyone was like, “there was a website??” I started looking for it after that.\n\n2. They’re not used to it. Most people don’t go to events where they need to formally RSVP to stuff. If they’re younger and haven’t been to many weddings before, they might not realize the importance until they plan their own. If they’re older, they might not know you can do it online.\n\n3. If people constantly go to weddings where the bride and groom are nice enough to send a text to those that didn’t RSVP to confirm attendance, they’ll just never realize. The same bride and groom above had texted every single guest and so have a lot of other couples that I know.",
            "A lot of our closer guests were clueless about RSVPing. I had to tell my sister and my future in-laws that yes they actually do need to RSVP even though yes I do know that they're coming. You still need to pick your meal on our website!",
            "I’m literally preparing for the shitshow that will be people RSVPing through our website. Especially since we chose to have a password, which is written on the invitation, which will be overlooked and thus no RSVP provided. \n\nThankfully 90% of our guests are my fiancés family and any questions will be directed to him because thankfully no one has my number! I refused to shell out even more money on paper RSVPS when those would also get lost anyways.",
            "It’s a bit annoying, but to offer a different perspective wedding websites are pretty recent and not a traditional way of RSVPing. One of my relatives had literally never seen one before and told my mom. I’d just send them the link directly and ask them to RSVP there.",
            "YES. also because we need to be 100% sure if any guest has a food allergy that catering needs to be aware of. let alone meal choice. cmon man 😩\n\n\nI feel like my personal rsvp time for other peoples weddings has always been within 2 weeks of receiving the invitation. and i have adhd. i forget everything. i leave my phone in the fridge sometimes!! i don’t get it!!"
        ]
    },
    "Finished my Lego Wedding Cake": {
        "title": "Finished my Lego Wedding Cake",
        "score": 30,
        "url": "https://i.redd.it/7tsxh2qidf9d1.jpeg",
        "content": "It’s definitely sloppy, and a little too busy, but I’m in love with it. It was truly a labor of love\n",
        "num_comments": 2,
        "comments": [
            "Oh this is so cute I love it!!"
        ]
    }
}