{
    "I walked through a cornfield.": {
        "title": "I walked through a cornfield.",
        "score": 19806,
        "url": "https://i.redd.it/du5yjvkecz7d1.jpeg",
        "content": "",
        "num_comments": 1278,
        "comments": [
            "https://preview.redd.it/4dy0xj53118d1.jpeg?width=1170&format=pjpg&auto=webp&s=ba9acb83e80441434ca403686c31076d45997ab9\n\n🥲",
            "Is there a specific allergen tied to corn stalks that would give this reaction?",
            "You lost your eyes because they only want ears in those fields",
            "Holy hell! That looks like an allergic reaction. That's what my eyes look like when I get into poison ivy\n\nDefinitely wellthatsucks!",
            "Oh Jesus man you are having one helluva allergic reaction. Hopefully you have some Benadryl, and well, hopefully someone else is there to drive your car.",
            "##this is an emergency room situation, this type of reaction can turn to anaphylaxis.",
            "https://preview.redd.it/7gb9xydwiz7d1.jpeg?width=640&format=pjpg&auto=webp&s=d4cf3b60509a7d4fc7c6584d9d012ccdaf6ebdf2",
            "At least you have a very good idea what caused your problem. I just dropped $400 at an urgent care. My eyes looked like this when I got up, except much, much redder. Steroids, two antihistamines and a second GRED med. and a nice paper bag to keep them in. I'm trying to schedule allergy testing.",
            "https://preview.redd.it/o7j6p786b08d1.jpeg?width=828&format=pjpg&auto=webp&s=d7a35185d55bce0af0ca4b9ef226fd40f94475f6",
            "Did you get a combine harvester in your eye?"
        ]
    },
    "Oh": {
        "title": "Oh",
        "score": 19381,
        "url": "https://i.redd.it/bj4z6tgdgy7d1.jpeg",
        "content": "",
        "num_comments": 779,
        "comments": [
            "It is just getting worse and worse.",
            "This kind of deceptive fee structure/greed and community backlash will be the end of Airbnb-type businesses.",
            "what planet do they apply 54% tax on subtotals",
            "What exactly is a host fee? It's not like they're there giving you service of any kind so you're paying 200 bucks to rent the space and then 700 bucks because why?",
            "Fuck that might a well get a 1* hotel",
            "JFC stay at a hotel. You know exactly what you’re getting and it’s cheaper.",
            "Does host fee mean I don’t have to clean? Do you REALLY want me to not clean? 😏",
            "This is why it’s important to filter search results and have the price shown on ABNB or VRBO to include all fees.\n\nThese fuckers will show a super discounted rate to stay at their place, make everything non-refundable, and then hope you just glide through booking.\n\nIt’s absolutely shit and fuck these types of predatory hosts in particular.",
            "There is ZERO reason to not just pay for a hotel at this point. For a single night? You can get a room at a Marriot or Hilton for cheaper than this and its guaranteed to be clean, with no funny business. Or just do a Courtyard Inn and get a free breakfast at least.\n\nHave no idea how people continue to use AirBnB with these kind of exorbitant fees.\n\n50% tax is stupid enough. A service fee just so AirBnB gets their cut, and then a 350% host fee????????????????? What the actual fuck,.",
            "This is beyound ridiculous unless the host fee also includes giving me the best bj’s in the world."
        ]
    },
    "My dog stole this from my room and took it down to the shared living room :’)": {
        "title": "My dog stole this from my room and took it down to the shared living room :’)",
        "score": 3467,
        "url": "https://i.redd.it/jg2ggt73vz7d1.jpeg",
        "content": "I live with my parents and sibling :’) idk how long it was out there ",
        "num_comments": 220,
        "comments": [
            "Dog - “Got your tail!”",
            "This dog judging you",
            "Would your parents recognize what it is?",
            "Lol… even the dog is embarrassed that it’s so small",
            "Deny, Deny, Deny, It was your sibling’s.",
            "He or her looks so embarrassed lol",
            "Remember. Its a powder puff for doing your makeup. Just a powder puff",
            "https://preview.redd.it/c1p6xoe1h18d1.jpeg?width=1179&format=pjpg&auto=webp&s=f0337dc3631cd4cbe75b043ba1af220d7aa92432",
            "What the dog doin",
            "My condolences"
        ]
    },
    "thought it could be for food…": {
        "title": "thought it could be for food…",
        "score": 5751,
        "url": "https://i.redd.it/4e5iddk0iy7d1.jpeg",
        "content": "…my family is rather low on money and i got “tipped” 100 dollars at my job at a restaurant as a waitress and got so excited to have my own money since i’m young and can’t get a real job that actually pays good.  guess i got double fucked and also tipped nothing for all my work 💀 i’m definitely not gonna by your advertising services now",
        "num_comments": 259,
        "comments": [
            "tipping fake money on top of advertising is fucked up is so many levels",
            "If you can find their business on Google, give it a shit review and mention this practice. If they contact you, tell them you'll remove it for $100.\n\n**Edit**: Damn folks, American laws around extortion are *broad*. As /u/NotBrooklyn2421 pointed out, as soon as you ask for money, you'd be breaking the law, full stop.",
            "Yeah….. I’m gonna need the name of that business I’ve got time to kill and leaving a bad review sounds like a great way to waste it.",
            "Bible verses on fake $20 was my fav as a server",
            "You should definitely leave a review if they have any public facing accounts now that you know their business. Fuck people like this. If you don't want to tip, then don't. No need to be a coward about it.",
            "****update: i can’t make edits, but there wasn’t any contact info or phone number on the sticky note or fake bill. the rest of the note just said “i can help!”",
            "How is leaving fake money as a tip not attempting to pass counterfeit currency? I just don't understand it. This should 100% be a felony.",
            "Post the name of the company here.",
            "Call and tell them yes you're interested in selling your house, and then give them the address of a random house an hour away. Waste their time lmao",
            "One morning a few years ago I was walking to my car to go to work when I saw what looked like money blowing down the middle of my street. I grabbed it and it was a $100 bill, so I was of course stoked. I put it in my pocket and drove away. At work I pulled it out to show off to my coworkers my good fortune, when I saw some Chinese writing on it, Google Translate told me it said \"play money\" or something like that. So then I was sad, but whatever. It ended up in my car, in a little cubby under the stereo. Fast forward a month or so and I met up with a friend who was going through some hard times. She lived about 2 hours away from me- she had lost her job and she and her son were on the brink of homelessness, so I took them out to lunch, bought them a bag of groceries and supplies, and then I drove us to a park so her kid could play and just be a kid. She mentioned to me that she had left something in my car and she would be right back. No problem. After a while I had to get rolling home so we packed up and we drove to a hotel and I paid for a room for two nights, we said our goodbyes and I left. A couple of days later I was looking for something in my car when I noticed that the fake $100 was gone. She had obviously seen it, and when she excused herself to go back to my car she pinched it. At first I was worried that she would try to spend it and get in trouble, or at least get hassled, but then I realized- after all of my friendship, support, and goodwill, she still stole money from me, whether it was bogus money or not. I haven't spoken to her since.\n\nhttps://preview.redd.it/wu8fkovr5z7d1.jpeg?width=3000&format=pjpg&auto=webp&s=92a3253d4bd4e32c0614075c10f458a89a39b3e8"
        ]
    },
    "I just wanted a sweet tea after work": {
        "title": "I just wanted a sweet tea after work",
        "score": 7332,
        "url": "https://i.redd.it/qafs4p02tx7d1.jpeg",
        "content": "",
        "num_comments": 814,
        "comments": [
            "https://preview.redd.it/7den0m1pfy7d1.jpeg?width=1125&format=pjpg&auto=webp&s=ebd11ebc7fdda6e342e3e8bb22971a636422cbf6",
            "Explain yourself",
            "I am really lost as to what maple syrup has to do with sweet tea…..",
            "Sir, you’re doing this wrong",
            "WTF kind of fresh hell is this? Sweet tea with MAPLE SYRUP??? Are you deranged?",
            "Well, good thing that's maple syrup and not sweet tea!",
            "If you're using Costco maple syrup to make sweet tea I don't even understand how those insect carcasses could be of any concern.",
            "Hot ass water in pitcher and throw some tea bags in and lots of sugar. Get it all mixed up then shove it into the fridge for a little and pour it over a bunch of ice in a cup. Sweet tea. Don't come near me with  maple syrup you monster.",
            "Yo, I'm Canadian and even I'm not that loopy on the tree blood. I think you've somehow united the South and the far North on an important matter here.",
            "Canadian here.\n\nI have no idea whats going on. We don't put maple syrup in our tea. This is blasphemy!"
        ]
    }
}