{
    "I think someone didn't call 811 in time": {
        "title": "I think someone didn't call 811 in time",
        "score": 7872,
        "url": "https://v.redd.it/s4ztwdbs5e9d1",
        "content": "",
        "num_comments": 256,
        "comments": [
            "Hitting fiber won't kill you, but it will cost you a whole lot of money.",
            "Someone dug up the rainbow roots",
            "The repair guy has to connect all of those wires together one by one",
            "Power company did this to a copper feeder cable for the neighborhood about 1000ft from the co and it pulled the entire cable out of the co through the trunk took 3 weeks to get it all cut back over. But we made bank working those long hours getting it back up.",
            "I remember my internet provider telling me my connection was down in 3 states about a week ago. I think that was something like that ",
            "Is this Snoop Dogg talking?",
            "Just splice it back together......",
            "Last time I had a company over to bury a fibre down my driveway I asked if they had rung our version of \"dial before you dig\".  They said they don't do that anymore because it's unreliable.  They can just scan the ground to see if there are any cables where they plan to dig.",
            "We call that rainbow spaghetti.",
            "But I was hand digging with an auger"
        ]
    },
    "Passed a kidney stone today": {
        "title": "Passed a kidney stone today",
        "score": 2459,
        "url": "https://www.reddit.com/gallery/1dr22ym",
        "content": "Last weekend had some discomfort and a little blood so I thought I had a UTI. Come to today and I felt some shifting happening while peeing. After a ton of water, slamming a beer, and even more water, this bad boy popped out. Hopefully never again I’m going to pay attention to what I eat 😭😭.",
        "num_comments": 345,
        "comments": [
            "That came out the pee hole??",
            "sorry if this is too far but when this happens do you piss into the toilet and collect the stone out of the toilet or how do you end up with it in your hand sorry i have no idea and am curious",
            "HO LY SHIT! Thats a MONSTER! How did you not pass out?!",
            "Geez dude, you need anything? Lol",
            " Man, a little more cooking and you would have had a diamond. Put it back in.",
            "Looks like that good old school Molly.",
            "Jesus fuck. Thats a ginormous spiky shard. Hope youre ok!",
            "Dont let Louis J. Gomez see this thang!",
            "Dont put yourself through the pain yall. Go to the hospital and get lithotripsy so it breaks up stones. That way you can pass them pain free with ease.",
            "What questions did you ask God when you met him?"
        ]
    },
    "I just can’t": {
        "title": "I just can’t",
        "score": 4179,
        "url": "https://www.reddit.com/gallery/1dqwww2",
        "content": "I’ve already had a really crappy week and now THIS SHIT, on my way home from work?!",
        "num_comments": 259,
        "comments": [
            "Oh my god that sucks sooo bad. Im so sorry that happened to u! Fuckers",
            "To anyone reading this:\n\nIf you buy a Kia or Hyundai made after 2012 with a turn key ignition, a Kia Boy **will** steal it. Its not a matter of if, its a matter of when. There is a reason theyre so cheap, now. Invest in a steering wheel lock or trade it in. It sucks, yes, but Hyundai has no real interest in providing current owners with a solution. Anyone with a Kia or Hyundai that fits the above description will be a target for the Kia Boys, in perpetuity. It is *incredibly* easy to replicate.",
            "Hopefully your deductable isn't too high. I had my Ram broke into during a concert. They did $4,000 worth of damage. Had I known more about the claims process I would have kicked in a dent in my door and added it to the claim. \n\nSorry you are going through this bull shit.",
            "At least you still have the car, so many people lose the car/van and its contents, these fuckers just dont give a shit!",
            "Same thing happened to me last week. They couldnt steal it for whatever reason, but my ignition is all jacked up and I cant start it. I hate having a Kia.",
            "I'm surprised the car was still there. One more pry with a screwdriver and it would start.",
            "Anyone that owns a Kia needs to debadge it and swap out the rims.  These idiots will be less likely to target your vehicle.  Thats what I did with my 2011 optima sx and *knock on wood* I havent had any issues in the past few years.",
            "Is that a Kia? If it is this is exactly why I didnt buy a Kia.",
            "And even if the person who did it is caught, there will be zero consequences. \"It's only property\", after all.",
            "We've all been there\n\n![gif](giphy|PlgNz2gB8Q2fm)"
        ]
    },
    "Took a nice sip of coffee to get greeted by antlers": {
        "title": "Took a nice sip of coffee to get greeted by antlers",
        "score": 2641,
        "url": "https://i.redd.it/zpwx7320qc9d1.jpeg",
        "content": "",
        "num_comments": 246,
        "comments": [
            "It's an earwig guys lol",
            "Earwigs are completely harmless but they still give me the heebie-jeebies.",
            "It must be a busy year for earwigs. I've been seeing more of them around my house and more posts here talking about them.",
            "lmao antlers? they are pincers dude, unless that is a baby deer in your cup",
            "yes everyone, I meant antenna not antlers. thank you for correcting me lol",
            "Homie got Tea-Bagged by a Bug...",
            "These mother fuckers are everywhere this year.",
            "Im so tired of earwigs. They are everywhere this year. My house doesnt have decaying leaf litter, so stop coming into my house!",
            "I sucked in my breath so loud my husband made fun of me",
            "You ever pop the internals of that lid off? I did once. Maybe I shouldn't have."
        ]
    },
    "Didn't even race and still lost": {
        "title": "Didn't even race and still lost",
        "score": 1246,
        "url": "https://v.redd.it/4aemjl7iwd9d1",
        "content": "",
        "num_comments": 42,
        "comments": [
            "This has happened to me twice haha",
            "Shoes are off. He ded.",
            "He kept going back to try to retrieve more, leaving more behind each time. He finally cut his losses and gave up when he was left with his ankles.",
            "What is the guy doing at the end? Is it prayer time?",
            "Prepped strips are sprayed with glue, it's insane how sticky they are.",
            "Yeah never wear anything loose at the drag strip",
            "Some real home alone stuff huh",
            "everything he put on the track is sock",
            "I find drag racing quite tacky.",
            "Maybe steel toed boots next time"
        ]
    }
}