{
    "Was ist dieses Sub?": {
        "title": "Was ist dieses Sub?",
        "score": 61,
        "url": "https://www.reddit.com/r/WerWieWas/comments/umd3sv/was_ist_dieses_sub/",
        "content": "Hier soll ein Ort entstehen, an dem ihr in Zukunft Hilfe erhalten sollt, wenn ihr konkrete Fragen habt, bei denen ihr nicht mehr weiterwisst. Beispiele für mögliche Themen wären:\n\n* Wo ist dieses Foto von meinen Großeltern in den 60ern entstanden?\n\n* Was ist das für ein Insekt?\n\n* Was hat dieses Schild zu bedeuten?\n\n* Wie alt ist diese Landkarte?\n\n* Ich habe in den 90ern einen Zeichentrickfilm gesehen, in dem es um Löwen geht. Könnt ihr mir helfen, auf den Titel zu kommen?\n\n* Was bedeuten die Markierungen an dieser Hauswand?\n\nEs soll also eine Mischung aus englischsprachigen Subs wie /r/WhatsThisBug, /r/WhatsThisThing, /r/TipOfMyTongue o.ä. für den deutschsprachigen Raum entstehen, und ihr seid herzlich eingeladen, eure Fragen zu stellen oder anderen Fragestellern bei ihren Problemen zu helfen. \n\nIn diesem Sinne: Kommt in Scharen und werdet Teil dieser entstehenden Community!",
        "num_comments": 17,
        "comments": [
            "Können wir vielleicht die \"Spaßantworten\" unterbinden? Nur die wengisten sind witzig und und in den meisten Fällen einfach nur nervig weil man durch eine Flut von \"ich bin 40 und lustig\" Müll kramen muss um das zu finden was einen eigentlich interessiert.\n\nIch bezweifle auch dass die OPs es toll finden wenn sie eine Frage stellen und die Inbox wird mit sinnlosem Gedöns zugeschossen.",
            "hallo Mods,\n\nwie wäre es, den Posts einen Gelöst/Ungelöst Flair zu verleihen, wie das in anderen ähnlichen Subs auch der Fall ist?",
            "In letzter Zeit haben die „wie viel ist das Nippes Erbe meiner Oma wert?“-threads in meiner Wahrnehmung sehr zugenommen. Nach meinem Verständnis war es ja ursprünglich nicht als bares für rares expertenschätzung gedacht? Könnt ihr die Community dahingehend klar positionieren? (Klar erlauben/unterbinden).",
            "Danke an die Mods für die Zeit und Mühen die sie hier reinstecken! Ist ein gut gepflegtes Forum! ",
            "Kann man die ewig lange AutoMod-Nachricht nicht auf das Wichtigste verkürzen und den unnötigen \"Danke für deinen Beitrag blabla\"-Schmarn daraus entfernen?   \nOder alternativ die Nachricht als PN an den OP schicken, so wie es andere Subs auch machen?",
            "Kann man über bestimmte Themen auch mal was Fragen? Wie z.b. über Gesetz?",
            "Der gemeinte Sub ist r/whatisthisthing oder?",
            "zum beispiel wenn in deinem haus was komisch ist schickste bild hier rein und frachst wieso dit so ist.",
            "Danke für den Input, das ist mit sofortiger Wirkung umgesetzt.\n\nAb sofort ändert sich das Flair zu \"Gelöst\", wenn man als OP in Großbuchstaben \"GELÖST\" auf seinen eigenen Post antwortet.",
            "Wirklich zufrieden bin ich mit der aktuellen Nachricht in der Tat nicht. Dein Vorschlag ist gut, ich muss mich aber mal reinfuchsen, wie das technisch umzusetzen ist.\n\nEdit: Ist inzwischen umgesetzt."
        ]
    },
    "Für alle Interessierten und Freunde der Münzen-Posts auf diesem Subreddit: /r/Muenzen hat seine Pforten wieder geöffnet. Wer sich für das Sammeln, Handeln oder Identifizieren von Münzen interessiert, ist dort ab sofort herzlich willkommen.": {
        "title": "Für alle Interessierten und Freunde der Münzen-Posts auf diesem Subreddit: /r/Muenzen hat seine Pforten wieder geöffnet. Wer sich für das Sammeln, Handeln oder Identifizieren von Münzen interessiert, ist dort ab sofort herzlich willkommen.",
        "score": 19,
        "url": "https://www.reddit.com/r/Muenzen",
        "content": "",
        "num_comments": 2,
        "comments": [
            "r/Muenzen"
        ]
    },
    "Warum haben Läufer den Schlitz an der oberen Seite? ": {
        "title": "Warum haben Läufer den Schlitz an der oberen Seite? ",
        "score": 635,
        "url": "https://i.redd.it/sbnwtf8ubc9d1.jpeg",
        "content": "",
        "num_comments": 165,
        "comments": [
            "Der Läufer im Schachspiel hat am oberen Teil einen Schlitz, weil dies eine stilisierte Darstellung der Mitra, einer Kopfbedeckung von Bischöfen, ist. Der Läufer wird auf Englisch \"bishop\" genannt, und die Mitra ist eine hohe, geteilte Kappe, die typischerweise von christlichen Bischöfen getragen wird. Der Schlitz symbolisiert diese geteilte Form der Mitra und ist ein traditionelles Element im Design des Läufers, das seine Herkunft und symbolische Bedeutung widerspiegelt.",
            "Im Englischen heißt die Figura ja Bishop. Vielleicht soll das an die Mütze eines Bischofs erinnern?",
            "Und ich dachte immer, da kommt ein Stück Papier rein um die zweite Dame zu kennzeichnen, wenn der Bauer auf die gegnerische Grundlinie durchgekommen ist.",
            "Für mich ist das ein Mund und die Kugel die Nase und ich werde mir nichts anderes erklären lassen.",
            "Ich dachte das wäre ein Sicht-Schlitz wie bei einem Ritter Helm 😭",
            "Weil wenn er unten wäre, wäre es meistens eine Läuferin...",
            "Ich vermute ja, das ist dafür da die UNO Reverse Card einzustecken, aber bin mir unsicher",
            "Na, wenn der Schlitz unten wäre, wärst die Dame.",
            "Bischöfe haben Mitra als Kopfbedeckung",
            "Ich dachte der hat einen schrägen Schlitz um zu zeigen dass er nur schräg gegen darf. Der Turm hat gerade Zacken und das Pferd ist leicht gebogen."
        ]
    },
    "Unbekanntes Päckchen erhalten mit merkwürdigem Inhalt.": {
        "title": "Unbekanntes Päckchen erhalten mit merkwürdigem Inhalt.",
        "score": 22,
        "url": "https://i.redd.it/4csafovcch9d1.jpeg",
        "content": "Hab heute ein ziemlich merkwürdiges Päckchen eines mir unbekannten Absenders erhalten. \nInhalt ist eine Maske und zwei so Ringe für Schlüsselanhänger. \n\nIch kann mir absolut keinen Reim drauf bilden was das soll und woher es kommt. \n\nJemand sowas schonmal erlebt?",
        "num_comments": 25,
        "comments": [
            "Könnte sich um sogenanntes Brushing handeln. Dabei sendet ein Amazon Händler günstige bereits bezahlte Waren an wildfremde Leute und schreibt danach selbst die Rezensionen um sein Profil aufzupolieren.",
            "Versand-Label im Umschlagzentrum vertauscht.\n\nIrgendwo in China wird der ganze Kram zusammengeführt, evt. umverpackt, dabei sind wahrscheinlich die beiden Label vertauscht worden.",
            "Anstatt es entsorgen zu lassen ist es günstiger die Sachen einfach an Leute zu schicken",
            "Allerhand Videos auf YouTube wo Wish getestet wurde bezeugen, dass es nicht selten ist, dass man oft nicht das erhält, was man bestellt hat.",
            "Manchmal schicken Händler ihre Restposten an wildfremde Leute. Sei wohl manchmal billiger so, als die Ware vernichtet bzw entsorgen zu lassen",
            "Deine Daten wurden an einen fernöstlichen Shop (Wish oder was anderes) verkauft und dieser entleert sein Lager bei dir",
            "Three dimensional stuff from DR. Who? Ich will auch sone Lieferung!",
            "Oder ne absicht fehltgeleitete Rücksendung an eine deutsche Adresse um sich die versandkosten nach China zu sparen.",
            "Würde ich auch ganz stark vermuten hier!",
            "Das einzige Paket welches ich erwarte aber bisher nicht ankam wäre ein Fake Nationalmannschaftstrikot welches ich vor ca nem Monat bestellt habe aus wish."
        ]
    },
    "Was ist das?": {
        "title": "Was ist das?",
        "score": 7,
        "url": "https://www.reddit.com/gallery/1dr83yh",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Hat dir der alte Chinese nicht gesagt, das du das niemals aufmachen darfst?\n\nwir sind verloren",
            "Das ist Metall, oder? Ein Spiritusbrenner?",
            "Bitte beachte, dass OP für seine Frage keinen [Spaß]-Tag verwendet hat. Spaßantworten sind daher untersagt und werden mit einem Ban geahndet.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WerWieWas) if you have any questions or concerns.*",
            "ich würde mal auf Zucker-Dose tippen.\n\ngibt es eine Gravur?\n\nsieht sehr interessant aus!",
            "Eine Öllampe?!",
            "Aschenbecher glaube"
        ]
    }
}