{
    "Was ist dieses Sub?": {
        "title": "Was ist dieses Sub?",
        "score": 59,
        "url": "https://www.reddit.com/r/WerWieWas/comments/umd3sv/was_ist_dieses_sub/",
        "content": "Hier soll ein Ort entstehen, an dem ihr in Zukunft Hilfe erhalten sollt, wenn ihr konkrete Fragen habt, bei denen ihr nicht mehr weiterwisst. Beispiele für mögliche Themen wären:\n\n* Wo ist dieses Foto von meinen Großeltern in den 60ern entstanden?\n\n* Was ist das für ein Insekt?\n\n* Was hat dieses Schild zu bedeuten?\n\n* Wie alt ist diese Landkarte?\n\n* Ich habe in den 90ern einen Zeichentrickfilm gesehen, in dem es um Löwen geht. Könnt ihr mir helfen, auf den Titel zu kommen?\n\n* Was bedeuten die Markierungen an dieser Hauswand?\n\nEs soll also eine Mischung aus englischsprachigen Subs wie /r/WhatsThisBug, /r/WhatsThisThing, /r/TipOfMyTongue o.ä. für den deutschsprachigen Raum entstehen, und ihr seid herzlich eingeladen, eure Fragen zu stellen oder anderen Fragestellern bei ihren Problemen zu helfen. \n\nIn diesem Sinne: Kommt in Scharen und werdet Teil dieser entstehenden Community!",
        "num_comments": 17,
        "comments": [
            "Können wir vielleicht die \"Spaßantworten\" unterbinden? Nur die wengisten sind witzig und und in den meisten Fällen einfach nur nervig weil man durch eine Flut von \"ich bin 40 und lustig\" Müll kramen muss um das zu finden was einen eigentlich interessiert.\n\nIch bezweifle auch dass die OPs es toll finden wenn sie eine Frage stellen und die Inbox wird mit sinnlosem Gedöns zugeschossen.",
            "hallo Mods,\n\nwie wäre es, den Posts einen Gelöst/Ungelöst Flair zu verleihen, wie das in anderen ähnlichen Subs auch der Fall ist?",
            "In letzter Zeit haben die „wie viel ist das Nippes Erbe meiner Oma wert?“-threads in meiner Wahrnehmung sehr zugenommen. Nach meinem Verständnis war es ja ursprünglich nicht als bares für rares expertenschätzung gedacht? Könnt ihr die Community dahingehend klar positionieren? (Klar erlauben/unterbinden).",
            "Danke an die Mods für die Zeit und Mühen die sie hier reinstecken! Ist ein gut gepflegtes Forum! ",
            "Kann man die ewig lange AutoMod-Nachricht nicht auf das Wichtigste verkürzen und den unnötigen \"Danke für deinen Beitrag blabla\"-Schmarn daraus entfernen?   \nOder alternativ die Nachricht als PN an den OP schicken, so wie es andere Subs auch machen?",
            "Kann man über bestimmte Themen auch mal was Fragen? Wie z.b. über Gesetz?",
            "Der gemeinte Sub ist r/whatisthisthing oder?",
            "zum beispiel wenn in deinem haus was komisch ist schickste bild hier rein und frachst wieso dit so ist.",
            "Hallo Mods, \n\nIch habe eben leider eine Tasse meiner Eltern kaputtgemacht, die ich gerne ersetzen würde. Leider weiß ich nicht, wo sie sie gekauft haben.\n\nHab die Tasse schon im englischsprachigen Subreddit r/helpmefind gepostet, da meine Eltern Sie aber definitiv in Deutschland gekauft haben, musste ich eben an diesen Subreddit denken.\n\nIst das hier der richtige Ort, um ein Foto davon zu posten? Würde ungern den Subreddit damit zuspammen, wenn das nicht der richtige Ort dafür ist. Danke schon mal im voraus für die Antwort!",
            "Genau dafür gibt's Regel 3:\n\n>  Respektiert, wenn OP keine Spaßantworten wünscht\n\n> Ihr habt als Frageersteller die Möglichkeit, eurer Frage ein [Serious], [Ernst] oder ähnliches voranzustellen. In diesem Fall zeigt ihr allen anderen, dass ihr nur ernste Antworten wünscht. Spaßantworten werden in diesem Fall durch die Moderation gelöscht, sobald sie gemeldet werden.\n\nIst die Frage entsprechend getaggt, werden Spaßantworten entfernt, ansonsten eben nicht. \n\nDie Lösung ist durch [einen Thread vor ein paar Monaten](/r/WerWieWas/comments/yma1pu/sollten_spa%C3%9Fantworten_teil_des_subs_sein_oder/) zustandegekommen, in dem ich nachgefragt habe und in dem sich mehr Leute *für* Spaßantworten aussprachen."
        ]
    },
    "Für alle Interessierten und Freunde der Münzen-Posts auf diesem Subreddit: /r/Muenzen hat seine Pforten wieder geöffnet. Wer sich für das Sammeln, Handeln oder Identifizieren von Münzen interessiert, ist dort ab sofort herzlich willkommen.": {
        "title": "Für alle Interessierten und Freunde der Münzen-Posts auf diesem Subreddit: /r/Muenzen hat seine Pforten wieder geöffnet. Wer sich für das Sammeln, Handeln oder Identifizieren von Münzen interessiert, ist dort ab sofort herzlich willkommen.",
        "score": 17,
        "url": "https://www.reddit.com/r/Muenzen",
        "content": "",
        "num_comments": 1,
        "comments": []
    },
    "Für was sind diese Betonkästen am Rand von Feldern?": {
        "title": "Für was sind diese Betonkästen am Rand von Feldern?",
        "score": 63,
        "url": "https://i.redd.it/di2d0zi1d38d1.jpeg",
        "content": "",
        "num_comments": 58,
        "comments": [
            "Bitte beachte, dass OP für seine Frage keinen [Spaß]-Tag verwendet hat. Spaßantworten sind daher untersagt und werden mit einem Ban geahndet.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WerWieWas) if you have any questions or concerns.*",
            "Beton Lichtschachtrahmen umfunktioniert zu einer kostengünstigen und haltbaren Sitzgelegenheit ohne Wartungskosten.",
            "das eine bank",
            "Eine wartungsfrei Sitzgelegenheit",
            "Die waren circa einen Meter Hoch, man musste schon etwas springen um sich drauf zu setzen, also nicht wirklich optimal als Bank geeignet. Ich habe ich sie an mehreren Feldern hier am Rand von Berlin gesehen.",
            "Diese „Betonkästen“ sind für Korb-Rucksäcke da gestellt. Ein vollgeladene Korb sollte man von Kaste einfach auf den Rücken nehmen.",
            "Notfall Schlafplätze für Suffköpfe die Nachts nur den halben Weg nach Hause schaffen.",
            "Ein Ruhstein (Ruhbank, Gruhe, Raststein). Darauf haben Lastenträger früher ihre Last abgelegt, um Pause zu machen. \n\n  \n\"Die erhaltenen Ruhsteine stammen überwiegend aus der Zeit zwischen dem 16. und dem 19. Jahrhundert, als Bauern, Knechte, Mägde, Boten, Hausierer oder Händler schwere Lasten noch mit Rückentragen oder auf dem Kopf beförderten\"  \n  \n[https://de.wikipedia.org/wiki/Ruhstein](https://de.wikipedia.org/wiki/Ruhstein)",
            "Bank",
            "Gelöst"
        ]
    },
    "Was kann ich dagegen tun?": {
        "title": "Was kann ich dagegen tun?",
        "score": 8,
        "url": "https://www.reddit.com/gallery/1dlswjw",
        "content": "Vielleicht gibt es ja ein lack oder so, muss nicht gut aussehen, muss nur wirken.",
        "num_comments": 45,
        "comments": [
            "Bitte beachte, dass OP für seine Frage keinen [Spaß]-Tag verwendet hat. Spaßantworten sind daher untersagt und werden mit einem Ban geahndet.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WerWieWas) if you have any questions or concerns.*",
            "Erfahrungsgemäß hilft da nur ein neuer Einschub. Wenn die Lackierung erst einmal so großflächig beschädigt und das Metall so stark verrosten ist, kriecht das Wasser sogar unter die noch bestehende Lackierung. Das kriegst du nie wieder gescheit hin, es wird nur kurzfristig halten. Ich würde recherchieren, ob es für deinen Geschirrspüler einen passenden Einschub zum Nachkaufen gibt.",
            "Ernsthaft? Das einzige was du da tun kannst, ist einen neuen Korb zu kaufen. Und das vor vielen Monaten. Das sieht doch nicht über Nacht so aus.",
            "Neuen Korb besorgen und dann jedesmal nach dem spülen den Deckel öffnen und offen lassen damit die feuchte Luft entweichen kann",
            "Du könntest das ganze Ding Sandstrahlen und dann einen neuen Lack aufbringen. Aber der Aufwand und die Kosten stehen in keinem Verhältnis zu einen neuen Korb.",
            "Neuen Korb kaufen.",
            "Das ist [pulverbeschichteter](https://de.wikipedia.org/wiki/Pulverbeschichten) Stahl. \n\n*Theoretisch* kann man alle gerissenen/losen Teile der Beschichtung entfernen, den Rost abbeizen, die Oberfläche komplett anschleifen oder sandstrahlen, das Ganze dann mehrfach mit 2K-PUR-Lack beschichten und hoffen, dass es wieder 'ne Weile hält.\n\n*Praktisch* sollte man - wenn sich's nicht um ein einmaliges Sammlerstück zum Preis eines Mittelklassewagens handelt und man auch nicht unter exzessivem Masochismus leidet - den Korb einfach zum Sperrmüll geben und sich einen neuen als Ersatzteil kaufen.",
            "Abschleifen nur grundieren und dann anschleifen dann neu lackieren aber das ist ein großer Aufwand",
            "Nichts mehr außer austauschen. Wenn du sofort bei dem ersten Rostpunkt was gemacht hättest, wäre das nicht nötig gewesen.",
            "Alleine die Vorstellung, dass die Lackierung an sämtlichen Messern, Gabeln, Löffeln und Trinkflaschen hängen geblieben ist und man sich die schön monatelang gegönnt hat 🤢"
        ]
    },
    "Kann das jemand übersetzen?": {
        "title": "Kann das jemand übersetzen?",
        "score": 6,
        "url": "https://www.reddit.com/gallery/1dltgq3",
        "content": "\nMeine Oma hat diese 2 Bilder bei sich hängen und würde gerne wissen, was darauf steht.\nSie ist großer Japan-Fan, ich weiß allerdings nicht ob es japanisch ist? \n\nIch hoffe die Gruppe werwiewas ist richtig, bin noch nicht so lange dabei🫣",
        "num_comments": 8,
        "comments": [
            "Bitte beachte, dass OP für seine Frage keinen [Spaß]-Tag verwendet hat. Spaßantworten sind daher untersagt und werden mit einem Ban geahndet.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WerWieWas) if you have any questions or concerns.*",
            "Ja, ChatGPT kann das:\n\n  \nLinke Seite: 地利不如人和 (dì lì bù rú rén hé) \"Geografische Vorteile sind weniger wertvoll als menschliche Harmonie.\"\n\nMittlere große Schrift: 和 (hé) \"Harmonie\"\n\nUnterschrift: 祝怀将 (zhù huái jiāng) Der Name des Künstlers oder eine Widmung.\n\nRechte Seite: 吉日 頌松碑 鄉樂 (jí rì sòng sōng bēi xiāng lè) \"Am Glückstag wird das Lied des Kieferndenkmals im Heimatdorf gesungen.\"\n\n甲戌三月 裴友章于天津 吉到 (jiǎ xū sān yuè, péi yǒu zhāng yú tiān jīn, jí dào) \"Im dritten Monat des Jahres des Hundes, Pei Youzhang in Tianjin, Glück erreicht.\"\n\n弘 (hóng) \"Wohlergehen\"\n\nOben rechts: Roter Stempel mit einer persönlichen Signatur oder einem Siegel des Künstlers.\n\nZusammengefasst betont die Kalligrafie den Wert der Harmonie und menschlichen Beziehungen über geografische oder materielle Vorteile und enthält eine Widmung oder Signatur des Künstlers Pei Youzhang aus Tianjin.",
            "/r/translator",
            "Google Übersetzer hat ne Bilder übersetzen Funktion.",
            "Wow! Vielen Dank!",
            "Hatte ich schon versucht, funktioniert leider hier nicht so wirklich",
            "Die 20$ für ChatGpt4-o machen sich manchmal bezahlt :-D Wobei ich natürlich nicht für die Richtigkeit garantieren kann. Aber klingt zumindest schlüssig.",
            "Oh und es soll chinesisch sein!"
        ]
    }
}