{
    "New Partner sub r/WGU_Accelerators": {
        "title": "New Partner sub r/WGU_Accelerators",
        "score": 58,
        "url": "https://www.reddit.com/r/WGU/comments/1dirtke/new_partner_sub_rwgu_accelerators/",
        "content": "https://preview.redd.it/rcjphu3u9c7d1.jpg?width=1024&format=pjpg&auto=webp&s=5047d28342e5efbb97dbd26af3f15d0a83978e54\n\nTeam,\n\nOne of the most common conflicts that the mods see on this sub is the frustration Accelerators and non-accelerators have with each other. While both kinds of students are moving towards their degrees, they each have very different approaches and goals.\n\nTo help with this, I have created a subreddit that is focused on accelerators. This is simply the first step, and that sub currently has very little structure. But while all of that is coming, I see no reason to not allow users to explore the space and kick the virtual tires.\n\nOne last note, acceleration is NOT the same as cheating. The new sub will focus on legitimate ways to accelerate and will not tolerate cheaters or those who cater to cheaters. I think most of the rules on this sub will migrate to the new sub with the possible exception of #6, but I have an idea as to how #6 could be made more helpful to new students.\n\nFinally, since we don't have any traffic on the sub yet, I will ask here for help with moderation duties on the new sub. If you think you want to help BUILD something, let me know. If your focus is on rules, removals, and bans, you may want to wait until the sub has been built. I need collaborators, not enforcers.\n\n/wgu\\_accelerators\n\n-Cheers!",
        "num_comments": 25,
        "comments": [
            "Sounds like a fantastic idea. It seems pretty necessary considering anytime someone mentions how they finished in 6 months they are downvoted to oblivion and/or treated poorly. It’ll be nice to not see so much negativity surrounding the accomplishments of our peers.",
            "Hey, great. Take all the S\\*phia people with you. That should eliminate most of the garbage posts.",
            "I followed the WGU Accelerators group on Facebook. Even though I start on July 1, just reading through the comments, I can see how it has been super helpful to so many. The more of these, the better.",
            "Is this really needed? Aside from the confetti posts, all the other type of posts apply to all students. ",
            "This is a great idea. Thanks so much for the addition.",
            "This sounds like a great idea and a source of information. I kinda thought the whole idea of WGU is to be able to take college in a different direction. Instead of sitting through a course load that is basically pre-determined you instead have the ability to modify and \"accelerate\" through the entire thing. I don't think any one person has all the answers for accelerating but as a collective of minds could very well have the answers or at least ideas. I could see this especially useful for new students. Biggest suggestion would be to ensure that users us that little search feature to see if the question has been asked before.",
            "Happy to help.",
            "Please let me know if I can be of assistance",
            "I’m on this subreddit a lot & i’d like to help with the new one",
            "I tried heading to the new sub but Reddit said there was not a sub with that name. Did it get closed or did I do something wrong?"
        ]
    },
    "Finally!": {
        "title": "Finally!",
        "score": 65,
        "url": "https://i.redd.it/h3lahwhjle9d1.jpeg",
        "content": "I transferred from a traditional brick and mortar school with under 20 CUs. Completed in 11 months with zero prior experience at 23 years old. Hopefully I can serve as motivation for others in a similar position. I remember how daunting the A+ core 1 exam was. I thought having no experience would make graduating impossible! This was by far the most academically challenging program I’ve ever completed (coming from 3 other colleges). I’m proud to finally have my confetti! ",
        "num_comments": 11,
        "comments": [
            "Congrats! Be very proud and take a moment to exhale.\n\nWhat are you doing next? Work? Masters? Disney World?",
            "Congrats. I still got -year left.",
            "Congratulations I also came from a brick and mortar",
            "Congrats! That's awesome. Same here, no experience. In my 2nd term, I am 50% done and struggling with Network+, lol. How you do it?",
            "Congrats!!",
            "I just got mine too! Go us!",
            "i am just now starting my journey and barely know what cybersecurity is yet but im about to be 23 and am transferring from a uni with 4 credits… you have just given me a major confidence boost!! Thank you 🫶🏽",
            "Ha! I’m actually trying to break into a field that is not related to my degree, though having a degree in general will be very beneficial to it.\n\nFirst, I may have a Diet Coke and some ice cream.",
            "Net+ was the hardest for me. For all of the triad certs I used a guy on youtube named “The Mad Instructor”. His videos are extremely underrated. He has an N10-008 series.",
            "What type of field if you don’t mind sharing?"
        ]
    },
    "Confetti Time!": {
        "title": "Confetti Time!",
        "score": 30,
        "url": "https://i.redd.it/fyica6hgze9d1.jpeg",
        "content": "After a long and stressful 5 and a half months, it's time for me to celebrate!",
        "num_comments": 5,
        "comments": [
            "Congratulations 🎊 👏🏻 💐 🥳!",
            "Congratulations! Did you transfer any credits over? What did you think about the cybersecurity program.",
            "Nice!",
            "Thank you so much!",
            "I transferred in 29 credits between prior completed courses from a community college and credit for already having my CISSP certification, so I only had to complete \\~ 76% of the program.\n\nI loved the cybersecurity program. For context, I am already in the profession as an Infosec Analyst with \\~7 years of SysAdmin and Helpdesk experience before that. The self-paced and proficiency based nature of WGU worked REALLY well with my schedule and my particular neurospicy-ness, so I was able to hyper-fixate on one course at a time and just knock them out.\n\nOne thing I had to keep mindful of is my perfectionism / always feeling under-prepared for exams thing. There were a couple of times where I started to over-think myself into a hole over not 100%-ing a practice exam or Pre-Assessment, etc."
        ]
    },
    "I’m finally done !!": {
        "title": "I’m finally done !!",
        "score": 22,
        "url": "https://i.redd.it/fzapcfb7bf9d1.jpeg",
        "content": "I can finally get some sleep before planning my next move in life!! Thank you fellow owls for all the motivation and help.",
        "num_comments": 3,
        "comments": [
            "Congrats!!!",
            "Congratulations!!",
            "Congratulations"
        ]
    },
    "I'm a little late posting, but I graduated!": {
        "title": "I'm a little late posting, but I graduated!",
        "score": 45,
        "url": "https://i.redd.it/1td9k280vd9d1.jpeg",
        "content": "I started WGU September 1st, 2023. \n\n\nI had a hell of a first term. My grandmother died on September 2nd. Yes, the day after I started. The next week I was subpoenaed to be a witness in a double homicide from an incident a few years back. There were a bunch of people involved so there was more than one trial, and I was in court multiple times over 6 months or so.\n\n \nAlthough I was overcome with anxiety from everything, I decided to not let it control me.\n\n\nI did 16 classes my first term and my final 6 the second term.(Transferred in 18 courses) \n\n\nI am self employed and really slacked on my job to focus on school. I dedicated atleast 30 hours per week to school. \n\n\nI put in for graduation on May 3rd and officially graduated on May 15th. I received my diploma 4 days after confirmation of my name and address.\n\n\nI'm proud to say that I passed all of my objective and performance assessments on the first try. That being said, I never received any awards for my work. I did all performance assessments to the rubric. I did not get fancy, just did what they asked.  \n\n\nI have journals full of notes as I opted to be old school and do hand written notes. I used quizlet for objective assessments a lot and used things like studoco for help with performance assessments if I wasn't sure what was being asked. \n\n\nI may go back for my masters, but I'm not sure yet. My term isn't officially over until the end of August, so I can't start now anyhow.\n\n\nI am grinding the daily points on the Owls nest to get a jacket or hoodie for myself. I used the easy 500 points for my blanket and have over 1550 points saved up. It was 2500 points for the $75 gift card, but I'm not sure if that is being changed since they just went through the email ordeal. I think the new stuff is supposed to be up on July 1st, so we will see. \n\n\nAnyhow, keep grinding y'all. You got this!",
        "num_comments": 6,
        "comments": [
            "Fuck yeah Brother/sister!",
            "Congratulations 👏👏👏🎉🎉🎉",
            "NOICE! \nYou did it! It’s a bitch and a half, but you did it!",
            "Congratulations, fellow night owl!!",
            "Congrats!!!!! \nI'm hoping to finish Finance Skills for Managers D076 and then my capstone before end of Aug! And I will finally be done too!!! Life can be tough but you have overcome!!! Go get em!",
            "And I honestly commented that without reading 🥲\n\nYou went through a lot of shit to get here. Job be damned (to a point), but you got your degree! Through whatever happened in the last year or so, you DID IT! That’s amazing! \n\nThere is an increase in pride for you in the universal energy! \nMagnificent"
        ]
    }
}