{
    "We're making some long-needed changes to the r/whatsthisbug guidelines": {
        "title": "We're making some long-needed changes to the r/whatsthisbug guidelines",
        "score": 145,
        "url": "https://www.reddit.com/r/whatsthisbug/comments/17yfakw/were_making_some_longneeded_changes_to_the/",
        "content": "Based on recent trends, we have made some changes and clarifications to our guidelines.\n\n**1: Do not post pictures of bites or stings.** There are lots of things - many of which are not bug-related - that can cause bumps, rashes, swelling, itching, or other marks on your skin. It is impossible to tell what caused them from a picture of the symptoms. Post pictures *of the bug only*. \n\n**2: Post _helpful_ responses only.** These are responses that will lead toward an accurate identification of the bug in question. Non-helpful responses clutter up the thread and OP's inbox, hindering OP's ability to get an actual answer because people see that the post already has comments and assume that it's been answered - or because they don't want to read through a page full of non-helpful responses to see if a real answer has been offered (or if it is correct). \n\n* Joke responses are not helpful. We are not opposed to occasional humor - but only when it is part of a more substantial answer. For example, \"*That's the Pokemon Caterpie!*\" is not helpful, but \"*That's the caterpillar of a swallowtail butterfly - one of the Papilio species. This is the real-life caterpillar that the Pokemon Caterpie was based on.*\" would be fine. \n\n* Intentionally incorrect answers are not helpful. \n\n* Repeating an ID that has already been established is not helpful. If OP has already been told that they have bed bugs, they do not need dozens of people to chime in saying \"That's a bed bug!\" hours or days later. \n\n* Comments mocking or ridiculing OP for not already knowing what kind of bug it is - or for submitting a common bug - are not helpful. These include things like \"Haven't you ever seen a cockroach before?\" or \"How does anyone not know what a tick looks like?\" or \"You should just Google what bed bugs look like.\" Keep in mind that the primary purpose of this sub is *to identify bugs for people.* That includes *all* bugs - however common.\n\n**3: Do not ask for or offer pest control advice** beyond basic removal or exclusion of the bug in question or links to reliable sources or related subs such as /r/pestcontrol, /r/gardening, or /r/Bedbugs. We are not a pest control subreddit. While we understand that people are only trying to help, some of the \"advice\" that has been offered in the past has ranged from totally unnecessary (exterminating a harmless or even beneficial bug simply for existing) to excessive or even dangerous (irresponsible or excessive use of pesticides or other toxic chemicals). \n\n**4: No medical or veterinary advice** beyond identifying dangers and linking to a reliable resource such as the CDC. Personal opinions and anecdotes will be removed.\n\n**5: Refrain from posting inflammatory or anti-bug rhetoric** like *\"WTF is this nightmare fuel?\"*, *\"Do I need to burn my house down?\"* or *\"What kind of demon is this?\"*",
        "num_comments": 46,
        "comments": [
            "Seems good! Hope you don’t mind if I ask some questions on what is considered a helpful answer? Think all of these classify, but wanted to double check to make sure.\n\n1. If someone has already answered correctly, but states they aren’t 100% sure of the ID, is a separate comment allowed or is a sub-comment agreeing with the ID more appropriate?\n\n2. Similar question. If you want to add on further information, such as if a species is invasive, potentially harmful, helpful or just general regional information, is a separate comment allowed to notify the OP, or is a sub-comment preferred?\n\n3. In threads from non-English speaking countries, are separate comments that state the regional name allowed if a Latin or English answer has already been given?",
            "We can still bug the OP for geographic location, right? /s",
            "On the common bugs, is it cool if I say \"you're one of today's lucky 10000, that's x\"? I've done that a few times on terrestrial arthropods. If it's too memey I understand. The line is a reference to an [xkcd comic](https://xkcd.com/1053/)",
            "Good rules. Thank you.",
            "Mods, please delete if inappropriate but unsure best place to post!\n\nI want to thank this sub for making me just *a little* more curious about bugs. The other day, I came upon a tiny spider and found myself chattering to it like one would a pet, which…….is not like me. Sure, I still don’t really like spiders – but my curiosity about the guy got me to move him instead of freaking out and squashing it!\n\n♥️",
            "Can we make it a rule that ID requests are photo only. My personal experience is video of a small moving insect really doesn’t lend itself to being identified.\n\nAt least with a photo, especially on a phone, can easily be zoomed to see more detail.",
            "What about pictures of plastic bugs or toys?",
            "Can I ask about a toy bug? They're toy beetles, but I want to know what they are.",
            "I'd like to post a pic for identification but don't know what to use to post. I'm new to reddit and only joined for help ID'ing an insect.",
            "I would prefer it if the rules were relaxed slightly once the bug has been identified correctly and the correct identification has enough upvotes. But that's up to you, these are good rules.\n\nI assume partial ID is also helpful? E.g. when I know something is a type of fly (but definitely not what species or subgroup) and definitely not a wasp, then I like to be able to say that."
        ]
    },
    "What are these and why are there billions in my yard this year?": {
        "title": "What are these and why are there billions in my yard this year?",
        "score": 219,
        "url": "https://i.redd.it/a8c7egjl3e9d1.jpeg",
        "content": "Central New Jersey, USA\n\nStrangely no spotted lantern flies but so many of these. The ones with the black backs I have seen before, but this year the red ones are newcomers and numerous",
        "num_comments": 53,
        "comments": [
            "Box Elder bugs. They're harmless but extremely annoying.",
            "The red ones are nymphs at various stages",
            "Chickens love them.",
            "We have those visit us every year.",
            "We got them in droves in northern Montana. Box Elder bugs. Funny enough, we lived right next to the town of Box Elder. They’re harmless and slow but annoying as heck. They entertained my cats whenever they snuck inside. I moved to Rapid City last fall, curious to see if we get them down here in the summer!",
            "I know they’re annoying but they look very cute and silly",
            "I kinda don’t mind them. First year I moved here there were tons and I had no idea what they were, but they don’t hurt me and don’t carry any diseases that can harm me so I prefer them to the ticks and assassin bugs.",
            "Currently dealing with them trying to get inside the house, they’re all over the yard and have invaded my shed.  There are a number of elder trees growing nearby, so there’s nothing to do but deal with them (sigh).",
            "Box elder bugs.  When I was in kindergarten we called them fire bugs and I thought their habitat was brick because I always found them on the old brick walls of my house and school, didn't know what they were till I was an adult.",
            "Boxelder bugs at various developmental stages, you must have had at least a couple different clutches. Been seeing a lot of requests for IDs on these guys lately too. They must have had a good time last summer!"
        ]
    },
    "Caterpillar with many heads?": {
        "title": "Caterpillar with many heads?",
        "score": 233,
        "url": "https://v.redd.it/8o0wg5f3cd9d1",
        "content": "What type of Caterpillar is this? I am located in Atlanta, Georgia USA.",
        "num_comments": 18,
        "comments": [
            "Found it. Harris Three Spot Moth caterpillar.  \n\n\nhttps://featuredcreature.com/meet-the-ugly-caterpillar-that-uses-old-dead-heads-as-weapons-and-cant-tell-its-butt-from-its-head/",
            "DON'T TOUCH IT!! those are the heads of its fallen enemies.  You may encur its wrath . 😆 lol",
            "Dave, you look like shit.",
            "I now have a new phobia. \n\nNo idea what it is, but it looks like it came out of my nightmares.",
            "just killed one of these in the elden ring dlc",
            "little dude moves like he's a puppeteered creature from an old horror movie",
            "I just heard about these from Hank Green!!",
            "whoa it looks apocalyptic! like it should only reside in a Mad Max movie",
            "Hail hydra",
            "Little dude is carrying his +3 mace!"
        ]
    },
    "On my neck in SW Florida": {
        "title": "On my neck in SW Florida",
        "score": 187,
        "url": "https://www.reddit.com/gallery/1dqtlvr",
        "content": "",
        "num_comments": 58,
        "comments": [
            " Looks like a head louse",
            "Bonus points for actually managing to provide a photo which isn't just a blurry blob!",
            "Yeah, you have lice, but what kind of phone do you have? Damn that zoom in is good.",
            "Other people have already said head louse... but DANG, you have a great camera on your phone! That's an incredibly clear picture.",
            "What phone camera is this? Sorry about the lice",
            "Lice 🙁",
            "You got lice homie",
            "You can get lice standing next to somebody there not hard to get you can pick em up anywhere, they wanna go home with you and stay awhile long enough for you to have to wash everything you have come in contact with if you have kids you might as well go to laundromat go early so they've got plenty of hot water (your going to need it) vacume everything in house wipe it all down with hot hot bleach water go to drugstore first tho get that outta the way and don't forget your car!! It's the same old game we all have to play don't feel alone you'll get rid of them eventually, and you'll have a spotless house after all the fun you've just had , so go ahead get that case of beer you been wanting and relax! Enjoy.",
            "Rather have headlice than a bedbug! Much easier fix lol",
            "What phone do u have?!"
        ]
    },
    "What the heck?": {
        "title": "What the heck?",
        "score": 281,
        "url": "https://www.reddit.com/gallery/1dqk7bh",
        "content": "Northern Minnesota. I basically pooped my pants when it decided to fly away finally it’s so much scarier when it’s flying towards your head..",
        "num_comments": 38,
        "comments": [
            "Ichneumonidae parasitic wasp - believe it or not that is some tree's very best friend.  \n\nThat huge 'tail' is an ovipositor, she will drill it into some bark and lay eggs near some caterpillars feeding on the tree under the bark.  \n\nHer larvae will then do horror movie shit to them.\n\nI have read some fascinating studies that state some trees even call these wasps with pheromones when they're under attack from said caterpillars.\n\nWait I'm sure I can find one -  here you go\n\nhttps://www.uni-jena.de/en/111452/220119-baumhilferufe",
            "It looks like a giant ichneumon wasp. Just from the tail. \n\nI am a biologist and I saw an image of this years ago but it was more reddish. It is absolutely freaky. Not a bug girl 🤢\n\nI remember them from parasitology—I believe they are parasitoids. Hopefully any redditors will correct me if I am wrong as I am more versed in Florida environments. \n\nThey aren’t dangerous to humans but man do they leave an impression.",
            "Holy CRAP that is a giant ovipositor… all the better to stick into trees with. To parasitoid a tree eating grub.",
            "I can see the \"What the heck?\"  expression on OP's face in the reflection 🤣 Love it.",
            "The fear on your face speaks volumes 😭",
            "that is a LONG ASS ovipositor",
            "The look of absolute fear on your face is incredible",
            "Ichneumon💞 I love them even made a subreddit about them",
            "See? You just never know what bug you might find. And some people call me crazy for always wearing two pairs of pants..",
            "That’s Greg. He’s into sounding."
        ]
    }
}