{
    "The r/TraceAnObject subreddit exists to identify objects to help solve child abuse cases. The FBI has recently released some new cases. Please see if you can help.": {
        "title": "The r/TraceAnObject subreddit exists to identify objects to help solve child abuse cases. The FBI has recently released some new cases. Please see if you can help.",
        "score": 57,
        "url": "https://www.reddit.com/r/TraceAnObject/",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Please go to the [General Discussion Thread](https://www.reddit.com/r/TraceAnObject/about/sticky) there for any questions or concerns.  \n\nThe recent FBI cases have a thread there and other individual cases from other organizations each have a thread where they can be discussed."
        ]
    },
    "Small brass threaded capsule found in 14 year old’s laundry.": {
        "title": "Small brass threaded capsule found in 14 year old’s laundry.",
        "score": 5917,
        "url": "https://i.redd.it/06v410fo1d9d1.jpeg",
        "content": "Hi all. Long time follower, first time asking for help. This was found in the laundry basket after he came back home from a weekend away. We are both completely stumped, but he says he has no idea where it came from.\n\nIt threads pretty tight, and I’m assuming it seals. Doesn’t weigh much and the cavity seems to be too small to hold much of anything. \n\nAny help or ideas would be much appreciated. \n\nThanks in advance.  ",
        "num_comments": 264,
        "comments": [
            "are the end that aren't threaded open in any way?\n\nit kind of looks like a screw together jewelry catch.",
            "Could hold ashes, geocaching notes, small pills, or any other item you want to keep contained and dry. Looks like something I’d pick up as a kid and throw in my pocket then forget about.",
            "I received one like this years ago. I think the sender said it was called a wish capsule. A small strip of paper with a brief message written on it was rolled up to fit within.",
            "If this was for drugs you would not have found it. I sense that's your worry.",
            "I had something like this on my dog's collar. It contained a rolled up paper of contact info.",
            "I have you tried asking your 14 year old or are you just thinking the worst?",
            "For what it's worth it seems like it's not obvious paraphernalia or anything sinister. If the teen says they dont know where it's from I think I would be inclined to err on the side of not worrying about it. If in fact you were worried, usually with 'what's this thing I found in my teens bag/room/clothes' type posts there's an element of suspicion. And rightly so, teens are prone to test boundaries. But maybe that's not the case here and you are just curious. In any event, it's pretty cool. When I was a kid I was obsessed with little containers.",
            "Could be used as a container for geocaching. Since it also seals what is inside. Geocaching uses different boxes to be hidden on places others have to find it. This looks like a mini cache…",
            "Looks like the kind of thing you'd attach to a cat collar. Would contain a rolled up piece of paper with the owners name and phone number on it.",
            "It could have been used as a geocaching nano container."
        ]
    },
    "Black And Grey Thigh Chain Between 2 Water Athletes": {
        "title": "Black And Grey Thigh Chain Between 2 Water Athletes",
        "score": 2072,
        "url": "https://i.redd.it/d8b0jucbt89d1.png",
        "content": "Found on Bumble (wasn't going to match anyway). There was no bio so I don't know what sport it could be. ",
        "num_comments": 93,
        "comments": [
            "Probably a guide rope for a para-swimming comp with a blind athlete and a sighted chaperone",
            "My title describe the thing. \nFound on bumble. There wasn't a bio so I don't know what sport it could be.",
            "A friend of mine is a guide for a para-cyclist, they race in tandem on velodromes. Afaik, in cycling these guides are not allowed to participate in professional sports, so that no one would attribute the para-athlete's achievements to them.",
            "Solved! Thanks a lot, he did say that he valued disability rights, but I wasn't sure if it was linked.",
            "I'm attending the Paralympics in Paris this September, I'll have to look out for these!\n\n(Seriously, even aside from the fact that Paralympic sports are awesome, tickets are much cheaper and the place is less crowded.)",
            "Why is it on the leg instead of the torso?",
            "Used to see a blind skier with a guide at Jay Peak. \n\n(Made my first successful little pop 180 because I wasn't paying attention and almost took out the guide. Man, I was a menace when I first started riding lol)",
            "I’ve also seen people wear these in competitive swimming during a biathalon for teams of 2.",
            "Perhaps OP wasn't sure if they were divers, swimmers or water polo players.",
            "I swim five miles a week but don't consider myself an athlete.  also, from etymonline: \"competitor in athletic games and contests,\" from Latin athleta \"a wrestler, athlete, combatant in public games,\" from Greek athlētēs \"prizefighter, contestant in the games,\" agent noun from athlein \"to contest for a prize,\" which from athlos \"a contest,\" especially for a prize (its neuter form, athlon, meant \"the prize of a contest\"), a word of unknown origin."
        ]
    },
    "Heavy, iron item found in buried in an old field in VA. Chain is unique (almost braided?)": {
        "title": "Heavy, iron item found in buried in an old field in VA. Chain is unique (almost braided?)",
        "score": 49,
        "url": "https://i.redd.it/pdxqmwdine9d1.jpeg",
        "content": "",
        "num_comments": 15,
        "comments": [
            "Looks like a long eye bolt attached to a piece of chain.\n\nThe chain style is not uncommon, I think they are called curb links. Often seen on dog leashes, dog collars and jewelry chains.",
            "Similar to a Cuban link used in jewelry.",
            "I'm going to say it was for use with a horse/mule and not a dog-stake. The chain links are twisted like a necklace to lie comfortably against skin.",
            "Could also have been a homemade tool used in the threshing and grain-refinement process.",
            "Title describes item - I didn't find any identifying markings or numbers.",
            "Looks a lot like a horse chain twitch used for control when applied to their nose",
            "That’s a drag that goes behind a grain drill when you’re sowing a field.",
            "I think someone kept horses in this field years ago so that would seem likely!",
            "Looks like a dog chain and broken stake to me.",
            "It reminds me of a bit for a horse bridal with a curb chain. They make them in a lot of different styles but I've seen plenty older ones with a straight bar plus curb chain. \n\nThere's not a left of the thing to say for sure but the width looks right.\n\nEdit: typo"
        ]
    },
    "What are these fabric strips glued to the asphalt? About 5-6” long": {
        "title": "What are these fabric strips glued to the asphalt? About 5-6” long",
        "score": 627,
        "url": "https://www.reddit.com/gallery/1dqfppc",
        "content": "",
        "num_comments": 46,
        "comments": [
            "Looks like the type of tape you use to fasten temporary speed measuring equipment",
            "My title describes the thing. Silvery fabric strips stuck to the road at an intersection.",
            "The tape that holds down the air counters for vehicles. 1 is usually for cars, 2 for bikes. Is someone doing a bike lane there?",
            "No, it simply counts the volume of traffic. We have radar, laser, photo cameras ( as in Europe) if we really need to know the speed of a vehicle.",
            "Adhesive strips for red carpet treatment",
            "I set traffic counters for the state of South Dakota. That's just road tape left from keeping the rubber hoses in place. Our counters use 2 tubes to classify vehicle types. Speed or weight across them are highly inaccurate because of wheel base and tire sizes. It uses axle distances to classify whether it's a car, semi, bus, etc. It is extremely sticky tape and will eventually degrade.",
            "It must be amazingly sticky, to stay on asphalt, in the elements.",
            "More likely for traffic counting rather than speed detection, but the premise of the tape doesn't change.",
            "100% this is what it was.",
            "Putting 2 of them next to each other like this allows you to measure the speed of the vehicle. Take the distance between them and divide by the time between the front axle hitting the first and second tubes. Using the order of compression between the two tubes allows you to determine the direction of the vehicle's motion.\n\nUsing one tube to measure speed isn't enough information as different vehicles have different wheelbase lengths."
        ]
    }
}