{
    "We're making some long-needed changes to the r/whatsthisbug guidelines": {
        "title": "We're making some long-needed changes to the r/whatsthisbug guidelines",
        "score": 143,
        "url": "https://www.reddit.com/r/whatsthisbug/comments/17yfakw/were_making_some_longneeded_changes_to_the/",
        "content": "Based on recent trends, we have made some changes and clarifications to our guidelines.\n\n**1: Do not post pictures of bites or stings.** There are lots of things - many of which are not bug-related - that can cause bumps, rashes, swelling, itching, or other marks on your skin. It is impossible to tell what caused them from a picture of the symptoms. Post pictures *of the bug only*. \n\n**2: Post _helpful_ responses only.** These are responses that will lead toward an accurate identification of the bug in question. Non-helpful responses clutter up the thread and OP's inbox, hindering OP's ability to get an actual answer because people see that the post already has comments and assume that it's been answered - or because they don't want to read through a page full of non-helpful responses to see if a real answer has been offered (or if it is correct). \n\n* Joke responses are not helpful. We are not opposed to occasional humor - but only when it is part of a more substantial answer. For example, \"*That's the Pokemon Caterpie!*\" is not helpful, but \"*That's the caterpillar of a swallowtail butterfly - one of the Papilio species. This is the real-life caterpillar that the Pokemon Caterpie was based on.*\" would be fine. \n\n* Intentionally incorrect answers are not helpful. \n\n* Repeating an ID that has already been established is not helpful. If OP has already been told that they have bed bugs, they do not need dozens of people to chime in saying \"That's a bed bug!\" hours or days later. \n\n* Comments mocking or ridiculing OP for not already knowing what kind of bug it is - or for submitting a common bug - are not helpful. These include things like \"Haven't you ever seen a cockroach before?\" or \"How does anyone not know what a tick looks like?\" or \"You should just Google what bed bugs look like.\" Keep in mind that the primary purpose of this sub is *to identify bugs for people.* That includes *all* bugs - however common.\n\n**3: Do not ask for or offer pest control advice** beyond basic removal or exclusion of the bug in question or links to reliable sources or related subs such as /r/pestcontrol, /r/gardening, or /r/Bedbugs. We are not a pest control subreddit. While we understand that people are only trying to help, some of the \"advice\" that has been offered in the past has ranged from totally unnecessary (exterminating a harmless or even beneficial bug simply for existing) to excessive or even dangerous (irresponsible or excessive use of pesticides or other toxic chemicals). \n\n**4: No medical or veterinary advice** beyond identifying dangers and linking to a reliable resource such as the CDC. Personal opinions and anecdotes will be removed.\n\n**5: Refrain from posting inflammatory or anti-bug rhetoric** like *\"WTF is this nightmare fuel?\"*, *\"Do I need to burn my house down?\"* or *\"What kind of demon is this?\"*",
        "num_comments": 46,
        "comments": [
            "We can still bug the OP for geographic location, right? /s",
            "Can we make it a rule that ID requests are photo only. My personal experience is video of a small moving insect really doesn’t lend itself to being identified.\n\nAt least with a photo, especially on a phone, can easily be zoomed to see more detail.",
            "What about pictures of plastic bugs or toys?",
            "Can I ask about a toy bug? They're toy beetles, but I want to know what they are.",
            "I would prefer it if the rules were relaxed slightly once the bug has been identified correctly and the correct identification has enough upvotes. But that's up to you, these are good rules.\n\nI assume partial ID is also helpful? E.g. when I know something is a type of fly (but definitely not what species or subgroup) and definitely not a wasp, then I like to be able to say that.",
            "Can I post pictures of some eggs I found on my houseplants? They're not exactly bugs, but they're going to turn into bugs and I'd love some help identifying them!",
            "Yeah, that's fine. It's the other option - making fun of them for not knowing - that is not appropriate.",
            "In my experience it's a useful diagnostic criterion: with mites, way more posts are shaky, low-res videos than still photos. I hypothesize it's a kind of anti-memetic camouflage. However the acarologists have stopped returning my emails so this theory has yet to receive mainstream scientific attention.",
            "Yes, we get requests for those from time to time. Just be clear in your title that you know they are toys and you want to know what kind of beetles they represent. Otherwise you'll end up with a bunch of people telling you that they're toys or accusing you of trolling by trying to pass toy beetles off as real beetles.",
            "Of course! Bug eggs are welcome here! If you can specify what kind of plant you found them on, that is sometimes helpful in identifying them."
        ]
    },
    "Coughed this up after waking up": {
        "title": "Coughed this up after waking up",
        "score": 24,
        "url": "https://www.reddit.com/gallery/1drbpuz",
        "content": "What is this, should I be worried?",
        "num_comments": 22,
        "comments": [
            "I’m pretty sure that is a German cockroach. Where there’s one there’s more. Sorry that happened op that’s really gross. Good luck getting rid of them.",
            "You ~coughed~ this up?????? If you get the poopies you can blame it on him. They carry salmonella and ecoli. Good luck. 🤢",
            "Nah if that happend to me i would be taping my mouth sleeping and wear a mask 😭😭",
            "I woke up with an American one on my face trying to eat my eyebrow or something and thought that was bad idk how you are gonna get through this lmao",
            "That’s fucking gross is what that is.",
            "I’m so sorry this happened to you 🥲",
            "Welp, that's a new nightmare I'm sure I'll have.",
            "I would simply pass away. At least it’s not a lady so you don’t have to worry about an ootheca…",
            "Live in California if that helps narrow things down",
            "That’s a Germanian Cockroach 🪳"
        ]
    },
    "What are these and why are there billions in my yard this year?": {
        "title": "What are these and why are there billions in my yard this year?",
        "score": 397,
        "url": "https://i.redd.it/a8c7egjl3e9d1.jpeg",
        "content": "Central New Jersey, USA\n\nStrangely no spotted lantern flies but so many of these. The ones with the black backs I have seen before, but this year the red ones are newcomers and numerous",
        "num_comments": 76,
        "comments": [
            "Box Elder bugs. They're harmless but extremely annoying.",
            "The red ones are nymphs at various stages",
            "We have those visit us every year.",
            "We got them in droves in northern Montana. Box Elder bugs. Funny enough, we lived right next to the town of Box Elder. They’re harmless and slow but annoying as heck. They entertained my cats whenever they snuck inside. I moved to Rapid City last fall, curious to see if we get them down here in the summer!",
            "I know they’re annoying but they look very cute and silly",
            "I kinda don’t mind them. First year I moved here there were tons and I had no idea what they were, but they don’t hurt me and don’t carry any diseases that can harm me so I prefer them to the ticks and assassin bugs.",
            "Box elder bugs.  When I was in kindergarten we called them fire bugs and I thought their habitat was brick because I always found them on the old brick walls of my house and school, didn't know what they were till I was an adult.",
            "Boxelder bugs at various developmental stages, you must have had at least a couple different clutches. Been seeing a lot of requests for IDs on these guys lately too. They must have had a good time last summer!",
            "Currently dealing with them trying to get inside the house, they’re all over the yard and have invaded my shed.  There are a number of elder trees growing nearby, so there’s nothing to do but deal with them (sigh).",
            "Box elder bugs. Like others said, they are harmless. I much prefer them over the earwigs, stink bugs, and cicadas that swarm my house every year. The box elder bugs mostly stay outside, and the ones that do make it inside just hang out looking red and cool. My kids love collecting these bugs, so I let them live their lives."
        ]
    },
    "Who is dis lil weiner?": {
        "title": "Who is dis lil weiner?",
        "score": 47,
        "url": "https://v.redd.it/vmrbnupiyg9d1",
        "content": "Eastern Europe, aprox. 4cm long and very handsome.",
        "num_comments": 4,
        "comments": [
            "I gagged why is it so fleshy it looks like a moving finger",
            "Well it is made out of flesh. But I’d say it’s due to the color and texture, it’s wrinkly and sorta skin-colored.",
            "Lindenschwärmerraupe (Mimas tiliae)",
            "A hawk moth (Sphingidae) caterpillar; looks like Lime hawk moth [Mimas tiliae](https://en.wikipedia.org/wiki/Mimas_tiliae?wprov=sfti1#)"
        ]
    },
    "Central Texas - about 1” long, quarter for scale": {
        "title": "Central Texas - about 1” long, quarter for scale",
        "score": 17,
        "url": "https://i.redd.it/0pn3rwze7i9d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Looks like a Texas Ironclad Beetle.",
            "How’d you get the quarter to stick?",
            "Awww they’re cute. Apparently people frequently buy them as pets too? I googled the name and saw many “for sale” websites.",
            "Maybe it’s not on a wall",
            "It’s on the ground. What you were seeing on the left is not a gutter but rather the metal plate when you open the door. My last house had those same thresholds. They probably opened the door and to the right is the patio or first step outside.",
            "Looking at the right edge of the photo made me think otherwise.",
            "I can’t tell either. But it could possibly be like a concrete edge of a porch or something",
            "I want to think that.  With the gutter next to it makes it confusing.",
            "Good Christ it’s a window ledge",
            "It's an exterior door threshold. The black on the right edge is probably a doormat. This is how many a door to, say, the garage would be."
        ]
    }
}