{
    "WCGW throwing a bottle at the police in Berlin": {
        "title": "WCGW throwing a bottle at the police in Berlin",
        "score": 1210,
        "url": "https://v.redd.it/8svthudbd28d1",
        "content": "",
        "num_comments": 170,
        "comments": [
            "there is also a bottle deposit on the bottles...so no fun,",
            "There's a rule: You don't mess with German police. This guy learned it the hard way.",
            "Whoop whoop, it’s the sound of the police whopping your ass.",
            "“I fought the law and the law won”",
            "Cops in Europe do not need a gun to end you.",
            "At first a ordentliche respektschelle to pacify the situation 😁",
            "Don't fight the German police unless your a mud wizard",
            "As a Pole I'd like to pass on our deepest thanks for teaching this idiot how not to behave.",
            "Geez, Poland! \n\nYou don't see the Germans just going to your place and starting shit.",
            "In 2006, I was in Munich on a foreign exchange program during the World Cup that summer. \n\nI'll never forget the time we were by Marienplatz when we heard some breaking glass and a scuffle break out. A group of German police officers nearby very casually walk over, find the two fighting, rough them both up, then hog tie them. Then they proceeded to throw them in the back of the same police van next to each other and went back and stood where they were before like nothing happened. \n\nI always wondered the conversation between those two in the back of the van. It was still there an hour later on our way back to our house."
        ]
    },
    "A celeb fan gets caught on fire during celeb birthday celebration.": {
        "title": "A celeb fan gets caught on fire during celeb birthday celebration.",
        "score": 700,
        "url": "https://v.redd.it/vek5o8xa038d1",
        "content": "",
        "num_comments": 47,
        "comments": [
            "Yeah...let's put out the fire with flammable liquid.",
            "Did they try to drown out the fire with more alcohol?",
            "What tha.......we've been using fire for close to 1 million years and still can't get it right......",
            "Man this is some Looney Toons shit",
            "He wanted to be the candle so that Vijay would blow him on his birthday.",
            "Sssssmokin",
            "At least everyone gets free BBQ",
            "Did the brainiac try to extinguish the fire with alcohol?",
            "Wow the idiot who decided to put out fire with flammable liquid and causing way more damage.",
            "They polyester shirts all melted and fused to they skin 😳"
        ]
    },
    "WCGW sitting on a tiny stool": {
        "title": "WCGW sitting on a tiny stool",
        "score": 484,
        "url": "https://v.redd.it/g9b16kn8k38d1",
        "content": "",
        "num_comments": 51,
        "comments": [
            "Slipped and fell in the shower, doc, honest!",
            "He’s gonna be wearing pads for a little while.",
            "Yeah, as fun as this may seem: Anal injuries are shit! Regardless if a cut, puncture or burn (fireworks and alcohol..): The person is in for a very not fun time, and for quite a while.   \nNot speaking of personal experience, but read some reports from doctors about such injuries, made me want to wear armor on my ass, because the suffering with such shit is just fucked up.",
            "Watta gruesomme way to have ones' cherry popped!",
            "![gif](giphy|26hitDsIBhdXYyFdC)\n\nA million to one shot doc a million to one",
            "Buddy lost his virginity on the internet 💀",
            "One man one chair",
            "Better than s glass jar?",
            "stool meet stool",
            "I miss her 🥲"
        ]
    },
    "By not measuring the gap": {
        "title": "By not measuring the gap",
        "score": 189,
        "url": "https://v.redd.it/0hm63om3z18d1",
        "content": "",
        "num_comments": 15,
        "comments": [
            "How would measuring the gap have helped? Wasn't he intentionally trying to knock the horizontal panel down, and he did?",
            "Thank god, the fairy chimed in to the rescue immediately!!",
            "They didn't want that wall right?",
            "Measure your IQ first.",
            "All in all, you're just another brick in the wall.",
            "Nothing to do with measuring wrong...it's to do with common sense...if your taking a building down strat at the top...don't build a wall then smash the roof",
            "Take a second to check his face on the last second of the video, absolutely priceless",
            "Roll me over like Romeo, there you go",
            "Found the culprit\n\nhttps://preview.redd.it/aeq17i3zg48d1.jpeg?width=1170&format=pjpg&auto=webp&s=db5e16da48100d69a4a011b60b88064f2401a25f",
            "I question the veracity of 99% of the videos like this I see."
        ]
    },
    "Stealing a Mercedes and speeding away from police": {
        "title": "Stealing a Mercedes and speeding away from police",
        "score": 92,
        "url": "https://www.youtube.com/watch?v=1Jbd0tYtm4s",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Car theft is out of control now in Australia, but this was like an action movie",
            "Dude desperately fishing for a compliment from his girl.",
            "I love how they get out, run about 20m then casually walk like they think they will get away.",
            "Do these thick cunts serious think almost killing pedestrians is good driving.",
            "They remind me of the couple at the beginning of pulp fiction.",
            "She was very supportive I'll give her that.",
            "Try learning how to drive before stealing the next car",
            "Damn Ausies are really calm while stealing cars and talking cool while being criminals. 🤣😂😅",
            "They don't realize there's a cop on an unmarked bike following them. Not to mention polair watching from afar.",
            "We gots ourselves a regular modern day Bonnie & Clyde right here folks. What a pair of cunts."
        ]
    }
}