{
    "The State of Whenthe - An Announcement": {
        "title": "The State of Whenthe - An Announcement",
        "score": 4874,
        "url": "https://i.redd.it/4kewpwmatm4d1.gif",
        "content": "",
        "num_comments": 195,
        "comments": [
            "Hello, Whenthe :)\n\n\nIt’s me again, with the announcement I promised. But first, let me give a brief preface on the state of the sub and some of my thoughts regarding the place.\n\n\nIt’s been a hot minute since I last posted an announcement on here, hasn’t it? Really, it’s been a while since anything major has gone down.\n\n\nYes. I am wholeheartedly admitting that whenthe, like most other shitposting subs our size, has finally had the chance to take a breath of fresh air. It’s no secret that the sub’s been a little less active than usual, and to be honest, I don’t mind that whatsoever. Let me explain.\n\n\nThe problem with irony is its finicky ability to evolve into an unironic mess of hysteria with the slightest provocation. We’ve seen a lot of shit going on in the world lately, and it wouldn’t be the first time something like that has briefly affected this sub. Left on their own, places like these will often times completely devolve into brain rot and incoherent babbling the likes of which could make even a redditor uncomfortable. On whenthe, we’ve been lucky enough to have a relaxed community of people who aren’t looking for excuses to decapitate each other over the slightest disagreement without any need for diversion, really. In doing so, we’ve basically created an island of relative tranquility compared to the rest of the net.\n\n\n**Most content on the internet is rage bait or exposure farming.** I’ll ask you to read that sentence again, no matter how familiar you may be with the thought. When provided with a system where mindlessness contributes more to gaining viewers’ attention than a well thought out post, it’s simply more profitable to encourage incoherent bullshit than it is to put care into online interactions. The internet has largely ignored this problem, and with each coming day it grows closer and closer to biting us in the ass big time.\n\n\nThat is why I sincerely believe there are only two types of communities where knowledgeable discussion can fully take place: the most scholarly of web forums, and relaxed shitposting hellscapes. Toxicity always overruns the other types in the end, and whereas profit incentive keeps the first category of internet communities in check, the second gives zero shits about profit and instead is fostered by actual human beings who want the place to stay enjoyable.\n\n\nThe place is a little more dead. So what? It’ll be big again someday. Activity is a cycle, and typically subs go through periods of sedation anyways. And if it never does get as big as it once was? Who cares. We really do have a good thing going for us here (though I really don’t believe inactivity is going to be the case at all.)\n\n\n**Do what you will here.** Keep the place chill. Bring the lore back, cook up some new insane genre of reaction image in the comments and spread it all over this digital hellscape, or literally just enjoy yourself. Whatever you use the sub as, it’ll remain a good memory and a hub welcome to all, always. Just don’t violate the site TOS. It’s an online shitposting community, Socrates :P\n\n\n**Anyways, that’s the bulk of the post. Here’s the announcements. I’ll keep them brief.**\n\n\n- Mod application assessments are now resumed. Wannabe powermods will be fed to the swamp goblins. Just be yourself. There’s literally no required commitment anyways.\n\n- Stay away from active wars as the topics of memes. I applaud all of you for denying centrism, but let’s be civil here, even if a post might turn into a massive circlejerk. War is genuinely miserable and not a thing I would wish upon anyone.\n\n- Start a trend or smth I’m bored\n\n- Don’t actually feel pressured to do the last thing.\n\n\n“That’s it? That was the lost mod post? That was a bunch of pseudo-digital philosophical garbage and a check-in on the state of mod apps!”\n\n\nYes, dear redditor. That’s exactly what it is. \n\n\n**tl;dr Whenthe has fallen** (it hasn’t in the slightest.), billions must go outside or something\n\n\nEdit: enabled non-lethal PvP under posts where it is explicitly allowed. Initial wave of nerfs will be patched in soon. Healer classes stay winning.",
            "Oh thank god\n\nI was worried the sub was getting shut down for real this time",
            "https://i.redd.it/v8g7zqepvm4d1.gif\n\nWhenthe is not dead we just chillin’ for a bit.",
            "I DID read allat\n\nhttps://preview.redd.it/2te900sqxm4d1.jpeg?width=1170&format=pjpg&auto=webp&s=e2c31256a7fab14e0d3edb2d635a45d9324f3260\n\nyeah this sub is great, ty to the people here for being pretty cool",
            "This is totally worth missing my cult suicide pact",
            "Take this\n\nhttps://preview.redd.it/6duqo37qzm4d1.jpeg?width=1170&format=pjpg&auto=webp&s=5bb887fd56622b9f2c768086570a8dde1950a25b",
            "https://preview.redd.it/hrtofr0fwm4d1.jpeg?width=720&format=pjpg&auto=webp&s=051d2cef23674e4e1243b313a7ac0d811e28651d\n\nYeah yeah but would you drink a cup of coffee with the president of Mexico?",
            "https://preview.redd.it/78cls4vz0n4d1.png?width=827&format=png&auto=webp&s=7f1d8055210a6d66db566215910b3aacad9aa4f9\n\nHard photo for your troubles",
            "so, skimming through and paraphrasing, more mods to weed out rage/blatant engagement bait? sweet.\n\nwhenthe doing better than it was is good to hear. conga time.\n\nhttps://i.redd.it/jtr10l8xzm4d1.gif",
            "https://preview.redd.it/ln4uca3o3n4d1.jpeg?width=1125&format=pjpg&auto=webp&s=d9b7b50fceab03157ba64207148504d5acd7cec6\n\nmy genuine reaction when the (!) shitposter sub stays chill"
        ]
    },
    "based on accident": {
        "title": "based on accident",
        "score": 1945,
        "url": "https://v.redd.it/rz3zl8yta28d1",
        "content": "",
        "num_comments": 58,
        "comments": [
            "# [Download Video](https://redditsave.com/info?url=https://www.reddit.com/r/whenthe/comments/1dlopmk/based_on_accident/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/whenthe) if you have any questions or concerns.*",
            "This is actually inaccurate.  They knew.  They just thought it was mad funny.",
            "Wait pls Show me the artical I need to read this xD",
            "Accidentally created an icon",
            "Lebsian ✨",
            "Context?",
            "I believe this is the context if someone is wondering\n\nhttps://www.reddit.com/r/Metroid/comments/u2upbj/anyone_know_if_this_is_official_and_if_so_then/",
            "Reddit mobile is fucking weird again\n\nhttps://preview.redd.it/iig6pelhx28d1.jpeg?width=1125&format=pjpg&auto=webp&s=caef9ee1f999d7c2d59ec244d6da4cdbf705e87c\n\nEdit: for clarification, the weird part is the meme hiding behind the comments",
            "llesiban",
            "lesbian pride!!!!!!\n\nhttps://preview.redd.it/movl652e748d1.png?width=269&format=png&auto=webp&s=dfd1f3e6e61593ada84c5bcb8c6387a9c056c762"
        ]
    },
    "TF2 players doing what they love": {
        "title": "TF2 players doing what they love",
        "score": 2830,
        "url": "https://v.redd.it/i8y5vc12p08d1",
        "content": "",
        "num_comments": 77,
        "comments": [
            "# [Download Video](https://redditsave.com/info?url=https://www.reddit.com/r/whenthe/comments/1dlj0oo/tf2_players_doing_what_they_love/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/whenthe) if you have any questions or concerns.*",
            "these bot hosters want attention, they are about to receive all of the attention they could ask for in the worst way possible, by the slurs the bots spam over text and voice chat i don't think they are too fond of gay people",
            "&#x200B;\n\nhttps://preview.redd.it/z2zzib3vx08d1.png?width=640&format=png&auto=webp&s=d1343f8e54fd0d6d1aab676ed31828c05c540104",
            "&#x200B;\n\nhttps://preview.redd.it/idfsj7k7v18d1.png?width=320&format=png&auto=webp&s=71225ad2b211edebb217e8b44f61483aae07abd8",
            "It's what God would've wanted",
            "Uh what? What exactly is happening in that community this time?",
            "two ways to beat a troll:\n\n1 – starve them\n\n2 – assert dominance",
            "tf2 players have completely lost it",
            "Pornography has already breached our defenses....",
            "TF2 players doing what they love.\n\n  \nmen."
        ]
    },
    "Not that I do": {
        "title": "Not that I do",
        "score": 531,
        "url": "https://v.redd.it/ixouqihs738d1",
        "content": "",
        "num_comments": 24,
        "comments": [
            "# [Download Video](https://redditsave.com/info?url=https://www.reddit.com/r/whenthe/comments/1dlrcyy/not_that_i_do/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/whenthe) if you have any questions or concerns.*",
            "You’re not gonna believe this-",
            "Bro you literally told us it was illegally aquired",
            "What's the context of this gif?",
            "i have cyberpunk leaked source code but its probably gonna be confused with something else because Archive is called cp.7z because i didnt bother to rename it",
            "Me after I win a competition and the prize is getting arrested. (This is so exciting!)",
            "My dumb ass mixed up GB and TB again",
            "me with a pirated music collection of 140gb",
            "Rookie numbers",
            "\"Nuh uh\" won't save you this time OP\n\nhttps://preview.redd.it/26rcax6jz38d1.jpeg?width=236&format=pjpg&auto=webp&s=41ee4cb7a974cd9f72d905842e4d97c3e7d475e5"
        ]
    },
    "Who won?": {
        "title": "Who won?",
        "score": 2403,
        "url": "https://v.redd.it/tluh6nonu08d1",
        "content": "",
        "num_comments": 52,
        "comments": [
            "# [Download Video](https://redditsave.com/info?url=https://www.reddit.com/r/whenthe/comments/1dljkuc/who_won/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/whenthe) if you have any questions or concerns.*",
            "the irony of you using a transformers clip to show this. its obviously cool robots with guns.",
            "TRANSFORMERS ANIMATED MENTIONED what the FUCK is a 4TH SEASON 🔥🗣️🔥",
            "Ninja turtle reference????",
            "did beast boy make this post with the approval of micheal angelo?",
            "Trex solos. Mid diffs pizza. High diffs ninjas and video games. But still solos.",
            "transformers animated is peak media",
            "Ok guys. T.Rex its really cool carnivore.\n\nBut the Pachycephalosaurus its easiely a top 5 coolest herbivores. He just headbuts shit really hard man, c'mon",
            "Add also sports, aliens and movies.",
            "#WHO’S NEXT?"
        ]
    }
}