{
    "Monthly Discussion and Recommendation Thread": {
        "title": "Monthly Discussion and Recommendation Thread",
        "score": 11,
        "url": "https://www.reddit.com/r/wholesomeyuri/comments/1d5leo2/monthly_discussion_and_recommendation_thread/",
        "content": "Welcome to the r/WholesomeYuri monthly discussion and recommendation thread for this month!  Please remember that all the rules still apply, so format any spoilers. We now allow the use of Reddit's spoiler formatting but prefer the CSS method.\n\nCSS: `[visible text](#s \"text to be hidden\")`\n\nNative: `>!some spoiler!<`\n\nYou can find our [page of recommendations here](https://www.reddit.com/r/wholesomeyuri/wiki/recommendations).",
        "num_comments": 1,
        "comments": [
            "I'm failing to find this short comics I remember of Byleth and Edelgard, where El was uncomfortable having her wrists restrained in bed so they ended up holding hands instead (how scandalous). It was really soft and beautiful, if anyone knows where I could find it please let me know"
        ]
    },
    "(Updated) Good Posting Guide": {
        "title": "(Updated) Good Posting Guide",
        "score": 122,
        "url": "https://www.reddit.com/r/wholesomeyuri/wiki/posting_guide",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Happy Valentine's Day! Here's a little something to celebrate. We rewrote some things to make the guide more up-to-date. Just thought we might give attention to the fact that we do have a Good Posting Guide, something we've had since forever!\n\nDo note though that this is only a guide, not hard rules. We're only sharing it to give more clarity to the kind of content we accept here. And of course to help y'all out, regardless if you're an avid poster or a newcomer with a cute art to share.\n\nJust as important is the [**Post Flair Guide**](https://www.reddit.com/r/wholesomeyuri/wiki/flair) which we do in fact also have and now up-to-date! If you ever wondered what each flair *really* meant to be used for, it should all be there in the guide! Speaking of flairs, we are updating the flair colors in the next few days. They should look a bit nicer now.\n\nAlright, that's all for now.\n\n---\n\n**Edit: [New Post Flair colors are here!](https://i.imgur.com/iSI2BRV.jpg)**"
        ]
    },
    "[Childhood friends,Big Love] Confession": {
        "title": "[Childhood friends,Big Love] Confession",
        "score": 1219,
        "url": "https://www.reddit.com/gallery/1dr56q9",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Man these bitches gay, good for them",
            "They were even cuter when they first met again in high school (⁠T⁠T⁠)\nBeen giggling, kicking my feet, punching the air while reading this. I CAN'T get enough.",
            "Omg this gave me butterflies 🤭",
            "Omgg this is one of the cutest wholesome series ever ngl  I love them and this series",
            "It's cute when they officially are girlfriends and they do the same things they do together but wonder what should they do now is that's special to a couple",
            "Thanks, I had few plans today so now I can binge",
            "not op, but [sauce](https://mangadex.org/title/a6a9c19f-ccc5-44af-8bec-7da090220bd3/childhood-friend-big-love)\nchapters 45-47"
        ]
    },
    "Miorine and Sulettas [Witch from Mercury]": {
        "title": "Miorine and Sulettas [Witch from Mercury]",
        "score": 1487,
        "url": "https://i.redd.it/k2zhkijo7g9d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Miorine is drunk on the Tanuki wine, she's seeing...  \n\nQuintuple!",
            "I love Miorine's dress. The transparent over dress and white under dress is so ethereal and beautiful.",
            "“You look happy this morning! What did you dream about?”\n\n“Nothing, just… heaven.”",
            "she will have 5 twins now....\n\nthay much hand holding....\n\nam going to need  a drink and a cold shower after seeing this.",
            "love it :)",
            "Lovely",
            "We stan polyamory",
            "Source: [https://twitter.com/zzom\\_\\_B/status/1646506993501507584](https://twitter.com/zzom__B/status/1646506993501507584)"
        ]
    },
    "sharing sweets and kisses [Love Live!]": {
        "title": "sharing sweets and kisses [Love Live!]",
        "score": 726,
        "url": "https://v.redd.it/zjujowwnvg9d1",
        "content": "",
        "num_comments": 16,
        "comments": [
            "I need this in my life. Stop making me jealous.",
            "# i think this is love live? does anybody know the artist? its so cute!",
            "Could send me the source? Much obliged",
            "raw un cute lesbin ..... a 9 month later event",
            "I WILL upvote this post",
            "They're just really good friends sharing candy...so their hands don't get chocolate on them....yeah....that's what's going on. >.> <.<",
            "It was fun for me to be able to read that simple sentence as someone rather early in her Japanese language studies :p",
            "Hey, that's good progress! I'm done with the 2nd year of my Japanese studies at university now, although I have been learning the language since 2018. It's difficult, but very fun. Good luck!",
            "「どの味が一番好きですか？」\n\n\n\"Which flavour do you like the most?\"",
            "u/savevideo"
        ]
    }
}