{
    "Adequate Argument Contest Season 3 - Signups": {
        "title": "Adequate Argument Contest Season 3 - Signups",
        "score": 19,
        "url": "https://www.reddit.com/r/whowouldwin/comments/1dcltp2/adequate_argument_contest_season_3_signups/",
        "content": "#An open, multi-stage tag team tournament open to combatants from all corners of fiction!\n\n#Four characters enter! Only two will leave!\n\n#Do your faves have what it takes to make it all the way to the top?\n\n---\n\n#Adequate Argument Contest, Season 3 - Signups Open June 10 thru June 24\n\n---\n\n**Links:**\n\n* [Hypepost](https://redd.it/1daeesp) \n * [Reddit](https://redd.it/1daeesp)\n * [SB](https://forums.spacebattles.com/threads/adequate-argument-contest-season-3-hypepost-a-tag-team-character-versus-debate-contest.1168035/)\n\n* [Tiersetter Page](https://redd.it/1bzkuxk) \n\n* Signups\n * [Reddit](https://redd.it/1dcltp2)\n * [SB](https://forums.spacebattles.com/threads/adequate-argument-contest-season-3-signups-a-tag-team-character-versus-debate-contest.1168560/)\n\n---\n\n#What’s Going On?\n\nThis is a debate focused bracketed tournament where users pick characters to argue against other users to determine who would win, with a “Tiersetter” character functioning as a measuring stick for the acceptable “power level” of the tournament. You pick two characters, present your case why they win against your opponent's team, and a panel of judges determine who made the most persuasive argument to crown the victor. [See the hypepost here for more information.](https://redd.it/1daeesp)\n\n---\n#Signups:\n\nTo 'sign up', one need merely comment below with a team of fictional (or real, hell who knows!) characters that fit the guidelines stipulated hereafter.\n\nAll characters submitted must have a linked \"Respect Thread\" including all the scans/feats you intend to use in the debate. The [Respectthreads](https://www.reddit.com/r/respectthreads/wiki/index) forum has a large pre-existing list of these, but you may draw from any comprehensive equivalent or create one yourself. Vs Battles Wiki pages are not permissible substitutes.\n\nIf you intend to use scaling to other characters, you ought to also link the threads for them.\n\n**Characters submitted who are found to have misleading RTs that leave out too much without disclosing may be disqualified.**\n\nSimilarly, introducing too many new transformative feats not present in your linked signup will also be penalised. It's okay if you go and grab new supplemental stuff for ability interactions, etc. mid-tourney, but you shouldn't be presenting brand new feats that radically alter perception of your character's strength.\n\nNote: the death of the hosting website Gfycat has taken some popular RTs offline. I have personally backed up many of them and am in the process of reuploading them to alternate hosts. If there's a broken thread you'd like to use, just ask. Failing that, try the links in wayback machine.\n\n##Formatting:\n\n***AN IMPORTANT NOTE***\n\nTo sign-up, I will be requiring people submit their characters in the following format:\n\nCharacter | Series | Tier | Match-Up | Stipulations\n---|---|---|---|---\nCharacter | Series | Tier | Match Up | Stips\nCharacter | Series | Tier | Match Up | Stips\n\nFor non-RES users (cringe!) out there, this is the formatting:\n\n>Character | Tier | Series | Match-Up | Stipulations  \n\\---|---|---|---|---  \n|||||  \n|||||  \n\nSimply copy-paste the formatting above and submit your entrants in this format so I can save myself several hours of formatting everybody's stuff uniformly.\n\n##Tier:\n\nThe **Tier** category delineates whether the character is being submitted to [Cable or Deadpool tier.](https://redd.it/1bzkuxk) **You must submit one and only one character to each tier.**\n\n* Cable is a brawler armed with a rapid fire, long ranged heavy weapon that tears apart his enemies' bodies. He supplements his ability to provide fire support, [telekinetic ballistic shields](https://imgur.com/35wELW3) as cover, and intuitive telepathic tracking of his opponents.\n\n* Deadpool is an agile assassin who fights with unpredictable acrobatics wielding a blade that can [cleave through moderate amounts of metal.](https://imgur.com/oHIbjJl) He has a potent healing factor which allows him to fight recklessly through injuries, and [a long ranged teleporter that lets him scout the battlefield and freely reposition with his ally.](https://imgur.com/a/xG1wLab)\n\nThis tier is designed for characters who can [react to bullet](https://imgur.com/a/M94bZZ0) to [arrow-speed projectiles](https://imgur.com/a/mG363OE), bust [sizable holes through concrete with exertion](https://imgur.com/a/dJFMGFW), and endure similar impacts.\n\nMore than that, this tier is designed for teams that synergize well together in creative, effective, and unpredictable ways.\n\nThe two tiers are deliberately asymmetrical, with Deadpool as the more dangerous and mobile melee combatant while Cable is slower and less durable, but offers ranged support and telepathic tracking to enhance Deadpool's effectiveness. This dynamic should be reflective in team composition, with mixed support and offence taken into account.\n\n##Matchups:\n\nThe **Match-Up** category is where you delineate whether the character scores a Likely Victory, Unlikely Victory, or Draw in a fight against the chosen tiersetter.\n\n *  **Unlikely victory** means your character is definitely outgunned but can absolutely set up a victory through superior skill, tactics, or a hidden manoeuvre that is draining. Bullseye versus Daredevil is an unlikely victory for Bullseye, and Kanoh Agito vs Kuroki Gensai would be an unlikely victory for Kanoh that relies on the Dragonshot landing.\n\n *  **Draw** is self explanatory, 50/50. Captain America versus Batman with no gadgets, or Luffy versus Rob Lucci are good examples.\n\n *  **Likely victory** means your character is superior in most if not all aspects and can readily use those to win after a slightly extended fight. Superman versus Hal Jordan in-character is a likely victory for Supes, as would be Kenpachi Zaraki versus Ichigo Kurosaki in their first meeting after Ichigo learns to cut Kenpachi.\n\n**In addition to declaring your characters’ matchup vs the tiersetter, you will also need to briefly justify it in a few sentences.**\n\nFor example, a justification of a Draw for Captain America in Batman Tier could be “Batman is slightly weaker in physical categories, but a more agile and technical fighter. Captain America is slightly stronger, more durable, and has a powerful defensive tool with the shield, but Batman can get around it using his speed and skill.”\n\n**For this tournament you must not only provide a justification of your individual characters vs tiersetters in a 1v1, but a justification of your team against both tiersetters in a 2v2 match.**\n\nEx: \"My team of Captain America and Batman are a 50/50 **Draw** vs Cable and Deadpool, as both are comparable in strength, durability, and speed to the tiersetters. Cap's shield counters the tiersetters' guns, but is countered by Deadpool's teleportation. Batman's stealth lets him outmanoeuvre both the enemy team, but is countered by Cable's telepathy.\"\n\nFor the purposes of a default tiersetter match, assume the arena is [Waterton Lakes.](https://www.reddit.com/user/Proletlariet/comments/1bzkuxk/teleasshole_wip/l6nrq41/) Tiersetters start at Spawn A.\n\n**HOWEVER, note that OOT judgements will be determined on a case by case basis for the arena of the current match taking place.**\n\nDon’t think you can get away with arguing your Avatar Earthbender insta wins by causing a mass cave in on Metro just because the default match is an open air forest.\n\n##Stipulations:\n\nThe **Stipulations** category is for minor alterations to your character. This could include changes to their gear, powers, mindset, scaling, or sources used. The following are examples of reasonable stips:\n\n* The T-800, wielding a minigun.\n\n* Mace Windu, cannot use force-crush on opponents.\n\n* X-23, brainwashed and bloodlusted by Trigger 42.\n\n* Post-Crisis Batman, only feats from Year One.\n\nCertain conditional stipulations are also permissible to allow a character's environmentally limited abilities to function:\n\n* Firelord Ozai, Sozin's Comet is in the sky\n\nStipulations **CAN NOT** alter a characters’ stats directly (IE “Nerf strength to tier”) or change them or their loadout in ways that is not reflective of them in their source media (no giving Batman a lightsaber, no arbitrary 'Morals Off' stips without canonical basis).\n\nComposites are an allowable stip on a case by case basis. As a general rule of thumb, the most kosher composites will be versions of a character with the fewest debate-relevant contradictions to account for. IE: Compositing Anime & Manga versions of Goku is perfectly fine because they are essentially the same character, but compositing Paper Mario & Platformer Mario is not---the question of what a hybrid paper/meat body would be like is too messy.\n\n##DUPLICATE BAN:\n\nNo duplicates of the same character may be run. The exact definition of a duplicate may have to be determined on a case by case basis, but suffice to say any small alterations or simply different arcs for characters is not acceptable. You can run \"Savage Hulk\" and \"Grey Hulk\", or \"Post Crisis Superman\" and \"Pre-Crisis Superman,\" but not Saiyan Saga Goku and Namek Goku, or MCU Thanos from Endgame and MCU Thanos from Infinity War.\n\nThe person who made the feat thread for the character gets first dibs on claiming them **for the first 5 days** of signups.\n\n##OC BAN:\n\n***NO OC CHARACTERS CAN BE RAN BY THE PERSON WHO CREATED THEM! YOU MUST RUN CHARACTERS WHOSE CANON PORTRAYAL YOU YOURSELF CANNOT INFLUENCE DIRECTLY.***\n\n##SPECIAL RULE: Primary Combatants\n\nCombatants with summons, multiple bodies, mounts, riders, pets, etc. must have **one individual identified as the Primary Combatant in their signup post.** If the Primary Combatant is defeated, all entities submitted under the same slot vanish.\n\n##SPECIAL RULE: No Backups\n\n**THERE ARE** ***NO*** **BACKUP CHARACTERS FOR THIS TOURNEY. IF YOU GET OOT’D, TOO BAD.**\n\n##Example Characters:\n\n[Here are some example picks for the tier, including links to repositories of their feats.](https://docs.google.com/document/d/1ReDKxmZoA9AkDEocT0B9aAipjpYCJXo2ntBz2N-rnBo/edit?usp=sharing) \n\n#Rules:\n\n##Battle Rules:\n\n* Speed is not to be equalised in any respect for this tournament. A character's provable speed feats are what they will be entered and argued as.\n\n* Combatants spawn in aware that there are two opponents somewhere in the arena that they and their ally must defeat in order to progress.\n\n* All combatants are aware of the basics of their allies' combat abilities and may choose to communicate them in greater detail during the match, but are in the blind to that of their opponents (unless they have canon knowledge of them).\n\n* Combatants with minions, multiple bodies, mounts, riders, pets, etc. must have **one individual identified as the Primary Combatant in their signup post.** If the Primary Combatant is defeated, all entities submitted under the same slot vanish.\n\n* Victory is by either permanent death or incapacitation. Incapacitation is defined by an inability to continue fighting, whether unconscious, bound, immobilised, or too injured/exhausted to fight back. This condition must last for more than 12 full seconds without conscious maintenance from an opponent (so maintaining a wrestling hold for 12 seconds would not count as incap if the opponent could keep fighting if let go.) Voluntarily going to sleep doesn't count as an incap assuming a match is argued to last long enough for sleep to be necessary. Incapacitated opponents vanish from the arena. Corpses do not. **Combatants are aware of rules around victory conditions.**\n\n##General Map Rules:\n\n**Map Selection:**\n\nDefault round maps will be on a random elimination rotation, meaning Round 1’s map will be randomly selected between all seven, Round 2 will be rolled from the remaining six, and so on.\n\n**Map Vetoes:**\n\nAlternatively, instead of debating on the default map for the round, if both opponents agree, they may instead veto one map each and roll from the remaining options.\n\nVetoes may ONLY occur if both opponents agree to them.\n\n**Gentlemanning:**\n\nBoth opponents may unanimously agree to pick a specific map to debate on.\n\n#Veto or Gentleman map switches must be agreed upon and announced to judges prior to the debate's first posted response.\n\n**Map Features:**\n\n* Each team is given two physical maps of the current battlefield. The maps indicate a team’s own spawn location and include a compass along with instructions on how to use it. All text appears to the reader to be written in whatever their first language is a la Doctor Who \"Psychic Paper.\" Characters who cannot read, perceive, or understand the map (illiterate, blind, nonsentient, etc.) are instead implanted with a rough directional memory of where major landmarks are in relation to each other.\n\n* All maps are devoid of human beings but still populated by their usual wildlife unless otherwise specified.\n\n* As a general rule of thumb, maps include all objects you might reasonably expect to find in a given location. IE; in a [Vice City gun store](https://i.imgur.com/SrdwYMF.png) there are firearms and boxes of ammunition.\n\n* The exception to this are operational ground vehicles (cars, bikes, motorcycles, trains), all of which are absent. Non-functional vehicles such as [broken down trains](https://imgur.com/a/fwzqLkc) or [wrecked cars](https://i.imgur.com/R5ymzwt.png) are still present.\n\n* All sunlight present on the map will not inhibit vampires or other characters with an inherent weakness to the sun. It is as warm and bright as normal sunlight.\n\n* Whowouldwinium is a immovable, indestructible material that otherwise functions as the equivalent of whatever material it is replacing (EX concrete & steel lining in Metro tunnels). Abilities like ATLA Earthbending cannot reshape whowouldwinnium, but can generate [projectiles or protrusions from them as normal.](https://i.imgur.com/nOohUo7.mp4) Intangible/teleporting characters may pass through whowouldwinnium barriers **by themselves** (without passengers, willing or unwilling), but will be automatically disqualified by BFR if they do not return to the normally accessible part of the arena within 12 seconds.\n\n* All combatants are aware of the above conditions, as well as all map-specific information outlined below **EXCEPT FOR** the spawn locations of their opponents.\n\n##Map Specific Rules:\n\n* [Vice City, Florida](https://www.reddit.com/user/Proletlariet/comments/1bzkuxk/teleasshole_wip/l6nritq/)\n\n* [Waterton Lakes National Park](https://www.reddit.com/user/Proletlariet/comments/1bzkuxk/teleasshole_wip/l6nrq41/) \n\n* [Moscow Metro, Circa 2033](https://www.reddit.com/user/Proletlariet/comments/1bzkuxk/teleasshole_wip/l6nrqun/)\n\n* [Malé, Maldives](https://www.reddit.com/user/Proletlariet/comments/1bzkuxk/teleasshole_wip/l6k1oqk/)\n\n* [Pearl Skyscraper, Hong Kong](https://www.reddit.com/user/Proletlariet/comments/1bzkuxk/teleasshole_wip/l6npdfy/)\n\n* [Isla Nublar, Costa Rica](https://www.reddit.com/user/Proletlariet/comments/1bzkuxk/teleasshole_wip/l6npdyk/)\n\n* [Mystery Flesh Pit National Park](https://www.reddit.com/user/Proletlariet/comments/1bzkuxk/teleasshole_wip/l6eaw24/)\n\n##Debate Rules:\n\n* Rounds will last roughly 5 and a half days, hopefully from Monday until Saturday at noon of each week of the tourney; there is a 48 hour time limit both on starting (we do not care who starts, you and your opponent can figure that out) AND on responses, ***AND ADDITIONALLY*** each user MUST get in two responses or else be disqualified. If one user waits until the very last minute to force this rule to DQ their opponent without any forewarning to their opponents or the tournament supervisors, they will be removed from this tournament, no exceptions. If you need an extension, notify judges ahead of time.\n\n* Format for each round: the one to go first gets an Intro + 1st Response, their opponent replies in kind, then both get a 2nd response, then a 3rd response in a back-and-forth style, and a closing statement individual of one another that can be posted any time after both 3rd responses are complete. Each reponse has a 20k character limit, or two maximum length Reddit comments.\n\n * Intro posts cannot make any arguments comparing the poster’s team with the opponents’ characters. They are for outlining your characters’ feats, fighting styles, and tactics.\n\n * Closing statements cannot make any new arguments or bring up any feats or details not already mentioned in the debate. They are for summarising your points in the debate.\n\n* A character can be disqualified mid tourney if the opposing debater calls for an Out Of Tier (OOT) request.\n\n * OOT requests works by pinging the head judge (me) and explaining why the character has been **argued** as Out Of Tier by the opponent---meaning their odds against the tiersetter with presented interpretations of their feats are greater than a Likely Victory and it unreasonable to expect the TS to be able to score a win.\n\n * Each participant gets 2 OOT requests for the whole tournament. An OOT request is lost if they make a request and it fails to go through.\n\n* OOTs may be made against an individual character (EX: declaring that the Incredible Hulk is Out Of Tier in a 1v1 tiersetter fight against Cable) or against an entire team (EX: declaring that the combination of two characters’ abilities is too broken for the TS duo to combat, even if they are individually beatable.)\n\n* **All rounds for this tournament will be 2v2 team fights.**\n\nVictory in a debate will be determined by a majority vote of at least 2 out of 3 judges, though more may be brought in to decide a particularly contentious match.\n\nYour Judges Are:\n\n* /u/nkonrad\n\n* /u/joseph_stalin_\n\n* /u/British_Tea_Company\n\n* dargoo_faust\n * [SB](https://forums.spacebattles.com/members/dargoo-faust.406822/)\n * [Reddit](https://www.reddit.com/u/dargoo_faust)\n\n* Qawsedf234\n * [SB](https://forums.spacebattles.com/members/qawsedf234.410176/) \n * [Reddit](https://www.reddit.com/u/qawsedf234) \n\n* AbeLincoln1865\n * [SB](https://forums.spacebattles.com/members/abelincoln1865.514007/)\n * [Reddit](https://www.reddit.com/user/Analypiss)\n\n* [Guderian2nd](https://forums.spacebattles.com/members/guderian2nd.116487/) \n\n* And myself\n\n---\n\n#SIGNUPS END MONDAY JUNE 24. DON’T BE LATE!\n\n##Confused or have any questions? Leave a comment below or join [the official Character Rant Tournament Discord](https://discord.gg/evChxDgzwS) to write questions, complaints or suggestions for any facet of the tournament!",
        "num_comments": 76,
        "comments": [
            "# Team Wolverines\n\n|Character|Tier|Series|Match-Up|Stipulations|\n|:-|:-|:-|:-|:-|\n|Wolverine|Cable|[Marvel Madhouse](https://www.reddit.com/r/respectthreads/comments/l9w26s/respect_wolverine_marvel_anime_madhouse/)|Likely|N/A|\n|X-23|Deadpool|[Marvel 616](https://www.reddit.com/r/respectthreads/comments/68jxo6/respect_x23_marvel_616/)|Likely|[Armed with a handgun](https://imgur.com/4a3iImI)|\n\n**Match-Ups**\n\n* Wolverine: Logan has strong physicals and speed, with claws above what Cable can resist. He also has no means of fighting at range, with Cable's telepathy aiding in preemptively shooting Wolverine before he can close the distance. The blunt force aspect of Cable's bullets will be sufficient in staggering and hurting Logan. Cable wins if the fight is kept at range, and Wolverine wins if he can close the distance.\n* X-23: Laura has well-rounded physicals alongside regeneration to contend with Deadpool. While her claws could shred Wade, she is at a disadvantage in range. That combined with Deadpool's teleportation means that she'll struggle to land a meaningful hit on him, while Wade can win with decapitation.\n* 2v2: Right away, Logan and Laura are disadvantaged by the range superiority presented by Cable and Deadpool. Their senses can allow them to easily detect the tiersetters from a mile away, however, especially Deadpool, and their speed and mobility can help them close the distance. They're in trouble if Cable and Deadpool are able to keep their distance and continuously open fire on them, but if they can manage to close the distance, they'd likely win. Their chances at victory hinge entirely on whether they can get close enough, and Deadpool and Cable will make that a challenge for them.",
            "#[Team Still A Better Love Story Than Origin](https://www.youtube.com/watch?v=Z7rFBAGhvrM)\n\nCharacter | Tier | Series | Match-Up | Stipulations\n---|---|---|---|---\n| [Origin](https://old.reddit.com/r/ClericsConfidential/comments/1c06ygy/origin/)| Deadpool | [Origin](https://i.imgur.com/xBI23qS.jpeg)| Likely| [Origin 1.1](https://i.imgur.com/HZZrjig.png) with 1,250,000x intellect, fully repaired, before gaining emotions, with heat control, [his chapter 31 Atl-Atl+Katana, nano shoes, and backpack/laptop](https://i.imgur.com/i0HzfRh.png) [2](https://i.imgur.com/BThZaIS.png) the Exosuit, and Mini-Origin. Cannot turn anyone invisible. Winning the tournament fulfills \"Living Properly.\" [Has 3 200kg tungsten rods](https://i.imgur.com/BujhlSS.png).  Has 3 full refuels of glycogen and 2 emergency helium cooling packs. \n|[Edythe \"Femward\" Cullen](https://old.reddit.com/r/ClericsConfidential/comments/1cata5e/femward/)| Cable | [Twilight \\(Reimagined\\)](https://imgur.com/a/fVSaIQe) | Likely | No speed scaling to Edward Cullen or Bella Swan. Has her cellphone and a baseball. \n\n***\n\n* Origin is stronger, probably faster, and possibly more durable than Deadpool, however he lacks teleportation and must physically traverse distance to find him. [Origin's range](https://youtu.be/N-7gbWKbXbQ?t=132) is countered by this. Deadpool's sword [impacts damage meaningful to him.](https://youtu.be/BmtDZPyaVpc?t=824) While Deadpool is a worse melee fighter he also possesses [an extremely high functional endurance](https://youtu.be/N-7gbWKbXbQ?t=163). Impalement and range are unlikely to meaningfully impact Deadpool. While Origin can in theory quickly [win a melee fight](https://youtu.be/N-7gbWKbXbQ?t=104) he has to rely on pure physicals and reactions to counteract the teleportation. [Origin can detect Deadpool from a far distance](https://youtu.be/N-7gbWKbXbQ?t=67) but isn't able to stop him from teleporting without grappling him.\n\n* \"Origin 1.1\" means that Origin can use essentially all feats in the RT that aren't in the EoS Origin section and a few that are\n  * 1.25 million intelligence means he has the computational power of after chapter 68, but before Hirose Mai dies and he gains self awareness. \n  * Heat control means he has the ability to regulate his heat from this advanced intelligence.\n  *  His sword is his standard one as of chapter 31, his shoes allow him to root himself in place, and his bag has the device that functions as the exosuit.\n * The exosuit is the device used in feats marked with an X. Mini-Origin is a phone-bot that controls the device.\n\n***\n\n* [Femward](https://imgur.com/a/zvNhY27) ([Edythe](https://youtu.be/143GFLwm9Hk?t=254)) is [stronger](https://youtu.be/N-7gbWKbXbQ?t=138), faster, and possibly more durable than Cable, however short of throwing something she is a strictly melee fighter, Cable's gun impacts blunt damage meaningful to hurt her even if it doesn't pierce her and have an advantage [by the time she reaches grappling range](https://youtu.be/BmtDZPyaVpc?t=1036). Edythe is at a disadvantage because not only can Cable equalize the advantage of mind-reading, [he can block hers out, essentially depriving her of a major sense](https://youtu.be/N-7gbWKbXbQ?t=67). If cable detects her from 100 meters or greater, [he gets over 15 chances to shoot at her](https://youtu.be/BmtDZPyaVpc?t=414). While cable is a worse melee fighter he also possesses non-trivial endurance, his cybernetic arm means that he can interact with Edythe's fangs without either instantly being bitten through or poisoned. While Edythe can quickly win a melee fight, she's fighting two distinct disadvantages. While Edythe has better grappling, Cable is able to meaningfully fight back with maximum exertion. Edythe having anything (a vehicle, branch, boulder, etc) to throw at him doesn't change this much because of the psychic shield. Overall Edythe is being doubly deprived of her main advantages as compared to how she would interact with someone  with physicals like an unarmed Cable or a Cable without telepathy.\n\n    * No speed scaling means speed statements from Edward's perspective won't be applied. [Edythe has a cellphone that she uses throughout the book](https://i.imgur.com/p1u78e5.png) \n\n\n***\n\nEdythe and Origin together move and react faster than the tier, but still lack instant travel and Cable's rate of fire. \n\n***\n* [Twilight Scaling](https://old.reddit.com/r/respectthreads/comments/koh8xe/respect_edward_cullen_twilight/)\n *  [Bella](https://old.reddit.com/r/respectthreads/comments/qb218e/respect_bella_swan_twilight/)\n* [Origin Scaling](https://old.reddit.com/r/ClericsConfidential/comments/1aeaook/actual_rts_supplements/) \n * [Gon](https://old.reddit.com/r/respectthreads/comments/f9n7g0/respect_gon_origin/)\n * [Chronological RT](https://comicvine.gamespot.com/forums/gen-discussion-1/origin-respect-thread-2103798/)",
            "[Tsukasa Hojo and Hiromu Arakawa Present…](https://imgur.com/a/Btpn7uw)\n\n# [Hard and Harder](https://imgur.com/a/7YwKsVE)\n\nCharacter | Series | Tier | Match-up | Stipulations\n---|---|---|---|---\nRyo Saeba | City Hunter | Cable | Likely Victory | Soft-composite of the City Hunter manga, anime, and the recent extremely faithful live action Netflix movie. Believes that the enemy team has kidnapped Kaori and will kill her soon if he doesn’t defeat them. Ryo will start rounds wielding his signature .357 Magnum and a sniper rifle next to his Mini Cooper, which will contain various other weapons from his armory that he always has access to including rocket launchers, grenades, and whatever else is in the Gear section of his respect threads.\nGreed | Fullmetal Alchemist | Deadpool | Likely Victory | Manga, 2003 anime, and Brotherhood. Taken from the end of the series when he has merged with Ling Yao and is helping the Elric brothers stop Father. Greed will start the fight in control of Ling’s body but can pass control back to Ling whenever he desires.\n\n**Matchups**\n\nRyo is similar in strength and durability to Cable and a good deal faster physically. Add on top of that Ryo’s skill as a fighter compared to opponents with similar stats to him and Cable struggles a good deal at close range. Luckily both fighters favor mid-long ranged combat, where Cable fares a bit better. His barriers would stop Ryo’s shots and Ryo would get obliterated by a single shot of Cable’s guns. However, Ryo can still shoot just as accurately as normal while moving around and Cable struggles to hit moving targets, so it wouldn’t take long for Ryo to hit Cable by ricocheting a bullet past his shield or even through the hole Cable forms to fire his own weapons (which he would know is happening due to being able to sense killing intent or by seeing the muscles in Cable’s arm tense up).\n\nGreed is similar in speed to Deadpool thanks to scaling to King Bradley. His Ultimate Shield can protect him from any of Deadpool’s guns and swords, and his regeneration is on the same level as Deadpool’s own. His main weakness is that he tends to leave his head exposed which Deadpool can take advantage of using his teleportation belt and he cannot protect body parts that he is actively regenerating, leaving him open to repeated attacks from a particularly efficient/ruthless opponent. If Greed is getting out skilled by Deadpool, he can swap control to Ling who should be more than capable of matching DP.\n\nAs a duo, the pair should still fair decently well against Cable and Deadpool. Ling's ability to sense opponent's ki will limit the enemy team's ability to sneak up on them even with Deadpool's teleportation (Ryo sensing killing intent will serve a similar function and even allow Greed to avoid getting cheesed with a headshot). Greed can body block any shots from Cable's gun to protect Ryo (which he is more than fast enough to do) and Ryo offers a range option that Greed nor either fighter on the enemy team possess. Tldr, everything that applies to 1v1s still applies and they can cover for each other's weakensses.\n\n**Relevant Respect Threads**\n\nRyo Saeba \n* [Manga](https://old.reddit.com/r/respectthreads/comments/1cg9agp/respect_ryo_saeba_city_huntermanga/)\n* [Anime](https://old.reddit.com/r/respectthreads/comments/1cg9e2p/respect_ryo_saeba_city_hunteranime/)\n* [Netflix](https://old.reddit.com/r/respectthreads/comments/1dl8eyu/respect_ryo_saeba_netflixs_city_hunter/)\n\nGreed\n* [Manga/Brotherhood](https://old.reddit.com/r/respectthreads/comments/4kd6ah/respect_greedlinggreeling_fullmetal_alchemist/)\n* [2003 Anime](https://old.reddit.com/r/respectthreads/comments/fz7e9a/respect_greed_fullmetal_alchemist_2003/)\n\nKing Bradley\n* [Manga](https://old.reddit.com/r/respectthreads/comments/41cpmy/respect_f%C3%BChrer_king_bradley_fullmetal_alchemist/)\n\nPride\n* [Manga/Brotherhood](https://old.reddit.com/r/respectthreads/comments/3qophk/respect_pride_the_arrogant_fullmetal_alchemist/)\n\nEdward Elric\n* [Manga](https://old.reddit.com/r/respectthreads/comments/7dxdhp/respect_edward_elric_fullmetal_alchemist/)\n* [2003 Anime](https://old.reddit.com/r/respectthreads/comments/g47jc2/respect_edward_elric_fullmetal_alchemist_2003/)\n\nAlphonse Elric\n* [Manga](https://old.reddit.com/r/respectthreads/comments/omxt2s/respect_alphonse_elric_fullmetal_alchemist/)\n* [2003 Anime](https://old.reddit.com/r/respectthreads/comments/g4uxaa/respect_alphonse_elric_fullmetal_alchemist_2003/)\n\nOther\n* [Miscellaneous FMA Brotherhood Feats](https://old.reddit.com/user/Ultim8_Lifeform/comments/1difk2d/assorted_fmab_feats/)",
            "##**[Team: As They Made Me](https://imgur.com/a/oPxDyRf)**\n\n\nCharacter | Tier |Series | Match-Up | Stipulations\n---|---|---|---|---\nThe Midnighter|Deadpool |[DC]()/[Wildstorm](https://www.reddit.com/r/respectthreads/comments/b4f0hh/respect_midnighter_wildstorm/)|Unlikely Victory | Composite of Wildstorm and n52/Rebirth canons. Has dual pistols w/ enough ammo, bo staff and knives.\nThe Master Chief|Cable|[Halo]() | Draw| Is in MJOLNIR Mk VI MOD ( Promethean Vision plugin), and has Cortana (pre-Rampancy), frag grenades, Needilizer, Type-51 Carbine and a Binary Rifle. Has enough ammo/grenades as needed. Ignore game feats. \n\n\n##**Stip Explanation**\n\n* Midnighter - He's given basically regular gear, with the addition of two dual pistols he used during Superman's liberation of Warworld. Compositing the two similar, but different canons of Wildstorm and n52/Rebirth\n\n* Master Chief - Gives him the upgraded Mark VI MJOLNIR armor that he had during the early stages of Halo 4. Equips him with a frag grenades, needilizer,  Covenant Carbine , and a Forerunner Binary Rifle.\n\n\n\n##**Match Ups**\n\n* **Midnighter:** Midnighter's key weapon, his precog, is useless against forces of chaos like Deadpool, having failed against Joker in the past. Directly contrasting physicals Midnighter is magnitudes more durable (blunt),  faster and stronger, he however has piercing durability far below Deadpool's output, and Deadpool's teleportation is much more conducive to in-combat use than Midnighter's. \n\n\n* **Master Chief:** Cable has the edge at range, while Chief's firearms are unable to piercing Cable's TK barrier, Cable's bullets will deal relevant (blunt force) damage to Chief. In close range however, Chief holds a slight advantage. He is possibly faster than Cable, with comparable durability and striking strength. He however outpaces Cable in lifting strength, and has a notable endurance edge. Cortana outside of tactical support doesn't influence the match too much. \n\n* **Team:** Together Chief and Midnighter make an effective kill team, with high mobility and combat power. Many of their normal advantages however are undermined by the opposing TSer team. Midnighter's battle computer will be less than reliable due to Deadpool introducing a large X-factor. Similarly his door's tactical advantage is diminished since Deadpool can teleport and Cable can telepathically communicate/locate allies and foes. Chief's Binary Rifle does pose a significant threat to Deadpool, but Cable provides a competent counter to it. Cortana doesn't really provide any huge edge for my team.\n\n\n***\n##**Scaling**\n\n*  Midnighter:\n\n * [Nightwing](https://www.reddit.com/r/respectthreads/comments/6y3uci/respect_nightwing_dc_comics_new_52rebirth/)\n\n * [Zealot](https://www.reddit.com/r/respectthreads/comments/bcik1c/respect_zealot_wildstorm/)\n\n * [Swift](https://www.reddit.com/r/respectthreads/comments/b4ldit/respect_swift_wildstorm/)\n\n * [MMH](https://www.reddit.com/r/respectthreads/comments/lfp2co/respect_the_martian_manhunter_new_52rebirth/)\n\n* Master Chief\n\n * [Black Team](https://www.reddit.com/r/respectthreads/comments/gb3mlr/respect_spartan_black_team_halo/)\n\n * [Red Team](https://www.reddit.com/r/respectthreads/comments/gaijqj/respect_spartan_red_team_halo/)\n\n * [Gray Team](https://www.reddit.com/r/respectthreads/comments/gkkb1p/respect_spartan_gray_team_halo/)\n\n\n * [Spartan IVs](https://www.reddit.com/r/respectthreads/comments/j130cx/respect_the_spartan_ivs_halo/)\n\n * [Chief Supplement](https://www.reddit.com/r/respectthreads/comments/fbv3cr/respect_john117_the_master_chief_halo/)",
            "Team Wungus\n\nCharacter | Tier | Series | Match-Up | Stipulations |\n---|---|----|----|----\n[Kamihate](https://www.reddit.com/r/Birbin/comments/1disgs0/grog/?) | Deadpool | Sakamoto Days | Likely | \n[Aoi Todo](https://www.reddit.com/r/Birbin/comments/1disyfp/gongaga/?) | Cable | Jujutsu Kaisen | Likely | Vibra-Slap hand. Can use Boogie Woogie on his opponents and allies without Cursed Energy.\n\n##Justifications\n\n**Kamihate**\n\nKamihate can fight from extremely long ranges, and even in melee range is fairly quick, but is going to primarily rely on keeping his distance while trying to rapidly incapacitate Deadpool quicker than he can lock him down and teleport on top of him. Basically Kamihate can win by sufficiently damaging Deadpool enough that he can't escape from further shots and gets worn down by the bullets, but loses if Deadpool can track him down fast enough and get directly onto him with the teleporter.\n\n\n**Todo**\n\nHe slaps the thing and it vibrates and they switch like woooahhh. Todo doesn't have any capacity for dealing damage at a distance and by himself is far less capable of abusing the nature of his ability beyond being tricky to hit. In terms of raw stats Todo is probably somewhat higher than Cable, but lacks concrete speed and with his intentions being read via mind control will struggle to actively abuse the main aspect of his kit. Slightly stronger, but not nearly as enabled in a 1v1.\n\n**2v2**\n\nIn a 2v2, Cable's ability to passively scan his surroundings as well as inform Deadpool of Todo's intentions makes the strategy of those two considerably less effective. Finding Kamihate becomes much easier for Deadpool as well, and reaching them becomes trivial if Cable just informs Deadpool, their 2v2 strategy is extremely effective against exactly the teamwork that my team wants to pull off.",
            "|Character|Series|Tier|Match-Up|Stipulations|\n|:-|:-|:-|:-|:-|\n|[Mizu](https://www.reddit.com/r/respectthreads/s/2a20VofFsf)|Blue-Eye Samurai|Deadpool|Unlikely Victory|Uninjured, has her Sword|\n|[Skitter](https://www.reddit.com/r/respectthreads/s/JdfZUcNbyB)|Worm|Cable|Likely Victory|has her weaver armor, helmet, and nanothorn knife|\n\nExplanations:\n\nMizu holds a slight stat advantage over Deadpool and a roughly equal skill advantage- his regeneration makes the battle a hard fight for her, but, knowing Deadpool, she would figure out his swords could negate his regen, disarm him, and get a kill. She isn’t unbeatable, and loses more often than not, but her superior stats and stealth/combat skills make the match winnable\n\nSkitter’s talents hold up in a long-ranged battle. Swarm consciousness allows her to keep hidden from cable and protect herself while affording superior mobility, and her knife presents a wincon- cable might survive extended bug combat, but a good hit from the knife wins. Cable’s ability to track her and superior AP means that victory isn’t anywhere near certain, but she has a good chance\n\n2v2:\n\nIn this matchup, both of them have a significant advantage over the enemy team- stealth. Despite Cable's telepathy, his recon abilities (especially over a wide area) are massively inferior to Skitter's, and her swarm-mind might interfere with his telepathy to some extent. Mizu has normal, if very skillful, stealth abilities. The match begins and ends with Cable and Deadpool being utterly swarmed with insects, distracting and weakening them while Mizu arrives for the kill",
            "# Team:All in our head\n\n|Character|Series|Tier|Match-Up|Stipulations|\n|:-|:-|:-|:-|:-|\n||||||\n|Dreamer|DC Comics|Cable|Likely victory|Composite between the Comic and Show canons|\n|Moon Knight|Marvel Comics|Deadpool|Likely victory|Moon Knight during the 2014 run by Warren Ellis. Khonshu in Moon Knights head|\n\n# Stip explanation\n\n* Dreamer - Comic and show dreamer have extremely similar powers but show Dreamer has more experience and can do more with energy manipulation but comic dreamer is a bit stronger, they basically the same though.\n* Moon Knight - I decided to use 2014 Moon Knight because he has good gear in this era and a good enough relationship with Khonshu to ask him for stuff.  I'll still be using feats from before the 2014 run just nothing after. Khonshu is in his head because he was in the 2014 run, he can't do much for Moon Knight, heal him some, minor stat boost, etc. Moon Knight is the primary fighter tho, if he dies Khonshu gone.\n\n# Match ups\n\n* Dreamer: Dreamer is incredibly agile with her teleportation and her precognition, combined with her forcefields and energy manipulation she should be able to dodge Cables shots and eventually take him down. However Cable is much more physically capable, smarter, and has more gear than Dreamer, who also doesn't have much experience dodging bullets surprisingly, so he definitely could win.\n* Moon Knight: He already beat Deadpool in Vengeance of the Moon Knight (2009) #8 so he'd win more times than not. However Deadpool also consistently beats Punisher who usually goes relative to Moon Knight so Deadpool could also win.\n\n# Respect threads:\n\n* [Dreamer](https://www.reddit.com/user/Silver_Moon75/comments/1dat6ro/super_low_effort_dream_rt/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)\n* [Moon Knight](https://www.reddit.com/r/respectthreads/comments/3k3guy/respect_moon_knight/)\n* [Punisher](https://www.reddit.com/r/respectthreads/comments/5hsrop/respect_frank_castle_the_punisher_marvel_earth616/)\n* [Werewolf by night](https://comicvine.gamespot.com/forums/gen-discussion-1/werewolf-by-night-respect-thread-1831558/)\n* [Shadowland Daredevil](https://www.reddit.com/r/iridescence_stuff/comments/f5cz25/shadowland_dd/)\n* [Daredevil](https://www.reddit.com/r/respectthreads/comments/3boq2j/respect_daredevil_the_man_without_fear/)\n* [Deadpool](https://www.reddit.com/r/respectthreads/comments/ju2dbc/respect_deadpool_marvel_616/)\n* [Livewire](https://www.reddit.com/r/respectthreads/comments/tz2gfd/respect_livewire_dc_post_crisis/)",
            "#Ultimate Marvel VS DC 3\n\n\nCharacter | Tier |Series | Match-Up | Stipulations\n---|---|---|---|---\nLyra|Deadpool |[Marvel Comics](https://old.reddit.com/r/respectthreads/comments/kp63ab/respect_lyra_the_daughter_of_hulk_marvel_earth/)|Unlikely Victory | Has all gear listed in RT\nMirror Master|Cable|[DC Comics](https://old.reddit.com/r/respectthreads/comments/z5andl/respect_evan_mcculloch_mirror_master_dc_postcrisis/)|Unlikley Victory| Has all gear listed in RT, is being paid by Batman to win the tournament just as he was in [Rock of Ages](https://imgur.com/a/8ISd8TO)\n\n**Justifications**\n\n**Lyra:** [She-Hulk has stated explicitly she would be a goner in a fight against Deadpool](https://imgur.com/XjReDHS). Her rage debuff [dazes her in non-combat situations](https://imgur.com/dRZdOJN) and her [strength](https://imgur.com/a/50jCxF5) and durability become significantly diminished. Deadpool will easily be able to play a keepaway game and make her progressively weaker through quips and attacks until she goes down. She is still a threat if she gets a solid hit in soon enough, but she is fighting directly into her weakness here.\n\n**Mirror Master:** Cable can read his mind to beat any ambushes or mirror tricks, and thanks to his shielding is not threatened by the glass gun at all. Mirror Master's only real path to victory is physically throwing Cable into a mirror, which puts him at huge risk of sustaining massive damage.\n\n**2v2:** They fare better as a team, but not massively. If Lyra is deposited into a 2v1 melee fight she still gets annoyed to death by Deadpool, and Cable can pretty easily protect Deadpool from Mirror Master's attack vectors that would actually do anything, plus Deadpool means more guns to ultimately put them down. There are perhaps some mirror tricks that could get Cable and Deadpool separated, but I doubt anything outside of \"kill Deadpool immediately, Lyra hunts and kills Cable\" would get the job done",
            "[Team Four Girlfriends Between Them.](https://imgur.com/a/S3jG3Jk)\n\n|Character|Tier|Series|Match-Up|Stipulations|\n|:-|:-|:-|:-|:-|\n|[Ironheart](https://imgur.com/a/SgmUyX0)|Cable|[Marvel (616)](https://www.reddit.com/r/respectthreads/comments/fclec6/respect_riri_williams_aka_ironheart_marvel_616/)|Likely|V3 version of her armor, physical feats of V2 should be applicable because it is designed to be [faster ](https://imgur.com/6C4elWI)and [stronger](https://imgur.com/Tk5ZXc7). Thinks enemy combatants are deserving of death. [Additional scans for tech capabilities.](https://www.reddit.com/user/Potential_Base_5879/comments/1ddyls2/ironheart_extra_tech_rt/)|\n|[Quanxi](https://imgur.com/a/CZGT5wF)|Deadpool|[Chainsaw man](https://www.reddit.com/r/respectthreads/comments/wlcfn2/respect_quanxi_chainsaw_man/)|Likely|Stip out [this feat](https://imgur.com/a/xH5qmAF), believes freedom of her various girlfriend's is contingent on killing the enemy. [Additional feats here.](https://www.reddit.com/user/Potential_Base_5879/comments/1ddz5k5/quanxi_part_2_feat_dump/) Is equiped with all her used gear and a [walkie-talkie](https://imgur.com/a/7oJXITU) keyed to Ironheart's helmet communication.|\n\nJustifications:\n\n*Ironheart vs Cable*\n\nHigher end guns already [don't pose a problem for Ironheart](https://imgur.com/a/no-sells-heavy-machine-gun-fire-dz2abF4).\n\nCable's high end strength is [putting this big hole in concrete](https://imgur.com/a/bursts-through-concrete-GAmiHIC), an amount Iron heart is able to move comparatively close to moving [here](https://imgur.com/3bLPln2), and has lived [craters before.](https://imgur.com/a/unharmed-by-falling-into-ground-hard-enough-to-trench-lByUT3K)\n\nWhile Ironheart can't actually go 1 to 1 for arrow dodging, she has shown the ability to react to [dubiously speedy projectiles.](https://imgur.com/a/dodges-her-own-missile-Fqga0jk)\n\nOverall, the ability to fly and keep distance limits cable from using his effective options while N.A.T.A.L.I.E. helps Ironheart find and blast cable wherever he tries to hide. The  ability to scan for weak points will help ensure the [shot is lethal.](https://imgur.com/YCWHXJj)\n\n*quanxi vs Deadpool*\n\nThis is pretty evenly matched, both have the ability to slice the other, and are both [very](https://imgur.com/a/j5kXXKg) [adept](https://imgur.com/a/decapitate-bisect-tm2PILa) in going for quick kills. However, Quanxi's feats just generally show her doing a bit more with her time, not to mention taking things more seriously. For instance, bisecting several heads at a time, as opposed to speaking with the criminals one by one.\n\nTheir speed feats are relatively similar, Deadpool [slices a bullet](https://imgur.com/a/M94bZZ0), Quanxi [handblocks one](https://imgur.com/a/zmzlRrv).\n\nSomething else they both share is regeneration. However, where Deadpool is floored by a [headshot](https://imgur.com/a/8wNiA1f) and the RT claims his spine is also a vulnerable point, which doesn't bode well when Quanxi's default move is decapitation. As a devil, any blood shed in the battle will allow Quanxi to regen, and she doesn't even need extra blood for her [healing factor to be functional.](https://imgur.com/a/RgzasVh)\n\nFinally, Quanxi has better ranged options for incapacitation. While she'll take bullets just to stop them hitting someone else, her [crossbow devil form](https://imgur.com/a/ZxLpzpj) has been used for the exact purpose to blow up a regenerator until are in pieces. While crossbow bolts may seem slow as an idea, Denji was [unable to react to them and was downed](https://imgur.com/ZaMxMCN), despite [moving to and parrying close range gunfire. ](https://imgur.com/a/sOIqNxc)",
            "Team Jitterbug\n\nCharacter | Tier | Series | Match-Up | Stipulations |\n---|---|----|----|----\n[Zazie](https://www.reddit.com/r/respectthreads/comments/tq9km6/respect_zazie_battle_angel_alita_last_order/) | Deadpool | Battle Angel Alita: Last Order | Likely | As of the final round of the ZOTT tournament.\n[The Vord Queen](https://www.reddit.com/r/WhoWouldWinWorkshop/s/C3xXK0QIjd) | Cable | Codex Alera | Draw | Has her sword, spawns in with 1,500 assorted Vord, [described here](https://old.reddit.com/r/WhoWouldWinWorkshop/comments/1dem4xr/vord_queen_tourney_rt/l8rsk8f/), as strong at crafting as she was during First Lord's Fury\n\n##Justifications\n\n**Zazie-Deadpool**\n\nDeadpool is somewhat faster than Zazie, and teleportation immediately brings him into the range where she is least effective against him. At this range, both combatants can be immediately lethal to the other. Zazie's likely victory comes from her greater skill and intelligence letting her set up a win.\n\n**VQ-Cable**\n\nCable benefits from being able to locate the queen with his telepathy. His high rate of fire and long range allow him to resist being swarmed, and telepathy makes ambushes and other maneuvers more difficult. Once he closes with the queen, they fight relatively evenly with ranged abilities, or in close quarters.\n\n**Team Justification:**\n\n\nThe combination of Cable's telepathy and Deadpool's teleportation allow them to locate the enemy team and directly engage before Zazie and the vord can set up the battlefield to their advantage. Deadpool's teleportation and Cable's shields allow them to negate and avoid the worst of Jitterbug's AOE attacks, by staying in close with one teammate or the other or blocking them. Jitterbug wins if Zazie or the queen can outplay the tiersetters and successfully land lethal shots while they are being engaged and harrassesd by the vord forces."
        ]
    },
    "Featured Character/Team Schedule for Q3 2024": {
        "title": "Featured Character/Team Schedule for Q3 2024",
        "score": 9,
        "url": "https://www.reddit.com/r/whowouldwin/comments/1dil38c/featured_characterteam_schedule_for_q3_2024/",
        "content": "Here is the schedule for July through September 2024 for /r/whowouldwin's Featured Characters and Teams.\n\nWe have an automated system that will contact those that have been scheduled for a slot two weeks prior to their assigned date to provide us with a draft of their submission. If their submission does not meet the standard of quality we expect, then we will work with the submitter to reach an acceptable final draft. If you cannot be reached within a week of the submission date we will contact a backup for their submission to go on that date.\n\nThis list is subject to change should people drop out or swap their character/team.\n\n###Featured Characters\n\n***July***\n\n* July 3 - Jack Garland (Final Fantasy) by /u/xxbeerusxx\n\n* July 10 - Denji (Chainsaw Man) by /u/aprettydullusername\n\n* July 17 - Chisato Nishikigi (Lycoris Recoil) by /u/negativegamer\n\n* July 24 - Evil Deadpool (Marvel Comics) by /u/godofyawn\n\n* July 31 - Quirinus Quirrell/Voldemort (Harry Potter & the Methods of Rationality) by /u/agnaa_pants\n\n***August***\n\n* August 7 - Canaan (Canaan) by /u/inverseflash\n\n* August 14 - Optimus Prime (Transformers (Image Comics)) by /u/borburison\n\n* August 21 - Ryo Saeba (City Hunter) by /u/ultim8_lifeform\n\n* August 28 - The Chameleon (Kung Fu Panda) by /u/outrageous-farmer-42\n\n***September***\n\n* September 4 - Akuma (Street Fighter (Udon Comics)) by /u/kalebsantos\n\n* September 11 - Takamura (Sakamoto Days) by /u/Verlux \n\n* September 18 - Soldier D (Go! Go! Loser Ranger!) by /u/lord_blizzard58 \n\n* September 25 - Tanya von Degurechaff (Saga of Tanya the Evil) by /u/calicolime\n\n###Featured Teams\n\n***July***\n\n* July 13 - Sages of Gensokyo (Touhou Project) by /u/doctorgecko \n\n***August***\n\n* August 10 - Ajna's Party (Indivisible) by /u/ya-boi-benny \n\n***September***\n\n* September 7 - I.M.P. (Helluva Boss) by /u/radioactivespoon",
        "num_comments": 6,
        "comments": [
            "We've gone with monthly teams this time since we didn't get a lot of team submissions. That does mean we've got the space to add a few if we get some late ones, though! If you want to feature a team - even if you've already got a character on the schedule - let us know.",
            "Being X has given us all a blessing on this day",
            "Yes!",
            ">This list is subject to change should people drop out or swap their character/team.\n\nHmm... Just in case I decide to change my pick, when is the last time I can swap a character?",
            "Two weeks prior to your scheduled feature we'll come looking to get a final draft for the thread, so ideally before then. Final lock in is one week beforehand, so definitely by then.\n\nIf you do decide to change out your feature, contact Modmail with a PoC for the new one explaining that you'd like to switch it out."
        ]
    },
    "Peak performance Garry Kasparov and Mike Tyson are stuck in a time loop. In the morning, they play a game of chess. In the evening, they box. Does Mike checkmate Garry first, or does Garry knock Mike out first.": {
        "title": "Peak performance Garry Kasparov and Mike Tyson are stuck in a time loop. In the morning, they play a game of chess. In the evening, they box. Does Mike checkmate Garry first, or does Garry knock Mike out first.",
        "score": 190,
        "url": "https://www.reddit.com/r/whowouldwin/comments/1dle9te/peak_performance_garry_kasparov_and_mike_tyson/",
        "content": "Mike is 21 in the middle of his 87-90 undisputed heavyweight champion reign and gets the white pieces. \n\nKasparov is 22, world champion after beating Karpov in Moscow, and his physical conditioning carries over between loops.",
        "num_comments": 104,
        "comments": [
            "Everyone in here is looking at this wrong. Assuming they get to keep their memories, Tyson checkmates Kasparov first. Not because chess is easier to learn than boxing, both skills are extremely difficult to master to an elite level, let alone to become best in the world. \n\nThe issue here is that Kasparov is absolutely pummeled, physically, every evening. And he *remembers* the awful beating he receives. Tyson might feel a bit embarrassed to lose at chess, maybe. But Garry is suffering an eternal hell from which he cannot escape. Unless he throws intentionally.\n\nKasparov gets checkmated by Tyson on purpose. He holds out for a week at most before giving in.",
            "They would probably never lose in their respective fields.\n\nAs many aspiring chess players have tragically found out, becoming a super GM like Kasparov is not just a matter of training. Tyson is already 21. Most GMs start learning chess when they are extremely young (age 6 for Kasparov). This fact already puts Tyson at an extreme disadvantage in terms of his learning ability. And even with unlimited time to train, most people just don't have the aptitude to become super GMs. That's a sad reality that many chess prodigies have to face eventually. In the same way that you could study 5x more than Einstein ever did and never be as smart as he was, you could train more than Kasparov and never reach his level of genius.\n\nI am less familiar with boxing, but I'd say it's a similar deal. It would take an inordinate amount of time for Kasparov to reach Tyson's level. Not just in terms of physical condition, but in terms of technique, knowledge, innate aptitude, and mental fortitude. Tyson is one of a kind.\n\nThey will both go insane before they lose in their fields. Tyson will never reach Kasparov's peak level, and Kasparov will never beat Tyson. The mental strain on the pair of them, faced with this endless sisyphean task, is too much.\n\nTLDR: If I had to choose, I'd say Tyson wins first. Eventually. Why? Because they both go mad in the time loop, faced with impossible tasks, and their mental deterioration is more detrimental to chess than it is to boxing. So, as Kasparov goes mad, Tyson becomes closer to his level in chess. Eventually Kasparov blunders.",
            "Mike Tyson wins this easy. \n\nKasparov is smart enough to realise that losing on purpose so he doesn't have to get pummelled by a prime Mike Tyson is a no brainer. \n\nAssuming that for some reason that neither side can throw intentionally and they have to try hard then Gary probably wins. You can win a boxing fight by getting extremely super lucky. Mike Tyson is only human. He can pummel Kasparov a thousand times but eventually he will slip up. \n\nWhereas you can't really luck your way to win a chess match.",
            "This is an absurd stomp. Garry will eventually be so concussed he can’t think.",
            "Wouldn’t Mike Tyson inflict brain damage to Kasparov to the point that he becomes too stupid to play",
            "If they get to keep their memories of each match, Tyson eventually wins. But only after becoming top grandmaster level like Bill Murray in Groundhog day. \n\n\nKasparov can't knock out Tyson, he would just get one or two shot every time. Even if he did start to learn the art of boxing, all it would do is help him maybe last a little longer. \n\n\nYou can train to become a chess grandmaster but you can't train to become a freakishly large heavyweight. Realistically though it would take a long, long time before either beat the other at their own game.",
            "It never ends. Even if they get to accumulate experience/skill from doing it for eternity, both are genetically predisposed to have a higher intellectual and physical capacity respectively. I think Kasparov has a better chance of eventually knocking Mike out as it truly does come down to one potentially lucky punch, but it is still of course astronomically unlikely.",
            "This is a good one. \n\nI’d go with Tyson. It’s easier to blunder and lose in chess when you have overwhelming odds than in combat sports and especially boxing.",
            "When you say physical conditioning, does that mean he doesn’t get brain damage from being knocked out every single night?",
            "This prompt is pretty dumb, since its irrevocably biased towards Tyson. The punishment for Tyson every day is losing a game he doesn't really care about. I wouldn't even say that his punishment rises to the level of embarrassment, since it would be silly to be embarrassed about getting beaten at chess by Kasparov- especially when its not a game you even play or try to compete in. You might say the harshest punishment Tyson receives is boredom. Yawn.\n\nMeanwhile, Kasparov is physically brutalized on a daily basis. How are those even close to the same? Lets analyze it even further, natural physical advantages don't matter at all in chess. But Kasparov could be in the best shape of his life and he'll still never gain enough skill in boxing to overpower Tyson. Its a lose/lose for Kasparov where he has no chance of ever winning. Tyson not only has the naturally easier challenge (you can teach chess, you can't teach size and raw physical power), but he also has completely ho-hum consequences for failing while Kasparov is being terrorized."
        ]
    },
    "Who's the strongest character that Bully Maguire can bully?": {
        "title": "Who's the strongest character that Bully Maguire can bully?",
        "score": 59,
        "url": "https://www.reddit.com/r/whowouldwin/comments/1dlh9ia/whos_the_strongest_character_that_bully_maguire/",
        "content": "Several limitations will be in play:  \n- No brutalizing of the victim. Physical harm can be allowed, but not to the point it gets too extreme.  \n- Bully Maguire loses if the victim retaliates back and can kill him.  \n- Not allowed to stalk his victim for the sake of more bullying. So if he's bullying a student it has to be only at school, or bullying a co-worker during work hours.\n\n  \nRound 1: Bully Maguire can only use verbal bullying and social media\n\nRound 2: Bully Maguire can in additional use psychological bullying and gaslighting. Spider-Man powers are allowed as long as it doesn't involve any physical harm\n\nRound 3: Bully Maguire can additionally use his Spider-Man powers to bully directly",
        "num_comments": 21,
        "comments": [
            "Magetta from dragonball super fights universe exploding gods but insult him once and he starts crying and becomes immobile.\n\nHes like a 10 ft tall robot that drinks lava for fun who can tank Vegeta's attacks head-on without any damage.",
            "Probably homelander, since he was getting trolled all the time in the comics by prank phone calls.",
            "Toph is pretty powerful, but given that Spider-Man never needs to touch ground, he could definitely bully her pretty hard.",
            "Xeno from DBS",
            "Bully Maguire can bully anyone that is under a 20 tonner.",
            "Gautama Buddha. Literally unlimited power and will forever turn the other cheek and never fight back but no amount of bullying will ever hurt him.",
            "young Franklin Richards.",
            "Luffy and Zoro and Red haired shanks. They have an entire thing about only picking fights where necessary. They won't really care or rise to the bait if all he's doing is belittling them verbally or even physically maybe since any attacks from him would be barely anything to them.",
            "**Spider-Man (Raimiverse Spider-Man)**\n\n- [Respect Spider-Man (Raimi Trilogy)](https://redd.it/o4tnq6)\n\n***\n\n^(I am a bot) ^| [^(About)](https://redd.it/owgxtl) ^| [^(Code)](https://github.com/Luke-Username/respectthread_bot) ^| [^(Opt-out)](https://www.reddit.com/message/compose?to=respectthread_bot&subject=OPTOUTREQUEST) ^| ^(Missing or wrong characters? Reply explaining the issue)",
            "Eivor at Ravensthorpe"
        ]
    },
    "The Bismarck is magically transported back in time to the late 1700s and decides to solo the world's navy at the time...": {
        "title": "The Bismarck is magically transported back in time to the late 1700s and decides to solo the world's navy at the time...",
        "score": 209,
        "url": "https://www.reddit.com/r/whowouldwin/comments/1dl5n6v/the_bismarck_is_magically_transported_back_in/",
        "content": "Both sides have unending ammunition and supplies and the global navy at the time is all consolidated together prior to the battle. Can the combined naval forces of the late 1700s win?\n\nR1: almost no warning the global navy has just enough time to consolidate their forces before the Bismarck attacks. They start 10km apart.\n\nR2: The global navy gets 10 years warning of the impending attack including a photo of the Bismarck but no information on the internal components of the ship.",
        "num_comments": 70,
        "comments": [
            "There is nothing 1700s ships can do to any post 1860s ship, no matter how much info or prep time they have. Bismarck stomps.",
            "Coughing baby vs. Atom bomb",
            "Cannons are nothing compared to the 15 in' guns on the Bismarck. Hell the ships would get eviscerated by the secondary battery long before they got close enough put a Cannon ball on the deck. Maybe if they were able to coordinate in a manner that all of the guns couldn't possibly reload fast enough to get them all they could board the Bismarck somehow. But even on board they would be heavily outgunned by generic self defense weaponry. Even 1 guy with a Mauser could kill 6 guys before they got him. I just can't see a scenario in which the Bismarck somehow loses this. It's literally a giant impregnable fortress armed with bigger guns than they've ever seen, faster than they can comprehend, armor so thick that anything they throw at it will literally bounce off. And crewed by more men than 6 or 7 of their ships combined.",
            "Naval forces underwent one of the most dramatic Revolutions in Military Affairs in all world history when, in the 1860s, France and England both developed the \"ironclad\" concept. To say the Ironclad made every naval vessel before it obsolete may be an understatement. The ironclad was such fertile ground for rapid technological improvement that a new ironclad built in 1865 would ITSELF become obsolete by a newer ironclad built in 1870.\n\nNot ineffective. Not second-rate. \n\nObsolete. In 5 years. \n\nThis process of uncontrolled advancement continued until the Dreadnaughts appear at the turn of the century, at which point things slowed from a frantic pace to a rapid pace. Three more decades after that the Bismarck left the drydock.\n\nThe only thing that would stop this hypothetical Bismarck from ruling the entire world in the 1700s would be that it can only be in one place at a time.",
            "gg wp the Bismarck wouldn't even get a stratch",
            "Secondary batteries on the Bis alone could tear apart the best Ship of the Line at the time. I don't think you realize just how insane the gap between these two periods of sea-warfare is",
            "It becomes unstoppable. \n\nTbh, with unlimited supplies and ammunition it will be remade into a floating palace for someone.",
            "It would be like the Droplet scene from the Three Body Problem books. \n\nThat one ship would rip apart the entire combined world fleet easily.",
            "The only way I see the world's navies winning is if they're able to detonate a hulk filled with gunpowder close enough to Bismark to jam his rudder or propeller shaft.  Surprise would be key.  I'm going to say this is only possible in R2 where the sail navy gets time to plan their trap.\n\nThe engagement must happen in confined waters where Bismark cannot run at maximum speed, and also in a place with prevalent mists that could conceal the hulk until it is too late.  Some brief googling says that a 1700s east indiaman could carry in the 100-300 ton range, and gunpowder contains 62% of the energy of the same mass of TNT.  So lets say we have an explosive with the energy equivalent of about 100 tons of TNT.  Given the impact of two 2-ton mines on Tirpitz were enough to damage her rudder and knock turret-dora off its bearings, if the 100t hulk can be detonated next to Bismark it might be enough to render the ship combat ineffective.  There are extremely long odds that this happens, and relies on the Kriegsmarine sailors to be overconfident and underestimate their technologically inferior opponent, resulting in an obsolete weapon sinking their ship.  So it's possible.\n\nProbably requires the rest of the 1700s navy to be sacrificed to work, though.  I'm thinking they disguise the hulk by having a bunch of other hulks get created by Bismark, so it isn't suspicious when it has to sail through a strait choked with wrecks.",
            "Possibly the only thing the 1700's fleet could do is hope to swarm the bismark with boarders armed with cutlasses."
        ]
    }
}