{
    "Monday Megathread! Ask questions and share knowledge; newcomer questions encouraged!": {
        "title": "Monday Megathread! Ask questions and share knowledge; newcomer questions encouraged!",
        "score": 1,
        "url": "https://www.reddit.com/r/wildrift/comments/1dn4jzc/monday_megathread_ask_questions_and_share/",
        "content": "Welcome to the Monday Megathread, where you the community get to ask your questions and share your knowledge.\n\n&#x200B;\n\nNeed help against a certain champion? Unsure how and where to ward? Looking to improve your csing? This is the place to ask. This weekly thread is a place for new players to ask questions and get help/advice from more experienced players. So, don't hold back, get your game related questions ready and post away, and hopefully someone can answer them!\n\n&#x200B;\n\n&#x200B;\n\n\\*\\*\\*\n\nUpdate on the patch schedule? \\[Click here!\\](https://support-wildrift.riotgames.com/hc/en-us/articles/1500002088961-Wild-Rift-Patch-Schedule)\n\n&#x200B;\n\nIf you wish to just view top level comments (ie questions) add \\*\\*?depth=1\\*\\* to the end of the page url. \n\n&#x200B;\n\n&#x200B;\n\n\\*\\*\\*\n\n&#x200B;\n\nFeel free to drop some potential posts that help to cover any useful information on the sub! We'll be looking to add content to these as it comes up.\n\n&#x200B;\n\n&#x200B;\n\n\\*\\*Please sort this post by new, so that you can see the newer, unanswered questions.\\*\\*",
        "num_comments": 15,
        "comments": [
            "Hey all! Last few days my ping now sits around 100-120 any game. Ive tried WiFi and no wifi and turning things off and on again but nothing seems to work. \n\nAnyone else having the issue / any ideas?",
            "Is there something like u.gg for this game ?\nAll tier list say something different and don't really match the style I like to play",
            "IN EMERALD IM AGAINST GM WTF RIOT",
            "Are the new anima squad skins/event coming to WR?",
            "How do i get the Kayle DragonSlayer skin? I dont find where i can acquire it!",
            "How much current ahri animated profile cost?",
            "Do wild rift exclusive skins ever come back? Like at all? Looking at several I missed during the years that I really want and I dont understand the system at all! Also, as mainly a pc league player - how do you get the exclusive wild rift skins that come out with events? Is it seriously only gacha?",
            "Yeah nothing works for me either but were in the same boat! I reached out on Twitter but havent heard back yet",
            "We want morde",
            "yes. Ive even been through some streamers vods. everyones ping is up 20-30ms. seems like they downgraded their servers"
        ]
    },
    "What's the best skin you got from the Poro Chest?": {
        "title": "What's the best skin you got from the Poro Chest?",
        "score": 56,
        "url": "https://i.redd.it/2ucj6vb8og9d1.png",
        "content": "This Vladimir skin was my recent one. The best skin I had was Corporate Mundo which became legendary after he was reworked.",
        "num_comments": 63,
        "comments": [
            "Chromacrash Ekko. He's epic AND I'm pretty sure he's gacha exclusive or time limited. So pretty rare",
            "I opened Project: Leona which is cool except for the fact I never play Leona. Best skin Ive opened that I actually use is Soul Hunter Kayn.",
            "Devil teemo, cause now teemo became even more annoying with it",
            "Just recently, Mecha Zero Sion.",
            "I would say artic ops varus but in game model is pretty bad, so bunny blitz because it makes me mad when on enemy team and is fun to play",
            "Project Zed but i dont know to play Zed...",
            "Dragon slayer pantheon, my first and best skin that I got from the poro chest",
            "Technically probably that Jade Wukong one that got upgraded in quality. \n\nI dont play him really though.",
            "Star guardian Kai'sa although I don't play her",
            "I'd say Winter Wonder Soraka."
        ]
    },
    "A new Rift full of innovation is on the horizon!": {
        "title": "A new Rift full of innovation is on the horizon!",
        "score": 64,
        "url": "https://i.redd.it/trb7pg9puf9d1.jpeg",
        "content": "https://x.com/wildrift/status/1806870269069316452?t=qPaczVAn11l7h9k54c9bvg&s=19 So is T-Hex a champion now?",
        "num_comments": 9,
        "comments": [
            "I don't know man, T hex is too big of a change to just introduce without proper feedback. Also, Hex rifts will completely kill splitpusing.",
            "No. T hex is a rideable win con after baron is taken, made to help push into the enemy base. Dont know how well it is at doing that yet. Tho",
            "Meanwhile, game is still laggy af and full of technical issues",
            "how do you report bugs on wild rift? I can't get 120 FPS anymore since my phone updated to Android 14...",
            "Mordekaiser es Numero uno huehuehuehuehuehuehuehuehue",
            "MORDEKAISER ",
            "LETS GO MORDEKASIER ",
            "Brazil",
            "Yes RIP splitpushing"
        ]
    },
    "A day in the life of a Yuumi player": {
        "title": "A day in the life of a Yuumi player",
        "score": 35,
        "url": "https://v.redd.it/ief66gslwg9d1",
        "content": "",
        "num_comments": 2,
        "comments": [
            "You should have snacks to enhance the experience",
            "Netflix and Chill"
        ]
    },
    "Name one champion that you DO NOT WANT in WR": {
        "title": "Name one champion that you DO NOT WANT in WR",
        "score": 161,
        "url": "https://www.reddit.com/r/wildrift/comments/1dqwqyu/name_one_champion_that_you_do_not_want_in_wr/",
        "content": "For me, it's gotta be Shaco. It's not OP or anything, but it's just the type of champion that makes you feel DUMB.\n\nMaybe k'sante as well. But I'm not a toplaner so I could at least always blame top for riot's mess. ",
        "num_comments": 154,
        "comments": [
            "I'm not ready for sylas, that man is unstoppable with good hands.",
            "I don't play PC, what is it that makes shaco so bad?",
            "Never gona jg ever again if shaco drops. Ping as hard as you want, your teamates wont help you. Lol",
            "Shaco anybody who is anybody knows why",
            "Ksante. Will be so broken due to his kit hell never be balanced. Hell either be super trash or too OP. No in between.",
            "Xerath, unless he's on enemy team",
            "Leblanc,Azir I know these mains will destroy the mid lane for me as a mage haha.\nShaco and Nidalee too.",
            " 4700  329 201   , ,    .  ,   1   15  w               ! q           W  -\n\nA meme that transcends language",
            "Not a fan of Shaco in general but I do want him in WR because of how outlandish his kit is. I'm tired of boring and plain ass champs (cough Talon cough).",
            "Illaoi, I still have nightmares from her tentacles slapping me to death"
        ]
    }
}