{
    "Welcome to /r/WindowsHelp, here are some guidelines for requesting assistance": {
        "title": "Welcome to /r/WindowsHelp, here are some guidelines for requesting assistance",
        "score": 34,
        "url": "https://www.reddit.com/r/WindowsHelp/comments/lxt0j3/welcome_to_rwindowshelp_here_are_some_guidelines/",
        "content": "Welcome to /r/WindowsHelp, the subreddit for you to ask questions and get support for issues related to Microsoft's Windows family of operating systems. Please give this a quick read before posting.\n\nThis subreddit is only for help related to Microsoft Windows and its built in software, like Edge, Store, PowerShell, and so on. Issues about 3rd party software like Chrome or Steam should be posted in their subreddits or /r/techsupport. Also, this is not a hardware subreddit, so issues like your hard drive is not detected would need to be posted in /r/techsupport. General discussions, news, artwork, and so on should be in /r/Windows, /r/Windows10 or similar subreddits. Malware/virus removal has been covered extensively in this post: https://www.reddit.com/r/techsupport/comments/33evdi/suggested_reading_official_malware_removal_guide/\n\nPosts are required to have a moderately descriptive title. Submissions with vague titles like just \"help me\" will be removed. You don't need to write an essay in the title, but everyone should have a rough idea what you are asking about before even clicking the link. Titles like \"I'm encountering System Exception errors when launching Photos\" or \"20H2 update won't install\" are acceptable, but the more details the better. \n\nThe body of your post should also be as detailed as possible. We are not mind readers, and nobody is going to want to play 20 questions. Help us help you, your post should include:\n\n* Your full Windows version, which on Windows 10 is listed in the Settings app under System -> About, it will be the OS Build number.\n\t\n* Details about your device, like the hardware specifications.  \n\t\n* Any recent changes you have made, such as installing/uninstalling software or accessories. Any updates you have installed, tools you have ran, or anything else you think may be relevant.\n\t\n* Include details on your error messages and error codes, these are critical to figuring out the issue.\n\t\n* Tell us what you have already tried to fix this. Any tools you have ran, and changes you tried, and so on. I know it is a meme at this point, but seriously, reboot your computer, it often fixes things!\n\t\n* If possible, include screenshots or video. If you are including screenshots, try to use screenshot software like Snip & Sketch tool built into Windows 10, then you can upload them to a free image host like https://imgur.com to put in your post. We understand that using screenshot software isn't always an option, you can take photos with a phone or similar device, but please be sure to check to make sure everything is in focus and is legible. \n\t\n\nThis subreddit follows the same rules as /r/Windows, you can view the full rule page here: https://www.reddit.com/r/Windows/wiki/rules\n\nThe TL;DR of the rules is be polite, helpful, and don't encourage piracy.",
        "num_comments": 9,
        "comments": [
            "[removed]",
            "[deleted]",
            "[removed]",
            "That is a fantastic write up, I've just made it a sticky post."
        ]
    },
    "How do I turn off this caps lock screen indicator thing?": {
        "title": "How do I turn off this caps lock screen indicator thing?",
        "score": 90,
        "url": "https://www.reddit.com/r/WindowsHelp/comments/1cbgwdl/how_do_i_turn_off_this_caps_lock_screen_indicator/",
        "content": "https://preview.redd.it/wuvw462ztawc1.png?width=178&format=png&auto=webp&s=deeef43e0695476ed0b492574adfa713a0677b6c\n\n For some background info, this started today. I use a windows 10 HP laptop and haven't updated to the windows 11 software yet. It was fine moments prior and it did not have this annoying pop-up whenever I turned my caps on and off, but now that I've resetted it's been doing it and I don't like it. I can't find any info on how to turn it off either, It's just really bugging me out and super duper annoying. Does anyone know why this happening? Or maybe a solution how to fix it / turn it off?",
        "num_comments": 160,
        "comments": [
            "Since this topic has been getting posted a lot over the past day or so, I'm pinning this one.\n\nThis is not a native Windows feature, so any kind of caps lock indicator is going to be something that is installed on your machine, typically from your computer or keyboard manufacturer. \n\n\nThis appears to be a recent change that HP is pushing out to everyone with their software still installed. The program is \"HP System Event Utility\". You can safely uninstall it. There may be an option in the settings for this program to disable that function without uninstall, but as my machines have not been affected I am relying on 3rd party accounts for details on solutions.",
            "If you get a solution anywhere else let me know too. I just started having the same exact issue an hour ago",
            "This is also started happening for me too",
            "Hi u/noelleholidayism, thanks for posting to r/WindowsHelp! Don't worry, your post has not been removed. To let us help you better, try to include as much of the following information as possible! Posts with insufficient details might be removed at the moderator's discretion.\n\n* **Model of your computer** - For example: *\"HP Spectre X360 14-EA0023DX\"*\n* **Your Windows and device specifications** - You can find them by going to go to Settings > *\"System\"* > *\"About\"*\n* **What troubleshooting steps you have performed** - Even sharing little things you tried (like rebooting) can help us find a better solution!\n* **Any error messages you have encountered** - Those long error codes are not gibberish to us!\n* **Any screenshots or logs of the issue** - You can upload screenshots other useful information in your post or comment, and use [Pastebin](https://pastebin.com/) for text (such as logs). You can learn how to take screenshots [here](https://screenshot.help/windows).\n\nAll posts must be help/support related. If everything is working without issue, then this probably is not the subreddit for you, so you should also post on a discussion focused subreddit like /r/Windows.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WindowsHelp) if you have any questions or concerns.*",
            "Try https://h30434.www3.hp.com/t5/Notebook-Video-Display-and-Touch/How-to-turn-off-Caps-Lock-On-Off-Notification/m-p/7469665/highlight/true#M206414",
            "Started for my son today too.  HP Omen Gaming Pc.  Windows 11 Home.  CANNOT get it turned off.  It looks like it isn't super uncommon, but everything I've found doesn't work or isn't an option.  And it's possibly an issue with a peripheral and not the device/OS itself.",
            "I may have actually found a solution.\n\nGo to Settings -> Advanced keyboard settings -> Input language hot keys  \nChange \"To turn off Caps Lock\" from \"Press the CAPS LOCK key\" to \"Press the SHIFT key.\"  \nIf you change it back to caps lock, I think it turns off the thing (It worked for me so far, but I don't know if it functions that way for everyone.)",
            "Im also getting this same stupid problem yall, if you find any solution please comment here or something! Peace out!",
            "The same thing is happening to me and for the love of God, I cannot figure out how to disabled this. I have done all suggestions. I do not even have a caps lock whatever option under my ease of access keyboard section. I do not even know how it got turned on. How do I get rid of this. I want to throw my cat across the room for inducting me into this hell.",
            "This started happening on my HP computer today and it was driving me mad, but I found the cause-\n\nOpen task manager and type in \"OSD\" (on-screen display). Should come up with a process relevant to your manufacturer. Try disabling that."
        ]
    },
    "Odd behavior of some icons after update": {
        "title": "Odd behavior of some icons after update",
        "score": 3,
        "url": "https://i.redd.it/xxxejambpf9d1.jpeg",
        "content": "\nAfter updating with KB5040370, a few of my applications had this show up on my desktop. The ones that are actually still installed also have their standard icon, but now it’s labeled as “copy” and not all of these icons are related to still installed programs. Any ideas what is up with this? So far nothing has shown up in my virus scans ",
        "num_comments": 1,
        "comments": [
            "Hi u/ScarrFoxYT, thanks for posting to r/WindowsHelp! Don't worry, your post has not been removed. To let us help you better, try to include as much of the following information as possible! Posts with insufficient details might be removed at the moderator's discretion.\n\n* **Model of your computer** - For example: *\"HP Spectre X360 14-EA0023DX\"*\n* **Your Windows and device specifications** - You can find them by going to go to Settings > *\"System\"* > *\"About\"*\n* **What troubleshooting steps you have performed** - Even sharing little things you tried (like rebooting) can help us find a better solution!\n* **Any error messages you have encountered** - Those long error codes are not gibberish to us!\n* **Any screenshots or logs of the issue** - You can upload screenshots other useful information in your post or comment, and use [Pastebin](https://pastebin.com/) for text (such as logs). You can learn how to take screenshots [here](https://screenshot.help/windows).\n\nAll posts must be help/support related. If everything is working without issue, then this probably is not the subreddit for you, so you should also post on a discussion focused subreddit like /r/Windows.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WindowsHelp) if you have any questions or concerns.*"
        ]
    },
    "Personalization: Slideshow changes to Picture": {
        "title": "Personalization: Slideshow changes to Picture",
        "score": 1,
        "url": "https://www.reddit.com/r/WindowsHelp/comments/1dr6c83/personalization_slideshow_changes_to_picture/",
        "content": "Windows 11. I had set the background to slideshow in the settings. When switch to a another virtual desktop it changes to Picture mode in Personalization. It revert backs to slide when I turn on the PC. Found no solution so far online",
        "num_comments": 1,
        "comments": [
            "Hi u/raghu_07, thanks for posting to r/WindowsHelp! Don't worry, your post has not been removed. To let us help you better, try to include as much of the following information as possible! Posts with insufficient details might be removed at the moderator's discretion.\n\n* **Model of your computer** - For example: *\"HP Spectre X360 14-EA0023DX\"*\n* **Your Windows and device specifications** - You can find them by going to go to Settings > *\"System\"* > *\"About\"*\n* **What troubleshooting steps you have performed** - Even sharing little things you tried (like rebooting) can help us find a better solution!\n* **Any error messages you have encountered** - Those long error codes are not gibberish to us!\n* **Any screenshots or logs of the issue** - You can upload screenshots other useful information in your post or comment, and use [Pastebin](https://pastebin.com/) for text (such as logs). You can learn how to take screenshots [here](https://screenshot.help/windows).\n\nAll posts must be help/support related. If everything is working without issue, then this probably is not the subreddit for you, so you should also post on a discussion focused subreddit like /r/Windows.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WindowsHelp) if you have any questions or concerns.*"
        ]
    },
    "Windows Security Error Actions recommended": {
        "title": "Windows Security Error Actions recommended",
        "score": 1,
        "url": "https://www.reddit.com/r/WindowsHelp/comments/1dr6b7u/windows_security_error_actions_recommended/",
        "content": "In recent days, my Windows Security cannot be opened and shows the message 'Action recommended'. I have tried many ways to open it but have not been successful. Could you please tell me if this is because my computer is infected with a virus?\n\nhttps://preview.redd.it/um7igo80yg9d1.png?width=1920&format=png&auto=webp&s=be1bd685d7e2c663ff22d53b65564e96bd67efb3\n\n",
        "num_comments": 1,
        "comments": [
            "Hi u/HaiDang4sdrYm, thanks for posting to r/WindowsHelp! Don't worry, your post has not been removed. To let us help you better, try to include as much of the following information as possible! Posts with insufficient details might be removed at the moderator's discretion.\n\n* **Model of your computer** - For example: *\"HP Spectre X360 14-EA0023DX\"*\n* **Your Windows and device specifications** - You can find them by going to go to Settings > *\"System\"* > *\"About\"*\n* **What troubleshooting steps you have performed** - Even sharing little things you tried (like rebooting) can help us find a better solution!\n* **Any error messages you have encountered** - Those long error codes are not gibberish to us!\n* **Any screenshots or logs of the issue** - You can upload screenshots other useful information in your post or comment, and use [Pastebin](https://pastebin.com/) for text (such as logs). You can learn how to take screenshots [here](https://screenshot.help/windows).\n\nAll posts must be help/support related. If everything is working without issue, then this probably is not the subreddit for you, so you should also post on a discussion focused subreddit like /r/Windows.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/WindowsHelp) if you have any questions or concerns.*"
        ]
    }
}