{
    "Cumulative Updates: June 11th, 2024": {
        "title": "Cumulative Updates: June 11th, 2024",
        "score": 18,
        "url": "https://www.reddit.com/r/Windows10/comments/1ddjdd1/cumulative_updates_june_11th_2024/",
        "content": "Hey all - changelists now up, linked here for your convenience:\n\n* Windows 10 version 1507 — [KB5039225 (OS Build 10240.20680) - Microsoft Support](https://support.microsoft.com/en-us/topic/june-11-2024-kb5039225-os-build-10240-20680-48d7d7c2-bf55-458b-bdc2-06eb6be3d912)\n* Windows 10 version 1607 — [KB5039214 (OS Build 14393.7070) - Microsoft Support](https://support.microsoft.com/en-us/topic/june-11-2024-kb5039214-os-build-14393-7070-07836869-b221-42a9-a63a-62f10967068f)\n* Windows 10 version 1703 — [EOS](https://support.microsoft.com/en-us/topic/windows-10-update-history-83aa43c0-82e0-92d8-1580-10642c9ed612)\n* Windows 10 version 1709 — [EOS](https://docs.microsoft.com/en-us/lifecycle/announcements/windows-10-1709-end-of-servicing)\n* Windows 10 version 1803 — [EOS](https://docs.microsoft.com/en-us/lifecycle/announcements/windows-10-1803-1809-end-of-servicing)\n* Windows 10 version 1809 — [KB5039217 (OS Build 17763.5936) - Microsoft Support](https://support.microsoft.com/en-us/topic/june-11-2024-kb5039217-os-build-17763-5936-d435559e-ae16-44d0-b145-027eb4af7f47)\n* Windows 10 version 1903 — [EOS](https://docs.microsoft.com/en-us/lifecycle/announcements/windows-10-1903-end-of-servicing)\n* Windows 10 version 1909 — [EOS](https://support.microsoft.com/en-us/topic/end-of-service-statement-e440a698-de79-4ace-b53b-5a6a3e36685e)\n* Windows 10 version 2004/21H1/20H2/21H1 — [EOS](https://support.microsoft.com/en-us/topic/end-of-service-statement-e440a698-de79-4ace-b53b-5a6a3e36685e)/[EOS](https://support.microsoft.com/en-us/topic/end-of-service-statement-e440a698-de79-4ace-b53b-5a6a3e36685e)\n* Windows 10 version 21H2, and 22H2 — [KB5039211 (OS Builds 19044.4529 and 19045.4529) - Microsoft Support](https://support.microsoft.com/en-us/topic/june-11-2024-kb5039211-os-builds-19044-4529-and-19045-4529-f7e528c9-5e9f-4cd8-9161-704708448517)\n\nReminder - \"Patch Tuesday\" updates include changes from previous preview/optional updates if you chose not to install them. For 22H2/23H2:\n\n*  [May 29, 2024—KB5037849 (OS Build 19045.4474) Preview - Microsoft Support](https://support.microsoft.com/en-us/topic/may-29-2024-kb5037849-os-build-19045-4474-preview-cda7ed71-6202-45ed-a649-63b11fedabfe)\n\nGeneral info:\n\n* For a list of known issues and safeguards, please refer to the dashboard [here](https://docs.microsoft.com/windows/release-health/).\n* For details about feedback, and how to capture traces if needed, see [here](https://aka.ms/howtofeedback).",
        "num_comments": 45,
        "comments": [
            "KB5039211 fails to install on mine. I hope it's not absolutely necessary.",
            "And again 1507 outlived 20H2 and almost the rest 🤗💗",
            "Not sure what the heck they did, but literally after updating my laptop now runs like hot garbage and won't hold a charge for the slightest second.",
            "Windows Shell Experience Host is taking up a lot of my CPU now. Can this be from the update earlier? How do I stop it?",
            "I tried playing Pathfinder WotR again after the update (120 hours in already). GPU reached 99-100 in the main menu, making it unplayable.\n\nI uninstalled the update and the game runs smoothly again. What did they do with this one?",
            "is this the update needed for that wifi takeover attack?",
            "I miss the days of security patches being separated from feature/MS-BS patches so it was possible to have critical security issues fixed in Windows without getting all the bugs from \"new exciting advertising opportunities\".",
            "Downloaded it, had the yellow circle next to the shutdown and everything yesterday, and now it's vanished.... has Microsoft rolled back the update?\n\nHuh nevermind it installed when I restarted, weird, oh well.",
            "KB5039211 is messing around with Realtek Audio drivers. My audio is completely gone. Sound icon has a red cross and says 'no speakers or headphones plugged in'. Device Manager does not even show Realtek Drivers. Manually installing them from Laptop's drivers website did not work as Realtek audio does not show up on Device Manager.",
            "Had to uninstall the update from June 11th, made my 4090 gpu utilization get stuck between 0-12% in games. i Went through all the drivers and realized this was the issue."
        ]
    },
    "Simple questions and Help thread - Month of June": {
        "title": "Simple questions and Help thread - Month of June",
        "score": 5,
        "url": "https://www.reddit.com/r/Windows10/comments/1d5lfhe/simple_questions_and_help_thread_month_of_june/",
        "content": "Welcome to the monthly Simple questions and Help thread, for questions that don't need their own posts!\n\nBefore making a comment, we recommend you [search your problem on Bing](https://www.bing.com/search?q=Windows+issue) and check if your question is already answered on our [Windows Frequently Asked Questions wiki page](https://www.reddit.com/r/Windows/wiki/faq). This subreddit no longer accepts tech support requests outside of this post, if you are looking for additional assistance try r/TechSupport and r/WindowsHelp.\n\nSome examples of questions to ask:\n\n- Is this super cheap Windows key legitimate? (probably not)\n\n- How can I install Windows 11?\n\n- Can you recommend a program to play music?\n\n- How do I get back to the old Sound Control Panel?\n\nSorting by New is recommend and is the default.\n\n----\n\nBe sure to check out the [Windows 11 version 22H2 Launch Megathread](https://www.reddit.com/r/Windows11/comments/xj877b/windows_11_version_22h2_build_22621_launch/) and also the [Windows 11 FAQ](https://www.reddit.com/r/Windows/wiki/faq) posts, they likely have the answers to your Windows 11 questions already!",
        "num_comments": 58,
        "comments": [
            "How do I permanently kill the news and interests on the taskbar? Every time I go into settings and disable it, it turns itself back on. I don't want all that junk on my login screen and I'm tired of turning it off every time I open my laptop.",
            "How do i make windows to reinstall my webcam driver? it stopped working.. now i go into device manager and driver is not there.. i tried different usbs and rebooted several times, even downloaded a driver booster thing and didnt help. Webcam has no brand and no drivers online... its supposedly \"plug and play\", i tried it in different pc and it worked but just wont work in mine...",
            "When i launch fallout 3 from the microsoft store and press plag it just closes. Im on windows 10 and want to know if i have to have 11 or?",
            "Windows 10 (Samsung) laptop suddenly stopped sleeping. Setting is to have laptop sleep when lid is shut, usually at day's end but lately in the morning it's already \"running.\" Every day for the past 5-7 days lights on outside of laptop shell/case are on and fan is running when it should be asleep. Did Microsoft change something recently? Perhaps in conjunction with the newly added widgets seen on locked screen?",
            "On a laptop + mouse setup, is it possible to use the trackpad for gestures (including two finger scrolling), but disable it for moving the pointer?",
            "Yesterday, I changed my motherboard and CPU, and since then, Windows 10 has been giving me constant problems. First, it didn't recognize the Alt key, then the Alt+Tab command bugged out, either switching too quickly or getting stuck. Today, it recognizes the keyboard, but it's as if it's locked; it's like I'm pressing multiple keys at the same time. For instance, using the mouse wheel triggers the Ctrl+WheelUp/Down command.",
            "Does tiny10 or tiny11 still activate and give you security updates? I need to upgrade an old laptop to ssd and was thinking of going with one of these OS.",
            "how would i combine two microphone inputs in into one output? If there's a free app for it, please let me know.",
            "I received a computer that belonged to a friend that passed recently. I want to add my own microsoft account to this pc but it will only allow me to sign into his. I do not have his login info. I have already attempted to use the safe boot option and using command prompt but this also asks me for a password and is at the limit of my technical skills. Any ideas?",
            "Paint doesn't work, I can't open it. The process get stuck on task manager. What can I do to fix it please?"
        ]
    },
    "Windows and Mac browser RAM usage comparison for 2024": {
        "title": "Windows and Mac browser RAM usage comparison for 2024",
        "score": 9,
        "url": "https://www.reddit.com/r/Windows10/comments/1dr16no/windows_and_mac_browser_ram_usage_comparison_for/",
        "content": "I done this test because I could not find a recent data set with every browser I use compared together.\n\nThese amounts were found out by visiting the top 10 most visited sites according to Brave Search data:\n\nGoogle.com, Youtube.com, Facebook.com, Amazon.com, Wikipedia.org, Instagram.com, eBay.com, Apple.com, Reddit.com and Yahoo.com\n\nAll websites had accounts signed in and all browsers used either Ublock Origin or the browsers native ad block (Safari used Adguard for Mac) Ad blockers were the only extensions enabled and private mode were turned on for all browsers to ensure the least amount of personal data was shared with the sites.\n\nThere are 2 sets of numbers, and they are categorized by High and Average. High is the max amount of ram found to be used during the testing and average is well the average amount found during testing. Testing time was 4 minutes per site.\n\nNow the numbers:\n\n|Browser|Windows High (MB)|Windows Avg (MB)|Mac High (MB)|Mac Avg (MB)|\n|:-|:-|:-|:-|:-|\n||\n|Chrome|1603|1444|2219|1966|\n|Edge|1703|1437|2328|2048|\n|Brave|1471|1288|1874|1798|\n|Firefox|2308|2143|3239|3077|\n|Vivaldi|1698|1463|2213|1906|\n|Floorp|2439|2125|3681|3414|\n|DuckDuckGo|2497|2327|3827|3513|\n|Arc (not available on Windows 10 yet)|1427|1273|1876|1670|\n|Opera|1723|1545|4075|3810|\n|Safari|-|-|2480|2213|\n\n*Note: Safari is exclusive to Mac. Sites were visited at the same time on each browser.*\n\n*Machine for Windows: Surface Laptop 3 with Intel Core i5-1035G7 CPU @ 1.20GHz, 8 GBs of RAM*\n\n*Machine for Mac: MacBook Air Late 2020 with Apple M1, 8 GBs of RAM*",
        "num_comments": 2,
        "comments": [
            "Chrome vs FireFox, woo!\n\n1.5-2.5GB of RAM is nothing!"
        ]
    },
    "hide/unhide desktop icons with a shortcut on the taskbar": {
        "title": "hide/unhide desktop icons with a shortcut on the taskbar",
        "score": 1,
        "url": "https://www.reddit.com/r/Windows10/comments/1dra2xf/hideunhide_desktop_icons_with_a_shortcut_on_the/",
        "content": "Hi, I would like to know how to hide/unhide desktop icons with a shortcut on the taskbar?\n\nThank you :)",
        "num_comments": 1,
        "comments": [
            "Try the DesktopOK freeware.\nhttps://www.softwareok.com/?seite=Freeware/DesktopOK\n\nPin to taskbar"
        ]
    },
    "My Users folder is almost 1TB. Should it be this big, and can I clear anything in it?": {
        "title": "My Users folder is almost 1TB. Should it be this big, and can I clear anything in it?",
        "score": 45,
        "url": "https://www.reddit.com/r/Windows10/comments/1dqe8vp/my_users_folder_is_almost_1tb_should_it_be_this/",
        "content": "https://preview.redd.it/dcherubpp99d1.jpg?width=452&format=pjpg&auto=webp&s=1cd778ca4ac0bc4afe043d5911e592d2c81b0658\n\n",
        "num_comments": 45,
        "comments": [
            "Install windristat and you will see what take a lot of place.",
            "Do you screen record? Also check your downloads folder",
            "Do you store your files and media in the default windows folders (documents, downloads, music, etc.)?",
            "treesize has a free version, look into it and you'll get a size-sorted list of folders, do what you want then...\n\nalso, best cleaning advice I can give is to take backup of important files and refresh the windows installation",
            "Probably something saving a lot of junk in AppData.\n\nJust check what it is, and clear it",
            "Use the software Treesize, it is perfect for this.",
            "If it contains copies of all your photos and videos from your phone over the years then that's about right...",
            "well, what did you put in it?",
            "That why watch what you install. And use proper 3rd party uninstaller",
            "It's your disk, your folder and your files."
        ]
    }
}