{
    "/r/winnipeg Monthly Market! June, 2024": {
        "title": "/r/winnipeg Monthly Market! June, 2024",
        "score": 12,
        "url": "https://www.reddit.com/r/Winnipeg/comments/1d5lf70/rwinnipeg_monthly_market_june_2024/",
        "content": "Hey, /r/winnipeg. Buying or selling? Post in this thread!\n\nKhajiit has wares, if you have coin.\n\nPlease be mindful of [our rules](https://www.reddit.com/r/Winnipeg/wiki/rules#wiki_winnipeg_monthly_marketplace):\n\n* Individuals buying, selling, soliciting, or promoting goods/services should post a comment in **this thread only**. Do not create your own submission, it will be removed.\n* Serious posts only. Please keep the jokes elsewhere.\n* Please limit your downvoting behaviour in this thread, if you believe something to have broken these rules, please report the comment instead.\n* Do not Buy/Sell/Trade/Promote anything illegal or in a legal grey zone under current Canadian Law.\n* Moderators will not mediate transactions or transaction disputes.\n* No personal ads.\n* [reddit's self promotion rules still apply](https://www.reddit.com/wiki/selfpromotion). Accounts that demonstrate little or no participation on reddit will have their post removed.\n* Accounts that repeatedly try to sell the same item/service time and time again will be barred from participating.\n* Do not post the same thing multiple times in this thread. You **can** post multiple times for different things.\n* Don't make this weird.\n\n**You are participating in a community market, you are not a client who has obtained advertising space, so please do not act like one.** This is a completely regular reddit self-post whose point is to function like a flea market.  This is not an advertising platform which offers things like guaranteed views, metrics, or even a good reception by the community. reddit has [advertising options available](https://www.reddit.com/advertising) if you require advertising services with all the fixin's. I would *highly* recommend engaging with the community and leaving your expectations at the door. If you do not understand what you are getting into there is a chance your brand could be damaged.\n\nLastly, moderators are not making money on this. We are not affiliated with anyone. No we won't promote you. No, we don't accept money. No, not even for you.",
        "num_comments": 23,
        "comments": [
            "Selling trofast ikea set x3",
            "Selling some used PC parts. Ryzen 7 3700x CPU(no cooler) Asus 1660Super 6gb, corsair 16gb RAM DD4 3200mhz",
            "Nintendo switch lite grey comes with charger and is screen protected\nbarely used \n$240",
            "I'm a junior web developer trying to bolster my porfolio. I'd like to have a few actual websites I made to show off to future employers.\n\nI've tried contacting a few places on Facebook, but I'm guessing they probably think I'm a spambot or scammer. So if anyone knows of a place that needs a free website please let me know.",
            "ISO two tickets to the bill burr show on july 19!!",
            "Ps5 controller $80 barely used",
            "Selling a Sony WH-1000XM5 Wireless Noise-Canceling Headphones - 380. Used a few times only.",
            "Hello,\n\nI was planning on ordering a sim and giving them a try by the end of the month. I have a \"Brandon\" number still and when I started the process it didn't complain to me at all. Did something change now?",
            "Hey, my husband is a multidisciplinary artist in need of a website. I'll DM you",
            "ROOM FOR RENT.\n\nApartment in the Corydon and Stafford area. Fully furnished bedroom (bed and desk). All utilities included, one shared bathroom and shared kitchen. $600/mo. \nLaundry is in the basement and operated with a reloadable card. \nSmall storage locker in the basement of the building. \nParking spot available for + $50/month. \nWe (2 women) live with two cats that are mostly with me so they won't bother you. \nEasy bus commuting to both U of M and U of W. \nBus routes nearby: 68, 18, 29, 36, 20 \n\nAmenities nearby: Rexall, Walmart (Grant Park), Superstore (Kenaston), No Frills, Dollar Tree, Starbucks, Corydon/Little Italy, Osborne. \n\nWomen only, 2SLGBTQ+ friendly \n\nAvailable from: June 30th \n\nDM me if you or someone you know could be interested!"
        ]
    },
    "Is Old St Boniface a safe place to live?": {
        "title": "Is Old St Boniface a safe place to live?",
        "score": 15,
        "url": "https://www.reddit.com/r/Winnipeg/comments/1dr98un/is_old_st_boniface_a_safe_place_to_live/",
        "content": "I wanted to stay in central area but not downtown. So I was wondering if Old St Boniface is a good place to live, I saw few new modern condos there, there will be more condo construction too, and it is an region with lots of green area and easy access to downtown area. \nGive me your insights from there, please! Thank you!",
        "num_comments": 8,
        "comments": [
            "Forsure. Been living here for 10 years and love it. There are some sketchy houses and you will encounter homeless people along the rivers but its generally safe, especially if youre in the newer condos.",
            "I owned a condo near Tache and Provencher and loved the neighborhood so much. Walked to work every day. I needed a house and looked for years in the same neighborhood but ended up in buying in another good area. I miss St. Boniface so much and will look to buy a condo there again some day and move back. Dont hesitate.",
            "5yrs in the neighborhood - awesome, walk to the forks, great sunsets and views from tache walkway, downtown is close, as are the marion restaurants, and Whittier park  etc... One of the best neighborhoods in town for convenience.",
            "I never felt unsafe lived on braemar for 14 years",
            "Currently have been living in the area for 1.5 years, and previously lived in the same area back in 2021/2022 for 10 months. \n\nI've always loved living here because it's so central and walkable! Whether you live closer to Marion or Provencher, there are so many cute local cafes/restaurants to check out and indeed, lots of space/area to go for serene, lovely walks.\n\nHowever, do be fair warned that crime is somewhat rising in the area. Especially if you live in a house, your residence/yard might be targeted for petty theft. Car vandalism isn't irregular either; back in the fall my building had a bunch of cars vandalised on a whim. But, I don't really keep anything nifty in the cabin of my car and haven't had anyone touch it while I've lived here. I also personally feel safe walking from my car to my building at night time, but that's mostly because the parking area has a decent amount of security.\n\nWhether it's during the day or at night, while walking down Goulet/Marion (even on tache/Provencher to an extent) you may encounter some colorful people. Generally speaking, so long as you mind your business and don't try to really engage with them they'll leave you alone. But there definitely can be some folks, especially around the no frills/McDonald's on Goulet who might be more... Vocal. My building sometimes has some homeless folks who hang around and try to sneak in via people leaving through the side doors, but my building has really cracked down on preventing shady people from entering.\n\nGenerally speaking (tl;dr): be aware of your surroundings, don't put yourself or your valuables in a position where they can be compromised, trust your instincts and the good should outweigh the not-so good :)",
            ">:)\n\n:)"
        ]
    },
    "LOST DOG ?": {
        "title": "LOST DOG ?",
        "score": 7,
        "url": "https://i.redd.it/m5c1cka4wi9d1.jpeg",
        "content": "He has a brass bell on his collar.\nI saw him on Burrin Ave. and Powers St. ",
        "num_comments": 0,
        "comments": []
    },
    "Winnipeg mayor wants more projects like highrise next to rapid transit station": {
        "title": "Winnipeg mayor wants more projects like highrise next to rapid transit station",
        "score": 45,
        "url": "https://www.cbc.ca/news/canada/manitoba/winnipeg-apartment-building-transit-corridor-1.7250555",
        "content": "",
        "num_comments": 17,
        "comments": [
            "Winnipeg finally having 20th century ideas",
            "Very cool he has the ability to build them and make them public housing then. Two birds one stone.",
            "You know what would be great to build next to Rapid Transit?\n\nThe new South Winnipeg Community Campus",
            ">\"I think the transit network really starts to change the way that we construct our buildings, from parking ratios to just the density of the actual building,\" \n\nIndeed it will.   Why live near downtown when you can live in a safe area and rapid transit to the downtown.   Want to know on what side of the City and where we will be building?  Well, it's the south end.  Just follow the only separated transit line to know where exactly.",
            "Great news.  I hear they will be super affordable and also quite large for a small apartment.",
            "The city does projects with provincial funding and federal funding regularly. But hey who has the time to check.",
            "I'm all for public housing. But municipal government is completely incompetent to manage projects of this scale. It would absolutely terrify me giving them a billion dollars to build and manage that scale of housing.....",
            "Maybe the city should put a tax on rent to pay for it. /s",
            "As long as they are affordable to own for the middle class and not small, that only fits twin mattress I am down.\nUnless it's privately owned by some property management company, how much would we essentially lose ?\nHome is expensive now. Let's face it. The only solution lies in providing affordable housing, even if it's an apartment. \nThe government should also take more initiatives to encourage residents to buy property, and federal mandates need to come in for essentially lower interest rates for 1st time home buyers.",
            "Super brave comment, way to go! \n\nYou're totally right, the city definitely has tens of millions set aside to build and operate capital projects like this. \n\nI'm also pretty sure it's the civic government that runs public housing, but who has time to check."
        ]
    },
    "People of Winnipeg, what makes you stay there and not move to a warmer place?": {
        "title": "People of Winnipeg, what makes you stay there and not move to a warmer place?",
        "score": 25,
        "url": "https://www.reddit.com/r/Winnipeg/comments/1dr40ui/people_of_winnipeg_what_makes_you_stay_there_and/",
        "content": "Title. ",
        "num_comments": 159,
        "comments": [
            "All my stuff is here.",
            "Because I like this city, and my friends/family are here. I love my fam and I want to be with them.",
            "I was raised here so I hate and love the place",
            "There is nothing wrong with the weather here.  Cold in the winter and hot in the summer.  A good sprinkle of in-between",
            "Winnipeg is a very warm place",
            "I have a magnet on my fridge with the province of Manitoba as a cartoon saying its fine, its cheap, itll do.",
            "my mom and no americans",
            "Hard to find a place that is warmer on average, sunnier on average, without extreme heat or humidity, with reasonable cost of living, and with lower crime.",
            "Can't ice fish somewhere warmer. Also -40 is far superior to plus 45 degrees.",
            "Warmer as in where coastal BC? If Im going to relocate for warmer climate it wouldnt be there and moving to the US isnt exactly the easiest task."
        ]
    }
}