{
    "/r/winnipeg Monthly Market! June, 2024": {
        "title": "/r/winnipeg Monthly Market! June, 2024",
        "score": 12,
        "url": "https://www.reddit.com/r/Winnipeg/comments/1d5lf70/rwinnipeg_monthly_market_june_2024/",
        "content": "Hey, /r/winnipeg. Buying or selling? Post in this thread!\n\nKhajiit has wares, if you have coin.\n\nPlease be mindful of [our rules](https://www.reddit.com/r/Winnipeg/wiki/rules#wiki_winnipeg_monthly_marketplace):\n\n* Individuals buying, selling, soliciting, or promoting goods/services should post a comment in **this thread only**. Do not create your own submission, it will be removed.\n* Serious posts only. Please keep the jokes elsewhere.\n* Please limit your downvoting behaviour in this thread, if you believe something to have broken these rules, please report the comment instead.\n* Do not Buy/Sell/Trade/Promote anything illegal or in a legal grey zone under current Canadian Law.\n* Moderators will not mediate transactions or transaction disputes.\n* No personal ads.\n* [reddit's self promotion rules still apply](https://www.reddit.com/wiki/selfpromotion). Accounts that demonstrate little or no participation on reddit will have their post removed.\n* Accounts that repeatedly try to sell the same item/service time and time again will be barred from participating.\n* Do not post the same thing multiple times in this thread. You **can** post multiple times for different things.\n* Don't make this weird.\n\n**You are participating in a community market, you are not a client who has obtained advertising space, so please do not act like one.** This is a completely regular reddit self-post whose point is to function like a flea market.  This is not an advertising platform which offers things like guaranteed views, metrics, or even a good reception by the community. reddit has [advertising options available](https://www.reddit.com/advertising) if you require advertising services with all the fixin's. I would *highly* recommend engaging with the community and leaving your expectations at the door. If you do not understand what you are getting into there is a chance your brand could be damaged.\n\nLastly, moderators are not making money on this. We are not affiliated with anyone. No we won't promote you. No, we don't accept money. No, not even for you.",
        "num_comments": 23,
        "comments": [
            "ROOM FOR RENT.\n\nApartment in the Corydon and Stafford area. Fully furnished bedroom (bed and desk). All utilities included, one shared bathroom and shared kitchen. $600/mo. \nLaundry is in the basement and operated with a reloadable card. \nSmall storage locker in the basement of the building. \nParking spot available for + $50/month. \nWe (2 women) live with two cats that are mostly with me so they won't bother you. \nEasy bus commuting to both U of M and U of W. \nBus routes nearby: 68, 18, 29, 36, 20 \n\nAmenities nearby: Rexall, Walmart (Grant Park), Superstore (Kenaston), No Frills, Dollar Tree, Starbucks, Corydon/Little Italy, Osborne. \n\nWomen only, 2SLGBTQ+ friendly \n\nAvailable from: June 30th \n\nDM me if you or someone you know could be interested!",
            "https://preview.redd.it/4r4120xcpl4d1.jpeg?width=1932&format=pjpg&auto=webp&s=cf1858bd1ffaf634183cff2acc4eeff0b4623862\n\nSelling 3d art cards. Pokemon available soon adding dinosaurs and wildflowers!\n\n15 each, shipping available.",
            "I would like to BUY your shallow Ikea glass containers. Ikea Winnipeg no longer stocks them.\n\nhttps://preview.redd.it/c2hfffxske5d1.jpeg?width=3024&format=pjpg&auto=webp&s=99ae063d7fdee36bb86c5babe3d8b518ab445bd3",
            "ISO: A temporary parking spot in Osborne Village\n\nOur parkade will be under construction starting July 1 for a minimum of 3 months. I'm wondering if anyone has an extra parking spot in the Roslyn/River/Scott area. I've got a Grydpark booked (and I don't want to get that city permit because having to find parking every day with a toddler is not fun) but it's a bit of a walk so I'm seeking something closer. Would ideally like to start parking on June 30.\n\nThanks!",
            "Selling trofast ikea set x3",
            "Selling some used PC parts. Ryzen 7 3700x CPU(no cooler) Asus 1660Super 6gb, corsair 16gb RAM DD4 3200mhz",
            "Nintendo switch lite grey comes with charger and is screen protected\nbarely used \n$240",
            "I've got two unused sim cards for Fizz mobile - $30 for both. [Check out Fizz here!](https://fizz.ca/en)\n\nOne is opened but not used at all; turns out we can't sign up for Fizz without changing our numbers (our phone numbers originate outside of Winnipeg).",
            "https://preview.redd.it/swwezt53tn4d1.jpeg?width=3024&format=pjpg&auto=webp&s=6624b5ae97377797865c832a9b734ca74f5a3113\n\nSelling itchy and scratchy snes games, tested a while ago should be working. Sells for a lot on eBay, hard to find these. Have other games and the console if your interested, let me know",
            "I’ve got four tickets for the Great Outdoors Comedy festival. 2 are for July 19th, 2 are for July 20th! All GA+ tickets and I can transfer right away. \n\nI was going on vacation to Winnipeg in July but unfortunately I am not now and can’t refund.\n\nFull cost $510.00, asking $450."
        ]
    },
    "Garage thieves": {
        "title": "Garage thieves",
        "score": 161,
        "url": "https://i.redd.it/o0fpninmdc9d1.jpeg",
        "content": "Just caught this woman in my backyard trying to look into my garage through the blacked out windows. Glenelm neighbourhood. Watch your stuff.",
        "num_comments": 99,
        "comments": [
            "Garbage ghille suit",
            "https://preview.redd.it/w7hzpcnkjc9d1.jpeg?width=1348&format=pjpg&auto=webp&s=f91a40a5c16e00a391165767f38bc642639fd64c\n\nI see a Madonna",
            "I can fix her",
            "Living her best Grey Gardens summer.",
            "Bro why is everyone stealing on this day. Literally saw someone mug a disabled guy in broad daylight on main after kicking him on the ground. Then a police cruiser comes and misses the action and drives off.",
            "Yep I went into my garage the other week and most of my bigger stuff was placed by the over head door like bike, skill saw, lawn mower, car buffer. So now i gotta get a lock for my o/h door... had been ok for a long time but not no mo... GD street urchins. For now I moved everything valuable into the house",
            "Used to have a spare freezer in my garage till someone stole all the food! Crazy!",
            "Has that macklemore thriftshop style",
            "This genuinely looks like a runway look for an avante garde brand",
            "Serving 2005 Ashley Olsen realness 😝"
        ]
    },
    "Winnipeg mayor wants more projects like highrise next to rapid transit station": {
        "title": "Winnipeg mayor wants more projects like highrise next to rapid transit station",
        "score": 18,
        "url": "https://www.cbc.ca/news/canada/manitoba/winnipeg-apartment-building-transit-corridor-1.7250555",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Very cool he has the ability to build them and make them public housing then. Two birds one stone. ",
            "As long as they are affordable to own for the middle class and not small, that only fits twin mattress I am down.\nUnless it's privately owned by some property management company, how much would we essentially lose ?\nHome is expensive now. Let's face it. The only solution lies in providing affordable housing, even if it's an apartment. \nThe government should also take more initiatives to encourage residents to buy property, and federal mandates need to come in for essentially lower interest rates for 1st time home buyers.",
            "Super brave comment, way to go! \n\nYou're totally right, the city definitely has tens of millions set aside to build and operate capital projects like this. \n\nI'm also pretty sure it's the civic government that runs public housing, but who has time to check.",
            "The city's credit is good enough that they can get a loan, and public housing is not distributed for free, they still charge rent.\n\n\nThough if they wanted to just distributed for free I would certainly not complain. "
        ]
    },
    "car purchase from a dealership with bad credit": {
        "title": "car purchase from a dealership with bad credit",
        "score": 12,
        "url": "https://www.reddit.com/r/Winnipeg/comments/1dr1krj/car_purchase_from_a_dealership_with_bad_credit/",
        "content": "if you're looking at a car at any dealership and have a trade but have bad credit, how do you negotiate?\n\nat what point in the conversation do you find out what **actual finance rate** you'll be getting? or do you have to already commit to the deal (put money down) before they tell you what shitty rate you'll be getting? \n\nfor example., I see a car for $10k on their website, go down there and see it, like it, want it. i Say \"i'd like to trade my current vehicle, how much will you give me? give me a good dollar value for my trade and we'll sign the deal right now.\" we go back and forth with the trade, they finally give me a trade value i'd accept so I know the purchase price $10k minus the trade value = overall price. Do I have to now put money down before they crunch numbers and tell me what interest rate I qualify for? or can they do this before committing to the sale? I dont want to be paying 15%+ for the loan.\n\nhaven't bought a car in over 20 years and it was cash back then",
        "num_comments": 16,
        "comments": [
            "You really do need to look at the overall price and not just the financed price. Do whatever you can to have as much of a cash down payment as possible. If you have bad credit and are purchasing a used vehicle, you're looking at minimum 10% interest these days. ",
            "Usually, you settle on the purchase price (not much wiggle room other than asking price these days at dealerships). Then you negotiate the trade value. You shouldn't need to put money down unless your trade doesn't not have enough value to secure the loan. If that's the case they would let you know what difference you'd likely have to kick in before they go to the lenders. Now, what's left is what you're borrowing. I'll use my experience here. I went to Birchwood Ford. They now approach their lenders, they came back to me with 3 options, ford credit, td auto finance and I forget who the other one was, the basic differences was the interest rate. Then basically you choose who you would prefer to deal with. I went with TD which was the lowest interest rate.",
            "I would get the “out the door “ price of the vehicle then tell them you have a trade in. Don’t let them know before. And don’t say I want monthly payments to be x amount of dollars as they will find a way to get you there. Just my opinion",
            "They will have certain thresholds based on your credit rating. So what would happen is if they approach the lenders, let's say with a 3000 trade value and you put in a 1000, because in past experience the dealership knows most high risk loans require let's say 20% of a $20000 loan=4000. Having said all this, that is what happens with traditional lenders. Banks and auto finance companies. You could just go to like ridetime or someplace that has in-house financing, and they'll tell you exactly what they want down and exactly what they'd give you for your trade.",
            "Well, what I meant is that the dealership does the financing themselves. So yes, Birchwood is one that does that for new and used cars. Then there's the places that cater almost exclusively to folks with poor credit, bankruptcies, and the like, such as ridetime. Where they aren't actually creating a loan, they are giving you the car with a promise to pay them an agreed upon price over an agreed upon time frame, the caveat here is, is you fall behind in payments they just disable the car remotely and come pick it up as technically they are still the owner of the vehicle. Whereas if you go to a lender, you've borrowed money, bought a car that is yours, and if you miss payments, there's a legal process of repossession the lenders have to go through.",
            "most places won't finance a car older than a certain ago as well as lower than a certain price, so.im gunna say if it's a 10k car with a trade in of a few thousand then you'll need to have the rest on hand. you can also contact Canada drives to see what interest rate they'd be able to get you.",
            "In my experience, the salesman will want to know if you're financing, you'll figure out the purchase and trade in price with him, and then you'll go to the financing office, where they will use the numbers from the salesman, and your credit info, to give you a rate and a payment.",
            "if you're looking at an older used vehicle and your trade is newer with less km, will they always lowball your trade? ie, they'll never give you 1/2 off the purchase price with your trade?",
            "hi thanks. so you mean they know right away if my trade will be too low to secure financing on poor credit? they have a minimum number to meet as a down payment before even attempting financing?   \nwhy do they give you a choice of financers? wouldn't everyone one pick the one offering the lowest interest?",
            "thanks you but i'd be driving there with the car that I want to trade. I'd assume they'd know it might be a trade. Are all financing open? meaning I could pay it off sooner than term? I'd be more comfortable have a lower biweekly payment but I know they'd have to extend the loan to ridiculous lengths of time. I'd prefer that though because once I start getting my finances back in the right direction, I'd put more money down on paying it off sooner."
        ]
    },
    "Ketchup Cheetos": {
        "title": "Ketchup Cheetos",
        "score": 13,
        "url": "https://i.redd.it/r734gqy6bf9d1.jpeg",
        "content": "Has anyone seen Ketchup Cheetos? I've found Ketchup Lays, old Dutch, Ruffles, but I can't find the Cheetos one. ",
        "num_comments": 6,
        "comments": [
            "Son we like our ketchup chips around these parts. This just seems irresponsible… and terrible… and maybe delicious?",
            "not recently (i haven't been looking) but i did buy some from co-op a month or two ago",
            "I can't find them anywhere now. They were here and gone in a flash, it seems. They are so good and dairy and gluten free !",
            "Ugh, disgusting!",
            "Just food reviews sez. https://m.youtube.com/watch?v=GFz0VJtLS_c",
            "I’m not sure I can sanction this buffoonery."
        ]
    }
}