{
    "Zur Erinnerung - Posts des GF-Users \"IchDirk\" werden hier sofort entfernt.": {
        "title": "Zur Erinnerung - Posts des GF-Users \"IchDirk\" werden hier sofort entfernt.",
        "score": 69,
        "url": "https://www.reddit.com/r/wirklichgutefrage/comments/1dpmgfr/zur_erinnerung_posts_des_gfusers_ichdirk_werden/",
        "content": "\nSiehe: https://www.reddit.com/r/wirklichgutefrage/comments/17lyqdq/ichdirk_posts_werden_ab_jetzt_gel%C3%B6scht/\n\nMan muss Menschen, die \n\na) ziemlich heftig trollen oder \nb) ihre sehr seltsamen Neigungen gegenüber Minderjährigen im Internet ausleben\n\nnicht auch noch eine Bühne geben.\n\n(Posts anderer User, die in eine gleiche Richtung gehen, zählen dazu natürlich auch.)",
        "num_comments": 24,
        "comments": [
            "Sind nicht cirka 80% der Posts exakt dieser Art?",
            "Vielleicht solltet ihr ein Reddit-Wiki erstellen, in dem alle \"verbotenen\" User stehen. So wäre es einfacher, einzusehen, wer tabu ist",
            "Sind nicht 90% der Posts hier anzuwenden auf b)?",
            "Ich bin Dirk",
            "Dann dürfte man hier ja gar nichts mehr posten. Im Grunde genommen, sollte man mittlerweile alles was im Internet entsteht auf Echtheit anzweifeln. Quasi jeder Post hier liest sich wie ein troll. \n\nZu Punkt b.\n\nWieso? Ich weiß nicht wie gutefrage aufgebaut ist, ob es dort die Möglichkeit gibt pn's zu schreiben. Wenn ja, kann ich mir gut vorstellen, dass genug Leute von hier anfangen eben diese Leute zu Trollen oder zu belästigen und im Ernstfall evtl auch andere Schritte einleiten. \n\nAlso schauen wir weg?^^",
            "könnt ma mal eine Liste von derjeinigen machen?",
            "Von mir aus dürft ihr gerne alle posts dieser art entfernen.",
            "80% der Posts sind auch vom ihm.",
            "Es sind 180%",
            "Einfach Regel b) beachten, es ist nicht so kompliziert wie du glaubst."
        ]
    },
    "Sex an Risky Orten": {
        "title": "Sex an Risky Orten",
        "score": 269,
        "url": "https://www.reddit.com/gallery/1dqp6pg",
        "content": "Finde Polizeistation echt geil, vorallem wenn die mit dem Knüppel nachhelfen. \n\nImmer richtig geil",
        "num_comments": 52,
        "comments": [
            "\"Steck ihn rein!\" fordert sie mich auf und ich schaue etwas überfordert auf den Prügel in meiner Hand. Die 20 Männer um uns Rum haben ebenfalls ihre Prügel rausgeholt und schauen mich erwartungsvoll an. Aber wie war ich hierher geraten?\n\nSpringen wir drei Stunden zurück.\n\n\"No risk no fun\" hatte ich mit einer übertrieben lockeren Geste geantwortet, als sie mir vorschlug, man könne doch Mal in einer Polizeiwache Sex haben...",
            "Ich bin mir sicher man kann dem grauen Wolf bedenkenlos vertrauen",
            "Blitzschnell recherchiert",
            "Kindergarten",
            "Problem: Einzelhaft",
            "Geh doch mal Sonntags mit deiner Perle in die Kirche , das Klatschen ist der Hammer glaub Mir und wenn dann erst der Beifall kommt . ☺😁",
            "Beim em Finale aufm Spielfeld, da werdet ihr auf jeden Fall beobachtet 🤣",
            "Was genau ist diese Recherche von der er redet?",
            "Einkaufszentrum in der Umkleidekabine\nAuf der Arbeitsstelle\nAutokino\nHotels\nSchwimmbad\nWald im Auto",
            "AKW wäre mein erster spontaner Einfall."
        ]
    },
    "Suche Aufgabe 18+ Männlich": {
        "title": "Suche Aufgabe 18+ Männlich",
        "score": 243,
        "url": "https://www.reddit.com/gallery/1dqp3lm",
        "content": "An sich durch die Fragestellung ersichtlich. \n\nWollte mir selbst nen Bild machen wie dumm die fragen sind, nunja. \n\nVll findet man ja antworten um den Armen Jungen zu helfen. ",
        "num_comments": 34,
        "comments": [
            "- Altersvorsorge \n- sein Leben im Griff haben",
            "Online Coaching gründen und Porsche CAYMAN S fahren !!!",
            "Beweisen, dass Wurzel 2 irrational ist, ist absolut nicht 18+. Gewöhnlich ist das Stoff so im Bereich der 9. oder 10. Klasse, also mehr so für 15-16-Jährige.",
            "Für einen selbsternannten Sex- und Penisexperten gibt Jonas ein paar erstaunlich vernünftige Tipps",
            "Spieloooo",
            "Das Geld vom Kredit im Puff verprassen.",
            "Steuererklärung",
            "Genau das, Schulden machen, Alkoholiker werden, Privatinsolvenz anmelden, was noch?",
            "Ich möchte ein Experte in Penis werden.",
            "Das ist mega dumm und ergibt überhaupt keinen Sinn???\n\nIch hab den Wellensittich schon mit 16 ausgemistet."
        ]
    },
    "Seine Quelle ist Tiktok": {
        "title": "Seine Quelle ist Tiktok",
        "score": 43,
        "url": "https://i.redd.it/sinfdy7tpe9d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "Okay, Leute, ich geb das hier auf. Menschheit, Internet, waren nette Versuche. Hat alles nicht funktioniert. Ich lebe ab jetzt einfach bei den Kegelrobben! Lebt wohl!",
            "Und schon wieder jemand, der eine lebenslange Internetsperre braucht...",
            "Das ist halt so ekelhaft. Schlechter und unlustiger Troll.",
            "Wie lauten die Antworten bei gute Frage?",
            "Wenn damit der Trieb erfolgreich befriedigt wird, und die Feministinnen das so gut finden, warum denn nicht?",
            "Schreibst du uns ne Karte?",
            "Glaub die beissen.",
            "Er hat irgendeinen Tiktok link darunter gepostet von einr Dame die mal beim NDR gearbeitet hat oder so, die behauptet dass sie das getan hätte und das das gut ist",
            "Manche haben sehr verdrehte Sex Fantasien",
            "Ich schreib euch 'nen Hering, versprochen."
        ]
    },
    "Kletternde Ausländer": {
        "title": "Kletternde Ausländer",
        "score": 179,
        "url": "https://i.redd.it/fxkw6awe2a9d1.png",
        "content": "",
        "num_comments": 39,
        "comments": [
            "Ich mag den Anblick nicht, wenn der Typ klettert. Er mag es nicht, mit einem Elektroschocker niedergestreckt zu werden.\n\nWir sind quitt.",
            "Bei braunen Mexikanern nicht. Bei weißen Mexikanern mit Schnauzer und rosa Sombrero wird ein Bußgeld fällig...",
            "Qué?",
            "Wenn man beim Bouldern mal wieder Hausverbot bekommt...",
            "Letztens wollte ich bouldern gehen. Da hängt da so ein Franzose in der Wand. Ich habe den von hinten in die Hoden geschockt, bis die hartgekocht waren. Denn in DEUTSCHLAND geht sowas nicht. Kletternde Ausländer...",
            "... und deswegen habe ich nun Hausverbot in der Boulderhalle",
            "Elektroschocks? Daran merkt man, dass der Fragesteller noch neu in der Szene ist. Wahre Connaisseure  abartiger Ausländerfeindlichkeit wissen, dass da noch viel mehr geht...",
            "Fake. Die können nicht klettern",
            "Kriege Elektroschocks wenn ich rote Mexikaner in einer Kneipe trinke.",
            "Ich dachte es ist lediglich erlaubt Ausländer im Meer ertrinken zu lassen."
        ]
    }
}