{
    "The Witcher 3 REDkit is now available for free to all owners of the game on PC": {
        "title": "The Witcher 3 REDkit is now available for free to all owners of the game on PC",
        "score": 37,
        "url": "https://www.reddit.com/r/witcher/comments/1d0fz33/the_witcher_3_redkit_is_now_available_for_free_to/",
        "content": "The Witcher 3 REDkit is a comprehensive modding tool from CD PROJEKT RED and Yigsoft which allows you to customize and expand your experience in The Witcher 3: Wild Hunt universe.\n\nHere is more information on The Witcher 3 REDkit and tutorials\n\n[https://www.thewitcher.com/us/en/redkit](https://www.thewitcher.com/us/en/redkit)\n\n[https://www.youtube.com/@thewitcher](https://www.youtube.com/@thewitcher)\n\n&#x200B;\n\nThe Witcher 3 REDkit is available for free to all owners of the game in Steam, GOG, and EPIC\n\n[https://store.steampowered.com/app/2684660/The\\_Witcher\\_3\\_REDkit/](https://store.steampowered.com/app/2684660/The_Witcher_3_REDkit/)\n\n[https://www.gog.com/game/the\\_witcher\\_3\\_redkit](https://www.gog.com/game/the_witcher_3_redkit)\n\n[https://store.epicgames.com/en-US/p/the-witcher-3-wild-hunt--redkit](https://store.epicgames.com/en-US/p/the-witcher-3-wild-hunt--redkit)",
        "num_comments": 2,
        "comments": [
            "This is so amazing. I love the quests where you find notes and come upon sullen stories and decrepit buildings. It fleshes out the world.\n\nI'm gonna get my hands on this and go nuts!\n\nAlso, xLetalis might make more eater egg videos!"
        ]
    },
    "How do ya like that silver?": {
        "title": "How do ya like that silver?",
        "score": 88,
        "url": "https://www.reddit.com/gallery/1dr0tlw",
        "content": "Bought myself Aerondight for my birthday this year 🥳",
        "num_comments": 6,
        "comments": [
            "May I ask where did you buy it ? For how much ? And is it a real sword or a copy (just for display) ?",
            "Is that from Kaer Morhen forge?",
            "Now all you gotta do is get it professionally sharpened",
            "Inquiring minds need to know. That thing is gorgeous!!",
            "You can buy the swallow (Ciri's sword) on Amazon, but it's plastic tho.",
            "No, you can get this sword in DLC Blood and wine as a part of some side quest that I don't remember the name"
        ]
    },
    "Yall every play with corn rows Geralt?": {
        "title": "Yall every play with corn rows Geralt?",
        "score": 313,
        "url": "https://www.reddit.com/gallery/1dqmhla",
        "content": "No mods, just a perfect glitch.",
        "num_comments": 35,
        "comments": [
            "One of the many effects of the mutations. Lol.",
            "This seems more like early stage alopecia Geralt",
            "Those aren’t cornrows. Them mfs are corn husks",
            "https://preview.redd.it/eylkech2cc9d1.png?width=1920&format=png&auto=webp&s=fcfd5e31feffe3bd63f9b84fddfb90715ad9025d\n\nThis Geralt has seen some weird shit",
            "Bro picked up that one easter egg spoon and found himself mid transition to Gollum",
            "Damn! The real monster is his barber",
            "Looks more like Geralt losing his hair from stressing over Gwent",
            "He needs some monoxidil, finasteride, and a derma roller ASAP\n\nandrogenetic alopecia is a bitch but it doesn’t have to be permanent! You got this Geralt!",
            "“Anybody got some of that fisstech?”",
            ">*corey taylor enters the fray*"
        ]
    },
    "Ciri cosplay by me | Made all the details myself expect for the sword": {
        "title": "Ciri cosplay by me | Made all the details myself expect for the sword",
        "score": 432,
        "url": "https://www.reddit.com/gallery/1dqhn6y",
        "content": "",
        "num_comments": 23,
        "comments": [
            "Cool",
            "How many ticks you got from that session in the grass :D?",
            "You look amazing, great work! What did you use to make the belt?",
            "Awesome 😍",
            "And the camera angles I love it makes it so much cooler props",
            "Absolutely love the shirt and all the leather stuff.\n\nBelieve me or not but from the very beginning I was looking for boots picture. Love them as well. Where u got them?\n\nUPD: forgot to add u look very decent!\n\nUPD2: fuck... The place is amazing! Very authentic!",
            "The medallion is a nice touch",
            "Oh my god! 1: someone MADE their costume!\n2: It looks professional 3: the scenery and photos are great and 4: no OF crap. Thank you for sharing! Keep up the awesome work.",
            "Thanks!",
            "None, thank god 😁. I was worried about it and got vaccinated before the session and I also used a spray against ticks. But mosquitoes literally ate my photographer"
        ]
    },
    "Damn it Roach...": {
        "title": "Damn it Roach...",
        "score": 80,
        "url": "https://v.redd.it/qj40n829rc9d1",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Glad to see the next gen update is bringing next gen Roach shenanigans. This is a thing of beauty.",
            "Looks like a slowmo dirtbike trick",
            "I love this game lol",
            "The other day I fell into shallow water in skellige while riding and I couldn't call roach again for like 3 hours"
        ]
    }
}