{
    "Less parading and more marching/protesting/rioting as needed.": {
        "title": "Less parading and more marching/protesting/rioting as needed.",
        "score": 1784,
        "url": "https://www.reddit.com/gallery/1d65szn",
        "content": "",
        "num_comments": 38,
        "comments": [
            "Attending Pride parades IS a form of protest and activism! \n\nI will be wearing my 1991 ACT UP protest t-shirt to my 33rd annual Pride Parade held in DC this year. It is always an act of defiance to take a stand and show up.",
            "The Boston dyke march and all ACT UP actions are requiring masking because we don't leave the disabled behind.",
            "Okay but I've never felt the level of acceptance that I felt at pride... so keep parading plz.",
            "I love this post. While I love the celebration vibe at pride events, we need to be honest about history and what's at stake right now. The mothers and fathers of the LGBT rights movement would certainly be telling us to sound the alarm right now. Remember, it wasn't even 50 years ago that Harvey Milk was murdered. Or that scores of people died from AIDS because society didn't deem them human enough to try for a cure.",
            "Slide 9 are Sylvia Rivera and Marsha P Johnson, leaders of the Stonewall movement.",
            "Joy in the face of violence is also a form of resistance.",
            "May I piggyback on this and ask for ideas? I have a pride flag I usually hang on my balcony in the summer (the winters are nasty here, that's why only in the summer) and I'd like to write a slogan on it. Something inclusive and on the point. It can't be to long, maybe three words max because the flag is pretty small and the balcony is so high it's otherwise impossible to read.",
            "If your feminism doesn't intersect with LGBTQIA+ rights, or race rights, or worker's rights, or disability rights, then you're not riding the current wave sisters! (Not cis-ters!)\n\nI appreciate that last slide so much rn",
            "Given that rainbow capitalism is such a preformative act, beyond commodifying the movement it sets up an easy layup for bigots to topple and feel emboldened. I could argue that it's actually harmful.",
            "I’ve always wanted a pin that says “the first pride was a riot.” I have a bunch of pictures of old school pins saved so i can make one eventually"
        ]
    },
    "☀️🔥 Litha & Summer Solstice - 20 June 2024 🔥☀️": {
        "title": "☀️🔥 Litha & Summer Solstice - 20 June 2024 🔥☀️",
        "score": 38,
        "url": "https://www.reddit.com/r/WitchesVsPatriarchy/comments/1djlijg/litha_summer_solstice_20_june_2024/",
        "content": "#Midsummer / Summer Solstice:\n \nWelcome to the latest sabbat informational post! Throughout the year, we will be posting these threads to share general information about the next upcoming sabbat so WvP's witches, new and old, can prepare for the holiday. These posts will contain basic information about the holiday and open up the floor for further questions or discussion. \n \nFor our **Southern Hemisphere** witches, you'll be approaching the opposite end of the solstice spectrum, heading into the dark part of the year and the beginning of Yule. You can check out our thread about Yule [here](https://www.reddit.com/r/WitchesVsPatriarchy/comments/18i99sr/yule_the_winter_solstice_2122_december_2023/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button). \n \n---\n \n# ☀️ Midsummer & the Summer Solstice ☀️\n \n---\n \n### *What's Midsummer? What's the Summer Solstice? When are they and how are they different?*\n \n**Midsummer** (or **Litha**, pronounced *LEETH*-ah) is one of the eight sabbats of the modern pagan Wheel of the Year. It is one of the \"lesser sabbats\", meaning that it is based around either an equinox or a solstice. The others are Mabon (Autumnal Equinox), Yule (Winter Solstice), and Ostara (Spring Equinox). There's a section that goes into the history and connections of Midsummer in more detail below if you're interested.\n \nThe **Summer Solstice** is an astronomical event that happens once a year and marks the event when one of the earth's poles has its maximum tilt toward the Sun. It occurs between 20~22 June each year in the northern hemisphere. In many Western cultures, this starts the beginning of Summer. This year, the summer solstice falls on **20 June**.\n \nMany cultures around the world celebrate midsummer in some shape or form. Witch and Pagan Midsummer celebrations generally combine aspects of Western European (primarily Irish and British) midsummer traditions and the Druidic \"Alban Hefin\" festival. In Wicca, the midsummer celebration is called Litha, the name based on the writings of Bede. \n \nWhat all of this comes down to is basically this: if you're new to celebrating Midsummer, you have a lot of different directions to look! \n \n---\n \n### *Midsummer: History, Connections, and Modern Practice*\n \nHistorically, humans have been celebrating the Summer Solstice for thousands of years. It's an astronomical event that's simple to understand and appreciate, and it's a great time for a big party, especially in Europe where the long, warm evenings are extra nice. One interesting early Solstice observation was to make a giant wheel of wood, set it on fire, and then roll it down a hill into a river or lake, to bring fire and water into balance. In Rome, the people honoured Vesta during the celebration of Vestalia. \n \nJust as they did to so many other pagan holidays, Christians co-opted the pagan Midsummer celebration, turning it into the feast day for St. John the Baptist, which officially falls on 24 June. All across Europe, Saint John's fires began to replace the older, traditional midsummer bonfires... \n \nIn modern times, the longest day of the year is still the time for festivals all around the world. [The Midsummer page on Wikipedia](https://en.wikipedia.org/wiki/Midsummer) talks about some of these traditions. Many of them, especially in Europe, still hold connotations with St. John and therefore remain on 23 or 24 June. However, pagan elements remain and you can still see the blending of old solstice observances with the more modern Christian feast day. This practice is especially noticeable in Eastern Europe, with one of the best examples of this being the festival of [Jaanipäev](https://en.wikipedia.org/wiki/Jaanip%C3%A4ev) in Estonia. \n \nMidsummer is also an important time for the Fae Folk, so the various cultures and religions that revere or otherwise pay tribute to the Fae often honour or celebrate them during this day. In Celtic tradition, Midsummer is strongly connected to Manannán mac Lir, god of the sea and king of the Otherworld, as well as the goddess (and/or fairy queen) Áine. Many people still honour Manannán on this day in his traditional home of the Isle of Man. \n \nOutside of the sphere of Western Europe and Christianity, other cultures have their own ways to mark and celebrate the solstice. In Hinduism, Uttarayana ends with the summer solstice and this is celebrated with the kite-flying festival of Makar Sankranti. Many people of Chinese heritage in different countries and regions celebrate the Dragon Boat Festival. If you know of any other cultural celebrations for the solstice, you would be most welcome to share them! \n \nAs a part of the Wheel of the Year, Midsummer follows Beltane and summer is in the air! The air is fresh with the smell of warmth and growth, and the first summer harvests are in. Days have been getting longer and warmer, and the earth is awash in fertility and energy. This all comes to a climax on midsummer, one big celebration before the days begin to lengthen. Midsummer is above all else a celebration of the sun, abundance, love, and balance.\n \nIf you look at the sabbats as a reflection of the self, Midsummer is the time to focus on love of all kinds. It's a wonderful time to spend time with friends, make romantic commitments, or begin the search for a new partner. What kind of love would you like to foster the most this year? Along the way, make sure you spend plenty of time and energy on loving yourself, particularly if you are a person for which that does not come easily. The more love you have for yourself, the more you will be able to spread it to others. \n \n**Symbols:** Sun, Bonfire, Sun Wheel, Dolmen, Fae, Flowers, Seashells        \n**Element:** Fire      \n**Colours:** 🌈 All the colours of the rainbow are great for Midsummer! 🌈    \n**Plants/Herbs:** Oak, Mistletoe, Sunflowers, Elderflower, Saint John's Wort, Rose, Basil, Sage    \n**Foods:** Honey, Summer Fruits, Pumpernickel Bread, Mead, Cakes\n \n---\n \n### *Simple rituals and ways to celebrate Midsummer include:*\n \n* Get up early to watch the sunrise and/or stay up late to watch it set. \n* Watch the [Summer Solstice 2023: Sunrise Live from Stonehenge](https://www.youtube.com/live/w2KHYef-LRU?feature=share) livestream event hosted by English Heritage.\n* Look for any local Midsummer celebrations in your area, such as bonfires. \n* Otherwise, you can create a Midsummer bonfire of your own! Please use proper fire safety measures. \n* Host a [Fae Midsummer Ritual](https://atthesignofthewhitehart.wordpress.com/2016/09/05/midsummer-rite-for-the-fae/), or otherwise honour the Fae by leaving out some cream, bread, or baked goods overnight. \n* Make an offering at the sea (or other body of water) for [Manannán mac Lir](https://en.wikipedia.org/wiki/Manann%C3%A1n_mac_Lir). Some traditional offerings include rushes or ale. \n* Take part in a [Handfasting Ceremony](https://www.thecelebrantdirectory.com/blog/the-art-of-handfasting/), traditionally held around Midsummer in June. This is also a great time for people in committed relationships to renew their vows, romantic or otherwise. \n* Walk in nature to appreciate the new growth and the changing of the seasons. It's a great time to visit your local national or [state parks](https://www.stateparks.org/). \n* Do as much as possible at or around noon, or whenever the sun is at its highest in your location and time zone. The sun at its zenith at Midsummer is when it is at its strongest. \n* Set up, clean, and/or refresh your altar for the summer season. [Tumblr has lots of ideas if you're lacking inspiration!](https://www.tumblr.com/search/summer+altars) \n* Make some Solstice Sun Water. \n* Perform a Midsummer/Litha seasonal rite/ritual. [Here](https://www.patheos.com/blogs/johnbeckett/2015/06/summer-solstice-a-solitary-ritual.html) is an example of a solitary Litha ritual, for practicing witches without a coven. Additionally, [this page](https://www.ravenandcrone.com/catalog/a8/Litha,-Summer-Solstice-Rituals,-Activities-and-Lore/article_info.html) has a nice assortment of many different Midsummer rituals. Additionally, Midsummer is seen as the ideal time to perform spells, rituals, or divinations about love. \n* For (aspiring) Kitchen Witches, bake some Midsummer-inspired dishes with honey and all sorts of seasonal fruits and veggies. You can see some wonderful pagan-inspired Midsummer recipes [here](https://www.goddessandgreenman.co.uk/litha), [here](http://www.ravenandcrone.com/catalog/a4/Litha,-Summer-Solstice-Food-Recipes/article_info.html), and [here](https://www.learnreligions.com/recipes-for-the-summer-solstice-4136752).\n* For our Crafty Witches, you may wish to take a look at some [Summer Solstice inspired crafts and projects](https://www.learnreligions.com/summer-solstice-craft-projects-4136751)\n* Celebrate by eating and cooking with [seasonal produce](https://snaped.fns.usda.gov/seasonal-produce-guide).\n \n---\n \n### *Tips for New and/or Broom Closet Witches*\n \nMidsummer celebrations and bonfires are pretty standard fare in the west these days, so a celebration of this sort is the easiest for broom closet witches to take part in, along with watching sunrise and sunset. Flowers, bright colours, honey, cakes, and the joy of warmth and the season are all relatively safe things to participate in without giving yourself away as a pagan. Even watching the Solstice celebrations at Stonehenge online can be written off as curiosity or scholarly interest, since they normally don't do such things. \n \nAll things considered, the summer solstice is probably the easiest of the days in the wheel of the year to celebrate, so make the most of it! Enjoy life to its fullest, as much as you can, in preparation for the shortening days and larger harvests coming in the future. \n \nMuch of the importance of the Wheel of the Year is to really incorporate yourself with nature and the earth's yearly cycles. Take this opportunity to think about the solstice and the summer season and what they mean to you. Walk through nature to appreciate the warmth and bounty of summer. See what animals are active where you live. How are the young animals born in your area growing along? What fruits or vegetables are already being harvested? \n \n---\n \nFeel free to ask any questions you might have below or otherwise use this post for discussion about Midsummer!\n\nSpecial thanks to Einmariya for research, content, & dedication to holidays. 💗☀️",
        "num_comments": 3,
        "comments": [
            "I’m going to take a nice long walk and enjoy some honey cakes. Maybe I will sort through my collection of new crystals.",
            "For the past several years, I've loaded up on water and snacks and spent as much of the day as possible at the local hiking park."
        ]
    },
    "One month in, zero makeup, already looking pretty androgynous. Will I ever get to be a girl? ": {
        "title": "One month in, zero makeup, already looking pretty androgynous. Will I ever get to be a girl? ",
        "score": 1077,
        "url": "https://i.redd.it/1avwaknc3g9d1.jpeg",
        "content": "",
        "num_comments": 111,
        "comments": [
            "I was scanning and not reading and my brain said \"woman\" so I think you're there 😁 I stopped and read because I'm trying to untrain myself gendering people quickly but at least this time I got it right!",
            "You are beautiful! Your skin is flawless, you really have no need for makeup!",
            "The beautiful thing about witches is that it is ALL about intent. If your heart and soul are that of a woman, you’re already there. And to be honest, that’s what I registered before I even read your words.",
            "as someone who is AFAB— the way i ✨wished✨ i looked this beautiful with no makeup!! you are stunning",
            "A few thoughts: you are a girl, even if you don't look like it yet. Only a month in you won't have seen many effects of HRT and you definitely will look significantly more feminine in the near future. It'll be slow and subtle and you might have trouble noticing but it will happen. \n\nIt feels like you're really asking if you'll ever pass and if you'll be treated as a woman. Hopefully yes, but it does depend on a few factors. Primarily luck and effort. Also if you live in a western country it's going to be much easier for you because westerners are very very bad at clocking trans-fem asians. Transitioning is difficult and a journey but it will pay off and you will be happier for it. I wish you the best of luck, sister.",
            "Girl you look like one of those “early 2000s actress without makeup.. timeless beauty” articles 😭 💓",
            "Amiga, you're already there.\n\nYour skin is fucking flawless btw. What is your routine?!",
            "You will, trust the process and believe in the real you. Give her time to emerge.",
            "I always feel a little more put together when I am wearing earrings. I'm a huge fan of expressing myself through earrings, from tiny gold hoops and pearl studs to dinosaurs and huge dangle flowers! Even when I rocked a super short pixie, no makeup, and nasty acne, earrings helped me feel cute.",
            "Excuse me miss., but all I see...is a very beautiful young woman. 💜"
        ]
    },
    "Having my cake day today. I am turning a quarter of a century ": {
        "title": "Having my cake day today. I am turning a quarter of a century ",
        "score": 201,
        "url": "https://i.redd.it/7lmpp8tgei9d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Happy solar return and happy birthday! 🎉",
            "Happy Birthday, you are such a beautiful witch.",
            "Happy Real Life Cake Day! May it be delicious!",
            "Enjoy the milestone. May it be a year filled with blessings. Happy birthday!",
            "Happy birthday! 🎂❤️",
            "Happy Birthday!"
        ]
    },
    "Learning to drive at 21 because I'm autistic 😅": {
        "title": "Learning to drive at 21 because I'm autistic 😅",
        "score": 2090,
        "url": "https://i.redd.it/gmbl9ese6e9d1.png",
        "content": "This is a screenshot from my blog but I want some people to celebrate with. I know I'm really late to it, but I've struggled massively with a severely debilitating anxiety disorder and actually figured I wouldn't live long enough to graduate highschool. Now I'm not only a graduate but I have a job I love, am planning for college and am learning to drive a car, which is something I never thought I'd be able to do. The world is pretty shit right now, but I'm making progress despite it. I think that's worth celebrating. ",
        "num_comments": 225,
        "comments": [
            "Hey, I only got my lisence when I was pregnant with my first at  32 yo. There’s no rules. Go get it !!",
            "Driving is a legit terrifying thing to do. I don't blame you for waiting. I'm not autistic, but I have adhd, and there's just so many things to pay attention to. I didn't expect social signaling to be a thing I'd have to learn, driving a car, for example. You'll get the hang of everything pretty quickly though, with the practice. ",
            "Aw man!  I LOVE the driving gloves and hat! And your big forehead. I have one too. 😊",
            "Congrats! I also did not get my driver’s license se until I was 21. All progress is good progress, you should be proud! I’m also glad you’re thinking about and planning for the future, even though it is probably going to be rough. All the more reason to rely on each other!",
            "I got my license at 27, you've got this!",
            "Get it! You're doing so well! I had a LOT of anxiety around driving, and didn't get my licence until I was 37. You're running laps around me! One step at a time, you've got this! 💪🏻",
            "I'm 52, I will never be able to drive but I'm so happy for you 😀",
            "Congrats on taking the first steps! I was super anxious about driving too but it does get better the more you do it.\n\nYou've got this 😊",
            "Congratulations! Teaching me to drive put some miles on my dad.",
            "My parents tried, bless them, but taking drivers ed with an instructor really helped me. Congratulations! Never too late."
        ]
    }
}