{
    "The Witcher 3 REDkit is now available for free to all owners of the game on PC": {
        "title": "The Witcher 3 REDkit is now available for free to all owners of the game on PC",
        "score": 36,
        "url": "https://www.reddit.com/r/witcher/comments/1d0fz33/the_witcher_3_redkit_is_now_available_for_free_to/",
        "content": "The Witcher 3 REDkit is a comprehensive modding tool from CD PROJEKT RED and Yigsoft which allows you to customize and expand your experience in The Witcher 3: Wild Hunt universe.\n\nHere is more information on The Witcher 3 REDkit and tutorials\n\n[https://www.thewitcher.com/us/en/redkit](https://www.thewitcher.com/us/en/redkit)\n\n[https://www.youtube.com/@thewitcher](https://www.youtube.com/@thewitcher)\n\n&#x200B;\n\nThe Witcher 3 REDkit is available for free to all owners of the game in Steam, GOG, and EPIC\n\n[https://store.steampowered.com/app/2684660/The\\_Witcher\\_3\\_REDkit/](https://store.steampowered.com/app/2684660/The_Witcher_3_REDkit/)\n\n[https://www.gog.com/game/the\\_witcher\\_3\\_redkit](https://www.gog.com/game/the_witcher_3_redkit)\n\n[https://store.epicgames.com/en-US/p/the-witcher-3-wild-hunt--redkit](https://store.epicgames.com/en-US/p/the-witcher-3-wild-hunt--redkit)",
        "num_comments": 2,
        "comments": [
            "This is so amazing. I love the quests where you find notes and come upon sullen stories and decrepit buildings. It fleshes out the world.\n\nI'm gonna get my hands on this and go nuts!\n\nAlso, xLetalis might make more eater egg videos!"
        ]
    },
    "How many of you are angry at Netflix and completely stopped watching Witcher season?": {
        "title": "How many of you are angry at Netflix and completely stopped watching Witcher season?",
        "score": 241,
        "url": "https://www.reddit.com/r/witcher/comments/1dr8twg/how_many_of_you_are_angry_at_netflix_and/",
        "content": "I saw the ratings...and Google shows it like it's one of the best shows out there. It is rated 4.6 and every second website follows 8/10 rating. \n\nI honestly dislike Witcher season. I am a hardcore fan having played all games and having read a few of the books. This makes me wonder if I am in minority. \n\nP.S. Netflix had the gold mine of the decade. A literal step by step guide, well established fan base, and tons of money to grow that franchise into a billion dollar diamond. And one of the best possible lead actors...  \n",
        "num_comments": 116,
        "comments": [
            "After the trainwreck that was season 2, I just stopped caring since I realized it wasnt really witcher; it was just some bad fanfic.",
            "Anger turned into indifference a long time ago.",
            "I didn't even bother with season 3. There are lots of deviations that I can let slide, but they made Eskel a carbon copy of Lambert and killed him off. Later I found out how they cast the actress for Margarita and I felt so relieved I didn't continue watching.",
            "Stopped watching after season 1...",
            "Oh you're still watching? I stopped on the last episode of Season 1. It's insanely disrespectful not only to the fans but to the author, story and game producers.",
            "Left the show after season 2. Later, when Henry announced that he wouldn't reprise his role in S4, my conviction became stronger. ",
            "Stopped after two. One was pretty neat and I was cautiously optimistic. What a tragedy.",
            "I did not, nay *could* not watch season three.\n\nNetflix did Henry and the source material dirty and it broke my heart.",
            "It sucks so I'm not watching it. Simple",
            "Huh you kept watching? S2 was so bad that I dropped it entirely."
        ]
    },
    "How do ya like that silver?": {
        "title": "How do ya like that silver?",
        "score": 306,
        "url": "https://www.reddit.com/gallery/1dr0tlw",
        "content": "Bought myself Aerondight for my birthday this year 🥳",
        "num_comments": 18,
        "comments": [
            "May I ask where did you buy it ? For how much ? And is it a real sword or a copy (just for display) ?",
            "Is that from Kaer Morhen forge?",
            "Now all you gotta do is get it professionally sharpened",
            "My my this things is gorgeous !!",
            "Might I enquire about where you purchased the sword.",
            "Wow, this sword deserves admiration. Is it custom made?",
            "le le le le le le le le le - LE LE LE LE",
            "Good luck on the path!",
            "No way! That's such a detailed and visually gorgeous replica. \n\nHappy belated Birthday.",
            "Inquiring minds need to know. That thing is gorgeous!!"
        ]
    },
    "Best chapter in ToS": {
        "title": "Best chapter in ToS",
        "score": 13,
        "url": "https://i.redd.it/2o09uvv19i9d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Bonhart was a terrifying villain!"
        ]
    },
    "The Witcher - 1950's Super Panavision 70": {
        "title": "The Witcher - 1950's Super Panavision 70",
        "score": 12,
        "url": "https://www.youtube.com/watch?v=52mdqDylquc",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}