{
    "Welcome to Wizard Posting!": {
        "title": "Welcome to Wizard Posting!",
        "score": 72,
        "url": "https://i.redd.it/frnmlgr7yf8d1.jpeg",
        "content": "Welcome to Wizard Posting! Where everyone is pretending to be a wizard, or witch, or something magical, or magical adjacent!\n\nWe have memes, lore posts, and occasional community interactive posts. Feel free to engage people and their characters in the comments! Remember that /uw or /unwiz means speaking out of character and that /rw or /rewiz means returning to speaking in character. \n\nIf you’re interested in [our discord, please click here.](https://discord.com/invite/cnWygr5YtC)\n\nWe have a few rules here at Wizard Posting. Be sure to check them out before posting so that we can all have fun! If what you’re posting or commenting can cause drama, then please refrain from posting such things.\n\nFinally, if you want to engage in lore posts, collaborations, and the like, please check out [this roleplaying guide for roleplaying etiquette.](https://www.reddit.com/r/wizardposting/s/SskmSyHIYI) It will help you make the most of your roleplaying experience here.\n\nWith all of that said, please enjoy your time here at Wizard Posting!",
        "num_comments": 69,
        "comments": [
            "Welcome to Wizardposting\n\nhttps://preview.redd.it/gk7ty19e3g8d1.png?width=1000&format=png&auto=webp&s=99341b5386e6314ff6265ae0199f0ae5d5c4ecd0\n\nIf you don't get what's going on, don't worry, no one does",
            "WHERE DO YOU GET THE WIZARD PICTURES",
            "I mean I’ve been here for a while but thanks",
            "https://preview.redd.it/uff0xh5acg8d1.jpeg?width=714&format=pjpg&auto=webp&s=63cfd38af7a80671cc53db7d1b8c10b6aafd2394\n\nWelcome to Wizardposting, where medieval weaponry, magic spells, and futuristic tech all combine!\n\nSeriously, none of us have a consistent timeline.",
            "Why do I wanna see Anna as a club penguin",
            "This subreddit kept appearing from time to time; saw the 'Necrodancers' and 'fish' the most. I thought this was yet another AI image generating sub, but by reading this I was quite wrong. Might get interested soon or later!",
            "https://preview.redd.it/2wy49plkwg8d1.jpeg?width=828&format=pjpg&auto=webp&s=a709c939174b6518bb754247d2aaea4a9a240986\n\n“We have cookies.”",
            "https://preview.redd.it/7jzwh94qdh8d1.jpeg?width=1080&format=pjpg&auto=webp&s=6524aae093230e03563801dbefaa87b5a4ca3bf0\n\nGreetings, potential new members.",
            "Here a joint of welcoming\n\nhttps://preview.redd.it/b4oraovb3i8d1.jpeg?width=896&format=pjpg&auto=webp&s=eb8e85b1fb48d659a4b6cf4d43d6c9db0a9f2514",
            "https://preview.redd.it/csd1i5qntg8d1.png?width=1080&format=pjpg&auto=webp&s=83390d5141cac24faa22749917fa2870984f0940\n\nMe and the boys on our way to liberate the north Pole with all sorts of magitech"
        ]
    },
    "My kind of station": {
        "title": "My kind of station",
        "score": 952,
        "url": "https://v.redd.it/aowy5xhoxe9d1",
        "content": "We musiking ",
        "num_comments": 29,
        "comments": [
            "welp, here before the council smites its down\n\ntruly cant have good quality orb stations in the realm of",
            "#YOU ARE LISTENING TO 107.6, WAR GOD FM.  WHERE WE LISTEN TO BATTLE HYMNS, BATTLE MUSIC, AND WAR DRUMS!  THIS IS NOT YOUR SOVEREIGN’S RADIO STATION!\n\n*my way by frank sinatra begins playing throughout the halls of the black terrace*",
            "which version of radioactive is this? i want to find it",
            "Unw/ unironically, before seeing this, I was hearing byzantine chants on youtube.",
            "“Hel yeah!”\n\nhttps://preview.redd.it/bxw40czx9f9d1.jpeg?width=1024&format=pjpg&auto=webp&s=3c512a7f44a054345a24c6c7e272735ec517763c",
            "that shimmering mana crystal sound is great",
            "Oh J'adore! I always find certain chants of the Dragons helpful to restore magic within my [bones](https://www.youtube.com/watch?v=DYed5whEf4g&ab_channel=ImagineDragonsVEVO)!  \n  \nI have been able to access a few interplanetary and dimensional stations that my wizard kinfolks here might appreciate. Though it veers a bit more toward chthonic madness & chaos, I nonetheless leave a trace spell to one of them[ here for inquisitive souls to follow  ](https://www.youtube.com/watch?v=ky_p0YkLEiE&list=PL6obTLJTJH83t0M6iwVyfY1lJkhItNM6O&index=7&ab_channel=burialgoods)",
            "This made my nipples erect\n\nSincerely, the nipple wizard",
            "Citizen. You are listening to\n\n\n103.3\n\n\n*Combine Radio Noise*\n\n\nCombine FM\n\n\n*Insert combine anthem here*\n\n\nWhere we play nothing but the best our universal union has to offer.\n\n\nThis isnt your rebels station\n\n\n*Sandstorm - Darude plays*",
            "Thank God, I have my arcane radio to listen to some tunes"
        ]
    },
    "New wizfit for stormy weather": {
        "title": "New wizfit for stormy weather",
        "score": 1804,
        "url": "https://v.redd.it/uqpn4nnw6b9d1",
        "content": "",
        "num_comments": 34,
        "comments": [
            "Bruh is trying to get himself turned into the Flash.\n\nhttps://preview.redd.it/41gc6rp5cb9d1.jpeg?width=864&format=pjpg&auto=webp&s=6b9c76c4654c7561a84a75db9004c7ab353d25e1",
            "I have finally found it...! The ultimate suit for *losing* against lightning wizards!",
            "He needs to learn how to conduct himself",
            "Tin foil robes: +100% resistance to mind manipulation magic, -100% resistance to lightning.",
            "ok but it has a fatal flaw\n\nhttps://preview.redd.it/osjlbukqab9d1.png?width=1500&format=png&auto=webp&s=84db764a183882e3c58777873f91b7e226d2b6fc",
            "The fucking swirl at the top lolol",
            "The abjurers are getting out of hand \n\n*shocking grasp*",
            "My liege, the Lore of Metal is designed specifically to empower potent equipments such as these. Gehenna's Gleaming Robes are constructed not for the likes of those who've never encountered the drip of steaming steel before. \n\nImmunity to the Plague of Rusts. Empowered by the transmutation of lead. Joints glistening beneath a sheen rendered from wine of palest gold.\n\nA mantle befitting only the most supreme of the alchemical orders. You'd be well served to kneel within this patriarch's presence.",
            "https://youtu.be/GKnAWcWnJJc?si=jy8_0UvLvYozgjSy",
            "Quick cast thunder spell"
        ]
    },
    "Arcane Pranks for the camp ground": {
        "title": "Arcane Pranks for the camp ground",
        "score": 74,
        "url": "https://v.redd.it/93r6x35uhe9d1",
        "content": "",
        "num_comments": 7,
        "comments": [
            "Haha, classic shrinking cup prank, how can you be around a wizard and not expect something like this",
            "/uw I physically cringed at this. Never use plastic for anything hot",
            "Ok... which mf think pouring invisibility potion into the soup cauldron is funny? Because it's not.",
            "When you make a whole batch of shrinking potion but none of you potion bottles are shrink resistant.",
            "I need to do this, those forest creatures will never see it coming",
            "if anybody is interested in the actuall reason: The cup was formed with vacum witch streches a sheet of platic into a cup as shown in the video.  \nthings made via vacume Molding really want to turn into sheets again.",
            "How do i recover from a forest creature attack?"
        ]
    },
    "Ouch": {
        "title": "Ouch",
        "score": 130,
        "url": "https://v.redd.it/0trknapmrd9d1",
        "content": "",
        "num_comments": 2,
        "comments": [
            "the worst part is that since it was designed as a groin defensive spell it is ridiculously hard to undo or remove, basically have to cut it off at the belly button",
            "ok but hear me out\n\nhttps://preview.redd.it/vchf1w5vvf9d1.png?width=1500&format=png&auto=webp&s=71207cce61a158c4c7c7fab7830fc69947ef3ceb"
        ]
    }
}