{
    "Welcome to Wizard Posting!": {
        "title": "Welcome to Wizard Posting!",
        "score": 72,
        "url": "https://i.redd.it/frnmlgr7yf8d1.jpeg",
        "content": "Welcome to Wizard Posting! Where everyone is pretending to be a wizard, or witch, or something magical, or magical adjacent!\n\nWe have memes, lore posts, and occasional community interactive posts. Feel free to engage people and their characters in the comments! Remember that /uw or /unwiz means speaking out of character and that /rw or /rewiz means returning to speaking in character. \n\nIf you’re interested in [our discord, please click here.](https://discord.com/invite/cnWygr5YtC)\n\nWe have a few rules here at Wizard Posting. Be sure to check them out before posting so that we can all have fun! If what you’re posting or commenting can cause drama, then please refrain from posting such things.\n\nFinally, if you want to engage in lore posts, collaborations, and the like, please check out [this roleplaying guide for roleplaying etiquette.](https://www.reddit.com/r/wizardposting/s/SskmSyHIYI) It will help you make the most of your roleplaying experience here.\n\nWith all of that said, please enjoy your time here at Wizard Posting!",
        "num_comments": 70,
        "comments": [
            "WHERE DO YOU GET THE WIZARD PICTURES",
            "I mean I’ve been here for a while but thanks",
            "Why do I wanna see Anna as a club penguin",
            "This subreddit kept appearing from time to time; saw the 'Necrodancers' and 'fish' the most. I thought this was yet another AI image generating sub, but by reading this I was quite wrong. Might get interested soon or later!",
            "Run while you still can.",
            "Huh... I don't think this Bombast clone was made correctly.  It looks oddly like Anna.\n\nAre you getting up to some weird shenanigans?",
            "I quite like the introduction. Well put.",
            "It would be cool to have posts like this every few months for new members (maybe there is and I haven't seen them in which case woohoo!)",
            "AS LONG AS YOU FEEL SAFE I DONT CARE WHAT YOU DO... UNLESS YOURE NECRODANCER OR CARAWAY.",
            "Welcome to wizardposting fuckhead. Now grab a shitty or learn some spells, shits dangerous"
        ]
    },
    "The first official wizardposting art contest has begun!": {
        "title": "The first official wizardposting art contest has begun!",
        "score": 25,
        "url": "https://www.reddit.com/gallery/1dr2yid",
        "content": "I have never done something like this before please excuse my inexperience",
        "num_comments": 14,
        "comments": [
            "/uw u/SafePianist4610 i dont really know how running subreddits work but is this the sort of post that should be pinned?",
            "Dont worry u/animebilly049 your post has been accounted for",
            "someone make a testicular torsion logo",
            "You should give a run down of the council as it stands now so we can have good idea what to make.",
            "/uw I mean, the council and the mod team are separate entities, but I see no harm in pinning this for a community event for a bit.",
            "I like how you think",
            "/uw all shit but we trying",
            "/uw\n\n![gif](giphy|ncsQI9sF3pa8w)\n\nIt has been so long since I actually polished anything I drew but goddamn do I want this so bad.",
            "just edit the top words from\n\nscrotal safety commission\n\nto\n\nwizard council \n \n\nor smth",
            "looking forward to results"
        ]
    },
    "Who is your wizard idol? ": {
        "title": "Who is your wizard idol? ",
        "score": 455,
        "url": "https://i.redd.it/5shqrr5adh9d1.png",
        "content": "Lore of metal go brrr",
        "num_comments": 80,
        "comments": [
            "/UW Good old Gelt. Every time he's mentioned I drink a bottle of Balthasar Gold paint.",
            "Thoth, God of the Moon and Knowledge, amongst other things. Or Hermes, whichever you prefer really.",
            "Shout out to the empire, don’t let the skaven bite!",
            "I find taking an idol to be a strange and futile objective, it only brings pain and sorrow, even to death at times",
            "None in particular. That I can remember anyway.",
            "He’s an eldermage from a different ethereal plane, you probably haven’t heard of him.",
            "I'm a pretty huge fan of Gandalf and Dumbledore. Merlin in the Disney Sword In The Stone is definitely a favorite of mine too! 😅😂",
            "YOU SHALL NOT FUCK WITH ME",
            "Obviously no better wizard idol than Alex Russo.\n\n![gif](giphy|M59NQenO7Kq8E)",
            "Sometimes I feel like I'm not fully equipped to understand this sub"
        ]
    },
    "exposed lmao": {
        "title": "exposed lmao",
        "score": 255,
        "url": "https://i.redd.it/wdcrspfsph9d1.jpeg",
        "content": "",
        "num_comments": 42,
        "comments": [
            "Good for him! Now back to business...\n\nI cast **IT FOLLOWS**",
            "uw/ nothing against gay people",
            "Guess that's one skeleton out of the closet.",
            "Necrodancer 1 day after Pride month ends  \n”THE NECRODANCER IS STRAIGHT”",
            "That sounds, pretty homosexual buddy, are you sure the bones are boning ?",
            "I dunno about that, sounds gay.",
            "Bathin: this does not matter... Sex and romance is a waste of time either way",
            "/uw sorry about this if u feel insulted ill take it down if u want",
            "Are you planning on reanimating a rainbow skeleton next month?",
            "/uw all against them (I'm gay owo)"
        ]
    },
    "The Most Benevolent Necromancer": {
        "title": "The Most Benevolent Necromancer",
        "score": 51,
        "url": "https://i.redd.it/icus424eqi9d1.jpeg",
        "content": "",
        "num_comments": 8,
        "comments": [
            "I mean... the possibility of death or dismemberment is high, but I suppose that's the quickest way to get somebody to learn swordsmanship.\n\nAlso, skeleton santa is awesome.",
            "Death being a multiversal constant, it is nonetheless the case that many universes have their own incarnations of the concept. I am fortunate not to have knowingly crossed paths with any of them, but this particular Death tops the list of those I wouldn't mind having a conversation with.",
            "Don’t give kids swords! Give them daggers!",
            "# NO! LET HER LEARN THE BLADE! #",
            "YOU’RE just saying that because you need more skilled souls for your undead army.",
            "Ah Hogfather, classic literature.",
            "Yass knight,\n\nSlay!",
            "https://preview.redd.it/nkoyb0afri9d1.png?width=1500&format=png&auto=webp&s=78daeba14b62ac4888585213d2b2db626d74d79e\n\ni do not support the indirect physical assault of prepubescent children"
        ]
    }
}