{
    "Miete für Freundin?": {
        "title": "Miete für Freundin?",
        "score": 7,
        "url": "https://www.reddit.com/r/wohnen/comments/1dr3s5y/miete_für_freundin/",
        "content": "Hey Leute,\n\nich (w, 25) wohne in Frankfurt in einer 50qm (2 Zimmer) Wohnung. Eine sehr gute Freundin (w, 24) wird für 6 Wochen in meiner Wohnung wohnen, während ich in den Urlaub fahre. Sie hat mich gefragt, wie viel Geld ich dafür möchte.\n\nEhrlich gesagt bin ich mir unsicher, wie viel ich verlangen soll oder ob ich überhaupt etwas verlangen soll. Sie ist eine sehr gute Freundin und ich vertraue ihr vollkommen. Gleichzeitig habe ich natürlich laufende Kosten für die Wohnung (Miete, Nebenkosten etc.).\n\nHabt ihr Tipps oder Erfahrungen, wie man so etwas fair regelt? Sollte ich überhaupt Geld verlangen oder gibt es andere sinnvolle Vereinbarungen, die man treffen kann?\n\nDanke im Voraus für eure Ratschläge!",
        "num_comments": 22,
        "comments": [
            "Ich gehe davon aus, dass Du für die 6 Wochen die Wohnung leer stehen hättest lassen, wenn Dich die Freundin nicht gefragt hätte.\n\nDann ist beides okay. Sie kostenlos drin wohnen lassen oder einen geringen Preis Ihr zu überlassen. \n\nIch glaube Deine gute Freundin fühlt sich wohler, wenn sie etwas bezahlt. Jetzt musst Du entscheiden, ob Du dich wohl fühlst, wenn sie was bezahlt. Wenn nein, sage ihr das genauso. \"Die Wohnung würde ansonsten leer stehen, mit Dir bin ich gut befreundet und von guten Freunden nehme ich kein Geld\".\n\nDeine Freundin sieht es wahrscheinlich andres, entweder weil die sie z.B. \n\n- Freundschaft andres einschätzt\n\n- Freundschaft hoch schätzt und Dich nicht ausnutzen möchte und die  Preise vergleicht, was sie zahlen müsste, wenn sie auf dem freien Markt suchen müsste\n\n- ....\n\nDie angemessene Höhe? Mein Vorschlag: Deine Nebenkosten plus eventuell 50/100 Euro drauf.\n\nAch so: Du bekommst übrigens den Briefkasten geleert wenn Du das willst und das Einbruchrisiko und Wasserschadenrisiko sinkt.\n\nAndere sinnvolle Regelungen: Klar sagen was du nicht magst. Welche Schränke und welche Zimmer sie nutzen kann und welche nicht. Was Du nicht magst Parties, rauchen, dritte Übernachten lassen....",
            "Wenn sie Dich schon selbst fragt : 3 Wochen Warmmiete wäre win win für beide.",
            "Vielleicht die Höhe der Nebenkosten? (Ohne Heizung denn die verbraucht sie ja in dem Moment nicht)?\n\nAber ich würde gar nichts verlangen wenn es eine Gute Freundin ist und sie ja auch gleichzeitig auf deine Wohnung aufpasst, Briefkasten leert, Pflanzen gießt etc.",
            "Natürlich bezahlt sie nix außer ggf einem Präsentkorb oder einer solchen Aufmerksamkeit... Die Miete hättest du sowieso gezahlt, du sprichst hier von einer Freundin, bei einer Bekannten hätte ich mir vl solche Gedankwn gemacht - aber auch da eher die Nebenkosten",
            "Diese Frage alleine….natürlich nimmst du kein Geld von ihr. Es sind nur 6 Wochen und du hättest die Miete doch eh bezahlt. Wenn es dir finanziell sehr schlecht geht, kann man über Hilfe bei Stromkosten reden, wenn die Jahresrechnung kommt und zu viel sein sollte, aber solange du finanziell okay bist, lass sie als Freundin doch einfach da wohnen.",
            "50% der Nebenkosten (Strom usw.). Sollte Ihr das zu wenig sein, kann sie ja gerne freiwillig erhöhen.",
            "Nebenkosten",
            "Nebenkosten und evtl einmal zum Essen einladen.",
            "Lass dich ein mal nett zum Essen einladen und gut ists :)",
            "Kommt darauf an, warum sie da wohnt - muss sie in der Zeit unbedingt da sein (und hätte sonst was mieten müssen) oder ist sie einfach da, weil deine Wohnung in der Zeit leer steht? \n\nAber egal wie, ich glaube ich würde eher kein Geld verlangen, sie leert ja deinen Briefkasten/ gießt Blumen und lüftet die Wohnung … dafür hättest du ja sonst jemanden gebraucht. \nWenn sie drauf besteht, soll sie die Nebenkosten zahlen :)"
        ]
    },
    "Meine Nachbarn sind .........": {
        "title": "Meine Nachbarn sind .........",
        "score": 44,
        "url": "https://www.reddit.com/r/wohnen/comments/1dqkhx8/meine_nachbarn_sind/",
        "content": "Da fällt mir die Kinnlade runter, erst wird das Mehrparteienhaus nach eigenen Vorstellungen umdekoriert und jetzt machen die so, holen extra ihre Motorräder aus der Garage raus, um damit Parkplätze zu blockieren. \n\nhttps://preview.redd.it/3rx0whj4lb9d1.jpg?width=4000&format=pjpg&auto=webp&s=b4772d74c5272a466804a2b3efa90378831e2225\n\n",
        "num_comments": 104,
        "comments": [
            "Wäre echt ärgerlich wenn jemand ein drittes Motorrad dazustellen würde, und die Autos daher am Abend keinen Platz dort finden.",
            "Es ist mir vollkommen schleierhaft, warum so viele Menschen gewollt A..löcher sind.",
            "Okay, was du jetzt machst ist ne große Menge Vogelfutter für Wildvögel kaufen und wenn keiner hinkuckt verteilt du das um und vor allem AUF den störenden Fahrzeugen. Hirsestangen aus dem Kleintier bedarf gehen zur Not auch.  \nAm besten sehr früh morgens oder spät nachts wenn dunkel.   \nUnd dann abwarten.  \nSpätestens wenn die Tauben kommen wird das ein sehr schönes Bild.",
            "wenn sich wer die mühe macht wegen nem dummen parkplatz die roller hin- und herzuverschieben... klar is es lächerlich. aber eben genau das: lächerlich.",
            "Meine Nachbarn besitzen zwei Motorroller, allein zu diesem einen Zweck. Wenn er morgens das Haus verlässt, stellt sie die Roller hin. Wenn er nach Haus kommt, macht sie wieder Platz und stellt die Roller auf den kleinen gepflasterten Bereich vor dem Haus.",
            "1.um abstellung bitten\n2. Einfach selbst was holen und dazwischen stellen, so dass die Parkplätze beide blockiert sind. Mit nem Zettel dran, ob man das nicht sinnig lösen kann statt so. Fertig.",
            "Vor den Parkplätze am Auto rumhantieren in der Zeit wenn die zurück kommen. Motoräder können da stehen bleiben aber die müssen dann die Karre woanders hin parken. Asoziales Pack.",
            "Wär schon blöd wenn denen wer auf die Sitze pissen würde.",
            "Also mal von vorne. Was ist das Problem? Wem gehören die Parkplätze? Sind die einzelnen Wohneinheiten zugeordnet oder nicht?",
            "In r/stvo stehen so herrenlose Böcke rum, einfach mitgehen lassen und dazwischen stellen"
        ]
    },
    "Temperaturregulierung im Sommer": {
        "title": "Temperaturregulierung im Sommer",
        "score": 6,
        "url": "https://www.reddit.com/r/wohnen/comments/1dquorr/temperaturregulierung_im_sommer/",
        "content": "TL;DR: Ganzen Tag Fenster auf lassen kann sinnvoll sein. Luftfeuchtigkeit ist der größerer Feind.\n\nHey zusammen,\n\ndraußen hats ne Millionen Grad & die Sonne brät unerbittlich. In regelmäßigen Abständen wird hier im Sub gefragt, wie man denn seine Wohnung am Besten kühl halte.\n\nOft ist der Tipp \"Morgens/ Nachts Lüften und dann alles zu machen\" der, der ganz oben steht. In vielen Fällen - grade in gut isolierten, ggf. sogar belüfteten Wohnungen - ist dies wohl auch vollkommen richtig und sinnvoll.\n\nIn anderen Wohnungen führt dies allerdings eher zum langsamen Hitzetod.\n\nIn der Grafik hier sieht man die Temperatur und Luftfeuchtigkeit meines Schlafzimmers im Dachgeschoss zwischen 07:00 und 22:30.\n\nUm 7 Uhr aufgestanden, Fenster aufgerissen, um kurz vor 9 alles geschlossen und ausm Haus gegangen.\n\nBis 13:20 war niemand zu Hause und die Temperatur ist auf starke 30° geklettert. Die Luftfeuchtigkeit ist bei leckeren 50% geblieben. Um 13:20 dann die Fenster aufgerissen und die Luftfeuchtigkeit ist direkt mal auf 35% gefallen. Alleine diese Änderung machts direkt signifikant angenehmer in dem Raum, die ca. 4° weniger helfen natürlich auch.\n\nDie Fenster waren dann bis 22:30 geöffnet und trotz dauerhafter Sonneneinstrahlung ist es nicht siginifkant heißer geworden.\n\nLange rede, kurzer Sinn: In einigen Wohnungen - grade im Dachgeschoss - kanns echt sinnvoll sein, einfach den ganzen Tag das Fenster auf zu lassen. Warm wirds eh (siehe Grafik) und zumindest bleibt die Luftfeuchtigkeit unten.\n\n[07:00 - 09:00: Lüften; 09:00 - 13:20: Fenster geschlossen; Nach 13:20: Fenster geöffnet.](https://preview.redd.it/mf09dgbyqd9d1.png?width=1642&format=png&auto=webp&s=d53ddadfc013d1a02168437662c1037d4035b8e0)\n\n",
        "num_comments": 8,
        "comments": [
            "Abends ab 21:00 zwei große, und ich meine wirklich große Ventilatoren vors Fenster und die Bude durchblasen bis man ins Bett geht. \n\nProblem sind aufgeheizte Wände und Möbel etc...",
            "Über welches System zeichnet du die Werte auf? Und wie weit in die Vergangenheit sind die Daten abrufbar?",
            "Na ja. Das kann man so nicht verallgemeinern. Jede Wohnung hat andere \"Verhältnisse\". Bei mir ist es gerade 9:15 Uhr. Aussentemperatur schon bei 32 Grad. Innentemperatur bei 25 Grad mit 67 % Luftfeuchte. Alle Fenster sind, sobald es draussen kühler ist bei mir komplett aufgerissen und so bald es draußen wärmer ist komplett geschlossen. Werde den Teufel tun, jetzt die Fenster aufzumachen. \n\nProblem ist tatsächlich... das aufgeheizte Inventar + aufgeheizte Wände etc. Die speichern richtig gut die Wärme.",
            "Ja, ändert aber nix dran, dass die Hütte sich Tagsüber aufheizt, auch wenn die Fenster geschlossen sind :D",
            "So habe ich es gestern Abend auch gemacht... Alles auf und Wohnung auf Durchzug mit Ventis. Aber ich bin immer noch am Grübeln welche der beiden Optionen Sinnvoller ist.... Ventis blasen raus oder Ventis blasen rein (Natürlich die Windrichtung mit in Gedanken)",
            "Ich nutze Home Assistant und halte die Daten unendlich vor. Daten, die älter als 10 Tage sind werden allerdings niedriger aufgelöst um Speicher zu sparen.",
            "Du hast das vor einer Stunde gepostet und schon 32°C? Mein allergrößtes Beileid. Wir hatten diese Nacht zum Glück Temperaturen von 13°C und konnte meine Bude auf etwa 21°C abkühlen.",
            "Ich bspw. Würde bei diesen Verhältnissen definitiv die Fenster auf machen. 67% Luftfeuchtigkeit klingen wie die Hölle. \n\nAber ja, „das kann man nicht so verallgemeinern“ war ja genau der Punkt meines Posts."
        ]
    },
    "Erfahrungen zu Anschaffungs- und Installationskosten (Multi) Splitklimaanlagen in Eigenheimen": {
        "title": "Erfahrungen zu Anschaffungs- und Installationskosten (Multi) Splitklimaanlagen in Eigenheimen",
        "score": 1,
        "url": "https://www.reddit.com/r/wohnen/comments/1dr5e1p/erfahrungen_zu_anschaffungs_und/",
        "content": "Hallo allerseits, ich erwäge die Anschaffung von mehreren Klimaanlagen für mein Zweifamilienhaus und wäre an Erfahrungswerten bzgl. der entstehenden Kosten interessiert. In meinem Fall wäre das vorrangige Ziel das kühlen an heißen Tagen. Mittelfristig soll mit den Klimaanlagen auch geheizt werden. Meinen Überlegungen nach benötige ich 4 x Multisplitklimaanlagen mit je 2 Innengeräten und 2 x Multisplitklimaanlagen mit je 3 Innengeräten.\n\nGibt es Erfahrungswerten in dieser Größenordnung?\n\nHat jemand auch Empfehlungen bzgl. der Gerätschaften?",
        "num_comments": 1,
        "comments": [
            "Ich würde mal überlegen, ob du so viele Klimageräte benötigst. Wir kühlen im Sommer mit einer Anlage und 3 Innengeräten 3 große Räume unterm Dach auf 18 grad, wenn gewünscht."
        ]
    },
    "Schimmel an der Decke im Badezimmer": {
        "title": "Schimmel an der Decke im Badezimmer",
        "score": 3,
        "url": "https://www.reddit.com/r/wohnen/comments/1dqtmd6/schimmel_an_der_decke_im_badezimmer/",
        "content": "Hallo,\n\nich wohne zur Miete und habe ein Badezimmer ohne Fenster. Obwohl ich jeden morgen die Fenster in den anderen Räumen öffne und das Badezimmer bei offener Tür durchlüfte, bildet sich Schimmel an der Decke. Deshalb wische ich regelmäßig die Decke mit einem Schimmelentferner ab. Trotzdem sind bereits schwarze Flecken durch den Schimmel an der Decke, die sich auch nicht mit einem Tuch wegwischen lassen.   \nHat jemand eine Idee, was ich da machen kann, also wie ich die Flecken entferne oder was ich ändern kann, damit der Schimmel gar nicht erst aufkommt?   \nDenn ich möchte nicht zum Mietnomaden werden.   \nVielen Dank im Voraus.\n\nViele Grüße",
        "num_comments": 5,
        "comments": [
            "Hast du mal das wirklich starke Zeug versucht? Pufas Schimmel Spray Aktiv Chlor. Musst du mal auf Amazon schauen. Das hilft eigentlich ganz gut und sehr lange, aber Achtung! Das Zeug riecht extrem, auch noch Tage danach. Auf jeden Fall Schutzausrüstung tragen.",
            "Hast du den Schimmelbefall schon deinem Vermieter mitgeteilt? Falls nein, dann würde ich das schnellstmöglich machen...",
            "Nicht immer ist das nur die Schuld des Mieters - melde das deinem Vermieter und lass die Lüftung des Bads checken, denn wenn da alles funktioniert, passiert das nicht. In einem Bad ohne Fenster kannst du als Mieter nicht mehr machen.",
            "Ich benutze das hier:  \n[https://mellerud.de/schimmel/schimmel-vernichter?campaignid=17862595193&adgroupid=&keyword=&device=c&gad\\_source=1&gclid=CjwKCAjwvvmzBhA2EiwAtHVrb8FSBXA3EikhAjtjrGN3WTZ81R9z2E4vIebZosTS7qephTlQ9QnAChoCvxkQAvD\\_BwE](https://mellerud.de/schimmel/schimmel-vernichter?campaignid=17862595193&adgroupid=&keyword=&device=c&gad_source=1&gclid=CjwKCAjwvvmzBhA2EiwAtHVrb8FSBXA3EikhAjtjrGN3WTZ81R9z2E4vIebZosTS7qephTlQ9QnAChoCvxkQAvD_BwE)\n\nAber ich probiere das von dir mal aus, dankeschön!"
        ]
    }
}