{
    "Es gibt auch tolle Vermieter": {
        "title": "Es gibt auch tolle Vermieter",
        "score": 471,
        "url": "https://www.reddit.com/r/wohnen/comments/1dr6qxk/es_gibt_auch_tolle_vermieter/",
        "content": "Ich wohne in der Kellerwohnung eines Hauses, in dem auch mein Vermieter mit seiner Familie lebt. Als ich Sonntagabend nach Hause kam, stand mein Vermieter schon in der Einfahrt und meinte, dass sich mein Auto echt nicht gut anhört. Ich hab nicht viel Geld und bin auf das Auto angewiesen, also hab ich gehofft, dass es wenigstens noch ein paar Kilometer hält, weil ich montags zu einer Hochzeit musste. Ja, montags. \n\nIch hab ihm das so erzählt und er meinte dann: \"Komm, wir machen mal die Reifen runter und schauen nach.\" Naja, Bremse im Arsch. Er, gelernter KFZler, meinte dann, dass ich mit dem Auto nicht mehr fahren sollte. Joa, mir stand die Verzweiflung wohl ins Gesicht geschrieben, vor allem weil ich keine Möglichkeit hatte, zur besagten Hochzeit zu kommen. Das Schlimmste ist, dass ich die Hochzeit fotografisch begleiten sollte...\n\nOhne dass ich ihn überhaupt gefragt hab, meinte er: \"Wenn du willst, kannst du mein Auto haben. Wir haben eh zwei.\" Nach mehrmaligem Nachfragen, ob das wirklich okay ist, hab ich sein Angebot angenommen. Und nicht nur, dass er mir einfach so sein Auto überlässt – er hat mich auch noch gefragt, ob er die Bremsen machen soll. Teile müsste ich zahlen, aber für die Arbeit würde er nichts wollen.\n\nMeine Miete ist nebenbei auch nicht wirklich hoch. Es gibt noch gute Menschen da draußen. Ich komme mit so viel Nettigkeit gar nicht klar...\n\nDas Beste an der Geschichte? Am Montag war ich rechtzeitig bei der Hochzeit, hab fantastische Fotos gemacht, und am nächsten Wochenende hat mein Vermieter die Bremsen repariert. Jetzt fährt mein Auto wieder wie neu und ich hab einen unglaublichen Respekt und Dankbarkeit für meinen Vermieter. Solche Leute sind wirklich selten, und ich fühle mich richtig glücklich, hier wohnen zu dürfen.",
        "num_comments": 31,
        "comments": [
            "Ich hab auch mal so ein Vermieter-Einhorn getroffen: 1Zi-Wohnung (zwar sehr klein) im Erdgeschoss, mit 4qm Sitzplatz vor und Hecke drum, super Lage in der Stadt, aber total ruhig und die Miete war minimal (knapp über 300 inkl Strom, Internet etc). \nEr: steinalt, aber noch fit und total nett. Erzählte, dass er die Miete seit 20 Jahren nicht erhöht hat und auch nicht erhöhen wird.\nHabe die Butze dann freiwillig der anderen Kandidatin - ner weinenden Studienanfängerin, die es in ihrer WG nicht mehr ausgehalten hat - überlassen.. 🥲",
            "Du scheinst aber wohl auch ein angenehmer Mieter zu sein, sonst hätte er dir nicht das Angebot gemacht.",
            "Ich denke, von allen Vermietern sind die, die eine Etage ihres Eigentumhauses vermieten und selbst den Rest bewohnen, noch die besten sind.",
            "Danke für Deinen tollen Beitrag. \n\nEs gibt auch tolle Vermieter, aber von denen hört man leider selten.",
            "Das riecht schon nach fetter Grillparzy für den Vermieter",
            "Super! Deswegen im Alltag einfach mal nett sein, und wenn es nur ein Kompliment oder Danke & Bitte ist.",
            "Vermieter sind auch nur Menschen. So wie es bei allen Menschen Gute und Schlechte gibt, gibt es das halt auch bei Vermietern. \n\nUnd ein bisschen passt auch dieser Spruch: \"Wie man in den Wald hineinruft, so schallt es wieder heraus.\" ;-)",
            "Ich finde es auch toll, vielleicht bietest du ihnen mal schöne Familenfotos oder so an wenn du gut fotografieren kannst:)",
            "Danke für's Teilen dieser schönen Geschichte 🤗",
            "Sowas ist toll zu lesen. Ich kann mich dem auch nur anschließen. Nachdem ich pech mit mehreren Vermietern hatte, inklusive Rechtsstreit, wohne Ich nun zusammen mit meiner Frau in einem Neubau mit Erstbezug und wir sind absolut zufrieden mit dem Vermieter. Die Miete ist fair, für den Standort und die Qualität, wenn es Probleme gibt oder etwas zu beanstanden, wird sich schnell darum gekümmert und alles ist auf Augenhöhe mit gegenseitigen Respekt. So wie es normalerweise sein sollte aber leider keine Selbstverständlichkeit."
        ]
    },
    "Miete für Freundin?": {
        "title": "Miete für Freundin?",
        "score": 10,
        "url": "https://www.reddit.com/r/wohnen/comments/1dr3s5y/miete_für_freundin/",
        "content": "Hey Leute,\n\nich (w, 25) wohne in Frankfurt in einer 50qm (2 Zimmer) Wohnung. Eine sehr gute Freundin (w, 24) wird für 6 Wochen in meiner Wohnung wohnen, während ich in den Urlaub fahre. Sie hat mich gefragt, wie viel Geld ich dafür möchte.\n\nEhrlich gesagt bin ich mir unsicher, wie viel ich verlangen soll oder ob ich überhaupt etwas verlangen soll. Sie ist eine sehr gute Freundin und ich vertraue ihr vollkommen. Gleichzeitig habe ich natürlich laufende Kosten für die Wohnung (Miete, Nebenkosten etc.).\n\nHabt ihr Tipps oder Erfahrungen, wie man so etwas fair regelt? Sollte ich überhaupt Geld verlangen oder gibt es andere sinnvolle Vereinbarungen, die man treffen kann?\n\nDanke im Voraus für eure Ratschläge!",
        "num_comments": 29,
        "comments": [
            "Vielleicht die Höhe der Nebenkosten? (Ohne Heizung denn die verbraucht sie ja in dem Moment nicht)?\n\nAber ich würde gar nichts verlangen wenn es eine Gute Freundin ist und sie ja auch gleichzeitig auf deine Wohnung aufpasst, Briefkasten leert, Pflanzen gießt etc.",
            "Wenn sie Dich schon selbst fragt : 3 Wochen Warmmiete wäre win win für beide.",
            "Lass dich ein mal nett zum Essen einladen und gut ists :)",
            "Diese Frage alleine….natürlich nimmst du kein Geld von ihr. Es sind nur 6 Wochen und du hättest die Miete doch eh bezahlt. Wenn es dir finanziell sehr schlecht geht, kann man über Hilfe bei Stromkosten reden, wenn die Jahresrechnung kommt und zu viel sein sollte, aber solange du finanziell okay bist, lass sie als Freundin doch einfach da wohnen.",
            "Natürlich bezahlt sie nix außer ggf einem Präsentkorb oder einer solchen Aufmerksamkeit... Die Miete hättest du sowieso gezahlt, du sprichst hier von einer Freundin, bei einer Bekannten hätte ich mir vl solche Gedankwn gemacht - aber auch da eher die Nebenkosten",
            "Wenn eine Freundin fragt, sage ich immer: was wäre für dich denn angemessen? Dann könnt ihr euch zusammen preislich einigen, oder auf ein Essen oder oder…\n\nDie Wohnung würde (nehme ich mal an) in deinem Fall sonst leer stehen. So hast du auf jeden Fall eine Freundin, die ein Auge auf deine Wohnung hat. Was für mich schon ein plus ist.",
            "Ich persönlich hab es auch immer kostenlos gemacht. Auf freundschaftsbasis. Allerdings wäre auch zu sagen. Gib mir doch 100€ dann ist Strom und wasser abgedeckt auch mehr als fair",
            "50% der Nebenkosten (Strom usw.). Sollte Ihr das zu wenig sein, kann sie ja gerne freiwillig erhöhen.",
            "Nebenkosten und evtl einmal zum Essen einladen.",
            "Mach doch einfach deine laufenden Kosten auf einen Monat...also Internet Wasser und Strom"
        ]
    },
    "Was ist das?": {
        "title": "Was ist das?",
        "score": 2,
        "url": "https://i.redd.it/hc27dsmsti9d1.jpeg",
        "content": "Hey, ist das ein Silberfischchen? \nDachte erst, es sei ein Kokon, aber es hat Fühler und Silberfischchen sind mehr silber?\nHab jetzt schon einige gefunden und will wissen, mit wem ich es zu tun habe.\nDanke im Voraus ^^",
        "num_comments": 1,
        "comments": [
            "ChatGPT: „Das auf dem Bild ist ein Silberfischchen (Lepisma saccharina). Diese kleinen, flügellosen Insekten sind oft in feuchten Umgebungen wie Badezimmern, Küchen oder Kellern zu finden. Sie ernähren sich von stärkehaltigen Materialien wie Papier, Klebstoff und Schimmel. Silberfischchen sind harmlos, aber können lästig sein, wenn sie in großer Zahl auftreten. Um sie loszuwerden, solltest du auf eine trockene Umgebung achten und mögliche Nahrungsquellen beseitigen.“"
        ]
    },
    "Nachbar macht Stress; kann ich die Hausverwaltung informieren?": {
        "title": "Nachbar macht Stress; kann ich die Hausverwaltung informieren?",
        "score": 1,
        "url": "https://www.reddit.com/r/wohnen/comments/1drd38r/nachbar_macht_stress_kann_ich_die_hausverwaltung/",
        "content": "achja, wie toll Mehrparteinhäuser doch sein können....\n\n  \nIch (m21) bin momentan bei meinem Freund untergebracht während dieser für zwei Wochen im Urlaub ist, da ich auf seine Katze aufpasse.\n\n  \nBesagter Nachbar, ein älterer Herr, hat schon die ganze Zeit verschiedenste Probleme mit mir/uns. Einerseits stört ihn die Existenz der Katze von Grund auf. Das (berechtigte) Problem, dass sie anfänglich ab und an zu ihm auf den Balkon gewischt war, ist schon seit langem behoben, dementsprechend still war es. Andererseits stört ihn wohl auch meine Existenz, da er immer etwas auszusetzen hat, sobald er mich im Hausflur sieht.\n\nUnser Problem war von Anfang an eher weniger wirklich die Katze, sondern wie der Nachbar mit einem umgegangen ist. Statt mit einem zu reden wie als wäre man ein Mensch, ist er sofort auf 180 und natürlich kein bisschen konstruktiv, sondern sofort beleidigend und drohend. Und jetzt hat er völlig den Vogel abgeschossen.\n\nIch komme vom Einkaufen wieder, möchte mein Fahrrad in das Kellerabteil meines Freundes stellen...meckert mich jemand von der Seite an: ob ich denn jetzt auch hier wohnen würde, und was das soll, dass ich mein Fahrrad in den Keller stelle. Wieso ich es nicht einfach draußen anschließen kann, und wo denn der Unterschied wäre, wenn ich beim Einkaufen bei Edeka mein Fahrrad vor dem Laden abschließe.\n\nIch entgegnete nur, dass ich hier eben nunmal schlafe und die nächste Woche noch vorrübergehend hier lebe. Klar, bin ich \"nur Besuch\", aber mein Fahrrad steht nicht im Weg, sonderm im Abteil meines Freundes.\n\nAuf die Frage, ob ich nicht ein Problem damit hätte, wenn er Besuch von 6 Personen kriegt und die alle ihr Fahrrad in den Keller stellen, antwortete ich, dass es mich nicht interessiert, solange die auch nicht im Weg stehen.\n\nSeine Antwort? \"Du kappierst es nicht, dir fehlt doch irgendwas oben.\"\n\nAha. Mal davon abgesehen, dass ich ihm das Du nicht angeboten habe.\n\n  \nIch lass weiß Gott nicht so mit mir reden, und da dies nicht der erste Vorfall ist, frage ich mich, ob ich, auch wenn ich nicht der Mieter bin und nicht zur Mietgemeinschaft zähle, dagegen vorgehen kann? Bzw. was würdet ihr mir raten?\n\nIch weiß, dass ich rechtlich keine Probleme bekommen werde im Sinne von \"Ein Mieter darf 6 Wochen lang Besuch empfangen bevor er diesen beim Vermieter anmelden musss\", aber ich bin hier noch eine Woche und hab eigentlich jetzt schon keinen Bock mehr.\n\n  \n",
        "num_comments": 0,
        "comments": []
    },
    "Miete verringern möglich?": {
        "title": "Miete verringern möglich?",
        "score": 2,
        "url": "https://www.reddit.com/r/wohnen/comments/1dr82fc/miete_verringern_möglich/",
        "content": "Hallo! Ich habe meine erste Mietwohnung nun seit einem Jahr. Seit Beginn liefen viele Dinge schon sehr merkwürdig, jedoch konnte ich das meiste klären. Damit meine ich die Kommunikation mit dem Vermieter und dass mir einige Dokumente nicht geliefert wurden. Aber nun zum eigentlichen Problem. \n\nIch hatte mehrere Probleme mit der Wohnung (kompletter Neubau und Erstbezug). Die Fliesen auf dem Balkon wurden erst letzte Woche verlegt, und es gibt noch einen Fehler in der Küche, nämlich ein Teil zum Öffnen der Schublade. Wenn der Wind stark weht, hört man in der Wand ein klopfendes Geräusch, was mittlerweile sehr nervig ist. Das größte Problem ist, dass ich keinen Wasserdruck habe, beziehungsweise nur bei Warmwasser. Bei kaltem Wasser ist nahezu kein Druck vorhanden. Wenn ich auf Toilette war und dann duschen oder den Wasserhahn betätige, kommt minutenlang nur heißes Wasser heraus. Ich habe natürlich schon selbst herumprobiert, jedoch kann ich den Druck beim kalten Wasser nicht ändern. Das Wasser ist außerdem recht warm, also eigentlich kein kaltes Wasser. Die Wohnung heizt sich im Sommer übrigens auf 30 Grad auf. \n\nIch habe den Vermieter schon drei Mails geschickt und das auch schon als ich eingezogen und immer wieder verteilt weitere geschickt. Ich habe ihn auch telefonisch kontaktiert und da wurde ich beinhart angelogen. Dass das teil von der Küche schon bestellt ist und vieles weitere. Das war vor einem Jahr. Mittlerweile hebt die Hausverwaltung gar nicht mehr ab bei mir und auf emails gibt es keine rückmeldung. \n\nMöchte nun hier fragen ob es für mich eine Möglichkeit gibt evtl die Miete zu verringern lassen oder andere Möglichkeite. Es ist meine erste Wohnung also bitte ich um verzeihung falls die Probleme evtl nicht dragisch wirken. Danke im Voraus.",
        "num_comments": 4,
        "comments": [
            "Hattest du bereits Kontakt mit einem Mieterschutzverein o.ä.?",
            "Im Neubau sind Erstbezieher mittlerweile die Tester. Die von dir beschrieben Dinge sind leider nicht ungewöhnlich. Mängel am besten schriftlich per Einschreiben anzeigen, Frist setzen.",
            "Ich denke 3 Monate umsonst drinn wohnen, wären nun echt angebracht. Ich lese, daß Du am Ende bist mit Deiner Gesundheit und die Ursache dringend, wegen unbewohnbarkeit, abgestellt werden muß. Ich würde in Vollpension in eine nahegelegene Auffangstation gehen.",
            "Nein hatte ich noch nicht. Wusste gar nicht das es das gibt aber danke für den tipp."
        ]
    }
}