{
    "Jotul Gasket Kits and Stove Supply Links! It is that time of year again, time to prepare our stoves for winter!": {
        "title": "Jotul Gasket Kits and Stove Supply Links! It is that time of year again, time to prepare our stoves for winter!",
        "score": 44,
        "url": "https://www.reddit.com/r/woodstoving/comments/x03owk/jotul_gasket_kits_and_stove_supply_links_it_is/",
        "content": "Which means its time to plug and tag my store to buy your Jotul gaskets and other wood stove supplies. \n\nThis in turn supports our sub and those of use who volunteer our time to make this place awesome.  It helps me buy Reddit Premium for any moderator that would like it!\n\nHere is the new [Facebook Shop](https://www.facebook.com/kingdomwoodstoves) link where the best prices will be!\n\nAnd here is the [eBay Store](https://www.ebay.com/str/kingdomwoodstoves?mkcid=16&mkevt=1&mkrid=711-127632-2357-0&ssspo=yxqngz9-r3m&sssrc=3418065&ssuid=yxqngz9-r3m&widget_ver=artemis&media=COPY) link for those who do not use Facebook.(international sales exclusively available on eBay)\n\nWe are now carrying a gasket kit for every Jotul ever imported to the US, as well as starting to get supplies listed like professional grade high temp stove paint and cement. \n\nAlso coming soon, some everyday safety items such as Chimfex Chimney Fire Extinguisher Sticks.\n\nAs always, from all of us here at r/woodstoving, thank you for making this place great!",
        "num_comments": 0,
        "comments": []
    },
    "•We have cleaned up and slightly updated the rules. •Please take a moment to read them, especially if you are new here. ": {
        "title": "•We have cleaned up and slightly updated the rules. •Please take a moment to read them, especially if you are new here. ",
        "score": 11,
        "url": "https://www.reddit.com/r/woodstoving/about/rules/",
        "content": "",
        "num_comments": 5,
        "comments": [
            "Also, we are still on the never ending hunt for a member with a passion for wood stoves, and a little backend mod/sub knowledge to help build our Wiki page out, if you think that person is you, then please reach out in Modmail!",
            "Can you advise on what changes took place?  \nThanks",
            "Best bet is to take a minute and read the rules. If you knew the rules before, you will see the changes. \n-Thank you"
        ]
    },
    "Masonry chimney question - how do I make sure I get the correctly sized woodstove for this flue? ": {
        "title": "Masonry chimney question - how do I make sure I get the correctly sized woodstove for this flue? ",
        "score": 3,
        "url": "https://www.reddit.com/gallery/1dr09rg",
        "content": "I was told the flue size is 8 inches here. So my question is, do I need to go 8 to 8? How should I ensure there’s no hiccups with this. \n\nI probably should just ask my builder, but wanted to ask the community first ",
        "num_comments": 6,
        "comments": [
            "Nearly zero chance any modern or efficient wood stove is rated to use a flue pipe diameter different from the outlet diameter, and that it could be used in an uninsulated flue that is a massive heat sink (stoves pretty much require Class A flue piping once it leaves the room, some allow for an insulated lined of the correct diameter)\n\n\nA 6\" to 8\" flue pipe diameter change would see nearly a doubling in cross sectional area, that itself would cause flue gasses to expand rapidly, cool & lose a ton of velocity. The thermal mass of a masonry chimney would also radically cool the flue gasses, and it not being near as well sealed as Class A flue piping that all adds up to a house fire danger & a threat to everyone who lives there from Carbon Monoxide poisoning.\n\n\nManufacturer installation instructions trumps nearly everything, most likely what you have falls outside of acceptable and should not be done like that, should run new correct diameter Class A insulated double wall flue pipe made for hot wood fires.",
            "There are reducers so it’s not an issue.\n\n8” is usually the larger stoves and 6” is the smaller ones..just depends on what you’re looking for in a stove and how much sqf you’re going to heat",
            "If it fits in the hole or not, if it's too big for the hole then it's the wrong size,",
            "And that many very well be the plan - I haven’t asked yet",
            "I keep reading that going from 6 inch stove to 8 inch chimney will cause issues? Is this correct? \n\nOur total sq footage is 1100 per story so 2200",
            "The issue is usually with corners.  But as long as it’s swept out and kept clean..I don’t see why there would be..\n\nI have mine going straight up through the attic with a 22` angle pipe, otherwise is would go through the crown of my roof. I sweep mine out 2-3 times a year depending on how much I burn and if how much it’s seasoned."
        ]
    },
    "Efel Harmony III (wood+coal) - replacing bricks & chimney setup in small space": {
        "title": "Efel Harmony III (wood+coal) - replacing bricks & chimney setup in small space",
        "score": 1,
        "url": "https://www.reddit.com/gallery/1dr5pf5",
        "content": "I like the idea of a wood/coal combo but not sure if this stove is practical for the use case.  Install in a roughneck 4 season trailer (28ft long).  \n\n1. The one for sale needs new bricks. I have been searching online and can’t figure out where I can buy them (shipping to Canada). \n2. I would be installing in a Roughneck 4 season trailer not house. I understand these stoves are HEAVY. Would a trailer be able to handle the weight?  I don’t drive it around. It is stationary. \n3. I understand coal burns a lot hotter. Does this mean I need specialty piping and other install parts?\n4. All the diagrams I see assume a sloped roof. Is this required for this stove for some reason?\n5. Anything else I should be thinking of?  \n\nThanks in advance!",
        "num_comments": 0,
        "comments": []
    },
    "First time Sweeping, best methods": {
        "title": "First time Sweeping, best methods",
        "score": 4,
        "url": "https://www.reddit.com/r/woodstoving/comments/1dqou26/first_time_sweeping_best_methods/",
        "content": "I have a jotul F35. Need some tips on cleaning this chimney for the first time. Ive got a brush/flexible rod kit. What would be the best way to tackle this? from the top down? from the bottom up? or Should i disconnect the pipe before the bend and sweep from the top down? (not sure i can reach the top w/o another ladder. Ive watched a few vids, seeing different methods, just not sure whats he best with my setup. any help would be appreciated!\n\nhttps://preview.redd.it/5kx154w2ic9d1.jpg?width=3024&format=pjpg&auto=webp&s=d7ba4d22cbbf3c1e531e73442902c6c9095d6e24\n\nhttps://preview.redd.it/goaq14w2ic9d1.jpg?width=4032&format=pjpg&auto=webp&s=fb5b5436737d4aad7b21e52ed156be571f929935\n\n",
        "num_comments": 1,
        "comments": [
            "Top down, let it fall into the stove. Let it settle, pull the interior pipe, clean out inside of stove. Use a piece of insulation or similar to block the pipe while you clean out the stove. That way you don’t get a surprise dust fall if you didn’t get everything"
        ]
    }
}