{
    "happy pride month, from r/wordington": {
        "title": "happy pride month, from r/wordington",
        "score": 3323,
        "url": "https://i.redd.it/hm3dfvhs234d1.jpeg",
        "content": "",
        "num_comments": 211,
        "comments": [
            "and a refreshing reminder that homophobia has no place in the subreddit whose main gimmick is gay black men lmao",
            "It's always pride month on this sub",
            "Thank God. This'll filter out all the doodoofard/shitposting non thugs.\n\n![gif](giphy|9x3rd0nJBJjoR6wtHR)",
            "this is a gay nigga sub so mfs can’t even be mad about it",
            "thank fuck my birthday is in this wonderful month",
            "why is the logo not two oiled up black gay men kissing this is an outrage",
            "It’d be really funny if for June you could only post straight women but that breaks the thugshaker code",
            "Gay themed wordington? Isn't that just wordington?",
            "finally the only subreddit where a pride flag can be up and still fit the theme of the subreddit. janitors really be out here having the pride flag up or some other flag with political messaging when its about CBT or sonic the hedgehog or some goofy ahh shit where people are just asking \"what does this have to do with x?\".\n\nedit: for an actual example of this just go to the SCP subreddit and see the drama that happened there or just watch mister metokurs video about it which compiles everything about how weird the janitors are on that sub.",
            "Also mens mental health month"
        ]
    },
    "About the recent increase in racist comments in wordington ": {
        "title": "About the recent increase in racist comments in wordington ",
        "score": 1082,
        "url": "https://www.reddit.com/r/wordington/comments/1dqjhmj/about_the_recent_increase_in_racist_comments_in/",
        "content": "***You are not funny, doesn't belong in wordington***\n\nWordington is not a place for hate, your comment will be removed and if you are a repeat offender you will catch a ban\n\n***Please report***\nIf anyone comes across any form of hate please report so that we get a notification ",
        "num_comments": 131,
        "comments": [
            "The Proletariat masses of Wordington must *cum* together to defeat the bourgeoisie thugaphobes! For the glory of M.I.L.F!\n\n*Men in leggings fucking*",
            "All instances of Thugphobia will be met with violent force",
            "Racism in all its form is bad \nBut yall are 100% gonna ban ironic racism also\nWhich is very jorjorwell 1849",
            "Guys pls stop thugphobia 😭🙏🙏",
            "wordington is a place for funny memes and hot black men, not a place for hate",
            "thanks for saying this cuz the influx of actually racist annoying 13 year olds was getting annoying",
            "Based mods but I’m not surprised that there’s racists here given the premise of the sub, people on here calling all black men thugs even as a meme is already toeing the line lol",
            "Wordingtonians have fought so hard in an attempt to rid of thugphobia, but some people will never change\n\nThe spirit of the thug lives on",
            "Why come to a gay black twerking subreddit to be racist",
            "I love big booty blacks"
        ]
    },
    "Wordington cult": {
        "title": "Wordington cult",
        "score": 121,
        "url": "https://v.redd.it/sfnqr5iyzh9d1",
        "content": "",
        "num_comments": 9,
        "comments": [
            "pls somebody post the whole video",
            "What did the brotherhood of cain mean by this?",
            "Imagine my head in between that and my nose going in the butthole just a little bit and every time I inhale I inhale the butthole air through my nose and the pussy air through my mouth as those fat cheeks clap on my ears",
            "Bro, that's woman ass what are you doing?",
            "It's (unfortunately) a woman (🤮)",
            "You’ll never know OOOooooOooOoOoO 💀💀💀👻👻👻",
            "![gif](giphy|FFMnigLW0twShHLVnj|downsized)\n\nThis is epic",
            "To download the video you can use one of the following sites:\n\n* [RedditSave](https://redditsave.com/info?url=https://www.reddit.com/r/wordington/comments/1dr9chv/wordington_cult/)\n* [SaveMP4](https://savemp4.red/?url=https://www.reddit.com/r/wordington/comments/1dr9chv/wordington_cult/)\n* [RedditVideoDL](https://redditvideodl.com/dl.php?url=https://www.reddit.com/r/wordington/comments/1dr9chv/wordington_cult/)\n* [SaveRedd.it](https://saveredd.it/?url=https://www.reddit.com/r/wordington/comments/1dr9chv/wordington_cult/) (click on the Download button below Search Video)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wordington) if you have any questions or concerns.*",
            "https://preview.redd.it/h4c4hux0ki9d1.jpeg?width=2360&format=pjpg&auto=webp&s=a3175a060518d5c959f52c74c070e1c0c947cab0"
        ]
    },
    "I aint no soft city boy ": {
        "title": "I aint no soft city boy ",
        "score": 73,
        "url": "https://i.redd.it/5dsp0hasgi9d1.jpeg",
        "content": "",
        "num_comments": 5,
        "comments": [
            "https://preview.redd.it/duj6yifphi9d1.jpeg?width=492&format=pjpg&auto=webp&s=312fd6275d8e89ff86f688416e29688b64b72c90\n\nHave we ever needed to go this far",
            "https://preview.redd.it/01hiwfttxi9d1.jpeg?width=1125&format=pjpg&auto=webp&s=d56fdd6c2d413cb1de9ffaebd263e297b6e61f17",
            "https://preview.redd.it/pc8v1nwhxi9d1.jpeg?width=260&format=pjpg&auto=webp&s=5875ee490e36c4d0ea6417a40f4599e09f40ded0\n\nIdk"
        ]
    },
    "wordington insult": {
        "title": "wordington insult",
        "score": 410,
        "url": "https://v.redd.it/eftu9jpaff9d1",
        "content": "",
        "num_comments": 33,
        "comments": [
            "What happens when your kid is chronically online",
            "ALL THESE THINGS YOU SAID ALL THE THINGS YOU SAID RUNNING THROUGH MY HEAD RUNNING THROUGH MY HEAD RUNNING THROUGH MY HEAD",
            "God I thought he was saying cunt, I didn’t hear chud until I read the comments. Bros cooked",
            "Thr laughing in the background lmao",
            "Holy Reddit, this guy is as mad as Evil Keanu Reeves!",
            "Xer voice is so beautiful",
            "What’s he’s saying I’m currently at a party where I can barely hear my own voice",
            "Bruh, he needs to change schools 😭",
            "No coming back from this.",
            "I am not a chud but a gamer"
        ]
    }
}