{
    "I (m 30s) have a coworker (f 20s-30s) who refers to me by \"honey\", \"sweetie\", and \"babe\". It makes me uncomfortable.": {
        "title": "I (m 30s) have a coworker (f 20s-30s) who refers to me by \"honey\", \"sweetie\", and \"babe\". It makes me uncomfortable.",
        "score": 18,
        "url": "https://www.reddit.com/r/WorkAdvice/comments/1dr5y0w/i_m_30s_have_a_coworker_f_20s30s_who_refers_to_me/",
        "content": "Long story short, I started a new job and have a co worker who refers to me as stated above.\n\nShe refers to every other employee and customer as such, besides management. \n\nFor some reason, it really just rubs me the wrong way. I would much rather be called by my name or even a nickname. \n\nWhat would be the best way to ask her if she wouldn't mind calling me by my name instead?\n\nI just started this job, and everyone is supposed to be a team and be positive so I don't really want to be seen as annoying or causing problems. So part of me just thinks to leave it alone. But still part of me cringes every time I hear her say it. \n\nAny thoughts?",
        "num_comments": 106,
        "comments": [
            "Is your coworker that does this from the South? It's not uncommon for people from the South to call everyone pet names. I've been guilty of it myself but I've been out of the South a long time and lost that habit along the way. I'm not invalidating your discomfort, but calling everyone pet names might be what this person has done for their whole life and doesn't realize it's problematic because it's cultural.",
            "If you do talk with her, do it quietly and dont embarrass her in front of coworkers.",
            "Just tell her you don't like it...",
            "It is possible that this is her go to because she has difficulty remembering names.  I had a coworker do this as well, when I asked her to use my name, she admitted that she couldn't remember it....or most people's.",
            "If I was HR and you came to me with that complaint I would laugh. HR is for issues you cannot handle. If you cannot handle that yourself then you are a baby",
            "Maybe she has trouble remembering names. But just ask her. This is not an HR issue. They would refer you back to your manager",
            "You can't be fucking serious",
            "Not worth starting trouble over. ",
            "Are you sure she even *knows* anyone's name? She could be one of those people for whom names are forever elusive and this is her workaround.  So it's more like \"Hey there ... *buddy*.  Sure thing ... *hon*.  \n\nStill though, it would be perfectly fine to ask her to use your name, especially in a professional setting.",
            "The easiest way is to accept it and stop being \"offended\". It sounds like there just being polite. This generation is screwed"
        ]
    },
    "i suck at my job": {
        "title": "i suck at my job",
        "score": 3,
        "url": "https://www.reddit.com/r/WorkAdvice/comments/1drdzro/i_suck_at_my_job/",
        "content": "I am a 24M and i have been working as an IT Technician for about a years and a half and i genuinely feel that i am terrible at my job even though i work what to do. At my job i mainly install camera (IP and Analog) and i can set up a system but when i am working i always feel anxious and sweat profusely.... i just feel uneasy terrified i am going to mess some up. It also does not help that my boss is extremely vocal when i mess up, using the most colorful array of word and constantly ask me why is he paying me. Yesterday i messed a machine (which was not in my field) but he still asked me to try and fix it and now i just feel like wtf am i doing here because maybe his right. Maybe i should just quit. I love IT but maybe I'm just shit at it. any advise?",
        "num_comments": 2,
        "comments": [
            "Practice makes perfect buttercup. Youre anxious and insecure because some things are still new to you, or youre so afraid to mess up. But thats part of the learning process. Assuming this is one of your first jobs, youll gain confidence through experience and time. The best part is you get to learn while on somebodys dime. Your boss is there to help teach you instead of expecting you to do everythign right. Maybe he or she isnt the best boss, and thats something youll need to establish boundaries on. Keep grinding and working on your craft, itll boost your confidence",
            "Don't quit but don't take the abuse either. Try to study and learn more about IT to give you confidence in your work. Is there a weekend class or online training that can help build your skills? What about joining a professional organization to find peers in the industry to ask questions? You'll get there. Don't panic. Enjoy the journey. Good luck "
        ]
    },
    "Is there any recourse for this?": {
        "title": "Is there any recourse for this?",
        "score": 3,
        "url": "https://www.reddit.com/r/WorkAdvice/comments/1drb29p/is_there_any_recourse_for_this/",
        "content": "I (31f) left my job of 5.5 years in April. I was a professional writer for a trade publication and I had over 1,000 bylines.\n\nThe owners of the company (husband and wife team) and I did not part on good terms despite my best efforts. They said I was in violation of my noncompete by going to work for another trade media organization. Keep in mind, I never worked in sales and had no kowledge of company financials or access to analytics. They never paid me for my last week of work and sent me a cease and desist letter (they never took it any further). I was willing to let all of that go and move on.\n\nBut I found out recently that they removed me from their website and took all my bylines away. Now, my bylines say “by [company] staff.” I’m trying to ignore it but it’s starting to get to me as it’s the bulk of my portfolio. Any recourse for this? Or should I just let it go?",
        "num_comments": 20,
        "comments": [
            "They did not pay you yet? DOL time..\nAs for the rest, contract should tell you..",
            "No recourse unless you had a contract that spells out how bylines are handled.  Companies own the work products of their employees.  Next time download PDFs of your published work ,(nothing confidential , of course!) to your personal computer.",
            "What does (did) your contract say about it? Likely there isn't, because that is their property, not yours.",
            "Try r/EmploymentLaw (if you are in the US)",
            "Which they can take you down from their website and the bylines, since they fired you. You can only sue for the DOL they did not pay. Goodluck on the getting the DOL paid. And find a job with a big-name company to write for. Good luck.",
            "I thought about going to DOL - just worried about retaliation",
            "Thanks for the advice! Im kicking myself now for not doing this. Not going to make that mistake again.",
            "Fair point - my fault for not saving a copy of the contract.",
            "What can they do in retaliation at this juncture?",
            "Depending on the state youre in, the company can be in SERIOUS SERIOUS trouble for not paying you for your last week of work. Absolutely you need to pursue this."
        ]
    },
    "Help with explaining poor attendance": {
        "title": "Help with explaining poor attendance",
        "score": 2,
        "url": "https://www.reddit.com/r/WorkAdvice/comments/1drbyms/help_with_explaining_poor_attendance/",
        "content": "I recently applied for a job as a 911 dispatcher and the offer (which  I received and accepted) is contingent upon a very thorough background investigation. My only concern at this point is my previous work history in regards to attendance. I have had very poor attendance in some of my job positions. This new job has me filling out a form and they ask questions such as “have you ever been fired from a job, have you ever resigned from a job to avoid being terminated, and have you ever faced disciplinary action from your job for any reason? “\n\nThe answer to all of these questions is yes, and it has to do particularly with 2-3 jobs that I’ve had and they were most recent on my résumé, unfortunately. \nI was fired from one job in 2019, I faced disciplinary action at two other jobs, and one of those jobs allowed me to resign before being terminated, and the other quit for other reasons. \n\nI have to explain my answers on a separate sheet of paper, which is nice because I am very articulate and it gives me the opportunity to shed light on the situation however, I am obviously very concerned that my previous history will automatically disqualify me, as attendance is a big deal.  \n\nI understand the immense irresponsibility and carelessness I had previously may shoot me in the foot at this particular juncture so please spare me any shit talk- I already know, and I’m very disappointed in myself. I already made it past the interview process, and now I will have to do this very thorough investigation and I am wondering if you guys think it is better to simply withdraw my application or to plead my case when I’m filling out this form. If I don’t get this position now, it’s still definitely something I hope to be able to reapply to and get in the future, though I don’t want to put that out in the world because I do want this opportunity now. \n\nI believe I also have the opportunity to speak with the detective assigned to my case but I am nervous about being rejected from such a great opportunity like this. I plan to be 100% honest when submitting this form. I’m just curious if you think there is any possible chance that they would still give me a shot? Is it worth begging essentially in my answers to these questions? Any advice will be greatly appreciated. \n\n",
        "num_comments": 11,
        "comments": [
            "Probably not a good fit for you. Move on",
            "How recent were you at the jobs that you faced disciplinary action in?",
            "Do you think it is a bad idea to simply admit that while they were definitely some extenuating circumstances that caused me to miss work at times, I was also sometimes irresponsible and careless with the way that I handled my professional endeavors? And that Ive learned from doing such things? I just want it to be clear to them that I do take responsibility for my actions and that my person growth is certainly there. I dont want them to read my responses and think Im just making excuses for everything",
            "The most recent job, I only worked there for six months, and I think it was probably within two months because I had to call out (unexcused absence) and at the other job, I was probably a year in until they gave me a disciplinary action form",
            "In your most recent job do you have any disciplinary actions against you? If not you can advocate that you learned from your mistakes and all you need is the opportunity to continue to grow as a professional",
            "At the job I am with right now, Technically yes  I had to call out due to a family emergency that I wasnt able to provide medical documentation for because it didnt result in the person going to the hospital but that was it. I havent been late or anything of the sort. This happened on June 15, and Ive been working here for a month",
            "Hmmmm, this is tough because personally as a boss I value consistency and availability above everything else. Youll have find a way to explain that this isnt going to be a regular thing even if that family member is sick. You are tying to get into a very serious job and they will need to feel confident that your attention isnt split",
            "Jesus Christ I'd hate to have you as a boss. Read what you just wrote.",
            "It helps that you are an articulate writer, because your explanation of past incidents needs to focus on the singular nature of specific events that will not reoccur. If grandma fell off the porch roof, and you had to skip work to take her to the hospital for a broken leg, hopefully thats not gonna happen again.\n\nObviously, if its the same reason again and again, there are situations in your life that are preventing you from being a responsible employee. And thats what theyre trying to guard against.\n\nThe only the bright spot I see in what youve told us is that these issues occurred during a pandemic when a lot of weird shit was going on. Now the things have calmed down, its possible that you will be a more responsible employee.\n\nGood luck",
            "Based on your OP and comments, you seem to have a history of attendance issues. Even if youre able to explain it away, a 9-1-1 dispatch position likely requires consistent attendance and being dependable. \n\nHaving been employed in HR by a county that had a 9-1-1 center, they have to pour A LOT of training into new hires. As in, absence is detrimental to training and once trained, your absence can cause delay in answering emergency calls. \n\nEmergencies happen. Unplanned absences happen. People need time off work. Are you able to work consistently?"
        ]
    },
    "FMLA": {
        "title": "FMLA",
        "score": 2,
        "url": "https://www.reddit.com/r/WorkAdvice/comments/1dr92jg/fmla/",
        "content": "An Employee is on FMLA for having a baby soon as she got from having a C-section. She came the next day from the hospital and brought the baby on the job. Oh yeah her boyfriend also works there 'the baby daddy'which we did not know when we hired them,but she is obsessed with going wherever he is when they go out in the community. She brings the baby to wherever they are while he is on the clock and she is on FMLA. their job is to support direct care to people with mental disabilities. Sometimes the administration office has brought a child to visit here and there. The mom on FMLA was told not to bring the newborn back to the workplace while on FMLA. She is debating why the administration office is allowed to bring kids to the workplace, but she is not allowed to bring her newborn to the office. Is this illegal? The administration office does not work with direct care supporting any people only the staff that's on FMLA and the boyfriend works to support people.",
        "num_comments": 1,
        "comments": [
            "I need some clarification.  The mother and the baby's father work for the same employer, where you also work.  They both support care to patients with mental disabilities.  Sometimes administrative employees also bring their children in to visit.  This new mother, however, was told not to bring her newborn to the workplace while on FMLA.  You wonder if it is illegal to allow administrative employees to bring children and not to allow this new mother to bring her newborn.\n\nWhat is your role in this scenario?\n\nAre others on FMLA allowed to enter the workplace while they are on leave, including those who are using FMLA for other reasons?\n\nAre they asking her not to bring the baby to the direct care environment only?  What are the differences - especially in terms of safety and exposure to risk - between the administrative and direct care environments?\n\nHR, not a lawyer"
        ]
    }
}