{
    "This sub is NOT for self-promotion. Posts advertising yourself for hire will be removed without hesitation.": {
        "title": "This sub is NOT for self-promotion. Posts advertising yourself for hire will be removed without hesitation.",
        "score": 1218,
        "url": "https://www.reddit.com/r/WorkOnline/comments/lk04i4/this_sub_is_not_for_selfpromotion_posts/",
        "content": "r/WorkOnline is a place to talk about making an income online. This includes random jobs, online employers, remote work, sites that pay you and ways to monetize websites. These are sites and strategies that will yield the user minimum wage or better and allow them to provide for themselves.\n\nWhile we understand that given today's current global situation, there has been a massive influx of For Hire posts or \"I will do X for you posts\" and it's become quite a disruption.\n\nAfter some discussion, it has been decided that we will no longer allow these kinds of posts. That's not what the sub is for and those who come here looking for help, advice, or whatever don't want to see that either.\n\nI encourage all users to use the Report button if you see anything like this.",
        "num_comments": 315,
        "comments": [
            "[deleted]",
            "Thank you. Those posts were becoming too frequent.",
            "Good choice.\n\nr/forhire and r/slavelabour exist for people wanting to offer their services.",
            "Good! About time.",
            "What I have found we sites such as [Fiverr.com](https://Fiverr.com) and [Upwork.com](https://Upwork.com) have been a great resource to hire for skills you might not have. There is a range of prices and a lot of different categories to get people started. I have only purchased \"gigs: so I do not know if there is a registration fee. For anyone motivated to do work online, I have seen some of these member with 6 figure incomes. Hope that helps.",
            "On that note I understand “hire me” post are annoying but is there a thread anywhere for gig work online? I’m familiar with beer money, but none of those gigs seem to even pay minimum wage. As far as I can tell, most of this subreddit seems to be people looking for a job. I’m already employed, just looking for something on the side.",
            "Hi, my post was recently removed but I don’t believe it violates any of the rules. Could you offer some clarification?",
            "[removed]",
            "Still not clear whether you allow \"hiring\" posts",
            "What's a good sub reddit for that then?"
        ]
    },
    "Some things to search before coming on here and asking WHAT JOBS ARE ONLINE???": {
        "title": "Some things to search before coming on here and asking WHAT JOBS ARE ONLINE???",
        "score": 3285,
        "url": "https://www.reddit.com/r/WorkOnline/comments/lnml80/some_things_to_search_before_coming_on_here_and/",
        "content": "I am so sick and tired (as are many others) of the same post:\n\n&#x200B;\n\n**I AM NEW TO ONLINE WORK!!! HELP ME!!!!**\n\nSo here is  several things to try.\n\n***(TBH I don't think you should even be applying for an online job if you cant do the research for yourself as online work means doing your own research and organisation. It aint exactly rocket science)***\n\n* Searching the words [BEST REMOTE JOBS](https://www.google.com/search?safe=strict&sxsrf=ALeKk03XY5CYyWXz_EN7IGDdDOj0fM_RpA%3A1613757774482&source=hp&ei=Tv0vYJf7F4u2UunnuNgI&iflsig=AINFCbYAAAAAYDALXn6ZiDPfi5YYnf9SaTIx_Img-P6S&q=best+remote+jobs&oq=best+remote+jobs&gs_lcp=Cgdnd3Mtd2l6EAMyAggAMgIIADICCAAyAggAMgIIADICCAAyAggAMgIIADICCAAyBQgAEMkDOgQIIxAnOgQILhBDOggIABCxAxCDAToECAAQQzoHCAAQyQMQQzoHCAAQhwIQFDoFCAAQsQNQjRtYujNgpjpoAHAAeAGAAfgBiAHXDpIBBjExLjIuM5gBAKABAaoBB2d3cy13aXo&sclient=gws-wiz&ved=0ahUKEwiX2pWXxPbuAhULmxQKHekzDosQ4dUDCAk&uact=5) or going to a [job engine site](https://www.google.com/search?safe=strict&sxsrf=ALeKk02g_z2DK3PPPcoLqT_FTLT5ZIxe2g%3A1613757820270&ei=fP0vYJHHD5GZ1fAPz6G6qAM&q=indeed&oq=indeed&gs_lcp=Cgdnd3Mtd2l6EAEYADIKCAAQsQMQgwEQQzINCAAQsQMQgwEQyQMQQzIFCAAQkgMyBQgAEJIDMgQIABBDMgIIADIICAAQsQMQgwEyCAgAELEDEIMBMggIABCxAxCDATIECAAQQzoHCAAQRxCwAzoECCMQJzoICC4QsQMQgwE6DgguELEDEIMBEMcBEKMCUN7WA1iB4ANg_ekDaANwAngAgAG5AYgB9geSAQMwLjeYAQCgAQGqAQdnd3Mtd2l6yAEIwAEB&sclient=gws-wiz) and literally typing in REMOTE WORK or ONLINE JOBS\n* If you can't find jobs that you have any experience, well then you need to do some studying. You can get free courses on [google](https://learndigital.withgoogle.com/digitalgarage) that allows to explore a wide variety of courses, including: digital marketing AND ***CODING!!!!!!***\n* STUCK?  Don't worry cause with [coursera](https://www.coursera.org/) you can study with a million different universities (including the USA)  You can pay to receive the certificate or whatever OR YOU CAN DO IT FOR FREE.\n* check out these courses from top universities from harvard to berkley that can help you start to understand what is available out there. https://www.edx.org/search\n\nSo legit stop being so lazy and actually do some work as opposed to coming on this site asking\n\n\"UH WHAT CAN I DO ONLINE?\"\n\nbecause you'll get the same answer over and over again and if you aint qualified you wont get it.\n\n\nEDIT: this was not meant in any way to make people feel uncomfortable however my main point here is this post and in the comments section is to give useful information to people who need it.\n\nComing onto this Reddit making a post about how you’re looking for work, your age and location isn’t going to cut it. Please provide some detail so the people who already are remotely working can point you in the right direction. We don’t need the sob story. Just help us to help you properly instead of giving out the same common answers every time.\n\nThank u for coming to my ted talk.",
        "num_comments": 639,
        "comments": [
            "While this may seem obvious to some (most? idk, I've seen this issue pop up),  maybe mention that if you have to pay in advance to get a job - that's a scam, not a job.",
            "I get what you’re saying, but as someone pointed out already in the comments, sometimes you spend hours (or in my case, years) researching online jobs through Google, Indeed, Monster, YouTube or whatever but you come across the same types of jobs all the time that may require skills that you don’t have or equipment you can’t afford.I’ve started coming to this thread because I was tired of coming across jobs like “Virtual assistance” or “Customer Service” etc. all the time. All of which I have applied to, but never got anywhere with. This thread has exposed me to jobs that I never would have been introduced to otherwise despite the many years of trying to find online work. I’ve also found new places to find online work through this thread, from people who have asked those types of questions, which has helped a lot.",
            "\n\nHonestly this is such a privileged take from someone who had probably, already, successfully gotten an online job when this was posted. I fully understand that on subs like this, hundreds of people will post the same obvious question, even with a mega-thread pinned to the top of the sub. But I and many others have done all the things that “ain’t exactly rocket science” like “going to a job engine site”, having certifications and or taking courses, having experience in the field or even a degree, applying, doing hours long qualification tests, and interviewing, just to not even get a reply back saying we didn’t get the position. Many of which applied to a similar position in person and they got the job. \n\nYes I’m sure many people come on here just asking what can I do, just expecting a simple answer without doing even a Google search by themselves. But many people, myself included, want to know what companies have actually hired you, what sites we should avoid, lesser known tips, ways they filter out candidates, or even specific jobs that aren’t very common, that may fit us very well. Not to mention those who may be older or less inclined to the internet, especially with such a new thing as working online, and simply don’t know where to begin. And telling them do the obvious thing like go on job sites or take courses, just to be sarcastic and ironic towards the few people that come on here without putting in any thought, isn’t helping anyone. Especially when you posted it in a format that seemed like it could actually be helpful for the people who really need it. \n\nIt honestly comes off as extremely privileged, and unaware of how things actually are for most people. Like can we address how ridiculous it is that we’re supposed to spend hundreds out of our own pocket (or at the very least our time) on courses, on very specific skills, for the OPPORTUNITY to get a job. For the certificate to prove we’re certified or have experience, on something that can easily be trained or that most people can pick up  on their own. Where they still may not even respond to you, let alone hire you. And the people that come here wondering why this may be happening, (even though they aren’t being “lazy” ) and want to know ways to combat this, from people that may have succeed in the past. Get treated with a post like this pinned to the top of the sub? No wonder trying to find a job online is so bad, people with zero human empathy, and common sense, like you, are the ones behind the desk, already secured in their future, making these comments about “lazy” people, and deciding wether they’re worthy for a barely livable wage position, that still could be the difference between being homeless and having food on the table.",
            "This sub reddit feels super unwelcoming/toxic rn XD",
            "I agree \n\nI just think ppl don't have the knowledge of how to properly Google. How to use keywords properly to get the search results they want.  Also it might just be a gwnerational gap of older workers looking to transition from traditional work. They just don't have the tech knowledge to figure out where to start.  \n\nI'm sure some ppl are lazy and don't put in the work and just making a post expecting resources.",
            "The problem with this is that some of us ARE Googling it. I'm the queen of using my resources, and I still keep getting stuck with scams and work from home jobs that aren't in California. \n\nI tried Upwork, but literally every single job posting I apply to does that scammy \"here's the link to your Telegram interview\" bullshit. I finally closed my account yesterday.  I've done Fiverr, but no buyers. Freelancer seems to be the same scammer posts as Upwork, but WORSE.\n\nI get what the general sentiment is in this post,but holy shit I don't know how the hell people are getting these legit WFH jobs unless their office jobs went remote during covid.\n\nEven if you type \"work from home\" or \"remote\" into Google or Indeed, a shitload of results come back with jobs that are in person,but were marked \"remote\" or \"telecommute\". ( just saw a post on Indeed yesterday for a restaurant server position that said \" remote\". Wtf)\n\nThen there's positions that are legit, but pay $7 an hour. \n\n\nSo yes, excuse us for seeing WFH jobs as a big mystery or lottery.",
            "I mean I came on this sub for research 😭",
            "After a year or two of looking for the answer to this same question it seems to me that there are two answers.\n\n**For the unskilled:**\n\n- Surveys that pay next to nothing and disqualify you 9 times out of 10 after asking your gender / marital status / annual income for the thousandth time even though that information is all part of your profile and is supposed to be taken into consideration automatically.\n\n- Offer walls that only seem to actually pay you 50% of the time and where the highest paying jobs usually require you spending more money than you earn.\n\n- Cryptocurrency faucets that give you a 1/10,000 chance of getting anything worthwhile once an hour or once a day.\n\n- Transcription jobs that can be worthwhile if you live in a country with a shitty currency and you treat it like a 9 to 5 full time job.\n\n**For the skilled:**\n\n- Programming.\n\n- Blogs.",
            "Yes. Ok. I have browsed the sub. I have googled. However, there’s a catch: I’m profoundly deaf and many or most of these jobs require the ability to speak on the phone, communicate via zoom, etc. so what should I do? I could really use some guidance here.\n\nThis post is 3 days old so if I don’t get much traction here I’ll repost this as a separate post and add more detail. But right now I’m just looking for general ideas, thanks!",
            "Telecommute or telecommuting are good search words as well."
        ]
    },
    "People who work online, have any of you ever opened an ecom store?\n": {
        "title": "People who work online, have any of you ever opened an ecom store?\n",
        "score": 8,
        "url": "https://www.reddit.com/r/WorkOnline/comments/1dqytrp/people_who_work_online_have_any_of_you_ever/",
        "content": "After searching and browsing many posts, I found that online work is either freelance or remote work from home. Have you ever tried opening an ecom store and it went smoothly? If so, can you tell me how you did it? Do you have any suggestions, including the selection of web builders?\n\nThanks in advance:)\n\n",
        "num_comments": 2,
        "comments": [
            "I have opened an ecom store. I made one sale online. But I made a lot of sales offline. I dropped shipped shoes. People would run after me on the street to ask me about them and that’s where I’d make my sales. But I couldn’t figure out the online part."
        ]
    },
    "Scam from company called Zar IT solutions?": {
        "title": "Scam from company called Zar IT solutions?",
        "score": 2,
        "url": "https://www.reddit.com/r/WorkOnline/comments/1dqnq6c/scam_from_company_called_zar_it_solutions/",
        "content": "Just got a text from a \"recruiter\" seemed ok at first then they asked me to click on a link to do a credit score check and background and to pay 29$ before even getting a interview. Never had to do this before sounds off. Is this legit or scam?",
        "num_comments": 3,
        "comments": [
            "Nah dog don't do it",
            "Zoltan!!!!"
        ]
    },
    "Should I switch my degree to computer science? ": {
        "title": "Should I switch my degree to computer science? ",
        "score": 2,
        "url": "https://www.reddit.com/r/WorkOnline/comments/1dpogee/should_i_switch_my_degree_to_computer_science/",
        "content": "I study at university majoring communication art’s internationally where I cannot work traditional ways, if I search for freelancing everything is so saturated and I never land on any gigs  and it’s frustrating, and I had reality check of how this major isn’t challenging me quite enough, since I’ve been investing on my education I want to be skill full and that will help me in digital remote jobs so that I can work online even during my undergrad year, learn and earn few. Idk it makes sense or not but have time to think for a month bc I am 1 sememster in for the com arts so maybe it’s not late if I want to switch but communication arts is such a “Me” thing since naturally good at communicating, with words, psychology and I guess that’s why it’s not challenging me, but upcoming courses are more into PR, visual audio media, journalism and all. Which I can take these classes on my free electives if I switch to CS. Im just flying my head around with confusion and don’t know what to do",
        "num_comments": 6,
        "comments": [
            "It only matters what you want to do. Good luck",
            "I did it, I don’t recommend it unless you actually like it because otherwise you will be in hell. I regret it. \n\nTry CS50 online for free. If you enjoy it, then consider it.",
            "Oh thankyou!! I will try the free course first then since I have time of 1-2 month until I can change my major. But for some positivity on you don’t regret it you gottaa push yourself a lil to ease later on in real work, unless for com arts it’s light on academics but real ass too secure good paying positions so that’s my motivation"
        ]
    }
}