{
    "This sub is NOT for self-promotion. Posts advertising yourself for hire will be removed without hesitation.": {
        "title": "This sub is NOT for self-promotion. Posts advertising yourself for hire will be removed without hesitation.",
        "score": 1214,
        "url": "https://www.reddit.com/r/WorkOnline/comments/lk04i4/this_sub_is_not_for_selfpromotion_posts/",
        "content": "r/WorkOnline is a place to talk about making an income online. This includes random jobs, online employers, remote work, sites that pay you and ways to monetize websites. These are sites and strategies that will yield the user minimum wage or better and allow them to provide for themselves.\n\nWhile we understand that given today's current global situation, there has been a massive influx of For Hire posts or \"I will do X for you posts\" and it's become quite a disruption.\n\nAfter some discussion, it has been decided that we will no longer allow these kinds of posts. That's not what the sub is for and those who come here looking for help, advice, or whatever don't want to see that either.\n\nI encourage all users to use the Report button if you see anything like this.",
        "num_comments": 315,
        "comments": [
            "Thank you. Those posts were becoming too frequent.",
            "Good choice.\n\nr/forhire and r/slavelabour exist for people wanting to offer their services.",
            "On that note I understand “hire me” post are annoying but is there a thread anywhere for gig work online? I’m familiar with beer money, but none of those gigs seem to even pay minimum wage. As far as I can tell, most of this subreddit seems to be people looking for a job. I’m already employed, just looking for something on the side.",
            "Still not clear whether you allow \"hiring\" posts",
            "What's a good sub reddit for that then?",
            "Does that mean no job seeking posts? Like asking who is hiring?",
            "HOW DARE YOU TRY TO FIND A JOB AND ADVERTIZE YOURSELF HERE YOU FILTHY SCUM YOU\n\n(Edit: I guess y’all don’t know what mocking satire is lol.)",
            "Guys I work in clickworker/uhrs, will signing up with sites like prolific get me banned?",
            "does citizenship matter when applying?",
            "Any suggestions for someone who does entry level IT looking to make a little more cash on the side?"
        ]
    },
    "Some things to search before coming on here and asking WHAT JOBS ARE ONLINE???": {
        "title": "Some things to search before coming on here and asking WHAT JOBS ARE ONLINE???",
        "score": 3298,
        "url": "https://www.reddit.com/r/WorkOnline/comments/lnml80/some_things_to_search_before_coming_on_here_and/",
        "content": "I am so sick and tired (as are many others) of the same post:\n\n&#x200B;\n\n**I AM NEW TO ONLINE WORK!!! HELP ME!!!!**\n\nSo here is  several things to try.\n\n***(TBH I don't think you should even be applying for an online job if you cant do the research for yourself as online work means doing your own research and organisation. It aint exactly rocket science)***\n\n* Searching the words [BEST REMOTE JOBS](https://www.google.com/search?safe=strict&sxsrf=ALeKk03XY5CYyWXz_EN7IGDdDOj0fM_RpA%3A1613757774482&source=hp&ei=Tv0vYJf7F4u2UunnuNgI&iflsig=AINFCbYAAAAAYDALXn6ZiDPfi5YYnf9SaTIx_Img-P6S&q=best+remote+jobs&oq=best+remote+jobs&gs_lcp=Cgdnd3Mtd2l6EAMyAggAMgIIADICCAAyAggAMgIIADICCAAyAggAMgIIADICCAAyBQgAEMkDOgQIIxAnOgQILhBDOggIABCxAxCDAToECAAQQzoHCAAQyQMQQzoHCAAQhwIQFDoFCAAQsQNQjRtYujNgpjpoAHAAeAGAAfgBiAHXDpIBBjExLjIuM5gBAKABAaoBB2d3cy13aXo&sclient=gws-wiz&ved=0ahUKEwiX2pWXxPbuAhULmxQKHekzDosQ4dUDCAk&uact=5) or going to a [job engine site](https://www.google.com/search?safe=strict&sxsrf=ALeKk02g_z2DK3PPPcoLqT_FTLT5ZIxe2g%3A1613757820270&ei=fP0vYJHHD5GZ1fAPz6G6qAM&q=indeed&oq=indeed&gs_lcp=Cgdnd3Mtd2l6EAEYADIKCAAQsQMQgwEQQzINCAAQsQMQgwEQyQMQQzIFCAAQkgMyBQgAEJIDMgQIABBDMgIIADIICAAQsQMQgwEyCAgAELEDEIMBMggIABCxAxCDATIECAAQQzoHCAAQRxCwAzoECCMQJzoICC4QsQMQgwE6DgguELEDEIMBEMcBEKMCUN7WA1iB4ANg_ekDaANwAngAgAG5AYgB9geSAQMwLjeYAQCgAQGqAQdnd3Mtd2l6yAEIwAEB&sclient=gws-wiz) and literally typing in REMOTE WORK or ONLINE JOBS\n* If you can't find jobs that you have any experience, well then you need to do some studying. You can get free courses on [google](https://learndigital.withgoogle.com/digitalgarage) that allows to explore a wide variety of courses, including: digital marketing AND ***CODING!!!!!!***\n* STUCK?  Don't worry cause with [coursera](https://www.coursera.org/) you can study with a million different universities (including the USA)  You can pay to receive the certificate or whatever OR YOU CAN DO IT FOR FREE.\n* check out these courses from top universities from harvard to berkley that can help you start to understand what is available out there. https://www.edx.org/search\n\nSo legit stop being so lazy and actually do some work as opposed to coming on this site asking\n\n\"UH WHAT CAN I DO ONLINE?\"\n\nbecause you'll get the same answer over and over again and if you aint qualified you wont get it.\n\n\nEDIT: this was not meant in any way to make people feel uncomfortable however my main point here is this post and in the comments section is to give useful information to people who need it.\n\nComing onto this Reddit making a post about how you’re looking for work, your age and location isn’t going to cut it. Please provide some detail so the people who already are remotely working can point you in the right direction. We don’t need the sob story. Just help us to help you properly instead of giving out the same common answers every time.\n\nThank u for coming to my ted talk.",
        "num_comments": 639,
        "comments": [
            "While this may seem obvious to some (most? idk, I've seen this issue pop up),  maybe mention that if you have to pay in advance to get a job - that's a scam, not a job.",
            "I get what you’re saying, but as someone pointed out already in the comments, sometimes you spend hours (or in my case, years) researching online jobs through Google, Indeed, Monster, YouTube or whatever but you come across the same types of jobs all the time that may require skills that you don’t have or equipment you can’t afford.I’ve started coming to this thread because I was tired of coming across jobs like “Virtual assistance” or “Customer Service” etc. all the time. All of which I have applied to, but never got anywhere with. This thread has exposed me to jobs that I never would have been introduced to otherwise despite the many years of trying to find online work. I’ve also found new places to find online work through this thread, from people who have asked those types of questions, which has helped a lot.",
            "This sub reddit feels super unwelcoming/toxic rn XD",
            "I mean I came on this sub for research 😭",
            "Yes. Ok. I have browsed the sub. I have googled. However, there’s a catch: I’m profoundly deaf and many or most of these jobs require the ability to speak on the phone, communicate via zoom, etc. so what should I do? I could really use some guidance here.\n\nThis post is 3 days old so if I don’t get much traction here I’ll repost this as a separate post and add more detail. But right now I’m just looking for general ideas, thanks!",
            "Telecommute or telecommuting are good search words as well.",
            "This is all true but if you’re a newbie, it’s confusing. So many scams, so much running around in circles with zero results. Referrals from others who are actually successful is like gold because your suggestions are actual REAL leads with REAL possibilities. I don’t think most are lazy, I’ve been searching solid for over a week. \nI got hired but training is over a month a way, then another 4 weeks…. What’s a person to do?!?",
            "Also it’s worth looking at indeed and sorting by remote. Indeed is really easy for employers to use so I do recommend it over other job sites for this sort of thing.",
            "Just keep applying everywhere. I just got hired at Atento, I am working from California. It is a call center working with the Health Department of Maryland to provide covid vaccinations and answer Covid 19 related questions. They provided me with a laptop and headset.",
            "It’s hilarious how no one searches the sub before they post. They make a super long ass post about their situation, don’t state any of their skills and expect people to just hand them jobs. \n\nOr the constant “I’m 16 and live in a third world country”"
        ]
    },
    "People who work online, have any of you ever opened an ecom store?\n": {
        "title": "People who work online, have any of you ever opened an ecom store?\n",
        "score": 9,
        "url": "https://www.reddit.com/r/WorkOnline/comments/1dqytrp/people_who_work_online_have_any_of_you_ever/",
        "content": "After searching and browsing many posts, I found that online work is either freelance or remote work from home. Have you ever tried opening an ecom store and it went smoothly? If so, can you tell me how you did it? Do you have any suggestions, including the selection of web builders?\n\nThanks in advance:)\n\n",
        "num_comments": 6,
        "comments": [
            "I have opened an ecom store. I made one sale online. But I made a lot of sales offline. I dropped shipped shoes. People would run after me on the street to ask me about them and that’s where I’d make my sales. But I couldn’t figure out the online part.",
            "Where can i find shoes for cheap to Dropshipping any leads please",
            "Have you worked on your SEO?  Start a blog on some free platform and talk about your shoes.  Link back to your website.  Buy animated GIF banner ads from someone on Fiverr.  Look for high-traffic blogs that accept advertising.  Look on Fiverr for blogs that are selling ad space.  Add your product feed to Google Shopping and Bing.  Post on Instagram.  I'm also a fan of offline promotion, like putting flyers up (with tear-off tabs) in local shops that have a bulletin board, like supermarkets and drugstores.  Is there a show repair shop in your area?  See if they'll let you leave flyers on their counter.  Maybe dry cleaners too.",
            "Alibaba.  Also look at dropshipping clearinghouses, there are a few online where you can choose from thousands of vendors."
        ]
    },
    "Scam from company called Zar IT solutions?": {
        "title": "Scam from company called Zar IT solutions?",
        "score": 2,
        "url": "https://www.reddit.com/r/WorkOnline/comments/1dqnq6c/scam_from_company_called_zar_it_solutions/",
        "content": "Just got a text from a \"recruiter\" seemed ok at first then they asked me to click on a link to do a credit score check and background and to pay 29$ before even getting a interview. Never had to do this before sounds off. Is this legit or scam?",
        "num_comments": 4,
        "comments": [
            "Nah dog don't do it",
            "They are looking to steal your identity. There is no job.",
            "Zoltan!!!!"
        ]
    },
    "Problems with Appen and Payoneer": {
        "title": "Problems with Appen and Payoneer",
        "score": 2,
        "url": "https://www.reddit.com/r/WorkOnline/comments/1dpnzlw/problems_with_appen_and_payoneer/",
        "content": "Hi, \nI passed the qualification exam for my language and suddenly a request to connect my paypal account to Payoneer appeared in  my Appen account. I followed the instructions and even created a Payoneer acc using the same email adress as my Paypal account.\nBut nothing has happened for a week now, i get daily reminders to \"register to Payoneer or your account will close in 7 days\" wtf? The Payoneer account was approved, i did all the verification stuff with ID and a utility bill. I've sent an email to Appen but they only replied with a message saying i need to contact Payoneer. I sent Payoneer an email 3 days ago but havent heard anything. This is driving me crazy lol. Can anyone help?",
        "num_comments": 6,
        "comments": [
            "I had an almost identical issue a couple of weeks ago.......frustrating as hell, you're just stuck in limbo. I got impatient waiting for an email reply so contacted Payoneer via live chat. In fairness, the guy got it sorted for me within a few hours. After that, it was only an hour or so until it connected to Appen.\n\nTry the chat. Good luck!",
            "This happened to me, and I thought I'd done everything. Payoneer even showed Appen as an approved company for me to receive funds from. It turned out I needed to fill out the tax form on Payoneer for Appen. Once I submitted that, I was notified immediately that I was approved to work on projects. Hope this helps!",
            "Great tip, will do! Thanks!",
            "Thank you! My acc was stuck in verification limbo but chat support boosted the priority so hopefully it'll be approved soon. Thanks for the info on tax form, I'll be on the lookout!"
        ]
    }
}