{
    "Arizona Iced Tea Prices": {
        "title": "Arizona Iced Tea Prices",
        "score": 13338,
        "url": "https://v.redd.it/8lp3mp0h2c9d1",
        "content": "",
        "num_comments": 386,
        "comments": [
            "Stores taping over the 99 label and selling them for 2.99: ",
            "Whoever's running McDonald's needs to get on the phone with this guy. You don't wanna dick around with price elasticity and then have forces outside your control price your target customers out of your market",
            "And that is MY kind of guy. The rest of these companies are either irresponsible losers or sociopaths. But literally.",
            "The company should open up food trucks.",
            "This is how you get consumers excited about a product. As long as this guy is alive, I'll continue drinking Arizona. Someday they'll sell it to nestle and it'll all go to shit.",
            "Makes me want to go and get one now",
            "If every owner was like this guy capitalism would be alright without a big government regulatory apparatus.",
            "Wait, is he saying you can build a successful, profitable business *without* gouging customers? That sounds like socialism! /s",
            "My stores have upped the price of all Arizona cans to $2-$3 :(",
            "\"The price is on the can, though.\""
        ]
    },
    "Flight attendants don't get paid for boarding passengers! This must change! (source: Adam Conover)": {
        "title": "Flight attendants don't get paid for boarding passengers! This must change! (source: Adam Conover)",
        "score": 2108,
        "url": "https://v.redd.it/t46xcq0yld9d1",
        "content": "",
        "num_comments": 56,
        "comments": [
            "Flight attendants should be paid from the time they walk in to the airport until the time they leave the airport (or whatever hotel they are staying at). I mean at minimum when they get to the gate for their first flight until the time they leave the gate (the desk gate with the scanner).",
            "They must be paid from the moment they are ordered to appear. This is how jobs should work.",
            "Thats craaaazy. I didnt know!",
            "Its crazy the union employees dont but the non union airlines like delta do pay for boarding",
            "I hear they dont get paid until the doors are shut, thats RICIDILOUS.",
            "If anyone asks a flight attendant for something before the doors close they should just say sorry Im off the clock.",
            "Striking is **the** \"collective bargaining power\".",
            "The fact the Adam advocates for every job is just amazing",
            "The should be paid hourly from the moment they walk into the terminal til the moment they leave. Insane.",
            "TIL that flight attendants dont get paid until the door closes. You know this is the result of some bullshit lawyering. Like some guys in suits are saying WeLl ThEiR tItLe is FliGhT AtTeNdAnT, tHeIr JoB iS tO aTtEnD tO MaTtErS dUrInG the FlIgHt. WhY ShOuLd We PaY ThEm If ThE pLaNe iSnT FlYiNg?"
        ]
    },
    "SCOTUS just overturned Chevron doctrine, imperiling all labor rights": {
        "title": "SCOTUS just overturned Chevron doctrine, imperiling all labor rights",
        "score": 3542,
        "url": "https://x.com/MorePerfectUS/status/1806701275226276319",
        "content": "",
        "num_comments": 315,
        "comments": [
            "Imperiling literally everything overseen by an administrative agency",
            "Mitch McConnell's gift to Trump is still giving rewards to the Republican and their true base, America's corporations. 6 to 3 and one dissenting Justice doesn't matter. But if it was 5 to 4, a dissenting Justice could change the decision.",
            "Biden may be old and bad at public speaking but Trump is the one who appointed these justices. \n\nAnd if he has 4 more years I have a strong feeling hell get to appoint at least one more.",
            "Let me out of this backwards-ass country.",
            "We need a Nationwide protest",
            "Corporations have been undefeated in this century. And not even close. Blowout victories across the board.\n\n**The USA isn't in charge anymore, boys and girls. Wall Street is.**",
            "And there it is. This is what the debate was a distraction from.\n\nEvery single move like this just further invalidates our current system. Each de-regulatory step toward overt plutocracy is a notable decrease in my inclination to give a fuck about the laws of the land.",
            "Are these the \"Activist Judges\" we have been hearing the R wingers constantly wailing about?",
            "And pay attention to the division of the court here. This is why y'all need to vote Blue. Its not the Dem appointments who went insane on the ruling.",
            "This makes it impossible to regulate any industry. Congress does not have the knowledge or foresight necessary to pass bills that have specific requirements. And thats if you can even get them to agree to the small details."
        ]
    },
    "Wait, what? And this is a lawyer who pays for billboards of his face all over the city ": {
        "title": "Wait, what? And this is a lawyer who pays for billboards of his face all over the city ",
        "score": 813,
        "url": "https://i.redd.it/rzco7icige9d1.jpeg",
        "content": "",
        "num_comments": 73,
        "comments": [
            "I'm just guessing he knows he's not going to find someone with that much experience, so when someone with 3-5 years' experience shows up, he can argue that $11 is a reasonable compromise.",
            "So... They want a 40-something that doesn't understand inflation?",
            "Prolly someone who actually thinks working for him is a privilege or something.",
            "I know a couple of executive admins with that level of experience. They both make more than double that. You can make a ton of money as an executive admin.",
            "Lawyers are cheap bastards. I applied for an IT gig for a law office, and they offered minimum wage. They tried saying they don't really need someone experienced, just has decent customer service skills. I genuinely hope they have a data breach and crumble as a firm.",
            "20 years of EA experience is a $80-$90k job",
            "Lol I get paid the same for checkings bags and IDs at the door. Ridiculously insulting and infuriating.",
            "Lawyers are notoriously cheap. I should I work for one. It's a constant battle just for basic needed equipment.",
            "Job posting he is intending not to fill, obviously. Its bullshit yeah, but y'all really need to understand he could care less if it gets filled and is likely just doing it for business benefits.",
            "To me this actually seems more like he has someone specific he wants. Theyre likely an existing employee or former employee, but an immigrant on a visa, and he legally needs to make a public post to show that the job is not being taken away from US citizens."
        ]
    },
    "Most Americans have no idea how anti-worker the US supreme court has become.": {
        "title": "Most Americans have no idea how anti-worker the US supreme court has become.",
        "score": 2909,
        "url": "https://www.theguardian.com/commentisfree/article/2024/jun/28/supreme-court-anti-worker-decisions-cases",
        "content": "",
        "num_comments": 60,
        "comments": [
            "Most Supreme Court justices have no idea how anti-Supreme Court Justice the workers have become either.",
            "Or we know, but cant do anything about it beyond voting.",
            "Its more like its incredibly hard to do anything about it. You need both the house and the senate to work to remove them which is basically just going to come down to pure luck because the right people need to get voted into those positions and theyre voted on at the state level. Then you need to get a president who wouldnt replace them with equally terrible options. I choose not to spend too much energy on it because theres realistically nothing I can do about it.",
            "The fuck is everyone doing plugging their ears and closing their eyes?? It's a conservative court we should expect they'll be fucking wrecking every right and protection we have until the day enough of them eat dirt that we can fix it. And by then who the fuck knows if the country will even be left standing.",
            "I feel like some high level politician or SCJ will be assassinated in the next year. It just takes one person to snap.",
            "They know.\n\nThey choose not to care b/c it \"doesn't affect them.\"",
            "This is how revolutions start people. We will complain and do nothing. They'll take more and more and we will do nothing. As our neighbors lose their homes and kids go hungry we will still do nothing because it's not us. When it finally happens to us, no one will care because it's not them. Eventually enough of us will have nothing to lose cuz they already took everything from us. \n\nLet's not wait that long.",
            "They used the debate as a distraction to really hit us hard with some really atrocious decisions this week.",
            "Im not American, but based on their recent decisions it became anti-American.",
            "No they just hear that their side won in getting more people in them the bad guys, that's all they wanted to know"
        ]
    }
}