{
    "I (m 30s) have a coworker (f 20s-30s) who refers to me by \"honey\", \"sweetie\", and \"babe\". It makes me uncomfortable.": {
        "title": "I (m 30s) have a coworker (f 20s-30s) who refers to me by \"honey\", \"sweetie\", and \"babe\". It makes me uncomfortable.",
        "score": 3,
        "url": "https://www.reddit.com/r/WorkAdvice/comments/1dr5y0w/i_m_30s_have_a_coworker_f_20s30s_who_refers_to_me/",
        "content": "Long story short, I started a new job and have a co worker who refers to me as stated above.\n\nShe refers to every other employee and customer as such, besides management. \n\nFor some reason, it really just rubs me the wrong way. I would much rather be called by my name or even a nickname. \n\nWhat would be the best way to ask her if she wouldn't mind calling me by my name instead?\n\nI just started this job, and everyone is supposed to be a team and be positive so I don't really want to be seen as annoying or causing problems. So part of me just thinks to leave it alone. But still part of me cringes every time I hear her say it. \n\nAny thoughts?",
        "num_comments": 4,
        "comments": [
            "It’s ok to say you just don’t like pet names. Totally valid. If she causes a problem, that’s what HR is for. \n\nI call ppl things like “beebee” or “dahling” because I’m getting close to middle age and I’m weird, but if someone asked me to stop I would. \n\nIf need be, maybe run your concern by your immediate supervisor, and that you plan to speak to her before escalating- that you’re telling them in case something goes sideways. Cause “cover your butt” is always smart.",
            "By asking her to only call you by your name and if she keeps doing it that you're gonna report her for verbal sexual harassment",
            "Start by asking her to call you by name.  If she continues, say the endearments bother you and ask again to be called by name.  If she then continues, ask a manager if the lack of professionalism (or nonbusinesslike) speech is a problem for anyone else as it bothers you.  \n\nSome people will defend her and say it's friendly.  If you're working at a place like that, you're fighting a losing battle. If you're not, you might get somewhere.",
            "Yeah. Get over it."
        ]
    },
    "Did I mess up my new job by compromising my availability, or is this a misunderstanding?": {
        "title": "Did I mess up my new job by compromising my availability, or is this a misunderstanding?",
        "score": 10,
        "url": "https://www.reddit.com/r/WorkAdvice/comments/1dqvcnh/did_i_mess_up_my_new_job_by_compromising_my/",
        "content": "I'm 21F, and just got hired for a student job that I really wanted at the hospital (I'm in a healthcare degree right now). I currently work another job that is only 1 shift a week (fridays). I interviewed, and was accepted at this new job which was listed as \"casual relief\" in terms of hours on the listing. At the interview, I asked them what this meant; they said it was basically that I'm not guaranteed hours and that it isn't salaried, but that I could get full time hours for the summer if I wanted to, and that they are flexible. I did not tell her about my availability at the interview, I figured that if I got the job I could then figure it out with them. My official contract that I signed is listed as \"part time\". Because of this, I assumed I could keep my other job that is one day a week. \n\nI was officially cleared to work this past Wednesday with a start date for next week, and was told that my manager will contact me regarding hours and schedule. I did not hear from her yesterday, so I drafted an email to tell her about my availability, which is that I have a doctors appointment in 2 weeks, that I will be away for one week at the end of July/beginning of August, and that I am not available Fridays. Before I sent it, I then received an email from her this morning which gave me a full time schedule, M-F 8 hours a day, for every remaining day of the summer. It was not \"here's a proposed schedule\", it was \"I have your schedule done, here it is and here is what you are doing every day\". \n\n  \nI replied back by saying basically \"thanks for sending me this, can I make some adjustments? I'm not free fridays, I have a doctors appointment this day, I am away this week and these are the only days I will need off for the summer\" (obviously much more professinional in my email)\n\nI've only had the one job in my very short adult life so far; is this normal for schedules to be made like this? Should I have told them right away in the interview that I needed certain days off, and that I would not be free these certain days? Does it sound like I misunderstood something about my hours? \n\nI wanted this job really badly, and it's really hard to get (not very many hospitals near me, much less that are hiring). Did I somehow mess up already and do I look like a bad, or unreliable employee from an employers end? Or am I overthinking? Any advice on what to do moving forwards is appreciated. thanks guys. \n\n\n\n",
        "num_comments": 10,
        "comments": [
            "Just have a conversation with them. “I was told this was part time, flexible hours, more if I wanted them, etc.” People are generally pretty understanding.",
            "Plus who ever hired you doesn't do scheduling..",
            "It's not the end of the world i think you stand a good chancw of sorting this but the not being available on Fridays in a role where you're expected to be flexible is something you should be bringing up with them earlier than you have this time.\n\nIt might stop you getting the job but equally if it's such an issue then you aren't going to get past probation anyway.",
            "Get that first experience and knowledge. Then decide where you want to go and how to get there.",
            "1. Availability should be discussed once it’s confirmed you are hired\n2. If you want the job really bad for whatever reasons (e.g. it’s necessary to have something like this on your resume to go on the career path you want), you will need to compromise and that may include quitting your Friday job if needed.\n\nI will tell you a story. I know someone after graduation from college, wanted to get into this management trainee role. It’s one of the best in the industry at the time and is being seen as a “dream job” for a fresh grad. This person I know did two rounds of interviews locally. He made through them (many people applied couldn’t even get through these). The final round of interview is in the US and it takes two days, and the interviewer said they do these interviews year-round. My friend told them he wouldn’t be able to go to the interview closest to the date because he has obligations at this part-time job he was working at the time, and asked if he could join the next round of interview in US. The employer smiled and told him, sure we will contact you when the next round is open.\n\nWell guess what, no one ever contacted him for “next round”.\n\n\nI don’t see your problem in communicating the availability. As I said above it’s probably best to communicate that right away after your job is confirmed. Your timing is off a bit but not a huge deal. However I feel like you didn’t get your priority straight. If you really want this job “so bad”, why you linger so much on the Friday job?\nAs for the other unavailability I also don’t know how flexible you are. Personally if I want a job “real bad” I definitely will communicate my availability, but include a caveat like “Please let me know if this works. If it doesn’t please let me know and I can probably work something out”.\n\nI will also just point out, to my knowledge, most hospitals jobs are hired internally, meaning they never even made it for public to see. By getting your foot in the door, you suddenly are now able to apply for many jobs that you would never even see at the outsider. Again, you need to get your priority straight.",
            "Once you accepted the job you should have stated that you do have some things coming up you have previously scheduled and asked the best way to communicate them to the person making the schedule. \n\nAs others have stated, if you really want this job why would you keep the other?\n\nedit to add, once you had gotten the info above on how to communicate your previously scheduled stuff, you would want to send that to the person asap and add but am willing to try and reschedule if needed.",
            "When you communicated your availability, what did they reply? The one day off and week off I would think would be ok, but I would definitely re-think how important this other Friday job is to you. Do you really want to miss out on 4 days of work to keep it?",
            "I would have mentioned the availability in the interview yes.",
            "Sounds like they advertised it as PRN but then hired you into part-time role and are giving you full time hours which is all kinds of screwy on SO many levels.\n\nYou said your contract states part-time; does it define what part time means?  We have 2 categories for part-time at my hospital: less than 16 hours each week and 16-34 hours per week.  Full-time is 35 hours and above.  With set shifts and regular expectation that these hours remain static *(not talking about rotating shifts - those are considered static in that X number of shifts each week for Y number of hours)* whereas PRNs can work 2-3 shifts a month or, as with students in summer, sign up for any/all available hours.  PRNs are also not benefits eligible.\n\nMost of our student employees typically work PRN because you only sign up for shifts when you have availability and this makes scheduling around classes and new term schedules so much easier.  \n\nI don't think you inherently messed anything up although in the future be frank if you have specific day(s) you cannot work.   I'd revisit your contract or offer letter and really read through what it says.",
            "So typically if you need time off, like the docs appt and vacation, you want to tell them in advance so it can be factored into your hiring process"
        ]
    },
    "Spat out my drink accidentally at a dinner with my manager at her home. ": {
        "title": "Spat out my drink accidentally at a dinner with my manager at her home. ",
        "score": 6,
        "url": "https://www.reddit.com/r/WorkAdvice/comments/1dqw9bb/spat_out_my_drink_accidentally_at_a_dinner_with/",
        "content": "It was the first time my manager invited me over to her house with a few co-workers for a chill wine and cheese night. We had been drinking for almost 4 hours, and someone said something that I found super funny and ended up spitting a bit of my drink on the table. No harm was done to any material items, and everyone played it off like it was nothing (including my manager). \n\nI’m wondering if I should apologize or anything because initially I felt like it was nothing, but now I’m freaking out about how potentially embarrassing/rude I might’ve been. ",
        "num_comments": 3,
        "comments": [
            "IMO it's not worth mentioning. Things like this can happen, nothing was harmed and it was just a bit of your drink. But if you are not sure, just bring it up in a funny way next time you see them and you will see from their reaction how they feel about what happened. If you get the impression that they are uptight about it you can say you're sorry. But don't make a big deal out of it.",
            "I think if people were enjoying their time with you in a group, if something like that happens it really is nothing. It was not deliberate or malicious. If anything if you make a big deal out of it with continued apologies it makes it awkward for your manager.\n\nIf you have to say something, make a joke like, \"look I can handle my wine, I can handle jokes but clearly I can't handle so-and-so 's comments\" or to make light of the situation. It was a circumstance where people were laughing, so use humour to defuse your embarrassment.",
            "It’s over. Just pretend it didn’t even happen. Most people probably forgot already."
        ]
    },
    "Division Being Bought Out": {
        "title": "Division Being Bought Out",
        "score": 2,
        "url": "https://www.reddit.com/r/WorkAdvice/comments/1dr2td6/division_being_bought_out/",
        "content": "My division of the company is apparently being bought by a different company; I don't want to go to the new company and want to stay at my current company but I've only been in my current position for 8 months. However there is an HR rule that says you can't apply internally without having been there for a year... how can I handle this/how would I convey this to the hiring managers or recruiters for internal positions?",
        "num_comments": 2,
        "comments": [
            "Ask this exact question to your HR folks. There's generally exceptions to most policies and this seems like one of those times.",
            "I would think in this situation, there may be some flexibility. I would ask HR whether there is an option to pursue an alternative role within your existing company as you won't be an internal candidate in the true sense of the word given you are being moved to a different company."
        ]
    },
    "Takeover": {
        "title": "Takeover",
        "score": 1,
        "url": "https://www.reddit.com/r/WorkAdvice/comments/1dr4f60/takeover/",
        "content": "I am responsible, among many other things, for creating weekly schedules for the homes I am in charge of (caregiving), in cooperation with a comanager.\n\nRecently we have had a significantly high turnover rate and the people we are hiring don't have availability that is helpful, and we also recently placed someone who changed their availability to an on-call position. We also are not allowed to approve overtime. My comanager have worked together moving people between my  homes and theirs to find coverage. The big boss decided they were going to do the schedules, and this really bothers me because while I don't actually have what I need to make efficient schedules, I feel like this is a passive way of saying I am not doing it right. They also have recently made disparaging comments to me regarding other staff and those comments passive aggressively included me.\n\nI am becoming increasingly frustrated, as management, dealing with upper management. Whatever is going on it always feels like a stalemate. My partner also works for the company and said to look at it as one less thing I have to do, but it's part of my job description and for now the autonomy has been taken away. It could be just for this week, but if it continues I am unsure how to move forward. I am unsure how to respond to employees when they ask about the schedule that I am typically responsible for. I have anxiety about it :/ ",
        "num_comments": 0,
        "comments": []
    }
}