{
    "PSA: The \"What, and \"Why\" of Context": {
        "title": "PSA: The \"What, and \"Why\" of Context",
        "score": 538,
        "url": "https://www.reddit.com/r/worldbuilding/comments/10ct71y/psa_the_what_and_why_of_context/",
        "content": "It's that time of year again!\n\nDespite the several automated and signposted notices and warnings on this issue, it is a constant source of headaches for the mod team. Particularly considering our massive growth this past year, we thought it was about time for another reminder about everyone's favorite part of posting on /r/worldbuilding..... *Context*\n\n\n-----\n\n*Context* is a requirement for almost all non-prompt posts on r/worldbuilding, so it's an important thing to understand... But what is it?\n\n**What is context?**\n\n*Context* is information that explains what your post is about, **and** how it fits into the rest of your/a worldbuilding project.\n\nIf your post is about a creature in your world, for example, that might mean telling us about the environment in which it lives, and how it overcomes its challenges. That might mean telling us about how it's been domesticated and what the creature is used for, along with how it fits into the society of the people who use it. That might mean telling us about other creatures or plants that it eats, and why that matters. All of these things give us some information about the creature **and** how it fits into your world. \n\nYour post may be about a creature, but it may be about a character, a location, an event, an object, or any number of other things. Regardless of what it's about, the basic requirement for context is the same:\n\n- Tell us about it\n- Tell us something that explains its place within your world.\n\nIn general, telling us the **Who**, **What**, **When**, **Why**, and **How** of the subject of your post is a good way to meet our requirements.\n\nThat said... Think about what you're posting and if you're actually doing these things. Telling us that Jerry killed Fred a century ago doesn't do these things, it gives us two proper nouns, a verb, and an arbitrary length of time. Telling us *who* Jerry and Fred actually are, *why* one killed the other, *how* it was done and *why* that matters (if it does), and the consequences of that action on the world almost certainly does meet these requirements.\n\nFor something like a resource, context is still a requirement and the basic idea remains the same; Tell us what we're looking at and how it's relevant to worldbuilding. \"I found this inspirational\", is not adequate context, but, \"This article talks about the history of several real-world religions, and I think that some events in their past are interesting examples of how fictional belief systems could develop, too.\" probably is.\n\nIf you're still unsure, feel free to send us a modmail about it. Send us a copy of what you'd like to post, and we can let you know if it's okay, or why it's not.\n\n\n**Why is Context Required?**\n\nContext is required for several reasons, both for your sake and ours.\n\n- Context provides some basic information to an audience, so they can understand what you're talking about and how it fits into your world. As a result, if your post interests them they can ask substantive questions instead of having to ask about basic concepts first.\n\n- If you have a question or would like input, context gives people enough information to understand your goals and vision for your world (or at least an element of it), and provide more useful feedback. \n\n- On our end, a major purpose is to establish that your post is on-topic. A picture that you've created might be very nice, but unless you can tell us what it is and how it fits into your world, it's just a picture. A character could be very important to your world, but if all you give us is their name and favourite foods then you're not giving us your worldbuilding, you're giving us your character.\n\nGenerally, we allow **15 minutes** for context to be added to a post on r/worldbuilding so you may want to write it up beforehand. In some cases-- Primarily for newer users-- We may offer reminders and additional time, but this is typically a one-time thing.\n\n-----\n\nAs always, if you've got any sort of questions or comments, feel free to leave them here!",
        "num_comments": 34,
        "comments": [
            "This question doesn't have anything to do with Context, though I do struggle with that, but what is the situation with ask-me-anythings? Are they not allowed?",
            "What about youtube videos or blog posts?  Every so often, someone posts a video and never make a context post.  Do you consider the video as providing the context (like the infograph that self contextualize itself example on the resource tab) or does someone posting a video/external link still need a context post?  Does being an external link have any consideration on context?",
            "I'm glad that the Mod team is making an effort to elaborate rule two in this way, i've been off this sub for quite awhile now specifically because of rule two's very subjective handling. (Ie mod john doe thinks this post is pretty self explanatory and may leave it be, but mod doe john doesn't, removes it and strikes your account). It's nice to have this cotified in such a way that it makes clear what is expected of me the poster.",
            "Okay, I can't articulate exactly how I previously thought the context rule worked, but this post clarified it for me perfectly. Much appreciated!",
            "Who wants some hydrogen and oxygen turned into  a liquid",
            "What about posts of people asking permission to include things in their world, or write things in a different way than normal? I feel like every other post that pops up on my feed from this community is someone asking \"Is it ok if I take inspiration from real life\" or \"can I write elves as a subterranean species\" or some other thing that isn't really a \"does this work\" question, just people asking for permission to create their own world.",
            "I think context is definitely required for the kind of content posted here, like it's nice to see nice art of some fantasy map or a spec-evo animal but having that little bit of explanation as to what it is you're looking at helps people conceptualize it more and allows them to better ask questions about it. Like that's a real issue when I see people post AMA's about their worlds on non worldbuilding focused subs I go on, they'll just say \"AMA about my fantasy world\" with zero explanation so we kind of have to parse out the context with our questions with is tedious and annoying.",
            "I can see the importance of context, but now I'm imagining someone new to worldbuilding just getting started and showing his starting point, but now needs to provide context by explaining how it fits into his greater world that doesn't exist to fit things in yet. So I feel like someone would have to already have a somewhat built world before getting started here(unless it's a prompt).",
            "My post was taken down, but I felt as though It did meet all the requirements. How can I appeal?",
            " Otherwise, know that context does help facilitate better conversations on this subreddit, so please make sure to include it when you make non-prompt posts. Thanks again! :)\n\nContext is a really critical part of worldbuilding and can make all the difference in the level of feedback you get from the community. Making sure to provide enough of the Who, What, When, Why, and How of a post is essential if you're looking for meaningful conversations to arise from it. Plus, context can help make sure that your post is actually related to worldbuilding and on-topic for this subreddit. If you ever have any questions, don't hesitate to send us a modmail!"
        ]
    },
    "Retconning sorcerers to not be about \"Specials and poo people\"": {
        "title": "Retconning sorcerers to not be about \"Specials and poo people\"",
        "score": 2306,
        "url": "https://i.redd.it/yap7fatb2d9d1.jpeg",
        "content": "As detailed [here](https://www.reddit.com/r/worldbuilding/s/BbLTYMvI0s) there is quite a distain for the characters who inherit magical abilities. As someone who despises nepotism and eugenics alike. I was thinking of having an alternative in my world/campaigns\n\nEvery living creature (except for some irrelevant ones to this conversation). Has patent magical ability and in the distant past this was so easily tapped into, a world of high magic where these abilities were occuring at birth or took very little effort to unlock.\n\nHowever either due to some generic catastrophe or a derivative analogue for climate change. The ability to do this is almost gone and extremely hard to master.\n\nAnd so\n\nOne who wishes to use magic in the modern day must either study, the same way as the wizard or undertake a more emotionally tolling experience. Not quite sure what it is but I'd prefer it to be something that involves either work or tragedy.\n\nPerhaps it just takes mental attunement as akin to study. Like you're almost literally exercising the brain.\n\nArt credit to \"Carbon Claws\"",
        "num_comments": 423,
        "comments": [
            "You can obviously do what you want with your own world. But for me, just because nepotism sucks in many ways doesnt mean Im going to cut it out of my world. Just like Im not cutting out other things that suck. Also, eugenics isnt necessary for people to inherit certain traits.",
            "This topic will most likely become a blight on this sub.",
            "Or just don't have sorcery in your world at all. World building isn't a Player's Handbook checklist. If you don't like something, remove it.",
            "I think u missed the point of that",
            "So make the specialness not tied to bloodlines? Make it random and make it manifest late in life so that they will be raised as normal people.\n\nIf you want it to be random that is. Nepotism is a thing that exists in the world we live in right now. Being born rich gives you special powers and privileges in ways that normal people can't even fully comprehend. Exploring that dynamic with sorcerers rather than regular old capitalism is fair game.",
            "'Specials and poo people'? Can someone explain like i'm ...well, not 5, maybe like i'm an adult?",
            "Wow, people really took that post hard, huh?",
            "Its your world. Your fictional world. Do whatever you want with it. Nobody can tell you what to do.",
            "That stupid comic has done untold psychic damage to this sub",
            "It is so preposterous to have such a distain for a fantasy trope that you make it a moral problem in hopes of making it somehow objectively wrong to have it exist in a project or fictional work. Its downright fucking harmful. If it annoys you then dont use it, good on ya, but dont start the insufferable crusading against people that like magical ability to be rare and impactful. A creator having a setting require that requires magic ability to be passed down or inherited does not equal advocation for some sort of prejudice or racism or fascism or nepotism or what the fuck ever. This is so goddamn absurd holy shit"
        ]
    },
    "You have the chance to make 1 thing from your world canon IRL, what is it?": {
        "title": "You have the chance to make 1 thing from your world canon IRL, what is it?",
        "score": 241,
        "url": "https://i.redd.it/zr90lk3xaf9d1.jpeg",
        "content": "",
        "num_comments": 172,
        "comments": [
            "Dragon. who wouldn't love dragon",
            "No climate change cause I never bothered to write the effects of climate change and industrialism on the main planet and instead got distracted on planets for evil cults?",
            "Lykocephali. That would basically be an instant werewolf button.",
            "My dyson sphere bound civilization. Because humanity is gonna go nuts once they found this thing.",
            "Shiftweaving, 100% without a doubt. Everyone world-wide having access to at least potion-level body alteration magic as a *baseline* would be Pretty Fucking Radical IMO. Gonna get myself on some herbal HRT, then see if I can either partial-shift an elementally or beastially aligned form, or create some full-shifted forms from acquiring animals Animorph style.",
            "Nothing, my world is not in the best place exactly, so I don't want to suffer.",
            "You *DONT* want anything from my worlds to be cannon mate. Not when i write dystopia and post-apocalyptic shit.",
            "Everyone has magic, and the ability to extract mana into rozyn stones, which give of an incense like smell when you use it",
            "Somewhat stable governments who care about the prosperity and security of their people",
            "Humanity getting its shit together and becoming a spacefaring species"
        ]
    },
    "What is the most disgusting thing/event in your world?": {
        "title": "What is the most disgusting thing/event in your world?",
        "score": 41,
        "url": "https://www.reddit.com/r/worldbuilding/comments/1dr7utx/what_is_the_most_disgusting_thingevent_in_your/",
        "content": "Whether it's locking people in empty rooms or sacrificing infants, what's the most revolting concept in your world?",
        "num_comments": 37,
        "comments": [
            "Its not a world of visceral horror or utter crimes against dignity or anything, but the worst thing is probably that one of the major species was broken down through intentional selective eugenic methods into being basically 'domesticated', smaller and weaker and meeker over endless generations like little dogs\n\nThe ones around currently are desperate to kind of recover what they once were, but undoing a million years of reduction is very hard and even if they can do it, it wont be for many generations",
            "The needs of the many being ignored for the wants of the powerful",
            "A sophisticated but dying alien race (due to a genetic mutation leading to growing infertility which led to civil war, and eventually they died out barring these three and a small colony) uplifted a bunch of others and used brain chipping as a guise to bring them \"to the future\" said brain chips took over their bodies and they forced them to genocide about half of humanity, destroying entire worlds cause the dying race despised humanity for their ability to colonize the stars faster than they did, and successfully. (The genetic mutation in humans was benign in most cases and only led to a minor decrease in fertility for men and women affected in some cases) They hated how such an inferior race could do what they couldn't and were flourishing while they were disappearing so they tried to make us disappear first through manipulation and mind control.",
            "The massacre of the Sahnar River and the Siege of Nysar. During the War of the Four Emperors, General Gorash of the Imperial Royal Army led a campaign against the rebels in the region of Nysar. He started the attack by sailing warships up the Sahnar river and massacring the villages and outposts along its banks. Hundreds of thousands were slaughtered, most of them civilians. The smoke was visible for miles, the river ran red with blood for weeks, and those few who survived were captured and used in the seige of the city of Nysar. They were stuffed and locked in oil soaked baskets that had been also been filled with flammable material like leaves, oil soaked cloth, and jars of pitch, they were then set on fire and launched with catapults over the cities walls, all while still alive.      \nThe worst part is it didnt even work. The city held out for three more years afterwards.",
            "There is a disease known as the Curse, it tends to pop out here and there in viral outbreaks before eventually subduing. Unfortunatley those that do catch have no hope for crew, and in time they will gain a gaunt, death-like apperance as their bodies self-mummifies.\n\nWhile managable with right medication and care for centuries the default response to the Curse and those that it affects was to lock them away far from civilization, in a island colonies or distant mountainous retreats, ostensibly under the pretext of quarantine, but effectivelly meant to starve the cursed. As a result those distant asylums have gained reputation for being dens of squalor and horror, lacking the means to be self-suficient or resources to improve their conditions, often leading symptoms of the illness getting more overt.",
            "Lemuria and her genocides. No, not singular, plural.",
            "When Athena assaulted the great King DeJng Valmheer and left no explanation. This was the domino that lead to the Havian Project (the name of the book...I know) that consisted of the trafficking, ego death, corruption and agony of millions of adolescents. The project was supposed to create new demigods with the flesh of long dead deities. DeJng led a Usurpation of the gods and Titans. He died killing time. Which is why they had to install a stabilisation barrier and why so many weird temporal anomalies occur.",
            "Reincarnation. Not inherently bad by itself but more the following implications of life having less value as reincarnation is an established fact, so capital punishment is more common. However this also extends to 'victims' of crime, as trauma can reincarnate with you. Those that suffer horrific violence or violation are also executed to preserve their souls instead of allowing the trauma to fester and corrupt their souls further.",
            "Shitmancer that can cast Power Word: Mass Constipation and Power Word: Diarrhea",
            "Capturing people and forcing them into are a battles for entertainment"
        ]
    },
    "Ptsunomi, The Whisper in the Storm": {
        "title": "Ptsunomi, The Whisper in the Storm",
        "score": 31,
        "url": "https://i.redd.it/6dzmfgqyoh9d1.jpeg",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Ptsunomi; The Whisper in the Storm is the goddess of fortune, subtle action and humility. Once worshiped for her ability to alter ones fortune through small cumulative action, characterized more by thoughtfulness than grandeur or swiftness, Ptsunomi has been cursed to have her world altering influence reduced to such levels of subtlety that even the most observant would be hard pressed to separate her actions from random chance. Ptsunomi is unique amongst the pantheon for her proximity to her worshippers, using her influence over reality to ward off accidents or creating opportunities for them to seize. To this end, she is almost comprehensible by the mortal mind and is depicted in a human form and scale.\n\n\n\nThe tribes collectively known as the Forsaken were once known by a myriad of other titles that have long since been forgotten but it is believed that they were prosperous traders and remarkably far sighted. Making their homes along the shores and waterways, they generation by generation built the infrastructure, supply lines and connections needed to fashion businesses that could stand the test of time.  \n  \nThe modern Forsaken have fallen far. Seeing the obvious boons granted to other peoples by their patron deities yet seeing no evidence of their own, they have come to believe themselves abandoned by Ptsunomi and hence adopted the moniker of Forsaken. Their society has become insular, viewing outsiders as threats, competition or targets of opportunity and likewise others have come to view them as robbers and thieves. Regardless of how they view outsiders, Forsaken communities are close knit and interdependent, believing that if their goddess will not care for them, they must do so themselves.\n\n\n\nThe perceived abandonment of Ptsunomi has also led to a contentious relationship between deity and followers. While the avatars of Ptsunomi are still located at the entrances or centers of villages, instead of objects of reverence they now serve for Forsaken returning with goods to profess their independence from Ptsunomi and their personal skill, often in conjunction with ridicule or pseudo ritual defacing of the avatar. Despite their perceived lack of boons, the Forsaken have yet to attempt to commune with a different god due to a number of factors, the primary ones being their poor relationships with other cultures and the fierce pride they take in their independence\n\nPtsunomi and the Forsaken are inhabitants of the World of Enshrined\n\n**Read more about the Forsaken here:**  \n[https://www.reddit.com/r/Enshrined/comments/1avqqqq/the\\_complex\\_realities\\_of\\_forsaken\\_life\\_force\\_them/](https://www.reddit.com/r/Enshrined/comments/1avqqqq/the_complex_realities_of_forsaken_life_force_them/)\n\n**What is Enshrined?**  \n  \n[](https://www.reddit.com/r/Enshrined/)is a multiplayer isometric action-RPG game that fuses roguelike elements with a meta-progression system, drawing inspiration from titles such as Diablo 2 and Bastion.  \n  \nWhats the lore behind Enshrined?  \n  \nThe world of Enshrined takes place upon the islands to which your vessel always seems to be drawn. The reality of this world is ordained by the ever shifting interactions and relationships between the fundamental shaping forces of the world (such as evolution, freedom, structure, hunger and many more) and the mortals that have come to worship them as gods. The world of Enshrined is a harsh one where opposing ideologies are forced to share the land, curses outnumber blessings and divine corruption permeates all."
        ]
    }
}