{
    "Community follow up to \"What are the best ships to buy for resources.\"": {
        "title": "Community follow up to \"What are the best ships to buy for resources.\"",
        "score": 175,
        "url": "https://www.reddit.com/r/WorldOfWarships/comments/1d83c05/community_follow_up_to_what_are_the_best_ships_to/",
        "content": "Ok, this is the community follow up to this post where I asked skilled players what the best and favorite ships for each resource were. I will post the charts next to each other for your comparison. The community responses are in Blue.\n\n&#x200B;\n\n**Strongest Steel ships for competitive play.**\n\nhttps://preview.redd.it/it9o3hvn4l4d1.png?width=606&format=png&auto=webp&s=421ac71e7bac769d130a0f23de5b712333918815\n\nhttps://preview.redd.it/3oxopnbd4l4d1.png?width=606&format=png&auto=webp&s=433aebc01657277fcf069a3ac031c6e711bac910\n\nNot a whole big difference, Skilled players seem to like Incomparable better which is definitely a glass cannon of sorts and the community as a whole liked Mecklenberg better than skilled players liked it, lots of guns seems to be key there.\n\n&#x200B;\n\n**What are the most fun steel ships to play?**\n\nhttps://preview.redd.it/3uqv54lc5l4d1.png?width=606&format=png&auto=webp&s=59f7d7881898125b66588dc1142202e2685f49a7\n\nhttps://preview.redd.it/5xvj7fab5l4d1.png?width=605&format=png&auto=webp&s=5c329342d32603448e0f821b3fb088056140fbbe\n\nNot a lot of appreciable differences. Again the community as a whole seems to Like 16 guns on the Meklenberg better than skilled players. Stalingrad falls a few places on the community list. That one is baffling as most everyone talks about how OP it is and how good the guns are on it. I'm guessing that perhaps it may be a difficult ship to not get burned down in.\n\n&#x200B;\n\n**What is your favorite steel ship?**\n\nhttps://preview.redd.it/havp5etq6l4d1.png?width=606&format=png&auto=webp&s=8903425935d0a0642795b7eda50db06036ab8087\n\nhttps://preview.redd.it/g5fffdlv6l4d1.png?width=604&format=png&auto=webp&s=5b6f43cdaded3669d6ecd68968be3f249c9a97c7\n\nCommunity likes the dakka dakka of Austin but not of Ragnar. Also this list has me hopeful for the community as only 2 people listed Shikishima as their favorite so there might not be as many weebs in this community as I thought.\n\n&#x200B;\n\n**What are the best coal ships for competitive play?**\n\nhttps://preview.redd.it/qapyqd308l4d1.png?width=598&format=png&auto=webp&s=f2e29eb6e7aae4526e21a2d87157728b06ac18b1\n\n&#x200B;\n\nhttps://preview.redd.it/eyq4j6i18l4d1.png?width=609&format=png&auto=webp&s=c7a9a43ef039cee9910c7ea818cd6545fe3fd733\n\nThe top end is nearly identical. Community did not like Neustra as much though.\n\n&#x200B;\n\n**What are the most fun coal ships?**\n\n&#x200B;\n\n[Ignore description](https://preview.redd.it/srd9f2ok8l4d1.png?width=607&format=png&auto=webp&s=517c403a165122e1308d114d53da8b35cc24fa6a)\n\nhttps://preview.redd.it/eqfxmwnl8l4d1.png?width=605&format=png&auto=webp&s=40e8a97ae21fda2d62300af4e03ecc86aa7ed67f\n\nDefinitely a few changes, but not much at the top end. Salem more liked by Skilled players for sure, Groningen by the community as a whole.\n\n&#x200B;\n\n**What is your favorite T10 coal ship?**\n\n[Ignore the description](https://preview.redd.it/gf0ea90i9l4d1.png?width=602&format=png&auto=webp&s=430a942a87514a946d3e3513396ea32deaae404b)\n\nhttps://preview.redd.it/x1dq7ycj9l4d1.png?width=606&format=png&auto=webp&s=19c2a739e9b24085e4446477bd8440cde14af43d\n\nTop 3 are the same, various changes amongst the lower end.\n\n&#x200B;\n\n**What is your favorite T9 coal ship?**\n\n[Ignore the description on the bottom, forgot to edit it.](https://preview.redd.it/wj6k3201al4d1.png?width=606&format=png&auto=webp&s=5bdbf76de0cd9bf01ea748105f0f57120fb7c49a)\n\nhttps://preview.redd.it/ldt6tx32al4d1.png?width=607&format=png&auto=webp&s=387ddf8bb7663f19ab97ffb681c11e24917050ab\n\nAgain, skilled players put more stock in the Neustra than the community as a whole. And the community really likes their secondaries and airplanes.\n\n&#x200B;\n\n**What are the best RB ships for competitive play?**\n\nhttps://preview.redd.it/rn3a5zt2bl4d1.png?width=606&format=png&auto=webp&s=0c23a4ba914622f7afd6b5a8db852473ed961bc6\n\nhttps://preview.redd.it/zmmj9uw3bl4d1.png?width=604&format=png&auto=webp&s=309e75e4420591e96d4cfeb15fb12e3d037f4bec\n\nNot a whole lot of difference between the 2, Scilia falls a bit on the community list and that's about the only major differnce\n\n&#x200B;\n\n**What are the most fun RB ships?**\n\nhttps://preview.redd.it/v198r5fmbl4d1.png?width=598&format=png&auto=webp&s=b1e9713459dfec87b1fb025b5f11728948b357a9\n\nhttps://preview.redd.it/waaa9fkobl4d1.png?width=607&format=png&auto=webp&s=b546ba08596aefb5f1ba8cf60994601f7cb12bb5\n\nNearly identical, most ships within 2 places of each other.\n\n&#x200B;\n\n**Favorite RB Ship?**\n\nhttps://preview.redd.it/05tf91mzbl4d1.png?width=605&format=png&auto=webp&s=8991aafd1dbbbac90b2c7963d8941290a438380b\n\nhttps://preview.redd.it/zwp6drr0cl4d1.png?width=605&format=png&auto=webp&s=6d63a565bfee38cece472f1dbffeeb4530c10f37\n\nA little more emphasis from skilled players on their favorite ships.\n\n&#x200B;\n\nAnd now for the Q&A\n\n>!Q: Why does it say favorite steel ship on some of the graphs that aren't for favorite steel ship?!<\n\n>!A: Too lazy to edit my graph in sheets and honestly too lazy to notice.!<\n\n>!Q: You still have Mecklenberg misspelled. It has a 'u' in it.!<\n\n>!A: That's not a question but yes, I left that there just for you.!<\n\n>!Q: Why is the order of the graphs for steel ships reversed?!<\n\n>!A: To see if anyone would notice.!<\n\n>!Q: Surely after this poll you aren't still cynical about the player base are you?!<\n\n>!A: I counted no less than 20 posts made to this subreddit about what resource ship someone should buy in the 21 days after the previous post was made and stickied. And that was 2 quick searches, there are likely more posts that were not gleaned in those simple searches!<\n\n>!Q: So this didn't stop the deluge of vague posts from clueless players asking strangers on the internet what they should do with their hard earned currencies?!<\n\n>!A: Nope!<\n\n>!Q: Then why did you do this?!<\n\n>!A: Not sure, probably some hidden trauma from my childhood manifesting itself. Either that or I've gone insane playing against subs and CV's!<",
        "num_comments": 52,
        "comments": [
            "Top notch work! o7!\n\nEdit: So, I am about to buy a coal ship, Do you have any suggestions? (joke)",
            "I think its worth mentioning that you should get the ship you want/like. I picked the z42 over the Ragnar. Is Ragnar busted as hell? Yeah. But I dont like the play style. This is a video game. It should be FUN. Theres no point in getting a ship thats meta but you dont like the play style. Have fun.",
            "Its nice to see im not the only one liking Van Speijk  \nHello to that other dude!",
            "i think the reason stalingrad isnt popular is because its so linear. you find you isalnd waifu, you sit bow in and you score hit after hit with railgun accuracy.",
            "Van Speijk slander, deleting carrier planes with full AA build is funny as fuck\n\nAlso Vallejo slander, sure it's absolutely not worth steel but gunboat Wooster is pretty damned funny to farm with",
            "Hector is hard to love",
            "Laurie being that low is a surprise to me. Do people not like the chunky accurate SAP?",
            "Thanks for your work. I was gonna get Incomparable as my 4th steel ship because of my playstyle but maybe I'll pick up Bourgogne which was coming in a close second for me instead since as always it rates really high.",
            "I have all T10 ships in the game and Stalingrad is the go-to-ship, when I under no circumstances can afford to lose any stars in Ranked. It's the powerhouse of consistency which is key in the world of inconsistent teams. Good to see that the better players still agree.",
            "Poor Z-44 *really* needs some love (=buff!) shes such a terrible ship in her current state. Give her hydro and slightly better turret traverse speed or some other gimmick and shed be fine."
        ]
    },
    "Changes to Test Ships - Closed test 13.5": {
        "title": "Changes to Test Ships - Closed test 13.5",
        "score": 30,
        "url": "https://www.reddit.com/r/WorldOfWarships/comments/1dozi8g/changes_to_test_ships_closed_test_135/",
        "content": "Based on the testing results, we're applying changes to French destroyers and Jacksonville.\n\n**French destroyer L'Aventurier, Tier VIII**\n\n* Turning circle radius reduced: 680 to 620 m.\n* Surface detectability reduced: 7.9 to 7.4 km.\n   * All other detectability ranges were adjusted accordingly\n\n**French destroyer Orage, Tier IX**\n\n* Turning circle radius reduced: 680 to 620 m.\n* Surface detectability reduced: 8 to 7.4 km.\n   * All other detectability ranges were adjusted accordingly\n\n**French destroyer Cassard, Tier X**\n\n* Turning circle radius reduced: 670 to 610 m.\n* Surface detectability reduced: 8 to 7.5 km.\n   * All other detectability ranges were adjusted accordingly\n\n**American super cruiser Jacksonville**\n\n* Main battery firing range increased: 17.2 to 18.2 km.\n* Main battery shell ballistics have been changed. The firing arcs will now be flatter.\n* Parameters of Repair Party consumable have been changed:\n   * Number of charges increased: 3 to 4.\n   * Healing per second increased: 260 to 343.\n   * Amount of citadel damage restored increased: 33 to 50%.\n\n**You can also find this article on our website:** [**https://blog.worldofwarships.com/blog/542**](https://blog.worldofwarships.com/blog/542)  \n**Please note that all information in the development blog is preliminary. Announced adjustments and features may change multiple times during testing. The final information will be published on our game's website.**",
        "num_comments": 42,
        "comments": [
            "Jacksonville's heal buff makes it identical to the ones found on ships like Austin, if it's not crippled or dev struck with citadels it'll be quite the cockroach.\n\nThe buffs to range and ballistics are questionable at best though, the ship should have the floaty arcs of all other American light cruisers. Austin and Vallejo get better arcs but their damage output is much worse (sure Austin gets the highest DPM in the game on demand but that's tied to brief bursts with MBRB).",
            "Anxiously awaiting the release of the prins van oranje. Hoping no changes mentioned here means its close. Been saving up resources.",
            "Is Jacksonville in the need of such buffs? wasn't it buffed before?",
            "It's crazy to think that a CL gets 18.2 km base firing range while DM is still 15.8.",
            "Buffs this late into the dev cycle isn't a good look. The new French destroyers already seemed to be badly balanced, this massive concealment and manoeuvrability buff just confirms that. Cassard now literally has the smallest turning radius of any surface ship at tier X.",
            "Meh, they're still not what I wanted as French torpedo boats.",
            "If Jacksonville has flat shell arcs wont that make islands harder to use for cover?\n\nIs she an open water gunboat?",
            "That 9km Wooster radar gonna be real useful when you have 18km gun range...",
            "6km concealment and really good turning is interesting\n\nJacksonville is more a T10 Vallejo with funny button with those changes",
            "Good update on the conceal, I thought you guys were joking when introducing a torp boat line with gunboat-level conceal. Now it should be much more manageable to do both traditional torp drop and yolo torp on these ships."
        ]
    },
    "DovBleg New Ships - Closet Test 𝟏Ʒ.7": {
        "title": "DovBleg New Ships - Closet Test 𝟏Ʒ.7",
        "score": 20,
        "url": "https://www.reddit.com/r/WorldOfWarships/comments/1dr997v/dovbleg_new_ships_closet_test_𝟏ʒ7/",
        "content": ">!this is not a real devblog, I'm just primarily having fun with numbers and parodying the actual devblogs !<\n\nIn Update 𝟏Ʒ.7 two new ships will be added to the game for testing, German Cruisers Donar and Skade.\n\nLet’s imagine the O-Class cruisers, in our game represented by T9 Ägir and T9 Siegfried, had been a success so that further development of their designs could have taken place. We can assume that any improvements on their designs would have likely increased displacement to allow for more anti-surface and anti-air firepower and protection, while maintaining speed for the most part. We will explore two possible designs for what could be called a “Super-Ägir”. One of them will be focused on improving the secondary battery, while the other will expand the main battery.\n\nBoth ships will have a similar armour scheme to Ägir and Siegfried, but will receive more belt and deck armour, as well as a stretch of fore belt, similar to German T10 Cruiser Hindenburg.\n\n \n\n# T10 Donar\n\nhttps://preview.redd.it/bu8cjyeonh9d1.png?width=1678&format=png&auto=webp&s=0dc9e4a6122647028c04da44b85600490a742f13\n\nOne of our hypothetical improvements on the O-Class cruisers. This design focuses on improving the secondary and anti-aircraft battery by increasing the number of dual-purpose 128mm guns to fifteen dual mounts. \n\nShe also carries an increased torpedo armament should the fight get up close and personal.\n\nDonar is armed with 9 305mm main battery guns which deal good damage per salvo, but have a low rate of fire. The ship is also armed with sixteen torpedo tubes carrying fast, but short ranged, torpedoes.\n\nHer consumables are represented by Fast Damage Control Team, Repair Party, and Improved German Hydroacoustic Search. \n\n\\> ship's parameters\n\n* HP - 75000\n* Plating - 27mm\n* Torpedo Protection - 40%\n* Main Armament\n   * 3x3 30,5cm/56 SK C/39 \n      * Range - 18,5km\n      * Reload - 20,0s\n      * HE Shell - 30,5cm Spr.Gr. L/4,9, 3600 Damage, 27% Fire Chance\n      * AP Shell - 30,5cm P.Spr.Gr. L/3,8, 9100 Damage\n      * 180° Turn Time - 30,0s\n   * Dispersion (12km)\n      * Horizontal - 149m\n      * Vertical - 79m\n      * Sigma - 2,05\n* Secondary Armament\n   * 15x2 12,8cm/61 KM40\n      * Range - 8,3km\n      * Reload - 3,6s\n      * HE Shell - 12,8cm Spr.Gr. Kz., 1500 Damage, 5% Fire Chance\n      * Will use the same Dispersion as Napoli\n* Torpedoes\n   * 4x3 533mm\n      * 180° Turn Time - 6,0s\n      * Reload - 90s\n      * G7 Steinbutt\n      * Spread - 4,8-16,0°\n* AA Defense\n   * 50% Sector Reinforcement - 10,0s Action Time - 10,0s Preparation Time\n   * 15x2 12,8cm/61 KM40\n      * Range - 6,0km\n      * 10 Flak\n      * 208 DPS\n   * 10x 5,5cm/77 Gerät 58\n      * Range - 4,0km\n      * 364 DPS\n      * Hit Probability - 90%\n   * 12x4 2cm/65 C/38 Flakvierling\n      * Range - 2,5km\n      * 143 DPS\n      * Hit Probability - 85%\n* ASW Airstrike\n   * Reload - 30,0s\n   * Available Flights - 2\n   * Number of Aircraft in Attacking Flight\n   * Aircraft HP - 2000\n   * Maximum Range - 8,0km\n   * SC-300\n      * Bombs in Payload - 2\n      * Maximum Bomb Damage - 4900\n* Maneuverability\n   * Speed - 33,0kt\n   * Rudder Shift - 14,0s\n   * Turning Circle Radius - 900m\n* Concealment\n   * By Sea - 15,1km\n   * By Air - 10,9km\n   * By Depths - 0,0-10,9km\n   * Assured - 2,0km\n* Consumables\n   * Fast Damage Control Team\n      * Action Time - 10s\n      * Cooldown Time - 40s\n      * Number of Consumables - 5\n   * Hydroacoustic Search\n      * Action Time - 120s\n      * Cooldown Time -120s\n      * Number of Consumables - 3\n   * Repair Party\n      * Action Time - 28s\n      * Repair - 14,0%\n      * Number of Consumables - 4\n\nhttps://preview.redd.it/b8l8nxgofh9d1.png?width=634&format=png&auto=webp&s=b0f87a6963c54f8047717d5f30c2cf3e323191b2\n\nReasons for choosing the Name:  \nContinuing the naming of large cruiser after germanic mythology, like Ägir is named after the sea giant Ägir/Ægir, Donar receives her name from the god of thunder Donar, the continental germanic name for Thor. Thunder and storms have always been a part of naval history, have always been a threat, making this name a perfect fit for the terror she shall unleash on our virtual seas. \n\n&#x200B;\n\n# T10 Skade\n\nhttps://preview.redd.it/eg8pepapnh9d1.png?width=1678&format=png&auto=webp&s=d8910bb256d2deec10466448aab4b7b5601d702c\n\nThe second of our hypothetical improvements on the O-Class cruisers. This design focuses on improving the main battery by increasing the number of main battery turrets to 4. She still carries a torpedo armament identical to Ägir to deter enemy ships from getting too close.\n\nDonar is armed with 12 305mm main battery guns which deal good damage per salvo, but have a low rate of fire. She carriers eight torpedo tubes launching fast, but short ranged, torpedoes.\n\nHer consumables are represented by Repair Party and Improved German Hydroacoustic Search\n\n\\> ship's parameters\n\n* HP - 75000\n* Plating - 27mm\n* Torpedo Protection - 40%\n* Main Armament\n   * 4x3 30,5cm/56 SK C/39 \n      * Range - 20,5km\n      * Reload - 20,0s\n      * HE Shell - 30,5cm Spr.Gr. L/4,9, 3600 Damage, 27% Fire Chance\n      * AP Shell - 30,5cm P.Spr.Gr. L/3,8, 9100 Damage\n      * 180° Turn Time - 30,0s\n   * Dispersion (12km)\n      * Horizontal - 149m\n      * Vertical - 79m\n      * Sigma - 2,15\n* Secondary Armament\n   * 12x2 12,8cm/61 KM40\n      * Range - 8,3km\n      * Reload - 3,6s\n      * HE Shell - 12,8cm Spr.Gr. Kz., 1500 Damage, 5% Fire Chance\n      * Will use the same Dispersion as Ägir\n* Torpedoes\n   * 2x3 533mm\n      * 180° Turn Time - 6,0s\n      * Reload - 90s\n      * G7 Steinbutt\n      * Spread - 4,8-16,0°\n* AA Defense\n   * 50% Sector Reinforcement - 10,0s Action Time - 10,0s Preparation Time\n   * 12x2 12,8cm/61 KM40\n      * Range - 6,0km\n      * 8 Flak\n      * 156 DPS\n   * 10x 5,5cm/77 Gerät 58\n      * Range - 4,0km\n      * 364 DPS\n      * Hit Probability - 90%\n   * 12x4 2cm/65 C/38 Flakvierling\n      * Range - 2,5km\n      * 143 DPS\n      * Hit Probability - 85%\n* ASW Airstrike\n   * Reload - 30,0s\n   * Available Flights - 2\n   * Number of Aircraft in Attacking Flight\n   * Aircraft HP - 2000\n   * Maximum Range - 8,0km\n   * SC-300\n      * Bombs in Payload - 2\n      * Maximum Bomb Damage - 4900\n* Maneuverability\n   * Speed - 33,0kt\n   * Rudder Shift - 14,0s\n   * Turning Circle Radius - 900m\n* Concealment\n   * By Sea - 15,2km\n   * By Air - 10,9km\n   * By Depths - 0,0-10,9km\n   * Assured - 2,0km\n* Consumables\n   * Damage Control Party\n      * Action Time - 5s\n      * Cooldown Time - 60s\n      * Unlimited Charges\n   * Hydroacoustic Search\n      * Action Time - 120s\n      * Cooldown Time -120s\n      * Number of Consumables - 3\n   * Repair Party\n      * Action Time - 28s\n      * Repair - 14,0%\n      * Number of Consumables - 3\n\nhttps://preview.redd.it/p1b89ijigh9d1.png?width=634&format=png&auto=webp&s=381cbfd84d8694b1c9ba864a01a158baf16c9813\n\nReasons for choosing the Name:  \nContinuing the naming of large cruiser after germanic mythology, like Ägir is named after the sea giant Ägir/Ægir, Skade receives her name from the goddess of the hunt Skadi/Skade (Old Norse: Skaði). Despite German ships usually receiving male names it is not impossible that a ship could be named after a goddess, due to her status as a deity. And this name befitting of a hunter represents what she is to do on our virtual seas, hunt those beneath her and crush any opposition. \n\n&#x200B;\n\n**Please note that all information in the dovolepmont bleg is utter bullshit. Announced adjustments and features will not happen. The final information will be completely ignored.**\n\n&#x200B;\n\n(still more realistic than karl xiv johan)",
        "num_comments": 22,
        "comments": [
            "I will forever be hoping for the return of Agir secondaries that had the graf zeppelin dispersion pattern",
            "Ah yes, the KMS Dner. /j",
            "Donar seems hilarious, 1 more secondary turret than Hannover but WAY better dispersion. Same dpm as Napoli, but now all of your secondaries pen 32 and can set fires lol. That's 1.5 Schlieffens base, and probably around equal to one Schlieffen with full manual secondary stacked up, but now with no ramp up time.",
            "yeah lol the Karl is complete BS\n\nit's a fun ship though",
            "75k health is gonna be gone so quick during brawls.",
            "These prob end up nerfed hard.",
            "Honestly I really hope this is true I absolutely love large cruisers and these look amazing",
            "Its reading DovBleg, and Im already giggling.\n\nGood use of admiral dreadnoughts, btw",
            "lol Germans and their love for Doner Kebabs.",
            "Yeah that's a fever dream. Germany will never get a T10 large cruiser, I am sure at this point. Maaaaaaybe at some point there will be a German CL branch, but that is it. No additional T10 cruisers."
        ]
    },
    "WG getting a little wild with these YT shorts recently ": {
        "title": "WG getting a little wild with these YT shorts recently ",
        "score": 11,
        "url": "https://i.redd.it/8g4w9ztqpi9d1.png",
        "content": "",
        "num_comments": 2,
        "comments": [
            "USS *Horny*. HMS *Dildo*. French cruiser *Breast*. German battleships *Teetspics*.\n\nNo wonder the game has PEGI 12 rating now...",
            "They know their clientele."
        ]
    },
    "WG nerfed the BXP/credits for Omaha Beach Assault. ": {
        "title": "WG nerfed the BXP/credits for Omaha Beach Assault. ",
        "score": 96,
        "url": "https://www.reddit.com/r/WorldOfWarships/comments/1dqvthj/wg_nerfed_the_bxpcredits_for_omaha_beach_assault/",
        "content": "Don't bother using your rare boosters anymore since WG nerfed the BXP and credits for this op. I'm guessing something like a 50% cut to BXP. We all knew this was coming.....",
        "num_comments": 70,
        "comments": [
            "WG will always fix something that affects their monetization of the game instantly, and sit on anything else.",
            "Of course, we can't have the special gamemode that we spent months developing actually be worth playing, nope! Screw the players who put off playing it the first few days, their fault for having things like work or obligations!\n\nCan you imagine if they put their effort into actually fixing the game instead of preventing players from getting anything good?",
            "Ironically this fix only nerfed normal play, the exploit depends entirely on the busted repair mode of the german DDs. So people can still do it just now they are getting 7k not 12k exp.",
            "Abuse early, abuse often o7",
            "I miss my 1.8mil credit games",
            "Gee, if only there weren't 10 threads talking about how great it was. People just love shooting themselves in the foot all for the attention of spreading the info. Happens everytime...",
            "So it's \"fixed\" across regions or just NA atm ?",
            "no fun allowed, as per usual.",
            "Seems to be more than 50% imo, sadge",
            "I didn't even know about the farming exploit, I had an Atlanta! Damn those earnings were insane."
        ]
    }
}