{
    "/r/WorldNews Live Thread: Russian Invasion of Ukraine Day 850, Part 1 (Thread #996)": {
        "title": "/r/WorldNews Live Thread: Russian Invasion of Ukraine Day 850, Part 1 (Thread #996)",
        "score": 561,
        "url": "https://www.reddit.com/live/18hnzysb1elcs",
        "content": "",
        "num_comments": 46,
        "comments": [
            "Russia's air strike damages Ukrainian power facilities, injures two\n\n>KYIV, June 22 (Reuters) - Russia launched a new barrage of missiles and drones in an overnight attack on Ukraine on Saturday, damaging energy facilities in the southeast and west of the country and injuring at least two energy workers, Ukrainian officials said.\n\n>Ukraine's air defence shot down 12 of 16 missiles and all 13 drones launched by Russia in the second large strike this week, the air force said. The air alerts in Ukrainian regions lasted for several hours in the middle of the night.\n\n>National grid operator Ukrenergo said equipment at its facilities in Zaporizhzhia region in the southeast and Lviv region in the west were damaged by the strikes.\n\n>Two energy workers in the Zaporizhzhia region were wounded and taken to the hospital, it said.\n\n>Ivan Fedorov, Zaporizhzhia's governor, said the fire broke out at an energy infrastructure facility in the region and further damage assessment was underway as repair brigades and emergency workers dealt with the attack.\n\n>\"We can say for sure: the enemy will not stop. Ukraine needs air defence systems,\" Fedorov said on the Telegram messaging app.\n\n>Moscow has said its air strikes against the Ukrainian energy infrastructure were in retaliation for Ukrainian drone attacks on the Russian territory.\n\n>Lviv regional Governor Maksym Kozytskyi said 67 firefighters and 12 special vehicles were involved in putting out the fire in his region on Ukraine's Polish border. He said there were no casualties in the Lviv region.\n\n>Since March, Russian forces have intensified their bombardments of the Ukrainian power system, knocking out about half of the country's available generating capacity and causing a severe energy crunch.\n\n>Despite warm summer weather, Ukrainian cities face scheduled energy cutoffs and the country's electricity imports from its European neighbours are at record levels.\n\n[https://www.reuters.com/world/europe/ukraine-downs-12-missiles-all-drones-launched-by-russia-new-attack-2024-06-22/](https://www.reuters.com/world/europe/ukraine-downs-12-missiles-all-drones-launched-by-russia-new-attack-2024-06-22/)",
            "Preliminary info that a Pantsir-S1 air defense system was hit, Russian sources claim.\n\nhttps://x.com/noelreports/status/1804438657408868461?s=46\n\nIn relation to;\n\nIn Dubovoe, Bilhorod region, a strong fire is visible shortly after a missile threat was declared.\n\nhttps://x.com/noelreports/status/1804438272103334225?s=46",
            "\nUkraine war briefing: \n\n>European Union countries have formally approved the launch of accession negotiations with Ukraine and Moldova next week, another step in the two nations’ long journey to join the 27-nation bloc. Belgium, which currently holds the EU presidency, said member states had agreed on a negotiating framework. Volodymyr Zelenskiy called the start of the accession talks a “historic step”. “Millions of Ukrainians, and indeed generations of our people, are realising their European dream,” the Ukrainian president posted on X. \n\n>A Russian guided bomb killed two people and wounded three in a residential area of an eastern Ukrainian town, Donetsk regional prosecutors said. Five five-storey buildings and six homes were damaged by the bomb on Friday in Selydove, about 14km (nine miles) from the frontline, they said on Telegram. \n\n>The Ukrainian military said its drones struck four oil refineries, radar stations and other military objects in Russia in an attack in the early hours of Friday. “Unmanned aerial vehicles attacked the Afipsky, Ilsky, Krasnodar and Astrakhan oil refineries,” it said on Telegram. Russian emergency officials, writing on Telegram, confirmed three municipalities of Krasnodar came under “massive attack”. The Russian journalist-run Astra social media channel reported that Yeysk, home to a military airfield, was hit by drones that sparked fires. Nasa satellite fire monitoring indicated fires or hotspots at the airbase. The Krasnodar region sits across the Kerch strait from Crimea. \n\n>Ukrainian drone attacks put two electricity substations out of action in Enerhodar, the town serving the Zaporizhzhia nuclear power plant, and cut power to most of its residents, Russian-installed officials said on Friday. An official at the Russian-occupied plant said it was unaffected. \n\n>Ukraine said it was dispatching reinforcements to Chasiv Yar, an embattled strategic hilltop town in the Donetsk region and a vital flashpoint whose capture could accelerate Russian advances deeper in the industrial territory. \n\n>The US will send the latest Patriot missiles “rolling off the production line” to Ukraine instead of other countries that ordered them, the White House said. “We’re going to reprioritise the deliveries of these exports,” said John Kirby, the national security council spokesperson. It also applied to Nasams, another type of air defence missile. “Deliveries of these missiles to other countries that are currently in the queue will have to be delayed,” Kirby said, adding that deliveries to Taiwan and Israel would not be affected. \n\n>The Pentagon has given Ukraine approval to use US-supplied missiles to strike targets inside Russia across more than just the frontlines near north-eastern Ukraine’s Kharkiv region if acting in self-defence. “It makes sense for them to be able to do that,” said Pat Ryder, the Pentagon press secretary. \n\n>Volodymyr Zelenskiy announced measures to protect Ukraine’s energy system, including protection for power plants under Russian fire and the development of alternative and renewable energy sources. Drone and missile strikes have knocked out half of generating capacity since March, according to official figures. Attacks overnight into Thursday hit four regions and cut power to more than 218,000 consumers, the energy ministry said. \n\n>Three men have been arrested in Frankfurt, Germany, on suspicion of trying to collect information on a person from Ukraine for a foreign intelligence agency, federal prosecutors said. They were identified as Robert A, a Ukrainian; Vardges I, an Armenian; and Arman S, a Russian. \n\n[https://www.theguardian.com/world/article/2024/jun/22/ukraine-war-briefing-zelenskiy-hails-historic-step-as-eu-set-to-open-ukraine-accession-talks](https://www.theguardian.com/world/article/2024/jun/22/ukraine-war-briefing-zelenskiy-hails-historic-step-as-eu-set-to-open-ukraine-accession-talks)",
            "Satellite images confirm that three fuel tanks were completely destroyed after the UAV attack on the oil depot in Azov, Rostov region.\n\n[https://bsky.app/profile/noelreports.bsky.social/post/3kviqar4q6h2e](https://bsky.app/profile/noelreports.bsky.social/post/3kviqar4q6h2e) (Bluesky site)",
            "Nigel Farage is a Russian agent.",
            "UNESCO is coordinating support for the arts and building restoration in Ukraine with support from 30 countries. \n\n[https://www.kyivpost.com/post/34026](https://www.kyivpost.com/post/34026)",
            "Defense Intelligence: Ukraine’s troops thwart Russian advance on Borova in Kharkiv Oblast.\n\nRussian invaders faced heavy losses in the attempted advance.\n\nhttps://euromaidanpress.com/2024/06/21/defense-intelligence-ukraines-troops-thwart-russian-advance-on-borova-in-kharkiv-oblast/",
            "The US seems to be reticent about the placement of F16's in Ukraine. The Kyiv post reports that the US will not be training Ukrainian pilots, even though the Ukrainians are likely to have 20 pilots for 60 airframes (??) and the US has two squadrons in the 'boneyard' which could be donated. Seems odd.\n\n[https://www.kyivpost.com/post/34641](https://www.kyivpost.com/post/34641)",
            "[Previous post can be found here](/r/worldnews/comments/1dkuz4y/rworldnews_live_thread_russian_invasion_of/)",
            "ATESH has been successfully infiltrated into the 47th Guards Bomber Aviation Regiment at Baltimore Airfield in Voronezh.\n\nSu-34 fighter-bombers are based here and used in operations against Ukraine.\n\nExpect further developments soon\n\nhttps://x.com/atesh_eng/status/1804442666043662538?s=46\n\nOh my"
        ]
    },
    "/r/WorldNews Live Thread for Israel-Hamas War (Thread #54)": {
        "title": "/r/WorldNews Live Thread for Israel-Hamas War (Thread #54)",
        "score": 183,
        "url": "https://www.reddit.com/live/1bsso361afr0r",
        "content": "",
        "num_comments": 684,
        "comments": [
            "https://www.ynet.co.il/vacation/flights/article/rjfcxvhr0?utm_source=ynet.app.ios&utm_term=rjfcxvhr0&utm_campaign=general_share&utm_medium=social&utm_content=Header\n\nSummery and basic translation is Maldives delay entry ban on Israelis because they don’t know how to distinguish between Israeli Arabs and Israeli Jews.\n\nI wonder how the world would react if any country bans people from only a certain religion (any other religion that is).\n\nAlso, what are they gonna do with the Muslim idf soldiers?",
            "UNIFIL is welcome to perform the mandate it was unanimously given by the UN in 2006 any moment now.",
            "[IDF: Nukhba force squad commander who invaded Israel on October 7 killed in airstrike](https://www.timesofisrael.com/liveblog_entry/idf-nukhba-force-squad-commander-who-invaded-israel-on-october-7-killed-in-airstrike/)\n\n>A squad commander in Hamas’s elite Nukhba force during the October 7 terror onslaught was killed in a recent airstrike in northern Gaza’s Beit Hanoun, the military says.\n\n>Ahmed Hassan Salameh a-Swarkeh, according to the IDF, invaded Israeli towns on October 7, and was later behind sniper attacks against Israeli forces in Beit Hanoun.\n\n>The IDF says it was tracking a-Swarkeh for a lengthy period, and he was eventually spotted by troops of the 414th Combat Intelligence Collection Unit, whereupon an Israeli Air Force drone struck and killed him.\n\n>“Before the strike, steps were taken to prevent harm to civilians. No civilians were harmed,” the military says in a statement.\n\nRest in pieces shitstain.",
            "the israeli who saved sinwar from  brain tumor and lost his nephew on 7.10 \n\n[https://edition.cnn.com/2024/06/20/middleeast/israeli-dentist-hamas-yahya-sinwar-intl/index.html](https://edition.cnn.com/2024/06/20/middleeast/israeli-dentist-hamas-yahya-sinwar-intl/index.html)\n\n  \ni am quite surprised cnn decided to put this  article AS the main headlines in their website",
            ">!A 12 year old girl was raped by 3 teenagers in France simply because she's Jewish!<\n\nhttps://x.com/AmichaiStein1/status/1803091639486894395?t=QpHaP4bMRzwxZoj6p5A5jg&s=19",
            "Remember last month when Hamas claimed that they had kidnapped an Israeli soldier and the IDF said \"no you didn't\"? Turns out it's a Palestinian guy from Jericho who was accused of collaborating with Israel. \n\nhttps://www.ynet.co.il/news/article/r1s2kq1lc",
            "**Dozens of hostages are alive ‘with certainty’ — top Israeli negotiator**\n\nA senior Israeli negotiator tells AFP that dozens of hostages held by Hamas in Gaza are certainly alive and that Israel cannot accept halting the war until all captives are released in a deal.\n\n“Dozens are alive with certainty,” the official said on condition of anonymity as he was not authorised to speak publicly on the issue.\n\n“We cannot leave them there a long time, they will die,” he says, adding that a vast majority of them are being held by Hamas terrorists.\n\nThe official says Israel cannot end the conflict with Hamas before a hostage deal because the terror group could “breach their commitment… and drag out the negotiations for 10 years” or more.\n\n“We cannot, at this point in time — before signing the agreement — commit to ending the war,” the official says.\n\n“Because during the first phase, there’s a clause that we hold negotiations about the second phase. The second phase is the release of the men and male soldier hostages.”\n\nThe official says the Israeli negotiating team had green-lit the Biden plan.\n\n“We expect, and are waiting for, Hamas to say ‘yes,'” the official says.\n\n“In the event we don’t reach an agreement with Hamas, the IDF will continue to fight in the Gaza Strip in a no less intense fashion than it’s fighting now,” he says.\n\n“In a different manner, but an intense manner.”\n\nhttps://www.timesofisrael.com/liveblog_entry/dozens-of-hostages-are-alive-with-certainty-top-israeli-negotiator/",
            "The Cypriot ambassador to Israel, Cornelius Corneliou, referred to the speech of Hezbollah Secretary General Hassan Nasrallah, in which he threatened Cyprus, saying that \"when such a person threatens, there will surely be a reaction. We are waiting for the official response from Nicosia.\" According to him, \"Relations between Israel and Cyprus have never been so strong, and that is all on the surface. We try to play a modest role regarding the transfer of humanitarian aid to Gaza in close coordination with Israel. I'm sure all of this is not welcomed by Hezbollah.\"",
            "[Targeted strike in Salaa, Tyre district, Lebanon](https://imgur.com/a/hnkscmo)\n\nreports that 2 low ranking Hezbollah field commanders were killed in the strike.",
            "The mysterious attack that was attributed to Israel on the night between last Thursday and Friday against a house in the village of Janata in the Tyre district in southern Lebanon was aimed at a sensitive asset for Hezbollah - a secret headquarters of one of the organization's intelligence bodies that was camouflaged among the civilian population\n\n- Roi Kais"
        ]
    },
    "Four members of the billionaire Hinduja family have been sentenced to over four years in jail for exploiting servants, mostly illiterate Indians, at their mansion in Geneva. Prosecutors pointed out  that one staff member was paid less than what the family spent on their pet dog.": {
        "title": "Four members of the billionaire Hinduja family have been sentenced to over four years in jail for exploiting servants, mostly illiterate Indians, at their mansion in Geneva. Prosecutors pointed out  that one staff member was paid less than what the family spent on their pet dog.",
        "score": 2647,
        "url": "https://www.livemint.com/news/swiss-court-sends-hinduja-family-members-to-over-4-years-in-jail-for-exploiting-servants-11718986326790.html",
        "content": "",
        "num_comments": 161,
        "comments": [
            "The court found the Hindujas guilty of exploiting their workers and providing ‘unauthorised’ employment. Besides this, the family was accused of seizing their staffs' passports, paying them in rupees and not Swiss Francs, preventing them from leaving the villa and forcing them to work long hours in Switzerland.\n\nProsecutors said that at times, workers in jobs like cooks or house help were forced to work up to 18 hours a day with little or no vacation time off and for pay that was equal to less than one-tenth of the comparable amount required under Swiss law.\n\nThe staff worked even later hours for receptions and slept in the basement of the villa in the upscale Cologny neighbourhood -- sometimes on a mattress on the floor, added prosecutors.\n\nProsecutor Yves Bertossa highlighted the disparity, pointing out that one staff member was paid only seven Swiss francs (approximately £6.19) for an 18-hour workday, while 8,584 francs (£7,616) were spent annually on their [pet dog](https://www.tribuneindia.com/news/india/billionaire-hinduja-family-spent-more-on-pet-dog-than-on-servants-salary-allege-reports-632269).",
            "Why da fuck do you have to be so cruel if you have billions, a decent pay would be chump change to them",
            "Will any of them actually see the inside of a prison cell or a very lavish home arrest.",
            "So nice to see rich people going to jail.",
            "No billionaire keeps being a billionaire without exploitation. \n\nSome exploit more, some less.",
            "the thing is this is rampant in Geneva, but most doing this have Diplomatic immunity. It is not about the pay, they could afford to have help 24 hours a day. even at swiss wagen.  it is that these pbr8ken people, mostly diplomats Familien, need to treat the help like crap to make themselves feel like they are better than others.",
            ">During the hearing, the family's lawyers claimed that the domestic workers received ample benefits and downplayed claims of exploitation.\n\n\n>\"We are not dealing with mistreated slaves,\" lawyer Nicolas Jeandin told the court.\n\n\n>Another of the family's lawyers, Robert Assael, argued that the workers \"were grateful to the Hindujas for offering them a better life.\"\n\n\nFear not Hindujas, we have already invented a separate unique phrase for this so you don't have to admit to that nasty 's' word. Behold, *indentured servitude*. ",
            "How amazing would it be if they had to pay them damages for... I dunno, slavery. So that each employ the abused ended up with a few million each. That'd be justice.",
            "They should have their fortunes confiscated.",
            "Billionaire mentality + Indian class/caste mentality = Pure filth"
        ]
    },
    "Canada preparing to evacuate 45,000 Canadians from Lebanon.": {
        "title": "Canada preparing to evacuate 45,000 Canadians from Lebanon.",
        "score": 4446,
        "url": "https://nationalpost.com/news/world/israel-middle-east/canada-reportedly-preparing-to-evacuate-citizens-from-lebanon",
        "content": "",
        "num_comments": 865,
        "comments": [
            "TIL that 1% of Lebanon’s population is Canada",
            "Is a big war really brewing?",
            "I'm sorry, 45000 Canadians in a country with 5 million people? That's a staggeringly high number of people.",
            "Again",
            "TIL Lebanon has a lot of Canadians wtf???",
            "Imagine the number of Canadians to be evacuated if it were India",
            "Are you nuts?  Tell them to book a flight.  They just have a Canadian passport for convenience, don’t pay taxes …",
            "Ahhh fuck. Here we go",
            "Again, how do these \"Canadians\" keep getting stuck there? Weird. /s",
            "What 45.000 Canadians doing in Lebanon?"
        ]
    },
    "US tells Israel it will support Israel in a conflict with Hezbollah - report": {
        "title": "US tells Israel it will support Israel in a conflict with Hezbollah - report",
        "score": 1035,
        "url": "https://jpost.com/breaking-news/article-807213",
        "content": "",
        "num_comments": 296,
        "comments": [
            "Looks like another war is coming in the coming weeks.",
            "Iran is the main problem honestly ",
            "Hezbollah & Hamas just need to go. Terrorist organizations like this and that’s how I see them are the scourge of this planet and they need to go.",
            "If the UN only grew a pair of balls and actually enforced the UN resolution, we probably wouldn’t be in this mess",
            "Three year plan, right? Hamas the first year, Hezbollah the second year, then Iran the third.",
            "Its time to free Lebanon from fanatics.",
            "Hot War Summer",
            "Lebanon should ask for Israeli and US help to squash Hezbollah. They been letting them do their thing for too many years.",
            "We’ve seen what US support means with this admin. Likely limited, but sufficient weapons, and an absolute lashing diplomatically if any Muslim voters start protesting.",
            "Lebanon just can’t catch a break"
        ]
    }
}