{
    "Mod Post: Bring Back the Polls in r/WouldYouRather!": {
        "title": "Mod Post: Bring Back the Polls in r/WouldYouRather!",
        "score": 32,
        "url": "https://www.reddit.com/r/WouldYouRather/comments/1desx05/mod_post_bring_back_the_polls_in_rwouldyourather/",
        "content": "Hey r/WouldYouRather Community!\n\nAs your mod team, we’ve noticed a shift in how our beloved “Would You Rather” questions are being posted lately. While it’s fantastic to see the community so active and engaged, we’ve observed that many of you have stopped using the poll feature and are instead posting questions expecting answers in the comments.\n\nWe wanted to reach out to explain why the poll feature is such a valuable tool and encourage everyone to start using it again!\n\n**Why Use Polls?**\n\n1. Instant Results: Polls allow for quick and easy voting, giving a clear and immediate view of the response to a question.\n2. Better Engagement: Polls tend to receive more participation because they are easy to interact with, meaning that more members will engage with your question.\n3. Focus on Discussion: While polls provide the main numbers, the comment section can then be used for in-depth discussions and explanations. This way, the discussion can focus on why people chose their answers rather than simply what they chose.\n\nHence, we believe that bringing back polls will make this subreddit even more fun for everyone.\n\n\n\n**How to Create a Poll:**\n\nCreating a poll is easy and only takes a few steps:\n\n1. Start a new post.\n2. Choose the “Poll” option.\n3. Type in your “Would You Rather” question.\n4. Add the options.\n5. Post!\n\nThanks,  \nYour Mod Team",
        "num_comments": 3,
        "comments": [
            "If you can't see it on mobile browser, Chrome (probably others) have an option to view the Desktop site, clicking that will make the poll option visible.",
            "I've also  noticed many people not using polls and I have no idea why. I almost always use the whenever I ask questions in the sub.",
            "I'd prefer not to have polls, because Reddit doesn't provide an API for third-party apps to see them or interact with them."
        ]
    },
    "If you could experience one of the following options for 24 hours, would you rather….": {
        "title": "If you could experience one of the following options for 24 hours, would you rather….",
        "score": 75,
        "url": "https://www.reddit.com/r/WouldYouRather/comments/1dr1t7x/if_you_could_experience_one_of_the_following/",
        "content": "1) Have unlimited wealth.  What would you do with your money in that time?  Keep in mind that you, or whomever you give money to, would be able to keep whatever you spend your money on.  \n\n2) Be able to travel back in time with the ability to change events (either personal or world events) without any negative \"butterfly effect\" consequences. \n\n3) Have any and all super powers you could think of at the same time (healing people, flying, etc.)  What would you do with your powers?",
        "num_comments": 79,
        "comments": [
            "I mean with 3. I could just imagine myself with the first two as powers, however if that is not allowed 2 would be very easy to make a LOT of money with. (However if we are following butterfly effect rules it is simply too risky) \n\nOverall with just this information I would simply choose option one, and spend a significant amount of money in stocks. Then once the time period is over I would withdraw enough to live of interest from a savings account.",
            "Unlimited wealth. \n\nBuy lots of stocks and mutual funds. Keep it simple and stable. Focus on stocks that pay dividends. \n\nI would take care of my family and close friends.",
            "Going back in time and be able to change events. It also can address the money issue on a lesser scale but more permanently",
            "I mean 1 is pretty nice, but I could get a similar effect with 2 and be able to fix some things that aren't money related.\n\n3 would be cool but the time limit is rough. I could probably do more good with mountains of wealth long-term.",
            "OP, answer this: If I were to choose no. 3, what’s stopping me from creating something that could give me back my powers after the time limit?? Or what’s stopping me from rewinding time to the beginning of the day, every day, updating everyone’s memories of the day they just lived, updating the world of the events that happened, and updating the universe of the day that just happened? By doing this, it’s technically still the same time period, but the universe keeps moving forward. People would still age, stars would still explode, and black holes would keep black holing. ",
            "3. Easy",
            "1. Buy gold.",
            "3\n\nI now have the power to time travel by squeezing my hands to together and saying “travel to [date][time][place]” \n\nI wait a full day and travel back in time 24 hours and pick option 1.",
            "3.\n\nGet endless mental powers to remake the world perfectly inside my mind, apply massive amounts of time dilation, and enjoy being God of a perfect copy of Earth until I get bored. Leave my mind, find that not even 10 seconds have passed, physically alter myself to be better, stronger, ect without any powers, teleport Spain's lost platinum for cash then  just screw around before going back to my life better and richer then the day before with massive amounts of life experience to fall back upon.",
            "Dude. 1. I'd buy my sister's paintings for $100m each, and we'd split it fitty fitty."
        ]
    },
    "Would you rather (4 choices)": {
        "title": "Would you rather (4 choices)",
        "score": 218,
        "url": "https://www.reddit.com/r/WouldYouRather/comments/1dqsyux/would_you_rather_4_choices/",
        "content": "1. Have the ability to instantly learn any skill by touching a book on the subject, but lose all knowledge of that skill after 24 hours?\n\n2. Be able to teleport anywhere in the world, but each time you do, you temporarily swap bodies with a random person at your destination for an hour?\n\n3. Have the power to manipulate probability in your favor, but every time you use it, you age twice as fast for the next week?\n\n4. Possess the ability to communicate with animals, but you can no longer understand or speak human languages?\n\nWhich would you choose and why?​​​​​​​​​​​​​​​​",
        "num_comments": 145,
        "comments": [
            "1. Make a bed of books Also what would happen if I touch an encyclopedia ?\n2. No\n3. Aging is about entropy/probability of your cells damaging their DNA let's gamble it a bit\n4. No",
            "Additional context...\n\n1. Instant skill learning:\n- You can re-learn the same skill after 24 hours by touching the book again.\n- The knowledge disappears exactly 24 hours after you first touched the book.\n- You can learn multiple skills at once, but each has its own 24-hour timer.\n\n2. Teleportation with body swap:\n- You can't control whose body you swap into - it's always random.\n- Your original body remains at the destination, controlled by the other person.\n- You retain your memories and consciousness in the swapped body.\n\n3. Probability manipulation with accelerated aging:\n- You can influence both big and small probabilities.\n- The aging effect is cumulative if used multiple times in a week.\n- It affects only physical aging, not mental aging or life expectancy.\n\n4. Animal communication with loss of human language:\n- You can understand and \"speak\" to all animals, not just certain species.\n- You lose the ability to understand or produce any human language, including sign language and writing.\n- You retain other human knowledge and skills not directly related to language.\n- This change is permanent - there's no switching back and forth.",
            "Out of all the options, #3 has the biggest upside with minimal downside. If saying you flip the odds in your favor means you basically win those odds, then winning the lottery in exchange for aging two weeks in a one week period is crazy. Sign me up!",
            "1 and 3 are the most amazing. \n\n1, I become the most skillful person on Earth. Literally carry a backpack full of books on subject I want to be knowledgeable in, or even buy a van/RV and outift them with a library. Boom, portable library. Plus, if I make my library good enough, I could run my fingers across all books, touching the side of them every morning, 8AM. It becomes barely a hassle that takes a minute or two.\n\n3, I make the probability of me winning the lottery 100%, and for the cost of 2 weeks, become a multimillionaire/billionaire, depending on the lottery I choose. After that, lay low and enjoy life: No need to spam lottery, or else I will become a target.\n\nPersonally, I'd take number 3. Even though I'd really like skill, a one-time lottery winning ticket of $1b+ would do me and my family a lot of good, and there's a lot of possibilities that open up, one of them being time. And you can't replace that.",
            "3. I would like to increase the probability that I'll never age to 100%.",
            "Number 3 and increase the probability that I suddenly begin aging at only 1/8 the normal rate for the rest of my life with no negative consequences. Now whenever my aging rate doubles I'm still only aging at 1/4 the normal rate. Checkmate.",
            "I'd choose skill learning. Each day focusing on one specific area like computers or cars or investing.",
            "Ok the 1st one is the only sane option. Seriously, 2-4 sound terrible.",
            "3",
            "You've gotta put some restrictions on how much you can increase your odds by for Choice #3. It's too OP otherwise. \n\nChoice #1 is good, especially if you're able to retain the information you held prior to using your ability."
        ]
    },
    "Would you rather meet and marry your \"soul mate\" or...": {
        "title": "Would you rather meet and marry your \"soul mate\" or...",
        "score": 34,
        "url": "https://www.reddit.com/r/WouldYouRather/comments/1dqzvxn/would_you_rather_meet_and_marry_your_soul_mate_or/",
        "content": "Receive a yearly lottery winning of $500k per year after taxes?",
        "num_comments": 50,
        "comments": [
            "I am fairly confident I’ve met my soul mate and wouldn’t trade her for all the money in the world. \n\nSo, give me the mate! ",
            "Money, especially if it is every year, I'm sick of working for underpaying assholes.",
            "500k. I'm sure eventually I'll find whoever I'm supposed to be with regardless so run me my moneyyy💀",
            "$500k a year will make finding a \"soul mate\" easier... plus it comes with all the other benefits of life.\n\nJust... imagine the burden lifted from not worrying about money in any regard. You can relax and enjoy dating looking for the \"one.\" I should clarify. I don't believe in a singular person you are destined to be with. I believe you simply find the one that \"gets\" you. There are tens of thousands of those people on earth. You've just got to find one of them. Just as you're one of thousands for them.",
            "gimme the money. and since it's 500k after taxes, the government will like it as well",
            "I don't believe in a soul mate and really don't want to share my life with anyone. I'll take the money.",
            "The chances that the one person I ended up with is my technical “soul mate” are slim, but I’m happy as can be with her! SHOW ME THE MONEY!!!!",
            "Gimme the money, nobody wants me anyway, they might take at least some interest when I’m rich XD",
            "The money easily",
            "Soulmate, no question"
        ]
    },
    "Would you rather have a crystal ball where you can nearly see all or choose to restart your life at whatever age you want with 1 upgrade.": {
        "title": "Would you rather have a crystal ball where you can nearly see all or choose to restart your life at whatever age you want with 1 upgrade.",
        "score": 254,
        "url": "https://www.reddit.com/r/WouldYouRather/comments/1dqjgw2/would_you_rather_have_a_crystal_ball_where_you/",
        "content": "1. The crystal ball can basically show you, ONLY YOU, anything that has existed or currently exists which is accurately described. You can say \"show me the nearest alien lifeforms\" & if they exist it will show them. However, if you say \"show me the key to eternal life\" it couldn't show you. You would have to be specific with your wording like \"show me the scientific findings on how to prolong your life.\" It cannot show you anything in the future so lottery tickets or winners of sports games wouldn't work.\n\n2. The crystal ball cannot be broken or destroyed, only you can see the images shown on the crystal ball. You can use the crystal ball as much as you would like. \n\n3. Choose to restart your life at whatever age you want with all of your memories intact. However, attempting to explain this phenomenon to anyone will never work... no matter how much you predict & prove, people will never believe that you have restarted your life. \n\n4. You may choose 1 upgrade for yourself if you restart your life, it has to be related to your body & it cannot be supernatural or superhuman. You could choose to be a certain height by a certain age, choose to get rid of a specific disease or disability that you have or simply raise your IQ by a maximum of 30 points.  ",
        "num_comments": 143,
        "comments": [
            "Crystal ball is super overpowered so go with that. It’s literally the key to being a bajillionaire in no time\n\nAny company you want to invest in you can see their internal accounts, their R&D projects, performance, and that of their competitors. \n\nUse it to find buried treasure \n\nUse it to spy on governments or people. \n\nUse it to find every lost bitcoin wallet and their passwords. \n\nYou can literally do anything.",
            "30 IQ points, just so I can have a long life of thinking how much smarter of a choice the crystal ball would have been",
            "Oh hell yeah! Crystal BALL!",
            "Damn. It’s so tempting to go back to 18 and do adulthood without my disability. But I’d be such a different person and I’m afraid I wouldn’t meet my boyfriend / he wouldn’t want to date me. I’d live the rest of my life missing him.\n\nThe crystal ball can definitely be used to make money, even if you can’t see into the future.",
            "If I was still single with no kids, restart back a few years and buy a boatload of Bitcoin, Gamestop, or whatever random stock I want that I know goes up. \n\nBut now, the crystal ball and look for financial records of major companies for insider info to trade stocks. Either way, I'm rich bitch.",
            "Upgrade. Make me a 10/10 attractiveness wise",
            "I could ask the crystal ball to show me the location of any oil wells. I could pretend to be a psychic and make a lot of money telling oil companies where to drill.",
            "I want to restart at 1. I don’t even want the upgrade, I just want to see my grandparents again.",
            "If I could just chose to start today as a biological woman, I'd be totally fine with that.",
            "Restart from around 12 when the depression that runs in my family began to derail my life, but without the depression"
        ]
    }
}