{
    "Mod Post: Bring Back the Polls in r/WouldYouRather!": {
        "title": "Mod Post: Bring Back the Polls in r/WouldYouRather!",
        "score": 35,
        "url": "https://www.reddit.com/r/WouldYouRather/comments/1desx05/mod_post_bring_back_the_polls_in_rwouldyourather/",
        "content": "Hey r/WouldYouRather Community!\n\nAs your mod team, we’ve noticed a shift in how our beloved “Would You Rather” questions are being posted lately. While it’s fantastic to see the community so active and engaged, we’ve observed that many of you have stopped using the poll feature and are instead posting questions expecting answers in the comments.\n\nWe wanted to reach out to explain why the poll feature is such a valuable tool and encourage everyone to start using it again!\n\n**Why Use Polls?**\n\n1. Instant Results: Polls allow for quick and easy voting, giving a clear and immediate view of the response to a question.\n2. Better Engagement: Polls tend to receive more participation because they are easy to interact with, meaning that more members will engage with your question.\n3. Focus on Discussion: While polls provide the main numbers, the comment section can then be used for in-depth discussions and explanations. This way, the discussion can focus on why people chose their answers rather than simply what they chose.\n\nHence, we believe that bringing back polls will make this subreddit even more fun for everyone.\n\n\n\n**How to Create a Poll:**\n\nCreating a poll is easy and only takes a few steps:\n\n1. Start a new post.\n2. Choose the “Poll” option.\n3. Type in your “Would You Rather” question.\n4. Add the options.\n5. Post!\n\nThanks,  \nYour Mod Team",
        "num_comments": 3,
        "comments": [
            "If you can't see it on mobile browser, Chrome (probably others) have an option to view the Desktop site, clicking that will make the poll option visible.",
            "I've also  noticed many people not using polls and I have no idea why. I almost always use the whenever I ask questions in the sub.",
            "I'd prefer not to have polls, because Reddit doesn't provide an API for third-party apps to see them or interact with them."
        ]
    },
    "If you could experience one of the following options for 24 hours, would you rather….": {
        "title": "If you could experience one of the following options for 24 hours, would you rather….",
        "score": 164,
        "url": "https://www.reddit.com/r/WouldYouRather/comments/1dr1t7x/if_you_could_experience_one_of_the_following/",
        "content": "1) Have unlimited wealth.  What would you do with your money in that time?  Keep in mind that you, or whomever you give money to, would be able to keep whatever you spend your money on.  \n\n2) Be able to travel back in time with the ability to change events (either personal or world events) without any negative \"butterfly effect\" consequences. \n\n3) Have any and all super powers you could think of at the same time (healing people, flying, etc.)  What would you do with your powers?",
        "num_comments": 177,
        "comments": [
            "I mean with 3. I could just imagine myself with the first two as powers, however if that is not allowed 2 would be very easy to make a LOT of money with. (However if we are following butterfly effect rules it is simply too risky) \n\nOverall with just this information I would simply choose option one, and spend a significant amount of money in stocks. Then once the time period is over I would withdraw enough to live of interest from a savings account.",
            "Going back in time and be able to change events. It also can address the money issue on a lesser scale but more permanently",
            "I mean 1 is pretty nice, but I could get a similar effect with 2 and be able to fix some things that aren't money related.\n\n3 would be cool but the time limit is rough. I could probably do more good with mountains of wealth long-term.",
            "OP, answer this: If I were to choose no. 3, whats stopping me from creating something that could give me back my powers after the time limit?? Or whats stopping me from rewinding time to the beginning of the day, every day, updating everyones memories of the day they just lived, updating the world of the events that happened, and updating the universe of the day that just happened? By doing this, its technically still the same time period, but the universe keeps moving forward. People would still age, stars would still explode, and black holes would keep black holing.",
            "3.\n\nGet endless mental powers to remake the world perfectly inside my mind, apply massive amounts of time dilation, and enjoy being God of a perfect copy of Earth until I get bored. Leave my mind, find that not even 10 seconds have passed, physically alter myself to be better, stronger, ect without any powers, teleport Spain's lost platinum for cash then  just screw around before going back to my life better and richer then the day before with massive amounts of life experience to fall back upon.",
            "3 would be the best option. Literally make up a super power and you now have it",
            "I'll take number 3. Reality warping/ narrative manipulation/ omnipotense are superpowers that 100% exist in fiction and are powers I can think of. I no longer have these powers for 24 hours, I have them indefinitely and now exist as God.",
            "Dude. 1. I'd buy my sister's paintings for $100m each, and we'd split it fitty fitty.",
            "choose 3 and inherit the other 2 superpowers",
            "1, i'll buy loads of products from failing small businesses, give them to people in need/want of them. i'll also get the green energy companies WORKING on projects in developing countries. mostly i'll be handing them the money that day and then the stuff they do comes after"
        ]
    },
    "Would you rather (4 choices)": {
        "title": "Would you rather (4 choices)",
        "score": 293,
        "url": "https://www.reddit.com/r/WouldYouRather/comments/1dqsyux/would_you_rather_4_choices/",
        "content": "1. Have the ability to instantly learn any skill by touching a book on the subject, but lose all knowledge of that skill after 24 hours?\n\n2. Be able to teleport anywhere in the world, but each time you do, you temporarily swap bodies with a random person at your destination for an hour?\n\n3. Have the power to manipulate probability in your favor, but every time you use it, you age twice as fast for the next week?\n\n4. Possess the ability to communicate with animals, but you can no longer understand or speak human languages?\n\nWhich would you choose and why?​​​​​​​​​​​​​​​​",
        "num_comments": 189,
        "comments": [
            "Out of all the options, #3 has the biggest upside with minimal downside. If saying you flip the odds in your favor means you basically win those odds, then winning the lottery in exchange for aging two weeks in a one week period is crazy. Sign me up!",
            "3. I would like to increase the probability that I'll never age to 100%.",
            "Number 3 and increase the probability that I suddenly begin aging at only 1/8 the normal rate for the rest of my life with no negative consequences. Now whenever my aging rate doubles I'm still only aging at 1/4 the normal rate. Checkmate.",
            "I'd choose skill learning. Each day focusing on one specific area like computers or cars or investing.",
            "Ok the 1st one is the only sane option. Seriously, 2-4 sound terrible.",
            "#1 - it really doesn't matter if the knowledge goes away in 24 hours because you just touch the book again.  Knowledge is power.  Whatever you wanted to be and do is possible.  Each morning, you get up, and while having your morning coffee, you just run your hand over all the books in your bookcase. You could instantly become the smartest person in the world on any subject.",
            "You've gotta put some restrictions on how much you can increase your odds by for Choice #3. It's too OP otherwise. \n\nChoice #1 is good, especially if you're able to retain the information you held prior to using your ability.",
            "Instant Skill. Everything else is a gigantic pain in the ass.",
            "I'd pick probability manipulation, use it a single time to win some massive lottery, and then never touch it again.  That is, of course, I can manipulate probabilities that way.\n\nIf not, then I'd pick the book ability.  As long as I don't forget my current skill, this is just pure upside.  And assuming I could potentially learn those skills with natural practice and ability.  I'd keep a Chinese-English dictionary at home, and tap it on my way out the door.  Really don't need anything else in my daily life.  Maybe touch a math book before class?",
            "Talking to animals. I'd just love to do that... I think you could get round the no human speech by talking to a computer (programming) and program it to understand/translate some animal speech. If you could program it in some level of machine code (or similar machine only language), you'd technically not be communicating with any form of human language. \n\nBut if that really isn't possible I'd go with the skill one. I think the rules mean that after 48hrs from first touching a book you can relearn that skill, because as read it seems easy to touch a book every 24 hours to keep a skill... then find a book that gives me the skill of talking to animals... Dr Dolittle maybe... ;)"
        ]
    },
    "Would you rather meet and marry your \"soul mate\" or...": {
        "title": "Would you rather meet and marry your \"soul mate\" or...",
        "score": 75,
        "url": "https://www.reddit.com/r/WouldYouRather/comments/1dqzvxn/would_you_rather_meet_and_marry_your_soul_mate_or/",
        "content": "Receive a yearly lottery winning of $500k per year after taxes?",
        "num_comments": 87,
        "comments": [
            "500k. I'm sure eventually I'll find whoever I'm supposed to be with regardless so run me my moneyyy",
            "I am fairly confident Ive met my soul mate and wouldnt trade her for all the money in the world.\n\nSo, give me the mate!",
            "Money, especially if it is every year, I'm sick of working for underpaying assholes.",
            "$500k a year will make finding a \"soul mate\" easier... plus it comes with all the other benefits of life.\n\nJust... imagine the burden lifted from not worrying about money in any regard. You can relax and enjoy dating looking for the \"one.\" I should clarify. I don't believe in a singular person you are destined to be with. I believe you simply find the one that \"gets\" you. There are tens of thousands of those people on earth. You've just got to find one of them. Just as you're one of thousands for them.",
            "gimme the money. and since it's 500k after taxes, the government will like it as well",
            "Soul mate I rather be done searching tbh.",
            "My soul mate is a billionaire",
            "the money so I can afford to fix my teeth :(\n\nUgh I hate my teeeth.",
            "I don't believe in a soul mate and really don't want to share my life with anyone. I'll take the money.",
            "Can we still be together just not married?"
        ]
    },
    "Would you rather live a year in Jurassic era with your choice of $50,000 of supplies, or live in ancient Egypt with $500 of supplies, or 1800 with no supplies?": {
        "title": "Would you rather live a year in Jurassic era with your choice of $50,000 of supplies, or live in ancient Egypt with $500 of supplies, or 1800 with no supplies?",
        "score": 6,
        "url": "https://www.reddit.com/r/WouldYouRather/comments/1drc897/would_you_rather_live_a_year_in_jurassic_era_with/",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Egypt with 500.  \nWith the right selection of instruments you could superspeed the progression of technology lol",
            "Do you come back with whatever supplies are left? Because I'd be a legend in the archeology field with the pics and videos of how the pyramids were actually built and what they looked like originally.",
            "Ancient Egypt, and I use some of that money for a dictionary, appropriate clothing, and enough food to get me through the first few days. The rest goes into spices, I should be able to sell those for a profit.",
            "I'm going big game hunting. Give me the $50,000",
            "Really what you do is use the $50,000 to build some high tech preservation coffin or chamber and live with basically nothing (probably dying within the first few months). But you take pictures, save samples, so people millions of years from then will see it and get super confused.\n\n\nI also don't know if the vault/photos will just degrade to dust after like a million years.",
            "Sure"
        ]
    }
}