{
    "Defias Pillager mourns the dead": {
        "title": "Defias Pillager mourns the dead",
        "score": 319,
        "url": "https://i.redd.it/ey4hw9r4cu7d1.png",
        "content": "",
        "num_comments": 56,
        "comments": [
            "I was tanking in RFK when it happened. I noticed that my mark macro wasn’t working before I pulled. I went to type “wait” and I noticed it didn’t post. Luckily everyone waited for me to pull but instead I started running out of the dungeon. Very tense moment. Super close call.",
            "Hail the victorious dead!",
            "Probably Freemason's fault somehow.",
            "There will always be naked humans at any event in WoW",
            "Context?",
            "Raccoon's fault",
            "Gone but not forgotten </3",
            "I heard a lot of people died. Glad I was busy today and not on!",
            "We go agane",
            "Home depot have lost 23 people in deaths in a raid in the last 2 weeks. 24 if you count the rogue on the winterspring cat who apparently quit to play cata.\n\nThey're gonna be recruiting hard."
        ]
    },
    "I finally manned up and did a level 60 dunegon": {
        "title": "I finally manned up and did a level 60 dunegon",
        "score": 105,
        "url": "https://www.reddit.com/r/wowhardcore/comments/1dog83b/i_finally_manned_up_and_did_a_level_60_dunegon/",
        "content": "[RYC BRD featuring Dotterdave from TL](https://preview.redd.it/5jt2ip6g4s8d1.jpg?width=1285&format=pjpg&auto=webp&s=97353a114b32c8a584ef265e84452babaa88d744)\n\nLet me just say that Dotterdave is one cool ass dude, he really knows his stuff and the run wouldn't even be possible without him. Shout out to Dotterdave!",
        "num_comments": 53,
        "comments": [
            "This is what’s so great about hardcore. Someone’s reputation is actually relevant. People learn to respect others and it matters. That’s one thing that’s lost in modern gaming. I don’t know you Dotterdave, but you have my respect!",
            "Dotter Daaaaaaave that's my boy!",
            "Dotterdave just hit 60 himself, he is a saint, the horde needed him.",
            "Carmine! A place for steaks",
            "Nice one. Next stop - Naxxramas.",
            "RYC Represent!",
            "Meanwhile I died at level 7 to a rare mob lol",
            "DOTTERDAVE <3\n\n2toed says hi",
            "All those beautiful people I miss you right now. :I\n\nKeep going strong!\n\nDotterdave in TL,\nCarmine, Wagio and Quinsanity, GOOD JOB!",
            "Dotterdave The GOAT"
        ]
    },
    "This is why I love Classic. Just vibin. ": {
        "title": "This is why I love Classic. Just vibin. ",
        "score": 39,
        "url": "https://www.reddit.com/r/wowhardcore/comments/1dqu74i/this_is_why_i_love_classic_just_vibin/",
        "content": "https://preview.redd.it/2jq7k331nd9d1.png?width=1920&format=png&auto=webp&s=300009f87ced3fe2d844562078b7cb893a4f3f05\n\nAll different Guilds, all random people, all interacting. This is true Classic spirit, this is why I love HC. We out here thriving on Defias Pillager <3",
        "num_comments": 6,
        "comments": [
            "Best game ever made.",
            "DP so awesome. Pre rend buff after the teleport everyone running. It’s awesome.",
            "Give bandit a pet for me",
            "Hell yea we are brother!",
            "OG Chad brother here. Love you noscope",
            "Love my Chads!!!!"
        ]
    },
    "Late leveling journey trap": {
        "title": "Late leveling journey trap",
        "score": 15,
        "url": "https://i.redd.it/2dophsrgue9d1.png",
        "content": "Hey there ! \n\nNew WoW player since last november,  I began my journey with hardcore, then SoD (until phase 2 got as bored as everyone) and then hardcore again. \nI did a few try and died a lot because I didn't manage the mechanics (around lvl 20) on my first hardcore experience.\n\nSince I'm back on hardcore I decided to level multiple characters to go agane quickly if I died. I had two accidents on my two first Ally toons, and I decided to go back to horde side which I knew \"better\" thanks to SoD (until lvl 40 zone).\n\nI just hit 50 with my shadow Priest, I healed every dungeon from RFC to ZF and I'm now wondering which are the deadliest trap coming from 50 to 60 ? I've just complete Hinterlands elite, and I will complete one or two quests to hit 51 in Feralas. \n\nDo you have any advice on the new zone I will discover soon ? I'm really excited about Un'Goro which is a zone I want ti discover since the begining. \n\nCheers mate, and hope to see you in NekRosh EU soon. \n\nFazeo, ",
        "num_comments": 12,
        "comments": [
            "Careful with the blood pools you can click in western plague lands, it will spawn 2 lvl 58 elite that will slow you for 1 minute.\n\nThis is what killed my 53 Hunter 🥲",
            "It might be worth your time to research quests before doing them in zones like EPL, winter spring, and Silithis. Lots of elite quests and roaming elites in EPL and WS, especially.",
            "Marcutio is a killer quest in Plaguelands\n\nLook out in general for mobs with execute",
            "Ungoro has wandering giant elite dinosaurs, and a couple mobs fear around there so be careful. \n\nJust avoid Silithus unless you really know what you’re doing. So many dangerous mobs and areas. \n\nWinterspring, don’t afk and fly there. There is a mob that pays close enough to the FP that can kill you if you’re afk. \n\nStay focused and stay safe! Mobs keep getting more abilities and surprise mechanics so don’t get cocky.",
            "WPL can gain of ton of XP from the cauldron runs but the freezing ghouls can suck. The Scarlet mobs also chain easily so be mindful there. You may be able to save these until late 50s to be super safe. \n\nUngoro down south was mentioned. Don’t do the Queen quest without a group. Maybe Queen captures pawn? I forget. Also the Apes up north; the Thunder ones beat on their chest and get respawns for support easy.",
            "Blood pools, alright, I heard about that before and I'll definitely keep it in mind. Thanks and Big F for your hunter !",
            "Eastern Plaguelands general chat in 2005: ”Anybody seen any blood of heroes?”\n\nMe: ”Yes, it’s running in my veins”",
            "Ungoro is amazing. One of my favorite zones in vanilla. Careful of the elite cave in the south and the roaming Dino as well!",
            "Good advice - I’d say this is the point where a lot of non-elite quests would need the elite tag. And oddly, some elites that just aren’t.",
            "https://preview.redd.it/wr37zqwa0f9d1.jpeg?width=474&format=pjpg&auto=webp&s=4b7a82c026317778cabda60c149ddc9007d41f8e\n\nDo not click the Blood of Heroes unless you and your party know what you are doing."
        ]
    },
    "I just realized you can use Kerlonian as your personal bodyguard while questing in darkshore.": {
        "title": "I just realized you can use Kerlonian as your personal bodyguard while questing in darkshore.",
        "score": 54,
        "url": "https://i.redd.it/8k3okj1a6c9d1.jpeg",
        "content": "",
        "num_comments": 13,
        "comments": [
            "Afaik he doesn't respawn as long as quest is not over, so if you really use him like this you're going to be hated by everyone wanting to do the quest.",
            "Me get mauled to death by a nightsaber\n\nHim: **I SLEEP.**",
            "Except that moment he is always sleeping.",
            "I’m sorry, do you actually want to spend every 30 seconds of your life blowing a horn? Lmao",
            "If you dont do enough damage to your enemy you wont get exp",
            "But you have about 25 minutes to do the quest before it fails, I am pretty sure",
            "Thats a sacrifice Im willing to make",
            "A random grey mob attacks you ?\n\n**REAL SHIT**",
            "A minor inconvenience",
            "😂"
        ]
    }
}