{
    "Find-A-Friend Megathread! (June '24)": {
        "title": "Find-A-Friend Megathread! (June '24)",
        "score": 6,
        "url": "https://www.reddit.com/r/wownoob/comments/1d62wzm/findafriend_megathread_june_24/",
        "content": "Post in the format below for easy glancing or make your own intro! You can also include more information such as your level, what your interests are, and what you might be looking for in a buddy.\n\n**Format:**\n\n* Region / Faction / Server / Veteran or Noob / Contact Info (i.e Btag/Discord) (Additional Information)\n\n**Example:**\n\n* NA / Horde / Wyrmrest Accord / Noob / User#9999 Level X Frost Mage- I play on the weekends. Looking for friends who enjoy questing for 8 hours straight, enjoy punting Gnomes, and killing bosses in raids.\n\n**We also have LFG, resources, and find-a-friend in the** [WoWNoob Discord](https://discord.gg/wownoob)**.**  \n**You can find the previous Find-A-Friend threads** [here](https://www.reddit.com/r/wownoob/?f=flair_name%3A%22Find-A-Friend%22)**.**\n\n*Remember that this thread is* *not to be used for guild recruitment or any other recruitment* *aside find-a-friend/recruit-a-friend. Posts that break our* [rules](https://www.reddit.com/r/wownoob/about/rules/) *will be removed.*",
        "num_comments": 79,
        "comments": [
            "**Hey there! Have you checked out these resources?** \n\n* [WoWHead](https://www.wowhead.com/) - The *largest* database, this should be your go-to (don't forget to read the comment section!).\n\n* [Icy Veins](https://www.icy-veins.com) - News and detailed class guides.\n\n* [WoWNoob Discord](https://discord.gg/wownoob) - Same community, different platform.\n\n*Please report the post above if it breaks one of our [>rules<](https://www.reddit.com/r/wownoob/about/rules/). If not, don't forget to show support by upvoting!*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wownoob) if you have any questions or concerns.*",
            "NA/Alliance/Proudmoore/Veteran(put been away a while)/Discord: n0mad5\n\nI’ve been looking for some to level with in Remix MoP. Over 30, but open to playing with most.  It would be nice to have someone to run dungeons and normal raids to get some alts leveled up. \nShared interests would be great, but not required.  I love music of all kinds (not much country though). Some examples: Wu Tang Clan, Pearl Jam, The Midnight. Shows: Arrested Development, Avatar: TLA and Korra, Ahsoka, Andor, Community, Stranger Things.  Outside of video games I like bball, hiking, and trying to be active.  \nUsually evenings work better after kids are in bed.  Thanks!  Good luck everyone.",
            "NA / Alliance / Aerie Peak / Veteran / MrPilkington #1207\n\nExperienced veteran of 15 years, just looking for some more buddies to join our casual friend group/guild. We love to teach new players and get them ready for whatever content they are wanting to play. Send me a message.",
            "NA / Alliance / Zul'jin / Noob / Discord: nirvannaah / Level 70 Holy Priest - Recently started playing the game, more than 2 weeks now. I am hoping to have some fun with new friends. :) At the moment I do some quests related to reputation and my item level isnt high enough to do some Mythic + dungeons and never tried any raid yet. I am looking forward to it very soon",
            "NA / Alliance / Pagle / Noob / Ace#22325 Level 10 Warlock \n\nI've always wanted to play WoW and enjoy my time in Azeroth with friends, sadly my irl friends don't have any interest in WoW so I'd love to meet some friendly people who look to enjoy leveling and eventually dungeons. Not looking for anyone in particular but if you can teach me something about the game I'll be sure to learn it. I can play most days at mostly any hour.",
            "NA / Both / Blackwater Raiders and Stormrage / Veteran / BattleTag: JeffMc#1432  \n  \nI've been an avid WoW player since 2005, switching between Horde and Alliance, though I've always been a Horde main. My primary servers are Blackwater Raiders (H) and Stormrage (A), but you'll find me on other servers occasionally. I've been involved in heroic raiding off and on all the way through Shadowlands and was really into PvP during the Burning Crusade and Wrath eras.\n\nLife's busier now with a full-time job and family, so my gaming hours are a bit sporadic. Most of my old friends have stopped playing over the years, so I'm hoping to connect with others who are laid-back about schedules and up for diving into any type of content. Looking forward to making some new friends to explore Azeroth with me!",
            "na/horde/illidan/sorta noob -- hello!! looking for more friends to play with and anyone that feels like helping a noob learn new stuff :) msg me!",
            "NA / Horde / Illidan / Veteran / Discord: ohsew   \nHowdy. I'm a Mythic CE raider in a top 100 guild, also doing big mythic + dungeon keys. If anybody needs help getting on in game or just someone to play with to learn from i'd love to help out. Lets blast! Hit me up!",
            "EU / HORDE / DRAENOR / VET/NOOB / discord: peakrue, bnet: Peakrue#2257\n\nLooking for plate/cloth user to do transmog runs with me and my friend. Also would love to find a tank to heal for who doesn't mind a newer healer. On daily looking to have fun and chill and get loot!",
            "Hey I was thinking about levelling a character outside of remix, I wa t to try mythic plus and stuff. Was wondering if anyone would like to do some levelling together? EU: Any server tbh"
        ]
    },
    "Favorite class to main for the war within?": {
        "title": "Favorite class to main for the war within?",
        "score": 5,
        "url": "https://www.reddit.com/r/wownoob/comments/1dlt38z/favorite_class_to_main_for_the_war_within/",
        "content": "I haven’t played the beta. I made a Frost DK and so far that was my “main” per se. Started in dragonflight. The riders of the apocalypse sounds great . However I hated the lack of mobility. I played a wind walker monk on mop remix and loved the dmg/mobility. But idk what it will be like in TWW. I also started maining a bum hunter for collecting animals but the rotation is kinda boring. Well, animations. Shoot shoot shoot. Just curious what y’all will main and why :)",
        "num_comments": 27,
        "comments": [
            "**Hey there! Have you checked out these resources?** \n\n* [WoWHead](https://www.wowhead.com/) - The *largest* database, this should be your go-to (don't forget to read the comment section!).\n\n* [Icy Veins](https://www.icy-veins.com) - News and detailed class guides.\n\n* [WoWNoob Discord](https://discord.gg/wownoob) - Same community, different platform.\n\n*Please report the post above if it breaks one of our [>rules<](https://www.reddit.com/r/wownoob/about/rules/). If not, don't forget to show support by upvoting!*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wownoob) if you have any questions or concerns.*",
            "Bum hunter... Hah!\n\nThat aside, unholy dk or warlock, currently leaning towards DK. I just like evil summoner necromancer vibes.",
            "I’ll probably main my Druid as I’ve done since like TBC. Whether I’ll keep on guardian or try something else has yet to be determined.",
            "My 2 mains. Warrior (since vanilla) and Demon Hunter (since they became a thing in legion).\n\nIf I have time and/or motivation sometimes I throw in my Ret or WW monk as played alts. Both played since they can out respectively.",
            "I've played on and off since day 1 and resto druid has almost always been my main. I like to flex so I also had a mistweaver however I never fell in love with either class' other specs. I've had a mage every expansion that never got anywhere until the one I rolled for df. But still, I kept rotating and leveling new classes.\n\nThen something weird happened. I went to the barber and changed my evoker to a female and toggled auto visage. And it just clicked. I found my main. \n\nMeanwhile, I've flirted with dk here and there but never to high level. For remix, I was messing with the character screen and female panda DK just looked awesome one handing a big 2h sword like a ninja. Then I felt powerful with the visuals and I fell in love again.\n\nWhich is weird because I've tanked end game as a monk, druid, and paladin. But druid and monk especially didn't click with me thematically and I didn't enjoy ret or holy on paladin.\n\nSo I'll main pres/dev and because I hate waiting in queue, my alt next expo is a tank that I plan to flex and pvp with too!",
            "I like my holy priest and healer privileges in DF, so proly I will be playing the same in TWW plus either DK or Warlock. I leveled up almost everything in Remix.",
            "I’m still at crossroads between priest, druid and warrior. And it mainly because of hero talents. Played prot warrior and holy priest for the majority of DF, thinking to continue maining holy priest, but damn hero talents for holy suck. \n\nMountain thane for prot looks cool and enjoyable, also tested prot on beta, seems fun.\n\nBut then I also like the choice for guardian druid, both hero talent options seems cool and enhance class fantasy really well I think.\n\nI’m also trying to choose which dps spec to have as 4th warband member, thinking about fire mage now, just because all the casts are pretty much instant, but I dislike lack of heal and defensives mages have, especialy after playing tanks and healer.",
            "I'll keep maining my mage that I've played since vanilla, but I'll also focus on healing with my new priest when I do group content.",
            "Not sure yet got an ample supply to choose from was really enjoying rogue in this mop time-rewind thing.",
            "With mop remix I tried almost all classes. Now I am evem more confused what I will play in war within 😔 Im thinking something between mage, warlock, warrior, hunter.."
        ]
    },
    "Need help finding higher level gear for mage ": {
        "title": "Need help finding higher level gear for mage ",
        "score": 2,
        "url": "https://www.reddit.com/r/wownoob/comments/1dlv1f6/need_help_finding_higher_level_gear_for_mage/",
        "content": "Currently in Zalandar - lvl 56. My gear level is quite low and it’s taking a lot for me to kill mobs. The account was reset from 120 or whatever I’m level was years ago. Need gear in the 170-180 level range, my current is 120ish. \n\nAny knowledge or help would be appreciated ",
        "num_comments": 2,
        "comments": [
            "**Hey there! Have you checked out these resources?** \n\n* [WoWHead](https://www.wowhead.com/) - The *largest* database, this should be your go-to (don't forget to read the comment section!).\n\n* [Icy Veins](https://www.icy-veins.com) - News and detailed class guides.\n\n* [WoWNoob Discord](https://discord.gg/wownoob) - Same community, different platform.\n\n*Please report the post above if it breaks one of our [>rules<](https://www.reddit.com/r/wownoob/about/rules/). If not, don't forget to show support by upvoting!*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wownoob) if you have any questions or concerns.*",
            "You tagged this as classic but sounds like you are playing retail.\n\nGears from quests should be enough for you to level up. Starting at 60 in dragonflight you will get even higher ilvl gear."
        ]
    },
    "Proving grounds": {
        "title": "Proving grounds",
        "score": 2,
        "url": "https://www.reddit.com/r/wownoob/comments/1dltcm1/proving_grounds/",
        "content": "Hello everyone.. I need to use the proving grounds to try to cut on the waiting times while doing fyralath quests but ive never used the proving grounds before, when i talk to trial master rotun iin the white tiger temple i get the option to go to the proving grounds but when i press it it doesnt work, and i also dont have a garrison so i was wondering if there is anyway i can access the proving grounds or do i have to do some sort of campaign or build my garrison, keep in mind i want to get there as fast as possible also i am an alliance if it makes any difference.. thanks for the help in advance",
        "num_comments": 4,
        "comments": [
            "**Hey there! Have you checked out these resources?** \n\n* [WoWHead](https://www.wowhead.com/) - The *largest* database, this should be your go-to (don't forget to read the comment section!).\n\n* [Icy Veins](https://www.icy-veins.com) - News and detailed class guides.\n\n* [WoWNoob Discord](https://discord.gg/wownoob) - Same community, different platform.\n\n*Please report the post above if it breaks one of our [>rules<](https://www.reddit.com/r/wownoob/about/rules/). If not, don't forget to show support by upvoting!*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wownoob) if you have any questions or concerns.*",
            "The proving grounds is old content that isn't relevant in Dragonflight anymore. By \"try to cut on waiting times,\" do you mean getting a gold medal in damage to show off to prospective groups in group finder? If so, that definitely does not matter.\n\nThe proving grounds are also not related to garrisons in any way; those are systems from separate expansions (MoP and WoD respectively).\n\nAs far as queuing goes, try talking to a class trainer.",
            "You do not need to do proving grounds.",
            "You can reset the CD on one of the legendary materials by going into the proving ground and leaving it, turns a couple hour job into a few mins"
        ]
    },
    "I want to start playing": {
        "title": "I want to start playing",
        "score": 3,
        "url": "https://www.reddit.com/r/wownoob/comments/1dlr1vi/i_want_to_start_playing/",
        "content": " Well, I've been wanting to start playing WoW for a while, I know you have to pay to play so it's something I'm thinking about. I'm struck by the atmosphere that seems to exist in the game, where you can meet people and that kind of thing.\n\nI know that using in-game money you can buy game time but there is also the issue of expansions that I honestly don't understand very well how the fact that an expansion allows you to reach a certain level works and so I have some questions\n\n1. After how long does it become feasible for someone starting from 0 to be able to purchase game time using only in-game currency?\n\n2. How does the expansion issue work?\n\n3. Is it true that you know many people?",
        "num_comments": 11,
        "comments": [
            "**Hey there! Have you checked out these resources?** \n\n* [WoWHead](https://www.wowhead.com/) - The *largest* database, this should be your go-to (don't forget to read the comment section!).\n\n* [Icy Veins](https://www.icy-veins.com) - News and detailed class guides.\n\n* [WoWNoob Discord](https://discord.gg/wownoob) - Same community, different platform.\n\n*Please report the post above if it breaks one of our [>rules<](https://www.reddit.com/r/wownoob/about/rules/). If not, don't forget to show support by upvoting!*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wownoob) if you have any questions or concerns.*",
            "1. It will never be feasible for the average player unless the only thing you do when you log on is farm gold to pay for your subscription. \n\n2. You can buy the latest expansion for $25, and it includes all the previous expansions.\n\n3. Your question may be confusing to me due to a language barrier, but the potential to meet many other players is there.",
            "1. It costs a ton of in-game gold to purchase a WoW token on the auction house (the subscription). As a new player, the time it would take you in game hours would be crazy long. The time you spend trying to do it, you may as well just save money in real life to purchase a monthly subscription.\n\n2. The new expansion (The War Within) is released on 26 August. You can pre-buy it now and it will give you all the previous expansions (including the current Dragonflight expansion). If you are not sure, then you can start for free and level a character from L1-20 to try the game out. Then you can decide then if you want to buy a subscription and then pre-buy War Within, which will give you access to all the expansions right away.\n\n3. There are guilds you can join, and Discord too. At the moment, it is less busy because people are waiting for the next expansion but still players around.",
            "You will not reasonably be able to pay for your sub with in game currency. Especially as a new player with no professions.\n\nIf you buy the new expansions you get all the previous ones and can level to max.\n\nIf you actually want to meet people I recommend a roleplay server. People talk more on there and are friendlier in my experience.",
            "Your questions have been answered but I'd recommend forgetting about buying game time until well into the future.",
            ">After how long does it become feasible for someone starting from 0 to be able to purchase game time using only in-game currency?\n\nIf you've never played WoW before, I'd say it's going to take you quite a while to get to a point where you sustain yourself with in-game gold. In order to make money, you have to invest money. And if you don't have any money to invest, you won't make enough either. Simple economics. This works pretty much the same in all MMOs where you can buy game time with in-game currency.\n\nI'd recommend paying for your subscription the old-fashioned way instead. It's less stressful in the long run.\n\n>How does the expansion issue work?\n\nI'm not sure what you mean by 'issue'.\n\n>Is it true that you know many people?\n\nAgain, I don't quite understand your question. If you're asking if it's possible to get to know people, the answer is absolutely. If you're asking if I personally know many people in the game, the answer is no.",
            "Don’t worry about people telling you how to play find what you like and learn at your own rate you will be much better for it!",
            "[removed]",
            "Would it be possible to farm it in like 2 months of 2-3 hours daily?",
            "This post has been removed: r/WoWNoob rule 8: No ToS/EULA violations\n\nWe have a zero-tolerance policy for the discussion or encouragement of any behavior, business, or other such actions that violate the WoW Terms of Service. This includes private servers, buying/selling accounts, exploiting game mechanics, real-world money transactions, etc. \n\nOur subreddit rules are located in the sidebar to help clarify what kind of posts we do and don’t allow here. We recommend reviewing them to ensure that future posts won’t risk further moderator action. \n\nFeel free to contact us through modmail if you have any questions or concerns!"
        ]
    }
}