{
    "[Daily Discussion] Brainstorming- June 21, 2024": {
        "title": "[Daily Discussion] Brainstorming- June 21, 2024",
        "score": 3,
        "url": "https://www.reddit.com/r/writing/comments/1dl3gg5/daily_discussion_brainstorming_june_21_2024/",
        "content": "\\*\\*Welcome to our daily discussion thread!\\*\\*     \n\n&#x200B;\n\nWeekly schedule:\n\n&#x200B;\n\nMonday: Writer’s Block and Motivation\n\n&#x200B;\n\nTuesday: Brainstorming\n\n&#x200B;\n\nWednesday: General Discussion\n\n&#x200B;\n\nThursday: Writer’s Block and Motivation\n\n&#x200B;\n\n\\*\\*Friday: Brainstorming\\*\\*\n\n&#x200B;\n\nSaturday: First Page Feedback\n\n&#x200B;\n\nSunday: Writing Tools, Software, and Hardware\n\n&#x200B;\n\n\\\\---\n\n&#x200B;\n\nStuck on a plot point? Need advice about a character? Not sure what to do next? Just want to chat with someone about your project? This thread is for brainstorming and project development.\n\n&#x200B;\n\nYou may also use this thread for regular general discussion and sharing!\n\n&#x200B;\n\n\\\\---\n\n&#x200B;\n\n\\[FAQ\\]([https://www.reddit.com/r/writing/wiki/faq](https://www.reddit.com/r/writing/wiki/faq)) \\\\-- Questions asked frequently \n\n&#x200B;\n\n\\[Wiki Index\\]([https://www.reddit.com/r/writing/wiki/index](https://www.reddit.com/r/writing/wiki/index)) \\\\-- Ever-evolving and woefully under-curated, but we'll fix that some day      \n\n&#x200B;\n\nYou can find our posting guidelines in the sidebar or the \\[wiki.\\]([https://www.reddit.com/r/writing/wiki/rules](https://www.reddit.com/r/writing/wiki/rules))",
        "num_comments": 39,
        "comments": [
            "Perfect day for brainstorming. I have a book I just started writing (never publish, just personal short-ish stories) and I'm also looking for recommendations. Tried making a post, but apparently the auto-mod said they don't like it, and to list it here.\n\nI haven't read any *current* books in quite a long time, and I'm currently trying to get some inspiration of how to structure things a bit more clearly and eloquently.\n\nI'm curious of 1) which \"older\" author is your favorite as far as their writing style, 2) favorite \"newer\" author, 3) a good book or series that you find to be very well written.\n\nIt drives me *insane* when a book feels like it's written for a.... different audience. I grew up on books written by Edgar Rice Burroughs, Louis L'Amour, C.S. Lewis while also stumbling across Nora Roberts more recently.\n\nI like SciFi and Fantasy, and I'm wanting to branch into more adult books to see how things are done in books these days. I've written plenty of adult content for others, but never cared for the ones I attempted. They seem like they are childish in a way; inexperienced with a fantastical (though wildly impractical or unrealistic) idea of what is happening. \n\nI'm not old, I just hate moderate to piss poor effort in writing quality. Takes me completely out of the world I'm trying to get into.",
            "I struggle with names and titles. Do any of you have resources you use to help with that?",
            "How could I wrote someone who's pretending to be someone else, a good person who's funny, likeable, the person who they've always wanted to be etc when they're actually someone who's deeply calculative and a good liar.\nThey see themselves as the person who they pretend to be but deep down they know that they aren't, they ideally want someone who would accept them for who they are.\nI'm really thinking about how to show this kind of character, for example, their thoughts being extremely to the point and shrewd while their speech is extremely long and comedic.\nAny ideas?",
            "Dialogue or summary, which is the best? I am struggling with this dilemma. The situation is this: A secondary character will reveal some lore of the world and the political situation. However, I can't choose between a good long dialogue or a much quicker analytical summary. Any Advice?\n\nThis lore is relevant to the story",
            "FRIENDS-TO-ENEMIES-TO-LOVERS\n\nHow soon should I introduce the fact that childhood friends turned enemies are actually fated to be lovers?\n\nFor context, (werewolf novel) WMC was brainwashed into a revolution as a young child, and was subsequently taken into hiding with her future LI. They grew up as friends in hiding, LI eventually finds out she was the “leader” of the revolution, immediately hates her. Later they find out they are mated, he ends up rejecting her and takes off for years. She ends up proving her loyalty to the wolf-King and is given a pardon and is informed the Moon Goddess is now going to repair the rejected bond rather than give her a new mate. Now LI is back and they haven’t seen each other since the bond was fixed, but I have to bring them back together soon for a mission.\n\nI’m on Chapter 16, bond was fixed in Chapter 12-ish, after some heated arguments between WMC and LI. Should I just bite the bullet and do it in this chapter? It feels like too much to put in just a couple of chapters 😅",
            "Was going to put this in its own post because it's a rather long question, but got a warning to put it here when I added the title, so sorry in advanced for how long this is. I wrote the post before already, so I'll just put it here I suppose.\n\nI am writing a cultivation novel and would like some help figuring out what items would be necessary to bring a person back to life in my story. The character who's going to be bringing this person back to life is a peasant who's hoping to raise a martial master from his grave and make them mentor him. He is, of course, an idiot, if that's relevant, but I need him to successfully perform this task.   \n  \nThis is relevant because he likely wouldn't have access to any crazy artifacts that you might see an established cultivator struggle to obtain. It's possible for him to stumble across some sort of part or egg or something of a legendary beast by chance, because I don't want it to be super easy to raise the dead in this world, but he needs to manage it in the beginning of the story. I don't want to have too many details beforehand about him obtaining those items because this resurrection takes place at the very beginning of the story and the plot can't get properly started unless the story begins with him in the cemetery performing said ritual. Him going through a bunch of hardship in the beginning that he likely wouldn't survive in his state would sadly be way too awkward to fit into the exposition.\n\nDoes anybody know some items that could be used for this ritual, or any items he could stumble across by rare (yet convenient, lol) chance? Usually there would be some big arc building up to a revival in cultivation stories, but the whole point of this is that the protagonist, desperate for a mentor in the beginning of the story, resorts to raising the dead, only to revive the wrong person and have to deal with the annoying person he accidentally brought back instead. I'm open to having somebody pulling the strings behind the scenes that gave him these items, but ultimately my reason for asking this is because I have no idea what kinds of items would usually be necessary for this in a cultivation story or how they would be used.",
            "What did i miss ?",
            "Not sure where this would go, so apologies if this belongs in a different thread, but...Does anyone know if there's a database for all the writing/publishing resources? Like one place where authors can see things like resources for promoting your book, or resources for creating ads to sell your book, etc?",
            "Is there such a thing as a mystery writer's wiki or database where one can look up certain details? For example something such as how much of a certain substance would it take to kill a person? Looking for book contents and I feel googling it would put me on some sort of watch list.",
            "please share your honest reviews: [https://www.wattpad.com/1454249894-my-fantasy-boyfriend-chapter-1-wish](https://www.wattpad.com/1454249894-my-fantasy-boyfriend-chapter-1-wish)\n\n  \nmy first writing"
        ]
    },
    "[Weekly Critique and Self-Promotion Thread] Post Here If You'd Like to Share Your Writing": {
        "title": "[Weekly Critique and Self-Promotion Thread] Post Here If You'd Like to Share Your Writing",
        "score": 7,
        "url": "https://www.reddit.com/r/writing/comments/1dlejc8/weekly_critique_and_selfpromotion_thread_post/",
        "content": "Your critique submission should be a top-level comment in the thread and should include:\n\n&#x200B;\n\n\\* Title\n\n\\* Genre\n\n\\* Word count\n\n\\* Type of feedback desired (line-by-line edits, general impression, etc.)\n\n\\* A link to the writing\n\n&#x200B;\n\nAnyone who wants to critique the story should respond to the original writing comment. The post is set to contest mode, so the stories will appear in a random order, and child comments will only be seen by people who want to check them.\n\n&#x200B;\n\nThis post will be active for approximately one week.\n\n&#x200B;\n\nFor anyone using Google Drive for critique: Drive is one of the easiest ways to share and comment on work, but keep in mind all activity is tied to your Google account and may reveal personal information such as your full name. If you plan to use Google Drive as your critique platform, consider creating a separate account solely for sharing writing that does not have any connections to your real-life identity.\n\n&#x200B;\n\nBe reasonable with expectations. Posting a short chapter or a quick excerpt will get you many more responses than posting a full work. Everyone's stamina varies, but generally speaking the more you keep it under 5,000 words the better off you'll be.\n\n&#x200B;\n\n\\*\\*Users who are promoting their work can either use the same template as those seeking critique or structure their posts in whatever other way seems most appropriate. Feel free to provide links to external sites like Amazon, talk about new and exciting events in your writing career, or write whatever else might suit your fancy.\\*\\*",
        "num_comments": 41,
        "comments": [
            "\\*Title: The Interloper, Chapter 1\n\n\\*Genre: Hard sci-fi\n\n\\*4245 words\n\nHi, there, I'm a newcomer here. I'm typically someone with more of an interest in science and philosophy, but enjoy speculative fiction as a vehicle to explore these concepts.\n\nSo, here's the first chapter of a story I'd like to receive feedback on. Given that this is hard sci-fi, the focus of a lot of my effort has been trying to make sure that the events in the story align as much as possible with current understanding of science and principles of logical consistency. However, I've also tried to make sure the writing is up to snuff - I've thrown away a few previous stories due to thinking they weren't delivered in a satisfying way, and the only reason why this has been posted here is because it meets my personal criteria for readability.\n\nI'm not looking for any specific feedback. While I would certainly appreciate pointers on where the plot deviates from believable scientific speculation or generally just strains credulity, I'd hugely appreciate (and am mostly expecting) feedback on aspects such as how the prose feels and flows, on how understandable the writing is, and whether the dialogue feels authentic enough.\n\nLink: [https://docs.google.com/document/d/1VRUve1NXcBEBN6eKt5VrXY-CnToFxnJh9e8yOZ\\_LYZk/edit?usp=sharing](https://docs.google.com/document/d/1VRUve1NXcBEBN6eKt5VrXY-CnToFxnJh9e8yOZ_LYZk/edit?usp=sharing)\n\nExcerpt:\n\nTwo months, fifteen days, twenty-one hours, and counting. That’s how long I’ve been here, dying in slow motion, my body slowly rotting from the inside long before I’ve even had the chance to take my last breath. My final resting place will be a twisted, hyperbaric coffin named *Proteus,* forged from metal, glass and concrete, entombed deep in the waters of a lifeless abyss.\n\nThe luminaire assemblies that line the walls of the hab gradually flicker on and illuminate the chamber in a sickly off-white glow, mechanically simulating a diurnal cycle for all its doomed inhabitants.\n\nIn the station, an ever-present soundscape practically smothers us, heavy and ominous and oppressive. The very walls that protect us from the elements scrape and buckle incessantly like a soda can under pressure, as if they could crumple inwards and crush us at any moment. In the endless, murky depths outside, the hydrothermal fields produce a subtle, low rumble that seems to emanate from somewhere in the very core of the world, like a massive sleeping god under our feet only kept alive by its host body’s eccentric swings from periapsis to apoapsis and back again. Softly stirring as it’s unwittingly press-ganged into providing the energy necessary to sustain *Proteus* and keep it from falling apart.\n\nI hear Whitlock faintly stirring in the bunk underneath me. The bed creaks as he slowly, gingerly sits up and begins to vomit into a bucket, choking and heaving and gasping as the contents of his stomach unceremoniously escape his body. Once the retching is over, there’s laboured breathing and a soft, low thud; the sound of a head being rested against a bunk pole.\n\n“Hey, you okay down there?” I call to him, my voice raspy and worn.\n\nNo response.\n\nStill extremely tired, sore and unwilling to get up, I close my eyes and try to ignore the faint glow behind my eyelids, letting the deep, all-consuming drone lull me back to sleep. Slowly, I lose awareness of my limbs and then my body, and very nearly manage to fall into a state of blissful oblivion until a quiet thumping and rustling emerges from near the door of the module, breaking me out of my hypnagogia.\n\nI blearily crack open an eyelid, and strain through the harsh fluorescent glare to see who it is. It’s Spivey putting on his uniform and shoes, getting ready for the day ahead so he can pretend to be useful.\n\nOf the lot of us, he’s the only one that’s bothered to act like the mission still matters. When he’s not doubled over in horrible agony and hacking up a lung, he conducts routine structural checkups, analyses sediment samples near hydrothermal systems, collects data on the topography of the seafloor, and performs a million other experiments that no one will remember. Amassing an ever-growing corpus of information so he can stave off the overwhelming despair and grief, desperately trying to convince himself that he still has a role to fill in spite of his impending doom.\n\nHe zips up his jumpsuit, and turns to us.\n\n“Well, I’m gonna have a look at field C-21. You two can rot in your bunks all day or you can help.”\n\nI groan and reluctantly peel myself from the bedsheets.",
            "Title: Nothing yet, the document title is a placeholder \n\nGenre: my attempt to blend sci-fi and fantasy \n\nType of feedback desired: overall impressions and/or line by line comments, I have them turned on\n\nhttps://docs.google.com/document/d/1w9_zE8-oxswVAfRw_1yAlC8MaTv6R9T2ibSu4_31lJo/edit?usp=drivesdk\n\nContext:\nSo this is my first time starting a project since I was a freshman in HS. I wrote this as a hook for the world and characters I intend to expand on in my project. I am curious how effective of a hook it is. Thanks in advance!",
            "Heyo!\n\nI'm working on an original web-serial about a boy and his kemonomimi companions traveling through the modern (but magical) world of Riterra. Though it's not always easy as they seek companionship in a world rapidly trying to objectify and commodify them.\n\n**What should I expect?**\n\n-Kemonomimi story where the cat-girls don't just go \"nya\" and have actual character to them.  \n-Modern setting, similar though different to real life at the same time  \n-Magic and spell-casting system complete with elemental affinities and other aspects naturally integrated in the narrative (readers compare it to Soul Eater meets Pokemon)   \n-There will be battles; we have \"Hunters\" and \"Duelists\" make of that what you will.  \n-Slow building romance, but no smut, we're PG-13 here, most you're going to see is some hugging and maybe a kiss or two  \n-Very cute fluffy slice of life elements to help break up the drama   \n-Currently at 106 chapters totaling over 316k words  \n-Two chapters a week with plenty of backlog to ensure I can keep up that upload pace  \n-If you're looking for something to get invested into in the long run this is your story!  \n-Best part: **IT'S FREE**\n\n**What are people saying?**\n\n-*\"A wonderful world with a clever magic system, solid worldbuilding, and characters that are tons of fun to get invested in!\"*  \n*-\"There is a lot to get immersed into, and I think it'll be enjoyed by those it is targeted for, and maybe those it is not.\"*  \n*-\"I love this story! The author does an excellent job drawing you in with interesting, multifaceted characters in my opinion.\"*  \n*-\"I believe the author has something to tell us and yet also give us a fun adventure world to explore at the same time. Big respect!\"*  \n-*\"Great read so far! The setting, or more specifically, the magic/battle mechanics are incredibly unique and well thought up.\"*\n\n**Where can I start reading?** \n\nIf you want to check it out, you can start [HERE](https://www.royalroad.com/fiction/74788/pruned-trees-re-sprout-ragazza-volpe-magica)\n\nI  would love to have you as a reader, please check it out! Follows are greatly appreciated, just knowing my work was worth clicking that button is worth its weight in gold\\~",
            "**Title:** Traveler's Will: Chronicles of the Lost Worlds\n\n**Genre**: Dark Fantasy\n\n**Word count**: 86.151 (45 chapters)\n\n**Current rate**: 4.81 \\*(68 reviews)\n\n**Synopsis**: This is a tale of a man known as the Traveler. In the pursuit of his own meaning and his thirsty will to craft his worth, he found himself facing the darkness of the world. In a deadly fight for survival, he shall tell his story. And as if each road should have, this is a tale of sorrow, a tale of wandering, a tale of one soul's search for the escape of his own fate, and how that search, and the fearless will that drove it, gave birth to a legend.\n\n**Type of feedback desired (line-by-line edits, general impression, etc.**): General impression and my writing style.\n\n**A link to the writing**: [https://www.webnovel.com/book/traveler's-will-chronicles-of-the-lost-worlds\\_25553012106498105](https://www.webnovel.com/book/traveler's-will-chronicles-of-the-lost-worlds_25553012106498105)",
            "\\* Title: Rotting Pigs in Lipstick\n\n\\* Genre: Religion , thriller\n\n\\* Word count: 480+\n\n\\* Type of feedback: General and pacing feedback\n\n\\* A link to the writing: [https://docs.google.com/document/d/19jbVY\\_sK6d1eBL1QiG-j7VEVKB\\_m8s93Jaxrv4gdOi0/edit?usp=sharing](https://docs.google.com/document/d/19jbVY_sK6d1eBL1QiG-j7VEVKB_m8s93Jaxrv4gdOi0/edit?usp=sharing)",
            "Hi, first time writer here looking for criticism of a short story.\n\nThe story's called Luna, and it's a near future sci-fi short story about a group of friends celebrating before some of them leave the planet.\n\nWord count is about 2200.\n\nI'm looking for feedback on the reader experience. Things like pacing, sentence structure, word choice and characterization. I'm also looking for anything which stands out to you while reading it which you either especially enjoy, or which brings you out of the story.\n\n[The link is here](https://docs.google.com/document/d/1G_3jYfdIEe0btbuBLAf2bR4dXOCmpiyJNrdTEvN92Dk/edit?usp=sharing), and I want to thank anybody who takes the time to read and give their thoughts on the story. No feedback is wrong or too minor, and the more criticism you can give the more I'll be able to improve my work.\n\n  \nShort sample for anyone interested:\n\n\tSean Dominguez was high on life, as was his younger brother Miguel. Their friend Edgar was high on blueblood and half a joint he’d found in his pocket after dinner. He might have taken Sean and Miguel up on having a hit of the baggie of synthetics they shared, but he’d always preferred to celebrate special occasions with a nice mellow. Jody, seven beers deep, clung to Reese’s shoulder as they stumbled forward. Reese, ever the square, was sober. The group were walking down Santa Lucia Street, cackling at one of Sean’s stories about the time he and his ex had misread a road sign during a day trip and it became a week trip.\n\n\tWhen he finally found his breath again, Edgar wiped his eyes dry and cleared his throat.\n\n“Miguel, it’s been real, man. It’ll be hard to see you go.” He gripped Miguel’s hand and gave him a thump on the back. His hand came away grimy, carrying a smear of the motor oil that Miguel had just barely failed to wash off his hands after work. He turned to Sean and barely kept himself from cracking a grin. “Sean, it’s been real annoying. I can’t wait for your dog-ass to be stuck on the moon.”",
            "\\*Title: The Story Of Us\n\n\\*Genre: Romance\n\n\\*2065 words\n\n\\*Hi. So first time writer here. I want to know your general impression about the story. Where do you think I can improve? How is the flow, tone and prose?\n\n\\*Link: [The Story Of Us](https://docs.google.com/document/d/1NxQT3pFIKcfWOeiAF0j4t2T2Og8H9CCiAt6Usvs1Tz0/edit?usp=sharing)",
            "Title: Under Red Skies - Part 1\n\nGenre: Upmarket Fantasy\n\nWord Count: 2k\n\nBlurb: *Anna Parks is a peculiar woman with a rather amazing gift; her dreams betray the future. For the last few weeks she’s been plagued with visions of the death of her son and is determined to do something she’s never succeeded at—change the outcome, cheat fate. Anna sets out to find answers and a solution, a path which uncovers truths long buried, reveals the dwindling fate of life on Earth, and puts her on a collision course with destiny and its helpers.*\n\n*John Mitchell, on the other hand, has spent the last seventeen years building himself a life and family. But when his brother returns with a proposition—the possibility of bringing Bella back from the dead—John is pushed to make a decision, one which unsettles the past, present, and future.*\n\nType of feedback required: General impressions\n\nLink: [https://drive.google.com/file/d/1N-eH8AL5rpV32VvjL02ISpuF579zMqhP/view?usp=sharing](https://drive.google.com/file/d/1N-eH8AL5rpV32VvjL02ISpuF579zMqhP/view?usp=sharing)\n\nThank you, and God bless you! :)",
            "\\*Title: The Demon Hunter's Curse, Chapter 1\n\n\\*Genre: Dark Fantasy\n\n\\*3249 words\n\n\n\nHi, I am looking for some high-level developmental feedback on the first chapter of my latest draft.  I'd like to know whether my main character comes off as a likeable protagonist, and that the plot is going in an interesting direction.  I'm happy to trade critiques!\n\n\n\nLink: [https://docs.google.com/document/d/1FgrEGOUJK3do51USFBcEnxV8qJbhDprG0WoaYFijQWM/edit?usp=sharing](https://docs.google.com/document/d/1FgrEGOUJK3do51USFBcEnxV8qJbhDprG0WoaYFijQWM/edit?usp=sharing)\n\n\n\nFirst 300 words:\n\nTo Arion, the early winter had been a blessing.  For months, he’d sweated under his breastplate while mosquitoes weaved between the gaps in his armor to bite him.  But not anymore.  A late summer snow had stemmed the flying little demons and made wearing his silver armor comfortable, rather than stifling.  It’ll be a good night for a spirit hunt, he thought as he strode down the snowy path with a spring in his step.\n\nDespite the attacks by spirit monsters, the walled town of Rhelton was surrounded by a sprawling shantytown teeming with life.  Arion raised his guard as he approached the sea of tattered canvas tents.  He shifted his eyes between the scores of people, wary for signs of cutpurses or cutthroats.  The smell of the place hardly helped his focus.  Every nook of the slum reeked of unwashed bodies and heavily spiced stew that made his eyes water.\n\nNearly everyone Arion passed stared up at him with sunken, hungry eyes.  Children stopped playing and either pointed at him or ran when he walked by.  Older folk were bolder.  They hissed at him and stood guard in front of the younger ones.  They brandished kitchen knives, pitchforks, or even holy Sun charms meant to ward off evil.\n\nThe sight of all those angry faces only worsened Arion’s tics.  Every few seconds, he’d feel a burning urge to jerk his head to the side, slap himself, or snarl like some rabid animal.\n\nEach time a tic slipped past his guard, he drew more bad attention to himself.  Then the new narrowed eyes on him only inflamed his need to twitch or snarl again.  Arion plastered a smile on his face and muttered, “it’s alright, folks.  I’m a spirit hunter.  I’m here to help.”",
            "Title : Vipers\n\nGenre : Sports Horror\n\nWords : 2300\n\nJust looking for a general impression, really. It’s the first time I’ve shared anything I’ve written. I’m not a horror writer but I was given an exercise that went off in a fun direction.\n\nhttps://www.wattpad.com/story/370815226-vipers"
        ]
    },
    "What do you do when you have an idea that isn't enough to become a whole book?": {
        "title": "What do you do when you have an idea that isn't enough to become a whole book?",
        "score": 25,
        "url": "https://www.reddit.com/r/writing/comments/1dlsbkc/what_do_you_do_when_you_have_an_idea_that_isnt/",
        "content": "Novelists: what do you do when you have an idea that you love, but that isn't enough to carry an entire book? Like you have the bones, but the bones aren't enough to be... well, enough, if that makes any sense. Like it's there, but it needs SOMETHING to be a real, working plot and not just points, details, characters, relationships, and (some) scenes?\n\nI struggle with this all the time. I'll have an idea that's fleshed out, but it's not enough of an idea to turn the pages without some X factor. What's your process for finding/coming up with that X factor?",
        "num_comments": 37,
        "comments": [
            "I simply write it as a short story. Or I let it fester in my \"Story Ideas\" folder.",
            "I exclusively write short stories",
            "I have a file on my computer called \"Random ideas\" where I stick every interesting idea I have while writing, watching something, reading something, or at work.\n\nThis ranges from page-long out of context scenes I've been inspired to write to single-sentence character concepts, quotes, interesting historical events or figures, or just about anything else. Some of it gets incorporated into the main work, and a lot of it just sits there in case I find a use for it later.",
            "I relate. Just write. Get those characters moving. Sometimes it will surprise you to see that is indeed enough for a short novel, and other times it will take you to new paths, subplots that will show up as you go. Naturally, it depends on what story you are writting. Solutions will not take the same form in a spy thriller than in a historical novel set up in ancient Rome. Think also on what commentary the novel can carry. A detective novel is not just about the case, for example, but the whole world around it, a social commentary on the circumstances, the street, a political sideplot. A historical novel is not just about characters in the middle ages moving thorugh the specific plot, but about representing more accuratelly that period. Show that world. As usual, the root advice here is to read. Check books on the genere you are tackling, grab a couple of novels (good or decent ones, to be on the safe side) and read them trough and trough and isolate the main plot with those things that are not, the side plotd or mere background, and you will get a clearer vision on how to bring your novel into a more complete form.",
            "u/HaggisAreReal said what I was going to say but better\n\n\nI'll start with what I will swear is only a small, quick idea - but then when I get to actually writing it, suddenly I've got an entire book happening. Then I go to edit/revise that first draft, and oh look - its a trilogy now.\n\n\nMy to-write list is annoyed, but at least my bank account is happy\n\n\nEdit: formatting",
            "I think everyone will say the same thing and tell you to write anyway. I am someone who plans minimally and writes on the fly. If I had a bare bones structure I would start writing and tell myself I couldn’t put in plot point x until I had written a certain number of words. Essentially space out your current ideas with new material in the spaces between the sketchy outline. I would bet you would need to close only two gaps this way before things fell into place. If it really speaks to you, give it a try.",
            "One option is to keep it in the back your mind until it combines with a second idea - neither may be a whole novel on their own, but together they may become something more interesting and complex.",
            "Write a novella.",
            "You put it in an anthology of short stories.",
            "Go over the structures of the story archetypes that fit into your idea and try to structure your idea around the archetype. Identify parts of your story that don't feel fleshed out properly and improve those aspects."
        ]
    },
    "What are some tropes that you like for relationships?": {
        "title": "What are some tropes that you like for relationships?",
        "score": 12,
        "url": "https://www.reddit.com/r/writing/comments/1dlr8cm/what_are_some_tropes_that_you_like_for/",
        "content": "I’ve recently been thinking about tropes (the good and the bad). It’s got me fairly interested and I had to ask you guys: what are your favourite relationship tropes? I honestly don’t know.",
        "num_comments": 12,
        "comments": [
            "Fauxmance, where for whatever reason the two try to appear as if they are in a relationship while they're not. And then they slowly fall in love ❤️",
            "opposites attract. for example, a dumb fool is brave charms the intellectual broody opposite- or some variation of this. of the top of my head. iirc, watch Wakfu for this one. \n\nthere is the enemies to lovers, i guess that is another form of the opposites attract. it can be fun. \n\nthen there is the destiny binds two together. it's a hit or miss for me on this one. depends on how it happens i suppose. but destiny feels kind of a cheat to guarantee two getting together. \n\n age gap romances. this is often the arranged marriages route. not everyone likes those. an example would be a younger princess married to and older lord \n\nstudent and teacher relationships are another. platonic or even lovers\n\nchildhood friends.\n\ni like admirers to enemies to. a perfect example is syndrome form the Incredibles. Never meet your heroes!\n\nas for what's good and what's bad, that is subjective and ultimately up to the reader and the writer to decide. perhaps it's how the writer frames the relationship as good bad and who the reader perceives it. so, as a writer think how you want the intended audience to see it and proceed that way.",
            "forbidden love.",
            "Will they or won't they? Personality based tension, that is to say \n\nAlso I like a 5_10 year age gap between the characters, so they are like a brother and a sister, as well as boy and girl.",
            "I love the \"really just friends\" trope. Not everything has to turn into romance, even if circumstances say it could.",
            "I love all wholesome ones :3. But I personally write a lot of sunshine x gloomy, and god/monster x mortal. And they understand and comfort each other :D. The romance subplot of the story I'm writing rn is literally (mortal) undead sunshine x gloomy immortal demi-god lol. I also like insane characters so most of the ships I write are also some level of unhinged x someone who understands and keeps them grounded",
            "Friends to lovers \n\nRivals to lovers (NOT Enemies to lovers) \n\nAnything non-creepy and rather wholesome",
            "There’s the forbidden love trope and, as cliche as it may be, I love the “enemies to lovers” trope…",
            "Anyone else sick of tropes",
            "some of mine are...controversial!"
        ]
    },
    "How do you deal with the fear of being exposed, of being judged as a terrible writer?": {
        "title": "How do you deal with the fear of being exposed, of being judged as a terrible writer?",
        "score": 13,
        "url": "https://www.reddit.com/r/writing/comments/1dlqss1/how_do_you_deal_with_the_fear_of_being_exposed_of/",
        "content": "I think many of us have these thoughts and images of ourselves as having good stories to tell, of having something to say that matters and makes people want to listen to us. But there is also this terrible fear of waking up from this dream and being told we really suck and have no talent.\n\nYou don't have this fear?\n\nOkay so maybe it's just me then.\n\nI'm so afraid that it prevent me from writing. I have intrusive image of me one day posting my writing in a sub here or a forum online, asking to receive constructive criticism, and then receiving nothing, then again asking for it and coming back to it a few days later to find one comment after another of people saying really hurtful things about me lacking talent and having no business writing.\n\nI guess I won't know until I do submit my work, but I wonder how other writers (or other artists in general) do it. How do they face and even welcome criticism? I've read that even great writers sometimes received really harsh criticism and some only became famous and appreciated for for their work years after their death. Such a sad thing that it can even happen to the best of writers. What chance do the rest of us have?\n\nThere is nothing you can do to prevent that kind of crushing reaction for certain. You could work on the same draft for weeks and months and years, and still have people saying it sucks. I feel writing takes a kind of courage that people don't always talk about. It's a tough business.\n\nBy the way, I've seen people give really hurtful criticism and drawing all kinds of conclusions about an author whose work they did not like, so I'm not just imagining a worst-case scenario.",
        "num_comments": 34,
        "comments": [
            "I just accept I might write something terrible. Then it becomes my editor's problem. 🤷‍♀️",
            "Go to goodreads and look up 1 star reviews of your favorite books. There are people over there taking a massive dump on anything from Pride and Prejudice to The Lord of The Rings. Absolute classics, definitely very good books, and yet they have some terrible reviews.\n\n\nYour writing will never please everyone and that's a good thing. If 80% of people don't like your stories, but the other 20% are hardcore fans, who cares?\n\n\nWrite for yourself. No one is looking over your shoulder. You don't have to share your stories, if you don't want to. \n\n\nThere's also the writer's curse. Something you really like today can look like shite two weeks later. That's good, because it means you've grown as a writer. You start noticing more and more flaws, which you can then edit, until you like it again.\n\n\nEvery writer in history has produced bad, clunky sentences and sometimes whole books that just didn't work out at all. It's the same in other fields, too. Look at the Beatles. They have some amazing songs and some that make me go \"what the hell were they thinking?\".\n\n\nIt's necessary. You will never write only good things. Not every sentence will be good, not every story will be good, but some of it definitely will. That \"some\" will grow. Instead of 1 out of 10 sentences being good, now it will be 3. Soon it will be 4 or 6 and before you know it, bad sentences will be the exception. \n\n\nAgain, no one is watching you. Just write. Accept that you WILL write some bad stuff, maybe a lot of it in the beginning, but you will also get better at it. What others might say about your work doesn't matter. You're not a pro yet, you're still learning.\n\n\nJudging by your post, you are definitely able to express yourself clearly. That's a big step towards being a decent writer, in my opinion.",
            "*\"How do you deal with the fear of being exposed, of being judged as a terrible writer?\"* \n\n\nBy accepting it and writing anyway. Over the course of writing you'll get better (unless you're too stubborn).  \n\n\nYou can either do that or let your fears defeat you, cry, curl up into the fetal position suck your thumb underneath covers weeping silently.  \n\n\nThe choice is yours OP. ",
            "Just... Do it.",
            "So, the terrible truth is that you might be a terrible writer, and if the thought of that, and being told that, is unbearable, then you won't ever be able to produce anything for public consumption.   \n  \nWe can all give you tips and tricks and our own philosophies, but my own life approach of \"fuck it we ball\" won't help you if you can't handle criticism.",
            "I have alpha/beta readers and an editor to tell me if and where it sucks so I can fix it before publishing. Anything before publishing is a learning experience, a chance to improve my craft and story.\n\n\nThen I make sure (because I self pub) that my cover and blurb and everything is on point for my audience, so I don't accidentally have yacht snobs wandering into my bicycle shop. (Okay, sure - you didn't like that chapter. But ma'am this is a Wendy's and it's a fav trope/genre staple of something you don't like but chose to read anyway.) If I've failed here, that's on me but it can still be fixed.\n\n\n\nSometimes you gotta remember that folks have bad days or are just terrible people, and they'll take that out on a lil $5 eBook like I ran over their grandma's house in a monster truck. That's not on me, that's them.\n\n\nI've worked retail, service industry, and as a freelancer on projects big and small. I have seen folks complain about the stupidest stuff and have learned its often really more reflective of who they are as a person than the thing they are complaining about. I won't lie, negative comments can still sting in the moment. But you dust yourself off and keep going, or else you'll never get anywhere at all.",
            "\"By the way, I've seen people give really hurtful criticism and drawing all kinds of conclusions about an author whose work they did not like, so I'm not just imagining a worst-case scenario.\"\n\n\nPeople who do this are assholes and losers - one of the best things one can do for oneself is to learn to ignore the opinions of assholes and losers. They're absolutely worthless. \n\n\nMost normal people really don't care all that much if they don't like your book or think it's rubbish, they'll just shrug and move on to another book. The main negative response you're likely to get to your work is indifference rather than hate, which is much less unpleasant. ",
            "If I receive comment after comment telling me I suck I'd be thankful because It means I can improve. **For free!** I want harsh criticism. I crave it! It’s not usually free. That’s why writers hire beta readers and editors. Multiple harsh criticisms would make my fucking day.\n\nWhat is fear?",
            "Criticism is a good thing. It’ll help you improve as a writer. And even then, you still might write something that isn’t good. We can’t bat 1.000.\n\nI got my first story published earlier this month, to positive feedback (that I know about). Then I wrote a first draft of a story that I felt stunk. So I put it aside and recently started a new story and after being 3 pages in I feel it’s better than the previous.\n\nLife of a writer. Keep writing. Get feedback. Not everything we write is going to be good (much like this comment; I don’t think it’s a very good comment).",
            "Reviewer: you have to be the worst writer I've heard of.\n\nMe: but you have heard of me!\n\nFinally, I did it!"
        ]
    }
}