{
    "Before posting please read this first!": {
        "title": "Before posting please read this first!",
        "score": 324,
        "url": "https://www.reddit.com/r/WRX/comments/u4bs1g/before_posting_please_read_this_first/",
        "content": "[READ THE SUB FAQ FIRST](https://docs.google.com/document/d/1GAdasbv3cjWISHfim1hBfqUyU_-gRqe9IKa2N8HuwkQ/edit). 90% of the repetitive questions we see on this sub are answered there. Even if you don't have an issue covered in the sub FAQ it will likely help you narrow down your question. If you have a question you think should be added to the sub FAQ feel free to message any of the authors of the FAQ.\n\nIf you are troubleshooting, give us all the info we need. For example, it's best to include your year/model, any AND ALL mods, and the specific tune you are running. The more info we have, the better we are at answering questions. We also ask you try to post the question/info in the comments below before posting to the sub as a whole. This will hopefully clean up some of the really repetitive questions.\n\nA few common posts/questions we see everyday.\n\nDoes my engine sound okay? \n\n* 99% of the time the answer is yes. The fa20 sounds like a tractor. It is normal.\n\nAre these numbers on the COBB AP normal? \n\n* A snapshot of your AP with the DAM less than one doesn't actually tell us anything about what is going on. All it tells us is that you had a knock event that your ECU recognized and adjusted for. The most common cause for DAM drop is bad gas. Go get a fresh tank of 93/91 from shell and add a gallon or two of e85 for a full tank. I would also like to point out that knock numbers of -1.41 are super common. They can be caused by your AC kicking on and any other noise really. nothing to worry about.\n\nThis thing on the front of my engine is not spinning with the belts, is it broken? \n\n* That is your AC compressor clutch. It only engages when the AC is on and the compressor is running.\n\nLet me know if you guys want any other common questions added.",
        "num_comments": 1580,
        "comments": [
            "The FAQ seems to only cover the 2015+ generation.  Is there a similar one for older gens?",
            "One thing I’ve personally considered doing is writing up some info about lifting a VA. I have answered questions about this for a long time on here and on IG, and it seems like a never ending supply of the same couple questions (what parts do you use, what wheels, how to fit 15” wheels on VAs).",
            "How bad is the CVT on the 22 Wrx?\n\nI’m in between the integra a spec and Wrx limited or GT\n\nI blew my leg off while serving at the pleasure, so manual isn’t an option",
            "Is it realistic to find a reliable sub $20k WRX? \n\nIn short I’m coming from an AT GR86, Carvana sent a pretty ridiculous offer and I’d like to have a little more spacious car that’s still fun to drive. I mainly drive for leisure since I work remotely and of course I’m very open to learning manual.",
            "Took my car (2014 wrx hatch) to my local subaru dealership and they were going to change my clutch cause I had a grinding in 3rd gear and they found a bolt that had been snapped where the transmission and engine block meet, a previous shop had sanded the bolt down flush with the motor and overtime the bolt has become one with the motor and the dealership told me they've tried everything and can't get it out, I still owe 19k on this car + about 5k in repairs from a cracked flywheel and rusted hubs and some other crazy stuff they found. Anyways they're telling me I might have to get a new long block if they can't get said bolt out, what should I do?",
            "Can I post here?",
            "https://preview.redd.it/e9mmhyc1g7pb1.jpeg?width=2233&format=pjpg&auto=webp&s=16984c9e67684a22edd2605164633d4b816d005f\n\nI think I’m in love",
            "Idk if anyone has this problem but when I am driving without AC, my car is fine with no issues. But when I turn on the AC I get a hesitation in acceleration just for a second or two. I turn the AC off and it goes away. When the AC is on I get good cool air. I have also noticed the rpm going up when idle with the AC on. (I have a 2017 Wrx).",
            "Just bought a 2016 WRX limited with fairly low miles. Anyone have any experience with wrx lifts? Im thinking about raising it up 1-2 inches but im unsure. The reason is I go camping and some of the roads I would prefer having an extra inch or two of ground clearance on.",
            "It seems like there's a ton of \"I just bought this car, what is this part?\" type questions lately. We're happy to help you troubleshoot, but please please, I beg you, do the research BEFORE you buy the car, not after."
        ]
    },
    "Gotta keep the wrx at number 1 for speeding tickets ": {
        "title": "Gotta keep the wrx at number 1 for speeding tickets ",
        "score": 212,
        "url": "https://i.redd.it/79cpqrhxpe9d1.jpeg",
        "content": "",
        "num_comments": 82,
        "comments": [
            "https://preview.redd.it/jbuoceotte9d1.jpeg?width=3000&format=pjpg&auto=webp&s=5e19004efecec48620e6732506e38951ca137237\n\nThey after the rexys this week for sure it seems 🤣",
            "Didn't get a ticket lol",
            "Honestly suprised I haven't been pulled over yet",
            "The ONLY car that ever landed me a speeding ticket and numerous 20% tint tickets was my WRX. I get away with so much more with my other cars.",
            "Glad to see you are doing your part.\n\nWait....<OP posts didn't get a ticket>  Well, you get your butt right back out there and break some more laws!  This time tell the cop they're a stupid face so they won't be nice to you.",
            "https://preview.redd.it/817phyv49f9d1.jpeg?width=3024&format=pjpg&auto=webp&s=2918b8553f2f3ea9c3062ace4ae1a0eea9f1eb1e\n\nRight there with yah 😭😭",
            "*mf speeds* \n\nlooks like they’re after us for speeding lol xD",
            "Yeah buds I don’t think being #1 for speeding tickets is a legit thing, dial it back a little yeah? Painting the rest of us Subie drivers with a bad rep.",
            "4 years strong now and haven't even been pulled over, and there are a lot of WRX shenanigans that go on around here. Not sure why/how I've been so lucky.",
            "Valentine V1 and a family pba card usually help"
        ]
    },
    "Go with MQQN": {
        "title": "Go with MQQN",
        "score": 44,
        "url": "https://www.reddit.com/gallery/1dr06kq",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Wheel specs?",
            "Fucking clean and mean. Not overdone! Seriously great work",
            "I do agree I wish there was no front plate but most states force to you have a front facing so not really their fault. Car is still 10/10 even with it though.",
            "Look killer",
            "What camera did you take this with and where? These shots have a super cool vibe.",
            "fix the front plate and it’ll be a 10/10"
        ]
    },
    "Just hit 15k in this beaut": {
        "title": "Just hit 15k in this beaut",
        "score": 77,
        "url": "https://www.reddit.com/gallery/1dqtugf",
        "content": "2020 WRX",
        "num_comments": 10,
        "comments": [
            "Soupbruh",
            "Wheel and suspension specs?",
            "Hell yeah buddy! Congrats, my 2020 just hit 30,000 and I thought I had low miles 😉. Any issues yet? I'm chasing a cold start misfire that's throwing CEL.",
            "HRE’s?",
            "Headlights model  ?",
            "Enkei RS05RR 18x9.5 offset 35 it’s on F-Spec coilovers",
            "Just coilovers",
            "Thanks man! Nothing so far and hopefully nothing for a long time",
            "LCAs too? Or just the coilovers. Asking because I’m about to buy the same wheels",
            "Did you roll the fenders or did you leave enough clearance? Probably the best looking stance I’ve seen in a while."
        ]
    },
    "Sunrise with my girl": {
        "title": "Sunrise with my girl",
        "score": 13,
        "url": "https://i.redd.it/730dufp4of9d1.jpeg",
        "content": "Wife- where are you going it’s early?\n\nMe- you know where, wanna come with me?\n\nWife- see ya later, drive safe\n\n\nShe’s gets me , best of both worlds \n",
        "num_comments": 9,
        "comments": [
            "https://preview.redd.it/4dd8melcsf9d1.jpeg?width=3024&format=pjpg&auto=webp&s=807d9536ba6a62eab6327b858806332e1d4bb82c",
            "Very nice, bug eye?",
            "MONTEGEY RACING MR147 MATT BRONZE\n\nStraight from the receipt man haha only 2 weeks old the car",
            "In my area I hardly ever see a blue Hawkeye it’s always black or white",
            "Hawkeye my man",
            "Yeah so I’m from Australia and most of the rally blue ones in Hawkeye or blob have been heavily modded for track or ridden off. This one I’ve had for a little while now and picked up off a guy who didn’t use it much. Now I’m in the process of bringing it back to its former glory days but mate not a cheap hobby",
            "Ahhh I see it now from the tail lights, lookin clean, what rims are those?",
            "That’s pretty much the same story of me and my 02, but only the kid that had it previously abused it  unfortunately. A lot of the older ones are in a junkyard for like you said the mods and the track or just abuse. I like to think I’m saving mine giving it a better home, like taking in a shelter dog lmao",
            "Hahaha,\nLiterally man!!!\n\nI’ve owned a few jdm cars man, but the wrx has something special about it, I know you can pull shit tonnes of power out of it but it’s jus the actual car itself and the AWD into corners I love, how they come on boost etc.\n\n\nHave you owned any other jdm cars?"
        ]
    }
}