{
    "WWE SmackDown Discussion (28 June 2024)": {
        "title": "WWE SmackDown Discussion (28 June 2024)",
        "score": 31,
        "url": "https://www.reddit.com/r/WWE/comments/1dqq8at/wwe_smackdown_discussion_28_june_2024/",
        "content": "#WWE SmackDown\n\n**Bloodline Acknowledgment Ceremony set for Madison Square Garden**\n\n*One week after Jacob Fatu made his earth-shattering arrival to WWE and Solo Sikoa claimed that Roman Reigns will not be returning, a Bloodline Acknowledgment Ceremony is coming to The World's Most Famous Arena.  Can anyone stop Solo's rise to power? SmackDown returns to Madison Square Garden tonight at 8/7 C on FOX.*",
        "num_comments": 1902,
        "comments": [
            "Honestly have to say that Paul Heyman is the GOAT and an absolutely master of his craft. The red bloodshot eyes, the stubble and portraying the fear so perfectly, and he does it week after week without fail. It’s no wonder he’s a HOFer",
            "So a security guard just gave one of the best Cross Rhodes sells…",
            "Randy's body language when Cody said he should be defending his title 👀",
            "NO WAY HES TAKING A BUMP FROM THE TOP ROPE IN HIS 60S LMFAOO",
            "Paul is a fucking champ for agreeing to take those bumps, like when the dudley boys put mae young through the table",
            "God I hope we get a promo of Heyman going to visit Roman in a cave somewhere, Apocalypse Now style. Imagine Roman just squeezing a rag of water over his head lmao",
            "[deleted]",
            "I secretly wish this is a way to give Paul some time off, and then when he returns, it's because he's addressing the crowd to introduce his tribal chief.",
            "*screen cuts to black*\n\n#HEY GUYS MAVEN HERE",
            "It amazes me that this is the thing that gets the police called because Randy orton once set a man on fire"
        ]
    },
    "Kayla Broxton's final WWE appearance is tonight": {
        "title": "Kayla Broxton's final WWE appearance is tonight",
        "score": 134,
        "url": "https://i.redd.it/nrhm7nqevd9d1.jpeg",
        "content": "",
        "num_comments": 19,
        "comments": [
            "Hopefully she and Paul get a segment together ",
            "Gonna miss her. Always looked forward to her every SmackDown. 😭",
            "*Extreme Billie Kay voice* “HEY KAYLA GOOD LUCK” 🫡",
            "So what she doing next",
            "They could have given her a sendoff. Seems kinda rude they didn't even say goodbye to her on air.",
            "[removed]",
            "I don't get why the porn comments are getting down voted but that's what she should do next",
            "[removed]",
            "[removed]",
            "[removed]"
        ]
    },
    "Vote For Damian Priest ": {
        "title": "Vote For Damian Priest ",
        "score": 108,
        "url": "https://i.redd.it/0wnmh0mbnd9d1.jpeg",
        "content": "",
        "num_comments": 14,
        "comments": [
            "After that debate I’d vote for fucking JD McDonagh over our only choices.",
            "every time he's getting out negotiated at the G7 Finn comes in and Coup de Graces the other world leaders",
            "R-Truth for president?!",
            "I'd watch Damian Priest in a debate just to hear all the 'Look,' 'Real talk,' 'I get it', and 'Respect' supercut compilations that would come from it.",
            "now i'd love to see Priest try to outpromo Trump and Biden.",
            "\"I'm not talking till everyone rises\"",
            "It should say make Live ride again.",
            "You got it Mr. President",
            "Got my vote! I don't even know Damien's platform, but I do know that he worked for what he has and he's not from Scranton 50 million years ago when people talked around dinner tables.",
            "Honest to god better than our current candidates"
        ]
    },
    "Which wrestlers just look wrong with certain titles?": {
        "title": "Which wrestlers just look wrong with certain titles?",
        "score": 1351,
        "url": "https://i.redd.it/6r4ol56om89d1.jpeg",
        "content": "",
        "num_comments": 590,
        "comments": [
            "https://preview.redd.it/7dn51yxfr89d1.jpeg?width=554&format=pjpg&auto=webp&s=93b76d4ba4fc4217ca9bd6a3e48a2c9afd9c98f9\n\nDoes this count?",
            "Kane as ECW Champion\n\nhttps://preview.redd.it/5wc7zxdme99d1.jpeg?width=480&format=pjpg&auto=webp&s=a58f298f48d47194e99bfa2559256a6daadb0648",
            "Randy doesn’t look bad with the US title. It was just random for him to win it.",
            "https://preview.redd.it/3gs6olgbv89d1.jpeg?width=1200&format=pjpg&auto=webp&s=d3f7b1b31b579fdf77d5ea642c189d4ac0eeda31",
            "https://preview.redd.it/j4wx29lcw89d1.jpeg?width=258&format=pjpg&auto=webp&s=d91be84c0c18d866b81da3105814ff00f1ca836a",
            "https://preview.redd.it/81rc300gxa9d1.png?width=542&format=png&auto=webp&s=3164c31031f411d250df8a2fdb26ed418e888009",
            "https://preview.redd.it/o6l32822x89d1.jpeg?width=318&format=pjpg&auto=webp&s=c0ad77e90bf66b84eba1d7620c0856c02b6348a4",
            "https://preview.redd.it/ao59yo6c9a9d1.jpeg?width=1200&format=pjpg&auto=webp&s=b1ab46184b2eb660ae457f7bd1768407848ca272",
            "every title on big show looks likes he’s holding a kids replica",
            "John Cena with any Tag title."
        ]
    },
    "TONIGHT ON FRIDAY NIGHT SMACKDOWN! Live from a massive 17k in NYC": {
        "title": "TONIGHT ON FRIDAY NIGHT SMACKDOWN! Live from a massive 17k in NYC",
        "score": 221,
        "url": "https://www.reddit.com/gallery/1dqjwa3",
        "content": "",
        "num_comments": 170,
        "comments": [
            "Why does Blair Davenport look like the Undertaker?",
            "I ain’t acknowledging shit beyond Mr. Heyman needing to GTFO of the bloodline asap. Dude looks scared for his life. 😅",
            "I think the Bloodline segment would be a good place for Jimmy to return",
            "https://preview.redd.it/5nglgvjxcc9d1.jpeg?width=278&format=pjpg&auto=webp&s=759e35240db56d542498df618d61a58f8990a815",
            "Give Chelsea Green Cody’s title. Let her cash in on him.",
            "https://preview.redd.it/u03ebuz9rd9d1.jpeg?width=1242&format=pjpg&auto=webp&s=6d4b8fe6d9ef4d0be5e6951261a1587ed7bacd7d\n\nthey gone done homegirl dirty 😂",
            "Everybody cut foot Uce!  \n\n![gif](giphy|3s4mqPnNLwiv9SMAm0|downsized)",
            "Fatu looks photoshopped into his body lol",
            "Do i believe Roman shows up? Possibly in a via satellite segment but i firmly believe that they will have the rock show up just for the pop in msg",
            "Logan wrestling with LA Knight on free tv?"
        ]
    }
}