{
    "Game Club - Vote for July's game": {
        "title": "Game Club - Vote for July's game",
        "score": 9,
        "url": "https://www.reddit.com/r/XboxGamePass/comments/1dgo8h6/game_club_vote_for_julys_game/",
        "content": "Our partners at r/GamePassGameClub have their nominations open for next months game. Please give them a visit and take part in sharing your experiences with other community members.\n\n[https://www.reddit.com/r/GamePassGameClub/comments/1dgkkax/looking\\_for\\_suggestions\\_for\\_previous\\_runner\\_ups/](https://www.reddit.com/r/GamePassGameClub/comments/1dgkkax/looking_for_suggestions_for_previous_runner_ups/)",
        "num_comments": 0,
        "comments": []
    },
    "What have you played? w/c Mon 24 Jun, 2024": {
        "title": "What have you played? w/c Mon 24 Jun, 2024",
        "score": 6,
        "url": "https://www.reddit.com/r/XboxGamePass/comments/1dn00b9/what_have_you_played_wc_mon_24_jun_2024/",
        "content": "A new week, a new chance to share and chat about what you have been playing.\n\nPlease still use the \"Games - Recommendation\" flair if you want to ask for or mention individual games/genres.",
        "num_comments": 22,
        "comments": [
            "Started playing Still Wakes The Deep. Its amazing so far",
            "Finished The Castillo Protocol. Still have Hardcore and hardcore ng+ to finish. Wife finished Frigment 1 and 2. Short games but those two are some great ones. Love the art style of them. \n\nWe might start Still Wakes The Deep this week.",
            "Started Resident Evil 2 on Hardcore difficulty. I don't get spooked easily, but Mr. X has made me scream more than once so far, lol",
            "Playing Sword and Fairy. Never played a game like that before and it is pretty cool, but I am never going to get it finished before it leaves. I always try and complete games that look interesting when they are about to leave, but quite a few I never manage. It does make me try things I wouldn't otherwise.\n\nReally wish we had at least an extra week's notice.",
            "Nothing I don't have game pass ultimate ",
            "GRIS. I mean, it's a very nice artistic game but I'm finding it a little slow for my liking. Might move on to Dead Space remake.",
            "Callisto Protocol - Finished it and its not perfect but definitely not a \"bad\" game. \n\nMy time in Sandrock - aside from the Crash to Desktop which took me hours and the fix is DDU and Driver installation . It has the same charm i missed on Farming SIm games like Harvest Moon\\Rune factory and Portia",
            "Lonely Mountains Downhill.\n\nI really thought it was gonna be relaxing.",
            "**Humanity** was an outstanding surprise for me. Absolutely loved all but a few moments of its campaign. **9/10 Masterpiece**",
            "Control. Gameplay is fun, the story and atmosphere is to be expected of Remedy, Awesomely intriguing with a little bit of horror and im all for it! i just finished the main story and am now taking a break before going back in with their 2 DLC's. If you love Science fiction, Psychological horror, and action, then you'll have a blast. (Having Played Alan wake and quantum break also adds to the story)"
        ]
    },
    "Neon White might finally be coming to gamepass ": {
        "title": "Neon White might finally be coming to gamepass ",
        "score": 52,
        "url": "https://www.trueachievements.com/news/neon-white-xbox-game-pass",
        "content": "",
        "num_comments": 15,
        "comments": [
            "How is \"might come....\"'news worth enough to write a whole article about this?\n\nI might win the lottery tomorrow",
            "Fuckin finally, I thought that the deal was cancelled since the thing that happened with Steam World Dig (I guess that's it) devs.",
            "Was almost about to buy it, thank god",
            "Nice, I wanted to play this but wasn't spending 20 bucks on it",
            "how the fuck do you play on a gamepad, with no motion controls too boot?",
            "I saw Maka91 playing it yesterday so it's definitely imminent",
            "Can you see if the game pass get both of the forest",
            "Read it plz. There is a whole store listing and achievements and everything",
            "what happened with steamworld devs ? both SD1 and 2 have been added recently and they were part of gp before too If I'm not wrong.",
            "they've probably meant sons of th forest"
        ]
    },
    "I’m honestly have a great time with this game": {
        "title": "I’m honestly have a great time with this game",
        "score": 17,
        "url": "https://v.redd.it/xv2sc3quxf9d1",
        "content": "Gotta get these rats out of my hood! Lots of mixed reviews on this and they are granted but I’m enjoying this!\n\nGame: Robin Hood Sherwood Builders",
        "num_comments": 8,
        "comments": [
            "Can't tell if this is a satire or not, lol",
            "I am e few hours in and It's a fun game. Just play it on PC, the xbox port was done by a studio who doesn't know how a gamepad works.",
            "Walk me trough the gameplay loop. Is it just a survival builder or has something else?",
            "I tried it on mobile via Cloud and could barely see the UI text. I couldn't find an option to make it bigger. Why do developers insist on tiny writing?",
            "lol. I played for 8 hours on my night off yesterday",
            "Congratulations",
            "Thanks lol.",
            "I only have an Xbox x. But yeah the whole mouse dragging and not having the prompt already on the button for its port is wild to me. Theres a lot but going in without expectations Im having a great time. Glad youre enjoying it as well. Im honestly wondering if this going on game pass would help for a sequel with a bigger budget because that would be something to be interested in."
        ]
    },
    "Xboxgamepass": {
        "title": "Xboxgamepass",
        "score": 2,
        "url": "https://www.reddit.com/r/XboxGamePass/comments/1drbcbn/xboxgamepass/",
        "content": "I am new to xbox gamepass stuff and I am thinking of buying the subscription but i am not confident enough as will I be able to get most out  of it and I too have few queires like will I be able to play fc24 jedi survivor dead space etc if I buy the normal xbox gamepass for pc...\nAnd also if someone have a free redeem code..it will be much appreciated.",
        "num_comments": 1,
        "comments": [
            "Go to your country's Gamepass page and check the list of games. If FC 24 and Jedi Survivor are on that list, you can play them on Gamepass. You might have to filter for console Gamepass games and PC Gamepass games because I *think* they are different.\n\nNo code to give but try it for 1 month, download a bunch of games, play them and see if you like having the service. Good luck."
        ]
    }
}