{
    "Hi! We’re The Chinese Room, join the AMA about our new Narrative Horror game Still Wakes the Deep that we just released!": {
        "title": "Hi! We’re The Chinese Room, join the AMA about our new Narrative Horror game Still Wakes the Deep that we just released!",
        "score": 226,
        "url": "https://www.reddit.com/r/xbox/comments/1dk9p3n/hi_were_the_chinese_room_join_the_ama_about_our/",
        "content": "Hello r/Xbox! We are The Chinese Room, a game studio based in Brighton, UK. We love making narrative focused games and are excited to talk about our new game today. \n\nhttps://preview.redd.it/o6eo2742tp7d1.png?width=600&format=png&auto=webp&s=6428fe619cd970a67e49ee03c02e1aaee5316893\n\nRelease Trailer – [Still Wakes the Deep - Trailer | PC Gaming Show 2024 (youtube.com)](https://www.youtube.com/watch?v=3svNksUg_BM) \n\nAbout: \"STILL WAKES THE DEEP is a return to the first-person narrative horror genre for The Chinese Room, creator of critically acclaimed games such as Amnesia: A Machine for Pigs, Everybody’s Gone to the Rapture, and Dear Esther.   \n   \nYou are an offshore oil rig worker, fighting for your life through a vicious storm, perilous surroundings, and the dark, freezing North Sea waters. All lines of communication have been severed. All exits are gone. All that remains is to face the unknowable horror that’s come aboard.” \n\nWe’re here to celebrate the launch and answer any questions you have about it. \n\nWith us today are:   \nRob McLachlan – Lead Designer, replying as u/CmdrKerans \n\nLaura Dodds – Associate Art Director \n\nNick Slaven – Studio Technical Director \n\nLouis Larsson-De Wet – Project Technical Director \n\nFraser Colley – Lead Animator \n\nPossibly some other members of the team will drop in too. \n\nWe’ll be answering questions from 3pm – 5pm BST today, so post them below! \n\nGame: Still Wakes the Deep   \nDev: The Chinese Room   \nGenre: Narrative Horror   \nPlayers: Single   \nPlatforms: Xbox X and S, Xbox Game Pass, PC Game Pass, Steam, Epic Store, PS5  \n\nFollow us on [TikTok](https://www.tiktok.com/@the_chinese_room), [X (Twitter)](https://twitter.com/ChineseRoom), [SubReddit](https://www.reddit.com/r/TheChineseRoom) \n\n[Buy Still Wakes the Deep | Xbox](https://www.xbox.com/en-US/games/store/still-wakes-the-deep/9n88dfrx8wcj) \n\nEdit: Thank you everyone for the questions!  \nIf you're interested in more info about how the game was made then we've done a series of mini-documentaries focusing on different departments:  \n[QA and Production](https://www.youtube.com/watch?v=wsrwc6IM8EU), [Story and Voice Acting](https://www.youtube.com/watch?v=yuvVm2w49GA), [Music](https://www.youtube.com/watch?v=KzbC4Sqvdn4), [Design](https://www.youtube.com/watch?v=4_e8QEmdCXY), [Sound Effects](https://www.youtube.com/watch?v=MntLYq5Kq1I), [Coding](https://www.youtube.com/watch?v=WHLrVmaZ_A4), [Art and Research](https://www.youtube.com/watch?v=KT0XrXtszOg)",
        "num_comments": 115,
        "comments": [
            "That's a wrap folks. A huge thanks to everyone at The Chinese Room for making time for our community during launch week. 👍\n\nYou can check out [Still Wakes the Deep](https://www.xbox.com/en-US/games/store/still-wakes-the-deep/9n88dfrx8wcj) on Game Pass, or purchase it on the Xbox Store and a variety of other platforms. Please be sure to support the devs however you can by wish-listing, leaving a review and dropping them a follow on their socials.",
            "Is this truly the most Scottish game ever made?",
            "Just finished the game last night! Had me and my partner in tears by the end! One question I’ve been meaning to ask is what inspired you for the monster designs? I feel like “The Thing” was a big inspiration for you guys",
            "I’ve got no questions, just wanted to congratulate you on the release. loving the game so far!",
            "Why are you called the Chinese Room?",
            "Hi, I love the game. Do you guys have any plans for DLC or anything like that?",
            "Hi - I don't really have a question, I just want to say thank you for including Scottish Gaidhlig as one of the language options - this means a lot to us. Thoroughly enjoying the game.",
            "Alrighty! We're here. :)  \n  \nHuge thanks for everyone's love for \"Still Wakes the Deep\" - it's been a wonderful couple of days reading everyone's reactions. <3\n\nSome team members are already prepping some answers - fire away, we'll try answer as many as we can!",
            "Great game!",
            "Hi, Mar is here, first i want to say thank you for making a best game of the year for me, I love how you could made everyone in the story, rootable, Caz is the great flaw character and hope you will have a success after released the game\n\nQuestion 1: Why we don't know what a \"DEEP\" is, it's lovecraftian or something you want to represent as unknown things is so terrified?\n\nQuestion 2: How did you named this game with a much context as STILL WAKES THE DEEP, i mean it's a great name that show how deep the game was.\n\n  \nI wish we will saw Caz's face before ending, but I guess that's up to Our interpret.\n\nThank you!"
        ]
    },
    "IO Interactive's mission to speed up game development: The Hitman developer discusses the advantages of running its own tech and how it's looking to make games 'cheaper, faster and better'": {
        "title": "IO Interactive's mission to speed up game development: The Hitman developer discusses the advantages of running its own tech and how it's looking to make games 'cheaper, faster and better'",
        "score": 26,
        "url": "https://www.gamesindustry.biz/io-interactives-mission-to-speed-up-game-development-gi-sprint",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Honestly I'm all for it, as long as they don't cost cut so much that quality clearly suffers for it.\n\n\nWe're at the point where sequels/continuations to big games take half a decade + to relase. \n\n\n- Halo 5 - Infinite was 6 years.\n- Gears 5 - Eday is already at 5 years and will likely be six.\n- Bethesda took 8 years after Fallout 4 to release Starfield.\n- We just got Hellblade's sequel after 7 years.\n- We're going to get GTA 6 12 years after GTA 5 and 7 years after Red Dead 2.\n\n\nNow granted, COVID fucked a lot of shit up and we're finally turning the corner from it, but back in the day I remember playing games and their sequels would be out within a year or two, with 3 years usually being reserved for hardware transitions.\n\n\n- Halo 2 - 3 was 3 years. The trilogy released over 6 years and we had ODST and Reach before the end of 2009\n\n\n- The Original Jak and Daxter trilogy was released from 2001-2004\n\n\n- the Sly Cooper trilogy released from 2002-2005\n\n\n- Morrowind, Oblivion, Fallout 4, and Skyrim all released in a 9 year gap (2002-2011), just shy of how long it took us to get Starfield.\n\n\n- GTA 4 released in 2008 and Red Dead Redemption in 2010. Both games also received substantial DLC's before GTA 5 released in 2013...\n\n\n- From Soft released Dark Souls 1, 2, and 3 from 2011-2016, with Bloodborne also releasing in that timeframe, with every game getting DLC.\n\n\n-  After Dark Souls was done we got Sekiro in 2019, Elden Ring in 2022, and Armored Core in 2023.\n\n\nThe scope creep and dev times on a lot of games are out of hand. I'm all for supporting the creative process, but when devs like From Soft have put out 7 critically acclaimed games in 12 years and just released a game sized expansion to Elden Ring, which is now the highest rated expansion to a game **ever** in the 13th year since Dark souls 1 and in that time we've gotten like 3 games each from exclusive properties it's just getting ridiculous.",
            "2 years for the Elden Ring expansion is still too much, The Witcher 3 or Skyrim delivered equally big expansions much faster.\n\nPlus From Software is a bad example because their games are 90% just copy & paste from previous titles, half the enemies in Elden Ring are ripped from Dark Souls and Bloodborne complete with the same move sets and sounds. There is the same door opening animation since DS1. Of course they can make games faster that way when they barely improve.",
            "Don't forget a lot of games have an artificial wait time because of the online service games that are propped forward to be money makers. I'm convinced the only reason they made Starfield was because Bethesda wanted to make a new game that wouldn't tank Elder Scrolls Online or Fallout 76. GTA5... nuff said, GTA online prints money and is way cheaper to maintain instead of jumping straight into GTA6.\n\n\nAll of those older games you mentioned didn't have that variable to consider. They only made their money the first couple weeks of release then the used game market would gobble it up. It's no wonder they dive directly into making the next game.",
            "Hellblade 2 is such a joke. Mind you it's one of the most beautiful games out there and without a doubt the animation quality is baffling. It feel unreal at a point at how realistic the overall movements of characters can be.\n\nBut in the end its like a glorified tech demo than a game.",
            "They are reusing some animations and maybe few enemies but it no where near as you exaggerate to be. They also do fully new map, art, great number of enemies, new lore and so on. FromSoftware develops games quickly because they don’t do tons of mocap, voice recording etc. Also they really don’t care about optimization too.",
            "> They are reusing some animations and maybe few enemies but it no where near as you exaggerate to be.\n\nIt is, especially considering the game was in developement since 2016. \n\n[Watch this comparison and come back telling me the game isn't just a Dark Souls 4 with open world](https://youtu.be/SkaWgiXjWHg?si=PpNVcvNY_OjH6NPE&t=101)"
        ]
    },
    "The Witcher 3: \"Blood and Wine had the honor of being the best reviewed expansion for an RPG - but Elden Ring gets to wear that crown now. Congratulations to the entire team at From Software\"": {
        "title": "The Witcher 3: \"Blood and Wine had the honor of being the best reviewed expansion for an RPG - but Elden Ring gets to wear that crown now. Congratulations to the entire team at From Software\"",
        "score": 164,
        "url": "https://x.com/witchergame/status/1804130615060484165",
        "content": "",
        "num_comments": 22,
        "comments": [
            "Elden ring also beat TLOU2 as the most GOTY awarded game of all time worldwide, amazing feat since TLOU2 got like 320 GOTY awards.",
            "While Elden Ring is generally receives 90+ scores from critics, user scores tend to be a little lower whereas Witcher 3's user scores are more in line with critics's verdicts.\n\nI'm not saying Witcher 3 is the better game, I'm just saying that Elden Ring seems a litte more polarizing. Either you love it or you hate it. Fore me personally Witcher 3 is a much more accessible game. I just couldn't get into Elden Ring. Maybe I should try the expansion?",
            "Shadow of the Erdtree is exciting, no doubt. Elden Ring was incredible. \n\nBut man… I just don’t think an expansion will ever top Phantom Liberty for me. Ever since I finished Cyberpunk just nothing has held my interest.",
            "King recognizes king. Respects to both and what an achievement FromSoftware has accomplished",
            "New Vegas DLC, \"fuck me i guess\"",
            "In my world , Wolfenstein Old Blood is the greatest dlc/expansion to have ever been crafted. ",
            "Yeah I think this blows anything Witcher related out of the water.",
            "What the fuck 320?",
            "Witcher is more accessible over Elden Ring. I daresay that accessibility will be what tips it for user scores.\n\nElden Ring has no difficulty setting them make it easier, and the story/lore is fragmented (deliberately so) and hidden behind a lot of findable items.",
            "Well, to get to the Elden ring expansion you have to beat most of the game unless you know exactly what to do. If you’re very good at the game you can get in after like 10 mins of starting."
        ]
    },
    "'Black Myth: Wukong' is delayed on Xbox for 'optimizations' — and now, Microsoft has responded \"We can't comment on the deals made by our partners with other platform holders\"": {
        "title": "'Black Myth: Wukong' is delayed on Xbox for 'optimizations' — and now, Microsoft has responded \"We can't comment on the deals made by our partners with other platform holders\"",
        "score": 654,
        "url": "https://www.windowscentral.com/gaming/hotly-anticipated-black-myth-wukong-is-delayed-on-xbox-for-optimizations-and-now-microsoft-has-responded",
        "content": "",
        "num_comments": 695,
        "comments": [
            "If this is some last minute secret exclusivity deal instead of issues with bringing it for Series S that a ton of people speculated about, that would be a pretty scummy thing to do from the developer. At least be up front about it, and say it as the developer or publisher.",
            "I think we are going to need some verbatim context for the question asked here.\n\nThe reporter may have outright asked: \"What happened with Black Myth. Is there some sort of exclusivity deal with Playstation.\"\n\nAnd technically this sums that up:\n\nI asked both Microsoft and Game Science to comment on the \"optimizations\" issue, seeking some clarity. Was the Xbox Series S to blame? Game Science didn't respond, but this morning, a Microsoft spokesperson offered the below statement.\n \nAnd also who responded from Microsoft. A \"spokesperson\" whomever that is.\n\nNot saying there might not be a deal in place but it could just as easily them trying to ship a game to meet a investor demand and don't have the manpower to dev the Series S version right now. There is a lot of wiggle room to make this click-baity.",
            "Console war bait",
            "Since when has PlayStation ever not admitted to something being a timed exclusive? This statement seems awfully fishy to me",
            "It's odd for so many reasons.\n\nIf it's a time-limited exclusive deal, why not make a statement about it ? Same thing goes with the Series S parity, if there are some issues you can be clear about it just like Larian did with BG3.",
            "Lol the other platform holders aren't mandating it works on an inferior console. Why would Sony want to hide that they have exclusivity on one of the more anticipated games of 2024? I'm sure Sony would have said something by now",
            "Wow everyone is really falling for this. Microsoft didn't say there was a deal, and we don't even know the exact question that was asked by Jez. But just like that everyone is a conspiracy theorist...if Sony had a deal why would Microsoft know and why would they not directly confirm it exists?",
            "I don't buy it. If Sony did this WE'D KNOW LOL. They would not have had that weak ass State of Play with this card in their hand",
            "Really starting to feel gaslit by this subreddit. Did y'all not experience the last 2 years of Xbox history? \n\nSuddenly the line is that it can't *possibly* be the Series S that is causing issues, because the Series S has *never* caused issues, it is *just* as powerful as the Series X. In fact, probably *more* powerful. Developers probably love developing for the Series S more than any other platform, actually.\n\nN-no, not that, it's gotta be a... a secret exclusivity deal! Yeah, that's it! Not our Series S! Couldn’t be the precious Series S!",
            "I would trade Wukong for Marvel vs Capcom 2"
        ]
    },
    "Embracer Studio Was Working on a Brand New Red Faction Game Before Layoffs": {
        "title": "Embracer Studio Was Working on a Brand New Red Faction Game Before Layoffs",
        "score": 230,
        "url": "https://www.ign.com/articles/embracer-studio-was-working-on-a-brand-new-red-faction-game-before-layoffs",
        "content": "",
        "num_comments": 45,
        "comments": [
            "God dammit",
            "Thanks Embracer",
            "Does embracer produce anything ?! What value do they add to the gaming industry. All they do is buy ips and developers and then do layoffs and squat on the ips. Smh.",
            "#All I feel is pain",
            "Fuck that would be epic on today’s hardware. Miss games like this and mercenaries from pandemic where it’s just a great fuck around environment. Just cause is still alive I guess.",
            "Embracer's self-destruction needs to be studied. I don't think I've ever seen a company chuck every egg possible into as uncertain of a basket just before it blew up in their face the way it happened to them",
            "I miss the red faction game from the ps2",
            "Embracer staked way to much on a contract with no plan b. Biggest clowns in the industry right now.",
            "From the studio that brought you Saints Row (2022).",
            "Babe, you just broke up with me just as I was about to start a gym membership."
        ]
    }
}