{
    "Game Club - Vote for July's game": {
        "title": "Game Club - Vote for July's game",
        "score": 8,
        "url": "https://www.reddit.com/r/XboxGamePass/comments/1dgo8h6/game_club_vote_for_julys_game/",
        "content": "Our partners at r/GamePassGameClub have their nominations open for next months game. Please give them a visit and take part in sharing your experiences with other community members.\n\n[https://www.reddit.com/r/GamePassGameClub/comments/1dgkkax/looking\\_for\\_suggestions\\_for\\_previous\\_runner\\_ups/](https://www.reddit.com/r/GamePassGameClub/comments/1dgkkax/looking_for_suggestions_for_previous_runner_ups/)",
        "num_comments": 0,
        "comments": []
    },
    "What’s a good long game I can play?": {
        "title": "What’s a good long game I can play?",
        "score": 29,
        "url": "https://www.reddit.com/r/XboxGamePass/comments/1dlnml0/whats_a_good_long_game_i_can_play/",
        "content": "I’m looking for a good quality long game that will take like 40+ hours. The games I usually play are survival rpg and story so should what Should I try?",
        "num_comments": 92,
        "comments": [
            "The Yakuza games are great and they can be fairly long.",
            "Fallout 4.",
            "Elder Scrolls games",
            "Yakuza / Like a Dragon games",
            "AC Odyssey",
            "I just started Starfield and really digging it.",
            "Will always recommend mass effect legendary edition to anyone who like a good RPG and story",
            "Lords of the fallen",
            "No Mans Sky",
            "Persona 3 Reload. Took me 100+ hours but seen some people finish it in 80"
        ]
    },
    "Looking for a game with quick missions or matches": {
        "title": "Looking for a game with quick missions or matches",
        "score": 7,
        "url": "https://www.reddit.com/r/XboxGamePass/comments/1dlu2so/looking_for_a_game_with_quick_missions_or_matches/",
        "content": "The preference is to play a game where I can spend 10-20 minutes on a mission and be done or if I’m feeling it to play a few of them and then stop. Minecraft dungeon has been great for this as well as things like Mario kart or Mario party mini games. I’m not looking for story, because I don’t want to dive into a story and either get hooked into playing too long or forgetting what was happening after a long break",
        "num_comments": 8,
        "comments": [
            "Depends if you are interested in rogue-likes, where runs usually take such time. Dead Cells or Slay the Spire might be a good examples.",
            "Aragami might be good for you",
            "Use the site \"how long to beat\" and it gives times for games and dlc's",
            "Chivalry 2 - a team objective map takes about 15-20 minutes. No story, easy controls, just swing your weapon and enjoy the chaos. \n\nBroforce - run n gun, side scrolling shooter. A lot of maps take maybe 5ish minutes.",
            "Try Overcooked 2! Short sessions, no story, and hilarious with friends or solo.",
            "Evil West.\n\nMight be a bit too much story for what you want but it's very linear and frequent checkpoints. Each level is essentially a series of arenas. Beat a load of dudes, move to next arena, checkpoint, beat a load of dudes etc etc.",
            "Boltgun scratched that itch for me. Simple, fun, no big commitment needed.\n\nI only played the first couple of levels but each of them was 10-20 min long",
            "Broforce, just play."
        ]
    },
    "Fun family games?": {
        "title": "Fun family games?",
        "score": 3,
        "url": "https://www.reddit.com/r/XboxGamePass/comments/1dlt25u/fun_family_games/",
        "content": "Looking for games that me and my son, who are gamers, can play with the wife who hasn't played a game in 15 years.\n\nSo something fairly easy to pick up that is either multi-player or that is fun to watch so we can take turns.\n\nIt doesn't have to be on gamepass but it is very convenient if it is.",
        "num_comments": 2,
        "comments": [
            "It takes two",
            "I would definitely recommend any of the Lego games! It is 2 player couch co-op, and there are tons of them out there, so you can get the game for whatever series you like! Star Wars, Marvel, Jurassic Park, Harry Potter Lord of the Rings, etc."
        ]
    },
    "What's up with all the non-gamepass game advertisements on the gamepass home screen?": {
        "title": "What's up with all the non-gamepass game advertisements on the gamepass home screen?",
        "score": 23,
        "url": "https://www.reddit.com/r/XboxGamePass/comments/1dli38o/whats_up_with_all_the_nongamepass_game/",
        "content": " For example when I open gamepass they have a big advert for the \"Game pass add-on sale\" but some of the games aren't even on gamepass, like hogwarts legacy, AC mirage, borderlands 3, ghost runner, farcry 4, midnight sun's, metal hellsinger, etc.\n\n Do they have plans to add those later or am I getting my hopes up for nothing?\n\n\nEdit: ESO actually is on gamepass but wasn't showing up when searching. My b.\n\n ",
        "num_comments": 9,
        "comments": [
            "The sale is exclusive to game pass subscribers hence the name",
            "It's because Xbox Live Gold has been renamed \"Gamepass Core\", so to access those sales, you need at least Gamepass Core for the discounts.",
            "Sometimes you get free add ons in your gamepass perks. Even for games not on gamepass. So you might get a free outfit or map for any game available on Xbox, even if the game isn't a gamepass freebie.\n\nAlso, technically all Xbox games are available on gamepass. They're all gamepass games, they're just not all free with gamepass.",
            "Probably because of ESO perks that you can claim as part of GPU",
            "They want to sell Xbox games. Shocking, right?",
            "They are just advertising hoping people will see a game they want and buy it. Not all that suprising. Its like asking why theres commercials on tv",
            "It’s a sale for people who have game pass and Xbox probably expects users to have non game pass games like me with ghostrunner but I get where you’re coming from I think it would be smarter to discount GP games dlcs in the sale more",
            "This is the answer. Used to be called “Deals with Gold” but they changed that in favor of confusing labels and every subscription being a form of gamepass. Honestly very on brand for Xbox",
            "This guy gets it. “What is up with the game pass ads for games Microsoft owns. “ it’s almost like the OP has never seen an ad"
        ]
    }
}