{
    "Welcome to /r/Xennials!": {
        "title": "Welcome to /r/Xennials!",
        "score": 355,
        "url": "https://www.reddit.com/r/Xennials/comments/o2xqdt/welcome_to_rxennials/",
        "content": "This subreddit is for the cuspers, those born too late to fit in with Gen X but too early to fully identify with Millennials. We share some traits with both generations but the primary idea is that due to our analog childhood and digital young adulthood, we don't truly belong to either of them. While there is some debate on what years are accepted as Xennial, for the purpose of this subreddit, we will use the generally adopted range of birth years between 1977 and 1983.\n\nA few guidelines for the subreddit: Reposts and/or blogspam will be removed at moderator discretion. Please keep conversation civil, no hate speech or unnecessary rudeness.\n\n----\n\nA quick note about the subreddit...Why am I posting this now? Well, because the subreddit now has an active moderator! The subreddit creator and sole mod has been inactive for quite some time and as a longtime subscriber here, I noticed that as the sub has grown, there has been an uptick in blogspam and reposts. I decided to request the sub via /r/redditrequest and that request was granted this morning. I have no intentions of making any major changes here because I really enjoy this community, I just want to help keep it a bit more clean of spammy type posts and hopefully help it grow!\n\nEdit: I've just enabled user flairs! I added Xennial years plus a few others, or you can edit your own.",
        "num_comments": 124,
        "comments": [
            "Hey! I was born the last week of 76...\nCan I hang with y'all? 😆",
            "About time that we get an active mod. Hello and welcome!",
            "man, i was born in 84, I'm even excluded from THIS group.",
            "1980!\n\nGrowing up, Gen X was CLEARLY people older than me.  Teen Spirit was on the radio when I was in fifth grade.  People who appeared much younger than me started identifying themselves as millennials when I was already in my 30’s.  \n\nI guess I’ve found a home now!",
            "I was born in mid 76 but being poor and from an extremely rural area, I seem to have experienced more things on the Xennial time scale.",
            "Awesome! Great of you to step up for the community!",
            "I was born in 85 but I relate so much more to the in-between than the Millenials.",
            "This is great news! Thanks for the update and congratulations!",
            "Hey wow I’m a Xennial!!!",
            "Thanks!"
        ]
    },
    "Say it ain’t so, Leon!": {
        "title": "Say it ain’t so, Leon!",
        "score": 8,
        "url": "https://www.reddit.com/r/Xennials/comments/1dr19lj/say_it_aint_so_leon/",
        "content": "https://www.reddit.com/r/television/s/cPyZfMec7f",
        "num_comments": 10,
        "comments": [
            "As a fat kid with a fat family in Illinois, I related to Roseanne more than any other show growing up.  He will be missed.",
            "This one stings. RIP, Martin!",
            "Awww…Gene…😢",
            "Colonel Mustard",
            "Remember Leon recommends lean",
            "Watching Fernwood 2Night in his honor as we speak. They used to show it on TV Land in the early-2000s and it used to have me cracking up. Lotta people got their start on this show...Jim Varney, Alan Thicke, Ben Stein.\n\nRIP Martin...I know you and Fred Willard are having a great time upstairs. \n\n[https://www.youtube.com/watch?v=Nq5DRABAT-o](https://www.youtube.com/watch?v=Nq5DRABAT-o)",
            "Knowing him from Roseanne, his cameo as Lt. Dangle's brief replacement was perfect.",
            "**GENE!!!**",
            "And so many more!",
            "I read it in his voice"
        ]
    },
    "Those of us who smoked in the 90’s… do you ever just want a cigarette? Not to start smoking- just, a 90’s grunge moment, Soundgarden, cold beer cigarette?  Sigh. Getting old sucks ": {
        "title": "Those of us who smoked in the 90’s… do you ever just want a cigarette? Not to start smoking- just, a 90’s grunge moment, Soundgarden, cold beer cigarette?  Sigh. Getting old sucks ",
        "score": 416,
        "url": "https://www.reddit.com/r/Xennials/comments/1dqy89t/those_of_us_who_smoked_in_the_90s_do_you_ever/",
        "content": "",
        "num_comments": 291,
        "comments": [
            "If I had a terminal diagnosis I'd buy a pack tomorrow.  Smoking was one of the great joys of my life and I miss it every day.",
            "I quit smoking cold turkey in 2018. Smoked at least a pack a day starting around '97 when I was 16. It took a few tries to quit.  I never want to smoke cigarettes again.  I hate how they smell now.  I mainly miss the actual physical act of putting a cig in my mouth and the little thump in the back of my throat each inhale.  I noticably feel much better than I did back then, even 6 years later.",
            "Yeah, I miss smoking, especially when you could sit in a bar, or a club, and smoke with your drink.",
            "I crave a clove cig like twice a year lol",
            "Yes. \n\nI want that and a backyard full of people, just chilling or a quiet night on a back porch. Those were the best parts of new adulthood",
            "If I had 3 wishes, one of them would be the ability to smoke cigarettes again, as many as I wanted, without any effect on my health. I loved smoking. I loved it. It calmed me down and was the only thing I’ve tried that helped me with my anxiety and ADD, but I have not smoked a cigarette since November 2, 2011.",
            "Yes, but the last couple I tried to smoke left me feeling like an elephant was sitting on my chest for days after. As much as I love that hit of nicotine, it's not worth it.",
            "I’ve tried and honestly it tastes like shit and I feel like shit the next day.  But man I miss having a Bloody Mary at like 1:30 on a Sunday, sunny restaurant porch, and smoking a cig.  Now my taste buds have grown back and it’s just disgusting.",
            "Yes. Closest I get is taking a big inhale on the rare occasion I walk past someone smoking.",
            "I don't want them anymore, but I did smoke age 16 to 36; I've had enough.  \n\nHowever, if I could smoke a cigarette and have it get me as crazy buzzed and euphoric as it did when I first had one at 14, I would."
        ]
    },
    "Thanks for the shirt! Honored to wear it around. 1981! ": {
        "title": "Thanks for the shirt! Honored to wear it around. 1981! ",
        "score": 379,
        "url": "https://i.redd.it/77p31jsu8e9d1.jpeg",
        "content": "Of course walking around to keep that cholesterol down!",
        "num_comments": 43,
        "comments": [
            "Hey, thanks for sharing your Xennial pride with us. Glad you like the shirt!",
            "Wait.. we have shirts here?",
            "1981 BABY!!!!\n\n![gif](giphy|V80llXf734WzK)",
            "For anyone who’s interested. They have other designs too.\n\nhttps://a.co/d/00yp5AcK",
            "Thanks but the only advertisement I need for this club is the grey hair that I'm starting to get. I've spent a lifetime trying to be generally invisible and don't want to ruin my streak now. Looks cool on you though. Enjoy it.",
            "I NEEEEEED this shirt! Lol",
            "Mods or whoever made this: cool shirt but the image placement is incorrect and should be higher! For the next batch?",
            "[removed]",
            "Lucky!!! Gosh",
            "Am I the only one that stop scrolling because you seen…. The shirt… yeah. 😉"
        ]
    },
    "The latest cocaine fueled fever dream to turn 40": {
        "title": "The latest cocaine fueled fever dream to turn 40",
        "score": 937,
        "url": "https://i.redd.it/4eymzo5ioc9d1.jpeg",
        "content": "",
        "num_comments": 104,
        "comments": [
            "Loved Rainbow Brite! Remember “reading” along with the book/record with my Fisher Price record player 🤣.\n\nhttps://preview.redd.it/k8wzs111sc9d1.jpeg?width=828&format=pjpg&auto=webp&s=5dce2206e1344bb6d351c8b790e754e8e7d18f06",
            "Like Care Bears and Strawberry Shortcake, Rainbow Brite was also a collaboration between a greeting card company and a toy company. The crazy thing is that all of these things worked",
            "The movie was “out there,” man. Space travel, a robotic horse, and a planet made of diamond?! I used to love it as a kid.",
            "Aww I had her!",
            "Had the doll and was obsessed with the feel of the dress fabric. Also had a random VHS recording of Rainbow Bright at the San Diego Zoo that I watched religiously.",
            "I was obsessed with Rainbow Bright as a child. Cartoon, dolls. Rainbow everything.",
            "lol turned 40 with me today 🤣",
            "Anyone remember the movie with the robot horse? I watched it over and over.",
            "My first lunchbox was a Rainbow Brite lunchbox",
            "I'm older than Rainbow Bright!?!?! 😭"
        ]
    }
}