{
    "X-Men Comics New Releases for June 26, 2024": {
        "title": "X-Men Comics New Releases for June 26, 2024",
        "score": 29,
        "url": "https://www.reddit.com/r/xmen/comments/1doqdqs/xmen_comics_new_releases_for_june_26_2024/",
        "content": "**[X-Men: Blood Hunt - Magik #1](https://www.reddit.com/r/xmen/comments/1doqdqs/xmen_comics_new_releases_for_june_26_2024/labirv6/)**\n\n* After the Fall of the House of X, Illyana Rasputina has returned to her homeland to search her soul and steel it for what comes next. But how will she protect her first home when a vampire army descends on Russia, seeking to turn it into a living hell? She may have been forged in the fires of Limbo, but has it prepared her for the Blood Hunt?\n\n**[Hellverine #2](https://www.reddit.com/r/xmen/comments/1doqdqs/xmen_comics_new_releases_for_june_26_2024/labis6s/)**\n\n* THE HELLFIRE WARRIORS UNLEASHED! PROJECT HELLFIRE has unleashed their HELLFIRE-FUELED WARRIORS! But as HELLVERINE comes into conflict with this renegade team of reanimated fighters, will LOGAN be able to quell their violent mission, or will the clash result in hell on Earth?\n\n**[X-Men: Heir of Apocalypse #2](https://www.reddit.com/r/xmen/comments/1doqdqs/xmen_comics_new_releases_for_june_26_2024/labisjs/)**\n\n* Cable, Exodus, Mirage, Wolverine, and more — Apocalypse saw great potential in twelve hand-picked mutants. But when a thirteenth contender crashes the tournament, endangering the lives of thousands in the process, will any survive to carry on in Apocalypse's footsteps? Not if MISTER SINISTER has anything to say about it!\n\n**[X-Men '97 #4](https://www.reddit.com/r/xmen/comments/1doqdqs/xmen_comics_new_releases_for_june_26_2024/labisxd/)**\n\n* SINISTER SECRETS COME TO LIGHT! As the X-Men gather to celebrate good news, some of their most dangerous foes show up to crash the party — and strike a deadly blow to mutant/human relations in the process! The official prelude to the hit new Disney+ TV show reaches its explosive conclusion here, setting up key plots that will play out in the seasons ahead!\n\n**[Wolverine: Madripoor Knights #5](https://www.reddit.com/r/xmen/comments/1doqdqs/xmen_comics_new_releases_for_june_26_2024/labit9v/)**\n\n* INTO THE HEART OF MADRIPOOR'S DARKNESS — FOR THE LAST TIME! THE HAND has finally enacted their decades-long plan for NATASHA ROMANOFF!  With the BLACK WIDOW meeting her destiny (as teased in UNCANNY X-MEN #268!!!), will WOLVERINE and CAPTAIN AMERICA be able to save her or succumb to dark forces as this trio team up for the LAST TIME? Chris Claremont's all-new, in-continuity adventure concludes with the culmination of his story over thirty years in the making!\n\n---\n\n**[Related & Unlimited Releases for 6/26](https://www.reddit.com/r/xmen/comments/1doqdqs/xmen_comics_new_releases_for_june_26_2024/labitnu/)**\n\n* Discuss other Marvel comics impacting the X-Men releasing this week, including Unlimited exclusives.\n\n---\n\n**Other**\n\n* [Previous Weekly Thread](https://www.reddit.com/r/xmen/comments/1djbcgh/xmen_comics_new_releases_for_june_19_2024/)\n* [r/X-Men Archive](https://reddit.com/r/xmen/w/index)",
        "num_comments": 80,
        "comments": [
            "**X-Men: Blood Hunt - Magik #1**",
            "**X-Men: Heir of Apocalypse #2**",
            "**Related & Unlimited Releases for 6/26**",
            "Was going to wait for this to come out in trades. But after catching the preview, I decided that I couldn't wait. And I'm glad I did. \n\nAfter what happened to Akihiro at the end of Percy's run on Wolverine and X-Force, this feels like a messy, but fitting way to continue his story. It's brutal. It's violent. And it's perfectly in keeping with the Wolverine family legacy. 😊",
            "Wasn’t gonna pull this for many many reasons but I’m actually enjoying it so far. I don’t care about the Destroyers but I think the Akihiro characterization has promise so far",
            "For people disappointed in Roberto’s role in the show, this cameo kind of feels like insult to injury. More whitewashing of his appearance and backstory experiencing racism\n\nOverall I wouldn’t say this mini added much to the show. It wasn’t *bad*, it had decent moments. It just kind of… was a comic that came out",
            "I really liked this. It wasn’t earth shattering or anything but it was definitely what was promised. A fun story about Yana kicking vampire ass",
            "Nice self-contained story. I like that Magik didn't just trounce the big boss through brute force, since he's shown to be bigger, stronger and faster than her, so she had to use some quick-thinking and smart tactics to beat him.",
            "Magik with going full ''I am not trapped here with you. You are trapped here with me'' mode.\n\nI guess you don't expect ancient vampires to keep up with their 'who to avoid' list, otherwise they wouldn't have brought Magik into their camp.",
            "Loved this issue for Magik, her getting to fight like a demon but still be the protector of the innocent, perfect! What I love about Magik is that after all shes been through, she still wants to be a hero and save people. She might be a bit scary but her heart is firmly in the right place.  \n\nI really enjoyed how she used her portals to speed up in this issue! They aren't just for transportation, they can be used to fight! And we got to see her use magic! I am holding hope that she gets to do cool stuff like this in the upcoming X-Men run instead of just being a taxi for the team."
        ]
    },
    "Comic panel search": {
        "title": "Comic panel search",
        "score": 418,
        "url": "https://i.redd.it/lb6uivthze9d1.jpeg",
        "content": "I was scrolling around in a saved comic panel gallery my friends have and is i’ve been wondering this real? and if so which comic issue is it in, I genuinely do not remember this. I’ve been laughing at this for like half and hour.. Bobby is so unhinged for this LMAOO",
        "num_comments": 40,
        "comments": [
            "It's real. It's from the first issue of Marauders at the start of the Krakoa Era. The context is that Kitty / Kate has discovered she can't go through the Krakoan gates, so that's essentially what they're talking about (as a jokey reference to the end of \"Raiders of the Lost Ark\").",
            "I just watched the flashpoint paradox and a villain (the top) actually said “once again it looks like you’re the bottom and IM the top!”. Then there was a whole weird moment with green lantern. The whole thing was so charged with gay overtones I almost unzipped thrice.",
            "First time I read this I thought he said \"I'd like to top these men\", then reread it and...I am tweaking rn",
            "remember when bobby and kitty dated?",
            "So confirmed, Bobby’s a bottom?",
            "Bobby can definitely get it.",
            "Oh woah I literally just read this page like 3 minutes ago. I don't know the exact issue or date or anything, I'm still pretty new to X-Men stuff, but this was when Kitty Pryde was unable to use the portals to go to Krakoa, so she had to take a boat over and was super pissed about it. The person yelling off panel is Logan, asking if she brought beer with her (she did, she IS the supply).",
            "I think that's from Marauders #1 when Kitty can't use the gate to access Krakoa.  The joke is a reference to the last scene of Raiders of the Lost Ark.",
            "Bobby is a bottom confirmed.",
            "Get your minds out of the gutter it's an Indiana Jones quote"
        ]
    },
    "These two are the coolest pirate captains of the past decade imo. Kate becoming a barista after all this is genuinely insane to me😭😭😭": {
        "title": "These two are the coolest pirate captains of the past decade imo. Kate becoming a barista after all this is genuinely insane to me😭😭😭",
        "score": 68,
        "url": "https://i.redd.it/vllbg4u4nh9d1.jpeg",
        "content": "Went from sailing on a pirate ship to making alcoholic drinks on a Friday night smfh🤣",
        "num_comments": 18,
        "comments": [
            "Who’s the character on the right?",
            "It's a callback to Kitty's past. She left the X-Men and tended bar for a while in the early 2000s. Chris Claremont wrote a limited series about her trying to be a civilian called Mekanix that's pretty good. It's all on Marvel Unlimited. You should check it out.",
            "She was a pirate for like 2 minutes. Barely even got to see it in action with all the bigger stories or time travel scenarios they got pulled into anyway.",
            "If I could still pay my rent and bills, I’d go back to being a barista in a heartbeat",
            "An iteration of Marauders that just goes around saving other mutants after the fallout of Krakoa failing could be a good mini series idea tbh.",
            "Honestly, becoming a bartender seems like a natural job for a pirate that wants to settle down.",
            "Thanks for clarifying this for someone who hasn't read the stuff – bartender makes a lot more sense for Kate than barista!",
            "Monkey D. Luffy from One Piece",
            "Luffy D Monkey from the anime One Piece",
            "Luffy isnt the coolest pirate of the last decade\n\nbecause one piece started almost 3 decades ago he doesnt qualify"
        ]
    },
    "Love how Scott’s Nightmare was the Fall of Mutant kind and Jeans was Emma making fun of her ": {
        "title": "Love how Scott’s Nightmare was the Fall of Mutant kind and Jeans was Emma making fun of her ",
        "score": 46,
        "url": "https://www.reddit.com/gallery/1dr9zmo",
        "content": "",
        "num_comments": 22,
        "comments": [
            "I just don't know why they brought back that outfit for her. Even if the idea was just to make her sexier and let her show more skin, it's such an outdated design. The long sleeves, the over sized mask, the material/fabric looking so plain and cheap. \n\nIt is pretty funny, because this instantly wakes Jean up and makes her go after Nightmare while Scott just kind of lingers in bed a bit until Jean comes back to bone him. I guess maybe (perhaps not intentionally) you could interpret that as Scott having these kinds of nightmares often? So he's used to them.",
            "Both of them got off better than Laura.\n\nThe Facility? Kimura? Zebra Daddy? Nope. Laura's nightmare was about a relationship that from her perspective NEVER HAPPENED.",
            "I cannot find it in me to respect that god awful outfits. It’s just a short dress and an oddly shaped mask. I’m literally going to throw myself out a window",
            "You say that like being on the wrong end of Emma Frost's legendary scathing wit isn't a valid fear. Her real primary mutation is Omega level roasts.",
            "I mean, the actual issue is clearly the loss of innocence and struggle to find self, which in Jean’s case can lead to things much worse than the fall of mutantkind… but I guess Emma judging her is also a way to look at it…",
            "I think in JDW’s latest AIPTA interview he says that it was essentially to show that Jean wanted to go to the time before Phoenix and all her huge problems. Which I guess kinda makes sense, but also doesn’t. She should’ve been embracing her history and moving forward. The choice made more sense for the idea of Krakoa than that of Jean’s character. They should’ve upgraded this look at least tho.",
            "The only book where I liked this outfit was X-Force, because it helped show the contrast between Jean’s innocence/purity and the dark workings of the team.",
            "For your second paragraph I believe Jean being an omega level telepath and could sense her mind being invaded had something to do with it.",
            "Everyone was bemoaning the outfit, but I think it was Hickman who said it was a deliberate choice. The outfit is significant for Jean because of what it represents in the context of her relationship with the Phoenix.",
            "🤓\n\nJesus no one can just roll with the humour in a situation"
        ]
    },
    "Flanders neat trick": {
        "title": "Flanders neat trick",
        "score": 990,
        "url": "https://i.redd.it/wbq0kk3mwc9d1.jpeg",
        "content": "",
        "num_comments": 45,
        "comments": [
            "\"And of course in Hong Kong the whole thing's flip-flopped.\"",
            "Not pictured: Homer's brain exiting his body when trying to figure out the Summers family tree.",
            "This is an A+ meme, just wanted to drop in and say that",
            "Well I'm color blind and purple always looks black to me so this doesn't help at all lol",
            "I always read her name like “Q-Anon”",
            "Now, there are two exceptions and it gets kinda tricky from here..",
            " \nBut see, I think this was a mistake. People liked their purple haired ninja. Now we have a purple haired woman who isn’t a ninja and a ninja who doesn’t have purple hair. Name, Powers, and Appearance accounts for like 60-90% of a superhero character’s value. Now all the people who knew Psylocke from Marvel vs Capcom etc. are confused and/or disappointed. I think they should have gone with dark purple for Kwannon and light for Betsy, and make your artists practice drawing Japanese people vs. English people. In real life this would not be hard to tell apart.",
            "How bout in MvC 2 where she has straight purple hair? \n\nBwannon? Ketsy?",
            "I'm not sure I get it, can you show me some examples?",
            "This post brings me a lot of joy and I hope OP has a lovely day. They deserve it."
        ]
    }
}