{
    "An open letter on the state of affairs regarding the API pricing and third party apps and how that will impact moderators and communities.": {
        "title": "An open letter on the state of affairs regarding the API pricing and third party apps and how that will impact moderators and communities.",
        "score": 90,
        "url": "/r/ModCoord/comments/13xh1e7/an_open_letter_on_the_state_of_affairs_regarding/",
        "content": "",
        "num_comments": 10,
        "comments": [
            "Have you considered going dark, mods?",
            "We get all worked up about this, and I think it's a justified complaint, but I know that there are 3rd parties who make an app or a portal that accesses Reddit content and then that 3rd party applies ads and other thresholds to monetize access to the Reddit content that you made, and that the portal does not create and does not add value to.  It's a lot like when you create some image or video content for free, but then someone else comes along and charges access to see what you made and they get $$ while you get nothing. \n\nI think exorbitant fees are ridiculous, but 3rd party folks charging for access to something that reddit helped to create and makes available for free, seems a lot like a scam.",
            "Yes, we will be participating. Actually, one of the mods here is actually one of the organizer for the blackout.",
            "That’s good - it just wasn’t super clear and its hard to tell who is or isn’t in",
            "FTC launches inquiry into Reddit's AI deals, ahead of IPO\n\n&#x200B;\n\n[https://www.axios.com/2024/03/15/reddit-generative-ai-license-user-data](https://www.axios.com/2024/03/15/reddit-generative-ai-license-user-data)",
            "[https://reddit.com/r/PussyDestroy699/s/sp1BKQXjEU](https://reddit.com/r/PussyDestroy699/s/sp1BKQXjEU)",
            "[https://reddit.com/r/PussyDestroy699/s/sp1BKQXjEU](https://reddit.com/r/PussyDestroy699/s/sp1BKQXjEU)",
            "https://reddit.com/r/PussyDestroy699/s/sp1BKQXjEU",
            "I **just** removed 9 reposts here of the same freaking wheelie video. Why? Because the repost detection bot seems to be down today. This is how it will always be once the API pricing is applied.\n\nI am NOT moderating this shit when all my tools are gone. There's 3 MILLION subscribers in this sub. Reddit is insane if they think we can keep this up without the API."
        ]
    },
    "Oh shit  ": {
        "title": "Oh shit  ",
        "score": 296,
        "url": "https://v.redd.it/0fqn7cr1mf9d1",
        "content": "",
        "num_comments": 33,
        "comments": [
            "The dude with the white hat made a clean exit.",
            "Mofos brought the house down!!",
            "I see the big guy in the back, doesn’t excuse the poor job on building that casino, but just noting that he was “the straw that broke the camel’s back.”",
            "The roof the roof is on …..",
            "I like how the guy who seemed drunkenly lost in the dance was so quick to realize what was happening.",
            "Bob the builder lost his building license that same day",
            "Roof fall down go boom",
            "I wonder if anyone broke a leg",
            "Is the song Reunited - Wu Tang Clan ?",
            "Sometimes it pays off being short"
        ]
    },
    "In life I am the one in the back": {
        "title": "In life I am the one in the back",
        "score": 571,
        "url": "https://v.redd.it/sev759foxd9d1",
        "content": "",
        "num_comments": 27,
        "comments": [
            "That’s a fucking big animal",
            "This isn't just any crocodile. This crocodile is named henry, and he's eaten people. But more impressively, he was caught by an elephant hunter named Sir henry in 1903, aging him to be 122 years old, making him the oldest nile crocodile in captivity.",
            "Lacoste is the closest I’m coming to a croc ever",
            "That fucker is a dinosaur.  Leave it be.",
            "Why he acts like Steve Irvin ?",
            "In life I am the one not messing with dinosaurs",
            "Now you know what the tail is for!",
            "That tail could’ve broken ur legs.",
            "That think is a Tank",
            "the size of that thing. o.O"
        ]
    },
    "It wasn't his fault, the truck braked suddenly :c": {
        "title": "It wasn't his fault, the truck braked suddenly :c",
        "score": 33,
        "url": "https://v.redd.it/ni5xbrysxf9d1",
        "content": "",
        "num_comments": 14,
        "comments": [
            "for that reason it is not correct to go so close to the vehicle in front of us\n\n![gif](giphy|WxDZ77xhPXf3i|downsized)",
            "I’m sure the pixels means he is safe and sound",
            "Driving 101, never fish tail another vehicle. Especially when you are accelerating so aggressively.",
            "Following too closely. Unnecessary end. RIP.",
            "Braking distance. Dude got literally wrecked for ignoring this most basic safety rule of driving - no tailgating! Fuck off OP.",
            "It was his choice not to ride on the side of the road in what is normally the bike lane, and also his choice to pass blindly",
            "Ohhhh! Most definitely his fault! Darwinism at its finest....",
            "where is the uncensored video",
            "Not his fault, but it was his life at stake.",
            "I also try to never fish tail my vehicle. Makes for a bad day."
        ]
    },
    "Not where I saw this going ": {
        "title": "Not where I saw this going ",
        "score": 2600,
        "url": "https://v.redd.it/8lw1u2cc099d1",
        "content": "",
        "num_comments": 38,
        "comments": [
            "God damn, little Johnny jokes. Now there’s a throwback.",
            "Black guy here.......accurate. And all I did was sneeze lol",
            "100% where I thought it was going.",
            "Shouldn’t this be in r/technically the truth subreddit ![gif](emote|free_emotes_pack|trollface)",
            "That turned dark real quick…",
            "What is tis even from it looks like its from the 90",
            "nice content for mindset daily",
            "I laughed but lets be real, how does acting like this go? Do they just set up in a classroom with some random kids and they’re like; ok susie this is your line and after that line you come in little john. \n\nAre the kids aware what they’re saying? They don’t look older than 10 (johnny may be 12?)",
            "Thanks to all the shit on OP's screen, I know to never view content from @mindset.daily1, whatever the fuck that is. Never have real kids act out a Little Johnny joke. They aren't good actors, and they aren't funny.\n\nAt least his phone was charged up.",
            "They only say that when they knock you the fuck out and cause you drain bamage."
        ]
    }
}