{
    "YSK We will be more strongly enforcing Rule 2": {
        "title": "YSK We will be more strongly enforcing Rule 2",
        "score": 654,
        "url": "https://www.reddit.com/r/YouShouldKnow/comments/igb8ws/ysk_we_will_be_more_strongly_enforcing_rule_2/",
        "content": "Up until now we have been pretty lenient in regards to Rule 2, which states that post must describe *why*  the YSK is useful. We have approved posts that didn’t state why the  knowledge is useful under the guise that its usefulness was implied.  However, due to an increasing number of these types of posts, we feel it  needs to be addressed. Therefore, starting now we will be enforcing  Rule 2 more heavily. All posts must include (in the text body) an  explicit statement of why the post is useful. Even if you think the  reasoning is obvious, you still must explicitly state it. This should be  done by having a simple “**Why YSK:**” in the text body. (Just for those who might not know, the text body is the area where you can put additional text after the title text when creating a post.) *Please note that it should go in the text body -- not the title or the comments.*\n\nRemember that this sub is focused on self-improvement on how to do things, improve on activities, skills, and other tasks.\n\n*BASICALLY:*\n\n* All posts must include a \"**Why YSK:**\" (typed just like that) section in the text body.\n\n\\[\\[Additionally, we want to take this time to remind everyone that [r/YouShouldKnow](https://www.reddit.com/r/YouShouldKnow/)  is not a place to share personal stories or anecdotes. If you feel your  post needs to include one, a brief anecdote is fine. The entire (nor the majority of the) post should not be about your own personal experience, however. We will be removing posts that are just personal anecdotes.\\]\\]\n\n**Why YSK:** We (the YouShouldKnow moderators) hope it will improve readers' abilities to better understand the purpose of the sub, mentioned above and in the expanded Rule 1. For thread creators, it will help in their ability to explain how the reader can improve upon a certain skill, task, or ability. It will also help the creator improve upon the skill of not having their post deleted due to not including \"**Why YSK**\" in the text body of their post.\n\n*NOTES:*\n\n* Bolding the words **Why YSK:** will make it a lot easier for people to find it.\n* Again, please put **Why YSK** in bold letters. It's easier to find in a sea of text.\n* **Why YSK** must be followed by an actual explanation as to how it helps someone improve upon a skill, task, or activity. Following it with a massive personal anecdote is not the point -- neither is following it with \"I think this is important\" or something similar.",
        "num_comments": 0,
        "comments": []
    },
    "YSK Back Pain could mean you are having a gallbladder attack": {
        "title": "YSK Back Pain could mean you are having a gallbladder attack",
        "score": 956,
        "url": "https://www.reddit.com/r/YouShouldKnow/comments/1dr0fdv/ysk_back_pain_could_mean_you_are_having_a/",
        "content": "[Especially when your back pain is inexplainable.](https://www.hopkinsmedicine.org/health/conditions-and-diseases/gallbladder-disease) An ultrasound must be done if no other reasons are explaining your back pain. Why YSK: back pain gets misdiagnosed often and is a sign of digestive tract issues.\nCitation: Johns Hopkins Medicine",
        "num_comments": 142,
        "comments": [
            "or appendicitis. i had terrible back pain and it turns out my appendix was so inflamed that it was affecting a nerve. that went on for a week or two until an emergency surgery. thank you for posting",
            "My backpain normally means I need to poop",
            "Radiologist here. I'm the kind of doctor who makes the diagnosis for this. Back pain would be a very rare and unlikely solitary symptom of gallbladder disease. I can't think of the last time I saw that as a symptom for any of the studies I've read, and I diagnose cholecystitis about every day. I wouldn't worry too much about this one.",
            "whos attacking my gallbladder ",
            "I threw up for months with the back pain nobody could explain. Gallbladder was gangrene and was just one huge stone. The surgery/recovery was excruciating.",
            "Yup, had mild back aches for years. Had excruciating back pain one night and went to emergency. Even the ultrasound wasnt conclusive. When the dr pressed hard over my gallbladder, didnt feel any pain in that area. He suspected it was gallbladder anyways and had surgery the next day - gallbladder was absolutely messed up. Back pain was gone after that.",
            "Can confirm. This happened to me (for the first time) a few years ago. It felt like a combination of slipping a disk in my back and having a heart attack",
            "Friend had back pain.  Long story short: gall bladder.  \nTold about some common symptoms.  He confirmed.",
            "Or a kidney infection. I thought my back pain was from bad posture for a few days until one morning i woke up violently ill and discovered i had a kidney infection at urgent care ",
            "Just had my gallbladder out this week, looking forward to seeing if I stop getting random back pain!"
        ]
    },
    "YSK not to touch or disturb starfish (sea stars)": {
        "title": "YSK not to touch or disturb starfish (sea stars)",
        "score": 608,
        "url": "https://www.reddit.com/r/YouShouldKnow/comments/1dqxplr/ysk_not_to_touch_or_disturb_starfish_sea_stars/",
        "content": "Why YSK: Sea Stars (aka - starfish) are recovering from a massive die-off from a wasting disease, particularly in the US Pacific Northwest. Touching them can be hazardous to their health as we try to let them recover.\n\nWhen I lived here in the early 90’s, every single object in the water was covered in all kinds of sea star species. They’re few and far between now but making a comeback.\n\nHere’s more info, if someone has better links, please share and I’ll post!\n\nhttps://alchemy.gr/post/809/the-vulnerability-of-starfish\n\n",
        "num_comments": 39,
        "comments": [
            "Ok so I have 100% walked along a beach at low tide and any starfish i saw that looked like it was cooking in the sun I tossed into the water.  Is this bad?  Am I bad?  Am I going to the bad place?",
            "Just dont touch any wildlife! Leave them alone!",
            "If yall still want to disturb a starfish, I dont have plans this weekend.",
            "What do they spit out? They spray something if you walk by them or on them.",
            "Wow, thabk you, I would never have guessed. Seems like they're all over I hook them while fishing often.",
            "Best practice is you don't fuck with anybody.",
            "Ok. What about picking them up and returning them to water instead of letting them die on the beach?",
            "i'll do, but that's so beautiful ",
            "James Harkin warned us ages ago!",
            "Well this is going to ruin the tour"
        ]
    },
    "YSK Transmission fluid needs replaced": {
        "title": "YSK Transmission fluid needs replaced",
        "score": 510,
        "url": "https://www.reddit.com/r/YouShouldKnow/comments/1dql8us/ysk_transmission_fluid_needs_replaced/",
        "content": "Why YSK: All cars have a transmission (or gearbox). These are machines that cannot operate without some sort of lubricating fluid. That fluid has to have certain properties to do its job. Over time, it will degrade because it's exposed to heat, oxygen and wear particles from the moving parts.\n\nIt is very common for people to drive a car for years, and never have it serviced. Eventually, they are surprised by a transmission that won't shift or fails completely. This is because the oil has degraded and can no longer lubricate properly, also because it's full of metal particles that abrade other surfaces. It causes permanent damage that cannot be fixed by replacing the oil once it's happened.\n\nThis is much worse in automatic transmissions, because they're more complicated and rely on valve spools to shift. The poor lubrication and debris causes the valves to wear, meaning they can get stuck and not function properly.\n\nIf you want to avoid these problems, your transmission fluid needs to be replaced at least as often as the manufacturer recommends. If you don't, you will need to replace or rebuild it, which is extremely expensive. This applies to any mechanical device that's lubricated with a fluid (including your engine).\n\nSome manufacturers have 'lifetime' transmission fluid, meaning it doesn't need replaced. All that means is that the manufacturer has managed to design a system that will work long enough for the owner to not complain about an early failure when problems occur. They're betting on most people switching cars every few years. They don't want a car lasting twenty years, it means they sell fewer cars. They want a car that lasts long enough to avoid being called a lemon.\n\nThere is no such thing as a lubricant that won't degrade over time, it's not possible, regardless of what the manufacturer claims. Even 'lifetime' fluid should be replaced every few years if you're smart.",
        "num_comments": 140,
        "comments": [
            "I asked the Audi dealership to change the transmission fluid in my Audi last time it was in (170000km),and they wouldn't. They said the gearbox is sealed for life.",
            "So if my car is at 200,000 km and has probably never had this done, what would be the best way to correct this mistake?",
            "It should be noted fully electric cars usually don't have a transmission",
            "You know this is a topic of debate in the car world and needs to be specified. I have seen some mechanics recommend every 40k miles, some recommend to follow the vehicle maintenance schedule, some recommend flushing, some dont recommend flushing. I have literally talked to a transmission shop that says to never get your transmission flushed and just to drain and replace the oil, yet some manufacturers will only to flushing. \n\nLots of mixed info on this from reputable sources.",
            "Heard the exact opposite from some old school car dude who basically said if its old and hasnt been changed dont touch it. Also watched a chevy astro breeze past 200K without ever touching transmission fluid",
            "Genuine question:\n\nSealed 8 speed transmission lacking the ability to change fluids without decoupling from the engine. Options?",
            "I brought by 2020 Kia Forte to the dealer for a CVT Transmission Fluid change at 80,000 miles, They refused to do it because according to them there is a sticker on the transmission saying it is \"non-serviceable\".  When I told them the owners manual says to change the fluid every 60,000 when driven in severe conditions (I live in Maine, so yeah our conditions are severe 7 months a year) they said the owners manual is \"generic\" and that doesn't apply to my specific car.  Does that make any sense?",
            "This is extremely overlooked by many people I think. Its also very important to research how it needs to be done. For example with my 13 accord V6 I did 3X drain/fill every 60k miles and at 209k and 9 years later it showed no signs of wear whatsoever",
            "For people that have a manual transmission, its always recommended to change the fluid every 20-30k miles. Its actually not hard at all in some cases, literally like an oil change. Drain and fill (Usually there is 2 ports, an upper and lower)",
            "If a car has a \"sealed transmission\" then how would the fluid be changed?"
        ]
    },
    "YSK that not flossing and/or not getting your teeth cleaned may be killing your game": {
        "title": "YSK that not flossing and/or not getting your teeth cleaned may be killing your game",
        "score": 5486,
        "url": "https://www.reddit.com/r/YouShouldKnow/comments/1dq8fdq/ysk_that_not_flossing_andor_not_getting_your/",
        "content": "Why YSK: Many of you are walking around with “perio breath” and have no idea. There is a very specific smell that emanates from your mouth, originating in the pockets under your teeth. \n\nYou can brush and use mouthwash to your heart’s content and it won’t even make a dent.\n\nSee your dentist and/or hygienist - dental care is expensive, but totally worth it. If you’re struggling with finances - many times you can get free or reduced care by volunteering as a patient for dental and hygienist schools.\n\nhttps://www.stgeorgesmiles.com/blog/2021/05/30/perio-breath-fact-sheet/\n",
        "num_comments": 358,
        "comments": [
            "Recently saw an ad for a local student doing free cleanings and such but was kind of nervous about the possibility of them messing it up badly. What is the worst that could happen during a routine cleaning/check up with an inexperienced student dentist? Any suggestions on what to look out for?",
            "This is me rn. Never taught about/ to floss.\nI KNOW my breath smells and I can't get rid of it no matter what I do now. Need to get a cleaning for my back teeth real bad. Trying to mask it every chance I can. I always take gum from people if they offer it bc I'm convinced they are just trying to be nice about my breath smelling bad . Im so embarrassed by it but too broke at the moment to get anything done. This new job I'm signing up for dental for sure!",
            "I'll also add that a sign of depression is not taking care of yourself, like brushing your teeth, showering, shaving, cleaning.",
            "I, 47m - just had full dentures put in 2 weeks ago. I'm still healing and they had to extract over 22 teeth still, some broken at the gums. The struggle is real.. Depression, anxiety, shame, embarrassment, self esteem issues, financial worries and a host of other health problems derive from poor dental health. \n\nSometimes you can't help it, teeth are genetically brittle. I assure you dentures are no fun and encourage you to do your best to take care of what you've got. Flossing is made easy these days with the little pix with a handle etc. Ya gotta get the gumline and floss well for long term health for sure.",
            "Here's a good timesaver: Only brush the teeth that you want to keep!",
            "Try flossing your teeth and then smelling the gunk that comes out. \n\nYou'll never forget to floss again.",
            "This is so true. The smell and the white gunk between the teeth are not a turn on ",
            "Thanks for reminding me to schedule a dentist appointment",
            "Just to add:\n\nSometimes you even got bad things on your tongue. Make sure to clean it, too",
            "Also, if you want to keep your teeth in your face you should absolutely get them cleaned. Especially if you're the type to not get many fillings. Especially if you're over 30. You'd be surprised how quickly gum disease can set in and ERODE YOUR JAW BONE.Ask me how I know."
        ]
    }
}