{
    "ImAllexx Megathread": {
        "title": "ImAllexx Megathread",
        "score": 553,
        "url": "https://www.reddit.com/r/youtubedrama/comments/1dh90l4/imallexx_megathread/",
        "content": "Seeing how this has been big news, with heavy allegations with pretty damning evidence, and I'm sure there will be plenty of updates, it's already time for an ImAllexx Megathread. \n\nImAllexx has been accused by his ex-girlfriend Alice of verbal/emotional/psychological abuse as well as physical abuse. [Here is the first post on this sub regarding her statement as well as links to her tweets and the document](https://www.reddit.com/r/youtubedrama/s/llzqzf1C1K) \n\n[Here is a follow up post highlighting specific abusive texts](https://www.reddit.com/r/youtubedrama/s/nfGAKBySec) \n\n[Here is one of the few videos showcasing Alex threatening and insulting Alice on discord](https://www.reddit.com/r/youtubedrama/s/yUdRYLT7Te)\n\n[In case the Google drive is broken here is a tweet containing some clips of the videos](https://x.com/sxpnvptee/status/1802120827418329547?t=q3XfXsauStB-jn4Qty58gg&s=19)\n\n[Here](https://x.com/sxpnvptee/status/1802121993199984738?t=3R551Nogh8haAtiMmO0uUw&s=19) [and here](https://x.com/sxpnvptee/status/1802122153967710686?t=3R551Nogh8haAtiMmO0uUw&s=19) where these final clips include a moment where he calls her the n-word, which is included in some of the texts as well. \n\nThere is also a 25 minute voice message in the Google drive, which you can listen to in [this video summarizing the allegations by YouTuber Exate](https://youtu.be/SYMA887G3N4?si=KSCWH4C4hX6OKJLu) (timestamp: 30:24)\n\n",
        "num_comments": 422,
        "comments": [
            "Statements have been made by (at the time of writing):\n\n iNabber (three separate updates on IG stories, and a [response](https://docs.google.com/document/u/0/d/1KKyaCA74q-_bMbZr40_rWfsdiNLe9mCOK5yqPvV3yMk/mobilebasic?pli=1) to allegations made against him, as well as on YouTube (not a video))\n\nMemeulous (X2) \n\n Jake Haz.\n\nWillne\n\nAlex McIntyre ([video 1](https://youtu.be/-eNnMFu0xx4?si=Q5ADLGRQ0I9T40-N) and [video 2](https://youtu.be/2RiTaJceIuw?si=Nd61EecaK1xFS-o6)) \n\nRachel Oates ([video](https://m.youtube.com/watch?v=lX0WJA7qCpg))\n\nMiaxmon (willne's ex)\n\nKinganiii (another one of Alex's exes)\n\nItalianbach \n\nHarry Irvine\n\nArthurTV\n\nGeorge Clarkey \n\nINabber's ex gf (@ursoftblood on Twitter, who levied her own accusations against Fraser)\n\nJess Carter, another ex of Alex. ([new tweets](https://x.com/_Jess_Carter/status/1803132535787901040?t=I7AX37sbTZiThCmJ5lsT4g&s=19), [relevant statement she made in 2020](https://x.com/_Jess_Carter/status/1342862949636038656?t=I7AX37sbTZiThCmJ5lsT4g&s=19) which she QRTs w the new statement)\n\n\nWill reply with screenshots, feel free to add any screenshots of responses y'all find on IG stories, or links to tweet responses from others who may have been associated with Alex (edit: or notable and covering the situation), and I will update this comment accordingly.",
            "Him threatening her with abuse accusations over the situation with the cat is insane. You said fucked up shit to her cat like you'll snap its neck. Good luck with that 'she abused me too' defense. Idiot.\n\nThis was such a heavy read.",
            "He did fucking strangling motions when he threatened to *bash her head against the wall with a brick* like he was Lil OJ.\n\nHow unhinged do you have to be to do that on camera, even if you weren’t an ~internet celeb~\n\n**What in the cinnamon toast fuck**",
            "I read through the whole doc - and, oh my gosh. I watched Alex’s videos since before the eBoys but had dropped off in interest over the past year or so since he seemed so obsessed about Elphaba, which wasn’t entertaining to listen to. All I can say is “what the hell.” I don’t have any real relationship experience, but how someone could claim they love someone when treating them so poorly is beyond me. I don’t know anything about Alice, but I feel bad that she stayed for so long with someone who obviously treated her so poorly. I hope she finds peace.",
            "I'm just shocked at how genuinely unhinged he comes across.  I've seen messages that are more viscerally shocking, but the frequency and manner that he says this stuff it's hard to even comprehend.  He was always a bit of a freak but this is like two mad level of vile. \n\nIt seems that a lot of people are learning that you can send a 40 minute long voice note today because idk if anyone on earth has ever done that before",
            "Not to make light of the horrible accusations, but I burst out laughing when he started with the \"Your boyfriend is an *internet celebrity* and needs to keep his circle small!!\" stuff. You haven't been relevant in years, sit down.",
            "In a recent video, he said something like “I’m sure some of my viewers are older but most of you are like 14-15, if you’re older I dunno sorry but you’re not my main demographic” and I was like….? So you talk about these topics purposefully to kids? Rubbed me so weirdly. Very interesting with all this context, in that I think he likes feeling powerful in any situation. He knows kids will take his word as gospel and relishes that. He likes to exercise and wield some sick sense of supremacy over others and it’s clear in this horrible behavior",
            "https://preview.redd.it/djasm0gfgz6d1.png?width=1080&format=pjpg&auto=webp&s=b4a7838f8cdb80606e5ebf5838b77fa8a51593e8\n\nGeorge has responded on his Insta story; seems he didn't know what was going on. Feel absolutely awful for him tbh, kinda reminds me a bit of Gus and Eddy. Finding out someone you've been close friends with, worked with a lot and lived with for years is an abusive piece of shit must be a horrendous feeling :(",
            "once again i am here to say imallexx has always been and will always be a piece of shit.",
            "The clip of him sobbing and saying he’s up and down and shedding the tears (the tears are real but 110% for himself because he knows he’s fucked up.)\n\nIt’s absolute classic emotional blackmail and psychological abuse. It was absolutely haunting to hear that clip because it was just near enough identical to the shit my ex girlfriend put me through and abused me with for years, constant mood swings, arguments, demeaning comments, physical abuse - all made to make you feel lucky that this persons even with you. Goes to far, cry feign forgiveness and reset. Leaves you like an absolute shadow of your former self after a year or so."
        ]
    },
    "iNabber and Kirst || Allegations/Responses Masterpost": {
        "title": "iNabber and Kirst || Allegations/Responses Masterpost",
        "score": 120,
        "url": "https://www.reddit.com/r/youtubedrama/comments/1dkyxc5/inabber_and_kirst_allegationsresponses_masterpost/",
        "content": "This particular *\"drama\"* has developed quite quickly. It's time to put the discussion in one place. \n\n**CONTEXT + LINKS** \n\nFraser (iNabber) was originally accused of mistreatment by his ex girlfriend, Kirst, on Twitter/X @ursoftblood. [Posts about that here](https://www.reddit.com/r/youtubedrama/s/SKQx5Au1nB) as well as [here](https://www.reddit.com/r/youtubedrama/s/sixO3joKlD) show where the discussion began. \n\niNabber would respond via google document soon after. [Discussion and links here](https://www.reddit.com/r/youtubedrama/s/7ETCfNBI5r). This was well received. \n\nKirsty would respond again, with her own google document. [Discussion and links here](https://www.reddit.com/r/youtubedrama/s/DirVUjVSCI). This was also well received, at least here on this subreddit. \n\nAt the time of writing, Fraser just responded once again, with another google document. [Discussion and links here](https://www.reddit.com/r/youtubedrama/s/4AlNRhAvkv). At the time of writing, consensus seems to be: readers are sick of the google documents. ",
        "num_comments": 110,
        "comments": [
            "Update: Kirsty has replied again in a series of tweets. No it isn't brief. [https://x.com/ursoftblood/status/1804243734134968520?t=Eh9YFsmBekcd-8XcrRwXOw&s=19](https://x.com/ursoftblood/status/1804243734134968520?t=Eh9YFsmBekcd-8XcrRwXOw&s=19)\n\nThat's the link to the first tweet. If someone can get one of those unthreading links that would be awesome, because it's too many screenshots for me to post lol\n\nhttps://preview.redd.it/rdv1coy8a08d1.png?width=1080&format=pjpg&auto=webp&s=486a7e8ca1b934dc1cbd2ce496c06174fd51ecfb\n\nAnd she wasn't finished tweeting when I took these screenshots lol",
            ">readers are sick of the google documents. \n\nI'll say. There's over 22,000 words in these docs, just in the text, not counting images. That's longer than Metamorphosis by Franz Kafka.",
            "This might be a hot take but I feel like none of these documents contain the truth, but both people are being honest about their experiences. \n \nIt's almost 4 am, so I won't elaborate now, but it seems like they tell a lot of similar stories in different ways, and I don't think they are lying about how they emotionally interpreted the situations or how they were impacted by the relationship.\n \nThe one weird thing that I would like someone to explain to me is how Fraser can hear coughing through the walls, but can't hear his dog barking and his girlfriend screaming, calling, and texting. Fraser says the walls are thin and his mic could pick up her making noise in another room, but then said he didn't hear the commotion (he does not elaborate on what sorts of noises he can hear, so I'm inclined to believe what she said about him getting mad about relatively quiet sounds). I get he was sleeping but if your ears are so sensitive that you get anxiety from your girlfriend walking around while you record, I do not understand how you sleep through that.",
            "I don't think any of this covers iNabber in glory, but it also seems pretty within the realms of a typical failed relationship between relatively immature 20-somethings. The stuff about her not being able to make noise while he works makes him sound prick-ish, but I do think calling it 'confinement' is an example of using the worst possible sounding word to illustrate that point. \n\nAll in all I wouldn't want to be in a relationship with the guy from what I've seen, but I also think it's been inappropriately framed especially coming off the back of the extremely serious nature of the abuse with ImAllexx.",
            "Definitely doesn't seem like he's some big evil abuser, but on a personal level it's giving me bad vibes how much his last document is filed with him saying things like \"as you can see this proves she's blatantly lying\" or \"this claim is absolutely insane\". Like I can understand him wanting to counteract what she's saying if he doesn't believe it's true, but it seems like he's not willing to give room to the idea that she could have experienced things differently to the way he thinks they should be read.  \n\nIdk this definitely just seems like a bad relationship that shouldn't be public, but it's definitely a little off putting how his instinct seems to be to just completely shut her side down without much grace",
            "I think they both should handle this in private... Either of them is not a criminal, they just were in a bad relationship, and getting to know the details of the sex life of a couple I don't even know was not on my bingo card.\n\nI think that this is awkward and unhealthy for everyone\n\nEdit: typos",
            "I hope this is the last doc 😞",
            "This just seems like a toxic relationship, where both felt like they were wronged. I think they both need to grow the fuck up, and just ignore each other, nothing good is going to come from this.",
            "I've read the over 100 combined pages of Fraser's 2 documents and Kirst's 1. A lot of both sides (near 90%, in fact) is pure hearsay. Things under the following categories cannot be regarded as reliable evidence: \n\n* Messages each of them sent to friends talking about the relationship, which of course can be made up or filtered through their personal bias\n* Public social media posts each of them made in the past expressing gratitude or joy at aspects of the relationship, when this type of content would of course want to paint a positive public picture regardless.\n* Screencaps of exchanges between Fraser and Kirst in which they still disagree on the interpretation of an incident, hence leaving no decisive conclusion as to what is the truth.\n* Long explanatory texts from either party explaining their interpretation and feelings around an incident with no supporting evidence.\n\nThrowing out all the inconclusive types of points listed above, here is what I could gather about the proven infractions of both parties.\n\nKirst:\n\n* On at least two occasions, she used guilt to try to pressure Fraser into sex. The incident where she immediately guilts him saying his rejections of breakup sex made her conscious about her weight, as well as a separate incident where she again guilts him by expressing disappointment that he didn't take things further when she got on top of him naked and (in her own words) begged him to initiate sex.\n* Her own account and the evidence does suggest that her eating disorder came about more so due to her own interpretations and insecurities. Fraser never asked or implied that she needed to diet, lose weight, nor did he insult her weight. The evidence supports the opposite of her claim that Fraser is responsible for her eating disorder. It is unfounded for her to so strongly and publicly blame something caused by her own insecurities on Fraser.\n\nFraser:\n\n* Knew his dog attacked Kirst multiple times, including at least one attack putting her in the hospital and another leaving her trapped on top of the couch for 2 hours. Even after that, He was callous and stubborn, not taking his dog's training seriously and sending Kirst defiant messages tilting her about the dog doing things outside the training restrictions. Fraser's rebuttal doesn't sufficient address this, they largely amount to listing examples of where Kirst spoke positively about the dog even after the attacks, which proves nothing.\n* He did say \"let's have sex at the spa\" ahead of one of their travels. This is extremely inappropriate given that it is a public space. Kirst further claims that Fraser tried to coerce her into sex while at a spa, which Fraser denies. Neither side has evidence for or against it going further than Fraser's inappropriate \"let's have sex at the spa\" comment ahead of the trip.\n\nThe 'financial dependency' point, both of them were at fault for it:\n\n* Fraser was clingy at the start of the relationship and was the one to push for Kirst to move in with him and allow him to cover rent. While he didn't force or threaten, he was pushy and insistent at the start despite Kirst expressing reservations.\n* Kirst did make hints to Fraser that she was dissatisfied with her regular job and was enthusiastic and agreeable when he suggested an arrangement to help with this that made her financially dependent on him.\n* After they broke up, Kirst continued to live in their shared flat for free for months. During this time: Fraser did not understand how unhappy and cut off Kirst felt from her \"real\" support networks and life despite having more than sufficient shelter in a home he was paying for. Kirst similarly overlooked the huge amount of financial support Fraser was giving her and expected him to read her mind and put all the blame on him for an arrangement she has co-developed with him from the start. I do not believe that her efforts to scale back on luxuries and save up enough to move away from Fraser are aligned with how badly she claims she needed to get away from him, including turning down Fraser's offer to put himself on the hook legally to fund the first few months of a separate home for her.",
            "None of this should’ve been made public. This isn’t someone taking down their abuser, this is the dirty laundry of a toxic and immature relationship being aired out in public for no reason."
        ]
    },
    "Former Twitch employee reveals why Ex Twitch Streamer, DrDisrespect, was banned off the platform": {
        "title": "Former Twitch employee reveals why Ex Twitch Streamer, DrDisrespect, was banned off the platform",
        "score": 968,
        "url": "https://www.reddit.com/r/youtubedrama/comments/1dlkgvm/former_twitch_employee_reveals_why_ex_twitch/",
        "content": "While this is mostly Twitch related, DrDisrespect currently streams on YouTube. Not sure what flair to use, but christ.\n\nhttps://preview.redd.it/sjwoaqm0318d1.png?width=752&format=png&auto=webp&s=9eae2f7d0e9cfdadf071816d7793111fecd704d4\n\n",
        "num_comments": 175,
        "comments": [
            "Doc tweeted this.\n\nhttps://x.com/DrDisrespect/status/1804337822415097955\n\nI like how his response is \"the matter was settled, no wrongdoing was acknowledged\" instead of, oh I don't know, saying he's not in fact a pedo sex pest????",
            "Damn terrible if true, I remember he got in controversy around the time for cheating on his wife but this is obviously way worse.\n\nI do wonder why did Twitch not come out with this when the ban happened? I understand companies \"have their reasons\" but I think someone who has clearly abused his fame as a streamer before should've been exposed.",
            "Doc is like Nickmercs and says stuff like like “protect the kids” but it’s always the people who say that turn out to be the predator and pervert.",
            "oh man, Dr Disrepect’s response is probably the worst I have ever seen. ‘No wrongdoing was acknowledged’ \n\nbruh, that’s so fucking weak\n\nhttps://x.com/drdisrespect/status/1804337822415097955?s=46",
            "Additionally, here's a thread of multiple journalists backing this claim. [https://x.com/zachbussey/status/1804313116110418033](https://x.com/zachbussey/status/1804313116110418033)",
            "complete utter cornball turns out to be a creep, my heart is broken",
            "It makes sense that it would be him when you think about it. Now, the only thing I know about Dr. Disrespect is through The Right Opinion's video on him that he made a year ago, but the timeline adds up.\n\nIn the video Dr. Disrespect was like \"why am I banned?!\" Sometime after Twitch told him he was like \"oh. They told me. Don't bother them about it anymore. I'm not gonna say why it is.\"\n\nHe probably didn't know that the people running the website could see his \"Whispers.\" So he thought that it was for some biased reason or whatever. But once they told him that they could see what he was doing he probably had this \"oh shit\" moment and decided that it'd be best if people didn't push Twitch into telling them after all.",
            "I’m not sure if this quite falls into the “when people tell you who they are, believe them” category, but it has to be at least part of the way there. His screen name was “Dr Disrespect” and his character was a rude creep on purpose.",
            "[https://x.com/BlGGESTHATER/status/1804326030611718652](https://x.com/BlGGESTHATER/status/1804326030611718652)\n\n  \nmore evidence for the pile",
            "all the people saying \"if true why didn't twitch call him out publicly\" need to realise that real life doesn't work like drama youtube."
        ]
    },
    "DrDisrespect addresses the recent allegations: “…this has been settled, no wrongdoing was acknowledged.”": {
        "title": "DrDisrespect addresses the recent allegations: “…this has been settled, no wrongdoing was acknowledged.”",
        "score": 338,
        "url": "https://www.reddit.com/r/youtubedrama/comments/1dlm7ar/drdisrespect_addresses_the_recent_allegations/",
        "content": "https://x.com/drdisrespect/status/1804337822415097955?s=46\n\n*”Jake seriously... I get it, it’s a hot topic but this has been settled, no wrongdoing was acknowledged and they paid out the whole contract.”*\n\nOh that mother fucker did it",
        "num_comments": 50,
        "comments": [
            "\"did you kill that dude?\"\n\n\"The courts said no\"",
            "Responding to pedo allegations with, “no wrongdoing was acknowledged” is craaaazy lol",
            "there's a clip of him intentionally flashing the screen to give users a seizure after he was informed of somebody's photosensitivity. not nearly as bad as this stuff, but he's always been a massive jackass and this seems to fit right into his character. i hope it gets taken seriously, but i'm sure his orbiters will rally to his defense none the less",
            "\"i did that shit AND I still got paid.\"",
            "Didn’t this dude recently jump on the “trans people are groomers” train?\n\nBecause good god. Every single accusation is a confession with these lunatics.",
            "That... is not a denial.",
            "DrDisrespecting age of consent laws",
            "What kind of shit response is that?",
            "Hey! Fuck this guy!",
            "Ok I know of Dr disrespect but don't really follow or keep up with him. I still want to know what is going on ..... Can I get a short version/catch-up/recap or some context?"
        ]
    },
    "JJJacksfilms (Jacksfilms) is bringing back \"Reactor Bingo\"": {
        "title": "JJJacksfilms (Jacksfilms) is bringing back \"Reactor Bingo\"",
        "score": 268,
        "url": "https://i.redd.it/4e4yti9g108d1.png",
        "content": "",
        "num_comments": 9,
        "comments": [
            "I’m sorry but what? Fucking Jason DeRulo (lmao I can’t even see his name without hearing him sing it in my head) does lazy react content now?!?!",
            "I’m glad. Fuck DDDoxxerwolf. ",
            "Good for him, genuinely. Make that bingo money.",
            "The fact that ~*Jason DeRulo*~ is a TikTok reactor now is still so weird to me that it’s kinda funny",
            "The question is, would Hasan  be considered to be on here?",
            "Yeaaah love them so much",
            "Yeah Jason Derulo uses youtube shorts and TikTok as a content farm, reposting other people's videos with his songs in the back. At first he was reusing a video of him reacting in the corner bit now I don't think he even does that lmao",
            "January, February, March, April, May, June, *~Jason Derulo~*",
            "It's weird, doesn't he have so many followers on there because he does his own content that people like? Like if you want to use shorts at least use your own ones. At least he credits the original creator of the short."
        ]
    }
}