{
    "Master Oogway is trying to disguise himself as a meme channel to get back on YouTube.": {
        "title": "Master Oogway is trying to disguise himself as a meme channel to get back on YouTube.",
        "score": 85,
        "url": "https://www.reddit.com/gallery/1dlr7vg",
        "content": "I was checking Master Oogways music channel, Yung Oogway, and when I searched him up, it wasn’t there. I was fast enough to see him change his name, but not his pfp in time.YouTube even snitched on him by bringing me to this new channel “Bubbi Memes”, when I searched up “yung oogway”.Whats even worse is that he deleted the videos showing his face, so he’s really trying to hide. \nThis is just pathetic.",
        "num_comments": 36,
        "comments": [
            "For a guy who was talking about his other \"businesses\" and didn't need YouTube. He sure as hell wants to keep YouTube.",
            "Can someone gimme the lore about this whole situation from the start? I'm not aware",
            "yep this is real",
            "Update: This is real. If you look at the comments of his oldest video,there are comments talking about his downfall. Even his older videos still used his music. This is 100% master Oogway",
            "Owww poor bubbi",
            "yep this is real",
            "I also made a post about him.\nHe even changed his profile picture, and posts\nComments saying: Hi im \"new channel name\"...",
            "A little bit ootl, who is this?",
            "y'all need a sense of dark humor.",
            "yall really hate this guy like wth if yall acc care get the sideboys banned next"
        ]
    },
    "What is the laziest type of content you have seen on this platform?": {
        "title": "What is the laziest type of content you have seen on this platform?",
        "score": 40,
        "url": "https://i.redd.it/yzeaoz7gr38d1.png",
        "content": "",
        "num_comments": 23,
        "comments": [
            "IMO green screen kids take the least amount of effort out of all of these",
            "Can someone explain to me why the green screen kid ones never talk aswell?  they literally just pull a face and point diagonally",
            "The thing that bothers me is how the text to speech one’s are just AI and that no one is really behind it except for the guy collecting his millions of dollars. It’s truly lazy and some people make several of the accounts and copy videos without permission. But I believe the stolen video thing is an issue with nearly all of these.",
            "Green screen kids but some reaction videos can be entering to watch",
            "Nah Reaction videos are great (Some of them)",
            "I fucking hate Asmongold with the bane of my existence",
            "The ones with reactions. But don't get me wrong. There are some really good reactions when a person complements the video they're watching. But if it's just a person sitting there going \"wow,\" \"no way,\" \"geez\" with a stone face, it's not good.\n\nUPD: Or worse, a text memes from Twitter, 9gag, etc. And the person in the background is just reading it.\n\nThe worst thing is to see tens of thousands of likes on such videos.",
            "Gotta be staring to your soul, memes as a short form video (practically same as staring to your soul) and one video 5 different versions, atleast reaction videos are actually fun to watch",
            "100% green screen kidos🟢I hate em",
            "I swear the future generation is going to have problems with concentration because of all these *shorts,* but hopefully it's just a conspiracy and I'm just ancient and wrong."
        ]
    },
    "Kids should really stop being allowed on this platform. But of course, YouTube won’t do anything.": {
        "title": "Kids should really stop being allowed on this platform. But of course, YouTube won’t do anything.",
        "score": 83,
        "url": "https://i.redd.it/int3crari28d1.jpeg",
        "content": "They also called me a Furry. Also please let me know if I flaired this wrong",
        "num_comments": 33,
        "comments": [
            "That’s crazy, also they comment like 17 times",
            "I fucking hate children that do shit like this, sorry for what happened to you",
            "If these people think being a furry is bad, wait until they learn about zoophiles\n\n\nFurry ≠ and > Zoophiles",
            "Its not like you can make a way to stop ppl faking their age anyway , unless you want youtube to be an official website that requires legal identification to be logged into which ain't happening any time soon",
            "They can't seem to understand any of modern humor and just shitspam \"ROFL\" at every comment they see",
            "I understand and I just say there a kids they just didn't know anything \n\n*BUT THIS TYPE OF KIDS WELL HOPE THEY READY COURSE I M GONNA WRITE THE NO NO WORD AND GIVE THEM THE PTHD*",
            "Their also one of the main reasons uttp police is still a thing.",
            "Just reply \"your*\" and leave 100% success rate",
            "Just ignore them like every other normal human being",
            "The only way to do that is providing ID like a driver's license when you sign up for YT. Otherwise, you can put whatever age you want when you sign up."
        ]
    },
    "Is YouTube getting worst? ": {
        "title": "Is YouTube getting worst? ",
        "score": 54,
        "url": "https://www.reddit.com/r/youtube/comments/1dlq1ci/is_youtube_getting_worst/",
        "content": "I‘m asking because YouTube has changed ",
        "num_comments": 58,
        "comments": [
            "Constantly. [Inevitably](https://en.wikipedia.org/wiki/Enshittification).",
            "yes. by a lot",
            "It's been getting worse for many years now.",
            "Did He Died?",
            "Yes.",
            "Yup.",
            "yes , especially shorts section",
            "A lot of which was just shooting themselves in the foot for no reason (removing YouTube dislike, changing UI, never updating the reply system to be ranked, ending YouTube Originals, never changing the flawed striking system etc) but a lot of which was necessary. \n\nThe company used to run at a net loss because of moderation and server costs. But this was fine as people invested in Alphabet (who own Google who own YouTube) so long as it increased its user base. Eventually it naturally stopped growing as fast and they had to implement more ads onto the site. \n\nYou’ll find this not only with YouTube but so many other companies like Spotify are recently increasing prices and profit centred features.",
            "YouTube is a community dependent platform, in that sight yes. YouTube’s community is getting worse every day.",
            "It's still just favorite thing and i gladly pay for premium. I don't have cable or TV so I watch almost everything from YouTube. I hate that AI seems to be taking over. Other than that I just search for what I'm interested in and don't see too much of an issue overall. "
        ]
    },
    "new UI looks like sh*t": {
        "title": "new UI looks like sh*t",
        "score": 329,
        "url": "https://www.reddit.com/r/youtube/comments/1dldhd0/new_ui_looks_like_sht/",
        "content": "Its incredible how these morons are finding new ways to ruin UI making it worse in every single way\n\nhope its just a test, otherwise I'll need some eye-bleach",
        "num_comments": 83,
        "comments": [
            "From what I could tell, it’s trying to copy over the Mobile UI over to desktop. It’s awful.",
            "came here to make sure it wasn't just me, literal ass. Youtube doesn't have a great track record of listening to criticism in the past but i pray that they reverse this, it looks like an obscure illegal pirating site layout.",
            "Just tried to save a video to a playlist and it says I can't because it's content made for kids. It's an instrumental version of Salt Shaker by Ying Yang Twins btw.\n\nI don't remember that being a thing before.",
            "I had the new UI for a couple weeks, but today it switched back to the old one for me. I didn't change or do anything. weird",
            "[Some ways to try to revert it](https://www.reddit.com/r/youtube/comments/1cx6glr/what_is_the_new_layout/l50hw1t/)",
            "I'm not putting up with it, and just swapped over to BiliBili LOL \n\nThey will keep doing dumb things without a competitor, plus, BiliBili cares a lot more about the viewer base, not that YouTube set the bar very high.",
            "omg its sooo bad. i fucking hate it.",
            "Download the enhancer for youtube extension, fixes the layout and adds other customizable features.",
            " I'm in the minority but I like it.",
            "It only uses the new f\\*ed up layout when I'm logged in."
        ]
    }
}