{
    "Q&A and Ruling Megathread - June 24, 2024": {
        "title": "Q&A and Ruling Megathread - June 24, 2024",
        "score": 7,
        "url": "https://www.reddit.com/r/yugioh/comments/1dn7dsq/qa_and_ruling_megathread_june_24_2024/",
        "content": "If you're asking for some information, put your question in the comments of this post. If you're discussing a topic, rather than asking for some information, you can make a separate post outside of this one.\n\nHere are examples of questions which belong in the comments of this thread:\n\n* Questions about the rules of Yu-Gi-Oh!\n\n* \"Is this card fake?\"\n\n* \"What are some good decks?\"\n\n* \"Has there been any news about X?\"\n\n* \"Where can I buy or sell cards?\"\n\n**Resources**\n\n* [Yugioh101 Rules Resources](https://www.reddit.com/r/Yugioh101/wiki/judge_resources) \n* [Discord Servers for most decks](https://www.reddit.com/r/yugioh/wiki/discordrepository) \n* [/r/Yugioh101 Subreddit](https://www.reddit.com/r/Yugioh101/)\n* [/r/Yugioh FAQ](https://www.reddit.com/r/yugioh/wiki/faq)  \n* [/r/Yugioh Discord Server](https://discord.gg/yugioh)   \n* [Yugipedia](https://yugipedia.com) \n* [Official Yu-Gi-Oh! Website](http://www.yugioh-card.com)",
        "num_comments": 117,
        "comments": [
            "when Shiranui Samurai attack face-down Amaterasu, does Amaterasu effect to banish can activate after it is banished by Shiranui Samurai?",
            "I bought some sleeves recently from Japan, after looking at them a bit more carefully, they are a lot larger than ordinary sleeves, 92 x 67 mm. I want to use them, but in order to do so I probably should double sleeve so they don't break easily. Any ideas on a brand of sleeves I can use to put on top of these very large sleeves?",
            "Where can I find rush duel OCG meta deck lists, both past and present?",
            " Is there any circumstance where Ancient Gear Golem preventing the activation of Spell/Trap Cards while attacking becomes relevant for Spells Cards that aren't Quick-Play Spell Cards?",
            "Hey, I'm watching Yugioh Zexal right now and I'm at the beginning of the World duel carnival, how long until the series gets more serious and especially until yuma becomes a better duelist? Because at the moment it's a bit boring and I keep hoping it will get better.",
            "{{Horned Saurus}}\n\nThe turn it is fusion summoned: can I activate both effects in that said turn? Meaning I can set a Field Spell from my deck and extra normal a Dinosaur monster?",
            "Is there anywhere where I can organize a trade for cards online? I recently pulled a QCR Branded Fusion and I kinda just want to trade it for other cards instead of trying to sell it to buy the cards I want.",
            "How much would a counter counter misprint go for? (It's not a counter trap, just a regular one) In decent condition. I think it would be near mint or lightly played? Not sure",
            "if anyone reads this, im new to opening yugioh cards. im opening rarity collection and im having a hard time differentiating between rare, super rare and ultra rare. im using the Collectr app and in the photos they look exactly the same. is there a way to tell the diff between these 2? \n\nmaybe im dumb and its obvious but if anyone can let me know id appreciate it.",
            "How does the ruling between Bagooska and Melodious Bacha work? I was under the impression that if you had out a fusion summoned melodious bacha you could still activate the effects of your melodious fusion monsters through the bagooska, but Im also bad at the game so I could be wrong"
        ]
    },
    "[Spoilers] Yu-Gi-Oh! GO RUSH!! Discussion - June 22, 2024": {
        "title": "[Spoilers] Yu-Gi-Oh! GO RUSH!! Discussion - June 22, 2024",
        "score": 20,
        "url": "https://www.reddit.com/r/yugioh/comments/1dm7d8i/spoilers_yugioh_go_rush_discussion_june_22_2024/",
        "content": "",
        "num_comments": 41,
        "comments": [
            "The Dark Meister vs Zwijo duel now kinda gets an additional layer of funny\n\nYuamu was still salty about the curry bread plate incident",
            "The secret's out!  Yuamu with no glasses!",
            "I guess Dark Meister being Yuamu is not a surprise because everyone has expected that since the poster, I mean Yuamu is not on the poster but there is a mysterious female character instead, who else can she be? I would like to hear Kokos voice as Dark Meister live because its hard to believe that its hers although she is credited for voicing both Yuamu and Dark Meister in the ending (and Kuyamuya is voiced by another person). Some VAs do have impressive range but Koko is too young for that tbh. Anyway, Dark Meister being a main character means she will be one of the villains with the most on screen duels, of course still behind Supreme King Judai because that is Judai. And I think she is currently the female lead facing against a main protagonist on-screen the most which is 3 times, but still cant beat a main protagonist unlike Romin. Now the duel, Yudias seems to like using Galactica Providence which makes sense because it is arguably one of the best equip spells in his deck and in the show. It increases ATK and protects monsters from destroying effects. Outside of people using legend cards like Luke with Pot of Greed, I think Yuamu is the first character using a draw-at-least-2-cards effect in Rush universe. She really flexes and shows that she is the true master of Enigmata. It has much more ATK and a new attack animation compared to when being used by the henchmen. And we have another instance of people who can read. Dark Matter Dragon is just summoned and everyone knows that it cannot destroy Oblivion equipped with Providence. It seems Dragon will be just a fusion material in this duel.\n\nNext episode is probably mostly Yuamu talking about her way of reviving the Velgearians. Of course Emperor Dragon will be summoned, but I wonder if Yudias will somehow have Contact Fusion in order to defeat Yuamu. A logical way of explaining this that I can think of is Zuwijo tampering with Yudias deck in their previous duel.",
            "Seriously, that was a twist so predictable, even Swirly's reveal was SLIGHTLY better.",
            "Oh my theorizing from seeing her on the poster was right. What's she looking for in the Currybread?",
            "Where can I watch the full episode of this?",
            "I have very little doubt that Yuamu will unfortunately lose to Yudias for the 3rd time in a row.\n\nBut, her defeating Zwijo a few episodes ago, who was only allowed to lose to Yudias, was already a very good feat at least.",
            "Unless there's more then good explanation for it, Yuamu isn't good writen Yugioh female lead anymore. \n\nWell looks like, Yugioh is returning to it's root to write bad female leads.",
            "The Star Wars is strong with this one",
            "In hindsight, given the many other Star Wars parallels/references and how much this one has mapped to the prequels, really should have seen someone falling to the Dark Side."
        ]
    },
    "TIL: for some reason, the Zexal dub never refers to Gagaga Child by its actual name. They always call him \"this little fella\" or some variation.": {
        "title": "TIL: for some reason, the Zexal dub never refers to Gagaga Child by its actual name. They always call him \"this little fella\" or some variation.",
        "score": 99,
        "url": "https://i.redd.it/lzoa4hxm2h9d1.png",
        "content": "",
        "num_comments": 9,
        "comments": [
            "Something similar happens with Gimmick Puppet Nightmare: it is never seen directly. The few times it's shown on screen, it already starts to glow purple as it gets overlayed.",
            "Man who knew Gagaga Magician was obsessed with popsicles as a kid.",
            "Probably cuz its a pain the ass to keep saying Gagaga child everytime hahaha.",
            "Same with Shadow Feeler. We never get to see it on screen (I think), probably for the same reasons Nightmare was never really shown",
            "I don't think child and Magician are the same person.",
            "Noone can match his freak",
            "Yeah, that would be a horrible sight to see animated.",
            "Gimp Puppet",
            "They probably decided it was too freaky to show to kids, and I can *kinda* see why they'd think that:\n\nhttps://preview.redd.it/e3znhj577h9d1.png?width=395&format=pjpg&auto=webp&s=0ad391a2925a2f12d4c46a81906cafcb47d53248"
        ]
    },
    "Is there anyone else playing this game?": {
        "title": "Is there anyone else playing this game?",
        "score": 170,
        "url": "https://i.redd.it/b0r1417itf9d1.png",
        "content": "I'm thinking about buying it Is it worth it? ",
        "num_comments": 84,
        "comments": [
            "Its a great game especially on sale the only issue with Yugioh games is the games become outdated fast as new packs come out that game is a couple of years old so the meta will be different.",
            "I do miss having a proper campaign unlike master duel",
            "This legit got me into the game again. So addicting",
            "I used to play this and it was fun. Able to play as characters from almost every series with such a huge card pool. But after playing Duel Links and Master Duel, I felt the game is slow and outdated so I kinda had difficulties playing it again.",
            "I used to run a mean deskbot deck in this game.",
            "I haven't played in a few years, but yeah, it's a pretty great game",
            "Not since an associate of mine modded Master Duel so that it has Link Evolution's campaign.  I've got no reason to go back.",
            "I go back to it often. I put so many hours into Link Evolution!",
            "Its really good for PvE but PvP is impossible basically since no one uses the PVP mode anymore.",
            "I was and then I got to a point where it kept lagging really horribly and never figured out why. It was against the Altergeist deck in the Vrains era."
        ]
    },
    "Back when Arc-V was Peak in early S1:": {
        "title": "Back when Arc-V was Peak in early S1:",
        "score": 27,
        "url": "https://i.redd.it/21yufuk16i9d1.jpeg",
        "content": "",
        "num_comments": 21,
        "comments": [
            "Yuto and his Phantom Knights were too cool to be left alive ;(",
            "Youre so right. I was very invested in Yuzu. And the debuts of Yuto and Shun were ",
            "The point where the Gallop anime goes downhill after that",
            ">Man Arc-V arguably had one of the best first seasons in any Yu-Gi-Oh! Show\n\nI'd say, Arc-V had the strongest 1st season in entire Yu-Gi-Oh franchise. The premise of interdimensional war is just that good as a focus point. That's why the trainwreck feels bitter until this day.",
            "Also, we can't forget the The Lady who defected from the Villainous Group and always stands her ground: Serena\n\nExactly, the Cast and the plot idea were perfect. It's just the seasons afterwards that were the problem. The Synchro Arc was dragged out, The Xyz Arc was just a Pit Stop and The Fusion Arc pulled up with some of the most anticlimactic stuff ever. Then they proceed to forgive Leo Akaba and let bygones be bygones and try to make us think this is a happy ending.",
            "Fr, imagine they killed him off because he and the Phantom Knights eclipsed the others in popularity at the time.\n\nHonestly, we deserve new PK Rank 3s and PK Pendulums as well just get that over with.",
            "The moment Yuto pushed Sawatari's underling down to the ground, that's when Sawatari should've realized that he wasn't gonna win this one. \n\nIt's crazy how Yuto was still within the Top 5  most popular Arc-V characters even after his death. My goodness people just wanted Yuto to return with his original body every new episode.",
            "Those three were the stars of S1 for me, like the moment they killed off Yuto and turned Yuzu in a damsel in distress, the show didn't hit the same anymore. Man I wish Arc-V can be remade, it's the show with the most potential out of all of them ffs.",
            "Yeah, I know they want to sell new archetypes all the time, but it really wouldn't hurt to give Arc-V another chance, since it is the series with the most potential and could've been a masterpiece.\n\nI'm surprised they heavily missed out with the Yu-Boy and Bracelet Girl interactions. It really feels like they all hardly know each other. Heck Yuri who's supposed to be Yuya's Antithesis only met him once prior to their inevitable clash in the Fusion Dimension.",
            "Yuya and Yuzu lived on with their own bodies while their counterparts became mere fragments inside them. What a happy, fair ending."
        ]
    }
}