{
    "Q&A and Ruling Megathread - June 17, 2024": {
        "title": "Q&A and Ruling Megathread - June 17, 2024",
        "score": 5,
        "url": "https://www.reddit.com/r/yugioh/comments/1dhrzc4/qa_and_ruling_megathread_june_17_2024/",
        "content": "If you're asking for some information, put your question in the comments of this post. If you're discussing a topic, rather than asking for some information, you can make a separate post outside of this one.\n\nHere are examples of questions which belong in the comments of this thread:\n\n* Questions about the rules of Yu-Gi-Oh!\n\n* \"Is this card fake?\"\n\n* \"What are some good decks?\"\n\n* \"Has there been any news about X?\"\n\n* \"Where can I buy or sell cards?\"\n\n**Resources**\n\n* [Yugioh101 Rules Resources](https://www.reddit.com/r/Yugioh101/wiki/judge_resources) \n* [Discord Servers for most decks](https://www.reddit.com/r/yugioh/wiki/discordrepository) \n* [/r/Yugioh101 Subreddit](https://www.reddit.com/r/Yugioh101/)\n* [/r/Yugioh FAQ](https://www.reddit.com/r/yugioh/wiki/faq)  \n* [/r/Yugioh Discord Server](https://discord.gg/yugioh)   \n* [Yugipedia](https://yugipedia.com) \n* [Official Yu-Gi-Oh! Website](http://www.yugioh-card.com)",
        "num_comments": 128,
        "comments": [
            "Asking again.\n\nAhem. Melodious engine players, do you need need a third fusion to add Etoile to the end board if you already used Bacha for something else?",
            "Does Defense Zone allow Abyss Stungray to protect itself?",
            "How exactly do F.A. cards interact with  Megalith Promotion? Dawn Dragster in particular?",
            "I control F.A. Dead Heat and That Six. Upon resolution of Dead Heat, how many dice results can I change and which?",
            "I've been trying to sell my cards that I had when I was a kid. And someone saw my booster pack wrappers and wants to buy them. Are they really worth anything?",
            "Animation Chronicle releases on the 22nd (saturday). Any chance will see a reveal for AC04-JP005 before the release day? It’s the only “bakura card” left unrevealed. Or do they usually leave some cards unrevealed until release day?",
            "raffleisia has \"meets its activation requirement\" ,rollback doesn't . am i missing something or clarification text or another case of a psct making things more confusing like old darkworlds",
            "Is it alright to ask for SoCal ots locations here?",
            "so when pendelum summoning, does the number on the card itself count as a summonable level as well? for example, if i have 2 and 5, can i only summon 3 and 4? or will i be able to summon 2 and 5 as well?\n\n  \nif a card reads \"draw one card, if the card is a spell: bla bla bla. if the card is a monster: bla bla bla.\" what occurs if you draw a pendelum card? am i allowed to choose which it represents as?\n\nto further this question, if the effect tells me to special summon the monster i draw, but the monster says that it cannot be special summoned, what happens? is it shuffled into the deck and the effect is negated? or would i redraw after shuffling? if the card effect causing me to draw reads \"this effect cannot be negated\" what happens then?\n\nwere pendelum zones themselves removed/conjoined with 2 of the spell slots with the addition of link monsters?\n\n\n\ncan you summon a pendelum monster into a monster zone? if so, does it keep the effect at the bottom? or does that only apply if it is in a spell zone? also, the effect between the pendelum levels, does that only register in the spell and  pendelum zones?\n\n  \ncan a pendelum monster be attacked if it is in a pendelum zone? can a pendelum monster attack if it is in a pendelum zone?",
            "Looking for some similar designs to this. Holiday related stuff, folklore, etc\n\nhttps://preview.redd.it/dzxzon2y7d7d1.png?width=540&format=png&auto=webp&s=d7414a80bfec1f252811cd425898e9858caac7ff"
        ]
    },
    "Is this a deck?": {
        "title": "Is this a deck?",
        "score": 62,
        "url": "https://www.reddit.com/gallery/1dlnklf",
        "content": "So I recently found a tin of yugioh cards at a thrift store and while looking through them I noticed a good amount were sleeved with blue cases. I want to know if these cards make up some deck someone once had. I know nothing about Yugiog so that's why I am asking.",
        "num_comments": 23,
        "comments": [
            "It was probably someone’s playground deck. A version of this was certainly competitive 11-12 years ago but this build is nowhere near viable even for that time. You can look up Mermail.",
            "Generic WATER lightly swarm deck.  Sprinkle in a little bit of beat down.",
            "Wholesome budget deck",
            "It is indeed a deck. A somewhat low budget Mermail deck to be precise",
            "I mean, it’s over 40 cards. Passes the vibe check here",
            "It’s a pretty dated Mermail deck that should be fairly cheap to modernize. With **Tidal, Dragon Ruler of Waterfalls** back at one copy per deck and the boatload of new WATER support, there’s plenty of room to tinker.",
            "Yeah its a deck. Its a pretty weak Mermail deck. All those cards are pretty dated to its probably from like 2014 or so?",
            "60 cards total. Good amount of monster, spell and trap… looks like a deck to me.",
            "Definitely a deck, but a very low power one. Should be fine depending on who you're gonna play with",
            "It is definitely legal as a deck at the very least. Seeing as there are a lot of playsets and synergies, I imagine it was certainly built to be played as a deck."
        ]
    },
    "Alright, which of them got out of their comfort zone and invited the other on a Date in Vrains while wearing their school uniforms:": {
        "title": "Alright, which of them got out of their comfort zone and invited the other on a Date in Vrains while wearing their school uniforms:",
        "score": 170,
        "url": "https://i.redd.it/174deqgd108d1.jpeg",
        "content": "",
        "num_comments": 10,
        "comments": [
            "It's really hard to tell, seeing as both of them are really socially anxious, owing to their past experiences. Aoi made one friend duringher childhood, but that friend was taken away from here after a misunderstanding, while Yusaku mostly kept to himself on purpose albeit he did have Kusanagi as an important figure in his life. I can't blame him for being the way he currently is, after all the Lost Incident was horrifying for everyone besides Specter.\n\nI'm honestly inclined to believe it was Aoi, she probably figured that she can fix him.",
            "\"Hey, wanna go on a date?\"\n\n\n\n\"Sure! Where to? A nice restaurant? A picnic at the park? A trip to the aquarium?\"\n\n\n\n\n\"What? None of that noise. We're playing Yugioh on the Internet together!\"",
            "Aoi, hands down.\n\nI admit that I'm a huge Vrains hater, but I legit do not think Yusaku really grows as a person throughout the show. He never actually heals from his trauma and his relationship with his friends is lukewarm at best. It's just Ai and Soulburner that attach themselves to Yusaku and he just accepts it. He never made the first move and since we never see them being friends and actually hang out we don't even see him send the first invite. So no, I think he's forever shy.\n\nAoi, on the other hand, we actively see her want to be a better person and understand the Lost Victims and even when she's getting shafted hard she doesn't give up and keeps wanting to help. It's because of that that I can see this translate into her real life where she wants to improve her self-confidence and be like Blue Angel where she can reach out to Yusaku and make the first move.",
            "Aoi FOURTH avatar: Blue schoolgirl...",
            "Credits:\n\nhttps://www.pixiv.net/en/artworks/71045145",
            "Wholesome man!! Good work",
            "So basically like Yusei?",
            "Also, \"While wearing our school uniforms\"\n\n\"WE ARE!?\"",
            "Genuinely this was my biggest problem with bringing in Soulburner in Season 2 as it felt like him being the one to let go of his trauma should have been Playmaker's character development instead after the death of Revolver's father.",
            "Next thing you know she'll become Blue Goth Girl and she starts taking revenge against the writers by winning some damn Duels."
        ]
    },
    "How would you rate the protagonists and rivals archetypes?": {
        "title": "How would you rate the protagonists and rivals archetypes?",
        "score": 58,
        "url": "https://www.reddit.com/gallery/1dlmmrj",
        "content": "Be aware I'm typing on my phone.\nA while ago before it got removed I asked this same question with the protagonists only. I was going do the same thing with the rivals but I found the pic above and it gives me this idea. \n\nSo if hypothetically someone wants to play Yu-Gi-Oh card competitive with one of these archetypes who archetype it be and why? Yes rush duel characters are included. \nI asking for my reasons: \nOne I was curious about which rivals archetypes are competitively viable \nTwo: to between the protagonists and rivals which group have the better deck/archetypes for competitive Yu-Gi-Oh.\nThree: also thought it an fun question to ask. I someone who been off on with Yu-Gi-Oh since ARC V and barely an average player. I use anime decks of Jaden/judai and Yuma since I like both protagonists and series it a nice bonus learning those are the most competitively viable decks with the protags and i am basic like picking the main character in an game pretty much every time basic.  So yeah with that out of the way which archetype/deck is the best of the best!",
        "num_comments": 21,
        "comments": [
            "Ojama 11/10 my main deck of choice",
            "Varis bodies almost everyone on this list. Dragon Link is a long-standing competitive performer, as much as I dislike it. The closest one would arguably be Kaiba, even if only because Blue Eyes took Worlds.",
            "For me, RDA is my main deck, so Jack Atlas is definitely the best, IMO. But for second I'd have to go with Rokkets for how game warping Dragon-link became and how solid the strategy still is, even with all of its bans(could you imagine full power Dragon-link now holy).\nThird place would be Hero due to being such a fun fusion deck. Fourth would be Blue Eyes, because it's just a fun deck for beginners and casuals, sure you will be beaten plot by meta with this, but it's a great deck to start out the game with. Fifth would be Cyberse, due to the cracked staples of Linkuriboh, Pre-Errata firewall, and Accesscode Talker. Next would be Sychron, as while it doesn't have the consistency of RDA and the Resonators, it makes up for it with cracked as hell, near un breakable end boards thanks to Cosmic Quasar Dragon, Crimson Dragon, Barronne, Clear Wing, Accel Sychro Stardust and more. Next would be Utopia for how solid of an OTK strat. This is followed by Galaxy-Eyes, as with the new support, it makes it a lot better than it once was. After this are decks I have very little experience with, like any pendulum archetypes, Ojama, and Little Yugi's toy box deck. Then at last is Dark Magician. Why is it last? For the Master Duel DM wankers who play this. I am so sick of seeing Dark Magical Circle pick apart my entire field one card at a time when I have card effects set to Auto, so they were the bane of my early MD experience.",
            "Okay so for protag:\n\nYugi+ Atem is hard to take into account as their various sub archetypes seeing usage recently(millenium + toy) and magician souls is quite decent.\n\nHeroes is most cohensive strat if you also count the rival's edo phoenix destiny heroes card.\n\nSynchron I think is the weakest and also hard to take advantage of from its good synchro pool.The stardust synchro is good but really hard to summon and usually not worth the effort(until crimson dragon enabling easy access to lv12 accel synchro dragon).\n\nYuma only gives funny otk tools and s0.\nUtopia and the equip + otk gimmick is just okay,not as strong.\n\nPendulum is the strongest from the pend magician performapal and odd eyes card,the deck has strong easy to summon omni negate,ways to flood with advantage and looping potential with some of the pieces,and deck having easy time setting up hidden village lock.\n\nFirewall and cyberse deck is just okay,they can form decent board and easy otk but having to play too many brick and ending up using all the extra deck for link climb and no easy way to recur and recycle all the pieces unlike heroes(from their various gy effect) or pendulum(the mechanic ability to pendulum summon).\nFirewall and accesscode are ones of the most prominient link of the game\n\nFor rival:\nKaiba blue eyes is just bricky and what they do isn't impressive now and blue eyes does not give much generic cards to other strats.\n\nChazz,Kaiba Union has showing in the past and really strong support annoucement recently so the future is good.\n\nChazz LAD dragon sees heavy play in drulers format.\n\nRDA by Jack is quite strong as pure standard deck go but deck does not adapt its endboard well or having specific chokepoint on some cards.\n\nShark is good(mostly because toad is insane),some of the new shark card quite fine.\n\nKeito(galaxy eyes) does not have any efficient combo but his cards sees usage in other decks for endboard pieces(galaxy solider -> nova) and galaxy eyes dark matter dragon to combo.\n\nddd is strong near the end of pend era but the deck is archaic now as pend mechanic is nerfed and the mons it runs look like nerfed version of many modern cards.\n\nDragon link is really quite good with the generic light/dark dragon and many of the dragon mons in anime see plays in link era or even now because the effect on them are good and worth the mat(topologic,borrel card).",
            "Yusaku, his Cyberse deck is basically a cheat (I love him a lot but I have to admit that his plot armor is the strongest)",
            "Judai/Jaden, Yusei and probably Yuma close for the protags. Heroes need the support from non-hero cards to be truly successful but are always at events. Synchrons are just nuts, if you get your combos going it’s GG. Yuma and his Utopia evolutions are pretty good also, not meta relevant or competitive but have some really high power when done right.\n\nVaris would be the best of the lot for the rivals. The strategy doesn’t even compare to the rest of them, it’s so much better. Synchro and Link boss monsters that would derail any other strategy, Borreload Dragon is insane both in design and application.",
            "well Yugi is the only choice; classic anime is good. Never seen the other generations neither I am interested in a series without yugi.",
            "I surprised that Synchrons placed high. My old post  people usually have placed synchrons middle of the road or a least third place behind heroes and utopia/onomatopoeia",
            "From worst to best (omitting Yuga and Luke) Protagonists:\n\n7: Yugi various toy related cards (weak and inconsistent)\n\n6: Yuya “Performapal” (pendulums got nerfed HARD)\n\n5: Playmaker “Cyberse” (firewall was also nerfed)\n\n4: Atem “Dark Magician” (consistent but really low power ceiling)\n\n3: Judai “HERO” (really expensive + need lots of non-Judai HERO cards\n\n2: Yusei “Synchrons”\n\n1: Yuma “Utopia/Number/Onomat” \n\n1 & 2 are pretty interchangeable imo. I think Utopia has a higher ceiling but it also has less room for non engine.\n\nRivals are a lot harder to rank than protagonists because they are mostly weaker:\n\n7/6/5: Manjoume “Ojama” is the definition of jank\n\n7/6/5: Reiji “D/D(/D/D)” MR3 pendulums are asinine\n\n7/6/5: Shark “Water” it’s just random water attribute cards. The only good card in his deck is also a “Number” monster\n\n4/3: Kaito “Galaxy Eyes” has some cool stuff but it’s generally weak\n\n4/3: Varis “Rokkets” not too sure about this archetype but they aren’t relevant in this day and age. Putting it here cus I’ve heard of it being decent in MR4\n\n2: Blue Eyes. Consistent and somewhat powerful. Still gets some play. Not enough to be relevant though.\n\n1: Atlas “Red Dragon Archfiend” Is the deck I’m playing right now. It’s really consistent, plays through interruptions if you’re lucky. And has multiple board wipes and omnis that are easy to get turn one.\n\n\nIf you had to choose one of these archetypes to play, I’d. Say that playing RDA would be best in the physical game (we just got a structure deck). Utopias are about the same price and just as strong, so you can also play that if you truly desire.",
            "If we are talking competitive viability its HEROes, and its not even close.\nJust look at latest tournament standings, of course they are not dominant, but they are present and are a force in the right hands"
        ]
    },
    "Some more UV Faded cards from my first batch.": {
        "title": "Some more UV Faded cards from my first batch.",
        "score": 106,
        "url": "https://www.reddit.com/gallery/1dlhoq8",
        "content": "These have all been under two UV light bulbs for about 2-1/2 months.  I cut the artwork out of bulk commons to create a shield that will only expose the artwork for fading these cards.  This method isn’t the best because the centering I slightly different on each card but I was already committed once I learned my mistake.",
        "num_comments": 18,
        "comments": [
            "He turned Dark Magician into a synchro lol",
            "how does the foil work with that?",
            "Would faded cards like this still be playable? Might want to try this myself.",
            "D.I.Y Ghost Rares.",
            "Idk, not really a fan of this. It's just like when people cut the cards to make them in 3D... it's just....idk",
            "So can you do the same thing to BE and DM with the older art? however this time can you do 2 of each? 1 full card and the other cover the image so only the card art remains protected.",
            "How are you changing the gold lettering to silver like you did for Dark Armed Dragon?",
            "Are these legal outside of casual.",
            "Legendary Dark Speaker Magician\nDark Level 9 \nSpellcaster Synchro Effect\nATK 2500 DEF 2700\n1 Tuner + 1 non-Effect Monster\n\nFor this card's Synchro Summon, you can treat 1 DARK Spellcaster monster you control as a Level 1 or Level 2 Tuner. If this card is Special Summoned: Add 1 “Timaeus”, “Critias”, or “Hermos” card from your Deck or GY to your hand. If your opponent activates a card or effect (Quick Effect): You can reveal 1 “Legendary Dragon” Spell from your hand; Special Summon 1 Normal monster from your Deck, then this effect becomes the revealed card’s effect when that card is activated. You can only use each effect of “Legendary Dark Speaker Magician” once per turn.",
            "Sun's UV rays \"break down\" the color pigments in the art"
        ]
    }
}