{
    "G-Helper - The Armoury Crate Replacement You Should Know About.": {
        "title": "G-Helper - The Armoury Crate Replacement You Should Know About.",
        "score": 468,
        "url": "https://www.youtube.com/watch?v=6aVdwJKZSSc",
        "content": "",
        "num_comments": 196,
        "comments": [
            "10/10 would download again, just works and looks better.",
            "My idle temps on a Zephyrus G15 are 90+. I have to disable turbo boost just to use the laptop without it melting. I just uninstalled everything Armoury Crate related and installed G-Helper and now my idle temps are in the 50's and I can use my computer as normal.\n\nAnd even better, it gives you easy access to disable the CPU Boost, which is helpful when you're gaming and your laptop is getting too hot. Just turn that off and your PC will be much cooler.",
            "I’ve just gotten 2023- with 16gb or ram. Out of box it utilises close to 60% ram. After removing a lot of apps, it went down to about 50%. \n\nSwitched to G-Helper and uninstalling AC using the utility, it’s now sitting slightly below 40%. It’s still kinda high but it’s still 10% (1.6gb of RAM) less utilised. Pretty happy so far.",
            "yall been talking bout this so much i might finally try it out, Im just cautious about deleting armory crate cause i like to change my keyboard color lol",
            "Just want to say this is fantastic.",
            "Will this work on an M zephyrus or only G models?",
            "Has anyone managed to extract the animations from armoury crate? I like the ROG logo shimmer one. Literally the only thing I miss from having AC installed",
            "Need some help here!\n\nGot rid of most of the asus bloatware and installed ghleper. Ghelper says I have 9 asus services running in the background. Should I click stop? And how do I uninstall that shit?",
            "Anyone using this with the 2020 model?",
            "This is so wonderful. THANK YOU!!! This is what Armoury Crate should have been."
        ]
    },
    "Why didn't i know this earlier": {
        "title": "Why didn't i know this earlier",
        "score": 15,
        "url": "https://i.redd.it/sasbsk7n2i9d1.png",
        "content": "",
        "num_comments": 7,
        "comments": [
            "for the past year, my g14 was running at a constant 76deg C base level, heating like a hot potato even when im on igpu only, silent, etc on armoury crate. College work was toughh af with the battery life of such laptop; how did i not realise the diff it would have made if i just deleted that armoury crate and installed g-helper instead",
            "It happens. We're quick to dismiss things even if it's in our line of sight. It's not until we really need it that we start paying more attention, lol. It gets posted nearly every week to remove AC and install g-helper.",
            "Glad you have eventually discovered our lord and savior GHelper. \n\nFun tip, I've found that I can turn my settings down to around 15w, and can stably hit 8\\~ hours with very light tasks like notes, and web browsing.",
            "Right. I always knew armoury sucks, but did not have a secure alternative for the same features (the discounts on steam were tempting me to keep it). Ah, so much better now",
            "I'm not in front of mine right now, but if you click on extras a new screen will pop up. It'll give you the option at the very bottom to stop every Asus app that's currently running in the background\n\nI'm glad you made the switch. Welcome to the cool kids club 😂",
            "Nice features too, especially clamshell mode, needed it. Thanks",
            "When I see someone using armory crate\n\nhttps://preview.redd.it/er1o8wumli9d1.png?width=167&format=png&auto=webp&s=95973db022f60b6fd13ffe391d86578e123d7368\n\nI used it for months because I was afraid installing G-helper might mess up my laptop. Never going back to armory crate ever again🙂 Glad you got on G-helper too OP, you deserved better💪"
        ]
    },
    "Open Box “Excellent” G14 Screen Bend": {
        "title": "Open Box “Excellent” G14 Screen Bend",
        "score": 18,
        "url": "https://www.reddit.com/gallery/1dr0lbb",
        "content": "Hey y’all! Got a 2023 G14 from Best Buy open box excellent. I was wondering if anyone had an opinion on whether this screen bend counts as excellent condition. Left side of the screen is noticeably raised in the middle when closed and the bend is pretty visible when open as well. Seems like a somewhat significant physical issue to be marked excellent but not too sure! \n",
        "num_comments": 14,
        "comments": [
            "I've found the g series screens bends insanely easily (I have a g2021 used), so I personally wouldn't worry about it, but you did pay for excellent edition so if you feel it's a problem return it, you have a one week return window for exactly this reason.",
            "You know why it is open box now",
            "Bestbuy has been shady asf lately. Times must be tough.",
            "BestBuy cant be trusted with their open box items man. Especially with these g14’s. I’ve bought and returned two open boxes now. The first was a good condition that turned out to be a store display so it was dirty and the battery was depleted. The second was an excellent condition with a cpu fan that did not spin. I too noticed the slight bend in the screen in both units and now realize it’s not normal lol",
            "It's open box, you get what you get. You're acting like someone just returned it because they felt like it.",
            "Yeah planning on returning mainly because I did pay more for excellent so more out of money perspective then a concern for future use. Thanks!",
            "No. OP is right. If it is marked as excellent condition it should be excellent. Hopefully you can refund.",
            "Seems like you’re the seller of said product lol",
            "Alrighty. Also, always check out \"worse\" qualities too, as j found a legion 5 slim in \"good\" that was in perfect condition, because when stock sits long enough they will just put it down a quality tag to lower the price, so you can look for double tags on the boxes",
            "Thanks for your input, that’s what I was thinking. I’m within my 14 day window so I’ll head into a store tomorrow and see what they think!"
        ]
    },
    "Comparably Thin Laptops with Upgradable RAM": {
        "title": "Comparably Thin Laptops with Upgradable RAM",
        "score": 2,
        "url": "https://www.reddit.com/r/ZephyrusG14/comments/1drb1bq/comparably_thin_laptops_with_upgradable_ram/",
        "content": "What are some similarly priced, or cheaper laptops that have upgradable ram? Preferably either 4060, or better, but also open to less powerful GPU. ",
        "num_comments": 2,
        "comments": [
            "I think the Razer blade 14 2024 and MSI stealth 2023/24 have 2 ram slots. The 2023 g14 only has 1 ram slot. Most other 14” gaming laptops have soldered ram.",
            "Hmm, what about 16” thin laptops with 2 ram slots?"
        ]
    },
    "Just picked this up at Best Buy for $1261. Was this a good deal? ": {
        "title": "Just picked this up at Best Buy for $1261. Was this a good deal? ",
        "score": 77,
        "url": "https://www.reddit.com/gallery/1dqnooz",
        "content": "",
        "num_comments": 59,
        "comments": [
            "Whenever I see such posts, I always remember the comment of that one redditor saying \"f u americans for always getting the good deals.\" LOL. but kidding aside yes it is mister!",
            "nice! i bought mine brand new a few weeks back when it was discounted to $1299. yours looks new as mine!",
            "Grabbed the same one from BB 2 days ago. Open box $1216.  Looks brand new!",
            "Not too bad. Unlike the Zenbook Pro 14” touch OLED with 4070 at $902 though.",
            "Hard to call it a spectacular deal since BB just had the model on sale for 1299 about 3 weeks ago.",
            "it's a good deal, and a great laptop for the most part",
            "$1261 including tax? Great deal",
            "There is the same model at my best buy for 1170 now since 3 days (best buy Miami). But 16gb is a hard pass for lot of people. Waiting for a real deal 😈.",
            "Just curious, why do people make these post? If someone here said it was a horrible buy would you return it ?",
            "Bought one 2024 g14 16g 1tb 4060 1400 out the door two weeks ago.   Now they are 1600 again 🤷🏽‍♂️"
        ]
    }
}