{
    "G-Helper - The Armoury Crate Replacement You Should Know About.": {
        "title": "G-Helper - The Armoury Crate Replacement You Should Know About.",
        "score": 473,
        "url": "https://www.youtube.com/watch?v=6aVdwJKZSSc",
        "content": "",
        "num_comments": 196,
        "comments": [
            "G-Helper is a godsend!\n\n&#x200B;\n\nDon't forget to support the dev.  \nI did it, best money I ever paid for an app.  \n20 more bucks to be able to properly use a 1500 USD+ laptop simply doesn't count :)",
            "10/10 would download again, just works and looks better.",
            "Absolutely insane improvement on idle temps and HUGE jump in battery life.\n\nWas getting idle temps in at around 59-65 degree with Armory Crate open. Now idling at around 42 degrees.\n\nExpected battery life went from around 4-5 hours to over 10hrs!\n\n20/10 would download again. Thank you!\n\nhttps://preview.redd.it/1o4t3lg93sbb1.png?width=3024&format=png&auto=webp&s=5b385079eeefaaa6283208517713a6b697d5ad7c",
            "My idle temps on a Zephyrus G15 are 90+. I have to disable turbo boost just to use the laptop without it melting. I just uninstalled everything Armoury Crate related and installed G-Helper and now my idle temps are in the 50's and I can use my computer as normal.\n\nAnd even better, it gives you easy access to disable the CPU Boost, which is helpful when you're gaming and your laptop is getting too hot. Just turn that off and your PC will be much cooler.",
            "Will try this later today.  I was just getting used to AC and MyAsus and frankly it’s a cluttered mess.  It seems this also supports undervolting.",
            "I’ve just gotten 2023- with 16gb or ram. Out of box it utilises close to 60% ram. After removing a lot of apps, it went down to about 50%. \n\nSwitched to G-Helper and uninstalling AC using the utility, it’s now sitting slightly below 40%. It’s still kinda high but it’s still 10% (1.6gb of RAM) less utilised. Pretty happy so far.",
            "yall been talking bout this so much i might finally try it out, Im just cautious about deleting armory crate cause i like to change my keyboard color lol",
            "Just want to say this is fantastic.",
            "Will this work on an M zephyrus or only G models?",
            "Can you open GHelper with the Hotkey while in a full-screen game?  \n\n\nSeems to only work when in the desktop"
        ]
    },
    "Just picked this up at Best Buy for $1261. Was this a good deal? ": {
        "title": "Just picked this up at Best Buy for $1261. Was this a good deal? ",
        "score": 66,
        "url": "https://www.reddit.com/gallery/1dqnooz",
        "content": "",
        "num_comments": 58,
        "comments": [
            "This is the OLED 120 Hz/16 GB RAM/RTX 4060 build that retails at Best Buy for $1599.99\n\nWas debating between this one and the white Lenovo Legion 7i so went to Best Buy to see them both in person and this one impressed me more. I just really loved the OLED display on this and was surprised at how light it felt. Plus they had an Open Box - Excellent option for it at $1261 so I ended up going with it\n\nI know the 32 GB RAM/RTX 3070 would’ve been better but I don’t think I’ll be using it much for gaming, if at all. Mostly just regular computer stuff like browsing and Microsoft office for college work so I figured this 16 GB RAM/RTX 3060 model would be more than enough for that",
            "There was an open box g14 2023 with the ryzen 9 and 4060 going for $850 last week.\n\nIt was in my cart but someone bought it while I was deciding between the g16 I've just gotten versus that.\n\nWhoever bought that made out like a thief.",
            "Definitely 😳",
            "Cries in canadaland",
            "nice! i bought mine brand new a few weeks back when it was discounted to $1299. yours looks new as mine!",
            "Grabbed the same one from BB 2 days ago. Open box $1216.  Looks brand new!",
            "Not too bad. Unlike the Zenbook Pro 14” touch OLED with 4070 at $902 though.",
            "Hard to call it a spectacular deal since BB just had the model on sale for 1299 about 3 weeks ago.",
            "it's a good deal, and a great laptop for the most part",
            "Whenever I see such posts, I always remember the comment of that one redditor saying \"f u americans for always getting the good deals.\" LOL. but kidding aside yes it is mister!"
        ]
    },
    "Which 2tb SSD should I get for my 2021 model?": {
        "title": "Which 2tb SSD should I get for my 2021 model?",
        "score": 6,
        "url": "https://www.reddit.com/r/ZephyrusG14/comments/1dr3kqs/which_2tb_ssd_should_i_get_for_my_2021_model/",
        "content": "I'm looking to buy a new 2tb SSD for my 2021 model (5900hs/3060), but I've gotten different answers and I'm not sure what to get. Any recommendations? (Located in the US, Budget is $160)",
        "num_comments": 1,
        "comments": [
            "I would recommend you the:\n\n-SSD Acer GM7 NVMe, 2TB, PCI Express 4.0, M.2\nor Samsung 990Pro. \nFor me are the best SSDs in the market, but GM7 is more power efficient.\n\nI have the same G14 2021 model.\n\nFor 2 years I used the stock 1TB SSD.\nThen I changed it to the Samsung 990Pro 2TB. Great drive, but I noticed a little higher power draw  (usually was 8W and then was 10-12W) I did not mind that much, but I checked the specs and indeed it draws more power (don’t remember how much).\n\n6 Months later I saw a discount for the GM7 and decided to try it. Absolutely worth it. I moved the Samsung 990Pro to my PC and stick the GM7 on my G14.\n\n990Pro and GM7 are the same, almost same speeds, same capacity, same 1200TBW and 5 year warranty. The only difference is that the GM7 draws less power."
        ]
    },
    "White bar on my Zephyrus G14 2023": {
        "title": "White bar on my Zephyrus G14 2023",
        "score": 6,
        "url": "https://i.redd.it/cczurp6ekf9d1.jpeg",
        "content": "Hello fellow Redditors,\n\nI noticed just today there had been a white bar running across my screen that is about 6 inches straight line. I believe it is not a software issue but rather a hardware one because it does have a texture when running my fingers across the line. Tried many google-solutions but non worked. Is this fixable or is this a warranty valid problem of the G14. \n\nHoping for your helpful responses\n",
        "num_comments": 2,
        "comments": [
            "Looks like a keyboard scratch.\n\nI will let other confirm.\n\nIt’s poor design. But if the lid rests on top of the lid with nothing between, you will get these permanent scratches. I know it’s crazy.",
            "switch from brush to eraser and try again"
        ]
    },
    "Open Box “Excellent” G14 Screen Bend": {
        "title": "Open Box “Excellent” G14 Screen Bend",
        "score": 6,
        "url": "https://www.reddit.com/gallery/1dr0lbb",
        "content": "Hey y’all! Got a 2023 G14 from Best Buy open box excellent. I was wondering if anyone had an opinion on whether this screen bend counts as excellent condition. Left side of the screen is noticeably raised in the middle when closed and the bend is pretty visible when open as well. Seems like a somewhat significant physical issue to be marked excellent but not too sure! \n",
        "num_comments": 6,
        "comments": [
            "Return it",
            "It's open box, you get what you get. You're acting like someone just returned it because they felt like it.",
            "No. OP is right. If it is marked as excellent condition it should be excellent. Hopefully you can refund.",
            "Seems like you’re the seller of said product lol",
            "Thanks for your input, that’s what I was thinking. I’m within my 14 day window so I’ll head into a store tomorrow and see what they think!",
            "You're acting like the people at best buy actually test everything and look at it. They don't"
        ]
    }
}