{
    "EURO Championship 2024 -Official mega thread": {
        "title": "EURO Championship 2024 -Official mega thread",
        "score": 64,
        "url": "https://i.redd.it/dvnssv2drn6d1.jpeg",
        "content": "One bantering, shitposting thread to rule them all. Here we can discuss every match and how shitty our teams are doing. But above all, here we criticize the Fr🤮nch ‘team’. \n\n@mods please pin this post. ",
        "num_comments": 127,
        "comments": [
            "23 seconds??? Are you ok Luigi???",
            "Nearly shed a manly tear at the sight of Christian Eriksen and his bionic heart scoring that goal. Almost made me forget the Danes used to invade us every Tuesday.",
            "Damnnn, the Swiss are playing really well. \n\nNot sure what the Linesman was doing trying to rule that goal offside though.",
            "The Netherlands will win this tournament, we are the best. We won a match against Iceland. So we will kick Germany’s ass in the final and party like it’s 1945. We are so good. We have won the European Championship once against a country that doesn’t even exist anymore. That’s how good we are. \n\n*one - nil behind* \n\nTeam: “Okay we’re just going to kick the ball around and call it a day so we can go back to our normal schedule of taking selfies at Ibiza and release cringey rap music. Thanks for the money”",
            "We will eat your souls and shit out nazi gold!",
            "Can't wait for the match against our cosplayers",
            "Barry, I'm expecting the finest shithousery from you tonight.\n\n![gif](giphy|JlpjgSWmzR45OUMyNQ|downsized)",
            "At least Austria drew plenty of French blood so far",
            "Been really fun to watch Spain say \"Ball is mine\" for 40 mins straight.",
            "I must point out that an only an Italian was able to score during ITA-ESP match, Mr. Richard Califlower. Take that, toreros, maybe you'll be able to score next time.",
            "given that it was a 21 vs 1 match, we played honourably",
            "lol Belgium",
            "Must be a lot of English in this stadium judging by the boos for the Spain anthem",
            "Own goals are getting commons. 😂",
            "The Italian team is in shambles on all fronts, only GK knows what he's doing.",
            "https://preview.redd.it/0g6w36yli67d1.png?width=106&format=png&auto=webp&s=80a23ee467786d8e60e600423a9fcbf447ff8503\n\nGriezmann being almost the same height as this kid gave me a great laugh lol",
            "Score your own goals you tight Jock fucks",
            "Bwaaaaaahahahahhhh CAM ON INGERLAND, SCOR SUM FACKING GOALS. Aaaahahahahahhh",
            "Dutch attempting to find ways through the Great Wall of Poland is never not funny.",
            "Anyone else heard the fans in the first half sing ausländer raus? Wonder if it was the Swiss or the Hungarians though?",
            "Golden (shower) generation",
            "Dit is nijt basketball meijn friend.",
            "Belgium denied by a hand........",
            "Man look at all those beautiful Portugese women in the stadium…. Jk the only thing we see are some absolute baboushka’s. True Balkan southerners.",
            "That's right folks.... we are on fire!!!",
            "Solid effort there Scotland.   \n\n\n![gif](giphy|1236TCtX5dsGEo|downsized)",
            "Please tell me [Albanian name] is gonna pull something out against those bastardi Italians. Group of death but not for me! ",
            "The good guys just won, Slovakia anthem plays",
            "I fucking drew Hungary in the work sweepstake and they're on today against gold diggers. \n\nEnd me now.",
            "psst Portugal, let us win in tuesday, so we can knockout the two Asian countries in our group",
            "well, we all know who won't win at least.\n\nnot gonna mention names, but let's just say that team has a player that is somehow so cursed that not even Bayern can win with him.",
            "It's gonna be a PIGS+1 W for sure and since Greece did not qualify (on purpose, because we obviously prefer to relax and definitely not because we suck) we appoint the French as a substitute.\n\nGo Go ~~PIGS+1~~ *PIFS* !!!\n\nYour Greek brothers support you (by lying on a sunbed)!",
            "Barry, do you still think it's coming home?",
            "Polska gurom 🦅🇵**🇱🇵🇱🇵🇱🇵🇱🇵🇱💪**",
            "1-0 for the glory of Bosnia 🇧🇦🇧🇦🇧🇦🇧🇦",
            "I thought this was the European championship? Did France miss the memo?",
            "Worst game so far? It had to be the french\n\n\nAt least they got their asses beaten",
            "Oh spaghetti eaters this moment is always so good…!",
            "We all agree not to let the Brits win right?",
            "https://www.reddit.com/r/soccer/comments/1dh6x55/serbian_fans_in_gelsenkirchen/\n\nGreeks or Serbian ? hard to tell apart.",
            "What a snooze fest of a game",
            "Na, we are not in it. Players F'up. I will root for Berry-team! And they will loose, and make a show about it, drumk etc :)",
            "French start Le falling, et Le diving, puta madre",
            "I swear if the Austrians beat the French I will dump even more money on them than usual during next winter holiday.",
            "Jammy frogs",
            "What a gay thread.",
            "We normally mention the National Team of Afri..France, I mean... France. But Switzerland... How many Swiss of at least 2 generations are in that team? 2-3? What a joke.",
            "I have never felt so loving towards Albania as I do right now.",
            "Go on, only on pay TV on Germany. What's happening?",
            "at \"Flunk\" definition there is Cruyff NT. Only Marco Van Basten could finish the work for you, il cigno di Utrecht \"the Swan of Utrecht\", two years being the best in the world, and nothing else.",
            "Honestly, I hope you guys make it far, because it's fun to see the Dutch being happy. You just gotta deal with France in your group who... *checks*... came first and second in the last two world cups.",
            "Word",
            "NGL I think this is low key our year. The team is good enough to win on its day but not good enough to be crowned favourites and get burdened with additional pressure. Plus blooding youngsters like Simons, Frimpong and Zirkzee will also work in our favour.",
            "![gif](giphy|A5F11Cbo7b8cw)",
            "You're lucky the Irish don't participate. Those gingers don't have souls.",
            "You assume we have souls",
            "I’m afraid Barry’s will be preoccupied with getting shitfaced and demolishing stuff.",
            "RIP M’bappe’s nose.",
            "Belgians scoring a goal that counts challenge (impossible)",
            "Today we feast!",
            "Today we are all Slovakaustrians",
            "They are not kids, just Italian footballers.",
            "Shhh, you might not even qualify if you lose against Serbia on Tuesday.",
            "Kurwa, we will be victorious.",
            "I didn't - when was that? Would be surprised, we chant in local languages and high German ain't popular.",
            "Hungary out of EU...ros?",
            "Fuck [Albanian name] those guys are shit ",
            "Your choices for [Albanian name] are Enver or Mother Theresa ",
            "I have them marked down as taking out Italy in the round of 16, feel your pain bro",
            "You can go through the group and lose to us. Thats a win win because we win",
            "Hoe you guys even managed to win a euro cup is beyond me. But it is a shame you are not competing this time. Better luck next time!",
            "After that performance, I'm destrying my passport.",
            "That Spanish header had no right to be saved!",
            "Who?",
            "yeah that shit sucked balls. VAR call was BS tho.",
            "Isn’t there some middle eastern cup you can partake in?",
            "For now only Austria scores.",
            "Be careful with your promises, Austria just scored a goal!",
            "Instant karma",
            "https://preview.redd.it/8w60rdyrbq6d1.jpeg?width=770&format=pjpg&auto=webp&s=8dcdfc388b8c0ab819a91aa6a70c9b2258eb2460",
            "Yes",
            "You colonised them now they're colonising you, uno reverse card.",
            "At least half. About on par with the general population, I'd say.\n\nAnd our country is a \"will nation\". Your viewpoint is not shared widely here.",
            "Swiss are 2-0 up against Hungary, linesman tried to flag their first goal as offiside but VAR stepped in and ruled it onside. \n\nSecond goal was a banger though.",
            "First of all: It's Cruijff, not Cruyf.\n\nAnd let's be honest: Winning against Argentina in Argentina while that country was run by Videla was never gonna happen. Not to mention we hit the fucking post in injury time, and we did it without Cruijff. \n\nThen there was 1974, which Germany only won because of a dive.",
            "Statistics don’t matter. The French are suckers because they are great at giving head.\n\n![gif](giphy|5Tzbu8hTPFQ3K)",
            "More than those bloody English bastards, that's certain. We love the Irish here. A deep rooted love of bombing the English binds us together.",
            "We are so bad lol. You deserve to kick our asses",
            "Your lads are playing well. More of that, please.",
            "You’ve got to love how we’re repeatedly told that Belgium is one of the strongest national teams in Europe, as they chronically underachieve yet again.",
            "Holy shit this guy can see the future ",
            "It was around the 30th minute mark, give or take 5 minutes.",
            "I think so, Germany's last game is just a kickabout, whereas Switzerland have to win against them, and Scotland have to win against Hungary.",
            "Sit down young lad and let me tell you [a story](https://www.youtube.com/watch?v=9aoNM-QDVAI) or [two...](https://www.youtube.com/watch?v=wZDHLltOeVc)\n\n...and that's how they did it...\n\nDude, we are not competing to let the English win it for once but these fuckers just keep DQ after the group stage...I feel sorry for them :P\n\n  \n(check the 2nd video for some lol screams from the Greek speakers...)",
            "It's funny how clear it is that the problem is Southgate, everyone sees but the ones who could fire him AND get a decent manager to replace him",
            "Any.\n\nWe even give you the chance to compete with four teams to raise your chances. Not sure what the reason was, but having their own passports wasn't one.\n\nAnyhow, if England concentrates on football and less on the shopping trips of the WAGs, there's even a chance to surprise us all.",
            "Says the netherPerson. U are like Belgium beloved brother",
            "With great power comes great responsibility…. Austria, make another goal! But this time make sure it’s the right side.",
            "TBH, I think 1978 Italy's NT was the best we ever had, even better than the ones in 1982. We also felt what it meant to lose because a dictatorship... we beat them in Group Stage, but after it was right to the script.",
            "Oh man, I remember that. Dude cost France the cup. Fucking insane.",
            "Yeah, for a third country in FIFA ranking it was a pretty shitty match but damn we had some moments where I couldn't believe it's our boys. GG WP, it was a nice match.",
            "I never understand why your guys play lukaku as the sole striker. We all know he has heavy feet he won’t stop wasting chances",
            "Lukaku is our win condition, lol...",
            "Man fortunately the beer is good",
            "They are the ‘dark horse’…..again!",
            "Will have a look at the replay. Doubt it, though, it would have made the news.",
            "Yeah, like no. I wonder why  you got the impression after listening from 25:00 to 34:00.",
            "Already loving the old school editing of the 2nd vid",
            "See, I don't think it's entirely Southgate's problem. My (very) unpopular opinion is that we have 4 Man City players who are taught under Pep Guardiola's \"System\" which works brilliantly for the Prem League and Champions League, but at an International level, they're total shit, Phil Foden could have passed it to strikers, instead he tries to be the hero, multiple times.  \n\nSee Kevin De Bruyne for another example of what I mean.",
            "Do NI have a team? Surely not?",
            "Worth it",
            "I swear I heard the tune. You are making me question my own sanity.",
            "They do: https://en.m.wikipedia.org/wiki/Northern_Ireland_national_football_team\n\nThree WC appearances. One Euro (2016)",
            "Which tune?",
            "Good for them, I guess!",
            "The one which ausländer raus is based on.",
            "Agree.\n\nI still think one team for the UK is more than enough.",
            "So, you say chanting an innocent song whose melody was used with racist lyrics is itself racist? But you actually didn't hear the lyrics? Are you for real?\n\nThis song is 24 years old and for all of 23 years and 9 months no one associated it with racists. I am sure it was sung quite a few times in stadiums.",
            "So, you say chanting an innocent song whose melody was used with racist lyrics is itself racist? Are you for real?",
            "I mean I wouldn't go that far, I just didn't know NI had a team. Scotland and England as one team? There would be riots.",
            "No, I heard the tune, thought about the song, wondered if anyone heard anything. Everything else is you reading too much into it.",
            ">There would be riots.\n\nNot gonna argue this. But why doesn't Bavaria have its own team?\n\nIt's a historic anomaly. But hey, spreading talent thin is also a way.",
            "You literally said: \"Anyone else heard the fans in the first half sing ausländer raus?\"\n\nSo, no, you explicitly said you heard the lyrics. Which apparently you didn't.\n\nIf one tries hard enough, one can find/see/hear anything.",
            "Is Bavaria it's own country? I genuinely don't know.\n\nScotland is its own country with its own parliament and PM.\n\nWales has it's own \"senate\" but is less separate from England due to joining earlier and being less arsed about said joining as time has gone on (and about a lot of things in general). It is however it's own country legally and culturally.\n\nNorthern Ireland is a bit of a weird one because of the whole civil war thing and the fact that they are barely functioning, so I was surprised they had their shit together enough to arrange a football team (no offence to them, well some offence)."
        ]
    },
    "Average Swedish tourist in Amsterdam...": {
        "title": "Average Swedish tourist in Amsterdam...",
        "score": 1092,
        "url": "https://v.redd.it/ap8d8lnb638d1",
        "content": "",
        "num_comments": 337,
        "comments": [
            "As always, let's try to stay civil.\n\nCalls for violence are not ok, though I totally get how some of you feel. I too have to choose my words carefully after seeing fuckers like him terrorizing my home town.",
            "I somewhat hope we can return to a time, where shitheads would get punched and shamed out.",
            "In Sweden, well call them Adidas-knights.\n\nSame uniform since 2010.\n\nhttps://preview.redd.it/ylq1p540h38d1.png?width=1074&format=png&auto=webp&s=6543fa4110fe1ae82ea702ec147add9fb85b1b37",
            "Why is the \"gangster hoodlum\" fashion trying to get away with purses? It's so gay it's unreal so why it's considered status is beyond me.",
            "Pretty sure I recognize a cancer in the midst of our Western European society when I see it.",
            "He was quite happy to rant away until he figured out he was being filmed and figured out how much trouble he was in, so he knew what he was doing was wrong and didn't want to face the consequences of his actions.",
            "bruh just punch the dweeb.",
            "Aah the inbred “youths” of Amsterdam.",
            "Ah yes, the price we have to pay to stabilize our pension system\n\n  \nAccording to some people",
            "I think it’s time to send these people back to svedistan",
            "I wouldn't have the energy to stand there and talk to him.",
            "Sadly big reason why a lot of people don't like Turkish and Marokkons people in holland.\n\nThere sadly find everyone should accept there culture but they not willing to accept anything outside there scope of normal. There often a big problem in big cities of attacking people that are different and also often give a hard time for the ladies.\n\nCause in there culture men are above women. So again a big part of isues that they force there culture or view and sense of normal on everyone else.\n\nI live in a big city my self in holland.\n\nAnd I'm sure not every of those group would be bad. But this is a good example why the groups are so hated by people.\n\nNo one should force there beliefs on other people useing fear or violence so you do deserve all the hate you get when you do do that.\n\nAnd as a Dutch men. I'm very sorry you have had a bad experience in this otherwise beautiful country. I do hope you had a wonderful vacation beside this event.\n\nSadly ashole repellent spray has yet to be invented",
            "Putting your dick in a dude is manly as fuck, it's literally 2x man. Wearing a purse however is really gay.",
            "weird; here they look the same\n\nhttps://preview.redd.it/dv017qg9838d1.jpeg?width=800&format=pjpg&auto=webp&s=2d327f71270d6d279b3e65b447ff782adf97eecb",
            "Natos. Noord Afrikaanse teringlijer op sportschoenen. It’s how some of our cops call them. They got suspended for slurs.",
            "What is it with the Hollanders and cancer-based insults?",
            "Muslims vs gays. I'm getting my popcorn ready 🍿..or paella, 🥘",
            "The concept of insulting and attacking someone for being gay and then seconds later running away like a bitch, sitting ass to dick on a scooter is hilarious.",
            "Protecting the LGBTQ+ is Protecting western Europe values ✊️. Unironically",
            "What a tiny tosspot",
            "You need to start encouraging British stag do's back to Amsterdam a group of Barry's would be well up for a fight with these dweebs",
            "That’s why I rarely visit our capitol.",
            "Wait a minute.. Are we gays or are we m\\*slems?",
            "Minder, minder, minder!",
            "I can’t believe this is what wannabe gangsters choose to wear. So fucking ugly lol",
            "Why is extreme right winning in votes? Oh right, a cancer in society called islam",
            "Somehow it's always those who look like they'd fall over in a light breeze",
            "Some cultures are better than others let's be real.",
            "Left wing politics want to bring more of these engineers in Europe and at the same time give more freedom to LGBT community. \n\nAlways funny to me they give vampires the keys to the blood bank",
            "Everytime I see a homophobic Barry on this sub, I imagine they look like this irl",
            "are \"cancer homo\" and \"cancer mother\" even insults? Like, since when is 'cancer-anything' an insult? It's just a disease that you basically have no control over getting.",
            "Always the same. Our society would be so much better if we would stop importing stuck in the dark ages. Honestly don’t care about the lgbt community but they’re not the ones annoying me on a day to day basis",
            "So why exactly didn’t he punch him?",
            "Import the 3rd world, become the 3rd world",
            "\"Being gay isn't normal in Amsterdam\"\n\nDang, someone should inform Pride Amsterdam... And the LGBTI museum... And the gay beach... And like half the bars",
            "Religion is cancer. I bet this guy is religious.",
            "That's on us for letting Arabs come to Europe",
            "Funny they always film and when they get also filmed they get aggressive.",
            "I’m just going to leave this here:\n\nhttps://preview.redd.it/qbsxz624948d1.jpeg?width=1125&format=pjpg&auto=webp&s=4b3112ca8b2ebe26c717345e5f61ab94964c4dd9",
            "Why is the girl protecting them ??? ",
            "Ahh yes, the cancer of western society.",
            "Like he gives a fuck this acoustic regard recorded them lol",
            "Gelijk vlakke hand",
            "Beat the kids up",
            "Back then gangsters wanted to be rappers to escape their harsh and painful life.\n\nNowadays well of kids with no problems in the world want to be gangsters because they think it's cool.\n\nThis is typical, you grow up and you want to proof yourself, you want to be tough emotionaly and physically because that's a desired state to be in for one's self and for others.\n\nUnfortunately instead of being really tough in the sense of emotionally stable and true to ones self and maybe even physically tough to master ones life and uplift and protect your loved ones emotionally and physically these young kids do it because they think it gives them status to act tough without being tough, that it gives them respect without having earned it in the first place, and to emit strong man vibes. Unfortunately it does neither of does things, quite the opposite. \n\nThese kids are confused, insecure and have no sense of self worth, and it doesn't get better by our status driven, materialistic, hyper 24/7 fake media world where you can create a complete fake image of yourself to create a false sense of self worth and status that starts to take over your real self and it prohibits you from finding your inner self.\n\nI see it with native europeans too but the difference is, this is our homeland, these are our people, our culture, our home. We are raised to respect these things and we have an inner desire to do so because we connect them with where we belong to. \n\nUnfortunately some foreigners don't have that desire to integrate, neither do their parents, they don't give a shit about values and they do not want to integrate and contribute to a working society, it's all about themselves so they act like a monkey towards everyone in the pursuit of fake worth, fake status and fake respect in their fake little world. \n\nThis is one of the distinguishing factors between america and europe, america is more driven by looking for yourself and europe is driven by looking out for one another. The thing that distinguishes america from other foreigners tho is that they also learned to live in a society similair to us and still integrate and do ones job and be part of a functioning society aswell as europe is basically their ancestral homeland. \n\nTl;dr: foreigners with no roots here, no desire to put down roots + our materialistic, online media dystopian world is non bueno.",
            "They're just not compatible with western values.\n\nWhy stay living here? Go back to your caliphates, life is great there.",
            "Some people have never been knocked out in a fight with a stranger and it shows.",
            "[less than half of the Amsterdam youth accept gay people](https://www.reddit.com/r/europe/s/Xpa5NMDd7X)\n\nImagine being homophobic when you’re literally wearing a handbag.",
            "There's people, people with college degrees (even PhDs!), that still believe all these people need is a couple of classes and workshops and they'll drop their nation's millennial beliefs in no time.\n\nlol",
            "Bruh.... You cannot be a homophobe and jump on a fucking vespa with your homie. That is probably the only thing more gay than full on butt-sex with your homie.",
            "We call that kanker Marokkanen",
            "yup, welcome to Amsterdam",
            "Diversity is our strength  \n\n![gif](giphy|MetttYCWId5VhRvTIw|downsized)",
            "Wonder which side the „queers for palestine“ would take in this conflict",
            "We were just on the the way to a Gays for Gaza rally when all of a sudden.....",
            "How is that a Swedish guy?",
            "somebody punch him already! i would’ve punched that dickhead right away ",
            "we hebben inderdaad een serieus probleem",
            "The future of europe.",
            "You have got to love what immigration is doing for our country. Mind you, these arent immigrants. They are the 3rd or 4th generation. But you know how it goes, whilst they are being abusive to gay people, i am the racist for stating this.",
            "Ahh yes, kansenpareltjes. It's just a phase, I'm sure they'll regret their behaviour, formally apologise and become a doctor or engineer one day.",
            "Why I feel at home watching this ?",
            "Somewhat late with the face concealment attempt …",
            "\n\n\nThese 100% totally cultured Dutch men have forgotten the liberal ways of our forefathers.  /s",
            "Where is Geert Wilders when you need him?",
            "How can I be homophobic,my bitch is gay.",
            "and theres people supporting this shit",
            "wallahi he does not look swedish",
            "It's 2024. Wtf, man..",
            "We staan er weer goed op jongens",
            "yeah, an engineer or a doctor from Algeria, who is very tolerant and will definitely not require sharia when there will be more of them",
            "This is not what Swedish people look like",
            "Someone please explain to me how these people are considered a \"chance\" to have in Europe.",
            "You seem confused. This is clearly a berliner's first try at speaking german. He is a bit confused, but, it almost sounds like real words already",
            "The enjoyment of the voted is strong with these ones",
            "A little respect to the guy, he is the son of a surgeon, engineer, scientist. So i bet he raised his son properly \n\n(Obviously joking, these fuckers are just thrown out of the house at age 6 only to come back for eating and sleeping)",
            "Is that Molukkenstraat with Insulindeveg intersection in front of the Lidl?",
            "Amdulilah",
            "Ibrahim needs those croocked teeth pushed inwards.",
            "*Cancer sucker* lmao, wierdest insult i’ve ever heard 👀",
            "If there were countries where they could live en masse with others who share their bigotry... Oh wait... There are!",
            "Sounds like he serious needs help. \n\nThe „lost brains“ become more and more.",
            "beat the shit out of it",
            "Most Swedish man from Sweden",
            "Lives in the first world to legalise gay marriages…. Complains about homosexuals… \n\nWhat a complete fucking tool.",
            "We call these guys \"pareltjes van de samenleving\".\nThe crème de la crème in society.",
            "Why even bother with this \"people\".  They are not worth one second of attention",
            "Dang, Europe is so much richer in every way thanks to these light beings.",
            "yep that guy's gay",
            "I think we can observe here the typical escalation method of this kind of person. First he films, than he insults, then the insults get worse and worse and he directly insults towards people. Every step where he does not encounter resistance, he takes another step. He then gets physical, and after he STILL does not get punished, he is brave enough to throw kicks and punches. I am quite sure that he would have retreated instantly (maybe under some insults) if he was \"robustly challenged\" after the first words.",
            "[deleted]",
            "Who’s gonna stop you? They will be more worried about their phone than fighting back.",
            "Since he tried to attack, you would be in your right to defend yourself.",
            "I would say call the Barry's in but that would just make things worse.",
            "[deleted]",
            "This type of adidas-knights can be found in all European towns and cities with populations of 1,000 and more",
            "Walla Bror is amazing. Here it would be \"Wallah Bruder\" or something\n\nI really don't care what people wear, but seeing purses on men is weird. Yeah, yeah it ain't a purse, it's a satchel - but still.",
            "How nice, very similar to our roadman varieties.\n\nhttps://preview.redd.it/a0s4enn2w38d1.jpeg?width=3508&format=pjpg&auto=webp&s=33db1b1fe5e23c4d6796e6cf6d332c26b5c87e5e",
            "in Italy we call them maranza. it surprises me that they're not unique to our country. true cancers of this generation",
            "That’s really insane that they all wear the exact same clothes throughout all of western Europe. Like, from a sociology perspective (or whatever) how did that happen?",
            "Walla bror ska vi dra elle? fan har du tjuge spenn elle?",
            "Walla Bror is amazing. Here it would be \"Wallah Bruder\" or something\n\nI really don't care what people wear, but seeing purses on men is weird. Yeah, yeah it ain't a purse, it's a satchel - but still.",
            "[wish.com](http://wish.com) gopniks? Except the cost more, and can drink less?",
            "In France we call them \"des gros sacs à merde\".",
            "The three stripes (or rings) are the trademark of the largest „sportswear manufacturer“ in Europe. They may appeare perfectly plain and featureless, but when heated, this inscription appeared in fiery letters between the stripes (or Rings):\n\n“One Ring to rule them all, One Ring to find them, One Ring to bring them all, and in the darkness bind them“",
            "Looks like the expensive polish upgrade",
            "We call them \"wesh\" in France, \"wallah bruda\" in Germany",
            "We call them kutmarokkanen, no matter their nationality.",
            "We call them maranza",
            "The standard Eastoid outfit here.",
            "In Italy they are called maranza, in France Lacostiens. \nI call them imbeciles",
            "Here we call them Lacoste TN.",
            "Why specifically 2010?",
            "Maranza in Italian",
            "We call them \"amegos\" or \"jovenlandeses\"",
            "Are called MLDR",
            "In Scotland, \"ned\" -> [https://www.urbandictionary.com/define.php?term=ned](https://www.urbandictionary.com/define.php?term=ned)",
            "lol thank you.  Got a chuckle out of me.",
            "TBF, I fly quite a lot and wear light pants like linen or (decent) sweat pants on the plane.\n\nfanny packs etc are just very convenient, cause it sucks to have phone, wallet, keys, and other stuff bouncing around in such light pants.",
            "Where else are you going to hide the drugs you are selling?",
            "And it aint the gays",
            "Noticing patterns is fascistic.",
            "nothing like some good ol sweet instant justice",
            "https://i.redd.it/5n918uyva48d1.gif",
            "And then left wing parties are surprised Pikachu when they lose",
            "Germany at it again",
            "Wasn't he filming himself at the beginning, too? Lol",
            "If these scumbags would actually face the consequences of their actions, then they would not behave like scumbags in the first place.\n\nThank the leftist for this crap.",
            "He doesn't seem to be on his own, idk if it would be a good idea",
            "Yeah but unfortunately if they did that he'd cry to some news agency saying \"the gays\" beat him up for nothing",
            "thats how you get stabbed",
            "They're with 8, and you're only with 3. What ya gonna do...",
            "The guy filming may be a tourist also, he has a distinct brazilian-english accent. \n\nCan't go punching people when you're not in your own country",
            "Pretty sure it's the highly skilled migrant who's visa can be revoked pretty much at any moment who are contributing positively to the pensions😂",
            "Also ignore how they will also need pensions",
            "Yeah we're doing a great job of stabalising it by importing millions of net-negative tax contributers further draining public funding 💀\n\n\nI just assume every western European politician is a national traitor at this stage",
            "We dont Want them either.",
            "True, they're a lost cause anyway at that point.",
            "With Turks it's really weird because if you go to Ankara or Izmir, you'll meet very secular and Westernized people that look nothing like the Turks in the NRW or Randstad.",
            "I don't get this obsession immigrants have with forcing their culture onto other in a new country. If you move to another place, learn to deal with the fact that you have to live in their culture, not yours. Can you keep your own culture? Absolutely, dress how you like, pray how you like, but also respect the culture and laws of the country that has welcomed you and given you a home. Otherwise you can just go back to Morocco, Turkey or whatever country you support in world cups other than the one you live in",
            "He's wearing the official uniform",
            "Careful: if you post that video you'll have your account banned by admins",
            "Oh no, where is this from, what happened?",
            "Funny, in Germany racist police would call them Nafri, probably has the same meaning",
            "Blattar.",
            "Gets the people going",
            "You wouldn't understand",
            "This has been going on for a while lol. We aren't exactly bffs.",
            "Is it possible to cook a paella in a stainless steel pan?",
            "...like they are only in Amsterdam?",
            "Yes",
            "Minder Europese Unie?\n\nEdit: for context, that guy said \"minder Europese Unie? Minder Partij van de Arbeid? Minder Zweeds?\"",
            "And the far-right wants to kick these people out (but have the exact same opinions on gay people)",
            "And the far right wants to defund integration efforts and support countries that make people leave their homes.\n\nSounds way more stupid to me.",
            "They even try to blame homophobia in the Global South as being caused by white people spreading homophobia there",
            "r/leopardsatemyface",
            "Sure, and right wing politics is famous for its compassionate support of the LGBT.",
            "It is in Dutch. Yeah its weird, we know. \n\nKrijg toch de pest kanker tering godgodverredomme wat een bloedkankerding.",
            "In the Netherlands using cancer as a prefix is a status symbol for our very own Yordi or Mohammed from the neighborhood",
            "It is basically a spell. We wish diseases on people when we swear",
            "Its basically that you wish it upon someone, or someone's beloved ones",
            "The fact that you actively have to point out in this context, that you don‘t care for them, speaks volumes about how much you seem to be having in common with the dudes in the video.",
            "Straight to jail. \"Disproportioneel geweld.\" In the Netherlands, there is no right to self-defense, only in emergency situations you can't escape from.",
            "She's protecting the gay guys from him",
            "Actually she's telling him to walk away / stop",
            "Because they are just “misunderstood”",
            "Most likely his dedicated probation officer / social worker.",
            "She is probably just an embarrassed girlfriend.",
            "the white savior complex is kicking hard in euro women, especially of the northern variety.",
            "Savages when they discover you can repudiate islam AND genocide :o",
            "Because he prays 5 times a day, very Swedish",
            "Why not? one out of three looks like that.",
            "They live in 622 AD.",
            "its a shitty meme.",
            "Their 12 nephews that are 1 call away",
            ">Who’s gonna stop you? \n\nTheir family members?",
            "They will draw a knife and as they move in packs you will have to kick the whole family’s ass.",
            "When there's 8 of them and only 3 of you I wouldn't advise it",
            "The knife in his pocket? I'm not betting it all on me being able to knock him out in one punch.",
            "> Who’s gonna stop you?\n\n[Local police](https://www.telegraph.co.uk/content/dam/world-news/2024/05/31/TELEMMGLPICT000380006661_17171542606920_trans_NvBQzQNjv4Bqz6Ca7wbnaQmKs41C02C9hElcO44uR88CfjssemIwwxw.jpeg?imwidth=350). They'll stop you from hurting one of the EU Holy Cows",
            "Yeah but you didn't try to run away or throw your valuables at him so it doesn't count.",
            "Someone call Knollsy. ⚒️",
            "that never happened, either you're lying or your friend lied to you. No one with a broken arm is punching anyone",
            "Yeah, the only difference is what language they have a broken accent in.",
            "I would put the minimum lower.  \nAll self-disrespecting villages of 500-5000 should have scooter gangs.",
            "hamburg is infested",
            "We call em chavs. Council house and violent",
            "There should be a lexicon somewhere for all the different words. Gopniks, Chavs, etc.",
            "How else can they sell their drugs?",
            "In dutch it's wollah broer. Or broeder.",
            "Indiana Jones has one!",
            "Damn, there really is an official Nike mugging mask?",
            "Can confirm that they're everywhere, must be a Euro-wide lowlife hivemind",
            "Incredibile quello che dirò, ma rimpiango i tempi in cui c'erano i risvoltinati.",
            "A good start would be to go look for the factors these groups have in common.",
            "It's montriex here but that's because its a local clothing brand ans tbf some of the tops are nice",
            "\"Walla brudda\"",
            "Klart bre. Jag har bara en tia, kan du lösa resten?",
            "I put gopniks, chavs, addidas-knights in the same archetype of people with different branches.",
            "Incredibly, I'm with French people on that matter.",
            "You could probably do a study on how well the choice between Adidas Original and \"normal Adidas\" function as class markers in Western Europe (for people who dont wear them as sportswear).",
            "*Lacoste TN",
            "Have to put some year?",
            "I'm with you! Because of these thugs they make fun of my fanny pack whenever I go on holiday. There is no better feeling than not having bulky pockets and making sure all my belongings are close to me.",
            "Yes, but I hope you are not pretending to be all hyper masculine and \"death before dishonor\" while wearing it.\n\nAs a normal citizen, fanny packs gets a pass, because you never tried to be something you're not, if you step out of line, only then I will bring it up.",
            "Fanny packs and ass. I swear you guys love speaking American 🇺🇸.",
            "Sure Cinderella, my wife thinks the same.",
            "Isn't fanny another word for pussy?",
            "Depending on who the patterns fit...",
            "This dude is probably not even a foreigner but rather a remigrationskandidat.",
            "r/leopardsatemyface",
            "Filming himself or others, but they don't matter to him, it is purely about his feelings, he has no empathy for anyone else other than himself. He thinks he would be in control of who sees his filming, so he can share it with likeminded idiots.",
            "I'm sure the people he's sending it to enjoyed it though",
            "Why bring \"leftist\" into this topic it doesn't seem to have any relevance?",
            "Always the case. None of the cowards act hard if they’re by themselves. Most of the time they’re rather unimpressive physical specimens. Their strength is solely based in numbers",
            "It’s in the middle of the Indische Buurt. Roughly 50% is the same there.",
            "Yeah, these pricks like to carry knives as well. It's not worth the risk dying to get the satisfaction of making him sweep his teeth off the ground. Or is it...",
            "Isn’t that basically what happened?\nI remember this video from a few years ago.\nThe guy filming is a teacher at my university.\nThose kids went on tv or whatever influencer show and claimed the gay guys were harassing them / being racist and that’s why they acted that way.",
            "The gay guys might even be prosecuted for \"hate crime\"",
            "Call Knollsy ⚒️. He can take on a large mob of tough guy Dutchies.",
            "Not even their native countries want them",
            "Now our hands are tied. Nothing we can do.",
            "Well ask any Turk or Moroccan and they'll be the first to say they're not sending their best and brightest",
            "People sometimes forget the insane colonialist mentality of their culture and religion.",
            "This looks like a roadman uk style. You can check on google image for references.",
            "I mean if you think about it this behaviour of blocking everything problematic only helps the perps.",
            "[deleted]",
            "Ethnicity is irrelevant. Just make sure to be wary of anyone with a combination of small shoulderbag, cap, training pants, sports shoes. Bonus for wearing adidas trousers (extra for Real Madrid), Nike or Luis Vuitton cap and bag.",
            "Ethnicity is irrelevant. Just make sure to be wary of anyone with a combination of small shoulderbag, cap, training pants, sports shoes. Bonus for wearing adidas trousers (extra for Real Madrid), Nike or Luis Vuitton cap and bag.",
            "Oh well, is it possible that lgbtq community is breaking relations after the warm welcome?\n\nhttps://preview.redd.it/5rnpko4rk38d1.jpeg?width=750&format=pjpg&auto=webp&s=3757fd38823a5d63fbb57976ae644274d3d2279d",
            "I don't know. I like stainless steel, but if you don't heat it enough, food can get stuck. So I don't think it can work well with rice. Possible is better a normal pan. Here in Spain, we use a nameled iron pan.",
            "Unfortunately not only in Amsterdam, but they’re very open about in overthere.",
            "[https://www.youtube.com/watch?v=BaB75uznT8o](https://www.youtube.com/watch?v=BaB75uznT8o)\n\nSomething like that :P",
            "I want to have this more precise. The far right acts like they want to kick these people out, but don't really want to do that as it gives them plenty of votes as long as idiots as in this vid are around.",
            "\"the exact same opinions on gay people\" \n\nHaven't seen or heard of people from parties like AFD beating gay people up to death",
            "It's best to call them right-wing populist parties like Wikipedia calls them. They don't want to solve the problems that give them voters and will never do so",
            "missionaries did do a lot of damage in Africa and other places around the world but I witnessed it first hand in Zambia in 2006. They exploit their hatred and then the people around them mimic what the missionary does and thinks bc he is some sort of \"prophet\"... The whole situation made me sick for 3 months before I finally got to go home. Its not a \"white people did this\" sort of thing imo its missionaries who did this who most happen to be white  lol.",
            "The catholic church is a big factor for these issues in Africa. \n\nIt‘s also a huge driver behind HIV spreading, as they not only tell Christians to hate gays, but also to reject condoms.",
            "I think its more likely that she thinks he is less likely to hit her than he is to hit them...",
            "Wait you're that dude that wished death on Don Felipe\n\nBut you're based this time",
            "What do you know?",
            "12 little shits.",
            "Not happening if you finish the job",
            "Not true at all, lame excuse all coward Dutchies use. If you slap their shit they usually wander away cursing😂 it's all talk and boasting. The dangerous ones are selling dope in Mercedeses/Audi's and generally don't have time to act cool on the street and harass people.",
            "With machettes",
            "Who arent there",
            "No he only has a packet of snus or An E-cigarette.",
            "This but unironically.",
            "I laughed hard, dude. You're so right, those idiots can kill any language. There're specimens known as Bollycao, which is a white cake with chocolate inside.",
            "This is so true",
            "mhhhh true a scooter gangs that always roam next to a bus stop, but always the same one",
            "I thought it was Roadman now?",
            "*act like they‘re selling drugs",
            "Yeah, well, a canvas bag would be cool, but it's gotta be those ugly plastic looking things.",
            "Maghreb/Turkey are pretty much everywhere.",
            "No fashion sense and a shitty upbringing?",
            "fan du får imorgon, fan jag svär asså.",
            "Or we could include them to the list of weapon manufacturers and ban all arms sales to people at war, but that would probably cost adidas a lot of market share.",
            "I even travel with slippers and put my business/proper shoes in my backpack lol.\n\nEmbracing the true Hans with socks + slippers.",
            "I wear slippers + socks, *I am* hyper masculine by definition",
            "I've been around internationals for 15 years, my accent and vocabulary is very much bastardized from all over.\n\nhow'd you call a fanny pack? it's the only word I know for it in English",
            "?",
            "Because the left is enabling this type of migration.",
            "They’re always 1,75m and build like a toothpick",
            "So you're telling me the Indische Buurt is not full of Indonesians?",
            "'incapacitating an individual with a severe mental handicap'",
            "What do you meeeeeaaaaaaaan, the [Abbasid Empire](https://upload.wikimedia.org/wikipedia/commons/thumb/7/72/Map_of_expansion_of_Caliphate.svg/1920px-Map_of_expansion_of_Caliphate.svg.png), [Ottoman Empire](https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/OttomanEmpire1566.png/1280px-OttomanEmpire1566.png), and [Mughal Empire](https://upload.wikimedia.org/wikipedia/commons/c/cb/The_Mughal_Empire.jpg) weren't colonialists :(",
            "https://preview.redd.it/aka389opk38d1.jpeg?width=828&format=pjpg&auto=webp&s=2b0d80b2e91f0774dcd6a1a9e5e685a5aad79ae8\n\nStolen from 2nd highest comment",
            "That's what they're imitating",
            "Erstmal demo gegen RÄcHtS!",
            "Ethnicity is irrelevant, religion isn't\n\nWell, in this case it's literally just staying away from anyone dressed like that",
            "I dare them to bring that sign to a palestine protest lol.",
            "This person hasn't touched a Qur'an or talked to a Muslim in his life",
            "This is a brainless minority in our community. People with no life experience and that aren't street smart.",
            "Honestly, I've always seen these people either as posers or people who do not display homosexual affection in public. \nIt's no secret if you ask anyone in the community. \nHatred by Muslims is way worse than by non Muslims. \nWhere the German Grantlbart rolls his eyes, these nonces always try to pick a fight or make homophobic remarks. \nI'm fucking tired of it.",
            "I dont know where you live, but I see them in every little village imaginable. From Schagen to Valkenburg.",
            "The right causing problems and claiming only they can fix it is a tale as old as time.",
            "Exactly. Far rights screams at emigration but when in any position of power they can't resist that sweet sweet cheap labor, neither can't (or want) their donors.",
            "Evangelical Christianity is becoming more and more popular in Africa, but I also think there's already latent homophobia in the culture from before. Missionaries also spread Christianity in Asia but the homophobia is not as extreme as in Uganda and Zambia.",
            "\"As for women of whom you fear rebellion, convince them, and leave them apart in beds, and beat them. Then, if they obey you, do not seek a way against them. Surely, Allah is the Highest, the Greatest.\"\n\nQur'an 4:34",
            "Lol. I did not, though. That was some other random. I only wished jail for Juan Carlos and for a republic.",
            "Never thought I’d say this but I’m with the French on this",
            "I don't know man, there is a video of such morons fighting in a parking garage in austria until one stabs the other in the throat. \n\nThe problem is you never know how far they go. A fist fight isn't that dangerous but if they use weapons the fun ends very quickly.",
            "That’s in no way acting cool, he might think he is, but I just see a fuckin arsehole",
            "As well as the police. We live in a 'democracy' where it's easier for you to be culpable defending yourself than it is for a guy straight-up trying to murder you.",
            "Obvious sweed answer. Snus isn't a thing here, vapes are but not among these guys. These dudes smoke boofs and stab someone about every other week.",
            "I think you could make a whole new post of its own about \"Where/what do the uncultured scooter gangs roam next to in/around the shithole village you grew up in\".  \n  \n  \nI honestly would not be surprised if most of us \"escaped\" from small villages, considering the exposure to both intellectual culture (displayed by communicating through irony/satire) and micro-penis nationalism, with a dependence of internet to have consult with likeminded people...  \nBut that is a PhD for another day...",
            "Chavs still exist, but bear in mind the vast majority of them are in their 30s at this point, and have either calmed down or ended up in prison. The occasional ones I encounter tend to keep to themselves, you don't see big groups of them around much anymore.\n\nRoadman is the next evolution. I reckon most of them are wannabes to be honest, but you never know whether or not they're carrying knives with them.",
            "Roadmen replaced the Chav and they're slightly different. Basically instead of happy slapping they just make shitty rap songs on how they're going to kill their mums.",
            "An actual roadman is really involved in crime, a chav just wears the uniform and hangs about outside McDonald's.",
            "The fashion sense is fake branded clothing with the largest number of logos possible to project money even though they don't have it. ",
            "ait bre vi meckar på en beshlik",
            "Glad to hear you get the point, nothing but respect from me, I even hope you go full on, no low cut socks, I want them above the ankle for max effect. I'd never try to find fault in the innocent.",
            "Bum bag. Fanny is American for an arse. In British English a fanny is a ladies front door.",
            "But you also get those neo Nazis in political parties like the AFD, stirring up prejudice in the population, creating hate where there doesn't need to be any.",
            "Of course a Dutch man has to bring up height when he himself is built like an Elden ring boss",
            "Well, I fit this description almost perfectly, sucks we're talking about a shit group of people.",
            "Agreed. However these guys are often not really religious. However if they will find religion they are pretty dangerous zealots. \n\nThe ones I grew up next to\nWent to fight in Syria for IS in part.",
            "Yep, if I was an lgbtq person, for sure, I would not be thinking of making a trip to Palestine. \nhttps://www.bbc.com/news/world-middle-east-63174835",
            "https://preview.redd.it/uywxyuga448d1.jpeg?width=315&format=pjpg&auto=webp&s=e099e0ef2f8f19693fe7976f4461daad8cc497d3",
            "These rats are everywhere, but in Amsterdam and Rotterdam they're definitely more aggressive towards random people. For example, in Eindhoven they just stand around, but I've never seen them attack anyone.",
            "Groningen is relatively safe still",
            "So they're the ones who brought in all the Swedes?",
            "How can you be so based and so cringe at the same time\n\nAlso how can you trust politicians to be heads of state?",
            "Might be, but chances are slim. Shouldn't be a reason to let them do whatever they want. They grab a weapon, you'll bring that crazy family member to find them.",
            "Sure bro",
            "Oh ok that’s good to know",
            "Don't want no short sock man 🎶",
            "> Fanny is American for an arse\n\nI didnt even know lol. In German - Bauchtasche - Belly Bag.",
            "Ye, these people are only pious in their heads.\n\nAsk them if they eat pork and they'll insult you in between a drag of their cigarettes and a swig of liquor.",
            "Ive seen younger gays here be somewhat vocal online about support for palestine and specifically hamas and it leaves me as dumbfounded as I image it does others.. Most of my gay friends have not shown a strong interest in history so it tracks ... for the younger gen. If only there were a version of human that were immune to ignorance lol. \n\nI also might just need better friends lol.",
            "But... they're the nice freedom fighters, I don't understand!",
            "Nah, fuck off. \nMy hatred for bigots extends to people like you and your ongoing efforts to turn this sub into an alt right echo chamber suck.",
            "Never claimed to trust politicians. But I definitely don't trust people who assert their right to rule comes from God, and thus they and their families are above us all, earthly plebs.\n\nAs opposed to this theory of divine right, I'm a supporter of the controversial yet pretty cool * _human rights_ * theory.\n\nBoth islam and monarchism oppose this idea that we are all entitled to the same rights and duties, so I simply disconsider them.\n\nBut I'm sure you have a strong reason to support the existence of an institution founded on the idea that some people are above the rest, and hence to reject the idea that we are all equal as humans.",
            "No it shouldn't but personally I still have a few things to do before I can leave this life, I wouldn't risk it.",
            "That’s a lot more sensible to be honest. If you had the bag on your arse it would completely defeat the purpose.",
            "It's usually the green woke LGBTIQ+ (especially those who self-identify as queers), because they have embraced intersectionality as an ideology, so for them fight for gay rights intersects with the struggle of other vulnerable minorities like Black Lives Matter and Palestinians.",
            "Where do you think palestinians go when their houses get bombed? I am all for a peaceful, large piece of land where they all can stay and live, that is located somewhere else.",
            "And they like to enjoy music festivals, at least is what I have heard.",
            "\"I'm fucking tired of it, but it's good that it's happening so long as we own the alt-right turbofascist bigots\"",
            "Strawmen",
            "Yea this.\n\nI support palestine so far as I think it's inhumane what's happening to them, and it's just creating more extremists rather than solving the problem.\n\nBut they've been bombed for decades, have poor education and a massively young population with radicalism spread throughout. I think something in this situation has to stop.\n\nThat said, importing them all into your country is going to create huge problems lol. Get Israel to stop bombing and migrating into their land, resolve that situation somehow.\n\nTaking on immigrants won't stop what's happening with hamas, and (like all nations) they'll just re-populate back to where they were pre-immigration anyway to whatever the sustainment level is of that area. Nothing changes, your country gets worse.",
            "Yeah, that's exactly what I said lmao.",
            "Steelman it, then. Why is Felipe entitled to his power? How is the existence of \"His Highness\" compatible with the idea of everyone being equal?",
            "Then you're just stupid",
            "Sure, limiting migration by people not sharing our values and cracking down hard on them is the same as chanting for all the foreigners to get deported.\nI surely am stupid."
        ]
    },
    "Something something Luxembourg": {
        "title": "Something something Luxembourg",
        "score": 782,
        "url": "https://i.redd.it/lqwnhjyuo28d1.jpeg",
        "content": "",
        "num_comments": 120,
        "comments": [
            "In the past week ? I already used three different ones today and I just woke up.",
            "99% of Bavarians: \"Saupreisn\"",
            "This map is clearly fake. There's no way only 57% of Italians used a slur in the past week.",
            "Not surprising. I'd be more interested to see a list of most common used slurs in each country.",
            "I’m surprised it isn’t higher I don’t think I’ve called french by their real names even once. Usually we say Franzacke or Franzecke",
            "Suuuure Bulgaria... The first thing the Airbnb host in Sofia told me was to not keep the windows open so the \"dirty Brazilians\" won't come in. As I had never heard the term before, I asked what he meant and he went on a 15 minute rant about his experiences with gypsies.",
            "Is the German 88% a joke or real?",
            "No fucking way Bulgaria France and Italy are that low",
            "This could just be a map of self-reflection, honesty or standards of what constitutes a racial slur",
            "One can see this is faek, because no Bulgarian could go through a day without (justifiably) having to complain about gypsies",
            "After meticulously analysing the poll data at hand here and matching it with existing research on this topic, I have concluded that this phenomenon can only be attributed to the fact that, on a daily basis, we have to interact with acoustic Germans, mouth breathing walloons and Fr*nch people (itself a slur) that have the guts to be arrogant, when they come from the post-industrial hellhole that is Lorraine.",
            "88% in Germany is peak comedy",
            "The Spaniards: P-nch-t-, m-r- de m--rd-",
            "Well, it makes sense since there are 5 people in Luxembourg if only one person does anything the percentages skyrocket",
            "Luxembourg be like\n\n![gif](giphy|4Z9fSEFAuxpnlBVWQx|downsized)",
            "I guess in Italy the stats only count words, but not the bananas thrown on any given football pitch.  I'm pretty sure they could give Luxembourg a good run for the title",
            "There's no way Italy is that low",
            "Who’s keeping score?",
            "The lowest is still more than half of the population.\n\nBased.",
            "I think the best thing about this map is how it proves how inaccurate data collection is, the thing is that we can easily spot for this kind of data. \n\nJust the fact that Italy is not the number one, but Luxembourg... Joke.",
            "Allman?",
            "In Luxembourg they only asked Portuguese people to participate in the survey.",
            "Bulgaria most inclusive in Europe 💪💪💪💪💪",
            "Why the fuck are we so low???? Compatriots, what the fuck are you doing with your lives?",
            "In Italy the n-word is not considered a racial slur. It's just friendly banter",
            "in greece did they ask only mute people?",
            "You're all horrible. It'll take you a lot of work to get to our 0%. Good luck, southb*st#rds!",
            "Well in our defense, they use a slur to refer to themselves, always those fr*nch ruining everything",
            "Ain’t no fucking way the Balkans percentage is that low",
            "Towards another person with bad intentions? Like my friends and I have a very non politically correct sense of humor but its only funny because we know its absolutely not okay to say stuff like that…",
            "Are Gipsies a race?",
            "How we became that weak how we are lowest",
            "Oh, I got it wrong. I thought it was “in the past minutes”.\n\nAnyways, yes",
            "Imagine not using a slur every day",
            "57%? Fuck, we've gone woke or sth? :(",
            "Classic Germany\n\n![gif](giphy|10JhviFuU2gWD6)",
            "what slurs are people using? genuinely cant think of more than 2 off the top of my head and cant remeber last time i would have said them out loud \n\nwhat tf are people saying on the daily",
            "England is just 200%",
            "“Bonjour I’m French”",
            "Thats not a slur thats just how we call our beloved northern brothers.",
            "A lot of elder Italians don't even know that the words they're using are slurs so it makes sense they don't auto-condemn themselves",
            "We use bestemmie more.\n\nLike 357%",
            "\"terroni bastardi,tornate al vostro paese\"",
            "It’s full circle. “Oh? N***** is a slur? Who’d have thought!”",
            "*racial slur",
            "Absolutely true, if only the racism between north and south would be at least 80%",
            "Asking the real questions here",
            "Jup. Have I used a *racial* slur this week? Nope. Have I wished terminal diseases upon people or objects? Multiple times today.",
            "Oh yes!",
            "Kanacke, Franzacke, Itacke, Spanacke,",
            "Eastern europeans, balkans when gipsies mentioned:\n\n![gif](giphy|2zUn8hAwJwG4abiS0p|downsized)",
            "What does the map even mean? I dont understand bro",
            "What? But Brazilians aren't gypsies (or going in mass to Bulgaria either). Weren't they talking about Romani?",
            "Our secret is lying",
            "Us notherners included the arab majority calling us \"whiteys\", \"infidel\" or \"kartoffel\"",
            "Bulgarians are very friendly actually. Not racist at all",
            "Luckily you didn't mention Portuguese... Or Italians...\n\nhttps://preview.redd.it/pqh8d1zkg38d1.jpeg?width=300&format=pjpg&auto=webp&s=7f860f2c5bb7fc1887ba27f101135c2cea929683",
            "You can say the word Moro, it's just rude to call it to a person, we can say the word to discuss it. Let's try to not be americans",
            "In the Anglosphere they love playing the offended game. We Hispanic countries just insult each other the way God intended, and those English speaking cunts better don’t try to stop us because we’ll all unite to defend our right to hate on each other like true brothers!",
            "m_r_",
            "I really like your religious insults 👍",
            "can't be that bad if you can rent out their entire country for 75k\n\nedit: that was liechtenstein, my bad",
            "Probably didn't count hand gestutes",
            "by the definition of slur from this map\n\nnorthener and southerner are both slurs",
            "Yes, they are an ethnic group originating from somewhere (near) India but it was believed they originated from Egypt (hence the same gypties)\n\nI watched a docu once, instead of my wallet. Very expensive lesson.",
            "![gif](giphy|dOl2LFw0RbTMc)",
            "How dare you speak such language!",
            "and who decides that a word suddenly becomes a slur?\n\n\nall a bunch of nonsense",
            "In Latin languages it's still the name of the colour. So fairly innocuous to say.",
            "germany truly a country of poets",
            "do not forget the brits. do NOT forget the Brits",
            "The favelas look like gypsy neighborhoods and people living there have a skin complexion similar to the gypsies, so some people call them our Brazilians or the local Brazilians.",
            "\"Romani\" shut your yank ass up",
            "So normalized that when get asked you legit think \"no, I didn't \"",
            "I honestly can't say, this purely for the comedic purpose of the sub.",
            "Portugueses would never mention other Portugueses",
            "Supposedly, almost a third of Luxembourgers have Portuguese ancestry and 14% of its total population is Portuguese.",
            "Rare sighting of a based Catalan",
            "Agreed. Controversially agreed.",
            "Moro means fun in Norwegian. use it",
            "So why are you talking like an offended American bitch? Of course you can say that, it is the proper term to refer to the main North African ethnic group, descendant of the ancient Numidians. It was only part of the joke.",
            "No me pongas una bomba en el coche por favor",
            "r/whoosh",
            "David Attenborough voice: *This is how a British Bird feeds their children. It picks up white beans in tomato sauce first and then returns to the nest. Barfing into the small, eagerly anticipation beaks one by one*",
            "I’m so sorry :(",
            "Each and every time you talk about the naval conflict between Ukraine and fookin Russia, you use a slur !",
            "Well, if you say it with the intent of insulting, that's kind of offensive",
            "I guess in Spain \"Moro\" and \"Jincho\" are the winners.",
            "Not the word im spelling it’s not…",
            "Villains boshs 👋🏻👋🏻",
            "So funny, gotcha.",
            "They are gypos",
            "When Italians get asked there’s a 50% chance of a sudden and (un)expected loss of memory about the insults you used this week.",
            "Can confirm, am currently in Luxembourg and I've heard more Portuguese than French even. The last person I talked to was called Luis.",
            "Bruh, the one with the self-censor like an americunt is you",
            "Cuando termines de echar la siesta verás.",
            "cold heartless northener",
            "https://i.redd.it/5ozvxfhht38d1.gif",
            "I use the word Italian with the intent of insulting, does that make it a slur?",
            "Never heard the second one",
            "moro is considered offensive? wtf? it's just the equivalent of the english \"brown person\"",
            "here is *maranza*",
            "Oh. What's the word you're spelling? It's hard to tell under the ****",
            "les chleuh ....",
            "bonjoir mangeur de grenouille",
            "No, si te entiendo, la censura simplemente era parte de la coña. Simplemente no me gustó tu anterior comentario porque me pareció bastante obvio e innecesario.",
            "Me vas a tirar cerbatanas o solo pedruscos?",
            "I think it depends on the context",
            "Jincho? Gitano",
            "I mean... That's kind of offensive in the UK?\n\nWe'd more likely say an Asian-looking person instead",
            "¿MI anterior comentario? Las gafas, abuela",
            "i've heard some british people with southasian origin referring to themselves as brown. i don't understand how can it be offensive, so also black and white is offensive? and asian-looking is generic af",
            "Que carallo dis meu?",
            "Just weird connotations with older generations and racists lumping together \"brown people\", same sort of energy as saying [ \"blacks\"](https://m.youtube.com/watch?v=84burI5cXGM)\n\nIt tows that line so fine that if you ever hear someone say it in the UK you kinda go .... \"Hmmm.... Let's see where this is going....\"\n\nAnd yes I've worked with South Asian colleagues before, and some of them did play into it, fully knowing it makes us feel a bit awkward and crack jokes about themselves in a way that they have \"the pass\"\n\nSame with shortening down the word Pakistani, some love self describing themselves that way, but I can't be going round bellowing it \n\nSo generally we just kinda dance around it all, or ask the person what their origin is  - if it's ever even relevant (which it rarely is)",
            "QUE NO FUI YO ATONTAO, HAS MIRAO LA BANDERITA Y NO HAS LEÍDO.\n\nQue sí, que soys todos unos drogadictos, demostrado.",
            "Jajajaja pues sí, esperaba más de los catalanes y no que tuvierais que defenderos unos a otros como putillas. Yo seré un drogadicto pero por lo menos escribo bien la lengua que no hablo a diario, oíste \"soys\" boy? Ve a editarlo como una perra anda, o que te defienda ahora tu esposo😘.",
            "... eh? En serio deja la coca, tío"
        ]
    },
    "Why Luigi? Are we stupid?": {
        "title": "Why Luigi? Are we stupid?",
        "score": 562,
        "url": "https://i.redd.it/xbfv7jo0p28d1.png",
        "content": "",
        "num_comments": 206,
        "comments": [
            "Actually the original name in italy was something along the line of tomatica (It's still tumatis in my dialect) a random guy renamed them pomodori (Golden apples) to make them more attractive and convince the boomers of his generation to eat them",
            "Dw fam, we got your back\n\nhttps://preview.redd.it/stsvtdyhp28d1.jpeg?width=750&format=pjpg&auto=webp&s=c605bd58ac4c55fa099fd6f4597d2b573455363c",
            "We don’t pronounce tomato anything like those stupid yanks.",
            "because initial tomatoes were yellow, Pomo d'oro,  golden pome.\n\ncommon Italian W",
            "To be honest, yes they’re being extra here.\n\nBUT, it literally translates to “Golden fucking apples” and thereby I’m sorry but they win.\n\nIt’s literally why this has been such an easy thing to remember when I learnt Italian, like “BEHOLD THE GOLDEN APPLES… I brought back from the supermarket”\n\nAlso, tomatoes used to and can still be yellow, so yeah it checks out here too.\n\nThis is not a “German chocking and dying, asphyxiated on their keyword and the whole thing birthed a letter salad that just never seems to end” scenario.",
            "Paradeiser ftw ❤️ (from Paradiesapfel = apple from paradise, a marketing campaign to get people more interested in them in the early days)",
            "Where did you take that Sardinian translation from?? It's tumàtta or pumàtta",
            "That mean you are slavic people",
            "Cause [italian botanic Mattioli](https://it.wikipedia.org/wiki/Pietro_Andrea_Mattioli) describe it as “mala aurea” in Latin and “pomo d’oro” (golden apple) in Italian, cause the first tomatoes in Europe were the yellow ones. If I recall right the name stuck with red ones cause they were considered decorative and were highly priced so the name still fitted",
            "Viva la pappa pappa col popopopopopo pomodoro!\n\nEh, can \"tom-whatever\" do that?",
            "Pomodoro does sound cooler tbh.",
            "Tomaat\n\nAlso, I kind of like Pomodoro",
            "Since they definitely use tomatoes in the best possible way and ahead of every other European cuisine, I think should be allowed to name it however they want",
            "The second stupidest thing here is putting an Ameritard flag below the Union Flag, 🤮",
            "It's not a war - here Italians win.",
            "Paradeiser",
            "No, we are better.",
            "You lot went for the savage rendition of the name, we coined our own.",
            "If you call them tomato people would understand anyway as some dialects use that word. It's like in Germany where carrots are called Karotten while some inferior people call them Mohrüben for some reason.",
            "Actually, the French should have followed it with pomme d’or but ok.",
            "Lmao in poland we say pomidor because we just live our italian brothers that much.",
            "Don’t let the Austrians see this thread!",
            "Come on, Italy, we didn't infect an entire continent with smallpox to bring back tomatoes and have you butcher the word.",
            "Do you realise how much these posts sound like they are made by the yanks? “Why don’t you all speak the same language with different dialects like my Italian cousin (from the bronx)”",
            "Paradajka 😎",
            "The little ball in your throat that grows bigger every year is called \"Pomo d'Adamo\" in Italian. \n\nPomo = apple\n\nd'Adamo = of Adamo (Adam) \n\n**According to the biblical story of Adam and Eve, the first man, Adam, ate a forbidden fruit from the Tree of Knowledge. As he swallowed the fruit, it stuck in his throat and created a visible lump, which is now known as the Adam's apple.**\n\nWe like to call everything that resembles a ball Pomo, don't blame us.",
            "Why is the savage flag there?",
            "Pomidor 🗿🗿🇵🇱🇮🇹",
            "🇦🇺 🇳🇿 - them round red vegetable fruits (I guess)",
            "If the Fr*nch call a simple potato \"pomme de terre\" you guys are entitled to call a tomato \"pomodoro\"",
            "Paradicsom 🤷",
            "[The real weirdos are the bright yellow countries ](https://mapsontheweb.zoom-maps.com/image/137470914586)",
            "Pomodor Norington",
            "What is harder than tomato?",
            "Roșie.",
            "Hang on, US and UK need to be different, thanks to how we pronounce tomato",
            "Just don't ask about Pineapple...",
            "Isn't it \"tumatta\" for my fellow sheep shaggers?",
            "Am I that regarded that when I see \"Pomodoro\" I immediately think of the focus technique rather than the fucking veg/fruit/round vine growining red thing?",
            "And wait to see tomato sauce",
            "Wait, it's a french fault! They started to call *pomme d'amour*, then changed it!",
            "Now ask the Polish which \"supposedly\" has the slavic language stem.",
            "If it helps, Hungarian Tomato is 'paradicsom', literally meaning paradise in English. :D",
            "FYI, the alternative German word is *Paradeiser* from *Paradiesapfel*. They use it in Austria commonly.",
            "We Czechs call it \"Rajče\".",
            "Lugi is the only one who is correct",
            "True, my gf's granma used to call them tomata in dialect",
            "why do people feel the need to rename things on a whim just because. It's the same way king Ludwig decided to change Bavaria's name from Baiern to Bayern just because he wanted it to look more greek",
            "I love this story. Especially the marketing part aimed at their own boomers",
            "I guess because back in the day people thought they were poisonous to the point where they tried killing people with tomatoes",
            "Well technically tomatoes are fruits",
            "Golden apple makes no sense for a tomato though. Like imagine you go to the market, they have these new things called golden tomatoes. In your head you picture like the most perfect juicy apple. And you buy it and you get this thing that is not at all an apple, has no firmness and is just bursting with moisture and what the fuck do you do with this. Well it has so much water maybe you can make... I dunno a sauce or something out of it. Yada yada yada you have the sauces of today because someone called tomatoes apples.",
            "Oh, that's the reason why Russians also call it pomidor, tho we also say tomat",
            "wait was there a point in history when italians refused to eat tomates? what the acutal fuck?",
            "Now this is interesting. Czech word is Rajčata which si short form of “Rajské Jablíčko/Jablko” - apple of eden, but sources say that such name comes from germany for some reason…",
            "From włoskiej to Polski 🤝",
            "The ukrainians, russians, belarussians also have the italians back",
            "Here in Lithuania it's pomidoras",
            "😂 neither do we",
            "and we are immensely proud of you Barry, well done.",
            "Tomaiiiiiidoes 🍅",
            "*ketchup*",
            "Say jalapeno. Say the word.",
            "Pomodoro 🤝 pomidor",
            "Wasn't it also because it was considered luxury food ?",
            "GOLDEN BALLS",
            "I am see also a reference to the myth of the Hesperides...",
            "They are called the same in 1 Albanian dialect : Molla t'arta(golden apples)",
            "\n>It’s literally why this has been such an easy thing to remember when I learnt Italian\n\nYou know it's been the same for me with *potato* in French. *Pomme de terre* is so stupid and yet so genius",
            "Don’t worry, the thing you named at the end is also almost every time wrong. For example: ambulance -> KRANKENWAGEN is wrong. We also have the word „Ambulanz“, but we use it for the car and the station at the hospital.\n\nEdit: we also use Krankenwagen. But you can actually use both words and no ambulance is having „Krankenwagen“ written on it.",
            "> This is not a “German chocking and dying, asphyxiated on their keyword and the whole thing birthed a letter salad that just never seems to end” scenario.\n\nI am confused by this sentence",
            "Same here in Slovenia",
            "I made it, in Nuoro province it's tamata",
            "Oh cool it's *pumata* for us",
            "It comes from Latin, what are you yapping about?",
            "Italy can into Eastern Europe? I always thought it would be Portugal first",
            "Then why you didn't do the same with ananas ?\nIt's yellow too",
            "It means Golden apple",
            "Pomodoro is a pizzaria near me",
            "Fair point Hans",
            "username checks out",
            "Guess it's Ananas, as it is, right?",
            "Hungary too, THANK YOU German language! :D",
            "But you guys are eastojd savages. So it doesn’t really matter. 👍",
            "I still call them tumatis in my Padanian household.",
            "Marketing, the air fryer is a perfect example, the old name was trash and no one bought it for years. Renamed air fryer and boom now even your grandma wants a mini convection oven",
            "People thought they were poisonous at first",
            "The first tomatoes were probably yellow in Italy though",
            "Because \"pomo\" is just a very archaic and aulic name for \"mela\", and can be used for any fruit resembling a sphere.\nSo nobody would get confused in the market, while \"golden apple\", to the educated classes, would be a reference to the well known myth of thr \"Golden apples from the Hesperides Gardens\", a mysterious fruit, growing in a magical place in a land far far away....",
            "Any crop coming from the Americas was at first seen as poisonous, barbaric or animal feed.  \n\nBut then the millennials of that generation started eating them, probably to feel alternative and cool",
            "Paradeiser here",
            "Italy is Eastern European?!",
            "RED SAUCE.",
            "Ha-la-pay-no. Say Worcestershire.",
            "Juh al ah pen e o",
            "more like luxury ornament, during the 16th century was considered inedible and harmful to eat.\n\ncount that every new product from the new world was considered luxury, only with the start of industrialization, the common people started to eat/use them too ( see chocolate, tea and coffee for example)",
            "You KNOW IT, the imagery is so strong, it just works.\n\nTo be honest, I sometimes say \"Pommes d'or\" in French whenever I speak around people who I know have linguistic culture, because it's just that good.",
            "Well, I don't speak German but even I can tell this sounds really wrong. I mean, if your word for the vehicle that transports humans to the hospital is the word for the vehicle that transports Kraken... I mean, you said it yourself, there is nothing else I need to highlight here.",
            "Fake ass word of a fake ass dialect 😤😤 logudorese is the real one ☝️🙏😔",
            "![gif](giphy|1QjuOOy2UtFPPrF85Z|downsized)",
            "Because slavic languages use a variant of pomodor just like you",
            "Yeah me too before see Napoli",
            "Italy and Portugal are Eastern European countries.",
            "Why do you call potatoes “pomme de terre”?",
            "......... 👀",
            "Wait, are they called differently? /S",
            "Do you add a schwa after /s/ or is your dialect one of those that know how to pronounce a final /s/ alone?",
            "That’s what it js",
            "And in ten/twenty years time they will disappear again under a wave of lawsuits",
            "What was the old name?",
            "yeah and we thought potatoes were poisonous at first too, but unlike you WEAK southerners we ate them anyway like real MEN and fucking DIED an agonizing DEATH  \n...that is until we found out the leafs and fruits were poisonous but the root wasn't oopsie teehee",
            "Well shit",
            "It was a joke but thank you that was very informative. I won't say i'm smarter but that knowledge is in there somewhere now.",
            "Lol that's funny considering europeans of the time ate mostly roots",
            "Weirdo",
            "And then there's Croatia. Standard is \"rajčica\", but if you go north it's paradajz, and here in the south it's either pomidor, pamidor, or poma 😂",
            "Weirdo countries of europe unite. We call this a that and strawberries we call pineapples and we cannot call aubergines just aubergines, hell no etc",
            "Just like portugal is balkan, italy is eastern european (you are as well, Krzysztof)",
            "I mean people from western europe came to west Europe from eastern Europe after fall of Roman Empire something like that",
            "Nope. Poland is tho",
            "Nice. Lol.\n\nAnd fair enough: War-shire sauce. \n\nFunnily enough, the area I live in is called \"Leicester.\" All the locals pronounce it Lester, while the mid-size city, 12 minutes away, pronounces it all kind of ways that aren't correct.",
            "TIL :0\n\nThey probably tasted way different back then",
            "I love this sub! Despite it being mainly for banter and hating the French, you can always find new and interesting facts here.",
            "Interestingly, they had all of the reasons to think it was toxic back then: the acid of thr tomato made the lead of the plates more soluble and easy to injest.\n\nThe infamous scene from The Return of the King where Denethor eats cherry tomatoes like a lunatic is a nod to that.",
            ">only with the start of industrialization, the common people started to eat/use them too ( see chocolate, tea and coffee for example)\n\nChocolate was used by spanish armies in the new world long before industrialisation, and coffe was popularised in easter and central europe during the 17th century after the turks invaded and tried to take vienna.\n\nTea isn't from the new world, it's asian",
            "Tea and coffee are not from america",
            "So did the apple come before the potato and the tomato?",
            "Well, we mostly use „Krankenwagen“ which translates to „Sick people car“, but we say it more delightful, because we actually don’t scream at each other in real life. I wrote that wrong, my bad. \n\nOh and a funny thing. We have a lot of these words. Plane is Flugzeug, which translates to „flying thing“.",
            "Akschually the most conservative one towards Latin is nugoresu. Though I  speak logudorese, the Nuoro variant. And we say tamata in here.",
            "That means they are more latinpilled than you. You use a Germanic word, I should be the one taking the piss out of you",
            "Not all.\n\nFor example, in Serbia we call it paradajz (literally paradise). I believe Bosnia and Montenegro are the same.\n\nAnd while pomidor is used in some parts of Croatia, rajčiča (less literally paradise) is more common.",
            "What about \"domat\"?",
            "Naples more like Eastern Europe of Eastern Europe",
            "Because they come from the terre",
            "Because a French can’t pronounce spud",
            "Nope, Gallo-Italic languages are known for their fondness of vowel-less final consonants",
            "Why would they disappear because of lawsuits? My GF uses hers pretty regularly. Hopefully, it's not because of health issues...",
            "mini convection oven",
            "Trash, or alternately, mini convection oven. See the comment you replied to for ~~more~~ same info.",
            "Americas back then was basically an alien planet",
            "You can never go wrong with this insult to an Austrian!",
            "Isn't \"raj\" paradise in Croatian?",
            "It’s more like wuSter sauce",
            "That and the plates used in that time by the elite often were, partially, made of lead. The acid in the tomato caused the lead to break of and give you lead poisoning. So they thought tomatoes poisoned you ",
            "i know mine was how luxuries such as those starts from nobility first then common people.\n\nthey are just for reference",
            "hahah ok, yeah that typo kills my joke but it's ok, I do value accuracy.\n\nAs for German, let's be real 2 seconds, jokes aside etc... no, I don't think German is a beautiful language (BUT an absolute symphony compared to Dutch or some Scandinavian countries, I actually don't want to run away when I hear you guys speak, hell I might stay and listen).\n\nThat being said, it doesn't mean that German is an uninteresting language. For instance, my mother often told me that she firmly believed that whilst French was a good language for philosophy, she'd say she wouldn't be surprised if German turned out to be an even better suited language for it.\n\nThere is also, the occasional German speaker that has a combo of \"tone of voice + accent + je ne sais quoi\" that actually is so absurdly hot that I'd drop on my knees before they even finished verbalising their first word (coz yet again here, the joke is that the word'd be long).\n\nLast but not least, and this one is a bit hippie, but English wouldn't be what it is without the two of us. In a way, just like Canada is the UK and our's love/hate child, the English language kinda is ours. Isn't it beautiful, I could weep.\n\nAnd don't get me started on Arte, what a concept. If you're a bit distracted when you tune in to Arte in France, it could lead to situations like: \n\n\"Wait, wtf is a Montag, did they mean to spell Montage? Or is it how Montage is in German? Oh no wait, fuck, MONDAY, ok yes, no Lundi, all good, situation worked out\".",
            "Tomate comes from náhuatl. :v",
            "Good Austrian-pilled balkanites 😌",
            "Idk about the other Slavic languages but tomato 🍅 in Bulgarian is \"domat/домат\" , so it sounds closer to \"tomato\"",
            "Says the mongol.",
            "What vegetable doesn't?",
            "huh... I know you smog breathers are above the Rimini-Spezia line, but to be sure, I would need to hear you pronounce it because sometimes you think there's no schwa compared to the rest of Italy, but Western Romance speakers may hear something.",
            "This whole discussion has brought me to the question of why Italian provinces below the Rimini-Spezia line should be included in r/2westerneurope4u ?",
            "Air fryers can produce carcinogenic byproducts when you cook meat fat in them, especially meat fats that have been treated in nitrates(bacon, ham, panchetta, lardo etc). We've known this for decades. But almost no manufacturer has put, do not cook bacon in the manual. Even if the chances are small, over decades and hundreds of millions of users issues will emerge, and lawsuits will be filed",
            "Of course the average person doesn't even know what's a convection",
            "It is, and you just made me realize why it might be called \"rajčica\" in the standard, because of paradajz/paradeiser/paradies/raj/rajčica 🤯",
            "Well, I am a yank.",
            "Wostesher",
            "Probably also because, like potatoes, they are nightshade family products, wich can contain poisonous alcaloids like solanin (and possibly nicotine, I'm too lazy to Google it).\n\nSelection (and proper cultivation and storage in the case of potatos) have rendered them harmless.\n\nTip: never eat a greenish potato.",
            "Wasn't the plate thing pewter, which is incredibly easy to dissolve",
            "Monday, Montag = Moon day  \nLundi, Latin lunae dies = day of the moon",
            "Acting like \"fr\\*nch\" is a pretty language is a hard yikes also. At least we know German doesnt sound all to pleasant, but you pretenders think because it sounds romantic in Chansons by Jaques Brel or Edith Piaf french always sounds this great. \n\nUhhh Uhhh Putain Uhh Uhh Merdre Uhh. The average french person sounds like they have a problem with their gastrointenstinal tract.",
            "So you use American word? Even worse",
            "Thank you for the free education.",
            "Wrong country",
            "We're Gallo-Italic indeed, much closer to Occitan and to some extent Catalan, than to the languages/dialects south of Rome.",
            "Because we brought you civilization.",
            "Is that different to any other cooking of meat fats?",
            "How's that different to cooking nitrated meat in a larger convection oven? It's just an oven but smaller",
            "Ah, ok, thanks for the info.\n\nThankfully, we don't use it for meat or fish, so bullet dodged it seems.",
            "Thanks 👍\n\nI'm learning Polish and I got the gist of the word because of the similarity with the Polish word for \"paradise\"",
            "Sssh you're completely right and  \n1. They also ate other acidic foods  \n2. Lead poisoning symptoms take a while to occur so people couldn't really link it to tomatoes  \n  \nBut... the internet is made to spread fake historical myths",
            "Yeah it was but old pewter was made with lead instead of fancy bismuth and stuff",
            "haha I know, I made me sound dumber for comedy purposes, also, to some VERY limited degree, English helps me decipher VERY basic German.",
            "I mean, it's like you're missing ¾ of my points but ok.\n\nAlso, as far as I'm concerned, I don't fully get the whole French-most romantic language thing if I'm honest, I get it to some degree but I can't quite explain why it's so exaggerated in non French's psyche. I'm sure there is combo of culture and other factors etc... but my point is, I don't particularly see it myself. I find Italian far more \"romantic\" (whatever that means in terms of actual sounds).\n\nAlso, lol at your two examples, those songs make me want to drown. Definitely not what would come to my mind if I try to summon romantic French music to my mind.\n\nhaha as for the \"average\" person, well here's your keyword \"average\" - I could personally speak French to you the way you envision as well as as if I owned 3 châteaux and 40 horses, it would certainly not be the same vibe at all.",
            "You're welcome. Would've been nice if you had used it to not blow yourselves up on a regular basis, but God gives and God taketh I guess.",
            "All easterners are mongols.",
            "Indeed, Catalans and Occitans do like coda /s/ but not Northern French.",
            "Nowadays it's the North bringing civilization down South tho🤓",
            ">I’m learning Polish\n\n![gif](giphy|KGSxFwJJHQPsKzzFba)",
            "A lei!",
            "I know in this sub, apologising to a Pierre is probably a crime, but I’ll risk it… sorry for missing that you knew it. My only defense is that a surprising number don’t.\n\nEnglish/German combo helps me decipher a surprising amount of *written* Dutch, Danish and Norwegian.\n\nFrench, I just can’t even. And I’ve attempted French, Spanish and Italian at basic levels.",
            "Hey, im not trying to pretend as though im deeply involved in french songs, which is why those two came to mind. Of course its depressing as all hell, but isnt that what love is about?\n\nIf I take the best examples of \"beautiful\" german, than it can hold its candle to every other language, exactly because of those long words (neologisms) and a few grammatical tricks german is quite suited for poetry. Not to mention technical manuals, but that aside.\n\nNo language is pretty or ugly, its the way we use it. And the french I have heard in the past (a third of my family is french) can be just as harsh and ugly as german.",
            "Well, you can't have everything in life (or death)",
            "Wiem że to trudno, ale chciałbym dobrze mówić po polsku prędzej czy później.",
            "It's ok, no need for an apology, I personally felt bad for shining light on it, and incidentally reinforcing the stereotype that Germans are impermeable to humour.\n\nI'm not surprised by what you said about French, I wouldn't expect it any other way. But what you can do with dutch, I can do with Italian and Spanish to a lesser degree. Portuguese ... is well doable but it's a wild different thing still.\n\nAlso, something that I always find funny is that, whether the person is a native or English second language, if one is truly fluent in English, one actually has a decent French starting pack. But it's just not realised. There are so many words, expressions, and verbs that are commonly used in modern English that are actually close enough to current French that it's like having a bit of a dual database.",
            "Baza. Powodzenia!",
            "Honestly, I was taught French for years at a UK school and got top marks. In the over 20 years since then, it’s totally evaporated. I can probably read it out loud and not be totally incomprehensible, maybe.\n\nEdit: actually, I can still read a complete menu, without assistance, according to my last Paris trip.\n\nI also think French is taught badly. The pronunciation I was taught in the classroom was nothing like what I was actually faced with on my first school trip to France."
        ]
    },
    "I wonder how many will get tattoos this year?": {
        "title": "I wonder how many will get tattoos this year?",
        "score": 409,
        "url": "https://i.redd.it/wzvsp19w538d1.jpeg",
        "content": "",
        "num_comments": 58,
        "comments": [
            "I think whoever sends England home should get a special flair. \"It's not coming home haha\". Something like that.",
            "The beauty of the song is that no one outside of England seems to understand, you all see it as us thinking we're guaranteed to win, whereas if you listen to the words it's about us knowing we're shit, but not letting it dampen our spirits, and the optimism of us maybe doing it again against the odds\n\nWin or lose we're on the booze",
            "Always have and always will. 66 was just an anomaly.",
            "England is not disappointing.\n\nThey just are not good enough.",
            "I love how much that song riles up rival fans. We’re going to sing it every tournament, don’t you worry.",
            "The Peugeot I saw earlier draped in St George flags....\n\n\"Je déteste les étrangers, j'aime ma bière.  Simple comme.\"",
            "You're just jealous because it's coming home",
            "So far they have scored some fookin goals.\n\nIf they keep this up, Susan might survive this Euros.",
            "Its always coming home. They just haven't decided the date yet",
            "Isn’t that [quote](https://www.youtube.com/watch?v=RJqimlFcJsM) literally all about how England always disappoints, but they have to believe anyway?",
            "I wonder how many people outside England will continue to miss the joke this year?",
            "One of our supermarkets has started to produce an ad about how this year will be just like 1988, and we'll really get those Germans now",
            "England:\n\n  - Invents sport\n\n  - It's really popular\n\n  - They never win a world championship",
            "Copium is a hell of a drogue.",
            "Is Southgate on this sub?",
            "It is coming home at the next euros im certain\n\n\nBecause we are hosts and that's what the song originally meant. We ain't winning shit",
            "Are you still in whatever this is?",
            "They lack the emotional nuance to grasp our miserably acute self awareness",
            "Exactly. 'It's coming home' is a dream. If we actually won anything it would kind of ruin it.",
            "I legit don't understand the criticism at all. Do people not understand the concept of a support song?\n\nObviously we're gonna big up the team and claim they're winners.\n\nIf the lyrics were a realistic appraisal of our chances of winning, it wouldn't sound very supportive.\n\nYes \"Im crossing my fingers after the group stages\" or \"I'll settle for a quarter final\" would be more realistic lyrics, but not very fucking supportive.",
            "England are shit : \"We know, we're singing it ironically\"   \nEngland somehow manage to win : \"Told you so. IT'S COMING HOME !!!\"",
            "It's more like you're the only ones laughing at your own joke because no one else found it funny",
            "Exactly. It's only disappointing if you're expecting success, which surely no one with a brain is",
            "Honestly, I think that song evokes fremdschämen rather than anger, we should keep singing it regardless though because we seem to love self flaggelation as a nation.",
            "England:\n\nHave won the world championship in every popular sport we invented",
            "Proud of inventing sports so popular the rest of the world work hard to be better than us.",
            "You need to hire a Spanish coach, Barry.",
            "New England flair: \nSouthgate ball enjoyers.",
            "We all are but Poland, I think. No important countries out yet.",
            "I really would have thought better of an Australian, where did we go wrong raising them that they of all people can’t understand irony?",
            "The sense of irony seems to just wash right over you doesn't it?\n\nI bet you think we're arrogant when we celebrate scoring goals. Should we stay silent until the team lifts the trophy for fear of upsetting anyone on the continent who thinks we have a misplaced sense of entitlement?",
            "\"Dude seriously stop singing it, please. It's not funny bro we're not laughing please stop signing it bro, come on. Bro stop! You're not a good football team you're not going to win. Dude!\"\n\nhttps://preview.redd.it/xxe8aquuk38d1.png?width=633&format=pjpg&auto=webp&s=5430850b396f179a1b45dd5a5c42e4a56d69b05a",
            "And yet here you are.",
            "Soooo, expectations back home are high then?",
            "How many times? >.>",
            "I agree. We have no problem producing good players but we are tactically inept, too much balconing and not enough studying",
            "I'm all for a bit of banter but that is just evil",
            "Ahhh well then... For now you can have my support, mostly because I don't want Dad to win. I'm an asshole of a son like that.",
            "[deleted]",
            "Damn you're easily cut, did I strike a nerve?",
            "Oh yeah. Some people even believe we'll make it out of the group!",
            "More than never times",
            "You know who you need.\n\n![gif](giphy|leGtI4JDAzrWo7jquD|downsized)",
            "well one of the flair suggesting requirements is afterall:  - Offensive and unwanted: If their users don't want it because they find it too offensive, you are doing it right!",
            "It's still early. We still have lots of ridicule and drama ahead.",
            "They only have the capacity for 3 senses: fighting, racism, lager",
            "Only thing you low budget germans have capacity for is wearing Orange. Come back a bit more interesting next time",
            "You took time out of your Saturday afternoon to make a meme about a song sung by a football team's fans in a country you don't take part in, in a sub your country isn't a part of - it rattled you that much",
            "That one time is just to let you fellas feel good, after that it's serious business. Alas...\n\n  https://en.wikipedia.org/wiki/List_of_Rugby_World_Cup_finals\n\n  https://en.wikipedia.org/wiki/Cricket_World_Cup",
            "I got angry our flair was changed.",
            "Like I said for now you have my support...",
            "That's actually all football fans, globally, except maybe the Japanese who are more concerned with racism and litter picking.",
            "Come back more interesting: ‘You wear orange’",
            "Na the meme was fine and made me chuckle, and much like our fellow convict OP here who now lives in England, It's coming home boyssss",
            "Mate calm down it's just banter, I live in England and are currently supporting them as well as Germany.",
            "Your old man is proud of you son.",
            "❤️",
            "Of course it's just banter mate why are you assuming it's not?",
            "Thanks dad!"
        ]
    }
}