{
    "Weekly Novel Discussion Series: Audio Dramas: Deathwolf": {
        "title": "Weekly Novel Discussion Series: Audio Dramas: Deathwolf",
        "score": 4,
        "url": "https://www.reddit.com/r/40kLore/comments/1di1gfb/weekly_novel_discussion_series_audio_dramas/",
        "content": "This series is intended to give all you listeners an opportunity to discuss each audio drama in detail. Please post and thoughts, opinions, and questions you have about this week's audio drama. This series will cover audio dramas, not audio books. \n\n**Every post will be filled with Spoilers from the novel so if you haven't read this week's book then proceed with caution.**\n\n#Audio Dramas: Deathwolf\n\nAuthor: Andy Smillie\n\nPerformers: Seán Barrett, Rupert Degas, Chris Fairbank, David Timson, Charlotte Page\n\nReleased: June 2012\n\nSynopsis:\n\nIn the heavens above Luetin Hive, Erik Morkai's Space Wolves clash with Dark Eldar raiders, jump-pack clad Blood Claws taking the battle to the aliens' own infernal airships. But the war will be decided by Morkai himself as he challenges the aliens' sinister leader to single combat.\n\nExtended Synopsis link: https://wh40k.lexicanum.com/wiki/Deathwolf_(Audio_Drama)",
        "num_comments": 2,
        "comments": [
            "u/own_sd this one is another fun bolterporn nugget. Space Wolves jumping off and landing on DEldar skiffs like Obi Wan at the beginning of Attack of the Clones",
            "Luetin Hive. Really?"
        ]
    },
    "Whose Bolter is it Anyway?": {
        "title": "Whose Bolter is it Anyway?",
        "score": 28,
        "url": "https://www.reddit.com/r/40kLore/comments/1dl5g9m/whose_bolter_is_it_anyway/",
        "content": "Welcome to Whose Line is it Anyway- 40k Edition!\n\nI am your host Drough Carius and welcome to Whose Bolter is it Anyway? where the questions are made up and the heresy doesn't matter.\n\nMost of you know what to do, post quips and little statements related to 40k lore, not in question form, and have people improvise a response to it. Since everyone seemed to enjoy the captions in last week's game we will now be including those as well. If you want to post a picture for us to caption, post a link to a piece of 40k art and we will reply to the link with funny captions for the picture. You can find the artwork from anywhere, such as /r/ImaginaryWarhammer, DeviantArt, or any regular Google image searches. Then post the link here. I have started us off with a few examples below.\n\nPlease don't leave it as a plain URL especially if you're posting an image from Google. Use Reddit formatting to give it a title. Here's how:\n\n[Link title](website's url)\n\nEasy as pie! If it doesn't work, post the link with a title underneath.\n\n**What we're NOT doing is posting memes.** No content from /r/Grimdank. If the art is already a joke, it doesn't give us anything to work with, does it? Just post a regular piece of art and we'll add the funny captions. I've started us off with a few examples below.\n\nSome prompt examples…\n\n1) Things Alpharius isn't responsible for\n\n2) Things you can say to a commissar, but not your gf.\n\n3) etc.,\n\nPlease be witty, none of us want an inbox full of unfunny stuff.",
        "num_comments": 90,
        "comments": [
            "[Codex: Adeptus Custodes](https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2Fwunsd5jn5wzc1.jpeg)",
            "The guardsmen describe the taste of their rations:",
            "What’s the most enviable position in your regiment and how do you earn it?",
            "Before he revealed himself to mankind, the Emperor took many identities. While many of these were men of influence, some of his... stranger identities include:",
            "The Committee of Chaos Sorcerers has released their annual list of banned spells. New entries this year include:",
            "Guilliman has decreed that Space Marines need a bit more training on formal interaction with humanity.\n\nUnfortunately, due to astropathic error, this was misconstrued as \"flirting\" interactions with humanity.\n\nThis has led to a slew of pickup lines, such as:",
            "Roboute Guilliman interviews admirals and generals for senior positions in the Indomitus Crusade:",
            "Craftworlder's Infinity Circuit s̶e̶a̶r̶c̶h̶ question histories",
            "A necron lord awakes in modern earth specifically Disney land. Which ride does he pick and why",
            "The meanest Salamender meets the nicest Marine Malevolent",
            "Primach Roboute Guilliman decides to disguise himself as a normal citizen, Robbie Geeman, and spend a day as one of the common folk. How does it go?",
            "Dentistry in the far future:",
            "A Blood Raven and Ratling compare notes on the cool stuff they've... acquired.",
            "\"Whose bolter is this anyway??\" said....",
            "With the Space Marines having achieved their victory, the Chapter serfs descend to the battle field for the mundane tasks of cleanup and recovery, such as...",
            "Captain Cato Sicarius, Commander of the Victrix Honour Guard, Former Captain of the 2nd Company, has been challenged to complete a Blood Game. How does he accomplish this?",
            "It wasn’t just murderers and rapists Konrad Curze hunted on Nostramo. He went after everyone who he deemed a wrongdoer. He particularly enjoyed hunting people who…",
            "Kesh no!\n\n(Offscreen) KESH YES!!!",
            "\"Custodes, assemble!\" \n\n\"Yes, Shield-Captain?\" \n\n\"I lost my hat.\"",
            "Shield-Captain: \"LEAVE NO STONE UNTURNED! WE WILL FIND MY HAT!\"",
            "\"Alright, whose bloody arm is this and why did you just leave it here!? We're custodians for Throne's sake, we're supposed to keep the place tidy!\"\n\n\"We really need to get someone to check the captain's hearing once this is over....\"\n\n\"I heard that Jones!\"\n\n\"Johannes, sir!\"\n\n\".....Whatever\"",
            "\"Keep looking! We WILL find my helmet, I just KNOW I left it here somewhere!\"",
            "\"And don't bother coming in tomorrow, because you're terminated\".",
            "That's not a battlefield, that's just a regular neighborhood in the Outer Palace that the Custodes are patrolling.",
            "*yawn*\n\nAnother day, another dead heretic",
            "\"Custodes, assemble! I feel like I left the pilot light on the stove, but I'm sure I'm just being obsessive. It's not like the whole hive spire is going to burn down.\" \n\n\"Ugh, Shield-Captain...\"",
            "\"Which flavour did you get, Bill?\" \n\n\"Gristle.\" \n\n\"Awww, lucky! I got Chalky.\"",
            "Wait… they’re flavourful? Yeah… I think I taste seasonings.\n\nI think they accidentally served us officer grade rations",
            "mushy, with hints of prion disease.",
            "\"Oh hey, this tastes like Corporal William!\"\n\n\"How the f\\*\\*\\* do you even know that?!?!\"",
            "An aroma of despair, a texture alternating between slimy and sandy, the smell of disappointment all wrapped up in a codex compliant grey. \n\n“We’ve never had it so good” quipped the guardsman standing before the commisariat commission .",
            "I'm the Regimental Head Chef. I made such good food one time out in the field from what rations we had they gave it to me. Now I don't have any fear of being killed... cause the whole regiment, a few Commissars, an odd amount of Space Marines & a frankly disturbing number of Inquisitors appear in the chow hall when I'm around, so they've all got my back.\n\nWord on the street is that I've got a Sector Fleet watching my back too.\n\nAnd all I did was make Corpse Starch taste good.",
            "I choose who becomes a combat servitor. Everyone is really nice to me!",
            "A philanthropic Nigerian Prince who just wanted to share his vast fortune with the common man.",
            "I had someone refer to shakespear as \"Billy Rattle-rifle\" in a far future Sci Fi story once",
            "\"Some called me... *Chris Chan.*\"",
            "There was a time in human history where glorious melee combat was considered barbaric, can you imagine that? I kept my skills sharp all those years by becoming a performer who would destroy watermelons with a war hammer as part of his comedy act. Thus was Saint Gallagher born!",
            "Remembrancer: \"You were Billy Wigglestick?\" \n\nEmperor: \"Ugh... Do you mean William Shakespeare?\" \n\nRemembrancer: \"What kind of a goofy name is that?\"",
            "Mend Buttcrack. Will never be unbanned, for many reasons, chiefly that Slaanesh and Nurgle both object strongly.",
            "\"Project Powerwash\" has been banned due to Abbaddon's recent Diversity and Inclusion policies, citing it as incredibly disrespectful to the company's valued Persons of Nurgle community.",
            "\"No more summoning butter churning demons. Comon guys, be better.\"",
            "Tungsten ballsack. \n\nThey saw the memes, they know what’s gonna happen, and knowing Tzeentch trolls everyone, they decided maybe to hold off on this one.",
            "Summon Kharne. \n\nIt’s for your own good. Remember that he really doesn’t like psykers.",
            "\"Boltgun Ejaculation\"\n\nGo home John French, you were drunk...",
            "“You know, you look like you have a little Fenrisian in you.”\n\n“You’re mistaken my lord, I do not.”\n\n“Would you like to?” ;)",
            "\"Did you deploy from orbit in a tactical drop pod? Because you look hot today!\" \n\n\"That booty is above the Codex Astartes operational level of fine!\"",
            "Good God man. Imagine pepe la pew style advances by a space marine......",
            "\"You look so delicious I could just eat... you... up....\" - Flesh Tearer\n\n\"I may ride fast and ride hard, but I sure can ride long!\" - White Scar\n\n\"I, Cato Sicarius, am flirting with you! You shall accept my love!\" - Cato Sicarius, Commander of the Victrix Honour Guard, Former Captain of the 2nd Company, etc etc",
            "“Are you a copy of the Codex Astartes? Because I want to be locked in my room with you for a month while I worship you.” ~ Brother Leandros, Ultramarines, 2nd Company.",
            "Purge the Unclean and you will light a fire in my heart",
            "\"The Codex Astartes does support getting me some action.\"",
            "RG: “give an example of a time you managed conflict in the workplace?”\n\nGeneral: “Lord Guilliman I am a deft hand at conflict resolution if I do say so myself, and I do say so! I have successfully fought off no fewer than 69 mutiny’s”\n\nRG: “……”",
            "“Be honest, how often do you pray to the god emperor?”\n\n“I’m ashamed to say only twice a day.”\n\n“Hired.”",
            "\"Pretend I'm a customer and sell me this warship.\"",
            "\"I don't wish to sound unduly boastful, your Lordship, but my kill/death ratio is unparalleled!\"\n\n\"....It says here in your last crusade you achieve a KDR of.....1 to 1!?\"\n\n\"Yes sir! Never let it be said I denied a Guardsmen the chance to do their duty and die to bring down the enemies of humanity!\"",
            "\"So what do you bring to the table?\"\n\n\"I remember how tank treads work.\"\n\n\"I see. And how do you feel about heavy stubbers?\"\n\n\"Hate 'em.\"\n\n\"Oh thank father! You're hired.\"",
            "List of good Black Library Eldar novels\n\nWhy is Google giving no search results",
            "And they comprise and decided to bombard the enemy positions in a manner that will leave the prisoner camp mostly unharmed",
            "Meanest Salamander: \"I will not hug you, for you are not a friend.\"\n\nNicest Marine Malevolent: \"I will spare you this day.... only because I can't be bothered to kill you.\"",
            "Things went well until, due his size and stature, he was forced to work with Ogryns. Due to lack of interesting conversations, Roboute called an end to it after only five hours surrounded by ogryn",
            "Due to the simple words he used, his large size and drab appearance he was almost immediately placed amongst an Orgyn construction team. The efficiency with which they constructed an entire Hab block within the space of 24 hours was astounding..... at least until Guilliman revealed himself at the end of the day and it all made sense.\n\nGuilliman now has a squad of Ogryn that he can reliably call upon to complete any construction task with the same efficiency as an Ultramarine.",
            "Great, disguised (somehow) he genuinely appreciates the common person and for the first time in a while finally finds a solid reason to fight other than the survival of his kind.\n\nHe finds out three days later the planet he visited was exterminatused for only being able to pay 89% of its taxes",
            "According to \"Betrayer\", it's actually canon that most World Eaters have metal teeth implants because their original teeth kept getting knocked out in fights.",
            "\"The Magus Biologis in his eternal wisdom has replaced your teeth with plasma cutters. Praise the omnissiah!\"",
            "DENTISHRY? OI YOU MEAN A WITHDRAWAL FROM DA ATM.",
            "A swap-meet including trazyn, to compare and trade from their collections. \"I'll trade the emperor's shoe-horn for your phoenix lord signed card. And I'll throw in the inquisitor that's been looking too closely into both our affairs\"",
            "The gold tooth and ring cutting servitors of the Blood Ravens are unusually busy.",
            "\"Which body does this head belong to? Mark IV, so that's not right. Oh! Beakie! Now we're talking.\"",
            "Cleaning the soot out of the helm crests of captains. You think they stay that spotless white on their own?",
            "Recovering the jean seed of fallen Battle Brothers to produce better legwear for the next generation of marines",
            "Grant himself more titles and insist that the custodes must call him by his full name as a mark of respect. During the lengthy address he then has time to complete his objectives.",
            "Use shredded cheese in their poutine",
            "Were Kyles and Karens.",
            "Didn't tip their waiters.",
            "They call it \"Mad Guardsmen\" disease",
            "Every day, we move further from the Emperor's light.",
            "\"Shakespeare was a fraud my Emperor, he only wrote three plays. Now Wigglestick, he was prolific!\"\n\n\"Oh these slings and arrows I must endure....\"\n\n\"Ahah! You *were* Billy Wigglestick!\"",
            "There are also some Tzeentchian Chaos Spawn who would like to see this spell used to their benefit. Multiple times. Each.",
            "In the same vein, Summon Khaine is still banned.\n\nWhile not so particular about psykers, is still really pissed over being shattered and will try to kill the summoner.\n\nEspescially ill advised for Slaneeshi summoners.\n\nUnless you're into that. The committee doesn't judge.\n\nWell, they do. But not over that.",
            "***Muah muah muah!!!***",
            "Smooth!",
            "\"This shit here can kill so many heretics, traitors & xenos!\"\n\n*slaps top of Lunar-class Cruiser*",
            "“Buy it or I will use it against you!”",
            "Wow, so even in the future BL's website is shit",
            "\"But I like Bobbie. Bobbie use big words and his face pretty.\"",
            "Fine fine I'll also give you a cadian regiment.... Yes from Cadia. Before the fall? Eh more like I picked them up during the fall. Listen maybe don't tell them Cadia is gone....",
            "Considering I've heard some Custodes have literally moved slower that a dying snail to try to complete a Blood Game, taking them decades or centuries to get anywhere close to the Golden Throne... that's an impressive list of names & titles....",
            "Furries.",
            "But khorne doesn't have an opinion, for he cares not from where the blood flows.",
            "Like a scene from undercover boss\n\n“Bobbie pretty ogryn. I not understand him, I’m big and strong and like smash thing. He big and strong and he like think about things. Weird ogryn but good ogryn."
        ]
    },
    "What would be the scariest Imperial guard regiment to fight against?": {
        "title": "What would be the scariest Imperial guard regiment to fight against?",
        "score": 75,
        "url": "https://www.reddit.com/r/40kLore/comments/1dlol63/what_would_be_the_scariest_imperial_guard/",
        "content": "Which guard regiment (if any) has the best reputation for fear, or in other words the Night lords equivalent? ",
        "num_comments": 60,
        "comments": [
            "For the average line grunt, definitely Catachan.\n\nWhile the discipline of Krieg and Cadia are scary for enemy commanders, how would you as a boot on the ground feel about having to fight Prime Arnold Schwarzenegger, Sylvestor Stallone, and Carl Weathers all wielding Machetes and Flamethrowers?",
            "Catachans. You die brutally to a regiment of the toughest, strongest and most natural warriors of the Imperium. Regiments of Rambos pretty much. Tons and tons of Rambos and Dutch's (Arnold Schwarzenegger from Predator).\n\nYou won't win..",
            "I think this quote makes good case for elysians  \n\n\"The enemy commanders think themselves safe from the Emperor's Wrath behind kilometres of fortifications and legions of warriors. They did not account for us. Make your peace with the Emperor, men—we drop in two minutes.\"",
            "Chem Dogs probably aren't fun to fight. A bunch of criminals high off their asses on space PCP running toward you because behind them is another group with guns sighted on their backs so if they stop they get shot. And also all of this was just a diversion because they are still the Imperial Guard and those artillery shells are gonna be hitting soon.",
            "Lucifer Blacks come to mind.",
            "Penal legions. Nothing says \"hell no\" like 100s of guys with bombs strapped to em junked up on space PCP (frenzon) with nothing to lose!!!!",
            "So, you want to see the fear in the eyes of those Xenos/Heretics :\n\nTempestus Scions would change any tide of battle with their most advanced training and arsenal, definitely one of the scariest sights for any enemy to see Emperor’s finest land in hi-tech god tier gear. A very rare sight indeed, but it means someone with power wants to get this sh*t done fast and clean. *They are practically Space Marines without augmentations, peak-human conditions armed with the most insane arsenal Mechanicus can spawn. Grey Knights alternative for Astra Militarum.*\n\nCatachan are natural born warriors that goes through a real Monster Hunter game all their lives. If they have the environmental advantage rather than open-warfare, it will be a real nightmare and they-will-win. *One story involves a famous leading officer losing his arm to a freaking LAND SHARK and then ripping the sharks throat out by biting it. Another boring day in Catachan forests.*\n\nEven Imperium thinks Kriegsters are batsh\\*t insane, if they werent so useful Big E himself would vote to nuke them off. Those relentless bastards destroyed Space Marines, Tyranids, even pushed Necrons back and destroyed tombworld cores. You know something is really wrong when Commissar actually tries to be reasonable or Inquisition itself tries to avoid few problems related to Krieg. *A Krieg team once coordinated almost instantly to force an invulnerable/phasing Canoptek Wraith into melee-combat (so that it would engage its phase-out protocols to become vulnerable) and then the rest of the team shot the everliving sh\\*\\*t out of their charging-comrades and the machine to death, didnt even blink.*\n\nAs a fear bonus but not regiment, seeing the lonesome Eversor Assassin wandering amongst the ruins and friendly/enemy corpses means you are fu\\*\\*ed beyond measurement. It means various fun activities like being branded a heretic-fugitive by Inquisition for nothing-at-all and being involved in an active scorched earth protocol. *That is what they send to make the place disappear from history while Exterminatus batteries are charging.*",
            "I mean *all* Guard regiments are scary when you're some barely literate underhive scum caught up in a rebellion. Shits hit the fan when you see full time, professional soldiers arriving in their hundreds of thousands with tanks, artillery, heavy weapons, Naval and specialist support to put down your demands for fairer working hours and food.",
            "Tanith First and Only or the XXIV Catachan regiment\n\nBoth for the same reasons, they are experts on killing from the shadows. The Taniths are expert marksmen and good at moving covertly\n\nThe XXIV Catachan is the same, ambush and traps. Just a bunch of Rambos killing and dissapearing into the jungle \n\nYour forces would be picked apart one by one by an unseen force, If you run, surely you will trigger an explosive trap, If you don't, snipers will kill you",
            "I will throw the macabian jannisaries in\n\nThey are zealous fighters who charge will screaming for their patron saint and they are very well equipped. And imo when you mix zealous soldiers with good equipment shit gets real and scary",
            "A lesser known candidate would be the [Miasman Redcowls.](https://wh40k.lexicanum.com/wiki/Miasman_Redcowls)\n\nAll other guard regiments fear fighting alongside them for their incredibly destructive flamer weapons. In fact, the Imperium use them like the Legion Destroyers of old.",
            "Catachans is the natural answer but I definitely wouldn't want to be put up against the Savlar Chem-Dogs. Some of the worst of the worst Penal conscripts from a borderline death world neighboring Armageddon where the options are join the guard or slavery in the chem mines with a loot lust and kleptomania that'd make an Ork and a Blood Raven blush with the bonus penchant for flamers, heavy bolters, chemical weapons, and juicing their rebreathers with drugs. No thanks.",
            "The 83rd Malradian Ball Stompers. Incredibly wild regiment, definitely don’t want to get on their bad side",
            "Maccabian Janissaries for my first choice. Because if you think Kriegsmen are suicidal emperor botherer’s then you are in for a surprise. Second choose is Tannith. Yes, Catachans are scarier is a flat fight. But you would never know you were being followed by Tannith troopers till your numbers just start disappearing to ghosts. One minute you’ve got a full strength squad. The next? You are all alone and you hear nothing as the trees laugh at you.",
            "Last chancers",
            "I think either the Catachans or the Death Korps.",
            "Terrax guard, I mean commissars are scary, now imagine entire regiment of them",
            "Definitely Kriegsmen. Their regiments often practice combined arms (infantry, mechanized infantry, armor and artillery), whereas most Imperial Guard units do not, and operate at larger than average numbers than traditional regiments. Due to their history and loyalty, they're one of the few worlds approved for vat grown soldiers (or something of the sort) so their units are replenished much faster than most. They place little value on individual lives other than how much damage they can cause to their enemies at an acceptable Kill-to-Death ratio for the success of their campaign. They have no qualms strapping bombs to their chests and charging trenches or Traitor Astartes, or using chemical and biological weapons. They used them on their own damn planet. Atomics too. They don't care about civilian casualties. They're probably the only Imperial Guard Tithe Planet that trains as rigorously as Cadians.\n\nAnd they have shovels.\n\nHowever, if a Catachan deployment includes Sly Marbo, then Catachans are scarier. By far.\n\nEDIT: Honorable mention for the Solar Auxilia. I'm not sure if they're technically Guardsmen or not, but if you're a baseline human you're losing. They're trained specifically for defending Terra and the Sol system against everything that could threaten the Homeworld. They have resources and training that just outmatch anything any other Guard unit puts forth. They probably make IG stormtroopers look like school children.",
            "I wanna say Krieg just cuz of their batshit insane mentality. But idk there’s some lesser known regiment that’s worse.",
            "Tanith first would be pretty fucking scary. They pulled off some crazy shit and their chief is the guy from balhaut, damn.",
            "One that gives out koolaid",
            "Either Catachans, the Tanith 1st, or the Salvar Chem Dogs.",
            "I'd say Kriegers. They have the suicidal death cult found in some mujahideen, but have the equipment and numbers to fight as a regular army force.",
            "0) Medusa planet abhumans\n\n1)Lucifer Blacks/Tupelov Lancers\n\n2)Vostroyan Firstborn\n\n3)Mordian Iron Guard\n\n4)Tempestus Scions.\n\n5)Terrax Guard.",
            "Krieg. A long drawn out war of attrition would definitely effect the sanity of most people. Imagine hearing artillery shells landing in and around your trench daily and having to wonder when one is going to kill you. You'll also have to face off against a foe that is very difficult to break. Imagine having to defend against a horde of faceless infantry advancing in silence in the mist and gas.",
            "Kreig or catchan depeninging on what type of combat you're talking about if im defending with no need to leave a fixed position. Kreig wins that 10/10 as just a demoralizing force, thay are a faceless legion that acts as a hammer. Now, if I have to attack and come fight on there terms catchan win that",
            "Krieg are absolutely monstrous to fight against.  There is no reasoning, no mercy, no compromise, no talk, you're in for a bad time from the moment they land.",
            "Karskin units killed some Chaos Marines in Cadia's last stand.",
            "The Tanith first and only.\n\nYou don't see or hear them.  Slowly your unit gets taken out one at a time until you're left.",
            "Catachan or cadians, more specifically the kasirkin. Either a bunch of Rambo’s with lasguns knives and flamethrowers or elite stormtroopers who once jumped a daemonhost and had the attending inquisitor more afraid of them than the host.",
            "\"Sir, why are the trees speaking australian?\"",
            "Any good catachan novels or series?",
            "I imagine their tactics would be similar to vietcong hit and run and various dirty tricks to demoralize the enemy and wear them out. Not just kill them.",
            "I love the elysian troops, the image of one dropping on a heretic Astartes with a melta bomb primed is *chefs kiss*\n\nBe neat if GW gave guard some of the unique infantry options back again.",
            "I love the chem-dogs",
            "Who are these?",
            "Really surprised I had to scroll down so far to see the Tanith first and only",
            "That's a really interesting answer \n\n\nEdit- and the green flames really draw further parallel that the IoM are space Skaven",
            "What do they do to the bad guys? Do they have any feats?",
            "Maccabian Janissaries are my fav regiment. Such a cool look and history",
            "Solar Auxilia are originally from 30k. And yeah...they all have full void armor and volley guns. And they're very well trained. The best of the Solar Auxilia are far better than any normal Imperial Guard regiment in sheer versatility, strength, and combat training. That being said, I don't think we see much of them in the 40k setting.",
            "Not to mention that one of them is responsible for killing a chaos dreadnought with nothing but a lasgun and some local plants. And don’t get me started on what he can do when he’s really trying.",
            "“We’re down under now.”",
            "If Catachans were Aussie they’d specialise in being friendly fired; that’s what they mostly did in nam (bloody yanks can’t handle their tangs)",
            "They have a couple of books I've not read.\n\nSome of them show up in a few other novels like.. er I think Pandorax? Where they show some big skills.",
            "Deathworlder was pretty good.",
            "The Straken novel I really enjoyed, deathworld was banging too",
            "If the kind of enemy they were fighting called for that and the terrain made it possible, definitely. I could also see them directly confronting them if they are an inferior force and overwhelm them with their strength and speed.\n\nI love Catachans because they are so adaptable. Still, you are correct in that their primary type of warfare is asymmetrical and guerilla type warfare.",
            "Definitely would use irregular tactics, their operational doctrine is similar to British Commandos. Applying point pressure in small force groups to catch enemy positions unaware with overwhelming rapid force, disrupting and devastating before withdrawing again.\n\nUS army Rangers were modelled after the commandos too.\n\nExcept of course you ramp all this up to 11 with the 80s action hero being your standard trooper. It's erm.. quite a threat.",
            "This is the IG Regiment that guards the Imperial Palace and most of the Senate. While they would be a scary regiment, I don't think most enemies of the Imperium are ever likely to encounter one of them.",
            "I think they use their feats on the bad guys.",
            "\"We ain't making it out back with this one\"",
            "Deathworlder is specifically about Catachans. They're on a world falling to Tyranids and they're given a final mission to extract an essential McGuffin. Cue an odyssey of alien horror.",
            "> US army Rangers were modelled after the commandos too.\n\nThe Rangers are modeled after the American and Canadian rangers of the American Revolution and the Indian Wars before it, and in turn which saw a modern remake with the First Special Service Force\n\nRangers act more like small-unit light infantry and their job was more often that of a  long-range reconnaissance patrol, or LRRP unit.\n\nThe concept of a ranger in North American colonies goes back to at least 1622 with a organized unit by 1676 while that tactic - a group roaming about for weeks and weeks - of course goes farther back with the native people.\n\n\"When I had ten men able to go abroad, our common wealth was very strong: with such a number I ranged that unknown country 14 weeks.\" - Capt. John \"Samuel\" Smith - 1622\n\nEdit - If anything the concept of Commandos comes from the rangers of North America",
            "Do the Lucifer Blacks even have any feats? They just seem to be told exclusively as guards which is pretty bad because they cannot build up combat experience other regiments have a shitton of.",
            "No, the concept of commandos comes from the Boer commandos in the Boer Wars. Major General Truscotts original proposal to set up the Rangers was literally quoted as \"along the lines of British Commandos\".",
            "After the War of the Beast not really. They basically exist on their prestige from the early days of the Imperium. They are well known because of their posting moreso than their combat record.",
            "They see deployment in the watcher of the throne. Mostly, they clean up as their boss makes it rain viscera. Which is tad ironic as their boss is a Custodian.",
            "The only feat I can think of is when a squad of them take on [Alpharius](https://wh40k.lexicanum.com/wiki/Legion_\\(Novel\\)) actual, he kills every single one of them before the final member gets a melee strike on him which he complements before killing him too. Not particularly interesting but it was a few humans vs a primarch on short notice."
        ]
    },
    "What happens to a Space Marines rank if they're made into a Dreadnought?": {
        "title": "What happens to a Space Marines rank if they're made into a Dreadnought?",
        "score": 23,
        "url": "https://www.reddit.com/r/40kLore/comments/1dltn45/what_happens_to_a_space_marines_rank_if_theyre/",
        "content": "If a captain were to be injured to the point of being encased in a Dreadnought would they retain their rank of captain or do Dreadnoughts have no rank/hold different ranks all together? They probably can't actually lead squads anymore, but would they still be sought out for their wisdom and be treated like they still hold that rank?",
        "num_comments": 23,
        "comments": [
            "I'd imagine they keep the rank and honours but not the duties normally associated with it but as with all things space marine it really depends on the chapters culture and traditions",
            "They don't lose their rank as such, but they become \"venerable\". Leadership is hard when 99% of their existence is spent in hibernation. And yes, in some chapters, dreadnoughts are used as walking and talking reminders of the past.\n\nA notable exception is Bjorn of the Space Wolves (gtfo with that \"Vlka Fenryka\" nonsense, they wolf down with the wolf lords every chance they get. so space woofs is perfectly fine), who at various times acted as chapter master after he got entombed in a chassis.",
            "Dreadnought is not part of thr active command chain often. However when deployed one is a hightly honoured advisor. \n\nAnd you'd do well.to listen to the old dreadnoughts suggestions",
            "Referencing “The Glorious Tomb” audio drama, much time and many deaths pass while a dreadnought is asleep, to the point where the Space Marine inside begins to lose his identity, except for a few veterans who remain in the chapter, and is identified by the dreadnought chassis itself.",
            "Since most dreads spend their time asleep between battles I doubt captains get to remain captains but I could see a dread retaining a sergeant rank",
            "Depends on the Dread, the chapter, and the circumstances\n\nDreadnoughts who held rank can still command when they’re aroused to war, there are plenty of examples.\n\nIt’s unlikely they’ll permanently keep a command they held, as they’ll be asleep most the time, but a senior captain/officer dreadnought would absolutely be able to resume their role should it be required. It’s happened on several occasions, such as with the Ultramarines 2nd company on Damnos or with the M32 Battle of the Fang on Fenris.\n\nI believe the Iron Hands also had one of their clan-companies permanently led by a Dreadnought at one point, who simply didn’t go to sleep like normal dreads and retained his captaincy",
            "I think it depends on the Space Marine. For example, Magneric from the Black Templars led a squad even after he became a Dreadnought. Or, for example, Ares from the Iron Hands. But some simply became warriors and did nothing but battle.",
            "Depends on the chapter and the marine, really. \n\nMost officers (captains/lieutenants/sergeants) probably become venerable dreadnoughts, but aren't awoken to lead their soldiers to battle - the position is probably already occupied by someone with a more contemporary experience by now, and most they can do is to aid their company.\n\nChaplains, however, often retain their lucidity and remain [spiritual leaders of the chapter in death](https://wh40k.lexicanum.com/wiki/Chaplain_Dreadnought#) both among loyalist and chaos space marines (e.g. Sor Talgron/Warmonger of WB).\n\nThere's also at least a single incident of a [Chapter Master](https://wh40k.lexicanum.com/wiki/Carab_Culln) retaining his rank (de jure) even after being interred - though I'd guess he doesn't lead Red Scorpions often.\n\nBlood Angels & their successors also inter their librarians, so they could also provide advice to the new adepts of Librarius.\n\nAlso, Iron Hands & their successors revere their dreadnought brethren the most, even giving them seats on Iron Councils due to their expertise.",
            "There is a heresy era word bearer chaplain in dreadnought in Word Bearer's Omnibus. He is an advisor most of the time and the spearhead/commander of the dreadnoughts in battle. Current chaplain sees him as a hero and sage. His approval of the current chaplain is what made him the current chaplain. So yes, rank matters. Other dreadnoughts are not cared as such.",
            "They are honored but think rank stops really mattering. They just become a respected elder who offers counsel and experience. Won't be leading detachments but will probably be part of the leaders immediate subordinates depending on how mentally  sound they are.",
            "Perhaps they only get to lead formations of Dreadnoughts, based on rank and seniority?\n\nImagine the hilarity of a mixed company of Dreadnoughts deploying in a Crusade, under (probably) ex-Chapter Master Bjorn the Fell Handed (who is both very large and wise, and can tell everyone about his personal experiences with Leman Russ).",
            "They are no longer in operational command of their former units, although some may exercise command for a while longer until the need for them to enter hibernation. The longer they are operational however, the harder it is for them to think clearly -- something which is bad when you are supposed to be commanding soldiers in war.",
            "Dreadnoughts are normally outside of the normal command structure. They're revered and respected, but they don't really have a \"rank\" per se.",
            "As others have said they become ‘Venerable’ or in some cases I’ve read the term ‘Ancient’ it’s similar but not exactly the same thing as Honorary. In that they’re not expected to carry out the full range of duties associated with the rank but the rank and experience means other ranks bow to their experience when making decisions quite often.",
            "Yea I kind of view dreadnoughts as warrant officers (US military). Typically they’re former NCOs turned officer, very brash, you never see them, full of information/stories, very chill until you disturb them, and basically are honored by all ranks too to bottom. \n\nFor reference a CW5 (while not on paper but it’s an unwritten rule) probably has more experience and time in service than probably anyone in the command structure. This isn’t always true but they are called unicorns for a reason. \n\nWarrant officers memes for reference",
            "Bjorn gets a pass because he was Chapter Master when he was interred. Because he never died, technically he’s still Chapter Master",
            "I'd guess they keep the rank but are effectively \"off duty\".\n\nThey will still be referred to as a captain, because they are one, just without a team currently assigned to them.",
            "Is there a negative effect of Dreadnoughts not going to sleep?",
            "Marshal Magneric of the Black Templars would be a good example of a Dreadnought commander who was considered a bit crazy even by BT standards.",
            "Usually it’s presented as maddening for them.\n\nWhen they’re awake they’re constantly aware of their own limitations and how much they’ve lost. It takes a very strong-willed individual even among Space Marines, to even be capable of piloting a dread in the first place. Sometimes it’s even hinted they’re in constant pain, or have phantom sensations. I believe the justification for the Iron Hands one was that as a senior captain he was already mostly machine, so being interred in a dreadnought coffin wasn’t a big deal for him.\n\nIt’s one of the reasons chaos dreadnoughts inevitably rapidly succumb to insanity.\n\nSleeping between battles, when they have something to focus all their attention on, is usually presented as a mercy to a once-proud warrior reduce to an armoured coffin. The downside is they start to forget and get “foggy” the longer they live and the longer they’re kept in stasis. It also gets progressively more difficult to wake up Dreadnoughts as they age because of this",
            "An additional risk to Blood Angels dreadnoughts, according to the game Battle Sector, is that the loss of self/willpower and exhaustion can cause a BA dreadnought to fall to the Black Rage. This makes them a nearly invulnerable killing machine, and their Blood Angels brothers hope they die in battle, because if they don’t then the BA have to try and put them down themselves. One of these crazed dreadnoughts managed to wipe out half a tyranid force before finally being slain.\n\nOh and regarding the original topic, in the book Devastation of Baal, there’s a former Chief Librarian of the Blood Angels who was interred into a librarian dreadnought and stationed defending the BA’s deepest dungeons. The place appears to be somewhat warp-connected which might explain how he is able to retain his sanity after hundreds/thousands of years though. Chief Librarian Mephiston reveres the dreadnought as his esteemed predecessor but Mephiston is recognised as the current Chief Librarian.",
            "IH getting interred: lightweight no reaction",
            "This is an upgrade."
        ]
    },
    "Favourite morally grey moments in the lore?": {
        "title": "Favourite morally grey moments in the lore?",
        "score": 24,
        "url": "https://www.reddit.com/r/40kLore/comments/1dlssid/favourite_morally_grey_moments_in_the_lore/",
        "content": "Seeing many threads about the absolute incompetence and horrific treatment of their own citizens as well as other alien species and the general genocidal tendencies of the Imperium. I'd like to pose the question: What are your favourite moments in lore where some of the more extreme and terrible decisions *(from a normal and sensible standpoint)* that turned out to be possibly the only right thing to do?\n\nI'll start with a small one. *Spoilers ahead from an episode of the mini series Hammer and Bolter.* >!*In episode 13 \"A new Life\" you follow a small family of lowly hab-workers trying to escape an Imperial colony during a Tyranid invasion. Caught between the crossfire of paranoid Guardsmen trying to stem both the tide of Tyranids as well as panicking people that want to leave, brutally gunning down their own as well as the Nids. The little family, with their newborn finally make it off planet with the help of some underground \"rebels\" that has managed to get them a spot on one of the transport ships. All is well you think, till you realise the little family are all last generation genestealers cultists and their little infant is a newborn first generation genestealer, and they have effectively just infested a ship and are now heading to a new world.  I guess the paranoid Commissar at least had a reason to be. Truly Grimdark.* !<\n\n",
        "num_comments": 12,
        "comments": [
            "I've always been a fan of Inquisitor Kryptman. He's killed more people than any other mortal in the setting, invoked Exterminatus enough times that even the rest of the Inquisition think he's a lunatic. And yet, it's hard to argue with his strategy - he's not a madman, just someone who recognizes that, in the face of the Tyrannic threat, for once the Imperium's utter ruthlessness needs to be kicked up a notch.",
            "The mobilisation of Terra's civilian population during the Siege of Terra.\n\nPeople from all walks of life were simply conscripted from nearly every walk of life, and placed in the first wall as the hordes came.\n\nAs in real life, it was a morally grey area, but the necessity of it vs the consequences ultimately determined the course of action.",
            "The Blackstone Fortress novel has one character who is a pilot on the run from the Imperium. The Guard were fighting a chaos incursion on the planet below and were losing. Demons were coming through and command decided they couldn't save the planet or the soldiers they had fighting for it, the sent in Navy fliers to drop nukes, but didn't tell them their targets were \\*everyone\\* including their own people. \n\nOn the way back this character realises what they have done, and works out that all the returning pilots are being neutralised, so runs for it with their remaining fuel, managing to just get away, for the moment.\n\nIn the stories current moment, this woman wakes up screaming knowing she is responsible for nuking a bunch of loyal soldiers and also that the Imperium will literally never stop chasing her to keep her quiet.\n\nLiteral horror story for everyone involved.  We can't know if there was any other way to deal with the planet once the Guard started losing, but with massive cult activity on the surface plus a full reality incursion, pulling an 'Armageddon' might actually have been the only way they had available to deal with it.",
            "One of the most unnerving stories I read was … the night of the wolf (I think) . Some space wolves sent to pacify a rebelling imperial world get caught up in a dark eldar invasion of the same planet . The rebels and space wolves successfully fight off the xenos , and become close friends over the course of the fighting . The space wolves , during the victory feast , simply assume that the rebels would naturally want to be absorbed back into the imperium after all they’ve went through , but the opposite is the case. \n\nWhen both sides realise this, the wolves just gun down their former rebel comrades at the feasting hall, and later order their ships to blow up the main rebel cities",
            "I have 2\n\n1. The Devastation of Baal. To prepare for the Tyranid invasion, Dante of the Blood Angels orders every Baalite citizen ages 10 and older to be armed and to fight, no excuses.  Imagine being a 10 year old and ordered to go to war or be executed.\n\n2. In the Krieg novel Dead Men Walking, some of the local citizens of a planet being invaded by Necrons decide to rebel and start worshipping the Necrons. They manage to take the commissar of the Krieg regiment hostage. So there's this rebel leader holding a gun to a commissars head in the middle of the street telling the Kriegers to fuck off. So the Krieg soldiers back off right? Wrong. Without hesitation, they just blast the shit out of both the rebel and the commissar before marching on.",
            "Getting rid of all the baseline humans after the First War of Armageddon is in my mind still the only viable option and one of the few times the Imperium's cruelty has been justified.",
            "Grey Knights/Ordo Malleus nuking several worlds that come into contact with escaped Armageddon soldiers to avoid the spread of Chaos",
            "The Hive Mind doesn't care one iota for individual human lives. Kryptman knows that in order to adequately combat the Devourer, we ourselves must mobilze and think similar to a Hive like entity in order to counter a hive-minded entity and strategize on the macro-scale first and foremost.",
            "Yeah this is a good one, I do think that conscripted citizenry obviously had zero chance to survive in a god machine / astartes conflict",
            "It's a little different. It wasn't a rebelling world, but a newly discovered human world during the great crusade. These people never knew the imperium and after defeating the Drukhari they just wanted to return to the life they lived for generations.",
            "Big assumption of them to think the Krieg would give a shit about someone's life",
            "Especially since we have a canon example of \"one dude was spared after daemon battle, became asymptomatic carrier of Nurgle Rot, killed thousands of people via infection and elevated to Daemon Prince\"."
        ]
    }
}