{
    "Free Talk Friday!": {
        "title": "Free Talk Friday!",
        "score": 5,
        "url": "https://www.reddit.com/r/49ers/comments/1dl2anh/free_talk_friday/",
        "content": "Hey everyone! Happy Friday! What's on your mind? Use this thread to discuss anything you like.",
        "num_comments": 6,
        "comments": [
            "If anyone is from the 209 there is a thrift store on McHenry called \"Chasing Nostalgia\" and they have a lot of awesome vintage niners stuff. Lots of old jackets, jerseys and shirts from the 90s and 2000s. I got a sweet Kaepernicking shirt for $8. The nice jackets are very expensive though but definitely worth it.",
            "I decided to torture myself and watch [the TubFrog video about the last 15 years of 49er heartbreak](https://youtu.be/JnW5WkD4ymc?si=r7LxbDXOXlI9oODM). For me personally, the two losses that still hurt the most are the most recent Super Bowl and the 2013 NFC Championship against Seattle",
            "I did the writeup for Brock Purdy and Mooney Ward for the [r/nfl Top 100](https://www.reddit.com/r/nfl/s/lNv1oy9bIk) that just got uploaded if anyone wants to read it, or bitch that Purdy is too low lmao",
            "I was briefly in Cincinnati today and decided to eat some Skyline Chili. It was heavenly.",
            "I’m sick of all the BA drama. Just saying",
            "It was heartbreaking but hearing “intercepted at the GOAL LINE” was satisfying."
        ]
    },
    "Albert Breer suggests Aiyuk demanding Jefferson money is when 49ers would seriously consider a trade": {
        "title": "Albert Breer suggests Aiyuk demanding Jefferson money is when 49ers would seriously consider a trade",
        "score": 166,
        "url": "https://sportsnaut.com/san-francisco-49ers-news-aiyuk-trade-tipping-point/",
        "content": "",
        "num_comments": 96,
        "comments": [
            "They can just franchise him idk why Aiyuk thinks he has the upper hand here.",
            "I think we could figure out a way to lose the super bowl without him",
            "Not worth paying him anything over $27-28 million.",
            "Is there any team out there who would pay him Jefferson money?",
            "These WRs are demanding more than Brady made in his final years. Crazy",
            "Do what I do in Madden and just lock him in franchise purgatory by franchising him until he retires or just starts to suck. Unethical for sure but I mean what’s he gonna do? 🤷🏽",
            "I would too he's NOT worth 30 million+",
            "BA is good but he’s not a Top 5 WR. Is BA a top 10 WR even??? Maybe he is but I guess I need to be persuaded. I love him and want him to be a 49er but the 49ers can’t pay him like a top 5 WR when he’s not",
            "As they should.  He aint' that.",
            "I'm quite certain they have been open to trade offers all offseason at the right price.",
            "Zqxfo\\*9z99 xzxx.cooooozooi Ii ooooooooooooooooooooooooooooooooo\n\n![gif](giphy|WxDZ77xhPXf3i|downsized)\n\n🛝🛝🛝 Ooo.  Fcc",
            " Can we trade him and find a more down to earth WR who cares about the team and is happy to be in a winning franchise",
            "No team has won a super bowl with a top paid WR!! Also no WR is worth $30+m a year!! I would rather pay CMC $30m before ANY wr. lol",
            "The thing with Aiyuk he’s a legit top 7-10 receiver but not a game changer at the position. I also think there’s 20 receivers in the league who would do about the same in this offense. It’s not like George Kittle who legit has a unique skillset within the league.",
            "I love BA but it doesn’t seem right to expect the same salary as the #1 receiver. I think he is ranked #9.",
            "I would love to have Deandre Hopkins instead of BA. Sorry if people wouldn’t like it. Just want to know everyone thoughts on that. Haven’t seen anyone mention him..",
            "I love Aiyuk. I hope he stays, but wide receivers are becoming as expendable as running backs.",
            "to who? the 49ers fo are greedy fucks so no one wants to trade their asking price.",
            "The Niners have **exclusive rights** to Aiyuk for the next 3 seasons if they wanted to, and there is (*literally*) nothing Aiyuk can do about it.\n\nHere’s how it breaks down:\n\nHis 2024 cap hit is $14M.\n\nIf the Niners Franchised him next year (2025), his salary would be $23M - $24M.\n\nThe following year (2026) would be Franchise tag $$$ + 25%. That’s $30M.\n\nSo if Aiyuk is demanding anywhere near $30M/year, the Niners can just keep him here thru the end of the 2026 season for an average of $22M/year by tagging him twice.\n\nThe Niners have **100% leverage** here.",
            "They don’t even need to franchise him this year, he’s under contract.\n\nHe could hold out and take the fines, but I think it’ll get solved.\n\nAiyuk deserves a payday but he has to know he’s more Amon-Ra. St. Brown money than JJ.",
            "They have him on his 5th year this year.  And you are right.  They can franchise next year and the year after.  But the cap hit would be brutal with no bonus money to lower the cap hit. \n\nBut you are correct Aiyuk does NOT have the upper hand. Especially with Pearsall and Cowing added to the team.",
            "Assuming they convince him to play under the 5th year option without an extension, a tag next year would be basically a guarantee he doesn’t play or gets traded.",
            "Yup that's basically what the Bengals and Tee Higgins just did. \n\nCoincidentally, Higgins has the same agency (Athletes First) as Aiyuk does. They don't really have many high-profile WR's in their client list and I wasn't surprised they couldn't get a deal done with the Bengals. The only other 2nd-contract player we have that uses Athletes First is Fred Warner, and he reset the ILB market when we extended him. \n\nIf Aiyuk really wants JJ $$, and his agency is willing to fight for it, I could see this playing out the same way as Higgins next season. \n\nWe could tag Aiyuk next season for around $25 million. Then tag him again in 2026 for 120% of the previous year's tag (around $30 million). \n\nThis averages out to $27.5 million/year for those 2 years (2025/2026). It's less if you factor in the 5th year option season, but that's already in place. But those tags are Kyle/Lynch/Paraag's leverage. They can control Aiyuk until the 2027 offseason, and he has zero recourse besides attempting a hold-in and sabotaging his future earinings. He'll be 29 then.  \n\nThe other option next year (besides just signing him to an extension) is to find a trade partner willing to give us value greater than two more years of Aiyuk at $27.5 million/year (or 3 years at $24 million if we trade him this year, factoring the 5th year option). This depends on a few factors - how much Aiyuk's camp is really asking for, how well he plays this season, and even how well Pearsall plays. \n\nOn the other hand, Kyle/Lynch are pretty reluctant to use franchise tags on players. They've only used one on Gould, and that was mostly to control him for that offseason to get a contract negotiated. I could see them not wanting a \"hostage\" in the locker room, and agreeing to a potential trade if Aiyuk refuses to sign a reasonable deal and if a team offers a 1st round pick. Trade Aiyuk, gain a 1st round pick which we can use on another WR, and free up some future cap space for Purdy and others. Basically the Buckner/Kinlaw approach.",
            ">idk why Aiyuk thinks he has the upper hand here\n\nBecause he’s a WR.",
            "The answer is probably his agent",
            "Does he think he has the upper hand, or is he simply trying to play his lesser hand as well as he can?\n\nHe's 26.  By the time he's done quietly and dutifully serving out this contract and a franchise tag he'll be 28, 29 if he gets double-tagged.  Then what is he worth?  If he goes along to get along, that's what will happen.  If he acts out, most likely, the same thing happens.  He's forced to play out this contract and at least one tag.  However, there's a chance the 49ers pay him to appease him, or trade him to a team that will pay him.  There's no downside to acting out and the only potential for upside is in acting out, so he's incentivized to act out, even if it's out-of-character for him.  Being a team-first, unselfish player gets taken advantage of by teams during contract negotiations.",
            "Until he becomes locker room cancer and forces them to ship his ass out",
            "And then what… you think he balls out or does he join deebo in showing every play where the ball isn’t coming to him",
            "Fucking OUCH",
            "I hate you. \n\nUpvoted cuz you’re right. \n\nBut I still hate you.",
            "But 2025 is our...nvm. Estoy cansado jefe",
            "🤣🤣",
            "Then trade him, because he'll get $30M on the open market.",
            "And you pulled that from where? Why isn’t he worth 29 or 30m?",
            "No. Well maybe the Panthers? Hopefully Lynch is talking to them 🤣",
            "Christian Kirk got 4/72 in 2022. I think Aiyuk could get close to Jefferson from somebody",
            "Probably not. But the only way he'd find out is if we let him explore trades. Which isn't great for us cause it only takes 1 team to offer him more than what we're willing to go for to shut the extension talks down",
            "No, but I don't think a mil or two under that is impossible.  I could easily see him get between AJ Brown and Jefferson.\n\nTherefore, in a negotiation, start at Jefferson to give yourself some wiggle-room.",
            "But roughly the same percentage of the cap as top WRs were making in Brady's final years, so not that crazy.",
            "He’s probably around a top 10 receiver and Amon money makes sense. JJ money is just posturing and while he’s good he is not close to the best in the league. This posturing is because a deal is coming soon the niners have two years of control and it would be career suicide to actually not play or half ass it. Some people say three years control but no team would double franchise tag as that would put him at or above jj money for that year.\n\nEdit:spelling",
            "There are loads of cheap WRs available.  Great players are expensive.",
            "Agree. Hopkins would be a cheap option and still good.",
            "The greedy team that’s netted Trent Williams and CMC. Yes, this totally tracks.",
            "Can you give an example of what you’re talking about? I personally want a FO that gets the most out of any trade",
            "You’re kidding right? Half the league would want Aiyuk. This team has the highest paid player at almost every position, certainly more than pretty much any other team you could name.",
            "stay in school nephew",
            "Bro we have the most players that are top 10 paid at their position. The FO ain't greedy. They're trying to get as close to the cap without going over while having enough to pay Purdy next year. Remember, we paid Deebo not knowing what Purdy would be after his injury. And without knowing how healthy CMC could be. And hell we didn't know BA would completely exceed every expectation this year. \n\nI think BA's situation is tough. Money today is worth more than money tomorrow. But I think BA could make JJ money waiting one more year for a deal. We can offload Deebo, pay Purdy, and have more leeway for how BA's contract is loaded. He can easily get more next year, we can give him a long-term deal that will have him making the Pro-Bowl annually, and probably a couple rings.",
            "Lmao they're setting a high asking price because Aiyuk is a star heading into his prime and because keeping him is what's best for a team contending for the superbowl. The rumor is Aiyuk was up for trade off we could get into a position to draft a top talent to make us better. That makes sense for us. Trading him for a 2nd just cause teams don't want to trade a first make the team WORSE. Why the hell would we make a move that makes us worse during this window?",
            "That also gives them enough time to see if Pearsall can fill in enough that we don't *need* BA anymore (as much of a stud as he is). Really not much leverage here, but we also don't want antics to cause locker room drama, which is the only real concern afaik",
            "Is there not an incredible tackle or guard out there we can swap him with and pay them this instead? Still feel that’s the biggest need",
            "What’s funny is they’re generally seeking 2-3 year deals so they can get one more big contract before they start to age out.  I guess the math works out as long as egos don’t get in the way.",
            "100% is not accurate.  If they were able to extend him instead of franchise tag, it would help lower his cap number.  That's what the front office wants",
            "I always understood this. Just don’t like how players are sometimes. You have someone who wants a number, he doesn’t get it and will he perform better? The same? Or less? Hard to tell and even players who do get paid just started declining cause they got the “bag”.",
            "Fans always tout these extreme scenarios but the 9ers have never gone into this territory. They also never would.",
            "A holdout would also not count as an eligible season meaning we'd still have 3 years of control when he decided to play again",
            "I think the niners are fine with that. Let Pearsall and Jennings show what they got. See if Deebo can stay healthy. If Aiyuk balls out they’ll pay him. If not, they got options.",
            "Convince him? His two options are to play for 14 million this next season or sit out and get nothing. If he sits out he'd better hope that the offense is crap with him gone. That would be the only way he'd create any leverage. That's risky for him.",
            "That would be his problem when we don't re-sign him, and his tape speaks for itself. Either he looks like a problem for new teams looking for WRs, or they overpay.",
            "If he has a shit tier year because he decides to half ass it that only hurts him because playing on his 5YO would mean it's a contract year for him heading into free agency. If he's taking plays off then Shanahan can just scheme the ball to other guys.\n\nAiyuk half assing it out of spite honestly hurts him a lot, but I absolutely don't think he would do that.",
            "Brandon? Is that you?",
            "Because no WR is. Market is overvalued right now, like the housing market. Spiked at an insane level and I believe we can find value elsewhere if forced to.\n\nBA’s contract should be in the 24-25 range tops.",
            "I think he means trading away guys. The Niners have yet to trade away any player, besides Buckner, for anything higher than a 5th. And that one time still leaves a sour taste.",
            "I love but ba, but if they wanted to trade him, they would have a draft for an early 2nd. he isn't worth a 1st.",
            "if that's true why haven't they made a trade then?",
            "But he can fight the tag and play less enthusiastically, get less play time, get replaced, hit free agency, end up with the Cardinals or some other random rebuilding team, play a few years at peak, go nowhere, lower his bid, get bounced around the league, hopefully end up in the CFL, and retire looking back at the “good years.”\n\nHe had the high ground after all. \n\nAll joking aside, I like BA but I don’t LOVE BA. If that makes sense.",
            "Also gives them enough time for deebo’s contract to become cuttable without a major dead cap hit, allowing them to choose between deebo and aiyuk without dead cap as a factor.",
            "Yes, the 49ers have the leverage to string Aiyuk along year to year for three years while simultaneously grooming a guy they intend to dump Aiyuk for at their earliest convenience.  So, why should Aiyuk be upset about that?",
            "Agreed 100%.\n\nCMC, Kittle, & Deebo’s unique skill-sets are legit irreplaceable. Nobody else in the league plays like any of those three.\n\nAiyuk is…a great route runner?\n\nGive me a top 10 Tackle/Guard for the next 3 years over BA 10 times out of ten.",
            "You’re comparing apples to oranges.",
            "Well, it is a balancing act.. the player wants to play well so SOMEONE signs him to a contract after.",
            "Imagine if him and his agent somehow didn't know this 💀",
            "Then why not just trade him instead of a year of a disgruntled guy playing below his ceiling that we’re going to let go",
            "Might as well be given how irrationally people here have turned on him just because he wants what he’s worth. Fickle ass fanbase",
            "Hmmm if the top WRs are all moving in that range… might be that they’re worth it.\n\nYall take arbitrary numbers and pass it off as fact. 24-25m is just a random number that makes fans feel comfortable",
            "Even then, why would the team trade away a player for peanuts? They got a solid haul for Buckner, it just so happens that Kinlaw didn’t pan out. They could only afford 1 of their 2 FA D-Lineman and AA played out his contract with solid value.",
            "...because they don't want to? Preference seems to be to keep him and only trade if they can't reach a deal.",
            "Because nothing they'd get in return is worth losing a WR like Aiyuk.",
            "I LOVE BA, but I also understand it's a business and can be cut throat at times. And I'm a 49er fan first, player fan second. If BA wants to make ridiculous demands then that's just too bad and I hope we find someone to take his place.",
            "The problem with BA mailing it in is that he won’t get the money he wants in free agency if he does that. He has to ball out if he wants to get the bag somewhere else.",
            "I agree completely.\n\nI like Aiyuk. He’s a great route runner, and a good blocker. The former is a core trait of his, the latter is 100% because of his current HC.\n\nHow many great route runners are there in the League? 12? 15? 18? More?\n\nIf Aiyuk goes to another team, and no longer has the threat of Shanny putting him in the doghouse for not blocking…do you honestly think he’s going to continue putting in the same effort downfield?\n\nAiyuk is a WR2+ / WR1- and the entire league knows it — including the Niners FO. If you think Aiyuk is elite, then you’re *clearly* new to watching Football.",
            "It goes back to what BA is looking for in the first place - money. Specifically, guaranteed money. SF definitely doesn’t want to go the tag route, since it’s tough to manage around the cap and it wastes trade value. However, BA has no incentive to sandbag his performance under those tag years. All that does is cost him money when he becomes a UFA.",
            "Honestly, if CMC stays healthy and we have a solid rb2 (looking at Mason or Guerendo tbh), keeping BA and trading Deebo to like the Chargers or something (AFC pls, that man holds grudges 😂) would be ideal. My issue is I think BA would feel disrespected by the tag and want to leave :/",
            "A third consecutive franchise left tackle would be the most on-brand thing for the modern Niners besides a thumping linebacker corps, which we already have.",
            "I think you are failing to grasp the salary cap ramifications of franchise tagging him for any number of years.  There is an opportunity cost affixed to that.  Sf knows this. Aiyuks agent knows this.  It's a point of leverage in BAs favor.",
            "Yeah, but you have to take it on a case-by-case basis.\n\nIf a player is going to be a UFA, and isn’t likely to be tagged? This behavior is warranted.\n\nIf they’re in the position Aiyuk is in, it just looks silly.",
            "Because nothing we'd get in return is going to help us win a Super Bowl this year more than having him on the team. Unless it's a star offensive lineman (it wouldn't be). \n\nThe most likely return would be draft picks, and they are not going to be until next year's draft. And the players picked with them likely won't really help until the year after or later when they develop a bit.",
            "And he's be motivated to play well. If his performance goes down so does his future earning potential.",
            "We also didn’t trade away Garoppolo, when everyone expected him to be traded. There was literally a year-long meme over this. We did get a few wins from him when Trey got hurt, but who’s to say Purdy wouldn’t have done the same? That’s an L.\n\nWe didn’t trade away Deebo when now it looks like he isn’t going to live up to his contract. This is looking like an L unless Deebo has a 2021-like season.\n\nNow the question is should we trade away Aiyuk?\n\nIf history is any indicator, we will not trade him, which means we either pay him or he’s holding out.",
            "I fucking love BA but I agree. Homeboy needs to stop thinking he’s untouchable even if on the field he is lol. Bang bang with or without you BA, I’m rooting for you tho",
            "Same.  I want BA on this team but we can’t reset the market for every free agent that’s due for a contract.  It’s the weird part of pro sports.  You want your guys to get paid but the cap means it’s gonna have to be lean somewhere else.",
            "I think this team creates such a warped reality. Aiyuk is a WR1 all day. We don’t see it because he’s behind Deebo and CMC. It’s literally like losing Trey, and Jimmy and seeing Brock come up and be a superstar. Brock is not a third string QB, Josh Johnson is what a 3rd string QB looks like going into a game. Don’t let the fact that we have the most stacked roster in the NFL cloud your perceptive of BA. He’s the all star on any other team.",
            "Nah. Teams know who he is and will know if he’s playing down.",
            "I’m confused. Are you comparing Trey — who will be struggling to earn a UFL roster spot shortly — with Aiyuk?",
            "No. I’m making the claim that him being the 3rd target on the Niners is not indicative that he’s a ‘WR2+’ elsewhere. The point being that our roster being absolutely stacked skews reality for us.",
            "If he was a WR1, he would be target #1.\n\nPoint. Blank. Period.\n\nWhen a wideout’s biggest strength is “route running” followed by “blocking”? That is not a description of a guy who is elite.",
            "You are underestimating being good at route running. Guys like Keenan Allen, Davante Adams, Diggs, Cooper. That’s their main trait. None of them block like Aiyuk does, so that’s a plus for him. \n\nAnd why are we gonna act like he doesn’t have good hands and provide good Yac? I think the better question is besides not being a big body jump ball guy, what doesn’t he do good?"
        ]
    },
    "Impetuous on Instagram: \"@ronnielotthof is up! Who’s next ?#ronnielott #sanfrancisco49ers #impetuous_93comedy\"": {
        "title": "Impetuous on Instagram: \"@ronnielotthof is up! Who’s next ?#ronnielott #sanfrancisco49ers #impetuous_93comedy\"",
        "score": 40,
        "url": "https://www.instagram.com/reel/C8dKlNJPUO6/?igsh=a2p4d2hiYzNsemFm",
        "content": "",
        "num_comments": 4,
        "comments": [
            "I laughed after the fart squeaked out after the hit. 🤣",
            "Holy shit lol",
            "Hit stick, ball hawk, we already did this highlight😭🤣",
            "My favorite part was the ref/coach interaction"
        ]
    },
    "The infamous aborted 1991 rebrand logo—been waiting for YEARS for someone to put this on a hat!": {
        "title": "The infamous aborted 1991 rebrand logo—been waiting for YEARS for someone to put this on a hat!",
        "score": 196,
        "url": "https://www.reddit.com/gallery/1dkwtnj",
        "content": "",
        "num_comments": 44,
        "comments": [
            "This shit was the New Coke of 49ers logos. Complete ass lol.",
            "Yeah that’s effin ugly",
            "On a fashion hat, it’s ok, but keep that shit off the field and uniforms!",
            "I was so bummed that it sold out immediately",
            "Holy shit 😳",
            "I'd wear this",
            "I’ve never heard of this! Holy shit that’s bad.",
            "The Cleveland 49rs",
            "Looks like a news logo on channel 49.",
            "Lmao ayy good to see foos shop at crown minded, them jawns sell out quick",
            "I remember being a kid seeing this and saying wtf",
            "That works very well as a hat design.",
            "Even Texas would have aborted that thing!",
            "Thank god this didn’t happen.",
            "If it comes in a snapback then I'm fucking sold.",
            "I don’t mind it as an alternate, but I don’t want to see uniforms with that logo.",
            "Good grief ...",
            "This should be against the law",
            "Link?  I can’t find it on Fanatics. The only one with that logo I found was [this one.](https://www.fanatics.ca/en/nfl/san-francisco-49ers/san-francisco-49ers-new-era-banger-9fifty-trucker-snapback-hat-white-scarlet/o-1338+t-92597196+p-3533559943153+z-9-3031369688?_ref=p-DLP:m-GRID:i-r19c1:po-58)",
            "I believe that the *random 49ers* Twitter account preserves this logo.",
            "Yep. Tacky is the new cool. \n\nI actually want one.",
            "Supreme Court ruled this abortion legal.",
            "Looks like a Dorito logo.",
            "This looks so terrible, but I also want it.",
            "Burn it",
            "The Doritos font",
            "I remember when they announced this crap I was pissed. It lasted 1 freaking day and they scrapped it. And I remember thinking well ok then. But don’t try that shit again. lol",
            "I like this hat because it instantly makes you look like an idiot",
            "Hell yeah it was. But I still bought the shit out of this hat. Call me a completionist 🤷🏼‍♂️",
            "It should’ve been marketed as a hat to begin with.",
            "149% agree.",
            "Yeah I like the hat, hate the helmet",
            "Exactly!!!!  Let it be an alternate logo for specific marketing material and such.  Not for uniforms and definitely off the field.",
            "Crown Minded always brings them back after a few months. Plus now that they’ve put this logo on a hat, everyone else can too. I’m sure we’ll be seeing a lot more of this logo on stuff.",
            "Google “Crown Minded”. They’re a fitted hat shop out of LA. \n\nThis hat is sold out. But they’ll do it again.",
            "You are a completionist.",
            "If I would’ve seen it in time I’d have bought one too. Sure it’s kinda ugly and tacky but it’s a funny little piece of team history.",
            "Where’d you get it",
            "On a fitted, I don't really mind it. It's kinda cool.",
            "1849% agree",
            "Hear me out. 49ers home against the cowboys halloween weekend and the theme of the game? 90's party with all the throwbacks like unis and logos.",
            "Usually how it goes with the fitted community anyways. Once one boutique uses a new logo, every other boutique uses it as well with a different side patch/color scheme",
            "ah, bummer",
            "Crown Minded. Fitted hat shop in LA. They have a website. This hat is sold out but they’ll make it again."
        ]
    },
    "[Maiocco] The 49ers have signed first-round pick Ricky Pearsall to a four-year, fully-guaranteed contract worth $12.5 million as the No. 31 overall selection.": {
        "title": "[Maiocco] The 49ers have signed first-round pick Ricky Pearsall to a four-year, fully-guaranteed contract worth $12.5 million as the No. 31 overall selection.",
        "score": 451,
        "url": "https://x.com/maiocconbcs/status/1803929850404622728?s=46&t=YmgvrhUmgFBa8QMhulnMPA",
        "content": "",
        "num_comments": 83,
        "comments": [
            "$3.1 million/yr. \n\nProbably 10% of what Aiyuk’s annual salary is about to be. ",
            "Hopefully that is an insane steal, I’d love him to be a big hit",
            "![gif](giphy|YRw676NBrmPeM|downsized)",
            "Pears for all! You love to see it.",
            "So how many brock purdys?",
            "Hopefully he makes the team",
            "Way cheaper than Aiyuk.",
            "Lets fucking go !!!!",
            "That seams real cheap",
            "cupp 2.0",
            "Fully guaranteed doesn't sound normal to me.  Is that standard practice?",
            "He’s going to be OROY - he will have a year like Nacua last year. I don’t think we need Aiyuk tbh. If it means more $ to keep players around Purdy a few more years, including a better O line, I’m for it.",
            "14 gonna ball out",
            "I hope Pearsall becomes a beast with us. If he can pass block like Aiyuk then hold onto them horses. It doesn’t really matter there are arguments for why he would be great opposite Aiyuk and Deebo.",
            "Damn that’s cheap.",
            "So bye bye Ayiuk?",
            "This is how much you should spend on WRs when you have a run first philosophy. How do you have $60m on a WR tandem that's not top 5 with no elite WR1. Spend that money on Center and Tackle.",
            "I know he isn’t exacting a “diamond in the rough”, but I hope this is a another John Lynch magic pick",
            "Let's go! 1 draft pick left to sign? I think? Then let's get BA signed so we can get ready for football.",
            "Aiyuk is gone",
            "12 mill for a wr4 damn that could of been a center or cb . 🤔",
            "Would be",
            "I certainly hope not don't want to overpay for that dude.\n\nMaybe somebody will take him in a trade.",
            "These $ / length of the contract is determined by where he was picked.  They’re all slotted.  The only thing really to negotiate is offset language and some of the non-monetary clauses.",
            "Puka season?",
            "It’s so hard to tell with wide receivers",
            "That's like 3 Brocks if I'm reading this right",
            "Hopefully he doesn’t hold out like Crabtree",
            "Way cheaper than Deebo.",
            "Yeah the rookie wage scale feels more team friendly than ever. Like 1.3-1.4% the team cap space for a late 1st rounder",
            "I think all 1st rounders are fully guaranteed, it's just amount of offsets that get haggled over. ",
            "It's been normal since 2011 with the last CBA",
            "Apparently it *is* the new normal for first rounders as of the last two years, aka when we didn't have a first round pick",
            "Yes",
            "That's a nice thought, but too many mouths to feed and less touches in general since the Shanny offense is more run heavy than the McVay offense.",
            "This contract was happening either way.  It is really up to Aiyuk since he's under contract next season and the FO has made it clear they want him to play here next season.",
            "He was the last to sign.",
            "thats not how it works....",
            "Could + have = could’ve",
            "Yeah he's playing on the 5th year option. Sorry",
            "$31-32 million/yr is his market right now. \n\nA potential trade partner would have to be willing to pay that in addition to giving up assets to acquire him. ",
            "If the 49ers wanted to trade him, he would have been traded before the draft.  All reports have said they'd only trade him if an offer \"Blew them away.\". If he's worth \"Blew them away\" trade compensation, he's worth top 5 money.\n\nThe problem isn't that Aiyuk is demanding more than he's worth.  The problem is that he's worth more than the 49ers want to pay.",
            "The point he was making is hopefully $12.5 million is a steal because he turns into a top receiver. \n\nI think everyone knows rookie contracts are basically predetermined.",
            "> These $ / length of the contract is determined by where he was picked. They’re all slotted.\n\nYes, otherwise known as the Michael Crabtree rule!",
            "That would be awesome, that guy is great and I hate that he’s on the rams.",
            "Hahah....I know you're joking, but guys like Crabtree are why the Players' Union and the owners created the rookie wage scale back in 2011.",
            "We don't know who this child is yet.",
            "Now to see if he’s better than them",
            "It's been normal since 2011 when there was the lockout. All draft pick contracts are fully garunteed I believe.",
            "That’s fair, I do believe it will become more pass happy this year. CMC will end up with my receiving yards than rushing",
            "I don’t think BA is getting a contract he agrees to.  Rickey is his replacement.",
            "Thank you for your hard work",
            "Yep and there are some STUPID owners out there who will pay for a guy with 1 TD catch in 9 playoff games.  hee hee hee.\n\nHopefully OUR owner isn't that stupid but so far... He is.  Man when I think about what this team could look like right now and the rings we would have.... Makes me sick.\n\nDK not Deebo,  Lamb not Kinlaw.  no trade up for Aiyuk get a RT.  Keep DJ Jones.  \n\nPass to set up the run and let CMC and Jusz just destroy teams while they're playing Nickel or Dime against DK, Lamb, Kittle.... Now THAT would have been fun to watch and NOT as agonizing as watching the Santa Clara Field Goals drive down the field, get in the red zone and choke and kick a field goal.... AGAIN.... just like in the Super Bowl.\n\nOh Well.... Maybe someday they'll return to being the Super Bowl Champion San Francisco 49ers.... but not right now.",
            "There’s a guy below who was surprised the contract was fully guaranteed.  I think you’re prob giving ppl too much credit assuming everyone knows they’re slotted. \n\nRe-reading this comment though, you’re probably right, he meant he hopes he becomes a stud.",
            "Won me my first fantasy title in 10 years",
            "Some newer fans won't like this in retrospect but Alex Smith was probably the worst rookie contract in our history.",
            "You’re right, the upside is limitless",
            "Didn’t we say the same about Aiyuk when he was drafted ?",
            "Which is fair because of the low cost to teams and if a player does well it's basically a super cheap contract",
            "It’s all bizzzznesss",
            "I genuinely cannot tell if this is a real opinion or satire. ",
            "This is not madden",
            "Yes that is exactly what I meant (I wasn’t clear though!)",
            "🤝",
            "The contracts are not automatically fully guaranteed though",
            "Well DK is bigger, stronger and faster than Deebo.\n\nLamb is bigger stronger and faster than Aiyuk.\n\nBoth of them have more touchdown catches on offenses that are NOT as good as the Niners in SPITE of the Niners not being a passing team.\n\nKinlaw didn't even get offered a 5th year.... He wasn't an elite level DL at ANY point in his tenure with the Niners.  DJ Jones was actually taking on Double teams and getting pressure up the middle which made Armstead's job easier AND gave better opportunities for Bosa to get sacks.\n\nThey have lost the NFCCG twice and the Super Bowl twice.... and they CLEARLY could have won those games IF they were a WCO.... IF they protected Jimmy G and Purdy.... NO TREY LANCE..... UGH.... THREE 1st round draft picks..... GOOD GOD MAN.\n\nI mean how can you even consider my comments to be satire.\n\nConsider this:\n\nIf the Niners score on their first possession instead of a FG in SB LIV.... AND if they scored a TD instead of FG in the first possession of the 2nd half (after adjustments) they would have been leading by 18 not 10 when they intercepted Mahomes for the 2nd time in the game in the 4th quarter.   They should have won that Super Bowl..... with DK instead of Deebo.  He would have made the difference.... IF they were passing to set up the run.\n\nTHEN you add in Lamb and you think they would have lost the NFCCG to the Rams?  No.... They would have beaten Cincy too.  That's TWO Super Bowls.... both wins for Jimmy G.\n\nAfter that who knows.... but if Purdy did end up replacing him or beating him out in camp.... The Niners would be DOMINANT right now.... and not the old Bills of 90's.... How many Super Bowls did they lose?  4 in a row.  SMH.\n\nImagine this offense.\n\nDK  OLine with a better RT.  Kittle  Lamb\n\nPurdy\n\nCMC , Jusz\n\nPassing to set up the run..... passes in the flat to CMC like they used to do with Craig.... and then faking that and throwing to a WIDE OPEN Jusz on the other side running a wheel route.\n\nI mean COME ON MAN!  York, Shanny, Lynch have FUCKED US out of at least two Super Bowl victories.  AT LEAST TWO!.... probably more.  Dumbasses!",
            "Makes me wish it was. We could probably get rid of some of this dead weight and get some players who can make an impact.",
            "You know there is a difference between the owner and the GM... *right?*\n\nAnd the GM put enough talent on that field to win.  Players didn't execute.  \n\nLynch isn't just playing foosball here.",
            "And LOOK at the down votes from the \"faithful\".... It's sad what has become of the 49er fan base.  Most of you have never even seen the Niners win a Super Bowl.  If they keep going like this you probably won't see one any time soon.",
            "have an upvote, three in fact.",
            "York is a TERRIBLE owner.  Even if you allow Shanny telling him \"We're gonna be a (form) of the WCO.... which they're not.  They are a run to set up the play action team.... EVEN IF you allow that.... At what point do you begin to question the ability of your GM and Coach to draft talented players to make your team better and win Super Bowls?\n\nSolomon Thomas, Rueben Foster, Trey Lance, Javon Kinlaw, Brandon Aiyuk... The ONLY impact player they have drafted in the 1st round is Nick Bosa.... pretty much a no brainer wouldn't you say?  Just look at the ridiculous drafts the Niners have had since those two jackasses have been in charge.\n\nThen you look at the offensive scheme, play calling and clock management of your coach.  HOW DO YOU BEAT THE RAMS 7 TIMES IN A ROW AND THEN LOSE THE NFC CHAMPIONSHIP GAME?????  HOW???\n\nAnd WHY would you have a 2nd string TE trying to block Haason Reddick?  Hmmm?  Talk about NOT protecting your franchise QB.\n\nAnd speaking of Mr. Irrelevant.... Lynch and Shanahan didn't even know what they had with Purdy.  They just GOT LUCKY!!!\n\nSo of course I know the difference between a Bad owner, Bad GM and Bad Coach.  The owner should know more about football.... He should know enough to see that Shanny is NOT running a WCO and never intended to.  Then we he hears that his idiot GM wants to trade THREE 1st round draft picks for the 3rd pick in the draft and (according to sources) they're not even sure which QB they want the most..... AND ALL OF THEM END UP BEING BUSTS... Lance, Fields and Jones.... and even Zach Wilson is a bust too.... It's pretty clear by that point that your GM doesn't know shit either.",
            "You're getting down voted because you are typing what ifs, and sounding like a total jerk.",
            "You couldn't do much more to make it sound like you know nothing about this team.\n\n* Shanahan has never claimed he runs the west coast offense.  For the most part he's always been a wide zone guy here.   They don't run to set up the play-action (that was more a crutch relied on in his early seasons here.\n* Imagine calling All-Pro WR Brandon Aiyuk not an impact player.  Lol.\n* And who cares if you miss on a 1st round pick if you nail the other picks?  They've built a team that has contended for multiple SB titles.  Trying to claim they didn't do good with roster management is pretty silly.\n\n>HOW DO YOU BEAT THE RAMS 7 TIMES IN A ROW AND THEN LOSE THE NFC CHAMPIONSHIP GAME????? HOW???\n\n* By having an awful owner, obviously... /s\n\n>And WHY would you have a 2nd string TE trying to block Haason Reddick? Hmmm? Talk about NOT protecting your franchise QB.\n\n* It's called a pass-blocking specialist.  Every team has them.  Every team runs 2-TE or even 3-TE sets.  And by Brock's own admission he had enough time to get rid of the ball and didn't.\n\n>It's pretty clear by that point that your GM doesn't know shit either.\n\nYup.  Pretty clear that this team hasn't contended for multiple SBs because of their terrible roster.\n\nBut again, not one of those things has anything to do with the owner.",
            "IF I had anything to say about it there is NO WAY I would have let Lynch / Shanny draft Deebo over DK Metcalf.\n\nAlso.... since they would have one Pro Bowl WR.... I would have lobbied for them to get THE OTHER ONE.....  Cee Dee Lamb.  That's who I was hoping for when they drafted Kinlaw.  I was so disappointed.\n\nSo I would have lobbied for a WCO.... If I was the owner I would have said.... it's a passing scheme or I'll hire a different coach.... got it?\n\nSee the problem is that Shanny is playing the wrong scheme.  It LOOKS like it works when you have the whole field to deal with.... but as soon as the field shrinks you don't have the BIG PHYSICAL wide receivers who can get open and make plays in the Red Zone.  This is why they end up kicking Field Goals.\n\nI also would NOT have been in favor of letting DJ Jones go.  He was doing a great job.... better than Kinlaw that's for sure.\n\nAnd I would have NEVER.... EVER let them trade three 1st round picks.  R U INSANE?  That literally NEVER works out.  No matter who you think you're getting.\n\nIf fans want to downvote me for pointing out THE OBVIOUS then it just illustrates how little they know about football.... so I'm okay with it.",
            "And you're a perfect example of why they keep losing... because the fans just accept it and they say well, \"Yeah, we're contending for a Super Bowl championship. We're contending. We keep contending\".\n\nSo the owner doesn't know how to hire a good coach.\nThe GM doesn't know how to select talented players. Especially in the first round.\nAnd the coach doesn't understand that this is a passing league. And he should look to people like Bill Walsh and his philosophy on how to win, rather than be a one dimensional team that gets field goals instead of touchdowns.\n\nBut hey, we're contending for a Super Bowl, contending yeah, contending!!!"
        ]
    }
}