{
    "Please remember to use the report button on rule breaking posts ": {
        "title": "Please remember to use the report button on rule breaking posts ",
        "score": 37,
        "url": "https://www.reddit.com/r/actuallesbians/comments/1d7iz9x/please_remember_to_use_the_report_button_on_rule/",
        "content": "Recently we’ve been getting comments and messages asking us the look into various posts for breaking subreddit rules. The fastest way to bring posts and comments to our attention is to use the report button on the post or comment to mark it for mod review. \n\nWe can’t be everywhere, reading everything so this is a huge help keeping the subreddit safe and open. \n\nThank you! ",
        "num_comments": 2,
        "comments": [
            "this is great"
        ]
    },
    "Selfie Saturday Mega Thread!": {
        "title": "Selfie Saturday Mega Thread!",
        "score": 1,
        "url": "https://www.reddit.com/r/actuallesbians/comments/1dlv581/selfie_saturday_mega_thread/",
        "content": "Welcome to the Selfie Saturday mega thread! This is for all pictures of you. Bathroom mirror selfie? yes please. Professional glamour shots? post 'em. This is for all pictures of yourself, not just regular selfies.\n\n\n\nHow to post a picture:\n\n&#x200B;\n\n1. Go to [https://imgur.com/upload](https://imgur.com/upload)\n\n2. Upload your photo using that form.\n\n3. Copy the URL of the page it creates and paste it into a comment here.\n\n\n\nThis thread will be posted automatically at 9am EST on Saturday, and will be taken down at 9am EST on Sunday.",
        "num_comments": 0,
        "comments": []
    },
    "Just when you think you've thought of everything": {
        "title": "Just when you think you've thought of everything",
        "score": 456,
        "url": "https://i.redd.it/7a3cvekd918d1.jpeg",
        "content": "",
        "num_comments": 2,
        "comments": [
            "Blåhaj ?",
            "🦈???"
        ]
    },
    "men 🙄": {
        "title": "men 🙄",
        "score": 1325,
        "url": "https://i.redd.it/35vps4cm5z7d1.jpeg",
        "content": "did he miss the lesbian heart on my profile? did he actively decide to ignore it and try anyway? or did he just not know what the heart represents? i have no idea. either way, i wish that men would just leave us alone.",
        "num_comments": 109,
        "comments": [
            "The fact that he threw in the caveat that he was a guy shows he knew exactly what he was doing 🙄 Bleh...",
            "you know the bar is low when you’re actually shocked that he just wrote “okay,thanks” instead of trying to pressure you",
            "\"I went through your profile\"   \n-proceeds to try and come onto the person who obviously has the lesbian flag in their pfp-",
            "\"Always shoot your shot.\" Maybe just do that in the shower.",
            "Its like spam emails.  They send out a million messages, and they're hoping they get one person who asks about the Nigerian prince's fortune.  😑🙄",
            "Why do they gotta creep on us instead of just going to the r4r subs smh",
            "> did he miss the lesbian heart on my profile?\n\nGirl horny men who message people like that always play dumb \"just in case\", you could have a big sign saying I AM A LESBIAN pinned on your page and he would still ask. They actually don't care about the person that's not what they're there for.",
            "even though he was polite ab it, it's just so disrespectful and presumptious for him to even ask when he knows you're a lesbian. Like what makes him think he could be the exception?",
            "Sometimes i think these guys get off to just being a creep in the dms becuase what the hell was he expecting?..",
            "This made me cringe so hard, my spine almost crawled out my ass 😳 wtf is wrong with a lot of men these days, like, what happened to hi how are you or my name is? I’m so sorry that happened to ya",
            "A reminder to ignore these messages, and don't post them on the sub. It gives them the attention they crave, while making it harder for us to use the sub for its intended purpose.",
            "I mean, maybe if we stopped giving them the top slot in the subreddit every couple of days, they'd slow their roll some",
            "Guys like him are the reason why as a transgirl I have an even harder time flirting with my fellow lesvians cuz idk but it feels wrong like I know I'm a girl I know I like girls but having been a guy it just seems like it's partly wrong sorry rambling anyfang men who do this are the absolute worst",
            "What an idiot. He knew you were a lesbian and still tried to \"shoot his shot\"",
            "I have a huge déjà vu feeling when I see that username... I'm almost certain someone else has shared a similar experience with him in this Subreddit, or other Lesbian Subreddits I'm in.",
            "The dude just ignored the litteral les flag heart on your avatar like bruhhh",
            "I mean, at least he asked and didn't flip out when being turned down,  could have been much worse",
            "Oh my fucking god, this reminds me of an interaction I had with a guy that messaged me on Reddit after I posted to this subreddit for the first time.\n\nThis dude asked me if I was down to 'sell'. I asked for clarification, and he responded with 'pictures of you haha'. I rejected, and he continued pushing it. He only backed down slightly when I told him i was a minor.\n\nHe then tried casual conversation. \"So when did you realize you were a lesbian?\" or something along those lines. I did not mention anything about being a lesbian in our conversation. Meaning this dude saw my post on this subreddit, and tried to shoot his shot anyway.",
            "Damn I've got one on just like that but instead of accepting my sexuality he posted a shirtless selfie and said \"but I've got long hair\"\n\nWhat the actual fuck.",
            "There are a lot of Pride flags now, so I do not expect everyone to be able to decode them. I certainly can't remember them all. But if he's a dude and spent enough time on your profile to identify your \"vibe\", he knew you were not romantically interested in men.",
            "What is it with all the \"men\" mentioning on this sub lately? Block them. Why are we giving them attention and posting about them? They're so irrelevant",
            "I really recommend we all ignore these the second it’s clear it’s a gross situation. I think a lot of folks get off on the discomfort. Give em nothing.",
            "my bar is so low that I actually like this interaction. dude comes straight (pun intended) to the point and politely fucks off when told no. i had so many people coming into my dms from nowhere (i dont even have pics on my profile) who cant even tell me why they started a chat with me. pretty obviously chasers who write me since I comment things in trans subs. they wanna start a fuckin smalltalk, but dont even have the balls to straightforward answer the simple question \"Why have you started this chat with me specifically? What do you want?\".",
            "🙅‍♀️ men 🙅‍♀️",
            "I have an IT guy on retainer for our business. The last time he was there he came into my office to say hello. Ended up chatting a bit and he told me how his life is falling apart because he's getting divorced. I thought it was weird to share such private and unrelated information. But sometimes people just want to share I guess. Got the real point of his sharing when he asked me THREE TIMES throughout the rest of the conversation whether I'm sure that I'm a lesbian and not maybe \"just\" bisexual.\n\nWtf...\n\nIt was such a weird interaction and I kept feeling like being bisexual is somehow \"better\" in his eyes. Being the socially challenged literal person I am it wasn't until days later that I figured out it had nothing to do with homophobia or biphobia, but that in his mind he would have a chance with me if I would only admit to being bisexual.",
            "As a male, thank you for enlightening me on the heart symbol. I won't try to defend any assholes, but do apologize for their actions.",
            "[deleted]",
            "I mean… at least he stopped when you told him to. As much as it sucks for him to try in the first place I’d consider him stopping when you told him to as a win (at least for me lol).",
            "I appreciate the \"okay thanks\".  Just accept that you're not interested and moved on without being a dick.",
            "Oh no. Is \"I looked through your profile\" the new \"I saw you across the bar.\"? Fuck, that is so much worse.",
            "Could be didn't know. I'm able to wear a lesbian pride bracelet in bigoted spots, and even most of them had no idea what the lesbian pride flag looks like, and they're absolutely obsessed with \"the gay\" . Unless you're in the community, most people don't know.",
            "Another one this week with “ok thanks” \n\nIs it the same guy as 16m",
            "Almost no one knows what the different flags are or what they represent. Also dudes asking to chat like that do it with guys knowingly all the time and don’t consider themselves homosexual. You’re completely in the right for saying no and so is he for accepting it but posting it especially without hiding the guys name is just petty. Like do you really not have anything else going on in your life?",
            "I hate men like this",
            "Well at least he was (moderately) polite about it",
            "I don't know man he asked, gave it a shot, and accepted \"no\". Not exactly scum of the earth.",
            "It’s a man, that’s all that needs to be said 😂",
            "When you've been told all your life that you have to shoot your shot, it doesn't matter what you're aiming at. This person was respectful, even if it was still insensitive.",
            "did he think that i would turn straight for him or something??? i don’t understand men like this. how can they be that stupid?????",
            "\"okay thanks for the offer for the 3 way, can I get her reddit so I can flirt with her as well bbg😋😋😋🥵🥵🥵☺️☺️\"",
            "It’s very telling that every time someone posts one of these the comments are full of “at least he backed off without a fuss” 😞",
            "It's what people like that do. It's fetishisation. For people like this, the fact that we're lesbians is why they go after us.",
            "The ONLY thing I can think is that maybe he's using old reddit like me, where I cannot see any of that. Even clicking Op's profile, all I see are her old comments and posts.\n\n...Which includes posting on lesbian subreddits. It's really not that hard.",
            "Anyone who starts off their flirting by \"I went through your profile\" is desperate as fuck tbh",
            "He's probably a creep for sure, but i dont think too many people know what the lesbian flag is",
            "Pfft 😂🤣",
            "\"You miss all the shots you don't take.\"",
            "\"You miss every shot you don't take\"\n\nWhile true I guess, this guy saw the ring, turned around and threw the ball haphazardly in the opposite direction.",
            "seriously, there's nsfw subreddits for basically everything. Although that didn't stop dudes trying to hit on me on an account only posting only lesbian subreddits.... it's gross",
            "r4r?",
            "They, and I am assuming their lines of thoughts here which is never fun, believe we all should consider ourselves blessed that they would deign to speak with us, that our whole purpose should be to service them. So yeah, we are but objects to be used, for their benefit. /s. Just ABCD's, all the way. Or cats. Can't go wrong with cats.",
            "Yeah this would have been fine if he did not know op was lesbian",
            "That's exactly what they do. They don't view us as people; rather, we are seen as objects and fetishes.",
            "They have been sold Patriarchy and drank the Kool-Aid. Sadly, it hasn't been modified for the end of the cult, yet.",
            "Existed on dating apps before widespread forum usage. There will always be those that see you as a means to their ends and not a person. The concept of, I bought you dinner, thus you owe me sex, did not spawn recently. We, any part of the LGBT+ community, are special options to spice up their life, not people. How could we not do all we can to provide for them and their magnificence? /S.",
            "It has no correlation.",
            "i know you can’t always control how you feel but sweetheart i promise we’re not uncomfy if you chat to us 🫶🏻 your a girl into girls and that means you can chat to all the consenting lesbians you want 🩷",
            "possibly, it wouldn’t shock me bc the dude seems like a creep with little to no respect",
            "im so sorry he did that to you :(",
            "He took the hint and didn't push it. I hate how refreshing I find that.",
            "i appreciate it, but im curious as to why you are on this subreddit as a male",
            "Considering he specifies his gender, he's clearly well aware OP is a lesbian, so I highly doubt your viewpoint.",
            "Do you really believe that?",
            "but if im a lesbian and he is a man, wouldn’t you think it is quite obvious that i would turn him down? why set yourself up for that when you know exactly what will happen? im all for “shooting your shot” but not when the situation will result in obvious rejection or any negativity.",
            "Yeah, he's clearly not the brightest bulb 😆 I think people like that just stalk these subs and try to hit up as many women as possible, hoping someone will say yes.",
            "He either thinks that you are a lesbian but he’s a ✨special little boy✨ (you’ll make an exception for him, right? He’s just a little guy 👉👈🥺)\n\nor he purposely wants to annoy you and that’s the best thing he can come up that’s not just  \n sending unsolicited dick pics",
            "They're not being stupid, they're being antagonistic. They do this because they get enjoyment from annoying you.",
            "He really thought \"if I compliment her, she will turn straight for me\" wtf is that logic",
            "What do you mean? He put in *all that effort* into saying he liked your vibe!! Obviously you should be throwing yourself at his feet in awe!!! (/s)\n\nI swear so many men are either so dumb, so disrespectful, or both.",
            "Best case scenario: He’s an egg who hasn’t figured it out yet.",
            "It’s goddamn testosterone at its worst.  It’s really interesting reading some of the experiences that trans men have when they first start on T.  Some of them complain that they’re just bombarded by sexual imagery the moment anything suggestive enters their field of view.  \n\nFor context, I am a trans woman; I do weekly estrogen injections, and I take an androgen blocker called spironolactone, which can lower testosterone levels in some people.  I cannot describe the relief I feel now, knowing I don’t have to experience that level of testosterone.  I found it torturous.  \n\nSo.  Yeah, he’s a horny dumb dumb.  But it is especially insulting when they like don’t even like think you actually exist and are a person.   It’s the seeing-right-through-you.  So predictable, so yeah,  wth dude",
            "Oh yeah 100% it’s a feature not a bug. It’s gross.",
            "you can't use the chat feature on old reddit tho\n\ni'm using old reddit myself and saw a 6 months old chat when i switched to new once for something",
            "And sometimes, you shoot yourself taking the shot.",
            "It probably has to do with our identity being a porn category. They forget that we're actual people and that you can't/shouldn't just approach us asking for sex =D",
            "Redditor For Redditor. It's a dating sub iirc.",
            "If it the original post was originally found on a sub for dating, hookups, flirting, then yes, I agree. Otherwise, this just feels like gross spam of: \"Send DM's to X women, one will be dumb enough to say yes.\"",
            "You can't prove it either way, but I'm willing to bet some of them are trolling for attention",
            "Thanks I just don't like the idea of making someone feel awkward or harassed mixed with how do I even talk to women I have little to know practice flirting let alon talking to girls as a girl and it feels weird to say anything I would because it's something old me would say and then it feels gross and wring and slightly rude cuz like women and yeah. Women pretty head empty no thoughts",
            "[deleted]",
            "Hey gurl…would you like to see my model train collection?",
            "This is so random, but I keep seeing you on the sub, and as a fellow vampire fan, I just wanted to say I love the tag under your username 😊",
            "happy cake day",
            "There's still a little chat bubble on mine, is it a different chat thing?",
            "it isn't that they forget, they just don't care",
            "Oh ok, thanks",
            "Oh yeah totally I only meant the fact they were upfront about intentions and respect no. The whole situation around it is indeed fucked",
            "They just act like this regardless",
            "i totally understand that and the fact that you care so much about how they feel shows you’re a heartfelt person. you can always strike up a conversation and see where it leads from there! some people would even be happy to let you practice flirt if you reached out or asked! you’ve got plenty of time to learn the ropes 🫶🏻",
            "Oh, you're one of those",
            "Yes please show me",
            "My autism can't resist",
            "Ahhh Cheers to a fellow vampire fan haha! 🧛‍♀️",
            "oh right yeah its there lol never noticed it\n\nbut for some reason it has never shown me a notification if someone messaged me",
            "Yep, not ignorance but systemic malice.",
            "Thanks ill keep that in mind speaking of umm how do women flirt with women exactly because I don't think just glancing at em then getting flustered because she's pretty and going back to my book or phone counts otherwise I'm great at flirting",
            "They're the best! You have to check out Carmilla if you have never heard of it",
            "i’m the worst at flirting 😂 i call them pretty and then make a joke and then throw in some sarcasm that could possibly be an insult 😂",
            "I'm a huge carmilla fan 😄",
            "Wait that's flirting oh fuck how do I make sure my friends don't think I'm flirting with them cuz I do that alot heck to the point one of my friends I jokingly refer to as princess she turns really red and mutters something about stupid knight type girls being to pretty for their own good. But she's just super nice and likes walking close to me I mean she's nice to everyone but not as nice to others",
            "Same here! There is a novel retelling called Carmilla and Laura and I have it on my kindle I need to read it haha",
            "girl she might be a lil into you 🫣 but def ask her if she’s like into you before you go jumping into the water!! you’ll find your rhythm with flirting 🫶🏻",
            "Is it \"Carmilla and Laura\"? I like that one a lot. It stays fairly true to the original but makes the relationship clearer. And it's written by a Sapphic author 😁",
            "But she can do a trillion times better and even mentioned she liked some girl who was to dense to realize she was being flirted with butbwouldnt saybwho when I asked and just changed the topic to weekend plans and wanting to know if I wanted to go get coffee.",
            "Yes it's that one! I am so excited to read it",
            "bestie ur the dense girl 😂 def ask her if she’s interested in you (if you’re into her too) and see what’s up bc there’s something going on between you two 😌"
        ]
    },
    "Is my nails lesbian coded?": {
        "title": "Is my nails lesbian coded?",
        "score": 508,
        "url": "https://i.redd.it/bfgnajn3n08d1.jpeg",
        "content": "Hello, is my nails lesbian coded? Let me what y’all think? I don’t want to be tooo obvious 🤪",
        "num_comments": 33,
        "comments": [
            "Girl atp it's not a code it's the whole damn computer",
            "Just smile and slide hair behind ur ear that's a easy tell tale sign for me .. no need for code .. you are already gorgeous",
            "Absolutely!\n\nMy brain whenever pink and orange are near each other: \"girls 🥺\"",
            "Oh yah I'd definitely see that. Idk if straight people would though.",
            "if i saw u irl with those nails id probably think they were intentional :D\n\nalso they're really pretty :3",
            "Nice nails, but what I'm really wondering is how you took this picture?",
            "yes",
            "What colours of polish??",
            "Omg they are so cute!! 💅🌸🩷🧡",
            "Almost... At least two of them are a little too long. :p",
            "I think it's cute and will come across to a good number of lesbians, but not be too obvious.",
            "I can tell by those cat scratches and marks on your hands darling.",
            "only thing you could do to make them more lesbian is to cut two of them",
            "It's not a code when everyone knows what they mean!",
            "yeees",
            "You like kissing fingernails don’t you",
            "lol 😊 nobody knows this is lesbian flag",
            "Thanks 🥰",
            "Hehe thanks 😊",
            "My mom didn’t see through lol",
            "Thanksssd",
            "iPhone camera timer",
            "Precisely my thoughts, but still lost my coffee...",
            "Lesbians do 😘",
            "Did u ever approach someone directly before ?",
            "Did you hold it with your mouth though??",
            "No",
            "No selfie stick with blue tooth remote",
            "What holds u back ?",
            "Ohhh ok thanks! Mystery solved.",
            "I’m not interested in relationships yet. Still healing",
            "Ah all the best , i really hope u feel better soon",
            "Thank you 😊"
        ]
    }
}