{
    "Thinking Critically and Open-Mindedly about the Nazca Mummies": {
        "title": "Thinking Critically and Open-Mindedly about the Nazca Mummies",
        "score": 245,
        "url": "https://www.youtube.com/watch?v=FlNjET011Q8",
        "content": "",
        "num_comments": 42,
        "comments": [
            "**New? Check out our [Wiki](https://alien.wiki) and come say hello in our [Discord](https://discord.gg/UjtRzg6V3g).**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AlienBodies) if you have any questions or concerns.*",
            "This was a great talk. If you have not been following along this would be a pretty good place to start. When he talks about the greater implications of this discovery and the impact this has had on him it really resonated with me. This is a story that needs told and I’m so happy he was brave enough to put this out there.",
            "I was just coming here to see if this was posted after watching it. It is excellent and worth. Awatch for anyone, beginner or veteran.",
            "this needs to be passed along it was really good!",
            "For anybody stumbling on this weeks after it was posted: this is outstanding and you should watch both of his videos on the subject. While I disagree with a few things he says, his thinking is clear and organized, and the case he builds is both compelling and fun AF to watch. He's just a great presenter.\n\nWhat a tremendous benefit to the community, to have a philosopher thinking and speaking openly about the process of investigation and discovery.",
            "67k /r/AlienBodies subscribers\n\n4.7k YouTube views\n\nThat's not even 10%\n\nI suspect Google/YouTube is meddling with the view count \n\nPeople tend to pay more attention to things with higher view counts",
            "I don't usually pay much attention to stickies.\n\nBut oh my god, this talk was amazing. Absolutely worth the watch.",
            "Excellent video, thanks for sharing. \n\nLooking forward to the April 4th reveal from Peru.",
            "Give that man a raise",
            "Actually a really fun and convincing watch",
            "Good video. We need more discussion. With Frankensteining I think he also missed out that the bones are hollow. So you can’t just use human bones. You’d have to hollow them out.   \n\nHe got the UAP disclosure act bit wrong though. The review board didn’t make it into law. Just the National archives part. ",
            "This is the video i go to when i tell my friends about this now. It is all put together so nicely",
            "whoa...  this video was amazing.  i had assumed they were just modern day 'fiji mermaids' until watching this. I'm officially a believer now.",
            "Logical and well presented.",
            "at first, I was pretty convinced, but the way the upper limbs attach to the thorax is a little suspicious.  There’s no room for lungs…. and not enough torso mass to hold up the arm structure.",
            "I’ve watched Dr. Brown's lecture twice in full, and I've sent it to family and friends. I know most people in this sub “get it” and understand, undeniably at this point, we’ve been visited. Some of you may have had personal experiences, and now there is validation. There really are other, advanced beings from somewhere that have been visiting Earth. But isn’t it fucking nuts how — outside of those affected by war, famine, and all the other bad this-worldly things — this discovery isn’t at the very front of every human being’s consciousness?",
            "they'll never admit it because they can't see it in themselves—materialists always think they're the *only* truly objective skeptics—but \"you can't believe anything cool\" is all most of the shallow rationalism you see on this sub reduces down to  \nedit: predicting we're soon to see attacks on this lecturer's background/credentials and maybe rumors of something in his personal life that will prejudice people against taking him seriously.",
            "If they are not from this world should their bones be made of the same stuff as our bones?  They may have dna because of  **panspermia**  but  does that limit them to bones made of calcium? and skin made of  **Keratin** ?",
            "There was this post about an ama on 4chan and one of the responses mentioned how when the crashed UFOs are recovered they used to find manned ones but more recently they find AI driven ones. I have a few questions but can't find the post anymore ( it was suggested but now its missing... aliens! 😲)\n1. The person stated the deep sea carrier technology was far more advanced than our. So why are we able to recover anything from a crash site? Shouldn't these things be moving at such high speeds that all evidence of what they are is destroyed?\n2. Why would a society that has been capable of fight for millennia only recently come up with using machines to man their aircraft, basically around the same time that humans did this?\n3. They sent planes and a sub to the Bermuda triangle - they claim the plane crashed but the sub returned. But they also claim that all electronics get fucked when approaching. Why didn't the sub get lost as well? I'd expect it to shut down and either all oxygen gets used up or it sinks",
            "This was an interesting talk about the mummies but god damn son, when you realize your idea is lame as fuck there's still time to back out, don't double down on it.... the part about making the alien doll just came across condescending to anyone watching IMO and it was a shit idea anyways. We're not children.\n\nThat could have been explained in a few words instead of a 20 minute drawn out \"look at me I'm so quirky, fun and smart\" performance.",
            "If anyone’s interested, he was just interviewed on “That UFO Podcast”. Really good talk.",
            "Since there's a lot of variation in design between some of the Nazca mummies, what kind of engineering is that(doesn't match the advanced capability of the craft we see)? Do you guys think the Nazca Beings were creating hybrids or was something else creating a hybrid of us/nazca beings?",
            "nice",
            "Holy shit I think he’s right. Very good video and excellent interview on That UFO pod… wonderful speaker, smart dude, alright f- it, I’m in !",
            "I need to watch it after work but anybody that opens with “think critically” usually doesn’t. It’s usually a catch all defense for when a person is in fact, thinking quite densely.",
            "Dude, thats normal for youtube",
            "Just keep sharing the link with anyone you think will watch it.",
            "31k now.  Not what it deserves but 6x in 2 months isn't bad.",
            "I think that also might go back to the convergent evolution thing.",
            "Keep in mind they may be intraterrestrials.",
            "1. grusch & others have talked abt the possibility that crashes might be intentional. like this video said: if NHI are actually not human, it is naïve to assume any of the motives WE might assume for “crashes” might apply. Moreover, the same post from 4chan said crafts were built to spec, for specific purposes - so once said purpose is complete, it seems as if they are indifferent as to what happens to it. \n\nit is a bit unfair to apply human reasoning to intrinsically non-human things. \n\n2. this assumes way too much about NHI having motivations similar to humans. for all we know, “they” could have 300 different categories of missions, with 300 different kinds of piloting material based on different protocols. moreover, the 4chan guy was talking about a UAP base in the Bermuda triangle, and repeatedly said he didn’t know if there were more…. very possible there are many (dozens?) of other bases with other kinds of UAPs / ships / etc at their disposal. \n\n3. i mean, if that’s your complaint with his post, go for it… we have no idea from the extremely scant details how said operation was planned, how it unfolded, etc. perhaps something underwater would have better chances than planes? perhaps the radius for what “messes up electronics” is subject to other variables we don’t understand? valid complaint ig but it wasn’t a crucial part of his argument.",
            "Guy is a philosopher professor, his audience are philosophy students.  He's not trying not to get deep into the weeds - be it anatomy, genetics, morphology -  just simply that extraordinary conclusions require extraordinary proof and the 'best' Nazca mummies present something both exceptionally strange and exceptionally difficult to explain in conventional terms.  \n  \n  \nHis point wasn't to replicate DIY Stan Winston's creature shop (granted: the sorts of people who could give a proper University-level discussion on how to construct such a thing) but to suggest that even a 'practical effects' type doll would require a level of extortionary effort to pass thru an extremely sensitive machine like a CRT that would easily spot bits of glue, sawed bone etc.\n\n  \nFrankly - I do agree the doll stuff could be presented a bit better - and in fairness I think it's why he saves some of his strongest ammo til the end with the Nazca/Paracas lines and the Japanese Jomon Pottery.",
            "Could be like an eusocial species with specialized variants, breeders, workers, fighters etc",
            "I mean the number of ribs could be something that changes over time with age. Like a tridactyl version of tree rings.",
            "the irony of this statement is just too much for me haha",
            "It wasn't that it wasn't presented well enough, it could have been explained in a few slides. And there have been some x rays that were highly suspicious of the hands from what I remember. The older they were in terms of being \"discovered\" the more it looked like someone was constructing the hands. That's what I remember but that's a totally different discussion. \n\nNobody in that room seemed excited at that point, they all got real quiet and were probably thinking the same thing I was. It is obvious that hoaxing a body that can be CT scanned and researched isn't easy. He didn't need to show that with little toys.",
            "How? Most people I hear say “think critically” are just using that as a catch al defense. I’m not saying the information in this video is right or wrong just that I hate that phrase. It’s used all the time when people have no real argument and say “you just need to think critically man” because saying that automatically means you have a huge brain that the other person couldn’t possibly comprehend. It’s a baseless lazy argument.",
            "sure, it can be a \"conversation stoppers\" or \"thought-terminating cliché.\" i think those are the terms you're looking for. but obviously titling a philosophy lecture like this is appropriate and its over an hour long so it's not just \"google it man\"",
            "I’ve heard people talk for hours straight about nonsense before and when you point out any logic flaws you ge the “just think critically man” but I get what you mean"
        ]
    },
    "Skinny Bob": {
        "title": "Skinny Bob",
        "score": 294,
        "url": "https://www.reddit.com/gallery/1dks8yu",
        "content": "",
        "num_comments": 166,
        "comments": [
            "**New? Watch this [video](https://www.youtube.com/watch?v=FlNjET011Q8), read our [FAQ](https://alien.wiki/Frequently_Asked_Questions) and drop by the [Discord](https://discord.gg/UjtRzg6V3g).**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AlienBodies) if you have any questions or concerns.*",
            "Not gonna lie. Skinny Bob looks pretty hip. Seems like a chill cat",
            "https://skinnybob.info\n\nhttps://www.reddit.com/r/SkinnyBob/",
            "Skinny Bob sold me fent behind Wendy’s",
            "Richard Doty (who most write off as a liar due to the Bennowitz situation) recently said this video was real. He also said he saw the video from the Varghina incident and said the entities made strange animal like sounds and were very distressed as our environment was toxic for them. Whether people believe him or not there is absolutely no doubt he had the security clearance and family background to have access to all of this information and more.",
            "Thinking about the post from u/apusloggy earlier, Skinny Bob looks most like the “hybrid” species.",
            "Weird Bumble profile but ok",
            "Skinny Bob really stepped out of the 4th dimension, walked up to the nearest earth thrift store, and said, \"Give me your best turtle neck blouse.\"",
            "Skinny Bob got a big ass dome piece",
            "The original skinny Bob video is slowed down a little bit, I believe you have to speed it up a tiny bit to see their real movements. I also heard somewhere that this is a female specimen, not a male. I have also read that given the date this was originally released they would have had to use some very impressive animatronics to get the details. Like when they scanned from bottom to top you can see individual fingers moving around very smoothly, if you play with the brightness you can see it has an eye that is a lot smaller than the larger Shadow you see. \n\nOne of the few videos of another species that has yet to be disproven, this could very well be a genuine video of an alien species right in front of our face.\n\nTo get more Comfort we would require some official source to back this video up of course. Or to Simply have more video leak of the exact same specimen",
            "Skinny Bob definitely has connections.",
            "Real.",
            "As time goes on and CGI improves it becomes clearer and clearer that its CGI. They have film degradation effects but also the weird smooth zooming etc you'd get from modern cameras. People always add the zoomy out.of focus thing to make it look more real but its so ubiquitous in fakes that it now is just a giveaway that it's fake\n\nBTW I'm a hardcore believer. Believe in the mummies\n And the Russian body of the buddy\n But my vfx experience won't let.me see skinny Bob as real as all I can see are fingerprints of it being animated",
            "And how exactly did Skinny Bob pulled on or off his blouse?",
            "Trydactil? III or not?",
            "We never knew who created this",
            "i’ve always been a believer but this one is clearly cgi, don’t know how anyone can think this is real",
            "Awww he’s kind of cute",
            "Cgi proven ??",
            "He looks like the depictions from Jacque valles book passport to magonia",
            "Boomers love skinny bob.",
            "Remmy",
            "That mf Bob still hasn’t paid the oz he owes me",
            "Boi",
            "I didn’t know Skinny dresses like Steve Jobs",
            "I wanna see 'Barb' or female version. Is there such a thing ?!!!",
            "Skinny Bob? More like slim thicc bob",
            "AI?",
            "https://preview.redd.it/z14gfd6lyy7d1.png?width=625&format=png&auto=webp&s=5ebb549f8a3896f21daa25d268425702908a1277",
            "Dude looks chill as fuck. Id smoke a joint with this guy.",
            "How did he get the polo neck over his massive head?\nI bet his dad was pissed after Bob came along.",
            "And people say a.i came out in 2020",
            "Dat Boi Skinny B",
            "Steve Jobs from the future ya’ll",
            "Dude plays space piccolo at mos eisley",
            "Shout out to skinny bob!",
            "So cute and precious ❤️",
            "Poorly made cgi",
            "Can I ask a question… how did they get the turtleneck on?",
            "His suit isn't skin tight though...",
            "Seems like he would need a lot more neck muscles to hold that head up. I wore a neck brace for 6 weeks after surgery and could barely hold mine up after taking it off.",
            "He came to earth to get himself a gold chain to complete the look!",
            "It's very easy to see that the skinny Bob videos are computer graphics.",
            "That turtle neck is pretty decent.",
            "Seriously, just a few pics?  Any insight or fucking anything",
            "I was pretty in on Skinny B. for awhile, but the film grain is pretty much proven to be lifted from somewhere else. It's 99% conclusive fake imo. Happy to be proven wrong as always though.",
            "skinny bob is so obvouisly fake even the black and white film has the trying to look vintage fake to it. sorry just my opinion, no i havent delved into the debunks yet",
            "I know this is going to be viewed negatively, so I apologize in advae, but it's actually kind of mindblowing to me that people can look at these videos and not recognize it as CGI. This is often brought up along with other videos as like definitive proof of alien life, and it's almost laughable when compared to stuff like the Victor alien interview, or the tridactyl body in Siberia. I truly do not understand how this has held on for so long with the UFO community because it is just so obviously on its face fake. The movements, the eyelids blinking, it all is clearly a CGI model of some kind. I want to believe in this stuff, and I really do try to keep an open mind, but I'll never understand why people cling to this Skinny Bob stuff so hard. It just makes you lose credibility when you can't see through an obvious hoax.",
            "Low key sexy right?",
            "Just need his album to drop",
            "His cousin, Cheddar Bob ain’t tho",
            "It's brilliantly done but this is CGI.",
            "His brother skinny pete sells the blue stuff.",
            "He has some good molly’s too bruh",
            "Obligatory \"Ma'am this is a Wendy's\" comment",
            "The Bennowitz situation was unfortunate but most government employees would've done the same, what they are told.",
            "The skinny bob videos are 100% CGI and I can promise you that.  Not because any insider knowledge but because of 10 years + working in the animation industry.\n\nI'm a huge believer, and I love the skinny bob videos but I'm certain they aren't real.",
            "Creatures from Varginha probably crashed without their protective suits.\n\nHence why their skin looked darker, seemed to be blistering and they were secreting a foul ammonia/sulphur smelling substance.\n\nThe doctor who examined one of the creatures said that by the time it got to the hospital, its face was swollen and it seemed to be having a very severe allergic reaction and struggled to breathe. Multiple witnesses reported that the creatures seemed to be in extreme distress, even the children witnesses could sense it.\n\nThe doctor also said that at first, he thought the creature was a common underground dwelling species of animal. Only after the news broke, did he learn that it was supposed to have been an \"ET\".\n\nThe greys were made to naturally inhabit the deep, deep underground so that they can sustain themselves and operate out of our sights. The underground of that area in Brazil is one of their hot spots.\n\nThey allegedly make buzzing sounds, that sounds similar to when a mosquito is flying close to our ears.",
            "Turtle necks seem to be pretty common ET fashion from what I've gathered",
            "Skinny Bob side eye (pic#3)",
            "Not gonna lie it freaks me the fuck out. Uncanny valley but that’s not quite the right term. It just makes me uneasy and if I saw it in real life I would pee a little.",
            "This is one characteristic that needs to be noted. If you look at the one picture where it seems like the head is too large to be supported by the neck and there is a large indentation where neck muscle and blood vein barely support the head, it would seem that if skinny Bob were real he or she would be a mutation or a manipulation of a species. It would seem that the cranium weight is intrinsically too much for the neck to  support and it bulges and recesses with the effort. This might be seen as evidence of genetic manipulation. This apparent anomaly is suspect in and of itself because if it were a fake being produced the authors would avoid such telling factors.",
            "There is a zip, adjust the shadow, brightness etc, it’s visable",
            "That’s what I’m wondering too. It looks like it could be 3 but it’s hard to tell",
            "There's a handprint. 4 digits. [https://skinnybob.info/](https://skinnybob.info/)",
            "Nope",
            "No they love pulling the ladder up after they blew all your inheritance. Then dont understand why your not down with a christo fascist death cult",
            "This was out way before ai",
            "If this is an alien species we are discussing, then we don't know their anatomy. For all we know it could be a lot of tendons that hold the head upright, it could be that the muscles are more dense or utilize a different cellular structure for more strength than ours, just as a chimpanzee have extremely dense muscles that are significantly stronger than ours. It could be that these are biological beings crafted specifically for travel through space , maybe they are from a lower gravity planet, maybe their bone structure is lighter, maybe whatever organ is up in their head is lighter than ours.\n\n​​ there are a multitude of reasons as to why they are the way they are, comparing another species Anatomy to ours without knowing a single thing about their species is a bit short-sighted",
            "Oh is it \"very easy\", please do explain",
            "Yes it is computer graphics though. \n\nWhen the 'alien' blinks, it's obvious it's cgi. I say this because the crease of his brow, the shadow, gets moved along with his eye lid. This is a sign of bad texture mapping with not so great rigging of the skin. You can see this blink on the video at the 33-34 second mark. It's so evident. It means they drew the shadow of the eyelid, and it's getting stretched with the blink animation. \n\nYou also can't say aliens, it's alien. Their brows shouldn't be moving along with the blink, regardless. \n\nThe suits are described as being skin tight for all abductees and even government documents. This creature's suit isn't. Their arms aren't that chunky either. I know this because I saw ones forearm. They are not thick. \n\nPlus, the reason why they slowed it down, is because it looks so computer generated if they run it at a normal speed. Put the video to 1.5+ speed, and you'll see how generated it is. \n\nThe shoulder when he lifts his arm, drops down the moment his arm lifts, and it's pushed forward. It's like his shoulder dislocates. This is a mistake that can happen in rigging. It's a rig. \n\nNot just that, but his hands as the camera pans up, that's the most basic animation to show a character is 'breathing'. It's an idle animation.",
            "I can't believe anyone is genuinely fooled by it, its garbage and clearly fake",
            "Yeah right? Mf is handsome.",
            "There’s a whole ass subreddit for skinny bob. Pretty sure it’s r/skinnybob",
            "Look up skinny bob on youtube there's full on video",
            "Here’s some insight. I gifted you a name now do your own research kiddo.",
            "Fixin to get those cheeks clapped",
            "I like his smirk. He is cute",
            "Cool. Can you provide proof?",
            "Underrated comment",
            "Don't go crazy with that. Those 4 hour erections are painful.",
            "Must be nice, the fent turned out to be baby powder",
            "That’s what Doty said, he followed orders",
            "Other people in the industry with far more experience than you disagree, so here we are. I will go with Doty’s opinion for now because of his security clearance. He could be wrong though but for now I’m going with his opinion and the opinions of the others who say that level of CGI was too expensive to make back then",
            "To me it's very obvious that it's CGI as well.",
            "After working in the the animation industry for only 10 years you consider yourself a pro to claim with 100% certainty that the videos are CGI? What skinny bob videos are you referring to? Because I'm only familiar with one...",
            "It is so incredibly obvious.",
            "without question, they are cgi",
            "If skinny Bob mama had to give birth to him through a vaginal canal she probably didn’t make it.",
            "The neck is connected to the middle of the skull. Not in the back like us. This helps with balancing I'm guessing.",
            "There's a handprint. 4 digits. [https://skinnybob.info/](https://skinnybob.info/)",
            "The consistency between shots for character design would be impressive even with modern generative design. Cool hoax? Anonymous creepy pasta?",
            "The movements are completely computer animated. I don't know why some people can't see this. I'm a believer that it's possible there are real videos going around but this is definitely not one.",
            "Thank you. I don't really think the clothes or anything it's wearing proves much, but yes, you can easily see this is CGI. I don't understand how some people can't see it. It's obvious as hell",
            "I understand if you believe it for a second. But after close inspection it's very obvious what it really is.",
            "If you get bored, take a look at picture 5, does one arm look longer than the other?",
            "Yeah, I’m familiar with skinny bob, just thought this was an extremely low effort post that didn’t add any discussion or at least info for those interested",
            "I’m seeing a bob Dylanesque poet.  10/10 would respond to bob on bumble",
            "😏",
            "I remember reading the static on the video matches whatever template is used on the video editing software. Like how the mh370 abduction video has a standard ink blot effect in it. ",
            "Well to me it's very obviously real",
            "10 years is enough to spot the obvious tells.  You don't even need to be in the industry, the tells should be obvious and it's Maddening to me that it isn't obvious to everyone.\n\nThere are 2 videos.  One where he's just standing there, and another where him and a few others are walking from a ship.",
            "Explain the texture stretching and model clipping of the eys lol",
            "Thanks!",
            "Please show more details - last I heard there's a life changing amount of money on a bounty to prove with programs",
            "[deleted]",
            "Prove it no one else could. mick west will give you a blowy if you succeed",
            "Down down down down down.....woooohoooo! I'll tell you once more before i down vote your score, you're going down.",
            "I dunno, if it’s real, footage is hella old and not from an era where CGI is readily available, nor capable. It looks more from the era of costumes and make-up, and all the shots are careful as to not give a reference for scale, so I’m inclined to believe kid in a costume.\n\nBut I also wouldn’t so definitively write it off as you have here.\n\nI do not see, like at all, what you are describing.",
            "While I agree with you to some extent that this aliens footage isn't legit, aliens are robotic. I guess that's why finding legit evidence is hard. \n\nThe one I saw was robotic too. They are emotionless. That's just saying Zuckerberg isn't real. Lol! \n\nSo if an alien looks robotic or like they are a computer, it's very much on par with sightings.",
            "**Skin Cells**\n\n\nThe gray looks so grey and alien today.\n\nSeen some things but cannot say.\n\nFrom a mostly a grand and dander lot.\n\nBorn of sickness and then dismay.\n\nThe Grey looks so gray and alien today.    \n\n\n\nRIP Skinny Bob",
            "inb4 \"yeah, the sound was added afterwards! and yeah! the film grain was proven to be from video editing software, but its totally legit!!!11!1\"",
            "I also worked for over 10 years in CGI and I can't see any signs of CGI, definitely not anything that would make me say I'm 100% certain it's fake like you are. \nThat's why I'm sceptic of your claims, how can you be so certain? Why don't you make a post pointing to these proofs you claim to see because \"trust me bro\" doesn't get you too far these days.",
            "\"obvious tells\", can't provide one example.",
            "Explain it? It's an alien. It looks different than we do.",
            "Grab a source for that and I might believe it.",
            "That is so false it's not even funny. I can see with my own eyes it's a computer animation 100%. You're just seeing what you want to see. Skinny Bob is nothing but a hoax. It would be very easy to make the video back then because it came out in 2011. It is not from the 40s. I'm sorry but that's the way it is.\n\nEdit: I'm totally open to looking at any sources on this panel of CGI experts",
            "It's hilarious that you can't just tell from watching the movements in the video but someone pointed out the eyes blinking and the shadow on the eye lids moved with them. That should do it if you actually look for it. The problem is you want it to be real so you're not going to look hard enough even though you should just be able to tell from it's movement.",
            "The problem is, the people down voting me are actually the wrong ones",
            "Do you seriously not think people can do things to videos to  make them look older than they are? That's not the point though. His movements are like a computer animation which probably means, it's a freaking computer animation. You believe what you want",
            "This is why finding legit evidence is hard. People don't want to actually be skeptical. The movements are 100% computer animations. \n\nLike another commenter pointed out, the shadow on the eye lids moves with it's eye when it blinks which is a very big red flag when it comes to CGI.",
            "RIP my panties 🌊🌊🌊\n\nI ❤️ folk-emoboi Bob",
            "Why is it so unbelievable that standard film effects were added after?  It’s a perfect way to introduce plausible deniability",
            "If you read the link above, it explains that people here on Reddit found the film grain effect which was used.",
            "Yeah like 5 people said that and not one offerd anything backing up claim lol",
            "Texture stretching of the eye lids and 3d model clipping of the eyes , do you need red circles and arrows pointing it out for you?",
            "Well I can actually, it's hard to describe, it's easier to show.\n\nThe biggest give away for me was eye lid movement.  There's some serious frame-rate miss matching and it shows the most in head movement and eye lid movement.\n\nIt's been a while since I watched the video but I'm pretty sure I remember seeing frame blending which is a feature in adobe after effects",
            "You're joking right\n\nYou first then I'll go",
            "I don't think you understand what he means when he says texture stretching and model clipping.\n\nIt has nothing to do with what an alien does or doesn't look like.\n\nIt has to do with technology or skill limitations on 3D modeling.",
            "[https://skinnybob.info/](https://skinnybob.info/) scroll to the end",
            "[deleted]",
            "Ive seen really good analysis videos. People who are more expert than you or i dont agree with you. I have no skin in whether or not its real im a truth seeker. Its just that your counter argument is weak sauce if your so right prove and collect prize money and internet points until then your word is as good as any other joe smoe with no evidence",
            "I began my adult life with a career in multimedia production. I am aware of the capabilities.\n\nI wouldn’t so definitively dismiss it, as you have.\n\nThat’s it, lol\n\nI will, in fact, believe what I want",
            "That commenter was meeeeee 🥲\n\nYes, it is very hard to find legit evidence. \n\nThere's another video of an alien on the floor a man supposedly hurt, and video taped. Many said it looked like a paper puppet. I find that one to be legit. I know most don't. His initial video of filming the craft, you can hear him in a state of panic. This heightened emotional response isn't easy to replicate, not even trained actors can get it. In order for that to occur, you would have to be in a state of shock/adrenaline. I have had that response myself, when I was faced with the reality of losing my father. It was a PTSD response.",
            "lol well now.\n\n**The Alienation of Mister E.**\n\nThe Alienation of Mister E.\n\ngone awhile while still asleep.\n\nNow when he looks about a bit,\n\nhe has very little to do with it.\n\nHis talk is soft and he seems to say,\n\nall the things that aren’t that way.\n\nHe walks around but it leaves no trace,\n\non the ground or across his face.\n\nIt’s like his ship has left it’s cove.\n\nAnd sunk down deep or is high above.",
            "Why even leak it if you (ivan) want to deny it?",
            "How do I show you digital artifacts via text?  I'd have to make an entire YouTube video break down.\n\n-texture stretching\n-model clipping\n-frame miss matching\n-frame interpolation \n\nThese are all artifacts clearly visible in the skinny bob video.\n\nIt's not my fault you can't see them.",
            "Unironically, that would be awesome.",
            "Occam's Razor - the simplest explanation is usually the closest to truth. The simplest explanation here is: it's an alien. It doesn't look like humans.",
            "But that's an *assumption* that it's CGI.",
            "It wasn't too expensive or difficult in 2011. They made it look old with effects. If you have a source showing the experts opinions I'd be very happy to look at them",
            "I don't even think it looks questionable at all. It's very obviously a computer animation made around 2011, when it came out online. It's not \"so well done we can't tell the difference\". \n\nWhat makes you think it might not be CG?",
            "I'm very sorry to hear that. I'll check out the link and give you my opinion if you want. \n\nBut the skinny bob video seems to be computer graphics",
            "Are you cranking out beautiful verses while going about your day?!",
            "That's how disinfo works.  You add in some fake shit into a real story / image / whatever, and then when it leaks (or you leak it yourself), you just point out all the \"flaws\" that you put in there and nobody would ever believe it.",
            "Gimmi monay and i will lol",
            "You're not even using it correctly that is not the simplest explanation and you're ignoring the eyelid texture stretching and you're ignoring eyeball clipping through the eyelids I don't even understand what you mean by explain when you can read the words and understand them",
            "How is alien a simpler explanation than CGI?",
            "No, they are clues that it's CGI.\n\nIf you want clues that point in one direction or the other, they are clues that point to CGI.  Pretty glaring ones.\n\nI'm not a sceptic of the topic.  My grandpa says he saw an alien and I believe him, but the skinny bob videos, I'm not on board with them. \n\nYou are welcome to disagree.  But imo there's more pointing to CGI then genuine footage.",
            "[deleted]",
            "Did you even read my first comment lol?\n\nEdit: you ever watch film from the early 1900s? it’s all shot with low frame rate and looks glitchy/robotic.",
            "I don't know what the video was called at all. So I can't help you with the name. \n\nKeep in mind, the alien does look fake, but certainly not CGI. There are signs that it isn't fake though. Aliens are also just too emotionless, it's hard to tell what's real and what's fabricated. But that video is the only one where I genuinely have seen the emotional impact of what was witnessed. \n\nThis video in the post is certainly fake though. It's so painfully obvious. I feel you.",
            "lol no just trying to help you out with your Bob fantasy as I had a couple somewhat appropriate themed poems on hand.",
            "No problem, here is a recipe for monay, comes highly recommended. \n\n\nhttps://www.kawalingpinoy.com/monay/",
            "You're comparing alien body parts to humans'.",
            "The video was first released in 2011, but the original video is clearly much older. Video quality used to be like the photo. It's taken over 100 years to get clear video and photo clarity, and it had to start somewhere.",
            "I know all about the Nazca mummies and have been watching this subject for decades. I'm just saying the skinny Bob video is an obvious fake and I don't want to give credit to a fake video.",
            "There are filter for that in Adobe after effects",
            "It's very different from old films. It moves like a computer animation. Not like old movies. Filters like the graininess are very easy for people to use to make videos look like they're older than they are.",
            "No kidding they are both beautiful!  I play guitar and if you give your blessing I would love to put a little melody to them!",
            "Good effort",
            "You got to be trolling",
            "> but the original video is clearly much older.\n\nOr it's digital manipulation to make it look older, which was technologically possible in 2011. Just saying.",
            "Yep, and about a hundred other programs before “after effects” was even a thing.\n\nSimply said that I’d be more inclined to believe tangible props are involved over digital, and that part I find actually impressive in its own right."
        ]
    },
    "John McDowell investigation updates ": {
        "title": "John McDowell investigation updates ",
        "score": 19,
        "url": "https://www.reddit.com/r/AlienBodies/comments/1dl5rwg/john_mcdowell_investigation_updates/",
        "content": "I was just wondering if there have been any updates on john mcdowell Nazca mummy analysis? And where is the best place to receive them? ",
        "num_comments": 4,
        "comments": [
            "**New? Watch this [video](https://www.youtube.com/watch?v=FlNjET011Q8), read our [FAQ](https://alien.wiki/Frequently_Asked_Questions) and drop by the [Discord](https://discord.gg/UjtRzg6V3g).**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AlienBodies) if you have any questions or concerns.*",
            "His son posted several updates on his law firm's website: https://mcdowellfirm.com/category/nazca-mummies/\n\nI haven't seen any official quotes from John McDowell in a while.",
            "Thanks...I know Ross Coulhart tweeted he would be doing a sit-down interview with him soon...but no details.",
            "Ah, I didn't know that. I know Ross came to the States recently for a UAP conference, so it's possible he sat down with him during the trip. Time will tell..."
        ]
    },
    "Deep dive into three NHI species": {
        "title": "Deep dive into three NHI species",
        "score": 728,
        "url": "https://www.reddit.com/gallery/1dkhm22",
        "content": "\nI’ve put together a series of images that draw comparisons between events which I find intriguing. \nI am using footage of potential NHI, Nazca specimens images/scans and artistic reconstructions.\n\nI’ve looked into four videos which I haven’t sufficiently seen disproven.\n\nI am using three categories taken from the official Nazca website, which are ‘reptilian’, ‘insectoid’ and ‘hybrid’. \n\nTall Reptilian:\nThe being looks to be approximately 7 foot. It can be seen blinking and gasping. Has severe head injury. Mostly covered wearing loose black clothing.\n\nVideo here: https://www.youtube.com/watch?v=kxy-k7CZYKc&list=PL3ztC_6JCilju0lWbpJxrgbA-DndGrEE0&index=1\n\nSmall Reptilian:\nFilmed in Russia, the being appears approximately 3 foot. Leg and arm missing, dead.\nVideo here: https://youtu.be/zwWWjqA8kIk?si=wbeE1GOA6w5Nh4iD\n\nInsectoid:\nCaught in fishing net. Dead. It appears to have a metallic implant on one of its arms.\n\nVideo here: https://www.youtube.com/watch?v=p8-GQ4AWaf8\n\nHybrid:\nShows an interview type setting. Being seems to be struggling to breathe. It is then attended to by military medics. \n\nVideo here, unfortunately I can’t find the original: \nhttps://www.youtube.com/watch?v=TvamS6X5l2I\n\n\nFeel free to share! ",
        "num_comments": 143,
        "comments": [
            "**New? Watch this [video](https://www.youtube.com/watch?v=FlNjET011Q8), read our [FAQ](https://alien.wiki/Frequently_Asked_Questions) and drop by the [Discord](https://discord.gg/UjtRzg6V3g).**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AlienBodies) if you have any questions or concerns.*",
            "Credit for the effort, very realistic.",
            "The one from the alien interview is spot on. Incredible work!",
            "Wow I think you absolutely cracked it with that comparison of the hybrid and NHI from the interview. It's uncanny.\n\nSo we at least have a very good idea of what the \"reptile\"-like and hybrid beings look like now!",
            "Excellent work man. I love that you used the reed and “victor” footage to overlay. Tbh I think Victor, the Canadian “alien”, and the Mexican “alien” caught in a photo are Grays from outer space, but who knows anymore. Theres an obvious cover up, so…way too many high quality photos and videos at this point, not to mention physical bodies of the same type of entities",
            "This is fantastic! Great job OP! I never saw the comparison of the sea net NHI which was an eye opener.",
            "Love tying the peru buddies to the rest of the lore.",
            "Amazing!",
            "Yes! They showed the insect guy!",
            "Mate thanks so much for the effort you’ve gone through truely remarkable, I feel like it’s all unravelling now, looking forward to your posts in the future.",
            "Fascinating. Thank you for sharing your research.",
            "interesting.",
            "Awesome research. Thank you!",
            "Imagine meeting one of these somehow. How creepy would that be? I wonder what it would feel like. I wonder how they communicate",
            "Dope. Slide number 9 and hybrid eyes squinting. Source of that?",
            "Since the buddies are all thousands of years old this post would imply that these creatures have been around AND are STILL around in modern times. \n\nNot that I don’t believe in the possibility that these things might exist, but how the hell did tptb keep this a secret for so many millennia? \n\nAnd where the hell are they hiding?",
            "Nukarri does look similar to the fishing net video but I don't think that is a true insectoid in the fishing net. It is lacking the bulbous structure on the abdomen and the legs on Nukarri appear to be angled upwards in their 'default' position. The being in the fishing net looks like its leg just happens to be bent and the other leg is going straight down. Also maybe I am missing something but I don't see any wings in the fishing net video. It might be genetically related though, like a cross between an insectoid and a gray perhaps. Here is a comparison of Nukarri to an alleged insectoid being seen in the Berkshire UFO incident in 1969, to give an idea of how their anatomy might work when they are less dried out.\n\nhttps://preview.redd.it/m67526uyxt7d1.png?width=2152&format=png&auto=webp&s=ee73dff5ad15fa99698a3ede52ef8c6c8b3e834f",
            "Bottom left looks like Buddy chillen with Victor in the interview.",
            "Very nice.   Certainly helpful.  This is most likely our visitors.",
            "Amazing work and it’s makes a lot sense this just connected all the points to my research",
            "When was the alien caught in the fishing net? First time I've seen this one.",
            "What is interesting about one video, the alien pretty much said we are dense. I have dealt with people who are slow, marginally average with an agenda. They are very difficult to deal with and to convince otherwise.\nI can’t imagine someone who is telling a true story but the interviewer is dense and the truth collides with their preset constructs…this is why I believe at least this  or similar conversation took place.",
            "I'm so glad I'm high right now because this is exactly the kind of shit I love.",
            "This is stellar level of comparison. Sir, you are awesome human ❤️🙏",
            "Amazing infographics dude. Thanks!!",
            "Really awesome. Thank you for sharing",
            "I like it",
            "This is amazing 👍💯",
            "Great comparison of current and previously captured footage and photos.",
            "Thanks for putting this together",
            "I don’t see Lionel Messi on here /s",
            "Appreciate the work put into this. Well done.",
            "Great job!",
            "wild times we live in",
            "The first thing I thought about when seeing the 3 fingers was the Dr. Reed video where he has the latex gloves on showing the 3 fingers next to the beings hand. I also wonder how the Boyd Bushman NHI photos compare or don’t compare with the Nazca buddies. I believe Boyd Bushman’s photographs are real because someone literally did the same layering effect with his photos and it literally showed the NHI blinking. The fake Kmart doll did not have eyes that could be manipulated. Somebody messed up in the shill art department…lol.",
            "That hybrid is scary, good post.",
            "The fishing net one and the alien in the black suit on a Mylar blanket = gotta be real",
            "Congrats on your skill! 🙏",
            "Brilliant post, thank you!!!!",
            "I love this thank you for the hard work!",
            "Awesome job !!!!",
            "If they’re from underground, then lenses would be needed to deal with too much light. Especially if they had naturally big eyes",
            "Thank you for your time and effort OP!  I can't wait to dig in after work!",
            "Thanks for sharing. The \"lens\" may be a keratonized form of the nictitating membrane of a reptile. If ants were also involved in their evolution as the eye shape and wings imply this makes sense. The agnothia present is also consistent with such an extremely disparate hybrid. It seems like we have a hybrid swarm of humans, ant people and non-avian reptile people.",
            "A+",
            "This is gold. Yeah, grays have lenses, they don't have big eyes, they are contact lenses. Makes sense",
            "They are lenses? Wow",
            "Brilliant investigative work and very grateful for you taking the time and to put this together. Also grateful i am alive at this point to witness this unveiling. I think you just brought footage even i thought were questionable into a place i can see my own judgements questioned. 🙏",
            "[removed]",
            "They're here and they've been here for a very long time. It makes sense why they're cryptic or don't want to be seen. For them to potentially interact with us on a species to species scale would most likely lead to war. They've studied us for centuries abd figure we're just violent animals. We kill each other for differences in ideas, religion, the color of our skin. Makes you wonder what the hell they've been up to this whole time.",
            "Do u have a YouTube channel",
            "Does someone have a link to the info about the fishing net specimen? I am not familiar with that one. Thanks. 😊",
            "Great work, and having just seen the post with photos of skinny bob that does look like a hybrid one doesn't it?  All a bit weird when you think about it",
            "Which photo/video is the alien face that says \"you can see the squinting behind the lens when the light shone in is face?\" from?",
            "I think the insectoid matches another video possibly too. \n\nI don’t know how to find it off hand but it’s filmed in South America or Central America I think. It’s a short clip barely showing the creature before it is shot and then dogs attack. ",
            "What’s the story with the fishing net",
            "So that’s what a reptilian and insectoid look like?",
            "Impressive dive sir",
            "The Interview alien and Hybrid mummies don't look the same. Hybrids have mostly human skulls, human jaws, noses. Montserrat is a great example. The interview alien has a wide skull, much different than the elongated hybrid mummy skulls. I can see the rest of the species comparisons you made, great work!",
            "Was the ''fishing net'' alien not debunked as from a movie set or something ?",
            "This is well put together and interesting to say the least.\n\nMy only concern is that crop circle.. that's fake for sure!",
            "What is this \"footage\" you speak of?!",
            "Bkmk",
            "They’re just slamming their fist on the puzzle 🧩 making it fit with the potential  hybrids footage 🤣",
            "Fake",
            "None of this is real, suckers",
            "Nimrod",
            "If these are the aliens that are supposed to invade earth,  I think we’ll be alright. Inbreed looking as mother fuckers",
            "Hilarious that you have all these confirmed species when none of them have been proven to exist",
            "It’s not simular. It’s similar. Hard to believe if simple words are misspelled. Even my iPad corrected simular to similar.",
            "That one always gave me deeply unsettling vibes, like you could feel the pain.",
            "Whuch video? Can you share link?",
            "I thought that one was debunked as a very good prop from a special effects artist? I’m not coming and spreading misinformation, I remember watching a video on it. It looks just like it tho",
            "Kind of looks like the hybrids backcrossed to the reptiles to produce the tall reptillians? Note the rounded skull on the extant specimens.",
            "I know it’s not your intent but calling it lore seems like it could downplay the potential significance of independently repeatable observations, which is a cornerstone of scientific progress.\n\nWord choice is important here because “lore” could be all it takes for an open-minded skeptic to brush this off as just more internet trolling or SCP-style collaborative storytelling.",
            "What’s the origin of the insect guy? I don’t remember this story?",
            "honesstly im horned up by hybrid,,, sooooooo hot",
            "Commom trope that the big eye is actually a lense.",
            "Ikr, I have the same questions!",
            "There were 16x less people on Earth, easier to hide from us. Less chance of people seeing them. More space for them to occupy. ",
            "Thanks for posting this, I’ve always heard of the idea of an insectoid but never an actual image.",
            "Great post - super interesting.  Where is that insectoid image from?  I can't find anything like that online related to the Berkshire UFO incident.",
            "Thanks! Not that it matters but I’m a woman 😅",
            "Exactly. Living underground would create a need for larger eyes! ",
            "That’s my current line of thought too!",
            "Beauty is in the eye of the buddy 😍",
            "Don't kink shame please",
            "Nope!",
            "From the alien interview, in the description it includes the video under the hybrid category. \n\nThough the original video is almost impossible to find so I could only link a doco which tries to disprove it, as that’s all that’s left.",
            "Here’s another angle with a translation of the code:\n\nhttps://preview.redd.it/mxg0tkoa3u7d1.png?width=1318&format=png&auto=webp&s=693144be0cd4950f8b0c27c3b0892f386d15c52f",
            "It’s certainly not “fake for sure”. That circle is incredibly interesting: encoded binary, which translates to English. Appeared overnight and is geometrically perfect. The crops were woven together, not stomped down.",
            "Included links in description",
            "That's how uh any discovery is made.   Go back to playing wow.  You don't have anything worth adding.",
            "Hilarious to think there so many religions in this world yet.. (just using your dummy logic friend) i 100% believe in god",
            "Dyslexia is common in artists.. spellings a weak point for me, doesn’t invalidate anything, no need to be rude.",
            "Just so that you are aware, \"Simular\" is a word also.\nAlthough it's been shelved for quite some time (as an archaic word), people do still choose to use it.\n\nIt is commonly used in circumstances instead of \"Similar\" on purpose and also accidentally of course.\n\nSimular depicts things that have similarities as a result of simulation. \nPurpose made replications, counterfeit, imitation etc.",
            "It wasn’t debunked, they had a special effect guys talk about how it could potentially be made. I work in that field professionally and know very well how something like that would be made. At first I admittedly thought it looked fake but I gave it a chance and looked into it further, the neck movement seemed the most unnatural since it’s jn the centre of the skull - but that is consistent with the Nazca specimen. The questions I have are, why put the time, man power and tens of thousands of dollars into materials and labour for a prop just to have actors play out this scene and then try to delete the video from the internet (apart from a doco trying to disprove it). Why is it’s proportions so similar to the Nazca hybrid. Why give it googles etc.",
            "Here's where it started when I saw this video. From other things I've read, they found them in a fishing net in Cherry lake in Siberia. (Yeah I know!) I'm mildly obsessed with finding out more about this one. The fact that they have wings is 🤯\n\nhttps://youtu.be/p8-GQ4AWaf8?si=KEB_biZcqMA_ifpf\n\nI want to know how op knew where to look for the wings and implants. What happened to their \"hands\" and \"feet\"? Scavengers? How tall is this sectoidbro?\n\nEdit: cranberry lake*",
            "Trope or hypothesis?",
            "Btw I just peeped that you’re the same guy from the other posts on here making connections. You’re doing gods work. Also “Alberto” is definitely the Siberian buddy. No question.",
            "True. So it wouldn’t even be far fetched for them to have stayed hidden this whole time. 🤨",
            "I just did a deep dive into that incident. JFC",
            "In this video around 8 minute mark [https://youtu.be/aJ2yCjjBd8s](https://youtu.be/aJ2yCjjBd8s)",
            "Miss you are awesome 😎",
            "LMAO",
            "Not to mention the radioactive signature given off by the crop circle",
            "Thanks, I'll look it up.\nAm very surprised not to be aware of this one..\nSounds interesting.\nThe giant face is what made me think nah.",
            "Not to be rude but the Alien interview footage from the 90's is fake.  It is obviously a puppet and its really strange several comments specifically highlight the fake puppet out of all this evidence is some of the highest upvoted comments?   You know what the best thing to do in a medical emergency for not being able to breathe?  Keeping all the lights off so you can't properly assess the situation.   That room is dark to hide that it is a puppet.",
            "Aliens are your god?",
            "Simular is an outdated (archaic) word meaning “one who simulates” or “counterfeit.” It’s a mispronunciation of the word similar. It is an “eggcorn” for the word similar.",
            "Thanks for the good reply. I am no expert in effects and props so I always look at the monetary aspect of things too. Props and art aren’t cheap! Also if it were a prop I am sure it would have been claimed by an artists, and put in a portfolio. Even for the camera man or actors too. I am going to look into that interview video a little more!",
            "I think it's real too, but I totally understand how people think it's fake!\n\nMost people don't have any sort of frame of reference for how an alien should look/move.\n\nThe more details that come out (like the vertebral column positioning), it makes more and more sense. \n\nAt a certain point, the amount of knowledge and effort it would have required to make a fake video seems less likely than it being genuine.",
            "I recall a special FX commentator specifically point out the armpit fold of the medic alien doesnt resemble a fake alien…something very specific FX creators struggle with, the arm attachment and armpit particularly.  That he or she was persuaded the alien subject in the alien interview being worked on by medics…must be the real deal. \n\nAlong with subtle eyelid, eyebrow and expressive mouth movements like dismay, etc. could not be replicated by FX with sufficient authenticity of a living being.",
            "That is something i’ve always used as an argument, and people just go “for the money”.\n\nI mean, of course, but if your stunt goes to shit (which it will, real or not real), thenrest of your life is compromised.\n\nYou’re not gonna get any job, you won’t be taken seriously, if not married, you’re unmarriable.\n\nIt’s a lose-lose situation, but people are so focused on “the money”.",
            "Downvoted for asking a sincere question is a perfect example of the true reason so many believe 100% in the video:\n\n\nI WANT BELIEVE IT ALIEMS. 100% CONFIRMAROONIED BOIS WE DID IT",
            "Thanks! Glad you appreciate it, the more I look into these the more connections I seem to find it’s very interesting.",
            "There are also many cultures who have stories about them, so they haven’t stayed completely hidden!",
            "\"It's a puppet because it's obviously a puppet and my source is the upvoted youtube comments\" - very compelling argument here.",
            "The logical arguments are sound but not supported by any form of independently verifiable objective evidence. \n\nKeep in mind that people were adamant the platypus was taxidermy for years too, because “look at it with your eyes”, no mammal can lay eggs, or have so many other unusual and previously undocumented traits.\n\nNow seeing that footage compared directly against other specimens supports more directly that this may be a reality, based on independently repeated observations of physiology.\n\nWhat if they move like puppets? People think sloths move in unnatural patterns/rhythm, and some animals have evolved even detrimental forma of locomotion. \n\nCalling something fake without objective proof is no different than making a bizarre claim without proof. One person may present bizarre evidence that has literally no grounds for comparison because it may be a true scientific first. The presenters of the platypus had literal bodies, intact biological specimens, but that wasn’t enough for many skeptics until years later when it became a common scientific consensus. However, scientific consensus regarding animals that are far from humans ontological understanding of our own species are easier to update, whereas archaeological and scientific dogma about humanity’s origins are much harder for us to reconcile with.",
            "No",
            "Great no worries, let me know if you find anything interesting!",
            "> Most people don't have any sort of frame of reference for how an alien should look/move\n\nLiterally nobody does. I seriously doubt they look damn near the same as us lol",
            "Great points couldn’t agree more! That’s very interesting about the armpits.",
            "When can you clearly see the armpit? Isn’t it mainly just its head in the video? I can kinda see the shoulder when they bring in the lights but not enough to see the fold of the armpit I don’t think.",
            "You just have to look at it with your eyes my guy.  It has no mouth and doesn't at all blink.   Those are arguably the best Doctors the black government can buy and that's all they can do  to save them?   Think dude.",
            "I still am adamant it is fake by the fact that there isn't anything in this picture that screams deep black military budget with endless resources.  There aren't any expensive cutting edge medical equipment anywhere to be seen besides some retro scanners they could pick up at any thrift store.   I admit the puppet does have a mouth after rewatching it but this is some serious low ball effort.",
            "I remember seeing a guy react to the victor interview footage in a video; I forget who the guy was and what documentary it was in, but he was like 60-70 years old and had a ponytail...\n\nAnyway, the guy was just absolutely horrified iirc. He was like \"They're treating [the being] like an animal.\" I got the impression he thought it was real based on previous experience. \n\nHundreds of thousands of people have reported being abducted! It's a proportionally small number of people (assuming they're not lying), but it would seem to be significant.\n\nEdit: found the video. It's around the 48 minute mark https://youtu.be/TvamS6X5l2I?si=D2J1Smkx010pk7lC",
            "A seemingly small detail…but apparently puppeteers struggle with that -  an average viewer would not readily notice.  So…a small but consequential detail, in that instance.",
            "\nYes - might only be just the head / tip of shoulder we see…so far.  The armpit may or may not be visible in the chopped up  clips circulating currently in the “Alien Interview” making the rounds, I haven’t seen the clip lately but its on YouTube.  \n\nIf I can find the clip soon I will edit the post here.  I did see a longer version of the interview, but dang it could never find it again…there was even another setting or room and one alien of the same caramel color was lying down…maybe two in same room but cant quite recall…\n\nI think a documentary is being made about it.  \n\nApparently the entire video (recording)  was reviewed for authentication or if a hoax…by special FX folks in film industry and that was the comment made that FX folks viewing the subject are persuaded as to the authenticity for minor but important (!) things like expression of mouth, eyebrow shift, armpit folds - just to be clear that is what I am referring to.",
            "There is a lot of context to the video which addresses your points, which is Victor's testimony in the documentary as well as an Art Bell interview. If the room is kept dark for the being's comfort as Victor claims, why would they suddenly turn on all the lights while it is in distress? Why would we expect aliens to blink? \n\nVictor described the medical care of these beings as \"a dog and pony show\" since they inevitably die and there is virtually nothing that can be done. According to Victor, \"The medical staff are chosen more for their ability to keep secrets than their expertise.\" Also you can clearly see the mouth while it is gasping during the seizure so I am not sure why you are saying it has no mouth.",
            "I would argue video evidence of a nonhuman entity like this would be the “screams black military budget” component, to be fair.\n\nThis could be a temporary field office deployed in proximity to a crash retrieval, not some underground state of the art facility. It could also be decades old which would further preclude advanced medical or forensic tech.\n\nFurthermore, if UAP events are treated primarily as perceived threats from foreign adversaries as the Pentagon tries to emphasize, it would not be a stretch to imagine US military doctors treating the subject roughly/awkwardly if they considered it to be a potential enemy combatant.\n\nYou seem to be taking more of a denialist approach than a skeptical one here. It is at least clear you are using denialist tactics by outright asserting what it is (puppet), and using circumstantial evidence (not seeing advanced medical equipment), as a stand in for any actual substantive evidence. \n\nOn the other hand, I would suggest that additional footage and now physical remains of more specimens matching the exact description would further support the claims that these entities are real and observed elsewhere. The fact that these observations have been repeated doesn’t seem to factor in to your analysis at all. \n\nIf this is fake, wouldn’t they consider the exact elements you are describing to make it seem believable? What benefit is there to making fake footage that also clearly looks fake? I suppose I don’t see a viable motive that aligns with your opinions on this video.\n\nEdit: corrected verb tense",
            "Hey, does anyone have a link to the alien interview? I can’t seem to find it. Thanks !",
            "You know what is great for light sensitive extraterrestrial beings?  Shoving an extremely bright flashlight within centimeters of their eye.  As if that is going to tell them anything.  You're doing a lot of hand waving to want to believe this obvious puppet.  Whoever this person is that leaked it is a liar and hoaxer.",
            "Never once does the alien move its hands or suggest that it has capabilities to move on its own.  For something having a medical emergency it certainly looks pretty chill.  Firstly I am not a denialist, I was one of the first to be onboard with the nazca mummies after looking at CT Dicom scans, even when r/ufo's where blatantly making fun of everyone who even suggested it could possibly be real, so don't go there dude.  This is an obvious fake and if you can't tell yourself than you are far too gullible.  Everyone is making lengthly posts replies and doing extreme handwaving over this.  I  shouldn't have replied in the first place because its like telling conservatives they are out of line, they just won't listen.",
            "https://youtu.be/03KyoueMHN8?si=2-Uvq-sHmz1XmklZ\n\nHere’s one I found quickly (I haven’t watched it but it’s a breadcrumb for you at least).",
            "If you said it has no mouth you must have skimmed through the documentary, watched the beginning of the tape and somehow missed the most interesting part. That or you have very bad visual comprehension. \n\nThe flashlight is to check for hemmorhaging around the eye sockets. It's dying on the spot so the doctors had to cause some discomfort to \"provide medical treatment\". That is not an uncommon concept in medicine. They just happened to use flashlights instead of turning on the lights because this was not recorded for the purpose of proving the alien is real to average joe. The target audience would not be concerned with that.",
            "Thanks so much my friend. All seems very shadow banned !",
            "Look, I have seen this clip in 90s late night ufo specials a dozen times.  It is you who has the deceptive vision and gullible at that for believing this puppet to be an NHI.  Good day sir.",
            "What are your thoughts on everything else OP put together in this post?"
        ]
    },
    "Göbekli Tepe. Pillar 74: a humanoid-looking being that resembles a tridactyl reptile-humanoid specimen found in Nazca": {
        "title": "Göbekli Tepe. Pillar 74: a humanoid-looking being that resembles a tridactyl reptile-humanoid specimen found in Nazca",
        "score": 201,
        "url": "https://www.researchgate.net/figure/Goebekli-Tepe-Pillar-74-C-DAI-1-3-4-photos-N-Becker-2-photo-S-Matzerath_fig5_372604281",
        "content": "",
        "num_comments": 44,
        "comments": [
            "**New? Watch this [video](https://www.youtube.com/watch?v=FlNjET011Q8), read our [FAQ](https://alien.wiki/Frequently_Asked_Questions) and drop by the [Discord](https://discord.gg/UjtRzg6V3g).**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AlienBodies) if you have any questions or concerns.*",
            "At first I thought, eh that’s just a depiction of a human but then I saw the shoulders and weird chest and now I get what you’re seeing",
            "Amazing find!",
            "It’s so fucking disgusting that they won’t excavate more. Literally only 5% has been excavated. The WEF bought the site and then paved over much of the buried sites.  It’s obviously a cover up and everyone should know about it. It’s hard to wrap your head around how evil it is to suppress history and reality. Any excuse short of “NHI will destroy us if we release the truth to the masses” is a crime against humanity, not exaggerating.",
            "I think they found an old book a lot older than they want us to know about, and a lot more complete of a version. That’s why they won’t dig.",
            "I wonder why they don't live together now.. something must have happened",
            "Wow",
            "well holy fuck",
            "The shoulders are interesting. They make the connection for me.",
            "Gobleki Tepe is believed to be 11.500 years old. The nazca lines are made between 500 bc and 500 ac",
            "Makes sense. I mean, when we started going back in time, we were of course perceived as gods. Of technology, expressed in ancient ways, kinda looks like an alien to your current era of understanding.",
            "Nice work man! This humanoid looks not like a depiction of a Homo Sapiens. More like the other artifacts from the Nazca and other regions.\n\nhttps://preview.redd.it/at3470axvx7d1.jpeg?width=750&format=pjpg&auto=webp&s=b30f0fb8af791e4535ab079b392c5ee42ffe3722",
            "There is a great video from the Bright Insight youtube channel about the Gobekli Tepe. How there is a involvement of WEF and the strange decision to NOT excavate more. Also planting trees, which roots could damage the site below. Basically a CRIME for fuck sake. Weird shit going on.",
            "Yup, or it could just be something done by someone who just wasn't very good at carving a person. So it is either a tridactyl reptile-humanoid specimen, or just a carving of someone done by someone who wasn't very good at drawing. Which makes more sense?",
            "Holy shit",
            "Really grasping at straws these days lol",
            "Unless everything we know about art in general is to be rewritten, it takes a society time before they have artists snd craftsmen skilled enough snd studied enough to do accurate representational works of art. Our brains automatically abstract images that we try to picture and draw. Some even consider stylistic abstraction as a superior form of art. Egypt for instance when through phases with stylization. \n\nPoint being, it is far more likely this is a very skilled craftsman’s stylistic interpretation of himself or other humans than that of an alien. Despite the sub I’m on I think if there are no other carving to represent humans on site then it is likely representing a human. I’ve seen hundreds,of drawings by humans of humans that look more like a stick figure than a fleshed out human being. \n\nThat all being said, it is always nice to see that weird mummy thing snd this was fun lol",
            "probably why they stopped excavations and are leaving it for 'future generations'.",
            "Wow more evidence of qbsolutely nothing, thanks this sub is the best!",
            "Looks exactly like an earth person. You think maybe human beings stacked all these f****** rocks? Spooky",
            "Dude. That’s Santa man. Been here since before alien exists",
            "also the neck looks kind of similar",
            "I don't think this is the idea at all In fact I think unfortunately the truth of disclosure much goes deeper in the control tactics probably used on ancient man back in the day. Theologically speaking they do represent the stories of ancient gods and many creation stories. This is most likely false narrations made by these beings who understood that the easiest way to manipulate man is to weaponize their belief system. Prove to them that they are gods so they will willingly sacrifice and give themselves to us. \n\nI think it goes much deeper with the fact that we have to most likely destroy any belief structures we have about religion because they were most likely created and utilized against the ancient population long ago to create a long established psychological operation. I mean even if you look at the Sumerian translations it says right in their story that the gods' say before cataclysm 'God will surely punish us for what we have done' \n\nThe stories remain the same, the phenomena is identical to what it was in ancient times with limited interactions as it messes up the project/experiment. This is also demonstrated with the ancient past as too much interaction can be a bad thing . I would better describe us as  they probably look at us like cattle. \n\nThis is the nitty gritty side of disclosure. The original appearance of these advanced intelligences were most likely out of manipulation and using us.\n\n But yin and yang with bad there has to be some good.",
            "I don't think it's a cover up. I think it's simply more greedy people leveraging their status to gain control of something good. First, step is to cheapen it into a caricature of its former self, then you try to turn it into some novelty cash cow. \n\nThough, I will say a counter to my argument and something that could favor your's is the actual build itself. The structure  looks pitiful. Like bare minimum planning. The concrete walkway covers the entire inner wall all the way around so you could only even see the columns in the middle really. It just looks bad. I mean how much money could something that ugly even generate?\n\nThey also used a backhoe to tear up parts of the ruins that haven't been excavated yet to lay concrete for the road. It all seems very hasty work so idk they could be hiding something 🤷",
            "Any source to this or just speculation? \nI definitely think they're scared to dig up these ancient sites because that means the current official timeline regarding human civilizatio is wrong",
            "They would still have to translate a dead language. Not saying it's impossible but it's a huge hurdle.",
            "Well let's just say I believe the phenomena was nearly identical before. Perhaps they were a little too involved and they realized that it really ontologically messes with the natural progression of society. This is an observable situation their hand in our world is most likely for their own benefit. Perhaps this is why the sacrifice stories reach across the globe. What's the easiest way to control the population around you especially if you are a highly advanced civilization and need to use the walking incubators around you?  obviously weaponize religion to your advantage because what person would say no to their God? In fact they made the ideas of sacrifices seem Noble and honorable. Very mischievous if you ask me. \n\nI don't think they ever 'lived with us' In fact it probably is exactly how we see it today. Just much less involved in the development of society. It would be better to describe it as they are interested in Earth and the genetic properties that Earth's animals have.",
            "The tridactyl reptile humanoid specimen!",
            "Ligma",
            "Yeah I see all those and it’s a good match. For me to be more convinced i need to know if humans are depicted differently? Or is this the only humanoid there? If the latter it’s hard to say it’s not just meant to be a human. ",
            "*False*.\nI having their dirty plan, I shall telling from atop my crackpot:\n\n• Moon is mobile mega-structure. \n\n• Built by beings 3.25 ft or 1.08 yard tall.\n\n• They rank as 1.5 on the Kardeshev scale.\n\nEarth is orchard, countless cycle:\n\n• Magnetic field no working greater than 80% during magnetic pole shift.\n\n•Shrimps taking advantage when this time.\n\n•Sun go gonna *fetus deletus* on Earth every few thousand year.\n\n•Ultra Violet helping the mutate DNA and improve rate of speciation.\n\n\n**lituhL peePuhL** no liking the surface dwellers or Sol:\n\n•Use their stoopid egg ship to occult Sols light soon.\n\n•Wait until 2052 for tetrads and eclipses for playing with our religions.\n\n•Increasing of coronal mass ejections and flares best opportunity.\n\n•Tiny tempers power up engines in Moon for orbital change.\n\n•They extending far away to mediation point between Earth and Sun now and becoming magnetic 'island'.\n\n•C.M.E. and flare now flow to 'island' and then Earth. Massive magnetic flux portal opening.\n\n•Sun go *Skra-ta-ta*  and all energy funneling to Earth via island.  \n\n•ParticuL bombardment changing viscousity index of mantle and adding of kinetic energy.  Make magnetic field weaker.\n\n•Without Moon proximity, Earth lose Tidal Bulge and do [This](https://youtu.be/1n-HMSCDYtM?si=LrzXRMKRvROM0Ljd) bc of assymetric mass. \n\n•Earth torque 90°\n\n•Mega Tsunamis a mile high traveling speed of sound begin one direction. \n\n•Earth flipping back and Little people bring back moon for tidal bulge restoration.  \n\n•Mega Tsunamis go back other direction half speed.\n\nEverything turn to biogenic oil buried in mud.\nPeepuL from Sea and Sky bring a pinecone and grocery-bag to who surviving.",
            "There is no way they make enough from people visiting to be the motive. Also remember discoveries have the potential to shatter Abrahamic religion narratives.",
            "Ain't no books lasting 11,000+ years in the ground, stone is just about the only thing recoverable from a civilization that old.",
            "Göbekli Tepe already pushed back the official timeline a lot and is accepted by mainstream now too. ",
            "It would probably be some proto cuneiform that would be decipherable and explain other earlier mysteries that would help with translation of said imaginary book. If only",
            "That or the [owners of the planet changed](https://www.reddit.com/r/StrangeEarth/comments/1da33js/earth_is_a_prison_planet_for_rebellious_souls/)",
            "Star Trek vibes",
            "That’s what I always wonder too.  And with the finger numbers . When there’s a deer with 3 fingers… if they’d just drawn a human next to the alien they would have made it a lot easier for us.  I like to draw and in a pretty realistic style but I most often only do 4 fingers because it looks more natural than 5. I imagine if I was carving a picture in stone 3 might even look more natural than 4",
            "Shrimps taking advantage you say???",
            "I fucking loved this 🤣🤣",
            "Clay or slate tablets, stamped gold",
            "\"Shrimps are the Tidal Bulge.\" -Fermi",
            "Ya",
            "100% shrimps made of higgs and bosonz."
        ]
    }
}