{
    "Mark NSFW posts accordingly": {
        "title": "Mark NSFW posts accordingly",
        "score": 1207,
        "url": "https://www.reddit.com/r/AMA/comments/n2a9mv/mark_nsfw_posts_accordingly/",
        "content": "Hey everyone, hope you're having a swell day.\n\nJust a reminder to mark any posts that are nsfw (anything related to sex, gore, etc.) accordingly.\n\nNow, you may be thinking, \"Mr.Scary mod man, how do I apply such a strange thing to my *stayawaykids* posts?\".\n\nWell, let me tell you....\n\n**FOR PC - Click \"+NSFW\".**\n\n**FOR MOBILE - Click the 3 dots in the bottom left corner, followed by the \"NSFW\" button.**\n\nIf you have any questions feel free to ask in the comment section of this posts.\n\nThanks!",
        "num_comments": 229,
        "comments": [
            "Will do mr. internet person",
            "I just got questions about this subreddit asking if it contains any nudity,discussion of firearms, recreational drugs,etc. Why did it ask me all of those questions",
            "[deleted]",
            "What's your favourite type of hot sandwich?",
            "I came here after a minor anxiety attack reading the black on red words \"Super Scary Mod\" and feel duly disappointed!",
            "How many languages can you translate this rule into?",
            ">Mr.Scary mod man\n\nDamn reddit has nice ppl",
            "What does AMA stand for so sorry",
            "\"Mr.Scary mod man\"\n\nwhat a beautiful way to address yourself\n\ni just joined this subreddit and i love it already just because of that",
            "Why is your name Mr cheap cheap",
            "Who is Mark?",
            "Message the mods button wasn't working for me so I'll ask here. This is my sex work account. If I post an AMA that in part relates to me sex work, am I breaking any rules or anything like that via some sort of indirect advertising? Figured I'd double check before posting lol",
            "[deleted]",
            "Hey Mr. Scary mod man 👋",
            "I keep seeing that many people don’t know what AMA stands for. Perhaps it would be a good idea to let them know in the “About “ section of the subreddit.",
            "I wonder why my post about roller skates being a good diversion now that spring is here and we are all trying to recover from the pandemic nightmare was marked as nsfw?",
            "Scary mod man is scary",
            "how long are potatoes supposed to boil?",
            "y r u named super scary mod?",
            "Thanks for the information.",
            "My dumb ass can't figure out how to mark my post NSFW. 🤦‍♀️",
            "You guys might be the most helpful and easy to explain mods on this site.",
            "🤣",
            "What does NSFW stand for",
            "AMA. I grew up an Army brat.",
            "L + dont care + CURSE OF THE NILE ‼️ ‼️ 𓀔𓀇𓀅𓀋𓀡𓀡𓀕𓀠𓀧𓀨𓀣𓀷𓀷𓀿𓀿𓁀𓁶𓁰 𓁴𓁿𓂀𓁾𓁵𓁯𓂞𓂤𓂗𓃃𓂾𓂺𓂹 𓃞𓃙𓃖𓃓𓃕𓃓𓃜𓃘𓃙𓃟𓃛𓃞 𓂺𓃂𓂿𓂺𓃃𓃂𓂛𓂏𓅱𓅥𓅩𓅦 𓅹𓅸𓅳𓅩𓅪𓄭𓄫𓄮𓄬𓄗𓄑𓄌𓃦 𓃧𓃨𓃤𓃟𓃓𓃅𓃁𓂽𓃂𓂊𓁾𓂀𓁽 𓁼𓁠𓁛𓁟𓁦𓁜𓁭𓁡𓀔𓀇𓀅𓀋𓀡𓀡𓀕𓀠𓀧𓀨𓀣 𓀷𓀷𓀿𓀿𓁀𓁶𓁰𓁴𓁿𓂀𓁾𓁵𓁯𓂞𓂤𓂗 𓃃𓂾𓂺𓂹𓃞𓃙𓃖𓃓𓃕𓃓𓃜 𓃘𓃙𓃟𓃛𓃞𓂺𓃂𓂿𓂺𓃃𓃂 𓂛𓂏𓅱𓅥𓅩𓅦𓅹𓅸𓅳𓅩𓅪𓄭𓄫𓄮 𓄬𓄗𓄑𓄌𓃦𓃧𓃨𓃤𓃟𓃓𓃅𓃁 𓂽𓃂𓂊𓁾𓂀𓁽𓁼𓁠𓁛𓁟𓁦𓁜𓁭𓁡𓀔𓀇𓀅 𓀋𓀡𓀡𓀕𓀠𓀧𓀨𓀣𓀷𓀷𓀿𓀿𓁀𓁶𓁰𓁴𓁿 𓂀𓁾𓁵𓁯𓂞𓂤𓂗𓃃𓂾𓂺𓂹𓃞𓃙 𓃖𓃓𓃕𓃓𓃜𓃘𓃙𓃟𓃛𓃞𓂺𓃂",
            "Muting this garbage subreddit. 50% Just the scum of humanity hanging out",
            "I blame this sub for consistently getting the \"pile of leaves\" error page.",
            "Do the folks there hate Iran as much as they are expected to?",
            "Wait... is this a AMA post? Can I ask you anything?",
            "How does Mark do it so accordingly?",
            "I'm assuming my post about working in cannabis falls under this? Even though it is a job lol.",
            "Are you happy that you can have sex all you want with no problems",
            "Are you satan",
            "[deleted]",
            "Very reasonable",
            "Great idea!",
            "Hey, I made a post last night with the intention to answer questions in the morning but it was deleted. Is there a time limit on answering questions ?",
            "Thank you mister mod person.",
            "Hello it won’t let me post.",
            "Yes, I think I will",
            "Test",
            "Ok google!",
            "How do u mark nsfw?",
            "What about NSFL content?",
            "Why?",
            "What's your favourite ice cream (not choc. Or vanilla)",
            "Sorry, but I'm unable to read rule 3 and 4, there is to extend button on it. What are those rules?",
            "what does AMA stand for/ mean?  i am getting into the conversations, but still have no idea.  please & thanks..",
            "Thank you. Have a good day.",
            "I just tried to post an AMA.  Does it have to be vetted before it shows up?",
            "what does AMA stand for?????",
            "No I don’t think I will",
            "Thanks for the tip Mr.CheapCheap ;)",
            "Alright ✨",
            "Ok",
            "yessir",
            "Hello mr scary mod hope you are having a good day thinking about posting here but I’ll have to think on if I want people ama or not",
            "thank you mr scary mod man",
            "Ok, just don't hurt me",
            "Don't know if asked yet, but why won't the vehement just come clean and say they've been in contact with suave aliens for decades?\n\nWe all know it. Just seems dumb to keep playing dumb, you know?",
            "What does AMA mean?",
            "Clear",
            "Wtf is AMA?",
            "People tend to put NSFW marks on posts to basically say “I allow nsfw comments” but that’s pretty misleading. \n\nPeople can comment nsfw stuff anywhere, only put it on if the POST itself is nsfw.",
            "Db dez nuts in ur mouth",
            "I am in a markiplier subreddit and I was very concerned for a moment there as I thought this was from there",
            "Will I get blocked if I mark a non NSFW post as NSFW?",
            "Does this include posts about the devils lettuce?",
            "lel",
            "r/AmA",
            "This comment section has been conquered and combined with the might of the Legendary Wardens.",
            "[removed]",
            "[removed]",
            "Yeah; that's abusive; i guess. If it's any consolation Im a (former) narcissist who feeds off hurting assholes their ex doesn't like. Erwin, Stamper, Mallowitz, Duncan, Rutherford, Klimt, Lydle, and yes; Watkins..",
            "What's AMA?",
            "Do posts about sexual assault have to be flared as NSFW?",
            "I don’t have any NSFW posts. But if I do in the future I will mark accordingly",
            "i love you",
            "Copy all actual.",
            "87% of NSFW posts target boys under the age of 16. it has also be proven that 52.3% of gay homosexual pedophile posts which are classified as NSFW originate on the AMA sub",
            "Hello, \n\nHope anyone can help me. I'd like to post a nsfw AMA, and want to, as per the rules, mark it nsfw. The post here says to click \"+NSFW\", but the problem is I don't see where I'm supposed to do so. The new text post  submission form doesn't have a \"nsfw\" checkbox or other button. What am I missing or doing wrong?",
            "Isn't there a AMA for NSFW posts?",
            "https://www.reddit.com/r/IAmA/comments/109eze3/im_bill_gates_and_im_back_for_my_11th_ama_ask_me/",
            "[removed]",
            "Is it possible to heal and have a healthy relationship with your partner if you once had porno addiction?",
            "Why did you delete my post about having a crush on Isabelle from my old account?",
            "Looking for paypigs",
            "What does AMA mean?",
            "crazy",
            "What does AMA stand for?",
            "[removed]",
            "[removed]",
            "Absolutely, marking content as NSFW is crucial for maintaining a respectful and safe community. Speaking of which, how do you feel about the current moderation of NSFW content on Reddit?",
            "Yo, peeps! Quick heads up: let's keep it classy and tag those NSFW posts. Mr. Scary mod dude wants us to click \"+NSFW\" on PC or hit the 3 dots, then \"NSFW\" on mobile. Easy peasy, right? Don't be the guy leaving the innocent bystanders scarred for life. Keep it clean, or at least let folks know it's gonna get wild. Any doubts? Throw 'em in the comments. Let's keep this place a mix of chill and thrill. Cheers!",
            "How in the God damn fucking hell do you start one of these time spongue",
            "Thank you Happy Amumu :)",
            "Reddit randomly sends those questions to members of a subreddit so they can better classify said subreddit (to recommend it to people who have similar interests, not show it to work-safe accounts if it's adult content, add restrictions/tools if it's it's a sensitive topic, etc.)",
            "937 459 6492 bram 7\nLymph 2\n4.I 6th 68f9 is.",
            "Happy cake day",
            "Don't know",
            "Reddit",
            "e621.net",
            "lMAO.COM",
            "cornhub.cum",
            "Hot dog",
            "Anjou-French dip beef sandwich in this French onion soup thing—guess that is the Anjou",
            "tuna melt",
            "Not OP, but I can translate to English if you want.",
            "agree",
            "\"Ask me anything\" :)",
            "It’s actually pretty outrageous that the pinned post doesn’t even say what “AMA” stands for, lol. The arrogance!",
            "Thank you so much for asking this. I am so deep in the subreddit trying to figure it out. Finally!!!",
            "My family used inbreeding during the 1800s and the beginning of the 1900s. AMA",
            "This word/phrase(mark) has a few different meanings. You can see all of them by clicking the link below.\n\nMore details here: <https://en.wikipedia.org/wiki/Mark> \n\n\n\n*This comment was left automatically (by a bot). If something's wrong, please, report it in [my subreddit](https://www.reddit.com/r/wikipedia_answer_bot).*\n\n*Really hope this was useful and relevant :D*\n\n*If I don't get this right, don't get mad at me, I'm still learning!*",
            "Mark is AMA boss..  mother fuckers judge me aandkhs sweat me at her work.    Grow up she won’t stop crying I HAVE BEEN Gone a week \n Any Genius ever reconsider their fuck fest. Actually damages the person more inside.  I’m. Furious and you all b will answer for this shit.    Good day and goat cheese it’s much more valuable than anything else.",
            "Just mark it NSFW, and don't link/ advertise your services",
            "Hello :)",
            "Until they're done",
            "Fill pot with potatoes, fill it with water, set on burner, turn burner on. 25min from that point, not from the start of the boiling. Russet potatoes seem to be tougher though, they take a little longer.",
            "Boo",
            "Ok",
            "With me",
            "I'm on pc btw",
            "\"Ask me anything\" :)",
            "ask me anything",
            "\"Ask me anything\"",
            "\"Ask me anything\"",
            "Only the devils cabbage\n\nOn a serious note, just use your own discretion, or message the mods to ask if you're unsure\n\nCheers",
            "Yes, that's where we are.\n\n---\n^(🤖 this comment was written by a bot. beep boop 🤖)\n\n^(feel welcome to respond 'Bad bot'/'Good bot', it's useful feedback.)\n^[github](https://github.com/Toldry/RedditAutoCrosspostBot) ^| ^[Rank](https://botranks.com?bot=same_subreddit_bot)",
            "It stand for *Ask me Anything* :)",
            "It stands for \"Ask Me Anything\"",
            "Yes, as that's a sensitive subject",
            "That's r/iama, this is r/ama",
            "We didn't ban them, you just have to mark your nsfw posts with the NSFW tag\n\nObviously anything illegal or whatnot isn't allowed tho",
            "To help reduce trolls, users with negative karma scores are disallowed from posting.  Sorry for any inconvenience this may cause.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AMA) if you have any questions or concerns.*",
            "To help reduce trolls, users with negative karma scores are disallowed from posting.  Sorry for any inconvenience this may cause.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AMA) if you have any questions or concerns.*",
            "Hey mod unable to see my posts on this sub, please help",
            "Test",
            "Sulsul",
            "Ok thanks.",
            "[deleted]",
            "Hey",
            "Why delete?",
            "Ah yes, the place for any person wishing to purchase quality corn",
            "I thought your u/ was forskin historian",
            "Hot cat",
            "I think you’re possibly referring to “au jus “, because you dip it in the jus( juice) of the meat. Anjou is a type of pear, and probably the last name of the guy who developed the type of pear.",
            "I see I joined this discussion really late. I still think you should know the real name of your favorite hot sandwich",
            "Me asf",
            "Hey there",
            "thank you for the helpful tip 😊😊😁😁😁😁😉😁😁😊🤣🤣😇😇😍😍😍",
            "aw",
            "ohhhhh thank you",
            "I posted this in another place, but since I got to this discussion so late, I will mention it again- Perhaps it’s a good idea to let people know what AMA stands for in the “About “ part of the subreddit",
            "Will you perform your throat skills on me?",
            "Bad bot",
            "Good bot",
            "[removed]",
            "[removed]",
            "You've been banned by the shadow",
            "No problem! Have a great day :)",
            "Another Marijuana Addict",
            "i forgor ☠",
            "Hot foreskin is not my favorite",
            "i can confirm 🖐",
            "Yes tysm 🤢😇😡😂😐😂😡😨🤢📸😁💅😍😈😍😈📸😩😐😡🚸😭",
            "i just wanted to know",
            "no problem :)",
            "Thank you, LegendaryWarden, for voting on same_subreddit_bot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
            "No problem :). Cheers",
            "To help reduce trolls, users with negative karma scores are disallowed from posting.  Sorry for any inconvenience this may cause.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AMA) if you have any questions or concerns.*",
            "[removed]",
            "I figured it out",
            "That was sofa king funny",
            "Please don't use this subreddit to advertise jobs or post questions for help. Try finding a different subreddit to do that.",
            "They are among us. You never can tell who does the weed. I’ve watched the documentary “Reefer Madness” at least 34 times, I still can’t tell.",
            "34! Dang!"
        ]
    },
    "I lost my virginity at 10, AMA": {
        "title": "I lost my virginity at 10, AMA",
        "score": 55,
        "url": "https://www.reddit.com/r/AMA/comments/1dltwbx/i_lost_my_virginity_at_10_ama/",
        "content": "When I was 10 I lost my virginity to a 15 year old girl who was my babysitter. I am 22 now. AMA",
        "num_comments": 75,
        "comments": [
            "I was 11 or 12 and the girl was 14- and the thing I think now, as an adult, is that she must have been being sexually abused by someone older than her.  We even had anal sex, which she was familiar with .  I didn’t have a clue about anything.  I don’t think kids want to just go all in like that without some kind of abuse happening in their lives.  So it’s a lot to unpack.  I don’t necessarily “feel” like I was a “victim”.  When I think of it, which is rarely, I almost think she must have been the victim of someone else, and was trying to shift the power , or something.  It doesn’t excuse sexual abusers, but I have a kind of strange compassion for her in that sense.  It’s kind of wild to think about.  I’ll bet a lot of kids need help that they feel that they can’t ask for.  It’s a sickening idea.  I think the way to get your angel wings is to have abuse/bad behaviors/ etc stop with you.   Hurt people hurt people, they say.  But I believe they can also help people- if they learn from their own experiences, and then live accordingly .   “Helping people “ can simply mean NOT continuing cycles of dysfunction and/or abuse.",
            "I’m so sorry. You can define this however you like, but I think most people would say you were sexually assaulted and abused by a babysitter. I hope you’re doing okay.",
            "I lost mine at 12, he was 18 and i genuinely thought he was the love of my life. Now at 20 years old i feel disgusted and ashamed, i always wonder if he knows how horrible and disgusting he is.",
            "Has it affected you more now, you're older?",
            "I was in this very same situation. Although we never had intercourse, only because I didn’t understand how to put it in. I was probably 9 she was 13.  The one time I had it figured out and was ready her sister caught us. \n\nThis went on until she went on to high school and got a boyfriend. I was devastated because I thought I was her boyfriend.\n\nThis left me a hypersexual adult and prone to unhealthy relationships with women into my 40s. I didn’t lose my virginity until 21 because I was so obsessed with purity as a result of my experience, that it had to be with another virgin. Really I wanted to save it for marriage but didn’t end up doing that. \n\nI’ve finally come to terms with all of it and accepted it as the past. I still have to see her every few years as we were neighbors and our families were close friends. It’s always as if nothing went on.",
            "some of these comments are not it. comments making light of a serious situation, one involving the SA of a child - a boy at that - are exactly why so many men don’t speak up about their experiences. it’s not okay at all. just bc it’s a girl doing it, doesn’t make it something to celebrate. it’s still assault and i’m sure it was traumatic for op, if not at the time then probably upon reflection. it’s sad and sick!! not something to joke, laugh, or make light of",
            "When I think back to being 10, I don't think I knew anything about sex.  Like at all.\nI'm sorry this happened to you.  You should have been able to remain a child for much longer :(",
            "Does your family know? If they do then what did they do? What happened with her after?",
            "*posts on ama* \n\n*only responds to 0 comments*",
            "How did it start?",
            "OP… the point of an AMA is that you’re available to answer questions …",
            "That's fucked up",
            "This is horrible! Sorry! Did you tell your parents? How they discovered? How did the incident happen? Where is the devil rapist? I hope she gets in jail for life.",
            "No, no you didn't. You were raped.",
            "Were you aware what was happening or you knew about sex after that incident?",
            "Do you know how her life turned out?",
            "Oh.. I'm sorry that happened to you.",
            "Has this affected you in your life up till now, have you gotten any trauma from it and if so what kind?",
            "Do you regret it? I was 13 and I do.",
            "I’m so sorry. Have you ever considered pressing charges? Do your parents know what happened?",
            "\"I was molested and r@ped as a 10 y o kid by a p€do babysitter. AMA\". There, I fixed a title for you.\n\nI'm very VERY sorry that happened. I hope you're in a better place in your life now. Good luck and stay strong!",
            "Did she put you to bed afterwards?",
            "You were just a little earlier than me. I lost mine around 10:35-10:45. /s",
            "[removed]",
            "Same",
            "Are you getting therapy? This is rape and I’m so sorry this happened to you.",
            "Do you feel any regret?",
            "Have you ever googled her or looked her up on Facebook to see where she ended up in life?",
            "Is this a crime where ever you were living then?",
            "are you serious? 10 year boy cannot f\\*\\*k",
            "If a girl said that, it would’ve been horrible. But when a guy says it… I remember when I was about 4, I remember my babysitter drying me after the shower, and as she dried my pee-pee, it felt good. I still remember myself asking her to touch it there again, and she played with it a little. I was enjoying it but I assume she felt awkward and stopped. I then cried begging for more 😂, but she said no. Poor me. I didn’t even know what that was, but I wanted more. I don’t any memories of her after that incident. Maybe I kept asking for it till she quit or something, but I guess I just went back to growing up as any kid and forgot all about it.",
            "How long was your butthole sore after losing it",
            "Why so late?",
            "Wtf is happening to the society how  and why this all is okay ??",
            "[removed]",
            "*High Five",
            "wait what ?how when where",
            "W",
            "In a good way? Or…?",
            "[deleted]",
            "It’s always weird to me when women displaying sexual urges at young age is viewed as, “they must have been victims of sexual abuse, therefore they did what they did.” \n\nI remember being 13-18. I knew girls who were just as boy crazy as guys who were girl crazy. Having nothing to do with abuse. Being involved with athletics made me see that even more.",
            "SA and abused are too light, this guy was raped by his babysitter.",
            "Hope you’re doing better now, and don’t blame yourself ❤️",
            "It was not your fault.",
            "I imagine it was a lot of pain for you",
            "Are you a woman?",
            "Jesus. Jail for life???  Wow you sound like you could use a little help yourself. Find a punishment to fit the crime. Glad you aren’t a judge.",
            "[deleted]",
            "This is such a dumb comment. Yes what happened was wrong and may fit that definition. But if OP doesn’t feel that way why would you put that on him? Why does everyone have to define their experience by your standard?",
            "Perfect response",
            "To help reduce trolls, users with negative karma scores are disallowed from posting.  Sorry for any inconvenience this may cause.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AMA) if you have any questions or concerns.*",
            "Stalking is never good though...\n\n>!Unless you're stalking a p€do or a r@pist!<",
            "You mean Earth?",
            "😂😂😂😂",
            "No. They are a victim of rape.",
            "You’re disgusting",
            "No saying anything sexual or inappropriate regarding minors.",
            "You're disgusting",
            "Holy fuck you are actually a pedo",
            "??? Wtf is this comment..",
            "If you read you will find out who",
            "Boy crazy is different than knowing what to do sexually. I knew things no other girl my age knew or even thought to do because of what happened to me. OP is spot on.",
            "why do you see it as weird? just curious because for me whenever someone younger than 15 engages in something sexual id assume they were exposed to sex very early whether it was porn or they were SA. I think for this persons case the fact that they did anal and the girl was so young kind of makes me think more that she was SA",
            "Your opinion",
            "Super inappropriate and creepy thing to comment/ask when someone is talking  about being a survivor of SA.",
            "Weird thing to comment",
            "Asking “are you a woman?” to try to downplay the facts. so irritating, go away",
            "i think it’s pretty accurate",
            "Kinda f*ed up tbh...",
            "Kinda the law’s opinion but whatever",
            "I imagine they’re talking about emotional pain",
            "Are you a woman?",
            "Are you a woman?",
            "Are you a women?",
            "I am a man. Thank you for asking.",
            "You are many things, but a “man” is not one of them"
        ]
    },
    "My father is schizophrenic. I’ve seen everything. AMA": {
        "title": "My father is schizophrenic. I’ve seen everything. AMA",
        "score": 49,
        "url": "https://www.reddit.com/r/AMA/comments/1dltg15/my_father_is_schizophrenic_ive_seen_everything_ama/",
        "content": "For context, Schizophrenia is a very serious, possibly one of the worst if not the worst mental illness a person can have. It affects how a person thinks, feels, and behaves. Extreme hallucinations are what makes this illness so scary and what ultimately makes the person lose grip on reality, which is very distressing. Not so much for them but for the family, especially for the family.\n\nHe’s been diagnosed around the time I was born. 22 now and been living with him my entire life. AMA",
        "num_comments": 91,
        "comments": [
            "fellow schizophrenic here. don't let him do to much uppers. typically a small dose makes them feel normal but after awhile they'll hit psychosis. Xanax helps but knowing schizophrenics they want to stop there meds randomly and the withdrawals are deadly.\n\nsativa live rosin is literally what I been doing to help me. I'm scared that I might get worse but I been literally staying away from everyone and haven't gotten back to work. I live in my farm and yes I go into my episodes but my surroundings isnt leading me to destroying anything anymore . but I can't help but fighting with people who aren't there and I get really excited about it until my dogs tell me to stop.",
            "What’s one of the worst episodes you’ve experienced with him?",
            "My mother has schizophrenia as well. She would stay up for days writing without looking talking about angels and demons using her as a vessel. And she would climb onto us in bed during the night and scratch the skin off us (me and my family). My question is, have you experienced something similar - was your father ever violent towards you?",
            "Would the “theme” of his delusions/hallucinations change over time, or has it mostly been the same?",
            "I myself have schizoaffective disorder, which is often described as \"schizophrenic with a mood disorder.\"  I don't know if that's accurate.\n\nHow do you feel about the idea of returning asylums (or a better version of them) for people such as your father?\n\nI have often wished such places to fall back on still existed so that I would not have to fear being homeless in the future.",
            "How are you doing? As it can be genetic, do you worry you will develop the illness too? What does your dad's health care journey look like (i.e., does he regularly see any doctor, or has he ever tried medication)?\n\nWhat other family support do you have?\n\nAll the best to you, OP 💜",
            "Is it the government aliens and ghosts type or some other thing. Everyone I've seen so far with schizophrenia always thinks it's those 3 that are plaguing them, I've never met someone who just thinks their family and friends who are are after them, though, realistically that may be what it starts with.",
            "What meds have worked for him",
            "I don’t have a question, per se. I’ve just always considered schizophrenia the worst illness a person could have as well. I’ve just always wondered if there are any ways you think a person could reduce their chances of getting it or passing it on? I know that’s probably impossible for you to say but family may have clues others don’t. It makes no sense why some have to be afflicted with it. I guess this is more me wondering to the almighty what’s the point of this, lol.",
            "Do you ever resent your mother for not leaving and taking you kids out of that situation?",
            "No Q. but I hope you find peace in what you can control.",
            "So sorry to hear of your situation OP. \n\nMy Q is what are your plans for the future? and: How does he (and the rest of your family) fit into those plans?",
            "Has one of his episodes included forgetting about family members or loved ones? And if so how did it go?",
            "At what age did it start and at what age was it immediately noticeable?\nDoes he recognize himself and relatives, you?",
            "i feel for you, my uncle has schizo.",
            "Was there ever a time when he was healthy and stable?",
            "[removed]",
            "[removed]",
            "I am certain my brother is undiagnosed. His wife is in denial. How do you get someone treated if they refuse to accept reality?",
            "Please don’t procreate. One of my step brothers self deleted a few years ago after getting off his meds. My other step brother had voices telling him I was going to kill him last time he visited. I was like why would I invite you to stay at my home to kill you? His response was that I could poison him and make it look like an accident",
            "Aunt is schizophrenic. for many years she became itinerant and homeless. she would never live in one place for too long because she was always fleeing someone who was chasing her - usually the government. we would hear she made it to China and then the next day we’d be walking through the woods near our house (East Coast US) and she would randomly show up which was very frightening if you are alone. A family member has somehow gotten her to somewhat stay in an apartment they are paying for her - but even now she leaves for days on end. thankfully she comes back",
            "Diagnosed when you were born??? That's upsetting",
            "Thank you for opening up an AMA about your experiences with your father. I work with patients with complex care needs, many of whom have schizophrenia. It’s opened my eyes to the gut wrenching awfulness of this disorder, for the people who have it and their families and loved ones.\n\nHow do you feel about forced medication? Like court-ordered injections to make his condition more manageable? It’s such a slippery slope of individual rights vs causing harm to others.",
            "if your father wanted to get bottom surgery and become a transwoman would you support him?",
            "Not easy for the family. Do you think this fact made you more mature eaRlier than kids that had no parents with this problem?",
            "This may have already been asked but to put a lighter spin on a very dark illness, what was the funniest moment of his that you recall? Does he have any benign hallucinations that don’t scare him or are comforting? I’m not trying to minimize the disorder in any way as I have loved ones with it and it’s awful both for them and everyone around them, and I wish the best for you and your family!",
            "I have schizoaffective disorder I've been medicating for about the past year. I feel after reading your responses, this has led me to the conclusion that you have very little understanding of what the mental illness does to one. Even less understanding for your father.\nThis mental illness completely warps your perception of reality. And your previous assumptions about reality are completely put into question, or sometimes if the episode is bad enough, completely destryoed. This puts you into a place of perceiving a false reality where,  really, anything can happen and anything can be done. That's what leads to and ends in extremely bad behavior and decisions. Everything in a schizophrenic episode is just as real as what's real on reality. That's what's so convincing and deceptive about it.",
            "Does medicine not help?",
            "How do you feel, if at all, about representation for people with schizophrenia in popular media? I'm writing a book and my main character has it, and I want it to be as respectful as I can make it.",
            "Does he think the government is after him?",
            "I watched a video of a doctor who put his patient on a ketogenic diet, maybe even carnivore diet and all of their symptoms vanished. Borderline personality disorder and schizophrenia both cured by this diet. Idk man, but I wish you luck",
            "[removed]",
            "It’s scary, I don’t have it so I don’t know how it is but when I have my own kids, there’s a good chance at least one of them will have it, terrifies me just thinking about it.\n\nI’m really sorry you’re going through what you’re going and I don’t know how to help you. Take your pills every day and may god be with you❤️",
            "stop with the sativa its not actually helping",
            "Last year, threw all of our or at least most of our belongings in the trash, including his. Had do dumpster dive to find our credit cards, our passports and a whole bunch of other documents and items. That same year he poured hot pepper juice in his eyes and nearly went blind. Was stripping naked in public. Also the $15.000 he had under his name for decades, wasted it on god knows what. He’s living on pennies a day now",
            "There were times when I was younger that he would just beat me up over seemingly nothing, now that I’m in my twenties, the dude’s a joke to me. People are terrified of him on the streets but I’ve been living with him for so long that it just doesn’t freak me out anymore. About writing bullshit, I feel you man, he has a stack of about 100notebooks just now. His handwriting is horrible so I never really tried to read them but nothing smart inside them. One thing I’ve noticed he writes a lot is people’s intelligence. Mine is 50k and his is 200k, sometimes a million sometimes two🤦‍♂️",
            "Depends. there were episodes where would only talk to himself and that would be about it. For a few months he would ask himself questions and then answer those same questions, all out loud for days until he passes out and then wakes up a day later to continue where he stopped and there were episodes when he would do far crazier shit",
            "That’s a great question.",
            "Well, last time he’s been there way just this year maybe 4-5 months. He was begging his brother to take him out of there, promised to take his pills… until he was out. Came back, infested the house with lice, stopped taking his medications and now he’s just a complete mess. I don’t really even feel bad about him, my life is horrible because of him",
            "Appreciate you man❤️\nThere were times when ive been thinking i have it, especially when i would get a bad trip during my highs(don’t smoke anymore but smoked heavily up until a year ago)\n\nI don’t think i have it but his as a result of his behavior because of his illness i have my own issues in the head. Doing pretty good tho nothing to worry about\n\nHe’s a lost cause, doesn’t shower, doesn’t wanna take his pills, all he wants to do is journal the same crazy things over and over, ask for money all the time because he wasted his life savings onto nothing during on of his episodes (in about a month, $15k) and ramble stupid things out loud\n\nHaven’t called him dad in about 15 years, I don’t have a father, that’s not a father\n\nI understand he’s sick but he has altered our lives in ways you would believe.",
            "There were times where it was the government, there were times when it was demons, where he sat in the kitchen yelling stuff like get out of here demons, get out. Cringing just thinking about it, and as of now it’s the gods/aliens that’s he’s scared of because they have computers up there on another planet, big ass computers with big screens and they’re controlling him. His words not mine :/",
            "It's funny you should say that since in one of my episodes it was aliens and ghosts!  Sort of. Actually \"family and friends\" is common and probably one of the most common it's just easier to open up about gov/aliens/ghosts depending on the scenario in your head.  When you suspect your friends and family your lips tighten up you can't trust anybody.",
            "I’m sure whatever the doc has prescribed him would work if he would take them every day as opposed to taking them today, skipping tomorrow than taking for two days and skipping a week",
            "Not OP but I've read a bit about this disorder and there's a few things you can do to increase your chances of having the disorder express itself.  None of them you have control over except recreational drug use.  Drugs can increase the chance of having your first episode and you are likely to have more episodes after your first.  So avoiding drugs is the only thing I know of that you have control over that can help \"avoid getting it.\"  Stuff outside of your control would be to avoid emotional trauma and stress.",
            "It’s genetic illness. Many members of his family have it or have had it. We are three brothers and neither of us has it, which is just crazy, a miracle. However the odds that our children are going to get as lucky as we have gotten are astronomically low, which I don’t know how to feel about when I think about it.",
            "Good question. No, I don’t hate my mother. Perhaps she didn’t do everything right, perhaps she could have done things differently but regardless, she sacrificed everything she had for us, she didn’t leave us, didn’t give us for adoption, she decided to sit here and rot with us. She gave up on her life for us, and that I can’t overlook.\n\n(Leaving was out of question at the time, she had nowhere to go, her family told her to leave ‘his’ kids to him and come back, she didn’t do it)\n\nMinus her mother she hasn’t spoken to any of them since",
            "Appreciate you dude",
            "He never forgot who we are. He knows we are his family but he has never cared about any of us, there were times when I had no food to eat and he never cared. Can you blame him, idk, he is crazy after all, I’m sure if he was sane he would’ve lived his life differently",
            "I’m sure he has had it his entire life but around the time I was born it had became obvious that something’s not right with him. He knows who we are and who he is, but the person he used to be once upon a time, he’s just a shell of that man now. That’s life",
            "Yeah man, it’s fucked",
            "He could control it like 10 or so years ago, he was crazy, but he could pretend that nothing’s wrong despite his constant hallucinations. Was he complete health ever, probably, but since I remember, not really.",
            "To help reduce trolls, users with negative karma scores are disallowed from posting.  Sorry for any inconvenience this may cause.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AMA) if you have any questions or concerns.*",
            "To help reduce trolls, users with negative karma scores are disallowed from posting.  Sorry for any inconvenience this may cause.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AMA) if you have any questions or concerns.*",
            "I don’t know man, we couldn’t convince this guy that he has to take his pills and he’s 60 now.\n\nThey very rarely accept that something is wrong with them and they need to take meds and I don’t know if you can really blame them, put yourself in their shoes you don’t feel like there’s anything wrong yet people are forcing you to take pills to feel good.\n\nDon’t know what advice to give you man\n\nPerhaps somehow get your brother to talk to a medical professional",
            "Okay, won’t procreate, but only because you said please🫡\n\nI know dude, it’s fucked",
            "You don’t know my life story man, it’s gets far far crazier, I might give YouTube a shot one more time, I have some crazy stories to tell",
            "If they don’t want to take their prescribed medications they will lose their mind completely, and will fuck everything up. Everyone around them will suffer, I was bright, young very handy talented child. To this day I am and I speak 5 languages but what has he done to me. His actions throughout the years have mentally got me to a place so bad that I’ve shut myself inside, made my room my own personal prison, I barely ever leave the house.\n\nImo, If you can’t get a person with this specific diagnosis to take their pills, they have to go behind bars. Mainly to protect the psyches of the people around them, most notably the children but adults suffer as well",
            "I just watched a video about the keto diet. The guy explained that when the body is in ketosis it reduces brain acitivty, which then stops people from having seizures. I suppose reduced brain activity would lead to reduced hallucinations and paranoia.",
            "The fuck is wrong with you?",
            "This got oddly specific. Wanna talk about it bro?",
            "You needn't be so scared. Schizophrenia is a 1% chance for anyone to have and 15% for their kids if only one parent is schizophrenic but that's about it really. If your wife is OK then your kids shouldn't have more than a 5% odds tops. \nhttps://www.sciencedirect.com/science/article/abs/pii/S0165178119318608",
            "so basically what I said is that I don't take pills I do live rosin sativa. the pills work but I don't like taking them . rosin has been the only thing besides my pills to make me  interact normally with people. I do believe in God and I do sometimes feel like maybe what I'm going through is spiritual warfare.",
            "hobbies are the main thing too. you want to make sure they literally are occupied. being alone with the thoughts is the worse thing.most of us hit psychosis alone",
            "Are you a schizophrenic?",
            "Personally I find it has rebound side effects. Sativa makes you feel better but then when you don’t take it you feel worse than you would have never taking it.",
            "sativa and THC-V are very medicinal. alot of people typically like to do indica which I personally don't mind it but I find more medicinal properties in sativa. I started sativa live rosin in 2021 and stopped everything else. I use to work in a medical facility and I literally spend an unusual amount of time studying compounds and effects so I have a pretty good idea of what works and doesn't. I don't agree when someone says \"sativa gives you anxiety.\" It only gives you anxiety because you're not meant to be sitting on the couch doing absolutely nothing.",
            "Did he offer a reasoning why he did those things?  Is there an element of paranoia?",
            "Oh my god. You made me relive some stuff with this response haha. I hope you’re doing ok. As much as it does become ‘funny’ cause you’re so used to it, sometimes I worry that it is doing damage deep down just being around it. I haven’t seen my mother for over 2 years and I feel guilty but she just refused all help so 🤷‍♀️. Thanks for answering",
            "Do you know they offer injections that last up to 6months now ?  They’re called LAIs.  Long acting injectables.  They’re kinda where the treatment is heading for psychotic disorders (I’m a psychiatric prescriber)",
            "I have a brother with it and for him staying completely away from weed is crucial to his stability.",
            "friend, you are 22. you certainly dont know if you have schizophrenia yet, you have just entered the typical onset age abd have a few more years to go",
            "Why would you have kids knowing this?",
            "I would avoid any psychedelics and most recreational drugs. Have you had DNA tests done. My whole family did ancestry DNA tests and then uploaded the raw DNA files to a site that analyzes them and shows what mutations you have. Only my dad and brother have the mutation that makes someone more likely to have schizophrenia or bipolar. They're also the only 2 that have it. My dad has been much better since they put him on an anti psychotic called clozapine. If he misses one dose he goes apeshit and loses all touch with reality. My brother's psychosis seems to be triggered by weed or amphetamines. Both had onset in their early 20s. My dad was actually hospitalized for a year in the 70s.",
            "Well that’s unfortunate. Hope you can all live as happy as you lot can be.",
            "I really wanna know what he said, lol",
            "I'm Bipolar 1, adhd, csa, ptsd and enough issues to boot. I'm also hearing impaired so I'm not entirely sure if my brain generates its own noises for my lack of or if I'm in a stage of psychosis. Even before the trauma, I always had tinnitus and thought I heard random noises so I'm gonna chalk it at the hearing issue. It's enough to make me wonder and that's when I get busy. \n\n\n\n\n\n\n\n\n\n\n\n#Structure is life. The mind is as much a prison as it is paradise.",
            "no, i am someone with a doctorate degree in drugs and 3 schizophrenic friends (2 living)",
            "i have a phd in pharmacology and smoke weed every day. its not good for schizophrenia. does your doctor know you use it",
            "Oh yeah dude for sure, we are messed up in our own ways😂 can’t live with that for so long and be complete fine at the end",
            "I wasn't aware I had it's cousin (schizoaffective disorder) until I was 32 when I started having really bad episodes.  Now I look back on experiences I've had in the past and have no idea if I was having episodes and didn't realize it or if that crazy shit really happened.",
            "Don’t know how to feel about it mate, don’t ask",
            "Legit something about his dad having an episode and r@ping him thinking he is trans or something. It was very out of pocket and just horrible 😅",
            "So you’re not schizophrenic, but you have a “doctorate degree as drugs.” Gotcha.\n\nNinoloco, studies are conflicted on marijuana use and schizophrenia. Some say if you’re genetically predisposed to schizophrenia, it can actually aid in developing psychosis … but the studies are flawed.  Most are done on the “risk” of developing schizophrenia, and not actually on diagnosed schizophrenics using marijuana as part of their treatment (self-medicating or otherwise).",
            "I know you’re trying to be helpful, but this persons freedom over their mind and body should matter and how they choose to live in their meat vehicle is more important than standing on a moral high ground. If the dude feels weed helps who am I to say their subjective reality is wrong?",
            "A true warrior can only make the best of what he's got. \n\n\n\n\n\n\n\n\n\n\n\n\nYou're a badass. Thanks for being so compassionate toward the entire situation despite your terrifying start and encounters in it along the way.",
            "Oh... Jesus. I hope they get help. That's so specific.",
            "theres scientific evidence that marijuanna use, especially non doctor supervised, is bad for scizophrenics. we are not talking about development risks, bro already has it.",
            "It was, the dude is out of his mind. Checked his account he’s been commenting stuff like that to everyone"
        ]
    },
    "I’ve drank a gallon of milk every day for almost my entire life. AMA!": {
        "title": "I’ve drank a gallon of milk every day for almost my entire life. AMA!",
        "score": 145,
        "url": "https://www.reddit.com/r/AMA/comments/1dlj5ee/ive_drank_a_gallon_of_milk_every_day_for_almost/",
        "content": "I drink a gallon of milk almost everyday since I was around 9 years old. (M/26) No one else I know has this “addiction” so maybe this might be interesting! AMA!\n\nEdit: Headed to bed now. I’ll try to answer anymore questions in the morning while I’m drinking a nice cold glass! ‘‘Twas fun!!",
        "num_comments": 476,
        "comments": [
            "I was curious how much calories a gallon of milk had and then found this link https://www.bonappetit.com/story/gomad-diet. Apparently some people drink a gallon of milk a day as a bulking strategy while lifting. It's got a shit ton of protein, fat, and calories. I know some users were talking about sugar but milk has way better macros than candy or ice cream. However at 2400 calories in a gallon, it alone meets the daily calorie need for most people! I wanna try to stay in the spirit of the ama but can't help but join the crowd questioning the health implications. Let me at least say this: watch out for your 30s when your metabolism slows down or if you ever work a less active job!\n\nOkay for the actual AMA... Do you have a favorite brand? Ever tried Raw milk? Thoughts on organic vs pastured raised vs other random buzz words on the packaging, do you find any of it reliably leads you to a good glass? Ever drink it warm or on ice?",
            "My dad was like this for a long time, my mom would buy 5-7 gallons of milk at a time.  His diet was all around terrible but he has diabetes now and can’t do it anymore.",
            "Do you go to the grocery store everyday or do you have fridge entirely for milk?",
            "1: Does this affect your appetite for meals?\n\n2: Do you still drink water or is milk your default liquid?\n\n3: Do you just chug from the gallon jug or do you drink from a glass?\n\n4: Do you only drink at home or do you bring a thermos out and about with you?\n\n5: How many times a day do you drink to make it to a gallon?",
            "That can't be healthy.",
            "this is so funny because i have WIC and they give me like 5 gallons of milk a month, and im always like WTF who drinks this much milk. (for clarity my twins aren’t old enough to drink milk so they give 5 gallons just for me😭😂)",
            "Leave some strong bones for the rest of us man.",
            "That much dairy will cause too much calcium in your muscles, causing them to be extra tight all the time.  It’s best to back off on the dairy and add foods high in magnesium to your diet like green, leafy vegetables.  Ask me how I know.",
            "My cousin definitely had this addiction. We would be drinking soda at thanksgiving or Easter and he would get a HUGE glass of milk and then  another. It’s the only thing he drank, from dairyland Wisconsin. His parents would tell him no sometimes. \n\nA few years later he decided he wanted to curl 100 pounds so he bulked up, definitely tapped into the milk in his bones 🥛",
            "What are you eating? A gallon of whole milk is 2400 calories.",
            "🤢",
            "Have you tried Fairlife? Imo it’s just as good, and I think there’s less sugar and such. \n\nDo you ever drink flavored milk?",
            "At what point did you realize you were a psychopath and how long did it take for you to accept that?",
            "Same here brother. Im 34 though, welcome to the club. Join r/milk",
            "How is your weight?\n\nWhat % milk do you buy, and have you noticed any “flavor” changes across different brands? If so, what is your favorite? Have you ever took your habit and explored something like picking different kinds of milk or buying from local dairy farms or something that a sommelier would do, by investigating fat content or locations?     \n\nI don’t find this particularly weird. I enjoy milk. My nephew has been on a health journey and we buy him larger volumes of milk, that he sometimes adds protein to. It helped him curb hunger while he has been getting his diet under control and he seems to think it impacts his weight training progress. I come from a background of pretty extreme poverty and food insecurity, and spent a not-small portion of my school years surviving on milk and old loaves of bread. It really curbs appetite and feels kind to the stomach.",
            "Are you obese?",
            "Do yourself a favor and cut that out. Milk is terrible for adults, it's fattening as fuck and tons of sugar",
            "Have you ever felt sick from doing this?",
            "Did the same thing.  All was going well until I became slightly lactose intolerant.  Which sucks living in WI.  Luckily it’s mostly just milk that bothers me.  Switched from 2% regular milk to FairLife whole milk, can barely tell the difference.",
            "Are you super tall?",
            "Beware kidney stones.",
            "How strict should AI sanctions be?",
            "how much do you weigh? I remember when i was gaining weight i would drink a gallon of milk a day and it was insane how fast i gained weight.",
            "Let’s see the build son. Your either swoll or a troglodyte no in-between",
            "My teenage son drank a lot of milk. He's a foot taller than me.",
            "Are we talking whole milk? Skim milk? Almond milk? \n\nSerious differences there. Also has your health been effected by so much milk? Like calories, high calcium? maybe even cholesterol if its whole milk",
            "I used to drink five gallons a week myself but had to cut back a bit to 2-3 for health reasons. I have no questions just wanted to say hi to a fellow milk lover.",
            "I feel like there are worse addictions. I’d say you’re good 😂",
            "Not a question, but if you like milk that much you gotta head to New Zealand. Best dairy on the planet.",
            "Urgent question. How fucking good is milk? I drink way too much of the stuff",
            "You're my hero! I'm not a gallon a day guy but close to it",
            "Side story: I've rarely ever drank anything but non-dairy milk my entire life. There was one time I find myself in a pretty bad situation that left me with almost no food for quite a long time, over a month. \n\nTowards the last week of the ordeal as it was getting life threatening, I found myself craving specifically \"whole milk\" every single day. I'd never drank whole milk before. The first chance I got I went straight to the supermarket and chugged a gallon before any food 😂 The body really is smarter than we give it credit for, as it's probably the most nutrient dense food on the planet.  \n\nQuestion: Have you gotten sick from milk you thought was still good? Is there a limit to how long you'll keep it, or do you just go by smell?  \n\nThanks, wish you great health! 👍🏽",
            "[removed]",
            "It's called GOMAD to get calories for working out.",
            "Do you do Starting Strength as a training program?",
            "How is your bowel?",
            "How much do you poop? Like more or less than 3x daily?",
            "Are you super swol?",
            "Why?",
            "i drink about 40 ounces a milk a day. how much do you weigh?",
            "Do you have strong bones?",
            "Jesus you beat me too it. I thought drinking a half gallon in a night was impressive for myself",
            "Do your hair and nails grow faster than others?",
            "Full cream? Low fat? \n\nDid you know GOMAD is a bulking diet recommended by Mark Rippetoe as an efficient way for an underweight person to put on weight (including muscle) when starting strength training?",
            "Is that all you drink? Is it easy to get down or do you have to force yourself? Also, why? Taste?",
            "Do you drink it all at once or throughout the day? Do you take it to work? Are you at a healthy weight?",
            "so lactose is a sugar and will raise your blood sugar... there you go there is the addiction... I would stay on top of your blood sugar... not to mention that its not grass fed/organic non-homogenized. goat milk probably healthier",
            "Do you get benefits from the protein or anything attuned to the milk?",
            "Are you big and strong?",
            "Have you ever had a kidney stone?\n\nI use to guzzled unpasteurized milk from the glass bottles at 18 yo. And 6 months later I got a kidney stone. Been getting now ever since.",
            "How tall are you",
            "Are you taller than most?",
            "My dad is like this. He can drink almost a whole gallon of milk with dinner. \n\nI hate milk so it makes me wanna puke lol",
            "How tall are you?",
            "Have you ever drunk spoiled milk by accident?",
            "I have one question, why?",
            "How tall are you?\n\nDo you live on the toilet ?\n\nHow do you deal with bad breath ?",
            "how tall are you?",
            "When was your growth spurt?  Do you think your milk \"addiction\" helped you with your stature (are you tall, short, or average)?",
            "Are you from Wisconsin?  Pretty normal behavior around here.",
            "How tall are you?",
            "Dude you are a true dairy loader. \nSmooth poops, hard body I've always said.",
            "Do you ever think to yourself “I’m guzzling cow breast milk?”",
            "Are you obese? Sounds like you are.",
            "Thoughts on chocolate milk?",
            "what is your height and weight ?",
            "How tall are you?",
            "I don’t drink a full gallon but drink a full fairlife jug. My one friend buys me a jug for dinner at her place. I appreciate her",
            "Are you worried about potentially becoming lactose intolerant and not being able to keep it up?",
            "Height/weight?\n\nHave you ever thought about just getting a cow? If you're a meat eater, this could (although not well) satisfy both needs.",
            "Height, weight, health problems?\n\nThis is hard to do for a competitive athlete. Seems exaggerated.",
            "Do you lift? If so what's your routine like? Drink milk before/during after work outs?",
            "Disgusting",
            "I come from a family that drinks a lot of milk, not quite as much as you but close. Always had a feeling maybe it had to do with our genes (Danish/Norwegian) or something. Lots of tall broad Viking type. My husband finds it odd. Especially when I prefer to drink milk when eating pizza",
            "How tall are you?",
            "Were you a calf in previous life?",
            "My son did that until about age 25, then he became lactose intolerant 🤷‍♂️",
            "I did this briefly while bulking and it definitely help me put weight on but I don’t drink milk anymore.  Dairy can kind of give me the shits now",
            "How tall are you and are you strong or athletic?",
            "How's your cholesterol?",
            "I'm lactose intolerant, fuck you /s\nI am lactose intolerant though and slightly jealous",
            "Your bones must be so brittle",
            "OP got somewhere between 2-6 years before he learns how our bodies change as we age.",
            "Me to, but started earlier and I'm 44 now.",
            "How much do you weigh?",
            "How tall are u?",
            "How tall are you?  Because I’m 5 foot one and I’ve hated milk my entire life except in my coffee. My sister told me it’s because I don’t drink milk.  So I’m curious, how tall are you?",
            "Tomorrow you develop severe lactose intolerance. What do you do?",
            "Is it so you feel full? I chug a gallon of milk right before bed so I can sleep. I'm always hungry and it seems that the only way I can get rid of the hunger so I can sleep (can't go to sleep hungry) is to chug a gallon of milk before bed. I've also been doing this since about 9 yrs old. ",
            "Does it bother your stomach (constipation, nausea, etc)? I used to drink about half a gallon a day when I was about ten because it was the only liquid that I didn't have sensory issues with and I constantly had GI problems. My pediatrician had to tell my parents to stop buying milk for a while so I couldn't drink it and was forced to drink something else. Have you ever had to stop drinking milk/slow down on it for health reasons? What does your doctor say about it?",
            "Do you float in water?\n\nI have a friend who has a similar milk habit, and I swear he’s the only human I ever met who sinks completely. He can’t swim at all.",
            "I was a big milk drinker for years, switched to skim many years ago, then to non dairy 3 or 4 years ago.  As you age you start thinking about your health more.",
            "I drink lots of milk everyday and I'm 43 now,love the stuff,try a pint of milk and a chocolate bar at the same time,it's the future",
            "Ugh so I also can easily drink a gallon of whole milk a day, (31m) have you gained excess weight? I'm about 170 rn which is the heaviest I've been tbh, idk if it's doing me bad, or if it's OK! Reeeee",
            "I drink about a half gallon of A2 milk a day right now… used to drink 6 of those chocolate milks they have in public school every day and I had some at home too and in college I had it too. Yeah so most of my life I’ve had like half a gallon a day.",
            "Do you like milk ?",
            "How’s your bowels buddy? done lie to me.",
            "How tall are you?",
            "I drink about 1/2 a day easily going up to a full gallon sometimes. \n\nDo people who notice make an unnecessarily large deal out of it for you as well?",
            "How is your body looks?\n(A picture is worth thousand words)",
            "I think I developed a kidney stone just reading this. I am jealous! I love milk and could drink a ridiculous amount of it. But alas, I am a kidney stone factory.",
            "If you found out your favorite brand like fair life chocolate was found to have unusually high amounts of forever chemicals would you switch although there might not be anything close to how delicious it was",
            "Do you lift weights? If so, how has it impacted your muscle gains?",
            "what food goes best with milk? for me it would be cookies",
            "Buy a cow",
            "Are you overweight or obese?",
            "I drink zero milk. I eat my cereal with a fork to keep from getting much. I'm also lactose intolerant so if I drank that much milk I would be in the bathroom sick. I can't imagine drinking a gallon I could puke thinking about it.",
            "I drink the most organic Whole Foods ass milk I can all the time. A glass of it is like fine wine to me.",
            "I feel sorry for the cows now.",
            "I love Straus milk with the cream on top 🤤",
            "Do you drink it warm or cold or room temp?",
            "I’m not a weirdo, I’m just genuinely curious. I believe you mentioned a wife and children. Did you ever try breastmilk? If yes, what was that experience like?",
            "Have you ever had a cardiac calcium score done? Last guy I knew that drank milk like that had a near fatal heart attack.",
            "Farting?",
            "I’m not gonna beat around the bush and just ask… what are your shits like??!!",
            "I’ve never met anyone else with a milk addiction! I average a gallon every 2ish days. I don’t really care between skim/1%/2%/whole, but I buy skim just to keep calories down. I’m not trying to bulk, it’s just my drink of choice and has been since forever.",
            "Are you anemic? Have you had your hemoglobin or iron levels checked by a doctor?",
            "When will the Nostromos crew find out you’re a robot and not human? P.S. how’s the alien?",
            "Homelander?",
            "Post physique GOMAD enthusiast",
            "How tall? How much do you weigh?",
            "How has it affected your hair growth? (On the head) I've recently been suggested that too much milk daily has nearly stopped it from growing.",
            "Conveniently ignores all questions regarding weight cause you know this dude is a milk jug with two legs",
            "How tall are you? Do you think it definitely helped you grow",
            "I cut down a few years ago, but I used to drink about this much too. Still love milk though.",
            "I drink about a gallon as well. Not a question but a statement. I know people that do not consider milk a drink and consider it a sauce to be used as an ingredient only. I also know people who argue that milk in general is bad for you. My response is simple, it's better for you than the last thing you ate. As well I know vegans that argue that drinking milk is unnatural. To that I say so are your clothes car Internet underwear and everything you've ever bought. Drink on fellow milk lover.",
            "Have you ever spilled it and cried over it? I must know.",
            "Lucky bastard. I miss being able to drink milk. If I drank a gallon now I'd shit my pants half way through the first sip",
            "The first thing I think of is renal failure\n\nhttps://health.clevelandclinic.org/planning-to-start-a-high-protein-diet-check-with-your-kidneys-first",
            "I drink a gallon of goat milk each week and I thought that was a lot.",
            "Nothing like having a cold one.",
            "As someone who owns cows I can say I’m almost pretty positive you’re getting dangerously close to the point where it’s more cost effective to get your own dairy cow and pasteurize your own milk.",
            "Are you fat?",
            "I too enjoy about 1-2 litres of milk a day",
            "What is your height and weight",
            "how tall are you?",
            "Haha wow. Idk about a gallon a day but I buy about 4 gallons a week bc I drink a lot of whole milk. There’s really nothing else I prefer that compares. Maybe some hard liquor or alcohol once in a blue moon… do you ever switch 2% to whole milk? Please dont tell me you drink skim either. Haha 😄",
            "*The Calcium Connoisseur* this dude hitting his elbow sounds like a Minecraft anvil falling.",
            "I don’t have a question only excitement - Same! Oh my god! Everyone calls me weird, but I love milk, it’s like a dessert for me! If I don’t drink milk, I eat a milk product! I could literally chug the whole box of milk!",
            "Why don’t you just go suck it from the teet, then? You especially have enabled the torture of many dairy cows and the exploitation of their species.\n\nYou a little cowie, mofo? Humans don’t need cows milk. Cows need cows milk.\n\nYou drank so much blood that they have disguised.",
            "Yesss Milk on!",
            "I did that in high school and shot up over 200lbs:/",
            "What are you doing to prevent kidney stones? I completely stopped drinking milk after I got my first kidney stone in my early 40’s.",
            "Im with you.  I could drink a gallon in two days.  However, when I was pregnant.  I solely survived on milk. One gallon a day.  \n\nHigh recommend a metal cup.  Milk with ice and a metal straw.  It’s sooooo cold and delicious.",
            "I did this between the ages of 9-13.",
            "If money were no object, I could probably do the same lol but alas…",
            "Having to drink milk every day would be torture for me..",
            "Stronk bones?",
            "You that southern boy big aintcha",
            "I did this all through high school and a couple years after. I guess my question would be are you also taller than everyone in your family because of it?",
            "Have you noticed any interesting physiological effects from it? Like rock hard knuckles or bones not cracking or denser bones, etc etc.? Anything at all?? \n\nI believe I might have had a calcium deficiency when I was younger because my bones felt less dense, seemed so brittle and would crack all the time, after a workout I would physically feel pain in my bones for days. One day I decided to start taking calcium supplements for the past few years and I truly noticed a huge difference. Whenever I hit weights I feel less brittle, I don’t feel pain anymore in bones like my wrists, elbows, forearms, shoulders, and even my joints like I use to. My bones don’t crack nearly as much, except my knee which I injured when I was younger. Anyway, this could all be a coincidence, however I like to believe that the calcium supplements have really helped. I’ve also started taking multi-vitamins and fish oil. I managed to up my HDL levels since then as well. Sorry for the long message, I just thought it might be interesting information.",
            "Not really a question just more of a hello cause I also do this just not a gallon a day but it up in the 5-6 gallons a week for me, and actually I do have question but I think I know the answer. \n\nStraight out of the gallon is the only way to drink it, yes? Cause yes.",
            "Are you overweight? \n\nThat’s a lot of calories just in liquid form.",
            "Do you do five sets of five?",
            "You mean a gallon as in 8 pints or is a gallon a us measurement that doesn't mean anything to the rest of the world?",
            "Passed a kidney stone yet?",
            "Wonder how this is on your joints and gut health?",
            "As a dairy farmer myself, all I can say is thank you for single handedly keeping the milk price in check.🫡",
            "Do you have any acne?",
            "Did it give you anything different? I mean are you very tall? Overweight? Healthier? Stronger? Weaker?  Anything you'd consider above or below average?",
            "Did you receive more than $18.90 in the \"Bought Milk\" class action lawsuit for being a power-user?",
            "I used to do that too.  During my college days, sometimes that was all I ate.  I stopped in my late 20s I think.  I rarely drink milk now.",
            "Are you fat?",
            "🤢",
            " I drink about 1/2 gallon of milk per day. My 3 kids drink about 1/2 gallon of chocolate milk per day. I buy 6 gallons 3/white 3/chocolate, everytime I go to the store. No one in the house is overweight.",
            "When in hospital my doctor told me about two guys who were stevedores or maybe Marine beach party at I think DaNang and who were routinely stealing refrigerated milk off a supply ship while unloading those in the brutal tropical heat and humidity, drinking the cool milk like water. They got caught because they developed enormous kidney stones which reportedly \"looked like stag horn coral\" and I think that ultimately killed them. \n\nI drink a lot of milk too, often a liter a day, but after my first \"kidney sand\" I really try to drink a lot of straight water.\n\nMy question is: ever have kidney stones?",
            "Are you Homelander?",
            "How many litres is in a gallon?",
            "What do you weigh (and height for context)",
            "When all you can drink is water you can taste the difference in bottled water brands.\nSo I'm sure you can taste the difference in milk.\nEven if it's from the bottles the use. Cheaper brands tend to have the lower quality milk collected from farms that the farmers get less for.",
            "I was raised on the dairy, bitch!",
            "Mark Rippetoe would be proud. \n\nYou a powerlifter?",
            "This is incredibly bad for your health. The reason you feel hungrier after eating milk is because you get a blast of estrogen from the cow that was milked. They give estrogen to the cows so it tricks their body into thinking it’s pregnant, and a pregnant cow will gain more weight, giving the farmer a higher yield, making cheaper milk and meat but also the estrogen makes your body think it’s pregnant you’ll end up gaining as well.\n\nYou do not want to drink excessive amounts of milk everyday. A little bit is all right but the benefits are outweighed heavily by the negative effects it’s having on your body.\n\nWill you please consider drinking less milk for your own health? I don’t want you to die. I want you to live a long and happy life and this is a bad choice for your health.",
            "Your bone density must be off the charts",
            "Have you actually been evaluated by a physician with bloodwork done to see your cholesterol, blood sugar, calcium numbers, etc? \n\nYou say you haven’t experienced adverse health effects, but do you have quantitative data on that, or is that based solely on how you feel?",
            "Are you obese?",
            "Do you smell like cheese?",
            "I do. Maybe not a gal a day but at least half sometimes more. I love milk.",
            "You ever do the gallon challenge and chug a gallon in an hour?",
            "Don't let anyone shame you for it!!! Broke any bones? Somehow I haven't where many would've.",
            "Do you drink the whole gallon is one setting? What kind of milk do you drink?",
            "Does anyone around you or even yourself notice a smell?\n\nHad a friend who did 2 Litres (half a gallon roughly) a day for like a month and by the end of the month (not to his knowing) he absolutely reeked of sour milk. \n\nMans had a pretty good skincare routine and washed thoroughly, but I literally had to stop going places with him because the smell was like a rancid bottle of milk that had been left in the sun for a week. \n\nI gagged while walking into his room once accidentally and he has never drunk the same amount of milk since lmao. Poor guy loves his milk, shame it hits him so hard",
            "1gal every other day for me. \nI love it.",
            "Would you consider suckling directly from the teat like the giant baby you are?",
            "Do you get withdrawal from the casomorphine if you stop drinking milk or have you never stopped to find out?",
            "This man has bones of steel",
            "I drink a gallon. Every 3 days. Milk is great. Have a super high metabolism so it helps keep my weight up.",
            "Are you a calf?",
            "I love whole milk from cows and even cream. A gallon a week is more my speed. Most people in my circle are lactose intolerant or vegan. I have learned to appreciate oat milk and coconut milk greatly.",
            "whats your favorite dish to pair with milk? spaghetti perhaps?",
            "My gfs son drinks the same amount. He recently broke his fibula and smoke all the ligaments in his ankle. Got 22 screws. The Dr said he's never seen a break like this where the tibula didn't break. I credit the milk.",
            "What % ?",
            "I used to looooooove milk (blue cap) when I was younger. Ice cold with every meal and I loved freezing it just enough to make a slushy — great times. Sometimes I really miss it but now I don’t drink milk at all. Living through you bro",
            "Are you a fat over weight person?",
            "You gotta be one fatass dude…",
            "Homelander?",
            "Height and weight? Father’s height and weight? Brothers height and weight?",
            "Check with a doctor and dietitian on how to avoid being diabetic.",
            "I also love milk but I thought it's bad for adults. Isn't it?",
            "Would you say you are muscular or fat or skinny?",
            "Have you ever researched what occurs on dairy farms? That could help break your addiction",
            "I crave milk in the way I should crave water. A glass of ice cold milk is so fucking goooood. I could probably drink a gallon a day if it were more affordable and I didn’t get shamed for drinking all the milk lol",
            "How fat are you?",
            "My life was so much better when I drank milk everyday. Maybe I should go back.",
            "How strong are your bones??",
            "I got on a half and half kick not too long ago. It tastes really good once you get used to how rich it is. It's a ton of calories though. Didn't really affect my weight one way or the other but I no longer drink it everyday.",
            "How bad are your farts?",
            "What's your height",
            "I would have the worst stomach pains and would be splatter painting the toilet and most likely my drawers and bed if I drank that much milk.  I like a little in my tea or I'll drink a glass maybe if I have some kind of dessert.  \n\n\nDo you ever get milk when you go out to a restaurant?  I'll have the tomahawk medium rare and a glass of 2%.  ",
            "*calls Billy Butcher*",
            "Have you tried lactose-free milk? Don’t you like its sweeter taste?",
            "I 65m thought I still drink a lot of milk. One gallon a week.",
            "ask your therapist about ocd haha",
            "I am curious; Have you had any kidney stones? My understanding is that people prone to have them are told to reduce calcium intake.",
            "Are you built like a tank with muscles all over?",
            "What's your height and weight?",
            "You are either incredibly overweight or you have incredible genetics for body composition. Which one is it?",
            "What do you weigh? Lol",
            "cant you get kidney stones or something from drinking so much milk?",
            "How tall are you and have you ever broken a bone before?",
            "How fat are you?",
            "Have you ever contacted Mark Rippetoe and told him how much you love milk?\nAlso, do you lift in conjunction to this?",
            "I just wanna know how much money you spend on it in a week😭 Milk is expensive",
            "That’s disgusting. Try extra creamy oat milk, way tastier",
            "Does it do your body good?",
            "Unless your a calf...I think you're overdoing it.  But that's just me.",
            "Grew up this way too.  My biggest problem was the sugar in it.  If you decide to quit try transitioning to \"fit\" milk.  It is high protein low sugar.  It will help cut the addition part because you just won't crave it the same.  \nI don't meet a lot of people who did this.  But I try to explain it as, we didn't drink water we drank milk.\nGood luck!",
            "Do you need to clear your throat often? I had a friend who used to guzzle milk by the pint and it made him disgustingly phlegmy. Dude would literally gurgle every time he spoke if he didn't clear his throat first.",
            "i do this too bro but not an entire gallon 😭 i drink like half a gallon or 3 quarters",
            "The Milky Way",
            "I’m a milk baby too\nAlmost pairs with everything - leftover Chinese food, fresh pizza",
            "Yep, 2% or whole. No skim, no flavors",
            "I go thru one every other day",
            "Have you experimented with other kinds of milk (goat milk, camel milk, buffalo milk that kinda stuff)",
            "Have you gotten a lipid panel done?  I have been tracking my own lipid panel and noticed that it raised both my LDL and HDL about 15 points each and my Triglycerides is super low, less than 50. So it’s not as bad as what health experts make it out to be. If you can post actual numbers that would be awesome.\n\nIn addition, aside from the lactose from milk, how much sugar, specifically high fructose corn syrup, are you consuming per day. HFCS is common in sweetened dairy products like yogurt, soda, cereals, even in some bread and bagels?",
            "I’m like you! There is more of us out there!",
            "Your parents were just chill with buying that much on a regular basis? I live in an area with many Indian people, and they go through a lot of milk. But that’s a full family, not one brat!",
            "Have you tried any plant-based milk? :)",
            "I used to drink a shit ton of milk, so many foods taste better with milk. I have a few weird questions.\n\n1. Do your farts smell bad?\n\n2. Does your cum taste different? \n\n3. Does your body odor smell different do you think?",
            "Idk if anyone asked but do you have strong bones??? A big booty??? Big boobies??? Asking for hormone related reasons",
            "Are you homelander?",
            "Homelander?",
            "I don’t really have a favorite brand. I find that most milk taste the same in what ever categories it’s in (aka 2%/ whole) I can only do pasteurized milk. Raw just taste gross to me. I was raised in pasteurized so that’s probably why. Organic definitely a noticeable better taste but usually costs way more. Milk that is just above that threshold of being frozen and liquid is the best. Like 34 degrees. The only time I drink milk warm is when I am making hot coco 😁",
            "I'll be 41 on Monday and while I don't drink quite a gallon of milk a day, I'm sure in an average week I drink 5. Never encountered any health issues",
            "You do know caseine is addictive don't you?? So no, you're definitely not the only one with this addiction",
            "Pretty sure recent studies show slowdown doesn’t happen that early. Well into 50-60s it does. Think the general consensus is people just move less.",
            "I only use milk now, I used to hammer back protein shakes. But milk is better, easier and cheaper, the macros are great with milk",
            "So far so good on health. My grandpa had diabetes (he was in great shape still) and very much hope it doesn’t carry down to me. I don’t like needles!",
            "I actually usually just stop at a gas station and buy two gallons at a time. And then I also buy it when I get groceries. I’ve spent an insane (i assume) amount of money on Milk",
            "1. It actually increases my appetite while eating certain things. It almost acts as a lubricant (best term I can think of) and makes food (especially sugary and salty) so good. \n\n2. Absolutly I work a job that is labor and outside. I’ve cold water is must, especially during the heat we’re getting. Milk is definitely my default though when I’m home. \n\n3. Both! When I was living by my self I would Cary that thing around. Usually next to my desk. When I live with other people I respectfully don’t do that. \n\n4. It’s funny you ask! I have a thermos of it right now next to my bed but I only started doing that recently because I use it for work and clean it out and fill it with water every day. \n\n5. I don’t know if times a day is how to look at it. I drink it with every meal but in large quantities. Like 3 tall glasses per meal plus here and there when I’m feeling thirsty and snacking. Pretty much if I’m either thirsty or eating (at home) milk also a part of it.",
            "I haven’t really had any adverse affects. My grandmother was the same way as me. I have a sneaking suspicion it has something to do with a gene",
            "In terms of bang for your buck, milk is fantastic of supplying calories for cost. It’s also subsidized in the US for that reason.",
            "I’ve actually broken my thumb and ankles. But when I was playing baseball in my teen years.",
            "He can just leave it for the countries with much less calcium/milk consumption that have stronger bones.",
            "I am looser than a goose. I can touch behind my feet while many can’t touch their toes. Haven’t had any issues with tight muscles but I’m still younger. Something to look out for",
            "It’s a great source of protein and I’m the same way at my dinner table. When I’m with family I’m always drinking milk. Weird enough though whenever I eat out I never get milk as a drink. I guess it just feels weird.",
            "I usually eat nothing or a small meal for break fast, no lunch and a big dinner. I also burn a bunch of calories too tho. If I didn’t move as much, I would probably be on the biggest loser show.",
            "Some of my friends agree 😂",
            "I haven’t tried it. That’s interesting I’ll have to look that up. I do like chocolate milk but really only have that maybe once or twice a year. I like the brand that comes in the tiny milk gallons that you can get in about every store in the US",
            "I drank it for 2 years because I bought it for the lactose free factor (my partner is lactose intolerant) and after realizing he was still affected I kept buying it just out of habit. I noticed over the last 6 months it has an awful fatty smell. Switched back to normal milk and there's no smell. Dunno how I never noticed before haha",
            "Probably by age 14 when my best friend who hates milk noticed how much I would go through. I really understood I was a phyco in my early 20s when I would go get a gallon of it if I was out no matter the time of day or time of night. If I’m craving it I’m getting it 😂",
            "Holy shit there’s a subreddit for everything! 😂",
            "I usually go with 2% because it’s the perfect middle between calories and taste. I have no really preference on brand as I find most milk here in the US tastes the same and I’ve lived in other states. Organic is by far the best tasting and it is very noticeable for some reason that I find hard to describe. My dad always had us drink milk during dinner and it just stuck with me. My grandma was the same way as me though and my family always found that goofy. We just love our milk",
            "According the weight guidelines height to weight ratio I am. But like a small full back or small NFL linemen type. If I didn’t do any physical activities I would be on the biggest loser. But I’ve been pretty active my whole life so I’ve never had any issues with weight… yet",
            "Only when it’s spoiled. I’ve also had milk in Europe and I hate it. American pasteurized milk is just better in every way.",
            "Me too, drank milk like a freak most of my life until it suddenly started causing some pretty hefty flatulence. I was honestly devastated haha, now I can only drink a little bit if I know I'm not doing anything/seeing people that night XD",
            "I was big on whole milk for a while but inevitably those extra calories can catch up to you. I usually go 2% also just to feel a little better about it.",
            "Actually about average. 6 feet on the dot.",
            "All good so far. I did see that as a risk recently but until that happens I’m going to keep drinking 😉 still young I guess",
            "I think it’s an inevitability that it is the future whether for good or bad. New tech always fucks some over for the greater good. Just how it is.",
            "I’m 6 foot and I fluctuate between 190 lbs -230 lbs depending on exercise.",
            "I’m actually taller than everyone in my family. I’m not sure milk has anything do with that but it couldn’t hurt when you’re growing for sure.",
            "I usually go with 2% these days just because cost and calories. I love whole and organic but prices and calories are even worse. Big a big nut milk fan. It’s too water for me and I really enjoy the creaminess that traditional milk brings",
            "There something about it that so refreshing, comforting, and dopamine inducing!",
            "I appreciate it. I usually go through the milk way before it expires. The only times I’ve dealt with bad milk is when it was already bad when I bought it. I can smell it from a mile away when I open the gallon. If it’s just starting to go bad I can tell by the slight flavor change and I just throw it out because I hate sour as a taste.",
            "Almost no food in over a month?  I’m curious if you can share more.",
            "To help reduce trolls, users with negative karma scores are disallowed from posting.  Sorry for any inconvenience this may cause.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AMA) if you have any questions or concerns.*",
            "Got Milk got me 😂",
            "I have not heard of that. What is it about?",
            "All good! Usually once a day in the morning. No issues!",
            "Usually once a day in the morning😁",
            "I definitely have a larger body. Especially my shoulders, chest and arms. But not like shredded or anything. I can cary large weights pretty well but I’m no body builder.",
            "To me it’s the most delicious substance on earth 😁",
            "Right now I weigh about 220 lbs or about 99kilo!",
            "I broke by thumb and ankle playing baseball in my teens but other than that, no issues in the bone breaking department!",
            "My beard grows insanely fast. I have those Viking genes I guess. Nails - I don’t really have a control to base an answer off of. If I were to guess I’d same they grow at a normal rate",
            " I drink a bunch of water though out the day. When I’m at home tho yes. It’s hard to explain. I’d say I get a rush of dopamine when I drink it. My body really like cold milk. I always feel refreshed after drinking it.",
            "Before you go to bed you CHUG a gallon of milk???",
            "Cookies, Pretzels, pie, and everything else😁 I would say minty food doesn’t go well with it in my opinion",
            "I had blood work done about a year ago with my doctor finding no issues. So far so good",
            "I don't think that is a necessary side effect from drinking milk. I drink about half a gallon a day for most of my life and I went from from being in the normal weight category nearing the underweight category before I joined the army to normal weight nearing the border of overweight according to BMI some twenty five years later. Drinking tons of soda which is more normalized in our society for most people is much worse for your health and maintaining your weight.",
            "At the moment 6 foot and weigh around 210 lbs. I fluctuate between 190lbs-220lbs depending on exercise",
            "6 foot",
            "This made me laugh 😂",
            "I drink plenty of water and haven’t really gotten sick except the flu from time to time",
            "For some of my friends too. Is it the taste or the texture for you?",
            "I am indeed taller than everyone in my entire family on both sides. My mom is 5”1 and my dad is 5”10. I’m at around 6 foot and that’s taller than my siblings and all of my cousins. I’m also the youngest child.",
            "I feel like I recover fast from extensive exercise than most of my friends but that’s about it. I have no clue if it’s linked but that would be my guess.",
            "I have had like 5 pimples in my life time and that was mostly while playing football thanks to the chin pad. I got really lucky in the Derma Department",
            "That’s how most of my buddies were. I get sad when I open other people’s fridges and there’s no milk in there but I get it. Most people become lactose intolerant as they age.",
            "Bingo, as long as your active wiegt is much a problem. Especially while the metabolism is still firing on all cylinders",
            "No stones yet but I do drink a bunch of water also furring the day. I’m sure this won’t last forever",
            "6 foot and I fluctuate between 190lbs-220lbs",
            "“Born in it” 🦇",
            "No currently I’m more casual these days but I used to about 4-5 years ago",
            "I have about a year ago. Everything was normal and healthy in my doctors eyes.",
            "I haven’t just because that’s a lot of liquid very quickly. But I have totally thought about how I’d do it. I’d go into the challenge very thirsty and drink half the gallon in the first 5 minutes. Then I’d finish the last half in the last 10 minutes.",
            "Haha. I realize it weird but I don’t feel shame for it. I cracked my thumb in baseball and ankle but other than that no issues. I once fell down while skiing and everyone thought I should have been fucked up from it but absolutely nothing broke.",
            "I usually drink it throughout the day. I would say 1/3 in the morning and 3/4 after work.",
            "No issues on smell. I usually take a shower everyday and always wear deodorant. I have a friend like that too but he just doesn’t wear deodorant. I’m very smell conscious",
            "I never really cared about it tbh. It’s not something I really think about",
            "They used to buy a bunch for us. I grew up in a family of 4 boys(including me) and a sister. We went through a lot of food and drinks! XD",
            "Haha I like that you mention Indian people. My step mom is Indian, she raised me, and that's how I got really into drinking lots of organic whole milk",
            "I’ve tried the classics. It all tasted too watery. I like the creaminess that dairy brings. I have nothing against people who do choose those options. It just doesn’t hit the same for me.",
            "1. They can for sure. There are times where I have to leave the room I let it loose in. Other times no smell. It’s kinda random.\n\n2. I wouldn’t have an answer for you on this…😂\n\n3. If I don’t use deodorant and wash for sure. I’m very ocd on my smell though. If I can smell me I do something about it.",
            "I laughed hard at those scenes when he’s drinking a glass. I watch The Boys with my buddies and they always point it out when we’re watching",
            "There's a local creamery near me that makes milk and a bunch of other dairy products. They aren't organic but it's the best milk I've ever had. So good!\n\nHow do you feel about half and half or heavy whipping cream?",
            "I worked at a grocery store one summer as a teen and I was stocking the milk and a lady grabbed a gallon and said \"Did you know the brands are all the same? I manage (local darigold plant). even the expensive stuff is the same.\" and walked off",
            "If you really drank that much milk youd easily tell there is a difference in milks..I rarely drink them and even I can tell a big difference in milk brands",
            "I put ice cubes in milk and my family rags on me endlessly for it. Icy cold milk is peak!!",
            "I have wondered that too. Anecdotally it does feel like there's a slight slow down. I'm still pretty active but can't just shovel calories all day in the same way I used to be able to.",
            "Milk is loaded with sugar lol.  \n\nA gallon of milk is only a little better than drinking an entire 2L of coke.",
            "You are fucked lol",
            ">So far so good on health \n\n\n\nYea because you are young. You are in for a huge surprise in your 30s.",
            "Do u switch up gas stations each time? Or r u just known as 'that milk guy' at the one station you buy 7 gallons a week from",
            "Cheaper than other addictions!",
            "Probably cheaper to just buy a cow at this point",
            "I always think about a typical gallon of milk coming in for much less than my regular Starbucks. Not that expensive really.",
            "Technically price per calorie a gallon of milk isn't bad at all. You're definitely not spending more than most others would for the same amount of nutrient+caloric intake.",
            "Why not Costco?!",
            "Bro 3 tall glasses *is* a meal lol. I think I would vomit if I had that + a full meal at the same time.",
            "your body can handle this sort of intake until it can’t. it’s similar to people who eat a lot of salty foods. they don’t notice the effects right away but overtime it fails to compensate, leading to high blood pressure. \n\nit’s the same with sugar. except instead of your kidneys, which regulate salt, it’s your pancreas that gets affected as it regulates sugar. and by regulate, i mean that when your blood sugar is too high, your pancreas releases enzymes that decrease and store it. when it’s too low, your pancreas releases enzymes that increase it from those previous stores. \n\nyour pancreas is able to handle it until it can’t. your body becomes resistant to the constant stream of enzymes. it’s how people develop type two diabetes. \n\nmilk also contains an abundance of calcium and sodium. way more than your body needs. people might think that’s a good thing. but it’s the same thought process that leads to people overeating vitamins thinking it’ll make them a lot healthier. (for example, vitamin A over-supplementation can lead to fatigue, blurred vision, nausea and long term can cause balding, liver damage, and high intracranial pressure). high calcium can lead to certain types of kidney stones, bone pain, pancreatitis, anxiety, depression, muscle conduction issues including cardiac arrhythmias \n\nthis isn’t going to happen all at once. your saving grace is that you are still young. our bodies lose the ability to regulate its own health overtime. \n\nsource: third year medical student",
            "208g of sugar just from that...you should protect your health before it's a problem as you age.",
            "height and weight? age?",
            "Or you’re just young. \n\nPeople don’t have health effects from cigarettes right away either. Or cocaine.",
            "Did your grandma have any adverse health conditions?",
            "Subsidies are for the dairy farmers not for us.",
            "ahh that’s probably why they give me so much because i’m breastfeeding twins. i donate the milk i don’t use which is usually 3.5 gallons at least😂",
            "To think I was going to invite you to r/neverbrokeabone",
            "Wait until you’re in your 40’s and you can’t turn your head without turning your shoulders.  Or, better yet, don’t wait that long.\n\nYour muscles [use calcium to contract](https://youtu.be/ibSU6DoAbqs) and magnesium to retract, so too much calcium causes them to stay contracted.  Keep in mind your heart is a muscle too, and you can also get calcium plaque buildup in your veins and arteries.  Plus dairy is an acid, which actually causes your bones to [leech calcium](https://saveourbones.com/osteoporosis-milk-myth/).",
            "You wont have problems until you do",
            "We always did a glass with dinner. My parents and grandmothers learned not to pour me my glass of milk until I was ready to chug it because I didn’t like the taste unless it was cold ? And if I was eating the glass would get lightly uncool and become this big thing I would sip it forever and warm it more in my hands and struggle lol kids man",
            "You are really dumb if you think you are burning all those calories off. You can't outrun eating. ",
            "Lmao damn. You're just out here living your best life. I actually grew up enjoying milk. I would probably have about 3 glasses a week with sweets along with the occasional bowl of cereal. Then as an adult cheese started making me sick so I significantly reduced my dairy intake. Now I mostly drink oat milk instead.\n\nYou must have the opposite of lactose intolerance or something lol.",
            "There are more of us! We aren’t alone anymore. Lol",
            "I love 2% too!  I don't drink as much as you do, but I go through a couple gallons a week and 2% is my only choice, it is so refreshing!",
            "So I'm guessing you're huge since you avoided answering the weight question",
            "What about the first question he asked?",
            "Follow up, whata your 3 lift total breakdown?",
            "That’s so interesting. Was it the long life milk, though? Seems much more common there but I found the fresh milk was the same as what I’m used to (in Australia). The UHT stuff tastes weird to me",
            "I stopped drinking it for over a year, it would give me really bad pains in my lower left side.  That’s when I started drinking fairlife since it lactose free.  Only reason I drink the whole is because it taste the most like 2%.  Their 2% tastes more like skim milk",
            "Whole is recommended! Fat is your friend bro",
            "that's not average, the average adult American male is 5'9 and average adult American female is 5'4\n\nu/Flynn_JM",
            "Organic? Whole? Skim?",
            "thank you milk man for the insight",
            "Im surprised you dont weigh more. Your body must be a furnace lol",
            "I would die if I had to stop drinking milk...",
            "Basic strength training. Squats, bench, deadlifts, overhead press. 3 sets of 5 reps. Try to add 5 lbs every week. I mention it because one of the things in the book is GOMAD(gallon of milk a day) for bulking.",
            "like 6lbs per sitting or what?",
            "🤢 have you thought about how a you get that milk?",
            "Does your doctor specifically know about the amount of milk you drink though? You need to tell them, if not. This habit is *wildly* dangerous and unhealthy for the long term and it will eventually catch up with you. Tell your doctor so they can keep an eye on this. \n\nLike you clearly have an addiction to this stuff and I know it isn't as simple as \"just stop doing that\", but I really really hope you at least haven't bought into the myth that milk is actually good for you? This isn't doing anything at all for your health and falls into the category of a vice - as if you'd told us you drink a 2L of coke or smoke a pack a day or have a whole birthday cake for breakfast every morning or stop at McDonald's for two big macs and a milkshake every evening after work. \n\nNot that these are precisely equivalent or that they'll all do the exact same thing to you, but the gallon of milk falls into the same rough category as these others, of \"junk that will eventually hurt you.\"\n\nThe cost will come due, at some point for your future self. *Please* seek help from your doctor.",
            "Kidney stones were no joke. I never thought about them at all until I got them. They hurt so bad I changed up a lot of what I ate and drank and never looked back.",
            "Both I guess? I don't like anything about it. Haven't touched it in over 20 years lol",
            "I too am the youngest. My dad is 5’9” and my mom is 5’5”. Two of my brothers are 5’10” and the other is 5’9” and I’m 6’2”.. my mom thinks it was the bovine growth hormones lol.",
            "Well keep up the water and maybe next checkup ask if there's any unusual sediment in urine. Anyway, I love me some cold milk too! Good luck!",
            "And you told said doctor your diet is primarily made up of 2400 calories worth of milk consumed daily? Or did you leave that detail out, lol?",
            "That's what I'm talking about lol. I fractured a finger in football and that's the extent of my breaks. Grew up farming, had many run ins (or overs) with cows, atv wrecks, you name it. Just Strong bones haha",
            "He definitely wore a boatload of deodorant, could always smell the milk straight through it though. That’s wild\n\nThanks for the answer :D",
            "Silk soy milk is just as thick as regular milk (if not thicker), and actually has a bit higher protein content and a bit lower caloric content if I remember correcrly.",
            "If you haven’t tried Oatly full-fat oat milk, give it a try. It’s pretty damn good.",
            "I loved trying the little half & half cups in diners growing up in jersey. So good!",
            "Love it in my coffee but I’ve never actually took a swig of it from the bottle. I will say that French Vanilla is so damn good on it own and in coffee",
            "\"makes milk\"",
            "Milk has a much better protein to carb and fat ratio than the average American diet by far. 2L of coke is pure sugar. \n\nThese aren't even close to equivalent.",
            "I mean, it’s significantly better come on",
            "No way. Coke is acidic too, making it worse for teeth. ",
            "User name checks out",
            "Source?",
            "Uhh it doesn’t work like that",
            "For sure! I haven’t ever really had a six pack but I’ve had a strong big guy look kind like a small NFL linemen or fullback. Not too thick but also not too chubby if that makes sense. It also has a lot of other things in it too that the body loves. I’m not quite sure how true this is but I’ve heard that people can survive on just milk and dates (the fruit).",
            "Sugar doesn’t cause diabetes…",
            "If your addicted to a white substance milk is the way to go.",
            "With out a doubt 😂",
            "I have considered this more times than I’d like to admit. Unfortunately I don’t have the same for it 😂",
            "Nope. Milk is a low-margin product produced at scale and also heavily subsidized. Having and maintaining your own cow will be way more expensive even in expenses, not even counting labor.",
            "Exactly! Lots of calories, protein, and other things your body needs in a $3-$6 gallon",
            "Yeah, it's obvious this post is fake. All y'all smooth brains falling for it",
            "The fact that i dont see it weird and i do the same sometimes, while so many dont, it worries me.",
            "Literally. I used to have days in college in which solid foods absolutely repulsed me, so my lunch/dinner would be a 20 ounce glass of milk and 2 20 ounce glasses of fruit juices of different types.",
            "Dude's gonna have osteoporosis, diabetes, and kidney stones by age 40\n\n\n\nsource: I'm not a med student but trust me bro",
            "Pancreas? I think you mean liver.\n\nThird year medical student? Really?",
            "Omg. I had no idea there was that much sugar in milk.",
            "They have been asked for height/weight multiple times and have answered other questions from the same comment yet skip that one every time 🤔🤔🤔 makes ya think dude. Makes ya think.",
            "Could absolutely be correct. I know I won’t be able to this forever",
            "Dude is chugging down the LeBron's monthly calcium intake everyday and still have such puny bones.\n\nTruly despicable.",
            "Can't you just track your calcium serum levels over time?? And milk is barely acidic, what like 6.5-6.9? 7 is neutral. I get the feeling you think you know what you're talking about but you really don't know shit. Also milk is high in protein so you could need extra calcium. Here's a link to an actual source and not some .com website:\n https://pubmed.ncbi.nlm.nih.gov/12936953/#:~:text=High%20dietary%20protein%20intakes%20are,absorption%20or%20serum%20parathyroid%20hormone.\n\nAnd as you age you're wayyy more likely to need extra calcium than not. Especially for women.",
            "There was a study that showed increased cancer (was it pancreatic?) from anything more than a few cups of milk a WEEK.\n\nHe's going to have problems rather quickly",
            "Same. For dinner our drink options as kids was iced tea, water or milk. Always went with that ice cold glass of milk. Still do sometimes as an adult.",
            "his TDEE could be 3500-4500kcal. Depending on activity levels, weight, muscle mass and height this is very possibly the case with this guy.",
            "Milk drinkers inite!",
            "I’ve seen it avoided a few times in the thread haha. Dude must be faaaat. But no adverse health effects, of course, lol.",
            "I’ve answered on other people’s questions. I’m 6 foot and fluctuate between 190lbs- 220lbs",
            "There was something about European milk that tasted “raw” and almost more buttery. I think they just do things differently there. Also sour yogurt is a war crime or something! It’s like preferring to drink sour milk. 🤢 it does last a while but I usually always go through before it even has a chance to think about spoiling.",
            "A gallon of 2% milk has close to 80g of fat. That’s 720 calories just from fat in a day. He’s good.",
            "In order of preferred: organic (hands down but very expensive), whole (delicious but a lot more calories over time), and 2% is what I usually go with these days. Skim is a joke. Watery milk is no bueno",
            "Funny you say that, I’ve always had an above average body temperature. I’m always warmer to the touch to most other people",
            "I’d be very sad and have insane cravings. Kinda like Woody Harrelson in Zombieland with his quest to find Twinkies!",
            "I do lift and have a laborious job so I usually stay stronger from those. Thanks for letting me know about this because I have a buddy who has been desperately been trying to put on weight. I’ll send him a link on this!",
            "I do think about who was the first person to try it out on a cow😂",
            "Steals it from babies.",
            "and has zero sugar, just takes some time to get used to",
            "Seconding this because omg it's so good.",
            "Oat Milk in general is the best for moving from cow to plant milk. It's so creamy! My favorite is Alpro Not Mlk, I don't think it exists in the US, though.",
            "Yeah I used to down like 7 of those when we would go eat 😂",
            "Half and half is super creamy. It makes an amazing chocolate milk, but it's heavy in fat and expensive to drink this way. I still do from time to time.",
            "while it's true the impact on glucose levels and insulin isn't nearly as harsh as pure cola, the milk has other issues revolving around the lactose amount. That lactose is split into glucose and galactose, the latter of which has a host of potential health implications.",
            "What is significantly better? I only drink water. I'll use 1% or 2% milk for certain cooking recipes, but that's it.",
            "Be careful. I was like you at this age with a big strong physique also drinking a gallon a day. That shit caught up with me and gave me the biggest pregnant belly ever. I'm 38 now and still actively dieting trying to lose it. I don't drink a gallon a day anymore but I do indulge every now and again. Milk is my addiction but it also gave me diabetes and has killed my body pretty bad. Just consider cutting back.",
            "Okay. But my point is that you have a family history of diabetes and you're consuming almost double the recommended sugar intake *every single day*. Not just sometimes but all the time. \n\nIt's absolutely crazy. As far as it's nutritional value? It's fortified with essential vitamins and contains other necessity minerals (sodium, calcium, potassium). It's high in protein and has some fat (assuming non fat free). As something to consume, it's decently healthy minus the large amount of sugar. Though it's lactose which is galactose and dextrose. So the glycemic index is lower than something with sucrose or glucose.",
            "Reminds me of my dad pretty much lol.  He has always been big, but never really obese.  He has ran his landscaping business and stayed pretty active, he played sports all growing up and even a bit in college.  Drinking a gallon of milk a day is kinda crazy but he was also primarily eating fast food, drinking huge gas station slushees, like the worst food imaginable.  A few years ago he kept telling us his toes and fingers were tingly and he went on like that until he went to the hospital and his blood sugar was over 400.  I really think it was soda, slushees, ice cream that did it to him faster then the milk but the milk probably did a bit lol.",
            "No, just drastically raises the risk of Type 2 Diabetes",
            "Cum consumers seething",
            "Coke might be healthier lol",
            "[removed]",
            "I'll drink a gallon to myself about every 3 days and nobody else in my family drinks it. I fucking love milk I get actual cravings for a cold glass at some point almost every day.",
            "And a lot of estrogen you don’t need because they put estrogen into the cows because they yield more when their bodies think they are pregnant. Milk is actually terrible for you.",
            "If I didn't have the funky guts all of the time I would go back to my love of milk.",
            "it's why I've moved to drinking almond milk. It took some time to get used to, but it's enjoyable to drink now",
            "Hes 6'0 and fluctates between 190-220 lbs",
            "osteoporosis",
            "I'm going with this post is fake , you all will believe anything these days",
            "That's a crazy fluctuation\n\nAs a 33 y/o male I'm guessing you will start to blow up soon as your metabolism slows",
            "Skim milk is straight up disgusting",
            "Regardless of what you drink or do, drinking a gallon of coke is much worse than drinking a gallon of milk ffs",
            "That’s most likely the way to go. I’ve definitely heard it once or twice from friends 😂",
            "A gallon of 2% has like 5 times the recommended daily value of sugar for men afaik.",
            "I’m not here for a long time, I’m here for a good time if you catch my drift 😂",
            "Completely false. Literally just Google it. Being overweight for your body and age are the two biggest risk factors for Type 2 diabetes. You can get fat from eating too much meat too.",
            "Cumsumers",
            "Maybe If you live in the Andes mountains",
            "To help reduce trolls, users with negative karma scores are disallowed from posting.  Sorry for any inconvenience this may cause.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AMA) if you have any questions or concerns.*",
            "Yeah, that's about my level - a gallon every 3 days or so. I love milk. 🙂",
            "Me too. In college, I had actual dreams about milk when I was hungover. I drank a lot of milk my whole childhood until I was 23. I was fit, a swimmer, and I ate pretty healthy, but Id go through about a gallon in 3 days too. \n\nGot a new doctor who ran a blood panel, and my cholesterol was in the 300s. Beginning of the end of my milk binging. Now, it's a treat in a homemade smoothie after a workout, and I have regular shots to control cholesterol. I'm probably the exception, but make sure you're taking care of yourself!",
            "Drank milk all my life. 50 years old. Not one single health issue from drinking milk. Gaslighting is what you are doing.",
            "No, different study... This one linked to a type of cancer",
            "It isn't fake you are just not educated. When I weight train I do a gallon of milk a day. It helps more than you would believe for growing muscle, especially if you get stuck at a plateau. To gain weight at 6'2 with no steroids I would eat around 6-8 thousand calories a day on average. And even then the weight gain was slow. Maybe 7ish lbs a month of muscle. But I'd see significantly increased lifts. Even when I'm not lifting I still drink about 1/3 a gallon per day just because I need extra calories in my diet to not lose weight.",
            "Well the gallon of milk is like 9 lbs by itself",
            "It’s practically white colored water 🤢",
            "Diabetes isn’t a good time",
            "why are you getting down voted.  everyone is gonna die eventually.",
            "Literally just googled it. Every source says \"sugar raises the risk of Type 2 diabetes.\"\n\nWhen you're constantly consuming sugar throughout the day, your pancreas is working constantly throughout the day to metabolize that sugar. This can lead to insulin resistance --->prediabetes--->Type 2 diabetes.\n\n[https://www.uhhospitals.org/blog/articles/2023/03/can-eating-too-much-sugar-cause-diabetes](https://www.uhhospitals.org/blog/articles/2023/03/can-eating-too-much-sugar-cause-diabetes)\n\n[https://health.clevelandclinic.org/can-you-get-diabetes-from-eating-too-much-sugar](https://health.clevelandclinic.org/can-you-get-diabetes-from-eating-too-much-sugar)\n\n[https://www.healthline.com/nutrition/does-sugar-cause-diabetes](https://www.healthline.com/nutrition/does-sugar-cause-diabetes)",
            "It’s not gaslighting. Let me ask what’s your BMI? And you think your health issues aren’t from drinking milk, but I don’t think you know enough about nutrition to actually know what you’re talking about.\n\nThere is no other animal on planet earth that consumes another animal’s lactation. It is not healthy in any way, it’s completely unnatural.\n\nDo you even know what estrogen is? How they deliver it? It’s a wax pellet they place in the cows ear and it’s making you fat. Your diet has way more effect on your overall health than most doctors even understand. It’s an extremely under appreciated field. Do you even know what keto acidosis is? \n\nScience is not gaslighting but proclaim you’re healthy like Donald Trump is.",
            "both bad from over consumption of the cow leak",
            ">7ish pounds of muscle per month \n\n\n\nDude that's a newbie's year worth of gains. Advanced lifters aren't sniffing 7 pounds natty in a year 😂",
            "Weight training for a time is very different than drinking a gallon every day for a decade. You are very dumb if you can't see that. ",
            "Holy shit",
            "Lmao, that's true",
            "Yeah but the white colour also tastes nasty",
            "Gonna be hard for OP to have any semblance of a good time with no feet ",
            "From the go sentence in your first resource: “You may have wondered if eating too many sweets can cause diabetes. The simple answer is no.” \n\nI just think it’s more complicated than “too much sugar=diabetes”",
            "Damn you lost me in the last sentence",
            "Is this true for organic milk as well?\n\nEdit: quick google search says no extra hormones in organic milk. You prob should specify, but at least I fact checked something today.",
            "Yawn...you still failed to provide any evidence. I am actually quite thin. No excess body fat. Show me the peer reviewed studies, the surgeon general warnings, the actual facts. I bet you're just a kale munching wet paper bag that pretends to know more than actual doctors.",
            "They gotta drink that miiiiiillk. But yeah in all seriousness being 20 was a HUGE part of that.",
            "If you read enough of the post you would see that OP has a very physical job. Would you rather he drinks Gatorade and protein shakes? I'd say milk is healthier, there's great macros and micros",
            "Keep reading, friend.",
            "I’m in no mood to deal with a boomer who uses their age to try and take upper ground in intellectual exchange.\n\nAnd it’s moronic. There’s people who live to a hundred who smoke cigarettes every day. Every human body is different but in general if you smoke a pack a day you will get lung cancer. This guy is coming at me with “I’m fifty so I know everything” bull 💩. Being old doesn’t make you smart and just because something hasn’t happened to you doesn’t mean it’s not going to.",
            "Organic milk is much healthier, there’s also other factors like pasteurization, the cows diet, if the cow is pregnant.\n\nLook I’m not saying milk is going to kill you. Obviously not. I’m drinking a frappe with milk in it right now. But drinking a gallon a day is truly awful for your health.",
            "Wait you just used the fact that you are fifty and never had a problem with your health (anecdotal) and now you have the balls to sit there and expect me to google this for you? No. I’ve done my research I’m not your 🐩. Grow your own brain dip 💩. It’s not my job to hunt down information for you. I don’t care I’m not in the mood for a fifty year old d bag to condescendingly type “yawn” at me.",
            "If you think the post is real, LMAO",
            "If you’re mad just say that"
        ]
    },
    " I have been married for almost 10 years, sex with my wife has gotten better every year, AMA! ": {
        "title": " I have been married for almost 10 years, sex with my wife has gotten better every year, AMA! ",
        "score": 323,
        "url": "https://www.reddit.com/r/AMA/comments/1dlbuna/i_have_been_married_for_almost_10_years_sex_with/",
        "content": "",
        "num_comments": 256,
        "comments": [
            "Over the years did you have ups and downs in your sex life? And do you feel like sex gets better because you're just getting better at sex, or because your relationship is stronger, which in turn makes the sex better?",
            "My girlfriend of 3 years and I went through a phase where we had sex maybe 3 or 4 in the span of about only 3 months. I’m hoping this is because I’m in law school and maintain a full time job and she had a preliminary exam for her PhD. Then she left right after to visit her family. Our relationship seems fine but I’m worried the sex won’t be the same when she arrives back in the States. Did you experience lulls like this?",
            "Me and my other half have been together 11 years. No kids but we live with my parents, and private sexy time is hard to come by.\nHow can I let him know I still desire him even when we can't get time alone?",
            "Just wanted to say congratulations on your happy marriage and I hope you both realise how lucky you are. Bloody awesome to read about.",
            "Sorry not a question but I've got some good news for you.   Been married 20 and it's still getting better so you got nothing but green pasture ahead my friend!",
            "How often do you have sex?",
            "What are the things you do to ensure it gets better?",
            "You get that hawk tua?",
            "What's a usual session look like for you two? How do you find time with kids?",
            "Do either of you have mental health problems?",
            "I've been married for 29 years. I'm 49(f) husband is (54) and we're banging away every day and it has gotten better as we've gotten older. I attribute having sex every day to my husband being on TRT, so that makes him quite horny all the time",
            "what year did she start peggin you?",
            "How did you meet eachother?",
            "Congrats! My wife and I are in a similar place. Married 17 years and the sex is better and more frequent now than in the first few years. It’s a good place to be, helps stave off the existential dread.",
            "Have you stayed faithful to each other all these years or has one or both of you slept with others?",
            "Refreshing and great for this sub.  Congrats op.",
            "Screw you guys",
            "Not married, but currently engaged. Fiancé blew my mind with her performance last night, so I always try my best to rock her socks off.",
            "Your wife is watching this AMA isn't she champ?",
            "Arnt you lucky",
            "Do you like your eggs sunny side up?",
            "Have you both done anything to spice things out from time to time?",
            "You won the lottery.",
            "Congratulations! What do you attribute it to?",
            "I love this for you two.",
            "What new things did you introduce that she was initially reluctant with but then ended up loving?",
            "I need this post. Ty for posting",
            "Have you ever suffered from medical issues that affected your sex life?",
            "is your wife your hand",
            "How do you sleep at night?  /s",
            "I honestly don't want to know",
            "It makes me happy- genuinely happy, to hear about other couples, that are about our ages, having strong marriages and great sex. So many of us got fucked up by our own parents’ nonsense that it’s kind of amazing that we’re normal enough to have healthy marriages.",
            "🤛🏽 hitting 9 yr mark and totally feel you on this homie. Ya'll must have incredible communication",
            "We've been married for over 20 years and together for nearly quarter of a century. Although it's not as frequent as when we were young. I think our deep understanding of each other and thousands of times we've been intimate together, means we know exactly how to satisfy each other fully.",
            "Did you have a child before marriage? If so, what do you do if you have a child before marriage then all the sudden your girlfriend says she doesn't wanna have sex until marriage?",
            "What does she like the most?",
            "I’m curious about your screen name. What makes you a sick boat dad?",
            "Congrats!\n\n25 years and same for us.",
            "Is this woody from pka😂😂",
            "Have y’all introduced a 3rd/swap?",
            "Do you eat her ass? I’m genuinely asking because i’ve started doing that lately at last (together 17 years since high school and we have a toddler with next one on the way) and it’s definitely something she likes a lot although never asked for before. It’s a game changer and the fires been burning a bit more intense since that decision.",
            "We’ve been together 24 years and married 19. Sex is amazing and keeps getting better. 3-4x weekly for the most part. Sometimes it’s 1, other times 5-6.",
            "I've been in love with a woman for 9 years, we've been dating for almost a year, but we've never been intimate. I'm a female, also, but still... any advice for someone who would like to offer a stable and open environment to someone who is too shy?",
            "Do you have a favorite TV show that you watch together?",
            "What's your signature move? What's hers?",
            "You lucky bastard!!",
            "I(53m) and my wife (50f) have been together for 34 years. We are having more and better sex then when we were in our 20's. I can't even describe how close it has brought us together. Being as sexual as you two are, do you find you have less arguments and do you feel closer?",
            "Fuck you bro.  Just fuck you.\n\nAlso, congrats.",
            "What's your biggest advice on maintaining a healthy relationship?",
            "Let me guess, no kids?",
            "Can I have sex with your wife?",
            "It definitely gets worse over time. Shorter, less frequent, worse quality.\n\nJust scratching an itch at this point",
            "Get a Footjob yet?",
            "Does her shape affect your desire, if she gain/lost weight? What does she do that blows your mind and starts the fire in you? ❤️‍🔥",
            "You married a dude.",
            "How old is she",
            "Can't up vote this enough",
            "did your sex life start really good?",
            "Training for stand up comedy?",
            "Have you involved others in your sex life? If so, how?",
            "Weird question, are you religious by any chance? Or each other’s first sexual experience?",
            "Do you guys listen to music when you have the sex?",
            "Ya right",
            "What would you possibly want someone to ask you from that? Does she sloppy on your toppy? 😳😳😳 Does she goolup your balloop? 😩😩😩 Does she feetnut on yo peanut? 🥵🥵🥵",
            "1. Do you use a penis pump? \n2. Do you use Viagra/Blue chew/hims/ gas station boner pills?\n3. Does she peg you? \n4. Do you enjoy being pegged? \n5. Have you fisted her yet? \n6. What is her kink that makes you completely uncomfortable but you still do it?",
            "That’s a lie … sorry can’t believe this post",
            "How many times have you cheated on her?",
            "I agree. Your wife smashes like a beast. We all think so",
            "Do you guys do butt stuff",
            "Ever had a mfm or ffm?",
            "Do you guys do anal and ass2mouth? ",
            "Was she fat when you first met her?",
            "Check your chat messages if you'd like 😁",
            "I think the relationship has improved, which makes the sex more special",
            "Yes of course. After child birth is tough, being tired from young kids is tough.",
            "It won't get better.\n\nYou already experienced the best sex you'll ever hsd before your wedding night.  Fact",
            "You sure your girl is seeing only you? I don’t mean to be rude, but you seem to be rationalizing for her. Exams and jobs don’t have any effect on a woman who has the hots for you. Of course, she may also have lower sex drive…",
            "I would just tell him? We had a rough patch for a while about who should initiate. Now we just say, \"so should we bone,?\" Or my wife will walk by in a fishnet or other whore outfit-- pretty clear",
            "Thanks",
            "Green and wet I hope",
            "5 to 7 times a week, on average. I don’t do period sex.",
            "Listening to each other, getting to know each others bodies.",
            "Thank you for this",
            "Usually go down on her, then slide it in. We wait until they sleep. Lock the door. On work from home days we try to bang one out on lunch break.",
            "I mean we are both attorneys....",
            "Wife is 41, I’m 42- y’all are our goal.",
            "Heck yeah",
            "lol she hasn’t",
            "Who shit in your weetbix mate?",
            "In college",
            "Yes faithful",
            "Well they’re definitely getting  screwed",
            "No, she doesn’t have Reddit",
            "Lingerie, some toys",
            "The improvement? I think as life get busier we treasure it more. Before kids and while dating we would bang just as something to do.",
            "Standing positions and deeper penetration",
            "Does diarrhea  count?",
            "Not any more",
            "With drained balls",
            "Getting more blunt all the time",
            "Old people fuck right",
            "I have a boat, am I dad… my kids say it",
            "Be open and honest about what you want from this person. \" I care about you in ___ way and I would like to explore our relationship by doing ____ with you, would you feel comfortable with that?\" See what their response is. If they aren't okay with that, reevaluate what kind of relationship you would like to have with this person, or if they are the right person for you, or if you are just infatuated with someone who isn't into you as much as you are into them. Life is too short to just be hanging out with someone who doesn't see you as an ACTUAL romantic partner. Esp. as a queer person imo..",
            "Not to hop onto your question...first of all, congrats on moving forward with a relationship with someone you've been in love with for years - that usually doesn't happen! Secondly, you've never been intimate in a year of dating because she is shy? Is there any romantic affection - kissing, making out? Do you guys talk about being intimate - like she has a goal of wanting to be or she outwardly says she wants things to stay the same always? Maybe she's asexual? \n\nMy only advice would be to talk very openly about your wants & needs, and vice-versa and try to start very slowly with more intimate encounters - if she's open to that. \n\nGood luck and congrats again on finding the love of your life!",
            "Not currently",
            "You'd have to ask her, her power move is riding me with her feet on the bed",
            "amen",
            "Same amount of arguments but we realize they are silly and a time waster faster.",
            "I gotta preserve my seed, but thanks lol",
            "Talk about it, don’t go to bed angry.",
            "4",
            "No",
            "Maybe you’re doing it wrong?",
            "There are some great sex positive YouTubers helping guys improve their game with women.  Look up things like “how to clitoris” ok not grammar but on YouTube thatll work",
            "I have not sir, cannot say I am interested lol",
            "Reddit gonna Reddit",
            "She’s gain weight from giving me four kids. It’s the enthusiasm, sucks with love.",
            "36",
            "I thought so!",
            "No",
            "No, besides talking about it",
            "We are now. No I’ve had about 70 partners before marriage.",
            "No we have different tastes",
            "Yes, unclear, unclear but not opposed",
            "No to 1-5, sometimes I take testosterone shots. Haven't found 6 yet.",
            "Yeah, 5-7x per week with 4 young kids and all their activities?! Not saying it ain’t possible. Just have a hard time believing it.",
            "Zero times, proud to say. There isn’t a desire.",
            "I get turned off if I think I’m hurting her, so no. We have but not recently. Once she was so wet I was able to stick it in her butt no lube, that was hot. Hard to replicate that.",
            "Say NO to anal.  It is an exit only. 🙃",
            "Not since marriage",
            "We do not",
            "No",
            "What you've got, is what everybody wants, whether they know it or not! I'm hoping I'll one day meet a man who fulfills me in this way!",
            "They’re right what you have everybody wants. I hope you appreciate that and continue to grow stronger. As you get older, it even gets better. Much older than you and sex in your 40s 50s is great. And having somebody that loves you and knows you and a family is probably one of the most special things you can ever do. I wish for your family to have all of this and more thank you for sharing your story.",
            "Do u put it in the pooter, or vice versa?",
            "Hahahaha you made another account just to troll people that’s so pathetic. I pity anyone you has the misfortune of knowing you or being related to you in real life",
            "You clearly have never been in a PhD hahahahaha",
            "Exams and stressful jobs do effect women. I fancy the pants off of my boyfriend but when work is eating me alive, my sex drive dies off.",
            "Whore outfit 💀💀 that got me",
            "Hahahah I love the way this was worded😂",
            "@sickboatdad is that your preference or hers? Have you tried it and not liked it or is it just not something you’d like to try?",
            "Buy a red blanket and keep it under the bed!  You won’t regret it.",
            "I also detest period sex, however, on light days, a menstrual disc blocks it all and it only got out of place once. Not saying you have to, but your lady could check it out if she’s interested.",
            "[removed]",
            "Great to hear and congrats! Have you ever tried experimenting with other things? Like tots or other people?",
            "Exactly this!! I’ve been married for 12 years and it just keeps getting better. Communication and exploring are key.",
            "Getting paid to do it at home is great isn’t it? My job is too urgent to sneak away for the time but my husband has probably made a good amount gettin paid to bang 😂",
            "So….yes",
            "Both my parents are attorneys. They divorced and had the most wicked fight over money. Now I’m in EDisovery. Money kills!",
            "that is not an awnser to that question",
            "In our 60s, nearing our 40th anniversary. Things will keep getting better.",
            "No time like the present!",
            "What year",
            "So not a whole lot of variety! Nice to know pleasure can just be simple.  Any fave toys?",
            "Thanks. Yes, the improvement. Do you think your knowledge of each other's pleasure centers helps as well? Like you guys are \"veterans\" at this thing?",
            "Reluctant to standing? And deeper penetration?? Geez how vanilla was it at the beginning?",
            "Depends on how long it lasted, I guess.",
            "You are awesome and I hope it’s greater than it sounds.",
            "Fuck yeah dude. I'm still a horny old bugger. To be fair I'm not all that old. Not over 50 yet.",
            "That’s awesome. What are activities you guys do. Like fishing ? Tubing? Etc",
            "You the man!",
            "I definitely am. I know how to do it right though.\n\nWe let it slide over time. Not feeling motivated to pull it back.",
            "You never sucked your wife's toes?",
            "Try it. You’ll like it, as you’re massaging her legs she massages you.",
            "62 MF I have to agree with you!  It gets even better when the nest is empty. Been married 42 years still go every day.",
            "got better in what way?  Frequency? Intensity?  Experimentation?",
            "70 that’s crazy… how about her?",
            "I think this is not a red flag in any way. I like that my husband has a history. It is experience, practice and it makes him really good at what he does. We have been married 8 years and I think it keeps getting better as well. I think your earlier comments about communication was dead on",
            "What music do you like and what music does she like?",
            "Be very careful with not following a regimen for TRT, you could be messing up your own production",
            "Foreplay during the day, quickies, structured routine for the kids, prioritizing sex over tv/doomscrolling/etc, it’s entirely possible! \nOP- how do you prioritize sex?",
            "There are many couples who do this.  Start searching “couples sex every day\nIt is a thing",
            "You’re a lawyer. Of course you cheat on her. How many times?",
            "Much discussed regularly on here.  Factions have strong opinions on both sides",
            "Why not? ",
            "Rarely, no",
            "Seconded.",
            "I guess she’s the first person to ever do a PhD. Keep on believing whatever you wanna believe.",
            "My preference, Not a blood guy.",
            "Nah",
            "The content you posted is harassment/hate towards other users.",
            "Hope you feel cooler after commenting this",
            "Gimme some of your tots!!",
            "If not with you, then with who?",
            "You guys’ lunch breaks are paid??",
            "It is nice",
            "Sorry to hear that. E-Discovery is great",
            "Just curious. Why did they fight over money when they are most likely well off individually? I thought both couples having money or rather a way to make money should make a divorce more amicable.",
            "Well when running the football and short passes is getting first downs and wins, no need for Hail Marys or gadget plays.",
            "seasoned vets lol. Yes we know what we are doing and understand the next opportunity might not be tomorrow.",
            "lol just all passion no fundamentals, we were young",
            "Standing is not easy and often not pleasing for women  due to contortions/positioning \nThere are toys/slings/furnishings to help with this cos it’s not like the movies.",
            "Just normal stuff like being sick with a cold",
            "Just relaxing, some fishing. Occasionally boat head",
            "That’s a rather personal question!",
            "You seem to understand the value though, try something extreme",
            "> We let it slide over time. Not feeling motivated to pull it back.\n\nAh, see, you gotta do both. Repeatedly.",
            "Not seriously",
            "Wow, i didn’t even know about everyday sex until i started on Reddit!  I have a new love - long distance but when we see each other I’m onto it.  Before reading about couples who do this, it It’s never occurred to me to do sex on an ordinary work day or when tired or whatever.  Life gets busy is there time… my old partner we had to set dates to get it on the schedule and it got less and less.  Seems to me that daily is a good practice for maintaining connection & intimacy \n\nQuestion for you and the OP … what about days when you quarrel or are out of sorts with each other?  How do you still do sex?  (Discord is Such a turn off for me)",
            "Quality, intensity of orgasms. Frequency takes a hit with children aging.",
            "Less than 10",
            "I would have rather had less partners. Silver lining is I don’t have fomo, been there done that",
            "Metal, EDM",
            "That's rude. I am a divorce attorney--- I see the reasons to be faithful everyday.",
            "She kisses my children with that mouth",
            "Rarely hahahaha",
            "U put it in raw when u do ?",
            "Ohh so now you’re back to the first account hahahaha",
            "Ah, a crip then.",
            "Lol",
            "What was the joke",
            "It’s deleted now I wanna know",
            "i forgot you cant joke on reddit these people are so sensitive",
            "Hahaha typo, mean toys but will have a few tots if you can spare them",
            "You're assuming they work the same hours",
            "Oh it’s me",
            "He doesn’t have enough left over to share with anyone when I’m done with him hahah",
            "Salary",
            "I don’t get a lunch break I’m salary. He does get one but he’ll usually eat while at work and just use lunch for whatever.",
            "People get angry and greedy. Sometimes animosity for each other amplifies both of those things. Personally, I make a very average salary in EDisovery in my 20’s. My dad had a seven figure yearly salary, money like that isn’t common. It leads to people judging him for how he spends it (he’s not money smart at all). All I know is making a lot only amplifies greed for more money.\n\nAlso both my parents started off dirt road poor. Now a days I try to not ask either about money, while I know they’re well off, it’s always a can of worms.",
            "Well hot damn good for you guys! We should all strive for continuous improvement",
            "Awesome!!! We boat and wife wants boat sex so it’s in the plans 100%. I’ve got a bunch of ideas",
            "It’s AMA right?? 😆😆",
            "Extreme?",
            "There are sick days like everyone. But how often is that. Not very. We don’t argue. We talk. We settle. We love each other.",
            "Now that I’m mid 30s I’m realizing men having a good amount of sexual partners before marriage might be a good thing. In my experience, so many friends and family were cheated on because the man didn’t get women very easily for a number of reasons, and felt like they missed out on it. So they have affairs to make themselves feel better. \n\nIt’s just my pet theory though.",
            "EDM? Wasdat?",
            "So you cheat with vulnerable divorcées? Classic.",
            "[deleted]",
            "left myself open to that one",
            "This absolutely fucking blindsided me. 😂",
            "This made me laugh so hard",
            "Bro 🤣🤣🤣",
            "LMAOAOAOAAOAO THAT WAS GOOD",
            "Or, maybe, you're just not funny",
            "I was worried there for a second.",
            "Facts, I’m night shift he’s day shift",
            "No, I’m not.",
            "Correct salary",
            "Also both pretty tall so that can complicate things",
            "Be safe",
            "MDMA",
            "Cook up something wild",
            "Electronic dance music",
            "lol did an attorney hurt you?",
            "Dude do you ever just shut the fuck up?",
            "It's a genuine question ",
            "or mmmnmaybe youre just a bitch",
            "As you should be.",
            "I can second standing w a same height couple. There's a sweet spot to be sure.",
            "Id rather lick a turd",
            "Ah, I like city pop",
            "Yes. Fucked his wife and he came home, beat me with a bat, then fucked his wife while I regained consciousness.",
            "Again, you're just not funny. \n\nKeep blaming \"cancel culture\" though maybe Ione of these days it will work out for ya",
            "You shouldn’t have been standing there",
            "*Kneeling, technically."
        ]
    }
}