{
    "PC Build Questions, Purchase Advice and Technical Support Megathread — Q2 2024 Edition": {
        "title": "PC Build Questions, Purchase Advice and Technical Support Megathread — Q2 2024 Edition",
        "score": 55,
        "url": "https://www.reddit.com/r/Amd/comments/1bsp3cp/pc_build_questions_purchase_advice_and_technical/",
        "content": "Welcome to the /r/AMD Q2 2024 PC build questions, purchase advice and technical support megathread — if you have questions about AMD hardware, need purchasing advice, have a PC build question or technical support problem, **please read this post in full, as the majority of issues or queries can be resolved or answered by trying the steps outlined in this post or visiting one of the recommended websites, subreddits or forums linked below.**\n\nNote /r/AMD is not a technical support, purchase advice or PC building help subreddit — **/r/AMD is community run and does not represent AMD in any capacity unless specified** — there is **no guarantee** anything posted in this thread or subreddit will be seen by AMD.\n\nIf you want to guarantee your query or issue is seen by AMD, please use the official AMD [community support forums](https://community.amd.com/t5/support-forums/ct-p/supprtforums) or [contact AMD support directly.](https://www.amd.com/en/support/contact)\n\nIf you have **found a bug or issue and want to report it to AMD**, please use the [AMD Bug Report Tool](https://www.amd.com/en/resources/support-articles/faqs/AMDBRT.html) and include as much information as possible in your report — AMD can't fix something unless they know it exists and have enough high-quality information to reproduce it.\n\nThe [AMD Community](https://discord.com/invite/012GQHBzIwq1ipkDg) and [AMD Red Team](https://discord.com/invite/k4wtjuQ) Discord servers are available to ask questions and get help from other AMD users and PC enthusiasts.\n\nThe [subreddit wikipedia](https://www.reddit.com/r/Amd/wiki/index) contains answers to common questions, troubleshooting tips, how you can check if your PC is stable, a jargon buster for FSR, RSR, EXPO, SAM, HYPR-RX and more. It's strongly recommended to read the [wikipedia](https://www.reddit.com/r/Amd/wiki/index), in addition to what is detailed below, before you make any post.\n\nAMD's support site also has many solutions and troubleshooting guides you may find helpful:\n\n* [Processors & Graphics Support Knowledge Base](https://www.amd.com/en/resources/support-articles/knowledge-base-search.html#)\n\n* [AMD Software Help Center](https://www.amd.com/en/support/graphics/software.html)\n\n* [Troubleshooting Tips for Resolving System Stability Issues](https://www.amd.com/en/resources/support-articles/faqs/TS-TIPS.html)\n\n* [Troubleshooting System Stability Issues](https://www.amd.com/en/resources/support-articles/faqs/PIBRMATS2.html)\n\n* [Troubleshooting Common Boot Failures](https://www.amd.com/en/resources/support-articles/faqs/PIBRMATS1.html)\n\n* [How to Troubleshoot Power Supply Issues](https://www.amd.com/en/resources/support-articles/faqs/GPU-104.html)\n\n* [Troubleshooting CPU Performance and Temperature Issues](https://www.amd.com/en/resources/support-articles/faqs/PIBRMATS3.html)\n\n* [Information About PCIe Riser Cable and Extender Compatibility with PCIe Gen 4.0 Desktop Systems](https://www.amd.com/en/resources/support-articles/faqs/PA-270.html)\n\n**You may also want to consider the following subreddits, websites and forums that may be more appropriate for your question or issue.**\n\n---\n\n/r/AMDHelp: In this subreddit, we discuss, troubleshoot, and share knowledge relating to AMD and their hardware and software products on all supported platforms.\n\n[PCPartPicker](https://pcpartpicker.com/): PCPartPicker provides computer part selection, compatibility, and pricing guidance for do-it-yourself computer builders. Assemble your virtual part lists with PCPartPicker and we'll provide compatibility guidance with up-to-date pricing from dozens of the most popular online retailers. We make it easy to share your part list with others, and our community forums provide a great place to discuss ideas and solicit feedback.\n\n/r/buildapc: Planning on building a computer but need some advice? This is the place to ask! /r/buildapc is a community-driven subreddit dedicated to custom PC assembly. Anyone is welcome to seek the input of our helpful community as they piece together their desktop.\n\n/r/pcmasterrace: Welcome to the official subreddit of the PC Master Race / PCMR! All PC-related content is welcome, including build help, tech support, and any doubt one might have about PC ownership. You don't necessarily need a PC to be a member of the PCMR. You just have to love PCs. It's not about the hardware in your rig, but the software in your heart! Join us in celebrating and promoting tech, knowledge, and the best gaming, study, and work platform there exists. The Personal Computer.\n\n[OBS (Open Broadcaster Software) Forums](https://obsproject.com/forum/): Discussion forums for OBS Studio, the free and open source software for video recording and live streaming.\n\n/r/overclocking: All things overclocking go here. Learn to overclock, ask experienced users your questions, boast your rock-stable, sky-high OC and help others!\n\n/r/techsupport: Stumped on a tech problem? Ask the community and try to help others with their problems as well\n\n[ASRock Forum](https://forum.asrock.com/default.asp): Wanna discuss or find out something for your ASRock products? Come and get in ASRock worldwide forums to chat with ASRock global users!\n\n[ASUS Republic of Gamers (ROG) Forums](https://rog-forum.asus.com/): Discuss and discover the best ways to make the most out of your ROG gear.\n\n[MSI Global English Forum](https://forum-en.msi.com/index.php): Need more people to discuss with? Click here to find help.\n\n/r/buildapcforme: A subreddit dedicated to helping those looking to assemble their own PC without having to spend weeks researching and trying to find the right parts. From basic budget PCs to HTPCs to high end gaming rigs and workstations, get the help you need designing a build that precisely fits your needs and budget.\n\n/r/GamingLaptops: The hub for gaming laptop enthusiasts. Discover discussions, news, reviews, and advice on finding the perfect gaming laptop.\n\n/r/SuggestALaptop: A place for prospective laptop buyers to get suggestions from people who know the intimate details of the hardware.\n\n---\n\nIf you are having an issue with or need to raise an RMA for a product not directly from AMD, you may want to consider contacting the manufacturer of your laptop, graphics card, motherboard or system — below we have linked contact options for the most common brands and manufacturers.\n\n[XFX Support](https://www.xfxforce.com/support/contact-us)\n\n[SAPPHIRE Customer Service](https://support.sapphiretech.com/Default.asp?lang=eng)\n\n[PowerColor Service Support](https://www.powercolor.com/contact)\n\n[MSI Service And Support](https://www.msi.com/support)\n\n[Gigabyte Support Services Center](https://www.gigabyte.com/Support)\n\n[ASRock Support](https://www.asrock.com/support/)\n\n[ASUS Support](https://www.asus.com/support/)\n\n[Dell/Alienware Support](https://www.dell.com/support/home/)\n\n[HP Customer Support](https://support.hp.com/)\n\n[Lenovo Technical Support](https://support.lenovo.com/)\n\n[ACER Support](https://www.acer.com/support)\n\n---\n\n***READ BEFORE POSTING*** — ***READ BEFORE POSTING*** — ***READ BEFORE POSTING*** — ***READ BEFORE POSTING*** \n\nIf you are experiencing any issues, including, but not limited to; games or programs crashing, system crashes or hangs, blue screens of death (BSoD), driver timeouts, system not starting, system freezes, data corruption, system shutting down unexpectedly, visual artifacts, lower than expected performance or any other issue, **please read and try the following before making a post, the majority of problems can be resolved by trying the steps listed below**\n\nThe suggestions below are not necessarily in any particular order, if a step has already been performed or is not relevant, please move to the next step.\n\n* If your system won't power on, make sure all cables are plugged in and seated correctly, that the power supply is plugged into a working wall outlet and any switches on the wall outlet or power supply are in the ON position. It's also worth check your front panel connectors to make sure they are connected properly and trying a different outlet.\n\n* If you have any power related issues, like your system not starting, shutting down, sleeping, restarting or waking from sleep, try to test with another power supply, as unstable voltages (such as on the 12V, 5V, 5VSB and 3.3V rails) can cause a variety of issues that can be inconsistent and hard to diagnose.\n\n* Make sure your memory modules (RAM) are installed in the primary DIMM slots, some motherboards will not POST (Power-on self-test) if the RAM is installed in the secondary DIMM slots. The primary slots should be labelled on the motherboard or specified in the motherboard manual.\n\n* If your system does power on, but won't get past the POST screen, please ensure your CPU, RAM and GPU are installed correctly and try clearing the CMOS — this can normally be done by disconnecting the motherboard from power and removing the CMOS battery for a few minutes. Many motherboards also have clear CMOS reset jumpers or buttons you can use, please consult your motherboard or system manual on how to clear the CMOS.\n\n* If your system still won't POST, check if your motherboard has a Debug LED and consult your motherboard manual to check what step it's stuck on. Make your motherboard is compatible with the CPU you have — most AM4 and AM5 motherboards should have BIOS flashback, allowing you to update the BIOS without needing the CPU or RAM installed. Consult your motherboard manual as the BIOS flashback procedure will very depending on the make and model. When using BIOS flashback, we recommend using a USB 2.0 drive that is 8GB or less and formatted as FAT32, as some implementations of BIOS flashback don't work reliably with USB 3.0 drives and/or USB drives larger than 8GB.\n\n* If you are using an AMD Radeon RX 6000, AMD Radeon RX 7000 or NVIDIA GeForce RTX 30 or NVIDIA GeForce RTX 40 GPU, please ensure you are using separate 6-8pin PCIe cables and not using daisy-chained or splitter cables, as these may not be able to supply sufficient power — some GPUs may have LED indicators by the connector to let you know if the GPU isn't receiving adequate power, please consult your GPU and PSU manual for more information on how to correctly power your GPU.\n\n* Make sure your Monitor/TV is plugged into the HDMI or DisplayPort output from your graphics card and not the motherboard. If this still doesn't work, try a different Monitor/TV, if you are using any HDMI or DisplayPort adapters, converters or splitters, remove these and use a direct connection, try switching between HDMI and DisplayPort and try different HDMI or DisplayPort cables to rule out any problems here. For best results, always use certified HDMI or DisplayPort cables.\n\n* Make sure you are running the latest software updates for your operating system, games and applications.\n\n* Scan your PC for any viruses or malware using Windows Security (formerly Windows Defender) or other reputable Anti-Virus or Anti-Malware solution, as malware, viruses, adware and other unwanted software can cause crashes, freezes, hangs and other performance, security, stability and compatibility issues.\n\n* Make sure you are running the latest [AMD chipset and/or graphics drivers](https://www.amd.com/en/support/download/drivers.html), note that some devices, such as laptops, desktops and handhelds, may have custom hardware IDs or other manufacturer changes, in which case, you may have to download drivers from the manufacturer of your device.\n\n* If you need to reinstall GPU drivers, we recommend using the [AMD Cleanup Utility](https://www.amd.com/en/resources/support-articles/faqs/GPU-601.html) or [Display Driver Uninstaller (DDU)](https://www.wagnardsoft.com/display-driver-uninstaller-DDU-) to perform a clean installation of the GPU drivers, a guide on how to use DDU can be found [here](https://docs.google.com/document/d/1xRRx_3r8GgCpBAMuhT9n5kK6Zse_DYKWvjsW0rLcYQ0/edit)\n\n* If you have installed GPU drivers after using the AMD Cleanup Utility or DDU, you may experience stutter in some games while the shaders are cached again.\n\n* If Windows Update is replacing your GPU drivers (example of what that looks like [here](https://imgur.com/a/DLLMZ3L)) please [view the following](https://drive.proton.me/urls/QHH65SVJ9M#Q25EPyELVdrT) on the steps you can take.\n\n* If you are on Windows 10 or Windows 11 and experience flickering, stuttering or brightness issues during gaming or video playback with hardware acceleration enabled, try disabling Multiplane Overlay (MPO), as some users have reported this has resolved their issues — more information on disabling MPO is available in this [thread](https://www.reddit.com/r/Amd/comments/yvyqc7/disabling_multiplane_overlay_mpo_fixed_all/)\n\n* If a game is crashing, freezing, not starting, performing poorly or having other issues, please verify and repair the game files through Steam, Epic Games Store, Ubisoft Connect, EA App, GOG Galaxy, Xbox App, Battle.net or whichever game client you are using.\n\n* If a program is crashing, freezing, not starting, performing poorly or having other issues, please reinstall the program or attempt to repair the installation using the program installer/uninstaller.\n\n* If you are on Windows and are experiencing stuttering or lower than expected performance, make sure you are using the Balanced or High Performance power plan and restore them to their default values, this can be checked under Control Panel > System and Security > Power Options.\n\n* Make sure you are using the latest BIOS, Firmware and Drivers for your motherboard, laptop, desktop and any other components and peripherals you have connected to your system. These updates often contain bug fixes, new features and improve compatibility and interoperability.\n\n* If you have any overclocks, underclocks, overvolts, undervolts, custom power curves or similar: **revert everything to stock clocks, timings, voltages and settings**, this includes disabling XMP/EXPO/DOCP — to do this, go into your BIOS and restore the factory settings — this is typically labelled 'Restore Default', 'Restore Optimized Defaults', 'Load Optimized Defaults' or some similar variation. If you are using other utilities like MSI Afterburner or Ryzen Master, you may also have to restore default settings in those utilities as well.\n\n* If you experience crashes, freezes, unexpected shutdown or just want to check if your system is stable, you can stability test your system with the utilities linked below. Please remember that just because your system turns on, doesn't make it stable and that overclocking is not guaranteed and can vary depending on the setup you have and the silicon lottery of your CPU/GPU/RAM, you should always thoroughly stability test your system — many reading this post will have unstable systems and won't even know it.\n\n---\n\n[OCCT](https://www.ocbase.com/) — Ocbase is the home of OCCT, the most popular all-in-one stability / stress testing / benchmarking / monitoring tool available for PC.\n\n[Prime95](https://www.mersenne.org/download/) — Prime95 has been a popular choice for stress / torture testing a CPU since its introduction, especially with overclockers and system builders. Since the software makes heavy use of the processor's integer and floating point instructions, it feeds the processor a consistent and verifiable workload to test the stability of the CPU and the L1/L2/L3 processor cache. Additionally, it uses all of the cores of a multi-CPU / multi-core system to ensure a high-load stress test environment.\n\n[AIDA64 Extreme](https://www.aida64.com/downloads/latesta64xe) — AIDA64 Extreme is an industry-leading system information tool, loved by PC enthusiasts around the world, which not only provides extremely detailed information about both hardware and installed software, but also helps users diagnose issues and offers benchmarks to measure the performance of the computer.\n\n[Furmark 2](https://geeks3d.com/furmark/) — FurMark 2 is the successor of the venerable FurMark 1 and is a very intensive GPU stress test on Windows (32-bit and 64-bit) and Linux (32-bit and 64-bit) platforms. It's also a quick OpenGL and Vulkan graphics benchmark with online scores.\n\n[MSI Kombustor](https://geeks3d.com/furmark/kombustor/) — MSI Kombustor is MSI's exclusive burn-in benchmarking tool based on the well-known FurMark software. This program is specifically designed to push your graphics card to the limits to test stability and thermal performance. Kombustor supports cutting edge 3D APIs such as OpenGL or Vulkan.\n\n[MemTest86](https://www.memtest86.com/) — MemTest86 boots from a USB flash drive and tests the RAM in your computer for faults using a series of comprehensive algorithms and test patterns. Bad RAM is one of the most frustrating computer problems to have as symptoms are often random and hard to pin down. MemTest86 can help diagnose faulty RAM (or rule it out as a cause of system instability). As such it is often used by system builders, PC repair stores, overclockers & PC manufacturers.\n\n[MemTest86+](https://memtest.org/) — Memtest86+ is a stand-alone memory tester for x86 and x86-64 architecture computers. It provides a more thorough memory check than that provided by BIOS memory tests. Memtest86+ can be loaded and run either directly by a PC BIOS (legacy or UEFI) or via an intermediate bootloader that supports the Linux 16-bit, 32-bit, 64-bit, or EFI handover boot protocol. It should work on any Pentium class or later 32-bit or 64-bit x86 CPU.\n\n[SeaTools](https://www.seagate.com/support/downloads/seatools/) — SeaTools - Quick diagnostic tool that checks the health of your drive.\n\nFor more advanced SSD and HDD diagnostic utilities, please check the website of your SSD or HDD manufacturer, as they usually offer specialised software to test the drive and update firmware, some examples include Samsung Magician, Western Digital Dashboard and the Crucial Storage Executive.\n\nSome motherboards, laptops and desktops may also have built-in BIOS diagnostic utilities to stress test certain components or the entire system. Please consult your motherboard or system manual for more information.\n\nA truly stable system should be able to run any of these utilities or built-in diagnostics without any crashes, freezes, errors or other issues. These utilities can help you narrow down which component(s) in your system are faulty, aren't installed correctly or have unstable overclocks, underclocks, overvolts, undervolts, custom power curves etc...\n\nIf you require help using any of these programs, please read the help sections on each website or use Google and YouTube, as there are a plethora of guides and tutorials available.\n\n---\n\n* If you have a custom built PC, recently upgraded, started overclocking or want to know if your current PSU will support a hardware upgrade, please use one of the below PSU calculator and make sure the PSU you have can supply enough power when your system is under full load — If your PSU isn't able to supply enough power, you are likely to have issues starting your system and may experience system shutdown when under load.\n\n* PSU Calculators: [FSP](https://www.fsplifestyle.com/landing/calculator.html), [OuterVision](https://outervision.com/power-supply-calculator), [Cooler Master](https://www.coolermaster.com/power-supply-calculator/), [Seasonic](https://seasonic.com/wattage-calculator), [Newegg](https://www.newegg.com/tools/power-supply-calculator/), [be quiet!](https://www.bequiet.com/en/psucalculator), [MSI](https://www.msi.com/power-supply-calculator), you can also add all your components into [PCPartPicker](https://pcpartpicker.com/list/) and it will provide an estimate wattage.\n\n* If you are using Windows 10 or Windows 11, use the built-in System File Checker (SFC) and Deployment Image Servicing and Management (DISM) commands to check for any corrupt or missing operating system files and attempt to repair them, a guide is available [here](https://docs.google.com/document/d/1Y7HOS6UiOBXAWtNFBJ0w70f14izRQcBYD9puuSw6Ghs/edit)\n\n* Try and apply common sense to an issue, for example if you have flickering on your TV or Monitor, try simple things like changing the HDMI or DisplayPort cable and port on the GPU and display you are using. If you've recently installed a mod and that game now crashes, uninstall that mod. If one of your memory modules is no longer being detected, is there any physical damage to the memory module, DIMM slot on the motherboard or pins, have you tried reseating it etc...\n\n---\n\nIf you have tried all of the above and are still facing the same issue, please **backup any important files/data** and completely reinstall your operating system using a USB drive.\n\n**Only use official Windows 10 or Windows 11 ISO images that come direct from Microsoft.**\n\nThe latest Windows 10 and Windows 11 ISO images can be downloaded from the [Microsoft website](https://www.microsoft.com/software-download/) using the Media Creation Tool.\n\nIt's not recommended to use utilities or programs which modify Windows or to use 3rd party, custom or slimmed Windows ISO images, as these are non-standard ISO images, they could have viruses, malware and may cause stability and compatibility issues.\n\nIf you have done all the above steps and are still facing an issue, please follow the below template for submitting a request, the more detail you can include the better. **If you post something like 'pc crashes', don't list your PC specifications, what you've tried to resolve the issue or don't provide any helpful information, then don't expect a response, as there's not enough useful information to go on and it will be assumed you haven't read this post or tried any of the steps outlined above.**\n\n*Below is an example template you could use...*\n\n---\n\n**Summary of the issue**: The Invincible will crash with Adrenalin 24.3.1 if you have Radeon Chill enabled and try to open the in-game overlay , this is not an issue if you revert to Adrenalin 24.2.1.\n\n**What I have tried to resolve the issue**: I have reinstalled 24.3.1 with the AMD Cleanup Utility, reset my in-game graphics settings, verified game files in the Epic Games Store and confirmed the issue is still present if Radeon Chill is enabled.\n\n**System specifications:**\n\n* Operating System: Windows 11 23H2, OS Build 22631.3374 (to find OS build version, press the Windows Key + R and type *winver*)\n* CPU: AMD Ryzen 7 7700, cooled by a be quiet! Dark Rock Pro 5, stock settings/no overclock\n* GPU: XFX AMD Radeon RX 7900 XT MERC 310 BLACK, stock settings/no overclock\n* Motherboard: Gigabyte B650 AORUS ELITE AX with F22 BIOS\n* RAM: G.Skill Trident Z5 Neo RGB (F5-6000J3238F16GX2-TZ5NR) 32GB DDR5-6000 CL32 with EXPO profile enabled\n* Storage: 1TB Corsair MP600 ELITE /w Heatsink\n* PSU: 1000W Seasonic Focus GX-1000 80PLUS Gold\n* Display: Samsung 27\" Odyssey G55C with included DisplayPort cable\n\nIf you are using a prebuilt system or don't know your full specifications, please include the make and model of your system and as much information as you can, e.g, Alienware m16 Gaming Laptop (AMD Ryzen 9 7845HX, AMD Radeon™ RX 7600M XT, 16GB DDR5-4800, 1TB PCIe NVME SSD) with the latest 1.11.0 BIOS.\n\nPlease include any logs, dump files, videos, screenshots and images of the inside of your case and setup, as this will aid in answering questions relating to airflow, cabling and component installation.\n\n---\n\nWe would like to reiterate that /r/AMD is community run and does not represent AMD in any capacity unless specified — there is **no guarantee anything posted in this thread or subreddit will be seen by AMD.**\n\nIf you have any suggestions on how to improve this megathread or the wikipedia, please [message us](https://www.reddit.com/message/compose/?to=/r/Amd) with your suggestion.",
        "num_comments": 1186,
        "comments": [
            "is it worth upgrading a 1070 to a 6700xt until the next generation?",
            "How is this so good? My defective 14900k is going back to Intel. Threw in a 7800X3D this week. Comparatively, it has lower clocks, 1/3rd the cores, and I get half the cinebench speed. But almost every game has better frame rates, all while pulling like 80 watts instead of 250+. I know the cache is a factor, but I'd love to read some more in-depth info if anybody has links to good articles. It's just so good; wouldn't believe it if I wasn't seeing it.",
            "I am trying to figure out a GPU upgrade path to pair with my recently built system. I'm using my older GPU for now which is a 3060TI and that will be going to another system. My budget is $600 and I'm absolutely torn between getting a 4070 Super and a 7900 GRE. I'm leaning more towards the 4070 Super (probably MSI Slim or NVIDIA Founder's Edition), but I am very much open to purchasing the 7900 GRE (which would absolutely be the Sapphire Nitro). \n\nThese are my specs: \n\n* Case: Phanteks Enthoo Pro M\n* PSU: Corsair RM1000X Shift\n* Motherboard: NZXT N7 B650E\n* CPU: Ryzen 7 7800X3D\n* Cooler: NZXT Kraken 240 RGB\n* RAM: 64GB Corsair Dominator Platinum DDR5-5600\n* Storage: 4TB\n* GPU: Gigabyte GeForce RTX 3060TI",
            "Hey all! \n\n&#x200B;\n\nI was building a PC and after months of saving I was able to purchase a 7800x3d that I had paired with a 4070. I was pretty happy. \n\n&#x200B;\n\nI ended up getting an amazing deal (2500) on a new Corsair vengeance i8200. This has a 4090 and an i9 14900kf. \n\n&#x200B;\n\nNow I use my PC for gaming most of the time with some light work on it. Occasional streaming video but thats rare. \n\n&#x200B;\n\nMy question is, should I swap the mobo and cpu for the better power draw of the 7800x3d? or should I stay with the 14900kf. \n\n&#x200B;\n\nMy other question is when I run the cpu benchmark app it always tells me the 7800x3d is performing under expectations at like 112%. Is that something I should see if newegg will swap out or is it just because I use the cpu stock with no changes?\n\n&#x200B;\n\n&#x200B;\n\nI really appreciate the help in advance. Thanks everyone.",
            "Installed new drivers some time ago, now I get random or semi-random (there is a **bit** of correlation with alt-tabbing) framedrops - about 10 seconds, can be two types - either just laggy drops wiht the game being somewhat playable, or total slideshow with in-game artefacts, including 3D models flipping up. \n\nThis used to happen some time ago as well, but new drivers at the time fixed it.\n\nHlep.",
            "Is powercolor hellhound a good gpu board partner to buy?",
            "Is rx580 good for 1080p gaming?\nI have rx580 8gb with Xeon 2689v4 cpu(3.3ghz) I wonder it is good or not",
            "I recently purchased a 4080 Super FE card and am currently using a 5600x. I game at 3440x1440 and was wondering if it was worth upgrading to a 5700x3d. Any input would be greatly appreciated. Thanks!",
            "Hello I'm looking for advice on where to start on upgrading my PC. My current set up is \n\nAMD Ryzen 5 3600XT 6-core processor \n16GB ram\nRadeon RX580 GPU \nASRock B450M Steel Legend Motherboard\n\nIt has been a while since I have done any upgrades and money is a issue. Any advice would be appreciated.",
            "**Summary of the issue**: BIOS and AMD Adrenaline won't read CPU temp. To be specific, BIOS is stuck at 29 C and Adrenaline is stuck at 0 C.\n\n**What I have tried to resolve the issue**: I have installed HWinfo, and this seems to read the temperature perfectly, so I am guessing this is a software issue. I have no idea where to start. Adrenaline was reporting my CPU temperature yesterday and I didn't change anything on my pc...\n\nI used Adrenaline to download my drivers, and when looking at my motherboards webpage, the drivers I have look much different, so I am not sure how to tell if I have the latest versions or not. I am guessing this is where I should start, but I am open to any guidance!\n\nThen again, adrenaline says I have all the updated drivers, and my windows is up to date, so maybe I am good on the driver front. Any thoughts are much appreciated!\n\n**System specifications:**\n\n[https://pcpartpicker.com/list/9Rx6Wt](https://pcpartpicker.com/list/9Rx6Wt)",
            "Is it still worth buying a 7800x3D or should I wait it out for 9000X procs in July? Primary use is gaming but I do some development on the machine.",
            "is AMD Ryzen™ 9 7845HX (76 MB total cache, 12 cores, up to 5.20 GHz Max Boost Clock) a good processor ?\n\nis it equivalent to intel i7 13700hx (better or worse)\n\ndo you recommend it and does it have any problem of high temps or throttling ?\n\nPS: i have never bought any AMD product in my life.",
            "Hey everyone, I'm planning to build a PC for 1080p gaming and need some advice. I have two builds in mind:\n\n* Ryzen 5 7600x with RX 7900 GRE\n* Ryzen 7 7800x3D with RX 7700 XT\n\nI know both are a bit overkill for 1080p, but I'm set on it. Which setup would be better for hitting 144fps on high graphics settings in games like R6, cs2, Minecraft, and simulations like Assetto Corsa? I mostly play games like R6, cs2, Minecraft, and simulations, so I think the Ryzen 7 7800x3D with RX 7700 XT combo might be better for me. However, I'm also looking forward to GTA VI on PC and will have a Series S as a backup. I believe I can achieve +144fps in games like cs2, PUBG, or R6 even with the R5 7600x and RX 7900 GRE combo.",
            "I've been planning on building for myself a new rig. I've been Intel+Nvidia man for a loooong time but recent years i have been hearing very good things about AMD getting new, powerful shit out cheaper and got me curious.\n\nI don't know much about AMD CPU's so i need some help here. Money isn't an issue here but i still don't want to pay for air, if you know what i mean.\n\nMy GPU is going to be 7900xtx (Asus) but i don't know what CPU to take. I mean as i understand, Ryzen 9 7950X3D is perhaps the best they offer right now but what is the difference between that and non 3D models? I mean where i live that 3D model costs a bit over 110€ more than 7950X. Is there really some benefit for that bigger 3D cache or is it just some few FPS more in games? Really worth for over 100€ difference? In future more useful?\n\nI don't plan going 4K (playing 1440p) atleast for now, but does that 3D cache bring more benefit on 4K?\n\nThanks in advance!",
            "heya, these are my specs\n\n ryzen 7 5800x3d\n\n32gb ram corsair vengeance rgb pro ddr4 (2x16gb) 3200mhz cl16\n\nsapphire nitro 7900xtx\n\nrog strix b550-a motherboard\n\n2 m.2 ssd\n\nmsi mpg 850w power supply\n\n  \nI'm having some issues with my games freezing. in apex I would get booted to my pc home screen without a popup saying there was an issue or whatever and today was a weird one. was playing helldivers and after 20 mins it booted me but it wasn't a normal boot it was like my pc restarted. had a black screen and it finally came back to life after a min ( pc was still on during black screen). then everything was zoomed in so I checked device manager and it said my graphics card is disabled and I tried to enable it but it wouldn't as it \"wasn't working properly\" so I restarted my pc. that fixed the issue with the card but then I went into helldivers, 2 more times and then got booted those 2 times. those 2 more times that I got booted I got a pop up from helldivers itself saying it crashed and if I would like to report and also a amd driver timeout I think it was. I tried one more time and managed to stay on for 1hr 30 id say and when I finally got off I was looking around steam downloads cause I remember there was an update for apex tomorrow and saw an update for helldivers ( 78mb) that was already downloaded don't know if the update helped me stay on after those 2 crashes. my drivers are up to date and the files for the two games are fine. anyone have an idea of whats goin on?",
            "Working on a new build as a gift for my brother, and am trying to decide on which 7900 variant I should buy. He'll mostly be playing competitive games, but is also interested in playing AAA titles (Cyberpunk, RDR2, Elden Ring, etc.) now that he'll have the rig to do it.\n\nFor 1440p with a 144hz monitor (I don't anticipate that he'll be playing in 4k anytime soon), is there enough value in the 7900XT to spend the ~$150 extra compared to the GRE?",
            "Looking to get a gpu. I’ve been looking at the Rx 7600 xt, pretty much all the variations of it, and have finding a lot of mixed reviews for it.\n\nBasic requirements im looking for:\n- runs vr no problem and has good graphics quality and runs smoothly at the same time.\n\n- streaming said vr game (this is not a dealbreaker but if it can do it that’s a +)\n\nMy understanding of the pc world in terms of hardware/software is extremely basic maybe knowing a little more than the average person but not by a major amount.\n\nIf anyone has any other suggestions other than the 7600 I’d love to hear your input about them and possibly an explanation as to why so I can try to understand more. Thanks everyone",
            "Hello everyone,\n\nI am on my way to build my first pc and i am stuck between a very tough decision, as i am building this pc on a budget\n\n\n\nI had a budget of about 800$ and i am able to sneak in a 6750xt over a 4060, costing me about 50$ more in my country however due to budget restrictions i cannot get a better psu, so i am worried about performance, please help a fellow out. Do i get the 550w psu along with 6750xt or do i purchase a 4060, not sure if getting a 6750xt will wreck my pc, heres the specs\n\n\n\ni5 12400f\n\nMSI B760-m bomber wifi\n\n6750xt asrock challenger oc\n\n16gb adata lancer 6000mhz\n\nDeepcool PK550D 550 W 80+ Bronze Certified ATX Power Supply\n\n\n\nPC price tracker states that my gig requires 460w  \nI am absolutely new to pc gaming with 0 knowledge so help a brother out",
            "What were the best and worst manufacturers when it came to implementing Zen 3 support on X300 chipset motherboards? Or were they all generally good with doing that?",
            "I get Error 211 when updating drivers with adrenaline. Destination folder is the default on C: drive, and I already gave the User group all permissions.",
            "Just looking for advice/input:\n\nMy 5900x is suddenly having crashing/freezing issues (unfortunately a widespread and unsolved issue related to RAM timings). I had RMAd the first 5900x I got 3 years ago for the same issue so unfortunately this one is no longer under warranty. I basically have 3 options:\n\n1. Buy a new 5900x now (could have the same issue but would be able to RMA the new one)\n2. Buy a new 5800X3D now (lose cores but I mostly just game anyways)\n3. Deal with bi-weekly whole system crashes until Zen 5 hopefully releases in the fall and upgrade MOBO/RAM and a new CPU\n\nWithout the CPU issue I likely wouldn't be touching any parts for another 2-3 years minimum so while I don't mind paying for shiny new things it's a little annoying to drop ~$700 just to resolve this one issue.",
            "Hey guys! Just bought a PC for really cheap, it has:\n\n  \ncpu: i5-8400  \nram: 8gb g.skill aegis 16cl 3000mhz  \nmobo: prime 310mh-k  \ngpu: 1050ti 4gb\n\n  \nMy main goal is to move to something like an r5 which is the current lowest end that can be upgraded to the latest in the future. I have heard that if I buy a b350 board and install an r5 1600 in it, I can just BIOS update my board and it can support like a 5th gen r5 5600 or something like that. \n\nWhat do you think are my best and most budget friendly options right now?",
            "anyone have these mini stutters when watching youtube videos in full screen ? only started happening when i switched from old 970 to 6800, both sound and video stutter for like 0.1 second but happens pretty often, doesnt happen in games or anything, just when watching twitch/youtube whatever else in **full screen**",
            "**Seeking Help with AMD Encoder in OBS:**  \n  \nHey everyone,\n\nI've been using the AMD encoder in OBS for about a year now, and I've encountered some issues. I stream using an AMD RX 6700XT graphics card and a Ryzen 9 5900X processor. Whenever I stream games like GTA with the encoder from the graphics card, I experience buffering and pixelation as soon as I move, which can be quite frustrating.\n\nI'm reaching out to see if anyone else has experienced similar problems and if there are any solutions available. Are there any recommended plugins or codec parameter tweaks that could potentially alleviate this issue? Any help or advice would be greatly appreciated!\n\nThanks in advance!",
            "**\"Your Driver is out of data...\"**\n\n  \nI recently purchased a used Red Devil 6700 XT. \n\n  \nEvery time I open up the Devil zone Software a message will appear saying my driver is out of data.\n\n  \nI'm reaching out to anyone who can help me solve this problem. \n\n  \nThank you!",
            "# Doesnt B650 supports PCI-e 5.0?\n\nThats what Im getting in every B650 motherboard Im checking so far. Is that correct?",
            "[removed]",
            "Adrenaline causing issues with Windows again.\n\nA little over a month ago (end of February), I had issues after updating Adrenalin from 23.12.1 to 24.2.1. Today, it happened again, when I tried updating to 24.3.1.\n\nHere's the problem: after updating driver through Adrenalin app, upon boot it effectively locks up on me. The only 2 things I was able to do the first time around were open file explorer and open the run prompt with WIN + R, though either option was limited in what I could do with them. Today, I wasn't able to do either.\n\nThe fix is to boot into safe mode (use the restart button on the front of the case, then on the lock screen, hold shift while clicking restart) and run DDU to wipe Radeon drivers, then PC returns to normal on the default Windows VGA drivers. But as soon as I reinstall any version of Adrenalin starting with 24 it returns to the broken state. Reinstalling 23.12.1 works though. The only thing that doesn't work is that Forza Horizon throws an error \"Unable to detect graphics driver version\" (code: FH302). Game seems to run fine, it just stops the game from loading until I select \"ignore warning.\"\n\nMy original suspicion was that my boot drive could be failing, so I bought a new one and installed Windows 10 fresh on it, but the exact same thing happens again as soon as I installed newer versions of Adrenalin (24.1.1, 24.2.1, and 24.3.1).\n\nThe weird thing this time around was that I updated drivers a week ago and all seemed fine until I restarted my PC today, then the exact same behavior as last time, so I repeated my troubleshooting steps from last time around, and that fixed it. Again, Forza still throws error FH302.\n\nI bought the card in April of 2023, and in the 10 months between purchase and the first time it happened, I had no other issues with the card.\n\nSpecs:  \nRyzen 7 5700G  \nASRock X470 Gaming K4  \nRadeon RX 6900XT (reference card)  \n32GB (4x8) Trident Z RGB DDR4 3200MHz CL16  \nXPG SX8200 Pro 512GB (original)/Crucial T500 1TB (updated)  \nCorsair RM1000X",
            "Is is worth it buying an aftermarket cooler to increase the thermal headroom for turbo boost to kick in? Primarily use the pc for gaming so not sure if it’s worth it",
            " Looking for PC upgrades (budget) I want to know what my PC lacks\n\nIm currently running an\n\nAmd Ryzen 5 3600 6-core processor\n\nRadeon Rx 6650XT\n\nI do have a 165 Hz Monitor which I rarely ever get 165 FPS consistently.\n\nI want to upgrade simply because I like running games smoother and on Valorant I noticed I still end up getting frame drops, Fortnite runs fine even on high settings but I would like it to be more stable in most games not just Fortnite. Even outside of games too it would be great to get that upgrade!\n\nAlso one more question, are 1080p monitors behind nowadays? I saw many comments on a Tiktok video that were like \"imagine having a 1080p monitor in 2024\". I know its not that bad but I thought it was the norm still.",
            "Looking for product or platform advice on building a system with 128 GB (4x32GB DDR5 sticks). I would like to achieve better than DDR4 MT/s for the purpose of the setup (crunching high resolution images for computational photograhy -- AI based Super Resolution).\n\nThe system will make use of two M2 SSDs and these will be picked 7000 MB/s read and >6000 MB/s write speeds.\n\nThis would be an algorithm development PC for a single person so I may not have the time to fine tune the applications from the get go.\n\nThe system will be protected by a UPS from sudden power outages. I would expect it to run 24/7.\n\nThus, the question: What's the cheapest motherboard (the chipset brand model) -including the current known fw updates- works with the memory specs I've mentioned: 4x32GB DDR5 at rates better than DDR4.",
            "I'm in the process of planning a new desktop build (currently only have a gaming laptop).   \nA friend of mine is getting rid of his RTX 4070Ti, so that's a good starting point.\n\nFor the CPU, I'm thinking of a Ryzen 7900X or 7950X (for the extra cores in productivity workloads vs the 7800X(3D)).  \nBut I'm wondering: should I bite and buy now, or do you expect it's worth waiting for the 8000 series to come along?",
            "Hello, i would like to upgrade my gpu, i was looking at a 7900xtx that's in the budget and i would like to know if my cpu would bottleneck me at 4k, i currently have a i5 11400f and my current gpu is a 3060ti.\n\nAlso, what psu should i get for the 7900xtx? i guess my **Seasonic Core GC, 80+ Gold, 650W** won't cut it anymore.",
            "I was wondering if I could use Corsair vengeance 16gb XPS Ram on my ROG Zephyrus G14 (2023)",
            "7800x 3d temp and ramp up\n\nwhile playing games my 7800x 3d keeps ramping up and down the fans becuase temps keep spiking to like 85c and dropping anyway to fix this? pretty annoying and loud, only thing i have done is put a thermal limit of 80 but hasn’t done much",
            " **What type of screwdriver will I need to disassemble a 7800 XT?**",
            "Is the stock cooler enought for the ryzen 7 8700g?\nYeah i disintegrated my budget on 32gigs of ram and got none left for a cooler. Im gona use the igpu built in it so i suppose thats gona get prety hot. Is the stock cooler enought?",
            "DDU + Reinstall of drivers fixed the issue. Just played for around 2 hours with all RT options enabled and zero crashes.",
            "Hey all, I’m looking to get a 7900 GRE as it’s very well priced over here in the UK, but I’m wondering what CPU to pair with it.\n\nI already have a 3600 so could easily drop in a 57/5800X3D, however I am well aware that AM4 is now a dead end. I do tend to upgrade every 4ish years.\n\nThe 7800X3D I know is the cream of the crop but it’d be a pretty big investment. We’re looking at about £600 for the CPU, Mobo and RAM. Big difference to £230 for a 5700X3D.\n\nMy point being, will a 5700X3D bottleneck the GRE? Or is a platform upgrade vital?",
            "I am upgrading my GPU from an rx 580 to \\[hopefully\\] an rx 6800. My current CPU is the ryzen 5 3600x. Do you think I need to upgrade my CPU and if so, to what? (note: i'm gaming in 1080p)\n\nCurrent build: [https://pcpartpicker.com/list/JdZcbh](https://pcpartpicker.com/list/JdZcbh)",
            "[deleted]",
            "I just bought a 7800x3d from Newegg. It has a \"2022 AMD\" date on the chip face. Should I be concerned at all that it was one of the first manufactured chips? Or do they all say 2022?",
            "Bout to pull the trigger on the 7900XTX hellhound (950)  is there any objections for me to get the 7900 XT hellhound (750) for the lower price?",
            " Does AMD Noise Suppression feature cause audio dropouts?\n\nJust asking because I recently installed/turned on this feature (not really knowing what it was to be honest) and the past few weeks I have been having lots of audio drop outs when gaming. Not so much in youtube videos, but gaming (Helldivers 2 specifically) has been having repeated quick 1/2 second dropouts of all audio.\n\nSo I will test some more now that I disabled it on startup.. but just curious if this could be why I started having audio dropouts.",
            "The power color hell hound 7700 xt is 400 dollars. My current gpu, a evga 2080ti, is dying. Would this be a good upgrade?",
            "My new build with a Ryzen 9 7900 died after only 30 minutes of operation. I updated the bios to the latest 7E12v18 version (MB is MSI MAG X670E Tomahawk Wifi, shipped with 7E12v14). I did enable EXPO on my KF560C36BBEAK2-32 kit (1.35V). Everything went fine installing windows 10, but during installation of programs the pc powered off by itself. Any attempt to power on fails after 1s, the powersupply turns off. When the 2x8pin connector for CPU power is not connected, or CPU isn't installed the powersupply doesn't trip. PSU is Pure Power 12M 750W, i did test with my old Phenom config and a 7800XT it's fine. Was using the stock AMD cooler at the time of failure. Did enabling EXPO kill the CPU? Did i just get a defective chip?",
            "So I switched my reference model 7900xt to a asus tuf 7900xt turned my pc on and was greeted by this message when trying to open adrenaline, so Google the issue download software incompatibility checker it finds nothing then disable the Windows updates uninstall driver in the device manager uninstall adrenaline and re install still no luck so a do a full ddu uninstall and restart download a fresh copy of adrenaline and the same message I'm stuck",
            "Does Ryzen 7600x support 7680 x 2160 60hz resolution? I want to run my 57\" curved monitor with just the igpu.[](https://www.reddit.com/r/Amd/?f=flair_name%3A%22PC%20Build%20Question%22)",
            "Hello,\n\nA few days ago I noticed hwinfo was reporting terrible performance of my CPU. I was tweaking settings god knows for how long and tried everything. Today when I ran Ryzen master curve optimizer I noticed than Ryzen master and hwinfo are reporting completely different clocks. 📷 For instance Ryzen master is showing 4.8ghz and hwinfo is showing 300mhz pretty crazy. If Hwinfo is right then my CPU is struggling to go above 4ghz at all times, if Ryzen master is correct it's easily boosting to max clocks and stays on 4.7 under load. So which one should I believe? Is there a way for me to confirm this somehow? Thanks for help in advance. \n\nBtw i mean effective clock speed not some \"max clocks\" bs",
            "I5 8600k overclocked to 4.8ghz is bottlenecking my rog strix vega 64. What should i upgrade my cpu to within the lga 1151 socket?",
            "hello! I've been having this problem for a year and a half now with **AMD Software Adrenalin edition** , every time I record or save instant replays the audio on **the last 5 seconds doesn't get recorded** , I tried reinstalling , I tried turning the instant replay off and on nothing worked\n\nis there any way to fix it ??",
            "Are there any real world idle power measured at the wall sources for the new 8500G, 8600G and 8700G CPUs?",
            "I have RX 5700 Red Dragon by Power Color, since 24.1.1 driver version it's marked as \"ASUS Radeon RX 5700\" while before it was \"AMD Radeon RX 5700\". Do you also have your GPUs incorrectly marked after 24.1.1?",
            "has the 7800x3d exploding issue been fixed? Can I run a 7800x3d on Asus ROG STRIX B650E-I GAMING WIFI Mini ITX and corsair 96gb (2x48gb) DDR5-6000 CL30? even though the ram module spec lists 1.4V?",
            "[deleted]",
            "Am I suppose to post in this thread like all questions are posted in this one thread?   Here is the question if so: \" I am trying to find ways to extend processing power for audio purposes, in addition to looking into external DSP cards/interfaces, as I have mutliple sytems I am wondering if there is any software or solution that allows Master/Slave clustering multiple AMD systems to utilize the slave systems resources as an extension of the master system. I have seen this might be doable through pcie/m.2 connections. Is there something that has been done, is it somehow possible to do this via a network card/ethernet port or USB4/HDMI etc..? I just figure that if I were able to use a second amd system like a laptop it could basically act like a DSP card as well as offer more usb inputs etc.. Is there some reason why clustering isn't just a basic part of computers for expanding systems with whole new clusters or things like phones to expand arm64 processing to a system? Anyone know of any clustering options available on windows 11?\"",
            "[deleted]",
            "Ive currently got a ryzen 7 3800x with a 6800xt on an x570 mobo, will I gain that much of a performance boost if I switched to a 5800x3d? Or is spending the $300 on the new cpu not worth it for my build?",
            "Hey im building a PC upgrade for my brother right now and am debating on switching some parts around.\n\nCurrently the build will include a 7500f and 7800 XT but i could squeeze in another GPU or CPU with his remaining budget.\n\nI could go for:\n\n7500f + 7900 GRE\n\nor\n\n7600X + 7800 XT",
            "XFX rma help\n\nSo I had bought a gpu more than a year ago and for about that year I have had troubles with just about everything, until recently I didn’t want to blame the gpu as other factors such as RAM and corrupt files had happened. Now though the only problem involves the gpu and Kernel-PnP 411 error.\n\nI want to return the gpu using the warranty or get a replacement, I never registered it until today and don’t know how to apply for an RMA on the xfx website. \n\nThanks for the help,\n\nDb_fab",
            "7950x3d in 2024 Windows/Linux gaming+productivity IMPORTANT\n\nHi everyone :) \n\nI'm about to buy the 7950x3d for gaming and productivity purposes, and I've done a lot of research on the topic. I have some questions that need answering.\n\n&#x200B;\n\nHow does the 7950x3d perform in Windows? Are there any issues with the Windows scheduler? I've come across discussions about Project Lasso, but I'm hesitant to use it as installing 3rd party software for a unsignificant performance loss is not relevant for me. I've also read about Game Bar, but I'd prefer not to have to manually choose between CCD 0 and CCD 1 every day.\n\n&#x200B;\n\nWhat about Linux? I'll be using Linux (Ubuntu) primarily for productivity across various software applications. How does the 7950x3d perform in that environment?\n\n&#x200B;\n\nI assume that by 2024, new motherboard and CPU drivers will have addressed these issues, correct?\n\n&#x200B;\n\nThanks for any insights you can provide.",
            "Basically whenever I enable Ryzen Master eco mode my computer just becomes unstable (Gets stuck at RAM part during bootup) but I cleared cmos and now it's fine. Computer runs fine otherwise.\r  \n\r  \nIm a bit worried that it means something is wrong with my CPU. My RAM does have expo on, but this happened only when I used Ryzen master to turn on eco mode. Bios is latest fwiw.\r  \n\r  \nIs my CPU/Mobo/ram bad? or does Ryzen master just do this sometimes?  \nFWIW Im using a Ryzen 7 7700x and a ASUS TUF x670e Motherboard. Once I reset the bios everything worked ok. Im just worried something is wrong with my CPU or motherboard (But otherwise system has been fine?)",
            "Have been enjoying my rig since a fair bit of time, over 2 months, when out of the blue, the damn thing suddenly went black, before falling into a power cycle the moment it tries to load Windows.\n\nIt even refused a fresh install via the USB stick, until:\n\nOnly thing that revives it is manually running the CPU at 2GHz with very high Vsoc and Vcore.\n\nIt isn't the RAM, SSD, PSU.\n\nThe PC was run **very** lightly, with CPU temps never crossing 70C, but voltage (core) was a bit high at 1.33V.",
            "I need an upgrade to properly run my new super ultrawide 49\" 1440p monitor and wondering if a 7800 XT would be a proper card to run it.\n\n\n\nPrior to this I had a normal 16:9 1080p monitor, and I was running on an Intel A770 Predator OC. Not the best card, I know, but for 1080p was serving me just fine.\n\n\n\nI hear the 7800 XT is a great value for 1400p, but not sure if the added resolution of it being a super ultrawide would make it too many pixels for the GPU to push with decent framerates.\n\n\n\nI'd rather not have to spend a few hundred more on a 7900, so please let me know. I'm not the most familiar with AMD, frankly. Last time I owned something from team red they were still flying under the ATi name. Thanks in advance.",
            "# \n\n# I can not device on which one to purchase, as I am no a budget this time around. Which one would be best for long term usage? \n\n# Dell - Inspiron 16.0\" 2-in-1 Touch Laptop - AMD Ryzen 5 7530U - 16GB Memory - 512GB SSD Model:i7635-A503BLU-\n\n# Lenovo - Yoga 7 16\" WUXGA 2 in 1 Touch Screen Laptop - AMD Ryzen 7 7735U - 16GB Memory - 512GBSSD Model:83BS0001US",
            "Does anyone have a timeframe for when the new am5 CPUs are released?",
            "So, I have a system with the following specs-\n\n* Ryzen 7 3700x\n* MSI B450m Mortar Max Micro ATX motherboard\n* GSKILL Ripjaws V 32gb (16x2) 3200mhz RAM\n* Nvidia GTX 1060 6gb GPU\n* Arctic Freezer II 240 AIO\n* 1tb WD SN770 M2 NVME + 500 gb Crucial SATA SSD +Seagate 1tb HDD for storage\n* Corsair CX650M 650w 80+ bronze PSU\n\nThe primary purpose of this PC is photo editing using Photoshop and Lightroom along with some graphics design, publication layout and design and occasional 4k video editing. No gaming whatsoever. The applications that I mostly use are –\n\n* Adobe Photoshop\n* Adobe Lightroom\n* Adobe Illustrator\n* Adobe Indesign\n* Corel Draw\n* Adobe Premiere Pro\n\nI am looking for some improvement in performance, especially with the newer versions of the Adobe tools. I am seeing the R9 5900x being offered at attractive prices on several online platforms. It seems the 5900x could be a great drop-in replacement for the 3700x after a bios update. I would like to know whether the MSI B450m Mortar Max motherboard would be able to handle the 5900x. Also, would the 3200mhz perform optimally with the 5900x? I am not too inclined on upgrading other components as in that case a platform upgrade to AM5 or the newer Intels seems to be a more prudent choice. Opinions please.",
            "I currently have a 3600/b450 carbon ac combo. I just bought a 5700x3d but haven't received it yet (will get later this week). Can I update my bios to the 7B85v1H1(Beta version) now and still have my 3600 work off of it, or should I wait until I receive the 5700x3d?",
            "Whats the best model rx6600? \nIm thinking about buying the gigabyte rx 6600 eagle 8GB, is this card good or should i go for an MSI or ASUS card. (All cards are used)",
            "Jagged edges and shimering effects in most of the games.\n\nAs the title mentions, I experience a lot of jagged edges and somewhat of a shimmering effect when playing games lately. Games like War Thunder, Baldur's Gate 3, Star Citizen, and some others just don't look good.\n\nCan anybody with some experience tell me what I could do to improve the overall graphics quality in games?\n\nI've tried using the enhanced settings and image sharpening in AMD Adrenalin, but it sometimes makes it even worse.\n\nSpecs: 1440p, i5 13600k, RX7900xt, 32gb DDR4 @3600mhz, 4 TB M.2 SSD\n\nAny help would be apreciated. :)",
            "Hello!\n\nSo i recently bought a ¨new¨ pc, and i'm kinda new on the whole pc world, but i was wondering as my bios was from 2021 (version 2423), do i need to update it? And if yes, can i just download the latest one?\n\nPc specs: Asus TUF GAMING B550 pro, Ryzen 7 5800x, RTX 3060TI 16GB ram.\n\nThanks in advance;)",
            "# after power outage pc wont turn on stuck in a Red Yellow light state\n\nCpu : 7800x3d\n\nmotherboard :msi b650-a wifi\n\nram :CMK64GX5M2B6000Z\n\nSo here is the deal in the region i live there are random power outages every month/week ,\n\nsometimes they are momentary , sometimes they are minutes to hours , so when the power drops for longer than a second the pc lock in a Red Yellow light state and does nothing after it (i waited 20 minutes to see if it will boot)",
            "Me and my friend both have pretty modern AMD tech in our computers and yet we can't run games with PhysX turned on at any high/consistent FPS. What's going on? Is the feature proprietary to NVIDIA Graphic Cards?",
            "Im seeing weird temps in HwInfo64 on my Ryzen 7 7700x. It's always the CPU die average, and it's been anywhere from 108c to 168c. What's weird is the other temps are fine. Is this normal? I assume it has to be a bug? Cause wouldn't the computer shutdown anything over 110c?\n\nAlso my other temps show fine. it's always the CPU Average die temp.",
            "Hello, short context country has low availability and bad economy. \n\nI have an R5 2600 and an RX 580. I'm thinking of upgrading the GPU and potentially the PSU since even though it's 600W, I saw on PSU cultist tier list it's an \"F replace immediately\" (it's what I could buy and thermaltake didn't fail me before, so not knowing this years ago I bouth a Smart). I am planning on taking the bet on used parts, because new the prices are just stupid for not the best performance, generally speaking. My monitor is 1080p and while I don't mind lowering some graphics or resolution, I do like to look pretty if possible. With this in mind, I have 2 paths. \n\n1) Buy the 6700XT Swft 309 (the speedster 319 is too big for the case) and a Gigabyte P650B or an XPG Core Reactor 850W (I could also get a Pylon 750W without box).\n\n2.a) 6600XT 308, P650B and ASrock Steel Legend motherboard. This is so maybe in the future I can put an M.2 NVMe drive (current mobo is MSI b350m pro vh-plus) and maybe get a Ryzen 5600/5700 as well.\n\n2.b) 6600XT 308, Core Reactor / Pylon, no mobo. \n\n  \nI do want to get a more reliable PSU, but I this one is \"fine\" and I feel going from 600W to 650W despite the quality, is a bit of a waste not much of an upgrade, however going for a core reactor would be a bit overkill if I just change the 580 to a 6600XT, no? \n\n  \nThoughts? \n\n  \nThe games I play range from CS2 and Cities Skylines (not 2 because I can't run it) to BG3 to Ready or Not or Gray Zone Warfare and Blue Protocol (upcoming games, FPS and MMORPGs). To give you an idea about the type of things I play the most.",
            "# Ryzen 5 7500F and Radeon RX 5600 XT\n\nFirst time posting, wanted to ask if this combo would be good for my future build and if it can run most games on high fps ( 100+ fps? ). Im on a budget",
            "At 1440p, I have a 3950x with a 6950xt. Is it worth upgrading to a 5800x3D or a 5950x?\n\nI mainly play video games but usually record and edit when I want too. Planning on editing and recording more often for content creation. Will a 5800x3D really slow things down compared to a 3950x? Will the boost in game performance be worth while if all other programs are slowed down and how much of a boost is it actually from a 5950x since its 1440p?\n\nBudget is $400 which is fine for either CPU so don't use price point a major concern.",
            "[deleted]",
            "Voltages, ram, cpu and SOC clarification\n\nHi, I have read through all the past problems on some boards, and I am left with some doubts, I have a bios with the AGESA fix as it was called and saw many discussion explaining on how to limit the SOC voltage to 1.3v...\n\nNow my cpu on auto with a -10 CO stay on the 1.10/1.2 at peaks I think, my my 6000mhz ram is set by comp at 1.35v...\n\nPeople were saying to disable xmp and limit the whole SOC to 1.3, effectively removing ability to use xmp and such.\n\nWhat I don't get is the relation of the 2 and if I should be worried or how can I limit only cpu voltages.\n\nI know the SOC manage voltages indipendently so can't understand the risk.\n\nIs anyone willing to explain to me all this Voltages story and possible preventions? \n\nUnfortunately can't update bios more than this with successive fixes because it won't post with any newer than my F9 (b650i aorus ultra with a 7800x3d)\n\n\nThanks to everyone who toots the time to read through!",
            "7800X3D humming/buzzing in idle \n\nPre: I am 99% sure it's the CPU as the only way to stop the noise is cpu load.\n\nAfter getting rid of the AIO cooler I noticed noise in idle. It sounds like electrical buzzing? It stops at a certain (low, but browsing isnt enough) amount of CPU load. Before I thought this noise was coming from the AIO tbh.\n\nCPU was undervolted with CO, same behaviour at stock though. \n\nVideo: https://youtube.com/shorts/yS8_3Q4TScE?si=ZaLdJJxiJPkYher_\n\n\nAny ideas what it may be and how to get rid of it?",
            "B550-F Gaming Wifi.   \n5900X on Noctua NHD-15. \n64gb DDR4 3200. \n990PRO 2TB   \n7900gre. \nACER 27\" Predator 1440p 144htz.   \n\nUpgraded from a 2070 8gb to a 7900gre HELLHOUND. I generally play at 1440p or 1080p. \nWhile gameplay is generally enjoyable, I am noticing some stutters. I'm assuming the 5900x, and plan an upgrade to am5 within a year or so. As my title states, I'm wondering if I was expecting too much. My 3dMark went from 9k to 19.5k with stock settings. I don't really do too much overclocking, outside of the presets.  Tried 32gb at 3600 and there was zero difference. \n\n90-120fps in cyberpunk 1440p high. \n120+ in bl3 1440p high.   \n100+ fps in Gta5 with lots of stutter.   \nHaven't done too much outside of these, and in general this is what I'm usually playing since I'm pretty busy. \nThanks in advance",
            "AMD SOFTWARE UPDATE BRICKED MY PC\n\n\nThe new update. Even when I made a fresh new install for the Amd Software update for my Radeon 6950XT it keeps bricking my PC. \n\nWithout the software Everything runs fine but when I download it my PC won't open anything application. The Shutdown Button on my PC even stops working. \n\nCan't figure out what to do",
            "Is Sapphire's 7900XTX a solid option, or are they not a good manufacturer? My case only supports up to a 320mm card, and their 7900XTX is the only one that's below 320mm that I can find.",
            "PC Upgrade Path/Question\n\nHi there! I’m currently looking to upgrade my PC and currently have a 3600x CPU and a 5700 GPU on a b450 tomahawk max motherboard. \n\nBeen thinking of upgrading the cpu and gpu to the 5800x3d and 6700xt respectively and am wondering if this is a good choice and/or if I should start with one of these parts? I’ve been seeing some people saying the upgrade for the gpu isn’t that big so I’m wondering if i even need to get that! Any advice would be appreciated!",
            "I haven't had a desktop in about 10 years but I have a laptop from 2019 it's still works all right. \n\nShould I build the PC with a 7800 x 3D or should I wait until the new chips release? I noticed the 7800 x 3D is on sale right now.\n\nThere's nothing specifically I want to play right now. I just want something that I can play for a while at 4K 60 or 1440p 144hz",
            "\"I'm planning to use the 7950x and B650M. I want to use 128GB (4 slots). Is this feasible? I'm an average user, I don't know about BIOS. I only care about capacity, not about frequency.\"",
            "hello amd community i recently upgraded to a rx 7900 GRE and I'm happy about it but should i upgrade my other parts and if so is it worth the money ?\n\ni play at 3440x1440 so maybe the bottleneck is smaller \n\nspec:\n\ni5 10400f\n\nMS; Asus prime H510m-e\n\nram teamforce (8x8) 3200\n\npsu: Deepcool DQ850M-V3L\n\nssd 1tb kingstone m.2\n\n#",
            "Hi everybody,\n\nI've build a new PC system with an AMD Ryzen 5 7600x and an RX 7600. It works like butter, however, sometimes when I'm playing League or I'm opening Valorant (haven't had problems with other games, yet) my PC starts to lag, giving me 3 FPS during game and also my Desktop lags. What I was noticing is that when I tried to open the AMD Adrenalin app it wouldn't let me, even opening it as an administrator. Once, I had the app open and checked the temps and parts - everything was fine.\n\nI'm quite the PC noob, so I haven't tried anything like reinstalling drivers.",
            "my 8700G crashing in every game since the last agesa update.",
            "**DDR4 sTR5 socket motherboard suggestion**\n\nI currently have the existing setup:\n\nRyzen Threadripper 7980X\n\nASUS Pro WS TRX50-SAGE WIFI\n\n64GB x4 (DDR5)\n\nHowever, my current workload requirements, specifically for the RAM are much higher than anticipated. Given the limitation of 4 slots in TRX50-SAGE and the crazy price for DDR5, the upgrade seems to be very costly.\n\nI need a minimum of 1TB RAM support 2TB would even be better. Seeking to switch to a DDR4 board, Can anyone please help me recommend a sTR5 socket motherboard with 8 or 16 DDR4 RAM slots?\n\nThank you very much and it'd be of great help.",
            "Should I bios flash rx570 to its bios from an rx 580 bios that is currently installed.\n\nI bought a used rx 570 and it came with a standard rx 580 bios installed. It seems some people have done this purposely but I dont know why and I can't find a reason after searching around. I wanted to know if there was any advantage to this bios or maybe it was some mistake and my card would likely run better with the correct bios. I should note my card isn't running terribly or anything but I just don't want to be running higher thermals or losing stability for nothing.",
            "Hi, recently I run into problem where my cpu temperature would go up to 80 degrees celsius while playing mw3. I know it's supposed to run till 89 before it throttles, but before that my cpu temperature was hovering around 57-64 degrees with aio cooler. What is strange about the issue it happens in middle of the round after 5 - 7 minutes of gameplay every time. Temp rises till 70 degrees with usage rising from 30 percent to 40 - 50 percent, spikes to 80, runs like that for 15-20 minutes then after some time goes back to 60 - 64 and stays at that range for the rest of gameplay with the same cpu usage. Issue persists only when playing this game. Running games like ac valhalla for hours and temperature never rises above 60 degrees at the same framerate. Cpu frequency stays the same all the time while fluctations are happening. Running cinebench gives the same results as day 1 when I built computer, temperature maxes out at 83 degrees and no issues with that so I don't think cooler or thermal paste are the problems",
            "Hello I'm debating whether to get the 7800x3D or the 7950x3D and frankly I am unsure of which one to go for I mostly plan on using my PC to play games, record videos as well as edit those videos. And I don't really plan on playing, recording, or editing on 4K the highest I'll probably ever go is 1440p. So I just want to get the input of everyone here to see which one would be best suited for what I plan on using my PC for.",
            "On AM5, how does memory training work? What does the PC do?\n\nI have two issues: \n\nSometime on boot fans blast at 100% longer than usual, but eventually it posts.\n\nNow I had two days when all I get is black screen with fans barely running, after restart button PC boots fine.",
            "Can someone help me understand the random temp spikes? While gaming I can hear the CPU fans ramp up and then I toggle to HWINFO and I see that the temps had a brief spike. Average gaming temps is 64c over a gaming session, but I get an occasional 81c (+/-) spike thrown in there. Is that an issue?\n\nIm trying to chase down a random COD only crash ( no windows or BSOD crash ) so I have CO turned off right now.\n\nThe cpu in question is 7800x3d",
            "Hi!  \n  \nFor about 2 or 3 years, I've been rocking a budget built computer with an RX 480 and an old 4th gen i5.  \nFor that time being I've felt that I could've made a better investment, seeing other possible components.  \nThen when the prices of the last few gens of GPUs and CPUs by AMD dropped recently I noticed how cheap they became.  \nSo I came here to ask if I should upgrade my entire PC (including the MOBO because I'm using an intel CPU currently) to a combination of a Ryzen 5 2600 and RX 5700 XT?  \nI've heard lots of good things about both components on how they're \"budget friendly\" and a good combination for builds that don't cost a fortune, giving a pure price to performance experience.  \n  \nThoughts?",
            "[deleted]",
            "Long shot: have the rx6800 sapphire pulse (undervolted 80% or standard profile), love the card, have it since it released. All drivers kept up to date (DDU'd and reinstalled), bios, chipset etc. Windows 11 32gb 3600 ram mem tested, single stick tested. 5900x cpu, msi 550 gaming plus and 600w power...\nWas playing helldivers 2 (60+ hours total, with no issue), artifacts started. Now artifacts are everywhere, even on the desktop, YouTube, splash screens etc. Any heavy load like a basic game it's freaks out with loads of artifacts. YouTube, snow in the black areas.\n\nI'm assuming my vram is just cooked? And there's nothing I can do? There's no RMA available. Just wondering if there's any suggestions or any self repair tips. I'll likely cave to buying a second hand card to replace as money is tight.\n\nAdditionallly the PC never crashes, it's just artifacts. The gpu never runs hot, all readings are pretty nominal.",
            "AMD RX 7900 XTX:\n\nSAPPHIRE Vapor-X 24GB GDDR6 Nitro+\n\n GIGABYTE Gaming OC 24GB\n\n XFX SPEEDSTER MERC 310 Black Edition 24GB GDDR6\n\n\n\nHello,\n\nBefore buying the card in question, I decided on these 3 brands. All three are pretty much in the same price range in my local market.\n\nWhich one would you choose and why?\n\nIf possible, state the pros and cons...\n\n\n\nFor the record, I'd also like to know if any of the above might be compatible or not with my current hardware:\n\nMB - Asus Prime Z590M-PLus\n\nCPU - Intel Core i5 11600K (can switch to 11900K)\n\nRAM - Corsair 32GB DDR4\n\nPSU -  EVGA ? 1000W",
            "Hey there I have a full AMD PC build but I do not know much about PCs only the basic things. My PC seems to be heavily underperforming in every single game that I play. The FPS usually drops significantly and I do not know the reason for this. I have built this PC myself and I would appreciate it if someone could ask for ss of anything to provide help or even provide help directly. Thank you :)\n\nMy specs are AMD Ryzen 7 2700, RX 5700XT and 16 GB of RAM",
            "I built my first PC a few years back and bought this CPU, but the temps worry me. When gaming, it ranges anywhere between the 70s and 85°C, and depending on how high the game graphics settings are, it sometimes reaches 87°C and touches 90°C. The cooler I'm running is the Noctua NH-C14S. It doesn't seem to be enough. Should I get a new cooler, or what should I do? Also, I am forced to run the PC with no glass panel; otherwise, it overheats.\n\nMy full PC build\n\nCase - SilentiumPC Regnum RG4T\n\nMotherboard - Asus ROG STRIX B550-F(WIFI)\n\nGPU - Asus GeForce RTX 3080 ROG Strix\n\nCPU - AMD Ryzen 9 5900X, AM4, 3.7 GHz, 12-Core\n\nCPU Cooler - Noctua NH-C14S\n\nPSU - Corsair 850W AX Series AX850\n\nRAM - Corsair 32GB (4 x 8GB) Vengeance LPX, DDR4 3600MHz",
            "My screen keeps going black, PC remains on. I tried everything in the ''read this before posting'' and lost a ton of time even reinstalling windows and every software. I need a way to know why the videocard is crashing and what is causing it. Only happens when playing Diablo 4, not with other intensive games like CyberPunk for example. I tried lowering fps and graphics as well. Also the PTR version of Diablo 4 doesn't crash my video card. Other people do not have this issue.",
            "Alright guys, ive looked at what feels like every post that has to do with this, and im STILL not getting a solution.\n\nI recently bought a 6900XT and at first it was AMAZING, running 90-100% on cyberpunk maxed out ultrawide 2k settings 100+ Frames easy. Then a windows update came. Let it update not thinking anything of it. After that, Im lucky to get 70-80 fps and it drops to 20-30 while i run around town. (Maxed out 2k settings with Ray tracing enabled but only light reflections on. other RT settings off.\n\nMy gpu REFUSES to go over 70-80% utility on ANY game now. The problem I think is, I took too long to figure out it was a windows update issue. 10 days had passed so i couldnt revert to previous version through the button. Tried forcing to an old windows from last year manually, but the issue still is there :(\n\nI thought the cpu could be bottlenecking at first, but gpu was running fine to 95-100% before the update??? Cpu Runs close to what the gpu is. 50-65% Utility\n\nGPU temps never went higher than 65 and CPU temps didnt go higher than 70.\n\nIm afraid I might have to do a full system clean and restart. But even if I do, wouldnt it just update to the newest version of Windows 10 anyways????\n\n(I AM NOT GETTING THE AMD DRIVERS HAVE BEEN REMOVED NOTIFICATION THAT SOME PEOPLE ARE GETTING! NO CRASHES, Grey screens or ANYTHING like that. Just shit GPU utilization.\n\nAMD Adrenaline settings are set to default or HYPER-RX. But neither really make any difference with UTIL for me right now.\n\nSpecs\n\nAMD Ryzen 9 3900X 12-Core Processor\n\nSapphire Pulse Radeon 7900xt\n\nCorsair LPX 32GB (2x16GB) 3200MHz\n\nASUS ROG Strix X570-E Gaming ATX\n\nMSI MAG A1000G PCIE-5 1000W PSU\n\nHelp would be massively appreciated. I know this thread has been reposted multiple times a year. But my specific issue doesnt seem to be resolved by them. I could easily be missing something. I just been messing with this for days and im at my witts end.",
            "Hi. I'm having an issue with the high idle power usage (around 100W) and vram not declocking (stuck at max frequency) on my 7900 XTX. I'm running a triple 1440p 144hz monitor setup with DP 1.4. I tried various things like changing the refresh rate, enabling/disabling VRR, creating custom resolutions, playing around with CRU, fiddling with monitor settings and while maybe there were some small changes in the power draw, the VRAM frequency is still maxed out which results in around 100W power draw. Now the funny thing is that when I have 1 or 2 monitors running the VRAM downclocks properly and the power draw drops to like 15W. It doesn't matter which monitors exactly are running, tested it with every combination. I am currently out of ideas and don't know how to fix this other than by keeping one of my monitors off. Does anyone have any ideas ? Thanks in advance.",
            "6800 or 7700xt",
            "Question concerning Freesync premium pro with new 4k oleds. Not sure if anyone else is running into this problem but this is what is happening. On my AW3423DWF I get freesync premium pro in adrenaline but for my PG32UCDM I am only getting VRR compatible even though it is labeled as freesync premium pro in the OSD of my monitor, on the ASUS website, and on AMD's official list of Freesync Premium Pro monitors. \n\nMy question: What is the fix for this? Is this fixable I.E, a bug and not a feature, or is this juist how it is?",
            " I'm upgrading in the upcoming month so I need opinions on which is the best or some of the best 7800xt models available (US) so any experiences with specific models is appreciated, so far the Powercolor Hellhound looks sick , and the XFX has 3 year warranty, any other notable details about any model?",
            "Is anybody buy this item ,what about it? \n\nMini pocket computer  AMD Ryzen7 5700U 16+ 512 G SSD NVME SSD \n\nnow only 248 [https://www.amazon.com/promocode/A3L78827LNGH13](https://www.amazon.com/promocode/A3L78827LNGH13)",
            "I have an radeon r5 M330 in my laptop and an Intel i3 6th gen WI 8gb of ram. I recently downloaded CS2 but whenever I open it. It says that my drivers are out of date and it affects the game play too. On amd software there is no option for updating the drivers anywhere and it only checks for possible updates for the software not the drivers",
            "Just got a Power Color Fighter 7800xt last week, in very gpu intensive games like Cyberpunk, it can get up to 80 degrees very quickly, highest I've seen is a max of 85. Is this normal for the 7800 XT? Should I repaste it? What are good possible undervolting guides?",
            "Do i get a 7900X now and move from my 5700X? Its bottlenecking my 4080 quite a bit. Or do i just wait for Zen5? Or maybe get 7900X now and Zen5 later? ",
            "Has anyone ever heard of an AMD CPU called an AMD64 Family 21 Model 2 CPU? I’ve never heard of this model before, is it an older one?",
            "How good is the MSI PRO B650M-A WIFI motherboard for pairing with Ryzen 5 7600? It's the only AM5 mobo i can get, but i have read some issues about it having super slow boot time\n\n  \nEdit: Accidently put wrong number of motherboard",
            "HwInfo is showing my FCLK maximum at 2800; I currently have it set to 2100. Is this something I should be concerned about? When I had it set to 2067, I never saw a spike like this. It was a constant 2067 across current, min, max, and average.",
            "Hello. Been using my Gigabyte 7800 XT for a month now. I have been encountering two strange issues during my gaming sessions (mostly when playing WoW retail) - whenever I make a sharp movement with my camera in game, the screen goes black, fans on the GPU go silent and the metrics overlay goes away. Sometimes I have to restart the system, sometimes just waiting it out works but when system does come back up, it resets my monitor colour correction profile. I also have an issue of when I tab out of the game, everything start lagging, as if though the GPU goes gone offline and it stays that way for 15-20 seconds until metric overlay comes back up.\n\nWhenever the first issue has occurred, the GPU usage has been near 99% with the power usage close to 300 W. The latter issue happens... randomly. Could be once a day, could be several times a day.\n\nCould my PSU be at fault here? At this point it's 5-6 years old Enermax 650W unit. [https://www.enermax.com/en/products/revolution-d.f.-650w](https://www.enermax.com/en/products/revolution-d.f.-650w)\n\nThe rest of the system\n\n* CPU - Ryzen 7 5700X with an auto overclock at 3.98 Ghz. RAM - 32 GB MB (overclock via BIOS to 3133Mhz)\n* MB - MSI Gaming X470 Plus (it only has PCI 3.0)\n* HDDs - one M.2 and one 500 GB SD\n* 6 case fans (mostly be quiet!)\n\nThanks.",
            "Hi all, I need some help and guidance.  \nI have a PC with a Ryzen 9 7950X. I use it to run simulations and not gaming.  \nThe simulations are pretty much running 24/7  \nThe issue is that with stock configuration, the CPU runs constantly at 95 degrees celcius 24/7  \nIf I do anything in AMD Ryzen MAster and reduce the maximum allowable temp to 90 degrees for example, the CPU's max frequency drops to 3.3 ghz after an hour or two of sims. it can maintain a frequency above 4.4 ghz with the default profile.  \nI was wondering if it's ok to have the CPU running at 95 degrees 24/7?\n\nThank you.",
            "Does anyone have experience with the 7900 gre for PCVR? Looking to upgrade from an 6600xt.\nThe 7900gre is about 50euro's cheaper then a 4070super.\n\nAt the moment I use a quest 2 via quest link.",
            "Bought the 5700x3d a few weeks back and loving it, how long do you guys wager this will last when it comes to 1440p gaming? I have a 3070 right now and I'll be upgrading to the 5xxx series when it comes out.",
            "[removed]",
            "AM5 motherboard\n\nI am in need of building new system. But haven't been much connected with hardware lately. My main focus will be video editing and some minor gaming. I did pick up ddr5 32gb, Ryzen 9 is coming soon. But can't decide which mother board to get. Any help and suggestions are greatly appreciated. Thankyou",
            "[deleted]",
            "Trying to build a new PC over the course of several months cause I can't afford to buy it all at once. My philosophy tends to be future proofing as much as possible. Current build is about 10 years old save for the gpu which is 5, won't be replacing that. \n\nI want to get a 9750x3d if possible but I've seen conflicting information on what kind of RAM should be paired with it. Is staying below 6000 speed still the recommendation for it?",
            "Hello, first of all, sorry for the English in this post, I am using a translator since I speak Spanish and I had never used reddit so if I do something wrong, I apologize in advance.Basically after changing my processor to the Ryzen 7 7700, I have had temperature problems, every time I open an application I notice that the frequencies go to the maximum and that causes the temperature to rise too much (70 - 80 celcius) but when the program finishes open or load, the temperature decreases again, I was looking at undervolt options but when I installed ryzen master, the program does not let me use curve optimizer because it basically does not appear and I cannot put it in basic view either, I would like to find a solution and I appreciate any help that I can receive",
            "Would anyone happen to know which AMD Ryzen generation got nested virtualization running with decent speed? I know there was a problem across with board with any virt platform + AMD + nested VMs but I don't know if it was fixed with Vermeer or something older.  Thanks!",
            "What is the deal with cpu metrics in adrenaline? I feel like I lose CPU data every other boot.",
            "Which motherboard would you suggest for a new build with x78003d CPU, also what 32GBx2 8000mhz RAM sticks should i use that work without problems ( or 16GBx4 if it is faster)",
            "Hi I have a build question in relation to the AMD r7 7800x3d vs R9 7900x\n\nI went to a pc store to buy an r7 7800x3d however as it wasn't in stock and the price of their supplier just went up, they suggested going with the r9 7900x instead. \nMore cores at a faster speed etc. Only £30ish more\n\nI had previously picked out the 7800x3d specifically for escape from tarkov as the community say it's like the gold standard cpu.\n\nWill the r9 7900x be a flat upgrade or will there be any drawbacks? The price isnt an issue but I don't want to spend more on something that could perform worse. Bearing in mind I won't be doing any video editing/processing, only gaming.\n\nThanks to anyone who replies.\n\n\n\nRest of build (if it matters)\n\nAm5 asrock a620m Pro rs ddr5 mb\n32gb 6000mhz ram (2x16)\nNvidia 4070 gpu",
            "Hello, i have a problem with adrenalin software because it dont have the record and stream option, why it dont have and how can i solve this problem?\n\nEdit for info: my processor have integrated graphics and is a radeon 5 5600G, i tried desabling on the device manager, downloaded diferent versions of adrenaline and still nothing about the record and stream option apears, oh, and my device manager dont have the amd graphics and processor separately on the display adapters, only one big AMD radeon graphics",
            "Hello, I’ve found a 2 month old Ryzen 9 7900x3D for £300. I currently have a 5600x paired with a rtx 3070 and game on 1440p. I was wondering if upgrading the cpu would be worth it or if I should just wait for the Zen 5 to be released, as apparently there are rumours that it’ll be launched this year. \n\nI would also have to upgrade the motherboard and ram which should be £500 total with the cpu. Should I go for it or should I wait? Will the impact in performance be big? Thanks!",
            "Best GPU max settings 1080p\n\nI have a large screen projector with decent latency, refresh rate is what kills me at 60hz. I want to build a solid/really good rig that will last me 4-5 years and run max settings well. By the end of the 4-5 years I’d still like it to keep up with new AAA games then running minimum 60fps. I don’t want overkill, meaning I don’t want to pay for something I won’t benefit from. I also don’t want to pay 50% more for 10% better performance. Would love any help. Thanks all!\n\nBonus: recommend what CPU to run it with.",
            "I have a laptop with Ryzen 9 7945HX which is pretty similar to 7950x, same two CCDs but with lower clocks and power.\nIn most games, including updated Cyberpunk 2077, second CCDs cores are completely idle, 0-1% utilization. While CCD1 cores are doing all the work.\nCore temperatures are varying a lot too, some of CCD1 cores are in rush at 97c , while some of them are 85c, and CCD2 is just casually chilling at 70c.\nCPU throttle according to the hottest core, so overall utilization is pretty inefficient.\n\nShouldn't games utilize second CCD cores too? This is a game engine limitation and that's how AMD BIOS prefers cores?\n\nRedditors with 7950x/7945HX, do you have the same \"only-first-CCD\" utilization behavior in games on your systems? Is mine okay?",
            "Hi, \n\nDoes Ryzen 7800x3d support 4 screen Daisy connection via DisplayPort 1.4 ?",
            "Hello, im gettig an OLED soon and someone suggested to turn on the PCs sleep mode. I heard back then when i bought my XTX that the sleep mode is broken on AMD cards and i kept it off ever since. My question is, is that thing broken still or is it fixed and the pc will actually wake up from sleep mode now?",
            "# 1.524V on 5950X with everything auto. PBO is auto.\n\n  \nOnly voltages I have change are for ram, I run 1.4V on ram and +0.1 (0.7V) dram termination.  \nEverything else is auto.  \nMotherboard is x470 gaming 7.\n\nI don't care about temperatures, I have a Core p90 with a monoblock and a 480 Radiator  \nIs this OK for the longevity of the CPU? Motherboard has a 10 phase 40amp vrm, which means its MORE than capable to provide 180-200W for a 5950X.  \nAlso this bad boy hits 5050 Mhz on 2 of its strongest cores with everything on auto, multiple ones hit 5000, and EVERY single one hits 4.900.  \nIs this the golden daddy of all 5950X's ???\n\nhttps://i.redd.it/t1atq5c75mvc1.gif",
            "I got an RX 570 and an rtx 3070 on my pc. I upgraded but decided to keep both. My two issues are: \nMy rx 570 used to idle at 5 watts and not it idles at 20. I found out it's because if I have it connected to a monitor it maxes out the memory clock. This is something that didn't use to happen.\n\nIf I run a game, it runs from whatever GPU I got my main monitor plugged in at the time. Even if I switch the cable after the game has launched it keeps running in my original GPU. I want to make it so I can run different programs on different GPUs at the same time without needing to hotplug my monitor. However if I go to do the high performance or low power option in Windows both show me the GPU I'm connected to. How to set my rx 570 as low power and my rtx 3070 as high power?",
            "Can anyone recommend a good *quiet* cooler for the 7800X3D? I'd prefer to put it in an ATX mid tower, but if a full tower with some big slow case fans is going to give me better, quieter airflow I'll do that. (It'll be paired with a Sapphire NITRO+ Radeon RX 7800 XT)",
            "Hello! I can get the [MSI 6750 XT Gaming Trio](https://www.msi.com/Graphics-Card/Radeon-RX-6750-XT-GAMING-X-TRIO-12G) or the [XFX 6700 XT](https://www.xfxforce.com/shop/xfx-speedster-swft309-amd-radeon-tm-rx-6700xt-core-gaming-graphics-card-with-12gb-gddr6-hdmi-3xdp-amd-rdna-tm-2-) for the same price. Which one should I go?",
            "I currently have a 5600 and I'm considering upgrading to the 5800x3d. I have *DUAL RANK* 2400Mhz RAM from Crucial. Can I upgrade safely or is my RAM limiting too hard? How fast is dual Ranked RAM with 2400mhz in comparison to Single Rank RAM? I always thought it would equal around 3200mhz single Rank. \n\nThanks! :^)",
            "i have a 7900xt and my video codec engine is stuck at 70%, can someone tell me why or if this is an issue?",
            "Hi, I just upgraded to an ASRock B650 Livemixer and Ryzen 7700X, can i update the bios straight to the latest version or do i have to do them one by one like before? Are there any bios versions to avoid?",
            "**Summary of the issue**: Hardware encoding video in Jellyfin to H.264 produces major artifacts.\n\n**What I have tried to resolve the issue**: Tested version 10.8 and 10.9 (unstable branch) in Docker and natively on Ubuntu, tried 10.8 in Windows w/ latest AMD drivers on Windows, changed settings (e.g. tone mapping), reset BIOS to defaults...\n\n**System specifications:**\n\n* OS: OMV 7 (based on Debian Bookworm), latest updates, Mesa VA-API drivers\n* CPU: AMD Ryzen Pro 5 4650G, cooled by a Noctua NH-9a, stock settings/no overclock\n* GPU: Integrated APU\n* Motherboard: Asrock X300 (Deskmini), BIOS 1.80E\n* RAM: TeamGroup Elite 32Gb DDR4 3200MHz SO-DIMM, no OC/Overvolting\n* Storage: 2x 4Tb NVMe, 2x 4Tb SATA\n* PSU: Deskmini X300 stock PSU\n* Display: n/a\n\nI moved my home server from a Deskmini A300 (w/ Athlon 200GE) to an X300 w/ 4650G and was hoping to be able to use hardware transcoding for my Jellyfin media server. I installed it as per instructions, but the image will sooner or later degrade. It often starts well, but either after some time or after skipping back and forth a bit, it will become unwatchable with blocky artifacts, sometimes over \\~70% of the image.\n\nThis happens more with higher res files (e.g. some 10 bit HEVC files in full HD), but also with smaller SD files in H.264, when Jellyfin transcodes them to H.264. The effect will often be intermittent, with periods of normal image and then \"defective\" output again.\n\nThis happened both under Linux with free drivers and under Windows with proprietary ones. Software encode is okay.\n\nIs this normal? I know Renoir's hardware encoder for H.264 isn't great, but as there are periods of okay playback, it can't be the whole reason...",
            "**summary: used 3970x or spend more for 7970x**\n\nIm in the market for a threadripper, and there seems to be a noticeable amount of second market parts for the 3970. my use case is a general purpose linux workstation for programming and scientific computing, but I also have a industrial computer for actual heavyweight work that id be connecting to. I need a daily driver, and was wondering\n\nshould I get the newer 7xxx thread rippers that support ddr5\n\nor cut costs with an aftermarket 3xxx thread ripper that supports ddr4?  \nis the performance between ddr4 and ddr5 that vast? im looking to have 128gb of memory\n\nmy budget is incredibly flexible, but id like to cut costs wherever possible and get the best bang for my buck. im not looking for the latest and greatest, just pure multithreaded performance per dollar, and least amount of fuss and configuration\n\nit'll be paired with a 4090 card",
            "When is AMD gonna acknowledge they have driver issues with some games, its getting quite tiring to keep being accused of having hardware issues, despite having friends that have reproduced the issue.",
            "Enhanced Sync Problem\n\nRyzen 7 1800X\n\nRX6700XT\n\nWhen Radeon Enhanced Sync is enabled, the image on the screen freezes completely when opening any interface inside the game. This may occur when opening a map, inventory, main menu, etc. Pressing Alt-Tab or disabling it helps to avoid this.  Tried it with Freesync enabled or disabled even Vsync too",
            "I'm in the market now for a passive cooled rig, which in principle would mount a Ryzen 5500. I don't follow the CPU scene too much, so I wonder if there is something in the pipeline now, with about the same heat dissipation, and more bang :-), worth waiting for, max 6-8 months. Well, is there?",
            "[deleted]",
            "Hey everyone, today/tomorrow I am looking to buy a GPU for my father. He's playing mainly on 2k/4k. I've found a good price on a 6900xt Sapphire nitro SE that is also the same price as a second hand new box 7800XT Hellhound.\n\nPrice for 6900xt: 361 Euro / 384$  \nPrice for 7800xt: 361 Euro / 384$\n\nI am aware that the 6900xt draws more power, I don't mind it.\n\nJust need some advice on which way to go here in terms of reliability and quality.  \nGPU will be used for gaming only.  \nThank you!",
            "Hi, I realised my pc was not using my 7800xt and was using what i think was the igpu. So i went into bios and disabled the integrated graphics and now my monitor is saying that there is no signal. How do i fix this?",
            "I Have been experiencing big pc slowdowns to around 2 3 fps after alt tabbing or closing a game, it happens from time to time, not always, no idea what causes it but im 100% sure its the gpu issue, as it started happening after switching from nvidia to amd, clean windows install.\n\nThe overall system perfomance is fine, it just happens from time to time and is annoying especially when playing competetive titles  \nSystem Spec:\n\nOS: WIN 11 23H2 BUILD 22631.3447\n\nCPU: I5-11400F STOCK COOLER\n\nGPU: RX6800XT PHANTOM DUAL OC STOCK SETTINGS\n\nMOBO: Gigabyte B560 HD3 (rev. 1.0)\n\nRAM:  GOODRAM IRDM DDR4 2400MHz 8GB X2\n\nStorage: 2TB GOODRAM SSD\n\nPSU: GIGABYTE P850GM 850W\n\nDISPLAY: AOC CU34G2X/BK DP CABLE",
            "Hello, I have a question recently I performed a DDU on my GPU in order to switch to minimal driver, my GPU is an Asus RX 7800XT OC the model with 3 fans\n\nBefore in the GPU Tweak 3 application my card was displayed by default with a frequency of 2585 MHz\n\nNow when reinstalling my GPU is displayed with a default frequency of 2610 MHz\n\nMy question is: does gpu tweak overclock my gpu by default? because on the manufacturer's sheet it is displayed as 2565mhz am I at risk of damaging my card?, by default I reduced its GPU voltage by -80mV this is the only parameter that I changed",
            "Hi\n\nI have a gaming PC with this configuration ([https://pcpartpicker.com/list/WN2ydH](https://pcpartpicker.com/list/WN2ydH)). Since past week the computer gets turned off whenever I run any game(tried 2-3 games like valorant and CS).\n\nThe same computer however shows no signs of problem when benchmarking on GPU(furmark 2K, 4K both), CPU(cinebench single core multicore both), SSD(crystaldiskinfo), HDD.\n\nThe Event viewer records nothing except  \n\"The previous system shutdown at <<TIME>> on <<DATE>> was unexpected.\"\n\nThe temperature even on full load(stress test) doesn't go more than 80 on CPU and 45-50 on GPU.\n\nMemtest86 doesnt show any errors too (4 pass 13 tests 2.5 hour each RAM)\n\nI reinstalled fresh copy of windows and BIOS is also updated to latest available version.\n\nEven if I leave the computer running for full night nothing happens and it doesn't shut down even once. One more thing is when the computer shuts down after running any game it cannot be started again until I manually switch off the PSU either from plug or the I/O button behind the cabinet. I am attaching the link to my YT video where you can see what's happening. [https://youtu.be/CgYmMHwpXaA](https://youtu.be/CgYmMHwpXaA)\n\nAny help is deeply appreciated as I am honestly out of ideas now. Initially I thought its either a temperature issue or a PSU issue but even during stress tests where the load is much more than games nothing really happens and the pc runs smoothly.",
            "Hey there. Wanting to change my 1050 ti OC for a rx 7600 (NO XT just simple) (i was thinking to buy 6650 xt first but the price of the 6650 xt and 7600 are the same here on my country) but i have 2 alternatives, xfx qick 3 fans vs sapphire pulse 2 fans.\n\nWhat should i buy? i heard that sapphire pulse are very good but the xfx have 3 fans and that is better cooling. I'm from Mexico and sometimes is very hot here\n\nif something helps i want something in long term, i like to capture videos and edit videos.",
            "Does anybody know why Adrenaline and Ryzen Master shows my CPU like this? Look at the temperature and clockspeed\n\nhttps://i.redd.it/8wue6x6l4qwc1.gif",
            "Hi all,\n\nCan somebody please help me to understand this undervolte guide for my 7800x3d.\n\n [My Experience/Guide to Undervolting the 7800X3D - Benchmarks, Temperatures, Stress Tests, and Common Questions/Concerns : r/Amd (reddit.com)](https://www.reddit.com/r/Amd/comments/16s1e7h/my_experienceguide_to_undervolting_the_7800x3d/) \n\nIn the initial steps, @ [Safe-Economics-3224](https://www.reddit.com/user/Safe-Economics-3224/) talks about using CoreCycler-v0.9.4.2 to do baseline testing. \n\nHe provides a config file for these tests. This config file uses Ycruncher, mode =  22-ZN4 \\~ Kizuna and includes tests BKT, BBP, SFT, FFT, N32, N64, HNT, VST, C17.\n\n&#x200B;\n\n* Repeat this process until you are able to **pass CoreCycler overnight (i assume that is with the abovementioned config?\\_**\n* Lastly, run **y-cruncher overnight** with all tests enabled???\n\nI can't find anywhere where I could enable all tests. It appears to me that the original config file IS all tests? (BKT, BBP, SFT, FFT, N32, N64, HNT, VST, C17.)\n\nLooking at this image in his post [https://preview.redd.it/my-experience-guide-to-undervolting-the-7800x3d-benchmarks-v0-k6rqp5gq8gqb1.png?width=905&format=png&auto=webp&s=95d13d2bef2b56a029efa7118b95f040f8d23345](https://preview.redd.it/my-experience-guide-to-undervolting-the-7800x3d-benchmarks-v0-k6rqp5gq8gqb1.png?width=905&format=png&auto=webp&s=95d13d2bef2b56a029efa7118b95f040f8d23345)\n\nIt shows \"8hr Corecycler HyperThread\", then lasty \"ycruncher all\".\n\nWhat have I missed here? As I understand, Corecycler is just the script that runs through each core individually? What is a Corecycler Hyperthread Test?",
            "I've been having good ole 35 C delta problem with my 7900xt lately and decided to finally pull the trigger and repaste it with with the ptm7950 pad. I understand the whole process, but I have one question:\n\nHow much attention should I pay to the vram dice and that blue putty that is placed over them? Is just scooping it up with a tool towards the middle so it can reattach itself after putting the GPU back together enough? Or should I get some new pads for that? If so then what would you suggest?",
            "Hi! I just recently purchased a brand-new 7900x3d for far under the price of even a 7800x3d. With all the resources regarding core-parking and optimization being a year old, I wonder if there is any other longer-term users of AMD's double CCD x3d + frequency core combos and what configurations they are running. I do equal amounts of gaming and productivity so having a headache-less configuration would help greatly. I look forward to some guidance and thanks in advance!",
            "New AMD 6650xt video card. I re applied thermal paste (I am experienced with the job on CPU's). When removing the heatsink of the card one thermal pad got half stuck in the memory module (all the rest of them came out intact). I didn't put a new one, just stuck the heatsink back and I am having very good temp readings. Including the memory junction temp is alright. Should I still bother buying a new thermal pad or leave it ? is that particular memory module gonna overheat without showing much on the readings ? any future possible problems ?",
            "# Is it normal to have 5600x with AIO at 55-60 degrees on IDLE?\n\nI have NZXT Kraken 120 for some time. It always been that way. I never put much attention to it. But one friend told me that's not normal. I've seen post where setups had air cooling with \\~60 degrees in game not in idle.\n\nShould I replace my AIO or it's just water cooling thing?",
            "Zen 2 and Zen 3 support for B450 boards  \n  \nHi all, I am facing an issue with my Asus Strix X470I with my 5600x. Without going into too much details, I believe something is wrong with the motherboard which prevents me from booting. I want to test this with my friend's MSI B450 Tomahawk Max, but he is currently using a 3600 and would need to update bios to support the 5000 series. I checked on the bios page and it doesn't say anything about losing support for older Ryzen models, but I do vaguely recall that some older models may lose support when updating to the latest bios to support the 5000 series.\n\nWould the latest update (7C02v3I) support both Zen 2 and Zen 3, or do I have to flash an older bios to get back Zen 2 support?",
            "Problem with AGESA 1.2.0.B on ryzen 3 3200g and dedicated videocard.\n\nI recently updated to the newest BIOS F66 on gigabyte b450m s2h mobo with AGESA 1.2.0.B and ran into a problem. After the update, my GTX 1060 began to work on PCIe 3.0 x1 lane. I tried different ways to solve this problem, but only rolling back to AGESA 1.2.0.8 helps. For me this is not a problem, because... I have a Ryzen 3 3200g, for which the latest BIOS versions are not particularly important, but keep in mind that the problem exists and it is worth checking through gpu-z how many lanes your video card is running on.",
            "I just bought the Rx 6600 For around 155 USD to replace my Gtx 1060 3gb, And my cpu is i5-4690K, i know it's a Intel cpu but whatever right? (I also have 16Gb DDR3 Ram) (i'm fine with overclocking it when needed), And i'm aiming for 1080P 50-75fps as my Monitor is 1080p 75 Hertz, I wanna play a wide Variety of Games, like the Vram Hungry The last of Remake, and some Minecraft, i know it's not an ideal pairing but does it bottleneck Badly?",
            "I have a ryzen 3 2200G paired with a rx6600 I get sudden fps drops in Fortnite please help",
            "I keep getting an intermittent gpu driver crash when my pc sleeps.  When waking my monitor won't respond for a while and when it does the pc is lagging a ton until I restart.  Occasionally I've had to reinstall windows it crashes so hard.  Anyone else?",
            "I have a B450, not a great one (MSI B450M PRO-VDH PLUS) with a Ryzen 5 3600 and a 3060ti that does the job \"good enough\". 16 GB Ram and a 550 PSU (CX550, almost 5 years old).\n\nThe idea is to build a new PC in a couple years, I don't do super CPU-intensive things (also, I'm gaming at 60fps, mostly ARPGs)\n\nI do need more RAM (studying some graphic applications, opera GX open, Notion open...), but I could also afford a Ryzen 7 5700...\n\nShould I slap a Ryzen 7 5700 on that board to extent the life of the PC for a couple years or is that pointless (compared to saving up and waiting for AI/DDR5 to establish)? Or should I go for a Ryzen 5 5600?\n\nHow close would I be to starting a house fire?\n\nI don't know if I should mess with this PC and get \"max potential\" or just wait up and build a new \"DDR5\" build...\n\nTl,dr: Is \"maxing AM4\" still a thing or should I build something new altogether? (I need to know if it will hold together, but opinions/discussions are welcome)\n\nEdit: building a new PC would involve slapping a RX570 on this PC to keep if functional/sell it and build a mobo + processor + PSU + 32GB of RAM and extent the 3060ti until it doesn't run RPGs anymore. I won't overclock/undervolt things to keep maximum stability, since I work with this rig.",
            "There's no display (gpu fans are spinning and everything) when I put PCIE power cable to my rx 6700 xt but no led lights on usb devices, windows wont power on as well., but if i remove the pcie power cables from the gpu, windows powers on (i can hear from headset) also all led lights on usb devices work well. This happened all of a sudden, since yesterday it was working just fine. So wondering what should I do to find out what's the issue\nAny help is appreciated, \nThank you",
            "is there a board like this with 6 5.0 pci-e slots that isn't so old? \n\n[M12SWA-TF](https://www.supermicro.com/en/products/motherboard/m12swa-tf)",
            "6950xt for 370$ ? Hey everyone, im traveling back to my home country from canada and i have the chance to buy a brand new 6950XT reference model for 370$ American all in. Issue is that im gonna use it for 4k and i mostly play dota 2 and single player games with all the eye canady possible.\n\n I know that its a good card for raster performance but its horrible for ray tracing and it doesn't have dlss and i use SVP project for motion interpolation so i can get 60 fps playback on my video content. Its has a new RIFE AI interpolation  model thats optimized for nvidia tensor RT. It still works with other gpu's but not as fast as with nvidia cards.\n\nSo i need peoples help who have this card and use it for 4k and maybe also svp what are ur impressions ? I can also buy a used 3080 TI for arroud the same price but that one has 12 gb of ram thats a bit iffy for 4k gaming plus its used. I dont really wanna spend more than 400$ do u think i should go for it ?  I could save up for a 4070 super but that over my budget especially with taxes and everything and i dont think its that good of a card. \n\nSo should i just suck it up cuz im too cheap and cant afford a 4090 like the peasant that i am or is there something else that u would recommend for that price point ? Honestly i think i just need people to sell me the card so i buy it without remorse but not having the nvidia features really sucks and i cant make myself buy it. should i just go for the used 3080 ti ?",
            "Hi, i got a rx6750xt about a year ago or something like that and iv'e started playing a lot of VR lately wireless via Virtual Desktop. Teh VD Dev recommends Radeon driver version 22.11.2 to work the best and that version infact is the most stable. Now my question is, how can GPU encoding be so much more consistent in an about 1,5 year old driver than the latest ones? Sorry if that is a dumb question, but im not to experienced with how drivers work.",
            "Hello guys, anyone had experience applying their 7950X3D with liquid metal thermal paste? I have always used the traditional type and I am stunned by the performance of the liquid metal. Thinking about switching to it, however I heard that if the metal touches the chipset it might short-circuit some stuff. 7950X3D has the metal cap opened and I am not sure how easy it is to apply the liquid metal without messing up anything? Thank you",
            "Hey guys, I have a gigabyte B550 UD AC, 32 GB of DDR4 RAM, an RTX 3070 TI and an AMD Ryzen 5 5600X CPu and I'm looking to get a new CPU, specifically the AMD Ryzen 7 7800X3D, would that be compatible with my current config or would I need to upgrade some stuff as well? If I would, what AMD CPU's would be good with my current layout?",
            "How do i get a resolution that is higher than my monitor's resolution on 7800XT? Adrenalin says \"Resolution not supported\"\n\nI want to play CS2 in stretched but can't stand the blurryness of 4:3 even in 1920x1440\n\nedit: on a 1440p monitor",
            "Question about upgrading processor.\n\nI know some stuff but not too much about computer things. I just play games and am getting in to blender. My current processor is: AMD Ryzen 7 2700 Eight-Core Processor 3.20 GHz, 16GB RAM. Everything is fine, I can run two World of Warcraft windows while listening to YouTube in the background without lag. Had this PC since 2018 and it still runs smoothly. \n\nI have the opportunity to obtain a AMD Ryzen 9 7900 3D. Would this make rendering on blender faster? I do have a game or two that I have to play on low FPS and low graphic settings just so it does not lock up my PC as soon as I open it (some dinosaur zoo game I forget the name of, for example). All I know is typically bigger numbers is better. Thank you for your responses and have a great day.",
            "I am planning to upgrade from Ryzen 3900X to 5950X. Both CPUs have the same TDP of 105W. Does it mean they will have the same thermal performance?",
            "two questions regarding memory supported speeds on the 7800x3d. The max memory speeds listed by amd are:\n\n- 2x1R DDR5-5200\n- 2x2R DDR5-5200\n- 4x1R DDR5-3600\n- 4x2R DDR5-3600 \n\n1. I know what DDR5 is, and the last number is MT/s, but what are the first numbers, e.g. 4x2R?\n\n1. The CPU can go beyond the above numbers. The expo timings that my ram has are for 6000 MT/s. What's the deal here? Is the actual max up to the silicon lottery? If so, how conservative are the specs by amd if ram is shipping with expo timings that go 15% beyond spec?\n\nThank you",
            "New PC tips for late 2024\n\nHey guys! \n\nQuick question here, i am planning to upgrade  this year to state of the art stuff (been saving a while) so money aint a issue \n\nBeen following development for a while on GPUs and CPUs but i aint the best so i could use help.\n\nLooking for AMDs upcoming X3D but no idea when its rumored to release. \n\nAs for GPUs i would be loved to get the 9950xtx but i dont think its going to be released this year but i could be wrong. Will go 5090 otherwise.\n\nAs for the MOBO i dont know which to get so it works with both iterations.\n\nThanks guys!",
            "Hi! I am considering 7700x. I have always been an Intel user. As I am researching, I learned that AM5 motherboards with DDR5 RAM boot very slowly. But those posts also seem to be from about a year ago. Is the problem fixed now? Or is there a brand or type of motherboard that has fast boot times with AMD?",
            "I built a new system today with X670e motherboard, 7800X3D cpu. Noticing post times are quite like, about 30 seconds and reading in other thread this is apparently an issue with the Am5 platform. Hasd this been resolved before/should I be looking for something to fix, or is it just an issue with the platform?",
            "Upgrading to 7900xtx\n\nCurrently have the following…\n3070ti\nRyzen 7 7800x3d\nGigabyte B650 gaming x ax\n32gb Corsair vengeance 6000 ddr5 ram\nNzxt kraken 240 for cpu\n3 1tb ssds \n1 2tb hdd\n1 500gb nvme\nCorsair 850 gold psu\n\nMy question is do I need to upgrade to a 1000w psu? I have looked online and many say that 750 is recommended but 850 is fine while others say 1000 is needed.",
            "I'm about to switch from Intel (i7-6700) to AMD (R7 7800X3D)   \n  \nI've been dreading the swap to not make any mistake and my final parts come in this Tonight but i don't have any spare storage to back up my files since it's too much for my second drive to move everything i need there and fresh install after formatting the main drive is it perfectly fine to let sysprep handle everything and go from there? or should i just do a full wipe anyways and back up what i can?  \n  \nAnd if anyone can reccomend anything that would be super helpful its my first time building a pc.",
            "(FIXED)  \nThis was either an issue with undervolting to far or Asus Multicore Enhancement, not sure which one as I changed both at the same time.  \n  \nCurrently running a 5700x3d paired with a 6800xt, with the latest bios and drivers available to my motherboard  \n(ROG STRIX B550-A GAMING)\n\nI'm having this weird issue where core 0 will not really do anything in games and CPU related benchmarks  \nThe attached screenshot link is BF2042, however this is not the only game it does it in, other games that this occurs is ARK Survival Ascended, SCUM, Cyberpunk, Forza Horizon 5, Warframe, Diablo 4.\n\nWindows 11 install is fresh (as of 4 days ago) and up to date.\n\nHas any else noticed this? or did I get a defective CPU?\n\n[https://www.imgbly.com/ib/gngqKzq58n](https://www.imgbly.com/ib/gngqKzq58n)\n\n(FIXED)  \nThis was either an issue with undervolting to far or Asus Multicore Enhancement, not sure which one as I changed both at the same time.",
            "# Is 600 watt enough for Rx 6750 xt?\n\nI have a Sharkoon SHP-BRONZE-600W 80+ Power Supply. I'm getting a Xfx Rx 6750xt. I thought it would be okay but on Amd's site it says minimum of 650w is required. Should I buy a new PSU? My components are:\n\n* Msi a520 motherboard\n* Ryzen 5 5600 CPU\n* 32 Gb ddr4 Ram (2x16)\n* 500 Gb Nvme ssd\n* 2 Hdd (7200 Rpm)\n* 2 Monitors\n* Mackie Cr3 50w Speakers\n* Focusrite Scarlet Solo Sound Card",
            "So l currently own a ryzen 9 7950x processor and x670E plus motherboard. I'm looking to undervolt this cpu to keep my cpu cool and my performance enhanced. Any advice on how to do this would be appreciated! I've saw tutorials online but never any that uses my motherboard type",
            "I'm getting a 5950X for my X370 C6H. I'm currently running 3600 CL16 16GB x2. \n\nIs there any point in getting 4000 16GB x2 CL18? and is an X370 board going to run 4000?",
            "quick question i have a 7800x 3d, i have heard i need to have game bar enabled for it? also balanced power mode and not high performace? anyone know if these are true or what they do if they are true?",
            "\nIm considering buying an samsung odyssey g8 oled, but im afraid my setup is underpowered for QHD gaming, any cultured opinions?\nI want to change my monitor because i own a 29 inch uw full hd 75hz monitor, which is not that great.\nMy rig:\nGPU:RX 6600 XT\nCPU: Ryzen 7 5700g\nRAM:32gb ddr4 3200mhz",
            "Is 24.4.1 stable on 6700 XT (Sapphire Nitro+ if it matters) on Windows 10? If it matters the rest of my build is a Ryzen 5 3600, 32GB DDR4-3200, on a 650w 80+ Gold PSU (SeaSonic Focus). \n\nCurrently running 23.12.1, which have been stable but I've been having some artifacting in game (mild, and also was not happening prior to those drivers).",
            "Looking for a MB that supports 2200g & 5700X3D\n\nSo I have inherited some hardware and I am looking to get it up and running now with a \n\nRyzen 2200g for cpu & graphics and a M.2 drive\n\nWith a view to upgrading to a 5700X3D and a 4070 super in a few months\n\nIs there a board that will work with everything?",
            "criminal filth. how the fuck is my old rx480 10 times more stable than a 5700xt. absolute dogshit.",
            "I have determined that an ASROCK B650M Pro RS with Wifi motherboard will meet my needs for a new build at $155 (but out of stock on newgg). The ASRock B650 LiveMixer is on sale for $150 but I have to add wifi for $30. Or the ASRock B650E PG Riptide with wifi for $180.  I do not need all the connections, ports, or peripheral support with the bigger boards. Any drawbacks/pluses to buying the bigger boards such as startup times, bloatware needed in windows, slow drivers for stuff I do not need, etc. ?  Any thoughts on choosing between the boards?",
            "Was wondering if anyone is having issue playing WoW Cataclysm with the latest Adrenalin Driver (24.4.1).\n\nI was able to play until this morning, I was having driver timeout issues since launch but since this morning it has been pretty much unplayable. The drivers crash every 5-10 minutes where my screen goes black then flickers for a while then it comeback to WoW.\n\nI have been playing many games including WoW SoD without any issues...so far I tried to change some graphic settings in Cataclysm as well as using the chill option to limit my frames at 144.\n\nI have a AMD Ryzen 5 7600x and a 7900xt",
            "what cpu should i get?\n\ni'm pretty much done with my pc part list, but i'm still a bit on the edge on my processor. because the only game i play is minecraft, and because it's so unoptimized and old, i'm not sure which processor is best.\n\nthe obvious choice here would be the 7800x3d, with 8 cores that can utilize the x3d cache, but i realized: i don't actually know if x3d matters for minecraft\n\nso my question is: does x3d even matter for minecraft, and if it does, which cpu is best?\n\n*ps: minecraft fabric w/ sodium*",
            "My rx 6800 keeps stuttering and freezing on occasions when playing apex. I have the AMD pro software installed, I tried adrenalin, but it performed worse. I am using a rm850x power supply with individual power cables going into the gpu. I also tried updating my bios, I have a aorous gigabyte b650 elite ax mobo paired with a ryzen 7600x cpu.  I still have a return window, if I can't get it to work, I will change it out for something else.",
            "Been planning to build myself a new PC on the AM5 platform (& rtx 40 series), however this time I'm planning to do it on a 2 RAM slot motherboard instead of 4 slots. Reason - never got to use the 4 slots and I don't think I ever will and so I will save some money for other stuff on the build.\n\nQuestions are:\n\n1. Are there any good 2 RAM slot motherboards for the AM5 socket?\n2. Are there serious differences between 2 and 4 RAM slots motherboards besides the obvious one that I get less slots?\n\nThe only option I've come around is the ASUS PRIME B650M-K, would you have any other suggestions at that pricepoint?",
            "I own a asus tuf a16 with a 7845HX, I tried many method to undervolt without succes. My last resort is to manually lower the curve optimizer in PBO settings in BIOS.\n\nQuestion : How can I do that safely ? I fear that if I lower by the curve by just -5 my laptop crashes and does not boot",
            "I have a ryzen 7 5700g and a rx 6600 xt and i was thinking about upgrading the gpu, if i get something like a rx 7900 xtx, but im afraid there will be a bottleneck. Any opinions, or what would be the best gpu i can get without bottleneck risk?",
            "Is it possible to save my Adrenaline settings so that if I have a power failure they persist, or can be easily loaded? I have several games that I have custom settings for, and every time I have a power outage I have to redo all the settings. I understand the reason that AMD defaults to resetting everything to default when there is a perceived stability issue, but in my case it is not my settings that are causing the occasional unexpected shutdown. \n\nIs there an option I missed somewhere to set it to not automatically reset all settings, or at least to save my settings so I can load them later?",
            "I'm upgrading my laptop after many years and looking at the [Legion Slim 5 Gen 8 AMD](https://www.lenovo.com/ca/en/p/laptops/legion-laptops/legion-5-series/legion-slim-5-gen-8-(14-inch-amd)/82y5000bus). On paper it looks solid and has a Ryzen 9 7940HS with an RTX 4060 and an OLED screen. I'm concerned about the look and feed of the device so I'm wondering if anyone has any experience/advice? I'm also not sure if I should be going with the newer Intel Ultra 7 over the AMD?  \nIt'll just be a daily driver and mostly used for browsing, videos and office tasks. I'll be using my PS for gaming but might start using the PC too if it's capable.  \nAppreciate the guidance!",
            "I currently have a 5900X with 64GB of RAM and an AMD Vega Frontier Edition GPU w/16GB of VRAM. I do plenty of Adobe Premiere Pro and After Effects work, and a little gaming.  I bought the Frontier Edition when it was brand new, 3 months after release, so I like to buy way more GPU than I need so it can handle anything I throw at it. \n\nShould I grab a 7900xtx or wait until the first RDNA4 parts drop?",
            "Currently have a 1700X and a RX580 8GB and looking to make some budget upgrades.  Looks like my mobo has some power restrictions with what CPUs it can handle.  I'm hoping not to have to replace the mobo right now, making the process easier without taking everything apart, needing to activate Windows again, etc.\n\nI am usually OK turning settings down on games to get them to run.  I play single player offline games, usually a year or two behind as I'm cheap.\n\nFor CPU: I was looking at the 5 5600X ($120 on Amazon) and the 7 5700X ($175).  Will they both give me a pretty good improvement over the 1700X?  I'll also get new RAM.  Any reason to spend the extra on the 5700X?\n\nFor GPU: I was hoping to find a used 6600XT, but they are almost as much as getting a new 6650XT ($220).  Should I be looking at cheaper options like a 6600/5700/5600XT?  (or any from a rival company...).  Will the CPU be limiting for the GPU, and is there a point where a better GPU is a waste?\n\nThanks!",
            "RAM is my blind-spot. In a Microcenter bundle, I picked up a 7800X3D with \"Flare X5 Series 32GB (2 x 16GB) DDR5-6000 PC5-48000 CL32 Dual Channel Desktop Memory Kit\". I have no clue if that's a good pairing with this processor.\n\nI'm sure there's some ideal RAM that's 5% better than what I got, but will I even notice a difference with what I'm using?",
            "Best possible Omen Gaming Hub and AMD Adrenaline Settings for a HP Victus Gaming 15 Laptop?\n\nIt has a Ryzen 5 5600H processor and a Radeon RX 6500M GPU with 4gigs of vram\n\nI currently have 8gigs of ram but will upgrade to 16gigs in the near future",
            "Hope this helps anyone with random reboots and crashes.\n\n7950x3D / ROG STRIX X670E-E GAMING WIFI build here.\n\nOriginally built my system in Spring of 2023. Everything seemed fine until late last year (fall of 2023), I started having random lockups/crashes causing reboots. It never happens while playing games, usually while watching movies and things like that. I reloaded Windows from scratch in late February 2024. Things were looking hopeful but the problem began happening again shortly after.\n\nI recently installed God of War and after several hours of game play, the game crashed stating \"out of memory\". That is what lead me down this rabbit hole and where I found a thread on Armoury Crate and memory leak. I began monitoring task manager and for sure, my page file was being eaten up and filling up the the max (106GB).\n\nFinding that thread, I went ahead and uninstalled Armoury Crate...when the unistaller was finished, the committed memory dropped in half. Good signs. After a couple reboots to get back to the BIOS and turn off the prompt to install Armoury Crate and turn off Aura, things have been running well...at least for the committed memory part. After a couple days of running, the PC is only using around 15GB of paged/committed memory. The PC has not ran long enough yet to see if that was the cause of my random crashes but I sure hope so. I need this PC stable!\n\nSo I have a question. I downloaded the old version of just Aura Sync. The only thing I was using Armoury Crate for was to allow iCue to control the motherboard RGB. Has anyone installed just Aura Sync on the ROG STRIX X670E-E GAMING WIFI and did it work? Could you control it with iCue?\n\nI see both ASUS and AMD have released new chipset drivers. I am currently using the previous AMD one (an attempt to solve my crashing issues. With this Armoury Crate ordeal, I am skeptical of ASUS drivers now. Is there anything important in the ASUS chipset driver that I should use it over the AMD one?\n\n  \n\\*update\\*  The PC has been rock solid stable for 1 month now and still only using around 15GB of page file.  I have paused Windows Updates to give the PC enough time to run uninterrupted without rebooting.  In late May, I will try installing Aura Sync and see if that allows me to use the MB RGB again without the bloat of Armoury Crate.  (AC is almost 3GB......almost as big as Windows...lol.  What a joke)\n\nThanks!",
            "5600x  \n3060  \nb550 gaming gen 3 motherboard  \n32gb ddr4 3600mhz  \n2560x1440 144hz qhd monitor(my first time experiencing something other than 1080 60hz wow..)\n\nSo my question to you amd friends, I want to get a 7900 gre since that card honestly seems like a dream come true, the value for that card alone minus if you get a good OC card just seems great.\n\nShould I get the gre and if so do I \"need\" to upgrade to a 5700x3d or 5800x3d because while I can that is a decent chunk of change I could be putting towards something else. I am going the gre btw to future proof a bit(I know cpu will have to be upgraded eventually anyway)\n\nI do play competitive games and story games but I don't mind capping my comp games at all.  \nI just recently built this pc and is my first I should have got the parts I'm listing but I was too scared..... didn't do enough research and generally just made a big mistake. So now I ask for your advice :)",
            "[deleted]",
            "I have a AMD Radeon RX 6600, AMD Ryzen 75700x 8-core and 16 GB ram 3200 MHz.\n\nFor some reason since the may 3. update in fortnite, I have been experiencing FPS drops and in general less \"smoothness\" when playing the game. I used to run 165 fps very stable with low settings on DRX 12.\n\nWhen I play the game and start having \"fps drops\", i look at the fps counter and it shows no fps drops (if that makes sence?). The weired things is that I can feel and see the game losing frames, but the fps counter dont seem to register it.\n\nI have tried reinstaling the game and and other stuff.\n\nIDK what to do!!",
            "# Is ryzen 5 1600 AF cooler compatible with ryzen 5 7500F?\n\nThere is a difference in the sockets (AM4 vs AM5) and I am wondering if they will be compatible or if I should buy a new cooler.",
            "so I've had my pc for about a year now it has a Radeon RX 6600 gpu and a Ryzen 3600 6 core processor and I've been experiencing some terrible stuttering recently I used to be able to play games such as Minecraft with bsl shaders max with 80 fps no stutters but now I cant even handle normal Minecraft and its done this to most other games even small games such as banana shooter I don't know what to do I've looked at tuning my software and making sure I'm updated on bios and drivers please help.",
            "Alright, well....\n\nSo I have been rocking my R9 390 8 GB for 8 years, and finally a couple days ago I finally have to do something to repair it (new thermal paste). I am pretty sure it will still work and I intend to keep it as a backup, but it's been 8 years, so I think I can treat myself to a new GPU.\n\nFor reference my build is:\n\nASUS-ROG Strix Z490A-Gaming MOBO\n\nIntel i7-10700K w/ AIO cooling\n\n64 GB RAM @ 3200 Mhz (G. Skill Trident)\n\n2 Samsung Evo SSDs\n\nI honestly have nothing to compare what I want because my 390 was still solidly rocking any game I threw at it, I suppose the game it made the most noise on would be very juiced Path of Exile maps, Sea of Thieves, Subnautica, and Minecraft w/ Shaders I guess to. I don't really care for ray tracing, or anything more than 1080p gaming (I have 120 Hz on my monitor). So I am looking for budget cards if possible.\n\nI don't know how the GPU landscape is now, but I am looking for a high value card that I can just keep running until the thermal paste just disintegrates off of it like my 390. I don't plan on upgrading to 4k gaming at all, so that will not be an issue.",
            "Will an upgrade from my RX 570 help ?\n\nGood Day\n\nRX 570 Ques\n\nI have an OLD computer setup. Its a Intel Core i7 CPU  975  @ 3.33GHz on an Asus p6t motherboard running Windows 10 pro with an 8gb AMD RX570. I have 24 mb of ram and 800W 80+ gold power supply .\n\nI am able to play most of the older games at about 50ish FPS. I have been on an assassins creed binge and am up to Syndicate.\n\nIn syndicate I am getting about 25 fps. Game plays fine but I ran the stats on overlay to see what was going on. I had assumed my CPU was the choke point.\n\nAccording to what I was seeing ... my CPU utilization wasn't even a full 1/3, my system memory utilization was even less that that but my RX 570 was 100% utilization. When I apply the built in overclock I get 27.8 FPS.\n\nI dont really know how to evaluate that information. Would an upgraded graphics card improve performance or is this computer just ready to retire completely. Really dont want to build up a new computer as money is always an issue but ??\n\nThank you in advance for any guidance!",
            "Recommended PCIe 4.0 riser cards?\n\nI have an AMD AM5 CPU (Ryzen 7700X) and an AMD GPU (Radeon RX 7600XT) which I hear causes problems when trying to use a PCIe 4.0 riser card. Am I stuck using PCIe 3.0 or are there available riser cards for this combo?",
            "Currently rocking a 6700XT with 7800X3D and was wondering if getting a 7900XT OC would be a nice jump in performance or if I should wait for next generation- I've read rumors that their intro cards will be cheaper while having same performance as current gen.",
            "Hi, \n\nI am contemplating whether I need a CPU upgrade from 5600 to something better for gaming at 1200p90hz (streaming to Steamdeck OLED at that res/fps). My GPU is 6800xt. Mobo ITX B550M. I do not want to change the mobo.\n\nI felt everything was fine until I started to play BG3 and Stray which both tend to stutter quite a bit in some places (act 3 of BG3). I hear more and more games become performance limited by CPUs (Dragon Dogma 2, etc). I understand this is more issue of the game implementation than the CPUs themselves.\n\nSo what I am wondering is: would CPU upgrade help me get more stable, less stuttery experience? In other words, is there a CPU I can plug into my B550M mobo and get a noticeably better experience?",
            "Fan curves for AMD Ryzen 9 3900XT?\n\nCPU core temp fluctuates between 35 degrees to 55 when browsing on Chrome with multiple tabs and windows open.\n\nWhat is a safe temp to keep my CPU running at? Are they meant to run this warm for general Desktop use(not gaming)?",
            "Is there a way to see VRAM usage breakdown ?  \nAS in what PID/APP/anything uses how much VRAM",
            "Hello everyone, I'm in a bit of a pickle... After updating my rx 7900xt drivers, I noticed a significant fps drop in all my games. Supermarket simulator I was getting 400+fps, and after the update, I was dropping to 30fps, and sometimes it'd go to 80~100fps. I did all the basic troubleshooting/diagnostics like installing older drivers, disabling cpu graphics, and reinstalling the adrenaline software. Nothing seemed to work. However, just recently, I disabled the cpu graphics and un-installed adrenaline software. After that, my screen started to flicker, then eventually ended up black with the flashing taskbar. I'm able to pull up tsk manager but trying to type anything is impossible since it keeps trying to load something. (Pin wheel by cursor)\nI've tried resetting the pc and reinstalling windows, but it always ends up failing during the process. Would anyone be able to help? Anything would be appreciated, thank you. I was able to reinstall the software, which took an unbelievably amount of time and effort, LOL. But nothing changed unfortunately.",
            "So I got my Rx 6600 yesterday ( with Ryzen 5 2400g , 16 gb 3000mhz, 620W psu, a 320m s2h and SSD) and I have huge problems. In game lobby's my frame time goes nuts and fps about 10, I can't even press things correctly. And in game CPU util over 90% and GPU about 50%. I tried reinstalling windows, drivers, update bios and nothing. When I close the app that's lagging a lot my CPU util goes over 100%. I really need help with this.",
            "Does anyone have advice on configuring the 5600g to 45w mode?\n\nCurrently running everything stock, semi passively cooling the 5600g and want to reduce power draw further. \n\nSpecs if relevant: 5600g, asus B550-f wifi2, 32gb RAM 3600.",
            "So waiting for my parts so I can build, I got a 7800x3d and ASRock 7900xtx phantom gaming OC. I've heard the 7900xtx runs hot and you can undervolt to lower the temps but also keep the same performance. Is this true? How much should I undervolt if so?",
            "Does anyone know where I can source an SP5 motherboard in the UK? I've been let down by a supplier and need to start a build. Everyone is giving me 7-20 days lead time! Thanks for any help.",
            "I have a Ryzen 5 2600 and I'm looking to either get a 6600 or something better. Should I just let go of the Ryzen 5 2600 and upgrade or is this still a good CPU in 2024 and if so, what would be a good card to pair with it?",
            "Hello!  \nI've had my build for 3 months - a 7950x3d and Gigabyte aorus 650 ax rev 1.2.  \nI've been running expo all this time, but about 2 months ago I've read that the x3d's used to blow up on non-updated bioses. I immediately updated it even though I had no issues, but I'm wondering, if i had damaged the CPU in the first month of use with expo and non updated bios, would I know it? Would there be signs? Ever since day 1 the CPU has been working essentially 24/7 and everything is fine. Thanks!",
            "7800x3d  \nMSI MORTAR b650m  \nddr5 6000-30-36-36-72\n\n i can't get this little beast to idle correctly.\n\ndoes anyone has any suggestions?\n\nit seems to be stable with c0 and 1.275v on soc.\n\nBut i gent' get it idle lower than 50-48° on windows even when running an aio triple fan 360mm because it's never properly idling.\n\nThis is a fresh windows install.\n\nOn linux, temps are about 30°-35° on idle.",
            "Upgraded a couple of weeks back to a 7800X3d on a Asus TUF X670E - Plus Wifi, and put in CORSAIR - VENGEANCE RGB 64GB (2x32GB) 6400MHz DDR5 C40 as my ram, didnt look into overclocking the ram to be the proper speed until today and after searching it looks like My ram was a bad choice. Do I sell the ram off and cut my losses with a proper kit, or would running this ram at unclocked speeds be fine for most games?",
            "How do I check if my laptop supports Freesync, Enhanced Sync, Vsync,  Optimus, etc?\n\nSorry, I'm new to this stuff, but I tried looking online for info but can't find anything. \n\nI have the HP Victus Gaming 15 laptop, that comes with the Radeon RX 6500M GPU (and the Ryzen 5 5600H CPU).\n\nI also tried asking HP support about it but they didn't know what any of this even meant.",
            "Hi\n\nGot helping a friend build his \"new\" system and after setting up everything i have problems with micro stutters in every single game i try,we cant find any solution to it\n\nGames run nice 100+fps and all of a sudden start stuttering for a couple sec,then back to 100+fps smooth ,etc\n\nSystem:\n\nryzen 5800x \n\nRx 7800xt \n\n32gb ram \n\nSsd 515(he will upgrade later on) \n\nMobo is Biostar B450MH with latest bios\n\n\nWhat we tried is disabling ftpm,undervolting,disabling rebaar, its a new windows install as well and still stutter in every game,anyone got any clue what might cause it?",
            "Anyone know if AMD plans on starting up the free game bundles with new cards again? They haven't had anything since Frontier of Pandora which was a few months ago.",
            "I am looking to build a PC that will allow me to play everything at minimum 1080p 90fps, I am between the following three options, which one do you think is the best?\n\nGIGABYTE Radeon RX 7800 XT GAMING OC 16G (3 fans)\n\nXFX SPEEDSTER MERC319 Radeon RX 7800 XT 16GB (3 fans)\n\nXFX SPEEDSTER QICK319 Radeon RX 7800 XT 16GB (3 fans)\n\nSAPPHIRE PULSE Radeon RX 7800 XT 16GB (2 fans)\n\nThanks for your answers!",
            "Hi\nIm having an issue with my r5 5600x,ive just got it today and put it in my pc and its hitting 85c,my cooler is a arctic e34 esports duo,i have remounted it 3 times,replaced thermal paste each time and given enough mounting pressure to almost round off the screws,this cooler performed amazing with my old r5 2600 oc to 4.15ghz and never went over 60c,i have no idea what the issue could be,any help?",
            "What's a good set voltage for Ryzen 7500F? for mobo coil whine fix",
            "Would I benefit from disabling in the bios  the IGPU from my Apu now that I have a dedicated graphics card?\n\nGot a R5 4600g for a year now and recently I've bought a RX590 the OG one not GME. And just wondering if this will make any difference in performance or not.",
            "Instant replay option is gone from my AMD software. It was working last week, and nothing has changed for me, so im not sure why it disappeared.\n\n[https://imgur.com/a/avoamPm](https://imgur.com/a/avoamPm)",
            "I have a 6700XT paired with a 5800X3D. The Sapphire Pulse edition 7800XT is currently £450 - is it a sufficient upgrade worth that price?",
            "Is buying 6800xt in 2024 worth it. In my country it cost 125 dollars less than 7800xt",
            "My amd gpu is staight up cooking as my drivers keep forgetting the fan curve every time my pc shuts down and the default is around 65 percent at 85 degrees anyone know how to set a permanent fan curve",
            "Is 7800XT (OC’d) good enough for 4k?\n\nHi all,\n\nI currently have a 4k monitor with 144hz refresh rate and making the move from Xbox to PC. I’m getting a good deal on a prebuilt PC, the GPU is a 7800XT sapphire nitro +, I’m wondering if I’ll need to improve on the graphics card?\n\nI’m ideally just looking for 60 fps + on any game, (rdr2/cyberpunk/elden ring are some games I want to try, take into consideration I can fiddle with the ingame settings)\n\nIf I’ve missed any info apologies, just ask in the comments and I’ll answer",
            "Hi everyone. I'm building my first PC and I want to it to be a white/white adjacent build. Right now I'm looking at the AMD Ryzen 5 3600 3.6 GHz 6-Core Processor and trying to decide on a motherboard. Any recs?  \n  \nPc Part Picker is recommending these based on compatibility:  \nMSI B450M MORTAR TITANIUM   \nMSI B350M MORTAR ARCTIC   \nMSI B350 TOMAHAWK ARCTIC   \nASRock B550M Pro RS   \nColorful CVN X570M GAMING FROZEN V14   \nColorful CVN B550M GAMING FROZEN V14",
            "Hi everyone .. does anyone own here Ryzen 9 7950X3D ??   \n  \nCan you please report your idle Power usage from HWinfo ?",
            "Hello, gamers. I have fairly old and somewhat underpowered CPU that i've bought as a temporary decision when GPUs were low an scarce - AMD Radeon 5 4650G. In modern games while my gpu (6600) is at 60% or less, this CPU is at 100%, and I am sure that it's bottlenecking. (It was observed in several games). All in all I am contemplaiting upgrade and my two candidates are: AMD Ryzen 7 5800X  or  Ryzen 9 5900X. As I not only game but also run science-related scripts that need a lot of CPU-heavy calculations I thought to go for 5900, but I am not sure If the difference is worth it, or it's better to go for 5800x and try to upgrade next year to AM5 CPU and motherboard?",
            "Will previous gen prices drop with the announcement of the 9000 series at computex? I need to upgrade my PC and my microcenter is doing a rlly nice bundle including a 7700x and Im wondering if the price for it will drop anytime after the 9000 series announcement.",
            "In general for amd am4 motherboards, can you upgrade and downgrade bios? For example say you had a new 5800x3d cpu with latest bios on the mobo, then sold it and got a old gen 1 ryzen cpu. Would you be able to downgrade the bios to accept the old cpu without harm?",
            "Is the Ryzen 5 3600 CPU compatible with Windows 11 with no mucking around?\n\nWant to upgrade from the R5 1600, but want to double check first. Will pair it with a ROG STRIX B350-F GAMING\n\nThanks",
            "Does AMD Ryzen 5 7600X needs to be undervolted to perform better? I read on web that it should be downvolted to have lower temps and overall better performance but not sure if that's true for?",
            "Hello,\n\nI would like to purchase a AMD GPU that according to this private seller is still new and never opened.\n\nIs there a way via a S/N or something to actually check the history of a gpu?\n\nThank you.",
            "If I run 2 sticks of 32GB DDR5 with my 7800X3D, should it show up as dual channel or quad channel in CPU-Z or HWINFO64?",
            "Hey everyone!\nI can’t decide whether to get the RX 7700 XT or RX 6800. There’s only a $20 difference so that’s irrelevant. I don’t think the small performance difference would be all that relevant for me, but what might be relevant is the extra 4GB VRAM on the 6800 and the AV1 encoding on the 7700 XT. I do gaming, video editing and plan on streaming to YouTube in the future and I’m not sure if AV1 is more important than the extra VRAM for my use case.\nAny help is much appreciated!",
            "# What is the case they keep showing in AMD Advantage promotion material?\n\nHello there. \n\n[https://www.amd.com/en/gaming/desktops/advantage-premium.html](https://www.amd.com/en/gaming/desktops/advantage-premium.html)\n\nI wanted to know if that fishtank case with AMD-branded Lian Li Uni-Fans and an AMD AIO is real or just CGI. I would 100% buy that case, it it were real, same with the AIO. If it is real, could someone tell me what it is called? I know this is dumb, but if there is a chance this is real, I would be elated. Looks beautiful.\n\nThanks!",
            "I'm thinking of buying a r5 7600. Is the stock cooler enough or do i need to upgrade it ? I live in a hot country and i'm planning to use PBO. Can the stock cooler handle that ?",
            "I'm thinking of buying a r5 7600. Is the stock cooler enough or do i need to upgrade it ? I live in a hot country and i'm planning to use PBO. Can the stock cooler handle that ?",
            "**Summary of the issue**: Extremely loud beeping as if CPU is overheating when gaming even when temps aren't close to their maximum.\n\n**What I have tried to resolve the issue**: GD everything. Started with troubleshooting the CPU, saw temps in the 70ish. Tried to find the temperature alerts in the BIOS, no dice and doesn't seem to exist. So ended up reseating the CPU, then applied the Honeywell paste then upgraded to the TR Peerless Assassin, then upgrading the fans to Noctuas, then a new case (the Lancool 216), then added multiple 140mm fans. Beeping continues throughout.\n\nWondered then if it was the GPU because the memory junction temperatures were above 90C. Repasted the GPU with Honeywell and the memory with U6Pro. Still... beeping.\n\nTried popping out the CMOS battery for five minutes at a time multiple times to no effect. Tried tuning the fans to be much more aggressive and loud for both the GPU and the CPU and no dice. Noticed that setting a super aggressive fan curve for the GPU seemed to 'delay' the beeping but even after the upgrade to a new case with two 200mm fans and five 140mm fans tuned aggressively it'll still beep even though the temps are all well within spec.\n\nOnly started recently after being able to regularly game on this build in a smaller crappier less heat-efficient case at 1200p playing Cyberpunk 2077 for hours on end with RT on.\n\n**System specifications:**\n\n* Operating System: Microsoft Windows 11 Pro Version10.0.22631 Build 22631\n* CPU: AMD 5800X3D cooled with the Peerless Assassin sporting two NF-A12x25 PWMs and PTM7950 paste.\n* GPU: Stock AMD 7900XT with fans tuned for high performance, repasted with PTM7950 for the chip and Upsiren U6Pro for the memory.\n* Motherboard: ASRock B550M Pro SE\n* RAM: G.Skill Trident Z F4-3600C16D-32GTZNC\n* Storage: Western Digital 1TB SN770 sporting a Thermalright M.2 Pro 2280 heatsink with stock pad.\n* PSU: Rosewill CAPSTONE-1000-M 1000W 80+ Gold\n* Display: Monoprice 27\" Dark Matter 1440p 144hz monitor via USB-C\n* Case: Lancool 216 with four additional be quiet! Pure Wings 2 140mms.\n\nTemps per HWInfo after running BGIII for a few minutes with incessant beeping occurring the entire time: [https://imgur.com/a/d5s2EKV](https://imgur.com/a/d5s2EKV)",
            "I just installed a R7 5800X3D and it is acting really strange. R23 score is 13150 which is like 20% lower than the average, my first few tests it would run at 75C under load but now its up to 90C under load with the same score. Did I get a dud? I've reset the CMOS battery, ensured XMP is enabled, un-installed and re-installed the chipset dricvers, and I am on the newest BIOS.",
            "Need advice on new motherboard.\n\nThis is my new chosen specs, (except the mobo)\n\n* **CPU:** 7800x3D\n* **GPU:** Sapphire Pulse RX 7900 GRE\n* **Cooler:** Deepcool AK620 Zero Dark\n* **PSU:** MSI MAG A750GL\n* **RAM:** 32GB (2\\*16) G.SKILL Flare X5 Series 30-38-38-96\n* **Cabinet:** Liancool 205m mesh black\n\nI am looking for a cheap mobo as I am already over budget. I also don't need to future proof it as I will be upgrading my CPU in 2027, not before, and by then its very likely that AM5 will be outdated.\n\n* Doesn't throttle the hardware performance\n* Has 2 NVME Slots (Gen4 will do, gen 5 is not needed)\n* Has Bios Flashback button\n* I don't need a wifi, also I don't plan to overclock the CPU.\n\nWhich one would you recommend? Please lists a few option as availability is an issue in my area.\n\nAlso, is overclocking GPU memory in a cheap motherboard safe?",
            "**re: Mini-ITX board with PCIe x16 slot with x4x4x4x4 bifurcation** **and** **support for ECC**    \n\n\nI've spent literal days attempting to find a mini-itx board that supports ECC, PCIe x16 with 4x4x4x4 bifurcation, and has decent LAN support (ie > 1GB).\n\nYes, I want to set up a weeny M.2 NVMe ZFS server on ESXi or Proxmox.\n\nThe most obvious candidate is the **SuperMicro X10SDV**\\-NC-XXXX series, but they're quite old now (PCIe 3.0) and cost a small fortune. Given that LGA 1200 and LGA 1700 don't support 4x4 bifurcation, it would seem AMD are the way to go.\n\nI was (initially) excited to see Asus' **ROG STRIX B650E-I Gaming WiFi** board appeared to support this... but delving into the manuals etc, it appears ECC and 4x4x4x4 bifurcation are dependent on the CPU, and as far as I can determine no CPU supports both at once on this board:\n\n[https://www.asus.com/support/faq/1037507/#list](https://www.asus.com/support/faq/1037507/#list)\n\nstates you need a 7000 series CPU to get 4x4x4x4, whereas\n\n[https://rog.asus.com/motherboards/rog-strix/rog-strix-b650e-i-gaming-wifi-model/helpdesk\\_qvl\\_cpu/](https://rog.asus.com/motherboards/rog-strix/rog-strix-b650e-i-gaming-wifi-model/helpdesk_qvl_cpu/)\n\nstates the 7000 series doesn't support ECC. Argh!\n\nSo I've delved into the manual/specs for the **X570SI AORUS PRO AX** and all they say is that ECC and PCI Bifurcation are dependent on CPU... but they don't say which ones.\n\nDoes anyone know where to find this info? Or has tried the board with ECC and 4x4x4x4 and got it working?\n\nIt seems utterly bizarre to me that no one other than SuperMicro has catered to this market... and even they haven't bothered since the X10 series.",
            "What is the best temperature for Ryzen 5 3600?\n\nI have read many posts and replies. I just want to know if there is an OFFICIAL or even proven recommended temperature for the CPU. I know the max is 95, and everyone says under that is safe. I also know many people say as low as possible. I've read 70-80 is best for the boost algorithm. I've contacted support directly. Nowhere can I find an official recommended temp for best performance under load. I understand cooler is better in general and below 95 is safe. But what is best for performance, officially if possible?",
            "Summary of the issue : Everytime I start a game, my PC reboots after a few seconds/minutes. Tried with multiple games, all the same results.  \nError code given : Échec de l’initialisation de l’inscription du certificat SCEP pour WORKGROUP\\\\IFSHES14IM14$ via [https://AMD-KeyId-52fb59e29aa83a962fb9eef0fe5b4811de6b751e.microsoftaik.azure.net/templates/Aik/scep](https://AMD-KeyId-52fb59e29aa83a962fb9eef0fe5b4811de6b751e.microsoftaik.azure.net/templates/Aik/scep) :  \nWhen the PC reboots, no bluescreen or anything, normal reboot.  \n\n\nWhat I tried :  \n- Disabling fTPM  \n- Disabling SafeBoot  \n- Checking if Drivers were up to date  \n- Reinstalling games  \n\n\nSETUP :   \nOS : Windows 11 ver 23H2 (build ver. 22631.3447)  \nGPU : NVidia RTX 3050 (No overclock)  \nGPU : AMD Ryzen 5 5600G 6 Cores, 12 Threads  4.69GHz speed (not overclocked)  \n32 GB RAM\n\nI bought this PC from a close friend that did not had that issue before (tried it before buying)",
            "Building a new PC soon could someone look it over and give me some points where I could save/improve? Reusing my current GPU and I'll rep that in a month or two and also reusing SDDs/PSU(Corsair 1000W)\n\n   \nCPU -  Ryzen 7 7800x3d 355 €  \nMotherboard -  MSI B650 Gaming plus wifi 169 €  \nRAM 64 GB DDR5 5600 kit(2 sticks 32 x2) 200 €  \nCase - NZXT H9 Flow 190 €\n\nTotal cost around 915 €\n\nNeed to buy a better cooler as well but that will be in a month or so. Stock should be fine realistically for the time being.\n\nSomeone suggested me the MSI MAG B650 TOMAHAWK awhile back. does anyone know if that is worth the additional 50 euro's?\n\nThanks so much for all the help you guys are offering in this thread, Life savers!",
            "I probably need to change mobo, and I could use an advice.\n\n  \nRecently bought [GIGABYTE B650M D3HP](https://www.amazon.co.uk/Gigabyte-B650M-D3HP/dp/B0CHM63K9W/ref=sr_1_1_mod_primary_new?crid=8PZ3IEKNAMUQ&dib=eyJ2IjoiMSJ9.qOEhDp-x0wQbuaxSD3_ML_r913Df4r8Yc9NcQP00G3Lc3lyQwTx889BVsAEVHD9qawv4lDYK_Wtdjd6czMy2loVI8mJFDlueoFDlDyh2Y8SZVMQASxeaakFWEQ5M-K5yOWBaVDllMfqacHXEci_RCeKRa-fKH446Jjw4kcTKP7pILJdvbvgtfsjndZx43kj5PTrDXhl0GPfPK9VuoLbiK20QE4MS2pjo_UHz7WntCJ0.MDNAWSfZNoclzaZLbnOYTfsfyPepzV8uPtrQMtlY0jU&dib_tag=se&keywords=GIGABYTE+B650M+D3HP&qid=1715731915&sbo=RZvfv%2F%2FHxDF%2BO5021pAnSA%3D%3D&sprefix=gigabyte+b650m+d3hp%2Caps%2C110&sr=8-1), Ryzen 9 7950x, Be quiet! DARK ROCK ELITE cooler and [CORSAIR VENGEANCE 192Gb of RAM](https://www.amazon.co.uk/Corsair-VENGEANCE-5200MHz-Compatible-Computer/dp/B0BY6ZF5KF/ref=sr_1_4_mod_primary_new?crid=MYSPPHZREZAZ&dib=eyJ2IjoiMSJ9.cqat-8UFIT0S2W7S8LRIpn_L1PvvuHNXWfs7sW_NZdYH-T0rAcfXKY_yo1rITLHstENnImeVeE8slxNMyB3q2ZLxUql4VmlQLGlH7q6vGCkrz6ZvPChtwlMTjxOmbjKEi04pjduCL8BCeSUY_c6L0D30A2_N-3eXlQdvWOgGQHkvOx2_i_hRu9KruWr_ClweDecXylJoOECV8fzCn0f1H9Zp99jvNue0FckorveyLuA.1hhCCjJSCMHIz-dmWqCoNCEhA6KL1Za_L_JJP-c_3XY&dib_tag=se&keywords=corsair+vengeance+ddr5+ram+192gb&qid=1715731990&sbo=RZvfv%2F%2FHxDF%2BO5021pAnSA%3D%3D&sprefix=CORSAIR+VENGEANCE+192GB%2Caps%2C98&sr=8-4). All inside Be quiet! SHADOW BASE 800 and with 7900 xtx. Everything's stable and while I didn't think at first I'll have the need to OC as I used to years ago, I recently changed my mind. I do a lot of procedural modeling in Blender and use all my HW for it. While the speed/results are impressive to me, especially considering my previous PC, I'd like to go further.\n\n  \nThe problem seems to be that this particular Gigabyte mobo doesn't support overclocking. Everytime I try to enable it, it reverts after saving. And I read somewhere that GB decided not long ago to restrict OC on their low end mobos. So I'm bit annoyed by this. My 7950x usually hovers around 4.8Ghz while under full load and around 95°C. I was considering to also temper with undervolting. But I'm fine with investing into water cooled solution as well.\n\n  \nI'd like to know what kind of mobo you'd recommend for OCing 7950x with these particular RAM kits. I don't need anything fancy, I want functional HW for OCing. So if I can avoid buying some overpriced, wifi including mobo with 5 GPU slots, I can live with that. \n\n  \nI hope I didn't forget anything. Thank you for reading and possible replies!",
            "# ASROCK B650M Riptide not picking up 5700xt and bluetooth.\n\nI updated my bios to 2.10 (latest non beta ver), cleared CMOS, updated all drivers.\n\nDid a brand new PC build but for some reason my 5700XT is not being picked up. The lights are on for my GPU so it's definitely connected. Currently just using the iGPU on my CPU. Also my bluetooth doesn't work either even though wifi works for me.",
            "Smart Access Memory Lags/Stutters Help\n\nSystem:\n\nRyzen 5800x3d, B550 gigabyte pro ac, RX6950xt\n\nIve found that Smart Access Memory causes stutters on my system, looking many threads, findings e.t.c with same systems / problems\n\nNothing really helps, bios updates, windows, disable hpet, mpo fixes, cache - nothing helps.\n\nBut what i found, is if im installing old drivers OR completely turn off SMA (in driver/bios dont matter) - all working exceptionally good.\n\nDrivers work - up to whql-amd-software-adrenalin-edition-23.2.2-win10-win11-feb22 or pro amd-software-pro-edition-23.q1.1-win10-win11-may2\n\nAny more recent drivers cause instantly seeing stutters in some places .Specially got some saves in games for testing purposes\n\nWhere can i post logs of my system or write directly to AMD, please help me \\^\\^",
            "Hey guys!  \nI have a question, before this 5800x3d i have an ryzen5 3600, its a good cpu for me im playin only with counter strike.\n\nBut today i want to upgrade my cpu to 5800x3d, installed it, but when im openin the bios its 50c°, when im opening any game or tryin to do something its 90-91 c° with Noctua NH-D14 And the cpu cooling fins don't even heat up, its normal or something is wrong with my cpu ?\n\nTe ryzen 5 3600 is working perfectly with my cooler  \nThanks for the answers!\n\n((( and sorry for my bad london )))) :)",
            "How do I set the refresh rate for specific games in Adrenalin?\n\nSome games (especially Bethesda games) don't like having a refresh rate that's set too high. I've been experiencing issues in both Fallout 4 and Skyrim for some time now, and by capping the refresh rate before playing, it generally fixes the issue. The problem is that it means I have to go digging before I play, then again after I play.\n\nIs there a way to cap the refresh in game X or Y, but leave it at the default windows setting for the rest of it?",
            "Ryzen 9 5900X on a Wraith Stealth and Gigabyte B450M\n\nSo I've got a hold of a Ryzen 9 5900X given to me by my uncle but can't get a hold of a new cooler until probably July, just wondering if a Wraith Stealth would be sufficient for the time being. \n\nAlso will my motherboard be fine or do I need a new one? I'm aware I'll have to update the BIOS to support the 5000 series but still not sure if it's fine. \n\n(If you're wondering, I can't get my uncle's old motherboard as it stopped working, he bought a new motherboard and a 7950X3D with it which is how I've ended up with the 5900X, he's kept the cooler he had for himself.)",
            "Hi, Just got Ryzen 7 7800x3d. Tried manual pbo settings:\n\nmax temp 85c\n\nmax watts 85w\n\n-30 undervoltage\n\nsoc voltage 1.2\n\nI have over 18k in Cinebench but my temps are still on 80-85C and 4.8ghz only. \n\nWhat to do to decrease temps to 70-75C?  should I turn off max temp and just use max watts? \n\nI have Arctic Freezer 3 360 AIO on top and 3x 120mm on front. \n\n  \nThanks",
            "hello!\n\n  \nthis is my first amd card after been with nvidia for my life, buut when playing PUBG it crashes quite often\n\ni have seen post about the fix being to undervolt, but i dont know what i should do?\n\nsomeone who has a surefire way to do that?\n\nand is expo and xmp the same? when i enable expo it uses so much longer time to reboot if booting at all.\n\nis it even a point to overclock this system?\n\nthis is my setup.\n\nusing latest adrenalin and gpu driver version \n\nhttps://i.redd.it/b31pv66yeu0d1.gif",
            "Hi!\n\n7800X3D randomly runs at 85c on startup!\n\nhttps://i.redd.it/dfgz0zimsu0d1.gif\n\nI built a new PC around 6 months ago. Randomly on startup, perhaps once a month, the fans will start going brrrrrrrr. Much loader then normal. I'll check the metrics and every time find the CPU to be running at around 85c. My solution thus far has been to restart the computer until it starts normally. It can take 2-3 restarts before it starts normally but has worked every time. \n\nMy question is has anyone experienced something similar and or know of a solution. Thank you!\n\nOne thing to add would be there is some dust build up but it's nothing I haven't seen before and this issue has been occurring since the beginning.",
            "Is there any video renderer that can take advantage of AMD NPU for video enhancement/upscaling?",
            "Hello everyone. Building a new pc. I can’t decide if I should get the 9 7950x or the 7800x3d.\nMain use gaming. FPS, racing. \nGpu 4090 \nThanks in advance. Happy gaming!",
            "I think I'm missing something with my PC settings.  I'm running an X570 Dark with an 5900x.  Just updated the BIOS but something that has always been an issue is that the CPU doesn't seem to boost right.  I restored to 'optimized defaults' last night, and it just tried to go flat out to 4.9Ghz which I most definitely do *not* want.  I ended up just setting a mild OC to 3.8Ghz.\n\n\nI want this PC to work like my old X470 Asrock Taichi board with a 2700x.  After locking in the memory timings, it worked without issue, boosted under load, and dropped speed and power without load.  It didn't ramp, it just worked.  This X570 board is lightspeed fast which is amazing but I can't seem to get it to work with the same easy reliability of my old X470.  I feel like I'm missing a setting somewhere that is the cause of the issue, I just don't know where.",
            "Display port/hdmi no longer works after AMD update.\n\nGood evening,\n\nSo I updated my AMD drivers (the one that says that your screen might flutter) and now my screen is black.\nEven spamming the Keys to get to the BIOS does not work.\nI used 3 different monitors from different companies. They all worked fine with my laptop. Everyone of them recognizes that they have been connected to something when plugging in into my main computer. However, all of them keep a black screen. This has lead me to believe that it is an AMD issue, as the monitor worked fine before doing the Adrenaline update.\n\nMy headphones work (I can hear the windows starting screen), so the pc seems to at least be working.\nMy LG screen (series number 302NTZN1Z517) fonctions (I can change the settings, the volume a.d it works with other computers...). It says that there's no signal while also recognizing that the DisplayPort is connected.\n\n\nSo the monitor screen recognizes that it's connected to the DisplayPort while also saying that there is \"no signal\" and that it will \"enter power saving mode shortly\". \n\n\nI tested with another monitor, who also ran into the same issue. So it seems like the driver update \"cut\" the link between my monitor and my pc.\n\n \n\nEverything worked perfectly fine before updating windows and then the AMD drivers.\n\nSo, does anyone know how I can fix this issue, knowing that I'm stuck with a black screen  (and thus cannot do anything about it) ?\nI've tried reaching the BIOS, but to no avail, the screen is still black.\n\nI honestly don't understand how I can solve this issue when no monitors (using hdmi or the DisplayPort) will work.\nWtf did the driver update do to my pc ??\n\n\nThank you for your help, it is driving me nuts !",
            "Heya, does the graphics card matter when it comes to making a podcast? The CPU would be Ryzen 7 7735HS and I can choose between Radeon RX 7600S 8GB or NVIDIA GeForce RTX 4060 8GB.\n\nIs the GPU important in audio recording?",
            "I'm choosing between the XFX RX 6600 and the powercolor fighter rx 6600. Both are same price on amazon. I'm leaning towards the XFX because it looks better to me imo. I just want to know, which of these 2 models is the quietest? Are the temps similar?",
            "Where i live r5800x costs 208$ and 5700x3d 258$, is it worth the difference?",
            "I undervolted my 6700 xt a bit and I am not sure what to do with the clock speed. I lowered it from min 500 - max 2500 to 500 - 2400.\n\nHowever, I've seen some youtubers who say max and min should be only about 100 apart, so 2300 to 2400 for example, while other youtubers have just left the min clock as is. I haven't noticed any lack of stability for me. \n\nWhat does the min clock do and how does it affect performance/power consumption/heat/noise?",
            "# Undervolting Rx 590 gme sapphire nitro +\n\nso this is my undervolting setting for my gpu , are they good ?\n\nand is setting power limit to 10% bad for the gpu?  \nhere is the settings : [https://imgur.com/a/Z6NvyBR](https://imgur.com/a/Z6NvyBR)",
            "I’m looking to swap from a intel cpu to the 7800x3d what all do I need to do/be careful of if I know I need a new am5 motherboard some ddr5 ram any advice would be appreciated. Been having crazy stability issues with my 13700k and am ready to make the switch",
            "I’m looking to make the switch from an intel cpu to the 7800x3d I’m having crazy stability issues with my 13700k. I’m just curious on what all I need to buy and do I know I’ll need a am5 motherboard ddr5 ram and the cpu itself. Any advice or things to look out for would be greatly appreciated",
            "Recently my pc powers completely off when I do a reset but not every time, the memory trains for 27 secs which I’m used to and then powers off before the CPU light comes on, it then turns back on straight away but hangs on the orange ram light until I manually turn it off.\n\nIt boots into safe mode after saying it’s because of either system stability or because I’ve manually turned it off.\n\nI’ve replaced the PSU and RAM for new. \nI’ve tested the memory with Memtest.\nBios is up to date.\nGaming is fine and system seems to run normal it’s just if I need to do an update that requires a restart it sometimes does this.\n\nI’m wondering if it’s something to do with the CPU? Memory module? \n\nIt’s only done this since I went away for 4 weeks and come back to loads of updates including ICUE and hardware update for RAM\n\n\n7800X3D \nASUS Tuf x670e\nDDR5 32gb Corsair vengeance 6000Mhz cl30\nASUS Tuf 4080 super\n1tb 990 pro\n1000w Rm100",
            "Question about heat sinks:\n\nRecently I purchased a build from CLX, however for the build there were only two options available for CPU heat sinks at the time: liquid cooling or stock fans. Liquid cooling was extra, I've never used that kind of cooling before, and was already pushing my budget, so I went with stock fans. \n\nGot it a bit later, runs like a dream compared to my older computer. However the AMD stock fan they gave me is running unusually loud, and noticed the CPU temp was ranging between 40-65 C, which I find to be normal. Until I actually turn on any game that requires my GPU, my CPU will ramp up its speed to a little over 2.7k RPM.\n\nI don't know if it's just the stock fan being a stock fan, or something else is going on with the heat sink itself. Should I look into getting a different heat sink? What kind/brand do y'all recommend should I get myself a new heat sink?\n\nThe tower currently has 3 fans for intake with a little less than 1 inch / 2 cm front gap, and 1 outtake fan in the rear.\n\nCurrently I have an AMD Ryzen 7 5700G, mobo is ASRock B550 Phantom Gaming 4/ac, and the tower in question is about 7 1/2 inches / 18 cm deep.",
            "#Which CPU with integrated graphics AND support ECC?\n\nEdit: sample mobo ASRock B550M PRO-4 mATX\n\n...\n\nI must use ECC for NAS ZFS functionality.\n\nI **really** want Mini-ATX /mATX size mobo, would prefer smaller but I want at least two x16 physical PCIe slots\n\nI need x4x4x4x4 bifurcation on x16 slots, x4x4 on x8 ones\n\nmore such slots would be better, even if all actually x8 lanes each - please reco mobos if you are aware\n\nOK now the main actual request - Which CPU/APU will work well in that mobo? (see above example)\n\nApparently Cezanne is OK, but Renoir or Picasso also? Must be a Pro version?\n\nI need integrated graphics, would like to have \"the best\" for low res gaming say 1080p\n\nhowever how much of a trade-off does that require when switching over to using say RTX 4060 level dGPU ? Likely as eGPU via OCulink x4 if that makes a difference, but one day maybe in the mobo PCIe slot if the NAS function moves to another host.\n\nIf the answer to that last is \"a lot\" then let's optimise for the dGPU scenario\n\nI still need the iGPU for when there is no dGPU present but I'll accept that gaming performance being pretty darn anemic.\n\nAll feedback welcome\n\nAnd damn AMD for making all this so complicated!",
            "Status: UNRESOLVED\n\nComputer Type: Desktop, custom built\n\nGPU: EVGA 3080 Ti FTW3, 12GB of VRAM, no overclock\n\nCPU: AMD Ryzen 9 7900X3D, PBO enabled\n\nMotherboard: Asus X670E Crosshair Extreme, latest BIOS (Version 2007)\n\nRAM: G.Skill 32GB (2x16) 7600MHz CAS36 Trident Z5, XMP enabled\n\nPSU: Corsair HX1500i, 1500W\n\nOperating System & Version: Windows 11 Home Version 23H2 22631.3593, clean install\n\nGPU Drivers: NVIDIA Game Ready Driver Version 552.44, clean install\n\nChipset Drivers: AMD Chipset Driver Version 6.02.07.2300, latest\n\nDescription of Problem:\nSince upgrading to the AM5 platform, my PC faces severe performance issues. Games like Valorant and Apex Legends experience FPS drops below 5 within 1-10 minutes of launching, and GPU utilization plummets to 1-5%. This issue doesn't occur in Forza Horizon 5 and Forza Motorsport 2023. LatencyMon reports high DPC latency, particularly with the NVIDIA driver (nvlddmkm.sys).\n\nTroubleshooting:\n\n1.\t⁠RMA'd the motherboard and CPU - Issue persists.\n2.\t⁠Swapped GPUs (tried with NVIDIA 4060) - Issue persists.\n3.\t⁠Ruled out thermal throttling - CPU stays below 75°C.\n4.\t⁠Disabled power management features - Issue persists.\n5.\t⁠Multiple clean installs of Windows 11 - Issue persists.\n6.\t⁠Updated all drivers and BIOS - Issue persists.\n7.\t⁠Contacted NVIDIA support multiple times - Unresponsive.",
            "Kind of odd, but if anyone could suggest me a replacement fan for MSI RX 480 (a single turbine/blower style fan), I'd be greatly appreciative.. On the couple specs page I looked at, the fan's specifics weren't mentioned (voltage or amps or whatever, millimeter size, etc.)..\n\nReally trying to avoid buying one that won't work properly (on a disabled/fixed income, and some of these shipping times are not swift..).\n\nAlso, will these cheaper/3rd party fans still respond to fan curve, or do they run at all times?\n\nAny help is appreciated!",
            "Adrenalin Edition Version 24.3.1\n\nTrying to view recordings through the app causes a blank popup to appear that tells me to access the Mircosoft Store. I have no idea what it actually wants me to download since all I see is the AMD Link app if I search \"AMD.\" https://imgur.com/a/J4HQb7g",
            "7530U for a student?   \n  \nHi! I'm an incoming CS student and have a pretty powerful pc at home so I was thinking if this CPU is enough to get me by \"on the go\" while I'm in class etc. My university also has a LOT of laboratories and servers (for free for students!) if I ever needed super heavy processing power.\n\nThe last time I got a laptop was waaaay back in 2015 and honestly speaking I have no idea how any of the current stuff compares to the desktop market so I was asking if this CPU is enough for my needs. Thank you so much!!",
            "Do we know if the next generation Ryzens will work on B650 motherboards?  Thinking about upgrading my rig with the coming generation of stuff. Would be nice on the wallet to buy things piece by piece instead of all at once but my searching skills are failing me.",
            "Is 40-60w idle (browsing + youtube etc not true idle) normal for 7900 GRE displaying UWQHD at 144hz?  \nIf not, any ways to drop this? It's actually been really efficient in gaming but the idle seems a bit high to me. Thanks",
            "I'm deciding to upgrade from 3060ti. What would be best option , i  use 1440p 185hz monitor.It's my first real AMD card, i had one really long time ago ATI 2400 HD or something back in 2009.\n\n# PowerColor Radeon RX 7900 GRE Fighter 16GB OC - 667.40 €\n\n# SAPPHIRE NITRO+ AMD Radeon™ RX 7800 XT 16GB - 625.30 €",
            "Should I upgrade my Ryzen 5 7600X to a Ryzen 7 7800X3D? I built this PC back in April and was wondering if I should bite the bullet now or wait until these chips go on sale",
            "Is a XFX 7900 gre a good option for 1080p and vr gaming? And it has a good overclocking potencial?",
            "I humbly come to ask advice on what mobo's you guys like for the 7800X3D. I've got one of the defective 14900k's and I've had my fill; it needs to go home to Intel. Every week or two it needs more voltage to be stable; it's degrading at a rapid pace and I don't have time to do this twice. Many thanks.",
            "System 7950x3d, MB : Asrock B650E PG Lightnight, Videocard : 4090 Gaming OC.\n\nAll bios after AGESA 1.0.0.7c have a problem were if you shut down in windows, then turn the computer back on, the PCIEX Width is 1x until the PC is Rebooted than it's 16x\n\nThis cause the max wattage to reach about 250W, stuttering in game and all sorts of thing\n\nI have tested all the bios up to the latest and 1.0.0.7b and c work perfectly fine, all other need a reboot.\n\nIs anyone else have this on AM5?",
            "Hey everyone, \n\nI have been running my Ryzen 5 3600 paired with an RTX 3070 since 2021. I have been wanting to upgrade to a RTX 4070 to really take advantage of 1440p gaming but I keep seeing that I might run into a bottleneck issue.\n\nShould I consider upgrading my cpu (which i really really don’t want to do at the moment) or is my 3600 good enough?",
            "Hello everyone\n\nI am planning to build myself a PC with a Ryzen 7500F, but recently I saw on the official AMD website that the max accepted RAM speed is 5200 but the memory I bought is 6800mhz. \n\nDoes this mean I cannot use the full 6800Mhz?",
            "Getting low cinebench scores on Ryzen 7600 for multicore CPU, around 750.\n\nIt's running at 100% utilization, 1.3v and 64W, and only reaching around 70 degrees, so doesn't seem to be limited anywhere. Any suggestions?\n\n  \nAnd looks like low GPU scores for 7900 GRE, around 6500, which seems way off. Again no thermal issues and it's pulling normal power. Everything runs fine in games but wondering if I am leaving performance on the table or could be saving watts\n\n  \nWhat's going wrong?",
            "Hello everyone, i just bought 7800x3D and currently searching good amd gpu for the cpu. Is 6800xt or 7600xt good enough?",
            "Hey lads, can y'all help me figure out how to turn off Auto Dim/ Contrast Adjustment?\n\nEverytime I open a game, my laptop just autodims and I have been trying to fix for days now but no matter what i do, it doesn't seem to stop, I have uninstalled the graphics driver, went to the settings and turned of \"Change Brightness based on content\", got Adrenaline and turned off Vari-Bright and nothing has happened\n\nHere are my specs\n\n  \nDevice name\tLAPTOP-377MEFK5\n\nProcessor\tAMD Ryzen 3 7320U with Radeon Graphics            2.40 GHz\n\nInstalled RAM\t8.00 GB (5.74 GB usable)",
            "bought a 6600m desktop variant and would like to bios flash it with a 6600 since they are basically the same card except the 6600m is power limited, is it possible to do that? if yes, help from anyone that is an expert on this subject would be appreciated.",
            "Does the AMD Adrenalin GPU tuning (global) also affect  the values outside of games? \n\nIf yes, would it make sense to turn down clock speed and voltage for when you're just doing things on the desktop or browsing the internet?",
            "Posted this as a new thread, should probably have come here first (sry mods)\n\nNeed some slightly unusual 7900xtx buying advice...\n\nSo...\n\n\n\n1) I want a 7900XTX, 4k on my LG C2 when I fancy it, other than that 1440p at 144fps in pubg and any future FPS on my usual screen. That's what I want.\n\n\n\n2) currently have a vega 56 with smoke coming out it's ears on top of a 5800X3D.\n\n\n\n3) I \\*must\\* buy it on amazon, because I intend to pay for it with amazon vouchers I did win for being an awesome employee (i.e. putting up with this place for 20+ years).\n\n\n\nThis entire time, since day one, I have been eyeing the sapphire nitro+ thing, it looks great.\n\n\n\nI wish to avoid any and all cooler issues which the 7900XTX was plagued with at launch. I am fed up of noisy GPU fans, silence is golden, but quiet is good too.\n\n\n\nThe trouble with the sapphire nitro+ is that it's rare on amazon and still over £1100.\n\n\n\nthere are plenty of other models that are already reduced, to more like 900. I have £850 in vouchers. I can close the gap for the nitro+, and everywhere I go people say it's the best card....\n\n\n\nbut is there a second best \\*available on amazon\\*?\n\n\n\nanother thing to note, I have a corsair RM 850, which should be fine, but it's white and so is my case and it has a glass window. I'm not that bothered, but if I coudl spend and extra 25 quid to make it all colour match, I will. If it costs the earth, I wont.\n\n\n\nI am scared of coil whine, I am scared of jet engine fans. I also like the idea of it just being a faster card (like the nitro+ is).\n\n\n\nso really, it's down to the price - and it's not like I can't pay the money for the bigger card, but the moneybags in me says don't waste your money if you don't need to and if the 'better card' isn't really worth the money over something almost as good. That said, I want it to last a long time too.\n\n\n\nthing is I've spend so long umming and ahhing about this I figure I'll ask here because at this rate amazon is gonna go out of business before I get around to reclaiming these vouchers (had them for over a year now)",
            "Need some troubleshooting advice after professional repair didn't solve the issue.\n\nWhen I leave my computer in sleep mode for the night, it won't resume as usual. It requires a full power off and on, then it takes 3-4 to boot into the Windows login screen.\n\nAfter getting it diagnosed, their explanation was that my RAM is retraining every time for some reason. This has been going on for a few months, but it was not an issue when I first got the system.\n\nSystem:  \nCPU: 7800X3D  \nRAM: 2 x 16 gigabyte G.Skill (6,000 Mhz)  \nGPU: Nvidia RTX 4080 FE  \nMotherboard: MSI MAG B650 Tomahawk\n\nWe've done a full Windows wipe already and updated the motherboard BIOS. He made some adjustments in the BIOS to try and curb the issue, but it's to no avail.\n\nAny suggestions are welcome!",
            "Hello everyone, I recently just upgraded my previous Intel 8700k, 32GB of DDR4 Ram & MSI motherboard to a shiny new Ryzen 7 7800X3D, DDR5 6000MHZ, MSI motherboard.\n\nI only had one issue so far with enabling XMP on my current motherboard to overclock the RAM. Had to reset my CMOS to get it to work again after setting it. I did the typically overclock 1 profile & it crashed both times didn't try 2 on my motherboard either. (I heard 6000mhz is the sweet spot, is this true)",
            "Hey all, so my monitor is only showing pink and blue colors, some colors have an inverted brightness, unable to find any fix online, i did nothing but update my windows 11 automatically overnight, the next day everything worked fine but after i launched roblox (mind you this was the third or so time i did that today), everything turned to blue, green, pink and purple tones, some even had inverted brightness, for example the Discord logo that was \"dark\" blue is now very light, nearly white pink, etc., its very uncomfortable and i can't find a fix. After several checks it was found out that the colors look normal on other OS like ubuntu, only windows has this issue, but there has to be a fix, right? I'm not changing my entire operating system because of something that could be driver related.. I already reinstalled drivers, switched the HDMI cable, nothing has been changed hardware wise other than that cable.",
            "Is it possible to test SSE small 1T in the new versions of OCCT just like it is done [here](https://www.reddit.com/r/Amd/comments/kk8c0r/curve_optimiser_stability_test_occt_sse_small_1t/)?\n\nI guessing these are the low-load tests which are crucial for CO stability.",
            "Hey there. Game micro stuttering is driving me mad, I’m now thinking about some tricky way to trying to deal with it, is there any similar feature on Intel?? Would love to disable it to see if it works.",
            "hello, my cpu is Ryzen 5 3550h with AMD radeon vega 8 and AMD Radeon RX 560X graphic card with vega 8 as integrated and more powerful rx 560x as hybrid. My blender 4.1 is not detecting this rx 560x gpu, though it is being detected in older blender version 2.9(but is crashes on opening any file). Does anyone has solution to this?",
            "Specs -  \nAMD 7800x3d    \n2x32GB G.Skill   F5-5600J3636D32GX2-FX5  \nXFX 7900 XT  \nGIGABYTE B650M AORUS Elite AX  \nWindows 10\n\n  \n\n  \n\n\n\nI can run at standard 4800Mhz speeds. However; Ive been trying to troubleshoot why i cannot run expo on my motherboard. Machine just doesnt boot. Tried different but identical ram sticks with no success.  I can't even push it from 4800Mhz to 5000Mhz.  When i reach out to my motherboard manufacturer, they tell me it could be my CPU. The AMD warranty page suggests that its more than likely the motherboard. So im torn between what additional tests i can perform to identify the problem part(s).  \n\nAre there any ways i can test the CPU memory controller to see if its a bad CPU. Unfortunately, gigabyte isn't being very helpful in this matter.",
            "I have a Gigabyte X670E Aorus Master (BIOS F24c) paired with a 7800X3D and a 4090.\n\nThis board will not disable the internal GPU despite telling it to do so in the BIOS in the ports section (\"initial display output = PCIe 1 Slot\" and \"Integrated Graphics = Disabled\") and the AGESA section \"dGPU Only Mode = Enabled\" (why do we need duplicate sections to do the same thing? It's confusing and insufferable!!). In Win11, the IGPU is 'disabled' enough that it does not show up in the device manager, but still exists enough for Windows update to insist on downloading and installing 1.45GB of AMD graphics/sound drivers despite being deleted previously. For good measure I then enabled the GFXOFF feature, still nothing changes.\n\nIs this just another example of Gigabyte BIOS builds being buggy junk, a fundamental flaw of the X670E chipset, or am I overlooking a simple setting?\n\nEDIT: [Looks like it is indeed a bug with the latest AGESA 1.1.7.0 Patch A](https://www.reddit.com/r/gigabytegaming/comments/1ctwkiw/possible_bug_with_agesa_1170_patch_a_bios_and/)",
            "**4:2:2 10 bit HEVC video users**, what do you use to have a smooth playback of this kind of videos on your pc? I'm struggling to find a software capable of displaying them. ![gif](emote|free_emotes_pack|grimacing)\n\nI was only successful with **DaVinci Resolve Studio** when connected to power and with a 100% usage of the cpu (when on battery it caps the cpu usage at around 65%, and it is able to render just 40 out of 50 frame). \n\n**VLC** straight up refuses to display anything, apart from the occasional frame. \n\n**Catalyst Browse**, even when the laptop is wired and the cpu is at 100%, is choppy.\n\nDo you always convert your videos in some other format, or do you shoot 4:2:0 only? (By the way, 10 bit 4:2:0 XAVC HS videos push the cpu at a mere 13% using VLC).\n\nI've got a Framework 13 AMD:\n\n* Ryzen 5 7640U;\n* Crucial 2x16 GB Ram 5600MHz;\n* [WD\\_BLACK SN850 1TB](https://www.amazon.it/gp/product/B08KFS6THF/ref=ppx_yo_dt_b_asin_title_o02_s00?ie=UTF8&psc=1).\n\nA user on the Sony Alpha subreddit told me that AMD doesn't support this kind of chroma subsampling, but his sources were two years old. Is he still right, even if we consider that the video has been produced with a three years old machine?\n\nDo you use some kind of software capable of implementing hardware accelerated decoding for this APU?",
            "Is it safe to run 90c lvl 3 pbo enhancement on 7600x? Incase it crashes and stuff. (B650m aorus elite x)",
            "lo que tiene placa asrock a520m recomienda actualizar la bios a la version 3.50 Update AMD AM4 AGESA Combo V2 PI 1.2.0.C ?",
            "Is it normal for my Gpu temps to be this high on a 7900xtx sapphire pulse card, fans are constantly sounding like jet engines aswell.\n\n**This is during a gaming session**  \nGPU Temp Edge: 57.0 C\n\nGPU Temp Junction: 106.0 C\n\nGPU Temp Mem: 72.0C\n\nGPU Load: \\~80 sometimes peaking at low 90%\n\nFan1: 97% Over 3000 rpm sounding like a Jet\n\n  \nI've heard many other users say their sapphire pulse 7900xtx is closer to the 50 to 60 degree mark and is always silent, what gives?",
            "Is there a 3rd party way to get FSR frame gen on games that only have DLSS frame gen? That's the current issue for Hellblade 2",
            "My Ryzen 5 2600 6 core is bottlenecking bad. What is a CPU that is a 200 dollars or less that wont keep my 6600XT at below 60fps on any game?",
            "Hey folks I'm looking to start streaming WoW and such with my new pc and basically I can't find a recent guide on how to process lasso etc for the 7950x3d. \n\nIf anything had changed due to chipset/bios updates and such.\n\nIf anyone has the time could someone give me some tips or a how to on how to get the best use out of the cpu please and how to park / set the cores.\n\nThank you in advance for any help super appreciated !",
            "Hey guys, I've got the ASRock Phantom Gaming 7900 XTX. Its hotspot temperatures have been steadily climbing since I got it, and now it's consistently pushing 110c, with a 30+ degree delta from regular temp (the card, when saturated and at full load, will be in the 70s). I'm wanting to repaste it, and just wanted some advice on what thermal pads/paste you would recommend. I'd also appreciate if anyone has advice on pad thickness, since I've seen them range from 0.5mm to 3.0mm and am not sure which would be best for this card.",
            "Hey guys,  i'm unabled to turn on AMD Expo in Aorus pro X x670E.\n\n Evertime i got Boot failure detected screen after some minutes booting\n\nCan help me?\n\nOperating System: 23H2 OS Build 22631.2861\n\nCPU: Ryzen 9 7950x3D\n\nMotherboard: Gigabyte Aorus pro X X670E bios F24c\n\nRAM: Corsair vengance CMH64GBX5M2B5200Z40K (AMD EXPO)",
            "Hello guys, i have been using the 23.4.3 driver for a long time and i was casually checking to see if the newer ones are better but i was reading a lot of comments that had issues so i always avoided it.\n\nShould i update to 24.5.1 ? I have a rx6600, i have not run to any problems at all, so i dont really have a reason to update them from what i understand, just wondering to see what's up with the new ones and if i have to gain anything from doing so.",
            "Hello Everyone Seeking some Advice \n\nSwitching back to AMD from Intel and have these to CPU's in mind, from what I've seen and read the 7800X3D performs just as good if not better than the 7950X3D just not a hot. Just need more advice on which to choose any help with my decision would be appreciated. This is only for gaming purposes as well ![gif](emote|free_emotes_pack|thumbs_up)",
            "Looking for help with my PC.\n\nI've been having a lot of trouble running games on my machine. I get about 30 FPS in Assassin's Creed 3 Remastered with an RX6600 and 2600x. A buddy of mine says it's an issue with AMD Drivers being \"infamously bad\" and that I should get an Nvidia card like a 3060 card to solve my problems, but while I know very little about computers, I think it's mostly to do with my CPU tbh. My GPU is only at like 60% usage when I'm in-game. is the 2600x bottlenecking my PC? If so, what should I replace it with? I want something I can get many years out of but also uses my current motherboard (B450M). Thanks in advance!",
            "I'm using b450m s2h motherboard and ryzen 5 3500 I'm planning to upgrade my ryzen to ryzen 5 5600x do I need bios update",
            "Is there a way to run windows 11 on 1st/2nd gen threadripper? Any rumors or plans for support?",
            "Hello friends,\n\nA little context currently I have the 5950x & 3090FE, 32GB RAM.\n\nI dual monitor, 14402560 & 34401440. Portrait and UW. I spend most of my time coding, photoshop and gaming. 20%/20%/60% split I'd say.\n\nGames varies. BG3, Total War, Crusader Kings, Escape from Tarkov. I don't particularly see the promise of DLSS or RTX. I've had terrible experiences (in Control, CP2077, Tomb Raider, BG3.) and prefer to play native resolution and adjust settings before DLSS until the AI upscaling is at a level I can tolerate. I currently utilise Process Lasso for certain games to gain that little extra.\n\nI play on my UW, and realistically I strive for 60-80 where available. One can dream of 120fps+ on UW but seemingly not possible on my 3090.\n\nMy priority is to get more stable and higher low fps. I don't want to decrease my workflow too much though, I'm happy to give up, 5-10% speed in that department if I gain it in minimum lower fps and potential higher fps.\n\nI am not opposed to spending money, though I don't want to frivolously spend. I do plan on upgrading in late 2024/2025. AM5, 7800X3D or 7950X3D with a 5090 or more likely the highest VRAM capable AMD alternative if there are no huge upgrade to RTX games or DLSS. Though I am somewhat intrigued with frame gen. Obviously I will have to upgrade almost everything (AM5/RAM architecture)\n\nWill 5800X3D satiate me until next gen GPUs where I will upgrade whole system or is it purely a waste of money. I've seen benchmarks, I've read up it looks noticeable to be honest at the resolution I'm playing on. I just want confirmation outside myself and graphs.\n\nI hear that the OS is less snappy and quick from other written reviews. Is this true? I do value a quick and responsive computer and I did notice it heavily when I upgraded to 5950x.\n\nThank you for your time <3",
            "Should I upgrade my amd 3800 to a 5900 or 5950 to pair it with my rtx 4070  gpu if Im using a 1440 144hz monitor? Will I get more fps ? My mother the AMD X570 AORUS Motherboard from gigabyte supports up to 5000 series amd cpus.",
            "I currently own a 5600x i have 2 upgrades in mind the r7 5800x or the 5800x3d how much differencethere is between those 2? It is justified the extra 50% in price for the 3d? Or the 5800x is a great upgrade from the 5600x?",
            "I am currently using a 3700X paired with a 7800XT. Playing on a 35” ultra wide at 1440p. Is it worth upgrading to a 5800X3D so I can keep my motherboard and ram for around $320 or am I better off with the new socket and spending $700 to get a 7800X3D with a new motherboard and ram.",
            "So I currently have had my pc for a couple years, like five or six, and I upgraded my CPU some time ago from a 2300x to a R5 5600x. I think it is about time I also upgrade the GPU, I'm currently at a rx 570 and I'm wondering what the best pair will be for my CPU under $250, I've looked at some options and have been considering the 1660 super, 6650XT, the 5600XT, or maybe the 5700XT. \n\nAnyways, In summary, I'm looking for what you guys would think be the best option for me under $250, paired with a 5600x \n\nALSO: I'm playing games like Red Dead Redemption, R6, VR games like VRc and Bonelab, and Sea of Thieves. \n\nAnyone with a 5600x or has knowledge on this let me know!",
            "Guys, I have 2700x and am4 mb, I want to buy a new mb, this one is very budget and have no m2 slot.\nWill this cpu be OK with am5 platform so if I buy mb now will I be able to upgrade with newer cpu in future?\nBig thx for answers.",
            "Thinking of switching to AMD from Intel due to all the issues I've been having with my 14900k. I mostly use Blender (60%) and play games the rest of the time (40%), so I'm pretty set on the 7950X3D, just have a few questions.\n\n\n\n1. What's a comparable Motherboard to the ASUS ROG Strix Z790-E? It basically has a bunch of USB ports which is what I'm looking for\n\n\n\n2. Does XMP RAM work with AMD Motherboards, or do I specifically need AMD Expo RAM? \n\n\n\n3. Does Windows still struggle with parking the cores on the 7950X3D?\n\n\n\n4. Do I need special software to make the 7950X3D work properly? I remember reading that you need to download special drivers from AMD, but that was a year ago. \n\n\n\n5. What type of temps can I expect with a 7950X3D?",
            "Ryzen 5 7535HS or Ryzen 7 7435HS better? \n\nPlanning to use it for gaming and drawing. Since there is already a dGPU,  I was wondering if it is just better to get the newer Ryzen 7 7435HS with more cores and thread but without iGPU? Or is it better to choose Ryzen 5 7535HS, since there is iGPU? The price is around the same.",
            "I was thinking about upgrading my PC, but there's no rush. So I was wondering if there's a new generation of processors coming soon or whether I can start taking a look at the current gen. Any indications? I wouldn't mind waiting a few months.",
            "# Ryzen 7 5700x, ASUS Crosshair VI Hero, and 4000MHz RAM? \n\n    I'm planning to upgrade the RAM on my PC, but I don't know if it will work. Help me please. RAM - G.Skill Trident Z RGB (4000 18-22-22-42)",
            "I’m using standard AMD ADRENALINE for pc RED I’d like to use AMD cleanup utility for clean driver install but ALSO I seen maybe I should use AMD PRO software instead? It’s blue vs. red? Thoughts on this? Is there a professional version of AMD ADRENALINE?????",
            "Hey guys, I'm a low budget gamer and I have ryzen 3 3200g and rx570 4gb paired up. I mostly play dota 2 and other mobas, FPS games like cs2 and valorant, wanted to try some open world mmorpg and fps games like tarkov. I want to try to stream easily too.\n\nShould I upgrade my GPU or my CPU first? Thanks guys!",
            "Is there a fix to then AMDRyzenMasterDriverV20 issue yet?\n\nI can find reports of this issue from 3 months ago, and still have not found a complete fix. For some reason, AMDRyzenMasterDriverV20 keeps coming back even after deleting it in Computer\\\\HKEY\\_LOCAL\\_MACHINE\\\\SYSTEM\\\\CurrentControlSet\\\\Services\\\\AMDRyzenMasterDriverV20 and Computer\\\\HKEY\\_LOCAL\\_MACHINE\\\\SYSTEM\\\\ControlSet001\\\\Services\\\\AMDRyzenMasterDriverV20. After every reboot, it comes back, causes a crash, and i am provided with the error \"The AMDRyzenMasterDriverV20 service failed to start due to the following error:\n\nCannot create a file when that file already exists.\" in event viewer, right before the crash.\n\nso far i have tried using ddu again, tried amd cleanup utility and reinstalling all the latest drivers from the amd website, and i have tried uninstalling ryzen master, adrenaline I have also tried the chipset drivers from [My motherboards website](https://www.gigabyte.com/Motherboard/B550-UD-AC-rev-10-11/support#support-dl-driver-chipset). Im not really sure what to do as i have not found a single fix other then it randomly stopping for some users.\n\nedit: used [this autoruns utility](https://learn.microsoft.com/en-us/sysinternals/downloads/autoruns#download) to delete \"AMDRyzenMasterSDKTask\" and disabled (NOT DELETE) AMDRyzenMasterDriverV20. gonna see if another crash happens with the same error in event viewer.\n\nEdit 2: that fixed it :D\nYou must redo the process every driver update tho. But hey better then crashing from it.",
            "I’ve found videos from a year ago about bugs/issues with AM5, are things better now?",
            "First time building a PC. I just decided to check in on my temps and found that my GPU GCD hotspot temp is way higher than the rest of the GPU sensors.\n\nhttps://i.imgur.com/O207Jva.png\nGCD temp goes up to 109.7 in past\n\nI'm using RX 7900 XTX Taichi White 24GB OC with a Dell aw3225qf (4K).\n\nIs this ok or do I need to be more concerned? I don't have the original box anymore unfortunately, and I bought the card about a month ago.",
            "I currently have an air cooled Radeon 7900XTX and plan to water cool it. My current OC settings leave more to be desired, though I believe I'm limited by the card's smaller stock radiator, but I keep getting massive crashes whenever my voltage/clockspeeds are too low/high even if the temps are acceptable.\n\nAny thoughts?",
            "Lost my game data that showed time played doing a fresh driver install. Anyway to get it back?",
            "Anyone know how to fix this the game can record fine if the adrenaline tab is opened and not minimized but as soon as its minimized the recording just freezes but the mouse moving is still seen\n\ngpu is a rx 550",
            "Hello guys. Looking into buying a mini PC from Asus since its on sale. But im confused. Apparently Ryzen 7 7735H is a bit odd.\n\nIt apparently comes with both 660m and the 680m IGPU which is what I want. Is this snake oil or true info? See [https://www.proshop.dk/Stationaer-PC-Mac/ASUS-PN53-S7110AD-Ryzen-7-7735H-16GB-DDR5-512GB-Windows-11-HOME/3155696?utm\\_source=pricerunner&utm\\_medium=cpc&utm\\_campaign=pricesite](https://www.proshop.dk/Stationaer-PC-Mac/ASUS-PN53-S7110AD-Ryzen-7-7735H-16GB-DDR5-512GB-Windows-11-HOME/3155696?utm_source=pricerunner&utm_medium=cpc&utm_campaign=pricesite)\n\nIs their info wrong or right? Its under general it says 660m, BUT they have other models with same CPU and 680m such as: [https://www.proshop.dk/Stationaer-Mini-PC-Barebone/ASUS-PN53-S7096AD-AMD-Ryzen-7-7735H-16GB-512GB-VESA-Mount-WI-FI-6E-Win-11-PRO/3155690](https://www.proshop.dk/Stationaer-Mini-PC-Barebone/ASUS-PN53-S7096AD-AMD-Ryzen-7-7735H-16GB-512GB-VESA-Mount-WI-FI-6E-Win-11-PRO/3155690)\n\nThe links are from a good e-retailer :) well the best in scandinavia anyway.",
            "MASSIVE Stutter in a game that my pc is overkill for.\n\n  \nSo my steam FPS counter says I am playing at 80-100 fps but game looks like I am paying at 20-25. It's Unreal engine 3 game that's doesn't have the best optimization (lost ark) but none of my friends I play regularly with have those issues. It's one raid in particular that has these massive stutters. Recommended setup to play the game at 4k ultra is RX6800, 16GB ram and R5 and I have 6950 XT, 64GB of ram, 5800X3D, 1tb 970 evo, and the game just plays so poorly.\n\nI had an issue in the past where the game worked poorly had same exact stuttering while shadowplay/instant replay was on, but once I turned it off it worked smoothly again. Does anyone have a clue why would a game stutter at 100fps?",
            "Ghost of Tsushima question:  I'm using driver 24.5.1 and I keep getting 0x887a0006:dxgi_error_device_hung with driver.\n\nWasn't this supposed to be fixed?\n\nIs AMD still working on making this game playable?",
            "[deleted]",
            "**Cool'n'Quiet VS Powernow!**\n\nI have an Alienware R10 with a Ryzen 7 5800x 8-core. I admittedly don't know a whole lot about the bios settings but I accidentally had my headset on the keyboard when I booted up and it opened the bios menu so I was clicking around and saw the powernow! option was enabled. I was curious what is was so I googled it but everything I've read says the Powernow! is supposed to be for mobile processors (ie laptops), and that desktop pcs are supposed to have Cool'n'Quiet. \n\nIs it normal that my desktop is showing the powernow! and not the Cool'n'Quiet? Wiki says they're a little different under the hood so I am just curious if something is afoot. I don't plan on using it really, since I've only seen people wanting to turn it off when they have lag or stuttering issues, which I do not have. But I am still curious. Google doesn't help with explaining the difference.",
            "I'd like to know something. Has any of you had the dell 7425 2 in 1 AMD Ryzen 7 7825u, this laptop comes with a 4-cell 54wh battery and I'd like to know how long it lasts on a single charge.",
            "Guys, how can I chat on the discord servers? The community one says \"have you finished reading? Check other servers\" and doesn't let me type there. What should I do?",
            "My ryzen 7800x3d sometimes goes up to 70 degrees while watching yt, its doesnt happen all the time but sometimes it gets hot and the cpu fans ramp for no reason. I am pretty sure its a bug and i dont know how to fix it lol, i ‘m using a gigabyte motherboard btw.",
            "**Sometimes the PC gives EC code and won't post during memory training**\n\nI have an AM5 system with 7700x + ASUS B650E-E.\n\nAround every two weeks the PC is doing memory training when I turn it on which is normal. In this state it is showing qcode 15 and after 15-20 seconds it is posting.\n\nA few months ago these memory trainings has started to fail which means after watching code 15 for seconds, sometimes it turns into qcode EC and hanging forever. Sometimes one restart solves this, sometimes I need to turn the PSU off and on.\n\nWhen the system is already booted, it's rock stable and pass every stress test.\n\nNot sure if it's a new thing because the first year I rarely turned off the PC but always switched into sleep mode. Nowdays I turn it off several days in a week. The rig is around 1.5 years old.\n\nThe most important question is, can it be a hardware related problem even if the system is rock solid after it's booted?",
            "I've received 2 Ryzen 7 5700x and they have both been dead on arrival. Initially I had thought the problem was the motherboard (b450m dsh-3 wifi) so I had it inspected by the the company I had bought from (PC Case Gear) and my motherboard had been problem free. Have I been unlucky or could something be killing my cpus?",
            "Do I need to clean the drivers if I first installed Windows with just the igpu of my Ryzen 7600? My 6650 should be arriving next week.",
            "AMD RYZEN 7 7700X TDP & TEMPS\n\nHi, I've been looking to buy an 7700x for some time and my one and only drawback is the temps.\n\nI have an id-cooling dash flow 240mm basic, which is rated for up to 260W TDP. However I've been unable to find somewhere to predict the cpu temperatures.\n\nI've seen many people say 240mm might not be enough, and others that say that it is.\n\nFrom what I could find, this cpu goes up to 95c no matter what you do, but since this is 105W TDP, will my 260W TDP AIO run it a bit cooler? Should I enable ECO mode?\n\nFull specs would be:\n\nR7 7700x\nASUS TUF Gaming B650-PLUS WiFi\nId cooling dashflow 240mm basic black\n32gb ddr5 ram\nRtx 2070 founders edition\n1000w PSU Corsair rm1000e\n\nAnd btw, if 95c is normal in this cpu, it won't affect the lifetime of the cpu? Idk if I should let it run at that temp or try to lower it down really.",
            "Question. Im looking to buy a laptop to work.  \nAny AMD notebooks with good quality from chasis stand point and great battery life?  \nI dont need nor want a dedicated GPU , neither a Intel CPU.  \nAny good bang for the buck out there ?",
            "What is the default PBO settings for the Ryzen 7 7700 in bios? was it initially set as \"auto\" ? I can't remember.",
            "Need help with 7800X3D + GSkill 6000Mhz Booting problem  \n  \nHello everyone,  \nI've installed a new system but I'm having a difficulty with running my ram on expo settings.  \nWhen I boot the system with expo enabled to 6000, ram not found led lights up on my motherboard. If I keep waiting for like 15-20seconds, the light disappears and the system boots up. After that point, everything works without a problem, all the timings and speed are correct in windows and there is no problem with stability/ram tests. If I disable expo, system boots up without any problems. Latest bios is also installed on the motherboard\n\nHere is my computer spec;  \nMSI Tomahawk B650 Wifi  (supports the ram I purchased)  \nGSkill Trident Z5 Neo RGB 6000 (F5-6000J3038F16GX2-TZ5NR)  \n7800X3D and Corsair RX1200 PSU",
            "https://i.imgur.com/02nAtXX.png how do i disable the shared gpu memory? i have an xtx, but my ram is only 16gb. i'd rather 100% use the xtx and keep all my ram. heck the the xtx has more vram (24gb) than my ram (16gb). a bit ironic that my system wants to share half of my ram with an already huge vram.",
            "hello . just asking for some help. i cant seem to install my drivers on my msi rx 570 armor oc 4gb gpu. tried all i know but nothing happens. hope someone readds thhis comment. Tia.",
            "# Store MI crashed my PC and made it unbootable\n\nI'm very upset. My X570 based PC (5950x, 64 gb ram, 380Ti, Gigabyte x570 Master) crashed several times and became unbootable.\n\n \n\nI had checked AMD's site for updated chipset drivers, and found the system to be up to date. Installed Store MI anyhow, having forgotten what it was.\n\n \n\nOpened it and read up.  This was after the PC had crashed almost immediately if not right away . Had clicked on one of the three HDD's and  gone no further when the PC crashed again with a note that no boot device found. Think it crashed as many as four times before it became unbootable.\n\n \n\nAs I had lots of programs on my C drive (2 tb SD SN850x) I had recently cloned its contents (at the time not enough to fill the 500 gb SSD that I used). However that /SSD has a damaged SATA port pin and isn't recognized. So, now I'm having to start over with a windows 11 iso  and want to install W11 temporarily on a HDD in a USB device, \\\\so that I will be able to regain all the programs on the original C drive and any other data.... and eventually  format it and start over with it as the boot drive.A pain in the butt and should never have happened.  \n\n \n\nI have no idea what happened or why, but I for \\*\\*bleep\\*\\* sure will never install StoreMI again. (I think I had installed it before on one of my 3 Ryzen powered PC's, found it to be of no use and uninstalled it.. but I don't recall when or on which PC-other two are x470/3700x and X570/5800x.)\n\nI've opened a support ticket at AMD and also posted in the AMD community, I think.\n\n \n\nAgain, I'm am extremely unhappy!! ANGRY, even!!",
            "AMD Ryzen 7 8840HS vs Intel Core Ultra 5 125U \n\nI want to buy the new HP Envy x360 2-in-1 Laptop that comes either with the AMD Ryzen 7 8840HS or the Intel Core Ultra 5 125U. Can you help me pick? Which CPU is better and why?",
            "# Can you have MGPU enabled with two 7900 XTX's?\n\n\n\nHey all, I'm wondering if anyone has any experience with MGPU and two 7900 XTX's; I'm following this information from amd resources: [https://www.amd.com/en/resources/support-articles/faqs/DH3-018.html](https://www.amd.com/en/resources/support-articles/faqs/DH3-018.html) but I do not see any options to enable MGPU anywhere. My drivers are up to date.\n\nI have two 7900 XTX's on my mobo (x670e Hero) - I'm using Houdini and running simulations - I can change my solver to use either of the GPU's and I see both GPU's in Adrenaline and task manager so I know they are both working fine, but for some reason I don't see any options for MGPU in Adrenaline or anywhere else\n\nHas anyone been able to get these cards working with MGPU? What software/games allow you to enable MGPU?",
            "Currently I have a 5600x that is cooled with a 240 AIO. My question is would that be enough cooling for an upgrade to a 5800x3d. And if I did a full switch to AM5 at which chip would the 240 no longer be enough?",
            "Hey hive mind, I’d appreciate you help!\n\n[My ASRock X370 Killer SLI AM4 AMD](https://www.asrock.com/mb/AMD/X370%20Killer%20SLI/index.asp) died (no post, I have removed battery etc) and I need replace it, hopefully with something a bit future proof.\n\nI don’t need SLI, but more M2s than 2 would be nice, and I need the same form factor, and be able to use my current 2x32 GB RAM,  GPU - RTX 3070 and CPU - Ryzen 7 1800X.\n\nWhat would be a good cost-effective replacement? ",
            "My Asrock RX 7900 xtx is causing my PC to not post when the case is standing upright, but it will post when it's laying flat. My temporary solution is to place a deck of cards in one corner of the GPU to prevent it from sagging, but this is a terrible permanent solution. If i remove the support after post, i get massive ammounts of artifacts. Asrock does not provide a support bracket for this GPU, something that all the other manufacturers do. I have had this card for 3 days, and a I feel like this happened way too soon for my liking. Is there a known easy fix to this, or should I just RMA it right away? The only quick solution in terms of RMA is to \"regret the purchase\", get my money back and pick another model as they are out of stock on Asrock. ASUS is the only 7900 xtx manufaturer which is similarly priced, although i would very much like to not support ASUS any further, given the ammount of crap comming from their direction. The other 7900 xtx cards are 250-400$ more expensive, so those options are out of the question. It is also worth noting that i tried to put pressure on my old GPU while posting and it posted just fine, so this is likely and internal malfuntion in the Asrock GPU. Any insight or suggestions are much appreciated!",
            "How do I get 2 graphics cards to work interchangeably? I have an integrated AMD graphics card and a 4060 I installed in my PC. \n\nWhen I play Ark, I have to *disable* the integrated one in device manager or else the game wouldn’t open up (it just crashes). But when I play another game, I have to *enable* the integrated one back on or else that other game would lag intensely. \n\nI don’t know why those 2 games use different graphics card, but I’m guessing a way to make the graphics cards work interchangeably would be the solution?",
            "Hello, everyone! I've never had a PC before, so I have no clue what's better I'm gonna use this for gaming like gta V, valorant etc..  \n\n\nfound a store that sells build PCs and I would like to one from them but I don't know which one to choose from two as I have no clue what I really need. One has Ryzen 3 3200G & the other Ryzen 5 2400G which is really the only difference I see on this PCs. What's the difference here? Which one would be the best option for what I need it?Thanks\n\nOption 1 specs:\nProcessor: AMD Ryzen 3 3200G 4 Cores 4 Threads 4.0GHz\n\n• Motherboard: CERVVO B450M-F, VGA & HDMI (4 DIMM)\n\n• RAM:16GB DDR4 RAM 2666Mhz\n\n• Graphics: Radeon Vega 8 Graphics\n\n• SSD: 2.5 Inch 512GB SSD\n\n• PSU: GP300L 300W True Rated Power Supply\n\n\nOption 2 specs:\nProcessor: AMD Ryzen 5 2400G 4 Cores 8 Threads 3.6GHz\n\n• Motherboard: RAMSTA B450MP Motherboard, VGA & HDMI (2 DIMM)\n\n• RAM :16GB DDR4 RAM 2666Mhz\n\n• Graphics: Radeon RX Vega 11\n\n• SSD: 2.5 Inch 512GB SSD\n\nPSU: GP250L 250W True Rated Power Supply",
            "Hello, I bought Asus Dual RX 6700 XT 2 days ago and since then been trying to fix the issue of getting blackscreen in games.\n\nGPU works just fine in benchmarks - AIDA64, Furmark, Unigine Superposition. No artifacts, no black screens, no bsods. \n\nBUT, in games and in their benchmarks I get this blackscreen - max RPM on GPU's fans, the only way I can get image back is to cut off power to the pc, wait for a minute and then turn it on. When I'm booted back into the OS, sometimes my gpu driver needs to be reinstalled (I get error 31 and 20-something, not sure). Radeon Adrenaline says that 'AMD software detected that a driver timeout has occurred'. \n\nI managed to somewhat fix this by reducing gpu core frequency to 1800 MHz. This is the only frequency that allowed me to finish benchmark in RDR2, Shadow of the Tomb Raider and launch The Long Dark (yes, just to launch it, before downclocking I couldn't even launch the game, I would get black screen immediately).\n\nI tried to:  \n- reinstall win 11;  \n- disabling win autoupdate;  \n- reinstalling gpu drivers (using ddu in safe mode AND amd cleanup utility);  \n- my psu is brand new 750w chieftec a80;  \n- updated motheboard bios, chipset:  \n- updated vbios on GPU;\n\nAny idea what could be done with this GPU?",
            "The AMDGPU drivers absolutely suck. It is incredibly bad. Ive had issues with hardware accelerated apps just freezing my entire computer and the only way to do anything again is to force shut it down by holding down by laptop's power button. I have got a laptop that \"supposedly\" changes to dGPU when I open a game but that seemingly only works once per boot, ie open a game once then close open another game and it uses only iGPU and to get anything to use dGPU again I need to do a stupid restart, I have greatly enjoyed using the \"Display Color Enhancement\" on dynamic contrast feature in the software though, but everytime I play a game in fullscreen which is what anyone sane should be doing it just disables itself for some reason, but the slider and everything still remain on but the effect goes away...\n\nI have reinstalled pc and gpu drivers but noen of this fixed\n\nHeres my laptop: [https://www.asus.com/us/laptops/for-gaming/tuf-gaming/asus-tuf-gaming-a16-advantage-edition-2023/techspec/](https://www.asus.com/us/laptops/for-gaming/tuf-gaming/asus-tuf-gaming-a16-advantage-edition-2023/techspec/)",
            "Just bought about RX6600 as a temporary replacement for my 3090, and I am not seeing video upscaling as an option anywhere in the Adrenaline menu. Is it not supported?",
            "Hello everyone, Recently installed the 7 5800x3d into my b450 tomahawk max, and so far my cpu (cooled with a corsair h100i platinum se) has been idling between the late 40s and early 60s (degrees C) In games, the temps max out in the early 70s. Is this normal?",
            "Hi, I have just gotten my RX 6600, paired it Ryzen 5 3500x. While I am playing Ghost of Tsushima its temps ranges from 67C to 70C. Is this normal? If not, can you guys suggest anything to do with its temperature? I have 4 fans currently in my rig. three intakes, one exhaust. Thank you.",
            "Hello I was wondering if the 240mm Galahad Trinity ii can cool the 7800x3d?",
            "What is the best b450m compatible cpu (the gpu is a rtx 4060)",
            "Does Computex get streamed? Wanted to tune into AMDs keynote",
            "I am having problems with is motherboard since basically since I bought it I have to keep flashing the bios and or reset windows because my internet goes down. My fiber modem router and network switch all work fine. When you go into bios its shows N/A under mac address until you do one of those things I mentioned. It will work all day and night until you turn it off. Then when I wake up it will not work until you reflash the bios or reset windows. I even tried what gigabyte support said they said that the nic chip is bad so I turned it off under io settings. I was getting Wi-Fi but the same shit happens with it. I wanted a wired connection so I could use my full internet so I bought a nic card. Guess what NOW the nic card is not recognized unless I do the same shit and then it works everything else is fine from my video card to my memory to my nvme I'm at my wits end with this motherboard. I am 33 and have been helping build computers since i was five and building them since i was 11. My first pc was a dos 8086. My computer specs are as follows:\n\n7700x, X670 Aorus Elite AX rev 1.0, Xfx 6800, Gskill expo 6000 cl 32, Western Digital Black nvme, 850 watt platinum rated Corsair power supply, Thermalright phantom spirt pro, and now a Tp-link nic card.\n\nCan anyone point me in the right direction I've had two MSI motherboards since 2018 cause that when i started building again and no problems with either of them HELP!!!!!!!!!!",
            "How frequently should you upgrade AMD chipset drivers? \n\nIm on 6.01.25.342 since I've heard about stability/fps issues with the newer one last month. Is it necessary to keep tabs and be up to date with chipset drivers akin to my Nvidia GPU drivers or can I go long without having to update it if everything is working fine?",
            "# Ryzen 7 7700x Optimization for FL Studio PC Build\n\nHello to everyone!\n\nThree months ago, I built my sound design studio PC from carefully selected parts after conducting thorough research to create the ultimate FL Studio setup. So far, I am very happy with the results, especially the workflow. I’ve managed to achieve a state where I don’t have to worry about how many heavy plugins are running in multichannel, and that’s great. However, I feel the rendering speeds supposed be faster in my setup. While I render my mix, the CPU usage is only around 10-13%, while the temperatures remain pretty normal at around 65-70°C.\n\nAm I missing something? I think I might need to create an undervolting profile for the CPU to optimize overclocking for FL Studio, but my technical knowledge is limited in this area. Please help.  \n\n\nMy setup:\n\nASRock X670E Pro RS  \nRyzen 7 7700X  \nCrucial Pro 16GB (2x8GB) 5200MHz  \nCrucial T700 Gen5 1TB NVMe, 12.5 GB/s  \nNo Graphic Card  \nI invested everything into SSD/mobo/CPU since I don’t play games on this build and 521mb of integrated vram is enouth tp run fl studio and retro games that I like.",
            "Should I get a 3200g or 2400g? The 3200g is newer but less threads but 2400g  has more threads but is older. I am leaning towards the 2400g but would like to hear your opinions.",
            "I just built my first PC and I'm running into some stability issues. I've updated everything (Windows, drivers, BIOS), and my temperatures seem good (40-50 idle, 70-80 under GPU stress test). However, my PC keeps freezing for a split second every few seconds to ten seconds, and then restarts randomly.\n\nSince I'm new to building, I suspect the RAM might be the culprit. I wasn't aware that RAM compatibility can be an issue.\n\nHere's my setup:\n\nCPU: Ryzen 7500F\n\nMotherboard: AsRock A620m-HDV/M.2\n\nRAM: G.Skill Trident Z5 RGB DDR5 7200mhz CL34 (single 16GB stick from a 32GB kit, Intel XMP ready)\n\nI tried enabling the XMP profile in the BIOS, but the BIOS freezes whenever I try to save the settings.\n\nPossible RAM Incompatibility?",
            "I am soon going to switch out my current graphics card (r9 fury) with a rx 6700, and was wondering the best way to install my new drivers, would the factory reset option be sufficient or should I uninstall the old drivers first using a different software.",
            "pc randomly shuts off giving windows 10 blue screen after updating bios. extra issues even before updating was games tabbing out.\n\n[pc specs](https://au.pcpartpicker.com/list/DDmXJy)\n\nerror i get: kmode\\_exception\\_not\\_handled\n\nEdit: tried fixing by enabling xmp and turning off tmp 2.0, one of the two fixed it for a little longer than usual until i got the error again",
            "What are the odds we get at least one x870e motherboard with USB4 v2.0 support? I need that 80gbps, and I was hoping this would be the moment, but leaks of new motherboards only have 40gbps. If not, any chance for PCIe add-on cards soon?",
            "what’s the difference between Merc, Speedster and QickGPU’s? I’ve got a RX6750XT QICK",
            "Hello AMD users, I have a question.\n\nbetween sapphire pulse rx570 or asrock 580, which to pick?\n\nI watch/read around sapphire, power color, and XFX are [the three trinity amd](https://new.reddit.com/r/Amd/comments/yd7u0i/amd_aib_tier_list/).\n\nhigh brand but low version, or the mid brand but high version?\n\n&#x200B;\n\n~~pls don't recommend other gpu like \"don't pick this, pick like rx5500/rx6600/etc. I'm budgeting and they're expensive\"~~",
            "Hello everyone. I own a PowerColor Red Devil RX 7900 XTX graphics card, and unfortunately, the thermal paste application was poorly done. After reapplying the paste, I noticed an improvement in temperatures. However, the paste seems to have shifted again. I plan to try using PTM7950 thermal paste this time. Unfortunately, I’ve stripped the bolts that secure the tension bracket in place. Does anyone know the size of these bolts or where I can purchase replacements? I’ve already reached out to PowerColor support, but their assistance wasn’t very helpful.\n\n\nFeel free to ask if you need any further clarification.",
            "\n\n“Hello everyone. I own a PowerColor Red Devil RX 7900 XTX graphics card, and unfortunately, the thermal paste application was poorly done. After reapplying the paste, I noticed an improvement in temperatures. However, the paste seems to have shifted again. I plan to try using PTM7950 thermal paste this time. Unfortunately, I’ve stripped the bolts that secure the tension bracket in place. Does anyone know the size of these bolts or where I can purchase replacements? I’ve already reached out to PowerColor support, but their assistance wasn’t very helpful.”\n\nFeel free to ask if you need any further clarification.",
            "# Does My Monitor Have FreeSync? (MSI G274QPF E2)\n\nI just bought this monitor and i am wondering whether it has official FreeSync support or not. I've read on the website that it has Adaptive Sync but i'm not sure whether or not AMD has officially certified it as FreeSync compatible.",
            "What's a good upgrade from an RTX 4070? I know the 7900xtx is the obvious answer, but are there more budget friendly cards that still outperform the 4070?",
            "# 5900x vs 5950x Performance Difference for Streaming Heavy Games\n\nHey all!\n\nI've had my 5900x for a while and I love it. I do run into some CPU bottlenecking on certain games when streaming them. The most obvious example is Cyberpunk. Since it is CPU limited no DLSS (other than Frame-Gen) or anything helps much with the issue.\n\nIf the game were to be played on its own the issue is non-existent, but while having all of the streaming software active it hovers around the 40-50fps mark. \n\nIf I were to upgrade to the 5950x, do you guys think there would be a worthwhile difference in the game performance? I am hoping that by having more cores to go around, the other software will not cause the game performance to lower.\n\nThanks!",
            "Hello Redditors, recently I've tried undervolting my 5800x3d with PBO2 Tuner to -30 on all cores and noticed that my voltage, temps and power comsumption are lower with PBO2. The thing that i have noticed is that in some game that take advantage of the 3D cache like valorant, my fps dropped from 400+ constant to 180-220, it was like i was playing on a 5800X. Have i done something wrong while i was follwing this [undervolting guide on Github](https://github.com/PrimeO7/How-to-undervolt-AMD-RYZEN-5800X3D-Guide-with-PBO2-Tuner)?",
            "I'm currently using an RTX 3070 (8GB) but I wanna upgrade in the future to maybe something like a RX 7900 XT or even a 7900 XTX. Now I hear if you plan to play games and also do content creation you usually stick to NVIDIA, I just wanna know if this perception has changed enough for me to switch over to AMD?",
            "I recently bought an RX 6800 that I plan on using on my 60 Hz monitor which doesn't support Freesync. Is this a problem? Will I experience stuttering?",
            "Hello I’m new to the pc building world (I’ve only ever used pcs my dad has built) and I’m looking to build my first one. Interested to hear what you think I should go with for my cpu/gpu combo? I’ve watched some videos and am thinking of maybe a ryzen 5 7600 paired with a rx 7600xt or rx 7700xt. Please leave your thoughts and suggestions. Thanks!",
            "With a couple of new CPUs being announced for AM4, I wonder if anyone might know which CPU between the 5900XT and the 5800X3D would be better for gaming. I know both of the processors are different in the sense of what the 3D does, vs an XT, but I am wondering since the 5900XT appears to have a much higher core count + faster speed, if it might be better than the 5800X3D despite the 3D V-cache. I know the best answer will to be to just wait until July for benchmarks, but perhaps someone knowledgeable can offer some insight. Thanks.",
            "Hi, does the asus tuf gaming b650m-plus USB type C supports video? I want to connect my docstation (BW-TH13) to it, to easily switch between my work laptop and my PC, I have 2 monitors plugged into it",
            "Hello, i'm upgrading my 6650 XT to a new 7900 XT.\n\nHere where i live i have two options, both at the same price.\n\n-- ASrock RX 7900 XT Phantom Gaming\n\n-- XFX RX 7900 XT Speedster Merc 310\n\nAny major difference between the two? like clock, better heat dissipation or even RMA?",
            "Hey fellas, needed some help here. Upgrading from Ryzen 5 1600 to Ryzen 5 5600x and gonna update the motherboards's BIOS as soon as the new CPU arrives. My question is: when should I swap the CPU? Should I update the BIOS first before swapping in the new CPU? Knowing that the Ryzen 5000 compatibility update drops the Ryzen 1000 compatibility, I'm afraid I won't be getting a screen after updating to make sure if the BIOS has updated or not. My motherboard is a Gigabyte B450M S2H.  \n  \nThanks in advance!",
            "Has anyone got a fix for this problem I'm having?\n\nAfter updating bios to version '7D75v1H' for my 'b650 tomahawk wifi' motherboard the pc randomly shuts off while normal usage giving blue screen \"kmode\\_exception\\_not\\_handled\" mainly noticed when gaming giving off blue screen and showing this error message.\n\nTried fixing by enabling xmp and turning off tmp 2.0 but nothing.\n\n[My PC Specs](https://au.pcpartpicker.com/list/DDmXJy)",
            "Hello, i just unplugged my PSU yesterday, after switching it off, and then i lightly clean my PC, just using a hand vacuum, and left it uplugged for the night. Today, after 24hrs, i came home and plugged all the cables into the PC (mouse, keyboard, internet cable), and when i powered it the GPU won't start - no fans movement, no display on all the three Display Ports.\n\nI just want to know what can i do more before i go to the shop for warranty. Thank you!\n\nPC:\n\n* Sapphire Radeon RX 6700 XT Pulse 12gb\n* MSI B550M PRO\n* AMD Ryzen 5 5600x\n* Kingston Fury Beast 2 x 8gb 3600Mhz\n* be quiet! Pure Power 11 FM ATX 650W 80+ Gold\n* be quiet! Pure Rock 2 120mm\n* Samsung 980 500gb\n* Deepcool Matrexx 50 mid tower\n* 5 x be quiet! Pure Wings 2 140mm\n* Deepcool Fan Controller FH-10\n\nNotes:\n\n1. The day before the cleaning i played some games and worked on the PC and everything was fine, the GPU was not disconnected or touched in any way since then and thru cleaning.\n2. I do not have a integrated graphics\n3. All the components seem to work fine (fans, cpu fan)\n\n  \nWhat i tried:\n\n* Disconnect and connect the GPU\n* CMOS clear\n\n  \nI will try tomorow to go to the warranty as i got it almost 2 years ago.",
            "Hi guys today I upgraded from my old pc with a mostly new build into a ryzen 5 7600 non x with a rx 7900gre specifically the hellhound red devil model , 6000mhz 32 gb ram , Asrock b650m-hdv m.2 I am using it with a 1080p monitor and I keep getting an extremely grainy image on YouTube thumbnails and in all games , I've tried reinstalling adrenaline but to no avail I've also messed with the color settings but it won't do get rid of the fuzzy graininess , I'm also unable to change the rgb on the 7900 gre because powercolors software does not detect it i have the argb header on it connected to razers rgb hub because my motherboard doesnt have a rgb header could someone help? Edit : I've also tried installing the driver without adrenaline didn't seem to do anything I have the monitor plugged into the gpu with a display port cable",
            "Has anyone seen news about CAMM2 support for x870 motherboards? Seems like there's some excitement for this on the Intel side with support from multiple mobo manufacturers. And based on the benefits of CAMM2 I can see why. Haven't found any news on CAMM2 for AMD yet though.",
            "**System specifications:**\n\n* Operating System: Windows 10 22H2, OS Build 19045.4412\n* CPU: AMD Ryzen 7 7700X, EK 360 AIO PBO -20 \n* GPU: Sapphire 7900XT Pulse no OC 24.5.1 drivers\n* Motherboard: Gigabyte B650M-D3SH\n* RAM: 2x16GB A-dies 6400mt/s custom timings\n* Storage: 2TB 990 Pro, 4TB SN850X\n* PSU: Thermaltake 1200W GFA3\n* Display: KTC 160hz 27\" 4K\n\nProblem: I got a great deal on the 7900XT and wanted a little more power for my 4K screen, so I grabbed it and replaced my 7800XT. Now, every time I boot up it crashes the AMD drivers and I have to reboot 3-4 times before it works right. The screen will be gray and then flash on and off a dozen times before it comes up showing the driver crash error reporter.\n\n  \nI have DDU'd the drivers and reinstalled, but it keeps doing it. I've run into this problem before with a Gigabyte card where the GCC was crashing the driver, but I have nothing like that installed now. Also, the 7800XT does not do it. Once the driver loads properly, the card plays games with no problem for endless hours. Temps are great, this card has the smallest core to hotspot delta I've seen on a 7000 series.  \n\n  \nI have tried other cables and monitors just in case and it still does it. I'm a little baffled by this.",
            "I'm planning gaming pc full AMD build on a budget , is now a good time to purchase CPU / GPU ?\n\nWhat about RAM,  SSDs and SFX PSU units ?\n\nLooking for something like 32 GB / 64 GB RAM ( 32 is fine but 4 slots so I can upgrade to 64 in future )\n\nI think going below 1TB SSD is bad idea today especially if you need space for work + few games , they often have like 80 GB space.  \nI don't think I will need more than 700W PSU ( or 750 ).\n\nI don't have enought money to get good CPU and GPU combo , I would prefer to have right now something like Rx 6650 xt / 6750 xt / 7600 compared with really good CPU so I could upgrade in future when AMD releases new GPU.\n\nHow long would I have to wait? Would it be good to buy CPU now or wait untill AMD releases new set of GPUs and CPUs ?\n\nWould it be good to remain on AM4 socket ?  Maybe high end AM4 CPU would be better on a budget than midrange AM5 ? Would it be wise to buy SSD / RAM right now or wait?",
            "I'm confused about the new AMD Ryzen AI 300 CPUs. They support 50 TOPS and are efficient, but are they the best for gaming laptops? Are they suitable for real desktop replacement laptops, or are they mainly good for AI? What is the best AMD CPU for a gaming laptop right now? I'm not concerned about battery life since my laptop is usually plugged in.",
            "Should I wait for AMD 9000 series or buy an AMD Ryzen 8700G or 7800X3D? I mainly play RuneScape at the moment which isn't so demanding and I also play a bit of Destiny. Thanks! ",
            "At the end of this month I am planning to build a new pc. Right now I have one with an Intel i9 11900K and RTX 3080. And I want to update/replace this with a build including the 7950X3D and a RTX 4080. But as most of you know there have been some issues with this CPU's gaming performance because of the seperated ccd's and additional drivers/software. But it according to the amount of posts and news it seems that these problems are less common. So my question to you is: Will I be taking a risk to choose the 7950x3d instead of the 7800x3d? \n\nI will use my build for gaming, daily use and crafting around with VM'S. I also don't want to change any settings with things like Project lasso (Will be using the drivers and Xbox app) and won't be multitasking like gaming and streaming/other things.\n\n  \nAt first I choose the 7800x3d but I don't want to miss out on the performance of the 7950x3d beyond the slightly less gaming performance.\n\n  \nThis will be my build:\n\n[https://pcpartpicker.com/list/vs3pPF](https://pcpartpicker.com/list/vs3pPF)",
            "I just built a 7700X on an MSI X670E and have some questions on using Ryzen Master. Does using Ryzen Master preclude making any changes in the BIOS. I'm trying to optimize various scenarios, but anytime I have Ryzen Master make changes to the BIOS it seems that I cannot change anything, even unrelated, in the BIOS or I will get an error in POSTing. Given the time it takes I haven't been able to test this theory extensively. There is really just one setting that I'm trying to figure out and that is Hybrid Graphics. There is info on Hybrid or Dual Graphics going back to 2013 or earlier, well before Ryzen was a thing anyway and from what info I can piece together I would want to run my monitors from the I/O of the motherboard and let Ryzen determine what tasks get assigned to which GPU. I can see both the RDNA2 built-in GPU and my 6700XT in the device manager and in the Adrenalin software, but I can only connect the monitors through the dGPU. There are settings in the MSI BIOS regarding Hybrid Graphics. I don't have a screenshot, but I will try to grab one and edit this comment.",
            "I'm in the market for a ~$500 GPU, currently game on a 1080p ultrawide with ambitions to upgrade to a 1440p ultrawide in the next couple years (so I typically use 1440p standard performance as a rough benchmark). I typically buy a card and use it for 5+ years (as you can probably guess from my flair - I bought that card in 2019).\n\nObviously the 7800XT is more than good enough for now, but should I save another $50 and stretch for the 7900 GRE to give myself a little headroom for improvements down the road instead? Or maybe wait 8000 series to come out and see what RDNA4 brings? Being able to get 7800XT performance for the price that a 7700 or 6800 are going for right now would be a sweet deal, if that's what it could bring.",
            "I am building my first real pc. I recently got a really good deal on a 3700x and only have around 200$ to spend on a GPU. I’ve been looking at a used rx 5700xt which I can get for around $160, is there a better pairing that I should target within my budget? Thank you",
            "Will AMD keep releasing AM4 refresh CPUs? They said they will continue to support this platform but what does it mean?",
            "I'm upgrading from an Core i3 550 to an AMD CPU and AM4 motherboard. Can I just transfer my windows files to the new ssd, do I have to do something before changing or do I have to completely reinstall Windows? The last option is not good for me.",
            "I bought a new motherboard (Asus tuf gaming b550m-plus) and processor (Ryzen 7 5700x). Went to one game to see the increase in FPS (the game Valorant), and I see the following picture: at idle the FPS meter is stable at 75 fps, when I start to move/shoot the meter rises to 150, not higher. Also noticed one thing, at idle when I press any key that does not function in the game, the fps counter is stable at 97 fps.\n\nDrivers fully updated.\n\nHelp, kind people.",
            "Ryzen 9 3900 and RX 6950XT  \n\nWould it handle it? My monitor is 2560x1080 200hz 1ms. So far the 3900 has still been a beast and I haven ran into any problems with it so I don't see why it would have a problem but I have never tried a gpu that powerful either.",
            "I want to ask about the APU STAMP Limit of this Ryzen 5 7640HS (Acer Nitro16)\n\nInitially, it was stable at 100W, and during a stress test, it used about 70W. However, after I used RyzenAdj to adjust the APU power limit, it stopped being stable at 100W or the value I needed, gradually decreasing to 35W (45W in NitroSense high-performance mode). Now, even after resetting everything to default (including reset PC), it still isn't stable at 100W.\n\nI search information about this CPU including obvserve from HWinfo it said cTDP is 35-54W which in CPU-Z it said max TDP is 45W also in APU STAMP Limit in HWinfo it said 45W  \nfrom this.. I assume max TDP=APU STAMP Limit ? this kinda make me confuse... -w-\n\nSo, I want to ask those who use the same laptop (or same CPU):  \nIs a power range of 35W-45W (Depend on Nitrosense mode) normal behavior of this CPU ?  \nIf you have any information or knowledge to share, I would greatly appreciate it.",
            "  \nIn a quest of squeezing as much performance I can out of my old rig, I am now trying to adjust the memory timings on my ASUS Vega 56!  \n  \nI saw that AMD Memory Tweak XL was the right tool for this job but since about 2020/2021, MemTweakXL has stopped working with new drivers, since I'd like to stay on current drivers, I am wondering if there is any alternative to tweaking memory timings or perhaps anyone who knows a fix to make MemTweakXL work with current drivers?",
            "I had a 1080ti, upgraded to a sapphire 6700xt and it’s a lot better considering I sold the 1080 for 70% of what I bought the new card for.",
            "If power consumption is a concern, then yes. The 7800X3D consumes a 1/3 of the power of 14900KF and performs about the same, and sometimes it outperforms it depending on the game and the reso/settings. Not to mention is generates way less heat than the 14900KF.\n\nI dont know what bench app you run, but i would suggest running Cinebench R20,R23 or R24 and compare your single and multi thread results with other people on the web. If they are way below the average, then you might have a cooling problem.",
            "yes, top 3",
            "This article might [help you](https://www.techspot.com/review/2846-amd-ryzen-aged-cores/) out. In general, simulation games and strategy games will see the biggest jumps, some other genres not so much.",
            "Would help to understand what you are planning to use the PC for. If it is just gaming, with \"normal\" productivity workloads (ie, anything outside of video editing, blender, AI/ML, etc), there really is no reason to get a 7950x. Unless you absolutely need the extra cores that come with the complexity of a dual-CCD die, it's probably best to stick with a single die 8 core CPU. For gaming, the clear winner is 7800x3D, which can handle \"normal\" productivity workloads just fine and is also basically the fastest gaming chip available today. Another note, that at 1440p most games are GPU bound more than CPU bound, so it actually won't matter a whole lot if you are picking a modern CPU anyway. Plenty of people pair the 5800X3D with the 7900XT with great results.\n\nIf you aren't planning on going 4k, the 7900xtx is plenty overkill. Even a 7900 XT is a bit riduculous if you are planning on only gaming at 1440p. The 7800 XT or 7900 GRE are really in the sweet spot for 1440p gaming.\n\nOne final note, the \"usual suspects\" of MSI/ASUS/Gigabyte aren't terribly highly regarded when it comes to AMD GPUs. They tend to just stick whatever cooling solution they use for Nvidia on their AMD products and call it a day, which can have hit or miss results. Sapphire is the usual top recommended brand for AMD GPUs, with XFX and Powercolor not far behind, depending on the product you want.",
            "Did you try anything to fix the issue like adjustiing/tuning the ram timmings, raising VSoc or Vcore a little bit. Maybe your mobo is overjuicing the CPU/Soc and degrades over time until it starts crashing. Just use screenshot funtion with ZenTimings and post it here. You might not have to buy a new CPU and you could actually wait for Zen 5 to make the jump.",
            "> lga 1151 \n\nUnless you can find a 9900K or 9900KS dirt cheap, i would say it's not worth it. You are better off buying an cheap AM4 mobo and a 5700X than buying an used 1151 CPU.",
            "Check Hardware Unboxed or Gamer's Nexus reviews.",
            "Reinstall with DDU, if it persists, submit a bug report.",
            "Unplug and re-plug your main 24-pin connector and the 4 or 8 pin CPU voltage connector (top back of cpu socket) to make sure they are properly connected.\nIf you built the system yourself, inspect the CPU socket closely and carefully for any damaged/bent pins if you have an AM5 system.  If an AM4 system and no bent pins on CPU (or AM5 if no damaged socket pins) continue to next step.\nAlso, make sure there's no shorts in the case (e.g. stand-offs were used where needed and there is not bare metal hitting the back of the motherboard).\nDo *not* run the processor at high VCORE.\nReplace the power supply.  If this is not it, replace the motherboard.\nIf you're at this step of replacing the motherboard, try running the board/ram/cpu OUTSIDE of the case like on the top of the motherboard box.  You can even install your GPU like this if you let the back of the card overhang the box a bit (metal slot cover otherwise would hit the box).  If it then runs, you have some other issue with installation and not bad hardware.  Also, inspect the rear ports of the motherboard to make sure there are not badly bent or damaged plugs on it, a bent USB port pin or something similar could be throwing the whole board into a frenzy only to go critical when Windows loads a driver for it.\nIf this does not fix it, then replace the processor.\nSince *you say* it's not the PSU, consider starting with the motherboard troubleshooting and running it outside of the case.  To boot a board outside of the case, use a screwdriver or piece of metal to short the PWR pins on the FRONT PANEL CONNECTOR (not the ATX PSU connector!) on the bottom-right of the ATX motherboard.\nIf you have a spare GPU that doesn't require ATX power, or you have an AM5 system with a non-F processor, it may make this easier as you won't need a giant GPU in the mix when running it outside of the case on the motherboard box.  Do not use a conductive/metal surface when running the motherboard outside of the case to test it, otherwise your motherboard (and other components) will go to the big case in the sky, never to work again.",
            ">  MSI B450m Mortar Max motherboard would be able to handle the 5900x\n\nYeap it should handle it just fine. 3200 MT/s shoud be good enough, and i personally  see no point on buying faster ram.",
            "5800x3D.\nA lot of Adobe products really love single-threaded stuff, which both the 5800x3D and it's cache and the more power hungry but more-core 5950x will give it lots of.\nIf you have, and use frequently, a lot of filters that are multi-threaded and will make use of the entire CPU that you're using now, consider the 5950x processor.  While more expensive than the 5800x3D, it has more cores.  However, the X3D chips have a LOT of cache on them, and this can really help things - including games or every-day Windows duties - feel much snappier, since it gets rid of any ram latency penalties.\nFor non-X3D processors; get dual-rank dual-channel memory kits with no less than CL-15 3000mhz / CL-16 3200mhz / CL-18 3600mhz performance ratings and you should be OK.  There is a little bit to be gained by going past these numbers (all above numbers equate to the same!) but it's diminishing returns and no promise it will work with your board/processor.  X3D processors do not much care what memory you give them as they have some of their own, thus negating a majority of ram speed penalty unless you put some poverty-level stuff here.\nDO NOT under-estimate the ability of the 5800x3D vs the 5950x!  That 3D V-cache is really something and can give you 7000-series Ryzen performance on your AM4 system with your other current hardware.\nYou will require a BIOS update for the 5800x3D and *possibly* the 5950x also, but definitely for the X3D chips.\nI wouldn't bother with the 5900x, either go 5800x3D or jump to the 5950x.\nDO stay with your current platform, it's not down for the count yet.",
            "When the PC is OFF but *STUCK* in a wont-turn-on or is in a wont-boot-but-fans-100% state:\nPull the power cord out or hit the switch on the back of the power supply (not the case-front switch you normally turn it on with).\nWait 3~5 minutes and/or try to turn on the PC with no power.\nPlug PC back in or hit switch on back.\nNow turn on PC.\nRun SCANDISK C: /F on admin-level console in Windows to ensure you're getting good write performance on your system SSD and don't lose any files from power outages.  It'll ask to restart.\nRestart and let SCANDISK run.  Always run this after a power failure provided you're not about to have another one while it's running.\nOnce it's done a minute later you can then use your PC.\nWhat you've done (ignoring the scandisk part which is just good maintenance) is clear the 'bad power no boot for you' state of the PC from the power flashes.  Yes, it's annoying, but if your power browns out or you have a momentary complete loss of power or similar, your power supply won't send power to the CPU and other fancy components to help save itself and the system from damage.  It won't send the 'power good' signal to the motherboard.  Sometimes this gets STUCK but it's better than batter-fried components.\nConsider purchasing a battery backup UPS system that's large enough to run your PC.",
            "> 100+ fps in Gta5 with lots of stutter.\n\nGTA 5 engine doesn't like pushing more than 150 FPS and gets upset. Try using the resolution scaler/ high MSAA to keep framerate under 150. About other games try enabling Freesync if your display supports it to \"smooth\" out the displayed frames.",
            "Spikes like this are common on any heat-dense CPU, if you go into your BIOS, you can usually set a fan speed ramp delay.",
            "Yes, though BIOS update likely required.",
            "You could put the pcb in the oven but that will likely only help for maybe a few months so I would suggest getting a new card.",
            "Limiting GPU clock to 1700 seems to make it useable. Would this hint at a symptom?",
            "The Nitro+ if they are all similar price.",
            "From what I can find it's a Piledriver chip of some kind.  \nSo either an Opteron or FX CPU.  \nFound the info over [Here](https://en.wikichip.org/wiki/amd/cpuid) on wikichip.",
            "> I was wondering if it's ok to have the CPU running at 95\n\nYeap. AM5 precision boost algorithm is more aggressive than previous gens and will try to squeaze every bit of performance it can out of your cooling solution up to 95ºC.\n\nIf you wanna optimize for cooler temperatures, i would sugest messing with TDP, PPT, ECD parameters. Take a look at [this](https://www.youtube.com/watch?v=W6aKQ-eBFk0) GN vid.",
            "Ryzen 7000 series run hot, those aren't even bad temperatures let alone potencially dangerous for your CPU's lifespan. I would advice against using Ryzen Master, specially if you dont know how to use it. If you want better temps, you could consider using a balance power profile on Windows, using ECO mode on BIOS(you can try it out on Ryzen Master also) but you will lose some performance(5-10%)",
            "Did you plug your display to the GPU not the mobo? Did you installed your card on the main PCIE x16?",
            "Generally, when space limited, Manufactures tend to take support of older first gen Zen processors and low end AM4 cpu's Bristol Ridge series. Either way, you are perfectly safe since the MSI Max series boards come with a bigger BIOS chip so MSI doesnt need to take away any \"old\" CPU to make room for new ones.",
            "Thats the rated speed AMD guarantees every Cpu can run everything above that is basically Silicon Lottery however for AM5 6000 is the go to because it the most stable on most systems if you dont run 4 Sticks. For the 4x2R I found this: \n\n2x1r is 2 sticks of ram each are single rank\n\n2x2r is 2 sticks of ram each are dual rank\n\n4x1r is 4 stick of ram each are single rank\n\n4x2r is 4 sticks of ram each are dual rank",
            "AMD recommends a 800 Watt unit so you will be fine.",
            "The recommended wattages assume you have worst-case scenario for power draw on other components, while your CPU is extremely low-power.",
            "The other reply is bizarre, parts dont get less efficient over time by any measurable amount.\n\nTechnically 600W with those parts is fine, but there is more to a PSU that it's peak wattage, and that unit is absolute garbage. A modern card with higher draw is unlikely to run nearly as stably or safely on it as it would on a modern, good-quality unit, and low-quality units often fail to supply their rated wattage or cope with spikes in wattage well.",
            "I would 60% of the B550 boards will work with both CPU. You just need to search for a mobo with a VGA display output(HDMI or Display Port) and check it's mobo BIOS section for an updated  BIOS Agesa 1.2.0.B(5700X3D support)",
            "I dont think much of anything does, almost all boards dropped Zen1/Zen+ support for later gens, often APUs going first.\n\nUnless it is an emergency and you need a new system right now, why not just wait and get the 5700X3D and not go through the hassle of trying to de-update a BIOS you cant boot into, spend the extra money, or whatever.",
            "What GPU do you have?",
            "The is no single best temperature, cause every CPU silicon behaves differently. All Ryzen from Zen 2 you want to keep them as cool as possible since the cooler the CPU is, the larger and longer the Precision Boost algorithm will boost the CPU clocks.",
            "Bad cooler mount perphaps? What's your thermal paste application method ?",
            "No. The Stealth does a poor job with the CPU that are bundled with and they are 65w TDP rated CPU, not 105w like your 5900X. The only way it could sort of \"work\" if you make the 5900X run at 65w eco mode and even then it's going to run hot and probably thorttle on anything that uses 8 cores or more.",
            "No its not.",
            "Depends on what software you intend to use, if you need CUDA or other proprietary Nvidia software support, you need an Nvidia GPU.\n\nMost likely, you dont need a discrete GPU at all for simple recording.",
            "Asus AM5 boards have terrible memory stability/compatibility. Did you recently update the board or change any configuration, and does it continue to have boot failures if you lower the RAM to stock speed?",
            "RX 7900 GRE",
            "I have not observed this issue in the lab. I'll see if I have that motherboard on hand, and I'll ping my Asrock contact so he is aware.",
            "5200 JEDEC is the fastest non-OC / automatic memory config. For example, if you installed a JEDEC 5600 kit, it would downclock to 5200.  When you install your 6800 kit, it will boot up at 5200 or 4800, depending on which DRAM is being used on the modules.\n\nRunning faster memory will require enabling it using Ryzen Master, or through the BIOS menus. Most Raphael CPUs can run 6800-7200 when using 2 modules on a suitable motherboard, but this configuration will require 1:2 mode for UCLK:MCLK, which will incur a memory latency penalty of around 3ns.\n\nMost CPUs top out at 6000-6400 in 1:1 mode, which is generally preferred for best gaming performance when using a dGPU. I have some samples that are 1:1 stable at 6600, but those are fairly rare.  I've never seen 6800 1:1 stable on Raphael.\n\n  \nYou can still use your 6800 kit at any of these other speeds but this will require a bit of manual tuning. Maybe you'll be lucky and get a CPU that can run 1:1 at 6400, but 6000 is the \"sweet spot\" for a reason (because all the samples can run it and effective latency is the same anyway).  \n\n  \nTake care",
            "If its gaming only do the 7800, 7950 still laggs behind but if you do editing/photoshop or other production work then grab the 7950 though if your gpu is decent youll be fine anyways. Also if you are lucky, after you set it up, set a -30 core offset and set the max temp to 85 and the performance will actually rise and the temps will drop a ton. If it crashes or fails to boot just keep raising the offset (closer to 0 so go like -30, -28, -26 and so on). Mine currently stays at like 30-40c during lower end games and like 50c for higher end games with an arctic liquid freezer 3 420mm aio but you really just need a cheap air cooler for it",
            "The 5800X3D is almost a 2 gen jump due to the huge cache pool, especially for gaming. The 7800X3D is faster no doubt, but the 5800X3D is miles ahead of the 3700X due to also being a single CCD CPU(the 3700X is dual CCD).",
            "The 2700X is AM4 only. It wont work with an AM5 board.",
            "Any B650/X670 mobo that just has the IO you need should be fine as long as it's not the cheapest one with shit VRMs. And maybe not asus as they're not that great this gen, though if you're not pushing the hardware it doesn't matter as much\n\nXMP works fine but if you have a higher frequency kit you'll want to stick to DDR5 6000, 6400 at max if the CPU manages it, beyond that you'd have to mess with it to get it stable. Also avoid 4 sticks if you can\n\nCore parking is supposedly better nowadays though I still hear about people using process lasso so not sure how much better.\n\nThe temps will probably around 50 C at idleish and around/touching max temps at higher load. Not sure if it boosts balls to the wall on 2 ccd cpus like it does on 1 ccd where it can push all the pwoer to one ccd",
            "You can disable your onboard gpu from bios completely.  \nIf you want to disable it from windows; In Windows, right-click the Start button, select \"Device Manager,\" expand the \"Display adapters\" category, right-click on the integrated graphics, and choose \"Disable device.\"",
            "Use DDU to remove the Drivers for your AMD graphics and then do a reinstall.",
            "8000 is likely to top out at about 7900GRE/7900XT performance with better ray-tracing than 7000 series. As always the advice should be, if you need it now then go with 7800xt or 7900gre (for $50 I would seriously consider the GRE), and if you don't need it now then wait for 8000, but keep in mind it will most likely be launching next year.",
            "Yes, they are lauching in July \"new\" CPUs. The 5800XT and the 5900XT(16 cores instead of 12)",
            "Okay, thank you so much! This is very helpful!",
            "that suggests vram is dying, it will work at 1700 temporarily but as you use it more it will start atrifacting even at this memclock, I would start saving up for a replacement. \n\n\nDo not cook the card in the oven as other user suggested, this and that are 2 solutions for 2 different issues, cooking the card might actually break it totally.",
            "Great, thanks for helping!!!",
            "Sorry, it's actually the GPU clock, the vram setting was fine. I just can't undervolt at all and the clock is 1700 instead of the default 2100. The vram I can increase from 2000 to 2100. \nBut yeah, I think it's likely fried. I'll get a new PSU on pay day and save for an upgrade. Thanks for the reply!"
        ]
    },
    "AMD Ryzen AI 9 365 Zen5 APU tested ahead of launch: IPC uplift measured - VideoCardz.com": {
        "title": "AMD Ryzen AI 9 365 Zen5 APU tested ahead of launch: IPC uplift measured - VideoCardz.com",
        "score": 153,
        "url": "https://videocardz.com/newz/amd-ryzen-ai-9-365-zen5-apu-tested-ahead-of-launch-ipc-uplift-measured",
        "content": "",
        "num_comments": 70,
        "comments": [
            "They need to chill with those names lol",
            "Mixed feelings.\n\nThere are regressions?  \nAlso, seeing people commenting that maybe, contrary to Intel that is trying to get rid of SMT, AMD actually sacrificed 1T for gains in nT. Makes me think if at some point those \"rumors\" about SMT4 where true.\n\n  \nbtw, wish to see AMD doing a portable SOC chip with only Compact cores, because it would be smaller and cheaper, just saying.",
            "Please AMD, it's not too late for another name change.",
            "Ryzen A.I 365.\n\n\nReally?",
            "![gif](giphy|JqI6SLIxAvaQXhp2JO)",
            "AMD has to throw \"AI\" branding on to these chips if they want Microsoft to promote them. Intel and even Qualcomm all have AI branding on all their mobile chips. All devices that you can't buy without without Windows pre-installed. Microsoft is going hard on AI branding to convince people to buy new computers and manufacturers have play ball.",
            "The source article is very interesting, suggesting that the mobile version is tuned on the instruction level to be efficient. Really making some instructions slower to manage heat.\n\nThat also suggests that AMD could change that for the desktop version, if they are not afraid of the heat.\nOr they use it as an extra heat margin for the X3D version.",
            "Tech company Marketing dept these days: Put AI in the name! CEO: Wow you so smart here’s a raise and a pat on the back",
            "Ryzen Z1 and Z1 Extreme are good names. They should follow that for their notebook lineup too",
            "You put the word AI on your brand. Does that mean there will be non-AI chips in the future?",
            "So are you gonna be able to use AI (like Stable Diffusion) on these cards?",
            "Ryzen AI year",
            "**Ryzen 9 - 365** *with Ryzen A.I* would be a *better* name.",
            "AMD needs to stop copying the intel naming scheme. They are copying something that’s not very good and making it worse.",
            "To the windowwwww\n\nTo the walllll",
            "What the F\\*\\*\\* is the Ryzen AI 9 365 Zen5 ???? Is it better than 7700x or not",
            "I refuse to buy anything with the term \"AI\" in the name. It's so cringe.",
            "It seems in line with what I expected. But what matters most is efficiency at low TDP, I wanted to see how much of that performance would be maintained below 35w. (I suspect the minimum TDP is 35w?)\n\n\nI hope the strange naming scheme doesn't invade other product families like GPUs. I don't want to look for the RX 8800 AIX3D-Plus to use with my Ryzen 9800X AI.4D",
            "Ryzen is getting irritatingly formulaic. We get the most predictable upticks in IPC I've ever seen, there's no doubt they're internally limiting themselves now. Zen+ to Zen2 was the last time we got an unexpected growth, and only because Zen1 to Zen+ was so dismal.",
            "These bastards. They said 10c/20t in the presentation, and sure, that’s *technically* true, but with only four full-fat Zen 5 cores this thing probably performs more like an 8c/16t chip, and I’m far from convinced four big cores is enough for gaming.",
            "that sounds like a new terminator model name lmao",
            "Is Ryzen AI 9 365 the best CPU for running Microsoft Office 365?",
            "they straight up just copied intel's lazy rebranding. why would they even do this? who would be confused into buying ryzen because the numbers look like intel numbers?",
            "As long as their fans don't mind that half of current generation of GPUs are \"7900\" with random meaningless \"cool\" letters after them, they have no reason to stop.",
            "Is SMT4 the implementation where you get 4 threads from each core instead of 2?",
            "*The monkey paw curls*\n\n\nRyzen AI 9H 365XT AI",
            "AMD and Intel are operating with the 'I'm altering the nomenclature, pray I don't alter it any further' mentality.",
            "It's just buzzwords at the end of the day.\n\nIf everyone was convinced that anal was the future and it was going to make them assloads of money, they would've called it \"Ryzen Assfuck 24/7/365\" instead.",
            "Well yeah otherwise it would be the Ryzen AI 9 HX 370",
            "Ryzen AI \"9\" 365 to be exact",
            "It’s a lovely name",
            "AI is a big scam right now. The only thing microbugsoft wants is to remove part of servers loads to consumers pc. So when they make  \"ai\" friendly cortana or copilot or wherever check your npu cores what they are doing.",
            "And they actually have \"AI\" on them. But Lisa didn't seemed very excited when talking about this, almost complaining that the NPU takes a lot a space that could be used for other things.",
            "This is more of a normal scheme... one that most sensible people might appreciate. Apple made a good move here (personally their choice of the letter M gives it a cheery \"military-grade\" disposition) and it's a good idea for AMD to copycat it. Z is a solid letter. Even better than X...",
            "Yes : Fire Range.",
            "Which cards? This is an Apu.",
            "Probably a lot better for LLMs (think Chat GPT) hosted on-device. You can already run 7B and 8B models on a Ryzen 7700x with around 10-15 tok/s before any dedicated AI processing, and these processors are supposedly are 79% faster than the previous gen with AI. At least per AMD marketing, so take that with a grain of salt. If performance doubles, usable on device models will become pretty much good enough to use without a GPU.",
            "more like copilot",
            "Probably not well",
            "run? yes. Run as fast as on a discrete gpu, naaah. But amd's npus are among the most powerful in the market",
            "Ryzen 69 - 420 would work as well",
            "That's what I said about rgb but now you can't find anything without it.\n\nAI is gonna get you stan.\n\nGonna get you",
            "You make it sound like your issue is with the growth being predictable rather than the growth itself 🙃",
            "The c cores are quite good, yes clock a little lower but you get nice power consumption savings in return. Quite a bit better than Intel e cores.",
            "Wym it performs like a 8c/16t chip, what you just said was stupid. And it is 10 core",
            "haha!\n\nwe both know it is!",
            "People whinged endlessly about the old naming scheme",
            "Yes. We've had rumors of AMD implementing it for many years, but that moment has yet to pass.",
            "Don't give them ideas.",
            "Ryzen 5 1600AF says hi",
            "Having the option to depend less on cloud computing and keeping things local is a plus. Now the way they actually implement it and force it on people is appalling though.",
            "> The only thing microbugsoft wants is to remove part of servers loads to consumers pc\n\nBro...how is that a bad thing? I don't want to depend on a server for my fucking personal computer's functionality, lol.\n\nRegardless, they way Windows operates and the way this AI operates are both world's different than what you've described.",
            "I'm running Mistral 7B Instruct on an i7-7600U, which is a 14nm, 15W dual-core from 2017. I'm getting around 2.2 to 2.5 tokens per second and I don't get how people complain about speed on their modern devices.\n\nTried it on my desktop that has a 3700X and it felt lightning fast. Looking forward getting a dedicated accelerator someday and seeing how the models develop and hopefully get faster.\n\nAnyone interested in trying a local LLM should check out [Mozilla's llamafile](https://github.com/Mozilla-Ocho/llamafile). It's a way of packaging a LLM into a single executable that runs locally. Just download one file and you're off. Though if you're using Windows, you won't be able to run models larger than 4GB because, well, you're using Windows and it still doesn't support executables larger than 4 gigs.",
            "Some of the faster models might run okay. You can [already run some on a CPU](https://github.com/rupeshs/fastsdcpu), especially if you settle for low resolutions.\n\nAlso, VRAM is a pretty big limitation when running SD on dGPUs, but since APUs utilize system RAM, the capacity limitation at least should be lifted (assuming vendors don't do something moronic like soldering in 8 gigs of RAM). Memory speed might still be a bottleneck though.",
            "You mean APU?",
            "Noctua doesn't have RGB, and you can buy that.",
            "You say that, but with my next batch of PC upgrades I am finally going to be 100% RGB-free, after suffering for years with RGB RAM, RGB GPU and (currently still) RGB motherboard. Feels good man. Nature is healing",
            "Any proof or videos on how much better they are?",
            "So just go all out with the cringe?",
            "The gains are very low. Going from 0 to 2 yields around a 30% increase in performance, going to 4 is like an extra 10% or so, but the implementation is hell.",
            "yeah sounds not bad, but it could be like with a hidden checkbox which allows your pc  to share windows updates to other people like fkn torrent server. So now possible hidden compute, not only hidden file share",
            "> Bro...how is that a bad thing? I don't want to depend on a server for my fucking personal computer's functionality, lol.\n\nWhen your personal computer is fucking you, you'd hope it wasn't being done using your own compute resources.",
            "nope, the npu is an addon inside the apu focused in crunching AI related stuff.",
            "P14 argb is better so I bought that",
            "What we know is that, unlike Intel's e-cores (pre Arrow Lake at least), Zen 5 and Zen 5c share the same instruction set and can there is no \"worse\" core. Cache is also identical but operating frequency is lower. If Zen 4 and Zen 4c are anything to go by, IPC will also be identical.\n\nMy speculation: The 5c cores use density optimized libraries compared to frequency optimized ones for vanilla 5. This would easily explain the differences in core speed and die area used and would allow the 5c core to be more efficient in low-frequency operations which they are intended for (background tasks, etc).",
            "And paved with security issues to worry about",
            "Well, historically I only fuck myself...so that tracks.",
            "Zen is notorious for being very much limited by cache. So a core with less cache will perform worse per clock even if the actual core is similar",
            "I honestly would not mind a 32 Zen5c core for people who needs lots and lots of cores, for stuff like video encoding or Virtualization."
        ]
    },
    "AMD Radeon RX 7900 GRE now available for $519": {
        "title": "AMD Radeon RX 7900 GRE now available for $519",
        "score": 260,
        "url": "https://videocardz.com/newz/amd-radeon-rx-7900-gre-now-available-for-519",
        "content": "",
        "num_comments": 105,
        "comments": [
            "I mean, I could've potentially saved 31 whole dollars, but I'm still happy with my purchase in May.",
            "I will buy it when it drops under 500€ so my 6600xt can go to my media PC",
            "Fuck. I just bought this but asus for $150 dollars more last Sunday from my local computer store😡",
            "That 4070 super did a lot of damage on the AMD price scheme lol. Good for consumers.",
            "The best option in that price bracket. Great undervolt/overclocker too, reasonable amount of VRAM and even performant at RT gimmick, for those who care about it.",
            "Y’all think DLSS and Ray Tracing are worth going NVID? 4070 super prices dropping here in Canada",
            "I've been looking for a good AMD card so i can leave the Nvidia ecosystem. I think if it hits $500, I'd definitely buy it.",
            "Why did we need this? How's this situated in between 7900 and 7900xt or what",
            "How much better is this over the 7800xt?",
            "I’m wondering if now’s a good time to upgrade my GPU to a 7900 GRE. Or wait for the next generation? Is the AsRock version mentioned here the one that I should be getting if I do decide to upgrade? I was looking on Amazon and many of the other models are like another 30-40 dollars.\n\nMy PC: Ryzen 9 5900X, 32 GBs of RAM @ 3600 MHz, and RTX 2080 Founder’s Edition.\n\nPower Supply: EVGA 700 B1, 80+ BRONZE 700W (5 years old at this point)\n\nMonitor: 2560 X 1440 P at 144 Hz\n\nCPU Cooler: Dark Rock Pro 4 250W TDP\n\nCase: Antec Performance 1 FT\n\nStorage: WD SN850X 4 TB\n\nI’m not in a big hurry as my pc can run most of my games very well at 1440 P at around 100 fps in a couple years old single player and multiplayer games. \n\nIt struggles on newer games like Ratchet and Clank Rift Apart without DLSS only getting 50-60 fps. Definitely still a good experience, but it’d nice if I could get some more frames. I don’t have a problem waiting another 8 or so months.",
            "It better come with some Antizin.",
            "Are there models of this for a sff?",
            "Best I can do is $50",
            "PC hardware pricing is a joke in my country, the cheapest 7900 GRE Nitro+ is $720 USD, fml",
            "Oh, in real world 7700xt is finally available for around 500€.",
            "God I wish we could get prices like this in CA, here the 7900gre costs 700-800 before tax",
            "Would be interesting at 400$",
            "But why isn't that 4080S that I want to buy getting cheaper though?! We all know that AMD only exists to make Nvidia card cheaper. Only poor people buy AMD gpus.",
            "RT does not work properly in games and does not make a visual difference except for 3 or 4 games. RT is not the deciding factor for a gpu purchase today. The 7900 is the undisputed leader in this price range.",
            "Dude I paid 670$ for a nitro+ version don’t worry. Tbf GPU’s are overpriced where I’m at lol. Pulse edition was around 585$ and nitro+ was 670$",
            "that's like... one buck per day? the time you've been able to use the gpu is worth more than that IMO.",
            "Well you paid the ASUS tax, that thing is still probably $100 over MSRP.",
            "Goes for the brand notorious for being expensive and overpiced, gets pissed because it was expensive.",
            "What's their return policy?",
            "4070 super is 200 euros more expensive then the GRE for no raster performance improvement. No tx.",
            "4070 is not only more expensive but its less powerful and NVIDEA software SUUCKKKKKKSSSSSS ASS\n\nMy sapphire nitro+ 7900GRE out preforms my ROG STRIX 4070 super Ti by far for a fraction of the price. I can run everything on max settings while maintaining 120+ frames on 4K except for some mods then its 80+ FPS on 4K.\n\nIf the super Ti is being out preformed then the 4070 super would be much worse.",
            "So you're saying I should upgrade from my RX 580 4GB?",
            "Can confirm its a beefy card. Runs cybperunk at max rt without path tracing and games runs smooth idk what the fps is tho but its smooth on 1440p. Once you add path tracing.... good luck unless you downscale to like 1080p and 900p then upscale it,  itll be somewhat playable but bad visuals",
            "Yup, it's a great card for that price.",
            "> at RT gimmick\n\nLol.",
            "Around the same performance of the 4070 at rt and costs around the same. Also has performance onpar with the 4070 super in raster. The cost and performance is why i bought one.",
            "I’m waiting for the 4080super to drop a little more and I’ll go that route :)",
            "12GB of VRAM is a huge turnoff.",
            "DLSS is a much bigger draw for me personally than Ray Tracing but that's more of longevity thing or if you need high frame rates and can't do it on raw power alone.\n\nThat said I personally would rather have the better raw rasterization power now and more VRAM for the future.",
            "Yes. I can't imagine my Witcher 3 or cyberpunk experience without dlss 3 or rtx",
            "Yes",
            "FSR and AFMF, while not currently as competent as DLSS, are only going to get better over time. No real point in picking Nvidia for DLSS, because updates improve software and realistically AMD gives you better hardware so if/when their software reaches parity (or near enough that it doesn’t matter) you’ll end up with a better experience.\n\nRT is still a niche feature, and the 7900 GRE isn’t unusable with it enabled.",
            "Is 20 bucks that much of a deal breaker? Lmao",
            "At this point just wait for the next gen.",
            "It's slotted in-between the 7800xt and 7900xt. The 7900 golden rabbit edition was originally a china only year of the dragon special release and got launched worldwide later on",
            "Wat",
            "5-10% depending on the game. 4k pretty much no difference. A good model + a manual oc and both are crazy value for money.",
            "10-15% stock, up to 20-25% when overclocked and in RT workloads",
            "that 2080 already struggling 😭🙏",
            "I don’t think so tbh. That’s the draw back of higher end AMD cards, they don’t come in SFF variants and/or are just extremely long so it’s hard to find a case that fits any of them.",
            "Assumes that every single brand of the card is available at one point for purchase\n\nAlso, the regular msrp for the card is already way more expensive than what this deal is. Keyword deal, it isn't regularly priced like that.",
            "Not gonna return it. I think the better cooler engineering is worth the extra money and will make the card last longer for me because I plan on overclocking for the next couple generations.",
            "I suggest you check your maths \n\nhttps://geizhals.de/?fs=7900+gre&hloc=at&hloc=de\n\nhttps://geizhals.de/?fs=4070+super&hloc=at&hloc=de",
            "Nvidia software sucks... Lol. \n\nIt took AMD two years to fix their drivers.",
            "Yeah. I'd sell it and get a RX 580 8GB. That beast outperforms a 1060.",
            "If you want to play newer games, totally.",
            "Depends on your budget. \n\nAmazing 6000 series are still amazing and available.",
            "> without path tracing \n\nSo with normal ray tracing on or without any kind of RT?",
            "Definitely not a gimmick. Nobody would say this of amd was on par with their hardware rt performance. \n\nRt features does matter to many looking for a card to last them years into the future. Calling it a gimmick is being facetious",
            "Sorry, about the amazing RT technology, that is yet to come and deliver on any of its promises. \n\nAssuming \"it would tank FPS\" was not among them, cough.\n\nThings like \"unseen effects\" or \"ease of development\", or there beign \"enough hardwahr RT\" 3rd gen into \"hardwahr RT\" so that, cough, that FPS tanking feature is gone.",
            "Mfs rather wait a year to save 20",
            "Yeah. It’s a shame it only has 8 GBs of VRAM. It’s still running most of the games I have/play well though so it’s hard to complain. \n\nWhat would you recommend that I do in this situation?",
            "Yeah I agree with you, I can’t seem to ever see a shirt version of the hugger end cards",
            "I didn't assume that you have access to all the customs, Asus is just that bad price-wise.\n\nAlso, if you paid it 150$ more no, it's not cheaper than msrp, the msrp is 550$",
            "> Assumes that every single brand of the card is available at one point for purchase\n\nHow many people in North America (where OP likely is) do not have access to online delivery?",
            "True lmao but AMD so far is on the right track😅",
            "I'm still running my 8GB 580 OC Armor Mk2, great little card. ",
            "I snagged a used 6800 for $300 and it's going strong",
            "Normal ray tracing with psych settings no path tracing.",
            "I have an RTX card and tried out RT on every game I owned that supported it. It's DEFINITELY a gimmick.",
            "It's called preference, I never used RT and been on both sides very recently team green and red.",
            "> Definitely not a gimmick\n\nIt isn't as great as other say.\n\n> Nobody would say this of amd was on par with their hardware rt performance. \n\nBut i agree here.",
            "I'm a fan of RT, but at any version of RT that runs well on AMD, aka not path traced, RT looks mostly the same as raster (or worse...mech warrior). The quality to fps ratio isn't there.\n\nAnd when RT is transformative, in path traced titles, only nvidia can keep up at all.",
            "Not a single person I know ever uses RT. Ever.",
            "Im fine with it beeing shit a few generations, it will most likely solve itself eventually. Kinda like tesselation back in the days.  \nIm not a big fan of Nvidia, but i like it when they force the market to evolve.  \nThats much better than intel 14nm+++++",
            ">  \"ease of development\"\n\nOh, this is VERY MUCH present. The problem has been industry stagnation around old-gen or low-end parts that can't run it very well.\n\nIf moore's law had kept pace, we'd all have 4090 class performance for under 399 today, and RT would be 'the default render path'\n\nBut in the engines im working on that are RT-only due for next console gen, we saved years and years of man-hours. Easily a million dollars, that was diverted to other expenses like better assets (sorry about your vram, circa 2028).",
            "DLSS 4.0, only available to 25% higher priced RTX50XX cards, will definitely fix that :p",
            "I have no idea what you're trying to say, and I'm too busy marveling at Cyberpunk and Alan Wake II to care.",
            "/r/buildapcsales energy",
            "Overclock everything in your system",
            "Supposedly the 8000 series Radeon GPUs will arrive near the end of this year, with only models in the midrange covered. I recall somewhere saying 4080 performance for around $500, but that was a while ago.\n\nIf you can wait, might make sense to see what the new GPU models look like. But you could always make the argument to keep waiting for X next gen GPU like the 5000 series Nvidia cards.",
            "Yeah, it’s unfortunately forcing me to stay with nvidia because they have higher-end SFF cards or just dual-slot cards that aren’t insanely long.",
            "I ended up with a 7800xt sapphire pulse in my form t1 build, as it was one of the only cards that really fits well in most sff builds. I was tempted by the 4070 for the power efficiency with the idea heat would be the problem, but the Pulse hasn't had any temp problems.",
            "Not sure why people are comparing AMD's highest end cards to Nvidia's mid range cards. It's not just about price.",
            "8gb 480 with one 6pin is the holy grail 😊",
            "I use RT whenever available, I don't need a nvidia card, and it looks great.",
            "I use RT on a daily basis. So now you know one person.",
            "What kind of Vram should we be expecting to need minimum by 2028 by your estimation?",
            "What exact issue is there to fix in regards to RT performance on Nvidia cards that can utilize DLSS?",
            "NVIDIA hasn't gated DLSS versioning to specific hardware in the past (in the \"turing cannot run DLSS 3.0\" sense), there is little reason to think they'll do so in the future given they just sold Nintendo on Ampere era hardware that they will need to support anyway.\n\nlike that meme is literally the diametric opposite of reality, NVIDIA differentiates on their software and broader/longer support than AMD or other competitors.  NVIDIA basically hasn't segmented CUDA at all, official support for newer features will need newer hardware (potentially even when a less-ideal version can be implemented without it) but software is the moat, and you don't benefit from putting another moat around the ability for customers to access the thing that gives you a moat.\n\nIn graphics drivers, NVIDIA is still supporting Maxwell and AMD has already deprecated everything pre-RDNA, including products they're literally still selling (5700G is being sold today despite being on security-only legacy status, which they did less than 2 years after launching it).  They did a shit job on supporting Terascale too, that was deprecated ages before the competing NVIDIA architectures.\n\nmeanwhile turing is moving closer and closer to a 50% uplift at native-TAA equivalent visual quality lol, it's already well above 30% uplift, that's some sweet fine wine right there.",
            "Hopefully with reduced artifact generation.",
            ">I have no idea\n\nThat's OK.",
            "Likewise, but on a 7800xt oc'd. I don't understand the 4000 series hype, especially their midranges. I'm waiting on fsr3.1 upscaler. I'm getting pretty much similar RT performance to the 4070, even beating it at higher resolution because I don't run out of vram when FG gets enabled. Every RT game over 100 FPS with fsr3 frame generation Mod. Apart from the forest area in chapter 2  Alan wake I can enable path tracing. I just use 1200p quality mode internal resolution, then enable RSR in adrenaline which outputs it to my 4k display. I can get a very good experience if I choose to. I still prefer RT off.",
            "Lets just say I've been in the room with Sony, and numbers like \"32gb and \"48gb\" were bandied about. (which should be normal/standard in 2028 and beyond given 32gb is the current PC meta and cheap now).\n\nIt won't be less than 24gb. It probably won't be 64gb+\n\n(all numbers being unified memory)",
            "They were joking about DLSS3's frame gen only working on Ada Lovelace and not on Turing and Ampere.",
            "I'm going to level with you:\n\nFirst, AMD doesn't view RT as a gimmick like you. Why are they increasing RT performance gen over gen? Why are they working on FSR 3/3.1 with the express goal of generating frames in those workloads? Your views are misaligned with theirs. \n\nSecond, you *chose* to get an AMD card. AMD is significantly behind Nvidia on this front. Its a con for their current cards. You have no basis to call RT/PT a gimmick because you can't genuinely experience games with those features. \n\nThere's zero reason to spout nonsense simply to justify the lack of said features for the card you purchased. You don't need to be hyperbolic because of this. It's ignorant.",
            "I prefer native resolution with RT, I'm not a fan of all the *ss*. If I can't hit 60+fps I just turn off RT shadows and keep the rest of the RT options on. No path tracing, though.",
            "Interesting. Is there any reason why they've decided to start doing massive jumps in their development after years of not so impressive gains?\n\nHas the tech just matured for massive deployment or are they afraid of the PC market moving to ahead?",
            "7800xt gigabyte oc model, manual overclocked, cyberpunk ultra RT 1440p quality mode +fsr3 fg, 108 FPS avg. psycho RT 104 AVG. Path tracing is the only issue at 1440p, so I have to go to 1200p quality mode around 80 AVG. \nAlan wake 2, the forest area is the only issue with path tracing, just like it is with the Nvidia GPUs like the 4070. Everywhere else zero issues with enabling Path tracing.\nWitcher 3, 1440p maxed settings over 100 FPS AVG. \nI still say with a good enough experience with RT, it is a gimmick and definitely not ready as yet. \nOf course AMD will improve on all things, why would they not?, you make no sense whatsoever. \nMore than 90% of pc gamers use a non 4000 series GPU, so that means the majority of gamers think RT is a gimmick. \nAnd why do Nvidia fanboys only run to Nvidia sponsored titles when trying to flex about Ray tracing?.. cyberpunk is literally altered for Nvidia hardware. \nI think the 7000 series does a fairly good job with RT, considering it's using it's Raw power without dedicated hardware.",
            "Don't bother using facts and logic to argue with AMD fanboys. Like you said yourself, they will say absolutely anything to justify buying a much inferior GPU, despite being only slightly cheaper than Nvidia's.   \n  \nI would totally understand being paid to defend multibillion companies, but doing it for free is just depressing.",
            ">Why are they increasing RT performance gen over gen?\n\nAs with tesselation, The Filthy Green has convinced plebs it is an absolutely must have superamazing technology that will work ONE DAY so they gotta react.\n\nThe funny part is the reaction itself.\n\nAs The Filthy Green, AMD just, cough, sponsors games.\n\nI mean, that \"Control\" game that without RT gimmick locks like it was made in 2005, ain't it cool that it even used A DIFFERENT CODEPATH for different GPUs, cough.\n\n>AMD is significantly behind Nvidia on this front\n\nWhat year is it, FFS... The greenboi are terrible...",
            "Where is the facts and logic?...A new generation is literally about to launch, and more than 90% of pc gamers still don't use a 4000 series GPU. So the facts is that majority of gamers couldn't care less about RT. \nYou are also literally defending a multi trillion company for FREE in your comment. Make it make sense.",
            "> The Filthy Green\n\nYeah I'm just gonna block this nonsense.",
            "Wow this is honestly a really delusional comment. I understand being a fan of something but this is extreme lol",
            "That is a leap of logic. There has to be reason for Nvidia market domination and non rtx performance is not normally in Nvidia’s favor for the price",
            "[removed]",
            "Nvidias market dominance is primarily down to their upscaling technology. Great marketing also plays a part. It's definitely not down to the ray tracing capabilities, because 90% or more of their consumers are using a 3000 series and older GPU. \nOnly 2 games with \"heavy\" RT is in steam top 100 most played games.  Even the games with weak RT like elden ring and The Finals, gamers are turning the RT off, because it makes zero difference to the experience.",
            "Hey OP — Your post has been removed for not being in compliance with Rule 8. \n\nBe civil and follow Reddit's sitewide rules, this means no insults, personal attacks, slurs, brigading or any other rude or condescending behaviour towards other users.\n\nPlease read the [rules](https://www.reddit.com/r/Amd/about/rules/) or message the mods for any further clarification."
        ]
    },
    "Comparison Spreadsheet for \"X570/X470/X370/B550/B450/B350/A320\" Motherboards": {
        "title": "Comparison Spreadsheet for \"X570/X470/X370/B550/B450/B350/A320\" Motherboards",
        "score": 25,
        "url": "https://www.reddit.com/r/Amd/comments/1dlcyxe/comparison_spreadsheet_for/",
        "content": "Whatever happened to this awesome comparison spreadsheet?\n\nReference:\n\n* https://www.reddit.com/r/Amd/comments/j632l7/x570x470x370b550b450b350a320_motherboards/\n\n* https://docs.google.com/spreadsheets/d/1wmsTYK9Z3-jUX5LGRoFnsZYZiW1pfiDZnKCjaXyzd1o/edit#gid=2112472504\n\nDoesn't look like the spreadsheet exists anymore.\n\nAnyone have a mirror link?",
        "num_comments": 6,
        "comments": [
            "Here's the latest successful archive of this website:\n\nhttps://web.archive.org/web/20220816140630/https://docs.google.com/spreadsheets/d/1wmsTYK9Z3-jUX5LGRoFnsZYZiW1pfiDZnKCjaXyzd1o/edit#gid=2112472504\n\nHard to navigate like that, but it's \"still there\" at least in the archive.\n\nTips: Tap escape many times when things pop up in German and block your view. If a green bar on top pops up, click \"Shleiben\" ( or something like this, I don't know German ).",
            "[https://docs.google.com/spreadsheets/d/1NQHkDEcgDPm34Mns3C93K6SJoBnua-x9O-y\\_6hv8sPs/edit?gid=2064683589#gid=2064683589](https://docs.google.com/spreadsheets/d/1NQHkDEcgDPm34Mns3C93K6SJoBnua-x9O-y_6hv8sPs/edit?gid=2064683589#gid=2064683589)\n\n  \n[https://docs.google.com/spreadsheets/d/1-ZwVuH\\_tinzgpsOdfMvYeCLI5ZbIpnq5fyiWD4NCkkU/htmlview#](https://docs.google.com/spreadsheets/d/1-ZwVuH_tinzgpsOdfMvYeCLI5ZbIpnq5fyiWD4NCkkU/htmlview#)",
            "https://docs.google.com/spreadsheets/d/1-cw7A2MDHPvA-oB3OKXivdUo9BbTcsss1Rzy3J4hRyA/edit\n\nfound this copy earlier this year, says last updated in november 2020, so most all the info you might need should be on that.\n\nenjoy.",
            "[try anandtech forums about a620a and b550a motherboards](https://forums.anandtech.com/threads/new-a620a-chipset-by-amd.2616583/)",
            "Hey OP — /r/AMD is in manual approval mode, this means **all submissions are automatically removed and must first be approved before they are visible**, this is done to prevent spam, scams, excessive self-promotion and other rule-breaking posts.\n\nYour post will be approved, provided it follows the subreddit [rules](https://www.reddit.com/r/Amd/about/rules/).\n\n**Posts regarding purchase advice, PC build questions or technical support will not be approved.** If you are looking for purchasing advice, have a PC build question or technical support problem, please visit the [PC Build Questions, Purchase Advice and Technical Support Megathread](https://www.reddit.com/r/Amd/comments/1bsp3cp/pc_build_questions_purchase_advice_and_technical/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Amd) if you have any questions or concerns.*",
            "Schließen / schliessen = closing"
        ]
    },
    "Gigabyte launches AI TOP GPUs — AMD reference-like designs in fancy boxes": {
        "title": "Gigabyte launches AI TOP GPUs — AMD reference-like designs in fancy boxes",
        "score": 33,
        "url": "https://www.tomshardware.com/pc-components/gpus/gigabyte-launches-ai-top-gpus-amd-reference-like-designs-in-fancy-boxes",
        "content": "",
        "num_comments": 6,
        "comments": [
            "Ah yes. Slap the word AI on top of anything to charge a premium.",
            "Hey OP — /r/AMD is in manual approval mode, this means **all submissions are automatically removed and must first be approved before they are visible**, this is done to prevent spam, scams, excessive self-promotion and other rule-breaking posts.\n\nYour post will be approved, provided it follows the subreddit [rules](https://www.reddit.com/r/Amd/about/rules/).\n\n**Posts regarding purchase advice, PC build questions or technical support will not be approved.** If you are looking for purchasing advice, have a PC build question or technical support problem, please visit the [PC Build Questions, Purchase Advice and Technical Support Megathread](https://www.reddit.com/r/Amd/comments/1bsp3cp/pc_build_questions_purchase_advice_and_technical/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Amd) if you have any questions or concerns.*",
            "Just excuses to keep gpu prices abnormally and unjustifiably overpriced",
            "It sure looks like these are literally Radeon Pro reference cards with a vendor specific sticker on the fan hub. Same as Polaris reference cards.",
            "these cards are designed to be installed next to one another in a rack, that's why the blower design.\n\n\nAnd right now, most gpus in that situation are gonna do AI tasks.",
            "I’m more than aware of the reason blower cards are still produced. Gigaboom is just hopping on the AI marketing buzzword to increase their profit like all the other companies are. One of these days I’m expecting someone to try and sell us AI enhanced AI"
        ]
    }
}