{
    "Please make sure to flair your posts! Especially make sure to change the flair to resolved once solved!": {
        "title": "Please make sure to flair your posts! Especially make sure to change the flair to resolved once solved!",
        "score": 127,
        "url": "https://www.reddit.com/r/AMDHelp/comments/4x5a8y/please_make_sure_to_flair_your_posts_especially/",
        "content": "Thanks guys.\n",
        "num_comments": 0,
        "comments": []
    },
    "Troubleshooting form": {
        "title": "Troubleshooting form",
        "score": 79,
        "url": "http://reddit.com/r/AMDHelp/wiki/tsform",
        "content": "",
        "num_comments": 8,
        "comments": [
            "Is there a functional difference between the old Wraith Max and newer Wraith Prism? They look the same except for the small RGB difference.",
            "It recently came to my attention that people were unable to reach the troubleshooting form on \"new\" Reddit. Until I get some time to work on the formatting I'm going to sticky this link. If anyone has suggestions for improving the form post them here in the mean time. Thanks!",
            "[deleted]",
            "Seems so.\n\nhttps://www.techspot.com/review/1635-amd-wraith-coolers-compared/",
            "is this the thread where you can ask anything about AMD related stuff?",
            "Please create a new post for your specific issue. This is just here as a reference to the TS form.",
            "Wraith Max isn't in that review.",
            "Woops. My mistake. That's what I get for trying to answer at 1am.",
            "A for effort"
        ]
    },
    "Almost 30% drop in FPS with Instant Replay on. Is this normal? (6700XT)": {
        "title": "Almost 30% drop in FPS with Instant Replay on. Is this normal? (6700XT)",
        "score": 3,
        "url": "https://v.redd.it/2cb4ncqf238d1",
        "content": "So i just noticed that my fps drops to almost 30% if i turn instant replay on adrenalin. I would like to know if this is normal? My card is a MSI 6700xt Mech 2X OC with a ryzen 5 3600.\n\nThanks!",
        "num_comments": 11,
        "comments": [
            "Yes lol",
            "Dude.. Like you absolutely need those 600fps. And yes - its normal - its only so much card can render and record at same time.\n\nBut dont worry - if you limit your FPS to 165 or 144 at your monitor refresh rate ( like it supposed to run) you wont loose even a single FPS when instant replay...\n\nRunning over 165 or 144 is useless (if you dont have 240 or 360hz monitor)",
            "Its rather your storage where its being saved or the cpu. Recording does not affect gpu performance this much",
            "cap fps below refresh rate",
            "Do you have a 600hz monitor?",
            "Valorant is one of those games that absolutely rely on high and stable framerate. Most importantly 1% fps. I upgraded from 5600x to 5700x3d and got absolutely massive boost in smoothness in this game, and no -  framerate that above your refresh rate is a good practic since you further decrease input lag",
            "That's in the menu. In game it should be around 180-300 avg depending on which map.",
            "Yeah I agree frametime and lag does get less with higher fps but once over like 300fps you won't notice a difference. If you do it's placebo. And actually over 500fps can cause some other issues with perceived smoothness.",
            "Even if your input lag decreases over 165FPS (6ms) and you get 4ms at 240FPS - that 2ms difference is so small comparing to your ping. Ping is usually 40-20ms so only 5-10% improvement you get from those 2ms.\n\nAverage human reaction time is 200ms so ... Useless..And not to mention 5-10ms lost on your monitor response lag - mouse lag 10ms ...\n\nAnd true - fast 3D cache CPU will smooth the game so much 👍",
            "Ping and input lag are not comparable at all to the millisecond, there are many factors developers use to optimise for different pings per player to even the advantage (to a certain degree). Whereas a 10ms increase in input lag is far more noticeable. Human reaction time also has zero correlation with input lag, literally anyone can easily see the difference between 10ms and 1ms of input lag with a touch-cursor on a screen for example, [watch from around 1:15 in this video.](https://youtu.be/vOvQCPLkPt4?si=yO38y5rJGZ6tQvkx)",
            "True but what Im saying is - you will never get real 1ms (or even 4-6ms) true lag. Compensation for the ping is done - fine - but the added lag from mouse , monitor , game itself always comes up to 30-40ms at best. And since your reaction time is 150ms at best at highest skill players - its so negligible if you get 40 or 10ms lag even , You just cant feel that in the game.\n\n(fine - finger trick shows that the difference between 50 and 1ms is great - but running game ? Plus trough internet servers - you wont gain much advantage - if at all )\n\nWish I could test game like Apex Legends on lan - to see if lag will dissappear? I bet not - there still will be 20ms lag .."
        ]
    },
    "Brand new pc freezing then crashing": {
        "title": "Brand new pc freezing then crashing",
        "score": 11,
        "url": "https://i.redd.it/tnwcr8dvd18d1.jpeg",
        "content": "**Computer Type:** Desktop\n\n**GPU:** MSI GEFORCE RTX 3070\n\n**CPU:** AMD RYZEN 5 5600X 6-CORE\n\n**Motherboard:** ASUS AM4 TUF GAMING X570-PLUS\n\n**BIOS Version:** AMERICAN MEGATRENDS INC. 5013\n\n**RAM:** CORSAIR VENGEANCE LPX 16GB\n\n**PSU:** EVGA 750 GT\n\n**Case:** THERMALTAKE CERES 300\n\n**Operating System & Version:** WINDOWS 11 HOME \n\n**GPU Drivers:** GEFORCE GAME READY DRIVER 555.99\n\n**Chipset Drivers:** AMD X570 CHIPSET\n\n**Background Applications:** FORTNITE\n\n**Description of Original Problem:** This is a newly built pc. Every time I boot up a game it freezes and then the pc reboots. The game seen crashing in the picture is Fortnite.\n\n**Troubleshooting:** I ensured the CPU fan was on correctly since the CPU was originally reaching temps above 80C. However, even after that was resolved the issue remained. I then tried replugging the VGA cables into my graphic card but that was no help either.",
        "num_comments": 13,
        "comments": [
            "Try reseating your gpu if that doesn't fix it its probably a dying gpu",
            "Does the crash happen as soon as the screen artefacts like that? At first glance, I 'd say that you need to have that gpu replaced because it's most likely gone. But before that try to DDU the drivers and reinstall them just to be sure. But 90% gpu gone. That looks like the usual gpu artefacts",
            "If you have spare gpu or can borrow from someone to see whether it's the gpu or other problem",
            "Looks like a gpu or driver issue to me, grab a new gpu and see if there are more artefacts",
            "seems like a possibly bad gpu or pcie contacts on the gpu",
            "Download HWCPU and watch temps on both the CPU and the GPU. But definitely with rest, it seems like a bad GPU. Sounds like you can't run HWCPU I guess",
            "What does the windows event viewer says ?",
            "RIP",
            "if you got 80 C , check cpu cooler if its removed the foil between cpu and cooler",
            "Try taking your case side off and running it like that while gaming for awhile, case could get to hot and possibly cause GPU to overheat",
            "it usually last about 20 seconds to a minute like that before the pc reboots",
            "I would suggest to RMA the 3070. That looks like the culprit to me",
            "Yup this screams bad GPU, RMA that thing ASAP."
        ]
    },
    "Why is my Radeon Settings: Host Service at 60%+ GPU usage whenever I turn on Instant Replay? I have an RX 6600.": {
        "title": "Why is my Radeon Settings: Host Service at 60%+ GPU usage whenever I turn on Instant Replay? I have an RX 6600.",
        "score": 1,
        "url": "https://i.redd.it/fh3801tph48d1.png",
        "content": "",
        "num_comments": 0,
        "comments": []
    }
}