{
    "This could be our first look at the OnePlus Pad 2": {
        "title": "This could be our first look at the OnePlus Pad 2",
        "score": 127,
        "url": "https://www.androidauthority.com/oneplus-pad-2-leak-2-3453538/",
        "content": "",
        "num_comments": 37,
        "comments": [
            "I thought the Oppo Pad 3 would be announced first and then sometime later a OnePlus Pad based on it. Hoping it targets the same price point as the OnePlus Pad/Oppo Pad 2. Snapdragon Gen 3 but I would have been happy with a Dimensity 9200 or 9300 if that could keep it sub $500",
            "Hope this comes with OpenCanvas out of the box 🤞\n\nI really want Open Canvas in a device without an AMOLED/foldable screen (for durability purposes)",
            "Yeah,\n\nbuying from 1+ given their horrendous customer service reputation is a risky move.",
            "I wish Samsung would make a keyboard like this.",
            "All Android tablets are useless until we get a real notes app. Right now our options are Samsung notes and OneNote. Samsung notes is exclusive to Samsung devices meaning you can't sync your notes with your computer. OneNote takes up 20% of the screen with an unhideable toolbar.\n\nMeanwhile iPad has Goodnotes and now Apple notes. At my college goodnotes are the standard. It has ai capabilities, corrections, ease of use and loads of customizability. Apple has just released the newest version of their notes app and it's supposed to be brilliant. It even has nice gimicks like displaying a shadow of your pen as you bring it close to the screen.\n\nI think this is a Google issue. A notes app is a standard utility. Google has keep but that's nowhere near sufficient.",
            "I guess \n\nNo headphone jack \n\nNo SD card slot?",
            "Snapdragon will be better for custom rom though, once the tablet is EOL for OS and security updates.",
            "This is what I was wanting as well. I really liked the software experience on the one plus foldable just the hardware was not for me when it came to the smaller exterior screen. That software with the open canvas on the tablet with a snapdragon gen 3 would be nice",
            "Not sponsored or anything but I've been pleasantly surprised with Notewise on my Tab S9+. It's very stable and works well compared to the mess that is Goodnotes on Android. Latency is still noticeably higher than Samsung Notes but the extra features make up for it.",
            "This thought process is why companies get away with locking down the OS and pushing developers out. Android doesn't need native, supercool, creative notes apps, just go download a third party app. Just give the developer great support and access to APIs so they can continue to deliver features they think consumers want.",
            "Today I learned, the only use of a tablet is to take notes.",
            "Skill issue",
            "I watch videos on mine buddy, why you moan",
            "What does Google have to do with it? You have Notein, Touchnotes and Nebo on Android. Also to further counter your point I haven't seen anyone use OneNote on IpadOS or Android. People with Ipads prefer notability and some minority uses Goodnotes at my college. \n\nAnyways, how is it related to the aforementioned oneplus pad?",
            "user error",
            "Keep is one of my favourite Google apps and there is nothing wrong with it. You can have a preference but no need for such hyperbole.",
            "If we are going to go that far then every tablet is useless compared to the Microsoft Surface Pro because the Surface runs full Windows and desktop software ",
            "> Samsung notes is exclusive to Samsung devices meaning you can't sync your notes with your computer. \n\nSamsung Notes syncs with OneNote",
            "Good Notes came installed on my Tab S9+.",
            "It’s annoying that you have to do it this way but there is a pretty easy way to get samsung notes to work on any windows computer through a github script",
            "And Oneplus will definitely allow the bootloader to be unlocked. 100% agree with Snapdragon being better here",
            "Ohh okay. Big screen + OpenCanvas would gonna be so dope.\n\nDo you have any idea if the OnePlus Pad actually got OpenCanvas? OnePlus told that it would be coming with a future software update back in October or November last year and the most recent info I can find is that it didn't get OpenCanvas with the Android 14 update.\n\nI'm kinda wondering now if OnePlus has decided to backtrack and keep OpenCanvas reserved only for it's foldable.",
            "Keep is great, but it's a different kind of notes app than what you'd want to use like a notebook.",
            "Keep is like a pile of sticky notes. I need something that could replace a notebook",
            "It's not a real notes app. It's something you write your grocery list in",
            "Saying the notes \"sync\" is a stretch. Samsung uploads pictures and they show up in the OneNote feed, not in folders like notes created in OneNote. There's no practical way to make edits in one app and have those edits show up in the other app. It's insulting. You're better off sharing as a pdf from the Samsung notes app.",
            "\"Sync\" is very generous. As far as I can see I can't edit or treat it like a regular note",
            "GoodNotes on Android is ass",
            "I appreciate it. I've done the GitHub thing and Samsung notes works on my desktop.",
            "OnePlus, after acquisition by Oppo, does not allow bootloader unlocking. Also custom rom support is reduced after OnePlus 9 series as getting the device back from a bricked or botched install state is now impossible.",
            "I don't use it, just letting OP know because they mentioned that Apple has it.",
            "> OnePlus, after acquisition by Oppo, \n\nMy brother, OnePlus has always been owned by Oppo",
            "They still allow it. My OnePlus 12 is rooted and they have nothing like Knox to tell them you rooted. Yes the locked MSMTool sucks but that's different than blocking bootloader unlocking altogether ",
            "10 Pro was only blocked because we never got an msmtool for it.",
            "I get your point, but the version for Android is so incredibly bad that it might just not exist.",
            "After ColourOS replaced the Cyanogen Mod base of OnePlus' OxygenOS."
        ]
    },
    "Previewing for accessing Phone Link features from the Start menu with Windows Insiders": {
        "title": "Previewing for accessing Phone Link features from the Start menu with Windows Insiders",
        "score": 91,
        "url": "https://blogs.windows.com/windows-insider/2024/06/21/previewing-for-accessing-phone-link-features-from-the-start-menu-with-windows-insiders/",
        "content": "",
        "num_comments": 34,
        "comments": [
            "Pleaaaaase, do something about Screen Share Permission during EVERY screen mirror session. If I had to touch my phone to Allow screen mirroring, I might as well just use my phone.",
            "Oh wow thats pretty handy. Still waiting for pixel to get the integrated features like the screen mirroring and files.",
            "This is pretty cool. But really all I want are messaging improvements. RCS support if my messaging app on my phone supports it would be good. Also I'm sick of it showing SMS messages (and notifications) for messages that my phone filters as spam.",
            "they should finish migrating features from control panel to settings after 10 years maybe",
            "Too bad I can't use it because MS won't let me move the task bar to the top of the screen. I have to use startallback and it removes the W11 start menu ",
            "This was fixed for me recently, idk if it was an update or if I repaired my phone. But not it only asks you once and your just need to have unlock your phone, no more permission.",
            "Please add screen mirroring to anything besides Galaxy devices",
            "There's an adb command that's supposed to help, not sure if it's been patched yet though\n\n\nadb shell appops set com.microsoft.appmanager PROJECT_MEDIA allow",
            "This is now default for me, I'm so happy.",
            "recent update fixed it",
            "It won't. Phone Link needs to be installed as a system app in order to support advanced features.",
            "I just want clipboard sync \n\nRight now KDE Connect scratches that itch well though",
            "Well, technically the Pixel (and some other phones) can already do this too. But you need a Chromebook.\n\n\nHonestly, if they came out with a new Pixelbook powered with the X Elite I'd get one lol.",
            "iPhone mirroring [is so good!](https://www.youtube.com/watch?v=dGag1gY-Dls). You don't need to unlock your iPhone first, or set anything up, you don't need to be near it at all. \n\nHaving a locked down, vertically integrated eco-system has its advantages.",
            "Why not just use [https://messages.google.com/web/](https://messages.google.com/web/) ?",
            "Oneplus has it now right",
            "Unfortunately it requires system permissions, so without pre-installing the app by the OEM, they can't do this on their own.",
            "You can grant it all the permissions it needs via adb, no?\n\nAlso does this break rcs, the windows phone link thing I tried years ago made every text send out as an SMS so it was DOA for me",
            "Honestly, that makes sense, and I now don't want that. I hated how my S23U had so much preinstalled unremovable bloatware from companies like Microsoft.",
            "You can do clipboard sync with the Swiftkey keyboard which Microsoft owns.\n\nhttps://support.microsoft.com/en-us/topic/how-to-use-microsoft-swiftkey-keyboard-to-copy-and-paste-text-between-swiftkey-and-windows-85c8ca64-7091-477f-91d1-99c3b1f75138",
            "Clipboard can already sync with phone link, no?",
            "You can just use Quick Share to copy the text into it and send it to your phone.",
            "Everything he mentions in that video my S24 already can do with Phone Link on Windows.. what's this super secret exclusive feature that can only happen in locked down ecosystems?",
            "Sure I can. But that means I have to leave a browser window open and I don't get Windows notifications unless I'm logged in. The Phone Link stays connected and just works without me thinking about it.",
            "Why? \n\nThere are other apps that have this functionally.",
            "I like gboard \n\nBut thank you",
            "The feeling of superiority when your product gets something years after the competition but the CEO tells you it's brand new",
            "The only advantage the iPhone Link has over Phone Link from Windows is  that you don't need to unlock nor to allow the screen share thing first from what I understand",
            "You could install the PWA version of the site to make it feel less like the browser, I guess. That's the only improvement I can think of.",
            "I just use the Phone Link messages as notifications when I'm getting the RCS/SMS and then to actually send and read messages, I open the PWA from [messages.google.com](http://messages.google.com)",
            "I guess they trick Pixel users too since they get nerfed, sorry, \"\"\"\"\"\"\"stock\"\"\"\"\"\"\" Android.",
            "Isn't that a security issue?",
            "You grant the permission once now (used to be each time lol) and I have a routine where my phone is unlocked when on my wifi anyway.",
            "You unlock the iPhone on your Mac. And the iPhone's screen stays off."
        ]
    },
    "Never miss a beat with Lenovo Tab Plus, a music lover’s dream tablet with eight speakers - Lenovo StoryHub": {
        "title": "Never miss a beat with Lenovo Tab Plus, a music lover’s dream tablet with eight speakers - Lenovo StoryHub",
        "score": 67,
        "url": "https://news.lenovo.com/pressroom/press-releases/tab-plus-music-lovers-dream-tablet-eight-speakers/",
        "content": "",
        "num_comments": 56,
        "comments": [
            "As someone who actually does watch a lots of anime's from my tablet. \n\nThis is awesome!! \n\nSD card ✅\n\nHeadphone jack ✅\n\nThe speakers are awesome!! \n\nGreat job by lenovo. \n\nMore stuff like this should be released, will try to buy this.",
            "This seems like such a weird gimmick.\n\nI don't care how many speakers you put on there, there isn't physically enough space to make them sound anything other than tinny. \n\nEven if some of them are essentially subwoofers, there's no way this sounds anywhere near decent enough for people that care about it.",
            "Mmm yes tablet speakers every audiophile's dream",
            "I wish Lenovo would make a Y700 for the western market. Even a device with a lower spec SoC like the G99 would be good.",
            "I just want a y700 upgrade thats available globally. Can we please get a good 7-8inch tablet? I do not want to buy an iPad Mini or a terrible $80 tablet.",
            "as someone who uses a tablet for homeassistant.. this is actually a pretty interesting idea and at a really good price point",
            "This is just straight up an advertisement, why is this post even allowed?",
            "And ZTE still hasn't fully released the nubia Music...",
            "I love on my tab s8u\n\nI want a better audio experience, and would pay more for it",
            "This is great! But missing fingerprint sensor which is a deal breaker for me. If it were missing headphone jack, I could have used a USB c adaptor but no such good alternative is there for finger print",
            "JBL is not what I associate with quality. At least it has a 3.5mm headphone jack. But they don't mention the DAC inside it at all. Seems like mostly marketing.",
            "Just get a Tabs9",
            "All Android tablets are useless until we get a real notes app. Right now our options are Samsung notes and OneNote. Samsung notes is exclusive to Samsung devices meaning you can't sync your notes with your computer. OneNote takes up 20% of the screen with an unhideable toolbar. \n\nMeanwhile iPad has Goodnotes and now Apple notes. At my college goodnotes are the standard. It has ai capabilities, corrections, ease of use and loads of customizability. Apple has just released the newest version of their notes app and it's supposed to be brilliant. It even has nice gimicks like displaying a shadow of your pen as you bring it close to the screen.\n\nI think this is a Google issue. A notes app is a standard utility. Google has keep but that's nowhere near sufficient.",
            "The only other thing I'd want is HDMI input so I can continue to use the screen and speakers once the tablet is outdated. \n\nPretty sure lenovo had one or two tablets that could do that.",
            "I've got an older model of Lenovo tablet, and, other than the screen, the speakers are the real stand out feature.  They sound deep, and loud.  There's some fucking witch craft in those things.  \n\nIt's a j706f I have, and the sound is legitimately phenomenal.",
            "Surely, Dolby Atmos® certification would turn these tinny speakers into a full-theater experience!",
            "Exactly, what would really attract music lovers is a headphone jack with a quality DAC/Amp and some software features to go along with it, knda like what LG and HTC did. Anyone who uses their tablet speakers as their way to listen to music doesn't deserve music lmao.",
            "Honestly, my old iPad Pro 10.5\" having 4 speakers was a big factor in my decision. Not because I thought the sound would be *that* much better but because the 2 speaker option were both on the same side.\n\nJust having balanced audio on a tablet is pretty important.",
            "I've got a Pixel Slate and you'd be surprised at how good a tablet's speakers can sound and how full they can sound if done properly.  Of course they aren't going to thump, but the sound is full and there's nothing in the sound spectrum that is missing.",
            "Depends on the screen size.  This would make an amazing 27\" tablet.  You could get some great bass at an inch or so thick, too.",
            "There is absolutely space for that?\n\nThe Lenovo P12 Pro, Ipad Pros, Galaxy tab s9s all sound fantastic with 4 2W speakers.\n\nThere is a lot of bass on those, as well as very good range with highs and mids.\n\n\nSeems like you've never tried one of these before and judge everything from a 200bucks tablet you tried 5 years ago.",
            "That's okay. That group is so gullible and easily swayed by BS that this would absolutely work on them.\n\nRemember, this is the group that sticks to their claim that they can hear the difference between $500 Apple AirPods Max and $1000 Sony headphones. \n\nProtip: It's called \"the placebo effect\" mixed with denial and buyer's remorse (that they spent $800 on $50 headphones).",
            "Wasn't there a global 8+gen1 y700 late last year/early this ear",
            "I don't think it's a good price point. Helio G99\n\n>Lenovo Tab Plus is now available in select global markets with an expected starting price of 279€ (including VAT) and $289.99.\n\n>Memory+Storage 8+128GB / 8+256GB\n\n256GB storage is going to be the over $300. For that price you can get a Poco Pad with a Snapdragon 7s gen 2. Xiaomi Pad 6 with a Snapdragon 870 is around $320. OnePlus Tab and Pixel Tablet with a speaker dock is at $399. Both of those are a year old potentially with new iterations on the way. Good chance, in my opinion, they go on sale this year for the price of this Lenovo Tab but with way better hardware. If it's the speakers, Pixel Dock. Software support, OnePlus or Google Pixel. Performance, OnePlus or Pixel. Display size/resolution, Poco Pad. AV1, Pixel or OnePlus. 3.5mm jack, Poco Pad or Lenovo",
            "So we can all talk about how much it's going to suck and what a weird marketing choice this is",
            ">All Android tablets are useless until we get a real notes app.\n\nYour niche use case is not universal.",
            "[Notein is really good.](https://play.google.com/store/apps/details?id=com.orion.notein.global) And from this [Reddit post](https://www.reddit.com/r/Android/comments/1di2hl3/google_keep_is_struggling_to_keep_it_together/?utm_source=share&utm_medium=mweb3x&utm_name=mweb3xcss&utm_term=1&utm_content=share_button) it seems people really like Keep as is.",
            "touchnotes was pretty good when i still used a tablet for notetaking in college, now use a windows 2in1 laptop, with onenote. i find that the best and most convenient setup, as we need some stuff only windows can do. the ipad is wayyy overhyped for what it can ACTUALLY do.",
            "Pretty sure you can use a USB c to HDMI adapter for that right?",
            "No, it's just you're taking \"good sound for a tablet\" to mean \"good sound\".\n\nAn iPad pro does not sound good when it's playing music. \n\nIt sounds good for a tablet. It does not sound good compared to speakers or headphones. That's why it's a gimmick.",
            ">claim that they can hear the difference between $500 Apple AirPods Max and $1000 Sony headphones.\n\nThey do have different sound signature, so without judging the quality aspect they do sound different as in quantity of bass, vocal, etc. It's less of \"only audiophile can tell the difference\" and more \"only people who don't care about audio can't tell the difference\".\n\nThe true snake oil in audiophile community is whether they can tell the difference between DACs and solid-state amps.",
            "> Remember, this is the group that sticks to their claim that they can hear the difference between $500 Apple AirPods Max and $1000 Sony headphones.\n\nEven plebs can tell the difference. Have you got your ears checked recently?",
            "Tell you've never been in an audiophile sub without telling me you've never been in an audiophile sub",
            "Stay jealous buddy, my Qinxchi Deluxe in ear monitors destroy your airpods. And don't you dare call the gold plated accents painted lead. the aux cord allows me to transmit 789000mhz audio. Bluetooth can only do 135mhz.",
            "This is hilariously true in a way lol",
            "> Pixel Tablet with a speaker dock is at $399\n\nNot on store.google.com, without the speaker dock it's 399, with it's 499, so 200$ more than the lenovo tab\n\nPoco and Xiaomi aren't real options if I want to avoid importing, and more importantly miss the entire point which is to have high quality and loud integrated speakers (which in fairness, need to wait for reviews to see if the lenovo one truly has those)\n\nCPUs though you have a good point, however for the tasks I'd be throwing at it i think the G99 will be more than plenty\n\nI also definitely don't need 256GB of storage, and if I did, it has a micro SD card slot",
            "Taking notes is a niche use case?",
            "As far as I'm concerned note taking is the only unique selling point for a tablet. For every other use a laptop or a phone will get the job done. I've wanted a tablet for years but never had a reason to get one until I went back to college. Why would anyone get it as a third device?",
            "Thanks, I'll try it out. Lately Samsung's updates have been making their notes app worse \n\nI love Keep and have been using it daily since 2015. I need an app where I can show my work for calc classes. Keep is insufficient for that use case.",
            "No, I mean there should be a native HDMI input on the tablet so it can accept HDMI Source and display on its screen rather than using apps like superdisplay+usb c adapters, which does work but might introduce lag or reduced quality. \n\nSomething like this one they had a few years ago: [Yoga tab 13](https://liliputing.com/lenovo-yoga-tab-13-is-an-android-tablet-with-hdmi-input-use-it-as-a-portable-display/)",
            "I am 100% sure I could tell the difference.  I have never used either product, but one is earbuds and the other is headphones.  Does anyone legitimately think they would sound the same?  I have no idea which one sounds \"better\", and the best I could do is probably \"which one do I prefer\", but they would obviously sound different.",
            "Because of just HOW gullible that community is, while I am PRETTY sure you're being sarcastic or trolling, I genuinely can't tell.",
            "I got my xiaomi pad 6 for about 300 on Amazon. New. In the USA",
            "I use my tablet for drawing. A lot of artists like tablets for art creation because of their convenient form factor. It's a great complimentary drawing device in addition to a large display. \n\nI also use it for media consumption. Much better experience reading and watching videos in bed with my tablet than using my phone. And games. Games look way better on the large screen of the tablet versus my phone. \n\nThere are plenty of uses for tablets other than note taking.",
            "Okay but again that's your niche use case. A tablet isn't a third device for me. I haven't had a laptop in over a decade at this point.",
            "Airpods max are headphones.",
            "Don't worry, I've heard the exact argument before. It's such a shame Bluetooth 4 hasn't caught up with the 100GBps aux can transmit. You lose such much audio data with Bluetooth, that's why everyone hates it and air pods are the worst selling device on earth",
            "ah, I'm in canada so that's where I struggle :) extra 50 USD to import..",
            "You searched for it on the Canadian Amazon site? \n\nStrange it's here but not there.",
            "Yeah they do that often, no idea why, if I search on Canadian Amazon I get a bunch of random brands..",
            "I bought mine from a third party on Amazon, but it was a good price and brand new. It isn't xiaomi selling directly"
        ]
    },
    "Xiaomi Redmi A3 smartphone review – Lots of upgrades on the budget phone": {
        "title": "Xiaomi Redmi A3 smartphone review – Lots of upgrades on the budget phone",
        "score": 79,
        "url": "https://www.notebookcheck.net/Xiaomi-Redmi-A3-smartphone-review-Lots-of-upgrades-on-the-budget-phone.850272.0.html",
        "content": "",
        "num_comments": 21,
        "comments": [
            "G36 with 3gb RAM?    \nI get some people have extremely light usecase but even for them this will be sluggish.    \nTerrible specs even for the price",
            "**Pros:**\n\n•extremely inexpensive\n\n•fast WLAN for the price class\n\n•attractive case\n\n•90-Hz display without PWM\n\n•close to stock Android 14\n\n•3 years of promised updates\n\n•reliable fingerprint sensor\n\ndecent battery life\n\n**Cons:**\n\n•slow charging\n\n•case not the most stable\n\n•sluggish SoC\n\n•no NFC\n\n•camera produces blurry photos at times\n\n•not much RAM (depending on the model)\n\nA 3 GB ram/64 GB storage model is [£79](https://www.mi.com/uk/product/redmi-a3/?skupanel=1&gid=4223703879&srsltid=AfmBOorOJDW_fOX0PtJ1EptxKadkwb4TCEphMOlyu0m2DFbq9dK2JswmASw) off Xiaomi's UK website for example.",
            "Any used phone for that budget will absolutely annihilate this phone.",
            "Hilarious that for that same price in like 2016? The Redmi 4 prime had 3gb of ram too and similar storage, and a 1080p screen. Surely they'd be able to at least put 128GB and 6gb of bottom shelf ram in it 8 years later...",
            "just don't bother with these lowest tier budget phones, everything is so slow",
            "this is a ripoff for sure",
            "Still overpriced for the spec",
            "G36 shouldn't be acceptable anymore. At worst case unisoc t612 or helio g85.",
            "There's a slightly better A3x with T603",
            "Also no NFC in an era of tap to pay (not necessarily a deal breaker, just an annoying omission)",
            "I have Redmi A1 in the family with Helio A22 and 2gb ram. Its slow as hell and very glitchy. Even with stock android its barely usable.",
            "Wait isn't this phone from like 2018-19?",
            "I don't know about the CPU but I still have an old phone (>5 year) with 3GB of RAM and it is fine for light usage.",
            "I can't imagine using 6gb of ram on Android with how badly optimized the operating system is. 3gb would be a nightmare.\n\n3gb is fine for IOS, but the idea of anyone releasing an Android phone with less than 8gb is insane.",
            "No NFC? Strange...",
            ">•extremely inexpensive\n\nIts 130USD about 200AUD.\n\n200 AUD can get you the[ Moto G54 easily](https://www.ozbargain.com.au/search/node/moto%20g54)\n\nhttps://www.gsmarena.com/compare.php3?idPhone1=12543&idPhone2=12822\n\nYeah, nah.  Its a garbage phone.  Needs to be sub 100USD/150 AUD at the minimum.",
            "Yep, even if they're likely not to be supported anymore and will run an old version of MIUI (I'm very familiar with Xiaomi devices, so I can't talk too much about other brands). For what it costs or less a Note 8 Pro, even the Note 9S/Pro, can for example be found with far better hardware.\n\n0.08MP auxiliary camera?",
            "You might be confusing it with Mi A3 which was a different line, this is Redmi A3.",
            "Not strange. NFC is not available in many budget phones. It's also region dependent.",
            "Says $90 for me \n\nVersus $170 for MotoG54 \n\nSo almost double the cost",
            "would much rather just have a note9/s10 at that point, my poco f5 cost around the equivalent of 400 aud"
        ]
    },
    "Realme's latest survey asks you to choose between 3 different specs:": {
        "title": "Realme's latest survey asks you to choose between 3 different specs:",
        "score": 2,
        "url": "https://fxtwitter.com/Sudhanshu1414/status/1803414996497703297",
        "content": "",
        "num_comments": 1,
        "comments": [
            "Interesting"
        ]
    }
}