{
    "Anime Questions, Recommendations, and Discussion - June 22, 2024": {
        "title": "Anime Questions, Recommendations, and Discussion - June 22, 2024",
        "score": 7,
        "url": "https://www.reddit.com/r/anime/comments/1dlsacx/anime_questions_recommendations_and_discussion/",
        "content": "This is a daily megathread for general chatter about anime. Have questions or need recommendations? Here to show off your merch? Want to talk about what you just watched?\n\n[This is the place!](https://preview.redd.it/zoqbizdvnw7d1.png?width=3420&format=png&auto=webp&s=2b479cf17753a860c84ad9684de4cb259a7d4da9)\n\n[**All spoilers must be tagged.**](/r/anime/wiki/rules#wiki_tagging_comments) Use `[anime name]` to indicate the anime you're talking about before the spoiler tag, e.g. \\[Attack on Titan\\] >!This is a popular anime.!<\n\n[Prefer Discord? Check out our server: https://discord.gg/r-anime](https://discord.gg/r-anime)\n\n## Recommendations\n\nDon't know what to start next? [Check our wiki first!](/r/anime/wiki/recommendations)\n\nNot sure how to ask for a recommendation? Fill this out, or simply use it as a guideline, and other users will find it much easier to recommend you an anime!\n\n*I'm looking for:* A certain genre? Something specific like characters traveling to another world?\n\n*Shows I've already seen that are similar:* You can include a link to a list on another site if you have one, e.g. [MyAnimeList](https://myanimelist.net) or [AniList](https://anilist.co).\n\n## Resources\n\n* [Watch orders for many anime](/r/anime/wiki/watch_order)\n* [List of streaming sites](/r/anime/wiki/legal_streams) and [find where to watch a specific anime](https://www.livechart.me/search)\n* [Looking for the source of an image?](/r/anime/wiki/reverse_image_searching)\n* Currently airing anime: [AniChart.net](https://anichart.net/) | [LiveChart.me](https://www.livechart.me) | [MyAnimeList.net](https://myanimelist.net/anime/season)\n* [Frequently Asked Anime Questions](/r/anime/wiki/faaq)\n* [Related subreddits](/r/anime/wiki/related_subreddits)\n\n## Other Threads\n\n* [« Previous Thread](/comments/1dl0d2z) | [Next Thread »](https://i.imgur.com/XVU14Xk.png)\n* [Serial Experiments Lain](/comments/1dhl4r4) — Discussion for the selected anime of the week.\n* [Watch This! Compilation](/comments/1d5xsjh) — Read recommendations from other users.\n* [Casual Discussion](/comments/1dkqd9q) — Off-topic thread for non-anime talk.\n* [Meta Thread](/comments/1d60hdt) — Discussion about /r/anime's rules and moderation.",
        "num_comments": 28,
        "comments": [
            "Good morning, thread.\n\n[Today's merch](https://i.redd.it/7qk7xmijj38d1.jpg) consists of the second batch of June item arrivals, a little old, a little new.\n\nIt's mostly ***BRAVERN!*** merch: The \"I ♡ Robot\", \"Maintenance\", and \"Tricolor\" T-shirts, the first Blu-ray volume, and [acrylic stands of Miyu and Lulu](https://i.redd.it/c4324lijj38d1.jpg). The BD included a [double sticker bonus](https://i.redd.it/dachnmijj38d1.jpg).\n\nAlso here are last month's release of *W encore*, the Walküre live performance CD collection (*Macross Delta*) and the soundtrack of *Liz to Aoi Tori*.",
            "This isn’t the first time that someone [tapped into this joke](https://www.cdjapan.co.jp/product/NEODAI-159079), but I do like how they’ve made [a *big plush* of Frieren getting stuck in a Mimic](https://www.amiami.com/eng/detail?gcode=GOODS-04491821). You can even trap her yourself now!\n\n(Anyone’s who a big fan of Railgun and Kill la Kill might  also want to check out the new plushies of those series.)",
            "Gintama update: I watched episode 305...\n\n[The show's] >!really [not playing around anymore](https://i.imgur.com/JGo1uXk.jpeg)... like [holy fuck](https://i.imgur.com/DfiwVh2.jpeg), man. I do think that Gintoki vs Takasugi is probably in my top 3 anime fights - not for it's animation (which is good but I wouldn't call it *outstanding*), but for its sheer emotional weight. I can safely say that there aren't a lot of fights (that I've seen) that [have felt as utterly soul-crushing](https://i.imgur.com/rCqN5Ih.jpeg) as this did. Also, while I wouldn't say Takasugi has been redeemed, I think this episode did a *masterful* job at making his motivations clearer and him as a character more understandable. He might be evil, but it's hard to really blame him!<...\n\ntl;dr - it is the best arc in the entire show (so far!) and I haven't even finished it yet lol.\n\nu/KendotsX u/Shocketheth u/Shimmering-Sky [](#forgotkeys)",
            "Finished Kanata No Astra and loved it, Could it have used a little more room to breathe? Sure but you can tell the people who made it really cared about it and despite only having 12 episodes they did their best to tell a coherent story and even had a double length premiere and finale as well as cut the OP for most episodes. The characters were likeable and the their found family dynamic was very believable given the circumstances, the mystery was quite interesting and the answers were rewarding, the themes of identity, humanity and knowledge were compelling  and it also had one of the most satisfying endings I've seen which is a rare feat in of itself.",
            "GBC made the impossible possible.\n\nAnime characters talking to each other about their doubts and fear instead of letting it fester.\n\nSasuga.",
            "so, since i've got nothing else to watch, can someone update me on spice and wolf? I wanted to watch, but i'm not sure if the one released this season is a continuation of the past ones, or if it's a remake like hxh. Where do i start from? Can i just watch from this season?",
            ">[This is the place!](https://preview.redd.it/zoqbizdvnw7d1.png?width=3420&format=png&auto=webp&s=2b479cf17753a860c84ad9684de4cb259a7d4da9)\n\nAhh, Yoru no Kuni, glad someone liked this little gem of a show. Would love to see more Ryo-timo projects someday.",
            "After years of delay, I'm finally going to watch \"Fate/stay night\" (by release order).",
            "[New JELEE beats dropped.](https://www.youtube.com/watch?v=aXIdipY7x_k)\n\n[](#listen)",
            "Vinland Saga update: 9 episodes in and the show still pisses me off. Ever since Episode 4 I've just been waiting for an explanation for [VL spoiler] >!why Thorfinn was taken away while the rest of the crew sailed back to Iceland, especially since the one dude tried attacking Askaladd while Thorfinn was with Thors as he died so they were on the same boat. Am I supposed to assume Thorfinn willingly didn't go back to seek revenge or that one dude tries getting Thorfinn but Bjord or Askaladd halted him?!< Does this get answered? I just need a yes or no. If there's clarification stated at some point, I can sit back and wait. If it doesn't get resolved then I can't possibly like this show. It's a major plot hole that needs to get filled for me.",
            "> acrylic stands of Miyu and Lulu\n\nBest mechanic girl and best [Bravern!]>!mecha!< girl.",
            "A Nendoroid version is coming. [Why does the promo picture look so lewd?](https://x.com/gsc_kahotan/status/1804088630128054343)",
            ">made a big plush of Frieren getting stuck in a Mimic\n\n\nLove that face. I am tempted by this one.",
            "I'm glad that you are enjoying Gintama this lot!\n\nIt's my #1 anime and seeing someone watching it and reacting to it brings me a lot of joy.\n\nSince you reached the end of episode 305 I will say that you can take it easy for now. I mean there are still 2 episodes left and the arc still didn't end so take a breath before delving into the finale of the arc. [](#mugiwait)",
            "I do remember from earlier in the anime that Nina and Momoka were taking their feelings out on the others...\n\nGuys, we don't need to be so hyperbolic about everything. This season's S&W does communication just as well, and last winter's A Sign of Affection is probably the gold standard for good communication in (romance) anime.",
            "> instead of letting it fester\n\nI don't know, I think Nina is clearly powering through [ep12] >!this whole new song thing. At both the beginning and end of last episode, Nina said to herself \"Momoka... I'm not in the wrong\", which is the first sign that she is not as confident as she appears to be. Then after learning about the band duel this episode, she talked about feeling tired and upset by \"the world of adults\". Finally, in front of that shrine she gave a pep talk but it was basically \"trust me, bro, we'll be fine\", without any concrete facts and numbers to back up. So the show fast forwarded to the new song release, and Nina now faces the biggest crisis in her music career...!<",
            "You can just watch the currently airing one",
            "Hijacking this post as my question is similar. Are the remakes of these shows worth it, or should I stick with the og?\n\n* Urusei Yatsura \n* Bartender",
            "Getting a \"This Video Is Not Available\" message, and yes, I did try VPN geolocating to Japan.",
            "I think you're meant to immediately understand that [VL]>!Thorfinn willingly and actively went to take revenge.!< I don't remember if it explicitly states that at any point, but it's not meant to be a mystery or somehow missing information.",
            "It didn’t look all that weird to me until I started looking closer at it. The Mimic might be cropped out of the anime and into this image…?",
            "> Guys, we don't need to be so hyperbolic about everything. \n\nOfc we don’t have to agree to every take we see here, everyone feels different about different shows, but telling people in what way or to what extends they should or shouldn’t express their personal opinions isn’t the way to go imo. I know you didn’t mean it in a bad way or anything, but still.",
            ">A Sign of Affection is probably the gold standard for good communication in (romance) anime.\n\n\nNecessitated by the MC/plot, but still one of the reasons I loved that show.",
            "[Guess it is literally just me given the view counts.](https://i.imgur.com/bI9GklG.png)",
            "If that's the case then I can't accept it. [VL spoilers] >!idk exactly how old Thorfinn is when Thors was killed but im guessing he was about 5 or 6. Him not being dragged by one of his Icelandic mates back to the ship while profuslouly crying doesn't cut it for me. I totally get his strong will to get revenge for his father by any means, that's how he should feel, but the way its being carried out doesn't sit right with me.!< Based on how heralded the series is, I'm assuming the mangaka has something up their sleeve for the long game.",
            "If my tone was a bit harsh, then I’m sorry for that. I wasn’t my intention whatsoever to completely deny their way of expressing themselves. Their statement just didn’t sit right with me:\n\n1. It implies that GBC has achieved something that no anime ever had, which just isn’t true.\n2. And this supposed superiority is misleading too as GBC had its fair share of drama earlier on.\n\nMaybe I’m just looking too deep into this and being annoying nitpicker (I didn’t even really want to write my previous comment for this reason), but I really can’t stand misinformation being spread like this - even if it wasn’t on purpose.",
            "Eh, I think you're making a mountain out of a molehill. Something like [VL]>!Thorfinn going back, then sneaking onto Askeladd's ship before either of them embark again!< is entirely plausible.",
            "I mean that would be plausible to some degree and I do get how I could just be overthinking this whole situation. But then the end of episode 9 happened and made me want to start flipping tables again lol. Specifically [VL spoiler] >!Thorfinn telling Thorkell he's the son of Thors and Thorkell being intrigued and wanting to know more but then Thorfinn just dips and swims away with his vast amount of injuries instead of possibly joining him and England to begin a new revenge path.!< But maybe I'm just mad that things aren't happening the way I want them to and I shouldn't be dictating how things are supposed to go."
        ]
    },
    "Mod Applications — Spring 2024": {
        "title": "Mod Applications — Spring 2024",
        "score": 70,
        "url": "https://www.reddit.com/r/anime/comments/1d0p1ky/mod_applications_spring_2024/",
        "content": "# The Application deadline has been extended until June 22nd, 11:59pm UTC!\n\n- - -\n\n[Hi there!](https://preview.redd.it/dfm8kjmnql2d1.png?width=1195&format=png&auto=webp&s=eec9a606cb5c478cab975927824f74b61efacbf1)\n\nWe're looking for new moderators once again. If you want to make this subreddit a better place, then please apply and let us know why you would be a good fit for our team!\n\nIf you're interested in applying, you should take a minute to take a look at our [mod page](https://www.reddit.com/r/anime/wiki/mods) to see how we organize ourselves as well as the [rules page](https://www.reddit.com/r/anime/wiki/rules), as some questions that appear on the application will refer to them. If you have any further questions feel free to ask in this thread!\n\n# Responsibilities\n\nModerators of [/r/anime](https://www.reddit.com/r/anime) are expected to be able to execute most Reddit moderating tasks, as we don't have any divisions or specialist roles on the team. There are other optional responsibilities, like managing CSS and bots, but that's going above and beyond the base requirements.\n\nA large part of what we do is review reports on posts and comments and remove them if they break the rules of [/r/anime](https://www.reddit.com/r/anime) or Reddit in general, along with potentially banning users that have repeatedly or egregiously broken the rules. We're also expected to review and reply to moderator mail sent from users to answer questions and handle appeals for removals or bans.\n\nAside from that, we're in frequent communication with each other in our Discord server about the above as well as the future path of the subreddit, and want new moderators to be involved in our discussions as well.\n\n# Application\n\n[**Fill out the application here!**](https://forms.gle/g795TJabYS3p9Sj26)\n\nThe form will be open until [11:59 PM UTC on June 22](https://www.timeanddate.com/countdown/vote?iso=20240622T1159&p0=1440&font=cursive&csz=1) before we move on to review applications, and we will reach out to those chosen to become new moderators in late June. *Take your time to come up with thoughtful responses, as low effort applications will be discarded.*\n\nIf you happened to stumble across this post without knowing a lot (maybe browsing for subreddits that are recruiting mods), we really want people who are interested in *anime,* and not just the moderator role, since a lot of what we do requires having some knowledge of various series for context. Previous moderation experience isn't necessary, but we're also hoping that applicants are frequent visitors or participants of our subreddit and have at least a general understanding of how it currently functions.\n\nSo if you think you would make a good moderator for [/r/anime](https://www.reddit.com/r/anime), now's your chance! Recruiting new mods is always a very exciting process - [so we hope to see you join us soon!](https://i.imgur.com/f0QsBb5.png)",
        "num_comments": 26,
        "comments": [
            "Seems like a horribly thankless job that only a masochist would take on.  \n\nMods, I salute you...",
            "I brought the CDF regulars.\n\nWe're not locked in here with you.\n\nYou're locked in here with us.",
            "As someone who has been temp banned from /r/anime for quoting a tweet, I will work tirelessly to prevent such bannings, and lobby every day for the return of #fish. Vote for me!",
            "[](#modsalute)",
            "[](#mugiwait)\n\n[](#modsalute)",
            "👍",
            "More mods to abuse, or to do the abusing\n\n[](#modabuse)",
            "Hahaha, lol....",
            "Sure I’m already a moderator in another community so why not this one",
            "Vote Me! I will ensure that there are no bad experiences in our community. r/anime is a place for great topics to have discussions and a great time discussing our respected favorite shows and etc!",
            "I've been banned for harsh choice of words mid-education of other users on this subforum, several times. I know that I logically should, but I'd rather confirm with the establishment - can I still qualify for a moderator privilege?",
            "> a horribly thankless job\n\nI'm pretty thankful for the mods keeping r/Anime a spoiler free zone.\n\nToo many assholes can't contain themselves and forget this isn't r/Manga or /r/LightNovels\n\nPretty easy rule to remember:  ANYTHING source material related goes in the source material corner, regardless of spoiler tags.",
            "[](#healthypasstimes)",
            "[](#modsalute)",
            "It can seem like that at times, but with a subreddit that is as focused as this one, with some genuinely awesome regulars both on the mod and user sides, it can also feel rewarding in its own way.\n\nThis'll sound reductive and dumb, but keeping the place nice feels good. It's the only big anime discussion space (or even Japanese media discussion space in general) that I enjoy participating in regularly and that's largely due to the mods running a tight ship with the ruleset here.",
            "It carries a thin veil of prestige and powers to remove virtual users from a community can be a good incentive for a certain human mindset.",
            "[](#kotohoops)",
            "[](#fishsalute)",
            "What is #fish",
            "We consider every applicant based on the strength of their application and account history. Prior bans can be overcome if you can convince us that you have since grown. However, that would likely require both the bans being years in the past, your recent conversations on /r/anime showing changed behavior, and quite strong writing in your application.",
            "> but keeping the place nice feels good. \n\nThis was a huge part of why I finally decided to apply during the previous round of mod apps. I've been part of the community for so long that I wanted to help keep it a good place in a way I couldn't do as an ordinary user.",
            "[](#fish)",
            "Thank you, I appreciate the engagement."
        ]
    },
    "My Deer Friend Nokotan Streams on Crunchyroll, Prime Video, ADN, Anime Onegai, More": {
        "title": "My Deer Friend Nokotan Streams on Crunchyroll, Prime Video, ADN, Anime Onegai, More",
        "score": 878,
        "url": "https://www.animenewsnetwork.com/news/2024-06-21/my-deer-friend-nokotan-streams-on-crunchyroll-prime-video-adn-anime-onegai-more/.212277",
        "content": "",
        "num_comments": 66,
        "comments": [
            "No idea who distributor REMOW is but feel they hit a jackpot licensing this early",
            "🎵🦌shikanoko nokonoko koshitantan 🦌🎵\n\nDeer sama about to take over the entire community",
            "ABEMA will also air the anime episodes every week starting on July 3, four days before the TV broadcast.\n\nThey have also announced a 24 hour ‘endurance challenge stream’ for the opening, which is currently going on: https://x.com/anime_abema/status/1804350755727642657?s=46",
            "We are not prepared for the peak that is coming…\n\n*Shikanono nokonoko koshitantan*",
            "Either on Crunchyroll or AnimeOnegai, I'm going to watch some Shikkanokonokonokokoshitantan when it airs.",
            "I have a good feeling about this one. Looks funny af.",
            "They know this gonna be popular and licensed on many places",
            "Huh, and here we were worried that it wouldn’t be released anywhere outside of Asia.",
            "r/animecirclejerk just had a collective orgasm",
            "Thanks fucking God , I didn’t want another Girl Band Cry situation ",
            "show looks batshit.  should be hilarious",
            "They know it will be the AOTY 🦌",
            "Thank fuck for that.",
            "It's been a while since Amazon acquired rights on a new anime series. They know!",
            "I love deer girls",
            "How many of you are reading the manga?",
            "it's time to say goodbye to [Dannasama to no Love Love Love Song](https://www.youtube.com/watch?v=y4mHrBndN4c) and welcome the new brainrot of next season; [Shikairo Days](https://www.youtube.com/watch?v=nwuW98yLsgY)",
            "Thank God, they licensed it to Crunchyroll. I'm not gonna lie, but I'm skeptical at first since they licensed Oi Tonbo to Amazon Prime.",
            "Oh boi, the deer is here!",
            "This is how you do it. License it as much as possible will be the best for widespread reach.",
            "From the little I know I’m making the bold prediction this will be the anime of the summer season",
            "Wished Pop Team Epic was this popular.",
            "Also a [new 17 seconds PV](https://www.youtube.com/watch?v=u1fGwG8fYxo).\n\nShikanoko Nokonoko Koshitantan! 🎵🎶🎵🎶",
            "THE ERA OF DEER IS UPON US",
            "I didn't read the sub name and thought OP was promoting their streamer friend.",
            "Oh thank God it's on Crunchyroll, I don't have to sail the high seas for this one",
            "If you have not read this, you have no idea what youre in for.",
            "I'll watch it when its done.",
            "Any boy from Lucknow for friendship i am also boy how also watch' anime dm me",
            "Kinda curious wether it'll become more viral or fall off when the anime drops.",
            "Can't wait for peak deer shenanigans ",
            "I'm glad Crunchyroll has acquired peak! I think it'll be the biggest thing for them this season!",
            "How soon will the Shikanokonokonokokoshitantan Rule 34 content be released onto the Internet?",
            "They’re really new, they did the English dub for Migi & Dali and was the licensor for Ooi Tonbo! which they got put on Amazon Prime with little fanfare and that’s about it. Seems like they might be Latin America facing, or at least they have a whole website dedicated to Latin America, maybe they’ll be who sub-licenses the HiDive content that HiDive won’t release in Latin America.",
            "> No idea who distributor REMOW is but feel they hit a jackpot licensing this early\n\nThey're a consortium distribution company founded by Shueisha and [this article postulates](https://news.animenomics.com/p/sony-builds-an-empire-in-the-anime) it was a Sony countermove:\n> Shueisha founded the anime distribution company REMOW in 2021 with a consortium of smaller investors. Several Shueisha executives sit on its board. Notably absent from REMOW’s list of investors are Sony Group companies, though REMOW tells Toyo Keizai it is not seeking distribution agreements that exclude Crunchyroll. “Sony is too powerful. A monopoly is something to be feared,” says one Shueisha executive.\n\nThey also have the [Anime Onegai brand and service](https://remowlatam.com/remowlatam-en/noticias/) which is a rising star in Latin and South America.",
            "That video has made it impossible to ever forget that name.\n\nEdit for the unenlightened: https://youtu.be/dCEMSaho0io?si=yYLelyf-9sYwuj7H",
            "*dances confidently in front of a deer intensifies*",
            "goSHIKAn't wait to watch it!!~\n\n**dramatic orchestral piece**",
            "> Deer sama about to take over the entire community\n\nAmusingly, airing the same day as the Tokyo Gubernatorial election. I wonder how many write-in votes they can expect?",
            "Proud to say I've been invested on this anime since day zero 🗣️🗣️",
            "I've seen a couple of the manga readers describe it as \"shitposting, now with a budget\". I literally do not need a single further detail, I'm completely sold.",
            "Or maybe the Japanese way of streaming everything everywhere is finally catching on in the west.",
            "Actually Tonbo from this season, which nobody is watching, but granted neither Tonbo or Nokotan are Amazon licenses, it seems they just have a deal with Remow to stream their series\n\nRemow is the licensor here, all other ones are sublicenses",
            "I'm surprised that they did a dub that was released on Crunchyroll. I thought they were going to go all in-house once they finish their series that are dubbed in LA. That's cool. I hope their dub quality improves so there's more options besides Crunchyroll and whoever Netflix or Hulu hires.",
            "honestly one hell of a marketing play.",
            "*Waits 30s before closing tab.* ^(Youtube counts as a view)",
            "A member of the Real Akiba Boyz (oktaku-themed anisong-breakdancing group) recently did an [insane stream where he danced for 1 hour straight to that.](https://www.youtube.com/watch?v=UlyhKz6kU_Q)",
            "For anyone with a VPN too much time on their hands ABEMA is currently doing a 24h stream of that lol.",
            "SHIKAtaganai ne!",
            "> which nobody is watching\n\nRIP I’m nobody.",
            "Yep as much as I love dubs it can get tiring hearing the same voices over and over.\n\nFrieren’s dub was a breath of fresh air with how uncommon the VAs were.",
            "4.4 million views. They have their audience ready and waiting.",
            "memes are a pathway to marketing Anime Studios consider to be unnatural",
            "Definitely! Millions of views for what is effectively a 10 second animation!",
            "Making the actual name of your product into a viral meme is the dream marketing for literally anything",
            "I still can't believe it's an official video. Well played, Twin Engine, well played.",
            "Brainrot already set in before the first episode.",
            "Is it possible to learn this power?",
            "\\*for what is effectively a 10 second animation ***they already made for the first trailer anyway***.",
            "Imagine if the anime turns out to be a dry and serious allegory laced with niche references to Japanese political history.\n\nJust as an ultimate troll.",
            "not from Sunrise",
            "Isn't it part of the OP?",
            "They animated Gintama though",
            "The song? Yes\n\nThe animation? No, it seems to be from an episode without the song, if the [first trailer is to be believed](https://youtu.be/LNvvEu-fJxE?t=69).",
            "That's on me; I forgot that era of Gintama."
        ]
    },
    "Boku no Hero Academia Season 7 • My Hero Academia Season 7 - Episode 8 discussion": {
        "title": "Boku no Hero Academia Season 7 • My Hero Academia Season 7 - Episode 8 discussion",
        "score": 186,
        "url": "https://www.reddit.com/r/anime/comments/1dlrwpq/boku_no_hero_academia_season_7_my_hero_academia/",
        "content": "*Boku no Hero Academia Season 7*, episode 8\n\n\n\n**Reminder:** Please do not discuss plot points not yet seen or skipped in the show. Failing to follow the rules may result in a ban.\n\n---\n\n**Streams**\n\n*None*\n\n**Show information**\n\n* [MyAnimeList](https://myanimelist.net/anime/54789/)\n* [AniList](https://anilist.co/anime/163139)\n* [AniDB](https://anidb.net/perl-bin/animedb.pl?show=anime&aid=17931)\n* [Kitsu](https://kitsu.io/anime/47232)\n* [Anime-Planet](https://www.anime-planet.com/anime/my-hero-academia-7)\n* [Official Website](https://heroaca.com/)\n* **/r/BokuNoHeroAcademia**\n\n---\n\n**All discussions**\n\nEpisode|Link\n:-:|:-:\n1|[Link](https://redd.it/1cjw8y4)\n2|[Link](https://redd.it/1cpdo1i)\n3|[Link](https://redd.it/1cutbes)\n4|[Link](https://redd.it/1d08bh8)\n5|[Link](https://redd.it/1d5j8yk)\n6|[Link](https://redd.it/1daz2uv)\n7|[Link](https://redd.it/1dge3hy)\n8|[Link](https://redd.it/1dlrwpq)\n\n\n\n\n\n\n---\n\n*This post was created by a bot. Message the mod team for feedback and comments.*\n*The original source code can be found on [GitHub](https://github.com/r-anime/holo).*",
        "num_comments": 65,
        "comments": [
            "# Source Material Corner\n\nReply to this comment for any source-related discussion, future spoilers (including future characters, events and general hype about future content), comparison of the anime adaptation to the original, or just general talk about the source material. **You are still required to tag all spoilers.** Discussions about the source outside of this comment tree will be removed, and replying with spoilers outside of the source corner will lead to bans.\n\nThe spoiler syntax is:\n`[Spoiler source] >!Spoiler goes here!<`\n\n# **All untagged spoilers and hints in this thread will receive immediate 8-day bans (minimum).**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/anime) if you have any questions or concerns.*",
            "Love that Dabi's biggest complaint of Shoto is how despite being his brother and Endeavour's son he chose to make friends in UA instead of training hard alone.\n\nIt's also telling that before the tournament with Deku, Shoto too had one goal of becoming stronger than his dad at any cost.\n\nThanks for coming to my Ted Talk \"Todoroki family and their genetic urge to be the last man standing\"",
            "“This week on *Keeping Up With the Todorokis*: Local man is literally too angry to die”",
            "I honestly kind of pity Dabi. He couldn’t control his powers and it almost killed him. Imagine being hurt by your own body… wtf. All the guy wanted was to make his dad proud. Straight up broke him and now he’s literally driven by rage and resentment. Endeavor really made a monster. \n\nShoto was getting his ass beat so bad he had to do a little mid action monologuing/soul searching to fight the guy haha. Guy’s fueled by the Power of Friendship too. It’s the most OP quirk lol.",
            "Endeavor messed up Toya’s mental state so bad that even All For One gave up on manipulating him. Even the Demon Lord himself couldn’t penetrate the hold that Endeavor had on Toya’s mind. Says a lot. Endeavor may not have been able to surpass All Might, but he was able to surpass All For One at one thing: fucking up a kid’s mind.\n\nAnd we also get confirmation that Dabi saw his endeavor against his family as a suicide mission. He doesn’t value his life at all because he has been conditioned to see himself as a failure because he wasn’t able to fulfill the purpose of his birth. Endeavor neglecting him after giving him so much attention when drilling into him how important surpassing All Might was only served to make Toya feel like his existence was pointless. \n\nShoto vs. Dabi essentially operates as a more extreme Deku vs. Shoto. He’s trying to get Toya to cool down and stop him from killing himself and hurting others, and he does that by fully accepting himself by uniting both sides of his quirk. Instead of constantly putting a dividing line between his mother and father, he embraces all of himself to complete his quirk. He’s created a unique technique that is perfect against fire users. The development of Shoto’s cold flames is interesting to theorize about as he improves his Flashfire Fist: Phosphor.",
            "* [**Dabi Stitch**](https://i.imgur.com/MZtJ0xI.jpeg)\n\n[Watching Toya burn himself alive](https://i.imgur.com/PtOOipd.jpeg) because of his Quirk and seeing [what was left of him](https://i.imgur.com/8gxnJ4u.png) once the flames have gone out was just too depressing. I know Endeavour is now paying for his sins but seeing what his abuse has turned Toya into makes me feel like it's not enough. \n\nSo if I understood this correctly, Toya is supposed to be a backup for All For One just in case Shigaraki didn't work out but [because Toya is so fixated on Endeavour](https://i.imgur.com/B7u4e39.png), he wasn't able to control him and they just gave up. Also did [Toya burn down that orphanage?](https://i.imgur.com/yo0lImU.jpeg) Christ. Those kids are fucked anyway since they were all going to end up as All For One's pawns. \n\nNot gonna lie, [watching Dabi go completely wild against Shoto](https://i.imgur.com/3FVRqMp.jpeg) was pretty damn cool. Not as cool as [Shoto's new power though.](https://i.imgur.com/xeXeb37.jpeg) That's [one big baddie down!](https://i.imgur.com/MSApncz.jpeg) I'm guessing that Dabi is still alive? I don't think Shoto went into that fight wanting to kill his brother unless it was the last resort.",
            "That's what you get AFO when you try gas lighting a traumatized pyromaniac, an explosion.\n\nWhile it was terribly sad that those poor orphans were stuck between becoming Nomu experiments and a Dabi cremation, Mr. Sunny's face when he realized he didn't want that smoke was hilarious.",
            "Shoto's ultimate move, sponsored by Katy Perry",
            "Last episode suffered with excess recap padding at the start for the sake of this episode to have ideal pacing of manga content without that additional padding.",
            "Colours were popping out this episode. Loved the animation!!",
            "I gotta say, this episode was really hot.",
            "Man wtf was Iida doing there? Why was he going against Dabi if his quirk is vulnerable to overheating? Kinda lame that he didn't even do anything.",
            "Honestly, Dabi's flame should be green than blue...",
            "I have not read the manga but this episode had a lot of chances to have a more spectacular fight. Endeavour fighting the Nomu is one of my favourite battles, the musical theme adds to the flavour, and I was kinda expecting the same \"body falling apart\" epicness levels here (actually, how Dabi degrades is top).\n\n\n\nIt is an okay episode though and the added context for Dabi is also entertaining.",
            "I wonder how long before anime industry moves on from this flashbacks during mid fight things. Like yes this was an overall great episode but id be lying if i expected a much longer fight than what we got.\n\nI was expecting Deku vs Todoroki or All might vs All for one or endevour vs nomu level of action since they dedicated an entire episode on this fight and even relesed a special key visual for it. But like 80% of the episode was internal monologe, flashbacks and charging up the power and talk between two brothers.\n\nAgain, i dont mind these things but the ratio between these things and the actual fight is not right. If you are gonna spend that amout of time building up these two charachter's fight, atleast make it worth it and dont end it in 2-3 moves.",
            "Not only Toya was saved by AFO but he could have been \"another\" Shigaraki if AFO had managed to reach out to him. The special \"privileges\" he seemed to enjoy when he first joined the League of Villains also make sense now. How many other kids have gone into Dr. Garaki's grinder... (I think back about the mini Nomu)\n\nThat Mr. Sunny looked so idiotic and creepy at the same time.\n\nI once wondered how things could have changed if that day Endeavor went to Sekoto Peak, and now, what if he noticed someone was watching his brutal training of Shoto, not realizing he was, right that moment, causing Dabi to be born?\n\nShoto managing that special move is symbolical of him reaching inner peace.\n\nAlso, a naked Iida wasn't in my cards.",
            "I wish Endeavor was here instead.",
            "I did not need to see Iida’s booty cheeks ",
            "Where is the episode out?",
            "[removed]",
            "Every shot of Dabi looked so badass",
            "Was expecting more animation wise.\n\nGuess their budget went to other episode(s).",
            "Animation was kind of a let down. Wish they went all out but ig it was decent enough",
            "That beating Dabi gave Shoto was insane lol. Dude is an AWFUL brother. He’s truly proof a tragic backstory doesn’t mean you aren’t pure evil, he literally endangered, if not killed those other kids burning down that orphanage. Ultimately, all what matters to Dabi is what HE wants, everyone else be damned.",
            "Had to sneak in a bit of fan service to keep things from cooling down.",
            "omg, that final attack, the animation, the sound, the whole scene, is just art\n\ncant wait to see more",
            "Keeping up with the Todoroki’s is BY FAR the best plot in the story\n\n- Dabi seeing Endeavour training Shoto even after 3 years basically made Dabi think \nEndeavour “oh no my son died….. anyway Shoto back to training.”\n\n- Dabi praying to his own alter was some next level imagery. Endeavour believes he killed Toya when Dabi was the one who figuratively killed Toya in the end. \n\n- As Endeavour always watched All Might, Dabi always watched him.  They both are so determined to reach their goal and will do anything to attain it. Dabi inherited Endeavour’s drive but he also inherited his demons.\n\n- Dabi was too angry to die but now he’s too angry to live.  He joined the League of Villains cause it’d be the best spot for his death.  \n\n- Shoto calling Dabi out; he understands him more than anyone in this world but he must atone for the sins he’s committed\n\n- Dabi was so insane and traumatized that even All for One didn’t want him. He was probably thinking “you broke this child more than I ever could, how did you possibly do that.”",
            "I get they didn't expect dabi to live long, but you'd think if AFO cut his loss on the kid and the guy still pops up one day maybe actually kill him this time since he can't be controlled you know. The guy even said straight up I'm on a suicide mission and they still kept him around?  I'm sorry league of villains y'all deserve everything that y'all get for this dabi oversight.",
            "I’m not gonna watch this",
            "Dabi is just built different.",
            "\"This week's guest ~~victims~~ stars: A building full of Orphans!\"\n\nEndeavor sweating: *Mannn this guilt receipt keeps getting longer.*\n\nHawks #1 Endeavor fanboy: \"But look at it this way Endeavor! You saved them from AFO!\"",
            "Pity is the right word. My sympathy for him was burnt down alongside that orphanage. He almost certainly killed several of those innocent kids, who were just as much victims as him. Furthermore, he acknowledged the things he did/said to his family was awful, even if he had more reason to be pissed at Endeavor, there’s no reason to be okay with killing then for his goal.  \n\nTodoroki said it perfectly, he wasn’t groomed like Shigaraki or anything like that, choosing to murder was his own decision.",
            "every quirk can be OP when asspulls come into play\n\nwe already had Toga dragging a 40% OFA Midoriya by yandere love and now we have a supposedly dying kid survives by pure hate and his body still doesn’t manage to rot away or turn into ashes\n\nstay tuned for Inside Out 3",
            "\"I will make sure it mingles\" in the end is a line that goes too hard!",
            "“He was able to surpass All For One in one thing; f—king up a kid’s mind”. \n\nAs hilarious as this is, I’ll say it again, Dabi is way more terrifying than Shigaraki. Shigaraki is evil but a traumatized kid lashing out at the world. Dabi is actually a sociopath, he sees the League as tools and despite Shoto and Natsuo going through similar abuse, he is 100% okay if they die if it means more revenge on Endeavor.",
            "AFO and the doctor burned the orphanage down, Toya lashed out and dipped, but he did not burn anything else and no one died from the fire.",
            "I mean Shoto himself points out Endeavor was a madman but Dabi turned into Dabi because of his own decision. Endeavor may be an abuser but Dabi is literally trying to slaughter his innocent younger brother and was outright disappointed that Natsuo wasn’t murdered. \n\n We can blame Endeavor for the circumstances leading to Dabi but he or even AFO didn’t turn Toya into Dabi. Toya turned himself into Dabi.",
            "Mr. Sunny got turned into a literal sun, no way he didn’t get cooked alive ",
            "Dabi dramatically slumps to the ground, while Shoto, physically and emotionally wounded and winded takes a breath-and then hits Dabi with a [California Girls Smash](https://www.youtube.com/watch?v=S20G14W7Hjo).",
            "Ideal pacing? What do you mean? It was literally all flash backs and back story. There was barely any real fighting or anything happening. Just a lot of still shots and talking and emotional bullshit.  \n  \nEdit: please continue down voting me for expecting some action and story progress in a Shonen Anime that's in its seventh season.",
            "seemed pretty cool to me though",
            "He'll play a more important role later, with probably his best feat.",
            "Iida sitting down with his agent: \"So I hear this episode is pretty hype, do I get to fight?\"\n\nHis agent: \"No but we get to show your ass.\"\n\nIida: \"What the fuck?\"",
            ">Also, a naked Iida wasn't in my cards.\n\nLolololol. I did a double take and was like wow did they just flash us some Iida fan service in the middle of this episode hahahaha.",
            "Found Dabi's burner account.",
            "Toya is that you!?",
            "I feel you man. Had the same reaction to the bath scene last season.",
            "Bilibili Global I think, earlier. Its out on CR now.",
            "Hulu usually drops right at 5:30 AM EST. Crunchyroll runs a little later.",
            "Sorry, your comment has been removed.\r\n\r\n-  This belongs in the Source Corner at the top of this thread. In discussion threads for currently airing anime, discussions about source material, spin-offs, mangaka comments and unadapted content must be posted there, and not outside it. This applies specifically to comparisons to the anime or hints about future events, even if such hints are vague. Please note that you still have to tag your spoilers in the source corner.\r\n\r\n\r\n\r\n\r\n\r\n---\r\n\r\n^(Questions? Reply to this message, )[**^(send a modmail)**](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)^(, or leave a comment in the )[**^(meta thread)**](https://reddit.com/r/anime/search?q=subreddit%3Aanime+author%3AAnimeMod+title%3A%22Meta+Thread%22&restrict_sr=on&sort=new&t=year)^(. Don't know the rules? Read them )[**^(here)**](/r/anime/wiki/rules)^.",
            "They definitely saving their budget for the crazier fights.",
            "I can guess which one. Still enjoyed it more than Deku vs Shiggy last season. Voice acting was pretty good.",
            ">Guess their budget went to other episode\n\n\\*animators. \n\n\"Guess their top animators went to other episodes\"",
            "Surprisingly still more consistent than S6. At least, I imagine they are increasing the direction to match the quality of earlier seasons and are saving up animation budget.",
            "Begone then.",
            "It wasn’t explained in the anime, but Horikoshi clarified in the manga extra that it wasn’t Dabi who burned the orphanage, it’s the doctor who burned it down to avoid the suspicion.",
            "With now new emotions: Horny and Emo",
            "Good point, None of Endeavor’s other children decided to go on a murder spree. Even when we saw Dabi as a kid he could care less about his brother and sister who loved him. Then he tried to kill baby Shoto. Dabi was already mentally unstable. The abuse just made it worst.",
            "That's what these chapters were though. Lots of emotional talking. That's most of Todoroki's fights.",
            "You can feel how you feel about the episode content from the manga, but I'm talking about anime **adaptation** wise. \n\nAs I said already specifically about **recap** (recaping events of previous episode) itself. The backstory flashbacks in the episode have new content, not extended recap stuff like usual.",
            "Have to agree.\n\nBut that would be fine as long as the action bits had good animation which they didn't.\n\nIt was decent but nothing special.",
            "I would hope top animators get paid more.\n\nMore money = more budget.",
            "Consistent sure but I expect for big moments like this they'll get at least some sakuga",
            "Okay looked it up and slight correction, the flames were easily put out and the doctor blamed the Sun dude for it. It seems the anime just changed it to make it look like the suns due got cooked."
        ]
    },
    "Sound Check [Girls Band Cry]": {
        "title": "Sound Check [Girls Band Cry]",
        "score": 862,
        "url": "https://v.redd.it/zmohk229f08d1",
        "content": "",
        "num_comments": 58,
        "comments": [
            "Even better with the context of Rupa slapping out the bassline to their rivals song that she only just heard earlier that night",
            "Subaru saying \"Hey haaa...\" is cute",
            "I think i may watch this",
            "What Rupa, the bassist, is playing was the song they just heard their rivals play for the first time just hours ago, she memorized it and played it here to flex. They are right to be smug about it, she is a genius.\n\nHere is the OG song : https://www.youtube.com/watch?v=ZIeU5ZAEQ-0",
            "Its been a week since this released and I still think this was my single favorite episode of anime I've ever watched. After today's ep, I feel more confident in an S2",
            "This clip is going to knock down the discussion thread from the top, isn't it.\n\n[](#azusalaugh)",
            "I tend to not like 3D animations in animes but that's really above average actually, I liked it!",
            "\\^u\\^  \n  \nShe is so cute",
            "I knew this one would be here soon. It's too amazing a clip not to be front page material. Such an animation flex!",
            "The fanservice we all wanted.",
            "Rupe is a menace, better watch out!",
            "whoever does rupa's bass is extremely talented. lord",
            "Awesome!!",
            "Is there still no way to watch this legally in the west? I really want to watch this show but I've become lazy to pirate stuff.",
            "The bassist sounds exactly like suisei from hololive",
            "At 0:43 it feels like every anime studio uses the same robotic walking animation some intern made years ago.",
            "Woah this looks sweet",
            "Tittle",
            "I fucking love this scene, but god, i cant stand Subaru's snare sound in this performance",
            "Rupe giving me some goosebumps! <(0_0<)",
            "This show looks so fun I hope we get it legally in the west eventually.",
            "Where can I watch this show?",
            "There’s been 6 clips released this entire week. How many this month jesus ",
            "The CGI still looks weird",
            "hear song, drink beer, play song. best girl.",
            "The idea that Rupa is the most dangerous member gets more and more traction every episode.",
            "[Or is it...](https://preview.redd.it/nina-trying-out-asmr-girls-band-cry-v0-saxzxlgztc7d1.jpeg?width=640&crop=smart&auto=webp&s=4df0aa66c23a0f91bde5b16f76cde95314992f05)",
            "I watched all twelve available episodes today and really enjoyed it.",
            "And you definitely should",
            "Good luck.",
            "will there be a s2? usually anime originals have definite endings, although I have no idea how they will wrap this up in just 2 eps (haven't watch ep12 yet)",
            "Not to mention the animation matches the instrument playing motion is pretty cool too.",
            "This is like the very best of 3d anime. The expressions sometimes are insanely amazing",
            "I had the same opinion before, but I must say that Girl's Band Cry is really nicely animated, and the facial expressions are really neatly done.",
            "The VA herself. Not sure if the mocap was also done by her.",
            "France is in the west.\n\nIt's available in France.\n\nIt's available in the west.",
            "Literally just an adblocker and google to stream, not sure how difficult it is. ",
            "Still no way",
            "[removed]",
            "Eh, shows almost done airing, it should slow down soon.",
            "Almost like the anime is currently airing.",
            "Another day, another GBC clip. Better get used to it cause reddit loves this show",
            "hand movement on the bass fret are accurate",
            "WTH IS THIS??? Context pls",
            "Is it on crunchyroll?",
            "This isn't a typical anime original. It's made effectively to promote a real band and is somewhat similar to Bang Dream in concept. So if it's profitable enough I don't see why not.",
            "This post has been removed.\n\n- Links to or other obvious direction toward pirate, illegal, or unofficial anime content are not allowed.\n\n  This includes links to unofficial translations/scanlations of light novels, visual novels, and manga, unofficial anime streams, torrent sites, unofficially uploaded full OSTs, and images and video containing watermarks from any of the previously mentioned websites.\nLeading others to illegal streams or torrents includes **explicitly mentioning specific streaming/torrenting sites**, offers to send users illegal content, and leading to proxy services to circumvent licensing. In addition, proxy services are also forbidden.\n\n  Additionally, images and videos containing watermarks of the previously mentioned website are also forbidden.\n\n  Repeated violations of this rule will result in a ban.\n\n---\n^(Have a question or think this removal was an error?) **[^(Message the mods.)](http://www.reddit.com/message/compose?to=%2Fr%2Fanime)**  \n^(Don't know the rules? Read them )**[^(here)](/r/anime/wiki/rules)**^.",
            "Its fanart of her doing suggestive ASMR with Nina, she's just saying the same things she did during the mic check",
            "It wasn't picked up for streaming outside Japan. Isn't a legal way to watch it right now.",
            "I came to this post to ask if the anime was that good for receiving so many posts in the last few weeks, or if it was some kind of ad campaign.... Seems like the answer is \"both\" xD\n\nHonest question here, I am not much of a \"band\" anime fan, but I enjoyed Kongming and Bocchi for both the humor and the story, but didn't like Oshi no Ko (sacrilege, I know), would you recommend this one?",
            "Wanna go sailing?",
            "This show is basically angry Bocchi, would recommend.",
            "If you already like band animes, it's definitely worth checking GBC out",
            "Yo ho motherfuckers",
            ">angry Bocchi\n\nYeah, I can't picture this in my mind, seems like I'll **have** to check it out to satisfy my curiosity now xD\n\nThanks for the answer man!"
        ]
    }
}