{
    "SABADO DE PREGUNTAS BOLUDAS": {
        "title": "SABADO DE PREGUNTAS BOLUDAS",
        "score": 3,
        "url": "https://www.reddit.com/r/argentina/comments/1dlrfh7/sabado_de_preguntas_boludas/",
        "content": "Boludo el que boludea\n\nEntra a nuestro [Chat](https://chat.reddit.com/room/!hSSQyOrLT-ahufrqRuBANA%3Areddit.com) y charla con la comunidad!",
        "num_comments": 17,
        "comments": [
            "Qué ideas les harían decir esto?\n\nhttps://preview.redd.it/x39rqls9248d1.jpeg?width=1079&format=pjpg&auto=webp&s=4063418bda8345f4c6754e87f9c933fb131c5238",
            "Pregunta boluda, en el verano me rape y desde marzo creo que me estoy dejando crecer el pelo, puede ser que me este creciendo con menos \"fuerza\" o \"volumen\" de lo normal? o es normal cuando es pelo nuevo. Hace mucho que no tengo el pelo largo y ahora que lo pienso nunca me deje crecer de 0 a largo de una siempre iba como cortando las puntas/flequillo de a poco. Sera por esto que lo veo menos voluminoso?",
            "Ustedes que hacen primero: \n\n1. Desayunan y después se lavan los diente\n\n2. Se lavan los dientes y después desayunan",
            "Vivimos una crisis mundial de soledad?\n\nLos dejo que me contesten mientras me voy a pasear sólo a una playa alejada de todo tipo de humanidad.",
            "\"Queres adoptar otro animal?\"",
            "\"Compralo, está muy barato y capaz después sube\" ",
            "Ni idea, pero te recomiendo que tomes aceite de pescado en cápsulas.\n\nA mi me hace muy bien al pelo, mejor grosor y que se caiga menos de lo habitual (y estoy seguro que hace que me crezca más rápido).",
            "Desayuno, almuerzo, meriendo, ceno y me lavo los dientes",
            "Opción 1. Para que me voy a lavar los dientes si a los 2 minutos se ensucian con el café. Aparte el gusto no es el mismo",
            "La única respuesta correcta es la 1.",
            "Al mear me pero una enjuagada para no andar con tanto aliento a muerto, desayuno y después cepillar como dios manda ",
            "Si, pero nunca tuvimos tantas herramientas para mitigarlo. 🤷🏻‍♂️",
            "Na, solo los rediturros somos bóludos que no saben socializar y estamos condenados a la soledad si no hacemos nada al respecto para prevenir eso ",
            "que asqueroso. Todavía tenes todos los dientes??",
            "¿A qué te referís? ¿Tecnología?",
            "Me falta uno, fue por un error del jodido odontologo",
            "Almohadas con imagenes de personajes de anime o de chayanne"
        ]
    },
    "Sábado de No Acepto Críticas": {
        "title": "Sábado de No Acepto Críticas",
        "score": 3,
        "url": "https://www.reddit.com/r/argentina/comments/1dlrfz6/sábado_de_no_acepto_críticas/",
        "content": "Tirá tu top 3 de verdades controversiales cortitas y al pie -sin faltar el respeto- que a más de uno le zafaría un tornillo, solo que acá no va a haber lugar a críticas!",
        "num_comments": 4,
        "comments": [
            "1- Reddit se volvió una seudo Taringa y es una mierda porque perdió toda seriedad. Hay puros posts troll o pajeros o para farmear karma, lo detesto.\n\n2- Es una mierda que los subs argentinos se hayan polarizado para un lado u otro, dejando a quienes no somos de ambos extremos como parias y sin lugar para expresarnos.\n\n3- Me hartan los posts con preguntas idiotas o los que se hacen los filósofos modernos.",
            "Cuando alguien te dice una de estás 3 frases, se delata de que hizo algo muy malo y no se quiere hacer cargo.  \n  \n1- Los que me conocen saben como soy.\n\n2- Antes que nada quiero aclarar que siempre fui una persona muy tranquila.\n\n3- Yo me considero una buena persona.\n\n\n\nBonustrack de p2: Me sorprendiste, sos muy maduro/a para tu edad.",
            "Decís no ser de ningún extremo y tus comentarios no dicen lo mismo. Si te jode andate del sub o de reddit.\n\nSaludos de un troll.",
            "En cierta medida, validás lo que dice con tu comentario. Y le faltó el /s"
        ]
    },
    "Buen momento para ver La sociedad de la nieve": {
        "title": "Buen momento para ver La sociedad de la nieve",
        "score": 323,
        "url": "https://v.redd.it/68g7a785s08d1",
        "content": "",
        "num_comments": 101,
        "comments": [
            "El uruguayo que tenés sentado al lado. 👨‍🍳",
            "Me pasó yendo a santa cruz, una mina se puso a gritar como loca \"dios ayúdanos señor, dios todo poderoso\" y en mi cabeza lo único que pensaba era: esto es lo último que voy a escuchar, una vieja pelotuda.",
            "Reza Malena! Reza!!",
            "faltó un payaso en el ala, ayudan a mantener el equilibrio circense...",
            "Aerolíneas Argentinas: esto es culpa de milei",
            "yo llego estar ahi y me infarto jajajaja",
            "No entiendo la gente que grita o se asusta con la turbulencia. No podes hacer nada, está fuera de tu control. Yo me quedo mirando una peli, si el avión se cae por lo menos me mori mirando una buena peli o serie.",
            "No soy de tenerle miedo a volar pero siempre que veo rebotar el ala me da cosa\n\nhttps://preview.redd.it/q0acol7ja18d1.jpeg?width=177&format=pjpg&auto=webp&s=673ddb4cced85c01fd9896b2d63f290148c6af85",
            "WOOP WOOP\n\nSTALL STALL\n\nSTALL STALL\n\nWOOP WOOP\n\nTERRAIN TERRAIN\n\nPULL UP PULL UP",
            "Vi el partido de chile-peru,me dieron ganas de estar ahi",
            "nada da mas seguridad al volar que ver un ala moviendose asi sin romperse.",
            "Cero drama, si ves un auto en una calle con baches la suspensión va trabajando a lo loco y no te da miedo de que se vaya a partir el chasis. Esto es lo mismo, la flexión del ala es normal y si bien se ve impresionante no es peligroso.",
            "Por que las mujeres siempre tienen que gritar? Jamas vas a ver a un tipo gritando en esta situación. Es increíble",
            "Pendejo ni aguanta nada: el avión.",
            "Con los Chilenos siempre hay turbulencias, nada nuevo",
            "Que belleza boludo, ojalá algún día me toque experimentar eso",
            "Las fuerzas del cielo son fal....\n-las fuerzas del cielo:",
            "Yo no me subo a un 737max ni en pedo",
            "cuando viaje por primera vez en avion me queria matar, aveces parece que el avion baja 20 pisos de un azote, pero se supone que es el medio de transporte mas seguro del mundo asi que lo mejor es depositar toda la energia en confiar y tratar de calmarse con eso",
            "Todo es risas hasta que lees un estudio muy serio que advierte del aumento de turbulencias severas y condiciones muy adversas para la aeronavegacion debido al cambio climatico.",
            "Dato de color:en los aviones comerciales mas nuevos, las alas estan diseñadas para soportar un angulo de flex similar al de una banana sin quebrarse.\nEn resumen, no, no porque las alas esten temblando un poco quiere decir que ya te tenes que preparar para un impacto, es normal, mucho peor seria si las alas se quedaran rigidas.",
            "fua mira lo que esta esa tenacidad papa!",
            "Me da ganas de cagar a piñas al que grita, como si solucionaran algo haciendo eso, literal lo que yo haria es decis \"ay... que desgracia puta, me cago en la mierda\" y seguiria viendo la ventanilla mientras cae el avion, y antes de que choque cierro los ojos.\nLo digo porque cuando me subi por primera vez a una montaña rusa eso es lo que hice cuando empezó a bajar, cerre los ojos y deje fluir todo, sin decir nada",
            "Más allá que entiendo el punto, esa maquina no tiene punto de comparación con la batata que viajaban los urguayos.",
            "A mí lo que más me preocupa sería estar ahí.\nNo, no me refería a la turbulencia, sino dentro de un Boeing 737 Max",
            "Fui dos veces a Chile en toda mi vida por avión, menos mal que las dos fueron mucho antes de ver la Sociedad de la Nieve jajaja (igual mi trauma con los aviones ya era Destino Final 1 en ese momento)",
            "No entiendo mucho del tema, pero porque el avión tiene esas flechas en el ala?",
            "Me encantan esos captions que derrochan sesgo.\n\nSegún quien? Una azafata? El copiloto? Datos de la oficina de control de turbulencias de AA?\n\nMedido de que manera? Decibeles de los gritos de las viejas?",
            "Parecen que están disfrutando las minitas que gritan",
            "Hace años era muy raro encontrar turbulencias en los vuelos y ahora último en todos los vuelos hay más turbulencias supongo que 🤔  algo debe estar pasando",
            "Dicen que uno de los \"efectos\" del cambio climático que están descubriendo, es que aparentemente está incrementando las turbulencias que ocurren, haciéndolas mucho más recurrentes y fuertes, y creen que incluso podría alterar todo el transporte aéreo en un futuro.",
            "esa ala parece de carton lpm",
            "Wow, Dios los cuide",
            "se mueve como papel esa ala, que miedo",
            "y la verdad que con el desfinanciamiento que le estan pegando ya es un milagro que vuelen los aviones de aerolineas",
            "\"Hoy se come familia\" 😏",
            "Jajajjsja hijo de puta largué la risa",
            "https://preview.redd.it/pjd1glbp418d1.png?width=720&format=pjpg&auto=webp&s=27803604b0e8de73317ab6bda7656fad05f86d44",
            "![gif](giphy|ckw8EbI8Ak9YQ)",
            "\"se empieza a poner el delantal y el gorro de chef\"",
            "Es q tiene q gritar pq no se escucha con el ruido del avion.",
            "Para el pasajero el avión se cae pero creanme que aguantan a un nivel que nunca vas a experimentar.\n\nCon que te diga que pueden seguir volando con un 1/4  del ala faltando o daños al fuselaje o motores te debería tranquilizar. Obviamente es extremadamente improbable que ocurra pero bueno, si estudias aeronáutica te das cuenta que las inclemencias meteorológicas son nada.",
            "DIOS LA PUTA MADRE",
            "Con critina no habia turbulencias",
            "Frenó las obras de pavimentación y el cielo está lleno de pozos. Milei hdp",
            "Jsjsjsjsjs ya te gano uno en los comentarios",
            "Para que te de uno se verdad si ves que el ala pasa este punto\n\nhttps://youtu.be/--LTYRTKV_A?si=VbgEA7YtV7qH1X8Y",
            "Se llama pánico. Yo tampoco lo entiendo, pero no se como reaccionaría a esa situación. Dudo que la gente lo haga voluntariamente",
            "interrumpimos la pelicula para transimitir un mensaje en contra del cierre del inca y en contra del gobierno de mil- boom lo ultimo que viste 🤣",
            "Es literalmente pisar un pozo con el auto y los imbeciles gritan, grita si ves que la trompa apunta al piso, ridícula.",
            "El miedo no es racional. Si lo fuera no existirían las películas de terror ni las casas embrujadas porque todos sabemos que no son verdad pero eso no impide que la gente se asuste.",
            "No se va a caer el avión por una turbulencia. Son máquinas diseñadas para soportar mucho, mucho más de lo que se ve en el video.",
            "Depende el avión, por ahí no tiene peli",
            "La situación, se volvió crítica...",
            "lo peor",
            "claro... pero de un auto al piso hay medio metro, de un avión al piso un poco más",
            "Mal, me saca JAJAJA Encima si estás en una emergencia y las minas se ponen a gritar ta complicado concentrarse",
            "Porque son bolsas emocionales",
            "Y si sale un nuevo viaje a Chile, avión si o no?",
            "Chamuyo, no des bola",
            "Si no se moviera así se partiría jaja",
            "Si pareciera de metal no se estaría riendo la chica, estaría gritando en caída libre sobre los andes.\n\nLas alas se pueden doblar hasta más de 30 grados, eso no es nada\nhttps://youtu.be/--LTYRTKV_A?si=VbgEA7YtV7qH1X8Y",
            "Es la idea...\n\nLo preocupante sería que no se movieran así",
            "Si no te pagan por decir semejante ESTUPIDEZ, te recomiendo un cambio de vida",
            "Nada de lo que esta en este video tiene que ver con la seguridad o con el desfinanciamiento de aerolíneas.\n\nNingún piloto y tripulación va a volar en un avión inseguro, estamos muy lejos de los 2000",
            "Ya apareció el tarado que no sabe de aviación a opinar de algo sobre lo que no tiene la más remota idea. Circula pelotudo, circula",
            "mas de 20 años de desfinanciamiento haciendo estragos? \n\nvaya, quien lo diria",
            "Hoy se come, familia\\*\n\nVerdad?\n\nVerdad??",
            "Se robaba hasta las turbulencias",
            "habia turbiolencias",
            "[Boeing acordandose que no hizo la tarea](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQHaS1ONqbwoQpCVLfOQNIax2HAH9XpbbQR0w&usqp=CAU)",
            "Si si es boing ya no hay confianza",
            "Que loco, ni siquiera sabía que se podían mover, mucho menos así..",
            "Te imaginas una montaña rusa sin gritos",
            "Yo creo que agarrar el pozo con el auto es más peligroso",
            "A parte estamos diseñados a sentir miedo es un sistema de alerta lo tenemos en el adn. Los que no sentían miedo se los morfo algún bicho no dejaron descendencia.",
            "Mauricio of culture, I see.",
            "Y... pero estadísticamente, la mortalidad x pasajero es mucho más alta sobre ruedas.",
            "Si se te parte el chasis te matás igual eh",
            "Yyy, un viaje es un viaje, diría que sí aunque por dentro estaría bastante estresada",
            "disculpa loco",
            "bueno disculpa loco, no me pegues",
            "Esa grabación de cabina... Increíble lo mucho que pelotudeaban ni hicieron el checklist completo y el accidente fue por... no poner los flaps y no cancelar el despegue cuando era obvio que no daba para rotación, que en paz descansen, pero que caras de poronga man.",
            "Que tenia que ver con un video de una turbulencia explicame.",
            "😏",
            "Robaba turbulencias pero viajabamos",
            "See, por la punta de las alas es un 737MAX el avión más mortífero de los últimos años jajajajajaaa \n\nTampoco hay que preocuparse taaaaaaanto, esos accidentes son por una razón ya parcheada (de cualquier manera no se como no hay nadie en cana todavía) y los temas que están teniendo hoy en día si son graves pero al mismo tiempo podes ver 24/7 como vuelan cientos de aviones nuevos Boeing sin ningún problema. Si se tienen que hacer cargo de sus cagadas hijos de remil puta pero de igual manera no es para tanto.",
            "Pero con inclusión y diversidad en nuestros empleados bigot!!!",
            "Cualquier cosa te llevas 3 kilos de asado en el bolso de mano x las dudas",
            "Rezate dos padres nuestros y un ave maria por tu ofensa",
            "Estás hablando de LAPA? Lineas Aéreas Privadas Argentinas?",
            "me respondiste a mi",
            "Es un comentario irónico. KJJ",
            "Muy de acuerdo, señor que sabe mucho de aviones. De todas maneras si me tengo que subir a un 737 max siento como una pequeña inquietud por más que racionalmente no tenga sentido",
            "Hay chance de saber en que Avion hace los viajes cada Aerolinea? Pienso viajar afuera y me intriga saber a la hora de comparar precios que avion usa cada empresa",
            "Que tenia que ve",
            "Si, en ningún momento dije que estaba hablando de AA, mi comentario fue una respuesta a \"ya no estamos en los 2000\" en temas de seguridad.",
            "Te lo dice Despegar o cualquiera de esas al momento de elegir el vuelo.",
            "Es la ironía de cuando saltó hace unos meses el lío con las puertas de los 737 Max que se desprendían en vuelo, unos días antes Boeing había sacado videos institucionales con alabanzas a sus políticas de contratación de DEI e inclusión en EEUU.\n\n\nPorque a mi el usuario me importa absolutamente que el personal que diseña y construye un avión sea diverso e inclusivo....no que sean los más calificados para el laburo por más que sean todos de un grupo étnico específico",
            "EEUU se volvió loco, no sé qué cazzo tienen en la cabeza",
            "Uh el quilombo de los door plugs, que hijos de puta."
        ]
    },
    "Malamberos la rompieron en America's Got Talent": {
        "title": "Malamberos la rompieron en America's Got Talent",
        "score": 258,
        "url": "https://v.redd.it/jwhpg44r018d1",
        "content": "",
        "num_comments": 54,
        "comments": [
            "Santiagueño promedio cuando piso los 100 metros de asfalto en plena siesta de enero",
            "danza folklorica Argentina? \"aburrido\", mejor que bailen con las patas prendidas fuego, WOOOOW AHORA SI ES GENIAL!",
            "Todo bien con los malamberos pero el got talent me tiene re podrido boludo. No se como carajo hacen los yankis para bancarse todos los años el mismo programa con los mismos jurados, las mismas reacciones exageradas y las mismas historias emotivas pedorras. Aunque bueno, aca tenemos el bailando todavía, asi que mucho no me puedo burlar de ellos.",
            "https://preview.redd.it/j0zuw8vy318d1.png?width=492&format=png&auto=webp&s=6bf7e56d353aeb30c7a8cdae85752dec3e2f1347",
            "Hay q decirle a Larreta q si hacia esto ganaba las elecciones",
            "Los pibes viajando a USA a competir en televisión \n\nEl redditurro que no mueve las patas ni para buscar laburo: \"hm no sé, bastante mediocre, innecesario el fuego\"",
            "No sé si lloran de emoción o por qué se cagaron quemando?",
            "Jaajaj cuántos resentidos en este thread.  Qué les pasa? Ortivas",
            "![gif](giphy|ouYJHlGXjPbj2)\n\nAlgo así",
            "El capítulo de los Simpsons en el que Ogdenville gana el concurso de bandas porque usaron luces de colores, detalla el comportamiento mersa de los yankis que creen que le suma valor hacer 🌈malambo porteño🌈 con las patas prendidas fuego",
            "Todo bien pero vi unos cuantos errores que estoy seguro que grupos mas preparados de acá no cometerían. Obviamente es en USA y ni van a evaluar eso. Que sigan pa delante",
            "Gauchos criado a chorisant, leche de avellana y empanada en frasquito",
            "Todo bien, pero me parece una ridiculez total",
            "El acto completo con la entrada y final: [https://www.youtube.com/watch?v=N9OkCr8RgbM](https://www.youtube.com/watch?v=N9OkCr8RgbM)",
            "ya lo sabemos malamberos, sus zapateos son increibles. Pero tienen que ver el de Perchita!",
            "Me gusta Atahualpa yupanqui, argentino Luna, y un correntino en pedo buscando al lobizón",
            "Malambo de fuego danza antigua folcklorica argentina, la danza de nuestros ancestros",
            "Me dan vergüenza ajena. Vengan los downvotes",
            "Gringos de mierda. Arruinaron el malambo",
            "Some of the stupidest shit I've ever seen.",
            "Del Malambo más flojo que ví la verdad.",
            "Sin gauchos en bolas y jurados a punto de sacarse ricotta de solo verlos, no puede disfrutarse",
            "pasó el batman argento de miami y dijo que es to much",
            "Demasiado exagerado",
            "El Zorro y sus clones.",
            "Una chacarera???",
            "Cuántos yankees se necesitan para prender un asado",
            "son argentin’t",
            "No entiendo como no se prendieron fuego enteros?",
            "Mamadera, como les gusta la payasada a los del Norte.",
            "Que negrada, ahhh pero tiene fueguito",
            "Que exagerados lo de prender fuego...",
            "Los troleros",
            "Ya tienen unos callos en los pies que los protegen del calor.",
            "Confirmo",
            "\\-No Bailan bien por qué no hay ningún negro en el grupo\n\nhttps://preview.redd.it/hbadc7u4m18d1.jpeg?width=680&format=pjpg&auto=webp&s=5e64dc368b9ce7264673c356e22d1f84cda97017",
            "igual estaria re bien que desde ahora, para bailar malambo, tengas que prenderte fuego, paso de no tener interes a querer ir a ver un show de esos",
            "> aca tenemos el bailando todavía\n\nVolvió el año pasado y no tuvo éxito y se canceló, tan mal le fue que Canal América despidió a todos.\n\nUn mejor ejemplo es Gran Hermano.",
            "es que simplemente son yankis",
            "Vos pensas que la gente mira esto? Desde que salió Netflix y los videojuegos nadie ve los canales de televisión abiertas. Viven de los views en YouTube",
            "\"Los llevaré a casa con mamá \"",
            "Además te asegura que nadie ve tele, cree que la población mundial tiene en promedio 20 años.",
            "Es que igual es todo muy llama___tivo, ok no.\n\n\nMalditos malabemberos arruinaron malambia.",
            "Son argentinos.",
            "Encima seguro que los tiki taka eran de los q tenian el palito en lugar de piolin!!!",
            "Sere un mala onda o no se, pero tampoco me parecio tan \"epic\"  :/",
            "Malambo",
            "Este muñequito está mortal!!! Jajajja",
            "En realidad nadie lo mira",
            "Lo se, obviamente. Mi punto es que acá hay grupos mejores que en USA causarían exactamente el mismo asombro en el publico yankee",
            "Mueven las patitas re rápido y están prendidos fuego!!",
            "Pero no tienen fuego en los zapatos y no se visten todos de negro como el Zorro, no sirven\n\n/s",
            "Pensé que estaban vestidos como rob halford",
            "Yo pensé que era un homenaje a Cerati en su épocas de sombreros.\n\nhttps://preview.redd.it/6su7fm5z328d1.jpeg?width=400&format=pjpg&auto=webp&s=4f8545da28d4ce05ab54856d5b5f24aab0af70f6"
        ]
    },
    "Guerra narco en Mar del Plata": {
        "title": "Guerra narco en Mar del Plata",
        "score": 417,
        "url": "https://v.redd.it/xbom5d3z408d1",
        "content": "",
        "num_comments": 115,
        "comments": [
            "Siempre lo mismo con estos negros maracas, se tiran tiros a 2 cuadras de distancia, disparan mientras corren, etc.. por eso no se muere ninguno, imposible que le peguen a algo, salvo a un inocente.",
            "Siempre me causó mucha gracia la forma que tienen los cacos de correr hacia adelante y disparar sin apuntar. Yo fuí Soldado y estoy seguro que si hacía así con el FAL en alguna instrucción me metían una patada en el culo y 90 días de arresto.",
            "Si campeas desde adentro con sniper investigaran lo suficiente para mandarte al frente?",
            "Por qué el que graba no carroñea la kill? estaban regalados",
            "Nada de celulares ni tablets, solo jóvenes viviendo el momento.",
            "Muchos tiros y pocos fiambres .. típico de estos enfrentamientos de narcos de cabotaje...",
            "Tira cohete tira cohete",
            "Che pero guarda que van a vender armas por ML ahora ehh",
            "Les fallo el aimbot. He visto literalmente un simio con metraca qué dispara mejor.",
            "La puta madre. Se van de Rosario a Mardel? Dejenme en paz la c*ncha de la lora. Vayan a Santiago o por alla. ",
            "Narco? No llegan a transa esos",
            "En tucumán era moneda corriente esto hace unos años por la zona de villa 9 de julio con un par de muertos, entre propios y ajenos, al mes...no se si se calmaron, si arreglaron por matrimonio, si ganó un bando o si simplemente dejaron de informar, pero no leo nada hace rato al respecto y estoy seguro que no es que la cana hizo algo.",
            "- casi me rompe el cogote\n- disculpa wacho",
            "loco pero nunca en su puta vida jugaron un cs o callofduty, se que son jueguitos chotos pero por lo menos te dan la minima nocion, que en movimiento no podes pegarle a nada, es como lo minimo, que hace ese mono corriendo disparando con el brazo levantado, impresentables.",
            "Ojala empaten",
            "Que ganas de salir con un minigun a lo terminator 2",
            "Todos rubios de ojos celestes",
            "el paraiso de Kicillof",
            "los derechos humanos y coso",
            "Si se disparan al pie es que tienen suerte, son stormtroopers",
            "Kevin De Brownie, Milly Bobby Brown, LeBROWN James...",
            "Hay fuego amigo?",
            "Cuando todavía no leveaste el Hipfire",
            "pero a que mierda le disparan",
            "En que parte de mdp paso?",
            "Parecen esas escenas de las peliculas western viejas, donde venían los indios, gritando y gimiendo mientras atacaban en manada.\n\nLastimosamente, esto no es un estereotipo.",
            "Después se quejan de la libre portación. Que papeles tienen estos? Me van a decir que tienen CLU?...",
            "Hijos de puta, no pueden agarrar un arma bien ni por su vida.",
            "creatura",
            "FIRE IN THE HOLE",
            "En la segunda guerra mundial se gastaron menos balas",
            "nunca jugaron un counter estos pibes, mirá a ese recargando en el medio de la calle todo expuesto.  \nhermano si nos vamos a la guerra con estos los culeamos",
            "\"La Feliz\".",
            "Todos disparan como chicagoanos",
            "Arma III : Cacos War Bundle",
            "No voy a ver de nuevo el vídeo por paja pero se escucha algo como :\n-tene' que tener cuidao' a dónde dipara', casi me vola el cogote\n-disculpa compañero\n\nJajaja qué hdp, me río pero que aberraciones, como pueden tener armas los qliaus ? Me agarra una violencia, se piensa que los disparos son de mentira o que mrd, me imagino en el peor de los casos no sé, que le dé a alguien de la calle re común simplemente caminando o que le dé a algún vecino en algún dpto",
            "Estan buscando al poquemon RATATATATA",
            "gta san andreas congourbano edition.",
            "Si todos saben que el intendente es re narco. Y lo votan.",
            "Cómo nunca muere así?",
            "uh la picaron los moscuza",
            "los stormtroopers",
            "Está bueno pero no hay perro y tampoco hay criatura.",
            "mucho conter",
            "Y si apuntan pierden?",
            "Resumen: Dale!",
            "El más arriesgado de todos es que el filmó. Jugadisimo.",
            "La provincia de kici una pintura",
            "Les encanta tirar balas al pedo. Que puntería van a tener si disparan corriendo y saltando.",
            "no soy narco pero creo que asi no se agarra una pistola",
            "Por favor que alguien avisé a Patricia Bullrich de esto.\n\nhttps://preview.redd.it/jwamk6qrh28d1.jpeg?width=400&format=pjpg&auto=webp&s=3e5670d71b6a957a1c184296e55bec46bb4537ac",
            "Milei dejalo gobernar a Bukele unos meses. \n\nQue triste ver estos pelotudos sueltos",
            "The usual demographic does it again",
            "Gracias. llevaba 2 semanas sin sentir esas ganas de irme del pais, hasta llegaba a pensar que la cosa no estaba tan mal despues de todo, que pelotudo.",
            "Y yo que pensaba que mar del plata todavia no se habia congourbanizado, como anda realmente la seguridad por alla?",
            "che este video ya lo vi como 50 veces desde hace años que onda",
            "¿Y dónde se estaban cogiendo como homosensuales?",
            "el que graba no hace nada?",
            "Es un juego para esas lacras, saben que no les va a llegar el balazo, solo aparentan poder andando con la pistola en mano como un mono",
            "jajajja uno de los cacos casi la palma por el amigo, encima lo caga a pedos despues. Surrealista",
            "Lindo barrio, a cuanto esta el alquiler?",
            "Ehh Gatooo gatoo.Estos son los que se son muy guapos, muy malos, hasta que entra el fiscal a la sala con el código penal bajo el brazo y se ponen a llorar , pedir perdón y culpan a la pobre vida que llevan y toda esa sanata berreta que utilizan.",
            "Será que en la guerra era asi? DAAALE DAALEE PIUM PIUM",
            "Esto es lo que se llama la dolarizacion?",
            "SECURITY FORCES ARE MOVING INTO THIS AREA, SECURE THE OBJECTIVE AND PREVENT THEM FROM COMING THROUGH",
            "De verdad, ni se ponen a cubierto. Eliminarlos es tan fácil como tener la decisión política de hacerlo. Me vas a decir que la policía o los milicos no los reventarían a tiros a estos cabecitas? La delincuencia existe porque el poder la desea o lo permite",
            "Leí rinoceronte. Está mal pero no tan mal.",
            "Vos no entendés nada, hacen fuego de supresión para que los otros no avancen",
            "Te quedas sin clavícula antes probablemente.",
            "Pero si estás corriendo para adelante y aparece uno, podes tocar CRTL y hace un dash para adelante, ahí con eso le tiras hasta bajarle el escudo y es kill seguro",
            "Si tenes entrenamiento militar me imagino que te darás cuenta de lo regalados que están tirando de esa manera y desde literalmente el medio de la calle.",
            ">correr hacia adelante y disparar \n\nEs que eso le suma al proyectil 5 km/h.",
            "Me hace acordar a los clones en Star Wars. Algunos se lanzaban de suicida disparando contra algún Jedi/Sith",
            "con municion de 22 larga con microperdigones haces un quilombo",
            "No creo que nadie reclame los cuerpos. Y la gente \"de bien\" va a estar tan agradecida que no va a decir nada.",
            "Si. Seguramente.\nCae el forense y el experto en balística, al toque determinan de dónde vino el disparo.\nAl otro día terminas preso, porque sos un gil laburante",
            "Lo reportan por espaldero y le banean la cuenta, no rinde",
            "Che igual está raro esto de salir a jugar en la puerta con los chicos eh..",
            "Counter Strike Real Life.",
            "Después se quejan que las generaciones de ahora pasan adentro y no salen a jugar afuera.\n\nPor más jóvenes como estos",
            "México nos está ganando!!!!! Tenemos que aprender de ellos y vamos a hacer los mejores",
            "Soldaditos de ultima",
            "Cuando dejan de pasar estás cosas es porque la cana hizo... Se quedó con el negocio.",
            "Yo DUDO mucho que alguien cagandose a tiros en medio de la calle apuntandole a nada tiene alguna intencion de darle a alguien o cuidado de su propia vida.  \n  \nSi ves que alguien te esta disparando, tu primer instinto es esconderte, incluso si estas armado. Esa es la gracia del fuego de cobertura despues de todo.   \nEsta gente tiene el cerebro RE-freido.",
            "Robert Brownie Junior",
            "Parque Independencia.",
            "Con leyes anti portacion, la policia tiene todo el derecho de detener a cualquiera con un arma en publico. Lo cual podria prevenir su uso o asustar a estos lo suficiente como para no andar con un arma por ahi/reducir su uso.  \n  \nLas leyes anti armas sirven, el contraste de EE.UU contra el resto del mundo es prueba suficiente.",
            "2 décadas ganadas y sensación de inseguridad. Mirá lo que se pierden los que viven en Suiza, se mueren de aburrimiento allí",
            "Dolarizacion a la manera Ecuatoriana \n\nS/",
            "Por la edad aparente de los sujetos en cuestión, pareciera que  nacieron y fueron educados bajo las prrsidencias kirchneristas.",
            "Pasa que nadie quiere tomar esa decisión. ",
            "Pobre rinoceronte loco. Él no tenía nada que ver.",
            "Si, lo que hacíamos nosotros en instrucción era que corrías 3 segundos en Zig zag, te tirabas cuerpo a tierra, te arrastrabas otros 3 o 4 segundos y te levantabas para volver a correr, repetías esa dinámica hasta llegar a la cobertura más cercana.\n\nEs lo más básico que hay que hacer si te están tirando porque así es más difícil pegarte.",
            "-1 ACCURACY\n\n+1 DMG",
            "me lso imagine hasta con el gritito de fondo de hollywood",
            "La justicia va a hinchar las pelotas",
            "Eso solo funciona si no mueven el cuerpo antes",
            "\"Espaldero\" kjjjjj jsdjjsdjjjjd",
            "Cilnt Easthood",
            "Entonces vos estás cómodo delegando la seguridad de tu vida y la de tu familia en otros, bien por vos.",
            "Y encima ciego el pobre",
            "Estos muchachos desconocen lo que es un alza y un guion. Si supieran usar las cubiertas y el aparato de punteria probablemente se harian algo, mas que desperdigar balas perdidas.\n\nMenos mal que sacamos la colimba. Estos cacos si tuviesen instruccion serian imparables",
            "40 años atrasado el dato man https://www.marines.mil/portals/1/Publications/MCIP%203-10A.3i.pdf\n\n\nY encima ese link esta con doctrina urbana re vieja.\n\nEspero hayas hecho la colimba en el 80 sino estamos al horno\n\n\nPara el que quiera saber, el desplazamiento despues de tener contacto debe ser franco, rapido, y con cambio de plano. \n\nEn criollo, en diagonal con respecto al tirador unque se tengan que exponer mas tiempo.",
            "- 1 ACCUARACY\n\n+ 4 SELF DMG",
            "Y en caso que acierte todos los tiros",
            "No, si hubiera colimba ahora estos cacos estarian trabajando y no choreando",
            "Marine here, confirmo. Violence and forceful action win battles. Locate, close with and destroy the enemy by fire and maneuver or repel the enemies assault by fire and close combat. No hay otra forma.",
            "Jajajajajajajajajaj ponele\n\nHace un analisis socioeconomico de la situacion durante la duracion del regimen de conscripcion y de la situacion posterior a los 90, cuando empezaron a aparecer los villeros. El gordo Valor habia aprendido a manejar armamento pesado en la colimba, sabias?\n\nEstos se afanarian los FAL de los regimientos para ir a meterle caño a un chino, no nos engañemos. Las FFAA no son escuelitas correctoras de la escoria social",
            "Podría ser cualquiera de las dos, la verdad. Todavía me acuerdo del cartel mexicano formado por ex miembros de las fuerzas armadas, eran bastante heavy.",
            "eso decian en mexico y ahi tenes los zetas , jalisco, etc...",
            "Eh... no se. Las Farc, PCC, Hezbollah, AUC, IRA, ELN, Los Zetas entre otros. Puede que te salga bien o terriblemente mal."
        ]
    }
}