{
    "WFFA: As a Reminder, AER Tony looks to take of everyone on an Army Post, no matter how big or small.": {
        "title": "WFFA: As a Reminder, AER Tony looks to take of everyone on an Army Post, no matter how big or small.",
        "score": 220,
        "url": "https://i.redd.it/fv0eu8342u7d1.jpeg",
        "content": "",
        "num_comments": 31,
        "comments": [
            "AER had put out a [Reminder](https://x.com/aerhq/status/1795920070754914349) about the tornado at Fort Campbell.  No, not that one, the second one that happened *last month* as well.\n\nJust wanted to take a second and make sure - if you're impacted and still getting shit together, make sure you visit their office, they've given out a lot for those tornados recently.\n\nOtherwise, Rule 1 is in effect; enjoy the weekend!",
            "Oh sure, when SMA (R) Grinston messes with the local wildlife it’s a fun photo op. But when I do it it’s a FG Art-15 for “allegedly” locking 4 raccoons in my commanders office. The one with rabies didn’t even bite him.",
            "CSMs in shambles when SMA disobeys rule number 1 of don’t mess with the wildlife\n\nBut it’s good seeing someone who cares",
            "Hey Tony!\n\nI like the things you do!",
            "I don’t think the title of this post is English?",
            "That squirrel better have given $1",
            "Weekend Brief: don’t play with the wildlife.",
            "How big we talking? Cruz had mention my weight....\n\nEdit: also flair good? Leave is on the 24th.",
            "Why is it the weekend free for all? My office has work tomorrow? \n*starts screaming",
            "That’s MY SMA… HOOAH 😤",
            "I donate to AER now just because Tony runs it.",
            "Officially done with command tomorrow. Real bittersweet moment, but I got picked up for a Major slot relatively early, so I can't complain. \n\n  \nP.S. Don't feed the squirrels!",
            "Why does this remind me of the time I had to make a  battalion out of cigarette butts for getting caught smoking in A.I.T.?",
            "Propaganda posting about a SMA.",
            "People still donate to that scam? Shame. And go figure, this dude is repping them. Perfect fit.",
            "*ALLEGEDLY*",
            "He’s even still clean shaven even when he’s already out. What a hero.",
            "Hey Tony!\n\nIf I could I would be you\n\nHow the hell do I remember this jingle",
            "Read it slowly lmao",
            "Thank you!",
            "Take it easy, SMA Weimer. Give yourself a shave. You'll feel better.",
            "Womp womp",
            "THE ONE AND ONLY SAR’NMAGE\n\nWITH THE ONE AND ONLY FACE",
            "Oh there’s a missing “care”\n\nGot it",
            "Tony? Is that you? Or are you one of his butt buddies?",
            "??",
            "with a face that's always shaved",
            "Yeah 😢",
            "No that's what we're all wondering",
            "Evidently not all. Seems I touched some feelz with my dislike of both. Both are sucking off the good will, intention of the very people who need that “Emergency relief”. Ya know, the ones who get that annual “ya better donate!!!” browbeating, begging. Then refusing to help when the very organization that brow beat ya into giving up your hard earned $, fucks up your pay so randomly, devastatingly that you’re 3 months behind. All because, according to their thinking, you “make too much” to be eligible for the “emergency relief”. \nFuggem. Only suckers donate to crap like that.",
            "I have absolutely been helped by AER when it came to emergency car repairs, sounds like a bad experience, as with everything, some suck some are good, it sucks you had a bad experience though."
        ]
    },
    "Anyone else who received a challenge coin from the previous SMA, what’s your story?": {
        "title": "Anyone else who received a challenge coin from the previous SMA, what’s your story?",
        "score": 139,
        "url": "https://i.redd.it/la6nh6nlrt7d1.jpeg",
        "content": "I was in 1/3 and took part of the change of responsibility ceremony for SMA Grinston. Those who were there for the change of responsibility received a challenge coin from him.",
        "num_comments": 60,
        "comments": [
            "I was Pentagon tours. I have his, Chief of Staff, Chief of Chaplains, and SEAC’s. Was really cool with General McConville’s office, as well as SEAC while I was there. Life changing job if you can get it.",
            "SMA Preston pulled me off a bulldozer in AIT and had me recite the soldier’s creed. Afterwards he hooked me up with a similar coin. Good memories.",
            "I have the coin from SMA Chandler. He was BRAND NEW to the position and I was a split op private in my senior year of high school. I won some JROTC award thing and went to an AUSA event at my local AFB and was selected as the regional whatever and got to meet him and get his coin. I only remember that he seemed excited that the \"winner\" was already a soldier and he talked to me for about 5 minutes.\n\nHe was so wildly unpopular that anytime I showed that coin it started a bitch fest.",
            "Yooooo I finally have a story for this sub!!\nI was getting ready to leave AD for the guard, I’m short timin. My friend says they’re makin tacos at his place on post at lunch. They didn’t mention the line of shots that came with the tacos. I take like 4-5 shots and eat tacos. I go back to work. It’s Friday and we expect to get off pretty soon. 1sg comes in freaking out in a Philippino accent “clean this PUCKIN company the SMA is visiting.” The god son of SMA Dailey was in my company. So, I guess that influenced his visit. The other team leader in my squad sees me nervously throwing dip bottles away and says “I can smell your lunch my dude you’re sweating it out.” \n\nSMA arrives. Gives a speech about soldiering and blah blah. At the end, he tells every squad leader in the company to pick the standout guy from their squad to be recognized out back. My squad leader screams my name out, and everybody forms up outside. \n\nI’m at parade rest but there is Patron dripping down my forehead. I’m terrified. I’m also the first in the line of dudes. SMA Dailey comes up to me. He’s surprisingly short by the way I had to look down at him and I’m like 5’11”.  He says, “Where ya from son?” And I answer, “Portland, Oregon Sergeant Major.” I can SMELL IT COMING OUT OF MY MOUTH DIRECTLY INTO HIS FACE. He smirks at me and stares for a sec. Then talks about how he loved his visit there and found the eastern part of the state to be a special beauty. Hands me a coin, thanks me for my service and that’s that. I got my SMA coin drunk and with congratulations.",
            "I’ve got SMA Grinstons coin: he asked who had been deployed more than X # of times in a crowd and then coined us haha easiest one I ever got, totally right place, right time. I personally coined SMA Dailey at a ball because I’m a smartass who doesn’t know my place🤷‍♂️ he didn’t return the favor🙇‍♂️",
            "They picked a handful of us at the WTU to tell our stories and he had lunch with us. There was an NCO who had like 90% of his body covered in 3rd degree burns, missing or couldn’t use his hands to eat. \n\nSMA asked why he wasn’t eating(the food did suck) the NCO looks at the SMA’s aide and says “I told that dumb motherfucker my mom was my attendant and still wouldn’t let her in.” \n\nSMA looked like they had the “talk” beforehand and this idiot still fucked it up and he was one inch from dying lol.",
            "E4 attached to BDE S3 shop, huge joint exercise at Hood. SFC fresh from Drill Sgt assignment was riding my ass (I was the only non NCO there) for shit that wasn't my fault. SMA Tilley was driving by and saw us covered in mud trying to put up camo netting over the generator. Driver stopped and Tilley was asking questions. Got coined for hustle, while he asked my NCO leaders why they were all in the shade and not helping. \n\nNot sure if Tilley was a good SMA overall, but that kept me going mentally until I got out of there to a new unit.",
            "All we got was from *him* is a dumpster fire of undisciplined troops asking me to do their COC’s job.",
            "SMA Dailey spoke at the infantry ball at West Point 2014ish. I gave him my platoon coin and he gave me his.",
            "I drove SMA Dailey when he visited Drum a while back. Cool dude",
            "Took a photo with SMA Grinston, gave me a coin because I \"showed him up with that blue cord\"",
            "Shot him at jrtc",
            "SMA Dailey actually promoted me from PV2 to PFC at Fort Carson. He was there doing something, I genuinely can’t remember what. My unit was in charge of transporting him around base and a friend of mine happened to be the driver. Got the coin then.",
            "Looks tiny for SMA coin. Or you are a giant…",
            "I was in DC after Jan 6th. We’d just swapped shifts and I was about to go stand outside the Capitol and freeze my dick off. Minutes before I checked into our cp, SMA Grinston came around and coined a couple people, one of which was the youngest soldier in our company but also a dirtbag. He turned around and sold it for 60 bucks and eventually he got kicked out for doing coke. 😤",
            "I got a camouflage Parker pen from SMA Kidd.  He only gave one coin per section to the senior NCO. The rest of us got pens and the silly “this pen will write forever until you do something unprofessional…” routine.",
            "I was tilleys driver for a visit. I watched him give the same speech and challenge people to a pushup contest. When he was tiring out after 2 days and I could see he was finally doing less pushups than I could do, I challenged him and beat him. \n\nPreston came to afghanistan and I gave him a tour and explanation of our mission and he coined me.",
            "Have an sma grinston coin because I had to talk to a soldier who was getting the coin. They assumed I was his nco that put him in for it but I was the replacement so that dude could fuck off while clearing. So then I left and finished some in processing stuff. I don't know where all my coins are because I figured out early only a few personally mean something.\n\n\nBetter than that we had some big wig general come in and we were told to write an arcom for each SM he met. So a relatively new Pfc got an arcom... I'm only salty because my first arcom didn't get awarded because the paperwork wasn't signed and the bn cmd left the unit shortly afterwards. I guess the lesson is I always make sure my people get their awards now.",
            "I’ve got one from Preston. Was in Kuwait in support of OIF3. Was told that the most recently promoted NCOs had to have lunch with the SMA. I needed a haircut so I grabbed my tray I looked around for another NCO with longish hair.  There was a guy already sitting down with his back to me who had longer hair, so I plopped my tray next to him. It was the SMA.",
            "I met SMA Preston once in Korea when I escorted him in the JSA. We both had 11ACR combat patches. We talked for about an hour and he was awesome. At the end he took his patch off and switched with it mine. I looked at him funny because I didn’t get what he was doing. He said “I like my horse to ride forward.” He had a patch made so that his Blackhorse faced forward when it was on the right shoulder.",
            "Sma Dailey visited us in Poland 2017 me and my tank crew shot top crew in gunnery and rewarded each of us with a coin",
            "Got two from Dailey, once during Thanksgiving meal, and the other for helping out at one of his parties at his house",
            "During the George Floyd riots we were sent from Bragg to DC to provide signal support for the MPs. We met him as we were leaving and he gave me one. I knew who he was but he looked different irl lol",
            "Also got mine in 1/3. Broke my foot at pt that morning, went to the formation on it, and then went to the aid station and hospital. It was great driving from Myer to Belvoir with a broken right foot.",
            "[lol, traded his for mine](https://www.reddit.com/r/army/s/rCW13hYEgX)",
            "Chandler, Camp Hovey in Korea 2011/2012, I had just made SPC, and loathed the promotion system changes. Something he was credited with changing, ate lunch with him and CSM Lohmeyer. I went on this long rant about promotion points, and why I couldn't wear black socks with PTs. Just the dumb things I felt important during the time. \n\nHe looked at me stood up from the table and asked my BDE CSM \"are the SNCOs ready to talk?!\" As we walked out CSM Lohmeyer laughed patted me on the back and said \"damn, we're gonna make Corporal out you yet.\"",
            "At his last Saint Barbara's Ball, hosted by the Pershing Chapter of the Field Artillery Association(56th Artillery Command.) He gave a coin to everyone there for whom it was their first time at a St. Barb's. Great dude! A lot shorter than I expected.",
            "I got Preston's coin. MCPON from that era too. My coin collection is massive.\n\n5 sided dungeon has that effect on ya.\n\nSpace Force doesn't get their side. Silly Space Force. 🤣",
            "I was deployed in Afgahnistan and CSA McConville and SMA Grinston wanted to talk a bunch of of us in my battalion. They gave the OPS SGM and me their coins because we had the most deployments out a group of 100.",
            "Got one from SMA Dailey when he visted the JRF (SF CRF company + SEALs CRE) overseas. Unsuprisingly, he was extremely chill and personable. Took a picture with everyone in the company as well, spoke to all of us from the junior enlisted to the CO CMDrs and everyone in between. \n\nAnd then my dumbass was in a rush to clear out of the army and forgot I left it in my pelican case that was in my gear locker when I got out. Still kicking myself for that, only had a handful of challenge coins but that was one of the best.",
            "I got one from Wiesbaden, Germany when there was a Change of Command for the 13th airborne corps. His support staff was there and handed coins out to lower ranking troops who provided support for the ceremony.",
            "I went to a briefing at then-Fort Benning with a bunch of FRG leaders, the SMA, and then-General Lloyd Austin.",
            "I got one from SMA Grinston when he visited Germany last January. He was asking questions about significant events that had occurred over the past 3-4 years in the Army and I answered one of questions correctly. He gave me and some other soldiers coins for getting the right answers. ",
            "I got one last right before he retired. Mainly for my role in the army wide PAI for my brigade",
            "I was in Korea the Friday before I was leaving and he had visited Humphrey’s. He was having a town hall and was asking questions in the crowd, everyone that answered his questions correctly he would give them a coin. That’s how I got mine 😃👍",
            "That's bad ass.  My favorite coin I got was from the ISAF SGM in Afghanistan.  That entire day was a huge morale boost for me, fuck the coin lol.",
            "I received mine from SMA Tilley in 02 for renlistment in KIA Afgan.     Too old?",
            "I got to go through one of those tours. It was a cool experience, and learned a lot about that place. I got myself a cool hat as a souvenir 🤙",
            "Is the tour job open to civilians and/or other branches?",
            "Kenneth O. Preston.\n\nFunny the shit you remember studying for the NCO board, that was like 13 years ago.",
            "It’s true I still don’t like him for the tattoo nonsense",
            "I wasn't in during his time but I've heard some things about him....",
            "A true profile in courage ",
            "What number of times?",
            "He did that in Qatar and a bunch of old fat officers got coined that day. Not a single enlisted soldier lmao. I heard him say that and i just sat down and continued my work.",
            "Was it in Poland? Cause him and the COS did that in Poland too",
            "Which SMA was it?",
            "I know all of Preston’s PAOs. I must know who this person was. What year? They’re all retired now but I’d love to bust someone’s balls over this.",
            "SMA Dailey was a pretty chill SMA. Drove him around when he was at Bliss visiting for some reason or another.",
            "Actually, SMA Chandler increased the size of the coin significantly.  Chandler/Dailey/Grinston ones are much bigger than Preston and before.",
            "🤷can’t win em all",
            "Lots of memorization goes into it lol",
            "It’s open to other branches but not civilians. Gotta be in your units respective ceremonial unit based in DC",
            "Yep so much time wasted taking photos of tattoos and uploading them to iperms. Freaking ridiculous. Gen ordinrio was a hypocrite with that shit when chandler was sma with tattoos are unprofessional and as soon as chandler left he was like oh we have to change with the times soldiers have tattoos",
            "More than 3 and less than 11 which was the high number in the crowd that day. (a prior Marine 0311 turned 11B on his last rodeo)",
            "SMA Preston. He was pretty chill to hang out with.",
            "2008.",
            "He came to my BLC in Korea, back in like 2017ish I wanna say. They took the top 10 or 15 of us GPA wise and he came and ate lunch with us. He discussed some of his viewpoints on PT, fitness, and having capable leaders or something or another. \n\nI liked him. He just seemed like a solid dude. Also I couldn’t help but repetitively look at that cool spot of white hair he had on his head.\n\nI didn’t really feel like we deserved coins but he handed out to us freely.",
            "I always found him to be really nice.  I never got the 'CSM Vibe' from him.",
            "Yea that’s how he came across to us, but after that dudes mom and another thing you could definitely tell not to piss him off."
        ]
    },
    "Throwback to the time someone folded my laundry after taking it out the dryer.": {
        "title": "Throwback to the time someone folded my laundry after taking it out the dryer.",
        "score": 1087,
        "url": "https://i.redd.it/zrwfi18hhz7d1.jpeg",
        "content": "This was over a year ago, and I never figured out who it was, but if you’re reading this, thank you for your service🫡",
        "num_comments": 120,
        "comments": [
            "Nobody fucks with DeJesus.",
            "WWDJD.",
            "He unfucked you real quick. You owe that man a handy.",
            "It was me, I had a crush on you and you never noticed me :(",
            "I did this every time as long as they were warm..The people that would leave their stuff for hours or days was annoying asf",
            "Respect the De Jesus",
            "A full bird ass colonel did this for me once..\n\nI’ve told this story before but, I was a cadet at air assault on Campbell staying in the hotel. The night before the 12 mile I was washing *all* of my clothes pretty late at night when a silver fox looking guy walked in with a 6 pack to do some laundry. \n\nIn the course of conversation he dropped a couple ‘hints’ of his service. Stuff like “it was around 2012 or so when I was the XO of (insert unit here).” \n\nI pulled my clothes out of the wash around midnight and the washer didn’t hit spin so they were sopping wet…and I had to be awake 3 hours later. He looked at me and said ‘don’t worry dude, I’ll throw em in the dryer when they’re done you go ahead and get some sleep before that 12 mile.’ I asked if he was sure and he said of course so I obliged and went upstairs. \n\n3 hours later I come down to an empty laundry room and *all* of my laundry neatly folded just like the picture on top of the laundry. After the 12 mile, I asked around to see if anyone knew who that guy was. One of my friends told me ‘oh yeah! That’s Colonel (insert name), he’s from the 82nd’ \n\nTo this day it is still my gold standard of what servant leadership *actually* means. Good guy.",
            "That’s called “lookin out for the last guy”\n\nPay it forward",
            "sorry my bad\n\n(it wasn't me)",
            "I would find that dude and buy him a 4-loko",
            "Haha.  After I got out of the Army, after a few years, I moved to TN with a buddy from the Army.  Once he had his clothes in the dryer when I need it so I folded his clothes.  He was like \"wtf dude, I don't even fold my own clothes\".  I was just like damn man, I'm not an animal!!",
            "Name tags not sewn on? That's free real estate.",
            "I always did that shit if somebody’s laundry was done and I needed the dryer. The only time I wouldn’t was when it was women’s underwear in which case it would go in a little pile off to the side. \n\nI just always thought they would feel some kind of way if I folded their underwear.",
            "Taking out the cloths and folding them is indicative of the female Soldier archetype. \n\nMale Soldiers would have just took your shit out and threw it on top, and stole your panties.",
            "I did that once before I joined the army. I lived in an apartment building with a basement laundry room. The same Starbucks barista constantly left her stuff in the dryer for hours. One day, I'd had enough, so in neatly folded all of her clothing-including her thong underwear collection and her barista aprons-and placed them atop the dryer before starting mine. She never did it again.",
            "I’ve done this before, when someone leaves their clothes for hours and I just can’t wait anymore.\n\nI did it partly out of knowing what it feels like to have your stuff pulled out of the dryer (sometimes before they’re done drying) and partly because I want to avoid any altercations or retaliation.",
            "Please tell me you went chap",
            "That’s a hell of a last name also that was nice of them.",
            "Won the lottery that day.",
            "All my homies like De Jesus",
            "Had to be a mom.",
            "Washing it with the velcro shit still on?",
            "You’re welcome 🫡",
            "This is the kind of shit that you can’t explain when they say why do you miss it if it sucked so much.",
            "This actually reminds me of a time I legit folded someone’s laundry in the barracks. All the washers and dryers were filled and I was just bored since I had to wait for one of them to open up.",
            "A man of God helped out a man of God",
            "How does it feel to know you will owe someone a blowjob for the rest of your life but you'll probably never have to give it, but it will be still hanging over your head (til your deathbed) and you'll probably never know who?\n\nDont get me wrong, aged 90 and on my last legs I'd still pay my dues (if it was me) but its the not knowing that would haunt me til I'm 90.\n\nI think at that stage, with so much buildup, it'd probably be the best blowie of your life. Giving or receiving.\n\nNo homo.",
            "I also stole your underwear and still use them for gratification.",
            "It was the least he could do for the son of man.",
            "This is a normal thing in some special army communities. Agree that in general it’s not normal tho. Usually the just rat pile it on the dryer 😑",
            "Not me, but I did this in AIT regularly. I still came back to my hot wet laundry removed from the dryer and in the sink. I removed their clothes and put them in the sink and turned the sink on while I sat on the dryer for the next 40-ish minutes.\n\nBlue falcon, please. Your name in on your BDU top. It doesn't take an analyst to figure this out.",
            "DeJesus lol 🫡",
            "Had the same thing happen back in the day had a nocturnal bust sock called the “dreamcatcher” had it written down the side homeboy folded that shit up and place the dreamcatcher on top displayed in all its white gravy stained glory.",
            "Fuck, at my first unit if you left your stuff someone would steal it. Ridiculous",
            "This wasn’t in Yakima was it?",
            "They  couldnt spell, and didnt want to put the lord’s OCPs in the garbage.",
            "Why would you put your ACU in the dryer? That fades it and prematurely ages the Velcro.",
            "With a nameplate like that yea you bet I'm folding Jesus' laundry.",
            "One time I threw laundry in, came back and it was dried and bagged. Probably the best thing that’s ever happened to me",
            "That's actually a little odd to me. Really nice but a little odd.",
            "I did this a few times but tbh if someone did this for me, it would end up in the green army laundry bag that I would use sometimes so the folding would be for nothing 😂",
            "I thought I was the only one that did this. Glad to see other people doing this as well 👏",
            "I’m suprised they did t throw it on the ground",
            "Wait are these the laundry rooms at DLI lmao? Bro I swear I recognize this place.",
            "I hate people that leave there clothes in the dryer for a hour but I always feel like a dick taking it out so I make it neat as possible aswell",
            "Out curiosity, were you at ft Jackson during that time. I used to do this and watch from afar when people would walk in, confused as hell, and they would panic, wondering if they were missing anything 😂😂😂",
            "I’m guessing You’re either supply, medic, cook, armorer, or mechanic. And also dat dude is a legit battle buddy, the destroyer of blue falcons",
            "Are you a recruiter by chance",
            "Hmmm I know someone with that name from OSUT, are you a scout by chance?",
            "I wont fold it, but if your bag is on the dryer, I will put it in your bag for you.",
            "I don’t want nobody folding my gutchees",
            "Looks like ft wainwright",
            "Much better than when we lived in Fayetteville and all my husband’s PT uniforms were stolen from the dryer.",
            "What base was this?",
            "I used to do this a lot if I found a dryer that was done but occupied. I usually had time to kill and figured why the hell not.",
            "Someone has a crush on you! Catholics ❤️",
            "Fucking bullshit. The only thing somebody ever did for me at the laundry building was steal my laundry bag.",
            "Adios mio, man.",
            "I would always do this if taking someone’s clothes out of the dryer. Unless it was stone cold and just a massive crinkly knot. The others in my corridor would do the same",
            "Pay it FORWARD",
            "I always did this, every single time. You'd have to be dick not to.",
            "1-21 laundry room",
            "I kept 2 gallon ziplock bags and would fold and put uniforms in them if I needed a dryer. Kept folks from retaliating when their crap was just thrown out.",
            "When I was in the barracks, I always made the assumption that the owner got caught up in something important and folder for them. Simple things to make someone’s day a little better",
            "Real ones know",
            "Mamasan fairies.",
            "The only nice way to say “move your shit, I need to dry clothes too in the only dryer that works”.",
            "92S gotta 92S",
            "Eight year olds, dude.",
            "Let me tell *you* something, pendejo. You pull any of your crazy shit with us, you flash a piece out on the lanes, I'll take it away from you, and stick it up your ass and pull the fucking trigger 'til it goes \"click.\"",
            "Whos on the overwatch? DEJESUS!",
            "I served with a DeJesus when I was in BCT/AIT and I can confirm that no one fucked with him.",
            "I have met several other soldiers with this name lol so there a slim probability I know this guy",
            "Spanish for \"the jesus\"",
            "Forget his clothes in the dryer, apparently",
            "Sloppy tippy with a twist.",
            "You shouldn't have worn your OCP 24/7!",
            "Especially when I am waiting on that dryer.",
            "Same here, as long as the laundry was still hot and same-sex (as mine), I would fold the big items, and neatly place the rest on the dryer.\n\nIf it was cold I would take a pic and place it on Facebook Marketplace “free”",
            "That’s a great story.",
            "Yup, I used to do this in college in the dorms and in the house I shared with housemates. It truly didn’t take very long, it saves them a chore, and I get to use the dryer.",
            "If I knew there was a 4Loko in it for me I would fold everyone’s laundry without question",
            "Ooo I know you’re real pos",
            "> little pile\n\n[You're sweet Mox but you know ya'are.](https://getyarn.io/yarn-clip/ea168189-190a-496c-997b-f94b46d2560f)",
            "**Taken",
            "Find towel, make clothes burrito. Place on top of dryer.",
            "Flair checks out",
            "You're supposed to. Keeps the velcro was wearing down and it actually solidifies it a bit, making it much harder to accidentally peel off or something.",
            "No better way to",
            "This took me a second read 😂",
            "Because it gets dry faster.",
            "May be the only time it’s ever happened. It should be cherished. 🤣",
            "“Jesus”",
            "“Hey man let me tell you something”",
            "So you have no frame of reference here Donny, you’re like a child who wonders into the middle of a movie and wonders what’s going on.",
            "Damn you turned this lovely moment and reminded of the actual villain here… the man that left his stuff in the dryer",
            "hahahaahahahaha",
            "[In case someone hasn't heard this one.](https://youtu.be/-IaRJnedtww?feature=shared&t=33)",
            "A real hawk tuah kinda friend.",
            "based 1 dryer 1 washer user.",
            "Nah, I only steal the underwear",
            "Found the grammar Nazi",
            "Tooken, like a bitch",
            "I haven't pulled a patch off my uniform in 4 years and I swear it's nearly cement levels of stuck on",
            "I'm pretty sure the laundering instructions say the opposite.",
            "I kept all the velcro on and my unit patch ended up leaving an imprint that couldn't be covered up by my new unit patch. This was when I had the UCPs. I haven't tried it on my OCPs just in case it does the same thing.",
            "I learn something new every day.",
            "Same",
            "\"The Jesus*\"",
            "> Nobody fucks with DeJesus.\n\nThat's just like your opinion man",
            "username checks out for the first comment and definitely for this one.",
            "English: do you speak it?",
            "See I’ve been told that by several NCO’s I ask and everytime I put my stuff in the wash I just take them off because I forget 😭",
            "That E4 rank still stuck on there?",
            "Yes, and it's because they don't want the velcro patches to be hard to remove. Wash your uniforms without removing the patches, and you'll notice the difference.",
            "I always took unit patches and flag off to wash. I hated how they would get all curly on the edges from the heat of the dryer. Looked very sloppy imo.",
            "“You said it man, no one fucks with the Jesus”",
            "This aggression will not stand man",
            "You damn right.",
            "“What’s a pederast, Walter?”"
        ]
    },
    "Boarding Flight with Military ": {
        "title": "Boarding Flight with Military ",
        "score": 597,
        "url": "https://www.reddit.com/r/army/comments/1dlcm3v/boarding_flight_with_military/",
        "content": "> boarding flight, they call for active military\n\n> Get in line, boarding airplane\n\n> Hear guy 4 people behind me complain\n\n> \"They called active duty but no one's hair in front me is in regs\"\n\n> I have an ETP but also who gaf, guy must look like GI Joe though?\n\n> Turn around, he's fat as shit and not in a \"I can pick heavy things up\" way, literally a bag of milk\n\n> Overhear him say he's in the air force\n\n\nWhy are people in the military like this\n\n\nAnyways, I'll take just a large fry, no salt",
        "num_comments": 134,
        "comments": [
            "Did you tell him he looked like a bag of laundry with how out of regs he was?",
            "Tell him to shut the fuck up, no one cares about his opinion.",
            "With no real mission no real enemies we eat our own. Lord of the fly style. Just call him piggy and chase him with a spear and cook him.",
            "Usually in my experience it's a \"Group X *and* active duty military\" call, so I never assume anyone jumping on that train is a servicemember unless... Y'know... They've got the high and tight, the MOLLE backpack with their rank, name, unit, and morale patches on it, the Multicam baseball cap, sometimes they're wearing part of a uniform.\n\nAirports are wild, it's my favorite thing to go soldier spotting. \n\nAlso, people take leave. That's a thing.",
            "You should’ve looked him up and down and then just busted out laughing while looking directly at him.",
            "Should have just turned around and said \"hey airman, since you're so by the regs, height and weight right now\" shut his hoe ass up.",
            "Some salty e7 probably. I get it a lot too when flying. That’s why I like driving.",
            "Pro-tip, if they call military before first class, get in line with first class. You still get on the plane early and you look like an absolute boss while being incredibly cheap.",
            ">Overhear him say he's in the air force\n\n>Why are people in the military like this\n\nI'm confused.",
            "Just turn around and say \"Thank you for your service.\"",
            "If you aren’t on duty then those “regs” don’t even apply in the first place",
            ">you post on 4chan don't you squidward",
            "I would have made fun of him lol.  But I'm an asshole, so there's that.",
            "I thought this was a haiku",
            "Because the Air Force has little to go on in terms of real military conduct, so they make an outsized deal of haircuts, until they don’t.  And then they *really* don’t.",
            "I just read this in my mind like a rap.\n\nLast line:\n\nOverhear him say he's in the air force\n\nNah, bitch, it's called the Chair Force!",
            "Sounds like there was hella salt 🧂",
            "Should have asked him if his hgt/wgt is in regs.\n\nBtw sir... who are you quoting??",
            "If people got extra bags and military and they wanna board first it’s what the airline offers personally I hate being packed into an airplane the novelty of flying has fallen off and I would rather sit in the terminal the extra 15 minutes than shuffle into the plane before anyone else.",
            "USAF is the absolute worst about hair cuts. They look raggedy af",
            "Free fries on Friday with McDonald's, when you order $1, in the app.",
            "I got comments when I was in because no one expected a small blonde female to be in the service. 🤣 I flashed them my CAC and they would be like “my bad”",
            "I typically board last.",
            "In the words of Sam L Jackson, \n\n“Shut the fuck up, fat man. This ain’t none of your goddamn business.”",
            "I used to work with kids (actual children, not just Marines), so I’ve perfected the disgusted mom glare; I usually just do that if someone wants to make a comment about me boarding early.",
            "Never had that problem, to be honest",
            "Bet your dick i’m hopping in that line to board first and go straight to my seat at the back of the plane, idgaf think what you want, I want an overhead bin for my big ass molle backpack packed with everything I need for my trip.\n\na lot of people in these comments acting like its a bad thing or boot thing, but I don’t care nor should you. Take advantage of the little things that you can, and don’t judge others because you don’t want to take advantage. the dude you’re cringing at has probably been through the same shit you have, just a different story, and a better attitude.",
            "What is this, 4chan?",
            "Shit. My hair is super long and I have a beard. I used to wait to board until last but now I'm on first to be asleep before we take off. I wish someone would say something to me.",
            "You’re MI.\nHardly military",
            "\"that's wild large sarge. say, when was the last time someone else graded your pt test?\"",
            "I like to use my \"military pass\" to board the plane first, so then I can go to the cheapest seat I found at the end of the plane",
            "Hold up hold up \n\n\nWho the hell orders fries and holds the salt? Are you even a true American?!",
            "The same idiots that preach about OPSEC are the same ones that need you to have a high and tight. Most E8s and above are trash anyway. FTA.",
            "By active duty they mean people currently serving, including reservists and guard. I haven’t been to drill in person in about 6 months and have a glorious beard… you bet I’m gonna get on first and get that glorious overhead bin space.",
            "Bro the last thing I'm doing is getting on a plane when they call active duty military",
            "I never get up when they call for military boarding that's like level 1000 cringe for me",
            "Let him know he looks like too much yogurt crammed into a tube sock.",
            "Looking like a busted can of biscuits",
            "Duffel bag with legs",
            "bad idea, could have been an Air Force Special Operations Weather Technician and Combat Weatherman",
            "10 pounds of shit in a 5 pound bag",
            "\"Shut the fuck up boot\"",
            "Besides, who the fk wants to board early anyways?  Board at the end.  Learn to love the thing where as soon as you sit down they're closing the door and doing the blow into the red tube demo.\n\nLess time you gotta sit in them hard ass seats.  Oh, you got a rollaboard?  Check it at the gate for free.  Relax.  Hit the bar at landing for a beer and chill and by the time you make it down to claim, your bag will be peacefully waiting for you.  Pro Tips.",
            "That dude 4 people behind OP ate too many of our own",
            "The US has made plenty of enemies, we just no longer have the stomach for foreign wars, and we've let the weapons manufacturers rape us on prices so hard we can't afford the kind of adventurism we once enjoyed.\n\nThe mission in the Red Sea illustrates this imo",
            ">the MOLLE backpack\n\nmy favorite lil game to play at the airport is \"guess who's the servicemember/vet\"",
            "They probably did a single contract too",
            "Took 57 days of leave once. Guarantee I didn't look to standard",
            ">the high and tight,\n\nFaddish, not in regulation.",
            "I could never tell what rank a senior air force nco was - all those stripes blended together thanks to my astigmatism",
            "He looked no older than 25, but it's possible",
            "Branch rivalry",
            "Sorry friend, not the right hill to die on. AR 670-1 Ch 3, Para 3-1.a. *Soldiers will present a professional image at all times and will continue to set the example in military presence, both on and off duty.*\n\nAlso, why is regs in quotations?",
            "Same.",
            "Time to board the plane\n\nCAC lets me get on it first\n\nFat Vet gets angry\n\n-GhostBriars circ. 2024",
            "I used to do that to ruin someone's day who thought they were getting an open seat next to them. I just want to go to sleep now",
            "The little things add up. When I went home for leave my mother asked me to do a bunch of random errands for her. Since I've been trained to complain and follow orders I did them. I saved her some money just by asking for a military discount and pulling out the CAC. Got her 10% off on new tires. Most people don't know what it is, but aren't going to hesitate when do it with confidence.",
            "The secret is: generally they will either make you fries or at least redunk your fries in the oil if you ask for no salt since they salt them all by default",
            "> By active duty they mean people currently serving, including reservists and guard\n\nThis low IQ take brought to you by the Louisiana education system.",
            "I will take every single damn perk from military service that seems appealing to me, and not waiting in line is definitely appealing.",
            "South West doesn't assign seats..when they call military to board you get yourself a PRIMO seat",
            "That's cool man.",
            "Yeah I hate guaranteeing that my luggage always has a spot in the bin directly above me and I LOVE standing in line",
            "I do it just because I want my bag in the overhead bin above me.",
            "Why not?",
            "If I’m with my family then I will because kids. But if I’m alone I’ll wait because I could care less and I love seeing the peoples faces when they think no one is sitting beside them and then BAM it’s me bitch",
            "I'm with you, man. \n\n1) it's selfless service. The only things you are entitled to are the pay and benefits provided by the DoD.\n\n2) Publicly recognizing yourself is narcissistic.\n\n3) even worse than military discounts (which I also will never ask for), Other passengers are the only ones who pay when you go to the front of the boarding line. The airline sacrifices nothing to let you board first.\n\n4) I hate, hate, HATE, being told \"thank you for your service.\" I used to respond with \"its just a job\" but out of respect of their ignorance, I started replying with \"thank you for YOUR service\" since it's usually someone in the service industry who has done far more for me than I've ever done for them for much MUCH less pay or recognition.",
            "It’s okay you have way too much karma to care about this lol",
            "That’s giving him too much credit, like he can bust like a pig…",
            "I usually go for a condom stuffed with cottage cheese.",
            "Tell him he looks like pre-cooked Mondo Burger sludge",
            "I'm saving this burn lmfao",
            "Like the Pillsbury Dough Boy grew out",
            "A great go-to",
            "I'd just mutter \"boot\" under my breath.  Generally, f-bombs in public spaces are a bad look, especially if you're just self-identified as active military.\n\nBut yeah, fucking boot.",
            "You board early to get prime overhead storage",
            "There are 4 people behind OP, and that dude is 3 of them",
            "I can handle the mess hall piggies, they can be used as buddy armour as good as anyone. The survivors usually get born again hard anyway. it’s the operations room cannibalism that loses wars and cost lives. Those bastard I would push a pop flare into the third point of contact and yell happy Fourth of July.",
            "Look, man. They stand out, but they’re convenient! Though I don’t do name tapes or morale patches.. maybe 12 years ago.",
            "*scratches the beard* hell dude even with just a week of leave I do my best not to",
            "Luckily for all of us, the AF is typically the least hung up on what you call them. \n\nMeanwhile God forbid you don't call a Marine by their entire rank.",
            "They do look a bit silly",
            "I misread that as alcoholism and thought “phew I’m not the only one”\n\nI jest",
            "Probably a salty e5 that did one contract",
            "You do realize you can look professional without your haircut being in compliant in AR 670-1 right?Unless he showed up to the airport looking like a vagrant off the street he’s fine. You are talking like someone who thinks that Soldiers have to shave on the weekends cuz “you’re a Solder 24/7.”",
            "Haircut is a specific uniform standard.  \"A professional image\" is subjective.",
            "\"professional image\" does not equal being compliant with 670-1 at all times.",
            "I would have roasted the dogshit out of him, even with my name plastered everywhere lol.",
            "If you say so boss. Whatever you do, don’t look into their actual written policies.",
            "*Me at the military only parking at Applebees and Bass pro",
            "And overhead space for your bag.",
            "Thanks",
            "1) That's fair, but I never have more than just my personal bag that goes under the seat\n\n2) You can just wait until there's no line and be the last one to board",
            "I just check my bag (big or small) so I don't have to deal with it in the airport.",
            "Not OP but I absolutely despise being on a plane. If I can spend an extra few minutes wandering around the terminal before being sandwiched into a child sized seat with the jelly rolls of my unshowered neighbor Manifesting Destiny, I'm going to.",
            "\\*kicks feet out on top of luggage\\*\n\nreally, it's a mystery",
            "Sir this is a Wendy's.  You've completely horseshoed into sounding narcissistic about how selfless you are.  You're just fuming about how you're being a better veteran/soldier in civilian clothes than someone else lol.",
            "What are other people paying? A fraction of a second?",
            ">it's selfless service. The only things you are entitled to are the pay and benefits provided by the DoD.\n\nSo you aren't entitled to VA benefits either? Can I have your GI Bill then (just the money, I don't need the education.)\n\n>Publicly recognizing yourself is narcissistic.\n\nThey aren't basking in the glory that is being active duty and taking a bow as the crew and concourse give them a standing ovation. They are quietly boarding a plane, usually with people with mobility/other issues who need to board early.\n\n>even worse than military discounts (which I also will never ask for), Other passengers are the only ones who pay when you go to the front of the boarding line. The airline sacrifices nothing to let you board first.\n\nI'm sorry, but this is probably the worst take I have seen on this subreddit to date. Do you also not shop sales? Do you not use coupons/coupon codes? Do you not price check/match? The only one thanking you for not taking that military discount are the corporate fat cats doing the Scrooge McDuck backstroke in all their money.\n\n>I hate, hate, HATE, being told \"thank you for your service.\" I used to respond with \"its just a job\" but out of respect of their ignorance, I started replying with \"thank you for YOUR service\" since it's usually someone in the service industry who has done far more for me than I've ever done for them for much MUCH less pay or recognition.\n\nGlad to see you at least recognize the true heroes of our society: The baristas, baggers, and the fry cooks. Without Waffle House, Walmart, and Starbucks, this country would be in shambles amirite?",
            "I won't die on this airplane, because I haven't boarded it yet.",
            "In that case, he shoulda told him “i will smoosh your breasts together and make love to them like you’re a woman.”",
            "Like 10lbs of birdshit",
            "Honestly a passive aggressive thumbs up would get under the skin even more.",
            "Overhead storage is for people pretending they got someplace to be, when chances are the airlines are gonna waste 10x more of your time at the outgoing and incoming tarmacs.",
            "With you on that one. Went to a regular bag a few times but the MOLLE does get the job done. I’ll take a few extra stares.",
            "*Ruffles patchy stubble* you give me a four day you’re gonna see a different kind of 5 o’clock shadow.",
            "Yeah I just pretend I'm back in a business / civilian environment, calling people sir, ma'am, man, dude, etc.\n\nI'm reminded back in AIT and I called a Staff Sergeant a Sergeant and I could tell they wanted to correct me so bad but ultimately let it go. I wonder if they thought 'if he does it again, then I say something'. ?",
            "First name basis is sweet",
            "That used to be true about 5 years ago",
            "> Unless he showed up to the airport looking like a vagrant off the street he’s fine\n\nI prefer the term [Derelicte](https://www.youtube.com/watch?v=mVscQYjuq_s)",
            "I think you’re too deep my man.\n\nAll this person did was quote the reg stating professional appearance is required on and off duty. This was a direct response to **you** saying “if you aren’t on duty then those ‘regs’ don’t even apply in the first place.”\n\nRegardless if you agree or not, it’s what our rulebook says. No reason to take offense to it.",
            "You can look professional without a high and tight or high fade or whatever. You can also have reasonably long hair and still be in compliance with 670-1. Now, you cannot look like a *professional Soldier* without being in compliance with 670-1, because, well, that’s what the Army has directed as the professional standard for our industry. \n\nFor the record, I don’t shave on the weekends, or on leave. My Soldiers can wear PTs in our footprint but go to uniforms when leaving the BN area. Civilian clothing is frequently required, not just authorized. There is a middle way that your initial take completely ignores. \n\nAlso, why did you put regs in quotations?",
            "The Army determines what our professional image is, and has done so through regulation and guidance. Our professional image is not the same as a Fortune 500, or do you want to wear AGSUs to work every day?",
            "Go ahead and post a link, we’ll wait.",
            "My reservist ass abusing the active military parking in uni (active military not duty)",
            "When you travel enough, you stop checking bags when ever possible. Nothing worse than having to buy a weeks worth of clothes because you booked a flight to San Francisco and your baggage ended up on an unscheduled vacation in Peoria.",
            "But I still have to pay attention to make sure I don't miss boarding completely.",
            "Yeah, but then you have to go to the baggage claim and wait around for another 30 minutes and hope they didn't lose or abuse your bag. I try to avoid checking my bags at all costs!",
            "And be like one of my guys going to a school and the flight over booked and your seat is already scanned by someone else",
            "Nothing except overhead baggage space. The flight still leaves at the same time.",
            "10lbs of bird shit in a 5lb bag",
            "Or short connections, fuck if I am going to arrive without my luggage.",
            "Sometimes people have places to be my bröther in christ",
            "Been there",
            "kill the Malaysian prime minister!",
            "The same reg you cited says to look professional at all times. Not look like a professional soldier at all times. I am not sure what the point you are trying to make is\n\nThe reason regs is in quotes is because when someone says something is “not in regs.” They should directly cite what is wrong. Not citing is how old information or just plain wrong information stay in our formations. OP mentions the person was Airforce. Our AR 670-1 is not equivalent to AFI 36-2903. I would want said Airforce person to tell me what exactly is not compliant with AR-670-1. The same way I wouldn’t correct an Airforce member without citing AFI 36-2903",
            "My brother in Christ, if the Army wanted us to be fully shaved on leave, on weekends, and all the time, the regulation would say \"Maintain all standards within this regulation at all times, both on and off duty.\" \n\nIt doesn't say that. You are completely misinterpreting the regulation. \n\nThe Army determines what the standard is on duty and in Uniform. That's why it specifies very specifically what the standards are in different uniforms and while on duty.",
            "The neat thing is half of 670-1 hits it with the \"at commanders discretion\". Unless someone is truly a cuck with nothing real to do other than dry snitch on people, chances are it'll never reach your CoC. \n\nIn this situation, asking for forgiveness, not permission. Even if they do ask for your CoC, rattle off some random ass unit.\n\nIt ain't that deep unless you're truly fucked up like wearing a nazi shirt or some wild shit.",
            "You give me the ick",
            "There is no need to argue about interpretations of the regs, the army loves defining things in writing. Find where it states the definition of a “professional image” and post it\n\nIf there isn’t a concrete sentence laying out that soldiers will maintain this “professional image” by being 670-1 compliant at all times, then that is just your interpretation and doesn’t really mean dick to anyone else",
            "I bet youre a great nco and soldiers love you",
            "It’s okay man I’m natty guard now lol.",
            "And I'm pretty sure \"bag of ass\" at the departure counter isn't this soldier's commander."
        ]
    },
    "Just threw my uniforms away. ": {
        "title": "Just threw my uniforms away. ",
        "score": 322,
        "url": "https://www.reddit.com/r/army/comments/1dlg928/just_threw_my_uniforms_away/",
        "content": "I'm moving and to cut down on space, threw all my army stuff away that I didn't want (obviously kept my woobie). I have a year and a half of IRR time still but the odds of me needing my uniform are slim to none. Not worth the extra space to maintain my boots and uniforms. Some of them needed replacing anyways. \n\nIt feels weird. Threw away some items from an ex that were in the back of a spare closet, too. \n\nSomeone needs to hear this' don't obsess about what used to be. Get rid of your junk. Keep momentos, sure, but don't keep clutter simply because you can't let it go. Let it be, and let it go. \n\n\"It's good-bye. But we lean forward to the next crazy venture beneath the skies\" - Jack Kerouac ",
        "num_comments": 94,
        "comments": [
            "For others doing the same...if you're anywhere near a medical training site, check and see if they'll take your old uniforms.  We like dressing our simulation mannequins in actual uniforms, and many training scenarios involve cutting the clothes off.  We run through a lot of uniforms and it gets pricey...",
            "*insert Poland/Korea deployment",
            "I saved mine for if I ever become homeless",
            "*War Were Declared*\n\nWouldn’t that be some shit?",
            "You should've went to your local paintball/airsoft field and made a decent amount of money selling it.",
            "Did you throw your war medals off a bridge?",
            "What’s OP gonna do wen Red Dawn?",
            "I’m gonna find a high speed larper and make some  smackaroos",
            "If you have packs, pouches, or field gear,  consider donating to your local Scout troop. There's always kids that need stuff but can't afford it.",
            "You haven’t seen the news?!",
            "Yeah man I kept one tough box with memories, the rest went away. \n\nIncluding several parts of various firearms that I don’t remember acquiring…",
            ">Someone needs to hear this' don't obsess about what used to be. Get rid of your junk. Keep momentos, sure, but don't keep clutter simply because you can't let it go. Let it be, and let it go. \n\nI still have 6 years left on active before I'm at my 20, so I'll hold on to my Army gear crap  until I ETS... but I pay for a storage unit full of boxes and I don't even know what's in half of them. \n\nI'm that someone. I needed to hear this.",
            "I crave momentos. Always keeping me fresh and full of life. \n\nhttps://youtu.be/TLL8jARrdTQ?si=3aBTy_OrW2ZQdB7M",
            "Wife had me throw my stuff away last year after we got married and moved. I'd been out 6 years by then. ",
            "1y 7 months I will be the same. So far I dont hold on to much. My best memories were Korea. I went to a foreign country. Met my wife. Did Key resolve which apparently made KJU big mad. Got my first award. Hung out with friends that I never contact anymore. \n\nEverything after that has been boring nonsense that doesn't amount to much but I have 10y of service now.",
            "So you're telling me I should junk that duffle bag full of stuff from 20 years ago?!?!? \n\n/Eye twitch",
            "Did you have to pay for the woobie? I'm turning my crap in next month, and it's on my record as having to give back. I'm debating keeping that and my fleece jacket obvies.",
            "I just PCS.  They asked for all my old digital winter jackets and pants and sleeping bags. They wouldn't take off my old digital FRACU, combat shirts, tan shirts and other stuff from my deployments 10 years ago. I caused a stink and they took it all out. I tossed everything they didn't want to the closest dumpster on post next to CIF. My CIF records went from 6 pages to 2.",
            "If you guys are just throwing away your old gear - why?\n\nResell it. There's weirdos out there that love this shit.\n\nLike look at recent solds on eBay - it's $20-30 a piece. $60 for some FRACU or combat tops. \n\nSame with any extra molle stuff you have.\n\nIf you want to just throw it away, dear god at least sell it to me for cheap.\n\nI also appreciate the sentiment of getting rid of your Army stuff. lol",
            "I did the same. Many years ago got rid of everything except my BDU field jacket and liner.\n\nTo this day I have recurring dreams about getting called back in, not having uniforms and freaking out cuz I can’t find a clothing sales store.",
            "Oh yeah, I threw my uniforms away before I was even on ETS leave",
            "I packed all my stuff in an XL tote and threw away what couldn't fit. It's heavy as fuck, but I've got the space for one XL tote that my kids might get a kick out of when I'm gone or whatever. CIF wasn't tracking a lot of my stuff when I got out and I was gifted some of it by a buddy who had the same thing happen and he didn't want it. None of it was \"acquired\" bc I hate that shit. \n\nSo I've almost got a full cif issue minus the helmet and body armor. Poncho, gortex top and bottoms, marshmallow suit, woobie, fleece top, tent, tons of mag and grenade pouches with the vest, water proof bag, complete ruck sack, medium ruck, assault pack, e-tool + carrier, ifac, canteens, a tomahawk, a couple uniforms, a couple combat shirts and all the silks/waffles/baklava they don't take back. I've actually got a pair of waffles in my closet bc I love them in the winter. I know there's more but I can't remember off the top of my head.\n\nTo each their own. I get the not having junk thing, but my junk is at least organized and stored. The only mementos I keep is a cib and unit crest at my work bench in the garage, otherwise no one would know I was in.",
            "My parents made me keep my dress blues and one uniform. I didn't want to store it at my house so it'll stay at their house lol",
            "Back in 06 a buddy of mine went IRR he got called up, reclassed and deployed to Iraq. Haha. Different times. Also, I dumped all my shit in a dumpster hahaha I kept one of everting and tossed the rest. I feel ya",
            "Uniforms make for great painting / landscaping / work clothes \n\nRFI was great for my ability to never need to buy work clothes when doing manual labor and needing clothes that are durable and able to get trashed up.",
            "If you have a MSTC nearby they can always use uniforms.",
            "Dude, the Army Reserve Career Counselors will be calling, emailing, door knocking to convince you to go Reserve, not guard.  Reserves aren't bad, but change your email and phone number that the Army has and maybe get a PO box. You could hear them out, though. Again, Reserves aren't bad and better than guard. But if you're done, you're done. Just be civil to the career counselors.  I was one for a long time.",
            "Those are my momentos. I do have a slight hoarding problem.",
            "I was called back while on IRR, they give you all new stuff. They give you initial issue all over again, then when you deploy you get more new stuff. Unless it’s sedimental, you can ditch it without fear of it biting you in the backside.",
            "Very happy for you. I’ve seen my family struggle with this and watched them allow their gear to remain a trigger and a reminder for a life they once lived.",
            "Thank you for telling us this.",
            "I took all my shit out the gate at the post I live near and sold everything I was never issued or bought myself for like $500. \n\nI literally don't care that it was worth a lot more than that because I don't hold onto bullshit I don't need \"just in case\". If I need 12 rhino mounts in the future for some reason then I'll just (why the fuck would I need rhino mounts in the future, is where I decided this sentence should end up going)",
            "It felt cathartic? Good. When you leave either trash them or burn them and get on with your life in comfy civilian land",
            "CIF just called, they updated their database and need you to swing by on Monday with a few unspecified items.",
            "I wouldn't be so sure. We've never been closer to WW3. There's a reason they just increased the selective service age. ",
            "Find a nearby Ukrainian church and see if they want that stuff to send to the motherland to kill the invaders.",
            "I don't know if I'll ever throw away all my uniforms.",
            "Does this spark joy?",
            "Noted",
            "Why not just pay a sew shop to resew some of the cut ones to save costs?",
            "Chem too. We cut off clothes when practicing decon.",
            "I have literally boxes and I've had zero clue what to do with them, and landfill/clothing donation just feels wrong. \n\n\nHow do I find one of these places?",
            "It took until I was 7 years in the army before I got to cut a uniform in training. I’m surprised we don’t do it more often.",
            "You guys don’t use those old ACU pattern ones with the Velcro? 68W training and simulations just use Velcro so it can be reused multiple times 💀",
            "Don't you put that evil on me Ricky Bobby. \n\nI already did Poland.",
            "Underrated comment lol",
            "Give me new unis and take it out of my first LES, I can't be bothered.",
            "Hmmmm good point. When I say I threw them away I meant I put them in bags and set them aside to be picked up....there's still time.",
            "He needs to keep those so his grandchildren do that after getting hopped up on Mountain Dew.",
            "Also I was IRR during OIF/OEF and got called back for an 18 month tour. They gave me all new shit anyway.",
            "I did throw away my like three AAMs lol",
            "You guys got Medals?",
            "Surely he still has a PT belt on hand. That should hold him over in the mean time.",
            "Honestly if it’s not crye, Patagonia, FRACU/FROG, FREE, shit like that, it’s not worth it. Normal uniforms will run less than half of what new ones will cost when they’re used. People will still pay a premium for good condition used crye, Patagonia, FRACU/FROG, FREE, and uniforms like that.",
            "I have a bag for a set of NVGs that I found. It's got a J-arm and a rhino mount. Obviously no NVGs. \n\nHave no clue where it came from.",
            "Joke response: just think how many 30-second increments worth of hookers you can pay for with the money you save by getting rid of that storage unit\n\nReal response: just think about the vacation you can pay for with the money you save by getting rid of that storage unit",
            "I don't recall it being on my record. My Supply NCO (I'm guard, so we don't have CIF) had a backroom with random junk that I sorted through to cover down with.",
            "You definitely gotta give back the fleece and woolies bit you can just buy a new fleece",
            "I kept my original one! Go to a local sew shop and buy a used ratty one for a few bucks and keep your original woobie. I spent like $20. $5 for the ratty one cif got and $15 for a spare BDU camo one I thought was a good find.",
            "There's a huge community for buying milsurp. Fuck if you still live by a base go sell it to a surplus store some random Joe definitely needs some of the random shit you have. Or just eBay it. Molle gear is huge, especially if it's in good condition. There's also some airsoft LARPer who wants a combat top and pants. NVG and Rhino mounts too if you've managed to tactically disappear a couple like I have.",
            "That moment when you realize your RFI Draw fell off your clothing record.",
            "This is what I did when I retired, a fully sewn on set of OCPs and my blues. That and my tac tailor kit and eberlestock bag that my unit bought for us in 07 but I'll sell those eventually.",
            "Look at Mr. \"I still fit in my uniform\" over here.",
            "Haven't gotten a single contact since I got out in October. \n\nI'm not updating my address when I move lol",
            "What we usually do instead is pre-cut and add Velcro so it's more like tearing them off.  \n\n\nStill nice to have a fresh cut for a special occasion ",
            "You guys still exist? Let alone train??? Lol jk",
            "If you're near a base with a big hospital (JBSA, JBLM, NCR, HI, Cavasos, Eisenhower) then see if you can find contact information for their hospital simulation or education dept and ask if they're interested.\n\n\nJBSA in particular, DM me.  There is a ton of medical field training here.  \n\n\nI couldn't find a list of sites quickly on Google and there are a lot of them, but Medical Simulation Training Centers (MSTC pronounced \"mystic\") are on many/most of the bigger bases including compo 2/3, they'd probably take them off your hands too.  ",
            "They're just expensive.  If every 68W cut one uniform per year and we had to buy them retail, it'd be around $1M/year.  Which is budget dust but when you work it down to the brigade level where it would actually happen, that's $26k a year and the boss isn't going to pay that.  ",
            "Believe me, the response rate to an IRR call up is *incredibly* low, even in war time, and no one is ever prosecuted.  We had some at brigade on my first deployment, as augmentees for the TOC and something like 80% of their call up no showed.",
            "Next Tuesday.",
            "Don’t you know that’s how wars are lost?!",
            "Honestly the only thing I wish I didn’t get rid of were my waffle set and my silkies set. Those are expensive and really handy in camping or hunting trips. I kept one set of multi cams and my dress uniform, but got rid of everything else besides paperwork ",
            "Definitely sell them. Some airsofters foam at the mouth for milsurp that was used by someone in the service. It's weird, but I've seen it happen at some fields I frequented as a kid.",
            "Still time you say? What size are you? I got $15 burning a hole in my wallet.",
            "I took some gear that I wanted to get rid of to a small town auction. Nothing to get excited over, it was unis and some random things. I figured it would at least buy me a twelve pack. I ended up getting around $300.",
            "Believe it or not, the only time I was issued a PT belt was IET. \n\nGo Guard hooah. It's a miracle I survived without a PT belt.",
            "Damn I got like 2 sets of FRACU multicams with the tags still on them.",
            "Yeah I had a barrel for a SAW, a firing pin for an M4 that probably fucked someone over, and some accidental C4.\n\nWeird stuff to find a couple years later.",
            "Those you can definitely sell for a decent buck or two",
            "Why not both? I could go on vacation with hookers. Either way, I definitely need to get rid of the storage unit",
            "Ah, interesting. That sounds much easier than the pain CIF is bound to be.",
            "Now THAT is insanely smart",
            "I’m gonna get some rip away uniform shorts for hot days at Irwin",
            "Disregard my previous question",
            "In between them doing the USR. (For the officers anyways)",
            "I'd only be slightly concerned if I was a super niche MOS. There's enough medics to go around.",
            "Ebay has them for cheap (still new FRACU sets) but you may be able to get a better deal on Facebook marketplace.\n\nIf they’re the actual multicam ones and not OCP, may be able to get more.",
            ">C4\n\nOooo boy. \n\nI also have found enough tourniquets in the last 24 hours to supply Ukraine through the calendar year.",
            "WW3 Commences Uncle Sam brings all Meddac members back.",
            "They are for sure multicam. I got them around 2014",
            "You can make a tourniquet pocket pussy with a roll of Kerlix and a medical glove though",
            "I started dating this gal last year and told her there's like absolutely zero chance I get recalled. \n\nLiterally the next day some 88m I think got recalled.",
            "Sum bitch. I preferred the older style and cut of uniforms, far more comfortable and the shoulder pockets are easier to use.",
            "Just another 60 series being a freak. Back to fort sam for you!"
        ]
    }
}