{
    "r/ask and r/questions are recruiting! Fill out our moderator application here. No experience necessary.": {
        "title": "r/ask and r/questions are recruiting! Fill out our moderator application here. No experience necessary.",
        "score": 40,
        "url": "https://www.reddit.com/r/ask/comments/1b1hdp3/rask_and_rquestions_are_recruiting_fill_out_our/",
        "content": "As Reddit continues to grow, so does our subreddit and our sister sub [r/questions](https://www.reddit.com/r/questions/). With more users and more content coming everyday, we find ourselves in need of some new moderators to help keep the subreddits running smoothly.\n\nIf you're interested in applying, you can fill out our application [here](https://forms.gle/Y5DUXrx4bT5JpcAq7). No experience is necessary. We have training materials available and are happy to answer any questions you have.\n\nIf you have any questions about applying or moderation don't hesitate to ask here in the comments or reach out in modmail.",
        "num_comments": 46,
        "comments": [
            "# Message to all users:\n\nThis is a reminder to please read and follow:\n\n* [Our rules](https://www.reddit.com/r/ask/about/rules)\n* [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439)\n* [Reddit Content Policy](https://www.redditinc.com/policies/content-policy)\n\nWhen posting and commenting.\n\n---\n\nEspecially remember Rule 1: `Be polite and civil`.\n\n* Be polite and courteous to each other. Do not be mean, insulting or disrespectful to any other user on this subreddit.\n* Do not harass or annoy others in any way.\n* Do not catfish. Catfishing is the luring of somebody into an online friendship through a fake online persona. This includes any lying or deceit.\n\n---\n\nYou *will* be banned if you are homophobic, transphobic, racist, sexist or bigoted in any way.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ask) if you have any questions or concerns.*",
            "Can this moderator experience be put on job resumes?",
            "I would like to join",
            "I was near area 51 in Nevada.  I saw two flying objects, one was wobbling, they were both sky blue in color and became more easily visible when they moved between me and a cloud.  I saw two items fall from the one that was wobbling.  The wobbling object crashed further away.  I drove my truck to where the pieces fell from the wobbling object.  The pieces were sky blue in color.  \n\nOn the ground near where the pieces fell was a large shape that was sky blue in color.  I took many photos from different angles and many videos. I also recorded GPS coordinates of where the shape was located.\n\nWhen I touched the shape, a panel opened.  I saw a screen with an image of earth, the moon and the sun, and odd symbols.  Next to the screen were illuminated buttons.  I lifted one end of the shape to put it in my truck.  As I lifted one end of the shape, it rose into the air about 4 feet off the ground and stayed there.  I did not have straps to secure the shape in the bed of my truck.  I did not want the shape to leave my truck bed if I hit a bump in the road. I dug a hole and buried the shape.  I would like to sell the shape to the highest bidder or, in the alternative, give it to a party to study with a contract that gives me 85% of any profits derived from study of the shape.  The party must satisfy me that it has the technological ability to properly examine the shape and develop technology from study of the shape.  No US companies allowed.",
            "Any specific requirements?",
            "I would love to be a mod / admin :)",
            "why is it red?",
            "if theres any mod on this post, can someone tell me why are so much posts getting locked? i get a post recommended to me to then be nearly always hit with the ''Locked post.'' message and it irritates me so much",
            "Lol.",
            "im all in",
            "Is this a voluntary position?",
            "This place is like the ominous varient of ask reddit",
            "[deleted]",
            "Is this still available?",
            "I got 3 garbage bot posts in my feed from this subreddit despite not having interacted with this subreddit before\n\nDo you need help with dealing with them?",
            "Well you obviously need some HUMAN moderators because I just posted a very simple post and I got rejected because your AI thought it was a question about suicide? (which is clearly was not). FFS, lol...",
            "Is this remote job payed?",
            "Me interesa, me dan mas información... Gracias",
            "I would only add it if it was extremely relevant. If you were applying for any kind of content moderation or social media management job, it would come in handy.",
            "I’m technologically illiterate but I want in",
            "I would love to join",
            "Yeah sure thing bud",
            "[removed]",
            "Yeah, the record for me was seeing a 2 hour old post and it's already locked and there's no reason given why.",
            "Yes",
            "Yep. We haven't added anyone yet.",
            "We have human moderators. You just need to modmail us and let us know the bot made a mistake. I'd rather the bot make a mistake and send resources to someone who doesn't need the help than miss someone who does need them.",
            "This is not a job and not paid.",
            "t.y.",
            "Idk I saw red it's weird",
            "My record was 1 hour :P",
            "I understand."
        ]
    },
    "Anyone love just laying in bed and just doing nothing?": {
        "title": "Anyone love just laying in bed and just doing nothing?",
        "score": 1330,
        "url": "https://www.reddit.com/r/ask/comments/1dld9to/anyone_love_just_laying_in_bed_and_just_doing/",
        "content": "I found myself i can literally do this for days. Not sure if this is a sign of a burn out, depression, or anything else. I’m just not as excited about going out and life in general anymore",
        "num_comments": 413,
        "comments": [
            "# Message to all users:\n\nThis is a reminder to please read and follow:\n\n* [Our rules](https://www.reddit.com/r/ask/about/rules)\n* [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439)\n* [Reddit Content Policy](https://www.redditinc.com/policies/content-policy)\n\nWhen posting and commenting.\n\n---\n\nEspecially remember Rule 1: `Be polite and civil`.\n\n* Be polite and courteous to each other. Do not be mean, insulting or disrespectful to any other user on this subreddit.\n* Do not harass or annoy others in any way.\n* Do not catfish. Catfishing is the luring of somebody into an online friendship through a fake online persona. This includes any lying or deceit.\n\n---\n\nYou *will* be banned if you are homophobic, transphobic, racist, sexist or bigoted in any way.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ask) if you have any questions or concerns.*",
            "For me it’s depression.",
            "Me! And im not depressed. I just enjoy being home laying around with no where to go or anything to do. Life is so busy always, i quite frankly love days where i can stay in my pjs and do absolutely nothing! We are always so go go go that its hard to find the time to just kick back and unwind. Nothing id rather be doing honestly.",
            "I’ve been doing this for months at weekends. The only thing I do is take the dog for a walk twice a day.\nI’ve just had one shitty thing happen after another for years.\nI’ve got up after each shitty thing, pushed myself to keep going until I can’t anymore.\nI work but apart from that I have no motivation , no purpose and nothing that excites me.\nTomorrow I’m planning on not going back to bed after walking the dog and cleaning the house and starting on the garden which is completely overgrown.\nI’m going to keep at it all day.\nIt’s the anniversary of my Mums death on Sunday, so Im going to try and keep busy then too and try and sort out my finances.\nOn a positive note I’ll have been taking Tamoxifen for nearly 2 years now so only have another 3 to go.",
            "Yep. I have been like this all day today. But I kinda think that I am depressed. Normally I can’t stand staying home all that time. But I have been like this lately. Energy depleted",
            "That’s me right now. My question is, how would anyone not love doing this lol ",
            "I used to. I never wanted to do anything unless I was drinking. Got diagnosed at 43 with ADHD. Absolutely zero desire to lay around now that I’m medicated. I want to be productive all day now. Always want to be doing something.",
            "It's great, then it becomes more frequent but it still seems good. Then comes the unpleasant feeling that it might be a symptom of something bad. So naturally, you just stuff that worry down. As deep down as you can and ignore it. Until you die. (Source: British)",
            "I love laying in bed! It's my favourite thing and I can do it for days on end. Been wondering myself if this is depression, but I just love the snuggling feeling of relaxing and be comfortable. I'm really enjoying myself just laying there",
            "It's a sign that you are completely normal and enjoy the simple things, that's where robust joy is found.",
            "Yep. Could do this all day",
            "The wife asked what I was doing….i said nothing….she says, you did that all day yesterday….and I said, yup, didn’t finish it!!",
            "I love it, I work hard all week and Friday afternoons alone in my comfy bed with online catch ups and the occasional snooze are my favorite week cappers!",
            "I struggle with this, in that I have insomnia and cant sleep. So I \"have to\" just lie in bed for 10ish hours a day, and sleep perhaps 2-3 of them. Ill drift off into sleep, but mostly its just laying there relaxing. Which is good, but not sleep. Me and the mrs have now come to the understanding that I prefer sleeping in my office etc, because if she coughs, Ill be spending the next 3 hours awake, but alone I can sleep.",
            "I am right now!!!",
            "For me its a bad one I avoid at all costs. Gotta learn what your own personal signs of depression are so you can avoid it when it comes and this is a big one for me. I wont allow myself to do it because it will be the start of a depression spiral. Some times you gotta shoo out the flies before they multiply",
            "I can totally relate to this feeling. Sometimes, just laying in bed and doing nothing feels like the only thing you have energy for. It can be a sign of burnout, depression, or just needing a break. It's important to listen to your body and mind. If this feeling persists, consider talking to a mental health professional. They can help you figure out what's going on and provide support. In the meantime, try to incorporate small, enjoyable activities into your day to see if it helps lift your mood a bit.",
            "Find something to do. Go for a walk, run, bike. Start a new hobby. Comfort kills",
            "I'm currently slightly hungover and running on about 3 hours of sleep. \n\nYou can bet your ass I've been laying in bed doing fuck all for the last hour!",
            "Tbh that probably would have saved me from a lot of bullshit but unfortunately it’s too late for that . Not taking care of depression early on consistently or at least finding a healthy way to cope with it has lead me down a road where theirs no turning back . \n\nPlease try & Seek help for your depression especially if it interferes with anything or worsens 🙏🏼",
            "Yup. Could spend every day like this. Probably very likely that I am depressed. I have no motivation or want or the will to do anything other than the bare minimum.\n\nThankfully I have a job that forces me out and to interact with lots of people every day and kids who also keep me busy otherwise I would literally not leave my bed.",
            "For me it’s a combination of depression and everything being so fucking expensive.",
            "yeah monks do it like all day bro.",
            "Yes!  OMG  YES! \n\nI could easily just lay in bed, watching TV, reading, napping, or just laying there pondering the meaning of life for days if given the chance.",
            "Saves money. And most of my income goes to rent so I love being home for sure now.",
            "That’s my favorite thing to do. Just me alone in my bed.",
            "Now try it with a book and a hot drink. You’ll never want to leave.",
            "depression. please be aware of the sign.",
            "That sounds like depression ngl.",
            "doing stuff outside requires additional resources, it's fine to do stuff at home sometimes.",
            "Yes! Sometimes you just need some rest!",
            "Does lying on the couch count?!",
            "No, not at all. Always feel like I'm just wasting time and I could be doing something productive. I have alarms on when to go to bed and when to wake up and I stick to them.",
            "Yes. I could do that all day without noticing I just wasted the whole day.",
            "I'm glad to hear I'm not the only one.",
            "Especially when I had a hard busy day, studied a lot of hours or did some workout. Laying in bed and doing nothing actually feels rewarding then",
            "It might be a sign of depression or burnout. And even though it feels good to lay in bed all day when I get depressed, it also tends to make it worse. I've found that even doing some little things helps. Bare minimum is brush teeth, take a shower, and get dressed. Then I feel fine to lay in bed. At least it doesn't make me feel worse in the long run.",
            "It's raining outside now on a Saturday morning and I'm having a coffee in bed. The ultimate.",
            "Depressed or not, I love it.  But my back is also destroyed so it’s when I get relief",
            "It really depends. Most days, I'm up before the sun for work. Been doing that so long that sleeping til 7 am feels like sleeping in. But, once in a while, when it's a rainy day and both my wife and I are off, I think \"Yeah! Today's a good day to just stay right here with the missus until whenever.\"",
            "It's definitely depression most of the time. but also - and i'm finally making peace with this - i ENJOY doing nothing. I ENJOY just watching anime or reading manga or playing video games all day on my days off. I don't WANT to go put and be social.",
            "I got a stepper but laying in bed to recover from a whole week of work and social event for work is OKAY. you set your own limits and know when its time to do something about it. bed rotting is okay.",
            "With everything going on in the world, I find it hard to be excited about the future, about achieving or setting goals… it seems pointless",
            "I absolutely  love to hurkle durkle",
            "Me me me",
            "I've been outside,  I've seen the world , I've lived high on the hog, parties, travels, fun fun fun ...\n\nNow, all I want to do is stay home. \n\nI love boring , reliable,  relaxing \n\nAnd I have a super comfy bed and couch !",
            "It's a sign of hermit. Just remember memento morri, that usually gets me to realize I gotta do something.",
            "Personally, I love it",
            "I genuinely like to do nothing.  In fact, I do everything (work, cook and clean) so I can do nothing in peace afterwards.",
            "Are you doing it by choice, or because nothing else seems to grab your interest, or like it might be enjoyable?",
            "Yeah but I'm also mentally unwell, so that might be the reason.",
            "I love the same thing.  Or just not leaving my house for days.  When I have days off from work, that is.  I hate going into public, too.  I'm starting to hate people in general.",
            "Yes, this is my plan for the entire weekend. Sitting around in the AC. I feel great.",
            "Nope. \n\nGet busy living, or get busy dying.",
            "get up and get after it",
            "You are not alone.",
            "only for a couple hours, then i get bored or get a headache or feel guilty and do something productive",
            "No I hate it over everything, time goes by quick, 1 second passes, you can’t get that second back. \n\nIt feels so exhausting and annoying when you wanna do something but lay in bed like a potato watching mornings go to nights.",
            "I enjoy it a little bit, maybe for 30 minutes after waking up on the weekends. But if I do it for an obscene amount of time I feel like I’m wasting my life away. \n\nI’ll wake up early on the weekends (6:45, which is still sleeping in for me) and just lay in bed until 7:20-7:30. I used to lay in bed until 10 or 11 when I had a lot of stressors and uncertainty in life, and I was miserable. While I “enjoyed” it in the moment, it honestly made me feel guilty. It sounds like you may be facing a bout of overall depression.\n\nMy weekends and days feel so much more fulfilling if I start them with a nice walk. Getting lots of outdoors time and a 5 mile walk in by 9AM on a Saturday is a great feeling. I feel productive. On weekdays I have to do these walks after work, because I don’t get enough light in the morning.",
            "I work everyday so I only get to do it right before or after work but I do enjoy lazy laying around.",
            "Literally nothing? As in no music, no phone, not even daydreaming or thinking about stuff\n\nI love to sleep in and stay in bed napping sometimes, but thats not quite the same I think",
            "Sometimes you just need to rest and not do anything, not all the time you need to be productive cause we don’t have 100% energy all the time and it’s normal to feel that way and it’s valid. Maybe soon you’ll feel you wanna fight or do something again, just take your time and don’t be harsh on yourself 😃",
            "Get a pet. Taking my dog for a walk outside is always a reset.",
            "Do nothing or use technology and screens?",
            "Depends on my days. Some days that’s all I do other days I go for a walk hangout with my bf read do something productive. I guess my weeks balances out with doing something one day and lay in bed all day another day",
            "Nope, i have tdhd since i was fking 5yo before i ever used a mobile phone, i cantbe doing nothing,even when im depressed i must do something even if i dont feel like doing it",
            "Maybe if with somebody that you Like!",
            "I use to.  My back went out a decade or so ago and I haven't been able to since that happened.",
            "I have hypotension. That's the best activity I can do 💙",
            "Yes",
            "I'm retired, so I have days where I lie around a lot. But I always make time to walk the dog 2 or 3 times a day. I've meant to find a new gym and get motivated to work out every day.  Right now, I'm in a nice warm bath reading and scrolling on the phone. Doing nothing is what I do best. Lol",
            "Nope that sounds sad",
            "Revoke internet entertainment. For 1,5months.\n\nOnly allowed to use google. For text based info.\n\nSimple as that. Report back when yall tried. This is key..",
            "I’ve been doing that for four weeks. Finished up a big contract and am waiting for a start date on the next one. I’m sooo fucking lazy. I have watched so many movies, made all kinds of gourmet food….and zero exercise 😳",
            "If you’re loving it, it’s probably not depression. If you can’t help it and you feel numb or low or guilty, it might be depression.",
            "Nope. I absolutely hate it. \nEven if I’m depressed I hate it.",
            "It's not as glorious as it seems, I'm permanently in bed at least 20 hours of the day. Believe me it sucks.",
            "Sounds awful",
            "It sounds nice but after 5 minutes I get bored and fidgety.",
            "No, I felt like I was wasting my life away. Had enough money to cruise. Moved to Brazil, am here now. Have to ride my bike for groceries. Everything is a challenge and I'm 100% more happy. But everyone is different... Do what make you happy.",
            "As others have echoed, it sounds like depression.",
            "I think about how much it will cost and that is usually enough to just stay home instead.",
            "Yeah , it’s friggin hard for me not to do so, i have unmedicated ADHD, and the way it makes important tasks not so important anymore sucks.",
            "Yes.....",
            "I have anxiety bad. I can’t even lay in bed barely to sleep! Haha. Sitting through a meal at a restaurant by the end is almost physically painful! Keep running and the demons can’t catch you!",
            "English cal it depression. I prefer the Spanish word siesta",
            "I hate it. I've been doing that today, but I have no valid lisence so I chose junk food and sadness.",
            "same, but I can do that for 1 - maybe 2 days, then Ill get sad and depressed that i don't go out. (I still don't go out, lol.) (yes, i am a very complicated person.)",
            "Depression. Its dangerous but so comforting at the same time",
            "Is it depression though? Some days are just meant to be spent in bed",
            "I'm half and half. some days I can get stuff done all day and not feel tired. other days, I just chill at the house. cause I'm too tired to function.",
            "Absolutely, but not for long. Maybe you’re exhausted and need a break.",
            "Yes, I've become quiet content with hanging out in my room on my bed allday. It's become a safe haven for me and the hours just fly by. I know I'm isolating myself but it's what I want. I never felt included in a social setting anyways. I find friendships to be awkward. When I'm In my bed I feel at home. I do my best to get out and avoid it but it's the first thought in my mind. I'm so drawn to it now. I lost my job and I've been glued to my bed since January. On the bright side it saves me money. I know it's not healthy but I can't stop. Depression maybe",
            "I don't like laying in bed all the time, its not fun at all.",
            "I get a headache after doing this for like 30 minutes. So no, it's absolute torture to me.\n\nMy doing nothing mode is watching TV / Play games.",
            "I genuinely enjoy it from time to time. If it’s enjoyable, why view it as a problem? There is a difference between truly liking to spend your time that way and doing it because you’re unhappy.",
            "I get a headache after doing this for like 30 minutes. So no, it's absolute torture to me.\n\nMy doing nothing mode is watching TV / Play games.",
            "Men and Women of culture.  Welcome",
            "I’m INFJ and big fan of MBTI! Although not recognized in a professional sense, INFJs love being in their cozy surroundings.",
            "Only when I have shit to do.",
            "Not me",
            "Not really. Even on a day off where I have nothing to do, I'm still out of bed. I'd rather do nothing on the couch than laying on the bed.",
            "Yipes; not me. Get out of bed in the morning, do stuff all day, get into bed at bedtime, sleep, repeat. I don't like being in bed outside of sleeping hours. I get antsy. I get home at like 6pm some days and my fiancee is lying in bed and will ask me to lay with her for a bit. I can't handle it for more than a few minutes. \n\nI DO like the occasional couch nap if I've done all the stuff I need to get done that day and find myself home with some free time. Man, a 30-minute nap with sports or something mindless on TV is great. I just get those so rarely.",
            "Yes, it’s usually when I am depressed or emotional drained",
            "Oh hell yeah. Or sitting in a chair staring into space. Especially if my cat joins me! He’s an expert at this sort of thing. Truly an inspiration to us all.",
            "🙋🏻‍♀️",
            "I’ll go through this and it’s definitely burnout. After a day or two of doing nothing I’ll get antsy and wanna get back into my routine.",
            "That's literally one of my least favourite things to do. It makes me feel like a ball of depression.",
            "It’s my favorite thing to do. But I can sleep for like 20 hours no problem.",
            "Same here. What are you doing in bed? Surfing the Net? Hanging out in Reddit? Watching movies? Talking on the phone? Sleeping? If you’re sleeping, it’s probably depression. Me, I am doing all the aforementioned.",
            "I do! It's one of the few ways I can recharge.",
            "Yes but then I have to go to the bathroom",
            "For me it's low iron...have you had a check up lately?",
            "That was me before Jesus. \nNo purpose, no expectations, just void filling my days. \n\nNow I'm alive, free from adictions, grateful, joyful and awake.\n\nHe Is the Way, the Truth and Life indeed!",
            "all day every day",
            "All the time. Pajamas and zen out.",
            "I've actually been doing this the past few days too.",
            "It is both depression (created by your own behaviour) and a symptom that you fried your own dopamine receptors by seeking only easy and cheap stimulus all day.\n\nThe solution is easy, avoid empty trashy stuff, work hard in something and after sometime you will literally enjoy an active life.",
            "Me everyday",
            "Are you just staring at a wall or watching tv or reading or something? Cos I could gladly stay in bed watching anime all day 😂",
            "It does feel good but moderation is needed eventually. Being too sedentary can weaken you over time.",
            "yes, girl rotting all the way!",
            "I do, but it's depressing and depression. Because everyone else is out getting drinks and doing fun hobbies and socializing but im just laying in bed in my phone or watching TV.  I go to the gym every day and that is the only thing keeping me from a further spiral",
            "I think if you “plan” a lay in bed day it feels good and is refreshing.",
            "Only when I'm exhausted from work",
            "No, I get up, make coffee and sit on my couch all day or days.",
            "Yea , I can be like that for days & I won't even care Abt food . It's unhealthy and I wanna heal that but I can't go out of my depression, it's been years already....",
            "I was having a decent discussion with some internet strangers.",
            "Oh yeah. All day everyday. The world is nuts and most people suck ass. I'm good at the house. I'll leave every once in awhile when my wife wants to go out, but that's about it",
            "It’s not necessarily depression. But it could be languishing. That’s a thing.",
            "i absolutely love to do that when it's bad weather outside",
            "Yes I love laying in bed during the middle of the day and at night especially on the days where I’m off from work",
            "Bed never judges you! Yourself and others do however",
            "I’m usually reading when in bed, but yeah, I feel you and agree.\n\nI’m also certain I’m on the brink of burnout, amongst other forms of fatigue.",
            "Actually couldn't really do much more than this for a few months. Basement flooded and eventually got a company to get all the stuff out and hold it until the floor was repaired. Figured it would be only a week or two, so I went ahead and had them hold my computer that I do most of my work on. \n\nTook six months to get the floor repaired because Nationwide kept bouncing me around to different agents, since I needed extra work done, as my house is an oldie and had asbestos in the floor's foundation.",
            "Yeah! When I'm asleep, no one can yell at me, and I can have all the adventures I want. My bed is my special place, and it's super comfy. I spent a lot of money on a really nice bed and the best mattress. It's like heaven, man. But, I'm a dad of three and I work two jobs, one as a paramedic and the other as an on-call firefighter, so between night shifts and everything, it's like, all mine, and it's the best. Dude, I freaking love my bed.",
            "Yes. I've been depressed. I fake smiles to make people, mostly workmates, believe I'm okay. But unless I'm on my phone, laying in the bed is just...normal.",
            "For a couple hours but not for days at a time, i couldn’t do that.",
            "It’s not possible to do nothing.\n\nAs someone who deals with depression, Let’s be honest, you’re NEVER actually “doing” nothing. Like it’s physically impossible until you are dead. Realistically, you’re in bed scrolling, staring at wall, thinking, processing emotions, making powerhouses for cells, feelings, thoughts, etc.\n\nYou’re actually doing ALOT! Dont discredit it.\n\nThings are always happening, no matter what. You need to accept that. You also need to accept that your body and mind are capable of adapting to almost any external stimuli. \n\nThe key is to know that if you’re dealing with depression, it IS best to let yourself sit there and “do nothing”.",
            "Yes. Although I have to admit I like watching the fan show while I’m lying there sometimes.",
            "Yes its great. I have a monitor at the foot of my bed so just watch stuff while laying down. I also read on my phone when I've watched enough stuff. Sometime I just close my eyes and let my mind wander, or think about potential paths/solutions for upcoming events. \n\nI'm on my bed probably like 60-70% of a 24 hour day. Its the actual best. \n\nAlso if you use the word love to describe something, I highly doubt its a result of depression\n\nDepression would be more like, I can't find the will to get out of bed LOL",
            "Yup, but I blame my dogs. They love to jump into bed with me. On rainy days, they do not want to get up and we can stay all day and night. If I don't have anything that needs to be done, I love my bed and my dogs snuggling.",
            "It was everything I had hoped it would be",
            "My own perspective on lounging in bed all day: Guilt & guilt try to make an appearance. I am an adult, far from living with my parents... but they loved to judge how lazy I was by how much I slept. I feel the guilt is a residual feeling from growing up with that type of parents. So when I do feel like lounging all day, I have to give myself a pep talk to let me know it will be fine.",
            "That’s exactly what I did today. \nI just read, listened to podcasts and napped a bit. \nIt’s a perfect day",
            "Burnout.  So tired and exhausted but can’t get any decent rest or sleep.",
            "I so wish I could do this. I yearn for even just an hour to just do nothing. I find myself just “GO! GO! GO!” all the time and I would just like to have a single hour and just do nothing. Nothing on my mind, no concerns, no “what needs to be done that I have the energy to do”. I’m a father with a family so I’m truly blessed but man…. I dream of that hour when I’m at work.",
            "My first job was at a factory, where I had to wake up at 4 and spend 10 hours on a concrete floor. I'd get home and be so exhausted I'd just do shit until it was time for bed. Trust me,  I love the fuck out of staying in bed doing nothing now.",
            "My kids don’t let me. But yes love a lazy morning in bed but I can’t do more than a few hours.",
            "Actually, no. I can't do that, I would feel awful and be even more depressed. Anyway, I wouldn't know what to do after a few hours, unless it's napping and scrolling reddit. Do you have a tv in your bedroom ? Maybe that's why. I wish I liked it, sounds like the best thing ever from what I read in this post !",
            "I have been doing this exact thing for my 2 week vacation.",
            "I believe it’s depression but I sure do love it.",
            "It's deppression for me, or hangover...",
            "I'll take two.",
            "i do it so much my back hurts",
            "i have love-hate relationship with my bed; loving lying down all the time; hating it because of the bedsores it gives",
            "Me too. I think it’s a habit at this point. I just upped my antidepressants and I feel a little better but I still have like 0 interest in socializing or going out and seeing the world. I have seen way more on the internet than I ever have IRL. There’s no risks, very few consequences if you’re not dumb about it, and I can see stuff that would cost me more than I’ll ever make in my life or things that are impossible to look at like other galaxies in space and cool anime’s where they have more interesting physics or abilities. Reality just ain’t it for me.",
            "Yes",
            "Yes my bed is my favorite place, could stay there forever it feels like . But when I stay in bed let’s say on a Saturday I am not working, I feel guilty like I should have done something different.",
            "Ever since the kids were born I haven’t done that in 10 years",
            "My wife.",
            "I do. Having a phone and internet helps, lol.",
            "Bed rotting is my fav hobby when dealing with the depresso stressos",
            "Sleep and visitation is wonderful 😌",
            "It’s your mindset, you have to change it. \nFor anyone that’s truly depressed I mean this, do only these two things. Start working out every day, and two listen to motiversity on YouTube. \nSingle handed greatest YouTube page ever. Listen to that shit on repeat. Do those two things and it will change your life, and then from there everything else falls into place. I promise",
            "I’ve grown accustomed to the practice since the Covid days and stayed working from home. It’s not healthy and probably depression. Yes, I need to exercise and get out more, but for now I’ll be in bed.",
            "Every morning\nEven after I'm wide awake\nI'll just lie in my bed and stare at the ceiling.\nNo  thoughts",
            "Love it. And not from burn out, or depression, anything else. It just feels good to do nothing. My girl and I were supposed to do a date each day from Wednesday to Saturday for our anniversary but we woke up today and just chose the bed. I’m actually typing this out whilst in bed haha.",
            "Thats me when I'm tired out of my usual hobbies",
            "I only do that for depression",
            "Doing it for a day, once a week, makes total sense.\n\nMultiple days in a row? It's a bit more worrisome. It's healthier when we have things that we are excited about in life.  It's not optimal to feel such a lack of physical energy",
            "I don't think anything's wrong with you. People will tell you you're depressed but it's simply a more natural state. If you aren't stressed and have things you need to do, it's quite normal to just chill out at home. The body conserves its energy. I've done this ever since I was a child. I don't think I was depressed in my childhood at all. I've never had an issue taking care of responsibilities but as soon as they're taken care of, I'm on the bed or couch doing something fun. It's also probably related to the fact I'm an introvert.",
            "It’s my favorite time of day, that time where I’m kind of awake but don’t have to get out of bed yet",
            "So relieving to see I’m not the only one. I just slept 14 hours and slept more. Some days I don’t even want to do anything at all. Maybe eat, use the bathroom then just go back to bed and look at my phone and I never feel good about myself. Waiting to go to my doctors appt soon. Early July.",
            "It’s called bed rotting lol it up",
            "It's a form of depression. It's insidious because it feels GOOD. For a while. Then it gets really bad.\n\nGet help. Start by getting out of bed.",
            "Ironically speaking lying in bed is actually doing something",
            "I actually feel super guilty if I do that",
            "If i have to lay in bed for hours, something is very VERY wrooooong....",
            "I was also like this back in my home country,I made my room like a comfort zone,never getting out from my room.Tbh,I regret alot staying in my room all day.I have zero community skills,no genuine friendships,cannot analyse people,zero fashion sense,no female friends,never faced setbacks.How i know about this?Cause’ my parents sent to another country for studies and now i understand that I’m nothing.Just a 22M with a child mentality with no experience in anything,it’s been more than a year and im not able to make any great progress,just fighting and ruining relationships with everyone cause I’m a people pleaser and now i cannot handle myself properly.It was easy back in my home country but here shit’s different.I had to face my demonic side which i always tried to hide.\nPs: It’s not worth it to stay in bed.Get out!\nIt will always be like ‘ I don’t want to get out from my bed’ but you are losing alot to explore in life.I was into games alot but now i realise that games are shit,there’s alot to explore in real world.",
            "I wish I could but I'm up early 7 days a week for work",
            "I am forced to do this 24/7. Dehabiltating Pelvic Pain that prevents me from doing anything. Even though it sucks bigtime….it is also pretty awesome that I am in bed when everyone else is at work or school.",
            "For me at the moment I’m working 80 hours a week so it’s an absolute necessity.",
            "It's lovely.",
            "Same but go to a psychiatrist it will help",
            "You do know the Elden Ring DLC is out?",
            "Personally i can't. I work 12hrs shifts, cook me 3 meals daily and tighten up my house, on my days off i try to enjoy going out as much as possible. The only time i stay in bed is when i'm sick.",
            "Info?  - Screen off or on? \n\nI love spending my weekends in bed, *getting nothing done*,  but I have a laptop nearby to run SecondLife, a tablet for Youtube and right now I haven't left my bed but am posting on Reddit. (in case of power outage I'd dive into paper books) \n\nI'd file my own behavior as recreational procrastination. \n\nIf you don't reach for sources of infotainment and just enjoy your silence, I'd voice medical concerns (& leave the labeling to professionals).",
            "It's lying, sorry.\n\nYes.",
            "Me but I’m depressed and possibly bipolar, thanks mom <3",
            "I'm doing it right now. Of course I'm joined by major depressive disorder, anxiety with panic disorder and complex PTSD, but we can all fit in the bed.",
            "I am 21 and either went to school/ university or worked most of that time. Two years ago during covid i started working 2 jobs and continuing my bachelor studies, and now am at a point in my life where i can barley continue. My last day off was last year in august, there have barley been days where si slept more than 5 hours since then. People say I look sick or tired all the time which makes it worse. I can't go out or to the gym anymore because the drives are too exhausting. And always when I think its getting better it keeps on getting worse. So yeah I need a day like that badly, somewhere in 2025 sounds realistic.",
            "I prefer to jack off. Even better with a sc partner",
            "Until the reality hits you.",
            "yes, my severe loneliness and depression got me zero motivation and losing interest in my passion. literally lay on my bed, scrolling social media for 10 hours.",
            "I would go crazy lol laying in bed for literal days sounds like torture. I got responsibilities lol",
            "Yeah that’s depression forsure",
            "i’m being manically lazy not depressed ✨",
            "Me: omg yes! I feel the same!\n\nAll the answers: it’s because you have depression",
            "Yep... doing it now",
            "Deep rest",
            "If those days are your weekends then it’s fine. If it’s workdays, then it’s a problem. Generally, doing nothing is fine, but if it’s happening for long periods of time you might want to ask yourself if there is something that’s bothering you or, maybe, nothing bothers you anymore (which is also a problem).",
            "Then you wake up 30",
            "I used to, when I was depressed and burnt out. \nIt was one of the first signs for me.",
            "I beat me depression and see no point leaving my home then  only for food, money, and sex",
            "Its a sign of depression if its happening often",
            "...u def thinkin whilst \"doing\" nothing? Ya posted on reddit...so, u doin sumthin with ur energy",
            "I can't do that, the more I spend time in my bed the more probability is that I start to beat the meat, so no, in my case is as soon I woke up Im out of bed and start doing things",
            "that's me when I literally no have money 😂",
            "Dude yes you get it, I look forward to just my day off to lay in bed till I’m tired of it",
            "i’m the same way! i got out of school back in may, and so far, most of my summer has been spent just kind of “existing” around the house or in bed. i have friends, but not hang out type friends, and while i don’t necessarily mind it, i can’t help but feel like i’m missing out a lot of the time 🥲",
            "I find I do this when I'm overwhelmed with things I need to do n just don't know where to start",
            "Uh oh... sounds like you've caught The Existentialism! I find it helps to think about how we are teeny tiny organisms on a giant rock hurdling through ever expanding space that's both as infinitely large and infinitely small at the same time.\n\nFor a real boost, I'll Google something like Quantum Entanglement to make myself feel super super insignificant.\n\nHope this helped... sorry... fuck 👀",
            "Yea. But I’m not depressed. I just like sleeping and laying down, curled up in my dim lit room. But it’s bad for you, it really is. We have to see it like any other bad habit. You need to eliminate it completely. I want to try and treat my room to be nothing more than the place I go to at the end of the day not to “relax” but to genuinely close my eyes, sleep, and refuel for the next day. There is just too much that needs to be done in this short window you call life, to use it all up doing nada. Get a hobby. Keep yourself away from your bed and your room in total. At best, keep yourself out of your home most of the time.",
            "me",
            "Yes… it’s the best thing ever especially after a long week or day at work.  Don’t let anyone tell you different! The couch is also amazing.",
            "It's okay, just love yourself through it. As long as you're eating, drinking water, and taking care of your hygiene then go easy on yourself. It will likely pass :)",
            "For about 15 years now and still loving it…",
            "Nope. I like getting up and doing shit.",
            "I really like to lie on the couch and do nothing, it makes me feel relaxed, especially if there is a lot of pressure from work or study.",
            "Maybe your body is responding to some sort of stress related period of your life and you just need some rest? \n\nFor the last several months, Ive been taking weekly 5000 mg supplements of Vitamin D (prescribed), as well as omega 3/fish oil, tyrosine, theanine, b vitamin and a daily multi. You may find that there’s a physiological deficiency somewhere.",
            "Sometimes yes, sometimes depression",
            "Time for elective thinking is extremely hard to find.",
            "   When I used to do that (although sometimes I was also mindlessly on my phone), it was period where I was also experiencing physical symptoms of deteriorating mental health so it could be that.\n    But at the same time I can see how these can be appealing even when you are doing well mentally and just want some chill time or you are tired and want to rest \n\n   So honestly it could go either way",
            "Im the same, when i dont force my ass out. Try to plan stuff. Or having rituals znd habits. Even if nobody wants to hang out, i olay solo tourist one day every weekend. Ill go to anyplace i havent been to and just check it out, even if only for an hour. A few weeks ago i literally just went to a mall, windowshopped and went back.\n\nJust having a bit of sunlight and seeing humans helps.",
            "Does doing nothing mean literally nothing or are you for example being on your phone and watching stuff, etc.?",
            "Same here",
            "The title should be change to depression section",
            "Yeah I did this many times over my life, and it's always when I'm feeling sad and shitty. Now I am happy (most of the time), but I will allow myself to have a \"sloth\" day every now and then where I just sit in my own nothingness, watch something on TV, stuff my face and I do it all guilt free. If I may offer you some advice, go into yourself and figure out the root of the problem, are you happy with your life, do you have any hobbies or friends or love in your life, I find being honest with myself and meditation helps.",
            "I went on vacation a couple months back to visit a friend. I usually do a good job of hitting my daily step count. We spent one day straight up doing nothing. Just laid in bed and watched TV the whole day. I got out of bed around 11pm to go brush my teeth and noticed I was only at 700 steps for the day. I didn't mind at all, probably one of the more relaxing days I've had in the past decade.",
            "Yes, all the time. I don’t think it’s all depression. Nothing wrong about it. Why life needs to be fun all the time. Fun, boring, active, passive are all normal, different forms of life. Learn to accept the blank part of your life is very helpful, it make other part of your life more interesting and exiting!",
            "No, I feel like i'm wasting my precious time when I could be doing a lot of other interesting things.",
            "Yep, this is me when I get a fibromyalgia flare up.",
            "Not being excited in life... generalised anhedonia is a textbook symptom of clinical depression. Have you ever considered therapy of some sort?\n\nIts not normal to be \"not excited about life anymore\"\n\nThat is a red flag something more serious might be present underneath the anhedonia\n\nEspecially if you just want to lie in bed and escape from the world.",
            "As a hyperactive person, I got through 2 phases most of time .. the 1st one is that I’m sick and tired of being in one single place doing nothing .. 2nd one is it doesn’t bother me at all staying in one single place doing nothing lol the irony ik fr",
            "Yup. Doing it right now. Classic depression.",
            "Get yourself out if you can. Get exercising and setting goals so you can feel good about doing something for yourself. \n\nAll the best.",
            "Yes. Butt i know it’s not good for me.I tend to Depression.",
            "Doing nothing is my favorite time",
            "Ah yes, the bedrotting",
            "Rotting in the fart sack, great album from Peter and the test tube babies.",
            "Same. It's burnout and depression for me.",
            "It's depression and it is a downword spiral if you keep doing it. Get up and get out there. Do something.",
            "Oh shit yeah... But then we had twins so... I dont spend enough time in there anymore :(",
            "It has its moments!  Naps are nice!",
            "I spent all my day in bed. Even though I don’t have job and money 🤩",
            "No, I couldn't do it. I would either think of something, take a nap or meditate to clear my thoughts.",
            "Yep! I just like lying in bed",
            "Born, born to be alive. 🙏🤪♥️",
            "Funny, my wife loves this. Even when we’re traveling she’ll plop on the bed and just chill there. In my head the bed is there for two things and that’s it",
            "Just remember that our bodies aren't designed for this kind of inactivity.  Expect the side effects that this may cause you would be so brutal in the next couple of years. It can literally shorten one's life span.",
            "Best feeling but worst part is time goes by so quick!",
            "God no, I couldn't think of anything worse than laying in bed. I feel like I am wasting the day. Sounds like depression to me.",
            "I used to love it, but since we got kids this is an Utopia. Those who knows they know.",
            "Yep!",
            "This is either depression or functional freeze which I've experienced first hand if it's frequent. \n\nIf not, I like laying in bed doing nothing after a busy week",
            "O yeah I love to rot in my bed. But I am also very depressed and getting worse as the years go on, and I’m sure the bed rotting is just exacerbating things",
            "YES!!! But my friends have dragged me out today because it’s warm soooooo can’t relate today!",
            "It’s working an extremely stressful job. I look forward to my day off where I literally stare at the tv in a laying down position for hours on end",
            "I fucking love doing this too. I can spend both off days just laying in bed most of the time. The weird thing about me is that I go through different phases, in different months. Some months I'm spending my entire Friday nights and weekends out partying with friends. Fast-forward a couple of months later, I get so tired of it, I shut myself at home (apart from going to work) for months on end. I have no idea why I'm wired so weird .\\_.",
            "I love my bed I love relaxing either in bed on the sofa or in my garden chair ,I don’t like going out unless it’s for something that I really really enjoy like food or to buy something new and exciting , I don’t enjoy much else ,but I am a happy ish person I think ,I don’t know if I’m just lazy and reclusive by nature or am I depressed without knowing",
            "Did this most of my life lol",
            "For me it's now realising how talentless I'm, how dumb I'm, how weak in everything I'm",
            "Yeah, I can stay in that state for a few days too. It's like I recharge and get back to normal. I think it's a normal state. Everyone handles stress and relaxes differently.",
            "I could but the gym and eating to recover from the gym always beckons.",
            "I do it and I hate it.",
            "Yes. Especially when I've had a busy few days with work. It's just nice to chill",
            "I'm starting to vigorously hate it lol",
            "The real question is— who doesn’t?",
            "No. I can't do nothing, I have to do something",
            "Depression  but also fuck it I have a 3 day wkend what's one day",
            "That’s a textbook symptom of depression",
            "I can’t do it. I get so bored and have to get up and move. When I was a drug addict, I could basically live in my bed, only getting out of the house to get more drugs and needles. It was the worst way to live.",
            "I've never thought there are the people like that,i hate myself cuz i dont do thinks i should do",
            "Yup. For me it’s ADD related. I can dissociate so easily. It sometimes turns into maladaptive daydreaming. But I’m in reasonable control of it. \n\nI’m not a medical professional at all and can just speak from decades of psychiatric experiences. \n\nYou say you love just laying in bed. I love staying in bed but my head is too busy to do nothing so I usually read or scroll. But since you say “love”, to me, that doesn’t say depression. It’s something you enjoy which is good. If nothing brings you joy, happiness, or contentment anymore, those would be warning signs. Laying in bed and lacking the energy to get up is a warning sign. \n\nIt seems like this is new for you. What changed in your life recently? If it’s burnout, it could just be your body saying it needs some recovery time. \n\nA warning sign to me is you say you’re not as excited about life in general anymore. Excitement is a temporary emotion. I don’t know how old you are but, as my psychiatrist would say, explore that emotion. When you say excitement, what do you mean? Do you mean excitement as in looking forward to what’s going to happen in the future? Someone in their early 20s is excited about life which is a great thing. Not everyone has this and that’s fine too. It also changes as you grow older. \n\nI’m 42 and I’m not excited about life in general. It is what it is. My life has a routine and excitement comes and goes. I create my own excitement. I’m excited about the December holiday we have planned. I’m excited about a new video game coming in October. \n\nUltimately, if this is something that’s new, that’s been going on for a while, it’s something that is bothering you, or it’s disruptive to your life (such as work or school), definitely get a medical professional’s opinion.",
            "Too often but it’s all I can manage after I am done with work the only time I leave is to pay bills because they are threatening to turn everything off again.",
            "Easy deserved up-vote on this comment of yours.. but yes",
            "Are you doing nothing? Or you doing things online?",
            "I've been doing this everyday for years now, certainly not great but its nice i guess",
            "Lately ive been sleeping 15 hours every day qnd half or so\n\nNot sure what it means. Feels like im struggling finding a direction for my life though, or maybe i know the direction but am afraid of taking it",
            "Time away from work? Yep. I can sit here all day and just be comfy",
            "Saving money! Lol",
            "[deleted]",
            "For me is also depression.",
            "Facts. Work 60-70 hours per week and all I have to show is a paid off car that’s getting high mileage. Still living with roommates. Still in debt. Still can barely make it to next paycheck. I’m ready to fucking end it. I was off work for a whole 16 hours and 5 minutes yesterday before getting called back in from another person that quit. Sadly that’s the longest I’ve had off since last November. Have to go back to work in 4 hours and haven’t slept. I don’t even see the point in it anymore. I just been eating trash lately and hoping for a massive heart attack or fall asleep at the wheel and Paul walker a tree.",
            "Yeah me too . I don't even know what for",
            "For me also depression",
            "Came here to say this.  Take my upvote.",
            "You don't need a bed to be depressed.",
            "I think this is such a common sign of depression that people think I'm hiding a depression because my favourite thing to do is just lay at bed and do nothing.  Everything else feels exhausting.  Even my doctors thinks I have depression.",
            "Depression, it is I.",
            "yes",
            "I also choose this guys depression",
            "Yes! I’m sometimes so overwhelmed with work and people that I just need to disconnect. But sometimes I feel this disconnect lasts longer than it should. Like the excitement for things is gone for a good couple of years, and even if something good about to happen, I get this overwhelming feeling that it won’t last or it will not work. I’m always overclouded by negative thoughts that I stopped enjoying anything",
            "I was gonna say. Man everyone is saying it's depression. I used to spend a ton of time pondering as a kid and loved to just sit there thinking about things for a while doing nothing. As an adult I actually miss it and feel I've becoke too anxious where I cant quite slow down like that anymore.. the need to always be stimulated. I grew up without a cell phone always in my hand and family internet only became a thing when I was a teen. Things were simpler",
            "I wish more people would think like you. Most people I've met feel they just need to be going somewhere all the time in order to feel alive.",
            "I know the feeling. You’re essentially on auto pilot in the week because you have to work and then once you’re home you just simply exist. You’re factually alive but there’s nothing going on.\n\nSounds like you’ve had a much rougher past few years than I have. I hope life becomes kinder to you and that you can find a way to have meaning in your spare time again.",
            "Sorry for your loss.\n\nA garden is a great little universe to tend to and to explore and nurish. I hope youll have fun doing that.",
            "Sorry for your loss.",
            "Picking up gardening is a great idea. You are courageous and tenacious. Have fun!",
            "DM me",
            "get husband it's easy",
            "If you would rather be out and about, and you tell your body to get up but it disobeys, and you get agitated because you lie in bed \"against your will\" - that's depression.\n\nIf you enjoy lying in bed and it relaxes you, you're just tired.",
            "It’s just when it lasts few days (I’m on holidays now so no work) to the point I know I need to do things around the house (laundry for example) but just don’t have the energy or the desire to do so",
            "Haha I love it!",
            "Mannnnnnnnn one of the few things that still give me hope that I will get better is hearing anecdotes about people being diagnosed later in life and then finding medication that significantly helps. \n\nGotta say Aussie health care system is so far down the drain it's not funny, Ive been waiting legitimate years now just to get in with a psychiatrist and get diagnosed.",
            "It's weird I am the opposite, I take my Adderall and can fall asleep.",
            "Dude, I'm so happy for you. What medication did you start taking to feel like you always want to be on the move?",
            "You in USA?  If so how much did it cost? I was seeing an online doctor due to my symptoms and was taking methylphenidate until govt cracked down on that (probably rightfully so.) However it sucks because the medicine was really helping and from what I've heard it's too expensive for me to get diagnosed. ",
            "Bahaha that's a classic case of Ritalin or Adderall prescription. I see you",
            "Always same story . A doctor find out that you have something and prescribed you stimulants.  \n\nKeep junkie.",
            "Was it inattentive type ? That’s what I have",
            "I have my test scheduled in September. Hoping for the best.",
            "“I was lying around all the time and then I started to take meth, well meths brother, and now I can’t sit still!”",
            "Same.. that’s why I’m just confused is it depression or am I just enjoying this?",
            "But that's the thing is that all there is in life is work then come home and rot until back to work? That's what plagues me.  I know there is so much to do and see but I can't just select something so I do nothing lol",
            "That’s how I used to decompress after a hectic work week ..curl up order some wonton soup or pho sip ginger-ale snacks  and water and just catch up\nOn all my bullshit reality series lol \n\nAllllll day ..\nIt was the day I relished most!",
            "And it’s probably depression lol",
            "Trying everyday. But what you just listed sounds extremely stressful (I know it’s not but that’s how my mind is talking me out of it)",
            "My brain read comfort kills but understood I need to kill some people in a way I'll feel comfortable.",
            "Why? Why can't they just do nothing? What's wrong with it exactly? If they are happy and content and comfortable then what's the crime in just laying down?",
            "😂😂thanks for making me laugh",
            "I want to be a monk now.",
            "Lol this guy gets it 😁🤣",
            "I think so too, can you explain what sign though?",
            "This is me. I work so many hours during the week and even on the weekends answering emails…sometimes it is so nice to go from your bed to the couch and just watch movies or a series that you don’t get to enjoy during the week. It’s always go, go, go and constant high stress we need that decompression for our sanity.",
            "Love rainy lazy days!",
            "I love that i recently learned that name for this activity. It somehow validated it and made it more enjoyable/ less wasteful. Tomorrow morning i have therapy, but Sunday is all about the hurkle durkle!",
            "Pretty much. I have the tv in the background just to have some noise. And sometimes just scroll aimlessly through my phone or read articles about anything till I get sleepy and sleep again",
            "Use tech",
            "That’s a good point. When my bf is around he somehow pushes me to do things without him realising it. However, he’s travelling now and I’ve been in this mopey, fatigue all day mood since he left",
            "Yea I want to do that. I remember there’s this one time where I travelled to a country where the internet is very choppy, barely enough to text, I was forced to detach from all social media and my god when i came back I was like wow what I’ve been in was very toxic! But it’s addicting and will work on limiting my time",
            "Congrats! I say in this case a well deserved rest!",
            "I’m loving it more than anything. But I do feel guilty sometimes for not spending proper time with family",
            "Wow that’s awesome!",
            "Yes!",
            "I think so, had extremely stressful weeks before our holidays",
            "Honestly I don’t think I’m unhappy. It’s just the regular shitty stuff at work but nothing major. However, when something extremely good is happening or about to happen (promotion for example) I get overwhelmed and think I don’t deserve it or it won’t last and can’t success in the new role. It’s weird",
            "Excuse my ignorance but what is INFJ and MBT?",
            "All the above, might nap for a bit after lunch (rarely tho)",
            "80 hrs !? I dont work that in a month !?!",
            "Last Part is a Bad advice if you have a family to be there for and/or children to take care of. Forgot to make that clear.",
            "Yea I think it’s from work. We have holidays now and prior the holidays work has been insane. Also, my bf is out of town so I guess been feeling a bit down. \n\nI’m 35, what I mean about excitement is just the element of the surprise is gone, I haven’t been on vacation in a long time and I know I can’t anytime soon as I need the money.",
            "Doing stuff online. Mostly reading articles, books, or just surfing social median",
            "☁️ \n\n\n##☁️ \n\n\n#🦐 \n\n\n##🔥 🔥",
            "I also, depression.",
            "for me it’s also this guys depression",
            "I've been there brother, it's the hardest thing to do sometimes but please find a new job. It will change your life",
            "\"Paul Walker a tree\" 🤣",
            "I know how you feel. \n\nDon't end it.  \n\nWe need to end the bosses.",
            "Yeah I get you there I live where cheap and heart attacks are common.",
            "By this comment, I am praying for you to be better, find purpose in life and joy and happiness. A couple recommendations:\n\n1. Read: The Alchemist, Paulo Coelho\n2. Watch: The Secret Life Of Walter Mitty, Ben Stiller\n3. Read: Outwitting the devil, Napoleon Hill\n\nFarewell friend!",
            "It’s ok for some a brain imbalance.",
            "Awe thanks",
            "You don’t but for me …yeah",
            "If that’s constantly a thing you may want to try and talk to someone.",
            "Sounds like anxiety.",
            "When excitement was gone for me, I decided to finally get my hormones checked. People don't realize how big of an impact hormones have on your life and how you feel/live. Im 24 year old male and have the testosterone of an old man. Im going to an endocrinologist to hopefully get it fixed because i know thats the reason for my depression",
            "The first sentence, you had me. Everything that followed suggests a clinical problem.",
            "I'm an introvert working at a job that requires me to meet and interact with loads of people everyday. For my own mental health, I dedicate time to specifically do nothing. Take some time off of human interaction and just recharge my batteries. Took a while for my wife to realize that I need such moments away from even her. And it's how I've managed to stay sane and not feel overwhelmed.",
            "Yeah, either I have no energy or I just don’t want to get up from bed, because I love laying in bed lol",
            "Same here in Canada:/",
            "That sucks, I'm around the Sydney area and got booked in to a 12 month waiting list for an appointment in March. 1 month later I received a text from the practice that they had a position open up in June. Just got my diagnosis earlier this week.\n\nSome of my friends however have had a really painful time pursuing this. I have no idea why it is so different for everyone.",
            "Speculation: But they're really pushing Vyvanse, which an amino acid conjugated amphetamine. It HAS to pass through the stomach for it to become bioactive. It's thought that lowers it's risk of abuse potential. Once it's in your bloodstream it's identical to Adderall, which is Dextroamphetamine.",
            "I don't think it's depression. If it were you wouldn't be enjoying yourself . Maybe its just being lazy. I dunno, but I can't get enough of it",
            "Take away that cozy feeling and then yea it's depression.",
            "If you are having a good time why would you call it depression? Don't decide what to do with your life based on others'expectations. That said, think if there is something you want to be doing or that you want to do in the future that needs action now. If not, just relax. We run too much. Some of us need time to chill.",
            "Oh then it's not just enjoying it definitely depression lol it feels different for everyone",
            "\"Your mind can be your greatest friend or worst enemy.\" - Swami Sivananda\n\nYou need to learn to control your thoughts. \n\n\"You need to conquer your mind before you try to conquer anything else\" - Gautama Buddha\n\nDon't be a slave to your thoughts, when you are by nature their master\n\nIf you allow yourself to think about it, you will do just that, instead of doing it\n\nStarting is always the hardest, my suggestion: \n\nJust do it - Shia LaBeouf\n\n![gif](giphy|GcSqyYa2aF8dy|downsized)",
            "get up, right now and run 10km. If you decide to go tommorow, it will be x times easier to convince yourself, because you already started. Everyday you are 1 day away from changing your life",
            "You don’t know until you try it. I hate running with a passion, first thing I do in the day, no headphones, I just talk to myself. Self therapy. I wouldn’t do it everyday not missing one day if it wasn’t beneficial.",
            "lol you can be if you want to",
            "I mean, stick in the bed is the sign of depression.\n\nI have this habit too.",
            "To me that sounds like you are avoiding something. Its a sort of escapism.  \nIts fine for sometime, but after a long time this habit becomes really depressing and makes it even harder to start to do something. \n\nI would advice you to try and find something you have little resistance towards and do that instead. If you don't want to do chores for example (that was what I ran away from most time because I suck at it, fucking ADHD), its fine to do something else. You don't have to be locked into doing nothing because you don't manage to do the task you think you should be doing.  \n  \nBest of luck!",
            "Lol.. it’s alright chic",
            "Good luck 💪🏻💪🏻 its a great detox.",
            "Unless you’re really ignoring others’ needs - like your child - I say, carry on. It’s good to rest sometimes.",
            "Sometimes laying around is self care, but I would still try to work through your fears/lack of confidence. We all get overwhelmed sometimes though.",
            "Telling by your user name you are not ignorant!! In fact very cultured indeed!! MBTI is a personality test that gives you vague ideas behind your four letter personality. It’s online, I would give it a try!!",
            "Somedays I just don't feel very pressed.",
            "Could be, I can snap right out of it though",
            "Adderall isn't dextroamphetamine it's just amphetamine. Dexedrine is dextro",
            "Vyvanse is the [insert luxury brand here] of stimulants. It costs a fortune if you don’t have a benefits plan.",
            "Just do it.....Bo Jackson \n\nFTFY",
            "The spirit of this advice is fine but 10km is a silly number to throw out. OP likely would get the shit kicked out of them trying to run a 10km.",
            "Exercise in contrary to popular opinion will not solve things like Depression and Anxiety, Most of the Time it will not make you feel better except for the moment, Change happens *gradually*",
            "Nahhh haha I don’t think I could commit to that",
            "You are sweet! Thanks, I’ll def give it a shot!",
            "For me it's impresion of a pressed depression",
            "For me it’s catching up on sleep so I’m not totally exhausted",
            "Lysdexamphetamine dimesylate then",
            "hmmm.... Have you trying repressing your pressed depression to improve your impression?",
            "The pressed impression seems to have slightly regressed but looking forward, the set lesson is to attempt to be less depressive"
        ]
    },
    "Why do people claim that looks aren't important?": {
        "title": "Why do people claim that looks aren't important?",
        "score": 125,
        "url": "https://www.reddit.com/r/ask/comments/1dlrecp/why_do_people_claim_that_looks_arent_important/",
        "content": "And some even go as far as claiming that they don't matter at all.\n\nBut if we take love and relationships as an example, which is a very important aspect of life for most people, it's obvious for everyone, that it isn't true. If your'e very unattractive the people you yourself are attracted to won't date you. Only people whom you don't find attractive and who don't find you attractive either might be willing to get into a relationship with you, which obviously isn't a good foundation for a relationship.\n\nSo why do people make the claim, even though they're aware of things like that?",
        "num_comments": 240,
        "comments": [
            "# Message to all users:\n\nThis is a reminder to please read and follow:\n\n* [Our rules](https://www.reddit.com/r/ask/about/rules)\n* [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439)\n* [Reddit Content Policy](https://www.redditinc.com/policies/content-policy)\n\nWhen posting and commenting.\n\n---\n\nEspecially remember Rule 1: `Be polite and civil`.\n\n* Be polite and courteous to each other. Do not be mean, insulting or disrespectful to any other user on this subreddit.\n* Do not harass or annoy others in any way.\n* Do not catfish. Catfishing is the luring of somebody into an online friendship through a fake online persona. This includes any lying or deceit.\n\n---\n\nYou *will* be banned if you are homophobic, transphobic, racist, sexist or bigoted in any way.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ask) if you have any questions or concerns.*",
            "I have developed feelings for women that I didn't find physically attractive because they had other traits that I did find attractive. Those traits eventually led to me becoming physically attracted to them. I've also dated women that I found very attractive and then lost that attraction once I got to know them better.\n\nThe fact that my attraction to someone's appearance can change depending on their character and other personality traits is why physical appearance isn't an important factor for me when pursuing a potential relationship.",
            "This whole thread is delusional and pure wishful thinking.",
            "Hypocrisy, same with people who have a lot of money and claim that money are not important, they have no idea how lucky they are until they don't  have them anymore ",
            "I think they mean that looks aren't the only thing that's important.",
            "Because looks don't hang around forever",
            "Of course looks are important. Anyone claiming the opposite is just kidding themselves.\n\nBUT: a) it's not everything, b) looks change so you better be damn sure there's more to a relationship than that, c) good looks don't guarantee attraction and d) what someone finds attractive is highly subjective, not always obvious and goes beyond just certain \"features\"",
            "No one is claiming that looks are not important. People are just saying that looks aren’t the be all end all of everything.\n\nI know it from experience. My looks did not change (at first) and I had zero chances with women because I never talked to them, never went anywhere and was constantly self-depricating. I am also not wealthy. But when my attitude and my sense of self worth changed and I started to feel at ease with myself, started to see my own value as a person, things took a 180 and girls started noticing me. I dated rich and hot dentist girls and they were full of insecurities. I went out with girls who did modeling and they were literally the most basic, boring fucking people I have ever met. I had girls I only briefly talked with once while they were in a relationship get into my DMs months later when they were single. Not because of money, no looksmaxing, not even a trendy fucking haircut or a beard, just by being a decent human being and doing basic things like looking after my hygene and not thinking like a loser incel.",
            "It's a cope",
            "Being honest with myself, I’d like to be attracted to what I’m about to be waking up next to",
            "because people lie",
            "It's not that looks aren't important,it's that they aren't EVERYTHING.\n\nAlso,different people have different priorities,some may value someone's looks,more than others.",
            "They aren't the MOST important thing but it's like a house, if the paintjob and landscaping looks like shit then most people don't even wanna look inside to see the stuff that actually matters",
            "Looks don't matter AS MUCH as everyone makes it look like.\n\nAt least in terms of relationship.\n\n\nFor me, it usually goes like this: \n1. I meet a person - i don't find that person attractive much\n2. I get to know them better\n3. If i like their personality and we just \"click together\", somehow, they become my type.",
            "They are lying.",
            "Because some of the people that make that claim are above average in attractiveness and don't understand how life is if you aren't.",
            "Physical attraction is essential for most but this isn’t the same as the person being super hot. ",
            "Because they have them.",
            "Most of it is wishful thinking or lying to yourself. Looks mean a lot to most people. I don't think looks mean as much to women, which puts them at a disadvantage, unfortunately. Men are more petty and superficial when it comes to looks.",
            "People make it look like you're some superficial person when you say you cate about looks. COME ON, of course i need to find my partner attractive and it's not like i am being picky or something. I literally find most people attractive (both females and males). Everyone can up thier game and i mean everyone",
            "Looks matter, but if you're looking for a life partner, other things matter a whole lot more.",
            "Because nobody likes to portray themselves as outwardly shallow.\n\nLooks are not everything no but without that initial physical attraction i dont know how anything can spark from there.",
            "They live in dreamland and want to believe the world is like that. Many are also just gaslighting and dont actually believe it. And personally its not easy to say to your ugly buddy who isnt rich or has something else going for him that yeah he might should come to terms.\n\nDreamland is probably better and for sure more healthier than the complete opposit but yeah…\n\nJust stay somewhere in the middle. A friend of mine got from being one of the most naive bluepill guy to dark-red with sprinkles of black super fast. Doesnt help that he isnt the sharpest tool in the shed and  \nnow believes like the most ridiculous takes of all the 3 pills.",
            "Well it might feel important, but it's only really important for people that don't love you. Looks aren't that important to the people that matter the most to you (in the absolute majority of cases).",
            "Initial romantic attraction is usually based on appearance. However, if one gets to know a person one initially found unattractive, it is possible for attraction to develop based on the person's character and personality. How they carry themselves and act in the world. I wasn't immediately attracted to the man who is now my husband, but when he asked me out, I didn't want to be rude so I said yes. As I got to know him, not only did I become attracted to him, but I fell head over heels in love. I've also had the opposite happen: having an initial physical attraction to someone, but when I got to know them, the attraction left. So the lesson I've learned is don't base everything on initial physical attraction. Also, as others have pointed out, physical beauty fades with time, but a strong character and personality doesn't.",
            "Learn your own worth. It has nothing to do with physical appearance. Unless it's the kind of physical appearance of being healthy and looking after yourself, because you know your own self worth.",
            "We all like beauty but it's not enough u can't live with someone just because she's pretty and in the same time people who cares a lot about looks are so superficial and will probably leave you",
            "Because they're stupid",
            "I feel more comfortable hanging out with women whom I don’t find attractive. I feel I can be myself. I don’t know why it works",
            "beacuse it's polite",
            "Looks matter depending on standards to get you through, but it's the least important thing after that. They matter, but only in cutting down options and even then people would settle for a worse looking person who is better in other ways.",
            "Not Always, now Personality, way you carry yourself is Really More Important !!!! : )",
            "Because we live in a world where you have to pretend that obvious things are not true.",
            "Pretty women get treated like royalty. Everyone is so nice to them.",
            "They want to appear non-superficial",
            "I've always interpreted it to be more advice than a statement of fact. Anyone who has worked in advertising or the related psychology that goes into it KNOW that appearance plays a big role in the way people interact with the world and people they find themselves attracted to or repulsed by, but there's also some wisdom in the advice that when looking at long-term fulfillment, looks are not AS important as it's generally impressed upon people to be. However looks will almost never be a non-factor.",
            "People make that claim because channels of discourse, like reddit, demand binary thinking. There is no level of nuance that translates or is accepted. \n\nHow that relates to OPs topic is that looks are not the most important thing in a relationship. Therefore in binary thinking, they do not matter because something else matters more. \n\nIf you want real perspective, talk to a real person, not someone on a digital platform.",
            "I have a craniofacial abnormality. I don't deserve to be punished for something which is not my fault, which is beyond my control, that I am not responsible for, nor am I able to fix. I cannot be held accountable for it and I don't deserve to suffer due to it. I am not a lesser person nor subhuman due to my condition.",
            "Yikes this thread is chock full of incels. \n\nIt's not your looks or your height driving women away, it's your bad attitude.",
            "This is not a question people talk about every day in real life.  Why talk about it here?",
            "Only ugly ppl say this.",
            "Cuz people don’t want to be judged or called out for being shallow, even though all of us are shallow in one way or another .",
            "they might be desperate",
            "Because they want to pretend they are a good person.",
            "Of course I have a type that I find attractive, but personality traits can make a person more attractive/less attractive. I knew woman who were crazy attractive to me lookwise, but as soon as I got to know them weren't attractive to me at all. And another factor is, that looks are temporary... no one will look like 25 forever. And I only commit to a relationship when there is a chance that the relationship will last. So focusing on her looks would be completely stupid from that perspective. We all age...",
            "I think that men and women differ in this regard. Men value more a woman's appearance, while a woman values a man's character, etc. Personally, I have always chosen a smart and witty man over an attractive one.",
            "It's wishful thinking. We wish we were better creatures than we truly are. \n\nCountless studies prove that looks matter on all fronts. Whether it's forming relationships, career and even in court, it matters.\n\nWe are apes wishing we were angels.",
            "I would never claim that looks aren’t important. It’s my number 1. However, I have dated people that I didn’t initially find attractive. It was the interactions that we had and the friendship we cultivated that then drew me in. And a sex dream that did it lol",
            "Because they aren't. \nEdit: for some they are and for some they aren't.",
            "A good personality can make someone attractive despite not having the greatest looks. I have fallen for a ‘not conventionally attractive’ woman on two occasions. \n\nAnd: Good looks don’t matter if the person has a shitty personality. Unfortunately, that is often a lesson people get to learn the hard way. Me included.",
            "They probably mean philosophically and in the long run, looks aren't important. \n\nWhat makes a human being valuable and, yes, attractive is their inside. I've met people who are drop-dead gorgeous but whose extreme vanity and/or general unpleasantness made them ugly in my eyes. I've also met people who don't fit the mold of traditionally good looking, but whose great sense of humor or cleverness or kindness or even overall integrity made them attractive.\n\nIt's actually pretty rare to find outer and inner beauty in one package (it happens, and I've met people like that---but again, it's rare).\n\nAlso, looks eventually fade. I don't care how much Botox you inject or how much surgery you get, nothing can stop the aging process. And if you try to stop it too hard with all those procedures, you end up looking a bit younger----but not like yourself.",
            "But that's not true.\nJust because I find someone attractive doesn't mean I want to date them.\nIt just starts with physical attraction.\n\nBut if you're a shitty person, who cares how you look.",
            "Looks aren't important, but YOU need to be attracted to the person you're dating. They can be ugly to the whole world, you just need to be attracted to them. For me personally, literally anyone can be attractive to you if you fall in love with them.",
            "Ppl are superficial, so to get in you need to be somewhat attractive or charming, but your looks can grow on ppl and that's why they make the argument that looks aren't important.",
            "It does matter and at the same time it doesn’t. A lot of people can gain attraction by their connection. The real answer is it is a little bit of personality and a little bit of attraction (remember that looks very differently for everyone).",
            "Personally, i dont find looks as important because i see it as something that isn't in your hand, and you can't change what you've been created or born with. What matters is the health and actual mentality of that person. These are things that can be changed.",
            "Looks only provide affection, but relationships are built on more than sand.",
            "Why do people claim that? My theory is, those people actually don't care (or at least prioritize) looks and they know some other people who are like them. So they make a general statement about this.\n\nWe all have our own criterions for partners, even in physical attraction itself.",
            "What people fail to disclose is that there is a certain minimum bar of attractiveness you need to clear to get your foot in the door. AFTER that point then looks aren’t important (to some people).\n\nThe Disney answer is looks don’t matter at all. It’s what on the inside.",
            "Some people believe looks aren’t as important as honesty, integrity and kindness. Some don’t.",
            "Some people generally don't care about looks or other things. I know a couple who were together for years and the guy decided he wanted to transition to a woman, so he did. They stayed together and then got married and are happy as ever. Enjoying being around your spouse is the most important thing",
            "People like to think of themselves as deep.  I notice women will pretend to not care about looks more often, but when you look at those women’s standards for how their partners look, it’s clear they DO care about men’s looks.  I very rarely see conventionally attractive women with average dudes.  \n\nWomen will claim they see this often, but it’s rare.  And usually they’re just overestimating how attractive their friends are, frankly.  So they think their friend’s boyfriends are less attractive but in actuality they are pretty looks-matched.",
            "To feel good about themselves. Fundamentally looks matter, we are nicer to pretty ppl, more attracted to beautiful ppl, it just impacts us all the time.\n\nIll agree that they arent the modt important thing in life and a personality can make a person more or less beautiful, but looks matter and always will. \n\nPpl say they dont so they dont feel shallow, but if an attractive person flirts with you ir someone who is not the least bit attractive, we will all feel differently.",
            "I’ve seen some very gorgeous people (physically) in my life, but when they open their mouth or just seeing how they treat other people, I want nothing more than to be as far away as possible.\n\nIf someone is cool to be with, I’m gonna hang around. Whatever happens, happens.",
            "I've dated men who were deemed by the society as 'not good looking'. Which was ridiculous to me coz I found (still do) them gorgeous. So yes, on some level, I guess I never cared about looks much.",
            "It’s the tolerant thing to say. I think looks matter to a extent, like I 100% ain’t gonna judge someone based off what they can’t control but if you are grossly overweight or hair is all messy or u smell bad it’s like cmon take care of yourself. Shower, brush ur hair, get active. I know a guy who couldn’t afford a gym membership so he controlled his portions and only excersize he did was run and body weight excersize lost a ton of weight. \n\nLike if a girl has a big nose or doesn’t have big tits or whatever (I’m just pulling examples out of my ass) idc she can’t control it it’s not about thst nesseserily it’s more I take care of myself I wanna be with a girl who also does and your looks say a lot about it",
            "because what truly matters is on the inside.",
            "Ok..I never believed that it's the persons soul that you fall in love with until it happened to me.\n\nI dated an absolute gorgeous woman. Long dark hair with blue eyes. We had chemistry romance, fun, and attraction. I truly loved her.\n\nI realized that even if her soul was in a different body, I would love her no matter what.\n\nUnfortunately...she wanted kids, and I didn't.",
            "Appearance always matters. How you look. Body type. Weight. Dress. Style. Hygiene. It all matters and people make assumptions about you accordingly. \n\nEven in Disney’s Beauty and the Beast, it is a double standard that Belle was beautiful and the Beast fell in love with her. If Belle had looked like Quasimodo then it wouldn’t have been much of a movie.",
            "Looks are very important for the majority of people, they just don't come out and say it because they don't want to be judged for it.",
            "Im not some kind of authority on all of this but I think that \n\n\nMeeting strangers: looks matter, ultimately personality is what will push you away.\n\nSomeone you have known for longer: personality and your ability to vibe can and will definitely factor in but looks will still matter - just your cut off is lower than that for a stranger.",
            "because they are ugly",
            "Its something in the middle? Looks isnt that important when you consider other traits like personality, common interests, IQ, humour etc.\n\nLooks are just part of the equation.",
            "No matter what people look like, in the long run everyone is paired off as long as they don't have major mental health issues. There are so many fish in the sea, and everyone has a different type that they're attracted to, so in a sense there is someone out there for everyone ",
            "I'm not attractive at all and my partner is. \nI ask him this question quite often and he says he thinks I have an attractive personality. So maybe some people do look way past physical attractiveness.",
            "It can be their honest wish to live in a world where *looks aren't important*. \n\nAnd btw dating somebody who is roughly as (un)attractive as you are is a great foundation for a long-term relationship.",
            "Because personality is it",
            "It's beautiful people trying to hide the fact that their looks are their only value",
            "They want you to feel better about the fact they think aren’t sexy.",
            "It sounds like you need to go outside. Looks matter in the sense that they’re nice, but personality and you being an interesting person matters a thousand times more. Go improve yourself and become less boring and people will flock to you no matter how ugly you are.",
            "Because it makes them feel better. The more attractive you are, the easier your life is, on average. That's just how the world works.\n\nAttractive people can't cope with the fact that a fair amount of their standing in life is due to their looks and not their competence.",
            "I know a guy who is face-blind and he is more attracted to like voices and accents.\n\nHe himself is super pretty though",
            "I dont care about looks, people say im attractive but I've always gone for they're personallity over their looks.\n\nTbh wish people cared more about the inside instead of the outside or status, after all looks fade, money comes and goes. personally doesnt",
            "Because personality matters more, if two people love each ither they will still love each other if one of them is isn't atractive looking because they're personality makes them who they are and you shouldn't judge a book by its cover. An atractive person can be mean and not worth dating while a person that isn't atractive can be a very kind person, it can also be the oposite, looks isn't what makes a perosn who they are or decides they're personality.",
            "Because they themselves look good",
            "Looks matter to meet someone, especially when you're young, but matter progressively less as you go through more relationships that end for non-physical reasons. Of course there are counter-examples, but almost everyone I know became less superficial with age. We narrativize this as people \"settling\" but my experience is that those relationships are more likely to be happy and fulfilling because people are generally made more self-aware and more humble by experience (and failure) which are traits that are conducive to healthy relationships. ",
            "It does matter, but not as much as you think. What looks does is simply make things a bit easier for you. If you’re a woman who’s really hot then it makes the biggest difference yea. But as a guy even a 8-9/10 in the looks department only just gets more tolerance for mistakes you can’t be a bum loser with no game and still succeed.\n\nSo in all cases just not being a loser (working on yourself) and learning how to interact with women is a requirement. And if you do both of those well you can succeed above your physical level.\n\nBut most would rather complain because it isn’t easy.\n\nIf it was easy everyone would do it.",
            "Yup especially for men a woman is mainly just her looks. Being a not so pretty person I can vouch for that.",
            "Are u to much on Reddit or where do u get that take?",
            "Copium.",
            "People don’t. They claim that looks aren’t the only or most important.",
            "Because they're ugly",
            "Because everyone is terrified of being called immoral",
            "The only people who say that are the ones privileged with them. If they didn’t have them they would be singing a much different tune. Just like rich people who claim that ‘money isn’t everything.’ If they were broke they would and couldn’t pay their bills they would not he saying that.",
            "It is an important aspect of a relationship, especially at the beginning when you don’t know their personality or interests or your interpersonal dynamic. \n\nI feel like people say looks don’t matter because there is no emotionality to acknowledging if someone is “relationship-worthy”. Purely logical. \n\nWe’ve met plenty of amazing people in our lives that we can admire but would not marry. It’s a fine balance of physical attraction and emotional attraction, albeit emotional attraction takes more precedence than physical attraction as relationships mature.",
            "Are people unattractive or do they not excel at grooming/presenting themselves?\n\nA lot of \"ugly\" people just have ugly style and body language imo (and I'm including everything from hair styles and facial hair, to makeup application, how their clothes FIT, i.e., not about brands and even their posture and how they carry themselves). And sure, some people have quirks to how they look but personally I don't think that's inherently unattractive, it's just different.\n\nAnd I think that then feeds into peoples' lack of confidence: they think they are unattractive and thus, unlikeable, they behave like that. For example, if someone's body language is hunched over and rounded shoulders with their head down all the time, I personally can't find meekness and self-consciousness attractive. It's a self-fulfilling prophecy.",
            "I once gave a pity date to a guy I had met drunk the night before, he wasn’t very attractive and I wasn’t really looking forward to the date. He ended up being very well educated and had travelled a lot, we spent the entire day talking and I ended up dating him, I fell pretty hard. I could see people give a surprised or even disapproving look when I would show up places with him. In the end I wanted something more serious and he didn’t! Attraction is a funny thing and yes, I think there needs to be some level of physical attraction (even just pheromones) but intellectual/emotional can be pretty powerful too.",
            "Ok, look matters. But not in long distance.",
            "people dont want to appear shallow",
            "People say that to sound magnanimous and open-minded. We all care about what others think of us (even if we claim we dont care).\n\nNow because someone's looks is a burning topic in society and in one's head, this is where everyone will be interested to hear what others believe and that is a perfect opportunity to sell yourself as 'open-minded' or 'laid back' kind of generous person.",
            "I don’t have a clue.  Looks are so important in getting selected for a relationship (I approached my wife back in the day because she had a pretty face and a nice rack) and advancing or getting hired  in certain fields.  It’s a fact.  \n\nI guess the answer is that people say things like that because they are wrong.",
            "I thihnk you make a point, it's dumb to say it doesn't matter. I just want to also say, very very few people are so unattractive that they couldn't put some work into losing weight, their hair, nails, skin, maybe teeth, maybe attire and still couldn't join the average dating pool without any massive limitations. Most people who talk like this have given up or put no effort into that stuff.",
            "They're lying because reality makes them uncomfortable lol or they want to feel superior to people who say the truth.\n\nWhen it comes to attraction looks are extremely important. If someone's looks hit all the bare minimum attraction boxes for you, that's when you can actually feel attracted romantically to the person. This does NOT mean we all have to be conventionally beautiful for someone to be attracted to us, not at all, and maybe that's what some people mean when they say looks don't matter (looks don't matter as in you don't need to look conventionally attractive to be attractive to me or someone), but it does mean that if your looks aren't attractive to a person, you probably won't be seen in a romantic light to them. I know I've met many conventionally beautiful people I felt 0 attraction towards and viceversa. And there's nothing wrong with it either. Romance implies a degree of physical and sexual intimacy that would quickly become uncomfortable or worse if you were to force yourself to do it with someone you don't feel attraction to.\n\n\nWhat we SHOULD say, and act accordingly, is that looks shouldn't impact how you're treated or your worth, but even then that's just wishful thinking. Just ask fat and obese people, ugly women, short men, anyone that societal standards would deem undesirable: they'll tell you that best case scenario they're invisible, worst case scenario they're the target of bullying and mockery if not worse.",
            "Jeez, do most Redditors not understand looks and their importance are subjective?",
            "Because attraction can grow over time with someone who you thought wasn't that attractive. Once you get to know them they look hotter every day",
            "You will only understand when you have lived a few years with your masturbation substitute and realised that you hate her as a person. Been there done it got the vest!",
            "To manipulate people to like them despite being ugly. And especially ugly because of lazy, unhealthy or whatever fucked up decisions they make.",
            "Not mature enough, don't want to be judged, or want to pretend to be better, or they are just lying to themselves and those around them. Looks definitely do matter for romantic relationships.",
            "Looks don’t have to be important when you possess other types of charm. Not all charming people are good looking",
            "I would moreso say that people’s attractiveness, or more generally their outward appearance, is the least interesting thing about them :P",
            "Looks initiates the relationship, personality maintains it.",
            "Nor exactly looks but chemistry. That os important no matter what you say.",
            "Idk gives them the moral high ground \n \nPlus like that one show where someone said “a woman pretty is like a man being rich”obviously looks isn’t the only thing to look for in someone, but it’s good to have",
            "Because it causes depression, social anxiety, racism, fat shaming, lookism, nazism, sexism, eugenics, anorexia, dysmorphophobia etc. It sends a message not to enjoy life, but We actually want to live in a healthy positive pleasure-accepting world. It may pressure people to go to plastic surgery thus taking away their freedom to decide over their own bodies.\n\nYou can get love from pets, friends and sex from your hand, toys and sex workers.",
            "To make themselves feel better about their looks or to avoid admitting that looks do matter in choosing a partner. It is easier to make a blanket statement that something does not matter than it is to consistently go to the gym or take care of your hygiene.",
            "Because they arent",
            "People are self righteous. Make them feel superior.",
            "It's either virtue signalling or denyle ",
            "People who say this have great personalities. Do you want me to set you up on a blind date?",
            "I used to work with a woman who was not conventionally attractive by any standards but she had this sort of “inner light” that shone through and lit up the room. It’s hard to describe but if you’ve ever experienced it you’ll know what I mean.",
            "Attractive people dont have to look good its not connected\n\n( ͡° ͜ʖ ͡°)",
            "Because if I tell you \"I'm very attracted to that person\" and you look at them and think \"jeeze they're ugly fucking why?\" \n\nThen I can either explain that we're all attracted to different looks and personal taste matters and hope you understand it. \n\nOr I can boil it down to looks don't matter.",
            "They aren’t. There are plenty of rich men/rock stars out there who are very definitely not attractive to look at.\nAnd yet they seem to get good looking partners. \nSo this is the proof that looks are not important. \n\nLooks are just an aspect, you can be less attractive to look at but have other things that are appealing. \nAnd you still have to put the effort into your looks, no-one likes people who do even try to dress up/groom - not because of the outcome, but a lack of effort is definitely unattractive",
            "Its an outdated (like everything they do) lie that BabyBoomers told their children because it sounds like something a good parent would say. Incidentally, it can be argued that as a Generation, BabyBoomers weren't the best of parental figures.\n\n\nOther lies told by BabyBoomers include:\n\n\n- \"money doesn't buy happiness\" (although this was said since ancient Roman times I think)\n\n\n- \"sticks and stones can break your bones but words will never hurt you.\"\n\n\n- \"life (must be) hard.\"\n\n\n- \"You will be rewarded for hard work.\"\n\n\n- \"be kind to others and they'll be kind to you.\"",
            "I absolutely care about looks. I need to be physically attracted to someone for the initial pull, and throughout the relationship too. They need to be good-looking, period. BUT I see so many people in couples (even with families) where one of them is really not attractive, and that tells me their partner doesn't care. So it's a real thing.",
            "Same with me. You can be a 10 out of 10 but if you are a bad person i'm simply not attracted to you",
            "This is so true. Once you’re with someone their looks only become an identifying factor. Literally you fall in love with how they look, they become comfort. For example if you grow up in a lame house, healthy family, then you move out it will be incredibly painful for you because that lame house became your home. You grew attached and found it beautiful. This is why I’m not picky with looks as long as the person is like a 5-6/10 that’s perfect for me because I really don’t care. Looks fade when hearts intertwine. And the heart ends up covering the face.",
            "it changes with your perceptions and opinions.\npeople don't change like that.\n\n\n\n\neverything about attractiveness is a gained social construct, that can be easily changed with some therapy and efforts.",
            "Very well said.",
            "This is how the real world works. \n\nThe problem is that many people who ask this question, or say they don’t understand, are thinking of how important looks are when scrolling porn, swiping profiles, or checking out girls on the street. ",
            "Facts",
            "Then there was always an attraction there at some level. Was she the “ideal” attractiveness you have developed in your mind no but there was an attraction there. \n\nWe can’t help it we are visual creatures us Homo sapiens. We make judgments from visual cues every waking second. \n\nWhat’s messed up is the same people who say looks aren’t important generally don’t live by those standards. Looks are important they get you in the door but you can be pushed back out with a shitty personality",
            "The Shallow Hal coefficient in action lol",
            "Correct answer. And the fact that OP later goes on to talk about people in terms of \"1-4s\" shows that this post is incel ragebait.\n\nLooks are important because pretty privilege is real. \n\nBUT!!!\n\nPeople say looks aren't important because pretty much anyone is cute when they smile, and being charming/funny/witty/kind/compassionate/interesting is much more important than being {good looking + obnoxious/unfunny/dull/callous/cruel/boring}\n\nYou virgins reading this thread for validation about being spiteful losers should shape up and try to work on yourselves. Read a book about how not to be obnoxious - it will help you do better in life more generally. Listen to women about what they're looking for and not sex trafficker Andrew Tate or misogynist prude Roosh V.",
            "It’s Reddit. Either virtue signaling or people are so unconscious of their automatic filtering when judging others.",
            "There was just a thread on r/marriage where the wife gained close to 100 lbs I think. Full of comments about how if you're bothered by that you don't truly love your spouse, blah blah blah. True attraction is in their soul or whatever. I'm sure all of those people dressed as frumpily and poorly as possible while dating to weed out anyone superficial enough to possibly care about physical attraction.",
            "lemme guess: it follows the same formula as posts like \"do women care about height? I'm 5'5\"?",
            "They would definitely not say looks don't matter if they didn't have the looks",
            "Here's the deal with money from a poor man's perspective, it buys time for you to take care of everything that is important, material wealth doesnt matter if everything else is fucked, that's why rich people commit suicide",
            "True, none of the attractive girls care about looks or money - their guy just happen to be muscular 6‘3“ and have a well paid management position",
            "Money is useful in many fields, make your life easier, but attracts only women of a certain kind, not worth to know.",
            "finally, some brains. einstein's out here making grand revelations on par with \"humans like sexy things\" and \"human characteristics other than physical appearance exist\". it's how those two paradigms co-mingle that matters! who wants to spend their life with \n\na) a god/dess of beauty that is literally an \\[e\\]motionless doll or \n\nb) a paragon of mimicking the human experience that has no body, hormones, circadian rhythm or any other miscellaneous setting that governs our lives?",
            "Yup. Women also care about height, money, race, status, personality, compatibility, and hair (or lack of it).",
            "And that's true.",
            "Get this man to the top of the thread!\n\nAlso, good job on getting it a better place for yourself!",
            "Yup. Women also care about height, money, race, status, personality, compatibility, and hair (or lack of it).",
            "Bingo",
            "Has the meaning of this word changed? Because it ever makes sense in the context it's used on reddit.",
            "Yep. I basically say I don’t have a type at this point because I’ve been attracted to all sorts of men. Also my two exes were the exact opposites. Never thought I’d date someone tall, always stuck to short. Turns out I don’t care about height as much as I thought I would.",
            "Same same. I've ended up in relationships with people I initially didn't think were attractive until I got to know them. It's not like I magically started seeing a different face or something, but it's like they just became more attractive to me.",
            "I think you are probably right about looks mattering less to women. I can say that as a woman I've ended up attracted to men who are below average in appearance because they have other strong qualities like being intelligent, empathic, and having a strong character. Or just being really interesting. Often my initial attraction is about looks, but when I give a less attractive guy a chance, I sometimes develop an attraction to him based on other qualities. Attraction is an interesting phenomenon.",
            "Yup. Women also care about height, money, race, status, personality, compatibility, and hair (or lack of it).",
            "Probably because you are not as nervous",
            "If by “character” you actually mean height, money and facial structure then sure, otherwise you’re just straight up lying",
            "I don't know about that to be honest. It seems much easier for men to get locked out of the dating game entirely because of physical flaws. If you look too feminine but not beautiful/handsome, you're out, if you're short and bald and otherwise meh, you're out, if you're too heavy and boyish looking... you get the picture.",
            "It's funny how everytime this comes up Redditors act as if character is the only thing that matters.",
            "I totally agree with you. When I first met my now husband, I wasn't physically attracted to him. But when I got to know him, I fell head over heels in love. Mainly because of his integrity and strong moral character. He is the most honest and trustworthy person I've ever known. I find this insanely attractive.",
            "But if you find some physically unattractive, you don't want to date that perrson.",
            "But people tend to find the same people unattractive. Nobody finds an ugly person physically attractive.",
            "This is it. Outside of polygamy and outright cheating, we date one person at a time. Doesn’t matter if the world thinks you’re the elephant man, if you have that one person you genuinely love who genuinely loves you back, you’re golden. Conversely, the alpha dreamboat could get any woman, but could end up in a miserable relationship.",
            "This is one of the few legit answers. Looks stop mattering much once you've been there, done that. And realize there's nothing at the end of the road of desire. You may expect happiness, but all there is is the lack of desire in that aspect, while everything else remains. A beautiful face turns to a familiar face. Importantly, whose actions significantly impact the quality of your days/life, while their appearance does not.\n\nThere are lots of answers here from people who have never been with someone attractive-enough and fantasize about how it feels or how important it is. They will change their minds once they have it for more than a few weeks.\n\nThat's why people say that appearance isn't that important. Its value sharply decreases the more people understand its (lack of) value in the long run. And its value lies primarily in the fact that people who have never had it, desire it.",
            "I don't think that only people with great personalities say this. This is a common claim, made by all sorts of people. And I've seen some awful people insist on it as well.",
            "To be honest, I've never looked at a man, that a woman was attracted to, and thought he was super ugly. So far I could always see why she loved him.",
            "That still means that looks matter a lot then. Because there are people who are 1-4s.",
            "The last two sentences moved my core.",
            "There doesn't have to be an initial physical attraction when it comes to me developing feelings for someone and pursuing a relationship. An ugly woman can become the most beautiful woman on the planet if she has other traits that I view as being crucial in a potential partner. I have fallen in love with women that I didn't find attractive upon meeting them, and I've fallen out of love with women that I was immediately physically attracted to. Those dating experiences have shown me that being attracted to someone or not right away isn't an important factor in pursuing a relationship with someone because my attraction to them changes based on my connection with them.",
            "Excuse me? u/PrinceOfNightSky used the number scale, which I merely replied to.",
            "even babies and chickens prefer attractive faces.\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2566458/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2566458/)\n\n[https://pubmed.ncbi.nlm.nih.gov/26192929/](https://pubmed.ncbi.nlm.nih.gov/26192929/)\n\n  \nif you still believe beauty is subjective in 2024 you're functioning at the level of flat earthers and climate change deniers, almost all features humans deem attractive are health indicators and they vary very little among different cultures or eras, the ideal in the stone age was already depicted on cave paintings as tall slender and broad.",
            "Go to any of the dating subreddits there are 20 posts a day that all start the same. “He’s a nice guy but” with but being lack of physical attractiveness.",
            "Not so short to become a problem.",
            "One experience of just asking if some1 needs help or just saying hi that gets a frightened or distrustful response and that belief would go right out the window",
            "Also their guy happens to be a certain race",
            "And most people whining online are severely lackikg in personality akd compatibility.",
            "Totally agree with this!",
            "What made them below average?",
            "Yup. Women also care about height, money, race, status, personality, compatibility, and hair (or lack of it).",
            "It depends on the person, but generally, in the end, a man's character and so on matter. Of course, everyone has their \"type.\" Ironically, when I look at celebrities, I like blond men with blue eyes. In real life, most of those who have romantically interested me are brunettes.",
            "Unless you meet them and really like them. Then you might.",
            "Yeah, that's it!",
            "The thing is the rating scale is subjective. Many people will find 1-4s as 6-10s. I was speaking about me personally going for a 5 minimum. There are others out there who don’t care if you’re a 1-4.  I wish to be so pure like this. I am working on it. Looks aren’t irrelevant to most of society but the point we are trying to make is as long as you are loving someone for their heart and vice versa, which is true love, looks aren’t that important. (and believe me a fresh cut, working out, good dressing, and good grooming can make ANYONE a 5 at least.)",
            "I appreciate you so much bro! Much love to you.",
            "Yeah but they went on to say that one person's 1-4 is another's 6+, while you suggest that some people are simply 1-3s (who are all single)\n\nTheir scale is relative and nuanced, while yours is absolute and definitional.",
            "It’s crazy. People need to get over it on Reddit. In other threads, they’ll intuitively know why it’s funny (and laugh!) that the hot girl who’s just met her short, bald, fat blind date ….is backing off and looking disappointed, and that’s a comedy skit. But when they’re asked if looks matter, they act all po-faced and serious and say “of course not”.",
            " What *causes* climate change is the debate.   Its obviously been happening on this planet since the very beginning.\n\nOtherwise I fully agree with your views on beauty.",
            "As in, but physically unattractive? Yep. In that sense, “nice guy” is utterly irrelevant.",
            "Oh good lord. It's just absolutely sickening that attractive people are SCARED of you just because you're not attractive. Like, since when did not being attractive make you an incel or potential terrorist?",
            "Most likely the way you’re saying things than how you look. I’ve seen some very ugly people get good responses because they were still smiling with confident and kind eye contact. And looked like they took care of themselves as well as they could.",
            "Dating your own race is usually the best edge you can get",
            "Poor grooming (especially facial hair), height (lack of it), unflattering fashion sense, poor physical fitness. Those are few things that come to mind in guys I've dated that were initial turnoffs, but I later didn't care about once I got to know them.",
            "I don't think that anyone would consider a short bald guy who doesn't have the most attractive face either to be a 5, just because he works out and is dressed and groomed well.\n\nAnd the 1-3s I've met have always been single so far. I don't know, maybe it depends on where you live.",
            "Some people are just less attractive, I don't think we have to argue about that. I just used numbers to illustrate that, because they were already used in the post I replied to.",
            "up to 76% of the adult population is estimated to be some variation of skinnyfat to obese so you can sort of figure why they need to cope, it's even worse in some western countries with up to 90%+ of all men being affected.\n\n[https://www.researchgate.net/publication/318666609\\_Overfat\\_Adults\\_and\\_Children\\_in\\_Developed\\_Countries\\_The\\_Public\\_Health\\_Importance\\_of\\_Identifying\\_Excess\\_Body\\_Fat](https://www.researchgate.net/publication/318666609_Overfat_Adults_and_Children_in_Developed_Countries_The_Public_Health_Importance_of_Identifying_Excess_Body_Fat)\n\n  \nthe recent culture of americans preferring 'thick' or 'curvy' bodies is most likely an evolutionary coping mechanism, because they've got two choices, either they're bumping uglies or they're simply not getting laid, there's no other option.\n\nImprovise. Adapt. Overcome",
            "What causes climate change is only a debate because of the dumbest of the dumb motherfuckers on our planet. Scientifically the consensus is clear: it's humans.",
            "Yes they feel guilty because they realize how important physical attractiveness is.\n\nI wish people were just more honest about it.",
            "They’re not scared of you. They sense you have an agenda most likely because you don’t smile.",
            "There are couples with people missing limbs and melted faces. Hawking was cheating on his wife with a nurse. Most dads look like potatoes. It's safe to say there is love literally for everyone with good personality OR with a bad personality that matches the other person. The numerical scale exists only on the internet and shallow cellebrity/rich people circles.",
            "Peter Dinklage and Jack Black are anything but stereotypically handsome and yet hotter than many",
            "It’s because usually attraction is degraded heavily by self confidence. Confidence is everything. Whether you’re gloomy or think you’re ugly that energy will surround your aura. Haven’t you seen people like Pete Davidson? I’m not saying he’s ugly but he’s definitely no model and he’s pulled the most GORGEOUS WOMEN. Heck I’m a 5 and I have gotten the pleasure to be with girls who are absolute eye candy. \n\nAll the 1-3s you’ve met have no confidence in themselves. You don’t even gotta go out anymore to talk to people. Just use any app talk online and meet up. \n\nIdk if you’re the short bald guy, but I guarantee you proper grooming, style, confidence, body sculpting will make you at least a 5. Infact I can help you out if you want, on how to maximize your looks. There’s plenty of subreddits here on how to max your appearance. But you can contact me if you want as well. \n\nThis world is amazing bro if we can have abnormalities of evil people, you really think someone can’t find you hot? Preposterous my good lad.",
            ">I don't think that anyone would consider a short bald guy who doesn't have the most attractive face either to be a 5, just because he works out and is dressed and groomed well.\n\nIf your statement was true, there would be no short bald guys in relationships/marriages. Yet, there are. And no, not all of them found their partners when they were younger with hair lol. \n\nDoesn't this simple fact make you rethink your opinion? I genuinely don't understand people like you because there are so many unattractive people dating someone, having families, etc. I don't believe you have never met 1-3s in relationship. You probably don't notice them.",
            "Short bald guys with a dumpy look still get laid if they're funny and charming. Chicks dig silly little guys. Just being fun and disarming moves you pretty substantially on the 1-10 scale. For most women, you have to come across as a bit of a tool to be definitively unattractive.\n\nThe fact that you specifically mentioned baldness as an unattractive trait tells me you've been taking dating advice and perspectives from the internet manosphere. Gotta tell you man, they just want you to buy their shit, and making you feel inadequate is a major pillar of the sales pitch.",
            "Fair enough. Just be aware that this kind of language is used by incels and other similar people whose attitude is also unattractive by default. \n\nDefeatist attitude is also less attractive. I know because I wore one for several years and it got me nowhere, both in terms of relationships and life in general.",
            "Again, agree. The dishonesty in these threads is hilarious. Can you imagine a thread exclusively about how female looks aren’t important? It would be rightfully pilloried and mocked on Reddit. Looks are important across the board, regardless of the sex. It was ever thus.",
            "Me too. It’s a drag that people pretend it’s not important when I’ve seen in all my 52 years how important it is. There’s actually less shame in admitting it matters than pretending to it doesn’t matter, while acting like it does.",
            "I don't mean to turn this into a therapy session but like how does one not have an agenda? How is this even possible? Are you telling me you had emotionally mature parents?",
            "Most dads look at least average though. People just make the mistake and use older people as examples, even though the relationship started when they were younger and more attractive.",
            "Not ugly though. Jack Black is just overweight, but otherwise has pretty good features I'd say. Plus they're celebrities, so other rules apply.",
            "Exceptions prove the rule",
            "You are awesome u/PrinceOfNightSky",
            "Pete Davidson is attractive. He has a top-tier jaw and high status and top-tier personality. But confidence comes from the experiences you've had. The truth is that if you have a subhuman skull, no gym or grooming can help you be attractive",
            "The younger short bald guys in relationships I've seen, were just very handsome in all other areas. Face, body, masculine features, no other real flaws. If you take an extremely attractive man, shrink him and remove his hair, he'll still be attractive. Take an average or slightly below average man and do the same, and he just won't be physically attractive. \n\nIf I saw these kinds of men in relationships on a somewhat regular basis, my opinion wouldn't have formed or lasted. I just don't have a single example that contradicts my opinion, which isn't some sort of world famous celebrity.\n\nPlus, I really mean romantic relationships, where both partners genuinely love each other and aren't just together because they fear loneliness.",
            "I guess on the plus side I used my eyes and saw how important it was and simply optimized for it.",
            "No I have been working on myself. It’s a problem I used to have but might still have room for improvement.\n\nThe key with all interactions is learning to calibrate. And not being outcome oriented.\n\nRather than having an agenda of “I want to hook up with this person”.\n\nYou can have a mindset of “I’m interested in this person and I will try to make them as interested in me as possible”\n\nYou may actually reach your outcome in more situations that way because someone who becomes very interested in you will likely want the same outcome.\n\nBut because you have an agenda and they’re not there with you, yet, you may get rejected for being uncalibrated.\n\nThe solution to calibration is more experience. And I might even suggest getting a coach or at least subtly recording the audio of your interactions and reviewing them back with yourself to see areas of improvement.\n\nAnd again, smiling dramatically reduces the sense of an agenda. Because it makes them feel like you know you’re going to provide something of value (such as fun). When you’re serious it looks like you want something from them.",
            "You ignored all the other things I said lol. One thing I will agree with you though - if you don't look like a model, you will have a harder time dating models if you dont have fame/money/insane charisma. But doesn't it make logical sense? If you were a 10/10 famous model or actor would you date an average looking unfit girl? And also, there are still couples like that, you just need to be extremely lucky to find that person. Dwelling on it won't help.",
            "come on, people would've had a different opinion on Peter's looks if he wasn't impeccably groomed and didn't carry himself the way he does.\n\nJack is short, with a receding hairline and regular dude features. for some, it is enough to consider themselves beyond salvation.",
            "exceptions prove that the rule has been formulated, not that it is correct.",
            "Confidence does not come from experiences you had. It comes from belief in yourself. Experience helps with that, and guess what talk to a 100 girls and you’ll never feel not confident again. The only real unattractive people are those who go through severe things like burns, or skull issues, or accidents. Even those people find love! But if you’re a regular person you can at least become a 5. And even then there are plenty of people who will find you attractive. You’d be surprised at this.",
            "I really wish you virgins would stop talking about \"high status\". \n \nThere's no bigger tell that you have never seen a real live boob beyond possibly your mother's.",
            "All we can do is adapt and optimize to actual reality, not the romanticized version society wants us to believe. The gap between that societal perception and actual reality is very dangerous to the individual.",
            "Yeah mean I mean, the non-needy mindset makes sense. I just sometimes feel as if the only way to getting there is actually having the experience of *being* there which means someone is giving you the validation. And if you literally never had that experience, I guess the only way there is to maybe like work on your self-esteem or something, so that even if the interaction fails you still think oh ok cool but I still have fun shit going on in my life. \n\n  \nTBH I find interacting audio without consent super sketchy.",
            "But that is pretty much what I mean, because the same applies to average people.\n\nIf you're an average person, would you date an ugly person? \n\nAnd that's why ugly people can't really experience normal love and relationships. Because the only people they're supposed to date are ugly themselves. And ugly people differ from average people only in their outer appearance, not in their eyes, brains or desires. Ugly people don't magically find other ugly people attractive. So when it comes to dating, the only options they have is stay single or date people they don't really like.",
            "For some it may be, but those are a tiny minority of people. If you look like Jack Black you won't have any serious problems attracting women. Famous or not.",
            "also Dinklage is an amazing personality and very attractive but I dont think many women would actively want to go out with him long term because of the associatied stigma of him being a dwarf - he would not be representative of a wider community of individual people. Jack black is a funny guy who seems like someone who would be fun to be around, he isnt stereotypically unattractive either so I dont see why you would bring him up as an argument.\n\nPerhaps it would be best to define some terms, I believe OP is asking about people you would go out with and have a relationship which you appear to have confused with people who others would find are hot (attractive/handsome etc).",
            "“Confidence without evidence is often arrogance” is a saying that usually pops in my head whenever the confidence topic comes up. I could be confident that I’ve got some serious sex appeal! No one’s agreed with me yet, but hey…what do they know?\n\nThe irony to me is that people seem to care *so much* about confidence, that it actually would be better to just er on the side of arrogance than it is be to be too shy and humble.",
            "A 5 is still unattractive. Belief in yourself comes from experience. You can’t believe in yourself if you’re rejected from everyone in your life and ridiculed constantly",
            "That and the fucking phrenology, seriously",
            "I have a girlfriend bro",
            "maybe you should be less shallow",
            "Confidence in dating isn't to me that someone thinks they are grand and awesome beyond belief. It boils down more to being comfortable with your own shortcomings and not letting them overcome you. Like, you can be bald and not muscular, but if you make that your entire personality,that will become self fulfiling prophecy.",
            "By confidence you just have to believe in your worth as a human being. And not be afraid to talk about your wants and hobbies and outlooks. You are a human and so is the recipient. Nothing about them makes them better than you in terms of having a heartfelt convo. One should be excited for every talking opportunity.",
            "Belief can also come from God and self worth. Even if you are ridiculed by those around you, then you shall overcome. I did it and so can others. And a 5 is passable. It’s a number scale it’s straightforward",
            "Good on you champ, I noticed you haven't contradicted my two key claims though\n\nETA: OMFG you posted on r/NoFap. I'm dying."
        ]
    },
    "How to get 13 year old to quit doing drugs?": {
        "title": "How to get 13 year old to quit doing drugs?",
        "score": 376,
        "url": "https://www.reddit.com/r/ask/comments/1dlkue3/how_to_get_13_year_old_to_quit_doing_drugs/",
        "content": "My 13 year old sister is constantly doing stupid shit. Vapes, weed pens, talking unidentified pills. And most recently talking a bunch of Benadryl. She also has had a seizure( likely due to NyQuil and weed pen at the same time)\n\nshe’s depressed but she refuses to talk to anyone. We’ve tried therapy twice but she won’t participate. \n\nThe family is constantly stressed because of this. And we’re all at a loss of what to do",
        "num_comments": 362,
        "comments": [
            "# Message to all users:\n\nThis is a reminder to please read and follow:\n\n* [Our rules](https://www.reddit.com/r/ask/about/rules)\n* [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439)\n* [Reddit Content Policy](https://www.redditinc.com/policies/content-policy)\n\nWhen posting and commenting.\n\n---\n\nEspecially remember Rule 1: `Be polite and civil`.\n\n* Be polite and courteous to each other. Do not be mean, insulting or disrespectful to any other user on this subreddit.\n* Do not harass or annoy others in any way.\n* Do not catfish. Catfishing is the luring of somebody into an online friendship through a fake online persona. This includes any lying or deceit.\n\n---\n\nYou *will* be banned if you are homophobic, transphobic, racist, sexist or bigoted in any way.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ask) if you have any questions or concerns.*",
            "I know someone with a child exactly like this. No one could discern what was wrong with the girl, she acted just like how you describe your sister’s actions. One day the father received a call from the FBI saying that they had arrested a child molester and identified the girl as one of the victims through his phone. She was able to get some help after people knew what was going on with the poor girl. \n\nI’m not going to assume things are so drastic with your sister, but *something* is bothering her, and that something will require professional intervention. Good luck and I hope all is well.",
            "If she was my 13 yr old child I'd be looking at compulsory rehab and psychiatric care. High THC and random chemicals can be catastrophic to the developing brain of such a young person. You're describing a crisis that requires authoritarian intervention IMHO.",
            "Something is wrong and I bet she is ashamed to talk about it.",
            "Sounds like she's on a real path to self destruction.\n\nSounds like the best you can do is tell her that if she needs to talk about anything, no matter what, that you're there to listen and you'll always be there for her. Make sure she takes what you say seriously.\n\nIf she's had some problems she might open up to you.",
            "I wonder what led her to get to the point of trying those things and not wanting to talk to anyone.",
            "wow 13 is scary young for that. I mean if your parents already know and she's still doing it she sure asf has a lot more freedom than she should. She's getting out and getting those things somewhere. She needs to go to a rehab facility.",
            "Well reading your post history your sister is doing drugs, not leaving the house, has an incredibly dirty room to the point of mold and disgusting smells.\n\nDepression. Your sister is depressed and needs serious help.",
            "Maybe take her to someone who isn't a therapist first. There are social workers that specialise in such matters and are maybe they are able to break the ice without making her feel like she is being forced",
            "I’m a recovering addict. Something is bothering your sister really bad. Something happened or she is not understanding her feelings. Depression has many faces. She needs help with whatever is causing her to turn to the substances. It will only get worse from here unless the true problem is dealt with. If she is messing around with pills; that is not to mess with. You have no clue what’s in those pills nowadays. And if she is getting them from family and friends medicine cabinet, which I did, she needs help like yesterday. \n\nAre YOU close with your sister? Are you able to sit her down and tell her how much you love her and that you are there for her? Tearing someone down when they are depressed only fuels the fire. If you are not the answer maybe a teacher she admires? Or a friend, anyone who she is close with. \n\nI hate to say this, but ultimately this is your sisters choice to stop or not stop. From personal experience, someone “telling” me to just stop only made me do it more.  Because to me, they didn’t understand the hurt I was feeling. \n\nI’m not sure if I gave you any answers and I’m sorry about that. My heart goes out to you and your family. Your sister will be in my prayers. Healing her mind and heart is where the focus needs to be. Best of luck. ❤️‍🩹",
            "I find that when children won't talk to their parents it's because of a few factors. Could be one, or more. I don't mean for this to come off as judgmental, or that you're a bad parent.\n\nKids tend to stop sharing with their parents when they're used to getting in trouble for mundane things.  Breaking a plate/glass shouldn't require yelling, or discipline.\n\nKids also tend to shut out their parents when there is a lack of positive interaction. If they only hear about their flaws or ways to improve but never hear how they're doing a great job can take its toll on kids.\n\nLack of proper communication between parents and kids can also have an effect. It shouldn't be a one way street, even if you know best. \n\nControlling parents is probably the number 1 contributor to a kid not being open and honest with their parent. We all know, we made the exact mistake your kid is about to make. And we want to save them from that, but kids need to learn on their own sometimes. Those experiences are what lead to well adjusted adults.\n\nAnd a general lack of respect by the parents. You're the adult, yes, but that's your kid. And they learn from example, so if you cut them off mid sentences that teaches them their words/thoughts have little to no value.\n\nLasty inappropriate/inconsistent discipline can easily lead to a breakdown in honest communication. A constant argument is not healthy for either the child or parent. Too often a simple stern talking to turns into being grounded. Or you tell your kid they're grounded for X amount of days but never follow through. As a parent, you set the rules and the consequences. You also have to uphold that consistently. You can't tell your kid they're grounded for a week, but give up on it yourself after 3 days. You're teaching them consequences don't matter, aren't real.\n\nFor the particular scenario, as bad as it might sound, I would recommend asking your kid to have a sit down, not right this instant! Let her prepare herself, her thoughts. Emphasize that no disciplinary actions are going to happen as a result of your talk. Try not to push her to talk more than she wants, and make sure you show empathy. If she doesn't talk, then you can sit and hug her, reassuring you're not mad, you're scared and hurt that it's gotten to this point, and she feels she can't talk to you. For your part, the less you talk and stay quiet when she pauses, the better. \n\nYou want her to do the talking and open up. And that'll only happen when she trusts that you're there to help. And maybe that \"help\" means backing off, and just asking her to keep you in the loop. Ask her to stay home when she does the drugs, so that you know exactly where she is and if she's okay. \"I don't want you doing drugs, it's dangerous and makes me worry about you. But if you're going to do drugs, then I'd rather you do them here. That way if anything bad does happen, you have me to come to. And that means I'll do whatever is necessary right then. When you're ready to talk to me, I'm here. I just need you to know that I care, I yell because I care, we fight because I care.\"",
            "Op You can't put people through help that they dont want\n\n\n\nUnfortunately she's ready when she's ready \n\n\nJust be there for her",
            "Are you the older sibling?\n\nI am a mental health therapist who specializes in addiction in adolescents, so this thread caught my attention. \n\nYou can’t compel a person to do anything they don’t want to do. That’s a foundational truth in mental health, too. The best therapist can’t make a person healthy - they have to want it and pursue it on their own.\n\nSo to put it plainly, extra chores, grounding, compulsory counseling, etc., won’t help. It may even do harm. \n\nIf you’re the older sibling, do what you can to build a really close friendship with her, with no judgment and no frustration. In the field we call this unconditional positive regard.  \n\nBecome her confidant. Do it expecting nothing and it will open the doors to open conversation. \n\nIn my experience, kids really want and need a person who is fully in their corner and who they can open up to about anything. \n\nAnother commenter mentioned shame. I suspect that’s really good insight. She is likely running from something. \n\nI’m good at my job because I’m good at making meaningful connections with kids. We often don’t focus on addiction, behaviors, etc., for the first few weeks. Instead we focus on the student’s story. I take a genuine interest in them. \n\nThink of the drug as a symptom of the problem rather than the problem itself. If you can build a relationship that allows her to be open about the real underlying problem, you’ll be making real progress. \n\nInvite her to do things with you. If you’re driving, take her to get fast food with you, movies, etc. If she won’t do it, randomly bring her ice cream. Recruit your parents into the plan to fund these expeditions if you need to. \n\nGenuinely, this is just loving her in real outward, I intentional ways. ",
            "You need to change her environment immediately and get her into therapy. New school, home school, have her live with family in another town, anything.",
            "This problem started a long time ago OP.",
            "She has to talk to a therapist. Sounds like she’s self medicating. Has she always been like this or is it recent? Any way she has suffered some abuse that nobody knows of?",
            "I came to see the answers, assuming the best ones would say the same thing basically: \n\nIt sounds like you don't have to have a relationship where you can get her to talk to you honestly.  \n\nIf you don't have that, you have to establish one if you want to help her.  It may come down to sitting down with her and sharing something vulnerable about yourself.   Even starting the conversation with a shared experience.  Good or bad... but good is better. \n\nI wouldn't first bring up the issue you are worried about.  Get her trust by sharing your own vulnerablity.  \n\nAt some point you have to tell her you are \"worried about her, and that sounds selfish, but you really want to listen.\"  \n\nAnd also tell her that if she isn't comfortable talking to you, ask her who she would trust to talk to.  We can't do this all alone. \n\nLet her talk if she will. \n\n  \nThere are a lot of reasons kids get stuck doing drugs to cope.  They either need someone in the short term to help them cope, and longer term to work on themselves in a way to live with the stress and trauma of life. \n\n  \nBTW, people dont' get seizures from NyQuil and THC... you can get that from alcohol and BZD withdrawl.  That is concerning.  When she had her seizure was she admitted to the ER?   If so they would have disclosed to your parent(s) what her drug tox screen was.  She's 13, they would have to by law.   Based on what could have been in her system, the advice might be different and more agressive. \n\nCompassion and empathy over judgement.   Kids will hide everything when there is judgement.",
            "Been there. You probably have shit parents. That's just an outcome",
            "She could also have undiagnosed adhd and/or autism, which cause people to feel deeply & therefore have a harder time with big emotions or life changing scenarios, they may seem more sensitive and have a harder time adjusting than their peers. She needs a super nonjudgmental supportive space to open up and take the time to transition back into a healthier self. Whatever pain she’s trying to numb should be taken seriously when she does open up. Taking unidentified drugs is being at a point where you really don’t care about what happens to yourself… the adults around her need to figure out how she could have gotten to that point, when it changed, and use that to help get her better.\n\nFor mental health magnesium and ashawaghanda are great for reducing anxiety and irritation.",
            "13? \n\nThe real question should be where are the parents?\n\nHow is she getting hold of the drugs?\n\nWhere is the discipline?\n\nIf they are coming from school, pull her out of school.\n\n16, sure it would make sense. But how a 13yr old can even get access to this crap is beyond belief...",
            "She could very well be miserable, desparate, lonely, anxious, shy, and perhaps fighting a silent mental health battle I can relate to all too well.\n\nThe source of the problem isn’t drugs, that’s what those of us in pain do to make the days bearable. \n\nTreat her with the utmost dignity and don’t harp on the drugs. Find out what’s going on in her life. I stated my self medication at 13 and I wish I was seen as a struggling child instead of a “naughty” kid. I did what I needed to numb pain and silence my head. \n\nGive grace and not judgement. People can think all sorts of bad things about drugs, but underneath there is usually a human who is desperate for help and connection.",
            "No connection, no trust. She can't trust you and your parents if there's no connection between yall. And if she can't trust you guys, she won't let you guys in to help her. Work on building that connection. Like, truly seeing and hearing her and not just your judgment, anger, and disappointment in her. See what she's saying that she's not saying. Just put yourself in her shoes for a moment and understand what she might possibly be going through. When someone's depressed, it can affect their relationship with themselves and everyone they love, which only makes matters worse.",
            "be nice and have a genuine conversation. Otherwise, he won't listen at all",
            "Take away the inner demons and the drug use goes away by itself.",
            "How is a 13 year old affording weed and vapes and pills ?",
            "All of these comments are saying to send her to juvie or rehab and if you don’t find a specific and special place she’s going to get a lot worse and more fucked uo and can get extremely traumatized and also her peers will glorify drugs so when she gets out she will maybe want to do more “hard” drugs and be exposed to maladaptive coping mechanisms like self harm. There is a lot of abuse in treatment facilities. also wilderness therapy",
            "You don't get seizures from NyQuil and weed, but you can get seizures from benadryl or benzo/ alcohol withdrawal",
            "Say drugs are wicked cool skibidi gyatt [insert multiple brainrot words]",
            "Needs immediate full on intervention. Like the first comment. she could develop schizophrenia, and that's no joke.",
            "i went through this too. psychadelics and benadryl and lots of other stuff at 13. what would have been best for me? i literally dont know. i did it because i wasn't comfortable with myself tho. i think i just needed someone my age who was a good influence. all my friends supported my bad habits and encouraged me to go even further.",
            "i was in her shoes at that age, and my parents weren’t as observant to notice or maybe didn’t care enough to intervene. the only thing they would do is lock up the medicine cabinet after my attempts and then mock me when they would find evidence of my usage. so, naturally i didn’t feel comfortable talking to them about anything because of how extremely critical they would be of me at all times. it definitely has set me back in life in so many ways, and am just now catching up. \n\ni’d say just keep reassuring her that you’re there for her if she needs to talk about anything, and promise that you will always be there to listen and that you’ll try your best to understand, no matter what it is. opening up about some dark times you might’ve experienced too can help her feel a little more comfortable with talking about it later on, just make sure not to invalidate your own experience and thoughts at the time (example dialogue: “turns out, it wasn’t a big deal and i was freaking out over nothing”) because then it will make her feel like you’ll just dismiss her issues too as “not a big deal”. remind her thru taking her out or thru ur actions that she’s loved, because sometimes the verbal words “i love you” will just go in one ear and out the other. praise any achievements she has, or good things she does, her appearance. i can’t speak for her but i know for me it was a very dark space of feeling worthless and that nothing i do is ever enough so why even care anyway. \ni’m wishing your family and ur sister so much love and healing, it’s a delicate situation but with a good support system, she’ll be okay.",
            "I’m sorry, but the harsh reality is only she can make herself stop.",
            "I looked at your comment and if your parents are like you, I know why she will not open up.\n\nYou amd your parents ahould visit a therapist and learn how to handle your sister. But the way you are judging her is doing harm, a lot of harm.",
            "horrible parents",
            "It 100% sounds like she is dealing with trauma. \n\nSomething happened to her, and that's what needs tp be addressed. No amount of \"say no to drugs\"/\"bust stop doing drugs\" etc. Will NOT help. She needs to talk to someone. \n\nNot gonna jump to conclusions but sexual assault is a very possible cause. I'd be aware of uncles or someone in the family.",
            "America is so cooked man lmfao",
            "READ THIS OP.\n\nNot looking for karma or attention here by saying you need to read this. But I knew a girl who this could literally have been written about. She was just doing her usual crappy thing, smoked some w\\*ed, and it was laced with c\\*caine and psychedelics. It pretty much snapped her mind. She's in a mental ward until further notice, this happened seven months ago. She's my friends cousin. **You need to bring your sister to the hospital right now or some kind of rehab facility. She's young enough that your parents legally have control and authority to admit her to an addiction ward against her will.** Do it, and do it now. One day she'll be 18 or 16 depending on where you live and your parents won't be able to force her to quit anymore because she'll have legal authority over it. She will be so grateful one day. You can't convince her to stop. You have to force her to.",
            "You can’t. Period. \n\nEither they’ll choose to stop or they won’t.\n\nThe only thing you can do is just be there. And not give up, at least until full adulthood.",
            "Sounds like she needs a lot more than therapy",
            "Get her arrested when shes got pills.  Seriously. Scare the shit out of her.",
            "I heard something interesting… all addiction is rooted in trauma.",
            "You find out who abused/assaulted her. Or who is doing it now.",
            "Hope, it is unfortunately highly over priced and in short supply.",
            "She is displaying classic behaviors of someone who was abused sexually at a young age. These behaviors will continue to get worse and she will most likely become pregnant at a young age. If you want to help her, than take her to Planned Parenthood and get her started on birth control.",
            "As a kid when I got in trouble parents phoned the police and organised with the Local Senior Sgt to bring me in, I had no idea. He gave me the talk and showed me the cells. \nI didn’t listen and continued to act like a tool, but I’ll never forget it. Hope this helps",
            "People in the comments seem to think something severe had to of happened. \n\n\nPuberty happened to me. It kicked off my bipolar disorder. While yes, there are kids and teens who are just bad apples, it sounds more like your sister is crying for help. These things she is doing, is a clear indication of something’s up. This doesn’t have to be anything that anyone’s done to her. \n\n\nSometimes, a 5150 is needed in place of rehab. It sucks and it’s terrifying. I hope you’re all able to recover 💖",
            "Call the police nonemergent line and tell them you would like to file a petition for an involuntary psychiatric hold for your sister as her willful overdose is causing immediate danger to her. They will send her to a psych hospital where they will get her on proper meds and a treatment program.",
            "Nothing you can do these days, society has changed. I would have been whipped a little as a kid and it would have worked 😁",
            "Be prepared for worse problems and diagnoses even if she does get inpatient help. Is there family mental health history?",
            "How old are you OP?",
            "Put on rx from dr. To produce ill effect....conflicting meds things thats how I quit beer....not needed stuff",
            "Your parents need to...parent. \n\nThere's no way my 13yo would be able to get a vape or a weed pen. She's going to some lengths to obtain these items at that age. Your parents need to be more active.",
            "Talk to her about her issues, support her and find out if her friendship circle are full of people dragging her down and influencing her behaviour.",
            "Sometimes people are a lost cause of their own making. Lead by example is all you can really do.",
            "Take a family trip to Kensington Pennsylvania or Skid Row.",
            "Link could be useful...  As a person who has successfully sought treatment for alcohol addiction, I found cbt most useful. Unlike alcohol there is no known pharmaceutical to target dependence and withdrawl in cannabis. Naltrexone, mentioned in the article, might assist off label. Maybe your GP will know more \n\n[Current treatments for cannabis use disorder](https://www.psychiatrictimes.com/view/current-treatments-for-cannabis-use-disorder)",
            "How does she get ahold of this stuff in the first place at 13 years old?",
            "Rehab and contact removal from whoever she hangs out with",
            "Honestly there is no solution besides some sort of rehab for teens...",
            "id try and explain how dangerous it is (if you havent  already) then take her to a doctor and maybe they can suggest rehab. i know a kid that did things like and hes still in rehab",
            "Military school",
            "Dextrodooming is dangerous. All that behaviour is dangerous. Take her to rehab - she needs professional help.",
            "Find out why she feels the need to do all this",
            "Jeez.  My first thought is 3 buckets, a room with a lock on the outside, and about a week's worth of prepackaged meals and bottled water.\n\nI'm kidding about the means, but not the seriousness of the situation.  This sounds bad.  You need to get her some help and you can't take \"no\" for an answer.  You don't want to be thinking back a year from now wishing you would have tried that bucket thing some rando on Reddit joked about.",
            "Address why",
            "Send her to a different continent. The language must be different from her home language. She must stay there for a minimum of two years. When its time for her to return home, its must be in a different location. This location must be a minimum of 3hrs from current location. Six months later move away for current location. Then move again. No more screen time, no social media. Keep her physical active for a minimum of one hour a day. \n\nGood luck",
            "people are doing drugs because they want to escape from something. find that something. then fix it.\n\nalot of people couldnt be bothered in finding that something and would rather blame everyone and everything else. including the victim of their own doing.\n\nshe wont talk? then dont force her to. first, try to accept her. demanding and ordering her to open up or even forcibly make her attend therapy will backfire. try talking with her friends or someone who she used to be close with. find out why she wants to \"escape\". or just simply observe her while caring for her and make her comfortable for a period of time. then she will open up eventually, once she trusted you.",
            "Describe her future. Lay it out for her. Go to your local crackhead gathering and ask her if that looks like a fun life. Give her a reality check and offer her help in avoiding it",
            "Shock method is often employed as well. Showing what happened to folks on heavy drug use. The fucked up facial features, the body indents. All of what a horrible drugs does to the human body might scare her out of it",
            "oh you really have to watch out with that, i also used to suffer from depression and its very easy to get to that \"\"i dont care what happens to me today or tomorrow\" \" way of thinking, its only a matter of time when she'll end herself with drug use, you'll have to get her talk about her problems or get her on a better path before its too late",
            "Get her out of school, probably bad influence there from her friends, get her into rehab clinic till shes better and then into a different school.",
            "Rehab and child protective services, the parents are incompetent.",
            "Omg not fucking benadryl..",
            "Move her away from her mates who are getting her involved.",
            "My suggestion as an addict and recovery for 18 years is: parents, family & friends- Take or go to an Al/NA Anon-meeting!! They are very informative 🙏",
            "Narcotics Anonymous and professional psychologist!",
            "If you aren’t comfortable attending an AL Anon/NA anonymous they hold virtual meetings everyday all over the world. Give them a quick search. You will find. That way you can go off of what is going on at that meeting and base your situation off of that and how to proceed forward.",
            "If needed, And if you consider Her staying alive Really important, violence is not a Very bad option. either you destroy The substances, either you teach Her not to do drugs.",
            "Needs government help",
            "Well instead of telling her to quit. Teach her how to use drugs responsibility. If u can't stop them may aswell try make it as safe as possible for them",
            "Try to find the reason behind the drug use. Most if the time, the person has experienced trauma and or abuse and they are doing their best to survive, that's what I am doing also",
            "I’d say ADHD and autism assessment, antidepressants and a psychiatrist are all safe bets imo. But most importantly, be with her, be kind, be understanding and stand by her no matter what.",
            "wtf",
            "How is she getting the money for those things? I strongly advise you and your parents to find out how she manages to find money to buy the stuff. \n\nI think you got enough advice on how you should build trust... But that takes time and it's a slow process. \nYou and your parents should also seek therapy. \n\nAlso find this m, try reaching for guidance \n\nPartnership to End Addiction, which provides tips, information, and resources for parents and caregivers on preventing substance use and guidance on managing recovery.\n\nBehavioral therapies and family counseling.\n\nCommunity Reinforcement and Family Training (CRAFT), which is an intervention strategy for family members of individuals who misuse alcohol or drugs.\n\nSubstance Abuse and Mental Health Services Administration’s (SAMHSA) national substance use prevention campaign, Talk. They Hear You.\n\nThe National Institute on Drug Abuse (NIDA) offers addiction resources for parents and educators as well as science-based educ",
            "If she's doing it for the dopamine hit, try and replace that with something healthier- sports, singing, join a club of some sort, mix with new kids. Also check if she's got something else going on - adhd, trauma etc. Good luck! (I was like this myself from age 11 to mid 20's, I'm 52 now and am waiting for an adhd diagnosis, I was also neglected as a child)",
            "Drug addiction is a SYMPTOM. Quit focusing on the drugs and find out what the heck is happening. \n\nIs she neurodivergent and hasn’t been able to cope with the bullshit of what growing up different is like? \n\nIs she being sexually abused? Or being groomed by someone?",
            "Get her off her phone",
            "I’m certain you can’t get a seizure from nyquil and weed at the same time. \n\nDepending on your state those are both store bought products. \n\nShe’s not doing heroin, crack, lsd (great drug) \nYou didn’t list any drugs. People are curious about the different chemicals they can put in their body. 13 is young but for girls it can be the start of adulthood. \n\nYou need to talk to her about reckless behaviour. Why she doesn’t care about fucking up her body. (Mostly with the bennidryl which is prescribed in small doses but bad for your liver in high doses) \n\nThen talk to her gently about her curiosity in drugs and what she felt when taking them or maybe what she was using them to not feel. \n\nLife is complicated and hard. \n\nTripping is fun. \n\nTalk to her.",
            "Show your sister the film Requiem for a Dream. ",
            "I would move. Take her away from this!",
            "Send her to a relative in a different country for a one year experience.\n\nIt will quickly change her perspective after 3 months in a new environment.\n\nWhen something is wrong with a kid it's almost never something to do with the kid (as I can see people focus on in this thread) but it's pretty much always something in the daily environment of the kid.\n\nThe framework has to change for results to show.\n\nIf you keep things the same, you'll see the same outcome of the past few months.\n\nJust my 2 cents. I'm not good at dealing with people so take my opinion with a grain of salt.\n\nI do have 2 kids and if I my daughter was doing stupid shit like this, I would definitely send her to France or Japan to change her behavior.\n\nIt's best to act quickly than to get things worse.\n\nMy older sister never got any assistance around the time she started doing stupid shit and it got worse to the point she's now mentally disabled and cannot work. It all started with just 1 or 2 friends/boyfriends doing stupid shit in university and it spiraled down to shit (like the Buttefly effect movie).",
            "I was very, very depressed as a teenager. It lasted until I was 29 or so. It might get better, but it can also get a lot worse before that. She needs help, regardless of the reason for her depression. I hope you can convince her.",
            "Does she have a phone/social media? Is everything she does online being monitored by her parents. There is no privacy when you are a 13 year old in crisis.",
            "In my opinion you should tell her you love her and that you are there for her",
            "Buy them fentanyl they'll won't be able to have anymore if the dose is right...",
            "I sit in quite the similar situation with my sister, she hasn’t taken as many substances as yours has, but she got access to them by doing sexual favors. Of course when we learned of this we were all saddened, and she hadn’t said anything. Long story short, the therapist we got her basically said she wanted to be popular and liked so she did all that shit even if she didn’t want to. Although the issue got better after the therapist she quickly went back again, idk, there is 5 years between me and my sister, I refuse to believe that the world of a teenager has changed that much in 5 years.",
            "Normally i would discourage a strict leash, but this is safety and health concern, getting her safe is priority, so get her on a strict leash before she really damages herself or worse\n\nShe’ll hate you at first and won’t wanna talk to you, but that will pass and that’s when you can start with working through it",
            "Therapy with a clinical psychologist",
            "Not for nothing, this is very likely at least partially caused by the situation at home.\n\n\n\nYou're just complaining on the internet and not exactly talking about her in the most caring manner. \n\nBeing like that never helped anyone, and never will.\n\n\n\n\nYes. As others said, something happened to her or something still is happening to her. \n\n\nBut pointing fingers is very easy. Good chance she could have started talking if yous took a cold hard look at yourselves first.",
            "Dude....she's thirteen and can't drive.\n\nSounds like she needs to go camping for two weeks far away from civilization.",
            "You need to talk to her, ask questions and listen to her even if you don't like the answers. Something is definitely wrong.",
            "A 13 year old would never do drugs without a reason, there's definitely a source of sadness/anger, which made her start doing that. Has she been bullied at school? Or on social media? Has she been mourning a loved one's death? Unresolved childhood trauma? (It could also be possible that she was born with a mental condition which made her more fragile to depression)\n\nThe drugs aren't the source of her problems, and if you want her to quit doing drugs, you need to help her get rid of the source first, or she will keep doing it.",
            "Your parents will have to get serious about getting her some assistance. This would be the right time, her age, to intervene in some way. Perhaps a good therapist could get to the bottom of this.",
            "Send her to narcotics anonymous meetings.",
            "Well before you sit her down and tell her to stop, its important to have a \"if youre gonna do drugs do them safely\" talk. As in discuss the importance of testing your drugs. Whether its laced or just not what you paid for. Test test test your drugs no matter what. Especially if shes just popping pills like candy",
            "My brother was like this. His main issue was he had undiagnosed ADHD.",
            "Focusing on the drug use like that's the problem. And not something she's using to mask a problem. Will achieve the opposite result you're looking for. I don't have an easy answer to this question. But it's going to require a lot of difficult communication on both ends to achieve a trusted connection strong enough, for her to approach anyone to seek comfort for whatever she's going through. This may not be something that can be achieved in full.",
            "Forced rehab or jail.  If you are in the US, I do not recommend jail as it is just a bunch of like-minded people with access to drugs.",
            "Simply don't let them do it.... put the child back in line or they will be dead or worse kill sombody else's  baby! This is what is wrong with this world absolute pussy",
            "Get her into some alternative activities.",
            "\nShe needs a good therapist who won’t give up on her, lots of teens don’t participate for multiple sessions before eventually giving in. \n\nAs for the rest, your parents need to stop her from going out for a while and then supervise her when they next let her go out. They need to listen to her and build her trust and have faith in her that she will too. They need to be harsh and not give into “it’s not fair” or “it’s child abuse” bc actually right now letting her do all this is child abuse, not disciplining and actively parenting her.\n\nYou likely need to take her through rehab and I’m shocked that psychiatry and therapy has given up on her when she is abusing drugs? Did you even tell them that? Honestly this whole situation could lead to her being taken away and a lot of heartbreak so intervention is much needed and you need to be there every step of the way.",
            "I was also like this and like others here I was being sexually abused.  My first suicide attempt was at 16.  I think your sister needs help.  What I needed when I was her age was someone who was 100% on my side who I could trust.  Someone I could tell anything to without judgement.  Someone that made me feel safe.  My family was the source of the abuse, so I couldn't trust any of them, or anybody they hired to talk to me.  I never found someone to talk to.\n\nI would suggest that you and your parents talk to her school guidance counsellor, and explain your concerns.  The closest I ever got to a true confidante was one of my high school teachers.  She really took care of me and I really felt she was on my side.  I would not let her know you are doing this.  She is going to want a relationship that grows organically, not one started by your parents.",
            "Camping, nature, the sun, sand and beaches. If that doesn’t work, may god bless your little child.",
            "So. I was this kid. I didn't come out of it until several suicide attempts/accidental ODs and a DUI.\n\nShort story shorter- you don’t. You wait for the kid to hit rock bottom, then you are the scaffolding as they rebuild. That's what my mom and dad did for me, and hey. I turned out pretty ok I think. \n\nThis may not be an answer you like, but it's the answer I have for you based on my own similar experience.",
            "She's a victim of something, and until she comes out about it you may never know. \n\nPoor girl is tormented. \n\nHelp her and support her the best you can. \n\nShe's trying to deal with it on her own but doesn't know how. \n\nTherapy is her best bet, but she probably thinks she's too smart for it or doesn't want to talk about it yet.",
            "Wild card have you considers some sort of animal therapy? The animal could help her gain trust and then open up. \nAs a kid she’s not going to sit down straight away and open up to a therapist.\n\nIt’s tough, I’m in my 30’s and I was in a mass shooting as a kid, it’s taken me this length of time to seek help. \n\nHow is her relationship with her/your parents? Could they start trying to spend more one on one time with her to build trust?",
            "therapy.",
            "Child psychologist pronto really.   She needs help and support if she is presumably self medicating.  I had a similar experience I was young",
            "I honestly couldnt tell you the truth my brother started at 14 hes 16 now and me and my parents tried everything, grounding, taking away his phone, random drug tests, then he ran off for 4 days texted my mom a long list of \"if we call the cops or look for him hes not coming home\" she was crying for days my dad lost his shit called the cops and the cops said they couldnt do anything. He finally showed up 4 days later high as a kite. We let him back instead of letting childrens aid have him biggest damn mistake cuz hes still doing whatever he wants and my parents have given up parenting him, hes beyond useless, has no life skills and is never home so he can vape and still smoke weed. Unless she realizes its wrong nothing you can do just dont give her the attention she wants its an attention thing of oh look at me.",
            "Drug treatment",
            "It’s called self medicating. It’s deeper than a drug issue.",
            "Intervention Really",
            "Sorry that just am responding, just saw Post",
            "My best friend was like this. It was due to mental health problems and not getting any help\n\nIt unfortunately got a lot worse before it got better. But she’s ok now",
            "Outdoor sports",
            "I was in the same position as her at 13- taking MDMA and smoking weed most weekends with my ‘friends’. The one piece of advice I can give, is do not berate her or antagonise her. My father did this, and left me between a rock and a hard place (those friends were threatening to beat me up, and I couldn’t go to my dad to help me out of the situation as he’d be angry at me) \n\n\nIf she has friends she does this with, then you have to intervene and stop her from hanging around them. Cut them off from the source, but simultaneously be supportive and loving toward her, even if she’s mad about you separating her from her friends.\n\n\nTo perhaps give you some hope, I’ve turned out just fine. I’ve had trouble with anxiety, not sure if me pumping my brain with Molly was the starting point of that but generally I’m doing great.",
            "No advice here, just judgement. This is 100% a  parental failure. Children shouldnt have unfettered access to the internet and the world. Communication should have occurred before it got to this point. God bless your family and good luck.",
            "Whose supplying her with all that stuff, they’re probably either the root of the problem or they know what is.",
            "Well the environment she was raised in clearly isn’t good enough considering she’s here now",
            "Sadly and it is a huge struggle for everyone you them etc. From what I have seen and experienced my self. All you can do is be comfortable and make them comfortable and let them learn for themselves. Stopping someone from learning for themselves often had the tendency to make them take longer to learn. Cause more issues for them and you.",
            "She needs a full psychiatric workup.\n\nAnd don't give up on the therapy.\n\nWhat she's going through is beyond your ability to manage, you need professional help. Her story will not end well without it. Something is broken in her, and she's trying to self-medicate the issue.",
            "Cut off her money/funds to buy the stuff. Make sure she has no access to anything. \nThat’s one thing you can do to begin with.",
            "Gosh, I’m so sorry. Get her into a rehab facility. Some have therapists there they can work with while getting her sober. They maybe even suggest medications to help her with her depression as well. ",
            "Drive her to a homeless camp and show her where shes heading. And let her know your not going down that road with her.",
            "She needs to be removed from her environment & placed somewhere like an Amish or Mennonite farm, far away from negative influences, as she is incapable of making healthy decisions herself.",
            "She should have her phone taken away and be grounded, staying away from the people that are supplying her with that shit",
            "Rehab and report her dealers to the DEA for lulz.",
            "Make her take SHIT LOADS of Benadryl. LOADS. it will stop her in her tracks",
            "Juve.  Report every incident to the police and get that kid a few weeks in a correctional facility.",
            "Are you qualified to tell me I'm not qualified? Lol It's reddit bro I believe I'm allowed to speak my mind?. I'm not throwing hate or anything, that is just my honest opinion/advice take it or leave it idc.",
            "get all your friends around and do drugs in front of her, and then try to act all 'cool like'",
            "How are they getting all this? Monitor them better.",
            "Intern her somewhere and forget about it!\n\nSome people can not be save, and the rest of the family has to come to terms and live forgetting about it.\n\nLife is already pretty hard by itself to let others ruin yours with their unwillingness to change!",
            "Put her up for adoption",
            "A good old spanking",
            "I hate to say it, but if you think she's eating talking pills (assuming you're saying that the pills are talking, and not that they're designed to make you talk - which is likely not the case since you said the drugs that talk are unidentified), you might have taken some drugs. ",
            "beat their ass, make em more afraid of you than they want the drug… but in reality people take drugs to escape their unbearable reality, the issue is their life and the only way to fix it if they arent permanently destroyed already (once a junkie always a junkie) is to change their life drastically and dramatically, take them far away, alter the routine and the things you do, challenge them and give them enormous responsibility or like… stop doing all that stuff… you know make alterations",
            "tell her to do better drugs on god",
            "bring out the belt",
            "Show her that drugs are lame. Put on some corduroy, snort a fat rail sit down to talk radio and do your taxes.",
            "Sounds counterintuitive but shrooms and LSD helped me.",
            "she's 13, you have full right to beat her until she forgets about that shit, If I ever thought of that my parents will beat me so badly that I will never be able to stand up, proud to have such good culture away from drugs.",
            "Shrooms may help. It helped me a lot at the age of 19. I went on this\" trip\" were I lost everything, watched my parents melt away then went to\" hell\" (I'm not religious just best way to describe it)etc...i was not looking for guidance from the shrooms originaly just looking for my next high and happen to come across it ,when I came back to reality I went straight to my mom's place and apologized in tears for what I put them threw in my my teen years (I was a troubled kid growing up doing heavy drugs like meth at a young age) and somewhat fixed my life or at least started heading in the right direction. Shrooms are also used in rehabs located in Brazil.",
            "Yep. I never want to assume anything but as a survivor myself who has known a lot of kids like this.... my mind *immediately* goes there bc it's unfortunately too often the cause of such behavior.",
            "I was like this at 13. Can confirm was from abuse.",
            "My cousin was similar but it's because she had undiagnosed bipolar disorder. She finally got her diagnosis at 19 and proper medication and is doing much better. \n\nI can't say if she had been abused, but that wouldn't surprise me for various factors unrelated to her disorder.",
            "I came here to say exactly this. I used to be this girl, and me and 90% of my screwup teenage drug friends were molested or abused in some way. Children don't just wake up one day relentlessly determined to obliterate their own consciousness.",
            "This was exactly my thought too. Unfortunately young kids, especially girls turn into self destruction when sexually abused whatever online or IRL and refuse to talk about it, because of the fear of humiliation or disgust towards them.",
            "I was abused when I was younger by a babysitter and my parents despite being open and loving and so generous with time and love were the top people I couldn't tell about this because I knew they would feel like they'd failed to protect me and I couldn't cause that to happen.  \n\nI would have only talked to a family friend or a relative a bit outside of the immediate family.  Never my folks or siblings.  \nSometimes you need the distance to be able to talk freely about it without someone else taking their own failure to heart.",
            "My stepdaughter nearly died at 16 from anorexia. Her doctors told her dad that \"she couldn't go back to the environment she came from\" that's all they would say as she was considered an adult in the eyes of the law. We suspected she'd been molested by her mother's new husband. We of course took her in to our home. 2 months ago, at the age of 46, I told her that story. She was astounded. She was so sick she hadn't realised she'd told the doctors. Turns out he'd also molested her little brother as well. We had one inkling of this but didn't understand what we were seeing.  And his own daughter. Explains a lot unfortunately. So much of this has happened. Kids don't do stuff unless there is a reason. Listen.",
            "i was like this too after being assaulted. please check on her",
            "It says they tried therapy, so unless the therapist sucks I wouldn't jump to that conclusion.",
            "Thought the same",
            "Not to mention, “unidentified pills” could contain lethal amounts of fentanyl, especially if her tolerance to it is low. Make sure she never uses alone, and her/her friends always have Narcan and know how to use it.\n\nBest of luck to you and yours, no easy answer here.",
            "I regret smoking weed all through highschool I can definitely tell it effected me poorly even tho I haven't smoked like 7-8 years.  Unfortunately at that age I would not have taken rehab seriously as I thought doing drugs was a fun thing to do with friends and never saw it as a problem until I got older.",
            "Does compulsory rehab and psychiatric care even exist? Where I live, all treatments/services are voluntary unless ordered by a judge, which is rare.",
            "I would also add that they must stay involved if they don’t want her to come out resenting them for “leaving” or “giving up” on her. \nThey need to be there every step of the way, no matter how harsh she is to them",
            "Fully agree.",
            "What's the success rate of authoritarian interventions?",
            "just want to add on that whatever authoritarian intervention is done, do not even consider the troubled teen industry. and please look deeply into the history and credentials of the facility if any residential treatment is decided",
            "Maybe the girl is autistic and self medicating? She probably needs to see a physiologist",
            "That was my first thought. Something bad happened to her, and this is the only way she can think to cope with it.",
            "That's what I'm thinking and I really hope it isn't what I specifically think it is. That poor kid desperately needs the right person to make her feel comfortable enough to talk about it without feeling judged. I would call the police because something really bad happened to her and her family isn't helping. Bet they blame her and not the asshole/assholes who hurt her so bad that she only finds solace in drugs and shit.",
            "Most likely... Kids are easy to read and not even remotley as inconspicious as they think they are.\n\nI have No Idea how to Help. I Had a shitty childhood and started drinking, Smoking Weed, sniffing speed and taking Es in my teen years, aswell.\nIm turning 30 now and would explain how that happened. What my real issues were. That talking helps. That escape from your own Feelings gonna haunt you No Matter what. That Life gets better If you face your demons. That asking for Help is insanely strong and Not week. That you don't need to Take this burden alone. That you are not alone and that you are Loved unconditionaly. That i'll Help her No Matter what. That I know her Feelings all too well and that These are nothing to be ashamed or feared of.",
            "Spot on.",
            "not everything is caused by trauma. some people just make poor choices often.",
            "Very depends on how the relationship was before that. I think my parents told something like this and I completely ignored it and avoided them because I was afraid based on their previous reactions. Got SA, I remember lying about going on a walk and meeting a friend to buy plan b. Was hospitalized with kidney infection by having seggs, wrote it off to sitting in snow for too long. They were already strict as they were, admitting f*cking up would definitely limit my freedom. \nI'm in my 30s now, they still don't know.",
            "I dunno. I love her and this might sound bad but she just seems like an asshole to me. And doesn’t want to take accountability for her actions, always blames others",
            "Sounds like the parents need to be more proactive. This is a *13* year old not a 19 yo, how is she getting access to this shit and why haven't the parents put a stop to it. In the comments I see everyone treating this situation like its a young adult living at home, not their young *child*. Discipline and set boundaries ffs.",
            "Yeah. She’s diagnosed depressed but you can’t help someone who doesn’t want to be helped. I’ve literally done all I can do. She won’t talk to me, our parents, our other sister, or a therapist. She lies and denies everything but we know for a fact what she does",
            "I’m her sister actually, so I don’t have any say really. And the only time she gets in trouble is for the major things, sneaking out/vapes/pills etc.\nHEAVILY agree on the discipline follow through, the consequences never really last the full length said.\n\nI’ve reassured her that I’m not mad but scared for her life, but it’s always just me doing the talking and her rolling her eyes. but again as I’m not the parent I don’t really have any pull",
            "I understand what you’re saying, but technically as a 13 yr old, her parents definitely can put her through help without her choice. Whether it would help or backfire is another thing. But it definitely can be forced upon a minor. And I honestly think that’s likely the only thing that might help in this situation.",
            "Yes, I’m 25, and live on the same street so I’m around pretty often. I agree she’s got to want to get help on her own and up until around 2 years ago we were pretty close, I still think we are most times. She’s told us she doesn’t see a problem with the vaping and things, but it is a problem and I can’t just be ok with her doing them like she wants me to be. The families just struggling right now",
            "Very likely. Also a good chance that whatever's going on didn't happen outside of home",
            "We’ve been to 2 different therapist but she won’t talk to them, denies she’s got a problem. It’s been going on for probably 2 years at this point. Probably since around the start of middle school, she hangs around the wrong group of kids",
            "People do in fact get seizures from antihistamines like that found in NyQuil and/or from THC. Both are known to be triggers in high enough doses.",
            "OP doesn't seem to be helpful himself either",
            "This thing of being \"non judgemental\" when theyre taking fucking drugs doesn't work, a case like this obviously needs compulsory care.",
            "I know. Honestly tho me and the parents are trying so hard. She gets grounded, she’s made to do chores phones/tvs are taken. We’ve tried it all. She honestly doesn’t give a shit because it’s not stopping her from acting out. Heart to heart doesn’t work either when she just bitches at you the whole time.\nWe thought they were coming from school but schools been out for 2 weeks now, so she’s either got a stash somewhere(not in her room because I personally flipped that whole room upside down) or someone’s bringing them to the house. We’ve got security cameras up that alert if someone’s in the yard, so honestly I have no idea where the shits coming from.",
            "This. But it's probably too late for that",
            "\" Have a genuine conversation \"\nLMFAO.\nTHEYRE 13, THEYRE TAKING DRUGS.",
            "Could’ve honestly been any number of combinations as she wouldn’t tell the truth either way.",
            "It was probably Benadryl. It's one of the most convulsive substances in existence.",
            "Their best choice is to take them to the hospital",
            "What the fuck is this comment 👀",
            "As far as I know in most western countries you cannot keep someone against their will in a mental institution for longer than 24 hours without a judges letter. I'm not sure if it applies to minors though",
            "Gonna catch hate for this, but same.",
            "25f",
            "Why would an Amish or Mennonite family take in such a problem child?",
            "She gets grounded, she's made to do chores phones/tvs are taken. She’s not allowed over at friends houses anymore. We've tried it all. She honestly doesn't give a shit because it's not stopping her from acting out. Heart to heart doesn't work either when she just bitches at you the whole time",
            "LMFAO",
            "Let her have a really bad trip so she'll be too spooked to try it again.\n\nLast time I got high I genuinely believed I was having a seizure and was going to die. Couldn't even try to sleep it off because every time I closed my eyes I thought it was the end for me. Haven't had the urge or even thought of getting high since.",
            "Shrooms yeah, they use it in rehabs in Brazil.",
            "your advice is to give the kid shrooms???",
            "Yes and yes-same",
            "Same here. I was physically and sexually abused as a child. I'm scarred for life. I stopped with the drugs because that just made it worse. I'm just a broken person because of my stupid fucking family.  I'm glad they're all gone.",
            "Exactly!!!",
            "Nowadays, the world is much more open. Child abuse is now talked about a lot more than in the 1970s when this was covered up to protect reputation, in many cases\n\nI would say it’s possible but in the modern day less likel",
            "The doctor knew this and didn’t inform the other parent??? That’s insane and I’m so sorry your daughter went through this.",
            "People also don’t just open up when they visit a therapist. It requires huge amounts of trust to do it.",
            "Well firstly,you have no idea the amount of shitty, lazy therapists there are out there and number 2 if she doesn’t want to talk about she has all the power in the world to not talk about it",
            "One therapist does not equal magic cure",
            "With therapy you just got to keep trying with different therapists. If it doesn't work with 1 that doesn't mean it never will",
            "I'm  50m and have done my share of experimentation. Fentanyl and now Netazenes are spectacularly scary. I wouldn't trust any random drug these days. Maybe from a trusted friend that has already used it and had a good experience.",
            "Im from the netherlands, so we smoked some weed between classes. \n\nIll never forget one presentation we had to do with a group of 4. We all smoked just before that class. Did our presentation, it even went good! \n\nWhile walking back to our chairs i said, do you think the teacher knew we were all stoned? \n\n\"I do now!\" Was the response of the teacher! \nGreat guy, gave us our grade, never spoke about it with us. We never smoked during school again.",
            "Right I didn’t go a day in highschool not being high; I got all A’s and took advanced placement classes but it fucked up a lot of social connections that could have been and that I had. Missed out on being valedictorian cause I was always so fucked; then before and after graduating the drinking also started up hard, I think all\nmy addictions stemmed from being given antidepressants when I was 13 because after I somehow got off them I was able to stop cold turkey 10 years of hard drinking (like morning and night after work straight chugging vodka to blackout and then going back to store for more)\n\nSorry went on rant but anyways like you I would’ve never taken any help or rehab seriously so i have no idea what the answer for this could be. An intervention would’ve pushed me away. So hard with these issues.",
            "Hey, do you mind telling me how it affected you?",
            "In Australia you can be sectioned by a psychiatrist. I'm not sure how the appeals process works.",
            "If you’re a minor? Yes. If you’re an adult? Yes, but with caveats.",
            "For kids in the US it’s basically up to the parents/guardians",
            "What's the death rate of non intervention in cascading drug experimentation in people that start at 13?\n\nI'm no prohibitionist. I've smoked a Billy this morning. But drugs at 13 is something I firmly discourage based on my own lived experience. \n\nI didn't say so in my original comment but a psychiatrist diagnosing clinical depression is as frightening to me as the drug experimentation.  I think this young woman needs to feel heard. There are professionals that are highly trained to do that. And able to teach family members to do it too.",
            "Slim",
            "Why do you think that? Where are the social deficits and repetitive/resrricted behaviour?",
            "I did the same thing as a kid and there was no event that caused it, I was just depressed and bored",
            "Most people who do drugs are numbing the pain.",
            "She is 13. Something really bad happened to her to make those decisions at such a young age. Instead of judging her you should be trying to  show her you are here for her, you believe her and don't  blame her for what happened. It's not normal for a 13 yo to be doing those things. There must be a reason for her to only cope with drugs and shit.",
            "wow it's totally a mystery that she doesn't wanna open up to you",
            "She's 13. Please please please change your mindset—you are talking about a *child* who doesn't have a developed brain, who can't regulate her emotions properly yet, who can't properly evaluate consequences. Talking about her like this will only make it worse, trust me. Children need love, care and attention. I'm wondering why you think she's an asshole for using drugs? Drug users aren't inherently bad people, but oh my god SHE IS A CHILD.\n\nI know trauma/mental illness/poor physical health isn't the only cause of behavior like this but in *most cases* it's some form of self-medication, and even if it weren't, treat her with the kindness she deserves and she will be okay. \n\nMy family has always treated me like shit and it's only when I found a supportive adult that I managed to stop most of my self-destructive behaviors. I suffered alone for 7 years bc my family had the same mindset as you.",
            "I'm sorry you are going through this. It could be trauma or it could be because her group of friends are encouraging each other. \n\nWhere is she getting the drugs from?",
            "Why are you expecting a 13 year old to have the critical thinking and maturity of an adult? Come the fuck on dude…\n\nSounds like she needs help to cope with the level of judgement and criticism being aimed at her by her loved ones. Maybe she’s using drugs to put up with unsupportive, nasty even, family members.",
            "These things are complicated. How does she blame others and does not take accountability?\n\nYou might be right she could just be a mentally and psychologically troubled asshole\n\nGo take her for psychiatric evaluation",
            "Well I think your attitude needs to change tbh, you and your parents idea of “help” is extremely weak. \nChild therapists that give up on their charges dude to lack of participation? \nNo psychiatric, or medical intervention for drug abuse and addiction?\nShe’s thirteen, she can’t do these things, she needs a strong family that will step up for her. \nI bet you’re only a kid yourself so it’s not your fault so sorry for lashing out",
            "I disagree- expanding a nanny state to the home is not w good idea\n\nAt some point it’s up to her to stop using drugs. If a seizure won’t stop her then she may need a long hospital stay to stop her.\n\nShe may even keep doing it until she dies",
            "OP, I’m a recovering addict. Your feelings and frustrations are VALID. You and your parents are allowed to be at your wits ends. HOWEVER, this just screams that you don’t understand addiction. And that’s ok. The acting out, the acting like she doesn’t care, the lies, the denying; these are all classic behaviors of an addict among other horrible traits we have. We are the best manipulators, we think we are the best liars, and we don’t care about anyone’s feelings but our own. That’s the disgusting truth. If you and your parents are interested in learning how to actually help your sister please check out PAL. Parents of addicted loved ones. The information and coping resources are wonderful. Your sister might even be more receptive to treatment if you all tried to understand the underlying problem. Please don’t feel bad for your frustration, it shows you actually love her and are just exhausted.",
            "Ok,  but you realize as long as shes depressed drugs are most likely never going to be an Issue from her point of view. When I recognized I was struggling with depression I was 20, had a family that had dealt with it before and was lucky enough that I could stay in a voluntary mental hospital for 7 months. \n\nIt took me two years and a damn good therapist to start getting better, and out of my friend group from the clinic me, one girl and one guy out of twelve people got better, and we were extremely lucky. \n\nI get that its frustrating, but imagine you feel like utter shit all the time, and you have a way to make that go away, but everyone thats close to you condemns you for it, and its the only way you know that gives you a reason to get up. You might never get better, because depression is a bitch, you probably tried every shitty advice online before you opend up (I hope Im projecting) and still you arent getting better, all whilst it takes all of your energy to put clothes on and get up in the morning, but everyone but the drug people judges you for not doing what you’re supposed to. Idk what your sister needs, and I dont want to judge someone doing his/her best but given that your first response for someone asking for reasons was “sometimes I feel like shes just an asshole” she noticed that sentiment from you for sure, and given my personal experiences its one she probably encountered a lot the last few months/years. \n\nI dont know what your sister needs, but if she’s asking you to be ok with a thing she knows will destroy her I dont think its the drugs she wants you to be ok with, she wants you to be ok with her being her, and that is either unconditional or its not, in which case you probably cant help.",
            "Sorry but your attitude is pathetic. She’s 14 and clearly dealing with a lot, of course she’s going to lie and deflect. She needs to be admitted somewhere that she can be properly diagnosed with more than just “depression” she needs to have her medications dialled in to match her needs and she  needs you and your parents to keep trying to help.",
            "You've answered your own question. You simply can't force her to 'do' anything she doesn't want to do, unfortunately even with good intentions",
            "Since she is young, it is your or your parents responsibility to clean her room, do her laundry, etc. You can help her in that way. In other comments you called your sister an asshole, which you should never say to her face because it will make her feel worse.",
            "Put her in an inpatient facility. Stop letting her dictate everything, she’s not in the mental state to.",
            "[deleted]",
            "As a sibling, it's very tough. But the overall sentiment can remain. I was your sister when I was young, but I didn't have anyone looking out for me.\n\nUltimately, I didn't want the help at that age. And you can't help someone who doesn't want to be helped. \n\nThe best you can do is try to find a time she's sober (or mostly sober) and let her know that you care about her. That you want to meet her future children, and for your kids to have playmates/cousins. \n\nLet her know you're there for both the serious, and non serious. And if she ever wants to just vent then you're available. I hope she can recognize that having someone outside that world to talk to is nice, even if it's not to help her. Let her know that she can talk to you, whenever she's ready. Maybe a month, maybe 2, maybe longer.\n\nShe's at the age that even without drugs, it's hard to have a good relationship with siblings. I'm sorry you're caught in the middle, and I'm sorry to admit that it can feel like there's nothing you can do. But most people who fall down that bad path, do so thinking they have no one to be honest with. And they stay on that bad path because people give up on them. So don't give up on her, no matter how difficult it becomes.",
            "It could help but it could also drive someone further away from help \n\nBeing there for her still means having dialogues that can help inform her but forcing help could genuinely make the situation worse",
            "Agreed. Can’t make that call though as I’m only the sibling.",
            "You don’t have to be okay with it. But if you can really focus on your relationship with her in such a way that the drugs and vaping are not the focus, you’ll set self up to help. \n\nDrugs are almost always the symptom, not the problem, for the user. \n\nDrugs are almost always the problem for the family. \n\nThis is why families are often not helpful to substance abusers. ",
            ">I’m 25\n\nThen suck it up and build that relationship. Your sister is ILL. She cannot decide to stop using drugs because she is an addict.\n\nGet her cleaned, get her room cleaned and build that bond.",
            "Then maybe a inpatient rehab center with a specialty in mental health diagnosis will help. And of course one that works with children her age.",
            "Sounds like she needs some expert help really. Would probably get her to a head doctor sooner than later.\n\nI would be permanently taking away her phone, no reason at all for a kid of that age to have one or social media and although your have gone through her stuff, I would do it again. Doesn't take much of a hiding spot to hide pills etc.\n\nUsually when someone starts to get involved with that sort of crap it's because they are associating with other peers doing the same thing.\nBe it through school, social media etc.\n\nEither she is hiding the stuff or someone is bringing it to her. If you have any medications in the house, it would be a good idea to get rid of them or lock them up.\n\nIn fact if there are currently medications in easy access that she has no business touching, I would probably relocate the contents into a different bottle, and lock it up. Then wash and replace the contents of the original with laxatives or something horrible. Say nothing and put it back.\nIf you do nothing she will simply continue a downward spiral or end up dead.",
            "My dad did this when I was depressed, instead of being there for me. Nearly ruined me until I moved in with my mom who actually cared for me, got better real fast after that",
            "This is actually giving me eating disorder vibes (not that she's got an eating disorder, but hear me out).  \nSo you & parents have been trying so hard to fix her. Understandable, given there has been some serious physical harm she did to herself. It's a responsible thing to want to take away dangerous substances especially from a minor\n\nAssuming there wasn't something more severe that has caused her underlying motivation to use drugs (eg. sexual abuse or whatever) - it could simply be that she feels it remains the ONLY thing she has control over. Even if she knows you guys love her and care for her, and EVEN knows the fact that what she is doing is not good/right - she may continue to do it SIMPLY because if she listens to you guys and stop, the label from the family to her will be \"Stupid\". Just that.  \nShe may simply think that since you guys already thinks she's STUPID, to suddenly stop the drugs = admitting to herself that she is STUPID.\n\nDoes that make sense?  \nWhen I talked about eating disorders vibes earlier, some ED patients precisely don't eat because that is the only thing they feel they have control over - when they give that up they will also be admitting to themselves (the same opinion from everyone else) that they are a Failure. That is much more terrifying than stopping.\n\nSo maybe think about whether your family may have unintentionally, inadvertently judged her into a corner she cannot actually come out from her current situation without much dignity intact? You mentioned that she just wants you \"to be okay\" with her doing drugs - I think what she really meant was \"I just want you to be okay with who I am right now, stupid, failure or not - and love me even when I'm dumb, not only when I'm doing everything right.\" This would also explain why she has been so easily influenced by a group at school - those peers are giving her a solid sense of identity which I feel she may not have been getting from home. Just because we love a person doesn't mean they won't struggle with the conditions we love them under.",
            "Sure. No emergency, head to the hospital. \n\nSpend your house on a repeat business service. \n\nSuper correct.",
            "This\n\nThey need to stop attributing things like this to abuse",
            "In my state, anyone can file a petition for a 24hr hold that will be in the ER. During that time, they will be evaluated by a doctor who can file a certificate for a 72hr hold and they will be sent out to an inpatient facility. Once they get there, they or their parents, if they're a minor, can either sign themselves in voluntarily, or the facility will use the petition and certificate previously filled out in court to get an involuntary order.",
            "Could take them to a counselling a few times, and tell them this would happen every time they do any of what they are not supposed to.\nTake away all digital items for a week every time.\n\nThere have to be some consequences, otherwise they just feel entitled.\n\n*Parents job, not sisters tho.",
            "Okay, I was asking because your positioning here was more of a parent than a sibling. A 12 year age gap definitely explains it. \n\nMy thoughts on drugs is that usually when someone starts, it's the symptom and not the problem. Yes it is a problem, but a healthy teenager doesn't usually have the problems you're describing. \n\nTeens, it's usually something social. She's feeling isolated, alone and can't relate to another person so she's masking the pain. Or she's with a questionable group of friends who are encouraging it and she doesn't want to feel left out. Or both. \n\nCould be something else, but my point is she's more likely going to open up to a 'peer' vs an 'adult.' I can't say your local resources, but my community has mental health resources where teens volunteer to talk to other teens. Maybe call 211 if you're in the states or check around, but I absolutely think it would be worth your time to look into that and provide her those resources.",
            "Well, yes. I mean medicine do come from plants, roots, etc. this is a very safe approach compared to dosing the kid up on anti depression pills. No risk of long term depending on it or risk of od. There's been many study's around the world u can look up on this \"magic mushroom\"",
            "Im sorry. But yeah. I wonder what my life would be like with all that. I stoped when I got older, put myself through college but it never really leaves you. We coped the best way we could. Codependents anonymous helped me  a lot as an adult. FWIW.",
            "What’s possible but less likely ?",
            "Young folks these days have it rough. I always tested my drugs but now it's not even really worth touching any presses or points imo, when I was younger that usually just meant you might get meth bombed but now it's fairly likely you could die",
            ">I'm 50m\n\nThat's a long/tall-ass person!",
            "When my daughter was 16 someone brought homemade edibles to school. The girl said it was just THC. A few kids tried it and ended up in the hospital. Turns out it had several drugs in it. Luckily my daughter spit it out because she said it tasted bad. It was a good lesson for her I guess. Scary.",
            "Drugs aren’t worth it. Kids, anything drugs gives you now it will take away 10x with time ",
            "In this day and age no test kit equals no go for pills and white powders. There is no sure fire way of knowing what you’re getting without being able to test it.",
            "Maybe I misunderstood what you meant but \"feeling heard\" and \"authoritarian intervention\" seem counterintuitive.\n\n\nI agree that depression is a more serious issue, and probably the reason for the drug use.\n\n\nLots of kids experiment with drugs and turn out fine but I don't think very many people with clinical depression at age 13 turn out fine.",
            "Well he says \"she is depressed\" who is really depressed at 13? Something is usually up that is more than \"depression whatever normies use for that term \n\nI used drugs at 13. I was autistic and self medicating. Some people thought I was depressed",
            "THIS! So many people jump straight to “something awful happened” which could very much be true but she could also just be making poor choices",
            "Same. Experimenting at being a hard core *real* teenager !! Got it out of my system, but sure did waste my time. Lucky I survived honestly.",
            "“I was just depressed…”\n\nSomething caused that",
            "Why you were depressed?",
            "That's a long reach without any evidence. I was the same as her sister at that age. I was just a shit kid with budding mental health issues, nothing tragic happened to cause it.",
            "You really can't claim that \"something really bad happened to her\".\n\nHow do you know that? Some people just do stupid shit without there being any deep underlying cause for it.",
            "Nah,she probably is just young and stupid\nI was the same when i was her age and just grew out of it",
            "Truth hurts… anyway it’s not just me",
            "I disagree. Sometimes troubled teens are like that. It has been drilled into kids and teens to not take drugs because of various health effects and they do understand this. Yet they decide to do it for their own reasons \n\nShe is not an asshole because she uses drugs - OP thinks she is an asshole for not taking accountability for their actions and always blaming  others. I can’t confirm if this is true or not. Maybe it is - in which case I think she could very well be an asshole.\n\nI don’t really judge people for using drugs, but when someone still does it even after seizures and whatnot like this troubled young woman then they probably have a problem",
            "She won’t open up about any problems but This might just be the best response I’ve gotten. Someone actually trying to help instead of ridiculing someone who is just trying to help someone they love and are out of ideas.",
            "What makes you doubt her diagnosis? Depression is hell and people cope in different ways, especially a child. Drugs are a pretty common one for people with access.\n\nLabelling children with any diagnosis is iffy, though, since their hormones are completely out of whack and everything about them is undergoing constant change.\n\nAnd heavy psychotropic drugs will also mess with a developing brain just as much as any other drugs.",
            "Not true. I’ve tried to help. Am still trying to help a person can only do so much. She’s not my kid and I don’t much of a say",
            "Yeah I 100% agree. Forcible therapy or anything similar should be the LAST resort because that could just drive a stake further between the family, especially in terms of trust or honesty. It is out there as an option though.",
            "Yes, and while I totally understand the concern and worry you have for your sister, her treatment shouldn’t be your responsibility to figure out. Try to support her as much as you can without supporting her addictions. As others have said, there’s definitely something underlying going on so try to work on building trust between you two and see if you can help her through what may be causing her to act this way. \n\nAnother thing is how is she getting these drugs and where is she doing them? If she’s getting them from and doing them with a friend, she obviously needs hard rules from your parents that she cannot be around those people. 13 yr olds should not just be deciding what they do, where they go, and who they’re with. It’s very concerning where these drugs are coming from in order for a 7th grader to have access to them. The age she’s at is extremely influenced by the people around them, so she’s just being pulled in further by the people who she’s surrounding herself with. That’s for sure one of the first things that needs to change asap.",
            "Well, she is living in an unsafe situation and you have documented that her parents are not taking action against it (moldy room at 13 is still the parents responsibility).\n\n\nYou can 100% call cps on them",
            "For sure. We definitely have the meds locked up since the Benadryl incident",
            "Certain laxatives can cause heart attacks (heart rhythm/electrolyte dysfunctions) and/or death when overdosed if you have particular comorbidities. \n\nWhich solves your problem but not the way that you want it to be solved.",
            "In my country you can usually pay a couple of bucks for a private asylum for your kid if the person is considered mentally unhealthy due to these reasons. Im not too sure about other countries",
            "Even if it is a symptom, theres nothing you can do about it.\nThis needs to be taken to professionals\n\nPeople study these situations extensively, not you, so taking them to professionals is 90% of the time the greatest choice",
            "you're not qualified at all to be talking on this issue. maybe go advise someone else, not someone looking for help for their kid sister.\n\ni mean, mushrooms? seriously? you can argue their benefits all day but really?!?!?! goddamn.",
            "I go to an anonymous sexual incest abuse survivor group. And I have my therapist. But it's always there.\nNow I feel like shit but I needed to say that.\n\nBut I will prevail. I pray to Jesus since it gives me the strength to get through the day.",
            "Child abuse, because the national data in the US shows a decrease.",
            "Hope your mates have  naloxone handy. Jfc. Brave new world.",
            "You read meters.  I've done that on reddit too. As we try to accommodate imperial, American reddit.",
            "As a previous 13 yo with clinical depression, you can turn out perfectly fine.",
            "I was diagnosed with that at 13 and drinking, maybe not experimenting with drugs at that age but at 15 I did. I did need help. I was constantly asking for it and ignored. If she’s avoiding it so much more is definitely going on and intervention is needed.",
            "my cousin as drinking and smoking at 13. died of fentanyl overdose at 22.",
            "Kids of 13 have very sane reasons to be depressed. Previous generations have failed them.\nI wish I had answers.",
            "I was someone who needed to be heard at 12/13. I didn’t want to talk to family and ended up being misdiagnosed at some sort of doctor/psychiatrist and given antidepressants. Really fucked me up for 15 years; lead to rampant alcohol abuse(daily blackouts for a decade) and getting high any chance I had. Was able to stop all that after a fluke chance of me cold turkeying Zoloft while on a super intense alcohol weeklong blackout(the kinds where you don’t go to sleep you keep doing things and a lot of people don’t even realize you’re drinking). ",
            "Can confirm-dx CD in teens. Am in my 50s. Am still not fine.",
            "A lot of teenagers, even younger ones have MDD. \n\nOf course, it is possible. But the fact of the matter is that there needs to be enough social deficits, repetitive/restrictive behavior, impairment, and some childhood symptoms. Also not explained by global developmental delay or intellectual disability.\n\nI am not saying that she is not or is autistic. \n\nAlthough it is possible that autism is mistaken for depression, the DSM-5-TR criteria is so different.\n\n1st - depression is usually temporary, autism has childhood roots.\n\n2nd - stuff like sensory issues, very intense interests, rigidity in schedules do not fall under depression\n\n3rd - depression is a mood disorder. Autism is a neurodevelopmental disorder",
            "people are just trying to tell you that this is bigger than poor teenage choices.  dumb choices may be experimenting with weed or stealing booze from a parent.  taking handfuls of pills is something done to stop the pain, take it from someone with multiple suicide attempts by 13.  normal bad decisions would involve her STOPPING this behavior after a sezure from robotripping.  the fact she isn't stopping means something is seriously wrong, more than poor choices.  \n\nat 13 I was spending all my free time looking for \"home remedies\" to get me intoxicated because things were that bad in my head.  only my friends who were hurting like I was were trying to use that heavy, everyone who was ok and just making bad choices only messed around with a little bit of stuff at 13.",
            "Important thing is to communicate to ensure something awful did not happen...",
            "It is absolutely frightening that you jump to _that_ conclusion. How in the world would you know that? It sounds like you've just decided that she's an asshole (have seen your other comments, so you writing \"which could very much be true\" doesn't carry a lot of weight with me after that) and you're never gonna help her that way. Wow. This is awful.",
            "All behavior is communication. If she’s making bad choices there is a reason. It doesn’t have to be abuse, but abuse is a pretty common reason for kids to act out.",
            "Genetics",
            "Yes, a chemical imbalance",
            "I just don't enjoy living, entire thing feels like a chore. Now I'm medicated, and that keeps the suicidal thoughts at bay (for the most part)",
            "Mental health issues at 13 are fucking tragic.\n\n\n\nSorry you went through that and you were made to believe your mental health was not important.",
            "yes but that’s a two way street. i was also like her at that age and something *did* happen to me. that doesn’t mean that it’s happening to her sister, but it doesn’t mean that it isn’t either. the only person that will know how to fix it will be her.",
            "Why were you a shit kid, do you think?",
            "Dude what? That's not normal you know that right?",
            "Have you tried like, idk, giving a shit and having a heart to heart with her?",
            "OP, I can’t even begin to tell you I know exactly how you feel. As I said, I am a recovering addict. But then I had to watch my son make the same horrible choices I did. Watching someone you love destroying themselves is horrible and I don’t wish it on anyone.  I have been on both sides of addiction. You say to yourself “why can’t they just stop!” “Why can’t they see how much they are hurting us!” The truth is, WE CAN. In my experience, turning to drugs was masking all the pain I was feeling. I didn’t care about anyone because I HAD NO LOVE FOR MYSELF. Me turning to drugs was me screaming to the world “I don’t know what to do!!!!” I was screaming for help and didn’t want it at the same time. We are f@$ked up, what can I say? We can’t explain it. Please check out PAL. Learn how to help her. I’m on your side here. 🙏🏻❤️‍🩹",
            "Yes, how very loving that you've been calling her an asshole in your comments, and when criticised for it you answer \"the truth hurts\".",
            "I think the point of OPs post is that she's not talking to professionals or participating in treatment. Those volunteer programs are ran by professionals. My local one actually is ran by the same people who run the addiction service and suicide hotlines and train the teens before they get on the line. I was suggesting OP look and see if she has access to something *like that* as it exists because teens find taking to adults difficult - And the professionals seem to understand that.\n\nWe want her to talk to *anyone* that is capable of getting through to her to convince her to participate in treatment at this point, because until OPs sister decides she wants to change that's not going to happen.",
            "Im glad you found some things that help. I too found that a higher power is the answer. Jesus is awesome 😎.  You deserve good things. Keep your standards high. (That was an issue for me). All the best, fren.",
            "(One of) My fave type of humor is stuff getting misinterpreted, lol",
            "I wish people would stop taking the “previous generations have failed young people” tack. Sure, that’s true in many ways. But it’s also true that previous generations have made great strides as well! In probably every conceivable field and area of study, previous generations either made progress or laid the foundation for it.\n\nYes, people, including young people, have plenty of reasons to be depressed. But does it really help to try to place blame? I don’t know it just get so old reading that over and over",
            "At 13? No sorry ",
            "It is debated what comes first. Imbalance can be caused by our trauma/surroundings/loss. It is still unknown.\nhttps://www.sciencenews.org/article/chemical-imbalance-explain-depression",
            "But why? When it started?",
            "Thanks, it sucked but it's not 'that' tragic. The struggles and experiences has made me the person I am today which I'm happy for. If I was offered a magic wand to go back and do things differently, I wouldn't take it.",
            "100% agree, but person I responded to said 'something really bad happened to her' with absolutely no evidence to back it up. The point I was trying to make is the same as yours, something really bad may have happened but also something really bad may not have happened. None of us can know",
            "If I had to pin it on anything, thinking back now as a functional adult I'd say diagnosed but untreated adhd",
            "We’ve had heart to hearts. Multiple actually, we’re pretty close considering the age gap. But she wants me to just be ok with her talking pills and shit and I’m not going to be. And if she won’t talk to anyone(doesn’t have to be me) about the underlying issue, I(or anyone else) can’t do much to help but hope",
            "I’m not surprised that her sister is depressed when her “support” system is like this",
            "Ops sister isnt going to change unless you force her to, taking that amount of drugs at the same time isnt healthy to anyone especially to a developing 13 year old.\n\nTheres a reason children dont have freedom, this is one of them.",
            "Thank you, you too.",
            "I'm gen x and I feel the weight of responsibility very strongly. I'm a minimalist but I've done my share of pointless, destructive consumerism.",
            "\"You aren't allowed to have a medical condition because I've decided you're too young.\" - 🤡",
            "YOU ARE A FUCKING IGNORANT ASSHOLE. I HAVE HAD SUICIDAL DEPRESSION SINCE THE AGE OF NINE. I’M NOW IN MY EARLY FIFTIES. AM I OLD ENOUGH NOW TO BE ALLOWED????",
            "I know right... upvoted",
            "Depression doesn’t always have a “why”. Sometimes depression is just depression.",
            "When I was in second grade, I remember having a tantrum where I was endlessly screaming about how much I wanted to die. \n\nSo, I guess my whole life",
            "sweetie that IS TRAUMA. I lived that life and it is hell and traumatic to watch yourself struggle over and over and over and over because you are denied access to care/help.  I didn't realize the depth of the trauma till I got on good adhd meds and could function like a real person.  it's heartbreaking knowing all of the tears shed feeling like I was a failure only to have it be me suffering from a litteral  BRAIN DEVELOPMENT DELAY (that's what adhd is, a developmental delay of the prefrontal cortex leading to a host of misswiring and unpruned connections) with no support.",
            "i was like ur sister at her age and honestly i had a big sister type of role model in my life who would always check in on me too. and she is one of the main reasons i was able to quit. what she would do is tell me “i’d rather you do it in front of me, rather alone with god knows who or worse by yourself and something happens”. she would bring me out more to parks, farmers market, concerts and really just anything to try and show me the beauty of life and excitement of life. she would bring me around her friend group sometimes and made sure i had fun with them and also became friends with her friends (way better influences) which caused me to not have a lot of time or energy to spend with the “bad” friend group that i accidentally got roped into. after all of those things, i slowly stopped feeling the need to get high to feel something good for once because there were other good things in life that i realized makes me feel happy.  i’m not telling you to enable her or to be okay with it, that’s totally valid. but just a thought.",
            "I just find it odd that no one in your family can think of anything that happened within the last two years to trigger this sudden change. I realize you may have been out of the house and living your own life, so I apologize if the above comment was a bit harsh, but your parents seriously have no clue? And they think more chores and grounding is going to build rapport and make her want to be vulnerable with them? Sounds like your whole family needs therapy, individually and as a family. Something happened to your sister and y’all need to figure out what it is. Could’ve been relatively minor like puberty/bullying, to severe like CSA. As others have covered, not good and your parents/family are handling this very poorly. I get you don’t want to “give the thumbs up” to what she’s doing but understand, in her mind, she’s surviving right now. Ask her what she is trying to survive through and how these things are helping her accomplish that.",
            "\"I accept that you're in pain and want a way to cope with that pain, but I cannot accept that the way you're coping is hurting someone I love.\" Or something like that. \n\nYou don't have to validate the behavior to validate the feelings, but you gotta make sure she understands you guys are on the same team of \"wants you to be happy.\" It can be very easy to lose that messaging with situations like this.",
            "I agree. I think it's very naive to believe that her sister doesn't feel this attitude. You tend to pick up on what people really think and feel about you, and I'm afraid I that in this case it makes it an impossibility to help her. Why would she trust or truly turn to someone who looks down at her, judges her and doesn't believe in her? Someone who won't seriously consider something may have happened to her? I don't see this working out as long as that is the attitude.",
            "I mean, unless you are a CEO of a big company, your responsibility is quite minimal. Most of us are products of our time and engaging in consumerism was probably extremely common when you were growing up. Good thing that now you understand it.",
            "You can have some thing. But the medley of recreational things that this child is doing. Yeah time to be authoritarian.",
            "Again the medley of recreational stuff means this needs to get authoritarian",
            "It always have a why . Us humans not knowing the reason doesn't mean there is no reason",
            "Not really, even if you have it since born it's because something caused a chemical imbalance in your brain. There is a why.",
            "When was in second grade I barely knew I existed. Wanting to end your that young isn’t normal. Have you ever had a brain scan. I hope your ok tho",
            "Since kid (at some specific age) or you remember always being depressed?",
            " i wouldn't call my personal experience traumatic. Difficult, sure. But as a child going through it I never cried over it, I basically embraced what I was good at, being a delinquent. But I personally wouldn't call myself a victim of anything traumatic. I am on adhd meds now and a functional adult but I still don't look back with any real negative feelings",
            "The only change that came about is her new friend group when stating middle school. And actions have consequences. I’m not trying to argue, just trying to make sense of things in my own head. But don’t you think that sometimes(not always, sometimes things could very well be really wrong) but sometimes preteens/teens and even adults just make shit decisions. Like trying a vape at school because all you’re friends are doing it and then next thing they know it’s a handful of Benadryl because a vapes no longer exciting enough?",
            "When the only tool you have is a hammer…\nAt first, I kind of agreed with you but you just keep repeating yourself and you are beginning to sound like a real prick.",
            "My comment right above this one was responding only to your statement of “at 13? No, sorry” in reply to the comment that kids today have a lot to be depressed about.\n\nI’m not taking about your methods, only about the fact that you seem to think that at the age of thirteen, “sorry, no,” kinda can’t be depressed or don’t merit a dx of cd, or don’t deserve to be allowed to feel depressed, or whatever your lil brain is telling you.\n\nI am here to counter that with my lived experience: at the age of nine, I came home after school and put a butcher knife to my throat. I don’t feel like getting into the details, now I’m in my early 50s, and I’ve tried almost every medication under the sun, I’ve done TMS, other txs, and I continue to be denied an ECT referral because “it’s so severe. We want you to try everything else first”\n\nI don’t understand what tf they think I’ve been doing for the last 30 years",
            "Not always. There are forms of depression that are not due to chemical imbalance, and as far as we know don’t have a treatment.",
            "Never had a brain scan, but I've always had the feeling that something is wrong. I feel like my intelligence is noticeably and significantly limited... but that could be because I've also been diagnosed with ADHD\n\nThanks for the kind words. I'm actually feeling the best that I've felt in a really, really long time",
            "Yeah, you just found a path that enabled you to cope with what you had to go through.",
            "honestly try to get her away from those friends,\n\nMiddle school was a big turning point for me when it came to drugs mainly because of the people / things I was exposed to and it seriously fucked me up from about 8th grade through to about 2 years out of highschool.\n\nWhen I was her age, anything my parents said honestly went in one ear and out the other. They couldn't tell me anything to get me to stop my destructive choices and it seriously strained my relationship with my parents to a point that honestly I dont see us coming back from.\n\nI put my ma through so much shit I cant believe how much of an ass I was lol. Try to get through to her, and if you cant an intervention of sorts should seriously be on your radar. The biggest thing I wish my parents did was simply step in. But all they could do was ask me \"why\" and at the time I really didnt have an answer, I just wanted to feel. I imagine she is in a similar boat.\n\nShe's still young. She can come back from these decisions.",
            "Well new friend groups can definitely change behaviour, especially if she sees them as cool and sees herself as uncool without them.",
            "Thank God you are not my sister",
            "👍🤷",
            "I didn't mean that the same thing always causes it, I meant that there is always a reason even if you don't know it. It's not magic.",
            "I think most people who think that their intelligence is limited are probably normally intelligent. Im not sure if i have adhd but i had trouble paying attention to stuff I thought was boring. My behavior was questionable sometimes. Im also always moving my fingers or toes. Looking at the symptoms makes me wonder if I have it or not.",
            "God I know. It would be awful to have someone who actually cared about your well being"
        ]
    },
    "What became of the most beautiful girl in class at high school? ": {
        "title": "What became of the most beautiful girl in class at high school? ",
        "score": 329,
        "url": "https://www.reddit.com/r/ask/comments/1dllc4e/what_became_of_the_most_beautiful_girl_in_class/",
        "content": "She’s actually still a close friend of mine - she got a very good job in finance, married a men with a PhD in the London school of economics and they have two beautiful babies ",
        "num_comments": 364,
        "comments": [
            "# Message to all users:\n\nThis is a reminder to please read and follow:\n\n* [Our rules](https://www.reddit.com/r/ask/about/rules)\n* [Reddiquette](https://www.reddithelp.com/hc/en-us/articles/205926439)\n* [Reddit Content Policy](https://www.redditinc.com/policies/content-policy)\n\nWhen posting and commenting.\n\n---\n\nEspecially remember Rule 1: `Be polite and civil`.\n\n* Be polite and courteous to each other. Do not be mean, insulting or disrespectful to any other user on this subreddit.\n* Do not harass or annoy others in any way.\n* Do not catfish. Catfishing is the luring of somebody into an online friendship through a fake online persona. This includes any lying or deceit.\n\n---\n\nYou *will* be banned if you are homophobic, transphobic, racist, sexist or bigoted in any way.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ask) if you have any questions or concerns.*",
            "Mine were actually twins. They had the same set of friends, they took the same college course, same classes, and now are BOTH teachers at the SAME highschool we grew up in. it still boggles my mind.",
            "I am still beautiful and successful. Thank you for asking.",
            "She met a guy on the ski team in college who was from Norway, and lives there now.",
            "English teacher Suzie, absolute milf shout out Mrs Chandler",
            "She’s a nurse practitioner. She was always nice though.\n\nMarried a cool dude ( who always was nice too), they have a few kids.\n\nIn general they were both just amazing people and looked good too, very much the opposite of the stereotype you hear of. Dated each other in high school too.",
            "She’s a school teacher now and is fine as hell. I see her post on social media of her traveling all the time during the summer",
            "Ok there were a few\n\n- one married a football star from a super wealthy family, it seemed like they separated for a bit but are back together and had a baby so good for her I guess. \n- another one also married a football player and lived in various countries and had a kardashian style wedding and still looks stunning and has tow gorgeous kids \n- one tried to make it as a singer and actress mostly does weddings and married a Swedish music producer. I think she works full time as a singer but not exactly as successful as she wanted \n- one worked as a model and then was on a tv show for a few years and now appears to not be working but is engaged and seems happy ",
            "My blood runs cold, my memory has just been sold…",
            "She's a doctor, specialising in chemical pathology.",
            "No real standouts in my year, but there was in the year ahead (older) than me.  She was dating a teacher in the school.  They eventually got married.  She became a teacher as well, and eventually a principal.",
            "She was the typical popular girl and I was a goth girl, but we got along really well. She ended up being a Dallas Cowboys cheerleader. She worked so hard for that. Good for her!",
            "She got knocked up and later stabbed to death out at a random farm house in the cuts",
            "She got reallyyyy fat",
            "She moved to Texas, got married, had a couple of kids and is a hair stylist at a high end salon",
            "She's a vegan baker, has blue hair and tattoos everywhere, and looks like she's pretty happy with her life. I'm glad she grew out of her mean girl ways and doing good! She was always so mean to me in school. I haven't seen her in 17 years, hoping it'll be at least an other 17 before I have to see anyone from my school days again.",
            "The hours of tanning booths caught up to her and she looks like an old ball glove.",
            "Turns out if you get breast cancer in your 30s, there's a much higher chance it will be aggressive.\n\nDead at age 39 of breast cancer.",
            "Everyone called her a slut. All she did was enjoy having protected sex. She wasn't just passing it out or anything. She had sex with two guys between being sophomores and the end of senior year, but everyone just made rumor after rumor about her. All because she was gorgeous. She joined the army after high school. Haven't seen her in years. I hope she's well.",
            "We talked not long ago and met in a café. She is working as a teacher in our same high school, still living with her parents.",
            "One is a dentist\n\nOne became a drug addict\n\nOne has a MLM/stay at home mom \n\nIne has an aesthetics studio",
            "Won a local beauty pageant but before she could go to the regional one she was done for theft/fraud and was stripped of her title. She still lives in the same small town and is a legal secretary, weirdly.",
            "She looks the same, beautiful as ever and had two kids.",
            "She is married to a billionaire in the middle east.",
            "Crack whore.  Like, literally.",
            "Single mom of 3 all different baby daddies",
            "She became a massage therapist of all things. Good reviews from what I saw. She looks mostly the same. Still perfect from what I can tell.",
            "She’s dead.",
            "She is now a he and does local weather",
            "She went on to study psychology and became a life coach. Married a dude with chronic depression. Had three kids.  One day he blew his brains out with a shotgun. His family blamed her and basically ran her out of any kind of family property. For whatever reason, I was the one she called. We still talk every now and then. She's still the golden girl she was in high school but there's a sadness behind her eyes.",
            "She's living solo in a cabin in the outskirts of the forest. She's an introvert and was almost traumatised by the attention in high school to a point where she's gonna keep living by herself with her animals.\n\nShe works in the animal behaviour field, where noone cares about her looks and sexual harassment doesn't exist. It's an absolute bliss.\n\nShe was me and I hated it.",
            "Model. Lived in germany",
            "Got married at the age of 19 to a doctor who is 10 years older than her and has a kid. she is a homemaker now!",
            "Edit: She got pregnant one month after graduating, had sextuplets and heard the other day she became a grandmother when each of her sextuplets welcomed their babies one day apart but she otherwise made a good name for herself in her chosen career field",
            "Really sweet girl, had no idea how stunning she was.  She was actually bullied by the girls because she was so pretty.  She had a rough upbringing, got herself mixed up in drugs and dated a string of losers.  She got it together, got a good job, a post graduate degree, and is making her life.  Still beautiful, but she has sworn off men.  She has decided she is happier alone because she can't be trusted to pick a good guy.  A lot of trauma in her history that has impacted her sense of self negatively.  We still catch up.",
            "Had a crush on her at the time and she was/is my best friend. We talked everyday. \nThen.. she had to move with her family to Norway (we’re both from Brazil).\n(Insert long and movie like story here)\nWe are married and we live happily in Norway.",
            "Hello Husband",
            "I married her and we have 4 kids and many grandchildren, she been a stay at home mom her whole life, I’ve been treating her like the queen she is…",
            "She's my wife now.",
            "She was the one who always smiled and was nice to everyone.\n\nStill is.\n\nI think you are judging by a whole different measuring stick than I am.",
            "She married a German prince. Not kidding.\nAfter becoming an investment banker.",
            "Almost all the pretty girls are still pretty, but my boy crushes jesus christ kkkkkkkkkk",
            "They are not on reddit to answer bro",
            "Head of a department in a university abroad.",
            "Still just as beautiful and kind as",
            " I don't know if the most beautiful, but to me she was. I had such a crush on her and was always friendzoned.. I saw her fb recently and yikes... It looks like a couple of botched cosmetic surgeries. Barely recognizable.",
            "She died in a car wreck her junior year of high school.",
            "She got into an accident and became a bit of a shut in. I still talk to her and sometimes we meet up",
            "Not the most ‘beautiful’ but the most popular (vomit). She was a mean bitch, thought she was top shit. Now she is a failed fitness influencer lols",
            "She wasn't just beautiful, but also sweet, kind, and would talk to everyone equally.  Even her name was beautiful. She married a triathelete/adventurer, and they have 2 kids. They are sponsored by a national travel agency to promote holiday destinations around the country. All paid for. Pretty sweet gig. Im really happy for her.",
            "Everyone knew she was the hottest girl. She ended up making headlines around the world for having sexual relationships with her students as a High School teacher. Her family is quite high profile to some degree - \n\nhttps://www.dailymail.co.uk/femail/article-11886121/amp/Disgraced-sister-groom-gets-starring-role-Lady-Amelia-Spencers-wedding-Greg-Mallett.html",
            "She is working for a city, giving out driver licenses. She is single again at 31, she is smart and still beautiful, but too dominant, so men leave her after while.",
            "Slept with her 20 years later after a mutual friends party. Now that’s playing the long game, greatest 60 seconds of my life.",
            "It was me, i'm doing just ok 🙂",
            "I went to a beach school in San Diego... there were more than one. The ones I know still are beautiful with beautiful families or beautiful and single. \n\nI have no idea how to answer this question correctly.",
            "Have no idea, everyone looked the same to me.",
            "My graduating class was over 1,000 people, lots of attractive girls.  The few I’ve been friends with on social media or see on Facebook friend suggestions, a combination of looks fade or they seem to be doing well enough enough or a mix.  \n\n Nothing negative to report from the little I actually know",
            "She’s a homeless runaway",
            "Married, divorced, kids and single. Not happy",
            "She’s on teen mom now",
            "She's on her 3rd husband and 4th kid, and has a career in amateur gangbangs in San Francisco.",
            "Works for some fashion house in London.",
            "She died of an overdose in her 20s.",
            "She married a guy who’s spent his career in marketing. It makes me upset to think about it.\n\nShe actually lived across the street from me for several years, ages about 10-14, and it was a time (early 1970s) when, in my area, in the summertime you went outside in the morning after breakfast, and found other kids from the neighborhood, and found things to do all day outside before going home for dinner around 5. And so she was my innocent playmate for four years while we were going through puberty. And she was one of the smartest kids in my class, and simply beautiful.\n\nThen her family moved across town. She had a couple boyfriends in high school. Lost touch with her during college years. Blah blah blah she went to work at a corporate job for a while, married a guy. Had kids. Decades ago. They’re still together. He’s a marketing consultant, FFS",
            "She's still Rachel Hunter.",
            "She got married and taking care of her kids.",
            "She died from leukemia two years after graduation.",
            "The bitch left me for a sugar daddy.",
            "Sadly I went to school that was in a rough neighborhood. Most of them are raging alcoholics now, shake when they don’t have a drink, just look worn out by life :(",
            "She got with an older guy who turned out to be a paedophile,  they have both been jailed for abusing young girls from their martial arts school",
            "Married a cop and got super out of shape lol",
            "Married, doing some business thing",
            "now a beautiful doctor.",
            "She became a paramedic and helped admit me to hospital years later when I had a funny turn. Nice person, albeit one of the popular girls. I hope she’s still doing well.",
            "She's married with two kids. We're not really close, but she seems to have a pretty normal life. She's still very pretty.",
            "I was considered one of the best looking guys in my class…but now I’m 21 and I’m only an electrician lol, make 6 figures though but I don’t want to do this forever",
            "Still beautiful and successful. Joined the government. Ended as permanent secretary for education. One kid.",
            "Really successful. Famous. Beautiful.",
            "I am still doing good",
            "She became a film director. Nadine Labaky",
            "She's a doctor",
            " Idek who the prettiest girl was, I was just a loser band kid bro but hope they're all doing good ig whoever tf they are",
            "She turned out to be a lesbian. With a happy relationship.",
            "Committed suicide 2 years after grad.😞",
            "It’s me!!! Doing great lol. Oh wait…… did you say  most deluded girl in high school???",
            "She got pregnant at 18.\nThe father went away.\nSingle mother with no studies whatsoever.",
            "She had 2 abortions our senior year and was strung out on drugs getting passed around by the boys. Oh and she came from a lot of money. So sad.\n\nAll the opportunities in the world can't make up for bad choices.",
            "She became my wife. Nailed it.",
            "I'm doing great, glad you asked. Just finish my Masters, moving on to pursue a PhD in economics too!",
            "I took her out a few times in high school and college but now she's a right winger. Bullet dodged.",
            "She has a average boyfriend, a son, lives in a small house and is living a modest life. I think she has a job in some office as hr-person",
            "She dated my brother and everyone else outside of high-school and she's 30 and a nanny with no kids or husband. The other ones gained like 50 lbs when they had kids",
            "She got married had a couple of kids and then got divorced. Been single ever since.  She was hitting on me at our last class reunion.  Never gave me the time of day in high school..",
            "Lots of Facebook stalking going on in these comments.",
            "That's amazing! It sounds like she's living her best life! So happy for her! Sounds like a total power couple!",
            "She had botched liposuction and the girl group she joined instead of going to college didn’t take off.  She was a local bartender for a while, then hooked up with and married a minor league baseball player. They had 2 kids, and she got a job in management at a makeup company.  The marriage failed and she moved with her kids a few states south. She’s got a new boyfriend, and they look happy, but it’s more pictures of them drinking beer camping and at a lake than in ballgowns at fancy events. She’s still in the makeup industry and still looks good for over 40.",
            "Not a beautiful girl but one of the “popular” guys slipped and fell 33ft to his death over a waterfall back in 2016. He was 23 at the time and he was bleeding to death and drowning at the bottom of the falls. His mum and some guy tried to save him but after an hour of paramedics trying to revive him he was pronounced dead at the scene.",
            "She became a drink server in a casino.",
            "No one comes to mind for me.",
            "To be fair i don't know which one was the most as i liked most of them. What happened have no clue as we didn't keep in touch.",
            "Is he 6’5 and blue eyed?",
            "I couldn’t tell you what happened to anyone at either high school I attended.",
            "She's a single mom of two and as far as I can tell she spends most of her time looking after her teenage daughter's baby. \n\nShe still looks good, but no one in their right mind wants to get involved with all that.",
            "Still gorgeous. Working as an accountant, married to another accountant and recently welcomed her second baby.",
            "No idea and I don't care enough to do a Google search. ",
            "![gif](giphy|XepEEIO0SCFLMT6tUL)",
            "Became a dentist. Found out because she took over my old dentist's clinic and is my dentist now.",
            "Got proposed to because she was pregnant. They’re married and seemingly happy, but I personally couldn’t let that one slide. It’s so tacky",
            "So I just looked up the most beautiful girl in high school on Facebook and she’s still ridiculously hot. She must be 40. Even her name “Jenna” is just like… come on.\n\nShe seems unmarried with no kids, weird seeing her… thanks reddit.",
            "She became a BBW fetish model and eventually auditioned for *The Biggest Loser*, but didn't make it on the show.",
            "Got knocked up in college, dropped out, had several kids, became a porn star, recently testified against a former President.",
            "Turned out to be sluts you wouldn’t touch with a 10 foot pole",
            "Last I saw she had become a nurse in the local hospital and had just been promoted so was in charge of her ward. She had also divorced the jerk she'd married and remarried this time to someone who apparently respects her.",
            "I have no idea. ",
            "There were many gorgeous girls in our large high school class, One graduated from college but never did anything with her education. She overdosed when we were 40. Very sad. \n\nAnother, went to college with me, got her PhD in college administration, married an Army guy, retired after having a successful career and is now living in Colors do, became a super good skiier. She’s still beautiful at 76!",
            "She got pregnant during summer vacation before Senior year of course.\n\nNot surprising being an ungodly beautiful Nicaraguan girl stuck in the midwest.",
            "I'm saving up for a private uni after leaving the public one for sexual harassment. Can't wait to actualize my dream of being a woman in stem. I'm glad others have awesome stories, too.",
            "She is 53 and posts photos and videos of her in lingerie with links to her only fans on Facebook for all her ex school mates and her 5 children to see.  \n\nShe was a stunner in high school and still very pretty but  I can't imagine doing this at 53.",
            "She got knocked up and had to leave school, worked at McDonald's for a while and just at home now",
            "The hottest girl in HS was Jamie. After I joined the Army, a friend told me she married the big Jock. Several years later I was home on leave. I went to the grocery store and saw a woman with two crying kids. She was trying to calm them down, but wasn't doing a very good job. The woman was pudgy, hair needed to be brushed, no makeup. She looked very distraught. I realized it was Jamie.",
            "she’s at a really good college now n her parents r still rich",
            "She works as a model.",
            "Not I'm my class, but a girl couple of years younger than me.\n\nShe was a stunning girl. Beauty pageants, the lot. \n\nAll the boys wanted to date her.\n\nYears later, I bumped into her and I recognised her straight away. She still had that really pretty face but she had put on a lot of weight and had two young kids in tow. She's a full time mom now. She seems happy and I'm happy for her!",
            "She got pregnant at 18 from a one night stand while she was all ‘saving myself for marriage’ and a perfect christian girl from the outside. She was giving me hate because I had sex with my boyfriend at the time. Shut me out of our friend group because of that a year earlier. I was living in sin without any remorse and didn’t lie about it so I was cast out of the friend group. She involved all our parents in that too, told them about my sins so they all supported her. \n\nShe got pregnant a year later while she was in some kind of religious school to be a pastor, she got pregnant and dropped out. The guy that got her pregnant didn’t want anything to do with her. Turned out she had a lot of one night stands. I don’t ever judge that but she was pretending to be a virgin and judging others for having sex. \n\nShe found a man, got married and pregnant and became a very dull looking teacher. She’s divorced again. And she’s still in all kind of religious groups. \n\nSo I chuckled when she got pregnant while pretending to be a saint. And I chuckled again when she got divorced. Not because I wish her any harm but because she was and is always judging others for not living according to the bible.  \n\nI left church and the town I was born in as soon as I could. \nI’m still married to the boyfriend I had back then. And objectively I look a lot better than she does now.",
            "Mine doesn’t work- she stayed living at home with parents and eventually married a rich guy. I hear she’s an alcoholic",
            "In school she was by no means the most beautiful but I suppose Elle McPherson did OK for herself.",
            "School - Left had tons of plastic surgery by 21, now like me a 50something but looks like her face would crack if she smiled the skin is so tight - but has a late teens toyboy (nr 2 she dumped the first when he hit 22)\n\nNearby School but went to the same club - hooked up with me to land a friend of mine, they were together four years before splitting, last seen in Holland (Cheech and Chong style). Met the **ex-friend** a few years back and he was still angry with me for not warning him what she was like.",
            "Honestly I saw her almost 15 years ago in our hometown with three kids on her shopping cart looking defeated. Harsh but it’s true and it didn’t get better for her.",
            "She OD'd at her 21st. She was 12 weeks pregnant at the time.",
            "She has an unsuccessful OnlyFans",
            "Found a rich bf with whom she moved to another great country, opened up some clothes business lives happily.",
            "Married a doctor. Just had a kid. Travels 90% of the time. Hard life",
            "I was a nobody, how am I supposed to know?",
            "She’s married to her high school sweetheart and has 13 rental properties and perfect looking children. A boy and girl.",
            "She’s making my breakfast right now.",
            "She was shit at academics. Moved to NY on daddy's money (not her father iykwim).  Is now a 'trad wife' and mom. Probably richer than I am (the ugly but smart kid). I still get to see her sometimes, we are good friends now even if we hated each other in school. We live 4 blocks away from each other.",
            "Does he have a PhD in the subject that is LSE",
            "Most of mine went to nursing school.",
            "She is on only fans getting railed by multiple men. \n\nSad really. She's aged very well, but seems very sad but everyone I know from School knows about it and some of the guys share stuff on WhatsApp.",
            "She married a b grade reality tv personality.",
            "Funny because the quiet, shy girl with glasses was 100 imo.  ",
            "Pageant girl in the 80's. Cruel to others. Dripping with privilege. Strung out by 2000, RIP 2018.",
            "Fell through a roof and did a number on her spine ",
            "She was groomed and repeatedly raped by her swimming instructor.  He fled the country and is living in Florida now.  She also left the country and is living in the mid west somewhere.  She, a petit white girl, married a big black dude and has 2 kids.  They seem happy.",
            "She BOGmaxxed and now looks like a malformed abomination.\nShame, really.",
            "Damn, OP carrying a flame all these years. Are you jealous of her husband? Are you married?",
            "I am still in love with her.",
            "She's engaged to the best hockey player in the world right now, Connor McDavid!",
            "I’m looking for a man in financeeeee",
            "She now has an extreme plastic surgery face and has an unsuccessful only fans account",
            "She is a drunk and is the same age as myself but looks haggard.",
            "When people say finance do they mean Accounting or Stockmarket finance",
            "Went to law school, married a rich guy, and lived happily ever after.",
            "i was a freshman in HS circa 2002, this one girl was easily a possible future Miss World candidate...got into drugs so hard that words lack the level of insane addictions she had... lost her beauty, health, and everything else before finishing college.\n\nCape Cod Daddy's money turned into having the party life dial permanently set to 11 until her life and the speakers blew out, made hendrix's death look like amateur hour.",
            "She was Nadine Coyle",
            "She married a Doc...",
            "She disappeared off the face of the earth as far as I can tell…",
            "I can’t think of anyone at either of my 3 schools who had the most beautiful girl title….\nWe were all dedicated weirdos lol \n\nMy sister is super hot but no one in her year level thought that \n\nIronically everyone in my year level thought she was hot and everyone in hers thought ,I was clearly we should have switched year levels 🤯😂\n\nWe know cos guys in our individual years used to tell us ohh your sister is so hot🤨 we were 2 years apart too \n\nHowever…. \n\nMy cousins daughter had it and she works in real estate and lives with her partner and their pets. \n\nI have a family friend and her  friend ( I’m also friends with ) had it too and she’s divorced with 3 kids and happy with her current partner, she had her first kid at 19 though. Her entire family is good looking too",
            "Went to Harvard. Lived with a much older guy for like 8 years, and finally admitted it was going nowhere. Took a job in Europe. Apparently fell legit in love, and now lives in Switzerland with her husband and their toddler.\n\nNot sure if this is unusual or not, but she is a legitimately lovely human being, and always was.",
            "No clue, because I didn't know her and she may have just as well ceased to exist",
            "All boys school so I'll assume it was one of our teachers. She's still there... :|",
            "Only fans",
            "Like a lot of people in my graduating class, myself included, she went into the military immediately post-HS. We had a disproportionate amount go that military route. \n\nLast I heard after a few years she went green to gold and is a nurse in the army now.",
            "Killed herself around 2012",
            "This is actually a classic movie arch. She became pregnant at 22 as single mother, depressed at 25 and addicted to antidepressants at 27. She's now 31 and still in therapy. She was that kind of 'live life hard, fuck everyone (literally), fuck consequences' type of girl.",
            "Was a model and then became a well known actress",
            "I’ve got an amazing life!",
            "No girls in my High school class; I studied in a boys only school in my country",
            "She is asleep beside me. She’s an incredible mother. Loving wife. And absolutely loved and respected in her work in health care management.",
            "I wasn't in her circle - and didn't know her all that well - but her name is Sharon and she was just *achingly* hot and somehow simultaneously cute and likable. She took time to speak with everyone. She never had a mean girl streak. \n\nWe graduated in the early 80s and I lost track of her. She eventually resurfaced when Facebook came along. Ran into her at a store and she hugged me like I was a close friend.\n\nThe dark side? She is a far-right crazy. She constantly posts QAnon stuff. She firmly believes the election was stolen and that Democrats are satanic pedophiles. She was convinced that Trump would be returning to power in 2021 during all that nonsense.\n\nPeople are for sure a mixed bag.",
            "T'was my sister! She's married to her high school sweetheart, nice house, works a lot, even on TV and films sometimes. I was the nerdy sister, but still a little known around school.",
            "She got married at 18 to her 30 year old boyfriend and now has 3 kids at 22.",
            "I believe she went to prom with all of her friends and she passed all of her exams and stayed on in sixth form.",
            "💁🏻‍♀️",
            "She became an engineer and works in the renewable energy industry. She’s also a dedicated advocate for uplifting vulnerable women in society. Also, she is still one of the most kind and understanding women I know. She is still beautiful inside and out.",
            "She’s traveling the world making music. I’m happy for her, she was a nice girl!",
            "I don't know who it was or if there was only one? Either way, no idea",
            "She went to art school and ended up marrying a Harvard educated doctor from a crazy rich Latin American family.  I think she now stays home with their kids.  Just a mutant born seemingly perfect in every way - perfect hair, skin, figure, face, super talented artist, and KIND.  Could have modeled but always played down her looks.",
            "She gained a lot of weight but she has kids and we all gain weight as we age so it's normal.",
            "There were probably a half dozen about the same.  I took one to homecoming my senior year.  They all seem to be doing well.  I ended up marrying younger so not in my class.",
            "She did to many drugs and overdosed",
            "She became a journalist and is now going between her penthouse and her boat. \n\nWhen she’s not at her favourite designer clothes shops. \n\nI kinda liked her, she was nice to everyone.",
            "She married Andruw Jones, the baseball player that played center field for the Braves. ",
            "She's about to enter her final year of medical school!",
            "around 17 she married her boyfriend from highschool while pregnant. honesstly the guy standed up to his responsabilities, and started working asap to have their own place.\n\nonce in a while i see her post on fb complaining its not the life she wanted",
            "She set her mother house on fire and was in jail, another one just died of an overdose.",
            "She moved across the border to New York.",
            "Not sure. Never heard from her again after A levels, and too generic a name to easily look her up without getting into creepy territory. Plus she's probably got a different surname now.",
            "She's at a Taylor swift concert...",
            "I saw her last Summer at our 50th reunion, she is still beautiful. Lives in the same small town, divorced from her high school boyfriend.",
            "Started a wedding photography business that they sold for over 5 million dollars, then she had a complete mental breakdown 6 months after having her baby and had to be locked in a mental facility for months before they let her back out. She thought she was God. \n\nTurns out since she wasn’t of sound mind they were able to get the business back (and give the person every penny back because they’re such good people honestly) and they’re back to living their dream. \n\nI do think her husband is gay though. But they seem happy and I’m really glad she came out of that psychosis. She was always so nice. \n\nShe was so popular in school. Her and her friends and they’re all very successful. She was Head cheerleader, valedictorian, head dancer in her dance company, and just so bubbly and sweet. \n\nHer bestfriend was salutatorian and now works at a prestigious law firm! Went to law school for 4 years on full academic scholarship and got the rest of her education covered by the firm she works for because they headhunted her. \n\nTheir other friend is a successful nurse practitioner opening a clinic with her husband who is a physical therapist. \n\n\n\nThey really were the nicest girls in school and I really am so happy for them.",
            "Carla was the prom queen..",
            "who cares?",
            "IG Thot",
            "She used a fake name. Will never know",
            "She married the most handsome man in high school who happened to be the student government president- they had 4 kids together over the span of 15 years. She cheated on him twice and now he has full custody of the kids and he works from home. She lives in a single bedroom in a strangers house and is on child support and has a bum as a boyfriend. She is my ex wife",
            "Idk but I do know that a lot of the quiet women I know moved on to do some badass jobs",
            "Idk she was nice to me in high school but I stopped following her social media sometime in college. She was out of my life and I decided I didn’t want to see all of the thirst bait she posted.",
            "She was a Victoria's Secret model, married Orlando Bloom, divorced Orlando Bloom, and she's married to the Snapchat guy",
            "She went to an Ivy League, met someone in med school, and now she’s a doctor with two kids. I hope she’s happy and out of her mom’s shadow. She actually wanted to be a farmer and I think she only pursued medicine due to her mother.",
            "to all the “most beautiful” young women reading this: the sooner you stop laying out and going to the tanning booth, the better.\n\ni was in a long term relationship with “the most beautiful” girl in school, and after it ended i didn’t see her for almost 19 years. just a few months ago, i saw her picture on linkedin, and she looks like she’s 10 years older than she is. and still tanning, jfc. it really shook me, tbh. she was a drop dead beautiful young woman the last time i saw her, and now she’s hardly recognizable as that person.\n\ntake care of yourselves!",
            "I was always somehow friends with some of the prettiest girls in school. Guess I was their DUFF a bit. Both dated terrible men. Got pregnant. One got an abortion and the guy she was with cheated on her while she was recovering. He was super emotionally abusive and she just did not seem to recover from him. The other had two kids, one really young, wound up being with a drug dealer but is also a nurse. \n\nFell out of touch, so hopefully things are better, but it’s how I learned that being the most beautiful girl doesn’t guarantee a great life. Great partner. Etc. in fact, sometimes you can get screwed even more because men are just looking to bed/conquer that girl. \n\nReally upsetting because both were really smart and amazing underneath all the incredible beauty.",
            "She got signed to a record label under Mya, Planet 9 I think. But nothing ever actually came from it. No idea where she is now.",
            "Moved to Idaho and lives a reclusive life, zero social media etc",
            "Problem is is your are beautiful in high school\n\n\n50 percent of the time you out grow it into a different face .",
            "She dated one of my brothers for years and then dated a married congressman. Eventually married a wealthy man 20 years her senior and I often see her at the country club.",
            "She got old and wrinkly.",
            "Started dating a 40 y.o. (married guy with a child) by the end of our senior year.\n\nSmall town + she was some sort of popular insta girl so people knew her.\n\nFast forward, people (including classmates) found out and started bullying her for not caring about being a homewrecker.\n\nShortly after highschool she disappeared, deleted all social media and so on. I don’t think she went to college or followed a career path, she was one of the most beautiful girls I’ve ever met but obviously not so bright.",
            "She was a sweet metalhead with a tangled mane and a very down to earth personality. Thirty years later, she is a sweet metalhead (but not as hardcore) with as tangled a mane as ever and she works as a biologist in the city's pest control office. I kind of wish our lives would have been more intertwinned",
            "She was one of the top students in my class with honey blonde hair and ocean blue eyes. She was dating this boy we were in gifted classes with in elementary school. They were both on track to be valedictorian for their respective grade levels. Then in 10th grade (he was in 12th), she got pregnant with his kid. She thought they'd get married. He dumped her so he could go off to an Ivy League. She dropped out of high school to raise the kid and became a creepy boy mom, the kind that hangs off their sons like a boyfriend.\n\nI would have felt bad, but she became such a bitch when we were in middle school and thought everyone was beneath her, especially when they started dating we were in 9th grade.",
            "Got pregnant with 2 baby dadies, and has a different live in partner now. She's literally one of the coolest people I've met in HS. Hope she's doing well now.",
            "To my surprise most ended up marrying average to below average looking guys.",
            "Not sure where she ended up. But I was infatuated with her.  She had long blonde flowing hair beautiful blue eyes.  And not sure what happened or where she went.  She was dating a doctors son and then she married someone else after high school even though they were a thing for as long as i remember. I was the poor fella in school in love with the rich girl. Tell me that ain’t a typical school crush. 😂 but I went on to do just fine without her.",
            "She left school, got married, worked in a bank, had a kid, got divorced, married again, another kid and another divorce and his currently a middle aged woman who works as a classroom assistant. \nHer beauty gave her quite an ordinary life.",
            "Was captain of HS cheerleading squad and member of college cheerleading team… married my Asian American friend who currently serves on the board of IT company and has two sons together.",
            "She got married, kid at 24, widowed at 30, parleyed her husband’s small insurance into a successful business. She’s not rich, but comfortably middle-class and apparently happy. I lost touch with her but as of her late 30s she hadn’t remarried.",
            "I went to an all guys school. So I’ll speak about who I perceived to be the most beautiful, at the girls school down the road.\n\nIt’s funny I had the biggest crush on her - and at the time was too terrified to speak to her. Even late in high school when our friend groups overlapped I turned into a babbling idiot around her.\n\nAs an adult I ran into her a lot in my early to mid twenties. She was a shop assistant in a place I visited a couple of times a year. By then I’d grown up a lot and she just seemed…normal. Which with the benefit of hindsight she was. Usually we’d laugh, joke catch up for a few minutes and then go our seperate ways.\n\nI haven’t seen her in five or six years. We both no longer live in our hometown. But we’re friends on Facebook. She got married recently and looks really happy.",
            "She did porn as soon as she turned 18 then got married after college and died at 27  during child birth, her daughter looks exactly like her",
            "I’m looking for a woman in finance, 5’5”, trust fund, blue eyes.",
            "I married her.  We have been married 35 years.",
            "Moved to Florida and married some bald guy",
            "Idk and idc",
            "Don’t know but I’d still hit that ass, whatever she’s doing. ",
            "She ended up getting married to the star football player. She became a teacher and he a coach. Years later she was busted having an affair with the star football player on her husband’s high school team.",
            "Turned old and ugly. Leathery skin, manhands, dental implants, drinks too much.",
            "don't know, don't care.\n\nwe were not friends... so to speak, very... stereotypical.",
            "Sorry for being blunt now but you asked. She became fat and looks old.",
            "Two died due to wrecked cars, three following drugs. \nThe plain  gals, true hot ones, are living well making real money with early retirement",
            "she killed a person with her car, now i think a prostitute",
            "Married a really ugly German guy and had a kid. Does not look happy at all...I was shocked why did she even marry such a man and he is not nice towards her also...  \nLiterally, could have picked any guy in our school and he would have been a better match. Quite ridiculous.",
            "She died, think it was suicide, Very sad as she was a really nice person.",
            "Had 2 kids with a guy she wasn’t married to and is now married to a different guy who also has 2 kids and she’s gained like 50 pounds very classic story",
            "She got herpes and is now single and alone.",
            "She’s blowing the biggest loser right now",
            "Are they Jessica and Elizabeth Wakefield?!",
            "That would boggle my mind too.",
            "They're genetically identical and grew up in the same environment. It's not a mystery that their lives would take a similar path...",
            "Not a girl but I have a twin brother. After school we tried writing applications without each other knowing where. I had a job interview at the end of it I was asked why I sent in 2 applications. It was my brothers. We ended up both getting a job there, years later we both moved countries because we again got a job at the same company but this time different branches which aren't too far from each other.\nIts really funny, we tried to separate ourselves but it never worked lol.",
            "I never understood people that had enjoyable school experiences to where they returned to teach in one",
            "![gif](giphy|ytTYwIlbD1FBu)",
            "Well done! Bravo!",
            "I love this, same girlie 💅🏽",
            "You will not remember me, but I still love you.",
            "okey, proof?",
            "Same, doing quite well. Next question.",
            "Matt?",
            "That Ms Chanandler Bong to you",
            "Why do all English teachers look fine asf",
            "I like how after you said she was a nurse practioner, you had to clarify that she was nice. It seems like every girl I went to high school with who wanted to be a nurse was mean as hell.",
            "Family annihilation story incoming…",
            "I went one a trip once and met a lady who fits this description to the dot.",
            "what's her grammy? prove it",
            "Who is the one in the TV Show?",
            "Sounds like your high school was stacked !",
            "Your angel is a centerfold......",
            "She helps the chemicals recover from their pathological ways?",
            "WTF!",
            "I wonder what her thoughts are on a teacher in her school now dating one of the students. She's got to be cool with it if it's her own family origin story or does she see now why it's probably not cool?",
            "Think you need to elaborate on whether she was dating a teacher while she was still at the school.",
            "I personally would like this to be turned into a tv show. Probably a comedy drama ",
            "This sounds like the plot to Wicked.",
            "![gif](giphy|efSePxL3C27zLG0QHY|downsized)",
            "![gif](giphy|2iybkQhyUxhm2LlyGG)",
            "Okay..",
            "Damn. Is there a source for that story?",
            "someone's happy!",
            "Yup, and turned out looking like her mother, who would have thought hey",
            "Reminds me of the mom from What’s Eating Gilbert Grape.",
            "All my ex's live in TX.",
            "She sounds like a douche.",
            "I have an old friend like that... wears platform flip-flops and toe rings, raccoon eyeliner, and low-cut tops and always takes pictures hanging off her preteen son as if he were her boyfriend with one platform heel raised as if trying to look seductive.\n\nI guess it might look kinda hot if she didn't look like she were an 80-year-old leather saddle. We're in our 30s.",
            "Also doctors play down the risk level for that age so they probably don’t find out until its too late",
            "❤️",
            "Two guys in high school is normal, those people are tripping HARD. Gotta be jealousy",
            "I never even had sex until after I graduated and there was a rumor a guy made up about me having sex with him in high school. Smh. \n\nI get it’s high school but shit need to mind their own business about people’s sex lives.",
            "Why did they all become teachers lol",
            "I feel like…. Utah?",
            "So many of the high school hot girls I knew are hawking Pampered Chef, cosmetics, wine and other nonsense",
            "I’m a dude in the Middle East.\n\nThat’s where the similarities end",
            "Prolly gives some fire gummy dummies for like $20 though",
            "must be a good looking dude; but which team does he bat for? 🤣",
            "What the hell. Are you me? Growing up I used to cry in my room alone because of all the attention/harassment, wishing that I was just like others. \n\nThe best part is that you don’t get to make real friendships/bonds either cause everyone’s faking around you and you see right through their bull****. \n\nI also decided to move out to a forest but watched this movie “Into The Wild” that changed my perspective and then never really took the plunge. So I just resort to staying home and avoid going out but do try to make the world a better place too. \n\nBut good for you. Glad that it worked out for you in the end!",
            "you won!",
            "Germany has been a republic for over 100 years. There are no German princes. ",
            "A broad, you say?",
            "Which country?",
            "dominant single mother in training , then. Or else some lucky simp will happily become her pet.",
            "Its pretty obvious by whats getting upvoted that people just want to hear stories about those who ended up with bad lives or sad endings to confirm their own narratives and stereotypes.",
            "so edgy",
            "GField College! A good friend of mine was a year or two behind Rachel. Apparently a good chick.",
            "So you happen to know why?",
            "that sounds miserable.  like,  beyond miserable,  with mom there to witness it all.",
            "What's tacky?",
            "The ones at my school all went as a group to become dental hygienists.",
            "Hahahahhaha no just joking",
            "Sounds about right",
            "No way no fucking way!",
            "Yes, they teach at Sweet Valley High.",
            "Are they still with Aaron and Todd?",
            "My mind is bogled",
            "Mind your boggling",
            "Either they end up on the same path or the complete opposite, there is no in between",
            "Especially since both nature AND nurture parts are equal here; it would be interesting to see how that would have ended when the other one would recieve a completely different nurture part. (Just a question, not meant in a Joseph Mengele approach ofc)",
            "Usually twins brought up together tend to have more different personalities than twins brought up separately.",
            "Yeah pics or it didn’t happen lmao.",
            "I assure you they don’t",
            "My English teacher beg to differ",
            "This tracks: asked a girl I was in hs with why she wanted to be a nurse.  Her answer? I get to stab people with needles.",
            "Character building plot",
            "Watts that supposed to mean?",
            "lol nah. I mean I ain’t besties with em or anything but I doubt it.",
            "Dear reddit my (35M) wife (33F) is working extra hours at her nursing job and seems to own a second phone for work  purposes that she keeps hidden from me. Do you think she's cheating?",
            "You met a teacher while traveling? Gotta be her.",
            "It’s gotta be her then",
            "I don’t have Instagram lol",
            "🗣️🗣️ angel is the centerfold \n\na part of me has just been ripped \nthe pages from my mind are stripped \noh no I can’t deny it \noh yeah, I guess I gotta buy it",
            "This joke was so unexpected, I laughed way to hard at this!",
            "She slept her way up, why the fuck not. Its a valid way to climb the ladder, as it is what many people do.",
            "As a student.",
            "or The Odd Couple.",
            "He asked 🤣🤣🤣\n\nI never realized how many fucked up stories I had of other people until I started sharing them on reddit",
            "Good job?",
            "OK wut?",
            "I'd rather not just because it would make it easy to find out at least the area I live in at that point",
            "Genetics!! MUAHAHHAHA",
            "Well, i also have tattoos everywhere and have had blue hair 🤣 im sure she's a lovely person now, but I really don't need/want to find out more than what i see from the occasional Facebookpost, School was hell for me, and she and her friends really didn't help. Luckily, I took a different path than most of my old classmates, I rarely see any of them. I genuinely hope all my old bullies are doing well, most of them have kids now and I hope with all my heart that their little ones never have to experience what they put me through for 13 years. It's not fun walking home mid winter in shoes someone tried to flush down a toilet or picking banana out of your hair during math class cause you got held down while a bunch of girls mushed it into my hair. We're in our 30s now, I hope they have all grown up and changed for the better.",
            "Not sure why people downvote you, but it’s 100% - in most places in the world women aren’t really tested for breast cancer until they are in the 40s; I heard from one doctor that the most common way for women in their 30s to learn about breast cancer in her practice was by THEIR PARTNER feeling something off about their breasts. \n\nWomen aren’t taught well how to screen themselves for that and not all doctors will actually do the check-ups.",
            "Not normal where I live, where one in senior already puts you above all the rest. Two? She’s the high school slut, that’s how kids think.",
            "They’re the only ones who think kids are nice because they were all nice to them at the time.",
            "You fit 2/3 of the criterias.",
            "The Royal family still exists though",
            "This guy doesn’t fuck",
            "Who said she was a mother?",
            "Lol",
            "She was the same year at GC as my younger brother and they were in a couple of classes at Windy Ridge Primary together. She also modelled a dress a long ago ex-girlfriend designed and made at the Benson and Hedges fashion awards. I bumped into her a couple of times in the odd melee after she'd ascended the fame pyramid and she always single me out, made small talk like someone who grew up on the same street. Good chick isn't really adequate, IMO. I was not a cool kid but I played in a lot of bands and having someone like her single me out lent me unearned social kudos in an image conscious industry. She knew what she was doing too. Stacy's Mum has got it going on.",
            "I don’t. I found out from other classmates, but they only mentioned the how, not the why.",
            "It was absolutely tragic, he was a really nice guy too compared to the rest of the group he would hang around at school. He and his family definitely did not deserve it :(",
            "Makes sense\n\n![gif](giphy|WAuMMjLDP03Xq)",
            "Boggle your minding",
            "Do you mean \"more different personalities than...\" ? I would be interested to know if their is any evidence for that claim",
            "Yeah we used to have one that got called Miss Proportion because her lower half was that of a severely obese woman but her top half was normal. Kids are cruel.",
            "Men who annihilate families (kill their wife and kids, then themselves) often have what appears to be a “perfect” life on the outside-  dating young, several kids in their late teens early 20’s, and then when something comes up later in life (job loss, infidelity, discovery of infidelity, mental or physical illness, financial setbacks) these guys don’t have any resources to emotionally overcome the setbacks, and just kill everyone instead of going through the difficulty.",
            "TO THE DOT",
            "wish I knew this from the beginning",
            "She still had to do the work and get the degree.",
            "Or Wednesday",
            "Stabbed to dearh?",
            "I'm so sorry you experienced that. You didn't deserve it. Bullies are scum. Do they ever really change, or just know how to hide it? Who knows. \n\nIt's likely some insecurity of their own made them like that, but in my opinion it doesn't justify what they've done. \n\nI experienced similar but in a less direct way at first as I was sporty, tall and strong for my age. My possessions would be vandalized, bike stolen, death threats sent to me. Eventually outside of school I came across them when they were all drinking, I got jumped by a gang and my head split open with brass knuckles. Why? Because I was seeing the ex-girl of the ring leader. \n\nSomeone told me to pray for them.\n\nDo you forgive her?\n\nThe best you can do is live your best life and not hold on to anger I guess.",
            "No it doesn't. There is no state recognition of royalty. Descendants of former royalty exist, of course, and were permitted to regain some of \"their\" assets after unification. ",
            "„In training“ so one of the men who nope the fuck out will leave her a present, so to speak.",
            "she'll end up one by 40",
            "your boggled minding",
            "Yes, edited\n\nhttps://www.livescience.com/47288-twin-study-importance-of-genetics.html\n\nhttps://pubmed.ncbi.nlm.nih.gov/3397862/",
            "It's never too late to start lil bro",
            "That's what I said",
            "Says the expert on women",
            "This guy can't hang",
            "Your minding boggled",
            "Neither the article nor the study supports the claim that twins reared *apart* are *more* similar than twins reared together, which is what you seemed to be saying. Why did you link those articles in particular?",
            "To shreds you say?",
            "Mind bottling."
        ]
    }
}