{
    "Heads up industry peeps! Apply for flair to make top level replies in AskCarSales.": {
        "title": "Heads up industry peeps! Apply for flair to make top level replies in AskCarSales.",
        "score": 243,
        "url": "https://www.reddit.com/r/askcarsales/comments/13uzed7/heads_up_industry_peeps_apply_for_flair_to_make/",
        "content": "This subreddit has grown *a lot* in the last few years. Not only professionals providing advice, but also casual bystanders wanting validation for their opinions. The problem is that the noise to signal ratio has gotten to the point where people looking for advice come away more confused than when they asked the question - or worse yet, act on unqualified bad advice.  \n\nIf you are in the industry in some professional capacity, [message the mods](https://www.reddit.com/message/compose/?to=/r/askcarsales) for how to acquire flair.\n\nFor all who do **not** work in the industry but wish to provide advice, you will need to wait until a flaired individual responds before you can comment under their reply.\n\nFlaired members in good standing, if you see someone posting bad advice under your comment, report it.",
        "num_comments": 228,
        "comments": [
            "Good luck everyone. I'm still not interested in providing my personal info to anyone on reddit, but completely get the necessity of this.",
            "If I understand the new rules properly, once a flaired user(I guess that is the small writing below ones name) posts than normal every day folks are allowed to post?\n\nI generally will only provide advice if I personally have experience with something or if someone I know went through what the OP is experiencing which for me is very very rare, where I enjoy posting are side questions to simply learn more about the industry because I genuinely enjoy \"inside baseball\".\n\nAre side questions still allowed or is that now no longer acceptable?\n\nEither way, I truly appreciate this sub and the helps that the users provide.",
            "Makes a lot of sense! \nIt’s r/askcarsales not r/asksomedudethatlastboughtacarin2017",
            "Does this mean that now only flaired contributors can make top-level comments?",
            "Finally.",
            "It would probably be a good idea to update the \"READ THIS FIRST\" section to say something like: \"Top level comments can only be made by flaired users. Anyone with flair has submitted proof to the mod team and has the specific industry knowledge needed to answer questions. If you need flair, message the mods. If you don't qualify for flair and would still like to contribute please be respectful and reply to any top level, flaired comments with your relevant information.\"",
            "This had to be done and I applaud the change.\n\nJust an example of a ridiculous thing that happens all the time… every time an OP has buyers remorse, every single thread… someone pops in and tells them they have a cool off period or x amount of time to return a car. I remember one time some lurker told an OP they had 60 days… all of us know this isn’t even close to true, but it happens in every.single.thread\n\nThe sub is askcarsales, not askaguymakingaguessbasedoffa10yearoldblog. You might not like the answer but when 20 people are telling you the same thing, even if we all get downvoted, it doesn’t mean it’s wrong.",
            "I understand this, but I’m really going to miss disputing all the bad advice. On the other hand it’ll be nice not to get downvoted for stating the truth.",
            "I often found that I have stopped replying because I and other flaired users get buried by 400 comments from \"guy in sandals and socks with a notebook who watched a YouTube video before he bought his last 'new' car in 2011\". Great changes.",
            "I always like providing feedback, but sometimes I see a thread so far gone that there’s no saving it. Hopefully this helps.",
            "I want to make a public apology to the mod team.\n\nWhen the new rule came out that non-flaired users can't make top-level comments, I was worried that it would seriously tamp down on the number of absolutely zany off-the-wall threads in this place.\n\nSo far that has not happened. In fact we've had some real winners shine through this week and I didn't even need to wade through people who want to validate their bullshit to find them.\n\nKudos to you all.",
            "This sub has needed this for a long time. I’m glad to see the change",
            "Finally, this a great change. Now I need one of the mods to message me back so I can get flaired.",
            "Looking forward to the change.",
            "Great news!",
            "Same message to change a flair? Moved positions and stores, would want it to reflect accordingly",
            "Excellent thanks CCC! What exactly is top level replies? Does that mean that regardless if some morons decide to downvote us into oblivion because it’s advice they don’t want to hear, the replies will still be visible at the top?",
            "Still Ric Flaired?",
            "Ty!",
            "Exciting change!",
            "Definitely a welcomed change! Thank you",
            "Nice it’ll be good to keep the normies under control",
            "Great change! Hats off to the mods and 03 Camry buyers for making this happen",
            "Great change!",
            "Finally a way to stop the useless chodes from coming here crying",
            "Great move for this sub.",
            "Non salesman here but love the idea. One question at the end it says they can message the mods about ‘bad’ advise below their comment. Wouldn’t that be subjective if it’s ‘bad’ or not? In that case would the mods review it before removing or just straight up remove cause the OP didn’t like what was said?",
            "I can now look down upon the unwashed unflaired masses",
            "Finally! Thank you for doing this. I hope this cuts down on the uninformed bullshit people reply with here.",
            "I totally approve of this decision.",
            "I sent a pm",
            "Hallelujah.",
            "I'm officially a bitch!",
            "As a daily follower of this sub, I welcome this change.",
            "Great move.  For the past several weeks I was afraid the sub was going to collapse under the weight of bad advice.",
            "I’m not in the industry but it’s nice to see which commenters are. Good idea.",
            "Who wants to add flair today?",
            "I really enjoy this sub. There are some good questions on here and some really dumb and too late ones. \n\nI got out of car sales over 10 years ago partly because I really lost my ability to deal dumb people and whiny b****es. \n\nStill have plenty of friends still in and I keep in touch. They do not make me want to go back. There is more money for the right people but it is so much harder and micromanaged. To those selling cars honestly and professionally I salute you. \n\nTo the Covid Clerks that think people should feel grateful to be allowed to buy a car from you at MSRP +$3000 and forced to take some add ons that they don’t want,  you are part of the problem that makes people not like or trust salesmen. \n\n\nI wished people on here could accept these facts. \n\nSometimes it’s the customer’s fault\nSometimes it’s the customers fault but they will still blame you. \nSometimes it’s the Manufacturer’s fault \nSometimes it’s the Manufacturer’s fault but it’s your problem. \nSometimes customers are jerks\nSometimes salespeople are jerks\nSometimes the buying process leaves a bad taste in people’s mouths. \n\nInventory is up for many places but interest rates are as well. \n\nPeople should not expect a free car just “because they are important people in the community and others will see it so it’s good advertising for you”\n\nCar sales is not charity work or the lord’s work. \n\nI hope every salesperson on here hits a good bonus and makes plenty of money this month. \nI hope every buyer gets a good deal on the vehicle they want.",
            "Yeah I wish there was a way to validate someone without essentially having to dox yourself.",
            "Late to the game here as apparently I haven't interacted with this sub in over four months lol. Discovered this new rule when I answered a question and had it removed. \n\nAnyway I agree with you. I left the business about 7 months ago after a little over 10 years. Always felt like answering questions on here was putting a little good karma out into the sales world. But I'm not interested in digging out one of my old business cards and small time doxing myself to answer subreddit questions. \n\nKeep up the good fight boys and girls but I guess that's the end of the r/askcarsales train for me.",
            "I agree, can you guys verify me via my work email?",
            "I know.  I’ve been in the car business for longer than the mods have been alive.",
            "I dont get it.  Been in business longer than most here and try to be helpful not sarcastic or snarky!!",
            "> If I understand the new rules properly, once a flaired user(I guess that is the small writing below ones name) posts than normal every day folks are allowed to post?\n\nCorrect.\n\n>Are side questions still allowed or is that now no longer acceptable?\n\nNot sure I understand. Do you mean followup questions that ask for clarification of the original post?\n\nHappy to have you here.",
            "That's too long of a name. I suggest r/dealershiphate",
            "[removed]",
            "[deleted]",
            "Correct.",
            "About time lol",
            "Thanks for sticking around.",
            "Excellent suggestion! Thank You.",
            "People upvote what they want to hear, even if it has no basis in reality.",
            "There are far far too many people confusing individual dealer policies with state/provincial/consumer laws on all those cool-off period posts.",
            "It sure could get spicy at times. Problem was that OP often felt like they were the bone being fought over by a pack of dogs.",
            "[removed]",
            "It was overdue.",
            "Thanks for the back handed compliment. ;)",
            "It took some tweaking to get to this point, but it seems to be working as intended.",
            "Yes.",
            ">Does that mean that regardless if some morons decide to downvote us into oblivion because it’s advice they don’t want to hear, the replies will still be visible at the top?\n\nOnly comments made by flaired users will be visible. Votes will move the comments up or down as usual. If someone with flair is being a fuckwit, we will warn them or remove flair.",
            "Woo!",
            "Sorry, Ric?",
            "Thanks! It was overdue.",
            "They can still comment - just not control the narrative.",
            "Yes, it can be subjective of course. We review it and try to gain some context before taking the step of removing a comment.",
            "You can even lick the nut cheese from our unwashed chodes.",
            "If you're in car sales you already dox yourself to a hundred people a week.",
            "This is my second account that I’ve had verified on ACS and ICS so a total of four times I’ve been verified. Haven’t had any sort of problem",
            "If your post history passes the sniff test, we request you send verification to just one mod of your choice.",
            "I sometimes ask side/follow up question just the other day, an F&I poster was explaining why at least at the dealership that he/she works at doesn't accept credit/debit cards.\n\nThe F&I poster said part of the reason was charge backs and I asked a side/follow up question (not directly related to the OP) about the charge back process as I as a consumer did not understand how the process worked on the merchant end.\n\nI have learned a lot about things that I had no idea about form this sub, especially business, being a physician business is anathema to me (sadly) and anything that can make me a better consumer is a win in my book.\n\nAgain, I appreciate this sub because it has made me a better car buyer and just overall better at business.\n\nAdded to that some of the stories that you all tell about life in car sales is absolutely fascinating.",
            "Just checking to see if I even *have* flair\n\nEDIT: Shit.",
            "Still more qualified than anyone who hasn’t bought a car in the past three years",
            "8 out of 10 that failed safety inspections say shit posting not required for people to know they’re shit",
            "Awesome. Also would be cool to be allowed to keep communicating on locked threads as sometimes, I’m like, damn I forgot to include this golden nugget",
            "🎉",
            "How can I just post a Question?",
            "Of course! Gonna have to ban me to keep me from looking at this dumpster fire lmao",
            "In addition - and you probably already thought of this - you should probably remove the joke or problem child flair that has been handed out over the past 10 years. There are lot of \"don't listen to me, I'm a moron\" type flairs out there and obviously you don't want those people making top level comments.",
            "While I’m sad that I will no longer be able to contribute to answering questions I’m happy this decision was made as frankly, yeah, it’s getting out of hand.",
            ">People upvote what they want to hear, even if it has no basis in reality.\n\nI like to say that we have a lot of civvies here, both asking and answering, who are interested in validation rather than facts.",
            "I think I participated in a few threads like that … . \n\nYou’re correct, probably for the best.",
            "That is not what this thread is about.",
            "Agree wholeheartedly with this change. It wasn't bad back when it was < 50K subs, but holy cow has it gotten bad in the last few months.\n\nI think quality overall will be much, much better.",
            "[removed]",
            "Can we define fuckwit as I have surely stepped into this territory. Hopefully in more of a jovial “Journey” type fashion",
            "Either way I’m happy. I sent a request for a name change hopefully it’s approvable for you",
            "Oh ok, thanks. Hope it cleans things up around here. Love debating and learning from everyone!",
            "When subreddits become circle jerks for people with jobs the subreddit is about, i agree. Time to mute these posts off my feed.",
            "Not what I mean… if I meet someone in person then we have a relationship and a face we can recognize… not so much when you have thousands of internet strangers in the same forum.",
            "I don’t doubt there wouldn’t be any problem, I just don’t like giving my personal info to anyone, including mods.",
            "Right?  Hell, I'm retired, but still post here all the time.  I figured I earned it and messaged for flair.  If not, oh well.  I'll just sit here, help when I can, and call out the flagrant bullshit posters as I see it until someone decides to ban me lol.\n\nI enjoy this space and have seen it gone to shit over the last few years.  I'm really glad they decided to try and curb the nonsense.",
            "[removed]",
            "https://www.reddit.com/r/askcarsales/submit?selftext=true",
            "I can figure that out if you REALLY want",
            "That has been addressed.",
            "You can still contribute. It just won't be a top level comment.",
            "I think everyone who is a regular has done it at least once.",
            "Dang, new sheriff in town.",
            "What does a cobrachicken eat anyway?",
            "Our goal is just to lower the temperature in the room and reduce the number of cage fights.",
            "Part of the goal for this change is for mods to have a little more time to scrutinise individual replies. Use the report button. Stuff that is patently bad advice runs a high chance of being removed and the flaired user warned. \n\nYou also have the option of voting and/or replying under that comment.",
            "Usually someone who can't discern the difference between being blunt and being abusive.",
            "You don't need to verify your IRL identity with any of them. Just one moderator.",
            "Understandable",
            "It’s askcarsales not askcarbuyers, why is that so hard to understand?",
            "How many cars have you bought in the last 3 years?",
            "Yea. It won't let me for some reason",
            "If you're that afflicted by my comment please be my guest lol",
            "What's the plan there? I really like the *I'm a dumbass* flairs.",
            "I think their point was that if we (no flaired) have to wait until a flaired user has commented, then 99% of the time, it will just be a redundant comment.",
            "A reply would end up being redundant in most instances.",
            "[removed]",
            "Any damned thing it wants.",
            "Though some have been entertaining. \nI do like to hear opinions. Opinion oriented discussions are quite fun. \nThank you for doing the “mod”",
            "[removed]",
            "To be fair, I’ve seen many “flaired” posters providing sleezy advice protecting a shitty dealership. All dealerships are not equal and definitely not ethical.",
            "Is there a specific rule for flaired users being condescending jerks? I tried to engage here in good faith once and had a couple of flairs just bully me. I reported the comments, but there was no specific rule that fit, if I remember correctly. So I don’t know if anything came of it.\n\nOne of the users even trawled through my comment history and started insulting me in other subreddits. I reported it as harassment, but the admins did nothing.\n\nEdit: okay, why on earth is this comment being downvoted? Why is everyone on this website so mean?",
            "Otherwise known as a failure to know which end of the gun points away from you.",
            "I understand. I still wouldn’t want to do that.",
            "[removed]",
            "[removed]",
            "Sounds like a possible reddit problem, not sub specific.",
            "Just feel things out for now.",
            "Yes and no. Further replies often add nuance or may possibly dispute the top level comment.",
            "Damn straight.",
            "We have always required proof for flair.",
            "That is certainly a challenge for the industry. All we ask is that you use the report button. You might not see us take obvious action, but we're watching.",
            "It goes back to the most basic reddit rule of all - [remember the human](https://www.redditinc.com/policies/content-policy). Shoot us a mod mail if someone is being an unjustified asshole.",
            "Accurate.",
            "Then click report.",
            "I might argue that someone that’s been selling cars a week is just as qualified as you to give advice on this sub.",
            "It says I need Flair?",
            "Fair. \n\nPlaying devils advocate though, if a flaired user posts something that is incorrect (for whatever reason) and I reply something contrary to that which is the correct information the precedence has been set that the flaired user is going to be correct since they are in the industry.\n\n(I fully realize this is not my show to run, and I think this is a good change, by the way.)",
            ">Yes and no. Further replies often add nuance or may possibly dispute the top level comment.\n\n... I see what you did there",
            "[removed]",
            "Good deal. There seems to be a trend with one particular brand. (I’m not going to name it because I don’t want to be attacked) I worked a few years in the industry before I went to the industrial/mfg sales side.",
            "[removed]",
            "I will directly oppose any of the fellow salespeople just to help the common man.  Vote Krang",
            "We do recognise the temptation for nepotism to ruin the quality of replies. The mod team has been recently expanded with people not directly in the business. That should make it harder to sweep problem flaired members under the rug.",
            "I have and often do comment on other flaired users' posts disputing what they say.  Whether I'm a flaired user or not, other people in the industry (or just anyone who's a member here) are always encouraged to engage in respectful conversation.\n\nWhat isn't encouraged or tolerated are people who violate the sub rules, which aren't that strict TBH. I'm generally pretty tight when it comes to following rules, but hey, I got myself banned from LegalAdvice, twice (now permanent)! \n\nIt's really just rules #1 and #10 that get violated the most -- give the relevant info about the specific vehicle you're interested in, and don't come here just to bash car salespeople after you've \\*just\\* bought a car without bothering to ask a question first. There's a reason it's called AskCarSales and not BashCarSales. Plenty of other places on the internet you can go do that.\n\nAnd if you are asking questions \\*after\\* buying a car, 99% of the time it's too late to undo whatever mistake you just made. I might suggest that become rule #12 -- kindly ask your questions about an important, expensive, life-altering purchase \\*before\\* buying the car, not after.",
            "There already is a [FAQ](https://www.reddit.com/r/askcarsales/wiki/index). The problem with going too granular is that not all advice is universally applicable.",
            "Your \"example\" is horrible.  \n\n\nNot trying to go off on a tangent, but we work in an industry that is rampant with fraud.  Pulling credit isn't legally required, no.  But it offers some level of protection to the dealer.  And yes an OFAC is required, which can be done without a SSN, but its a lot easier with.  \n\n\nIts opinions such as yours, in your example, that confuses buyers with half truths and twisted interpretations.",
            "Well first week selling so let’s assume he’s at a decent dealership and received at least a couple weeks of training before hitting the floor. He likely knows the general road to the sale, maybe even did some role playing during training. End of the first week at a halfway busy dealership and he could easily have sold 3 cars. \n\nAt a decent dealership, a manager with much more experience will have given him some advice/word tracks or performed some T.O.’s for him that if he’s smart and wants to learn, he will have sat through and listened to. I went through the buying process with 3 people today alone and have watched a guy brand new to sales floor (and sales in general) sell 7 cars over the last two weeks. \n\nJust by the numbers, he’s gotten more experience in two weeks than you have in the last 3 years.",
            "That's pretty cool. For a while it seemed like Loaf was the whole bucket brigade all by himself.",
            "[removed]",
            "[removed]",
            "He was busier than a one armed paper hanger. Not fair for anyone.",
            ">I think you’re proving my point\n\nPretty sure we proved each others point.\n\nBottom line, your opinion doesn't trump reality.  I reply on here, and answer questions based off decades of experience.  I don't get paid to answer questions, and there's no reason for me to give wrong answers.\n\nThis change was needed because of the onslaught of wrong opinions from people that may have bought a few cars, but have never seen a deal from the sellers side.  So yes, maybe I proved your point but you also proved mine."
        ]
    },
    "Do you really want to become a car salesperson?": {
        "title": "Do you really want to become a car salesperson?",
        "score": 145,
        "url": "https://www.reddit.com/r/askcarsales/comments/1d4y11a/do_you_really_want_to_become_a_car_salesperson/",
        "content": "It seems like more and more people are asking about if car sales is the right career for them.  Below are my observations on the industry and hopefully it helps you make a better decision.  \n\n  \nCar sales can be an extremely rewarding profession with professional growth opportunities and a wide variety of positions.  While this can come with above average pay, it also tends to come with below average benefits, above average hours worked, and inconsistent pay.  Hours and pay will vary by location, store pay plan, and store performance.  \n\nSalesperson Schedule and Pay Progression\n\n* Year 0-3, the first few years at any job tend to be the toughest, car sales is no different.  Many dealer groups offer 0 vacation time to new employees before the 1 year mark.  For the first 2-3 years, Green Peas (new salespeople) will likely work 50-70 hours per week, with many of them skipping their day off to work.  While this is not a requirement, car sales is very much \"get out what you put in\" and you have to be at the store to help customers.  Pay during this time may be all commission or a small base plus commission.  Either way, earnings will likely be <65-80k.  \n*  Year 3-5 is the next step.  The car salesperson should now start seeing repeat and referral business.  This not only means more sales, but also a chance at less work.  Since salespeople at this stage have more business coming in, they may start to work less and see the occasional 45 hour week.  Most weeks will be in the 50 hour range with some hitting 60.  At this stage, earnings will likely be in the <$90k range for the above average performer and <$130k for the great ones.  At most stores this is the point where someone may begin to be considered for a promotion.  \n*  Year 5+ is relatively steady.  The salesperson now has an established book of business with a strong sales base from repeat and referral business.  This will get better and better over time, but now is when the real difference starts to show.  People that are still in the business at this point will forever be able to make a career out of it.  At this point, the hours are much better with the occasional <40hr week with most weeks in the 45-50hr range.  While income is relatively unchanged, a new tier starts to emerge at >$150k.  While not at every store, they exist with some breaking $200k+.\n\nSalesperson Income Breakdown\n\n* 50% of sales people in the industry make <$65k.  This will not be their career and they will be on the chopping block if cuts need to be made.\n* 30% make <$90k.  These people can make a career out of car sales and will always have a job.\n* 18% make <$130k.  These people are above average performers and often the top salesperson at their store.\n* 2% make >$150k.  While not at every store, these salespeople have mastered the job.  They have great repeat and referral business.  They also tend to be more autonomous, closing their own deals and working as needed.  \n\nCar Sales Career Progression Track\n\nCareer growth at most stores follows a similar path with the majority of promotions coming from within.  It is rare that a store hires someone from another store and promotes them, the main exception to this is the jump to GSM and GM.\n\n* 3-5 years as a consistent high performer and a promotion to F&I becomes a real option.  F&I handle all of the paperwork and financing, they no longer have to go on test drives, but they are still selling in one form or another.  They tend to work long hours since they are the final touchpoint for a customer.  Depending on the store set up, this could mean 50-60 hour weeks.  Pay can range from $100k-$200k+.  \n* 2-4 years as a strong performer in F&I and a promotion to Sales Manager becomes and option (some stores will break off here with the option of a Used Car Manager, or Commercial/Fleet Manager).  Much like F&I the managers need to be present and will often work over 50 hours.  Pay can range from $120k-$250k+  \n* 2-6 years as a strong Sales Manager and promotion to GSM becomes an option.  At this stage you are leading the entire sales department, at many stores they may also be a floor manager that desks deals.  They likely work <50 hours a week unless they are filling in for someone.  Pay can range from $200k to over $400k.  \n* 4-6 years as a strong GSM and promotion to GM becomes an option.  This is the top position at most stores (save the occasional dealer principal/owner that also works).  They are experts at selling cars and usually have over a decade of strong performance in every position.  They can fill in any gaps as needed.  At some stores they may have also done some stints in Parts & Service just to experience them.  They usually work <45 hours a week.  Pay can range from $300k to $800k+\n\nIs Car Sales Right For You?\n\n* Do you enjoy talking to people?, While you do not need to be the life of the party, talking to strangers should not scare you.  \n* Are you capable of memorizing things like car features and available colors?  While you do not need to be an expert and know the torque setting of the nuts on the rear differential, you will be expected to have a general knowledge of available features on your brand's vehicles as well as things like available colors, interiors and the like.  \n* Are you able to regularly work long hours?  While later in the career the hours become more manageable, early on you are working all the time, and dinner will often be after 6pm.  \n* Are you able to manage your money?  While making this a career can be financially rewarding, it is inconsistent.  Some months might be $2k and others might be $10k, so you need to be able to save from the good months to survive the bad ones.  ",
        "num_comments": 88,
        "comments": [
            "Shit. I'm at the 5+ year mark and I still wonder if I want to become a salesperson 🤣",
            "This is a hell of a breakdown. As a member of the 2%. I agree with all of these findings. This should honestly be pinned.",
            "I’m a little over 2 years in now and it’s just now at the point where I’m consistently hitting 10+ cars a month (10 or more is solid at my store, smallish town low volume Toyota pre owned). First year I made $52k, year 2 came out to about $58k, I’m tracking for $70k-$80k this year. I’m realizing how much I still have to learn, but I’m also a lot more confident and comfortable now than I used to be, I ask better questions and get my customers further through the process. I’m also better about not getting in my own head and psyching myself out of sales. Got salesman of the month in February and April, definitely feeling good about my future. I started at 19 and I’ll be 22 this fall, still not sold on making a lifelong career out of the car business but blessed to be where I am right now.",
            "It’s wild to me a GM at a successful store could work less than 45 hours a week. Our GM works the same, if not more hours than us Sales Managers. I suppose for a large corporate store it’s not surprising. I don’t know how they would effectively lead.  GM isn’t the top for us though. Top GMs go corporate so I suppose there’s more incentive there.",
            "As a member of the 2% who got out of the game, please to anyone reading this don’t do it. Getting out was the best thing I ever did for mine and my family’s lives.",
            "13 years here. Over 3500+ transactions. 90% of my business is repeat and referrals. (Now)\n\nHave worked with over 300+ sales people at the same place. 3 stores, etc. most people sold 10 cars a month. I’ve never worked with a single person who averaged over 25, who wasn’t heavily fed or extremely agressive and basically over promised and under delivered everything.\n\nOther than that, the OP covers lots of great points. I never would have told you in HS or college that I’ve be in sales/selling cars. Luckily I know lots of people and have a good reputation.\n\nIgnoring COVID, the average car salesperson in America makes around $22 (really less) an hour….working over 50 hours a week. ($46,000) You have to decide if a 2-4 year slog of $2000-$5000 a month is worth it to you.\n\nIf you want to make it a long term thing you need to figure your market and your competition.  I couldn’t work at a store with minimal traffic, low volume etc, would be too slow paced for me personally.  Without my repeat business, I’d probably sell 8-10 cars a month….after selling for 13 years.",
            "I got out of the industry 6 months ago, and was in for 6 years. Started at 21 in BDC (something I think everyone should have experience in), and made way to Sales. I was in the $140-150k a year group. \n\nAs advice, please be aware not every dealership is the same, your pay, how many you sell, how many hours you work, is all dependent on so many things involving that dealership.\n\nYou can make garbage money at a store you would think has all their shit together, and you can make outstanding money at a place you wouldn’t think you’d ever make a dime at. All of this depends on management, how they run things, how much on marketing they spend, how much experience they have in the industry, etc.. etc..\n\nIt may take you 3-5 dealerships till you find the one that works for what you’re looking for.\n\nI’d recommend everyone try it out at least, sales is such a diverse skill to have which can lead you to many different areas, and you can use it for the rest of your life basically.",
            "Excellent analysis. I’m a green pea in the biz (7 months so far) but have family and friends in the business and the progression is accurate.\n\nWhat I learned as a green pea is to make good money starting out you need to man the station as much as possible, for the chance a customer walks in/ calls to buy. You can be working 50-60 hours just for a customer to walk in. People who aren’t buying this month can waste your time and buy next month or next 2+ months. While complete randoms will walk in and just buy without  driving a car.\n\nAnother thing to note is that typically around 10% or less of your clients will actually buy when starting out. I work in EVs so it is a very niche market. New incentives and ads have increased traffic for us. But for about 70 or so clients I’ve had walk in and call up only 10 purchased this month, with around 4 slotted for next month. The amount of follow up resulting in being ghosted, blocked, no longer interested despite all the work can be infuriating. Get used to customer excuses of “let me think this over” to be the telltale sign of “I can’t afford this vehicle but I want to let you down gently instead/ lead you on instead of being straight forward with you”.\n\nNext thing people need to realize is that a majority of customers are COMPLETE FUCKING MORONS. I tried to give people the benefit of the doubt when I started out, but good god the amount of idiots I deal with daily is fucking astounding. I can go on and on about how people want to be at an ultra low payment with nothing down on a 60k vehicle, or how customers don’t want to pay taxes, or customers with bad credit leading me on, etc.\n\nYou need thick skin to work in car sales. Both your coworkers and customer can be assholes. There is a general mistrust of car salespeople, and those negative stereotypes are warranted. But the amount of asshole, greedy, slimy customers that walk in is just as equal. If you can’t take being backed into a corner during negotiations by a customer, or being yelled and belittled by your boss weekly, don’t work in car sales. \n\nThe paycheck is not consistent, I’ve begun to believe it is mostly just luck now who walks in to buy because I do not have a referral base. And I still don’t have a referral base after working here for 7 months. It’s all fresh ups, and once my clients get what they want they never call up again.\n\nLastly, the market ebs and flows. Right now the market is dookie. Especially for EVs since there are charging fears and the fact that our vehicles are so damn expensive in this current recession. Two years ago used car sales was astronomical and people were trading in like crazy. Now? My job may go bust based on who gets elected in November…\n\nIf you are thinking about doing car sales do your research before joining.",
            "Interesting. I've been selling for 7 years now, and I've been pretty consistent making that $65k. I am not a top performer consistently, I'll admit. I'm average to above average, but I don't show up an hour early and leave an hour late.\n\nI also don't really want to go into management. I kinda like the groove I've figured out, how to get customers to come back for me, and I earn enough. I'm sure I'd do well as a finance or sales manager, I just don't really want to.",
            "Nice write-up. As a 15+ year car guy, I think this is accurate.",
            "Im a green pea right now. im a month in. Hours are brutal. Didn’t make my draw and I ended up selling a sale I had ($1025) for 750 dollars. Im at a Jeep dealer rn but I had a question about the progression.\n\nIf I dont wanna stay at Jeep and go to another store is thay gonna knock me back down in terms of referrals? I know nobody in my family likes Jeep or CDR products and wont recommend them. However something like a Lexus should put me in a nice place down the road to sell to friends and family.\n\nMy question is if I stay here for a year or two gain experience and jump ship to a brand im more interested in would that mess up my progress to getting to doing less work for more money around the 5 year mark?",
            "GSM in the UK are usually on 70-80k a year..\n300-800k is crazy money when you don’t take the cost of living differences into account",
            "Well shit I sell furniture and made 140k last year on 35 hours a week. A luxury dealer wants me and I been debating for a few months now since a couple ppl I know supposedly makes well over 170k doing cars",
            "11 years in. Some stores will promote from sales to sales manager without doing time in F&I. I learned F&I because the finance manager needed me to be able to back him up, especially at the end of the month. When the car has to be delivered today and you're the only one with the impact printer and DMS access, you get the car delivered. \n\nMy path: a few years on the floor, and got offered a sales manager position. I was already doing all of the ordering and dealer trades, and though I wasn't high-volume, my paperwork was consistently good. Went to a store where I was nearly single-point; was doing sales and sales manager duties. Left only because they didn't promote from within, and I'm a portfolio manager, somewhere between BDC and sales/sales manager depending on what we need. Some days I'm taking customers and turning completed deals to finance, sometimes on the phone constantly, sometimes desking and appraising for the sales team. \n\nIf you want to be a sales manager, spend time in finance. Much easier than how I did it. Currently I'm building the time and results I need; if I'm staying with this grind, I want to be a GM.",
            "Three months in.\n\nWe're a pretty low volume store but I'm consistently doing 8-10/month. The low traffic, almost non-existent advertising, and extremely poor lead quality seems to result in many salespeople not lasting more than a month. The only guy doing more than 8-10 a month has been here 20 years.\n\nI'm not making stellar money but I'm comfortable for the first time in my life. We run at just over 50 hours and I'm going to get certified on other brands soon. The Outlander to Krautlander (VW Atlas) pipeline is real.",
            "Great post. One of the last professions you can start at the bottom and work your way to the top. If you commit at the beginning (which most people don’t) it can really pay off, especially with little to no edu.",
            "This is an extremely accurate analysis of the car business. I’m currently half way through year 4 in the business, I was promoted from sales to finance 8 months ago, loving the transition so far.",
            "Although I never worked as a car salesman. \n\nI worked as a lot attendant. It was the best job of my life. \n\nThe car dealership has such an amazing energy and vibe. It's really fun working with car sales people. \n\nI never even thought of it as a job. I went to work; drove cars,  gassed up vehicles, etc \n\nTime is my life",
            "This is extremely accurate. I was on the floor for 6.5 years and did 250 cars my last year. Was just promoted to F&I and honestly kind of miss the floor. Gonna stick to F&I and hope to turn it in to something corporate or maybe a 9-5 that will have better work/life. I was making a little less on the floor but had so much more freedom than in the box. Lol",
            "Left 9 years of factory work building trains, only job I ever had and never been In sales before but was the person my company put in front of big railroad company’s like AMTRAK, NYC transit and Kawasaki.\n\nFigured I’d make the leap into sales and sold 16+ in my first 3 months on the floor. \n\nFor those thinking of making the jump, if you have got a good work ethic I say do it. I’m glad I did!",
            "It’s been great for me. Started out of college at 23. Hit six figures my second year in. At a time my fellow college grads were making 40-50k at their entry level jobs that required a college degree. \n\nKept steady in the 100-150+ range for years. \n\nInto management after 5 years or so. Always made great consistent money but wanted a better work life balance so went took a job as a BDC director for a small group (3 stores). Eventually went to work for a larger group 10ish stores (they did a lot of buy sells). \n\nEventually wanted out of the dealership so went to work for a large software company that provides your DMS and CRM tools among other things. You’ve heard of them  and used them. I’m a senior consultant and travel the country visiting dealerships to support and consult on our solutions. 150k plus a nice daily per diem on the road which means I don’t pay for meals/gas/dry cleaning/haircuts etc. basically $0 comes out of my personal account Monday thru Friday. So my income is all mine. \n\nI’ve been to Alaska, Hawaii, Canada, LA, SF, NY, Miami, Detroit, PA and Dallas.. that’s the last 90 days. \n\nI have status with the airlines which means I usually get bumped to first class or economy plus at a minimum   and get to keep all my miles. When I take the family on vacation we fly first class and go anywhere in the world and it’s absolutely free minus a few bucks per ticket for some fees $10-12. Hotel rewards pay for my hotels and car rental rewards pay for the car we use. I’m now at five weeks vacation so five weeks out of the year I’m flying around the world staying at greta hotels with all the upgrades you could imagine and it costs almost nothing. \n\nI absolutely love my job and I would never have been in a position to have such a cool job and see the country and the world  had it not been for the car business. It’s been wonderful to me and my family. \nHas it always been unicorns and rainbows? No. It’s tough. It can be stressful. You deal with a lot of managers that are absolute scumbags. You’ll get a job at a store and when you get there realize they’re crooks and lairs, the worst the business and IMO humanity has to offer. But the good news is you figure it out on your first day, and go find an ethical store. Then you stay there. Working for the wrong people can make this job a nightmare. \n\nMy best advice is be careful who you go work for, find a good store or group and be a sponge.",
            "***Thanks for posting, /u/justhereforpics1776! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of anything.***\n\nIt seems like more and more people are asking about if car sales is the right career for them.  Below are my observations on the industry and hopefully it helps you make a better decision.  \n\n  \nCar sales can be an extremely rewarding profession with professional growth opportunities and a wide variety of positions.  While this can come with above average pay, it also tends to come with below average benefits, above average hours worked, and inconsistent pay.  Hours and pay will vary by location, store pay plan, and store performance.  \n\nSalesperson Schedule and Pay Progression\n\n* Year 0-3, the first few years at any job tend to be the toughest, car sales is no different.  Many dealer groups offer 0 vacation time to new employees before the 1 year mark.  For the first 2-3 years, Green Peas (new salespeople) will likely work 50-70 hours per week, with many of them skipping their day off to work.  While this is not a requirement, car sales is very much \"get out what you put in\" and you have to be at the store to help customers.  Pay during this time may be all commission or a small base plus commission.  Either way, earnings will likely be <65-80k.  \n*  Year 3-5 is the next step.  The car salesperson should now start seeing repeat and referral business.  This not only means more sales, but also a chance at less work.  Since salespeople at this stage have more business coming in, they may start to work less and see the occasional 45 hour week.  Most weeks will be in the 50 hour range with some hitting 60.  At this stage, earnings will likely be in the <$90k range for the above average performer and <$130k for the great ones.  At most stores this is the point where someone may begin to be considered for a promotion.  \n*  Year 5+ is relatively steady.  The salesperson now has an established book of business with a strong sales base from repeat and referral business.  This will get better and better over time, but now is when the real difference starts to show.  People that are still in the business at this point will forever be able to make a career out of it.  At this point, the hours are much better with the occasional <40hr week with most weeks in the 45-50hr range.  While income is relatively unchanged, a new tier starts to emerge at >$150k.  While not at every store, they exist with some breaking $200k+.\n\nSalesperson Income Breakdown\n\n* 50% of sales people in the industry make <$65k.  This will not be their career and they will be on the chopping block if cuts need to be made.\n* 30% make <$90k.  These people can make a career out of car sales and will always have a job.\n* 18% make <$130k.  These people are above average performers and often the top salesperson at their store.\n* 2% make >$150k.  While not at every store, these salespeople have mastered the job.  They have great repeat and referral business.  They also tend to be more autonomous, closing their own deals and working as needed.  \n\nCar Sales Career Progression Track\n\nCareer growth at most stores follows a similar path with the majority of promotions coming from within.  It is rare that a store hires someone from another store and promotes them, the main exception to this is the jump to GSM and GM.\n\n* 3-5 years as a consistent high performer and a promotion to F&I becomes a real option.  F&I handle all of the paperwork and financing, they no longer have to go on test drives, but they are still selling in one form or another.  They tend to work long hours since they are the final touchpoint for a customer.  Depending on the store set up, this could mean 50-60 hour weeks.  Pay can range from $100k-$200k+.  \n* 2-4 years as a strong performer in F&I and a promotion to Sales Manager becomes and option (some stores will break off here with the option of a Used Car Manager, or Commercial/Fleet Manager).  Much like F&I the managers need to be present and will often work over 50 hours.  Pay can range from $120k-$250k+  \n* 2-6 years as a strong Sales Manager and promotion to GSM becomes an option.  At this stage you are leading the entire sales department, at many stores they may also be a floor manager that desks deals.  They likely work <50 hours a week unless they are filling in for someone.  Pay can range from $200k to over $400k.  \n* 4-6 years as a strong GSM and promotion to GM becomes an option.  This is the top position at most stores (save the occasional dealer principal/owner that also works).  They are experts at selling cars and usually have over a decade of strong performance in every position.  They can fill in any gaps as needed.  At some stores they may have also done some stints in Parts & Service just to experience them.  They usually work <45 hours a week.  Pay can range from $300k to $800k+\n\nIs Car Sales Right For You?\n\n* Do you enjoy talking to people?, While you do not need to be the life of the party, talking to strangers should not scare you.  \n* Are you capable of memorizing things like car features and available colors?  While you do not need to be an expert and know the torque setting of the nuts on the rear differential, you will be expected to have a general knowledge of available features on your brand's vehicles as well as things like available colors, interiors and the like.  \n* Are you able to regularly work long hours?  While later in the career the hours become more manageable, early on you are working all the time, and dinner will often be after 6pm.  \n* Are you able to manage your money?  While making this a career can be financially rewarding, it is inconsistent.  Some months might be $2k and others might be $10k, so you need to be able to save from the good months to survive the bad ones.  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*",
            "1.5 years and I’m selling over 25 cars a month consistently. Still haven’t broken the $65K ceiling. Other careers that don’t have me busting my ass for 50 hours a week and actually have job/pay stability are looking increasingly tempting.",
            "Please review our most [Frequently Asked Questions](/r/askcarsales/wiki/index) to see if your question has already been answered.\n\nYou may find these sections particularly useful;\n\n* [How to pick a car?](/r/askcarsales/wiki/vehicle_selection) You might also have luck in the /r/whatcarshouldibuy subreddit. \n\nAlso remember to add flair to your post by clicking the \"Flair\" link beneath it. This lets us know where you're located so we can assist you better.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*",
            "Well, surprise, you are one at this stage.",
            "7 years, and now Finance Director. Still not sure I want to do it either.",
            "Do you feel you could be a top 2% man if you moved across the country and started a brand new dealer? How many sales do you think you could get in the first 3 months?",
            "This kinda blew my mind…I hit $105k my first year and thought that was average….i guess my store is just full of rock stars 🤷",
            "IMO Because a good leader should have developed a good team and trust them to do their jobs. Both of the stores that I have been have been top stores for their brand. And at both it was rare to see the GM more than 45-50hrs a week. They handled the big picture stuff and dealt with the fires, but unless someone was out sick or on vacation, they don’t need to be there all the time.",
            "My current gm works less than anyone else by far. Previous gm worked a lot more.",
            "Yeah when everyone I hired is working I’m sub 40hrs\n\nBut when any player in any position is out I’m filling in the desk, finance, dispatcher or service manager all the same.  But rare these days great team and great store",
            "This is definitely going to be different based on dealership. Some are individually owned, others are corporate (like mine) and the GM where I’m at fluctuates based on the needs of the team.",
            "As a 2%er, I think an alternative answer is to use your status to your advantage. I know plenty of top performers that have pretty good schedules, or transition to roles that do. I work M-F 8 or 9am to 4/5/6pm depending on the day.",
            "Funny you say it may take 3-5 dealerships till you find the one that works. I had a interview with a top 5 dealer group in the nation. The store hired a new GM who moved from states over. Guy had the audacity to grill me about not staying at a single store for a extended amount of time in the last 5 years. If I went in detail about how and why I left my two previous stores I know for a fact the guy wouldn't have believed me. A lot of guys in this business really believe their path is THE path and it just is not the case.",
            "What is good and bad Pay will also be massively affected by location.  \n  \n*Making 9k a month in a place like [Dayton Ohio where the average home costs $138,927](https://www.zillow.com/home-values/31184/dayton-oh/) is much different than making 9k a month in [San Francisco where they average $1,236,502](https://www.zillow.com/home-values/20330/san-francisco-ca/).  \n  \nFun Fact: Ignoring the difference in tax rates between the cities and Californias insurance rates, assuming $0 down that is a average mortgage of $997.21 in Dayton and $8,875.55 in SF at the average mortgage rate of 7.77.\n\n* Numbers may be slightly off this is a copy paste of a comment I made a month ago.",
            "No offense meant but if that was my outlook, I’d consider getting out of car sales. Imagine putting 7 years in with another career path, you’d be making well over 65k by now working 40 hour weeks with good benefits. Like I’d go be a teacher at that point. I feel like car sales ain’t worth getting out of bed for less than 90k per year minimum and requires you to have the drive to constantly achieve more.",
            "Very rarely do I see complacent sales person at the $65K/year level... with 2 kids and a SAHM, with no desire to move up... $65,000. year which is only $1,250/week, $31.25/hr, that's only $0.52 / minute.",
            "I used to be in furniture but left the industry in 2008 due to the economic downturn. It’s nice to see it’s improved again.",
            "Something is off with that. At 250 cars a year, you should easily be hitting $100k if not more",
            "You gotta head somewhere else. I made $65k last year on 94 cars.",
            "Your dealer is railing you",
            "Jokes aside, I love this job. Sure there are ups and downs but I can't see myself doing anything else. Well written post either way; certainly not an industry for everyone.",
            "You know, it's funny. I've been told numerous times they want me off the floor. I've been number one the vast majority of the time at this store and I think they'd rather just keep me on the floor. I'm happy with the way things are so for now it is what it is.",
            "Been it in for 15+ years from sales to aftersales to GM, mostly for a public group. Still pretty sure it’s not what I should do. \n\nDoing what you’re good at and what you do being good for you are completely different things.",
            "No way. \n\nI’ve known very strong sellers that moved stores. While they quickly caught up to $100k, it still took them over a year to start creeping back up to $150k+. \n\nWhen you move more than 1hr away you lost a substantial amount of repeat business, you just aren’t convenient. And as you increase the distance it gets worse. Because even offering free home delivery becomes tough. \n\nI made the move across the country. Pretty much started at square 1. Sure enough a year into I’m getting back into my stride.",
            "Probably not. I think every situation depends on traffic, pay plan and up system. To get to the top 2%, you generally need a client base/book already to some degree.\n\nIt’s more practical to believe in switching location that youd still possess a self running/motivated skill set. And therefore would likely fall into above 100k… possibly 130k. But that would likely be the max range. As you wouldn’t have the client base in that market.",
            "I suppose when I think about it he’s there 8-5 generally so that’s about right. No need to be longer. Just feels longer I suppose",
            "[deleted]",
            "My gm works like 40 hours a week, he has good people under him and is always there when needed.",
            "Store better be making a lot of money 😬",
            "Man thankfully I got an offer from someone with a car biz background who empathized with me. I make the same or more now than I did in the car business by working 35-40 hours / week, with half of them being at home and none of them being on weekends or holidays. Plus a truck and gas card for when I do have to run around to job sites. As far as I’m concerned, I hit the jackpot and I can’t imagine going back to car sales in any capacity.",
            "As a customer with no interest in being a car salesmen.  Wouldn't evening and weekends be prime time you would want to be out on the floor? \n\nI get it may not be necessary if you get repeat/referral business that want to work with you specifically, but it feels like you might be missing out on even more income.",
            "Yeah exactly, weave through the bullshit constantly with people at dealers.",
            "Absolutely. I'm able to support a family, we have 2 kids, and my wife stays at home. I know there are some sales people in my dealer group making 2x what I do. My store cannot offer enough sales to do that, however.",
            "$31/hr is quite a bit better than most jobs in this area, baring the oil fields.\n\nI do try and get sales, I just don't kill myself doing so.",
            "Tbh it's pretty slow but I'm just lucky to have referrals",
            "50K base + Bonus (about 1K/mo)",
            "No kidding. This corporate subprime chain sucks and treats us like dirt.",
            "I’m well aware.",
            "It feels like he’s there longwr cause you sit up straight when you’re in his line of sight 😂",
            "I tried to avoid too many tangent.  I considered going deeper down the Used Car and Fleet/Commercial side but decided against it.  \n\n  \nA lot more stores are starting to do cradle to grave, there are pros and cons of it.  \n\n  \nCongrats on your own shingle.  Do you have a specialty or just general used?",
            "What is this magical job? Now I'm curious",
            "Evenings are not great. Everyone is tired from work and in a rush to eat. \n\nWeekends can be good. But likewise you also see a lot of families doing their weekend activity. \n\nAs a side note, I work fleet, so very much a 7am-3pm type of customer. With the occasional later day",
            "Complacency...",
            "Oh, gross.  Go work at a commission store.  Salary stores are dog shit for making money.",
            "Good breakdown, as you know the Fleet/Commercial side totally different animal, celebrating 26 years at my Chevy store as Fleet Manager May 1st.",
            "[deleted]",
            "Sounds like a project manager for a construction company",
            "Sales rep for a luxury outdoor living provider. Pools, pergolas, patios, pavers, lights, kitchens, artificial turf, etc.",
            "Sorry, had to wrap up the month with another sale. Finished the month at 10, 2nd in our store of 5 salespeople. (We don't need 5, but I can't help that..)\n\nMy manager doesn't think I'm complacent. So, I'll go with that opinion.",
            "Yeah, especially with how good I am at this, I should. I really prize regular hours though, so I’m planning an exit from the industry. I’m not a money-focused go-getter as much as I need to be to go far in this industry.",
            "Oh 100%. I’m on my second year in it and I’ll never go back. Our department director just hit 36yrs total in Fleet. \n\n26yrs at one store is nuts",
            "Selling the same car multiple times must be nice haha.",
            "Yeah it's one of those hidden secrets in the car biz if the dealer is into fleet, guy I replaced worked here for 42 years!!!"
        ]
    },
    "Get out of loan for “totaled” car that still has ~$10k left": {
        "title": "Get out of loan for “totaled” car that still has ~$10k left",
        "score": 47,
        "url": "https://www.reddit.com/r/askcarsales/comments/1dlanvg/get_out_of_loan_for_totaled_car_that_still_has/",
        "content": "I feel like this situation is more common than it seems and can be answered easily, I just don’t know the right place to start. \n\n2018 Ford Escape, 1.5L Ecoboost\nFinanced for $18k in Nov 2021 (rough used car market, needed something bigger for new baby and doggos) at 6% APR, with 80k miles. \n\nThis car was designed by a sadistic psychopath because every aspect of maintenance is a disaster, then the transmission blows in summer 2023. Directly after we got back from a vacation. Ya know… where we had loose, usable money set aside for a purpose that would have been repurposed for this. But nah, she betrayed us perfectly. \n\nMechanic friend saves our life by offering to drive to pick up the 200+lbs junked transmission and wastes a four-day weekend doing the majority of the work replacing it while I watched and was the Get Me Uh guy. That guy’s awesome. We have a vehicle again, and it cost around $3k total to fix. \n\nUh oh, during the replacement we saw that there was mechanic clay marker writing on the broken trans just like the junked trans… Fresh transmissions from manufacturer don’t have all that writing on them. So is this the 3rd trans to be in this vehicle? \n\nAll that’s besides the point because the shit blows up again Jan 2024. No fuckin oil and the engine seized up because of a brand new leak we didn’t know about. Thing is sitting on the curb where it was towed to this day, hence the “totaled” in the title. I know this doesn’t mean it’s literally totaled until an inspector or whatever checks it out. \n\nNow we have a new vehicle (much cheaper, irrelevant to this debacle) so we’re paying two loan payments and two insurance payments for one functional vehicle. Is there something I can do with the bank for the Ford to get out of having to pay full-coverage insurance on a vehicle that doesn’t move? We’re happy to continue and just pay off the loan, we’re not gonna get much better than 6% APR, I just don’t want to waste the money on insurance. \n\nAlso, not sure if this is an applicable subreddit but I saw similar posts. Thanks for any advice. ",
        "num_comments": 52,
        "comments": [
            "Have you checked with your insurance company? Mine has an option for non-operational coverage that would still hit the mark for what the bank requires. It's much cheaper but if you get in a collision while the car is in that status you're obviously toast.",
            "Yes, the bank will gladly let you out of the mandatory full coverage insurance just as soon they receive a wire for the entire remaining balance.",
            "How much do you owe on the Escape today? 2.5 years of payments means hopefully you brought down that balance to like $10,000 or less?\n\nTake the car to Carmax or a Ford dealership. See what they offer, you might try calling around some dealers so that you aren't towing this thing all over town. Get a personal loan for the difference. So if you owe $12,000 and someone offers you $4,000 then you need an $8,000 personal loan. APR is irrelevant because you're going to free up the car payment and insurance payment, plus no maintenance, repairs, or registration. You're going to lean into paying off the personal loan within a year. And you didn't notice the pool of oil on the ground, you never checked your oil, the oil warning light never went off?",
            "Please review our most [Frequently Asked Questions](/r/askcarsales/wiki/index) to see if your question has already been answered.\n\nYou may find these sections particularly useful;\n\n* [Will paying in cash or a large cash down payment offer me leverage in negotiations?](/r/askcarsales/wiki/cash_down)\n* [I earn $xxxx per month, will I qualify for an auto loan or lease, and is it a good idea?](/r/askcarsales/wiki/income_to_finance)\n* [I have my score from Credit Karma but the dealership told me they got a different score. Why?](/r/askcarsales/wiki/free_credit_score)\n* [Finance FAQ's](/r/askcarsales/wiki/financing_faqs)\n* [Buy versus Lease](/r/askcarsales/wiki/buy_vs_lease)\n* [How to pick a car?](/r/askcarsales/wiki/vehicle_selection) You might also have luck in the /r/whatcarshouldibuy subreddit. \n\nAlso remember to add flair to your post by clicking the \"Flair\" link beneath it. This lets us know where you're located so we can assist you better.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*",
            "***Thanks for posting, /u/AwarenessMinimum2932! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of anything.***\n\nI feel like this situation is more common than it seems and can be answered easily, I just don’t know the right place to start. \n\n2018 Ford Escape, 1.5L Ecoboost\nFinanced for $18k in Nov 2021 (rough used car market, needed something bigger for new baby and doggos) at 6% APR, with 80k miles. \n\nThis car was designed by a sadistic psychopath because every aspect of maintenance is a disaster, then the transmission blows in summer 2023. Directly after we got back from a vacation. Ya know… where we had loose, usable money set aside for a purpose that would have been repurposed for this. But nah, she betrayed us perfectly. \n\nMechanic friend saves our life by offering to drive to pick up the 200+lbs junked transmission and wastes a four-day weekend doing the majority of the work replacing it while I watched and was the Get Me Uh guy. That guy’s awesome. We have a vehicle again, and it cost around $3k total to fix. \n\nUh oh, during the replacement we saw that there was mechanic clay marker writing on the broken trans just like the junked trans… Fresh transmissions from manufacturer don’t have all that writing on them. So is this the 3rd trans to be in this vehicle? \n\nAll that’s besides the point because the shit blows up again Jan 2024. No fuckin oil and the engine seized up because of a brand new leak we didn’t know about. Thing is sitting on the curb where it was towed to this day, hence the “totaled” in the title. I know this doesn’t mean it’s literally totaled until an inspector or whatever checks it out. \n\nNow we have a new vehicle (much cheaper, irrelevant to this debacle) so we’re paying two loan payments and two insurance payments for one functional vehicle. Is there something I can do with the bank for the Ford to get out of having to pay full-coverage insurance on a vehicle that doesn’t move? We’re happy to continue and just pay off the loan, we’re not gonna get much better than 6% APR, I just don’t want to waste the money on insurance. \n\nAlso, not sure if this is an applicable subreddit but I saw similar posts. Thanks for any advice. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*",
            "Yes - \"storage insurance\". It is pretty cheap.",
            "I just showed this to a guy I’m closing a deal on to sell GAP!",
            "Most insurance companies have comp only \"storage\" coverage but most lenders will force place insurance if a vehicle with a loan doesn't have full coverage.",
            "Option if you are able: lease a vehicle with a good amount down and wrap the debt of your junk car in the lease.  At the end of the lease you will be out.  Not all leases will be able to hold 10k over, but some will or if you have 4-7k to put down you can hopefully get it approved.",
            "May actually be able to tell the insurance company the vehicle is in storage and it drops. That’s what we did in the military for deployments",
            "[removed]",
            "Blown engine it isn’t going far",
            "\"Nah.. I'm a safe driver. \"\n\n\n3 months later.\n\n\n Can I get the  # for that Gap coverage that was offered to me when I was buying.  \n\n\nSure thing. however you declined the coverage, because you are a safe driver. \nSales equivalent of car just got sold. ",
            "GAP doesn't usually cover mechanical failure, does it?",
            "Some lenders allow storage approval for deployed military, plenty dont.  \n\nEven with storage approval the vast majority of lenders require Other than collision/Comprehensive (name varies by state).  \n  \nMy entire job is Collateral Protection Insurance. Military folks are honestly one of the easier parts since the lenders are much more lenient lol.",
            "Military is completely different than someone can’t afford to pay the premium.",
            "More than likely still be underwater, and no GAP insurance.",
            "Please do not recommend illegal behavior, even in jest.",
            "Let’s be very careful about advising people to commit felony insurance fraud.",
            "That’s why I said tow.",
            "No, auto insurance doesn't cover mechanic failure.",
            "GAP covers if the insurance company totals the vehicle out though. Regardless my guy also bought a 36/36000 VSC too.  😉",
            "Are you saying like the lender would allow for liability only or something? \n\nI meant more on the insurance side, like if your mileage per year was zero and vehicle listed as in storage maybe the insurance premium could drop $100 a month or something",
            "Completely fair point. Still though, I think OP parking the totaled vehicle in the garage and telling the insurance it isn’t being driven at all and is locked up in storage, that there could *potentially* be a reduction in premium from the insurer\n\nJust think it’s at least worth asking",
            "Gets em closer to the goal at least - less to payoff but that still requires the vehicle to catch fire and to be honest, it’s a common issue with these vehicles lol 😂",
            "Got it - deleted",
            "Now now - nobody is telling anyone to do such actions! I was simply stating IF that happened",
            "Your flair says “non-sales, solid advice”, but think that they’re going to get anything more than scrap value for a vehicle being towed into a dealership for a curb buy.",
            "The cost to tow that car will be more than its value.",
            "You can add it on some policies in some cases, but I was thinking of GAP.",
            "Storage approval depends on the lenders.  \n  \nBut generally storage approval always requires Comprehensive/Other Than Collision (the name for this coverage changes per state).  \n  \nAny easy example is Snowmobiles. Lenders tend to allow you to carry Comprehensive only from like April 1st to November 1st since the vehicle will not be used. They still want comprehensive in case the garage burns down, but since its not been used it can have collision removed. You do need to sign a form saying \"i promise i wont use my snowmobile in the middle of summer\" though.  \n  \nSome lenders have automatic periods where Collateral Protection Insurance (The banks insurance) will not be applied from the months of X-Y if there is no collision on the vehicle even though per your contract you must have comprehensive and collision coverage.  \n  \nMost however require you to call the bank and say \"hey my vehicle wont be used due to the weather or its in the shop or whatever can i put it on \"storage\" insurance\" (which is what most insurance companies call comprehensive but no collision coverage). Then a manager at the lender will sign the approval and forward it to the loan department saying \"Hey dont force place insurance as long as they have storage approval and comprehensive coverage from X day to Y day\".  \n  \nA lot of people don't realize that insurance companies talk to leinholders (lender) and will send them a notice if coverage is changed/removed if you have a leinholder/loss payee listed on the policy (which the majority of loans require).",
            "You don't even tow a scrap vehicle to a dealership unless you plan to buy from them. They don't want your non functional problem. Even then, its not something you want to do without talking to them first.",
            "That too.",
            "Mayyyyybe if they're buying something from the dealer/carmax they will get some sympathy credit and get $1k value at most, otherwise it's 1(800)KARS4KIDS lol",
            "In my experience, dealerships will offer significantly over scrap for something new enough to put on their lot after repairs",
            "What are you talking about? It’s a 6 year old Escape that will probably sell for $15k. Even factoring in an engine plus a safety cushion, they will give OP more than nothing.",
            "GAP definitely does not.",
            "Oh wow that’s really good info thanks for spending the time to explain it!!",
            "Excellent insight!",
            "What you can potentially sell it for is completely irrelevant to what it's value is right now."
        ]
    },
    "Salesman won't disclose the capitalized cost of a lease": {
        "title": "Salesman won't disclose the capitalized cost of a lease",
        "score": 11,
        "url": "https://www.reddit.com/r/askcarsales/comments/1dlkmhj/salesman_wont_disclose_the_capitalized_cost_of_a/",
        "content": "Chevy dealership on Long Island. The salesman refuses to disclose what the capitalized cost is for the vehicle and will only negotiate based on monthly payments and down payment. He said until we do the deal at the desk level he won't disclose how they've valued the car. Is this normal? ",
        "num_comments": 23,
        "comments": [
            "That doesn’t make much sense considering negotiating the monthly payment is at the “desk level”. If a salesperson is refusing to tell you the cap cost and/or breakdown, I would probably just go elsewhere.",
            "Seems kinda odd, and would be concerning if you were buying the vehicle. \n\n\nBut since you're leasing if the monthly payment and down payment are the amounts you want does the cap cost *really* matter? ",
            "If he refuses, leave.  That’s all there is to it.",
            "Half my salespeople don't even know what a capitalized cost is.",
            "Smell ya later",
            "Please review our most [Frequently Asked Questions](/r/askcarsales/wiki/index) to see if your question has already been answered.\n\nYou may find these sections particularly useful;\n\n* [I earn $xxxx per month, will I qualify for an auto loan or lease, and is it a good idea?](/r/askcarsales/wiki/income_to_finance)\n* [I have my score from Credit Karma but the dealership told me they got a different score. Why?](/r/askcarsales/wiki/free_credit_score)\n* [I want to get out of my leased vehicle, what are my options?](/r/askcarsales/wiki/early_lease_termination)\n* [Leasing a vehicle with a down payment – is it a good idea?](/r/askcarsales/wiki/lease_down_payment)\n* [I want to buy out my lease, what are my options? What can I negotiate?](/r/askcarsales/wiki/lease_buyout)\n* [How to calculate a lease yourself](/r/askcarsales/wiki/calculate_a_lease)\n* [How to pick a car?](/r/askcarsales/wiki/vehicle_selection) You might also have luck in the /r/whatcarshouldibuy subreddit. \n\n   Also remember to add flair to your post by clicking the \"Flair\" link beneath it. This lets us know where you're located so we can assist you better.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*",
            "***Thanks for posting, /u/RTMAL11! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of anything.***\n\nChevy dealership on Long Island. The salesman refuses to disclose what the capitalized cost is for the vehicle and will only negotiate based on monthly payments and down payment. He said until we do the deal at the desk level he won't disclose how they've valued the car. Is this normal? \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*",
            "Well leasing is all about the monthly payment.",
            "I hear you but, but the salesmen was telling me I qualified for all of these incentives that took, say $5k off. But off WHAT? If I qualify for the incentives, negotiate the price of the car and then let the manufacturer deal with the incentives they are offering the dealerships. It's odd to say \"you got off $5k\" but then refuse to tell me what it's off OF.",
            "Lol dealers love using this line when showing a pencil with a *low $200 payment only $5000 DAS*",
            "I don't know why you were down voted. Leasing is solely for getting the lower payment. It's quite literally one of the least financially long term routes to ownership. The only things that matter in the lease is 'what is my payment' and 'what is the payoff at the end'.",
            "The comment you’re responding too does make sense but at the same time, it’s so easy to get the cap cost number they should just give it to you.",
            "They're trying to play games.\n\nI have had dealers refuse to give me the cap cost being used in the deal. I've just gone elsewhere(this is why I don't negotiate at the dealership)\n\nI had one dealer tell me one time it was IMPOSSIBLE to tell me the cap cost before signing. Lol I asked how they were getting these figures then...",
            "Yeah he’s shady.",
            "I'd find a different dealer. Not sharing the actual price of the car is just shady, no excuse for it.",
            "What is the vehicle? It’s a lease the only thing that matters is the payment",
            " >It's quite literally one of the least financially long term routes to ownership.\n\n\nIt’s quite literally what? This comment doesn’t make sense.",
            "I'm in powersports, we don't have leases. I've never done a lease myself. Aren't they just monthly payments with a pre-planned trade in or buy out amount once lease is up? Or am I misunderstanding them? I've never really looked at them so I'm clueless.",
            "It makes plenty of sense. If you lease the car then buy it out after, you pay significantly more in the total cost of ownership. You don't lease if you are trying to make every penny count. OP analyzing the numbers as if they are trying to be frugal, but realistically the best they can hope for is the cheapest payment. They are going to pay a lot more in interest on top of leasing fees they've already paid if they buy it out after.",
            "I mean yeah, but the car very well could be worth mote than the residual at the end"
        ]
    },
    "What do we think the long term implications will be if CDK is down for weeks to months? ": {
        "title": "What do we think the long term implications will be if CDK is down for weeks to months? ",
        "score": 1,
        "url": "https://www.reddit.com/r/askcarsales/comments/1dlw1mf/what_do_we_think_the_long_term_implications_will/",
        "content": "The dealerships I visited in MA this week all use CDK. I signed and put a deposit down on a new car but can’t finalize or drive it off the lot until systems are back up. I still have my trade in to drive so it’s not the end of the world. \n\nWhat I’m more curious about are the implications of CDK being down weeks to months longer. How will dealerships that are reliant on CDK pivot to finalize sales? I’m assuming sales, service, and finance are in a plan for the worst hope for the best situation right now. Are you having conversations internally about bringing on supplementary services in the interim? \n",
        "num_comments": 2,
        "comments": [
            "Please review our most [Frequently Asked Questions](/r/askcarsales/wiki/index) to see if your question has already been answered.\n\nYou may find these sections particularly useful;\n\n* [How to pick a car?](/r/askcarsales/wiki/vehicle_selection) You might also have luck in the /r/whatcarshouldibuy subreddit. \n\nAlso remember to add flair to your post by clicking the \"Flair\" link beneath it. This lets us know where you're located so we can assist you better.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*",
            "***Thanks for posting, /u/RattyHealy75! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of anything.***\n\nThe dealerships I visited in MA this week all use CDK. I signed and put a deposit down on a new car but can’t finalize or drive it off the lot until systems are back up. I still have my trade in to drive so it’s not the end of the world. \n\nWhat I’m more curious about are the implications of CDK being down weeks to months longer. How will dealerships that are reliant on CDK pivot to finalize sales? I’m assuming sales, service, and finance are in a plan for the worst hope for the best situation right now. Are you having conversations internally about bringing on supplementary services in the interim? \n\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askcarsales) if you have any questions or concerns.*"
        ]
    }
}