{
    "faq, wiki, trolls and you.": {
        "title": "faq, wiki, trolls and you.",
        "score": 774,
        "url": "https://www.reddit.com/r/askgaybros/comments/654b8k/faq_wiki_trolls_and_you/",
        "content": "one of the most requested features i've seen is a frequently asked questions section, and we've always had one. it's within the [wiki tab](https://www.reddit.com/r/askgaybros/wiki/) located at the top menu if you're browsing on desktop. [here's the direct link to it](https://www.reddit.com/r/askgaybros/wiki/faq), but since it's a wiki feel free to check out the other sections and please contribute.\n\nwith that out of the way, a couple things i want to clear up in case anyone is wondering:\n\n- i do not mind repeated questions. the whole point of this subreddit is to talk to people. if it's not entertaining you anymore, maybe browse it less. no, i will not sticky every other psa post.\n- i do utilize automod extensively and it helps with a lot of troll post removal behind the scene. so if you see a troll post, continue to  downvote, report, and move on, and **do not engage**. the majority of you get this, and it's been working out quite well.\n- [the rules](https://www.reddit.com/r/askgaybros/about/rules/) haven't changed, but make sure you're aware of them.\n\nhave fun.",
        "num_comments": 158,
        "comments": [
            "I read Fag wiki >.<",
            "This sub is toxic as fuck and is poorly moderated. ",
            "TL;DR have fun ;) ",
            "This is how most subs should be moderated. I rather be overwhelmed by repeated posts and troll posts than having rules stuffed down my throat and tons of restrictions. \n\nDefault subs with like over a few hundred thousand ok I understand. ",
            "love how the first five relationship questions are about straight guys ",
            "This sub is toxic. I'm out.",
            "Maybe someone can answer this for me, I’m just a random person breezing through while bored, but what’s the painting on the banner and who’s in the sun icon?",
            "> the majority of you get this, and it's been working out quite well.\n\nNot anymore, this clearly needs boosted for newer people here.",
            "Hi - How many Karma points do I need to create a post? been a member over 2 weeks and now over 100 Karma points - and still they keep getting automatically rejected!",
            "I like you and I think you are a good mood.",
            "This subreddit could be fun, entertaining and educational if it weren’t for the trolls. I answered a question today with an honest, heartfelt response and was attacked by three trolls within the hour.  One blasted me three times with his nonsense. I don’t need this so I’ll be leaving.  It’s a shame that people have nothing better to do than spread their hate.",
            "Some one wanna ft and jerk off",
            "How do we get xoxobunny_ banned?",
            "Looking to give an award to someone but cannot figure out how the thing works….",
            "It's hard to not engage when the majority of the subreddit is troll posts",
            "Hey guys I'm trying to ask a question but my post is being removed, as far as I can tell I'm not breaking the rules; maybe because my account is brand new?",
            "https://t.me/joinchat/HLH3yJrbAwA4N2Ex",
            "Yeah",
            "Add me on Snapchat archiebooth2021",
            "got it！",
            "Why would a guy from Grindr from Pittsburg KS drive an hour and half, look at my house in the vehicle from the street for about a minute, then go down the street to turn around with lights off, the drive passed with my house and I check Grindr saying he is 200+ feet away from, then ask if he was he and said no, which was a lie, then go incognito on Grindr? Does anyone know what that was all about?",
            "Your automod is broken, I can't post anything because one of my post had one downvote",
            "Where u basedd today",
            "23, vers delhite here.",
            "Can we talk about PNP? As SWIM was wondering?",
            "why do you refuse to recruit mods we have 40k people on here just you isnt enough",
            "/u/ydntucmonovrvalkyrie when you leave reddit or your account is suspended, what is going to happen to this subreddit?",
            ">it's been working quite well\n\nHa. ",
            "Why wont you guys let me post",
            "I'd like to ask aquestionto guys more experienced than me",
            "lol I misread that first word haha",
            "omg talk about toxic comments wow.",
            "Thank you for clarifying the FAQ and wiki info! It's great to know that repeated questions are welcome here, as the conversation is what makes this subreddit so enjoyable. And kudos to the automod for keeping those pesky trolls at bay. Let's keep this community positive and engaging. Cheers to more fun discussions ahead!",
            "Im so bored",
            "[deleted]",
            "A...and...AND ME!!!! :D",
            "I just called..\n\nto say....\n\nI love you :) \n\nThanks dude.",
            "I want suck more dick",
            "Huh",
            "Hi",
            "Hugs",
            "Uh",
            "Im so lost how it works",
            "how to post stuff? I cannot seem to be able to post something without it being instantly removed?",
            "M",
            "Shame this sub doesn't have a discord.",
            "Since it's a small question i'll just ask it here. Do homosexuals also have armpit and feet fetishists?",
            "u/ydntucmonovrvalkyrie or any1 else: I keep asking, fruitlessly: how does.one ask/post a question? Or, maybe here, I ought to use the term: 'query'?",
            "Has anyone tried to be scammed by a fake profile asking you to join Google hangouts? Like as soon as I hear someone say Hangouts I immediately think of scam",
            "+57 317 3790756 text me, I am lonely and can be a friend to talk and begin know deeply",
            "Hey I need some advice but I'm in a talking stage with someone would appreciate the help if you need the long stry dm",
            "It kinda is, at this point.",
            "Still true 5  years later and I’m leaving.  I didn’t come here for this. Especially If you’re black and queer. This ain’t the space for you.  Know thaT.",
            "Yes it’s pathetic that there is so much racism on this sub for one thing. There’s many other issues though",
            "[deleted]",
            "I spent all night typing a guide about fitness in response to some questions I saw here and the mods deleted it. It got 100% upvotes and people in the replies are puzzled as to why it was deleted because it was a really thorough guide on dieting and workout routines. \"Self moderated\" and \"minimal moderation\" my ass. Fuck this, unsubbed",
            "6 years later, just commenting to say not a single thing has changed. I've never seen such a collection of insecure, self-loathing, stiflingly heteronormative, damaged and angry little boys in my life. I only check it the same way you watch a train wreck.",
            "exactlyyyy it’s even worse when you’re a trans dude",
            "This subreddit isn't fun. Everyone here attacks you just for having a different opinion than them. All I did was ask questions and now everyone here hates me.",
            "> I rather be overwhelmed by repeated posts and troll posts than having rules stuffed down my throat and tons of restrictions\n\nRepeated posts and troll posts are how a lot of groups on Usenet became completely unusable.",
            "How it should be",
            "Go dye your hair and look for micro-aggressions from the fuckable guys at the gym pecker checker.",
            "don't go on meds ever again :)",
            "The School of Athens by Raphael but dunno whos in the icon.",
            "can you not use google? what is it with homophobic bisexuals expecting gay men to do all hte work?",
            "Hear. Hear.",
            "Sure I will",
            "Why what did he do?",
            "I’m trying to figure out the grammatical mistakes so it makes sense.",
            "🎃",
            "wait is there literally only one mod?",
            "because then it'd be like quite literally any other subreddit and i'd rather you go there.",
            "Get ready for all the \"Nyah!!! its not a safe space!! We dont need mods!! moo!!!\"",
            "it will become modless until someone successfully claims it over at /r/redditrequest. i will try to  not let that happen before appointing another mod though.",
            "Why would his account become suspended?",
            "https://i.ytimg.com/vi/36xGGXfezX8/hqdefault.jpg",
            "Which doyou find more pleasurable : a blow job or a rim job?  I guess both at the same time would be over the top. Ykes !",
            "illegal sex with aliens",
            "kisses",
            "Still no answer(s). :-(",
            "We need talk a about PREP when I went to a out patient clinic the nurse ask  what medicine I was on ad I told her PREP I kid you not I had tell  her what it was an how to spell it!!!!!!!",
            "How do people know you're Black?",
            "And not a little agism.",
            "I prefer subs that aren't blatantly transphobic, but this still appeared on my dash",
            "Did you save a copy of it?",
            "They need a place, like everyone else. Not all flowers bloom in sunlight.",
            "Glad to see some people here noticing this too. Sometimes theres interesting threads and questions here but holy fuck there's SO many insecure, pick-me, conservative-esque gays here hating on everything and everyone. I wish there was a subreddit like this but just more moderated.",
            "I am sorry to here that some of my best friends are trans, Hater be gone!!!!!!",
            "I dont hate you.",
            "I am in the same exact boat. Reddit used to be one of the most tightly regulated places online when it came to civil discourse, almost like the total opposite of the YouTube comments section. It seems this is no longer the case for whatever reason.",
            "yeaaa there’s also a lot of transphobia too",
            "Just say hater be gone and live you best life thats  revenge to all the homophobic butt holes out there",
            "Don’t worry, they all hate me too for having a different opinion. You can only have a different opinion on this sub as long as it’s differently different in the same way others post different opinions. At this point, it’s a lot of hate geared towards you for not having “group think.” Especially on social issues.",
            "No one is more hated on this subreddit than me",
            "lol... thanks for proving my point",
            "I don’t rlly know how I’m supposed to google a painting with no context? If u didn’t wanna answer the question just ignore it lol, I’m also not bisexual",
            "Girl! Lighten up. Claiming a user is homophobic because you don't like what they've posted is fascist behavior. Now, that said, I have learned that you are a Nazi and people should know that about you.",
            "Bisexuals can’t be homophobic. Bisexuality is literally straight and gay co-existing, so if they were homophobic they’d have to have internalized biphobia or something.\n\nBut gay people can be very biphobic. And that’s what I’m seeig here...",
            "A user called xoxo_bunny claimed to be a girl who would refer to all the agb users as her \"puppies\"(eg mommy doesn't like it when her puppies fight) . At some point she deleted her account. \n  \nI think it was most likely a super formal dude letting his wild side annoy users who annoyed his main.",
            "I have no idea, that comment was 4 years ago.",
            "Yes. Maybe he's like The Highlander.",
            "There are approximately eight. Counting them involves scrolling up, so an estimate is all you are getting from me.",
            "Agreed.  But can you please just ban that chick that keeps calling us pups and posting dog pictures as comments, she's fucking awful.",
            "I greatly respect your spine.\n\nRedditors can be our own greatest enemy. We complain about insufficient moderation, then we get more, then we complain about unfair moderation.\n\nSometimes I'm tempted to ask for more too, but let's be honest... This subreddit has seen *very* few complaints about unfair moderation, due to the simple rules that it has.",
            "Hey, just wanted to say thanks!\n\nThere have often been calls for heavier moderation here but I'm glad that you keep this place how it is.",
            "Ha!",
            "At that point, just hand over the sub to [us](/r/gaybroscirclejerk).",
            "I'd like to throw my hat in the ring. ",
            "i'll be sure to request it when that happens.",
            "it's a hypothetical situation",
            "That's rich, coming from you of all people, one of the most bitter, most vitriolic \"people\" on this subreddit.",
            "I mean, we as health professionals don't have every medication ever memorized. And prep in particular is a very rare medication. I've been a paramedic for 5 years and I haven't had a single patient tell me they're on prep or Truvada when I've asked their medications.",
            "Thank you",
            "I don’t either 😊",
            "Oh then in the future please post something more current.",
            "Lol yall are a comedy sketch. It's great",
            "PLEASE THATS SO FUNNY HAHAH",
            "Then let this mod be Duncan MacLeod.",
            "Seconded.",
            "If you don't validate the existence of xir, xe will go away. Mind xeno pronouns, because safe spa Ohhh Snap.\n\nJust don't feed the \"trolls\".",
            "And we will make sure to stop you.",
            "right",
            "[deleted]",
            "This is good to talk about it we need to talk about this in the open and get the world out there that will save a life I I grow up in the 80s ans 90s i saw what AIDS genocide did to gay men.",
            "I don't think any of us hate you.",
            "Everyone is a troll to someone.",
            "Why?",
            "Get the word out there this can save a life.",
            "Absolutely, but healthcare workers are humans and we don't have every new medication memorized"
        ]
    },
    "Husband would rather have chemsex with randoms than have sex with me": {
        "title": "Husband would rather have chemsex with randoms than have sex with me",
        "score": 124,
        "url": "https://www.reddit.com/r/askgaybros/comments/1dln6du/husband_would_rather_have_chemsex_with_randoms/",
        "content": "\nMe (35M) and my husband (34) have been married for 8 years and the sex has completely left the marriage- it seems like he has no interest in me and doesn’t find me attractive anymore- \n\nHis excuse is he’s not horny or has a low sex drive. \n\nHowever he will sleep with virtually anyone else….\n\nI’m getting really sick of it as my sexual needs are completely neglected- \n\nI feel completely taken for granted- and effects my self esteem. \n\nI’ve tried to break up before but he resisted. I feel like my purpose in this marriage is to just pay half the mortage and clean. Nothing else. He constantly pushes me away if I go in for a kiss or a hug. \n\nHe’s assured me he still finds me attractive but he clearly doesn’t- it’s almost the case he’s the only person that doesn’t which makes it worse \n\n ",
        "num_comments": 87,
        "comments": [
            "You don’t need his permission to leave him.",
            "If he is having sex on drugs with random guys, but won't even let you hug him, I don't understand why you are wasting time posting on reddit when you should be filling out divorce papers.",
            "Maybe he does not want to break up bcaz where he will get money for drugs. He does chem sex..? That's the red flag.. He knows you loves him and takes advantage of it. Drugs, in the long run do not go well.",
            "r/deadbedrooms\n\nThe real problem here is the meth.\n\nFortunately, you're still really young. You'll find someone else easily.",
            "Life’s to short ,go solo travel and fall in love again",
            "Time to send him packing. You can at least be grateful he's not giving you whatever diseases he's picking up from other people. You're 100% being taken advantage of and used. Sorry you're going through it",
            "You're going to have to define chemsex for me here because that's completely not addressed in this post. Like what all is he doing with random?\n\n\nChem sex as most people use it, is sex with meth. That shit really realigns your horniness because it gets paired with a dopamine booster. It's subtle and insidious. He may be attracted but just not able to get horny without the right state of mind (meth/coke).",
            "If he does chem sex you need to leave him. He's not worth it",
            "You don't need his consent to divorce him.  All that you need is a good lawyer.",
            "My comment is for those in the comments and not so much for OP\n\nPeople stuck in these dumb abusive toxic relationships and secretly posting on Reddit when they know goddamn well what they need to do\n\nI’m so glad that so many of you out there are compassionate and take the time to write constructive responses because I have no patience for this shit",
            "At some point you have to think about the entirety of your relationship. \n\nDo you laugh together? \n\nDo you have fun together? \n\nAre you able to talk about anything together?\n\nDo you still have a great time in each others company?",
            "I've tried chemsex twice, mostly avoided the meth and 3mm part, only really tried G and poppers. \n\nThose 2 times were absolutely amazing sex fr. Nothing comes close.\n\nNow since I've only done it 2 times to test it, after about a week I could have normal sex again, but I've known dudes who simply cannot have sex without it anymore cause it's just so good. I can't describe that shit. They become addicted and will do everything for that feeling. \n\nI'm thankfull I'm way too broke to entertain such a habit, and not hot enough for people to pay for my habit lol.\n\nBut if I had money and/or was hot affff, I 100% would. That's how scary that shit is. \n\nSometimes I still think about it. Like damn. \n\nEspecially since I suffer from severe anxiety and major depression with a very strong anhedonic component, getting to feel pleasure for the first time in months (years?) was magical. Plus I got ADHD, other medical issues,dysfunctional family history, and whatnot. So yeah, imagine how that shit would stick to my brain like glue. \n\nAgain, I know it's not the long term solution to my issues so I avoid that BS like the plague. \n\nFun to try once, that's it. I got enough medical, psychological, social and whatnot issues to deal with. Can't add substance use disorder to the list lmao.\n\nAll this to say, your husband needs help. If he acknowledges he needs help, and looks for that help and respects that process, ok it's worth being there for him. \n\nIf not, dump him before he brings you down with him. I've seen that shit. It's not cute. At all. \n\nFind a psychiatrist and psychologists specialized in LGBT, addictions and whatever underlying issues there may be.\n\nIt's hard. I've met people who manage to have normal lives etc. for some reasons (likely biological, psychological and socio-economic protective factors). For others, it's been Hell and has destroyed everything around them (especially when their biology, psyche, socio-economic status were already fragile).\n\nIt's complicated and he needs serious professionals. Not no licensed social worker or NP. \n\nHe needs a clinical psychologist (masters or doctorate) and a psychiatrist (MD/DO). \n\nIdeally both of them on the younger side so there won't be LGBT related stigma to worry about or old ass \"just stop your addiction\" bullcrap. For that reason avoid boomer practicioners, it's sad to say but you might need to avoid direct immigrant practicioners too if they aren't clearly ok with homosexuality and/or non-judgmental treatment of addiction. His brain has been rewired and needs this shit. \n\nIt's ok to leave, but understand if you stay you have a long road ahead of you with possible relapses before it's finally ok. \n\nAnd if he even manages to shake this, you'll need couples therapy : you to work through the resentment and him to work through the guilt and shame. \n\nVery hard situation and choices. I hope you don't forget YOU in all of this.",
            "Empty shared bank accounts and grow a backbone and leave him.",
            "Divorce baby, divorce",
            "Bro, you should be happy he refuses sex with you, after he had sex with, as you said, virtually everyone else. Bet he has every std out there. You don't want any of that. Oh and yeah divorce his ass, you don't want him either.",
            "My husband has sex with other men. DEALBREAKER.\n\nMy husband takes drugs. DEALBREAKER.\n\nMy husband wont hug or kiss me. DEALBREAKER. \n\nMy husband takes half my money. DEALBREAKER.",
            "Hmm seems like the same situation as me",
            "Ummm it's time to start looking for a way out. You indirectly finance and support his lifestyle by being around him. If taking drugs to have sex with strangers isn't a red flag, and not just that but rejecting having intimacy with you then clearly need to reevaluate things in your life\n\nAlso ik situations like these frick up your entire life and you kinda have ti do some things from scratch but better now than never because you still have time left. You are perfectly vital and healthy and you don't need such a disgusting pig of a person in your life",
            "Leave",
            "It's cliché as all hell, but actions speak louder than words. If he's pushing you away when you come to him for even basic physical affection, nothing he says can prove that he finds you attractive, loves you, or values your needs.\n\nI suspect he likes the stability of being in a marriage where he can do whatever he wants and has a partner who sticks by him and pays so he can enjoy his lifestyle without worrying about money. If you want to break up with him, him \"resisting\" isn't really a choice.\n\nYour instincts seem spot on to me: you deserve someone who clearly values you, shows it regularly, and doesn't say one thing and do another. I usually don't like to give concrete advice, but in this case, I would get out of there immediately and stop wasting your time with someone who not only doesn't care enough to fulfill any of your needs, but makes you feel bad about them, too.",
            "Chem sex was your first sign sug. Time to drop him. ",
            "You need to leave his ass. And protect yourself especially if he’s doing drugs/fucking random guys. ",
            "I was really going to try and be devils advocate here and maybe share something that you hadn’t thought of. \n\nBut he’s sounds like a DICK. Seems like he wants his cake and eat it too. He wasn’t to fuck about with basically anyone from what you’ve said like he’s 21 without a care in the world, but wants the security of a relationship so he doesn’t have to think about relationships, building connections etc. He wants to have all the things that comes from a dual income lifestyle but out no work into what it takes to maintain that relationship. \n\nI’m not usually one to advocate for a break up but if he continues he’s going to hurt himself and hurt you in the process. Especially if he’s having chem sex, he’s clearly got some addiction issues, he’s out of his mind during, doesn’t know who he’s getting intimate with, how dangerous that could be, and how the other person is going to act and react. \n\nHe’s selfish and doesn’t care about you or your marriage.",
            "I know it sounds harsh, but it seems like you're just a resource for him to pay the bills and help him financially. He obviously found comfort in that since he \"resisted the divorce.\" You don't need his permission to leave him. You have to find the strength to realize it's over and that you deserve to find a man who loves you the way it feels your needs.",
            "Something isn’t working for YOU.  Call your local divorce attorney.  Consider therapy for yourself to check your alignment.  Open relationships are a complete waste",
            ">He constantly pushes me away if I go in for a kiss or a hug. \n\nOP, you are 35. You need to talk with him about why he pushes you away, and how it makes you feel. You can do this.",
            "If there's no intimacy you need to separate.",
            "Grow up dude. You ain't husbands no more.",
            "Homie he already left you. He is just using you. It's time to get a lawyer, and if he resists that isn't your problem, you don't need his permission.",
            "You know he has sex with others while literally pushing you away and you are still asking for advice?\n\nMy guy it's a one way. That's horrible, I could never have an open relationship.",
            "I dont know why the hell you are with wasting your time with this meth head. Also chemsex is the stupidet shit I’ve heard in a bit. What you mean is loser sex.",
            "Why are you still there? You should have left a long time ago.",
            "Do you do meth?",
            "There's more to the story here besides OPs frustration. Seems like OP likes that half of the mortgage is paid too. \n\nJust go get your needs filled. If/when you meet someone new, leave your husband.",
            "Is he the victim of childhood sexual assault? As someone who went through that myself, I have a super hard time having intimacy with someone I actually care about. When I’m single I can fuck a different guy several times a month, when I actually care about someone, I can go months without wanting to fuck.",
            "Go to a divorce attorney and a therapist. In that order. Separate finances, start deciding if you're kicking him out or moving out yourself. \n\nIt's not worth your dignity to tolerate this. I left my ex husband after 18 months because he was still cheating after manipulating into an open relationship; the rule was no bfs and no repeats, yes disclosure. Couldn't even manage that. He'd also been cheating before we had that agreement. \n\nHe's too selfish to waste good years of life. Go live, preferably far away from him. Give yourself permission to feel, listen to sad songs, eat a cake, something; mourn the loss, then move on.",
            "Tell him[this](https://youtu.be/5ZALQf6MiOo?si=YwVhD-eTqDjU5Xmb)",
            "He sounds like a selfish arsehole. Why would you even want to be with this dickhead? Run",
            "Run. Now.",
            "Easy for me to say because I do not know all the entanglements- but i am sure there are some of those-BUT I think its time to fly -life has taught me very recently that life is short fleeting and very fragile-don't waste time you'll later regret",
            "11 years I was in a relationship, 5 of those years we never had sex.\n\nSo I left him, got on prep and now I’m loving my best sluttiest life",
            "He’s messing with your brain. His actions communicate the opposite of what he’s saying. That’s abuse. Try to go to counselling to see if you can save the marriage or perhaps you will discover he’s not a good man and it’s time to move on. Both people are required to make a relationship work and he’s not putting in the effort.",
            "When you don't leave him for this, you enable him to continue using.",
            "Been in this exact position. Just fucking leave. It will absolutely not get better until you do.",
            "I was talking to my favorite sister at the end of my 17-year relationship.  I said to her, \"I think I would feel less lonely living alone than I do living with someone who no longer loves me\".  My brain heard me talking, no shit, and that was the day I decided to end it.\n\nOur relationship should have ended at year 12, I wasted 5 years trying to fix what couldn't be repaired.  The last 12 years have been some of the happiest of my life.  \n\nDon't make it about the sex.  Is the relationship meeting your emotional, sexual, physical needs, if not and it can't be fixed, move on.  You are just wasting precious life and constantly being told, \"you're not good enough\".  You are good enough, just not for him.\n\nMove on and live you best life.",
            "God knows what youd catch from hom if you did have sex. Leave.",
            "Both of you need therapy.\n\nHim, because of drugs, sex and not wanting it with you. \n\nYou, because you are being harmed mentally and may not be aware of how it is affecting you.",
            "I've been through a divorce that I initiated because they chose drugs over me. I spent way too long trying to fix them when they didn't want help at all. You should seriously look into divorce and seek therapy. It was one of the hardest things I've ever had to do, but in retrospect it was also one of the best things I've ever done for myself.",
            "You should be forced to be honest with him about how you feel about his ignorance right now and what you need from him in terms of sex fulfillment. Inform him of everything.What are your thoughts these days?",
            "Who's in charge here? \"I’ve tried to break up before but he resisted.\" He playing you like a toy. And this should effect your self esteem. Enough to break up and move on from this horror of a BF. A total selfish BF who doesn't care a thing about you. How dare he. No shame. Get out. Then find a therapist.",
            "Sex doesn’t always last in relationships. It’s easier in gay couples when open relationships are not a big deal as long as both guys agree to the same terms. Do you play around too? Are you still affectionate together, do you hug, do you enjoy each other’s company?",
            "> I’ve tried to break up before but he resisted.\n\nThats not how it works. You just change the locks on the front door when he's gone and leave a trashbag with his stuff in the driveway.",
            "This 10000% ~ breaking up doesn’t have to be a mutual decision. Of course he resisted! Dump his ass on the curb and go get railed.",
            "Listen to this guy.",
            "Is the drug of choice meth? Christ 🫣",
            "Yeah a dead bedroom can be a couple killer but address the Tina in the room first.",
            "What op is experiencing is what happens when you agree to an open relationship.. you are just gonna waste whatever time you stick together, since then.",
            "Whatever it is he's a meth user and if OP is uncomfortable with it he doesn't have to put up with it.",
            "If he can’t even touch his husband is better he find another friend ",
            "I wonder what the perspective would be from the other guy. We've all dog piled on him based on OP, but I'm in a mildly similar situation. If cannabis is considered Chem sex or even poppers this could be me lol even though I've tried so many things to bring back a spark.",
            "You broke the rule that says \"never give a cheater a second chance\".. once a cheater always a cheater, remember that.",
            "no no and no. What op experiences is just late stage open relationship. Their relationship has ended the moment the open proposal came on the table.",
            "\"Chemsex\" generally refers to sex while on one (or a combo) of three drugs in particular:\n\n* Methamphetamine\n* GHB/GBL\n* Mephedrone\n\nThey're all legit Bad News (TM) drugs.",
            "Depends on the people. I know many happy and stable open relationships that have lasted years or decades.",
            "Substance abuse isnt something anybody should be comfortable with, tbh.",
            "Didn't know he was cheater. He got no second chance. I didn't find out until after I filed. We were not growing in the same direction. Little did I know why....been with my current guy for 7.5 years. Have no idea what my ex is doing, nor do I care. I'm very physically distant from where that part of my life was. When I finished college, I started over, started over. New name, religion, occupation, country. I moved overseas with three suitcases and a little dog and a few grand in my pocket from selling all my possessions. I've had a crazy life, but wouldn't trade it.",
            "Oh yeah definitely bad news. I dunno why but chemsex usually means GHB or Mandy to me…. Not that it’s better but hey 🤷🏻‍♂️",
            "In vast majority of cases it never works out. I have been saving couples to favs on grindr. I watch these profiles disappear after like few weeks or months, then another few weeks later, they reappear, but both with separate accounts and single xD\n\nWhat op is experiencing is just late stage open relationship, pretty much.",
            "Makes me wonder how many queer couples would still be together is t didn't have huge place in gay hookup culture",
            "By what you wrote earlier it seemed like your ex cheated before he manipulated you into open relationship(in order to allow him to fuck around).. and he still couldn't even abide by the terms you set.\n\nAnyway gratz on your new life",
            "The drugs of favour for chemsex vary quite a bit by country, but in Europe it's primarily GHB/GBL and mephedrone, and in North America primarily meth.\n\nWhich drugs count as chemsex, even, is something that's disputed sometimes because the term originally had a specific public health meaning that was limited to those three particular substances. And if we're going to class it as *any* substance use combined with sex then surely drunken sex is also a form of chemsex.",
            "I live in a community where polyamory and open relationships—gay and straight and bi—are extremely common, almost the norm. I've seen it work over and over. I've also seen it fail a bunch. It's hard to know the statistics over large numbers from an ad hoc sample though.\n\nI suspect that having role models for successful open relationships makes it easier to succeed in an open relationship. You have people you can talk to and observe to know how to navigate the complexities.",
            "The vast majority of ALL relationships do not work out. Not just open relationships.",
            "You’re either a teen or have never been in/around an actual relationship and it truly shows. “Most monogamous relationships last for the life of the couple” kinda bullshit.\n“The 95% confidence interval for the gender of who wanted breakup among nonmarital heterosexual unions was 47% to 65%”\n[For you false “most monogamous relationships last” comments later in this chain.](https://web.stanford.edu/~mrosenfe/Rosenfeld_gender_of_breakup.pdf)\n\nOn the open relationship part, while I agree I’ve seen **some** couples jump into it like it’s not a big fucking deal. From you comments and post history, I feel like you’re not well educated on relationships, in general, regardless of monogamy, open, or polyamory. I’m sure you’ll get the hang of it when you mature and get a few relation relationships under your belt. \n\nOh, and take that xD back to 2009 where it died.",
            "No you had that right. He had, unbeknownst to me, been cheating during the last half of our relationship and our entire marriage. He was an antisocial pos. His next partner got a hold of me and asked for the story about the relationship. Of course I got blamed for everything wrong. Fuck me for not wanting to be married to an abusive ass-clown. Found out he actually got physically abusive with the next person; after being gas lit for years, it was vindication it wasnt all in my head. The next guy shared my name as well...I was a shoulder for him while he was getting away and rebuilding. Luckily he never lived with him and stayed independent, so their separation was easier. \n\nThanks!",
            "Yeah agreed I’m in the UK so that makes sense. Some people consider poppers ‘chemsex’ 🙄",
            "You sound like a depressing person who takes more interest in others' lives than your own.",
            "Lol which blue state you are in? Let me guess... California? lmao xD\n\nMust be std heaven too xD",
            "Nope, most monogamous actually work out. You just never hear about them because they aren't exposed in shit apps like grindr",
            "Nah you are wrong on everything you said xD, cute attempt at stalking tho. xD\n\nPerhaps the funniest thing here is how you got triggered at a smiley. It would be shame if it was posted 3 times in this comment xD",
            "> any substance use combined with sex\n\nNyquil and Geritol sex",
            "Actually everyone is extremely careful about STIs from what I can tell. While I’m not really sexually active with any of them on a regular basis, the times I’ve been invited to play parties or the few times I have hooked up, the “when were you last tested?” and “what is your current status?” conversations were front and center. \n\nAlmost as if there are actual responsible, mature adults in the world. \n\nAlmost.",
            "Friend, most people go through at least one break-up in their life. If you have two relationships in your life, that is already a 50% “failure” rate. For many people, that failure rate is higher. The only relationship that don’t “fail” are the ones that last until you die.",
            "Looks like the divorce rate is roughly 30%\n(Source: https://www.cdc.gov/nchs/fastats/marriage-divorce.htm)\n\nThat obviously doesn't include non-marriage relationships. Nor are those statistics broken down by closed/open status.",
            "😂",
            ">when were you last tested?” and “what is your current status?”\n\nAs if that will stop anything xD... First of all you are hooking up/having an orgy, random guys already lie about age and name, they can lie about stds too.\n\nAnd second getting tested is equivalent to closing the barn door after the horse left.\n\nThe only way to be pretty safe from stds is to have an ass that you own to F. Sharing wont do against stds, even if you pretend it works otherwise.",
            "You know.. your boyfriend can die, that means the relationship didn't last until you die. I don't consider that as a failed relationship. Either way the failure rate is not nearly as high as the open relationship, or anything else nonmonogamous."
        ]
    },
    "Any guys here prefer sucking cock than receiving? ": {
        "title": "Any guys here prefer sucking cock than receiving? ",
        "score": 80,
        "url": "https://www.reddit.com/r/askgaybros/comments/1dlnyja/any_guys_here_prefer_sucking_cock_than_receiving/",
        "content": "",
        "num_comments": 81,
        "comments": [
            "I know sucking a cock is probably my favorite sex act",
            "Love to suck cock and swallow 😋",
            "Definitely prefer sucking vs. getting sucked. Lots of it is to do with being circumcised and having no frenulum, thanks mom and dad. But I love everything about it. Been on a really good streak of top choice uncut dong.",
            "Definitely. I love sucking, but getting sucked gets boring pretty quick.",
            "I have a boy on speed dial who loves nothing more than sucking cock and swallowing. He doesn’t like to bottom or even finish jerking off. I even tried going down on him to return the favor, but he said he doesn’t like receiving or anyone touching him. For him, sucking cock is the ultimate joy, especially when I feed him my fresh milk.",
            "I’ve never loved receiving oral. It’s not my thing. I love giving it however",
            "Definitely",
            "Yes. And I mostly top.",
            "Yes, I'm a pro at it but can't keep it up when I'm getting sucked unless rough play is involved... It's weird",
            "I definitely do",
            "Yes! I have a Gloryhole and I suck cock at least once a day. Sometimes guys want to suck my cock too, and I let them, but I could really care less if I get sucked or not. Occasionally, I will ask if I could get fucked if I really like the dick, but mostly I just love sucking cock. I love the taste of it. I love the feel of it. I love, the throbbing that happens just before a guy comes. It’s all good!",
            "100% prefer to only suck. I’m a sub bottom 🌚",
            "Sucking cock is my favorite sex act, especially if it's uncut! I still remember the first time I sucked a cock, it felt so natural and I was an instant pro!",
            "Totally.",
            "Yes. I love sucking dick. Don’t really care about receiving because honestly, most people are just bad at giving head.",
            "I’m a slut when someone says oh I prefer to suck my dick is out faster than Donald’s",
            "Me",
            "Sucking cock is my favourite lol",
            "Definitely prefer to suck! Having a guy cum in my mouth is the hottest thing ever lol.",
            "Love to suck and swallow with no reciprocation.",
            "Omg yes. Finally thought I was the only one in this world 😭",
            "I don't prefer either honestly",
            "Yes….",
            "👋🏾",
            "Absolutely",
            "Yes 🎇",
            "Me 💯.",
            "Seems like a lot of guys who message me on Sniffies are into exactly that.",
            "I like both but definitely prefer sucking since It turns me on and I find moaning hot",
            "My boyfriend says I do it well, of course if you see his cock you won't stop sucking it",
            "I like both tbh",
            "I prefer getting sucked, but I’ve been told I’m very good at sucking cocks. I’m a cocksucker 🍆",
            "Yes of course",
            "Love to suck and recieve, also i prefer to swallow if it tastes good. Don't like anal but okay to give. \n\nI love foreplay better than actual sex",
            "Meeeee",
            "nope, I prefer to be sucked off instead.",
            "Never experienced it either way lol",
            "Love this thread",
            "I love sucking dick. Like that just me.",
            "I love both but I think I’d rather suck",
            "I'm quite sensitive there so unless he can do it right I usually prefer to be the sucker not the suckee",
            "I love both. Depends on who tho",
            "Same. I prefer sucking and swallowing. still haven’t reached the part where I’m comfortable on my side. It feels too weird still.",
            "Idk, I like both, but giving is more exciting in certain scenarios. A hookup where one is very like, raw about it. \"Hey You wanna suck my dick\" \"Ok\"; and then we do it. Is less exciting than more filmatic scenarios. But I still do it from time to time. Recieving is also very pleasing.",
            "100%",
            "Lots of guys do. \n\n\"Better to give than to recieve\" I always say. So give me your dick and I'll give you some head.",
            "👋",
            "I do. Personally I have cum a grand total of once, ever from a BJ so most of the time I just don’t feel it’s worth the ‘trouble’.",
            "Yes I don’t really like receiving unless they stick a finger in and it’s the end of our session because I cum so fast which that",
            "Me!",
            "It depends on the situation. Some guys have a certain attitude about getting sucked, or their cock responds a certain way to the things I do to it, or it fits my mouth a certain way that makes sucking it irresistible. In other cases, I prefer to get sucked. Depends also on the attractiveness of the guy, his attitude about sucking, etc.",
            "Love to suck a man dry",
            "I love to suck cock but I only suck cock if it's hard I don't put any ones soft in mouth",
            "I actually have no interest in being sucked. I guess it’s because I’m very submissive and service oriented. I absolutely love to worship cock & balls. \n I always swallow unless the man I’m sucking has other ideas.",
            "Me, too sensitive, makes me cum really fast (I could spend hours having my balls being sucked though)",
            "Me. I exclusively enjoy bottoming and giving bj.",
            "Me!",
            "We are the givers!! Treasure us",
            "Porque no los dos?",
            "100% love giving more than receiving but I was circumcised poorly so I’m not as sensitive, but I still enjoy it, just not as much as worshipping a cock and draining it with my mouth.",
            "I'm probably one of the few gays who doesn't like suck cock, it taste salty, like sucking a sausage with salt water",
            "I do because I don't last that long.",
            "I have a video of me sucking a guy off made him cum in 2min lol 😆",
            "Hey!! Similar situation over here. \nWhen I was only about 6 days old I was subjected to a botched circumcision under my parents' consent (apparently because at the moment they didn't know any better and the docs wanted to go the easy way about phimosis) which is why I don't benefit much from being on the receiving end during oral stimulation. \nHowever, I absolutely love everything about sucking other guys, especially uncut ones. Idk but as a demisexual I find that there's so much about it, for example the idea of someone else willingly letting me explore their body that makes the whole act feel so intimate(? +being in a vulnerable position and in control of my partner's reaction at the same time takes me to huge levels of gratification, knowing I'll be bringing him lots of pleasure and enjoying myself aswell.",
            "That's me, don't touch my dick! but I love cuddling",
            "If you need another sucker for put on speed dial I’ll be happy to suck you regularly",
            "My favorite kind of top! You can suck and fuck me any time.",
            "That’s so fucking hot.  Are there still gloryholes???  I’d like to give it a try sometime",
            "I prefer to suck anytime",
            "You must have a nice cock to suck!",
            "I’ll suck you and give you my ass anytime you want it",
            "Dm the video damn it",
            "period king!!!!",
            "I need the video 😛",
            "Of course there are! I advertise on Sniffies and I get lots of customers here in Austin Texas.",
            "Oh yes please",
            "Can't send vids here 😕",
            "Wow this is wild",
            "Wherever you can send the video from, I am down. Anything for a 2-minute blowjob video.",
            "Could you dm me it too, please?",
            "Wow me too!!"
        ]
    },
    "What's the most homophobic thing that's happened in your town, or to you?": {
        "title": "What's the most homophobic thing that's happened in your town, or to you?",
        "score": 170,
        "url": "https://www.reddit.com/r/askgaybros/comments/1dlfkkp/whats_the_most_homophobic_thing_thats_happened_in/",
        "content": "I moved to a small Florida beach town a few years ago, very conservative, and residents are mostly retired, to the point that at the beach all you see are elderly people. A few neighbors had mentioned to me about the 'nude beach'. You have to walk quite a ways down the beach from the parking lot, and it's pretty rocky, and I'm not into nude beaches so I never went. Another neighbor referred to it as the 'gay beach'. Still not interested. Well, it seems the local police who have little to do (the most common crime is stolen bicycles) decided it would be in the public's interest to have one of the young good-looking cops hang out undercover at this beach. He arrested  6 men who supposedly 'touched' him. All were between 65 and 80 years old. The local paper thought it a good idea to shame these men by putting their names and photos on the front page. The next day, one of the men committed suicide, leaving a family behind. They  sued the police dept. for entrapment. I'm not sure what came of that, of course the paper wouldn't report that. ",
        "num_comments": 94,
        "comments": [
            "Sounds about right for Florida.",
            "I got gay bashed in high school. Small town in Hawaii. It’s cool though. I graduated a year early because of it and the guy who did it wound up in juvie. Last I heard, he had four kids from different women and has been in and out of prison over the years.",
            "Someone threw a bucket of white paint over a new mural of a drag queen that was painted on the side of our biggest gay bar. Within 24 hours it was repainted, and everyone came out to have a drink and admire the wall. Yeah it was homophobic, but the resilience of us gay people is amazing",
            "My boyfriend was great for almost a year in our 2 year relationship, but after that until the end of our relationship, he became a total ass, and even became extremely homophobic because he was arranged/forced to marry a girl 15 years younger than him back home in Afghanistan. \n\nI moved on and ended up getting together with a guy I had a huge crush on 5 years ago when we were classmates during the summer my ex left to Afghanistan without telling me. He tried to get in touch with me when he came back, but I just left him on read 😝\n\nHad another guy back when I was in HS, spread rumours and other nasty things about me being gay and whatnot. I blocked him on FB, and 5 years later, I unblocked him and found out he has/had a boyfriend 😂",
            "I didn't personally know him, but several years ago a gay guy in my area was tied up and burnt alive. RIP.",
            "A guy in my hometown went to the supreme Court to have the right to not make gay wedding cakes. And he won.",
            "I grew up in a small town and we knew a gay couple who had an active farm. A crazy person burned down their barn (with animals inside) and spray painted  “die fags” on the side. 😖",
            "Most homophobic that happened here is that many gays were burned alive at the stake.\n\nMost recent homophobic is the typical gaybashing.\n\n  \nEdit: I add the extra info here too so it's more visible.\n\n\n\nPlace is Gent in Belgium.\n\nThe first known in Europe was here is 1292. Then it went on with a peak under calvinist protestantants.\n\nThe last known in Belgium is in 1658 as then the preferred way to deal with it became to cover-up as there was the that talking about it would incite others to do it.\n\nThe northern low countries (Netherlands) continued focussing on burning gays as they remained protestant.\n\nIt's only after the Napoleonic law reforms that is was removed from criminal law. Although other generic laws were still often used to prosecute but without capital punishment.\n\nThis article from Leuven University provides some. It's in Dutch so but Google translate can do a good job at it. [https://nieuws.kuleuven.be/nl/2017/van-brandstapel-tot-homohuwelijk--boek-schetst-geschiedenis-van-homoseksualiteit-in-belgie](https://nieuws.kuleuven.be/nl/2017/van-brandstapel-tot-homohuwelijk--boek-schetst-geschiedenis-van-homoseksualiteit-in-belgie)",
            "Mm I think of only two cases. \n\n1. When in grade 9 in high school in small town canada (Ontario) I for student council put myself up for auction just to raise money for the cause. I wasn’t popular so like one person bid. But then afterwards the guy (in grade 10 or 11) tells this grade 9 I’m going to make you my b—-  like who the heck says that to a 14 year old?! Obviously I backed out told the student council to pay him back cause no. \n\n2. Tbh this was minor but just in parking lot of a Walmart guy who was once a friend just drove by (nowhere near me like I wasn’t going to be hit) and shouted “gayyyyyy”. Like wow so clever. \n\nThe bullying I got was from being autistic so naturally group of kids I thought were all my friends started FB group called we hate <insert my name here> and it’s not because he’s gay (long story). But yeah fun times. I think I would’ve rather been bullied for being gay…",
            "There's a branch of \"Mom's for Liberty\" here that tries constantly to remove the 4-5 LGBTQ+ books in our public library. The encouraging thing is that most people's attitude, even people who aren't particularly gay-friendly, is \"if you don't like those books then don't read them.\"",
            "Tl;dr.. tried to get married in Toledo and was told \"no.\"   \n\n\nThey fucked up the paper work though and accidentally registered us as married. I'm supposed to sue, but just haven't had the spirit to play with lawyers. ",
            "This happened in the 1940s or 1950s.\n\nTwo teenagers beat and hung a gay man off the bridge. The cops let the teenagers go cause they \"didn't want to ruin the young boys lives\" as I was told.\n\nDisgusting.",
            "The most homophobic thing that happened in our city lately was Wayne Newton. And he's probably been mellowed a little bit by being in the same hotel as RuPaul Live.",
            "My father almost beat me with a knife because I was gay. At that point I wasn't into men, and barely I knew what gay meant. I was 13",
            "I'm in Texas",
            "I was too drunk to remember this but my ex bf told me we were called f@gs by some guys because he was carrying me back to the car and I apparently was saying how awesome and loving he is out loud",
            "That is SO fucked up and sad.   It might help us gays to know where this is located",
            "My father.",
            "~40 years ago, the publisher of a local gay paper was ambushed and beaten up outside the paper's office.\n\n~55-60 years ago, the founding minister of the church my parents belonged to went on a vacation to Switzerland with his family and from there, wrote back a letter of resignation, saying that they were going to remain in Europe for a while. The real story is that he had either had a relationship with or made a pass at a younger assistant minister, so, to hush it up, it was arranged that he would leave town on a pretense. Ironically, the same church will now perform gay marriages. \n\nIn the 1990s, I was up for a Rhodes scholarship, but didn't make it past the first interview. Someone looked into it, and it was because I had been open about my gay rights activism. Of course, considering what we now know about Cecil Rhodes, that's seriously ironic . . .",
            "Born in the 60s in the UK meant the bullying was extensive in my teens. Punched, kicked, stabbed with compasses at school, bricks dropped on my head, shot with pellet guns, partially drowned, went on for years. Then Aids happened which just compounded the torture and included adults into the mix.\n\nAll sounds very sad and bad but I came out of it all and haven't let it ruin my life, I still sometimes wince when I see two guys holding hands in the street. I like it a lot but the kneejerk response is subconscious.\n\nI'm glad we've come far.\n\nBest thing was getting married",
            "The usual suspects complained about a Pride Month display at the local library three years ago, and when its board refused to give in to pressure from a few loudmouths a group got a ballot measure to defund the library on the November ballot. After a lot of lies about children being abused and exposed to pornography it passed by 48 votes (in a county of over 100,000) and cut the library's public funding in half.",
            "I’m originally from a small town in central PA. I was buddies with one of the only out gay guys from the town and he’s told me of straight up being denied service at a couple different local businesses because people knew of him as being a gay man. \n\nWorst for me throughout my life is only being called slurs out of a moving car. Other than that I haven’t faced much. I guess I’ve been in many social situations where I wasn’t known to be gay and had to listen to groups share their homophobic views back and forth. Awkward and annoying",
            "Never actually had anything when I lived in Ohio, but was never out in gay areas and I’m not “obviously gay”. I moved to Chicago last September and in December I was in Boystown at like 2:40am one night when some redneck in a lifted white pickup truck yelled to my friend and I “are you guys faggots?”. He drove away after that. We weren’t in any danger, but that’s probably the most obviously homophobic thing that has happened to me out in the wild.",
            "When I was in high school another student arranged for all the athletes (or that social circle more or less) to spit in my path whenever they walked past me. To this day I wish I had reported it but I did nothing.",
            "A car full of guys slowed down beside me and said “die faggot die die die.” I’ve been called that many times but the way he said that this time sounded so evil it’s like he was going for the homophobic gold medal. To be fair though, I was going to a jungle themed party and was wearing these little tiger ears on my head so I did in fact look like a faggot 🤷‍♂️",
            "The Pulse Nightclub shooting. I live in Orlando.",
            "Put in the learning disabilities \"self contained \" class \"for my safety \" in 9th grade because I was the only out gay kid at my school. Or maybe 8th grade when the school hired a 400 pound man who could barely walk to follow me around school all day (yes he would sit and watch me in class and in the bathroom) \"for my protection\" because I told a boy he was cute and he decided to tell on me...",
            "Luckily for me I am 'Straight passing' so I have never encountered homophobia directly.",
            "I live in a small city in Florida. On New Year’s Eve, I was downtown wearing a black t-shirt, black pants, black AF1s, and a black and gold foil jacket—the jacket was the only flashy thing I had on. As I was walking with a friend from one bar to another to meet up with more friends, a guy in a restaurant yelled “Faggot!” out of an open window.\n\nI stopped, stared at him, and said, “Wow, really?” That set him off. He came outside, repeatedly yelling, “What are you going to do about it?” This guy was built and tall, probably had been in the military. Despite knowing I shouldn’t engage, I responded, “Are you missing your barrack days?” My friend called him a homophobic asshole at the same time.\n\nIgnoring my comment, he shoved my friend, who is straight, launching him. That’s when his friends grabbed him to hold him back. As he acted crazier trying to break free, I helped my fallen friend and sarcastically told the crazy guy to have a good night.\n\nI bought my friend drinks for the rest of the night as thanks for trying to defend me, even though he knew he was outmatched. That meant a lot to me.\n\nSo yeah, just walking down the street in a shiny gold jacket got me hate crimed.",
            "I rented out a basement from a middle-aged couple and their high school age son. Had my own entrance, but the basement wasn't totally private. Lived there a year or so, they were very nice. I came out as gay and started having boys over. They said they couldn't allow that to happen under their roof, for Christian reasons, told me I couldn't have boys over. Well, I had a boy over again and literally while I was giving him a bj on the couch down there the woman shouted down to me from upstairs asking me to come up there, so I did and she said he needed to leave. So drove him home at like midnight. They wanted me to move out so I did. Wouldn't want to keep living in that environment anyway.",
            "It does seem like entrapment.",
            "I came out to my mom when we were planting flowers, and she cried... This was 20 years ago...",
            "They guy with the sign saying god hares fags dot com",
            "Pride flags not being allowed on college campus",
            "Growing up in the 90s 🙃",
            "I mentioned to a guy I was gay and he went “That’s weird”\n\nThat was basically it. Plus, no one liked that guy anyways. Honestly it’s surprising how progressive my school was, and I never got bullied even though I was fat for the first few years of hs and a nerd lmao. I think I was like a social capybara :P",
            "Can’t talk about my town because I don’t know anyone who’s gay here. But when it comes to my country, the most recent thing was some cops who broke into a gay guy’s and bi girl’s apartment, physically, verbally and sexually assaulted them, and filmed them. They of course didn’t suffer any consequences whatsoever.",
            "1988 - Ex-partner and myself were set upon by 6 young clean cut men wea wearing steel toed boors while walking from our home close to a CBD to gay bar in the CBD at 10pm on a Saturday night. We had the shit kicked out of us, I required 19 stitches. Police couldn't find them. Feedback through the Bikie Groups was they were Rookie Police out on training.",
            "I went on my first date with a guy in my early 30s and as the uber was pulling into the parking lot to pick me up, we shared a magical kiss. The uber driver saw it was two guys and sped off and cancelled the fair. I was still floating on a cloud of euphoria from sharing my first gay kiss that i didn’t realize what happened until hours afterwards.",
            "This was someone I went to school with. [https://www.liverpoolecho.co.uk/news/liverpool-news/gay-policeman-james-parkes-beaten-3443103](https://www.liverpoolecho.co.uk/news/liverpool-news/gay-policeman-james-parkes-beaten-3443103)\n\nMyself and my husband have had our own experience of hate crime too, that forced us to move, as it was coming from neighbours and the police were being worse than useless about it.",
            "I mean, doesn't lgbt and left in general condemn non consensual touch ? Aren't the men who touched the cop without his consent in the wrong? Even though it was a set up, nothing would happen if these men just kept their hands to themselves.\n\nAlso notice how it was all old men twice or trice the age, touching a young undercover cop",
            ">A few neighbors had mentioned to me about the 'nude beach'...I'm not into nude beaches so I never went. Another neighbor referred to it as the 'gay beach'. Still not interested.\n\nWell I guess the beach only became interesting to the OP, after the police pulled off their stunt :)\n\nBtw is arresting for sexual harassment, really something homophobic?",
            "Living in Florida, very conservative of course. Walked down the street holding the hand of my boyfriend at the time in high school and a car drove by and threw a water bottle at my head. Got the license plate though. He got arrested for hate crime and abuse of a minor.",
            "I definitely don’t miss living in Florida. I was born and raised there. Only go back to visit family for the holidays.",
            "Does anyone else think David Pakman is incredibly hot?",
            "Not specifically me, but somebody put yard signs up around Billerica in 2020 that read “Pedophiles for Healey” in rainbow colors.  Maura Healey is the first lesbian governor of Massachusetts.",
            "I hate to break it to you, but there's a big crackdown on cruising on the West Coast, too. \n\nBeing gay and having rights doesn't mean that we're entitled to having sex in public. This shouldn't be a controversial view in *current year*.",
            "Jheeeze. He was a deadbeat from the get go eh? I low key thought you would’ve said that he ended up being gay after HS lol. If he’s in jail, he probs is now 😅😆\n\nHim having kids with diff women reminds me of that saying “don’t breed ‘em if you can’t feed ‘em. The gov ain’t yo baby daddy!”",
            " I had a friend who always told me, \"The best sex I ever had was in prison.\" Most guys who are gay bashers are very close to being gay and they fight against it. I think it is envy. I am straight but I envy the gays with their sexual freedom. Something I am tempted with always.",
            "I believe that people get upset who are closest to becoming gay themselves.",
            "The second story is a very familiar one. They come full circle.",
            "Wtf",
            "Damn. Which country?",
            "Bro wtf",
            "It happens :(",
            "I’ve never understood this fight bc like sure it’s homophobic but also why would you want to give this person your business?",
            "Yup.   So fucked up",
            "I mean.. of course he won, just like that Christian bakery, that was sued by lesbians did. Everyone has right to decline doing business with anyone for any reason, thanks to open market. That said it goes both ways. While the Christian bakery won in court, they still went out of the business because they got boycotted. Best not to be homophobic and piss off masses of protentional costumers.",
            "Poor animals 😢",
            "When was that? 😞",
            "Did they also have gay cows or something? Otherwise \"Die fags\" made no sense because only animals died",
            "Where is this?",
            "Wtf",
            "Belgium, it seems. But in what year that burning happened? 15th century?",
            "Was gay marriage legalized there?",
            "TIL Wayne Newton isnt gay. Huh.",
            "Does he know you are gay now?",
            "Congratulations!  You've earned some peace.",
            "You looked like a human being with tiger ears.",
            "That's how it should be. College campus aren't grounds for politics and movements",
            "That's why anyone who lives nw of the city refers to Billerica as an shit hole. There's very few of them in MA.",
            "Men like that are born losers. That’s why they have so much rage. He tried playing the victim card when I took his ass to court saying that I threw the first punch, but I had witnesses and the judge told him to get fucked. He got what he deserved.",
            "Because the gay couple in this case [literally don’t exist](https://www.theguardian.com/law/2023/jun/29/supreme-court-lgbtq-document-veracity-colorado). The whole case is fraudulent and built upon something that didn’t happen. The supposedly “gay man” in question was a guy married a woman for 15 years and didn’t know anything until contacted by a reporter.",
            "It happened in 2011",
            "I stand corrected. After I posted, I went back to look at the pictures I had… it said “fags are freaks”  on one side of the barn and “fags burn in hell” on another part. In total 7 horses died and 1 colt 😢",
            "Gent in Belgium.",
            "Gent in Belgium.\n\nThe first known in Europe was here is 1292. Then it went on with a peak under calvinist protestantants. \n\nThe last known in Belgium is in 1658 as then the preferred way to deal with it became to cover-up as there was the that talking about it would incite others to do it.\n\nThe northern low countries (Netherlands) continued focussing on burning gays as they remained protestant.\n\nIt's only after the Napoleonic law reforms that is was removed from criminal law. Although other generic laws were still often used to prosecute but without capital punishment.\n\nThis article from Leuven University provides some. It's in Dutch so but Google translate can do a good job at it. [https://nieuws.kuleuven.be/nl/2017/van-brandstapel-tot-homohuwelijk--boek-schetst-geschiedenis-van-homoseksualiteit-in-belgie](https://nieuws.kuleuven.be/nl/2017/van-brandstapel-tot-homohuwelijk--boek-schetst-geschiedenis-van-homoseksualiteit-in-belgie)",
            "Legalized in the entire country. This wasn't too far back",
            "He got behind Michele Bachmann's campaign in 2012. And Michele's husband Marcus was a conversion therapy clinician. Of course, nothing can be ruled out. Marcus and Wayne may have been playing hide the salami in bathrooms",
            "No, my mother got a divorce before he found out, but he is dragging out custody so he could still find out",
            "What?  They're ground zero for politics and movements. Often colleges are where movements start.",
            "I lived in Mass for years. I am 76 male now in south western North Carolina.  had one man refer to me as a Mass Hole and my wife cannot pronounce Massachusetts. She calls it Mass a two shits. I think she is correct.",
            "Good! That deadbeat needs to fuckin grow a pair. Glad the judge saw through his BS.",
            "…your argument is genuinely irrelevant. \n\nThere was a case in 2012 regarding a gay wedding cake, which was a gay couple, which I believe is the subject at hand. Not that fraudulent website designer with false allegations. My question still stands.",
            "were they gay ponies, or something? No idea why would someone burn innocent animals, gay or not.",
            "Oh, but what's with your username lol? Maybe that's why they rejected you lol.",
            "But, they shouldn't be, unless the college degree itself has something to do with politics. If you are doing useless degrees like gender studies, then yeah who gives a fuck if you are also doing useless political movements(vast majority of them).",
            "We’re glad you are gone. Signed - Proud Bay Stater.",
            "As someone who was raised in rural western North Carolina, the only shit is south of us.",
            "For the same reason that desegregation in public businesses was a big deal, black people probably don't want to give money to a racist either, but having a \"whites only\" bar or restaurant or whatever encourages spaces where discrimination is okay which normalizes it. Same problem with modern politics, right wing extremism, and to a lesser yet still significant extent left wing extremism, is being normalized and allowed by society which is allowing it to fester and grow.",
            "I originally made this account for a subreddit dedicated to men who crochet. The tool for crocheting is called a hook. ;)",
            "LOL, sure bro xD",
            "r/brochet\n\n\nBut I won't lie, I've been enjoying this username elsewhere too",
            "this is so niche lmao"
        ]
    },
    "Was my bf raped?": {
        "title": "Was my bf raped?",
        "score": 74,
        "url": "https://www.reddit.com/r/askgaybros/comments/1dlk14v/was_my_bf_raped/",
        "content": "Just wanted to ask this group for a bit of help with my bf. \n\nFor context he has suffered anxiety for the past 3-4 years. He told me he never had it before the incident and that he feels like he’s going to die a lot of the time.\n\n It started when he met up with this guy he met on instagram at a night club. The guy brought him into the bathroom and made him suck him off. For a long time that’s all I thought it was and didn’t really understand why it was much of a big deal. I understand the doing stuff like that at the club probably isn’t the most ideal spot but I didn’t get why we would have got anxiety from that. \n\nFor a while he didn’t bring it up much, but would mention occasionally about it. It wasn’t until a few days ago when he brought it up again that I tried to start understanding what went on. I eventually learned that my bf had asked the guy to stop. And that the guy just hold his head down on his dick and made him swallow it. Which I know my bf wouldn’t like as he hasn’t been super keen on swallowing my own. After that had happened, the guy got mad at my bf and just left the club. I also learned out that my bf had then gotten an std from him and didn’t have sex for a long time as he was very afraid of catching something from someone. \n\nIs this rape? What should I do. I don’t really know if I should be sharing this but I really need to find a way to help him and unfortunately I don’t know exactly what to do apart from maybe to go and report what happened. ",
        "num_comments": 32,
        "comments": [
            "This is rape. Period. Any unwanted sexual encounter is. Especially when they’re told no and keep doing it.",
            "Yeah, that’s rape and it’s fucked up. My boyfriend was raped too, and in my experience the best thing to do is just be supportive and love on him. Therapy is probably a good idea; it really helped my guy with the things that cuddles just can’t touch on. It was kind of a recovered memory sort of thing that came up suddenly and he was a little out of it for a couple weeks but he’s a lot better now, and we definitely owe it to therapy. I’m really sorry that happened, people are shit and your boyfriend didn’t deserve it. Good luck",
            "Yes, definitely. But please do not report it on his behalf. Victims of sexual assault are often feeling victimized a second time when they report it to the police. There are some pros and also cons to reporting this. It needs to be his decision. I think he should talk to a professional about it. Self help groups for victims of sexual assaults exist. Try to find one in your area. Maybe he might want to check it out. Just give him lots of love and understanding.",
            "He said no, and the guy kept doing it. It's rape, period.",
            "He should have bit his dick",
            "It’s Rape,  anytime a person says no, it’s rape. One thing people in general need to understand is it’s less about the actual act, but the violence,fear, and loss of control the victims experience. While the Legal term for it may vary, the results are the same for the victims.",
            "Yeah that is definitely intentional/2nd degree. \n\nHe was already passive because of an underlying deep trauma, that triggered again, and they, genuinely, froze\n\nThis is my opinion, coming from personal experience as a victim\n\nBeing vulnerable is very hard, because you think you do not have a safety net, that's why religious people call it leap of faith, scientists call it one small step for man, and agnostic people only believe if there is proof. \n\nJust even talking about it, or seeing the signs is the giant baby steps that don't look big to one party, but it's insanely huge to the one hurting.",
            "Yes; he was raped.  I think that telling you, especially if you reacted sympathetically, is the first step towards his healing.  If he's been keeping this experience bottled inside of him all this time, it's hardly a wonder that he's become anxiety ridden.  The more he can talk about it, the sooner he'll come to grips with it. If this continues to live, rent-free in his head, he might need to speak to a therapist.  Good luck!",
            "It def is rape. I am so sorry he went through this. Sending him love and hugs ❤️🫂",
            "Yes, rape. First concern is the mental health of your bf. He needs counseling and possibly meds (I have high anxiety in general). At some point, if it's healthy for him to pursue, file charges. Problem is having proof so be careful before you go down that road. It can add a lot of pressure on your bf",
            "Any time anyone is subjected to sexual touching, penetration, harassment that they do not want… it’s rape or sexual assault. \nYes this would definitely fall into rape/sexual assault. \n\nAs for the panic attacks it sounds like PTSS (formerly PTSD). \n\nHe needs to seek therapy and a good psychiatrist, preferably one with experience with SA/rape.",
            "Doesn't sound like rape. Sounds more like sexy times at the club mixed with regret. You're BF was free to leave and who forced him to walk to the bathroom and get into the stall? It was obvious what was going to happen in there.",
            "absolutely. even this sentence alone (\"The guy brought him into the bathroom and made him suck him off\"), the word \"made\" would classify the situation as rape and/or SA",
            "Everyone on Reddit will say it was rape. \"The moment he says to stop and he doesn't, it's rape.\"  I see the reality of the situation. It's a club. There's likely drugs and drinking involved.  In sex its very common for a dom top to hold the guys head so he will swallow.  I had it happen to me and I don't feel I was raped.  He said he was going to cum and I started to pull away, instead he held my head and pushed his dick down my throat so I would swallow.  It was hot.  Technically, I could say that was rape.  But, it's really common dom top behavior.  That said, I've been sucking this guy for about 3 years, so he was comfortable with me.  Maybe that's why he felt it was ok to do that?",
            "[removed]",
            "Bingo. It’s a traumatic event that sometimes you never get past. I can speak from personal experience on this one. No is a complete sentence. That’s all.",
            "Bit? He should have chewed his dick like a f**kin sausage, leaving him traumatized life long!",
            "I thought the same thing",
            "OP said that the bf ASKED the man to stop, like it was only a suggestion. If the bf TOLD the man to stop then yeah it's rape.",
            "I think it’s just going to be very hard for him to file charges tbh. My bf is from another country and the guy was also from another country to my bf. If he wanted to, I imagine he would have to go back to his country to report it and then it would be super difficult as the other guy wasn’t from there.",
            "OP even said that boyfriend ASKED the guy to stop, meaning it was only a suggestion. If he TOLD him to stop then yeah that would classify as rape.",
            "But my bf is mostly a top. He’s told me in the past that he’s not too fussed on dick and loves ass. So I don’t see how this could have been enjoyable at all to him.",
            "Spot on",
            "Considering your past  comments, you had sex with everything and everyone when you were 11 years old. Is this some fetish of attention deficite or...?",
            "I was raped my freshman year of college. So anything like this sets me off.",
            "The think is that I can’t relate at all to it. So it makes it hard for me to understand what’s going on in his mind. And he’s never even spoken about it like it’s rape or sexual assault. Does it take a while for victims of rape to realise that it was rape?",
            "Nah just enough to get him out. Bleed that man dick and a fight will happen and his bf will get into much deeper unnecessaries troubles.",
            "Yeah, doesn't sound like that will he the route to go. Just focus on his mental health.",
            "It depends on person or a situation, some know and understand immediately they were raped while others either don't realize it or are in denial about it.",
            "Listen to him patiently, acknowledged his feelings, reflect what he said during a conversation, prompt him gently to speak his feelings more, and allow him to talk.  Then repeat.  That's all you need to do.",
            "Depends who can fight better. It's two men. It's not necessarily that rapist would win the fight."
        ]
    }
}