{
    "READ BEFORE POSTING YOU DEGENERATE PINHEADS! HALFWAY THROUGH THE YEAR AND WE HAVEN'T BURNED IT DOWN!": {
        "title": "READ BEFORE POSTING YOU DEGENERATE PINHEADS! HALFWAY THROUGH THE YEAR AND WE HAVEN'T BURNED IT DOWN!",
        "score": 1174,
        "url": "https://www.reddit.com/r/AskMen/comments/1cvy93s/read_before_posting_you_degenerate_pinheads/",
        "content": "GOOD DAY MY [GLORIOUS DIPSHITS!](https://media1.tenor.com/m/PmgENnuijXcAAAAC/in-the.gif)\n\n[So here we are, nearly halfway through the near](https://media1.tenor.com/m/pM6Y4PnYJUwAAAAC/samuel-l-jackson-tick-tock.gif), and we still can't figure out how to use [Reddit or AskMen.](https://media1.tenor.com/m/4xKxBs51vjcAAAAC/really-dumb-hide-yo-kids.gif)  [THE LAST STICKY](https://www.reddit.com/r/AskMen/comments/18w2low/welcome_to_the_new_year_you_smoothbrained/) has been added to the [FAQ](https://www.reddit.com/r/AskMen/wiki/index) but its not like you degenerates [actually read a goddamned thing.](https://media1.tenor.com/m/gXhQkmIBQ5cAAAAC/read-words.gif)\n\n**Joking aside for a moment**\n\nAskMen is a place to ask questions that will open a conversation with men or to gain a male perspective on things.\n\nThis is not a sex sub.    \nThis is not an anti-woman sub.    \nThis is not a dating sub.    \nThis is not a PUA tips sub.   \nThis is not a MGTOW sub.    \nThis is not an Incel positive sub.    \n\nMen are not a monolith.  Do not ask questions that treat all men as a singular being.    \nDo not post questions that assume all men think a single way, and you want to know why.  You're already on the wrong path.    \nYour boyfriend/husband/SO is an individual not part of collective male mind.  If you want to know why they did something - ASK THEM, NOT US.    \nYou want to buy your boyfriend/husband/SO a gift, and don't know what to get them, HAVE A CONVERSATION WITH THEM.\n\nYou didn't have a dad growing up and want to ask a question - we got dads here.    \nYou didn't or don't have many male friends and don't understand a reference - we got dudes here.    \nYou never learned how to do a thing that \"every dude\" seems to know how to do, and want it explained - we got those guys here too.\n\nI am saying all this, because lately there has been a swarm of [really anti-female shit being said around here](https://media1.tenor.com/m/eB7HcRqPP-MAAAAC/you-dumb-af.gif), people feeding into it, and then other (usually either anti-male or pro-fem) subs using it to buzz around and [incite fights, flaming and other bullshit.](https://media1.tenor.com/m/LGI22J-z3JIAAAAC/joker-batman.gif)  The bots catch a lot, but the mod inbox the last two weeks has been [full to the brim.](https://media1.tenor.com/m/97Yg4GE43E4AAAAd/jurassic-park-shit.gif)\n\nThis is a safe space.  Liberal, Conservative, Gay, Straight, Bi, Trans, Cis, Married, Single, Poly, Child-free, parenting, POC, White, Religious, Atheist, whatever...thats all part of the male experience, so it's all valued and all valid.\n\nWE THE MODERATION TEAM ARE ASKING - when you see hateful shit, when you see people behaving badly, when you see people being wrong - fucking report it.  if it's reported, report it again - three reports takes it down.  Or message us with a link - and title it \"This Fucking Person\"\n\nWe will act, but we have to know about it.  We need your help to keep this place a good place to be.  It's [a big sub](https://media1.tenor.com/m/zDuhYguUWKIAAAAC/fat-mama.gif), and [we mods are few.](https://media1.tenor.com/m/WdnWb_vMe-MAAAAC/300-shields-ready.gif)\n\nWe may hate you [dumbfucks](https://media1.tenor.com/m/b5nNbXsLLMsAAAAC/you-are-so-goddamned-stupid-stan-marsh.gif), but [we love you](https://media1.tenor.com/m/jNMfmpdR3i4AAAAC/love-heart.gif) as well.\n\n**EDIT** - [HOLY SHIT, LITERALLY](https://media1.tenor.com/m/H6J8gBpWVfIAAAAd/rgb-lights-toilet.gif) - What the actual fuck with girls and all the fucking questions about what we do with our junk when we poop?  is this another [TikTok thing?](https://media1.tenor.com/m/TUBqcLHpwNQAAAAC/dumb-cat.gif)\n\n**EDIT NUMBER TWO** - [How hard is it to read the rules that pop up on the submit form field?](https://media1.tenor.com/m/vU96w-Kg18IAAAAd/mannifer-read.gif) - Since I posted this the number of [challenged people](https://media1.tenor.com/m/b8M-litPwvYAAAAC/dummy-you-big-idiot.gif) unable to form an actual question in the title of thier post has skyrocketed! [THE BOTS ARE SMARTER THAN YOU!](https://media1.tenor.com/m/zMyGeuAep9oAAAAC/steven-he-language.gif)",
        "num_comments": 242,
        "comments": [
            "Also in response to some of the bullshit going on around here, we recruited a new ~~sucker~~ moderator.\n\nEveryone welcome your new belt-wielding daddy: u/nottalottawisdom",
            "Reported for breaking rule #2",
            "We hate us too bro.",
            "So, instead of 95% of questions being about sex, only 93% from here on out? Okay!",
            "okay but he looked at me yesterday while we were talking, does he like me",
            "How about banning all those self-advertising OnlyFans models with their fake questions?",
            "Typical mod garbage, the title of this post does not contain a question.",
            "“The tuxedo. … a piece of clothing I’m convinced is designed by women.\n\n… ‘men are all the same, might as well dress them all the same.’”\n\n-Jerry Seinfeld\n\nI highlight this because, yeah, people are posting here making the same classic assumption. “Hey, post that to r/askmen. One of those monolithic dummies will answer it for us.”",
            "Is mayonnaise an instrument?",
            "I'd prefer if the moderators were bears",
            ">This is not a sex sub.\n\n>This is not a dating sub.\n\nDoes this mean questions about sex and dating are off-topic?",
            "Wait, who was using this sub to get a date?",
            "\"nearly halfway through the near\"\n\n\nTHE NEAR IS NEAR!!",
            "I have to give props. Compared to some of the other reddit mods on this website. You lot seem to be pretty good at being reasonable mods.",
            "I absolutely ADORE the fact that this sub isn’t the male version of r/askwomen. Let’s please keep it that way ya’ll.",
            ">This is a safe space. Liberal, Conservative, Gay, Straight, Bi, Trans, Cis, Married, Single, Poly, Child-free, parenting, POC, White, Religious, Atheist, whatever...thats all part of the male experience, so it's all valued and all valid.\n\nThe polarization could power the country.",
            "Me everytime I wanted to comment on r/askmen: okay, keep it civil, jusr for this one time!\n\nMods be like: \"GOOD DAY MY GLORIOUS DIPSHITS!\"\n\nNever change!",
            "This really is the best subreddit on this stupid fucking site!",
            "Who pissed in your cheerios! Haha just kidding. I support the message. Only thing missing is to point out those that come on posts to derail the topic at hand with “well women also experience x,y,z”.. stay on topic folks. \n\nGood mod!😂",
            "Hey I'm not really clear on this but I've seen a couple really obvious bots posting questions on here the last few days and I wanted to know if y'all want reports filled out on them and if so do you prefer a specific report?",
            "Oh hi Mod",
            "I do love being treated like a moron!  We are all unique glorious dipshits.\n\nNever change!",
            "I’m old what’s PUA? Is it like Puma? I had Pumas as a kid in the 80s.",
            "Honestly I’d rather go to r/askbears anyway",
            "“We got dudes here” \n\nCan confirm: am dude",
            "What the buggery bollocks is this?",
            "That deserves another drink 🤣",
            "I might be mistaken, but I think the Mods are angry.",
            "Thank you mods!  Was getting ready to leave with all the disgusting anti-woman stuff lately, glad to hear this isn't just a dumping groups for misogynist incel rage.",
            "This was a sassy ass post. Are you sure this isn’t /askwomen?",
            "Hands down the sexiest post to ever be reddited. \n\n[is this love? ](https://i.pinimg.com/originals/27/d6/41/27d64164616600dfbfeec9a641ae5317.jpg)",
            "As a mod in a couple subs that are much less likely to generate controversy than here: I know how much people can take even the most innocuous things and make them into a horror show. \n\nGodspeed.",
            "Holy shit thank you I was gonna say what is happening to the sub? The past month half of the posts are incel bait posts like jesus maybe go outside and women wont hate you",
            "We aren't halfway through the year. July 1st marks 183 in and 183 left. That's halfway.",
            "Honestly, thanks. I’ve been subbed to the AskMen community for years because I like to learn about different perspectives. I even chimed in once in a while when men had questions for the women in this community. I’ve actually grown a lot in my mindset because of you guys 🫶🏼\n\n\n\n\n\nI haven’t browsed reddit lately, so it was really disheartening when the top comments/posts were along the lines of “why can’t women take a joke? Why don’t women hold themselves accountable? Why don’t women like NiCe GuYsssS..?” And comments that made good points but generally disagreed with an OP got downvoted to shit.",
            "Haha The mods think they are spartans",
            "Thanks for this.  I've DEFINITELY noticed a lot of incel type comments and Bitter Barrys on this sub lately.",
            "Damn I wish I could read",
            "Is a hotdog a sandwich?",
            "K but What about fart-related stuff?",
            "My friend wants to know, is it anti-female to say that all women are crazy if I... I mean my friend... genuinely loves crazy chicks?",
            "why am i getting porn types with NSFW pages from this page on my feed?",
            "Now say that to the women.",
            "ok but couldn't you write this post without putting in a reaction gif every other sentence?",
            "How do you have all the right gifs lol",
            "My mans had enough\n\nCan’t blame em",
            "You’re a safe space.",
            "Yes good make sure to keep the hive mind secret. Keep it safe",
            "Just dude things",
            "Okay, jeeeez",
            "Men are not a monolith.... Exactly this! ⬆️⬆️",
            "Damn I love this mod.",
            "Ok motherfucker you wasted my time telling me what it's not  now fucking tell me what it is numbnuts.",
            "thank god its not anti-woman",
            "I knew I liked you guys. 👌🏻",
            "This is the most based moderatorial I have ever read. I'm slightly jealous of your beer buds now, /u/Dealthagar",
            "Cheers!",
            "Since the the Introduction of SMART PHONES I THOUGHT THAT \" TEXTING\" WOULD MAKE PEOPLE NOT WANNA TALK ANYMORE AND I BELIEVE TEXTING IS JUST EASIER TO SAY WHAT YOU WOULDNT VERBALIZE AND NOW TEXTING HAS RUINED VERBAL VOICE OR A NORMAL WALKING PAST A STRANGER IS HEAD DOWN AND NO EYE CONTACT OR GOODMORNING. WHAT HAPPEND TO YOUR VOICE?",
            "This really is the best subreddit on this stupid fucking site!",
            "I reported a bunch of things and you did nothing as per usual. I hope this post comes with a change of stance.",
            "Good mod.",
            "Necessary",
            "So.......how many reports were put in on that post?",
            "All these gifs are like a millennial orgasm from the LiveJournal days.",
            "high school ass mod post",
            "If we aren't a hive mind, then why are you insulting all of us like we all behave this way? I didn't do anything, but you are calling me a dumbfuck. You would never call me that to my face, I would like to see what that looks like\n\nEdit: He banned me. Wasn't even because I broke any rules, he said he just doesn't like me",
            "It's unfortunate how improperly the report button is used.\n\nLike please use it to make offensive content front and center for mods, don't use it because you disagree with the content.",
            "Is there really anything wrong with the PUA stuff? As far as I’m aware, it’s annoying at worst.",
            "I would suck you so hard for this.\n\nI MEAN THANK YOU LORD",
            "This really is the best subreddit on this stupid fucking site!",
            "I'm not reading all that",
            "As a Lady its real sweet to see you all stand up to the women-hating stuff thats been going on. \n\nWe still love and appreciate you too, even if some of us have had enough for now. \n\nWeve got this, Hand in Hand women and men can stand up and make a more peaceful and hate-free World:) cheers to you",
            "Awwww mods are getting mushy on us",
            "Please stop yelling! It's my first day here! T_T",
            "Ahh Thank you soo much!! It's been a rough few weeks in here as a woman. I appreciate everyone's feedback. And I genuinely want good conversation.",
            "[deleted]",
            "This post is inspiring me to make a [Feelings Wheel](https://static1.squarespace.com/static/57b5ef68c534a5cc06edc769/t/5ea76681f6730e409abf228b/1588030494465/Feelings+Wheel.pdf?utm_medium=organic&utm_source=blog&utm_campaign=the-feelings-wheel) out of all gifs.",
            "How do you ask a question? \nI’m a real person \nI’ve had this account for a long time \nI’ve followed this group for a while but just recently joined",
            "Is it safe to ask a question about transgender women here, to get the perspective of men? Not in a hateful way, but an inquisitive way",
            "[deleted]",
            " I  have a genuine inquiry and I THINK it's the kind of question that was initially intended to be asked here, but I'm unsure. Yes, I read the rules but I'm still not fully Recdit savvy. There are so many requirements that I may not fully understand the true purpose of this sub. So I might get downvoted for that reason but here goes.\n\nWhat kind of emotions do men feel when they become a father? What changes inside of you? \n\nFor instance,  my g-son is 33 and he and his wife have 1 son and 3 daughters. 9, 4, 2, and 7 weeks respectfully. He used to cut up with his friends, go tubing down the Guadalupe River in Texas, hunt, camp, etc., He did it all. Once being a bodybuilder. But he put all of that away for the sake of his family.\n\nI watched him morph into fatherhood.  He watched YouTubed videos to learn how to French braid, plait, and ponytail. He does  3 girls hair in the mornings. I've never seem him not change a diaper (even the loaded ones) Or not dress his daughters in the  a.m. or anything else he's been asked to do. And does it happily and willingly. He tucks them in bed at night, he is gentlen and tender with them. \n\nWhat kind of emotional/internal change has he experienced since    becoming a Dad? What  is he feeling? Does he feel a fear or  burden knowing he is looked to to meet their every pysical/emotional needs? \n\nWhat kind of emotions does fatherhood evoke?",
            "Wow that is so much",
            "Now do your job and actually enforce the rules - if the posts suck it’s because the mod team doesn’t do enough.",
            "Best mod team, hands down.",
            "Too long I didn’t read this",
            "How can I make mayonnaise an instrument though?",
            "Good on you",
            "Nice formatting in your post. Yall don't get paid enough  ",
            "Degenerate into something, fool. \n\n\nWe just got tired of doin' what ya told us to do",
            "I love how lovingly hateful you are OP!\n\nThis was a hilarious read I must say and you had me hooked like no book have ever managed!",
            "Thank you, mod team, for seeing the absolute fucking cesspit and actually doing something about it. Hopefully. Good luck moderating all the offending comments.",
            "You sound like a retard so i couldn't get past the title",
            "men are the same gender for a reason my guy",
            "OP, did you learn to make posts from Myspace? Because it's giving me those vibes 😂",
            ">and then other (usually either anti-male or pro-fem) subs using it to buzz around and incite fights\n\nHas this been happening, any examples of it?",
            "less moderation is better",
            "     .~7?7.                                                         \n                                                                                     ^Y5?~~J#7                                                        \n                                                                                   :J5!.    7&:                                                       \n                                                                                  ?G!        BY                                                       \n                                                                                :GY.         !&:                                                      \n                                                                               7G!           .&J                                                      \n                                                                              YP:             BG                                                      \n                                                                             5P.              Y@^                                                     \n                                                                            55         .:     ~@J                                                     \n                                                                           55          7?     .&5                                                     \n                                                                          YP                   G#                                                     \n                                                                         YG. :^:..^~~!!~~:.    J@:                                                    \n                                                                        JG. .!!!!!777!!~~!~    ~@!                                                    \n                                                                       ?B. .!~!!!7!^:::^!7:    :&7                                                    \n                                                                      ~B^       .        ..     BY                                                    \n                                                                   ^^7B^ ^~^~^    ^~^^^~:       GG                                                    \n                                                                 .P5P&^.J~:?^?^  ~J:~Y::J.      5&JJ^                                                 \n                                                                 ?#7#^ .!:~J??.  :!777!~~      !G7:Y#.                                                \n                                                                 J@B~     .7Y^   ?7:::.        ~75!YG                                                 \n                                                                 ?@~      5J!: ~^.Y7            ~J7@!                                                 \n                                                                ^#~       :^~??7!!!:             7&Y                                                  \n                                                               ^B7      :!J5PY~^~~~~:            P&.                                                  \n                                                              :#7    ^JG@@@@@B     P@G?:.        ?#.                                                  \n                                                             .G?    .7JJY55PPP!^^^^J5YJ?^        ~&:                                                  \n                                                             55         .!!!!~~~!!!!^            :&!                                                  \n                                                            Y5             ........              .&Y                                                  \n                                                          .PB.                                   !&B.                                                 \n                                                          Y&&BJ^                              :7G@@#.                                                 \n                                                         JG:^JB&BJ~.                      .~JG&&G7PP                                                  \n                                                       ~5Y.    :7PBB5?~:..:.        .:~7YP#&BY!:  J&.                                                 \n                                                    :?5J^   ^!J5GGB###BPB&@#P5YJY5PBBBBG5?~:      ^@!                                                 \n                                                .^?YY7.   :G@@@@@@&#B##&&##&@@&BP5G#@BY~           YB~                                                \n                                             :!Y5J~.      .?YYYYJJ7!P@@B^  J@&JG&&BPG@@@B.          !P5^                                              \n                                         .^?Y5?^  ^J7              5@@G.   7@@~ .!YB&@@@G.            ~Y5!                                            \n                                      :!YPY7:  .!Y?^          ^7 .G@@P.    5@@!     :~~:                :J5?:                                         \n                                   :?5Y7^.   ^?Y!.            ~7.G@@Y     :&@@^                           .75J^                                       \n                                 !Y5?^     ~YJ~                 Y@&?      ~@&?                            ^!.!PY:                                     \n                               7GY^      :YY^  ^.               :~:        ::                             :!.  75?:                                   \n                             !5J^       ?P~   ~Y.                                           :                    7P?                                  \n                           :55^       .PY.                                                 .5P!                   .JP~                                \n                          ^G7         PY                             ~!                     ^755^                   ^PY                               \n                         ^#!         !B                              !~                        ~GY.                   YG:                             \n                        :B7          ?G               ..                                        .5G~                   ?B:                            \n                        P5 ?J        ^&^            .?JY^                                         7#?                   Y5                            \n                       ^&~ ??       ~5#G~.          ~777:                                          :GP:                 .#^                           \n                       :&!       :7Y5!.:7YJ7~:.                ::                                    JB7                 5Y                           \n                        7G!::^!?YJ~:      .^7?JJJ7!^:.         ~^                                     ^PG~     :.        J#                           \n                         :?J?7!^.              .:^!7JJJJ?7!~^:.                               ..:!??5PGB&&P:   Y7        J#                           \n                                                       .^~!77?JJJJJJJJ??777!!7!7!!!7777???JJYY5555Y??7~^.:JBY:           GG                           \n                                                                 ....:^^^~~~~~^^^^^^^^^^^::...             :JG5!^:.....:?&~                           \n                                                                                                             .!??77!!!7??:  \n\nwho you calling a pinhead?",
            "Frankly the moderators are the worst.",
            "[New Mod Stance Activated](https://media1.tenor.com/m/OHaUVoCineEAAAAC/belted-belt.gif)",
            "Self loathing is part of the experience.",
            "Why all men do thing?!?",
            "[New Mod Stance Activated](https://media1.tenor.com/m/OHaUVoCineEAAAAC/belted-belt.gif)",
            "The ones the filter catches, we do.  PM a link to the mods when they post, and we'll ban 'em.",
            "Yeah those are out of control here lately.",
            "For real! I'm out like $300",
            "[Oh you...](https://media1.tenor.com/m/MrhME3n9Z2UAAAAC/dungeong.gif)",
            "Yeah.  We also got a couple people trolling, purposely trying to get bad behavior to surface, and then posting it in anti-men subs saying \"See! See! They all hate women!\"\n\nI'm just fucking done with it.  We're at the point where 7 day and 28 day bans aren't making the point they need to.\n\nPerma bans from this point forward",
            "[I will beat you to death with a used, unwashed sex toy.](https://media1.tenor.com/m/XS4RFFT9SmoAAAAC/angry-girl.gif)",
            "r/AskBears",
            "Would you rather meet a bear or mod in the woods? ",
            "I’m way too gay for all the bear discourse. It doesn’t help that I tend to like bears (not the animal, for those who aren’t familiar with the lingo).",
            "Sex questions are mostly forbidden - I can think of some very clinical \"I have a dick and don't know how to make babies\" type questions that might be okay.\n\nDating specific advice - if it manages to get past the filter and nobody complains, it's fine.  If the filter catches it or we see a flurry of reports - Godspeed.",
            "That depends.  are you single and in my area?  what's your OF?",
            "You guys go on dates?",
            "Edibles kicking in early.",
            "Oh Great!!  Now you did it!!  They going to get swelled heads & egos now!! Worse, they might start expecting to get paid more than just the cheeto dust at the bottom of the bags!!!",
            "/ask?  I got banned for paraphrasing a Jewish poem by a Jewish poet.  Before the Palestine flare up.",
            "This comment has been removed for derailing.",
            "This all day every day. As long as it doesn't become that absurd nightmare idgaf but traffic policing minor points of contention is for trade negotiations and the United Nations.",
            "This comment was removed for misogynistic content",
            "Thank ya!",
            "[Hmm](https://media1.tenor.com/m/uATlxJ4eqLsAAAAC/tommy-wiseau-oh-hi-mark.gif)",
            "Pick Up Artist.\n\nApparently we old dudes general tactic of TALKING TO A GIRL doesn't work anymore.",
            "Cheers mate",
            "[Mods right now](https://media1.tenor.com/m/dZlofpbeULIAAAAC/monica-friends.gif)",
            "BTW: I love it.  I'm going to use \"Godspeed\" in every post where I ban someone.  It just feels so....good.",
            "There is controversy on this sub, lol where?",
            "It’s honestly not often we see a woman on Reddit with reasonable viewpoints… but when we do, it’s usually in r/AskMen",
            "Not sure but also a question I’ve had was at what point does a taco become a burrito and no longer a taco?",
            "It is 4 in the afternoon where I am, and it's all I've been doing for the last 3 hours, because some [fucking neckbeards](https://media1.tenor.com/m/9Xe8U0YWZOsAAAAC/geek-loser.gif) decided to engage in some bullshit.",
            "but then you wouldn't understand the depths I feel this, because we're men and we're not in touch with our feelings and we have to respond with funny pictures so that you know I'm working on pretending to feel anything.",
            "Hey why don’t you shut yer mouth and just appreciate the effort, huh dipstick?",
            "How bout you shut yer damn mouth and appreciate the effort. Jesus Hector Christ everyone’s a critic. \n\nI bet you eat your popcorn with a spoon at the movies don’t you?",
            "We are all a safe space on this blessed day",
            "I didn't see you in our weekly global man meet up last week.....\n\nIs your magical portal not working right now?\n\nDo you want me to contact a portal technician to check it out for you?",
            "Thank you.",
            "A single report flags it but doesn't message us to look at it.\n\nIf you send us a link to the post and say \"Hey, you guys should look at this motherplucker here\" then we will.",
            "Because I can.\n\nAnd no, I would.  I absolutely would.  Just ask my kids.  I don't even remember their actual names,  i just refer to them as Hapless and Hopeless. Me and my friends, we don't use names we just point at each other and yell \"Hey, dumbfuck!\"\n\nSo yeah...it works.\n\nEDIT: Yes I did.  At least the blessing that is the rest of this thread will live on in the FAQ when this post rotates out in 3 months.",
            "The number of people who don't know the difference between offensive and content they disagree with is extremely high.",
            "At best, it's scam bullshit mixed with generic good advice. At worst, it's misogynistic and exploitative. \n\nI get a lot of guys weren't supported in learning how to navigate dating, but any framework that includes stuff like negging shouldn't be supported.",
            "Uh, no. Having met one or two guys who would call themselves Pick up artist, i can 100% confirm that i Was actually scared of them. They are exactly the reason why coersion is grape. \n\nLadies: its Keys, phone, wallet, pepper spray. Be safe out there",
            "We know",
            "pick up artists, me thinks.",
            "Certainly!",
            "/r/sex \n\n/r/relationship_advice \n\n/r/DeadBedrooms \n\nLots, depending on your issue.",
            "So post it as a question. I'm not sure why you would post it as a reply here .",
            "[No.  I am not linking it, reposting it, or raising its zombie fucking corpse.](https://media1.tenor.com/m/v8dJAMILdvcAAAAC/tom-hardy-mad-max.gif)\n\nJust...if you see shit, report it.",
            "[deleted]",
            "Oh come on yall don't wear belts. Reddit mods don't stand up. Just the fused-on pair of cargo shorts.",
            "Don't threaten me with a good time",
            "I thought it was one the requirements of being a Man!!",
            "And if you say you don't do that thing. Then you're a liar because [here](https://youtu.be/dQw4w9WgXcQ?si=Ex0MDeFY0Y49WkGs) is a stat I found online that proves you actually all do that thing.",
            "Why do all men both inhale AND exhale?",
            "[You can do it! You can do the ting!](https://streamable.com/99i8m)",
            "I'll do you one better, been seeing some \"why women do thing?\"",
            "Because *thing* make man do thing.",
            "I'm an attractive woman with abs a a big booty. Why no one say hello at gym?",
            "Will do.",
            "[deleted]",
            "But,  I don't hate Women. I pretty much hate All Humans!!! Especially the noisy ones!!",
            "Why invest any fucks in them? Nothing is going to change their minds. Let them occupy each other in their hateful little morsel in their hateful little corner of the internet & they will have less reason to leave & bother people.\n\nIf they do illicit some genuinely unfair or unreasonable it's a good opportunity to reasonable people to challenge & correct it for the people here who still have minds to change.",
            "Don't you threaten us with a good time!",
            "[deleted]",
            "thank you 🙏🙏",
            "[Hmm](https://media1.tenor.com/m/5sCFA2DknUUAAAAC/jesus-honey1902.gif)",
            "I choose the Bear!!  It at least comes out of its cave, & washes regularly!!",
            "That got me a genuine laugh",
            "🤣",
            "And theyre kicking in extra hard today, he might have grabbed the wrong cookies for a snack",
            "Seriously, the hardest working mods on the planet and it’s totally unnecessary.",
            "As a girl: guaranteed if you ever had a chance, it only increases if we can talk and be relaxed about it. Conversation ^ = Sexappeal ^\n\nAnd once we have talked, i suggest flowers ;)",
            "Oh wow when I hear that phrase I think of some 70s guy in a jumpsuit with his chest open who I think was a background character on threes company. I thought pick up artists were out of date, but I guess I’m the one who’s out of date.",
            "Is this your way of asking for help to hide the evidence? \n\nJust remember, without a body its only a missing persons case, not murder!!",
            "\"You have been permanently banned from the subreddit for [insert rule]. You will still be able to view posts on the subreddit, but will no longer be able to make posts or comments.\n\nWe wish you the best of luck in your future endeavors. Godspeed.\"",
            "God speed, or God Yeet!!!!",
            "I had actually left r/AskWomen because it is *rife* with toxicity and unreasonable viewpoints. So when I came back to see what was up with one of my favorite subs, it was a little disappointing to see that it was slowly becoming like its counterpart. Incels and femcels.",
            "Gas stations started that taco/burrito bs, though I kinda like it",
            "/bestof",
            "I've got a ticket in but I think they're backed up at the moment :( Do you have some contacts with management?",
            "There is no way that is true, you absolutely would not call me a dumbfuck to my face\n\nI don't care how little you respect your friends, family and children, I am talking about how you treat strangers. Especially scary ones that can rip you in half",
            "Sure, I agree on that. But dating advice still shouldn’t be totally removed. Granted, I think I might have had the wrong definition of PUA.",
            "Great thank you",
            "But not about trans women in sports? I didn’t see anything about it in rules or FAQ’s",
            "Thanks, you're right. Now comes the *excuse*. \n\nI'm really trying to find my Reddit \"legs*.\n\n I've been scrutinizing so many r/ new NewToReddit, Guide to Reddit, the \"Handbook of Reddit and on so much that my brain is numb. \n\nI thought I WAS making  a post!! :D",
            "*looks down at his jorts*\n\n\nWell....fuuuuuuuucccccck",
            "I'd they take it off for once can you stand them upright thanks to the cum infusion XD",
            "I assumed they wore capes",
            "Any human who's never experienced self loathing needs to learn how to reflect, probably",
            "FUCK, YOU GOT ME",
            "I knew it was coming and I still fucking clicked",
            "I think i just fell in love XD",
            "Jokes on you, an ad played the second I clicked the link. \n\nOoooh You almost had it. \n\nGotta be quicker than that.",
            "Me fr",
            "[deleted]",
            "Can't be misogynist/racist if you hate everyone equally\n\n*taps forehead*",
            "That sounds like a generalization.    All humans are NOT the same, and can NOT be painted with one brush!    \n\nYou're already on this ice,. buddy.",
            "No, you're in the left line.",
            "Girlscout cookie edibles man, can't just have one",
            "Haha I like your poin- [User was banned for breathing the same air as a mod]",
            "Unless you admit. Remember: so long as you keep your mouth shut, they need to nail that ish 100% beyond any reasonable doubt. Youll only make it easier for them if you talk",
            "🤣🤣🤣 God Yeet!!",
            "Yeah there were some people doing allat BS. I noticed they weren’t regular users in the sub. Typically those posts or comments came from some young ass account or an account that wasn’t joined into the sub for very long. \n\nThe regular users of the sub tend to not put up with it very well. But I’ve also noticed that a lot of us, myself included, would just not acknowledge it, and leave it where it was. Which is also a problem. \n\nI’m hoping this admin post helps get the point across.",
            "Wait I’m not familiar. You’ll have to fill me in on what you mean. Lol",
            "It's hard to get to the management but I try my best.",
            "Probably just need some more fiber. \n\n(Cause it's always \"... you just need [insert overly simplistic and dismissive thing here]...\")",
            "LOL",
            "> Especially scary ones that can rip you in half\n\nOh my gosh!  Are you an Alpha male?  Do you run with the wolves?  Are you like, one of those, paleo males that doesn't cotton to modern standards and makes sure his woman knows her place?.\n\n**Son**, you are literally one of the first pack of dumbfucks I would call out to their face. I've done it before, I'll do it again, I've done it for most of my 55 years.  I've done it on multiple continents, wearing multiple uniforms and colors.\n\nSince we're here on AskMen, here's a piece of advice.\n\nThe first clue of an **actual** confident, strong, self-determined man, is that he isn't threatened by hypothetical words on the internet.  Grow the fuck up.",
            "As long as they're not fused to your skin there's still time",
            "Now I have skin pockets. Thanks.",
            "Hmm interesting",
            "I always check for the dQw before I click links on reddit, but sometimes I click it anyway because it's a good song",
            "Same.",
            "Wow, you're touchy lol",
            "It’s specist",
            "Found another noisy one!!",
            "Phrasing here could have extremely different meanings.",
            "Midwest Gas stations serve hot food and every time you order a “taco” it’s rolled burrito style and wrapped in foil. Same toppings and everything they just like to wrap and roll. I guess it makes the prep work easier. The shell to meat ratio is where I get upset. Too much tortilla that way.",
            "Hypotheticals be scary tho",
            "It isn't hypothetical, I know from my 37 years that healthy adults don't go around behaving like you are. I am not an alpha male, but I am a male you wouldn't call a dumbfuck if you saw me, I am confident of that. \n\nYou talk about what I am willing to say behind my keyboard when all I am doing is pointing out that you are only saying what you are saying because *you* are behind a keyboard. I am not threatened, I am insulted and compelled to point out that you would never behave this way outside of this environment where you have all of the control. \n\nI don't even think this is the first time I have pointed this out to you when you have thrown one of these man-baby temper tantrums. \n\nIve been around the world a few times too and nobody that met me ever called me a dumbfuck for something I never even did because in the real world people don't behave like you are and stay healthy. I am not some machismo gym bro wife beater here, just a full grown man that you would never call a dumbfuck to his face. \n\nI don't appreciate how you handled this post. I don't find it amusing. I find it unprofessional and disappointing because you control this sub and you have all the control to get away with this behavior and every one has no choice but to sit there and take it. All I can do here is point out that you would never behave this way in the real world, that is just a fact. The fact you made it over the hill is proof you know this too.\n\nedit: you should un-ban me so that I can reply. Not even sure which rule I broke. I guess hurting your feelings is against the rules",
            "But they're soooooooo comfy.",
            "I reFUSE",
            "Misanthropist?",
            "I've lost track of how many girl scouts I've eaten.",
            "Ahh ok. Damn I’m going to the wrong Midwest stations dude. I’m  in Minnesota and have lived in Wisconsin as well and haven’t ever had prepped hot food. Just the usual shit under heat lamps. But yes absolutely the sheer amount of tortilla layers can fuckin ruin an otherwise decent whatever we’re calling it.",
            "So...here's the thing.  The original post is part of an ongoing joke as part of this sub.  An ongoing joke that's been around for 10+ years.\n\nEvery other person here gets the joke.  You're the one **dumbfuck** that doesn't.  Obviously, this isn't the space for you. Godspeed.",
            "Dumbfuck.",
            "Lol dude wow",
            "... I.... I thought your original comment was an attempt at satire. If it was, kudos. You got me. \n\nIf it wasn't.... 😬",
            "https://youtu.be/Nbb1OQohuMQ?si=cAokotOxF5Waxec8",
            "Rural Missouri but I’m from eastern Illinois. Both have good spots that are private owned/ local. \nQuestionable outside/ building wise, sure. Good food though.\nI am now questioning how often I go to gas stations for gas versus the snacks. Haha.\nStreet taco size tortillas are the way!",
            ">Godspeed\n\nHE SAID THE THING I'VE ALMOST READ THE ENTIRE THREAD OF COMMENTS AND HE SAID THE THING🥳🎈🎈🎈🎇🎉",
            "[I need an adult.](https://media1.tenor.com/m/a-0kwizK-owAAAAd/tfs-vegeta.gif)",
            "I was hoping this was coming too. \n\nLook at how much our boy has grown 😩",
            "I was hoping this was coming too. \n\nLook at how much our boy has grown 😩",
            "I was hoping this was coming too. \n\nLook at how much our boy has grown 😩",
            "I was hoping this was coming too. \n\nLook at how much our boy has grown 😩"
        ]
    },
    "Gamer men, of all the games you've played, which game have you spent the most hours playing?": {
        "title": "Gamer men, of all the games you've played, which game have you spent the most hours playing?",
        "score": 218,
        "url": "https://www.reddit.com/r/AskMen/comments/1dlou53/gamer_men_of_all_the_games_youve_played_which/",
        "content": "I love playing Gta, and spent maybe 1 year",
        "num_comments": 661,
        "comments": [
            "WoW of course",
            "Dota2, I have wayyy to many hours in it than average",
            "I don’t think any game will ever pass the amount of hours I spent on WOW.",
            "Fallout New Vegas",
            "Witcher 3 I think",
            "Ark...sadly.",
            "Destiny 2 got me in a chokehold",
            "Rdr 2. Almost 2 years.",
            "Chess",
            "Minecraft",
            "CS:GO played it from 2013 to 2018.",
            "Overwatch and then Rocket league, distant 3rd is Smite",
            "Skyrim",
            "The Destiny franchise.  Got into it as a D1 founder in 2014 and still play today. Multiple consoles, every DLC for both games, thousands of hours.",
            "Probably Skyrim.",
            "With these women bro :(\n\nSeriously fallout 4",
            "Europa Universalis IV have about a thousand hours on it.\nStill not very good at it either 😞",
            "For me its COD5 World at War back in 2009.",
            "DotA, maybe 20k",
            "EvE online",
            "Fallout 4",
            "Warframe",
            "Dota 2 . It iosn't even close",
            "GtaV",
            "Probably Dead by Daylight overall",
            "Gonna give credit to Steam, since it kept record of my playtime of DotA2 over 4000 hours during my childhood and university life.\n\n\nOtherwise, I guess whole franchise of Monster Hunter are coming close; since I played in various devices; PSP, Nintendo 3DS, Nintendo Switch, PC and latest Steam Deck.",
            "Rocket league",
            "Diablo 2, Diablo 3, Diablo 4 , counter strike, starcraft and F123",
            "Half Life by a distance !",
            "Minecraft, the time i spent on skywars Is... I think you get the point",
            "Battlefield 4 and GTA online",
            "Runescape and Rocket League",
            "Fallout, Gran Turismo, and Red Dead Redemption",
            "BotW!",
            "Need for speed most wanted! nostalgia man!",
            "World of Warcrack \n\nIt has enthralled my thoughts since 2004 and even through 3 kids and having very little time to play. I still sneak it in :). No other game has ever been the same for me.",
            "DoTA",
            "All of the From Software Souls-like games.\n\n...and I have the bald spots to prove it.",
            "Bioshock",
            "Call of Duty: Black Ops\nPlayed casual clan v clan matches back in the day. Still come back from time to time. \nGood times",
            "I played GTA V online for 1014 hours\nNeed for speed Payback for 40+ hours",
            "Path of Exile",
            "Overwatch. Between 2-3k",
            "*8750 hours???*   \nI think it is Minecraft 816 hours  \nThen rocket league is close second at like 809",
            "Rust and WoW",
            "Fifa 🤷‍♂️",
            "Open worlders:\n\nJust cause\n\nGhost recon Wildlands \n\nDivision 2",
            "lineage2 and oldschool runescape",
            "The sims. Probably have close to 600hrs on sims 4 alone",
            "Unfortunately league of legends\n\nBut hey, i'm clean now lol (spent like prolly 5k hours in 3-4 years)",
            "fifa, i hate it and i still play im too good to quit",
            "Skyrim",
            "Top3:\n\nWow \n\nRuneScape\n\nLeague of legends \n\nThe boomer trifecta",
            "Cod or gta",
            "gta 5 or minecraft. i’ve got 11k hours in gta 5 and i’ve been playing minecraft since 2011",
            "Don't even have a number but it's probably Wolfenstein: Enemy Territory. I played that for over a decade, with interruptions. I played semi professionally and did clan server IT and board admin. I was godlike.",
            "Most hours - Seige and CS2. \nHours spent having fun - 0",
            "Sadly, Call of Duty.",
            "Hell let loose, Warframe, surviving mars.",
            "Euro truck simulator 2",
            "2360 hours into GTA Online since 2013",
            "Either Hearts of iron 4 or Rainbow Six Siege but as a franchise FIFA/FC24 by far",
            "I've got 2000 plus on Ghost Recon Woodlands.\n\nCome check out the sub!!!",
            "This game called The Finals. I don't usually like FPS's but I feel like it clicks with people who have adhd for some reason. Never played a game for this many hours ever. 300+ atm.",
            "Elite Dangerous",
            "Age of Empires I, II, III - without any doubt!",
            "Valheim",
            "Rainbow 6 siege",
            "I barely played many games when I got older, but I spent a lot of time playing metal gear solid games.",
            "Rocket League. Roughly 20,000 hours",
            "Sadly, Rocket League and Apex Legends. Not proud",
            "Can I call myself a “gamer” if I only play like 4 games repeatedly? - Rocket League, Minecraft, Rimworld, EVE: Online",
            "THPS",
            "Halo 3, Rust.",
            "Metal gear solid, No mans sky, fallout 4.",
            "HOI4.  Hands down my most played game.",
            "Valorant",
            "Hmmm. Either World of Warcraft or Counter-Strike: Source.",
            "Man I've probably sunk more time into \"World of Warcraft\" than I care to admit.",
            "Supreme Commander Forged Alliance",
            "MLBB",
            "Overwatch, then Overwatch 2",
            "I think I have 2100 hours in ark. Definitely my highest count as fast as steam is concerned. I've probably played eso for longer though, just can't tell cause Playstation doesn't track that as far as I know.",
            "The Witcher 3 has stolen 2000 hours from me… no regrets",
            "Ok not counting WoW which I spent entirely too much time on, probably Total War: Warhammer.\n\n\nIt's just such a nice game. Strategy, RTS, cool factor, modern edge, it's all there.\n\n\nIt's not like that's the only game I play but I come back to it again and again reliably often for new campaigns.\n\n\nThe hotseat multiplayer for TWWH3 is also epic.",
            "War thunder, i gave my soul to the snail, not anymore tho, i'm clean.",
            "Overwatch 1. I played it almost everyday from Season 2 to Season 7 at which point I dropped it. Had a few thousand hours in the game and was trying to maintain a decent Diamond ranking, but solo queuing was a struggle as a tank when your dps are a mixed bag. It is why I hated forced role queues cause at least before you could switch off to dps and pop off when they don't do their job.",
            "WoW, Oblivion, Stronghold Crusader (og)",
            "star trek online. daily since beta. 2009",
            "Probably Dragon Ball FighterZ. Discounting Smash Bros., its the first fighting game I took seriously and tried to get good at.",
            "Not a bloke but TC’s Ghost Recon",
            "According to my steam - Baldurs Gate 3. \n\nIf we count mobile games - probably Mobile Legends",
            "Use to be Gears of War now it's Apex Legends",
            "either GTA V or Valorant",
            "Definitely Tarkov. I have almost 2000 hours",
            "Counter Strike, no super crazy hours but more than is probably deemed sane.",
            "GTAO",
            "GTA San Andreas",
            "11k on Warframe.   \nClosing in 7k on dota.  \nGw2 is convoluted on hours but I've been playing it for over a decade.",
            "Minecraft, Satisfactory or Space Engineers",
            "r/GTAV and r/celestegame are probably my most played",
            "It is close between smite and elder scrolls online",
            "I spent almost 1000 hours playing witcher 3. That’s the most in any game",
            "Minecraft probably, but the hours aren't logged. For logged hours it would be a tie between Terraria (modded and vanilla) and Dead By Daylight.",
            "Somewhere between Warcraft 3, Civilization 4 + 5 and Skyrim.",
            "Cyberpunk 2077\n\nI mostly stop playing once the game is over but recently I'm stuck on Cyberpunk. Even after doing multiple endings I can't put the game down. It's also the game i've spent most hours.",
            "My (54f) partner (54m) plays Skyrim…..he says that he has already finished the game like 3x I believe",
            "I played a lot of wow before I gave up on it.\n\nI've moved to FFXIV and steam says I have 850 hours on that. So probably that? Given I don't have a figure for any of the other games I used to play regularly.",
            "Stellaris - 1400 hours, I need to not game as much haha",
            "Rainbow Six Siege \nHalo Infinite\nSession",
            "Rimworld. Closing in on 1000 hours.",
            "Planetside 2",
            "WoW,  up until I was 22, and since then Terraria",
            "Counter Strike Source Zombie Mod.  Aside from that, Skyrim took a huge chunk of my life.",
            "Assassin's Creed Ezio\nDays Gone",
            "First Dota2, then Rust",
            "Might be bg3.",
            "I don't really game anymore, but probably Team Fortress 2 when I did.  \nOn the other hand, i've come back to Doom 2 and Unreal Tournament so many times over 20-25 years that it could be one of those, it's just hard to figure out how many hours when it's a constant start and stop over such a long time.",
            "League of Legends. I played for about 4 years everyday.\n\nMonster Rancher 2.\n\nOblivion. Did about 4 playthroughs with different builds. I think my total playtime is 400 hours.",
            "OSRS, but haven't touched it in a few years, checked back recently and shet been hacked and turned into a bot, secured the account but that was it. Recently FFXIV,  150hr into HD2, 7 days to die, and magic craft.",
            "Destiny 2",
            "Probably RuneScape in my younger years",
            "Wow ( by a mile )\nUnreal Tournament ( 1999 and lan parties)\nFactorio",
            "warframe",
            "Warframe.. at 800 hours rn",
            "Star Wars: Dash Rendar. Nintendo 64",
            "WoW, followed by EQ and then COD franchise.\n\nWish I could find a game that i’m into now though! I can’t find one i’m interested in these days.",
            "Squad",
            "I think Dead by Daylight (> 1000 hours) is still my most played game, closely followed by Red Dead Redemption 2 (should be around 1000 hours by now).",
            "Top 3 \n\n1.DotA\n2.WoW\n3. Every Fallout game combined",
            "Civilization 5",
            "Euro Truck Simulator 2",
            "Ultima V for PC, when it came. I draw ours and ours of maps and translated texts. The feeling of being there has never been the same after even if the graphics are ridiculous when compared today. I am the Avatar!",
            "I used to play a lot of the Unreal Tournaments and AoE on my teens, I didnt have a counter, but I guess that over a 1000 hours in the UT franchize.\n\nNow Im over 1100 hours on Rimworld, and counting ;)",
            "Probably Guild Wars. Followed closely by Titanfall 2",
            "GTA 5",
            "osu!",
            "Would defs have been either San Andreas, Skyrim or Starcraft 2. Can't remember which exactly but spent a hell of a lot more time on these games than any other",
            "League of Legends or the entirety of Call of Duty because I’ve been playing since Cod4 and season 4 respectively.",
            "Rainbow Six Siege. I have over 3000h and still suck haha",
            "I think simcity 3000 / AoE II/III",
            "WoW, hands down. The second place is a lot more difficult to place, but probably Civilization 2.",
            "World of Warcraft. Although, I did stop playing.",
            "Rainbow Six 3.\n\nThousands.",
            "Elden ring 300+ hours",
            "GTA",
            "Csgo.\n. 2700 hours",
            "I can't give exact numbers from my PS2 era but I think GTA San Andreas must easily be in the top 3. I was like addicted to it. Never got 100 % of it but it was just so fun I couldn't get enough of it.\n\nBut according to Steam, I've spent ~1000 hours with it. I love it.",
            "Warhammer total war",
            "This is going to sound lame, but I have 4657.8 hours on Garry's Mod.",
            "FFXIV probably but I’m not exactly happy about that. Second place goes to with Cyberpunk or Elden Ring with Fallout New Vegas being 4th",
            "Overwatch and Dead by Daylight for me. I have a strange love-hate relationship with the two of them.",
            "MW2 S&D",
            "Vanilla WoW",
            "It's a toss up between Halo 2/3, Morrowind, Left 4 Dead 2 and DayZ.",
            "Probably zelda tears of the kingdom or stardew valley",
            "Skyrim\n\nIt’s so easy to get lost and mentally think you’re a badass Viking for a few hours",
            "Terraria, I still haven't played the last 2 updates though.",
            "Elden Ring, around 700 hours",
            "Probably \"A feast for Odin\". Or maybe \"Carcassonne\" I guess",
            "First game was Tom Clancy's Ghost Recon Future Soldier. \nNow i play Battlefield 1 all the time.",
            "I have some 10 000+ hours in Skyrim.",
            "Battlefield 3",
            "Path of exile. About 6.2k. Trade, mapping, still amateur.",
            "AC2 and gta5",
            "Grand theft auto: Vice city, The Elder Scrolls 4: Oblivion, Gothic 2.\nOldSchool gamers✊🏻✊🏻✊🏻",
            "Stellaris",
            "A series more than a single game: Diablo. \n\nHave been playing Diablo since the first one. Spent the most time in Diablo 2 - 24 years and counting.",
            "Stellaris, 4.5k hours on steam",
            "easily minecraft",
            "Tabletop rpg 3.5/PF1e.",
            "1st WoW 2nd League of Legends and 3rd most played would be Total War Warhammer trilogy. Don’t play games as much these days.",
            "Pretty sure I have about 500 hours put into NHL '94.",
            "R6 along with RDR2",
            "Age of empires",
            "Halo 2 MCC\nHeroes of Newerth (in its heyday)",
            "Destiny for me",
            "Witcher 3 or Rome II Total War",
            "Destiny",
            "Either Battlefield or Destiny",
            "Runescape on and off for about 16 years, I dread to think what my total playtime is across all my accounts over the years. Lots in the halo/gears of war series also - easily 10k hours in halo reach and close to that in gears of war 3",
            "Split between socom 2, tekken 3 and , dynasty warriors 4",
            "Franchise? Pokémon. Game? Pokémon Leafgreen. It isn't even a close contest to the days upon days upon days I played SW:Battlefront (from Pandemic Studios) with a friend growing up - which would be #2. Skyrim... I need to check my hours in Skyrim. 100%ing that one was very time-consuming, as was levelling to 147. Rocket League is getting up there, but I only play with the crew now - too much toxicity and unpredictability in teammates. If I could count all the hours spent playing Super Smash Bros. as a franchise, that would also be up there - as would my Zelda playthroughs or my Mario Party shenanigans. After that, we start hitting the less than 200 hours mark. And somehow, I still managed to read 25 books every 3 weeks and go back to the library for another set. Older me wonders how.",
            "Diablo 2, and D2R",
            "War thunder with 4,5k hours",
            "Total War Warhammer",
            "I had to quit WOW BECAUSE of the time commitment. If I wanted a life, and a wife, I had to give up my mage.  I still miss it.",
            "I've played FFXI and XIV, so one of those.",
            "Cyberpunk 2077, God of war. Elden ring and nfs",
            "DayZ, by a very decent margin",
            "# r/KerbalSpaceProgram\n5000+ hours and counting!",
            "Fallout 3",
            "GTAV of course and RDR2 easily. Gran Turismo as well",
            "Swtor maybe, i've played 4 classes stories, i also had fun with Stellaris when my pc was shitty. If you consider Pokemon and Mario different games with their hours together, probably a lot as well.",
            "CSGO by a loooong shot",
            "apparently I've played 1.901 hours of csgo",
            "The entire Animal Crossing series. I’ve bought every one and spent the most hours on all of them almost equally just zoning out and running virtual errands.",
            "Rocket League, Smite and GTA V online. I started playing Valorant 3 days ago and i feel like it will be one of my most played game in a few",
            "Well, I played Planetarion in late 90s. \nIt's still going with similar format as then. Bound to be some folk still playing I think triple digit season.",
            "Fallout 4 I reckon, you can rack up the hours just building settlements. Could also be Fallout 3, Skyrim, RDR2, or Breath of the Wild.",
            "counterstrike. its been 24years",
            "Terraria",
            "Rdr2. I spent so many nights just riding around, watching the animals. Hunting, fishing, dispensing some justice.",
            "DotA2",
            "Counter strike 4k hours",
            "DayZ (the mod), minecraft, arma, dcs",
            "Either pubg or apex legends but I do think it's AL at this point. Fuck video games though get fresh air and have some genuine human to human contact as life has intended",
            "Destiny 2",
            "Runescape then destiny. Playing runescape for nearly 20 years now. Been playing destiny since day 1.",
            "**Guild Wars** occupied a couple of years of my life",
            "As a teen I lived in Runescape every school break from when I woke up until I slept",
            "Tera! The combat was extremely good. Smart thinking and skills.\n\nUnfortunately it kept dying slowly and they made dumb changes in the game. Don’t fix something that’s good! Will cherish that game in my memory",
            "Minecraft by far",
            "Surprisingly Pokemon Violet. Sunk a lot of hours into BotW, even more into TotK, but with rental teams making entry into the competitive online ladder for a casual player accessible, I've sunk 600+ hours into Violet over the last 2y grabbing random teams from YouTube. \n\nHighest rank ever was 200ish (never climbed those heights again :() but so easy to jump in for a few games and it's satisfying like chess with the strategy involved in VGC doubles.\n\nGame is still buggy af though, the company has the money to make the game truly incredible but it is what it is.",
            "DayZ and Elite Dangerous.",
            "Ken Griffey Jr.’s Major League Baseball on N64",
            "COC",
            "I think definitely FIFA, followed by Valorant I guess",
            "Overwatch unfortunately",
            "League of Legends, played since mid 2012 to today.",
            "Assetto corsa, with satisfactory a close second.",
            "Either minecraft or dota 2\n\nOn dota i have 4146 hours but idk about minecraft",
            "I put 800hrs into “Deceit” before the devs fucked the game up.",
            "PubG.\n\nCan't seem to shake it.",
            "RuneScape, 45k hours.",
            "Longest of all time? RuneScape. I've been playing that shit since like 2007 on and off, and easily have over 200 days of time logged in (95% of it was before I turned 18).\n\nMore recently though, I've been looking at games from the perspective of how much I enjoy them when I play them, regardless of how many hours I've been playing them. The ones that make it to the top of that list are The Witcher 3, Control, Horizon Zero Dawn, Banished, and Cities Skylines 2.",
            "Wow\n\nLol\n\nRust\n\nHoi4",
            "Uhhh yeah...  WoW",
            "Gears of war 1",
            "Diablo 3- PC, Xbox, and the Switch.",
            "Dark souls 3, nioh,call of duty ww2 and wwe2k19 my fav games",
            "Civ 5",
            "Counter strike. \n\nI officially have 3K hours in CS2, but i only started playing that a couple of years ago, after a long break. Probably have even more hours in Source and in 1.6, but that was way before steam started to to collect data.",
            "Baldurs Gate 3. 800 hours.",
            "DayZ",
            "Red Alert 2",
            "7 days / Ark / Conan and catching them fast is Helldivers",
            "Skyrim, definitely. I still feel like I haven’t finished it entirely after all of these years and think I still won’t even after I’m long gone",
            "Resident evil 4, I played it on almost every system, PS2, Gamecube, android, Ps3, Xbox360, XB1, PS4, PS5, Nintendo switch, PC (steam and the original version) Wii, Wii U, gamepass on PC etc etc. i’m 20 so my journey started early with this lol",
            "Coc",
            "Wow, TLOZ, The Sims",
            "Don't judge me but it's probably Runescape...\nWoW was too expensive so never got into it 🥲",
            "Minecraft, followed by DK64",
            "Starsiege Tribes",
            "There's this cool game called India Alpha Mike Golf Oscar India November Golf Tango Oscar Kilo India India Lima Mike Yankee Sierra Echo Lima Foxtrot",
            "CoD2, WoW, BF3, FFXIV, TESO and EFT. More than 5.000 hours in each of these.",
            "CS Source. About 3100 hours over the last 16 years.",
            "Destiny 2. Got over 4000 hours in it.",
            "Rocket League, with MW2 and Black Ops 1 closely tied for 2nd place.",
            "Runescape. It's probably about 17,000+ hours over the past 18 or so years.",
            "Europa universalis 4.",
            "call of duty",
            "Nothing will come close to World of Warcraft for this.\n\nBut if we’re talking single player games: probably Dragon Age: Origins.",
            "League… And I‘m not happy 'bout it.",
            "Halo! I’ve got way more than 10,000 matches under my belt and my gamer tag is on the halo wall of fame.",
            "Civilisation in its many guises.",
            "Rocket league. I think I have almost 2k. \n\nHowever, it will be THE FINALS because im addicted to it more so than any game I’ve played in a long time.",
            "Asherons Call",
            "R6S. Or Ratchet and Clank 3 (PS2) I played it every day for 3 years!",
            "Most likely Minecraft. Been playing since Beta in 2011. I go through phases where I play absurd hours, then burnout and play other things, before eventually coming back to it.\n\nAfter Minecraft, it's probably Skyrim and Halo 1/CE. If you count hours spent modding and not just playing, Skyrim wins by a mile.",
            "I put about 2700 hours into smite. No other game has come close",
            "Apparently my top 3 are GTA Online (which I've now retired), Elden Ring which I love and Spider-Man (all 3).",
            "Rust. Back in 2016 me and friends would sleep in shifts to make sure someone was always online to protect the base against a raid. The game is a full time job if you want to compete with other groups in a server, and then it wipes and you do it all over again… waste of time.\n\nCSGO and Escape From Tarkov too. But I don’t play competitive games anymore as they make me feel negative more than they make me feel positive (and I’m a relatively good player).",
            "Path of exile. With close to 4k hours, i think i might be starting to not be a noob anymore",
            "Haven't done gaming in like a year, but did Trackmania and 2 years further back it was fortnite, way too much fortnite",
            "over 400 hours on Elden Ring",
            "I’m old. Final fantasy 7",
            "Overwatch 1 when the games was good and extremely social.. 7K hours.\n\n7 days to die on modded servers 3K hours.\n\nDayZ modded servers 2K hours.",
            "Dofus, around 5000 hours",
            "WoW, 2007 RuneScape, or Girls x Battle 2.... I don't know....",
            "Minecraft or Factorio",
            "Wow and it's not even close",
            "Hitman 3/WoA. 2nd place is probably minecraft.",
            "Age of empires.\n\nMassive assault, quake 3, and counter strike would be next\nThen Doom, some gardening games, Crusader kings",
            "Monster Hunter and it's not even remotely close.",
            "Skyrim, XCOM 2, TW: Warhammer III",
            "Rimworld... and by a LOT.",
            "Osrs",
            "Strangely, Black Ops 3. Idk if it’s the fast-paced gameplay but that was the first COD I felt good at, and had played competitive on too. Think I tapped out at about 700 hours in the end",
            "OW2 and Osrs, HD2 is a close runner up",
            "Guild Wars 2",
            "World of Warcraft 10k ish hours, Diablo 2 and Soldat a lot of hours, OW2 lil over 800h, TF2 600ish, RDR2 400ish, Elden Ring 150ish, Fallout and Far Cry series as whole a lot. I think myself a casual gamer tho, never got into indie games. Watch a lot of youtube about them. 30 years of gaming under my belt.",
            "RDR2, Rimworld, Project Zomboid. In that order.",
            "Rdr2. 251hrs",
            "minecraft/ overwatch/",
            "Arma 3, almost 3k hours? I don't play it often anymore.\n\nEdit: It's actually probably Minecraft but I can't check those hours.",
            "World of Warcraft since week one. I do not want to know total playtime. I have not had much of a break in 21 years almost. I played on average 2 hours almost everyday minus end expansion slow downs. I did the math so my average is not a 100% correct however it’s close : 8320 hours. Oh lord",
            "Valorant",
            "Elden ring",
            "According to my steam profile, The Binding of Isaac Rebirth, followed by 7 Days to Die. But that's only steam games. You also have non-steam games, games I originally played without steam but later bought on steam, and different versions of the same franchise. \n\nI played Minecraft a lot. I had Civilization 2 and 4 on disc, but 5 and 6 on steam. I got Age of Empires 2 on disc, later getting two versions on steam. The various versions of Pokémon. Warcraft 3. Overwatch.\n\nSo, one of those probably.",
            "Elite dangerous \n\nGran Turismo 7\n\nThexder",
            "Either WoW, LoL or GTA online",
            "Left 4 Dead 2.\n\nIt’s like an addictive drug.",
            "Old school runescape. 81 days and counting. Although i think conan exiles might be a close second. Too bad the game is absolute dog shite now.",
            "Star Wars Galaxies (unknown amount really but I played it for nearly 5 years of its existence)\n\n\nDestiny 2\n\n\nSkyrim\n\n\nStarfield",
            "Runescape. Now Old School Runescape. Hell, they even have it on mobile now so you can play it everywhere. Straight addiction but goddamn getting those 99's feels good.",
            "Rust - the adrenaline rush I get from that game isn't comparable to any other, but it's a toxic addictive shithole.",
            "By far, Football Manager",
            "Football Manager, I've played a few games near to or over 1000 hours. But I've been playing Championship Manager to FM since the mid 90's and even the Steam hours (which didn't come around until late 2003) are insane. \n\nIt is a game you can kind of play in the background while watching a show or playing another game, so it won't be all 100% active time, but I'd say I'm looking at 10,000+ hours across almost 30 years.",
            "Rocket league",
            "Everytime this question comes up i say PoE which is true. But if you want some other stuff. \nThe OG Dark Souls (400h) \nThe OG dungeon defenders (400h)\nTerraria(300h) \nJust as a comparison PoE is at like 8-10k h",
            "The Witcher 3.\n\nWorth every minute.",
            "I’ve got over 3k hours of overwatch… been playing since release and i just always return to it…. I wonder why but i do sadly",
            "It's probably still Lord of the Rings Online, I went through an addiction",
            "Rocket League I reckon. But in terms of focused gaming it’s probably Ghost of Tsushima. Though currently rather enjoying Baldur’s Gate 3",
            "Rdr2 \nMass effect trilogy",
            "Path of exile, gonna guess 6000 hours as i stopped using the steam client at around 3500 hours. After that it's dota 2 at around 2200 hours",
            "Cs source. Way too many hours, and I've been playing it since elementary school. Currently 31 now so just counterstrike in general. Way to many hours on that growing up.",
            "Rainbow Six Siege",
            "Minecraft",
            "Dragon ball kudokai tenckachi and fifa games.",
            "Planetside 2",
            "Hearthstone",
            "RDR2. I will literally hop on and spend HOURS going up into the mountains to hunt lmao",
            " Elden Ring. I think. Maybe Bloodborne. I just discovered, and fell in love with, the Souls games a couple of years ago. They have so much replay ability.",
            "Cyberpunk 2077\n\nRed dead redemption 2\n\nMass effect legendary edition \n\nLife is strange \n\nAnd the cod modern warfare reboot cept 3",
            "I'd have to say the Street Fighter games especially when it got revived in 2008 with Street fighter 4. Final Fantasy 7,8.  And as much as I loved the Halo franchise, when Destiny 1 came out, it took over completely! Man I wish I could go back to when Destiny first came out",
            "Diablo 4",
            "Counter strike",
            "Clash of clans.",
            "Halo or State of Decay",
            "Probably Maplestory,\nAlso making it one of my first rpg to play, it kinda fucked me up from enjoying other types of MMO’s.",
            "Terraria",
            "One of GW2, Fo4 or CK2. Special shout out to Stellaris.\n\nEdit: how did I forget, probably number 1 is Football Manager.",
            "1. ARMA 3\n1. Hell Let Loose\n1. Left 4 Dead",
            "StarCraft 2 8 year",
            "I spent like 500h on Tf2 and probably much more on League of legends, started playing it in 2020 so I had a lot of time for it.",
            "Mass Effect; hundreds of hours across the whole trilogy",
            "State of Decay 2 has the most hrs recorded, 1500 hrs.\n\nBut I can't recommend the game anymore lol.",
            "Borderlands 2 and 3",
            "World of warcraft, everquest and Skyrim are my top 3 time draining games of my life.",
            "Team Fortress 2 around 9k hours  competed in it alot but stopped playing for a while, but if friends ask me to play and I ain't busy I'll play for an hour or two.",
            "COD probably since 2005",
            "Runescape 3. Multiple accounts, couple completionist capes, 19.8 years later, and I'm still playing the game. Excited for the group Ironman mode coming out in fall",
            "Team fortress 2, Batman Arkham city and Elite Dangerous",
            "COD and nba2k",
            "Runescape. Tens of thousands of hours in the last several years alone, but I’ve been playing on and off since 2005.",
            "Overall most likely Wow back in Vanilla - Wrath of The Lich King.\n\nThis year. 3 most played games for me had been  Helldivers 2, Diablo 4 and maybe BG3 or Pathfinder Wrath of the Righteous.",
            "San Andreas I believe, esp since they did the port to the iPad I would play while I traveled for work and was not bound to my OG Xbox",
            "Mount and Blade Warband",
            "Conan Exiles",
            "Warframe, closing on 2k hours. MWO prob takes second place, but unsure of how much I’ve played that.",
            "Civilization (I've spent an insane amount of hours on all of them)",
            "Wow and Fallout 3.",
            "Wouldn’t consider myself a gamer really but I have put in some Minecraft hours over the years and I do remember it taking a long ass time to beat LOZ OOT on 64 the first time around with no help.",
            "I was very displeased to learn that Overwatch is my most played game at 3k hours :(",
            "Guild wars 1 I think.",
            "League of Legends. Started when I was 13, now I am 26. I got about 20‘000 hours I‘d say",
            "Eve online . Some of the lads I fly with have played since 2003",
            "WoW.  I beta tested vanilla and played 2004-2018.",
            "Halo 3 by far. I still wish I could go back and experience the peak halo 3 multiplayer experience",
            "UT99.\n\nI miss classic arena shooters.",
            "I think Minecraft throught the years",
            "Skyrim",
            "WoW actually burnt through a laptop a played that so much for about 3 years. Other than that, probably GTA5 ate a lot of time. \n\nMore recently, Diablo 4",
            "Crusader Kings II, or any Paradox grand strategy game really. My ex called it \"That map painting game\", and she's not wrong.",
            "Tf2, and it isn't even close. More than 6k hours up.\n\nSecond is dungeon defenders with 690 hours\n\nThird is Grim Dawn with 420 hours\n\nFourth is Hexcells Infinite with 409 hours\n\nFifth is Elden RIng with 352 hours",
            "In order: WoW, Battlefield 3, Battlefield 4, Diablo 3, Elden Ring.",
            "GTA 5",
            "CoD when it wasn’t horsecock",
            "Rocket League, GTA 5 and Apex Legends, all 1200 hours. Also Terraria with 900 hours.\n\nRocket League on 2 ps4 accounts and 1 epic, GTA 5 on 2 ps4 accounts and Rockstar Launcher and Apex on 2 ps4 accounts. Terraria on ps4, Steam and TmodLoader",
            "In order of cumulative lifetime hours, probably this:\n\n1: GTA San Andreas \n2: Kingdom Hearts series\n3: WOW\n4: Battlefield 4\n5: Ark: Survival Evolved\n\nHonorable Mention: Fur Fighter's: Viggo's Revenge",
            "Dota2. I have like 12k hours. Dont regret a minute of it. Although players on that make me rage like a Hulk",
            "Xcom 2, without a doubt!   \nIt's a fucking relentless, brutal onslaught, I can't get enough of it 😅",
            "League (3500)",
            "Rainbow 6 Siege. Around 4k hours",
            "I hate destiny 2, it's my (former) favorite game",
            "It's a close one between Stellaris or Lord of the Rings Online.",
            "The Last of Us 1 and 2. The only games I come back to over and over again. Say what you want about them but honestly just incredible. No other game comes close in my opinion in terms of graphics, gameplay, story, facial animations/mocap and voice acting.\n\nAs someone who suffers with bad anxiety I find replaying or rewatching things over and over again relaxing and comforting. My wife thinks I’m mad and maybe I am, but it makes me happy.",
            "Bet you can’t wait for GTA6",
            "Probably League of Legends (hard to tell as I had multiple accounts) or Skyrim (again hard to tell as I played a bunch of hours in offline mode).\n\nAlthough I'm pretty sure Factorio is getting close to those numbers these days.",
            "Destiny 2",
            "My PS5 says GTA 5, but I suspect either minecraft or bo1",
            "Unpopular one…Garry’s Mod. Taught myself Lua coding at 12 years old through YouTube how to videos and trial and error so I could do stuff with that game. My current career doesn’t require any of that knowledge or skill but I understand the language on most programming code when I see it. Played that game for almost 4 years straight",
            "Ff14 3 years and counting",
            "Regretably probably wow, but after I kicked that habit during bfa then it's darkest dungeon followed by monster hunter world and rise, then baldurs gate 3",
            "Myth, tribes, quake and UT, lineage 2. WoW",
            "Back in old days - San Andreas Multiplayer mod with my classmates in some \"GRP\" servers. No idea how many hours.\n\nOn Steam - RimWorld, around 1000 hours.",
            "Halo 3",
            "Fallout series, Elder Scrolls series, and CP2077",
            "Skyrim ps3 is the most hours I’ve ever played for a single game with over 700 hours and still playing.. I’ve never gotten close to that but rocket league is behind it with 17 days played",
            "In my youth it was definitely Armored Core 3 - as an adult it's definitely Dark Souls 3.",
            "Monster Hunter. Any of them. Currently late to the game, but I’m going through Rise, now.",
            "Fallout New Vegas",
            "Elder scrolls oblivion....or fallout 3",
            "It world of Warcraft and it’s not even particularly close.",
            "War Thunder, like 5.2k hours. \n\n5k too many, really shoulda dropped the game when it stopped being fun.",
            "Skate 3. I've gone back to it countless times over the years just to skate around freely doing whatever",
            "My most played on Steam is TF2 with 1460 hours.  But if I had to guess my most played I'm betting I have at least 10,000 hours in Guitar Hero.",
            "As a teenager, I think it would have to be Diablo 2 and Warcraft 3. As an adult, I yearn for the time where I can play games that long.",
            "The Witcher 3. I think its around 550 hours.",
            "The most time I've ever spent on a game was a little gem called jet force Gemini...",
            "Final Fantasy Tactics",
            "almost 20 years of WoW. No competition. Nothing will ever come even close again. WoWm, especially in it's first 10 years was something ELSE",
            "Snowrunner",
            "Fallout 4, I keep going back for a fresh run and I keep finding new things.",
            "I’d say it’s a tie between crash bandicoot 3 and OSRS",
            "Computer: RuneScape \nConsole: CoD4",
            "San andreas multiplayer",
            "Smash bros",
            "i believe i have spent most time on splatoon 3 and 2, combined i have 960 hours",
            "Hero Online.\nNot sure how much, but a couple o thousands hours for sure.",
            "Warframe. I always come back to the game and have lots of new stuff to do. I also loved the trading system, grinding for items to sell and buy cosmetics and upgrades got me really hooked",
            "Red Dead 2, Assassins Creed Oddesy, Fonal Fantasy 15, Witcher 3",
            "Skyrim",
            "Battlefield 4, tho 1k hours is not that much compared to others lol",
            "Arma 3, played for a decade",
            "Red Faction. Love that game still.",
            "Skyrim and ESO. Maybe Dark Age of Camelot back in the day.",
            "Football manager, weeks lost to that magnificent bastard back in the day.",
            "Probably Overwatch and GTA5",
            "Tied with Minecraft and stardew valley. Wish it was more manly games",
            "If we are counting mmos from childhood, Dogs of the Seas, if not, probably GTA V!",
            "Skydiving. I spent an ungodly amount of time on a game that's typically outside of my normal preferences. But that shit was bussin",
            "Dota 2",
            "EQ2, 13+ years.",
            "Probably gta or Minecraft used to play a lotttttt when I was younger",
            "WoW / CoD4 (at least 7500 in each if I’m guessing) then H1Z1 3600 in 2/3 years 🤣",
            "codmw",
            "GTA 5",
            "Warframe. 600+ hours, and that was over 3 years ago. They have since added hundreds of hours of more content.",
            "Farming sinulatlr",
            "RDR2 probably",
            "Destiny 2 with Skyrim as a distant second. I've played a lot of games, but those 2 the most.",
            "Mass Effect\nOver 1000 hours recorded easily",
            "100% one of these three:\nCall of Duty\nRunescape \nLeague of Legends.",
            "Definitely Destiny. Not sure how many hours I’ve got, though. An embarrassing amount for sure",
            "DayZ",
            "Apex Legends",
            "Skyrim probably. Maybe overwatch, but it has become less of a team game after overwatch 2 so I don't play it anymore.",
            "I'm not sure if runescape, gmod or skyrim.\n\nEdit:definiteley not gmod I only have 1200 hours in it",
            "I spent 5 years on that game.\n\nDuring that time I believe I was online like 12 hours a day.  \n\nI skipped sleep, continued in breaks in school on my shitty laptop.\n\n2006-2011 were just basically spent on  wow.",
            "and it's not even close",
            "There will never be a more iconic example of an all-consuming videgame then WoW",
            "I love World of Warships!!!",
            "I had two characters with more than 300 **days** played by the time WotLK launched…",
            "When I type /played (I think) it tells me in years and I really don't like that.\n\nI opened a ticket to jokingly complain about it and the GM told me \"shame\" and closed the ticket.\n\nBack when they were cool and human lol.",
            "Steam players like to show off their game they've invested hundreds of hours in.\n\nWoW players measure by the total number of years",
            "And i refuse to tell anyone my playtime.",
            "After like 8k+ hrs I hit immortal just before facet patch and uninstalled, I’m freeeee",
            "It's funny how you can correlate the age of gamers here by how much WoW they've played. Bet most of us are 28+\n\nMine is probably WoW, followed closely by Satisfactory and MW:O",
            "Should I start playing it now? I started out with fallout 4 ages ago, and am now playing fallout 76 on the daily.",
            "I actually just re installed that on steam to play again hahaha",
            "Yup me too",
            "My brother in light, it's addictive.",
            "That seasonal level up noise directly injects dopamine into my brain",
            "i’ve spent so much time on RDR2 it’s not even funny",
            "How though? What's the repeatable content? I highly enjoyed my playthrough but I couldn't see continuing to play it that much. I reserve that kind of replayability for WoW, Factorio, Minecraft, etc",
            "Damn you have 16k hours in a game that dropped 6 years ago?",
            "Same. Since it came out, on my 3rd or 4th play through. Still discovering new things and the game changes based how you interact with things. Really an incredible game.",
            "Damn almost 17,520 hours in less than 6 years.",
            "same i started playing it when i was 5 years old lol",
            "I’ve been playing CS from 2002 to today. And it’s not a typo 😅",
            "How many hours you got on OW?",
            "SMITE the superior MOBA!",
            "Yeah baby 👶 😘",
            "Yeah it’s always there for me when I get bored, and modding means it’s ever changing 🥳👍🧌",
            "I have put many hours into that game",
            "This is my favorite game",
            "You aren't past the tutorial till you hit 1444 hours I'm afraid",
            "That's many years of doto...",
            "Man, this game has gotta have a really special something.\n\nI’ve admittedly never played it, but my brother has put unbelievable hours into this game in the short time it has been out.  He was a Star Wars: Galaxies/WoW/Destiny/BG3 gamer, so getting deep into things isn’t new territory for him, but still…",
            "Just Elden Ring itself has given me 300 hours. And I just started the expansion today",
            "same.  I have many many many many hours on GW2",
            "Ughhhhhhhhh\n\nI was in a high end raiding guild those years… 4 days a week, 4hrs a day raiding. And to keep your spot you had minimum farm requirements which was the equivalent of another 2-4hrs a day on your main, while leveling up a “needed” class “just in case”.\n\n\n\n\nI even went through multiple interview processes when I wanted to join better guilds when BC launched.\n\n\nWhat a time to be alive.\n\n\nWoW from vanilla to WotLK was phenomenal.",
            "World of Wanks.. wait no",
            "You’re never free from dota 2",
            "See you soon, boy",
            "41 year old dad here… vanilla release was bad cause it came out the same year I got married. I played a truly unhealthy amount.\n\nI no-life’d the game all through vanilla and until we cleared Sunwell in late BC.  I finally chose a career and my marriage over the game and sold my account to really solidify the end.\n\nBest decision ever.",
            "Can't wait for satisfactory 1.0",
            "Listen man, and I mean this with 100% conviction: anyone who tells you, as a fallout fan, not to play New Vegas?  They're a foreign agent attempting to incite division and reduce your total amount of happiness.  Doesn't matter what country you live in, whoever says that is an enemy and is legitimately trying to make you more dissatisfied with your life.",
            "FNV is the most charming fallout. It’s definitely clunky though, so just bear that in mind.",
            "I recommend it. But you will probably benefit from some mods. I'm currently using the Begin Again mod pack, which requires Fallout 3 as well. It kind of smashes the two games together into a single story, but you can also just play New Vegas.",
            "It’s a bit older and before Bethesda figured out running in their games, but after an hour or so you don’t even notice it. At the time of release it held a record for the most dialogue in a video game, and it shows. Choice matters in a way it doesn’t in Fallout 4. You can kill(or not) everyone and everything, and quests will fail and change as a consequence, unlike the later titles. Expect the usual Bethesda bugs, just keep a backup save every once in a while just in case. \n\nAll I can say is you won’t regret it and you might kick yourself for waiting so long. Or you won’t. Everyone I’ve introduced the game to has enjoyed it though if that helps you to make the jump. Plus mods if you’re on PC.",
            "Me three",
            "I myself have a blast restarting the story once a year, and each play through there’s still so much stuff to do, side quests run out eventually though. But you can hunt, fish, and try to 100% the game. And even then there’s just so much to do man",
            "Honestly, I just love fishing in Red Dead 2.",
            "Purchased it during covid lockdown. Got me through the whole mess.",
            "I played CS 1.6 from 2006 as an elementary student haha!\n\nAt 2018 I got recruited so didn't really have much time to play and when I was home I was focused on other things.\n\nIt was definitely fun",
            "There was a lightsaber mod I wanted to try out awhile back  lol not sure if it's still on there though",
            "I'm not really sure either why this game works cuz even the fanbase is consistently angry about it lmao but there is something addictive about it. Although, it must not be working nowadays cuz I finished Lies of P and started playing Blasphemous 2.",
            "I started 2 months before Bc and stopped just after the major nerf to all raids and dungeons in cataclysm.\n\nI went from a 10 year old 'squeeker' who barely spoke or understood English and played exclusively with my brothers and mom. To the guild leader of not the best guild, but a guild that consistently cleared the raids 1 week behind the good guilds.\n\nMom stopped playing, and I went off the deep end. Going to sleep at 23, waking up at 2 and then going back to 'bed' at 6. Absolute addiction to that game.\n\nTried it again during classic relaunch, and Bc classic. but I just stopped after we cleared molten core once.",
            "Selling the account is definitely a way to never get back into it hahaha. I'm 33, i was around 10 when I hear about it and couldn't play because I had dial up. I started in MoP and really got into it (1200 hours ish?) but fell off because of other games",
            "I bought the game weeks before my wife and I moved in together. That's when she first heard of \"raids\" ... It didn't always go down well. Wow vanilla was plain crack with a subscription model.",
            "Hey when it was good, it was really good amiright",
            "Animals too. You can hunt almost every type of animal and bird you can think of, all you gotta do is find them in their natural habitat and use the appropriate weapon so that the quality of the hunt doesn't deteriorate.\n\n12 legendary animals too if I remember correctly.",
            "Even when it was really bad, it was good. We all played through some ridiculous bugs and broken things lol",
            "*Was it ever?*",
            "Exactly! I’ve always loved to just camp out in the woods for a long period of time waiting for the animal I want to come out. Being able to chill out in nature just like real life. And that’s just one among many things you can do that could easily take up time played lol"
        ]
    },
    "Men, how do you feel when a woman checks you out in public?": {
        "title": "Men, how do you feel when a woman checks you out in public?",
        "score": 198,
        "url": "https://www.reddit.com/r/AskMen/comments/1dlmryt/men_how_do_you_feel_when_a_woman_checks_you_out/",
        "content": "I (18F) was staring at a hot guy today, and as he adjusted himself we locked eyes awkwardly. This made me curious as to how y'all feel whenever you catch someone checking you out.😂",
        "num_comments": 311,
        "comments": [
            "I don't jump the gun. I assume it's because something caught her attention, and I leave it at that.",
            "My husband is completely oblivious to it...I point it out to him. He acts like he doesn't care but I know it puts  a little more bounce in his step.",
            "unless she’s smiling i’d assume i just look weird lmao",
            "I’ve never noticed anyone checking me out. But then again I am very oblivious",
            "If any women was checking me out in public I’m highly certain it wasn’t cause “I’m hot”",
            "Oh that poor girl, I'm married!",
            "Women check you out? What universe is this?",
            "It reminds me that I am indeed a hot piece of ass.",
            "My friends say I get checked out a lot because I’m tall and fit, but I’m too nearsighted to know when it’s happening 😂😂😂    So yeah it would be great lol",
            "I mean women do check me out at the gym since I’m wearing compression tshirts. And it feels fucking awesome",
            "I feel good when it happens. But he was \"grabbing himself\"? Like, you know how that sounds right? So you checked him out and he just started battering the bishop in public?",
            "I don't think I've ever caught someone doing this.",
            "That happens?",
            "I like to be appreciated, even just as a sometimes attractive piece of meat.  Usually I don’t acknowledge it, sometimes I’ll wink and keep doing what I’m doing.  \n\nUnfortunately, it is sometimes when I am adjusting myself.  When that happens, I feel like I’ve been caught being inappropriate.  I don’t know if they find that appealing or disgusting.  My wife always makes it seem negative.",
            "Ahh, that used to happen to me! I'm not as in shape as I was a few years ago, but It was nice and made me feel good about myself, especially since I was a fat kid.",
            "The guy you were looking at seemed confident enough you were attracted to him, but the average man never gets these kind of second glances, so when it does happen, our minds are flooded with dumb explanations/thoughts other than attraction",
            "I just wish they'd follow it up with actually saying hello to me.",
            "I'll let you know if and when it happens.\n\nNo need to hold your breath.",
            "I like the distant curious gaze from women in public when it happens. It allows me the chance to enjoy the moment and confidence boost afterwards while I wonder about the “what if” or “what could’ve happened”. But that’s as far as I go. A woman’s gaze in your direction is just a discreet compliment from afar. That’s all it is. Which is rare for a woman to be obvious about , so I appreciate the moment and keep it moving.",
            "I assume that the girl is probably counting the number of icks she’s getting by looking at me",
            "I'll let you know when someone checks me out in public.",
            "Wait this happens?",
            "Love it. Even though married and not looking for anything. \n\n\n\nEveryone likes being found attractive.",
            "I'm almost 40 (I'll be 39 this year), nobody's checking me out lol.",
            "I either don’t notice or don’t mind.",
            "I definitely don't start \"grabbing myself\" jfc",
            "I ain't got enough experience to answer that... 🥲",
            "Grabbing himself?",
            "I've lost a lot of weight in the last 6 months and I've noticed a few women checking me out, feels great! \nIf only I could get photos of whatever that vibe is for Tinder I might actually get a match! 😅",
            "I’m not attractive enough to be checked out. So I figure out what stupid thing I’m doing and then proceed to do it more because idgaf about what she is thinking",
            "Well, we also check girls so if your eyes connect is because he was checking you too 😆😆",
            "I look like a slice of moldy bread, so someone checking me out would make my whole week.",
            "I've never caught anyone checking me out. I'm invisible to women. The only time anyone's ever flirted with me was at a gay bar.",
            "I never know when they do but apparently according to my wife our entire 4 year relationship they always check me out at the store or when they flirt and I'm just too oblivious to even notice",
            "Nice. Eyes forward eyes forward, keep walking…….phew, ok it’s over. That was a close one.",
            "Never noticed it happening. If I did I'd assume there was something wrong, like I have a stain on my shirt or my zipper is down. Or that she's looking at someone behind me. Literally my last thought would be that she is checking me out, but if I somehow knew she was, I'd fucking love it so much. I'd be riding that high for years",
            "It makes me feel *so good*\n\nI was an awkward chubby kid with no social skills, so I didn't get much positive attention from girls growing up. So getting that type of attention now as an adult is like crack to me",
            "I think there’s something wrong. Like I have food on my face or a stain on my shirt",
            "Honestly, I’m too shy to look around and notice lil",
            "I honestly don't think I even recognize it to know.  So it doesn't feel like it happens till someone tells me. Lol.",
            "I’ll let you know if it happens",
            "I feel pleased with myself.\n\n\nA very attractive girl about your age walked past me yesterday making a facial expression that I recognised as 'checking out'.\n\n\nI made eye contact and we smiled at each other as we passed.\n\n\nThen my wife said 'she looked very happy. Maybe she read something funny.' \n\n\nAnd I laughed.",
            "I assume she's having a stroke and never look her direction again.",
            "Don't stare at people - it's creepy",
            "My eyes are up here",
            "It makes me feel good. Like damn, I didn’t mess up my outfit today 😂",
            "Scared because my wife is Ukrainian and absolutely insane. She'll throw down.",
            "I seize the opportunity to try out my Travis Bickle impression",
            "Honestly I'm not used to it so I get awkward as fuck. Recently visited a coffee stand and the girl working wouldn't stop looking at me and smiling even though she wasn't serving us. I'm not complaining though, just can't bring myself to actually act on it in case I've misread it.",
            "I probably wouldn’t notice or instead wonder what is wrong with me, that someone is staring at me.",
            "Pretend I don’t notice and start doing something manly like chopping wood or fixing something.",
            "I never know they did",
            "Well, usually, my wife lets me know it's happening, and we will discuss if she does it for me, and then we use it for stimulation later when we get home 😍",
            "I don't notice when/if they check me out",
            "Never get that",
            "I actually love when I notice a girl checking me out , it’s rare when it happens but when I do , I usually try to acknowledge them too and kinda make them feel like I know they staring . So what I do is when I feel a girl staring , il wait til they look away , then il stare at them until they notice me , then when we lock eyes i just give off a friendly smile 😊 then look away right away so they don’t feel uncomfortable, but then i look right back a second later and if you keep locking eyes after that that’s how i know they either like what they see or they recognize me lol",
            "First check I haven't got something on my face, get paranoid. Pants? Check. Hole in shirt? Nope.  \nNothing worse than thinking \"oh yeah, there's a person on this planet that finds me attractive\" to later find they were probably staring due to rip in pants, missing button, some other spill or other embarrassing thing. haha.  \nThe one that makes me chuckle a bit to myself is when they can't stop glancing at my crotch bulge. haha.",
            "Paranoid and suspicious.",
            "lol this is funny. I’m invisible so I know not of what you speak.",
            "Hopefully I can get back on to you on that one day.",
            "Women check out men?",
            "If I like her back, then it’s a flattering feeling to be stared at 🤭",
            "The only women who check me out are 80+",
            "Women don't check me out so if that happened, I'd naturally assume something's wrong with me. Why is she looking at me like that ? Is my fly open? Do I have something on my face? Maybe she's confusing me with someone else.",
            "I'm an old man and no woman has ever 'checked me out'.  Not once.",
            "I dunno. It’s never happened.",
            "Ok, but I prefer to use self checkout.",
            "uncomfortable, my first thought i may have something in my face, like a piece of food stuck in my moustache or beard.",
            "I don't know. Never happened to me. ",
            "Generally a quick “how’s your day going” just in case she’s my future wife",
            " These days I don’t lock eyes at all. Fucks that, you wont tell ppl I was all in your face; roll your eyes and say shit like “why the fuck he looking at me”. Nope!😒. But you’re a teen so you don’t know what us adults (over 21) go through.",
            "I never assume a woman is checking me out, but when I see one that I think is, it almost feels like a compliment, it feels nice.",
            "Women are checking me out?",
            "Doesn’t happen. And if it did, I’d assume she was looking past me at someone else.",
            "I like it when they look away quick and act shy",
            "Uhhhh they don't that I'm aware of...",
            "I feel indifferent and so I ignore it because I have a partner.",
            "I’ll let you know if it ever happens",
            "never happened",
            "If she's hot - it's cool.  \nIf she's not - Ugh, get away from me you creep!",
            "Creeped out, please stop.",
            "If she's attractive I might smile and strike up a conversation.  But if she's unattractive I will walk up to her and politely ask her to pick her fucking jaw up off the floor. To stop objectifying me just because I am walking around in my swim suit at the beach and that she is giving me \"the ick\" All while recording the encounter for my Instagram story.",
            "Indifferent",
            "I was approached a couple of times by women, got a couple of numbers slipped among my stuff, but I have never even once noticed a woman doing this",
            "We love it. We have a sense that kinda alerts us to it.",
            "Honestly, I'd be surprised. Then suspicious not long after. Anymore I don't get positive female attention except a few rare individuals, so I want to know what nasty things you're thinking about me or plot you're plotting so I can avoid it. I'm ugly and a bit overweight so I can bet it's not positive and be right 70% of the time. Ten years ago? I would have been all about it, and probably approached you. I'm tired and older now though. I've been hurt and damaged more. Risk assessment is everything. In short I'd assume you weren't \"checking me out\" and encourage you to look elsewhere with whatever is on your mind. Self preservation and all that.",
            "When I notice, I chuckle and keep it moving.",
            "I feel flattered and make eye contact and smile",
            "It makes me feel good",
            "It feels awesome every time.",
            "I figure she's looking at the way I'm dressed. Wifey is a fashionista and has been dressing me since we started dating  almost 47 years ago, married for almost 46. It doesn't matter if we're going to a rodeo or the symphony, she lets me know what I'm wearing.",
            "Honored",
            "Well I certainly don't grab myself. Hopefully you didn't think that was hot for some reason.",
            "Don’t even entertain it.",
            "Fucking amazing",
            "Very flattered. But if they try and act on it, I get really awkward because I'm engaged and don't want anything to come of it 😅",
            "Happy",
            "Just assume she gazed for a moment and leave it alone.",
            "Really?!",
            "I don’t notice unless they are telling me directly",
            "I usually look the other way as not to catch charges or something.",
            "I just look and smile. It’s flattering.",
            "Feels fucking dope. Grey sweatpants are a gift from god.",
            "I love it.",
            "Unless it's my gf it never ever happens.",
            "Never noticed it before. I imagine it’s happened but I highly doubt it.",
            "When i was younger id see girls faces light up. That doesn't happen anymore since i gained weight",
            "I smile, take the confidence boost and carry on with me day.",
            "Feels great",
            "I don’t see it, cause I don’t think it happens cause I’m really not that great looking.",
            "women don't check me out. I'm far too ugmo for that.",
            "100% fine with it",
            "It doesn't happen often, but when it does, it can boost my mood for weeks and I'll probably remember it for months (years if the person is really attractive).",
            "It’s never happened that I’m aware of so no idea.",
            "Always surprised, always delighted.",
            "I wouldn't assume they were checking me out tbh",
            "Usually don’t care. Smile and move on",
            "Is there something on my shirt? Is my hair weird? Do I smell bad? I assume anyone paying attention to me is for a negative reason.",
            "I would prepare myself and make sure I'm not getting scammed or end up on some online video.",
            "I'll let you know when it happens.",
            "My 1st reaction; I’ve got a bugger hanging out.",
            "I secretly like it",
            "we don't think they are",
            "1) I didn't notice it\n\n2) I assume there is something weird about my face or outfit\n\n3) I assume I misread her facial expression",
            "If a girl ever says anything nice to me I break down and cry on the spot. \n\nIf I lock eyes with a girl in the scenario you’re describing, I assume she’s looking at me in disgust.\n\nThere was once a girl that smiled really big and raised her eyebrows but I figured it was more of a prank than anything else.",
            "Ah, the awkward yet flattering moment of catching someone's eye! As a guy, it's a confidence boost to know someone finds you attractive. It's a mix of surprise and flattery. 😄",
            "It happens lot to me. Especially towards the end of the week. Sometimes it is awkward if I’m busy or Im not sure what to say/she pops out of nowhere.",
            "I always just assume they think I look creepy",
            "First thought if that were to ever happen is that I look stupid",
            "So fucking hot",
            "I'm assuming she's having a stroke. Or has a wild vision impairment.",
            "39/m never happened",
            "If I'm sure that's what it is... flattered",
            "Awkward. She probably thinks I'm staring at her.\n\nBut I always assume they are looking at someone/something behind me and I got in her point of view.",
            "I get looked at and always assume they're just generally looking around or thinking there's something odd about me.",
            "i feel great",
            "Ummm , I'd to be hot to be checked out at the first place.",
            "I don't think i ever caught a woman checking me out.",
            "Firstly for a brief second I think thats amazing, but right after I am like, damn what did she see... do I have somethin on my face etc. etc.",
            "We absolutely hate it. We just want to be left alone but every day women are hitting on us. The horror",
            "I doubtful I'm ever being checked out. If I'm being looked at by women, I  always feel it's likely cos they are intimidated by my appearance as I'm often told I look quite scary with all my tattoos and my size. So I tend to just make sure I'm looking away from people if I'm at the gym or in a shop etc.",
            "Depends on who is checking me out, but it's never awkward. For some, it happens anytime going in public, anywhere, so it's the same as leaving the house.\n\nIf she catches my eye as well, I will keep eye contact (gentle or intense depends on her vibe in my direction) and maybe squint curiously or raise an eyebrow slightly, \"Hmm?\" They usually overcompensate and nervously act like they didn't, giggling, etc. so I make the choice from there. \n\nGetting it from those drastically older or those not so much my type, I just pretend to be oblivious but still treat everyone with loving kindness in all situations.",
            "It makes my day for sure",
            "Too be honest I don't think I've ever been \"checked out\" \n\nI'm 5'8\" and a little heavy. It doesn't happen",
            "When a woman do what? 😮🤔",
            "It happens often…. Staying humble. But honestly when it does I just always hit them with a small smile. If they smile back then it’s kind of a “we see each other 😉”  however you do from time to time get the ones that look away quickly and blush as if they weren’t looking haha.",
            "I think I've noticed it once or twice, I like it. Feast your eyes ladies, don't be afraid to say hello, or I love you. More often than I've noticed being checked out is when a girl likes me, but I only seem to notice the ones I'm not that into sadly. Like a deer in headlights kind of stare. \n\nThis one girl at her workplace, probably only the second or third time I saw her there, did the look and waved at me. But then after that time she just acted normal, I thought maybe I was reading too much into it. But further research into \"how to tell\" indicated she was probably too nervous or shy and trying to cover it by acting normal",
            "Bold of you to assume that I've been checked out in public by a woman.",
            "When it happens I always think they look at someone who is standing behind me.. 😅",
            "I love it",
            "Never happens. And if it does, I never notice",
            "Women don’t turn their head just use peripheral vision.. men turn their whole body",
            "I wouldn't know. At most I can catch someone *staring* at me, which is not a good time.",
            "Well, if I have a partner, I'm really interested! But if there isn't, then I have the thought that you think good or bad about me now",
            "I recognize she probably thinks I’m attractive, get a little confidence boost, and keep it moving…….. I’m married",
            "It’s always nice to know that I have something that might be interesting to someone.",
            "This absolutely never happens to me and I can say that with 100 accuracy that it doesn't happen",
            "It feels good brotha! It tells me my hard work has paid off at the gym. Although unfortunately I think it's actually cause I have long curly hair and nothing to do with my gains Baha 😂",
            "Why the hell don't you come over and say hello. That simple.",
            "Pretend I didn’t notice it. Because regardless if I’m interested or not it is the best strategy. Either to make nothing happen or to keep her interested.",
            "I never really notice women checking me out but my SO points it out to me fairly frequently. I'm not sure if she does this just to boost me up or something though lol.\n\nI do notice when a woman is flirting with me though, probably one of the few guys that actually picks up on this. It makes me feel flattered but I don't reciprocate (I'm taken as mentioned before).",
            "Yea, i'm not the \"Check this dude out\"-kinda guy, i am more the \"Hey, he isn't too shabby, but he's got a good wit\"-kinda guy. So this problem doesn't arise.",
            "I hope for their sake my red headed Scorpio girlfriend doesn’t notice",
            "Fine by me.  Your eyes are free.",
            "I dunno if I'm getting checked out or if they are just looking at my daughter talking a lot and being goofy. I'm not alone in public often",
            "I assume I'm fucked up in some manner.",
            "I just smile a little.",
            "I could feel it, the eyes on me. Especially on the public transport.\n\nOnce a woman stood in front of me on purpose, very close, it was not even that crowded. Then she started to lightly grind on me. It was not a pleasant experience. Look all you want most men wont care, I look at other women too",
            "I assume they think they caught me checking them out and dart my eyes away immediately",
            "I'll let you know if it ever happens to me",
            "I wouldn't know, I usually need my gf to point it out to me after the fact. I am usually too much in my own thoughts to notice, and even if I saw someone look at me I would assume I have a stain on my clothes or something.",
            "Nothing, because it has never happened to me.",
            "It feels good, I check her out back",
            "it's disturbing double standards",
            "Like I did something wrong why is she looking at me and Ive crossed the street because 2024 lol",
            "Best feeling in the world",
            "Get annoyed cause it happens too much",
            "For me it’s a bother. So long as she doesn’t act on it and just looks, I guess it’s fine. Most guys would love it though and it would make their day lol",
            "If they’re attractive I don’t mind. If they’re a land whale or something it pisses me off",
            "I feel cheap and used. I am not yours to ogle. I would call this visual SA.",
            "😂. They might be sizing up your wallet but they’re not checking you out",
            "Yup, I just assume I must have a fat spot on my forehead or something that I nissed",
            "Dryer sheets in his shoes?",
            "The way women check guys out is a bit different than when guys check girls out.\nThey are the masters of stealth. \n\nThey won’t be looking at you directly almost ever, it’s a glance and a scan with the body not changing position nor the head turning much either. It’s very subtle and quick. \n\nIf they see you turning to look their way they will do a slight adjustment so it looks like they were never checking you out at all, and you can tell if they were because their eyes get very open and wide, like when someone is trying their best to not look at a camera in a movie, or whatever. ",
            "What does \"checking out\" look like versus a girl's eyes crossing over me?",
            "I always assume that either they like me (but not in the moment, i’m a slow thinker so I understand later) or they think I’m weird. My mind usually goes to the latter as I’m socially awkward.",
            "Secretly a little hot.",
            "Oh that poor girl, im gay",
            "Oh that poor girl, wait until I start talking about my geeky hobbies.",
            "Women most definitely check men out",
            "My parents are visiting and they notice way more often than me. Oh well",
            "Get some glasses!",
            "✨ blissful ignorance ✨",
            "Just adding but the same rules goes for women as it does for men, look but don’t stare. If I saw a woman looking at me once it would make my day, second time I’d blush, third time I’d think “uh oh, what’s this turning into?”",
            "woah you're telling me you know that skin tight outfights will attract additional attention and you don't set up 6 ft tripod with 180 view angle and then spend 2 hours editing video and post it on the internet calling women creeps and predators? \n\n....what are you? a sane person? tf?",
            "Was looking for this comment. Seemed...odd, especially since OP kinda just glossed over that bit",
            "[deleted]",
            "To the best of my knowledge, I've only been caught once--but fwiw, it was someone else that picked up on it, not the target themselves",
            "Can’t say I’ve ever experienced this either. I did have a female friend tell me once ‘those girls were checking you out until I came over here’. But I didn’t even see who she was talking about. 🤷🏻‍♂️",
            "Winking is crazy 😭😭😭",
            "Find yourself a girl who will lick up the 2 day old spaghetti stain on your jeans",
            "Or smile, wink after eye contact. Something to make us think, oh wait she is checking me out!",
            "No, but reddit wants men to believe it does",
            "Of course.",
            "I'm 46 now and started working out and dieting 5 years ago. I highly recommend! This is a nice channel to get started! Buff up with us! :D\n\n[https://www.youtube.com/@RenaissancePeriodization](https://www.youtube.com/@RenaissancePeriodization)\n\nMight make you as much as 10 years younger looking! Or just make you scarier, I don't know.",
            "Men get better with age",
            "Why? Just don't notice?  I got 5+ years on you and I get groped (gross) and checked out constantly by women half my age.  I don't even really lift bro.",
            "Adjusting, OP doesn't know the difference",
            "😂😂",
            "All the time",
            "Did you forget to add the /s for sarcasm or were you just stealing quotes from askwomen?",
            "A fat spot?",
            "Very rarely do I think she’s actually checking me out. Out of the thousands of women I’ve seen looking at me I’m sure of only a handful that were checking me out, even still I’m not 100% sure.",
            "Mostly true, though I have occasionally done the full turn around and stare after he has walked past me.",
            "You can feel head and/or  body are turned in your direction and it lasts longer than just eyes crossing over",
            "Oh that poor girl, I’m 7.",
            "This. So many times in the gym. And yet I’m still awkward because I can’t handle the idea of someone liking me. I do try to be nice, but I’m so nervous in the moment that I think I come across as cold. Autism and social anxiety. Nice. I do try to work on it though, but im still waiting for the psychologist.",
            "But at least you know she has good taste?",
            "What do they check out?",
            "Check if their wallet is bulging.....",
            "Your dad tells you you’re a hot piece of ass?",
            "My grandmother noticed",
            "“She wants the ba donka donk”",
            "“Oh god I don’t have the energy for this right now!!”",
            "I’m not an influencer. So shut up and skedaddle\n\nP.s I’m gonna leave my stupid cunty comment there. But I swear I get what he was tryna say. He funny as fuck 😭",
            "Lol 😁",
            "You sound insecure AF 🤣",
            "Yeah if anyone made eye contact while I was adjusting myself I would be very embarrassed.",
            "that probably made him feel like he got caught, but otherwise aint a single man out there who'll be upset your checking him out",
            "That is not what you were implying 💀",
            "Never had it pointed out to me to. If I'm getting looked at its probably rhem being shocked at how ugly I am.",
            "Most men are oblivious or nieve to that.  Like we can see another man give us the \"I'm about to punch you\" look and women have no clue, but we almost refuse to believe or see when we are being objectified by a woman, still we have eyes in the back of our head when another dude wants trouble.",
            "Lol yeah I've been working on my weight. It's not terrible, but I feel better without the sugar and crap food.\n\nI pretty much already look younger than I am, though the beard helps with that.",
            "Some do, this is true.",
            "Lol I haven't been groped or anything like that since I was in high school.\n\nFor that matter, the last time anyone flirted with me in person was when I was like 32 I think.",
            "English for pimple",
            "Oh that poor girl, this is me on a good day",
            "Faces, arms, overall look, left ring finger",
            "Legs, ass",
            "Depends on which way they are facing.",
            "He certainly does",
            "Lol 😂",
            "Who's gonna tell him ༎ຶ⁠‿⁠༎ຶ",
            "\"...to ding a ding dang his dang a long ling long.\"",
            "It was tongue in cheek, he’s saying you’re not one of the problematic people",
            "You missed the joke.  He wasn’t actually saying anything about you, he was talking shit about those stupid gym streamers with sarcasm",
            "huh?",
            "Holy shit I actually know who you are irl",
            "So true. We’re such simple, humble beings ;]",
            "Twice this week by women.  3 times by dudes, but the dudes were non sexual and friends (never turn your back to a hockey puck, nice kidney shot, still made the save tho).  It was was like, \"bro I haven't seen you with a bruise ever in 40 years lemme check that out yo check this out it's purple and green and yellow and black, come over and check this out\"  my reply was \"it smarts a little is it bad?\"  Reply \"nah, you'll be fine don't worry about it\". 1st women was at the laundromat, that was icky, and then the grocery store.  The second one was warranted and faked.  Neighbor girl was getting harassed by some drunk dude and pretended to be with me.  The first was weird.  She just grabbed my junk, and apologized saying she was thinking about it but didn't mean to do it.  First things I did was check to see if everything was still in my pockets, it was and explain that she committed sexual assault on cctv.",
            "As an American, I wish the English would speak proper english.",
            "I tried to google a few different phrases to basically ask “English people call pimples fat spots” and absolutely nothing came up to confirm this… the closest answer I found was “Brit’s call pimples a spot”. \n\nI’m so confused why acne would be referred to as fat??",
            "LOL. I generally just look at someone’s face and call it a day.",
            "Left ringer finger? Hasn’t stopped them 🫶🏽",
            "This is getting hot",
            "Well, as long as he's not telling his daughter that.",
            "He ain’t an influencer but he is a meat head",
            "I gathered that🤣 and I laughed at it",
            "I know I said I got it afterwards 🤣🤣 bruv is mad real for that",
            "you went from \"compression shirts attract women\" all the way to a fanfiction of law enforcement getting involved, you need to hit the gym kiddo. I'm dying over here 🤣",
            "I think i might have a little bragadoccious streak.  I certainly don't think I am humble.  Simple? Absolutely!",
            "As a dutch, I feel like dutch is not dutching.",
            "Yeah learn proper American damn",
            "Spot = pimple fat= large",
            "Mate poaching is super common in women, more than in men even. If you're married, you're more attractive and many women will try harder.\n\nSo if you want an easier time attracting women, wear a wedding band.",
            ">This is getting hot\n\nYou're stuck in the dryer again. I'll go get step-mom to get you out.",
            "Roidrage coming in hot",
            "What kinda compression shirts are you wearing btw",
            "huh? You clearly didn't get the irony of that message. I'm not going to explain it.",
            "That was the joke! 🙄",
            "3 English guys downvoted me because they have no sense of humor.\n\nI'll have to come back to this comment in twelve days.",
            "I don't know why the down vote. That's exactly true. At least in my case. I can't speak for the whole world.",
            "Daddy??? Who put chains in the dryer?",
            " long sleeved ones from Under Armour and Gymshark Elite",
            "Dude clearly just identifies as a male. Sorry that your femininity can't take actual male conversation.",
            "You're fine buddy. Happy Pride Month, #BLM, and video games are culture.",
            "There’s nothing to explain. You just like being a cunt don’t you 🤣 jk jk 😌",
            "Maybe come back in a fortnight.",
            "Word thanks",
            "Sigh.  Chiming in as a third party to confirm that in fact you, Mr Deacon, missed the joke.  They were very cleverly making fun of the gym streamers that we all hate, and your comments reveal you didn’t get it.  Here is your whoosh award: 💨.  Do better, and have a nice day.",
            "There’s no reason to be a douche",
            "No, that's two days too late.",
            "No problem bro",
            "You got that right!! Ohhh well….I did try to slip on in to the convo 🤷🏻‍♀️😩",
            "Haha le epic lolz! I certainly was bamboozled my good sir. What an epic failure! \n\nSeriously, grow up..",
            "A polite and respectful discussion.\n\nThats why I like this sub.",
            "Eesh.  You must be fun at parties",
            "Dig up dude, dig up! 😂😂😂",
            "No!! You need to grow up 😳🙄🙄"
        ]
    },
    "What is something that most guys care a lot about but you really could not care less about?": {
        "title": "What is something that most guys care a lot about but you really could not care less about?",
        "score": 164,
        "url": "https://www.reddit.com/r/AskMen/comments/1dlmq5g/what_is_something_that_most_guys_care_a_lot_about/",
        "content": "For me, it is sports. I am an active guy but I don’t watch sports. I really have no interest. \n\nI am shorter than average at 5’7” or 169cm. I have been short all of my life. I am used to it. You can bug me about being short but it means nothing. ",
        "num_comments": 275,
        "comments": [
            "Sneakers.  \n\nThat thing just got out of hand 500$-1000$ for shoes that easily get dirty that you have to worry about creasing, can’t run in , and to me me most of them look ugly, they don’t even look like shoes anymore, and who even notices? \nDo girls chase after you because of your overpriced sneakers? \nI think most people just glance over and think either clean or dirty , not “oh my God are those the rare edition Yeezys?!”",
            "It seems like a lot of guys I know are preoccupied with never seeming un-masculine in any way. They have a lot of rules for how they can sit or stand or walk, what they're allowed to be interested in, etc. I just don't have the attention span to care about that, and I've never understood it. I'm a man, how can I be less of one for petting a kitten, for instance? Illogical shit like that just doesn't affect me.",
            "Getting \"Man Checked\"\n\nWhen a dude shits on me for drinking cider or wearing sandals or something they perceive as unmanly and act like I'm some kind of pussy. \n\nI used to react when I was younger. Challenge em to go shot for shot on straight bourbon. Ask em if they think they could knock me off my feet in my sandals and step to em to punk em. \n\nBut anymore? I just can't be bothered to give a fuck. \n\nIf you're denying yourself joy and comfort because you're too insecure in your masculinity that's your fuckin business bro but coming at me about it just makes me pity you.",
            "Liking women on Instagram who don’t even know who you are",
            "Never cared for cars, and I always get shit for it. To me it’s just a tool to get from A to B, never seen the romantic side of it.",
            "What masculinity \"means\" or how to be \"dominant\" or \"alpha\" or whatever flavour of it comes up next",
            "A lot of guys seem to really care what women think of them. They want to change to adapt so they have better odds.\n\nI really don't give a shit. I'd never change for a woman. Ever.",
            "Fishing, boring as fuck. I did crabbing this year, fuck was I bored! Camping, surfing , 4x4 ing , sign me up though!",
            "A girl with a “fat ass”. Most of the time it’s just a fat girl, or at least a too big for my type of girl.",
            "Cars, I've never been a car guy, I like trains though.",
            "Cars and drinking",
            "Concerts.. I hear some of my friends say stuff like \"I saw nickelback last fall and it was phenomenal they had a killer setlist\" and I just don't get it. I've been to a few concerts and everytime it's just loud and barely audible what they're even singing. half the time you're so far away from the stage that you can't even see the performance properly so you just end up watching from the screens. Like why would I want to pay 75$ + to watch someone perform on a screen when I can just do that from home. I can understand classical performances because typically the venues are smaller and the audience is generally quiet but otherwise I just don't get how people enjoy it.",
            "Guns  eh 🤷🏽‍♂️",
            "I guess I’m considered shorter too these days? I’m 5’9 but I’ve never been insecure about it",
            "I've never really liked playing video games in general. Not because it's not fun, but I just want to do something more passive in my free time(ex. YouTube)\n\nP.s. We're the exact same height my friend!!! (I'm also 169 cms.)",
            "MMA, wrestling, boxing, any of that stuff.",
            "DC & Marvel (and any other) super hero movie or comic book.",
            "Looking, acting, or consuming in a sufficiently masculine fashion. I care less about it the older I get. Although when I was younger, I cared about it more in a \"challenge it\" sense and would actively dress and act more femme and androgynous. Now I just do what's fun and or comfortable.",
            "Being attractive. I do what I can do attract others, but I am sick of the superficiality of it all.",
            "cars",
            "Cars.\n\nI couldn't give a shit about the kind of car someone else has. In fact, I have a more negative reaction to dudes who brag about their expensive cars as if it gave them status. I don't care that you've decided to buy an overpriced European car.\n\nThe one I have is only there for getting me from Point A to Point B. That's it.",
            "The general fasination with cars/vehicles. As an engineering student, I really appreciate the mechanics and systems put into the creation of a vehicle. However, the obsession with expensive cars that only have their brand going for them is dumb. I dont care that it cost you a quarter million dollars. How does it run? How efficient is it? What's the aerodynamics of the body? Give me something to care about besides a price tag and a name associated with it.",
            "Sports, guns, cars, and scotch.",
            "Competition.\n\nWho’s making the rules of the game and do you really even want to be playing it?",
            "Sports. I’ve never been into them much. It all seems so “tribal”. Like “My tribe is better than your tribe” kinda stuff.",
            "Getting a bunch of girls.  Sports.  Im more of a feminine dude so I feel very seperate from how most dudes are.",
            "Beer, I’ve tried beer many times purely because everyone says its good but I hate it every time. I don’t mind liqueur, wine, etc but I just hate beer",
            "Sports and video games.",
            "Cars. I like most stereotypical guy stuff but for some reason cars just bore the hell out of me. I could never spend crazy money on them like other guys do, as long as whatever I’m driving isn’t a clown car and gets me from A to B smoothly then I’m happy.",
            "Cars. \n\nI can appreciate the aesthetic of a nice looking car, but beyond that, they don’t interest me at all.",
            "I feel you, bud. I couldn't care less about sports. When some dudes just go on endless sermons about team comps, draft picks, and coach records, I just zone out",
            "Being 'successful' in traditional terms.\n\n\nU guys get to have a stroke at 50, ima chill with the Mrs and kids",
            "Sports.  I’m not sure how people sit for hours and watch it.  And right it the middle of it the jump up and shout and act a fool.",
            "Sports and cars. Also staring at random attractive women apparently. Lots of my coworkers do this.",
            "Sports, cars, a relationship, (play)fighting, formula 1, \"checking out\" girls to see if their hot, trying to get \"laid,\" most video games and guns",
            "I'm the same way. I love playing sports, but getting wrapped up into following a team seems kinda lame to me, just isn't my thing. Also I don't care about collecting a huge body count. Some have the goal of trying to sleep with the most women possible, when all I've ever cared about is finding one person.",
            "Sports, what people think of them and cars. I love being active and playing sports, but watching them is boring to me. I think that I only watch one game with my favorite football team every season. Caring about what people think of me is exhausting, I'd rather just do me; Dress how I want, Eat what I want, Do what I like. Then there's cars, I've never really been a car guy but I know how to work on them because of my brother. I'd rather have a car that can get me from point a to b that is cheap, not one that I have to work on or that is fast.",
            "Sports. A few years ago two of my coworkers got into an argument over their soccer teams, it was so ugly our manager had to intervene. Stern talks were given. Can't wrap my head around this.",
            "Same. I just can’t get the same joy/satisfaction of seeing a team beat another team. It’s fucking dumb.",
            "Almost everything I guess, but I just think that's human nature, you like what you like and others like other things.\n\nI guess you could say I could not care less about how other people care about what I care about 😅 to give an example;\n\nWas driving my friend and a guy he knew, first song that played was \"guttural slug - eye of the cyclops\", next song was \"imagine dragons - follow you\" and the third guy went \"wait, is this the radio?\" I told him it was my Playlist, he just chuckled and commented on how random of a switch it was, the next song was \"Bach - Chaconne, performed by Joshua bell\" he asked me to skip, next song was \"Ella Fitzgerald - when I get low I get high\".\n\nHe said my music taste was weird, I said \"ok....?\"\n\nI like what I like, and I don't really care how you feel about that 🤷",
            "Videogames. I kind of get why people get so into them but they just dont speak to me. I'll buy the new game everyone is raving about, play it for a couple of hours and lose all interest.\n\nI actually would like to play more than I currently do as there are measurable increases of hand eye coordination in those who play fast paced videogames. But I will never be more than a very casual player.",
            "Same here, sports.\nWhich is tough when you're in India, meaning 99% of the population are die hard cricket fans. Most of my family are fanatics of the sport.\n\nNow I love playing badminton but honestly have no interest in watching that either.",
            "Sports for me too. I always say society would be better off if people had as much interest in actually playing sports themselves as they do in watching others play sports on tv",
            "status",
            "Cars for me. 1997 Toyota Corolla go brrrr. I have no desire to drive a Ferrari, or any supercar for that matter.",
            "Cars and sports I don't care about them at all I prefer computers. Only time I watch sports is the world cup and that's when I have time",
            "Golf. It’s a stupid fucking sport, in my opinion, that’s expensive as fuck, a massive time waste to get good at it, and is a complete waste of natural resources (water and land). I have been asked repeatedly about golfing and grilled about why I don’t play golf. I never took the time to learn it properly because it’s always been boring to me. More boring than football, basketball, baseball, and tennis combined. Even bowling seems more exciting than golf.",
            "Cars.\n\nA lot of guys seem to be really passionate about cars, discussing the latest models, horsepower, technical specs, etc.\n\nWhile I can appreciate a nice-looking car, I really couldn't care less about the details or the hype around them.\n\nI'm more interested in how well a car gets me from point A to point B reliably and comfortably, rather than getting crazy about all the technical stuff.",
            "the obvious answer that I didn't see in a quick scroll though: DICK SIZE\n\nwho gives a fucking shit about this? women dont. I can tell you straight up that anything above 6 inches means a woman cannot fit it all in her holes so what even is the point? is so weird man. you wanna go though life unswallowed? you don't.",
            "Videogames. You can have all of it.",
            "Sex, not being alone, relationships, etc.",
            "Cars \n\nTo me, they’re purely utilitarian. They get me from point A to point B, and sometimes to point C on the weekends. Nothing more",
            "Soccer.\nBoring af",
            "Medieval Times",
            "I feel the same way as you OP.\n\nAlso I couldn't care less about alcohol",
            "Sports, alcohol, women (yay gay also the way I see some men flick a switch and act like they're gonna have to plan their wedding as soon as a woman is around that they're not even interested in feels so fake)",
            "Cars. Never really gave a thought about ‘em as long as they were reliable. I (66M) bought my 1st NEW car 12 years ago; a Fiat 500c, because I wanted “new” and wanted a convertible. Prior to that, my cars were ‘nice’ but were way less expensive than my budget could afford.",
            "Football and cars",
            "Cars",
            "Video games, cars, partying and hitting on random girls.",
            "Cars, sports, shoes",
            "Sex, dating, sports, cars.",
            "Football (soccer) I'm surrounded by a bunch of Celtic fans and it's their main talking point. Do not give two shits about it",
            "Football.",
            "Just life in general.",
            "Sports. I give zero fucks about them.",
            "Sex\n\nI wonder what the average guy would do if he knew he was never going to have sex again, for the rest of his life?",
            "car mobiles, sports ball games, the lot of it really",
            "Cars and watches",
            "Being respected or looked up to. \n\nWhen I see how hard other men try to impress, especially among those of my generation or younger I can’t help but think… has nobody told you women fuck losers as well? \n\nWhether it’s the fitness roided up clout chaser or the company man people pleaser, it feels like men constantly fight for validation.",
            "Hairstyle.",
            "Science fiction/mythical/anime movies, shows etc.\n\n\nI'm that guy who's never seen star wars, star trek, harry potter, lord of the rings, or any anime. ",
            "Cars.",
            "Getting sex. It's just sex.",
            "Career. I do not care I generally can be happy in any job, I don’t want responsibilities I don’t want to be a boss",
            "Cars, MMA, poker.",
            "Sports, especially that game with 11 millionaires on a field doing some cardio for 90 minutes and occasionally kicking a ball.\n\nI really don't understand how the most boring game in the world got so big",
            "If it's on TV, I likely don't know and definitely do not care.",
            "Cars. My friends seem to be very adept at car racism (e.g. “fuckin BMW drivers man”)\n\nWatching sports (i’d rather play). But like, how do they even DECIDE who their favorite team is?? Based on what, that you both live in the same city?\n\nKnowing all kinds of beer and alcoholic drinks. Poker.",
            "I don't care who is going to carry the boats. ",
            "What others think about me and comparing yourself to others.",
            "Sports is like a tradition that mostly comes from family and your friends.",
            "Watching sports, especially live. It just doesn’t do anything for me.",
            "Sports. I’ve never been into sports and couldn’t care less about any team in any sport.",
            "I’m Canadian in Canada and I don’t care about hockey. It’s not that I don’t love sports because I do, it’s because there’s too many games and I can’t keep up.",
            "I'm not sure if most guys care about this, but socializing. I'd rather do anything else than \"hang out\"",
            "Sex",
            "Same I'm also active have been since I was a kid but could not care less about sports lol",
            "Same for me.. sports, don’t hate ‘em but also couldn’t care less. It does drive me a little crazy living in a small sports mad country everybody looks at you like there’s something wrong with you when the topic comes up lol.\n\nEvery damn Monday at the office “did you watch the game on Saturday?” No I watched starwars, listened to a podcast, went for a walk, went to the gym and spent time with my kids and my dog lol.\n\nThe only time I get excited about sport is when there’s a big upsetting loss, I never understand how people get so uptight about it, but watching adults throw a tantrum because their favourite people with the ball didn’t do the thing with the ball 😂",
            "Watching team sports. I never understood why people get so worked up about team A winning rather than team B. What difference will it make?",
            "Gettin laid. I don't mind goin without sex for months",
            "I really am not a car guy the only cars I like or want to have are a Tesla , Aston martinDB9 , McLaren don’t care what model , or Mercedes \n\n\nI’d be okay with a polo even , but ask me about where I went to live and how I want my house to look and I won’t stop giving you options lol",
            "Body count.",
            "Blowjobs. Literally don't care if I never get another one again for the rest of my life, they just don't do it for me.",
            "Girls. Am gay.",
            "I give zero shits about sports. It just doesn’t interest me in the slightest and I have *tried* to get into it but it bores me to tears.\n\n“That person has the ball/puck, now they’re over there. Now people are screaming…”",
            "Yeah football",
            "I have no idea if this is actually a thing but from the internet it seems a lot of anglosaxons are concerned with their masculinity or lack thereof\n\nIt's never been something on my radar, it's not like I act overly feminine either, I just don't care\n\nAlso the draft, I have celiac so no draft for me",
            "Cars and trucks..... I don't get them. Esp. the LOUD one, the fake loud one, you know the cars with aftermarket fart cans or whatever that thing is called to make a corolla sounds like a mustang.   And also big trucks, I live in Texas, and 99.9% of truck owners that I know of have an office job.... and only the 0.1% actually have jobs that require them to bring lots of tools like plumbers and electricians and constructions. Once my buddy had to go back Mexico for 7 months, and he asked me to drive his truck around so the tired and lubricants doesn't go bad, I am a jeep cherokee owner, and let me tell you, that truck was hard to drive! stepped down all the way on the gas in order to make it to maintain a constant speed. ( he has the 2020 Ford F-150 Raptor) And that thing is super loud when starting up, whole block shaking type of loud.",
            "Hey look, a millionaire just through a ball to another millionaire, go team go!",
            "Looking through thus list, I pretty much agree with all of them. I don't like sports, cars, \"toxic\" masculinity. I'm a Prius driving nurse, married, 2 kids, I don't drink. I do like guns (I was in the military for 15 years), but I only own 1 pistol and 1 rifle. I really don't have any male friends. I don't care about big boobs and big asses. I'll cuddle the fuck out of a little kitten and play with a baby for hours.",
            "I love playing sports and I love to stay active, I rock climb, hike, play basketball, lift. But god I couldn’t think of a worse way to spend my time than to watch someone else play sports. Unless I’m the one playing, i get so bored. Unless it’s a friend of mine I’m cheering on or something \n\nBut yeah I feel you. It’s always something most dudes can default to, it’s always kinda awkward when I’m talking to a new co worker or something and they’re like “so you watch any sports?” And I’m like “nahhhh not fr”",
            "Penis size.\n\nNothing special here myself, just a normal lad with a normal knob and I'm just not bothered. \n\nWas never a stud or nothing but never really struggled as I was finding myself growing up, just never really had any hangups over my penis like so many would at school or mates do/did. \n\nIs what it is, make it work good and those you share it with with should enjoy it no less.\n\nI dunno, I guess if you really have been unlucky ij that area thanks to nature, I suppose the knock to confidence can be harsh. Just I've never bought into that 'bigger is better' approach is more what I mean so I don't mean to offended or dismiss real issues some may genuinely have. I just don't dwell on that or boast on it like many did around me all my years is all.",
            "I’m the same height as you and have been an avid sports fan my whole life. Parents got me into sports as a small child and I made some of my best and earliest friendships through sports. It’s an upbringing thing not a height thing.",
            "Video games, sneakers and big boobs.",
            "Sports.",
            "Sportsball, beer, vroom vroom cars, ...",
            "Ball sports and cars",
            "What other guys care about, aside from friends of course.",
            "Sports.",
            "Sports.",
            "Hanging out alone. Some dudes I'm friedns with can't be alone for long, and think it's an indicator of poor social skills/having no friends. I'm perfectly fine eating at a restaurant alone, spending my weekend alone or go out to a party alone if no one is available. I think self confidence starts with being comfortable with yourself. Edit: added a sentence",
            "Football, and cars. I used to enjoy watching and playing football when I was younger but don't really care to follow the NFL anymore. Also in terms of cars, I do care about how the mechanics of it works but I couldn't give less than two shits about having some hot rod sports car. Being able to get me from point A to point B is what's most important. I do care that it at least drives smoothly though, as I do love driving.",
            "Sports and cars. \n\nI played handball for 10 years and really enjoyed playing it, but i had at no point interest in watching any sports.",
            "Sports. Why would I care what those people are doing?",
            "Cars.",
            "Cars",
            "I don’t drink, not because I’ve ever had a problem with it, just don’t like the way it makes me feel.\n\nYou’d be surprised how often I get blank stares when I tell people I don’t like to drink.",
            "Video games \n\nI played a lot when I was like 9-14 but once I started drinking at 14 I kinda just went down that route of drugs and alcohol instead . Eventually sobered up abit but still just don’t see the appeal in sitting and playing games on the tv",
            "Sports.  \n\nIt used to be sports and cars.  But er since I started doing my own car maintenance when I can to save money, I've realized I *love* working on my car.",
            "Football, Cars. I like Planes tho",
            "Sports for me too.  I also have an aversion to what most guys consider \"hot girls\".  To me there's nothing more repulsive than a makeup caked valley girl or TSwift wannabe.",
            "Cars.",
            "Cars",
            "What defines a man. I hate toxic masculinity.",
            "Video games. Havent played one since i was in college",
            "tbf most things",
            "\"Thick/curvy\" (let's be real, fat) chicks.\n\nAin't nobody calling Sydney Sweeney curvey, despite being what the word originally, and should always have meant",
            "Someone already said it but caring even the slightest about sports is cringe and for the smooth-brains. Playing a sport itself can absolutely be fun, but incorporating the sportsbro personality into yours? Yeesh. And I positively detest how there are dedicated sports \"news\" channels, acting like that shit is important and newsworthy. Literal bread and circus shit.",
            "This is what i dont get. They are objectively ugly designs imo",
            "I buy Asics for great heel support, 15 years now, have worn the last pair for a very long time.\n\nI don't care about the look, sometimes they are blue-red, sometimes black-white-yellow, what matters is the fit.",
            "I'm with you on this. I also think the wearing super vibrant and elaborate sneakers as an adult looks childish. I'm in my 30's and when I see guys my age and older who are \"sneaker heads\" I cant help but think this is the stuff we were wearing in middle school.\n\nAn unpopular opinion I am sure. But I dont like the trend of grown men dressing like children indefinitely.",
            "Yea.\n\nIve broken my ankle thrice, i just got for the most comfortable shoe possible.",
            "Even though I collect the ones that I couldnt afford as a kid, I agree with this...it's like beanie babies.",
            "Shits dumb.",
            "I thought this was just an internet joke; do people actually pay $100 for sneakers?",
            "Fuck Yeezys but Jordan’s are a work of art to me. I was also named after him. But I’m with you, I won’t pay more than 200-250 per shoe. I try to only buy 3-5 pairs throughout the year",
            "I used to be like that. \n\nI sleep in very feminine poses now. I used to struggle with sleep but now I sleep better than a baby. \n\nI like putting on masks and going to spas now. I'm not rich enough to go regularly, but my body thanks me for going. So does my brain. \n\nGot other examples but It's definitely a much better life I live now that I don't care about doing feminine things.",
            "Real, ancient warriors cried when their brother in arms died and they fought for their wife and child and mother and hugged and kissed them when they got home.\n\nThe Stoic Bros need to learn what Big Dog Energy is, and why it involves men not caring qbout their image when they play with a toddler or pet a little donkey foal.",
            "Yeah, don’t make your problems other people’s problem. I’m insecure, that’s my battle. I’m not gonna make it anyone else’s ",
            "For drinking cider??\n\nJesus fucking Christ, some people are insecure. The fuck are they gonna do when they visit France, Germany or England? Start beef with everyone?",
            "Anybody who is going to call you out for not being a  \nreal man is trying to manipulate you.  There are as many ways to be a man as there are men.  Fuck 'em.",
            "I just blow them a kiss \n\nTends to shut it down instantly (I'm not gay) it just conveys the lack of fucks I give perfectly and often they simply don't know how to deal with it at all",
            "The list of things these dorks claim is \"unmanly\" is both hilarious and sad.",
            "Several years ago a \"gentleman\" in a somewhat classy bar called me an epithet (that starts with \"f\") for sitting with my legs crossed. My comeback was something like \"ok dude I haven't heard that one since middle school\" and continued ignoring him. Some meathead bro on the other side of the bar overheard and had other ideas--picked the guy up by the neck and threw him through several tables and chairs. Now *that* guy was a man.",
            "Wearing sandals is unmanly? Never heard that before. I wear sandals year round. I would wear sandals to work/gym if i could.",
            "The sandals part is weirdly funny to me cause living in the down under of New Zealand, both here and our neighbour Australia, Sandals are very commonly worn on men and no one thinks anything of it. Such a unique culture difference",
            "But did you beat Elden Ring without summons?",
            "Now I’m nearly 36, I’ve thankfully shaken off the silly attitude that in terms of alcohol I shouldn’t be drinking ‘girly drinks.’ And worrying about what other men think. \n\nI joyously drink a fruit cider or a sweet cocktail more often than not these days.",
            "Last guy to \"Man check\" me ended up wanting to fight. As someone who enjoys a good scrap I engaged and he immediately ran back to his girlfriend. Most guys who do that shit are the weakest, most insecure people in the world.",
            "All my homies love apple booze juice",
            "> When a dude shits on me for drinking cider or wearing sandals or something they perceive as unmanly and act like I'm some kind of pussy. \n\nMaybe I just live in a weird corner of the world but this just... doesn't happen. 99% of other men don't care that you exist (the other 1% yell at you from their car or try to fight you outside supermarkets for no identifiable reason); it's women who chide you for not being masculine enough.",
            "Well said!",
            "Fellas, is it gay to wear sandals?",
            "I wear my birks with socks DONT care.",
            "The Roman’s and the Macedonia’s before them conquered the world in sandals.",
            "Being independent is literally a masculine trait. Giving into peer pressure is feminine it's not masculine at all. Retards lol.",
            "It took me accepting being gay to not care LOL, so assuming you're not good on you. So many stupid standards for what?\n\nSide note. Ew dude you drink cider",
            "Where do you live that you’re constantly getting man checked? Are you just inventing scenarios in the shower that make you feel like a tough guy",
            "Like liking their posts/pics in the hopes they can date them or something?",
            "It is incredible how desperate a lot of men are (of all ages) when it comes to getting women's attention.\n\nBut then you go on IG and see men in every comment section of random women's reels accusing them of being attention whores. Perhaps betraying their own jealousies.",
            "I've always loved cars since I was a kid, just fascinated. I've grown to appreciate even more generic cars for being important point in automotive history. I can understand not everyone likes cars, I just hold distance for people who can't be bothered to do basic maintenance and are surprised the car fails on them.",
            "I said this as well. BUT I do be needing heated seats&wheel and vented seated though.",
            "I don't give a shit about vehicles in general, and I work in the automotive industry.\n\nI regularly have to endure long discussions about cars during almost all lunch/coffee breaks. Conversation goes on normally, then one person mentions something car related and I'm suddenly unable to contribute anything.\n\nI still have no idea what a \"V8 engine\" means, why is it special, why is it so rare and why there isn't V10-12-16. I'm too scared to ask it in case it's such a trivial thing and I'm stupid for not knowing it even though I work with vehicles (in a way), and I'm too unbothered to actually read about it.",
            "I got a brand new car (first EV) and everyone seems way more interested in it than me. My family and friends ask me how much it cost, the horsepower, range, different driving settings etc. and my predominant answer is \"I like the color\" and that's about it. If tomorrow you gave me a car that drives me without issue from A to B in the same color I wouldn't give a shit.",
            "I care about cars, but not car engines. I want to know about the interior. That's where I'm going to spend all my time.",
            "When sometime tells me that they're alpha, I ask in a low tone, \"Is that a furry thing? Good for you, my man!\"",
            "There’s a caveat to this: there’s a difference between changing who you are as a person for a woman, versus growing in the relationship.",
            "My thoughts exactly. Be yourself, if you fake yourself to get a girlfriend you’re gonna either be stuck faking who you are or end up in a bad relationship once they find out you’re making it all up to please them. It’s better to be who you are and find someone who is willing to put up with that.",
            "Yeah. Changing who you are FOR someone because you think they’ll like you better because of it, or worse because they demand it, never works. \n\nBut in the best relationships you will change, because the right woman will bring out the best man in you.  Here’s the thing though, it will be mutual. When it’s the best, you’ll bring out the best in her too.",
            "I think a lot of people confuse \"becoming the best version of yourself\" with \"becoming someone that fits imaginary checklist\". \n\nIf you are really into idk dinosaurs - cool. Own it. Maybe take her to a museum of dinosaurs, maybe watch jurassic park, maybe talk occasionally about some cool excavation. And if she actively hates on it, well she isn't the one, don't change it.\n\nBut that doesn't mean you should stick to being a jerk or an unsanitary person or to being aggressive and arrogant if those are characteristics you have. That is not what people mean by \"being who you are\". Be the best version of yourself - in this example, be a dino nerd who listens to her problems, who genuinely enjoys making her happy, and who has a healthy amount of empathy, respect, and good standards to decide what is right and what is wrong. It doesn't mean turning yourself into a worm for her, or into some idealized jacked alpha model finance bro god which makes you miserable.",
            "camping lol  I told my boss I submitted 3 days PTO for a camping trip and he said \"oh, u gonna fake being a homeless for 5 days then. \"( I asked wed thur fri off, plus weekend so it's 5 days)  And then I was like speechless, cuz he's got a point..... Homeless, but like the fancy homeless though hahahaha.",
            "I love fishing, but half of the enjoyment for me is just being in my canoe with my binoculars, looking at plants and shit, fucking with a beaver here and there, don’t smoke or drink anymore so slamming nice cold seltzers and burning a little incense. Last weekend my buddy and I went through a culvert and found these hand sized fishing spider, never knew we had such shit in Maine. \n\nI also enjoy finding inlets my canoe has no business being in, and being in it.",
            "I’ve always found the attitude of ‘if an ass isn’t huge then it’s not nice’ stupid. \n\nA small and shapely ass is perfectly nice.",
            "Thick/curvy just means fat. It's fine to like fat people. It is not fine to delude yourself into thinking you don't when that's your type.",
            "Good. More for me.",
            "I had a friend who would always mention his girls dump truck, chick looked like Violet Beauregarde the blueberry girl from Willy Wonka, waddle and all.",
            "🙌",
            "Hey Sheldon",
            "Sounds like my husband. I’m way more of a car person than he is (he used to drive a Mazda5 which is a good indicator of that) and he can talk about trains and their engines for hours. His favorite camping place is one that has a train track that goes through it and he’ll go a sit and wait for them to roll past.",
            "Trains scratch my itch for efficiency just right. I mean, if we know a certain number of people will have to move from location A to location B at time X every day (e.g., commuters) - why wouldn't we pool them together so nobody has to be in a traffic jam and everyone can just relax instead of having to focus? The car can still be there for travel that doesn't follow that pattern.",
            "I’m glad someone else feels like this. I just stand there not understanding what’s meant to be good/fun about it. I want to like it, because I feel I’m missing something, but it just does nothing for me",
            "I have to admit I thought the same until my gf took me to see Lady Gaga - I mean I don't even listen to her actively, but it was a great show and the sound quality was nice.",
            "That being said I wouldn’t mind being very comfortable Handling fire arms but owning them or collecting them like 80% of my buds do is just not appealing",
            "Shooting at cans with a BB gun is so much fun.  Beyond that... eh.",
            "That’s fine. You don’t have to. Just don’t try to stop the rest of us from enjoying them.",
            "Most guys don't care about guns, either.",
            "In the US you're average at 5'9\". Almost every man is going to be about that height with some taller and shorter outliers.",
            "5’9er here, I’m pretty sure 5’9’’ is the tipping point where you aren’t short enough to care about your height because I’ve always felt the same way. \n\nOnly time it really crossed my mind is when I was hooking up with a 6 foot tall chick back in my 20s, just a lot to manage in bed lol.",
            "I’ve loved video games since I was a kid, but I have found I’ve lost patience with them as I’ve got older. \n\nI’ll play games on lower difficulty settings and look at walkthroughs when I get stuck a hell of a lot more now than when I was a teenager.",
            "For me it's definitely the fact I spend most of my work day on a computer. Granted, the phone isn't much better as a screen, but it's still somehow like my brain now connects my personal computer to work to not being fun.",
            "I watched a few MMA fights. I liked learning from the commentators what the moves were called, but I was disappointed soon by the way the men fought. I noticed the same pattern with each fight. They would dance around, feint *a lot*, and eventually grapple on the ground where one would win. There was some variation, but that how it went for the most part. It was the lack of actual fight while standing that got me. They seemed too afraid of getting hit to chance trading blows. The women, however, showed none of that fear. Ironic given the stereotypes.",
            "I done boxing for a good while but I couldn't be arsed with watching it on TV and it's the only sport that I was really interested in when I was younger now I just do small workouts at home. I used to do long distance running but I don't have time for that any more.",
            "You think most guys care about these?",
            "I don't think it's only the superficialness of it all. I find it's the fact you can't change it. \n\nYeah, there's a basic maintenance of it all. Showering regularly, trimming the beard etc. \n\nOnce you pass that, attractiveness is based off what the family tree has given you. I can't help or do anything about the less than desirable traits given to me. 💀",
            "I think the same about vehicles until I see a fighter jet and something in my brain transports me back to childhood when I watched Top Gun with my dad. I could watch them all day.",
            "I agree, I like sports but can’t imagine letting the outcome of any game affect me one way or another. Haven’t played a video game in like twenty years.",
            "Same here man. I have friends that are all about material objects. Man I don't care,  I got the best girl I could ask for and the most awesome dog. I got you and your material shit best by a mile.",
            "once you understand how the sports work and see athletes play it at a high intensity level and there are huge stakes it becomes way more exciting than anything else tv can provide. Also not scripted for the most part just pure live entertainment. I used to be the same way",
            "They say they don’t but watch their eyes light up when they hear which guy has a big one.",
            "> women dont. \n\nWomen say they don't but will immediately go after it if it suits them.",
            "Me too. I have tried but I don’t get the appeal.",
            "Asics are perfect, i've been wearing them for 15 years. Only downpoint sometimes is the mix of colors they do.",
            "thats the standard price for plain nike or addidas sneakers no? I can´t really find much cheaper in my country, maybe 70 or so.. not US tho",
            "Bro I have two pairs of shoes in total, both 5+ years old, you're spending way too much",
            "I love my jordans they look amazing but they are so uncomfortable compared to all my other shoes  a good pair addis or some some converse are my day to day. i only wear the jordans going out",
            "Can I ask what a \"feminine\" sleep pose is? I am genuinely trying to understand a concern like this because I have never had it.",
            "Great attitude to have, and I hope someday you can find your peace brother.",
            "I honestly think most of the time it's just a pre-programmed response they're passing on from someone else. \n\nLike a Douchebag NPC. They heard someone say \"Sandals are for queers\" somewhere and now it's one of their pre-loaded dialogue options like \"Mondays am I right?\"",
            "Never played elden ring honestly. \n\nLast new video game I played was The Witcher 3 GotY edition back at the start of the pandemic. \n\nBuilt an Igni Flamethrower glass cannon and had a ton of fun pretending to be a dragon",
            "Why would you enjoy a fight? I don't mean a playfight like in boxing or martial arts, but a real fight? A misplaced finger by a drunk opponent can mean a loss of eyesight, a fist to your temple can mean serious brain damage, and even just a kick by yourself can mean legal consequences or damage to your own feet, legs, or arms.",
            "I mean it's usually not randoms at the bar, though I've had a guy and girl bartender on separate occasions pull the cider thing. \n\nIt's usually a \"Friend of a friend\" someone invites to a social function who's trying to be the biggest personality in the room and ya they're usually male. Women are usually just glad I brought cider so they can steal one of mine instead of drinking whatever light beer or lager the guys are drinking.",
            "> it's women who chide you for not being masculine enough.\n\n  \nMaybe I live in an even weirder corner because neither men nor women have chided me for a lack of masculinity since middle school. I don't know what kind of people you associate yourself with.",
            "I don't think giving in to peer pressure or being independent are inherently masculine or feminine. \n\nI think it's more just a matter of being a secure or insecure person.",
            "Gaurdog is right it’s just about insecurity",
            "Lol, would ya look at this special little guy.  Just smearing his little dick energy all over the place.  I agree with gaurddog, it just makes me pity you.",
            "That kind of paints feminism in a negative light, just like masculinity it can be toxic when too fixated on but generally I don’t feel feminism means submitting to peer pressure. I know many independent free thinking women. I’m sure you do too.",
            ">so assuming you're not good on you\n\nBold assumption lol. I'm Bi\n\n>Side note. Ew dude you drink cider\n\nDam right. Enjoy your 3.5% abv grain juice wackos. I'll be over here drinking crisp apple juice sitting around 5%",
            "From Australia and getting man checked is definitely a thing here",
            "AND (I think) an additional caveat to that: the person with whom you are co-flourishing the relationship needs to be a good person. I got lucky; +40 years ina great marriage and still growing.",
            "I think that's why so many divorces happen. Eventually the schrade stops. Better to just be upfront and honest.",
            "What if you end up never really finding someone who you connect with? It seems inevitable you have to change and grow to be desirable to women. If you aren't certain things, you remain single (I am a good case of that unfortunately 😅).",
            "Butts and boobs are like all good things in life - they come in various shapes and sizes and we appreciate all of them so long as they are clean and smell nice.",
            "To be fair fat distribution does matter alot in determining how detrimental to your health it is. That means two people can have the same amount of fat and one be healthy and the other not simply based on fat distribution. ",
            "I used to think the same thing but the gym changed my mind.",
            "You don't have to like it. It's for a certain type of audience.\n\nI prefer concerts on various town/city festivals (beer/food/family friendly/etc.). The main point is the event, and then there's also some bands/performers doing some music on stage but they are not the main attraction so they don't blast it on full volume.\n\nConcert concerts are so fucking loud that I simply do not hear the individual instruments. If I don't know the song I have no fucking clue what's playing. That's not enjoyable for me.\n\nAnd I don't follow bands so there's basically not even a single band that I would even want to listen to for 1-2 hours straight. Instead I just listen to music I like, I don't care if a specific artist wrote it if all their other songs are shit. I can probably count on one (max two) hands the number of bands/aritsts who has more than 5 songs I like.",
            "I thought you were on about my bald twins, Des & Troy 💪🏻",
            "If you think shooting BB guns is fun why would you be skeptical at shooting an actual firearm?",
            "And there you are lol. Only took ya 2 hours to show up sir  welcome we are currently talking about cannons we have moved from guns to cannons",
            "5’9 myself and I had a girl tell me, while we were on a first date, that I was too short for her. She was 4 fucking 11. And she was serious.\n\nI picked up her coffee and placed it on a nearby merchandise shelf that she couldn’t reach before wishing her all the best and walking away. The only thing she did was say “What the fuck?” as I left",
            "I’m 5’9 too, and I didn’t care about it until being single. So many girls said things like “oh, you’re a bit short” or “mmm, you’re not that short I guess”. Hated that they made me sad/insecure.",
            "Facts. Especially with a baby. I just didn't have time to grind against the hard difficulty in the name of my hubris. Easy mode, main quests, let's get it done.",
            "There are dozens of us! Dozens!",
            "It is extremely hard to be unattractive when you are well-groomed, smell nice, wear clothes that fit, have at least an average physique and have a likeable character. \n\nSure, you are not going to model for a fashion brand that way, but you won't have issues attracting women either.",
            "I remember being a kid and watching my tough as nails dad watching the Olympics and trying to hide his tears after a sprinter stumbled in a race or something. I’d never seen him cry. He noticed me looking at him and said “Do you realize the sacrifice and hard work it takes to reach the Olympics? The years of preparation and then to have your dreams shattered in seconds?” Fifty years later I still remember that day, never watched sports the same since.",
            "Video games are about exploring a world someone else has built. Also it's about interactive storytelling. In a movie a character acts a certain way because of their principles but in a game you can be evil or good the choice is up to you.",
            "Bros with shoe fetishes don't realize they do.",
            "I’d love a pair of Air Jordan’s.",
            "Thanks boss. I’m 37, I think I made peace with not finding peace. It’s oddly liberating ",
            "Makes you wonder though, who was the original Douchebag NPC? Who scripted the pre-loaded dialogue?",
            "I'm lying here with a scrumpy hangover trying to figure out why cider is the pussy option 🤮. Kept asking for lager and getting brought over more cider. Now it feels like a man made of rotten apples sat on my head and shat in my mouth while I was sleeping. Think might die.",
            "I don't think there's any sort of stigma attached to what drinks you order in Oz. Maybe the 50+ crowd might rib you over the brand of beer you buy.\n\nIf anything, I'm the arsehole. We'll go to fancy cocktail bars and I try to pressure people to at least *try* the classic cocktails before ordering bougie fashionable stuff. Like I just find it grating when someone orders something with 12 ingredients, 2 of which are whiskeys, and then they admit they've never had an Old Fashioned. Like... you want to use the classic spirit-forward cocktails to develop your palate first.",
            "Well if you read into human history it's typically women that congregate in groups and worry about what others think or what their status is within a hierarchy. if you look into how women socialize a lot of it is gossiping and talking about other people and what they think of each other.\n\nEver wondered why the majority of investors, explorers, philosophers or engineers of note were men? It's because independence, risk taking and courage are masculine traits that fuelled these endeavours.",
            "See my reply to thet bro. Have a better look at human history and general behaviours. Men and woman are not the same.",
            "Imagine being a male in your forties and talking like this 😂😂😂 no wonder no woman will look at you. Go check yourself into the mental health ward at your hospital and get help.",
            "I didn't reference feminism, I was referring to feminine behaviour, typical behaviour of the majority of women. Men and women are not the same.",
            "Am sitting here with my strawberry daiquiri with my pinkie roasted to the ceiling.",
            "Ok but responding by challenging them all to a shot contest? Like come on. How lame can you possibly be.",
            "I think you mean “[charade](https://www.merriam-webster.com/dictionary/charade)”",
            "The difference between the figure 8 and the figure 0.",
            "> alot",
            "I thought they had been upgraded to cannons good sir cannons I say !",
            "lol just now got that destroy line 😂😂😂😂 \n\n( tips hat 🎩).",
            "Real guns are a lot louder than a BB gun.",
            "I'm not skeptical -- I just find it less fun.  Still fun, but not as fun as plinking cans in the back yard.",
            "If you’re making a reference, it’s lost on me.",
            "Hah, yeah, there are a lot of us who enjoy DC and/or Marvel.\n\nIs that a Kingkiller reference in your username?",
            "The same holds true for watches and colognes. It gets ridiculous.",
            "I hope you do find your peace though, some how some day. We all deserve to have some peace.",
            "Must've been Dave, only difference is he's just a plain doucebag not an NPC.",
            "Ya that's definitely an asshole move. \n\nBut I get it, I used to collect high end whiskey and it was always difficult to bite my tongue when someone wanted to mix a 12 yr rare bourbon or a 20yr scotch with coke.",
            ">Well if you read into human history it's typically women that congregate in groups and worry about what others think or what their status is within a hierarchy. if you look into how women socialize a lot of it is gossiping and talking about other people and what they think of each other.\n\nI mean...men also gathered into groups. \n\nHumans are social animals. \n\nKinda basic biology\n\n>Ever wondered why the majority of investors, explorers, philosophers or engineers of note were men\n\nI don't really wonder because I know. It's because human society was patriarchal for most of history and those roles were largely closed to women \n\n>? It's because independence, risk taking and courage are masculine traits that fuelled these endeavours.\n\nI think you're just attributing what you see as positive qualities to having a penis and negative qualities to having a vagina to help you perpetuate a narrative that you're somehow superior to woman. \n\nReeks of insecurity and virginity quite frankly.",
            "Lol, says the guy who's defending himself all over this post.  So confident to be alone, but still finds himself calling people retards on social media.  I'm glad you found peace with being alone,  no hope anyone would want to spend more than 5 minutes with you.",
            "Fair, but to that point; There are far more single women taking a family leadership role than men. \nI was making a point against the generalization of women being more prone to peer pressure. In my experience men are more prone to falling to pressure from their peers. Especially young men. \n I have a pretty good grasp on the fact that the two sexes are not the same, I just don’t think they are so different that individual circumstances don’t matter.",
            "Like I said, I was young and dumb \n\nGuys in their late teens and early twenties do stupid shit.",
            "Thats true and thats why we wear ear protection",
            "Pretty much anything smaller than 50 cal is pretty easily manageable with hearing protection. 50 cals suck so bad though.",
            "Yes! Those books are the best writing I have ever come across. Not my favorite writer but definitely the most talented with Steven Erikson and Malazan close behind. However my favorite is Brandon Sanderson's cosmere.",
            "Can you explain what you mean with your point on women taking more of a family leadership role than men?",
            "[deleted]",
            "Did you also factor into your theory that women initiate around 70% of divorce in North America? Or the fact that companies are targeting white men by having anti hiring policies if you are a white male? Or even just male? Or all the diversity and equity scholarships in universities and colleges for women or immigrants only? Or the clear anti male bias in the media and school campuses?\n\nIs it any wonder men don't want to date and support nasty women with bad attitudes that cheat on them or leave them when they get bored? Did you factor any of that in?",
            "[deleted]",
            "A system that has benefited white men that have been the majority of casualties in war and work place accidents? That built the country and infrastructure that you are using to type your racist and disingenuous comment?\n\nGo spend more time getting indoctrinated into cultural Marxism a bit more, that'll help all the happy single mums out there."
        ]
    },
    "I gave a girl at work my number, but I think it was a mistake. What to do?": {
        "title": "I gave a girl at work my number, but I think it was a mistake. What to do?",
        "score": 429,
        "url": "https://www.reddit.com/r/AskMen/comments/1dlgnus/i_gave_a_girl_at_work_my_number_but_i_think_it/",
        "content": "So as the title says. There is a pretty cute girl at work who I’ve been catching her (what I thought was) checking me out and smiling at me for the last few weeks. This is literally daily, although we don’t work directly together. We have talked and she is shy but seems into me. I was trying to find a subtle way to show interest but not harass or embarrass her so I decided to write my number down and give it to her at the end of the day today and said “hey I just wanted to give you this, just in case but there’s no pressure if not”. The thing is, she looked mortified. I thought I was being respectful as well as showing interest but now I’m def 2nd guessing. I’m not a creeper so I’m trying to find the best way to go about this from here. I kinda want to apologize for misreading the situation (if that’s what I did) but would it be best just to act like nothing happened and move forward? ",
        "num_comments": 151,
        "comments": [
            "Well, after you make a move it is usually on the other person to respond. If you get nothing, just move on. No need to make it more complicated.",
            "Can't undo it, so just forget it ever happened and never mention it again.",
            "Do nothing. Just go about your life. Don't act weird. \n\n\n*\"I kinda want to apologize for misreading the situation\"*\n\n\n\n(Kinda? Either you do or don't want to)\n\n\nJust don't OP. Let it go. If she doesn't come and say anything then just leave this in the past and don't bother her. \n\n\n*\"but would it be best just to act like nothing happened and move forward?\"*\n\n\n\nYes.\n\n\nNow onward to the next post. ",
            "Pretend it didn’t happen.",
            "are you sure she was mortified? maybe she was just shocked that you were interested/made a move. i know if it was me as a shy girl i would lowkey just be shocked and wouldn't know how to act",
            "Go ask her for your number back.",
            "You'd best get started with planning to move to a new state.",
            "Let me tell you the story of a dude who asked out a chick at my job. I only heard about it secondhand, after the fact. I believe the verbiage used when he asked her out included some variation of “in love with you.” She turned him down. I think later on he made a pass at one or more of her friends from outside of work. Nothing creepy, to her or her friends or anyone hearing the story, but a brazen show of interest and maybe a little desperation.\n\nAnyways, the crazy part is that… absolutely nothing came of the rejection. They have remained cordial and professional at work ever since. Your situation might be the most important thing on your mind right now, but if she says no it’ll just blow over and turn into a funny little story.\n\nThere is a caveat, however, that it will likely be a story that is shared with your coworkers. I had no business hearing about the story I shared; I learned it against my will at a company mixer from a particularly catty colleague. That might be a little embarrassing for you, because these things tend to awaken the inner high schooler in people who only know you as a corporate robot. But you have nothing to be ashamed of. For everyone who hears about it, take pride in the disruption that your pursuit of a relationship caused in their monotonous work life. \n\nLet me also tell you the story of another dude who gave another chick his number at an office mixer for the same company. He made his move like 5 years ago and they’re getting married this summer. Don’t buy into the “don’t shit where you eat” crowd. Thousands of people meet their future spouse at work. Jobs at your (I’m assuming) young age are temporary, and unless you both are planning on retiring at your company you won’t have to deal with any potential negative consequences for long anyways if she says yes.",
            "Give it to other coworkers and make a happy hour. Cover your tracks ",
            "Honestly man I’m saying this cause you just got the job, don’t let the kitty fuck with your money. Too many women out here to even risk that. Leave your job your job, and your personal life your personal life.\n\n If you’re under 6 months in a position you’re already in a bit of a probation period, don’t play with it. ",
            "It says a lot that you gave her your number instead of asking for hers and that you assured her that you didn't want her to feel pressure.",
            "Dude it’s not a big deal.  You shot your shot. Act like nothing happened.",
            "It's alright. Ultimately, giving your number to a woman would theoretically be more comfortable for her. As she has no worry about you spam texting her, etc.\n\nIf she is as shy as you say she is, let her chill for a bit and act like not a single thing happened to put no pressure on anyone.\n\nAs others said, balls in her court and I think you did it respectfully. She'll either text, or not, the end. Best to try and not overthink it!",
            "Let me repeat this for everyone. NEVER AT WORK. I know it can be tempting sometimes … But, it is almost never worth it and causes more problems than benefits.",
            "Never get involved with a coworker. Big mistake",
            "Don’t think you did anything wrong here.  You thought there was something there and you let them know you’d be open to hanging out outside of the workplace.  That could be open to all sorts of interpretations.  You could easily play it as you thought they were someone that was pretty cool and you wanted to get to know them better.  It doesn’t have to automatically lead to romantic situations - just a chance to get to know the people around you better.\n\nNow the wisdom of dating someone from the same office is an entirely different conversation.  And one you want to think very carefully about - there’s a whole Hollywood genre based on the concept of an office romance that goes bad.  And I’ve also seen it happen several times in real life and it’s never turned out well for anyone.",
            "For next time: tell her you like her, but don’t want to put pressure on her. Shy girls can convince themselves that you gave your number for another reason. My wife believed her roommate that I was smiling at her roommate when they were next to each other in the elevator. Her roommate was ugly.",
            "Bro it's a normal thing why you think it's creepy",
            "No wonder the birthrate is in the shitter",
            "Don't feel bad. Let it roll off your back, dont be fazed and it won't be awkward.",
            "man i did to a girl i later found out was married the cringe was unbearable",
            "IMO I think if you want to do a followup apology conversation, that would be fine and maybe even appreciated by her (if you're reading her reaction correctly). She might feel a little relieved to get back on common ground with you, so she doesn't have to wonder/worry about where your head is at. Especially since you have to continue working with her. (next time don't hit on girls at work!)\n\nYou could just say something short like, \"Hey I think I might have overstepped yesterday. It's totally cool if you didn't actually want my number. We can just forget it happened if you want.\"",
            "Don’t shut where you eat. In any case, best to let it lie. You weren’t rude or anything so maybe she was just shocked.",
            "It sounds to me like you handled this perfectly. Ball is 100% out of your court, if she doesn't text you be cordial and polite, and never ask her again.",
            "Yes correct just completely act like nothing happened. Also just ignore her in a nice way so she doesn't get pissed at you and start saying your a creep or something. God speed soldier.",
            "Never apologize for liking a person",
            "If you're good looking go for it. If you are not she's not interested. \n \nI doubt that's going to be popular here but it's painfully true.",
            "Expect a call from HR.",
            "Learn from it and don’t do it again…………. Ever",
            "Why are people so weird about being interested in someone? Passing them your number? Like you couldn't just invite them to lunch or something like a normal person?",
            "Pretend it never happened. That’s the best course of action you can take.",
            "**You fucked up big time**.\n\nMistake 1. Hitting on a girl at work. The potential risks far out weight the potential benefits. \n\nMistake 2. Always make sure there's no evidence. Some girls are A-holes and can ruin your life with something as small as a piece of paper.",
            "I know many relationships that started at work. It's normal, as long as there isn't a power imbalance or you weren't harassing or punishing them for their response.\n\nI personally would never date a coworker unless they are in a completely different department.",
            "If she doesn't reciprocate, don't bring it up again.\n\nAlso, take a moment to consider it (which was very polite and discrete) from a woman's point of view.\n\nShe probably looked mortified because she's expecting that if she weren't to talk to you, then things would get super weird at work. Not to mention that IF she were to reject you (or go out on a date and it not work out), she may be assuming that you'll be a gigantic anus about it and/or persistently badger her into going on another date.\n\nYou've taken your shot, and it sounds like it won't go anywhere. Don't make it awkward or weird.\n\nIf you ever need to interact with her going forward,  make sure it's only about work and nothing else. The last thing you want is to be accused of harassment or even perceived to be harassing her.",
            "Did she keep your number?",
            "Dude don’t you know if like women your the g part of lgbtq+ /s hope I got the letters right",
            "A well respect shot taken and I hope u the best mate!",
            "Good on you for trying!\nYou did nothing wrong.",
            "I think where you went wrong is by making a bold move without establishing a rapport first. If you had spent more time just talking to her in person you would have a better gauge if she was actually interested. And even if she wasnt interested, you giving her number would seem less out of the blue.\n\nWith that said I dont think its a big deal at all.",
            "Good on you for taking that chance man. Obviously don’t know the situation, but it’s often worse in your own mind than it is in reality. \n\nIf someone gave you their number the way you did to her,  and you had no intention of perusing things, would you be mortified? Probably not. Just keep being casual so that you show there are no hard feelings.",
            "Girls can be stupid sensitive and it’s not our problem as men to worry about that. If a grown up wants to act childish and be offended by some simple, not your problem. I hate how girls will act like you’re a creep just because you’re doing a normal thing for men. But I just don’t think about it. They can waste their lives thinking dumb things. We just take the women we want and can have",
            ">I was trying to find a subtle way to show interest but not harass or embarrass her so I decided to write my number down and give it to her at the end of the day today and said “hey I just wanted to give you this, just in case but there’s no pressure if not”.\n\nGetting involved with someone that you work with is never a good idea. The possible backlash from it if (when) it goes wrong is not worth it. You doing this most likely placed pressure on her. Workplace harassment is not something to mess around with. \n\n>The thing is, she looked mortified. I thought I was being respectful as well as showing interest but now I’m def 2nd guessing. I’m not a creeper so I’m trying to find the best way to go about this from here.\n\nI think her expression (reaction) said it all. She most likely thinks that you're a creeper now. The best way to go from here is to just forget that you gave her your number and avoid her. Don't try to apologize. She'll just think that you're doubling down on your creepiness.",
            "Yeah it makes it awkward for sure now if she doesn’t want anything she has to feel awkward. Just don’t shit where you sleep or eat man. It’s a lesson to live by don’t bring drama to your job.",
            "Yeahhhhh.. maybe you misinterpreted her being friendly as flirting. A lot of guys tend to do this.",
            "For starters it’s nice to hear that you actually care about making a girl uncomfortable. As a woman I’m not gonna lie it’s a little awkward when a guy hits on you that you have no interest in. However, one thing that’s important to remember is if she did have any interest in you the way you approached her was respectful and considerate. Unfortunately, it seems as though she’s not interested but the damage is done so there is no point in trying to correct it. Just go about your life and the next time you make the first move still be kind and respectful and you definitely will find a girl who sees the effort you’re making and appreciate it. Don’t stress over it and don’t let it discourage you from continuing to ask out more woman in the future.",
            "Fwiw I have no reason to believe you're a creeper, but saying \"I'm not a creeper\" is a bit of a nothingburger because someone is going to say that regardless. It's kinda like calling yourself a nice guy, useless to say it about yourself, only really means something coming from others.\n\nBack to the matter at hand, there's nothing to do/not do, if she texts calls you expressing interest great! If not it's just life as usual, the ball is in her court don't overthink it",
            "You liked her, apologize for what? Am i missing something?\n\nToo many are not taught how to react these days",
            "Tell her exactly that.  “Hey I fucked up and put you in a weird position. “",
            "You should just straight up ask her if she wants to fuck. Get to the point.",
            "Wait a couple days and if you don't hear from her casually go up to her and ask if you can have your number back. Make a joke about her not using it and you know a couple other girls who you believe would like to have it.",
            "Yeah most definitely. I would never press anyone on something like this, I feel so bad thinking I may have made her uncomfortable. Fucking cringe 😬 I’m pretty good at acting natural though so I guess there is that lol",
            "This is what I figured the best thing to do was. I hate the thought of making someone uncomfortable. I try and never make a gesture like that unless I’m sure and I was getting all the signs lol def can’t undo it",
            "lol thanks! I’m pretty good at the acting natural. I was asking Reddit to go through any options I may not have been thinking of!",
            "Im not positive and I’m super shy too so that’s why I’m probably overthinking it. I try to never approach a girl or make that kinda gesture unless I’m more than 75% sure she’s interested. Girl is so shy it’s adorable but hopefully you’re right and maybe she will text me! Thanks for your input. I wanted to post this in ask women but I figured I’d get roasted haha",
            "Lmao username checks out",
            "I packed my shit up before I went to work. Loading the uhaul now!",
            "Nah he's gotta leave the country. LOL.\n\nSeriously, it's not a big deal. I probably would have asked her for coffee, just to hear the classic response, I don't drink coffee. ☕\n\nDon't worry about it and let her make the next move, hopefully she'll come around.",
            "lol they can all have a good laugh about how I respectfully offered my info to a cute girl I thought was looking at me, I don’t mind really. As long as she doesn’t try and make a huge deal to HR I don’t care. That and the fact I might have made her uncomfortable bothers me because I dont wanna be one of those “guys” that’s known for that. \n\nI am 35 but this is an amazing job and I don’t have a degree but I had enough experience to get the position and I’m in love with it. I can see myself retiring at this place but because of you I will be taking pride if people end up talking about it and finding out! Thanks for the advice I appreciate it!",
            "Omg I love this!",
            "Youre on reddit, 90% the folks here dont talk to women at all let alone pass their number on.",
            "Yeah that’s been the general consensus. This is the move. Thanks for the advice!",
            "Yay! Thanks for the word bro and that’s exactly why I usually offer my info to the female because I def feel like it’s more comforting if she wants to say no but is to anxious or whatever but the decision doesn’t have to be made right then and there. \n\nYeah she’s very shy, it’s adorable. She talks really softly and sometimes it’s hard for her to make eye contact. \n\nWill def try not to overthink anymore lol some of these comments have eased my mind!",
            "The thing is as much as I hear this advice I also hear people say they met their SO at work. That said it's not always a great idea, it really comes down to what level of relationship you have with them at work. Some larger companies, you can see people every day yet never talk to them once and do completely different types of work. But in cases where you are close to them at work, they're your boss, etc, it's usually not the best look.",
            "People say this yet work is one of the most common places people meet their spouses. Which makes sense as people spend a significant portion of their lives at work. Only a sith deals in absolutes.",
            "Don't shit where you eat.",
            "Thanks for the input. I tried to do it in a way that could be seen as someone trying to be friends. Which is kinda what I’m after anyways. I would have been wanting to get to know her and reason for me going through with it was because we don’t work together. Different areas, different customer",
            "Thanks, will do! Some of yall are really helping this mental struggle I’ve been having since I left work so thanks!",
            "Aww man, how did they take it? I’ve casually talked and flirted with girls that ended up being taken and they were still flattered and i immediately kept it platonic conversationally and everything was cool and it was not cringe but if they had been bitches about it then it would be cringe lol",
            "I’m confident in my appearance. I grew up overweight and got fit right after college. I’m 35 now and the difference in the way I was treated going from 5”11 240lbs to 175lbs  was insane. I am usually spot on if I think a girl is feeling me or not. Part of me still thinks she may message me but I definitely didn’t get the reaction I was expecting, since the only reason I did this was because I’m pretty positive I’ve been getting looks or I’d randomly look up and she’d quickly look somewhere else and start smiling all cute and stuff lol",
            "If she reports me to HR for handing her a paper with my number and telling her “there’s no pressure” on whether or not she uses it then that will say alot more about her than it does about me.",
            "Will do gapingwhole9",
            "I was being discreet , which is definitely not what asking someone to eat lunch with you is",
            "Well thanks for saying that I appreciate it. I know I said she looked mortified but it was more shocked and like stiff as a board, but still not the reaction I was thinking I’d get and ya, although respectful and discreet I don’t think I liked doing it that way. I should have waited to let it happen on its own. I rushed it without even realizing but as long as I didn’t make her feel uncomfortable I’m good. I hate the thought of doing that to someone. Will definitely be happy to pretend it never happened haha",
            "Wow yeah that’s a really good point and you’re def right. I think since she looked caught off guard I felt creepy so I’m kinda self conscious about that rn but I see what you are saying. I think how I handle a no go will say a lot more about me than the initial gesture did so that’s a positive.",
            "I was initially on the fence about doing this or nothing at all and there have been 3-4 girls comment on this thread saying it was good and respectful, just leave it be and continue on playing it cool, meaning just don’t mention it or press it or anything which I like the idea of.",
            "Maybe she looked mortified because I was being a pussy and didn’t get straight to the point!",
            "What reddit does to a mf",
            "You shot your shot, and did so respectfully. You're good.",
            "the cringey thing is thinking you are being cringe by showing intrest. You didn't harass her, you we're respectful and if she doesn't message or call you then you move on and dont make it an issue. All you did was the same exact thing men have been doing for centuries as a way to express interest, there is NOTHING wrong with it.",
            "Breath, my man.  You're ok.  Maybe *she's* overthinking it too!  She'll let you know if she's interested.  If she doesn't, then you can move on or just not pursue that route with her again.",
            "You took a shot, no harm done. Don't give this another thought, honestly.",
            "My friend, in life, the bigger regret is not making your move or shooting your shot, especially with girls. It is no big deal, relax",
            "It's sad we live in a world where not only can men not ask women for their number without feeling bad but we cannot even give a girl our number on a piece of paper as a way of not putting them under pressure on the spot without feeling bad.\n\nPathetic.\n\nFuck feminism for ruining men and society.",
            "How old are you?\n\nWhen I was in my early 20s the more I liked a guy, the less I could maintain eye contact. I’d get so choked up talking that sometimes it came off kinda mean. You sound really self-aware, I wouldn’t worry about it too much :)",
            "I know this is ask men, but as a woman I want to say I would not roast you. I think you did absolutely nothing wrong. You approached her and gave her a choice without pressure and treated her with respect. I respect your courage for giving your number. :)",
            "nah good on you for giving it a go, you never know what it could lead to and worst case scenario its just more practice under your belt really - just see what happens. I felt like you approached her perfectly and didn't pressure her either. See if she texts you, she might and if not just continue to be polite to her and move on like nothing happened, don't apologise you didn't do anything wrong.   \nI don't think you'd be roasted for putting in an ask women either :)",
            "While I'm male, if I was younger me, I'd be shocked at having been \"found out\" having shown interest, and would be embarrassed about that.  Though the interest would be genuine (and in this case appreciated) I'd still feel embarrassed.",
            "When it comes to workplace relationships, always try and keep it platonic when it comes to outside work things.  Get to know people outside of the work setting and just let things develop on their own from there. \n\n\nThere's so much ambiguity when it comes to workplace dating, I wouldn't mess around with it too much unless you don't care about the job. Otherwise, you cannot imagine the headache when things don't go well. ",
            "most people are only around other people regularly at work, so it makes sense...",
            "she was fine with it, we are still friends infact i am co directing a short movie she wrote",
            "Brother, how much experience do you have in the corporate world?",
            "Asking someone to lunch is just normal get to know someone behavior. Slipping them your number is far more forward because it completely abandons any pretense of a platonic relationship. It's a very childish way to approach someone.",
            "Sounds to me you’re ambitious, you picked up on what you thought were clues and went for it. Again, woman like that and I’m telling you when you find a girl that’s interested she’s going to love that you took initiative and were respectful. Good luck!",
            "Yeah it really depends on so many things.  Life, ya know?  You could also directly ask her about how she would like to move forward.  If you feel like she would be honest.  Maybe she would like to just move on from it and not dwell.\n\nJust don’t be a weirdo and everything should be cool",
            "ya maybe just be like \"hey baby, we been talkin and shit but its time to take this to the next level, hows bout you come on over to my place and we suck and fuck eachother?\" \n\nthat should work.",
            "Awesome, thanks for the input. I really needed to hear that. Was hoping I got some input like this to ease my mind. I always aim to keep it respectful no matter what!",
            "Great that’s why I posted for advice here. Needed to hear that. If nothing happens moving forward won’t be an issue I’m just more concerned with them maybe taking it wrong or making a big deal out of it. Oh well lesson learned",
            "Thanks definitely love hearing this",
            "Aww thanks! Tbh the only girls who have commented here have sided with me on whether or not this was discrete and respectful as I was aiming for and those are the only ones that truly matter to me haha so thank you very much. I always try and make sure I never pressure someone I’m trying to talk to. My mother showed me the wayyyy lmao",
            "Omg you are so nice, thank you I def needed that. I’ve been off work for a couple hrs and I’ve been worried about it. I will def not change the way I am at work no matter what other than maybe being embarrassed lol \nHopefully it does lead to something even if it’s just friends. Things got complicated for me for a while and have been uncomplicated for a year, so I’m just ready to talk to people again!",
            "Yeah no fuck that, I like my job. Regardless of if this works out with it or not I’m not doing this again. It’s not worth the stress. Like I could have just not done this and waited a few months to let it happen more “organically” and tbh the best relationships I’ve ever had happened “organically”",
            "Dude that’s bad ass actually! Can you tell me anything about the movie?!",
            "A bit. I’m 35 and I have seen guys get a slap on the wrist for saying some filthy shit. I would hope I’m good. Also,  my defense would literally be, “she’s been pretty friendly with me, so I figured I’d give her my info in case she wanted to continue that outside of work”. I made damn sure to do something that showed interest but not romantic interest. Maybe you’re right, but hopefully not.",
            "Well I guess lesson learned on that one",
            ">It's a very childish way to approach someone.\n\n???",
            "Naw I’m all about trying to keep it cool. Like this is the most far out thing I’d do. I’m genuinely nice, like I’m super fit now but I grew up overweight with a lot of friends that were girls. I had learned to work with what I had then but I never really grew out of being nice because I know what it’s like to be kinda invisible in a romantic way",
            "Alright new strategy for Monday. I’ll say “ hey can we start over”? And then get straight to the point!",
            "You miss 100% of the shots you don’t take. Life is short. Don’t overthink this.",
            "[deleted]",
            "If it went as you described, then it sounds like you're good, bro. Doesn't seem like you did anything creepy/disrespectful, just up to her now to make some kind of move back or not.\n\nSince you mentioned that she seemed \"mortified\"... unfortunately without us being there/seeing a video, we can't tell whether her reaction was more of a \"Oh crap, this just got awkward\" one, or a \"Wait, does he actually like me back?!\" one.",
            "it just a ten min thing for a film class we were doing gonna film end of july",
            "Never write that on paper. I advise someone asks the other out to a coffee on work premises or for lunch...something that is during the day and has a get out of a the date free card, like \"I gotta a meeting to run to...\" Then if hanging outside of work comes up, then schedule something after work and go from there. Writing it on paper it evidence. Saying it verbally is \"he said, she said\" Don't assume they will treat you the same as others...if someone in the company wants you gone, they will see to it at first opportunity...just don't give them one. Assuming you are on good terms and did it in a polite manner, then let's hope you don't get a call or e-mail Monday.",
            "Yea, but corporate HR is not gonna give a fuck about anything other than \"was this about business?\" Everything is about protecting the company's ass.  Not hers.  Not yours.  The company's",
            "> It's a very childish way to approach someone.\n\nI hard disagree with this guy.\n\nIt's far more childish to build up a false-friendship if you already intend on dating her. That's how manipulative people work.\n\nYou shot your shot, so keep it professional and let her take the next move (or not).\n\nHarping on it only damages your opportunities for women who are actually interested in you.\n\nI have done a similar thing with somebody at a different company but working in the same building, and nothing happened, so we just kept it professional during future encounters and I was careful to not put her in any situations where she might feel awkward.",
            "I also grew up overweight and mostly had female friends, so I get it.  I really believe it helps me be a better husband",
            "Smart man.\n\nDo not take advice from him, look at his avatar. Mf is literally the reddit knight 😭",
            "“Can we start over? I would love to learn more about you; you are cute and I would love to see if you are as pretty on the inside as you are on the outside. Would you want to meet me at my favorite coffee shop at 5:30 after work on Tuesday?”",
            "So sad to see this being the reality of men of my generation.\nToo fearful to shoot their shot. And then depression and loneliness hits. You doing gods work.\n\nThe key, don’t over think, just be respectful.",
            ">You miss 100% of the shots you don’t take.\n\n oh hey its the michael scott quote",
            "A harassment charge is actually a *huge* deal and why men are so afraid in any situation where a woman might feel uncomfortable.",
            "unrelated, but how much cheese did you have to buy to get that title?",
            "Man in the back of my head, I knew it was evidence but I figured I’d be ok. I 100% kept it respectful and always do. Women have to put up with a lot so I try and not make any interactions unpleasant with them (or anyone) at all. I’m on good terms with my job, I’ve been there a few months and I’ve been learning at an accelerated pace since I got there and I make a huge effort to be a good coworker and employee. I love my job and never thought I’d have a job I loved, especially after all the complicated shit I went through in my late 20s",
            "Oh, well in my opinion I felt like what I did was done the safest way possible given the environment. As I said, I’ve seen guys get away with warnings for verbally assaulting women and this was at Applied Materials (my last job) which is pretty fucking corporate. Also, I work with 2 guys who met their current wives at our place of work.",
            "Yeah I don’t see how that person thinks it was childish but I disagree too. I’m more worried about misreading the situation and possibly have made her uncomfortable. I can deal with rejection I just thought I had a good read on her is all. The ball is def in her court and I’m good with that, that’s why I did it that way.",
            "What false pretense? You don’t know this person all you can do is try to get to know them better. You don’t just shoot your shot with strangers at work, it’s weird dude behavior. Maybe you do end up just being friends after getting to know each other.\n\nSlipping your number is so “I fell in like with you” energy",
            "There are two things that I’ve been through that I wouldn’t change no matter what, that I feel most people would. Being overweight (I still went to college on a baseball scholarship too) and I went through a horrible IV heroin/fent addiction. Both of those have made me into someone I actually like and have given me qualities i know I would want in a partner.",
            "Damn reddit is hiding all the playboys in here! I love it!",
            "I agree! This is 100% THE WAY! It was polite, respectful, and cute (imo). Like other people said, the ball is now in her court so just hang tight for a bit, and if nothing happens just move keep doing you. Keep us updated tho! I’m invested now haha.",
            "If you were HR...there's a girl who's been there 5 years vs a guy with 5 months...who is going?\n\nAs a fellow dude, I think men tend to exaggerate how much we will be tolerated or liked by girls...we may think they like us when they hate our guts.\n\nNo idea what happens to you now, but good luck and try to keep that job.",
            "I'm not saying she'll take it to HR, and I'm glad that two of  your buddies found their partners at work.  That's when things are great and work out.  I've seen when it goes the other way.  It's not pretty.  She may not take it there.  I don't know, but past experience doesn't guarantee future success.",
            "Opinions get people killed or worse, fired....and every company is different. You can't compare what happened there to what happens here.",
            "> I just thought I had a good read on her is all. \n\nIf your interactions were always at work then you should always assume you do *not* have a good read on the situation.\n\nIf she's hanging out after work, and talking about doing other things outside the office, while outside the office, then it's much more likely you do have a good read on the situation.\n\nThat was my big lesson from my experience. In hindsight it's obvious but that's how lessons work I guess.",
            "I don’t think it’s going to come to that. I’d be shocked tbh. I didn’t do anything wrong and I wasn’t disrespectful or weird. \n\nAs a fellow dude, I think you’re right and the majority of men don’t know shit like that but I’m not in that group. I grew up overweight and after I left college I got super fit. The attention I got after getting fit vs when I was over weight was night and day. It’s been over a decade since I’ve gotten fit. I can USUALLY tell when I’m getting looked at and since I spent time knowing what it’s like to not be looked at I’m not a cocky ass hole about it because I know what it feels like to be invisible.",
            "I do see where you’re going with this and it’s a partial reason I’m a little worried. Hopefully it doesn’t come to that.",
            "I see what you mean but I mean I saw other signs. Other people who I talk to at work don’t get all giddy and nervous when talking to me or don’t smile or get caught looking like she does. Those were the signs I saw and since she is shy and soft spoken I didn’t want to make her uncomfortable by approaching her all of a sudden. I’m not the type of guy that thinks that any girl that is friendly is automatically in to me, I know it doesn’t work like that.",
            "If you have ever approached a girl...men don't get to define what they did as disrespectful or weird...it's always the girl who decides. Brad Pitt can go up to any girl and say anything and he'll be okay. A normal dude says the same thing and gets cancelled. Frankly what you think happened, does not matter in this case. Plenty of sexual harassment happening from men to women on a daily basis and who do you think HR will believe it it comes to that? I'm trying to be as real as possible here.",
            "I'll take what you're saying at face value, but then again, if you were right about reading her and gave her the note, why was she mortified? Nothing against you bro, but the mortified look indicates that you misread the situation. If she is cute and in the Bay Area (assuming that since you mentioned Applied Materials and I got some buds who have been there a while) she is probably taken...isn't it called Man Jose for a reason? I'm not trying to rain on the parade, just playing the devils advocate and hope nothing happens from this.",
            "All you can do now is play it cool and see how it goes.  I'm sure it will blow over if you haven't been too indelicate about things.  Also be careful about apologizing.  It can be taken in different ways.",
            "> I see what you mean but I mean I saw other signs\n\nYeah I know what you mean, because I have been there in my own situation. That's why I shot my own shot.\n\nThe lesson was learning that *all* of the normal signs are different at work, and if they're different, then they're unreliable signs.\n\nOther people mentioned organizing your own after-work event for your coworkers and I really like that idea. \n\nUnfortunately I think we're past the point that it's appropriate to invite her along, unless you make it a weekly thing and let her find out on her own.\n\nI have to ask since you haven't mentioned it yet, how old is she compared to you?",
            "Yeah anyone can perceive something in a way that’s not meant but in my opinion intention is also equally as important as the way it’s received because if something like this is investigated, it matters as well.",
            "It’s in Texas so idk what your talking about and I don’t work at Amat anymore (fuck that place). You’re not raining on my parade, there have been a few girls comment on the post and all of them have assured me what I did was more than ok and not to worry about it, so if I’m taking any comments as advice it would be theirs.",
            "Agreed good sir. I think my best move is to not do anything and if she decides to approach me about it, then I can quickly explain how I misread the vibe and suggest we forget the whole thing.",
            "Yeah this is true, I can admit you have a point with the whole having a read on it at work, you are right.\nThere have been a few girls comment on the thread and they have all said that I shouldn’t worry about it so I feel pretty confident about any back lash. \nShe seems to be in her late 20s and I’m 35 lol but it’s funny everyone I meet that hears my age is like appalled because I look like I’m in my mid 20s."
        ]
    }
}