{
    "Making friends? 5th edition": {
        "title": "Making friends? 5th edition",
        "score": 213,
        "url": "https://www.reddit.com/r/askSingapore/comments/19bsjy5/making_friends_5th_edition/",
        "content": "[With](https://media3.giphy.com/media/U4FhMKBEwcEhZ2YE9d/giphy.gif) the success of the past threads\n[1st edition](https://www.reddit.com/r/askSingapore/comments/s87acm/so_many_posts_about_people_trying_to_find_friends/?depth=8), [2nd edition](https://www.reddit.com/r/askSingapore/comments/w3hjbr/so_many_posts_about_people_trying_to_find/?depth=8), [3rd edition](https://new.reddit.com/r/askSingapore/comments/10ewr51/so_many_posts_about_people_trying_to_find_friends/) and [4th edition](https://www.reddit.com/r/askSingapore/comments/156mbrl/looking_to_make_friends_4th_edition/?depth=8)\n\n\nThe last thread got archived, so here’s the latest one :)\n\nSame as last time, everyone list their interests, hobbies, below, other like minded people can connect with you lah.\nFeel free to post again, even if you have posted in the earlier threads.\n\n**Btw friendship is not a one way street, you need to reach out to other people too.** \n\n[Remember, reddit wide rules](https://www.redditinc.com/policies/content-policy) and subreddit rules still apply. \n\nTL;DR, be nice and don't be an ass.\n\n——\n\nSame as last time, please exercise caution when talking to and meeting people, both online and offline. \n**Be careful with sharing very personal information, with others.** \n\nIf you encounter any harassment or abuse, please send a mod mail to the subreddit, with screenshots of evidence (using an image hosting site like imgur.com) so we can deal with it.\n\nStay safe.\n\nPS. Sort by new.",
        "num_comments": 2585,
        "comments": [
            "For those who want to make friends, consider joining Urban Sketchers Singapore for their outings. It's free.\n\nOnce a month, a large group of people will gather and sketch on location at a place. We have people from all walks of life, e.g. young, old, single, married, guys, girls, working, retired.\n\nTo get a sense of what urban sketching is, see these videos I've made:\n\n[https://youtu.be/bRwFdYx2pXY](https://youtu.be/bRwFdYx2pXY)\n\n[https://youtu.be/4Nn3An6BJdo](https://youtu.be/4Nn3An6BJdo)\n\n[https://youtu.be/wVTp08\\_SsTo](https://youtu.be/wVTp08_SsTo)\n\nWhat is urban sketching - [https://youtu.be/JUs5RdL1fyY](https://youtu.be/JUs5RdL1fyY)\n\nYou don't need to know to sketch to join. Anyway, drawing can be learned easily (I'm saying this as a fact not an opinion).",
            "Hello! 30M looking to start a small book club/circle with people with similar reading interests. Not a good reader at all, but I really want to push myself to do so, instead of playing palworld all day lol. Hoping to get some extrinsic motivation here. Maybe we can meet up once a month to discuss about the book? Feel free to dm me if you vibe with my reading list!\n\nSome of the books I'm interested in reading/ completing (open to more):\n\n1984\n\nThe body keeps the score\n\nThe presentation of self in everyday life\n\nThe wretched of the earth\n\nMan's search for meaning\n\nCrime and punishment",
            "[deleted]",
            "30M, ended my previous job and currently hunting for better opportunities out there. New year new job.\n\nHobbies include hiking, bowling, badminton, cycling and gym, looking for opportunities to learn korean.\n\nkpop, mando pop & english songs are my favorite. \n\nConsider myself a foodie, always hunting for places with good food. I like kbbq, hotpot, mala and western cuisine.\n\nI enjoy watching documentaries, politics and obsess with topic related to philosophy.",
            "(Trying something slightly new this time!)  \nHeyo! I'm known as Chicken, 25F. I own a Singaporean friend-making discord server. We're opening the server up to more newbies, and to integrate you guys, I'll be hosting a hike at Southern Ridges on 9th March and a (separate) board games session later in the month.\n\nIf you're interested in either outing, lmk in DMs/comment so I can send you the server invite & reserve a spot for you in the name list! \n\nWe also have other activities, such as karaoke, cafe hopping, table tennis, food, alcohol so feel free to HMU if you're interested in joining the server \\^-\\^\n\nEdit: Forgot to say, 21y/os & over only for safety reasons sorry! Also TY FOR ALL THE DMS will get back to yall asap!",
            "This is interesting!\n32F here married no kids. Love horror movies and horror novels. Dropped reading but tryna pick it up again. Gamer but a total noob- Dota/Ark/l4d/Sims (yes I trap my sims). On PS I used to play ffx, dark cloud, MK, Harvest Moon, GTA-not serious gaming but just going around beating cops up. I grew up on rakion, maplestory, neopets, pokemon, digimon. I think I spent a quarter of my life gaming 😝 \n\nMostly into Eng music/films. I listen to mostly pop rock and dream pop. But I also like some classical, jazz, heavy rock, metal. \nI’m not a travel person!\nMy typical weekend is to stay home and relax but can meet up if we hit it off! I also club once in awhile. I’m in corporate finance but just quit my job to take a break so I will be pretty free hence looking to make some friends!\nMy only form of exercise is cycling from the mrt back home with Anywheel and doing household chores so I can’t be your fitness buddy HAHA",
            "Hello I posted this about a month ago, and I talked to some nice people so I am re-posting again!\n\n28M, kinda homebody, introverted INFJ, looking for text buddy or anything really.\n\nI watches anime and play video games(league/TFT/steam games) like your typical Singaporean men, I have a decent collection of board games, I used to play them pretty often with a friend group, but group size has dwindled to just me now :/ have thoughts of trying out D&D but it seems like a daunting experience so it's on hold, but would love to try if there are other like minded individuals :)\n\nI also do a bit of badminton (mid beginner level) on weekends, and listens to mainly kpop, pop punk rock, ballad and instrumental, I am also into kdrama and I usually watch them while commuting to work(trying to get TOPIK L3 by end of year lol), is into tattoos and cats, used to do some reading but has since stopped due to priorities/other interests in life. COYI West Ham fan! I also bought a mirrorless camera on impulse years back, took some \"decent\" pictures and kept it in my dry box ever since heh oops, would be nice to be able to pick it back up.\n\nIf you are still here, thanks for taking the time to read, have a good day :)\n\nP.S would appreciate a chat with a quick intro!\n\nI'm going for All Time Low's concert on 5th May hmu if you're interested to go with!! (I'm going alone, I think)",
            "Hello, am 27F. Recently went to Cash Studio at Cuppage Plaza and they gave me a voucher(?) where they give you free 2 hr singing session but you have to pay for the drinks (ard 7.90 if I remember correctly) but minimum 3 drinks needed, drinks charge per person so 3 people min needed. \n\nLooking for at least two more people to maybe have a session around early May? Voucher is until end of June. \nI usually sings Vocaloid, Anime OP/EDs uhhh and some music project songs. \nDon’t need to be self conscious about singing level cause just sing for fun. Voice break also nvm! Some of those vocaloid songs ain’t designed for human to sing anyways 😂\n\nOhya voucher only valid on Sun-Thurs and preferably noon-evening session. \nIf interested and there’s enough people will create a telegram or WhatsApp group! Feel free to comment or DM :)",
            "31M expat, Central, looking for D&D buddies, friends, and a Korean/Japanese teacher (apologies if this is not the right place to look for latter).\n\nI moved to Singapore a few weeks ago, so very new and don’t know many people apart from my colleagues. Living my golden years, but definitely feeling a bit lonely.\n\nI love travelling to interesting places in Asia, cats, dogs, manga and anime. I would really like to get into D&D - been super hyped about it since I finished BG3. Let me know if you are looking for an extra player and someone to fill a vacant spot in your ongoing campaign.\n\nAlso wouldn’t mind finding some folks to do sports with or just share a cool beer on a warm day.\nThanks for reading & Happy CNY to everyone!\n\nHope the Year of Dragon will bring all redditors some much needed friendships and connections!",
            "I’m turning 31 this year. I like going to the gym and lifting but I would say I’m not *that* obsessed. Unless you think consistency = obsession.\n\nMy job is nothing worth talking about. Just the usual 9-6. Supply chain if you’re really interested in knowing.\n\nI like eating good food too so I guess it balances out. Just no spicy.\n\nI *love* travelling, though it’s only once a year. $$$. Been travelling since young so it’s deeply part of my personality. Just recently did my first ever solo trip. Not sure where to go this year.\n\nI also like to just nua at home and just use my phone. Not really into always going out that type so I guess I’m more of a homebody.\n\nActually, I realised my life is kinda boring otherwise. Not that happening.",
            "Hi, 42M, ENFP-A, single, working in IT world before even graduating uni, just looking for friends, the older you are the less friends you have haha, that’s the nature of life i guess. \n\nWorking at suntec, open for coffee or lunch, i usually go cycling or yoga or martial arts in the evening. \n\nNow busy playing monster hunter now to maintain 10k steps daily. \n\nI saw so many younger people here so if you want chit chat about work and life do dm me. I believed i have seen it all haha. If you want to cycling around sg also do let me know i can be your guide. \n\nEnjoy today.",
            "39M, corporate comms (media relations to be exact) in the education sector, single + child-free, loves hiking, reading, cycling and jogging. Trying to pick up gym too. I also enjoy coffee, tea and beer. Introvert, but will open up once I get to know you better. Hit me up!",
            "30F, immensely interested in anything Korea: Movies, Drama, Variety, Music. Anyone else need a fangirl buddy, HMU.",
            "30M looking to connect with a group of Kakis in the same age group with the goal to create long lasting friendships.\n\nBe it exploring new places\nTrying out exciting activities\nOr enjoying light-hearted conversations with a cold glass of 🍺 on a random night. \nOr just getting support from one each.\n\nIf you share the same sentiments or just want some company, feel free to hmu! Never know where this goes, we can start out with a Tele/Discord group chat!",
            "Hi all early 30s male here.\n\nI work in CBD but usually no one to eat with because team always work from home.\n\nCan talk anything under the sun!\n\nI working in the data science and quant finance side so if you're interested in these we can have a great chat. Else I'm cool with any topics!\n\nLike running around marina bay too after work lol. Hiking and running are some of my favourite activities.\n\nHope to meet some great friends! Just would like to find some like-minded people for lunch or dinner around CBd area.",
            "27F here attached, looking for new friends/online chat buddies? :) guys and girls are welcome! Currently working full time, studying part time and also having an existential crisis! Giving this a try to expand my social circle!",
            "Hi! 32M. Moved here recently. Looking for company to share a meal or a drink. \n\nMy weekdays are spent working, working out and deciding where to eat. I enjoy staying active. I like walking around. I sometimes chill by the river in Clark quay people watching or reading a book on lazy evenings. I also go dancing every now and then based on who is playing in town. \n\nI’m a beginner squash player, surfer, and terrible board gamer. Getting back into reading nowadays. Enjoy well-crafted cinema and art. \n\nI’m an INFJ, if that helps with anything. \n\nWould love to get to know you. ♥️",
            "hi i'm 30m, married, no kids, westie and working in tech! just looking for people to chat shit with and vegetate after a stressful work day to regen a bit of social energy. hobbies wise: board games, video games, personal finance stuff. training for ippt rn and let me tell you this 30yo body is not what it once was wtf my knees hurt and running 14min is a good day and i do sit downs better than i do sit ups.\n\noh, also i've been toying with the idea of starting a side biz, if you have something going then HMU! let me pick your brain and experiences a bit :) cheers!",
            "hullooooo\n\ni’m a 25f infp looking for friends and text buddies! \n\ni currently work with rescued animals. i play codm and like drawing (digital- do ask for one if you’d like!) + writing. i like baking when i can. i like doing diy projects and craft handmade gifts for people!\n\ni love night drives and rides, but don’t have a license hah :’) been wanting to get out more and explore art exhibitions at museums or even start going to the gym with a buddy!",
            "31M westie archaeology grad here looking to make new friends and expand my social circle! Currently I’m doing some relief teaching at a secondary school. I mostly play video games or watch movies/tv shows and I enjoy visiting aquariums, wildlife parks/zoos, cafes, museums and galleries as well as exploring historical places.\n\nSports-wise, I like to swim, gym, yoga and going for jogs/walks so planning to get back into these though I’d like to give hiking, paddlesports and cycling a go too! I also used to do some scuba-diving though I’m on a hiatus now. Do feel free to PM/DM me or just reply in the comments here!",
            "35M here. ENTP.\n\nI do Lindy Hop swing partner dance regularly, and practise Parkour less regularly. Generally interested in personal development, improv theatre, stand-up comedy, movies, entrepreneurship, and non-fiction books (social sciences, history, psychology, self-help). These days I've been trying to cultivate the habit of sleeping early, and reading and writing often.\n\nI also enjoy deep conversations about life.\n\nOpen to board games, explore nature/city, museum trips, and seeing artsy things. I live in the north.",
            "25F, looking for people who are interested in shopping / window shopping. I love going to places on Saturday to shop - mainly clothing, cosmetics, skincare.",
            "30M, recently jobless and looking for a new job, so got more free time.I love hiking, but too bad my circle of friends don't hike, so trying my luck here. Very introvert in real life.",
            "Hello 22M here, hoping to make some platonic friendships!! For hobbies I guess its Cafe-Hopping, reading, cooking, calligraphy, watching entire episodes on tik tok and kdrama (e.g Twenty-Five Twenty-One, Business Proposal).\n\nI love to window shop around SG to pass time, but usually buy clothes when I travel or got good sales.\n\nCan talk about Skincare and facial, doing cos of my acne scars not that I have glass skin to maintain haha. On Adapalene/Retinoid now, hence I have like 3 brands of Sunblock to switch around hahaha, serums are finishing so yeh hope to get some recos and maybe places to buy (Gotten Fake ones thru Shopee bfr).\n\nFav game is War Strategy kind like Wargame RD, and the occasional dying light, Minecraft, L4D2.\n\nHoping to have genuine connections and if lucky maybe even a long term friendship, would love company doing the above activities or run errands together only if we click and are mutually comfortable, if not an online buddy is still gd!!",
            "Hey future friends! I'm 32M, who loves hitting the gym and doing yoga—not to bulk up, but to stay healthy and feel great.   \n  \nI’m all about balance, so you’ll find me enjoying both the great outdoors and cozy indoor spots. \n\nOpen-minded and young at heart, I have a soft spot for cocktail bars, a good stout, and a lively party. \n\nI’m also a huge fan of delicious food and great coffee. \n\nLooking to make new, genuine friendships—because let’s face it, it’s not as easy as it used to be! \n\nLet's connect and share some good times!",
            "34M westie here, you can ask me anything  \n\n\nSome topic of interest:  \n\n\nCoffee- learning to brew my own at home   \nCats- adopted a scaredy cat  \nBaking- making some healthier snack choices  \nFootball- YNWA  \nOne Piece- long-time fan and going to Japan on a solo trip this year  \nStock market- can ask me how to start but don't ask for stock tips  \nEntrepreneurship- want to start a business  \nSocial work- worked as one for awhile",
            "Just a comment. I realise alot of westies here. Maybe should start a westie meetup group. (Update: anyone who is interested in such a group can dm me, if there is enough interest I can probably get something going)",
            "Hi guys 40+F here, \n\nself employed, high performing introvert, \n\nspeed reader (approx 2-3 books per week), \n\nfan of coffee (pour over  is my favourites) \n \nfan of matcha and cafes. \n\nI also collect and use fountain pens, \n\nI write stuff so I have tons of notebooks from various parts of the world but mainly Japan. Or people from other parts of the world using Japanese paper to make notebooks. \n\nJust started on board/card games so if you want to join in. I have some new board/card games I bought recently so I am setting up a \n\nboard game happening on \nCNY day 1 from 1pm \nPM me if you are keen",
            "Elooo! 27F INFJ Westie here! Quite new to sg as I just got a job here half a year ago. Easygoing soul looking to expand my social circle as my closest friends stay in Central, interested to explore affordable good foodie places during weekends or just hanging out after work in the west.\n\nKeeping active wise, I swim, jog and do skipping. Wondering if there's a jumprope community here that I could join as well as learning tricks on my own is hard without guidance :'( \n\nAlso feeling quite lost and looking to find a career direction nearing my 30s! D; Architectural Assistant but not quite looking to pursue the conventional registered architect/bim modeller path. Wld rly appreciate any advice from ppl in a similar industry/background! \n\nWeekends are spent going urban sketching, making art, occasional cafe hopping, being a homebody watching running man, sitcoms, comedy standups, kdramas n taiwanese dramas.\nI'm also really keen in volunteering opportunities n lookin for like-minded buddies to do good with! :D\nOpen to connect and talk about your dreams, passions, worries and everything under the sun! Feel free to ping meee! Cheers ✨🌼",
            "Hey all, giving this a shot to make some genuine friendships! \n\n28M, Intj. Equally enjoy a good day out and being a homebody. \n\nWhen I'm not at work, I'm either at the gym, reading or listening to audio books and been enjoying a good number of documentary / films. (let's exchange lists?) \n\nWeekends are spent usually bouldering (I'm bad), hiking, swimming, or trying new food places.  I'd like to think I'm up for most things and can be rather adventurous (finally living in a caravan and skydiving in May!)\n\nI'm still playing some games when I get the time (League, Bg3, Lethal Company) and very open to trying new games too (Palworld?). Open to chats about anything from FIRE to the meaning of life. Let's connect if you're up for it :)",
            "21M introvert currently in uni now, lf people with similar interests :)\n\nI enjoy drinking tea; doing skincare as well as food \n\nI love watching period Chinese dramas, especially those of xianxia/wuxia genres (recent favs are 莲花楼 and 一念关山）. Recently, I’m also enjoying Chinese animations of similar genres.  (凡人修仙转，斗罗大陆2）\n\nI listen to both Korean and Chinese music; W2E, Dean, Colde, Stray Kids etc. as well as mandopop and Cdrama osts etc.",
            "28F very chill - looking for 1 leg to open mahjong sessions also friends to jio me out for dinner. Bonus if in tech I need help on OSCP \n\n😭 halp",
            "Hey👋 I'm 29M, and I'm on the lookout for some awesome new friends to connect with. I'm passionate about a few things in life – hitting the gym, diving into books about psychology and cognitive science, animes, board games, hunting for GOOD FOOD and starting to run my own business dedicated to promoting mental wellness because I have lost someone due to suicide and i NEVER want to see it happen again.\n\nI believe in the power of human potential and am committed to making a difference in the realm of mental health. In fact, my business will also donate to organizations that are doing incredible work in this space.\n\nIf you share any of these interests or just fancy a chat about life, fitness, or entrepreneurship, I'd love to connect! I was told that Im like an old soul hahah\n\nDrop me a message and let's start a conversation. Looking forward to meeting some like-minded folks here!",
            "37F here . Dink and a parrot owner . Happy to know fellow parrot owners and other Dinks too :)",
            "35M Eastie. Looking for friends to hang out with either weekdays evening or weekends occasionally.\n\nKeen on trying on new cafe/coffee, FI/investment stuffs or random stuffs casually (prefer not to have a full blown investment discussion either!)\n\nHappy to treat coffee too.\n\nP.S. am not a FA and not in the industry, and pls do not hit me up if you think I’ll sign on any plans - I won’t.",
            "32M, serial hobbist (so watch me as I burn through everything that interests me HAHAHHAA)\n \nThat being said, I'm down for any activity you put down, so show off (brag) your knowledge to me cuz I love it when I see people beam up talking about the things they love.\n\nI stay in the west west, please remind me to bring passport if I have to travel to any place!\n\nAlso I ride a bike, hmu if you wanna go ride for fun",
            "Hey! 27 F married.  I live in the Chinatown area and I have 3 cute ass cats!! I moved here from the U.K. around a year and a half ago now. It’s been a struggle to make friends so here’s hoping! \nI’m a self taught artist and I love to read. Hoping to make friends I can go out with and just explore! \n\nI would love to just make connections, I find I’m very chatty so  you don’t have to like the same things as me ! \n\nI also love music, movies and I’m attempting to crochet at the moment ! \n\nLook forward to hearing from you ✨",
            "Hello, 39F, Single, INTP, North-West side i think.\n\nWorking in the public sector; looking for potential relationship/long-term companionship, and looking to expand my social circle with more friendships too.\n\nAs I have been working away for the past 15 years, I did not realised that time passed so quickly. Anyhow, hope to form meaningful friendships or perhaps a relationship too if it happens.\n\nLoves heart-to-heart talks or conversations about anything under the universe whenever the opportunity presents itself.\n\nLoves reading both fiction and non-fiction; topics of interest depend on what catches my mind (currently I’m into sci-fi and human behaviour).\n\nAlso loves salsing, hiking, long walks with a good conversation (that’d be a bonus).\n\nDo DM me! ☺️",
            "Hello, 27M here, somewhere in northeast part. Just started working not too long ago as a video editor. Been a bit stuck in life recently as an introvert and looking to expand and socialize more. I’ve just started getting into board games recently (I would like people to join lol) and I like to explore offbeat or far out parts of Singapore with my camera. In addition to gaming (yup typical lol) I enjoy creating digital art (particularly digital collages) and animations on the side.",
            "[deleted]",
            "27M, mainly into military aviation photography. My instagram handle is tlkh\n\nI like outdoors/nature (although not so much SG's weather 😅) and looking into trying other kinds of photography as well\n\nAlso a weeb (I like anime and Japan)\n\nHope to make more friends with common interests!",
            "Hey all, 27M here. Last tested IN(F/T)J.\n\nBeen binge-playing Stardew Valley while job-searching to stay sane. I like economics, and I used to read a lot (but mainly other topics like pop psych). More of a listener than talker, so share with me what you like, and what made you happy recently!\n\nI've been told often I need to relax more; that I talk too deep. So, we could have deep conversations if you're inclined towards them too.\n\nOh and I like coriander and spring onions. Feel free to DM me?\n\n(EDIT: I think I might've accidentally turned down a chat request and can't find it now. If you think I turned yours down, please message me again!)",
            "[deleted]",
            "25M, INFJ just moved here recently for work. I don’t really know a lot of people here so I’m putting this out there to try and lf friends to hangout or try out good food with. Here are a few of my hobbies:\n\n• Personally I’ve been going to the gym consistently for about 1 year now although there’s still quite a long way to go. I’ve been plateau-ing a lot with my lifts recently so if you have any advice hmu\n\n• Love to play badminton but I guess I would only consider myself HB level and I’m more of a casual player. I’m down to join in some bookings in the west/central for games during weekends\n\n• I like boarding sports. Used to cruise to my uni with a penny board and also a bit of snowboarding. Don’t really think I’ll be able to continue this but it sure is something I’ve enjoyed a lot.\n\n• Would take commute or travel for good food\n\n• Other than that I do play some games, mostly Dota every now and then. Although I must say dota games are very tiring to me nowadays. I can only play 1/2 games max during the weekends and I too tired to continue. ( mi too weeek nao :( ) would love to occasionally play l4d2 for shits and gigs. Used to play a bit of maple on private servers (partly because of Covid) but already quit since it’s a waste of time\n\n• I watch anime quite a lot but rarely discuss about it. I appreciate the animation done and also wholesome animes like the recent Frieren and apothecary diaries.\n\n• Also watch quite a lot of Netflix. ( especially in MRTs ) Recently really got into F1 after watching their BTS content from F1: Drive to Survive\n\nHmu if there’s any weekend west/central badminton or you’re interested to hangout and slowly become friends :)",
            "hii 22f here! i like to play badminton, crochet, cycle and cafe-hop :)) pls dm if you enjoy any of these hobbies HAHAHA stay cool weather rly v v hot 🫠",
            "M27 from Germany and Luxembourg looking to make new friends to go out on weekends and go for karaoke or drinks together. Would suggest if we find a group of people we would simply arrange a first meetup and bring some cards games and enjoy good company :)  \nI am also interested in teaming up to do sports together on weekends.",
            "Hi everyone,\n\n33M, westie seeking to make new friends and widen my social circle. I enjoy\n\n* nice conversations over coffee and meals\n* night drives\n* walks and hiking\n* racket games such as badminton and squash\n* card games\n* darts\n* photography. Still a beginner but improving :P\n\nShould you share similar interests or want to chat, PM me!",
            "31F, stays in the North\n\nMorning gym goer \n\nEnjoys anime, drawing, casual gaming – switch and pc (steam) – got into BG3 recently. I also watch kdramas and American sitcoms (lesser these days) on Netflix\n\nI also love Jpop and live music (concerts)  \n\\*Trying to find like minded people around my age group with similar interest",
            "Anyone here interested in puzzles? There's this monthly event called Puzzled Pint which I'm quite keen on joining. It's basically sort of like a mini puzzle hunt based around word/logic puzzles, and is pegged at a basic-intermediate level suitable for people with no experience.\n\nCurrently most of my friends either aren't too interested in puzzles or have no time to come, so I'm wondering if anyone here might be interested to come along too. If the post gets enough traction I may even assemble a Reddit team for the event haha. If interested, feel free to DM me (also feel free to ask for more info). Also, if anyone here is already actively participating in puzzled pint and wouldn't mind someone new joining their team, feel free to DM me as well!\n\nNote: The event takes place on the second Tuesday of every month, 7-10pm. Sample puzzles are found here: https://puzzledpint.com/puzzle-archive/",
            "[removed]",
            "29F HCW, westie, recently got out of a longterm rs, wants to expand my social circle and not mop around in self pity. Other than being obsessed with poking veins, I love reading, journaling, jogging, and I believe that life, is a learning journey - gotta keep on striving for improvement and being more self aware. Occasionally, I study astrology + human design during my free time. \nI don’t mind meeting up to chit chat, to meet new people, make new friends with similar interests even, though I sure hope it’s at affordable places - given how almost everywhere is so expensive lately! (Quite particular on the finances aspect)\n\nPlus points if you think that CATS ARE CUTE\n🐈🐈🐈\n\n(Not keen on fwbs, or any other sexual requests) \nPurely platonic.",
            "38F old person here!\n\nCurrently working as a freelance coding instructor and working on my own course, desperately looking for students who are willing to commit to the lessons. You get a free education, I improve my content, lmk if interested.\n\nOtherwise, I enjoy learning new stuff mostly related to computer science and AI. I also try to cook something interesting and water my plants. I need to get back to walking which is difficult due to my health issues. But I love going into nature.\n\nEdit: Wanna share a bit about the course. It's new and undergoing changes, that's why it's free. It's meant for beginners which we won't be focusing on any programming language or syntax but the foundations of it so that it will be easy to learn any other programming languages.\n\nI'm looking for someone interested to attend 10ish lessons 1hr each, and try to do the assignments. Time is flexible but I'm only avail on weekdays afternoons and evenings. Lessons are conducted on google hangout.\n\nDM if interested",
            "28F here. absolutely love board games; I dive and enjoy discussing philosophy/politics/economics occasionally as well. Looking for more Eastie board gamers to connect and preferably play games with (if you have a place to host that'd be fantastic), hmu if interested!",
            "[deleted]",
            "28F, Westie, INFP. Looking for friends only!\n\nIm currently unemployed so I have much free time that I spend on resting. Other than that, I enjoy the following.\n- Crafting. I have experimented with resin, wax seals, watercolours, and am currently exploring cricut!\n- Foodie!!! Love food but i am broke so im trying to be disciplined to save money and cook.\n- Volunteering. I just started volunteering(have only gone once) and would love to do more since im more free for now, especially with animals or mental health. If there’s any adhoc volunteer events, I would love to join too!\n- I binge watch kdramas and many shows/movies.\n\nAm also trying to go to gym more and I love going to cat cafes too!!",
            "2nd post attempt. 38F old person here!\n\nCurrently working as a freelance coding instructor and working on my own course, desperately looking for students who are willing to commit to the lessons. You get a free education, I improve my content.\n\nIt's new and undergoing changes, that's why it's free. It's meant for beginners and we won't be focusing on any programming language or syntax but the foundations of it so that it will be easy to learn any other programming languages.\n\nThere are about 10ish lessons 1hr each, and lots of hands-on assignments. Time is flexible but I'm only able to conduct it on weekdays afternoons and evenings, on google hangout. DM if interested!\n\nOtherwise, I enjoy learning new stuff mostly related to computer science and AI. I also try to cook something interesting and water my plants. I need to get back to walking which is difficult due to my health issues. But I love going into nature.",
            "im 37M .\n\nI work as drafter. Can do 2D and 3D drawing. Very familiar with autocad and solidworks.\n\nIf u want to learn something. Feel free to ask.",
            "[deleted]",
            "31M. I enjoy hiking, gyming, singing (mostly cpop), coding, reading non-fic books, making coffee or coffee hopping, eating/foodie, basketball (but no kaki), BJJ (but white belt), playing in a band/jamming (can play guitar/cajon/basic drums), meditation/spirituality, cooking/baking (super basic dishes), etc. \n\nOn a side note, would also love to meet entrepreneurial/ambitious people (who are nice and not machiavellian pls) who are building a business/venture to form a group that can share motivation for each other.",
            "35M here, standard gamer dad. \nLooking to start another group to play Dungeons and Dragons campaign with play mostly online. \n\nIf you’re interested to try, drop me a DM!",
            "25M, working in IT sector, living in NE area. I think I'm a good listener, so you can feel free to rant to me\r  \n\r  \nLooking for friends with similar interests to navigate through life and figure out adulting together :)\r  \n\r  \nSome of my interests include:\r  \n\r  \n\\- Exploring new food places / cafes\r  \n\\- Travelling\r  \n\\- Singing karaoke\r  \n\\- Watching shows / dramas (Mainly watch K dramas)",
            "Hi all, 24M (25 this yr) looking for friends or just ppl to do activities tgt :> Im an introverted person, also up to just chat too about anything \n\nThese are the things im up to / interested in:\n- Desserts / Food - I currently have a small list of dessert places (usually cafes tho) but alw open to go for food\n- Crafts - I crochet abit (usually pretty simple stuff) but also like crafty activities, e.g. like terrarium workshops\n- Karaoke - Usually mandopop n some english\n- Tea - Please do send me ur tea recommendations!! Currently have some T2 and blanbunny teas\n- Volunteering - Still pretty new to this area but i currently spend abit of my free time volunteering :o\n\nIm also open to most other activities!! I also like other stuff like cat cafes etc\n\nThanks for reading! Do feel free to DM (for just about anyt really)",
            "37M, westie, working in logistics with a lot of time to spare. Introvert but keen in talking to new people to spruce up my dry ass phone.",
            "[deleted]",
            "Hai peeps, I'm a 17M, ISFJ in ITE, studying in hopes to make it to psychology in NUS one day!\n\nI'm quite a shy person and I feel quite young being in a reddit filled with ppl over 20+ 😅. Compared to talking in-person, I'm more \"extroverted\" when talking online behind the computer and I'll say whacky stuff sometimes 🙃\n\nSome hobbies and facts about me:\n- I play acoustic guitar (still at an amatuer level 😅)\n\n-I watch anime (my favorite genere being slice of life)\n\n-I sleep (alot)\n\n-My chinese is THROUGH the gutter so dont expect any conversing in chinese from me 😅\n\n-Play chill or fun multiplayer games (Honkai Star Rail, Stardew Valley, Lethal Company) \n\nI'm also a person who is willing to listen to anything you want to vent! Even if I'm not able to understand the true pain your going through, I will try my best to empathise with you to the best of my abilities no matter what.\n\nI'm usually fine with conversing in groups but I will be drained quite easily so don't expect much of a reponse after an hour or two from me 😅, I usually prefer much chiller 1 to 1 conversations rather than in groups.\n\nThanks for reading peeps, hope we can be friends!",
            "[deleted]",
            "Anyone going to the GUNDAM SEED Freedom screening next month?",
            "Anyone up for beer and mala? :-p",
            "Just turned 28M.\n\nFoodie and loves traveling. Japan is amazing, I've been there 4 times and I can't get enough! I'm going in Australia in May, and probably August.  Intending to redeem my first business class flight this year with my accrued miles.\n\nLike to keep active. I signed up for BFT Woodlands so would be nice to get some kakis to go with! It's a preorder but I can go Orchard, Tanjong Pagar and Outram for a couple of sessions.\n\nI also love music and singing, more of jiak kentang type (more into English, or even Jap but I also listen a bit of mandopop)! I actually got a pair of Taylor Swift tickets and am looking for another person interested to go TODAY (Sunday). DM me and I can send you the deets! It's around cat 2 ($338).\n\nEDIT: TS tix taken and it was LIT! Thanks for those who expressed interest. I heard ticketmaster has been releasing new tix again so keep your eyes open👀",
            "Hi there, 30F INFJ so you know you will get weird hypothetical or existential questions from me (lol). Funemployed at the moment (panic looking for jobs obviously), so have free time to just enjoy and explore new hobbies. \n\nMy likes: Photography, hiking, cycling, LOVEEE solo travelling (started my solo travel adventures last year and can't wait to solo travel more), love visit museums, American TV shows/movies/music.\n\nLooking to make meaningful friendship with people who are in the same life phases! Let's connect (sorry if I miss your message)! \\^\\^",
            "heya. Early 30s Male here. Looking for friends who are interested in learning diving or wakeboarding together. Most of friends have already learnt so it would be great find someone who shares a similar interest. \n\nelse, i work in CBD area also always looking out for lunch buddies and chat about work or anything!",
            "38M westie working in healthcare..like to gym, watch YouTube videos and travelling during free time… would love to meet new friends here",
            "26M Chinese, working in the IT industry, causally plays basketball and goes to the gym. Looking for friends to go Jb to chill drink, listen live band, go out on activities, cafe, shopping and stuff.",
            "24M, testing water here.\n\nLeft my job in March and travelled solo around Indonesia for a week. Am pursuing a career switch (fingers crossed), hit me up if you're from a Advertising/ Creative Agency!\n\nLittle bit about myself; my friends described me as a person that was born in the wrong generation. Fairly simple guy. I like dressing up (despite sweating because of the disgusting weather), I love a good cuppa matcha/ chai, I collect records and a avid film/ tv series guy.\n\nI'll be more than happy to meet if we resonate. Also, would be great if you know of a joint that has good Sourdough.\n\nHere goes nothing, cheers!",
            "Hello, Im 22M currently studying in a local university, met some amazing people here and I do wish to meet more and maybe introduce some of the friends i made. My holidays are coming soon and im looking to use this time to get to know people outside my university. Looking for people to have nice conversations about dreams, future goals and things you enjoy to do.\n\nI enjoy playing boardgames in my free time and if i could make time, I would occassionally go for a swim. I also enjoy badmonton,karaoke, cycling and window shopping. I also love exploring differrent places in Singapore, to areas i have not been to.\n\nLooking to get to know people around my age and life stage",
            "33M local, high-functioning introvert looking for gaming/texting buddies. Trying to get a group/get in groups of like-minded people for gaming sessions in Warframe, ARPGs like Diablo4 or PoE or Last Epoch...or just any kind of multiplayer games as long as not playing like high competitive. Can text in a well-mannered demeanor or just meme-like craziness depending on party and setting.\n\nAm an alumni mentor to ex-alma mater students and undergraduates. Open for career discussion or banter.\n\nPrefers to keep things online until close enough. Then would like to explore board games, trading card games.\n\nMostly free only at night for games but chatting and texting can be always. Feel free.",
            "hi, 19F this year, INFP if that matters? hoping to make some friends again :) my hobbies include: crocheting/listening to music/writing/reading/gaming!\n\ncurrently waiting for school to start in around a week's time? looking for friends who are okay with chatting for some time before any sort of meetups,, feel free to dm!",
            "Hello! 26M from west side, currently in 1st year of uni. Looking for others with similar interest in 3D printing, cutting machines (Cricut/Laser), electronics, etc, basically maker culture in general. Have plenty of hobby/work related experience in this field and looking to pick up other skills like sewing. Also recently got into self-hosting stuff and got a cheap PC to play around. \n\nCurrently just attending those free library workshops to learn and use their facilities. If you're also interested just dm and we can attend some together!",
            "[removed]",
            "Hello! 26F, living in Central Area! Working in cbd area but mainly wfh so I’ve been getting into fitness lately with dumbbells! If you have any tips for beginner working out do let me know ! On side note, I’m a huge foodie and would travel for food!",
            "30M right here\n\nProfessional stay-home dude until someone asks me out.  \nPlays Valorant & League of Legends   \nEnjoys deep conversations  \nCan be a good listener if you need one! (:",
            "22M here from central ish sg and kinda new to reddit ish. NOBODY SAID it was this fun?? anw\n\n* tryna figure out my premature quarterlife crisis. (real)\n* like outdoors, hiking, thinking of climbing mt kinabalu, doing a diving trip/cert. like sports too, played softball and some martial arts. Tryna continue my fit streak so tryna start gym and calis.\n* i like frogs and bees and like to do some gardening (its kinda failing) and cooking (m0m wont rly let me cos the kitchens its all hers. always has been.) i wanna keep frogs and attract bees\n* wanna do my bike license soon! any wanna be riders?? cld be lesson buddies\n* like gaming but weirdly dont play that much deez days\n* love me some cheap hawker food gems and dishes, but chill with gg to nice restaurants that are actually worth their price. Idl to spend on things that i dont see much value in, unless its a one-off for the experience! im open to most new things, i think HAHA, recently tried balut.\n* goofy and unpredictable at times. (didnt know u cld edit ur avatar but im taking full advantage now)\n\nhmu for a SEA hiking group/duo/trio/quadrapio/pentaio trip maybe :\"\"List of places I wanna visit (ranked asf) oh yes i like to travel too! fav country so far is vietnam! And dont rly wanna travel solo but hv like a total of 5 friends! \n\n1. japan (ong i have 250 saved posts)\n2. mt kinabalu for hike, phuket or tioman for diving cert. wld consider any other SEA mt.\n3. mt everest base camp hike or other easier nepal himalayas trails\n4. pantagonia\n5. central vietnam",
            "31m  infj westie looking for friends/texting buddy(relationship if things go well)\n\nHobbies I enjoy:\n\nJapanese\n\n•music(yuuri, aimer, my first story, official higedan to name a few)  \n•food (soba, ramen(specifically tsukemen)  \n•travel, looking to plan my first solo trip in Japan  \n•kamen rider/Ultraman/super Sentai(japanese power rangers)\n\nGaming\n\n•big into intriguing stories (Shin Megami Tensei(including persona), kingdom hearts, Yakuza, bioshock, nier to name a few)  \n•action looter (borderlands, diablo 2-4, path of exile)\n\nPC building/tech talk  \nDeep conversations\n\nPlus points if we have common interest  \nFeel free to dm , open to questions",
            "Hi 27F, INFP, just moved back to Singapore from living overseas for about a decade lol. I'm looking to make new connections with people! Here are my interests: \n\n- I like reading (currently reading Thinking, Fast by Daniel Kahneman)\n\n- drawing \n\n- going to cafes\n\n- movies\n\n- recently got into bird watching (only been able to watch myna birds here so far haha) and nature walks \n\n- working out (haven't worked out in a while tho need to get back in the gym!) \n\n- Cats (Don't have one, but if you do you are my friend now, no objections) \n\nI'm also open to trying new interests\\\\hobbies and just vibe with folks, thank you for reading!!",
            "23M here looking for friends to hike and maybe do some volunteer work together ?",
            "Reposting sorry\n51M (yes Gen X )\nTrying to start doing regular boxing coaching (even fitness)\nMoney isn’t the motive, happy to do it for free\n\nI run daily, do calisthenics, boxing, gymnastics, less of weight lifting more plyometrics\n\nFree weekday mornings (8am till 11am) and some afternoons\n\nHappy to coach anyone looking to pick up boxing",
            "[removed]",
            "Hello! I have made some really interesting friends from here and from r/sg so why not again :) \n\nF26 Singaporean, but currently in the UK. Central/Westie-ish when I'm back. Recently graduated, did a BA in Philosophy, Politics and Economics! Still on the job search, but currently teaching tuition online most of the days.\n\nHobbies: \n\n- watching nerdy YouTube long form documentaries like Real Life Lore, Veritasium, Wendover Productions, PolyMatter \n\n- kdrama and cdrama fan, huge fan of xianxia recently (regret not wearing a hanfu to grad) \n\n- spends quite a bit of time on tiktok (isit red flag HAHA)\n\n- Fan of cute funny shows like Bob's Burgers, Ted and Modern Family\n\n- Being a passenger princess on road trips \n\n- Cafe hopping, going for good food \n\n- Getting back into reading (I know I did a reading degree but haven't spent time with books that interest me since uni) \n\n- Violinist and percussionist, asian mum made me learn violin since young, hated it for years til secondary school and then went to play in several amateur/school orchestras after poly, played percussion in the uni brass band. Love going for classical music concerts! \n\n- Slightly obsessed with FIRE, living the simple life\n\n- Used to drink and club a lot in uni, will chop pints on a night out, but alcohol tolerance has decreased significantly \n\n- Got into rowing and women's rugby at uni, now I just love watching rugby matches \n\nPersonality: \n\n- Dark sense of humour + big maker of lame dad jokes \nI don't take myself too seriously \n\n- Huge listener, great hugger, supportive good friend \n\n- Will over analyse problems with you \n\n- obsessed with my UK partner's 2 romanian shepherds \n\n- Wholesome af, lots of love to give\n\nDMs open!",
            "35F, introverted but very keen to make friends!\n\nRun a little creative studio so always keen to network with other designers / creatives.\n\nOtherwise, I am also very into walking. My record is 25km. 100% down for exploring SG on foot.\n\nI dig art, history, philosophy, rhetorical questions, metaphysics, architecture, psychology, and gaming (mainly console, but these days its mainly been just wr on mobile)\n\nBeen wanting to try D&D but also very interested to pick up other board games. Please initiate me into your board game group(s)!",
            "26f trying my luck\n\nMy interests revolve around my work (full time) and study (part time); I watch and read a lot of stuff generally and like to explore the nooks and crannies of this little island we live in. \n\nUnfortunately a little bit of a busy person but will invite you to film screenings, long walks and random things when I have time. \n\nI do yoga and used to jog a lot - trying to get back into that by sinking money in a gym lol\n\nDM me if you're looking for a casual meet-up with a stranger",
            "32F, functional extrovert. Currently trying to survive in my new work role, also trying to spend more time with ageing parents. I enjoy random chats about anything, DM me!",
            "51M. Married with kid and working in tech. Looking for running buddies that like running in the north east on sunday mornings or near Marina Bay Sands on thursday evening. Love chatting about running, tech, anime, manga, career as well :)",
            "26F here~\n\nDesigner, currently working on my portfolio :”)\nI train at the gym - I go to AF. Also learning the guitar! I love exploring new places too~\n\nI’m p funny, I think lol. Introverted. Also I love sitcoms like modern fam, kim’s convi etc \n\nReach out if this is your thing!",
            "Helloo!! Whoever is reading this, I hope you’re having a good week so far :) I’m 21F (Indian, not that I think it matters but I’ve met some mean people and I’d just prefer to put this out) 🌚\n\nI’m in Uni and really finding it a struggle to engage in hobbies or meet others but I’d like to put in more effort so I’ll list out some of the things I like to do and some of the things I’m interested to try!!\n\nI like exploring cafes/eateries, making cute diy stuff for friends, cooking, dancing (learning a classical Indian dance form currently), watching Indian/western/thai movies (esp horror with like 75% of my eyes closed and rom-com/com), reading (occasionally but I’m trying to make it a habit ~ currently reading a thousand splendid suns by Khaled Hosseini)\n\nI’m interested to pick up photography and crocheting! So if you’re a beginner and you’d like to explore it together with someone, hit me up 😊\n\nI’m putting the above out here just to share a little about myself but I’m open to getting to know you even if our interests don’t align or if you just need someone to talk to, do drop me a text and we can see how it goes from there :)) have a great week ahead 🫶🏼",
            "Hello :) 25F here and officially having a quarter life crisis- feeling a little too old to be out clubbing w the teens, but still too young to be moping around my married friends babysitting! My social circle is woefully homogenous- I love my friends but we went to the same schools and think the same thoughts and dream the same dreams. Am longing to find a kindred spirit to share new adventures with, and maybe learn to see the world through a different pair of eyes..\n\nI am restless (not a homebody), a hedonist (a girl’s gotta fight for her own happiness!), and a maximalist (guilty of collecting all things of beauty). I am reasonably well travelled and prefer nature and road trips to cities, and go on at least one dive trip and one ski trip a year (please drop me a message if you’d like to come along!!). Would also like to see the Machu Picchu, trek through the starlit Namibian desert on camelback… (if I have any leave left lol). \n\nAfter work and on weekends, I’m usually off to a play or concert, checking out a new bar w live music, or engrossed in whatever new hobby it is I’ve picked up- am up to try anything at least once!!\n\nI live on my own with three fluffy little gremlins, I host board game nights regularly and there is always a bottle of bubbles in the fridge to share. Also a nice big telly for weekday movie/netflix nights :) Extra bonus if you like oldies rock, jazz or classical- I like putting some music on when I’m home!\n\nIf any of the above sounds like something that might be down your alley, I’d love to make a new friend!! Especially fellow girlies hehe, am in a girlpower era atm ✨",
            "hello 22F here, currently studying in SMU and stays in the north! looking for friends to probably hang out and  try out new/interesting things around sg. interested in walks/hikes (planning to try out coast > coast trail smtime also), food, exploring new places! feel free to j hmu if u wnna talk as well HAHAH",
            "Hi 35f here. Trying this for fun. I’m into yoga, books (fiction), dramas (hbo shows). Also like to bake on and off. Feeling a bit down lately also. Wondering if anyone wants to just chat",
            "Hi everyone! 28F here, staying at the west. I’m looking to make new friends in the same age group this year to chat about random things / potentially meet up. \n\nI’ve recently started Pilates classes and cozy gaming (e.g stardew valley, a little to the left). \n\nIf anyone is interested in going for painting or pottery classes or need a kaki for mahjong, please also hit me up! \n\nStrictly platonic only.",
            "33 F, westie, looking to be more intentional about my friendships this year! \n\nInterests: coffee (pour over mostly but have been trying more Vietnamese coffee and indian filter coffee cos of travels), craft beers (ipas!), gongfu tea (super novice!), huge tv show/film nerd, \n\nsuper into journalling and always up for more journal buddies. Always keen on introspective convos!\n\nQuite into mental wellness after having spent some time recovering from burnouts and trying to be more compassionate with myself. Spent some time volunteering in the mental health space as well. \n\nUsed to play more board games so always up for open jios! I also play d&d for fun. \n\nI am addicted to fire emblem 3 houses! Can't seem to get enough. Zelda and Pokemon be cool too! occasionally watch anime but haven't seen anything after AOT and furuba. \n\nI occasionally read and have been looking to read more. Fave book is East of Eden. What's yours? \n\nHarry potter is my true love. If anyone is looking to go to the HP exhibit, lmk!!!!\n\nLove wildlife so always up for more birding or herping! \n\nSuper huge foodie! I have a saved map where I map all my good food spots. Exchange food recs please 🥺\n\nPractising stoic. Still kinda new at this. hurhur.\n\nIf any part of the rojak sounds interesting to you, hmu! 😸\n\nEdit: still replying messages--keep them coming and really appreciate the messages coming in. :)",
            "29F North Westie. Malay/Muslim. A lot has changed since I last posted here last year - mainly my fitness. Been an AF member for a year and staying disciplined - did body recomp and lost weight/got toned along the way. Currently engaged and getting married next year. Wedding planning made me realize how very little friends I have so I'd like to make more! I'm gonna be 30 in November and as someone who didn't have it good growing up, I'm always looking for self-improvement - so if you'd like to talk about inner child healing, life goals, personal growth etc. (don't worry I won't trauma dump LOL) I'm down to be your listening ear.\n\nAs for music, I'd say I listen to a bit of everything. I consider myself a big Swiftie but NOT going to the Eras tour coz I couldn't get tickets and I'm not feeding the scalpers. I used to frequent a few concerts back in the day and life was so much easier then. Anyway...\n\nI used to play games like Valorant, Fortnite etc. but not much anymore. Considering selling my gaming PC hahaha. Currently waiting for GTA6 next year.\n\nI also like watching True Crime, Anime, used to be into trashy TV lmao but these days I just watch whatever on Netflix to justify the subscription. \n\nLooking forward to making some friends :D",
            "Hi! 30F from UK, married, no kids, west. Recently moved over with my husband. Academic researcher/tech currently between jobs (aka unemployed and starting job search). Looking for female friends with similar interests/hobbies but also happy to try something new! \n\nSome hobbies/interests:\n\n* Exploring new places, museums, galleries, nature walks\n* Crafts- mostly sewing, crochet\n* Eating tasty food/brunch/coffee, bonus if it involves cheese \n* Shopping\n* Board games, computer games & switch, learning violin\n* Watching whatever is on netflix etc \n* My work interests are coding/tech/data/neuroscience\n* Team cat \n\nI would like to start exercising more, so also interested in finding exercise buddies (I am pretty much a beginner again now though). Please DM me if interested!",
            "Hi! 24F, freshly graduated from a texh background, looking to expand my social circle. Would prefer to text for now, but if we vibe, I don't mind meeting up and doing some activities together :)\n\nRealised I didnt have many hobbies because of school, but I'm back to swimming and playing valorant on a semi-regular basis. Some interests include:\n- Spin\n- Swim\n- Running (I'm quite slow but I'm working on my speed now)\n- Watching comedies? (B99, The Good Place, 2 broke girls etc)\n- Travelling (going malacca and korea soon, so can drop any suggestions/ things i should definitely do!)\n- Food (baking and cooking mostly, not really interested in cafe-hopping haha)\n- Learning about history",
            "[deleted]",
            "Abit unconventional here. Suffering from depression and looking for someone to just complain about life together. \n\nIf you're interested we can play some halo",
            "37M, married, no kids, looking for friends who are interested in manga, anime, gaming, cafe hopping, and willing to try bouldering.",
            "Your typical gymbro\n\nRecently started hiking, did 黄山 last year, going rinjani in may\n\nLikes cats and anime\n\nLikes to la kopi at hawker centre",
            "33 Male here.\n\nI just started getting interested in philosophy and politics (Both local and international). Interested pretty much everything. Did a bit of boxing but stopped. Hoping to get it on again when I managed to confirmed in a new job. A sucker for the performing arts and done a bit of stand up and a small unknown podcast. \n\nFavourite music genre will be southern blues and a bit of contemporary country music. But my favourite band is a metal band lol\n\nFavourite stand up: Marc Maron and Jerrod Carmichael\n\nFavourite Podcast: Lex Friedman Podcast and WTF with Marc Maron",
            "hello, 27M here. i train jiujitsu (something like judo) most days of the week but looking to run or walk more.\n\n\n if a running/hiking buddy will motivate you like it would for me, hit me up, thursday evenings or sunday evenings 🙂 - let's do it if its convenient for us\n\n\n if you're interested in jiujitsu and want to hear more, feel free to chat me up too ",
            "Hi 28M looking for friends around my age.\n\nPhysical activities: Squash (regularly), cycling (once in a while), running (started recently as I just recovered from a tibia fracture), kayak/SUP (once in a blue moon).\n\nI do play board/card games and switch games.\n\nShows: Currently watching Reacher, Dexter and Only Murders in the Building. I love Community.\n\nFood: Love eating hotpot and ramen. Love to experiment too because why not?\n\nMusic: Creedence Clearwater Revival to Elton John to Oasis to Green Day to Kendrick Lamar. Stuck in the early 00s and 10s for Chinese songs. No music too boring, no music too jarring.\n\nHumor: Can be light hearted and enjoys dark humour.\n\nDo drop a message :)",
            "29M, central. Married, no kids. I enjoy hikes, running, gym, coffee, podcasts. Great fan of craft beer. Recently very interested in bio hacking. Works in the legal industry. Hit me up for a coffee or drink anytime !",
            "18m, westie, bored in poly with no friends to hang with after school. looking to meet new people here to hang out with or just chat, only people around my age plz",
            "hello. 25M here who enjoys photography, cooking, hiking, and going to the gym! Been wanting to get into Yoga or some form of MMA. \n\nHMU if our interests align! :)",
            "Hello! 23M Uni student here. I love watching korean variety shows, listening to korean ballads and of course, singing KTV. My usual time-killers are reading webtoons/manhwa and playing honkai star rail. I'm also look for people to try out food places with me (food tastes better with company :D) \n\nIMO:\n\nBest sci fi film: Interstellar\n\nBest superhero film: Infinity Saga films\n\nBest fiction novel: Omniscient Reader's Viewpoint\n\nFun fact: im learning korean now so it'd be great if i could find someone to practice with",
            "Hi! 27F and will watch the Coldplay later! So I was wondering if there's someone interested to go out Haidilao (I heard there's a discount in Plaza Sing if you present your ticket) or any place afterwards because I'm betting I'll get pretty hungry after haha. I'm going to tonight's concert by myself so I'm looking to have someone to discuss post-concert high! \n\nPS. I also watch anime so we can also talk about it. My genre ranges from Shounen to BL haha. \n\nPPS. From the Philippines but working here if that matters.",
            "28M looking for friends who are interested in learning phone photography together, or forming interest groups to learn about photography in general, I'm new to photography",
            "EDIT: If you have already scrolled so deep into the thread now, why not give me a shot? It may be the shot that changes your life heh  \n\n\nHey! 25M here. I just grad from uni this year and I realized I have now dived straight into a quarter life crisis lol. With how things are headed now, I’d be lying if I said I’m not lost. I’m looking for friends, heck I wood talk to a tree if it talked to me lol. Down to meet up (am northeastie), hang out, chill chat talk about anything under the sun. If it helps, I’m INFJ, a really good listener according to some of my colleagues too.\n\nBeen playing the piano for just 1 year now. I have also performed my first time last December. There’s just something so cathartic about playing the piano that just strikes a real deep chord within me. Me playing the piano actually managed to pull people into picking up/back instruments so I guess I’m good at motivating people haha. PS: Sight reading is just pure suffering :')\n\nI gym (AF) alone very frequently too, so if you need a workout buddy or guidance, I’m down to spot and guide if we’re nearby. Slowly getting into calisthenics, but I have lightly injured my wrist due to excessive use in gym, piano and work soo calisthenics would have to wait.\n\nTrying to also get into bouldering as I have no idea how to go about doing that. I’m looking to explore this some time soon and mayhaps we can do it together? That aside, if you would love to talk, hang out, chill or meet someone new (that's me 😆) to explore new things together and see where it goes. Hit me up!",
            "hi all. 28M westie, introvert looking to meet new friends & expand social circle.\n\nbadminton enthusiast who plays weekly. other hobbies includes listening to music, watching anime/kdrama/chinese variety shows & casual mobile gaming. hmu for badminton games!",
            "Hi, 34M here. Westie here. Looking to broaden my social circle.\n\n\\* watch YouTube long form documentaries  \n\\* Occasional reader, mostly non fiction  \n\\* watch series on weekends  \n\\* likes travel and travel content\n\nDaily routines : exercise, journaling\n\nLatest craze : bike instead of bus/mrt for short distance travel.\n\nYou read till the end. Yay!",
            "[deleted]",
            "Hello, late 20s M here that resides in the east. I'm open to friends of any stature or age group!\n\nOwner of 3 cats and a big animal lover, happy to discuss anything about pets!  \nBig badminton & futsal player, plays any sport as well. We can play some sports/games!  \nA big foodie and eater, loves to go for food hunts weekly.. high metabolism and sports helps keep me lean!  \nPlays a selective few com games: League, Valorant. Open to play with any rank/level, don't really play phone games sry!  \nLove reading about fiction, history & current affairs, works in trading/finance in the CBD! Lunch kakis are okay! :)  \nColdplay fanatic, The killers, FUN, mozart gets my soul moving!\n\nPragmatic, rational & chill, non temperamental & non-emotional can hang out with any MBTI!  \n6'1 so some friends don't wanna stand near me or go jalan jalan tgt :c",
            "Hi all, 39m here and just happened to bump into this. My working environment is very small and many of my colleagues are much older than me. I have free time after my work so would like to widen my social circle and hope to make some friends along the way.\n\nI enjoy simple activities like taking walks, exploring nice and interesting food places, the occasional karaokes and movies. I don’t have any preferences in general so I would be open and hope to join anyone in their interests or activities if you are open to share with me. Cheers! :)",
            "Hi, 23M studying computer science in uni. I enjoy things related to my major (i.e tech) but also  love music and philosophy. \n\nSome artists I like are Paramore, boygenius, Alessia Cara, Lizzy McAlpine, beabadobee, Hozier, Young the Giant and Metallica.\n\nI also like to explore Singapore and I'm a certified coffee addict :D\n\nHit me up if you have similar interests :)",
            "31m, looking for people to chat and to exchange songs with.  \ni'm pretty much an open topic person, so i'm down to chat about any thing.  \nmy music taste is also pretty broad, only not able to appreciate heavy metal, rap, and classical instrumental music. hit me up.",
            "Hi all! 38M in the marketing industry who is staying in the North-East.\n\nA new father who is looking to get back in shape, so please jio me along if you are short of people for bball!\n\nAm into strategy games, both digital and boardgame, and a pretty decent conversationalist so if ya bored, I'm happy to chat about anything under the sun!",
            "35M looking for someone to learn something together! I am considering a new language, something like Korean or Japanese. Or it could be a new skill, for example, cycling (yes, I dont know how to cycle).\n\nAlso looking for sports enthusiasts to have a few sports sessions together. Badminton and basketball would be pretty neat.\n\nOf course, I am always up for a few drinks, a mahjong session or boardgames, pool or karaoke, hit me up\n\nOr if you just wanna sit down and finish a K-drama together lol, gaja!",
            "Brw, I have created a telegroup for people in their thirties who interested to come together to form more friendship",
            "Hi all, 27M and introverted. \n\nMy main hobby is video gaming and I like to spend most of my time dissecting the games and discussing the art, music, story, mechanics etc. I usually play PC games and Switch games, and recently played some games like Last Epoch. \n\nOther than that, I also watch a bunch of animes and eat good food.  \n\nLooking to find some gaming buddies to share the same experiences through voice chat, streaming and/or coop.",
            "[deleted]",
            "29M. Looking to expand my social circle and meet new people. \n\nI’m interested in cars/motorcycles/mandopop/kpop.\n\nI own a motorcycle myself and don’t mind going out for a night of rounding + supper. Things like boardgames, karaoke, rollerblading, tryna improving my programming skills as well. \n\nAlso looking to get into drumming to pick up a new hobby, if anyone knows how to drum and don’t mind teaching me, I’ll be down to learn. \n \nWe can chat about anything! Hmu",
            "29M. Working as an engineer in semiconductor industry. \nLooking to make some friends here. Kinda an introvert I guess. \nI like to drink during fri night / sat as kind of a way to relieve some stress and emotion.",
            "31M, currently into climbing, am looking for a climbing buddy for 30 Mar 2pm-6pm at Funan, and you dont have to pay for anything. Leave a self intro comment if you are interested and available in the above stated time. Thanks.",
            " Sup! 22m , Westie but I travel a lot around the country so any location works\n\nCurrently chilling before my next phase of life so looking to pickup some lifelong friends before that happens!\n\nCurrent interests, photography (cuz I just got a new camera), hiking , badminton , cafe hopping, food hunts and more!\n\nNo worries if you don’t see anything matching, I do read and do a lot of things so we might have something in common! So drop me a DM!",
            "Heya 27M,\n\nJust bought a ukulele. Anyone with ukulele wanna practice/learn together during weekends?",
            "Hello!\n\n37F here, just moved to Singapore from the US and looking to make some friends (any gender). I’m childfree but have a 4 year old mini dachshund boy. I’m a graphic designer but not currently working so I expect to have quite a bit of free time.\n\nAs for my hobbies, I am a huge anime fan, enjoy video games, learning Japanese, watching Korean dramas, taking my dog on adventures, and drawing (badly, haha). I’m a big fan of the Monster Hunter series as well as FFXIV, JRPGs and rhythm games, but I find almost any genre of video game interesting. \n\nI’m pretty shy and introverted until I get to know people, so I’d probably want to get chat a bit first before we meet up but feel free to say hello!\n\nI’d definitely be down to meet up for play dates or at dog cafes as well after my pup’s quarantine is over.\n\nI’m also interested if any of you have any recommendations on local Japanese classes? I’m excited to get back into the swing of things with learning. :)",
            "Hi all! I'm 35M, married, and looking for friends to go swimming regularly with! This is a recent development and I'm enjoying swimming recently but I think it'll be fun to swim with someone I know. I'm not exactly a good swimmer but I do laps. I swim about 3 times a week. If anyone is up for it, do pm me!\n\nI also do running, 3-5km but I'm currently carrying an injury so I've been swimming to keep fit. I wouldn't mind a jogging buddy to if you would prefer that! :)",
            "Anyone in Tampines looking to play table tennis regularly? Looking to improve in the long term during my off days. Skill-level wise, I can do forehand/backhand loops but have trouble reading spin.\n\n29M if it's relevant. Let me know via replies or DM. Thank you!",
            "Hello everyone,\n\n26M here West, just looking for anyone that has the same interests / to chill. Love to learn different languages, Spanish, Indonesian, Tagalog, Cantonese but focusing more on Spanish now. I play chess sometimes online, read manhwa/anime (mostly actions and probably read most of the top mangas: One piece, bleach, fairy tail demon slayer etc). Actually finding someone to gym with to push harder cos kinda losing motivation to work out alone. Trying also to live longer by fasting 20+ hours daily for some time haha, hmu if you wanna have a chat, talk about health or nutrition or about anything interesting.\n\nCheers.",
            "Hi 22M INFP here currently studying at NTU! I have been a homebody my entire life with little to no friends. But recently I made a new friend that inspired me to be more outgoing so here I am trying to find new people to talk to. I've seen so many people looking for friends here but I didn't dare to message them haha so here I am making a post as it feels easier for me. So if you're an INFP or someone who wants to make friends but feels shy to message ppl well I am too, so don't be afraid to reach out! We can be awkward tgt haha! \n\nA little about me is that I really value the friendships that I have and I've just recently started playing Persona 3 reload! And I like playing apex",
            "Hi 26m here! Looking for peeps who wanna watch films in the cinema often or peeps who play switch games :>\n\nI’m also open to having h2h talks online so if you ever need someone to vent, do dm me! I do well better online and irl it really depends but I’ll always try my best no matter what (unless the vibe really cmi im sorryy)",
            "26M here! Hmu if anyone's interested in attending the Open Water PADI Diving Course at SEA Aquarium sometime in Jun-Aug :)\n\nAlso have been playing table top board games for several years, mostly light-med complexity games. Would be interested to find people to go for any board game sessions and I also have a number of games in my collection!\n\nTook Japanese lessons for several years up to N3 level in the past but have lost touch with it for quite a while. Keen to practise conversational Jap with someone",
            "Hello! 30M living around kallang area, looking for people  to play some badminton in the daytime (mornings/afternoons) Haven't played much ever since secondary school days lol. Just an average player looking to meet new people and have a good time playing!",
            "32M\n\n* Trying to enlarge my circle of friends. I join some group outings and organise my own now and then.\n* Mainly interested in making Chinese (Mandarin) speaking friends both M/F as that is the language that I connect better with emotionally; open to English speaking as well.\n* Better to have some shared hobbies/interests.\n* Main hobbies: Reading books, Playing music.\n* Other side interests: Lindy hop social dance, Hiking, Watching live theatre, Chinese poetry.\n* Not interested in online chat buddies. Prefer to go out for activities/outings together. Let's meet for lunch/tea first.",
            "38auntie married with kids looking for ppl to have intellectual / meaningful conversations with. Supposed INTJ but the older I get the more extroverted I find myself prob cos I no longer care about others judging me. I enjoy j-movies (slice of life type), mandopop karaoke (playlist frozen in the 2000s) and random crafty stuff.",
            "Turning 20 this year, male living in the north. I'm a student currently studying culinary arts (aspiring to open up my own restaurant hehe) studying and working pt at dtf so my schedule is packed with work and school\n\nI don't have many hobbies other than cooking, but I guess I'm a bit of a homebody, so I don't do much. But let's see now, I like cooking, food, photography, long walks at night, stargazing and that's all I can think of for now so hmu if you are interested in the things above",
            "Hi all. 33M, east side. Currently on a long break, finding a new career direction. Previously ecom related. Here to meet new people as my social circle is very small.\n\nI like long and deep conversations, and regular long walks in the night. Enjoys small group settings or just 1-1. And will lend a listening ear too.\n\nInterests\n\n* Podcasts and UK stuff  - HIGNFY, The Bugle & Gargle, No Fish, Econtalk, NSQ, Happiness Lab, Science Vs, Freakonomics, etc\n* Japan - A massive fan of the Yakuza/LAD series, have travelled to most places set in the series during my recent solo travels. I don't watch anime and read manga though :/\n* Photography - Mainly 40mm, and travel\n* Music - Broad but mostly 128bpm\n* Sports - Badminton\n\nThank you for reading :)",
            "27M here, looking for friends to pursue hobbies with! \n\nInterested in:\n\n- Board Games\n- Cycling\n- Movies/Shows\n- Food trails/ Cafe hopping (I'm a huge foodie! 😋)\n\nAnd of course open to anything exciting as well! (Hiking, music, wine tasting, reading, photography are things on my bucket list!)\n\nLooking for both existing groups and individual friends, do reply to this comment if interested!",
            "Doing a repost after managing to interact with friendly peeps through this thread previously! :)\n\nHello, I'm 29M this year and a Northie. Personally, I would prefer to chat first before meeting irl 🙏\n\n* I like to try out new places for coffee and desserts! (because I have a sweet tooth 😂). I also own an Aeropress and a v60 set-up hence I do brew my own coffee from time to time. Current favourites include Piccolo by Hei Kim and Nesuto.\n* I'm currently into a variety of physical activities such as gymming, climbing, cycling etc and I enjoy all of them for the time being. Tips and advice are greatly welcomed!\n* I do listen to quite a wide range of music such as rock, jazz, hip-hop, r&b and I could probably provide some recommendations if you're into these genres.\n* I also recently went to Japan for a solo-trip and really enjoyed my time there so feel free to reach out if you need any travelling tips!\n\nWould consider myself to be an ambivert and my friends have described me as a patient, understanding and good listener. If you think that we could vibe, feel free to DM me to talk about anything that interests you or just to chit-chat!\n\nThanks for reading my intro! :)",
            "35F introvert here, have been wfh for the longest time. Looking for buddies to do some cafe hopping , baking/pottery classes or late night HDL?\n\nBeen trying to try out Pilates but don’t know where to start.\n\nCan do CBD lunch when I’m back to the office sometimes. Looking for new friends for activities as my circle is legit too small! Hopefully can find a group of friends here to hang out with ￼​",
            "Hello! 21F, north-eastie, and giving this a shot to expand my social circle & hopefully make a few genuine friends too:) currently waiting to start uni! I’m a preschool teacher-to-be by day and writer by night:) I love writing & exploring new (pasta) recipes in the kitchen in my free time. I’m learning the drums (and enjoying it immensely!), and listen to a lot of oldies - my favourite band is The Carpenters. Also currently trying to plough through HTGAWM on Netflix haha. I’m a night owl and also love solo-travelling! Looking to explore new cafes, places & maybe even musicals with someone of a similar age:)",
            "Hello~ 25F INFP here. \n\nBeen working & studying at uni since covid years and realised I missed out a lot ever since I went on a school trip earlier this year! \n\nLooking for new friends to meet for cafe-hop / dining (i got a whole excel list of restaurants) and gym as well! I gym at Snap rn (outlets in woodlands, tpy & prinsep - and it's pretty affordable for students too at their current promo rate) \n\nI'm a fan of palace cdramas, criminal minds, anime and k-pop (into le srfm recently!), otherwise i'm honestly open to try new things. Big fan of travelling so can also go JB and explore from there hahahah, hoping to clock at least 5 countries this year. Also, ask me anything about skincare, i can give u a whole routine atp (not expert or anyt, just passionate)\n\nhmu if you are in north/east as that's where i'm usually at, will travel if there's good food teehee. \n\nheading to bruno mars this coming fri (5 apr - gen standing) so hmu if yall going as well!",
            "36F, married. Looking to connect with like-minded individuals who are working towards retirement before age 40 or learn from wise retirees who have income generating asset working for them. This is a very lonely path especially when none of your friends share the same thinking, and we are wired since young to work till we reach retirement age.\n\nYou can PM me to chat.\nNo spams / sales / marketing messages please. Genuine ones only.",
            "25f here. intj! i am looking for new friends to chat with! also looking for new hobbies to pick up! i love watching netflix/drama. love criminal minds!!!!!",
            "31F, works full time. Loves reading manhwa and fiction novels, plays computer games a lot, watch too much anime for my own good. \n\nLooking for ppl to play games like Helldivers 2 with, if not board games would be lovely too. Also need ppl to drag ma lazy ass for some reformer pilates so if you are on ClassPass hmu too!",
            "Hello!! 21F hoping to make some new friends. I have quite a few interests right now (i pick up hobbies when im overwhelmed with school) but mostly i enjoy watching movies and long youtube videos, i love cats, baking and hiking (though its been a while). I recently started learning how to play the guitar again and also impulsively bought a few gundam model sets, so if anyone has any tips for either, please share them with me hahaha im open to talking about anything else too ☺️",
            "yeehaw\n\n27f looking for new interests/hobbies to try with like-minded people (indoors stuff probably, i’m intolerant of heat)\n\ni’m terminally online, and i play a bunch of games right now (destiny 2, HSR, genshin, bg3) always open to other multiplayer games, but im not exactly a casual kind of player   \n  \nalso, i’m quite into holostars - shoutout to gavis bettel, my kamioshi\n\nim on discord whenever i’m awake, but whatsapp/telegram is fine too   \n  \nfeel free to yap in my dms about anything under the sun, i reply pretty damn fast if it’s via discord",
            "Hi! 46F. Single. Eastie. INTJ. Foodie. Non-smoker. Agnostic. Working full time in Tech field on EP (moved to SG about 2 years ago from neighbouring country). Looking for friends to grab a bite and check out cafes and restaurants / for drinking buddy / for chats and conversations about anything and everything / for walking around aimlessly and exploring the neighborhoods. Basically wanna just to wind down, relax and chill after work on weeknights. A workaholic that gotta start living again. If you have something similar in mind, hit me up hey.",
            "[deleted]",
            "[deleted]",
            "48F Central Single\n\nEnjoys live music (concerts), food and travelling  \nInterviewing people of and connections to Singapore - all walks of life. Passion project.  \nTech consultant and ghost writer -  learning to write first script  \nLoves crossfit but not fit yet... working to it slowly  \nCan bingewatch a really good show - crime, thriller, drama",
            "hi f23 lesbian here, stays in the east looking to make more queer friends :) i love exploring restaurants n cafes, fav cuisine would be japanese\n\ni love figure skating but cant do it in sg anymore as the rink shut down so now i spend my time binge watching shows n hitting the gym after work\n\ni love R&B, pop, rock n metal music n love going to concerts. fav artist of all time is the weeknd",
            "[removed]",
            "(Made some wholesome friendships here before so reposting again)\n\n26F, looking to expand my social circle and find like-minded individuals who enjoy (to name some) gaming, art, books, coffee, movies and cats as much as i do! hmu if you're ever up for a cup of coffee to share stories or just want to chill and play games\n\nAlways up for text buddies as well, i'd always love to make new friends and acquaintances! I dare say I'm pretty friendly so feel free to hmu anytime :)\n\np.s: am spoken for so platonic friendships only please! my partner and i are also open to meeting other couples/groups of friends to play online/board games with :D",
            "Hiii ! New edition so new post yay! \n\nI’m 22 F Chi local, working full time just grad from sch! I’m here rly to look for new friends (girls and guys), and I want genuine fun ppl that I can hang out with regularly or occasionally when there’s events/outings, and a long term friendship if possible cos ykkk adulting makes maintaining a friendship hard :’) or even finding a new fren that u can rly click with is hard cos everyone has their own circle of frens alr :’) \n\nAnyway I like to go cafe, bar and restaurant hop, gg clubbing (not a big drinker jus enjoy the music, company n vibes), listening to live band music, festivals, gym/working out, travelling overseas (gg to jb for weekend trip etc) & cute dogs ?? Haha I’m also open to do anything else tgt if we hang out, feel free to drop me a pm :) \n\nPS. currently I’m creating a tele grpchat for those peeps who like gg to live band/music bars, and for foodie outings/dates/adventures !! lmk if ure keen to join! 😊",
            "Hi! 28F here 👋 \n\nSome stuff about me: \nI’m currently working near CBD and I’m up for lunch/dinner buddies. \nI’m in HR but I’m keen to explore further on data analytics. \nI like walking around museums and attending events/exhibitions. \nI love trying out weird food/drinks combo (not great for my stomach though!) \nI use to read religiously but I stopped a few years back. Definitely looking to pick it back up! \n\nI’m interested to make new friends. Feel free to reach out to me anytime 😊",
            "Hi everyone! 23M here, and am keen to expand my connections☺️ I’m just looking for people to vibe with, and then we can meet irl once we’re more comfortable🙌🏼\n\nA few things about myself;\nI love art galleries and museums! I like to do cafe hopping sometimes, and I’m trying to learn new languages (would be nice to have a language buddy hehe). I don’t think this is a common hobby, but I like smelling perfumes and assessing base and middle notes too🤩 I’m looking forward to having deep chats with people and not the small casual talk🫱🏼‍🫲🏻 Hope to hear more about you!✨",
            "hi! 19f (this year) some interests: \n\n- gaming: newly bought pc!! looking forward to bg3, bit of valo (though im not good), detroit, coop games eg. lethal company or escape rooms. \n\n- fiction: just finished babel and a little life. not picky with genres. looking for someone that freaks out over books and writes essays of analysis like i do! also read manhwas (pick me up and eleceed are my favs)\n\n- waiting for my materials to arrive to make necklaces and wire wrapping in the future. possibly selling too, if i have a flair for it\n\n- others: learning languages, currently on the korean alphabet and japanese grammer. also learning how to cook. digital artist. alt/rock/indie/pop/mando music. \n\nim down for almost anything that sounds fun (and wont break my bank). a low maintenance friend so we dont need to chat all day every day. but i do love the sort of friendships where we can talk about anything :)",
            "hello, \n24F, married + a baby, currently unemployed :’) \nwould love to interact and make friends as my social circle has been small for a super long time— \n\nother than caring for my LO, hubs and i spend our free time playing bg3 for now, sometimes mhw, and other co-op games or whatever we can play together with his other friend \n\nbesides gaming, some others interests of mine are anime, reading whenever i can, art, basketball, binge-watching american shows that i cant finish and navigating my way as a ftm\n\naaa first time trying this out, hoping to find like-minded peeps!",
            "21F here🍭\nLooking for friends that sings well and likes going KTV. \nI personally like to sing mandopop and JPop, always can't find good singers and end up singing alone\n :( \n\n\n#yoasobi",
            "Hi! 26F :) \n\nCurrently a med student, loves to read romance (such as those of Pablo Neruda and Sylvia Plath), single (not really looking into rs please no no no), loves visiting musuems and galleries, cafe hopping, take nature walks, loves dogs so much! I cant think of anything but hopefully if we vibe via tele chat then we can meet irl! I can also be ur rant dump lol (:\n\nAny age is welcome as long as you are matured. Would also love to make with folks 40s and up!",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "Hello, I'm 29M this year and a Northie and am looking for platonic friendships at the moment. Personally would prefer to chat first before meeting irl.\n\n- I like to try out new places for coffee and desserts! (because I have a sweet tooth haha). I also own an Aeropress and a v60 set-up hence I do brew my own coffee from time to time.  Current favourites include Piccolo by Hei Kim and Nesuto!\n\n- I'm currently into a variety of physical activities such as gymming, climbing, cycling etc and I enjoy all of them for the time being. Tips and advice are greatly welcomed! \n\n- I do listen to quite a wide range of music such as rock, jazz, hip-hop, r&b and I could probably provide some recommendations if you're into these genres :) \n\nI would consider myself to be an ambivert and my friends have described me as a patient, understanding and good listener. If you think that we could vibe, feel free to DM me to talk about anything that interests you or just to chit-chat! \n\nThanks for reading my intro! :)",
            "Hello! 27F looking for board game friends I play light-medium games :) usually at guildhall. Also into drawing zentangles and looking for someone who can teach me how to gym HAHA.",
            "25F, ISTJ. currently working in an econs research-related role and am pretty keen on carving out my career path in research, so would be glad to meet people who also work in similar fields. also trying to self learn R for data manipulation! (regret not learning it in uni but oh wells)\n\ninterests outside of work include: pole & aerial, football, kpop. also like exploring new events/places, checking out restaurants/hawker centres, going for craft workshops, etc etc, generally quite open to activities as long as they dont involve getting super sweaty. i like travelling as well, still a newbie to solo travelling so tips (especially from fellow ladies) are welcome :) also just bought a longboard this year and looking to learn... so yeah lmk if you'd be interested in doing anything tgt!!\n\nETA: speaking of kpop anyone going for nct dream's concert HAHA",
            "Hello! 25M. Loves football, gaming, motorbikes, cars, and whisky. Also looking for exercise buddy in the East. Music tastes are pop punk (it's not a phase mom, it's a lifestyle), indie folk, rock n roll, kpop. Favourite artist is Neck Deep!",
            "23F, newly moved to Singapore from Malaysia, healthcare worker. I don't really know anyone else here aside from a couple friends that I haven't met up with yet and I'm looking to make more! I like karaoke, anime and any kind of fun activities, I just enjoy doing something I suppose. I don't really play games much except for the switch which I am not very good at lmao. I like kpop too so if you like it as well, perhaps we can go to a concert together haha do feel free to reach out to me!",
            "[deleted]",
            "Early 30’s, M. Looking for folks who like to board game as trying to have more regular weekend meet ups with my play group. If you’re familiar with terms like Worker Placement, don’t mind traveling West, and play to have fun, then DM me! (Gender agnostic!)",
            "Reposting here because why not? \n\n28M, unemployed at the moment, so I'm finding a job currently. I'm kinda keen on talking random stuff like my day or some random news so I guess feel free to DM? Returning back to board games and starting to go to the gym so that's something to talk about I guess. I may be busy at times so I tend to reply kinda slowly haha",
            "32M Northeaster here, I enjoy playing video games, reading books, science fiction, manga and watching some anime(I haven't watched any in a while except for jujutsu kaisen).\nPlaying lots of Lethal company recently and looking for more friends to play with.\nAlso getting back into hiking(Macritchie area -> Bukit Timah) and walks.\nCurrently taking my 2B motorcycle license and hoping to go riding in other countries once I get it, too.\n\nI like to visit cafes for coffee and interesting places for food on the weekends\n\nHit me up if you're interested in anything similar!",
            "32M, central.\n\nGoing to be in Singapore for a month to visit family, arriving tomorrow! Born in Singapore but have lived half my life in both Singapore/ UK. Moving back for good from August.\n\nMainly looking for bouldering buddies (I've bouldered for >1yr now and it's super fun!), happy for the company of anyone really, even complete newbies.\n\nAlso if anybody is up for exploring the off-the-beaten track bits of Singapore or trying water sports (wakeboarding looks cool!) then hit me up too!",
            "[deleted]",
            "25m, am going to complete my CS degree soon. In my free time I mostly play single player games on emulators (PPSSPP, Vita3k), MLBB, any shows that interest me, currently watching more Australian shows. Am looking to make friends of similar age and exploring different activities. Open to conversations (:",
            "27M, if anyone is up to watch some performances for Art after dark at Gilman barracks on sat, lmk",
            "Hello , I’m 31M hopefully able to make new frens in here that can share or talk almost anything \n\nHobbies is playing mobile legends and eating n sometime jogging  \n\nCause of my work plus overtime I hardly have any frens",
            "24M looking for people to play palworld with.\n\nAlso interested in trying out boardgames, been starting to go to boardgame events on meetup! If anyone wants to go together can hmu too",
            "M, looking for people to chat with, or possibly hang out with in the future.\n\nI enjoy museums and galleries a lot, tho I haven't been able to find time to visit any local ones recently. My main music genre is kpop, mostly bts and some other solo singers tbh. I love conversations about politics and world issues and can crack a random horrible joke or two when I feel comfortable enough. My current favourite thing to do is attending concerts and I went to 3 in 2023 and hopefully can secure tickets for more this year.",
            "[deleted]",
            "30M, looking to make some friends to chat with just about anything under the sun. I am trying to improve my interpersonal skills as I don’t do well in social situations. \n\nCurrently on a KDRAMA streak (Finishing up Twinkling Watermelon atm, I welcome recommendations), enjoy playing games (Dota 2 turbo enjoyer, J/RPGs, rouglikes). \n\nI play softball on the weekends too.",
            "[deleted]",
            "21M looking for casual bowling/hiking/badminton buddies in the east!",
            "hey 26M here! final year uni student, and hobbies include cooking, sports and traveling.\n\nplanning to start cycling from next week onwards in the east area (e.g. changi, ECP) as a way to unwind and explore singapore.\n\nps i’m only gonna use anywheel cuz i don’t have a bicycle so if you don’t mind, hit me up :)",
            "Hello, 26M here. \n\nI kept posting here but delete as I have a weird obsession of constantly checking if anyone see or reply to my post 😭 (which is very bad). \n\nWas hoping to meet more people here. I enjoy watching movies, filming/vlogging interesting things in singapore or overseas, exploring different places in singapore!\n\nDo DM me and we can talk about anything 😅 (hopefully i won’t delete this post and create again t-t)",
            "Hi 26M here.\n\nReally into mechanical keyboards and resin keycaps. North eastie. Can have mini keyboard meets if anyone interested. Feel free to DM me if you want to talk about keyboards.\n\nAlso playing FPS games casually can hit me up",
            "22M. Would like to make some friends!!\n\nI love to sing and I am a huge mandopop fan (crowd lu,lironghao, alin are my favourite singers) I like english pop music too. I  study vocal singing techniques as well. Would love to sing for a band!\n\nA big phone geek. Love to cook, hike and watch horror movies and play horror games!\n\nDon't like coriander and spring onions haha\n\nLet's talk haha",
            "Any foo fighter fans",
            "For a start.. 35M\n\n\nLooking for fellow Helldivers! \n\n\nMy gaming friends seem to be busier with life as opposed to my self-employed- most of the time waiting for other people to reply- ass.  \n\n\n For democracy! ",
            "[deleted]",
            "any turbo dota players here ?",
            "Hi, \n\n25M  (well 26 at the end of the year 🥲🥲🥲🥲🥲) In uni at the moment. \n \nHobbies revolve mainly around aviation/planes (I do aviation photography/planespotting), taking about them in general. Great to meet fellow avgeeks, hmu if you're interested or want to learn more about them.\n\nI have a thing for astronomy /astrophotography as well, admiring our night skies and stars (even though sg has nth lol), I've always been amazed the night sky, tried to take pictures of the milky way a few times here in sg (yes it's possible to take pictures of it,  given the right conditions, got a super blur pic of it once -never been so happy), always chasing dark and night skies to seek inspiration🌌, hoping to travel to those super dark sky reserves to see the milky way one day! (No money atm to travel 🥲)\n\nApart from that hmm, I guess I do some form of simple landscape and street photography every once in a while? But I've cut down most since I've been p busy with uni and no motivation to go out shoot haha. Maybe ill regain that if I go with people?\n\nAnyways I'm p chill and easy going with stuff so do hmu if any of the above sound like Ur thing 👋🏼",
            "Hi 31M,\n\nOld airport road neighbours.\n\nOK to chat via text and make friends. Waiting for new job to start so in between quite boring. Looking to lose weight so can exercise together.",
            "Hello! Looking for friends to play ML with, message me if you want to play tgt",
            "Hello, 19F here! Extroverted poly student who is having holidays now but quite busy with CCAs and outside commitments\n\nSome are my hobbies are:\n\n• Arts and crafts - I love checking out Taobao and Shopee for trendy craft kits to try out, so I am quite open to challenge myself\n\n• Gaming - HSR, MLBB (trying my best to not stick to chess ver only), Roblox\n\n• Food - Trying to do more cafe hopping\n\n• Listening to music\n\n• Also a big fan of bbt \n\nQuite open-minded, can talk about anything under the sun! Do hit me up 🤙",
            "29M. LF people who ClassPass on any fitness classes. Not exactly fit, stamina usually in beginner classes but just really looking to keep myself healthy. I also boulder occasionally. Hobbies are the common kinds like Netflix, reading webtoon/manhwa, etc. I do want to explore more activities to do though.",
            "23M, looking for someone to spend time with! I have low confidence when it comes to socialising, so i don’t really mix around much, its always the same few groups of friends and we dont meet often bcs of busy schedules so im looking for new friends :)\n\n I basically spend most of my time watching tons of Anime, playing video games and watching random youtube videos… i stopped gg to the gym a few months ago and would love to go again but i hate gg alone :’) \n\nI work freelance in media so i have all the time in the world for y’alls if i choose not to work. Oh! I kinda suck at fashion too, i love to get recs for what to wear if possible :)\n\nLooking forward to talking/texting/meeting you all :)",
            "[deleted]",
            "Looking for friends to go to LANY concert on Sept! Been fan of them since 2018 and wld be great to make friends and sing n laugh tgt!! Hmu if any if yall gg",
            "Hi guyss, Im a 21M this year sadly just got diagnosed with MDD(those who knows knows =<). Just trying to find more new friends that i can call and chat with. I do quite alot of volunteering work we can volunteer tgt if you have the interest just dm me. I love kayaking and rock climbing too. i do play abit of game like ML CODM PUBG if you're interested also. ANDD i love to sing, KTV sessions will be fun with me i guess but my playlist is mostly 90% chinese HAHA. So if ur keen do HMU🫶🏻",
            "Hi, 25M. \n\nLooking to make friends! I’m quite an avid texter🤭 Do dm me if you wish to make friends!\n\nTried making friends in uni but im going to graduate and I still haven’t made any close friends sadly :(\n\nI like to shop, karaoke, kpop and trying new food! Open to exercising too!",
            "[deleted]",
            "Hello! Just posting here, looking for fellow photographers, some of us have a tele group if you're interested in making new photographer friends.  But please do be prepared to share your insta or sometihng. \n\nAlso, looking for ppl who is interested in getting their photos taken casually, on a trade for photos (TFP) basis, because, my nick. :D",
            "heyyy, i am a 23F who has just started working around the CBD recently! seeking people to have casual lunches or dinners with after work in the CBD area or just a casual chit chat online. i also like doing pilates but would like to try out things like boxing!",
            "26M here! I'm looking to expand my social circle. I lean heavily towards artsy stuff, and i enjoy museums, art and design. I sculpt, draw and make silly animal figurines as my personal home business/hobby. Of course, I'm also into games and anime like everyone else my age, and i try to attend all the local anime/artist cons.   \nIn terms of fitness, I work out as often and as hard as i can in calisthenics and running, and wouldn't mind having an after work sports buddy.\n\nAnyone is welcome to DM me, as my workplace and busy schedule really limits how much i get to meet new people, I'd be happy to make new friends here!!",
            "23M in uni right now. Looking for friends to chat about life, self improvement and fitness with. Currently trying to cut and getting serious about calories and nutrition 😁\n\n\nI also play rpg games, like music, play guitar, watch anime, read webtoons/mangas among other hobbies. \n\nFeel free to send a message!  Always down to learn something new too",
            "29M - Looking for buddies to go bouldering on weekends, currently have to go Climba Gym @ Robinson Rd for 3 sessions as a beginner.\n\n  \nBFF gyms in Tampines is fine too (sometimes fine on weekdays after 7pm).\n\nAlso interested in learning scuba diving in a few months, hmu/lmk if anyone is interested too!\n\n  \nHobbies or interests (in order of time spent):  \nCalisthenics (beginner - was obese, now overweight and still cutting on the go!)  \nVinyls  \nWatching movies/shows  \nKaraoke  \nGames (PC or PS5)  \nFood",
            "29M my focus right now is to be more fit. Have been hittinh the gym 4 times a week for 5 months. Slow progress but I really enjoyed it so far. So if you like to go to the gym as well maybe we can go together (usually i go to delta activeSg). \n\nAlso recently I started tinkering with Godot, if you are interested in learning Godot maybe we can learn from each other or just chit chat via discord.\n\nIn my leisure time usually I just watch netflix or play guitar. \n\nFeel free to DM me if you need someone to talk with.",
            "hi, 31M /extrovert /Muslim /football fanatic (i kid, i don’t watch but i play regularly /Loves to talk /gets goosebumps from watching rom-coms <watched she’s out of my league yesterday>\n\nworks in the east but stays in the west.\n\noh, i’d do anything for new conversations.. say hi and let’s start one! ![gif](emote|free_emotes_pack|grin)",
            "31M, recently into switch gaming (mostly pokemon). I also try to live an active lifestyle by going for jogs. Personally I am into tech as that is my profession as well. Looking not just for online friends, but friends that can meet up for conversations etc.",
            "posted this as an actual post but someone commented to put it here!\n\nanyone interested to do a short film/series?\n\ni've been wanting to do a short film/series for a while now, and i'm not very sure how to go about it.\n\ni'm thinking i want my film/series to be queer, touching on love and mental health, and encapsulate the main character's life to be similar to mine.\n\nhowever, i dont have any prior experience with script writing or directing. i have, however, participated in poly kids' films (as the actress, of course, not the people behind the camera nor the director or script writer)\n\nif any queer people or allies would like to join me in making this happen please comment or dm! it's been a dream for FOREVER, however i don't have the funds to hire people or whatever... and that's why i took so long to do anything about it. just kept telling myself it wasn't possible.\n\ni just decided to try and reach out now, see if i have any luck with reaching any singaporeans (or just people in sg) that have the passion and can commit to this :) we can see where it goes!",
            "repost yet again just because.\n\n31M westie archaeology grad here looking to make new friends and expand my social circle! Currently I’m doing some relief teaching at a secondary school. I mostly play video games or watch movies/tv shows and I enjoy visiting aquariums, wildlife parks/zoos, cafes, museums and galleries as well as exploring historical places.\n\nSports-wise, I used to swim, gym, yoga and going for jogs/walks and I’d like to give hiking, paddle sports and cycling a go too! Currently I plan to get back into swimming and maybe gym as well as yoga soon though and I also did some scuba-diving back in uni and poly but I’m on a hiatus from diving now.\n\nDo feel free to PM/DM me or just reply in the comments here!",
            "26 M just graduated, starting work this coming July before that I would like to chill for bit! Living in the west side. Looking for genuine interactions, chitchat, nature walk. Well if you ride a bike we can go on night rides together and chill! Interactions nowadays are just really superficial, hope I can meet someone buddies here🐮I really love noodles, if you are up for noodles hunt drop me a pm🍜🍜",
            "well got time write on ph so:\n\n24m fresh grad from uni suffering from the reality of working 9-6 for the rest of my life. i work in cbd so always down to have a non-expensive lunch there LOL. other than that, i enjoy gymming, occasional running and badminton.  big fan of anime to the point i have several tattoos and i also really enjoy movies and tv shows, could probably go on forever about what i watch. hmu if you wanna watch the haikyu movie (jk)",
            "27M, working in healthcare! Loves running, gymming and exploring outdoors. Would also be keen to watch movies or netflix on off days if any! Drop me a text :)",
            "Hi, 29M, Westie.\n\nEasy-going and chill. We can chat about anything and everything. :)\n\nDoing full-time work and part-time studies. Also coaching basketball at the side. Still, enough time to hangout and maybe have a casual shootaround since I would usually play to exercise anyway.\n\nStill love doing the things we do as teens. Gaming, anime, kpop, cinema movies, drink etc. Love music as well, so karaoke too.\n\nWould be cool to chill with some new buddies. :)",
            "posting again here since my post got removed from another acct for some reason\n\n26M, ISFP  \nHobbies - gaming, sports (climbing, running, badminton)  \nInterests - netflix (kdrama), hiking",
            "Hellooo 27F ISFP here with lots of free time atm, mainly looking to make new friends! (not relationships) Also I'm kinda introverted so I would prefer to chat online first.\n\nI'm pretty much a homebody so my hobbies are indoor-ish:\n\n- Manga/webtoons: I have no preference genre-wise and will read as long as the plot interests me, even if the genre is obscure hehe. Sometimes I get roped into reading the novel versions as well :\")\n\n- PC Games: Really enjoy MMORPGs and co-op games but lack gaming friends to play with :\") I actually like FPS too but I feel too much burden playing with PUGs so I gave up\n\n- Korean Language: Mostly influenced by the webtoons/novels/dramas, not fully committed but on and off learning through random exposure to the language. I hope to someday reach a level where I can understand the series without relying on translations :\")\n\nAnyways, feel free to HMU if you want to chat about the above or anything really!",
            "Hello, 25M ISTJ. Student in uni doing CS looking for people with similar interests.\n\nMy hobbies include:\n\n* Playing games: LoL, valo, monster hunter, any open world survival craft games\n* Sports: table tennis, basketball, volleyball\n* making game prototypes for fun\n* watching zelda lore videos\n* trying new recipes\n\nFeel free to DM or something",
            "Hi, 24M this year. Most of my current circle do not really enjoy electronic music. Looking for friends who enjoy EDM/Techno music to attend events together, especially with the international lineup that is coming to Singapore in June. Do message me if keen and alone :')",
            "Hello! trying this again! 26M living and working in Batam. \n\nLooking for online platonic friends!   \n  \nMy interests mostly involves: \n\n* PC Gaming, currently playing Wuthering Waves, MH: Rise, Apex Legends, Overwatch, Valorant and FFXIV. I tend to do my dailies first in wuwa, and just recently started playing rise. I would also dabble a bit in fps to switch things up. Currently burned out from FFXIV and waiting for Dawntrail to come out before returning. I do have many more games and wouldn't mind trying out new games!\n* PC setup, looking forward to the release of RTX 5000 series and see what 9000 X3D chips will be like! Also the CAMM2 ram looks clean! RDNA4 might be interesting also. :\") decided to go team red and i'm having hotspot issue with it atm.\n* Weightlifting, not very good at it though. :\"() my grip is just horrendous, and my body makes me feel like im a middle aged man.\n\nI do apologize if we lose contact mid ways. ![gif](emote|free_emotes_pack|sob)I tend to burn out quite easily. But i'll try my best to keep things going! recently got someone messaging me from the thread and we have been keeping in contact for a bit and had a few play session in rise! ![gif](emote|free_emotes_pack|grin)hoping to see if I could have a few more! Cheers!",
            "Hello 👋! Im 28M living in the north east but daily commute to the west (?) for work/ studies. Need somebody to help me break out of the home - work routine and get active. Haven't played proper game of sports for a long time but confident my muscle memory wouldn't fail me. Some sports/ activity I did were:\n- football\n- badminton\n- table tennis\n- rock climbing/ bouldering\n- field hockey\n- gym (need a spotting buddy)\n\nAlso a foddie and huge cat lover (prob been to almost all cat cafes in Singapore). If any kind fashionistas here that likes to go shopping, I would need help to refresh my wardrobe as its mostly uniqlo/ dry fit so I can dress my age hahaha",
            "Hello everyone! 31M\n\nLooking for people to talk nonsense with on weekdays (Bored at work)\n\nHobbies: Gymming, Gaming (Mobile and PC), Zoning out\n\nCurrent craze is Baldurs gate 3!",
            "Hi everyone! 32M trying my luck here. Looking for friends to chat with or go out to do whatever you like if you're comfortable meeting me irl.\n\nSuper introvert but I'll talk once I'm comfortable plus I'm a good listener. This post is probably the most I've pushed myself out of my comfort zone. I'm basically a ghost coz I have no social media and I don't have any close friends. So atp I'm rather desperate to have someone that I can just talk to on a daily basis. My job gives me quite a lot of free time plus my lack of commitment to anything actually... means I'm pretty much free most of the time. Prefer small groups or 1-1.\n\nAs for interests... I think I just really need any sort of human interaction even if it's just chilling somewhere to have drinks and a chat. I'm just hoping you guys can show me your hobbies or maybe we can try new things together if you need someone to accompany you (coz I do too haha). I'm quite active so I'm ok with physically exhausting activities. Dm me (please?)",
            "32F here!\n\nLooking to join an accountability group, I'm trying to develop some discipline when it comes to keeping up with guitar prac and fitness goals.\n\nMaybe we can motivate each other or something hahah",
            "fun fact I learnt today: did you know most earl grey tea no longer contains bergamot oil like they used to? it’s mostly flavouring now. the taste is apparently very different!\n\nam in a stable rship, and am posting w the intent to make friends who will actually find time to meet irl within a month of us interacting..\n\nlove learning about people and understanding them as a person, so one could consider me intrusive if they would rather be private (and isn’t forthcoming about being private).\n\nam not one to chase academics\nnor am I one into nails, makeup or fashion\ngossiping for the sake of gossiping is frowned upon\n\nwith finite energy and time, I’d really like to meet someone who would value what I’ve to give / offer as a friend.\n\nplease pardon any resistance I show towards any invite to fitness activities.. it’s a tough hurdle to cross (again) after a long hiatus. don’t let this stop you from trying though.. cos I really do wanna take that step again.\n\n33f and normally free to hang out outside office hours :)\n\nedit: throwaway accounts for whatever reasons let me feel you’ve things to hide and I normally don’t have the desire to respond to.. sorry.",
            "hihi! 27F, been in sg for a little over 2 years now, looking for some chat buddies (altho replies may be intermittent as i try to keep off socmed when i'm working...) keen to learn abt sg work life experiences and how to embrace the grind lol. would also appreciate any recommendations for volunteering opportunities or good places to eat!  bonus for shared interests in kpop (i love nct haha), kdramas (im currently watching queen of tears), music (i love me some good r&b, pop punk and cpop too), and nice nature spots. :)",
            "hi! 24F INFP-T, I love deep/emotional/meaningful conversations and discussions but find it hard to find people who are like that. happy to talk about anything!",
            "22F ENFP here! Just looking for someone to yap and hang out with! Open to meeting new friends! \n\nOn and off gym goer, love cycling for leisure only. Hobbies include beauty, and some geeky stuff (casually playing competitive PC games, TCG) from my husband. \n\nRecently lost my closest friend due to a disagreement and thought of this thread. Hope this goes well!",
            "36F, legal and in between jobs, single + child free, love reading / talking about books, swimming and i’m now getting into tennis (so if anyone wants to play with a crappy beginner who screams every time she hits a ball). I enjoy coffee, white wine, whisky. I would love to join a book club where we sit in a bar, drink and read anything we want and then spend about an hour or so talking about what we read.",
            "[deleted]",
            "Late 30s, F, I love gardening, all things green, plants, I own a small backyard garden at home :) I am also getting into yoga, and would love to meet yoga-goers too! Vacations and exploring new places outside and in Singapore is something I enjoy thoroughly, I'm all about living life to the fullest. \n\nAlso, if anyone is into digital marketing or marketing in general, I would love to chat and discuss our opinions on this sector and the current trends, possibly over a cup of coffee..",
            "[deleted]",
            "Hi, 33F here. \n\nJust an ordinary person with long working hours and a small but stable social circle. I like movies, trying new cuisines, being active, learning new things and getting to know people from different backgrounds and in different walks of life. Think it would be nice to get to know people and get inspired by interesting ideas and experiences out there! \n\nMBTI shoutout: would be particularly keen to meet fellow ENTPs, esp. females :)",
            "Reposting again because the first time I did this I was just randomly typing haha.\n\nAnyways, 26M, looking to expand my social circle and find some texting buddies because most of my friends in my clique are attached or already married and I don't like to disturb them since they're probably busy with their other half, which i totally understand. \n\nI work almost everyday including the weekends because I am trying to save up in the event I intend to do my masters. \n\nOn my free time I either play league or cs (i boost other people's account haha), watch random vids on youtube, go to the gym, or to just catch up on sleep because I tend to sleep very late at night (i have trouble falling asleep). \n\nI think I am very low-maintenance and if you ever need a listening ear or to just chat about anything feel free to hit me up!",
            "27M ENFP westie here!\n\nTrying to get into gym and running more seriously, and also looking for a new sport to try with someone/learn from together (only a casual basketball player)... I used to be quite the workaholic but realised its not good for my soul to be only working!\n\nTrying to broaden my perspectives on life so always down for a chat/texting pal. Also trying to pick up Japanese, learn more about cars and optimize my personal finances. \n\nDM me if you're keen!",
            "25F, working in cbd area, I enjoy visiting jb over the weekend or going around sg to explore food! Drop me some of your food reco would love to go and take a look!",
            "heya! my name’s Kylie and am turning 21 in August. looking to make a few good pals that like me, prefer to talk about anything under the sun, have deep conversations and lighthearted ones as well :)\n\nso here’s a few things about me \n- I love to hike when I can (being in nature is better than strolling aimlessly in the mall)\n- I love to travel when I can as well, would like to explore until my body gives up on me \n- am currently studying Hospitality Management \n- love music (top 1% Spotify listener), genres ranging from indie to jazz\n- love art and make art (some shitty, some decent) \n- love to write letters, postcards and the occasional poetry \n- collect stamps : Philately \n- fold Origami (easy, intermediate ones)\n- read (not super well read since I just started reading again) \n- love stationeries, trinkets and interior design\n- a Christian convert (and no, I won’t talk about it unless you want to. and yes, I’m trying with faith.)\n- INTJ-A (started from INTP-T)\n\nthere’s probably so much more to me, but yeah… just a brief intro :) \nmessage me if keen, it’s okay if we have different interests! life’s all about learning about our varying experiences, hobbies and so on. \n\np.s. have friends that are way older than me (eg. 59 y/o) and I enjoy their company! great wisdom and knowledge from them! won’t mind the age gap unless you come with bad intent.",
            "hi hi 24F this year! hoping to make new friends. my hobbies are mostly reading (biographies, economics, fiction), exploring different places and gaming. down to try out new food and hobbies as well :-)",
            "Hello! 29F \n\nLooking for people that like shopping at Kinokuniya, would love to go together sometime! \nAlso people to text and rant office problems with during work.",
            "23F turning 24 next month! I'm from the west side! :)\n\nMy partner does not like horror movies, so I rarely get the chance to watch horror movies in the cinema. Would love to find a friend who loves to watch horror movies and also go out from time to time to either eat together or do activities together!\n\nI would like to think that communication is needed in every aspect of partnerships and friendships, and if there's something that is bothering you while we are conversing, please do tell me!\n\nI'm on probation for a new job at the moment, and I'll get busier if I'm accepted, so I apologise in advance if my responses are late. :') I don't have friends.. only friendly colleagues around me, which is fine. I don't mind being alone either at times, but once in a while, I would like to have a girl friend or a friend to talk to aside from my boyfriend.  \n\nIn my free time, I like going to the gym and on weekends I play games! I play games like Overwatch 2, Baldurs gate 3, I just started out Destiny 2 and Monster Hunter World. I mostly prefer fps but these games are my so-called \"go-to\" depending on my mood :) \n\nThat is all about me. I don't have much to offer when it comes to hobbies, I don't have the time to explore further, but i would love to in the near future! My boyfriend and I would love to try out DnD with someone. It'd be nice to experience a fantasy game with creativity, but do have patience! Thanks for reading!",
            "35M, ENTJ-A  \nWorking in Tech/Investment Banking CBD area. Free spirited soul looking to expand social circle with people from all walks of life!  \n  \nInterests and Hobbies  \n  \nArt/History Exhibitions  \nMeme addict  \nScribble periodic haiku, appreciate literature and books  \nGym couple of times a week (AF gang)  \nGames (FC24, COD, D4, MK, Gran Turismo, C&C)  \nPetrol Head  \nYUGE movie buff especially those mind benders and horror/thriller  \nMusic (Soul house, Lo-Fi, Nu-Jazz & Boom Bap)  \nDocumentaries, shows & standup comedies (Doctor Who, The Office, Nate Jackson…)",
            "Hi all, 27F here! Would love to meet new people and make new friends! Maybe we could start as texting buddies first?\n\nI don’t have a fixed hobby, I love trying out different stuff. I used to write for a bit, learned different instruments (piano, drums and guqin). I’m trying to get the courage to learn horse riding but the horses scare me a little. I used to read as well but not a wide range (I looove Agatha Christie’s books). Not a super enthusiastic gymmer who count macros and stuff but I do try to gym once a week. I also loved shopping for a while but have since stopped (it comes and goes in waves). \n\nNowadays, whenever my friends and I hang out, we usually sing k, explore new dining places, and play mahjong.\n\nUsed to watch some animes, cdramas, sitcoms (friends is my fav!)\n\nI’d love to meet more girl friends! I’m up to overanalyse situations with you, talk about your latest interest or maybe be accountability buddies.  Hoping I could meet new girl friends in my 20s so hit me up if you’re interested!",
            "hello!🌼 31F, im a regular fleshbag human bean just trying to survive in this capitalist hellscape hahaha. I currently work in data science but did psych in undergrad, almost got scammed into joining academia and thankfully(?) escaped..💀\n\nI love meditation, gardening and collecting foliage plants. I also love alt queer parties, scifi books (dune, tbp, anything china mieville), halftime indie, uk dnb, and going to raves🖤 \n\nim looking for new friends who: \n\n- wanna explore alt fashion, like dropshipping experimental/ gorpc/ hyperfemme clothes from vn streetwear labels, or thrifting at goldenmile\n- are skincare makeup girlies✨ to trade product notes and maybe dressup tgt! \n- like rock climbing. i usually go bff/ bm/ central on weekday nights to boulder :) \n- are bisexual like me, wanna be friends? i came out pretty late at 27 and id love to build my own community :)\n- wanna discuss environmental issues, palestinian rights and how we can perhaps make a better world we know is possible? one with less exploitation?? yep \n\nokay phew what a wall of text. if any of this sounds like you, please dm me!\n\nedit: I'm attached, and sorry I'm only looking for friends in the areas above. Please don't dm me for something else :) Please also don't dm me as a straight guy asking me to bring you to a queer event or intro you to lesbians. It's fucking weird. Just stop.",
            "[deleted]",
            "Late 20s, F. My parents said I should try to make more friends lol.\n\nReading: Enjoy 古代诗词 (唐/宋 especially), 武侠小说. I have not found anyone of a similar age who likes the former. Also enjoyed a few webnovels eg 魔道祖师，诡秘之主.\n\nAlso read pulp fiction short stories in English like Robert E Howard, HP Lovecraft, Clark Ashton Smith. Have read random Warhammer 40k novels since the setting is quite cool - 1st few Horus Heresy books, Eisenhorn series, haven't finished reading Ravenor series. I don't actually play the 40k miniatures though as it's expensive and I'm not into this kind of game. \n\nGames: Mostly single player games of many genres - recent games I like are Palworlds, Warhammer 40k Rogue Trader, FF16. Favourite games of all time - Witcher 2 & 3, Ace Attorney, PoE Deadfire, Persona 4/5, Mass Effect 2. Idk why but lost interest in BG3 after Act 1 which was great.\n\nFood: Eat a lot of hawker food all over Singapore (mainly East + Central area). Also go to Malaysia fairly often to makan (esp JB and surrounding area). Would like to exchange recommendations! Do not really like cafes in SG as many are overpriced.\n\nTravel: I only travel solo but enjoy planning my own itineraries. Travelled free & easy multiple times in Europe and would like to start exploring Japan & China attractions in the near future. I enjoy attractions of cultural / historical significance but usually keep to towns or cities since I don't hike. Would like to exchange recommendations on nice places in Europe / East Asia!\n\nMusic: Mandopop 周传雄 (sadly haven't found anyone who likes him), 王力宏 (like his music, not his character), 五月天，林俊杰\n\nShows: Sometimes watch cdramas, currently watching 神探狄仁杰。Fave shows: 少年包青天 1， 莲花楼，御赐小仵作. Recently watching Chinese history documentaries too eg 河西走廊 is excellent, 楚汉 (2019) is not bad",
            "Hello, 32F INFJ here. My hobbies are video games, watching anime / dramas / movies, reading, jigsaw puzzles and dining out with friends!\n\nCurrently playing a little New World mmo, but looking to get into other games like Palworld, Lost Ark, Hogwarts Legacy, Sekiro. I have a humongous backlog / wishlist to get to!\n\nFor anime, I watch stuff like jujutsu, demon slayer, one piece, boruto, aot, haikyuu, isekai stuff etc. Favorite tv series are big bang theory and brooklyn 99. Sometimes watch kdrama / chinese dramas.\n\nI picked up jigsaw puzzling during covid and usually do 1000 piece puzzles, currently moving on to 3-5k pieces. My goal is to eventually do a gigantic puzzle (\\~ 20k to 40k pieces); though space is a real problem (and also my cat which likes to steal pieces and destroy the puzzle!)\n\nI have a small social battery and being around large groups of people is overwhelming for me. I prefer to meet new friends one on one and can do small groups (<4) when comfortable. Hit me up if you want to try a new place to eat, or sip coffee in a cafe and read in comfortable silence!  \n\n\nEDIT: i alrdy received quite a few messages and sry if i can't reply to everyone! >.<",
            "33F Single\n\nI like dogs but I can't keep one currently, will love to make friends who own dogs living in the east and go for walks at ECP on weekends if there's time. My faves are corgis, daschunds and Samoyed 😆 \n\nWorking as a designer and currently doing social media marketing. Looking to network with people who are in the same line, want to collab or want to potentially start a business/agency together someday. \n\nOther hobbies include watching kdramas, listening to music (prefer fast tracks), walking and exploring. \n\nI like kopi and healthy food, workout and healthy lifestyle. Not too much into the nightlife these days.",
            "Hi all 27F, INFP staying in north east looking to join any interest group and making new friends. \n\nCurrently learning the violin and in the process of taking the Grade 2 exams. 🎻\n\nOther hobbies includes sewing, painting, crocheting/knitting, reading novels and many more! \n\nJust started going gyming (E1) also but membership ending soon :’)\n\nEdit: looking for platonic friendships only! Im already attached! 😂",
            "Hi All, 33M INFP Entrepreneur Westie here. Looking for fellow westies to chill, hang out and mainly to also expand connections.\n\nAm very into all kinds of genre of Music (classical, ballads, edm, etc), enjoys singing / KTV.\n\nI like to read on self improvement, investments, business, general affairs and politics (looking forward to 2024  US elections in Nov). I dont play any computer games :(\n\nAm up to gym together as well.  Feel free to PM me , welcome all ages.",
            "Hellooo 👋 33M living in Central here looking to make more friends with similar interests! Currently working in a tech firm with a fairly stable 9-6 and interests include:\n- Photography (predominantly street, architecutral and abstract styles). Would be keen to do small group photo walks that are focused on such areas of photography!\n- Personal finance topics\n- Gaming. Mainly on the PS5. Recently finished BG3 and started HellDivers 2 so looking for a squad that would accept a newbie! Or a group to start a new BG3 game with on multiplayer\n- Cooking. Always out to try new recipes over the weekend\n\nI'm Malaysian who lived in the UK for more than 10+ years and moved here about 2.5 years ago but work and personal life took a priority so haven't had time to make many friends but am very keen to change that! Always keen to chat about anything under the sun too!",
            "Hello! 21F, uni student studying biz & engin and Eastie here. Honestly haven't had the time to get into hobbies but I'm interested in getting back into some things: learning crochet (or doing DIY stuff), getting back into guitar and singing, playing board games, nature trails, museums and art exhibitions, and learning languages. If you think we could vibe pls dm! :)",
            "Hi reposting again because I have met some nice people on reddit! Thirties M, looking for friends to play baseball together,  we can play catch and practice batting in Tampines or anywhere else as I am willing to travel. \n\nPlease dm me if you are interested in picking up baseball!",
            "Hi! Posting again\n\n25M (turning 26 at the end of the year :'). Currently in uni.\n\nHobbies mainly revolve around photography though no real motivation to go out and shoot these days unless I stumble upon cool places. Very basic photography though haha, mostly into landscape and street photography, with a very basic kit but of course hoping to learn from other photographers and improve my skills too.\n\nI like checking out/exploring new places so it will be amazing if I can combine both!\n\nOther than that if anything I'm more into aviation photography/planespotting these days as Im a huge aviation nerd and it's not v far fetched to find me at the airport taking pics of planes every once in a while haha \nIt's a pretty niche hobby but always been and continue to be passionate about tracking planes and taking pictures of them, some of which I post on Instagram.\n\nApart from photography, Im interested in anything space related/stargazing/astrophotography. I think looking up at the stars and identifying constellations is something I really enjoy. I find looking up at them very peaceful in a way and kinda scary at the same time. But yeah unfortunately it's hard to see them in a place like Singapore 🥲. But managed to take picture of the milky way once in sg!\n\nI don't have a huge friend group because I used to be very selective (ngl I still kinda am and also sort of very introverted) but I'm trying to push myself to meet new people and hopefully learn something new! \n\nI'm pretty chill and open to anything and I dont really have any expectations of any conversations. Being an introvert I'm Perfectly fine and comfortable with silence during F2F conversations without any judgement.  I don't expect the other party to 100% always be on the ball all the time, I value silence myself as well.\n\nBeing an introvert, I have no expectations with any conversations.. I'm perfectly fine and comfortable with silence during F2F conversations without any judgement.  I don't expect the other party to 100% always be on the ball all the time, I value silence myself too.\n\nFeel free to reach out if any of these sound like your thing! Have a great day!",
            "25F, introvert with social anxiety disorder hence i'm quite a homebody - would love to find people to chat with online. Enjoys watching vlogs that are aesthetically appealing :)\n\nEdit: Online only - someone blamed me for not adding this :'(",
            "Reposting, hello again! 28F looking for ways to occupy myself for the upcoming weeks. We can game (plateup, overcooked, dst), talk about shows (recently finished xmen 97 & invincible) or share new music (eng/chi/kr/jp all okay haha). Also want to check out some new food places, would be nice to go with someone if we vibe so that we can share portions haha need to keep up with the dieting. Don't mind checking out interesting events/movies as well. Feel free to dm/comment! (: \n\n(Might be more niche but also looking for recommendations on dlsite voice works for girls, share your favourites with me pls!)",
            "hello! 38F here, living in Toa Payoh. currently taking a career break, while slowly exploring various options and looking for gig work. enjoy hunting for deals, rescuing food, freebies, and basically just trying to be financially independent, retire early, save money. a bit tough because i love travelling to japan for culture and of course food! would like to take long walks to rebuild my fitness. interested in art museums, architecture, poetry, writing, learning new stuff, etc. used to game when i was in my teens, might restart that too lol.",
            "28F that just moved to SG and looking for friends. Central/CBD area (I think). I’m unfortunately horrible at making new friends naturally (aka out in the wild) because most of my time is at work or chilling at home (if gamer girl could be a job, i’d take it) \n\nI’m Chinese by blood and Filipino by citizenship. My mandarin is horrible, my Hokkien passable, my Tagalog impeccable and my English a shape shifting animal of accents that confuse people into thinking i’m either full blown singaporean or american — it really just changes depending on who I’m speaking to lol\n\nI work in an MNC, been here since graduating Uni, but honestly still discovering what I would like to do in life (Ikigai, if you will).\n\nI’m into gaming, specifically MMOs or tactics games (just got into TFT few weeks back and it’s been a pleasantly horrible climb lol). Horrible with FPS and traumatized when I tried to learn Valo so never looked back. \n\nI like to read fiction books, especially ones that make me cry but if you have any book recos throw them my way! \n\nBeen trying to be more active like getting into running lately so open to run buddies too! Been loving running along alexandra park connector or just around marina bay. But my zone 2 running pace is extremely slow lol, the aunties/uncles out-walk me oops (but i’m working on it!) \n\nIf you’re into yoga i love attending yoga classes too. We can be yoga buddies!\n\nEdit: I am purely looking for friendship, already in a committed relationship :)",
            "Hi! I’m 23F doing my masters here. I’m looking to make friends with similar interests so drop a message if you’d like to talk and eventually hang out if we connect well :) I have varied interests so I’m down to discuss anything from sustainability in business to reality shows and trash tv haha I really enjoy watching psychological thrillers and horror (but I am scared of watching it alone though), true crime, urban exploration, comedy, mainstream anime? (v new to this, would love recommendations!). Music wise I’ll listen to anything that sounds good tbh but if I had to narrow down genres it would be pop, hiphop, rap, rnb, phonk etc and my go to artists lately are the weeknd (typical), kali uchis, travis scott and honestly a lot more to pick but yeahh. I really enjoy clubbing, going out to museums, cafe hopping, so if you just wanna dress up all nice and yap over good food with nice ambiance or party, count me in! I’m mostly down to trying anything new as well :)",
            "hello! mid-20s f here, just quit my job recently and taking a break from working.\nhoping to make some friends to hang out with and also looking to try out new activities! \n\nmy interests include but are not limited to:\n\n-sourcing for good deals\n\n-exploring new places\n\n-food\n\n-skincare\n\n-badminton/hiking/swimming\n\n-reading\n\n-karaoke/board games\n\n-movies/dramas\n\n-window shopping\n\nif any of these pique your interest, feel free to dm me! \notherwise we could just chat about life too! :)",
            "33F. Looking for people to connect with. Specifically here for friends. \n\nRecently just starting playing PalWorld. I play switch and PC games. Read a lot (for fun and work). Enjoy true crimes and any interesting documentaries. \n\nUsually go to the gym or yoga as a means of movement in my day.",
            "29F staying around central-west area. Recently moved from Canada, but grew up in Singapore (I'd consider myself a tourist here still haha). I'd like to meet new and local friends (hopefully around my age) and just expand my social circle in general. I'm a designer so I enjoy art and creative things.\r  \n\r  \nI love food and desserts so going to cafes and bakeries would be fun! I'd like to meet friends who can introduce me to places I don't know about Singapore. I do enjoy cooking and baking although haven't had the time to do so since moving here.\r  \n\r  \nI love playing video games, especially looking for anyone that plays FFXIV. My main account is on the NA data center but I'm considering making a JP alt. If you like raiding, then we'll be really good friends. I also play a lot of steam games, and a big fan of survival, fps, pokemon, or cosy games. I also do enjoy boardgames although wouldn't say I am very well versed in them.\r  \n\r  \nI am also a big webtoon reader, and would be down for good recommendations too. I watch some anime/kdrama/and other shows but not as much as reading due to time constraints. It usually helps to have friends to watch with too.\r  \n\r  \nIn terms of being active, I play tennis usually 1-2 times a week. I try to do some running every other day but I'd be interested in investing time in other active hobbies if I have buddies. I'm also trying to get more into dancing, specifically learning k-pop choreographies and would LOVE to meet people who are interested in learning or dancing. I'd consider myself still a beginner so anyone of any level is welcome! As you can tell I'm into listening to k-pop, but I do enjoy video game music, some edm, and j-pop. Generally can listen to any genre, maybe not country though.\r  \n\r  \nI have a dog so would also be great to meet other pet owners who would like to set up playdates. He still hasn't arrived yet but will be soon. If you like cats I have them too.\r  \n\r  \nOkay I'm not gonna ramble on too much but if you share any interests or just wanna connect, feel free to dm me!",
            "Hi all! 30F, am looking for a text buddy to talk about life and etc! i am an infp and i like a cuppa good coffee so will go to random coffee places to chill during weekends last time! but rarely nowadays due to laziness :')\n\nim also playing mlbb (magic chess) because i cant solo level up for ranked :') if anyone wants to adopt a support to their team please lmk \n\nother than that, am down to meet for a meal or drink! but i would prefer if we chat to see if we vibe first before hanging",
            "Hello, 21F INTJ westie here! I'm in my second year of university but I've found it somewhat difficult to make friends in school, especially as I don't stay on campus :\")\n\nI love cats, photography, crafts, and learning languages - I've been learning Spanish for 5.5 years and French for 1.5, and I pretty much exclusively listen to music in these two languages. In my free time I like going out and exploring Singapore.\n\nI've also recently taken an interest in climbing; I've bought the Climb Central multipass but have barely gone because of school so it would be great if someone (preferably around my age) could go with me and keep me accountable haha. I'm also open to cycling or gym buddies!\n\nI enjoy intellectual conversations and am open to talking about random stuff from science fiction to mythology to Pokemon; I'm trying to expand my knowledge on politics and current affairs too! DM me if you would like to chat :)",
            "[deleted]",
            "Hi everyone, 28/M here - am looking for new friends to talk to, foodhunt and try out random activities with e.g ktv, hiking , new hobbies and pop up events! Am open to all as long the events are not too (physically) extreme 🥲",
            "25M here looking for table tennis friends!",
            "29M, Eastie, would love to expand social circles.\n\nInterested in Karaoke, Coffee, Mahjong and most importantly good food.\n\nPS: If anyone is keen to create a telegram group or discord server, do pm me!",
            "Hi all,\n\nM29. if anyone is looking for someone to game (valo / other fps) or to play tennis with, send me a dm.\n\nMet some nice people from previous threads so here's to meeting a few more!",
            "25M expat from Philippines. just arrived last aug 2023, working in tech. Dont really know what to do here except work 😅 Goes to gym everyday. living in bukit batok. Coffee is life!! Just looking for buds 🤞",
            "Hi everyone!\n26M, North-east\n\nI mostly play football (always up for a game!, so do let me know please!) Muay Thai and running (used to run competitively for over a decade but I coach recreationally nowadays)\n\nKeen to learn different perspectives of life from people and definitely want to get advices on adulting too!",
            "Oh a new one, hello all, 28M here,\n\nA little stuck in life and would need to expand my network of friends in order to move forward and am looking to change up my lifestyle to include more than just the home and office.\n\n* Looking to start some sort of hiking type exercise before I go overseas to trek.\n* Would like to plan out friends type trips overseas, recently been to Japan for a self tour of Matsumoto and Izu and would love to go back to Japan every so often for such things.\n* Love to play Co-op/party/Board games, recently been back into Monster Hunter World, Lethal company and Project Zomboid, but playing with friends Palworlds now.\n* Would also love to do physical games and activities but currently am not part of an club or anything, got classpass tho, something i forced myself on to be more active.\n* TV shows, finished Monach and Netflix One piece recently as well, not the anime, a little too much to catch up on. Also quite into Motorsports like F1/F2.\n\nAny of the above or anything you want to get into but don't want to do it alone and need a buddy, hit me up, i am open to such things as well, just PM/DM me, or reply me here, will try to reply all!",
            "M29.. \n\n- Marvel Snap anyone? \n\n- dinner and drinks after work works fine:) \n\n- keen to start a board game group weekly!",
            "30M, central-north?  \nhobbies: video games, no preferences usually ARPGs. Anime/manga. Nature, Animals. Western TV shows.  \nWatching YouTube channels like oversimplified and tierzoo.  \n\nUsed to take two hour long weekend walks while listening to audiobooks. However stopped due to getting too invested in an mmorpg.. but I plan to get back to it.  \n\nI wish to try some new things. Maybe Yoga? Pilates? But I don't know anyone to try it with.  \nI wish to do more stretching since I seat in the office all day for my job.  \nBoard games..? DnD? I do like fantasy\n \n\nI kinda miss the days where it was fun making online friends in games and chatting with them. Sometimes I wonder where are they in life currently.",
            "Late 20s, M, I like all things tech-related, so if you have any tech questions, don't be shy! I really enjoy running, and have been looking to join a running club of sorts... if anyone knows do let me know :) Or if anyone wants to run together!",
            "Hello! 29M. Work in account job. Like to play switch games and watch movies on my free time. Occasionally go hiking or café hopping. Here to make more new friends.",
            "Hello, 31M eastie here. Been working in the tech across various industries for more than 8 years now (software engineer turned data engineer). I'm currently studying for masters in comp science as well. I have two young cats - 4 months and 2.5 months old!  \n \nI enjoy standup comedies like Jimmy Carr, Trevor Noah, Romesh Ranganathan, reading manga, and listening to random genres of music like eurobeat, Kpop (hope to get IU concert tickets!), Japanese, etc. \n\nI just started Witcher 3 recently, and I also play Dota and Palworld with my wife and some other friends during my free time. I like to drink teh tarik and to counterbalance it I have been running and I used to boulder regularly but have been busy with moving to my new place so I haven't gone lately, but would like to go again (still a noob).  \n\nFeel free to DM! :)",
            "24M, will be working in SG as a CIS dealer starting after CNY. Getting used to work and life will come naturally over time but I’m more concerned about finding likeminded people and establishing good friendships 😅\n\nPersonally, I’m a really active person and loves exercising ranging from football, jogging, working out, cycling to rock climbing. My other hobbies include singing, reading and talking and discussing about anything in general at length.\n\nAlso am a social drinker so anyone wants a company after work or on weekends, look no further! Haha nice to meet you all so do pm me!",
            "Hey guys 18M here, currently serving NS. I’m interested mostly in F1, badminton and cycling. Looking for friends to watch F1 with this season. Would be nice to find someone who supports Ferrari or Mercedes. We can oso talk and predict stuff between the races (except 1st place because “if u know u know”) \n\nWould be nice if we could hang out too becos most of my friends are in uni alr and I’m stranded and bored to the extreme 🥱. If I’m really alone I just end up playing pubg or codm or death stranding",
            "Hey guys 20 M here, just finished ns waiting to go  poly .Im interested in running, i like going for runs 10km and so on also  love to watch sports football etc and also like to read books  .Would appreciate if anyone here wants to be my friend ,\n\ni don't have many friends as i have been in sg for only 2 years and also an introvert  .",
            "Hello! 27M here in the west! Looking for friends around my age\\~\n\nI love playing video games on PC! Largely Dota, currently playing Palworld. Big fan of rougelites and RPGs. \n\nHere to make friends to have good conversations about anything in life!",
            "30sM looking for friends to play palworld with. Are there any Singapore servers?",
            "26m (1998) looking for friends to hangout with during the weekends!! Currently enjoy playing hearthstone, league of legends and bought some multiplayer nintendo switch games that i haven't played HAHA. Also enjoy horror movies and manga and watching netflix and youtube. I do enjoy shopping for clothes too and am looking for more hobbies. Please HMU :D",
            "yo!! 20m here who just orded recently and is waiting for uni to start in aug. in the meantime, im looking to travel with someone just to get out of this stressful af country! i just wanna yolo, explore new places and maybe make some new friends along the way. im thinking maybe vietnam or something but im open to any suggestions regardless of duration or distance haha! do hmu!!",
            "hey ya M19 here.Just finished my A levels and I have a lot of time on my hands to get acquainted with some like-minded people here.I’m currently into physical activities like running,hiking and going to the gym,anything that could build up my fitness before i head to NS.I’m also into anime and binge watching,so i’m down to talk about them if we happen to watch similar shows. Have a great day ahead !",
            "[deleted]",
            "[deleted]",
            "hello, m21 turning 22 here! currently in army.\ni love photography, honkai star rail, singing korean songs (karaoke tbh), anime/manga and korean culture! pls hit me up if u want to duet because i love singing duets 🥲🥲🥲",
            "34M visiting Singapore for the weekend. I'd love to hang out with locals! I'm in Chinatown.\n\nI'm into rock climbing, board games, traveling.",
            "Looking for anyone or grp to climb with at fitbloc kent ridge on occasional weekends (once a month; ideally sunday evenings or maybe a weekday evening).\n\nI'm q shit, only bouldered 5-6 times back in end 2022 but stopped in 2023 because of a rotator cuff injury. Happy to find climb w anyone of any age/sex and with at least some bouldering experiences as well (dont mind if u are more experienced, but if u are legit training i may not be of much help :( m23",
            "26M staying west, love food/drink trips, exercising, talking about life and games!\n\nLooking to find some common people to hang out with!\n\nAny Virgin Active Gym members hmu too! ",
            "23m Chinese. I live in Khatib tag me along if you live nearby",
            "30M here, just trying this out! I'm usually a homebody but I do head to the gym on weekend mornings to work out sometimes. I jog/cycle occasionally (short rides of \\~20km as I'm using just a foldie at the central-west area), as well as swim occasionally. I used to play games but my friends grew out of playing games, hence I stopped, but I'm open to casual games. Do DM me if you have similar interests :)",
            "4 D&D Newbies 20s-30s all M. Looking for DM for a long campaign.  \n\n\nHi everyone. Im usually a reader never an OP. So forgive me if I don't make sense 🥲\r  \n\r  \nThere's four of us, 25yo - 32yo and all men\r  \nWe have played a one short together with a DM that was one of our friend. However due to work commitments it remained as a one short.\r  \n\r  \nWe're pretty new. Some of us watches D&D campaigns religiously but never really played. Most of us play BD3. For me personally I broke my D&D virginity with that one short and really fell in love with the game.\r  \n\r  \nWe mostly live in the north east/central. And uses my home for hang outs/games. So if any DM is worried about space. I gotcha.\r  \n\r  \nIf any DM is interested. Feel free to DM me. I'll be happy to answer any questions here.",
            "Hey, 30M traveller from Canada/Germany here. I'm staying in Singapore for about a week (near Little India) then cycling north across Malaysia.\n\nI'll be covering the usual tourist stuff, but I'd love to explore a bit deeper, linger in cafés, go for live music, cycle or walk all over the place. Since I travel solo I usually have dinner with a book, but I'd prefer good company. Hit me up if you want to do any of those things :)\n\nInterests include: cycling, walking, cooking, bookstores, art museums, sketching, people watching, history, computer stuff etc.",
            "👋 24M, westie here.\n\nCurrently in uni pursuing mechanical engineering. 🪛 ⚙️ \n\n\nCurrent hobbies and interests: \nGym 🏋️\nRunning 🏃\nCycling 🚲\nKdrama (난 예쁜 누나가 좋아, I watched 70++ kdrama already, feel free to ask me for recommendations or gimme recommendations haha)\nDocumentaries about random things haha\nSneakers (currently kept a small collection only)\n\n\nPast interests and hobbies (mainly due to change in lifestyle and covid):\nFootball ⚽\nBasketball 🏀\nWaffle ice cream 🧇 🍦 (man I have to admit I was a sucker for it, probably one of the main reasons I ballooned before NS lol)\n\nI'm open to anything tbh, and if you don't mind lemme entertain you with my lame sense of humour plsssss\n\n*PS I'm planning to go IU concert in Apr, haven't pick the date yet. Is there anyone else planning to go too?",
            "[deleted]",
            "Hello all, 28M here. Looking for people interested in going for some exhibitions at the ArtScience Museum!\n\nNew Eden: Science Fiction Mythologies Transformed\nhttp://www.marinabaysands.com/content/singapore/marinabaysands/en/main/index/museum/exhibitions/new-eden.html\n\nMars: The Red Mirror\nhttp://www.marinabaysands.com/content/singapore/marinabaysands/en/main/index/museum/exhibitions/mars.html\n\nAm also down if anyone is looking for movie buddies!",
            "Hi all, 31M here looking for ppl wif interest in dance. Can meet up in open classes.\n\n\\-Started dancing towards the end of 2022 in SIM and now finished studying, currently working FT. Trying to get rid of my bad habits in learning choreo so any studio is fine by me. Usually would go open choreo or hiphop classes.\n\nIf interested HMU!",
            "Hello! 29M here who has quite a number of hobbies. \n- Surfskating\n- Guitar\n- Drums\n- Calisthenics \n\nActivities I am doing now or casually but not considered hobbies\n- Running/jogging\n- Bouldering\n- Language learning\n- learning motorbike (might just turn into a hobby)\n\nActivities I would like to try:\n- Wakeboard/wakesurf\n- Baking \n- Dancing\n- Forming a mini band to just chill and jam\n\nDo let me know if you are interested in doing something together!",
            "30/M, working in a bank around CBD, enjoy hikes, working out, indie/house, and also have got a spare ticket for Bruno Mars - happy to connect!",
            "27M. Looking for friends who enjoy running on trails. Would love to chat if u are joining Cultra 2024",
            "[deleted]",
            "Hi! 26M here looking for football kakis. Been playing with 2 Sunday league teams at the moment but hope to join a team that plays on weekdays / Saturday.",
            "Hello, I’m 26F, graduated a couple years back and working full time currently with a semi-flexible work schedule (which means I’m down for the occasional workout class in the middle of the day/to grab a bite/coffee!). \n\nI’ve tried a couple of things and enjoy picking up new skills or learning something about everyone else’s hobbies even though I’m very mediocre at everything. Some of the things I like/have experimented with: \n\n1. Cooking\n2. Trying new yoga/pilates classes - also down for any strength training related ones!  \n3. Hitting the gym \n4. Board games (I have a few if there’s a big enough group that wants to play) \n5. Coffee - not a connoisseur, I just enjoy coffee, very keen to explore different cafes and coffee beans\n\nLooking for friends to try out new activities with, some of the things I’m looking forward to this year would be to sign up for a 6-8 week pottery course, maybe start dabbling in photography/filming, and finally losing the 5kg I told myself I would shed last year 😂🥲",
            "28M, mostly homebody, introverted INFJ  \nI watches anime and play video games like your typical Singaporean men, I have a decent collection of board games, I used to play them pretty often with a friend group, but group size has dwindled to just me now :/ have thoughts of trying out D&D but it seems like a daunting experience so it's on hold, but would love to try if there's another like minded individual :)\n\nI also do a bit of badminton (MB level) on weekends, and listens to mainly kpop, pop punk rock, ballad and instrumental, I am also into kdrama and I usually watch them while commuting to work(trying to get TOPIK L3 by end of year lol), is into tattoos and cats, used to do some reading but has since stopped due to priorities/other interests in life. COYI West Ham fan! I also bought a mirrorless camera on impulse years back, took some \"decent\" pictures and kept it in my dry box ever since heh oops, would be nice to be able to pick it back up.\n\nIf you are still here, thanks for taking the time to read, have a good day :)  \nP.S would appreciate a chat with a quick intro if possible!\n\nalso, anyone going to Eras Tour on the 7th and has no one else to go with? pm me if you wanna go together!  \n(also going for Boys Like Girls and All Time Low's concert hmu if you're interested to go with!)",
            "Hello! 20M this year, looking for some friends to hang out with and play warframe with (In a clan already so I won't be joining any but free to play and farm with), I'm very introverted and I don't talk much but I will slowly open up if the vibe is right you know\n\nEdit: Dm me if you wanna play and hang out :)",
            "[deleted]",
            "Hi 31M here,\n\nI'm currently waiting for a my new job to start in a week time. Im an ISFP but I'm very open minded and chat with all kinds of topics (unless I'm not sure what is it).\n\nLooking to know people that are genuine and start off as a chatting buddy. Perhaps able to meet up one day.\n\nMy gf are busy working and most of the time I'm quite free and bored.\n\nI have past experience with ecommerce and digital marketing perhaps if you are interested in this topic we can chat about it. Or anything else also can! Lately wants to get into good body shape as well!",
            "22M. Foreigner new to Singapore and staying for a while! Looking for fun people to go rollerblade in the evenings or simply explore the city on the weekends. Would also like to meet some fellow fashion bros lol. My place is a shoebox, so invite me over to play Mario Kart please",
            "M 21 this year..\nGoing to NTU soon. Looking for gym buddies/friends to hang out with. I live in the AMK bishan area. I can teach you how to gym if you're new to it and scared to start. We've all been there. Other than that, I play football sometimes and any NTU peeps hmu too. Wanna talk too",
            "32M, interested in video games, coffee and working out. I know a little bit of many things so I can chat about almost anything.\n\nI'd like to think I can hold a fun conversation so if anyone wants to chat, please ping me.",
            "[deleted]",
            "25M. I like running, trekking and somehow swimming. Idk what to share most but I speak Korean as I did my undergrads in Korea😮‍💨\n\nLooking for friends to hangout or chat when bored. Hmu if u are interested 🏃‍♂️🏃‍♂️🏃‍♂️",
            "27M, looking for text/game buddies. Main interests include gaming (cozy/gachas), dancing, climbing and programming. Down the niji/holo rabbit hole, but also support other Indies as well.\n\nWill try my best to keep the convo, but forgive my shyness/bad timing when talking to strangers",
            "\n\nHi everyone! 29M here introvert living in the north and looking for a text buddy to chat with.\n\n\n\nI watch anime, and some of my favorites are One Piece, Demon Slayer, and My Hero Academia. I'm currently watching Solo Leveling, Soul Land 2, and Battle Through the Heavens. I also watch some Korean dramas on Netflix sometimes.\n\n\n\nI exercise 2-3 times a week, trying to cut down on fat and improve my overall fitness. I'm still a beginner, and my stamina isn't very good yet. Hopefully, by the end of the year, I'll be fit enough to pass the IPPT.\n\n\n\nAs for games, I'm currently playing MapleStory (GMS EU Reboot). I play solo and focus on progression. My main character is a Bowmaster, and I'm currently level 274. My current progression allows me to kill up to Hard Verus Hilla.",
            "Hihi 29M here, i like badminton, cycling, casual gym workouts, exploring food places, walks and going to events. im also interested in concerts/movies. i also play my ps5 from time to time when im not working :-). hmu if interested to go find food places/exercise/game tgt!",
            "28M. introverted, stays in the east\n\nAny senpai here can train me in calisthenics? As in can do handstand push up or Planche. I only can do basic muscle-ups now. Next goal would be one arm pull ups.\n\nThat aside, i like to keep myself active so always down to try out any physical activity. I am also a casual gym goer. Builds custom mechanical keyboards sometimes. Plays lots dota turbo at night. Recently picked up cycling. Builds model kits like gunpla/ironman occasionally.\n\nI don't like coffee as it doesn't work :/\n\nThe boring stuff > plays games (non-fps), watches anime and netflix, I mean who doesn't, we're all redditors hahaha.",
            "Hi, 26M, fresh grad. I’m here to look for badminton kaki’s (intermediate level-ish), can be one-on-one or group setting! I used to be sporty, but now am turning into a fatty HAHA, thus, I’m looking to get back into the sport! \n\nI’m open to meeting new people as well as making new and lasting friendships. I’m also looking to try new activities (can be whatever). Just get me out of the house lol! \n\nI also play pubgm and brawl stars, if you’re into mobile gaming. Other interests include people watching, classical music (more of the concert band type, I play the clarinet), cycling, and hiking. \n\nMy DM’s are open if you’re interested! Peace.",
            "22M. Studying in uni currently, looking for coding buddies to teach me how to start coding. Am interested in gymming as well. Feel free to hmu!",
            "34F here, gay and partnered. I operate online mostly and don't really go outdoors. Would love to make friends to play or discuss non-comp video games (PC) with. I play diablo4 and deep rock galactic, but also a lot of base-building/roguelite stuff. Would love a semi-regular group to play more multiplayer non-competive games with. \n\nI can't talk about everything under the sun but I can be a good listening ear. I may take some time to warm up to 1 on 1 conversations tho, somewhat better with group chat settings. \n\nSo if you're looking for another fellow aging adult with only 1-2 hours to spare after work to play something casual then cry about backache, hmu in my dms\\~",
            "hii i’m a 20M who is studying in poly. looking for friends/text buddies :D\n\nmy interest/hobbies manga, video games (i play a wide variety) and watching TV shows/anime (fav is house n the office n jjk)",
            "helloes, btw - any swifties here? I realized overseas they have listening parties for TTPD which is out on 19th April.\n\nwould anyone be keen to have like a mini listening party for TTPD? \n\nhehe",
            "[deleted]",
            "Hi I'm 23M, my hobbies are mainly working out, calisthenics and running. I also enjoy playing chess, basketball and table tennis, pool and singing KTV. I like reading and learning about self-improvement as well.\n\nJust hope to expand my social network and make new friends in general",
            "Heya! 40M, looking to make friends and have chill chats with. Also looking for buddies for evening jog/walks at AMK-Bishan park. I'm trying to get more exercise in and change my sedentary office-home-repeat lifestyle. \n\nInterested in self-improvement, React/Vue full-stack web dev, gaming, anime, kdrama, and open to new hobbies. Please DM me anytime.",
            "I am 29M, I just returned to Singapore and just started a new job this week as an IT Manager. \n\nPreviously I was working in Vietnam and Cambodia for the past 7+ years. I drifted from my old group of friends being away for so long and I am looking to make new connections as I get back to life in SG. \n\nAdditional languages I speak are Japanese, Vietnamese, Khmer and ofc English/Chinese due to my long time abroad. I also have background in web development, IT project management, basically anything IT related. So I can give advice if there is anything that I can help with.\n\n  \nI enjoy going out and having a few drinks and talking about life and goals that kinda thing.  And also open to new experiences since life in SG is pretty dull ngl. DM me if anybody is keen to hang out!",
            "35M here. ENTP.\n\nI do Lindy Hop swing partner dance regularly, and practise Parkour less regularly. Generally interested in personal development, improv theatre, stand-up comedy, movies, entrepreneurship, and non-fiction books (social sciences, history, psychology, self-help). These days I've been trying to cultivate the habit of sleeping early, and reading and writing often.\n\nI also enjoy deep conversations about life.\n\nOpen to board games, explore nature/city, museum trips, and seeing artsy things. I live in the north.",
            "hi im 21M\n\nlive in the west side, simple hobbies like gaming, anime and reading manga, currently in NS so might not always be on. looking to find friends to talk to or even play games with !! dont be shy to hmu if you wanna get to know each other better !!",
            "29M Going to work in SG soon maybe this coming June, still in the midst of waiting my working pass to be approved\n\nLooking for a chat buddies who can share me guidelines/information about SG",
            "Hello All, 28M here,\n\nPreviously once posted here before, thought i would just update and see how it goes, now just a person little stuck in life and would need to expand my network of friends in order to move forward and am looking to change up my lifestyle to include more than just the home and office. Work having a slight lull now, so i am able to chat more often.\n\n* Love to go overseas for activities, just came back from a Diving liveaboard trip.\n* Looking for a partner to go to Japan with friends with in a year or two time (to avoid 3rd/5th wheeling)\n* Love to play Co-op/party/Board/Video games, Recently gotten back into games like Total war, Project zomboid, Persona 3 Reload, WOT. Looking for a group to adopt a returning sprout in FF XIV as well, just a sudden urge to play Final Fantasy for some reason after going to Doujinma.\n* Looking for a group to go Karting with, have no idea where to go for such things in Singapore/Johor (I want to race, not just Free practice)\n* TV shows, finished Shogun recently as well, just caught Godzilla -1 which i should have done last year. Also quite into Motorsports like F1/F2.\n* Into PC Building and like to help out with PC builds for free\\*\n\nAny of the above or anything you want to get into but don't want to do it alone and need a buddy, hit me up, i am open to such things as well, just PM/DM me, or reply me here, will try to reply all!\n\nNote: For Physical activities i probably have to pause for a month, going for iLasik this month, PM me if interested in knowing what happens, i am both looking forward and not looking forward to the operation.",
            "Hi there, 29m here looking for friends to hang out with, a daily chat buddy or a gaming buddy. About me I'm mostly a homebody who likes to game on his PC, games revolve around dota 2, path of exile or the occasional RPGs/strategy game that's coming out.\n\nI'm also a pretty chill guy who's open to talk about anything and everything though please don't push things too far as everyone has their own boundaries.\n\nAside from gaming, I'm trying to get into gunpla and start building and collecting again and that rabbit hole is gonna hurt my wallet so much. I used to have a few of them but they were thrown away (rip money).\n\nLastly even if you don't have the same hobbies as me and would like to just chat about anything and everything under the weather I'm open to that too.",
            "Hey everyone,\n\nWe're a pair of twenty year old who recently decided to start playing badminton. We're beginners and just want to play for fun, not competitively. We’re both 20 years old and are looking for people of any gender, between the ages of 18-24, to join us.\n\nIf you're interested, please drop me a DM, and I'll add you to a group chat. We can discuss the location and other details there. Looking forward to hearing from you!\n\nCheers!",
            "Hi everyone, 30M looking for chat buddies. ENTJ. Loves fashion, kpop, dogs, cooking, drama, kaypoh stuff and funny memes and trends on tiktok.",
            "M20 looking for gym buddies near west side",
            "Hi there\n\n33M living in the north east\n\ninterest in food and cars\n\nLikes to go jb or food hunting.\nOcassionally enjoys some small drinks/singing at pubs. Cant really sing but dare to sing tho. 🤣\n\n 志同道合的朋友请私信我😄",
            "23M Turning 24 this year, and Currently Studying PT degree while finding work, I NEETED for 10 months after being terminated from my contract job and had other family/friends/personal issues that happened on top of all of this.  Nonetheless, I am hoping to find ppl who are in a similar life stage and have similar hobbies. My hobbies include:\n\n-play basketball (Very short tho i am only 167cm) \\*Used to be very passionate about basketball as it is something that I can confide in , used to think I could go pro as I was extremely delusional back then.\n\n-Watching NBA though I am trying to cut back on watching it due to personal reasons\n\n-calisthenics\n\n-gymming\n\n-watching any anime/show that is mainstream popular\n\n-playing lol, valorant ,Elden Ring or any game tbh\n\n-long walks at night or morning\n\n-Discussing conspiracy thoeries ( just for fun)\n\n-watching YouTubers such as moistcritikal / cold ones/ h3 podcast\n\n-shopping for clothes or shoes (Would like to get into thrifting but idk how )\n\n-Interested in going out more due to my previous lifestyle being a shut-in\n\n-Interested in  South East Asian History and Eugenics\n\n-Would like to have a buddy to try new restaurants / activities\n\n-Watching stand up comedies ( Dave Chappelle)\n\n-Interested in having a self improvement journey with a friend\n\n-Passionate in watching movies and critiquing it afterwards ( Mad Max Furiosa was so good)",
            "[deleted]",
            "Hi! 29m westie looking to expand my social circle!\n\nInterests include: Running/ outdoor activities, pottery, mj, exploring new places in sg, getting drinks/coffee,  workouts/yoga\n\nAlso open to trying new hobbies!!\n\nhmu if you are interested in hanging! would love to have a running buddy to explore new routes tgt :)",
            "[deleted]",
            "hi!! 21M ENFJ eastie here, currently studying in poly and looking to expand my social circle!!\n\nmy interest includes: playing pc games( i play on both pc and PS5(games i play now are mainly Destiny 2 & Escape From Tarkov), listening to music (EDM,Uk Rap, Rap), going to concerts, running/jogging, watching football(EURO 2024 about to start) and F1.\n\nI also enjoy bar hopping and going out a lot…\n\nif you are interested , do dm me :)!!",
            "Hey guys, 20M uni student here (eastie), ENTJ-T. I've grown up in different countries with different ppl, so can mix with almost anybody easily.\n\nI'm looking for ppl to talk/hang out with about anything, cycle or anything. I love a cycling, punk/rock/alt/pop music (looking for ppl to go to parties of this genre), a few sports, making ppl laugh, talk about cool stuff. I also can sing & play the piano (maybe invite me for KTV cz never have been). Cat cafes are one of the best.\n\nHit me up even if u don't match with any of my hobbies :)\n\nEdit: pls don't judge my username lol",
            "26M local northie working as a uiux designer looking for friends or a friend group to adopt me ._. Unfortunately as an introvert, I like doing at home stuff such as watching Netflix and playing video games. Been really interested in interior decorating recently as well. \n\nI am free the entirety of next week as i changed company and had an awkward starting date so I’m free to meet during the weekdays. I own a switch so maybe we can play games together if you’re introverted as well :B HMU!!\n\nEdit: currently in a telegram group for making friends. pm me to join! :)",
            "Hi again! Had some really good experiences the last time I posted. \n\nAbout me: 28M, Intj. I really enjoy getting to know people and having deeper, genuine conversations. \n\nWorking in CBD, so open to lunch jios if we get along! I wind down by working out at the gym, reading (currently on When Breath becomes Air), documentaries and podcasts! \n\nBeen going on different park trails and food hunts lately for the best Mexican taco. Hmu if you know any? \n\nEnjoy new cultures, cuisines and experiences and I'm traveling to Africa soon! If you've been I'd love to hear your travel story. \n\nLastly, I'm still playing some games when I get the time and very open to trying new games. \n\nOpen to chats about anything from FIRE to the meaning of life. Let's connect if you're open to it! 😊",
            "36M, moved to Singapore recently, looking for new friends to hangout and chat. Live in the west and work at the University now.",
            "35M, east coast, moved here one year ago. let me know if you want to:\n\n*  go cycling road, mountain and/or BMX\n* talk music, keyboards, synthesizers and all that stuff",
            "reposting this but anyway\n\nhello! im 20M here, currently in ns and just kinda bored looking for chitchat buddies i guess?\n\ni like to run, bake, watching sunsets! i listen to eng/chi/kpop(mainly kpop n chi) and im down for anything!\n\ni would love to hear ur day to day stories or any random topic that u wanna chat about\n\nwould like to know more about sg Universities too if possible from anyone!\n\nhave a nice day :)",
            "[deleted]",
            "[deleted]",
            "20M, going to NUS this year as a biz student, I’m into quite a few things, cooking, muay thai and jiujitsu (havent trained in awhile unfortunately), pool, watches, chess and ofc dm learning abt some new hobbies too. Looking for longer term friends if things go well, DM me!",
            "Repost:\n\nHey guys, 20M uni student here (eastie), ENTJ-T. I've grown up in different countries with different ppl, so can mix with almost anybody easily.\n\nI'm looking for ppl to talk/hang out with about anything, cycle or anything. I love a cycling, punk/rock/alt/pop music (looking for ppl to go to parties of this genre), a few sports, making ppl laugh, talk about cool stuff. I also can sing & play the piano (maybe invite me for KTV cz never have been). Cat cafes are one of the best.\n\nHit me up even if u don't match with any of my hobbies :)",
            "(Posting again since I got to know a few awesome peeps in my last post and after returning to Reddit from a hiatus :) )\n\nHi everyone! Local 27M here. \n\nCurrently doing part-time graduate school at NUS while working full time as a budding researcher and looking to expand my social network! \n\nMy interests:\n\n- Cycling/Hikes/Running/Exploring remote places of Singapore (Actively looking to find groups for these)\n\n- Gym and workout (I often do more bodyweight exercises in the gym than weights hahaha since I just gotten interested in calisthenics recently. But feel free to hit me up if you need a gym buddy) \n\n- Hit me up if you are a avid fan of board games (I visit board game cafes sometimes, so hmu and we can visit cafes tgt.) \n\n- Mobile gaming (Originally a League PC player hahaha but switched to Wild Rift, its mobile version of League as I'm too busy lol; HMU if you play WR too!) \n\n- Food Hunting (Exploring hidden places of SG for good food) \n\n- Anime (Watched mostly all sorts of genres so long as the story plot keeps me on the edge. Recently started watching Chinese Anime or donghua like Link Click XD) \n\n- Netflix/Watching scientific documentaries/Discuss sciency topics such as Big Bang/Time Travel and paradoxes/How the Universe will end etc./Reading science fiction (e.g. Three Body Problem series) \n\n- Volunteering in my church! \n\nDo drop a message if you wanna hang out or chat just about anything. I'm an avid listener and love hearing about your stories and sharing mine. \n\n I work in One-North, so feel free to hmu for lunch/dinner in One-North/Kent Ridge/Buona Vista if you work around here too. Am always glad to know people from other industries/fields!",
            "30F, posting here again as I was busy for a while and some of the chats have gotten too far for me to reply :') i have found a job! and just coming here to find people to talk with since working life makes us lose a bit of our social connection :')\n\ni like anime and currently am watching solo levelling as well as catching up with avatar due to the live action series.\n\njust hoping to be here to find if there is any groups to join! i occasionally bar hop and like a pint of blanc to wind down for the weekends :)\n\nfeel free to hmu if you want a buddy to talk to during work!",
            "Hello! I'm 25F, I stayed in France (Parisian region) and New York for a couple of years and just moved back to Singapore, looking to make new friends (both local and expats) to hang out with on the weekends and after work! I'm ok with texting buddies as well.\n\n* I speak French fluently and Chinese passably well, I really love these two cultures and am looking for other francophones and native Chinese speakers to talk to.\n* I really love going to museums (it was my main hobby overseas since I had access to them for free), as I like learning about cultural heritages and also like the social aspect of doing said learning in a museum. The next museums on my bucket lists are the Peranakan museum and the ACM (couldn't really appreciate it as a primary school kid).\n* I like non-fiction books - I find it difficult to commit to finishing one, I tend to go to the bookstore and just pick the chapters that I'm interested in. Currently thumbing through LKY's memoirs (1965 onwards)\n* in the day I work in the STEM field and I also am inclined towards science and math. I find these disciplines intellectually stimulating but in my free time I tend to think more about the nature of human existence and also how to live a good life (in the Plato sense).\n\nIf anything in this posts resonates with you, hmu! You don't have to have the same interests as me, I'm open to exploring new ideas and hobbies :)",
            "[deleted]",
            "hello everyone, 30F, INFJ. Looking for new friends. \n\nCurrently doing an online course to upskill since the job market is quite bad. During my free time, I read non fiction books or watch anime/dramas. I am into thriller, comedy and fantasy shows. \n\nI will be flying off to Korea in this coming October. Do feel free to share tips or lobangs especially skincare if you know one in Korea. \n\nAlso a diehard fan of The Paper Bunny. Anybody can relate to the craziness of TPB merchandise? \n\nI jog at the park two or three times a week. Because I love basking in nature. Do jio me out for hiking too. \n\nThank you for reading my intro. Cheers!",
            "Hello! Posting again because I have successfully made a couple of good friends from this thread!\n\n31 / F / Eastie here. Looking for PLATONIC friendships only!\n\nInterests\n- Jogging / trail walks / hiking.\n- trying out new food places (cafe/hawker) but at the same time trying to cut down on portions because 老了#health\n- Self-improvement. Have been listening to audiobooks. Please do let me know if you have any good books to recommend! Would really appreciate it! ☺️\n\nWould love to chat first and see if we could vibe! Kindly note I do not respond fast especially on weekdays because of work. Would love to have an exercise buddy to improve fitness levels and perhaps lose a few kg!\n\nI.e., jogging at central / kallang > MBS / OTH. Or even do virtual workouts together while streaming the vids from youtube. :)",
            "Hello there! 30F here, looking for new friends to climb with (I do top rope and auto-belay at CC, BFF, and Ground Up). Progress has plateaued but am still enjoying the climb and just hope to make slow and steady progress!\n\nSome other things I do/love: workouts at BFT every morning before work (hey, I start the day working on myself before I work for others!), watching movies at The Projector, catching a theatre performance, finding my next favourite coffee stop, and watching videos that touch on countries and culture. Would love to connect with people from all walks of life so hit me up!",
            "35F here looking for friends to chit chat, hang out, play games with",
            "Reposting! \n\n31F who’s pretty introverted irl. \n\nI love football, particularly the EPL! I’m a Muslim but not religious, although I do follow some dietary restrictions. Currently on a Netflix binge and down for any recommendations in music, shows or movies. \n\nJust looking for people to chat about anything and everything!",
            "[removed]",
            "helloo! 25F, north east\n\nlooking for people who would be interested to play badminton casually, go cycling or walk dogs together!\n\ni'm a writer and i love binge watching different series so if you're looking for a friend to chat about shows you can hmu too!",
            "Mid-40F I like fountain pens, dogs, cats, reading, writing. A real estate agent and investor by day, play CODM or Nintendo switch, fiction Writer, occasional Toastmaster by night, coffee and matcha aficionado. \n\nMusic: I listen to Kpop (ballads, hip-hop), but also to Yoasobi, classical - preference for piano, violin and cello.\n\nBooks genre for reading is very varied from mystery, sci-fi, fantasy, non-fiction too.\nIntention to read 100 books in 2024\n\nI am ok for guys or gals who want to go cafe hopping, playing CODM and or board games.",
            "31 m German looking for people to go out on a hike or beach or whatever other outdoor activity there is :) a beer out might as well count. Just very recently moved to Singapore and will live in braddel soon. Hit me up !\n\nTv shows: the office , better call Saul , breaking bad\n\nMusic: kid kudi, kalkbrenner open for many things\n\nInterest. sports activities, diving, hiking , mountain biking, occasional gaming, photography , tennis haven’t played for a while now but would love to get back to it",
            "Hello! 24F here, one of my main goals in life is my username I live to eat 🤣 a foodie haha 😆 one of the things I like to do as a foodie is sharing pictures of what I eat and hopefully the audience gets hungry/craves for it 😗\nMy other interests/hobby are:\n- Singing/ktv\n- BL/Danmei novels/donghua/dramas \n- T-Pop (e.g. Jeff Satur), thai shows and idols\n- C-pop (e.g. 刘宇宁)\n- Pop (e.g. Ariana Grande) \n- Occasionally draws (hoping to learn digital art) \n- Paranormal \n- Role-playing/life-simulation games (like Sims, harvest moon/story of seasons)",
            "Hello~ 24F, looking for friends that dance & also likes to occasionally draw or paint :) also a gym goer in AF \nI also like to cafe hop or eat at new places so if you’re a foodie hmu! :)",
            "hello, 21F! still struggling to find friends in uni + my friends outside of uni all have diff schedules so it is difficult to meetup very often, hence looking to expand my social circle and build long-term fs! :\")\n\ni'm a huge introvert but i can get p loud in small groups/ once i get to know u better! i would say i am quite adventurous: \ni love cafe hopping, arts and crafts (tried crochet, embroidery but would love to try pottery/clay, tufting and more!), visiting museums/exhibitions, watching kdramas/thai dramas and just exploring SG in general...i would honestly be down for anything under the sun :) \nam also looking to start getting more active this year (yoga, climbing, hikes, strolls etc)\n\nEdit: not heavy on fitness btw, just light activities like the above and dm only if u hv similar interests/ of similar age thank you :”)",
            "[deleted]",
            "23F, would love to make new friends ! \n\nInto: Anime, gaming, drawing, arts and crafts, watching shows, badminton, a little cosplay, but am open to anything else too.\n\nLove cats so cat cafes is a go to too haha",
            "Hello friends, 39M in corporate communications. I am planning for a hike at MacRitchie Reservoir Park, 2 March at 9am followed by lunch at Upper Thomson. Anyone interested can leave comments here",
            "Hello 24F here, currently working FT. Looking for people with similar interests to have conversations + hang out with. I am into reading and hiking, beauty related and watching dramas. Would love to hear about your favourite books :)",
            "Hellooo. 33F and trying to expand on circles of friends in life. Wondering if therr is any telegram or grps to join to start of and subsequently meet up for events together? Any like-minded? ",
            "Hi guys , 35 m here. Looking for friends to chat with.  Feeling down recently due to $ , kinda like shit.  Working around cbd and often ot. Chat me up.",
            "20 F ^^ uni student sooo i'm stuDYING. \nI like reading books, but I have a very short attention span. I also enjoy dancing, especially to kpop. I like self-help books and romance novels. I'm also a fan of anime, manga, and webtoon. I'm looking for someone who shares the same interests as me. I'll soon be starting a part-time job, so I'd like to make friends before things get busier.",
            "32F here hoping to make new friends (strictly platonic since I'm married)!\n\nDunno if it's a long shot but I listen to Trance music and really want to get to know other people who listen to it too and want to attend international trance DJ gigs and shows :') Hit me up if you're keen!\n\nI'm a big music lover in general really, would go see Beyonce and The Weeknd if they ever came here. Other than that, I'm into English entertainment (recently watched Avatar, looking forward to Bridgerton, love watching trashy reality TV), sewing, romance books, cats, sending and receiving tiktoks lol. I like to think I'm pretty open-minded. I'm not great at texting but would love to chat over coffee or lunch. If this resonates, feel free to PM me :)",
            "28M here, anyone wanna build a chair? \n\nI wanna practice my prototyping skills with wood and found a Malacca chair workshop on Tombalek that practices skills like angled joinery and upholstery. Its 1.8k though so its hard to find people around me who is interested, trying my luck here.\n\nNot a product designer but I studied it a but interested in product, furniture and object history and design.",
            "Hello, 28m here. Been living in SG my whole life. am currently working in a climbing gym( climbing community not big here ah) hahahhah. so its pretty easy to guess who i am. anyways. im a big outdoorsy guy. soon to be changing to a new job in the government sector. looking forward to it but its a whole new game so pretty anxious as well. would love to chat with some people and get to know you guys! dm me and tell me a little about urself! nojudgements conversations. i promise :)",
            "[deleted]",
            "32F, love reading and wanted to see if anyone wants to do a book club with me? Online, we don’t even have to turn on zoom or see each other’s faces, we could just be text buddies talking about books. I’m also self-learning piano and Korean, and work out quite often.",
            "[deleted]",
            "[deleted]",
            "Early 40s Female Eastie  , married no kids, moved from UK, Cat Person, likes coffee.",
            "Hey, 23F ENFP Northie here! I am currently still studying in uni, having a short break before I start my internship :) Overall I really enjoy travelling for sight-seeing and trying out new food! I am pretty open-minded and always willing to experience new things~\n\nDuring this break, I would love to improve my overall fitness level (my bmi is ok, but I have a weak stamina since young :/). I tried to go for a few hikes recently and I loved them. I am also interested in pilates which seem more chill (?) havent tried it though hahaa.",
            "28M looking for ClassPass buddies after work!\n\nCurrently working in tech in town. I frequent:\n- Yoga Movement @ Orchard\n- Anarchy Club @ Raffles Place\n- Sugar Boxing @ Somerset\n- Liftstop @ Orchard\n\nAnd a bunch of other studios.",
            "Hi Reddit people, 24 F currently doing shift work/healthcare ;0, looking to expand my social circle.\n\nAnyways ranges of hobby:\n- gigs/concert (I love emo music eg. The wonder years, Spanish love songs blah. ). NEXT concert IS porter Robinson// Olivia ! \n- Bob's burgers\n- DOGS ( I have A BOBBY)\n- art and crafts (been making earrings, but have stopped temporarily)\n- nature walks (only with other people)\n- cooking/ baking (I wanna do it again but no time :(( )\n\nAnw headsup, not looking for a rs or a man or a woman or anything in between) slay.",
            "29M in Finance (trust+fun, +65, milo ice) westie working in the east.  \nHere to look for some kindred spirits and expand my social circle.\n\nMy hardcore interests are desserts, mandopop, photography and travelling!  \nOther interests are bingeing on netflix, badminton, hiking (I love climbing mountains), gaming (console/board) & mahjong.   \nI enjoy getting to know people and open to new experiences too!\n\nThinking of getting into yoga and meditation classes lately using classpass but don't know where to start. \n\nWould be nice to get to know some of you via coffee or a simple meal! Hit me up!",
            "Hello! 25F in the East. \n\nI’m joining a basic Japanese language class with another member of askSingapore at Ikoma Language School next month. We are keen on Monday 2.30pm—5.30pm class but there is insufficient pax for class to form, so if anyone is interested and is free on Monday afternoons, please join us!!🤞🏻\nIf class does not form, we will be joining Saturday, 10.00am—1.00pm class! If you’d be keen on that or are coincidentally joining that class, feel free to PM me too!! We can go to class together. \n\nTo align with the objective of this thread, I’m a Masters student in my last semester. In my free time, I karaoke, mahjong, LoL/TFT (just not in current meta 🙃), browse Kinokuniya, read manga, watch Kdrama/Jdrama/Kvariety and watch crystal streams. I also just started learning Korean and playing OW. I would be keen to try out pilates or go back to the gym (AF membership totally unused for 1 year… ☠️). If any of the above vibes with you, please PM me too!! 🫡",
            "30F INFJ. Only looking for friends. I’m happily attached so don’t pm if you are only looking to date. I like anime (AoT, JJK, BSD, Haikyuu etc etc), do photography and am quite big on dungeons and dragons. Trying to be more consistent with working out and reading. Prefer to text before arranging to meet up. Happy to meet for boardgames/brunch/coffee. HMU if it sounds like we can vibe.",
            "[deleted]",
            "27F writer and art manager here - trying to transition to academia. I love anything to do with culture/heritage/reading. Married, with two cats. \nLooking for other female friends who’re keen on nerdy things and over analysing weird internet pop culture! (Big bonus if you’re a huge fan of ghost stories and horror)",
            "hi :) 23F, super introverted and in a relationship, but looking for friends around my age! moved back to SG a few months ago after finishing uni in the UK and it’s been hard settling back in. \n\nI enjoy watching Netflix, movies, shopping, cafe hopping, baking, cocktails, - and very very recently have started yoga (but just at home, looking for someone to join a class with)! I’m hoping to get more active this year, open to suggestions! Also open to exploring parts of Singapore, trying new food etc.",
            "30F, posting here since the previous thread has archived and i have tendered my job so nothing much to do other than finding jobs. in the meantime, just wanna kill some time by having people to talk to online. feel free to hmu with any interesting topics you have!\n\nlemme start off by saying, my choice of poison is a pint of blanc :)",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "Hi! 29F, looking to meet people in my age group and create long lasting friendships + a circle :) \n\nI moved back to Singapore 4 ish years ago from India and I currently freelance. My interests range from movies, art, cosmetic science, discovering new eateries,and I’ve just started to run (from myself haha! Just a joke, my sense of humour can be dark/morbid). \n\nI’ve also just started volunteering in a bid to keep myself sane. I occasionally dabble in tarot cards for fun, but I’m open to in depth conversations about life, mysticism and philosophy. I have a weakness for ice cream, teh tarik and all things vegetarian. I’m a huge fan of long walks and exploring the city on foot as well! \n\nLooking forward to meeting new folks offline if all goes well! ✨",
            "Hi!\n37F, ISTJ, works in healthcare/education.\nFull time working mom looking to meet new people.\nI enjoy coffee, gym, climbing, books, museums, cooking, walks, hikes, traveling and learning new things.\nI'm only available on Saturdays due to certain arrangements. Happy to meet new friends!",
            "[deleted]",
            "Hi~ repost again, \n24F, currently looking for a job change to design industry from coding, hmu if you’re in a design field! My hobbies are gymming (2-3x a week depending on the weather, etc) oh I do dance but it’s a fortnight thing!\n\nFavourite food is sushi and Mediterranean and am a eastie! :)\n\nEdit: if you’re in any industry, can hmu too! I’m taking a sem break from sch and will resume in Oct 🥲🤘🏼",
            "19F this year, currently schooling and working pt at the same time! \n\ni guess itd be nice to chat w new people to widen my social circle before life gets too busy for me to do so,, \n\nhobbies i have:\n- crocheting\n- gaming\n- writing/reading\n- listening to music\n- exercising (veryyy occasionally now sadly)\n\nlife is quite hectic atm so sorry if i reply late! just drop a dm if you're interested and think we'd get along :)",
            "hii! 21F, INFP but yap alot when comfortable \n\nlives in the east area, looking to expand my social circle \n\nmy hobbies are reading, baking, crocheting, gg to cafes, listening to music and watch dramas (eng, chi, kr, cantonese), recently took up jogging\nlike cats and dogs, unfortunately fam don't allow\n\nim looking for ppl ard my age\nthanks!!",
            "[deleted]",
            "Hi, 25F this year. Working and adulting atm after finishing uni. Looking for friends who may have similar interests…\n\n- Gym, started lifting weights 3 years ago! Wld be nice to have a gym buddy. Recently shifted gyms to activesg woodlands instead\n\n- Watch kdramas (I’m such a fan of lovely runner)\n\n- Deep talks about life? Contemplating about how to be better and searching life’s true purpose? 😂\n\n- Christian friends? I’m christian! Would love to have faith talks.",
            "27F - looking for girlfriends to shop, chill, pilates! Big on bars, live music, concerts, cafes, investments. Would love to have deep conversations and good times! \n\nAnd quoting mary J: “Don't need no hateration\nHolleration in this dancery” So girls’ girls only!! 🌷",
            "Hello!! \n\n29M. I live near Chinatown and am looking to make new connections and friends (new in Singapore). Used to be a big time overthinker, I still do it sometimes, but have reduced it quite a bit by doing the things that need to be done rather than just think about them (also chamomile tea and being busy AF helped), lol. \n\n**\"Carpe Diem\"** is my moto and am looking for people who know **life is tough** *but we'll get through it*. Its's always better to have supportive and understanding people around you (and it is a two way effort). Life is too short to be sad, obviously we can't prevent that from happening, but we certainly can make it easier to manage.\n\nPing me up if you want to connect and do some activities together (like jogging, trekking, coffee, lunch, party or anything else we may find in common). \n\nLooking forward to your ping!",
            "26f looking for friends to hang out with ☀️ If you'd like a buddy to explore vegan/ vegetarian food, try board games or visit museums/ exhibitions with, message me with your recommendations or your to-try list! We can arrange something from there :)\n\nI'm introverted, but not really a fan of texting too long nowadays - as convos may tend to drop off before we get to meet up irl. The deep chats can come if we feel the connection, and find more things we have in common!\n\nNote: if you're looking to go for Kyuhyun or IU's concert in SG this year, feel free to hmu too! It'll be nice having friends to go with",
            "40m single all the way. Young at heart. Currently work long hours. Enjoy karaoke at Teo Heng, Cashstudio, have fun, kstars… or even karaoke pub… looking for a female friend to go together and maybe sing mandarin duets. Just looking for a karaoke partner… I usually go on random weekday evenings 5 or 6pm to night latest 9pm or 10pm. But sometimes I do go on weekend too if I happen to have a rest day. I also play ffxiv mmorpg online.\n\nI do sing new songs like eric Chou … quite a lot songs I sing. Big Ktv songs library. Dm me if u want to be my female duet partner. And u like to sing. I’m a karaoke addicts.",
            "[deleted]",
            "24F here from the Philippines! I'm a frequent visitor and this time, I'm here until the 16th.\n\nI love to travel, lift weights, go indoor cycling, and go cafe-hopping. I'm into film photography and I'm also keen to play board games and I've also been wanting to try bouldering.\n\nI also love trivia nights and drinking cocktails so I'd be down for a night out. Oh, and I can take good pictures for your Instagram!",
            "[deleted]",
            "36 INFP\nThis is my 2nd time doing this. Last year ended up making some awesome new friends :D\n\nLooking forward to meeting more cool friends in 2024:\n1) Love long walks, think 10km and longer\n2) Love getting to know what people are passionate about, what motivates them and all their little quirks.\n3) Oh did I mention, if you join me on my walks, we are very likely going to have long discussions on philosophy, psychology, history and other such topics? ;)\n4) Looking for people who are cool with trans people.\n\nSlide into my DMs if you're interested :D",
            "32F\n\nJust bought the projector membership , looking for movie buddies ! Tomorrow anyone ? 😃 \n\nI’m also into spin and yoga, we can go together and have coffee after. My goal this year is to follow the entire arms track without dropping lol",
            "[deleted]",
            "Looking for study buddies for my gf (24F) for Part A exams in April. Pls drop me a message if you’re taking the exams and don't mind studying together with her. Y'all can help each other pass (hopefully)! She's really stressed now due to her exams and I do want to be able to help and support her but sadly I'm not doing my bar exams now so I can't really relate.",
            "21F, likes to listen to japanese music, karaoke :D\nDoes yoga on free time, would like to find people to have lunch/dinner with and maybe KTV :D. I'm more available on the weekdays for March. And weekends next month. \nStays on the north east. Would be nicer if you are from the east/north east side. 🐱",
            "Heyy,  \n29M, I am very new to Singapore, and a huge coffee nerd, was hoping to join any coffee communities.\n\nPlease do help, if you know any.",
            "hello! 28F, looking to find more friends to play destiny 2 with! i’m not that great, just a casual but need more friends to play raids with since my clan members are no longer as active.",
            "Hello everyone, I am a 27M who lives in the west. \n\nI like to cook, read manga, watch football and basketball and game occasionally. I also enjoy going to hunt for good food spots on the weekends, so we can exchange good places for different types of food. \n\nWe can have good conversations over text or meet up after getting to know each other more for coffee or a meal. Looking forward to meet more friends ![gif](emote|free_emotes_pack|grin)",
            "Lol I got confused for a while about the MH and steps thing.",
            "You sound like the male, extroverted version of me. INTP. Also from the north. We’re also the same age.\n\nAnd your interests all coincide with mine, except the outdoorsy ones like parkour and lindy hop. Im more of a ballet and piano kinda girl lol.\n\nYou say you like artsy things - are you working in the creative industry too?",
            "Oof OSCP is quite notorious for being hard. Are you working in cyber now?",
            "GUYS IM IN FOR THE CATS \n\nIf anybody have a cat meet up who’s willing to let me “molest” I mean touch the cats please jio 😭",
            "Hey! I’m an art manager & arts writer here, love doing any sort of craft too. I’m 27F, born here but moved around for quite a while. I love making friends from abroad so hit me up if you ever need a guide around Singapore",
            "hi! hope it’s not too late - 27F born and raised SG here and i love exploring sg, cats and crocheting too! currently trying to build up my little crochet toy collection 🤣 i also love learning about new cultures and just starting to get into reading. would be more than happy to show you around sg or discover new places together! hmu if you ever need an exploring pal :) (p.s. what are some books you’d recommend?)",
            "sorry, obsessed with poking veins?!   \n\n\ncats are, in general, arseholes. just like my housemate whos currently sitting on my mousepad and refusing to let me do work....",
            "I totally agree w your username but then I see you’re lactose intolerant. Helps. 💀😂",
            "Send me a dm. Has a 30s telegram might be for you if interested",
            "I have a really old bridge camera and a tripod that’s never used. I don’t intend to upgrade anything but to find a reason to keep myself engaged in new hobbies. If you don’t mind adopting me along a hobby you have. Would that be okay with you?",
            "Im 27M, i have cats 3 of them joined the family against my will, i enjoy movies too and always wanted to try cafe hopping. reading wise i have been reading atomic habits. For workouts also been trying to get back into the gym. A new hobby ive been trying out is building gunpla kits",
            "Hello! I love a girl’s girl and honestly admire your energy. What’s the next activity you’d like to try? I love the idea of trying out new stuff each time",
            "Hello 35M here. I'm looking for boardgame friends and also people who want to go out and makan at interesting places as well. Its a huge plus that you are an animal lover as well, and I can share with you animal memes. Please DM me if you feel the same or am comfortable with doing so.",
            "wah buddy, around my age man. we can hang out lol",
            "Congrats. Focus on your new family and it's important to have self-care also. Date your wife more too so that she feels loved.",
            "Hi, 34F INFJ here. I’m keen on yoga, pilates, baking and reading. Would love to do cafe hopping too.",
            "I have created a telegrp for 30s. Let me know if interested. Still trying grow more people",
            "I do play a lot of games, read manhwa and watch anime too! I have helldivers 2 but I’m looking to upgrade my pc before I play, my 1080ti seems like it cannot handle the game smoothly 😱",
            "26M looking for someone to do tactician/honor run in BG3 too!",
            "Hey I'm also job hunting too. Good luck to both of us!   \n\n\nI tried board games once but it was a bit intimidating haha. I guess I prefer single player games that I can play at my own pace :)",
            "Hello hello what games do you play?",
            "Hi there - 31M working in HC too, I like board games/escape rooms but friends are never free enough :) Enjoy singing cpop as well",
            "Ooh, I do love a good visit to Kino from time to time. Will dm if you're keen.",
            "just a note that most adults that are older than you... are just as clueless as you. they are just stuck in more of a rut.  :D",
            "You just named 3 breeds that shed like hell, have expensive medical bills (especially the dachshunds) even my small Maltese that’s only 2.8kg costs $100 to groom every other month. I dread to think of the grooming fee for a Samoyed 😂",
            "Hi there, 25F and I live around the CBD too! Ditto on not making friends in the wild part :\") I'm into games (though maybe not exactly the genre you're into haha), reading and have been trying to be more active too! We can chat if you'd like to connect :)",
            "[deleted]",
            "PM u previously but u didn't reply",
            "I’m keen! I’m looking for the same, currently wfh and have not much chance to socialise, I feel like my social circle has drastically shrunk. 35f",
            "You should try yoga. I go 3x weekly and it’s the best fitness routine ever.",
            "Can join in Singapore first at a small scale, before venturing overseas?",
            "One pint of Guinness does wonders",
            "Currently playing CoD MWIII, Warzone Mobile, XDefiant & Fallout 4. Also, a bit of Ace Combat 7, ArmA III, F1 & XCOM 2. Might get Helldivers 2 though!",
            "Hihi HD2 player here :D hit me up if you decide to get it !"
        ]
    },
    "What are some things to do alone in SG after a breakup? ": {
        "title": "What are some things to do alone in SG after a breakup? ",
        "score": 63,
        "url": "https://www.reddit.com/r/askSingapore/comments/1dlruar/what_are_some_things_to_do_alone_in_sg_after_a/",
        "content": "Going through my first breakup and it's been really rough. I've been moping around at home the past three days and I wanna find something to distract myself. Haven't told any of my friends and family about it yet. Just wanna heal by myself. ",
        "num_comments": 90,
        "comments": [
            "Sometimes good things fall apart so that better things can fall together.",
            "Run, sweat it out.",
            "Go to the gym!:-) it helped me so much, never regretted a single gym sesh.",
            "Talk to trusted people and close friends. (Emphasis on trusted people only. Don't want to invite more drama)\n\nHave a good cry at night. Go exercise and keep busy after that. Sign up for that thing you've always wanted to try but was too scared to do or just any random activity that catches your eye.",
            "Go SEA aquarium with a book. Sit in a corner and let the fishnswim around you while you read. \n\nTake a ferry to St John Island. Go for a walk and be miserable on an almost deserted island. \n\nThere is a terrarium workshop tmr at Marina Sq. Go sign up and pick up a new hobby. Hopefully the plants will grow healthier and last longer than your relationship. \n\nGo Haidilao and bing eat until you burst. Now single liao no need maintain figure, noone watch. Tell the server you broke up maybe they'll even sing you a song to cheer you up.\n\nYou're welcomed.",
            "\"When one door closes, another opens; but we often look so long and so regretfully upon the closed door that we do not see the one which has opened for us.\" (Alexander Graham Bell)",
            "Find something to read in the library? Can learn more about different topics in the non-fiction section, or jump into a new universe/see things from another character's POV when you get engrossed in a fiction book. I think it's quite a good way to shut off from the world. 🙂",
            "Try and pick up a new hobby? As someone said goto the gym more? Solo travel somewhere? Make some new friends? Volunteer?",
            "sad, go gym, lift heavy circle, happy\n\nrepeat the next day",
            "Girl, I broke up last year Sept 2023, can say that time does heal some wounds, and I’d say that I’m in a much better headspace. Learn to sit down with no disturbances and learn process and feel your emotions, instead of numbing or distracting yourself…. It’s ok to cry and grieve over the relationship and it’s possibility, but when you’re done, look forward and don’t look back. \n\nWhat’s coming is better than what’s gone. The breakup happened for a reason. This is your season, YOUR TIME, to learn more about yourself.\nGood luck, OP.",
            "cycling. do round island",
            "Catch up with friends that you didn't manage to connect as much when you had a bf taking up Ur time previously. \n\nDo all the things you wanted without someone holding you back or have to coordinate time with. \n\nGo for your hobbies and interests. Read. Cycle. Swim. Binge on dramas, anime. Enjoy a meal or high tea alone. Movies. Musicals.  Onsen. \n\nEverything can be done alone n feel good.",
            "Find people u trust and share ur sorrows with em. It is going to help a lot",
            "Driving range while listening to podcasts. Let me know if you need someone to get you in bro",
            "I did daily walks at the park connector on my own, went on lunch dates to treat myself to expensive food, booked biz class flights abroad and 5 star hotels solo travelling, if it's too expensive you can book a staycay by the beach in sentosa. All the best with your healing!",
            "Run, workout, do yoga, meditation, engage yourself in your hobby and work. Let go of past, let go of the need to know the answers. If you are meant to know them, you will find them. Don’t overthink about your relationship. Acknowledge your faults and don’t blame yourself for other person’s fault. What’s meant to happen, happened. Nothing can be undone. Don’t overthink, I repeat. Mind will always tell you negative things, but don’t engage yourself in those thoughts. In my life, some of the best things came after pain. If you take things right, pain could redirect you towards something better and more positive things. Don’t self sabotage or do anything which will hurt you. Most people hurt us once or twice or thrice, but it is us who hurt ourselves the most. Forgive yourself, let go and move ahead. Good things await you! Talk to your friends and family. If cannot do that, write and throw the page away as the outlet.",
            "Go to a boxing gym. Do sparring in about 3 weeks' time (Light sparring though). You will get to meet new friends and hit the bags",
            "I walked across the countryside to the city (took me 7-8 hours). Ended up developing walking aimelessly as a hobby.\n\nTwo years later met a new partner who ended up being my wife. Walking around became a shared hobby.\n\nNo regrets ever since; the dots do connect when you look back.",
            "\"throw shit at neighbours house\" post literally came right after this post on my feed so we both know what's the correct answer",
            "Ice skate/rollerblade",
            "Go solo travelling. If you can't leave sg now, be a tourist in your own country.",
            "I broke up recently too. Cried for nights altho i was the one who initiated it, because i felt that i kept seeing the negative side of my ex but realised i had also been quite toxic and felt so bad (losing temper easily etc.). \n\nThen got better as I was busy with work, and also met my siblings and friends more to just chill",
            "a short morning hike at lower pierce or any other one of the reservoirs is really relaxing",
            "sweat it out! gym, running, cycling, yoga etc.",
            "Go park walk walk lor",
            "Start jacking off and masturbating furiously. After my first break up, I masturbated at least 5 times a day. \n\nTook out all of my life energy and I was a shell of a human but thanks to that I recovered.\n\nTo date, I still masturbate 3 times a day. I have a fleshlight permanently mounted to my bathroom wall for this purpose. My family doesn’t seem to mind and I’m pretty sure they use it too sometimes",
            "I usually go out and get a new hairstyle/hair color, a massage, eat a nice meal by myself.\n\nTake your time, you don't need to tell anyone for now.",
            "Process your hurt. \n\nI took a bottle of wine (and whiskey too since it happened multiple times) to sit by the waterfront and just drank and processed all that happened. Helped me bounce back faster than not facing it and distracting myself",
            "Limpeh recommend go holiday la",
            "Cheer up dear , break up is nothing, trust me relationship is nothing compared to any actually marriage . Everything seems rosey in a relationship but you prob live together you won’t even stand him for a day .",
            "eat ice cream\nlots of it",
            "what really helped me was picking up new things to do that i knew would get me hooked. around that time i started picking up on fitness more, playing a new game and getting immersed in it and also picking up oil pastels. it’s very important to feel your feelings but also have something to cheer you up when things get rough.",
            "I would say go into therapy. I'm doing it now after a recent situationship ended. Personally it's just nice talking to a complete stranger who actually listens and validates how you feel. I'm a really introverted person so this really helps me heal.",
            "Do all the things you never could do with your partner or stuff that he/she disapproved of but which is totally legal and a healthy way to cope. \n\nI had a lot more time after my break up and did lots of fun classes with a new gym membership. I also started attending lots of other events he didn’t enjoy as he was an introvert. I had coffee dates with myself as he didn’t like coffee. I went shopping as he didn’t like shopping. I went on my first solo leisure travel (without a work trip component) because he didn’t enjoy travelling. I did everything he didn’t enjoy, but I did. And I found myself again, and grew to appreciate my newfound freedom. :)",
            "I skated around national stadium for 27hours nonstop to get rid of the pain but ended up getting physical and mental pain. Managed to clock 250km and made new friends anyway.",
            "watch a movie - this activity is more passive so it's easier, if you're still in a sad mood\n\n  \ngo eat hotpot - warm your soul\n\n(or swensen's banana split)\n\n((or cafe hopping))\n\n  \nlie at the beach and soak in the sun (idk if the oil spill problem has been fixed yet though)\n\n\n\ngo for a picnic \n\n  \nvisit a pet cafe\n\n  \nsing karaoke\n\n  \ntake a random bus \n\n  \nvisit a rooftop bar and enjoy a cocktail at sunset",
            "A walk or indeed a hike is good... upper pierce reservoir is lovely and during the week you are alone...  a nice bike ride...  head over to the internet and get a paid date to remove any potential build up of blue balls..  \n\nI have been there so don't mean to be glib...  it's bloody tough at times but a combination of alcohol,  sex with various folks and exercise got me to a point where I felt better.   Best wishes",
            "Fully indulge in my work.",
            "Taking a long walk to decompress after dinner will help.\nNot jus in Singapore but anywhere else in the world.",
            "Go kiu kai",
            "Wank first, Gym later.",
            "Hike from timah to thomson",
            "Gym.. Nothing heals a broken heart better than a good pump 💪",
            "Same situation with u bro. My advice is do things that are fun for u to distract yourself, however there will be days that the emotion is just too tough to handle and it is totally okay. Just cry it out. Some of the things i do now is travel , meet new people, go to the gym more often. We can get past this phase bro!",
            "have you tried a physical puzzle activity called bouldering-\n\nbut honestly, just any activity that you have any interest in would do, and time shall do the rest 🤔",
            "Do long night runs at ECP.",
            "badminton",
            "Binge on a new drama series, take yourself out to a nice cafe / bar you’ve been waiting to go to. Take a long bus ride to explore a part of sg you have never been to, catch a movie at an ulu mall.\n\nGive yourself time to grieve the end of the relationship. Accept what you are feeling and process it first.\n\nKnow that you will be ok 👌\n\nEdit: I mentioned kdramas earlier because it’s enjoyable to me but obv not asking OP to choose a romance film. Clarifying it can be any series like comedy/documentaries etc. Netflix has so many. Try the trending Money No Enough 3!",
            "If you are a gamer, then game as long as you can.\n\nIf you can travel, then impromptu book a flight and travel a few days away for food and activities. Even JB or Batam or Bintan could be done in 2 - 3 days immediatley.\n\nIf you love to exercise, then run your hearts out.\n\nIf you feel that sharing with someone that can act as your sponge and would help you to get your feelings out, calm yourself and forget, then do so.\n\nBasically, go to your safe space that you normally go to, and do it. Also, now that you are single, you might have forgotten how to treat yourself too. So, go do that activity that makes you feel good and grateful again.\n\nHope this helps by the way!",
            "Just start drinking and buy a gaming console and signup to the multiplayer account. Thank me later.",
            "hearsay Rebound *sex* ",
            "Hit me up if u wanna grab a drink",
            "Meet me. On a more serious note, meet up with your confidante. Not to trash talk your ex. But more of like a review of past events and see where you both went wrong. And learn from this experience.\n\nHuman connection is what you need the most now as you do not wanna feel neglected or abandoned.",
            "Gym, exercise, meet up with friends whom u might accidentally neglected during the courtship.",
            "Volunteering. Keep yourself busy and help people in need.",
            "Book in, knock it down, my grandmother can run faster than you",
            "Exercise. Be his hottest ex.\n\nThis is your best season to glow up.",
            "Break up and life is a mess? \n\nCome on, there's more to life than a relationship.\n\nGo shopping, do some well being stuffs like gym, quiet time over coffee n a book.",
            "Go to a fish farm and draw a conclusion there",
            "Start drinking.",
            "Drink heavily",
            "Agreed. After my breakup I learned a lot of languages and instruments. Gym a lot. Got in a better career path and bosses who groom me.\n\nAnd I learned that it's always two parties'faults in the relationship (even if he was cheating) and that I started to perform self reflection and improved my interpersonal relationships.\n\nIt's fine. I am doing well. Dressed much better. Looking more fit. \n\nAlso know how to heck care other people's opinions like must get married and have 3 kids nonsense.\n\nOP, it's fine. I agreed on the SEA aquarium that other commenters mentioned.\n\nYou can solo travel to safer cities like Tokyo, HK, Seoul or Taipei. My acquaintances accidentally got a prestigious job while travelling LOL. \n\nYou never know what life brings you.",
            "Or sometimes it’s just a shit situation with no upside",
            "Run.",
            "I'm seriously thinking about this, but I'll be frank, I'm terrified of the idea lol... I'm a pretty big bloke, aka fat af. Alongside that, I'm an introvert and I really don't like being in a place with so many people.\n\nI know that realistically, everyone is doing their own thing and no one gives af about you but, somehow this superficial thought of mine is blocking a probably really good life change.\n\nSo I've just been working out at home with what I have, though it's been a struggle to keep a schedule going in the same environment you relax in....",
            "I would 2nd this",
            "Suddenly reminds me of a video I saw where a bunch of friends were in HDL and the staff all crowded around one guy and they danced or clapped as the song \"分收手快乐\" played",
            "Not OP but what's the shop name for terrarium workshop?",
            "omg this is what i did too!! i went to sea aquarium alone and just stared at the fishes",
            "I've never tried reading a book at the SEA aquarium - interesting idea - haven't been to an aquarium in ages lol",
            "I second this! Indulging in hobbies is helping me cope with my break up. Can also try going to classes to learn a new skill like dance or improv, it’s also a fun way to make new friends!",
            "or go for a run idk just keep yourself busy",
            "Honestly, I know a lot of people who keep breakups to themselves because they totally neglected their friendships when dating, but for me… I just spill with no shame. It helps a lot, I cannot imagine how hard it is to keep a breakup a secret to close friends and family. Of course I don’t share with mere acquaintances.",
            "And watch Netflix lol",
            "Bruh, I think OP is a woman 🤣 Maybe if she is sexually charged she can follow your advice, but I think it only applies to some girls. Nonetheless, might be good advice for the boys though 😂",
            "Watch kdrama is possibly the worst excuse someone can give",
            "This is how to get depression. \n\nWanna heal? Don’t sign up to the multiplayer account.",
            "I think you are trying to be helpful but the language and tone is coming off the wrong way.\n\nEmotions are complex. Going through the first breakup is (possibly) a life-changing perspective-altering moment.",
            "Positive mindset, life is full of exciting surprises",
            "I would 3rd this",
            "No wonder the CEO is happy with his GCB residence",
            "That’s so cute!",
            "Love in a bottle is holding a workshop tmr at marina sq",
            "Edited post for clarity.\n\nAlso don’t get what you mean by excuse…?",
            "Not necessarily. I made some really really good friends locally from online gaming. But this was before we all got married. And have kids. So it's not a formula for failure. It keeps you occupied and focused. As in the objective of the game. Which is mainly FPS",
            "I would 4th this",
            "I would 5th this",
            "I would 6th this",
            "I would 6th this",
            "I would 7th this"
        ]
    },
    "How is it possible Vivo City is bigger than Suntec City?": {
        "title": "How is it possible Vivo City is bigger than Suntec City?",
        "score": 83,
        "url": "https://www.reddit.com/r/askSingapore/comments/1dlok2t/how_is_it_possible_vivo_city_is_bigger_than/",
        "content": "Apparently Vivo City measures around 1,070,000 sq feet whereas Suntec measures 888,000 sq feet. \n\nBut to anyone that's been to both malls before, I'm sure most would think Suntec was the bigger one.  I can't express how many times I got lost in Suntec until I looked at Google Maps and finally mapped out the layout of the place. I mean the shopping mall has like what, 3 different wings, each of which are big enough to be considered a separate shopping mall.\n\n\n\nMeanwhile Vivocity is just one large chunk of space that's multi-levelled. But it's only the 1st floor which is widest. The basement is far smaller and the 2nd level onwards are just narrow aisles that surround the 1st floor area. \n\nSo in what world is Vivocity bigger at all??? Did they count the car park and exterior or something?",
        "num_comments": 35,
        "comments": [
            "The numbers you are quoting may be net lettable area which is different from the actual space.",
            "After working at near suntec and going suntec for lunch for 3+yrs, it doesn't feel big anymore. Just that the indoor makes you walk big rounds. It's actually just 3 small towers",
            "The areas you stated are for retail space.\n\nVivocity has 5 floors of stuff with Tangs, Fairprice Xtra, GV Max taking up huge amount of space. Meanwhile Suntec City Mall only has a basement (technically on separate levels but effectively on one floor), level 1, level 2, some stuff on level 3, and a swim school on level 4. The supermarket and cinema is smaller and there is no department store.\n\nDistance wise, vivocity is about 300m at its widest while walking from the east wing to the west takes 650m.",
            "Unrelated fun fact: Suntec City was designed to be shaped like a hand with the fountain of wealth resting on its palm",
            "Suntec layout a bit cmi. Must walk one end to the other",
            "The correct question should be:-\n\n**How is it possible that some Ridout Road properties of comparable sizes to both is being rented out for less than the rent of a food court drinks stall?**",
            "Maybe they consider Suntec as two different towers instead of one whole mall",
            "The correct question you should be asking is how much of Vivocity’s space is being dedicated to its maze-like crappy design that makes it hard to find certain shops that are located on the rooftop areas",
            "To me Jurong Point feels bigger",
            "agreed",
            "Depends on which metrics you are measuring. Real life feeling when being there will differ from square foot measurements on paper.\n\nFeeling wise, Suntec City feels a little bigger since there are ins and outs that you need to navigate. Although Vivocity could technically be bigger since its quite square-ish, to get around the place is pretty much quite direct.",
            "Maybe they're counting the empty space above the atrium as sq footage?",
            "*shrugs*",
            "Does that mean Suntec is actually bigger then? They prob gave Vivo City the 'biggest shopping mall in Singapore' label just for advertising purposes since it's a new launch",
            "Suntec has the largest indoor park SuperPark, the largest gaming arena Zero Latency, Don Don Donki, all the various gyms you can think of: spin, boxing, MMA, gym, alongside pretty much everything Vivo City has like a movie theatre too and fairprice. They also have multiple more food courts compared to Vivo.\nOh yeah, also  office buildings if you count those...\n\nIn Vivocity, you can feel the crampness of the mall  everywhere at peak hours. But in Suntec, the place is so damn big you never really feel that population density at all anywhere. Suntec has at least like 3 gigantic open spaces compared to Vivo City having only like 1 on the first floor\n\nSuntec by all means felt more to me like some kinda mini city of its own compared to Vivo.",
            "Fun fact - the computer shows used to be held at where vivocity is now",
            "It's a little faster to get to the other end via the fountain at B1",
            "You can shortcut by walking out and crossing past the fountain\n\nSuntec city really felt more like a mini 'city' to me than Vivo does. The 3 wings, the multi-layered design, the fountain holding everything tgt and the fact that it's also the base to multiple office buildings.",
            "Food court drink store rent is 20k?!?!",
            "exactly,",
            "You ask those that bid for food court drink stall to go bid for ride out road properties loh.",
            "Orh",
            "Good answer , people will still defend them",
            "The great part is you can rent houses along the road too. Its available to public. But you foreign interference agent so probably not enough money to make a winning bid.",
            "If you go to Vivo City's roof, cant you already access all the shops there?",
            "Jurong point is just a giant food court at this point.",
            "Are you including Expo Centre in Suntec ?",
            "Yeah it’s probably NLA, the fountain space doesn’t count. ",
            "I think you answered your own question, vivo feels cramped because the space is all leasable area, whereas Suntec has more non-leaseable areas so doesn't feel cramped.",
            "It was called world trade centre",
            "Fun fact: suntec city is actually mindef transformer Metroplex. It transform into robot mode in times of war.",
            "Industrial area -15k",
            "I remember some stores only being accessible from certain parts of the rooftop area, like the library is accessible from one part but not the other side.",
            "Harbor pavilion for stage events",
            "I mean you can walk through the skypark. iirc they should have sheltered (non ac) walkways "
        ]
    },
    "What’s that sickly sweet yet disgusting smell that all cabs seem to have?": {
        "title": "What’s that sickly sweet yet disgusting smell that all cabs seem to have?",
        "score": 102,
        "url": "https://www.reddit.com/r/askSingapore/comments/1dlm6ow/whats_that_sickly_sweet_yet_disgusting_smell_that/",
        "content": "I’m starting to get real confused and just want to find out what it is. Is it air freshener? Because it doesn’t smell like it. Is it from vaping? Why does every cab have the same smell???? ",
        "num_comments": 62,
        "comments": [
            "Pandan leaves",
            "Pandan leaves to keep cockroaches away. Not sure if it works, but taxi drivers think so.",
            "Air freshener mixed with pandan leaves and a bit of cigarettes odour .",
            "that scent is the only reason i don’t take cabs anymore, i used to puke because of it",
            "Cheap valu$ perfume",
            "It triggers my migraines :(",
            "pandan leaves left under high heat of sun baked vehicle",
            "Appeal to all taxi and private hire drivers. Please don't use air fresheners. It gives headache,also not good for health.",
            "Air freshener, i actually like that smell. Even better if its a new cab with that new car smell",
            "Sometimes they use the types used in public toilets![gif](emote|free_emotes_pack|flip_out)",
            "Should be Pandan leaves. \n\nAt least it smells decent. \nSome taxi / grab tends to have the moist damp smell. Unbearable",
            "The Pandan leaves that they keep in their car that fuels their excuse for not washing their car as often as they should.",
            "Air freshener and ass, probably",
            "ambi pur ?",
            "Cheap car airfreshner plus leather.",
            "It's from them smoking in the cabs. Despite signs everywhere in the cab saying it's illegal to smoke in the taxi, the drivers themselves do it.",
            "[removed]",
            "Dettol wet wipes.",
            "either air fresher or the smell from the fake leather seat being heat up by the sun",
            "Just wind down the window",
            "Sounds like vape",
            "Pandan leaves + lemon air freshener smell + moth balls",
            "Old man smell.",
            "Old man smell.",
            "I take grab/ cab a lot for work. \n\n\nI believe it’s from vaping, it’s sickeningly sweet and I hate it too. \n\nIt’s very obvious for the difference between vape and air fresheners. \n\nOnce you learn how to identify it, a lot of handicap toilet also have.",
            "Old uncle smell + cheap fragrances /s",
            "It’s the collective sweat and fart from previous passengers.",
            "Ashtray? That’s the only thing I smell in taxis",
            "pandan leaves smell disgusting? maybe you should try taking taxi in India",
            "My guess: strong Chinese medicine or incense from previous passengers?",
            "I think this.. since young I always remembered the smell",
            "I always see it but I don't know if it's really that!!\n\nI don't think its vape cos I remember smelling it even in the 90s as a kid? Was vape a big thing then? Vape feels like a more recent thing in the past decade leh.\n\nAnyway, the smell used to make me feel sick as child also : (((",
            "it works to repel, but since they will simply move to different area without the scent, it's likely the driver will put in different part of the car just to prevent them in the first place",
            "Sorry to hear that, hope that you have some things like the Vicks inhaler with you or some eucalyptus oil to smell to help cope with the migraine.",
            "No it doesn’t",
            "Fuck that shit, gives unbearable headaches.",
            "Your comment has been automatically removed because your account is relatively new or you have negative karma.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askSingapore) if you have any questions or concerns.*",
            "Don't have leh. Dettol scent is very distinct one.",
            "i definitely think it’s vaping too because a few cabs don’t have it and their air freshener smell doesn’t have the same weight to it",
            "Toilet also has disgusting air freshener.\nIf it's from a taxi, then it's airfresheners, but if it's a private hire car, it's vape.",
            "Tried not a pleasant experience",
            "it helps to repel cockroaches too (doesn't kill them if they are already in the cab)",
            "it’s definitely not the same smell from the cabs i smelled as a kid 20 years ago!",
            "Pandan flavoured vape?",
            "Are you the authority in charge of migraine or something lmao Strong perfume smell is known to trigger migraines. It occurs for me too.",
            "Yes it does. I think combined with taxi driver's sudden jam brake at each stop.",
            "The wet wipes leave behind a different scent. I found out about this cos I used some to wipe my table and my room smelt like a taxi after.",
            "Ya, air freshener very obvious lemon, pine, etc smell. \n\nThere's no freshener that smells like vape.\n\n\nSame reason why I absolutely hate walking from the underpass section to 313 from somerset station. That scent shop beside breadtalk is vomit inducing for me. I still don't get how they are in business.",
            "I’m actually very sensitive to smells. Air fresheners contains volatile organic compounds (VOCs) and usually give me very intense headaches, but not vape related smells.\n\n\nThe toilets I’m referring to usually are in the handicapped ones",
            "I don't think its that likely leh - as I said I remember smelling the smell even as a child in the 90s! We took more cabs then bc family didn't have car \n\n\nUnless you're saying vape was also a big thing then? Lol. I thought it was a more recent, 21st century/past decade thing when vape rose in prominence lol.",
            "It’s far more likely to be motion sickness than the scent in the cab.",
            "I use Dettol wipes pretty often and it doesn't smell close to the sweet smell you find inside taxis.",
            "Hmmmm... Perhaps a deodorising spray? I know someone who uses Febreze for his car, despite the Febreze being designed for clothes and to be used in a well ventilated area. I get a headache when I smell it, and he only stopped when I told him the active ingredient in that product is sodium hypochlorite, which is basically bleach. \n\nSH in small quantities can be undetectable via odor, but still cause you a headache when inhaled for an extended amount of time.\n\nCertain air fresheners in general also fall into this category. They're not meant to be sprayed into an occupied room. Which is why you need those meant for cars. Could be this too. \n\nOr hey, maybe cheap air fresheners in general.\n\nhttps://www.medicalnewstoday.com/articles/why-does-perfume-give-me-a-headache#:~:text=Experts%20still%20do%20not%20know,one%20of%20the%20cranial%20nerves.",
            "Dude STFU. Your experiences do not equate others’.",
            "Its not just in moving vehicles. I can't stay too long in a Starbucks, the smell causes me to get similar headaches too.",
            "Who are you to dictate how someone’s migraine triggers are? As someone who has migraines, I have triggers such as humid weather, certain mushrooms and scents that are not within my control",
            "Ikr. I think its a combi leh. Like movement **and** smell.\n\n\nI don't get chronic migraines but I had one season of my life when I had it (omg it was so bad. Too loud too bright too noisy all cannot lol 🙃😬😳), and ... ya I think its both movement and smell. Each is bad on its own. Put both and you get a combo breaker 🙃",
            "The weirdest trigger i have is wind blowing on to the top of my head for a prolonged period.",
            "Yeah.. I stopped taking taxis bc I vomit after the trips no matter how I try to control it. It could be the scent, it could be motion sickness, or both.",
            "Yeah. I don't get motion sick when I'm driving, when I'm riding in my family car or when taking private hire cars like Grab. But the cab smell as well as some driver's habit of doing a tap dance on the accelerator pedal makes me nauseous, to the point I started carrying medicated oil with me.",
            "that is very weird indeed, hope it wasnt too bad",
            "furreals.\n\n\ntheres something abt taxis!"
        ]
    },
    "How did Koka manage to survive this long?": {
        "title": "How did Koka manage to survive this long?",
        "score": 52,
        "url": "https://www.reddit.com/r/askSingapore/comments/1dloibl/how_did_koka_manage_to_survive_this_long/",
        "content": "I decided to try a pack of Koka noodles, specifically my childhood favourite, the mushroom flavour. \n\nI was extremely excited bc I remembered enjoying this after school, a quick lunch fix for when parents aren't home, after which I would watch movies or play PS.. just going down memory lane. I was ready to awaken my inner child and going back to a time when things were easier, where my only responsibility was study.\n\nI took my first sip... It didn't taste normal. I thought, okay chill, maybe I'm just too excited and my taste buds are glitching. I bite into the noodles next. I got more confused. This tastes nothing like food. I still thought, it was a ME problem.\n\nI took one more bite\n\nAND IT GENUINELY SUCKED\n\nWho in the world actually enjoys KOKA or did I just buy the wrong flavour? Is it me? Because there is no way anyone in the right mind would actually enjoy this right? And if nobody enjoys KOKA anymore, how did it manage to survive until today?\n\nI'm going down to buy ibumie and Samyang now. I couldn't go past the third bite ",
        "num_comments": 37,
        "comments": [
            "Could be just you, there is a famous kkm stall in Bukit Panjang that uses koka noodles as its ingredient and is quite delicious. I’m sure many hawker stalls do the same thing, hence answering your question of how it manages to survive till now.",
            "It’s not just Koka. I noticed that alot of stuff I enjoy when I was young tasted either slightly or very different now. At first I also thought it was a me problem (nostalgia, glorified memories) but turns out the issue is the companies that changed the ingredients over the years. Abit of this abit of that substitute this remove that and voila. It’s probably very subtle for people that eat it every day but for people that have it in once in a long while it’s pretty obvious. Sadly things are just not the same anymore 😔",
            "same but with maggi noodles! i mean it’s not bad per se, but it’s not as good as how i remember it to be ><",
            "My personal favourite is the chicken fettuccine koka. Sadly it's rare to find it on shelves. The spicy Singapore (dry) one is also good. The mushroom one, however, suxxxxxxx",
            "Your taste buds and and gastronomy experience has changed. I tried a lot of stuff i used to like when young but it has lost the magic.",
            "omg i fkin love koka mushroom also, my childhood favourite",
            "I prefer the dry noodle series, the black pepper one is pretty good.",
            "Koka is a healthy instant noodle so the taste is definitely not the selling point. Some flavours are solid though. My staples are: (Purple range) chili lime, aglio olio; and (multigrain range) chicken, tangy tomato. Macros are really good and I don’t feel like crap after!",
            "have you tried the purple noodle range?",
            "Instructions on packet followed?",
            "in singapore, eat what the singaporeans eat: curry flavour",
            "alot of them its due to guanxi or connections and networking. for example for koka, the singapore navy and army buys the koka noodles. this makes koka a very profitable contractor.",
            "Maybe you miss the MSG taste.",
            "When you become an adult you forgot how to follow instructions. I also make the same mistake of not following packaging instructions and added too much water essentially diluting my laksa instant noodles and complain it lack taste afterwards. My wife promptly corrected me by showing me how it tastes like with the right amount of water and cooking time.",
            "Koka's secret to survival: nostalgic blindness and lazy college students.",
            "[removed]",
            "I think for some parts the ingredients/recipes used have changed over time. Sometimes to either make it more affordable or to simply prolong shelf life.\n\nThe second part is you're getting older, your taste changes. Coffee that is bitter is now enjoyable",
            "The experience you have with Koka I had it with Maggi, specially the light green chicken flavor. I used to rush home, cook 2 packs, add 2 eggs, then watch tv reruns, enjoying having the whole house to myself. \n\nThat was the late 90s. Some how my mum stop buying Maggi and the next time I try it was during covid. Like you I was excited but the taste is so disappointing. Noodles tasted different, msg tasted different, nothing close to what I remember 😭",
            "I can't imagine why anyone ever liked it or Maggie mie. I put it down to lack of knowledge of other products out there.\n\nI remember back before 2010 or so, Indomie was fairly unknown here and all the Singaporean kids swore by Maggie mie lmao.",
            "they change their formulation according to mass market taste.\n\nyes, they reduce Msg and salt due to health concerns feedback.\n\ni think only their bowls  havent changed in flavor in the between 2005 and 2023. but they have reduced a lot of the freeze dried garnishes (freeze dried chicken, crab(fish) stick) \n\n mostly, i buy plain instant noodles and create my own soup nowadays except curry.  its combining my meal prep leftovers  with the noodles. \n\notherwise its the cheapest packs of noodles add my own veggies and meats.",
            "They bake their noodles iirc and they go the healthier route - maybe that’s why? I do feel less guilty after eating but yea taste wise it doesn’t hold up as well 😆",
            "Anything other than Indomie is only for the uninitiated. Have some self respect and have nothing other than Indomie FTW",
            "Just stick with Maggie chicken and Maggie curry won't ever go wrong.",
            "Noodles are cheap to produce. Costs probably less than $0.10 to produce one pack that we pay a couple dollars for. And Tat Hui foods makes a lot of stuff.  This is one of their many products.",
            "Im still curious about the type of demographics that buy their range of \"healthier\" noodles which are air-dried etc.",
            "Most surprisingly is I find Koka at africa, tried it once and it is worse than local african food...facepalm",
            "Me. I'm a ytf koka noodle person. Haha. When I make packet noodles at home the family brand we use is CQYD but if the ytf stall says koka noodles I just get koka noodles lor\n\n\nIts ok what. Hahaha I can't tell the diff lol.",
            "This really hit me when I bought a pack of honey stars recently. It was my favorite as a kid, but my mum didn't buy it for us often because not healthy. Took one bite and almost cried (I'm pregnant and get sad easily), it was so tasteless.",
            "ur tastebuds basically change out every 7 years from what i heard so your tastes may change with it, on the bright side maybe something u didnt like will taste good to u now",
            "Their curry flavour noodles taste kinda watered down",
            "I love the purple range lol. Only the chili lime flavour.\n\nAgree that the texture is nothing close to Korean instant noodles but chili lime to me is quite dope.",
            "Your comment has been automatically removed because your account is relatively new or you have negative karma.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askSingapore) if you have any questions or concerns.*",
            "Wahh yeh Maggi really cannot these days. Pretty big different from the past when it was almost like staple food. Also tried buy back for the nostalgia. Tried one pack and gave up on the rest. haha",
            "less sugar, zero honey.",
            "ive only eaten the chicken flavour but yeah i agree. need to put v less water for it to taste nice, which sucks bc i love the soup",
            "I agree! I can't find back the taste I had when eating it as a kid!",
            "I don’t follow the instructions. I only add 100ml\nOf water to the soup mix in the bowl.\n\nI cook the noodles in a pot until just done and then scoop them into the soup. Is the only way I can get the noodles to taste like they used to as a kid. Maybe they reduced msg / salt?\n\nBut now I’m older also I sometimes just add stuff and omg I love Maggie curry noodles with kimchi now. Sooo good."
        ]
    }
}