{
    "r/AudioEngineering Shopping, Setup, and Technical Help Desk": {
        "title": "r/AudioEngineering Shopping, Setup, and Technical Help Desk",
        "score": 2,
        "url": "https://www.reddit.com/r/audioengineering/comments/1di4ign/raudioengineering_shopping_setup_and_technical/",
        "content": "**Welcome to the** r/AudioEngineering **help desk. A place where you can ask community members for help shopping for and setting up audio engineering gear.**\n\n*This thread refreshes every 7 days. You may need to repost your question again in the next help desk post if a redditor isn't around to answer. Please be patient!*\n\nThis is the place to ask questions like how do I plug *ABC* into *XYZ,* etc., get tech support, and ask for software and hardware shopping help.\n\n# Shopping and purchase advice\n\nPlease consider searching the subreddit first! Many questions have been asked and answered already.\n\n# Setup, troubleshooting and tech support\n\n**Have you contacted the manufacturer?**\n\n* *You should.* For product support, please first contact the manufacturer. Reddit can't do much about broken or faulty products\n\n**Before asking a question, please also check to see if your answer is in one of these:**\n\n* [Frequently Asked Questions](http://www.reddit.com/r/audioengineering/wiki/faq)\n* [Troubleshooting Guide](https://www.reddit.com/r/audioengineering/wiki/troubleshooting)\n* [Rane Note 110 : Sound System Interconnection](https://www.ranecommercial.com/kb_article.php?article=2107) \n   * aka: *How to avoid and solve problems when plugging one thing into another thing*\n* [http://pin1problem.com/](http://pin1problem.com/)  \\- humming, buzzing & noise \n\n# Digital Audio Workstation (DAW) Subreddits\n\n* [r/Ableton](https://www.reddit.com/r/Ableton)\n* [r/AdobeAudition](https://www.reddit.com/r/AdobeAudition)\n* [r/Cakewalk](https://www.reddit.com/r/Cakewalk)\n* [r/DigitalPerformer](https://www.reddit.com/r/DigitalPerformer)\n* [r/Cubase](https://www.reddit.com/r/Cubase)\n* [r/FLStudio](https://www.reddit.com/r/FLStudio)\n* [r/Logic\\_Studio](https://www.reddit.com/r/Logic_Studio)\n* [r/ProTools](https://www.reddit.com/r/ProTools) \n* [r/Reaper](https://www.reddit.com/r/Reaper)\n* [r/StudioOne](https://www.reddit.com/r/StudioOne) \n\n&#x200B;\n\n## Related Audio Subreddits \n\nThis sub is focused on professional audio.  Before commenting here, check if one of these other subreddits are better suited:\n\n* r/Acoustics\n* [r/Livesound](https://www.reddit.com/r/Livesound)\n* [r/podcasting](https://www.reddit.com/r/podcasting)\n* [r/HeadphoneAdvice](https://www.reddit.com/r/HeadphoneAdvice/) for all headphones and portable shopping advice\n* [r/StereoAdvice](https://www.reddit.com/r/StereoAdvice) for consumer stereo shopping advice\n\n*Consumer audio, home theater, car audio, gaming audio, etc. do not belong here  and will be removed as off-topic.*",
        "num_comments": 105,
        "comments": [
            "I recently bought the PreSonus revelator IO 44 (as suggested by a member of this community).  \nTrying to set it up however, I'm having issues with getting audio through.\n\nI plugged in everything, but the mic is not picking anything up.  \nI'm using a new beyerdynamic M90 Pro X mic, I have also tried with my old aston origin, but still no luck.\n\nDoes anyone have experience with the PreSonus revelator IO 44 and able to help me out?\n\n\n\nUpdate:\n\nI got the audio working now.  \nBut the audio is only in my left ear for some reason.\n\n\n\nUpdate 2:\n\nI got it working, turned out I was just using the wrong audio source.\n\nEverything is working great now... I think....",
            "Hi there! I'm using a Behringer U-Phoria UMC1820 with the purpose of recording on PC me and my friends chatting (I use Windows 11). I plugged the microphone, I downloaded and installed the drivers, I turned the Audio interface ON (of course), but for some reason no sound comes out of it from the headphones. I selected the mic output correctly because I can clearly see from the settings that the audio is coming out of it (the audio bar receives sound), and I tried selecting the playback as an OUT of the interface, but even if I select my own monitor as an audio output, I can't hear anything. I even recorded it thinking that perhaps I can't hear the sound at the same time, but nothing comes out of it, only a distant and very faint whistle. Any help..?",
            "So, I just got this new audio interface (scarlett focusrite solo 3rd gen) and was looking forward to making music with my electric guitar. When I plugged in my guitar, there's [this continues obnoxious static noise. ](https://soundcloud.com/user-139993194/noise)The static noise muffles down a bit If I press on the fret or turn the treble knob on the guitar to zero. Also, when I squeeze/hold the guitar cable jack, the static noise muffles down, which is really weird. I've looked everywhere and couldn't find any solution. Hope someone can help me.",
            "Hi, I'm new on this community but I already need help. Recently I've working on a sound sistem (if thats the correct term) and the amplifier looks to be from another world. Not that's extremely good but I just can't find any data from it. No manuals, no datashets, no website. Could anybody help?\n\nBrand: Stimmkundig\nModel: ga02-300",
            "Hello,\n\nI have a quite loud hum on my speakers, which are connected to my PC via a Scarlet Focusrite USB interface and an audio mixer.  \nThe hum is especially extreme when i play videogames that use a lot of resources.\n\ni got this Product recommended:  \n[https://www.amazon.co.uk/gp/product/B0BTVL6J4M/ref=ppx\\_yo\\_dt\\_b\\_search\\_asin\\_title?ie=UTF8&psc=1](https://www.amazon.co.uk/gp/product/B0BTVL6J4M/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1)\n\nWill this help me when i put it between the PC and the Audio Interface or is it wasted money?  \nAre there better ways to reduce the hum?",
            "I’ve been recording playing guitar and singing at the same time, and using two mics into an audio interface, but they but pretty much pick up everything regardless of positioning. I was wondering what decent mics (if any) in the $400 or below range have good off axis rejection. I wanted to be able to apply effects to the vocals without really messing up the guitar. I’m pretty novice to all this, so if this is a dumb question I’m sorry haha",
            "Hi everybody, I'm giving a hand in putting together an studio in a place that was like a podcast studio.  \nI'm tryig to come up with gear for this place, is aprox 18x12 feet and has a little recording booth of 8x5 feet.\n\nThe place already has a digital console, specifically a Behringer x32 and a bunch of RE20 Mics. The roof is trated with panels and the walls too, but it has some empty spaces that are producing reflexions.\n\nI'm trying to make an space for people to be able to record music or produce a podcast. I'm planning to have a midi controller, a good audio interface and a nice pair for speakers, the budget is not as limited, I don't need a 2000$ audio interface\n\nI hope you can help me. Thank you!",
            "Hearing protection rec's that only attenuate \\~10-15 dB and are for sure available in Canada? Looking for something that maintains great music quality too of course. Please let me know what and why you like it, thanks in advance!",
            "I've always had issues with lots of noise when using my Shure SM7B. It's never really been too much of an issue since I would just use the noise compressor filter with OBS, but l've recently started using it more for singing and the noise compressor filter loves to cut out a lot when holding notes. Because of this, I can't record with it, but if I don't use it I get constant and very noticeable noise. The microphone is quiet so l have to bump up the gain to 26 (which is the most OBS lets me) but ofc that bumps up the noise as well. I've tried combatting it in Premiere Pro and Adobe Audition with various filters and effects but they all have some very noticeable draw back like making me sound like I'm underwater or making the audio scratchy bc its too loud. A few months ago I saw something about the mic not being plugged in right, so I fiddled with it and plugged it into a few different USB slots in my desktop which helped but only the tiniest bit. My microphone also seems to be a lot quieter ever since then for some reason; I used to be audible but now every quiet sound effect like opening up a new tab seems to overtake my voice. I've tried using a cloud lifter, and maybe I didn't use it correctly, but it didn't seem to work. I haven't seen almost anyone with this same issue, and every video I see on it seems to work extremely well with no noise right out of the box. If anyone can help me, please explain your solution to me like you're talking to a 3 year old, as I have next to know knowledge about audio and different audio terms. I'd send a clip of what it sounds like but it won't let me attatch a video :/",
            "Hi friends, the time has come for me to expand the studio. I am currently doing 2.1 with KRK Rokit 5's and KRK 10S. I'm considering 5.1.2 or 5.1.4. I have questions. If you are kind enough to reply, please feel free to reply to any combination of these.\n\n1. Are there other brands of speakers that compliment the KRK Rokit's or ones that I should avoid due to different tonal characteristics? I've read I could just get an additional Rokit5 and turn it sideways for the center?\n2. Is there practical arguments to be made for or against in-ceiling vs on-ceiling speakers?\n3. My home office is 14' x 8.5' with 8.5' ceilings. Does this make it impractical to go for 5.1.4? FWIW, I will be here for at least 5 more years, if not more, and we own the space so holes in the ceiling are A-OK.\n4. I have an Audiobox 1818VSL I purchased in 2018 that I'm pretty sure is going to do the job here, but I'm open to looking into any other recommendations from y'all for a newer audio interface. I constantly switch between my Macbook (with 2 OP docks lol), PC (has SPDIF out, and 3.5 inputs for Rear, C/Sub, Mic in, Line out, and Line in), and my LG C3 42\" for reference and casual media watching.\n\nI am currently using a 15-year-old Audiobox USB and just moving the USB between PC and Mac when needed - it's not compatible with my TV but looking forward to better mixes when I finally get this 1818VSL set up in this space! That said, if there's an interface that I can just connect EVERYTHING to, I may decide that convience is worth the extra $$$.\n\nI'm probably forgetting a bunch of things but I'll leave it at that for now. Please help alleviate my GAS so I can start properly mixing for theaters and VR stuff. TIA!",
            "Hey, I'm a drummer, and I've been getting into recording myself play an acoustic set, plan is to upload videos of myself playing to youtube. Ironically, my biggest hurdle right now is finding bassdrum samples. I'd like to use an electronic kick and a trigger, but I'm having serious trouble finding good samples to use. For context, these are the songs I'd like to find good/similar kickdrum sounds for:\n\n\nAs Blood Runs Black - In Dying days/My Fears...\n\nDillinger Escape plan - Panasonic youth\n\nGojira - Flying Whales\n\nLamb of God - Walk with me in hell\n\nLorna Shore - Into the Hellfire\n\nMeshuggah - Bleed\n\nMudvayne - Dig\n\nSlipknot - Disasterpiece\n\nVeil of Maya - Mikasa\n\n\nI'm just not very experienced playing in metal bands, and I can't find the information I'm looking for on google. Any advice? Thanks in advance.",
            "Hi!\n\nI need some help into trying to get a decent recorded audio from [this mixer](https://www.manualslib.com/manual/15068/Behringer-Eurorack-Mx802a.html#manual) into a computer while reserving the main output for an amplifier.\n\nThe goal is to record the audio input from the microphones of conferences which have to be amplified in a room full of people at the same time of the recording.\n\nAs i said the MAIN OUT is connected to the stereo, and after doing some research i thought the most effective way to record the input would have been connecting the TAPE OUT (like the main out but with flat volume) of the mixer directly to the PC. The problem is it doesn't record well at all. It's still better than what we used before sometimes but, depending on the mic, how far one talks to the microphone etc the noise is still sometimes incomprehensible, even after high passing, compressing and normalizing loudness to -16LUFS in post production.\n\nI don't really know what i can do next, perhaps i should check the microphones (they are all pretty old) and the equalization on the mixer, but i'm not sure i might achieve a better quality if the TAPE OUT > PC isn't a good set up on its own. I would like to achieve a podcast level type of sound, not a super high quality, ultra crisp and clear sound, but just a nice sound that can be listened to comfortably for more than an hour.",
            "Hi, I'm after some suggestions on a new interface. I want something portable (fine if it needs its own power, but not rack mounted etc), with two mic channels but expandable via ADAT in case that's ever needed. I think the best I've found to what I'm after is the Audient iD14 MKII. I looked at the SSL2 but it lacks any digital input which is a shame (and I currently mix on headphones so would feel a bit annoying to have all that real estate on the top dedicated to a master monitor volume that I wouldn't necessarily use).\n\nSo, any suggestions that compare to the Audient iD14 MKII? Thanks!",
            "Hello Hello!   \nI am wondering which reference Level to use in my DAW ( Luna). Currently I am recording a Ribbon R1 MK2 in a Warm Audio 273 EQ Preamp going into an Apollo x8 interface. It gives me the possibility of choosing -10 or +4. My search in the manual of Luna has not been successfull so far. Happy understand more what this is about. \n\nAll the best and a wonderful day!\n\nCobi",
            "Can someone here help me with an audio interface \n\nI just picked up a A.R.T usbII 4in/2out from my local music store and I can't get it working right.\n\nSo my problem is cubase and its own monitoring pick it up just fine aswell as windows picks up the headphone out just fine but the line in so for xlr mics and guitars is not  getting any audio in anything other than cubase, so for example if I go to bandlab I can't hear my guitar/mic\n\nAny help would be appreciated I'm not sure if this is the right place to be",
            "DJI Mic 1 or DJI Mic 2 ? \n\nHello I want to buy DJI mic for my YouTube channel as upgrade from using iphone mic. I saw mixed reviews regarding the new version DJI 2 and it seemes to me that DJI 1 is way better when it comes to sound quality ?\nWhich one to buy from your experience \nThanks in advance.\n\nTl;rd which mic to buy dji 1 or dji 2 ?",
            "Hi there! I am setting up a basement studio from scratch where I can livestream playing along to music on my Roland e-drum kit.\n\nI have had trouble in the past with syncing the audio properly so that it sounds right IRL, and also once it is received by the stream. Usually there is some kind of delay in the audio, either on my end, or if it sounds right on my end, it is wrong when it hits the stream.\n\nWhat gear do I need to ensure I am able to:\n\n1. Record vocals, guitar, drums\n2. Livestream live E-Drums and music tracks simultaneously with no sync issues\\* (I have OBS and am familiar with typical streaming setups)\n\nThanks so much!\n\n  \n\\* I want to be able to pick a song, play along to it, and have it sound right/sync'd both in person and on stream.",
            "Hi everyone. Is there a sensible way I can easily switch between 3 studio monitors? I have a home studio and have just added a DJ setup in the same room to the left of my studio desk. Monitors A and B are to the left and right of my DJ controller, and Monitors B and C are on my studio desk. I.e. Monitor B is used in both cases. I want to easily switch between using monitors A&B as L/R when using my DJ controller, and then to monitors B&C L/R when I’m doing music production. I have a patchbay that would do the trick but I’ve read it’s not ideal to include a patchbay in my monitor path. I’ve thought about getting a monitor controller such as the Mackie big knob and then manually swapping monitor B between the outputs A/B. Is there an easier way I’m missing? Thanks for any advice.",
            "okay hopefully i can get some help here. so on and off i had this problem with the xlr mic i have had for about 10 months. it works fine most of the time but sometimes the mic will just have this random loud static for like half a second and i don't know what causes it. it has happened when i 'm recording a video in obs and sony vegas. strangely though i don't it ever happens while i'm streaming. i have looked around for solutions on youtube but it seems no one is talking about my problem. my only guess is maybe my xlr cord was just cheaply made as the mic i got came with an xlr cord so it's probably just an amazon basics one but i don't know. but i wanted to ask around before i buy another cord. anyways here's my set up.\n\nmic : mackie em-91c\n\naudio interface : ffine ampligame sc3\n\ni can't add a direct link but i do have a video where this problem happen thought out the video but it first happens around 0:48\n\ni have also asked another audio subreddit and someone said that i probably just need to buy another audio interface but i wanted to check one more place before i just buy a new interface.\n\n[https://www.youtube.com/watch?v=XjGE9woDzTI](https://www.youtube.com/watch?v=XjGE9woDzTI)",
            "Hey I want to purchase the Beats Studio Pros but I have the Blue Yeti as my Mic for the Computer.\n\nI understand you can either use the USB C cable or the 3.5mm Jack to connect. I want to keep my beats connected through USB C to my PC but there's also the option to plugging the headphones with 3.5mm jack to the Yeti mic and then the Pc.\n\nMy Main Goal is to have sidetones/Mic Monitoring so I wanted to ask which option was best. If I can achieve sidetones with USB C that's perfect but If I can only get sidetones through plugging into the yeti mic am I missing out on better audio from USB C?",
            "ls-208 vs re20 for a baritone voice in an untreated room?",
            "Basically, i want a CD player in order to play some tyler the creator CD's that were gifted to me for my birthday, i have a focusrite scarlett solo that i use for my mic and i was wondering if (cause i heard of someone else doing this) if i could get a cd player and wire it into my scarlett solo so i could hear it through my headphones cause cheap cd players have bad speakers, i just need something functional. i dont want the cd's to go to waste and i love tyler so might aswell.",
            "I have a Scarlett 18i20 USB interface. The volume curve response on the main monitor output knob on my interface doesn't make sense to me. I can still get it to acceptable level; but first 20-30% of turning it up is pretty much inaudible through the speakers and I can hear like a barely audible sound at 25% if I press my ear to the speaker cone, and my speakers are turned all the way up to +6. Around halfway it sounds fine and then gets louder very sharply so basically all the lower levels are unusable and the curve is just ridiculous. I don't understand the purpose of this at all for any producer or mixer. And does it sound like there is something wrong with my setup?",
            "Anybody knows how to undo in iZotope nectar?",
            "Hi. When I turn the gain all the way up on my audio interface's inputs, I hear a loud 50hz buzz (i'm in europe) that disrupts my recordings. I think it's got something to do with a ground loop. When I touch my macbook or the interface itself with my bare hands, the buzz gets quieter and almost disappears. Any advice on how to get rid of it? Thanks a lot",
            "Hi, i found an old Philips home theatre at home but the AV is damaged, and the speakers + subwoofer have their own plugs/connectors, can i cut these and get a regular amp/av and connect the cables directly? And do i need an AV with 6 entries/connections (5 speakers + Sub) or any with enough W and less entries will work the same?\n\nThank you!",
            "Audio Interface has ton of issues\nI have a V8X Pro Audio Interface, and it started having these weird issues after two weeks;\n\n\nThe audio goes all weird, rippley and broken after the battery discharges past a certain point. It's only when hearing the audio, it doesn't get recorded by my computer that way, and it restablishes itself after I turn it off/on again.\n\n\nThe microphone volume knob is not linear anymore, rather it goes in steps of like 20% until mute, with a soft crackle every time it changes. It used to be smooth.\n\n\nThe console has a \"Sing\" option where you can have effects on top of the voice, most notably Reverb and Bass/Treble modulation. Now the knobs do nothing when turned, and it just works on no reverb all of the time.\n\n\nToday is my last day to give it back, but in case they don't take it, I post it here to fix it myself in case I need to.",
            "I run a small sound system:\n\n* 2x Soundboks 3 Tops\n* 1x ELX200-18SP 18\" Subwoofer\n* Behringer FBQ800 MINIFBQ Graphic EQ\n* Audio from: XDJ-RR\n\n**Signal Path:** XDJ -> FBQ800 -> ELX200 -> Soundboks\n\nOur events are multigenre, mixing older tunes and varying genres. Everything is battery-powered, and we walk the gear into local woodlands, so low weight, low power draw, and small size are important, as is cost.\n\n**Issues:**\n\n1. **Loudness Matching:** The XDJ's dB meter is good, but we need a consistent readout of perceived volume. The TC ELECTRONIC Clarity M looks ideal but costs £260, and needs an optical converter. It draws 6W, which is fine but lower would be better.\n2. **DSP/EQ:** The Behringer FBQ8000 EQ is okay, but my unit's connections are dodgy (need to open and solder/fix) and its outputs are unbalanced. I’m considering a small programmable EQ. I have a Focusrite Scarlett Solo but prefer not to take a laptop into the woods.\n\nI love the 9 bands and +-12dB range on the FBQ800, which sits at the front of the DJ table for easy tweaking. I considered the Douk Audio T8 PRO for its XLR in/out and sexy tubes, but its 25W draw and +-6dB range aren’t ideal.\n\n**My Research/Guess:** Sticking with/fixing the FBQ is the easiest option.\n\nThe 'best' improvement might be using a laptop to monitor loudness and set EQ, perhaps with a MIDI controller for easier EQ control. Maybe use a phone as a small monitor to see loudness and EQ bands with the laptop closed (laptop might draw 25W? Ryzen 4800H, no GPU). But this is complex.\n\nA higher cost option is buying the Clarity M with an optical converter.\n\n**Summary:** I’m looking for suggestions on a small, low power, in-line EQ/DSP and loudness meter. Maybe a Raspberry Pi with a small screen? I'm open to DIY if anyone has suggestions!",
            "I just got a subwoofer (JBL LSR310S) and have found that my audio has started dropping out randomly. My audio interface (Focusrite i818) will suddenly stop working and I'll have to turn it off/on in order to get it working again. No static or noise pop, just silence. Never happened before getting the subwoofer.\n\nThis mostly happens when I'm producing music, found it happens most commonly in Ableton.\n\nThe audio interface is connected to the subwoofer via 2x TRS cables. Each speaker is connected to the sub via an XLR cable.",
            "# Focusrite Octopre to PreSonus 1824c with Mac - Tons of hissing, static, video game sound noise on both monitoring and playback\n\n  \nHi there!\n\n\n\nI've scoured the Googles and I'm dumbfounded to see this combo hasn't been mentioned very often but I'll try to be as concise as possible here. I just purchased the Focusrite Octopre 8 channel mic preamp and hooked it up via ADAT optical into my PreSonus 1824c audio interface via a MacBookPro going into the Studio One 6 DAW.\n\nI'm tracking drums, so I'm using 8 channels from the Octopre and 2 channels from the 1824c. My IEM are connected to the PreSonus 1824c 1/4\" headphone jack.\n\nI've set the Octopre's clock to \"Internal\" at 44khz, set the PreSonus 1824c to 44khz via Universal Control, and have set the Mac Audio Midi Setup to 44khz with both Input and Output. (Side note, when I attempt to do all of these at 48khz, Mac's Audit Midi Setup auto-switches this back to 44khz for some reason.))\n\nMy problem here is that, when I start up Studio One and play back audio that I've recorded, it sounds like those super old NES game audio. I can get this to go away by closing Studio One entirely, then reopening - which temporarily it stops. (However, there still exists some unwanted audio artifacts.)\n\nThe best case scenario here is that when the 1824c monitoring volume is about at 12 o'clock I hear this faint hissing in the background, the recorded audio sounds fair.\n\nWorst case scenario is that the both the straight monitoring of the mics (via drum hits) sounds like blown out speakers for each drum hit. And then during playback it sounds like super old NES music.\n\nI'm at a loss here. When I was using the 1824c by itself, it was totally fine. No hissing when the monitor volume was up, no weird NES sounds from the mics etc. everything was totally solid.\n\nSince I've hooked up the Octopre it's been a nightmare and I don't know what to do.\n\nLast thing I'll say and then I'll shut up is that... It's FRIDAY and I just want to make some music and I'm in fetal position crying because everything sounds like garbage, and both Focusrite and PreSonus support isn't open until Monday.\n\nPLEASE HELP (and hopefully this helps any future travelers!)",
            "Suggestions about this recording setup\n\nI plan to utilize the PreSonus StudioLive Series Ill 32R Digital Rack Mixer as a stage box to streamline instrument connections without relying on long cables. Instead of implementing AVB, my approach involves placing a mini PC near the mixer and connecting it via USB. Subsequently, I aim to wirelessly connect a laptop to this PC using a router. My intention is to employ Parsec for remote desktop access via LAN due to its minimal latency of only 7ms.",
            "Hey everyone,\n\nI have inhereted some gear and I'm not sure what I should keep and what to sell. I'm a total noob. However I own a guitar and have recorded some stuff years ago. At the moment I am getting into playing piano, I own Logic Pro and am trying things out, watching videos about sythesis etc.\n\nNow, I have some interfaces and am not sure what to keep and what to sell. I have a Focusrite 2i2 (2. Gen), an Ultralitemk3, and Ultralitemk5 and a UR22mkII. Is it correct that the Ultralitemk3 can do everything the others can and I should keep that one just in case I need a good interface for the piano, guitar, mic etc.?\n\nThank you for the help!",
            "Need some help with audio when live streaming for my church \n\nHi everyone, I have a massive issue. Whenever we are live streaming for our church, the sound quality is terrible. There is static/cracking sounds from the stream. We usually stream on Facebook and use OBS which connects to the ALLEN&HEATH Qu-24.\n\n[I have attached some images to show you a glimpse of the setup.](https://imgur.com/a/TfOAbfE)\n\nAll advice is welcome",
            "**System Info**\n\nLenovo ThinkPad T16 Gen2, 13th Gen intel i7-1355U, Windows 11 Pro version 23H2, build 22631.3737, 32GB RAM\n\nHi there, I'm having severe audio playback problems with windows 11 over my Komplete Audio 6 MK2 USB interface. I had a windows 10 laptop that I used with the interface for years, and I never had any problems. The setup is simple - the KA6 is connected directly to my ThinkPad via USB, there are no other devices attached.\n\n**Problem**: \n\nI'm getting intermittent audio playback distortion over my laptop with my interface. It is a fuzzy digital distortion that sounds very much like a bit crusher. Very similar to the distortion problems described by other users having problems with Windows 11. I finally ran LatencyMon, and there are several drivers that are presenting absolutely stratospheric latency values, even when NO audio is being played over the device output. These values seem to get better if I unplug my USB interface from the USB port, but I still get a message saying that my system isn't set up to deal with real-time audio processing.\n\nThe following drivers are presenting problems in LatencyMon: \n\nDrivers Tab:   https://imgur.com/oknTd4R\nMain Tab:  https://imgur.com/a/PlYP26I\n\nLatencyMon message: \n\n''Your system appears to be having trouble handling real-time audio and other tasks. You are likely to experience buffer underruns appearing as drop outs, clicks, or pops. One or more DPC routine that belong to a driver running in your system appear to be executing for too long. Also, one or more ISR routines that belong to a driver running in your system appear to be executing for too long. At least one detected problem appears to be network related. In case you are using a WLAN adapter, try disabling it to get better results. One problem may be related to power management, disable CPU throttling settings in Control Panel, and Bios setup. Check for BIOS updates.''\n\nHow can a network adapter be the problem? This isn't a reasonable solution, as I also use audio applications while surfing the internet, like Youtube, Spotify, etc. Am I expected to simply sacrifice the ability to watch anything while on the internet while playing audio?\n\n**I've tried**:\n\n- reinstalling USB interface drivers several times, rolling back driver\n- changing the ASIO buffer size, changing sample rate, and bit-depth\n- updating window several times\n- updating system through Lenovo automatic update on the website\n- gone through every possible tweak setting for optimizing audio in Windows 11\n- tried different power and battery settings\n- tried all updates and troubleshooting audio through Lenovo Vantage and Commercial Vantage\n- checked BIOS update \n\n**What I've found**:\n\n- messing with USB device ASIO buffer settings seems to solve the problem temporarily while distortion is happening\n- changing output settings from USB device to laptop speakers, then back to USB output seems to work temporarily\n- opening Lenovo Vantage seems to have an effect on when distortion starts (I opened Vantage and distortion immediately started)\n\nI also found that something might be wrong with my battery settings, as Smart Charge over Lenovo Vantage settings seem to change randomly, without having changed anything. Battery was set to stop charging at 85% and resume at 75%, but it was stuck at 84% even though the settings were applied. It's also worth pointing out that I encountered a weird error in Lenovo Commercial Vantage, saying that one of the battery driver was missing. I tried installing the driver manually, and got a message saying that all drivers were already up-to-date. The message eventually disappeared, and now the battery issues continue, were the battery level just stays at ''fully smart charged'', even though it's supposed drain until it reaches the lower threshold, then charge back up.\n\nI found forums where people are saying this might be a CPU problem related to core configuration, however, this is beyond my expertise and I'm afraid of messing up my laptop even further. I've run out of options and feel like I'm on a wild goose chase. The laptop is brand new and I shouldn't be having all these issues playing audio over an USB interface. What are my options? The folks over at Lenovo suggest downgrading to Windows 10 (suggested by Lenovo Support), but this seems like an unreasonable solution.\n\nAny help is much appreciated, as I've hit a brick wall. I am deeply frustrated, as nobody seems to have a solution that doesn't involve doing something crazy, like downgrading, or tweaking CPU settings, which seems risky.\n\nI'm almost throwing my laptop out the window and buying a mac :)\n\nThank you!",
            "Are iLoud Micros still the best in their class?\n\nI've been eyeing the iLoud Micros for years, and now that I have a proper job, I can finally afford them. When I last checked a few years ago, they were pretty much unrivaled as small form active monitors --or rather consumer+ grade speakers that can also be used as monitors, especially if you're okay with mixing on headphones and/or can't do acoustic treatment, which I am.\n\nThat said, there's a huge price difference between the Micros and their competitors: budget offerings from PreSonus, Behringer, Swissonic that can also be used as desktop speakers in their 4\" form, priced between €100-175. Edifier MR4 has great reviews&measurements and goes for €99, there's also competition from JBL 104 for \\~€200, KRK GoAux 3\" for €190, even Yamaha has 3\" (€230) and 4\" (€270) models still cheaper. Current common price for iLoud MM seems to be €299, but it looks like IK may go for another hike as it's €350 on their store. I don't remember the price difference being anything like this before, feels like the competition got cheaper and more diversified while Micros got more expensive.\n\nMy main problem is that the reliable sources for reviews are still heavily focused on high-end, while most recommend iLoud MM as the bare minimum/small form option, they're outdated and do not account for the iLoud price hike, and Yamaha/KRK have weirdly no reviews. From what I've gathered, it looks like Edifier MR4 provides the best value (maybe even the best quality compared to budget monitors) at that size/price point, but cannot reach to iLoud for sound quality. JBL 104 also underperforms, so does KRK GoAux 3 (literally just 1 review), but no comparisons exist for Yamaha HS4.\n\nI'd greatly appreciate if anyone can offer any thoughts or resources on this!\n\nNotes for autorepliers:\n\n* I know headphones are the best for untreated mixing, I already do this, this will be for complimentary listening and multimedia use, I still heavily favor a flat sound profile.\n* JBL305P MK2: yeah they're great for price, but I definitely do not have the space for them. No Swan, Vanatoo or Kanto either, not available/cheap in Europe.",
            "I’m going to be going into college next year for music production, I want to have a strong enough device that will last me a long time, that i can use professionally. I was looking at the 16 inch m3 max 64 gb ram 1tb hard drive, would that be overkill?",
            "I run a high end home studio, and am often recording my remote drum tracking setup (8 microphones), as well as my synths, guitar amps, live acoustic guitars etc. Given the capabilities and I/O of the Audient, obviously everything is not patched in at the same time. I also despise Audient drivers and their mixer. That is just my setup when I’m producing by myself. \n\nI plan to move the studio into a bigger space this fall, where I will be doing bigger sessions (4-5 piece bands, writing sessions, etc). In order to do this, the Audient needs to go. I’ve heard nothing but great things regarding RME and their drivers, but am also thinking I will need more mic pre’s than the UFX II offers. My budget is ~$2000 (I have a UFX II lined up on Reverb for $1700 + taxes/shipping), but I’d also like to purchase Ableton 12 suite for the studio. I’d love some input on this decision, as well as possibly other options/routes that could be effective for my space! I should add that my monitoring setup is dialed, so upgrading to a high end interface seems to be the next best call. Any opinions are welcome! Thanks!",
            "WiiM Mini sucks!!!\n\nBeen fighting with this since last year. I can connect to it on android and iOS. Here’s what’s happening:\n\n1.  When on iOS the music will intermittently stop/play.\n\n2. Something really strange is I can play all my saved stations except one of them doesn’t play music at all when all the others do, (tried rearranging the station order/deleting and adding back). I can play this station through iHeart or online but not through the app. (Android & iOS)\n\n3.  On android, connecting to WiiM is intermittent. Sometimes it works right away and other times I have to reconfigure it.\n\n4.  Once connected on Samsung android I loose all control of the WiiM after the music starts. Can’t change volume or channel. I have to physically go inside to the WiiM device to change the volume or turn it off/reboot to change the channel. Closing and reopening the app does not fix the problem.\n\nWTF is going on??\n\nAnd fyi, on android the music never skips.\n\nI’ve tried 2.5 and 5G bands. I’m on a mesh network and have the proper settings for that.\n\nI’m ready to take a f*****g hammer to this g** d*** piece of shit!",
            "Hi,\nI have some trouble understanding the huge price range of microphones. On the one end, there is, for instance, the AT 2020 which costs like 80-90€ and, afaik, has been used in professional audio production that hit the charts (I think, there first album by Billie Eilish had the vocals recorded with one of these...).\nI totally understand what the a piece increase up to 10x gets you. Pads, filters, flexible patterns and audio probably better built quality and a better capsule. The LCT 640 would be an example here. \nBut what justifies the price for something like a U87 (2,5k€) and then a U67 (7k€). What parts make these so expensive? Or do they just have the electronics so well figured out that they deliver a superior frequency response characteristic? Something else? \n\nTo be clear: I'm not looking to buy a mic, I'm very happy with my AT2020. I can understand that there are settings in which the extra features of lewitt come in handy. I'm just interested in understanding what makes the difference above that price point. \n\nThanks in advance!",
            "Thats USB power noise - try a powered USB hub with a decent power supply. Theres a troubleshooting guide above if that fails.",
            "If its USB power noise then probably (if you use a decent power supply with it), but so would any other powered USB hub",
            "What kind of mic are you using atm? What kind of sound are you looking for? What is your voice like?\n\nIs recording them separately an option? Record the Guitar and then record yourself singing to it in your headphones?",
            "I'd recommend looking at stereo pair mics, you can probably find them for less than $400 second-hand, those are good for off-axis concerns. You can use them facing away or place them close to the chosen instrument to get the desired effects.\n\nIf you're doing effects post-recording, not looking to do live effects, I would experiment with recording vox and guitar separately over a performance track of both.",
            "The problem is your audio interface -= what are you using?",
            "The problem with using one sample is its one sample - every kick sounds different. Modern sample libraries will have up to a dozen samples for each velocity layer they rotate through, and a dozen or more velocity layers. They also have tuning for the drums, the micing, etc etc, so you can really fit them into your kit/sound\n\nI use and love NI Drummer series because i have a bunch of NI hardware (id probably reach for 80s drummer black or modern drummer white) [https://www.native-instruments.com/en/products/komplete/drums/abbey-road-drummer-collection/](https://www.native-instruments.com/en/products/komplete/drums/abbey-road-drummer-collection/)\n\nbut the near universal advice i see is ToonTrack Superior Drummer 3. [https://www.toontrack.com/product/superior-drummer-3/](https://www.toontrack.com/product/superior-drummer-3/) EZ drummer is a simplified version with less control [https://www.toontrack.com/product/ezdrummer-3/](https://www.toontrack.com/product/ezdrummer-3/)\n\nGetGood Drums would be another great option. (theyre also avalable with NI hardware integration [https://www.native-instruments.com/en/products/nks-partners/get-good-drums/invasion/](https://www.native-instruments.com/en/products/nks-partners/get-good-drums/invasion/) if that matters)\n\nFWIW drum triggers are just piezo mics, once you have some sort of drum brain you can go kinda nuts with what you attach to it.",
            "Man those things are legendary for terrible quality, and i'm honestly surprised any still work (Behringer quality was awful 20y ago). Terrible memories.\n\nThe thing you would need to record with any quality is an audio interface, and if your gonna gte 2 channels you might as well just get 4.\n\nThese days you can buy a studio grade 4 channel interface/mixer for $160 [https://www.thomannmusic.com/evo\\_8.htm](https://www.thomannmusic.com/evo_8.htm), or have 5 busses, 8 analog channels and another 16 on ADAT for $460 [https://www.thomannmusic.com/evo\\_16.htm](https://www.thomannmusic.com/evo_16.htm)\n\nSave yourself some pain and consign that thing to awful memories.\n\nI have Behringer Synths and Pedals i use every day, but those things literally bring me a shudder.",
            "If you are looking for ADAT expansion you will regret not having ADAT out to provide sync to the other interface. And no theres not really anything that bests the Audients for value, i went for the Evo16 (about the cheapest thing with dual pairs of ADAT I/O) for my studio hub, no regrets.",
            "+4 is pro audio, -10 is consumer audio\n\nBut iirc the x8 has even higher reference level.",
            "Dude. Just buy a class compliant audio interface and a decent mic. Audient Evo 4 is $105 at thomann and you can use a decent mic. \n\nAnd FWIW with them attempting to ban DJI drones in the US atm i would probably give them a miss just in case",
            "If you play both the track and your midi instrument in a DAW then it should take care of latency compensation for you.",
            "Yeah thats a audio interface issue.\n\nCan i recommend checking out the Audient Evo4 for $105 at Thomann? You are also clipping and its smart gain feature can save your sound. It also has loopback to feed an app back to your stream. The Evo8 at at around $160 adds a second buss that lets you listen to different audio to your stream (as well as 4 inputs - say a mic, an instrument and stereo from your phone for instance).\n\n[https://www.soundonsound.com/reviews/audient-evo-4-evo-8](https://www.soundonsound.com/reviews/audient-evo-4-evo-8)\n\nI reckon you would also love a decent mic. The sE Elcectronics v7 goes for about $90 and would be my normal recommend for a poor space with their very tight pattern and good background rejectino [https://www.soundonsound.com/reviews/se-electronics-v3-v7](https://www.soundonsound.com/reviews/se-electronics-v3-v7)\n\nBut even nicer would be the BeyerDynamic M90X, i couldnt resist adding one to me locker for $150 US down from $380, might grab another - also a really tight pattern for poor spaces, but sounds like an NT1 or KSM32 [https://www.youtube.com/watch?v=pQqolpbbqKk](https://www.youtube.com/watch?v=pQqolpbbqKk) [https://www.amazon.com/beyerdynamic-Addressed-Condenser-Microphone-Storage/dp/B096LC5SR6/](https://www.amazon.com/beyerdynamic-Addressed-Condenser-Microphone-Storage/dp/B096LC5SR6/)",
            "Just buy a USB CD/DVD drive dude\n\n[https://www.amazon.com/ASUS-Cable-Storage-Interface-Compatible-SDRW-08V1M-U/dp/B0B6D8XB74/](https://www.amazon.com/ASUS-Cable-Storage-Interface-Compatible-SDRW-08V1M-U/dp/B0B6D8XB74/)\n\n[https://www.amazon.com/LG-Electronics-Portable-External-GP65NB60/dp/B00ODDE33U/](https://www.amazon.com/LG-Electronics-Portable-External-GP65NB60/dp/B00ODDE33U/)\n\nSend the data digitally to the Focusrite over USB for the best quality.",
            "I have a Scarlett 18i8 and mine works just like this too.  Just like faders on a mixing board, you can make finer adjustments in the middle to higher up on the knob.  I believe this is intended behavior, although maybe Focusrite doesn't put a ton of effort into fine tuning it since it's a relatively budget product.\n\nMy solution is to keep the monitor output in the Focusrite Control software at -10 dB to -20 dB so that I can use the physical knob mostly in the middle 35% - 75%ish area.  You could also buy an external monitor controller.",
            "Hey - theres a round loop section in the troubleshooting guide above :)",
            "Thats not worth keeping dude. Wont even have ASIO drivers.\n\nIf you want a cheap interface with FX inc reverb, these arent amazing but theyre cheap, and do work [https://www.presonus.com/en-US/interfaces/usb-audio-interfaces/revelator-series/2777700303.html](https://www.presonus.com/en-US/interfaces/usb-audio-interfaces/revelator-series/2777700303.html)",
            "These arent great interfaces, but they have 2 mic channels (one for a headset/electret mic, one for an XLR mic). a line in for a DJ mixer, and more importantly effect processing on all the channels, inc paeametric EQ and compression. Can be controlled form a phone or laptop and takes a few watts. For the price i grabbed oene knowing it wouldnt be amazing for mic recording, but it would be fine live\n\n [https://www.storedj.com.au/presonus-revelator-io44-usb-c-audio-interface-w-integrated-mixer-effects-and-stream-mix](https://www.storedj.com.au/presonus-revelator-io44-usb-c-audio-interface-w-integrated-mixer-effects-and-stream-mix)\n\n[https://www.presonus.com/en-US/interfaces/usb-audio-interfaces/revelator-series/2777700303.html](https://www.presonus.com/en-US/interfaces/usb-audio-interfaces/revelator-series/2777700303.html)",
            "Does it stop happening if you go back to direct connected to the speakers? it kinda sounds like you have developed an issue with teh interface, or its drivers.",
            ">I've set the Octopre's clock to \"Internal\" at 44khz, set the PreSonus 1824c to 44khz via Universal Control, and have set the Mac Audio Midi Setup to 44khz with both Input and Output.\n\nThis is likely your issue. One needs to be master and the other slave. Ideally you use 2 optical cables, set the unit not directly connected to the computer to slave, and the unit connected to the computer to master so you can control sample rate as needed.",
            "The Ultralite Mk5 its by far the most valuable/useful - it has ADAT which the Mk3 (which i have, among others) lacks. That means it can connect digitally with up to 8 channels to another interface/expander. Also means if someone brings round their machine with ADAT/SPDIF out they can just plug in and jam which is really cool. Also has better pre-amps than the mk3.",
            "can i suggest giving ProcessLasso a shot? Exclude your DAW from probalance and it will make sure it keeps priority. Also set it to automatically enable high performance for your DAW. Windows does a bad job of prioritizing workstation tasks. [https://bitsum.com/](https://bitsum.com/)",
            "Dude its just physics, small speakers cant acoustically couple bass properly, & the area driven increases with the square of the diameter. The enclosure volume also directly corresponds to the ability to bass couple. Ur gonna need a sub at a min.\n\nI use the Presonus Eris E5 gen 1 in my home studio, theyre nuts for the money ($180 a pair these days, were already great value at $300 a pair when they came out) but i have to check bass on my big system (4x100W bi-amped dual 6\" mains, effectively acting as one large driver for bass, with tweeters between, but towers with concrete bases, DSP room correction in-amp) cos even they wont couple the sub frequencies properly with any power on the desk in that small an enclosure.\n\nYes, theres ways round it, but they take power and processing to get round it and that isnt that cheap.",
            "I presume youre talking about an Evo16, if so use it as an ADAT expander for the UFX , then you deal with the RME drivers.",
            "this is so far off topic for this sub i',m not even sure where to refer you, maybe r/podcasting",
            "The AT2020 is an awful mic, bright, brittle, lacking bass & transient clarity. Its a mid diaphragm electret and very cheap to make since it doesnt require the circuitry of a true condenser. The mic doesnt make the performance, if you know what youre doing you can fix just about anything (but its a lot easier not to have to), and sometimes you just arent looking for a good mic",
            "Okay thank you! I never even thought of recording it over a performance track. Thats such a good idea",
            "i’m so sorry i have no idea what that is 😭\ni just looked it up and i don’t have anything like that\nthe microphone is just plugged into my computer 😭 is that the issue \nim so sorry 😭 i know nothing about this stuff",
            "Thanks for the great reply. I do think they're expensive but I can try the trial versions at least as soon as I'm ready to record. Bit of a downside of all that software is that I'm mostly just interested in a handful bassdrum samples right now.",
            "Thank you very much for taking the time to answer my question.\n\nI didn't know they had such a bad reputation but that's good to know it's not just my terrible \"audio engenineering\" skills ahahah\n\nI think i am probably going for something like the Behringer 404HD and use it for my guitar as well, i spent too much time trying to make that mixer behave properly...",
            "Interesting, thanks!\n\nWhat if I wanted to play the music track from Spotify or something similar?",
            "Ah dang okay. Also were you talking about the clipping feature with the evo4. Or were you saying my mic was clipping I can't remember what I saw with audio levels but Im usually always in the yellow at worst I might hit 3 or 2db but I don't think i ever really hit the red since I have a pretty quiet voice. Maybe I made the filters in obs a little bit too harsh lol.",
            "That makes total sense about setting the range in the software! Great advice thanks!",
            "I live in Argentina, it's the best I can get with my money and it does exactly what I need to do. It doesn't need drivers, it being plug and play is perfect for what I do. Just use it to chat and control volume remotely, and sometimes have some fx when I record myself reading or singing.\n\n\nI don't want anything fancier or newer, I just want to fix what I got.",
            "Thanks for the info! So you would say I can keep the mk5 and sell the rest?",
            "Here's a sneak peek of /r/podcasting using the [top posts](https://np.reddit.com/r/podcasting/top/?sort=top&t=year) of the year!\n\n\\#1: [Podcasts about tech and the future of tech](https://np.reddit.com/r/podcasting/comments/16e41dk/podcasts_about_tech_and_the_future_of_tech/)  \n\\#2: [Best Transcription Service?](https://np.reddit.com/r/podcasting/comments/134ks1m/best_transcription_service/)  \n\\#3: [The Most INTENSIVE Beginner’s Guide to Microphones](https://np.reddit.com/r/podcasting/comments/12vsdc8/the_most_intensive_beginners_guide_to_microphones/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
            "That was not really the question, was it? I specifically wrote that I understand what a 10x increase (and thereby anything in between) up to about 800€ buys you. What I'm curious about is the next 10x step.",
            "Yes, thats the issue. You need an Audio interface with a GOOD mic preamp for an SM7. \n\nMaybe check out the Audient ID4, unbeatable quality for $125  [https://www.soundonsound.com/reviews/audient-id4-id14-mkii](https://www.soundonsound.com/reviews/audient-id4-id14-mkii) [https://www.thomannmusic.com/audient\\_id4\\_mkii.htm](https://www.thomannmusic.com/audient_id4_mkii.htm) \n\nThe Evo4 is a little cheaper at $102 and supports 2 mics, and is also transparent (but wont looks as pretty with your mac, lol) [https://www.soundonsound.com/reviews/audient-evo-4-evo-8](https://www.soundonsound.com/reviews/audient-evo-4-evo-8) [https://www.thomannmusic.com/audient\\_evo\\_4.htm](https://www.thomannmusic.com/audient_evo_4.htm) \n\nMost other interfaces in their class wont handle the SM7B well",
            "Yeah, but how much is your time worth? As you have kinda discovered, you can sort through hundreds of thousands of free samples trying to find ones that fit, or grab a library or 3 that suit your style and then tweak a few knobs to fit the mix.\n\nI dont really know an inbetween atm, at least for acoustic drums.",
            "Please consider the Evo8 over the 404HD, its vastly superior in every way, and much easier to live with driver wise. [https://www.soundonsound.com/reviews/audient-evo-4-evo-8](https://www.soundonsound.com/reviews/audient-evo-4-evo-8)",
            "Run it through your DAW if you can - again, use its latency compensation\n\nDo you have an interface with loopback that can do that? loop the output of an app to an input?",
            "Good luck writing drivers for it? Sorry i cant help :)",
            "If ur a muso u will probably regret not keeping one of the pocket interfaces, or both. Neither are great but theyre only gonna bring 40 or so used at best, and theyre handy to have just cos computer audio is so slow. Chuck a guitar in one channel, a mic in a second, and play midi keyboard and you got yourself a jam (thats my laptop/streaming table setup - crappy Presonus io44, similar to the URII but with a DSP - on sale for 80US atm).\n\nI'd also consider if a few hundred you would get for the mk3 (i got mine for $250AU from a mate, probably worth 2ce that) wouldnt bring you more joy as a Jam setup for your lounge (thats what my Mk3 does these days now i have interfaces with ADAT in the studio).\n\nNormal (windows esp) drivers just arent fast enough to pass audio through for monitoring when ur playing music live.\n\nAlso worth noting MOTU tend to support their interfaces a LONG time, so that Mk5 especially should have a long life (its amazing they stil support the near 15yo mk3)",
            "Another thing to note is if you get a decent turntable, one of the best ways to record from it is a special balanced cable direct into a decent mic pre (like the ultralite), and then do the RIAA equalization correction in the PC. The cables are stupid expensive frm audiophile places, but would cost $20 to make. This is one of my 'round tuit' things, and another reason the mk3 is in the lounge",
            "Incredible manufacturing precision that means any 2 of them sound near exactly the same.",
            "okay thank you 🙏 \ni’ll give them a try",
            "I don't have any interface at the moment, but am planning on picking one up. I will keep an eye out for one with that capability.",
            "I fully believe it's a soldering issue, I'm not stranger to that at least--",
            "I think I see your point. Thank you for all the info. I think will sell the mk3 and keep the rest.",
            "Ok. But how many people could actually tell apart 2 or more 800€ mics (same model obviously) in an a/b test? Even in dry recordings?\nAnd how many times did you listen to a song and thought: \"oh man, I wish they had recorded those vocals using a U67 instead of a U87 or LCT 640.” (assuming you had no idea of their actual gear?",
            "Not having an interface is half your latency issue. \n\nThe Audient Evo8 would be hard to beat [https://www.soundonsound.com/reviews/audient-evo-4-evo-8](https://www.soundonsound.com/reviews/audient-evo-4-evo-8) \n\nThough the Prosunus Revelator IO44 would get you out of trouble and is $80 atm [https://www.presonus.com/en-US/interfaces/usb-audio-interfaces/revelator-series/2777700303.html](https://www.presonus.com/en-US/interfaces/usb-audio-interfaces/revelator-series/2777700303.html) but it definitely has noise issues with some dynamic mics, and presonus support sucks, but the voice effects are pretty cool",
            "I'm just a Mechtronic Enginnering Technician, but it sounds like a design issue to me - needing to reboot points to a firmware/DSP issue, or possibly losing driver sync.\n\nSeriously dude, return it and buy something used. Theres just no case where something like that is worth it. If you can be bothered to tell tell me what you can find for the same money, i'll help choose something better",
            "I hope they bring you some fun, and some good memories of whomever thought of you when they left them to you.",
            "its not about telling apart, its about matched sets for multichannel, and about engineers and artists being able to go from studio to studio, across the hall or across the world, and get identical results reliably. In general the best gear is the gear you know like the back of your hand.\n\nIf youre talking about the difference between the U67 and U87, they both have the incredible manufacturing tolerances, but the U67 has a complicated valve pre-amp that runs at hundreds of volts and hand wound transformers, the U87 is a FET with simple to make cct. With either you definitely pay for the Neumann name and heritage manufacturing techniques. (Honestly something i dont have a need for, personally)",
            "I cannot return it anymore. Yesterday was the last day for me to do so, but I kept searching around for technicians and eats to fix it, since I really don't want another one.\n\n\nI don't have enough money to buy another one, even if used, and nor am I planning to sell this one in this condition, so to fix it it is.",
            "Ok, I'm already getting smarter, thanks! \n\nBut what I still struggle with is: you say, they need to match in a multichannel setting and when switching studios. I get that. But if one cannot tell apart two of them in an a/b test (maybe you can, but most people cannot), isn't that a contradiction? \nAnd, assuming that also 800€ mics are quite well built, wouldn't other differences in the setup across studios (preamps, converters etc) have a higher impact than two 800€ vs. two 7000€ mics?",
            "Did you consider telling them it has an issue, and asking nicely if they can help?",
            "You really arent thinking in the context of a studio where they have already spent 10s of thousands at min on the room treatment to minimize those differences. Couple more grand isnt that meaningful.",
            "Mhm, I have. And they kindly said no.\n\n\nAccording to them one of the issues may be a bad capacitor caused by using the volume too high/using a dynamic mic in the port because it's meant for condenser mics (in my defense, the manual straight up says \"MIC\" without specifying which one it Is).",
            "You're right, I'm not. I'm an amateur and considering my skills (singing, editing, mixing etc) and the very limited time I have to produce and improve those skills, it's not my gear that limits my results 😉\n\nThis is why I asked for opinions of more professionals. And I thank you for providing it!",
            "Honestly, its a kind of dumb thing to buy for a home studio, imho - unless you are a pro muso and basically made of money and just dont wanna think about what to buy (ie Rihanna). Esp in a world where the likes of Austrian Audio and Warm Audio (and golden age project etc for the pre-amps and comps) exist."
        ]
    },
    "Please Read Our FAQ Before Posting - It May Answer Your Question!": {
        "title": "Please Read Our FAQ Before Posting - It May Answer Your Question!",
        "score": 44,
        "url": "https://www.reddit.com/r/audioengineering/wiki/faq",
        "content": "",
        "num_comments": 0,
        "comments": []
    },
    "observations about Austrian Audio OC818": {
        "title": "observations about Austrian Audio OC818",
        "score": 3,
        "url": "https://www.reddit.com/r/audioengineering/comments/1dltajj/observations_about_austrian_audio_oc818/",
        "content": "I was wondering if anyone else has super harsh ultrasonic around 10-12k frequencies in their vocal recordings using the OC818 and their general opinions about it. \n\nI don't have a big mic locker so it's hard for me to compare to other mics but I find it really piercing and I struggle to rein it in without killing it too much (RN using DMG Essence as a HF limiter or eq). It's either too harsh or too dark\n\nIt's also pretty noisy IMO (surprisingly because it's supposed to only have 9db (A) of self noise using an RME UCX II preamp and I often find myself in RX trying to remove some of the hiss so it doesn't pump up with compression \n\nAny recommendations on other mics that have a modernly bright but not harsh high end? \n\nAnd for those owning an OC818 have you noticed the same things? How do you tame those frequencies?\n\n\n\n  \n",
        "num_comments": 7,
        "comments": [
            "ultrasonic is over 20k. \n\nThe OC18 is known, like the C414, for a detail peak. \n\nIt sounds like the noise issue you are fighting is your room noise, it doesnt have a very tight pattern.\n\nMy recommendation would be treating your space. (Though you might find the warmer sound, presence peak, and extremely tight pattern of the BeyerDynamic M90X more pleasing, its $150 down form $380 on amazon atm, made for poor spaces).",
            "Are you sure you don’t have an EQ engaged on your RME?",
            "Perhaps it is room noise or some electric issue because I live in a residential building but my room is very well treated. I have 40 cm thick bass trap clouds, panels on the sides, corners, and in front of my desk + a few at the back: I'm talking about hiss in the background of the recording (not sure that comes from ambient room noise)  \n\nYeah I was wondering about people who have both the oc818 and C414 about their experiences \n\nI just listened to Lewitt's pure tube audio examples and it's also pronounced in that area, maybe a tad smoothed but still to bright IMO\n\nwhat's your favorite vocal mic?",
            "Yeah i'm sure",
            "Yeah white noise is everywhere, when you take all the noises and all their reflections that everything makes in a city, it all blends together into white noise. Being in a shared building ith whooshing ventilation etc will make things worse. Theres not a great deal you can do about that without building a suspended room in a room (ie an isolation booth) and even that will only do so much (literally be cheaper to rent a room in the country, too).\n\nThe one thing you can do is use pickup pattern and the inverse square law to your advantage. Make sure you (emitting the signal and blocking the noise) cover as much of the pickup angle of the mic as possible by using a mic with as tight  as pattern as possible, and being as close as practical. \n\nMy favorite mic is probably the C414 XLII, my fave vocal mic is probably the Electrovoice RE20, but theres no mic thats going to be right for everything, and honestly i dont own either as my home studio just isnt good enough for the C414, and i dont need the Re20 sound (and modular synths cost too much lol). Honestly my fave mic on \\_my\\_ voice is an AKG D5, had it a long time and know how to use it. I have technically better mics, it just suits my boomy, somewhat nasal voice.",
            "FWIW i do genuinely think it sounds like you would like the M90 X Pro [https://www.youtube.com/watch?v=pQqolpbbqKk](https://www.youtube.com/watch?v=pQqolpbbqKk) BeyerDynamic generally make great gear & its insane value atm (couldnt resist, thinking of a second). Otherwise maybe a KSM32 but it isnt as tight patterned. (&FWIW M90X self noise/EIN is 6dB)",
            "Thanks i'll check it out :)"
        ]
    },
    "How would you mic a drum kit using these mics?": {
        "title": "How would you mic a drum kit using these mics?",
        "score": 3,
        "url": "https://www.reddit.com/r/audioengineering/comments/1dlrwcn/how_would_you_mic_a_drum_kit_using_these_mics/",
        "content": "My band is creating a home studio set up. We have some existing mics and we're not intending to invest in any more right now. It's a small room with some sound treatment. Bass, snare, hats, ride, crash, floor tom, one high tom.\n\nHow would you use this hodgepodge of mics to mic a drum kit? Just interested in hearing a range of opinions, and know there's no single 'right way'. I'm aware they're not necessarily optimal for drums. We might potentially have a pair for overheads we can borrow, but for the sake of this, these are your four:\n\nOne SM57, two SM58s, and a Rode NT1A.\n\nThanks in advance!",
        "num_comments": 14,
        "comments": [
            "The Glyn Johns Method is highly successful.  There are a billion articles out there explaining how to set it up.  \nSpend some time down the google rabbit hole and find a source that explains it best for you.\n\nEssentially you get huge drums with very few mics.",
            "Personally the first thing I’d try would be\n57 snare\nNT1A kick out\n2 x 58 as Glyn Johns/Recordman style ‘overheads’.",
            "I think you should be able to do some pretty decent drums with those mics. You can pretty much do anything with a handful of shures and a decent condenser.",
            "57 snare (smaller, wont be in teh way), 58 kick, NT1 overhead, 2nd 58 the same distance from the snare as the overhead but out by the toms (Glyn Johns style). These days it also means you can de-bleed the snare from your overhead/tom mics.\n\nBut honestly you would be better off buyin some triggers (you can make em for about 10 bucks ea) and doing it with midi unless your room is amazing, imho",
            "Sm57 on the roof of the cathedral",
            "I’d invest in a couple at2021s or similar cheap sdcs and doing xy overhead or glyn johns with that. Nt 1 on kick, 57 snare, 58s go on toms.",
            "My two cents?\n\nI'd stick that Rode in the kick drum seeing as how it's gonna have better low end than the 57 and 58s, then use the 58s for OH in a Glyn Johns-esque setup, and then try either using the 57 as a room mic or a snare mic depending on which sound you like better.  \n\nHaving a snare mic might wind up being more important later down the track once you start layering other instruments tho, so maybe start with that.    \nKinda depends on the drummer.",
            "Look up Steve Albini I heard he was pretty good.",
            "We just tried this in our rehearsal room. If you really do everything according to glyn johns approach, you get a full, huge drum sound that very well reproduces the actual sound of the kit. And mic choice doesn't really matter, distance and positioning is more important.\n\nIf you want to add some punchier snare or kick with more attack by using some targeted compression though, you are limited. We ended up adding some additional mics for both.\n\nWhat I like about the glyn johns method: it also captures the room really nicely!",
            "Ditto",
            "Thanks for the tips :) I can't imagine triggers would go down well with our drummer haha. I'll take natural sounding and a bit shoddy when it comes to drums, over a triggered midi sound (though I'm all in favour of midi when it comes to synth or creating a piano sound)",
            "If you’re hellbent on not spending a single more dollar then I’d find a place in front of the kit where the rhode picks up the bass drum and enough of the toms, experiment with a spaced pair overheads with the 58s, and 57 on snare. I would not use glyn johns with 58s. That technique requires you to move the mics too far from the kit for them to be practical, and those mics shine when closer.",
            "Considering your flair says professional, I’d expect a more helpful response!",
            "I would have said the same 5y ago, but if you have decent library these days (with a dozen velocity layers and half a dozen round robins etc) and the timing of a real drummer it can sound amazing. Tho its definitely a different instrument."
        ]
    },
    "Matching speaker response to compensate for individual hearing loss?": {
        "title": "Matching speaker response to compensate for individual hearing loss?",
        "score": 4,
        "url": "https://www.reddit.com/r/audioengineering/comments/1dlqi90/matching_speaker_response_to_compensate_for/",
        "content": "I've got a question - obviously everyone has some degree of hearing damage which results in changes to how loud we perceive certain frequencies to be. Assuming the goal of room treatment and speaker calibration is to hear all frequencies equally at a reference listening level - has anyone tried to account for their lack of sensitivity to certain frequencies from hearing damage via their room adjustment software or otherwise? Did you have success? What's the most scientific way to go about trying this?\n\nI realise this is a lot of effort to go to for a \"flat\" frequency response, and there are a lot of variables involved in doing this properly, but I'm curious to try and wondering if anyone here has done something like this before?",
        "num_comments": 3,
        "comments": [
            "Don't, you're already used to your post damage response, so you already have an environmental reference.\n\nTune your speakers to be flat.",
            "The goal of a reference monitor is to reproduce accurate sound whether you have hearing loss or not.",
            "No one's ears are \"flat\" to begin with. Look up \"fletcher munson curve\"."
        ]
    }
}