{
    "F-35 enjoying some baseball ": {
        "title": "F-35 enjoying some baseball ",
        "score": 5295,
        "url": "https://v.redd.it/k0mtcxxtxx7d1",
        "content": "",
        "num_comments": 225,
        "comments": [
            "Remember when people would peak over the fence at baseball games back in the day? Yeah lol",
            "If his team dont win just bomb the stadium",
            "Now a real baller would call their HR shot and hit the F35…",
            "The fact it is able to hover that stable AND turn in a way that they can “see” the field of play is astonishing",
            "Show this to someone in 1939 and blow their fucking mind",
            "Two questions:  that plane is pretty high… can you feel the wash on the ground?  Always wondered how much power it takes to make it just sit there \n\nSecondly, is it just typical fuel use to do that?  Or do they have to burn at a higher rate?",
            "When you can’t afford a ticket so you have to hover in your F-35 to watch the game.",
            "Great now you made the plen leave why would you stare at him you know he’s shy",
            "Most expensive seat at that game",
            "Hey! You freeloader, buy a ticket like everyone else!",
            "Bro trying to peak the game",
            "IIRC The harrier is limited in it's time in hover due to the limited watersupply it needs for cooling and it's puffer ducts.\n\nDoes the 35 have such water consuming constraints or is it just limited to the amount of fuel it has?",
            "No one is going to ask the F35 if they have the express written consent of MLB to share their accounts of the game",
            "Let's go O's!",
            "Hey, I helped to build that!",
            "The game was called on account of Lightning.",
            "Are they remaking True Lies!?",
            "For security?",
            "Casually taxiing midair lol",
            "That thing turning to face the camera is a terrifying sight. An actual dragon that can see and kill you from hundreds of kilometers away has sensed your presence",
            "[deleted]",
            "The next day during the Phillies vs. Orioles broadcast all the players were stopping to watch one perform. It was awesome",
            "Target acquired, target locked....",
            "*Song's not quite over, but we're bingo fuel. Let's get goin'.*",
            "This might be my new favorite video, the organ playing made it so much better",
            "Imagine some freak home run gets taken with the wind and falls into the intake",
            "this is the best thing I've seen all day",
            "I'm pretty sure he busted a TFR, right?  What's stopping us from just hovering like that in our own multi-million dollar STOL-capable 5th generation fighter?",
            "The music really makes it seem so innocent ",
            "Awesome",
            "The best part is that you paid for that fuel",
            "Modern day True Lies",
            "Best seat in the house",
            "Most expensive cheap seats ever.",
            "Why buy a ticket to the game if you could take your jet out and hover over the park.",
            "1 simple trick all ufologists hate",
            "i'll continue to insist UFOs, if anything, are some big ad",
            "I want to see it on a tennis match with the jet rotating back and forth",
            "Talk about big brother",
            "Finally, a use for the F-35 VTOL",
            "Most expensive seat at the park",
            "The technology is astounding.",
            "Pitch clock enforced by aircraft",
            "When you can’t get the day off to go to the game so you take the company vehicle and expense it as a business meeting.",
            "Dudes rock",
            "How many points if you hit it with the ball?",
            "Hay, man! You got to pay for your tickets just like the rest of us!",
            "Most expensive seat at the ballpark",
            "That pilot has one hell of a story right there",
            "He’s got the best view of the game😂",
            "Pilot was using his fancy helmet to look through the floor of the jet and down the cleavage of the girl sitting in section 105, row D, seat 14.",
            "That low and slow should have a trigger warning",
            "Best seat in the house. Get that guy for ticket evasion 🤣",
            "Dude has the best seat in the house. Especially because it’s free. No beer or hotdogs though unfortunately",
            "How far away is that? I've heard that they're extremely loud in comparison to other fighter jets.",
            "\"My name is Giovanni Georgio, but everyone calls me...Georgio\" *beats*",
            "Geez it goes behind the building? Thought it was much closer",
            "Typical day in gta online",
            "Anyon knows how much wind can she handle while hovering?",
            "Imagine being at the right floor in that office building though",
            "Don't do that if Giancarlo or Judge is hitting...",
            "Bro looks a little confused",
            "🇺🇲🇺🇲🇺🇲 LET'S FUCKING GO🦅🦅🦅",
            "Which one of you guys is this?",
            "True Lies was just on cable , too funny.",
            "Ghost ride it, pussy!",
            "Free baseball with this one simple trick! The MLB hates this simple hack to get into any game for free.",
            "https://imgur.com/8Lv94s5\n\n\nSame plane (pretty sure) from the apron at Martin State. Either same or next day - not sure if they did flyovers both days.",
            "Damn the hover is so incredibly stable compared to a Harrier or any older VTOL design. It must be GPS, computer, visual sensor stabilized?",
            "bros ass rotated",
            "The crazy thing is that it’s one of those new AI controlled F-35. Sure, it’s a killing machine, but behind it knowledge of aerial combat is the mind of an 8 year old boy. The news is reporting that the military can’t get it to take off because now it wants to be a baseball player.",
            "So THIS is what approach meant when they said \"caution, jet traffic, 9 o'clock, holding position\"",
            "Do f-35’s have to hover with their landing gear down? Don’t think I’ve ever seen one with the gear up, hovering",
            "Fat Amy doing Fat Amy things!",
            "Had to be Baltimores fleet week. If you wanna see some really cool stuff happen right above you get down there.",
            "Baltimore fleet week! GO Os!!!",
            "NO DRONE ZONE",
            "It hangs in the sky in much the same way that bricks don't.",
            "His ex is banging one of the players so he pulled up 😤",
            "I’m sorry for the stupid question I just stumbled on here from the popular tab. How is it hovering like that?",
            "GO OOOOOOOOOOOOOOOO’s!!!!!!!!!!!!",
            "There goes your health care....",
            "Can they fire rockets when they are in this mode ? Or do they have to, you know , really fly to be using the weapons ?",
            "Looking at that, then thinking of all of the UFO reports growing up, gives me the biggest grin 😁",
            "His name is Boring, because \"Boring Never misses a pitch\"",
            "u/savevideo",
            "Must have gotten a 7 kill streak",
            "If they have engine failure while in hover are they totally fucked?",
            "I'm glad to see my tax money going to good use.",
            "So, I know the Harrier was limited to about 90 seconds of hover time due to it needing to be cooled with water, are there no such limitations for the F-35?",
            "Oh god the F35 chase in Live Free or Die Hard is happening.",
            "TIL a fighter jet can hover.",
            "Burning $1K/minute?",
            "Fenway Park, Boston?",
            "This next maneuver is going to cost you guys ten million dollars!",
            "Last time I saw one of those it was burning by the side of the road.",
            "Watching a few thousand dollars worth of fuel burnt... paid for with tax payer dollars.\n\nNEATO",
            "Massive misappropriation of taxpayer funded resources and gross waste of tax dollars.",
            "AAAAAANNNNNDDD, it crashed.",
            "Surprisingly it didn't crash lmao",
            "Kind dumb flex imo. \n\nLose the motor doing that and it’s tumbling into a crowd.",
            "not for nothing, but you can still watch the game from the right field fence at Oracle Park\n\n>Viewing Portals (Knothole Gang)\\*\n\n>Fans can watch the games for free through the right field fence , from this first-come, first-served viewing area, reminiscent of the Knothole Gangs of the old-time ballparks. Fans may be cycled through after each three innings or earlier, depending on the size of the crowd. All guests are subject to security screening in the free viewing area. No alcoholic beverages (which includes non-alcoholic beer and wine), cans or bottles are allowed in the viewing portal area.\n\nhttps://www.mlb.com/giants/ballpark/information/guide#f:\\~:text=Viewing%20Portals%20(Knothole,viewing%20portal%20area.",
            "With the camera(s) on that thing he could probably count the blades of grass. (Or look down some shirts)",
            "That was 100,000 $ jet fuel.",
            "That's Camden Yards, so that's an Orioles game. Let me do a deep dive if I can get some more info, and I'll edit this with the final score.\n\nEDIT: Orioles won against the Phillies, 8-3. [The jet did end up causing a few delays though.](https://apnews.com/article/phillies-orioles-fleet-week-planes-flyovers-428ab16fea116bd06964a91eeb3b5772)",
            "CB Buckner better look out.",
            "Nah it’s just Uncle Sam casually hanging his dick out so everyone can see how massive his balls are.\n\nBut seriously, imagine being in a rival military nation and seeing just how casually we have the most advanced fighter in the world just hovering over a baseball stadium for no reason other than *”Why the fuck not?”*. Then the pilot just zooms off like *”BRB, gunna break the sound barrier real quick”*",
            "Hey! I was going to post this comment.",
            "Hit the F35B - Win a Steak",
            "Hypothetically, if your HR shot hit a U.S. military jet would you be technically breaking any laws? Does the answer change if they are not a U.S. citizen?",
            "I've heard test pilots for the F-35 project talk about how easy it's to switch variants because of the FBW. So, it's not the balancing a stick on its end that the Harrier is. You just command the movements you want, and the aircraft figures out the reaction control jets/control surface adjustments that are necessary for the requested movement. With the Harrier, this was all the pilot's responsibility.",
            "Conspiracy theories for the next 100 years about aliens.",
            "I’m from 2024 and it’s blowing my mind too",
            "I imagine it's doing this over the harbor down the road.",
            "Fuel burn is far higher when the F-35 is hovering. The P&W F135 in the -B variant has a driveshaft poking out the front that’s connected to a ducted fan hidden in the airframe behind the cockpit. Since you also need to compensate for the loss of lift, the result is a *much* higher burn rate",
            "Typical JP-8 or Jet-A\n\nEdit: Definitely higher fuel flow rates because they need to produce thrust equal to the weight of the aircraft. In normal flight the trust to maintain speed and altitude is much lower.",
            "Unlikely you’d feel jet wash from a hovering jet at that altitude (not to mention it’s over water)",
            "Not today comrade!",
            "Looks like they're waiting to do a flyover. You can see someone singing on the screen.",
            "I'd guess in a hover like that it would be pretty high in the throttle, likely burning around 15,000lbs an hour fuel wise.",
            "...now that Chris Davis is gone.",
            "There no water in the 35. It's hover time is limited by engine heat and fuel remaining.",
            "The water supply for the Harrier II is for added performance when heavy, if it's unarmed or otherwise light enough it can hover indefinitely.",
            "Every time the Yankees lose a kid learns to read",
            "I was there last Saturday.  Awesome game and the jets buzzing around were chefs kiss.",
            "The F-35 or the ballpark?",
            "Military Industrial Complex 🤝 Taxpayers\n\nTaxpayers 🤝 \"Non-Profit\" Pro Sports Leagues",
            "/r/Angryupvote",
            "Streakers WILL get an LGB to the face",
            "for the *implication*",
            "Looks like they're waiting to do a flyover. You can see someone singing on the screen.",
            "Pretty good drone deterrent, if a bit on the spendy side.",
            "No it was “Fleet Week” in Baltimore",
            "Nah this is sweet sweet Lockheed Martin sponsored propaganda!",
            "This over the Inner Harbor several blocks away for Fleet Week. Same time as the game but completely unrelated",
            "It did flyovers too, was a demonstration as part of fleet week in Baltimore.",
            "Not to mention it looks like they hovered it a Block away from the stadium in case of engine or lift fan failure as they've been looking into recent lift fan incidents.",
            "Or a hover-over?",
            "That would be the furthest homerun in baseball history",
            "The fact that it was part of the show? and probably over water anyway",
            "Don't worry, it's an F-35. It won't be up there for long.",
            "I’m ok with that",
            "So this is the f-35. These planes are called VTOL. Stands for vertical take off and landing. The engine goes full 90degrees down and has a system (notice the flap behind the cockpit) that pushes energy only down. So the airplane is capable of hovering in this mode. It is a helicopter essentially. Then with proper forward momentum the aircraft is capable of transferring the energy into flight with closing the VOTL and generating normal life and drag to produce normal flight.",
            "###[View link](https://rapidsave.com/info?url=/r/aviation/comments/1dl6b51/f35_enjoying_some_baseball/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/aviation/comments/1dl6b51/f35_enjoying_some_baseball/) &#32;|&#32; \n [^(reddit video downloader)](https://rapidsave.com) &#32;|&#32; [^(twitter video downloader)](https://twitsave.com)",
            "Most can’t, a few can. One version of the f-35 can, which is what is being seen here. It is used by the U.S. marines and the royal navy. The harrier, which has mostly been retired, could and there was a Russian plane, the yak-38, that could. The list is pretty short.",
            "check out harrier jets",
            "$30k per hour, so about $500 per minute.",
            "Camden Yards, Baltimore",
            "It’s there for Fleet Week, which generated almost $10m in revenue for a city that really needs the money",
            "How so? I’m pretty sure training pilots is important for a nations air force",
            "Only 29 have ever crashed after over 700k flight hours stfu",
            "Why?",
            "I can support this. I want to stroll into a Sparrows game and sit on the grass like one could do back in the 80s, Murakami style.",
            "Lawful loitering",
            "It was flying over the inner harbor for MD Fleet Week",
            "Doubt he'd see it.",
            "> for no reason\n\nFleet Week. It was over the harbor.",
            "Win an airstrike",
            "Just as a general rule, U.S. law does not distinguish between citizens and non-citizens for most matters. The Constitution is written for, and applies to, \"The People,\" because their \"inalienable\" rights are a consequence of birth, not granted by the government.\n\nThere are certain categories of crime, like immigration, foreign terrorism, and a few others, that take citizenship into account, but overall, courts have held that the Constitution applies to everyone equally.",
            "That's fascinating. Do you know if the FBW and sensors together will compensate for movement below too? For instance, if you want to land it vertically at sea, will the system handle the compensation for the pitching deck of a carrier? Or if you want to hover over a moving ground vehicle, such as for a protection mission, can you just identify the vehicle and set altitude so it'll automatically follow?",
            "Why would you use an acronym when explaining something? What the fuck is a FBW",
            "Yes this was during “Fleet Week”",
            "Makes sense thanks!",
            "The jet is turned into a rocket",
            "Think he was asking about how much fuel is used to hover, not the type.",
            "What altitude would you guess the plane is at. I'd say maybe 500 ft. At 100-200ft I'm pretty sure you would feel jetwash though.",
            "Not sure about indefinitely.. unless maybe it’s hanging from a crane, gonna run out of fuel eventually",
            "The F-35!",
            "The MLB league office hasn’t been a 501c6 since 2008",
            "or blacksacked then dogfucked at gitmo - not gonna risk it!",
            "These are pilots getting mandated training hours in a cool way",
            "Although it looks to be between the stadium and the tall building, I guarantee it's hovering over the inner harbor, which is maybe 100-200 yards behind the building. That way, in the even of catastrophe, it falls into the water, not over the city.",
            "That is not in any way part of the decision on where to hover it. It's over the inner harbor for fleet week. They would never, ever, EVER consider emergency diverting to a stadium packed full of 30,000 people and a grass field. It needs a  high pressure concrete surface to land in STOVL.",
            "Me too, I am not from US, lol",
            "They made a great documentary about them. I think it was called True Lies.",
            "Is that just fuel, or maintenance too?",
            "Thank you!",
            "Sure...over less population - dense areas where liability is limited.\n\n(By the way, nation is a possessive noun, in your use case above...not that you care)\n\nThis isn't a training exercise.  It's a demonstration, and therefore unnecessary.",
            "How many of those 700k hours you logged in it?",
            "Has a consistent history of doing that.",
            "Epiphany and all...\n\nlove seeing this reference here",
            "I'm trying to figure out why it was so close to the stadium though. There's no airports nearby, are there? Was it hovering there for the sake of the fans? Or was there a different show nearby?",
            "Nice try China!",
            "remember that hovering isn't meant to be used during a mission, it's just for landings (barely ever take offs)\nduring a convoy protection mission jets usually just circle around the vehicles \\^\\^",
            "This capability is usually only used operationally during landing. Even takeoffs usually have a slow ground roll. I don't think it refers to outside objects, but I don't know that with complete certainty.",
            "Fly by wire, it basically means there's no physical linkage between the cockpit controls and the engine/flight control surfaces, you just tell the jet what you want to do and the computer will figure out the best controls to achieve that result.",
            "Also true for helicopters.\n\nFor rescue helicopter teams-\n\nWhen doing sea rescue the crew has very minimal time while hovering so it's not just the life of death situations adding stress!",
            "Yeah I think your right, thanks made an edit.",
            "All the fuel",
            "Just need to make a KC-135 hover and there you go.",
            "You work at Lockheed Martin?",
            "What part did you help build?",
            "Found the rich contractor.",
            "Of course but that doesn't mean it isn't propaganda!\n\nName a single fighter demo team that isn't employed as propaganda for the respective state... good fuckin' luck buddy!",
            "All-in cost. Fuel’s not that much. They’re trying to get it down to $25k.",
            "Any sortie is training in the sense that it keeps pilots current reduces the need for full-fledged recertifications training (hypothetically).\n\nAlso demonstrations drive recruiting. The military needs people. And also jets are awesome.",
            "It was over the water of the harbor that was closed to shipping traffic for security during Fleet Week... The image you've painted is false.\n\nDemonstrations are in fact quality training exercises. Getting airborne, ONSTA at the exact time you're supposed to, performing whatever maneuvers the flight plan stated, and returning home is what the vast majority of a pilot's qual maintaining flight hours are... It doesn't change just because there's people to watch it...\n\nLiterally no aspect of your comment is based in facts. Might be time to ditch your frankly ignorant bias, and rejoin reality?",
            "1.6 crashes per 100,000 flight hours under heavy training and inherently risky missions.  I don’t call that a consistent history.",
            "cool, can you list the \"consistent history\"",
            "That's a stretch that would make taffy jealous.",
            "Football games sometimes have airshow stuff that goes on, I've seen videos of paratroopers parachuting onto the field, so I wonder if the jet was just there as decoration for the game",
            "Fleet Week was happening at the same time, the aircraft were doing displays for Fleet Week over the harbor. u/PoorDamnChoices posted a link to a news article just above here in this comment chain.",
            "Hovers all the way down.",
            "Nope - he just pays his taxes.",
            "It’s not really a hard job to get ;)",
            "Oh god no, I was making 50k a year gross when I was DoD contracting.",
            "Least combative redditor",
            "\"The military needs people\" is about as smart of an argument that you can muster for this activity.\n\n\n...but in reality, a fraction of 1 percent of the people that decide to join the service will ever be close to a combat jet, nevermind sit in the seat of one.",
            "Waste of resources and money.\n\nJust because you \"think it's cool\", doesn't make it right.",
            "It’s averaged 6 crashes per year for the last 3 years",
            "Now you triggered my sweet tooth.  Thanks.",
            "Hey I might be an asshole but that doesn't mean this isn't technically propaganda!",
            "That doesn't make it any less awesome! You and your family should check out your local airshow.",
            "Despite being the most advanced fighter jet available, the F-35 has been involved in 29 crashes since it began flying 17 years ago. With over 721,000 flight hours and more than 965 delivered F-35s, the aircraft has a relatively low crash rate, with fewer than ten confirmed destroyed planes and one pilot fatality.Nov 11, 2023",
            "Websters definition of propoganda: \n\n> information, especially of a biased or misleading nature, used to promote or publicize a particular political cause or point of view.\n\nHow does this match up with that?",
            "I'll leave extra space at the jingoistic display for you and yours.",
            "Because it serves the same purpose...\n\nIt's up there with showcasing humanitarian work done by the military, holding military parades... or movies like top-gun...\n\nAt the end of the day it's no different than the uncle sam poster...\n\nThere's a reason military's employ photographers... hovering fancy shmancy F35 or flying B2's overhead in formation is propaganda end of fuckin' story.",
            "But that’s not what propoganda means\n\nThey’re not being biased or misleading, an F35 will fuck your shit up",
            "Show of force... Propaganda... To a bootlicker like yourself it isn't the same thing apparently thanks for the learning opportunity!"
        ]
    },
    "When planes hold hands…": {
        "title": "When planes hold hands…",
        "score": 348,
        "url": "https://i.redd.it/apibjppkb18d1.jpeg",
        "content": "taken at Heathrow a little while ago ",
        "num_comments": 35,
        "comments": [
            "dude she's a virgin. bad touch",
            "It was just the tip!",
            "Didn't this happen a few months ago, too?",
            "Like a virgin, touched for the very first time.",
            "Sooo much paperwork",
            "Considering how Virgin and BA used to be sworn enemies, it's nice to see them close and holding hands.",
            "Tis but a flesh wound.",
            "But isn't the Virgin toutching the BAs tail section? 🤔",
            "Don’t you fly away you beautiful virgin. I am never gonna let you go. Let’s switch on the PA system and say our vows right here. 💒",
            "Safe to say she ain't a Virgin no more",
            "Immaculate conception coming up...",
            "Speed tape time :)",
            "Virgin found a partner!",
            "Welp, another read and sign.",
            "Can someone tell me if the plane on the right would still be able to take off and fly like this? Or is the damage to the wingtip too much?",
            "When ramp agents find a new job. ",
            "Some ground handeler is going to get a chewing out.",
            "Obviously both planes have to be repaired, but in this incident of wing vs horizontal stabilizer, is it a bigger deal to damage the stabilizer than the wing?",
            "Looks like someone just lost her virginity",
            "Limeys and that whole taxiing on the wrong side of the taxiway",
            "Awww cute ☺️",
            "Looks like a 777 and a 787",
            "Looks more like the Virgin smacked someone’s bum.",
            "It's just second base.",
            "Was going to say, “two touching tips.” Kinda sounds nasty I know. I went there.",
            "This is a picture of that incident. It's not new. https://asn.flightsafety.org/wikibase/386376",
            "Always wondered  how  a Cessna  was made.",
            "They might be able to remove the winglet entirely and fly without it, but a plane is not allowed to take off with damage like you see here.",
            "Actually an A350 (G-XWBC) and a 787 (G-VDIA).",
            "hah yep think you're right, unless BA backed into her somehow. either way someone's gettin' sacked :/",
            "Got rear ended, I've heard that's like fifth?",
            "Someone had to say it.",
            "You’re right, I didn’t look enough at the planes butt hole.",
            "The sex that God can't see.",
            "the poophole, gods loophole!\n\nhttps://www.youtube.com/watch?v=j8ZF_R_j0OY [The Loophole by Garfunkel and Oates]"
        ]
    },
    "Pushback tug caugh fire in CDG": {
        "title": "Pushback tug caugh fire in CDG",
        "score": 1295,
        "url": "https://v.redd.it/8u2nrfu4uy7d1",
        "content": "",
        "num_comments": 87,
        "comments": [
            "Airport firefighters have the coolest shit!",
            "I’d be closing that cockpit window lol",
            "My first thought was to close the window when I saw that firetruck. I would not want to get sprayed in the face with that water pressure.",
            "When was that? Just flew out of CDG this morning",
            "I'm impressed with the tug driver trying to get it away from the plane... that was \"above and beyond\".",
            "Roasted Radome anyone?",
            "Henri! Get the burger patties! The grill, she is ready!",
            "Does the 777 have to be inspected now even tho it seems to be a bit distant from the fire? Like maybe open the radome up to see if there is heat damage?",
            "*flambé* 🧐",
            "Well that sucks...\n\nI guess everyone get deplaned and the plane inspected before use it again",
            "Would that cause the plane to be pulled out of service for a check up? Or is just a quick visual and let em roll situation?",
            "Damn that panther is fucking sexy",
            "\"Could you please get your shitty little bonfire away from our very expensive airplane?\"",
            "u/savevideo",
            "Go Panther !!!",
            "Poor 777",
            "They had one catch on fire in fra couple years back damagong a lufthansa a340",
            "Pas mal, non ? C'est ... Français.",
            "People for sure gonna find a reason to blame Boeing for this.",
            "Lucky the tug could disengage this time. The last tug fire I saw was during an Airbus 340 move, the tug couldn’t disengage and the fire burnt through the base of the flight deck in minutes.\nThankfully the passenger aircraft was empty and the engineer riding the brakes managed to leave the aircraft via one of the aft doors.\nNow imagine this is a cargo 757 or 767, with only one emergency exit door… directly over the top of the tug. The only other escape is via the cockpit windows, also directly over the top of the fire.\nI fly cargo 757s and 767s and this kind of fire terrifies me[a340 Tug Fire](https://www.aviation24.be/airports/frankfurt-fra/tow-truck-under-lufthansa-a340-300-star-alliance-livery-catches-fire-at-frankfurt-airport/)",
            "That looks an awful lot like a red fire extinguisher behind the bottom right of the window of the tug…",
            "Must be boeing tug. Lol.",
            "Immediately, I’m saying:\n\n“GET IT AWAY FROM THE AIRCRAFT.”",
            "Probably needs some hawk tuah on that thang",
            "This is the part where you run away...",
            "Those pushback cars look insanely cool too, very futuristic",
            "We had a fire under the nose, but CA how did the FMS get soaked with water?",
            "I don't know but even on mute I knew it was in France lol",
            "As someone who has been to CDG, this seems like a regular occurrence ngl",
            "Wasser Marsch...",
            "How much paperwork would there be for something like this?",
            "Which newspaper will be the first to say it's a Boeing tug...",
            "*flambé* 🧐",
            "Bloody Boeing at it again.",
            "Uh-oh better check and make sure Boeing didn't make the pushback tug",
            "How many fire extinguishers on the aircraft and tug combined?  I’m going with four total, which nobody uses. Waited for the truck to show up.",
            "That Boeing was flying to low and ran into the tug.",
            "[deleted]",
            "How long would you let that burn before popping the slides?",
            "Seriously, dual directional hoses??",
            "Rosenbaeur Panther - my lottery vehicle so I can drive it into work",
            "They’ll pay for all the bells and whistles when what might be on fire could cost more than 500 houses.",
            "Mmm. Smells lit",
            "“Ehhh, I’m upwind of it.”",
            "I’m thinking this was a ground movement to a hangar etc and it’s a technician doing brakes in the cockpit. No way a captain would be grabbing his/her phone while this was going on.",
            "They’re using foam, and if it’s AFFF I would not want to get sprayed with it at any pressure.",
            "Speak for yourself",
            "yesterday [https://airlive.net/emergency/2024/06/20/a-tug-caught-fire-at-paris-cdg-while-towing-an-air-france-boeing-777-300-aircraft/](https://airlive.net/emergency/2024/06/20/a-tug-caught-fire-at-paris-cdg-while-towing-an-air-france-boeing-777-300-aircraft/)",
            "It really was! He really put himself in harms way to protect the people on that plane!",
            "I'm pretty sure in commercial aviation, if you're wondering whether it might be to be inspected, it absolutely needs to be inspected",
            "From the news posted about it  here: it was going to maintanance, so no passegers on board, and the plane fortunely didnt sustain any damage as there was a quick response by the firefighters",
            "Looks like the person moving it was wearing a ground crew vest, so I'd guess this was a reposition without any passengers.",
            "I certainly hope they cancelled the flight and did a thorough investigation on potential heat damage. Especially as the avionics bay is right below the flight deck.",
            "This specific plane according to other comments here was actually in the process of being taken to be serviced already.",
            "###[View link](https://rapidsave.com/info?url=/r/aviation/comments/1dlalh5/pushback_tug_caugh_fire_in_cdg/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/aviation/comments/1dlalh5/pushback_tug_caugh_fire_in_cdg/) &#32;|&#32; \n [^(reddit video downloader)](https://rapidsave.com) &#32;|&#32; [^(twitter video downloader)](https://twitsave.com)",
            "Sorry but “damagong” made me literally laugh out loud. ;-)",
            "Yeah that one was a write off… Fire completely destroyed the avionics compartment.",
            "\"Tug vehicle burst into flames after pulling BOEING aircraft, passengers left in shock\"",
            "For a fire this size training will tell you to just get the hell out of dodge\n\nThe cost of the tug is not worth a potential injury claim\n\nI for one won't be battling a fire for my business if a know a fire engine is only 2 minutes away",
            "Still happening",
            "very little. paper burns quickly.",
            "dont joke about that, its really a boeing :D [https://airlive.net/emergency/2024/06/20/a-tug-caught-fire-at-paris-cdg-while-towing-an-air-france-boeing-777-300-aircraft/](https://airlive.net/emergency/2024/06/20/a-tug-caught-fire-at-paris-cdg-while-towing-an-air-france-boeing-777-300-aircraft/)",
            "Those crash tenders can be there in 2 minutes, why bother getting yourself in danger as the professionals are in the way plus once these trucks catch fire your extinguisher isn't going to do much at all.",
            "They tried.",
            "Riiiight, because their priority definitely should be recording and not… literally anything else.",
            "Considering the screens appear to be off, it was probably just a reopsitoning or MX tow.",
            "articulated remote control robotics mounted to the vehicle impressed me just slightly more than that",
            "I think you're absolutely right, you can see his green hi-vis vest at a certain point",
            "Out of interest, if it was a captain what would they be doing instead? Presumably there are no checklists for this sort of thing?",
            "Ha it was a mechanic but I bet some captains would do the same.",
            "Whoever posted that video should be grateful if they keep their job. In an emergency situation like that taking a cheeky video with your phone is the *last* thing you wanna do. I know 100% If that happened to me I’m standing by to blow a slide and get out of the aircraft if I am ordered to.",
            "Of course it was a Boeing!! (Jkjk)",
            "Also props to the guy who tried to drive the burning vehicle away to protect the aircraft.",
            "Phew",
            "Everything is also switched off in the cockpit, none of the screens are on etc so I think that’s a giveaway.",
            "Yeah, that was what I was thinking too. There's lots and lots of boxes and wires potentially in the path of those flames. To be fair, hard to tell from this angle...\n\nOff the top of my head, I think I would be doing a thorough visual, a pretty careful electrical check, pull the radome looking for fiberglass damage, and maybe (depends on the company engineering) some sort of NDT in addition looking for warping or delamination. Interesting process!",
            "That is a Pokémon I would like to catch!",
            "I worked for an airline and our training for basically any fire larger than a kitchen appliance was literally \"evacuate and let the fire department do their job.\" \n\nNot to mention many of these tugs are electric and lithium fires are a bitch.",
            "I don't think Boeing made the tug",
            "I believe those arms are designed to penetrate a fuselage",
            "Most of the cockpit screen are blank as well, indicating very few systems are powered up.",
            "There is no checklist for that thing, bur the Cockpit crew would probably start preparing a possible evacuation. They would be in contact with ATC and/or the firefighters and inform the cabine crew about the situation.",
            "Did you say Boeing caught fire? /s",
            "Boeing jet catches on fire dangerously low to the ground!!!!",
            "For seriously?",
            "https://www.rosenbauer.com/blog/en/in-focus-panther-8x8-airport-paris-charles-des-gaulle/\n\nhttps://www.rosenbauer.com/en/us/rosenbauer-world/products/fire-fighting-systems/stinger",
            "[https://www.youtube.com/watch?v=D97NNAJt4\\_s](https://www.youtube.com/watch?v=D97NNAJt4_s) nice tool :)",
            "A penetrating sprinkler. Cool."
        ]
    },
    "Southwest flight flew just 525 feet above Oklahoma town, triggering altitude warning": {
        "title": "Southwest flight flew just 525 feet above Oklahoma town, triggering altitude warning",
        "score": 1371,
        "url": "https://www.cnn.com/2024/06/20/us/southwest-flight-low-altitude-warning-faa/index.html",
        "content": "\n",
        "num_comments": 232,
        "comments": [
            "Sounds like somebody didn't have the visual approach backed up by an instrument approach, maybe.",
            "What in the hell is going on over there?",
            "Reminds me of when they landed at the Branson airport and nearly went off the edge",
            "Down close over that Hawaiian aqua-marine I understand, but what are they trying to get a close-up look at in Oklahoma?",
            "What is happening at Southwest lately.",
            "500 ft at 9 miles out smh",
            "Someone is getting called into the chief pilots office.",
            "Apparently Tower called the pilot to ask \"what's going on over there\" \n\nFirst Officer said \"That MiG really screwed him up. I don't think he can make it back.\"",
            "Hey, SWA are you ok?",
            "TERRAIN TERRAIN",
            "“Let me know when you’re ready to take down the number”",
            "Are they OK?",
            "At least we aren’t getting the “another Boeing 737 incident!” news articles about this.",
            "“Negative Ghostrider, the pattern is full.”",
            "Pilot wanted one last hurrah before the tower’s complete and you can’t fly so low anymore.",
            "This ain't gonna fly when they build America's tallest tower there",
            "Let me guess, the voice recorder was accidentally erased.",
            "Man the Hawaii example makes you wonder what the hell is going on. Break off approach but continue descending after the runway to 400 AGL?",
            "Pilot was having a dream about crop dusting.",
            "Here’s my take and my take only. They were getting ready to land at KRCE.\n\nEdit:  RCE or RQO",
            "Military pilot lol.",
            "They did the same thing in Hawaii like a week ago, think it was lower too.\n\nEdit  https://www.foxweather.com/lifestyle/faa-investigating-southwest-hawaii-drops-2024.amp",
            "Was Penny Benjamin sunbathing?",
            "Me when I miss the little purple diamond in Flight Sim",
            "160 meters, for anyone wondering",
            "Penny Benjamin?",
            "Retard.  Retard.  \n(I spent 10 seconds on this Reddit post)",
            "Were they gaming? Come on....",
            "So that’s why my drone’s max altitude is only 400’. Makes sense now. 👀😅",
            "We were on a Southwest flight out of Orlando earlier in the week. We took off and just stopped climbing, and were extremely low. So low, in fact, you could clearly see what make of vehicles were below us. Almost sounded like the engines had shut off. I was sitting just in front of the left engine. We flew like that for several minutes, and it actually even looked like we were gliding back down. That is the only time I have been legitimately concerned when on a passenger jet. I assumed it was to stay out of turbulence higher in the atmosphere, but who really knows what was going on. They’re not going to tell us something was wrong or of any pilot error.",
            "Boeing and Southwest...name a more diabolical duo!",
            "While I can't know the specifics of this case, I have had a controller issue the same alert on a perfectly clear day in the middle of the afternoon. It was evidently triggered by a higher than normal decent rate. The only thing I can think of it that the algorithm that issues the alert projects where the aircraft would be if the decent rate doesn't change. I've actually had this happen twice. Neither time was the decent rate objectionable or even noticeable to the passengers. Neither time was 'evasive action' needed or taken. I'm not saying that's what happened here, I just won't jump to conclusions.\n\nEdit: I should also mention in both cases we were above 1500' AGL and outside the marker.",
            "It isn’t uncommon for pilots to accidentally land at wrong airports when things look similar and they are tired. Some pilots even make mistakes that are fatal. These guys identified the problem and corrected it, no one was hurt or even inconvenienced. What are y’all complaining about?",
            "525 feet is one of many altitudes at which one flies prior to landing. A “low altitude alert,” in and of itself, is not news.",
            "Looking at flightradar24 it looks like there is a short runway-length diagonal highway \"Old Oklahoma 4\" that they may have seen lights on and confused for the runway with the same heading a few miles down. It was just a bit after midnight. \n\nJust my armchair NTSB report.\n\nEdit, link to flight radar blog post. \nhttps://www.flightradar24.com/blog/southwest-airlines-oklahoma-city-low-altitude/",
            "A classic move",
            "Or they did, but both were looking out the window and fixated on a road or something which is basically the same thing.",
            "Why would you do this? (browsing from front page; not familiar with aviation)",
            "Looks like RW13 at OKC only has an LP approach, does the 737 not have advisory glideslope (LP+V) capabilities? My archer does…",
            "Isn't that required for commercial?",
            "It's their SOP.",
            "Seriously. It’s a fly OVER state!",
            "ATC / aircraft exchange, with map overlay video, can be found [here](https://youtu.be/9m6S60jsjb4)!\n\n…no idea why SouthWorst has been in the news so much, though.",
            "[deleted]",
            "That one was so unbelievably bad. ",
            "*WHAT*",
            "I always try to stay AT LEAST 1,000ft away from Oklahoma at all times",
            "The pilots' crash pad, probably.",
            "It's going to come out that someone was filming a porn in their backyard, isn't it?",
            "Mary Beth flashing at the pilots",
            "Found a penny",
            "Due to their old crew resource management system they accidentally put flight attendants in the cockpit and pilots in the cabin.",
            "They've really taken a dive.",
            "all south no west",
            "I'm flying Southwest next week, as a non-aviator, should I be worried?",
            "I think a lot of what you're seeing is the long-term result of an industry with extremely high barriers to entry that favor those who can afford flight training rather than those with actual competency. I went to an aviation college in the late 2000's and probably 75% of the first year pilot majors side-stepped either into ATC or business related endeavors. Only a few that I know of actually made it to the airlines and I know they had a really tough time when they were getting started. You basically either come from a really wealthy family or take on a huge amount of debt with limited hiring prospects for your first few years if you go the pilot route.",
            "Pilots were not first to board so they didn't get the seats they wanted :/",
            "I know, right? I think i could have gone as low as 300' by there.",
            "Yeah.....umm.....Hi Peter, we had a memo about this, did you get the memo?",
            "He was holding on too tight, he has lost the edge",
            "PULL UP!!",
            "Bank angle check !",
            "Oklahoma is just fine",
            "Likely completely pilot error. Somehow Boeing will still get blamed for this.",
            "Not yet*",
            "\"THAT'S TWICE! I WANT SOME BUTTS!\"",
            "Not close to it. They were cleared and lined up for 13. Still 8nm out from the runway.",
            "Someone post to r/shittyaskflying",
            "Could also be noise restrictions. I’ve never been on a flight with that in place but what you describe is what others have in that scenario",
            "How about 525ft at 8nmi from the airfield?",
            "It absolutely is uncommon for pilots to land at the wrong airport. If you do this at an airline, especially one as large as SWA, then your getting a paddling because a lot of stuff had to go wrong/missed/ignored to get to that point",
            "Well it sounds like they actually didn’t, ATC is the one that pointed out the mistake",
            "How many **years** since the last time a commercial airliner landed at the wrong airport?",
            "Lmao Pilots landing at the wrong airport is not common at all Lmao",
            "Are you kidding me? “Nobody dies” so there’s no problem? Miss me with that (as the zoomers say). ",
            "Wrong airport? There was no airport anywhere near to where they almost put it down.",
            "Dude this isn't a little whoopsie like forgetting to make a PA, or even something like turning down the wrong taxiway. The holes in the cheese were lining up here, luckily there were enough layers that it didn't line up all the way. If you're doing any type of approach, including a visual (backed up by something), in a modern airliner there's going to be vertical guidance available. From an Armchair Quarterback perspective, it sounds like the PM probably should have caught this one. But, the pilots will get retraining and likely the training department will focus on this type of thing in the next cycle.",
            "I’ve flown for 14 years and never landed at the wrong airport. I flew in demand night freight before too..",
            "It’s extremely uncommon, actually.",
            "I can only really remember maybe 1 case of pilots landing at the wrong airport…I think it was actually Southwest that landed at a wrong airport in Missouri but that is not common at all. I’m pretty sure those pilots were suspended as well. \n\nAnd saying “no one got hurt. What’s the big deal” is problematic when the stakes are high and hundreds of people’s lives are at risk both on the plane and on the ground. That’s why every incident is investigated and changes are made (if necessary) to not put anyone’s life at risk.",
            "It is when it appears they were lining up to land on a road 8km from the runway.  500 ft 8km out is not normal.",
            "It is when you’re supposed to be at 4000 ft",
            "Part of Ranchwood Blvd for us Yukon, OK locals. This road has a diagonal orientation, much like runway at WRWA that they were trying to land at. Except the runway is several more miles away. Would have been a awful crash, as this road is narrow and lined with trees. Even worse if hit the high school, which is by this road and is a large structure. Bit of a stretch but makes some sense.",
            "My flight instructor said this happens a few times a year in Wichita.   Pilots will line up on McConnell AFB instead of Mid-Continent.  In their defense, when you’re scanning flat ass terrain in the middle of nowhere you’re likely to latch onto the first big rectangular patch of concrete you see, especially when it’s about where you’re expecting to see it.   The airports are only about 10 miles apart.",
            "> Looking at flightradar24 it looks like there is a short runway-length diagonal highway \"Old Oklahoma 4\" that they may have seen lights on and confused for the runway with the same heading a few miles down\n\nDamn, if I was the local Council I'd put an S-bend in that highway rather than risk planes landing on it.",
            "My 12 hour adhd day meds (awaken me) + 24 hour adhd meds (have a fatigue side effect) + 11pm daytime tablet wear off = this",
            "Couple reasons (enthusiast not actual pilot so take with grain of salt):\n\n- that runway doesn’t have the equipment for an instrument guided approach or the equipment is off for some reason\n- ATC changed their landing runway at the last second so they didn’t have time to program in proper approach instrumentation\n- they were cocky and just didn’t do it (possibly familiar with airport)",
            "Why would you back up your visual approach with an instrument approach?\n\nOh, I don't know, to avoid accidentally almost landing on a road instead of the runway?",
            "Most airliners don’t have LPV capability. 737’s have RNP capability",
            "I cant speak for them, but a lot of airliner have only been more recently available to be equipped with LP or LPV capabilities.",
            "Haha yes it is and that’s a great song",
            "Because it's their turn?",
            "Because the news is hyper sensitive to clicks tied to anything commercial airline related. So now they're looking for them and things that would be a non-event are headlines. Pretty obvious.",
            "Except their “short final” was nowhere near the airport but instead barely over a suburb on the opposite side of the Oklahoma City metro.",
            "Where is there any evidence they got into a low energy state? \n\nAnd this happened 9 miles from the airport, what exactly is “short final” to you? Because to us short final is when landing is guaranteed, so maybe the last half mile.",
            "They missed.\n\nEdit:\nhttps://www.cbsnews.com/news/southwest-pilots-who-landed-at-wrong-airport-say-runway-lights-confused-them/",
            "As the terms of your probation clearly state. 1,000 feet from Oklahoma, places of worship, 7-elevens, and morgues.",
            "Yeah I'm a flight attendant, not a passenger attendant. Flaps 1, bitch",
            "Slow clap. Slow clap.",
            "\"accidentally\"",
            "Ah classic",
            "I thought they fixed it so that wouldn't keep happening.",
            "Many commercial pilots now prefer to rely solely on visual approach because they know that IFR and other technical readings from Boeing planes can be incorrect.",
            "Despite currently sitting at an airport due to a 4 hour southwest delay... You'll be fine as far as safety goes\n\n\nI don't have any confidence that you'll land at your destination on time, though. ",
            "Nope",
            "Nah, I wouldn’t be worried. I flew them this week and will be flying them again in a few weeks. I’m not concerned at all",
            "There hasn’t been a single fatality on a US airline in over six years. In that time, over a quarter million Americans perished on the roads. There are some bad signs, and action needs to be taken to ensure this remarkable safety record continues, but the only thing you should worry about is dying in a crash on your way to the airport.",
            "Nah. Southwest is statistically one of the safest airlines ever. No fatal crashes and only 2 deaths caused by them (runway overrun and the engine explosion over PHL) but it is concerning the trend of WN related incidents over the past few months. But if fly them tomorrow if I had to.",
            "From a very general standpoint looking at the **entire** aviation industry in the US there are absolutely things to be concerned about. Between Boeing being Boeing, the stresses on the ATC system, and numerous close calls across the spectrum of airlines it feels like we are all holding our breaths for a bad outcome. \n\nAs for your **specific** flight, I wouldn’t worry at all. Despite the stresses in the system, aviation is remarkably safe and Southwest does have an excellent safety record. The drive to the airport will statistically be more dangerous (by far) than the flight itself.",
            "Just had two SW flights today. I am alive and filled with complimentary over-steeped tea.",
            "No. The media is hyper vigilant toward airline related issues because of how Boeing is trending. That's why any issue involving a Boeing aircraft is reported be cause the public has no idea where Boeing management, airline management, and anyone else in between actually holds responsibility.\n\nAnd reporting like this gives the impression of worsening safety for airlines but in reality these are close calls only within the already very conservative safety margins of commercial flight. An alert like in this story is a corrective warning to save the from getting actually into serious danger.\n\nTheres almost no chance of anything happening. Many flights a year experience this sort of event and passengers often have no knowledge. The odds are much better you'll die on the road than die in even the worst airline these days.",
            "Not at all",
            "Nah, I fly Southwest nearly every week and have never had an issue other than the occasional delay.",
            "No. Why would this event have any bearing on the future? If someone crashed a Kia Soul would you be worried if you got into a Kia Soul Uber?",
            "Woop woooop.",
            "LMAO",
            "No we fucking aren't.",
            "Yeah, could have been. We’ve been out of there a few times and had the usual climb, but can’t remember if those were near the same time of day. Everything ended up being fine and the rest of the flight was normal. Just was really uneasy for a bit. 🤣",
            "That's my point. They may have the distance from the airfield correct, but from experience I don't believe the altitude is correct. It seems to be a projection based on current rate of decent. Again, I wasn't there so I don't know. I just know the same type of thing has happened to me. This might be something different altogether.",
            "And that’s why there are redundancies in place so it wouldn’t happen. But this is reddit so we don’t praise the redundancies that helped.",
            "They still had to identify it and correct it. There is a reason there are so many redundancies for safety. People just don’t understand that something those redundancies are actually used. \n\nI do wonder how many of the guys complaining here are actually pilots, and how many fly professionally. Based on the type of comments it doesn’t seem like a lot. Is it bad that SWA guys screwed up, yes, is it the end of the world? No. Those guys will get retrained and it’ll be a learning experience for everyone. \n\nBut people of reddit will always criticize shit they don’t understand, kinda funny actually.",
            "Right this literally doesn’t happen",
            "Commercial airlines or professional pilots? There is a difference.",
            "Yet I remember cases when it happened in recent history. Maybe you don’t, don’t know what to tell you.",
            "Its okay, don’t get upset. You’re fine.",
            "Do some night flying sir. I can absolutely see how such mistake can happen. But at the end of the day, they did their jobs (did their jobs like shit but did still did it). SWA is guaranteed to take care of it, they are required to, news or this reddit stuff ain’t making a difference.",
            "Yes and I’m sure they will get retrained for it. The difference between my post and yours is that I’m acknowledging the modern safety and appreciating the fact that this is just a stupid news article. Had it happened to someone worse it would have been a hole in the ground.",
            "Me neither. But 2 people are not a sample of statistics.",
            "Compared to the number of flights per day, yes. Yet it has happened multiple times over the last few years. This case could have been much worse.",
            "There was also that time the 747LCF landed at a small GA airport instead of the AFB ~10 miles away they were trying to land at.   The audio is pretty funny; it took a surprisingly long time to figure out where they had landed!",
            "Then you sir need to do some research.",
            "It was about 9nm out from runway 13.",
            "It was midnight so at least pretty much no one would be at school",
            "What's the outcome of this occurs for a passenger jet? Just taxing back and take off again?",
            "I’m asking why someone would not have it backed up by instruments, damn",
            "Interesting, had no idea!",
            "Your taste is usernames is almost as bad as your taste in music.",
            "Maybe Southwest should focus on not getting so close to the ground / ocean when they are not supposed to and they won’t be in the news?",
            "Exactly. This sub never fails to disappoint me with their MSFS2020 inspired self confidence.",
            "Landing is always guaranteed. \n\nThe real problem is location.",
            "Don’t forget the Zoo…",
            "Truly, a sight to be seen.",
            "Slow flaps.",
            "Wow what an insane fact you just made up",
            "Airline pilot here. You are completely making stuff up lmao",
            "Lmao what are you talking about??",
            "Source: trust me bro",
            "Lmao what did I just read. And sorry his pun flew 525’ over you.",
            "But did you die?",
            "And you have to go back much farther to find one from a crash.",
            "lol. Unless the drive to the airport has protestors on the highway…air travel is getting worse and worse. \n\nAnd everyone working in the industry is caring less and less. It’s like watching that robot clean up its own oil spill so it doesn’t die. The slowest death of all time.\n\nIt’s orge for US dominance of commercial aviation 😔😔😔",
            "Yeah people really need to understand the role the media is playing in this. Articles about the door incident garnered a fuck ton of engagement online, and they want to ride that wave as long as possible. \n\n ",
            "At least you aren't Mississippi.",
            "When you count on a redundancy it’s not a redundancy",
            "Honestly you have a bizarrely cavalier attitude towards flying and safety, I genuinely hope you’re not working for an airline",
            "Is southwest a commercial airline?",
            "Just because it’s happened before doesn’t mean it’s common lol",
            "The only one that pops into my head is a medevac flight maybe 8-12 months ago. That was probably due to a single pilot being task saturated and should not have happened. Side rant, medevac flights shouldn't be 1 pilot operations at all, especially in IFR, as it has and will continue to kill people.",
            "Yes make it about “my hysterics” and not your dense take. ",
            "Man, you're really doubling down on that. Aren't you? I sincerely hope you're not a pilot.",
            "How many NASA reports have you filed?",
            "I don't know how modern a low altitude alert from a controller is lol. They hadn't had the GPWS going off either yet (I assume, no mention of that in the articles) and they'd have to ignore that to actually end up landing on the road, which is willful negligence and gross professional misconduct at that point.\n\nThat being said, this incident is a significant deviation from the planned flight and does demonstrate that the flight was well below the safety standards. Yes they came back around and landed just fine, but how did they get themselves into this predicament in the first place, and what can be done to prevent it in the future. To hand-wave it away and say oh well the safety systems worked, while true in this case, is a hazardous attitude to adopt in aviation, because what if they don't the next time.\n\nUltimately, a lot of aviation reporting is heavily sensationalised and often outright incorrect. So far they seem pretty unbiased in the reporting of this incident and at the end of the day the travelling public have a right to know.",
            "So how is it not uncommon?",
            "Maybe it’s common for you to do it assuming you are a pilot which is a scary thought. If it’s so common post 20 incidents where commercial or airline pilots landed at the wrong airport in the last 5 years. I’ll wait…..",
            "Idk man I haven’t flown in five or so years and I was only a lowly private pilot, but back when I was flying aiming for the correct airport was probably one of the easiest things to not fuck up",
            "A detail omitted from the headline or attached news story. That is sub-ideal",
            "Thoughts and prayers for janitorial.",
            "I was actually on a flight that did this.    Decent seemed normal.    Then we leveled off a few hundred feet off the ground.   Turned right, flew level a few minutes, turned left and landed.   I chuckled to myself when I realized what happened.  The rest of the plane was unaware.  I was going to say something when deplaning but the cockpit door remained closed.  \n\nYou should never actually touch down.  ATC would see what was happening and clue in the pilots.  That being said, give this a read. Happened at another Wichita area airport to a plane bound for McConnell. Those runways nearly line up so it’s *kind of* understandable but people still lost their jobs over it:\n\nhttps://www.aopa.org/news-and-media/all-news/2013/november/21/boeing-747-dreamlifter-mistakenly-lands-at-jabara-airport",
            "Here is me hoping someone with a brain responds to you",
            "Might have just forgotten to. Or they did and didn’t reference it, and instead they were just focused on looking outside. Or they thought they were familiar enough that they didn’t need it. Would be my guesses. ",
            "Oh gotcha.  Laziness?  Complacency?  Is it possible that something about the ILS system was off or malfunctioning?",
            "To land not-almost-accidently on a road. ",
            "Accurate. They can fly RNP's, which you cannot, all day long, but they don't have LPV capability.",
            "Thanks for your irrelevant opinion! :)",
            "So you must be a commercial pilot I suppose?",
            "I felt this remark.",
            "Aviations only 100% record - we’ve never left one up there.",
            "You got me ha. Let’s get you in the training department, need more like this.",
            "Landing is different than crashing in my book. /s\n\nThis incident follows the recent Lihue Kauai low approach on short final.  Same airline 400’ on that one.  WTF??",
            "Don’t forget orientation and velocity",
            "That’s only on KS. Those poor poor capybaras…..",
            "I have the heart of a lion, and I've been banned from the zoo...",
            "Mercy buckets!",
            "He is using Reddit freedom of speech",
            "Now you’re just asking questions they can’t answer",
            "There are a lot of people in this thread that are playing dumb. I am simply stating how things work in the real world especially for younger pilots that are weary of aging and faulty instrumentation. More and more pilots are going 100% visual on larger aircraft.",
            "Bump",
            "Man, that robot cleaning its own oil spill is a powerful analogy.",
            "And the door incident is a serious one but it's not really reported in context properly. Decades ago aircraft were crashing constantly. These days the door blowing out is big news specifically be cause of how good safety got. Our parents were willing to fly their whole families annually despite crashes happening all the time. Now you get a non fatal incident and were up in arms. The reaction to Boeing today itself is a product of how safe it's become. We won't tolerate it being like before.",
            "As a pilot? No. But considering that most people here are passengers, I assume they wouldn’t get in the jet knowing there are no redundancies.",
            "Nah, just to you guys complaining and criticizing an event you don’t know the details of.",
            "Try to use google.",
            "It happened enough before that it isn’t unheard of. If you like I’m happy to discuss the definition of “common.” Fact is that it hasn’t happened in this case and we have plenty of data to explain how such things do happen. The guys here will be retained and if need be the training program will be adjusted, if you really do represent Boeing and fly a 777 or 737 (I can’t tell from your name) you know how the system works and you know that bitching about it on reddit isn’t the thing that will change anything.",
            "If you want, for learning purposes, there was a C-17 in 2012 trying to land at MacDill AFB. Very professional crew, just tried after a series of very long days.",
            "I’m just appreciating that the safety has gotten to such a point where this is just a news article as opposed to a hole in the ground.",
            "Funny",
            "Maybe 1 or 2 9-10 years ago. You?",
            "Completely agreed. They may have had GPWS go off. Only way to tell is to get FOQA data and SWA ain’t going to release there. We only know what the media can easily find out. \n\nEither way, it’s typically handled by retraining the crew and perhaps adjusting the whole problem for everyone.",
            "When you take a sample of all of the pilots, it does happen. You occasionally see reports of such things. \n\nYeah its bad. But you’re looking at this SWA thing all wrong. Its not “holy shit things are bad!,” its “wow they screwed up that bad and things are still fine, that’s really good news.”",
            "Keep on waiting, I’m not doing research for you. Especially after having read your other posts and realized who you are.",
            "Picture a situation where its the 4th 14 hour day in a row with min rest every night, and 4 legs per day. You’re going into an airport where you think you’re familiar with so you screw up because you let your guard down. No excuse at all but that’s generally how it happens to people.",
            "Says it in there:\n\n‘Southwest flight 4069 was about 9 miles from the airport, over Yukon, Oklahoma, when it descended to the low altitude just after midnight on Wednesday, flight tracking information from FlightRadar24 shows.’",
            "Scant aviation knowledge here: what happens if you land a big jet like this at an unintended airport and it isn't safe for it to take off from that airport for whatever reason? You could tow a Cessna around, but something tells me it'd be a little harder with a 747.",
            "Excellent Reddit conversation.",
            "So much sass here. Continue",
            "Freedumb of speech",
            "yea bro im landing visual in rvr 1200 vv001 cus my buddy Eric told me the ILS is unreliable lmao",
            "Absolutely not.",
            "Well I mean we have 300+ million people…it’s gonna take a hot minute before it REALLY falls apart 😅😅",
            "No one’s saying we need to pillory the pilots, but we also shouldn’t just dismiss/brush off what could have been a fatal mistake. At my home airport of SJC being at 500ft 9nm out could easily put you into the side of the Santa Cruz mountains. All people are saying is we should figure out what happened and correct it.\n\nYour dismissiveness is very much against a safety first culture, so I’d hate to fly with you",
            "Woooosh",
            "Lol who said I represent Boeing? Wtf dude you seriously have no clue what you are even talking about. It’s not common at all. Go to an airport and ask every pilot you see if it’s common and they will all say no! Simple as that.",
            "This kind of thing is almost a catastrophic accident, so your sentiment is unwarranted. ",
            "Yeah I figured That’s because you have exactly no past incidents at all that prove that it’s very common.",
            "Are you a pilot?",
            "It’s the *second* sentence too. He couldn’t make it past the headline and a single sentence.",
            "They’ll pull parts off it until it’s light enough to take off",
            "“We” should absolutely dismiss it. Because “we” here on reddit can’t do jack shit about it. SWA has access to the real FOQA and CVR data, they can handle it. You on the other hand have access to foreflight and news/media. There isn’t a lot you can do with that.",
            "Actually I’m sure you don’t represent Boeing. But it is funny how you made their logo your avatar. I just pointed it out because you’re either a kid playing a game, or like I said you ought to know how the system works.",
            "Kinda reminds me how people say “I almost died today.” Everything is alive, don’t worry.",
            "Accountability comes from everyone my dude, else you just normalize near misses until they become accidents",
            "What the fuck does my profile picture have to do with anything. What the fuck? Lmao like how’s that even funny? You must realize that you were wrong about your original point though that’s the only explanation for you changing the conversation the way you did by bringing up my Reddit name and profile picture for some weird ass reason. Lol",
            "If you almost died then it’s definitely worth going into exhaustive detail what you did wrong to almost die. You don’t think you should ever have to answer any questions about that?\n\nI hope you’re not a pilot. Because your attitude toward dangerous mistakes is not something a pilot should have. Mistakes get talked about. **In detail**. That’s why the safety record is what it is. Theres no such thing as “nobody died. Let it go.”",
            "I guess tike to boycott SWA? Complain doesn’t change shit, spending your money differently does. Don’t know what else to tell you.",
            "Damn lol, you get offended easily. Relax buddy. All is well.",
            "I’m tired to having the same damn conversation with every one of you. Go read my other posts on this topic.",
            "Well I already do so yeah 🤷‍♂️",
            "Lol yeah so offended right. I don’t think you know what the word offended means lmao. Btw your first comment is up to 45 downvotes lmao. I sincerely hope you aren’t a pilot. If you are you probably land at the wrong airport all the time and than tell yourself it’s normal afterwards lmao"
        ]
    },
    "Did a double take seeing this taxi at DFW today! ": {
        "title": "Did a double take seeing this taxi at DFW today! ",
        "score": 333,
        "url": "https://www.reddit.com/gallery/1dlh8zm",
        "content": "",
        "num_comments": 40,
        "comments": [
            "AA heritage fleet.",
            "Didn’t you hear? They reanimated Howard Hughes’ corpse and he in turn did the same with TWA!",
            "I had forgotten that American Airlines bought TWA.  I liked it better when there were lots of cool airlines.",
            "A very stately 373-800. I remember that livery from childhood, at least I think I do.",
            "I saw it there parked next to the plane I was getting on. I did a cartoon-level double-take. \n\nIt put a big smile on my face though!",
            "Trans World Airlines.. been a long time.",
            "does it have teeny little ashtrays at every seat, that I can spend a while toggling their lids back and forth to ease the boredom?",
            "I love those heritage tales.",
            "When I was a kid, a friend of the family’s was a mechanic for Pan American Airlines. He said that the joke around Pan Am was that TWA stood for “Teeny Weeny Airlines.”",
            "This reminds me of how much I still despise Carl Icahn. That man murdered TWA.",
            "My old man worked for TWA for 30 years then American for 10. The last few years of TWA were rough.Carl icahn destroyed that airline and screwed the employees.",
            "That’s all I saw as a kid growing up in Saint Louis.",
            "Flying on a 170 I see!",
            "They've had retro paint schemes since 1999, but TWA didn't come around until they bought TWA in 2001.\n\nThis is the second plane that's been painted in retro colors of TWA.\n\nThey have them for Reno Air, Air Cal, Piedmont, early AA liveries, etc.",
            "I was making a similar post a week ago about [G-EUPJ](https://www.planespotters.net/airframe/airbus-a319-100-g-eupj-british-airways/ejm9pe) I saw in Heathrow and did a double take, but decided to not create the post",
            "The airline that made me want to be a pilot. Such a shame what happened with them",
            "I kind of like the idea of retro colors on aircraft,  including this one although in view of TWA having ordered Airbus A318 wouldn’t it have been more appropriate to have the TWA retro colors on an Airbus A319 which AA has. Obviously TWA as such failed in a deregulated aviation market and despite a well established brand just like Pan Am both had no chance of survival, also as Germany was unified and flights from and to Berlin no longer an advantage or niche.",
            "Wow! That brings back memories! \n\nI was a big TWA Frequent flyer back in the day! I would regularly get upgraded to first. Man, back then First class meant something more than two free drinks! You really felt special!\n\nAhh the good old days!  :)",
            "[deleted]",
            "[deleted]",
            "They didn’t starlifter. Heritage livery paint man.",
            "I don't believe TWA ever operated the 737.  Can anyone confirm?",
            "AA's \"now we own you\" heritage fleet.",
            "Yup. Cool to see",
            "I hate it that the TWA heritage plane is light grey and red instead of white and red.",
            "Or lots of banks.",
            "It was def a better time for aviation/airlines. TWA, USAir, Piedmont, Ozark, Northwest Orient, Republic, Continental, Eastern, Western, PSA, Midwest Express, Southern, etc.",
            "I’m glad to see they’re reviving old planes along w/ the liveries, they don’t make ‘em like that anymore!",
            "Same here! I grew up in St. Louis so TWA was a staple",
            "AND Continental. Probably more. :(",
            "PSA (Pacific Southwest, not Blue Streak) is one of my favorites. So 70s lol",
            "No, this is a heritage livery. \n\nAmerican has several of the airlines that have been acquired/merged with of the years",
            "No he had a 707 with QANTAS markings but he gave it to a museum a few years ago.",
            "Well obviously lol. It was still a sight",
            "I can't remember any but that does not mean anything.\n\nI did ride on TWA 727's a lot. I love that plane.",
            "/you're actually still in charge but we kept our name",
            "bank of utah",
            "It’s probably as simple as ensuring they keep the trademark active with the USPTO.\nIf you don’t actively market utilizing a trademark over a period of time you can lose it.",
            "The \"reverse takeover,\" kinda like Boeing/McDonnell Douglas",
            "According to your username, you owe me 3 more examples.",
            "Same reason UPS labels still have the “package with a bow” artwork by Paul Rand in the bottom right corner."
        ]
    }
}