{
    "Post-Launch Feedback": {
        "title": "Post-Launch Feedback",
        "score": 5,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1dpi75m/postlaunch_feedback/",
        "content": "Hello, /r/BaldursGate3!\n\n&#x200B;\n\nThe game is finally here, which means that it's time to give your feedback. Please try to provide \\_new\\_ feedback by searching this thread as well as \\[previous Feedback posts\\]([https://www.reddit.com/r/BaldursGate3/search/?q=flair\\_text%3A%22Post-Launch%20Feedback&restrict\\_sr=1](https://www.reddit.com/r/BaldursGate3/search/?q=flair_text%3A%22Post-Launch%20Feedback&restrict_sr=1)). If someone has already commented with similar feedback to what you want to provide, please upvote that comment and leave a child comment of your own providing any extra thoughts and details instead of creating a new parent comment.\n\n&#x200B;\n\nPlease try to be **mindful of** **spoilers** and use the info below to hide them:\n\n**On Mobile:**\n\n**Hide spoilers in comments format** \\- `>!insert text here!<` (no spaces between the text and symbols)\n\n**On Desktop:**\n\n**Hide spoilers in comments** \\- **Fancy pants editor:** use the square with the exclamation point inside (may need to click the three dots if not showing). **Markdown mode:** use the above format mobile uses\n\nAnother place to report bugs and feedback: [https://larian.com/support/baldur-s-gate-3#modal](https://larian.com/support/baldur-s-gate-3#modal)\n\nHave an awesome weekend!",
        "num_comments": 0,
        "comments": []
    },
    "WEEKLY HELP THREAD - READ FAQ, COMMUNITY WIKI, MULTICLASSING, LORE": {
        "title": "WEEKLY HELP THREAD - READ FAQ, COMMUNITY WIKI, MULTICLASSING, LORE",
        "score": 122,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1b2s3sr/weekly_help_thread_read_faq_community_wiki/",
        "content": "***THIS IS A SPOILER-FREE THREAD. FOR MOBILE, HIDE YOUR SPOILERS USING THIS FORMAT:***\n\n**Hide spoilers in comments format** \\- `>!insert text here!<`  (no spaces between the text and symbols)\n\n**On Desktop:**\n\n**Hide spoilers in comments** \\- **Fancy pants editor:** use the square with the exclamation point inside (may need to click the three dots if not showing). **Markdown mode:** use the above format mobile uses \n\n&#x200B;\n\n**Note on Subreddit Commands:**  Use **!faq** in the comments of a post for automod to post a link to this page. Use **!spoiler** in the comments to mark the post you're commenting under with the spoiler tag. Use **!wiki** for automod to post a link to the Community Wiki. ***Anyone may use these commands in the comments.***\n\n[For Mobile users, Go to 'See Community Info' for the FAQ and other links](https://preview.redd.it/xlxhmadjckfb1.jpg?width=720&format=pjpg&auto=webp&s=5d9604b184276f88c474a805b02c374cec774dc6)\n\n&#x200B;\n\nHey y’all!\n\nIf you’re new here or looking for info, this is the place to stop and check before you post that question you’re thinking about asking - the answer may already be in our [FAQ](https://www.reddit.com/r/BaldursGate3/comments/14l8ec8/baldurs_gate_3_early_access_faq_with_sources/)!  There's also some recommendations in there for learning about lore.\n\nI’d recommend also checking the **New Player Question** or **Question** **flairs** to see if your question has been asked before. You can also type into whatever search engine you use:\n\n**\\[insert your question here\\] baldursgate3 reddit**\n\nOr\n\n**\\[insert your question here\\] bg3 reddit**\n\nThat’ll help us prevent the subreddit from being cluttered with the same repeated questions.\n\nIf your question hasn't been asked (or asked recently enough) then use either one of the question flairs above and ask away.\n\n&#x200B;\n\n**BG3Builds and Multiclassing**\n\nFor the people curious about builds or who want a more dedicated place to discuss them, there's r/BG3Builds. There's a good guide on [multiclassing](https://www.reddit.com/r/BG3Builds/comments/14uggrg/guide_to_multiclassing_in_bg3_and_some/).\n\n&#x200B;\n\n**Community Wiki**\n\nConfused about what the different rolls mean or just want to find notable NPCs and loot in a location? Check out the [Community Wiki](https://bg3.wiki/wiki/Main_Page). It's ad free and being worked on by people here in the community :)\n\nEveryone working on this is doing a great job trying to prepare it for launch and beyond.\n\nIf you'd like to help contribute to the wiki, [here](https://discord.com/invite/K6R89fSZuF) is the Discord.\n\n[A Community Effort](https://preview.redd.it/yy1lqm61dkfb1.jpg?width=1091&format=pjpg&auto=webp&s=8808d61a675d303136783935a8912dffe9a88b0d)\n\n[Rolls and Modifier Examples](https://preview.redd.it/ch3bf5i2dkfb1.png?width=626&format=png&auto=webp&s=7daebd43c471ffe19e7dae151fc274280501f5d1)\n\n**Character Planner Reminder:** There is a **Character Planner** by GameFractal being worked on [here](https://baldursgate3.gamefractal.com/) (It's also in the **sidebar on desktop** or the **'See Community info' link on mobile**).\n\nIt's  a one person project, so updating it with the recent updates, adding   what launch will bring, and some other useful features will take time -   but it will be updated.\n\nThere is a feedback button on that site, please use it if you have any suggestions/constructive feedback. **Feedback is** ***very*** **appreciated!**",
        "num_comments": 8257,
        "comments": [
            "Just wanted to share my excitement with the world that I completed the game on tactician! I am someone who plays video games in explorer or easy mode, because I am just that bad at games. I can't believe I actually did it, and I'm so pumped about it!! The extra challenge was honestly really fun!",
            "I don't really need help but didn't want to make a separate post for this... finally finished my Honour Mode run at got the 54/54 achievements.",
            "I just wanted to say thanks to everyone for all the info and being so welcoming for a complete rookie. Loving this game and can’t wait to play again and again with different classes & choices.",
            "Pickpocketing - people always talk about how they pickpocket NPC's all the time.  I almost never do it because I worry about getting caught and causing a big fight.  Do people pickpocket one item at a time?  Doesn't the person turn around immediately to catch you?  Maybe I've had bad luck the few times I've tried so I've stopped trying.",
            "I feel so unburdened, just beat honour mode and was such a journey. Amazing game!",
            "Finished Act 2 and I just found out that inspiration rerolls are capped at 4. I should have been using them much more than I have, instead of hoarding them lmao.",
            "I keep getting incredibly annoying \"someone is editing a character- unconfirmed changes will not be saved messages.\" Im in single player. No one is editing a character. I have no idea what's causing this and it seems to be happening more and more, any fixes?",
            "So I'm in act 3 and fighting some wizard with aylin But she seems to just stand there and do nothing but I can't interact with her either is there some mechanic I'm missing or it a bug?",
            "My wife and I have been playing our campaign for like 6 months and we just made it to Baldurs Gate. Suddenly when she talks to people 90% of the time it freezes and we have to reload the game. She can't get out of the conversation and just nothing happens (same thing happens with the magic mirror in camp). Help!",
            "I judged this game too harshly. It converted me and I am now hooked."
        ]
    },
    "I saw Laezel’s ascencion for the first time": {
        "title": "I saw Laezel’s ascencion for the first time",
        "score": 2154,
        "url": "https://www.reddit.com/r/BaldursGate3/comments/1dquzlq/i_saw_laezels_ascencion_for_the_first_time/",
        "content": "This has to be probably the worst ending for me. The cutscene its self is very disturbing, you see Vlaakith sitting down non chalantly whilst Laezel walks up to her. You then see a bunch of those Githyanki zombies who have as she puts it “ascended”. It was very scary to see because Lae’zel was been brought up to believe that this is the highest achievement her people can reach. Seeing her grin fade them come back kinda gives me the idea that right before her death she realizes that ascension was indeed a lie but its to late to turn back. Man it’s sad",
        "num_comments": 132,
        "comments": [
            "Definitely on my \"things I can't bring myself to do\" list. Literally a fate worse than death for such a great character like Lae'zel.",
            "imo this is probably the worst ending for any companion. its certainly the most unsettling. even on an evil run i refuse to let lae'zels soul get consumed by some wannabe bitch god.",
            "Withers said she might have fought back and I choose to believe that because I wanted to try every character’s evil ending and hers was the worst 😢",
            "I feel like after you kill Voss Lae'zel stays in a perpetual state of denial (at least at first). She immediately says something like what's done is done but I don't really believe her.\n\nOne of the weaknesses of the Vlaakith path tbh. I feel like Larian doesn't even try to convince you that siding with Vlaakith is a good idea.",
            "Even worse is you can also clown yourself if you're Gith Tav, and go with her to Ascend.",
            "Wait is ascension really a scam??? I never got this ending before.",
            "I was able to ride off on a dragon with Bae'zel. After reading this, I'm even more satisfied that Orpheus gave his life for us to be and fight together.",
            "I think it's awesome that they have obviously bad endings for origins.  Still an ending I want to get after I finish my 8th dark urge sorcerer that fully embraces the urge. Maybe.",
            "But did you speak with Withers afterward? He says that someone like laezel may be just the kind of person to ultimately manage to avoid that fate.\n\nSo, maybe a little hope there.",
            "Ohhmygodh. I accidentally backstabbed Laezel at the very end and killed her at the docks. Guess that was a better fate than Vlaakith."
        ]
    },
    "Maybe being evil isn't for me": {
        "title": "Maybe being evil isn't for me",
        "score": 1022,
        "url": "https://i.redd.it/ha7w9m2dtd9d1.png",
        "content": "WHAT IS THIS 💀",
        "num_comments": 88,
        "comments": [
            "Well, that's not being evil. \n\nThat's being 'Bhaal's Chosen' and failing him miserably.",
            "That's the consequence for betraying Bhaal after embracing him so thoroughly. If you instead played bhaal, everything would've been peachy.",
            "Option 3 is the clear winner here, what's the issue?",
            "If you've gotten to that point in your journey, you've missed some road signs along the way.",
            "I 100% started a evil durge run FOR the pissing yourself option, I just wanted to see how depraved it could get, but the late 2nd act early third act got boring for me and never got there :(",
            "Yeah this is why no one should willingly work with Bhaal. Not worth it man's a clown. \n\nNow yoinking his plans for your own benefit...",
            "Oh god I've never seen these facial animations on a non-Dragonborn",
            "I went for this ending in my hypocrite Durge run, ngl it was one of my favorite playthroughs\n\nStill, can't wait for the new update with new endings",
            "I got this with my mindflayer durge and it was unsettling.",
            "How do you get to that lol, don’t think I’ve ever seen it"
        ]
    },
    "Just started my first run in Diablo IV... Couldn't resist.": {
        "title": "Just started my first run in Diablo IV... Couldn't resist.",
        "score": 504,
        "url": "https://i.redd.it/azxa9yzkpe9d1.png",
        "content": "",
        "num_comments": 27,
        "comments": [
            "On the one hand, awesome work. \n\nOn the other hand, I’m sorry about the bet you must have lost where the penalty was playing Diablo 4.",
            "Loving both Baldur's Gate 3 and Diablo 4: this is awesome.",
            "Oh wow, excellent work. It really looks like her.",
            "So she embraced Myrkul as well?",
            "I couldn't get Battlenet to load. Fuck Diablo 4.",
            "Guess that means you have a phone?",
            "I’m psychotic, I did this to myself. This post is just a coping mechanism.",
            "Diablo 4, season 4, has been awesome.",
            "It's a good way to pass the time while casually watching TV like a baseball game",
            "Season 4 was incredibly fun. It has turned around."
        ]
    }
}