{
    "Bambu Lab Store just turned two and our biggest sale is now live! 🎉": {
        "title": "Bambu Lab Store just turned two and our biggest sale is now live! 🎉",
        "score": 214,
        "url": "https://www.reddit.com/r/BambuLab/comments/1d8owyx/bambu_lab_store_just_turned_two_and_our_biggest/",
        "content": "Bambu Lab Store just turned two and our biggest sale is now live! 🎉\n\nWe're stoked to celebrate this milestone with you awesome folks. It's been a wild ride packed with innovation, creativity, and of course, tons of 3D printing fun!✌️\n\n**Save Big** on your favorite 3D printers!🎁\n\nClick here now: [Bambu Lab Store 2nd Anniversary](https://bit.ly/3Ra8GEk)\n\nhttps://preview.redd.it/oe60yhk70r4d1.png?width=1280&format=png&auto=webp&s=0e2432be0ab48132e67295b8cc501442f37da5d7\n\nhttps://preview.redd.it/te7hfhk70r4d1.png?width=2250&format=png&auto=webp&s=b97a1708a76e08c899bc68d7e80421503d87b771\n\nhttps://preview.redd.it/sx0juhk70r4d1.png?width=2250&format=png&auto=webp&s=6a9883642608eadb426c1a5c7e9d7eaafa0c8a50\n\nhttps://preview.redd.it/ead966l70r4d1.png?width=2250&format=png&auto=webp&s=298c75af9919e25b8a1839bd5a2e0b1e27dd31a4\n\nhttps://preview.redd.it/w8i3glk70r4d1.png?width=2250&format=png&auto=webp&s=5666fdd4af2dc5a468b5a1410632abee4b1633fc\n\nhttps://preview.redd.it/h4g1pfl70r4d1.png?width=2250&format=png&auto=webp&s=1d507d8eadfc89e12bf8235160bc5153cfbad7c4\n\nhttps://preview.redd.it/4gpaf5l70r4d1.jpg?width=2250&format=pjpg&auto=webp&s=c49956c94e15eaf4136b37b386d1264fe4d5caf1\n\nhttps://preview.redd.it/epv835l70r4d1.jpg?width=2250&format=pjpg&auto=webp&s=33f9e910898822089db6309c45303042e7db2c42\n\n&#x200B;",
        "num_comments": 344,
        "comments": [
            "I don't need anything, I don't need anything, I don't need anything. Trying to convince myself.",
            "Been looking at purchasing a Bambu for a while. Finally decided to pull the trigger yesterday. Went into the website last night and saw the sale. Had my cart built and checked out as soon as the promo prices went live. I'm very excited.",
            "Just so everyone is aware. Previous prices were cheaper for up to 3 rolls.\n\nEdit: corrected a typo.\n\nhttps://preview.redd.it/nnj4q3c92r4d1.jpeg?width=1080&format=pjpg&auto=webp&s=4a0e5d2c65ceb36abd62c055c07f5266e061093f",
            "Micro Center has the same prices going AND if you have the Micro Center Insider Card you get an additional 10% off the purchase rather than the normal 5%.\n\nhttps://www.microcenter.com/brand/4294804936/bambu-lab",
            "In for an A1 mini, will be perfect for when my P1S is busy",
            "I got myself an A1 (without the AMS). This is my first printer so I am super excited.",
            "just ordered a x1c😍\nhope arrives quickly",
            "Remember Bambulabs has a big event later this month where they will likely roll out the next line of printers and the sale will be going for a full month. \n\nDon't jump on these \"deals\" just yet, wait until after the event/announcement as the sale will still be going and then decide.  No one wants to buy a last gen printer days before the next gen releases!",
            "Just wanted to point out if you're purchasing an A1. The \"[0.2mm/0.4mm/0.6mm Hotends Kit - A1 Series](https://us.store.bambulab.com/products/a1-series-hotends-kit?variant=41581106135176)\" is only 21% off when purchased with the printer. However, you can purchase the three accessories independently for 35% off instead, saving yourself money. This also lets you choose which hotends you want, instead of being stuck with the 0,2/0.4/0.6 in the kit.\n\n  \nI did not notice this in time for my order, but hopefully someone else can benefit.",
            "Bought the P1S combo! Good bye Ender 3 Neo. Anyone add recommendations for someone new to Bambu?",
            "I thought this was supposed to be the \"biggest\" sale ever (or that's how it was hyped up to be).\n\nBlack Friday 2023 X1C w/AMS was $1299 plus two free filament. Now its $1299, no extra filament.\n\nSeems like a similar sale but certainly not \"biggest\".",
            "I really wanted the ams to go 250. so it will be 300 (hub + ams)\n\nFor 350 I'm not sure I'll take the bait really :(",
            "Even though I have survived -and could survive - without the AMS for my P1S, I just pulled the trigger since it's the first time it's ever been on sale.   My printer is 2 floors below my office, so I'm just trying to save some time not having to run up and down the stairs.  I'll be putting it next to the printer, as I don't have enough clearance to put it on top.",
            "Also worth noting microcenter has the sale prices aswell",
            "Aaaaaaaaaaaaaaaaand PLA in AU with spools are nearly all sold out within 45 minutes :D\n\nI still managed to get what I wanted though :D",
            "am i blind or is there no hardened steel nozzle\\\\extruder set for the P1S in the store?",
            "I have really been enjoying my 300x300 non-Bambu printer for the past couple of months, but I have been curious about the multi-color capabilities through Bambu and was totally ready to get the A1 Mini Combo, but with the price of the full-size A1 Combo, it was a no brainer to just spend the extra bit of cash now rather than regret not having the extra build volume later.  Fingers crossed that I like this at least as much as the other machine!",
            "Vouchers and codes all work with this. Had enough points for the LED lamp kit, so got one of those, a smooth PEI bed and a 0.4mm hardened nozzle for my A1 all for less than the usual price of the bed alone.",
            "When adding the printer to the cart with attached discount accessories, the discount is no longer applied in the cart. I still purchased, but wish I would have received the discount on filament and hot ends.",
            "And I now have two more ams on order. I hate you. \n\n\nThank you",
            "Upgraded from a Monoprice Select Mini to a BambuLab A1 Mini 😊 Can't wait!",
            "Pulled the trigger finally on a P1S combo",
            "P1S owner here. Just placed my order for the AMS at 8:43am EST in Canada, and at 11:04am I have my Fedex tracking number! Needless to say, Bambu labs are ready for the rush!!  ;)",
            "Placed my order at the 2-minute mark post live. Hopefully that means shipping times won't be too long. :)",
            "Timely sales, I wanted to buy for a few weeks : Went on with X1C + AMS + 2 spools of filament + smooth plate + 2 sets of nozzles + swatches + glue stick.\n\nLooking forward to the Bambu experience",
            "Looking to order this up today... question is... should I order directly from Bambulab or get it at Microcenter locally? Assuming no extra Insider discount and shipping time is not an issue. Any reason to order directly vs Microcenter? Does ordering direct have better service or warranty service etc?",
            "Just bough an A1 mini with an AMS lite and a .2mm nozzle for the a1 mini. My bank account does not like me.",
            "I have been loving my X1c. Just purchased the A1 combo to try getting into multi color stuff.",
            "Got my second X1C!",
            "Is the Filament a good price compared to other brands?  it does print very well..  Is this a good buy or just head to r/3dprintingdeals  :-)?\n\n  \nedit: i need a fresh refill of everything... so probably buying 10-15 rolls",
            "I was like 4 months ago to pull the trigger. I said... I don't need it, I don't need it. It last until tomorrow I saw the offer and... That it",
            "https://preview.redd.it/3oro2wzbzr4d1.png?width=1145&format=png&auto=webp&s=dce2c9b7123ad7845b98612ace2a8315936421fe\n\nI know that the bulk discount doesn't apply to specialty filaments, but shouldn't they still count towards the number of spools for the purpose of meeting the qty requirements?  In the screenshot above, 8 spools of filament in the cart is not qualifying for the top tier discount because one of the spools is Glow filament.",
            "I have a 10% rotor voucher I have been sitting on that looks like it only stacks with printers. I don't need another printer so DM me and I'll randomly pick someone to send it to.",
            "Just got my 2nd Bambu! A1 and A1 mini!",
            "Recently bought a combo and wanted to see if I could get a price adjustment refund. The chatbot said this\n\nIf you purchased your printer/AMS from our official web store and received it on or after May 20, 2024, we can provide you with a price adjustment. [Click here to submit your application.](https://support.bambulab.com/en/activity?activeCode=8a6nje5mqwhjw16caoex) Please note that the price adjustment applies only to printers/AMS.\n\nThis does give you the difference back on a gift card.",
            "Are these better than Black Friday deals or should I wait? I currently have an MK3s+ with a volcano hotend and am interested in AMS.",
            "I ordered the p1s combo. wish i would have ordered the ams separate to save an extra 50 bucks. :(",
            "Just used my $120 A1 credit on more filament and a .2mm nozzle",
            "Bought about $800 in stuff! Two AMS units, filament, and some extra nozzles! Shame a lot of the build plates were sold out, but I'll get them later!",
            "Wish i was paying attention when i bought 8 spools yesterday, but I had been on the fence about getting a 2nd x1 carbon combo. $1,299 made it much easier to pull the trigger today.",
            "Well between the sale and some cards could get a second AMS for about $200…. Hmmmm",
            "Finally got my wife open to it with the sale.\n\nNow the question is, if I tell her I'm getting the a1 mini but actually order the full a1 combo, will she notice...",
            "How long is this gonna last?",
            "Has anyone ordered from the EU store in the past few days? I ordered a P1S+AMS combo on Friday, but Bambu hasn't even handed over the package to the courier company (DHL) yet. What are the experiences, what kind of delivery times can be expected in the EU nowadays?",
            "Yay, now let me by filament, I don't even care if it's on sale or not, every PETG is out of stock :(",
            "Filament not being discounted in cart. Tried to buy 10 rolls of PLA",
            "What’s more worth it: one X1C combo or getting the p1s combo + A1 combo?? Helppp",
            "adding the A1 Series Hotends Kit with the A1 and A1 Mini shows its non-discounted price, how to fix?",
            "I bought my A1 Combo 10 days ago, so I just missed the salde :(",
            "Are any of the other size hotends worth getting?\n\nBackground - been using .4 with the A1, 3D printer is mostly used for cosplay parts and smaller decorative trinket type pieces. Thanks in advance.",
            "Bought printers two A1 mini, and at last PETg translucent came back just in time",
            "Happy birthday! Thanks for making 3d printing fun for us 🤗",
            "Got the AMS lite and a bunch of filament to go with it. I thought I would be fine with single color printing but I came quickly to realize that AMS is a huge help if only for not having to switch materials so often anytime I want to change a color/material. Was almost tempted to upgrade my 2 months old a1 mini to a x1 but I will wait for the next generation of printers from Bambu.",
            "Are the filament bundle prices permanent or only for this sale? Because it looks permanent to me (since there isn't any date on the filament page [https://eu.store.bambulab.com/pages/bambu-filament](https://eu.store.bambulab.com/pages/bambu-filament) )",
            "AMS for 189 shipped after a 150 coupon they issued from my X1C purchase two weeks ago. Not bad!",
            "Not sure if it’s on my end or theirs, but certain sale pages are not loading great and are glitchy when I try to add to cart. On the US site. Like I select a specific color, but it adds a different color no matter what color is actually selected. I’m sure they’re getting slammed with purchases right now.",
            "Decided to bite the dust and bought the A1 + 2 PLAs fillaments + hotend kit. Didn't buy the AMS as I don't envisage doing multicolour printing. Hopefully I won't be disappointed.\n\nI wonder how long it will take for them to fullfill the orders.",
            "I’m grateful for the sale, I just ordered my first printer from you all today!",
            "Really tough choice between P1S and A1. Full auto calibration and a nicer screen are pretty nice, while also being cheaper. Since I'm printing indoors, I have no interest in materials with more fumes.",
            "So this sell was kinda cool timing for me.  I have an A1, decided I wanted a AMS  was going to order that for $250.  Waited and got the A1 Mini and the AMS on this sale ($350),  so essentially I got the A1 mini for 100$ if my math is mathing.",
            "I have x1c but want a 2nd printer. Is p1s pretty comparable?",
            "I ordered mine :) (x4)",
            "You guys ran out of the plates :(",
            "Im planning to buy the A1 but im not sure if  I even need the combo becuase I never wanted to print multicolor so far. is this really such an upgrade from single color printing that its worth the money?",
            "Picked up a lithophane filament bundle, a 0.2 mm nozzle for my P1S, and 2 LED lamp kits.\n\nDebated on getting a hardened steel 0.4mm but I feel like I don't need it just yet.",
            "All I know is that the time it was supposed to start would be 4:00 PM local time for me. Apparently it actually started at 8:00 in the  morning.",
            "And we killed the store...",
            "And the AMS stays at 350 so it’s gonna stay right where it is",
            "Site is down.",
            "Hope you get the US store back online soon ... as of 14:36EST it's a 504 Gateway Time-Out error.  Luckily was able to get my order in early this morning.",
            "And it's back up",
            "Still waiting for 2 months for my order of PLA - CF to be fulfilled.",
            "Considering either A1 or P1S. What would you recommend? How do they compare in printing quality? Noise doesn't matter for me, printing speed is secondary.",
            "filament doesn't seem to be on sale in CAD, doesn't show in the page, or the cart or even at the checkout screen",
            "Aaaarh - literally received my P1S Combo two days ago. Could have saved €200 compared to the Danish store price :'(\n\nStill - I'm already in love, and happy that I got the AMS also, so for anyone on the fence - it's a great product :-D",
            "I got a a1 mini combo last month and today I got 2 extra minis without the ams and a a1 combo. \n\nA month in and I own 4 printers - I was only supposed to buy 1 extra printer today",
            "Of course I ordered a printer 5 days ago",
            "Was eyeing an A1 mini, sale was the tipping point. Even though the filament was supposed to get discounted if you added it to your cart at the same time as the printer it wasn't so skipped that and will get some cheaper eSun stuff.",
            "I got an A1 mini and a x1c. Debating with my 150$ credit on either getting an A1 or another mini",
            "I am new to 3d printing. I am looking at P1S Combo as my starter machine. Do I need any add-ons or filament to start? Can filament be purchased elsewhere for a better price?",
            "So I've been planning to get the P1S combo, extra hotends, smooth PEI plate, and filament on this current sale. But I see the smooth PEI plate is out of stock.\n\nIf I want the 20% off plate discount, is my only choice to wait until it comes back in stock to then make it an addon to my P1S? I'm worried if I wait, then something else in my cart might go out of stock, and then it becomes impossible to get everything I'm looking to get in one cart/order. Any insight?",
            "Just a heads up if you purchased from microcenter before this sale, you can reach out for them for price protection if you're still within the return window\n\nI purchased a p1s ams for $950 three weeks ago and got adjusted down to the $850",
            "Quick question, the sale says it's going until July 5th; I plan on ordering an A1 on next wednesday. Will stock be in good shape? I just don't want this to end up being one of those sales where it lasts for a month but runs out of merch on like day 5.",
            "Finally checked out my cart when the sale started.  Now the impatient waiting begins.",
            "Has anyone recieved their \"credit\" that bought right before the sale?  If so, how did it come to you?",
            "I just bought my second Bambulabs Carbon X1. I wish I had a whole room dedicated to them. Now we just need to make them run faster.....",
            "Any plans to restock the AMS on the Canada store?",
            "Ugh, I missed getting another AMS. This is what I get for thinking \"bah thats probably not on sale\".\n\nNVM it's already back. I have now paid for my overpriced contraption to avoid walking over to my printer 😁",
            "After scouring reddit/YouTube, I am looking at the A1 Mini for my first printer. Unsure if I should spring for combo with the AMS Lite or just go with the printer itself for now. Anyone have insight here? I'm not sure I'd be doing multicolor printing right off the bat but seems like it might be worth it (especially given the sale) for later on.",
            "I had just ordered a ton of filament and a p1s before the sale, I regret everything",
            "Anyone Think this year Black friday Will be better than this sale? \n\nWanna get a p1s combo and Maybe a second ams😆",
            "Does anyone know if you can order and use a FedEx location as a pickup option?",
            "Saw this sale and picked up first 3d printer: A1 + AMS Lite",
            "anyway to get the AMS for the  same price as the combo? Made a mistake ordering just the P1S, now I kinda want the AMS but I got to do return and rebuy?",
            "Question for everyone, I'm wanting to get into 3D printing as a hobby and wanted to know what you would choose between getting the A1 + AMS or getting the P1S by itself? Trying to figure out what's the better buy without going too crazy on spending atm.",
            "I took this opportunity to finally give my P1P the AMS it deserves. I've had it for over a year now, it's a P1S at this point, I've done all the upgrades, except I have a printed enclosure because the conversion kit didn't exist when I got it.",
            "I just bought a P1S and I'm stoked. The sale convinced the wife since we are saving money by spending money 😂. Thanks!",
            "Does anyone know when the sale ends? Would love to add an A1 mini but I have to wait for my next paycheck.",
            "Why is the shipping for the P1s combo $200 while the A1 combo $55?",
            "Will they restock filaments on spools before the end of the sale. I really want to round out my pla colors. What a bummer that so many filament with spools are out of stock",
            "Yeah too cool as I already bought an a1 mini and ams. Just now I ordered the a1 as I already have the ams.  Very impress. Thanks bambu",
            "Can anyone help me figure out the sale on the nozzles for the A1 series?  As in, are they on sale?  What's the normal price for them?  Just got our printer, and I'm thinking I should upgrade to the hardened steel instead of stainless (when it's back in stock).",
            "Anyone else think they will announce their new printer as soon as this sale ends? I'm looking to upgrade from a modified ender 3 to a PS1 Combo and it might suck if they release their new model as soon as the sale ends :)",
            "Ordered mine 5 weeks ago, oh well! ",
            "It would be great if your payment processor would not eat payments wiothout proceeding...\n\nIt just ate the payment without confirming the order, i dont even have the order number, just the session token.\n\nAlready made a support ticket, hope they will make it work somehow.\n\nStill if you plan to order something i would advise not using their own payment processor, use paypal!",
            "I have been meaning to buy X1C, but was waiting on Black Friday sale. Should I wait for Black Friday or the sale right now seems like a good deal ?",
            "How long is the sale going on for?",
            "Cool so how 'bout that new flagship",
            "I just bought an AMS last week, is there any way for me to benefit from this sale retroactively?",
            "How long is the sale on for???",
            "The X1C is not discounted in EU store",
            "The A1 Voucher is not working. Why?",
            "I bought some hot ends but was disappointed because some other spare part items I wanted was not on sale. (I ordered them anyway.)",
            "Hello: \n Does anyone know how long this sale will be going on?",
            "How long does the sale last?",
            "The AMS lite costs 220€ its more expensive than an A1 Mini. Its so overpriced. Its not worth it",
            "I am about to press the buy button on the P1S. Does anyone know of any discount codes that can be stacked? Dont want to order and then miss out on a chunk of change :)",
            "Wish that bambu would have honored the sale price a little earlier. Got my a1 mini on may 16, but cutoff was may 20 for the price match. :(",
            "When do the sale go till?",
            "i am a bit underwhelmed by the filament prices, the are still insanely expensive",
            "I almost submitted my order, I did a quick search on any other accessories I would need for the X1 and saw they are having an announcement in July. I will hold off and get the next-gen if it is better than the x1",
            "If I’m still in the 2 week return period is there any credit I can get?",
            "The fact that you guys are young prices on filament is sad, you should be ashamed and I hope no one buys them.",
            "Yea... Like I don't need a 2nd AMS...\nOH, who ordered another ams?\n\nWent well",
            "Good luck with that one",
            "Bitcoin is doing very well today.  Sold enough to buy an AMS lite.  Could always use some AMS love in your life, right???",
            "Do it...do it...do it! ;p\nI just purchased for 700€. I bought a second AMS, filaments and extra nozzles. Couldn't help myself. \nAlready had that AMS hub installed on my X1C. That hub was calling out to me to feed it. It said: \"I feel empty. I need more!\" True story.\n\nAnd I purchased 20kg of Sunlu hs-pla for prototyping and pair of birkenstock army green knockoff sandals (why not) yesterday on Ali for 200€. \n\nAlso just purchased 2 dual high temp/engineering plates on a 3rd party store as I see they are not listed in the eu store. They're gone? I love the engineering plate for petg and engineering filaments. The cool and high temp sides are garbage. I'm still not happy they got rid of tough pla and now this.\n\nWell, I'm almost 1000€ lighter this month. I could've bought the positron v3.2.\nI'll try eating bread with generic choco paste for a whole month.",
            "Me too! I've been debating the A1 vs A1 Mini, and decided to go with the Mini combo. The bigger bed would be nice, but the lower price, smaller footprint and quieter operation won out.",
            "Yeah, now you only get discount if you buy more than 8. They raised the price if you buy less than 8 and 4 about $1-2 depends where you live.",
            "Yeah I remember seeing 16.99 for basic refills.",
            "Not in my country either, not even close\n\nIs this a bug?\n\nPLA with spool was 28.99 and refill was 25.99 for 4+\n\nEdit: AUD\n\nhttps://preview.redd.it/ugvrvlvu0u4d1.jpeg?width=1290&format=pjpg&auto=webp&s=90d74596c6d43f03904a046a125094821f63843e",
            "That explains why the spools I had in my cart in preparation for the sale went up $10.\n\n\nShould have bought before the sale, ironically. I'm new to Bambu. Do they do this stuff often?",
            "Because they have done away with the 2 and 3 rolls discount you mean?  \n  \nTo me it looks like they have lowered the standard price of their filament rolls, for example a single refill roll is now €23 (from €28) and if you buy more than 4 you get a discount, a bigger one than before because according to your screenshot they were €19/ea and now they are €17 (4-7 rolls) or €16 (8+ rolls)  \n  \nTo be honest I'd be surprised if many people actually made use of the 2 and 3 rolls discount, so it makes sense they did away with it.\n\nhttps://preview.redd.it/auywuqsbpr4d1.jpeg?width=1903&format=pjpg&auto=webp&s=89fa9766b5629448ccf1f5eb43b3f3c38e2bf71d",
            "I would love to have a microcenter near me.",
            "Are they sold out? I don’t see any Bambu printers",
            "Wish they sold standalone AMS units",
            "I feel so lucky to have one in my town and just so wish they sold the A1/A1 Combo!!",
            "I bought from microcenter 2.5 weeks ago 😭\nAny chance they will honor some kind of refund?",
            "Lots of people say don’t get the a1 mini if you have that P1S but I love having them both. Like having a father and son.",
            "Same here ... Have a new X1C with AMS so picked up an A1 Mini so I can do smaller jobs while the X1C is tied up.  For $199 it's a perfect fit to replace my Vyper.  Didn't get the AMS lite mostly since I won't have the room for it where the Vyper currently sits.  If I need multi-color I'll just use the X1C.",
            "You won't be disappointed.",
            "Get the AMS my friend 🙂",
            "I really hummed and hawed about the ams and as a family decided to eat the extra cost \"just in case\". It's awesome, so glad we have the option even though we don't multicolor print often.",
            "I have it and it's been a great printer. I think you'll enjoy it and it's nice and quiet compared to other printers I've had.",
            "Enjoy! It's an absolute dream to work with, I've had zero failed prints so far since getting it, meanwhile, my Mars 4 is making me want to pull my hair out.",
            "Really recommend getting it with the AMS. Even if you don't do multicolor prints, it really makes the printer so much easier to use.",
            "Good choice, you're going to love it!",
            "Already bought the P1P 2 weeks ago. So now I'm going to just get a .2mm, .4mm and .8mm nozzle",
            "When is the event later this month?",
            "When is the event?  Any info on what the upcoming models might feature?\n\nI'm between the X1C and a Prusa XL with two heads.  I don't need/want five heads, but an X1C (or the like) with two heads would be great for speedier/less wasteful multicolor printing, or printing supports out of cheaper material, etc.",
            "Are you thinking this 3d printing conference/event/fair? I know Bambu was giving out tickets a while ago, and it would make sense to reveal a new printer there. \n\nhttps://www.rapid3devent.com/",
            "Where did you see the sale is lasting a full month?",
            "I would recommend to print a \"poop chute\". Makes multicolor less messy",
            "What kind of recommendations are you looking for? Things to print? Spare parts to order? Filaments?",
            "Biggest sale meaning largest number of things on sale",
            "During the last black friday, the two free filament offer was short lived and didn't last the whole sale.",
            "it's a sale to clear up inventory before they announce product refresh for the year in the coming months.",
            "yea i agree. i hoped they would do a HUB+AMS for 300 one time only per customer. and then continue selling AMS's for 300 each.  currently its a bit much",
            "You don't need the hub just buy the 4-in-1 ptfe adapter and put it before the buffer",
            "For what it’s worth I have 3x to the right of my printer and at least for me it makes far more sense.  I don’t leave the lid on when printing pla and the ability to just reach in from the top if I need to clear something (random poop on the bed) is so much easier.",
            "Isn’t it the same as the one for the x1?",
            "No, I can't find them either.\n\nThey had both yesterday or the day before, since I was planning on getting a hardened 0.6mm.\n\nNow, There is only one type, and it's not labeled whether it's stainless or hardened.\n\nSUPER unclear.",
            "From a post I was reading yesterday I think they just made all nozzles except the .2 for some reason as default hardened steel.",
            "so what 300x300 you own ?  just querious",
            "Isn't the discount on the hot ends and filament bigger right now when not using the attached discount accessories? I mean add them from their own page for a higher discount, I think.",
            "Is the AMS hub actually required?",
            "Damn you have been holding out for a while! This is going to be such a dramatic difference in quality and speed.. pumped for you. Congrats",
            "Ditto that.  I've already got a P1S, but I'm still pretty excited about my Mini.",
            "had everything in cart, placed order when the sale went live. 4 hours later I got a shipment notification and now UPS is showing delivery on friday! I'm in CA and shipment is coming from Southern CA, so just two days transit time.",
            "I made my purchase  10 minutes after the sale started. Paypal was being stupid. Shipping was solid for a small little nozzle but a whole printer, ams lite and a nozzle might be a little much.",
            "With the glow filament just be aware it is super abrasive. It will wear out a nozzle quicker than \"normal\" filament like PLA and ABS",
            "Just my luck. I received mine 14th",
            "How so? Was checking them just now and seems like separate they would be $900 and the combo is $850.",
            "I am waiting on this, how long did it take?  How did you get it u/IndustrialJones",
            "I did this, she didnt notice, yet",
            "I'm also not seeing a discount for filament. Only the bulk sale discounts which have been ongoing for a while now. Went all the way to payment page and no discounts shown.",
            "I also don´t see any kind of Filament discount, even at the end.",
            "The filament will show up in the cart at normal price. Then at the bottom you should get something like this\n\nhttps://preview.redd.it/fwrnmg50yu4d1.png?width=379&format=png&auto=webp&s=d62f4d511e9fe5d6b632c638a6da4415f137e973\n\nsorry about the low contrast that is just how it is for some dumb reason\n\n  \nedit: Text version of that picture:  \nDiscount (\\[Add-ons Deal: Accessories -6.00x1\\] & \\[Filament Discount: PETG Basic -$10.00x1; PLA Basic -$10.00x19; PLA Matte -$10.00x3\\])\t-$236.00",
            "It summarizes at the end, you get a discount breakdown in the bottom of the cart.",
            "Depending on the type and amount of materials you'll be printing. X1C combo is good for more exotic materials. If you plan to print a lot of stuff with mainly PLA, TPU and PETG then the P1S combo with A1 combo is a good option. Another option is to get a second AMS for the P1S instead of the A1 combo if you don't plan on printing a lot of stuff simultaneously. Helpful for multicolor prints or to automatically switch to another spool when one runs out.",
            "If you are using machines for products then two machines will always be better than one. If it's for fun, get the nicest one and go all out imo.",
            "to anyone with the same problem, it shows the discount different to normal, as a text at the bottom of the page-odd",
            "I believe there is a process to get a rebate if you ordered after may 20th....",
            "I think you can contact support and get a refund of the difference in price if it was delivered after the 20th",
            "I use a .2 for colour lithophanes, but .4 for pretty much everything else.",
            ".2 is pretty useful for small stuff that requires precision.",
            "I ordered a 0.2 because i want to print some jewelry (earrings) for my daughters. I also ordered a 0.6 so that I can print some droids for me. I also ordered a 0.4 for a backup.",
            ".2 is really nice for small details but the print time shoots up drastically and it limits the filaments you can use slightly. Ive also heard .6 and .8 are good for really quick, lower detail parts.",
            "I think they are since they changed the bulk pricing charts.",
            "One time use coupon? I'm on the fence of buying my 1st printer ever and looking to see if there's any coupons I can use 😅",
            "Does A1 mini also have auto calibration like all the features of A1?",
            "what do you mean? its on sale for 300.",
            "p1s. core-xy prints better than bed slingers",
            "Went A1 based on:\n\nhttps://www.youtube.com/watch?v=vxstq8X2agU",
            "Request a refund. They’re giving them if you qualify.",
            "I got a P1S two months ago and bought an A1 last week. They’re super amazing to have.",
            "You don’t need any add-ons, everything you need will be in the box. The P1S ships with three spools of filament, usually two different colors of PLA and one spool with support filament. \n\nAdditional filament can be purchased wherever you want, it doesn’t have to be BambuLab filament. As a beginner their spools will be a little easier for a number of reasons, but they are also obscenely expensive. So use their stuff to learn and then switch to something cheaper.",
            "Did the same here! Will have to go into the store if you didn't use an AMEX card. Their prices also went down to 850 so it's not even price matching with Bambu, it's just getting a 100 bucks off their own updated price",
            "A1 combo 👍",
            "July 5th I believe.",
            "Were you able to file for a price adjustment ??",
            "If you click on Support / General Support ( [https://support.bambulab.com/en](https://support.bambulab.com/en) ); there's an automated form to generate the difference in price based on past invoices and the criteria. I wasn't able to deep link it, but at the time of writing, it was the top question in support bot.",
            "The site says to contact support for that.",
            "Yes it is.",
            "It says in the first picture.",
            "July 5",
            "It is one month long. Not just today",
            "Sale lasts 1 month.",
            "You don't know how many times I added it and took it out of the cart.",
            "I've been using the A1 mini for a while after having the same decision. The small footprint is a godsend in a flat and I haven't actually needed to print anything bigger than the bed yet.",
            "Not sure how it is for the USD people, but in € this is not the case. The discount for 4+ rolls is higher than it was before, it used to be €19/ea and now they are €17/ea.",
            "That's not true. The discounts start at 4. But no discounts under 4.",
            "It won't let me put more than 7 rolls into my cart.  Seems kind of shady.",
            "Odd since others are dropping. Elegoo Rapid PLA/PETG can be had for ~$11/spool in 4 per box sets.",
            "I'm new to bambu also. I think we just had bad luck. I ended up taking 4 with one metallic and ended up  saving some. \n\nIf we wanted 8+ rolls the save would be great. Bad luck I suppose?",
            "It was a sweet deal for the 3  refills/rolls + free shipping for me. If you needed some spare part, with 2 rolls you were on the free shipping pretty easily. \n\nIt was a pretty good deal. 4 rolls is harder to cone by now. Again, for me.",
            "It’s nice, I’ve got 2 that are about 20 minutes away from me",
            "Did you set a store location near the top left? If it’s set to Shippable items, then you won’t see any printers.",
            "[They do sell the A1](https://www.microcenter.com/product/676237/bambu-lab-a1-3d-printer) but I don’t see a listing for the A1 Combo",
            "I’ve heard they will offer a refund for purchases made in the last 30 days.",
            "Thank you for saying this. I was in a huge dilemma the past few weeks whether to get Prusa (Mini+) or Bambulab (A1 or A1 Mini). I hope I did the right thing.",
            "My budget at first was 300-400€. So it was either A1 Mini with AMS or A1 without the AMS. Maybe I'll get the AMS in the next few months.",
            "I wish I got the AMS with my P1S even at full price.",
            "Preparedness averts peril.",
            "It was either A1 Mini + AMS or A1 without the AMS. I'm still a student so hopefully I can save some and buy the AMS in the next few months.",
            "That's probably it. I don't remember the exact details I just know it was going to happen during the sale and there were whisperings in the Bambu forums that we would be getting a big announcement during it",
            "Apparently not: [https://www.reddit.com/r/BambuLab/comments/1dgw3iq/bambu\\_lab\\_confirms\\_no\\_new\\_products\\_at\\_rapid\\_tct/](https://www.reddit.com/r/BambuLab/comments/1dgw3iq/bambu_lab_confirms_no_new_products_at_rapid_tct/)",
            "Right on their site, fine print under the first image, June 5th - July 5th.",
            "Spare parts and any upgrades that are popular. I plan on using my existing SUNLU PLA spools first - any concerns with that?",
            "You don't need the hub. Just get the 4 to 1 splitter it's like $5",
            "wait what?  Their page says \"YOU NEED A HUB\" .... so you dont?",
            "They’re labeled in the pictures when you click on them. 0.4mm and above only come in hardened now.",
            "Sovol SV06+",
            "I tired, when adding the add-ons with the printer, the discount didn’t apply.",
            "Required I have no idea. I have it so it’s not something I’ve looked into",
            "I upgraded from a Prusa Mendel i2 (from 2012 or so) to an X1C and it felt like I had discovered fire. The difference is so insane to me lol",
            "Thanks! :)\n\n I got that printer 4 years ago, was my first one. Learned a ton with it, tweaked cura profiles until there was no tomorrow, not a single thing breaking in all those years. Trusty little printer, a true workhorse, and nice print quality when dialed in. \n\nBut now its time for more speed, less noise, better quality and a bigger buildplate. I am really excited! :)",
            "Also have a P1S with 2 AMS and debating getting a mini",
            "Awesome. I bought an A1 and a smooth PEI build plate and got a notification that a shipping label was created. It says, \"Partially ready to ship\".  \n  \nWith the smooth PEI plate being out of stock now, I wonder if I'm going to have to wait until the entire order is ready to ship to get my printer.",
            "I just got an update that it will be delivered on the 11th for me. Since they ship out of CA, I guess that makes sense.",
            "I think my ticket was submitted around February 20th and I just got the heatbed over the weekend and the $120 coupon came either Sunday or Monday.",
            "The bulk sale discount IS the discount, it's just that the structure of the discount has changed.  Now the best price is cheaper, but you have to order at least 8 spools to get that price.",
            "Should have, but didn’t.",
            "Someone else told me that X1C is better if I’m using more exotic materials but if I’m just using pla, petg, tpu, then it’s better to get the p1s and perhaps add second ams. Still pretty conflicted, appreciate the advice",
            "It was, I will try",
            "Thanks for that, I think I'll grab a .2 and .6 and experiment.",
            "How difficult is it to replace the hotends? I'm assuming once you put one on most people don't switch back and forth?",
            "I think I'll grab a .2 and .6, thanks!",
            "I might do the same.",
            "Thanks, yeah I was wondering about the print time with the smaller nozzles.",
            "[removed]",
            "Thank you",
            "Thanks - I have tried now - lets see how it goes. Complexity is, that I decided to buy from a Danish webstore rather than directly from Bambu Labs. I'm not expecting full compensation, but hope for a significant compensation of some sorts... :-)",
            "I was sceptical, but wrote a friendly and polite mail - less than ½ hour after they opened, I had a gift card for the full difference! Thanks for encouraging me :-D",
            "Which do you like better? Or more specifically which do you think is more bang for the buck?\n\nI feel like in the past when the A1 first came out, everyone said the P1S is hands down better. But recently I have been seeing people noting that the A1 is better bang for buck and quality is almost identical. Noting to wait for a P1S tech upgrade or buy the A1 since you could basically get 2 A1 combos for the price of 1 P1S combo.",
            "Fillaments are also on sale, so they are not obscenely expensive, just a bit.\n\nDisn’t know it comes with 3 spools though, guess I’ll be printing a lot during summer :D",
            "Thank you. That'd be plenty of time to get an A1 mini.",
            "That is only for printers I thought not accessories?",
            "I got confused because It was showing with German VAT even though I am shipping to Denmark",
            "Thank you, sorry for that but I have a vision issue and missed it",
            "Great, thanks!",
            "One month, read the image linked.",
            "Mine already arrived this morning. I won't get to play with it until the weekend, but I unboxed it to check for damage (because FedEx left a box marked \"This end up\" sitting on its side). Holy cow is it small!",
            "Yeah I made the mistake of ordering PLA last week and had 6 rolls; the refills were $21.99 for me, but they’d have been $19.99 now. For the drop you see at 8 I think I would have tossed two more rolls in there. :-/\n\nlol the impulse buy of a roll of their Galaxy PLA stings a little but knocking $7 CAD off the price feels like the correct move.",
            "Most places are cheaper.\n\nThere's not much of a reason to buy BL filament.",
            "Where can you get that price for 4 rolls, their main website?",
            "Maybe. I'm not familiar with Bambu filament. The only reason I'm looking at their stuff is because the AMS supposedly syncs up,  but I'm honestly kinda spiteful and having the carpet pulled out from under me on this one makes me want to shun it, lol.\n\nI'll probably still get a few spools to check them out, but it's lying to say I'm not at least a little bitter about it",
            "I'm sorry but... I really don't understand why you two are complaining. Yes, if you were only planning on getting 2-3 rolls then it's more expensive now but if you get 4+ rolls, like you did, you have saved more per roll than ever before, so even when buying 4-7 rolls it's a great discount. For comparison the other brand I personally buy is eSUN and the lowest I've found their filament is €15, but generally they are more around the €17 when buying multiple rolls, so Bambu filament is now around the same price.\n\nNot sure why you are so fixated on getting 3 rolls because let's be honest, buying a 4th roll isn't that big of a deal since we all know it will be used eventually. Also you do realize that this 4th roll only costs you €8, right? With the old discount when buying 3 rolls you'd have paid €60 in total, with the current discount when buying 4 rolls you're paying €68.\n\nBambu Lab is a relatively new company so they have been trying things out and changing things every now and then, so yeah, changes like this have happened before but it generally is always for the better (except the points on MakerWorld, but we all knew that was going to happen anyway, it wasn't sustainable)  \nOr at least that is my experience so far with them, I've been using their stuff for almost a year now.",
            "Everyone complained about no ams sale so they swapped for that most likely .",
            "My nearest Microcenter is 4,500 miles away. Can I come live with you?",
            "Sad Canadian noises. I wished we had a microcenter up north",
            "I am the same, two are like 30-40 minutes from me.",
            "Ah I don’t have any microcenters near me. I wish. They said the min wage in Washington is too high to build a store. :(",
            "How did I miss this?!? You, my friend, are the reason I’m gonna have a 3D printer today ❤️ Thank you so much!",
            "Omg you're a life saver. Micro Center has a standard 30 day price match policy. They are going to refund me!",
            "I only came from an Ender 3, and it was a last ditch attempt to get into the hobby. Needless to say I love 3d printing again. I bought a second AMS on this deal.",
            "I'm very torn. Instant gratification of a P1S now, or wait and see if there's a reveal.\n\nIf there is something new, it could be even better. Or not available for many months, or only a minor improvement.",
            "It's even on the first image posted to this thread....",
            "Ive seen many people use sunlu pla on bambu machines with no issues. No spare parts or upgrades really needed. These machines are great out of the box. Some new nozzles might be fun if you want to play with the new sizes or abraisive filaments.",
            "I like to run sunlu. I have no problems. I do suggest that you print up the 2 or 3 tools early on. For example, the gear removal tool. You'll need that if you run into problems like a jam.",
            "Of course the splitter is out of stock now. Pretty easy to print one but between buying 5 PTFE connectors and maybe some decent quality PTFE tubing if you don’t have any laying around, it’s more expensive than the $5 part. 🤨",
            "You don't need it if you have only 1 AMS, you need it if you have more.",
            "Yep https://www.reddit.com/r/BambuLab/comments/174au97/news_flash_you_dont_need_the_ams_hub_at_all/",
            "You need to add them before hitting the \"Add to cart\" button at the bottom, like in this screenshot. But that is not what I was trying to say, what I'm saying is that I wouldn't use the add-ons discount on the page of the printer itself right now, instead use the current anniversary sale discount page and buy 3 accessories (build plates, hot ends, etc) and you get 35% off instead of only 20%.\n\nhttps://preview.redd.it/so20o9z1rr4d1.jpeg?width=1570&format=pjpg&auto=webp&s=6251ae9ccfea7d4a9a24ae7aa8e439939d75b488",
            ">:)\n\n:)",
            "I found it and only received $70, both the A1 Combo but with filament and one head",
            "Hmm probably user error then.",
            "P1s can handle all the same materials after you add a hardened nozzle and hardened extruder gears.\n\nThe X1C give you a nicer touch screen interface, LIDAR for flow calibration/first layer checks, and 10 degrees higher on the hotbed.\n\nManual flow calibration will give better results than LIDAR, I've never had the LIDAR correctly pick up a bad first layer, and the 10 degrees is not necessary for any materials I have used (including PA6CF and ASA).",
            "I think this is a no-brainer to be honest, I'd get the P1S combo and A1.\n\nThe X1C to my knowledge has just the LIDAR and slightly higher bed temps, but neither are really needed for any specific filaments as far as I am aware. Having the LIDAR is certainly not better than having another printer, imo. Another difference is the hardened steel nozzle and extruder gears, but those are easily replaced if you need them on the P1S and are way cheaper.\n\nI have the P1S and A1 Mini and for PLA at least (haven't tried other filaments yet) I already prefer using my A1 Mini because of the \"Active Flow Rate Compensation\" alone. On top of that it also wastes a lot less filament when starting a print (single colour). I still love my P1S, but it's very obvious that the A1 is a newer machine.\n\nIn all honesty, if you don't actually need an enclosure or don't need to be able to print in more than 4 colours in a single print (or connect multiple AMS to one printer) I'd just get the A1, or two...\n\n  \nEdit: Oh yeah, and the screen is also different, but I just use my phone for the P1S, which works really well anyway.",
            "I just submitted the form, should get the gift card within 3 days. Thank you very much",
            "If you have a fully assembled hot end, fan, wires, etc its a 2 min job to switch them.",
            "Hello /u/Earth_Sandwhich! Your comment in /r/BambuLab was automatically removed. Please see your private messages for details.\n/r/BambuLab is geared towards all ages, so please watch your language.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BambuLab) if you have any questions or concerns.*",
            "I think the P1S is a much better printer. It’s faster and the prints seem nicer. But the A1 seems to do everything basic I need and it’s super easy to change heads on it.",
            "Well, it’s not full spools, but 500 grams each. And you’ll be surprised how fast a Bambu machine chews through filament. I really doubt those three spools will last you all summer long. ;)\n\nAnd nah, even on sale their filament is still hilariously overpriced.",
            "I assume it works for anything in the sale.  Why not ask?",
            "Oh sorry, I should have just said when it runs till. It was in quite small print. I saw the run time somewhere else, and might have missed it here too. ",
            "Hah, I read it as June 5th - June 5th lol.",
            "It works nicely with AMS Lite without having to worry about the spools’ hole diameter. \n\nAlso I’ve not had any issues with my spools or refills. \n\nI normally buy at least 4 rolls/refills at a time so for me it’s $17.99 (roll) or $14.99 refill. Esun and sunlu and the like are $12-$15. For me it’s worth the extra couple $ for the peace of mind.",
            "BL filaments are meant to be easier to use with BL printers at an upcharge. \n\nBL has already made profiles and tuned for the filaments they sell to be easier to the average consumer to use, which makes sense why it's upcharged a bit. \n\nIf you buy from Sunlu or any other comparable company, there's a chance you'll need to tune the filament for the best results.\n\nI've only ever used the sample BL filament included with printers, so I'm not the most experienced with their filament, but the upcharge does make sense.",
            "To be frank, there are tons of other options out there that are the same or better in terms of quality. A lot of people quote them daily in the sub. I just bought them because I liked some of the tones and I am repeating colours for one project.\n\nAdditionally, by the end of the day, their own spools fit perfectly in the ams lite and I don't have much time to respool other brands nor want to change a broken piece (sone ams spares are expensive).\n\nAlso wanted to try  translucent PETG and bambu tends to work easy and well with their own filaments on  the first try.\n\nBut really, there are lots of options out there.",
            "To be frank, my original post wasn't a complaint at all and as you said, ended up buying the 4th.\n\nBut why would I want to buy 3 instead of 4 is absolutely nothing of your interest. It might be because of money, as in \"my monthly budget is XX and don't want to invest more\". It might be available space in a small home, that my rolls are full and don't need another one, it might be that I have a fixation with prime numbers below 4. \n\nThose would be my problems and only mine. My buying habits, as much strange as they might appear, are my problem. But informing people that 2 and 3 rolls were cheaper before is not a problem. Just some information.",
            "To be fair, I've seen so many posts about buying 10+ rolls for 100€ and complains about how you cannot be reliable without buying in bulk that I suppose they are after that market. The big roll eaters.\n\nThe 3 roll free shipping could not be what they are after now. Another thing that could be is that they are making bank for a big component getting into production and want to get fast money. I don't know.",
            "Do you cook?",
            "that can't be true. They're just opening up one in the Bay Area by end of year.",
            "Well, big picture, good for Washington. Sucks that they won’t build there though.",
            "Enjoy it, my friend!",
            "Gotta save money! So you can spend it on filament!",
            "Yeah, my first foray was an Ender 3 as well because I thought I could get by being technically inclined with a budget printer I got open box on eBay but that thing sucked and wouldn't even print properly once so I just sent it back. Bambu printers compared to that old garbage are night and day better.",
            "Well we have the sale going until July 5th which will be after the event, so still plenty of time to grab one of the existing on sale if they don't announce anything new or if it's going to be months before it releases after announcing it. \n\nNo reason to rush unless you just really want a new toy now ;)",
            "Thanks! Sorry I missed it. I’m on my phone and that text size is tiny.",
            "no you legit don't need the hub if you have the 4 to 1 splitter. You put the 4 to 1 splitter before the buffer and the printer will still work with 2-4 ams's",
            "whoa cool.  So basically this [AMS Hub using filament buffer / 4 way splitter by BC Designs - MakerWorld](https://makerworld.com/en/models/58119#profileId-59843).  Thanks!!",
            "Thank you, I did get the accessories. Unfortunately the filament discount ($16.99) didn’t work.",
            "Definitely at least 1 Id10T error involved",
            "and then use said gift card for filament lol. \n\n  \nHave fun with the new printer :D",
            "Where do you find the form?",
            "DId you chat with anyone? I would rather get cash instead of gift card",
            "Don't you know if the criteria is *ordered* or *delivered* after May 20th?",
            "Do you have the AMS on the P1S? I think what changed my mind from the P1S to the A1 was a lot of comments on the P1S and how finicky/slow the AMS system was.",
            "It was 17€ per 1kg is that really that much? I got I think 7kg from bambu and then some TPU and wood pla from amazon",
            "If people want to buy into all that it's fine, but they should know they're paying near 2x market pricing for very little benefit.\n\nNot to mention the subscription that brings the cost down to *only* 1.5x market pricing.",
            "I used to swear by Hatchbox, but I've been out of the printing scene for almost a decade. What brand do you use? Inland seems to be what Microcenter has, and I will probably get a spool when I get the printer",
            "If my previous message was a reply to your original post then this would be a very fair answer, but it isn't. You're talking about bad luck and Rosemourne about the carpet being pulled out from under them and being bitter... that's what I'm reacting to.  \n  \n  \nTo be frank I really couldn't care less if you buy 3 instead of 4 rolls, I just wanted to make clear that the complaining about it is rather silly, IMO.  \n  \n  \nI'm going to leave it at this because it doesn't make sense to continue arguing with somebody who's being snarky. Good luck!",
            "Idk i think i was talking to the store manager in Denver. No real clue tho.",
            "Alas, by the time I made it to checkout, none were in stock. Still, thanks to you, I now know much more about my local options when it comes to Bambú products - something that will come in handy in the future, too 😊 \n\nAs most folks probably know at this point but I didn’t: Micro Center initially set aside their A1 combo models for folks affected by the A1 recall. Looks like these are now starting to be made available to all shoppers - in some cases, in-store only - at various locations. With any luck, it’ll be easier to get these, at least, via Micro Center soon!",
            "Nothing to be sorry about! I only pointed out it being in the thread image for anyone else that came along and hadn't noticed it as well :)",
            "I'm so glad I saw this after buying the ams plus hub an hour ago... and using 8 gift cards.",
            "And where do you connect power/interface cables from AMSs?",
            "Yeah id just buy the 4in1 adapter for $6.99 from bambulabs and use that instead of the $50 hub. \n\nIt's also handy for where it goes into the printer since if you want to use a spool that isn't part of the AMS you can just attach it, like this one: https://www.printables.com/model/745008-bambu-4-in-1-ptfe-adapter-mount",
            "PEBKAC gets 'em every time.",
            "You tell the chat bot for Support \"Can I get a refund for the price difference since I recently made a purchase?\" You'll get a link",
            "It's only in store credit unfortunately",
            "It's delivered",
            "I do! It’s slow but I do like certain colored prints.",
            "Inland is just rebranded Sunlu",
            "[removed]",
            "Automod deleted my post over one word, would answer in PM if you would like.",
            "To each ams and then printer to the buffer. The buffer legit doesn't care that its not hub. The hub is a glorified 4 to 1 anyways",
            "Some posts about other user experiences on not using the hub with multiple ams'\n\nhttps://www.reddit.com/r/BambuLab/comments/18yn17m/4_way_splitter_with_multiple_ams/\n\nhttps://www.reddit.com/r/BambuLab/comments/174au97/news_flash_you_dont_need_the_ams_hub_at_all/",
            "They should just daisy chain so it shouldnt change the set up at all.",
            "Hello /u/R_Al-Thor! Your comment in /r/BambuLab was automatically removed. Please see your private messages for details.\n/r/BambuLab is geared towards all ages, so please watch your language.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BambuLab) if you have any questions or concerns.*",
            "ah great didn't know that",
            "It's super easy to set up. Buy the extra long 6pin cable from the bambu store (less than 10 dollar) then you will have no issues."
        ]
    },
    "Giveaway Now: Ultimate Bambu Lab Printer Workspace Challenge!🎁": {
        "title": "Giveaway Now: Ultimate Bambu Lab Printer Workspace Challenge!🎁",
        "score": 23,
        "url": "https://www.reddit.com/r/BambuLab/comments/1d8osqk/giveaway_now_ultimate_bambu_lab_printer_workspace/",
        "content": "We've seen some truly epic #BambuLabWorkspace this time around! From strategically placed printers (bedside printing anyone?) to colorful organizational masterpieces, you've shown us your dedication to 3D printing  \n**Get ready for the drumroll... the winners are!**   \n**List of Winners:**\n\n1. Brilliant solutions for limited place——【pat1926】——Bambu X1C Combo [https://www.reddit.com/r/BambuLab/comments/1dg8zzj/a\\_small\\_apt\\_means\\_hiding\\_a\\_3d\\_printing\\_oasis\\_in](https://www.reddit.com/r/BambuLab/comments/1dg8zzj/a_small_apt_means_hiding_a_3d_printing_oasis_in)\n2. Addicted to color——【gnarlykitten】——Bambu A1 Combo [https://www.reddit.com/r/BambuLab/comments/1dg8i28/i\\_wanted\\_to\\_make\\_my\\_workspace\\_look\\_fun\\_and/#lightbox](https://www.reddit.com/r/BambuLab/comments/1dg8i28/i_wanted_to_make_my_workspace_look_fun_and/#lightbox)\n3. Oops, glad that it is not mine——【Lambaline】——Bambu P1S Combo [https://www.reddit.com/r/BambuLab/comments/1dh1885/closet\\_micro\\_manufacturing\\_lab/#lightbox](https://www.reddit.com/r/BambuLab/comments/1dh1885/closet_micro_manufacturing_lab/#lightbox)\n4. Four-leaf clover award——【sliver-pear】——Bambu A1mini Combo [https://www.reddit.com/r/BambuLab/comments/1d978uj/its\\_not\\_much\\_but\\_its\\_a\\_space\\_for\\_me/#lightbox](https://www.reddit.com/r/BambuLab/comments/1d978uj/its_not_much_but_its_a_space_for_me/#lightbox)\n\nDon't hesitate to get in touch with Bambu Lab for shipping information, and we will send you the prize as soon as possible.\n\nhttps://preview.redd.it/lp1a5g05zq4d1.png?width=1600&format=png&auto=webp&s=f2451c77ba4ef72caae934c541fad91c8ecfad36\n\n\n\nOn the second anniversary of Bambu Lab, show off your most organized, most creative, or just real setup.\n\nWhere does your creativity take root? Whether it's a cozy corner, a dedicated desk, or an innovative setup, don't hesitate to share your creative printing workspace!\n\nShare your Bambu Lab printing station for a chance to bring home a Bambu Lab printer for your creativity!🎉\n\nThis giveaway was sponsored by Bambu Lab Store 2nd Anniversary, make sure to check that out [**https://store.bambulab.com/pages/2nd-anniversary-sale**](https://store.bambulab.com/pages/2nd-anniversary-sale)\n\n\n\n**How to：**\n\n1. Capture your printing station with Bambu Lab printers in photos or videos, and pose them on the Bambu Lab Official Facebook group with **#BambuLabWorkspace** and Bambu Lab subreddit with the post flair **#BambuLabWorkspace**\n2. The campaign will take place on seven verified groups: Bambu Lab Official User Group, Bambu Lab 3D Printers Users Group, Bambu Lab 3D Printers Users Group, BambuLab X1 & P1 - Functional 3D printing, Bambu Lab 3D Unofficial Group, Bambu Lab P1P/P1S Owners, Bambu Lab 3D Printers Users Group, Bambu Lab 4 Beginners, Women and girls 3D printing Bambu Edition and r/BambuLab.\n3. Only content that includes the hashtag **#BambuLabWorkspace** will be considered as participating in the campaign.\n4. The prize selection is specific to every platform, and data cannot be combined across platforms. A user can only receive one award on one platform.\n5. Winners will be contacted via private message from Bambu Lab. Please provide your delivery information within 5 days of receiving our message; otherwise, you will be disqualified from receiving the prize.\n\n**Platforms:**\n\nFacebook Group-\n\n[**Bambu Lab Official User Group**](https://www.facebook.com/groups/bambulabofficialusers/)，\n\n[**Bambu Lab 3D Printers Users Group**](https://www.facebook.com/groups/bambulabs/)，\n\n[**Bambu Lab A1 Series Owners**](https://www.facebook.com/groups/347361777639832/)\n\n[**BambuLab X1 & P1 - Functional 3D printing**](https://www.facebook.com/groups/bambux1/)，\n\n[**Bambu Lab 3D Unofficial Group**](https://www.facebook.com/groups/545438466970652/)，\n\n[**Bambu Lab P1P/P1S Owners**](https://www.facebook.com/groups/2760528387411877/)，\n\n[**Bambu Lab 4 Beginners**](https://www.facebook.com/groups/284220954250555/)\n\n[**Women And Girls 3D Printing Bambu Edition**](https://www.facebook.com/groups/womenandgirls3dprintingbambuedition/)\n\nSubreddit-\n\n[**https://www.reddit.com/r/BambuLab**](https://www.reddit.com/r/BambuLab)\n\n\n\n**Activity Period：**\n\nStarts on: 5th June 2024,\n\nEnds on: 15th June 2024,\n\nWinner Announcement: 21st June 2024\n\n\n\n**The prize：**\n\n1. Brilliant solutions for limited place——Bambu X1C Combo\n2. Addicted to color——Bambu A1 Combo\n3. Oops, glad that it is not mine——Bambu P1S Combo\n4. Four-leaf clover award——Bambu A1mini Combo\n\n\n\n**Winner Selection Criteria:**\n\nThe total number of winners is 36 from 9 social media groups.\n\nWinners will be selected by the Bambu Lab Team and moderators, considering factors such as the overall performance of their entries, quality, creativity, originality, relevance to the theme, and emotional expression.\n\n**Entries can only win once across all contest groups**\n\n\n\n**Terms and Conditions:**\n\n* By participating in the campaign, participants grant Bambu Lab worldwide, non-exclusive, royalty-free rights to use the content for display, promotion, and advertising purposes on official websites, social media platforms, and promotional materials.\n* Bambu Lab respects participants' intellectual property rights. Participants should ensure that the submitted entries do not infringe on any rights of a third party, including intellectual property rights, portrait rights, reputation rights, privacy rights, etc.\n* If we have doubts about the authorship of the entries, we have the right to check the source of them from you. If the terms and conditions are violated or if fraud is attempted, the participants may be disqualified.\n* Bambu Lab reserves the right to modify the terms of the contest.\n* Participants are expected to adhere to the rules and guidelines of the social media platforms.\n* Participants shall be fully responsible for their actions and content and Bambu Lab is not responsible for the actions and content produced by participants during the contest.",
        "num_comments": 70,
        "comments": [
            "I love how for \"Brilliant Solutions with limited space\", they are giving their largest printer as a prize",
            "The basement is the only place in my house that is not disturbed by our swamp cooler. So here she sits in all her glory. #BambuLabWorkspace\n\nhttps://preview.redd.it/mt4ocnjk9t4d1.jpeg?width=4284&format=pjpg&auto=webp&s=8f7fb9742d077c071469e02be08d935174b304a7",
            "> and pose them on the Bambu Lab Official Facebook group with **#BambuLabWorkspace** and Bambu Lab subreddit with the post flair **#BambuLabWorkspace**\n\n  \nSo we have to have facebook?  Maybe that should be an \"OR\"?",
            "https://preview.redd.it/jkdbp9zp0z4d1.png?width=796&format=png&auto=webp&s=c5045f8d09ceb5877a031d88d8187754b841cad8\n\nI don't have a bambu lab printer :( yet  \nSo here is just my current one  \n\\[I know I probably can't compete that's why I haven't included the # + that it probably needs to be a post not a reply to here\\]",
            "[#BambuLabWorkspace](https://www.facebook.com/hashtag/bambulabworkspace?__eep__=6&__cft__[0]=AZVC-HmGsm76TMsN4cvMS1WmJ6xGn3Nr6y4o4vFKU3gc-aaPS69wd68GZXzIrmoioTliiAo0So2e9Rx9r1Os3Cw5KCv0n3msRZ7NfBbVRQamK9ctSxGCx6bW9Iwx7ozZFibo0znnBEmqIlEUO_gRLe0vQTlCAw_Gywso2wd-IHp3NQ&__tn__=R]-R) My X1C with 2 AMS workspace. Magnetic bars on the front of my shelving to hold tools and plenty of space for other nick knacks as you can tell.\n\nhttps://preview.redd.it/d5z9v57bgr4d1.jpeg?width=1217&format=pjpg&auto=webp&s=49d34aeff499f5b6dcfe39b99770d44bb6b8011e",
            "This is where I'd put my X1C.  IF I HAD IT! (Said in Timmy turner's dad's voice)  shipping delays means it won't be here until tomorrow bit I made the space for it already. Can't wait!\n\n#BambuLabWorkspace\n\n*",
            "https://preview.redd.it/iiresfss2x5d1.jpeg?width=3841&format=pjpg&auto=webp&s=2f87d25bb7388ba07220bc603210c69a39fe1bef\n\nI'm expanding my small lab little by little each day.\n\n# #BambuLabWorkspace",
            "https://preview.redd.it/o6xu37xkl05d1.jpeg?width=4032&format=pjpg&auto=webp&s=80cd48a0284b6c0d8977639f2bbb1bee8f69d734\n\n# bambulabworkspace",
            "https://preview.redd.it/hv45w2dnd75d1.jpeg?width=4032&format=pjpg&auto=webp&s=0cac6e655218341e32b0e400b30d7fa70219cddd\n\nMy working space. X1C with 3 AMS + Mini with AMS + X1S with AMS. All in two IKEA cabinets..\n\nThis means that everything stays free of dust and the noise is not as loud.\n\n**#BambuLabWorkspace**",
            "https://preview.redd.it/l3cfm91ka56d1.jpeg?width=4032&format=pjpg&auto=webp&s=75d00c521561efac7b9c9f420ef50bdacc05704d\n\n  \nThis is my simple set up :)\n\n#BambuLabWorkspace",
            "https://preview.redd.it/9sn99ztld66d1.jpeg?width=4032&format=pjpg&auto=webp&s=fe27234fb1951216547052023521ecf193976448\n\n# #BambuLabWorkspace\n\nI work from home so my workspace is in my basement. My A1 combo is the latest addition to the family.",
            "**#BambuLabWorkspace**\n\n**My first 3D printer, nearly a month old P1S. I had been updating my office and did the back of it up for the printer space. It's nearly all organised now.** \n\nhttps://preview.redd.it/nkcu09mu7t4d1.png?width=2274&format=png&auto=webp&s=c651582e6cad20f7bfee890060b565337fc69a3c",
            "#BambuLabWorkspace My 2 P1S with AMS and Filament storage in a built-in bookcase\n\nhttps://preview.redd.it/svc3z228j55d1.jpeg?width=4032&format=pjpg&auto=webp&s=8ea68af662acfb0906e549e4db60948a800dce10",
            "#BambuLabWorkspace Here's my little corner workspace\n\nhttps://preview.redd.it/lqr8ut11565d1.png?width=5712&format=png&auto=webp&s=30f3e3a040ffb24ff9f8824b97025c2572085b5d",
            "I recently moved to be closer to my aging father and had to get rid of a lot of my stuff. My new place is very small and has some really weird dimensions. The room with the most space is my kitchen. Oddly enough there was a free X1-sized space next to the oven. So I bolted an ikea bror to the wall and replaced the flimsy metal top with a custom kitchen countertop cutout to provide the machine with extra stability. Beneath it I've got space for filament/plates/tools/etc. I also mounted a [LPSH](https://makerworld.com/en/models/62784) system to the AMS so I can comfortably print TPU. It's not pretty, but it fits the space like a glove.\n\nhttps://preview.redd.it/4k7cu1neac5d1.jpeg?width=3000&format=pjpg&auto=webp&s=783fbc8a3d3aeec013afd4e88ae762578d98fb88\n\n**#BambuLabWorkspace**",
            "Think I will be entering oops glad it’s not mine! 😂😂😂 no room yet to put it #BambuLabWorkspace\n\nhttps://preview.redd.it/mwwpqz9kki5d1.jpeg?width=3024&format=pjpg&auto=webp&s=04839fc8be0147f540dc11b56dcae64654d9463a",
            "Is there any penalty or issue with posting my workspace on all of the relevant FB groups?  I read it that you needed to post on all the relevant sites listed and posted on multiple Facebook groups.  I’m getting some good feedback from doing so but I do want to ensure I’m not violating any contest rules.",
            "https://preview.redd.it/3k1p0ymtmq5d1.jpeg?width=2252&format=pjpg&auto=webp&s=878a5751c7e1d40eee17aa73e154d9a475838f6c\n\nMaking use of an unused corner in the house. Simple table made of 20x20 aluminum extrusions to create some storage space below. AMS drawer system to store spare parts and tools. Have an Eibos filament dryer to keep engineering filaments dry during printing.\n\n# BambuLabWorkspace",
            "[**#BambuLabWorkspace**](https://www.facebook.com/hashtag/bambulabworkspace?__eep__=6&__cft__[0]=AZVC-HmGsm76TMsN4cvMS1WmJ6xGn3Nr6y4o4vFKU3gc-aaPS69wd68GZXzIrmoioTliiAo0So2e9Rx9r1Os3Cw5KCv0n3msRZ7NfBbVRQamK9ctSxGCx6bW9Iwx7ozZFibo0znnBEmqIlEUO_gRLe0vQTlCAw_Gywso2wd-IHp3NQ&__tn__=R]-R) Here's my two printers in action, or that's where it would go if Bambu sent me one🤞\n\nhttps://preview.redd.it/9h1cenewl26d1.jpeg?width=1536&format=pjpg&auto=webp&s=ad8fe6a4c9688bd0b5d7cb31175f8ee9af209292",
            "https://preview.redd.it/j5lm81nfl56d1.jpeg?width=2048&format=pjpg&auto=webp&s=b60f7c16320c22fd044de1c65c674a14967bf592\n\n[#BambuLabWorkspace](https://www.reddit.com/search?q=bambulabworkspace&sort=relevance&t=all) Recently switched out all my printers (Except for the Ender5+) for these beasts. When will you bring a bigsize to the market Bambulab! Then I can change that ancient relic of a Ender5+ for a quality machine too!",
            "Hope my A1M Combo arrives in time!",
            "[#bambulabworkspace](https://www.facebook.com/hashtag/bambulabworkspace?__eep__=6&__cft__[0]=AZVA1-XnTxpetdQt_njG7WDzqS1VD2h0yGUTMUgNFOoKQfr6Uh0h-J9kE2-DH5vXoUSMejGs9F7qVDzMXYqJJohdXhDl4Wf_itG-_xSTi8TS9JYJ35IbN4qhGmJFpBRWX8lUvAtBXt9gryYtAWoHYKuwKw5ArRe4Apoea_nzE7_U8zarfkcOzGBHNeDvZTIbTEdFyaPKVGvcRKpPAAhO64iaYxI8Hbaq3g9HQN9K6J_reQ&__tn__=*NK-R) I thought I could share what it really looked like, but my 62 year old self just had to clean it some. LOL\n\nhttps://preview.redd.it/y2qzkihkj86d1.jpeg?width=11040&format=pjpg&auto=webp&s=ce4b8b6b3b6b75efb53b4c6e36e618da0a9dab5f",
            "My first Bambu printer and I am loving it!\n\nhttps://preview.redd.it/irydkp22k86d1.jpeg?width=4032&format=pjpg&auto=webp&s=feac681ab319d8a2ac947efc541f7229388bd5b6\n\n# BambuLabWorkspace",
            "**#BambuLabWorkspace** Here is my play space (workspace) started with an Ender V3 after fighting with it every day for months I got a P1S with AMS on a small table Then never turned on the Ender again. Got another then it was on the floor. My dad made me the workbench the machines are on. I had more space and said let's try out the mini with the AMS lite and love it. I'm slightly addicted to filament also. Not photographed are the 20 more rolls not open still in bags behind all the storage containers. I have a swamp cooler so its very humid inside my house is why they all have air tight containers.\n\nhttps://preview.redd.it/88iehakrn96d1.jpeg?width=3176&format=pjpg&auto=webp&s=4ecf7fd1a9c290173005a6e0332dc95eabfd5124",
            "# BambuLabWorkspace\n\nhttps://preview.redd.it/0pj1ehzx2b6d1.jpeg?width=5712&format=pjpg&auto=webp&s=d2cd7e24ec535885fbb0e2e26b85ed1c5140be97",
            "https://preview.redd.it/w38epyh50c6d1.png?width=1080&format=pjpg&auto=webp&s=b0a2bfc259f8628e122cd3111034599b6ff85f43\n\nMy little 3d-printing nook. Maybe time to expand, feels a little cramped. #BambuLabWorkspace",
            "https://preview.redd.it/x3wigwh95d6d1.jpeg?width=2000&format=pjpg&auto=webp&s=b41d393a651b5e87ca852c5dedcdce785246c6df\n\nMy P1P with P1S conversion. Not much space to work with right now but will be expanding soon. enjoying working with this printer and have learned alot about 3d printing since i started with it.",
            "# BambuLabWorkspace\n\nhttps://preview.redd.it/6v58t931gd6d1.jpeg?width=4284&format=pjpg&auto=webp&s=60ce37589d45ed895fc275e045ce406fca6fd210\n\nLives next to my bed , on top of my sock drawer safe to say i have \"limited space\" lol",
            "Shhhhhh\n\nhttps://preview.redd.it/v2rmjwk9ph6d1.jpeg?width=4624&format=pjpg&auto=webp&s=180705a0b13e195fed7834e092251d7d43da8590\n\n#BambuLabWorkspace",
            "Currently deployed. I need to upgrade! Spare parts are hard to get here 😢. I have to create crazy solutions in lack of spare parts. Hopefully I'll be able to switch over to bambu soon. #BambuLabWorkspace \n*",
            "Just got my A1 this week. I love it already! Fits right into my little creativity-room :)\n\n**#BambuLabWorkspace**\n\nhttps://preview.redd.it/ih2o1u9v9k6d1.jpeg?width=4032&format=pjpg&auto=webp&s=03bc9c22e5dccd4e74b8f81ca9fc41a39bbe9bd9",
            "**#BambuLabWorkspace** After getting the A1 and the A1 mini I have been non-stop printing fun things and letting my creativity go wild. My workspace can be a little chaotic at times but I love it!\n\nhttps://preview.redd.it/frnje9kdpl6d1.jpeg?width=3024&format=pjpg&auto=webp&s=4e78a2ca96fcdb0b2ac1d6b570fa79d4ff7dba5e",
            "\n\n**#BambuLabWorkspace**\n\nI ordered a P1S combo 10 days agao. 3 Days after delivery of P1S..loved it so much that I ordered a X1C also. Both running with amazing prints. Absolutely amazing products and the customer service\n\n  \n\\*\\*I accidentally posted this under wrong account (autologin google). I deleted that and now posting under correct account.\n\nhttps://preview.redd.it/yh4jmm7eul6d1.jpeg?width=4030&format=pjpg&auto=webp&s=08194c8378dd395b6ada4ba771ff97379598a883",
            "**#BambuLabWorkspace**\n\nHere is my 3D printed 3D printing Workspace, my two X1C printers Bam and Bu have been very busy. I started with the molding where the floor met the wall, I designed and printed custom molding. I then had to do something with a paneling covered wall that I did not like so I designed and printed a geometric wall covering system.  I also used that system to cover the windows and front of the cedar chest.  The space was looking better but a ceiling was needed so I designed and printed a grid system to hold sound diffusion hexagon panels from Widgets on Printables that I modified to fit my grid system. It took many weeks of printing to cover my 19’x12’ basement ceiling. When I started, I was planning to just install the ceiling above the 3D printing area, but I just kept going and did the entire ceiling.  I also printed a variety of other items throughout the workspace, I even printed my workspace trash can.  \n\nhttps://preview.redd.it/rp8kkskmzl6d1.jpeg?width=1523&format=pjpg&auto=webp&s=568575d33f78519ea167aaafbbe4338ab10b284a",
            "# #BambuLabWorkspace\n\nBit messy haha, 2 more printers in the other corner\n\nhttps://preview.redd.it/u2sgtzd2vs6d1.jpeg?width=3072&format=pjpg&auto=webp&s=b483a54dc9c84d314be3b431fb3edc38c8a93576",
            "https://preview.redd.it/gx6odrnjxs6d1.jpeg?width=4032&format=pjpg&auto=webp&s=3301caf02561965cfba0c89bc761c07e32aefb21\n\nCurrent state of the setup. Still working on getting it where I want it. #BambuLabWorkspace",
            "Like ends midnight of the 14th? Or Midnight of the 15th? Am I too late?",
            "Is it too late to enter? We just finished our setup while still undergoing renovations unfortunately. . Wish we had it completed in time to showcase in the contest\n\nhttps://preview.redd.it/kjtj7364r47d1.png?width=3024&format=png&auto=webp&s=8e0322767537a7dc119bac3c570773dd3d1bd3de\n\n# BambuLabWorkspace",
            "Hope I’m not late but it’s the best we could do in the time crunch from nothing to something. .\n\nhttps://preview.redd.it/yweatxjbi57d1.png?width=4032&format=png&auto=webp&s=2912bb5642acde724a7305c28930b6c81c10529c",
            "I'm wondering when the winners' names will be announced for the various Facebook groups. I thought there were 36 winners in total, but I've only seen 4 names posted so far. u/Bambulab",
            "https://preview.redd.it/zz2lc2gq9n5d1.jpeg?width=3024&format=pjpg&auto=webp&s=0813309e4baa4d112a2f3dc5efd2cdc88f8907d5\n\n#**BambuLabWorkspace** \n\nI know I don't have a BambuLab as a requirement, but worth a shot lol. Honestly, I  just found this so funny seeing everyone with amazing 3d printing workstations and then here's mine. I understand if this post gets removed so no hard feelings. Someday I will have a bambulab.",
            "https://preview.redd.it/jkit3gnb5s4d1.jpeg?width=1756&format=pjpg&auto=webp&s=a5f0a9a883c0ca8efd25dd22543e3abc446f2918\n\nIronMan Mk I Arc Reactor.  \nThe model from MakerWorld was actually intended for the Bambu LED lamp kit.\n\nHowever, as I didn't think the white light was suitable, I redesigned the base plate so that there was space for an Arduino.\n\nThis powers a Neopixel ring and a small switch is also built in.",
            "It's so they can see a future post on how they managed it.\n\nClearly",
            "I’d make room for it though",
            "In terms of footprint it’s not the biggest though is it?",
            "The A1 models take the most space if you think about it.",
            "Nice set up, and mid benchy too!",
            "Those harbor freight work benches are awesome! Are to beat for the price!",
            "I have that same workbench.  It narrowly escaped being my printer workstation lol",
            "I would hope so. I deleted my Facebook account years ago and have no desire to start another one. It's amazing how companies just assume Facebook is as common as having an e-mail address now.",
            "Did you print that monster truck or buy it? If youmprinted it can you point me to the model?",
            "https://preview.redd.it/0naxlhgywc6d1.jpeg?width=1440&format=pjpg&auto=webp&s=d9926294a77789612ecb6cb76af3dbf3abd4eb33",
            "https://preview.redd.it/y4yb36qql05d1.jpeg?width=5712&format=pjpg&auto=webp&s=289f90dc8c5344279594d161b703c981a63d82d5",
            "Where are the tables from!? I've got a nice desk for my printers but no shelf under, would be nice",
            "What are those toppers on the printers?",
            "Did you find an answer to this? ",
            "Wait no it won't. Dangit :(",
            "Nice to see those bags in use. Do they work well? Mine's arriving soon",
            "https://preview.redd.it/dy6tp36frj6d1.png?width=1080&format=pjpg&auto=webp&s=8ad731b02f84d100e5e5465ed6e0f623ff5812e2",
            "https://preview.redd.it/ya4xz0gli57d1.jpeg?width=4284&format=pjpg&auto=webp&s=b7cf42b2ef121c5801c0bb6e4c4129950abef6c2\n\nNow\n\n# BambuLabWorkspace",
            "Names have been announced now, I was lucky enough to win an A1 Combo!!",
            "Clearly saw a competition post and did not read.",
            "It was store bought present from my son (wife got it on behalf of him since he is 9 lol).",
            "I got them from Amazon look for “prep tables” like for a kitchen. They work really well for the vibration as well IMO.",
            "They are the AMS Rise V2. you can get it here: [AMS Riser V2 Remixed by maCyo42 - MakerWorld](https://makerworld.com/en/models/133452#profileId-155321)",
            "No one ever answered.  I’m hoping it’s not an issue.  I did get some nice ones feedback on my workspace though, so even if I don’t get picked that was nice…",
            "I usually put in a small container of dessicant in the bag as well, but yes they keep my filament dry :)",
            "He probably read it - same like I did and reopened the wrong competition. u/Symmi : It's over here:  \n[https://www.reddit.com/r/3Dprinting/comments/1d8pjze/bambu\\_lab\\_huge\\_giveaway\\_share\\_your\\_fantastic\\_3d/](https://www.reddit.com/r/3Dprinting/comments/1d8pjze/bambu_lab_huge_giveaway_share_your_fantastic_3d/)\n\n  \nedit: corrected link.",
            "Thanks for the correct place to be."
        ]
    },
    "Just got my P1S combo! This is my youngest (and Yoshi) watching!": {
        "title": "Just got my P1S combo! This is my youngest (and Yoshi) watching!",
        "score": 65,
        "url": "https://i.redd.it/50sk4ym2w08d1.jpeg",
        "content": "",
        "num_comments": 11,
        "comments": [
            "It's the most fun I've had watching paint dry!!! Literally can't stop!",
            "They are incredibly satisfying to watch, aren't they :)",
            "Adorable, my youngest couldn't keep good eyes off it while it was upstairs being tested.",
            "That's some quality bonding time. Nice job dad",
            "back in the day you'd stare in an oven or the washing machine - now it is 3d printers ;)",
            "and yoshi lol that’s so wholesome love it",
            "I just got an A1 Combo. My son looks to be around the same age and loves to watch it print.",
            "My P1S combo is scheduled to arrive later today.  It has been an agonizing 3 days since ordering of downloading prints, reading the wiki, watching how-to videos.  I have been wanting to get started in 3D printing and the day has finally arrived, well, once UPS delivers that is.",
            "Hours upon hours 🤩",
            "Mine arrived yesterday!  The first thing I did was print the box for all the tiny spare parts that they send with the printer (it’s a built-in model, so no *send to printer* or networking needed).\n\nBambu should have included a micro-SD card, which is required to enable some of the features, like spaghetti detection, live view, and Timelapse recording.  The microSD I had lying around only has 4GB, and ran out of space after the first print.\n\nBambu included 3 random spools of filament, which I didn’t know was coming.  I ordered another 6 spools, including the very exciting TPU for printing flexible objects.\n\nThe *Bambu Studio* software estimates the cost to print an object, but I don’t know how it gets the price I paid for a spool of filament, nor where I’d specify that in the interface.  Maybe it’s using some industry average?",
            "Be careful the melting plastic causes microplastics in the air not good for the lungs.."
        ]
    },
    "Thank you Makerworld for the gift cards for a new printer": {
        "title": "Thank you Makerworld for the gift cards for a new printer",
        "score": 8,
        "url": "https://i.redd.it/73711l1e148d1.jpeg",
        "content": "Managed to claim 5 gift cards and got an A1 as a second printer during the current sale.",
        "num_comments": 7,
        "comments": [
            "i like your accessory shelf! I have spare room on my print table and I want to move my ams off the top of my printer (and get more organized with the accessories) so i'll start looking for something like that.",
            "It’s a great scheme, used 3 for my P1S combo on top of the sale. Unbeatable value for the functions.",
            "Looking good",
            "Which small ams shelf is this and where can I get this ?",
            "https://preview.redd.it/wsz4ugiva48d1.jpeg?width=2268&format=pjpg&auto=webp&s=234360bf6e8b7f95ee2de1b1562ceb84d8b02b68",
            "It's actually heavy duty garage shelving. It's a bit of a mess, but I have filament stored at the bottom and bits n pieces stored above it. I wasn't 100% sure the A1 was going to fit, but I managed to just squeeze it in.",
            "Yes it is. I've had a handful of printers before the Bambu's but since getting the P1S combo last year it's just been an absolute workhorse. Last I checked a few weeks ago it had 1400hrs on it and I've probably added another 75-100 since then. So the A1 seemed like great bang for buck option to offload overflow work to."
        ]
    },
    "P1S Exhaust Setup": {
        "title": "P1S Exhaust Setup",
        "score": 26,
        "url": "https://i.redd.it/nh9z8oviu18d1.jpeg",
        "content": "Combined a few different files on Bambu Studio by @jesadac and @RandomKhaos as well as designed my own window prop that fits super snug to vent my P1S while printing ASA. Real happy with how it all turned out.",
        "num_comments": 7,
        "comments": [
            "Nice, one think to make sure is that the fan you've added isnt going to pull air faster than the internal fan can spin, it'll cause it to overspin, which will cause a current to generate. There was a post here a while ago about someone who'd done this and managed to fry one of the boards. \n\njust keep the fan undervolted so it doesn't go over the top as it really doesnt need _that_ much power to draw the air out.",
            "Can you include an ingredients list?",
            "Are those 4” ducts?",
            "For ASA?",
            "Looks top notch, which noctua fan you used? Won't it run chamber cooling fan (exhaust) or you have dismounted it?",
            "Hmm this looks awesome. I thought about doing this for my resin printer. Great work",
            "I think they are"
        ]
    }
}