{
    "[General Discussion] Around the Horn & Game Thread Index - 6/22/24": {
        "title": "[General Discussion] Around the Horn & Game Thread Index - 6/22/24",
        "score": 4,
        "url": "https://www.reddit.com/r/baseball/comments/1dlr10p/general_discussion_around_the_horn_game_thread/",
        "content": "# So what's this thread for?\r\n\r\n * Discussion of yesterday's games\r\n * Excitement for today's games\r\n * General questions\r\n * Mildly interesting facts\r\n * Praising Santa 🎅\r\n * Anything else worth sharing/asking that doesn't warrant its own post\r\n\r\nFor game threads, use the games schedule on the sidebar to navigate to the team you want a game thread for.\r\n\r\n#Featured posts and links\r\n\r\n* [Join the official /r/baseball Discord server!](https://old.reddit.com/r/baseball/comments/8o2bxp/the_official_rbaseball_discord_server)\r\n* Be sure to place your entry in today's [**Nightly Pick 'Em**](https://docs.google.com/forms/d/e/1FAIpQLSfxxWbgpCCGD2bP2VJw0-NAcaKfwN3D_803m7sy_p1jQ5mZag/viewform) by /u/CNard12!\r\n* Check out:\r\n  * This week's [MLB Graphical Standing Series](https://old.reddit.com/r/baseball/comments/1di22s1/mlb_graphical_standings_june_17th_2024/)\r\n    * [Newcomer's Guide to Common Baseball Terms](https://old.reddit.com/r/baseball/comments/9ofctq/a_new_comers_guide_to_common_baseball_terms/) by /u/aagpeng\r\n    * Both by /u/cardith_lorda: [Fan's guide to picking a new team for the 2024 season](https://old.reddit.com/r/baseball/comments/1b34ks6/looking_for_a_team_to_follow_this_year_help_is/) and [2024 season survival guide, /r/baseball refresher](https://old.reddit.com/r/baseball/comments/1b6dphc/the_2024_rbaseball_season_survival_guide/)\r\n* Interested in learning more about advanced stats? Check out [this guide](https://old.reddit.com/r/baseball/comments/hvh161/presenting_my_offseason_work_a_novice_guide_to/) from /u/2helix5you\r\n* Interested in accessing HD baseball video highlights? Check out [Baseball Theater](https://old.reddit.com/r/baseball/comments/hx4wci/i_made_baseballtheater_and_made_tons_of/) created by /u/hellocontrol_ \r\n\r\n\r\n **Note:** for the best user experience, we recommend disabling the Reddit redesign while using /r/baseball.\r\n\r\n\r\n[](/todays_games)\n# Saturday's Games\n\n|Away|Score|Home|Score|Status|National|GDTs|\n|-|:-:|-|:-:|:-:|-|-|\n|[CWS](/r/WhiteSox)||[DET](/r/MotorCityKitties)||[1:10](https://www.mlb.com/gameday/746459)| ||\n|[SF](/r/SFGiants)||[STL](/r/Cardinals)||[2:15](https://www.mlb.com/gameday/745163)| |[SF](/1dlt4gk)|\n|[NYM](/r/NewYorkMets)||[CHC](/r/CHICubs)||[2:20](https://www.mlb.com/gameday/746863)| ||\n|[TB](/r/TampaBayRays)||[PIT](/r/Buccos)||[4:05](https://www.mlb.com/gameday/745486)| |[TB](/1dlu3ht)|\n|[KC](/r/KCRoyals)||[TEX](/r/TexasRangers)||[4:05](https://www.mlb.com/gameday/744997)| |[TEX](/1dlqon9)|\n|[AZ](/r/azdiamondbacks)||[PHI](/r/Phillies)||[4:05](https://www.mlb.com/gameday/745564)| ||\n|[MIN](/r/MinnesotaTwins)||[OAK](/r/OaklandAthletics)||[4:07](https://www.mlb.com/gameday/745644)| ||\n|[BOS](/r/RedSox)||[CIN](/r/Reds)||[4:10](https://www.mlb.com/gameday/746700)| ||\n|[BAL](/r/Orioles)||[HOU](/r/Astros)||[4:10](https://www.mlb.com/gameday/746376)| |[HOU](/1dlv56r)|\n|[TOR](/r/TorontoBlueJays)||[CLE](/r/ClevelandGuardians)||[4:10](https://www.mlb.com/gameday/746622)| ||\n|[SEA](/r/Mariners)||[MIA](/r/MiamiMarlins)||[4:10](https://www.mlb.com/gameday/746048)| ||\n|[ATL](/r/Braves)||[NYY](/r/NYYankees)||[7:15](https://www.mlb.com/gameday/745731)| ||\n|[MIL](/r/Brewers)||[SD](/r/Padres)||[7:15](https://www.mlb.com/gameday/745402)| ||\n|[WSH](/r/Nationals)||[COL](/r/ColoradoRockies)||[9:10](https://www.mlb.com/gameday/746541)| ||\n|[LAA](/r/AngelsBaseball)||[LAD](/r/Dodgers)||[10:10](https://www.mlb.com/gameday/746132)| ||\n\nAll game times are Eastern. [Updated](https://baseballbot.io) 6/22 at 9:10 AM\n\n\n[Yesterday's ATH](/1dkz2v6)\n\n[](/todays_games)\r\n\r\n\r\n# This Week's Schedule (all times Eastern)\r\n\r\nDay|Feature\r\n -|-\r\nSunday 6/16|Game Thread: [ESPN Sunday Night Baseball: Yankees @ Red Sox at 7:10pm ET](https://old.reddit.com/r/baseball/comments/1dhipl2/game_thread_616_yankees_5023_red_sox_3635_710_pm/)\r\n |Happy Father's Day!\r\n |[AMA with Grayson Rodriguez! (Answers will start Monday)](https://old.reddit.com/r/baseball/comments/1dhfg38/grayson_rodriguez_ama/)\r\nMonday 6/17|[r/baseball Power Rankings](https://old.reddit.com/r/baseball/comments/1di8lwj/2024_rbaseball_power_rankings_week_12_brewers_and/)\r\nTuesday 6/18|[State of the Baseball Subreddits](https://old.reddit.com/r/baseball/comments/1djkl7d/state_of_the_baseball_subreddits_20240619/)\r\nWednesday 6/19|No subreddit features planned\r\nThursday 6/20|[Division Discussion Thread: The Easts](https://old.reddit.com/r/baseball/comments/1dkdrwf/serious_division_discussion_thread_the_easts/)\r\n |Game Thread: [MLB at Rickwood Field in Birmingham, Alabama - A Tribute to the Negro Leagues: Giants @ Cardinals at 7:15pm ET](https://old.reddit.com/r/baseball/comments/1dko3mb/game_thread_620_giants_3639_cardinals_3637_715_pm/)\r\nFriday 6/21|[Friday Trash Talk Thread](https://old.reddit.com/r/baseball/comments/1dl63l6/official_friday_trash_talk_thread/)\r\nSaturday 6/22|No subreddit features planned",
        "num_comments": 4,
        "comments": [
            "After a blow out win against the Yankees, the Orioles faced the same; but wow, how cool that they made it close in the end. A loss is a loss, and it’s not what anyone wants…but I love seeing the offense fight back. Now, with the devastating injuries and shaky outings of late, the pitching staff is going to need some work…but at least the offense is hot.",
            "Of course. Judge gets hurt and team shits the bed just in time for Cole to return. I should've expected the sports gods to have a sense of humor.",
            "Adley 5 for 5, Gunnar trying to homer the team back into the game, a tiny victory for the Birds burning the good Abreu in a game with an eleven run lead. Likely Bryan Abreu won’t pitch again in the series now. Birds won’t have to face bad Abreu either, as he is at home in Florida earning his $30 million dollar salary for not playing.",
            "Oof…those retained and injury payrolls always sting a bit. The Astros definitely had a good game against one of our best pitchers this season. I know their record doesn’t show it yet, but the remain a threat. Adley, Gunnar, and Santander are definitely on fire lately. Let’s see how the rest of the series unfolds. I swear I am always shaking my fist at Altuve when we face the Astros. Last game I was able to go to in Baltimore, he was also the one to make me groan in frustration. 😂"
        ]
    },
    "OFFICIAL FRIDAY TRASH TALK THREAD": {
        "title": "OFFICIAL FRIDAY TRASH TALK THREAD",
        "score": 22,
        "url": "https://www.reddit.com/r/baseball/comments/1dl63l6/official_friday_trash_talk_thread/",
        "content": "\\# RULES:\n\n&#x200B;\n\n1. CAPS LOCK\n\n2. MAKE JOKES ABOUT OTHER TEAMS\n\n3. LAUGH AT JOKES ABOUT YOUR TEAM",
        "num_comments": 83,
        "comments": [
            "REALLY EXCITED FOR ALL THE ANGELS FANS THAT GET TO TUNE IN THIS WEEKEND AND WATCH THIS OHTANI GUY. HE'S REALLY FUN TO WATCH, YOU GUYS ARE GONNA LOVE IT.",
            "READY TO SEE IF THAT CITIZENS BANK PARK HOME FIELD ADVANTAGE IS WORKING AS WELL AS IT DID LAST OCTOBER",
            "MAYBE THEY SHOULD HAVE JUST DRESSED JOSE TREVINO IN AN ORIOLES UNIFORM BECAUSE THEN THE YANKEES PITCHERS WOULD FINALLY HIT THEIR TARGETS",
            "SOME SAY THAT THOSE BLUE JAYS RUNNERS ARE STILL STRANDED IN SCORING POSITION. 4 FOR 32 IN THE RED SOX SERIES.",
            "**RIP GRIMACE YOU GOT KILLED BY LEODY TAVERAS OF ALL PEOPLE**",
            "MOVE OVER '62 METS, THERE'S GOING TO BE A NEW SHERIFF IN TOWN. PLEASE PLEASE AND IF IT HAPPENS CAN WE MAKE THE '24 WHITE THE NEW STANDARD BEARER OF FUTILITY?",
            "YANKEES 1, 2, 3 STARTERS VS OUR 6, 7, 8 STARTERS. 'NUFF SAID",
            "WORRIED FOR THE YANKS. THEIR BEST RELIEVER MIGHT NOT BE AVAILABLE IN THE BULLPEN TODAY AFTER THROWING 25 PITCHES IN THE 9TH YESTERDAY.",
            "THE PHILLIES SUCK THAT'S WHY THE PADRES BEAT THEM NEARLY A QUARTER OF THE TIME",
            "WE ARE SO BAD WE SENT THE METS INTO A GRIMACE THEMED DESCENT TO MADNESS WHEN WE BEAT THEM",
            "NONE OF Y'ALL WERE AS COOL AS GETTING TO SEE AN MLB GAME AT RICKWOOD FIELD WAS AS A NATIVE ALABAMIAN. I HOPE THEY DO THIS (AND OTHER FORMER NEGRO LEAGUE STADIUMS) EVERY YEAR AND ANY OF Y'ALL THAT DISAGREE CAN GO PICK A FIGHT WITH GRITTY.",
            "WHY DOES IMANAGA NOT SIMPLY STRIKE THE BATTERS OUT??  IS HE STUPID???",
            "THE DODGERS TRAIL IN THE FREEWAY SERIES ALL TIME RECORD",
            "DODGERS 'BOUT TO SEE IF THE ANGELS REALLY ARE CLOSE TO GOD",
            "IMAGINE BEING OUTSIDE OF THE AL EAST WATCHING OTHER TEAMS IN OUR DIVISION BEAT OUR ASS AND WISHING YOUR TEAM COULD TOO.",
            "WE DROPPED TO THIRD PLACE FOR A DAY BECAUSE WE LOST TWO IN A ROW TO THE A’S.  \n\nAFTER TYPING THAT I’M ACTUALLY HAPPY TO COMPLAIN ABOUT “DROPPING” TO THIRD PLACE WE’VE FORGOTTEN WHAT IT FEELS LIKE TO WIN!!",
            "“#FIRECOUNCIL” \nNAME PURPOSEFULLY MISSPELLED AS A SIGN OF DISRESPECT",
            "SOMEONE NEEDS TO KILL GRIMACE FOR GIVING THE METS THE POWER TO DESTROY MY GLORIOUS KING MIKE IMANAGA II ",
            "2024 WHITE SOX HAHAHAHAHAHHAHAHAHAHAHAHAHAHAHAHAHAAHHAHAHAHAHAHAHAHAHA\n\n![gif](giphy|50lszNmOHB6CMwETWl|downsized)",
            "LMAO YANKEES YOU GOT BLOWN OUT",
            "THE PADRES BULLPEN. THERES SOME SERIOUS TRASH TALK",
            "HAHAHAHAHAHA 17 RUNS",
            "MY TEAM IS PLAYING THE ORIOLES AND BASICALLY THE ENTIRE SP ROTATION IS ON THE IL SO WE CALLED UP A DOUBLE AA GUY TO MAKE HIS DEBUT.   IT'S EITHER A SOUL CRUSHING SHELLING AS A SACRIFICE TO THE CRUEL BASEBALL GODS (sorry, not sorry about the trashcans) OR IT'S A NO-HITTER.  HOPEFULLY BOURBON WILL GET ME THROUGH IT, NO MATTER WHAT HAPPENS",
            "AND BY THE WAY SINCE WE ARE PLAYING THE MARINERS:\n\nCLAY BENNETT IS A SWELL DUDE",
            "THE METS AND OUR LORD AND SAVIOR GRIMACE IS COMING FOR ALLLLLL YOUR ASSES. BOW DOWN AND TREMBLE TO THE CHOLESTOROL INDUCING FURY OF GRIMACE AND HIS FRY KIDS!!!!",
            "MARTA SUCKS! I RATHER TAKE THE 6 TRAIN...IN THE SOUTH BRONX!\n\nPEPSI>COKE",
            "GIANTS FANS HAD THE POWER OF FRIENDSHIP AND WILLIE MAYS ON THEIR SIDE AND STILL FUCKED IT UP, THIS IS LIKE IF NOTRE DAME CHOKED AND LOST THE GIPPER GAME",
            "I WONDER WHAT THE OS THOUGHT ABOUT THE YANKS PITCHING STYLE YESTERDAY",
            "THERE’S A HEAT WAVE IN DC? THIS IS JUST A NORMAL DAY IN MIAMI LOOOL",
            "OHTANI GONNA USE HIS BIG SWINGING DICK TO SLAP MIKE TROUT IN THE FACE, CAUSING HIM TO PETITION TO RUN TO PHILLY EARLIER THAN USUAL TO PREP HIS STADIUM COUCH AT THE LINC FOR HIS REAL JOB",
            "THANKS FOR TORRENS YANKEES. HE HAS ALREADY WON US A FEW GAMES SINGLEHANDEDLY AND HAS THROWN OUT RUNNERS CONSISTENTLY.",
            "THE GREATEST LIVING HALL OF FAME BASEBALL PLAYER ISN'T A GIANT\n\n\n\n^^^^^^I'm ^^^^^^so ^^^^^^sad",
            "THE METS ARE LOOKING PRETTY SUSPICIOUS. SEEMS LIKE THEY KNOW EVERYTHING THAT’S COMING. OVER THE LAST WEEK, THEY’VE BEEN SCORING RUNS LIKE IT’S LITTLE LEAGUE. \n\nSUNDAY: 11 RUNS\n\nMONDAY: 14 RUNS\n\nTUESDAY: 7 RUNS\n\nTODAY: 11 RUNS (SO FAR)\n\nTHIS ISN’T NORMAL AND HARD TO SAY IS JUST BECAUSE “THEY’RE HOT.” WATCHING THIS GAME…THEY’RE LAYING OFF GOOD PITCHES AND HITTING TOUGH PITCHES TO HIT.",
            "Yankee fans are the biggest crybabies in sports and I’m glad they got shalacked.",
            "FUUUUUUUUUUUUUUUUUUUUUUKKKKKKKKKKKKK UUUUUUUUUUUUUUUUU\n\n:(",
            "TRIVINO ISN'T HITTING HIS TARGETS THROWING RUNNERS OUT",
            "I BELIEVE THAT IS ABOVE THEIR SUCCESS RATE ON THE SEASON (AND LAST SEASON TOO)",
            "AND YOU SAY THAT LIKE YOU’RE SURPRISED. THEY’VE BEEN DOING THIS ALL SEASON",
            "**YOU CAN'T KILL GRIMACE. YOU MAY STRIKE HIM DOWN BUT HE WILL RISE MORE POWERFUL THAN YOU COULD EVER IMAGINE**",
            "YOU'RE A 40 LOSS TEAM CHEERING ABOUT NOT GETTING SWEPT BY A FUCKING BUTT PLUG. \n\nRUBBLE RUBBLE MOTHER FUCKER.",
            "YOU GUYS HAVE SUCKED SO BAD I FORGOT YOU WON IN ‘05 AND I THOUGHT THE BLACK SOX CURSE WAS STILL ALIVE",
            "PROBABLY THE O’S 7, 8, 9",
            "LOOKING AT THE GAME RIGHT NOW, THEIR PITCHING APPEARS TO NOT BE THE ONLY PROBLEM. JUDGE AND SOTO ARE 0-6\n\nIT'S WHATCHA WANT",
            "GRIMACE THEMED DESCENT TO MADNESS IS THE NAME OF MY UPCOMING HANDPAN ALBUM",
            "JOKE'S ON YOU, I STOLE GRITTY'S HEROIN STASH AND THUS ALL OF HIS POWER",
            "HOW ABOUT THE NL EAST",
            "ON YOUR LEFT.",
            "NOW YOU KNOW HOW WE FEEL\n\nAT LEAST OUR PROSPECTS LOOK GOOD",
            "MUCH BETTER!",
            "SPEAK UP",
            "DON'T WORRY, COSGROVE IS BACK ON THE ROSTER (groan)",
            "DO YOU KNOW HOW LONG IT TAKES FOR OTHER BIRD TEAMS TO SCORE 17 RUNS?",
            "I CAN ASSURE YOU THAT WE ONLY DEMOLISH ACES",
            "SHOW SOME BACKBONE\n\nYORDAN DEBUTED AGAINST THE ORIOLES IN JUNE!\n\nI BELIEVE WE WILL SEE A STARTING PITCHER BLOSS(OM)",
            "AND SINCE WE ARE PLAYING THE MARLINS:\n\nREMEMBER CHILD SUPPORT IS DUE ON THE 15TH",
            "I HEARD RICK RIZZS ON THE MARINERS RADIO BROADCAST SAY THE OTHER DAY, “WHAT IS GRIMACE SUPPOSED TO BE, A TASTEBUD?!?”",
            "WHAT",
            "LOUDER",
            "I BELIEVE THEY MEAN HE WOULD GET HIT IN THE BATTERS BOX, AND THEREFORE THEY WOULD BE GETTING THE BALL TO THE CATCHER.",
            "SOMEHOW, GRIMACE RETURNED. ",
            "**DEFENDING CHAMPS, I'LL TALK ALL THE SHIT I WANT**",
            "SOMEONE COMMNTED A WHILE BACK THAT IF IT WEREN'T FOR '05 THE WHITE SOX WOULD BE THE DETROIT LIONS.",
            "HEROIN IS ONLY HOW HE LIMITS HIMSELF TO MAKE FIGHTS WITH US MORTALS FAIR. YOU'VE AWAKENED AN ELDRITCH BEING FROM OUTSIDE OF TIME AND SPACE ITSELF BY STEALING HIS HEROIN.",
            "I MISS MIGGY COMING TO TOWN. I’M GLAD I GOT TO SEE HIM SEVERAL TIMES. ",
            "BE MERCIFUL.  HE'S A 22 YO PUPPY PITCHER WHO STARTED THIS YEAR IN HIGH A BALL.  LET HIM THROW A FEW DECENT INNINGS FOR ENCOURAGEMENT BEFORE YOU HIT OUR BULLPEN.",
            "SADLY THIS IS TRUE",
            "THAT IS THE PEP TALK I NEED, SIR. \n\nBUT ALSO:  IS THERE ANY CHANCE THAT BLOSS IS SECRETLY RONEL BLANCO's LIL BROTHER?",
            "THERE IS A LARGER CHANCE OF TYREEK FEEDING HIS BABY MOMMAS THAN THERE IS OF SEATTLE GETTING THE SONICS BACK\n\nALSO I THINK THIS IS A GOOD MOMENT TO POINT OUT I'M A LIONS FAN",
            "OMG I SPIT OUT MY DRINK READING ABOUT CHILD SUPPORT",
            "YEAH, BUT CAN HE FLY NOW?",
            "AWW, BABY WINS HIS FIRST CHAMPIONSHIP AND THINKS HE'S HOT STUFF.\n\nCALL ME WHEN YOU GET A 30 FOR 30 EPISODE. I HEAR THEY'RE MAKING ONE ABOUT DAVID FREESE.",
            "BUT THE LIONS ARE GOOD NOW",
            "WE HAVE WON OUR DIVISION MORE RECENTLY THAN YOU HAVE.",
            "ANY BEING THAT CAN FORCE-LIFT THEIR OWN BODY WEIGHT WOULD BE ABLE TO FLY. IT’S A GIANT PLOT HOLE. ",
            "**IT'S THAT KIND OF CLEVER AND RELEVANT HUMOR I WOULD EXPECT FROM THE FINE FOLKS OF QUEENS**",
            "\\* *POSTSEASON HISTORY NOT INCLUDED*",
            "OH WOW LOOK AT MISTER \"I HAVE A DIVISION TITLE\" OVER HERE. SURELY THAT LEAD TO AT LEAST MAKING THE WORLD SERIES",
            "IN 2001 AND THE AL WEST HAD 4 TEAMS UNTIL 2013.  MARLINS ARE THE MARLINS BUT YOU GUYS JUST HAD TO BEAT OUT 3 TEAMS FOR A 19 YEAR PERIOD.",
            "MUST'VE GONE OVER YOUR HEAD LIKE A FLY BALL TO CRUZ.",
            "YOU PICKED A USERNAME OFF OF THE EPISODE THAT IS UNIVERSALLY RECOGNIZED TO SIGNAL THE END OF THE GOLDEN AGE OF THE SIMPSONS.",
            "AND WE MOSTLY FAILED AT IT",
            "YOU ARE LITERALLY A BEAR MADE OUT OF VANILLA. AND FOR SOME REASON THERE ARE 25 OTHERS BEFORE YOU",
            "MINEWASBETTER.GIF"
        ]
    },
    "[highlight] the White Sox forget how many outs there were and the game ends on a doubleplay": {
        "title": "[highlight] the White Sox forget how many outs there were and the game ends on a doubleplay",
        "score": 1973,
        "url": "https://v.redd.it/7l86m609v08d1",
        "content": "",
        "num_comments": 256,
        "comments": [
            "Please reply to this comment with any additional videos/angles of this highlight.\n*If you would like this comment automatically added to your highlight posts, please include [Highlight] in your post title.*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/baseball) if you have any questions or concerns.*",
            "The worst tragedies are the ones that force you to laugh, and this absolute clown car of a team has me in stitches.",
            "Showing the Benetti call of this is just rubbing salt in the wound, lol.",
            "I'm beginning to suspect the White Sox may not be a very good team.",
            "I feel like somewhere a  White Sox fan knew before the season that it was just gonna be bad, hoped the season would at least be \"entertaining\" and a monkey's paw curled.",
            "DeJong woulda been in position to score from 3rd if the CF didn't catch that can of corn flyout to CF",
            "This happens to me on MLB the Show sometimes when I have been drinking. Sox needed to press right trigger and probably accidentally pressed left.",
            "It’s been a rough season for us in Detroit but it’s good to see it could always get worse.",
            "Least embarrassing White Sox moment",
            "It's a good thing we promoted Chris Getz to GM, anyone else would've needed at least a year to get this team playing good, solid, fundamental baseball!",
            "Was this from the covid season?  Cuz the stands have nobody in them",
            "Should have just kept running to the parking lot by the time he figured it out..",
            "And if you don't like that, you don't like White Sox baseball.",
            "2 teams who couldn't find their ass with 2 hands and a flashlight going at it",
            "We are baaaaaad, but at least we are not this. This is just too perfect. White Sox perfected the art of not being a baseball team.",
            "My god this being Benetti’s call makes it so much worse",
            "White Sox are dead last in MLB with an fWAR of -2.2. Next lowest are the Marlins at +0.1. Next lowest in the AL are the Angels at +3.8. \n\nYes the White Sox are that bad.",
            "Pretty rare for this to happen as the ending out of a game.  It's not super uncommon for someone to have a brainfart in the middle of the game... but the end of a one run game is just extra stupid.  This is 100% on coaching.  They don't care enough about a close game that is still winnable to even make sure they know how many outs there are left.  What is the first base coach fucking doing?",
            "Sigh....Pauly D",
            "As a certified Paul DeJong hater after his 3-44 stint with the Blue Jays, at least I have this to enjoy today",
            "Bro....lol",
            "Southside *StAaAaAnD uP!*",
            "/r/headsdownbaseball",
            "My Rockies are bad, but my goodness, what are the White Sox thinking?",
            "\"And the White Sox have another play that typifies their season.\"\n\nOuch, Jason. Did you have to twist the knife that hard?",
            "![gif](giphy|VS3zCR5S6frDW|downsized)",
            "This is up there with Javy Baez doubling off of the obvious put-out at first as being the stupidest play of the past few years. Like… what the fuck?",
            "Holy crap this was the first thing that popped up on my feed right after relistening to the Berto on the West Side rant, what timing!",
            "Dude graduated college on a pre-med track but can't count how many outs there are ...",
            "Was this game not available to fan attendance?",
            "Beer league softball shenanigans",
            "i'll take it",
            "At the start of the clip I thought this was a throwback to a Covid game with no crowds",
            "Oh man, the urinatingtree vid is going to\nMake me laugh",
            "This season is straight up the screenplay for another Major League movie.",
            "Can someone ELI5 what's happening here? I don't know the rules of baseball.",
            "All 50 fans in attendance were pleased",
            "Lmao of course its the White Sox",
            "Looks like they are playing during covid with that crowd",
            "We suck.",
            "Peak Sox",
            "nice team",
            "Where in the hell are the fans???",
            "Tigers even looked sad about that play lol.",
            "that's a dfa if I've ever seen one",
            "Lucky no one was there to see it.",
            "Well at least nobody was there to see it live.",
            "Are they playing the game without fans lol",
            "awww Pauly, buddy.... you can't be showing other teams the cardinal way",
            "There are more people on the field than in the stands",
            "Dig A Hole!! Nowhere To Hide!!\n\nJust remember, the implantation of the draft lottery means you are not guaranteed the first pick.",
            "What hurts is Benetti announcing 😭",
            "I want the Chicago White Sox ownership to personally apologize to each and every one of the fans.",
            "He didn’t know how many outs there were down by 1 in the 9th inning? Jesus I would trade the dude immediately",
            "In a one run game!!",
            "Running your team out of the game cause you lost track of the outs is inexcusable\n\nNot running full speed back to first once they catch it and you realize is inexcusable entirely on its own",
            "It looks like there were hundreds of fans in the stadium, but the attendance was recorded as almost 25,000. What is going on?",
            "Vierling looked very surprised that he needed to get the ball in quickly lol",
            "Jason benetti:\n\n![gif](giphy|xT9KVDankbsfR4d1gA)",
            "what's with the attendance at Comerica ?  there's like 100 people there",
            "Can't wait till my dogshit Rockies play these dogshit White Sox in a few days. Gonna be a comedy of errors. On paper the Rockies are the better team, but I'll be damned if the Rockies don't lose the series 1-2 or get swept (they've been swept 6 times already). \n\nI'm dead inside.",
            "He could have at least sprinted on the chance of a bad throw",
            "\"Who are you and why did you blow this play?\"\n\n\"I'm the White Sox. And I'm the White Sox.\"",
            "Why a there nobody at the game?",
            "There was a time when, if Billy Martin was managing, that base runner would never have made it back to the dugout alive.",
            "Obviously this is La Russa's fault.",
            "I’d love to hear what that guy who called into the radio station last year has to say about this",
            "[How embarrassing](https://tenor.com/view/star-wars-yoda-how-embarassing-thats-so-embarrassing-embarassing-gif-17362984)",
            "Was this in 2020? Stadium looks empty.",
            "Fans forgot they had tickets",
            "Holy shit that stadium is empty.",
            "this looks like a covid game, holy shit",
            "Lol this is good too but I was hoping it was a defensive ending, where the Sox turn 2 and then wait around for the next batter, confused as to why the other team is going into the dugout tunnels",
            "That is one empty-ass stadium for a one-run game.",
            "What’s the point of a first base coach if it’s not to stop stuff like this from happening?",
            "How in the world does this happen?\n\nIt's the White Sox",
            "I actually feel bad for the white sox at this point. They are really not having a good time this year.",
            "Did the first base coach do anything?",
            "There were more fans in the stadium during COVID games than White Sox home games this year.",
            "Dejong sucks",
            "That is beyond unacceptable in MLB. WTF is wrong with this guy and what it he thinking?",
            "love how the announcer says \"how in this world does this happen\" all the while being half awake from his snooze box",
            "Is this a clip from Covid era? So many empty seats.",
            "There's being an untalented team, and then there's this. This has nothing to do with talent. These guys have lost the will to play baseball.",
            "There's literally nobody in the stands",
            "Look at the freaking stadium smh",
            "https://www.youtube.com/watch?v=q9RAZxNdCk8",
            "jesus christ the stadium is fucking empty….sheesh detroit that might be more embarrassing",
            "If you’re a Sox fan, you Just gotta laugh at how bad they are. No need to get upset.",
            "Soon the Sox will be playing in Nashville and disappointing the fans there.",
            "well at least its better than eric sogard who was retired on an 8-unassisted double play because he couldnt be bothered to try to draw a throw back to first",
            "This would be bad if they were getting blown out 10-5 but in a one run game!? Yo wat",
            "Do the White Sox **really** need to play the rest of the season? My god, this feels worse than the 2017 Cleveland Browns.",
            "Don't worry, White Sox.  I've done the same thing many times on MLB The Show, never to end the game though.  But I did once think there were 2 outs when there were no outs and sent everybody on a fly ball, and well a triple play.",
            "How hard this team has fallen since 2021",
            "Did the first base coach think it was 2 outs as well?",
            "Demote them to triple A 😭",
            "If you give that Team to Ozzie Guillen, they will be World Series champions in 2 years.",
            "I’ve definitely done this before playing MLB The Show. Wild to see it in an actual MLB game",
            "For once, it’s really nice as a Tigers fan to finally see a humiliating lowlight and not have us be the sad sack blunderers.",
            "Holy shit that is an EMPTY stadium",
            "You cannnn put it on the booaarrdd... NO!!",
            "Does the weather affect the game early on? cause my god the attendance.....",
            "This is the new Big Hurt. \n\nWhite Sox fans having to watch this dumpster fire of a team play.",
            "I finished my beer after this one, and went to bed. \n\nREIIIIINNNNNSDORRRRRRRRRF",
            "I watched Major League with my 11 year old son last night, and used the movie plot to explain the current situation in Chicago.",
            "There is like 100 people at the game. Never seen a stadium so empty",
            "The north side is enjoying this immensely.  Pass the ketchup inbreds.",
            "I know they’re trying to go with something cool, but the scorebug is unreadable and the CC jerseys are too similar so it took me far too long to know who Chicago was playing.",
            "Funniest part is that the worst record no longer guarantees the top draft pick.",
            "Starting to think a AA team could win a series against these White Sox",
            "![gif](giphy|BbfHHVhbPEIXFGAcpc)",
            "Well, it’s not as bad when they did this with no outs a few years ago which ended in a triple play lol",
            "Find the Yankees chat room",
            "I'll take 'Things Losing Teams Do\" for $500, Alex.",
            "The White Sox are some how keeping both the Marlins and Rockies from being the worst team in baseball. Godspeed.",
            "Not like anybody was there to see it, they should be fine",
            "Trash team. Trash organization.",
            "At least Pedro has them hustling….never forget he loves 1 run games! What do you think they’ll be named in Nashville?!",
            "Somebody just got thrown out on the basepaths like a nincompoop",
            "Oh Paul 🙈",
            "Were there any fans in attendance? Holy empty seats",
            "As bad as the White Sox are... the Tigers are 16 games ahead of them and that stadium is empty. Detroit is just below 500.. why is there no one in the stands? Got to be the city connects....",
            "Why does this look like a COVID game?",
            "... at least no one was in the stadium to see it.",
            "Hearing Jason Benetti call that is just icing on the shit cake.",
            "Eloquent",
            "This is not a clown car. It is the entire circus train.",
            "2028 World Series champs confirmed",
            "You’re laughing? The White Sox are in purgatory and you’re laughing?",
            "https://youtu.be/lAJB6HsYiNA",
            "and on your cake day too!",
            "Happy Cake Day! 😆",
            "Part of me is glad he no longer has to be subjected to this joke of a franchise",
            "He sounds so happy to be on the other side of this",
            "Like a dagger in my heart",
            "Not gonna lie, it's fucking brutal. 😭",
            "Can you blame him?  Brooks Boyer didn’t think he did good enough to support the Sox along with any national work he did.   And the Detroit staff went all in on him.",
            "![gif](giphy|3o7WTqo27pLRYxRtg4)",
            "From the look of it dozens of people left upset.\n\n\nEdit: Fuck that's Comerica.  I think there were more people at the restaurant I work at in Corktown, and we didn't have a great night.",
            "Fans were told to leave seats as lightning struck in the area nearby.\n\nSource: I was there",
            "[deleted]",
            "I know that person, that's me!",
            "That's the kool aid the front office tried to sell before the season. They were allegedly building a team that'd play good defense, play smart on the basepaths, and pitch well enough to win close games. 0 for 3 with no signs of improvement.",
            "I literally said before the year I just want Eloy and Robert to be healthy all year.\n\nEloy has played 36 games. Robert in 22, he's hitting .198.",
            "Probably banking on him not being able to scoot over 6 feet from his starting position",
            "Bold strategy…let’s see if it pays off…oh nevermind",
            "This is me on The Show when I'm sick of an inning and just want to speed through a game.",
            "Omg all the fucking time I do this.",
            "Is that your new logo?  Looks like a blue honey badger.",
            "Why didn’t they allow any crowd in?",
            "Oh boohoo with your .467 winning percentage, you could be the guy to have a Sox logo tattooed on your arm and your 8 year said “dad, it’s time you erase that tattoo”. \n\nI’m rooting for us to be historically bad so I’m rooting for the Tigers in this series",
            "It’s only a matter of time before they trade Skubal, it really fucking sucks being a Tigers fan right now, bad ownership and management.",
            "This looks like a highlight from 2020. There’s gotta be less than 100 people left in the lower deck",
            "At least we're not ~~Detroit~~ Chicago",
            "Detroit (at least we aren’t Chicago)",
            "Just wait till it warms up",
            "Lightning in the area, and the stadium made fans go to covered parts of the park. Decent attendance right up until about a half inning ago",
            "For some reason they made everyone take shelter in the concourse with a half inning left in the game. Due to 'lightning'. (It was raining very lightly)",
            "I shouldn't feel nostalgic for COVID era stuff, and yet, here I am, feeling oddly nostalgic for empty ballparks.\n\nI do miss mostly empty restaurants, in 2021, though.  No joke.  Never having to wait for a table was awesome.",
            "I definitely think the audio guy was using some COVID era crowd noise. No way the cheers sounded like that with so few people in the stands",
            "throw in a head first slide into home plate...\"I woulda been the tying run if anyone on our team could hit\"\n\nI apologize....I am a Tiger fan and we too have been guilty of the bonehead play on occasion",
            "Hey now, we have 9 guys on the field that play some sort of Single A baseball",
            "You might enjoy this stat: the Boston Red Sox (22), Boston Celtics (9), and Boston Bruins (8) have all won more road games than the White Sox (7) have since Opening Day on March 28th",
            "Last in stats but first place in milkshakes lol",
            "Genuinely such a good dude too. Feel bad for him.",
            "I know. I still wish that Paula D the best",
            "To think he's arguably been our best hitter this season...",
            "You assuming they \"think\" to begin with was your first mistake.",
            "He absolute has the right to twist the knife after what our management did to him. Goes without saying but fuck Jerry",
            "Numbers are hard ok",
            "TLDR: The runner failed in the basic act of counting, leading to the defence ending the game prematurely with the runner’s team losing. \n\nIf a batted ball is caught on the fly, a runner cannot leave his base until the ball is caught. If he does, he must return to the base before the ball is thrown to the base or he is put out (he returns to the bench and no longer participates in the play for the batting team). When the batting team accumulates 3 outs in their half of the inning, it ends the inning and the teams switch between playing offense and defense. \n\nIn this play, the batting team was losing and was taking their last half inning as the batting team. If they fail to tie or take the lead before getting 3 outs, they lose the game. The batter hit a fly ball that was very easy for the defence to catch on the fly. This put the batter out leaving the batting team at 2/3 outs. In this circumstance the runner is meant to stay near his base so that he can easily return to it and not be put out, which ends the game. However he apparently thought that there were 2 outs. If that were the case then he is supposed to try and advance as far as he can. On the off chance that the defender makes a blunder and does not catch the ball he can advance very far. If the ball is caught (as it normally will be) the half inning is immediately over with the catch making the third out.",
            "Found Paul De Jong’s account.",
            "Yes! I was about to ask if this was an old  Covid era video but the uniforms look like this years uniforms. That threw me for a loop. \n\nAre Detroit fans actually that bad? That’s worse than a Tampa Bay Devil Rays game, for God’s sake.",
            "He’s actually having a decent year. Not amazing numbers but I’d take him at short",
            "He’s the homerun leader for the Sox, they might extend his contract for his “power”",
            "Sox have a way of waking teams up. Don’t count your boys out, we will find a way to blow the lead in the 8th inning of every game",
            "How will that help? Losing at AAA will be even more embarrassing.",
            "Lol I knew this was gonna be a thing. Fans were made to move to the concourse prior to the 9th due to lightning",
            "No flair, no care",
            "Lightning in the area and they asked fans to go to the concourse. Actually a pretty good crowd tonight of 25K, at least good by the Tigers standards the last several years.",
            "I miss my boo…",
            "Edgeworth plz",
            "The worst part is knowing that the worse this team gets, the light at the end of the tunnel will get further and further away. I don’t expect this team to be good for at least another six years. Probably more.",
            "It’s worse than purgatory, bro. It is a straight up Faustian hell.",
            "And as bad as the Jays season has been. It’s never been this awful.",
            "You can kind of hear his inner White Sox fan in his \"How does that happen\" line, but yeah, good for him to get out of having to watch this every day. My Dad is a Sox fan and he still records and watches each game. Don't know how he does it, but then again I watch almost every Rockies game so  ¯\\\\\\_(ツ)\\_/¯",
            "One joke for another I'm afraid, at least Detroit style is better than Chicago",
            "If you love something you have to let it go",
            "I certainly am",
            "Such a dumb move from the Sox to let him walk",
            "There were thunderstorm warnings right before this, fans were sent to the confessions area.",
            "There was a decent number of people there before it started raining in the 8th.",
            "Literally looked like a covid crowd",
            "If you listen to the replay, it sounds like a full house with the lame pumped in crowd noise",
            "https://i.imgur.com/uLYIa0t.jpeg Pic I took telling fans to leave their seats due to lightning",
            "Jason Benetti my [beloved](https://preview.redd.it/v4i2f9lbyjrc1.jpeg?auto=webp&s=b8553e9dfcf9a04af7ddf35d9f099eab60ad76e4)",
            "Thanks obi-wan",
            "I liked how once the season started and it was realized that they weren't just gonna be bad, but historically bad, they pushed that sundae so much so, it was seen in the booth.",
            "Crotch Rocket's been good, at least. Good enough to trade at the deadline for some prospect who will probably get injured repeatedly",
            "It's all marketing hype for a shit team. If you're \"grinding\" for wins the things you do are open the rulebook, memorize it, keep your focus every play but this team plays absent mindedly. So Grifol is a fuckin lazy joke. In the immortal words of Hawk \"We find another way, yet another way\" to lose games. Annoying homer but at least he called out this team when it was absolute ass.",
            "Can't Deploy the Eloy",
            "never know if the centerfielder will get distracted and forget to catch the ball",
            "I've gotten mad before that R1 won't let me run back towards home when I am just trying to bunt my way out of an inning.",
            "City Connect unis. I read somewhere on another thread that they're a re-tread (pun intended) of a pistons uni from a few years ago",
            "There was lightning in the area so they cleared the stands",
            "There was lighting so people were moved.",
            "Whew that makes sense. I was wondering the same thing",
            "Looking at the rest of the comments, this might as well be stickied",
            "But they told the players to keep playing?",
            "I feel like if fans should shelter maybe we shouldn't send players to stand in an open field.",
            "How could you possibly feel nostalgic for empty ballparks?",
            "> feeling oddly nostalgic for empty ballparks.\n\nThere was a short time that the Premier League didn't add any artificial crowd noise to the matches in empty stadiums.  It was awesome hearing the players and I much preferred watching that way compared to when they started adding crowd noise in.",
            "People were in the concourse, there was lightning overhead",
            "At least there's no chance of the Patriots doing it?",
            "Homerun leader",
            "Ahhh okay I understand what's happening now. Thank you SO much for the explanation.\n\nThis sounds like a top tier blunder ngl lol",
            "So do the Rockies lol. Our bullpen ONLY blows games late, even when the Rox are ahead 5, 6, 7 runs. Either that or they pitch fine, but our starters shit the bed and bury the offense deep early. We play great defense, that's about it. Hitters are streaky AF but have double digit strikeout games every other game.\n\nIt's on man. May the worst team lose. 🤜🤛",
            "No brain shit stain",
            "Appreciate the info!",
            "Same ;(",
            "Not until JR leaves this earth. Unfortunately this is the sad reality. I hope he has a good life until then but fuck he sucks at being an owner of a sports team.",
            "Your bloodline should be studied, that resistance to pain is inhuman.",
            "Whoa whoa let’s settle down before we say anything too personal",
            "![gif](giphy|xwE1uHNwW7YOar0hfZ)",
            "![gif](giphy|7EbphlGJw8sBlZQhqy|downsized)",
            "I'm convinced that Jerry is trying to John Fisher this whole thing, and I'm terrified that I'll wind up being right. The team was torn down 8 years ago with the promise that we'd be competitive in the 2020s, and now they're worse than they ever were before the teardown. He clearly doesn't give a shit if the fans show up to the games, he clearly doesn't give a shit if they watch on tv, if he did he wouldn't let Getz and Grifol trot out this dogshit lineup every night, and he wouldn't let the best announcer in Chicago go to a divisional rival.",
            "a dyed in the wool white sox fan.",
            "Forgive me father for I have sinned, I’m a professional baseball player who didn’t know how many outs there were in the bottom of the ninth in a one run ball game",
            "Sorry, I replied to the wrong comment",
            "I'm like obi-wan if he was sad, old, depressed, and reclusive.",
            "It’s a milkshake and ownership is very proud of it",
            "Couple of drone crashes and you got yourself a tie ballgame, mister",
            "Where's Soto when you need him",
            "The little logo with that color scheme is pretty cool. It's unfortunate that the actual jersey and hat are so bland. DETROIT on the hat is an almost comically lazy idea. Man, most of the City Connect jerseys are such phoned in garbage.",
            "Well the tigers have succeeded on becoming the pistons. Congratulations you played yourself.",
            "That makes sense. Thank goodness because I hate seeing empty ballparks",
            "Fans go to cover yet players stand in the field? What sense?",
            "They know what they signed up for",
            "Players aren’t sitting on metal",
            "Quiet broadcasts.  You can hear the players and managers talking more easily.",
            "Can confirm was at the game we all started screaming when he rounded second. \nAlmost got to see a fight between a fan and staff over having to move. Wife dragged his ass before anything happened.",
            "I was thinking this too, but then they announced the new sports network so now I have no idea what's going on.",
            "I think you’re giving Jerry too much credit.\n\nI’m convinced there is no master plan. He legitimately thinks he’s good at running a baseball team and that Getz and Grifol would make the team better this season. \n\nSell the team, Jerry.",
            ".....what lineup do you want them to go with lol?",
            "No amount of Hail Marys can save your soul, son. Ye be damned.",
            "lmao ur good dude",
            "So you *are* Obi-Wan!",
            "Never know when a sinkhole will emerge",
            "They would be better if people think of anything other than cars whenever things like this come up. It’s always Motor City and racing stripes. It’s why the Lions throwback logo has two stripes, and it’s exactly what the Pistons did with their city jerseys. Just boring, uninspired designs",
            "The players can get off the field in seconds whereas it’ll take minutes to clear the fans from their seats.\n\nI attended a Nats game last year where this happened. Section by section ushers told us to head undercover a storm was coming. Players finished the half inning, and what do you know the skies absolutely opened up like crazy",
            "One including the quality free agents they refuse to sign, one including the talent they shouldn't have traded away, one motivated by a coach who wasn't so terrible even the royals workshop have him.",
            "I know why teams in our city latch onto the auto industry as an identity, but I'm absolutely gobsmacked that not one of them has thought to swing away from \"The Motor City,\" and lean heavily into \"Motown.\"\n\nDetroit is literally one of the music capitals of the country, and no one ever seems to promote it.",
            "[This dude on tiktok made a design for what he thought they should be back in March, and they are way better than what we got.](https://www.tiktok.com/t/ZTNLSK11K/), which makes it even more frustrating",
            "Holy shit, these are absolutely cracked!"
        ]
    },
    "Ohtani goes 2-2 with a 2-run home run against his former team as the Angels defeat the Dodgers 3-2": {
        "title": "Ohtani goes 2-2 with a 2-run home run against his former team as the Angels defeat the Dodgers 3-2",
        "score": 765,
        "url": "https://www.reddit.com/r/baseball/comments/1dlnsji/ohtani_goes_22_with_a_2run_home_run_against_his/",
        "content": "Also walked twice",
        "num_comments": 44,
        "comments": [
            "Angels on the winning side of a Tungsten Arm game!",
            "Username checks out",
            "I'd be lying if I said this one didn't make me smile for once...",
            "This is my world series \n\nCause we aren't making the actual one for any time soon lmao",
            "I never really contemplated how annoying that meme was to Angels fans until they got the chance to reverse it",
            "THATS HOW THAT FEELS",
            "😂😂😂😂😂😂",
            "Get Tungsten’d Dodgers!",
            "Shohei just can't escape Tungsten  Arm game",
            "The angels will win the World Series the first year they have neither Ohtani nor Trout, I’m calling it now ",
            "good shit angels",
            "Vargas and Taylor both had hits",
            "It's like he never left Anaheim ❤️",
            "Absolutely beautiful from the other side.",
            "One man cannot win it alone. Nor 2. 3 be the number to be to win consistently. \n\nWhich is why Betts is so important and his absence will hurt for the next 2 months.",
            "The history book on the shelf...",
            "Such a predictable loss tonight lmao. Weak ass lineup, Tungsten offense, and Dave Roberts making smooth brained decisions tonight",
            "This is the new version of “Ohtani goes 2 for 2 with a 2-run homer, scoring Trout who is injured on the play. Angels lose 9-2 to the Seattle Mariners”",
            "Unfortunately he’s the only one that seems to care.",
            "Ohtani is the new Trout? Because this is a Trout headline if I've ever read one.",
            "When will the league step in? Dodgers are wasting a goat career!",
            "Makes it that much sweeter that their first win this season in extra innings comes in their first regular season game against Shohei",
            "Start walking him",
            "Real Pablo Sanchez numbers",
            "A game to make him remember what it was like playing FOR the Angels",
            "Petty AF.\n\nI'm in tears.",
            "Two years ago an Angels fan said “god, I just want the Angels to find a way to win a Tungsten Arm game” and the monkey paw curled.",
            "You can take the Shohei out of the Angels, but you can’t take the Angels out of the Shohei",
            "I'm in full tank mode, except for this series",
            "like 0-7 in extras before this game or sum shit like that",
            "Was thinking the same thing haha. Such a fun game tonight.",
            "Eh it got funny after a while haha",
            "Here I thought I was being overly-optimistic when I predicted their next postseason appearance would be in their first season without Trout",
            "I thought they'd have an outside shot of making the playoffs this year lol. How wrong I was...",
            "Don’t forget pujols",
            "Fucking miracle",
            "Oops. Thanks for the correction.",
            "To be fair this is the 78th World Series game 7 the Dodgers have played so far this year.",
            "Trouts the American Ohtani, and Ohtani’s the Japanese Trout",
            "I don't think that's a positive outlook, lol.",
            "Other than the final score, it wasn’t bad actually",
            "As a wise man once said \"Meme the pain away\"",
            "With how bad this division is, never say never. It's still anyone's race bar maybe Oakland but hey, funnier things have happened. Wouldn't put it past Seattle to have a catastrophic collapse",
            "I think it was Confucius"
        ]
    },
    "[MLB] Andrew McCutchen pulled up to the game today wearing a signed Willie Mays jersey 🧡": {
        "title": "[MLB] Andrew McCutchen pulled up to the game today wearing a signed Willie Mays jersey 🧡",
        "score": 2571,
        "url": "https://i.redd.it/mqtqxpj6iz7d1.jpeg",
        "content": "https://x.com/MLB/status/1804243938959618183",
        "num_comments": 106,
        "comments": [
            "Cutch is the coolest man on Earth. ",
            "> plays for Pittsburgh\n\n> wears #24\n\nyeah I'm good with this",
            "I would be terrified of messing it up somehow.",
            "ESPN: \"Does Andrew McCutchen hate the Pirates? People are talking about it.\"",
            "Forever Giant Andrew McCutchen",
            "I hope he is careful eating his pre-game nacho helmet.",
            "Giants fans will always love Cutch for that walkoff bomb he hit against the dodgers back in 2018.",
            "Still miss him in Philly",
            "What hat is that? Surely not a Baltimore Black Sox hat.",
            "Cutch is the best",
            "What hat is that?",
            "Respect 🫡",
            "This is similar to Wesley Snipes wearing his #11 jersey underneath his #33 jersey in the movie The Fan because Benicio del Toro wouldn't let him have his #11 jersey he wore previously in his career.",
            "He always looked sick in orange and black, even if for just a few months.",
            "Beautiful",
            "Oh. Not even an undershirt and he looks to be on the verge of being sweaty",
            "Andrew McCutcheon is cooler than any of us could ever hope to be",
            "Damn I didn’t know players were allowed to wear other team jerseys \n\nI thought there was some obscure rule against it ",
            "All of a sudden!!",
            "sharp look cutch",
            "As a poor, it’s hard for me to imagine just wearing something that valuable instead of selling or framing it lol.",
            "I tip my cap",
            "Pirates homestand from the 4th through 7th, too. Yankees in town.",
            "Class act",
            "W",
            "Cool tribute, which team is the cap?",
            "Awesome",
            "Two legends",
            "Who signed it",
            "That has to be the most expensive outfit anyone wore that day",
            "I think they should retire #24 throughout the league",
            "I get a kick out of his paystub that leaked on the internet like 10 years ago, figured he was retired by now.",
            "That \"24\" looks Photoshopped or like one of those random t-shirt pop-up ads",
            "Yeah...trendy",
            "I miss him.",
            "He is really slick : )",
            "I chatted with him on MySpace.  The fact that he even responded to me was amazing to me.",
            "Sometimes, things related to baseball are greater than baseball.",
            "Cutch is too cool to make such a mistake. This is just another day for him.",
            "“Hey Cutch, it’s free BBQ day! Here’s a tray of ribs!”\n\n*slips*",
            "Looks to be a \"nostalgia\" reproduction shirt. Which is only worth what Mays charged for defacing it. From $10 in the 80s (which got people riled up), to this story from 2009 with a price list:\n\n  \n> Willie will sign almost anything for the right price. He is doing a show at the San Francisco tristar show $299 flats and balls- $699 for Jerseys, inscriptions are over a $100. What a joke in this economy.  \n> Anyway has signed occasionally at AT&T park, but only baseballs. He prefers to sign with a sharpie, because his eyes are so bad. He has a hard time seeing with a ink pen.  \n>He is very grumpy when it comes to signing and tries to squeeze you for every buck.  \n  \nYou paid and negotiated even more if it was actually a game-used item or you wanted some provenance, because that is just adding to the stupid price someone will pay for artifacts.",
            "look how he’s scrunching the jersey in his hand he clearly hates the organization",
            "Giants legend Andrew McCutchen",
            "ESPN: “How will Andrew McCutchen disrespecting the Pirates jersey like that impact Lebron’s legacy in the long run? First take. Next.”",
            "ESPN would have to talk about baseball first to write something like that",
            "[His walkoff homer against the Dodgers is, imo, the highlight of those late 2010s Giants teams](https://youtu.be/wNofYM1i8rE?si=axKwqRYfoMVgPF80)",
            "Thank you for Reynolds. Finally got our payback for Barry",
            "Forever Giant Bryan Reynolds",
            "A British guy once asked me if we have nacho hats at sports stadiums. A hat that's entirely a large nacho and you break it off to eat pieces and dip in cheese at the top. I asked him where he heard it. He said the Simpsons",
            "I almost sorta felt *bad* having him on my team, like... dude you're *supposed* to be in yellow, you're awesome but you and I both know this isn't right.  And then he laid down an almost comically over-the-top six-hit 14th-inning walkoff Dodger smackdown on a gorgeous Friday night in San Francisco, as if to say \"don't you worry about it.\"",
            "I own a Yankees McCutchen shirt that is worn to hell but him being on the Pirates just seems right.",
            "Brooklyn bushwicks",
            "[https://www.yesterdaysnegroleague.com/store/brooklyn-bushwicks-cotton-cap](https://www.yesterdaysnegroleague.com/store/brooklyn-bushwicks-cotton-cap)",
            "(Don't you also have to cut off their tattoo?)\n\nIf I EVER see a girl on Tinder who's favorite movie is \"The Fan\" I will either marry her(because she loves baseball) or get murdered by her(because she's fucking crazy).\n\nThat said: It's probably my favorite baseball movie because it's SO SO dark.",
            "I doubt he's worried about the resale price.",
            "Even if there was I’m sure the punishment would be a fine which I’m sure Cutch can afford.",
            "Brooklyn Bushwicks",
            "Why?",
            "Ha, that reminds me the Connecticut Yankee in SF has a framed photocopy of one of Jose Canseco's paycheck on the wall.  ([I think that's it just above the closest salt shaker](https://maps.app.goo.gl/z6bSoYxKkoWeKrC77))",
            "It looks signed and since he was with the Giants for a while I doubt it's a fake.",
            "Me too brother, me too. Stay strong! We should count ourselves lucky to have time with him at all.",
            "I miss him too",
            "I miss him!",
            "The smile with the space in it looks so much more wholesome for some reason : )",
            "Like the cup snakes they make out of empty beer cups",
            ">Mays charged for defacing it\n\nI don't think any sane person would consider the GOAT signing their jersey \"defacing it\", especially not Cutch.",
            "McCutchen played for the Giants, he probably got it from Mays personally. And even if he purchased it, it only goes to show his admiration of a great player and a Black baseball leader.",
            "I don’t remember McCutcheon wearing a Clemente jersey after Roberto passed.",
            "![gif](giphy|WoF3yfYupTt8mHc7va)",
            "Tbf, I get it ",
            "To be fair, it looks like the City Connects.",
            ">*McCutchen hints at following in the footprints of former Pirates greats Barry Bonds and Andrew McCutchen by leaving for the San Francisco Giants.*",
            "6 hit game.  Was amazing.",
            "Those unis looked incredible. I miss them so much.",
            "AFAIC, that game *did* make him a Giants legend.",
            "What an at-bat! That was awesome to watch",
            "what a fuckin beast. god I love a batter who takes it to double digit pitches",
            "What month was that? That being his first homer of the season surprised me a bit",
            "Probably for the entire 2010s, right?",
            "I mean, Reynolds is good, but Bonds had a season for the Giants where he put up two thirds of Reynolds career WAR.",
            "Heh, I hated the Pirates as a kid because they beat us 8-5 my first-ever baseball game.\n\nThat said, it's pretty cool now to be able to say I watched Barry Bonds hit a homer at Candlestick *against* the Giants.",
            "[He *wants* to be a nacho man](https://frinkiac.com/img/S05E16/391423.jpg)",
            "My partner has a rule, “Don’t buy jerseys for any player in the Pirates because they’ll be gone in a year”; I tried to get around it by buying them a Kung Korean jersey, he stayed 2 years after that. \n\nSince the Yankees are my team, I bought what’s nominally a LeMaheiu jersey, but did so because that was Cutch’s number on the Yankees.",
            "Robert De Niro telling his son about the virtues of the Sacrifice Fly.",
            "He probably was in Mays' living room waiting for dinner to be served when Willie gave him that jersey.",
            "don’t frown because they left, smile because you had em. best attitude to have towards it. we got a lot of that goin on around here lol",
            "Hell no at least I hope you mean him as a person and not a player\n\nHe couldn't field and barely hit above league average\n\nIn his 3 Seasons he only put up about 3 WAR total and the team didnt get shit done finishing .500 or worse every season",
            "A great Giant. Glad we had him on the team even if it was for a short time. Good memories: https://www.youtube.com/watch?v=qDsY2BaJKRU",
            "That really showed some immaturity on the -14 year old Cutch at the time of the incident.",
            "He’s been disrespecting the Pirates for more than 50 years!",
            "We basically gave up Bryan Reynolds for that walk off",
            "Early April, it was still very early in the season",
            "The 3 World Series wins might beat it",
            "That’s fucking awesome",
            "\"It's not counted against you, because you're helping out your teammate\"",
            "Those aren’t the only reasons to love him. His energy and leadership boosted stats across the board. He’s all baseball and he always knew his role. I hope he brought his glove.",
            "Dude did voluntarily go play for Philadelphia 🤢",
            "I don't want to think about that",
            "Those stats make more sense then, thank you",
            "SF not big on subtlety these days?",
            "Left field would have been filled for the last 4 years… it’s pretty brutal",
            "Such tired narratives. Just like with Duvall, no guarantee that they produce the same at Pac Bell. And it took several years for Wheeler to produce.",
            "Imagine a Lee, Ramos, Reynolds outfield",
            "With Reynolds, we may have not found Mike Yaz"
        ]
    }
}