{
    "Anti-poachers takes selfie with gorillas they are protecting": {
        "title": "Anti-poachers takes selfie with gorillas they are protecting",
        "score": 55559,
        "url": "https://www.reddit.com/gallery/1dljnn4",
        "content": "",
        "num_comments": 1107,
        "comments": [
            "These guys pose better than I ever could",
            "This makes for a sick album cover. Bout to drop the hottest track of the season.",
            "Top right rocking the shit out of the fur. Idk if it's a male or female",
            "Is that gorilla standing straight up?",
            "Why would anyone want to poach a gorilla? What the fuck is wrong with people?",
            "Straight up planet of the apes vibes rite there",
            "Ball so hard ",
            "You can't tell me they aren't intelligent. They're POSING!\n\nThe one on the right is leaning forward to be in the pic!\n\nThe one on the left could be someone's uncle!",
            "Gotta say they are very photogenic.",
            "I really didn't know that gorillas have eyebrows! In pic #2 the lower one's gaze at the camera looks so discerning. The little knitted expression on the brows is touchingly human.",
            "I thought for a sec they were anti-poachers in gorilla suits who take off their mask when the poachers get close . “Surprise Mother Fucker.”",
            "Is that gorilla rocking a beer belly? I have no doubt he would still be able to tear me limb from limb, but it is great to see one that looks a bit more 'middle-agey'!",
            "These guys have in my opinion one of the more important jobs on this earth.  Our closest relatives we must protect primates to maintain our human empathy or we are doomed.   This is the canarie in the coal mine",
            "Vogue😂",
            "If I was reincarnated, and I got to pick what animal (not allowed to be another human), I’d pick elephant or gorilla. Both are just so interesting.",
            "They chillin’",
            "That one reminds me of my old high school principal- big belly , just staring at you never making a sound.",
            "Give them AK's...fucking poachers will think twice.",
            "Thats a fuckin SQUAD",
            "This would be a dope album cover",
            "Nice pic WTF THE GORILLA CAN STAND WHAT THE",
            "Correct me if I’m wrong but aren’t these the guys that got killed by said poachers?",
            "It must be extra dangerous because the beings you’re trying to protect could tear you limb from limb if they wanted to.",
            "Per Reuters, these guys were not killed by a local militia group, however, 13 of their coworkers and fellow rangers were killed in an ambush several months after these photos first went viral.",
            "Got the dad bod and everything.",
            "![gif](giphy|OAYtfrwCvdVjW)",
            "You love to see it!! 😍😍😍",
            "Epic photo",
            "These are cool pictures",
            "Classy username OP",
            "Don’t post this on instagram",
            "Ok, but really, how hard are some of yall holding in a racist joke",
            "![gif](giphy|34ff20aY6oBUY|downsized)",
            "Gorillas rocking their bodyguards.",
            "The first one needs to be in the cover of a CD.",
            "![gif](giphy|evB90wPnh5LxG3XU5o|downsized)",
            "why is that gorilla standing so human?",
            "This shit has been reposted for the 100th time",
            "Which one is the human?",
            "Unironically the hardest pic ever.",
            "That's bad ass they look like a hit squad rolling with him",
            "i hope in some way they realise these humans are protecting them from bad humans.",
            "They always turn out to be some of the hardest pics to ever drop in human history. You know, nothing major",
            "Which ones are the anti poachers? Are these men in gorillasuits?",
            "I feel like the gorillas know this guy is protecting them and that's part of why they're mobbed up in the pic.",
            "One big happy family",
            "sort by controversial 💀",
            "All I see is gorillas",
            "The first picture is widely used by racist in China, adding text saying black people and gorillas are the same species. Just saw a dude posted this on Chiese messaging app twice",
            "Family reunion",
            "God, it’s such a good and obvious joke, but I can’t say it cuz I don’t wanna get banned 😭\n\n![gif](giphy|e7AAiwl12TSNyEeZyB)",
            "My lawyer advised me not to make this joke",
            "Gorillas in MY mist",
            "A family picture",
            "See no difference",
            "Hey looks like one of the gorillas",
            "Real recognizes real",
            "Family photo",
            "Love this",
            "Those gorillas is posing",
            "Me knowing they wanna smile but can’t cuz gorilla see that as aggression and would murder them 🐱",
            "[removed]",
            "Gorilla on left been waitin for this moment\n\nGorilla on the right just happy to be here",
            "Those gorillas know those humans are there hero’s 👌",
            "![gif](giphy|shoaYms5s17IA)",
            "\"We be VIG... Very Important 🦍. We had armed custody.\"",
            "Things that are bad for your health: \n1. Turning your back towards a gorilla",
            "The gorilla behind his shoulder is doing their best betty boop",
            "Looks like they are about to drop an album.",
            "I love these every time I see them! Gorillas just call to me. I love them🥹",
            "Where my grillz at?",
            "I hear their demo tape was fire!",
            "I hope the geolocation info for that pic was stripped off before putting online.",
            "That first pic would be framed and be every pfp of mine til the end of time.",
            "❤️",
            "On another note, wtf do you poach a gorilla for?",
            "These men are heroes and those pictures are amazing !",
            "It freaks me out when I see pics like this. We really are just clever apes that wear clothes.",
            "Sasquatch",
            "i like this new album cover",
            "Just hangin' with da boys. \n\nThat being said, the gorilla in the back of the 2nd picture has seen some shit....Who knew gorillas could get the 1000 yard stare..",
            "These men are truly angels on earth.",
            "When the album dropping?",
            "Love it",
            "That one gorilla in the first image, standing like my father-in-law while he silently judges my husband's home-repair skills...",
            "Hard.",
            "These photos go hard as fuck",
            "I never knew Gorillas would pose for selfie so well. 😂Looking directly at the camera and everything. This pic is Gold!",
            "Fuck yes. Good work good guys.",
            "I feel like the way they posed is so hard but zooming in on their faces says “Could you please not hurt me? Like, pleaaaase?” They’re precious and these men are lovely for doing what they’re doing.",
            "You mean the guys in the gorilla suits?",
            "Now isn't that way more cool than killing those majestic beasts?",
            "Is the gorilla on the left imitating the guy in the back? They’re posted up the same way haha",
            "Why is that gorilla on the first picture doing the lin Manuel Miranda lean forward pose",
            "R.I.P. God bless his heart",
            "It look like an album cover",
            "It looks like a person in a monkey suit.",
            "Beautiful gorillas, beautiful people protecting them",
            "These are cute. It’s like they’re buddies, just chillin’.",
            "What the hell someone would kill a gorilla for !",
            "I am an atheist.  If I am wrong and their are angels protecting us, they are them.",
            "These photos are utterly heartbreaking and also cool as fuck at the same time",
            "Caesar would be proud",
            "You cant tell me those are real dudes in a gorilla costume",
            "That's a suburban Dad in a gorilla suit. No-one can convince otherwise. ",
            "2 absolute Chad's right there",
            "It’s so funny to see them stand like that. The one on the left looks like he’s appreciating some fine art",
            "Gorilla x anti poacher album just dropped.",
            "I’m pretty sure the first one is some dudes in a suit. \n\nSecond one is legit",
            "New rap album just dropped. \"Soulja x Gorrillas\"",
            "I don’t know why. But I feel Ike they’re all so chill to be around",
            "'Me and the lads' energy right here",
            "Slightly worried about photographs leading poachers to their location",
            "I'm pretty certain that's Homer Simpson in a gorilla suit.",
            "Anti-poachers are so fucking rad.",
            "Outstanding",
            "They just drop an album?",
            "Looks like genuine gorilla",
            "I’ve seen these pictures so many times but they never get old",
            "Hardest album cover of 2024",
            "Wdym? He’s chilling with his fam",
            "how tall are they when they stand??",
            "If they drop an album, am buying",
            "This looks like the cover of a CD.",
            "M w m",
            "Album cover vibes",
            "Where?",
            "That gorilla standing on his own is an iconic picture.",
            "They’re not serving lite beer with the Cheetos at happy hour I’m guessing.",
            "That's amazing how comfortable the gorillas are around the Rangers. I'd be terrified to just be that near to a creature that could punch my head off.",
            "This is a sick album cover",
            "Can't wait for their album to drop",
            "The first photo feels like an album cover.",
            "I would never casually take a selfie with a creature that could tear my arms off and beat me with them",
            "First image goes hard",
            "Are the hairy guys behind the first guy also anti-poachers?",
            "I am glad they have protection.",
            "Damn good suits",
            "It looks like the gorillas are mocking them, now I must befriend a gorilla",
            "The gorilla on the left is holding a beer bottle in his right hand, looks like 👍",
            "Those anti-poachers DO NOT fuck around when it comes to protecting their areas.  Most of them are former special forces (some of the SF are from other countries).  Their way of punishment, wound the poachers and leave them out to be eaten or torn to pieces by the animals they are hunting.",
            "*me seeing a gorilla striking a stand* “damn, i didn’t know you were cool like that”",
            "Just guys being dudes",
            "How is the left gorilla getting the “hands in pockets” pose better than me, HE DOESN’T EVEN HAVE POCKETS 😭😭",
            "Which one is the anti poacher??",
            "Return to monke",
            "[removed]",
            "Just from the first picture alone, I bet their album is dope.",
            "How many of them are there?",
            "It's incredible how fake gorillas look when they stand/walk on just two legs",
            "I love them",
            "Where are the humans?",
            "I thought I was witnessing a racist meme at first",
            "This scares me. Are the gorillas really fine with these guys? Do they know these anti-poachers are keeping them safe?",
            "what the sigma",
            "\"My Gorilla\"\n- One of the Gorillas probably",
            "Dude... First time to see a gorilla stand that upright. And the one behind the guy.. They act so human!",
            "Nah racist gonna be wildin in the comments",
            "You ever see a picture you just can't stop looking at",
            "That dude definitely said, “hey, we’re gonna take a selfie” and the gorillas just posed for the camera! This is definitely not their first rodeo!",
            "Human came from gorilla that why there still gorilla around",
            "Thank you for everything that you do to protect our wild animals!!",
            "This cool",
            "Those are funny pictures. Those are some brave men too. Not only could a gorilla rip you apart if so inclined but anti poachers become targets of the poachers. Much safer around the gorillas for sure. I'm not one that necessarily has a problem with hunting but conservation should come first I'm sure why people hunt Gorillas though, I wouldn't think for food, probably some crazy market for gorilla parts to give people superhuman sex drives or something.",
            "Gorillas prolly think he's one of them 😶😶",
            "Only small steps away.",
            "They about to drop the sickest album ever",
            "I've been subbed to weird dalle subreddit for too long. I thought this was a prompt",
            "this gorilla's looks zesty ngl",
            "Thank god I saw this way before AI",
            "What a bunch of baddies. This is an absolute mood.",
            "He look like another gorilla",
            "This is dope af",
            "Thanks brothers keep up the good work",
            "That album’s gonna go so fuckin hard.",
            "Time to teach them how to protect themselves.  They look ready.",
            "Where’s the anti-poacher?",
            "Give those sapiens rifles and instructions.",
            "Gorilla rockin' that dad bod!",
            "Anti-poachers: saving lives and capturing hearts (and gorilla selfies).",
            "They're just hanging out.",
            "Live",
            "Looks like they're about to drop the sickest music video of 2024",
            "It's crazy how human those gorillas seem",
            "Awww so cute!",
            "Thanks guys! Great work. <3",
            "That's from a while ago, Binti-Swa and Inti I think",
            "They should pay taxes lol jk",
            "Pretty cool how they know they’re being protected.",
            "Don't post this on Instagram.",
            " Gorilla bro there has his hands in his pocket. Custome pocket.",
            "The standing gorilla is a female and she died a few years back.  https://www.npr.org/2021/10/08/1044333402/mountain-gorilla-congo-ndakasi",
            "That one on the left checking for IDs before entry lmao",
            "Are the gorillas smart enough to know?   From their faces they seem to know",
            "They stanced up",
            "Amazing level of trust the gorillas have in this Man. He’s something else.",
            "Stanced up with the homies, poachers won’t know what hit em",
            "“We’ll do it. Me and the Mrs.”",
            "Nice try … phony gorillas",
            "That's sad. Glad they have people to protect them.",
            "they look like their hands are in their pockets",
            "I didn’t know that gorillas could stomach the standard American diet.",
            "This one's for the album cover, boys",
            "Cute😍",
            "\"NAH I'M WITH MAH BOOOOOIS!!\"",
            "Gorillas like shootout to the south side my ninjaz!😄",
            "When the album drop?",
            "them rillas’ standing on business",
            "Why does it look like it’s just three bros hanging out on the weekend 💀\n\nThose poses, the faces, everything. Just needs a “we out here” Snapchat caption",
            "Almost sure this image is from Virunga the documentary.\n\nDon’t miss the chance to watch that, mountain gorillas are amazing, the face expressions are hauntingly human.",
            "They look like they're about to drop the maddest album of the year 🤘🏻🤘🏻",
            "Don’t fuck with the clique",
            "Off topic. Bt the forest ranger in the first picture have lips that influencers would kill for.",
            "Not a single poster realizes this is AI? Really?",
            "Gorillas doing Jojo pose",
            "Feeling cute, I don’t know. Might delete later.",
            "Im built like that gorilla",
            "Classic picture",
            "This looks like a bad ass album cover",
            "The one on the left looks like Homer Simpson.",
            "Looks like they could be brothers",
            "No one talking about the other monkey looking zesty ash",
            "I think we found Bigfoot.",
            "Me and the Bois you know 🧑🦍🦍🧑",
            "The first pic looks like a sick album cover.",
            "The gorillas look like they are standing around with their hands in their pockets",
            "Gorilla is standing there like: \"F\\*\\*king try it Bro\"",
            "Bro Reunited with his Tribe",
            "They all look the same😵‍💫",
            "Where are the anti poachers?",
            "Thank Jah this isn't instagram",
            "Absolutely incredible 👏 keep up the great work we need to protect them at all costs.",
            "This looks like the cover to the next big album.",
            "can someone link this foundation?",
            "I can see the comment section of Instagram miles away if this was posted there..",
            "Should they be standing upright like that?",
            "SQUAD",
            "Anyone remember that dude that was on Reddit that was a anti-poacher ranger, I can’t remember his name",
            "r/realorAI",
            "Rest in Peace Ndakasi. \n([Donate](https://virunga.org/support-us/donate/) if you can/want. Virunga National Park does a lot to support conservation efforts and support surrounding communities.",
            "![gif](giphy|ZArWQGxulwNxty4ck4)",
            "The gratest apes!",
            "Far left in 1st pic has classic prison pose",
            "Could be right, could be wrong. But these pics literally scream AI.... Are we losing Reddit to the AI battle aswell???",
            "right one got their hands in their pockets, leaning in and shit",
            "Those monks are comfy with him.",
            "Gang",
            "That’s love and respect for the animals you’re protecting. Fuck poachers. ",
            "They aren't real gorillas, anti-poachers have been known to wear gorilla suits to bait the real poachers, or so I have heard.",
            "N then it ripped his face off",
            "I'm not sure who is protecting who in this photo, wicked.",
            "cane to the wrong neighbourhood ya poacher.",
            "Kind of gangster.",
            "I'm using the first picture next time I need to give someone the ol' \"Dang bro, you got the whole squad laughing.\"",
            "I thought it was ai",
            "Family photo",
            "Old photos, sad that we won't believe in photos like this anymore",
            "Maybe they're born with it\n\nMaybe it's Bipedal Locomotion™",
            "See? A belly is very cool.",
            "I know humans who are less photogenic than these suave mfs.",
            "Don't let the dad bod fool you - they have been working out ",
            "/r/fakealbumcovers material",
            "Even with the dad bod too. Still poses like a boss.",
            "They look like they’re a band.",
            "So this is that band Gorillaz?",
            "Death grips is online",
            "female, the two gorillas are sisters and their mom was killed by poachers when they were very young.\nWhich is also the reason they are standing up, they are trying to mimick the humans.",
            "Hell yeah. Just chilling letting his gut hang out, dick hang out, just pissing and shitting and eating fruit. That's the life.",
            "Looks like a female to me. She doesn't look like she has a crest on her skull, and her face is softer.",
            "Oh boy, wait until you hear about how we got here.",
            "Gorilla suits from Saks Fifth Ave…",
            "not just that but his hands are in the pockets as well, like a gentleman",
            "Yes. Your eyes are not deceiving you. Gorillas are known to stand up right from time to time. Now, show me a gorilla walking upright further than just a few steps, and you'll have me floored. 🤔",
            "They look like the doing buissness",
            "There’s literally a Supreme Court case about gorillas taking selfies. They’re public domain",
            "He's got my body type.",
            "Their pelt sells for a lot of money on the black market.\n\nCartels, mobs, mafias, triads, etc... they all kill humans on a regular basis, a gorilla pelt means nothing more than a symbol of \"power\" for these people. Being able wield something ilegal without going to jail means they have power, means they have conections.\n\nThey use the pelt to make pieces of clothing or furniture.",
            "![gif](giphy|3orieWl5qNTUocH10k|downsized)",
            "Also I’d imagine u get rich enough u can prob go on a illegal safari hunting game that is illegal to hunt like gorilla",
            "Cartheginians thought they were just different humans when they travelled Africa down south on its coast, tried to catch them, but they could only catch their women.\n\nSome of them they skinned to be shown back to their homelands.",
            "To sell their meat, for private collection (or as thropies), to sell their body parts (medicine).\n\nSource:\nhttps://www.virungaparkcongo.com/information/main-reasons-gorillas-poached/",
            "You don’t want an ashtray made of a gorilla hand?\n\n\nWell, neither do I, but I remember as a younger person that was one of the “trophies” that was shown in markets from poaching gorillas.",
            "[removed]",
            "I don’t know but my mom’s uncle had a bear rug & tiger rug in his house. Real ones. Along with an ostrich egg in a display case. \n\nLooking back on it I super don’t like that guy.",
            "People will do awful things to animals if it brings them the smallest bit of pleasure. \n\nLook at what we do to pigs (factory farm/torture) just because bacon tastes good. \n\nObviously that’s not really comparable to poaching since poaching is on a smaller scale but it still highlights that people dgaf about animals. ",
            "I agree.  Why indeed.  Why do people want to kill these magnificent animals.   I don't get why so many want to kill rhinos , elephants, and all these beautiful creatures. \n\n\nI see all this beauty and just want to hug them all.  0% of my mind  thinks about hunting them.",
            "see my vest, see my vest\n\nmade from real gorilla chest!",
            "Bottom in 2nd pic looks like Don Cheadle with planet of the apes cgi",
            "Humans are considered great apes",
            "Motherfuckers wanna poach me",
            "I know they're intelligent. I don't know how intelligent or in what capacities- It does make me wonder, do they *know*? Do they know they're being protected by these men and do they have the capacity for appreciation? I'd love to hear more about this relationship because it's fascinating.\n\nAnd yeah, they're posing like they're in a posse. They're posing like they know these humans are their fuckin ride or die road dogs. How cool is that?",
            "Hang out at a gorilla habitat at a zoo and you'll see how intelligent they are! I spent a lot of time there during my maternity leave, they were so interesting and also interested in looking at my baby. I love them.",
            "I mean humans and other great apes come from a similar ancestor and we clearly have many similarities",
            "Intelligent animals are the most fun. I'll stick with my Quaker parrot though. The smarter they are and the more complex their emotions. \n\nBird tantrums are bad enough. A Gorilla? Yeeesh",
            "I don’t think anyone intelligent has said they aren’t intelligent",
            "Let me introduce you to [Shabani](https://www.gettyimages.co.jp/search/2/image?sort=mostpopular&phrase=shabani%20gorilla&license=rf%2Crm)",
            "Eyebrows on fleek ",
            "I was looking for this comment and l still do believe these are guys in costumes.",
            "They all have big bellies. I'm not a biologist - I suppose they need large guts to digest the plant food?",
            "Lol, judging by all the warfare we engage in against each other, I don't think killing gorillas is where the line is drawn as far as our descent into depravity. We already do much worse.",
            "They are also insanely brave and devoted. I worked with a woman who did rhino conservation work in South Africa. It's crazy what they go through. The poachers are really clever - they track down vulnerable people involved in conservation and do things like pay for little Timmy's surgery or pay off mom's debts and stuff and ask for just a little bit of info - stuff so innocuous that the conservationist doesn't even understand how it could be used to harm Rhinos. But they do this to all kinds of people all at once, so they piece all the data together and get a complete picture on where the Rhinos are. \n\nThe conservationists are at literal war with the Poachers, they go through the conservation area with military-grade weapons, prepared to fight to death to protect these precious animals if need be. \n\nAnd with how many people get flipped, bribed, or were only taking on the job to get information, the men there protecting these Rhinos never \\*really\\* know if the people at their side will turn their guns on them out in the field. And yet every day they go out there anyways. Balls of fucking titanium.",
            "I know. I am almost crying at this pic. The gorillas are so beautiful. These guys are heroes for protecting them.",
            "50 cal mounted their Toyota hILuxes at a minimum.",
            "Conservationists often ARE armed already, depending on the severity of the poaching crisis it can range from some basic small arms for self-defense to full-on automatic rifles and tactical gear.",
            "Personally I am terrified of the idea of gorillas with AKs",
            "That story has been debunked. Thankfully these two men [survived the ambush by poachers](https://www.reuters.com/article/world/false-claim-rangers-who-took-viral-gorilla-selfie-killed-in-congo-park-attack-idUSKBN22O2VO/)",
            "For the most part, gorillas are pretty chill. As long as you know how to behave around them and not accidentally present yourself as a threat, then they'll leave you alone.",
            "why?",
            "dude that was my first thought lol.",
            "they should. then we can post a screenshot on /therewasanattempt",
            "I literaly scrolled to see some, this is the first one.",
            "It already got old for me. This image is over a decade old, and everywhere its been posted has the same jokes.",
            "They were orphans and are trying to be like them",
            "This aint instagram reels lil bro",
            "Quadrupeds everywhere: “fuck you!”",
            "Everybody's doing a brand new dance now\n\nCome on, baby, do Bipedal Locomotion!",
            "Nice.",
            "That's not a belly.  \n\nThat's a gas tank for a sex machine.",
            "I don't like how you mentioned me without my consent.",
            "... what about the human",
            "Gorillaz With Attitude",
            "They really mastered the bored/vacant runway model expression.",
            "Up on melancholy hill there's the boys and me taking selfies",
            "![gif](giphy|bKBM7H63PIykM)",
            "Del and the Funky Homosapien and Damon Albarn.",
            "Ok now I’m sad and fascinated at the same time",
            "Wrong! You can clearly see that one of them has pockets.",
            "OK, I feel mocked, now.  \n  \n> \"Haha, I'm a hooooman. I stand on twwwwooooo legs and have resting smile face! Time to go do a mass shooting! Hahaha! Humans!\"",
            "It’s so sad isn’t it such amazing animals how anyone could hurt them is beyond me",
            "r/likeus",
            "Mimicking humans is how apes evolved to people!\n\nIt really makes sense",
            "You mean they’re not humans?! oh yeah, you’re right… they tricked me because they’re standing up",
            "With your pet humans.",
            "Don't forget beeing strong af ripping everything to pieces of needed.",
            "And fucking. Don't forget the prime directive.",
            "😂",
            "Correct! Both are female, also they are sisters",
            "Dust from the newly created earth and god’s breath, duh. Didn’t you read the bible?",
            "The Earth began to cool,\n\nThe autotrophs began to drool,\n\nNeanderthals developed tools,\n\nWe built a wall (we built the pyramids)...",
            "i am pretty sure we are all product of incest",
            "I was gonna say.. \"real\" gorillas.. yeah riiiight..  ;)",
            "Mans standing with his hands in his pockets like it's a union break at the work site",
            "Here's a couple that you may like.  It's cute when they do it. \n\nhttps://youtu.be/AqXp6yQNAW4?si=NhcC4R9Gw1r6IvY8\n\nhttps://youtu.be/sVYzogbTs0w?si=8rLAC2H8M-fS5XiC",
            "You wish.",
            "It honestly has better posture than I do.",
            "Morbid stuff but human leather is very highly priced too. \n\nThere is a company that will make human leather bags and wallets from your deceased relatives if u wish. \n\nAlso a company that will sell you leather and other human remain paraphernalia",
            "Not  just cartels, Mr Burns had one\n\nhttps://youtu.be/TyWVaZsUQjc?si=NwyXvlWz0j3tJLjd",
            "Solution: Tell these criminal organizations to start wearing human skin instead. Not only will it reduce poaching, but it'll also prevent all that skin from going to waste. Everybody is happy.",
            "See my vest, see my vest, made from real gorilla chest.",
            "I was hoping for this",
            "See this hat? Twas my cat!",
            "Grizzly bear, underwear!",
            "[Surviving the Game ](https://www.imdb.com/title/tt0111323/#:~:text=Surviving%20the%20Game%20(1994)%20%2D%20IMDb)",
            "Nah, it's not the exotic hunts, it's bushmeat and soldiers.",
            "So they thought they were human and still skinned them? 💀",
            "I remember when I was a kid, sometimes there'd be a coffee table or umbrella holder made out of a real elephant foot in one of the antique stores my parents dragged me to.  Back then I didn't understand why my mom found them so distasteful.",
            "Nuh. No Chinese medication around gorilla. It’s just the white people wanting to kill shit for the fun of it.",
            "This is fucking bullshit. \n\nThere are no gorillas in traditional Chinese medicine. \n\nGorillas are endemic to Africa. They don’t exist in Asia.\n\nOn top of that, it wasn’t until the 1847 that the existence of Gorillas was widely accepted by people outside of Africa in Europe and Asia. American physician and missionary Thomas Staughton Savage and naturalist Jeffries Wyman first described the western gorilla in 1847 from specimens obtained in Liberia. Prior to that, Gorillas were considered almost legendary creatures like Bigfoot by Europeans, only heard of in stories though of course Africans themselves knew they exist.\n\nhttps://en.m.wikipedia.org/wiki/Gorilla\n\nBasically, Gorillas don’t exist in Asian culture so how can they be used in traditional Chinese medicine?\n\nYou know who uses Gorilla body parts in medicine? \n\nTraditional African medicine!!\n\nIn addition to using their body parts for medicine, Africans are also using them as magical charms and hunting their meat for bushmeat.\n\nYou can read about the United Nations report on the threat to Gorilla conservation here:\n\nhttps://www.cms.int/gorilla/es/node/4398\n\nThat is the reason why Africans themselves are poaching Gorillas. Combine that with habitat loss due to human development encroaching on their lands and western hunters hunting them and now you know why Gorillas are endangered.\n\nIt has nothing to do with Asia at all.\n\nBut that is not going stop you from being racist towards Asians, is it?\n\nAnd look how many upvotes you got for spouting racist bullshit?\n\nFuck you, Fuzzy-Numbers, and fuck everyone who upvotes you.",
            "Why are you racist?",
            "*Just* because it tastes good?\n\nMore like *just* because pig farmers (and any corporation that makes pork products) want to make more money. The less time/space they give to each animal, the more animals they can have and the more money they can make. It honestly isn't more complex than that. Every single farmer every single year is trying their hardest to make a way bigger profit than last year. \n\nIt would be literally impossible (I'll concede lab grown mean may work) to tackle animal cruelty from a demand perspective. There will always be a demand. But you can influence the supply. Once supply is lower, even the meatiest mean eatin' carnivore American couldn't stop the food culture from changing (different recipes becoming popular, substitutions are found, it could even spur more funding into the lab grown meat I mentioned). Which would reduce demand a little. The farm industry grew demand by influencing culture with mega popular/false advertising campaigns for the past 70 years so it's demonstrably possible to change it back. (Also by \"being too big to fail\" in the case of cow farming -- the government would rather have cheese caves than actually let those fucks lose a profit; excess product, excess profit, and the government just keeps saying \"yeah go ahead and stuff more cows in there! get your bag king!\").\n\nIf I'm brutally honest: you're wasting your energy doing anything but trying to get the corporations or government to change. I realize that is significantly more difficult than targeting individuals and thus you will understandably ignore this and continue to target individuals purely out of a desire to feel like you're doing *something*. Been there a million fuckin times.",
            "Aight bro 😂",
            "Nah you right he's giving the cheadle stare",
            "![gif](giphy|xT9DPpJ7i2BZxgi4so)",
            "The whole concept of films where they paint a human in blue and add a tale or paint it in robot or add a fur like here - and call it a day - is not just broken, it really mirrors the audience standards. These films are supposed to get instantly Golden Raspberry for writing.",
            "That shit cray",
            "Many theoretically less intelligent creatures and pets show appreciation for things. I’m certain they have those capacities. It depends on the creature whether they show it and how. Since gorilla’s have the capacity for recognising themselves in a mirror it’s not far fetched for them to recognise themselves in pictures. The way they are posing, especially in the 2nd picture, I feel like they get shown the pictures and might know. (Edit: actually if it’s in selfie mode it is essentially a mirror to pose for as well)",
            "Gorillas are crazy intelligent. \n\nGorilla sign language is a real language we made up and taught them. \n\n[This is a gorilla telling zoo goers that they aren't allowed to feed him after someone threw him some food](https://youtu.be/TGUdbiVWZYM?si=_AZ42L-bIrvgF4tX)\n\nI don't know if they are aware these guys are protecting them but they're smart enough to be aware of concepts like that.",
            "I am sure they can show appreciation. Even dogs show appreciation and they are much less intelligent than apes.",
            "https://www.theguardian.com/world/2019/apr/26/gorilla-selfie-congolese-ranger-tells-how-he-snapped-viral-photo\n\nPrimates as a whole are so intelligent and deeply empathetic (and also horrible in all kinds of novel ways). It’s sad how we’ve chosen to treat these primates as “animals” instead of our close kin.",
            "Friendly reminder that animals have outliers the same way humans do. Some of the same species may be exceptionally smart -- or stupid.",
            "Yeah, same! I was a bit worried the baby would crawl through the fence. Thankfully it didn't happen.",
            "Give this primate a modelling contract or we riot.",
            "My god. If John Oliver sees the dump truck on that gorilla…",
            "Sweet Jesus that 🍑",
            "_unexpected inspo_",
            "\"Today we're using a basic foundation in charcoal gray and we'll do a darker gray lip\"",
            "TIL I'm part gorilla",
            "ye like cows",
            "I think it's because they do not stand upright as much as humans. You need the core strength of abdominal muscles to stay upright. Just like how a baby has a pot belly, until it starts walking.",
            "I recall that Steve Irwin’s family support the amazing Black Mambas. They’re women with guns protecting Rhinos in South Africa. They’re bad asses.",
            "No i think he means the Gorillas themselves",
            "Instagram comments are vile",
            "r/catsstandingup doing its best",
            "Four legs good, two legs bad.",
            "I like that he did that without my consent ;)",
            "Gorillas in Paris",
            "Gorillas in the midst",
            "That's what she said.",
            "This deserves more upvotes.",
            "Where's the Chinese bear to reference this argument.",
            "If it helps, we turned their mom into bushmeat, she is likely a stuffed trophy in the office of the CEO of Nestle or someone like that.\n\nEdit: \"we\" as in humanity",
            "I read this sentence 3 times before I put it together. Insert the below to read this faster!\n\n? |  ,  | .\n\n\nI need coffee.",
            "They need him because he has the phone.",
            "Data transfer, Gotta squirt them ones and zeros",
            "I’m pretty sure there was mud or clay or something in there somehow.",
            "Read it? I was there",
            "I thought I was from a McRib or something like that",
            "Math, science, history \n\nUnraveling the mystery\n\nThat all started with the Big Bang. Bang!",
            "Well, I have bad news for you. They can do that.",
            "\"This is you human: Duh duh duh\"\n\nGorillas mocking us.",
            "Thank you for introducing us to Magilla the neat freak Gorilla.  Ladies love a clean primate\n\n![gif](giphy|3kwbZNWyavY0a5TctQ|downsized)",
            "Alright, I'm floored 🤣🤣. That was really cool, thanks.",
            "🤮",
            "I wish I kept scrolling instead of reading this comment. Some people are fucking sick",
            "Which company?",
            "That’s some Ed Gein shit",
            "Bro what the absolute fuck.",
            "Jesus christ why is this getting upvoted",
            "r/rimworld is leaking",
            "And my loafers, former gophers!!",
            "Ye but u kno least one rich guy went today I wanna hunt gorilla 🐱",
            "Human leather, mostly made from the skin of black people (and the occasional executed criminal), was a fad in the late 19th century.\n\nUntil a few years ago, there was also a British company that claimed to make it from the skin of purchased cadavers for bespoke wallets and other accessories, only accepting payment in crypto.  Of course, a lot of people speculated it was fake, but since bitcoin transactions are public, several payments equating to thousands of pounds were logged in their account.  Could've been a money laundering thing, though.\n\n(I dug into it for an article at the time that ended up not being published, not out of personal interest.)",
            "They were resisting!",
            "What did you expect from a culture that sacrificed their children?",
            "I am fine with hunting for sport on one condition.\n\nNo weapons.  You go out there and kill that animal with your bare hands, like a man.\n\nAlternatively,  give the gorillas guns and ample time for training, and intitiate proper Gorilla warfare.",
            "It's usually villagers for bushmeat and illegal trade in skulls etc.  It's horrible.",
            "And natives for trophies",
            "According to this website it looks like the main people who kill them is to eat them so I would assume they are most likely black. The other big reason is medicine. But yeah, maybe it is just evil white hunters and the WWF should contact you for some better information. \n\n\n\nhttps://wwf.panda.org/discover/knowledge_hub/endangered_species/great_apes/gorillas/threats/",
            "Heres a source that says it's both.  NSFW, there's pics of the body part trade.\n\nhttps://news.mongabay.com/2017/01/trade-in-skulls-body-parts-severely-threatens-cameroons-great-apes/",
            "It's mostly native folk hunting them.",
            "Nah, not everything bad in Africa is whiteys. I'm this case it's usually bushmeat or errant soldiers.",
            "Gorillas, no - but just because animals aren’t Asian does not make them safe from the far-reaching network of trade in animal parts for TCM and/or prestige. \n\nAfrican rhinos are targeted for their horns - this one’s super well known. \n\nSharks are finned the world over for a status soup at wedding banquets. \n\nPangolins in Africa risk extinction for their inert scales, so highly valued in Chinese medicine.\n\nEven in the Sea of Cortez in Mexico, Chinese medicine has critically endangered a drum fish for its valuable “maw” and killed a porpoise into oblivion as bycatch - [read here](https://porpoise.org/knowledge-base/totoaba-connected-vaquita/). \n\nWhile the hunters may not be Chinese/East Asian, it’s not at all unusual for Chinese medicine to endanger animals far beyond Asia.",
            "If enough animal lovers realize that modern animal agriculture is cruel then I think we can influence demand. Look how up in arms people are about these poachers. People want to help animals. I think if they realize that their food is tortured and that it’s due to/for their demand then we’ll see consumer change. \n\nFor me personally it was hard to know an animal was tortured for me and that ethical animal agriculture isn’t possible in my country. \n\nAt the very least, call it a funny comment rather than a position altering comment. Calling out how quick we are to call out some forms of animal abuse but not the one affecting 9 billion animals in the US each year. We can laugh and move on if this was a waste of time and effort from our 6 combined paragraphs ;)",
            "It wouldn't be *that* impossible to create change through policy.\n\nIf animal welfare becomes more important as an issue to voters, you can introduce national regulations for better minimum standards of animal farming. Add an import tax for meat that wasn't produced under comparable standards outside your country and you have just made meat production more ethical while keeping farmers able to sell their product.\n\nThe problem is, can you sell the resulting price hike to consumers? Most farmers will of course be against it because it will generally lower how much they can sell, but farmers are not a huge group as a percentage of population and you can soften the blow with financial government support.\n\nWeirder things have happened in history.",
            "![gif](giphy|tEQ8aAOh60us0)",
            "Understanding when something is being nice to you is one of the most basic and useful evolutionary traits that a large majority of animals share. Shit even chickens can bond with people who do nice things for them.\n\nI'd say that the fact that gorilla's live in large groups is enough evidence to suggest they likely have semi-complex emotions regarding things like love and appreciation. \n\nIt's much harder to survive as a species if you can't identify \"hey this unique creature is treating me with love\"",
            "I wanna be a cow",
            "Four legs good, two legs better",
            "Then you're really gonna love what I'm about to do to you.",
            "I saw somewhere that they had found a gorilla paw that had been used as an ashtray by some business asshole. ",
            "This is really the role of humanity in the big picture.\n\n One day, we will create self sufficient plant computers armed with machine learning, capable of observing animals and mastering their communication methods.\n\nThese intelligent forests will facilitate the creation of a zoocratic society. Humanity has always thrived by empowering it's superorganism, the inclusion of all organisms into one superorganism is key to making full use of this planet's resources.\n\nThis is my religion, thanks for listening.",
            "And … a rib, maybe?",
            "The most “trusted” translation says dust. Creation of man by clay is in many other tales and not just Abrahamic mythology: Epic of Gilgamesh (Sumerian/Babylonian), Egyptian god Khnum made human babies from clay too. Prometheus in Greek mythology. In India Parvati created Ganesha from clay and these are only the few I can remember rather fast. I didn’t even go through East Asian mythology.",
            "Wasn't that Lilith?",
            "Probably why he's standing up",
            "Lube was hard to come by back then, okay?",
            "![gif](giphy|h3e3Tch1zrXgrtHwaF|downsized)",
            "They are 100% mocking him. But it's adorable they are comfortable enough with him to stand there mocking him so calmly and close.",
            "🤣🤣🤣",
            "Glad you liked it 😁",
            "Useless bonus info, some human infants skip learning to crawl and instead move with knees off the ground, much like a ape would. It's called bear crawling.",
            "Wait till you hear about urinary tract water pouches. \n\nPpl remove the dick and bladder of a human or certain animal carcasses and u can fill fluids in it and drink it from the dick.",
            "Shovels dead animal flesh into mouth \n\nGod people are so sick \n\nI'm not calling you out personally I just love the irony of our species and what we find \"normal\"",
            "Curiosities from the fifth corner and urban outrage.",
            "Because it’s not meant to be taken seriously",
            "Thick-skinned people don't mind such jokes.",
            "Rimworld",
            "Because reddit is full of maniacs sadly",
            "Turtles' necks, I've got my share",
            "Hah! Im a fatty thats lost 53 pounds this year with 48 more to go to reach my goal. I joked to my wife I would get a wallet made from my loose skin when I finally lose it all.",
            "i hate people...",
            "Didn't they make a movie like this where monkeys are armed and fight people? It was called, \"World of Monkeys\" or something",
            "I think it’s fair game if the person crafts their own weapons using only environmental surroundings.",
            "Nuh. If you want to kill something, go to the frontline. We have too many humans anyway.",
            "Natives eating monkey : 😭😭😭😭\n\nAnericans eating burgers from tortured cows: ☺️☺️☺️☺️😋😋😋",
            "All I'd have to do is say moo every day",
            "Will I be D: or :D?",
            "God created America 2024 years ago",
            "I thought someone caused a big banging sound???",
            "Lots of snu snu",
            "yeah in chinese mythology(taoism), its a similar thing",
            "You forgot to mention Dionysis",
            "Thanks for info",
            "Aphar adamah is what gets translated dust of the earth. Yep. Adamah, as in Adam. I always found that neat. Could also translate it as ground dirt. Lol",
            "Frasier ex wife 😂",
            "[Wait](https://y.yarn.co/2be88581-4f11-42d9-a649-6a2c08b13b59_text.gif) so you're saying the whole paper straws thing was unnecessary?",
            "I don't know about the other one but urban outrage is clearly fake",
            "Reddit is the Drax of social medias. It's where everything is taken seriously even random thoughts and jokes.",
            "And make better furniture",
            "It reminds me a lot of \"A modest proposal\"\n\nUnhinged in the very same way",
            "Not really. Full of neurodivergent people that don't get jokes? Yes",
            "You’re thinking of Galaxy of the gorillas",
            "Globe of Gibbons",
            "Cows aren't critically endangered.  I think it would be a tragedy for such amazing animals like gorillas, chimps and orangutans to disappear.",
            "Mooooooo",
            "![gif](giphy|d7vbmoGrHfmuc)",
            "That was me.",
            "I mean. By principle, you’re correct.",
            "Wouldn't that make....social media the Drax of social media?",
            "Man Curious George has really branched out.",
            "Gorillas are also much more intelligent and close to humans.",
            "A hard day's work; I can rest easy",
            "Obnoxious sounding bird",
            "Case Oh? That you?",
            "Stubbed your toe on the coffee going for a glass of water at 3am? I hate when that happens.",
            "Well you should probably keep the noise down",
            "It’s better than Bi-Curious George. The censors didn’t like that one too much",
            "Moooooooooooooooooo",
            "Don't worry, they'll use the redtail hawk sound instead and pretend it's the bald eagle.",
            "Okay. Sorry. I’ll do better.",
            "Wow even my boy can’t escape systemic bisexual erasure… F",
            "Because the bald eagle sounds like a squeaky seagull. They're natures Mike Tyson.",
            "Yes. For Gods sake we don’t need this to happen again /s"
        ]
    },
    "Guy throws a beer to someone on a large boat. Boat acknowledges accomplishment": {
        "title": "Guy throws a beer to someone on a large boat. Boat acknowledges accomplishment",
        "score": 37250,
        "url": "https://v.redd.it/2aoemj9gay7d1",
        "content": "",
        "num_comments": 798,
        "comments": [
            "Psssh. I can totally make that throw. Is exactly what my drunk brain would say and then it would only make it about 1/4 of the way. And then there would be laughs instead of cheers.",
            "The captain blowing the horn telling the seaman he better not drink that lol",
            "Now who says he peaked in high school?",
            "Best throw I've ever seen made in a Browns Jersey",
            "Tyrod Sailor",
            "One hell of a throw, bro.",
            "He once scored 4 touchdowns in a single game",
            "![gif](giphy|RPx04h8iPidAQ)",
            "Most Midwestern shit I’ve ever seen",
            "Your God. That's quite \"American.\"",
            "This is the most Cleveland video ever",
            "Cleveland baby!  Cuyahoga in effect",
            "That sir is a ship not a boat!",
            "Cleveland! This one's for you!",
            "How much you wanna make a bet I can throw a beer onto that ship?... Yeah... Coach woulda put me in fourth quarter, we would've been state champions. No doubt.",
            "Hahaha I fucking love Browns fans",
            "Finally something for browns fans to celebrate",
            "I bet that guys name is Chaz",
            "Fuckin Cleveland",
            "Fuck yeah!",
            "r/GreatLakesShipping",
            "Best QB in Cleveland’s history.",
            "I feel so bad for his wife... weeks of reliving this moment lolol",
            "The next Beer Quarterback",
            "Here we go Brownies here we go!!! Woof woof",
            "Helluva throw!",
            "This is so… USA.  I love it.",
            "Gotta love Cleveland",
            "![gif](giphy|8maQUL5HiZbYLeMqXl|downsized)",
            "Browns better sign that man, Watsons trash",
            "They’re all applauding that guy’s greatest achievement in life.",
            "That was amazing. My breast would have swollen much more than his did.",
            "Some poor deck hand just got knocked TF out!",
            "Dang man, that man can throw",
            "Dudes got a cannon",
            "Cleveland rocks",
            "Go Browns!  Man Cleveland is fun!",
            "(216)",
            "Love seeing my city on the big stage 😎",
            "Only in Cleveland",
            "Nothing says Cleveland better than a murky river, an old barge and a pregame.",
            "That was a glorious throw.",
            "If I could go back to highschool… we’d take state. Incan throw this ball clear over them mountains",
            "Went on a kayak once, down a river, guy offered beer for boobs",
            "Best arm I've seen on someone wearing Browns gear in 30 years!",
            "The American Courage being thrown liquid courage.",
            "That was a Herculean throw.",
            "Okay but that really was a great throw lol that distance and accuracy were spot on",
            "Nice shot",
            "Holy shit, that was one hell of a throw LOL",
            "Browns fans have experience tossing beers",
            "Kosar or Sipe, Best Browns QB ever?",
            "AND THE BOAT GOES WILD",
            "Night boat to Cairo?",
            "Boat’s name checks out.",
            "That’s a major league arm right there",
            "How tf do you even catch that",
            "Yeah that's cleveland alright",
            "Steve Austin looking to hire this guy",
            "Life in Cleveland baby.",
            "Cleveland rocks!",
            "Deshaun Watson rn\n\n![gif](giphy|55itGuoAJiZEEen9gg)",
            "Browns know how to beer.",
            "This is why Browns fans are the best!",
            "Muni lot, normal pregame festivities. Go Browns.",
            "Let’s go Browns baby",
            "![gif](giphy|Qh6NZWsFx1G1O)\n\nThat guy at the end🤣",
            "Please tell me someone did this for the guys who hit the Baltimore bridge/stuck there for weeks!?!!",
            "Can’t get more Cleveland than that!",
            "Fuck I feel so god damn Patriotic right now!",
            "Fun times in Cleveland today! CLEVELAND!",
            "Damn, that was a helluva throw.",
            "America is the greatest country in the history of the world",
            "Best throw from someone in a browns jersey since the 1950s",
            "Nathan Peterman couldn’t make that throw",
            "Was that the greatest beer throw ever?",
            "MOOOORE+++TEN+++MOORE",
            "Where was this guy when the Browns needed a QB!!!",
            "Ohio",
            "woooo this is amazing",
            "So this is how the Dali crashed 😳",
            "My faith in humanity got restored with this",
            "Its a guy thing",
            "[removed]",
            "Colorado Avalanche goal",
            "That is so cool and the atmosphere of that tailgate I feel like I was there just sitting in my living room \nMost Excellent ! Kudos to all",
            "I doubt I could even get it in the water.",
            "I love how Americans love everything lol in uk we would congratulate by saying , well done mate",
            "Tailgating is the best",
            "And yet they'd rather start a sex pest?",
            "Bro offsho'",
            "Sign the man. The Browns haven't had someone make a throw on target like that since the 50s",
            "Can we acknowledge how much the last dude looks exactly like brownie the elf?",
            "That throw was demonstrative of American Courage",
            "If only the browns would draft him",
            "No brain cells to spare",
            "That's American Courage right there.",
            "I wonder which attempt that was.",
            "Browns goat qb",
            "Seems like someone is living a life out there.",
            "American courage, meet liquid courage.",
            "the ameircan dream",
            "![gif](giphy|b5jJbL7VsFwNa|downsized)",
            "GOOOOOOOOOOOOAL!",
            "Better arm than Cleveland’s current QB",
            "is this the American social credit score system? \n\ndo amazing nontrad sports feats then get saluted by large machinery?",
            "And they all went for massages to celebrate",
            "Pretty decent throw too",
            "That was their Superbowl",
            "Amazing throw!",
            "Good clean fun",
            "How the fuck is that even possible? That's crazy far!!! If real that's awesome",
            "Did that dogs voice crack 😂",
            "Somebody’s getting laid tonight !",
            "How many more throws would it take to make sure the whole crew had a beer?",
            "Legend",
            "He's thrown a kettle over a pub, what have you done?",
            "Love the  potion seller at the end there.",
            "Good 'ol Cuyahoga River looking as clean as cardboard like always",
            "Typical day in Cleveland",
            "Good lord that throw. My throwing arm is total garbage, so I've learned to use a rock sling to throw balls with my dog. He threw that can about as far as I can sling a tennis ball. And I can sling a tennis ball about three times as far as I can throw it.\n\nThe guy's a beast",
            "I hate how belligerent alcohol makes certain people.\n\nBut at the same time, I also love how much alcohol brings people together. \n\nA bit of a paradox.",
            "Response was Morse code: B for beer.",
            "![gif](giphy|UlQO854HUo0yQAvTCq|downsized)\n\nDoggy is freaking out!",
            "Stilllll Cleveeeeeelaaaaaand!!!",
            "That is legendary",
            "Could have gone pro if I hadn’t joined the Navy",
            "Testosterone vs estrogen",
            "Dog is stoked haha",
            "This makes me feel happy.",
            "That's easily the best Pissile I've ever seen!",
            "What if the beer took out the dog or something and they were furious 😂😂",
            "So one long two shorts is beer received. Got it.",
            "The WWE had an employee whose job was to throw beers to Stone Cold Steve Austin. The employees name was Mark Yeaton. He was their time keeper, as well.",
            "Definitely cleveland 😂",
            "Someone get that man on the field.",
            "Better than every Browns QB ever",
            "I misread this as bear. Then it looked like a very little bear. And not a live one. Then reread the title.",
            "That's nice, Browns' fans had something to be happy about that day.",
            "And the browns proceeded to lose",
            "American courage… better with beer",
            "That is a great video. Looks so fun!",
            "If coach had just put him in at half time…",
            "Seen it happen a few times in Cleveland",
            "The horn was to ask them to throw more for rest of the crew",
            "The name of the boat says it all",
            "He’s got laid that night",
            "Why did you leave lady #40 hangin tho :((",
            "Cleveland has more talent in the parking lot than they do on the field. No wonder !!",
            "I thought the ship was gonna blast VH's Jump (it would be the icing on the cake)",
            "unless Americans have different protocol (which I wouldn't be surprised by; they basically do everything differently in regards to ships and have completey different language in my experience), I don't think the horn was related to the beer toss. One long blast followed by two short blasts signals \"I am leaving port and am turning to the port side (left)\".",
            "That they didn’t break into a USA! USA! chant seems like a missed opportunity.",
            "I was really hoping that the boat would do one more blast of the horn, it was sounding like the start of Jump Around",
            "the best part is how the dog likes it :>",
            "I prefer the Encino man timeline.",
            "He could throw Stone Cold Steve Austin his Steveweisers… from the next state.",
            "Dudes will see this and be like \"hell yeah\"",
            "\"and then everyone cheered and even the captain blew his horn in amazement\"\n\n\"sure Peter, Im sure thats what happened\"",
            "Uncle Rico been working hard.",
            "That's the broest bro in brolandia",
            "Alas, they're still Browns fans.",
            "*Dog acknowledges accomplishment\n\nFixed it",
            "That’s “yooooo, thank you!” In horn",
            "This is the most Cleveland shit I’ve seen",
            "Hell ye",
            "Deshaun Watson nervous as hell rn",
            "What a cannon",
            "Jesus, that throw was amazing!",
            "Lmao this is one of the most “Cleveland browns fan” things I’ve ever seen.",
            "Boats and horns Boats and horns!",
            "These are the boat nerds we like😎👍",
            "Is that the cuyahoga river?",
            "Wearing the jersey of the best defensive end in football! Myles Garrett baby!",
            "If the boat’s was name anything else other than American Courage it would be wrong",
            "Best honk ever",
            "Pupper is just happy that everyone else is happy.",
            "Don’t give more validation to this guy! He probably thinks he’s the king of the world already",
            "Of course the best throwing arm in Cleveland is a fan of Browns, and doesn't play for the team.",
            "Couldn't have happened to a more perfectly named boat *Guy Fieri chef's kiss*",
            "This is basically his skydiving, I bet every day felt mundane after this",
            "Say what you will, at least it's not Detroit...",
            "Tail gating already for the first preseason game 2024z",
            "That's pretty funny\n\nWouldn't it still be funny without the whooping and jumping and hand clapping and screeching, though?",
            "With that kind of throw the Browns need to sign him to a multi year fully guaranteed contract. Can't do sny worse.",
            "This guy is the best quarterback in Ohio.",
            "Hose piece",
            "And now i’m wondering why i haven’t previously heard about “Beerlympics”.",
            "That dude at the end of the video sold me potions that were way too strong... he did warn me, though.",
            "Stiffler making an appearance at the end",
            "Guy right at the end looks like an Elder Scrolls oblivion npc",
            "There are about 700 high school football stories in this video.",
            "Cleveland rocks!!",
            "When someone asks me what \"Alpha male means\"  I'll show him this.",
            "New Orleans?",
            "Must have been in the Flats in Cleveland. On the mighty Cuyahoga River.",
            "This is the most delightfully American thing I've ever seen. Even the ship is called \"American Courage\".",
            "i’d ask him to marry me on the spot",
            "The Browns just signed him as a backup QB.",
            "Ohio",
            "Much love to our hometown talent 💪🏿",
            "Good ole great lakes salute",
            "That was a \"get back to the captain’s cabin you're fired\" blow.",
            "I hate to be that guy, but those horn blasts were a regular manoeuvring signal for manoeuvres around a tight bend or with difficulty. But in saying that, I’d have done the same to acknowledge the throw and keep things above board at the same time.",
            "Great throw, but now I'm just thinking about how shaken that beer must be.",
            "That lady got left hanging on her hi give... So sad..",
            "Oh my god, only in Cleveland",
            "That’s a ship not a boat.",
            "To those of you not from America, I want you to know, that we are the freest and bravest people in the entire United States",
            "He Uncle Rico'd that sucker. Man.",
            "Welcome to Cleveland",
            "Ship gave him the D, in morse code",
            "Nothing like the AFC North... But I still hate the Stealers, brown stains, bangletts.",
            "Im watching this like man that looks like Cleveland! then notice the Jerseys... Im sure they appreciated the brew in this heat.",
            "Which bridge did that one crash into?",
            "Just a fun little news clip of the incident.  \nhttps://www.youtube.com/watch?v=SQYREqdvz68",
            "💪",
            "How does one go about CATCHING that fucking beer?",
            "OHIO! HIO, HIo, Hio, hio......",
            "Bunch of drunk people having a good time. I'm amazed.",
            "He'll be the Browns QB by week 6.",
            "This is truly a ”Then everyone stood up and clapped” moment",
            "Unbeknownst to them, the boat cap replied with a morse D word 😇",
            "Then the boat careened into a bridge. \nThanks Biden.",
            "Not to brag but I bet I could chuck that can to the near shore.",
            "And they’re paying Deshaun Watson how much?",
            "Only in Cleveland!!!!",
            "*The Promise - When in Rome \n\n“If you need a friend”",
            "Boatey McBeerface",
            "in a Myles Garrett jersey no less. 🐶🟤⚪️🟠",
            "Cleveland rocks!",
            "Good shit.",
            "Cleveland Rocks!",
            "Look how Chad is proud of this moment .",
            "Best throw since the cake to the face of the guy in a wheelchair",
            "![gif](giphy|9ZyHQhuLOVDqFXSEco|downsized)",
            "BROWNS FANS 😭 best throw in Cleveland this season wasn’t on the field that’s for sure",
            "Love videos like this fuck yea 🇺🇸🦅",
            "hopefully this will not make everybody else try to throw beers at this boat.",
            "This just in, the Browns sign a new qb",
            "What’s better than this … just guys being dudes! *awkward little hand flick*",
            "The ship is called American courage which is also what you’d call beer",
            "I know exactly where this is lol",
            "Siren is a perfect touch!",
            "I am aroused.",
            "Oh shit, the American Courage? It was slightly grounded last year and our company helped get it unstuck.",
            "The equivalent of 100 semi horn honks!",
            "Maybe the Browns will be good finally",
            "Cool bot post!",
            "God bless America.",
            "Next stop was Baltimore",
            "Only in Cleveland",
            "Some liquid courage for America Courage",
            "1 of the most incredible things I have seen",
            "Boat name checks out.",
            "That was a pretty mad throw to be fair.",
            "He needs to be signed to the nfl.",
            "What a toss",
            "Anyone have any idea on how many yards that was? My guess is 55!",
            "What football team does this man play for? What team scouted him after seeing this? Lol",
            "Hell yeah.",
            "\"Come see our river that catches on fire\"",
            "Ese sujeto tiene demasiada fuerza... Y talento, jaja",
            "![gif](giphy|Z6f7vzq3iP6Mw)",
            "Somebody needs to send this to every baseball team.",
            "am I the only one that thought what a pack of ferals...",
            "so thats how the balitmore bridge collapsed",
            "Go Browns!",
            "Cleveland is the tits!\n\nhttps://youtu.be/gg86Enr2WZ8?si=9EqvroCNopiAEUNr",
            "Epic. ... they'll  be talking about that 20 years from now. This beer's for you . 🍻🍻",
            "Fun times in Cleveland TODAY,  CLEEEVELAND!",
            "A top ten pass in Cleveland Browns history",
            "Browns tailgating party.",
            "For boat nerds, that's a \"Captain's salute.\" One long and 2 short.",
            "So cool!",
            "The boat is approximately named American Courage.",
            "Fun fact humans are best throwers (by far) in the animal kingdom.",
            "That’s the arm the Browns have been looking for!",
            "At least SOMEONE in Cleveland can complete a pass",
            "Being young was fun:p",
            "Great, this is gonna be a thing now",
            "I'd probably hit the side of the boat and cause it to sink.",
            "My guy laughing with the fries. 🤣",
            "that is a BIG throw.",
            "This is what is right with America.",
            "certainly wasn't Deshawn Watson",
            "Thats a beer fart by the boat",
            "That's boat speak for \"more, we want more\"",
            "Go browns!!!",
            "Contraband! Brig for 7days, unless you hand it over to the captain…",
            "Most accurate Browns pass of all time",
            "For some reason I thought it would be a glass bottle",
            "![gif](giphy|3o6gEdaz1ujVvncag8)",
            "\" that was incredible\" is the most american thing you can say in the most american situation 😂😂",
            "Merica",
            "![gif](giphy|eAjMripleuVMLRcbqv)",
            "God damn if it isn’t The American Courage",
            "That’s one hell of a throw. Take that college nerds.",
            "The browns should draft him. Maybe they'd win some.",
            "Guy won't be able to open it until they get to their destination or risk exploding it.",
            "I mean that WAS a good throw.",
            "Best throw by a guy in a browns jersey since Bernie Kosar.",
            "Better throw than most actual browns qbs",
            "Boat's name should have been 'Liquid Courage'",
            "The browns should hire this guy",
            "Is this what Americans refer to as a tailgate party (not sure if correct name)?",
            "Hey kudos to the guy that caught the beer too!",
            "Sign that man",
            "That’s a lot of white people",
            "Humans will see this and think “fuck yeah”",
            "That's probably the same dude that tosses beers to Stone Cold.",
            "Good ole “American courage”",
            "My buddy Eric threw one probably double this length at his party back in 07",
            "He’ll be the Brownies QB this Fall.",
            "What an arm 😆😆😆👍",
            "Deshaun Watson should take notes",
            "![gif](giphy|RPx04h8iPidAQ)",
            "The dawg pound! Where are my Cleveland friends at??",
            "Love how even the dog's into it.",
            "American courage being gifted liquid courage.",
            "Just a bunch of dudes being bros...🦾",
            "Get him a spot on the browns.",
            "Ah yes, that's this kind of good wholesome unstaged stuff that I like to see",
            "Hmmm. Don't wanna yuck somebody's yum, but... He may be acknowledging the beer and the throw, but... 1 long blast followed by 2 short ones means the ship intends to alter course to starboard",
            "I believe in humanity",
            "Good throw from a Steelers fan",
            "All done with mirrors.",
            "He's make a better browns QB than watson",
            "Toledo?",
            "God I miss tailgate season",
            "No matter what, there's always a woman screaming",
            "...isn't this the river where that cargo ship crashed into the bridge? now you're throwing them beers? /s",
            "[removed]",
            "The Browns found their new QB.",
            "\"Oh that's got a shot!\"\n\nBro acting like he got some insider information",
            "“Oh that’s got a shot”",
            "1 long 2 short, that is ship moving astern.",
            "We need more of this in life",
            "The testosterone is coming through my phone screen.",
            "I love how they are all just hanging out, having fun, doing life, one beer thrown overboard- let's all cheer him- at a time. What a fun loving bunch of people.",
            "Get that man a contract lol",
            "It doesn't have to make sense, we do it because we're free.",
            "Cleveland. Hugely underrated.",
            "Wow how did you do that the boat is like 100 steps away from you",
            "Best throw by someone wearing a Brown's jersey in a loooooooong time",
            "The greatest event for Ohio ever",
            "That was really impressive",
            "Americans…",
            "Don't forget a torn tendon and labrum.",
            "That same thinking is why we ride mechanical bulls and try bear wrestling. We'd be less fun if we weren't convinced we could do the impossible.",
            "Seamen an I right",
            "Nah thats the great lakes salute, I grew up around those ships and I've seen that one many times.",
            "He better wait a few minutes to open that because that can is about to go thermonuclear from that throw.",
            "Lmao the fishing or boat industry workers are more often than not intoxicated",
            "I thought being inebriated was mandatory for being on a boat?",
            "He could throw a football over them mountains. Woulda been state champions if coach had put him in fourth quarter.",
            "He hasn't even begun to peak!\n\n![gif](giphy|3oKIPcfX631trLEyCQ|downsized)",
            "He never had the makings of a varsity athlete",
            "Plot twist, he’s retired QB",
            "Don’t you dare disrespect our precious boy Joe Flacco like that",
            "Browns fan here - I approve this comment",
            "A couple years ago they'd have a recruiter out there in 20 min asking him to come inside for a try out.",
            "Waaaay more accurate than Taylor",
            "For real! looks like 100 yards at least. Impressive.",
            "You a Polk High alum as well?",
            "![gif](giphy|qLDOGhAoj4dETDcZBR|downsized)",
            "What’s interesting about this is that this was filmed in Cleveland, Ohio (Cuyahoga River) where giant barges go through almost daily so it’s a cool event to witness especially on Browns game day. \n\nEd O’Neill (aka Al Bundy) who you’re obviously quoting is from Youngstown Ohio about an hour and change away. He went to school with my family at Ursuline. So this is a great quote not only for the relevance of the gif but for the fact that Mr. O’Neill has most certainly been to this part of Ohio before",
            "Damn it, beat me to it lol",
            "Man in Browns jersey throws beer to other man on Great Lakes boat… yeah we’ve reached peak midwestern with this one",
            "Never underestimate an Americans ability to throw something. 20 years ago, I was down in Clearwater and watched a football get casually thrown between 2 separate hotel balconies around 100 yards apart with pinpoint accuracy. I saw it happen once and thought that was cool and lucky, then 30 tosses later and casual as you like I'm impressed that I watched something I will never forget.",
            "As American, we do shits like that",
            "If that's \"American\" than damn am I a proud American. ",
            "Im so proud of us rn",
            "Cleveland AF",
            "Your god??",
            "In fact it is a boat.\n\nThe American Courage is a laker, a vessel that carries cargoes on the great  lakes.  By convention, all vessels on the great lakes except for ocean going vessels visiting are called boats.\n\nhttps://en.wikipedia.org/wiki/MV_American_Courage",
            "It's a small ship the size of a large boat.",
            "All ships on the Great Lakes can be called a boat.",
            "Yeah, I told my born in a land-locked state husband the difference between a \"ship\" & a \"boat\" - \n\n\nA ship has a captain\n\n\nA boat operates by mutual consent \n\n\nlol",
            "Right? I'm not a fan of either team, but it seems like Browns and Bills fans are the most dedicated fans to their teams.",
            "Hey we celebrate win or lose lol a parade for each one. Some day hopefully we'll have the winners parade too.",
            "Weeks? Shit that video is gonna come up at every extended family gathering for decades.",
            "Probably has raped less people too!",
            "Going on like you done something better...",
            "Fucking your mom being a distant 2nd.",
            "Why even be a dick unnecessarily fuckin buzzkill “righteous leftie” smh",
            "What they don’t show you is the pile of beers underwater lol",
            "Ehh, this is the Cuyahoga river where boats are going either to lake Erie or the steel mill a few miles doen river. There wouldn't be any other Lakers on the river at the same time, the boats will honk at people at the riverside bars kind of like trucks do to little kids doing the \"honk honk\" gesture",
            "I would be in the hospital if I tried throwing something across the street",
            "Yeah I was never in the navy but i've shot a lot of semen",
            "If it’s to another freighter it basically means “yo, what’s up”. It can also mean “I wanted to toot the horn for some kids on shore” or “thanks for showing us your tits”.",
            ">great lakes salute\n\nA pleasant random video your comment led me to search.\n\n[https://www.youtube.com/watch?v=2pvUuKIGE5I](https://www.youtube.com/watch?v=2pvUuKIGE5I)\n\nAlso.  OP's video gave me a massive grin.  Love seeing that!",
            "Captain's salut!",
            "Stone Cold Steve Austin would’ve caught that one handed and then blasted that grenade down his gullet.",
            "How do you think sails get built? Why would I be sober doing arts and crafts, making triangles all day?",
            "In America, they more often than not are SOBER due to company regulations and USCG policies.\n\nAnd judging by the vessel name, *American Courage*, I would wager that vessel has a USCG Zero Tolerance policy (but only if the Senior Officers enforce it)\n\nFishing boats are more often locally owned than corporate, but it's still a no-no with the USCG, so....own-risk.",
            "\"Give me that...\"\n\n*Throws steak at a guy riding a bike and hits him in the face*",
            " He is the uncle that could have gone pro but the knees held him back.",
            "He’ll be telling that story for the rest of his life to anyone that doesn’t want to listen",
            "I literally just watched Napoleon Dynamite today lol",
            "AJ GET YOUR COAT! WE’RE LEAVING.",
            "Small hands that was his problem.",
            "Bout had enough of you uncle Joon!",
            "You're gonna need to be more specific about which former Browns QB this is, there's only like 50 of them still alive",
            "HEIL MANZIEL",
            "With skill like that, it certainly wasn’t from the browns.",
            "I was on the other side of it, my junior year. Andrew Johnson High class of ‘68.",
            "Kinda warms the heart",
            "As a Midwest transplant I still haven’t been to Ohio but this makes me want to see a browns game live",
            "The english - \"now we shall have three bails 20 yards apart and a bowler batsman and fielders a wicketkeeper shall tend the stumps as the bowling side has a man run up to and not beyond a certain point before tossing the ball to the batsman who shall atte....\"\n\nThe americans - \"catch mother fucker\"",
            "I can barely throw my dogs tennis ball 100 yards with the flinger it came with",
            "Horseshit on that distance. Vinnie Testaverde holds the world record at 80 yards.",
            "Definitely not 100 yards. Two people arent throwing 30 dots back to back over an entire football fields length. \nMost people overestimate distance or underestimate it but its usually about 40% in my educated but personal experience. 60 yards seems reasonable for two fit men who practice",
            "Recently, I've read a as idea about Anthropoid apes and the catalyst-like advantage humans had that up-jumped us to today. It's that homonids who could throw things extremely accurately had an advantage and so even hundreds of thousands of years ago, we were the most accurate, most powerful and longest distance throwers on the planet, eventually leading to slings and atlatls and ballistic missiles and everything else. So, not just americans lol",
            "You watched two random guys throw a football 100 yard back and forth to each other? The average NFL qb gets about 60-70 yards. Guys on the higher end might get around 80 on a good day. If you exaggerate a little less the story might be believable.",
            "\"Man from Florida\" crashes freighter in great lakes carrying load of \"clean coal.\"",
            "The national anthem should have played at the end.",
            "It was a pretty good throw.",
            "It’s a joke effectively saying he’s (OP) an atheist. He doesn’t have a god so he didn’t say the standard ‘my God’ you would normally hear.",
            "They’re being passive aggressive lol. I’m sure they’d love any opportunity to argue with someone about it.",
            "Good to know",
            "wait how does an ocean going vessel visit the great lakes? is there a river that goes all the way?\n\n(sorry not american)",
            "According to Wikipedia \n\nLake freighters, or lakers, are bulk carrier vessels operating on the Great Lakes of North America. These vessels are traditionally called boats, although classified as ships.",
            "That sounds like something my dad would say when he didn’t know the answer but wanted us to stop asking.",
            "I used to be a seaman. Now I just put it all over her back",
            "It also means \"yo lift bridge, please lift up for me\", and the bridge responds back in kind.",
            "I wouldn't expect you to be! \n\nAs long as you don't ask what's in this cooler I'm bringing aboard the dinghy and why there are cupholders on the daggerboard trunk. You can have one if you'd like though.",
            "Yea, I have a uscg license and my guess is the officer in charge was on the radio saying \"you better not drink that Dave\" as the horn was going off. \nI've seen all kinds of wild shit on boats but we never drank on the job, hungover? Yes often.",
            "![gif](giphy|8maQUL5HiZbYLeMqXl|downsized)\n\nJust post the clip, homie. We have the technology.",
            "Just like me fr fr",
            "Quasimodo predicted this",
            "Brady Quinn since u asked for it",
            "Johnny Manziel",
            "None of those former QB's  had enough arm and/or accuracy to complete that throw.  Now if it had landed on the riverbank and rolled into the river, more specificity would certainly be a requirement.",
            "So that's what Johnny football is up to...",
            "Tim Couch",
            "Damn shit I completely forgot about that",
            "If the browns ever win a super bowl, our city might just literally explode",
            "Americans - \\*changes grenades to be more ball-shaped\\*\n\nEveryone Else - \\*terror!\\*",
            "> The americans - \"catch mother fucker\"\n\nAlso the Americans: *\"Alright boys, we've thrown the ball. Time for a five minute ad break.\"*",
            "That’s because you’re throwing a tennis ball",
            "A forgivable exaggeration, imo. No one can throw 100 yards but a lot of dudes can throw 50 and that looks pretty damn far IRL.",
            "Coulda been like a nerf football. Can launch those a mile",
            "I'm not prone to unexpected fits of patriotism, but I mean, this clip is perfect. Boat guy catches it, there's dunks on the table, I'm literally holding back a tear.",
            "Not one river, but several.   However, most ocean going vessels enter via the Welland Canal and follow canal and lock passages through the Great Lakes themselves.",
            "The St Lawrence Seaway\n\n[https://en.wikipedia.org/wiki/St.\\_Lawrence\\_Seaway](https://en.wikipedia.org/wiki/St._Lawrence_Seaway)",
            "New York dug a canal to the Great lakes, it's why NYC grew as fast as it did",
            "A boat travels on top of or under water. A ship goes through it. \n\nThis is the definition I heard.",
            "*spits steak out*",
            "I prefer my memes on old ferrotype sheets",
            "Bro, I forgot how fucking funny this is. Like what the fuck. Motherfucker just threw that meat and hit this dude square in the face like it's something to do. \n\nPoor Pedro man.",
            "Old.reddit users do not have that technology, I'd sooner fellate Spez than use new reddit. Even if it means I don't get to use fancy videos. CryingDawson.gif",
            "No, that's BQ",
            "No way he's giving away his beer",
            "I dunno, Bernie Kosar had a fucking cannon.",
            "Now if we re talking modern era id say you're probably right. DA, Weeden got the arm but it's going over the boat and killing an old lady across the river.  \n\n\n Everyone else save for Kessler, Quinn and Hoyer just smack the lower part of the boat. Kessler, Quinn and Hoyer make it ten yards with lazer accuracy to an opposing team kayaker. \n\n\n Im not bitter.....Go Browns!",
            "Baker fan in Norman, OK checking in...",
            "Can confirm. I worked at a bar near downtown when the cavs won. It is still one of my fondest memories, so I can only imagine the chaos.",
            "Like in ww1 when we showed up with the motherfucking winchester 1897 and the dudes who had been gassing eachother for 2 years were like \"woah yall need to chill\". When little tommy from kansas hops into the trench and blasted 8 dudes to smitherines in 4 seconds shit got real.",
            "There was a video on Reddit a while back of beachgoers in Brazil (I think it was) trying to apprehend a thief. No one knew how to tackle like you would in American football. There were so many slidetackles, flying kicks, etc. It was otherworldly to watch. It was as if the good Samaritans who were trying to stop the thief had somehow all agreed that none of them would do so using any body part above their waist.",
            "It's one of the reasons we push youth sports so much here. Stay fit (for future service) while practicing working together to overcome opposition. And the fact that we do so many thrown ball sports really does help with the grenades.",
            "Your right! Get this man a beer to toss!",
            "If it was one of those ones with a tail on it maybe",
            "\"An American Tear.\"",
            "I don't think that has much use anymore but they dug something to bypass the falls.",
            "Iirc the formal definition is based off which direction it leans in a turn. A boat rolls into a turn while a ship rolls out of a turn.\n\nIt has something to do with how much of the hill is under the water and how much water is pushing on it as it turns.\n\nEdit: Rolls, not lists",
            "Into his own hand",
            "meta",
            "I like mine tattooed on the backs of albino orphans",
            "Pedro's fine. Napoleon had it coming for fucking up his Sledgehammer on that jump.\n\n![gif](giphy|l4JyOmKnVP4ebt4Pe|downsized)",
            "Poor Kip.  Uncle Rico could have thrown his own steak",
            "![gif](giphy|3oz8xUK8V7suY7W9SE)\n\nI got you homie",
            "Solidarity.",
            "Dayummm u smart boy 👦",
            "Bairy Queen?",
            "Just kidding...",
            "That man is practically a saint to my family that still lives in Cleveland.",
            "Don't feel like you have been stranded alone on that little island.  \n\nI'm a 72 year old Jets fan.  Which means that I go back to day 1 of the franchise (the Titans then) and have probably seen even less success with my team than the Browns have had.",
            "U know Bakey could prob make that provided there wasn't a 5'10 person blocking his throwing window",
            "Meanwhile the canadians in WW1: \"Here Heinies, have some explosive potted meat for dinner. It's to die for.\"\n\n\nAs an American, there's a good reason our tophats troops were largely feared on the Western front. So they too learned to throw well. Fun fact, the first baseball game in north America was held in Canada. Gotta be able to throw shit across the great lakes.",
            "They hate on people that play soccer because you dont kick grenades.",
            "Yes, encouraging children to engage in physical activity and teamwork is definitely a military conspiracy",
            "Nerf Vortex",
            "And in the background, freedom rockets",
            "Tucks it in sock for safe keeping",
            "![gif](giphy|U7tbROOyTavgk3gRem)",
            "Kicking grenades is a sometimes thing.",
            "Id rather have a squad of dudes who played soccer than a lot of sports. Good footwork and cardio goes a long way in not dying",
            "lol no kidding. Especially considering there is a pretty decent correlation between kids that played organized sports and kids that went to post-secondary (ie. not the military....)",
            "Careful, some could be triggered by all the democracy.",
            "A chorus of bald eagles all scream together",
            "Only when you have a gun in each hand."
        ]
    },
    "If different fonts were outfits": {
        "title": "If different fonts were outfits",
        "score": 10191,
        "url": "https://v.redd.it/mxvrp4jj1z7d1",
        "content": "",
        "num_comments": 182,
        "comments": [
            "When I was able to start guessing them I knew this was on point.",
            "Not going to lie, I really like the Papyrus look.  I don't think my body nor my bank account could pull it off, sadly.",
            "Damn, he made Times New Roman sexy.",
            "As a lover of fonts, I appreciate this",
            "Now do Wingdings!! \n\nBut for real this was spot on, really well done.",
            "I knew Papyrus before you revealed it lol\nLoooootta things typed with that in my lifetime.",
            "Comic sans still wasnt goofy enough",
            "Damn, that was nice",
            "The whole time I was waiting for comic sans.",
            "I called Comic Sans. \n\nOther than that: damn, that guy knows how to dress cool.",
            "He always does such a great job!",
            "The creator is WSDM (Wisdom Kaye) on Instagram and TikTok if I'm not mistaken. He does a ton of these kind of videos and the editing is always on point.",
            "Man,  this this is spot on!  Nice job picking the styles,  each one was guessable before the reveal. Awesome!",
            "Sauntered in skeptical af, left impressed.",
            "Source?",
            "Not a typeface or fashion guy, but I think this is amazing.",
            "Didn’t see wingdings though!",
            "Arial - was as expected",
            "Arias is my go to font and he nailed it!!",
            "Saw this on Instagram - I wanna see a part 2 where he includes Wingdings! 😂😂",
            "A lopsided tophat for Times New Roman would have completed the outfit. How can you forget the serif man? How??",
            "Impact and Franklin Gothic are my favorites.",
            "Was anyone else not in awe with the cinematography of this. The editing was so clean and stunning.",
            "Papyrus looks amazing 🤩",
            "Dripping",
            "As a word nerd, I love this",
            "How tf is comic sans somehow Hatsune Miku",
            "Impact looked like he was about to gas a school",
            "Can someone tell me his name?",
            "Where can I see his other styles? What's his name?",
            "Why it goes so hard?",
            "Really no Sans Serif love?",
            "These fits are so fucking sick haha wish I was rich enough to dress like this",
            "Hahaha holy shit this is awesome!!",
            "I was kind of surprised that Courier did not look nerdy as heck. Different associations, I guess.",
            "Where’s wingdings at",
            "Wingdings or GTFO",
            "This man is so creative. Only he could make Comic Sans and Arial interesting!",
            "That is amazing",
            "This is AWESOME",
            "God DAMN he’s good",
            "A++++++++++++++",
            "I’m more of a comic sans guy.  🤔",
            "Where is jokerman\n?",
            "I want Zapf chancery. Or dingbats.",
            "![gif](giphy|xUNd9L4atjzNBpdLck)",
            "Heletica was the only miss, this is insane!",
            "No Wingdings Rip",
            "Times New Roman fan here and he nailed it.",
            "Who in the world is this guy? I have to see his other content if this is a glimpse",
            "Lovely. I think Comic Sans should've been shorts and a tshirt tho tbh",
            "As someone who really loves Arial, he nailed it! And also may have given me a bit of gay panic because that was a lesbian look if I ever saw one",
            "I didn't like the Futura one. I think he considered just his name related to \"future\" instead of his modernism, geometric and Bauhaus style.",
            "Spot On! 👊🏼😎🔥",
            "Who is this guy?",
            "Helvetica was *chef’s kiss* 🤌🏾",
            "Comic sans goes harder than it has any right to",
            "I would’ve been so disappointed if he skipped comic sans",
            "Nailed it!  Boss moves.  ",
            "Yoo... that was awesome!",
            "Waiting for comic sans and was not disappointed",
            "spectacular. the only one that didn't nail it for me was Helvetica.",
            "I only came here hoping for comic sans",
            "Idk why but I like impact...",
            "Every outfit looks terrible.",
            "Omg I want that papyrus style",
            "new Sans and Papyrus just dropped",
            "Where is wingding when you need it.",
            "I wanted to see Wingdings",
            "Impact, Papyrus, and Courier went so incredibly hard, holy shit",
            "do Century Gothic and Harlow Solid Italic!",
            "My boy is the ocean because all his fits are wet!!",
            "First thing I saw in when I opened the app, brooo it's cool asf",
            "I WAS WAITING FOR COMIC SANS AND ITS A CORNY FONT BUT THIS WAS SOOOOO SICK!!!",
            "Where was windings",
            "Excellent 1:00 minute of my life. Thank you. ",
            "This guy copied the idea from Elle Cordova, but she’s funnier.\n\n [Elle Cordova](https://www.instagram.com/reel/C2cZBIAr24m/?igsh=MW44eTJ2MTNkenFzZw==)",
            "Of course everyone is capable of telling the difference between the fonts Helvetica and Arial…",
            "As Arial he looked like a person who would've designed Arial",
            "My god this guys is talented",
            "Impact looked 🔥🔥",
            "How about Papyrus bold and Windings as well",
            "You all know it was his own idea and that message is fake, he just wanted to show off his \"sick\" outfits.",
            "I want to see what he does with Wingdings lol",
            "Who is this genius",
            "Okay do wingdings",
            "good work!",
            "Get this man to the kitchen, good lord is he cooking",
            "I waited for him to pose in a nazi uniform for the old germany \"gothic\" font.",
            "We immediately knew it was comic sans, right?",
            "He's styling names, not fonts",
            "Helvetica wasn't hipster enough 🤭",
            "Not sure about impact but the rest was spot on",
            "tf, who is this guy? amazing!",
            "Now do wingdings.",
            "Wingdings?",
            "Am I the only one loving the courier ?",
            "Fucking hell get outside and get some fresh air",
            "His username is @wisdm8",
            "This young man is incredible.",
            "Can someone price out one of those outfits? I think I saw a jacket in there that I know is well over $1,000.",
            "I don't think the helvetica outfit is perfect for this font, but the other ones are a perfect choice for each font. Pretty cool!",
            "Finally, no more skinny pants.",
            "Damn, that’s like 50k in clothing??",
            "Is he wearing an older brother's clothes in most of these? Little dude is SWIMMING in those clothes.",
            "Perfect 🤩",
            "I knew the outfit for Comic Sans before the caption appeared on the screen.",
            "Continue.",
            "I was waiting for comics sans, and he delivered.",
            ".",
            "Omg- you nailed it! ❤️❤️❤️",
            "Why wouldn’t he list each ingredient of his outfits, **in** the fonts he was matching??????",
            "I like Arial font best, but Times Roman font and his Times Roman fashion does something for me.",
            "Was waiting the entire time for comic sans. Anyway: this dude is awesome.",
            "I respect the effort, but he made all of these fonts way cooler than they actually are lol. Arial was pretty close though.",
            "Man, the Undertale fanarts will get wild with this one",
            "From the ass",
            "That's a birthday clown",
            "He missed the chance to make something based on Papyrus from Undertale",
            "This is funny but also very tryhard",
            "He really nailed Helvetica",
            "Papyrus",
            "who here was waiting for wingdings?",
            "Believe achieve succeed",
            "Me too, Papyrus and Courier, others are too much, more for fashion show, except for Impact which is for -40 degrees and fight with polar bears",
            "he should have gone for the \\* NYEH HEH HEH ahh look instead",
            "For that u just need to pickup rags off the street ...",
            "True- with a bit of arrogance, which of course the most well known commonly used font would have.",
            "I genuinely say this with curiosity;\n\nThis is a thing?",
            "I was waiting for Zapf Dingbats",
            "Every time this gets posted Wingdings will be one of the top upvoted replies.",
            "Did he not start as Wingdings?",
            "This was incredible!",
            "Should have been a clown",
            "he should have dressed up in a way rapresentative of a **bad time**",
            "Same 😂",
            "He would slay a runway in those.\n\nEven Comic Sans.",
            "[here ya go](https://www.tiktok.com/@wisdm8/video/7382287766064745759)",
            "[internets](https://youtu.be/dQw4w9WgXcQ?si=qhWliB4iipe6XRI0Q?autoplay=1)",
            "Floppy, colored duct- tape clothes from a runway show. windings...",
            "but no spaghetti skeleton fit:(",
            "Wisdm on instagram",
            "Just plain old sans serif?  He did capture a few San-serif fonts.",
            "Courier should look more like Steve Urkel.",
            "I know what you did!",
            "![gif](giphy|4vDtfgref5z2M|downsized)",
            "Trying hard isn't a bad thing. We shouldn't be ashamed of passion and effort.",
            "i thought that was the biggest miss",
            "What about Papyrus in bold?",
            "I thought papyrus should have a man bun.",
            "![gif](giphy|IGdHYBT3n7Mha|downsized)",
            "Here!",
            "waited and was disappointed.",
            "Live laugh love",
            "Yep! Tons of people are really into typefaces and typography. I’ve heard it referred to as being a typophile but I’m not sure if people really use that term. I get very flustered when I feel someone used the wrong font. Started in when I was in college for graphic design.",
            "Yes.  Some people are really into fonts lol.  I actually made my university install a new font in d2l that students could read better.  I know all the different fonts and their histories. \n\nThere’s a subculture for everything lol.  I get excited just talking about them.",
            "Typography is one of the most popular and important branches of design, its kind of the nerd level for designers. You dont see that much passion and obsession for aestethics in e.g. industrial design. \n\nYou meet the sweetest and most fascinating artists in typography.\n\nTypography is not loved. Typography IS love.",
            "r/kerning",
            "As it should be. We must never forget Wingdings",
            "Preach 🙌",
            "Tryhard isn’t the same as trying hard.",
            "Admittedly, it’s a hard one.  He should have aimed for Helvetica Neue.  \n\nBut I feel like he captured the essence of Helvetica:  simple, utilitarian, roughly elegant.",
            "Shaq dressed as a genie ",
            "Veni vidi gucci",
            "I too get annoyed when people use bad fonts.  I give my students extra credit on essays when they choose a nice, readable font Lolol.",
            ">being a typophile\n\n\"Point on the keyboard where the defendant touched you.\"",
            "I never thought abput this before, but as a wannabe writer, I do put a lot of thought into choosing fonts that have the right \"vibe\".",
            "Have you seen Steve Jobs Stanford address?",
            "A friend of mine printed his entire senior thesis paper in comic sans. It almost made another friend of mine throw up. They were genuinely horrified. The thesis was on Tristram Shandy though so it was pretty fitting.",
            "Interesting TIL today!\n\nThis is a part of Reddit I enjoy is learning something new when I’m on here, compared to Facebook, especially when it comes to asking about other topics of interest! \n\nThanks for sharing!",
            "Brilliant.",
            "the quintessential sans serif",
            "Penis Vagina Baby",
            "I laughed way too long at this",
            "I have not! Im going to check it out as soon as I have a moment.",
            "lol, you should scroll the thread.  Lots of font lovers weighing in!",
            "Indeed.  The sans serif that elevated sans serif beyond the trebuchet and verdana cartoonishness while maintaining readability.",
            "Explains where fonts started, plus it’s a pretty good address."
        ]
    },
    "Seal closing their nose to prevent water entering to their lungs": {
        "title": "Seal closing their nose to prevent water entering to their lungs",
        "score": 285,
        "url": "https://v.redd.it/nlowvyx1p38d1",
        "content": "",
        "num_comments": 15,
        "comments": [
            "I LOVE IT!! IT SO CUTE!",
            "Bro doing a practical demonstration fr is",
            "Thats cool but I dont think they can figure out a way to prevent themselves from entering our hearts!\n\n![gif](giphy|fBITrna5OqS9KeAZab)",
            "Wow so cute.",
            "his nose looks like a seal",
            "Ow shet",
            "I knew it was possible, but I had never seen it before. It's quite impressive",
            "My preferred method of breathing *nostril flare*",
            "Seal sealed his nostrils",
            "Boop the snoot!",
            "Cool that a seal can close it just like a blowhole. \nExactly what a blowhole is in a whale or dolphin except on their case the nose hole has evolved to migrate to point up instead of outward. That’s why you’ll see two “nosehole passages” if you ever get to look down into an open blowhole of a whale or dolphin. Nasal septum ftw.",
            "I do that to my anus!",
            "Nose gape",
            "So this lil baby had seen it's momma stung, pulled up, smoked or grilled and eaten blooded. And now what? Lookin for a new momma? I mean c'mon. That sweet baby is too freaken cute. Dive, dive, dive."
        ]
    },
    "God? Is that you?": {
        "title": "God? Is that you?",
        "score": 2664,
        "url": "https://v.redd.it/4cvquu61208d1",
        "content": "",
        "num_comments": 315,
        "comments": [
            "Notice the liquor store of god's choice",
            "Thats called a waypoint. Once you get there, someone will give you a quest.",
            "Bonus points if a fighter jet came barreling through there",
            "It looks like a giant rat wearing a cape fell through. I don't know how to explain it.",
            "My Oma (grandmother) passed away 12 years ago.  It was a miserable rainy day weather wise. The whole family was there. Everyone taking turns saying goodbye and crying and mourning in their own way. Then, in the afternoon, we were all on the deck, the clouds parted, and one of these crepuscular rays shone through and was right over my Omas' favourite place to spend time. The flower garden. Call it coincidence, call it what you like, but my family all stopped and took in the moment. It was beautiful and brutal all in one.",
            "![gif](giphy|KJYUwoRXeQGxW)",
            "![gif](giphy|xUA7b478QwpKIRnO0w)",
            "God said to hell with this I’m hitting the bottle and getting a shave",
            "Flying squirrel.",
            "Holy Goatse!!",
            "God: No",
            "Either telling you to get a haircut, do your nails, or drink some liquor. Possibly all three.",
            "That's the left eye of Osiris, Horace is on leave.",
            "If you look closely, you'll see some cows being beamed up.",
            "Yeah. God stopped by to get his nails done, and go to Panera Bread.",
            "on this day, God doth smileth upon thy Castle Nail Spa",
            "That's where Loki attacks from.",
            "Yes that’s god over a strip mall.  It’s like the weeping statue of Mary that ended up being a leaky toilet run off😀",
            "That's probably how some religions started...!",
            "Jesus can turn water into wine but God prefers bourbon.",
            "*Monty Python has entered the chat*",
            "Feels like the monty python catholic god head is about to pop out",
            "Who's that pokemon?",
            "God who?",
            "That’s sunlight, but ok",
            "It’s the Wizard Of Oz",
            "The Lorax is making his exit",
            "No. It’s me son…. 😂😃😂😃",
            "No, it'll be real obvious.",
            "Man those must be really great clips",
            "Look for the orbs!",
            "Arthur! King of the Britains",
            "I think thats france",
            "It would appear so.",
            "Praise the flying squirrel",
            "Peeking in!!",
            "Always in a parking lot.",
            "As a wise man said\" do u think god hids because he is scared of whay he created\"",
            "Very cute!",
            "No it's just the contrast between where the sunlight is blocked by clouds and where it can get through.",
            "WHOS THAT POKEMON",
            "Great Clip",
            "Cat with a cape",
            "Who’s that Pokémon!?",
            "So cool!!",
            "Why is it shaped like a raccoon 🦝",
            "Looks like the shape of a fat cat",
            "photoshop an image of lain into it",
            "That's a pokemon.",
            "It's a racoon!",
            "Looks like a side profile of 2d from Gorrillaz.",
            "someone blessed 🙌",
            "The holy flying squirrel 🐿️",
            "Flying squirrel",
            "Bearcules....",
            "If God doesn't exist, then explain holes in clouds!",
            "No this is Patrick",
            "That looks like my town, based on the stores. I bet half of Texas saw skies like that at one point today.",
            "I see a hamster on its back",
            "![gif](giphy|xUA7b478QwpKIRnO0w)",
            "Thank you God, I’ve been wishing and waiting because of this dummy in office!",
            "All hail Ra",
            "He will pop his head through that hole and give you a quest to find the holy grail.",
            "Gap in the clouds by Yellowdays came to mind",
            "Photoshop sub would probably have a hayday, if they agreed to the new agreement thing.",
            "that looks like a racoon having a good time",
            "It’s called a Mary’s vail in some cultures. Cloud formations but allowing the sun to come through in a spot, it’s very rare but beautiful",
            ">_Great Clips_? \n\nIndeed!",
            "The God of Flying Squirrels, that is.",
            "Tyler Childers Purgatory album cover",
            "god: no! and u need meet with your doctor !!",
            "Yeah, that would have stopped me in my tracks.",
            "Hello Bobby",
            "Damn some huge cat fell directly through that cloud",
            "[removed]",
            "Looking like the cleanup crew from Monsters Inc.",
            "No that’s France!",
            "No! This is PATRICK!",
            "Yes, my son.",
            "You’re floating in space",
            "Whose that Pokémon!?",
            "When I was young I went camping with my grandparents and saw something like this, but I was scared the whole trip because I thought the rapture had happened and I would go back to my parents being gone.",
            "Looks like an outline of a racoon, someone add pedro pedro pedro song to this.",
            "![gif](giphy|VbKLOdvCxBFNZpYvhL)",
            "… It’s me, Margaret.",
            "It should have been over gamestop. God's lost and not blessing the stonk. Patience.",
            "Don't worry God, I am doing my drinking tomorrow for karaoke, I get it!",
            "Arthur you must go to the dagobah system",
            "the sun god Ra??",
            "Holly shit, thats tottally a portal from the game Ratchet and Clank",
            "![gif](giphy|14wm71RSxaYX60)",
            "whats that pokemonnn",
            "Looks like a raccoon.",
            "Why is the sky always so beautiful at strip malls?",
            "Sponge Bob Sk8 boarding , maybe i dropped 20 mi. Ag0",
            "Obviously.  Ever heard the phrase “God watches out for drunks and children.”?\nNotice the rapturous beam of light directly on the liquor store.",
            "No, it's flying squirrel.",
            "Who's that pokemon?",
            "Yes, it’s Me. What do you want now?",
            "And God sent his only son Jesus back down to earth where he could get his long hair cut at the holy Great Clips and stopped looking like a dirty hippie.",
            "Found the hole in the ozone layer.",
            "No God wouldn't get it this fucked up",
            "[removed]",
            "Who? God isn't real",
            "Oh no, he's playing Tetris again.",
            "All glory to our lord Jesus!",
            "Uganda knuckles wearing a cape",
            "The Holy flying squirrel crashed through the skies",
            "secret quest available",
            "“Ah the beauty of the natural world… behold, as surely only god could have made th- GREAT CLIPS",
            "PokeGod",
            "Satan goes back to heaven to reconcile but gets tossed out again!!!",
            "I see. Get nails done and get liquor at that liquor store. Got it!",
            "‘Stop grovelling’",
            "No, it's me, Patrick",
            "Heaven's pu... no, no, no, wait...",
            "Not \"God\" just science. Pretty video for sure",
            "God: Hello...is it me your looking for?",
            "Looks like the sun to me.",
            "No. \n\nIt's sun.",
            "Who’s that Pokémon???",
            "Everyone knows its Mr.Bean",
            "r/france ? r/Deutschland",
            "Nah, He's too busy making burnt toast in the shape of Jesus!",
            "any one else see fynn the human?",
            "like Sunday morning, when I’m trying to sleep a bit longer",
            "Who’s That Pokemon?",
            "I had a vision and saw Jesus and had an epiphany, \"stop sending money to Ukraine\"",
            "It's a massive animal that fell through the clouds, leaving a distinct hole. Think Looney Tunes.",
            "No im taking vocation",
            "[removed]",
            "Joke all you want, but he’s getting pissed. And if he’s going to the liquor store y’all be sorry later",
            "Can you see the light…”what light”",
            "He really let it rip huh",
            "Clearly that's a message, time for a Texas Mickey",
            "Was down for a snack🤣",
            "https://youtu.be/QUoasAIlgx8?si=BPAP8S-p4WuXNug6",
            "[removed]",
            "It's Mother Nature...",
            "It’s like we are god’s dwindling bank account that he’s been afraid to check all this time. This is him biting the bullet and finally taking a peek at how it’s looking down here. His heart sinks..",
            "God - \"No\".",
            "Helios: Yes.",
            "God punched a hole in the drywall",
            "America only hates! You are more likely to find the devil!  Hos checking that it's still a 💩hole\n\n![gif](giphy|R9cQo06nQBpRe)",
            "Looks like a raccoon flying",
            "![gif](giphy|za5AgU9vSnz1K)",
            "He likes spas and alcohol",
            "Its heavens glory hole! Its metioned in ecclesiastes 56 1-20",
            "Just some nicely arranged Dihydrogenmonoxid molecules and some photons and the human brain comes up with some agency or deity. We're clearly a bunch of primitive primates.",
            "Nah just castle NAIL SPA but pretty darn close nevertheless",
            "I am the flying raccoon god.",
            "Nah, just the leftover residual chemicals from chem trails. Happens cause light is refracting in the chemicals and give it a glowing sensation",
            "Bro really wanted some liquor, huh.",
            "France?",
            "![gif](giphy|E94KeSxBUy7W646WbI)",
            "No, it's Thor",
            "Looks like hole in the matrix.",
            "Reminds me of the vectored meme haha",
            "That’s Mr. Bean",
            "God is a chunk with a honker",
            "Goatsy lives",
            "God’s goin’ to da liquor store",
            "*mindfuck intensifies*",
            "Needed to pick up some more wine.",
            "Mnah,,,He’s busy fuckin’ up my life….",
            "No that’s the sun",
            "It's a bit shaped like France. You're doomed",
            "That kinda looks like the map of The Holy Roman empire ✝️",
            "No, that's clouds and the sun.\nYes, I am fun at parties.",
            "God is dead",
            "Which one?",
            "No, this is marketing department.",
            "Looks almost fake lol cool",
            "God? lol, the plague one? The flood one? The blood thirsty one? Surely it's just nature!",
            "This is God! No my son it’s just gas.",
            "Shining favor on twin liquors",
            "its his butthole",
            "It's amazing the form of the cloud break!",
            "Someone please edit Peter Griffin peaking through the clouds at the end.",
            "Ditto is that you",
            "No it's sunlight and it shines for all... It's not a personal message to you.",
            "No, its just physics",
            "Simba.... Remember who you are.",
            "Blessings upon the twin lickers.",
            "Godse",
            "God is telling you that you need a haircut, your nails done, and some booze.",
            "Looks likes pedo bear 😂",
            "it's like someone yeeted Pikachu into the sky",
            "Amen!",
            "Glitch in a matrix?",
            "He's finishing the job and turning the remaining water in the liquor store to wine 🍷",
            "I believe that's Pedo-Bear.",
            "YES. STOP PLAYING WITH YOURSELF!!",
            "Nope, just sunlight people. Move along.",
            "Tf is this bullshit post??? It’s a fucking hole in a cloud. Fucking bullshit garbage posting.",
            "No. Thats the sun. You know... our star",
            "No, it's the sun.",
            "God's glory hole",
            "Clown\n\n![gif](giphy|knWj8IasyCf3q)",
            "Your mama was parachute jumping again",
            "Nah sorry I farted super hard and it broke the clouds",
            "Looks like a bear",
            "Twin Liquors. Must be Texas.",
            "No, its a giant spaghetti monster!",
            "Yes. Shining her light on Twin Liquors. ✋🏼🤚🏼\nIt is a beautiful sight. 🫠",
            "Gods gaping ass hole",
            "I've known ppl that would get on their knees and pray crying of they saw that.",
            "We are the gods!",
            "\"The clouds will part, and the sky cracks open, and God himself will reach his fucking arm through, just to to push you down. Just to hold you down.\"",
            "It looks like racoon falls from sky.",
            "Pretty sure that's a trash panda. The savior has been chosen.",
            "Nope. Thats the sun",
            "looks like bear coming down to buy booze.",
            "Looks like the sun!  And it's shining!  Through clouds!",
            "Looks like god needs a little drinky drinky break",
            "Nope.  Just the universe.",
            "Im your god now",
            "I always knew God was a hamtaro fan",
            "Mr. Bean is on his way.....",
            "Bruh that's a racoon",
            "That's the sun",
            "When your not sure if you should stop for beer and ask for a sign..",
            "God's clearly begging you to get wasted lol",
            "“Yes. QUIT JACKING OFF!”",
            "Those are clouds.",
            "Is that a cat?",
            "Godzilla maybe!",
            "\"No\"",
            "Nope",
            "I could be wrong, but it looks like a hole in the clouds to me",
            "WHO'S THAT POKÉMON??",
            "Sorry everyone. There is no god.",
            "That's his gaping hole. Daddy's horny",
            "It's official, God is a cat.",
            "Some alcoholic was waiting for a sign…",
            "No. I’m not real.",
            "nope, just God’s cat on the curtains again.",
            "Another shepard’s fiance gets screwed",
            "God is giving one specific guy skincancer.",
            "He wants you do drink and your nails did.",
            "I think it is Science.",
            "Really amazing how nature shows God",
            "As if god would ever shine on the states.",
            "\nWe cant proof Non-Existence\nBut we also Cant proof that he is real.\nTake from that what you will",
            "he is among us all the time in the late afternoon, in the first ray of sunlight in the morning, in that cold and calm breeze after strong storms, in the smiles of good-hearted people and especially when you remember that he is a father who came for us to free us from the wickedness and sin of the world",
            "Need to patch that hole",
            "\"No, that's just the sun, my son.\"",
            "This is for the person who is depressed, lost his job, lost his family, and is drinking his problems away, god is blessing him with the holy wine to forget his troubles",
            "r/mildlyinfuriating why take a video of something you could've just taken a picture of",
            "They should change the name to Holy Spirits",
            "I've been sober for 7 years, but if God wants me to do this...",
            "Idk ‘Castle Nail Spa’ is more centred….",
            "Makes sense. His son Jesus did use divine power to save a wedding party by turning water into wine.\n\n![gif](giphy|J9kHxs8387mDEFlnmr|downsized)",
            "What does god drink?",
            "Two choices. Spa day or day drinking",
            "\"I've been sober for 9 years, but then!.. Thankfully, god intervened and now I am all good, doc\" 👌",
            "\"and the clouds will part and the sky cracks open and god himself will reach his fucking arms through, just to hold you down, just to push you down\"",
            "Twin Liquors is pretty good. Seen a Bunghole Liquors before, various Street Liquors too, those are both gross. I live near a town called Athol and the liquor store there is called Athol Spirits. Seriously missed opportunity there.",
            "Thought it was spa….",
            "They turn water into tequila",
            "And Spa",
            "Nail spa then bar... Perfect combo!",
            "Looks like God wants me to get tuned up and get my nails did. Never had a drunken mani-pedi, but who am I to question divine authority?",
            "Yes it is I my son, at Twin Liquors.",
            "The true Elixir Of The Gods... JACK DANIELS",
            "like fishing?",
            "Grand prize if that happens while someone pulls into the parking lot blasting \"Danger Zone\"",
            "Flying squirrel! Which I guess is really just a rat with a cape…",
            "I was thinking raccoon but we’re on the same page",
            "[deleted]",
            "Mighty Mouse is bigger than I thought",
            "I thought rocket raccoon got blasted through the clouds.",
            "Nah, you explained it right. It's exactly what I saw.",
            "The wonders of nature.",
            "I believe what you’re thinking of is a flying squirrel",
            "I thought that was how everyone envisaged God?",
            "Who says God is not a giant rat wearinga cape? The idea that God is an old man with long beard and white robe is just funny to me. I think Dogma got it right. \n\n\nhttps://youtu.be/yz9RSk7SAvI?si=YvgKt2NB2puOP42G",
            "That's a beautiful memory. Rest in peace oma.",
            "I used to call my German grandma Oma as well. \n\nThat's a beautiful story, though. Thanks for sharing.",
            "First image I had when I saw the OP picture. Monty Python really got into our heads and that's a good thing.",
            "Literally this",
            "Course it’s a good idea!",
            "I knew I was not crazy",
            "I see Snorlax from Pokémon lmfao",
            "(Cracks open hot beer and takes a sip)\n\nYea, I remember my first goatse…",
            "Make it a family day",
            "Helios",
            "I was going to say I genuinely can't tell if OP is serious about the God thing or not. I don't think so based on their other comment on this, but in case they are I would like to point out thats a sunbeam and they are common.",
            "\"I'm no loon\"",
            "Your comment has been automatically removed.     \nAs mentioned in our [subreddit rules](https://www.reddit.com/r/BeAmazed/wiki/index/#wiki_r.2Fbeamazed_additional_rules), your account needs to be at least 24 hours old before it can make comments in this subreddit.  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BeAmazed) if you have any questions or concerns.*",
            "Your comment has been automatically removed.     \nAs mentioned in our [subreddit rules](https://www.reddit.com/r/BeAmazed/wiki/index/#wiki_r.2Fbeamazed_additional_rules), your account needs to be at least 24 hours old before it can make comments in this subreddit.  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BeAmazed) if you have any questions or concerns.*",
            "Your comment has been automatically removed.     \nAs mentioned in our [subreddit rules](https://www.reddit.com/r/BeAmazed/wiki/index/#wiki_r.2Fbeamazed_additional_rules), your account needs to be at least 24 hours old before it can make comments in this subreddit.  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BeAmazed) if you have any questions or concerns.*",
            "Your comment has been automatically removed.     \nAs mentioned in our [subreddit rules](https://www.reddit.com/r/BeAmazed/wiki/index/#wiki_r.2Fbeamazed_additional_rules), your account needs to be at least 24 hours old before it can make comments in this subreddit.  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BeAmazed) if you have any questions or concerns.*",
            "How? And which god are you referring to? Literally every human culture that exists and ever did exist has had a creation myth... which one do you think is somehow true considering that inventing creation myths is clearly an utterly fundamental part of human nature?",
            "Indeed",
            "Well let me know when he finishes freeing us from wickedness and sin because it seems to running rampant.",
            "Amen ❤️❤️",
            "Showing you how to turn money into wine",
            "In nomine Patris et Filii et Spiritus Sancti",
            "Best comment ever....",
            "This deserve a reward!!",
            "Bang on",
            "Oh my god. Literally.",
            "This comment is why I Reddit. 😝",
            "Way to the Heaven.",
            "![gif](giphy|oGAM2NfiX50ac|downsized)",
            "Sorry, but it’s clear he actually wants you to go to Great Clips. Let it begin with me…",
            "Are people from there called Atholes?",
            "Drinking mini game",
            "That’s nice what location at ?",
            "It's 5 a.m., and I laughed so hard I woke up half my household.",
            "Dare I say, bless you, Reddit friend",
            "Good idea oh lord!\n\nOf course it's a good idea!",
            "Well shit.  I'm sober AND bald.  I guess I just gotta piss God off.",
            "It's in MA so, yeah probably."
        ]
    }
}