{
    "Episode 376 Spoilers [Megathread]": {
        "title": "Episode 376 Spoilers [Megathread]",
        "score": 745,
        "url": "https://www.reddit.com/r/Berserk/comments/1ccuqsv/episode_376_spoilers_megathread/",
        "content": "Please post all discussions and your reactions to the latest Berserk release here in this thread. As usual, links to scans of any kind are not allowed and will be removed systematically.\n\n**RELEASE DATE**: Friday April 26\n\n* Physical: [Amazon.JP](https://www.amazon.co.jp/%E3%83%A4%E3%83%B3%E3%82%B0%E3%82%A2%E3%83%8B%E3%83%9E%E3%83%AB-910%E5%8F%B7/dp/B00JV42NSI), [CDJapan](https://www.cdjapan.co.jp/product/NEOBK-2968267)\n\n* Digital: [Hakusensha-E](https://www.hakusensha-e.net/store/product/2830XXXXyanimal02409)\n\n[Guide on how to purchase an issue of Young Animal digitally](https://www.reddit.com/r/Berserk/wiki/younganimal)\n\n**NEXT RELEASE**: N/A\n\n**PREVIOUS MEGATHREADS**:\n\n* [370](https://www.reddit.com/r/Berserk/comments/y1a2cz/episode_370_discussion_megathread/)\n* [371](https://www.reddit.com/r/Berserk/comments/zf6lai/episode_371_spoilers_megathread/)\n* [372](https://www.reddit.com/r/Berserk/comments/12zrj3z/episode_372_spoilers_megathread/)\n* [373](https://www.reddit.com/r/Berserk/comments/13rlp4i/episode_373_spoilers_megathread/)\n* [374](https://www.reddit.com/r/Berserk/comments/16oi9qf/episode_374_spoilers_megathread/)\n* [375](https://www.reddit.com/r/Berserk/comments/17rfg73/episode_375_spoilers_megathread/)",
        "num_comments": 651,
        "comments": [
            "We about to head back to war, boys and girls.",
            "I literally cheered when they completely skipped the boat ride lmao",
            "Is it just me, or has the art in the past two chapters been way better than before? 365-374 looked decent, but characters would sometimes look a bit wonky and everything also just looked very grey. 375 and 376 look really good in my opinion, and honestly don’t look much worse than Miura’s art (obviously Miura’s was better, but it almost certainly never will be as good as his). If Studio Gaga can keep up with this quality, I’ll be very happy.",
            "RIP to all the strugglers who didn't make it to see this moment. \n\nIt really feels like we're approaching the end game and the team is doing an absolutely fantastic job! The art is absolutely fantastic and it seems like the team has really come into their own style while maintaining Miura's. Not only that but we skipped the boat ride!\n\nI'm really curious to see how this war progresses. It's a bit curious to me that the Kushan have Guts chained up for now when the rest of the crew is being recruited to fight. I get their logic but I can't wait to see Guts and the Kushans bring the fight to Griffith.",
            "Finally the new chapter has come! While it's a short chapter, the pace is fast, they skip another boat arc, 😂😂😂. I hope it doesn't take another 6 months for the next chapter to release. Young Animals really need to fix their schedule, because Studio Gaga was already finished this chapter months ago.",
            "The pacing is pretty good for such a short chapter, alot has been answered and more questions have arisen in the same breath. Excited for the new chapter whenever that drops.",
            "Congratulations to studio Gaga and Mori, i love how they are able to capture the essence of Berserk.\n\nAltough a short chapter im glad the story is moving with a good pace, i wonder how they plan to wage war…",
            "I don't see how the Kushans could possibly fight Griffith. We in trouble.",
            "This reminds me of the Battle of Minas Tirith. Under normal circumstances, there will be no victory... In the end, I hope, win or lose, Guts takes one or more steps forward. I don't want to see another one-sided war with that fucking Griffith smirk!",
            "This chapter, while many definitely foresaw the story heading to this point, did more to move the story of Berserk than the past 2 years. Well done studio Gaga and Mori",
            "I guess for now the story progresses in an expected manner for the foreseeable future.",
            "Mommy Morda is back baby",
            "Final war arc coming soon!",
            "So they are headed for the final fight? It seems too soon for them to fight Griffith. For sure Guts needs some kind of power up... but maybe the moonlight boy is going to be a problem for Griffith soon enough",
            "What i don't really understand is how Puck doesn't remember Rickert. I remember when they arrived on Elfheim he remembered his other elf friends and other people even though he was away for a long time. Maybe he doesn't want to discuss heavy things near Isidro or the group.",
            "The building they're in is based on the Hagia Sophia in Instanbul/Constantinople! It was the largest church in the world for 1000 years and then it was converted into a Mosque when the Turks conquered the city. Had the pleasure to be there in person! So cool they incorporated it into Berserk!",
            "Art was amazing ong",
            ">!I liked this chapter. The art definitely looks better than the previous chapters. I like how at the start of the chapter we see Schierke waking Guts up, so now Guts is finally awake. The scene where Schierke woke Guts up also reminded me a lot of the great roar of the astral world. I do like the stuff that was shown in the chapter. I predicted that the Kushans were going to go to war with Griffith, and now it’s become true. I’m excited to see what’s going to happen in the next chapters, especially with Daiba taking everyone underneath his wing. I hope we get to see Daiba talk to Guts about the Kshatriya Of Durga soon. Also it’s good to see that Hanarr is still here. If the theories about Guts learning to control the Berserker Armor comes true, then Hanarr will have a big role to play in it.!<",
            "The art is impressive and this chapter, with all the due respect, is even better than some of the latest Miura ones.\nThey also skipped the boat trip, added lots of dialogues and improved on everything. We cant ask for more.\nThe ONLY thing I dont like is how fast they skip over important things, like Rickert meeting Puck and than letting it go without an answer.\nOr, after everything we have seen from Guts falling into desperation, the way he wakes up with the usual Schierke panel touch his hand.",
            "Well, it appears Guts is not lost. Schierke is stepping up. We may be getting a set up for them to find Casca together. \n\n\nI was a little nervous about Guts being a dungeon, but when Salit said he is \"danger to himself\" I got it. \n\n\nBut, we are going to war.  They said the vol 43 will be out this year, so we might be seeing four more chapters, at min before 2024 ends. ",
            "Have any of the usual twitter leakers said anything about when 377 is coming out? There's nothing in the last page. I sure hope it's not a six months wait...",
            "Cool seeing decade old predictions coming to fruition. I remember thinking I can't wait to see Daiba and Guts fight on the same team. Berserk needs more powerful mages that aren't afraid to get their hands dirty.",
            "Good episode, the story is finally starting to progress. Hope we don’t have to wait another 6 months for the next one tho",
            "To me it seems like the Kushans are going to completely screw things over for themselves if they stick to their current plan. Not only are they supressing their most valuable assets but because they're treating them like rank-in-file members, they won't know how to fully and effectively utilise them",
            "I wonder what Silat is plotting, if he is trying to take on the griffith head on",
            "Nice plot speedrun, welp see you guys in 2025",
            "Just hoping for the war between kushans and Band of the hawk",
            "The art in this ep looks better than it's ever been, they're really stepping it up! Everything else is...more or less about as good as I expected\n\n(I get the feeling people misinterpreted the last part of my comment based on the upvotes I've gotten. I expected this chapter to be subpar at best in terms of everything but art)",
            "They finally got the courage to write real dialogue.\n\nWhen they first took over it seemed like they were too scared of the task to actually write dialogue.\n\nI think the art looked great + the dialogue felt right.\n\nGlad they found their groove.",
            "can’t believe guts is still sad and they join forces with the Dank Kush squad",
            "The panel of Schierke holding Guts hand is so beautiful \nThe friendship and trust between these two is so pure and underrated, she won't let him fall in the Darkness.\nThe art in this chapter is Amazing, great work by studio gaga and Koji Mori",
            "It feels like we're starting to reach the beginning of the end and I am all for it. A bit concerned about Schierke, but maybe Flora will help her out to navigate through the deeper parts of the astral realm. Afterall I think Flora said that she wouldn't be really dead and it's more of a transition. \n\n\nOr as Vampire Hunger D said, we are but transient guests.",
            "You know when i said \"See you guys in 6 months.\" I ment it as a joke, i didn't actually mean it. I'm sorry.",
            "One interesting thing about the world here is that we assumed for a long time that things must be totally apocalyptic outside of Falconia, because of the Roar of the Astral World, but clearly the Kushan are able to still have a functional society and defend their people from monsters even though they lost their God-Emperor. It puts lie to a big argument for Falconia, that only Griffith can bring safety to society as a whole. It makes me think that Guts getting revenge on Griffith won't necessarily mean society will collapse and that there might be other civilizations out there still surviving",
            "Man Schierke is so goated",
            "hypeee",
            "I hope Schierke's deep dive leads to a chat with Flora about the causality spiral of her past that the current party is living through",
            "I totally forgot that Miura didn't draw these panels. Was a great chapter, I'm glad we are finally making real progress in the story. RIP. Studio Gaga is doing an amazing job.",
            "Man the chapter was great, Im excite for where it will all go to. I really wish Miura himself was still here to finish up his story... mad props to studio Gaga for doing this still.\n\nWith that said I gotta ask.... am I the only one who REALLY does not trust Daiba? Silat seems like a decent guy, hes leader of an opressed group or people back in his own land... but Daiba was the right hand man and advisor to the very leader of that land, I feel like right now hes working an \"enemy of my enemy\" mentality, but I dont really find him a trustworthy ally in the slightest.",
            "So Griffith destroyed Elfhelm because he was wary of it, he is going after Kushan next for the same reasons, but Kushan is fighting back and joining forces with Guts and co.\n\nThe way things stand now it will most likely be imo:\n\n  -  The Kushan empire\n\n  - Elfhelm (all remaining mages and creatures) unter Daiba's lead\n\n  -  The Skull Knight\n\n\n  -  Guts and friends (among them Farnese who could move the Holy Iron Chain Knights to join)\n\nAgainst Griffith and his Demons. Probably with some kind of upgrade for Guts.\n\n  Zodd, who appears to be unhappy in Falconia, is pretty much the wildcard who could decide the battle.",
            "The art in this chapter has reached Berserk level art. Congratulations to the artists for getting at this level so soon. Their work ethic is obvious with the release of this chapter. I can't wait for the future of Berserk, It's in good hands. Thank you studio Gaga, this chapter was a masterpiece both art and dialogue wise",
            "[removed]",
            "They are really letting go of chestnut puck, when Miura had puck just floating around he was always chestnut form, but not anymore",
            "We're confirmed to be getting volume 43 this year in Japan by the way, so they'll probably 'speed up' with chapter releases for the rest of the year.. But that isn't really saying much.",
            "So Silat has taken charge of the Kushan Empire then......\n\nI get his reasoning for why they need to attack Griffith, but I don't see how they can win. Mages or no mages.",
            "One thing that irks me. Did the plot point about going to the Bakiraka Hidden Village get dropped or did they change it to going to the Kushan capital after Daiba joined Rickert's party? Like If Rickert and Silat and all were sailing there it'd make sense but it seems they're just in Kushan's capital now.",
            "Seeing Guts chained up 😞",
            "So, what's wrong with Puck? Why can't he remember Godo and Rickert? Not sure if I'm thinking too much into it, but felt a bit like they were trying to set something up here with him being sus. Would be weird if he's just stupid",
            "Considering what happened to Ganishka i hope the Kushan army has some real strategy to defend it’s borders against Griffith.\n\nOr maybe they’re just going to scream “death”  Rohirrim style and charge at their enemies.",
            "This chapter was, simply put: amazing. \n\nAlso: [Mordussy](https://ibb.co/CpjCzWd), so that's a plus.",
            "This must be Studio Gaga's best chapter yet. Atleast artisticly speaking.",
            "Rickert's interaction with Puck has been weird as hell. I don't get why they wouldn't recognize each other, especially after the important heart-to-heart talk they had in Godot's place. Why's Puck ignoring him? I hope he doesn't act that way towards Erica too.\n\nBut aside from that, I'm glad that we're finally getting some exposure to the Kushan rebellion and their intent to go after Falconia.",
            "I’m glad they decided to show some non chestnut puck! I want to see him talk with Guts again",
            "The new chapter was worth the wait, I love the art style and seeing the gang with Rickert.\n\n  \n>!I hope Schierke will live to the end of the story, with her ability to be within the astral realm I know Griffith will target her. I am thankful she helped Guts once more to gain consciousness.!< I'm curious since the Kushan are prepping for war against Griffith will the story switch over to Casca in Falconia now.",
            "I want to see kushan magic and witchcraft imbued on guts sword. Hoping to one day see that shocked griffith face",
            "A lot of people are talking about how Kushans are not playing their cards right in terms of planning, but i think 99% apostles can be handled by the magic squad under Daiba. I'm pretty sure Rickert has maybe figured out how he was able to harm Griffith, or they have an idea. \n\nOther than that, I'm pretty sure we will see Farnese strengthen her magic prowess to wake Schierke up. I love the pacing, now we wait.",
            "[removed]",
            "One thing I found odd was that Silat also doesn't recall Guts' name. When in chapter 43 he says, \"Guts was it? I'll remember your name.\" \n\nHe recognizes him again when Guts kills the Kushan in chapter 134 and says that he knew him at one point. Perhaps it's Silat being coy or something, but I found that a little strange.",
            "anyone realize the castle they are in is like a exact replica of the hagia sophia?",
            "What does Silat have that Ganishka did not? Rickert's inventions and a few mages? I feel like Griffith will win this battle, but lose the war, if there is still a happy ending. \n\nGreat episode, can't wait to see Rickert and Guts back together.",
            "I am SO stoked on Daiba being back, he was a favorite. \n\nI'm wondering how Guts will take being used as a pawn again for someone else's cause, even though that cause may be the same as his own.",
            "Good chapter. Interesting stuff with the Kushans planning to take the heroes in and declaring war on Griffith, although I'm not sure how a war between the Kushans and Griffith is going to be anything other than a massacre.",
            "Our first real glimpse of what the end is going to look like. What a phenomenal chapter. The birth of a new story arc for the first time in about 15 years since Elf Island and Fantasia began. I genuinely feel like crying when I think about everything it's taken to get to this point, especially about Miura. It makes me so happy that I'll likely get to see the end of this story someday,",
            "So glad Puck isn´t chestnut anymore",
            "As a vedic astrologer, the way that Miura brought up Rahu and the nodes, I have a weird feeling that this story is going to end on a Lunar eclipse.  I found it amazing that he used Rahu as the node that the Eclipse took place under instead of Ketu. You can tell that Miura in the manga from that note that he is well versed in Vedic Astrology.  A Solar Eclipse would symbolize the void, singularity, absolute, inhuman, etc.  A Lunar Eclipse would signfy blood(known as a blood moon), humanity, duality, freewill, etc.  I expect downvotes for this, but you only live once :D.",
            "I am pretty sure that the much needed upgrade to face the God Hand will be delivered by Daiba and his deep understanding of the metaphysics and dark arts. \n\nWas really happy to see this old lad again.",
            "Solid pacing, Beautiful Art and healthy flow. Always grateful for the Berserk chapter!",
            "Hey it's my birthday today and I got a new chapter of berserk for it thanks big man miura in the sky <3",
            "Real tear jerker chapter. The art is AMAZING! Studio Gaga just continues to impress with better and better art. I feel like the writing and the dialogue has improved a lot too, there's just enough talking and it feels very Berserk. I love it SO much. \n\nCan't tell if Puck is ignoring Rickert because Puck or if him surviving the fall of Elfhelm was somehow a fluke and he's about to start going thru it. Really not ready for the \"Fan favorite silly elf gets dementia and slowly dies scared and alone\" arc so lets hope and pray Puck is just doing silly Puck things.",
            "the kushaan being portrayed in a slightly better light is very interesting, maybe they have more understanding of griffith or the god hand",
            "How will a shitty chain hold a guy who can swing a 400 pounds sword? I know Guts is depressed and won't try escaping, but still a non-sensical move by Kushan. Giving him a cozy bed is probably a better idea.",
            "[removed]",
            "I feel like an eclipse situation could happen. Cascas gone again but regained concisousness, and going to war with Griffith could result in several deaths.\n\nAnd who knows how long schierke will be asleep.",
            "Pretty good the art is fantastic in this chapter i’m excited for 377 so hopefully it comes out this year",
            "Sounds like a free ride to Falconia!",
            "Wait so the Kushans know about elfheim?",
            "It’s going to be ragnarok type of deal. Guts will be their general leading the war",
            "To war then",
            "Any whispers of a new issue?",
            "[removed]",
            "Holy Mother Fucking Shit, the Blacksmith that made the Berserker Armor is with gut's party.  let's fucking go, upgrades!",
            "That's a nice little touch to make Silat's eyeliner and Griffith's helmet visor holes the same shape.",
            "Goddamn the art has gotten a major glow up. The hard outline style is back, Gaga has gotten far more comfortable with Muira's style.",
            "Man, the catharsis of absolutely inhaling another chapter after a long wait is like the rush you get from finally beating a boss in a FromSoft game",
            "Short chapter but I like where it's going. Guts it's finally out of the Berserker armor, which will probably help him a lot. The gang seems to be in no danger for the moment. I think chestnut puck should be the one to forget Rickert being more of a comical moment. And I cannot express how much I can't wait for Isidro to finally learn that Guts was in the band of the Hawk and the 100 men slayer. I don't think that we should mention the art anymore, but for the record it's great!",
            "The art is fucking perfect",
            "Solid chapter. \n\nThis is the first Mori chapter that feels like proper Berserk, it advances the story forward without much flash but only with dialoge. After many chapters that felt rudderless, this one shows a clear path. Worth the wait.",
            "[removed]",
            "[removed]",
            "The Republic Alliance of Berserk",
            "Shit got me hyped, WAR IS UPON US",
            "A big hope I have for the next few chapters especially with Guts awake that he and Puck will talk and we can see more of them interact.",
            "The art is AMAZING",
            "Man I already lost track of the story .\\_.",
            "If 8 head doesn't die in this war its not gonna be worth it",
            "Honestly was impressed by how the art looked this chapter. The dialogue stayed true to the characters as well, and finally the story is moving forward. 8/10 overall, Mori and the team are improving, love to see it.",
            "at least we're out of boat arc",
            "I've been waiting for all the warriors to come team up together and kick Griffith's ass alrwady for the longest time, so I thoroughly enjoyed this chapter. I'm only getting more and more hype with each new Berserk chapter because it really feels like we're reaching the beginning of the final climatic arc for this long story. I have faith that Mori and Studio Gaga will be able to deliver on the conclusion Miura would've given us. I can't wait to see how it ends.",
            "I gotta say I adore the art, they are nailing it rn. The pacing is also great, it really feels appropriate considering where the story is at. I'm confident they'll be able to pull of the (I assume) final arc well, especially considering how well Miura set this all up",
            "Even with the team Guts and Elfheim residents in their ranks, Kushan is a clear underdog I can't wait to see this battle. My theory is that they will figure out Griffith and Moonlight Boy's conundrum and pull an \"Avatar Solar Eclipse spec ops mission\" where the moon goes on a special phase every 567 years to separate their souls, attacking while Femto is at its weakest.",
            "I hope for the best for Guts \n\nIs it wrong to pray he has some peace at the end?",
            "Ngl I thought the manga went back on hiatus for some reason.. the last chapter I read was 370. At least now I get to read a few chapters",
            "A new chapter came out!?",
            "[removed]",
            "those last few words had me like  \\*Hundred Year War INTESFIES\\*",
            "Holy shit we’re getting close, shits getting serious now",
            "this war is gonna be insane i can’t wait!!!!!",
            "Pacing was really good 👌 they seem to understand that its time to approach the endgame.",
            "I liked this chapter a lot, the stakes are raising, a war is brewing.\n\nI suspect (and this is entirely my theory, and I'm not saying it's bad) this is because Studio Gaga and Mori don't really have much detail on the ending of Berserk other than general stuff such as \"there will be a war\", so after wrapping the last arc they're not entertaining no nonsense and jumped into the first steps of a war between the Kushan as proxy for the mc group and Falconia.\n\nI feel that Studio Gaga is finally being more confident with drawing, previous chapters had been criticized because some of the characters looked like Miura's design and composition but a bit weird, in this chapter I don't see that, they've certainly improved in a lot of areas and I also see certain shy redesigns instead, I guess Gaga is finally appropiating Berserk instead of trying to emulate someone else's artstyle (no matter how used to aiding in that style they were, and it's not like Gaga's artstyle is that different from Miura's, they were his trainees at the end of the day). I'm loving that a lot.\n\nI also like the Kushans are going to apparently be allies (even if temporal/until the main characters can escape) after being portrayed consistently as monstruous and brutal.",
            "Really solid chapter, character art is looking really really good. Backgrounds still feel a little washed out at times but this was another great step in the right direction.",
            "Wow! I was really sceptical towards Gaga cuz they managed to copy Miura style mostly but not perfectly. But this is majestic! It seems they really grasped Miura style. I hope it will continue like this from now on.",
            "I’m so hype guys. Final arc incoming",
            "I liked this chapter, it has great dialogue with enough information, the art work is getting a look better with some very good panels and Guts looks better, so is a W for me.\n\nI only wish they could deliver the chapter more often, but it is what it is.",
            "What a wonderful chapter, the series is going to end soon, so happy to see Miura’s work being continued.",
            "I might be wrong and it's gonna be wild, but after this chapter I see things very straightforward now. \n\nKushan Empire vs Falconia = Falconia wins. New eclipse using Gut's beherit and here Casca or Guts will become a God Hand. It will be God Casca/Guts vs God Griffith, and Griffith will die for good, ending Fantasia and returning the worlds/dimensions to its places. Demons will be gone, the fairies will be back.\n\nLE END.\n\nDumb theories apart, I'm sure I'll regret not seeing far more about the God Hands. Feels like they could have their own standalone stories.",
            "goated chapter. Studio gaga and Mori are doing a phenomenal job. all that talk about “berserk should’ve ended at chapter 364 ☝️🤓” go fuck urself. this manga lives on",
            "So overall the chapter imo was a solid 7/10\n\n\nSome positives-\n\n\nGreat Art(I love the art with this one, puck, rickert ,silat, schierke and the initial astral layer scene with guts and schierke\n\n\nPacing. They are not wasting time and addressing plot points which is good to see story progress considering the long 5-6 month.\n\n\nNegatives-\n\n\nThey definitely aren't trying to weave the story properly. \nExcessive use of plot conveniences like the ship getting drifted away, and how did guts end up in astral realm?Simple answer- We don't know and I don't think they are going to address a lot of points too.\n\n\nStupid character reactions. Weird it had the best artwork so far yet had very odd facial features. When silat announces war...the faces of serpico and farnese like it feels so weird.\n\n\nA nitpick but i just dont like the village of kushan is very \"indian enough\".\n\n\nThe entire thing with rickert and puck. what's up with isidro too? He was initally heartbroken and now he feels like he is going to fight in a war,pissed off from everything. Puck forgetting rickert? Like yeah Miura didn't use puck to fullest since Lost children but let's be honest Puck forgetting about rickert is really stupid.\n\n\nI am still hyped up with Guts and dragonslayer reunion but I want more CASCA scenes!!!",
            "So proud of what they’re doing with berserk, it feels so authentic to what miura had written and hopefully the manga can have the ending it deserves",
            "[removed]",
            "They are drawing much better, especially the city and Serpico(he was awful in the old Gaga chapter). The story is going where i thought it was going and it's nice that they're talking to each other",
            "it was so worth the wait!,  the art its absolutely incredible, and this is most noticeable in the desing of guts, which at the beginning of the \"mori-gaga era\" was so sketchy but now is so good. Im so ready for this war, i hope this is not the end tho, i remember miura saying that there are going to be multiple battles between guts and giffith in the future, so i hope this was taken into consideration by mori. \n\nFinally, I HATE GRIFFITH.",
            "Berserk never lets you down! It was a long wait, but it was a very rich chapter both in terms of drawings and content, I didn't expect the Kushan to be marching again against Griffith, I thought they might be building up defenses waiting for the Falconian army to attack, now I'm really curious to see what the current state of their army is.",
            "This has got to be the best chapter Koji and co. have released so far! Dialog is on point, the art is awesome, and the content of the chapter is meaty. Great stuff! Looking forward to the next chapter.",
            "That interaction between Rickert and Puck was so stupid, it would be better to not have even bothered with it.",
            "that last line was pretty hype ngl",
            "I’m glad Puck is actually being drawn again",
            "The art is amazing. Totally worth the wait. Now time to go back to sleep for another half a year but I'm very happy with this chapter and how the story is being set up. Seeing Rickert again is so good.",
            "Not seeing a lot of people talk about this but I find it sad how they have based the Kushan City off of Constantinople whereas before they have always looked based on Indian and Central Asian cultures. Ganishka's palace and throne room looked gorgeous and were both based on some Indian styles uncommon to see in fantasy but now the city is just shown as regular oriental architectures like you would see in any other 'regular' fantasy.\n\nI am also not sure about what they are doing with Puck, his with interaction Rickert just seemed... strange?",
            "Why did Silat need to double-take when saying Guts' name? Didn't he literally say in Golden Age 'I'll remember that name'? Pretty shitty memory",
            "Damn what a setup. Hanging threads, characters that haven't met, it's all coming together.",
            "The art is really good, I'm glad",
            "We are approaching the end game. I'm guessing Guts is gonna get some kinda Zenkai boost and just sweep out the God hand like mowing a lawn. It's the only way to address all these major opponents in a timely manner.\n\nI'm still betting on an individuation process with the beast of darkness and getting a power up to the berserker armor. Then the power of friendship from his DND crew pulling him out of his slump.",
            "I'm glad the kushans are the good guy's war is about to happen.",
            "That looked like Hagia Sophia in Constantinople shores",
            "mixed feelings on this one, diolouge is defeinitly improved as well as the art but the story still feels a bit contrived/things are happening a bit too fast (this has been a commen issue for the continuation) still a decent chapter and I like the major plot points I just wish they were fleshed out better (maybe a fanfic writer could do that once the continuation is complete)",
            "[removed]",
            "[removed]",
            "Goddammit another hiatus",
            "About time they dropped a chapter.",
            "Oh god we’re going have to fight Griffith",
            "THERED A NEW CHAPTER ??",
            "To war!",
            "Got to say, as an Indian it is weird seeing stuff like 'Kshatriya of Durga' in a Manga. \n\nA short chapter, but one that moves the story forward. Can't wait for the next one.",
            "WHERE TO REAAAAAD?!?",
            "We're off the boat(for now🤞)",
            "Does anyone know, when the next chapter comes out?",
            "So Shierke woke up Guts... But it seems she's now stuck in the astral realm? I wonder where she's gone. Has she gone to see someone else? Something else? Or has she been taken?",
            "[removed]",
            "20 pages is just not enough... Nothing really jaw-dropping and now an hiatus again sigh",
            "I wish every member of the crew gets to help in the final fight in some way, even the less relevant one, appearing in at least one panel. Something like Roderick saving someone's ass by punching an attacker, or Morda helping Guts access a high place by flying, something like that",
            "I'm not sure where I stand with Silat personally... In theory, he ought fo be a rather unlikable character, but I somehow find myself cheering for him all the time.\n\nI wonder where Erica is btw",
            "According to what they makers have said, it's gonna take 10 more years for berserk to complete, vol 43 will be over by the end of this year; and the pacing is good, but we taking Griffith head on now (in a few more chapters)?\n\n\nThis makes me want to rethink the intentions of Daiba and Silat. They've got something unexpected for us.",
            "Great chapter, I like the art. I hope finish is near.",
            "When comes the next release?",
            "WAOW",
            "When Serpico went \"-_-\". I felt that",
            "When will the next chapter will be released ? :D",
            "Miura would be proud, artwork and dialogue was phenomenal this chapter",
            "Makes me laugh how the story expects me to side with Daiba too lmao.",
            "Given how Miura loves to repeat themes and events it's a little disquieting to me that Guts is in prison with his spirit and body broken after having a loved one leave him so suddenly.  Though the circumstances are different it's similar enough to Griffith's story that makes me think that history is about to repeat itself.  Maybe Guts will sacrifice his friends in the next big battle to get back his dream of being with Casca?\n\nAnyways, a great job by Mori and team.  I can't wait to see what's next.",
            "Could anyone possibly tell me (perhaps remind me) what Farnese is holding with her left arm on the 10th page? It’s the page where Rickert learns that Daiba and Guts have squared off before. I don’t remember seeing this figure before and can’t tell what it is from looking closely at it ",
            "I was very pleased with this episode. The art is great (not Miura great), and as far as the plot there was actual sense of time passing. I'm not referring to the skip of the boat to Kushan, but that there were scenes after scenes that felt like in real time would be the span of an hour or so - the episodes of Elfheim felt like they were just the span of minutes with very minimal dialogue. I'm just glad that there is a bit more depth now.",
            "last panels are very hype but also knowing griffith could annihilate them all by just farting in their general direction is not encouraging.",
            "Oh sweet, been looking forward to this",
            "This chapter was refreshingly good, it’s nice knowing the story has hope after all",
            "serious question,who is handling the story right now? is it one person or a bunch of writers?",
            "I loved what studio Gaga did so far but not this chapter I have to say, because it rushes the story waaaay too much. I would have prefered two or three chapters for what it had to say.\n\nMiura didn't hesitate to draw several pages with no dialogue whatsoever, just to show architecture, people, animals, landscapes... It created the sense of a living city. Now it just feeled we teleported right into the castle and the kushan people just don't exist.\n\nWorse, the character of Silat : he says to Roderick \"I have something to discuss\" but in fact he doesn't want to chat, just stating the obvious \"fairy island vanished bla blah\", note that he doesn't even ask a question so what's the point of saying that he has something to \"discuss\" ? Also note that it's not even slightly important to him, if he's in the room, it's only because Daiba requested him to come.\n\nThen, after Daiba claimed Gut's party and convinced Silat to explain the situation to them, Silat says \"follow me\" to explain a few meters later in another random hallway. Therefore why the need to follow him ?\n\nMaybe I didn't understand something... I hope",
            "I'm just going to throw this into the discussion.  Rickert puts on just one glove of the berserker armor.",
            "just me or puck seems strange? like his hiding something or knows something about guts and the berserk armor",
            "When will be next chapter? November??",
            "**I don't believe that Miura planned for Schierke, Isidro, and Rickert to still be children by the time any final \"war\" with Griffith / the Neo-Band Of The Hawk / Falconia happens.**\n\nThink about it.\n\n* Rickert is supposed to become the greatest blacksmith and inventor in the world, and eventually refurbish Guts' sword and armor.\n\n* Isidro is supposed to become a competent warrior.\n\n* Schierke is supposed to become the greatest young magic user in the world.\n\nAnd don't forget that Farnese is still an entry-level mage. She is not ready to \"go to war\" right now.\n\nThey *need* a time skip, probably 8 to 10 years.",
            "Something weird was going on with the font, also why does Serpico always look like he's crying now?",
            "May Durga Ma lead us to victory 🙏\n\nIt's cool as a Hindu to see the references in berserk, but now that Daiba has brought up Guts being a \"Kshatriya of Durga\" twice I wonder if there will be more to it than simple references.",
            "Damn I was hoping everyone would put aside their differences and attempt honest diplomacy. ",
            "[If Miura were still alive, he would have given us an additional 5 years of chapters of boat rides guaranteed](https://youtu.be/EGTgBjm-6gY?t=9723)",
            "How long were we on the boat for this time? 2 chapters right?",
            "yes - felt the same way 😭",
            "It definitely looks like things have improved artwise",
            "Honestly it's not even just character design.\n\nYou can see studio gagas style really fall into their own. It's not dissimilar to mirua but certainly their own in its own right.\n\nMy main gripe was mainly shading which, this chapter they have drastically improved upon. \n\nAnd is it me or did Griffith get hotter which is unreal to me.",
            "Absolutely but especially this chapter was a masterpiece so far",
            "I honestly can't believe how good this chapter looked. Loved it.",
            "I think they hit their stride here. I was impressed by both the character and scenery art. I was always happy that studio gaga decided to continue Berserk, but this was better than expected tbh",
            "I was thinking the same thing. There was only like one Rickert face that I noticed was slightly off, otherwise everything looks pretty amazing.",
            "I was very critical of the drawings in the early chapters, but with this one and the previous one they have really come to a very good level. I would even respectfully say that they are better than some of Miura's chapters when he was still transitioning to digital drawing.",
            "Only thing that throws me off is Puck is never a chestnut 🌰 anymore. I prefer normal Puck but Miura pretty much stopped drawing him like that for a long time.",
            "[deleted]",
            "Definitely looks wayyyy better than when they first took over",
            "I also think that the characters after Miura’s death looked a lot more cartoony if it makes sense?",
            "No. It’s really really good in this chapter :D ",
            "I thought Gaga's first solo chapters looked fine, but in the last few it seems like they've hit a good balance between visual continuity with Miura and their own style.",
            "Still an overall visual downgrade but as weird as it sounds I'm almost happy about it. I mean if muira had to draw those city scapes all the little buildings in the back would be 10x as detailed and the chapter would be out in September. I've accept the new art and just really want to see the story. ",
            "the art has improved a ton as has the paneling",
            "Genuinely close to what Miura was doing during Millennium Falcon. This chapter was incredible.",
            "All they have to do to make me happy is emulate miura's godlike use of really dark shading.\n\n I thought when they drew enraged guts attacking griffith they fell short because the only actual black on the page was guts' head. Everything else was more grey or just completely white\n\nThis chapter, guts in the cell is looking very good. The shading is much more on point i think\n\n\nThe real test will be when the beast of darkness comes out next",
            "Looks incredible. The Goober patrol who complained about it were super rude to not give them time to find their feet. Hell, Miura mistepped his first steps when he made Guts F that demon chick which is super out of character. No one is perfect straight away.",
            "Could have been a scanning issue but I do agree the art is more crisp this issue. \n\nKouji’s previous issues felt too white. Everything now looks defined. Obviously he can’t match Miura’s shading but he does a damned good job at making it look good and faithful to the original art style.\n\nAlso I enjoy Kouji’s faces way more than Miura’s faces",
            "Imo they are definitely better than Miura’s first few digital chapters but they’re not anywhere near his peak.\n\nBut it’s very good yes. I think they’ve improved significantly on the characters. I hope they can get Miuras poses and panel layouts down.",
            "Think giving them more time has definitely helped. Letting them put the chapters out whenever rather then to a specific schedule would’ve helped a lot . Plus I’m sure they prob read criticisms of the art and wanted to work harder and make it better. And they 100% have upped their game",
            "I really believe that's because this chapter was during daylight. It made all the difference.",
            "the art looks decent, but the layout feels wonky to me. idk what you'd call that. it just doesn't seem to flow very well yet. surely it'll improve.",
            "Yeah I agree, the art just seems to get better and look more like Miura's with each chapter.",
            "I think the slight quality drop was due to the hiatus and then Miura’s passing. That probably threw a massive wrench in everything logistically and emotionally, when they got back to work they probably turned it what they had without a lot of fine-tune edits in order to keep to a schedule (“show must go on”), but now that they got their groove and Mori has his routine/timetable down for what he needs and expects out of the team it’s back where it’s at. ",
            "Definitely have gotten better. The team might be dialed in now on the illustrations",
            "I don't have the eye of an artist but I think they were doing amazing since day 1",
            "Guts still looks a tiny bit off, but he has looked off since post-sea God anyway",
            "Yo am I the only one who doesn't want the art to be better? Like yeah good art is good, but the amount of work that goes into that shit drags the entire series down. Literally theres not point in making art better at a certain point, it's just more baggage to the overall progress ",
            "Yeah, definitely seems more \"Miura style\".\n\nEdit: does anyone think that previous chapters should be redrawn for physical volumes?",
            "I like the direction they headed, Story/Art-wise",
            "It seemed like Griffith is taking the fight to the Kushan Empire (if you can call it that) but Silat and Daiba are bringing Guts to an Apostle smorgasbord",
            "Guts will spiritually change bodies with the lil witch and we will have a kawaii lil wizard swordsgirl spiraling 360's with a huge sword slicing and dicing griffith's lil army",
            "…. And it’s on hiatus 😭",
            "Just caught up in manga, immediatly came to reddit to see what others are saying. This comment is the first one that jumped out at me. Do you think it's approachign the endgame? I felt that similarly with numerous directions the story could go (Guts triumphs over temptation for power or falls to it with people around suffering or not based on his decision). But I overall feel like its potentially leading towards the last arc - like the 4th great ninja war in naruto or something - is that what the general concessus is in the community? In what direction to people feel the story may go otherwise?",
            "Griffith will prevail lmao. XD ",
            "I've seen some websites saying they have announced an hiatus all over again",
            "Christmas tbh",
            "I'm calling it now - Dannan manages to come back and help, Zodd turns coat and joins Guts, Skull Knight pulls up to clutch like always, Daiba helps Farnese and Schierke get better at magic & the witches from Elf Island get their powers back. The final battle will honestly be sick af with that line up.",
            "[I'm wondering if Dannan and the fey folk will be someone brought back into the world for a final battle against Griffith and co. I think she would hold the key to finally defeating the godhand, since she seems to likely know how they were brought into being in the first place.](https://youtu.be/RS-0AWyiWwk?t=3)",
            "when was the last time berserk release a “long” chapter?",
            "I guess they've got magic and creatures we've not seen yet maybe?",
            "The way how they see it is if they dont strike, its not a matter of if but when Falconia will attack and subjugate them as well.",
            "I'm assuming it'll come into play how clearly The God Hand haven't been able to choke out the practice of Kushan-type magic in the same way that they did with magic practices in the Holy See territories, if an attempt was even made to begin with. Like this chapter implies, Griffith going around taking out threats implies there *are* threats.",
            "Both Kushan and Elfhelm metaphysics are no joke.. A lot of potential. Even the dwarf armorer who built berserker armor is there.\n\n'He fears that which lies beyond his reason' could mean that they can discover some vulnerability in Griffith/apostles.",
            "Well, they have to try. From the chapter, Griffith is invading them.",
            "They’re probably not, at least not directly. I foresee a lot of the coming battle being mainly won via deception and espionage (Silat and his crew ARE sneaky assassins after all) and whatever comes of that will probably weaken Griffith enough to be worth engaging. Idk, we’ll just have to wait a long time and see… ",
            "Easy! \nStep 1. Make another man made behelit\nStep 2. Convince guts, or better yet SK, to get in it ganishka style\nStep 3. ???\nStep 4. Dead godhand",
            "They will lose but they have to fight. There's no choice at this point.",
            "Skull Knight is gonna show up again and he will eventually have to stop being on 1-player mode and help out. They’re gonna have a Hail Mary plan. $5 says they use the war against Griffith as a distraction and they travel into the interstice or even the abyss itself to look for the Idea of Evil and/or a way to seal the Godhand out of our world. ",
            "My bingo card is that some of the elite demons on Griffith's team switch sides. There are simply way too many of them and Guts can barely fight 1.",
            "[deleted]",
            "Stated in the chapter. There is something out there that Griffith is scared shitless of someone uncovering beyond the demonic. It’s probably why he went after Flora and destroyed Elf Island. And it’s probably why he’s going after the Kushan now. His goal right now is to stop that from happening. \n\nThe berserker armor isn’t even being used properly too and the dragon slayer just needs one more push before it can start harming the godhand like the sword of actuation can. There’s hope yet.",
            "It seems that he's scared of magic, at least to a point and as a cautionary measure. He's been wary of invading the Kushan, and made sure to kill the witch and destroy the island",
            "I mean now they also have witches and Guts’ gang, not quite even playing field but they’re getting there ",
            "It’s gonna be the old “torpedo into the exhaust vent of the Death Star” ploy. Either that or the veil that Griffith has cast over everyone is lifted and it’s Avengers Endgame but with way more violence. ",
            "I don't think they can take Griffith head on.  I suspect what's going to happen is that they're either going to slowly lose territory while retreating or barely hold on while we see Guts & co. stop Griffith from achieving this goals in Kushan lands.  It would be a great setup to highlight how much stronger Guts & co. have become since their last engagement as well as new training they received in Kushan.",
            "Perhaps one of the godhands are originate from the Kushan lands. Looks unlikely but could be. Or maybe diaba has more of those demigods.",
            "Great comparison. It feels completley hopeless at the moment. As awful as the guy was, Ganishka and his empire seemed like the only credible threat to Griffith and they still got wrecked. The current Kushan army will have to do a lot to even stand a chance.",
            "In line with LOTR, I think the Behelit that Guts carries will play a major role in the end of the story (just as the Ring did at the en of LOTR). My personal opinion is that it will have something to do with the Moonlight Boy rather than Guts himself, especially since Flora made the comment way back before Guts got the Berserker armour that he she doesn't yet know if it actually belongs to him or not.",
            "They are definitely \"rushing\" the story. Not in the sense that they are doing a bad job, but any unnecessary adventures and dialogue will be skipped from now on",
            "I mean in the dialogue it did say that they were in the territorial waters of the Kushan. If we are going by modern standards, that isn’t far enough for a trip",
            "It is pretty crazy to think that 7 chapters ago we were still on Elfheim, and now we're in Kushan and going to war with Griffith.",
            "In top tier shape",
            "100%",
            "Pretty sure that the final Battle will be setted in Falconia. Even Miura talked about more encounters between Guts and Griffith before the end.",
            "maybe Becchi will also play a role in evening the odds",
            "Maybe it was meant more as a gag, but the lack of chestnut puck made it look more serious than intended (?)",
            "I think he remembers him, and is just very specifically not answering him. Whether that's because he doesn't trust him right now (Rickert was with the Kushans that just essentially abducted them), or is trying not to give anything away because he knows Guts doesn't like talking about his time as a mercenary, not sure.\n\nI could be wrong, but I take it as Puck very specifically not reacting to him and just waiting. He doesn't respond to Isidro when the latter asks him if he truly doesn't remember either, which is a good sign.",
            "Puck forgot about his scheme with Magnifico to take over Skellig island, but that was just a gag.",
            "I legit don't get if Puck is supposed to be sus here (raising questions like: is he the real one? what's wrong with him?) or if they just tried to be funny with that line lmao\n\nI need my chestnut Puck or else I don't get the jokes!",
            "puck lost his home and is the last of his kind. of course he's depressed and sullen.",
            "I feel like there is something we dont know about Puck. He has this strange, silent aura since the last chapter, like he has almost lost his joy.",
            "Puck is silly",
            "Maybe Puck is just observing right now since they just got captured.",
            "I'm going there pretty soon as well! Excited to be in the homeland of the Kushan haha",
            "Don't bring the Hagia Sophia up around my Greek father, he's salty 500 years later.",
            "I wonder what Guts' reaction will be to seeing Daiba, and then Rickert, next to each other.",
            "Kshatriya is part of the class system in India, the warrior class to be precise which is the upper class (the class kings and knights belong to). Durga is Durgamata, which is a divinity, seen as one of the highest manifestation. She is the embodiment of all female forms, both beautiful and terrible. In her terrible form she is known as Kali or Kalimata. She is the combination of the female forms of the Trinity (Parvati, Lakshmi, Saraswati, the female forms of Shiva, Vishnu and Brahma) and, which leads to the context of Berserk, she is known as the Slayer of demons. Both mighty, beautiful and terrible, she triumphs even the greatest of Gods (the Maha deva, greatest deity Shiva himself). \n\nGuts being called the warrior of the demon slaying Goddess is quite fitting though I am wondering if this will lead to anything further. Daiba also mentioned Serpico as warrior of Vayu (the powerful vedic god of Wind of which Hanuman was an incarnation according to Hindu lore, probably because of his cloak and weapon) and Isidro as the warrior of Agni (vedic god of the sacrificial fire, because of his dagger).",
            "Schierke has a crush on Guts. Her love for him is apparent. The way she held his finger. She probably healed him while he was out.",
            "I didn't saw Hanarr... Good eye, thank you!",
            "Very interesting takes you have for sure, I saw RealLifeRyan on YT talk about Schierke being stuck in the Astral Realm being a bigger deal now that Guts is awake without his ace up the sleeve, Hanarr hopefully along with the other Elfhelm Wizards get more screen time but only time will tell",
            "Hanarr could also repair the dragonslayer imo \nDidn't she have like an aura bc of the demon blood?",
            "Where is Hanarr??",
            "That’s a very bold assumption considering the previous chapter came out in November October of last year and this one released in april",
            "I like how we've gotten a lot of indications that there haven't been any production issues, but for some reason Young Animal is keeping up that Miura pace anyway.",
            "[removed]",
            "Not coming in June, at least until the 28th. Hopefully we'll get 2 or 3 more chapters this year and 43 will be delayed to 2025 for a better work of art.",
            "After what Gut's did to them it is hard to believe he just walks around free.",
            "The Kushans might be strong enough to fight Griffith's forces, but Griffith himself (and probably the rest of the God Hand, if they show up) are for Guts and Co. alone.",
            "Maybe Griffith will end up winning in the end. Miura did say that the ending would be \"bitter-sweet\" did he not?",
            "I liked that they have magic as used for war. They know that much and it might make a difference. I keep thinking they might be more resistant to apostles and the dark but the n this world I doubt it. They are mystical as heck though.",
            "I think he knows they will have trouble with Faconia on their own and wants to see if he can utilize these new people.",
            "I think it may be magic. It seems the goal of the godhand is to eliminate things outside of the demonic. Magic seems to have unlimited usefulness. The goal of the sorcerers may be to continue to learn the natural way of magic. Compared to the forceful nature of the demonic, which may be limited in scope. Remember the godhand were responsible for the holy see. That effectively set the table for the current generation to witness falconia and think that this is the only way to salvation.",
            "[removed]",
            "[removed]",
            "[removed]",
            "Yea they are vastly outnumbered. I don't see how this will shape out to be a battle of equals.",
            "Yeah, it feels weird. Feels like Silat is being treated as the de facto leader of the Kushan Empire now, all of a sudden?\n\nWhich, I mean, *could* feasibly happen, given the power vacuum that would have come after Ganishka died. But we certainly haven't done the legwork to get there.",
            "He remembers. He just has no idea why Rickert is there? There is more to Puck and he is not telling us at this time.\n\nHarkens back to the last chapter when Rickert and Puck were staring at each other when Rickert was sitting on Guts chest.",
            "Idk, he looks majorly despondent, doesn't even react to a mention of Casca. Starting to think elfhelm being destroyed is having an effect on his state of being/mind",
            "Its not the same situation at all. Ganishka had lost his mind and was stomping his own soldiers.",
            "I just saw it as a way to act sassy in front of the new guys and better explain why he has to chain him up without being personal.",
            "Well life as been stressful for them lately",
            "Yes everyone else in the community realized it 6 months ago when it was first shown.",
            "Daiba has been back for multiple years now dude.......",
            "Puck hasn't contributed for the past 5-10 chapters it's insanely weird lol",
            "Underestimating guts is very common. Now that he is conscious I wouldn't be surprised if he just breaks the chain effortlessly.",
            "He is also weakened and injured. The armor has been removed.",
            "He doesn’t care to escape, his in a really bad depression at the moment and is just waiting to die",
            "[removed]",
            "[removed]",
            "I mean but it leaves so many plot points and the story just progresses for the sake of it.",
            "The pacing of THIS chapter was good, not so much for the last ones where we had 1 whole year of Gus lying on the floor.\n\n I hope they spent the long break planning where the story is going next, this chapter is a good start.",
            "Godhand would have been its own arc to get through, a literal Dante’s inferno of an experience is painted on the wall. \n\nGuts surviving the impending war, apostle generals, and a possible Falcon Griffith fight just to run the gauntlet of Godhand would take an exceptional amount of fuckery.",
            "I don't really think the village ascetic is an issue you say it looks \"Indian enough\" but I don't think that's the case the main building is clearly modeled after the Hagia Sophia in Istanbul. Also weather it has more Indian influence or middle eastern influence in appearance doesn't really matter as this is a Fantasy world and blending the two is fine.",
            "I don't think Guts \"ended up\" in the Astral realm, I think he was deep in despair and Schierke was deep diving to bring him out.",
            "I think Puck is just choosing to ignore Rickert.",
            "[removed]",
            "Might be a red flag. I am still thinking why nothing has happened to puck till now even after everything originating from that island disappeared.",
            "Given the Berserk earth is geographically almost identical to ours, if you were to take the real world historical Kushan Empire (who ruled most of modern India), they would pale in comparison to just the sheer size of Falconia (which by this point, is probably the entirety of Western Europe).\n\nIstanbul (which was the crown jewel of the Ottoman empire, incidentally), is at the geographical crossroads of East and West, and an incredibly defendable location. In order to ensure that this final battle isn't just the Kushan getting steamrolled, Gaga have probably A) mapped out the size to be India across to Turkey, and B) chosen Istanbul as the capital both because of the iconic Hagia Sophia (which we see in the chapter), and the fact that it's a very defendable location - possibly one of the most defendable in history (it's why the Romans initially founded Byzantion at that location in the first place). \n\nThe final battle is absolutely going to be the Kushan holding out at their capital (Istanbul to us). Hell, even in that chapter, we hear that Griffith's army are on the \"western border\", meaning they'll be on a straight path to the capital.",
            "Yeah, it would have made more sense if they depicted puck as 'chestnut puck' (all goofy and forgetful, as in - \"eh? you're who? eh?\") when it was implied that Puck forgot all about meeting Rickert.\n\nInstead the interaction just looks off",
            "What double take? You just made that up. He said \"Guts was his name?\" That means he remembers.",
            "> in a timely manner.\n\nI don't know that there's ever been a concern.",
            "You are a few months late with that. Everyone already knows about that from 6 months ago.",
            "She is going to show Guts some stuff and talk with Guts. She is fine. Probably discovered Casca and Falconia already and explored it.",
            "Thank you for posting to r/Berserk, unfortunately your submission has been removed for the following reason(s) :\n\n>No Piracy\n\n>Do not link to, request, or recommend sources to pirated versions of Berserk. \n\n>Linking to specific pages for discussion purposes is allowed but please use an image host such as Imgur. Links to manga reading sites or \"free\" streams will be removed. Fan works are allowed but some may need moderator approval.\n\n>Please support the series' official release whenever possible.\n\n[More information about our rules can be found here.](https://www.reddit.com/r/Berserk/about/rules)",
            "It's just her mage's hat, isn't it?",
            "Its not that clearly defined. Kouji Mori has the supervision of Berserk but in collaboration with Miura's group of assistants and apprentices from Studio Gaga. As far as I know his old assistants do give some input on the story besides doing the artwork.\n\nOfficially the chapters have the credits \"original work by Kentaro Miura, art by Studio Gaga, supervised by Kouji Mori\"",
            "Guts would be old by then, Casca would likely kill herself or worse, Griffith will take over the world, Moonchild will become Moondude...don't see it happening.\n\nThey will learn on the field with Daiba guiding them, its not like they are completely green, they have seen their fair amount of battle.",
            "Did I miss somewhere that these things were stated in the manga? I was never under the impression these things had to happen.",
            "I figured the time skip would take place while they were on fairy island, and Rickert would be badass master armorer of the prince's crew.",
            "Kshatriya of Durga is Warrior of Rage I think. For anyone else reading and wondering.",
            "Sadly I don’t think talk no jutsu will work on Griffith",
            "I'm willing to bet that his original vision was to have the gang fight that pirate one last time on their way back",
            "Tbh we would all prefer Miura back even if we would get 5 additional years of boat rides",
            "haahahahhahahaha",
            "On this chapter also storywise imo, this chapter is carried by dialogue rather than visuals and moves the narrative forwards.\n\nAfter multiple slow chapters with little dialogue, we had 3 chapters of the Kushan boarding the ship, its refreshing to have a chapter that clearly shows where the story is heading",
            "Silat's anatomy looks a bit off sometimes ",
            "The last paragraph, it's funny that someone so astheticly beautiful can cause such disgust in me. If I didn't know the history, I probably wouldn't feel that way. But I do. It really does show that beauty, at least outer beauty, will attract people into your domain, but if your soul is grotesque, nothing will stop some from seeing the demon only. A good lesson for life. ",
            "It sucks how he’s such a terrible person considering he’s exactly my type LMAO. Why can’t white haired twinks ever be the good guys in stories ;(",
            ">And is it me or did Griffith get hotter which is unreal to me.\n\nIonno bro he be lookin like a curly haired Taylor Swift",
            ">And is it me or did Griffith get hotter which is unreal to me.\n\nyou spend to much time in the other sub",
            "Yes, I'm pretty sure he's gradually looked more ethereal and angelic",
            "The small window to the left with his face?",
            "elbows too pointy",
            "I imagine the anxiety of picking up the mantle and being thrust into the main role took some getting used to. They're coming into their own and the art is damn near Miura level. I've never felt more confident in Studio Gaga being able to give us not only a satisfying final arc - but a GOOD one.",
            "Happened the same to me, it didn't make me miss Miura less, but it really made me appreciate more the work that the new crew is putting on this",
            "It might be down to the studio not feeling comfortable about trying to emulate Miura's personal style of humor and not being able to make it feel natural maybe.",
            "Honestly Puck being chestnut constantly became tiresome to me so I’m glad seeing him mostly normal.",
            "I fucking love it. Normal Puck is 10000x greater than Chesnut",
            "We’re out of Elfhelm and in a very serious part of the story I’m so glad they’re not doing chestnut puck ",
            "i honestly was kind of excited to see his real character for once hahaha",
            "I honestly love normal Puck. Was never really a fan of having Puck randomly transform into Yoda.",
            "I mean they have already released Volume 42 (365-373) with no changes to the artwork, so I doubt it.",
            "The art style has definitly shifted a bit in the last 2 ish chapters but I think it has allowed gaga to be a bit more comfortable. I think it's an improvement for them overall. The first chapters when they took over they were trying too hard to closely emulate miuras art and it felt a bit stiff as a result. To let their own skills shine through they have to be able to make it their own, at least a little bit.",
            "In Chapter 370 it is nighttime and they are inside a boat, so you would expect it to look quite dark with lots of black used, but everything is just so grey. It looks like they are under a stage light, and it honestly just looks really flat. In Chapter 375 it was still nighttime and they were still on the boat, but it looked far better with much more contrast, and when Guts is sat in the cell in this new chapter, it actually looks dark as lots of black is used.",
            "Well 365-373 have already been released in a physical volume in Japan, and the art was absolutely no different.",
            ">!I think we will see Silat's Kushan army get destroyed and Guts and Co. having a final battle afterwards with whatever knowledge and training Daiba imparts to them.!<",
            "That’s what I thought too. The big city and its darker areas. Maybe they’re more resistant or absolutely intolerant of it but it’s still there.",
            "They will fused like goku lol",
            "It’s going to come back in June for sure",
            "I'm not sure what the community's consensus is but I believe this based on the guiding message Miura left to Mori. Apparently Mori was told the general plotpoints to hit before Miura passed. Given how much respect Mori and the team have for Miura, it seems like they're trying to be as concise as possible. \n\n\nConsidering Griffith has Casca again and we're now building up to a conflict between Falconia and the Kushan, I wouldn't be surprised if it's the last or penultimate arc. (Think the 4th Great Ninja War minus the asspull alien nonsense.) I could be wrong but I thought I heard years ago that Miura knew how he wanted to end the story and it wasn't supposed to be overtly depressing so I still have hope Guts will find peace in some way shape or form. I'll be torn if he can only find peace in death.",
            "That is likely the same case as the Jujutsu Kaisen hiatus. A holiday-filled week in Japan.",
            "Please no...",
            "How are they this slow and so many little pages? I thought they had a team",
            "Sonia and her mental connection between Cascas mind and Schriekes mind is going to be the key factor. Once Sonia peers into Cascas mind and sees the real Griffith trouble will start brewing. ",
            "Prior to fighting Zodd and his imprisonment, Griffith has never truly been defeated in a military battle, right? \n\nThe fact that they are planning on going up against Moonlight Griffith and his Falconia dream team with the stitched together team Guts, this really sets the stage for some pretty crazy stuff. Very exciting.",
            "Hear me out. I think that when Zodd did his sacrifice to become an apostle, he sacrificed the only thing a true warrior could; His right to die a honorable death in combat. Maybe Skull Knight defeats him and, much like when he didn't kill the Egg of the Perfect World because causality dictated it was for the best that Griffith incarnated, he finds himself unable to kill Zodd once for all. That results in Zodd turning coats and helping the Black Swordsman Party in their war against the Godhand - with his objective being either to break his curse (which logically comes to thought when Void, the one who does the ceremony of sacrifices, dies, or something to that effect) or die (**in combat)** trying.",
            "I feel like Irvine could become a traitor too. After all, he has always being irreverent to Griffith, Locus even had to insist for him to bow to Griffith.",
            "this would be crazyyyyyyy",
            "What was I just linked to",
            "FOR GOD SAKE",
            "Probably some of the chapters about cascas mind but if you want like long long it has to be the golden age chapters or the black swordsman arc those were some long chapters",
            "I think what makes me believe its shorter is the lack of more dialogue like in Miura’s chapters, for example 362 ( altough a lot of dialogue as filler ) , dont get me wrong i understand why there s more lack of dialogue now, it just makes the chapter feel shorter ! :D",
            "Certainly they are competent, and the fairy island mages will be helpful, but I feel like they will need some trump card (probably tied to the moon boy narrative) to actually stand a chance. As things are, it does not look good.",
            "And do not forget technology! Rickert set Rakshas on fire... if it wasn't for that poor horse...\n\nAlso, I look forward to seeing what Kushan magic and the Elfhelm magic can do together.\n\nAlso, do not forget that the blacksmith is with them too.\n\nAlso, do not forget Skullknight might just be around the corner.\n\nYes, I'm pretty excited :D",
            "What is the point if Griffith nullifies everything with his reality warping abilities?",
            "The Four Kings of the World will undoubtedly play some kind of role in the upcoming conflict. They reside in the Astral plane and act as benevolent protectors of humanity. In a way, they are kind of the antithesis of the God Hand. Griffith destroyed Elfhelm since it was a major anchor point between the astral and physical planes, which has undoubtedly cut off or at least greatly reduced the amount of influence the Kings can have in the world. But I'm assuming that all the denizens who escaped Elfhelm will figure out a way to create a new anchor point or something like that so the Four Kings can enter the fray.",
            "or they collect Behelits for lols and then Guts smashes all of them to buff the Dragonslayer into the behelit sword but better",
            "That worked really well for Ganishka.",
            "Plot twist: the Moonlight Boy climbs it and falls in, and the moment before he falls into the liquid, he transforms back into Griffith. Femto is now twice reincarnated",
            "Amazing",
            "It goes beyond magic or whatever deep lore magic that exists. As stated “beyond the demonic”. To me this implies the godhand have been slowly trying to turn the world into a place where demonic power are the end all be all. It also seems to be that “beyond the demonic” means outside of even godhand comprehension. Daiba being a super powerful mage type possibly has some knowledge of it. But I doubt they and the godhand fully understand what that is.",
            "It feels appropriate I think. After Casca was restored and the moonlight boy Griffith reveal the stakes have changed drastically. ",
            "Yeah, i doubt they will be in some unnecessary random adventure trouble from here on",
            "Yeah I honestly don't mind them moving at a faster pace considering how this story has been going on for over 30 years",
            "Well, Mori did say, once Berserk was confirmed to be coming back, that he would only write what he can clearly remember Miura showing him. \n\nThe way I see it, it's like if Akira Toriyama died before completing Dragon Ball Z back in the 1990s, and then Team Four Star comes in and abridges the rest of the series, following the plotlines Toriyama laid out.",
            "The pacing doesn't even feel off to be honest, I'm glad to see it",
            "Sir I belive it's called Kushistan.",
            "they really didn't hold back with her design lol",
            "from that interview i think miura had much larger plans for their meeting at elfhelm than what we got. I belive outcome would remain more or less same but character interactions would be much superior.",
            "You just know Miura would've had that reaction panel as a close-up \"-\\_\\_-\". Probably would've worked better if it was chestnut Puck, but I don't mind them not really trying it, since the chestnut gags were essentially just Miura adding his own commentary track most of the time.",
            "It feels like Puck is playing it close to the vest. The last time he saw Rickert it was in very different circumstances. Nobody has heard about the slap yet. Nobody in the group.",
            "That's what i think too but he didn't seem to recognise or at least say something back to Rickert as a greeting or ask him about what's he doing with the Kushans or about Erica. Maybe later we'll get an answer for this.",
            "I think he is playing it close to the vest. He knows something but is not saying. The way he looks at Rickert. Goes back to the last chapter when Guts was out cold on the deck. Puck is sitting on Guts's chest looking at Rickert. Both of them are staring at each other.",
            "Yeah i felt something is strange about him too but there's a good reason he could be like that. Losing his home and Guts being in the state he's in could affect him way more but perhaps he doesn't want to show it.",
            "Tbh I still don’t think this was their homeland per se, it seems a little out of place compared to what we got from ganishka flashbacks. Also the palace seems to be a military command centre than more of a place.",
            "Yeah it’s a shame. They should’ve kept it a museum to keep everyone happy",
            "That makes a lot of sense",
            "Page 8 with the panel of everyone around Schierke. He’s at the bottom.",
            "Maybe. But the announcement came in Young Animal last year.\n\n\nBut, things change and nothing is certain. However, I'm going to hope and accept potential disappointment rather than assume the worst. ",
            "To honor his name",
            "That's kind of nuts, I wonder what the reasoning would be for holding back if production hasn't been an issue.",
            "Yeah unfortunately we got hit with the “to be continued” at the end of this chapter. I really enjoyed it though",
            "So excited to wait another six months for a new chapter, oh boy!",
            "Damn...",
            "Right? In their minds Guts being imprisoned makes 100% sense.",
            "Yeah, if they dont have a chance to talk it out and Guts manage to get his hands on any swords ... corps are gonna pile up.",
            "They will, the \"picture\" of Griffith with his soldiers standing beside him (when the kushans talk about him) is, I think a depiction of the real situation at the exact moment they are talking : the BotH 2.0 is waiting on a rock just before the sea and are about to come.",
            "He indeed did not",
            "Bittersweet is not Griffith winning lmao. That's like the worst ending for everybody.",
            "As I remember Miura was about to do kinda happy end",
            "Thank you for posting to r/Berserk, unfortunately your submission has been removed for the following reason(s) :\n\n>No Piracy\n\n>Do not link to, request, or recommend sources to pirated versions of Berserk. \n\n>Linking to specific pages for discussion purposes is allowed but please use an image host such as Imgur. Links to manga reading sites or \"free\" streams will be removed. Fan works are allowed but some may need moderator approval.\n\n>Please support the series' official release whenever possible.\n\n[More information about our rules can be found here.](https://www.reddit.com/r/Berserk/about/rules)",
            "It could possibly be explained away as timey-wimey shenanigans from being on Elfheim for long enough. I hope some elabortaion of some sort happens even if Mori said he wasn't going to add conjecture.",
            "Silat isn't the leader. Daiba has decided to follow Silat. That was established years ago. \n\nWhy does Daiba still have power? Well, he was the second in command of the empire. So it makes sense.\n\nBut I think Daiba is using his magic to manipulate people like he does with animals.",
            "I get that feeling too. Puck is actually going to do something important.",
            "I’m not talking about Ganishka losing because of “his lack of a strategy”, he was taken by fear, even with god-like powers he was “useless” against Griffith.\n\nMy point is that the Kushan at this point in time don’t have any advantage, so they need a REAL strategy.",
            "That makes sense and I'm hoping that's the case instead of two characters (Puck and Silat) not remembering people they should.",
            "I think it's partly that Puck had crashed and burned as a sort of pitiful joke character in the arcs prior to the manga getting really serious again, and thus Studio Gaga didn't know how to properly transition him back into being a serious helper boy, but I think it's also a very intentional and deliberate thing that we will find out the true nature of in the coming arc.",
            "Thank you for posting to r/Berserk, unfortunately your submission has been removed for the following reason(s) :\n\n>No Piracy\n\n>Do not link to, request, or recommend sources to pirated versions of Berserk. \n\n>Linking to specific pages for discussion purposes is allowed but please use an image host such as Imgur. Links to manga reading sites or \"free\" streams will be removed. Fan works are allowed but some may need moderator approval.\n\n>Please support the series' official release whenever possible.\n\n[More information about our rules can be found here.](https://www.reddit.com/r/Berserk/about/rules)",
            "This is a good thing imo, the manga had become too big and unfocused to move forward, at the pace it was going I think it would have taken Miura another 500 chapters to come to an end if at all. \n\nMori seems to be concentrating on the essentials to move the story forward.",
            "that never once crossed my mind but it shouldve been so obvious. i thought it looked like it had an arm hanging down",
            "It's warrior of Durga. Durga Ma is one of our goddesses.",
            "Even Naruto wouldn't forgive Griffith lol",
            ">!I think there was a chance, and there still maybe that it happens, that Miura had intended for them to stop by the island of Ys to pick up reinforcements for a final battle with Griffith. It would make little sense for Miura to have introduced the place into the story without having it have any meaningful impact.!<",
            "Yar, 'tis a tentacles lot in life...",
            "I would be willing to accept two panels of Daiba instantly bodying the pirate",
            "Bonebeard is destined to become the next Godhand after Guts axes Griffith, confirmed. ",
            "Honestly no. I would have loved it if Miura were alive to write the ending himself, but no more boat arc please. If Miura had plans for boat arc 2.0, I would be on hiatus from reading till its done.",
            "The biggest malefactor was the lack of dialogue. Considering the sheer scale of what was happening, the lack of dialogue was jarring.\n\nIt’s still missing character nuances and interactions that filled out chapters, but it’s an impressive step forward.",
            "Even late-career Miura wasn't perfect with his anatomy. If this is a comparison, it's kind of pointless.",
            "Well put. I'm FF7-brained right now and this is exactly how I feel about Sephiroth.",
            "Real, I literally got into berserk because of Griffith's looks reminding me of Pisces Aphrodite but ended up being disgusted by him and loving Guts all the way",
            "No. Most people are hook line and sinker for \"outer beauty\", even if the true nature is \"demonic\". And by most, I mean vast vast majority. \n\nMost people just don't have the critical thinking skills or honesty to look deeper. They are content with the \"outer beauty\". \n\nJust look at this USA election as an example. Trump, a huge moron. And his opponent? Biden, who was once also a moron. Now, he is literally brain dead. \n\nA brain dead idiot who was a moron before his brain rotted away, vs another moron. And these two are the most popular.",
            "In Japan=White Hair=Demon(ic), so good luck outside \"I can fix him\" vibes.",
            "Lmao exact same thing with Devilman cry baby the brunette devil was the good one while the white haired twink Angel was terrible. I like it that way.",
            "I kinda took it as with Guts being obviously at the worst he's really ever been in, it's time to stop joking around so chestnut is on break.",
            "Puck chestnut was basically Miura's avatar inside the work. It wouldn't make anymore sense to include it.",
            "I understand why he added in bits of humor here and there to lighten up the story, but random star wars references and other anachronistic references were not it. I 100% understand why the studio wouldn't even attempt to replicate his humor even if they could.",
            "Thank God and all that is holy",
            "Was hoping for a more even mix but I get the feeling I'll never see him again after his passing",
            "Indeed, the boat trip was very gray, which I think was due to the cloudy weather and the lack of light inside the boat since they had to depart in a hurry. In Chapter 375, there are more light sources from torches used by the Kushan, as well as more reflective material, such as Kushan armor, resulting in generally more well-lit panels. In Chapter 376, we see more contrast with black in the cell because the only light source is a small window above Guts.  \nI don't deny that the art style improved, but I think the lighting from Chapter 370 onwards was more of an artistic decision rather than a consistent improvement.",
            "I think Daiba is training Schierke to absurd levels, along with more Flora appearances and some lore leak of the Proto Godhand and past Skull Knight/Gaiseric events.\n\nRemember how Flora stated the Brand of Sacrifice isn't something definitive but rather just atrociously strong magic that even she couldn't undo? Maybe with a lot of training from the notably strong Daiba, Schierke can improve her magic to levels like that.",
            "Theres no way Sonia doesnt already know what Griffith truly is imo. His entire army is full of bloodthirsty demons",
            "I'm interested to see how they approach Casca's side of things now. You're most likely right but it would be a cool twist if Sonia knew the whole time & was just as evil as Griffith lol (i know that's not the case, at least it doesn't seem to be)",
            "fuck sonia, delusional little bitch, shes thinking griffith is the savior and falling for his bs and leading the lambs to slaughter, its the dumb leading the blind",
            "The best thing you'll see all day.",
            "seems to me they think their trump card will be Berserker Guts",
            "Yep, griffith's god hand capabilities are still unreachable and makes mages look like regular dudes, but these mages are still better than most apostles as they can just nuke most of them or put them to sleep or whatever they think up. \n\n\nAnd here's hoping slan doesnt come for a visit once the fighting starts. It's gonna be even more chaotic",
            "Wait I thought the moon boy was Griffith? The panel showed the boy transforming into him",
            "Hopefully Skull Knight will give some actual bloody help instead of vague riddles all the time!",
            "They mention it in this chapter. The whole reason he destroyed elfhelm is because he’s afraid of that which lies beyond his reason, beyond the demonic. So there’s hope with all the magic users on our side",
            "There's going to be some form of nullification going on probably the collective magic power of Daiba and the mages or from Schierke using some really powerful summoning magic to counteract Griffith or maybe even the moonlight child inside Griffith suppressing it himself. There's millions of creative ways around Griffith's power as long as you're imaginative enough just hope it's in a convincing and satisfying way.",
            "Let's hope Miura thought of a way to defeat him before he died",
            "Dunno, I guess they'll maybe have to rely on fuckery when he's not quite in his own body maybe?",
            "Dude can't even control where moonchild goes. Just wait for a full moon and slice the kid.",
            "This cancels out the demon stuff. He's just normal Griffith again. Pre-torture body, but he IS still only wearing the bird mask",
            "It’s definitely fast as fuck by berserk  standers but your right it doesn’t feel bad at all",
            "It's called the dankest loudest kush I ever smoked in my life.",
            "Just give rickert the dragonslayer to kill griffith",
            "Unfortunately I could also see a lot of that just being a result of Miura never writing down how he reacts to Elfhelm’s destruction.",
            "it was made a museum in 1934 after the ottoman empire fell but our dumbass leader made it a mosque again like two years ago lmao",
            "At this point I think it is a meta part of the story. Many people will die, including the creator. No one is bigger than the story, death happens both in and outside of berserk and the world keeps going.",
            "The first magazine release of May. We may see another chapter in the second release of that month. \n\n\nAlso, for an early ad in the magazine, they are releasing vol 43 this year. Which includes ch 374 and 375. We may see 4 to 6 more chapters before the year is over. \n\n\nThis could be wrong. But I choose to hope for the best and accept disappointment if it comes. ",
            "if that's the case, the kushan have less time than expected, though i don't know how long it will take them to cross the sea towards the kushan lands, it might give the mages enough time to train under dabai",
            "I think so, because Silat doesnt actually ask for the name, just pretends to barely remember it.\nAnd Puck doesnt answer to Isidro when he asks if he seriously doesnt remember Rickert.\nI think that is just a case of mutual distrust from both parties, considering the 2 empires have been mortal enemis throughout the whole manga.",
            "Possibly yeah.\nIf miura would have been here...\nIt would take more  50 Chapters to reach this declaration of war.",
            "Cool. Looked that up next. She is associated with protection, strength, motherhood, destruction, and wars. Guts is a warrior of war. Maybe they mean he is forever a soldier in some way too.",
            "Even Thorfinn*",
            "I think it might have just been the new team trying to find their footing\n\nStruggling a little about how to do it",
            "I agree, I think they took the \"we will only write what Miura told us\" too literally and didn't allow the characters to actually interact in a meaningful way, it must have been incredibly hard to do the first few chapters without really knowing what to do, I'm happy they are starting to feel more relaxed and confident",
            "I genuinely think Sephiroth is on a redemption arc and.... idk he doesn't seem as bad as Griffith to me.\n\nHe's essentially insane and a slave to impulses beyond his control be it JENOVA or his kind's natural animosity towards the Cetra.\n\n  \nI'm hoping he's trying to break free of all these forces in the remake.",
            "Are you saying trump and biden are hot?",
            "Man, if Guts ever get the Brand of Sacrifice removed.... I will cry until my eyeballs fall. (in a good way, of course. That would be beautiful).",
            "I think Sonia knows Griffith has done some really horrible shit to become the master of those demons. She just doesn't care because she herself is an outcast so she prefer the company of other outcasts (like apostles). I don't think Sonia knows the actual history between Griffith, Guts, and Casca. Or how you have to sacrifice your loved ones to become an apostle/God Hand member. \n\nDoes Sonia even know what an apostle is? Does she know Griffith is one of the \"angels\" from the Abyss? I feel like Sonia just think of Griffith and the apostles as people with strange powers, not monsters who have sacrificed their loved ones to gain their power. Not so many people in the world of Berserk understand the nature of being an apostle.",
            "People can get accustomed to even this, when swayed by charisma.\n\nJust look at real life. Do you think Donald Trumpists don’t know he is a crook and a disgusting human being, completely unfit to rule even a bathroom seat?\n\nIn some level they know this. They just supersede that knowledge with a lot of bullshit. It takes some heart-erenching dissonance to cleave some doubts on the followers of a charismatic leader.",
            "yeehaw",
            "I'm ready for when Guts smashes the Idea of Evil and Griffith's world comes crashing down.",
            "All according to the laws of causality",
            "Wait, Skully has saved Guts a couple of times. He doesn't just talk the talk, he also walks the walk. And being criptic is part of his character, otherwise he wouldn't be Skully :D",
            "I bet he's hiding behind a pillar waiting for his moment to spit out some riddles",
            "Struggler gotta struggle.",
            "And don't forget the Elemental Lords. If Schierke doesn't wake up soon, my guess is that she's diving deeper to form a more profond connection to the Astral Plane to bring back allies.",
            "War commences! And then the motherfucking Skull Knight joins the party, riding his horse and his horse is riding motherfucking Zodd (he stood up against that lil' bitch Griffith), oh, and they're fucking flying.",
            "Guts managed to cut a strand of Griffith's hair when he was trying to hit him but not Casca, who was in range. \n\nRickert slapped Griffith's face\n\nThere IS a way of touching him, and I place my bets that Miura had it already planned",
            "I forgot when/where it was stated, but Mori has the notes and that we are going into the third act of the overall story. ",
            "Dude swings it broadside and slaps Griffith's fucking head off his shoulders",
            "Exactly, and I'm sure it would have been glorious, but it would have most likey taken another 10 years to get there",
            "Idk, \"I have no enemies\" might break Femto's brain and the idea of evil simultaneously.",
            "god i need thorfinn to ride in on a golden chariot to save the berserk universe",
            "Exactly, you can’t fault them for it, it’s a massive undertaking. It’s just wild, the scope of the content condensed so rapidly.",
            "Bro I'm saving up to get it tattooed lol\n\nI would actually be so mad if my favorite fiction character lost the brand I got tattooed LOLLL",
            "I honestly hope that it gets removed when Griffith finally expires. Anything else would feel like a copout.",
            "I want guts to go hawk deep in that Grifussy first though",
            "i just got the image in my head of skul knight's horse standing on top of zodd flying and it's the funniest fucking thing",
            "I honestly find so weird for people to tattoo brands lol",
            "Why not just get a brand? More authentic",
            "Gotta get Zodd a horse, too.",
            "Why? Im personally hoping to get one myself lol",
            "Because the Brand reminds me and Guts of the atrocities of the Eclipse and he would LOVE for it to be erased from his body. Seems pretty weird to tat what symbolizes the major traumas of one of my most beloved fictional characters.",
            "Very fair and well said. Hard to disagree with that."
        ]
    },
    "The people who think griffith did nothing wrong , Why do you think so": {
        "title": "The people who think griffith did nothing wrong , Why do you think so",
        "score": 116,
        "url": "https://i.redd.it/53t1hulo338d1.png",
        "content": "",
        "num_comments": 81,
        "comments": [
            "I think its mainly making fun of people that take berserk way too seriously. Like people forgot trolls and jokes exist.",
            "I can assure you, the people who said \"Griffith did nothing wrong\" have their mothers whose name is \"nothing wrong\".",
            "Cause you will be hard pressed to find more trollable audience. And the fact that most people on this sub give off an impression that they never even read Berserk and mouthbreathing on Griffith solely basing on TicToc shorts and reddit relationships subs' passages about bad boyfriends also doesn't help.",
            "He’s Trolly-Probleming the world to a better place, one mass sacrifice at a time",
            "Griffith though like this \"A hundred men die for my dream, what the difference when I directly kill a hundred more for my dream\".\n\n \"They already slave to my dream, I assume they willing to die for my dream\".",
            "Yeah the hell is empty, all those people are here",
            "Becuase poeple think he is hot",
            "They’re just trolling cuz they’re bored. Yall taking them serious is exactly why they do it.",
            "He’s just a dude building an empire upon a mountain of war crimes. Not too different from any kingdom in history tbh",
            "I don't think there's anyone who thinks Griffith did nothing wrong in a genuine fashion unless they're a genuine sociopath or psychopath that truly lacks empathy. It's a meme used to bait people who feel passionate about the series or as a joke because of how untrue it is.\n\nNow, there are some people who do believe \"Griffith did what a lot of people would do in that situation\" and may be using \"nothing wrong\" as a short hand/poor articulation.\n\nI do think there is something to be said about everything that led Griffith to that point and how many people in that same position would actually do anything differently than him.\n\nWhile I'm sure everyone likes to believe they'd reject the offer to sacrifice, I know I'm certain I wouldn't do it to my loved ones. How certain I'd be after being tortured for a year by that little gremlin shit after losing all ambition and ability to exist free and on my own, and relying on a person I see as a betrayer to me to continue the meager existence that is my new life of agony? \n\nI don't know what would be going through my mind then. I sure hope I'm better than griffirh. (Note I'm not saying Griffiths feelings are correct, just outlining what they are. They're wretched because Griffith is a bad person.) \n\nMany people don't think straight after an upsetting week, let alone a full year of agony. Now have that person who has lost everything but the ability to painfully breathe and require constant aid and care whinwas ne a very successful and talented person, and offer him not just a full restoration of his health and being, but also the closest thing to Godhood he can imagine? All while being manipulated and gaslit by fellow \"gods\" to join them at his lowest and weakest state.\n\nThe truth to it all is that Griffith did everything wrong, but there's a lot of wrong people in the world who would do the same thing, especially after going through what Griffith did.",
            "Not saying he did nothing wrong, all I say is his decision  was understandable. It was not an easy decision to make. In the end he decided to sacrifice everyone for his sake. U can say that's Evil, OK. But I cannot really hate him just because of that decision & knowing what tortures he went through and his physical condition make me wonder what we would gave done if in his shoes. \n\nDoing what he did to casca was too much though. To this day I still don't really get it. Why was that necessary? Maybe it was a godhand thing. But if that was just Griffith doing it, way out of character imo ngl.",
            "He’s hot.",
            "Because they haven’t really read the manga past the first couple of chapters. Or are lacking in any sort of reading comprehension.",
            "I think it’s a valid point for a few reasons. We’re constantly shown the worst of humanity through berserk, including Guts. By comparison to the atrocities we’ve seen other characters do, he really hasn’t done anything that bad. The only thing people seem to have against him is assaulting Casca and sacrificing the Band; but both of that was after he was supernaturally transformed into a fucking Demon. The actual Griffith rescued Casca from that very situation in the past. And, as much as I like them, the Band did pledge their lives to battle and Griffith. I don’t see it as any different from them dying in some pointless mercenary skirmish (which again, Griffith seems to have done much more than any other military leader to try to prevent needless deaths).\n\nHe is my favorite character and I guess my reasoning relies on separating Griffith from Femto, but even then I acknowledge he didn’t do *anything* wrong; he has flaws, but I don’t hate him like most the fandom seems to.",
            "he’s chill",
            "The situation could've been avoided if Guts didn't let his insecurities cause him to leave the Hawks. Griffith was just trying to sound cool for the princess when he made that speech about friends.",
            "I came here to dislike all those who were about to defend Griffith, but majority of people don't support this statement.",
            "It not that he did nothing wrong but most people misinterpret Griffith because they didnt read the manga, only watched Youtube shorts or learned about Griffith from their oversensitive friends\n\nThe worst thing he did was S.A. Casca and the Princess, but most people only mentioned Casca because \n\n1. The Princess wasnt sure if that's how she wanted things to go with Griffith (kinda like Casca)\n\n2. People understand Griffith wasnt all there when he S.A. the princess (kinda like what happened w Casca)\n\nThey focus so much on Griffith they unironically ignore Donovan, Wyald, Snake Apostles and the little insect girl (all involve violence against children) and the Genocidal Rapist Genishka (defeated by Griffith) who used pregnant woman to corrupt their unborn to create demon soldiers.\n\nAs for why he did nothing wrong\n\nHe created a Utopia that is used to protect all humans affected by the actions of Genishka (merging both worlds)\n\nHe stopped needless war between humans and provides a place where they can live happily \n\nHe subjugated the Apostles and forbid them from eating/harming humans. Now Humans and Apostles coexist\n\nQuality of life improved for every survivor in midland, and it only cost 30-50 soldiers...\n\nThe end justifies the means",
            "Because they are jealous at a point they want to replace Caska in the Eclipse. That's the reason. Those will be branded in the butthole.",
            "Don't engage with trolls and edgelords. Keeping this question alive only gives them validation.",
            "My man was just following his dreams. Well, there was a price he had to pay but the past is the past and today is a present.",
            "Because he's a lil pookie bear",
            "He was a puppet of causality at the very worst.",
            "I dont think he did nothing wrong but i understand why he did what he did\n\ni mean, it’s like this. If griffith stops here and dies, then all the soldiers that died for him already, died for nothing \n\nMight as well finish the job and go all the way through. Its all or nothing for griffith, he doesn’t do “yea its good enough i guess”\n\nAlso, they weren’t just throw aways soldiers like someone might think griffith saw them as\n\nHe gave a shit about them, since the sacrifice demands someone you love/care about",
            "Zodd killed Griffith if he don´t had the behelith. Griffith sold his friends to gain more power. Maybe he sold his mother to the gypsy for the behelith.",
            "Griffith did nothing wrong,  because the actions that happened were all caused by Femto. Yes,  Griffith did submit to the God hand by saying \" I sacrifice \" but at what end?  Griffith thought he was only sacrificing himself, which at that point... the husk of his body to become something more,  was alluring.  Femto SA casca, Femto SA the princess,  Femto is in complete control of Griffith and uses his body and mind like a parasite. \n\nSo did Griffith actually do anything wrong?  My answer is maybe.",
            "That’s the image someone needs to edit to put in a pack of Mentos, then play the music and cut to the eclipse.",
            "Its a meme. People are memeing . They dont mean it seriously.",
            "You cowards! He betrayed his friends, I don’t give a fuck what he said to Charlotte.",
            "To play the devils advocate… because he was just as bound by causality as everyone else?",
            "It’s a meme to piss people like you off\n\nGrüße ",
            "Only thing I ever had an issue with was what he did with casca, other than that, fair game",
            "Well, i am not a troll and i am really on the side of griffith. To say he did nothing wrong is a bit much, but i think he had less of a choice. I think the loss of Guts hit him incredible hard. Guts were his only real friend and not just that he left him behind but also he looked at him full of pity after they rescured him after 1 year of torturing. \n\nI think Guts is not \"the good guy\" in this stoty and Griffith is not the bad guy either, it's not that simple and that's what berserk makes such a great story. \n\nGriffith did a lot of good decisions for the falcons, he even went in bed with that gross king to get the support without his men being in danger. \n\nIn the moment before the eclipse begun, he was about to kill himself, Blood hit the Behelith and his friends came close to him while he wanted to shout them to stop - but he couldn't. \n\nWhat happend was destiny, deep unchangeable destiny, it couldn't be any different from the moment he got the crimson behelith. There were no mean plan of him to lead anyone in this gruesome fate. I doubt that he was fully aware of what exactly will happen - but he might got the idea and that why he wanted them to stay away, but everyone came to him when the blood hits the behelith.\n\n  \nWell, what he did then to casca is nothing what i want to defend and i think who sais she enjoyed it might be really a troll. but I think griffith this this maintainly to punish guts. In this moment he was no human anymore. it was not griffith, but femto. You can not turn to one of the godhand and expect to have the same point of morality like before\n\nCascas position is difficult as well, there was a moment of decision, right after they rescued griith when she could decide to  go with guts or stay with griffith and take care of him. She couldn't left him. She choosed to stay with griffith and it was this moment of pity which griffith saw.",
            "Because he has a dream that he wants to achieve no matter the cost. If some suckers get killed in the cross fire it was their fate. No skin off his nose, fuck it.",
            "Condemning his loyal soldiers to a brutal and painful death to satisfy his private selfish ambitions, betray bff and rape his girlfriend. Yeah, wholsome guy.",
            "Griffith said he’s sorry already🙄🙄",
            "NOOOOOO NOT THIS QUESTION AGAIN NOOOOOOOOOO",
            "Because Casca liked it and wanted that purple eggplant all along.yeah that is the truth",
            "This is literally a meme.",
            "every human presented with the same choice would do as Griffith did.",
            "He did nothing, he doesn't exist it's just a story (a really good one tho)",
            "They are Griffith's meat riders.",
            "The people who think that gay Griffith did nothing wrong should to be his sacrifice",
            "They are just cringy edgelords or creepy fangirls...",
            "Its pretty smelly in here",
            "Figured the trolls wouldn't see a problem with Griffith's shenanigans",
            "I want to end the jokes and stop the trolls",
            "This comment made my behelit cum.",
            "\"nothing wrong\" enjoyed it",
            "The comment is made by skull knights sword's cum",
            "Thousands willingly followed him for his dream and couldn't live without it. They were ready to die each time they would step into the battlefield. So what's the difference if they die by enemy blade or by mine?",
            "Sounds like they did nothing wrong then",
            "Femboy ❌\nFemtoboy 👌",
            "That does help, ngl. How can you stay mad at that face?",
            "Griffith sacrificing band is still justifiable somehow. But whatever he did is Casca is not. Its like her own god raped her. Casca lost every single thing in that eclipse.\n\nSo even if anyone justifies Griffith making world as better place, stopping wars and new world with collateral damage of sacrifice. They can't justify Griffith's action towards Casca",
            "He did it because he hates Guts for supposedly ruining his dream by leaving him to follow his own destiny. He knew Guts and Casca were a thing and he wanted to hurt Guts by that act.",
            "Way out of character? Imo it sounds like you don't understand his character. I agree that ultimately his decision of whether to sacrifice his band to regain his strength and ability to chase his dream, after a year of torture that left him completely disabled, would be a difficult decision for most people. At that point he didn't have any good options, although, I think in the moment where he said \"I sacrifice\" he was getting pleasure from the idea of sacrificing all of his friends for his own gain. It would be a difficult decision for most people and is somewhat understandable, but Griffith isn't like most people. He was gleeful in his decision.\n\nHe did what he did to Casca not because his heart was frozen when he became Femto, but because as a human what always mattered most to him was having power and control over other people. It's why he hated Guts for leaving him, it's why he slept with Charlotte, and it's why he taunted the king leading to his year of torture. He tried to force himself on Casca once already, in the wagon. It was revenge on Guts and a way to establish his sense of control and power over both Guts and Casca. Which is totally in character for him. Imo at least",
            "He wanted Casca and he wanted Guts and he wanted the life that they may have had together for himself. He perversely stole everything he could from them because he wanted what they had. That’s all it is. He wanted, wanted and wanted. And he took it. That’s all there was. We can argue its symbolism but that was his pretense. ",
            "Except Griffith did try to force himself on Casca when she was fixing his bandages -- he was just too weak. As Femto he merely gets to act out the desires he had before; which include finishing that moment.",
            "Fr griffin is just on his ninja way",
            "Regarding the last part, “the ends justify the means,” we actually have no idea what the end game is here. He also brought the interstice, where fear and the realm of demons live, into the physical realm. Thus being the reason for need of Apostle protection and Falconia. We merely witness the *means* and draw from that",
            "very beautifully well put.\n\nGriffiths actions are ugly and complicated in a way that is meant to challenge us as readers.",
            "Fuck him no one needs the sorry",
            "I am not sure. Although not justifying. They maybe  put them selves in Griffith shoes while tortured. Although for selfish reasons ,he wants to unite the world, which is a good goal. \nhttps://youtu.be/QgZ8EdT5Bao?si=SEvxA3SzxR_T0h6i",
            "\"Every human would rape close friends, if they could\"\n\nAre you okey? Do you need help or did you just never understand what this statement is about? Let's just ignore the fact, that you would kill all your friends and everyone who is close to you and focus on this one thing.",
            "This.",
            "bro griffin is a chill dude",
            "this made me laugh more than it should've have. great work",
            "Ask rickert",
            "It was worse than that, if we judge Griffith by the same standard Griffith uses to weed out acquaintances from friends and equals.\n\nHe let another man stand between him and his dream and allowed himself to be consumed by the dream of another man.\n\nHe couldnt fight that man and as a result he lost everything he was working so hard to accomplish and thisbincludes the sacrifices made by his mercenary band and even his own when he gave up his sweet sweet cheeks to feed his army.\n\nAnd to add insult to injury, said man abandoned him without explaining why despite Griffith telling him and showing him that he cared for Guts and respected him as an equal",
            "And to alter their child.",
            "I sometimes wonder, was it an attempted rape in the wagon, or just him trying in desperation to finally return her prior affection in his destroyed state, and was her rejection with a platonic hug part of what fueled the rape as Femto?",
            "He was psychologically damaged from being tortured for a year straight and the influence of the godhand at that point. And I’m still willing to admit that was egotistical of him, but again, far from the worst we’ve seen in berserk.\n\nHonestly I think that was more about him just wanting the past back more than anything, he knew casca was into him and wanted to feel that again. Not defending it, just saying. I think that’s part of the point of Femto doing it too, a dark inversion for his ascension.",
            "Griffith wanted his own kingdom. that was the end goal.\n\nGanishka turned into a 8.6k meters tall behemoth, it had to be done",
            "It wasn’t Griffith who raped Casca, it was Femto who is not a human and never was. Griffith was dead by the time of casca’s raping. You are completely wrong taking Femto’s actions as Griffith’s.  \n\nRegarding the sacrifice, I am confident to say that every human given the choice to abandon mortality and become a higher being, would do so without looking twice at the price he/she has to pay.\n\nAnyone of those who were given a behelit ever turned down becoming an apostle. Then again, Griffith did nothing wrong, for every human would do the same.",
            "Basically it's two guys not telling each other what they really mean or want..because guys don't talk about these things to each other.",
            "I also differentiate between griffith and femto but this doesn't work here, because the majority doesn't, not even guts does. \n\nI also don't differentiate them as two completely separate beings, just as an altered being. Griffith also tried to force himself on casca befor the eclipse but wasn't able to do so. Him raping casca was a direct consequence of what Griffith wanted to do.\n\n\"Griffith did nothing wrong\" is especially used by people who defend rape. If you want to be be associated with those, then this is on you. But as I said, if you think killing all your loved ones isn't wrong, then there isn't much to talk about. Don't apply your own standard onto others, apparently you would have done the same but that's just it. The statement \"griffith did nothing wrong\" is wrong in itself.",
            "Lol yeah",
            "Well I do consider Femto and Griffith as completely different beings, even if Guts nor the majority here does not, because I think that was the autor’s intention all along.\n\nYou think Femto raped Casca because Griffith wanted to force himself on her? I think Femto no longer feels any kind of lust and the raping had absolutely nothing to do with earthly desires. It was him testing the reach of his newborn being, exploring how far could he break into humans idea of evil. He raped casca just because he could, and that has nothing to do with how wrongful raping is for us humans. \n\nI think that if any of us, you or me, were given the choice of leaving our mortality behind, we would take it. No matter what were the cost. If you say you wouldn’t, I think you are either lying to me or to yourself.",
            "Well okey this is just sad. I hope you are just 15 or something like this.\n\nThis really shows why people who defend griffith are indeed problematic in social matters and not just some trolls."
        ]
    },
    "It’s enough to make a grown man cry": {
        "title": "It’s enough to make a grown man cry",
        "score": 1248,
        "url": "https://i.redd.it/ahf35053ly7d1.jpeg",
        "content": "",
        "num_comments": 54,
        "comments": [
            "\"moment of glory: end\"\n\nyikes",
            "just stop reading here, it's all downhill after this",
            "\"we are gonna get so much pvssy tonight bro\" - Nuts",
            "That smile…that damn smile….",
            "It's really the Calm before the storm.",
            "The amount of hatred this panel makes me feel is incapable of being put into words",
            "One last dance before the end.\n\nOne thing that just hit me is that, at this point, neither of them were who the other thought they were.\n\nAs in, Griffith thought Guts would be an obedient lackey doing his dirty work forever, which of course he wasn't, and Guts thought Griffith was an honorable guy worth fighting for...**which he wasn't either.**",
            "Despair ",
            "Crazy that the story ended right there and was never continued :')",
            "Would",
            "The cannon good ending",
            "this is the part where you close the book and go to sleep",
            "I’m a grown man. I cried.",
            "it was too perfect :(",
            "It’s not fair man, we were so close to something wonderful…",
            "Moments before disaster",
            "Celebrating Pride Month by posting the gayest couple in fiction",
            "well, now let them kiss (?",
            "Never felt more betrayed than revisiting this panel…",
            "Looking at these two, one would never suspect that one would turn into the most hated major antagonist of the series.",
            "That subtitle right there hurts so much",
            "Why do you have to remind us?",
            "Man…the end of the happy days",
            "Just guys being dudes",
            "I'd love to have the option to see what it would happen if Griffith didn't use the behelit and instead just continue the journey with the band",
            "Yes",
            "The deep breath before the plunge",
            "enough to make a grown man get all his friends killed",
            "You think this'll make you cry?  I feel bad for future you o7",
            "I just envision Guts stabbing Griffith in every scene they’re in together",
            "And they lived happily ever after",
            "Exactly what went through my mind when I got here. I was like \"oooh that's ominous\"",
            "Ah, yes, the good ending",
            "Seriously. The first thought that came to mind was “it’s the beginning of the end”",
            "And they all lived happily ever after.",
            "“How many girls you gonna talk to tonight?” “ALL OF THE-“ (sitting alone in a corner)",
            "Sadness for me :/",
            "You don't sacrifice yourself in a battle for just an obedient lackey :/",
            "Okay no, as poetic as it sounds, Guts didn't thought Griffith was an \"honorable man\". Quick the opposite given Guts is one of the only member of the Hawks who knew the dark side of Griffith.",
            "Me too man, me too",
            "Wanted to share the suffering",
            "Aaand I burned the remaining volumes. I can live with this ending bye",
            "Griffith became King, Guts was his Grand Marshal, Casca his Viceroy. Judeau was his Spymaster. Pippin is leader of the Kingsguard. Corkus openned up his shop after retiring from the Hawks. Rickert ended up as a Da Vinci-like inventor with the help of Godo. Gaston became the Commander of the Scouts. \n\n>!The Eclipse still happens when Griffith sacrifices Guts to stop Ganishka's invasion. Skull Knight rescues Schierke and Isidro, who were caught in the conflagration !<",
            "Guts marries his sword",
            "What about side by side with a friend?",
            "Which is why Guts was the catalyst. \n\nGriffith, for as much as he wanted to think of Guts as a lackey or pawn, deeply cared for Guts. So much so that Guts leaving made him spiral.\n\nNot to excuse what he did at all, but Guts was the one person to make him forget, to make him ok with never reaching his dream....he's the one person who, not being his equal, wasn't a deal-breaker for being his friend. \n\nIn this panel I see Guts, happy Griffith got what he wanted, but ultimately unfulfilled, and Griffith happy that his friend got him to where he was, having no idea Guts felt how he felt. \n\nIt's ultimately tragic because there is an outcome here where Griffith gets what he wants and so does Guts, but it's never discussed, neither think they can.",
            "Are you talking about the Zodd fight? I do concede that he risked his life but in my view he did it because he thought they could kill him. If Griffith truly knew how invulnerable Zodd was, he might not have risked his life to that degree, that's my view anyway.\n\nIf you're referring to something else then by all means.\n\nI said \"obedient lackey\" because that's what Griffith seemed like he wanted when he was furious about Guts leaving and he was even willing to kill him rather than let him go. A friend doesn't do that and even if he wasn't a friend (which I mantain he wasn't considering his speech to the princess) if he even cared a little bit about Guts then he wouldn't have considered doing that.",
            "Who was top and who was bottom in Guts and Griffith's marriage?",
            "Well he saw all those bodies Zodd left behind. He knew that even Guts couldn't stand straight after meeting that monster. I actually think that Griffith didn't think at all at this moment, he just went for it, because it was Guts who he was so eager to protect. Any sane commander, especially the one who seeks only his dreams, would leave the scene, yet he was ready to die only for Guts alone. \n\nI just don't think he felt nothing towards Guts. And i also think that fandom is too trusting about something Griffith says. He once told Casca that he didn't make his dying comrades follow him, yet he's self harming. He tells Charlotte that nothing is more precious for him than his dream, yet he completely abandones his dream when it's Guts we're talking about, he's ready to die, that's what i call abandoning a dream. People don't usually say as they feel. I personally think he wanted Guts to be just a soldier to him, but never achieved this want. You can see it in every little scene with them, even in the page OP posted: there are so many people around Griffith, noble, rich, powerful, but the one he's looking and smiling at is Guts. This is literally the last time when he smiles to someone sincerely with sparkles in his eyes or whatever. You won't see it again in the whole manga. Just a little fact i noticed. \n\nMaybe it was too long, sorry, i just think that we often underestimate Griffith before Eclipse. He's scary and cruel, but he is a human, who seeks compassion and  acceptance even in his own cruel doings. Because it is a  human nature. Look at how he asks Guts (after murdering the queen): \"Do you think I'm cruel?\" And Guts just casually replies something like \"Nah i get it, I've done worse\", and just look. Look into his eyes. He hates himself for his comrades' deaths, for Gennon, for everything, and Guts just accepts him. Not Casca, who got scared as hell at the sight of Griffith's breakdown after Gennon, not anyone else. This is one of the reasons why they formed such a strong bond. \n\nAnd, i mean, how can we even consider that he never cared for Guts after \"You are the only one who made me forget my dream\" monologue? Sure Femto-Griffith is a senseless jerk. But before he was Femto, he had feelings, he was just a person, who wanted to be strong enough, but was made weak by Guts and their friendship (and maybe something more). This is why at the Eclipse we see his \"last tear\", as he loses his human nature, and this is why all that Griffith and Guts duo is so tragic.",
            "Griffith is top Guts is bottom obviously",
            "I agree with this, and that's what makes the showdown where Guts beats Griffith and leaves so tragic. If Griffith had been willing to speak instead of cross swords, if he'd just said that no matter what Guts heard or thought, they were partners in this thing together to the end, that he needed his best friend at his side, and just asked him not to leave...\n\nThat's all he'd have needed to do. Just be forthright instead of pushing away his feelings and trying to force his will.",
            "While I'm willing to agree that Griffith had \"feelings\" for people, for Guts specially, before the torture/Eclipse, my personal view is that his selfishness, pettiness, callousness and his anger at things not going his way represent much more of what he is than his other more humane parts.\n\nOne of the reasons why I've always thought he was a truly evil man before the Eclipse is his attitude near the beginning of the Golden Age, when Corkus and the other soldiers try to rob Guts. Rather than dissuading them or ordering them not to attack an innocent man, he kept quiet. You could even make the argument that he knew Guts was strong (since he was him fighting in the castle before) and deliberately threw his men to their deaths for a chance at making Guts one of his own. While he got what he wanted, his actions speak volumes as to his character and his morals.",
            "This. If only he spoke to Guts, just said a few effing words to him, _nothing_ would've happen. Well maybe god hand still got to them, blah blah casualty, but the old witch told our skull man that fate is like a spiral and the young aren't obligated to follow the same path. This is so sad chat.",
            "Exactly, it was the defining moment when he could have salvaged everything, but instead moved down the path of destruction we see"
        ]
    },
    "Guts sculpt by me ": {
        "title": "Guts sculpt by me ",
        "score": 45,
        "url": "https://www.reddit.com/gallery/1dlsk9k",
        "content": "",
        "num_comments": 4,
        "comments": [
            "Damn thats insanely good! Will you 3D print it after ?",
            "Judging by the weapon we know which chapters you got it from...",
            "Something feels off with his body proportions\n\nReally like the details though\n\nWhen you zoom in it looks real that's so cool",
            "he’s way too buff and his shoulders are too broad.looks like godfrey from elden ring. not a bad thing tho he looks sick"
        ]
    },
    "Only if Miura added a \"T\" then Guts saying gyatt would be canon": {
        "title": "Only if Miura added a \"T\" then Guts saying gyatt would be canon",
        "score": 36,
        "url": "https://i.redd.it/e0v61i6cz28d1.jpeg",
        "content": "The title is self explanatory (Very skibidi momento guys) ",
        "num_comments": 11,
        "comments": [
            "Miura really fumbled the ball in this one",
            "i sharpied that in on my deluxe edition",
            "The scream is from the snake",
            "Wait does it not show him shooting the snake in his human face? Is the 97 anime somehow more violent than the manga?",
            "My stupid ass thought that's guts laughing",
            ">Is the 97 anime somehow more violent than the manga?\n\n[https://ibb.co/2dznnmx](https://ibb.co/2dznnmx)\n\nNot a chance bro",
            "The opening of the 97 anime was the best intro to Berserk possible, honestly.",
            "Do you laugh by shouting \"Gyaaa\"?",
            "\nI thought Guts laughed more like a villain ish  Gya ahahahahaha type shi here lmaooo (pardon my brainrot. I binged watched the entire skibidi toilet series now)",
            "YOU POOR SOUL, I SHALL TAKE IT UPON MYSELF TO CLEANSE YOU OF YOUR SINS"
        ]
    }
}