{
    "Hall of Fame Post": {
        "title": "Hall of Fame Post",
        "score": 104,
        "url": "https://www.reddit.com/r/BG3Builds/comments/1c2ijd4/hall_of_fame_post/",
        "content": "This post is to highlight many of the more important posts that have been made on the subreddit since the game released, as well as important outside resources:\n\n&#x200B;\n\n# Basic Mechanics\n\n- [30 minute video by Mortismal Gaming on Combat Basics](https://www.youtube.com/watch?v=EjGMn3e3NVo)\n\n- [Dice Rolls page on Community Wiki](https://bg3.wiki/wiki/Dice_rolls)\n\n- [Commonly Confused and Misunderstood Mechanics](https://www.reddit.com/r/BG3Builds/comments/1b4cogh/commonly_confusedmisunderstood_mechanics_for_bg3/)\n\n&#x200B;\n\n# Quality, completed build compendiums\n\n- [Completed Builds Post](https://www.reddit.com/r/BG3Builds/comments/169s082/completed_builds_post/) (please add any detailed, completed builds you may have developed here)\n\n- [Presitious\\_Juice341's Party Building Templates](https://www.reddit.com/r/BG3Builds/comments/190r158/bg3_party_building_templates/)\n\n- [Gamestgy builds](https://gamestegy.com/post/bg3/990/best-builds-tierlist) by u/zanuffas\n\n&#x200B;\n\n# Meta Defining Posts\n\n- [Introduction to BG3 Character Building || Frequently Asked Questions](https://www.reddit.com/r/BG3Builds/comments/1b8z4d5/introduction_to_bg3_character_building_frequently/)\n\n- [Introduction to BG3 Strategy](https://www.reddit.com/r/BG3Builds/comments/1bnh5t8/introduction_to_bg3_strategy_eight_mechanics_more/)\n\n- [Top 10 BG3 Broken Items](https://www.reddit.com/r/BG3Builds/comments/1b2ak0c/top_10_bg3_broken_items_a_guide_to_optimization/)\n\n- [A set of short-form guides all grouped together, for the impatient](https://www.reddit.com/r/BG3Builds/comments/1bgmkww/a_set_of_shortform_guides_all_grouped_together/)\n\n- [D&D 5e Rule Changes](https://bg3.wiki/wiki/D%26D_5e_rule_changes)\n\n&#x200B;\n\n# Honor Mode Guides\n\n- [Reach level 4 with no combat](https://www.reddit.com/r/BaldursGate3/comments/18ebd26/beginners_guide_for_bg3_no_fighting_to_lv_4/)\n\n- [Reach level 5 in Solo Honour Mode video guide](https://youtube.com/watch?v=V8FAlhpfQ9s&feature=youtu.be)\n\n- [Thorough, Act-by-Act Honor Mode Guide](https://www.reddit.com/r/BaldursGate3/comments/18of2fz/bg3_honor_mode_indepth_guide_for_act_i/)\n\n&#x200B;\n\n# Helpful Tools (also found on sidebar)\n\n- [Build Planner by EIP Gaming](https://eip.gg/bg3/build-planner/)\n\n- [Unique/Missable Item Checklist](https://gamestegy.com/bg3/checklists)\n\n- [Compendium Spreadsheet](https://docs.google.com/spreadsheets/d/1719aXUG7qLN3oRBIMaMpLUujKazSMYczmBLem52wWdM/edit#gid=233885691) by u/Yuri_the_Avocado\n \n&#x200B;\n\nPlease let me know if there is anything you feel should be added. Specific, one of a kind builds will not be added.",
        "num_comments": 19,
        "comments": [
            "I'm not really good at searching and linking threads but there has been a few Honour Mode guides that helped me prep for my run. Great builds are nice but advice about handling money, taking it slow, and learning the importance of not trying new things really made a difference for me.\n\nCompilations of people's failed HM can also help avoid silly mistakes.",
            "Not quite on this sub but on the related one, the HM in depth guide made my run (and I suppose many others) possible.\n\nhttps://www.reddit.com/r/BaldursGate3/comments/18of2fz/bg3_honor_mode_indepth_guide_for_act_i/?rdt=49479",
            "Nice!",
            "I hadn't seen those Gamestgy builds before.  Much higher quality than I've seen on other similar sites.   But u/zanuffas, I have a question:  I didn't see any Druid builds or Druids mentioned for multiclass dips, and they similarly aren't on the class Tier list.    Any specific reason?  Or just a finite amount of time sort of thing?",
            "I think [This previously pinned post](https://www.reddit.com/r/BG3Builds/comments/1bgmkww/a_set_of_shortform_guides_all_grouped_together/) was very nice and am not sure why it got taken down after such a short amount of time.",
            "oh my god, Please forever keep this pinned!",
            "For the last category, I found https://mapgenie.io/baldurs-gate-3 to be pretty useful.\n\nI discovered it thanks to the act-to-act honor mode guide.",
            "nice!!",
            "I have seen a good few Honour Mode Advice posts but didn't think to include them here. Thanks for the recommendation, I'll add the category and add 2 or 3 posts tomorrow (open to comments recommending posts people found useful).",
            "Hey, its just that i hadnt touched druid much in my playthroughs :D so i refrained from adding them in tierlists before testing them :)\n\nI do have plans for these builds of course, but dont have a timeline yet. Cheers!",
            "Thanks. I added that. I had even responded to a message by the post author and let them know I was going to add this. Then forgot.",
            "There's a long 4-part post somewhere with a pretty efficient HM walkthrough. I followed it until level 5 and it was good.",
            "Heh,  okay so not some deep-seeded hatred or fear of Druid's then.  It was very curious, since everything else was so thorough.   :)\n\nVery nice guides, that seem to cover most of the powerful core builds I've seen around, and at good level of detail.    Wish I'd known about them earlier it would have made sharing core build ideas easier.",
            "Thanks! I plan to jump back to BG3 at the end of the month as i have a long list of builds to cover :D\n\nCheers!",
            "Well, here is my first druid build - [Land Druid](https://gamestegy.com/post/bg3/1085/land-druid-build). Any feedback is welcome :)",
            "Looking forward to seeing it!  If you remember, ping me when they go up.\n\nI've been repeatedly shocked by how strong Circle of Spores is.  Probably has one of the smoothest leveling curves in the game.\n\n* Early game it can do respectable damage from the +1d6 necrotic bonus dmg  from Symbiotic Entity, so for instance with Drow for dual handcrossbows or a small multiclass dip for proficiency.\n* Shillelagh means you can be okay at melee without needing to invest in STR or DEX.  And weirdly can empower some multiclass SAD martial or gish builds, because BG3 has a quirk that changes Shillelagh into using the new casting modifier of the first multiclass dip that has spells you take after getting Shillelagh. (Oddly is doesn't change on additional dips, making the mutliclass leveling order a bit tedious...)\n* Lvl 3 you get Moonbeam and Spike Growth.\n* Lvl  5, 6 & 7 you start getting Summons and get Owlbear Wildhshape.   BG3 dropped the concentration requirement on summons making them much more powerful than in 5e, but they still suffer the same 5e issues of making combat take much longer and have the added tedium of pathing issues, annoying NPC's etc.  I understand why they don't get as much love, but they're quite strong nonetheless.\n* Owlbear is so strong at these middle game levels that you don't need Moondruid for it to be great.   And having to use an Action on Wildshaping, as compared to Moon Druid's Bonus Action also isn't bad since Owlbear has some reasonably strong bonus actions you can use on the same turn.   Owlbear tanking for a small horde of summons can carry you through most of Act 2 before it starts to drop off due not having Moon Druid's Primal Strike (Wildshape attacks count as magical damage.)\n* Lvl 9 you get Conjure Elemental, which with the concentration and duration removed, is powerful enough to be worth using even if you don't want to bother summons in general.\n* There's an interesting interaction between Armor Agathys and Symbiotic Entity where they don't overwrite each other special effects, so that one can be used to either protect or refresh and preserve the other.  This could make for some interesing builds as either way to keep a high level cast of AoA viable longer using short rest refreshing Symbiotic Entity charges or helping to protect the +1d6 dmg from a low level Symbiotic Entiry Spores dip. \n\nThis all said, I'm pretty undecided on what the best multiclass dips are for a core Spore's Druid, so it will be fun to see what builds you come up with. Overall I think Spores suffers from being quite good a lot of things, but aside from creating an army of summons that most players won't want to use, it doesn't have obvious ways to being exceptional at any one thing.   And a versatile class that doesn't best handle utility functions like Sleight of Hand or Dialogues is in a very strange place.  \n\nMoon Druid I've had a hard time getting into.   I keep hearing how strong they are in the early game, even for Honor Mode.  But when I try it out, the Bear Wildshape has such low AC they get brutally focus fired.   Maybe that's the strength, they absorb all the enemy attacks with their Wildshape Temp HP, letting your team fight in safety.  But if feels like animal abuse.   :)\n\nI'll be really curious to see if you come up with any strong Land Druid builds.  It hasn't gotten any attention here, but feels like the base Druid kit is strong enough, that there should be some potential with the added spell list and being able to restore spell slots like a Wizard.",
            "Thanks! Saving your comment, for future references :D",
            "Take 4 levels of Thief, 8 levels of Spore Druid, and dual hand crossbows - and you get a toned down version of the 10/1/1 swords bard (itemization is near identical) thats really fun and only slightly more challenging. It's very potent and you get all the Druid goodies. With strange conduit you basically have two built-in damage riders every day with symbiotic entity and detect thoughts. With gloves of dexterity and taking rogue first, you can pump your charisma and take persuasion expertise to be the party face and get great deals at vendors too.\n\nLater on add the band of mystic scoundrel and arcane acuity helmet. Start your turn firing off an arrow of many targets - stacking the acuity to 8 or 10 most of the time. Then throw down confusion or hold person with a bonus action. Then you still have one more bonus action to spare :).\n\nLots and lots of fun staffs encounterd throughout the game to either augment melee more or spell save DC more depending on wanting a more martial or caster focus. E.g. throw the staff of the ram in your off hand to stun whoever is left alive or not confused/held after your first turn if you want to lean in to melee more in the late game."
        ]
    },
    "Heat is a terrible mechanic": {
        "title": "Heat is a terrible mechanic",
        "score": 68,
        "url": "https://www.reddit.com/r/BG3Builds/comments/1dloda6/heat_is_a_terrible_mechanic/",
        "content": "Yeah its cool in concept, but in practice it ends up fucking me over. Its drawbacks seem unreasonable considering the lack of drawbacks for lightning charges. I wanted to use flame of wrath from markoheshkir on my fire draconic sorcerer build in order to maximize my scorching ray damage, which seemed like it was worth taking a little fire damage each turn especially because flame of wrath gives fire resistance, but whenever I took fire damage from heat I also took radiant damage from my callous glow ring and gained stacks of reverberation from my belligerent skies gauntlets.\n\nI don't NEED flame of wrath for this build to work, its already strong enough as is, but its frustrating that I cant lean fully into a build that maximizes scorching ray, fireball, and wall of fire damage without getting penalized by a mechanic that makes my own equipment backfire on me. ",
        "num_comments": 13,
        "comments": [
            "Doesn't helldusk armor fix this?",
            "Okay, but not gonna lie that's a pretty funny interaction of enchanted equipment. All the other wizards are giggling at that one guy who used these pieces together and royally crippled himself.  Not me; I'm empathetic. But imagine it in Faerun. \"I've got this sweet set of gear and I'm gong to wreck faces.\" And then it blows up in his face.  It's giving me a chuckle thinking about the risks of magic in much the same way that early game Morrowind has a wizard fall from the sky to his death in front of you. He had created a very nifty Scroll of Icarian Flight that increases acrobatics by 1000 for 7 seconds,  and with it one can leap an astoundingly high and long distance.  But the effect wears off before landing,  and so you die on impact if you use that magic without special care. There's cautionary humor there. \n\nAnyway,  I haven't played with Heat, but I bet you could tinker with your build to get it at least somewhat useful. Best of luck.",
            "Lol the interaction of heat is really really terrible.",
            "that's weird since psionic overload works similarly, but I never noticed that stacking other dmg on it and I used the same ring",
            "The radiant damage sucks indeed. But you really want to use Spellmight gloves (pickpocket circus lady or do Dribbles quest). Helldusk armor will fix it for the most part. But without the reverb gloves, the damage you take vs output is negliable. \n\nIts once per turn. You can burn your heat for more damage.",
            "I thought i was on the tekken reddit for a sec",
            "honestly, it feels like the Heat mechanic is mostly designed for barbarians to optimize with (especially Karlach, who has other ways of doing fire damage with her soul coins, at least in theory). \n\nthe extra fire damage is nice and is relitively straightforward. the \"downside\" effect of taking fire damage is pretty minor and inconsequential except in the case of Rage, where it is an active benefit thanks to Rage making you want to deal or take damage each turn to maintain it. \n\nin most other cases, I have found Heat to be an active hindrance. in my co-op HM playthrough, my friend was playing Abjuration wizard and was surprised when her arcane ward started melting randomly lol",
            "i made a post about all the heat items a few months after the game came out and it got 0 interaction except for 1 comment by a person that just said \"yea lol dont use those items they are trash\"",
            "C'mon bro the mechanic is fine, you just made a mistake with your gear combo. \n\nDon't intentionally do damage to yourself when you're wearing gear that applies debilitating conditions on damage dealt. \n\nBe careful with your concentration spells when intentionally causing damage to yourself as well. Use Bloodlust Elixirs instead of casting Haste on yourself so you don't have to worry about Heat breaking concentration and making you lethargic. Or have someone else cast the Haste.",
            "Seems you don’t know how to counter the self burning damage…\n\nThe heat mechanic is not the problematic, your itemizations/equipment is.\n\nHellduskarmor, or wavemother‘s cloak for example…",
            "Only if you don't have elemental adept:fire\nwhich you want even more than heat on a fire sorc imo",
            "I just finished a run using the 11/1 Fire Sorcerer, I used just a charisma boost and Dual Wielder feat (Markoheshkir and Rhapsody) and still completely destroyed everything from the start of act 2 onwards, I used the Darkfire Shortbow for fire resistance until I got the Helldusk Armor, and after I got the Helldusk I didn’t take a single point of damage from enemies or from Heat for the rest of the game until the Netherbrain fight\nImo Elemental Adept is nice to have, but not at all important to have",
            "Not true you can use it with fire elemental adapt, burning damage will be reduce to 0"
        ]
    },
    "What are the best moments to break your Paladin Oath?": {
        "title": "What are the best moments to break your Paladin Oath?",
        "score": 63,
        "url": "https://www.reddit.com/r/BG3Builds/comments/1dlhcvi/what_are_the_best_moments_to_break_your_paladin/",
        "content": "I always wanted to try being an Oathbreaker paladin without making the breaking act seem minor (like killing the first innocent you see or stealing).\n\nFrom a story-based pov, what are the best moments/decisions making that would make a paladin break their oath without being evil, just a difficult moral choice? The sooner the better, like for Act 1 or 2.",
        "num_comments": 47,
        "comments": [
            "Oath of Ancients breaks its oath by resurrecting Connor for Mayrina, which is a morality testing moment. \n\nOath of Devotion is broken when you kill the slavers in Grymforge, Ward Pistle and Ward Magmar.\n\nOath of Vengeance breaks if you don't punish Madeline at all for Punish the Wicked in act 2, despite her not being \"wicked\".\n\nThese are some of the bigger moral dilemma in the early game for oaths imo.",
            "As Oath of Vengeance Dark Urge I poked Nettie’s injured bird 😔 really learned Paladin is no joke and swore to be better.\n\nBroke Oath of Vengeance AGAIN at Gortash’s coronation but I don’t feel bad about it. It was the wise thing to do in that moment AND I got a super cool piece of dialogue about my past as a Bhaalspawn Paladin with the Oathbreaker Knight.",
            "I broke my oath (ancients) by sneak attacking Balzathar. I get that sneak attacks are frowned on from an honor perspective but like, this is a millenia old necromancer surrounded by undead. I should be able to give myself every advantage to dole out righteous punishment\n What the hell.\n\nAnyway, that's my nomination for a morally correct break.",
            "I did an oath of devotion Paladin and the only time I was really tempted to break it was when deciding whether or not to assist Yurgir in the House of Shar Gauntlet. Morally speaking, you have a choice between assisting Yurgir or assisting Raphael; both are evil devils and you could make an argument that for a paladin, throwing away your life in a battle to help one devil conquer another is not justified. Siding with Raphael does not break your oath, but siding with Yurgir does.",
            "The tieflings watching Lae'zel's cage because you fail a persuasion check",
            "According to the wiki killing the warden in moonrise prison break oath of devotion and ancients, regardless of the methods used. That's the one I'm planning to go for on my run. Breaking my oath to rescue the tieflings again seems fitting.",
            "Oath of ancients, I was sneaking in moonrise towers and killed a cultist guard",
            "I’ve had oath of vengeance broken because Arabella died and I told her parents to basically move on and denied them their vengeance",
            "Oath of Ancients, Act 3, freeing the spawns. No one deserves death for something they MIGHT commit.",
            "I unknowingly broke one of my hireling's oaths by unalivng the slavers at Grymforge. He ended up embracing it. But I have to admit, the Oathbreaker knight is so freaking cool looking,  I'm not even mad about him stalking my camp",
            "Siding with glut and kiling myconid ruler broke mine",
            "Helping sazza in the Grove as oath of vengeance",
            "As a chaotic durge I knocked out Alfira so I wouldn't kill her (story to self was saving everyone from bad singing). This broke my oath, which I wasn't expecting per se. I rolled with it. Subsequent headcanon was I'd stay an oathbreaker after talking to the knight since what he said made sense to my lobotomized self. If keeping an oath meant I couldn't even attempt to use non-lethal means then why bother?",
            "Oath of Ancients is broken by not killing the vampire spawn, worth it imo",
            "Broke my Oath of Vengeance on a Durge run by 'pruning' Gale's hand.",
            "For my Durge run, I broke my oath of vengeance by cutting off someone’s hand (spoiler not working so not saying)",
            "I had my Vengeance DUrge break his oath by killing Steelclaw and the Strange Ox in act 2. Your oath breaks simply from remembering the past and automatically killing the animals during cutscenes. \n\nI role-played that talking to the Warden of Moonrise Towers and communicating with the Absolute through the wall helped me remember more of my past and made it harder for me to control the Urge's impulses. \n\nUnfortunately I don't feel like any single moral dilemma in this game is written well enough to have a dramatic oath break moment. I searched through all the ways to break oaths when I was starting that playthrough and none of them were interesting or immersive to me, so I just role-played that my memories of the past as the DUrge are what broke mine.",
            "Why would the Devotion paladin be punished for killing slavers? Isn't a good act?",
            "Will I lose my Oath of Vengeance if I accept the Hag’s hair?",
            "On the flip side, telling the gnome in the mushroom kingdom you're going to kill the slavers sets up a break point for oath of vengeance if you let them live.",
            "You can break oath of vengeance immediately by killing the tieflings that have Lae'Zel in a trap\n\nEdit: haha oops not gonna lie didn't really read the original post, just assumed OP was looking for an early oath break. My bad.",
            "Did they patch this for vengeance paladins? When I did this quest I had bard and cleric options available and I can’t remember which one I did but I thought I chose the bard option (“when I tell you’re tale you wil be the victim not the villain”) and I don’t remember my oath being broken.  \n \nI do remember doing my SSB urge breaking his oath of ancients after talking to the cat in moonrise and trying to remember more about my past. It’s was kinda shocking in a way I loved thematically for a durge trying to redeem themselves constantly.",
            "This is the best answer. Some answers are just basically \"go full psycho on these specific npcs\" or \"just do something that's significantly out of character RP-wise\"",
            "I was quite puzzled at first on how giving Mayrina the wand broke the Oath of Ancients. I thought I was just giving her the choice on what to do with her husband's corpse (next-of-kin and all that jazz).\nTHEN I realized that meant activating the wand and having a zombie around the world.",
            "I've never punished Madeline and never broken my oath as a Vengeance Paladin.",
            "Is it weird that the thing I hate Balthy for the most is that he stole his name from the monk Balthazar (also his ribs) from bg2: throne of bhaal? \n\nThrone of Bhaal Balthazar was legit. He was basically trying to do the same thing the protag was doing (if you are being a good aligned character, anyway).\n\nHis goal was to kill all the other Bhaalspawn so when the mantle of God of Murder fell to him he could turn it down and kill himself. His goal was to stop a God of Murder from existing.\n\nHe was totally wrong about how things would play out if he actually killed all the other Bhaalspawn but his head and heart were in the right place. If it weren't for us he would have been the world's best chance to keep Bhaal dead. He would have failed but so did we apparently so idk \n\nThen that stupid necromancer fuck desecrates his grave and steals his name.",
            "Oath of Devotion is broken by attacking non-hostile creatures. They aren't hostile. \n\nOaths don't necessarily mean always be good. That's part of the point of the Oathbreaker, sometimes your oath goes against your morality and that can be a reason to break it. That's what the Oathbreaker knight did.",
            "Yes, because your Oath dictates that you have to wipe the blight of evil beings of the world.",
            "That choice made my first Durge run feel so special. I had an Oath of Vengeance against whoever had wrecked my brain. Broke it in a play for power to assist me in that quest for Vengeance. \n\nThen when I finally discovered who had stolen everything for me I paid the Oathbreaker Knight, reclaimed my Oath, and smote that vile wretch while >!my Father, our God!< watched, unable to stop my Vengeance upon them both. \n\nIt was glorious.",
            "That breaks your oath, yes.",
            "You can break every oath there by attacking them. If speed is the name of the game then it's one of the fastest possible.",
            "You can also break vengeance by protecting zazza in the tieflng camp",
            "I wouldn't know, I was relying on the wiki for these. I've done runs as vengeance paladin before but can't corroborate regarding this particular dialogue.",
            "What if you initiate the slavers through conversation when they try to keep the slaves after helping with Nere? It's not like you just attack them out of the blue.You draw a line and then enforce it. Does that still break oath?",
            "This is what I abruptly found out on my honour mode run when attacking Z’rell out combat. It was super unclear though attacking random zealots out of combat was fine but Z’rell is where the line was drawn",
            "Is there a downside to killing these two? I almost always run durge so I inevitably don’t care, and as far as I know you don’t get exp by talking them into leaving.",
            "Maybe it skips the oath broken flag unless you pick a paladin or quest specific flagged choice",
            "Those are different slavers. The two I mentioned are the ones abusing Stickpit, I don't think there is a way to get them to free him without killing them.",
            "I don't think they ever appear again regardless of what you do about them.",
            "Well if you don't care about them and aren't trying to maintain an oath, I suppose it's just having to do a combat. If you don't get exp by talking to then that's the upside.\n\nCan't say I know for sure, I usually spare them but don't always stare at my exp nor do I min-max it besides just doing everything in the acts.",
            "Oh, okay. My bad. Thanks",
            "Is poison the beer break the oath?",
            "Assuming you mean Oath of Devotion, no. I don't think killing goblins ever breaks oaths in general, they are supposed to be evil inherently in the setting.\n\nThat said, you can check what breaks each oath on the wiki. Just check the page for each oath and scroll down, it has Oathbreaking events compiled.",
            "Dnd has a long proud tradition of being totally okay with killing goblin children.\n\nLawful good druid Halsin will chase down and shred those two children for throwing rocks at him.   \n\nKagha tried to hand the entire grove over to crunchy fascists and he let her off with a dressing-down, but those two children, they get the Elisha treatment.",
            "~~Stickshit~~ Stickpit is serving beer for those two duergar, poison the beer cask will kill them",
            "Oh, I don't know if that breaks oath or not. Haven't tried."
        ]
    },
    "Best to worst mono class casters?": {
        "title": "Best to worst mono class casters?",
        "score": 99,
        "url": "https://www.reddit.com/r/BG3Builds/comments/1dldo57/best_to_worst_mono_class_casters/",
        "content": "My opinion:\n\n1. Sorcerer\n\n2. Lore bard\n\n3. Wizard (abjuration wizard might be #1, pretty broken. But divination and evocation at #3.)\n\n4. Cleric\n\n5. Druid",
        "num_comments": 143,
        "comments": [
            "Y'all not just gonna keep disrespecting warlocks like that. They didn't sell their soul just because",
            "Warlock left off because it goes without saying it's the best?",
            "0. Warlock",
            "Imo Abjuration Wizard is the best 12 level dedicated caster in the game. Also Wizards are the only class who can learn Shovels scrolls and late game Shovel is ridiculously OP. \n\nSorcerer can already dish our massive damage as a 12 level draconic fire sorcerer, but needs the multi class to surpass Abjuration Wizard imo\n\nIf we factor in role play it gets a bit tighter because Sorcerer is the better face character, but Wizard isn‘t bad at conversation checks either and absolutely destroys most utility checks.\n\nEdit: I‘d order them like this:\n\n1. Abjuration Wizard\n\n2. Draconic fire Sorcerer\n\n3. Lore Bard\n\n4. the other Sorcerers\n\n5. Cleric\n\n6. the other bards\n\n7. the other wizards\n\n8. druid \n\nYou can differentiate the wizards, clerics and bards further but I‘m lazy.",
            "As a Druid Stan....I completely agree it's down there...\nBut I can Owlbear maul everyone to death and then on my dying breath drop an ice storm so I'm satisfied.",
            "Portent is Vicious Mockery on steroids. \n\nMagical Secrets always felt like the reason to dip Lore 6 or to take Swords to 10.\n\nUnless you're a party face that's concerned about passing the social checks 100% of the time, I'd take pure Wizard over pure Lore Bard any day.\n\nAs for Sorcerers, all they really have is quickened spell.\n\nThe Sorc vs Wiz argument more/less comes down to if you're down with Long Rest Spam, how many spells you forget are Wizard exclusive, and how much you value Portent Dice, Arcane Ward, Empowered Evocation, and/or Undead Thralls.",
            "Between twin haste. Heightened CC, Fire acuity into CC or burst and just doublecast … Sorcerer easily gets this IMO. \n\nI am conflicted about a mono Cleric, they’re excellent in the first two acts, and kinda fall off in the third act in my playthroughs. I prioritize strong single damage later, to take down high priority targets quickly, which pretty much means druids and Clerics always get benched .. \n\n\nI would probably go\nSorcerer/Wizard/Warlock/Cleric/Druid, can’t rate Bards as I always use a sword bard but that’s not exactly caster focused.",
            "Druid is way fun if you play it right though",
            "Sadly I agree that druids (my favorite class) end up last if only casting is considered. Almost all of their spells are concentration.",
            "I think you're underrating Druid and Cleric a bit and overrating Sorcerer. Sorcerer really needs specific items to function well whereas the others don't. Abjuration wizard is just broken, but Cleric is probably one of the best monos in the game. Druid gets a ton of good spells and Wild Shape. Lore Bard is neck and neck with Druid when it comes to control and you get magical secrets. \n\nAbjuration wizard \nCleric \nLore Bard \nDruid\nSorcerer \nWarlock",
            "If you rate druid that low, you've obviously never played one. Land druid gets almost all the good wizard spells plus wildshape and med armor prof.",
            "Mono:\n\n1. Cleric\n2. Wizard\n3. Sorcerer \n4. Druid\n5. Lore bard\n\nWith multi-class:\n\n1. Sorcerer\n2. Lore bard\n3. Cleric \n4. Wizard\n5. Druid",
            "I feel like druid is above cleric.  for me, my guiding bolt etc didn't hit often.  druid has call lightning as a freecast after the first, and with momentum gear it's worth it.  plus owl bear to tank for a bit if you need it.  I'd go:\n\n1. wizard (abjuration)\n\n2. sorcerer (any)\n\n3. druid\n\n4. cleric\n\n5. warlock\n\n  \nI haven't played bard yet.",
            "1. Lore Bard\n2. Hexblade Warlock\n3. Twilight Cleric\n4. Wizard\n5. Sorcerer\n6. Druid",
            "I think Cold Sorcerer is probably 1 with the relaxed spell casting rules vs 5e, the equipment that turns the battlefield into a hockey rink, and armor of agyths for extra chonk. \n\nSecond for me would be Abjuration wizard. \n\nI would probably say Light Cleric 3, but in act 2 they are a close second. \n\nLore bard is also a great choice but you need to figure out what you are doing to shore up defense.",
            "My Opinion: Wizard > Cleric > Bard > Druid > Sorcerer > Warlock. Again this is my opinion and I put a lot of value on support which is why Cleric is so high for me.",
            "Sorcerer  \nCleric  \nWarlock  \nWizard  \nLore Bard  \n  \nDruid (idk, haven't played one)",
            "I love light cleric. \n\nPotion of speed plus two destructive waves absolutely annihilates almost any encounter in the game. \n\nJust did it to Raphael on tactician, basically did one wave for each side of the room (both hit Raphael), and it put *every* enemy prone and did half their health. \n\nDid similar in house of grief, but it just outright killed some people because they’re lower HP\n\nAnd one version does necrotic and thunder so it gets around radiant retort\n\nSpirit guardians, wall of fire and fireball, will get you through so much, and the free disadvantage reaction is bonkers, and the radiant orb gear is amazing. Not to mention a nuke as a channel divinity, and the fact a tonne of enemies hate radiant damage.",
            "Me and my spore zombie horde disagree",
            "Abjuration wizard (solos most encounters)\n\nSorcerer (solos fewer encounters but contributes more damage/control) \n\nSwords bard if it counts (arcane acuity and slashing flourish makes it a better controller than lore)\n\nLight cleric \n\nEvo wizard\n\nDivination wizard \n\nOther clerics\n\nWarlock\n\nLore bard\n\nSpore druid \n\nLand druid\n\nCutting words is great in tabletop. But arcane acuity with scorching ray and even eldritch blast turns everything on its head. Equip one item and get a better version of the entire reason someone would play lore. The only reason I put lore bard above druids is counterspell.",
            "Worlocks are great.\n\nThey are the best class in early game, just spam eldrich blast and you’ll do great. Many other classes take a few levels to really come online but worlock is great from the start. \n\nthey have devils sight, which allows them to see inside the spell darkness (the only possible way to see in darkness) you can cast darkness on yourself or shoot a darkness arrow at your feet, now no one can see you but you can see everyone.\n\nAnd they have hunger of hader, the best spell in the game. (No really is there a better spell then this?)\n\nAnd their spell slots replenish on short rest.",
            "While Druid has a very restricted spell list, they have an op ability in summons. \n\n\nMy spore druid with the right gear and access to bodies can summon 4 spore zombies, 4 skeletons, 4 ghouls from necromancy of Thay, 2 minor elementals, 1 woodland being, 1 fallen lover & a major elemental maybe a Myrridon, Shovel, and us \n\nThat's 19 summons from 1 druid. I can have 1 other druid summon 5 more summons while still being circle of moon. \n\nThat is broken as shit. Not to mention my spore druid has up to 48 bonus hp at level 12 and a bonus necrotic damage to all weapon attacks.",
            "Classes as a whole?\n1. Sorcerer\n2. Cleric\n3. Bard\n4. Wizard\n5. Druid\n\nClasses by best subclass?\n1. Wizard (Abjuration) \n2. Cleric (Nature, maybe the most underrated subclass in the game)\n3. Sorcerer (Draconic?)\n4. Bard (lore)\n5. Druid (spore?)\n\n\nClasses by performance at the hardest part of the game (early game)?\n1.) druid (Access to spike growth, best early game durability, bonus action resource free web in spider form)\n\n2.) cleric\n3.) bard (no magic secrets yet)\n4.) Sorc (resource issues early game)\n5.) Wizard (abjuration gets more insane at level 5+)",
            "I'd go with the following:\n\n1) Lore Bard\n\n2) Wizard\n\n3) Cleric\n\n4) Sorcerer\n\n5) Druid\n\nThe reason why I rate Sorcerer so low is because Mono Storm and Mono Wild Magic is a very squishy/basically a glass cannon due to it's lack of armour. You can negate this issue by going human, but then you will be needing scrolls and elixirs of Darkvision for segments like the Underdark until you get the transmuter stone.\n\nMeanwhile, Druid spell list in this game is dog shit in this game. Too many save or suck spells at low level.",
            "Why is Lore Bard better than Swords Bard? The 2 top builds take 10 levels in the latter, and I've never seen somebody suggest Lore Bard since the game was in its infancy.",
            "The druid disrespect is insane",
            "Sorc is number 1 and everything after that is arguable imo",
            "What is good about mono lore bard?",
            "You left out eldritch knight, ranger, arcane trickster rogues",
            "fighter should be on this list imo. Maybe not #1, but 3 attacks per action is nothing to sneeze at.",
            "Idk I think 2 life cleric 10 lore bard is the best support in the game. Wouldn’t consider 12 lore bard better.",
            "My first time completing the game was straight 12 Tome Warlock. Still the most fun I've had in the game.",
            "Nah it's out on a technicality. CASTer implies spellCASTing which is nowhere to be found in the words pact magic",
            "All the warlock builds are multiclassing. It's so much fun mono and so damn good.",
            "To be fair, they included only full, normal casters. That said I’d agree warlock is dope and hands down the best class in the first few levels",
            "My level 4 Wyll only does 1 to 10 damage with his Eldritch Blast.   I assume it gets better soon?\n\nThanks",
            "If you're going full Warlock it's probably blade which is more so martial",
            "Bro didn’t even include Warlock. LUL",
            "My dude, you don't have to be a wizard to get the summon Shovel spell. Warlocks, sorcerers (other than storm) and wizards get the ritual spell by choosing the right dialogue options with Shovel and the mirror. If she calls you spellshite, you get the spell as a common action.\n\nThat way you can double up on Shovels: have Gale learn the spell, summon her, then talk to her after going through the mirror with a char that has at least a level in warlock, sorc or wizard. I even gave my Astarion origin a temporary level in sorc to give him a surprise machine.",
            "This guy has knowledge.\n\nI would add warlock above druid under wizards",
            "Honestly, in terms of brokenness you can easily break Sorc since meta magic is absolutely broken and scrolls also exists within the game so anyone can pickup the wizard niche of casting a large variety of spells.",
            "Sorcerer and Warlock can also get shovel. And all 3 can get it simultaneously, currently my Gale and my Warlock Tav both have Shovel’s spell which lets me have 2 Shovels on field. \n\nYou need to first have a wizard learn Shovel’s scroll then have a sorcerer or warlock talk with shovel, a few dialogues later they can summon shovel as well. Its has been a while so I don’t remember which specific dialogue(just keep praising Shovel) so you might have to reload your save a couple of times and remember the option to get Shovel is only available to a character the first time they talk to Shovel.",
            "God, I have tried multiple Druid runs, and they just don’t have great spells. Level 1 spells are basically all mediocre, level 2 has some pretty good ones (moonbeam and spike growth being two great grabs, but spike growth being the better pick and available on ranger really hurts), and so maybe the subclasses really help. Spores are a glorified 1d6 Necrotic on weapon attacks, so a Monk or Fighter damage rider, tied to temp HP, tied to Wild Shape Charges, with some casts of Animate Dead thrown on. Circle of Land is just Wizard, but worse. And then we have Circle of Moon, which comes online pretty early and is super strong the rest of the game. Except you spend 95% of your time wildshaped, so a lot of RP characters either lose a lot of their potential, or lose aspects of their RP.",
            "Shovel ? The little quasit ? I Always found him useless what's OP with him ?",
            "What's OP about Shovel?",
            "I am playing a sorcerer, but just got Halsin, not sure which class is more fun to play. Circle of the moon druid is awesome",
            "*Coughs in twinned haste.*",
            ">Lore Bard is neck and neck with Druid when it comes to control\n\nLore Bard is neck on neck with nobody when it comes to control because Lore Bard is hands down the best control caster in the entire game and that even before adding gear bonuses I’d argue.",
            "Druid’s great but even after playing with one it can’t outperform any of the other classes, which speaks to the strength of the casters. I love Jaheira as my land druid but it is up against all of the best casters which is why I think it’s that low. It has great terrain altering CC with spike growth, plant growth, sleet storm etc, but is desperately missing the single target burst damage (sorcerer, evocation wizard), or  CC spellcasting ability (sorcerer,lore bard, divination wizard) that the other casters get.",
            "Druids need a multi class to be great. Without it they are meh.",
            "This is the way. The cleric is top tier. Best caster, great martial (depending on spec), and great support.",
            "Lore bard is so far ahead of Druid it’s crazy. Cutting words alone puts it on the top not even counting in magical secrets. Cleric is for sure not number 1 unless we are taking pure support and even then I’d take a lore bard.",
            "What would you multi class for lore bard?",
            "If you value support then why is Sorcerer so low?\n\nTwinned spell + Haste is one of the most potent combinations in the game",
            "Warlocks are very strong.\n\nBut would easily take counterspell, haste, spirit guardians, hero's feast, globe of invulnerability, command, and glyph of warding - sleep over HoH.",
            "out of curiosity why Nature?",
            "I was so excited to try Druid. Cast my first spike growth and the goblins just jumped right out of it and I was like welp",
            "Druid is literally the best early game caster. Having shillelagh and flame blade in act 1 and plenty of control spells makes it fantastic in the late game. As long as you have a means of pushing the enemies back into your control areas, you’re golden. Not to mention the plentiful summons to boost your damage.",
            "Just get a hireling (or Gale if he's not in your party) to cast Darkvision each day, easy.",
            "You can literally use the lighting charge clothing with bracers of defense and duel wield to reach a respectful AC of 17-18 in act 1.",
            "What are you even talking about.  \nEvery caster in the game has the same AC in cloth in this game.  \n\nAt most there is 1 AC difference between Dual Wield or Shield usage",
            "As a pure spell caster Lore Bard blows Swords Bard out of the water.\n\nLore Bard controls the entire battlefield, mitigates damage for the entire party and debuffs enemies.\n\nSwords Bard is mostly for single target control and very high single target damage. Most people play with arcane acuity and band of mystic scoundrel to attack - hold person - attack for massive crits with swords Bard. \n\nI personally think that Swords Bard is the best Bard class in the game, but as a caster Lore Bard is better if that makes sense.",
            "Cutting words and the overall spell list is amazing.\n\nStill wouldn’t put it above Abjuration Wizard.",
            "Bards are a great chassis, with conversational and rogue skills. They're full casters with a decent spell list. \n\n\nFor Lore Bards in particular, inspiration is already great, but being able to use it offensively is terrific. Magical Secrets also lets you grab from other spell lists, to fill in gaps in what a bard can do (e.g. Shield or Counter Spell or direct damage).",
            "Fighter is not even a caster, wtf are you talking about",
            "What spells did you take? What made it so fun?",
            "Warlocks are too much fun and come online almost right away(level 2) and just get better.",
            "Why is a Warlock not a full normal caster?  Thanks",
            "Respect him with Withers.\n\n\nAt level 2 select Agonizing blast, it's amazing.\n\n\nAlso the reason Warlocks aren't considered full casters is because their spell progression is very different to every other full caster. They're their own thing.",
            "Level 5 is a huge step up for Warlocks. Hunger of Hadar then Elgritch blast with agonizing blast and repelling blast is a powerful combo.",
            "Eldritch blast isn’t very good early game.\n\nAt lv 5 you get a second ray\n\nAt lv 10 you get a 3rd ray.\n\nHex will add d6 necrotic damage on an enemy its cast on\n\nAgonizing blast adds your cha modifier\n\nPotent robes adds your cha modifier again.\n\nIn act 2 you can temporarily boost your cha modifier +5 with shars blessing. If you take a +2 asi to cha at lv 4 you can have 24 cha which will be - minimum of 15-25 damage per ray.\n\nAnd then spell sparkler/radiant rings/reverberation equipment. \n\nThat whole setup makes Eldritch blast quite decent. It has good cc too since you can knock enemies prone, fear with mortal reminder on crit. Etc\n\nUntil lv 5 I use Ray of frost on a sorcerer.",
            "https://preview.redd.it/mynu4pgjjz7d1.jpeg?width=1079&format=pjpg&auto=webp&s=fa45156ab8b49fdc651f9e1f597c164d9ac9476e",
            "Prepare for Shovel.... and make it Double",
            "I have way too many hours in this game 💀\n\nYeah me too, I always forget that Warlock are Casters. There are some Clerics and Wizards that I would rank Warlock higher than tho (Trickery domain f.e.)",
            "Yeah but no one else can have a free fright surprise and debuff machine as a summon from learning a unique scroll\n\nAlso what breaks Sorcerer is fire acuity. Cheesing meta magic for economy is okay and all, but that’s not where the damage lies.",
            "Yeah but you can’t get shovel LEGIT on any other class than Wizard. You have to cheese and break the game to get him as a Sorcerer or Warlock. It’s not intended.",
            "This has been my experience, too. I’ve tried to play the Circle of Land because I’m not particularly interested in the Necromancy or Shapeshifting elements of the other subclasses, but it feels like a significant portion of the Druid’s power-budget is caught up in Wild Shape. \n     \nMoonbeam and Call Lightning sometimes feel like more powerful cantrips rather than hitting like similar-leveled arcane spells. Yeah, it’s efficient from a spell-slot perspective, but I’m judging them next to Cloud of Daggers and Fireball. And then there are the bonus effects: my Sorcerer was getting +CHA on Fire spells, Gale was adding +INT on Evocation spells, and I never had to worry about “friendly-fire.”\n     \nThe most effective combats with my Land Druid are usually when I transform into an Owlbear, and that just feels wrong. It’s not a weak class — far from it — but I’m not particularly happy with the way it plays. I had unrealistic expectations, but too many of their spells are concentration. I want to Entangle my enemies and set up a Moonbeam when they’re stuck in place; I want to Call Lightning as a bonus action while swinging a Flame Scimitar. Hell, I’d even prefer for the option to have a summoned animal like the Beastmaster Ranger. My Ranger’s pets honestly felt more viable than my Druid when I was trying to use non-Owlbear forms…",
            "You should check out some sabre tooth multi classes.\n\nDruid can be really good, but yeah, as a dedicated class they are meh.",
            "While Druid has a very restricted spell list, they have an op ability in summons. \n\n\nMy spore druid with the right gear and access to bodies can summon 4 spore zombies, 4 skeletons, 4 ghouls from necromancy of Thay, 2 minor elementals, 1 woodland being, 1 fallen lover & a major elemental maybe a Myrridon, Shovel, and us \n\nThat's 19 summons from 1 druid. I can have 1 other druid summon 5 more summons while still being circle of moon. \n\nThat is broken as shit. Not to mention my spore druid has up to 48 bonus hp at level 12 and a bonus necrotic damage to all weapon attacks.",
            "Twin casting haste ain't shit. You can throw a Speed Pot and quadruple cast haste.",
            "Draconic sorcerer +CHA mod to spell damage.",
            "They have basically the same spell list until lvl 6 and then Lore Bard becomes way better. Before that though, spike growth can trivialize most of the mob battles in A1 and Druid gets it at lvl 3. Druid also gets Sleet Storm at 5 whereas Bard only starts getting any aoe control at 5.\n\nTo each their own but imo it's pick your poison until at least Act 2.",
            "Sorcerer upcasting scorching ray and then quickening a control spell with the arcane acuity controls better and does wacky damage in the same turn.\n\nArcane acuity changes everything. \n\nDefinitely agree they beat druids though, except in really specific encounters that thorns just win for you.",
            "Who needs single target burst damage when you can Owlbear from the top-ropes?",
            "A man of class.\n\nI'm currently theorycrafting for my next HM run, I was trying to shy away from pure cleric because I think I use one every time, so I think I'm gonna go 5 barbarian / 4 cleric / 3 thief. \n\nThrowzerker with physical damage resist that can Warding Bond the whole team every day... What's not to love?",
            "I can be persuaded on the pure bard vs druid, it's a toss up for me but I don't find the bard spell list to be good and value the flexibility of wildshape over Cutting Words.\n\nCleric is absolutely busted. Lore Bard can't even learn Warding Bond with magical secrets, it's no contest.",
            "I'd do 10 lore/2 warlock to give it some punch. Great main character, excellent checks.",
            "While Twin+Haste is good the chance of the sorcerer losing concentration is high enough to just not be viable in my mind. Concentration can be broken by so much in this game that Haste's detriment is actually real and anything else that Sorcerer has for support or even control other classes can do it better. Sorcerer to me is a spellcasting damage dealer that works better with multiclassing.",
            " \n\nI love HOH because it soft locks half the battle field. Everyone’s blinded, slowed, and taking damage each turn.\n\nThrow down something to slow enemies even more like greese, ice, plant growth ect.  While spamming repelling blast. \n\nIt’s my favorite strategy.",
            " https://youtu.be/7rpORs0hIzo?si=bXKUxJSpWK4Xa1sD could articulate it better than I could",
            "That hireling will be a Moon Druid with levels in Rogue so I can chesse labyrinths like Grymforge.",
            "Lore Bard has Light Armor as an alternative to cloth.\n\nCleric has access to all armour types, but a worse spell list than Wizard.\n\nDruid, when not shapeshifting has light and medium armour as alternatives to cloth. Even in Cloth, they still get Barkskin which bumps AC to 16 regardless of Wild Shape.",
            "I said that I think abjuration is broken and the best mono class in the game. I was ranking non abjuration wizard",
            "I actually like lore bard but I can’t see how it’s better than dipping into warlock or cleric or wizard for the last two levels",
            "I can see why you would go 10 levels in lore bard but the bard’s level 6 spells are really mid I would say the same for swords bard you’re better off multiclassing after level 10.",
            "oops lol, I missed one important word from the title.\n\nNevermind OP, carry on.",
            "Maybe they mean Eldrich Knight with its might as a level 4 spellcaster?",
            "oh man, I'll be honest, that was a hot minute ago and I don't have the best memory...\n\n- Any crowd control is just inherently fun for me and Hunger of Hadar is flat out dope.\n\n- Eldritch Blasting people back INTO the crowd control is abjectly funny; and I was howling with laughter at HoH + Shady's Ice Storm + Jaheira's Plant Growth or Spike Growth + Gale's Cloud of Daggers or Cloud Kill or even Confusion (underrated in this scenario!). Fuh. King. Hilarious!\n\n- The free spells and passives from invocations was nice.\n\n- Every spell being automatically upcast took a lot of the analysis paralysis out of the equation for me.\n\n- Similarly, I have an annoying \"but, but, what if I need that later?!\" problem and getting spell slots back on short rest was a huge help (also not a fan of \"too much\" long resting, for, I guess I'd have to call it, RP reasons). \n\n- The dopamine rush of \"I still have a spell slot and I'm about to short rest anyway?? ARMOR OF AGATHYS!\"\n\n- Finally - and this has nothing to do with being a Warlock - but that was my first run where I romanced Karlach and there simply is nothing like experiencing the best girl for the first time... /swoooon",
            "Warlock spell progression is unique among the classes. Instead of getting a variety of spell slots of various levels as they level up, they only ever have 2 (and at higher levels 3) spell slots. However, these slots are always of the highest level they can cast, and they replenish on a short rest and long rest, instead of just on a long rest.\n\nSo at level 2: warlock gets 2 level one slots, replenishing on short rest.\n\nRegular full spellcaster at level 2 gets 3 level one slots replenishing on a long rest only.\n\nAt level 3: warlock gets 2 level two slots replenishing on short rest\n\nRegular gets 4 level one slots and 2 level two slots, replenishing on long rest only.",
            "The 1 through 10 damage is with Agonizing Blast.",
            "Yes they absolutely can? If you summon shovel, and don't change her name, as either a sorcerer (not wild magic) or warlock, when you get past the magic mirror and speak with Shovel she'll say 'A spell shite! Call me when the fisting starts' and you get to summon Shovel once per short rest, and can also respec and keep her summon ability",
            "There's multiple ways to surprise enemies and metamagic alone clears anything wizards can offer.",
            "Dialog options are not cheese lol.",
            "How is talking to Shovel to get him to join your party “breaking the game and not intended”? \nYou talk to him select the correct dialogues and he joins your team how is that any different from recruiting Scratch or any of the companions for that matter?",
            "Oh, if you don't like necromancy or summons, then Druid really isn't your class.",
            "What you are forgetting is cutting words, which is one of the best, if not the single best control action in the game. \n\nI agree, until Act 2 it’s pick your poison mostly, but the post is about lvl 12 and Lore Bard completely blows Druid out of the water at that point.\n\nFrom the point Lore Bard gets Hunger of Hadar it’s better than Druid.",
            "Crushing flight isn’t nearly as strong as it used to be and it’s way too situational \n\nThe best Druid build you can make is a Sabretooth bleed build, but that requires a multi class. \n\nOverall as a 12 level dedicated class druids are meh. The only other caster class they may beat is Trickery Cleric but even that is close because the cleric spell list is great and heroes feast is an absolute must pick in honour mode.",
            "Hunger of Hadar is possibly the single best spell in the game. Giving it to a full caster that has so much versatility. Cleric is great for support. Bard > Cleric",
            "Do you recommend starting with lore or warlock?",
            "Easy fix: war caster + good wisdom modifier\n\nI can count on one hand how many times I’ve broken concentration on a twinned haste (through things that weren’t my own fault like casting another concentration spell lmao).",
            "Not sure about this. seems like a jack of all trades, master of none. light cleric luminous build much more effective imo. if you want the druid spells just have a druid in your party too",
            "Sorcerer:  \n10 AC  \n+3 from Dex  \n+3 from Mage Armor   \n16 AC \n\n+2 from Shield  \n18 AC  \n\nAlternatively  \n+1 from Dual Wielder Feat  \n17 AC  \n\n+5 AC on Demand from Shield Spell\n\nThen the most used robes also have +1 AC innate.\nSo you end up with 23-24 AC",
            "The post is about mono class",
            "Oh for sure. You could maybe get more out of a dip somewhere. But the thread is comparing monoclass casters.",
            "Otto's is not mid",
            "I actually really enjoyed adding a few levels of sorcerer to warlock. It gave me all the benefits of warlock but I also got a separate set of spells I could use to stave off danger and since I had my warlock slots I could use them pretty freely",
            "You must be doing something incorrectly then. As long as he has his base 17 charisma, Eldritch Blast with Agonizing Blast deals 4-13.",
            "Lol\n\nShovel surprises and also frightens enemies constantly. That’s a surprise round in the beginning + immobility + -2 accuracy translating to the same as damage bonus for your party. From a summon. \n\nArcane ward alone puts Abjuration Wizard at the top of mono class casters. You are literally unhittable from level 5 on. Name one other class that can get 30 armor class at level 5 without cheesing. \n\nAnyone who truly knows this game will tell you that abjuration Wizard is the best monoclass caster in the game.\n\nOverall it is one of the most broken classes in the entire game.\n\nSingle target damage, like on Sorcerer, isn’t the be all end all.",
            "I agree with all of that.\n\nThe post is about lvl 12 but the game is about getting to lvl 12 and the bulk of the struggle is in Act 1 and 2. Regardless, I didn't feel like adding all of that nuance when I made this comment in the bathroom at work lol",
            "I go Warlock 2, I respec to Lore at 6 when it starts to get some means of offense (Glyph of Warding, Magical Secrets). Then from 6-8 I'll grab my eldritch blast back and the rest of the game pure Bard.",
            "If damage was the only problem with concentration then maybe but sadly there is so much that can break it. Also it needs to be a better caster than Wizard, Cleric and Bard which isn't unless we were just measuring damage but I put that's just a portion of what a caster can do. You may be able to convince me to pit it over Druid but I still feel like the huge number of summons druids bring with it is better than anything Sorcerer can do besides damage maybe...",
            "I interpret \"which X is best\" to mean which class can beat the game with the least game knowledge.  If you have the game knowledge to put together item dependent builds you probably don't need a reddit post to tell you what builds are best, or the power level of the class wouldn't impact if you can beat the game\n\nIf I pick nature cleric it doesn't matter what gear or classes the rest of my characters are, I'll be strong at the right times no matter what.  I got my spike growth for the goblins, and my spirit guardians for act 2, and by act 3 it doesn't matter my swords bard or abjuration wizard or fighter wins solo",
            "And I’m saying as a mono class it’s weaker than multi classing with other classes and lore bard is already just an average caster",
            "Don’t bother, something about this guys brain isn’t braining",
            "I would say it’s a weak mono class I think almost any 2 level dip is better than the 12 levels  of lore bard \n\nAnd if we compare mono lore bard to other mono class casters it’s the weakest at actually killing things",
            "Maybe it’s just the on screen tool tip whilst targeting thst js giving me bad info with the 1 to 10?  Cause I definitely have agonizing blast.  Thanks",
            "Yeah I'm playing honour mode right now and light cleric makes it a breeze. The only way I can die is if I'm not paying attention to legendary actions or debuffs. I would argue that is the definition of powerful, but we can agree to disagree",
            "1.) bro why are you arguing about how multiclassing is better on a post that is strictly about mono classing? Of course multi classing is the optimal option, everyone knows that, but that’s not what this post is about. \n\n2.) lore bard definitely isn’t just an average caster. Easily an S tier class even as a mono class.",
            "Yes. You are probably correct.\n\nBut that isn't what this post is about. It's purely about comparing mono-class casters with each other, not comparing them against multi-classed casters.",
            "Some tool tips don't include modifiers, which can definitely be confusing! Agonising blast will add your charisma modifier to the damage roll. So for every 2 pts your charisma is above 10, that's an extra +1 to damage (+3 at 17CHA). \n\nYou can always look in the combat log and hover over any of the damage rolls and it should give a breakdown for you :)",
            "Light clerics are very very good, I completely agree, but my first playthrough I completely missed the creche and the key items for the luminous build",
            "I'm arguing that a mono lore bard is way weaker than dipping into other classes that’s why Lore Bard/Warlock is mentioned more than than going 12 levels in Lore Bare.\n\nLore bard is not s tier when arcane acuity exists",
            "Pure lore bard is a weak offensive caster cutting words is cool and all but killing things is better",
            "Thats what's great about the game, you can do it different the next time!",
            "Tfw you can't read 😔😔😔",
            "Lore bard is a control caster you bellend, probably the best one in the game even on top of being THE best out of combat character in the entire game",
            "Pure lore bard is ass tell me what it does better than a tempest cleric or a evocation wizard?",
            "No it’s not arcane acuity is better than cutting words so you don’t even need to play lore bard \n\nA swords bard with 16 charisma is a better controller with arcane acuity than a lore bard with 20 charisma",
            "Control the battlefield.\n\nYou can trivialise every single fight in this game with just one lore bard. Literally not a single enemy within reach will be able to even get damage in on your party if you play your lore bard right. \n\nAlso outside of combat lore bard is THE best character in the game and it’s not even close.\n\nJust because you don’t know how to play lore bard to save your life doesn’t mean it’s bad.",
            "Arcane acuity is a bonus stat, cutting words is an action. The fact that you are comparing those tells me everything I need to know about your knowledge of the game 💀\n\nAlso, arcane acuity is available to any character in the game dumbo.\n\nAlso also, what you are saying is objectively wrong. A lore bard can control an entire battlefield reliably to a point where enemies won’t even be able to deal damage and that even before adding gear stats. \n\nThe best a swords bard can do in terms of controlling an entire battlefield is grab the bow of the banshee, arcane acuity and the band of mystic scoundrel and hope that the dice hit right.\n\nSwords bard is mostly for controlling single targets and dealing massive damage to them. Lore bard is about controlling the entire battlefield, preventing the enemies from attacking and debuffing them simultaneously.\n\nI don’t think you even know the mechanics of the game and class roles well enough to be having this conversation bro."
        ]
    },
    "A concentration build that never loses concentration?": {
        "title": "A concentration build that never loses concentration?",
        "score": 17,
        "url": "https://www.reddit.com/r/BG3Builds/comments/1dlmsu2/a_concentration_build_that_never_loses/",
        "content": "I’m playing a warlock/druid built around HOH, Darkness, Spike Growth, and other concentration spells. It works great, until some arrow knocks me out of concentration. I have war caster and decent constitution. I can’t go Fighter for proficiency because of what I want to do with my build. How else can I maximize my chance to succeed a con save? Any gear that will help? Going to get my AC up as high as I can, mirror image, etc, but what else?  ",
        "num_comments": 28,
        "comments": [
            "There are two light armors that give advantage on Con saving throws: in Act 1, Minthara's Spidersilk Armour, and in Act 3 the Armour of Landfall.\n\nIn addition any generic item that gives +1 to saving throws.",
            "What you can try is taking the resilient feat for constitution instead of war caster, and then wearing the [[Spidersilk Armor]] until Act 3 when you can wear the [[Armor of Landfall]]. There is also a robe that also gives advantage on constitution saves + a saving throw bonus but you have to make certain evil choices in Act 2 and I don’t want to risk spoilers.",
            "Remember that Concentration saves is a subset of Constitution (CON) save. So anything that improves COM saves also helps with maintaining concentration. \n\nResilient feat in Constitution will give you CON save proficiency. To get advantage in CON saves, you have a few ways. See full list in the wiki here:\n\nhttps://bg3.wiki/wiki/Constitution\n\nFor advantage on only Concentration saves, you can use the Elixir of Peerless Focus.",
            "I'm currently toward the end of a HM run with a monoclass GOO Warlock and 16 CON and War Caster have been enough to provide (at least for my standards) an acceptable amount of concentration retention.\n\nIf you really hate losing concentration, there's always the [Robe of Supreme Defences](https://bg3.wiki/wiki/Robe_of_Supreme_Defences), which would add your spell casting modifier to all of your saving throws, but it's always felt like overkill to me. Other people have already mentioned various pieces of gear that provide advantage on CON saves or concentration checks which would eliminate the need to take War Caster.\n\nThere are also other ways to improve your chances of keeping concentration. Since the DC of the concentration check is based off damage taken, equipping either of the gloves ([Hellrider's Pride](https://bg3.wiki/wiki/Hellrider%27s_Pride) or [The Reviving Hands](https://bg3.wiki/wiki/The_Reviving_Hands)) that provide Blade Ward on your party healer will reduce the difficulty of many of your concentration checks. Similarly, the Bless effect provided by [The Whispering Promise](https://bg3.wiki/wiki/The_Whispering_Promise) (or, you know, Bless), will also boost your concentration saves. General bonuses to saving throws will also help, especially against things like getting knocked prone or being held/paralysed, which will all immediately end concentration without any additional save checks. Similarly, items that just outright prevent these conditions (like [Boots of Striding](https://bg3.wiki/wiki/Boots_of_Striding) or the [Ring of Free Action](https://bg3.wiki/wiki/Ring_of_Free_Action)) will also help.",
            "\n My best one for that requires several items. \n\n Steel Watch helmet and amulet if health grant advantage on con saves. Same with various armors. \n\n Boots of striding stops you getting knocked prone while concentrating. \n\n  Robes of Supreme defenses adds your spellcasting modifier to concentration saves. \n\n So a Gith sorcerer, any druid or cleric can stack the above togather with the resilient feat and be really hard to break concentration. \n\n Sorcerers dont need the feat.",
            "If it’s Con proficiency you’re after, then you can also level someone to Transmutation Wizard 6 and get them to make and pass you their Transmuter Stone each day.\n\nA camp caster can do it if you use them. Otherwise Gale, maybe, especially if you’re the main caster.",
            "Hey! If you pick the feats resilient (CON) and/or war caster, the chances of losing concentration are really low, also, if you start your build with 1 lvl of sorcerer ( fighter too but I think not as good for caster) you have CON proficiency.",
            "The best way to not lose Concentration is to have a +8 or more to Con saves, advantage on said saves and be a half long to reroll 1s. That setup makes it a 1/8000 chance you fail a generic 10DC Con save, though higher DC from higher damage will always be a risk. \n\nIf you're not a halfling, the best you're gonna be able to get is a 1/400 chance to fail via an item that gives advantage on saves like Spidersilk Armour and then pump your saves as high as you can get them via Resilient: Con feat, Safeguard Shield/Absolute's Protector, Ring/Cloak of Protection and then any lategame equipment you can grab. \n\nThe absolute best-case scenario for maintaining concentration is an halfling Paladin with Resilient: Con and the Amulet of Greater Health which would give you +6 Con, +4 Proficiency, +3 Aura of Protection, +1 Ring of Protection, +1 Cloak of Protection, +1 Helm of Balduran, +2 Armour of Agility giving a +18 to Con Saves, Advantage from the Amulet of Greater Health and rerolls on 1s from being a halfling.",
            "A Sorcadin with War Caster, a 16 Con, and a 22 Cha by endgame rolls 1d20+14 at advantage, then you could wear the ring of protection, cloak of protection, I'm sure there's other gear, like Dwarven heavy plate, etc that can get you up to or close to a +20 to con saves that are made at advantage.",
            "Have a support cast warding bond on you.",
            "If you never want to break concentration make your first level as a fighter so you get heavy armor and con saving throw proficiency, one level is enough but two also gets you action surge.\n\nThen pick war caster as a feat and you're set",
            "Something I don't see mentioned here much is failing the check isn't the only way to lose concentration, also if you go down or are banished (itemization isn't going to do anything to prevent that) and I'm not even sure if any enemies have access to banishment. Being put to sleep, fey ancestry will prevent this, so will an elixir of peerless focus - this also grants advantage on concentration saving throws.\n\nThe two big ones are incapacitated and prone, incapacitated comes from things like hold person, or paralysis from, say meenlocks or ghouls, also being frightened, stunned, restrained, polymorphic, charmed, and dominated. \n\nYou can become prone many ways, such as slipping on grease or ice - which are prevented by the [[Disintegrating Night Walkers]] and prone is prevented while concentrating on something while wearing the [[Boots of Striding]]\n\nFreedom of Movement is a 4th level bard, cleric, and druid spell which - among other things - prevents magical paralysis. \n\nHeroes feast is a 6th level druid and cleric spell, which - among other things - prevents the frightened conditions.\n\nI mention these two because they are concentrationless \"until long rest\" spells, which means a camp member who is not a member of your party can cast this and you maintain the effects mentioned above",
            "Dark Justiciar Half-Plate would probably be higher AC unless building dex",
            "Thank you!",
            "[Spidersilk Armour](https://bg3.wiki/wiki/Spidersilk_Armour)\n\n[Armour of Landfall](https://bg3.wiki/wiki/Armour_of_Landfall)\n\n^This ^action ^was ^performed ^by ^a ^bot. [^(Learn more)](https://www.reddit.com/user/BG3WikiFetcher/comments/1bk01df)",
            "Thank you! I love that idea. Can’t believe I didn’t notice that feat.",
            "Why con Resilient over war caster sir?",
            "Thanks! Good point.",
            "Add 6 levels of Paladin and get to 22 Cha, and you get +4(prof)+6(Robe)+6(Con)+6(Aura) for a +22 at advantage with immunity to Prone.\n\nJust requires the Robe of Supreme defense, Amulet of Health, and Boots of Striding.\n\nThere's a bunch more items that grant you more +1s to saving throws, like the ring of protection, an act 1 shield, etc etc, but +22 is already unable to fail. Lol",
            "Awesome! Thank you! That robe sounds terrific.",
            "Interesting! Thanks!",
            "Won’t that just reduce damage?",
            "[Disintegrating Night Walkers](https://bg3.wiki/wiki/Disintegrating_Night_Walkers)\n\n[Boots of Striding](https://bg3.wiki/wiki/Boots_of_Striding)\n\n^This ^action ^was ^performed ^by ^a ^bot. [^(Learn more)](https://www.reddit.com/user/BG3WikiFetcher/comments/1bk01df)",
            "In addition to that, minthara's boots make you prone immune while concentrating and since the enemies know that prone instantly breaks concentration and will try to cause it as much as possible when you are, at least in my experience.",
            ">Thank you!\n\nYou're welcome!",
            "I’m not the original commenter, but I would think it’s because warcaster gives advantage on Con saves, but those items that were listed can give you that benefit instead. Resilient Con gives a large bonus to Con saves, and the benefit can’t be replaced by an item.",
            "Much appreciated!",
            "Ahhh learnt something new today \nTyty"
        ]
    }
}