{
    "Holy shit chat": {
        "title": "Holy shit chat",
        "score": 382,
        "url": "https://i.redd.it/bcbl7y07728d1.jpeg",
        "content": "",
        "num_comments": 41,
        "comments": [
            "Diplopia, pick up both brimstones (0 heart containers now), pick up dead cat withOUT heart cost since youll actually gain a heart container off of it, pick up both pentagrams (using the heart container), pick up heart cost dead cat to gain heart container back ![img](emote|t5_2sxpk|17736)![img](emote|t5_2sxpk|8906) pretty sure u even get to keep a soul heart that way",
            "chaos deniers in...",
            "Wait what's that big circle in the top left......",
            "wa-wa-wa-wait ch-ch-cha-chat what what wait is this is this is this brimstone and diplopia like chat like double brimstone",
            "Shop deniers???",
            "18 LIVES ![img](emote|t5_2sxpk|4358)",
            "Satan is not going to be happy about this",
            "Big Brim ![img](emote|t5_2sxpk|2357)",
            "![img](emote|t5_2sxpk|4358)",
            "How many runs you lost that Edmund felt pity for you? ![img](emote|t5_2sxpk|8907)",
            "Happened to me on a t lost run recently![img](emote|t5_2sxpk|4358)",
            "DOUBLE DEAD CAT",
            "Check him pc",
            "Use Diplo, take free Brim and Pentagram, take 2nd brim, take free Guppy.\n\n  \nCongratulations, you have double brim while only paying 2 soul hearts for it",
            "Gam:err:",
            "The life of a min-maxer never stops… ![img](emote|t5_2sxpk|17735)",
            "One soul heart? Brim + Brim + Pentagram = Leviathan.\n\n1 red + 5 soul\n\nbuy brimstone, 3 soul\n\ntake dead cat, 1 red + 3 soul\n\ntake pentagram, 1 red + 5 soul\n\nbuy pentagram, 5 soul\n\nbuy dead cat, 1 red + 2 soul",
            "What does double brim even do? ![img](emote|t5_2sxpk|30106)![img](emote|t5_2sxpk|8908)![img](emote|t5_2sxpk|17737)![img](emote|t5_2sxpk|4359)",
            "Assuming he’s not yet picked up another item for leviathan he’d also gain the leviathan transformation after picking up brimstone + brimstone + pentagram. Which grants black hearts",
            ">Diplopia, pick up both brimstones (0 heart containers now),\n\nThe duplicated devil deals are free",
            "pick up both brimstones then both dead cats then both pentagrams, youll end up with 2 black hearts",
            "***STOP POSTING ABOUT CHAOS***\n\n#***I'M TIRED OF SEEING IT***\n\nMY FRIENDS ON DISCORD SEND ME SACRED HEART\n\nON REDDIT ITS FUCKIN C-SECTION\n\nI WAS IN, A SERVER, RIGHT? AND ***ALL*** OF THE CHANNELS ARE JUST CHAOS ROLLS\n\nI, I SHOWED MY KEYBOARD TO MY GIRLFRIEND AND THE R KEY, I HELD IT AND I SAID \"HEY BABE, WHEN THE DENIERS ARE SEETHING\" **HA HA!**\n\n[***^^DING ^DING ^DING DING DING DING, ^DING DING***](https://www.youtube.com/watch?v=HapnGxj5joo)\n\nI FUCKIN LOOKED AT A TRASH CAN, I SAID *\"COW ON A TRASH FARM\"*\n\nI LOOKED AT MY PENIS, I THINK OF THE BRIMSTONE SPRITE AND I SAID \"BLOOD LASERS? MORE LIKE **CUM LASERS!\"**\n\n#*AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA*",
            "This isn't even chaos...",
            "ok’les",
            "Not even a chaos moment, this is just skill solution moment",
            "New quality 5 item called Triplopia",
            "Also, hey, its Azazel",
            "if you dont min max every god damn opportunity, are you even playing tboi? ![img](emote|t5_2sxpk|17742)",
            "Damage up + girth up ![img](emote|t5_2sxpk|2357)![img](emote|t5_2sxpk|17745)",
            "you get a thick laser like Mega Satan",
            "Stacks damage boost, maybe?",
            "Pretty sure they meant red heart containers, not hearts in general. I was confused as first too.",
            "most sane Isaac fan",
            "New copypasta just dropped",
            "![img](emote|t5_2sxpk|4358)",
            "Another beam",
            "Sick",
            "Nope, since Repentance the beam is just thicker and you get a flat bonus damages and a multiplier for the second Brimstone, than just flat damages for 3 and more",
            "And your appearance changes again.",
            "worth noting repentance double brim is weaker than non repentance double brim \n\nvery sad!",
            "but it doesn't look as cool"
        ]
    },
    "How small exactly is this window": {
        "title": "How small exactly is this window",
        "score": 744,
        "url": "https://i.redd.it/hjehbzyhh08d1.jpeg",
        "content": "I had Spin to Win with book of virtues and i risked it and i SWEAR TO GOD I GOT SPIN TO WIN but i didnt. Does anyone know exactly how small the window is",
        "num_comments": 82,
        "comments": [
            "about this much 🤏",
            "You have to be VERY close to the item pedestal",
            "I've heard it's around 1 frame",
            "1-2 frames per slayxc2",
            "It has to be in like the same frame. The trick is you press forget me now as late as possible while picking up the other item. You can always try again if you press it late. If you press it early once you lose the second active",
            "Basically glitched crown but triple speed",
            "It might be frame perfect",
            "im pretty sure this will get patched in the upcoming update (or at least according to mattman)",
            "One frame I believe",
            "You can also do this with r key, and I’ve found that it’s about 2 frames",
            "i did it with r key once (in my 700 hours playing this game)",
            "Its has to be in the same frame.\n\nWould decreasing the frame rate make it easier?",
            "i think its like 2 or 3 frames perfect",
            "Never done it.  Tried about 20 times.",
            "Basically be hitting the button as you walk into the pedestal, even then be prepared to not have item when waking up",
            "it's EXTREMELY small. if youre on pc use this mod : [https://steamcommunity.com/sharedfiles/filedetails/?id=2497427250&searchtext=forget+me+in](https://steamcommunity.com/sharedfiles/filedetails/?id=2497427250&searchtext=forget+me+in)\n\nmakes it so it takes 3 seconds for forget me now or r key to activate, after activation.",
            "Extremely small, even seasoned YouTubers like lazymattman has failed it a couple times",
            "This is something that I miss about WoTL. When you'd use an item like Forget Me Now, or a teleport card, you had like half a second to move between using it and it activating. It allowed you to take items/cards/etc. with you. It wasn't easy to do, but it was much easier than Rebirth.",
            "I need to spend a hundred hours to learn this technique",
            "Ask lazy mattman",
            "too much",
            "It's almost frame perfect",
            "So imagine there's a box about an inch squared. Now imagine you have to fit another box of the exact same size through the first box. The amount of space between the boxes while one is being moved through the other, that's about how big the window is.",
            "1 frame",
            "it's a couple frames. with a bit of practice you can do it semi consistently. try to use the forget me now a lil late rather than a little early",
            "1 frame I believe",
            "Is this window here in the room with us?",
            "Probably frame perfect",
            "Like my chances of getting girlfriend.",
            "About 1/60th of a second. Tbh I used the \"Forget me in 3 seconds\" mod for most of my playthroughs lol. Gives you a full 3 second window between eating the pill and resetting the floor, and if you don't care about modifications I'd suggest getting it too.",
            "33,33 ms",
            "With the forget me now 3 second mod, forget me now has a 3 second window.",
            "about 1 second, you need to be FRAME PERFECT if you wanna take like The D6 with you",
            "If you're on PC, there's a mod that extends the window by like 3 seconds. Should be how it works by default, in my opinion",
            "God bless you (he's not real ![img](emote|t5_2sxpk|8906))",
            "or very fast",
            "Happy cake, you can eirher have it or eat it",
            "I've heard just the same.",
            "To autistic people like me glitched crown is just a normal crown",
            "So we still have about 6 years to abuse it, neat!",
            "Isn't that cheating tho? ![img](emote|t5_2sxpk|17743)![img](emote|t5_2sxpk|17743)",
            "I love being phone only 💔💔",
            "Do PC players actually play any form of the normal game without making it easier by using mods what's the fucking point 😂",
            "That doesn’t answer the question at all",
            "Thats literally cheating tho lol. Majority of people lose the feeling of accomplishment when they cheat.",
            "Waaaaaay less than 1 sec, its like 1 frame",
            "That would be three seconds and one frame.  Way too long.",
            "https://preview.redd.it/swzim4dnc18d1.jpeg?width=490&format=pjpg&auto=webp&s=7211894cfb4eb68693ce584ee2124e88a9245c95\n\nSo Edmund created this whole christianity thing? ![img](emote|t5_2sxpk|2357)",
            "Don't say that, this is a christian sub ![img](emote|t5_2sxpk|8908)",
            "Mf asking for that thunder to strike",
            "Cringe comment",
            "Standing a pixel next to it and talking the active press while running back in is the best setup to time this frame",
            "I think you might be the only one who just phone only.\n\nNit that is a problem K just find it interesting.",
            "If there wasn't a point, there wouldn't be a workshop to begin with. Now I know assume you're young, so go back to watching skibidi toilet or whatever.",
            "You're not wrong every other comment is mod this and mod that it all makes the game easier I'm.not sure anyone has actually played the real fucking game 😂",
            ">sense of pride and accomplishment",
            "Sounds like something EA said on Reddit years ago.\n\nIf you're achievement hunting, it is cheating. But if you're playing casually, who cares what mods you have installed?\n\nEdit: rebirth has been out for almost 10 years this November, people can play how they want.",
            "probably like 50ms",
            "what if edmund is the voice from above and mom is the cow on a trash farm",
            "BLASPHEMY AGAINS THE HOLY SPIRIT",
            "Does DOOM count as a christian game aswell?",
            "Holy light?! ![img](emote|t5_2sxpk|17745)",
            "cry ![img](emote|t5_2sxpk|17735)",
            "Lazy Mattman exists.",
            "Hey ur dms are off so i cant send u anything",
            "Tinkering with a game is one thing never actually playing it normally is something else what does age have to do with anything I'm a purist not a cheating pussy that needs to fine tune everything in their favour because they can't handle a challenge",
            "I mean i know that, not trying to say you cant, i just feel like I always see comments like “oh just download xyz mod to cheat instead of actually overcoming the hurdle” on this subreddit, when people are just looking for advice or info. You are allowed to cheat all you want, but offering it as a solution seems silly to me.",
            "https://preview.redd.it/lr33vbwkl18d1.png?width=1283&format=png&auto=webp&s=9069f3d4d89deb1309f38e472cc3d738642469b0",
            "Yes, yes it does ![img](emote|t5_2sxpk|4358)",
            "It's a singleplayer game, why you care so much what others do lmao",
            "This. Exactly this. Especially got real bad in this sub with installing External item descriptions for T Cain recipes. It became like some standardized norm you play T Cain with recipes eventhough its intended to be random. You could not have a good discussion about how to play the character without constant miscommunication and mod pandering popping up, definitely ruins being on reddit. But when you ask about it, they make u the bitch for hating on playing how they want.",
            "Its not a spelling mistake, i ate the T",
            "![img](emote|t5_2sxpk|17745)![img](emote|t5_2sxpk|17745)![img](emote|t5_2sxpk|17745)",
            "Because you're playing an easier version of the same game and acting like we play the same game, we don't 😂",
            "I think T cain would be more fun if you could know *what* you can craft but not *how*",
            "did it taste good?",
            "I never said i was playing with mods.\n\nJust let people play how they want lol",
            "It tasted like tea",
            "Tool assisted",
            " did you plan that",
            "I swear TO GOD THATS IN THE LIGHT that i didnt plan that, i just type fast."
        ]
    },
    "Daily run was insane": {
        "title": "Daily run was insane",
        "score": 206,
        "url": "https://v.redd.it/rxuiiuagz08d1",
        "content": "",
        "num_comments": 19,
        "comments": [
            "I wouldn't know I died on Floor 1 ![img](emote|t5_2sxpk|8907)",
            "I thought the items were going to disappear![img](emote|t5_2sxpk|4359)",
            "BRUH WHAT I NEVER FOUND WILD CARD",
            "now you got good 30% items in the game IN A SINGLE RUN",
            "Omg I didn’t try this hahaha at least I complete it, now I want to give it a try lol",
            "I broke it with tm Trainer and game crashed",
            "thats awesome",
            "_Wild Card_\n\n_Wild Card_\n\n_Wild Card_\n\n_Wild Card_",
            "greed",
            "Easiest way to get dead god",
            "Where did u get the wild card, tf?",
            "The game crashed for me before I could even find that",
            "Had the same experience, except became the lost and used my diplo/wild card combo on magic skin to get unlimited anything I wanted.",
            "Wild card 🗣",
            "Awesome find/brake!",
            "What items is wildcard mimicking? I don't get it ![img](emote|t5_2sxpk|17741)",
            "![img](emote|t5_2sxpk|4358)",
            "Mine crashed walking into the first room",
            "It's acting as a Diplopia here, without actually consuming the real Diplopia"
        ]
    },
    "Skill issue?": {
        "title": "Skill issue?",
        "score": 800,
        "url": "https://v.redd.it/ocq9wzj1ey7d1",
        "content": "Rip to a great start \n",
        "num_comments": 75,
        "comments": [
            "You can actually pause perfectly at 0:13 to see the explosion already hit you by the time you went into the door. That is impressive; A FRAME perfect hit that managed to be perfect enough to just COMPLETELY ignore your mantle.",
            "The Binding of Isaac trying not to be bullshit for 5 minutes (IMPOSSIBLE)",
            "How did that kill you if you had a mantle?  You can even see it on the screen when you die.  Makes no sense.",
            "I'm guessing that's a bug ![img](emote|t5_2sxpk|8907)",
            "You obviously exited the room wrong",
            "If I had free block destruction I'd definitely destroy all the mushrooms. You never know which one is hiding that Magic Mush",
            "Yes and no. The game cheated bruh, you literally had mantle",
            "technically in this instance you theoretically could have broken the mushroom before leaving and reentering but if you entered this room layout for the first time from the left door and then died you’d literally have no way to prevent that so i’m calling this one a bs death",
            "Average T.Lost bullshit death",
            "to anyone who doesn’t hate themself: get tainted lost redux mod and turn off all changes except for brief invincibility when entering a room. doesn’t make it any easier but helps with edmund moments like this    \n\njust realized this isn’t t lost but my point still stands",
            "I think saturnus is pretty bad with the lost. I died a couple times because of it.\n\n\nI find it interesting how dying in one hit makes some items really bad all of a sudden: for example I tend to avoid 3 dollar bill.\n\n\nSucks that you died like that op, but at least it was only caves so it's not a huge deal",
            "Lesson learnt: destroy all mushrooms before entering another room if you have ring of rock tears.\n\nThat's what Ed would claim if you file a lawsuit to become back your money ![img](emote|t5_2sxpk|17742)",
            "No,  bullshit death",
            "Saw that comin :)",
            "Heart attack ![img](emote|t5_2sxpk|8906)",
            "At that point I would hit the classic ~ rewind",
            "okay this is obviously stupid and shouldnt work like that but also taking not only terra but terra and saturnus as a lost? thats ballsy as heck; theres so much chance for any rock breaking stuff to deal damage to you with bombs or poison farts or hosts and such",
            "Game issue",
            "Most likely the mantle effect is temporarily lost or unaccounted for while transitioning. Since the explosion hit you the very same tick you entered the room, the game calculated the damage before it realized that you had a mantle, hence, bs death.",
            "The skillest of issues",
            "Picking up Saturnus and Terra with T. Lost is indeed a skill issue",
            "... Kinda? I mean  there's no reason for you to have shot there, it was an unnecessary risk, but how tf did you die anyway?! You had your mantle charge!",
            "You need more damage",
            "you dont have enough speed...",
            "This is why I never pick up Saturn unless I know I have 0 tear modifications. 3 Dollar Bill, Fire Mind, Terra, Sulfuric Acid, they can sometimes fuck you over.",
            "Damn that's one of the only comment sections that isn't spammed with skill issue, cherish this moment little one",
            "Rip",
            "Should have destroyed the mushroom before going into the shop, clearly a skill issue",
            "As someone who's new to this game, all these bullshit lost deaths are scaring the shit out of me. I can't beat gurdy jr without taking damage, so idk how I'm going to do anything as the lost lmaoo",
            "if you picked up the soul of the lost you wouldnta died. Truly a skill issue.",
            "Bad luck issue![img](emote|t5_2sxpk|17741)",
            "so unlucky that it's lucky",
            "Whats the item circling around, and also what is the bone circling thing? I'm learning sorry guys",
            "Next time use the console and do the “rewind” command. The game cheats you so it’s fair to cancel the bullshit",
            "The mantle aint mantling",
            "Similar thing happened to me once with this planetarium item and I never picked it up again",
            "*Instantly presses backspace*",
            "What destroyed the mushroom anyway? lol this game is nuts",
            "skill issue!!!!![img](emote|t5_2sxpk|17741)![img](emote|t5_2sxpk|17741)",
            "Isaac Skill bullshit\n\n  \nIsaac seriously sucks when there is shit that can literrally kill you frame 1 just because of 1 small thing",
            "Kind of? The soul of the lost was right there, so you would've been revived if you had picked it up. The game did cheat, but the answer was in the room.",
            "I’m going to buy a lottery ticket rn",
            "Golden skill issue",
            "(GONE WRONG!!1!)",
            "I will try to replicate this when I get home, but I don't think poison bypasses mantle, does it?",
            "Since it's holy mantle it resets every room meaning that if you manage to get hit that one frame it's respawning you get damage",
            "The explosion happened for one single frame before the mantle reset. There is a insanely small period (only a handful of frames) where the mantle gets reapplied when entering any room. The explosion basically hit OP a frame before his mantle got reapplied.",
            "There must be a vulnerability frame when entering a room before mantle reapplies",
            "Iirc in the first frame you enter a room with holy mantle specifically, you don’t actually get the holy mantle shield, and the mushroom fart just happened to occur in that one frame.",
            "Certainly looks like t lost with that cloth and darker color",
            "Yeah. Saturnus often times makes my screen so hard to see as well, which contributes to the amount of deaths where I don’t even know how I died",
            "*goes back into shop*\n\n*leaves room*\n\n*terras mushroom*\n\n*dies again anyway*",
            "Hosts don't deal contact damage, so them spawning on top of you from smashing a skull with Terra doesn't instagib the same as the poison clouds or bomb rocks.",
            "That’s not T. Lost and I still had mantle regardless",
            "I was kidding about the skill issue, maybe should’ve added /s lol. I didn’t even shoot there, it was the saturnus terra tears that destroyed the mushroom and still somehow killed me",
            "Don't worry, Lost has a secret buff called \"Skill Solution\" that makes you play better with him, but only with him.",
            "Lost is actually surprisingly defensive due to his starting with flight and mantle.  You do have to play carefully, but those two things alone let you avoid 99% of damage you would take on a grounded character and whatever 1% you would normally take, the mantle is there to cover as well.\n\nAlso, you just kinda get used to the BS deaths if you get far enough to actually unlock and play Lost.\n\nHe is a fun, but frustrating character.  T. Lost is even scarier as you don't get the mantle, but he gets an inherent damage multiplier and a more focused item pool.\n\nBoth characters are a blast to play, even though they are definitely 'challenge' characters.",
            "Is there some mechanic I’m not aware of? I’m already the lost, how would it revive me?",
            "*Upon receiving it, it turned out to be a dry cleaning receipt.*",
            "(I BECAME BACK MY MONEY!!//1/1/1/!?!//1232,4,2?<>/,.2/,.32$5%&%836✡︎⚐︎🕆︎ ☹︎✋︎❄︎❄︎☹︎☜︎ ☞︎🕆︎👍︎😐︎☜︎☼︎))",
            "No, probably mantle loads in dumbly between rooms",
            "But it's T lost, right, so the mantle is persisting between rooms because no holy mantle",
            "Yeah, surprised by how many people think it’s T. Lost but that’s how you look when you pick up Terra. Also notice I have the eternal d6. Either way tho, this apparently would’ve killed either of them, mantle or not lmao",
            "kid named spawn 5.300.1",
            "Seemed like T. Lost. Still, very bad combination...",
            "I'm very sorry for laughing at this",
            "Ahh ok. Good to know",
            "Carrying the soul of the lost as the lost and T. Lost acts as a free revive. You don't need to use it right before death as it activates on death.",
            "That’s my only guess ![img](emote|t5_2sxpk|8907)",
            "That is my guess too, I died this way to explosive tear in Halo when i was traversing rooms.",
            "It reapplies each room",
            "No op said in another comment it was normal lost, the combination made him look like that",
            "Tru. I think another point is that people like to post their bs deaths with t lost here, so statiscally, I kind of get why they’d think this is a t lost post as well at first glance",
            "Probably, but I still died for no reason. I already have all of the marks, so I’m not taking it that seriously",
            "Yeah, that was very strange"
        ]
    },
    "OMG?????": {
        "title": "OMG?????",
        "score": 535,
        "url": "https://i.redd.it/7jmv6s44zy7d1.png",
        "content": "",
        "num_comments": 22,
        "comments": [
            "Both are great, but 20/20 is the safer bet.",
            "Don't care how dangerous ipecac is, always going with it.\n\nDouble that shit up",
            "praying for pyro",
            "glasses? for what eyes?",
            "What final boss did you kill?",
            "so, how'd you die?",
            "i bought both LOL",
            "Ipecac is great.. it’s dr fetus I don’t like ;( hardly ever take it if the runs already looking decent",
            "Got it?",
            "For incubub's eyes of course",
            "probably ultra greed(ier) seeing the shop layout",
            "OP HAD BALLS ![img](emote|t5_2sxpk|4358)![img](emote|t5_2sxpk|4358)![img](emote|t5_2sxpk|4358)\n\nAnyways, how did you die?",
            "So we balling today, aren’t we? ![img](emote|t5_2sxpk|17745)",
            "I’ve had great runs which I ruined by taking it",
            "i won hehe lilith and icpecac (prob spelled icpecac wrong...) is a dangerous combo",
            "Skill Solution ![img](emote|t5_2sxpk|2357)![img](emote|t5_2sxpk|2357)![img](emote|t5_2sxpk|2357)![img](emote|t5_2sxpk|2357)![img](emote|t5_2sxpk|2357)",
            "ICPecac WHOOP WHOOP",
            "it's ipecac",
            "Rare case of skill non-issue ![img](emote|t5_2sxpk|8906)![img](emote|t5_2sxpk|8906)![img](emote|t5_2sxpk|8906)",
            "🤓🤓🤓",
            "\"🤓🤓🤓\" -🤓",
            "They hated you because you spoke the truth"
        ]
    }
}