{
    "Scientists Put Ants on Stilts and Knocked Down Their Sand Towers to See If They Got Lost!": {
        "title": "Scientists Put Ants on Stilts and Knocked Down Their Sand Towers to See If They Got Lost!",
        "score": 338,
        "url": "https://v.redd.it/njwikbu6ux7d1",
        "content": "",
        "num_comments": 34,
        "comments": [
            "Imagine a giant comes by, cuts your legs off and then observes you crawl home",
            "Me: Smashes and flicks ants unapologetically when they’re near my food.\n\nMe when I hear they put stilts on ants: *Gasp (poor ants)",
            "Wait so how does this work exactly?   \nIf they can find their home based on the sand mounds why would they miss is with different leg length?",
            "The ants with the different leg lengths look really funny",
            "Can I have the guys social media please \n..?",
            "Ants with stilts while standing next to the amputated ants.   * WE ARE THE CHOSE. ONES , THE GIANT HAS CHOSE. US *\nWalks past home.   Ah shit !!!",
            "Put them in a controlled area, have a moving slab or some object for them to walk on and move it forward/backwards to find out if they count steps? How ants came up with a numerical system is beyond me (just going for counting maybe it's meant different), I'd go for sunlight manipulation and try to find out if they use that for moving for a duration and in what direction. Maybe they use their antannae (too?), they are pretty much highly developed micro robots or biological tech we are still learning about.",
            "So all I have to do to keeps ants out of my kitchen is cut a tiny bit off each of their legs so they undershoot the entrance and get lost?\n\nGame changer.",
            "This seems like a study that didn’t need to happen because we should have gotten there through common sense.",
            "Sounds unethical",
            "Howd they put the stilts in the first place?",
            "That's the hypothesis yes. A lot of animals (humans included!) count their steps to know how far they've walked. Seeing a few landmarks and knowing how long you've walked gives you a pretty accurate navigation scheme.\n\n\n\n\nSo if their legs are longer or shorter they'll end up not walking far enough or walking too far past their destination if they take the number of steps they'd need with normal legs.",
            "Because the hypothesis is this particular species relied on counting steps and remembering landmarks to find their way home. So by changing the length of their legs, they can make the ants miss the mark as they count the number of steps they have taken on the way out to get back.",
            "Their distance vision is pretty crap.  This is basically universal to tiny eyes (jumping spider being a major exception).\n\nThey travel farther than they can see the towers from, so they have to get back to where they can see it by counting steps.",
            "Thanks",
            "Uh huh? How would common sense tell you whether it's step counting, scent marking, audio cues, or a myriad of other possibilities",
            "That's not how science works",
            "idk the confirmation of ants counting their steps is pretty cool",
            "The scientific method requires proof of ones theory or hypothesis. Not just an educated guess we hope is right.",
            "Maybe but tbh I wouldn't be able to intuit that ants count their steps to navigate, and I'm not sure how someone else would",
            "We learn common sense.. so how would that work? if we never learn anything we wouldnt have any common sense.",
            "I’m gonna bite them",
            "biblical even",
            "Very carefully",
            "so basically the step counting isnt accurate enough, and they need the mounds to hone in the final stretch. got it",
            "Yeah, by what i know, your senses tell you that the earth doesn't move, so we should all switch to flat earth because it's \"common sense\"?",
            "You don’t know? *scoffs* It’s common sense! Even a baby can do it",
            "Pick up 10 ants. Take 5 of them 20 paces away from the nest, take 5 of them 20 paces towards it. \n\nSeems easier and less cruel than amputating half of them",
            "This made me laugh so damn loud. Thank you",
            "Also because most ants don't have good eyesight as they rely more on vibration and smell to find the way, they wouldn't be able to find the entrance of the nest without the mounds. And the reason why scientists think they rely on counting steps and landmarks is because these are desert ants, if they rely on the scent trails like other ants, it would be unreliable because the high temperature and sunlight will make the trails degrade too quickly."
        ]
    },
    "Why are all these snails aggregated on top of this pole?": {
        "title": "Why are all these snails aggregated on top of this pole?",
        "score": 4247,
        "url": "https://i.redd.it/b4ae7k8hmt7d1.jpeg",
        "content": "It's around 23 degrees Celsius. I have no idea what they are all doing these XD",
        "num_comments": 377,
        "comments": [
            "The parasitic flatworm Leucochloridium paradoxum, also known as the green-banded broodsac, can manipulate snails into climbing to exposed areas to attract birds. Once eaten, the parasite releases its eggs in the bird's droppings, where it can continue its life cycle. That’s my guess on what you’re seeing here… but it is a guess.\n\nSo, zombie snails.",
            "Oh no... They're summitting. Parasitic worm in theor eyeballs I'd say",
            "*They're not sick but they're not well* 🎶",
            "Bird buffet?",
            "These snails are traveling and couldn't see enough far ahead, so an obvious decision was made.",
            "[removed]",
            "They’re pole dancing.",
            "Being proficient in social media they all wanted to share the same post",
            "Exploring their Polish heritage",
            "You already got the sad reason so I'm going to assume that's wrong and say they're all taking turns sitting at the top and yelling, \"I'm the king of the world!\"",
            "It's their town hall meeting, leave them alone.",
            "Ground is lava. No touchy.",
            "[removed]",
            "As soon as I saw this my brain was screaming “THEY’RE INFECTED, BURN THEM!!”",
            "If we see this in the world, should we cull them to avoid spreading it further?",
            "A parasite looking to spread via bird droppings",
            "[removed]",
            "Snorgy",
            "Minding their own business unlike OP",
            "[removed]",
            "The people they are hunting have relocated to space.",
            "I always assumed cause of the humidity of such places, but parasites make more sense",
            "Photo op for snails' Mt. Everest",
            "Snorgy (snail orgy)",
            "I just think it’s amazing with as slow as they are that they weren’t all picked off by birds before getting to the top.",
            "Parasite òr disease propagation.   Whatever ix in the drug makes it try to be eaten by a bird.  The bird flies away and the Parasite or virus travels farther than it can on its own.",
            "They are upvoting that post",
            "One of them spiritually evolved, started a religion revolving around a giant snail in the sky which will flood the Earth but only these snails have been chosen to survive and start anew.",
            "Getting a vantage point to see if they could cross the road.",
            "I wonder if people who climb Mt Everest have this parasite?",
            "I don’t know why but I really, *really* don’t like this. At all. Triggering my trypophobia I guess.",
            "Mass outbreak of mind-controlling parasites maybe?",
            "They are racing for pole position.",
            "That’s where the invite said the orgy would be",
            "They at the strip club",
            "[removed]",
            "Because that’s an end",
            "a kinky orgy",
            "Science and nature are so wonderful and terrifying at the same time.",
            "Could be escaping water",
            "Elden ring DLC cosplay",
            "So they have a better view of the concert",
            " they reached the top of the tower of Babel😂😂",
            "Perhaps the pole is full of water after some rains and you live in a very dry/warm climate which forces the snails to congregate there.",
            "Invited the fam Hawk Tuah! and spit on that thang!",
            "Waiting for Heavy Weather to activate",
            "SNAIL PARTY!",
            "It's developing snail mail",
            "They like the view i guess",
            "Possibly rained earlier and they were finding high ground.",
            "It’s an evolutionary trait to not get stepped on. The snails that learn to climb like that become the fittest.",
            "Because pipe is life!",
            "To get a strong wifi signal",
            "Slow pole dancing?",
            "Religion",
            "Suicide pole",
            "Idk but reminded me this\n\nhttps://preview.redd.it/ecr9wax3py7d1.jpeg?width=1080&format=pjpg&auto=webp&s=aca0c6345652b40c10154967959adc603831bddd",
            "On the lookout for their designated billionaires",
            "Snail Everest.  \"Sir Snail Edmund Hillary, and his Sherpas.\"",
            "ITS THE FUCKING LAST OF US!",
            "Snail beacon",
            "Dare you to eat one. Zombie apocalypse.",
            "Caution, these are anomaly snails infinitely chasing there targets who have escaped to the confines of space give them a few months and they'll evolve wings and Continue there slow chase!",
            "Wow! That’s something! Eek!",
            "This is how most gastropods celebrate the solstice.",
            "If I was a snail this is 100% something I would do.",
            "because that pole is the reincarnation of Buddha",
            "Great view from there",
            "Trying to surf that 5G wave 🌊",
            "Flood imminent, head to higher ground you land lubber… okay I’m fooling, probably just having a snail fight club up there but we ain’t aloud to talk about it.",
            "You not had a race before?",
            "Slugfest",
            "I think that the correct answer is: Weather Report is near.",
            "Congregating together to discuss how they are going to take over the world",
            "They're getting high",
            "Because it’s harder for them to dig to the bottom.",
            "Is there a reason they’re all at that one pole, and not spread out across multiple tall poles?",
            "My dog is probably at the bottom trying to play with them.",
            "They're playing  the floor is lava",
            "Snail orgy",
            "There’s no “they just like the sun up there” answer does it have to be the scary scientific one ? 😭🫠",
            "Annual General meeting.",
            "I wonder what they're talking about",
            "They know something we don’t?",
            "The view!",
            "I'm getting a 'Tremors'-vibe here. \n\nHey look, it's old Edgar.",
            "JeR",
            "the pole is holy to them",
            "It’s probably the eye parasites that make them try to get eaten by birds. Look up “Disco snail parasite” for a cool view",
            "snorgy",
            "The eagles have dropped them on the tallest rock, from where they can see the Misty Mountain.\n\nNow they're waiting for movie 2.",
            "I think they were goin up to spread something, like a parasite…",
            "[removed]",
            "[removed]",
            "Your mom used that pole for masturbation and the snails are attracted to the leftover ooze",
            "Yum",
            "Someone sent them an invitation last year.",
            "They heard Biden doesn't enforce immigration law.",
            "[removed]",
            "**Bot message:** Help us make this a better community by clicking the \"report\" link on any pics or vids that break [the sub's rules.](https://old.reddit.com/r/biology/about/rules/) Do not submit ID requests. Thanks!\n\n**Disclaimer:** The information provided in the comments section does not, and is not intended to, constitute professional or medical advice; instead, all information, content, and materials available in the comments section are for general informational purposes only.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/biology) if you have any questions or concerns.*",
            "Ugh. It's always something terrible. 🤭",
            "I disagree. They all look like the same variety, Cernuella virgata, also known as the Vineyard Snail or Mediterranean Snail. Unlike a lot of other snails, this snail actually likes to snooze in large clusters in Sunny spots because they use the warmth of the sun to aid their digestion:\n\n\nhttps://plantpono.org/pests/vineyard-snail/",
            "I don't think that's the case, there's too many of them. Some snails hang on high places to aid digestion, thanks to the warmth of the sun. It's also possible that they're sheltering from a flood",
            "There are other reasons that can explain this.\n\nIn my area, during spring to autumn, ALL snails climb poles when weather gets dry after raining, and hybernate there until next rain. This way they escape certain beetles that prey on them in the ground, and they expect those poles to be leafy trees, more humid and fresh than in open ground. Later in winter, snails will hybernate under the dirt and away from the cold.\n\nBut the poles they are expecting to climb are trees and bushes. Climbing to metallic poles or dead trees is a bug in their programming, because those get too hot under the sun and can make them dry and die.\n\n[https://www.reddit.com/r/snails/comments/qc232j/snails\\_consistently\\_climb\\_these\\_posts\\_then\\_dry\\_up/](https://www.reddit.com/r/snails/comments/qc232j/snails_consistently_climb_these_posts_then_dry_up/)",
            "Nature is freaking metal",
            "Like that cat parasite, but birds",
            "And suddenly you made me remember an article I read about a teen who was dared to eat a snail at a party, got paralyzed from the neck down and after 2 years of fighting died. Simply horrible.",
            "The intelligence found on reddit blows me away.",
            "Damn, I thought it was a Snail Summit.",
            "[removed]",
            "Oh wow. I had no idea about this! Much like toxoplasmosis in cats / mice.",
            "This is so sick. I learned about this in one of my ecology courses but if this is the reasoning it’s so cool to see in progress.",
            "Am I the only one who admires the ability of parasites to control their hosts? I wonder if we will be able to control the human mind one day.",
            "Makes a lot sense to me.",
            "Daaaaamn.",
            "Wow",
            "I came in here to comment, \"None of your business. What are you, a narc?\"\n\nI really wish I'd just done that and then left. I appreciate that you've taught me something, but, what the ever-living fuck.",
            "Ah man... I thought it was a bit like snail on the whale... the snails just wanted to travel the world on the back of some birds.",
            "I don’t know about this specific species of snail, but many snails in dry places like the Mediterranean naturally gather on top of them sticks and dry vegetation.",
            "Is there anything I can do to test if they have in fact that parasite?",
            "Omg I almost wish I could unlearn this today 😵",
            "Why the same pole though? Maybe it is the tallest… some bugs can use landmarks like that, so maybe infected snails look for the highest possible point?",
            "Zombie snails + a snail epidemic.",
            "So don’t eat those ones.\n\n  \nGood safety tip Egon.",
            "Maybe they just really like the view...",
            "That is ridiculously fascinating.  r/natureismetal",
            "how such small organisms know about birds and what attract them ?.",
            "Goddamn it.",
            "Aw I assumed the answer would be “sex”",
            "Aren't those parasites some true villain",
            "Is killing them a good idea? It is invasive or dangerous or just on of many gruesome things that happen and need to happen in nature?",
            "So it's like the toxoplasmosis for snails instead of cats?",
            "I don't think that's what's happening here. Not only would it be unusual to see so many like this, but they're all in aestivation. That wouldn't happen if they were infected with *leucochloridium.*",
            "Astronaut Snails",
            "How does the parasite know which area is exposed and which area isn't",
            "Zombie snails 🐌 🤣  I did a report on this back in college",
            "That is WILD!",
            "I have always wondered how these kind of monsters don’t affect humans…",
            "Holy shit !",
            "There’s also a parasite that does this and eventually causes the carcass to explode, ejecting spores onto stuff below.",
            "Is it the one with the weird colors in the eyes ?",
            "you just got a great song stuck in my head. i love reddit :)",
            "Fencepole Sitta",
            "Yeah, read about this a few times. Think they were feeling a bit naughty and running up the flagpole to see who salutes (no one ever does).",
            "And I’m so hot, livin’ in this shell 🎶",
            "only stupid people are breeding, cretins cloning and feeding...",
            "Oi, clean shell",
            "Minimal water damage",
            "And I’m so hiiiiiigh\n\nCuz I’m a snaaaaaiiiii-ulllll",
            "I just saw another comment about snail zombies, aka parasites that purposely drive the snails into the open to be eaten… part of the parasites life cycle!  so I guess I’m not wrong 😅",
            "We are clearly in the presence of an expert!",
            "[removed]",
            "This is the only right answer",
            "Each are vying for pole position",
            "Ha! My first thought was 'bc they have daddy issues'",
            "Reposting this.",
            "This comment is wild",
            "My grandfather just laughed in his grave.  He loved any opportunity for a Polack joke.",
            "😂😂 Thank you for making me laugh, Hippyman.",
            "r/angryupvote",
            "Yes. Poles are often known for their specific humidity.",
            "🏆",
            "The only correct answer.",
            "We can only see one pole.",
            "Not the worst parasite carried by snails… trust me.",
            "Sometimes its just an orgy.",
            "Welcome to nature",
            "here I thought it was just an orgy :(",
            "Yeah……I was hoping it was like some kind of snail religious pilgrimage or wild orgy or something. Parasites ruin everything fun.",
            "Yay it’s not zombie snails",
            "They're all full-tummied and snuggin in the sun? That's way better than zombies",
            "As always, the real information is in the comments",
            "The Zombie Story sells better god damn it",
            "On the other hand, they look kina cute, ngl",
            "Sideways, not The Last of Us.",
            "Strong chance you’re right! I wasn’t aware of that species or its behaviors. Cool either way. You have my upvote.",
            "where can I got more information about their behavior? ",
            "[Toxoplasma gondii](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2526137/) - “cat parasite” I think you’re talking about. It’s got some really interesting research on it, [toxoplasmosis](https://www.ejog.org/article/S0301-2115(20)30632-1/abstract) - why pregnant women shouldn’t clean the litter box.",
            "[removed]",
            "The fun part is they were just straight up wrong, and the actual answer got less than 1/10th the upvotes.\n\nhttps://www.reddit.com/r/biology/comments/1dkr5z8/why_are_all_these_snails_aggregated_on_top_of/l9k2u75/\n\nTruly, the intelligence of Reddit.",
            "hive mindisch isn't it?",
            "We need to set up the reddit hive mind versus LLMs (i.e. Chatgpt 4) challenge. \n\nI bet AI would get trounced.",
            "You already did that as a babe inside your mom.",
            "What you think the chemtrails are for? (Besides gay frogs, I mean)",
            "Just look at their eye stalks. The parasites live in the eyestalks and are quite visible in the later stages.",
            "Evolution and time can do amazing things!",
            "That may be a fair analysis. I remembered the parasite well, but the specifics of it I was less sure of - which is why I said it was a guess. Another commenter stated that there is a species of snail that exhibit this behavior, which might be a better hypothesis.",
            "Yeah",
            "????",
            "Haven't heard that song in years! Will spin it now.",
            "It's scary how many of them were infected",
            "Gross",
            "Snail? Is that you?",
            "They fill up with water so yeah",
            "Especially in summer around Warsaw.",
            "Hit me. What's the worse",
            "Who are you talking about?",
            "Maybe…",
            "That's what they want you to think!",
            "there are zombie snails tho!",
            "Sounds like some robert sapolsky stuff",
            "The messiahhhhhhh !!!! The lisan al kahib!!!! Please.... sleep with my wife...gift us with a genius messiah child... we are but peasants...",
            "Ya some Rick and morty stuff",
            "Ugh gives me the creeps 😭",
            "There's a great cover by Elohim and AWOLNATION that definitely deserves a listen at the same time!",
            "Link? I wanna listen too lol",
            "As someone with daddy issues, I take offense to that  and challenge you to a dance off.",
            "I just thought you should know, I am definitely NOT a snail",
            "For humans look up Schistosomiasis, or Angiostrongylus cantonensis, also known as Rat Lungworm…. Or human ocular angiostrongyliasis… where the worms (technically nematodes) invade your eyes…. All share the snail as a host.",
            "Thanks a lot for asking buddy. Are you new here or something?",
            "If it is a parasite, why do they go to the same place, or is this a hive mind?",
            "Why not a family of napping zombie snails?",
            "they can survive from it! ....if birds only eat eyes",
            "Awesome! Those guys are amazing, thanks for the suggestion!",
            "Play both songs simultaneously? Will give it a shot.",
            "Flagpole Sitta by Harvey Danger",
            "The gross part is the insinuation that someone has to have daddy issues to be a pole dancer. Do better.",
            "[This](https://amp.cnn.com/cnn/2018/11/05/health/man-dies-after-eating-slug-on-dare) poor kid ate a snail on a dare and was infected with Rat Lungworm. Horrific.",
            "This is some impressive stuff to just be able to rattle off.\n\nAlso evolution is insane. What are the chances a mutation causes the parasite to do/produce a chemical that somehow makes the snail want to go up into the air. Mind boggling shit.",
            "When I was about 7 an animal charity came to my school and taught us about parasites in dog poo that are tiny worms that eat your eyes, I remember them specifically saying about how easy it would be to be playing football and get these into your system if the ball rolled in dog shit and then it got on your hands..... Over 25yrs later I've been in therapy for OCD which centres around but isn't entirely based on a hygiene phobia 😂",
            "When I was a kid, my entire elementary school went through a phase for a few months where we captured snails and kept them as pets in those little solid, clear plastic pencil cases that were everywhere in the early 2000s. I’m surprised none of us caught that lmao",
            "Recently, a Young bloke here 🇦🇺 was on a footy trip and ate  a slug after a dare, he died  horribly from that same parasite. It was fucked.",
            "Dogs get lungworm from snails, too.",
            "SHITTT I know snails carry many disease like rat, but damn",
            "I've seen a YT video of this where a doctor is removing the worms from a woman's eye.",
            "SEE TALK BE EATING WEIRD SHIT AND SUDDENLY YOUR EYES ARE GONE ABSOLUTELY NOT",
            "Reminds me of when Plankton shrunk and got into SpongeBobs body and started controlling his eyes. Spooky stuff",
            "I worked in a chem/bio library for over a decade. We had all manner of reference books and periodicals. When I could, I'd read the things I checked in, or processed new. I saw things that I really wish I wouldn't have...like a prolapsed rectum and such. But I think the worst thing I saw were those dammed eyeworms. That was *decades* ago...and I still have nightmares about it (I'm exceedingly picky when it comes to my eyes). Parasitic worms are, in general, disgusting, but you can actually *see* the worms in someone's eyes.  UGH!",
            "Schistosomiasis is scary because you can get it without eating anything — it enters through your skin so all you have to do is have contact with infected water.",
            "In the tropics, where I live, they are also a host for Bhilarzia, which I just realized is the same thing as Schistosomiasis.",
            "The parasite isn't the snails. It's something else that uses something to lure the snails up high which attracts birds that eat snails. The birds then poop and the parasites lays it's eggs in the poop.  It's a type of parasitic worm I believe. I don't  mind most bugs and creepy crawlies, but parasitic worms have no redeeming value to them that I can see. Kind of like mosquitoes and roaches. Just a big nuisance that can be deadly. And it seems like there's a type of parasitic worm for every organ in our body. I use to watch that show \"Monster inside Me\" and some of those parasites they showed were really bad. We're spoiled here in the US. We really don't have that many deadly parasites compared to other parts of the world. Not as many deadly spiders or snakes either.",
            "Each snail individually seeks higher ground. This group of snails were probably nearby the base of this particular pole. Other snails further away probably climbed another pole, or a tree, or some other tall thing.",
            "I'm perfectly happy with the way I'm doing. But perhaps if you don't like someone's joke and wish to genuinely get them to change their behavior or point of view, you could try *not* finding the most condescending, least effective, and least informative way to bring that to their attention.\n\n\nIf your goal was simply to wallow in your self-perceived moral superiority, then by all means, ride off on that high horse.\n\n\nEither \"do better\" yourself, or don't bother.",
            "Tf this guy ate a slug and then had a coma for a little over a year later died?! That’s not fair… life is so not fair…",
            "I live in France. I just gagged .\n\nDoes cooking them kill them ?",
            "What a tragedy.\n\nRest in peace Sam.",
            "You don't mess with ANY Australian creature EVER",
            "Beat me to it. Forgot the title it can be easily googled.",
            "That was so sad to read",
            "But how do people eat snails as food and not get sick? Or is it a different kind of snail?",
            "Idc what anyone says, I’m NOT clicking that shit.",
            "that's kinda idiotic even for a teen",
            ">What are the chances a mutation causes the parasite to do/produce a chemical that somehow makes the snail want to go up into the air.\n\n100%, apparently.",
            "Pretty sure you can’t catch a parasite from just being in the proximity of too many snails, you gotta eat them. So I’m not surprised lol",
            "Omg! We did that too but with caterpillars.  I made my mom buy me a sanrio pencil box just for a pet caterpillar.  It died. Kids are dumb.",
            "Your joke wasn’t funny because it was misogynistic. You are a misogynist, in 2024, and I genuinely don’t believe you’re capable of change.",
            "Yup and did you read that crustaceans can carry it too ? As well as vegetables that aren’t washed?  FUCK. That.",
            "When you realize you ate a slug,      \nyou may as well just give up.      \nYou're outta luck.      \nYou ate the yuck.      \nNow you're fucked.",
            "well don't eat live slugs. that's not cool for the slugs",
            "Life was fair enough for him to make it all the way through the evolutionary process to be born and exist.",
            "He lived for 10 years with the disease",
            "He randomly decided to be cruel to an animal for no reason whatsoever.\n\nI'm not saying he deserved it, but he wasn't exactly being a paragon of virtue.",
            "As long as you cook your fish and snails and wash your vegetables you should be fine. Cooking DEFINITELY kills them. Cooking kills everything provided you do it right. (Though in some cases, toxins produced remain. But the lungworm doesn't put toxins on food..)",
            "Including drunken teenagers who like to throw out gross dares.",
            "Iirc it’s a different kind. Escargot for example is typically prepared with sea snails. As for other countries such as Vietnam I don’t know if they use “garden snails” or some special snail.",
            "I licked a slug once because my 4th grade teacher told our entire class it would make your tongue go numb and I was the only one who volunteered (to be the clown). This was an adult telling a group of 30 ten year olds to try it out.\n\nIt did make my tongue go numb.",
            "Nah, it's 50%, either they do it or they don't.",
            "Repeated over millions of times it becomes more likely if it is advantageous…selection for the ones that increase the likelihood of further spreading",
            "I just can’t believe that in a school of hundreds of kids age 4-10 digging in the dirt, no one ate a snail lmao",
            "My sister left her pencil case with the snail in it in the sun one time. We found it after coming back from a walk. I’ll never forget that smell 🥲",
            "[removed]",
            "Thank you for convincing me to wash vegetables and fruits",
            "Thanks for giving me the reason I needed to not eat vegetable",
            "Works need to stop doing that to our wildlife!!!! D:<",
            "Yup.  We basically should never eat food grown here without cooking or freezing it.",
            "Most of the time it won't go into your brain though but pass via the stool. And if it does go into the brain it normally gives much much less severe symptons.\n\n\nHe just seemingly got as unlucky as he could.",
            "I always boil the fuck out of my veggies",
            "I'm never eating vegetables again!!",
            "Wtf bro now, I'm scared to eat crabs😭",
            "I ain't eating salad anymore",
            "Fun fact: humans historically got vitamin B12 primarily from unwashed veggies. Our gut also biomes depend on unwashed veggies. Now we need artificial sources because we're afraid of pesticides and parasites.",
            "It’s not. I’ll admit I do feel bad for snails and slugs since they seem to have a rough life themselves",
            "It said 10 years?! So one and a half of that year he was ina  coma? 😭",
            "The article I read said fish don’t pass it. Crustaceans do though.",
            ">Cooking kills everything provided you do it right.\n\nB. cereus spores in rice aren't killed by cooking.",
            "Prions are the exception to the ‘cooking kills everything’ rule. An autoclave doesn’t even do it iirc. \n\nYou can’t cook out mad cow but you can cook out rabies.",
            "Cooking everything \"right\" kills everything including flavor.",
            "I imagine they probably farm the snails too rather than just grabbing them off the floor. Or at least I hope so",
            "Fair enough!",
            "Always wash vegetables.\n\nThe reason you often hear about lettuce containing E coli is because they use manure to fertilize it.\n\nYour vegetables are literally covered in shit.",
            "There's an ecoli break out in Britain, and the source is lettuce. It's always lettuce, so wash it even if it's in a bag that tells you it's been washed.",
            "Well, depending on your view a cherry is either a fruit or a berry so I think you’re good.",
            "That explains why in the post next to it there was a cluster of carrots...",
            "I can’t remember the last time I washed my grapes or cherries…",
            "Almost like bugs live on them.",
            "and snails",
            "Yeah, I saw that, I wonder what the defining factor is or the fine line I should say, between basically having symptoms like a cold or death",
            "Mmmmm…boiled salad",
            "Dude I know and I have a huge garden !!!",
            "you are right. All animals have a hard time now.",
            "Yeah he ate the slug at 19 and eventually died at 29 years old. Completely ruined his life, the poor guy. Rough stuff.",
            "Well it's always nice to cook your fish.."
        ]
    },
    "Why are the nucleobases in DNA/RNA all pyrimidine or purine derivatives? ": {
        "title": "Why are the nucleobases in DNA/RNA all pyrimidine or purine derivatives? ",
        "score": 9,
        "url": "https://www.reddit.com/r/biology/comments/1dlrlxt/why_are_the_nucleobases_in_dnarna_all_pyrimidine/",
        "content": "Without considering base modifications, why are A, T, C, G, and U all composed of pyrimidine or purine rings? What process selected for and enriched these compounds before life began, and do they have biological advantages over other molecules? ",
        "num_comments": 3,
        "comments": [
            "Purine/Pyrimidine bases are chemically stable and possess planar, aromatic structures. This planarity allows them to stack efficiently within the double-helix structure of DNA, which contributes significantly to the molecule's overall stability. The specific arrangement of atoms in pyrimidines and purines promotes the precise hydrogen bonding between complementary bases, which is obviously useful when you are encoding information molecularly.\n\nFrom a prebiotic chemistry perspective, studies suggest that purines and pyrimidines could form readily under early Earth conditions. Experiments simulating these conditions have shown that these nucleobases can be synthesized from simple molecules like hydrogen cyanide and ammonia. The chemical pathways leading to their formation involve relatively straightforward reactions, making them more likely to accumulate in the prebiotic environment.\n\nBiologically, the specific hydrogen-bonding patterns allow for reliable molecular recognition for the accurate replication of genetic material. The hydrogen bonding between purines and pyrimidines also contributes to a stable double-helix structure, which can tolerate minor changes without catastrophic consequences. Also, these bases absorb some ultraviolet light, offering protection against the UV radiation on early Earth.\n\nOver time, the chemical properties of purines and pyrimidines likely led to their selection and enrichment in the primordial soup. Their stability, ability to form hydrogen bonds, and participation in critical biological processes would have made them favorable for early life forms. Also, these bases are multifunctional, not only as building blocks of DNA and RNA but also in cellular metabolism (e.g., ATP, GTP et cetera), which may have contributed to their evolutionary selection.",
            "Outstanding reply!",
            "I have heard that there are alternative molecules to purines and pyrimidines. But the explanation above is just about right. Hydrogen bonding, flat structure, easy to form under prebiotic conditions. Hydrogen bonding is essential for molecule reproduction. They have to have been chosen for ATP and RNA etc. before the DNA double helix appeared."
        ]
    },
    "Criteria for Parasitism?": {
        "title": "Criteria for Parasitism?",
        "score": 5,
        "url": "https://www.reddit.com/r/biology/comments/1dlruuu/criteria_for_parasitism/",
        "content": "A female mosquito depends on human host as it needs the blood for reproductive purposes, but it's not considered a parasite for humans. This seems to fall under the explanation that a mosquito doesn't directly depend on the human for nutritional needs. \n\nBut then on the other hand, a cuckoo lays its eggs on the nest of a crow, making them lay its eggs. This phenomenon is considered to be Parasitism - Brood Parasitism. But in this case, the cuckoo is not depending on the crow for nutritional needs.\n\nIf looked upon from a survival aspect, they're both on the same page because as a species their survival is dependent on the 'host' (human and crow). But neither the survival of an individual mosquito nor of a cuckoo is directly depending on this interaction.\n\nThen how come Brood Parasitism fall under Parasitism while the interaction between female mosquitoes and humans doesn't?",
        "num_comments": 19,
        "comments": [
            "Quoted:\n\n>\"The female mosquito is not considered as a parasite because it needs blood for reproduction and not for nutrition. Human blood is required for the nourishment of their offspring. A parasite is an organism that depends on other host organisms for its survival\"",
            "mosquito is considered a “micropredator”, a category which sometimes falls under parasitism. A parasitism itself is broad term with many definitions, apart from the obvious parasites like fleas or tapeworms there’s parasitic plants, facultative parasites, parasitoids or, as you have mentioned, brood parasitism. Cuckoos are considered parasites, because they “steal” resources from other organism (i. e. another bird). Mosquitos are considered micropredators, because they do not kill their host/prey. Both of these interactions can be described as parasitism, because they meet the definition of parasitism, i.e. taking advantage of another species and causing it harm in the process.",
            "I think a better question is why are you not counting mosquitoes as a parasite. Remember parasitism is the relationship between the two, specifically it is where one benefits and one is harmed. If the host wasn’t harmed it would be commensalism, and if both benefit that is mutualism.\n\n Cost can be a lot of things. It can also be behavioral like brood parasitism. But blood is a cost. Time and energy spent raising another species is cost. And the parasite gains from it",
            "That way an individual cuckoo is not depending on the crow for its survival rather the upbringing of its progeny and hatching of its eggs, how does that fall under Parasitism?",
            "I agree. However, the book I have to strictly adhere to (a textbook from NCERT) directly denies mosquitoes as a parasite while acknowledging Brood Parasitism in the same paragraph. I guess I'll have to just follow that.",
            "Exactly, I'd actually ask that question but the book I have to strictly adhere to directly denies mosquitoes as parasites while counting cuckoos as one in the same paragraph. That's why I framed the question that way. \n\nI agree with your point there and that's my initial thought process.",
            "It does, and when the chick hatches before the other chicks, he will try to get rid of their eggs or the poor chick to get as much food as possible.\n\nAnd because it is a large bird compared to those who feed it, it will consume more food than the parents can provide.\n\nA very obnoxious bird",
            "Wow lol I saw you said it is NCERT. I wonder who approved the book. Though living in the US and seeing how political government approved educational material are here makes me side eye it a bit",
            "But with respect to the cuckoo parent who left the egg there, that parent isn't depending on the crow for their survival. Similar to how the mother mosquito is not dependent on human blood for nutrition and survival.",
            "Oh well I can't do anything about it, such things are here and there everywhere but exams like NEET strictly follow this book, although that exam is questionable at this point as well. Gotta do the way it is ig.",
            "Well the parasite is cuckoo chicks\nThus, these birds became considered parasitic",
            "Then why isn't the larvae of the female mosquito considered as parasitic?",
            "Because mosquito larvae live in water and not in our bodies and do not feed on us, the female mosquito only sucks our blood because the blood components help in the formation of mosquito eggs, and not in order to feed on us.",
            "The female mosquito takes the blood to help the larvae survive, and that can cause us harm if we get infected by something. So that's a + - relationship and where one species is getting help with survival (the mosquito in unhatched state).",
            "This is a good point, but in reality it is difficult to define anything and is often confusing to scientists and may change",
            "It's viruses and bacteria that live in the mosquito that cause infection, not the mosquito itself.",
            "I do know that however the fact that the pathogens are infecting humans is resultant of the behaviour of the mosquito, the blood sucking one."
        ]
    },
    "Why do hybrid fish often grow faster?": {
        "title": "Why do hybrid fish often grow faster?",
        "score": 4,
        "url": "https://www.reddit.com/r/biology/comments/1dlqdur/why_do_hybrid_fish_often_grow_faster/",
        "content": "Tiger Trout, Tiger Muskie, Hybrid Blue Catfish, Hybrid Sunfish, Hybrid Tilapia, Hybrid Dentex... These fish hybrids are unrelated and are produced in different parts of the world but they all grow faster than their non hybrid counterparts. Why?",
        "num_comments": 3,
        "comments": [
            "I don’t know the exact mechanisms underlying this. But what you’re describing is heterosis (hybrid vigor). Might be worth checking out the wikipedia page \n\nhttps://en.m.wikipedia.org/wiki/Heterosis",
            "Hybrid vigour is a thing in plants, maybe it works in fish too.",
            "Thanks"
        ]
    }
}